{"title": "$TSLA Daily Investor Discussion - March 31, 2020", "selftext": "\nThis thread is to comment on daily $TSLA movements, as well as any short-term trading around it (in fact, such discussions will only be allowed in these daily threads).  For discussions about news/thoughts/opinions about $TSLA and/or Tesla as a business, please check out our Weekly thread(s). This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "fs93r7", "created_utc": 1585642535.0, "score": 22, "upvote_ratio": 0.92, "num_comments": 431, "comments": [{"body": "I jumped in and bought 6 shares at $500 yesterday because I missed the $400~ train. Was my first investment ever. Could still go down but I followed the teachings of the great Michael Scott on intuition in the Scotts Tots episode.", "score": 24, "replies": [{"body": "“You miss 100% of the shots you don’t take. -Wayne Gretzky”\n\n-Michael Scott", "score": 15, "replies": []}, {"body": "Building a portfolio you're proud of is more important than your entry price point. There are always opportunities to get shares at a discount on the long term.", "score": 8, "replies": [{"body": "Proud of lmao. I’m not sure you know what investment is supposed to be.", "score": -3, "replies": []}]}, {"body": "Share went down to 500 yesterday?", "score": 0, "replies": [{"body": "Yeah in the morning, it went to 498, then went up gradually to 515 or so. It made its way back down to 500 and I snatched it.", "score": 2, "replies": []}]}]}, {"body": "The general expectations of poor delivery numbers reminds me of the expectation that Tesla would report negative earnings Q3 2019. Big surprise, even bigger increase in SP.\n\nKinda weird, IMO, that the majority here believe deliveries will be less than 90k when the \"Millionth Tesla\" tweet came out weeks ago causing many to do subtractive math figuring out production numbers somewhere between 95,000-101,000 at the time. Production carried on another week or so in Fremont and China still produced vehicles, all while inventory shows less than 7,000 vehicles worldwide and deliveries continuing dispite factory closure.\n\nI'm not downgrading anybody's opinion, but I would like to hear some level headed arguments of why some think deliveries will be <90k units. The numbers just don't add up.\n\nEdit: of those 7,000 vehicles in inventory, many are used vehicles and do not count towards undelivered production.", "score": 13, "replies": [{"body": "Shhh.  I stopped talking about that tweet.  Just buy\\*.  :)\n\n&#x200B;\n\n\"\\*\" not investment advice", "score": 7, "replies": []}, {"body": "Not an answer to your question, but it's not Q1 I'm thinking about. I'm sure Q1 is just fine. Q2 and up are where my thoughts are. Maybe others are thinking likewise at this point.", "score": 3, "replies": [{"body": "Q2 will depend greatly on how soon the factory reopens and how well China does. I'm willing to bet there is extra pressure on the China ramping and battery supply.", "score": 2, "replies": [{"body": "It will be a true test to Tesla's demand. If they can sell out all their cars during a recession (assuming they resume sooner than the economy/consumer confidence), it will be great news for the company and the stock. If they can't I think it will hit the stock price quite a bit.", "score": 1, "replies": [{"body": "We are at least two quarters away from an actual recession. GDP growth has to be net negative for two consecutive quarters to be an official recession, and Q4 2019 was flat (not negative). There's a chance it will be negative for Q1 2020, and an even more chance for Q2 2020, but we will see.", "score": 1, "replies": [{"body": "Hence my parenthesis, but at this point I can't see Q1 and Q2 not having negative GDP growth. Also, FWIW this definition of recession is not unilaterally recognized, on Investopedia :\n\n>However, the National Bureau of Economic Research ([NBER](https://www.nber.org/)), which officially declares recessions, says1﻿ the two consecutive quarters of decline in real GDP are not how it is defined anymore. The NBER defines a recession as a significant decline in economic activity spread across the economy, lasting more than a few months, normally visible in real GDP, real income, employment, industrial production, and wholesale-retail sales.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla was at 921K vehicles produced at the end of Q4", "score": 2, "replies": [{"body": "Where does that number come from? I saw multiple reports but never this number. The lowest Q1 production number at 1 million cars I saw was 89k. Your number would suggest 10,000 less than this", "score": 1, "replies": [{"body": "I got it from Tesla Daily, and I normally trust his numbers\n\nLink: https://youtu.be/d1X8V3QVSu0\n\nEdit : excuse me, 919K.", "score": 2, "replies": [{"body": "Thanks for sharing. I looked into this further and came across a [comment](https://www.reddit.com/r/teslamotors/comments/fg6smp/elon_congratulations_tesla_team_on_making_our/fk3fqt5?utm_medium=android_app&utm_source=share) on TM that does a really good job explaining things and paints a clearer picture.", "score": 2, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "**despite cancellations inventory number is still less than 7,000**", "score": 2, "replies": []}]}]}, {"body": "This almost feels like a normal day for Tesla", "score": 12, "replies": [{"body": "Remember when it jumped from 550 to 680, i remember", "score": 11, "replies": [{"body": "Pepperidge Farm remembers", "score": 5, "replies": []}, {"body": "Member ?", "score": 4, "replies": [{"body": "I don't remember, I member.", "score": 1, "replies": [{"body": "Yeah you member, member ?", "score": 4, "replies": [{"body": "I member.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "CREDIT SUISSES REVISES TESLA 1Q  DELIVERIES DOWN TO ~75-80K UNITS FROM 94K\n$TSLA", "score": 11, "replies": [{"body": "Well that’s going to make it easier to beat expectations", "score": 14, "replies": []}, {"body": "I’d be surprised if Q1 deliveries were that low.", "score": 2, "replies": []}]}, {"body": "https://www.reuters.com/article/us-health-coronavirus-tesla/tesla-plans-to-supply-fda-approved-ventilators-free-of-cost-musk-idUSKBN21I2KX\n\nElon giving away all these ventilators (great by the way) gives me some level of confidence that he’s not terribly worried about cash eh?", "score": 9, "replies": [{"body": "if it saves lives it saves lives, may cost us some in the short run but worth the PR", "score": 12, "replies": [{"body": "Completely agree.", "score": 5, "replies": []}]}]}, {"body": "I personally know two people that would have taken delivery of a Model Y this month but decided to wait out of uncertainty of keeping their job. I have every bit of confidence in the long term with Tesla (exactly why I haven't sold any chairs) but seeing something like this happen in my personal circle makes me somewhat hesitant in the short term.\n\nI see this as a win-win though. If I'm wrong, my chairs will be happy. If I'm right, I will buy some more :)", "score": 12, "replies": [{"body": "We took delivery of our Model Y today. It was pretty busy. Mostly 3’s though. One other Model Y and two Model S’s just while we were there. Schaumburg, IL.", "score": 8, "replies": [{"body": "Congrats! One of the two people I mentioned above is my fiance so I can't wait for her to take delivery after this whole thing is behind us :)", "score": 1, "replies": [{"body": "Thanks. We decided to move ahead with the purchase after some consideration. We both have relatively safe, good paying jobs in an environment like this and we own our house. I absolutely understand the decision to delay purchasing an experience vehicle right now. There is just a lot of uncertainty about the length and depth of this recession.", "score": 3, "replies": []}]}]}, {"body": "FWIW, I ordered mine on announcement day and I'm still waiting.", "score": 3, "replies": []}, {"body": "This is my thinking as well. I expected to see a small boom once we get past all the virus uncertainty.", "score": 1, "replies": [{"body": "You're thinking that there'll be some pent-up demand coming in the later half of this year (assuming things are under control in a couple of months)?", "score": 1, "replies": [{"body": "At least that’s what I’m hoping.", "score": 1, "replies": [{"body": "Me too.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I’m waiting for it too that’s weird", "score": 3, "replies": []}, {"body": "The mods are scared I guess. Something’s telling me that today will be a blood bath across all stocks.   The pre market is just red everywhere.", "score": -7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Maybe it's a special date today? Or the AutoMod scripting broke.", "score": 1, "replies": [{"body": "April fools!", "score": 4, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "So much less stressful to set and forget and not drive yourself crazy.", "score": 9, "replies": []}, {"body": "Wouldn’t be a bad idea to buy a put before deliveries are released or sell maybe like 1/3 of your holdings. My personal opinion is that we’re going into earnings season and macro is going to get ugly", "score": 3, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}]}, {"body": "Well, somehow it hurts more seeing SP go up after I sold some shares, then seeing it go down after I bought shares. : \\\\  Also, feels weird to be rooting for the price to go back down lol.", "score": 8, "replies": [{"body": "Yeah, I was in that boat last week - I literally didn't sleep some nights. I entered back in at 513, going to average down now", "score": 3, "replies": []}, {"body": "Same here. I am salivating at those **$360** prices a few weeks ago and kicking myself for not investing.\n\nNow I'm thinking the same thing about $540. What if it never goes down again?\n\nLet's play this out: low delivery numbers are probably priced into the stock already.\n\nWhat (realistic) scenarios could cause the price to plunge again?", "score": 5, "replies": [{"body": "> What (realistic) scenarios could cause the price to plunge again?\n\nA pandemic taking millions of lives globally and crippling the global economy?", "score": 3, "replies": [{"body": "Didn't that already happen? Seems the market response was to shrug it off and brush dirt of its shoulder.", "score": 1, "replies": [{"body": "Nope. That has not happened yet, but it will, and though a 30% fall in as many days is not a shrug (steeper than the great depression), I suspect there is more to come as the reality sets in and the US belatedly shuts down entirely.", "score": 1, "replies": [{"body": "It is possible what you say will happen. What timeframe do you put on that happening? And how long before we climb out of the hole?", "score": 1, "replies": [{"body": "Well the US is approaching 200k cases, most of which are probably symptomatic and serious, many other countries are just at the start of this curve (hence the millions global figure), for the US deaths will really start to get serious in a week or two, they think maybe peak late April - I imagine max panic will be next month too (April). I do expect us to recover quickly from the recession unless second order effects drag us into depression. Don't see any long term problem for Tesla unless that happens, but the short term will be painful.", "score": 1, "replies": [{"body": "Why would maximum panic be after peak deaths?", "score": 1, "replies": [{"body": "I was saying peak death rate next month ergo max panic next month at the same time. I don't think the market has priced in 200k US deaths yet. Maybe I'm wrong and the market is more rational and long term than I think.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I am not sure if we will see $360 again but $450 is very possible, the states that has 200 cases starts to blow up, then all bets are off. At the moment the the market is base on the China recovery time line, if it is not the case then a new bottom will be formed.", "score": 2, "replies": []}, {"body": "I'm thinking Q2 and Q3 demand may be low due to extended economic fuckery by the government + oil industry collapsing.\n\nAlso battery supply seems at risk of being constrained due to possible repeated shutdowns.\n\nMostly I trust that all the non Asian governments in all their incompetence combined with the Politically Correct mindset of the citizens are going to continue to damage the economy in the name of saving lives.\n\nEdit: I don't think low delivery numbers are fully priced in yet.  I think chance/risk of low delivery numbers is priced in.  If low numbers come in for the next few quarters I think there will be a slight move down in SP.", "score": 3, "replies": [{"body": "Interesting. Can you say more about the oil industry collapsing? Wouldn't that make EVs even more attractive?", "score": 1, "replies": [{"body": "Long term yes; short term it means job loss and economic down turn.\n\nEdit: I don't know that the oil industry is collapsing.  I am speculating that it will now that oil prices have fallen to $20/barrel and US/Canadian oil production requires higher prices to produce at profit.", "score": 2, "replies": [{"body": "Ah I see. If gas prices remain depressed, I could see short-term thinkers (meaning the majority of the population) start ramping up demand for gas guzzlers, which could look bad for Tesla.", "score": 2, "replies": [{"body": "I don't think gas price is a big deciding metric for someone looking at a Tesla.  Maybe people who buy a Nissan Leaf or Chevy Bolt; Tesla cars though have so much else going for them.", "score": 3, "replies": []}]}]}]}]}, {"body": "its all about macros right now really", "score": 1, "replies": [{"body": "It seems that Tesla has been outperforming the recent plunge, no? (Relative to the rest of the market.)", "score": 1, "replies": [{"body": "If you look back 2-3 weeks back they got hit harder than most early on into the dip. Just looking now like the bounced back and normalized off of that sharp fall moreso than some others", "score": 1, "replies": [{"body": "Maybe that harder initial hit priced in advanced thought about the negative news coming. Which goes back to my original question about what would (realistically) cause Tesla to plunge? I suppose a better question, what would cause them to plunge separately from the wider market?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Sold some 2021 options, will buy some 2022 ones on next down trend.", "score": 5, "replies": [{"body": "This is the way", "score": 3, "replies": []}, {"body": "What options did you sell?", "score": 1, "replies": []}]}, {"body": "no new FSD update, saving the deferred revenues for q2, good choice.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "From the fact that the auto stop at signs/lights is still in early release and there's only a few hours left in the quarter.", "score": 3, "replies": []}]}, {"body": "Tells me this quarter is fine. But they think q2 May need all the help.", "score": 1, "replies": []}]}, {"body": "TSLA off to a great start! G'night y'all.", "score": 5, "replies": []}, {"body": "any reason for being up PM?", "score": 4, "replies": [{"body": "A large meerkat in the kalahari sneezed and shat out some cobalt", "score": 14, "replies": [{"body": "> A large meerkat in the kalahari sneezed and shat out some cobalt\n\nNah, that's a clear TSLA negative:\n\n> **Reuters:** \"Tesla analysts are concerned about negative impact to Tesla sales in the Kalahari region\"\n>\n> **Bloomberg:** \"As global cobalt prices collapse, Tesla's cobalt free battery lead evaporates in fiery cobalt meteor impact\"\n>\n> **Plainshite:** \"Breaking news: here you can download the notarized fake documents that prove that Elon Musk invested into meerkat research in a secret lab located in the Kalahari. (As a complimentary service your download IPs and account email registrations will not be used against you if you are a Tesla short.)\"", "score": 5, "replies": [{"body": ">notarized fake documents\n\nThat's a fairly serious allegation: Can you point out a single time that Plainsite has ever lied about the authenticity of a document?", "score": -8, "replies": [{"body": "> That's a fairly serious allegation\n\nDude, that was obvious parody, I have no idea whether Plainshite is posting forged documents, I only know that Aaron Greenspan has sued Facebook claiming that *he* invented Facebook:\n\n> https://en.wikipedia.org/wiki/Criticism_of_Facebook#Aaron_Greenspan\n\nIn other funny moments:\n\n> \"Greenspan later sued Square, Inc for patent infringement, claiming Square's COO stole the idea for Square Cash from him and that he had patented transferring money online. The court found that his claims were not patentable.\"\n\nLOL ...", "score": 10, "replies": [{"body": ">Dude, that was obvious parody\n\nAh, so it's fine for you to straight up lie about what the people you disagree with do, then.", "score": -9, "replies": [{"body": "Remove that thing from your butt.\n\nUnless of course you believe these ones did happen:\n\n> Reuters: \"Tesla analysts are concerned about negative impact to Tesla sales in the Kalahari region\"\n\n> Bloomberg: \"As global cobalt prices collapse, Tesla's cobalt free battery lead evaporates in fiery cobalt meteor impact\"", "score": 3, "replies": [{"body": "If you can't see the difference between saying that Reuters and Bloomberg will write articles that are disfavorable to Tesla and saying that an organisation dedicated to public records requests will lie about the authenticity of documents, then you should probably go back to school.", "score": 0, "replies": [{"body": "\"Tesla analysts are concerned about negative impact to **Tesla sales in the Kalahari region**\" is FAKE, it never happened. OP wrote it as a joke/to make their point.\n\nPlainsite \"posting fake documents\" is FAKE, it never happened. OP wrote it as a joke/to make their point.\n\nIf you keep posting moronic stuff please let me know to downvote you without reading that crap.", "score": 1, "replies": [{"body": ">\"Tesla analysts are concerned about negative impact to Tesla sales in the Kalahari region\" is FAKE, it never happened. OP wrote it as a joke/to make their point.\n\nThat *specific* headline never happened. There is a class of articles which many around here would argue that such a hypothetical article belongs to. The idea that Reuters and Bloomberg would post such a thing is a joke *because* it plays off other like events.\n\nPlainsite posting fake documents has never happened. Ever. There is no set of events to which that could plausibly belong, because it's a completely false allegation.\n\nIf you think that those two are equivalent, then your reading comprehension is beyond awful and I'd appreciate if you never wasted my time again.", "score": 1, "replies": [{"body": "First of all, how do you know Plainsite has never posted fake documents? Ever!?\n\nSure, we (I) don't know of any such incidents but you speak like you have proof of something no one has ever proven.\n\nAs for the word \"fake\" in OP's joke, it was so insignificant that removing it wouldn't change anything but your fragile little ego can't take it and I thoroughly enjoy it. In fact, your reaction reminds me of the navy seal copypasta, so thanks for the laughs!", "score": 1, "replies": [{"body": ">First of all, how do you know Plainsite has never posted fake documents? Ever!?\n\nBecause you and u/__tesla__ would never shut up about it if it had happened. And it would be known to happen, because people use the service that they provide.\n\n>but you speak like you have proof of something no one has ever proven.\n\nIt is not possible to prove a negative. It is possible to have evidence for a negative, however, and all of the evidence says that Plainsite has never posted fraudulent documents.\n\n>As for the word \"fake\" in OP's joke\n\nIt's not a joke. I've already explained why. But since your reading comprehension is beyond awful, here's a more explicit explanation: Jokes require there to be some familiarity with a subject that is then subverted in a way that brings about humor. Me saying \"u/__tesla__ is bald\" is not a joke, because neither of us know what their hair situation looks like.\n\n>but your fragile little ego can't take it and I thoroughly enjoy it.\n\nMe too, thanks.", "score": 1, "replies": [{"body": "There are countless examples of erroneous/fraudulent content, research, etc that's been used for ages because no one ever looked into it so that doesn't prove anything.\n\n(Recent bugs in Linux kernels (some have been there for well over a decade) that thousands of people have used/audited is one of the best examples you can find.)\n\nPlainsite is a finite collection of documents, therefore it's absolutely possible to prove it. There's little to no point doing it but if you want you can.\n\nA claim about meerkats shitting Cobalt which affects Tesla's sales, leads to a meteor strike and ends with the revelation Musk was funding a secret meerkat lab in the area is totally possible but Plainsite (run by someone actually on a crusade) posting fake documents is totally out of the question?\n\nMate you are triggered to a retarded degree.", "score": 1, "replies": [{"body": ">Plainsite is a finite collection of documents, therefore it's absolutely possible to prove it.\n\nNo. Because what you're asking me to prove is that they have *never* done it, not that there is nothing currently up for download that is false.\n\n>A claim about meerkats shitting Cobalt which affects Tesla's sales, leads to a meteor strike and ends with the revelation Musk was funding a secret meerkat lab in the area is totally possible\n\nI'm running out of ways to describe how terrible your reading comprehension is:\n\n>That *specific* headline never happened. There is a class of articles which many around here would argue that such a hypothetical article belongs to. The idea that Reuters and Bloomberg would post such a thing is a joke because it plays off other like events.\n\nYou are not capable of participating in this conversation in a meaningful way.", "score": 1, "replies": [{"body": "Please tell me your claim here isn't that \"Musk funding a secret meerkat lab\" is more probable than \"Plainsite posting fake documents\".", "score": 1, "replies": [{"body": ">Please tell me your claim here isn't that \"Musk funding a secret meerkat lab\"\n\nLiterally not my claim. Here we go, maybe you'll read it the fifth time:\n\n>That *specific* headline never happened. There is a class of articles which many around here would argue that such a hypothetical article belongs to. The idea that Reuters and Bloomberg would post such a thing is a joke because it plays off other like events.\n\nI'm pretty certain that you won't understand it, because you are apparently incapable of understanding what you read.", "score": 1, "replies": [{"body": "Is \"Musk funding a secret meerkat lab\" more probable than \"Plainsite posting fake documents\"?", "score": 1, "replies": [{"body": ">That specific headline never happened. There is a class of articles which many around here would argue that such a hypothetical article belongs to. The idea that Reuters and Bloomberg would post such a thing is a joke because it plays off other like events.\n\nWhy won't it *read?*", "score": 1, "replies": [{"body": "Yes or no?", "score": 1, "replies": [{"body": "Or. Go take a reading comprehension class and stop being useless.", "score": 1, "replies": [{"body": "Yes or no?", "score": 1, "replies": [{"body": "See above.", "score": 1, "replies": [{"body": "Yes or no?", "score": 1, "replies": [{"body": "I already answered this question: Yes, you are incapable of participating in the discussion. Read a book.", "score": 1, "replies": [{"body": "Yes or no?", "score": 1, "replies": [{"body": "Remember when you weren't too much of an idiot to read a sentence?\n\nMe neither.", "score": 1, "replies": [{"body": "Yes or no?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Are you a real burrito?  If not then you, sir burrito, are a liar!!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "> any reason for being up PM?\n\nGoing to sleep at noon is a bit early, isn't it?\n\nTSLA might be up due to various forces typical before key events like Q1 deliveries: shorts deleveraging, longs leveraging up, and macro indices are supportive as well. This week's trading has been pretty low volume.\n\nI'd expect the usual FUD hit-pieces over the next two days until the delivery report, from the usual suspects:\n\n- Any juicy stories about Covid infections by Russ \"TSLAQ supporter\" Mitchell?\n- Random made up lies by Lora \"Chanos BFF\" Kolodny perhaps?\n- Any false stories by Linette \"GF3 is just a mud field, not gonna happen\" Lopez?\n- Dana Hull has been a disappointment lately, she even tweeted something that could in principle be read as a positive for Tesla. She might let the pendulum swing back towards the TSLAQ side though.\n\nOr are they all preparing the \"Tesla Q1 deliveries crash and burn, car industry experts have no idea why but it's very concerning\" articles already? 🤠", "score": 17, "replies": []}, {"body": "Just catching up that's all.", "score": 1, "replies": []}]}, {"body": "Any reason in particular for this rise?", "score": 5, "replies": [{"body": "I have a suspicion the revised delivery estimate from Credit Suisse is doing it. People know the numbers won't be peachy but the lowered expectations are easier to beat. It's shady world where the stock moves on beating consensus when people can change consensus to fit their narrative whenever they want but hey I'm not complaining today lol.", "score": 9, "replies": [{"body": "Dunno, feels like something else than Q1 speculation based on Credit Suisse who has a horrible TSLA track record, price action is too decisive. This is institutional investors I think.\n\nUnless people took Credit Suisse's Q1 warning as a reliable contrarian indicator.", "score": 2, "replies": [{"body": "GIGATEX?", "score": 2, "replies": []}, {"body": "Hope so.", "score": 2, "replies": []}]}, {"body": "JMP and Wedbush also revised their estimate earlier today.", "score": 2, "replies": [{"body": "Excellent, everyone lowering.", "score": 1, "replies": []}]}]}, {"body": "China extended their EV tax credit", "score": 1, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "30 minutes in and 3m volume lol. It’s average for Tesla, prob looking at 13m by end of day", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "You also put Q1 deliveries at 125k because 500/4. So...", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "They're going to repeal CAFE", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "What's that mean?", "score": 3, "replies": [{"body": "Corporate average fuel economy. It forced average mpg for each automaker and raised the targets over time. Pushing them over time to sell more fuel efficient vehicles.", "score": 3, "replies": []}]}]}, {"body": "Lol I bought $700 calls right away when he tweeted that thinking it was bullish. Going to sell them back tomorrow open", "score": 0, "replies": []}]}, {"body": "April 1 aside:\n\nQ1 doesn't matter.  Everyone knows 85-100K deliveries.  Tesla will be near making a profit, regardles of whether it falls in the red or green.   100K deliveries and GAAP profit is great, and probably gets us a 15-30% bump.  Lower end of that range probably gets us a 5% fall.\n\nQ2 is where the fight is.  Fremont and Nevada shut down.  Fremont looking like it will be closed a substantial part of Q2, and its growth markets require May production to deliver on time (unless tons of inventory left from Q1 -- which nobody expects to be the case; maybe 15-20K cars tops).\n\nQ2 has me very worried.   I can see it being catastrophic.  To offer anecdotes:  I'm a specialist physician.   My doctor parking lot is PACKED with Teslas.   Our multi-practice group announced last week most specialists aren't getting a draw again until they start making money again.  Literal zero dollar paychecks for showing up.  My wife is a partner at a 200+ attorney law firm.   They have a partner meeting tomorrow where everyone expects partner draws to be cut or eliminated and salaries to be slashed.  Her lot is also packed with Teslas.\n\nThe story being repeated nationwide.  The uppity proffessional class, the successful small businessowner class, the knowledge economy class, the middle management class.  Furloughs, pay declines, layoffs and uncertainy across the board.   That's doubly true on the coasts where TEsla's biggest market is.\n\nTesla's buyer segments aren't feeling this the worst (the retail/restaurant people), but Tesla's buyer segement is taking it very, very hard.  They've also seen their savings drop seven figures while little Jaden needs to go to college in a few years.   I just don't see a lot of people writing a 60k check.  Or signing on to a 800/mo loan when there is so much uncertainty.   They'll keep their 2014 Audi a few more years.  They'll decide they're fine with just one Tesla.\n\nAt this point, it's all but guaranteed to last until May-June (following the Wuhan/Italy/Span curves).\n\nThe stimulus doesn't really help the class of people, the upper middle of the pack, that buy Teslas.  Unemployment payoffs are great if they get fired, but it doesn't move the needle.  SBA free money is great if they need to make payroll to keep the wheels on their business, but it doesn't go to their pocket.   The Tesla buying class won't get a bailout.\n\nAll priced in already?  I think Q2 is going to be 2013 and 2018-level bad.\n\nBut we're going to pop for Q1.", "score": 15, "replies": [{"body": "Very interesting thoughts. I believe the markets are currently vastly underestimating the amount of time and draconian measures that will be needed to return to a semblance of normality. This creates a particularly dangerous environment at Tesla's current valuation and market segment. Particularly if the predictions by  experts of a second wave of  infections in the fall come true. So all in all I see massive risk and not much upside in short term for the automotive sector as a whole and Tesla's share price in particular.", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": []}, {"body": "Agreed. I'm looking at the University of Washington model that comes up with \\~84k deaths and they are presupposing that the downslope after peak deaths is as fast as the slope upward. e.g. a symmetric bell curve. I think this would be the case if perhaps the virus naturally hit its herd immunity limits but I'm not sure the assumption holds well when the decline is based entirely on suppression factors that are going to be varied up and down over time. Are they going to shut down the subway in NYC until the vaccine comes in 12 months? If not, then the population where 95% of people have yet to get immunity is little different than the 100% at the start of this.", "score": 3, "replies": []}, {"body": "I think markets just don't fall quickly.  They stay up to the point where it's entirely unreasonable that they are up and with the Fed it won't fall in a straight line.", "score": 1, "replies": []}]}, {"body": "if by july we as a country have moved past the virus to recovery then it'll be fine. If we re looking at a prolonged recession then bad news.", "score": 2, "replies": []}, {"body": ">Everyone knows 85-100K deliveries.\n\nWhere did you get that nonsensical range from? It's nowhere near delivery expectations published over the last few days:\n\n- Gali's expectations are **65k**\n- Troy's expectations **83k**\n- sub's delivery expectations are **88k**\n- FactSet expectations have come down as well.\n\nVery few are expecting 100k and even expectations of bulls are as low as 65k. So the real range is more like 65k-90k.", "score": 2, "replies": []}, {"body": "Not to lessen the impact but there’s also a small part of the medical population that’s making even more money during all this. I know travel nurses are getting offers of $5-6k a week to travel to hot spots. I saw an ad for paramedics to staff a pop up clinic in Chicago for $50/hr with $75/hr overtime.\n\nI’m lucky I’m employed surgery with an income guarantee. We stopped all elective cases but still doing urgent cases and taking er call.\n\nStay safe!", "score": 1, "replies": [{"body": "Employed / guaranteed people In academics are taking pay cuts too. \n\nMGH has led. Others are following.   U Minnesota announced a few minutes ago.  U Washington yesterday.", "score": 2, "replies": []}]}]}, {"body": "It’s crazy how Tesla is still up for the year while we’ve experienced literally the worst economic downfalls in the history of the planet. In Tesla we trust.", "score": 7, "replies": [{"body": "The tslaq crowd must be so mad.  Especially if they hedged by going long the indexes.", "score": 1, "replies": []}]}, {"body": "I have sold all of my positions yesterday, as I mentioned earlier, the current market levels are based on US recovery on China's timeline. As it is looking more and more likely that might not be the case, I think a new bottom will be formed but I don't think it will be as low as $360.", "score": 7, "replies": [{"body": "I don't know what kind of fool thinks China's timeline is reasonable for anyone else, given Europe and how the US is doing so far.  It's obvious westernized countries have a much more difficult time convincing people who are used to taking their freedom for granted to actually restrain themselves for the common good.\n\nThat has to be priced in already.\n\nIf it hasn't tanked after this last weekend, we should have a good shot at being okay.\n\nChina may have had success with their draconian lockdown, but other countries like South Korea have done a great job without going all out totalitarian.  South Korea's method takes WAY too much competence and coordination to pull off here... we should have gone national lockdown weeks ago.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, the actual situation there is hard to get at and their statements are not easy to take at face value.", "score": 1, "replies": []}]}]}, {"body": "You going to be upset when we hit 7000 after hours?", "score": 4, "replies": [{"body": "I will in fact be opening my bottle of vintage champagne to celebrate the defeat of the CV if that happens!!!", "score": 0, "replies": []}]}]}, {"body": "I like Gali but he is definitely going little nuts on the negative side.  It is as if the virus had deleted a bunch of cars. There was no reason to think there was any production issues prior to mid-late March. No way production is less than 100,000. I get lower deliveries but not to the magnitude either. Lol [https://www.youtube.com/watch?v=4LuhcEyE3KE&t=3s](https://www.youtube.com/watch?v=4LuhcEyE3KE&t=3s)", "score": 9, "replies": [{"body": "He's in NYC, anyone located at any epicenter, is looking at the world with dark smoke shaded glasses", "score": 14, "replies": []}, {"body": "Everyone is just guessing. 65k seems like a possibility. I'm guessing 70k.", "score": 4, "replies": [{"body": "I'm guessing 69420 but that's just me(me).", "score": 1, "replies": []}]}, {"body": "I feel like a lot of people canceled delivery. And with the corona maybe some cars aren’t being able to be delivered to the customer. So 65k is a possibility.", "score": 3, "replies": [{"body": "Tesla typically tries to deliver to another customer.\n\nThey can be churning though reservations  but still finding a match even if it is 5 reservations for 1 sale.\n\nNow they are trying to tee up Q2 with fewer reservations but also lower production.\n\nQ2 could be more challenging than Q1.\n\nQ1 I still expect at least 80k. Q2 we need to wait for guidance in a few areas.", "score": 1, "replies": []}]}, {"body": "Yeah 65k is extremely low. I think we ll be somewhere around 80k", "score": 2, "replies": []}, {"body": "He's just trying to lower expectations so the stock pops! 3d chess.", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Retail knows best", "score": 1, "replies": []}]}, {"body": "Yep.", "score": 0, "replies": []}]}, {"body": "I stopped watching his videos when he made his first doomsday video discussing how bad the virus was all while picking his nose and touching his face.", "score": 3, "replies": [{"body": "I also think Bitcoin true believers are the gold bugs of this generation spreading non-sense about inflationary fiat currency. Investment in a non productive asset class depending on speculation for value seems kind of far fetched to me. The gold bugs have been predicting end of us financial system for decades and...\nHe tends to be on point with Tesla but I think his other biases have crept in to how he thinks about Tesla too.", "score": 5, "replies": []}]}]}, {"body": "Bob Lutz is back on CNBC. Was wondering where he’d been hiding all this time.", "score": 3, "replies": [{"body": "The one thing we know for sure is he hasnt brushed his teeth in that time", "score": 5, "replies": []}, {"body": "What did Bobby have to say?", "score": 1, "replies": []}]}, {"body": "Gonna buy two more leaps end of day, betting the p and d numbers beat whatever the expectations are.", "score": 3, "replies": [{"body": "Yup, the consensus is being pushed down big time.", "score": 1, "replies": []}, {"body": "What strike", "score": 1, "replies": [{"body": "probably 600", "score": 2, "replies": []}]}]}, {"body": "I'm trying to buy more for quite a while now, but I missed the good opportunity and now it's only going back up, but I don't wanna FOMO...", "score": 3, "replies": [{"body": "The momentum  dilemma", "score": 2, "replies": []}, {"body": "Step away from the charts and think critically about why the stock price could go up or down in the near term.", "score": 1, "replies": []}]}, {"body": "Do we have a date for delivery numbers or just sometime this week?", "score": 3, "replies": [{"body": "thursday or friday morning", "score": 4, "replies": [{"body": "Same day as the Sandy Munro Model Y livestream teardown. Going ahead and blocking my day off", "score": 6, "replies": []}]}]}, {"body": "anyone have this article  [https://www.bloomberg.com/news/articles/2020-03-31/tesla-plant-claims-collided-with-city-seeing-public-health-risk](https://www.bloomberg.com/news/articles/2020-03-31/tesla-plant-claims-collided-with-city-seeing-public-health-risk)", "score": 3, "replies": [{"body": "How Tesla Fought to Keep Its Plant Open in a Locked-Down City\n\nMarch 31, 2020, 11:37 AM EDT\n\nCompany repeatedly said factory was essential, could stay open\n\nDocuments reveal the extent of city and county’s pushback\n\nTesla Inc.’s lone U.S. assembly plant posed a risk to public health by staying open for days in spite of San Francisco Bay area shelter-in-place orders, according to documents obtained through a California public records request.\n\nOfficials with the city of Fremont, California, told Tesla in a series of conversations over several days that its factory was not considered an essential business, and that it therefore needed to comply with an Alameda County order issued March 16. The electric-car maker announced March 19 that it would suspend production four days later.\n\nThe documents provide a more detailed glimpse of what was a contentious days-long debate between local authorities and Tesla, which sought to stay open based on how the federal government defines critical infrastructure sectors. Fremont’s police chief, the deputy city manager, the county’s health officer and its assistant counsel were among the officials who got involved in the dispute before Tesla backed down.\n\nRepresentatives for Tesla didn’t immediately respond to a request for comment on the documents.\n\nThe Bay area was the first region in the U.S. to enact shelter-in-place orders, a massive effort impacting more than 7 million people. Since then, the coronavirus has wreaked havoc on communities across the country and put immense strain on the global economy. Alameda County had 264 confirmed cases of Covid-19 -- the disease caused by the coronavirus -- as of March 30, according to the health department. Seven have died.\n\nVirtual Meeting\n\nHours before Tesla announced plans to suspend production, Kimberly Petersen, Fremont’s police chief, and other city officials held a virtual meeting on March 19 to follow up on a determination reached the day before: the company had to cease all activities except for minimum basic operations.\n\nIn a March 21 letter to Tesla, she recounted the city’s efforts to seek clarification as to whether the carmaker was an essential business by consulting with Scott Dickey, the assistant counsel for the county. Dickey relayed a determination from Erica Pan, Alameda County’s health officer.\n“Mr. Dickey informed city staff that Dr. Pan does not consider Tesla to be an essential business, but rather, considers Tesla’s manufacturing plant to be a public health risk,” Petersen wrote in the letter.\n\nTesla’s plant employs roughly 10,000 people, but many workers commute from elsewhere, including California’s Central Valley. The company told employees last week that two staffers at unspecified offices were confirmed to have Covid-19.\nA Nevada television station reported Sunday that a Tesla worker at its battery factory near Reno had tested positive, citing an email that cell supplier Panasonic Corp. sent to employees. Tesla had more than 48,000 employees worldwide at the end of 2019.\n\n‘Staged Shutdown’\n\nWhen Tesla representatives including Rohan Patel, a senior director of policy and business development who used to work in the Obama administration, met Fremont officials on March 19, they said the company intended to comply with the order, though it needed to conduct a “staged shutdown” of the plant.\nThe two sides agreed that all vehicle manufacturing would cease on March 23. Employees who remained on site would complete work at the end of assembly lines to protect the value of vehicles and batteries, while others would perform basic operations such as security, maintenance and cleaning, all while following social-distancing requirements.\n“You explicitly agreed to that understanding,” the police chief later wrote. “If you were to transition to manufacturing ventilators, or other equipment intended to aid in the fight against Covid-19, these activities would be permitted.”\nTesla Chief Executive Officer Elon Musk tweeted March 18, the day before the meeting with Fremont officials, that the company would make ventilators “if there is a shortage.” The carmaker has since held discussions with Medtronic Plc, a leading ventilator maker based in Dublin, Ireland, but there’s no indication yet that Tesla will play a role in manufacturing the medical devices.\n\nThe Right Thing\n\nDuring another virtual meeting on Sunday, March 22, Tesla briefly reversed its decision to close its plant. Alan Prescott, Tesla’s acting general counsel, argued the county’s health order had been superseded by a new statewide order issued by California Governor Gavin Newsom. The order included an exception for “critical infrastructure sectors,” a category Tesla claimed included its plant and thus meant the company could continue conducting full operations.\n\nAfter Petersen, the police chief, told Tesla during the meeting that the city was rejecting that argument, Prescott said the company would wind down operations because it was “the right thing to do.”\n\nA tweet Musk sent two days earlier suggested Tesla didn’t have a choice -- the factory couldn’t stay open because Tesla’s parts suppliers weren’t going to keep running their plants, he wrote.\n\n\nPetersen told Tesla she would like to schedule an inspection of the company’s facilities on March 24 to ensure compliance.\n“In closing, I would like to reiterate that the city of Fremont highly values Tesla as a partner and appreciates what you do for our economy and community,” Petersen wrote in one of her emails to the company. “We are extremely grateful for your willingness to collaborate in our fight against the spread of Covid-19 by placing public health ahead of all other priorities.”\n\nFrom The Web", "score": 5, "replies": [{"body": "Thanks for sharing.", "score": 2, "replies": []}]}, {"body": ">https://www.bloomberg.com/news/articles/2020-03-31/tesla-plant-claims-collided-with-city-seeing-public-health-risk\n\n[https://finance.yahoo.com/news/tesla-fought-keep-plant-open-153710444.html](https://finance.yahoo.com/news/tesla-fought-keep-plant-open-153710444.html)", "score": 1, "replies": [{"body": "thanks sounds like what we thought was happening happened", "score": 1, "replies": []}]}]}, {"body": "2 more leaps bought", "score": 3, "replies": [{"body": "Caught the last minute jump nice lol", "score": 1, "replies": []}, {"body": "I suspect... You gonna get $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ lol", "score": 1, "replies": [{"body": "I plan to exercise these babies", "score": 3, "replies": []}]}, {"body": "pics or downvote", "score": -1, "replies": []}]}, {"body": "TSLA relatively strong today, think everyone is comfortable with Q1 numbers.", "score": 5, "replies": [{"body": "relatively? lol", "score": 5, "replies": []}, {"body": "It seems overbought for what are probably going to not be great delivery numbers.", "score": 4, "replies": [{"body": "username checks out :)", "score": 1, "replies": [{"body": "Guess not ;-)", "score": 1, "replies": []}]}, {"body": "FUD. We hit 700 tomorrow AH.", "score": -2, "replies": []}]}]}, {"body": "Whether futures are up or futures are down you never know what tsla will do", "score": 5, "replies": [{"body": "Ancient proverb", "score": 7, "replies": []}]}, {"body": "Gali forecasting 65k Q1 and 60k Q2", "score": 4, "replies": [{"body": "I agree. They won’t be able to get any vehicles to Europe in Q2.", "score": 3, "replies": []}, {"body": "Q1 will be higher, hard to say for Q2", "score": 1, "replies": []}]}, {"body": "April 1st, daily thread available:\n\n[https://www.reddit.com/r/teslainvestorsclub/comments/ft0di0/tsla_daily_investor_discussion_april_1st_2020/](https://www.reddit.com/r/teslainvestorsclub/comments/ft0di0/tsla_daily_investor_discussion_april_1st_2020/)", "score": 2, "replies": []}, {"body": "For anyone interested, Sandy Munro is publishing short clips of his Model Y teardown here: \n\n[https://munrolive.com/munrolive](https://munrolive.com/munrolive)", "score": 2, "replies": []}, {"body": "[removed]", "score": 10, "replies": [{"body": "I'm looking to average down at $10. That's the bottom Jonas called.", "score": 5, "replies": [{"body": "In a few years, today’s price will be $10 ( split - adjusted )   😎👍", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "You do realise he's being sarcastic right?", "score": 7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Let him have his fun", "score": 10, "replies": []}]}]}, {"body": "I’m pretending to be Chosso and TriumphantOrgasm, our new friendly trolls", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I do one a day. Just block me lol", "score": -1, "replies": []}]}]}, {"body": "I think they’re humorous and entertaining", "score": 6, "replies": []}, {"body": "No dude, Jonas was right it's really going down to $10, but unlike u/ajdude101 I got $20 puts so I can actually make a decent profit.", "score": 0, "replies": []}]}, {"body": "Wait what?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "He's not really tslaq, or if he is, he is WAY deep undercover.", "score": 2, "replies": []}]}]}, {"body": "Bought my first option ever.\n\nLet's see where this goes.", "score": 2, "replies": [{"body": "what did you pick up?", "score": 2, "replies": [{"body": "A cheap call for the 17th of April.", "score": 1, "replies": [{"body": "Risky", "score": 3, "replies": [{"body": "The point of options.", "score": 2, "replies": []}, {"body": "Can't believe I pulled it off.", "score": 1, "replies": [{"body": "Niiiice 🤑🤑", "score": 1, "replies": []}]}]}, {"body": "Cheap call? At this IV? No it was not cheap", "score": 3, "replies": [{"body": "I bought it at 2, sold today at 24.", "score": 1, "replies": []}]}, {"body": "weird", "score": 1, "replies": []}]}]}]}, {"body": "To the moon!", "score": 4, "replies": [{"body": "Lmao what's going on w this stock", "score": 3, "replies": [{"body": "I gave up trying to figure that out long ago", "score": 8, "replies": []}, {"body": "China extended their EV tax credit", "score": 1, "replies": []}]}]}, {"body": "Buy the hype, sell the news. I'm strongly considering buying Puts today in anticipation for some really terrible delivery numbers later this week. The Puts are intended to offset losses from my tesla shares, so it's a bit of a hedge play. If the puts do turn a profit, I'll close them out and roll them into more shares. Thoughts on this?", "score": 2, "replies": [{"body": "I think the deliveries may not be as bad as what's expected.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Neutral", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It'll be either a small loss or a small profit, the market doesn't care about q1 I think, the price action will be based on how soon America and the factory opens, how soon demand bounces back.", "score": 3, "replies": [{"body": "Agreed", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'd be careful, analysts such as Credit Suisse are lowering their delivery estimates to numbers that should be comfortably beat. Could be a play to run the stock price up after delivery report as price normally moves based on delivery consensus beat or miss.", "score": 3, "replies": []}, {"body": "The pandemic has lowered the bar for deliveries. Everyone knows Q1 is bad for auto, plus lowered demand due to the pandemic. It's possible that the current price already has low deliveries and factory shutdowns priced in. Why would it go lower if the bar is already low?", "score": 2, "replies": [{"body": "I think the bar is lower but I think the delivery numbers will be a bloodbath. Like < 70k deliveries for Q1.", "score": 0, "replies": [{"body": "Even if that's the case, do you think the market will excuse it due to the pandemic? I think every company that reports a bad Q1 will get a free pass this round. You disagree?", "score": 3, "replies": [{"body": "Possibly... the market has no idea what to expect. I do think we are in for a long period of slow growth, high unemployment, low spending, etc. Has this been priced in yet? I don't know. If the low delivery numbers are a shock then it might drop further.", "score": 2, "replies": []}]}]}]}, {"body": "Be prepared to give away that money.  I bet this pump is all insiders and their family.  Same thing happened a day before Q3 and Q4 numbers announced.", "score": 4, "replies": [{"body": "Are you saying you expect good numbers?", "score": 1, "replies": [{"body": "I do.", "score": 2, "replies": [{"body": "They are going to be a disaster. The co is guiding down btw", "score": -2, "replies": [{"body": "Link?", "score": 4, "replies": [{"body": "https://twitter.com/TESLAcharts/status/1244933141141258240?s=20", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "god tomorrows gonna suck 04-01 warning, some people think they can start early, and that's not how it works", "score": 2, "replies": []}, {"body": "What time does Tesla typically release delivery numbers for the quarter? Before open? After open?", "score": 2, "replies": [{"body": "They've been releasing it after market close for at least the past 3 quarters.", "score": 1, "replies": [{"body": "Nah it was before market open last time", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Hope it's on Wed/Thurs this time.", "score": 1, "replies": []}, {"body": "It’s never on a weekend.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Their investor relations page should have it on the schedule but I see they don’t. That unusual. Most companies do.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "When are the 1Q’s", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I heard historically 2-2:30p PST after market hours", "score": 1, "replies": []}]}, {"body": "I have puts ready for tomorrow's drop to 4269", "score": 2, "replies": [{"body": "I have limit buy for 20 at $420.69 🤠", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "nobody knows man", "score": 5, "replies": []}, {"body": "If you wait to buy, you can end up paying more than current value. Nobody knows exactly what the market will do.\n\nJust to add, when this stock hits 1000, 2000, 4000 etc, you'll look at 500 buy in as a steal. Long game is important to consider when making any purchase of a stock unless you are trading. If you are trading right now, good luck to you.", "score": 5, "replies": [{"body": "That was my rationalization. I couldn't open my investing account in time to buy around 400 but it's a company I really value anyways so buying it at 500 won't be so bad if I see it worth well over 1000 in the future.", "score": 3, "replies": []}]}, {"body": "$500 may have been the new bottom : \\\\", "score": 2, "replies": []}, {"body": "Just DCA and if it drops to sub 400 you will buy at sub 400", "score": 1, "replies": []}]}, {"body": "Please stop posting about miracle cures for COVID. \n\nEven a miracle cure would\n\n* Take weeks or months to make and distribute\n* Kill some of the people it was administered to\n* Not fix the damage already done\n\nThe promise of a miracle cure will however make a certain segment of the population think they can disregard the current measures - THE ONE THING THAT WE KNOW WORKS!!!\n\nSo please don’t sing the praises of any cure until it’s in place and effective. \n\nMODS: Could we possibly make a rule against this, at least in the daily thread?", "score": 2, "replies": [{"body": "I don't understand why you're being downvoted other than not related directly to Tesla, but there are a number of \"virus-deniers\".", "score": 3, "replies": [{"body": "They can't help it.  Their financial well being is tied to minimizing the virus.  Ironic really given how many Tesla have had to battle climate change deniers who have had their interests tied to hydrocarbons.", "score": 2, "replies": []}, {"body": "Not surprised, and was willing to sacrifice some karma at this particular altar :) I am really just trying to be a counterweight to the people who are posting the various unproven treatments, often with no or poor attribution. \n\nI do get that they think they are doing a good deed - I just happen to think they are misguided, and I'm not afraid to say so, sternly but hopefully politely.", "score": 1, "replies": []}]}, {"body": "I think the idea of a miracle cure could still move markets in the short term.\n\nTo me at least the daily thread is really about understanding what people are thinking.  If someone has an incorrect belief that moves markets I want to know about it.", "score": 1, "replies": [{"body": "Could it go in the designated COVID thread perhaps?", "score": 1, "replies": [{"body": "Trying to ignore Covid on in the daily thread is ridiculous. The single handily the biggest topic facing stocks and TSLA at this point.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yes, economic depressions are usually great for car companies /s", "score": 13, "replies": [{"body": "In terms of how things could move, the fact that Tesla has always been somewhat production-constrained is a positive thing.. particularly when they're moving towards more Model Y production -- in a higher-demand vehicle class, and it previously had no availability at all. It's certainly not a good thing though (since even if some other car manufacturer could have in theory gone out of business and leave more market share for Tesla, they're in reality going to get bailed out even if it comes to that point).\n\nLooking at China, there areas with raffles and such for customers to even be allowed to put a new non-EV on the road.. which has been successful in getting people to buy EV's that they're not thrilled about - just so they don't have to potentially wait for years. So Tesla - as a producer of an EV that customers actually desire - has a good situation going on there for a while.", "score": 0, "replies": []}]}, {"body": "Q1 earnings we not going to be disastrous prior to Coronavirus. China would have produced another \\~5k, and Fremont \\~8k, i.e. production would have been around 110-115k, deliveries maybe around 100-105. Now 90k+ would be a beat.", "score": 5, "replies": [{"body": "Deliveries no, earnings yes.", "score": 2, "replies": [{"body": "How do you get bad earnings with good deliveries?\nLast year that happened with a horrible model 3 ramp. But it doesn't look like Tesla is making the same mistakes on the Y", "score": 1, "replies": [{"body": "Cause first few thousand units in any new production line are sold at negative margin. We have new line in china and new Y line in fremont.", "score": 2, "replies": []}]}]}]}, {"body": "o.O", "score": 1, "replies": []}]}, {"body": "Let's remember that last year everyone ignored all the signs that Q1 would be bad and the market definitely had not priced it in. I'm not buying beforehand unless we see < 450.", "score": 1, "replies": [{"body": "How bad was the drop last year after Q1?", "score": 1, "replies": [{"body": "You really should figure out how to find that yourself but since I wanted to know as well I looked it up: \n\n4/3 close 291.81\n\n4/4 close 267.78\n\nThere was then a pretty straight downhill to well under 200 over the next 2 months as people wrung their hands about Q2 as well.", "score": 1, "replies": [{"body": "Appreciate it. I actually did go back and look, but it was hard for me to find out the reason why it kept diving afterwards. But thanks for the explanation.\n\nI don't think we'll see a repeat of such a massive drop due to Tesla now being profitable and having a strong enough balance sheet to assuage any fears of bankruptcy.", "score": 2, "replies": [{"body": "So last year Tesla had a bad first quarter, but otherwise the economy was doing great, and the share price dropped to 180.\n\nThis year the **global** economy is contracting, jobless claims have hit all time highs, huge nations are in lockdown indefinitely, factories are closed, but you don't think it's going to impact Tesla's share price, which is still pretty high?\n\nIf Q1 is bad it will have a massive impact, and things will get worse from there (Q2 will be way worse), the market will panic about this and every other stock when the true impact of the lockdowns becomes clear. Yes the market is forward looking (at least in theory), but it's also prone to panics and overreactions in both directions. I think Q1 won't be too bad for Tesla but am not optimistic about prices this year for Tesla as the disease progresses. If you're a long term holder, that doesn't really matter to you, if you want to buy more it's good news if you think Tesla will survive, if you're attempting to trade the stock, good luck.\n\nIn a few years this will all be a bad memory and Tesla will do fine, but don't underestimate how bad things will get, and don't use the massively inflated price of Tesla stock a month or two ago as an anchor when thinking about price (this priced in several years of perfect execution in a growing world economy). Short terms things will be worse than many in the US still seem to think, long term things will be better than everyone is going to think in a month or so when panic sets in.", "score": 6, "replies": []}]}, {"body": "And that was with a very favourable macro. What would it mean now with the current market conditions?", "score": 2, "replies": []}]}]}, {"body": "FUD. \n\nWe will hit 700 after hours. You’ve been warned.", "score": -2, "replies": []}]}, {"body": "Wow look at that spike", "score": 1, "replies": []}, {"body": "That 10 points drop lmao", "score": 1, "replies": [{"body": "whole macro just dropped", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Nah it's great for Tesla, let these morons fiddle on the fossil fuels titanic as the EV iceberg comes. It's like cutting sales taxes on a Nokia.", "score": 18, "replies": [{"body": "True af", "score": 8, "replies": []}]}, {"body": "Hard to say whether it will affect share price in the short run.  But I’ve always felt on this issue that kicking the can down the road on mpg gives tesla a bigger lead in the space.", "score": 5, "replies": []}, {"body": "I wouldn’t think so. I imagine the people who are impacted that greatly by the cost of fuel are more likely to buy an an inexpensive used ICE rather than come up with the scratch for a new EV.", "score": 4, "replies": []}, {"body": "Bigger issue is if he can kill California senate rules. \n\nThe California credits give tsla millions. \n\nIf that goes away so does big revenue input.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I heard something about a Pandemic that is just getting started in the US", "score": 22, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The Fed did QE unlimited and a 2 trillion stimulus bill was passed", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well it doesn't really matter if you expect QE or not.  Hedge funds would literally have to sell if they don't have liquidity.\n\nPlus nobody actually expected 2 trillion.  They were starting at 750 billion", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'd say about 50/50 for technicals and fundamentals", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "When do we expect the numbers for March? How long does it usually take after a month's end?", "score": 1, "replies": [{"body": "Friday at 8 am eastern time book it", "score": 2, "replies": [{"body": "1DTE call it is.", "score": 2, "replies": []}, {"body": "Friday at 8a? Is that delivery numbers report time?", "score": 1, "replies": [{"body": "It was last quarter", "score": 1, "replies": [{"body": "Is it always Friday mornings each quarter? Or does it vary? Does Elon pre-announce the day/time?", "score": 1, "replies": []}]}]}]}, {"body": "Wed/Thurs/Fri afterhours (most likely Wed/Thurs)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I think we just need to go into a deep sleep until Cyberpunk 2077 comes out", "score": 3, "replies": [{"body": "You might wake up to Cyberpunk 2021", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I was scanning /r/coronavirus one day and it was various informative links about worldwide horrors and then sandwiched in the middle was 'Sony confirms PS5 is not yet delayed' and I just shook my head.", "score": 1, "replies": []}]}]}]}, {"body": "Gonna play weekly $1,000 calls for teh lulz", "score": 1, "replies": []}, {"body": "TSLA truly has ridiculous strength. The entire market does right now. \n\nI don’t understand how factories closing, unemployment booming, forklifts taking bodies to refrigerated trucks, and all the other bad news hasn’t broken the market. \n\nI’m bearish on everything right now, but I think this manipulation is seriously going to screw us all in a few years. \n\nYes, I have Puts on a lot of stuff right now (again, I’m bearish) but this is unprecedented.", "score": 1, "replies": [{"body": "I look at it like this, when the dust settles, which companies are you gonna want to own, yes short term tesla is hurting, but looking farther out, easy buy", "score": 7, "replies": [{"body": "When 30% of Americans may be unemployed and people aren’t buying cars (as economic changes like this are scary) it’s unheard of for any of these stocks to keep surging. \n\nDo you really think TSLA is in a better place now than they were six months ago?\n\nI think the entire market is overvalued and we’re in for a rude wake up call.", "score": 3, "replies": [{"body": "I don't think that's the point he's making.  I think he's saying that relative to their competitors look at the position they're in now VS 6 months ago.", "score": 1, "replies": []}, {"body": "We just had a 30% drop bro", "score": 1, "replies": []}, {"body": "Yes, unequivocally, we are much better than we were 6 months ago. Having said that the next 6 months might be painful, but as a long term investor we are in a much much better place. \n\nWe have a 2nd factory that has ramped more quickly than probably any other factory in the world, and will continue to ramp (they just completed foundations on phase 2)\n\nAlso, to continue point from above, this just proved Tesla’s machine that builds the machine goals. They went from purchasing land to 3k cars a week in 12-14 months, and should be 5k a week in ~15 months. This is beyond insane. They can now just copy and paste their factory’s all over the world making iterative improvements as they go (MIC M3s are significantly better and cheaper than freemont M3’s)\n\nWe are building our own battery lines to further increase our monumental battery lead\n\nThe other auto makers are only planning on selling 350k EVs a year in 2026!!! (This is beyond laughable). \n\nWe have 2 more factories on the way and enough cash to build both of them plus keep ramping Shanghai. \n\nThe Model Y just came out which will be by far Tesla’s highest margin vehicle in the largest vehicle segment in the world (and its brand new which should hugely help the auto demand in a recession problem)\n\nTesla has enough resources to not only weather the short term pain, but keep their expansion plans going and come out the other side with 2x the lead on the rest of the market that they had going in. Even if we do drop more from the short term pain, who cares. No one can predict the price, and I think $500 is a steal. I do have a little cash saved to buy more if there is a dip, plus some puts on the rest of the market, but I’m mostly bought into my tsla position because they have done everything right for this black swan event.", "score": 1, "replies": []}, {"body": "The question is if printing infinite money in loans and investment will succeed at keeping the stock market afloat.", "score": 1, "replies": []}]}]}, {"body": "Let's not completely forget that the market flew off a cliff. Meanwhile there's a major difference between now and the financial crisis: the majority of jobs lost are service industry. The market expects all these jobs to get gobbled back up as soon as everything reopens. Meanwhile I'm hearing some people are making more now via unemployment and stimulus checks than they were at their low paying jobs. The amount of money the government pumping is insane and we might feel a huge effect down the road or a minimal effect down the road but either way it's going to be down the road and the market will recover significantly by then. Also we seem to have hit a clear global inflection point in covid-19 spread. Just my opinion which is why I think we bottomed on 3/23.", "score": 7, "replies": [{"body": "Hello inflation", "score": 1, "replies": []}]}, {"body": "~~No interest in removing the comment, but please change your wording; it's just unpleasant. Thanks.~~", "score": 3, "replies": [{"body": "I updated a word in my first sentence, which may have been the only offense term. \n\nI stand by everything else in my comment. It’s an unpleasant time right now, the reality of the virus is bad...I have multiple friends and family members who work in hospitals and it’s getting bad.", "score": 5, "replies": [{"body": "Many thanks, that was all we needed. Someone reported, but there's nothing wrong with it in my eyes besides. \n\nBest of luck to you and yours.", "score": 3, "replies": [{"body": "Thanks! You too. Stay safe out there!", "score": 2, "replies": []}]}]}]}, {"body": "The market went down 30% in 3 weeks, and you don't think the market has price any negative news in...?", "score": 4, "replies": [{"body": "Some people only seem to remember the past few days. It's so strange.", "score": 5, "replies": []}, {"body": "And we’ve almost been green for a week on catastrophic news. The market is being propped up by the Fed and we’ll pay for it sooner or later.", "score": 3, "replies": [{"body": "catastrophic news that was anticipated isn't really news though", "score": 2, "replies": [{"body": "This wasn’t anticipated two weeks again. No one anticipated this being that bad and I still don’t think people understand how bad this is. \n\nThe rug will eventually be ripped out from everyone, my timing was a bit off, but it’s going to eventually happen. \n\nSPY will be $180 eventually. Think about this...\n\n\n1.\tNovember 2017: The US economy is growing vigorously; corporate tax rates are slashed. S&P: ~2600\n2.\tJanuary 2019: Markets rebounding after a little sell-off. S&P: ~2600\n3.\tMarch 30, 2020: Global pandemic with no end in sight. USA locked down for at least another month. Potential crisis in nearly every corner of the financial system. S&P: ~2600", "score": 2, "replies": [{"body": "Price alone is irrelevant. Trends are what matters.", "score": 1, "replies": []}, {"body": "Not sure where you were getting your info from but this is how bad it was expected to be from where I got mine. Market is down over 20% still and the stimulus bill and FED will keep everything afloat until the lockdown ends in 1-2 months and then there will be a slow reopening of everything. This is a short term health crisis, there's no reason for the markets to drop 80% just because everything is on pause right now.", "score": 1, "replies": [{"body": "I think we’re mistaken that things will be better in a month or two. \n\nNY may start to flatten its curve in a month or two, but other cities will have similar breakouts in the virus. \n\nI think we have 3-4 months of this before things start to normalize.", "score": 1, "replies": [{"body": "I agree, but things will normalize over time, starting in 1-2 months. They won't be totally normal until we have a cure and/or a vaccine.", "score": 1, "replies": [{"body": "Cure or vaccine is 8-12 months out. China is worried about a massive second wave and they’ve already shit down everything for weeks. \n\nThe US is going to get his hard trying to solve this state by state. \n\nNew Yorkers are flocking down to Florida. The spread in Florida is going to be bad in a couple weeks. \n\nI think while it would suck, a country lockdown for 2-3 weeks. Flatten the curve. Then eventually this will simmer down. \n\nWe’re going to have at least 5 different New York scenarios doing this state by state.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": ">spy down .5%\n\n\"entire market going down right now!\"", "score": 2, "replies": []}, {"body": "I think Trump’s press conference at 5pm today will make your puts bleed. It’s a follow-up from Sun when they said they will have more data available today.\n\nI expect them to announce excellent result from the 1100 patient trial of Hydroxychloroquine and a recommendation to prescribe it already at doctor clinics, reducing the load on hospitals by 90% easily. With adjusted models, this will be a game-changer for the outlook so the predictions will be way less awful from tonight.\n\nCall me crazy, but the turn-around is now.", "score": 0, "replies": [{"body": "Yet NY is building hospitals in Central Park, renting trucks to keep bodies from rotting, and using forklifts to transfer those bodies. \n\nWe are going to have NY in more states as these hotspots erupt. \n\nNot to mention, if we do things perfectly, we’ll lose 200,000 American lives. \n\nThere’s no way that was priced in a few weeks ago.", "score": 3, "replies": [{"body": "I also think they will lower the estimate of 200k deaths tonight.", "score": 1, "replies": [{"body": "What makes you think that? They just said yesterday that if we do everything perfectly we’ll have 200,000 deaths. \n\nRegardless, the TSLA factory is closed for another month...I would truly be happy if my puts didn’t print because the economy was fixed, but the outlook is gruel, and I feel like we’ll all be paying for it in a few years with the current manipulation we’re seeing.", "score": 2, "replies": [{"body": "I was surprised to hear a number that high as the “news” started too. However, further into the broadcast, the actual quote was something to the effect that 200k is worst case scenario, with poor compliance. Also, there are about 2.4mil deaths per year in the States, from all causes, with 1/3 of those from cardiovascular disease. Gotta keep it in perspective.", "score": 1, "replies": [{"body": "Also, the previous pessimistic prediction was 2.2M, so 200k is way better. Or were there one more prediction in between?", "score": 1, "replies": [{"body": "Exactly. As more cases are detected, the overall mortality rate will continue to decrease. New article from the Lancet this week - large metanalysis of the numbers estimates overall mortality around 0.66%. (Flu is about 0.1%). Hopefully, the powers that be will let us get back to work sooner rather than later. Still buying TSLA. Can’t wait for the launch upward!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Any significant news causing this drop?", "score": 1, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "I’m asking for the ‘sudden’ drop, not the overall macro. Judging by your -5 point vote below, you post nothing but garbage around here.", "score": 6, "replies": [{"body": "No significant news that caused the drop. Macro also dropped at the same time so I’m sure it’s just following that.", "score": 2, "replies": []}, {"body": "Yeah, I'd ignore that fool. Seems like he just tries to spread FUD getting people to sell their shares.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Aren't you the guy that said Tesla was going under $200?\n\n\\*checks stock price\\*\n\nWhat *reality* are you referencing?", "score": 5, "replies": []}, {"body": "I really question your knowledge of this company though. For example you didn't even know that you can't just straight line average quarterly deliveries from the annual goal. If you didn't even know something very basic like that, why should your opinion be valued? Or are you just generally shouting from the rooftops more broadly about the market?", "score": 3, "replies": []}]}]}]}, {"body": "Q1 deliveries", "score": -11, "replies": []}]}, {"body": "\\-4.20% in premarket, bruh", "score": 1, "replies": [{"body": "It's an April fools joke, gotta blaze it bruh", "score": 2, "replies": []}]}, {"body": "Anyone honestly think we will see 400 again? Im so pissed i missed the dip :(  \nI have about 5k im going to invest on friday, but man that dip below 400 would have been lovely to get in on..", "score": 1, "replies": [{"body": "It's a bit too early yet, we'll probably see more drops without some good news (vaccine, cures, etc).\n\nTrump can't keep printing money forever.", "score": 2, "replies": [{"body": "I feel like most of the panic has gone though. Especially with Giga Shanghai running, still producing batteries, converting into Vent production, good PR, etc.   \n370$ a share was a steal imo, hence the huge 50% move.", "score": 2, "replies": [{"body": "Outside the US, maybe, but here not so much.\n\nLots of dead and infected as well as SIP orders will cause more panic.", "score": 1, "replies": []}]}]}, {"body": "Let's see how the next couple of quarters look. It's quite possible that Tesla will not be able to sell as many products in the coming time as previously expected by the market. I have spare money  and watch the market closely, waiting for a good time to buy in... But who knows. They might outperform in Q1 and Q2 . If that happens we'll regret not buying more now, right. :)", "score": 2, "replies": []}, {"body": "I'm anticipating one more drop to 450. I don't trust my speculation though...", "score": 2, "replies": []}, {"body": "I think the fact that Tesla has strong sales in China will be viewed very favorably. At least that is a steady stream of new revenue. Otherwise I really can't see how it is still hanging on to $500.", "score": 2, "replies": []}, {"body": "500 is just 25% over 400", "score": 2, "replies": []}, {"body": ">500 is the new 400", "score": 2, "replies": []}, {"body": "I think we’ll see 300’s in Q2. I’m happy with my current chairs but will round up the figure if we drop that low again.", "score": 4, "replies": []}, {"body": "It all depends on deliveries. If they can eek out 90K we’ll be good. Anything under 85K they’ll lose a lot of money.", "score": 4, "replies": [{"body": "At this point, do you really think Q1 deliveries matter all that much?  We know Q1 is seasonally slow, Giga Shanghai was down, US is shutdown (Tesla didn't get to do their end of quarter rush), etc.\n\nI think as long as deliveries haven't cratered, anything respectable will be viewed favorably.  Story now will be how quick things open back up, how the economy holds up impacting car sales.", "score": 4, "replies": [{"body": "I like Gene Munster’s approach: \n\n“Investors should shift focus from an absolute production number to a market share number for 2020. We continue to believe that Tesla will outpace the broader auto industry’s delivery growth rate by 25 to 30 percentage points in 2020. In other words, if the auto industry is down 20% in 2020, we expect Tesla deliveries to be up 5-10%.”\n\n\nhttps://loupventures.com/when-fremont-gets-shut-down-tesla-will-survive/", "score": 10, "replies": []}, {"body": "For short term entry points, yes. Tesla has always moved up or down based on short term output", "score": 1, "replies": []}]}, {"body": "When does that come out", "score": 1, "replies": [{"body": "3 days", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "I think we will, if Q1 is sufficiently bad. But that’s a big “if”, lots of people probably expect a weak Q1. Also if virus news gets significantly worse.\n\nBut who knows?", "score": 1, "replies": []}, {"body": "Wait until after Q1 earnings", "score": 1, "replies": [{"body": "Im not much of a timing the market i guess .. Q4 really took me by surprise, i had thought we would see those numbers and news in Q2, so im kind of scared to hold off for an entire month =/", "score": 2, "replies": [{"body": "The stock is lower right now than during Q4 ER. You can buy a little now and a little in a month. If it goes to $600-$700, it will drop right back down. It’s not going to hold those levels in this market. My mind is blown that it’s actually holding $500", "score": 5, "replies": [{"body": "Probably a good point with splitting it up.   \nMaybe i should put down 2k on friday and hold another 3k for later. My average is currently 437 on Tesla .. would love to move that down a bit.", "score": 1, "replies": []}]}]}]}, {"body": "Yes. I think we'll see below 300 this year as Q2 is going to be brutal for everyone, and the panic has just ebbed, not gone away. Not sure I'd invest right now, the market has not reacted yet to the torrent of bad news to come this week in the US, the lockdown is going to tighten and things get worse again for another couple of weeks, until curves start to level off.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Much lower than that. I’m thinking $0 where it truly belongs. They don’t have a working product and are outta cash. Musk will lose everything, the market makers will make it happen", "score": 6, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "It needs to go to below $100 because it’s not worth $500 only baggies are buying and I have $50 puts so under $50 would be nice", "score": 1, "replies": []}]}]}]}]}, {"body": "Ahhhhhh - I actually had to work today :(", "score": 1, "replies": []}, {"body": "Is Trump talking about TSLA here?!\n\n\nhttps://twitter.com/realdonaldtrump/status/1245076016965566464?s=21", "score": 1, "replies": [{"body": "[https://www.npr.org/2020/03/31/824431240/trump-administration-weakens-auto-emissions-rolling-back-key-climate-policy](https://www.npr.org/2020/03/31/824431240/trump-administration-weakens-auto-emissions-rolling-back-key-climate-policy)\n\nLooks like it's actually bad for what Tesla is trying to do sigh", "score": 6, "replies": [{"body": "I think this is quite good for TSLA.  This means the competition will happily keep driving down their dead-end road.", "score": 2, "replies": [{"body": "Exactly", "score": 2, "replies": []}]}, {"body": "This just in, GM ends their EV plans and makes a V16. Calls it the future.", "score": 1, "replies": [{"body": "Lol well gas is cheap right now", "score": 1, "replies": []}]}, {"body": "Rip", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 3, "replies": [{"body": "I don't disagree, but it's not appropriate to the sub. Removed. Please be civil.", "score": 1, "replies": []}]}]}, {"body": "IV has been coming down. My Mar 2021 1300 calls I wrote declined in value despite the stock going up, and all my 900 or 800 calls moved just slightly more than the underlying. I think IV got as high as 80% and now is down to \\~62%.", "score": 1, "replies": [{"body": "I ate the high iv to buy calls at 402, worth it!", "score": 1, "replies": []}, {"body": "What site do you use to check IV?", "score": 1, "replies": [{"body": "My broker shows all that when I view the specific option.", "score": 1, "replies": [{"body": "I really love Schwab in most aspects,  but the info they show you on options, especially in the mobile app, is laughable.", "score": 2, "replies": []}]}]}]}, {"body": "Surely this is a FAQ, but when shall we expect the deliveries numbers? \n\nThanks!", "score": 1, "replies": [{"body": "No one knows. Sometime this week at least.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Huge pop tomorrow after hours.  Tests ath \n\nSettles back down to 650 by end of month.", "score": -1, "replies": [{"body": "Cathie's bull prediction of $22k by noon tomorrow, and then falling off a cliff to $5 plus a free bottle of Teslaquila per chair by market close. Then opening at $4,206.90 Thursday morning with a free copy of a signed screenshot of Elon's twitter bio back when it was \"born 69 days after 4/20\"", "score": 9, "replies": []}, {"body": "You’re on drugs", "score": 9, "replies": []}, {"body": "just because it's April 1st in Australia, tone it down", "score": 13, "replies": []}, {"body": "Lol", "score": 1, "replies": [{"body": "Ignore at your peril.", "score": -1, "replies": [{"body": "Ooo I like it", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": -18, "replies": [{"body": "You and Chosso post 10x a day telling people they should sell", "score": 16, "replies": [{"body": "yeah I gotta wonder about that.   That is a lot of posts for someone with no position.   guess he just wants to help the rest of us out by posting all the time.", "score": 10, "replies": [{"body": "It’s pretty obvious they have a short position / bought puts.", "score": 4, "replies": [{"body": "I should have put a /s but that's what i was getting at.", "score": 3, "replies": []}]}]}]}, {"body": "Depends on your risk tolerance. I can tolerate any risk, all in leaps.", "score": 6, "replies": [{"body": ">you sold all your shares for leaps instead? wow. (Y)", "score": 1, "replies": [{"body": "Yup", "score": 1, "replies": [{"body": "What strike and dates if you don’t mind sharing : P", "score": 1, "replies": [{"body": "6 2022 500 to 600s", "score": 1, "replies": [{"body": "Are you still holding on to any of your automaker puts? I sold about 2/3 of my position in them at the bottom we saw last week", "score": 1, "replies": [{"body": "Yah unfortunately, but I don't mind", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Wow looks like you sure bought into the whole long term recession thing. Good luck with that.", "score": 11, "replies": [{"body": "[deleted]", "score": -10, "replies": [{"body": "Just from a couple months of lockdown? Or maybe you think it will be way more than that?", "score": 6, "replies": [{"body": "Entire industries are being destroyed. Retail, restaurant, entertainment. Huge parts of the economy.", "score": 2, "replies": [{"body": "So you're saying for example that many retail stores and restaurants will literally just close up shop?", "score": 4, "replies": [{"body": "Is that a wild assumption?", "score": 2, "replies": [{"body": "I mean I dunno. Hard to imagine all my favorite restaurants closing up shop.", "score": 1, "replies": [{"body": "I don't know where you live, but the province of Ontario is basically 1 week into province wide quarantine/shutdown and people are hurting. Retail especially and restaurants that rely on sit down service.\n\nCan't imagine what will happen in 2-3 months if the situation is prolonged.", "score": 1, "replies": [{"body": "Sounds like your government needs to print a few trillion to relieve those poor people.", "score": 1, "replies": [{"body": "Apparently lol. Real talk though, Canada is super behind on the stimulus timeline and the application process for financial aid for majority of Canadians doesn't even open for registration until April 6.", "score": 1, "replies": [{"body": "Rough", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Yes. I already know this to be a fact. My roommate is a retail outlet Ops manager and 2 stores are not reopening.", "score": 3, "replies": [{"body": "Well I will say retail is different because you do have online avenues for everything. But yeah, still, that is sobering to some extent.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I'm going to leave this up, but can you actually answer why you keep posting these kinds of comments? They aren't well received, there's not much discussion caused, and it's rarely in response to someone actually asking for opinions. It seems like you're just making a hobby of standing on a busy street corner yelling \"Doom is coming!\" every day. So... why?", "score": 10, "replies": []}, {"body": "good call, I'll sell all my shares I bought a year ago for around $250. I don't want to risk losing any potential gainz.", "score": 6, "replies": []}, {"body": "Sell low and buy high , thanks for the advice.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}, {"body": "Some glimmer of hope:\n\nNY DOCTORS SAYS SUCCESSFULLY TREATED 400 PATIENTS WITH CORONAVIRUS INFECTION USING A COCKTAIL OF HYDROXYCHLOROQUINE, AZITHROMYCIN, AND ZINC SULFATE WITH ZERO DEATHS AND SIDE EFFECTS", "score": -3, "replies": [{"body": "Source?", "score": 2, "replies": []}, {"body": "Europe been pumping people full of this for almost s month. Consensus is it helps but very little. \n\nUnderpowered studies don’t meant much.", "score": 3, "replies": []}, {"body": "Successful treatment = not dead.\n\nNot back to 100% normal.", "score": 1, "replies": [{"body": "That’s still good and road to recovery. Less use of ventilators, icu which helps everyone.", "score": 1, "replies": [{"body": "To me at least I find the unnamed doctor recommendations very suspect.  It could be phrased as \"person not willing to tell you their name says buy these things\"", "score": 2, "replies": []}]}]}, {"body": "A source would be welcome. Mostly asking just because someone reported the comment.", "score": 1, "replies": [{"body": "https://twitter.com/firstsquawk/status/1245331078405029888?s=21", "score": 1, "replies": [{"body": "Many thanks!", "score": 1, "replies": []}]}]}, {"body": "Please stop. \n\nEven a miracle cure would\n\n* Take weeks or months to make and distribute\n* Kill some of the people it was administered to\n* Not fix the damage already done\n\nThe promise of a miracle cure will however make a certain segment of the population think they can disregard the current measures - THE ONE THING THAT WE KNOW WORKS!!!\n\nSo please don’t sing the praises of any cure until it’s in place and effective. \n\nIn the mean time we can’t for some goddamn reason make/find and distribute goddamn masks to the frontline medical personel.", "score": -1, "replies": [{"body": "You keep using this term \"miracle cure\" but I don't see that being alleged, just that a combination of these drugs apparently is helping some people.", "score": 2, "replies": [{"body": "I am saying that EVEN a miracle cure is not going to cut it. \n\nSo this would be... even less of a solution?\n\nEDIT: Also, not even making an attempt to relate it to TSLA, or posting it in the designated COVID thread.", "score": -2, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "This is a very inappropriate post. You can make your point without sounding homophobic or transphobic...", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "more sellers than buyers.", "score": 13, "replies": []}, {"body": "I spilled my coffee", "score": 3, "replies": []}, {"body": "marco", "score": -2, "replies": [{"body": "polo?", "score": 15, "replies": []}]}]}, {"body": "So the drop AH is because of Gali or just AH market?", "score": -5, "replies": [{"body": "Lmao Gali isn’t moving markets come on. It’s after hours it’s meaningless", "score": 8, "replies": []}, {"body": "Jesus Christ", "score": 4, "replies": []}, {"body": "If you added /s it would have been pretty funny.", "score": 3, "replies": [{"body": "I was trying to channel my inner ajdude, but guess I failed miserably. 😂", "score": 3, "replies": [{"body": "Well neither of you are even remotely funny, so I guess if that was your objective then it worked.", "score": 4, "replies": []}]}]}, {"body": "I don't think Gali can move markets (yet, if ever). That's 1.6% of $96 Billion. Do you think a bullish personal investor can move that much market cap?", "score": 1, "replies": []}]}]}
