{"title": "Oracle warns that a TikTok ban would hurt business ", "selftext": "A U.S. ban of TikTok might hurt Oracle’s business, the software company acknowledged in its annual report on Monday.\n\nIn April, President Joe Biden signed a bill demanding that China’s ByteDance sell TikTok in nine months, or one year if an extension is approved, if the short-video company wants to avoid a ban in the U.S. TikTok’s ownership structure has long been a source of tension in the U.S. due to concerns about user data making its way to China.\n\nOracle provides cloud infrastructure for TikTok, which has over 150 million users in the U.S.\n\n“If we are unable to provide those services to TikTok, and if we cannot redeploy that capacity in a timely manner, our revenues and profits would be adversely impacted,” Oracle said in its annual report for the fiscal year ended May 31.\n\nConcern over TikTok and its Chinese ownership dates back to 2020, when Donald Trump, who was then president, pushed for a sale or divestiture of the U.S. assets. That pressure prompted deal talks with Microsoft. Weeks later, Oracle announced that it was part of ByteDance’s proposal to the U.S. Treasury Department to provide cloud services that could help TikTok remain available in the U.S.\n\nTikTok moved forward with an initiative called Project Texas, designed to keep TikTok services for U.S. users running on Oracle cloud infrastructure located inside the country. TikTok said Oracle would also be responsible for compiling the app and delivering it to third-party app stores.\n\n“The one thing I can tell you is we have an excellent relationship with the folks at TikTok,” Oracle CEO Safra Catz said on a 2022 conference call with analysts.\n\nFollowing the bipartisan legislation this year targeted at TikTok, and Biden’s signing of the bill mandating its sale, TikTok filed a lawsuit arguing that the law violates First Amendment free speech protections.\n\nReal estate investor Frank McCourt and former Treasury Secretary Steven Mnuchin have expressed interest in buying TikTok, but no deal has materialized.\n\nOracle hasn’t disclosed details of its financial ties to TikTok. Evercore analysts estimated in April that if TikTok is generating sales of $16 billion in the U.S. annually, it could be spending 3% to 5% as a percentage of revenue on cloud infrastructure, which would work out to $480 million to $800 million. Oracle’s cloud infrastructure revenue for the fiscal year came to $6.9 billion.\n\nSource: https://www.cnbc.com/2024/06/24/oracle-warns-that-a-tiktok-ban-would-hurt-business.html", "id": "1dnvg11", "created_utc": 1719283043.0, "score": 73, "upvote_ratio": 0.72, "num_comments": 80, "comments": [{"body": "Larry Ellison got the 12.5% stake in TikTok from Trump: https://www.cnn.com/2020/09/19/tech/donald-trump-tiktok-deal-approval/index.html", "score": 103, "replies": []}, {"body": "Oracle is one of the worst IT corporations.  Fuck what they think.", "score": 28, "replies": []}, {"body": "Being reliant on the revenue from a Chinese company that was already under scrutiny when the deal was made is reckless management in my opinion.", "score": 85, "replies": []}, {"body": "Something will get worked out", "score": 19, "replies": []}, {"body": "Like anybody gives a fuck what oracle thinks.", "score": 23, "replies": []}, {"body": "We were good without it for many years. We didnt need it then and we dont need it now.", "score": 61, "replies": [{"body": "Couldn't the same argument be made for any piece of technology? We got by without cars. So ban cars?", "score": 25, "replies": [{"body": "[deleted]", "score": 32, "replies": [{"body": "By far the dumbest sub on this site, and that’s saying a lot.", "score": -24, "replies": []}]}, {"body": "Yes it could. Like it’s a terrible low-intellect argument that doesn’t hold up to five brain cells worth of critical thinking tbh", "score": 29, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "It's also akin to drugs where you can't just outlaw \"drugs\" and expect the negatives you're trying to combat to just go away, and for the content you consider toxic on TikTok to not just pop up somewhere else on the Internet.", "score": 5, "replies": []}, {"body": "Actually, you can. Cars killed millions of people due to recklessness and lack of personal responsibility. People tend to blame apps and cars for their lack of personal responsibility, I think our government is being lazy and they need to pass comprehensive data protection laws instead of going after a single app.we had a huge breach where people couldn’t even get their prescriptions due to Medicare and they wanna go out the Chinese? Data issues are global and widespread and it’s not just a single app problem. This is the result of Trump and meta-it’s that simple.", "score": -2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Entertainment for the masses and marketing platform for companies", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yes but tiktok covers 50% of the US population and it is extremely easy / cheap to market products / services. IG and other social media sites simply don't have engagement like TikTok.\n\nReels is just reuploaded tiktoks from 2 months ago and it's algo sucks. In fact tjktoks algo puts new users on the fyp allowing exposure to new content whereas other social media sites do not. The fact that so many people / small businesses use tiktok to sell services and then pay taxes on income to the IRS shows its a net positive.\n\nAs for cars. Chinese EVs are literally taking over the world so I'm assuming biden banning them was wrong since it's a \"net positive\" right? \n\nThe tiktok ban is just because politicians didn't like anti-israel sentiment and hated American voters calling out their representatives. It's also becoming  pretty evident that the US is lagging behind other countries", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Your counter argument is \"a terrible low-intellect argument that doesn’t hold up to five brain cells worth of critical thinking tbh\"", "score": -9, "replies": [{"body": "Damn how many bots on Reddit these days?", "score": 5, "replies": []}, {"body": "Bro I’m agreeing with you lmao", "score": 2, "replies": []}]}]}, {"body": "No. We need cars in our economy *now*. At least, their outlaw or disappearance overnight would wreak havoc. Banning tiktok wouldn't have any negative consequences or fallout (unless you want to be pedantic). It's not even comparable. Also, the point isn't about *technology* but about *immediate need*, so your response is off the mark from the start.", "score": 3, "replies": [{"body": "Fine. Let's ban Toyotas. Better comparison? Nationalist arguments are anti competition.", "score": 0, "replies": [{"body": "No, that still doesn't make sense or follow op's point.", "score": 1, "replies": []}]}]}]}, {"body": "I agree, fuck tiktok. We truly don't need that shit", "score": 16, "replies": [{"body": "Who needs all of this fucking shit called social media apart from degenerate “influencers” and advertisers.", "score": 23, "replies": [{"body": "I mean you are on Reddit aren't you?", "score": 8, "replies": [{"body": "Don’t compare Reddit to TikTok, instagram and such. Where’s the social aspect in Reddit, apart from us anonymously discussing topics on different subs? Your children do not see me doing stupid, bad things influencing them the wrong way, do they", "score": -3, "replies": [{"body": "I will. There's plenty of trash opinions, propaganda, racism, and general hate speech on here too.", "score": 6, "replies": [{"body": "This you can find everywhere, any public forum or blog, anything. You can’t stop the whole internet, but some things are disgusting.", "score": -3, "replies": []}]}, {"body": "facebook also had cambridge analytica and get hacked all the time, but you people dont care about taht because zuckerberg he has a vr helmet and metaverse, bs,", "score": 0, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}]}, {"body": "The influencees with disposable income.  How else will they know which $50 water bottle to buy?", "score": 1, "replies": [{"body": "Lmao sad story, waste money instead of helping the billions of people who need something to eat", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -2, "replies": [{"body": "Lower response aggression by 30% please…", "score": 3, "replies": []}]}]}, {"body": "Capitalism is not about need. TikTok Chinese SWE labour camps just served up a better quality of algorithms. That consumers just weren’t getting from Zuck & other social media. \n\nSimilarly, Zuck is banned beyond the Great Firewall. Don’t stop them risking VPNs & police visits to log on. If social media is a drug being perfected, why limit yourself to the bad highs?", "score": 2, "replies": [{"body": "This used to be common sense... good products make it. Bad ones fail. Nationalism makes people stupid.", "score": 4, "replies": []}, {"body": "i dont limit it much man wat", "score": 1, "replies": []}]}]}, {"body": "Same goes for the Internet \nAnd space travel", "score": 1, "replies": [{"body": "Hot showers and flush toilets! People lived thousands of years without it.", "score": 0, "replies": []}]}, {"body": "It was banned to censor news/views of Israeli atrocities in Gaza. Not a good look tbh. ", "score": -2, "replies": []}]}, {"body": "Oh no. Anyway. ", "score": 5, "replies": []}, {"body": "Minor hit to businesses vs destroying democracy... Well, someone needs to care about the businesses, they are people too!! /s", "score": 8, "replies": [{"body": "Oh you mean like Facebook did with Cambridge Analytica which allowed bad actors to access enough private data to potentially influence the 2016 elections? \n\nBy contrast I've yet to hear a single person ever allege that TikTok's interference ever influenced an election result. All the people who want to ban TikTok completely ignore all the changes TikTok made years ago to address the concerns about Chinese control/etc., which they made with Oracle and some US government regulators input.", "score": 6, "replies": [{"body": "And we all trust Facebook and Oracle to do the right thing...", "score": 2, "replies": []}]}, {"body": "I hate TikTok like everyone else here but if democracy is being destroyed by an app showing short video clips about mostly trivial stuff, then maybe there is more an issue with the political landscape", "score": 7, "replies": [{"body": "People can get radicalized regardless of the political climate. TikTok just makes it a lot easier to blast propaganda into everyone's phones in a way that seems to resonate with younger crowds. The amount of people who openly admit to doing the bulk of their \"learning\" and getting their news from TikTok is mind boggling. It's especially troubling given recent anti-education movements growing in popularity in the US.", "score": 2, "replies": [{"body": "I understand that TikTok is very efficient in that matter due to the good algorithm, but the main issue would then also affect every other social media platform. Don’t you think Twitter currently radicalized people or at least divides the political views even more?\n\nLearning something through TikTok is just popular because it’s short form content. It’s like how more and more people will learn with ChatGPT because it can break down things or summarize long texts.", "score": 3, "replies": [{"body": "Dude LLMs are not that good at replacing people yet… This is obviously a bot response lol.", "score": 0, "replies": [{"body": "It’s as good as using TikTok as source for information", "score": 1, "replies": []}]}, {"body": "Oh I totally agree almost every social media platform has a hand in creating the political and social tensions we're dealing with today. This doesn't make the influence of TikTok any less nefarious. Also, TikTok isn't beholden to the same regulations as social media platforms not originating from China, and the massive amount of data collection being done by the Chinese government is concerning to say the least. TikTok also seems to reach a lot more young people faster than other social media platforms but I don't have any proof to back that up.\n\nI don't fully agree on the last point. ChatGPT makes sense to learn with - it's artificial intelligence that makes information more streamlined. TikTok is a social media platform where anyone can post anything and it doesn't have to try to be accurate at all. That's why getting your news and your learning from TikTok is troubling. Even more troubling is how readily people seem to accept the information they get from short TikTok videos and how much disdain they show for established and well reviewed sources  with checks and balances.", "score": -2, "replies": [{"body": "Which regulation doesn’t apply to TikTok? And their data is already hosted in the US for US users that’s why Oracle is worried if they have to go.\n\nAlso just because a LLM makes information more streamlined, it doesn’t mean that’s accurate. ChatGPT regularly gives wrong information, and the whole stories that came up with Google implementing their chatbot into the search should show that you can’t trust it either.", "score": 1, "replies": [{"body": "This is a bot.", "score": 0, "replies": [{"body": "Every second comment of yours is about bots, are you sure you know what a bot is?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Oh no! We have to save democracy by limiting free speech and the free market!", "score": 1, "replies": []}]}, {"body": "Saying this as someone on the asian side of things.....you don't need tiktok its a brain rotting cancer", "score": 7, "replies": [{"body": "What I don’t need is the government telling me what software and media is good for me. Maybe you do though?", "score": -5, "replies": []}]}, {"body": "Boo\n\n\n\n\n\nHoo", "score": 4, "replies": []}, {"body": "Who wants pizza?", "score": 2, "replies": []}, {"body": "Good", "score": 1, "replies": []}, {"body": "Great heavens, would someone please consider the business?", "score": 1, "replies": []}, {"body": "I find it hilarious that people don’t care about things that don’t directly affect them. A lot of companies that (like oracle) make a significant portion of their revenue from TikTok advertising and from tik tok in general will be having layoffs, from the revenue losses. This means a lot of you snarky mfs will be getting laid off as soon as the app is banned because of the loss of revenue. Good luck!", "score": -3, "replies": [{"body": "On one hand, I'm fairly certain that Oracle's earning calls from past years, where they've posted higher 20%+ revenue and profits compared to past years have not translated into raises and better QOL for their employees. I hope I'm wrong on this.  \n\nOn the other hand, TikTok is literally China's way of penetrating world markets with propaganda and is filled with low-quality AI-generated videos and talking points. There's no reason why the US or any other country should accept having its data freely shipped to China. No amount of revenue for a private company should permit that.", "score": 14, "replies": [{"body": "There is no such thing as enough money for corporations. They will say they’ve had the highest earnings of all time and still act broke and layoff thousands of people. Losing 1/7 of your income in a single year will be a massive blow to the business. I do not care how much they are making. 20% lift can be extremely low compared to their lift from five years ago. It means absolutely nothing, I used to work in tech. Those year-over-year bumps mean nothing, they look at 10 year stretches. This is not a game, and many people will lose their livelihoods", "score": 1, "replies": []}, {"body": "I worked at Oracle, and you’re right. Every quarter they’d have a big meeting where they’d pat themselves on the back for beating expectations. I was paid a bonus every quarter and part of the metrics of that bonus were performance of the business. Every quarter I was disappointed and was told that we didn’t hit the metrics outlined in the comp plan. The first time that happened, I thoroughly read the comp plan and realized that the revenue goals for the bonuses were roughly 40% higher than wall streets expectations. I get having stretch goals but cmon lol. There were a ton of other issues when I worked there but I think that ones the most relevant.", "score": 0, "replies": []}, {"body": "This is just another xenophobic red scare. you are pathetic for believing they need our data from tik tok. There are better ways to get it. The Apple phone that most of you have would be a much easier way to collect much more than just data and it is made in China. There are other apps like SHEIN Ali express Temu that have had actual data breaches to speak of. And putting all that aside all of our data is available on the open market. They don’t need an app to steal our data. And as far as the propaganda goes? There are laws that protect peoples access to media and yes, even propaganda. The government is overreaching and setting a precedent for them to do things that you probably won’t like in the future. Sitting TikTok aside, I am not OK with giving our government more power.", "score": 0, "replies": [{"body": "I'm sure all the brainwashed Americans are really benefiting from all those laws and regulations against propaganda that you speak of. There are countless sources of information showing how China and Russia are using social media to brainwash clueless Americans (and people from other nations) on a regular basis.  \n\nI'm fairly certain that you can check these for yourself but I'll be happy to provide some links of you need me to.  \n\nThat aside, more power to the US government is only a smoke show. Your NSA already knows everything there is to know about US citizens. :)", "score": 5, "replies": []}]}]}, {"body": "They don’t make money from advertising, they host the app in their data centre", "score": 3, "replies": [{"body": "The point is that people are laughing and saying that this is cool, wait till you see the impact on the economy and your bum ass jobs 😂 trust me the cuts are coming when these companies lose ad (and hosting) revenue.", "score": 1, "replies": []}]}, {"body": "I'm okay with that", "score": 2, "replies": [{"body": "Eh, it’s always fun and games until it’s your family or your job. Idc about you either", "score": -7, "replies": []}]}]}, {"body": "Doesn't it depend on how it's divested though? Wouldn't it benefit TikTok to just sell off the US business then Oracle can still swoop in or maintain existing contracts to whoever inevitably starts their own version of it?", "score": 0, "replies": [{"body": "They would not need Oracle if they were to be on US so they could have their own servers. The only reason they went with Oracle so they can audit the algorithm.", "score": 0, "replies": []}, {"body": "How would it benefit a company to sell of it's cashcow assets when it's monetizing them?", "score": -5, "replies": [{"body": "Because the government literally said they have to.", "score": 0, "replies": [{"body": "Lolwutstupidityisthatshitanswer.", "score": 0, "replies": []}]}]}]}, {"body": "TikTok, the Chinese company, is citing *checks notes* the First Amendment of the US constitution. Nice.", "score": 0, "replies": []}, {"body": "Oh shoot, in that case, never mind the national security concerns. We need to make sure Oracle can make more money.", "score": 0, "replies": []}, {"body": "Frick Oracle & tiktok...", "score": -3, "replies": []}]}
