{"title": "POV: waiting for NVDA to dip so I can buy", "selftext": "", "id": "1d9divd", "created_utc": 1717663494.0, "score": 264, "upvote_ratio": 0.99, "num_comments": 105, "comments": [{"body": "Investor: watches NVDA waiting for an entry point\n\nNVDA: Gains 50% then dips 5%\n\nInvestor: at long last, my entry point 😌", "score": 107, "replies": [{"body": "i'd been holding from 750. Temporarily sold at 1144 for another stock. Immediately after that, nvidia wen to an all time high, while the other stock dropped 20%, and now im stuck ✌🏻😎", "score": 35, "replies": [{"body": "I was in it at $760 dip then sold when it stabilized.  Now I'm just waiting for the split, then slight dip and I will buy and HODL.", "score": 1, "replies": []}, {"body": "Trading is for fools. Never trade a stock for another. Park in the index funds qqq xlk splg etc and then wait for an entry for the next stock or even the same stock", "score": 1, "replies": []}, {"body": "Smci?", "score": 0, "replies": [{"body": "Nah, SMCI have already fucked me enough. AGBA, waiting for the merger ✌🏻", "score": 2, "replies": [{"body": "Never wait for merger plays. Got burned once never again", "score": 1, "replies": [{"body": "why? got cancelled?", "score": 0, "replies": [{"body": "The ticker ended diluting and missing financial reports and eventually up a penny stock that got kicked off the market. The merger complicated their corrupt financials.", "score": 1, "replies": [{"body": "I see. Triller has an opportunity to become N1 platform in US if TikTok gets banned, so they have big plans, working on new AI and shit. And AGBA has big promises too. So im optimistic, but I'll try to be alert", "score": 1, "replies": [{"body": "The ticker I’m referring to BBIG had a similar story of having a social media app that can take the opportunity of a potential TikTok ban. don’t buy dips on merger acquisition stocks", "score": 1, "replies": [{"body": "i'll look it up", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I sold at 1160 few days ago 🥹", "score": 0, "replies": []}]}, {"body": "Exactly. Your dip was a worse opening than if you just bought a position 2 months ago.", "score": 4, "replies": []}, {"body": "lol 5% dip… I ll wait for it to keep dipping, Oct 2022 dipped 90%…. I ll wait for 95%", "score": 2, "replies": []}]}, {"body": "Same ppl waiting for housing prices to drop", "score": 19, "replies": [{"body": "Lmao, i literally put my home deposit in nvda, while i wait for house prices to drop.\nBut it was a good decision so far...", "score": 6, "replies": []}]}, {"body": "Here it is. I’m buying", "score": 14, "replies": []}, {"body": "Your wish has been granted today.", "score": 11, "replies": []}, {"body": "I think OP jinxed us.  Shit's crashing like the Hindenburg this morning.", "score": 23, "replies": [{"body": "A whole 1%. Brutal.", "score": 30, "replies": [{"body": "When I posted this 20 mins ago, it was down 3%, and was down 5% from ATH which was set 30 mins ago.  So a 5% drop in the span of 30 mins isn't \"nothing\".", "score": -3, "replies": [{"body": "I didn’t say “nothing”, if you’re going to use quotes.", "score": 13, "replies": []}]}]}, {"body": "I might’ve fucked up and bought at 1250 thinking it would be like yesterday 😔", "score": 12, "replies": [{"body": "Fucked up perhaps if you’re selling end of day or next few days. If you’re holding for the next several months, I don’t think you fucked up.", "score": 5, "replies": []}, {"body": "In the two weeks after the split, it will probably break 1300 if I had to guess. Long term, it’s a good stock. Time in the market >>>> timing the market", "score": 2, "replies": []}, {"body": "I thought that too. That people will buy more before the split. Today is the last day. Markets don’t follow logic sometimes", "score": 1, "replies": [{"body": "My understanding: Thu was shareholder record day, Fri at 4 is share price for split, and Mon is a whole new ballgame.", "score": 2, "replies": []}, {"body": "Maxed out my Roth IRA and bought 5.9 shares today.", "score": 2, "replies": []}]}, {"body": "I mean of course everyone on here is telling you to buy in on the high. They are hyping the stock up to dump their shares all at once at the high. Guarantee half this subreddit is going to sell everything they have today or tomorrow but it would hurt them to tell you that", "score": 1, "replies": [{"body": "I have dumped nvdia a few times in the last year and left a sh*tload of money on the table. I would not recommend it.", "score": 3, "replies": [{"body": "Me too, I did this a few times, including before earnings as I was worried it would tank on weak guidance. Still made a lot of money but played it a little too safe.\n\nRight now sitting with 100 at 1113 and 50 at 951.", "score": 2, "replies": []}]}]}]}, {"body": "Zoom out and it barely registers as a wobble.", "score": 3, "replies": []}, {"body": "OP definitely did. These kind of investors are so annoying", "score": 2, "replies": []}, {"body": "Yup, I should have and bought today instead of yesterday.  It's still going down.", "score": 1, "replies": []}, {"body": "Market Makers trying to shake out the paper hands.", "score": 1, "replies": []}, {"body": "Well that aged well....", "score": 1, "replies": []}, {"body": "Like the north tower 🫠", "score": 1, "replies": []}]}, {"body": "I feel exactly the same", "score": 12, "replies": []}, {"body": "This post encouraged me to buy 1 share. I now have 2 shares! Thanks!", "score": 4, "replies": [{"body": "I maxed out my Roth IRA and put 5.9 shares in.", "score": 2, "replies": []}]}, {"body": "Even if it’s down today tomorrow it will go up because tons of investors want in before the stock split.", "score": 6, "replies": [{"body": "Today 4pm is the last day to get in on the split though.\n\nI’m not sure what happens with investments made tomorrow ", "score": 1, "replies": [{"body": "Isn’t tomorrow the last day to get in on the stock before the split ? I thought the split is happening on Monday. Friday is the last business day before Monday ?", "score": 4, "replies": [{"body": "https://www.msn.com/en-us/money/topstocks/what-you-need-to-know-ahead-of-nvidia-s-10-for-1-stock-split-on-friday/ar-BB1nKXAn?ocid=BingNewsSerp  \n\ni know very little about this so that’s all I know 😕\n\nEdit:\n\nit’s seems like everyone gets the splits but folks in by Thursday get the initial June 10th opening price.\n\nI wonder if that means that if you buy on Friday, you may have to wait a period to trade or something like that?", "score": 2, "replies": []}]}]}]}, {"body": "[**U.S. regulators to open antitrust probes into Nvidia, Microsoft and OpenAI** ](https://www.cnbc.com/2024/06/06/us-regulators-to-open-antitrust-probes-into-nvidia-microsoft-and-openai.html)-- you got your wish.", "score": 8, "replies": [{"body": "Thank's for sharing that (I haven't read of that one yet). That kind of frustrates and even infuriate me, as someone that actually believes in Nvidia. To all my knowledge and understanding, Nvidia is 1000% a legitimate company, and they've gotten where they are simply by being the best, better than everyone else, and investing in the areas of tech that were gonna boom the most.\n\nNvidia doesn't do sketchy business practice like Microsoft has (and continues to do). I've been buying their graphics cards for decades, they've always allowed third party manufacturers to produce hardware. They've never done what Microsoft has done, forcing users to use only their products and software, creating barriers to alternatives.\n\nThis smells like government regulators wanting to cash in on their success. The only ones needing antitrust probes are the US government itself.", "score": 8, "replies": [{"body": "Good news is that it's just a probe, so maybe after the probe they think everything checks out ¯\\\\\\_(ツ)\\_/¯", "score": 4, "replies": [{"body": "And some people enjoy a good probing.\n\nJust sayin’ 😏", "score": 1, "replies": []}]}, {"body": "Feels like market manipulation. Why announce it Thu of all days.", "score": 2, "replies": []}, {"body": "Antitrust is garbage. They have tons of competitors but they are the best at what they do so they are profitable.", "score": 2, "replies": []}]}]}, {"body": "Please go higher and higher🫨 then I sell my Long and we can start the dip hahah", "score": 3, "replies": []}, {"body": "Dipping a bit now it seems 👀", "score": 5, "replies": []}, {"body": "Man … I swear … y’all only 2 days into the future. Span out 5 years and then 10 years. How many splits it’ll go through…how many milestones demolished, how high NVDA Market Cap will soar…TODAY IS CHEAP AF! Bought me 3 more today and it’s a damn good deal compared to what it’ll be in 2030!", "score": 5, "replies": [{"body": "T H I S is the answer!\n\nIf you hold it 366 days then your gains tax rate becomes a flat 15%\n\nI don't sell till the GOAT nancy sells", "score": 3, "replies": []}, {"body": "yes u are right, if u plan to hold till 2030. I'm not that long tho. Im aiming to raise enough for the mortgage by the next year, so every dip matters", "score": 2, "replies": [{"body": "Everyone’s situation is different, I respect that. Yes, I am definitely holding LONG. I want to see that impact AI makes yearly and NVDA’s growth as well throughout the years ahead.", "score": 1, "replies": [{"body": "If i have enough for playing LONG, ill definitely invest in NVDA as well 🙌🏻", "score": 3, "replies": []}]}]}]}, {"body": "😭", "score": 3, "replies": []}, {"body": "Im having mutual fund buyers remorse. I was going to sell all my shares to buy NVDA today before the split but remembered  I’ll have to wait until the market closes for the sell to go through. I feel it’ll be too late then.", "score": 3, "replies": []}, {"body": "Buy today or tomorrow morning. I will do the same but I can not click the submit button cuz I am too afraid", "score": 3, "replies": []}, {"body": "Well now’s your chance shits gonna be free falling today", "score": 3, "replies": []}, {"body": "GET IN BEFORE SPLIT !!", "score": 3, "replies": [{"body": "why? nobody knows what will happen after split", "score": 2, "replies": [{"body": "Read the gubble report its gonna rise to 200", "score": 4, "replies": [{"body": "Right? Stock worth $1200 becomes $120 is going to be purchased in bulk Monday.", "score": 2, "replies": [{"body": "If you read the gubble rubble subble robal report, it will hit 3000 by the end of the century", "score": 2, "replies": []}]}]}]}]}, {"body": "NVDA drops by a total of 1.5% end of day today\n\n\n*** People waiting for the dip: “Now’s my time”", "score": 3, "replies": []}, {"body": "I’d just buy the stock of you have faith in the company. \n\nPeople were waiting @ 400, then it kept going up! Dips were only 5% at most! Lol", "score": 3, "replies": []}, {"body": "Buy the dip. But don’t wait for the dip.", "score": 3, "replies": []}, {"body": "A BLESSING FROM THE LORD", "score": 6, "replies": []}, {"body": "Pablo Meme has entered the chat 😂", "score": 2, "replies": []}, {"body": "My buddy gave me shit when I bought at an all time high at the end of 2016.  He's still waiting for that perfect dip. \n\nCan't time the market.", "score": 2, "replies": []}, {"body": "I believe it will pop to 160 pps post split. Too many good things going  for nvda. Either way, I am loaded and long.", "score": 2, "replies": []}, {"body": "[SAD PABLO](https://i.kym-cdn.com/photos/images/newsfeed/001/373/328/b16.jpg)", "score": 1, "replies": []}, {"body": "$105.00 per share", "score": 1, "replies": []}, {"body": "Doesn't get any lower than after the split", "score": 1, "replies": []}, {"body": "Or take out your second mortgage", "score": -1, "replies": []}, {"body": "If It dips, you might not even want to buy it.", "score": 0, "replies": []}, {"body": "Make sure you don’t buy the dip, it will keep on dipping after you buy the dip, its how it works!", "score": 0, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "i hope, but i dont believe", "score": 5, "replies": []}, {"body": "I bet it will be 140", "score": 7, "replies": [{"body": "It won’t healthy if it runs upto 140 that quickly, the reason this has been a good investment is because of the numbers and increase being inline, once growth outpaces the numbers then it won’t be the best pick because it’s being run up on purpose too dump bags ", "score": 4, "replies": []}]}]}, {"body": "now!", "score": -1, "replies": []}]}
{"title": "NVDA may dip to 850 again?", "selftext": "I'm not a chartist but I've read some chart wizards predict a gap fill back to 850 (85 post split). It obviously won't happen all at once or anytime soon but it eventually will. Stocks can't go straight from 752 to 1250 without a pullback. The dips will be bought and it will keep growing long term.\n\nEveryone here laughed when dieselcock predicted a dip to possibly 730 when 970ish was rejected twice. It did dip down to 752 which was pretty damn close. I regret not buying that dip.\n\nNext time I will be ready to buy.", "id": "1d9outy", "created_utc": 1717697501.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 88, "comments": [{"body": "If it does, I’ll be buying more. But honestly I will be surprised if it does.", "score": 20, "replies": [{"body": "Same along with a ton of other people.\nI'd live to buy shares at 85.", "score": 7, "replies": []}, {"body": "Second that. Dip maybe, crash no. Fundamentals are too strong, they will continue to deliver. I give them 3-5 years before anyone makes a real dent in their business model.", "score": 4, "replies": [{"body": "Yeah this is at least a solid hold for the next few years.", "score": 1, "replies": []}]}]}, {"body": "nah... keep in mind last year, it ranged between 400 and 500, so 20% range. if 1250 is the resistance, then 1000 would be support if it repeats last year's pattern. also... a single day down and everyone is acting like NVDA is crashing? too soon", "score": 10, "replies": []}, {"body": "It might, it might not. Timing the market is really hard. We could also mostly go up from here on. The real question is how long are you planning on holding and what do you think it will do long term. If you think it will be $3000 (pre split prices I mean) in 3 years does the $100 or $200 you *might* save if it dips matter?", "score": 8, "replies": [{"body": "Yeah it’s about to be 120 a share, why would people sell off now? It’s cheaper than it’s been in awhile, and they’ve only had good news", "score": 5, "replies": []}, {"body": "850 is 350 per share less than the current price of 1200. That is significant.", "score": -2, "replies": [{"body": "It is for sure. But if the stock doesn't come down and just climbs and climbs you're potentially missing out on $2000/share in my example. The difference between $2000/share and $2350 isn't very much \n\nI obviously don't know what's going to happen, but I missed out on Amazon and Apple because I kept waiting for an arbitrary pull back figure to buy in at", "score": 5, "replies": [{"body": "Well yeah 850 vs 1200 is a 41% difference.\n\n2000 vs 2350 is a 17.5% difference.", "score": -1, "replies": [{"body": "Right, but it's more like not buying at all because you're waiting for 850 as it goes up to 2000\n\nI'm not trying to tell you what to do but I've had a few friends who missed on many a good run, in fact they told me about them, but just kept waiting for some arbitrary lower figure that didn't come. \n\nThere's an old saying (which only applies to stocks that are going up) the best time to buy is 5 years ago. The next best time is today", "score": 1, "replies": []}]}]}, {"body": "You’re too smart for these people don’t even bother explaining.", "score": 3, "replies": [{"body": "Thanks man. This is pretty basic stuff so it's kinda surprising but what can you do.", "score": 3, "replies": []}]}, {"body": "LOL...why is this downvoted? That is a statement of fact.\n\n850 a share IS 350 per share less...and that's...just objectively significant.", "score": 1, "replies": [{"body": "No idea I just have to laugh at this point 😂", "score": 1, "replies": [{"body": "I'd get if it was something people didnt' WANT to hear(like NVDA is NOT going to hit 1000 by 2027)...but...yeah, this was more ridiculous.", "score": 2, "replies": []}]}]}]}]}, {"body": "So you expect the price to drop 30% by tomorrow? wtf", "score": 9, "replies": [{"body": "People are legit so stupid lmao", "score": 7, "replies": []}, {"body": "What part of my post makes you think by tomorrow??\n\n\"It obviously won't happen all at once or anytime soon but it eventually will.\"", "score": -1, "replies": [{"body": "So you’re basically just spreading FUD", "score": 3, "replies": [{"body": "Does this sound like FUD to you?\n\n\"The dips will be bought and it will keep growing long term.\"\n\nWas it FUD when it went from 976 to 752?", "score": -3, "replies": [{"body": "We had a $60 pull back today and then you’re telling people it’s going to fall more to $850. I would say that’s Fear Uncertainty or Doubt, you don’t?", "score": 4, "replies": [{"body": "Do you know what the word \"may\" means?", "score": -2, "replies": [{"body": "Yes, it means you’re “uncertain”, do you know what FUD means?", "score": -2, "replies": [{"body": "Does this sound like FUD to you?\n\n\"The dips will be bought and it will keep growing long term.\"\n\nWas it FUD when it went from 976 to 752?", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I doubt it will get that low again. Lots of strong support levels between where we are and 850. \n\nTalking heads say there is a lot of retail money still on the sidelines. With NVDA all over the news it’s likely some of that will flow into NVDA to offset some of the profit taking. \n\nEither way Nvidia is a leader in the sector and positioning itself to stay that way.", "score": 3, "replies": []}, {"body": "Hope so. I’ll load up on more!", "score": 3, "replies": []}, {"body": "You granma can turn back as a virgin but nvdia never dip to those levels", "score": 3, "replies": [{"body": "It was below 800 a month ago, anything can happen", "score": 1, "replies": []}, {"body": "It was 850 less than two months ago. Never say never.", "score": 1, "replies": []}]}, {"body": "Chart looks like it should retrace back to $980 or $98 post split.", "score": 3, "replies": [{"body": "That would be good entry!", "score": 1, "replies": []}]}, {"body": "I bought a few shares high but it won’t dilute all\nThe shares I bought at $374. It’s all a crapshoot, you have to make your own decisions on this one.", "score": 2, "replies": []}, {"body": "It’s totally possible, that’s 85 post split", "score": 2, "replies": []}, {"body": "One day down and its all doomsday events geez..  HODL .. closer to the bottom than the top when it splits.. means alot more room to up. Nothing has changed!!", "score": 2, "replies": []}, {"body": "Respect to your crystal ball, but it’s not gonna happen 👆", "score": 2, "replies": [{"body": "Not my crystal ball.", "score": 1, "replies": []}]}, {"body": "Wait till Goldman Sachs starts the omega rug pull. It’s going to be funny. I think most people in here have nothing to worry about because they bought at low prices. It’s the people who bought at 1000 and above that are going to have the shock of their lives. I personally think they’re waiting for the split so they can fleece retail into paper handing while shorting it down.\n\nIt’s pretty easy too. They own enough shares for a nice shock and awe campaign on the price. Once people like Cramer start getting too excited, you know there’s trouble ahead.", "score": 2, "replies": []}, {"body": "Gaps don't always fill.  If the gap was created with real news it probably won't fill.  Chart reading is really good at seeing what happened and then reasons for it, not predicting.", "score": 2, "replies": []}, {"body": "I welcome a pullback of that magnitude.\n\nMy average cost is $444. Bring it on.", "score": 2, "replies": [{"body": "Same here man.", "score": 1, "replies": []}]}, {"body": "I don’t know why your getting downvoted, I am prepared for it drop 50% in the short term. In the last few quarters the price has has been driven by revenue growth, their margins and EPS. I don’t expect Nvidia to swing a perfect game, competition is creeping up on them and the government is acknowledging their significance in the market. I am long NVIDIA. There is a reason only AMD and Intel existed as the only real competition in general purpose processors and it is because of patents and their own cross license agreement. Via never became a real competitor to AMD and Intel. I think the complexity of NVDA market dominance goes well beyond instruction sets and will continue to grow but I imagine they will see set backs in the near term.\n\nI would mention that one of the factors that kept AMD alive is that they were willing to accept the slim margins of producing chips for gaming consoles until their R&D led by Jim Keller developed the zen architecture.", "score": 2, "replies": [{"body": "Thanks, I guess people don't like to hear that stocks dip after going straight up? Any parabolic chart for any stock always has a pullback.", "score": 2, "replies": []}]}, {"body": "I got out of 2,000 shares in the 700’s. At that point this was starting to get irrational. It’s possible we continue to 200 post split or even more, euphoria and momentum are powerful things.\n\nNVDA is a great business but they are now priced as if they will hold this monopoly and margins in perpetuity. No one should feel comfortable with these valuations unless they don’t understand basic finance. This is coming from someone who routinely pays premiums for stocks with insane potential. \n\nThis guy got downvoted simply for asking if 850 might happen. 85 post split? Easily will happen, but people are too delusional and emotionally invested to realize it.", "score": 1, "replies": [{"body": "You got out in the 700s because you thought the price was irrational back then. There were people calling irrational when it was 300, 500, and now 1200. But until there are any real signs of weakness, it's best to stay invested.\n\nNow the OP's question of can it to back down to 850 (85 post split)? Of course it could. But saying this \"easily WILL happen\" is quite an overstatement. The fundamentals of NVDA's strong earnings and dominance hasn't change. So if there is some pullback, you can bet that there are many who will buy the stock way before it sees 850. just my 2c.", "score": 6, "replies": []}, {"body": "Valuations are out the window as mild hysteria sets in. The fact that DJT - after 6 months - is still afloat makes me believe that this stock has a long run way.", "score": 2, "replies": []}, {"body": "Agreed, but we all know the market is irrational. GME is up 47% so far today.", "score": 2, "replies": [{"body": "GME is a meme stock. NVDA is a company that dominates their market niche globally based on hard benefits, outstanding execution, long track record, etc.. You couldn’t find two more different companies. Not comparable at all.", "score": 9, "replies": [{"body": "They are indeed completely different and not comparable, but the driving force behind their momentum is sometimes similar. FOMO fueled by lack of understanding of financial markets.", "score": -3, "replies": [{"body": "You are beyond clueless. The “ momentum” is actually just a pump and dump orchestrated by “ roaring kitty.” That is why GME P/E was getting close to 2,000. GME isn’t even getting pumped through “ FOMO.” It’s getting pumped by internet trolls just like 2021. Hence “ meme stock.” \n\nYes let’s compare an industry leader with a 2-5 year moat  in an emerging and potentially world changing technology to fucking GME. A stock that is getting pumped by internet trolls and a guy named “ roaring kitty.”\n\nSounds like you really got strong financial literacy but can’t be bothered to do 5 minutes of basic research.", "score": 1, "replies": []}]}]}, {"body": "GME is down 40% today. NVDA is stable. See my comment above.", "score": 1, "replies": []}, {"body": "You lost all credibility comparing GME to Nvidia lmao. GME is a pump and dump orchestrated by “ roaring kitty” which is why the P/E was closing in on 2000. If you see a P/E of 2000 especially in a company like fucking GameStop it’s crystal clear it’s a pump and dump.", "score": 1, "replies": [{"body": "I did not compare GME to NVDA. Just saying the market is irrational.", "score": 2, "replies": [{"body": "You're trying to use GME as an example of the market being irrational therefore setting the precedent that Nvidia could drop just like GME did when Stevie Wonder could see GME was going to crash any day because it was a crystal clear pump and dump scheme.\n\nHell the P/E of nearly 2000 could have told you that alone if you just choose to ignore all the attention \"roaringkitty\" was getting for his pump and dump scheme including the all the news talking about him getting banned from E\\*Trade and all the drama surrounding that.\n\nNvidia isn't going to have some major crash for at least the next few years. We may have some dips and even more volatility post split but it's not going anywhere for at least 6 quarters. They are basically sold out for the next 6 quarters with no signs of slowing down. Microsoft just axed a bunch of shit and laid off 1500 employees blaming AI. Microsoft is literally cutting projects and employees so they can pump more money into AI. When the largest company in the world is doing that do you honestly think we're going to have a crash in the next few years? Highly unlikely.\n\nPeople like you are the same guys who post their -60k portfolio on wallstreet bets from losing their ass on Nvidia puts for the last 6 months.", "score": 1, "replies": [{"body": "No I didn't say any of that. Relax bro.", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">Everyone here laughed when dieselcock predicted a dip to possibly 730 when 970ish was rejected twice. \n\nHe predictied 700 by May/June (Here we are!) and I called him out for this BS and the mods deleted my post.  He reversed course and posted a prediction of $1200 a few weeks later.  Even a broken clock is correct 2 times a day.  I was not the only one who called him out, but people's memories are short on Reddit.\n\nIf you are convinced that NVDA is going to 850,  short it.  It sounds like a sure bet! Right?", "score": 1, "replies": [{"body": "I haven’t seen any post from dieselcock recently, what happened to him", "score": 1, "replies": [{"body": "He's still posting regularly on the old thread.\n\nhttps://www.reddit.com/user/Dieselcock", "score": 1, "replies": []}]}, {"body": "Here is the thread. He did predict 700 and it got as low as 752 in April which is pretty close. No one is going to predict the exact price but he did good.\n\nhttps://www.reddit.com/r/NVDA_Stock/s/Dc02aWbbiE\n\nAlso if you follow his posts, he predicted NVDA would plow from 1,000-1,200 quickly and have profit taking right after it flipped AAPL. So he was spot on with those.\n\nWhat are your predictions? How low do you think NVDA will dip?", "score": 1, "replies": [{"body": ">What are your predictions? How low do you think NVDA will dip?\n\nFirst of all.  I'm a long and don't predict any more than the banking \"anal\"ists.  I LOL when I hear people say they are waiting for the \"dip\" so they can initiate a position or buy more.  I don't believe anyone can predict/time the market, no matter how many chicken bones they throw on the floor or charts they review.  Trying to predict the future is a folly.  I do believe in DCA.\n\nWith that said, I'm in at $44.55 in September of 2019.  If you review my posts, I'm currently struggling with an \"exit\" strategy.  It's not that I don't believe in NVDA, but rather I think I need to part ways with NVDA and take my 27x return and sit on the beach (see reference to boating below) for a while and look for my next \"10x unicorn\".\n\nI'm just wrapping up a multi-day boating trip on the Colorado river and it has been very nice out (110F with water temp of 80F).  Lake Mohave  is the location and I'm typing this from a hotel on native tribal land to be more precise.  I retired early and enjoy a very good quality of life.  I got here as a result of disciplined investing and holding for the long-term. Technical analysis and short-term investing is not in my vernacular.\n\nThe question I have to all those reading this is do you believe in short term, chart reading, or long-term holding of fundamental value?\n\nI've been holding NVDA as a long-term fundamental value holder for 5ish years.  I'm checking out with 27ish times my money.\n\nGood luck to all longs and NVDA to the moon.  🚀", "score": 7, "replies": [{"body": "Cool man, congrats. I wish I knew to invest in NVDA back in 2019.", "score": 1, "replies": []}]}, {"body": "I remember his post, he had some data to back up what he was saying. Not everyone agrees on TA but I found it helpful. \n\nIt got ugly in mid April but didn’t stay there long. I went in and set stop losses to lock in some profits just in case the bottom fell out, thankfully things didn’t drop that low. \n\nThere will eventually be a pullback in NVDA but with the catalysts I think we have room to run before that happens. Even if we pullback from here $850 is a long way down. Some a trimming positions and taking profits but post split new buyers will send us higher. imo", "score": 2, "replies": []}, {"body": "It went to $752 because Israel sent a drone to Iran the night before.", "score": 0, "replies": [{"body": "So you're saying any bad news event can bring the stock down? The war has no end in sight, it can happen again.", "score": 0, "replies": []}]}]}]}, {"body": "Post-split, any dip is a screaming opportunity to buy. Don't let a dip go to waste.", "score": 1, "replies": [{"body": "What about pre split?", "score": 1, "replies": [{"body": "If you take a long term view, why not?", "score": 2, "replies": []}]}]}, {"body": "Why are people so stupid to even read that kind of crap…", "score": 1, "replies": []}, {"body": "[$34B Short Bets. The rich might get richer.](https://finance.yahoo.com/news/short-bets-against-nvidia-stand-202747041.html)", "score": 1, "replies": []}, {"body": "Hey after the split I’m cool with 850", "score": 1, "replies": []}, {"body": "So it’s better to sell now and buy on Monday?", "score": 1, "replies": [{"body": "I will let you know on Monday...", "score": 6, "replies": [{"body": "I’ll let you know what you should have done on Monday on Tuesday 😆", "score": 2, "replies": [{"body": "I’ll let you know in July", "score": 1, "replies": []}]}]}]}, {"body": "I predict it will go below 850 on Monday.", "score": -11, "replies": [{"body": "You're funny.  I dare you to short based on this prognostication.  hehe. 😂\n\nGo longs!  🚀", "score": 2, "replies": []}, {"body": "It’ll go to $120 on Monday if things go well.", "score": 2, "replies": []}, {"body": "Huh? It will be well below 850 on Monday after the split.", "score": 2, "replies": [{"body": "Split?", "score": -1, "replies": []}]}, {"body": "Come on now.", "score": 0, "replies": [{"body": "Ok sorry. I asked my Ouija board- it keeps saying 666 for some reason…", "score": -3, "replies": [{"body": "I will have 600 shares post split if it dips to 850$ / 85$ ps I’m gonna get  another 66 shares for that lucky 666", "score": 3, "replies": [{"body": "Damn you rich.", "score": 1, "replies": []}]}]}]}, {"body": "Well below 850, short that pig! Under 150 even!", "score": -3, "replies": []}]}, {"body": "$666", "score": -1, "replies": []}]}
{"title": "Nvidia (NVDA) Will Be Undergoing a 10-1 Stock Split End of This Week", "selftext": "[removed]", "id": "1d9nbrk", "created_utc": 1717693666.0, "score": 287, "upvote_ratio": 0.94, "num_comments": 81, "comments": [{"body": "Sorry, we're removing this post because it's a duplicate, or extremely similar, to another that was already posted.\n\nWe appreciate the effort but we don't need multiple posts that cover the same topic.", "score": 1, "replies": []}, {"body": "How many posts on Monday asking why Nvidia stock dropped 90%?", "score": 445, "replies": [{"body": "There was one time, one of my stocks did a 1-9 or 1-7 reverse split and I almost had a heart attack. Was all ready to retire early until I looked it up lol", "score": 64, "replies": [{"body": "Bad sign", "score": 1, "replies": []}]}, {"body": "What's your over/under", "score": 21, "replies": [{"body": "WSB and /r stocks together?  I'll take over/under 50 new posts", "score": 1, "replies": []}]}, {"body": "“If NVDA is guaranteed to split and go down to $100 a share, puts should be easy money right?”", "score": 23, "replies": []}, {"body": "Luckily, you can downvote them", "score": 5, "replies": []}, {"body": "My guess is: Yes!", "score": 1, "replies": []}]}, {"body": "Long term this will not affect the price for those asking.  In the short term probably", "score": 43, "replies": [{"body": "It’s gonna make the stock look way more attractive to the average retail investor", "score": 27, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Selling covered calls is the thing I'm most excited about because of the split.", "score": 2, "replies": []}]}, {"body": "But how significant will the retail “dumb money” be here? In terms of having a real impact on on market cap?", "score": 2, "replies": []}]}]}, {"body": "Curious whether this will actually bump up the stock. It will certainly make it cheaper for retail investors to buy in. Buying a stock at >1k a share is a little much for most.", "score": 103, "replies": [{"body": "Would people who can't afford to spend over $1,000 on stocks really affect a $3T company?", "score": 74, "replies": [{"body": "People asked the same thing about amzn and googl, but the answer was dow", "score": 22, "replies": [{"body": "Or maybe they rose for other reasons? 🤷🏾‍♂️", "score": 4, "replies": [{"body": "Also stock based comp paid to employees.", "score": 5, "replies": [{"body": "That's barely meaningful to the market cap. That means that if they used to have 900$ leftover for example, which wasn't enough for another stock, now after the split they'll get 4 more stocks (and that's on the worst case).", "score": 2, "replies": [{"body": "Or their management have in their agreement when they meet certain KPIs they receive X amount of stock, which was decent 2 years ago but is astronomical today.", "score": 2, "replies": [{"body": "I don't think anyone gets RSUs / bonuses in stock counts for that exact reason of stock splits. RSUs are granted in money value (like $100K worth of stocks).\n\nAnd I'm saying that as someone who gets RSUs from a pubkicly traded company.\n\nBut regardless, there are 30,000 Nvidia employees. Let's say you're right and for some reason every employee gets $100,000 worth of stocks for free for some reason.\n\nThat's $3B worth of stock. Only 1% of their current market cap ($3T).", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "It might increase option volume a little bit. $1000 isn’t really a barrier for the large majority of investment money, but $100,000 in options exposure might be.", "score": 14, "replies": []}, {"body": "So many brokers have fractional shares.  The stock being expensive isn’t preventing retail from buying.\n\nSecondly, retail traders are not going to impact a nearly 3 trillion dollar company.  \n\nI really don’t think this will impact the price.", "score": 86, "replies": [{"body": "A lot of employees have their packages in stock options rather than straight up stock. Breaking up the stock makes it easier to offer lucrative stock option packages", "score": 19, "replies": []}, {"body": "I would imagine that there would be profit taking eventually. \n\nSurely then it will be my opportunity to buy in (it will be my 20th missed opportunity).", "score": 43, "replies": [{"body": "Haha there are many of us in the same club.", "score": 5, "replies": []}]}, {"body": "Disagree. Yeah it is. Sure you can buy fractional shares but psychologically people want whole shares. Why else would they split. That’s the only reason - to make it more attractive to investors.", "score": 60, "replies": [{"body": "Fractionals also doesn't get you voting rights", "score": 27, "replies": []}, {"body": "It's maddening. My dad only traded in whole shares and gets excited about stock splits, despite his platforms selling fractional shares.", "score": 13, "replies": [{"body": "sparkle saw racial gaze fact market shocking ten hobbies subsequent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": [{"body": "Nah millennial here. I don’t want fraction of share I want a whole shares or be able to buy 50-100 shares.", "score": 7, "replies": [{"body": "ossified aback rinse rain longing thumb employ fly square absurd\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 7, "replies": [{"body": "You are logical and informed. That’s rare of most investors", "score": 6, "replies": [{"body": "I read this in the voice of Gandalph\nthe Great.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "You act as if the average retail investor knows they can buy fractional shares. Here’s a hint, they don’t.", "score": 20, "replies": [{"body": "Idk Robinhood let's you buy by dollar anount.", "score": 6, "replies": [{"body": "And so does fidelity", "score": 5, "replies": []}, {"body": "Understand where you’re coming from, and maybe the definition of “average” is subjective. I’m more so talking about inexperienced investors - can’t believe the number of conversations I’ve had with people that are interested in investing/stock market, yet have no idea what Nvidia is or anything about NVDA’s rise over the past year. Can’t expect those folks to understand the concept of fractional shares and they’re most likely going to look it up, see the price (pre-split) get sticker shock and start looking at cheaper stocks.", "score": 6, "replies": []}]}]}, {"body": "We don't have fractional shares in Belgium, and I think lots of Europe also doesn't.", "score": 8, "replies": []}, {"body": "With our power combined! We account for 0.00001% of daily trade volume.\n\nI think it is more of a mental thing with retail than anything. Ask some if they would buy something for $100 or $1200.", "score": 2, "replies": []}, {"body": "How many times has Apple split over the years? We should all hope Nvidia does the same.", "score": 2, "replies": []}, {"body": "How many people do you think there are who don't even know about fractional shares?", "score": 2, "replies": []}]}, {"body": "I know that other countries have restrictions when buying US stocks. Like they can only buy whole shares and not fractions. This probably helps with international retail investors but I doubt it will do much to raise stock value", "score": 4, "replies": []}, {"body": "Only difference for me is ill be able to sell covered calls, thus more supply price of options go down a little? Even if the iv is high? Asking because everything is a guess not knowing any fundamentals of how prices works.", "score": 4, "replies": []}, {"body": "“Curious whether…” there’s historical data on this stuff", "score": 3, "replies": []}, {"body": "People are going to think it's on sale.", "score": 1, "replies": []}, {"body": "Psychologically, I’d say yes. Buy orders where you’re moving the price up $2 just feels less significant than $20 on a stock that trades for 10x the value.  The market doesn’t have to act this way since you can purchase fractional shares - but I think it will.", "score": 1, "replies": []}]}, {"body": "Stock splits are beneficial in many ways, greater affordability, increased liquidity, more diversification and stock splits allow companies to send positive signals to the overall market.\n\nNvidia is going to be the stock to own for the foreseeable future simply because of their intrinsic value and all of the other companies that are benefiting from Nvidia.\n\nCurrent inside ownership percentage 4.23%\n\nNumber of insiders buying last 12 months 0\n\nNumber of insiders selling last 12 months 8\n\nAmount of insider selling last 12 months 359.88 million\n\n359.88 million is a drop in the bucket for a 3 trillion-dollar company.", "score": 35, "replies": [{"body": "The insider selling thing kind of contradicts the earlier points you made", "score": 7, "replies": []}]}, {"body": "So we looking at $100 then what’s the expected dividend?", "score": 33, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Why bother announcing dividend….. what a joke", "score": 14, "replies": [{"body": "[deleted]", "score": 56, "replies": [{"body": "Oh, thx… I didn’t realize that…", "score": 17, "replies": []}]}, {"body": "If you bought shares in 2002 that is a pretty sweet dividend per share price.", "score": 5, "replies": [{"body": "If only I could go back to middle school and tell myself to buy nvidia stock instead of Pokémon cards.", "score": 13, "replies": [{"body": "Amen brother, that Charizard did not give me the ROI i thought", "score": 3, "replies": []}]}]}, {"body": "It shows they are strong and confident in revenue since tbey can give some of that profit back to the share holders which increases guidance even more.", "score": 1, "replies": []}]}]}]}, {"body": "I have debated buying fractional... I have debated buying calls when it splits... no clue honestly what to do.", "score": 8, "replies": [{"body": "I just bought 20k of 3x long factor, this shit is going nowhere but up for the next 2-3 years", "score": 2, "replies": [{"body": "How will split effect pricing on ETF???", "score": 2, "replies": []}]}]}, {"body": "What was the general trend for companies that have done similar splits? Iirc AAPL did a split a few years ago.", "score": 5, "replies": [{"body": "Pump", "score": 1, "replies": [{"body": "Bit more accurately, it was pump until the split and then get hammered shortly afterward.\n\nI now think this is going to be the case to be honest. There is a reason behind it (DELL), sure, but I hate the way that some AI proxies have been trading since late last week. The fact that they lost their gains and then some as easily as they did on the AI pump that occurred from HPE earnings is a bad look, IMHO.\n\nEdit: I will however say that this will most likely fail to be \"THE\" top some people are looking for, the S&P has never set what was \"THE\" top in June, and it set a new ATH yesterday and today intraday.", "score": 4, "replies": []}]}]}, {"body": "I bought In young in the stock and now do I continue to hold or stay firm and keep", "score": 2, "replies": []}, {"body": "Thanks for posting this since there's been absolutely no news about it recently  \n/s", "score": 2, "replies": [{"body": "IKR... this is unexpected indeed", "score": 1, "replies": []}]}, {"body": "My phone will be blowing up with \"NVIDA dropped below ___\" messages on Fidelity", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "What happens with long/shorts at the stock split? Will they be adjusted or just gone?", "score": 1, "replies": [{"body": "they will be adjusted, also 1/10", "score": 1, "replies": [{"body": "Thank you :)", "score": 1, "replies": []}]}]}, {"body": "Sold my share at 1205 today, keep the cash for the next move.", "score": 1, "replies": []}, {"body": "Historically, post splits are bearish.", "score": 1, "replies": []}, {"body": "Thoughts on buying before or after the split? I'm a newb, be nice pleaseeee", "score": 1, "replies": [{"body": "It doesn't matter. You will have invested the same amount of money, either in a large chunk or 10 small ones.", "score": 1, "replies": []}]}, {"body": "I will buy it Monday for 1/10th the price.", "score": 0, "replies": []}, {"body": "I’m low key jeally", "score": 0, "replies": []}, {"body": "Nvda back to 10 would be a joy to watch. This ai bubble is already starting to burst.", "score": -16, "replies": [{"body": "No, this time really is different.", "score": 1, "replies": []}]}]}
{"title": "Rivian redesigns all-electric R1 pickup and SUV, adds Nvidia chips ", "selftext": "", "id": "1d9tqy0", "created_utc": 1717709475.0, "score": 616, "upvote_ratio": 0.95, "num_comments": 86, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 237 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Report back when Sybian does an AI redesign and opts for Nvidia chips.", "score": 232, "replies": [{"body": "A robot is going to replace my wife's boyfriend?", "score": 51, "replies": []}, {"body": "The hell is sybian", "score": 8, "replies": [{"body": "Google it at work", "score": 100, "replies": [{"body": "No don't Google it, suggest it at the next Staff meeting and watch your career hit a major point of inflection", "score": 35, "replies": []}, {"body": "I thought this was funny so I told my wife. And she’s like, “what’s a sybian?”\n\nSo I dumped her and bought myself a sybian.", "score": 21, "replies": []}, {"body": "And look up milking machines too", "score": 2, "replies": [{"body": "Link", "score": 2, "replies": []}, {"body": "Doesn’t the government ship these for free?", "score": 1, "replies": [{"body": "Those are king-sized strap-ons without lube", "score": 2, "replies": [{"body": "So no?", "score": 1, "replies": [{"body": "The government ships free king-sized strap-ons but no  milking machines yet...", "score": 3, "replies": []}]}]}]}]}]}, {"body": "It's basically a less powerful [Motorbunny](https://motorbunny.com/) with fewer features.", "score": 3, "replies": []}]}]}, {"body": "Nvda you say?", "score": 81, "replies": [{"body": "RINVIDIA", "score": 15, "replies": []}, {"body": "Yes he did say it", "score": 9, "replies": []}, {"body": "BUY BUY BUY", "score": 4, "replies": []}, {"body": "Did not say AI. Do not buy", "score": 4, "replies": []}, {"body": "What do they do?", "score": 1, "replies": [{"body": "Stuff", "score": 8, "replies": [{"body": "BIG if true!", "score": 8, "replies": [{"body": "Big stuff even, some may say huge", "score": 3, "replies": [{"body": "If you’re into stuff you should check out Google ticker symbol GOOG", "score": 2, "replies": [{"body": "thanks, i'll google it\n\n![img](emote|t5_2th52|31226)", "score": 3, "replies": []}]}]}]}, {"body": "Bullish on stuff", "score": 3, "replies": []}, {"body": "bullish", "score": 2, "replies": []}]}]}]}, {"body": "Hey I heard of Nvidia, that's the company that's going to finally make the self driving software for Tesla right?", "score": 89, "replies": [{"body": "NVDA has been working on driving technology since 2015, maybe we’ll get true self driving cars by 2028-30? \n\nhttps://nvidianews.nvidia.com/news/nvidia-paves-way-for-tomorrow-s-cars-with-nvidia-drive-automotive-computers\n\nhttps://futurride.com/2024/03/18/nvidia-previews-new-gpu-and-generative-ai-advancements-for-transportation-at-gtc/", "score": 8, "replies": [{"body": "Why is a chip designer working on self driving? I had love Jensen leather jacket and all but what sort of diversification is this", "score": 4, "replies": [{"body": "NVDA builds a lot of stuff.  Not just chips but the software that helps make stuff run on the chips, and software that helps the software, and then software that does stuff so that the software works betteron the software that run on the chips.\n\nThey make a lot of stuff, its not an accident they are flying.", "score": 9, "replies": [{"body": "They make cute lil demos for their product. Nuff said.", "score": 1, "replies": [{"body": "Always said Nvidia is marketing company. Best in the world. \n\nChips, they're just slightly above AMD. But AMD marketing team is all Redditors", "score": 1, "replies": []}]}]}, {"body": "I can’t tell you why specifically they’re working on self driving, but NVDA has their hands in all sorts of stuff. \n\nTake a look — https://www.nvidia.com/en-us/industries/", "score": 3, "replies": []}, {"body": "Essentially, they also give a hand in the software that their chips are likely going to run in order to also help sell their chips. Nvidia has a lot of R&D in a bunch of different areas on laying down the groundwork for accelerating various task that chips can do from (mostly simulation) medicine, weather forecast, self-driving. etc.", "score": 2, "replies": []}, {"body": "Look into their Omniverse platform. Synthetic data generation for AI training has a *massive* upside potential and is a large part of why their stock is bananas.", "score": 2, "replies": []}]}]}]}, {"body": "These are sick. Idk where all the pessimism comes from on this stock. $RIVN to the moon.", "score": 60, "replies": [{"body": "Pretty sure they're just Elon cultists. Rivian makes really good trucks.", "score": 29, "replies": [{"body": "Former Rivian holder opinion: Great company, great trucks, shit stock.\n\nI'll buy back in when they're profitable, but right now dilution is not off the table.", "score": 13, "replies": [{"body": "Yeah this is it.\n\nRivian vehicles are some of the best on the road for a bunch of reasons. Extremely capable, amazing tech, and built very well. If you can afford one, they’re a great buy.\n\nBut the company can’t make money off these wonderful vehicles, yet. Starting a car company from scratch is *really* expensive, just look at how long it took Tesla to actually start making money.", "score": 7, "replies": []}, {"body": "Buy puts to be profitable from Rivian.", "score": 1, "replies": []}, {"body": "What the chances Appl acquires it?", "score": 1, "replies": []}]}]}, {"body": "They lose at least a Billy every quarter…", "score": 16, "replies": [{"body": "I don’t care. They have awesome tech and eventually will figure it out with scale. I trust that Rivian will sell 1M+ EVs/year much more than any other non Tesla company.", "score": 26, "replies": [{"body": "BYD tho", "score": 1, "replies": [{"body": "Not in the US they aren’t.", "score": 10, "replies": []}]}, {"body": "Easy to make a $139k truck that retails for (if lucky) $100k. Difficult to do it sustainably and profitably. And that’s the question rivian needs to answer. As a customer, not sure if I give a fuck about NVDA chips.", "score": 1, "replies": [{"body": "I think the redesign is heavily focused on cost downs, both from a BOM and manufacturing perspectives", "score": 1, "replies": []}]}, {"body": "Rivia. Is currently losing 39,000 per car sold so hopefully they can figure out how to fix that fucked up margin.\n\n1M EVs would cost Rivian $39B as it currently stands.", "score": -4, "replies": [{"body": "My understanding is the new R1 is no longer losing money.", "score": 9, "replies": [{"body": "I tuned into their last earnings report, they said they were losing 39k, maybe 34k per car sold after all the cost savings they implemented... can't remember exact number... \n\nDid they say something today about their losses during the investor meeting?", "score": 2, "replies": [{"body": "Yes. They said they had reduced part/materials costs significantly with vendors (60%) and reduced the materials needed for the R1 Gen 2 that was launched yesterday. They projected being profitable by the end of the year.", "score": 7, "replies": [{"body": "Gross margin positive, not profitable", "score": 1, "replies": []}]}]}]}, {"body": "Most of that is depreciation cost if you learn to read an earnings report.", "score": 2, "replies": [{"body": "1.4B in loss from operations last quarter with 280M in depreciation and amortization.\n\nRevenue 1.2B, cost of revenue 1.7B\n\nWhere am I supposed to be looking on this earnings report?", "score": 5, "replies": []}]}]}]}]}, {"body": "I might be a buyer at these numbers... NVDA for self-driving? Not sure what else they would use them for", "score": 2, "replies": []}, {"body": "The market for $70k+ EVs is very limited and you can see demand already dropping. But I agree it’s a great car", "score": 1, "replies": []}, {"body": "Mostly because their design is trash. Way overengineered, and 4 motors? gtfo. Honestly, them redesigning everything is great - I hope its not just basic costdowns, but design streamlining as well. \n\nAt this point, the only thing they have going for them is that it looks like a Tacoma instead of a toaster.", "score": 1, "replies": [{"body": "They have dual motors too. Design is top notch and is consistently rated as one of the best overall vehicles.", "score": 1, "replies": []}]}]}, {"body": "I like the stock", "score": 8, "replies": []}, {"body": "NVIDIA - SPLOOSH", "score": 5, "replies": []}, {"body": "Forgot to mention AI", "score": 4, "replies": []}, {"body": "Don’t they make chips for video games or something?", "score": 5, "replies": []}, {"body": "Did someone say Nvidia? 🌝", "score": 2, "replies": []}, {"body": "Bullish", "score": 2, "replies": []}, {"body": "Failing business? Slap AI on it (or in it) and you may just get a second chance!", "score": 2, "replies": []}, {"body": "Cookie clicker aaah headline", "score": 1, "replies": []}, {"body": "Puts on Tesla then?", "score": 1, "replies": []}, {"body": "Lfg", "score": 1, "replies": []}, {"body": "How long does it take to charge?", "score": 1, "replies": []}, {"body": "Title shouldn’t say redesign as it’s misleading, this is more like a refresh if anything.\n\nhttps://www.carscoops.com/2023/10/refreshed-rivian-r1-reportedly-arriving-in-2024-with-new-1000-hp-ascent-trim/", "score": 1, "replies": [{"body": "It's a refresh, but 17 to 7 modules and a complete rework of th battery is definitely a redesign.", "score": 5, "replies": []}]}, {"body": "God awful head lights", "score": -1, "replies": [{"body": "The lead engineer had been drinking Ovaltine.", "score": 2, "replies": []}, {"body": "They should stick to copying from others", "score": 1, "replies": []}]}, {"body": "Yawn", "score": -10, "replies": [{"body": "A big nothing burger with fries", "score": -2, "replies": [{"body": "That reminds me, shouldn't you be back on the fry station by now?", "score": 9, "replies": []}]}]}, {"body": "Rivian-Want to sell more vehicles? Change those stupid ass looking headlights.", "score": -2, "replies": [{"body": "Love that though", "score": 3, "replies": []}]}, {"body": "Still not saving it ![img](emote|t5_2th52|31226)", "score": -9, "replies": []}]}
