{"title": "Lucid CEO airs his latest criticism of Tesla and its EV tech", "selftext": "", "id": "1dmsxw5", "created_utc": 1719167870.0, "score": 336, "upvote_ratio": 0.9, "num_comments": 110, "comments": [{"body": "Lucid may have superior motors in terms of raw specs. However in terms of cost and manufacturability, use of rare earth metals… different story.\n\nLet’s also look at overall efficiency: https://ev-database.org/compare/efficiency-electric-vehicle-most-efficient", "score": 32, "replies": [{"body": "Shocking… Tesla with a single motor, smallest battery, and “minimalism” every part stripped out has the highest efficiency.\n\nHis statements are still very valid though, their motors and battery tech appear and benchmark better… they just don’t make a small car with a tiny ( by industry standards ) battery. ", "score": -9, "replies": [{"body": "I’ll just quote what I said again:\n\n>>> Lucid may have superior motors in terms of raw specs. However in terms of cost and manufacturability, use of rare earth metals… different story.\n\n\nBut yes let’s look at efficiency between Tesla and lucid:\n\nhttps://ev-database.org/compare/efficiency-electric-vehicle-most-efficient#sort:path~type~order=.efficiency~number~asc|make-checkbox-dropdown:pathGroup=.lucid~.tesla|rs-price:prev~next=10000~100000|rs-range:prev~next=0~1000|rs-fastcharge:prev~next=0~1500|rs-acceleration:prev~next=2~23|rs-topspeed:prev~next=110~350|rs-battery:prev~next=10~200|rs-towweight:prev~next=0~2500|rs-eff:prev~next=100~350|rs-safety:prev~next=-1~5|paging:currentPage=0|paging:number=10\n\nYes their specs are impressive. But their manufacturing numbers and cost are abysmal. You’re not really comparing apples to apples.", "score": 4, "replies": [{"body": "You’re comparing a model 3 to a lucid air…", "score": 3, "replies": [{"body": "I never said their efficiency was better for similar models. \n\nAgain let me quote what I said:\n\n>> Lucid may have superior motors in terms of raw specs. However in terms of cost and manufacturability, use of rare earth metals… different story.\n\nTesla is close yet far more manufacturable. When you look at the entire set of competition Tesla is far ahead of most. Lucid can produce better motor and efficiency, but at what cost. \n\nNobody is saying Toyota makes faster cars than Bugatti vehicles. But nobody is arguing that Bugatti is years ahead. \n\nEngineering something manufacturable is far more difficult. So when they say they are a year or two ahead in technology… I’m not sure the entire equation is taken into account. Raw specification isn’t the entire picture when it comes to large scale manufacturing.", "score": 5, "replies": [{"body": "Don’t most S and X still come with NMC chemistry batteries", "score": 5, "replies": [{"body": "Y, S and X are all due for an update similar to the model 3, to take advantage of all their advancements.\n\nFundamentally the model s we are seeing is a 2016 vehicle they made lots of minor adjustments here and there, 2021 saw some larger adjustments. If that’s the comparison I sure hope lucid is more than a few years ahead. \n\nBut you can generalize a lot from both cubertruck and the new model 3 performance , which is exceptionally reviewed by car enthusiasts.\n\nI’m guessing, personal speculation,  we will be seeing 48v, steer by wire and rear steer on S and X in 2025/2026 along with other power train updates.\n\nBut to your battery chemistry discussion, nmc is a good performer if managed correctly. Porche just switched to NMC for their latest Taycan for example. Battery chemistries all have tradeoffs in cost, complexity, density, performance, longevity and safety. Lucid uses NCA I believe which has its tradeoffs compared to nmc as well.  \n\nThere is a lot more to a battery pack than just the chemistry.", "score": 4, "replies": [{"body": "The Cybertruck is highly reviewed??? It’s on its second stop sale and total recall?", "score": 3, "replies": [{"body": "The model 3 performance is highly reviewed. Thats what I meant.\n\nThe cybertruck is well reviewed id say. However I’d say its clearly in beta testing :p foundation series = beta series 😂\n\n\nEdit: \nHagarty, Doug demuro (gave the highest Doug score at the time) MKBHD, car and driver, top gear, all gave the CT a strongly positive review.\n\nBut the new model 3 performance received excellent review, a near perfect car aside from no stalks basically.", "score": 6, "replies": [{"body": "Yup fools and money will be separated… could you imagine any other manufacturer charging for features on the vehicle that don’t even have a delivery date for?", "score": 8, "replies": [{"body": "...every automotive manufacturer... yeah. We would never... oh wait everything we said EV wise has not come true. Every single thing. Ha", "score": 4, "replies": []}, {"body": "Added an edit above:\n\nHagarty, Doug demuro (gave the highest Doug score at the time) MKBHD, car and driver, top gear, all gave the CT a strongly positive review.\n\nBut the new model 3 performance received excellent review, a near perfect car aside from no stalks basically.", "score": 1, "replies": [{"body": "After Doug’s video saying Musk is the most important person alive … I don’t think you can take him as an unbiased opinion.\n\nModel 3 has more than enough criticism that I would say it is far from a “perfect” car.", "score": 4, "replies": [{"body": "Also, I didn’t see that video where he says musk is the most important person alive. I have seen him give criticism though. \n\nDoug doesn’t strike me as a Tesla fan to be honest. He’s more of a child which though which lends it self to liking a cybertruck. From a child’s perspective, what’s not to like.", "score": 2, "replies": [{"body": "Search for the money where he talks about musks pay package a month ago.", "score": 3, "replies": [{"body": "I believe you but I can’t find it nor can I find forums talking about out it .", "score": 2, "replies": []}]}]}, {"body": "The new model 3 performance has more than enough criticism? Source?", "score": 2, "replies": [{"body": "Despite being 7? Years old the refresh barely looks different than a nearing decade old model.\n\nIsn’t rated to Tow.\n\nApps can disappear based on Musks personal opinions ( Disney )\n\nLack or stalks is way more negative than positive.\n\nLack of repairability leads to highest in class insurance rates.\n\nEverything in it other than the glorified iPad feels cheap. Even the refreshed materials feel like plastic.\n\n3rd party repairs may require recertification at or above $1k to access super charger network again, and is required for an salvage title regardless of the scope of the repair.\n\nFit and finish and initial quality are still among the industry worst. Gotta love paint miss match, panel gaps… the fact the 3 subreddit has a sticky for a multi page vehicle check to view on delivery.\n\nFSD still doesn’t live up to the promise. Loss of a uss clearly was a step back.\n\nBut if it was nearly perfect it wouldn’t be having 20-30% year over year sales reductions while other manufacturers are still growing.", "score": 4, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Anyone can make the best tech imaginable when you charge enough. It’s why NASA has panels that have insane efficiency that houses can’t match. Lucid makes great tech not many can yet afford. Anyone who thinks Tesla couldn’t do the same thing (while not expecting the same paltry sales) is delusional. Let’s see Lucid make their amazing tech scale to Tesla’s numbers, then we can talk.", "score": 29, "replies": [{"body": "Lol raise to the level of shit?", "score": 1, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Please explain. Not sure what you meant. Be VERY specific.", "score": 1, "replies": []}]}]}, {"body": "They have got very compact motors and if they are consistently hitting 5 miles per kWh that is slightly better than Tesla but can you achieve that efficiency with the affordability that Tesla does? \n\n  \nI think Tesla could produce a £130,000 super-efficient car if they wanted to but they are focused on accelerating the world's transition to sustainable transportation and making an unaffordable car doesn't achieve that.", "score": 8, "replies": [{"body": "You can get a lucid for $70k btw, and its a much nicer car", "score": 5, "replies": []}, {"body": "You forget how Tesla started? It's literally in their \"plan\". Make expensive car to raise money enough to make cheap car. You think a brand new EV startup can start pumping out $20k cars? Also, having rich people fund new research and production of new tech benefits everyone. Another also, it's sad to see people spend their money on Tesla to fund Elon's twitter obsession so he can shit post all day. Some master plan he's got", "score": 0, "replies": [{"body": "Well, I'm sorry I don't have £130,000 to spend on an efficient EV, I'll spend a fraction of that on the next best, most efficient, that's Tesla. What I am saying is it remains to be seen IF they can achieve the affordability with the same efficiency, until then Rawlinson should maybe just wind his neck in a bit.", "score": 3, "replies": []}, {"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Drama....", "score": 4, "replies": []}, {"body": "A cash burning company with lifelines from Saudi. Peter either signed his life away to Saudis or Saudis signed their life to Peter.", "score": 7, "replies": []}, {"body": "I can get 5 miles per kWh in my M3P on a good day, usually get 4, and this was the outgoing model… pretty sure RWD 3s get 5 miles per kWh all day long.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "What technology specifically? HMI / UX? I think others are a ways off here with the level of integration done at Tesla. Battery tech and charging? Lucid has some interesting things going on here.", "score": 1, "replies": []}, {"body": "The lead executive from luxury electric vehicle (EV) manufacturer Lucid Motors says that his company is “a number of years ahead” of Tesla in terms of its technology, as stated during a recent interview.\n\nLucid CEO Peter Rawlinson was interviewed in a video segment of Fox Business on Thursday, during which he said that Tesla used to be the tech leader, though Lucid had since “taken that mantle.” The feature included a test drive of the Lucid Air, along with an interview from anchor Liz Claman.\n\nThe conversation touched on Lucid’s upcoming Gravity SUV, the company’s struggles in the stock market, and its factories in Saudi Arabia and the U.S., among other topics, still. Near the end of the roughly seven-and-a-half-minute video, Claman asks Rawlinson where he thought Lucid ranked compared to EV leaders Tesla and BYD, to which the CEO responded by touting his company’s technology.", "score": 0, "replies": [{"body": "Haha. Ok.", "score": 6, "replies": []}, {"body": "Yeah the executive should continue to invest in Luvid", "score": 5, "replies": []}, {"body": "This asshole is so full of shit it’s coming out of his mouth.", "score": 3, "replies": [{"body": "\"One million FSD robot taxis by 2020\"\n\nLol which shit-filled asshole?  EV tech riddled with those vermin", "score": 0, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": -1, "replies": []}]}]}, {"body": "Lucid loses between $100k-200k, depending on what you read, for every car they sell. They may have excellent engineering but their business skills are lacking. Lucid’s engineering doesn’t matter if they can’t stay in business.", "score": 0, "replies": []}]}
