{"title": "Bond Autists: What are the factors that lead people to bid for bonds and lower the yield?", "selftext": "I get what causes this pre-recession yield curve inversion, but I am more interested in why that is such a strong signal? What is the behaviour or the mentality behind going into short term bonds to the level that it causes the inversion? I thought that this was the side that the Fed controlled, so what has gone wrong, or what has gone right? Who can help a bond newb get more autistic about bonds? ", "id": "b63bnb", "created_utc": 1553686183.0, "score": 15, "upvote_ratio": 1.0, "num_comments": 24, "comments": [{"body": "People look to bonds as a safety net when things are volatile. Contrary to what is /wsb mantra a lot of people want to conserve their money. \n\n-\nAlso here retard:\nhttps://investor.vanguard.com/investing/online-trading/bond-strategies", "score": 17, "replies": [{"body": "I can see that. I think if I am going to dig deeper, I'd like to know who and why do people think risk is increasing and therefore want to save money. ", "score": 6, "replies": [{"body": "Political instability (Brexit being just one instance), slowing economic data (home starts, consumer spending, car sales), stock market volatility itself (yes it’s also impacted by the other things), are just part of what’s going on.  It’s not just 1 thing making people move their money.", "score": 12, "replies": [{"body": "This", "score": 2, "replies": []}]}, {"body": "Risk is not necessarily increasing, for now.. Opportunity is just decreasing. In this 10 year old bull market, the last five years especially, companies have been pouring money into PP&E and R&D. Cash has been coming in hand over fist. People are more content than ever with their current levels of ownership, and because of this the strength in expenditures is foreseeably fading.  \nIf you're sitting on more cash than you can efficiently spend/invest, you can: (a) up the dividends (b) buy back your own stock (c) buy liquidity for future opportunities. We're running out of places for money to go, so liquidity it is by way of bonds.  \n  \nThe yield is going to invert until it reaches a peak. At peak inversion long term liquidity looks so expensive that you might as well have short term bonds. Now the short term bonds start catching bids. This normalizes the yield curve and ends the inversion.\n  \nInterest rate policy = low rates in the foreseeable future. So  now long term bonds are looking relatively more attractive and are catching bids. This decreases their yields and it causes or accelerates the inversion until peak inversion is reached, whenever that may be", "score": 5, "replies": [{"body": "I notice that I don’t see recession in your thoughts. Is the inversion a symptom of actual proof of a coming recession or does news related communications like headlines create recession fears that also trigger uncertainty and therefore create an inversion? ", "score": 1, "replies": [{"body": "Yield inversion has been a reliable indicator that opportunity is fading. Money is pouring into long term bonds. If I were to offer you a deal: more than a decade of tremendous growth in exchange for two or three years of recession. Would you take it?\n\nOf course you would. Everybody would. It's part of the natural process of economic expansion driven by societal and technological advances. So no. I'm not scared of a recession. In fact I think it's a great filter for companies that maybe need to close their doors anyway. How many companies have sky high valuations right now while being barely profitable? It's incredible. Recessions are short moments of intense opportunity in which fortunes are made or lost. I welcome that opportunity. Forget headlines. They appear after the underlying event anyway. Yield inversion started two weeks ago. Think for yourself", "score": 6, "replies": [{"body": "> How many companies have sky high valuations right now while being barely profitable?\n\nlike, literally every tech company lol", "score": 1, "replies": []}]}]}]}, {"body": "It’s just that some people can’t afford to lose money. Savings accounts often don’t keep up with inflation. By investing in very low risk they are able to keep up with inflation.", "score": 2, "replies": []}]}, {"body": "> Contrary to what is /wsb mantra a lot of people want to conserve their money. \n\nlol", "score": 1, "replies": []}]}, {"body": "Bond price is dictated by two factors, over night interbank lending rates and inflation, both of which the fed seeks to influence. Usually people are more wrong about inflation than the over night rate, so the long dated bonds demand a higher risk premium. However, if you expect to have a 3 year long recession then sitting on a 10 year bond with meager returns beats your expectations of the bond market 2 years from now when the bond pays back its face value and you have to stick the new money somewhere. \n\nAlso, fed directly controls jack shit. They set over night paper rates hoping to influence short term bond rates.", "score": 5, "replies": [{"body": "So that’s a great answer. Who is usually buying these bonds? Does anyone track that? Sovereigns? Corporates? What info do they see that makes them buy? I’m sure a buyer at a sovereign fund doesn’t buy as soon as he sees a CNBC story. ", "score": 1, "replies": [{"body": "The problem is that the answer is \"everyone.\" When you talk big boy sums of money treasuries are basically as good as cash. They're just a great deal more durable because the treasury also tracks who they are supposed to pay out to and a lot esoser to move than sacks of cash. Problem there is that who owes what to who is a deep and convoluted web of contracts and untangling them is an intractable problem. ", "score": 3, "replies": [{"body": "Yeah. I guess it must be someone’s job to figure out a slice of it. Because even knowing just that is a lucrative bit of info. That’s the info I want to know too. Where do you find it? BNY Mellon? Citi? Gs? ", "score": 2, "replies": []}]}, {"body": "Generally a mixture of sovereigns (investment funds), hedge funds, family offices, down to individual investors who own ETFs.\n\nThey buy based on their own economic research and modelling. You'd be surprised though, some sovereign funds are basically run by one person (with teams of researchers, but that one person makes the final call).", "score": 1, "replies": []}]}]}, {"body": "My question is why does the inversion always bring out charlatans who pretend they are experts because they’ve read a MarketWatch shit post.\n\nI remember the same thing happened when Brexit first passed a few years ago. People I know in real life who can’t hold down a job were making bold statements on Facebook about what it meant for the world economy and how we were all fucked.\n\nIt’s OKAY to say “I don’t have a fucking clue.” Even people with multiple economic degrees in this shit can’t agree on the why and what’s next.\n\nI think it’s probably a buying opportunity because at the end of the day most of us are pretty stupid.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "expect some hardcore winning :D", "score": 1, "replies": []}]}]}, {"body": "If the expectation is a weakening economy, and if the Fed does its job and cuts rates to counteract the weakness, then long-term bonds will produce the best price return. The curve starts to flatten and/or invert when investors sell short term bonds (pushes prices down and yields up) and buy long term bonds (pushes prices up and yields down)", "score": 2, "replies": []}, {"body": "~~Bonds = safety for people who have actual money. If people with actual money are more willing to buy bonds that expire sooner rather than later, it’s probably a sign that ‘later’ isn’t going to be a good time, because they don’t want to tie their money up there.~~ Stop listening to me before like 11AM. ", "score": 4, "replies": [{"body": "I thought the inversion was usually from people selling, not buying, short term bonds. Hence why the short term yields spike. This one is unusual because short term is pretty flat while long term yield is falling.", "score": 4, "replies": [{"body": "You're right, it's too early for me to be typing this shit. I had to re-read my own comment 4 times because I read yours and was like \"Yeah, that's what I said?\" ffs", "score": 3, "replies": []}]}]}, {"body": "Think about what the basic facts of a yield inversion mean. People are locking up their money for longer periods, *without* being paid a higher premium for it. \n\nYou can make a (reversed) analogy to mortgages. Why would you choose a higher long-term fixed interest rate (aka less money in your pocket, like a lower yield bond), compared to a lower variable rate/a lower shorter-term lock-in? Because you expect the interest rate on mortgages to go up (and cost you more money in the future than you would save right now). \n\nBy analogy, you lock your money into longer term bonds when you expect the bonds rates to drop even further in the future, more than enough to offset the currently higher rates.", "score": 1, "replies": []}, {"body": "Behaviour? You aren’t talking about US t bonds with that grammar", "score": 0, "replies": [{"body": "You’re right because when you learn grammar you only stay in the country you learned it in. ", "score": 1, "replies": []}]}]}
{"title": "How to \"day trade\" with less than 25k with TQQQ and SQQQ", "selftext": "**edit:** after further research you may not want to do this with with leveraged ETF's like TQQQ and SQQQ, since they [have a tendency to want to decay back down to zero over time](https://www.reddit.com/r/wallstreetbets/comments/b6afck/how_to_day_trade_with_less_than_25k_with_tqqq_and/ejj8orn/) due to how their math works out.  It depends whether the 3x gains would outweigh the volatility decay you'd incur holding them, which may be the case but I haven't done the math yet.  Until then I have switched to **QQQ** and **PSQ** (they are priced differently, but luckily 6 shares of PSQ is practically equal to 1 share of QQQ).     \n.     \n\nalright, so back in 2001 after everyone got reamed in the dotcom crash some dipshits thought that forcing people to hold on to a stock when it starts plummetting would prevent people from losing all their money.  I don't follow their logic, and my personal experience over the past few days has been the complete opposite, but here we are, fuck us.\n\nso we have **TQQQ** and **SQQQ**, they are exact mirror opposites of each other.  when one goes up 1% the other drops 1%, etc\n\nsplit your money into 4-5 equal parts (or however many market \"direction-changes\" you anticipate in a single day).  invest the first of the parts in whichever version seems to be going up in the morning.  for the sake of this example we'll say that you think TQQQ is on the way up, so you spend your first \"part\" on that.\n\nbut say you were wrong, and TQQQ changes direction and starts dropping.  so now use one of your parts and buy SQQQ with it.\n\nwhenever the market changes direction, spend one of your \"parts\" of your money on whatever -QQQ is about to go up.\n\n**edit:** actually if you want to be shrewd, split your money up into an even number of parts.  that way when the market closes (or whenever you want to be done for the day), you can balance everything out, and any after-hours movements won't effect you.\n\nthen the next morning you sell all your shit pre-market and start over fresh.\n\nobviously since you are splitting your money up, it won't be possible to make (or lose) as much in a day as if you were dumping all your money into something at once.  for example, the most you can make this way is in two parts, in one \"day trade\", and your returns will be cut in half compared to if you actually did a real day trade, but I'd rather take lower but steadier gains then randomly losing 8% when Tim Apple sharts his khakis on stage and crashes the entire market about once a month.", "id": "b6afck", "created_utc": 1553723899.0, "score": 7, "upvote_ratio": 0.63, "num_comments": 21, "comments": [{"body": "literally cannot go tits up", "score": 34, "replies": [{"body": "Welp sqqq did", "score": 1, "replies": []}]}, {"body": "Long UVXY instead, easy money.", "score": 10, "replies": [{"body": "Yeah. Just got my tax documents for this. No thanks. ", "score": 11, "replies": [{"body": "What happens if you don’t enter those k1 forms?", "score": 1, "replies": [{"body": "I didn’t even know. The form shows zero return. Debating whether update my taxes to show zero income is worth the effort. ", "score": 5, "replies": [{"body": "I got my UVXY K-1 in the mail three days ago and I already filed. I am due an additional $6.... considering saying fuck it.", "score": 3, "replies": [{"body": "Uncle Sam “Nah, keep those $6 I don’t need it”", "score": 3, "replies": []}]}, {"body": "Yup, fuck proshares. Never touching their stocks again", "score": 3, "replies": []}]}]}]}]}, {"body": "You belong here ", "score": 9, "replies": []}, {"body": "Nobody tell him.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 17, "replies": []}, {"body": "Even better tip OP: Sell the calls and then buy the same calls...", "score": 8, "replies": []}, {"body": "If it was this easy you think we'd all be here?", "score": 4, "replies": []}, {"body": "Sounds like you discovered something no gambler has ever had... a SYSTEM!\n\nI’m not going to tell you what’s wrong with your plan, it should be obvious.  I’ll tell you what tho, you’re right about one thing, it’s not risky, it’s guaranteed.  Guaranteed to lose you money.  Why don’t you leverage up and run your plan and see if you can figure out what’s causing the losses.  It’s obvious that planning isn’t your forte, so why don’t you just run it through and watch where the money goes.  [Fuck it, let’s do it live](https://youtu.be/vu2NK5REvWM?t=12s)", "score": 8, "replies": [{"body": "okay", "score": -7, "replies": []}]}, {"body": "What the mirror image of an individual equity.. \n\nI think that’s what most ppl want to daytrade", "score": 1, "replies": []}, {"body": "THETA", "score": 1, "replies": []}, {"body": "They are not exact mirror opposites? \n\nNice shitpost", "score": 1, "replies": []}]}
