{"title": "Alibaba vs Amazon", "selftext": "# Could alibaba become second Amazon?", "id": "98p6tq", "created_utc": 1534726267.0, "score": 16, "upvote_ratio": 0.69, "num_comments": 35, "comments": [{"body": "I am long on BABA. Their leadership is just too strong to not succeed. Get in while you can at this great price. ", "score": 22, "replies": []}, {"body": "Alibaba sells a lot more knock-off products than Amazon", "score": 14, "replies": [{"body": "How many people buy those knock-offs from BABA and resell on AMZN?", "score": 5, "replies": [{"body": "probably 99% of the dropshipping market", "score": 1, "replies": []}]}, {"body": "yes, but BABA is fighting the piracy and they have a lot of people employed to find the counterfeit products and to try to take them down", "score": 1, "replies": []}]}, {"body": "**probably not**", "score": 4, "replies": []}, {"body": "Lots of short interest in BABA, which is often a red flag. They do seem to be growing fast, but it’s very exposed to the Chinese economy in general, which is risky.", "score": 4, "replies": []}, {"body": "No, actually JD is the second Amazon. They even have their own private logistics branch unlike Amazon. (Amazon uses FedEx, UPS, and USPS). JD is really undervalued right now at a market cap of 45 billion where Alibaba is at 450 billion. ", "score": 10, "replies": [{"body": "> market\n\nIts PE is >250 and an EPS of .12.... Seems overvalued by a lot. ", "score": 12, "replies": [{"body": "It does seem like they are overvalued based on that metric alone, however the earnings per share right now is heavily affected because they are reinvesting into themselves to compete and grow. I really don't know what's so hard to understand about that.  People think they aren't making any money which isn't the case. Go look at their financial report. If you look at their cash to debt on their balance sheet it is extremely healthy and they have about twice as much cash as they do debt. You will also notice a significant amount of their profits go into investments and the logistics of the company. Obviously they're planning for the future and that is a good thing. Short-term eps is somewhat insignificant right now. ", "score": 4, "replies": [{"body": "Forgive my newness. What metrics tell you that they are reinvesting into themselves and don't just have bad margins? I here the same said for Amazon, and as I'm new at reading ERs these things go over my head.", "score": 1, "replies": []}]}]}, {"body": "Amazon has their own private logistics branch and 3pl. It opened under \"Amazon Logistics\" ", "score": 3, "replies": []}]}, {"body": "Can’t get into China after watching the China hustle scared straight and also IQ burned me pretty bad ", "score": 3, "replies": [{"body": "> scared straight\n\nThis is a guess on your part. You could be scared away from a properly run company. ", "score": 6, "replies": [{"body": "What's that Buffett quote? Something out buying when others are afraid? ", "score": 1, "replies": [{"body": "“Be fearful when others are greedy and greedy when others are fearful.”", "score": 4, "replies": []}, {"body": "Buy when there's blood in the streets.  \n  \nEDIT: not sure if this is actually Buffett lol", "score": 1, "replies": []}]}, {"body": "did you see the film? Am not saying all Chinese stocks are fake and have cooked books but if you are investing in companies like that you should do deep DD on them. By that am not saying watch the movie and that’s all the DD you need, but actually see what’s going on in the company beside what you see on the earnings report. ", "score": -5, "replies": []}]}]}, {"body": "You can't go wrong with either company in the short term. Amazon terrifies me in the long term because of the company's immense P/E ratio and large reliance on AWS. A decentralized network can completely eliminate this business, destroying Amazon's net profit.", "score": 2, "replies": [{"body": ">A decentralized network can completely eliminate this business, destroying Amazon's net profit. \n \nIf there was one even close to endangering them, you'd have years in advance to sell your stocks.", "score": 1, "replies": [{"body": "Technology improves exponentially and no one can predict when a business function will become extinct. It’ll be difficult to know when Amazon’s stock hits its peak. ", "score": 1, "replies": [{"body": "I'm not talking about Amazon though, I'm talking about a theoretical competitor. Someone creating a decrentralized web hosting service would not be easy, and it would need to have massive market share before it could even begin to threaten Amazon.\n  \nA decentralized net like you're describing would require such a massive change in technology, and that just doesn't happen overnight. You'd see the writing on the bathroom wall.", "score": 2, "replies": [{"body": "Yeah, I understand what you are saying and you are making a good point. \n\nThere are projects that are currently being developed now that may affect Amazon’s market share that run on Ethereum or Neo. That’s why I’m worried about AWS’s future. ", "score": 1, "replies": [{"body": "Yeah, and I can tell you from personal experience, they have grim outlooks. \n \nGetting large companies to switch over requires low-risk. Low-risk requires high adoption. High adoption requires having the trust of large companies... See the problem?", "score": 1, "replies": [{"body": "I don’t know...these projects are incredible. I mean it would obviously take time. We’ll just have to see what the future holds. Amazon is a great investment now though, no doubt. ", "score": 1, "replies": [{"body": "They're *technically* incredible. But they aren't really tech products yet, they're social products. You need to convince PEOPLE to help you, out of the kindness of their heart. I can tell you, that isn't easy. If you're a private company trying to pay to give yourself a runway to take off, that can get expensive really quickly. It's like trying to come up with your flight-plan in the aircraft, and you need to be done before you reach the end of the runway or you crash. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "no", "score": 1, "replies": []}, {"body": "Allways Amazon.\nAmazon is a huge and very powerfull western company in the US. Alibaba might be the same but in China. If there is some political issue (and jack ma is not a quiet guy), BABA will suffer big time in china as they could think they also have JD (and the other way around).\nWouldnt invest in china", "score": 1, "replies": []}, {"body": "Alibaba is a market more for wholesales for actual businesses. Amazon is a consumer market. They're different", "score": 1, "replies": [{"body": "Way to ignore 80% of what these companies *actually* do.\n\nAmazon.com, AWS, Audible, Twitch, Prime Video / Music, Whole Foods, etc.\n\nAlibaba.com (B2B), AliExpress (B2C), Taobao (C2C, like eBay I guess?), Alibaba Cloud, AliPay, etc.\n\nThey're not that different.", "score": 4, "replies": [{"body": "Not much of what you listed correlates with each other at all. \n\nRegardless, I was talking purely about the websites, which is their foundation. Their foundations are much different. I wouldn't compare them too much. ", "score": 1, "replies": []}]}]}, {"body": "This was taken from an article on the net.\n\n \"JD.com owns an integrated B2C (business-to-consumer) platform. This means that JD sells its goods directly to consumers. Its products are split between two categories -- products which it buys and resells to consumers, and products it lets businesses directly sell to consumers.\n\nEither way, JD takes possession of the inventories and fulfills the orders with its own first-party logistics network. This business model is similar to Amazon's (NASDAQ: AMZN) -- it racks up high expenses, but it filters out questionable merchants and products while ensuring that orders are quickly fulfilled.\n\nAlibaba owns two platforms -- its C2C (consumer-to-consumer) marketplace Taobao, and its B2C marketplace, Tmall. Taobao runs a business model similar to that of eBay (NASDAQ: EBAY), wherein consumers sell products to each other and are responsible for fulfilling orders. This business model has lower overhead costs, but it's harder to oversee the quality of the vendors and goods.\"\n\n", "score": 1, "replies": []}, {"body": "Buy Pepsi", "score": -2, "replies": []}, {"body": "Only if Wall Street allows. Currently Amazon is a safe space for big money.. Wall Street will keep it that way as long as they can. ", "score": -7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The narrative.. yes", "score": 2, "replies": []}]}]}]}
{"title": "Why Microsoft, just why.", "selftext": "[deleted]", "id": "98ts6x", "created_utc": 1534773428.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 23, "comments": [{"body": "Because I bought calls", "score": 30, "replies": [{"body": "What compelled you to do such a thing??", "score": 7, "replies": []}, {"body": "Same. 7 of them... $110 9/7 lets gooooooooo", "score": 1, "replies": []}]}, {"body": "Dude all tech is red", "score": 16, "replies": [{"body": "Yeah, tech got rekt this morning. Wait till 0930. If by 1000 we don't have some sort of meaningful come back, I'm selling my amzn calls. ", "score": 11, "replies": [{"body": "Rip", "score": 2, "replies": [{"body": "Patience grasshopper. I bought some more, lol. ", "score": 8, "replies": [{"body": "Way to stick to your plan.", "score": 6, "replies": [{"body": "I'll still sell if we don't pull up. The plan has not been thrown to the wind. bought at the second bottom of the W. We're trending up, I'm not worried. ", "score": 2, "replies": []}]}]}]}]}, {"body": "NOT MU THIS IS GOOD FOR MU", "score": 1, "replies": []}, {"body": "You think they have more than one stock on watchlist?", "score": 1, "replies": [{"body": "Chinese tech is green 🤪", "score": 1, "replies": []}]}]}, {"body": "i guess if it drops below 105 i'll cry a bit and then double down on my january 110's. why lose $1,000 when you can put $2,000 on the line?", "score": 14, "replies": []}, {"body": "Maybe have a holding period longer than a day? ", "score": 8, "replies": []}, {"body": "yeah i don't know wtf is going on either, who is doing all this selling!??!?", "score": 8, "replies": [{"body": "Nutella", "score": 13, "replies": [{"body": "someone needs to slap his gandhi looking ass", "score": 10, "replies": []}]}]}, {"body": "Complaining is a good way to make it go up man! You should set up a booth outside of a rite-aid and keep whining, at least there nobody would be around to hear you bitch. ", "score": 9, "replies": []}, {"body": "It went straight up from $96 to $110...with barely any pullback\n\nThe fuck you expect? It's an 850B+ market cap blue Chip company...", "score": 6, "replies": [{"body": "> The fuck you expect? \n\nA straight line to $2T market cap with no red days. I'll still find a way to lose money on it, but a boy can dream. ", "score": 14, "replies": []}]}, {"body": "I've been pretty good at losing money recently!", "score": 3, "replies": []}, {"body": "> then shit the bed.\n\nDown 0.5%. Wow", "score": 3, "replies": []}, {"body": "lol, down .6% is shit the bed?", "score": 2, "replies": []}]}
{"title": "TSLA does not care about your premarket dump or a stock downgrade", "selftext": "", "id": "98u3c1", "created_utc": 1534775671.0, "score": 10, "upvote_ratio": 0.86, "num_comments": 21, "comments": [{"body": "then buy calls pussy", "score": 15, "replies": [{"body": "you can trade the shares with none of the risk and still make bank as long as you aren't poor. Wait for FUD articles to come out -> TSLA drops $20 -> Buy shares -> TSLA rallies $30 -> Profit", "score": 5, "replies": [{"body": "Because holding TSLA stock and getting screwed by wash sales are fun activities for my blood pressure", "score": 3, "replies": [{"body": "holding TSLA stock is a privilege that we are all thankful for. Every morning I look at my losses and think about the sacrifices I've made to save the world and what a great person I am because I hold TSLA shares. I don't even care if I make any money, it's fun either way.", "score": 9, "replies": [{"body": "*autistic screeching*", "score": 6, "replies": []}, {"body": "You should buy more... for humanity.", "score": 1, "replies": []}]}]}, {"body": "the amount of capital needed just to make 10 dollars per share...u can literally make the same strategy with any stock that has high volume", "score": 1, "replies": []}, {"body": "If we start that cycle from last week:\n\nFUD articles questioning funding come out, stock drops $20 back to $360 -> Buy shares -> more FUD -> margin call\n", "score": 1, "replies": [{"body": "you have to wait for peak FUD. The peak is always when TSLA is around 280\n", "score": 1, "replies": []}]}]}]}, {"body": "Soo tempted to buy 290 calls but then i remembered this is the stock that makes no sense.", "score": 3, "replies": []}, {"body": "dead cat bounce baby, probably short-term traders covering from the drop from 380\n\nwatch it retrace below 300 by day end\n\nedit: yeah this retrace was too obvious. shoulda made a play on it rip ", "score": 5, "replies": [{"body": "Stock is 305.5 with 13 minutes till close guess your retrace wasn’t that obvious ? stoooopid", "score": 1, "replies": []}]}, {"body": "It actually just rose three dollars since this post dam", "score": 2, "replies": []}, {"body": "We should really thank these FUDster analysts for all the call opportunities they give us.", "score": 2, "replies": []}, {"body": "Tesla is just rich man's version of AMD. You buy call under $300 and Buy put when it is $350 or higher.", "score": 1, "replies": []}, {"body": "What is dead cat?", "score": 1, "replies": [{"body": "One possible state of  **Schrödinger's cat.**", "score": 2, "replies": []}]}, {"body": "I’m pretty pissed. I have a GTC cover buy order at $287.5. The stupid order doesn’t executed premarket and the stock opened right above that price. Now I saw $7000 disappear in a blink of an eye. ", "score": 1, "replies": [{"body": "Lol", "score": 1, "replies": []}, {"body": "It didn't disappear you just didn't make money ", "score": 1, "replies": []}]}]}
{"title": "The support at 300 for TSLA is insane", "selftext": "Goldman sachs downgrade\nfraud via twitter\n\nStill refuses to stay comfortably Below 300 lmao fuck me", "id": "98vdyl", "created_utc": 1534784690.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 26, "comments": [{"body": "Nobody tell him ", "score": 20, "replies": [{"body": "Someone tell me.", "score": 8, "replies": []}]}, {"body": "Whatever you think about Musk's legal problems, they are rolling out more cars than ever (see Bloomberg Tesla Tracker). That's going to put a floor under the stock. ", "score": 13, "replies": [{"body": "We started hauling trainloads of them to Baltimore to go overseas. Drove the first one the other day. I figure we had around 60-70million dollars worth on our train", "score": 14, "replies": [{"body": "Real DD right there", "score": 7, "replies": [{"body": "DD straight from the B&O RR", "score": 5, "replies": []}, {"body": "I'm keeping an eye on how many trains they're scheduling, but even 1 a week is 52000+ annual exports which is huge compared to last quarters numbers", "score": 3, "replies": []}]}]}, {"body": "This just in: Everyone still wants a Tesla and willing to wait until their children are dead of old age to get one!", "score": 2, "replies": []}, {"body": "They are building them to CATCH UP with demand too, not in anticipation of it. Very unusual and beneficial for a car company", "score": 1, "replies": []}]}, {"body": "Can’t believe it was at what 284 premarket and peaked at 307 afterwards the downgrade from J.P. Morgan feels like it helped the stock so far ", "score": 6, "replies": []}, {"body": "Give it time. Musk is insane and will do some dumb shit before end of week. ", "score": 7, "replies": []}, {"body": "arabs buying below 300", "score": 1, "replies": []}, {"body": "it's a guaranteed 40% return have u learned nothing in the past 2 weeks? people were leveraging themselves up to their wives tits just for the 10% returns", "score": 1, "replies": []}, {"body": "The week has just begun. 300 will break", "score": 1, "replies": [{"body": "If you don’t buy tesla when it’s below 300, you will regret it.", "score": 9, "replies": []}, {"body": "You have no idea how many rich fags are  behind this.  They are not in it for the profit, they want to change the world.\n\nDont fuck with cult stocks, expensive lesson I learned from APPL.", "score": 3, "replies": [{"body": "the fck, aapl actually isn't burning hundreds of million per quarter and has a CEO who acts professionally.  don't bring tsla to the same level", "score": 12, "replies": [{"body": "Fortunately the opinion of poor wsb posters doesn’t effect the stock", "score": 3, "replies": []}, {"body": "Not APPL today, before iPods.  iMac era.", "score": 3, "replies": [{"body": "can u stop saying appl, it's making me feel offended on a personal level", "score": 11, "replies": [{"body": "AAPL!", "score": 6, "replies": []}]}]}, {"body": "and a low pe ratio", "score": 1, "replies": []}]}, {"body": "How exactly is Apple a cult stock? Sure you have Apple fanboys, but every company has those. At least Apple actually makes money.", "score": -3, "replies": []}, {"body": "Exactly. Elon is the darling child of silicon valley. They won't let one of them fail, especially considering the failure would be very public.", "score": -1, "replies": [{"body": "Occasionally they have to make examples out of people who  deviate to keep others in check. That's how the system works bro.", "score": 2, "replies": [{"body": "You might be right. Is Elon full of shit? Fuck yes. Is TSLA ever going to be profitable? Probably not. That said, I don't want to play when the big boys have so much money riding on him.", "score": 0, "replies": []}]}]}]}]}]}
{"title": "Buying Tesla long dated calls here when it’s under 300 has made me money every time", "selftext": "But is this time different? Happens time and time again, Elon releases some news and it pops right back to 350+. I’m guessing the next pop will be on m3 numbers increasing as people seem to have forgotten that during all this drama.", "id": "98vs0h", "created_utc": 1534787332.0, "score": 24, "upvote_ratio": 0.88, "num_comments": 23, "comments": [{"body": "Hey keep doing it. I mean past performance guarantees it amirite?", "score": 26, "replies": [{"body": "Yeah nothing happened recently which was completely abnormal or anything ", "score": 12, "replies": []}]}, {"body": "IV on Tesla is retarded high right now. Just sell a put spread for easy premium. ", "score": 12, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "This is the same question as what OP is posing. A spread is just a way to hedge i.e. a more responsible play but fundamentally the same unanswered question.\n\nIf he hires a COO or moves some responsibility to a hire, I guarantee that it goes up. Whether or not we get that is again the same question.", "score": 1, "replies": []}, {"body": "If I'm selling a put spread for premium I'm going to always have positive delta so it's a bull spread ", "score": 1, "replies": []}]}]}, {"body": "The $300 wall just so hard. Can buy some few OTM call to swing trade Elon.", "score": 9, "replies": []}, {"body": "Sure bud", "score": 7, "replies": [{"body": "what makes this post so hard to believe lol", "score": 7, "replies": [{"body": "Because it goes against his position lol", "score": 7, "replies": []}]}]}, {"body": "what strike/expiration?", "score": 3, "replies": []}, {"body": "IV all time high", "score": 2, "replies": []}, {"body": "I bought a 1/18 320 C this morning", "score": 1, "replies": [{"body": "What was the premium?", "score": 1, "replies": [{"body": "$33.316 is my cost basis, contract is up 8% right now", "score": 2, "replies": [{"body": "Correct me if I'm wrong (still new to Options trading), but is that per contract? So if TSLA trades at 300, it would have to be above 333.316 for you to break even?", "score": 1, "replies": [{"body": "I purchased one contract for $3,331.60 because it's 100 shares. TSLA share price was like 290 or something when I bought it so I'm already making money on the contract with TSLA share price around 303 right now even though the option is OTM (out the money). Break-even on expiration will be above $320 but I plan to sell way before January 1st. This video might help you understand better:\n\n[https://www.youtube.com/watch?v=kCJcEOYuuII](https://www.youtube.com/watch?v=kCJcEOYuuII)", "score": 5, "replies": []}, {"body": "Break even is the strike plus premium at expiration, so in this case 353 would be BE on 1/18.", "score": 2, "replies": [{"body": "Thanks, isn’t that a huge premium? ", "score": 2, "replies": [{"body": "Given how much TSLA moves around, it seems reasonable. Loosely, the market's saying there's a decent chance it'll swing that far.", "score": 1, "replies": []}, {"body": "Yes and no.  What do you value the stock at? Yes, the stock could stay at/below 350 until 1/18 and you lose.  However, it may hit 350 in a week (already hit 320+today), so the stock will likely keep a lot of that \"high\" premium, so you are going to make money off the big swings, but don't have to time it as well having a far out option.  I believe the option is up about 20% already (today) plus whatever from yesterday.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I called long on earnings, I called short on the “funding secured”, and I think you’re probably right for another swing.\n\n(To be clear I’m too much of a pussy to make any of these plays on TSLA. But I did [call it](https://www.reddit.com/r/wallstreetbets/comments/95dg60/my_tsla_shorts_this_afternoon/e3rxlg3/?context=0).)", "score": 1, "replies": []}, {"body": "If you have enough to buy 100 shares, write covered calls. ", "score": 1, "replies": []}, {"body": "I’ll take post SEC investigation IV crush for 2000, Alex.", "score": 1, "replies": []}]}
{"title": "NVIDIA", "selftext": "Got an 8/24 252.5 call. New to options. Should I sell at a high point today or will this uptick continue through the week ?", "id": "98w8vd", "created_utc": 1534790534.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 30, "comments": [{"body": "Should have sold at peak today. There's gonna be small pullback from today's hype but it's likely that your best chance at the most profit was at peak, since they're 8/24 calls. Take profit when you can. ", "score": 5, "replies": [{"body": "that and depending how nasdaq/s&p does in the next day it could still drag NVDA down or shoot it out of orbit", "score": 1, "replies": [{"body": "He's gonna need to be lucky for tomorrow. Squeezed hard ", "score": 1, "replies": [{"body": "> back\n\nSqueezed hard in what way? Are the shorts on the run, or are they probably counting on being in the money?", "score": 1, "replies": []}]}]}]}, {"body": "So here’s my take. I’d say hold on to it bc they’re probably gonna do the Tesla strat of “we already have x amount of $ in preorders, go us” \nIf they do that then the stock goes up again and then u pull out. Just wait till Thursday ", "score": 5, "replies": [{"body": "So its up to everyone on WSB to preorder a  2080ti!", "score": 3, "replies": [{"body": "Not even, 2070 is by far the best value from a card offered in the past 7+ years. A safe options call is in March, or late January/ end of Q4 time bc those puppies will fly off the shelves due to recent wage increases in America and possibly the trade war with China ending in November. (Wall Street journal has an article about that.) I hope everyone makes it out clean and joins team green.", "score": 1, "replies": []}]}, {"body": "Up almost 3% so far. Looks like I was right even though it was for the wrong reason", "score": 1, "replies": []}]}, {"body": "Wondering the same for my 250 10/19.... any advice?", "score": 2, "replies": [{"body": "hold", "score": 7, "replies": []}]}, {"body": "Sell", "score": 2, "replies": []}, {"body": "8/24 sell our roll that date out", "score": 2, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "http://optionsprofitcalculator.com", "score": 1, "replies": []}, {"body": "Sell before you get cucked by theta", "score": 1, "replies": [{"body": "Theta\\*", "score": 1, "replies": []}]}, {"body": "Can someone explain what calls are please I'm very new", "score": -6, "replies": [{"body": "Usually happens when someone wants to buy a stock they \"call\" the company for the paper stock to be faxed to them. When someone sells their \"calls\" they sell the right to call the company for the fax at that given time and associated price.", "score": 17, "replies": [{"body": "Everyone knows faxing paper stock is illegal.  Good way to get the SEC at your door.    The \"calling\" it in part is legit.  ", "score": 6, "replies": []}, {"body": "I feel like this is bs ", "score": -7, "replies": [{"body": "Googled helped me more thx assholes ", "score": -2, "replies": [{"body": "It’s almost like you shouldn’t depend on random redditors to spoon feed you information....", "score": 5, "replies": [{"body": "Almost ", "score": 1, "replies": []}]}, {"body": "Nice now you just need to be old enough to trade", "score": 3, "replies": []}]}]}]}, {"body": "nobody tell him", "score": 3, "replies": [{"body": "Really...", "score": -8, "replies": [{"body": "Lol it's been 3 days since you asked this question and you haven't bothered to Google it? ", "score": 2, "replies": [{"body": "I asked this question 11 minutes ago ", "score": 1, "replies": [{"body": "Post history exists btw. either way do your own research it literally takes 5 min and whatever u find will explain it better than any autist here", "score": 3, "replies": []}]}]}]}]}, {"body": "It's what I do to your mom when I want a rimjob.", "score": 1, "replies": []}]}]}
