{"title": "Elon’s bubble is a real thing. What do y’all think", "selftext": "", "id": "z4ns7r", "created_utc": 1669409338.0, "score": 8, "upvote_ratio": 0.52, "num_comments": 78, "comments": [{"body": "I’ve seen this guy say “$1000 is only 10 doubles away from a million” and then fuck up the math on TV and now he’s saying Cathie is short tesla.. hmm\n\nAlthough I do think tiktok is fucked but I don’t think Instagram will disappear", "score": 33, "replies": [{"body": "It is 10 doubles away though\n\n1) 2000\n2) 4000\n3) 8000\n4) 16000\n5) 32000\n6) 64000\n7) 128000\n8) 256000\n9) 512000\n10) 1024000\n\nOr do you just mean he said it but couldn't do the math?", "score": 2, "replies": [{"body": "Yea he skipped 32000 I think and only held up 9 fingers at the end lmao", "score": 2, "replies": []}]}, {"body": "Twitter really sucks right now. Prior to Musk's takeover I'd check in to see what journalists, academics and the such had to say. I tried to get a good mix of opinions and the such. It was a good town square.\n\nSince the Musk takeover I've gotten a steady stream of obnoxious right-wing assholes with their non-thought provoking dribble. I don't follow them but for some reason they show up in my feed because people who I follow also follow them. My use has gone down.\n\nTwitter should have a Wikipedia business model. I don't know how feasible that is, but I think it can be done.", "score": 6, "replies": [{"body": "These tools are really powerful for curating information. But like ALL information. Think of it like just being able to publish an article in however long it takes you to write it, on a database that keeps everything and is searchable to the public. Now imagine people use that as a diary/megaphone/Google, it replaces people's TV. It's actually an incredible piece of technology when you look at it from afar. Instagram is the same way. I have an Instagram that is just entirely fitness. The great bodybuilders and athletes had incredible resources, but the layman has THIS. If you're smart you can use it to supplement your studying, further your life, or if you're stupid just abuse it.", "score": 3, "replies": []}, {"body": "Twitter was always trash imo, used it when it first got popular but I was young and just used it as any other teen would. More recently I tried to use it and stopped almost instantly as like you say, people you don’t want to hear from end up on your feed bc the people you follow follow them or retweet. Always an extremely annoying thing imo, but occasionally it was a good feature.", "score": 3, "replies": []}]}, {"body": "He made a whole video why twitter will be a trillion dollar and it’s doesn’t make sense. \n\nThey will probably ban TikTok soon which will give instagram a better edge.", "score": 3, "replies": []}]}, {"body": "When did Cathie Woods start hating Elon?", "score": 54, "replies": [{"body": "That was never. People are not doing any due diligence and just following the Elon on everything.", "score": 39, "replies": []}, {"body": "And wasn’t her fund that just went tits up like 80% Tesla? Who is this guy?? Lol", "score": 24, "replies": [{"body": "Maybe he misspoke and meant Bill Gates? Cause Cathie Wood is the biggest Tesla bull there is.", "score": 24, "replies": []}, {"body": "10% of her fund was tesla", "score": 3, "replies": []}]}, {"body": "Right?! When tf did Cathie short Tesla?", "score": 3, "replies": [{"body": "Like it was 10% of her portfolio and the only reason she sold it was because it was going up and no single stock could be 10% of her portfolio", "score": 2, "replies": []}]}]}, {"body": "He thinks it will be worth 1 trillion dollars because it's \"freer\" than the rest? Jesus this dumbass doesn't have a clue what he's doing.", "score": 18, "replies": [{"body": "He heard Tesla being called a trillion dollar company so he thinks that just means \"really cool\". He has no idea how far away Twitter is from being a $44B company, let alone a trillion.", "score": 8, "replies": []}]}, {"body": "Lol\n\nDoes he seriously think Twitter will be worth $1 trillion?", "score": 26, "replies": [{"body": "Supposedly, his goal is to turn Twitter into an everything app like Weibo in China. I think it has communication ridesharing online dating food delivery, Video conferencing etc. in one app.\n\nNo critical mass of people want would want to give that much power to him, people don’t care if it’s a brilliantly engineered app. Most people care about UX, graphic design, and product design since that’s how people interface with the app. He’s let go of a lot of those people and chosen to keep the best engineers. It’s like he still thinks he’s working at SpaceX or Tesla, where the engineering does matter more so than the design. (especially true in case of Teslas, the designs are so in and uninspired, and the interiors are literally worse than a Honda Civic with all the options.\n\nHis latest bright idea is to add video chat, voice calls, and encrypted DM’s into Twitter. That’s right, he expects people to switch from using the native feature on their phone and use them through Twitter", "score": 8, "replies": [{"body": "After the way Musk treated his employees no employee with any self respect or skill would work for Elon Musk. What a terrible boss and person he is. So I'm not sure how he's going to do anything he's planning.", "score": 8, "replies": []}]}, {"body": "Of course..  in pre 2009 Zimbabwean dollars", "score": 3, "replies": []}, {"body": "lol idk. It’s so crazy. I think we can say we have an Elon bubble for sure cuz this guy is a multimillionaire.", "score": 2, "replies": [{"body": "Does he spend all that on coke?", "score": 6, "replies": [{"body": "I’m sure he has Pepsi as well.", "score": 5, "replies": []}]}]}, {"body": "Anything can happen. 25 years ago Apple almost went bankrupt. Amazon was going to die according to experts for decades.", "score": -1, "replies": [{"body": "They actually have something to sell", "score": 1, "replies": [{"body": "As opposed to those imaginary cars Tesla sells you.", "score": 1, "replies": [{"body": "So what does Tesla have to do with Twitter ?", "score": 1, "replies": []}]}]}]}, {"body": "There's no way he could actually believe that. Hyperbole gets clicks though.", "score": 1, "replies": []}]}, {"body": "I occasionally see livestreams on my feed of Cathie, Elon, and Jack Dorsey doing a livestream talking about financial shit. I doubt Cathie hated Elon, or even disliked him.", "score": 6, "replies": [{"body": "She doesn’t. Tesla is one of her largest positions. She been a Tesla bull forever.", "score": 5, "replies": []}]}, {"body": "Lol.\n\nInstagram gonna screw up.\nTik Tok gonna screw up.\nMeta gonna screw up. \n\nBased on….? How……? \n\nNothing. \n\nDude just, “believes.”", "score": 12, "replies": [{"body": "Chad Elon vs the beta cuck Zuckerberg, according to him", "score": 3, "replies": [{"body": "Let’s be honest. \n\nIf zuck would’ve been the one to buy twitter, people would be a lot more enthusiastic about it.", "score": 2, "replies": []}]}, {"body": "Source: trust me bro", "score": 1, "replies": []}]}, {"body": "Why amplify this garbage?   Keep Elon off Reddit.", "score": 5, "replies": []}, {"body": "How do such idiots get such large podcast/social media followings?\n\nAsking for a fellow idiot here...", "score": 4, "replies": [{"body": "Make couple of millions somehow and your expert on everything.", "score": 3, "replies": []}, {"body": "\"No man ever went broke overestimating the ignorance of the American public.\" \n\n\\-PT Barnum", "score": 2, "replies": []}, {"body": "People on this subreddit will confidently call people like Elon and this guy retards. So yeah if you hold everyone to the standard that people here have ur gonna think everyone is stupid and ur the only smart one.", "score": 1, "replies": []}]}, {"body": "I hope i'm not the only one who thinks this guy is super annoying, somebody, andybody?", "score": 6, "replies": [{"body": "I use to like him before I realised his contents were just clickbait with no valid arguments.", "score": 1, "replies": []}]}, {"body": "If this is what counts as investment advice… smh. who follows this clown anyway?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "What about those electric ford F150s?", "score": 4, "replies": [{"body": "These are ot the kind of guys who are going to look at the data sheet and make a choice based on pure specs. Like was said they're not going to drive no sissy battery truck.", "score": 4, "replies": []}, {"body": "Have you seen any Motortrend, Autoblog, or Jalopnik post on the Rivian or F-150 Lightning?\n\nThese people are utterly devoid of any logic.\n\nEvery single one of them tows 20,000 lbs at 85 mph at -1000F winter temps for 2,000 miles straight.", "score": 2, "replies": []}]}]}, {"body": "This guy is generally bit of a nut job", "score": 2, "replies": []}, {"body": "this is like saying “i’m going to put my entire bank account into Exxon Mobile because Shell, Citgo, and Chevron are going to go out of business.” Absolutely brain dead", "score": 2, "replies": []}, {"body": "Patrick Bet David is a smart man. And I like his ideas", "score": -2, "replies": [{"body": "Sure this guy thinks logically and simplify stuffs but lately I’ve been seeing videos that are not well researched and just talks for clicks", "score": 1, "replies": [{"body": "Which videos are you referring to?", "score": 1, "replies": [{"body": "The housing market crash, recession and a lot more I can’t remember. In all his video he got some truth but his evidences are very acute.", "score": 1, "replies": [{"body": "Hmmm, what did he say that raised your concern? I don’t recall him saying anything outlandish that didn’t at least make some sense. I’ll say I’m pretty well versed in markets as well.", "score": 1, "replies": [{"body": "Dude was comparing the 1980s with the current situation. He said rates could go up as high as the 1980s and run the whole video based on that. Without no supporting evidence that inflation would go that high or anything. Same thing with the recession talk. I get that he benefits if the market crash and want the market to crash so bad cuz the guy is liquid asf but I think that is misleading. I liked him a lot and I expected more research and facts from him.", "score": 1, "replies": [{"body": "How come you say there’s no supporting evidence of that? What type of evidence are you even looking for when he says inflation could go as high as it was in the 1980’s? I can find you articles written by institutions and interviews of hedge fund managers and others saying the same thing. There’s also huge talks of recession and some even say (me included) we’re in a recession right now. \n\nTbh, sorry to call you out like this but you’re the one who is misinformed and not researching or listening to facts.", "score": 1, "replies": [{"body": "Dude your missing the point. And if you believed inflation was gonna get that high I don’t think you understand the economy. Also I never said we are not in a recession or we are in one I was just don’t like the fact that he is sayings things for clicks. Have you seen the video 👆. That’s what happen when you try to catch a trend with no DD.", "score": 1, "replies": [{"body": "Okay, so you’ll have to explain to me why you don’t think inflation can get as high as it did in the 1980’s. Which was 40 years ago mind you. Please enlighten me. \n\nYou’re not making any sense. What trend am I trying to catch that had no DD? You’re not saying anything of substance here. What is he saying for clicks? \n\nHow old are Lmao?\n\nEdit: nvm. Scrolled through your profile and saw you’re 23 and up until recently believed college was a scam. Your ideas in the stock market certainly reflect that", "score": 1, "replies": [{"body": "The fed will never allow inflation to run that high. I know they missed the early signs but they were able to catch it before it became runaway inflation. so don’t try to discredit them and base your argument on that. \n\nI’m 24 if you need to know", "score": 1, "replies": [{"body": "Okay, so in essence you’re saying inflation is going down? How could this be if inflation has been steadily increasing?\n\nAlso what actions is the fed taking that you think are material? Then increasing the interest rate? Because I certainly don’t think that’s doing much.", "score": 0, "replies": [{"body": "What makes you think it’s not working? You don’t think money supply is going to tighten when you raise interest rate? Aren’t you seeing the recent layoffs and companies struggling to raise money? Mortgage origination slowing down? Car prices going down? Profit Margins getting thinner? Wages increase slowing down? Your just turning a blind eye on the facts just to win an argument. You recently got married so I assume your older than me and probably should know better and act better than me. I was just trynna have a discussion but took it personal.", "score": 1, "replies": [{"body": "So you’re right the fed increasing interest rates has had some effect, we’re both in agreement there. You’re missing the big point though which is whether the Fed tightening has been strong enough to stop rampant inflation. That’s where the argument lies, not in the fact that monetary tightening has started occurring. Now that we got that out of the way. I don’t think that is enough to stop inflation hence why inflation is steadily increasing YoY. Especially while we’re still printing trillions of dollars. \n\nI’m not recently married lol. And I do know better than you. But you’re right I shouldn’t attack you for your age or ignorance. Sorry about that.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "He’s wrong about Cathie wood hating Elon Musk and being short TSLA. He seems like he doesn’t know what he’s talking about", "score": 1, "replies": [{"body": "I don’t really care tbh", "score": 0, "replies": []}]}]}, {"body": "Yup", "score": 1, "replies": []}, {"body": "Watching Elon Musk self destruct is the most satisfyingly entertaining thing in years.", "score": 1, "replies": []}, {"body": "Why the heck is someone bothering to pump Twitter when Elon already bought it?", "score": 1, "replies": []}, {"body": "He’s wrong about Cathie wood hating Elon Musk and being short TSLA. He seems like he doesn’t know what he’s talking about", "score": 1, "replies": []}, {"body": "Absolute load of nonsense.", "score": 1, "replies": []}, {"body": "I hate that Valuetainment is getting views because some of his content is highly questionable to say the least.", "score": 1, "replies": []}, {"body": "I love how all these alt-right incel morons all equate freedom with screaming the N word without consequences.    Just because its on the internet doesn't mean it should without guardrails.    People can't go into Target and start screaming to kill all the Jews and claim free speech.   Elon had so much going for him.   Why he decided to burn it all down defending a bunch of knuckle draggers who would never be caught dead in a Tesla, is beyond me.", "score": 1, "replies": []}, {"body": "ELON gonna make it happen.", "score": 1, "replies": []}, {"body": "I think people are crazy for him, and said people are crazy.", "score": 1, "replies": []}, {"body": "Wow", "score": 1, "replies": []}, {"body": "This is the same guy that started a pyramid scheme insurance company and then sold it to save face and say he's only a media guy now. He's an Elon D rider.", "score": 1, "replies": []}, {"body": "Hearing this fool rant about Twitter convinces me it’s a bubble and he is a cult leader", "score": 1, "replies": []}, {"body": "Wasn’t Cathie the biggest Tesla bull basically ever?", "score": 1, "replies": []}, {"body": "What in the low quality post is this?", "score": 1, "replies": []}, {"body": "PBD is a clown, he swears the election was stolen from Trump.", "score": 1, "replies": []}, {"body": "Instagram been in the game too long to lose to Elon I’m sorry 😭", "score": 1, "replies": []}]}
