{"title": "Amazon heads for the longest losing streak in 3 years.", "selftext": "Amazon has erased early intraday gain to head lower for four straight sessions.  This would be the seventh-straight decline that marks the longest losing streak since the eight-session stretch that ended on August 5th, 2019.\n\nIMO, Amazon has the right potential to turn around given its' diversity and business of selling everyday essentials.  It is the combination of macroenvironment, recent ER and the Fed meeting that cause such a short term pain.  Long Amazon investors should see their rewards soon.", "id": "ylclyx", "created_utc": 1667504644.0, "score": 169, "upvote_ratio": 0.94, "num_comments": 71, "comments": [{"body": "3 years isn't that long in the stock market", "score": 78, "replies": [{"body": "Just look at how much has happened in two", "score": 36, "replies": []}, {"body": "It is. Everyone is acting as if the stock market was invented in 2019", "score": 18, "replies": [{"body": "it wasn't???", "score": 13, "replies": []}, {"body": "agree.   \"3 years isn't that long in the bagholding game\"", "score": 0, "replies": [{"body": "3 years is an eternity in the bag holding game.\n\nWhen the game is to hold for one year and one day.\n\nThat’s called “long term investing”", "score": 5, "replies": [{"body": "1 year isn't even nearly long term. How much can a company realistically achieve in one year? Most things companies do takes 3-10 years, and only AFTER that they start making money. Personally think anything below 5 years is short term. You could maybe make an argument for 3, but no less than that.", "score": 3, "replies": [{"body": "Agree. \n\nIn case my dry sense of humor was missed by anyone!\n\nFor too many, (in US, at least) “long term” is measured only by the clock of the tax laws. (Long-term capital gain tax rate applies after holding for one year)\n\nThat swings both ways: I have witnessed a friend holding on to positions with big gains, waiting for favorable tax treatment, only to have it turn to significant loss. And then the personal guilt and suffering spilling-over to family and friends.\n\nSome people are so adverse to taxes, they would rather take a loss than pay a high tax rate on a gain.\n\nI have no doubt that much of current action is influenced by this mentality among emotionally-driven irrational investors.\n\nI expect selling into the end of the year rather than the “traditional” year-end buying. \n\nI think the other common irrational thought at play is the notion that a retracement from an ATH is somehow a “loss” even if in fact a gain from cost basis.\n\nWe are somewhat hoarding creatures. We feel inadequate if somebody steals some bones, even if we still have a pile, and started with none.\n\nThat said, I don’t agree that the same names from the past are the growing and profitable companies of the future. I would look for adaptability here.\n\nThat stuff being sold now? Should have been sold in January!", "score": 2, "replies": [{"body": "I did miss that you were kidding, but very good point!\n\nIn general it doesn't make a lot of sense to not pay taxes. As an example, assuming you're making a 10% annual return, it doesn't matter whether you pay 20% tax on a $100 gain now and then turn the remaining $80 into $88 this upcoming year, or you turn $100 gains into $110 gains and then pay 20% tax on that. Either way you end up with $88.\n\nObviously there are some factors that I'm not taking into account here, like short term/long term gains and tax loss harvesting, but in general it holds true at least 90% of the time that it's better to not worry about taxes and optimize what you invest in, rather than optimizing taxes by not optimizing what you invest in.", "score": 2, "replies": []}]}]}]}]}, {"body": "and interest rates, 5% is blowing a lot of young minds.", "score": 1, "replies": []}]}, {"body": "maybe it is when it's half your age as an adult. it's an odd metric, but *puts* shit into perspective -- start counting from 19. \n\n// pun intended", "score": 0, "replies": []}]}, {"body": "Judging by the amount of empty amazon boxes in my garage, i think my wife can singlehandedly boost sales", "score": 72, "replies": []}, {"body": "I bought today, fuck it. I’ll hold this for years and see what happens.", "score": 13, "replies": []}, {"body": "Although a great stock it still carries a high premium compared to GOOGL or AAPL", "score": 33, "replies": [{"body": "Amazon revenue is much greater than both those companies, and the only reason their pe is large is because they invest so much money in expanding operations. If they wanted they could quickly become a bigger cash cow than apple.", "score": 44, "replies": [{"body": "Revenue total doesn't mean a lot when you sell so much low margin junk.", "score": 9, "replies": [{"body": "AWS", "score": 26, "replies": [{"body": "AWS just subsidizes Amazon.com", "score": 22, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Don’t freaking even THINK about taking my Kindle away!", "score": 2, "replies": []}, {"body": "Prime video is a hook into their services. Prime is worth paying for the video, then you have free shipping so why not order crap from Amazon.", "score": 2, "replies": []}]}]}]}, {"body": "When it comes with the scale of Amazon it means a great deal.", "score": 12, "replies": []}]}, {"body": "Expanding where, internationally? How are those countries doing and what will the US rate hikes mean for not only them, but the growth of American businesses? Amazon does make a lot of revenue, but why are their expenses not matching up? Why are their employees complaining about long hours and unfair wages, just to get $1 raises that add $1B in expenses to Amazon’s IS? Once you ask these questions, AMZN doesn’t seem like such a safe bet in my opinion.", "score": 2, "replies": [{"body": "dont base ur thesis on antiwork subreddit -- aws alone is worth more than current MC, how many bussines will move to the cloud next 10-15y? Which is best option to host something? As someone who has the miss fortune to handle that, I can tell that aws is superior to competitors -- also amzn is throwing so much money in various moon shots, calculate internal roi the best u can, and think canu beat that? i dont think u can (nor do i)", "score": 4, "replies": []}]}]}, {"body": "AAPLs premium is insane, MSFT has actually gotten hammered(35% decline) still trades at a little premium, but that tiny premium is justified", "score": 9, "replies": [{"body": "How is it ok for Microsoft to trade at a premium but it doesn’t make sense for Apple when it’s a better run business and returns more to shareholders?\n\nYou should pay more for Apple cause of that which is why you see a massive difference in stock performance this year.\n\nEdit: Getting downvoted by the MSFT c**k riders as usual. I guess Reddit not being a fan of numbers and is no wonder why Reddit underperforms the market.", "score": -5, "replies": [{"body": "You’re paying 9x book on MSFT\nYou’re paying 43x book on AAPL\n\nApple has more liabilities than assets\nMicrosoft has more assets than liabilities.\n\nAapl beats on FCF, slightly better PEG\n\nApples management is incredible, but both are great companies", "score": 20, "replies": [{"body": "The whole price to book is irrelevant when talking about Apple and I am going to give you 3 reasons why. This argument has been used by bears for years on Apple. \n\n1. Apple has extremely high margins and return on investments. Apple is using their current assets to generate massive returns. Let me give the examples by using all of big tech.\n\nCurrent ROIC:\n\nApple: 50.2% \n\nMicrosoft: 27.6%\n\nGoogle: 25.9%\n\nAmazon: 12.6%\n\nMeta: 27.2%\n\nNetflix: 16.0%\n\nThis is actually the metric Warren Buffet and Charlie Munger talk when asked how much of a premium should you pay for a company. This is also one of the many reasons why Warren Buffet calls Apple “the best run company in the world”. A 10% ROIC is considered high and means the company is doing good investing its money. This is by no means mean’t that I am trashing Microsoft. I still think they are a great company and a ROIC of roughly 27% is still phenomenal. However Apple has an ROIC of 50%! This absolutely extraordinary and I have yet to find a company with that level of return on investments. This means Apple really knows where to put money and how to get unbelievable returns on that money more so then any tech company. The point being if Apple can use its resources extremely efficiently then why should its assets be compared to other companies? They just simply can’t cause Apple is so efficient at generating massive profits from its assets.\n\n2. Book value is really only used by people that think the company is not doing well. Unless your worried about Apple going bankrupt sometime soon and having its assets get liquidated then it shouldn’t matter. Apple shouldn’t have to sell any of assets anytime soon and I would be extremely surprised if something like this were to happen.\n\n3. Apple is a technology business. The company doesn’t manufacture its own products so its not going to have extremely large assets on its balance sheet. The only thing Apple needs is a building, people, and computers. Apple mostly outsources all its manufacturing to different companies. \n\n4. Price to book doesn’t take into account future growth and just assumes the same assets for years. \n\nIn terms of current ratio its not the only thing you should be looking at when valuing a company and saying which company is better. Current ratio is important but unless you think Apple is going to hit  bad times and have a hard time meeting its financial obligation’s then a current ratio around 0.9 is not the end of the world. \n\nI also think its important to take into account earnings and cash flow when talking about debt. Current ratio is sort of like payout ratio its an ok metric but not an accurate way to truly measure the companies financial health. EBITDA takes into account the cash flow and earnings from company it generates. If you compare Debt/EBITDA it comes out to about 0.7. This means if the world goes through a financial meltdown Apple could pay all of its financial obligations in less then a year. \n\nThat is about as clean of financials you can get.", "score": 11, "replies": [{"body": "\"apple has extremely high margins\"\n\nthat might have to do with its prices being high compared to competing products. My belief is that those margins will be squeezed over the next few years", "score": 4, "replies": [{"body": "Apple has held super high ROI and ROIC and has held the highest since 2012. Unless your expecting Apple to miraculous lose its pricing power from its massive ecosystem it has held for over a decade then why would it? If Apple were to lose that much other big tech is probably going to suffer just as much if not more cause this would show the economy is contracting.\n\nAlso you do realize that ROIC and ROI is not just determined by the pricing power dominance. Apple doesn’t have nowhere near as much money tied to property or plants as other big tech companies. This helps boost their operating margins super high. This was kinda of brought up in my 3rd point on the price to book argument.", "score": 1, "replies": [{"body": "yes,  I'm expecting Apple to lose pricing power and I wouidn't consider it a miracle", "score": -3, "replies": [{"body": "Yet you have yet to show a single reason why that would happen other then you just expect it to happen eventually. Great analysis.", "score": 3, "replies": [{"body": "You obviously have enough conviction for yourself plus one or or two other people. I'm not here to convince you, just offering the opposing viewpoint for anyone reading who is skeptical of Apple's potential.", "score": -2, "replies": [{"body": "Ok your acting like I am not open to a discussion. You commented saying “Apple’s margins are going to decrease”. I said “Ok I disagree” and I gave you a couple of points why that is most likely not going to happen using past history and data. Then you respond with “You have too much conviction. I am not here to convince you.” Its like ok then why discuss period if your not even going to back up your own points. Anybody can just say I think something is going to happen and not provide any data as to why. \n\nI am just confused on why comment in the first place cause you haven’t provided any backing. I have a bear case for Apple but it doesn’t have nothing to do with ROI or Operating Margins.", "score": 2, "replies": [{"body": "you lose credibility when you say something would be miraculous which is clearly within the realm of possibility.  I don't debate with fanatics", "score": -2, "replies": [{"body": "You haven’t given ANY reason why. Is it possible….yes. Is it probable…..no. I am arguing that its not probable based on data and evidence. \n\nAlso if your investing on something being in the realm of possibility then you shouldn’t be buying stocks period cause ANYTHING is possible. Is it probable Microsoft goes bankrupt next week? Yes, however is that probable? Absolutely not in the slightest. So yes it is miraculous cause there is no evidence that says its going to happen.\n\nLike I said you still have yet to give any reason why your argument would happen and instead you keep dancing around the argument. Not sure if your just being a mindless troll or if your really an incredibly dense of a person.\n\nRegardless I am not responding to you anymore sense your more content with wasting my time rather then providing any discussion. I gave you my points on why your argument is wrong and have proven that your argument is wrong. That you are just wrong and you have yet to give a single reason why your not wrong. You are wrong. Done. Have a great day.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": ">The whole price to book is irrelevant when talking about Apple\n\nAh yes it always is irrelevant until its relevant and then we can go fuck ourselves", "score": 0, "replies": [{"body": "Do you not you not read past the first sentence of my comment?", "score": 1, "replies": []}]}, {"body": "I’m not arguing Apple is bad: both are extremely good companies. Mr. Market likes Apple right now more, but not as of late(market likes neither rn) but aapl has been -4% and -3% when MSFT has been -2 and -2", "score": 1, "replies": [{"body": "I think the point I am trying to make is there is a reason why Mr. Market likes Apple the most. Also comparing the day to day moves just doesn’t make sense from a long term perspective.\n\nMy main argument is that Apple deserves to trade at more of a premium then Microsoft cause as much as Microsoft is a great company Apple is the better one according to fundamentals.", "score": 1, "replies": []}]}]}, {"body": "Microsoft is also one of the only two triple A rated companies worldwide, next to Johnson & Johnson.\n\nIt’s such a great company.", "score": 5, "replies": []}]}]}]}]}, {"body": "The megacap collapse in 2022 has been absolutely epic... financial history in the making.\n\nhigher interest rates + economic slowdown = trillions in market cap goes poof", "score": 13, "replies": [{"body": "No, it changes owner.", "score": 0, "replies": []}]}, {"body": "Agree. Excellent long run choice. Bought a bunch last week at 88 and some today at 90.", "score": 10, "replies": []}, {"body": ">Long Amazon investors should see their rewards soon\n\n?", "score": 13, "replies": [{"body": "I'm a geologist.  Soon for me is like 50 million years.", "score": 34, "replies": []}, {"body": "2 years ago, I thought we would see our rewards for holding Amazon - \"soon.\"\n\nAnd here we are.", "score": 0, "replies": [{"body": "You saw them soon.\n\nI don't know what you did with them when you saw them.\n\nBut if you did nothing, you went up and then back to where you came from. Not great, not terrible.", "score": 1, "replies": []}]}]}, {"body": "Amazon apple google all best long term holds. If republicans win next week, expect a bull run until next quarter", "score": 8, "replies": [{"body": "I feel like MSFT as well. What’s the reasoning you didn’t add them to that list?", "score": 4, "replies": []}]}, {"body": "When to start buying???", "score": 2, "replies": []}, {"body": "Seems to finally being re-priced to a more sensible valuation.", "score": 2, "replies": []}, {"body": "Amazon execution is best among all companies. They hire the best, pay them well and make them work like crazy. They will continue to grow more than any other company. \n\nBut that doesn't mean stock will do well. I'm down too much on amazing from the investments in last 5 years.", "score": 1, "replies": []}, {"body": "They really need to start firing people. Same for Meta and Alphabet.", "score": -5, "replies": [{"body": "They really don't. Economy is going to rebound sooner or later. And then what?", "score": 8, "replies": [{"body": "They still need to regardless of the broader economy. Tech salaries and workforces got way too sizeable for easy was required by these companies.\n\nThey could all use find focus and dedicated effort.", "score": 0, "replies": [{"body": "Tech salaries just tanked with the stock market...", "score": 2, "replies": [{"body": "They should. It made no sense whatsoever.", "score": -1, "replies": [{"body": "With how oversized the RSU component is in most big tech compensation models, the problem kinda solved by itself for the existing workers.", "score": 2, "replies": []}]}]}]}, {"body": "Sooner or later? At this rate it's going, it's probably later.\n\nIn the meantime the shares will bleed out. \n\nI will bet that layoffs are on the cards and it's a matter of timing. Let's see which one breaks first and then the rest will follow.", "score": -3, "replies": []}]}]}, {"body": "It had just about trouble some time ago getting past $35/s early on. Not profitable selling used books and CDs.", "score": -1, "replies": []}, {"body": "Curious if Rings of power which was a big fail and cost them millions has something to do with the fall.\n\nThis is one stock I never cared for in my portfolio.\nCurious how much lower it will go.", "score": -11, "replies": [{"body": "nothing to do with Rings of Power, that is not at all a needle-mover for Amazon", "score": 13, "replies": []}, {"body": "I wonder if Rings of Power was just a big tax write off from the get go....", "score": 0, "replies": []}]}, {"body": "AMZN\nAmazon.com, Inc.\t90.98\t+1.68\t+1.88%", "score": 1, "replies": []}, {"body": "I personally think the fall of AMZN stock value has been in bad leadership from Andy Jassy. Stock price has been on continuous decline since Bezos left.", "score": 1, "replies": []}]}
{"title": "$pypl after market..rock bottom...", "selftext": "", "id": "yldr5p", "created_utc": 1667507061.0, "score": 57, "upvote_ratio": 0.85, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 month ago\n**Total Comments**|46|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=yldr5p)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=yldr5p)", "score": 1, "replies": []}, {"body": "Now is definitely the worst time to report bad earnings", "score": 38, "replies": [{"body": "Did you listen to the call ??  Good earnings.  Good guidance.  Exciting partnerships.   Closes green tomorrow", "score": 15, "replies": [{"body": "Don’t forget market expectations and outlook. You seem to be emotionally invested, very dangerous", "score": 6, "replies": [{"body": "Not even a little bit. Have never owned the stock.  I mean I use Venmo but I’m not a Stan.  \n\nMarket expectations were its a dumpster fire.  It’s not even close to one financially.   Overall market sentiment tomorrow after pmi could fuck me but it’a 1.5% of my portfolio.   Google is fuxking me much worse", "score": 1, "replies": []}]}, {"body": "Lowered guidance and FY22.  With P/E at 48+ before earnings, watch it come back to reality like every high P/E tech stock the past year.", "score": 1, "replies": [{"body": "Exactly, it was meant to fall unless they would report stunning result, way above expectations. In bull market everything grows even if the earnings are bad, but everyone here seems to lose their heads because stock falls after reporting earnings as predicted during a bear trend. Maybe if this stock was cheaper it wouldn’t have dropped 10%. IMO still way to go down for pypl", "score": 1, "replies": []}]}]}, {"body": "Not for stupid Coinbase", "score": 3, "replies": [{"body": "Just wait until they talk about the hack. They're still investigating it 6 months later to see exactly what the damage was.", "score": 3, "replies": [{"body": "Ahh I hope so man, cuz my puts for tmrw and likewise everyone’s else’s got hammered after hours lol", "score": 1, "replies": []}]}]}, {"body": "yet coinbase shot up.\n\nI'll be looking at calls for pypl, they beat earnings and while guidance was weaker it wasnt bad, a 9% drop is an overreaction", "score": 1, "replies": []}]}, {"body": "my 76$ puts gonna be a 3 bagger or what?", "score": 16, "replies": [{"body": "Looks like it. Congrats!", "score": 6, "replies": [{"body": "thanks bro but i hope it stays down", "score": 3, "replies": []}]}, {"body": "Maybe right at open.  I think it rises all day", "score": 2, "replies": []}, {"body": "nah at most 70% gain, IV crush. And it’s possible to go green by open", "score": 1, "replies": []}]}, {"body": "Fingers crossed it stays like this till the morning", "score": 13, "replies": [{"body": "Aaaaannnnnd it's reversing", "score": 6, "replies": [{"body": "& then it will reverse again pre market lol", "score": 2, "replies": []}]}]}, {"body": "Paypal is now my Paypig with these puts about to print", "score": 21, "replies": [{"body": "Papi punish plz ![img](emote|t5_2th52|4267)", "score": 2, "replies": []}]}, {"body": "yes, my puts are printing", "score": 12, "replies": [{"body": "69 printing....", "score": 4, "replies": []}]}, {"body": "73$ puts gonna put!", "score": 3, "replies": [{"body": "rip", "score": 1, "replies": []}]}, {"body": "this is BEFORE me and millions closed their accounts!  Wait til next...", "score": 13, "replies": [{"body": "i closed many times, but idont gve up😁😁..", "score": 2, "replies": [{"body": "well this time for good!", "score": 1, "replies": []}]}]}, {"body": "So like the butt load of 11/11 55p power ball Iottos I bought print tomorrow? 🤣 this POS stock better open sub $65 tomorrow.", "score": 4, "replies": [{"body": "nailed", "score": 5, "replies": []}]}, {"body": "Pypl was cisco 2.0.. even revenue double or triple the stock price will never get back to 200 or 300 ! \n\nIn 2000 Cisco revenue was 16B and all time stock price hit 77 and in 2022 Cisco revenue hit 51B and stock price at 45..", "score": 5, "replies": []}, {"body": "The market is tricky dicky. Great earnings and guidance but still plummets. Seen other companies go up on earnings way worse than PayPal. Mind blown.", "score": 3, "replies": [{"body": "will reverse by market open", "score": 2, "replies": [{"body": "God I hope so that would be nice to get my money back from PayPal.", "score": 1, "replies": []}]}]}, {"body": "Good, fuck'em", "score": 8, "replies": []}, {"body": "pls jobs save me", "score": 2, "replies": [{"body": "mcdonalds is hiring on NJ😁😁😁", "score": 1, "replies": []}]}, {"body": "Bigtime buy at 66 though if u ask me", "score": 2, "replies": [{"body": "Job reports tomorrow", "score": 2, "replies": [{"body": "A good report shouldn’t reflect the decline.  Bad report should help the decline.", "score": 2, "replies": [{"body": "I know. I'm hearing rumors it'll be 3.4% but that's rumors. We'll see what happens", "score": 3, "replies": []}]}]}, {"body": "Give me money so I can average down lol", "score": 2, "replies": []}]}, {"body": "Are they charging $2500 PayPal users ?", "score": 2, "replies": [{"body": "i delete my paypal after the anouncement tho..", "score": 2, "replies": []}]}, {"body": ">I'm not sure what you're trying to say with this chart, but it looks like PayPal Holdings is down 3.65% today. I wouldn't recommend buying into this stock right now.", "score": 2, "replies": [{"body": "buy some puts before market closed, hell yeah", "score": 6, "replies": []}]}, {"body": "calls 10x tomorrow intraday?", "score": 3, "replies": [{"body": "Call it today before market closed,", "score": -1, "replies": []}]}, {"body": "Lol having a $2500 fine in their terms of service for whatever they decided is “misinformation” and the user loss because of it probably didn’t help…", "score": 3, "replies": []}, {"body": "F Paypal", "score": 3, "replies": []}, {"body": "Down down down you go downstairs down the\n\n streeeeaaaaammmmmm!!!!!\n\n\nMerrily merrily merrily merrily life is nothing but a dream.", "score": 2, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "It feels like all tech stocks are now PLTR a few months ago.", "score": 1, "replies": []}, {"body": "At what price point would this industry dominant player a good buy?  25 P/E?", "score": 1, "replies": []}, {"body": "back to only -6% YES", "score": 1, "replies": []}, {"body": "I'll wait for the ER call and predict this goes green tomorrow... unless the jobs report comes back bad and tanks the whole market. I'm a hopeless optimist.", "score": 1, "replies": [{"body": "I think you’re right despite the downvotes.  I bought shares after earnings were released and it tanked and more after the call", "score": 3, "replies": []}, {"body": "ye right, bec of nfp before market opens.", "score": -2, "replies": []}]}, {"body": "Paypal is the worse. And people still use it and worse yet, invest in it.", "score": 1, "replies": [{"body": "What alternative payment companies do you think are better options for investing in for the next 3 years?", "score": 3, "replies": [{"body": "Find something else to invest in. Why alternative payment system? Why not REIT? Oil?", "score": 1, "replies": [{"body": "I believe PYPL will recover, not to peak covid level but enough to make it worth buying now and holding for 1-2 years.  \n\nOil prices might go up, might go down.  I've bought an energy ETF, VDE, that has done well.  Oil has sucked for years before just recently though.  \n\nI doubt REIT will be better than buying PYPL, AMZN, GOOG, GSK, and others at current price points.", "score": 2, "replies": [{"body": "But why encourage PYPL to remain in business by investing in it? Have you read all the horrible shit they do to their customers?", "score": 1, "replies": [{"body": "Yeah, I've had my account suspended and paid fees to them for years.  I'm aware.\n\nYou asked why not oil and then mention Paypal's business practices?  lol.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Wtf is no with all these companies and their bullshit 50+ PE. And people expecting the stock to moon lol\n\nBitch apple at PE of 30 is going down. Everyone else should be at 10", "score": 1, "replies": []}, {"body": "Not even close to the bottom, which will be zero.", "score": 0, "replies": []}, {"body": "They crushed it on earnings so this will reverse course once the HFs start to scoop up those cheap shares.", "score": -1, "replies": []}, {"body": "END ME", "score": 1, "replies": []}, {"body": "Sweet!", "score": 1, "replies": []}, {"body": "I bought $75 11/04 puts bb, u think it’ll be a 5 bagger or what?", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|19738)", "score": 1, "replies": []}, {"body": "This post gave me cancer", "score": 1, "replies": [{"body": "ow my strike value hit at 72😁😁😁, some regards want more dip and youre one of them gettin trap in a hole", "score": 1, "replies": []}]}]}
