{"title": "Wtf how do you put a call at a price lower than the current price.", "selftext": "For example I saw that guy who made gainz (front page guy who rode NVDA) and saw he had a 107 call??? How can you put a call lower than the current price. Wouldn't that be a put? Am I retarded???", "id": "6ciytx", "created_utc": 1495400456.0, "score": 28, "upvote_ratio": 0.74, "num_comments": 43, "comments": [{"body": "> Am I retarded???\n\nWell....\n\nEdit: But yes, you can buy a call below or above the current price. It's \"in the money\" if the stock's currently above the strike price. A call's strike can be pretty much whatever. You can buy Amazon calls for 750, or 1250. Buying them at 750 will be ungodly expensive, and buying them at 1150 would be like 0.001.\n\nMain difference between a call and a put... a call you want it above the strike price, a put you want it below. A put's the equivalent of shorting.", "score": 55, "replies": [{"body": "What would be the point of buying the 750 one? Would you lose money from the premium prices being too high? I thought I knew shit about options until this buy call options below the underlying stock price shit came up.", "score": -1, "replies": [{"body": "When you go far ITM like that it you're almost entirely intrinsic value, which means you're buying the stock with a 3-4x leverage. \n\nFor example, with Amazon, let's say you buy the monthly June call at the 750 strike at what I see as the ask price - 211.30. That means if you exercised the option right then your break even is 961.30 for a share currently worth 959.84. Doesn't take much for you to start making money does it? It also gives you about 4x leverage on Amazon to where Amazon goes up $1 you'll have made $4 compared to buying one regular share. \n\nNow if instead you go with the 960 strike, the current ask is 18.55, meaning your break-even is 978.55. The risk of it expiring worthless is pretty high, assuming Amazon climbs up, you'd be leveraged about 52x, so significantly higher returns if it jumps that high compared to buying shares or deep ITM calls. ", "score": 52, "replies": [{"body": "I think I'm less retarded than before honestly thank you tho", "score": 36, "replies": []}, {"body": "Guarantee it's a stupid question, but how do you find the rough leverage on the contract? Is it the delta? Thanks! ", "score": 3, "replies": [{"body": "Just divide the share price by the option price. \n\nSo if the stock is trading at 100/share and an ATM call is trading at $10, you have 10x leverage on the stock. If you invest $100 you either choice have 1 share or 10 contracts entitling you to one share each. (I'm ignoring a contract is 100 shares for simplicity)", "score": 11, "replies": [{"body": "Ahh seems obvious now, thank you! ", "score": 1, "replies": []}]}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -16, "replies": [{"body": "eat a dick automod", "score": 30, "replies": []}]}]}, {"body": "In the money calls have higher delta's than OTM. ", "score": 10, "replies": [{"body": "well not really if you buy multiple otm calls coming up to the same cost as 1 itm call usually they'l have higher combined delta. I would say itm has lower extrinsic and less theta", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "100 shares of the underlying stock itself? Or a contract of it at it's current price ", "score": 2, "replies": []}]}, {"body": "1) The more in-the-money something gets the cheaper it is ratio-wise, the strike price might be 15 lower, but you're only paying 13 more. There's diminishing returns, though, and you've still got the premium itself.\n\n2) You increase your investment and in some ways reduce the risk. The further in the money, the less % you'll lose from minor fluctuations. If your idea doesn't pan out, you might only lose 10, 20 or 30%. If your strike is right OTM/ITM you're either going to get rich or be SOL, not to mention market-wide fluctuations can easily screw you over, etc.\n\n3) There's no reason to buy Amazon calls at 750, assuming there's anyone actually selling, but the option still exists. Some peoples here will sometimes buy around 920-950, though. If you're buying calls 3, 6, 9+ months out you might want more leeway.", "score": 1, "replies": [{"body": "> There's no reason to buy Amazon calls at 750, assuming there's anyone actually selling, but the option still exists. Some peoples here will sometimes buy around 920-950, though. If you're buying calls 3, 6, 9+ months out you might want more leeway.\n\nHoly shit. The autism is real.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "This is how I learned what Delta was. Wish I could help and save him, but truth be told, you learn pretty damn fast.", "score": 1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Guess I'll do it! ", "score": 1, "replies": []}]}]}, {"body": "lol i'm hardly an expert on options, but these retards trade them without having the faintest clue of how they work. I only wish I could take the other side of their trades.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nah, most of the time, it's the market makers taking the other side of your trade.\n\nIt works out for them, because they earn the bid-ask spread. The law of large numbers makes it profitable for them to take the other end of as many trades as possible. Furthermore, many brokers are also market makers, thus gaining them commission + bid/ask spread on each trade. So statistically, it makes tons of sense for them to take the other side of every single trade.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, for sure, but that's because they don't have enough capital to create infinite liquidity, so of course they do have some models to select the best orders to fill.\n\nBut in general, they like taking the other side of your trades. Especially when they're the broker and market maker.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, it's pretty cool shit.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I dont even trade options but do you know how to read a chart lol NVDA was sitting at 102 or so before ER.", "score": 13, "replies": []}, {"body": "You can buy a call that is lower than the current price. It is referred to as an ITM, or in the money, call. The premium on itm options is typically much higher than otm. To be profitable your option needs to gain enough value to outweigh the cost of the premium you spent to buy it. For instance, NVDA is currently at $136 per share. You could buy a call option that expires June 16th with a strike price of $110. The premium on this option would be $26.70. The point that you would be profitable would be $136.70 + commission/100.\n\nItm options have a much greater probability of success than otm options but the up front cost (premium) is much higher.", "score": 10, "replies": [{"body": "Right, and there are very good reasons for going deep ITM just that faggot delights isn't one of them. \n\nI remember a while back someone was talking about going into XLE with deep ITM calls because you were getting a huge time horizon basically at intrinsic value. I think it was Jan 2019, but the gist of that move was if you think XLE will do well, this gets you like 4x leverage. So, you could invest $1000 into XLE and get whatever returns it has or you invest $1000 into the Jan 2019 calls and get 4x the returns of XLE. \n\n", "score": 2, "replies": [{"body": "But the losses are leveraged too? Or do the premiums cut it ", "score": 2, "replies": [{"body": "Yes gains and losses are leveraged that way until it drops below strike and you lose it all. With deep ITM you have some room before it becomes worthless unlike otm where it has to go up or worthless.", "score": 3, "replies": []}]}]}, {"body": "Thank you I think I've been enlightened ", "score": 1, "replies": []}]}, {"body": "After reading all these comments I've realized I am not ready to go into options. Thanks fags", "score": 14, "replies": [{"body": "[*Fundamentals of Options and Futures Markets* by Hull.](https://www.amazon.com/Fundamentals-Futures-Options-Markets-9th/dp/0134083245/)", "score": 7, "replies": [{"body": "Fuck options.  Selling books is where the money's at.", "score": 10, "replies": []}]}, {"body": "which is exactly why now is the time to start.", "score": 5, "replies": [{"body": "Exactly ", "score": 1, "replies": []}]}]}, {"body": "Yea", "score": 3, "replies": []}, {"body": "Some people buy ITM options because they have lower theta decay. Their price decays at a slower rate compared to a OTM option.", "score": 3, "replies": []}, {"body": "This was a refreshing post, nobody called each other faggots or cucks, good job moon trekkers ", "score": 3, "replies": []}, {"body": "You can buy in the money calls if you expect it to continue to rise, they are often safer, but obviously more expensive. ", "score": 2, "replies": []}, {"body": "Do yourself a favor and stay out of options trading.", "score": 2, "replies": []}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "this is too much", "score": 1, "replies": []}, {"body": "I don't get why people who don't understand the mechanics behind options attempt to trade them.", "score": 1, "replies": [{"body": "Correction, I have not yet traded them. ", "score": 8, "replies": []}]}, {"body": "Holy fuck yes you are retarded", "score": 1, "replies": []}, {"body": "It’s not a hard concept. If the mkt price is 170, call strike price of 160 would make the option worth at least 10 dollars (present value). The further out you go the higher the premium. Deep enough in the money the premiums are really high, but the combined the value of the premium in the strike price is barely over the current market price because you’re essentially getting a loan.", "score": 1, "replies": []}]}
