{"title": "$SHOP (Shopify) earnings out! Q1 EPS of -$0.04 beats by $0.06. Revenue beat by $5.81m (+75.2% Y/Y)", "selftext": "[deleted]", "id": "68skbn", "created_utc": 1493724608.0, "score": 29, "upvote_ratio": 0.88, "num_comments": 54, "comments": [{"body": "Yay! ", "score": 7, "replies": []}, {"body": "Nice thanks.  Yeah I see it gapped up in PM, but then fell 2%, strange.\n\nI like their guidance too, way above consensus.", "score": 3, "replies": [{"body": "My numbers show it's rebounding quickly after the 2% dip even before open. I think the dip was the work of Wall Street bots selling at the all time high before earnings and then reinvesting at a lower price to further increase their margin. I think shop is about to EXPLODE. (In a good way) ", "score": 4, "replies": [{"body": "> I think shop is about to EXPLODE. (In a good way)\n\nSo *not* the way AMD investors' skulls exploded today? (With a shotgun)", "score": 2, "replies": [{"body": "Lmao!!! That's been the subject of many conversation today ", "score": 1, "replies": []}]}]}, {"body": "Sold it at 7+ % right after market opened and jumped in again at 2%, got 2 extra shares in a matter of minutes :)", "score": 2, "replies": []}]}, {"body": "Bought in at ipo and bought in some more last week.  I'll be holding this for the foreseeable future.  ", "score": 3, "replies": [{"body": "Nice!", "score": 1, "replies": []}]}, {"body": "This is just one of those companies that I wish I saw sooner. I am waiting for a pull back, but if it never happens I guess I will be one of those people who said \"yeah I had a chance to invest in amazon before it was AMZN.....wanna fight about it?!?!?!\"", "score": 2, "replies": [{"body": "Its not too late.  If you are willing to hold 10 years this might be a 500-1000% return.", "score": 1, "replies": [{"body": "I am still going to hold off for now. Although I will continue to monitor.", "score": 1, "replies": [{"body": "I don't see a big pullback happening, this has been bouncing off of its 20DMA beautifully ", "score": 1, "replies": []}, {"body": "Buy at least 25% of what you want to buy right now and add another 25-50% next quarter. Hedge your bets or you will indeed by the guy that had the chance to invest in amazon before it was amazon.  \n\nI was in the same boat, bought 25% 2 months ago and will continue to add throughout the year. ", "score": 1, "replies": []}]}]}, {"body": "This stick isn't going to pull back enough to convince you to buy in. Buy in now if you want to get in on this train before it breaks 100 next year.", "score": 1, "replies": []}]}, {"body": "I've been staring at this stock since it was at $58. Now I'm in at $84. That's what waiting gets you...", "score": 2, "replies": []}, {"body": "SHOP just a beast. And stuff like this makes me wonder why people are so focused on trying to find bottoms in B & M retailers who have had no innovation for years and who have had their head in the sand while Amazon has passed them by. If anything, the fact that this is basically screaming higher should give some concern about the reality of the serious changes going on in retail.", "score": 4, "replies": [{"body": "Walmart will be fine I think. I think walmart is a strong buy ", "score": 1, "replies": [{"body": "Wal-Mart is merging to a lot of online business\n", "score": 1, "replies": [{"body": "Thats why i think its a strong buy. Their effort to go online has been huge. ", "score": 2, "replies": []}]}]}]}, {"body": "I'm hyped up about SHOP but it's financials are trash\n\nhttp://beta.morningstar.com/stocks/XNYS/SHOP/quote.html\n\nIt's like Tesla and all hype. Once there is a correction this thing will plummet. ", "score": 4, "replies": [{"body": "wrong.\n\nProfits are low because SHOP spends a TON on advertising/marketing and R&D. Which is smart. I mean with 75% revenue growth this year and 95% revenue growth last year why not?\n\nSHOP is building a massive ecosystem and moat to prepare for the mass exodus of stores transitioning from Brick and Mortar to online and omnichannel. \n\nTake a look at SHOP's Gross margins. They are strong and rising. Without high marketing/adversting costs SHOP would already make a nice profit. ", "score": 6, "replies": [{"body": "The literally are doing what amazon did 6 years ago. Blow earnings on marketing and service providing, kill the competition, stock continues to rocket.", "score": 4, "replies": [{"body": "exactly. They are building a beautiful moat around their platform. Adding services, channels, and scale. \n\nThis company is amazing and hardly anyone knows about it yet.", "score": 7, "replies": []}]}, {"body": "Operating margin for the last 5 years\n\n2012 -6.38\t2013 -8.50\t2014 -20.58\t2015 -8.65\t2016 -9.55\t\n\nWhy is it negative?\n\nLast one was 2016, not sure what the new one is from this earnings report?", "score": 1, "replies": [{"body": "Look at gross profit. Keep going up strong.\n\nOperating margin will go down because they are spend a TON on marketing/adversting to get new customers.", "score": 2, "replies": []}, {"body": "Operating margin includes marketing/advertising, he already told you why. ", "score": 1, "replies": []}]}]}, {"body": "You have it all wrong. They are spending a LOT on acquisition and infrastructure because every customer they get now is more likely than not for life and not going to a competitor. This is cutting into their profitability big time but it will pay off. ", "score": 2, "replies": []}]}, {"body": "Very nice. I always liked this company, though never bought the stock. ", "score": 1, "replies": [{"body": "Its not too late. As long as you hold long term.\n\nI thought it was too expensive at $50. I finally gave in and bought at $68. Glad I did.", "score": 1, "replies": [{"body": "I bought at 70 and this stock is only going to keep climbing. Same with FSLR who has their ER ah today.", "score": 1, "replies": []}, {"body": "maybe you're right, I should really think about it, thanks. ", "score": 1, "replies": []}]}]}, {"body": "SHOP is nothing but up today after this report. Do stocks that spike on reports/news usually drop the next day? Is it smart to sell end of day/tomorrow morning and then buy again?\n\n,go easy on me\n-market noob", "score": 0, "replies": [{"body": "Just hold it.", "score": 2, "replies": [{"body": "Thanks for your response. If it drops tomorrow and you can buy the dip, why hold? Any more insight you can offer?", "score": 1, "replies": [{"body": "You already made a good pick.  If you start trying to time the market, you will fuck it all up. Just be happy with a winning trade.", "score": 1, "replies": [{"body": "Good advice. Thanks!", "score": 1, "replies": []}]}, {"body": "To me it's the difference between investing and trading. I do both. Right now I'm trading $SHOP because the hype and volume is there. I also have investments in SHOP that I don't touch for the long term. I'm not afraid to buy at peak if I'm holding.", "score": 1, "replies": [{"body": "Understood. Thank you!", "score": 2, "replies": []}]}]}]}]}, {"body": "$SHOP continuing to sell off in the pre-market.  Now down to $77.50.  I think the beat and the guidance isn't enough and am expecting it to open down when the market opens. ", "score": -1, "replies": [{"body": "Yeah, but long term, this stock will be a HUGE winner.  If it sells off, that's great for me, so it gives me the opportunity to establish a position at a discount. ", "score": 3, "replies": [{"body": "Could you explain your reasoning it will be such a large winner?", "score": 1, "replies": [{"body": "Look at their year to year growth and the fact that while e-commerce is obviously big right now, it's gonna get bigger in the future as more and more people shop online. This benefits Shopify.  Just like how this trend in less transactions being done through cash benefit Visa.  Not sure when I'm gonna buy some shares of $SHOP, but definitely soon.\n\nObviously do your own research, but they are still pretty small and still have room for growth, despite how they have already done.", "score": 2, "replies": []}]}, {"body": "Crashing all to hell now down to $75.  Good luck catching a falling knife.", "score": -9, "replies": [{"body": "Look again lmao", "score": 9, "replies": [{"body": "He is just salty because he is a broke boi that  cant buy in lol", "score": 5, "replies": []}]}, {"body": "this isn't a falling knife.\n\njust basic premarket BS with low volume ", "score": 2, "replies": []}]}]}, {"body": "I can see a reversal like last time. Just wait until the call happens. Definitely interesting pre-market action. ", "score": 1, "replies": []}, {"body": "it won't open down, there was people profit taking on the am spike right after the report and that scared some people. Today will probably be a 3%+ day", "score": 1, "replies": [{"body": "up 3.5% premarket now.\n", "score": 2, "replies": []}]}, {"body": "it says up 7% on my phone...\nedit : now just 3.4% :(", "score": 1, "replies": []}, {"body": "Priced in", "score": -1, "replies": [{"body": "nope", "score": 1, "replies": []}]}]}]}
