{"title": "Bears Take Control of the SPX (video)", "selftext": "[here](https://youtu.be/fF4sJaMCRc4) Been making a weekly video about a pullback for a month now. For those who follow now we've gotten that prediction, here is my belief of the range as well as the next steps for the either bull or bear market moving forward for SPX, CL, XLE, XLF, HYG, GOOG and a few others.\n\nI'm a futures day trader by career and for validation you can see my daily posts of P/L on Twitter or see my stream of trades live in our chatroom. So I hope you all enjoy!\n\nTrade smart!", "id": "4i201u", "created_utc": 1462482738.0, "score": 19, "upvote_ratio": 0.85, "num_comments": 7, "comments": [{"body": "https://twitter.com/BitbearYolo/status/726508146320105473\n\nlot of questions answered here regarding dtpmatt\n\nany noobs who want to learn to trade the right way from a guy who isn't selling something\n\ncheck out http://theinnercircletrader.com/Tutorials.htm\n\nhttps://twitter.com/ICT_MHuddleston\n\n\nhe's had free tutorials for years.  many profitable traders use his concepts and teachings.\n\n\n*btw dtpmatt can you give us a screenshot of why you are permanently banned from reddit?*", "score": -1, "replies": [{"body": "I don't see questions answered, I see you talking to yourself on your twitter about me stating some weird theories you have when you have never met me. \n\nBut on my twitter I see that I posted about $8k profit this week? Let the readers judge the success and content of the video for themselves and stop being a jealous troll. We could debate the topics in the video? Keep it constructive? Bring it...If you can :)", "score": 3, "replies": [{"body": "lol \"weird theories\".  \n\nyou must be getting good at photoshop now.\n\nit's impossible to debate your videos because it is nothing of substance.  \"it could go up, go down, could go sideways, we won't know until 'A' line breaks\"  a magic eight ball is better than you for trading commentary.\n\nany chance, i can get a screenshot of why you're banned from reddit?  thanks buddy\n", "score": -3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "http://puu.sh/oI1Je/b6ae28adeb.png\n\nlet's see that link to that \"live stream\"\n\n*PS, can i get a screenshot of why you're banned from reddit?* ", "score": -2, "replies": []}]}]}]}, {"body": "Why so salty? He never claims to be a \"guru\". He's wrong sometimes just like anyone else, and right sometimes. Its not that crazy that he's a successful trader, there are many. If you put time and effort into something it usually can pay off eventually. He's just providing his opinions and analysis from his experience. You can disagree its totally fine. Traders, analysts, speculators, everyone disagrees. Thats why you discuss and try to consider all the angles for the most probable outcomes. Why isn't a healthy debate happening on this sub from people's posts of their analysis? Anyways, great links to the free info! The more education for traders the better :) Although he does seem to be pawning himself off as a guru, from the inner circle of secret secrets... but hey if it works it works!", "score": 4, "replies": [{"body": "He is wrong more than he's right.  Notice he never posts the day totals, just certain trades.  I dont appreciate him giving advice to new traders from his made up pedestal, because he's wrong more than he's right.   He really needs to learn technicals before trying to teach others.  ", "score": 2, "replies": []}, {"body": "Well said!", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": -3, "replies": []}]}
{"title": "GOOG vs. AAPL", "selftext": "A few days ago, I made a post about AAPL and asked for some opinions on a slight bounce back of the stock after it was destroyed by missing the earnings mark. I was in AAPL for a day (up 2%) and sold immediately after they announced the China loss. After a day full of research, probably 4 hours worth, I have decided that GOOG may be the best investment for me. I think after it lost about 8% over the past few weeks, it could be the real winner in the markets losses. The company never seems to disappoint and continues to pay out investors handsomely for a long play with them. They are a company of a future and I don't think I have felt this confident about a position at this price before (694 yesterday). I would love to hear some opinions on this play from you all. Sidenote: The last two days have been the first time on reddit, the stock page is great. Mods do a good job and I love to hear the opinions being shared by you all. Disclosure: I'm 24 and have been trading for about 8 years. Yes, I'm trying to learn everything I can and am not afraid to say it.  Purchased 10 shares of GOOG at 694 yesterday. ", "id": "4hzqnr", "created_utc": 1462452499.0, "score": 13, "upvote_ratio": 0.84, "num_comments": 16, "comments": [{"body": "I sold AAPL before the crash and got back in around $93. Look at the [P/E](http://imgur.com/oADSFy9), that's hard to night invest on . It's down right now and at a great price to buy in.", "score": 3, "replies": []}, {"body": "Here is a tool you can use to test valuations.  It lets you adjust Growth rates, Cost of Capital, Free Cash Flow, Debt and # Shares to see the impacts on the valuations\nWith your research try and determine growth rates next 3 years and if you want to explore deeper there is a WACC calculator there as well   Any Q's or issues send me a note\n", "score": 2, "replies": [{"body": "Awesome,I'm not sure you attached it though because I can't see the link. Thanks, I appreciate it", "score": 2, "replies": [{"body": "Sorry - here is google\nhttps://www.stockcalc.com?ss=79C20BD285524090B937C5D34C22ADEC\n\nChange the symbol to AAPL and select it from the dropdown to run Apple", "score": 3, "replies": [{"body": "That's really cool, thanks for sharing this.", "score": 1, "replies": [{"body": "Those are the free tools - Please have a look at the full site \nu/n Reddit p/w Investor website www.stockcalc.com\nFree trial until June 1st \nFeedback apprecaited", "score": 2, "replies": [{"body": "Maybe I did something wrong, but I got a negative on the value for certain symbols. NFLX, for example. ", "score": 1, "replies": [{"body": "This tool uses the most recent free cash flow and if it is negative the calculation will be negative.  You should get a pop up noting there are a couple of instances that will cause this.  Stocks with negative free cash flow need to be analysed using a full DCF or comparables, both available inside Stockcalc.  Another way to use that tool is - What positive free cash flow would the company need to support its current share price and is that reasonable.\n\nThanks for the feedback. Please let me know if any other Q's", "score": 1, "replies": []}, {"body": "I ran NFLX in Stockcalc and saved it in Value ->Discounted Cash Flow.  I also ran it in the comparables.  It does not look like a cheap stock either way.  I can't buy Amazon for the same reason.\n\nIf you want to see how to value a company with a full DCF here is a video I did for Google (this is on www.stockcalc.com at the bottom as well) https://youtu.be/V5194KeW_d0.  This walks you through 3 steps that then let you run a valuation in 2-3 minutes.\n", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I like both of them, but most probably gonna wait till they hit they go down ever more. ", "score": 2, "replies": []}, {"body": "apple is a great buy unless you think they are going to be in decline in the next 5-10 years. Google is a good buy, but need to perform really well to keep up their stock price.", "score": 2, "replies": []}, {"body": "GOOG ruh roh, denied at 700, back under 200ma, feels like a range day but break below 690 could see extended downside.", "score": 2, "replies": [{"body": "Just broke 702, feels good to know I got in for a decent day of trading. Small gains are small gains but I'll take it! ", "score": 1, "replies": []}]}, {"body": "Apple is cheap. They are going to sell alot off phones in india. Apple is cheap. I think in the next few months it will go to 115. More than a 20% return. Not bad. Google is high. Long term i like it. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I agree, I mean obviously I didn't say it would go up in a straight line but yes in general I believe they have had continued success. What do you think the chances are of another split soon?", "score": 1, "replies": []}]}, {"body": "I have google dropping to $438 in future won't invest in any shares market at the moment , FED rising interest rates is game changer , money has no where to go at this enviroment (fear etc...) best thing to do is holding gold or stay in cash to see where this market is heading ... if I am a long term investor I would go with both appl and goog but apple around $60 and goog about $400 ish ... cheers ps not an advice though just imo ", "score": -11, "replies": []}]}
{"title": "Buy AAPL now, hold for iPhone 7 hype?", "selftext": "This is my play, what do you guys think?", "id": "4i1flv", "created_utc": 1462475281.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 12, "comments": [{"body": "The iPhone 7 is gonna be the same damn phone as the 6 was the same as the 5 etc ", "score": 3, "replies": [{"body": "I'd say that the 4 and the 5 had more in common than the 5 and the 6.", "score": 2, "replies": []}, {"body": "Except without a headphone jack", "score": 1, "replies": []}]}, {"body": "I want to wait until it hits 90 or below, though that may not happen.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Ummm  wat?\n\nI don't own any apple products (I did have the iPhone 4), but the phone does change. It didn't seem to change much from 4 to 5, but the other models change. \n\nI feel like they change more than the galaxy lineup. ", "score": 2, "replies": []}]}, {"body": "Yes, I was thinking to do the same. Even though its dropping to 52 week low, may be wwdc 2016 might give it some boost or just look at it as long term investment. ", "score": 1, "replies": [{"body": "Wwdc could be a turning point if the new macbook is released with some good upgrades", "score": 1, "replies": []}]}, {"body": "If you do this (I am with just a few shares) buy a little bit now and just average down as/if it continues to drop.", "score": 1, "replies": []}, {"body": "Why Buy AAPL, the stock is clearly still moving, let the company build a base before you invest thousands of dollars. ", "score": 1, "replies": [{"body": "What exactly do you mean by this?", "score": 3, "replies": []}]}, {"body": "I'd wait to buy AAPL. It's trending down and will likely go lower. If IPhone 7 sales slump, the stock will take a big hit. That's when you want to buy.", "score": 1, "replies": []}, {"body": "apple will only let u down. By next earnings report, it will be at 70.", "score": -1, "replies": []}]}
{"title": "[Advice Request] $TSLA Future", "selftext": "Hey folks, first time poster here and pretty new to stock exchange. With all the Tesla hype on here it got me thinking about possibly investing for the first time. What do you guys think about the future of Tesla and investing in the company? Thanks in advance.\n\nEdit -  Probably messed up the title. Sorry! ", "id": "4i1ir7", "created_utc": 1462476407.0, "score": 6, "upvote_ratio": 0.81, "num_comments": 14, "comments": [{"body": "Even though I think they're going to be a great company, I still they they are overvalued at the moment", "score": 4, "replies": [{"body": "Do you think their price is going to drop by a large margin before 2018 to make it worth it?", "score": 3, "replies": [{"body": "I posted my two cents, but the bottom line is compared to other investments, it's terrible.  \n\nIt's like seeing a car you like on the road, but when you get the road and track review it's in last place.  It's great that it caught your eye, but you can't ignore everything else because of that.  ", "score": 4, "replies": [{"body": "Really helpful! You really opened my eyes on 'why' I wanted to invest. Rather than making money on return, I liked the idea of the company more. Thank you!\n", "score": 2, "replies": []}]}, {"body": "I agree with what everyone has said. Tesla is a fantastic company, but a terrible stock. ", "score": 3, "replies": []}]}]}, {"body": "I think it's great that it got you into thinking of investing. There's a great wiki on the side, I think you should invest (in your future). Maybe choose index funds or less volatile stocks (Dis, MO, JNJ, KO, V etc.). Personally, I have a mix.\n\nTesla (like Netflix, GoPro) is a very hype stock. Unfortunately because it's been bid up it's price now overvalues the company. It often bounces between 180-240 but even at 180 it's over valued which makes investing in it \"high risk\" and almost gambling. I may jump in if it breaks below 200, but that's more because I like the company and what they're trying to do and want to be a part of it and less about investing/making money. \n\nGood luck!\n\n", "score": 3, "replies": [{"body": "I'll have to look into these index funds. They have been thrown around quite a bit! ", "score": 1, "replies": []}]}, {"body": "I think $TLSA is an awful investment for a first time investor.  I advise lazy investors to index funds and mutual funds.  If you are interested in being not so lazy I would advise you pick stocks that offer decent dividends to start.  Growth stocks are terrible for people new to investing.\n\nUsually you use the skills you acquire from other investments to speculate on growth stocks, not the other way around.  Also don't forget the bond market.  \n\nTo evaluate it as a stand alone I don't disagree w/ The Street, so I will just copy and paste their two cents:\n\nWe rate TESLA MOTORS INC (TSLA) a SELL. This is driven by multiple weaknesses, which we believe should\nhave a greater impact than any strengths, and could make it more difficult for investors to achieve positive\nresults compared to most of the stocks we cover. The company's weaknesses can be seen in multiple areas,\nsuch as its deteriorating net income, generally high debt management risk, disappointing return on equity,\npoor profit margins and feeble growth in its earnings per share.\n\n\n", "score": 4, "replies": [{"body": "Thanks a lot! I want to start getting into this and I agree, this is not a place to start. So much to learn!", "score": 2, "replies": []}]}, {"body": "Stay away from TSLA.  Too many execution risk.  Their balance sheet is a mess", "score": 2, "replies": []}, {"body": "Just buy an index fund.  Save yourself the headache.", "score": 1, "replies": []}, {"body": "I am seeing good advice here for beginner investors. I like Vanguard ETFs but hey if you really like what Tesla are doing and you think its a good entry point go ahead and buy yourself a share or two.", "score": 1, "replies": []}, {"body": "$TSLA is quite a volatile stock. If you are looking for a short term investment, I would suggest stay off it. But investing for a long term, will offer fruitful results. Electric vehicles is more than just a trend. By 2020, the status of electric vehicles sold is expected multiply in great numbers, a boost for an already booming electric vehicle industry, and Tesla dominates this market. Irrespective of the metric you inclined at, what stands out prominent is Tesla’s position at the top in the electric vehicle market. \nSo coming back to your question, investing in Tesla is a good idea. Check the company’s performance [here](http://alph.st/b9a593b2)  \n", "score": 1, "replies": []}, {"body": "Here are two facts: \n* The real value of the company, if you analyze the stock from the fundamental side, are far less than the current market valuation. Even if Tesla achieves all its goals by 2020 - it still worth less than $250.\n* Seems like the market does not care about fair value. (Amazon is a good example)", "score": 0, "replies": []}]}
{"title": "Brokerage accidentally gave me portfolio margin. What should I YOLO?", "selftext": "[removed]", "id": "4hyp4l", "created_utc": 1462428682.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 9, "comments": [{"body": "[deleted]", "score": 25, "replies": [{"body": "But will he listen? The autism level on here is pretty damn high sometimes... ", "score": 6, "replies": []}, {"body": "https://youtu.be/Jpropo0WGn0?t=18s", "score": 1, "replies": []}, {"body": "Glad to see some sense here. I was only kidding with the spy puts, but I would sure as hell do that if I had PM. That PDF tingled my yolo balls real hard. Hope Incendiary does indeed get rid of it!", "score": 1, "replies": []}]}, {"body": "Damn dude, that's awesome. Take this as a blessing and yolo some SPX/SPY. Wait for the next rally in SPY, then buy a metric fuckton of spy put spreads.", "score": 1, "replies": []}, {"body": "DUST", "score": 1, "replies": []}, {"body": "spx calls", "score": 1, "replies": []}, {"body": "125k in SPY puts.", "score": 1, "replies": []}, {"body": "What broker? I'm about to make a paper trade account on it ", "score": 1, "replies": []}, {"body": "125k on SPY calls with a 2 month expiry, thank me later bitch ", "score": 1, "replies": []}]}
{"title": "$BBY", "selftext": "[deleted]", "id": "4i14q2", "created_utc": 1462471459.0, "score": 4, "upvote_ratio": 0.84, "num_comments": 10, "comments": [{"body": "Absolutely stellar research.  \"I don't like company, short it.\"  Last time I got puts on $BBY right before earnings I had a green candle shoved up my ass after hours.\n\nI agree with the Best Browse sentiment though.  I only shop there when I see a deal.  CC has been at $0.00 for two years now.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "radio shacks best margins were on small parts and batteries. they had experts in knowledge, but did not have a good way to sell those experts. i used to work there. they completly fucked over employees when they changed the commission structure 6-8 years ago. made the best salespeople leave, forced them to focus on small deals instead of large ones. also they tried to expand into tvs and pcs when they didnt have the floor space for them. plus who buys a tv at a mall radioshack.\n\ncircuit city never properly supported their infrastructure with experts. they had the best appliance system that they removed at some point for no reason. they wanted to bulk up pc and camera and other new tech sections n needed floor space. unfortunately they didnt realize how big appliances were. they were 2nd only to sears, and although customers would get 1 fridge and be set for a decade, they would come back for repairs and their new one. that really hurt them badly.\n\nbest buy is more well rounded. they do have geek squad so they can capitalize on installations. they have a relationship with customers. my parents have a complex tv system, they cant replace the receiver. the receiver is built into a wall rack and has to be pulled out of the wall to do the wires. the company that sold it is long gone. best buy is capable of servicing things like this now, so they get all the business from the small electronic home theater stores that went belly up.\n\ni would imagine at some point bby is going to have to change the structure of their dvds/games. that shit is becoming digital pretty fast.\n\nthey have alot of products sitting around, but im pretty sure they get to sell stuff back. its not like they take hits on having this inventory.\n\nalso if hardware is becoming more standardized they can push their products more for better margins. not sure if they do this, but they probably have an in house brand with a different name for cables and tvs and whatever. i think dynex and insignia are some.\n\ni dont see them growing either, but they wont go away. who else is there? they are very seasonal as well.\n\njust playing devils advocate and telling you the differences.", "score": 3, "replies": []}]}, {"body": "Step 1: do opposite of what WSB shitpost says.\n\nStep 2: long BBY.\n\nStep 3: yacht?", "score": 1, "replies": []}]}, {"body": "i bought \"throwaway\" headphones there a few weeks ago.  to the moooooooo....", "score": 2, "replies": []}, {"body": "I haven't bought anything from best buy in ages. Anything worth buying there you can get something of higher quality and lower price online; At least on the pc hardware and peripheral side. I would have to think as people become more tech savvy it will only get worse.\n\nUnless their vacuum and refrigerator department really is a deal. Not like I'm going to buy one of those every month though.\n", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You can price match to amazon.", "score": 1, "replies": []}]}, {"body": "Thanks for contributing this unique viewpoint ", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Every night I do and use my lonely tears as lube.  Thanks again! ", "score": 2, "replies": []}]}]}]}, {"body": "I've spent more at Best Buy in the last year than I have ever.  Magnolia is nice and it's the only store you can buy computer accessories immediately.\n\nI'm also over 40.", "score": 1, "replies": []}, {"body": "fuck it bet the farm", "score": 0, "replies": []}]}
{"title": "Poor jobs report will pump of vix friday", "selftext": "Playing UVXY market in downtrend", "id": "4i264f", "created_utc": 1462485091.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 11, "comments": [{"body": "YO same bro\n\nAre we also using the same crystal ball?\n\n", "score": 3, "replies": [{"body": "I told you niggas to stop using that bowling ball.", "score": 2, "replies": []}]}, {"body": "Idiots, poor jobs means less chance of rate hike will send spy rallying along with gold", "score": 2, "replies": [{"body": "Sadly there is a lot of truth to this.", "score": 3, "replies": []}, {"body": "If poor jobs make it rally, better jobs make it rally, wtf does the opposite. Lol. Crazy", "score": 1, "replies": [{"body": "Nothing apparently", "score": 1, "replies": []}]}]}, {"body": "Bought tvix in the last 5 min today. Hope market tanks tomorrow", "score": 1, "replies": [{"body": "> Hope market tanks tomorrow\n\nhahahahahahahahaha oh my sides, GFY", "score": 3, "replies": []}]}, {"body": "so spy to 210", "score": 1, "replies": []}, {"body": "Bloomberg radio seems to think that the report will be better than expected.", "score": 1, "replies": []}, {"body": "But you fucked up on $FIT earning Bro!", "score": 1, "replies": []}]}
