{"title": "Change to IV for Deep OTM Puts", "selftext": "Long time lurker, first time poster.\n\nWith the whole sell in May and go away adage coming in the news I was looking at purchasing some deep OTM Put options for the summer months.\n\nI'm talking deep, like 1500 on S&P 500. However, I was looking at IV and trying to plot out potential outcomes and the current IV for 2 month out contracts caught my eye and I was wondering what happens to IV if the S&P took a dive like last August.\n\nAs I see it now, a 2 month SPX Put option has ~40% IV. Lets say the market dropped 15% over the next 10 days, what would the corresponding IV look like? Would it increase or would it drop since we would be getting closer to the money?\n\nWhat happened to the IV for deep OTM put options during the financial crisis? Did it go higher than 80% like VIX shows since they started much higher than ATM options?\nAlso, could anyone point me to any documents or websites that could help with my understanding? Everything seems to be focused on ATM options.\n\nThank you for your help!", "id": "4jx8jb", "created_utc": 1463585575.0, "score": 6, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Seems like a really low probability trade to me.  The IV is probably high b/c it is so far OTM and still worth like 20 cents.\n\nThe SP would have to drop a bunch to make a decent profit.  Delta is .003 so it'll move .3 cents for every dollar of SP move.  ", "score": 3, "replies": [{"body": "Right, but that's the point.  To profit off a huge drop.  And as the market drops doesn't Delta increase making the rate of change go up?  ", "score": 1, "replies": [{"body": "There's better ways to profit off a huge drop. You're unlikely to win to those realizing, but if the market comes in there will be demand for those as traders need to cover those for margin reasons as they start showing up on risk slides.  \nIf you do this, the ideal play would be to sell if the market drops 10% or so", "score": 3, "replies": []}]}]}, {"body": "Honestly, I'd be more likely to take the other side of that bet. It's low low probability. Welcome to Vegas! ", "score": 2, "replies": []}, {"body": "Deep OTM SPY puts are usually a bad bet. They have high IV, wide bid/ask and S&P generally goes up not down.\n\nYou can use ThinkorSwims Thinkback to see what happens to deep OTM puts during a 15% pull back (200%-400% returns from memory)\n", "score": 2, "replies": [{"body": "Oh nice, I knew they had the think back feature but I thought it was limited to equities.  I haven't used ToS for a long long time, looks like I need to open a new account!", "score": 1, "replies": []}]}, {"body": "It is not a trade I'd make, but as long as you realizing you're buying a lottery ticket, it's fine.  Those options are bid for a couple of reason.  Sometimes market making or professional firms have stricter margin requirements and they buy the mar OTM puts to reduce the capital required to hold their positions.  They fully expect those options to expire worthless.  Others buy them to protect or speculate on black swan events.\n\nAs I said, just realize there is a very low probability these puts will come into play.  They won't move at all in price unles there is a huge down move.", "score": 1, "replies": []}, {"body": "IV generally increases faster to the downside than to the upside for equity. The relationship is the inverse for commodities.\n\nHow the IV will look like, I don't know. It's up to the market to figure that out. It's a small chance of SPX to drop 15% within 10 days so VIX would probably shoot to the sky. Lucky me who's long call spreads in vxx :)", "score": 1, "replies": []}, {"body": "This summary has been pulled from: http://theoptionprophet.com/blog/how-to-protect-your-portfolio-with-options please go there to read the full article.\n\nHave you ever noticed those deep out of the money put options at the bottom of an option chain? Those are known as 'units'. They are the cheap puts that just sit around not doing anything until something bad happens. When that happens these little puts come to life surging in value 400%, 500%, 1000%, etc...\n\nWhen looking for units you want to start at options with deltas between 2 and 5. This means for an average priced stock the option will be worth $0.25. These are the options that are built for insurance. They will sit around at approximately the same value until it comes time to explode in price. If your stock or the market doesn't drop they will simply fade away from your portfolio.\n\nBefore you rush off and put these options in a simulator we need to talk about option models. Option models, like Black-Scholes, are horrible at measuring the extremes. They are really great for at the money, slightly in the money, and slightly out of the money options. The further you get away from this mean the less reliable they become. So the models for these options are useless. They have a very difficult time trying to predict and track the movement and output the Greeks.\n\nIf you are moving in and out of a lot of positions then you could go 3-6 months out for your insurance trade.\n\nLet's look at an example using the S&P 500 for insurance. If you were running a heavy short option portfolio in 2015 you could renew your insurance every 6 months. In June, while the S&P 500 was trading at 2111, you bought the December 19, 2015 1400 strike puts for $4.00. Those puts had a delta of 2.57 and were 33.6% out of the money.\n\nOn August 25, 2015 when the S&P 500 dropped 12% those puts were now worth $18.00, a 350% increase in price. That is the power of units.", "score": 1, "replies": [{"body": "Thank you for this explanation.  I will go read the article now.\n\nSo trying to pin point an IV level to put into a Black-Scholes is a fools errand based on the extremes, correct?  Is there anyway I can look at examples of August and see what the IV for that 1400 put was at purchase and then at low of the crash?  ", "score": 1, "replies": [{"body": "Send me an email through the site and I will send you some option data for that period.", "score": 1, "replies": []}]}]}]}
{"title": "What do you do when there's a huge stock shift past the breakeven point on your iron condor?", "selftext": "I bought 2 short-term iron condors where the stock dropped significantly below my lowest put price very quickly (TGT 69/71/79/81 and NUGT 98/100/136/138). How do you handle this... is there any way to recover or do you just take the max loss when it expires?", "id": "4jz2oa", "created_utc": 1463607084.0, "score": 7, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "There isnt much you can do other than hope the trade turns around.  You could try rolling down the untested spread but I doubt you can collect anything for that if there is no time left.", "score": 3, "replies": []}, {"body": "You did iron corridor through earnings? Much wow", "score": 2, "replies": [{"body": "I was wondering if anyone would catch that. I won't make that mistake again.", "score": 1, "replies": [{"body": "i checked the surprise and gap history. your not too retarded. thats double the biggest move they had off ER in years.\n\nstill. ive been burned plenty of ERs. either we learn eventually or we dont : )", "score": 1, "replies": []}, {"body": "So I'm switching from OH to TOS. In OH they made it very obvious when trading iron condors and spreads \n\n1) If earnings is coming up and \n\n2) if there was a dividend payment coming up before expiry. \n\nDoes TOS have something similar to this?", "score": 1, "replies": []}]}]}, {"body": "If you have enough buying power you can close out the short leg of the tested spread and try to recoup some from the long leg as it gets further ITM. But if the price action turns around too quickly that would compound your losses. Honestly I would just close out the tested spread immediately to stop the bleeding, regroup, reflect, and try again later.", "score": 1, "replies": [{"body": "I don't seem to have enough buying power to close out any of it, either one leg or both, which confuses me because I thought it was required that you have enough margin to close your position.\n\n> If you have enough buying power you can close out the short leg of the tested spread and try to recoup some from the long leg as it gets further ITM.\n\nI'm not sure I understand. So let's look at TGT as an example. It closed at 68 today so the tested spread is the 69/71 put spread, right? I bought 69 and sold 71. So you're saying close out 71 so I don't lose more if TGT keeps going down, and keep the 69 put so I make more if TGT keeps going down?\n\n> Honestly I would just close out the tested spread immediately to stop the bleeding, regroup, reflect, and try again later.\n\nI'm not sure I understand why closing out the 69/71 put spread would \"stop the bleeding\" - I'm already at the maximum loss. The spread can't get any worse and might get better - what is the point of closing it out (even if I had the money to, which I don't seem to)?", "score": 1, "replies": []}]}, {"body": "Depends on how long until expiration.   The point is you got into a define risk trade so either:\n\n1.  Accept what happens and allow time to fix it (or not)\n2.  If the tested side doesn't move back or keeps going into the red, you can move the untested side down closer to collect more credit.\n\nBut never, ever close the untested side (buy it back).  The cost you pay, no matter how little will just hurt your cost basis.  Many people make the mistake of closing the untested side because they see it's cheap to buy back but there is little to no risk there.   In addition, if the stock happens to keep going down then keep moving the call side down with it and keep collecting more credit trying to get a scratch out of it.   Try not to go inverted (meaning, you move your calls down past your puts), which could kill you 2x if the stock reverses.", "score": 1, "replies": [{"body": "Never ever?  If the short let is .05, I buy it back every time.  I'm not the greatest condor trader ever, maybe you are, but I buy back any short option for .05.  You still have risk, but only stand to make 5.00 more dollars.  I let the long side expire as a lottery ticket.", "score": 2, "replies": [{"body": "Never.  You just paid $5 and impacted your cost basis for which you are already in the red (OP situation).  The long side (if short leg is bought for $0.05) just is a lotto ticket?  Doesn't seem like it's worth it because you just paid for it by buying back the short leg.   It's a shot in the dark.   \n\nIdeally, you want the untested side to become tested.. if the stock moves away then back... time value is captured while all this happens and its better for you.  \n\nManaging IC that has gone bad is a tough situation.  It's a gut call at the end but I prefer to just move my untested side down and keep collecting credits.  I'm playing for a scratch at that point but never want to lose money so I'll keep moving it down and rolling forward until I get to the break-event credit received that a max loss is no longer a worry.", "score": 2, "replies": [{"body": "I want the untested side to be tested after I bought back the short leg for .05.  You mention time decay could be working in my favor.  There's only 5.00 left to decay.  They can have it.\n\nYou also mention that you move the untested side down.  How do you do that without closing the original untested spread, which you never do? (i know, I'm a smart ass) In my view, moving a spread around has a larger impact on the trade than giving back 5.00 and having no risk.  Personally, I don't adjust, other than to close.\n\nI'm not saying you're wrong, or I'm right.  I just handle things differently.", "score": 2, "replies": [{"body": "Agreed, just diff philosophies and trust me I've been bitten by moving around the legs but fortunate most of the time. \n\nNice jab on the closing :/. You know what I mean, I don't close and leave it. I only close with intention to move it to get more credit. \n\nI'm not saying I'm right either. It's a gut check at times. I just don't like to go down without a fight, even on risk defined trades. ", "score": 3, "replies": []}]}]}, {"body": "I do yes. It's a 4 leg order which is accepted as one. ", "score": 1, "replies": []}]}, {"body": "So for instance with TGT, which is now at 68, I would keep the now worthless 79/81 call spread, and get another call spread at something like sell 73/buy 75? Right now all calls above 71 cost only a couple cents so it seems like there's not enough time left to benefit from that.", "score": 1, "replies": [{"body": "Not keep the worthless, you can roll the worthless (untested) side down.  Which is essentially the same as buying the worthless spread and writing a new spread.   Personally, all retail is so fucked right now that I'd be confident to roll down the call spread aggressively and collecting more credit.  Eventually it may look like an Iron Fly (same strike for short legs) and just hope for a scratch.\n\nI've spent weeks sometimes aggressively protecting failed ICs and its just not worth it.  I roll one time, collect the extra credit.  Then accept the loss, which is now a lot less because you rolled down the untested side.\n\nI then move onto another trade.  Too much worrying about a risk-defined trade is not worth your time (or stress).", "score": 2, "replies": [{"body": "When you roll it down, do you buy the old spread and write the new one in the same order? Is additional margin required?\n\nUnfortunately in this situation there's no profit to be made from rolling down the call spread, as far as I can tell, because the expiration date is in 2 days.", "score": 1, "replies": []}]}]}]}]}
{"title": "Goldman Sachs just downgraded stocks all over the world", "selftext": "", "id": "4jx6n3", "created_utc": 1463584958.0, "score": 44, "upvote_ratio": 0.94, "num_comments": 16, "comments": [{"body": "These guys paint the fucking bottom and top on everything.  They sold oil at 28, they sold gold at 1050.  They sold Volatility at 12. \n\nThis is probably the second most bullish thing you could ever see.  The first would be if they wheel Gartman out and he says to sell everything.", "score": 3, "replies": []}, {"body": "Are they still short gold? http://www.cnbc.com/2016/02/16/goldman-sachs-short-gold-on-market-overreaction.html\n\nWhat are you supposed to invest in then? I guess they just want you to keep your money in their newly opened bank accounts to play with... ", "score": 4, "replies": [{"body": "muni bonds if you pay decent amount of taxes. ", "score": 1, "replies": [{"body": "Tell me more about these ", "score": 1, "replies": []}]}, {"body": "Yeah because equities, cash, and gold are the only assets out there, right?", "score": 0, "replies": [{"body": "Real estate. Some people purchase art and wine as investments. But yea. Not sure what Goldman is trying to do here ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "But to get access to a lot of those, it's basically stocks and ETFs for the average investor. Good point though that there is more than just buying your typical stock or relying on it for income. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Mutual funds in general are just not worth it for the average investor. You can accomplish the same goals with ETFs without paying those (relatively) high internal mutual fund fees. ", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yea, but average investors shouldn't really be getting into niche shit. ", "score": 1, "replies": []}]}]}]}, {"body": "Debt, i.e. Fixed income is the biggest market on earth and there are plenty of ETFs out there tracking the indices.", "score": 1, "replies": []}]}]}, {"body": "Non-perishable canned goods and semi-automatic firearms w/ an ample stockpile of ammunition. ", "score": 1, "replies": []}]}]}]}, {"body": "Downgrading= Sell rating=negative influence, thus they can buy cheaper. Or they are short and try to get some gains.", "score": 7, "replies": [{"body": "But that would be a material conflict of interest where their analysts are controlled by asset managers. No major bank has ever allowed a material conflict of interest like that to happen.", "score": 1, "replies": [{"body": "watch the big short. Its the easiest way to understand.", "score": 1, "replies": [{"body": "Well. There's been a massive compliance infrastructure build up since the crash. I was mostly being sarcastic though.", "score": 1, "replies": [{"body": "I figured that much, but you can never know..", "score": 1, "replies": []}]}]}]}]}]}
{"title": "[Advice Request] Picking a stock for a young investor", "selftext": "Hello, /r/stocks.\n\nMy son had his 11th birthday on Monday. He received a stockpile gift card for $50. He also received another $50 cash, and he's excited enough about owning stock to want to add this to his funds. I have learned that stockpile allows you do to fractional shares. He's expressed an interest in Tesla. \n\nGiven his (very) small capital, what stock would you pick for him? Does anyone have experience with stockpile.com?", "id": "4jx00b", "created_utc": 1463582740.0, "score": 9, "upvote_ratio": 0.71, "num_comments": 12, "comments": [{"body": "I would let him pick the stock of a company he likes. DIS, NKE, something that interests him.", "score": 15, "replies": [{"body": "This. One year at Christmas, my aunt gave my sister, cousins and I each shares of GOOG and then a fixed amount of another company we could choose ourselves. I picked DIS, and it was a great introduction to watching/learning how the market works!", "score": 1, "replies": []}]}, {"body": "Stockpile lets you buy fractional shares, so don't rule out a high dollar stock. I think the important thing to do is to keep him interested and engaged. Ask him some basic questions about why he likes Tesla and then let him purchase it.", "score": 3, "replies": [{"body": "This. The point is to let him make a financial decision and live with the consequences of his actions.", "score": 2, "replies": []}]}, {"body": "I would say DIS.", "score": 2, "replies": []}, {"body": "He can get a lot of F stock vs 1 or a fractional of a more expensive stock. F he gets a decent div too. Maybe ask him what company (or types of products) he thinks will grow and let him do the picking. If he likes video games maybe one of those companies? ", "score": 3, "replies": []}, {"body": "For that amount of money, don't worry too much about picking a 'good' stock,  let him choose what he likes. If it fails the lesson might be worth more then what a good stock could earn him.", "score": 1, "replies": []}, {"body": "Let the kid decide! I wouldn't make decisions for him, but I would teach him about several good companies that might interest him and let him choose.", "score": 1, "replies": []}, {"body": "lol don't let him get TSLA.. he won't even get 1 share.\n\nMy opinion is buy stock in AMD", "score": 2, "replies": []}, {"body": "I know this sounds bad, and every time I see a post like this with new young investors I always refrain from saying this... but the market doesn't look like it's in a good place for buying at the moment. All the major indexes failed to form a higher high in May and haven't been able to since 2015, putting us in a bear market. World economies are slowing down as well. I'm looking for shorting opportunities and I think anything that your son buys right now will depreciate once the real selling begins.\n\n", "score": -4, "replies": [{"body": "It's a $50 gift card that can only be used on stock and it's for a kid. Just let him pick something he likes and roll with it. He'll get a lesson whether or not the market crashes. ", "score": 1, "replies": [{"body": "okay, buy Ford", "score": -1, "replies": []}]}]}]}
{"title": "Any good/cheap Chinese stocks to buy right now?", "selftext": "Heard the Chinese stock market is in a recession. Looking to get in on some cheap stocks to forget about. Any good suggestions ?", "id": "4jyhk3", "created_utc": 1463600081.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 9, "comments": [{"body": "i avoid chinese stocks to be honest. Their financial reporting methods are notoriously manipulated. ", "score": 6, "replies": []}, {"body": "AAPL", "score": 3, "replies": []}, {"body": "FXI tracks the 50 biggest Chinese stocks on the Hong Kong stock exchange. ", "score": 2, "replies": [{"body": "And in the same vein VWO, vanguard's emerging market etf, is pretty heavy on china. I like that option because it removes some of the craziness that can come with investing in china. ", "score": 2, "replies": []}]}, {"body": "Yea...Id avoid investing in a communist dictatorship. ", "score": 1, "replies": [{"body": "\"Communist\" is such a strong word.\n\nThe way the Chinese run their nation often contradicts communism. \n\" the absence of social classes, money, and the state\"\n\nA party dictatorship no doubt.", "score": 1, "replies": []}]}, {"body": "If you want just go with an ETF. I'd avoid China personally. ", "score": 1, "replies": []}, {"body": "Thanks i know now to avoid the chinese\n", "score": 1, "replies": []}, {"body": "I invested heavily in BYDDF (BYD Cars), they do mid to high end electric cars, warren buffet also invested in them, they have a partnership with uber, they also make electric batteries and electric buses. I also invested a little in Kandi cars (KNDI) but they are the cheaper end electric ride sharing cars, cheap rentals, i have less faith in them than byd. Here is a good short documentary on Kandi cars, revolutionary idea: https://www.youtube.com/watch?v=fiEJPbxL2hI \n\nWho knows what is going on in China's economy or if electric will take off, but It should because of all the pollution in china. \n\n", "score": 1, "replies": []}]}
{"title": "Target (TGT) Down 8% Today", "selftext": "Target down 8% today after earnings report. Thoughts? ", "id": "4jyzu8", "created_utc": 1463606126.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 9, "comments": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Cool. I'm gonna invest all my money in Uruguay river and Paraguay River. ", "score": 2, "replies": []}]}, {"body": "Shorted yesterday at $74.35. Got out at $67.08 today. I admire the company, but Amazon.com seems to be throttling all retail except for Home Depot, Lowes, Costco and Ulta. ", "score": 2, "replies": []}, {"body": "Paper trading bought at $66.35, will probably exit at $70-72 as I think it gets there on a bounce. I actually like Target quite a lot as a customer and think Cartwheel's terrific. However, in terms of my actual investments, it's not on the shopping list.", "score": 2, "replies": []}, {"body": "Shitty retail earnings = no interest rate hike. The feds would be crazy to raise rates. These earnings are a flashing red light warning for the economy.", "score": 2, "replies": []}, {"body": "Target shit the bed.", "score": 2, "replies": []}, {"body": "Will it be a good time to buy now?", "score": 1, "replies": []}, {"body": "Happy I have Walmart. Up 9% today!", "score": 1, "replies": []}, {"body": "What about you, OP? Did you have any thoughts about the dip? It's usually more productive to have a discussion after sharing your insights.\n\nI haven't looked at the earnings report but if it went down 8% with mediocre to decent earnings, the market could have overreacted with the recent beatdowns that the retail industries have received overall in mind. If it actually had bad earnings, then that's why it went down, of course.", "score": 1, "replies": [{"body": "> What about you, OP? Did you have any thoughts about the dip? It's usually more productive to have a discussion after sharing your insights.\n\nYeah, that doesn't happen on here. \"What should I do?\" \"What do you think of?\" etc etc etc...the OP rarely ever actually offers any thoughts of their own.", "score": 2, "replies": []}]}]}
{"title": "Where do we see $NVDA going?", "selftext": "I know they just announced their new chip, and with recent advancements in VR tech, the stock has been going up. What would your move be?\n\nSorry if I don't follow the format. This is my first time posting here.", "id": "4jz2f7", "created_utc": 1463607001.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 14, "comments": [{"body": "Yea sure the stock has been going up but not necessarily because of the VR tech - it's too early for that to be factored into the bulk of the company's revenue. Once it becomes more popular and widespread, sure.\n\nNvidia just had a very strong sales run with its 900 family chips, found in every major gaming computers, with lesser ones in more portable laptops as well. I see the company rising more and more (as it always have been) with the increasing reliance on graphics and the capability to pretty much recreate the real life.\n\nAMD is still barely afloat, Intel is not going beyond its barely-capable integrated solutions, Qualcomm is staying with the mobile devices. Financials also look very strong, with decreasing long term debt and increasing cash.\n\nFor foreseeable future, Nvidia has a strong future, I think. I'm waiting for a price dip before going in, if it happens any time soon.", "score": 8, "replies": [{"body": "I started buying NVDA in December mainly because they are the leader in GPU technology and will continue to the leader in GPU technology. My stance has always been buy and hold long term with NVDA, accumulate on dips. Barring major production issues NVDA should continue to lead the market I wouldn't mind if NVDA stopped paying dividends though and focused on growth opportunities. Their console and tablet were interesting products and it would have been nice if they used the dividend to push those out more. ", "score": 3, "replies": [{"body": "I bought it in around 2011 when it was around 13.90, and I have no clue as to what I should do with it all.", "score": 1, "replies": [{"body": "Hold, reinvest the dividends.  NVDA may not be \"going to the moon\" but it's strong and will definitely go higher long term.", "score": 4, "replies": []}, {"body": "Just hold onto it until you retire I guess. If it's in a DRIP plan even better. It's up like 100% from this time last year and fared though the 2013 correction pretty well. ", "score": 1, "replies": []}]}]}, {"body": "Thank you very much.", "score": 1, "replies": []}, {"body": "How is AMD still barely afloat? Their stock price has almost doubled since ive purchased shares", "score": 1, "replies": []}]}, {"body": "Bought at $24 last year and now its around $43 only regret is i should have bought more!! ", "score": 1, "replies": []}, {"body": "I wont buy NVDA over 40..", "score": 0, "replies": [{"body": "I got in around $37. One of the better investing decisions I've made.", "score": 2, "replies": []}, {"body": "What's your reasoning behind that?", "score": 1, "replies": [{"body": "PE and relatively slow growth suggest it is overvalued.\n\nhttp://www.nasdaq.com/symbol/nvda/revenue-eps\n\nNVDA revenue barely moves. I dont believe this growth can sustain the stock price at this level.", "score": 0, "replies": [{"body": "You seem to miss the point which was that the diversification of their revenues as proved in this last ER demonstrated that they are on the brink of a sales pipeline that's about to grow exponentially. VR/Auto/Datacenter came in higher than expected and I think you'll see those 3 categories catch up if not surpass the standard desktop/laptop gpu segment. \n\nI personally think NVDA will hit 80 billion before 2019 and will have the revenue growth to support it. ", "score": 2, "replies": []}]}]}]}, {"body": "People are going to start cashing out soon. Then I'm buying back in. This company is just too good.", "score": 0, "replies": []}]}
{"title": "$TGT Earnings: Transgender toilet trials and tribulations", "selftext": "With Target's earnings before the open where are you positioned?\n\n10 05/20/16 69.5 PUT\n\n-10 05/20/16 76.5 CALL\n\n10 05/20/16 78.5 CALL\n\nFor a $110 debit", "id": "4jv40r", "created_utc": 1463548299.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 15, "comments": [{"body": "i want target to go down hard. i'm tired of those fucking assholes asking me to sign up for target credit cards and whatever other bull shit they have.  The last time I went they even had someone standing at the front of the door, they don't even give you time to get to the register before they start trying to push their product.  they also had two registers open in the entire store on saturday evening\n\nfuck you Target, I hope your sales tank", "score": 2, "replies": [{"body": "I used to work there and they would make us ask people at the registers. I have self-respect and dignity so they would have to talk to me every week about my poor performance. Like I was hired as a cashier, not a fucking salesman.", "score": 3, "replies": []}]}, {"body": "No bets placed. It will probably break even on earnings", "score": 1, "replies": []}, {"body": "What are you hoping for with this spread? Ideal targets? Legit asking because I don't understand multilevel spreads much.\n\nOver 79.6 ur good or under 68.4?", "score": 1, "replies": [{"body": "< 69.39 profitable, > 76.5 losses beyond the initial debit, >= 78.5 worst case scenario losses.\n\nI want it to go down as far as it can.", "score": 1, "replies": []}]}, {"body": "3 5/20 73 Put\n\n2 5/20 70.5 Put\n\n3 5/20 74.5 Call\n\nThis is looking like a *real* nice morning\n", "score": 1, "replies": [{"body": "How much premium did you pay? You're right though, some nice numbers for me pre-market.", "score": 2, "replies": [{"body": "I bought them at different times during the week. \n\n1.01 for the 73 puts\n\n.94 for the 70.5 puts\n\n1.01 for the 74.5 calls\n\nTotal cost: $794\n\n", "score": 2, "replies": [{"body": "Ah, good luck us.", "score": 3, "replies": [{"body": "$67.66 right now.  Way to go.  Go get yourself a BJ... you earned it!", "score": 2, "replies": [{"body": "Now to wait or sell... 66.74 currently.", "score": 3, "replies": [{"body": "I just let my AAPL faggots delight run past 150% and instead of selling I wrote some higher strikes... while everything was sold for a gain, I took in a lot less so ask yourself \"would I hate myself if these gains were less when i closed?\"  If yes, bail now.  If not, close it up slowly and lock at least a portion of it.  Just my $0.02... you gotta ask yourself bruh.", "score": 2, "replies": [{"body": "I met the decision half way, sold 5 of the puts. Of course I already bought back the calls, heh.", "score": 3, "replies": [{"body": "I'm still sitting on the 70.5 puts. I sold the 73 puts for 6.10", "score": 1, "replies": [{"body": "Those 5 sold for 3.08.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}
{"title": "Who else is going hold through this mini crash?", "selftext": "Yellen just had to open her stupid wore mouth and now my portfolio is red af', who else is going to hold through this shit storm?", "id": "4jyb5g", "created_utc": 1463598024.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 19, "comments": [{"body": "sp500 dropped 10 points and is still up compared to yesterday shut the fuck up about your mini crash you pussy faggot", "score": 15, "replies": []}, {"body": "Holding DUST wooooooo", "score": 5, "replies": [{"body": "Too the Mooooon!", "score": 1, "replies": []}]}, {"body": "gfy", "score": 3, "replies": []}, {"body": "Mini crash? S&P is only down 5. I'm green. ", "score": 3, "replies": []}, {"body": "mini crash? lol.", "score": 2, "replies": []}, {"body": "it only went down a little bit during the selloff buy puts on shit thats going down so you green instead of red", "score": 2, "replies": []}, {"body": "All green here ", "score": 1, "replies": [{"body": "What are you in", "score": 1, "replies": [{"body": "Biggest positions are nflx,  labu (lol), bbby puts (got a lot of these), vxx, mu, and uso", "score": 1, "replies": [{"body": "You think it's better to get comfy in USO rather then swing UWTI I mean why not if your gonna hold the equivalent 3X in biotech? Also why Micron ", "score": 1, "replies": [{"body": "I stopped buying equities. Labu is a legacy position and nflx is part of a covered call. \n\nUSO position is calls that are +50 & +90%.  Stopped fucking with leveraged equities after being burned too many times. \n\nMu has 3d X point ram joint venture with Intel coming online.  Expecting to hear about (pre) orders during q3 or q4. My Calls don't expire until q4. ", "score": 1, "replies": [{"body": "Legacy position? ", "score": 1, "replies": [{"body": "Part of my old strategy and trading style I can't stomach realizing the loss on. The loss isn't real until I exit the position 😎", "score": 1, "replies": [{"body": "Dat tax strategy", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Mini crash my ass. Made money on every position, and none are short. \n\nAAPL calls = huge gains (realized) \n\nNOC = micro gains \n\nNVDA = Solid gains \n\nRLYP calls = Somehow are up despite the stock dropping, IV must be up. \n\nTREE = Jumped 3% after I bought it today. ", "score": 1, "replies": []}, {"body": "All the fed interest rate shit got me iffy on my stocks, sell in may and go away? Hold in may and be ok? Buy in may and go for the moon? Guide me faggots", "score": 0, "replies": [{"body": "eat my dick in may", "score": 1, "replies": []}]}]}
{"title": "Tech Earnings: Who's playing?", "selftext": "Looking at CRM 74 strike calls.  I'm honestly thinking of sitting out Cisco, that one can break in either direction.  But if I had to guess, I'd say it's going up", "id": "4jyf7l", "created_utc": 1463599343.0, "score": 5, "upvote_ratio": 0.85, "num_comments": 10, "comments": [{"body": "waiting for broadcom. dont care about tech this week.", "score": 1, "replies": [{"body": "Care to expand on this?", "score": 1, "replies": [{"body": "broadcom manufactures SoC that use ARM (designed) processors in shitloads of phones and other stuff.", "score": 2, "replies": []}, {"body": "AVGO is a big time semiconductor player. they have been beat up past 3 weeks, i think b/c apple phones are down. the thing is they are in every phone not just apple. they also own cell towers and had a huge merger recently. i think the price is potentially not accurate and lots of analysts have this as a 160-200$ stock in the future.\n\nthey def dont belong in the 140s.\n\nbad guidence or if apple is really one of their main purchaser could crush them tho.\n\nnxpi beat. amd beat. nvda beat. all in very similar fields. i been reading the credit suisse and reuters and other reports through etrade on the industry and AVGO was consistently the highest rated of the group.\n\nplus all the shit this week is boring stuff that has been around forever. i like the upside on a new player.\n\ndo DD because i have no idea what i want to play with it yet. i had calls a month or 2 ago but i got out of them because it looked like a dip was coming. lost a bit. i want back in tho.", "score": 0, "replies": [{"body": "> if apple is really one of their main purchaser\n\nThis is something you can check, relatively easily...", "score": 2, "replies": [{"body": "yes it is. \n\ni know they supply apple phones but i dont know what % of total business the contract is.\n\nlike i said i did not do DD on it yet. this is all common knowledge which i think is what he wanted.\n\nthanks for downvoting the basic info he asked for faggot.\n\npreciate the sarcastic tone. gl.", "score": 1, "replies": []}]}]}]}]}, {"body": "CRM currently trading at around 77.. you mean 74 or 84 strike", "score": 1, "replies": [{"body": "Yes I meant 74", "score": 1, "replies": []}]}, {"body": "how them calls boyyyyy\n\nthat a nice crm pop", "score": 1, "replies": [{"body": "did not play cisco.  kind of mad i didn't, but i didn't lose anything so all good.  added on a CRM 81-83 call spread 20 seconds before market closed based on cnbc.  tomorrow, lunch is on me.", "score": 1, "replies": []}]}]}
