{"title": "Technical Analysis of Boeing", "selftext": "", "id": "b0lykh", "created_utc": 1552483354.0, "score": 7356, "upvote_ratio": 0.96, "num_comments": 226, "comments": [{"body": "Hahaha, foolish people selling during a dip. Time for me to capitalize and buy one share and make $60!. ", "score": 656, "replies": [{"body": "I bought 5 shares at market open yesterday.", "score": 280, "replies": [{"body": "Whoa look at mister moneybags here", "score": 402, "replies": [{"body": "You have silver, don't spend it all at once now.", "score": 46, "replies": []}]}, {"body": "damm op leave some for us", "score": 54, "replies": []}, {"body": "Same except 50. I do the same with offerings on big gainer penny stocks. Drops 50% in a second and shorts start covering and you can usually get a good 30-50% return within 30-60min off the bounce", "score": 10, "replies": [{"body": "Can you define and give examples of big gainer penny stocks? I thought the idea of penny stocks is that they aren't big gainers.", "score": 3, "replies": []}]}, {"body": "From the looks of it it’s going to go through a 5th wave and reach ~405-410 before an ABC retracement to around 390.", "score": 0, "replies": []}, {"body": "Fake and gay.", "score": -23, "replies": [{"body": "We already know you are, no need to reiterate", "score": 29, "replies": []}]}]}, {"body": "I bought one share yesterday XD  ", "score": 80, "replies": [{"body": "I bought 10 shares 5 months ago 💩", "score": 88, "replies": []}]}, {"body": "The old “profit off of people dying”", "score": 101, "replies": [{"body": "That's like 90% of capitalism. ", "score": 107, "replies": [{"body": "Yeah and don't forget they also make warplanes so it's always been in Boeing's portfolio.", "score": 5, "replies": []}, {"body": "Ill stop you there before you get triggered and start talking about bernie.", "score": -10, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Dems cant meme", "score": 4, "replies": [{"body": "Covering your white rapist van with Trump stickers doesn't count as a meme", "score": 9, "replies": [{"body": "Your absolutely right.  Thanks for stating the obvious .", "score": 3, "replies": [{"body": "Oh okay. Thanks for confirming. Most GOP \"meme\"s are embarrassing grandma like email chain letters where Einstein suddenly becomes both a Christian and violent athlete to wreck ideas like \"people are equal regardless of which country they were born up in\" and oppressive religions are only bad if they aren't oppressive Christian religions", "score": 0, "replies": [{"body": "Relax buddy, i think your taking this too seriously. Have a good nights sleep and get back at me tomorrow morning. ", "score": 5, "replies": []}]}]}]}, {"body": "because using cuck unironically is obviously a demonstration of the superiority of the meme-ing ability of conservatives", "score": 2, "replies": [{"body": "Dude, are you going to be okay? We are worried about you!", "score": 0, "replies": []}]}]}, {"body": "Unironically whining about \"triggering\" is a joke?", "score": 0, "replies": []}]}]}]}, {"body": "Axe would be proud", "score": 31, "replies": [{"body": "Speaking of which, I believe he’s back this coming Sunday! 😃", "score": 14, "replies": [{"body": "It’s about time ", "score": 7, "replies": []}]}, {"body": ">Axe would be proud\n\nfollowing", "score": 8, "replies": []}]}, {"body": "We aren't going to let their deaths go to waste. ", "score": 10, "replies": []}, {"body": "Exactly, I would not try to speculate off the death of others. Seems to be like blood money from any potential gains. It’s a slippery slope and we need to re-evaluate our standings. ", "score": 7, "replies": [{"body": "Yeah any gains would be cursed for sure ", "score": 3, "replies": [{"body": "Cursed with tendeeeeees. REEEEEEE", "score": 3, "replies": []}]}, {"body": "loser talk", "score": 2, "replies": []}]}, {"body": "No shame in owning phillip morris. Have been to rehab, 95% of patients can't wait to light up - that's when the idea came to me to be an owner.", "score": 2, "replies": [{"body": "Truth. ", "score": 1, "replies": []}]}]}, {"body": "/r/unexpectedfactorial", "score": 10, "replies": []}, {"body": "I'd gladly take that $60 gain. ", "score": 1, "replies": []}]}, {"body": "You’re doing TA and you don’t even have the most recent data (yesterday) in your chart? These damn line bois are really lowering the bar ", "score": 696, "replies": [{"body": "it took him 24 hours to process this analysis. give the guy a break", "score": 491, "replies": [{"body": "Actually I made this yesterday but the post got removed, guess I flair'ed it incorrectly.", "score": 321, "replies": [{"body": "It’s ok, you were on auto-pilot and didn’t know it. ", "score": 271, "replies": [{"body": "Must need a software update in his cock-pit", "score": 90, "replies": [{"body": "Oh shit, BUY $PLUG?", "score": 2, "replies": []}, {"body": "Haha, cock!", "score": -27, "replies": [{"body": "This is a professional subreddit for in-depth market analysis. Please take your sophomoric humor and chicken tenders elsewhere.", "score": 60, "replies": [{"body": "Not my tendeies though", "score": 16, "replies": [{"body": ";_;\n\nOn another note remember that time you had 100k?", "score": 7, "replies": [{"body": "Saddest of reacts only", "score": 5, "replies": [{"body": "F", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "YOLO flair is reserved for high value, high risk trades. Its not for memes and using it incorrectly gets your post deleted right quick.\n\nI just changed your post flair to technicals because I like to mock technical analysis.", "score": 45, "replies": [{"body": "Idk this looks more like a 911 pattern than anything else. ", "score": 18, "replies": [{"body": "Too soon man", "score": 1, "replies": []}]}]}, {"body": "So did the pilots of flight 302.", "score": 2, "replies": []}]}]}]}, {"body": ">have a problem\n>send a team to identify problem\n>blame the obviously incompetent pilot\n>people forget and move on\n>munch on yummy boeing tendies", "score": 83, "replies": [{"body": "If it ain’t Boeing, I ain’t going?", "score": 23, "replies": []}]}, {"body": "Boeing's $350 is Tesla's $250\n\nRemind me what percentage of the Dow Tesla makes up again.", "score": 252, "replies": [{"body": "Boeing is weighted 10% of the DJ.", "score": 46, "replies": []}, {"body": "Yolo boeing to 200, is the bet?", "score": 87, "replies": [{"body": "More like Yodo.\n\nLAFATYD - Life ain't fair and then you die ", "score": 36, "replies": []}, {"body": "Where'd you get 200 from lmao fucking autist ", "score": 17, "replies": [{"body": "I fucking lost my ass, thanks", "score": 1, "replies": []}]}]}, {"body": "Doj is a shit index. I hate when people use it show the economy. Spy or even nasdaq are so much better", "score": 71, "replies": [{"body": "They're all fairly well correlated.\n\nBTW, while the Dow has its problems, that number, 30, is really the upper limit of the number of stocks required for effective diversification.\n\nFor a very clear demonstration of this, all you have to do is look at [GE's impact on either the Dow or the S&P500](https://www.marketwatch.com/story/breakdown-between-dow-sp-500-and-ge-sends-an-ominous-stock-market-signal-2017-08-17) (it didn't have any differential impact between an index carrying 30 stocks and an index carrying 500).  I suspect Boeing, because of its outsized weighting on the Dow, will expose a differential between the two, but if it doesn't, there's a reason Markowitz, Miller and Sharpe received The Sveriges Riksbank Prize in 1990.", "score": 30, "replies": [{"body": "The fact that it is price weighted and not market cap will always make DJIA the lesser of the indices.  I knows SP500 isn't strictly market cap, but at least that's a bit more reasonable (most people care more about market cap then they do share price unless you're talking about buying Amazon shares).", "score": 33, "replies": [{"body": "Ya it blows my mind Amazon isn’t allowed unless they do a split. So dumb", "score": 11, "replies": []}]}, {"body": "Ya but ge never had a huge sp like Boeing. ", "score": 3, "replies": []}]}, {"body": "I'm new to all this but I thought Nasdaq was basically tech, how is that an indicator of the economy? ", "score": 1, "replies": [{"body": "It’s better than 30 “blue chips”", "score": 1, "replies": []}]}]}, {"body": "No $BA $420 ", "score": 8, "replies": []}]}, {"body": "What your about to see if the tip of the plane start to go down. ", "score": 55, "replies": [{"body": "It's a typical dead plane bounce", "score": 29, "replies": []}, {"body": "Too soon", "score": 5, "replies": []}]}, {"body": "...aaand Canada just grounded the Max 8. Prepare for another dip!", "score": 34, "replies": [{"body": "Now the US", "score": 9, "replies": []}]}, {"body": "this made me laugh.  It looks exactly like how a 737 Max 8 takes off for flight", "score": 82, "replies": [{"body": "Minus the bounce and double the boom", "score": 1, "replies": []}]}, {"body": "This is how the penguins of Madagascar fly their planes", "score": 39, "replies": [{"body": "And boeing 737 pilots apparently", "score": 1, "replies": []}]}, {"body": "People died for this\n\ne: 1 updoot = 1$ off boeing", "score": 70, "replies": [{"body": "To be fair, Boeing also manufactures airborne things that are specifically made to kill people", "score": 38, "replies": [{"body": "which ensures the continued loyalty of elected officials ", "score": 7, "replies": [{"body": "“Elected”", "score": 3, "replies": []}]}, {"body": "Touchè", "score": 7, "replies": [{"body": "Touché", "score": 1, "replies": [{"body": "Touchē", "score": 2, "replies": []}]}]}]}, {"body": "We're all in a pretty messed up dysphoria at this point, damn. ", "score": 12, "replies": [{"body": "Do you really think people are happy that people died?\n\nDo you think people shouldn't be able to trade a company based on things that are happening in the world?", "score": 10, "replies": [{"body": "Not at all - its just that its so distant for us and virtually speaking we couldn't care less, its all about making some money.  \n\nDoesn't make anyone or anything bad, but we definitely are becoming less and less sensitive and thoughtful as a society.  ", "score": 6, "replies": [{"body": "There are plenty of subs where people are being thoughtful and caring, but this isn't the best place to look in general\n\nBut if you want to go down that road, there are **plenty** of comments that people have made recently that have been insensitive about the people that died and they typically garner a very negative reaction.  Someone made a post bitching about missing out on awesome gains they could've had if they held their puts just a day longer and more than a few reactions was that it's a bit ridiculous to whine about losing $1k in the context that so many people died.", "score": 9, "replies": [{"body": "Don't want to take away from a fairly interesting topic but you're reading way into my comment. It's all good man! ", "score": 3, "replies": []}]}, {"body": "I mean, 150 people died on the other side of the world. Over 100 people die every minute globally, so this one plane crash, while horrible, isn’t even a blip on the radar. Humans simply can’t be sensitive about everything; we aren’t becoming less sensitive, we’re just becoming more aware of things we don’t care to be sensitive about", "score": 3, "replies": [{"body": "I don't disagree, my comment is being blown overboard. It has more to do with how disconnected we are to the raw emotions of these things because it happens more and more and we're fully experiencing it digitally. ", "score": 1, "replies": []}]}, {"body": "Happened after every mass or school shooting under Obama as Republicans fearmongered about takin away the guns.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Being sensitive and being sensitive about important things are completely different. You're probably very insecure and sensitive based on your shit comment. The only thing you bang is your left hand in mommas basement.", "score": 1, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Stfu and come back when you hit puberty", "score": 3, "replies": []}, {"body": "\"If I put on the persona of a comically ruthless, heartless, business tycoon then maybe, just maybe, my options will pay off.\"\n\nBasically what I'm getting from this comment.", "score": 1, "replies": []}, {"body": "Stay chill gentlemen. Both of you have a point. Bottom line, shit happens. We can cry about it or make money while crying about. 2-Chainz", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "5/10 not enough air planes ", "score": 12, "replies": []}, {"body": "Yeah but this is where the nose points down! \n\nIn seriousness Canada just grounded it as well, citing satellite data showing similarities to the first crash, the bad news may keep coming for a while longer ", "score": 12, "replies": []}, {"body": "Have you calculated when the plane will land aka. when to short again?", "score": 10, "replies": []}, {"body": "i bet some lucky SOB insider is setting up his shorts for when the FAA announces that its grounding all 737 max8 flights. \n\nthe SEC will know and will do nothing about it since it will be a corrupt overlord with connections. ", "score": 10, "replies": [{"body": "Wish I could be that guy", "score": 2, "replies": []}]}, {"body": "I know I'm an asshole because the first thing that came to my mind when I heard it was the second 737 Max in 5 months was to trade on this volatile shit.", "score": 28, "replies": []}, {"body": "What's making them bounce so hard tho? ", "score": 8, "replies": [{"body": "Their \"autopilot randomly decides to steer you into the ground for no good reason\" issue happened close to the ground, instead of at altitude like [Airbus](https://en.wikipedia.org/wiki/Qantas_Flight_72)", "score": 27, "replies": [{"body": "Nah, it's a design flaw that made it so that if you tried to disengage autopilot during takeoff by pulling up like in any other plane instead of that special one's special procedure, it'd go crazy and think its pulling up too much and think it was stalling.", "score": 7, "replies": []}, {"body": ">issue\n\nThe nomenclature you're looking for is kerfuffle", "score": 1, "replies": []}]}, {"body": "the new MCAS indicator", "score": 6, "replies": []}, {"body": "The ground. ", "score": 4, "replies": []}]}, {"body": "-SetAllowCollision 0", "score": 6, "replies": [{"body": "Unknown parameter. SetAllowCollision not recognized. Using default configuration, collision=true.", "score": 6, "replies": [{"body": "DD is good. Confirmed h4x", "score": 2, "replies": []}]}]}, {"body": "This is why I destroyed my account (again) on $FB shorts (again) because I knew Boeing would bounce back after the drop.\n\nCheck mate..", "score": 7, "replies": []}, {"body": "I treat this like I treat Tesla. I will always buy on any kind of dip, because short term news has nothing on the long term game. Of course, my pull out game is strong, since I have robin hood. ", "score": 5, "replies": []}, {"body": "You need to add a bunch of little Chinese men on their computers right before it all happened", "score": 5, "replies": []}, {"body": "They died for our profits. RIP.", "score": 4, "replies": []}, {"body": "This is going to $355, then $333", "score": 14, "replies": [{"body": "333 is half of 666. Boeing is half-devil confirmed.", "score": 15, "replies": [{"body": "Boy that thing is going to make the price go down. SELL NOW", "score": 2, "replies": []}]}, {"body": "I have set a PT of $737 then sharply down to $0. ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Stock is currently trading up. ", "score": 2, "replies": []}]}, {"body": "I always buy on bad news. Has made me money so far.", "score": 3, "replies": []}, {"body": "Does anyone else think this stock should be way lower? Norwegian is requesting compensation from Boeing because they've been forced to ground their planes, companies are pulling business travelers and putting them on alternate flights to avoid the jet and just in general go lower. ", "score": 5, "replies": [{"body": "If the FAA/Boeing doesn't ground them and stands by the planes being safe I don't see why Boeing would have to compensate Norwegian Airlines because their country chose to ground the planes preemptively before they were able to look into it.", "score": 6, "replies": [{"body": "Norwegian wants 1.5 million. That's probably what BA spent on lunch today. ", "score": 6, "replies": [{"body": "That number cannot be real", "score": 3, "replies": [{"body": "[ You're right. That's per day.](https://www.bloomberg.com/news/articles/2019-03-13/ethiopian-jet-s-black-boxes-will-go-to-europe-737-max-update)\n\n>DNB analysts have estimated a potential cost of between 5 million kroner ($580,000) and 15 million kroner per day for Norwegian.\n\n", "score": 2, "replies": []}]}]}, {"body": "Canada decision has me thinking it's getting more likely they *will* ground them.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "And yet, BA is up for the day.  Weird.", "score": 1, "replies": [{"body": "The market, as a whole, hasn't seemed to be able to find itself. BA is similar in all this.  I think we haven't seen the floor on this.\n\n&#x200B;", "score": 3, "replies": []}]}]}, {"body": "I don't disagree.  FAA and Boeing backed themselves into a corner though so not sure they will even if they think they should.  Tough to release a statement saying you have full confidence in the safety and then ground the planes.", "score": 0, "replies": []}]}, {"body": "Hey look! The U.S. grounded them now", "score": 2, "replies": [{"body": "I said FAA/Boeing you silly goose!", "score": 1, "replies": []}]}, {"body": "Europe isn’t a country.", "score": 1, "replies": [{"body": "Thanks for the clarification but doesn't change my point", "score": 1, "replies": [{"body": "I'm suing GM because I won't drive my truck to work and I'm missing paychecks as a result.", "score": 1, "replies": [{"body": "There’s a difference between choosing to not drive your truck and being forbidden to drive your truck.", "score": 1, "replies": [{"body": "My religious beliefs forbid me to commute ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "With TA like that, I'd let you manage my portfolio", "score": 2, "replies": []}, {"body": "$BA call holders on suicide watch", "score": 2, "replies": []}, {"body": "I feel bad for laughing.", "score": 2, "replies": []}, {"body": "Picture checks out.", "score": 2, "replies": []}, {"body": "Time to buy?", "score": 2, "replies": []}, {"body": "More like boing", "score": 2, "replies": []}, {"body": "I say it crashed like their planes did", "score": 3, "replies": []}, {"body": "😂😂😂", "score": 1, "replies": []}, {"body": "Seems legit", "score": 1, "replies": []}, {"body": "Technical analysis is garbage anyways. Unless you know someone who has consistently beat S&P 500 doing it...? ", "score": 1, "replies": []}, {"body": "You should add a FAAaaaaaa for the falling or rising sound.", "score": 1, "replies": []}, {"body": "Spelled Boeing wrong in the analysis.", "score": 1, "replies": []}, {"body": "Man I love you guys", "score": 1, "replies": []}, {"body": "Did they pull this TA from the Ethiopian Airlines flight 302 black box?!", "score": 1, "replies": []}, {"body": "Crashing into profits ", "score": 1, "replies": []}, {"body": "I wish I could short this without having to trade options ", "score": 1, "replies": [{"body": "Not possible bruh, get the fuck outta wsb with that attitude", "score": 2, "replies": []}]}, {"body": "I LOLed", "score": 1, "replies": []}, {"body": "Lmfao mint analysis", "score": 1, "replies": []}, {"body": "Bear flag", "score": 1, "replies": []}, {"body": "If history repeats itself, then this is due for crash numero DOS!", "score": 1, "replies": []}, {"body": "Quality TA always comes from TV", "score": 1, "replies": []}, {"body": "nose . dive. ", "score": 1, "replies": []}, {"body": "Looks like it's porpoising ", "score": 1, "replies": []}, {"body": "As a pilot, that's definitely how planes work.", "score": 1, "replies": []}, {"body": "TA. You kids are hilarious.", "score": 1, "replies": []}, {"body": "It crashed again though after the dip-surge, no pun intended.", "score": 1, "replies": []}, {"body": "Yeeted into the new year and then got cheese on their face", "score": 1, "replies": []}, {"body": "Dont you guys know about the auto-pilot dive....", "score": 1, "replies": []}, {"body": "You can double dip some karma and slap this bad boy on r/toosoon it's better than 80% of the garabage posted there nowadays anyways\n\nEdit: a missing word", "score": 1, "replies": []}, {"body": "This one drop saved my account from the wild ride BA has been having", "score": 1, "replies": []}, {"body": "hope you're right because i'm holding these bad boys through. ", "score": 1, "replies": []}, {"body": "Just woke up and this is still making me laugh", "score": 1, "replies": []}, {"body": "TERRAIN... TERRAIN.... PULL UP!.... PULL UP!!!!", "score": 1, "replies": [{"body": "This guy bitches betty.", "score": 1, "replies": []}]}, {"body": "Still waiting on the dip.", "score": 1, "replies": []}, {"body": "Funny, that's what the black box reported up until it hit the deck.", "score": 1, "replies": []}, {"body": "Looks like they put MCAS in charge of their stock price. ", "score": 1, "replies": []}, {"body": "If you want to see our history of our signal's don't hesitate to check for FREE our telegram\nhttp://t.me/ForexProTrades", "score": 1, "replies": []}, {"body": "TL;DR: It's Boeing down", "score": 1, "replies": []}, {"body": ".", "score": 1, "replies": []}, {"body": "If it’s like their software it should head down soon to offset the steep climb", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You must be here from the front page.", "score": 0, "replies": []}]}, {"body": "I thought of this exact joke yesterday but forgot to post it! Take my upvote!", "score": 1, "replies": []}, {"body": "So.....calls?", "score": 1, "replies": []}, {"body": "Too soon", "score": 1, "replies": []}, {"body": "Smoke billowing from the rear of the plane before crash? Can software cause that to happen?", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Which one, the software or smoke?", "score": 1, "replies": [{"body": "Malfunctioning fog machine, it was a rave plane", "score": 2, "replies": [{"body": "Something I could get down with, there are rave cruises... ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "So the person claiming to have saw smoke has already been confirmed to be full of shit? ", "score": 3, "replies": []}, {"body": "Multiple people smelled burning rubber and smoke was reported on the second to last flight, yet still deemed airworthy, fucking stupid ass shithead that decided that got those people killed.", "score": 1, "replies": []}]}]}]}]}, {"body": "What chart u use?", "score": 1, "replies": [{"body": "Tradingview.com", "score": 2, "replies": []}]}, {"body": "Actual analysis of you. 100% dick. People died . ", "score": 0, "replies": [{"body": "Yes, and the media and market reacted. This means volatility. Thats when you trade.", "score": 6, "replies": [{"body": "Still a dick. Sorry man", "score": 0, "replies": [{"body": "🛫🛩🔥\n\n🍆💦", "score": 1, "replies": []}]}]}]}, {"body": "LOL i told yall this was going to dump", "score": -1, "replies": []}, {"body": "Nice", "score": 0, "replies": []}, {"body": "Is this a dead cat bounce situation?", "score": 0, "replies": [{"body": "Plane", "score": 2, "replies": []}, {"body": "Passenger", "score": 0, "replies": []}]}, {"body": "WTF! I laughed so hard. thank you for that", "score": 0, "replies": []}, {"body": "Also the flight path of your average 737 MAX 8.", "score": 0, "replies": []}, {"body": "Now do one for 9/11", "score": 0, "replies": []}, {"body": "It ain’t over yet..\n\nEdit: Boeing is now grounded in US. I didn’t realize I had these kind of powers. ", "score": 0, "replies": []}, {"body": "Haha the name of the company is the same as the sound effect. “Boeiinnngggg”", "score": -1, "replies": []}, {"body": "lol I told you fools this was going lower.", "score": -1, "replies": []}, {"body": "Dead plane bounce ", "score": -1, "replies": []}, {"body": "Dude idk if u know but 2 planes crashed!!!! PUTS BETCH", "score": -2, "replies": []}, {"body": "Says India literally just banned the planes from\ntheir entire airspace.", "score": -2, "replies": []}, {"body": "anyone showing some decency for the 305 victims and their families, of Boeing’s greed?!\nI guess because most were not americans then why this sub would care, right?!", "score": -4, "replies": [{"body": "Oh piss right off you pretentious cock holster", "score": 1, "replies": []}]}, {"body": "super original.\n\n[https://i.redd.it/gplt3jrztoe11.jpg](https://i.redd.it/gplt3jrztoe11.jpg)\n\nEDIT: I forget this sub is filled with mouth-breathing virgins.", "score": -22, "replies": [{"body": "More like a remix/mashup, so shut your cockhole.", "score": 16, "replies": [{"body": "lol so mad. Stop frothing at the mouth.", "score": -9, "replies": [{"body": "I'll stop frothing once your sister is done tossing my sallad.", "score": 4, "replies": [{"body": "got me. I'll cry tonight in your name.", "score": -3, "replies": []}]}]}]}, {"body": "Oh noes, this pun is totally an original thought, whoever made the shitty drawing you posted must be protected at all costs!  What a magnificent mind that person must have had to have been able to have the insight that \"Boeing\" sounds like \"Boing\"!  Surely noone could ever come up with that on their own!\n\n", "score": 9, "replies": [{"body": "Been around for at least a decade. Even same shit drawings. Anyway, have a nice day.", "score": 1, "replies": []}]}]}]}
