{"title": "I bought TSLA at $27. When would you sell?", "selftext": "I'm wondering if there is any more upside to this stock or if I could free up some capital to make some other plays.", "id": "1vrwz0", "created_utc": 1390325493.0, "score": 26, "upvote_ratio": 0.79, "num_comments": 34, "comments": [{"body": "It's doing fine, and provided the company survives expansion, it'll serve you really well to hold. In the rosy but distant future, it might split or start issuing a dividend or any number of fun things.\n\nPersonally, I'd keep it forever. If, as you say, it's not a very large position, it's almost worth it to hold on to it so you can tell your kid in 25 years, \"Yes, son. I bought TSLA when it was at $27. You're talking to a financial guru, you know that. So listen to me when I tell you, hover-homes are going to be big next year. BIG.\"\n\nEdit: spellin' sucks", "score": 14, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Tesla, duh.", "score": 2, "replies": []}, {"body": "Yoyodyne Propulsion Systems", "score": 1, "replies": []}]}]}, {"body": "I bought 15 @$19.95. Glad to see someone else hold on for this long.", "score": 5, "replies": [{"body": "I bought at 26.15 still holding :)\nI even also bought more when it plummeted back down to I think around 126~ a few weeks ago.", "score": 2, "replies": []}, {"body": "I hope you've held on :)", "score": 1, "replies": []}]}, {"body": "$181 but only sell half.  I feel it will go over 200$ eventually but you really need to consider taking some profits.  My 2 copper.", "score": 7, "replies": [{"body": "I think that's pretty reasonable. I don't have much so even if it does go to 200 I won't make that much more.", "score": 1, "replies": [{"body": "I traded half at 180 today.  If it goes up I will profit and if it goes down I strengthen my position again.  It is good to take profit some times. You cant time it perfect and who knows it may shoot to the moon tomorrow.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Not sure why you got downvoted. This is what I'd do now. Sell enough right now to cover your initial position, then regardless of what happens to the stock, you'll still feel pretty good about yourself. ", "score": 3, "replies": []}]}, {"body": "This is the $60,000 question.  I'm sitting in the same position with P and LNG.  I've always sold to protect my gain, but it doesn't really make sense to sell your winners.  If you have a stock going to the moon, why would you sell it half way there?  My best guess is when you see a better opportunity, then sell.", "score": 2, "replies": []}, {"body": "If I were in your position, I would have cashed out already. There are way better places to put your money right now. Solar, hydrogen fuel cells, 3D printing, and Marijuana are presenting possibilities for way better growth in the next year. NQ Mobile is set for a 50% break out in the next month or two. SGLB is beautiful after having gone through a recent dip and now looking forward to their first reported profits in the next couple of months. PHOT is about to take a huge dip creating an awesome buying opportunity. BBRY is way undervalued even if they were to lose their whole device market. SLTD is beginning a big surge. GE is amazing if you're looking for a nice rock-solid large cap that's investing a lot into innovation and expansion of their current business.\n\nWith all of these opportunities I wouldn't want to stick with a company that is already way overvalued and merely riding a wave of investor hype. Keep 1/4 of your position if you're really in love with it but get your money where it can see some better gains.", "score": 5, "replies": [{"body": "This is pretty much my thoughts. I'd wait till earnings and cash out if they spike beforehand. I think the volatility of TSLA going forward won't be worth it when you could put your money elsewhere.\n\nCongrats on your sweet entry though.\n\nedit: Though like the top post says I'd probably sell only a portion of it. 2/3 to 3/4 depending on how much you own.", "score": 3, "replies": []}]}, {"body": "I would sell right before I thought it was going to go down. ", "score": 4, "replies": []}, {"body": "Warren Buffet would probably say the company is way over valued but I bet it could break 200 personally I would take the money and run. I think it will bounce around 160 for a while I missed the boat on this but was happy to pick up a short position from 140-160", "score": 2, "replies": [{"body": "That's because the company *is* way overvalued.  It's not the only stock that is, however, (twitter, FB, Goog, AMZN, etc) and that doesn't mean it's a bad \"investment\".", "score": 1, "replies": []}]}, {"body": "Hang on to it. So much potential in the electric car industry!", "score": 1, "replies": []}, {"body": "I purchased TSLA early and I typically keep a stop 20% below where a stock is currently trading, resetting every few weeks for protection. But I didn't do that on TSLA because of the big swings up and down it took to grow so quickly. Big gains trigger profit taking and sales of even popular, growing stocks. I'm not that active of a trader.\n\nMany people want Tesla to succeed simply because they are providing a quality, socially acceptable, product that can break out of the shadow of Detroit, Korea, Japan and Germany. Society today enjoys nothing more than to see an underdog overcome adversity; and then chop them down when they become too successful.\n\nBased on current consumer brand recognition, brand integrity and environmentally conscious spending habits of those with deep pockets, I think continued growth or a high value sale to a competitor is likely. You will get a sensationalized smear campaign from time to time and that is a good time to sell and repurchase if you are an active trader and public opinion remains favorable.\n\nAlways have a price in mind that would be enough of a move up or down to make you sell. Don't fall in love with the company/stock, it doesn't even think of you on your birthday. ", "score": 1, "replies": []}, {"body": "I will go against the grain and say sell now. depending how much you bought maybe keep some on the off chance it continues to outperform (to the same degree). \n\nYou've earned ~400% Ask yourself if you can reasonably expect another 400?", "score": 1, "replies": []}, {"body": "Are you on margin?", "score": 1, "replies": []}, {"body": "For what its worth I have been with Toyota for 10 years, if this company succeeds and Toyota notices i just don't see how they have a chance when the big boys come around. Besides as soon as people realize there is no place to put the batteries where will they be, my long term money is on hydrogen, for example PLUG.", "score": 1, "replies": []}, {"body": "Wow. Well done. I bought at $150. I would buy it today as well. I think it could go to $300. (I have no data to back that up though.) But no shame in locking in some of your profits if you think you could do the same thing again with another company. ", "score": 1, "replies": [{"body": "I do also think there's a lot of upside as well, but I don't have that many shares, so maybe I'll sell a few shares to lock in some gains and free up some capital.", "score": 3, "replies": [{"body": "Good call. So long as you hold onto a couple so you can have proof of how smart you were!", "score": 2, "replies": []}]}]}, {"body": "I would hold for at least another 5 years. I believe its going to the $1,000's per share in the long run. But if you rather sell and buy TSLA back lower its hard to say really. It would be too risky to sell to me. I would hold.", "score": 1, "replies": [{"body": "I don't know about a $1000 unless you have some information I don't, but I definitely don't see it dropping in the near future if it can get past the expansion phase.", "score": 1, "replies": []}]}, {"body": "i'd sell somewhere between half and all once the one year capital gains tax period was up.", "score": 1, "replies": []}, {"body": "Most of the current stock price is speculation.  People are buying into it for the same reasons they are buying Amazon and Twitter.  They believe it will be around to stay and will soon become a very profitable company.  If you need some cash or want to ensure profits then trim.  Otherwise set a comfortable stop or use a trailing stop.  Either way congrats.", "score": 1, "replies": []}, {"body": "Don't sell until you need the money or the off-set for taxes, TSLA will only continue to go up. In 5 years I think we could easily see 800 without splits.\n\nI also have stock in TSLA\nand I'm also buying model X when it comes out.", "score": 0, "replies": [{"body": ">  In 5 years I think we could easily see 800 without splits.\n\nThat's a bold prediction when you consider that the current share price will only reflect their market cap if they achieve their growth targets for the next 10 years. If a major manufacturer brings out a well priced car and has good success the market will really change when others inevitably follow. I think BMW will enter the market soon, the i3 and i8 make it pretty clear that they're changing their ways, it's only a matter of time before they make an electric sedan.", "score": 2, "replies": [{"body": "They have Model X on the way as well as their own battery manufacturing facility, even if a competitor comes out with 300+ miles/charge, its likely they will be buying parts from Tesla.\n\nLots of new battery tech coming out soon. I think we will see cars that go 3,000 miles on a charge in the next 10 years.", "score": 1, "replies": []}]}]}, {"body": "I'd sell it when I thought it wouldn't gain much anymore, then put the money into stocks I think would gain.", "score": -1, "replies": []}, {"body": "I wanted to buy at $30 but talked myself out of it. ", "score": 0, "replies": []}, {"body": "IMO I could see this stock break its all time high sometime this year depending whether the global markets stay strong aka China", "score": -3, "replies": []}]}
