{"title": "Exercising options question: Far OTM or ITM?", "selftext": "Let's say I buy intend on buying 100 shares of stock A that's trading at $10 ($30 before crash) and I'm predicting it'll recover a lot by 1/15/2021\n\nShould I buy an ITM call for $10, or should I buy an far OTM call for lower premium? Or a call that's deep ITM?\n\nI feel like I would get more value buying a deep ITM call, but it eats up too much equity for my liking.", "id": "g3zdkl", "created_utc": 1587260768.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "Depends on how desperate you are to own the stock. Personally, a delta 30-35 call would be my choice. The volatility is slightly lower for OTM calls, so the premium is relatively cheaper. If you choose to buy deep ITM calls, just buy the stock itself.", "score": 1, "replies": [{"body": "Ahh wasn't considering the delta, you're right, deep ITM would have deltas close 1, so it's the same thing as owning the stock.\n\nI'm not desperate on owning the stock, but it's something I want to own cause I think it'll have a high ROI once it recovers. I've been buying calls with deltas around the 45-60, but I'll start looking at 30s.", "score": 1, "replies": []}, {"body": "but what about leverage???!? that's the whole point of options isn't it, I think ITM options are a good idea if your sure it will go up because of the fast increase in options value.", "score": 1, "replies": []}]}, {"body": ">Let's say I buy intend on buying 100 shares of stock A   \n>  \n> Should I buy an ITM call for $10, or should I buy an far OTM call for lower premium? Or a call that's deep ITM? \n\n1. If you intend to buy $100 shares anyway, just buy the stock.  Why pay extra in premium to buy a call which would raise your cost basis?  \n2. A deep ITM call just means you'll tie up more cash paying for the intrinsic value.  If your intent is to \"guarantee\" that you'll be automatically exercised at expiration, see point #1.\n3. Maybe what you're wanting, is to sell a cash secured put with the intent to get  assigned?", "score": 1, "replies": [{"body": "1. The point is so I can free up equity right now on different plays. There's more uses to a call than to just wait for it to go up in premium and offload it to someone else. A call also protects me from committing too much in the case it drops even further. \n\n2. I realize a deep ITM call is pointless unless I can get it at a breakeven point below the price of the stock.\n\n3. No. I want a call.", "score": 1, "replies": []}]}, {"body": "Study your Greeks and learn options. Also, it depends on the beta of your stock plus other factors.", "score": 1, "replies": [{"body": "Can you elaborate the “beta” of your stock?", "score": 1, "replies": [{"body": "How much your stock moves relative to the market. MGM May move a lot quicker than RVLV for example.", "score": 1, "replies": [{"body": "Gotcha, thanks! In his situation, which way would you go?", "score": 1, "replies": [{"body": "I always go ITM but never that far out. Usually ITM 2 weeks-2 months.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "How to get options data via Yahoo API", "selftext": "Hello folks,\n\nIn this WSB thread ([https://www.reddit.com/r/wallstreetbets/comments/g41k3w/which\\_one\\_of\\_you\\_idiots\\_is\\_betting\\_than\\_spy\\_will/](https://www.reddit.com/r/wallstreetbets/comments/g41k3w/which_one_of_you_idiots_is_betting_than_spy_will/)),  which for some reasons got banned by the moderators, there was a discussion about how to use Python APIs to get data relating to options. I am sure that some of you might find this information interesting, so I will share them in this thread:\n\n&#x200B;\n\nThis is the Python API that you can use to get options data: [https://github.com/pydata/pandas-datareader/blob/master/pandas\\_datareader/yahoo/options.py](https://github.com/pydata/pandas-datareader/blob/master/pandas_datareader/yahoo/options.py)\n\nWhat the API does is super simple. It just queries Yahoo. If you want to get options data for a company, let's say Netflix, you can just get them through this query: [https://query1.finance.yahoo.com/v7/finance/options/NFLX](https://query1.finance.yahoo.com/v7/finance/options/NFLX)\n\nThe query will return a JSON object. It doesn't get any simpler.\n\nAlso,\n\nDO NOT START RUNNING THIS EVERY FUCKING SECOND.\n\nThey might cancel the service. There is too many of you retards out there and if you all start using this the people who are maintaining this service migh think they are under a DDOS attack.\n\nThis is what happened to Google Finance API. They had an open API that you can use to get stock information. People started quering it like there is no tomorrow, and Google decided to cancel the service.\n\nP.S. I don't think I will do another post in WSB. The moderators keep banning my posts without any useful information why they did it.", "id": "g4g05y", "created_utc": 1587332358.0, "score": 24, "upvote_ratio": 0.92, "num_comments": 16, "comments": [{"body": "Didn't know YahooFinance had an API that worked. \n\nI also recommend using the optionsprofitcalculator API!\n\n[https://www.optionsprofitcalculator.com/ajax/getOptions?stock=SPY&reqId=1](https://www.optionsprofitcalculator.com/ajax/getOptions?stock=SPY&reqId=1)\n\nJust change the stock query parameter and you will get JSON data", "score": 2, "replies": [{"body": "the optionsprofitcalculator works great; however, the option chain data need a current stock price to do calculations, do you have the url to get the price?", "score": 1, "replies": []}]}, {"body": "People run this every second. They've taken it down in the past but they decided to put it back but with a 15 minute delay. It's one of the only places to get options chain data without paying money, but a warning; there's not guarantee the option chain prices you see in RH or TDA will match what it says on YF\n\nIf you really want to run some algorithmic shit, get a TDA account, and explore their API. It costs nothing. the YahooFinance is poor man, delayed data with questionable accuracy", "score": 2, "replies": [{"body": "Thanks for the extra info. So far though the data quality is not an issue. I just crawl it once per day after the market closes to get a rough idea of what are people betting on. I am not running a HFT company from my garage, so up to know I will stick to public APIs.", "score": 2, "replies": []}]}, {"body": "Thanks for sharing!", "score": 1, "replies": []}, {"body": "I only know how to code in Angular 6.  Is it still doable you think without learning python for me?", "score": 1, "replies": [{"body": "I am not very familiar with Angular. As as it has good libraries for data analysis and plotting, then you should be fine. Just get the JSON data via http. You can even see it in your browser if you plug the yahoo link. If Angular doesn't have good data analysis libraries you will need to get more familiar with python, where you have matplotlib (for plotting), pandas, sklearn, etc.", "score": 3, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "It's basically a simple web api. As long as Angular can make HTTP calls and parse json objects, then yes Angular can do it as well.", "score": 2, "replies": []}]}, {"body": "I thought it was just me, but  \n\n\n [https://github.com/pydata/pandas-datareader/issues/772](https://github.com/pydata/pandas-datareader/issues/772) \n\n&#x200B;\n\nAre you still able to load data on options?", "score": 1, "replies": []}, {"body": "u/TheStoicInvestor do you know if I use this api for the data in my app where I charge money would this be against any terms of policy from yahoo finance?", "score": 1, "replies": [{"body": "I am not sure about that. However, If you charge money in your app you should be looking at a more reliable API. The data from Yahoo API are not necessarily real time.", "score": 1, "replies": []}]}, {"body": "I think Yahoofinance is down but you might want to checkout TDA and devapi.ai", "score": 1, "replies": []}, {"body": "do you think they banned the posts because such information would cause the options to even out and reduce profits? just my 2 cents", "score": 0, "replies": [{"body": "Nope. It's most probably due to some late filters.", "score": 1, "replies": []}, {"body": "Nope. It’s because it was too difficult to understand. I read the comments ; )", "score": 1, "replies": []}]}]}
{"title": "The real reason stonks are going up right now", "selftext": "\"Money printer go brrrrrr\"\n\nThis has a lot of implications. We laugh and say its because the feds don't want to crash the market. Yet, thats exactly what it's doing. \n\nSupply and demand people. Money printer has gone full BBBBBRRRRRR. Never go full BRRRR. \n\nBasic principle of supply and demand is if supply goes down and demand remains the same, value goes up. Supply goes up, demand goes down, value goes down. \n\nHow does this relate to the stock market? \n\nThe demand for high value stocks are still in demand. Even more now with the crash. So the value is going up. Or is it? Its just costing us *more dollars* for the same, tangible stock. Wait, what are you saying u/thoughtIHadOne? \n\nI'm saying the dollar has been devalued. You think the stock is going up but it isn't. Your dollar is going down. Since money printer go brrrr, the dollar to whatever has gone up. Coincidink? Nope. \n\nSo you think you're seeing things go up but dont realize soon 1 dollar is less than the 2 ply toilet you bought to hoard. \n\nSpy $400c, 5/1", "id": "g49b92", "created_utc": 1587309384.0, "score": 22, "upvote_ratio": 0.78, "num_comments": 12, "comments": [{"body": "Somebody tell JPow help us find another meme stock", "score": 14, "replies": []}, {"body": "Inflation can't take hold if m2 velocity is in the toilet.  Doesn't matter how much you print, if it sits there then it is deflation.", "score": 10, "replies": []}, {"body": "The value of a dollar is based on what it can buy, and how it compares to other currencies. That hasn't really changed, so no dollars aren't worth less right now", "score": 7, "replies": [{"body": "So currency in general is gonna be worth less now", "score": 1, "replies": [{"body": "I don't think so. There's deflationary pressure on the dollar, not inflationary. Printing money is just to prop up inflation. I think people can argue that QE inflates asset prices, but the impact on inflation is seems to be pretty minimal", "score": 1, "replies": []}]}]}, {"body": "devalued with respect to what? surely not the Euro or GBP.", "score": 3, "replies": []}, {"body": "Soon it'll cost less to wipe your ass with dollars than toilet paper\nEdit: typo", "score": 2, "replies": []}, {"body": "You probably should look at a chart of the US dollar.", "score": 2, "replies": [{"body": "Or oil.\n\nOr M2 velocity.  Can't wait to see that number updated.", "score": 1, "replies": []}]}, {"body": "So bitcoin?", "score": 1, "replies": []}, {"body": "This is good for Bitcoin.", "score": 1, "replies": []}, {"body": "They arent actually putting bbbrrr money into circulation. So its not like theres more tangible money 'sloshing' around.\n\nYoull have to look up what exactly the FED is buying with this newly printed money.", "score": 1, "replies": []}]}
{"title": "Seattle City Council discussing referendum proof $500 million payroll tax on big businesses", "selftext": "[https://www.king5.com/article/news/local/seattle-city-council-payroll-tax-amazon-big-businesses/281-d7781108-0883-4f01-b638-d8a2138816ad](https://www.king5.com/article/news/local/seattle-city-council-payroll-tax-amazon-big-businesses/281-d7781108-0883-4f01-b638-d8a2138816ad)\n\n>The legislation calls for imposing a 1.3% tax on the city's biggest companies with payrolls of $7 million or more annually, in an attempt to raise $500 million dollars a year for housing and homelessness services.   \n>  \n>However, the first year would use $200 million for coronavirus relief.   \n\nBernie is out but local socialism is still making moves", "id": "g40l9j", "created_utc": 1587266184.0, "score": 11, "upvote_ratio": 0.79, "num_comments": 14, "comments": [{"body": " Top Employers in Seattle\n\n* Boeing – About 80,000 Employees. ...\n* Joint Base Lewis-McChord - About 56,000 Employees. ...\n* Microsoft – About 42,000 Employees. ...\n* University of Washington – About 25,000 Employees. ...\n* Amazon – About 25,000 Employees. ...\n* Providence Health & Services - About 20,000 Employees. ...\n* Walmart - About 20,000 Employees.", "score": 2, "replies": []}, {"body": "Man, democrats are so generous to give away other people’s money.", "score": 2, "replies": [{"body": "Ah yes the corporations are the real victims.", "score": 6, "replies": [{"body": "Payroll taxes are usually payed (economically) by employees. They aren't really corporate taxes, corporations just handle the logistics.", "score": 2, "replies": [{"body": "Most companies factor twice the salary of every employee to cover all the expenditures and taxes. So if you’re making $15 an hour the company is actually coming up with $30 an hour to cover applicable taxes and benefits. \nThere isn’t an unlimited amount of capital or revenue. Most businesses’ margins are rail thin.\nLabor is usually the largest metric a company has to come up with every month. The company absolutely pays more in taxes to employ a person than the person pays in taxes for the hours they e worked.", "score": 1, "replies": [{"body": "I wouldn't necessarily dispute that. But that is who pays from an accounting point of view. The better question is if those taxes were removed, how would the tax money get split (business vs employee)? Most economists estimate that most (not all) of the payroll taxes would go to wages, not profits. So when I say a payroll tax is a wage tax, that is from an economic, not accounting point of view. So a while a new payroll tax is levied on a company, it's effect is to depress wages, not profits.", "score": 1, "replies": []}]}]}, {"body": "Aren’t they always ?", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Yes. Numerous restaurants, bars and small businesses closed immediately.", "score": 1, "replies": [{"body": "I'm curious. If a business can't pay its employees a livable wage, deferring them to social safety nets that they also don't want to pay for, what is the argument that they are a successful and sustainable business that should continue to operate?", "score": 2, "replies": [{"body": "This isn’t a business owner issue so much as a market issue. Businesses close because their math quits working. \n\nThe real question is how much are you willing to pay in the cost of the items and services you purchase? If you’re bargain shopping or on amazon because of the better prices and service you feel like you’re receiving you’re helping put businesses under who have to worry about overhead and labor. That equates to lower wages, lost jobs and failed businesses. \n\nMost people aren’t willing to pay more because most don’t care about the front line worker. Many people have a false sense of understanding about how much small business owners actually make. If there is demand there will be a supply from those same products at those prices to the workforce itself. \n\nMost good businesses know that you have to pay for quality labor for skilled positions. As long as there are unskilled workers and unskilled positions they will be paid at a minimum because they are replaceable. \n\nFood service in particular is a very difficult industry to turn a profit even when you are successful and it’s filled with unskilled positions.", "score": 1, "replies": [{"body": "I appreciate your thoughts, but\n\n>The real question is how much are you willing to pay in the cost of the items and services you purchase? If you’re bargain shopping or on amazon because of the better prices and service you feel like you’re receiving you’re helping put businesses under who have to worry about overhead and labor. That equates to lower wages, lost jobs and failed businesses.\n\nWhat does this mean? \n\nWalmart has been around for awhile. They've been pushing out local stores and eating up market share while supplementing their payroll with tax dollars. Areas are dependant on these stores, not because they're \"bargain shopping\", but because they literally can't afford anything else.", "score": 2, "replies": [{"body": "one thing leads to another leads to another. it's all connected. \n\nin a free market society, your best bet is to improve your job skills so that your time demands a better wage. it's not fair and it wasn't designed to be. \n\nlow wage workers have it the worst. if they make no effort to improve the value of their time then they are screwed. Mandating a higher wage for unskilled workers doesn't improve the system. On an individual basis acquiring better skills and education does. \n\nYou can't decide for someone else that they should make better life decisions. if there is a market for unskilled workers and there is a market for providing the cheapest products and service there will always be a bottom tier. life is unfair.", "score": 1, "replies": [{"body": "I suppose it's a ideological difference then. I just don't think an employer has the right to take in millions if the bottom tier is taking in thousands, if not tens of thousands.\n\nUnskilled or not. Capitalism is meant to give workers the power to produce value from the employers investment. In return, the employee shares in the ROI.\n\nThis wealth disparage is not acceptable imo. And if it is insisted upon, then I will have to insist they pay into our society in a much greater amount. If people have to go through higher education for a higher wage, then they should be paying into a free public college.\n\nJustice comes from the people.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Seattle still doing all it can to drive out big business. I miss a lot about living in Washington but the politics of that place are gross. \nThey literally elected a communist to the city council.", "score": 0, "replies": []}]}
{"title": "Walmart Stock", "selftext": "I am currently buying numerous shares of Walmart stock but had a question about when to sell.  Would it be best if I hold on to it until the release the Q1 numbers and sell it?", "id": "g4a3u9", "created_utc": 1587312249.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "WMT will be one of the few stocks that beats earnings, with good guidance into Q2.. I would hold at least until dividends pay out; stock should  rise a bit in the next month or so.", "score": 6, "replies": [{"body": "Awesome,  thank you", "score": 1, "replies": []}]}, {"body": "I have calls expiring after May 19 earning.", "score": 3, "replies": []}, {"body": "But once people stop stockpiling, they’d have months of supplies that they must use up before coming back to the store to replenish.\n\nBut short term WMT is a buy.", "score": 3, "replies": [{"body": "Very true", "score": 1, "replies": []}]}, {"body": "Not WMT. It’s gonna go up. Been doing well during this period.", "score": 2, "replies": [{"body": "Yeah, I orig bought stock when it was about $60 and have been hanging on to it since. I think its at its highest atm", "score": 2, "replies": []}]}, {"body": "Walmart's grocery pickup and delivery could be huge for them in the future. The virus basically sped that timeline up about 5 years.", "score": 1, "replies": [{"body": "True, now both Walmart and Sam's are doing it.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Okay, why's that", "score": 1, "replies": []}]}]}
{"title": "Costco VS Walmart", "selftext": "[deleted]", "id": "g3ycfq", "created_utc": 1587256446.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "[deleted]", "score": 12, "replies": []}, {"body": "Costco: 785 locations\nWal-Mart: 11,000 locations", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Both are good but Costco charges a membership fee. No lowlifes allowed.", "score": 5, "replies": []}, {"body": "But Walmart/ Sam's club have curbside delivery. Sad that Costco makes you go into the cesspool", "score": 3, "replies": [{"body": "Member of both. Prefer Sams Club.", "score": 1, "replies": [{"body": "sams club member here too.  \n\nwhat are some of your fav products?", "score": 1, "replies": [{"body": "Costco is always packed. I can get the same stuff without spending an eternity in line.", "score": 1, "replies": [{"body": "Agree with you on that.  My sam´s has about 10 registers that are self-checkout and that speeds a lot up.  do you think that may be the differenciating factor?", "score": 1, "replies": []}]}]}]}]}, {"body": "Walmart has far more stores And often serves as basically the only place people shop in rural counties.", "score": 1, "replies": []}, {"body": "Walmart owns all the land their buildings are on, equals a whole lot of real estate", "score": 1, "replies": []}]}
{"title": "Roth IRA in mid 30s", "selftext": "Always see a lot about the SPYs and VOOs of the world and, to be quite honest, they all seem sort of the same as far as their top 10 holdings, with one or two discrepancies here and there.  \n\nOne that caught my eye which doesn’t get talked about nearly as much in this forum is FBGRX.  For someone like me who is bullish on a few blue chips continuing to run the world for the foreseeable future (AMZN MSFT AAPL GOOG) I think it makes sense to put a decent % of that in my portfolio.\n\nAlso put URTH (bugger risk/reward) and VUG on my watch list.  \n\nFor someone like me who would like to retire in 25-30 years and has a 401k already, and can put $6k max into a Roth IRA right now, and has about $5k (not much) in the market after three months of investing, should I still anchor my IRA with a SPY or VOO?  Or is it not crazy to try out one of these other ones as the main cog.", "id": "g40gda", "created_utc": 1587265553.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 20, "comments": [{"body": "Spy and voo are both s&p500 ETFs, of course they have the same holdings.", "score": 6, "replies": []}, {"body": "I do high yield dividend ETF’s in the Roth IRA and non or lesser dividend/buyback stocks in my traditional investing account. This way I’m not taxed each year on the dividend I am reinvesting into the Roth.\n\nAt retirement my goal is to start living off the dividend but keep the principle amount in the Roth.", "score": 4, "replies": [{"body": "You must be investing a TON to live off a dividend, no?   In the minimal research I’ve done, a “high yield” for an ETF is 5%, and can’t you only invest $6k a year in an IRA?", "score": 1, "replies": [{"body": "Yea when I say “live off” I don’t mean entirely as my one source of income sorry that’s a bit misleading. I still contribute to investing outside of the Roth and I factoring in that as well but forgot to mention in my comment.", "score": 2, "replies": []}]}]}, {"body": ">Always see a lot about the SPYs and VOOs of the world and, to be quite honest, they all seem sort of the same as far as their top 10 holdings, with one or two discrepancies here and there.\n\nWell... yeah, duh. They both track the S&P. The difference is the expense ratio. For long positions you'd be better off with VOO as it is significantly cheaper. SPY has the volume, which you likely don't care about in your IRA.\n\n>should I still anchor my IRA with a SPY or VOO?\n\nThe question is; do I want a significant portion of my portfolio to be tied to the US economy. Long term I would say absolutely you do.", "score": 2, "replies": []}, {"body": "I used to own FBGRX, but I sold all of it once fidelity came out with their zero fee index funds. \n\nI just couldn’t justify the expense ratio when I could just buy a couple blue chips individually and keep the balance relatively the same at a much lower cost.", "score": 1, "replies": [{"body": "I thought that was the zero fee one, no?  I guess I’m wrong. \n\nAnd isn’t the standard ETF fee like .03%?  That’s $54 on $180k if my math is correct", "score": 1, "replies": [{"body": "No, FBGRX is a pure growth fund with a decent amount of management buying and selling, hence the expense ratio is .8%.\n\nThe zero fee funds are pure index funds where the fund managers don’t buy and sell unless the index changes. \n\nThe “most similar” zero fee fund would be FNILX which is large cap only but is a blend of value and growth stocks.", "score": 2, "replies": [{"body": "Got it. Thanks!", "score": 1, "replies": []}]}]}]}, {"body": "I only buy one ETF:  VTI - vanguard total market index.  Low fee, great broad exposure.", "score": 1, "replies": []}, {"body": "Why not mimic the ETF and skip the expense ratio?", "score": 1, "replies": [{"body": "No one got time for that shit. 500 fuckin companies about 420 of them i’ve never heard of? No thanks", "score": 6, "replies": [{"body": "All that for a savings of .03%", "score": 1, "replies": [{"body": "Joke's on you ehh!", "score": 1, "replies": []}]}, {"body": "By mimicking the ETF doesn't mean you have to buy every single fucking equity that is in the etf.  One could easily go with the top 5 or top 10 holdings of the etf, like SPY and that would mimic the etf with no expense ratio.  And compounded annually, for 30+ years, that expense ratio can add up to a lot.", "score": 1, "replies": [{"body": "I’ve thought about this, but i don’t think i can get fractional shares on my fidelity IRA.  If I’m wrong, then the $500 every month is going towards amazon for the time being", "score": 1, "replies": [{"body": "I use Fidelity for IRA and fractional shares are available.", "score": 1, "replies": []}]}, {"body": "Okay but how many companies are in the s&p from 30 years ago. That’s what the expense fee is for. Rebalancing.", "score": 1, "replies": []}, {"body": "SPY top ten holdings\n\n> Microsoft Corp 5.59%\n\n> Apple Inc 4.93%\n\n> Amazon.com Inc 3.77%\n\n> Facebook Inc A 1.86%\n\n> Berkshire Hathaway Inc B 1.66%\n\n> Alphabet Inc A 1.62%\n\n> Alphabet Inc Class C 1.61%\n\n> Johnson & Johnson\t1.60%\n\n> JPMorgan Chase & Co 1.31%\n\n> Visa Inc Class A 1.28%\n\nThat represents 25.23% of SPY. If you extrapolate that out to 100% you'd be at:\n\n76.81% FAANG\n\n6.58% BRK.B\n\n6.34 JNJ\n\n10.27% JPM/V\n\nI imagine that's going to lose sync with the S&P quite often. You're missing entire sectors and are very heavy in tech.  You'll also need to rebalance to maintain your ratios often. Doesn't seem worth it given VOO is sitting at 0.03%.", "score": 1, "replies": []}]}]}]}]}
{"title": "Would it be best to sell and just concentrate on a few like 5 or so??", "selftext": "So far I have, \n\nBA 4@ $33\nRTX  5@ $60\nDal 15@ $22\nKO  4@ $38\nLEG 10@ $27\nXOM 7@ $36\nBP 7@ $19\nBAC 5@ $19\nDIS 3@ $89\nERI 184@ $10\nMGM 9@ $10\nRCL 9@ $34\nCCL 26@ $12\nT 5@ 28\n\nWould it be best to sell most and just stick to a few blue chip ones for long term growth?? So far I’ve invested around 5 grand.", "id": "g42b0k", "created_utc": 1587274296.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Boeing at 33? When did you buy that?", "score": 5, "replies": [{"body": "I was thinking the same lol", "score": 2, "replies": []}, {"body": "Lol $133", "score": 1, "replies": [{"body": "Bag hold that shit to your grave!", "score": 1, "replies": [{"body": "Which ones?", "score": 1, "replies": []}]}]}]}, {"body": "I would recommend diversifying your portfolio. I would also recommend you buy more blue chip stocks. You have some dividend/blue chip stocks, but also a large amount of riskier stocks. Maybe sell SOME, not all, and buy more blue chips stocks. \n\nI would recommend big tech companies that aren’t going anywhere, like Apple, Microsoft, or Facebook. Google and amazon are also good options, but they are more expensive. \n\nYou should also have some money in ETFs that cover the entire stock market. These are safer, and will ALWAYS earn you money in the long run.\n\nHope this helps! Just remember to do the reader how on what stocks are a good buy. You should NOT take ANYONE’s opinion online unless they are a professional. Most people on reddit are not professionals. This is just my opinion. Take it with a whole container of salt.", "score": 3, "replies": [{"body": "Thanks for the information! I got these stocks with the goal of making a profit after selling in a year or so, but then I started thinking if I should sell most of them now and just buy a few and pour most of the money for  some long term growth like the ones you mentioned. I have these one on Robinhood. I just opened up a Roth with just a  total market, international and a bond index for the long run.", "score": 1, "replies": []}, {"body": "His stocks are diverse yes, but most of his money is in blue chip stocks... BA, BAC, DIS, XOM, KO", "score": 1, "replies": []}]}, {"body": "No, always diversify", "score": 1, "replies": []}, {"body": "Holy oil and airpllanes man.\n\nSell all. Buy VEEV", "score": 1, "replies": []}, {"body": "Get organized for starters.\nYou type like shit 👍", "score": -1, "replies": []}]}
{"title": "Visa and Mastercard", "selftext": "[deleted]", "id": "g456la", "created_utc": 1587290224.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Nobody is afraid of cash here. Also Visa is most popular here.", "score": 3, "replies": [{"body": "I'm kindda afraid of cash here. I'm an essential employee dealing with vision and pharmaceuticals. People are disgusting. When a patient hands you a moist bill they just pulled out of their bra, disgusting. Or the little sweet old lady who I have to then give change back to and I reach to the bottom of the bill stack trying not to hand her back something covered in germs.", "score": 1, "replies": []}]}, {"body": "I would be more focused on researching changes in purchasing volume (which V said was down last week). We touch inorganic objects all the time buying items at the grocery store, opening a door, etc. people arent afraid of cash. They are afraid of spending money in general fearful there is a recession coming.", "score": 1, "replies": []}, {"body": "Touchless payments will definitely be pushed harder as a result of this. In theory that means less cash volume.\n\nAnecdotally, I’ve been more keen on using them myself.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You’re stretching my knowledge but I think you’re asking about “payment rails”. \n\nYou can Google that to see when/how M/V/A/D make money on transactions.\n\nSomething I need to become more familiar with myself. :/\n\nEdit: it looks like there is a company named “payment rails” that obscures search results. \n\nThis is along the lines of the info I was referencing:\n\n\nhttps://www.alacriti.com/what-are-payment-rails/", "score": 1, "replies": []}, {"body": "Basically everything is done by a credit card, with Visa and MasterCard being the big 2. Some websites will have the option to use PayPal which you can just use funds from your bank account. I’d say majority will use their credit card though(a guess, but I know I personally do).", "score": 1, "replies": []}]}]}, {"body": "There is still a large segment of the American population who are technology challenged and dont use credit cards, let alone digital payments.", "score": 1, "replies": []}, {"body": "In the US, the cards from your banks are also VISA (more often) and MC.  The main difference is that those cards take money out from your bank accounts rather than credits.", "score": 1, "replies": []}, {"body": "Do you think visa and MasterCard are good buys right now?", "score": 1, "replies": [{"body": "They'll rebound when consumer purchases rise again. I bought into discover personally", "score": 1, "replies": []}]}, {"body": "Tourism was their biggest cash cow and that’s not possible at the moment.", "score": -2, "replies": [{"body": "What?", "score": 1, "replies": [{"body": "Much of the money that went through visa and MasterCard was due to tourism. Hotels, ride shares, restaurant spending, airline fares, rental cars, and train fares all predominantly went through credit cards. Most of those aren’t happening right now.", "score": 0, "replies": [{"body": "The majority of those activities might go through credit cards, but those are not the majority of credit card transactions as your comment suggests", "score": 1, "replies": [{"body": "You’re right, I misspoke. It does impact their sales though.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Do I own too many different stocks?", "selftext": "Relatively new stock investor and am 22 years old. I have 22 different holdings at the moment, and I feel like 12-18 is the ideal range to shoot for based on what I've seen around here and other sites. Thoughts on whether I should sell any of these to consolidate? Primarily long term investor (5-10 year+)\n\nAAPL, GOOG, MSFT, AMD, ENPH, SEDG, FTNT, AMZN, CHGG, TTWO, CHE, ALXN, VEEV, VRTX, MDT, ISRG, COST, LULU, ADBE, BIIB, EQIX, TMO\n\nAlso have about 15% in a S&P ETF\n\nI tried picking stocks primarily on strong balance sheets and financials. Any I should consolidate? Atm, I'm thinking to drop ALXN and maybe TTWO. Thanks!", "id": "g45ffh", "created_utc": 1587291627.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "If you can’t keep up with news, monthly reports, annual reports, balance sheets, etc. yes you do.", "score": 11, "replies": [{"body": "Blue-chip companies really don’t need to be watched all that carefully as you can be safe knowing that your Amazon, Google and Apple stock are going to continue to increase over the next 30 years regardless.\n\nIt’s the smaller companies that really need the attention", "score": 7, "replies": []}, {"body": "This. If you're investing in individual stocks, your limit is going to be on how much time and energy you're willing and able to commit to gathering and analysing every piece of information you can get about them.", "score": 2, "replies": []}, {"body": "I see.  Seems like a \"check and evaluate\" type of situation.  Thanks!", "score": 1, "replies": []}]}, {"body": "It’s okay. You’re starting out. Keep them there but review regularly whether to drop any of the 18. Keep a journal. After 5 years, you would have learned so much through the process of eliminating.", "score": 2, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "All approximately equal-weighted (4% each and the rest is SP500 ETF)", "score": 1, "replies": []}]}, {"body": "so 18 is ok, but 19 no?", "score": 1, "replies": [{"body": "I mean I know it's not a set limit, but I was just trying to get a feel for what more experienced stock holders thought. Gotta draw the line somewhere!", "score": 2, "replies": []}]}]}
{"title": "AMZN currently overvalued?", "selftext": "I was thinking about picking up a few shares on the dip this week or perhaps I should wait a few months.", "id": "g46it0", "created_utc": 1587297554.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 14, "comments": [{"body": "There are 4 sectors that are soaring during this pandemic. \n\n1. Online shopping \n2. Grocery stores\n3. Cloud\n4. Streaming services\n\nAmazon has all of those. I’m thinking they will probably go down the toilet.", "score": 12, "replies": [{"body": "Itll def go down after the pandemic goes away, but it wont go down a lot.", "score": 1, "replies": []}, {"body": "Dont forget their pharma deliveries as well, this will be of aid.", "score": 1, "replies": []}]}, {"body": "Let me check my magic 8 ball. Amzn isn't overvalued, whether it will go down or not no one can say for sure. But it will, more likely than not, see higher highs", "score": 7, "replies": [{"body": "Without a doubt", "score": 3, "replies": []}]}, {"body": "Earnings coming up in under 2 weeks.  I think it soars.", "score": 6, "replies": [{"body": "You do know their upcoming earning will dive, not soar.", "score": 2, "replies": [{"body": "How so? Amazon isn't a brick and mortar company. All their services are online. If anything, they should go up because people were buying a bunch of stuff online when closures first started happening.", "score": 1, "replies": [{"body": "You will have to consider following factors that will affect their earnings (I will be surprised if they make a profit):\n\n1. They have hired 150,000 people in weeks and they are having high turnovers. There is high cost associated to that.\n2. They are selling a lot more items that are low priced and low margin products. At the same time, their Amazon Marketplace is being decimated, which happens to be very high margin for Amazon - charge sellers to store their inventories, charge sellers for delivering their goods and charge sellers for selling their good.\n3. Their warehouses are getting impacted by COVID-19 where they will have to implement extra safety measures and sometime close warehouses temporarily.  There is cost associated to that.", "score": 2, "replies": [{"body": ">They have hired 150,000 people in weeks and they are having high turnovers. There is high cost associated to that\n\nMost if not all those additional employee were hired after Q1.\n\n>Their warehouses are getting impacted by COVID-19 where they will have to implement extra safety measures and sometime close warehouses temporarily. There is cost associated to that.\n\nAlso another issue that wasnt a factor intolerance after Q1.", "score": 1, "replies": []}]}]}]}]}, {"body": "Amazon is basically the east India company \n\nso no", "score": 2, "replies": []}, {"body": "Would NEVER say AMZN is overvalued.  It just has never played by the rules.\n\nWhat is amazing about Amazon is that they own two sectors.   The goal is usually to win one sector.   Amazon owning 2 is pretty amazing.   But usually the sectors are smaller sized.\n\nAmazon owns two sectors and each one is just huge.  I mean huge.  Shopping and cloud.\n\nBut with that said I do still like Google better.   The reason being Google is leading in all of the layers of the AI stack from silicon all the way up.   Plus Google is in the best position for the next 2 really huge sector to be won.\n\nhttps://www.youtube.com/watch?v=f6lIhMRe6wQ\n\nTransportation and shipping/logistics.   Both will ultimately be automated and Google is best positioned to win transportation and ultimately shipping/logistics.  Yes I get Amazon is winning shipping/logistics under their shopping today.   But that will go fully automated and that requires Self driving technology.", "score": 2, "replies": []}, {"body": "Thanks guys, I pick up a couple this week and next week just to hedge my bets a little.", "score": 1, "replies": []}, {"body": "My thoughts on amazon, I’m a new investor so I may not know too much... But amazon will go down once we clear the “eye of the storm” that is currently going on w the virus, people will see how our economy will have taken a hit, but because of this virus, people are “forced” to buy online or they have started to buy online to some degree... especially the older generations, which exposes amazon to a wider audience if it has not already reached them, this makes me think that they will be a good buy for the future at a “discounted” price, which I personally think will come after the virus has died down and we start to re-open economy.", "score": 1, "replies": []}]}
{"title": "NFLX", "selftext": "With reported earnings Tuesday, do you expect profit-taking on the overvalued NFLX or is there still room to surge?", "id": "g46xzd", "created_utc": 1587299634.0, "score": 9, "upvote_ratio": 0.91, "num_comments": 11, "comments": [{"body": "Right now the market is full of people desperately chasing every available dollar. Any sliver of good news and stocks shoot up like crazy.\n\nI expect a dip on Monday and Tuesday and the stock to shoot up after destroying on earnings. \n\nHow long it continues going up is another story.", "score": 10, "replies": [{"body": "It’s actually shooting up now", "score": 1, "replies": []}]}, {"body": "Netflix isn’t going anywhere. Buy and hold. You don’t need an earnings report for that. \n\nLook around your life and buy companies you use all the time or see others using and loving. \n\nInvestor dads made a fortune in ugg boots because of their wives and daughters", "score": 5, "replies": [{"body": "Yeah but isn't the price awful right now?", "score": 5, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "That is literally the definition of a growth stock.", "score": 1, "replies": []}]}]}, {"body": "Everyone is home watching tv\n\nThey gonna do great", "score": 6, "replies": [{"body": "But we are already expecting that, it has to do with the difference between expectations.", "score": 5, "replies": []}, {"body": "the earnings will definitely be good but that doesn’t always mean the stock will continue to rise.", "score": 4, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}]}, {"body": "If it dips before earnings I would buy some, but don’t bet the house", "score": 1, "replies": []}, {"body": "There's a reason Netflix popped over 20% last week. A lot of it was actually priced in from Roku reporting how much their subs went up. Since you can estimate Netflix sign ups through Roku you can get a general idea of Netflix's sub numbers.\n\nNFLX might go up further, but only if they report numbers higher than what's expected from Roku's report last week.", "score": 1, "replies": []}]}
{"title": "Long term buy and hold investing vs short term swing trading?", "selftext": " Some family members are saying I should sell my Netflix stock because no stock will go up forever, and it takes profits whereas if I hold I will never profit and it's risky to hold on. I was a long term investor, but that got me thinking will Netflix, Home Depot, Coca Cola, Target, Pepsi etc ever become 1000 dollar stocks? Most likely not, so that got me thinking why hold long term. What do you all think is better tho long term investing or short term swing trading?", "id": "g4811x", "created_utc": 1587304506.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 10, "comments": [{"body": "Netflix I believe has split 5 times. Coke has split 11 times. Which allows them to grow because of the new attractive price. If you compare Apple to Amazon they have the same market cap but wildly different shares. So what if Amazon does a split and become 120 dollars a share, it’ll have more growth. Is it overvalued possibly. Yes a company will keep growing if the consumer is still using, investors like that. One thing with tech is they can not be no. 1 forever. You don’t know. That’s the risk. So the $1000 a share is kind of misleading target.", "score": 5, "replies": [{"body": "Except that share price is much less important now that everyone can buy Amazon in fractional shares.", "score": 1, "replies": [{"body": "It is but you’d be surprised how may still follow the Amazon is to expensive to own narrative.", "score": 3, "replies": [{"body": "True. Mainly because so many people don't know about the opportunity to buy fractional shares. Plus a lot of people think a very expensive share price means it won't go up much more so they've lost the opportunity. All about percent of increase", "score": 2, "replies": []}, {"body": "It's too expensive not to own Amazon. They run everything. It's a big deal when a company can lead just one sector. For them to dominate ecommerce and the cloud space is amazing.", "score": 1, "replies": []}]}]}]}, {"body": "How wealthy are your family members? Have they shown with their own funds they know what they are doing, or are they just giving their 2 cents. I'm betting they aren't experts", "score": 5, "replies": []}, {"body": "Netflix stock is trading at an all-time high, partially due to Covid-19 rises in viewership and partially because of normal yearly trends in the stock.\n\nIt is possible that it could continue to rise, but it might be advisable to sell at least *some* of the stock to lock in your gains and mitigate losses if it were to crash.\n\nFor example, if you bought 1000 shares last November (~$285) and sold 500 tomorrow (~$420), you would only be \"down\" $75,000 cash, meaning the stock would have to drop to under $150 for you to lose money overall, but if it goes up more, you can still make more money.\n\nIt's not common for stocks to reach and stay at $1000 a share. Companies don't like it, because investors rarely want to buy in at that price. If a stock price goes up too high, they'll typically split the stock, making your 1000 shares at $400 into 2000 at $200. Same value, just more shares.\n\nIn a more general sense, long term and short term trading each have their pros and cons.\n\nLong term, you have less risk, as most dips are followed by recoveries, but overall smaller gains, and a greater chance of a collapse simply over time. For example, if Netflix decides that the competition is too tough, and closes shop.\n\nShort term, you have higher risks due to volatility. You buy stocks as they go up, but they sharply decline tomorrow, leaving you stuck in a long position you weren't expecting. But the flip side is that a sharp increase means a massive gain.\n\nNaturally, the best strategies make use of a variety of trading schemes, including long term speculative trading, dividend producing stocks, some short term risks, and measured use of options trading.", "score": 3, "replies": []}, {"body": "Dividends", "score": 1, "replies": []}, {"body": "Each individual stock is different but the overall market does, in fact, go up forever. \n\nThe key is to not be beholden to one specific ideology and do both. Don’t panic sell during a crash, don’t panic buy during a bubble, but you don’t stubbornly hold either.\n\nThe people who do the worst during a recession are the people who sell during the decline and are too scared to reenter until they’ve missed out on the biggest gains. \n\nThe people who do the best are those who regularly rebalance their portfolios so that even if they are sacrificing short-term gains they are best positioned to limit losses and take advantage of upswings.\n\nSure I’ve missed out on some profit, by selling in the last few weeks, but in the long run I will be in position to buy when the market inevitably declines in the next weeks/months.", "score": 1, "replies": []}, {"body": "Sell half with a trailing stop if you’ve already doubled your money. Keep the rest. Now you’re playing with all profit.", "score": 1, "replies": []}]}
{"title": "Why buy airlines? DAL, AAL, etc.", "selftext": "I understand that the prices of airlines have tanked, making them attractive, however, we also know that these companies have poured profits into stock buy backs which have caused them to need a bail out. It’s also what pumped the stock in the first place. Will they do this again? Will we even see them go back to those levels?", "id": "g49mh2", "created_utc": 1587310533.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 15, "comments": [{"body": "You play the game to your advantage right? Why shouldnt they buy back but instead to save for a pandemic", "score": 5, "replies": [{"body": "Makes sense. I guess I just look at other companies that do well without this and still have stashed cash for rainy days.", "score": 2, "replies": []}]}, {"body": "History is/will repeat itself.  In the past, smaller airlines got bought by competitors, big airlines either merged or succeeded, pilots get laid off and the shareholders make money.", "score": 7, "replies": [{"body": "So these buybacks that pump prices won’t be a lesson learned for airlines?\n\nAlso what airlines do you see getting bought out?", "score": 4, "replies": [{"body": "No, they have done buybacks before.  They were not punished for it.  It makes stock prices go up.  What was a negative consequence of the buyback? \n\nYou can’t say that “they didn’t have money to survive the economic collapse” because they got bailed out and have no fines or negative connotations behind it.  The pilots, mechanics, and airline workers suffer because of downsizing, not the airlines.", "score": 3, "replies": [{"body": "Well the negative consequence is the bail out! But I guess the government is always going to be there for them..so it really isn’t negative.\n\nI guess this does make for a good investment..", "score": 1, "replies": []}]}]}]}, {"body": "Just buy jets and dont even look at it for two years..", "score": 2, "replies": [{"body": "how does this work? Suppose tomorrow AAL goes bankrupt how does it change the ETF value?", "score": 1, "replies": []}]}, {"body": ">Will they do this again? Will we even see them go back to those levels?\n\nPer the rules that came attached to the bailout money, the airlines cannot do the following until they have paid back the bailout money.\n\nA: Initiate stock buybacks.\nB: pay dividends.\nC: Lay off any staff.", "score": 2, "replies": []}, {"body": "I prefer companies that are “evil” enough to do anything within the limit of the law and get bailed out when things don’t work out :)", "score": 1, "replies": []}, {"body": "Wouldn’t that make me more willing to invest in them? The government won’t let them fail and they love buybacks which are great for shareholders. (Aka;me)", "score": 1, "replies": []}, {"body": "How about bankruptcy?", "score": 1, "replies": [{"body": "Bail outs will prevent this?", "score": 1, "replies": [{"body": "Maybe.  United already took the bailout and said they're going to lay off many, if not most, of their employees in October anyways.", "score": 1, "replies": [{"body": "And they would do that to avoid bankruptcy...", "score": 1, "replies": []}]}]}]}]}
{"title": "Portfolio Advice (am I dumb?)", "selftext": "[deleted]", "id": "g4ayp3", "created_utc": 1587315194.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "Did you google \"best stock deals during covid crisis\"?", "score": 4, "replies": [{"body": "No, but I’ll do that—thanks for the advice!", "score": 2, "replies": []}]}, {"body": "Instead of biying so many companies, just buy more shares of the quality names. You could have bought 5 different stocks and done better instead of buying a lot of different ones.", "score": 3, "replies": [{"body": "If you had put all your money in Microsoft, Salesfoce, SBUX, disney, and Verizon you would be better off", "score": 4, "replies": [{"body": "Yeah I’ve started to realize that as time has passed. Been thinking about selling some of these to buy more in others", "score": 2, "replies": [{"body": "Overall you have some good companies but some are in overlapping industries. You also have to think that some of those companies will rebound but say they get back to all time highs somehow, how will they keep growing. Microsoft, salesforce, disney all have ways to grow in the future", "score": 2, "replies": []}]}, {"body": "100% correct.", "score": 1, "replies": []}]}]}, {"body": "Overall, it's a pretty diverse portfolio, but if I could make a suggestion, I'd throw in an index fund like SPY", "score": 3, "replies": []}, {"body": "You have way too many stocks.  I'd cut it down to 10 growth/blue chip stocks and stick the rest in ETFs (technology, healthcare, utilities, consumer defense, REITs, etc).", "score": 3, "replies": [{"body": "Thanks! Yeah agreed I’m spread too thin and need to trim this down. Of these, which would you keep?", "score": 1, "replies": [{"body": "I’d sell 16 of them and keep DIS, SBUX, STZ, MSFT and CRM.  Once you get the cash to trade (2 business days), buy these 5 stocks:\n\nTTD, BRK.B, BABA, AAPL and V — OR you can hold the cash, invest 50% of your funds into ETFs and wait a few months until the above stock prices decline a bit — then buy them.", "score": 2, "replies": []}]}]}, {"body": "Some things will take time to bounce back but those are some pretty good companies. I did just sell my Ford stocks since they're not looking too hot more so each day. Buy more shares as the price drops here and there. Or just add a little share here and there as you can afford it.", "score": 1, "replies": [{"body": "Yeah, feel you there. Ford’s definitely not looking strong. Planning to hold it for a while and sell if it gets around $10", "score": 1, "replies": [{"body": "I was holding hoping TSLA would buy them for their facilities.", "score": 1, "replies": []}]}]}, {"body": "Basically, long term growth is going to be greater than short term bouncebacks", "score": 1, "replies": []}]}
{"title": "Perfect Portfolio", "selftext": "My investing timeline is 3-5 years. I am totally fine with not touching this money for 3+ years. I have been doing research and I am looking to put money into the following stocks. Let me know what you think of the following portfolio. I am planning on buying in slowly over the next 4 weeks or so.\n\nQQQ: 10%\n\nDFS: 10%\n\nUBER: 10%\n\nCVS: 10%\n\nDAL: 10%\n\nXOM: 10%:\n\nUA: 10%\n\nSAFM: 10%\n\nSNA: 7%\n\nBRK.B: 10%\n\nACB: 3%\n\nI also considered:\n\nTMUS, T, VZ, GE, WBA\n\nMaybe even JETS as an alternative to DAL?\n\nAny advice would be greatly appreciated. This is the portfolio I want to be able to buy into and not even worry about it for a few years. Let me know your thoughts.\n\nThanks!", "id": "g4gb9o", "created_utc": 1587333453.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 16, "comments": [{"body": "You’re pretty heavy in a possibly bankrupt sector and ACB is doomed. QQQ is solid but 10% QQQ and 20% in two single airlines doesn’t make sense to me, but then again they’ll recover at some point.", "score": 3, "replies": [{"body": "UA = Under Armour. So I’m only 10% in airlines with DAL. I will have to take that ACB money and put it towards QQQ instead.", "score": 1, "replies": [{"body": "Yeah. I was all about ACB when they were new but they have been nothing but a shitshow since the bubble popped. ApHA if you gotta have some weed gambling.", "score": 1, "replies": []}, {"body": "What attracted you to UA?  Nike is the leader, and Lululemon has 26% revenue growth.  QQQ is great.  Airlines, oil, no thanks.", "score": 1, "replies": []}]}]}, {"body": "Ew. just go 100% QQQ or FAANG + MSFT.", "score": 2, "replies": []}, {"body": "I’d suggest sticking with a etf, too. \n\nAirlines could be hurt for a while. Stock could be diluted, or maybe not. \n\nOil could be down for a while, or it may not be. \n\nCVS has a big retail footprint. That could move online over time?\n\nACB - there are better picks in the sector \n\n\nNot saying it’s bad, just realize the risks and be prepared to potentially lose money.", "score": 2, "replies": []}, {"body": "Sell all those and just buy QQQ", "score": 2, "replies": []}, {"body": "Could def select  something better than SNA, and ACB only if you're day trading and know something I don't. There's far better companies in the mj sector", "score": 1, "replies": []}, {"body": "What do you mean by \"perfect\"?  Perfect according to who?  Everybody?\n\nI feel like \"perfect\" should imply there is no way to improve it, yet I would probably change 100% of the allocation if it were me.\n\nPerhaps if you said what you were going for, it would be easier for other people to offer suggestions that potentially upgrade what you have while still aiming for the target you set?", "score": 1, "replies": []}, {"body": "No tech?", "score": 1, "replies": []}, {"body": "Downvoted just for title", "score": 1, "replies": []}, {"body": "I would do DAL over JETS for sure. Jets has too many small companies. \n\nI would increase holds for QQQ.\n\nmaybe you can consider V/MA since these are really good companies but not in QQQ. i like those over DFS\n\ni personally definitely wouldnt do ACB, especially if you dont want to worry about it for a few years.\n\nI dont know much about SAFM, SNA\n\nrest looks decent", "score": 1, "replies": []}, {"body": "To make money from an attractive/cheap stock, the company has to stay in the same public state until it is sold. What could happen? Well, companies can go bankrupt or become private, loosing all of the invested money. Companies such as DAL, UA, UBER fall into category. \n\nConsider companies such as V, AAPL, VOO to make money in 5 years with almost no risk.", "score": 1, "replies": []}, {"body": "Take out ACB. 12-1 reverse split incoming and more dilution. May be a good company in the future, but too many risks as of now.", "score": 1, "replies": [{"body": "Thanks for the input! Much appreciated. Any qualms with the other stocks? Would you consider any of my “honorable mentions” over the ones I picked?", "score": 1, "replies": [{"body": "UA is a questionable decision especially with the recent scandals. There was a time when UA products were the shit, but that’s slowly been fading away. Nike will always dominate over them and LULU has potential to steal their market share. Can’t go wrong with any of the telecom stocks. T and VZ will lead the 5g expansions across the US.", "score": 3, "replies": []}]}]}]}
{"title": "Bear market shorts", "selftext": "Hello,\nI trade I tiny portfolio with huge leverage - yeah not ideal.\n\nI'm of the opinion that the stock market at the moment is criminally overvalued and hasn't the impact of this pandemic is not cashed into its value at all. In my eyes the bear market is a bubble waiting to burst (though I don't know when) as more poor economic data and poor earnings are released.\n\nWhat would be a good asset to short on this basis, and, more importantly, what would be a good asset to hedge it... I'm thinking something that can thrive in shitty these shit circumstances and good economies alike - i.e. Amazon and other tech companies and possibly gold...", "id": "g4glrm", "created_utc": 1587334513.0, "score": 6, "upvote_ratio": 0.69, "num_comments": 20, "comments": [{"body": "\" (though I don't know when) \"\n\nStay out. Trying to bet on the stock market crashing, you have to be prepared to lose everything you put on that bet. If you don't know when, you might as well be saying \"I want to bet that it's going to rain, but I don't know when\". Obviously it's going to rain, knowing when is the difference between the winning bet and the losing bet. \n\nOnly make that bet with money you readily have available to lose, completely.", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "\"monthly student loan income\"\n\nBeyond saving.", "score": 3, "replies": []}]}]}, {"body": "You can buy  VXX calls, it's almost the same as shorting the market without messing with the mega caps", "score": 3, "replies": []}, {"body": "Just buy puts on SPY if you want to short the market. But, like others have said, be careful. I hope you have a good understanding of economics and what the FR is doing.\n\nGood luck", "score": 2, "replies": []}, {"body": "I run an online community dedicated to short ideas: [https://activist.cafe](https://activist.cafe)\n\nAlso you can check my post history, I post weekly aggregated list of short calls in /r/investing", "score": 2, "replies": []}, {"body": "Why not the entire index?", "score": 1, "replies": [{"body": "It'll be mitigated by tech stocks and healthcare stocks - would rather go for something that will be hit more directly and seriously", "score": 3, "replies": [{"body": "The worst hit stocks are going to be the small cap ones that are thinly traded, but heavily invested in with notional shares in  the ETF market by being indexed.  These will become subject to [liquidity shocks as panic arrives](https://bearmarketsprofits.com/2020/02/29/risks-and-opportunities-of-liquidity-shocks/).", "score": 2, "replies": [{"body": "I'm a novice, give me some examples!", "score": 1, "replies": [{"body": "For a novice it's probably best to just short the small caps index. This is ticker RT200.", "score": 2, "replies": []}]}]}, {"body": "Banks will have problems with small business loans and mortgages and their investments going belly up.", "score": 1, "replies": []}]}]}, {"body": "No way Tesla holds up this run imo.", "score": 1, "replies": [{"body": "when there is a slowdown - not many ppl can afford a 50K car.", "score": 2, "replies": [{"body": "Yes there stock has been up like 60% since March...", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Hey moron, please find where I said that. I didn’t. Maybe instead of learning how to research you should learn how to comprehend first", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "So once again my comment mentions nothing about their sales correlating to their stock price. Stop it, you are proving your own self wrong", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Spelling and grammar errors? Lol what kind of low life gets triggered over a misplaced comma. Move on", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "You use Reddit cause ya ain’t shit like you said lol. Stop getting so upset online. It’s a tough look bud", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Tesla's swings are too weird for me to navigate", "score": 1, "replies": [{"body": "Lol ya I agree. That stock makes no sense, but it’s still extremely overvalued. Best of luck", "score": 2, "replies": []}]}]}]}
{"title": "Stock Market 4/19/2010", "selftext": "I'm a bit confused on why the stock market is continuing to arise although we clearly aren't done with the threat of the coronavirus? Is the market responding to news that we might reach the end of the pandemic soon? If so, do you guys think the market is going to continue to grow or will we see a dip/crash in the near future?", "id": "g4gubk", "created_utc": 1587335380.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 18, "comments": [{"body": "I think once the economic impact reports start coming out it will probably drop but in the mean time you're fighting against the fed saying \"we will make this market go up no matter what.\" \n\nI'm sitting on cash and selling puts until after q1 and q2 earnings start coming out.", "score": 6, "replies": []}, {"body": "Crap", "score": 4, "replies": []}, {"body": "I’m bullish this whole week legooooo", "score": 3, "replies": [{"body": "What do you mean when you say bullish? Sorry new to investing :/", "score": 1, "replies": [{"body": "Market growth/gains", "score": 1, "replies": []}]}]}, {"body": "Futures are down.", "score": 4, "replies": [{"body": "Doesn’t mean shit.", "score": 2, "replies": []}, {"body": "Does it mean tomorrow we start in the red ?", "score": 1, "replies": [{"body": "Likely", "score": 2, "replies": []}, {"body": "Likely, but a long day ahead...", "score": 1, "replies": []}]}]}, {"body": "Because there’s so much bad news.  Once we start to get good news, it’ll drop back down again.\n\nI’m being sarcastic but there’s no fundamental trading going on.", "score": 3, "replies": []}, {"body": "I think people might be a bit shell shocked. It took them by surprise, and now they're resorting to gut checks. Their base instinct says \"Coronavirus caused this. When we get control of the virus, things will go back to the way they were before.\"\n\nThat's not how it works, but that's how our emotional response is geared to react. Threat caused bad, eliminate threat and everything good again. Unfortunately, economic momentum is much more real than stock market momentum. And the economic momentum isn't going to change just because the virus disappears.\n\nFor now, the virus is still here, so people still have hope that once the virus is gone, everything will be fine. The problem is going to come when we've got the virus under control, we lift the lockdowns, and people start to realize \"wait, why isn't everything fine again? Plenty of people are still out of jobs. Businesses still keep going under. Demand isn't coming back like before. I thought when the virus was gone, we'd pick back up where we left off???\" And that's when a second wave of panic sets in. Not about the virus, but the economic momentum the virus sparked off. Timing that will be hard. Will it take a few weeks, a month, a quarter? Hard to say, but at some point, it'll start to dawn on people.\n\nA lot of people are predicting that investors are going to start buying in large quantities once the virus has been subdued and we have more \"certainty\" when the lockdowns come to an end. Thing is, everybody is pricing that in NOW. Everybody is trying to beat everybody else to the punch NOW, so that they're already in when that certainty comes and they expect everybody else to start buying in earnest. They're all predicting what everybody else is going to do, so they all end up doing the same thing everybody else is doing, trying to buy before the good news.\n\nWhat happens is everybody is jumping over each other to price in the best possible outcome. So when the best possible outcome happens, everybody is already in. Anything less than the best possible outcome means everybody overbought. If you genuinely believe the best possible outcome will happen, and I mean BEST possible outcome, because that's the degree people are jumping in right now, you have nothing to worry about. But even then, I wouldn't expect a big bounce upward. Anything less than the best outcome though, the closer you get to \"Oh man, I overbought on this, I need to get rid of it before I miss out on making a profit on this\". And that spirals fast.\n\nPeople aren't buying right now on fundamentals. I know this for sure. How? Let's go back to January. You're holding a normal portfolio diversified properly:\n\nScenario A. Maybe you timed this whole thing perfectly and did a bunch of selling off in February before the panic. So you've got a ton of capital to reinvest in March when the bottom hits. You buy up more of the fundamentally sound companies you've been buying all along, but at a discount. That's a huge win for you, and it's happy days. You now hold more stock and the same amount of dollars relative to before.\n\nScenario B. You didn't time the market. You watched as you took a hit. But you still had cash on hand and said \"well, the fundamentally sound companies are at a discount, might as well buy some more and be happy I have a chance at some cheaper stock, I believe in these companies long term anyway.\" You're down, but you're a glass half full kind of person so you did some buying at lower pricing. (I currently count myself among this group).\n\nScenario C. You didn't time the market. Worse yet, you were buying heavy right into the drop off. You took a hit, and you're low on cash. Short of selling, you don't have much in the way to reinvest. You're just praying for a rebound. At least you didn't sell though.\n\nScenario D. You didn't time the market. You didn't simply buy at the wrong time, you sold at the wrong time too. Now, you're in the total opposite position of scenario A. You have less total value than before and with every passing day, you're cash is able to buy less and less. If you haven't FOMO'ed already, color me shocked.\n\nScenario E. You didn't time the market. You didn't overbuy. You didn't sell. You didn't buy at the bottom, you essentially did nothing and continue to do nothing. And that means the mountain of cash you were sitting on before, you're going to continue to sit on, because whatever logic you used to decide before all this started that told you, \"hold fast\" will continue to tell you to hold fast once we are on the other side. Because every fundamentally sound company will have already essentially recovered pricing wise. If you weren't putting that money to work before a pandemic that shut the economy down, you're certainty not going to immediately after when everybody already bought it up to the best case scenario.\n\n&#x200B;\n\nIn all those scenarios, by the time the virus is under control and we find certainty, there's very little free cash sitting around waiting to get invested. So my view is that once we hit \"certainty\" about the virus, that's as good as it's going to get for the stock prices. In what scenario does a pandemic that shut down the global economy and causes global negative GDP lead to an economic boom? It doesn't. So the end of the shut down and the certainty that comes with the virus being under control, that's as good as it's going to get. It's all downhill from there when reality starts playing out and hope disappears.\n\nEdit to add: Anybody who was buying on fundamentals was already bought in before the panic. They held through the panic, maybe bought a little more, and by the time certainty is here, they're done buying. So nobody is going to be buying in earnest once certainty sets in. By that point, the buying has already been done, either before the panic or during it. The companies don't fundamentally become significantly more valuable after a crisis, unless shit really hit the fan and they are a beneficiary of that long term. That comes at the expense of other sectors though.", "score": 4, "replies": [{"body": "Jesus...you might as well start writing a novel.  You realize this is Reddit, right?", "score": 2, "replies": []}]}, {"body": "I've just been buying stocks i think are fair now and will do well in the future regardless. I dont care about a loss short term vs. gains long term.", "score": 1, "replies": [{"body": "Good strategy, what type of stocks are you investing in?", "score": 1, "replies": [{"body": "I've bought just one or two in companies because I don't have much to use. I bought two in Ally, one in AMD, two in BiliBili, 2 in Deac, 2 in JD.com, 1 Microsoft, one Raytheon and one in Tencent.", "score": 1, "replies": []}, {"body": "I'm currently looking to buy the following tomorrow:\n\nVGNA, BNT, OVR, JZZZ, BEJA, TATS, FNGR, FST, MSHN, CWBY and PNIS.", "score": 1, "replies": []}]}]}, {"body": "Zero f'n chance we're nearing the end of the pandemic.  A new stimulus bill is about to pass and it will award a vast majority of Americans at least $2k per month, married couples $4k a month plus $500 per child.    Yes, we're going to see another dip, but it won't go down to the 19k mark back on March 23rd.", "score": 1, "replies": []}]}
{"title": "The market as a whole seems like it should be a lot lower right now. But which stocks specifically do you guys think are irrationally higher than they should be?", "selftext": "Airline stocks are down 60-70%, Bank stocks are down 35-50%, cruise lines are down even more. These industries haven't really bounced back with the others for obvious reasons. Other stocks like AMZN, WORK, and ZM are up though, also for fairly obvious reasons. Everything here makes sense and I can see why the investors of each stock have been reacting to the overall market situation the way that they have been for the most part at least if I look deep enough. But I, along with a lot of others, feel like the market is higher than it should be. It seems like we all think the market is overvalued, but its not these stocks (my stocks), its the other ones. So what are some of those other ones that you feel are not accurately priced right now, or ones you feel like need to drop substantially to face reality? Were they also overvalued before the global meltdown in your opinion?\n\nI'm pretty sure TSLA will be mentioned but this one was also weird before the entire COVID-19 meltdown anyways and feel like it's been discussed enough.", "id": "g4h8h5", "created_utc": 1587336777.0, "score": 8, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Nike, Tesla.", "score": 9, "replies": []}, {"body": "Wingstop", "score": 5, "replies": []}, {"body": "TSLA", "score": 5, "replies": []}, {"body": "CVNA, I just don’t see buying cars right now as a common expense - unless someone desperately needs a new one, until this is over. People working from home more now than ever - and likely for the foreseeable future, recession, high unemployment. Yet the stock has almost tripled in value since its lows in March.", "score": 3, "replies": [{"body": "Do you know if Carvana owns the cars it sells or do they just match buyers and sellers?\n\nThis won't be unique to just Carvana but I have to imagine all these cars are going to suffer from sitting and not being driven for months.  Batteries are an obvious concern but also anything that is lubricated and has seals typically is not supposed to sit unused for a very long time.  I'm not a mechanic but seems to me that's another risk as well", "score": 2, "replies": [{"body": "They’re a dealership so they own the inventory as far as I know. There’s a few headwinds facing car dealerships right now and why I don’t see this stock justified at its current price.", "score": 1, "replies": []}]}]}, {"body": "ZM, I think the rush to that was a big mistake. Confused the solid tech stocks with the speculative ones that could easily get torpedoed by the likes of other big tech companies. They have all their eggs in one basket relatively speaking and they aren't a company with a long brand history. They're significantly more risky than many tech stocks, they will definitively have growing competition in their product focus (Microsoft Teams for example), and some bad PR or screw ups could quickly ruin them because they have little in the way of long term credibility.", "score": 3, "replies": []}, {"body": "Netflix", "score": 2, "replies": []}, {"body": "CMG seems stupidly high even before the virus hit. Idk about you but I wasn't dying to go to CMG before this whole thing, I'm definitely not going now haha.", "score": 2, "replies": []}, {"body": "I'd say TSLA but it doesn't matter. They're probably going to see an ATH during this pandemic.", "score": 2, "replies": []}, {"body": "GILD is a garbage pump and dump. Prepare for the dump this week.", "score": 1, "replies": []}, {"body": "Chipotle", "score": 1, "replies": []}, {"body": "AMD, SHOP", "score": 1, "replies": [{"body": "Do you think they were overvalued before too?", "score": 1, "replies": [{"body": "Yes, both have been overvalued for a long time.", "score": 2, "replies": []}]}]}]}
{"title": "What do you think of these stocks I want to add?", "selftext": "Thinking about adding to my portfolio and buying shares of UBER, DEAC, and KO. I already have VTI, DIS, MSFT, and SBUX. What do you guys think of the 3 I want to add. I’m ok with the riskiness of these stocks", "id": "g4hqgo", "created_utc": 1587338600.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 13, "comments": [{"body": "deac put all your savings on", "score": 7, "replies": []}, {"body": "I’m a strong believer in DEAC going into the next few weeks - also long term - but I expect a large spike when the special meeting approves the ticker change and when we get more info as to when sports will start back up.", "score": 5, "replies": []}, {"body": "What is your goal? Your time horizon? If you’re okay with the risk associated with these stocks, it sounds like your mind is already made up.\n\nI like KO for my portfolio.", "score": 1, "replies": [{"body": "My goal is to hold everything for 10-20 years. Those are 3 that I like based off potential and value but my mind is not made up no", "score": 1, "replies": []}]}, {"body": "Do it", "score": 1, "replies": []}, {"body": "I wouldn't buy uber", "score": 0, "replies": [{"body": "Could you please explain why?", "score": 1, "replies": [{"body": "Do I really need to explain? They literally dont make any money. They lost 8.5 billion in 2019 and 2020 is gonna be worse.", "score": -1, "replies": [{"body": "What retard downvoted me lol?", "score": -4, "replies": [{"body": "Lmao I know. Wtf, people probably haven’t looked into their financials. Losers.", "score": 1, "replies": [{"body": "I mean the guy said he was ok with the risk of those stocks so I'm assuming he looked into their financials or how else would he come to that conclusion. My point is that if you've done minimal research, you would know that uber is a terrible buy.", "score": 1, "replies": [{"body": "Probably from bandwagoning peoples posts on here about Uber and not doing the research himself. It’s an awful company to invest in.", "score": 2, "replies": []}]}]}]}]}, {"body": "bought lyft and uber at 15 for a long term.", "score": 0, "replies": []}]}]}]}
{"title": "Selling premium into earnings?", "selftext": "What’s everyone’s thoughts on selling premium this week?\n\nIV likely to skyrocket in some cases, even with premiums expensive as they are, surely in an UpwarD IV trend it’s a buyers market? Even if you are neutral on direction. \n\nI’m thinking of selling premium right before earnings (looking at Dominos and maybe amazon) and benefitting from the IV drop immediately after. \n\nAny thoughts on strategies this week?\n\nFull disclosure I am currently long in most tech going into this week but definitely want to take advantage of the FOMO of others when AMZN and Netflix start to fly again.", "id": "g4au15", "created_utc": 1587314775.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "With IV elevated across the board it might not even drop too much afterward. Last week, with JPM and WFC it dropped, then with BAC, GS not so much, then with MS and BK it dropped a lot again. It does not look very consistent.", "score": 2, "replies": []}, {"body": "I'd probably go with an iron condor or a chicken iron condor especially for a large underlying like AMZN", "score": 2, "replies": [{"body": "Chicken Iron Condor? That’s a new one.", "score": 3, "replies": []}, {"body": "Is a “chicken” iron condor just wider?", "score": 1, "replies": [{"body": "[explained here](https://youtu.be/2M3oGJsHQtg)", "score": 3, "replies": []}]}, {"body": "why though? 50% probability, why not just flip a coin and peak either put or call spread instead of a \"chicken\" condor", "score": 1, "replies": [{"body": "Sure, you're holding a 50/50 option if you hold to expiration, but holding to expiration is very rare. Typically when a binary event like earnings occurs and the unknown becomes known, there is a very drastic drop in implied volatility, crushing option prices. The key to a chicken iron condor is choosing the expiration closest to after the earnings date because it will experience the largest volatility crush and collecting more premium than a traditional iron condor. So with IV crush, IV typically overstating movement, theta decay, and closing the condor at 50% max profit all working for us, we actually have a much larger advantage than the 50% probability suggests.", "score": 1, "replies": []}]}]}, {"body": "How would you play AMD?", "score": 1, "replies": [{"body": "Personally, they are likely to smash earnings, and premiums are not too expensive. I would just aim a month out around 60C", "score": 2, "replies": [{"body": "I like to wheel so was thinking of getting a cash-secured put. Just didn't know how low a strike I should get to secure some premium.", "score": 1, "replies": []}]}, {"body": "I wrote naked calls (cash secured) @ 65 on it last week.    Premium was looking good.  \n\nI have a stop in to buy the underlying around 65-ish if it rallies.", "score": 2, "replies": []}]}, {"body": "No volume on dominoes and low interest... Gotta go troll wsb or no one is going to buy what you're selling...", "score": 1, "replies": []}]}
{"title": "Need some advice on my credit spreads", "selftext": "Here are all my current spreads\n\nDIS $107/$108 Calls 4/24 x10\n\nSNAP $11/$10.5 Puts 4/24 x6\n\nPLAY $12/$13 Calls 4/24 x1\n\nSPY $284/$285 Calls 5/1 x7\n\nSPY $290/$291 Calls 5/29 x40\n\nI feel particularly nervous about my Disney 4/24 and SPY 5/1 call credit spreads because it looks like this bull run won't end anytime soon. Should I close them out Monday morning and cut my loses or hold them?", "id": "g4b12a", "created_utc": 1587315413.0, "score": 2, "upvote_ratio": 0.76, "num_comments": 11, "comments": [{"body": "If you want to defend your spreads, you can sell an opposite spread, and turn it into an iron condor to collect more premium, reducing your max loss", "score": 5, "replies": []}, {"body": "You should consider selling wider spreads as opposed to more contracts", "score": 2, "replies": [{"body": "What's the difference?", "score": 2, "replies": [{"body": "Your P/L curve is less steep, meaning instead of being at either max profit or max loss all the time, there's some room in between. Things just move slower and are less risky", "score": 4, "replies": []}, {"body": "Yes, wider spreads do move the break even prices in your favor a little bit but also increases max loss. I\\`d increase the spread width only for really deep OTM vertical spreads", "score": 1, "replies": []}]}]}, {"body": "Might be good on disney. Just stopped paying 100k workers.", "score": 0, "replies": [{"body": "Wouldn’t that free them up more capital to stay solvent?", "score": 3, "replies": [{"body": "Exactly my thoughts.", "score": 1, "replies": [{"body": "Possibly. But it also could be a sign of more to come and scare investors. Im holding a call debit spread right now. I'm fairly confident its not going to 110 this week. Got some sexy premium on it. I couls be wrong", "score": 2, "replies": []}]}, {"body": "Will definitely free up capital. But it also points to their lack of confidence in a quick economic rebound. Sure Disney+ is probably doing well, but it takes ALOT of $8/mo subscribers to come anywhere close to comparing to the 250,000 / day visitors to Disney parks.", "score": 1, "replies": []}]}]}]}
{"title": "PLAYS AND WHY SHOULD WSB FOLLOW:", "selftext": "What play you think is the best play you have and why should we do the same? It can be anything you’re holding or plan to hold and give your reason behind it. \n\n$MSFT 190 5/15 \nMicrosoft i believe after the rise of Tesla and Amazon will be following soon with their earnings coming. They were just awarded a 10 billion dollar contract from the department of defense. Their Microsoft Teams platform and Azure are doing quite well.", "id": "g3yaow", "created_utc": 1587256251.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 20, "comments": [{"body": "Most of wsb is bullish cause all the bears died 4/17. Always inverse wsb", "score": 22, "replies": [{"body": "So buy Puts cuz the bulls are running wild?", "score": 3, "replies": [{"body": "Look at the top 10 best posts, if most are bearish, buy calls ( spoiler alert, they are bearish)", "score": 2, "replies": []}]}]}, {"body": "MSFT ~~3/20~~ 5/15 200c. You weren't wrong, you were just early.", "score": 14, "replies": [{"body": "Gang!", "score": 1, "replies": []}]}, {"body": "I'm still scared to buy calls, the trauma is real.", "score": 3, "replies": [{"body": "Tell me if you do so I can switch to puts", "score": 2, "replies": []}]}, {"body": "UVXY 44.5c 4/24 - Big earnings week will cause expectations to come back down with a couple of shockers (looking at you, auto loans) driving crazy volatility and spiking VIX futures. \n\nI'm also a fucking moron, so none of this might be based on anything in reality.", "score": 3, "replies": []}, {"body": "How high are you?", "score": 2, "replies": [{"body": "5’9", "score": 3, "replies": []}, {"body": "Of course not officer.", "score": 2, "replies": []}]}, {"body": "problem is we are already peaking marketwise, any sp500 red days will make stock price drop 1-2 dollars. if we have a bear rally for a week or so before earnings we might get screwed. holding some 200c myself but honestly dont see them printing", "score": 2, "replies": [{"body": "Why do you think that would happen? What changed from the past couple of weeks? I would say people would be doubling down on AMZN, NFLX, MSFT, among others because of the ALL TIME HIGHS phase we are going through. Besides, MSFT just got their DoD contract being cleared to process (temporarily at least) and DoD pushed Teams yesterday to all their employees.\n\nThe marker is illogical, but it seems like everybody thinks the bottom is far gone. Everything looks good, Florida beaches are opening up, people will return to their work on May 1, and it seems like everybody is following that and is going through FOMO. I do not believe that we are done with this pandemic or economic depression, we are far away from bottom, but we won't see any effect on that next week.\n\nI might be trying to confirm my bias here, I almost lost it on Friday and was about to sell at a huge loss, but then there was an uptrend in the last 40 minutes. People believe this is the new low. Let me know what you think.\n\nMay God save us.\n\nMSFT 5/1 190c", "score": 3, "replies": [{"body": "Now that companies realize they don't need to waste money on office space because everyone can work from home, real estate is gonna crash. Then there won't be as much need for major construction projects and more blue collar workers will be laid off. We gone be fucked for a while.", "score": 3, "replies": [{"body": "I don't think WFH is that great myself. And we have seen literally 20+ millions of workers losing their jobs and that did not affect the market that much.\n\nI mean, I agree with you that we are going down like hell in the long run, but for this week, how is any of the previous 2 weeks any different?", "score": 1, "replies": []}]}, {"body": "on same boat as you but i fel like its a higher chance we tank than go up again...", "score": 1, "replies": [{"body": "could you share you reasoning?", "score": 1, "replies": [{"body": "He holds calls. That's his reasoning. Sounds about right based on my own experience lol.", "score": 1, "replies": []}]}]}]}]}, {"body": "Long uwt", "score": 1, "replies": []}, {"body": "Msft 200c 5/15 due to uptrend in charts and they will most likely crush it with earnings\n\nZm 5/15 95p zoom is overpriced and with news of economy opening back up it will correct, i may have been early though im going to cut my losses at -40%.\n\nAapl 5/8 320C- hoped to swing thia from friday until monday or tuesday. With pre sale orders up i think it may have been a good idea but im not sure.", "score": 1, "replies": []}]}
{"title": "Infinite Bail Outs, What to do", "selftext": "Here is a hypothetical scenario. The market crashes due to Corona and being a big buy back bubble. JPow bails out the market and it retraces up.  You are a big firm and you hold lots of shares and you sold hella OTM calls for big premiums. \n\nWhy not sell, drop down again, get bailed out again, and rinse and repeat?  It is clear Trump and Jpow will spend whatever it costs to keep the market propped up.\n\nWhat are your thoughts?", "id": "g3z9rl", "created_utc": 1587260305.0, "score": 29, "upvote_ratio": 0.85, "num_comments": 17, "comments": [{"body": "This probably isn't hypothetical", "score": 46, "replies": [{"body": "Not even a little.  This is highly probable.", "score": 22, "replies": []}, {"body": "This is guaranteed", "score": 5, "replies": [{"body": "iTs PrIcEd In", "score": 2, "replies": []}]}]}, {"body": "Easy, stat a company! Name it Gay Bear LLC, and get all the legal paperwork done to be a financial management consultant. Be your own client and transfer your funds to an account by the LLC. If your plays go tits up, apply for bailout money to pay your employee (you).", "score": 22, "replies": [{"body": "Stat a company..\n\nThis guy is definitely from Bahston.", "score": 12, "replies": [{"body": "stat a coumpany,\nbay some cahls,\nget bahled out by the fehd", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Strangles in the middle.", "score": 0, "replies": []}]}, {"body": "The whole 1, 2 punch that happened was once in a lifetime.  No one could have predicted it but now, the fact that every trader knows that the market is capable of bleeding itself to a standstill 3 days in a row, means that anyone who loves America and has disposable income is ready to give every bear day a fuck ton of resistance.  Loyal bulls just had 3 weeks of fuck you money to keep buying more calls because it's just been working. And the feds will still be involving themselves in the near term. \n\nI'm bear but seriously, buying calls is just free money and the feds are most likely doing all of this in hopes that corvid will get solved by their timeline and  don't forget about China.  Were the two leading economic powers on the planet.  But China might see this as opportunity to be number 1.", "score": 4, "replies": []}, {"body": "Obviously short the bank stocks!", "score": 2, "replies": []}, {"body": "Imagine this. You're the fed. You're wife is the market. Your wife's boyfriend is the backing industry.\n\n\"Hey I blew my fat load in your wife and she's pregnant. I'm not paying for an abortion\"\n\nWe're all cucks and nobody here is going to tell him to pay for it. We're going to foot the bill, smile, and get back in the closet to watch.", "score": 2, "replies": []}, {"body": "what do you mean? This is what we do.", "score": 1, "replies": []}, {"body": "i never understood why buy backs were allowed. it’s illegal in almost every other country.", "score": 1, "replies": []}, {"body": "I'm sure there are stipulation clauses in the bailout contract that make sure that the companies DO that again!", "score": 1, "replies": []}, {"body": "This is literally bank stocks every time there is a crisis. They had really bad positions in the market and got burned, but fed bails out their bad positions.", "score": 1, "replies": []}, {"body": "SPY $350c May 13", "score": 0, "replies": []}]}
{"title": "Balance Sheeeeeit", "selftext": "TL;DR- asset value losses for households likely will be magnitudes greater than last recession\n\nAn 8% loss in the value of assets held on Household balance sheet will be greater than the loss of asset values during 2007-09 in dollar terms.\n\nEstimation of equity allocation to total assets on balance sheet of households is 22%, or roughly $30 trillion by the way of direct ownership, Mutual Funds, and Pension Entitlements.\n\nTaking into consideration draw downs on deposit  accounts, losses in home values, proprietors’ equity, etc. I suspect a decline in asset values on Household balance sheets to be between 15-20%, or $21 to $27 trillion. This results in declines in assets on household balance sheets of 90-154% greater than 2007-09.\n\nEdit: for context, the loss mentioned above would still put household asset values well above 2007 peaks. My worst expectation would imply asset values on household balance sheets are reduced to a total of $108 trillion. At the peak of asset values in 2007, the amount was $85 trillion.\n\nEdit 2: I expect the decline in the value of assets on household balance sheets to primarily be in the financial category, as opposed to non-financial category (e.g. real estate), given current asset composition.\n\nEdit 3: this takes into account the accumulation of assets, such as deposits from wages, etc. The estimated decline is not just a function of asset price depreciation.", "id": "g46xzn", "created_utc": 1587299635.0, "score": 21, "upvote_ratio": 0.9, "num_comments": 19, "comments": [{"body": "Puts in June? July? August?", "score": 10, "replies": [{"body": "Any day ending with -y", "score": 11, "replies": [{"body": "You son of a bitch I’m in", "score": 6, "replies": []}]}]}, {"body": "But the market has bounced back a lot.  And people probably hold some % in bonds, which have gone up.  If the allocation is 50/50 they're even.\n\nWe don't know what houses are worth.  There won't be a wave of foreclosures, and when mortgage rates make their way down that will boost prices.", "score": 9, "replies": [{"body": "The market has, in April. Data is quarterly. We do know real estate market values by the way go FRB Financial Accounts- Z.1 data. Assumption on losses are over time, 24-36 months. \n\nAlternative is helicopter money increases which is highly possible. Fed likely won’t be able to prop up on their own.", "score": 5, "replies": [{"body": "Of course, I forgot, everyone does their household balance sheet on a quarterly basis so they won't know about April's run-up until 6/30.\n\nThe RE market is totally frozen.  If any transactions are happening, they're not normal market transactions.  Need to wait until the dust settles.  RE values could actually go up, dollar being printed into oblivion and stocks are a bubble, gold is useless bricks, RE looks like a better place to park money.  Especially when you can lock in an ultra-low 30 year rate, tax deductible.", "score": 3, "replies": [{"body": "Agreed on RE but only in select situations as an opportunity. Disagree on gold, though not a gold bull. Printing of money itself generates inflation in markets/assets where that money flows to, thus what we saw with QE.\n\nYou’re right though- early stages. Dust is still floating amuck.", "score": 1, "replies": []}, {"body": "Just a foreclosure here and there coupled with low inventory means appraisals will come back low and banks wont lend.", "score": 1, "replies": []}]}, {"body": "Sit on cash for 2 years...  check and check.  I don't think it's going to take that long for folks to start ditching assets.  FOMO will get people's blood pumping.  Jobs they once held with security aren't going to be there in 3 months time and they'll be tethered to a single point in their job hunting.  \n\nWe do not have a normal spring housing market season, so when things finally open back up, we will be looking at a supply surge in late summer/early fall with extra homes to boot and when supply outweighs demand and people are uncertain about what the future holds...  I'm just saying, from a layman, it's going to be sooner rather than later.", "score": 1, "replies": []}]}, {"body": "Appraisals for refis get lower- it just needs a few people to get foreclosed. Even if there is a market for purchasers willing to pay a higher price, banks wont lend on low appraisals.", "score": 1, "replies": []}]}, {"body": "My PS4 does not lose value in times of unemployment.", "score": 6, "replies": [{"body": "Buy a PS5 and support the (old) economy.\n\nEdit: but only on credit", "score": 6, "replies": [{"body": "I'm a patriot goddammit 🇺🇸", "score": 1, "replies": [{"body": "With you. La-Li-Lu-Le-Lo.", "score": 2, "replies": []}]}]}]}, {"body": "Didn’t read any of it besides the title but I wanted to add that Clay Davis’ll take *anybody’s  money if they givin’ it away.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Show me tickers", "score": 0, "replies": [{"body": "Long the Federal Reserve, ticker $BLK", "score": 2, "replies": []}]}]}
{"title": "Amazon to extend French warehouse closures after union dispute", "selftext": "So Amazon is definitively challenging the French way to treat US top tech companies (see recent huge fines to Google and Facebook). We can expect it doesn’t end with this virus issue, it is the first one to take strong positions against what they think is unfair treatment (the majority of French e-shops are permitted to remain open). How long until a US tech company decides to definitively move away from France or European Union which is acting quite the same way ?\n\nhttps://www.reuters.com/article/health-coronavirus-amazon-france/amazon-to-extend-french-warehouse-closures-after-union-dispute-idUSL8N2C70CY\n\nThink it’s a rush to their local competitor Cnova [CNV] then...", "id": "g47xwm", "created_utc": 1587304111.0, "score": 36, "upvote_ratio": 0.88, "num_comments": 11, "comments": [{"body": "Hey, there is an ongoing trade war between France and the US. Amazon has had 23M in Revenue from Europe last year and is expanding. This is the way for France to gain leverage versus the US after they taxes French goods. But this all started here: [https://www.theguardian.com/world/2019/jul/11/france-us-tax-big-digital-companies-donald-trump-amazon-facebook](https://www.theguardian.com/world/2019/jul/11/france-us-tax-big-digital-companies-donald-trump-amazon-facebook). \n\nImo, US tech companies need Europe more than Europe needs them. If they go, other companies will replace them.", "score": 10, "replies": [{"body": ">US tech companies need Europe more than Europe needs them.\n\nMay be so, but they will not be replaced by European companies. The system simply can't generate anything of that \"caliber\". So, Europe would have to choose between US and Chinese tech. And Chinese tech would rape us to death in the long run without us even being able to figure out how they screw us.\n\nAs long as EU doesn't have its own tech companies it's at the mercy of others, one way or another.\n\nBut more than that the whole EU system is so rigged and uncompetitive it will probably run itself into the ground anyways.\n\nEDIT: Amazon in Europe has delivery dates due 1 month from now. If this is due to low stocks, they can simply redirect all future stock allocated to France to Germany/Spain/etc. So, at this point they are the ones having the upper hand, because they don't need France at this point to sell the \"little\" stock they have.", "score": 8, "replies": [{"body": "Where are you from? Because Belgium and The Netherlands have a very big competitor to Amazon. It's even so strong I don't think amazon will ever break trough here. \n\nI don't know if other countries have similar competitors though.", "score": 10, "replies": [{"body": "This. Amazon is big in the U.S. but here in Europe I consider it a secondary player. Their pricing isn't as good as the Chinese and their delivery isn't as quick as their local competitors.", "score": 10, "replies": []}]}, {"body": "It’s a big player in France (not in Europe as a whole), but local competitors are really profitable by targeting niche markets and taking advantage from the smaller scale (France: VeePee, Cnova services such as Cdiscount [CNV]).\n\nThe question is to know if the French will give obvious advantages to locals which would have huge consequences internationally and even inside of France for people who support a free market, but this is part of a trade war started by the US a year or so ago (EU taxing top tech companies vs US taxing luxury goods and wine/champagne)", "score": 4, "replies": []}]}]}, {"body": "It's not so much a standoff and more the French getting what they asked for.\n\nFrance: Shut down your warehouses and only deliver essential items\n\nAMZN: k, What are essential items?\n\nFrance: idk lol\n\nAMZN: k, Since we don't want to be fined we just won't ship anything", "score": 5, "replies": [{"body": "That’s what they said, but it’s really a way to put pressure to change the fact they consistently get a special treatment (local e-commerce platforms are ALLOWED to sell non essential items). Like\n\nFrance: don’t take advantage of the situation to f*ck your competitors here,\n\nAMZN : all right so your people won’t be supplied in ANYTHING during quarantine then since our competitors third party deliveries are overloaded", "score": 5, "replies": []}]}, {"body": "Amazon should stay shut down.  Let the French screw themselves into civil unrest like they always do.  \n\nJan leap 3000c AMZN", "score": 3, "replies": []}, {"body": "Hopefully soon.", "score": 1, "replies": []}, {"body": "France is like China, in business.   You cant just go into France and open an office.  You need a local business to partner up with.", "score": -2, "replies": []}]}
{"title": "ZOOM Call This Evening Teaching Technical Analysis! 10 PM Eastern Time", "selftext": "[deleted]", "id": "g4b6kz", "created_utc": 1587315910.0, "score": 16, "upvote_ratio": 0.87, "num_comments": 18, "comments": [{"body": "Oh no I aint falling for this chaturbate trick again :(", "score": 17, "replies": [{"body": "Chatroulette dick compilation", "score": 2, "replies": []}]}, {"body": "My dick will definitely be in attendance on webcam, front and center, thank you for this opportunity!", "score": 6, "replies": []}, {"body": "At the end we showing our peepees like last time right?", "score": 4, "replies": []}, {"body": "Password protect shit bro", "score": 3, "replies": []}, {"body": "Sir, this is a taco bell", "score": 2, "replies": []}, {"body": "Zoom on a sunday.. nah bro sounds like work", "score": 2, "replies": [{"body": "its short and sweet and helps many learn to be profitable", "score": 1, "replies": []}]}, {"body": "I appreciate this man, will definitely be joining!", "score": 3, "replies": [{"body": "excited to have you bro! it has been a great learning experience for all of us", "score": 5, "replies": []}]}, {"body": "tldr? calls or puts", "score": 1, "replies": []}, {"body": "Oh fuck I’m in😂 \nSend me the lonk", "score": 1, "replies": []}, {"body": "Interested newbie", "score": 1, "replies": []}, {"body": "Crayons", "score": 1, "replies": []}, {"body": "Name checks out", "score": 1, "replies": []}, {"body": "Am a retard and waited too long to do homework due today. Would you please some how record yourself and upload it so I can watch it tomorrow?", "score": 1, "replies": []}, {"body": "anyone got link? post is deleted", "score": 1, "replies": []}, {"body": "So $ZM calls?", "score": 0, "replies": []}]}
{"title": "NFLX TA for upcoming few days", "selftext": "[deleted]", "id": "g4c80f", "created_utc": 1587319381.0, "score": 9, "upvote_ratio": 0.91, "num_comments": 15, "comments": [{"body": "It’ll get pumped a bit Monday & Tuesday before earnings but I think after earnings it will drop a bit", "score": 4, "replies": [{"body": "Yes if it doesn't drop now it'll stop after earnings", "score": 1, "replies": []}]}, {"body": "The premiums on NFLX mean it needs to nosedive of else Thetagang is the only winner.", "score": 3, "replies": []}, {"body": "Netflix is the bullish lock of the century. Easy money. Everybody knows they had a ridiculous amount of positive from the lockdown. And it’s because of that I’m staying far away from it. I can definitely see a lot of pissed off bulls come Wednesday morning. The sure bets are the worst bets.", "score": 3, "replies": [{"body": "Netflix earning is shit and they gonna drop. Jan feb and march 15 is normal. And march 15th to 30th is when lock down. 15 days. People watch more mean netflix cost more money. 15 day even they get a lot of subscription they cant get any money before 1st month is free. All the retard dont think buy netflix before q1 earning gonna get ass fuk.", "score": -2, "replies": []}]}, {"body": "Imagine using TA 🤡🤡🤡🤡🤡", "score": 2, "replies": []}, {"body": "NFLX is going to hit 480 before it hits 340. Good with with your trade.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Looks like I’m gonna be shorting the fuck out of Netflix this week", "score": 1, "replies": [{"body": "Balls of steel", "score": 2, "replies": []}]}, {"body": "Spy $300!", "score": 1, "replies": []}, {"body": "Made some nice tenders of nflx puts Friday but was in and out", "score": 1, "replies": []}, {"body": "I'm not reading all that shit.", "score": 1, "replies": []}, {"body": "NFLX doesn’t trade on earnings.  It trades on number of subscribers.  Imagine NFLX getting 50+ million new subs when the market expects 10.", "score": 1, "replies": [{"body": "Completely missed that. Thank you", "score": 1, "replies": []}]}]}
