{"title": "Long term calls on SPY, Theta and IV", "selftext": "I'm looking to buys long terms calls, just not sure when to enter the market, knowing that Vix and IV are very high right now. Also, I'm curious for whoever buying long term calls, wouldn't your theta and IV eat all your gains that you need the SPY to go real high to offset it?\nHow do you still profit of it?\n\nDo you need the market price to go up more than the market price when you enter to cover your theta?\n\nWhat is the good time to enter?is it when iv and vix all time low?\n\nWhat is otm % and date that is good to enter? I'm looking like 1 year ahead 50% otm but feel like it is too much.\n\nIs ITM better than OTM?\n\nThanks for helping.", "id": "fz7eej", "created_utc": 1586618492.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 18, "comments": [{"body": "Nothing is too much. Don’t worry about the Greeks. The best time to buy is EOD if the stock price is below the OPEN. \nGetting OTM means your gains decay over time quickly and your losses get bigger over time. That’s why it u get OTM always get 1 year or even 2 years. Gives u more time before the decay start to hit u hard. \nI got a 470c of BA for 01/22 last 3 weeks when the stock was around 120’ and I sold that call this week when BA was around 163’ I made a lot of money from that. It’s true it’s hard for your SELL order to fill since the strike was 470, but there are plenty of idiots out there would buy it. I have another 410c 01/22 that I’m planning to sell once BA reaches 250 ( 9 contracts that would generate 13K profit ) on or before August. If it doesn’t, I’m selling anyway. Only reason I got this far OTM is for time decay. If I had a lot of buying power I would buy like a lot of contracts 180c for August or July.", "score": 3, "replies": [{"body": "Is it more challenging to sell? Is it less bidders?", "score": 1, "replies": [{"body": "Sometimes it is. But you can sell when the stock price is at its highest. Lot of volatility at that moment. \nAlso you can keep trying to fill your order, if you are already up a lot and u have decent profit, it realy does not matter if ur profit does free dollars because if the fill. Keep selling the call until it gets filled. \nIf my 470c is on sale when the stock price is at 220 for example, don’t you think some people are trying to buy a 470c for a year or two ahead. \nThe aim of buying my 470c is not for the option to become ITM lol it will never become ITM, the only aim is to give my self couple months for my strategy to work and the price to reach my target based on how much profit I want. I’m not looking for 2000% of whatever, I’m taking decent profit with less risk by buying that far OTM with that far of a period. \nAs of now on ETrade I have a 220C 01/22 DIS / 90C UAL 01/22 / 35C CCL 01/22 / 25C OXY 01/22 I have other stuff on RH and Fidelity.\nAll the calls I made are up like 2000$ combined. I can sell now for profit but that’s not my target. My target is 10K profit combined, means once my total equity reaches 10K I will sell everything.", "score": 3, "replies": [{"body": "Thanks, makes a lot of sense to have a strong exit plan, it is very helpful. Any good resources I can learn more about leap options?", "score": 1, "replies": []}, {"body": "Thanks for the great post, gives another aspect of profit taking instead of aiming for 24432% gains lol.", "score": 1, "replies": []}]}]}]}, {"body": "Most of your questions are missing the bigger point... that you are trading for the purpose of making a profit. So let me zero in on your thinking here:\n\n\"What is the good time to enter?is it when iv and vix all time low?\"\n\n&#x200B;\n\nTiming is important. Also important is HOW you choose to open your position. IV being high or low doesn't tell you whether or not to be long SPY... but it does give you clues as to which strategy might be most profitable if you decide you do want to be long SPY.", "score": 2, "replies": [{"body": "Thank you, I understand that there are so many strategies, options still relative new to me.\n\nI don't have risk tolerance for naked calls/put$ nor capital for   cash secured.", "score": 1, "replies": []}]}, {"body": "I learned most of it just on groups here. Follow what people gain and lose, the best training u can get us screen time, they more your eyes can digest of charts, posts, news etc the more professional u become. I’m not an options trader, I’m a day trader and I make some money day trading but I use options as if I use leverage, because I don’t like using leverage for day trading, but options are like leverage with a fixed loss. If I day trade with leverage I can lose all my equity in 1 trade. But with option,  a simple call or put has a fixed loss, so even if the company goes to zero, my loss is limited, but if the company goes to the moon, my gains are X150", "score": 1, "replies": [{"body": "Thanks, really appreciate your helps.", "score": 1, "replies": []}, {"body": "Going back to your 10k target, would you mind tell me how many % of profit is this? I don't wanna set unrealistic or too greedy target.", "score": 1, "replies": []}]}, {"body": "tbh i dont think you should be buying calls now , because the market is just shit and the world is going to shit and no one knows how long this recession will last ....so shouldnt be buying calls , watch how the market plays out , expecting a drop", "score": 1, "replies": [{"body": "I'm waiting for the next drop, just get myself ready to open the position, mostly curious how Vega and theta affect your long term contracts, and otm vs itm.", "score": 1, "replies": [{"body": "Next drop will push vol way up so you will have to wait even longer to long calls. Sell put spreads instead.", "score": 1, "replies": [{"body": "Will look into put spread. Is selling put spread mainly for collecting premium?", "score": 1, "replies": [{"body": "Yep. Look up a bull put spread. Sell a leg and buy one that is further out. You keep the difference in premium .", "score": 1, "replies": []}]}]}]}]}, {"body": "You can buy a SPY at 90 delta and you will minimize the effects of volatility on your position. This would be considered a synthetic position that is cheaper than owning the stock. Theta decay accelerates rapidly at less than 30 days so buy options further out than that to give yourself time. Of course these deep in the money positions cost a lot more $$$ so that is a downside.", "score": 1, "replies": [{"body": "That is one thing that makes it less attractive about buying itm, capital vs contract volumes.", "score": 1, "replies": []}]}, {"body": "Minimize theta by staying at least 45 days out. Volatility only impacts extrinsic premium so go 75 Delta or higher.", "score": 1, "replies": []}]}
{"title": "Need an opinion from you guys.", "selftext": "So from what I've been gathering today from the internet and this sub, I'm seeing more and more people recommend investing in airlines on Monday. I was thinking about buying some AAL stocks, but I want to hear from you guys on if it is worth it or not.", "id": "fyv3gb", "created_utc": 1586573749.0, "score": 2, "upvote_ratio": 0.76, "num_comments": 12, "comments": [{"body": "Trust your gut, two weeks ago you couldn’t find a single schmuck on this sub saying that the airlines were a good buy. Nobody knows anything in this market lol", "score": 5, "replies": []}, {"body": "Please do not  invest in Airlines until you hear the details of the bailout.  It likely will be announced on Sunday but until you know if it will hurt stockholders or will come with equity or warrants owned by the Govt you can't invest.", "score": 3, "replies": []}, {"body": "Even warren buffet sold his airline stocks....", "score": 2, "replies": [{"body": "I've done some research on this. Berkshire Hathaway sold \\~10% of its $DAL shares and 3% of their $LUV shares last week. It's not like majority stakeholders are dumping all their shares but they might be doing some trimming due to the uncertain outlook. That being said $AAL has some of the worst financials of the big players. I would look at $LUV, $DAL or even profitable budget airlines like $SAVE and $ALGT.", "score": 1, "replies": []}]}, {"body": "Dude Airlines are risky as hell. There are other stocks going cheap for companies that are necessary with or without COVID.", "score": 1, "replies": []}, {"body": "Shipping stocks is where it’s at right now", "score": 1, "replies": []}, {"body": "I've seen lot of airline companies go down .. airline companies are first to be hit during the recession as they need lot of funds to keep running their business .. if not backed by the fed then there could be lot of uncertainty", "score": 1, "replies": [{"body": "Having said that, I'm pretty sure that the feds would do their every best to back their #1 airline company .. so the worst that could happen is your money being stuck for long time till things become stable", "score": 1, "replies": []}]}, {"body": "DAL has been pretty solid this week. Next week possible retest to 24 and an upside trend from there.", "score": 1, "replies": []}, {"body": "I don't know about AAL, but id stay the hell away from delta. Southwest will get through this. However, whatever you do choose to buy is definitely gonna go up. With the infinite money cheat code, nothing is gonna go bankrupt in the foreseeable future.\n\nGood luck, dude", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I was thinking the same , they look way better than any airline in my opinion.", "score": 1, "replies": []}, {"body": "Lol, they’re burning through 60m A DAY. Have very little cash in hand, lots of debt. No one will be flying anytime soon, even if the stay-at-home order was lifted tonight, they’re gonna have very few incoming customers. \n\nThey also spent a large portion of their profits this past decade doing stock buy backs and now it’s gonna destroy them. Trump said he’s not gonna bail out companies that did that... so. Yeah...", "score": 1, "replies": []}]}]}]}
{"title": "Is there another bear market coming anytime soon ? What's your next move ?", "selftext": "Hey folks,\n\nSo I got to admit that I jumped into stock market quite late and should have ideally been here in the march season when the stocks had seen a rock bottom hit ... I mean this would have been an ideal time to stock in the blue chip stocks .. and apparently it appears now that the stocks are getting back to normal ( though not to the initial norm ) .. I'm tempted to know what you'all feel about the current situation and whether there would be another bear market in coming times ..\n\nCurrently my strategy is that I'm tracking around 100 companies with an alert set for low points seen for the companies in march .. I'm hoping that theres another opportunity that I'd be able to make use of and buy some stocks for long term.. any thoughts ..?", "id": "fzj5a1", "created_utc": 1586639125.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 18, "comments": [{"body": "Everyone is asking each other the same question. Anyone who says they know what's going to happen in the next 3 months is full of shit. You have to make your own decisions.", "score": 8, "replies": [{"body": "Lol yeah agreed .. but I guess we can still exchange ideas, opinions,  strategies etc and keep our fingers crossed :)", "score": 2, "replies": [{"body": "Aye man dm me we can swing trade this week, we can be a little team. I’m no expert but been doing well on blue chip swings👌🏽", "score": 1, "replies": []}]}]}, {"body": "I believe that given how the markets have been behaving the only thing that would make the market go down is a need for liquidity by the investors", "score": 5, "replies": []}, {"body": "I think there will be another dip again but not as low as seen around 23rd march. As market is so volatile at the moment would be very surprised if this didn't happen but don't know when! Might be next week or next month. One thing for sure... if there is a big recession some companies will definitely drop further.", "score": 5, "replies": []}, {"body": "March wasn’t even that low.\n\nIf the market doesn’t take a leg down, it just further proves that it doesn’t work.", "score": 6, "replies": [{"body": "That's how I feel. I appreciate the percentages, but don't really feel the March bottom was much of one at all. I'm surprised it didn't go lower.", "score": 3, "replies": []}]}, {"body": "That depends on how many waves the US is gonna see in this pandemic. We get 2 or 3 waves of infection with higher magnitude of virulence, the economy will be shut down over and over and over until the Feds have run this country into the dirt.", "score": 3, "replies": []}, {"body": "Not gonna see quite those low. I'd set alerts 15% higher", "score": 2, "replies": []}, {"body": "Unless the bear can defeat fed, which is unlikely", "score": 2, "replies": []}, {"body": "You would shitting your pants and too scared to buy back in March lol", "score": 2, "replies": []}, {"body": " honestly if you haven’t invested already I would hold off right now.  Thursday Warren Buffett dumped 30 million dollars of Bank of New York stock (NYSE:BK).  If Warren Buffet is bracing for a huge drop that alone could be enough to scare investors to sell. I personally invested money into Bank of America (BAC) and Brookfield Asset Management (BAM) last week and am asking the same question on whether to sell or hold on.  Long term the market will recover but short term anything is possible.  I took a gamble and invested 2,000$ in PLAYAGS when it was 1.70 per share and now it is sitting at 3.19 a share in just a few days.  I don’t know whether to invest more or sell it off... the market is nuts right now.  Stimulus checks are being deposited the 15th of this month so you think that would mean the market going up more before dropping again but it is impossible to know...", "score": 3, "replies": [{"body": "Yeah even I read the news about Warren Buffett selling his millions of his shares but that attributed to airlines and banking shares only from what I read .. airlines industries as far as I know have a heavy running cost and they literally run paycheck to paycheck .. So if theres long disruption theres no way it could sustain without crying before the feds .. Same thing with banks .. In Canada banks were being extremely generous in giving away mortgage loans on a very small rate but now with the slowdown and unemployment ppl are gonna find it difficult to repay .. something that happened during the 2008 recession ..\n\nI guess the best bid would be wait for invest in things that wont be impacted such as retail, energy. Even alcohol, cigarettes and marijuana.. I was watching a video of a seasoned investor who said cigarettes are best winners during recession which totally makes sense lol", "score": 1, "replies": [{"body": "I was reading into this as well.  Bottom line if your thinking long term, if you see a company that you believe is undervalued and they look like a company that will grow then invest and hold your shares for a year no matter what the market is doing.  If they are indeed a successful company then you are almost guaranteed to see a profit.  And with the market being so low right now it is still a good time to invest.  Short term you are in for a bumpy ride as Coronavirus news pretty much controls the market.  (Or if a presidential candidate drops out) haha I guess Bernie caused that rally on Thursday from what I’ve read.", "score": 1, "replies": []}]}]}, {"body": "It’s funny all we heard these last few years was a recession is coming a recession is coming...... now we are facing the reality and the same ppl saying it was coming are screaming for the FED to do anything to prop up theirs assets\n\nAssets inflation= good \n\nWage inflation= bad", "score": 1, "replies": []}, {"body": "> I'm tracking around 100 companies with an alert set for low points seen for the companies in march\n\nYour alert will never come. The infinite QE train has left the station on 23 March and you've missed it", "score": 1, "replies": []}, {"body": "I sold some of the stocks I am not attached to, have a good bit of cash which will be used when the prices go down a bit.\n\nHeld most of my stocks though. I'm sure it'll go down again but in 2021 they'll be higher than they are now and trying to predict the bottom is too difficult\n\nI highly doubt you'll see lows comparable to March anytime soon though.", "score": 0, "replies": []}, {"body": "I wish op would get punched in the fucking teeth for making another Mrs. Cleo post about the future. Plz someone.", "score": -1, "replies": []}]}
{"title": "Should I buy microsoft stock since its low and seems to be going up", "selftext": "[deleted]", "id": "fyxckt", "created_utc": 1586583388.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 20, "comments": [{"body": "It's where it was in late January.\n\n\n\nIs that low?", "score": 7, "replies": [{"body": "I wasn’t thinking about it in January but it’s lower than it was before the economy took a hit", "score": -5, "replies": []}]}, {"body": "I think Microsoft is a pretty good buy with a great future ahead. Since you're just starting you may want to check out qqq which is heavily weighted towards tech with Microsoft as one of their holdings. This gives you alot more diversification than one stock.", "score": 3, "replies": [{"body": "Okay I will check it out thanks", "score": 4, "replies": []}, {"body": "What about SQQQ and TQQQ? I see the share price is different but what is different about the stocks? Diversified differently?", "score": -1, "replies": [{"body": "SQQQ is a 3x leveraged inverse ETF that tracks the Nasdaq 100. TQQQ is also a 3x leveraged ETF designed to track the Nasdaq 100. I don't buy either of these personally but from what I know these are more for short term trading so I stay away", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}, {"body": "Microsoft isn't that low right now.  I was lucky to catch it at $135 but there are better undervalued stocks out there if you take some time to find them. Microsoft bounced pretty quickly but at the same time they Are never a bad buy.  I'd just rather take this time to grab undervalued stocks and then grab some Ms as things return to normal later on, or better yet after another dip.", "score": 2, "replies": [{"body": "I think this is the lowest it’ll be in a while so I’ll buy ASAP", "score": -3, "replies": [{"body": "Maybe.  But there are other tech stocks still vastly undervalued.  Why buy microsoft at a slight discount when you can get another great company at a great discount?  To each his own.  I like to get value when I see these crashes.  But you can't go wrong with m$!", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Rtx nvta qcom glw are some that I feel are at a vast discount right now.", "score": 0, "replies": []}]}, {"body": "which ones, interested as well", "score": 1, "replies": []}]}]}]}, {"body": "I would diversify your risk. Just buying a singular stock is just a waste of time in my opinion. Put together a couple stocks in different industries to grow your portfolio. Magic number for me is 5 different stocks", "score": 1, "replies": [{"body": "Yeah I was thinking of other things too but in terms of tech that’s what I was thinking", "score": 1, "replies": [{"body": "Microsoft’s beta is closer to 1.0 so it’s going to mimic the market, so yeah go for it.", "score": 1, "replies": []}]}]}, {"body": "Microsoft is a solid stock to own. Its not going anywhere for awhile.  They sell software, lots of businesses are using Microsoft Teams now because remote working. They have new Xbox console coming up and they focus on software overall. Its the only business that will recover quickly from this corona thing.", "score": 1, "replies": [{"body": "That’s a good point thank you", "score": 1, "replies": []}]}, {"body": "MSFT went from a blue chip to a blue chip + growth stock, which means if you believe in cloud and tech in general as the future, it'll be a really good buy even at these levels.", "score": 1, "replies": []}, {"body": "Same level as 2 months ago, while the world came to a standstill. \"organic growth\"!\n\nAll this small to medium businesses that ate going bankrupt will affect the Microsoft sales significantly", "score": 1, "replies": []}, {"body": "did u end up investing? you like doubled ur money i think", "score": 1, "replies": []}]}
{"title": "What would you rather long term :", "selftext": "(1) Amazon \n(4) Tesla \n(20) Disney \n\nLooking to move around 2g. Which would you prefer to have.", "id": "fyy2cx", "created_utc": 1586586367.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 16, "comments": [{"body": "Disney more room to grow especially since they’re down \n\nTesla is extremely overvalued \n\nAmazon is solid with steady growth but I think you’ll get more return on Disney", "score": 8, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Okay fucko do you’re research and do a DCF analysis on Tesla and you’ll find that a fair share price is about $240 and their last close was $573. The market has high expectations for the stock which in turn drove the price up and with a P/E of -114 they’re losing money but their share price is still going up. Be my guest and put money into TSLA when DIS the the better choice by far.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Agreed, Amazon seem to be stable but also have a lot of room for growth. They are virtually everywhere and increasing their presence on everyday needs that people have. Disney is great but Amazon seems to have more growth in future.", "score": 3, "replies": []}]}, {"body": "Share amount is irrelevant. If you had 2Gs, put into each and they all moved at 10% you make the same amount of money regardless of shares held.\n\n....Amazon....", "score": 3, "replies": [{"body": "Yup I get that. Just putting the numbers next to it just to illustrate my investment target was around 2g.", "score": 1, "replies": []}, {"body": "For non-dividend paying stocks, yes, but for those who don’t have enough cash and need to incrementally buy, Amazon’s stock price can be an issue.", "score": 1, "replies": [{"body": "No", "score": 2, "replies": []}]}]}, {"body": "I would personally put the $2000 in an ETF like QQQ.", "score": 3, "replies": []}, {"body": "Between the 3 I would pick AMZN. But I actually like MSFT a tad better. Maybe even T.", "score": 2, "replies": [{"body": "Wow thanks wasn’t even in my mind", "score": 1, "replies": []}, {"body": "You got my brain rolling too, if I included Apple in the mix how high would you rank it.", "score": 1, "replies": [{"body": "It's really hard to rank them exactly, things are always changing but I do like AAPL. Actually better than Disney and Tesla. But I'm definitely no Pro!", "score": 2, "replies": []}, {"body": "And why pick just one? Thankfully we now have the opportunity to buy in fractional amounts so just divide your money up how you want to percentage-wise. I use Fidelity as my online brokerage.", "score": 2, "replies": []}]}]}, {"body": "Banks are businesses, Tesla is a business DCF is a more accurate representation of judging a companies worth the looking the their share price and being like, “Apple is overvalued and Tesla is overvalued so I’m gonna put all my money in Tesla.”", "score": 2, "replies": []}, {"body": "Disney. \n\nMore room to move.", "score": 2, "replies": []}, {"body": "Tesla- higher risk more growth potential", "score": 1, "replies": []}]}
{"title": "DJIA and U.S. COVID deaths per day will converge near 15,000 on approximately April 20th.", "selftext": "By prematurely presenting the best-case scenario U.S. deaths-per-day as the peak, public expectations have been set at an unrealistic level; when contrary to widespread expectations deaths continue to climb through the month of April, eventually the mounting death rate will meet a receding Dow and achieve a 1:1 ratio.\n\nTL;DR Keep your powder dry.", "id": "fz4gw2", "created_utc": 1586609122.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 16, "comments": [{"body": "Mods should take this opinion trash down", "score": 20, "replies": [{"body": "It represents a starting point for a discussion on the matter, or it would if you cared to engage, it isn't clear how asking the topic to be censored serves any interest.", "score": -13, "replies": [{"body": "Fear mongering with no facts does not start discussion, pal.", "score": 5, "replies": [{"body": "I don't see any resort to emotions in the post, or any exhortation to become emotional or fearful.  I am sorry if I have frightened you it was not my intent.", "score": -1, "replies": []}]}]}]}, {"body": "I'm a doomer but even I think this is too pessimistic.", "score": 4, "replies": []}, {"body": "Thank you Chairman for your service.", "score": 4, "replies": [{"body": "I always do my best to serve us.", "score": -1, "replies": []}]}, {"body": "And my crystal ball says that it will snow on Easter Sunday", "score": 2, "replies": [{"body": "I snowed here yesterday", "score": 1, "replies": []}]}, {"body": "What's the source m8?", "score": 3, "replies": [{"body": "The model being used to project now as the peak is the most favorable one of many.\n\n[https://www.washingtonpost.com/health/2020/04/06/americas-most-influential-coronavirus-model-just-revised-its-estimates-downward-not-every-model-agrees/](https://www.washingtonpost.com/health/2020/04/06/americas-most-influential-coronavirus-model-just-revised-its-estimates-downward-not-every-model-agrees/)\n\nAs per the Thursday White House press conference, while the projected deaths are decreasing, the confidence interval is increasing rapidly.\n\nTaking the best case scenario, with increasing uncertainty, and putting it out there as a peak is reckless.  Living in the U.S. region most impacted by Covid, where acquaintances and neighbors are affected, I can say that while the infection can lead to rapid hospitalization, the deaths tend to come slow rolling in a week or two after hospitalization as people on ventilators eventually fail.\n\nAlso if you look at Spain and Italy for example, who have been at this a little longer but have some comparable value, you see that approximately 10% of confirmed cases by now are deaths.\n\nJust taking the 500,000 U.S. confirmed cases so far, with no new infections or no new confirmations of infections, and rolling out the deaths that are already \"in the pipeline\" for the next week or two we would likely be looking at 50,000 deaths.\n\n[https://en.wikipedia.org/wiki/Template:2019%E2%80%9320\\_coronavirus\\_pandemic\\_data](https://en.wikipedia.org/wiki/Template:2019%E2%80%9320_coronavirus_pandemic_data)\n\nAlso, Chairman POWPowell says so.", "score": 0, "replies": []}]}, {"body": "what does this mean, 15k deaths per day?", "score": 1, "replies": [{"body": "I don't think we'll get near that point. I mean if we do its a wrap lol", "score": 2, "replies": [{"body": "As a peak, not as a long term sustained death rate.", "score": 2, "replies": []}]}]}, {"body": "Fake news", "score": 0, "replies": [{"body": "Yes, you summarize my position exactly.", "score": -2, "replies": []}]}]}
{"title": "How is this portfolio?", "selftext": "Microsoft\nAmazon\nJohnson & Johnson\nVisa\n\nSmall but it feels right to me.", "id": "fz4ywz", "created_utc": 1586610769.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 16, "comments": [{"body": "Fine? Strong companies, but not much risk.", "score": 5, "replies": [{"body": "Agree", "score": 1, "replies": []}]}, {"body": "Great blue chippers.  Moreover, I highly recommend the following:\n\n[https://www.youtube.com/watch?v=dQw4w9WgXcQ&feature=youtu.be](https://www.youtube.com/watch?v=dQw4w9WgXcQ&feature=youtu.be)", "score": 4, "replies": [{"body": "So, roll with the market and never give up my stocks and they'll never let me down. \n\n&#x200B;\n\nGot it.", "score": 3, "replies": []}, {"body": "Why has this song became so famous all of a sudden ?", "score": 1, "replies": [{"body": "I actually made a video answering that exact question: [https://www.youtube.com/watch?v=dQw4w9WgXcQ&feature=youtu.be](https://www.youtube.com/watch?v=dQw4w9WgXcQ&feature=youtu.be)", "score": 1, "replies": [{"body": "Never give up", "score": 1, "replies": []}]}]}]}, {"body": "Needs more $TSLA", "score": 6, "replies": []}, {"body": "Solid companies.. pretty good to me.", "score": 2, "replies": []}, {"body": "+29% 2019\n+54% 2020 so far (was +75 but short squeeze is on)", "score": 1, "replies": []}, {"body": "I have 3 of those stocks as 3 of my 5 largest holdings.  MSFT and AMZN are up YTD and JNJ is nearly up YTD (like \\~2% down).  Can't go wrong long term.", "score": 1, "replies": []}, {"body": "Great companies, solid and stable. Low volatility IMO, but I’d explore into more companies that have larger growth potentials than these blue chips.", "score": 1, "replies": []}, {"body": "If you're in Visa may as well get into Mastercard. Stronger financials.", "score": 1, "replies": []}, {"body": "Looks fine to me. Most will go up when the market is good and drops less when market is down.", "score": 1, "replies": []}, {"body": "You have no diversification.", "score": -3, "replies": []}, {"body": "Doomed to failure. Youre better off digging a hole.", "score": -6, "replies": []}]}
{"title": "I would like to invest in a grocery delivery service co. but can't find any options. I see this industry continuing to explode.", "selftext": "Instacart appears to be private & treats employees terribly. Shipt is owned by Target, I don't trust Target to have strong #s during a recession. Anyone know of any other grocery delivery companies that are public?\n\nAlso, im bullish on grocery stores in general.. purple are going to eat in so much more even when Coronavirus is under control. Habits are being created.", "id": "fzccxr", "created_utc": 1586628603.0, "score": 3, "upvote_ratio": 0.81, "num_comments": 10, "comments": [{"body": "AMZN now owns Whole Foods with a Prime delivery service. They’re likely going to continue trending. In fact, this whole thing plays to Bezos’ strengths. I know it’s expensive but might be worth it.", "score": 3, "replies": [{"body": "Yeah Amazon is an interesting one. They are positioned so perfectly but im still concerned sales revenues tank in a recession/ depression. More people will use delivery but most will lose discretionary income and move to buying essentials only.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "So sprouts would be more of an investment in a grocery store that is doing delivery inhouse right? I am bullish on grocery stores too but feel sprouts might be too expensive of a store during a recession/ depression. \n\nI do like it tho, especially in short term. So many people are moving from eating out to eating at home and i think we will see permanent culture shifts in this area.", "score": 2, "replies": []}]}, {"body": "Amazon", "score": 2, "replies": []}, {"body": "Postmate is et to have IPO sometime this year possibly", "score": 2, "replies": [{"body": "Not as possibly as ur mama\n***\n^I ^am ^a ^bot. ^Downvote ^to ^remove. ^[PM](https://www.reddit.com/message/compose/?to=YoMommaJokeBot) ^me ^if ^there's ^anything ^for ^me ^to ^know!", "score": 1, "replies": []}]}, {"body": "Target owns shipt. One of the reasons target has exploded last year or 2", "score": 1, "replies": [{"body": "I love shipt as a business model .and Target left them as an independent subsidiary....but I'm afraid Target is going to be affected by the recession as well and will have lower revenues at all of their stores.\n\nBut maybe im wrong, i know they are moving to delivery and store pick up and can probably make up for lost sales from lost discretionary income by their delivery model.", "score": 2, "replies": []}]}]}
{"title": "Too late to invest in a dow index fund?", "selftext": "I've got 500$ ready and I want to invest in Dow, but I think it's to late to invest or Dow might just sink completely. If I do invest, I need to sell by April of next year so I really don't know what I should do. Any advice?", "id": "fzgmcu", "created_utc": 1586634576.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 10, "comments": [{"body": "If you only have 500 and you can’t float it for more than a year, don’t worry about stocks", "score": 19, "replies": [{"body": "Probably the realest advice on this. Sub. Investing in a roth ira would be a better use of your money than buying individual stocks. Or simply holding on to it. Everyone isnt always in the right position to buy stocks. If you only have 500 to spare, I'd say hold it as your rainy day fund or go with a retirement account.", "score": 3, "replies": []}]}, {"body": "Put it into a savings account if you need it within a year. Stocks are minimum 3-5 years.", "score": 9, "replies": []}, {"body": "buy a few beers and have a nice evening", "score": 5, "replies": []}, {"body": "If you need the money a year from now, I’d purchase a bond or put it into a money market account. If you invest in an S&P 500 index fund, there’s a chance the market will fall and you’ll lose on your investment. Then you’ll be in a worse financial position. Essentially, you’re gambling that in April of 2021, the market will be much higher than it is now. Don’t gamble, invest intelligently. Either put it in a savings account, money market or purchase a bond.", "score": 2, "replies": []}, {"body": "Are you dying tomorrow??? That may be the only reason it would be too late...", "score": 1, "replies": []}, {"body": "No one really knows what will happen in the next year to the market. It can double, tank or stay the same. One thing is for certain if you can't afford to invest the 500$ don't. Invest half keep the rest as cash or don't invest anything at all. If you can afford it invest it and continue to invest using the dollar-cost average (DCA) method over the span of your investing career.  Continually adding to what you start with.", "score": 1, "replies": []}, {"body": "Buy options on margin. Pick up or down or straddle If you think volatility will go up. Reverse straddle If you think V it’ll go down. \n\nWith $500, you gotta yolo.", "score": 1, "replies": []}, {"body": "Why would it be too late?  Too early if anything.", "score": 1, "replies": [{"body": "Delusional", "score": 0, "replies": []}]}]}
{"title": "Tesla Virtual Power Plant In Australia Outperforms Expectations", "selftext": "", "id": "fyunrz", "created_utc": 1586572311.0, "score": 152, "upvote_ratio": 0.98, "num_comments": 9, "comments": [{"body": "I know the cost for solar and batteries isn't really where it needs to be, solar is the cheapest form of energy generation available, but when you add in batteries it's not really price competitive anymore. However when you look at the overall benefits of massively simplifying the grid, having it be completely modular, reject disturbances and renewable, then maybe you just say \"fuck it, just spend the money\". Like in the past weeks we've seen that money is just meaningless, we pay billions of dollars to airlines to fully staff empty airports and fly planes with no passengers, solar + batteries is like the first technology capable of fully replacing coal. Why not just commit? Costs will probably drop in the future and it's only like 1-3x the price atm I think.", "score": 21, "replies": [{"body": "I agree with you that for the average homeowner it doesn’t always make financial sense, but this isn’t the average homeowner really. It’s a combination of 1000+ and eventually 50,000 homeowners. \n\nWhen you start getting to this kind of volume the batteries are totally economically viable. At the power plant scale they are designed to replace gas peaker plants and those are enormously expensive to run. Look into the specifics of the hornsdale battery in South Australia and see how much sense it makes. \n\nIt can also take up to 15 minutes to spin up a peaker plant and the batteries can do it in milliseconds.", "score": 2, "replies": []}]}, {"body": "Seems like a sensible solution.", "score": 12, "replies": []}, {"body": "Sounds awesome but reading that evaluation was way over my head!", "score": 5, "replies": []}, {"body": "Mark my words, teslas first move in to both the retail & whole power markets", "score": 5, "replies": []}, {"body": "AC is like a bike that pedals 60 cycles/sec.  The batteries can slow it by adding load (charging), or speed it up by adding power.  This balances the power generated by wind and solar.", "score": 5, "replies": []}, {"body": "If you listen carefully, you can hear chairs being thrown in the Executive Suites at *The Australian*.", "score": 2, "replies": [{"body": "lol +1 from a fellow Aussie :P", "score": 1, "replies": []}]}, {"body": "> During this event, the largest generating unit (at Kogan Creek in Queensland) in the National Electricity Market (NEM) tripped off unexpectedly from 748 MW\n\nIt's not spelt out in the article but Kogan Creek is a black coal power station. There have been quite a number of incidents recently of Australia's coal power stations failing, particularly on very hot days. Kogan Creek is actually one of Australia's newest constructed power stations (commissioned in 2007) and is touted as being superior and newer tech. But however they try to dress it up, burning coal is primitive, Victorian era technology, and it's insane that we are still building coal fired power stations in the 21st century.", "score": 2, "replies": []}]}
{"title": "Apple Calendar Spread Thoughts", "selftext": "Apple is undervalued. Period. It’s Apple. Come on. It’s trading at $269 as of now. I can buy an ATM call in September and continuously sell puts against it to bring my cost basis to $0 for the option. \n\n\nIf at expiration (hypothetically), Apple is trading at $310, I can sell another option near the strike and profit the $40x100 shares x however many spreads? \nIs there anything I am missing?", "id": "fzg3x3", "created_utc": 1586633863.0, "score": 19, "upvote_ratio": 0.8, "num_comments": 19, "comments": [{"body": "You will still need to either trade on margin or cash secure. If your hypothesis is wrong, and AAPL trends down, the call is worthless and you'll be assigned.", "score": 22, "replies": [{"body": "Yeah buying calls and selling puts assume Apple (which is up 34% YoY right now) will only go up.   \nBuying stock and holding it is one thing because yeah they are huge with massive cash on hand and will almost certainly weather this storm...but selling calls and buying puts is a recipe for losing all of that money.", "score": 7, "replies": []}]}, {"body": "Why would you buy a call and sell puts at the same time? This creates a synthetic long position. If you mean sell the calls against the strike until September, yeah that makes a lot of sense", "score": 13, "replies": [{"body": "My apologies for the lousy explanation. Basically at expiration (if this goes to plan) it’ll turn into a massive debit call spread. But, I do plan on holding until expiration so creating the synthetic long while continuously selling calls against it, expiring OTM will let me continue to collect premium while lowering my cost basis overall? Is this correct?", "score": 2, "replies": [{"body": "Selling calls against the long call is just a diagonal debit spread and that’s a strategy I like. But selling puts is a completely different strategy. You’ll be on the same direction. Selling the calls creates a light hedge in terms of protecting downside risk", "score": 13, "replies": [{"body": "Yes OP has no hedge against a very real downside.  \nEspecially after a record breaking bear rally. OP is buying into the euphoria and mania whole hog and is literally taking the meme of “stocks only go up” seriously.", "score": 13, "replies": [{"body": "I honestly don’t know where the market is going. I bought a September 270 spy put and may begin selling puts further OTM in the process to reduce theta exposure. But I’m not bearish on this counter rally from the initial drop off to continue", "score": 2, "replies": []}]}]}]}, {"body": "Selling puts would be fine too if you’re okay with picking up a few shares along the way", "score": 1, "replies": []}]}, {"body": "Because I guess the auto mod here doesn’t allow swearing? I’ll repost a censored version of my comment.  \n\n\n\nI disagree with your entire thesis though that 1) Apple is undervalued and 2) it is only going up from here.  \n\nEarnings are coming out and Apple was hit hard by Chinese supply chain issues before CV hit over here.   \nQ1 could look worse than anyone thinks right now and Apple is a premium product which no one is buying in a shut down and will have very serious demand problems if the lockdown/recession/unemployment crisis continues.    \n\nDon’t be fooled by all the fed money pumping up the market especially the tech stocks.  \nAapl is up 34% YoY right now...if you think that is undervalued I would seriously think hard about that belief.  \n\nBut it’s your money go for it.", "score": 24, "replies": [{"body": "Kind of my thought, curious to see what happens when earnings start coming for real...", "score": 6, "replies": []}]}, {"body": "Sell calls or puts?", "score": 8, "replies": [{"body": "I think he means (or at least, should mean) calls, which is derailing the whole thread", "score": 2, "replies": []}]}, {"body": "You cannot use a long call as collateral for a short put.", "score": 8, "replies": []}, {"body": "I’m not saying this is right move, but I think what you’re looking for is a called a “diagonal” buy itm calls and sell otm calls that expire before the itm call. GL", "score": 4, "replies": []}, {"body": "Calendar spreads are very narrow to get right, and are a vol expansion play.\n\nI recommend the poor man's covered call. Same deal, but more cap req, and your long call is a little to a lot ITM, while you sell OTM calls continuously to reduce cost basis.", "score": 5, "replies": []}, {"body": "The problem is this: if you buy a september atm call and then the price dips way too much, then the weeklies that you’ll be selling on it will be way too OTM. Why not do this on a cheaper stock such as MGM? You can buy relatively itm call for september and keep selling weeklies. Aapl’s earnings wont be amazing either so maybe consider doing this with a stock that hasn’t been affected as much (cloud based companies aka msft)", "score": 3, "replies": []}, {"body": "Long call and short put combined into what? Double bullish position? Do you mean selling calls?", "score": 2, "replies": []}]}
{"title": "Advanced meta-analysis of YouTube financial advice", "selftext": "[deleted]", "id": "fysngt", "created_utc": 1586564782.0, "score": 35, "upvote_ratio": 0.9, "num_comments": 14, "comments": [{"body": "I ran into number 5s videos when I swing traded GOPRO. Dude is a straight retard inverse anything he touches.\n\nedit: also watch his gopro videos if you enjoy other peoples pain", "score": 12, "replies": []}, {"body": "We watch The Big Short for DD. Ban", "score": 9, "replies": []}, {"body": "$1.21\nI cried laughing, thank you sir. I aspire to be that green one day.", "score": 6, "replies": []}, {"body": "Who wears clothes during a home lockdown?", "score": 3, "replies": [{"body": "Dude I have buffalo sauce on my belly from 4 days ago", "score": 6, "replies": [{"body": "What financial advice are your people giving on youtube?", "score": 2, "replies": []}]}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Good work man can you do this weekly? It's better than the 100000 threads from retarded bears raging against \"the system\".", "score": 2, "replies": []}, {"body": "Stonks go up. Done.", "score": 2, "replies": []}, {"body": "Ban i see no positions or tldr", "score": 1, "replies": []}, {"body": "Conspiracy theory: U/Janewayforpresident is Ziptrader", "score": 1, "replies": []}, {"body": "I started trading 1 month ago and I'm less of a noob than #5", "score": 1, "replies": []}, {"body": "Check out The Market Huddle", "score": 1, "replies": []}, {"body": "thank you this is great", "score": 1, "replies": []}]}
{"title": "Another grey swan: US Debt Downgrades", "selftext": "TLDR: Regular Americans are becoming pissed over the BRRRRRR which will most likely not trickle down. [This top post is true](https://www.reddit.com/r/wallstreetbets/comments/fyt6mm/for_everyone_who_wants_to_understand_what_the_fed/) (the BRRRR is only filling in a liquidity gap, and funds will start realizing the costs of a sudden stop = lower everything). It's only a matter of time before the CRAs decide to drop the rating again.\n\nPositions: Last time the US sov rating was dropped, equities dropped. Beyond any belief, US Treasuries were bid up. Looking to play this again through long Treasuries or IG bonds since the Fed is buying them anyways, and they are a risk-off hedge. (/ZN futures, GOVT, TLT, LQD). [The next rating review should be July.](https://www.standardandpoors.com/en_US/delegate/getPDF?articleId=2368297&type=COMMENTS&subType=REGULATORY)\n\n\\-----\n\nWait... I remember this from 2011. This fast moving zombie of markets have gone through the early years of the recession in about a month. 2007 with overvalued assets was Jan, 2008/2009 was Feb to mid-March, 2010 with coordinated rescues was March, 2010 when declining financial markets started to take its toll on main street was also late March, and 2011/12 with sovereign debt downgrades (US, GR, IT etc) is probably going to be the month of April.\n\nIf you take a look at all the commentary to why the [US debt rating was dropped](https://en.wikipedia.org/wiki/United_States_federal_government_credit-rating_downgrades) in 2011 and outlooks remained negative up to now, it's because of 2 main reasons.\n\n1. Rising income inequality (lol like the rating agencies really care about poors)\n2. Inability to service the debt (no shit)\n\n&#x200B;\n\n1. Based on the scientific study of reading [reddit posts](https://www.reddit.com/r/wallstreetbets/comments/fxw3uz/why_should_any_american_company_ever_act/), it seems like regular Americans are pissed about the bailout which mainly went to corporate. I mean, the money should eventually trickle down, and this move actually saves investors including everyone with a retirement account, but poor people without savings make the biggest noise. Just look at what an unemployed artist did about a century ago.\n2. This is the big one. Debt in normal times is supposedly serviced by government revenue, which in large parts are taxes. In the US, most of this [comes in the form of income, payroll and corporate taxes](https://www.cbpp.org/research/federal-tax/policy-basics-where-do-federal-tax-revenues-come-from). What happens when large parts of the economy are shut down? Surprise! No income and no corporate profits, which means there is no tax liability. This is why the Fed has been directly monetizing the debt by buying Treasuries as soon as they're written.\n\nThe CRAs have been downgrading corporates right and left these last weeks, so they're not afraid of making enemies. It's only a matter of time before big daddy America joins the crowd. [Take a look at CDS] (http://www.worldgovernmentbonds.com/cds-historical-data/united-states/5-years/)\n\nThe bloated balance sheet of the Fed will probably not be rolled off. It will reduce if the Fed decides to sell their holdings (unlikely if we learned from Japan in the last 20 years). The treasury, upon finding this everlasting fountain, will most likely continue rolling the debt forward. Rolling forward, in autistic terms, is doing a ponzi.\n\n&#x200B;\n\nSo what to do in this case? As long as the US Dollar remains as the dominant world currency, liquidity still equals dollars. From what happened in 2011, [equity markets dropped](https://en.wikipedia.org/wiki/August_2011_stock_markets_fall) after the announcement. Against what most people thought, US Treasuries were still bid up as people flocked to a risk-off asset. In 2020, we have to recognized runaway inflation might be a problem (higher yields = lower price). However, trying to short bonds in the face of this would be trying to fight against the [Time Person of the Year 2020](https://www.reddit.com/r/wallstreetbets/comments/fxu37i/2020_time_person_of_the_year/).", "id": "fz06fq", "created_utc": 1586593881.0, "score": 29, "upvote_ratio": 0.85, "num_comments": 17, "comments": [{"body": "While I strongly agree with OP that there should be some form of negative consequences of the FED madness, I ain't pinning much hopes on proclaimed \"independent\" credit rating agencies taking action. Especially considering that shortly after the US sovereign credit rating was downgraded in 2011, S&P president got replaced.", "score": 12, "replies": []}, {"body": "USD is the strongest currency is the world.  A weaker dollar would be good for stocks and oil", "score": 7, "replies": [{"body": "Short term the dollhair will rise. Then big poop and flush.", "score": 2, "replies": []}]}, {"body": "shouldn't gold then smash 2000?", "score": 6, "replies": [{"body": "Yes, probably. Debt downgrades are dollar negative, and BRRRRRR isn't helping. Treasuries and gold are currently highly correlated right now.", "score": 4, "replies": [{"body": "Why people want to lose 1.5% on t bills is beyond me", "score": 7, "replies": [{"body": "Sure, it makes no sense for you or\nme to buy T-bills with negative yields.\n\nWhat do you do if you have $100M?\n\nFDIC ain’t insuring that.   What if the bank holding it goes bust?", "score": 4, "replies": []}, {"body": "You do understand there are Treasury futures right? And there's a capital gains component?", "score": 2, "replies": []}]}]}]}, {"body": "Can you explain this in simpler terms", "score": 4, "replies": [{"body": "US debt has widely been regarded as risk free. Meaning the government would definitely pay it back because our economy is awesome. Compare that to a shithole like Argentina. Very risky to buy their debt. \n\nCredit rating agencies assign letters like back in middle school to tell people how shitty they are. If you get lower grades, it means your debt sucks. \n\nWe’re currently throwing debt into a system with no way to pay for it. It’s only a matter of time before our credit rating gets downgraded and everyone will freak out.", "score": 8, "replies": [{"body": "hm, who rates countries credits?\n\nBut our economy is awesome!", "score": 1, "replies": []}]}, {"body": "Simp ALERT!🚨 🚨 🚨 Also, I didn’t understand either", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Comments like these make me wonder if people actually know what JPowell \"printing\" really means.", "score": 19, "replies": []}, {"body": "Main driver is still lack of government revenues. Yes, the fed is monetizing everything, but stepping back and forgetting the BRRRR and bear market rally we've had in the last two weeks, isn't money printing overall destabilizing? \n\nIn any case, the BRRRR and experiences from 2011 plays into the long Treasury story. Unless of course this time it's different. I would question straight up long-equities, because debt downgrades no matter how you print is risk-negative.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "> SPY ETF \n\nYes, stocks are a much better inflation hedge than gold (non-yielding asset). I'd do that too, but remember this is wsb where 15% OTM FDs are the rule de jure. \n\nBut my argument is for a debt downgrade. As of right now, treasury and gold are correlated due to decreasing yields and increasing fear premium. \n\nI'll be loading up the boat on /ES futures... just not now.", "score": 3, "replies": [{"body": "15%? Not ambitious enough. Try 50%.", "score": 2, "replies": []}]}]}]}, {"body": "Oh yes. Printing press great drug. Just ask fellow addicts Zimbabwe and 1920s Germany.", "score": 1, "replies": []}]}]}
{"title": "Big Bank Earnings: Trend Reversal or Support?", "selftext": "TLDR: BAC 4/17 $29c, 4/24 $30c, 5/1 $30c\n\nWhat are your autistic thoughts on the impact of the big bank’s earnings this week?\n\nWill their forecasts of the economic effect of 🍺 🦠 be a turning point to end this bullish trend? Or, is everything already priced in and things continue to rise?\n\nI don’t know. But, you know who does—your wife’s boyfriend. So, the next time he takes a break from pounding your wife raw and walks to the fridge to replenish his bodily fluids, why don’t you ask him and tell us what he says?\n\nRiding the 🐂 🌊 but long term outlook 🌈 🐻.", "id": "fz6s6c", "created_utc": 1586616654.0, "score": 9, "upvote_ratio": 0.76, "num_comments": 18, "comments": [{"body": "Bank earnings are going to be staggering\n\nHere is why:\n\n1. Volatility on markets brought in record revenue for credit and equity desks. M&A will be hit\n2. Any losses to lending will be offset by FED market interventions\n3. Bonds went massively up, including high yield from the recent lows\n4. They won’t feel the payment delays yet\n5. All the treasury packages will yield 5+ billions of risk free almost instant PROFIT for banks, that assumes only 250bil PPP, should that increase they earn 2% of that\n\nRemember banks were still making killing in 2008", "score": 28, "replies": [{"body": "I’m retarded, so is “staggering” good or bad?", "score": 8, "replies": [{"body": "Good. Or better than “priced in”", "score": 5, "replies": []}]}, {"body": "So ICs... Got it.", "score": 1, "replies": [{"body": "I’m with you, Just finished my trade setup for all of this week’s earnings, majority I’m gonna sell 1SD ICs, IV seems to be sweet enough to bag good enough. Don’t want any home runs for this earnings, but don’t want to trade FDs with lot of uncertainty around.", "score": 1, "replies": []}]}]}, {"body": "Considering the banks are going to be the only ones winning from those SBA loans, this might be a solid play. Though right now it's calls on nearly everything just like it was puts on nearly everything for most of March.\n\nIf the market finds its head and doesn't start overcorrecting down absolutely everywhere again, those calls should still print. If it freaks out and destroys everything again...well I wouldn't hold those calls for very long. Might be an overnight/intraday play.", "score": 7, "replies": [{"body": "Yeah, got in super early on them so already very green. Regardless of whether Monday is red or green, I am going to unload some to lock in some gains. Then I’m playing with house money and am just letting the rest ride.", "score": 5, "replies": []}, {"body": "How do banks win from the SBA loans? They don’t make money on them.", "score": 1, "replies": [{"body": "They do. 1% interest, and aside from eating the loss on forgiven loans, the Treasury is paying 1-5% processing fees on every loan, straight to the issuing banks. It's literally free money.", "score": 3, "replies": [{"body": "Yeah, I guess that’s true. However, you have to factor in opportunity cost. These loans require resources. Could the bank be allocating these resources to more profitable loans?\n\nAlso, the SBA’s pursuing these loans are also asking for temporary relief from the banks for their debt service. From my actual work experience, banks are cooperating. This should have a negative short term impact on banks.", "score": 1, "replies": [{"body": "I got a request to review these from a temp agency i used to do work  with they are paying $25 an hour for attorney or paralegal.", "score": 2, "replies": []}]}]}]}]}, {"body": "Support these nuts on your chin", "score": 10, "replies": [{"body": "Rather use my mouth. Momma didn’t raise no bitch.", "score": 22, "replies": []}]}, {"body": "What’s the expectation?", "score": 2, "replies": []}, {"body": "Banks: calls or puts", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Your logic says puts, the market says calls. Have you learned nothing?", "score": 7, "replies": []}, {"body": "I’m curious as to how the market will respond if the earnings “aren’t as bad as everyone thinks.” I could imagine a bounce then. But, honestly at this point it’s like flipping a coin.", "score": 3, "replies": [{"body": "Nah, it's more like a 100 sided die labeled 1-100 and unless it comes up 69, everything will be fine. With the Fed brrrring full bore, nothing is a coin flip. Brrrr will push market. Until it doesn't.", "score": 4, "replies": []}]}]}]}
{"title": "INVERSE WSB Strategy: Bear Market", "selftext": "As a lot of you have already touted before, the most profitable strategy is actually betting against sentiment on wallstreet bets. And damn this weekend has been the most bullish I've seen this place.  \n\n\nSo, I think this is where the bear market really starts.   \nPosition: SPY200p 6/1", "id": "fz7kua", "created_utc": 1586619045.0, "score": 54, "upvote_ratio": 0.9, "num_comments": 15, "comments": [{"body": "Dude we need to quantify the sentiment. Most posts are still bearish and wonder why there is no downward movement yet.", "score": 30, "replies": [{"body": "Loads of cryposts that society hasn't collapsed to make their lotto tickets somewhat less of a losing prop.", "score": 14, "replies": []}, {"body": "My website and that other dude already did. Glimpse.info/sentiment. We hit over 50 for a few days last week for the first time in weeks. Has been 30-40", "score": 2, "replies": []}, {"body": "There’s some algo site that picks up WSB sentiment. It’s mostly bulls rn", "score": 0, "replies": [{"body": "Yeet can you provide the link, pls? Need it for an incoming YOLO move", "score": 1, "replies": []}, {"body": "Proof or ban. The front  page is all Bitching Bears( - sounds like a new music band).", "score": 1, "replies": []}]}, {"body": "Join the new movement 🤹🏄 Joggling surfers\n\nThey ride the current wave being an evolution of gay bears with BRRrrRRR superpowers to identify when JPou is printing and go long when Bull Printers turn their machines on. Joggling surfers is the new trend that is gonna make money in WSB. We autisticly joggle while surfing waves of ups and downs and we keep losing cromosomes, however at the end of each cycle we lose less money than 🌈🐻 or 🐃🖨️", "score": -8, "replies": []}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "please do, would be helpful", "score": 3, "replies": []}]}, {"body": "Bullish?  Every damn post is some TA astrology about how the markets are going to drop. Or \"inverse the bulls!\".\n\nYou sir, are part of the  wallstreetbets sentiment.", "score": 2, "replies": []}, {"body": "Agreed. Seeing a lot of gay bear switching to calls. Puts going to print on Monday.", "score": 1, "replies": []}, {"body": "We got 2 more weeks of upswing buy calls to print tendies.", "score": 1, "replies": []}, {"body": "Where have you been reading? 50% of the posts are bear thesis, and 50% are shitposts", "score": 1, "replies": []}, {"body": "\"... Bla Bla Bla inverse wallstreetbets...\"\n\n\\*Proceeds to bet like every other fucking bear here\\* \n\n*Slow clap*", "score": 1, "replies": []}, {"body": "Actually WSB is 66% bearish this weekend", "score": 1, "replies": []}, {"body": "so how long did you hold that bag", "score": 1, "replies": []}]}
{"title": "Golden Era", "selftext": "**TL;DR - Long Gold**\n\n***Disclaimer:*** *This post is eco-nerd shit with charts. It's about interest rates and gold. Nothing more.*\n\n&#x200B;\n\nNo perfect model exists as to determine where interest rates should be. However, one model exists which implies the real price of gold (inflation adjusted) has a tendency to move up or down, again in real terms, as compared to what the Federal Reserve is doing, or not doing, with the Effective Fed Funds Rate (EFF).\n\nThe model I refer to is [The Taylor Rule](https://www.investopedia.com/terms/t/taylorsrule.asp).\n\nI am going to graph 3 distinct periods in time where either the Fed Funds Rate was either too loose or too tight relative to where The Taylor Rule implied interest rates should be.\n\n1. 1968 - 1980: Loose Fed, Rising Gold Prices\n2. 1980 - 2001: Tight Fed, Lower Gold Prices\n3. 2001 - Present: Loose Fed, Generally Higher Gold Prices\n\nAll data is sourced from [FRED](https://fred.stlouisfed.org/).\n\n&#x200B;\n\n**1968 - 1980**\n\nA positive value for the blue bars represents The Federal Reserve being *\"too loose\"* relative to where The Taylor Rule (TTR) indicates rates should be. During this period, real gold prices rose substantially. **What is important to understand is not so-much how large the spread is between TTR and EFF, but rather if the spread is positive or negative.**\n\n&#x200B;\n\n[1968 - 1980](https://preview.redd.it/nimztgkhm8s41.png?width=978&format=png&auto=webp&s=63f71cc1d52b7afbcae96806586def96e4992708)\n\n&#x200B;\n\n**1980 - 2001**\n\nThis two decade plus period provides a view that the Fed was too tight relative to TTR and therefore gold prices in real terms suffered roughly an 80% loss in value.\n\n&#x200B;\n\n[1980 - 2001](https://preview.redd.it/dbw8sfcim8s41.png?width=1008&format=png&auto=webp&s=8127308849cd2bdb14cbe11eb5b921db0bc3d384)\n\n&#x200B;\n\n**2001 - Present**\n\nThis period is unique because it has two added factors: ZIRP and QE. The impact of QE in terms of how this would translate into rates (negative) has been discussed, but I am no expert in this matter. In addition, during the GFC, TTR went negative, implying negative rates. In all, over this almost two decade period, the Fed has been too loose and the bull market in gold resumed. ***Interestingly, a long period occurred where the Fed remained too loose yet the real gold prices declined (from 2012/13 - 2018).*** This could imply this model is less effective in the world of Central Bank accommodation.\n\n&#x200B;\n\n[2001 - Present](https://preview.redd.it/2gdczcxim8s41.png?width=1046&format=png&auto=webp&s=5da8bd5fff0b5410b938eafef02f78962d368167)\n\n&#x200B;\n\nOn a final note, this is far from perfect. Periods (quarters) exists where the correlation is broken, however the secular cycle remained intact and that's the premise. This model may be dead or injured given ZIRP and accommodation. We would have to better understand how we could view QE in the context of rates. This said, I still believe we are in a Golden Era.", "id": "fzfpua", "created_utc": 1586633314.0, "score": 35, "upvote_ratio": 0.94, "num_comments": 19, "comments": [{"body": "Too long for me to read. I saw “Fred” in there and Flintstones are my favorite vitamins so I’m in!", "score": 26, "replies": [{"body": "We're in too 🤹🏄", "score": 5, "replies": []}]}, {"body": "Q3 2021 gold will be at 2100$", "score": 8, "replies": [{"body": "Any long calls on gold stocks?", "score": 1, "replies": []}]}, {"body": "Physical gold is worth holding \n\nPaper gold is about to go off a cliff", "score": 5, "replies": [{"body": "Why do you believe that?  \n\nI have read different theories as to why, just curious why you feel that way.", "score": 1, "replies": [{"body": "ignore him, he's hallucinating!", "score": 1, "replies": []}, {"body": "Hm from what I would think there is a large spread between the two so cliff is maybe an exaggeration. If that's not what his answer is and he doesn't give one then just chalk it up to another idiot with a baseless opinion and you falling for it because you think someone else must know something you dont. Although that last part is probably true.", "score": 1, "replies": []}, {"body": "The decoupling of physical and paper has already occurred its only a matter of time before the physical supply is restored and when that happens paper gold is going to tank while physical will remain high \n\nWe aren’t ever going to the gold standard no matter what boomers/doomer gen x on here say they are deluded and wrong.", "score": -2, "replies": [{"body": "What the fuck did you even write here?", "score": 0, "replies": [{"body": "Obvs something you don’t understand \n\nIf you don’t understand how something works don’t trade it", "score": 0, "replies": []}]}]}]}]}, {"body": "Gold rises against falling real yields. Your info shows this.", "score": 3, "replies": []}, {"body": "JNUG calls to the moon", "score": 3, "replies": []}, {"body": "Puts on GLD, got it.", "score": 4, "replies": [{"body": "You wanna jump in this boat with me? I’m already under water", "score": 2, "replies": []}]}, {"body": "Idk wtf a ZIRP is but it sounds sexy. Count me in.", "score": 2, "replies": [{"body": "Zero interest rate policy", "score": 1, "replies": []}]}, {"body": "Anyone have any long calls on gold stocks?", "score": 2, "replies": []}, {"body": "We’ll enter a deflationary era. Gold will actually go down if the US economy caters. This will hold true as long as the US remains as a global superpower.", "score": -6, "replies": []}]}
