{"title": "Nomura downgrades TSLA from $400 to $300 because Elon smoked the ganja", "selftext": "[deleted]", "id": "9exbxb", "created_utc": 1536670823.0, "score": 223, "upvote_ratio": 0.95, "num_comments": 67, "comments": [{"body": "analysts are fucking squares", "score": 210, "replies": [{"body": "He didn’t even inhale. Watched closely when he said Weed never affected him. Same thing happened to me when I was 15", "score": 56, "replies": [{"body": "He seemed totally normal after also (as normal as Musk can be). If he hadn't smoked in a while and actually smoked whatever shit Joe Rogan smokes he would be tripping.", "score": 44, "replies": [{"body": "DUDE WEEEED", "score": -3, "replies": []}]}, {"body": "Okay Bill Clinton. ", "score": 9, "replies": [{"body": "I just think out of all the reasons to cut their target price. That fake hit of Weed is not one of them", "score": 20, "replies": [{"body": "Fake hits should be punished. Fat rips should be rewarded.", "score": 39, "replies": []}, {"body": "CEO that drank and smoked on a public podcast. People would see that as a sign he’s unhinged. ", "score": 6, "replies": [{"body": "Like we didn't already know that", "score": 19, "replies": []}, {"body": "If anyone looked at his tweets, they would have learned that a long time ago. Op is a pedo", "score": 11, "replies": []}]}]}]}]}, {"body": "Anal-ysts", "score": 12, "replies": [{"body": "Anal yeast ", "score": 7, "replies": []}, {"body": "Analists*", "score": 1, "replies": [{"body": "Analrapists ", "score": 5, "replies": [{"body": "Who's the ANUSTART that blocked me in the driveway?!", "score": 1, "replies": []}]}]}]}, {"body": "Nah, they're boneheads", "score": 2, "replies": []}]}, {"body": "Half of these analysts are literally doing cocaine off of each others dicks yet they get upset that Elon smoked weed ", "score": 236, "replies": [{"body": "At Nomura they actually suck shit out of each other's assholes", "score": 86, "replies": [{"body": "Human Centipede?", "score": 7, "replies": [{"body": "leveraged digestion", "score": 27, "replies": []}]}, {"body": "It is known", "score": 4, "replies": []}, {"body": "No way", "score": 8, "replies": []}]}, {"body": "By half you mean all of them, right?", "score": 20, "replies": []}, {"body": "are the analysts landing rockets on pads in the ocean with trillion dollar potential contracts? no? wow.", "score": 2, "replies": []}]}, {"body": "Mr. Musk’s behavior is well documented (taunting short sellers, NY Times interview, cave diver accusation, earnings call outburst, Joe Rogan podcast) and likely contributed to the onslaught of executive departures in recent months,” he said.\n\n\n\nthat sounds like its slightly more than the ganja", "score": 87, "replies": [{"body": "Implying he doesn't do all this shit for basically free press.", "score": 9, "replies": []}, {"body": "Stock goes up -> Wild behavior makes stock go down -> Short sellers invest -> Good news -> Stock goes up -> Elon laughs at short sellers -> Repeat", "score": 5, "replies": []}, {"body": "Being an asshole doesn't impact financials. You don't buy a Tesla because of Musk, you buy it because you want a sexy, fast car that happens to be electric.", "score": 5, "replies": [{"body": "nah lots of tards buy tsla just because of musk", "score": 17, "replies": [{"body": "Lots of tards buy MU options too.", "score": 6, "replies": [{"body": "Because of Musk. ", "score": 1, "replies": [{"body": "Most people that buy TSLA have never even been inside a Tesla.  I remember when my friend parked theirs in a tourist trap and every single European tourist was freaking out. ", "score": 1, "replies": []}]}]}]}]}, {"body": ">that sounds like its slightly more than the ganja\n\nStill none of those things have any impact on the performance of the company ", "score": 1, "replies": [{"body": "... except the whole  \"onslaught of executive departures\" thing", "score": 2, "replies": []}]}]}, {"body": "Elon smoked the devils lettuce... oh no!", "score": 23, "replies": []}, {"body": "Considering what this stock usually trades on, that's actually some solid DD.", "score": 9, "replies": []}, {"body": "The weed smoking was the least interesting part of the Rogan interview. Take a couple hours and watch it. Musk is a damn interesting guy and is smart as hell.", "score": 18, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "No", "score": 15, "replies": []}, {"body": ">but the argument is sound.\n\nBecause Elon tweeting more is going to increase the chance of tesla going bankrupt? How is that sound?", "score": 4, "replies": []}]}, {"body": "Why is it okay to drink but not weed ?", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "It is legal there.", "score": 7, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "And yet, in practice, politics. ", "score": 1, "replies": [{"body": "I agree that in practice it is being allowed. But it is a question of image. ", "score": 1, "replies": [{"body": "Elon seems super concerned about the optics of smoking...or not. ", "score": 1, "replies": [{"body": "Unfortunately, Elon doesn't set the price of the stock.", "score": 1, "replies": [{"body": "Nobody else cares about the legality either. Well, you. ", "score": 1, "replies": [{"body": "Yes, that's why the stock dropped 10% the day after, because nobody cared.", "score": 1, "replies": [{"body": "Over MJ. True WSB level DD. ", "score": 1, "replies": [{"body": "As opposed to what other news that happened that night for TSLA?", "score": 1, "replies": [{"body": "Good luck with your future DD. ", "score": 0, "replies": [{"body": "Okay, buddy.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Socially accepted and tolerated", "score": 6, "replies": []}]}, {"body": "Their \"new\" Chief Accountant left after a month too, but that doesn't make as good as a headline  ¯\\\\\\_(ツ)\\_/¯ ", "score": 2, "replies": []}, {"body": "Did the analyst say that? It seems like it's Musk's behavior in general, not that he took a hit of a joint. ", "score": 4, "replies": [{"body": "Read the fucking article ", "score": 4, "replies": [{"body": "I did read it! Maybe I should have added in \"did the analyst really say that?\" but I thought context made it obvious I'm calling OP out for the title. ", "score": 6, "replies": []}]}]}, {"body": "Lot more to it than weed, bond price, SEC investigating production reporting, among others.", "score": 3, "replies": []}, {"body": "Pamp it Elon", "score": 1, "replies": []}, {"body": "Smoke the ganja get the gay", "score": 1, "replies": []}, {"body": "Imaging valuing a stock 33% more before you realised what a fuckup the ceo is to its image.", "score": 0, "replies": []}, {"body": "Serious question here, how do these analysts come up with a price and I guess also, how do companies come up with their initial pricing for stocks? Do companies just release stock at X price and then after a while analysts are like X is too little, it actually should be worth 4X!", "score": 0, "replies": [{"body": "https://en.m.wikipedia.org/wiki/Business_valuation", "score": 0, "replies": [{"body": "Non-Mobile link: https://en.wikipedia.org/wiki/Business_valuation\n***\n^HelperBot ^v1.1 ^/r/HelperBot_ ^I ^am ^a ^bot. ^Please ^message ^/u/swim1929 ^with ^any ^feedback ^and/or ^hate. ^Counter: ^211225", "score": 3, "replies": []}, {"body": "Ty", "score": 1, "replies": []}]}]}, {"body": "Preface: I’m genuinely curious and not trying to stir shit up. \n\nI have no problem with him smoking, but it feels like he’s trying to use the smoking as a stunt to undervalue Tesla so he can buy back stock cheaper and go private. \n\nThere seems to be some funny business going on in the background. While I don’t doubt Musk’s intelligence and drive, it seems like he’s actively fighting his own corporation because he wants 100% control over everything.\n\nI’m by no means a financials or strategy expert, just offering a laymen’s opinion on what I see from the outside. I’m definitely interested in hearing insights from the more experienced folks though. \n", "score": 0, "replies": [{"body": "start by watching the interview. whatever you think this \"feels like\" is irrelevant until you do that. the weed part wasn't significant enough to be part of some nefarious plan.", "score": 1, "replies": []}]}]}
{"title": "AMZN - iRobot acquisition confirmed", "selftext": "", "id": "9eydss", "created_utc": 1536678581.0, "score": 62, "upvote_ratio": 0.83, "num_comments": 69, "comments": [{"body": "That comment section gave me cancer", "score": 139, "replies": [{"body": "Seriously. Wtf is wrong with people? \"I hope you die a slow death from cancer\"...**!?**", "score": 53, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "To be fair, I’ve been screaming “**DIEEE**” at my Snapchat app for about an hour now ", "score": 14, "replies": [{"body": "Because your mom has been sending you nudes?", "score": 5, "replies": [{"body": "No, your mom", "score": 1, "replies": []}]}, {"body": "It's been working ", "score": 1, "replies": []}]}]}, {"body": "what the goddam fuck are they smoking jesus christ that shit's fucked wtf is with fucking fb man lmao", "score": 2, "replies": []}, {"body": "Poor ppl mad they'll never achieve a fraction of papa Bezos has", "score": 1, "replies": []}]}, {"body": "\"You don't pay your employees\" obviously he does or else the state would go after him. If the employees don't like working a minimum wage job they should learn a skill like lawn mowing or picking fruit. ", "score": 38, "replies": [{"body": "This, I can’t stand “oH YoU MaKE 10x MoRE THaN YoUR EMPloYEEs” Well at least for American Amazon Employees no one is forcing them to work there, they know the wages and the workload and they choose to work there. There’s plenty of other places that’ll give them similar opportunities, and if they really wanted they can go out and create their own business in hopes to be as rich as him one day.", "score": 12, "replies": [{"body": "its not really a choice if they dont have an alternative.\n\n&#x200B;\n\nBe specific, name another place. And no, they cannot create their own business since they do not have the capital.", "score": 2, "replies": [{"body": ">its not really a choice if they dont have an alternative.\n\nI did a quick search for the Death Valley Amazon fulfillment Center location and came up with nothing.\n\nWhat I did find is that Amazon puts their fulfillment centers near major US airports in major US cities. Who would have thought, right?\n\nI'm going to speculate here but I would bet that if you live near an international airport you have more than one choice for a place of employment. \n\nUturn_Singleton mentioned lawn care.  I get my grass cut by a senior citizen and his special needs grandson. They average $20-30 an hour. Just the two of them with a small pickup truck, a push mower and a weed-eater.", "score": 9, "replies": [{"body": "$20-30 an hour for cutting grass?\n\nA bit high don’t you think? Shouldn’t cost more than $10 an hour. ", "score": 1, "replies": [{"body": "Shit dude, I'm perfectly happy paying 150+ bucks an hour for 4/5 guys to come out, mow my lawns, trim hedges, and general cleaning outside. Way too much surface area to handle with one/two people.\n\nMight as well pay them better, so they don't rob me later.", "score": 3, "replies": [{"body": "150/hr to do all this?\n\nSo $1500 for 10 days even if I work only an hour a day?\n\nShit nigga, I’ll leave everything and I’ll fly to your state to work for u. ", "score": 1, "replies": [{"body": "4/5 people, are you illiterate?", "score": 3, "replies": [{"body": "So I’ll work 4 hours bro. ", "score": 1, "replies": []}]}, {"body": "$150 for 4/5 guys... ", "score": 1, "replies": [{"body": "Yes. 4 guys x 1hr = 4 hour work. \n\nCan do 4 hour work. ", "score": 1, "replies": []}]}]}, {"body": "I’m not old or special needs I’ll do it for 16", "score": 1, "replies": []}]}, {"body": "They knock my yard out in about 20 minutes and move on down the street.  I offer him more and he refuses to take it.", "score": 1, "replies": []}]}]}, {"body": "Just look up Amazon fulfillment center locations, and you be specific and name one of those places where Amazon is the single only place to work a job of a similar wage. On top of that course they can start their own business, the start up costs for an online service is basically nothing.", "score": 2, "replies": []}, {"body": "Hm. That's weird. I'm going to do that funded through venture capital. ", "score": 0, "replies": [{"body": "Thing is, no VC is going to fund a company whose entire business plan is to make less profit by paying their workers more for moving boxes around.", "score": 5, "replies": []}, {"body": "what are you getting funded through VC?", "score": 1, "replies": []}]}]}]}]}, {"body": "Makes me want to make an instagram just to say nice things to Lord Bezos. Imagine if we ALL did this.\n\nWe'd be on CNBC morning news", "score": 8, "replies": [{"body": "Down!", "score": 0, "replies": []}]}, {"body": "Poor people suck. Water is wet", "score": 5, "replies": []}, {"body": "Then they buy from Amazon. ", "score": 1, "replies": []}, {"body": "Those are comments made by wsb buying puts", "score": 1, "replies": []}, {"body": "Denying hes a pos is a small dick move brother ", "score": -3, "replies": [{"body": "There are, for the most part, two types of people in this world; the “haves” and “wish they had”. ", "score": 1, "replies": [{"body": "Being a billionaire dosnt make you a none pos brother HH", "score": -1, "replies": [{"body": "Probably not; but it does put you in one of the afro mentioned categories. ", "score": 1, "replies": [{"body": "Yeah which dosnt affect the fact hes a pos that deserves public shaming brother ", "score": 0, "replies": [{"body": "Determining whether or not someone is a pos isn’t a matter of “fact”, it’s a matter of opinion. If you think that it is a fact that he’s a pos because he is a billionaire then it is my opinion that YOU’RE a pos. \nOh brother.. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "\"Hi! My name is RJ and I'm a ...\"\n\n&#x200B;\n\nA what? A WHAT? WHAT IS RJ?! ", "score": 45, "replies": [{"body": "-utistic", "score": 15, "replies": []}, {"body": "Ripe Jabroni", "score": 23, "replies": []}, {"body": "Regional Janitor ", "score": 4, "replies": []}]}, {"body": "Holy shit jeffery bezos is the literal jew-devil He gave my dad turbo cancer. He fucked my daughter and burned my house down. Also he has like 500 billion dollars or something FUCK THIS GUY.", "score": 32, "replies": [{"body": "\"He poisoned our water supply, burned our crops, and delivered a plague upon our houses!\"", "score": 8, "replies": [{"body": "Do you feel it Mr. Krabs?", "score": 4, "replies": []}]}]}, {"body": "The amount of vitriol spewing from people who don’t understand capital gains taxes or corporate taxes on the most fundamental levels. Bezos doesn’t have to pay taxes on his multi billion dollar net worth because the majority of it is unrealized gains and his corporations has done more to help the government than others have. \n\nThis is one of the few companies to get the highest security clearance allowing the CIA to use their own private AWS cloud. Yet people spout it’s draining the government of funds.", "score": 51, "replies": [{"body": "being the big fish makes you a target. Nobody is outraged at John Malone for doing the same investing/ tax loss harvesting. ", "score": 11, "replies": [{"body": "\"that makes me smart\" ", "score": 4, "replies": []}, {"body": "john malone doesnt have the same net worth", "score": -1, "replies": [{"body": "It's almost like the person you're replying to said\n\n> being the big fish makes you a target\n\n", "score": 4, "replies": [{"body": "Yes. And I’m explaining why. \n\nBecause the bigger the net worth, the bigger the impact of tax evasion. ", "score": 0, "replies": []}]}]}]}, {"body": "> Yet people spout it’s draining the government of funds.\n\nWhat do you call the social safety net that many of his workers, especially in warehouses, fall on when they don't make enough? Perfect example of privatizing gains and socializing losses. It's not like Amazon is the only company doing this, but still.\n\nThat said, I'm long AMZN and it's my biggest position.\n\n", "score": 7, "replies": [{"body": "because they are part time workers who work like 20 hours a week. ", "score": 3, "replies": []}, {"body": "Warehouse jobs pay shit and that's true not just for Amazon.  There's no barrier to entry for moving boxes around, and is increasingly taken over by robots.  Entire warehouses will become robotic before they start paying workers more.", "score": 1, "replies": []}]}, {"body": "they have only  some millions  of computer man, their computational power is ridicolous\n\nCIA  would never use the meme  AWS", "score": 1, "replies": []}]}, {"body": "\"This person is super rich because he founded one of the most disruptive companies in recent history, a company I buy stuff from all the time!! WAHHHHHHHHHHHHHHHH!!!!!111\"", "score": 23, "replies": [{"body": "\"I love paying more for shipping and handling.\" - says no one ever.", "score": 3, "replies": []}]}, {"body": "Can't those people leave the uninformed political complaints to twitter and leave Instagram alone? ", "score": 5, "replies": [{"body": "I remember a time when the internet was visited by techies and academics instead of ignorant unwashed masses.  We had to only email and USENET to communicate with.  You win some lose some.", "score": 5, "replies": []}]}, {"body": "Look at all those angry commies.", "score": 8, "replies": []}, {"body": "I bought an fd this morning for $26, sold for $100 profit a few minutes later... Worth over $52 now\n\nFuck me", "score": 6, "replies": []}, {"body": "Old news m8 lol", "score": 1, "replies": []}, {"body": "This is basically that \"dj roomba\" idea the indian guy on parks and rec has....", "score": 1, "replies": []}, {"body": "LOL you piece of monkey shit!", "score": 1, "replies": []}, {"body": "roomba play despacito ", "score": 1, "replies": []}, {"body": "Lol, they complain about unrealized gains not getting taxed but are okay with giving the military 750 billion dollar budget and more tax deductions to the top 1% while shitting all over federal workers’ income, education and healthcare. \n\nMay I remind you we pay the most amount of taxes in healthcare of almost any 1st world country yet we have to pay the most out of pocket for it as well. Where’s the anger there?\n\nThe US is the one first world country that knows how to consistently get voters to vote against their own interest. \n\n", "score": 1, "replies": [{"body": "We pay all those medical taxes for all the poor and old people on government healthcare and you want to expand it? ", "score": 1, "replies": [{"body": "No. I want to have laws that prohibit excessive spending of said taxes. Being charged 1500 dollars for a ride to the hospital and 150 dollars for a blood test makes no sense. I think we spend enough on healthcare. We just don’t spend it intelligently. \n\nIt’s a problem with the military as well. A hammer shouldn’t cost over 100 dollars. ", "score": 1, "replies": [{"body": "Laws are the reason that there isn’t an affordable Uber like service for ambulances ", "score": 1, "replies": [{"body": "And laws can change that if people actually realized it was for the benefit of society.", "score": 1, "replies": []}]}]}]}]}]}
