{"title": "Why would the Fed raise interest rates with inflation levels remaining so low? (0.16% July 2016)", "selftext": "[deleted]", "id": "52gsj2", "created_utc": 1473715539.0, "score": 38, "upvote_ratio": 0.87, "num_comments": 41, "comments": [{"body": "One reason is that interest rates are one of the last resort tools they have when the economy really turns bad.  When they have used up all their bullets...like they have now, there is no where else to go.  So, they need to get the rates up so they have interest rates to drop should they need them.  In addition, these low rates have resulted in a false economy.  The stock market goes up because business can make money off of low interest rates and not by improving their business.  We are really in a bad place should we keep these rates low...we are way out of balance.", "score": 56, "replies": [{"body": "They've been low for years, how much longer can this economy last on its false legs?", "score": 4, "replies": [{"body": ".....and my friend, that is the real question.  We have become addicted to the rates.  Many believe that many companies will suffer big time should the low rates go away because they have relied on cheap money and not better performance.  Hold on tight when they do start tightening.", "score": 23, "replies": [{"body": "I have a weekly lunch with some local retired brokers and my favorite quote in relation to this low rate situation is \"the Fed has created a title wave of cheap money that has washed over our economy but the most dangerous part of a title was is when it begins to reced\"", "score": 8, "replies": [{"body": "Tidal wave?", "score": 13, "replies": [{"body": "A wave of agressive tittilation.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "The guy mispelled it...", "score": 3, "replies": []}]}]}, {"body": "Recede?", "score": 5, "replies": [{"body": "same thing your hair is doing. ", "score": 6, "replies": [{"body": "No.  It just.  Nevermind.  Ugh.", "score": 6, "replies": [{"body": "Sorry. I had to go for the low hanging fruit of a joke. You're just collateral damage ", "score": 4, "replies": []}]}]}]}]}, {"body": "I have a tickle in my balls that says should Trump be elected the interest rates will jump significantly as a last chance to raise the middle finger to him and make him navigate a poor economy. Personally I welcome the interest rate increase because we really need to hit the reset button in order to get things back in order. An ever increasing market when GDP isn't increasing doesn't add up. ", "score": 6, "replies": [{"body": "*Tinfoil hat time*\n\nI think the \"establishment\" purposely placed Trump in the race, so that if he wins, they'll shoot up interests rates, crash the economy, and then blame it on Trump. Instead of questioning the monetary system we live in, the general public will scapegoat Trump as the cause.\n\nIf HRC wins, continued low interest rates and negative rates if shit looks really bad. Might raise min wage to $12/hr to increase inflation *only if absolutely necessary (clinton can give two shits about the plight of the working class)*.", "score": 3, "replies": [{"body": "Either way they're not going to do shit to tarnish Obama legacy, so good to at least December. \n", "score": 2, "replies": [{"body": "Yeah, like seriously? Obama is such a piece of shit. Who knew a black president would let race relations go back two decades lol. He's a fucking joke. And the fucking sheep are going to remember him as some kind of populist hero.", "score": -4, "replies": [{"body": "I don't know about that. I'm just following along with the tinfoil hat time. ", "score": 1, "replies": []}, {"body": "I don't think race relations are actually worse - we've simply become comfortable enough to start taking about our remaining problems.", "score": 1, "replies": []}]}]}, {"body": "Your username fits a little too well", "score": 1, "replies": [{"body": "I'm a daytrader, but at least I can admit capitalism is just slavery with extra steps.", "score": 1, "replies": [{"body": "Username checks out. We don't have capitalism now, just socialism with a centrally planned monetary system.", "score": 2, "replies": []}, {"body": "Our microverse kinda sucks. So since I can't change the capitalistic ways of the world I might as well join it.", "score": 1, "replies": []}]}]}]}, {"body": "Lol I wouldn't be surprised by this. ", "score": 1, "replies": []}]}, {"body": "That's why I say let this shit crash and then enact basic income.", "score": -2, "replies": []}]}, {"body": "Japan's been playing this game since 1991, no end in sight.", "score": 3, "replies": []}, {"body": "I don't believe that we're on \"false legs\". If anything, interest rates are too high right now. For example, US bond yields would be negative right now (like much of the rest of the developed world) if the Fed hadn't started paying interest on vault deposits.\n\nI wrote a DD here about why interest rates will remain low until wealth inequality is fixed (in other words, not anytime soon) https://www.reddit.com/r/wallstreetdd/comments/52am4t/interest_rates_will_be_lower_for_longer_the_fed/", "score": -5, "replies": []}]}, {"body": "Thank you. I'm tired of hearing investors cry about (and ultimately contribute to) market turmoil from even the mention of rising interest rates. We've all benefited from low interest rates about as much as we can at this point and if you haven't then you snooze you lose. Time to bite the bullet. ", "score": 1, "replies": []}]}, {"body": "The feds biggest tool for stopping/lessening an economic recession is interest rates. Throughout history when the economy got bad, the Fed would lower interest rates (make money cheaper) so that people will be inclined to keep spending (which keeps the economy going). This has always been the case, however since the 1980s, when the IR was at 16%, the recovery period for each crisis (a time where intrest rates are lowered to get the economy growing again) became greater than the time between \"market collapses.\" So, instead of interest rates going up over a long period of time, after the 80s, they began trending downward. When the housing market collapsed interest rates were around only  7%. Now they are close to 0. The scarry thing about this is that the economy is entering a debt default cycle (which happens roughly every 6 to 8 years) and the Fed has no \"tools left in the tool box\" so to speak. They have backed themselves into a corner with no easy way out.", "score": 8, "replies": []}, {"body": "Inflation is not low.  Inflation comes in many forms, today we are seeing an asset inflation.  This type of inflation happens most when the inequality gap is large.  Extreme amounts if wealth pooling into the same pockets end up with tons of money being invested into the market and real estate and the like and not much more spending on goods and services.(hence no price inflation on those goods and services)\n\nAssest inflation is in no ways harmless.  Assest bubbles will often lead to bear markets which in turn can lead to recession.  Going into a recession with historically low interest rates could be difficult for the Fed to manage without massive quantitative easing which ultimately results in classic price inflation.\n\nThe economy is in no way as simple as looking at the cost of a loaf of bread and assuming no inflation.", "score": 4, "replies": []}, {"body": "Why you using monthly instead of yearly?", "score": 2, "replies": [{"body": "Because it suggests a more accurate representation of what is at hand in recent times... ", "score": 1, "replies": [{"body": "But short term data never shows the real situation. You can have a show quarter or a fast quarter in terms of inflation - doesn't show what is really going on. ", "score": 1, "replies": []}]}]}, {"body": "> They have no tools\n\nQuantitative Easing.  They still have tools.", "score": 2, "replies": [{"body": "Yes more credit cards.  We may be close to hitting another period of stagflation.", "score": 3, "replies": []}]}, {"body": "The simple answer is Low IR's enourage people to take out loans for cheap (buying real estate) and spending money stimulates the economy. Also, low IR discourage people from saving which also results in more spending which in turn stimulates economy. Its a cycle.", "score": 1, "replies": []}, {"body": "Because they do not know what they are doing. These phenomenon of 0 interest rates and no inflation has not been seen since the great depression.\n\nThey might see it as a way to bring security to the Markets, and a way to make the dollar stronger.\n\nMy take is that they will implement another QE in the future since is the only way for creating inflation when is at this levels.\n\nP.S: They know what they are doing but of they do that if affects the stability of the Markets and their currency. But with time where will be no escape of this.", "score": 1, "replies": []}, {"body": "Stock market. If the FED thinks there's a bubble it may want to raise the rates.", "score": 1, "replies": []}, {"body": "There are many different factors included in this decision, not only inflation, i.e. : the growth of the GDP, the stock market condition etc.", "score": 1, "replies": []}, {"body": "Because it will reduce the flow of cheap money, and might cause a slight drop in the market.\n\nFED wants to raise because they fear that the economy could overheat.", "score": -1, "replies": [{"body": "Right but as I just stated inflation rates are minimal... Cheap money has not yet begun to hurt inflation rates (obviously) thus the market isn't really in a bubble. ( I think )", "score": 1, "replies": [{"body": "Well it depends on which markets you're talking here.... if you're talking about the S&P, DJIA, etc., basically stock prices are going up (S&P hit a record high a couple weeks ago) yet companies aren't actually doing that well, which makes no sense, unless you're in an ultra-low interest rate situation. I think another commentor mentioned this.\n\nAlso mix that with the U.S. government bond market hitting record low yields, which is typically a sign of investors being scared, thus reaching for the \"safe\" investment, and you get the giant ball of fuckery that is known as the U.S. markets.", "score": 1, "replies": []}]}]}, {"body": "Raising interest rates increases inflation ", "score": -1, "replies": []}]}
