{"title": "When to go in on AMD?", "selftext": "Hey,\n\nSo I want to go in long on AMD and with the prices dropping hard from all the movement after and before hours, is it a decent time to go in, or should I wait and see if the dropping continues.I am confident in returns from AMD in a long position, I am just not sure if now is my best opportunity to get in. Any advice is appreciated, thanks!", "id": "51leqw", "created_utc": 1473257195.0, "score": 17, "upvote_ratio": 0.65, "num_comments": 48, "comments": [{"body": "This is a very large drop that lots of people actually are calling a good thing.  If the stock was to dilute 10-13% it should be around the 6.60 range, but because it is not I think it shows that the market has confidence overall in AMD.  To me this seems like AMD is spoon feeding us a tasty dip.\n\nedit: probably worth mentioning that I thought I was getting tasty dip yesterday at 7.28.  Turns out it tastes kinda sour now.", "score": 16, "replies": [{"body": "Same. I got in on the tasty dip at 7.40... whoops ", "score": 7, "replies": [{"body": "I'm fairly confident this shit will bounce right back.  I'm just gonna average down some.", "score": 2, "replies": [{"body": "Same. I'm holding for now. Also not a huge loss if it continues to sink. The rest of my portfolio is pretty solid.", "score": 1, "replies": []}]}]}, {"body": "7.37 here...", "score": 1, "replies": []}, {"body": "keep in mind amd dropped 3% the same day before the announcement. so technically we are 10% down in the last 2 days.", "score": 1, "replies": []}, {"body": "You don't understand, this is good for Bitcoin.", "score": 1, "replies": []}, {"body": "Have the new shares already been issued? As in has the dilution already taken place? I'm looking to buy soon.", "score": 1, "replies": []}]}, {"body": "It's going to be diluted soon don't buy any now.  New SEC filing saying that they're planning to issue another 79 million shares.\n\n", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "EDGAR for Americans, SEDAR for my fellow Canadians", "score": 3, "replies": []}]}]}, {"body": "U should get in soon", "score": 3, "replies": []}, {"body": "Maybe I don't know enough about AMD, but why does everyone think this is a good buy? They are losing money and have negative revenue growth. It's good that they are trying to reduce Liabilites, and it sounds like their latest line of products is doing well (which looks reflected in the stock) but the high beta throws me off as well. Just looking for some insight, I'm not the most experienced of traders. ", "score": 3, "replies": [{"body": "My thoughts, a lot of people on Reddit are AMD fan boys. (hang on for a second with the pitch forks)    \n\nThey want to root for the \"underdog\" in both the CPU and GPU market, where AMD has been getting its ass kicked for years by Intel and Nvidia respectively. In the stock market, buying a cheap stock and seeing it explode is what you're after, So I believe many people have taken that emotional attachment and latched on to AMD.\n\nWith the press coming out that the new Zen architecture may finally be able to compete, and with the release of the RX 480 being a success, a lot of people think AMD has finally turned things around. \n\nI've been in tech for a while, and I've always rooted for AMD, even after I moved to the Intel camp. Simply because competition is better for the consumer. But I've also heard similar things from AMD before, only to be disappointed.\n\nI'm looking to go long on AMD with a small position, but I'm waiting for it to come down a little bit more. ", "score": 3, "replies": []}, {"body": "Most of it is speculation.  AMD had a series of bad CEOs who made bad decisions which cost the company billions.  Then Bulldozer (the most recent generation of AMD cpu designs) turned out to be a bad CPU design.  Then Nvidia did a really good job with last generation's GPU and really pulled away market share wise.  So they pretty much hit bottom, both in profit and market share.\n\nAMD seems to have found a decent CEO in Lisa Su and Jim Keller came in to work on Zen (the next generation of AMD cpu designs).  He was the guy in charge of the Athlon64, which was the last time AMD was ahead of intel in the CPU game, even in market share briefly.", "score": 2, "replies": [{"body": "ah, I mixed up Nvidia and AMD! I'll just stay on the sidelines for this one. Thanks!", "score": 1, "replies": [{"body": "Do you think growth in Virtual Reality will have a large impact on AMD. I've heard they are supposed to be a big player in this industry. Its ~$5 billion dollar industry now and is projected to be about ~$160bn in 5ish years", "score": 1, "replies": [{"body": "160bn in 5ish years. Just like 3D printing. I remain unconvinced of virtual reality actually taking off", "score": 1, "replies": []}]}]}]}, {"body": "DO YOU SEE", "score": 1, "replies": []}]}, {"body": "$6.88 was perfect.", "score": 2, "replies": [{"body": "6.46", "score": 2, "replies": []}, {"body": "It's at $6.82 now", "score": 1, "replies": [{"body": "Got filled at market, 6.835 last minute of trading. GFM", "score": 1, "replies": []}]}]}, {"body": "Could someone explain why AMD is dropping again after pretty much consistent growth over the last few months?", "score": 2, "replies": [{"body": "They sold 600 million shares to create cash... But you see the result is a falling price that won't stop today. The market will equalize the price to what they sold ", "score": 4, "replies": [{"body": "It doesn't take multiple days to factor in straightforward news like this. Their announced actions were priced in already.", "score": 2, "replies": [{"body": "How's that working out?", "score": 2, "replies": [{"body": "Yep, the reason AMD fell again today was because of yesterday's news. Must be all the investors who just read about it in their morning newspaper lmao. \n\nThe markets aren't perfectly efficient, but do you really believe it takes multiple days to price in something a b-school freshman could calculate?", "score": 2, "replies": [{"body": "You forgot to factor in investor retardedness in your calculations", "score": 1, "replies": []}, {"body": "Your problem is you are assuming the market is logical and/or rational. This is most defiantly not the case haha", "score": 1, "replies": []}]}]}]}]}, {"body": "Basically AMD just sold a whole bunch of shares that they owned which upped supply and dropped the price.", "score": 6, "replies": []}]}, {"body": "What is the consensus here? \nI just bought 20 shares  @ $6.3765... buy more or avoid?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Man, just hold this stock long. buy it then forge about it. Put it on the backburner for 4-6 months and then you can go back and look at your mad gainz. Its a lot better then buying tips and selling dips.", "score": 10, "replies": []}, {"body": "We've all been there. One thing I've started to do thats really helped, is to set a price for yourself that you'll get out of the trade. (both a high and low price). You could write it on paper or in a notepad file, Or actually set up a \"good til canceled\" order that has a sell price and a stop loss.\n\nGoing about it this way takes your emotions entirely out of it. (which is how most successful traders operate). Since you've already scripted your moves, there is no more emotion, you just follow your script.\n\nNow, there isn't anything saying you can't re evaluate your position and change those price points. (say the company releases news about something that wasn't on the radar,. you may want to increase your sell price). But you should ideally always have an idea of what number you'd be looking to sell at. Either for a profit, or for a loss. ", "score": 5, "replies": []}]}, {"body": "I'd wait a couple days to see what it evens out at. ", "score": 1, "replies": []}, {"body": "Bought in at 6.94 and 6.90, average of closer to 6.91. Don't think it's gonna drop more before bounding up. ", "score": 1, "replies": []}, {"body": "In at $4.20 and I was pissed when it was down to $1.91 - climb, fall, IDC - still making a bit of cash finally after living the free fall of the past year or two.", "score": 1, "replies": []}, {"body": "when will AMD issue the new shares exactly? Will the price drop  when that happens because of the dilution? Looking to buy AMD but iv never bought stocks before so I'm new at this.", "score": 1, "replies": [{"body": "they have already been issued ", "score": 1, "replies": []}]}, {"body": " I'm just saying this stock is going in the right direction.. The company is restructuring and stabilizing.", "score": 1, "replies": [{"body": "> Mortimer \nDo you anticipate AMD stocks to get to where INTC or NVDA are now?", "score": 1, "replies": []}]}, {"body": "Short term dilution will be minimal to long term growth with this decision. Play the swings or just turn the page and hold.", "score": 1, "replies": []}, {"body": "just keeps dropping...", "score": 1, "replies": []}, {"body": "Get in now it's climbing!!", "score": 1, "replies": []}, {"body": "Monday.", "score": 1, "replies": []}, {"body": "Just got in at 5.83 plan to sell out near the end of 1H 2017 when they're done releasing their new CPUs and GPUs", "score": 1, "replies": []}, {"body": "Sell Mortimer sell", "score": 1, "replies": []}, {"body": "It's a bit late I'd say. ", "score": -3, "replies": []}, {"body": "Cheap stocks are cheap for a reason.  Pick any other profitable chip stock.  INTC or NVDA are worth studying.", "score": -7, "replies": []}]}
