{"title": "My experience selling spreads", "selftext": "I've been selling bull put spreads for a little over a year. \n\nMy strategies were religiously following these two rules of trading small and never taking on tremendous risk, ie I would almost always do 1 strike width *occasionally* I would do 2 if it was very far OTM (ie AAPL which is fairly stable yet still has decent IV). I never held anything through earnings. \n\nI seem to have suffered precisely what this article is talking about: \nhttps://medium.com/@benlatz/option-trader-cleanse-c7c5cdcd130e\n\nI would pick up consistent winners but then I would occasionally have those weeks when they would be ITM wiping out all previous profits, ie what happened this week. \n\nTo give you an idea of where my account is from a year of trading, I'm at +$450. This is with investing roughly an hour or so a day to either set them up, monitor them, adjust, reading news, etc. IMHO this is quite poor for the time invested. \n\nNot looking for sympathy, maybe some opinions or mostly just venting. I have one of my big board exams coming up in the spring and I think this is my lesson to stop trading options. ", "id": "9nleso", "created_utc": 1539359360.0, "score": 48, "upvote_ratio": 0.89, "num_comments": 67, "comments": [{"body": "The people who are most confident in their premium selling skills are the newbies.  I can't say every premium seller experiences this but I know I have.  Even when you have 80% odds, the less likely thing will happen about 1 in 5 times.  That's worse than russian roulette odds.\n\nYou can arm yourself with option pricing knowledge and have a list of ways to adjust a trade standing by but there'll always be tough decisions to make.   Decisions that separate the winners from the losers.  It's not free money at all.", "score": 25, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "Gotta have that positve expectancy.  ", "score": 5, "replies": []}, {"body": "Do you find that your poker training serves you well in trading options?  I've been trying to convince a poker-winning friend of mine to turn his big brain toward the options markets because it seems like a similar skillset.  ", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Good to know, thanks!", "score": 1, "replies": []}]}]}]}]}, {"body": "This may not be the most welcoming environment for this opinion / story, but what the heck. Here's my experience.\n\nI was in pretty much the same position as you a year ago. I'd been trading options for a little over a year with some good success at times (about $3500 up at my highest), but then I'd get cleaned out on a few trades that went south. I was also mostly selling bull put spreads, following the Tastytrade method in general, trading small and often, etc. I ended 2017 up on the year, but not by a whole lot. I'm fairly young, so of course most of my trades were in a taxable account, not my IRA (the Tastytrade guys seem to think this is the way to go anyway) so at the end of the year, I took even more of a hit on capital gains tax.\n\nThis was kind of the last nail in the coffin for me. I was getting up early to trade every day (west coast) and spending a few hours on it every day checking trade progress and such. I just reached a point where I realized I would need to invest a LOT more time to eventually reach that mythical \" wise and successful trader\" level, which to be frank, i'm not sure many people every really achieve. There are so many people out there touting their knowledge, but hardly anyone ever shares their actual performance. To be clear, i'm NOT saying I don't believe people can be successful at this, just that a lot of people like to talk a big game, and you never really hear from those who fail. In any case, it all started to seem like a zero-sum game to me—one that would take an incredible amount of time and expertise to tip in my favor.\n\nI'm glad I tried options, as it taught me a TON about investing in general, and a lot about the interesting metrics surrounding trading (Delta, IV, POP etc). Honestly, it was also pretty fun at times. In the end though, I joined the herd and switched over to more of a \\*gasp\\* passive investment strategy, and i've been a lot less stressed about my savings since. I've now been using my time to focus on ways to reduce my spending and increase my income, which is proving to be a very effective way of filling up the coffers—much more so than pouring over options every morning. It's also a strategy that's under my control for the most part.\n\nI don't mean for this to be a negative post, and if you enjoy trading options, by all means continue! I just thought i'd share my story to hopefully balance the scales a bit compared to the other feedback you might receive.\n\nEdit: formatting.", "score": 14, "replies": [{"body": "Not negative at all, really appreciate you sharing this!", "score": 1, "replies": []}, {"body": "Great perspective, thank you. I am starting to feel a similar way,  in that perhaps efforts expended in the pursuit of options trading are more efficiently spent elsewhere.\n\n", "score": 1, "replies": []}, {"body": "Where's the fun in that? I think most of us like trading as a game even though we tell ourselves it's about making money. But good for you if that's what you really want.", "score": 1, "replies": []}]}, {"body": "I am late to the thread. I'd guess your result is in the average range (within the first standard deviation either way from the median). On the Internet is mostly the winners (and liars) that tend to post. \n\nFor first year option traders, I see breaking even as a good result. Unless a person is a natural at trading, the learning curve for options tends to be steep. I'd guess maybe 5% of personal investors are active in options, and half of those probably just do covered calls.\n\nFor average people with smallish accounts, trading tends to pay a very low hourly rate. For young people, focusing on job skills, and their professional networking, tends to pay way more per hour, with a more predictable and bigger life time payoff. So unless a person enjoys trading, I suggest young people focus on studies and network. For every newbie unicorn with an outstanding result, there are hundreds that are average, and more than a few that lose everything.\n\nHopefully all reading have avoided the biggest rookie mistakes: trading too big, trading illiquid products, failure to plan. Stated in positive terms, trade small, trade liquid products, have a plan. ", "score": 8, "replies": []}, {"body": "What is your win/loss record? \n\nWhen a position goes against you, what have you done to prevent max loss?\n\nCare to share your setup?  DTE, Delta/Prob ITM, stocks (if other than AAPL), IV, etc.?\n\nHow have you been adjusting when needed?  What are your triggers to adjust?\n\nIt just doesn't make sense that in this strong bull market you can only be $450 ahead.  Reply to the above with your trading plan if you would like some feedback.", "score": 7, "replies": [{"body": "I'm not sure how to check W/L in TW. It's not viewable in Robinhood who I switched to after getting level 3 access. \n\n>When a position goes against you, what have you done to prevent max loss? How have you been adjusting when needed? What are your triggers to adjust?\n\nSometimes it would occur too quickly where the stock price would be below my long put. In which case nothing really. If they were approaching my short put and the spread value was more than the credit I received I maybe let them play out a bit longer than I should have if there was still 15+ days left. \n\n> Care to share your setup? DTE, Delta/Prob ITM, stocks (if other than AAPL), IV, etc.?\n\nDTE somewhere between 40-50 depending on volumes, I learned early on less than 20 was too risky. POP at least 70%. AAPL, AMZN, NFLX, TSLA, basically whatever had high IV ranking in TW notable stocks, except for ones where IV was high due to earnings, just avoided those. \n\n> How have you been adjusting when needed? What are your triggers to adjust?\n\n50% profit was the most common, sometimes going as high as 75% with AAPL. \n\nTo give an example of one that REALLY hurt was 350/347.50 4 lot on NFLX expiring today. This was opened when the stock price was around $390. ", "score": 2, "replies": [{"body": "My feedback is you are trading the wrong stocks.  The ones you note are very volatile and far too expensive to handle assignment if needed.\n\n40 - 60 DTE is good to be safe while hitting near the top of the Theta decay curve.  70% Prob OTM is good, but going as high as 85%, especially with high IV stocks can give you an edge.\n\nIt will help a lot to be ready to roll when challenged, even if just to lower the net loss, but you should be able to roll for a credit if timed right, but a small debit if necessary.\n\nIf you continue to trade options, pick smaller stocks that you can handle assignment on.  Look for profitable companies with stock in the $15 to $50 range that are stable and pay a dividend.  These will not swing so wildly and will not pay the high premium, but will not whipsaw you so much.  Keep in mind that 10 trades of $75 profit each are the same as 1 with $750 profit potential, but with a lot less risk . . .\n\nDevelop triggers to roll and if you can't, then take assignment and sell covered calls while waiting for the stock to rebound.\n\nTrack your trades in a spreadsheet, know your win/loss rate, which trades worked and which didn't, what credits and debits you take in on each position, etc.  If you manage this like the business it is then you will be far more successful.  \n\nLastly, get TOS or one of the big option platforms.  If you are serious about trading options successfully you need the right tools for the job.  TW is coming along, but RH is a joke for beginners to lose their money on.  You are paying more in hidden ways on both those platforms.  Most new traders are reporting $1 commissions on TOS so they are very competitive, but if you want to give yourself the best chance to run your options trading like a business then get the best platform.", "score": 17, "replies": [{"body": "Great advice.  But what's wrong with TW?  So far I noticed their mid price is always wrong and I have to double check it against another broker like IB.", "score": 2, "replies": [{"body": "While they are pretty good and adding features slowly, they are still far behind TOS in capability.  \n\nAlso, they use external market makers that pay TW for trade volume.  TOS has their own internal, so fills are faster and at better prices. \n\nI think most any trader would agree TOS is the very best and since you can now get very comparable commissions, why not use the best?", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I just helped a friend open an account and he got $1 per contract with no ticket fee before he even funded the account.   Someone else posted they asked and were moved down to $1 by just asking.\n\nBoth were relatively new traders who said they were looking at TW and expected to trade a good amount of options, both of which are true.\n\nNote I contacted them last month and they moved me down to .75 per.  They are very competitive and looking for customers.  ", "score": 1, "replies": [{"body": "How did you contact them to negotiate the commissions? Just through their phone line to Client Services? I want to use TOS because I'm used to the platform from paper trading and I like it more than the others but I really can't justify that $6.95 + $0.75 per contract fee.", "score": 1, "replies": [{"body": "as a point of reference, I had $350 in my account with 2 real money trades under my belt after papertrading for about 2 months and I called them up after chatting with /u/ScottishTrader . I said I was thinking about switching to TW for the lower comissions and the guy put in a request to have my fee structure changed. I got $1.25/contract which was good enough for me to stay. The free closing is nice but I'd rather put my time in learning the stock market than re-learning a new platform and keep my peace of mind about quality. /u/oryza162 for your reference too (my stock price is 4.95 i think also)", "score": 2, "replies": [{"body": "Awesome. Thanks for the perspective. I’m gonna see what kind of deal I can get. :-)", "score": 1, "replies": []}]}, {"body": "Since I trade through them a lot I just asked through a Support/Chat message.  But others have called up to make the request.\n\nIt is super easy to do.  I think key is if you will trade more if they lower the price as they want to make up the lower cost through volume.  Let them know you’re looking to move over from about her broker and looking to trade more if the price can be lowered to $1 per contract it’s no ticket fee.  ", "score": 1, "replies": [{"body": "I learned options through paper trading on TOS, but have been using TW for the last year or so due to the low commissions. I use TOS for analysis so I’m going to give this a shot. Thanks for the tip! ", "score": 2, "replies": [{"body": "Can’t hurt!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’ve asked them twice now to reduce my commissions and they refuse. I get charged $1.50 per contract per side. Needless to say, I stick with tastyworks and robinhood to execute trades. ", "score": 2, "replies": [{"body": "That’s too bad.  Keep trying is all I can say.  I would still trade with TOS at $1.50 as I feel I can make more profitable trades to more than make up for few dollars per transaction more it cost.", "score": 1, "replies": []}]}, {"body": "Cool thanks", "score": 1, "replies": []}, {"body": "Wouldn’t the use of third party clearing firms generate more competition, giving you better fills than an in house clearing firm where there literally is no competition?\n\nI’ve never had an issue with fills on TW other than sometimes IC’s at mid price, but sometimes you have to give up a penny or two and other times, you’ll get the extra penny ", "score": 1, "replies": [{"body": "They will start in-house and fill from inventory or another TOS trader, then if not will go out on the open market, so fills are TOS are far faster in my experince.  My trades on TW almost always seem to sit and I have to adjust to get filled.  I’ll also note that TOS will give me a better price than I entered on a percentage of my trades, I’ve never seen any “price improvement” through TW.\n\nAs I say, TW is getting better, but I disagree a 3rd party who takes a piece of the action can give better pricing.", "score": 1, "replies": [{"body": "Hm maybe tos defaults to the natural price and tw defaults to the mid, which makes it seem like they give poor fills?\n\nI’ve been price improved a few times on tw but have no experience in tos so I can’t comment on the frequency. I have an account but only ever used it for data analysis purposes ", "score": 1, "replies": [{"body": "In my experience, Fidelity Active Trader Pro offers the best price improvement, nearly every time I make a trade on that platform I get a better price!\n\nThey still have the ticket fee and I haven't asked to have that dropped, but I could see moving more trades over there since the improvements alone would more than makeup for the higher cost.", "score": 1, "replies": [{"body": "Hm I’ve never even thought of using fidelity for options trading, will have to check it out. Thanks for the tip ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Thank you very much, all great advice. As I suspected I still have lots of learn and maybe like others are saying basically coming out breaking even is perhaps not so bad. Regarding TW the thing I really like is it's free to close out trades which can be significant when it's $2 vs $4 for two leg strategy. I have read the threads on negotiating TOS down, I strongly suspect I do not do the volume for them to do that for me. \n\nIf you have any ideas for cheaper stocks to look at I am all ears. IV was the primary thing I was looking at when trading them. ", "score": 1, "replies": [{"body": "Any short option can be closed at no cost on TOS if at .05 or lower.  Often I'll close the short leg and just let the long expire.  But if it works for you then go for it.\n\nAnother comment about trading small is really good.  You should look to make $40 - $50 on an option, not hundreds,  Believe it not the small numbers add up fast, and if one does blow up it doesn't burn down your account.\n\nOn stocks, start with fundamental analysis to get solid companies, and use IV as your very last criteria to choose between different stocks.  You should be trading between 10 to 20 symbols, and as the other post notes, being diversified is also critical so one sector like tech won't burn you down either.\n\nNote that TOS has an excellent scanner to find stocks and options, but you can do this manually as well.  I think it is important for every trader to make their own stock watchlist and never to listen to stock tips.\n\nAll of this should be included in your options trading plan.  How to select stocks, options strategies, sizes, when to enter, P&L targets, when to roll and how to manage if things go wrong,  logging and metric tracking should all be part of a plan.  If you are losing money then stop and review your plan to find out what went wrong, then adjust your plan.\n\nTreat this like a business and not a hobby as businesses make money and hobbies cost money . . .", "score": 6, "replies": [{"body": "What kind of returns have you been experiencing with the wheel?  I think OP has a good point about how strategies are easy to come by, but most traders are reluctant to share specifics.  I like your strategy a lot, but have been reluctant to pull the trigger on committing to it because I'm not aware of convincing demonstrated success or backtest data proving it's better than simple buy-and-hold over the long term.  ", "score": 1, "replies": [{"body": "I’m above 40% this year, and it has been very good with this bullish market.\n\nYou should paper trade the strategy to get everything dialed in, then start small for your first real trades to prove this out for yourself.\n\nThe Wheel type strategy is about as low risk as options can get.  Your very worst case scenario is if you choose a stock that drops and you have to hold it tying up capital while you work your back to profit, so choosing the right stock to do this with is very important.  \n\nBut don’t take anyone’s word for it, paper trade it to see how it works.    ", "score": 3, "replies": [{"body": "40% is unreal.  Have you been doing it long enough to know what kind of multi-year strategy to pursue?  And how near-the-money do you prefer to trade on both the put and call sides?  Is it unique in every situation or do you have some rules of thumb?", "score": 1, "replies": [{"body": "No, 40% is average.  Sell OTM cash secured puts (CSP) over and over, closing or rolling for a credit as needed to avoid assignement to collect premium and lower the net stock cost if assigned.  If I can’t roll, then take assignement and sell covered calls until back to a net profit, and if the stock is moving back up then sell more CSPs.  Most of the time I am holding no stock and am just collecting premium from the CSPs.  Keep track of your credits as they add up and will make reaching a net profit easier.  I’ve sold CSPs for months brining in income without being assigned.  Not sure what you mean by a multi-year strategy.  .30 Delta about 30 DTE, on Puts for a few reasons but especially in this bull market, is my standard setup.  I’ll look to close and open, or roll, to a new position at about the 50% profit point.\n\nMany call this The Wheel, and stock selection is critical as you want to avoid getting stuck with a loser stock, although you can dig out from even those with patience.  Choosing the best stocks is critical and takes a lot of the effort on this.\n\nI’ve posted this at least a dozen times in this group.  It is very simple and about as safe as option trading gets if you pick the right stocks and are patient.  ", "score": 4, "replies": [{"body": "Many thanks!", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">  IV was the primary thing I was looking at when trading them\n\nTry thinking about IV a little differently. High IV is not inherently better, and in theory high IV incurs no advantage at all. It means you take in a higher credit, and you will also have trades blown out more often. You can’t only look at half the equation, the reward, and make an accurate assessment. You can sit down at the biggest poker game in Vegas where there are millions of dollars on the table, but you are sitting with a bunch of stone cold killers who are going to take your money unless you get lucky.\n\nWhat I think people are saying when they are looking for high IV is more accurately “not low IV”. It’s definitely the case that an option can have such low IV that selling IV is almost certainly a losing trade from the start, and some options strategies will perform better in high IV environments, but just going for max IV is not a good idea by itself.\n\nThink about a sports betting analogy. Some people bet on the New England Patriots at a point spread of -6 points because Tom Brady is undefeated at home when coming off a loss (or whatever). That’s asking the wrong question. The question is not, “is Tom Brady really good?” The question should be, “why is the point spread of -6 wrong?”\n\nSo with bull put credit spreads, it’s not a question of finding high IV. You can estimate your odds based on credit received and max loss, along with each leg’s POP, so then you can say that if price moves past this strike more than 15% of the time then this will be a losing trade (or whatever), and then it’s a question of why do you expect the underlying to not move past that price more than 15% of the time? Usually the answer to has to do with price action, analyzing the current trend, retracements, support and resistance, and so forth. Looking at that entire equation, credit received is only one variable.\n\nI find the idea of “non-directional trades” kind of silly. Even with completely symmetrical spreads like straddles and strangles, you still need to address the question of why you expect the price to move or not move at certain levels. If you are not doing directional analysis you are losing money to people who are.", "score": 3, "replies": []}]}, {"body": "How is robin hood charging hidden fees?", "score": 1, "replies": [{"body": "Geez, let me count the ways.\n\n- Holding your money for days when funding or pulling money out of the account\n\n- Using an external market making service that pays them for trade vol, that adds cost through slower and more expenseive fills.\n\n- Poor support to help you of a trade that won’t go through.\n\n- Virtually no tools for analysis and knowing the probabilities for trades, which are key to winning IMHO.\n\n- Take a look at r/Robinhood to see hundreds of situations where people are losing money due to issues with the app, support, pricing, fills, etc.\n\nI’ll happily pay a few bucks to have all the tools, features, real time support and speed of quality fills.  I’ll not only trade better but will make more than enough to make up for the small commissions charged.\n\nIf you’re not aware of the way RH is making money and impacting your trading you are not paying attention.  As I’ve said before, if you’re playing around RH is fun and fine, however if you are serious about making money with options you will want to use the right tool for the job in a full featured trading platform.     ", "score": 2, "replies": [{"body": "Thank you for this. Understood", "score": 1, "replies": []}]}]}]}, {"body": "Listen to /u/ScottishTrader.  I would only add that you should keep your position sizes small, around 1-5% of your account balance and that's based on the amount at risk, not the contract cost.  So if you have $10k, you should never put more than $1-500 at risk or as the initial margin requirement in any single trade. That should put a pretty hard limit on the scope of underlyings available to you but it will also greatly reduce the ability of any one trade to blow up your account.  It also forces better diversity which is also key. Diversity in every way possible - industries, equity types, nationalities.  You know...*diversity.*  \n\n\n[https://optionalpha.com/wp-content/uploads/2015/01/Trade-Size-Allocation.pdf](https://optionalpha.com/wp-content/uploads/2015/01/Trade-Size-Allocation.pdf)", "score": 5, "replies": [{"body": "This is an awesome post, thanks!", "score": 2, "replies": []}]}]}]}, {"body": "Honestly, that article is simplifying the matter to an extreme degree, and isn't particularly helpful.\n\n>I would pick up consistent winners but then I would occasionally have those weeks when they would be ITM wiping out all previous profits, ie what happened this week.\n\nTo put it simply, this is a negative skew strategy. Nothing wrong with that, but the goal is to have positive skew. \n\nWhy? \n\nLong story short, achieving a good Sharpe ratio is significantly easier with a negative skew strategy, and metrics measuring the success of a strategy with negative skew are likely to be overstated. \n\nThere are ways to remedy this. It's still possible to sell premium, yet have your overall strategy be neutral skew. \n\nThe main method is in entry and exit timing. \n\nIf you are using a trend following strategy where you cut your losers early, but let your winners run, you are actually injecting a positive skew into your overall strategy. It's essentially a hedge against your negative skew strategy of selling premium. \n\nLong story short, you need a way of correcting the skew of your premium selling strategy. How you do it is the question. \n\nSecond, the idea that IV ranks don't matter is absolutely absurd. Just because you don't understand what IV is actually telling you doesn't mean you'll profit more by not using it (more directed at the article, sorry lol).\n\n\n\n", "score": 2, "replies": [{"body": "At first I thought the article was really bad, but now I get it, basically if you're breaking even or doing worse with spreads, then you need to switch strategies for a while and the blogger is suggesting selling naked.\n\nThe reason why he ditches IVR is because options are already overpriced in SPY, so a spread isn't going to help, **you're always going to sell and/or buy expensive options** (the sourced tastytrade video showed an ATM put spread had a 5% yearly gains, backtested over 10 years, while the strangle was about 25% gains).\n\nA while ago I did my own tests (not backtested) comparing strangle, iron condor, straddle, and iron fly w/ 10 (0.10) delta wings on some stocks and index ETFs and no matter what the IVR was the avg p/l I came up with showed that straddles and 10 delta iron flys had the highest p/l.\n\nAnother thing with my tests, straddles had a lower loss at 1.5 standard deviation compared to the other 3 combos above.  The iron flys max loss and 1.5 SD loss were on par with iron condors, except the avg p/l was waaaaay higher (almost 10x), probably because the 10 delta wings are incredibly cheap (again the blogger's point that options are overpriced comes to mind) and basically a 10 delta wing iron fly is closer to a straddle except you get to leverage more.\n\nI think the blogger should have explored other spreads like a 10 delta iron fly; if he's obsessed with selling naked due to overpriced options, then a vertical spread with a 10 delta or lower long option will let him stay effectively naked but leverage more.", "score": 3, "replies": []}, {"body": "What do you mean by skew?", "score": 1, "replies": [{"body": "[Here's the investopedia article on it.](https://www.investopedia.com/terms/s/skewness.asp)", "score": 1, "replies": []}]}]}, {"body": "I don't think you should quit. You should consider ways of hedging your losing spreads buying strikes closer to the money than your short strike, IF you find yourself at like 30% max loss and you don't want things to get worse. Ideally the profit from your long position closer to the money should negate the max loss of  of the credit spread. If price drifts back higher you can always sell the long position back for a minimal loss and continue collecting premium. It sucks limiting profit but it's better than reaching max loss.", "score": 2, "replies": []}, {"body": "Credits spreads are harder than they seem. The loss curve can be very steep. The chance of max loss often not much different than the probability of profit. They can be fairly binary and have few management strategies that are timing critical.\n\nMaybe consider adding other strategies like calendars, diagonals, naked puts on smaller stocks you don’t mind owning, etc.\n\nAlso look at how to hedge. Maybe get long AAPL and put in a short delta calendar position on QQQ, or sell a call spread. Make sure you still make money if they both go up , Qs lose less, but hopefully AAPL goes up more. Set your long position up so it really expands if AAPL rallies, etc. mix in some long volatility plays.\n\nYou made a profit so far , however small, don’t consider that defeat. But if you don’t enjoy it anymore maybe buy an index fund and do something else.", "score": 2, "replies": []}, {"body": "Diversify strategies ", "score": 2, "replies": []}, {"body": "That's still $450 more than you would have had otherwise. I myself look to end the year up. I try to be up as much as I can, but as long as I'm still up, I figure it was worth my time. I don't spend as much time as you do it seems, but, since it's time doing something I enjoy doing, I don't mind.\n\nLike you, after the past couple of days, I may end up being only a  few hundred dollars ahead.. but, Its still up.", "score": 4, "replies": [{"body": "The point is if you spent 100 hours making 450$ you are wasting your time and need to give up the trading dream.", "score": 3, "replies": [{"body": "That’s not how getting better at something works. If in year 10 he’s still spending 100 hours per year to make 6-figures while trading from the beach, that’s not wasted time. That time in year 1 was possibly the most valuable time he could have spent.", "score": 1, "replies": []}]}]}, {"body": "Better go LEAF.  Spread kills the Deltae<", "score": 1, "replies": []}, {"body": "Have you backtested your strategy? How does the equity line look? How far back does your backtest go?", "score": 1, "replies": []}, {"body": "Following a rote pattern in a system that is statistically random (in the short term) will average out to a 50% success rate overall, or 0% profit in the end.\n\nThink of the time as an investment towards learning about options and what is possible. Depending on your interests and experience, you might try \"investing\" rather than \"trading\" in products or companies that you strongly believe will do well or poorly (if you want to stick with shorts) in the long run.\n\nSome quotes I like to think about when I make investments (or investing mistakes):\n\n\\-Proper investing should not be exciting. It should be like watching paint dry.\n\n\\-If you wouldn't want to own a company for 10 years, don't even think of owning it for 10 seconds.\n\n\\-Hold a stock for a long as you think it has room to grow. Don't sell based on what you think the market will think of the stock.", "score": 1, "replies": []}, {"body": "Options trading should not be sexy, or exciting.\n\nIts about position sizing, risk and reward management, and continual emotional stress.  \nIt is a business, and over time... you should strive to be right 6/10 times.  \nIn our tracked portfolio we are falling behind and are currently 5.3/10. while still nursing a 60% + ytd return.  \n[https://docs.google.com/spreadsheets/d/1OkY3-xzg5zqFXqBlZAqSm8yXLhn6QoZ4mFJ68SNKI8I/pubhtml](https://docs.google.com/spreadsheets/d/1OkY3-xzg5zqFXqBlZAqSm8yXLhn6QoZ4mFJ68SNKI8I/pubhtml)\n\nWith hot and cold periods that can extend...  \nBut that's the game...\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;", "score": 1, "replies": []}, {"body": "+$450 for the year? Gayyyyy. YOLO your whole account into MSFT leaps and fuck off ", "score": -5, "replies": [{"body": "WSB, bud?", "score": 4, "replies": [{"body": "I mean yes, but he’d get way better less risky returns doing this. Bet he doesn’t remember the XIVcession doing that selling shit ", "score": 1, "replies": []}, {"body": "Also, I said leaps not FDs. This is actually solid investment advice. As long as the next recession doesn’t hit you’d be golden. It’s fuckin Microsoft ", "score": 0, "replies": []}]}]}, {"body": "Learn TA and trade futures, you can make $450/day easily.", "score": -1, "replies": [{"body": "what kind of TA strategy? I'm assuming ES mini?", "score": 1, "replies": [{"body": "ES or NQ.  EQ breaks alone work well enough to be profitable. ", "score": 1, "replies": [{"body": "Where would you suggest starting reading from?", "score": 1, "replies": [{"body": "General TA: https://www.youtube.com/watch?v=rlZRtQkfK04&list=PLyG201CX9K8Xwp2fsarUncC4jUlR-prad&index=3\n\nFutures: https://www.youtube.com/user/PATsTrading\n\nBooks: https://www.amazon.com/Trading-Zone-Confidence-Discipline-Attitude/dp/0735201447\n\nhttps://www.amazon.com/New-Trading-Living-Psychology-Discipline/dp/1118443926/\n", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "General TA: https://www.youtube.com/watch?v=rlZRtQkfK04&list=PLyG201CX9K8Xwp2fsarUncC4jUlR-prad&index=3\n\nFutures: https://www.youtube.com/user/PATsTrading", "score": 3, "replies": []}]}]}]}, {"body": "Well yes, but what account size to make $450/day?", "score": 1, "replies": []}]}]}
{"title": "Global stocks rebounding from worst 2-day skid for the S&P500 since February", "selftext": " \n\n### US Stocks\n\n* **Global stocks appear to be taking a pause from their recent skid this AM** with US stocks poised for the best day in more than 6-months as we enter the 3Q earnings season \n* US stocks index futures are rising ahead of the open in NY with the  Dow Jones minis +1.09%, S&P500 minis +1.14% and Nasdaq 100 minis  1.70%\n* The 2-day plunge in the S&P500 (-5.35%) is worst 2-day move since February 2018 \n* There are unsubstantiated rumors that the move in global stocks the  past 2 days was caused by sector rebalancing at quantitative funds  & selling by ETFs \n* The VIX is  moving down this morning and is currently at 11.78 after closing at 24.98 last week\n* While the recent jump in VIX has grabbed headlines, we think it is  more interesting to highlight that the VVIX, a measure of the volatility  of the VIX, is at its lowest level relative to the VIX since April 2018  – that implies the cost of buying VIX options is relatively cheap \n* The US Treasury staff has advised Secretary of the Treasury Steven Mnuchin that China is not manipulating its currency\n* The People’s Bank of China (PBOC) set the daily reference rate to  6.9501 -- the 9th straight session where the rate has been weakened and  suggests the PBOC isn’t overly concerned with a depreciation in the Yuan\n* The Wall Street Journal is reporting that US President Donald Trump  plans to meet with Chinese President Xi Jinping during the G-20 summit  in Buenos Aires, Argentina in November\n* SPY October 19 & November 16OTM Puts, XLF November 16 &  January 2019 OTM Puts, Petrobras (BOVESPA: PETR$; ADR: PBR) November 16  OTM Calls, and Bank of America (BAC) October 12 OTM Calls are the most  heavily traded options contracts in the US pre-market\n* 10-Year Treasury Bonds are lower with yields up 1.9 basis points to 3.1688%\n* The US Treasury 2s-10s Spread has widened 0.22 basis points to 0.3%\n* The International Energy Agency (IEA) cut its forecasts for global  oil demand in C4Q2018 and CY2019 on decelerating global growth but  believes global oil prices will remain elevated on account of a drop in  global oil supply – the IEA warns that higher oil prices could pose a  real threat to global economic growth\n\n### Stocks Trending in the News\n\n* **Amazon (AMZN)**  could enter the Brazilian drug store market as a next move, according  to a report by Morgan Stanley.  In the wake of Amazon’s acquisition of  online pharmacy, PillPack, Morgan Stanley thinks its next move in the  space could be into Brazil to take on local player Raia Drogasil SA  (RADL3 BZ).  Any move by Amazon would not threaten Raia Drogasil near  term where the barriers to entry are higher than in the US.  Amazon is  rated ‘Neutral’ in our US Large-Cap Global Top Picks and ‘Top Buy’ in  our US Consumer Discretionary Global Top Picks, Raia Drogasil is rated  ‘Attractive’ in our Brazil All-Cap Global Top Picks\n* **BlackRock (BLK)**  won a mandate to manage 30 billion pounds (USD$40bn) of the 109 billion  up for grabs from Lloyds, a statement from Lloyds Banking Group (LLOY  LN) informed.  Lloyds went on to say that it expects to have greater  collaboration with BlackRock going forward.  Lloyds Banking Group is  trading up 1.8% at 58.93 pence.  Lloyds Banking Group is rated ‘Neutral’  in our United Kingdom All-Cap Global Top Picks, BlackRock is rated ‘Top  Buy’ in our US Large-Cap Global Top Picks\n* **Brilliance Automotive (1114 HK)** plunged 27% to close at HKD$7.90 after agreeing to give control to **BMW (BMW GR)** of  its JV with them.  Brilliance Automotive will limit its exposure to the  growth in the Chinese market by giving BMW control, dimming the  prospects for the stock, according to analyst comments.  BMW is trading  1.1% higher at 74.88 euros.  Brilliance Automotive is rated  ‘Unattractive’ in our China All-Cap Global Top Picks and BMW is rated  ‘Unattractive’ in our European Large-Cap Global Top Picks\n* **Intel’s (INTC)** stake in **ASML (ASML NA)** has  dropped to 2.99%, below the threshold for reporting, according to Dutch  regulator AFM.   In the filing from last year, Intel reported holding  4.96% of ASML.  In 2012, Intel committed to taking a 15% stake in ASML  saying it would invest USD$4.1bn.  Intel said at the time the investment  in ASML had the goal of shaving 2 years off the time it takes to  develop new production techniques.  ASML is trading 0.43% higher at  150.54 euros on the news, Intel is bid 1% higher in pre-market trading.   ASML is rated ‘Neutral’ in our European Large-Cap Global Top Picks and  Intel is rated ’Neutral’ in our US Large-Cap Global Top Picks and ‘Top  Buy’ in our US Information Technology Global Top Picks\n* **JP Morgan (JPM)**  reported 3Q EPS of USD$2.34 above consensus of USD$2.25.  JP Morgan  report equities sales & trading revenue above expectations, coming  at USD$1.6bn versus USD$1.42bn expected while fixed income sales and  trading came below at USD$2.84bn versus USD$2.96bn expected.  JP  Morgan’s investment banking revenue of USD$1.73bn was below USD$1.84bn  expected.  JP Morgan is bid slightly higher in pre-market action.  JP  Morgan is rated ‘Neutral’ in our US Large-Cap Global Top Picks \n* **Newmont Mining (NEM)**  saw trading in its options contracts yesterday that was three times the  average volume of the last 20 days.  Newmont Mining saw 21,617  contracts change hands compared with 6,623 average for the last 20  trading sessions.  Newmont Mining releases earnings on October 25th.   Newmont Mining is rated ‘Unattractive’ in our US Large-Cap Global Top  Picks\n* **Pandora (PNDORA DC)** is  trading 5.6% higher at 412 krona amid speculation it may have hired an  advisor to help it field potential buyers.  Pandora also benefitted from  a note from broker Carnegie after its dealer survey showed the best  feedback from dealers in the US in 3 years.  The news has sent Pandora  higher for the second day with short sellers appearing to get squeezed.   Pandora is rated ‘Unattractive’ in our European Large-Cap Global Top  Picks\n* **Softbank (9984 JP)** has chosen **Nomura (8604 JP)** and **Goldman Sachs (GS)**  as global coordinators of the IPO of its Japanese wireless business,  according to a report in Bloomberg.  Softbank is seeking to sell  USD$27bn worth of stock and would be the largest IPO ever if completed.   Softbank will start marketing next month with the IPO set to price on  December 19th.  Softbank closed 4.6% higher at 9976 yen, Nomura closed  flat at 538.10 yen and Goldman Sachs is bid slightly higher in  pre-market trading.  Softbank is rated ‘Attractive’ in our Japan  Large-Cap Global Top Picks, Nomura is rated ‘Attractive’ in our Japan  Large-Cap Global Top Picks and Goldman Sachs is rated ‘Neutral’ in our  US Large-Cap Global Top Picks\n* **Standard Life Aberdeen (SLA LN)** CEO Martin Gilbert said, “if investors want to buy **Tencent (700 HK),**  now is the time to buy Tencent”.  He noted “it’s great to see this type  of correction” to allow for the purchase of high-quality stocks like  Tencent that recently were valued much higher.  Tencent closed 8% higher  at HKD$288.40.  Tencent is rated ‘Attractive’ in our China All-Cap  Global Top Picks\n* **Sunny Optical (2382 HK)** closed  10.7% higher at HKD$78.95 after reporting handset lens shipments grew  11% m/m, 61% y/y.  Sunny Optical report that monthly handset deliveries  have reached 100,000 units with market share gains in China and Korea.   Sunny Optical is rated is rated ‘Unattractive’ in our China All-Cap  Global Top Picks\n\n### European Stocks\n\n* **European stocks are advancing this morning**, off their session highs\n* The Euro Stoxx 600 is currently up +0.44%, the FTSE 100 is higher  by +0.61%, the DAX has advanced +0.38%, and the CAC 40 has risen +0.47%\n* European stocks are on track for their worst week since February 2018\n* Investor sentiment for European stocks is positive with the advance/decline ratio for the Euro Stoxx 600 currently at 2.43x\n* Basic Resources (+1.63%), Retail (+1.15%), and Automobiles &  Parts (+1.08%) stocks are the top performers in the Euro Stoxx 600 today\n* Utilities (-0.66%), Real Estate (-0.62%), and Chemicals (-0.39%) stocks are the worst performers in the Euro Stoxx 600 today\n* 6 stocks in the Euro Stoxx 600 are at 4-week highs while 460 stocks are at 4-week lows\n* 1 stock in the Euro Stoxx 600 is overbought while 290 stocks are oversold according to the 16-day RSI Measure\n* VSTOXX, the European stocks equivalent of the VIX, is  moving down  this morning and is currently at 14.23 after closing at 21.24 yesterday\n* EUR€ is currently little changed against the USD$ at 1.1581\n* GBP£ is currently little changed against the USD$ at 1.3222\n* CHF is currently down -0.218% against the USD$ to 1.0085\n* German 10-Year Bunds are lower with yields up 0.8 basis points to 0.526%\n* UK 10-Year GILTs are higher with yields down -1.5 basis points to 1.659%\n\n### Asian Stocks\n\n* **Asian stocks rebounded overnight**, following the previous 2-day drop across stock markets in the region\n* The Nikkei 225 finished up +0.46%, the Hang Seng ended up +2.12%,  the Hang Seng China Enterprise up +2.05%, and the CSI 300 was +1.49%\n* Hong Kong stocks closed the week down for the third straight week  as worries about US-China trade relations and decelerating global  economic growth is dampening investor enthusiasm in the region\n* Investor sentiment for Japanese stocks finished negative with the advance/decline ratio for the Nikkei 225 closing at 0.92x\n* 0 stocks in the Nikkei 225 hit 4-week highs while 110 stocks reached 4-week lows\n* 3 stocks in the Nikkei 225 closed overbought while 11 stocks closed oversold according to the 16-day RSI Measure\n* Investor sentiment for Hong Kong stocks finished positive with the advance/decline ratio for the Hang Seng closing at 2.57x\n* 0 stocks in the Hang Seng hit 4-week highs while 39 stocks reached 4-week lows\n* 0 stocks in the Hang Seng closed overbought while 15 stocks closed oversold according to the 16-day RSI Measure\n* Japan 10-Year Government Bonds are lower with yields up 0.4 basis points to 0.15%\n* JGBs 2s-10s Spread has little changed 0 basis points to 0.26%\n* JPY¥ is currently little changed against the USD$ at 112.29", "id": "9njr8f", "created_utc": 1539346545.0, "score": 209, "upvote_ratio": 0.94, "num_comments": 71, "comments": [{"body": "SNAP rallying quickly worries me. Have 11/23 and 1/18 puts. ", "score": 24, "replies": [{"body": "Looks like its getting buoyed by the market recovering overall, not because it stopped being terrible. I think you're ok.", "score": 28, "replies": []}, {"body": "Lmao I bought 10/19 puts around the peak ", "score": 1, "replies": []}, {"body": "Don’t worry friend, the pedos at snap will face judgement ", "score": -11, "replies": [{"body": "Found Elon's reddit account", "score": 13, "replies": []}, {"body": "What? ", "score": 5, "replies": []}]}]}, {"body": "But...but this sub told me the market would crash 40% and that the new Great Depression was here ", "score": 110, "replies": [{"body": "the day isn't over", "score": 35, "replies": [{"body": "It is now ", "score": 8, "replies": []}]}, {"body": "Yeah I was skeptical that we'd be reading about the \"Slight interest rate increase crisis of 2018\" in my kid's history book in 10 years. ", "score": 8, "replies": [{"body": "Stocks are trading at real high pe ratios though, so they'll be easily spooked.", "score": 1, "replies": []}]}, {"body": "The rally just evaporated and the market has recovered only 40 out of 1500 points it lost this week. \n\nInvestors are spooked because the mortgage market has been tanking for several months now and hasn't recovered. A 15% drop in mortgage applications over the last 2 months and refi mortgages have dropped to their lowest rate of applications in 20 years.\n\nInvestors are spooked and worried that next weeks earnings reports from the banks will be worse than expected. ", "score": 15, "replies": []}, {"body": "Could just be a dead cat bounce.", "score": 1, "replies": []}, {"body": "They also told you Hilary was going to be President", "score": -19, "replies": [{"body": "You know Trump hasn't done anything in office when the only thing him and his followers ever bring up is beating Hillary.  That was over 2 years ago...  ", "score": 17, "replies": [{"body": "Now that's a bot \n\n", "score": -21, "replies": [{"body": "!badtroll Убирайся отсюда русский тролль", "score": 7, "replies": [{"body": "Are you sure you're not an Iranian bot", "score": -15, "replies": [{"body": "Я буду говорить с вами на вашем родном языке", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "I just wanna know the names of all the dumbasses that overreacted and continued the slide.", "score": 64, "replies": [{"body": "Unfortunately it may not be overreacting.\n\nAs of 2pm the rally has basically completely failed and the market has failed to regain 1500 points. The rally is down to about 40 points recovered right now. \n\nAs investors dig deeper into the last few months of economic reports they are seeing extremely concerning information.\n\nFor instance, the rate of mortgages being taken out dropped an astonishing 15% since August, and the mortgage index was down 10% even before this correction.\n\nThe unemployment report also had a lot of concerning details, such as a massive 5% increase in people forced to take second jobs, from 7.3 million to 7.7 million.\n\nAnd this was after a trillion dollar tax cut was pumped into the economy. How bad would it have been if that didn't happen? \n\nInvestors are getting spooked. Those are not good signs. \n\n", "score": 21, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Hooray, we're back to the Spring!", "score": 2, "replies": []}]}, {"body": "How is this any different from Feb dump?", "score": 3, "replies": [{"body": "They are actually opposite of one another. The February dump came after record January mortgage applications, while this has come after a drop in applications.\n\nFebruary was a response to the market having been overinflated and correcting, while this is in response to it slowing down. \n\nSo they have opposite causes. ", "score": 5, "replies": [{"body": "The problem with fundamental analysis is there are a million factors you can cherry pick to argue whatever side you want.  As soon as earnings season hits and the big names start moving up again money will come pouring in because it's all just algos following trends.", "score": 10, "replies": [{"body": "I'm sure it's not just algos following trends unless they're designed to follow trends several days after the a big shift", "score": 1, "replies": []}]}]}]}, {"body": "Umm.. yea- nobody buys houses when school starts.  Check again next spring.  ;)\n\nOh- and a whole .4 milllion out of 7.7 million decided to get off the couch and maybe make more money instead of increasing debt?  If anything I would say more people getting a job is a GOOD thing- nobody is FORCING them as you state.  Most people that claim to be poor or need money still spend needlessly and maybe are now realizing the errors of their ways?  Call 1-800-pass it on, for debt 'forgiveness' now!!", "score": 1, "replies": []}]}, {"body": "Add me to this list pls", "score": 7, "replies": [{"body": ">For instance, the rate of mortgages being taken out dropped an astonishing 15% since August, and the mortgage index was down 10% even before this correction.\n\nThis is because most markets have lack of inventory of homes for sale and not mortgage related.   Buyers want to Buy but not many good deals available.   Prices will correct about 5 to 7% and Buyers will be back in full force.   Sellers right now are asking too much", "score": 4, "replies": [{"body": "Precisely, housing prices are insane and need to either stagnate for a year or come down. ", "score": 6, "replies": []}]}]}, {"body": "A lot of those people made money by shorting.", "score": 1, "replies": []}]}, {"body": "Not that I know anything but to me this bounce looks temporary.", "score": 23, "replies": [{"body": "It is probably is, but the fact that it *is* bouncing today suggests to me the downside is limited even if it drops further from here. I would have expected to see it bleed for 2 or 3 days straight before a bounce if we were in for a substantial correction. It's also probably a good sign that this bounce has been timid rather that furious (massive bounces come back down just as quickly).", "score": 3, "replies": []}]}, {"body": "What a close\n\nInfo Tech +3.22%", "score": 6, "replies": []}, {"body": "Ok correct me if I'm wrong but isnt it the right time to buy when the market is low? ", "score": 15, "replies": [{"body": "Wrong. Buy high sell low.", "score": 26, "replies": [{"body": "Lol good for you bad for me\n", "score": 3, "replies": []}]}, {"body": "Yes", "score": 14, "replies": []}, {"body": "Oh mercy this sub sometimes ", "score": 38, "replies": [{"body": "Seriously, buy high sell low, it's not fucking hard.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Not even as far back as March or April.   More like August from what I've seen ", "score": 6, "replies": [{"body": "Not really. We were up in January, but a steep drop in feb and March. Nice gains until October but this last mini crash takes us back to January at the same level. \n\nIt’s all in the charts if you know where to look (hint -try Google)", "score": 1, "replies": []}]}, {"body": "A lot are down 10 -15%\nBUY BUY BUY !!!", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Research ", "score": 4, "replies": []}]}]}]}, {"body": "No that's what everyone is trying to do. You will never make good returns with a herd mentality, you have to be a contrarian to succeed. That's why I always buy high and sell low.", "score": 9, "replies": [{"body": "Momentum/swing/trend following is life.", "score": 1, "replies": []}]}, {"body": "Today's low is tomorrow's high.", "score": 3, "replies": []}, {"body": "I would say it's more buy when the stock is low not the whole market.", "score": 2, "replies": []}]}, {"body": "Is this a dead cat bounce though?? I honestly dunno what to do short term. I've reduced my position by about %30, i then bought a little yesterday. What do yall think🤔? ", "score": 13, "replies": [{"body": "Idk let me check my crystal ball", "score": 37, "replies": [{"body": "Please let me know what it tells you! ", "score": 11, "replies": []}]}, {"body": "Played Tennis with an older gentleman who is super wealthy two days ago.  He gave me some wise advice.   He said there is a famous quote by morgan stanley or Jp morgan (forgot who).   Dont remember the exact quote but it said everyone should have a sleeping point.  Basically dont freak out and sleep good at night knowing stocks are very volatile.  Dont get spooked.  Markets are volatile but in long term you do well.  ", "score": 7, "replies": []}, {"body": "I personally believe it is ", "score": 2, "replies": []}, {"body": "I think so (dead cat). I'm a novice but from what I've read this is the first time SPX has broken support of the 200dma since 2016. When it first broke support (50dma) at 2880 earlier this week that was a bad sign...then it blew through 2770 (200dma) and yesterday dipped to 2710. Today the bulls fought tooth and nail to close the week above 2770 but came up short. We could see 2600 soon...or...upcoming earnings reports could provide a boon and keep the market going til 2019.\n\n&#x200B;\n\nI DUNNO\n\nEdit: Added SPX for clarification.", "score": 1, "replies": []}]}, {"body": "I wouldn't call a single day stall \"rebounding\". Mark my post it has room to drop further.", "score": 4, "replies": []}, {"body": "Yea, think it'll close green? Fading slowly", "score": 4, "replies": []}, {"body": " I wish they would use a different term than rebounding. Maybe I just need to think differently but to me rebounding implies that the value is back to where it was which in this case it is surely not. instead they could say the market is trying to be resuscitated. How about that?", "score": 2, "replies": []}, {"body": "Why do I get the feeling this is just a dead cat bounce?", "score": 1, "replies": []}, {"body": "I really don’t like the word “skid” ", "score": 1, "replies": []}, {"body": "Buffet's market cap to GDP index still suggests the market is way overvalued, much more so than dotcom era or 2008. I cashed out earlier in the year and expect to buy back in cheap next year/whenever", "score": 1, "replies": [{"body": "Buffet is holding 250 million shares of \"overvalued\" AAPL", "score": 14, "replies": [{"body": "In the summer Berkshire was holding a a record $US 111 bn in cash\nhttps://www.businessinsider.com/warren-buffett-berkshire-hathaway-cash-balance-should-worry-investors-2018-8", "score": -1, "replies": [{"body": "So he is currently holding over 56 billion in apple... doesn't sound to me that he is actually worried despite what the media claims..", "score": 1, "replies": [{"body": "Current market cap of Berkshire is 310 billion, with just over 1/3 of that in cash. Make of that what you will, but it doesn't suggest he thinks there's anything worth buying at current prices", "score": 1, "replies": []}]}]}]}]}, {"body": "Bull trap", "score": 1, "replies": []}, {"body": "Damn, I wanted more !!!! \nBut there are still a lot of great stocks over 10% off.\nCORRECTIONS   !!", "score": -2, "replies": []}, {"body": "jellyfish fuel pot cows axiomatic homeless jeans gray mysterious wistful\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": []}]}
