{"title": "[deleted by user]", "selftext": "[removed]", "id": "mvl8gg", "created_utc": 1619027447.0, "score": 49, "upvote_ratio": 0.89, "num_comments": 70, "comments": [{"body": "It’s one of the non tech/growth stocks I have. It’s hard to imagine Starbucks ever not being a leader. Feels very stable and a good comfort stock. With a discount like yours i would buy as much as I could.", "score": 52, "replies": [{"body": "Thanks for your input. And the way the plan works is that I set a contribution % that they deduct from my paycheck every 3 months.", "score": 6, "replies": [{"body": "How soon can you sell after purchasing it? Would be a shame if you bought a bag at 5% discount.", "score": 6, "replies": [{"body": "The company buys the shares for me at the end of each offering period, and I can sell them whenever I want after that. Jan-Mar is one offering, then Apr-Jun, Jul-Sep, Oct-Dec.", "score": 3, "replies": [{"body": "Read up on disqualified dispositions :)", "score": 1, "replies": []}]}]}, {"body": "Does it come out pre-tax? \n\nIf it lowers your taxable income, it could be an even bigger discount than the 5%. \n\nFor example, my first 401k took out 120 out of each paycheck, but only lowered my net pay by $80 because the money came out pretax.  \n\n\nI wouldn't put 100% of my portfolio into the company I worked for, but free money is free money.  \nI wouldn't consider Starbucks a growth company, theyre more like a bluechip stock. They're a huge, well established company, a leader in their market, with strong and stable earnings and they pay a dividend.", "score": 2, "replies": [{"body": "No, it’s after tax, I should've specified.", "score": 1, "replies": [{"body": "Do they let you make purchases for a Roth account? The best way to buy after taxes.", "score": 2, "replies": []}]}]}]}]}, {"body": "I used to think starbucks was overrated until one opened in my office building and i saw how much people spends 5$ everyday there. Almost like an unofficial subscription model. And that starbucks sucked with rude staff and still people would wait 15-20 minutes in line even after complaining every day that Starbucks sucks.", "score": 36, "replies": [{"body": "The refillable cards are honestly sort of a subscription model in and of themselves. I got a $3 gift card through Verizon Up, went to use it, and apparently the app doesn't let you apply the card balance and then use debit/credit for the rest. You have to refill the card. So I fuckin' did that, like a dummy, since I 1) wanted to use that $3, and 2) was getting Starbucks anyway. Then I realized I'm basically stuck in an infinite loop until I get the card balance to exactly $0. Managed to do it after a few drinks with the help of a fairly healthy tip to kill it off, but then my dumb ass *accidentally refilled it* the very next time I ordered, instead of just paying for the drink with my debit card as intended.", "score": 15, "replies": [{"body": "Very bullish comment.", "score": 9, "replies": []}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Ah, I’m glad a (former) partner caught my post! I’ve heard good stories from partners about the SIP, but I guess it’s the complexity, the tax consequences and stuff that make me second-guess it. Just wanted to hear people’s thought who buy SBUX for long-term and not long term.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "A bit confused about your comment. Are you saying I should wait about a year to sell so that the tax isn’t so high? And yes, I’m aware of the RSUs, my first half (3 shares) vest in November. Are you enrolled in the SIP?", "score": 1, "replies": [{"body": "Yes. Even better if you plan to hold forever but short term capital gains vs long term taxes are dramatic. If you want to take it out asap you're better off not buying it.", "score": 3, "replies": [{"body": "Ah, I gotcha. Yep, my intention was to hold them for the long term.", "score": 1, "replies": [{"body": "Just going of the chain.  Any stock you sell under 1yo gets taxed as short term gains.  You will pay your income tax on it as it gets treated as income.  If you hold for 1y+ it’ll turn into long term capital gains and you’ll be taxed 15-20% based on your income and it won’t apply to your income threshold", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "SBUX is a solid play just based on the fact that coffee is a drug.", "score": 29, "replies": [{"body": "Caffeine is the new nicotine.", "score": 3, "replies": [{"body": "Caffeine predates nicotine.", "score": 7, "replies": []}]}]}, {"body": "I have 17 shares and I bought in around $58, and I'm debating giving it up after their next dividend (although it'll be like a couple bucks). It's mainly because I want to lower my allocation of individual stocks and move it into ETFs. \n\nThat said, I really like the stock and I don't really see a world where they don't continue to grow and dominate the coffee/drink market. I think as the world starts going back into offices, it can really ramp up performance, but it's just an opinion, obviously not a financial advisor.", "score": 8, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "100%. I'm not a coffee drinker but I've come across a lot of interesting drinks and snacks during my time at the drive through with friends or family. \n\nAnd I suppose I didn't answer OPs other question. just gonna do it here. ESPP programs are a no brainer, as long as your cash flow is manageable. i.e. my paychecks drop by a pretty large chunk at the start of every year because I load 25% of each paycheck into my program, meaning I have to be really aware of what I spend money on until about May or June, when the program is maxed out. I have that figured out and will always recommend maxing out what you can buy as long as your essentials (food, rent/mortgage, utilities) without being forced to sell stock.", "score": 2, "replies": [{"body": "Thanks for your input. I also think SBUX will keep growing, especially as their mobile options and UBEReats evolve.\n\nOn another topic, Dunkin’ has also been ramping up their mobile services, but it was bought by Inspire Brands, which isn’t a publicly traded company.", "score": 1, "replies": []}]}, {"body": "The interesting thing about them versus other food service companies is that they iterate a lot. They have a decent amount of real estate and they’re constantly changing it and the menu as well. Compare it to conventional fast food, which is always the same thing year after year.", "score": 1, "replies": []}]}, {"body": "I only have 20 shares (for $39), but it's been doing very well.  Don't think I'll sell anytime soon.", "score": 4, "replies": []}]}, {"body": "I'm long on SBUX, they are somehow getting through the pandemic fine and have just been stable over the years. Been holding since 2008. I just sold a few shares the other day with a cost basis of $4.47", "score": 8, "replies": [{"body": "They’ve been going up since the beginning of the year, and perhaps the reopening of indoor seating will help with that.", "score": 1, "replies": []}]}, {"body": "The drive-thru line at the store in my town is always wrapped around the building and back into the road. And my co-workers gladly spend $6/day for their own fix. That’s good enough for me.", "score": 5, "replies": []}, {"body": "The bull case for Starbucks is their main competitor in China got wiped out. I think they will continue to grow steadily. A high margin, consumer staple  product with excellent brand loyalty, its fair to say they are a high quality company.", "score": 10, "replies": [{"body": "Do they have any up-and-coming competitors in the US? Can't think of any.", "score": 3, "replies": [{"body": "Same. I guess in urban areas, local coffee shops would be their competitors.", "score": 3, "replies": [{"body": "Yeah. The only (kinda) coffee-related chain I could think of is Dunkin Donuts, but... hoo boy, different clienteles.", "score": 5, "replies": []}]}, {"body": "Caribou in the north is very good", "score": 2, "replies": [{"body": "Never heard of them so checked out their website. YUM!", "score": 1, "replies": []}]}]}, {"body": "Has Starbucks been growing in China post-COVID?", "score": 2, "replies": []}, {"body": "Luckin is not wiped out.", "score": 1, "replies": []}, {"body": "China will make sure there's a competitor lol", "score": 1, "replies": [{"body": "Xi recently hired the ex CEO of Starbucks, specifically to help improve relations between China and the US.\n\nAm pretty sure there will be some kind of deal done in relation to Starbucks access in China if this succeeds.", "score": 1, "replies": []}]}]}, {"body": "5% discount off the stock is a very nice deal.", "score": 6, "replies": []}, {"body": "Long term - great stock to own. Non tech growth stock with a dividend. \n\nNot sure about timing on an entry point. I picked up some shares about a year ago with the mindset of holding them forever and letting them appreciate and multiply with dividend reinvestment.", "score": 3, "replies": []}, {"body": "Anybody think it's weird a coffee company has a 205 P/E ratio?", "score": 6, "replies": [{"body": "Ask yourself what happened to the E part of P/E during the pandemic and then re-evaluate. Earnings collapse can make P/E meaningless as a valuation measurement, since price may remain elevated in expectation of earnings coming back to prior levels.", "score": 11, "replies": [{"body": "I thought sbux actually increased their sales during the pandemic? Maybe I'm misremembering and work from home screwed them.", "score": -2, "replies": [{"body": "Think about it for one second.", "score": 4, "replies": []}]}]}, {"body": "Fwd PE of 41", "score": 1, "replies": []}]}, {"body": "Apparently this is not financial advice, but...  \n\n\n... the employee stock purchase plan that you get as a partner- I have a recommendation:  \n\n\nEnroll!\n\n&#x200B;\n\nA 5% discount, yum. Also, it's deducted straight from your paycheck and purchased at regular intervals giving you automatic mindless dollar cost averaging.  \n\n\nSure- the stock could tank, but you would presumable be buying more through the tanking. You're essentially forcing yourself a side savings account in the form of accruing stock.  \n\n\nWe took advantage of it in my household when one of us was a partner at Starbucks- it helped us out immensely when we needed it!\n\n&#x200B;\n\nI have a lot of faith in SBUX as a company. I'm not actively purchasing shares now but I am planning to hold even if it dumps for a little bit. They've always been a forward looking company and seem to have integrated with people's lives in a really vital way (\"I need my $7 coffee!\").\n\n&#x200B;\n\nThat's my two cents.", "score": 2, "replies": [{"body": "Thanks, and I agree with your idea on holding your shares! Just gotta be patient.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "I'm apart of our purchase program, allot about 2% of my check, and get about 1 share per cycle would recommend.", "score": 2, "replies": []}, {"body": "A general tidbit of information you may want to keep in mind, something thats helped me in the past with employee stock plans - The 5% discount is great, but remember that if you hold the shares you receive for less than one year, youll be paying capital gains on the profits, vs long term (which is about half as much).", "score": 2, "replies": []}, {"body": "I've been holding since the $60's, and don't plan on selling anytime soon. \n\nSolid Company with solid growth", "score": 2, "replies": [{"body": "Your future self will thank you!", "score": 2, "replies": []}]}, {"body": "As long as it's the go to coffee place of white girls it will always be a buy for me", "score": 2, "replies": []}, {"body": "I have been bullish on SBUX for years. Got in at 45 bucks and bought every frikkin dip including last year at ~$75 and DRIPped every penny. Have ~350 shares at a cost average of 69.\nIt’s one of those tremendous companies that can charge insane $ from a commodity (coffee). Such companies are best for investment. My advice is to buy as many shares as you can every quarter so you dollar cost average over a long period of time and thank me later.", "score": 2, "replies": [{"body": "Could you explain more about dollar cost averaging, I’m not sure if that’s possible in my situation.", "score": 1, "replies": [{"body": "It is possible. If you buy 1 share today at 100 and let’s say price drops to 50. If you buy one more share at 50, the average price you paid for is 75.\nBuy two shares at 50 (same $ investment as 1 share at 100) and your average is 66.67..", "score": 1, "replies": []}]}]}, {"body": "How much can employees buy at 5% discount? Is there a cap? I might have to work there for like 2 weeks and stonk up on all those Stonks!", "score": 2, "replies": []}, {"body": "I see the lines wrapping around the block daily at Starbucks in the city and realize that a) people love it and b) caffeine is a helluva drug.\n\nI own many shares and love the stock long term.", "score": 2, "replies": []}, {"body": "I’m a partner and do the max allocation each quarter. If you don’t need the cash during that time, it’s essentially a 3-month CD with ~4% interest (after taxes) assuming you sell right after the shares are granted.\n\nThat being said, I do plan to hold onto at least some of the shares. Starbucks is a good mix of stable with some growth + dividends. I’m in the corporate office and do feel good about the company’s prospects.", "score": 2, "replies": []}, {"body": "Caffeine is a helluva drug.", "score": 2, "replies": []}, {"body": "I bought what little shares i could afford when it was at $45. Now am in a position to buy more but not sure how much its got left in the tank. Got a $5 trailing stop and will probably just ride and DRIP what ive got forever.", "score": 2, "replies": []}, {"body": "I used to buy SBUX coffee 2-3 times per week. Now, I don’t think I’ll ever work in an office again, so I may only buy 2-3x per month, if that. Many others will do the same or work from home a couple of days per week. \n\nA lot of smart people run SBUX, but I wouldn’t put my money into it. Maybe I would if I got a 5% discount though.", "score": 1, "replies": []}, {"body": "If this is ESPP, if you can afford to, just max it out. They get purchased at the best price within that time window and it comes at a discount. Since there’s usually no vesting time, you could sell right away for the 5% gain.", "score": 0, "replies": [{"body": "Unfortunately that’s incorrect, but I wish that were the case.\n\n“At the end of each quarter, your contributions are used to buy shares of Starbucks stock at a 5% discount, applied to the fair market value of Starbucks stock on the last business day of the quarterly offering.”", "score": 1, "replies": []}]}, {"body": "Definitely enrol in you stock savings plan. I also own shares personally", "score": 1, "replies": []}, {"body": "I work for a growing biotech company and they offer a 15% discount on company stock in their ESPP. I so wish I had bought in at the last offering period especially because you’re locked into that price for 2 years.", "score": 1, "replies": [{"body": "Man that’s a nice discount! And are you saying that the offering periods are 2 years each?? 😮", "score": 1, "replies": [{"body": "Offering periods are every 6 months (April/October) but then you’re locked in at that price for two years!", "score": 1, "replies": []}]}]}, {"body": "Thestockguy on twitch recently did a YouTube video presenting his bull case for Starbucks.\n\nI highly recommend it (it should come up in YouTube search, not sure if im allowed to post link)", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "mvkusa", "created_utc": 1619026397.0, "score": 255, "upvote_ratio": 0.76, "num_comments": 71, "comments": [{"body": "NO, you are not doing it right. Do not sell, wait for it to crash than make a post.", "score": 203, "replies": [{"body": "This. Is. The. Way. 👏", "score": 49, "replies": [{"body": "It didn't crash. I demand a repost to see where this retard is at", "score": 8, "replies": [{"body": "Was the auto pilot on?", "score": 2, "replies": []}]}]}]}, {"body": "Lol didn’t see they expire in 2 days ! Your good , congratulations and fuck you !", "score": 59, "replies": [{"body": "Thanks and fuck u too....", "score": 30, "replies": []}]}, {"body": "No one goes broke making 23k in a day", "score": 43, "replies": [{"body": "They do when they lose 50k in a week", "score": 10, "replies": [{"body": "Today + 69%\n\nAll-Time - 98%", "score": 19, "replies": [{"body": "Nice", "score": 2, "replies": []}]}]}]}, {"body": "I yolod my whole portfolio on $780 calls for 4/23/21, missed out selling them a few hours ago for 2x profit and sold them about 15 minutes ago for the same price I paid for them. Now that they're slowly going back up...", "score": 23, "replies": [{"body": "Buy high sell low.", "score": 29, "replies": []}, {"body": "I hate to be the one to tell you this, but you should probably take a look at how TSLA closed.", "score": 5, "replies": [{"body": "Yeah I've been watching them. Hahahaha", "score": 7, "replies": [{"body": "Same. My bitch ass sold 735 calls for 300 profit. Thought I was fucking great...", "score": 2, "replies": []}]}]}]}, {"body": "noʎ ʞɔnɟ ⅋ sʇɐɹɓuoɔ", "score": 15, "replies": [{"body": "Fuck you up", "score": 7, "replies": []}]}, {"body": "Good enough to screenshot, good enough to sell. But by all means keep holding till your $74K becomes dust and post the loss porn. I need something to jerk off to on Friday.", "score": 13, "replies": [{"body": "Try your wife’s BJ pic with her boyfriend... works better 🖕", "score": 8, "replies": [{"body": "That doesn’t turn me on anymore. Congrats and fuck you.", "score": 14, "replies": [{"body": "🤣🤣", "score": 3, "replies": []}]}]}, {"body": "By the way its $130K, so suck it deeper... Thank you sir", "score": 2, "replies": []}]}, {"body": "Sell them! Can easily go against you tomorrow", "score": 13, "replies": [{"body": "Agreed", "score": 4, "replies": []}]}, {"body": "good enough to post, good enough to sell!  congrats", "score": 11, "replies": []}, {"body": "THERE YOU GO BOY YOU JUST MADE A BASE MODEL TESLA", "score": 4, "replies": []}, {"body": "I don’t understand options. 40 times $18.65 = $746. So shouldn’t OP’s profit be only $746? I don’t get how people make thousands on calls when the price per call is so low. I truly don’t get it. Someone please explain because I’m a huge retard. Yes, I’ve read the page on investopedia. Still unclear.\n\nEdit: thank you to all who explained. I’m slightly less retarded now.", "score": 7, "replies": [{"body": "Times 100", "score": 26, "replies": []}, {"body": "Bought for 12.68. Value (sell price listed, but who knows if they've been sold or if he/she is still holding) is 18.65. \n\n18.65-12.68 = 5.97 or 5.97 increase in value per contract. Mulitple by 40 since that's how many contracts he/she bought = 238.8\n\nMultiply by 100 since options are bought and sold in shares of 100 will get you to $23,880 in profit. He/she had about $50,000 in cash to purchase the 40 contracts.", "score": 7, "replies": [{"body": "Even reading this still doesn't make sense to me with contracts. I've tried learning this, but it seems to strange and also super risky since you can owe a lot too", "score": 2, "replies": [{"body": "you don't owe anything when you buy a contract. It is the same concept as buying shares, except options contract have expiration dates. Take the 40 contracts out of the post. OP bought a contract for $12.68. This $12.68 is the cost per *share*\n\nHowever, options contracts are *bundles* of 100 shares and you can't buy fractional options. So, OP must pay $12.68 per share he controls for the option - hence the multiplying by 100.\n\nSo, for one contract, OP paid $12.68 x 100 (again, options are traded as bundles of 100 shares) for a price *per contract* of $1,268.\n\n\n\nLet's expand one last time. OP paid $1,268 per contract to buy 40 contracts (AKA 40 call options). \n$1,268*40=$50,720 (how much it cost OP to enter this position)\n\nOP can now sell these contracts for $1,865 each. \n$1865*40=$74,600 for a total profit of ~$24,000.\n\nI can't dumb it down any further.", "score": 31, "replies": [{"body": "So, OP has to have the cash up front to buy it. He can't do it on credit, correct?  \n\n\nAnd if the price goes down, OP doesn't owe anything, just loses out on the difference being sold. So like losing if you sold a stock below your buying price.   \n\n\nSo why would people buy shares and not just the stock itself? Sorry, I am still learning this part of the stock market. And thank you very much!", "score": 3, "replies": [{"body": "Yes, if the price goes down (i.e. the underlying asset goes down), the options contracts lose value. Not only that, as time goes on, options contracts can lose value if the price doesn't move much at all. This is time decay component of contracts - since they have an expiration date, they lose value the closer to expiration since there is not as much *potential* to make money. Buying options further into the future can mitigate time decay, but you may notice, these options also cost more/are more expensive.\n\nTo answer your question on why people buy options - options (and by extension derivatives) are a tool. A tool for a certain role in portfolios. Options can be used as a form of insurance (hedging) or buffers from large market moves. They can be used to generate cash on an asset that is trading flat. They can be used to limit risk.\n\nFor me, and this sub, options provide *leverage* without the capital  required to own a proportional amount of shares. To clarify - to own 100 shares of Tesla, I would need ~$74,000. To *own* 100 shares using an option contract, like OP, all he needed was $1,268. Does that make sense? To bring it all together, OP had to pay $1,268 instead $74,000 to *control* 100 shares of Tesla. However, when you buy shares you own them indefinitely or until you sell. With options, if your option is out of the money when the expiration date comes, you are left with nothing.", "score": 13, "replies": [{"body": "That makes sense. I just see people always posting options and I never understood why or how it was really making money.   \n\n\nThanks for the info and taking the time to write back to me!", "score": 5, "replies": [{"body": "Options didn't really click for me either until I finally bought one (just a few weeks ago). It you've got a hundred dollars laying around you can get on your trading platform and find a cheap one for $0.98 (x100) and get started and it will help things click.", "score": 1, "replies": [{"body": "Mhmm that's a good point. I may have to do that in the future. As of right now, I don't have any extra cash in my account.", "score": 1, "replies": []}]}]}]}]}, {"body": "Sorry, some questions for you.\n\nHow does the price of the contracts go up or down (from $12.68 to $18.65) and who determines it?\n\nSince he now \"controls\" the contracts, can he sell them to somebody now for $18.65x4000=$74,600?\n\nIf he \"exercises\" his option does that mean he has to come up with $2,860,000 ($715x4000) and then he can sell them all for $740/share (closing price today)?\n\nSorry, another retard trying to learn...L0L", "score": 1, "replies": [{"body": "The price of the contracts are traded during market hours like any asset - the buyers and sellers determine the price just like bid/ask spreads on stocks etc. The greeks capture the inherent value of options contracts through from real time market information i.e. time left til expiration, bid ask spreads, volume, etc. Long story short, as an underlying moves (i.e. Tesla here gains) the options become more valuable because there is time left on the contracts (albeit short) and the stock is moving further into the money. Essentially, call options gain value when a stock goes up, put options gain value when a stock goes down.\n\nMost options contracts are not exercised, they are bought and sold just like stocks are bought and sold. This will tie into exercising in a moment.\n\nSince he bought the contracts (paid premium), he can sell them whenever he wants up until expiration. If he has the capital to buy 4000 shares at $715 (40 contracts x 100 shares per contract at $715 which is the strike price), yes he can exercise his options and take control of 4000 shares of Tesla. He still has to *buy* them though at $715 per share (costing roughly $2,860,000) just like you said. If he sells the contracts though instead of exercising, he can still collect the profit without needing to put up nearly 3 million dollars.\n\nYou had the math part down, hope this helps.", "score": 3, "replies": [{"body": "Thanks for clarifying. The concepts are in my head but I just have to say them out loud a few times to understand them completely!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I believe contracts are 100x. I could be wrong. 🤷🏼‍♂️", "score": 4, "replies": []}]}, {"body": "A humble and polite fuck you to you Sir.", "score": 2, "replies": []}, {"body": "Thoughts for options or puts tomorrow?", "score": 2, "replies": []}, {"body": "Damn you bastard what’s the next move", "score": 3, "replies": [{"body": "Next move is enjoying the tendies 💰💰", "score": 10, "replies": [{"body": "Did you sell?", "score": -1, "replies": []}]}]}, {"body": "Are you 💎🤲 or 📃🤲? Is the real question", "score": 2, "replies": []}, {"body": "That's the spirit!", "score": 0, "replies": [{"body": "Thank you sir", "score": 1, "replies": []}]}, {"body": "After a accident happened that just killed 2 people! \nYou have gigantic testicles 😂😂", "score": -7, "replies": [{"body": "Let me check my balls.... you are right, they are gigantic", "score": 7, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "No. You should be putting that money into GME. It’s going to spike tomorrow.", "score": -3, "replies": []}, {"body": "Ur vag will bag hold", "score": -4, "replies": []}, {"body": "Good. Good.", "score": 1, "replies": []}, {"body": "Can somebody explain to me what this post is? I'm an idiot. Thanks!", "score": 1, "replies": []}, {"body": "Still don't understand options, sigh. But good on you!", "score": 1, "replies": []}, {"body": "r/SKLZ", "score": 1, "replies": []}, {"body": "R u gonna do it again ?", "score": 1, "replies": []}, {"body": "Did you cash these out or still holding? Good luck bro", "score": 1, "replies": []}]}
