{"title": "How Tesla's Cybertruck Turns Car Engineering Norms Upside-Down - No paint shop. No stamping. Truck will be folded together like origami.", "selftext": "", "id": "dzy0b7", "created_utc": 1574409985.0, "score": 123, "upvote_ratio": 0.98, "num_comments": 46, "comments": [{"body": "Found the article's points on not requiring a paint shop or stamping machines and being able to just fold the steel like origami very interesting. Likely explains why they can sell the truck for such a low price.\n\n\"Now, the \"machines-that-will-build\" the Cybertruck will go dramatically skinnier, scaling the dreadnaught down to simple dinghies that groove and bend (with the $200 million paint shop getting an auditor's line drawn through it).\"", "score": 35, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Yep", "score": 2, "replies": []}]}, {"body": " This should be a great military vehicle to replace Humvee. Strong, cheap, fast. Even if the US army doesn't order it straight away, armies around the world will be interested. Compared to this car, Humvee is slow as a turtle with disability. \n\nHumvee specs: price -  from north of 70k with armored versions about 220k (!), acceleration - 15 seconds (!), range - 300 miles (!), top speed - 87mph (!). \n\nCybertruck specs: price - 69k for the top of the line variant (!), acceleration - 2.9 seconds (!), range - 500 miles (!), top speed - 130mph (!). \n\nThink about it. Armies need powerful vehicles, so they use some of the most polluting technology with diesel engines with low MPG because they need to carry so much weight. This thing can outrun everything on the battlefield, it can go through water, and it can go for waaaay longer than a humvee.  It's a no-brainer for the army or police vehicle.", "score": 24, "replies": [{"body": "You can't compare specs as Humvees are more heavily armored. It would make a good  army vehicle for sure, but the military version would have to be thicker and probably stronger transmission and  other things. It would be a good publicity stunt to get a contract though and a good start for the army as they are one of of the main polluters of the world.", "score": 4, "replies": [{"body": "That's true about armour but you can up-arm a vehicle (polygonal shape should be rather handy with that) or simply produce it to different bodywork specs. It should be able to carry more weight and if the army/police orders them, they will for sure tell Musk what they want changed. (tip: probably the windows will need some more work ;))\nThe model s police cars were made in such a way.", "score": 1, "replies": [{"body": "I agree, just the specs bit. Also maybe how direct weapon impacts a exoskeleton build versus a classic chassis + panels build.", "score": 2, "replies": [{"body": "Sure, but you can put stuff on top of the exoskeleton. It's pretty nice flat surfaces. Just like they do... https://www.youtube.com/watch?v=LjMq7_l55iQ", "score": 1, "replies": []}]}, {"body": "For modern warfare the current shape already lends itself to having a V shape bottom and other deflective surfaces. The biggest issue is getting the battery to survive an IED, but a silent and quite troop transporter like this could be a great addition to military bases all around the world.", "score": 2, "replies": []}]}]}, {"body": "Charging in the desert might be a problem.", "score": 8, "replies": [{"body": "In the desert everything can be a problem, but there sure as hell will be a sunny weather. :)\nThis thing has 200 miles more range than humvee, and you could have one of these made into a mobile battery with solar panels, so if you need to go over 500 miles (804km), you can basically carry your charging station with you. You can't do that with a diesel truck. During the Kuwait conflict retreating Iraqi forces used tactics of scorched earth, burning their own oil fields.\nErgo: this can eliminate need for oil as a strategic supply.", "score": 14, "replies": [{"body": "You do know that military vehicles don't get raw oil from Wells, right?", "score": 0, "replies": [{"body": "Well, actually, like you (I assume) I thought that you would still need to refine it before it can go to a pump. This really is quite irrelevant, because if the army burns oil fields it interrupts the supply of oil to the refineries and then to the pumps. \nHowever, I have looked it up, and here you will find the answer:\nhttps://en.wikipedia.org/wiki/Crude_oil_engine\nSo, yes, apparently you can use crude oil. Now we know, right? :-)", "score": 3, "replies": [{"body": "They most likely burnt the wells for two reasons.\n1) to fuck with Kuwait\n2) as a smoke screen against us air and ground forces", "score": 2, "replies": []}, {"body": "Those engines weigh 10s of tonnes and are used to drive freighters.", "score": 2, "replies": [{"body": "Exactly, which is why they often don't really offer very economic or environment-friendly ride. If an army Humvee gets between 10 and 14 mpg, it's no wonder that armies look into alternatives. Google, for instance 'electric tanks'.", "score": 1, "replies": [{"body": "They're the most thermodynamically efficient internal-combustion engines that exist.  But they're for freighters, as in, boats.", "score": 1, "replies": []}]}]}]}, {"body": "some of the bigger trucks can take just about anything. I remember watching a preppers show and the guys bug out trucks motor was apparently rated for gas, diesel, propane and used motor oil ... his plan was to drain oil out of abandoned cars to keep driving :)", "score": 1, "replies": []}]}]}, {"body": "Much easier to charge in the desert than to tank in all the fuel through hostile territory.", "score": 3, "replies": []}, {"body": "Unless the truck [has solar panels](https://ww.electrek.co/2019/11/22/tesla-cybertruck-solar-roof-option-add-range/).", "score": 2, "replies": []}, {"body": "You can also just charge them from a generator. But I agree, not ideal", "score": 2, "replies": []}]}]}, {"body": "My friend brought up a good point that dents are pretty much impossible to repair. Any accident zones need to crumble so it can’t all be sledge proof. I wonder how it’ll absorb energy if it doesn’t have crumble zones.", "score": 7, "replies": [{"body": "Metal sheets and a TIG welder. Then either leave it looking like Mad Max or put a wrap on it.", "score": 8, "replies": []}, {"body": "> Any accident zones need to crumble so it can’t all be sledge proof.\n\nThis is my primary complaint with this vehicle.  To be clear, I don't think this vehicle does crumple, but then again, neither do a lot of trucks.", "score": 2, "replies": []}, {"body": "Physics", "score": 1, "replies": []}]}, {"body": "I would like to see this wrapped honestly. I think the sheet metal colored exterior doesn’t match up well with the sharp angles. Get a black wrap and I bet it would look a lot better imo.", "score": 5, "replies": [{"body": "I think this is very clever of them not to include paint. Think of all the paint issues with the model 3. This is eliminates a step in production costs and delivery and opens up opportunity for aftermarket services to do something with it like. Bit like an iPhone case industry but in the car market.", "score": 2, "replies": []}, {"body": "1) [https://twitter.com/SuperSaf/status/1197932480915005440](https://twitter.com/SuperSaf/status/1197932480915005440)\n\n2) [https://twitter.com/ZarifAli9/status/1198093754747555845](https://twitter.com/ZarifAli9/status/1198093754747555845)", "score": 1, "replies": []}]}, {"body": "Well, even though I first hated it I just ordered one and I feel really weird about it.", "score": 4, "replies": []}, {"body": "Can anyone tell me where the side mirrors/camera's are?", "score": 2, "replies": [{"body": "It's a prototype 🤷‍♂️", "score": 4, "replies": [{"body": "THIS!  People seem to forget the unveiling of prior Tesla models and the negativity that went around it.  Look at the Model S or X we saw on stage vs production - they’re pretty different.  With that said, while I think this vehicle will eventually be “more polished” I hope it retains its style.  This truck looks weird because, well, it’s supposed to be unconventional.  If you want an F-150, go buy it.  If you want something that is challenging the status-quo of pickup truck, buy the Cybertruck.", "score": 11, "replies": [{"body": "I would want Tesla to get decent market shares in the huge pickup sector, like the 3 for pickups. I know they told us it was going to be niche, but IMO there could be some missed opportunity here. Hopefully I turn out wrong", "score": 2, "replies": [{"body": "According to reservation numbers, there may already be around 300k preorders!!  That’s in less than 12 hours. Model 3 got half that in the first 24 hours. Looking at history, the model 3 had a 12% cancellation rate - which would be 36k for this.  That’s still 264k Cybertrucks!  \n\nComparing that to the f-150, that’s 25% of their annual sales. Fingers crossed this truck sells as much as I’m hoping it will.", "score": 4, "replies": [{"body": "That's a lot more than I would have expected! From which source are you getting that? Also the reservation cost is $100 instead of $1k so maybe that factors in, but in any case it's a fantastic number give my expectations", "score": 3, "replies": [{"body": "Yes exactly a fully refundable $100 pre-order is not a huge commitment", "score": 2, "replies": [{"body": "Just enough of a barrier to avoid some trolls", "score": 2, "replies": []}, {"body": "And everyone who’s had experience with cancelling a pre-order knows that getting the money back actually takes a week of 3.  Or at least it did when I cancelled my Model 3 reservation (before you downvote: I only did that because I caved and got a Model S instead)", "score": 1, "replies": []}]}]}, {"body": "Source?", "score": 1, "replies": []}]}, {"body": "My impression is that this vehicle is about taking the crowd that likes to roll coal, and giving them a new toy, thus changing their perception of Tesla.", "score": 0, "replies": []}]}]}]}]}, {"body": "So they couldn't get the costs down and just gave up on styling? \n\nI don't think people will want something whose ugliness comes from thrift.", "score": -15, "replies": [{"body": "I'd rather have something tough than pretty. So many people act like they were expecting some dainty and beautiful truck from Tesla.", "score": 12, "replies": []}, {"body": "Nowadays it’s trendy to have minimalism with an emphasis on quality. The truck is a minimalism design with high quality materials and high technology. Time will tell if it’s popular- but Teslas marketing team isn’t stupid.", "score": 6, "replies": [{"body": "Are you seriously suggesting that Tesla’s marketing team is smarter than /u/JoJoeyJoJo ?", "score": 5, "replies": []}]}, {"body": "The rivian is ugly as Sin and people came around on it.\n\nTesla is just different the more I look at it the more it grows on me.\n\nAlready put an order in for the tri motor.", "score": 9, "replies": []}, {"body": "Personally the design has really grown on me, but even if you don't like the style, it's got so much practical functionality at an unbeatable price. Compared with the 2021 Rivian R1T they've created a truck that is not only $30k cheaper but beats every spec of the far more expensive R1T. That's unbeatable value.", "score": 9, "replies": []}, {"body": "The cars used primarily for offroading are generally not brand new and shiny, they've often modified to deal with harsh conditions and you can tell they are workhorses.", "score": 1, "replies": []}]}]}
{"title": "How to fix my fuckups", "selftext": "Aside from the general trolling I expect and deserve, I've basically lost half of my bank account, down 25k.\n\nLast week I was up 20k got too confident during our upward trade talk trend, got fucked up on stupid decisions later, tried to fix it, and just lost. Oh and $TSLA calls. Makes you feel pretty terrible actually. That's account sized trades for ya, or I guess gambling.\n\n1. How do you guys stomach the volatility? Whenever I buy calls/puts, just a small move in the underlying in the initial few days can fuck you up. Maybe I just need to go further out on the DTE.\n2. Also, should I just quit now? Because being stupid fucking sucks\n\n&#x200B;\n\nEdit: I appreciate the non-trolls here. I'm getting a full-time job soon, so I'm going to just save like a normal fker until I get back to a healthy balance and can be responsible with my bullshit.\n\nEdit 2: Thanks folks for the input. I’m a good position where I didn’t need the money but I’m gonna shoot the straight and narrow now. Dropping the risky business altogether.", "id": "e017ou", "created_utc": 1574430584.0, "score": 13, "upvote_ratio": 0.72, "num_comments": 46, "comments": [{"body": "I just have to get back to even\n\n-What every gambler says before turning a bad loss into a catastrophic one", "score": 35, "replies": [{"body": "Sunk cost fallacy is a tough one to overcome", "score": 9, "replies": []}]}, {"body": "So you're down 50% of your bank account (25k). That means you had 50k before you started embracing your 'tism. You were up 20k just a few days ago. You were literally up 40% and continued to gamble until you were down 50%.\n\n\n\nWhat was your goal? What was your exit strategy? \nI guess you didn't have one. Do you have one now? If not, **STOP**\n\n^(after one last cool TSLA call yolo to win it all back)", "score": 25, "replies": [{"body": "Yea tbh I thought I could do something with it and it'd put me in a good place life wise -- you know, long term stuff like getting a house etc.   \n\n\nIt **the worst** decision, but when you realize you fucked up it was an immature scramble to fix it, which is a no-no as we all see now. \n\n&#x200B;\n\nRight now, I think the goal is to paperMoney income strategies with small position sizes and high probability trades :(", "score": 6, "replies": [{"body": "You traded options, after you'd already gotten lucky as hell, so you could buy a house?\n\nJesus man, cut your losses, stop, and go hire an actual financial advisor. They can literally use like a Target date fund or something and give you a really solid shot at putting down a down payment on the house in a reasonable timeframe. If you continue to YOLO, even if you're highly skilled at this (lol), you've got a very good chance of losing it all.", "score": 3, "replies": [{"body": "Oh yea, stupidest thing I’ve done in a long time... I appreciate the honesty though! I’m going to jump back on the straight and narrow now, put savings into stable long term investments, play it right.", "score": 2, "replies": []}]}]}, {"body": "He's down over 2/3rds from his high. Started with $50, made $20, down to $25. Guh.", "score": 2, "replies": [{"body": "lol check your arithmetic", "score": 0, "replies": [{"body": "2/3 = 66.66%\n\n25/70 * 100 = ok you're right by like 1% whatever he's basically down 2/3rds", "score": 2, "replies": [{"body": "yeah but you said \"over\", implying you didn't round (which simply saying \"2/3rds\" would've implied)", "score": -1, "replies": []}]}]}]}]}, {"body": "I just accept that it’s all gone as soon as I buy an option and pray to Warren Buffett between purchase and expiration. So far he’s damned me to an eternity of shame and destitution.", "score": 9, "replies": [{"body": "Solid advice", "score": 3, "replies": []}]}, {"body": "F", "score": 8, "replies": [{"body": "U", "score": 6, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "I", "score": 1, "replies": []}]}]}, {"body": "D", "score": 2, "replies": []}]}, {"body": "The small move making a big impact is the name of the game. If you want more security and fewer heart attacks you should just buy the stock itself. Also, F.", "score": 5, "replies": [{"body": "Yea it's funny how it's nbd if a small move in the right direction is okay, but when it goes the wrong way, RIP.", "score": 2, "replies": []}]}, {"body": "options are for chumps.  i mean, let's be honest.  unless you have some real alpha on a stock, and load up on cheap options.  you're going to suffer major losses (or gains) on small moves because you're highly leveraged.  and be disciplined enough to take the gains.\n\nif you're just gambling, yes.  stop now.", "score": 5, "replies": []}, {"body": "Stop buying options. 90% of all options expire worthless. Over a long enough timeline you will always lose.", "score": 6, "replies": [{"body": "That's why you need to sell options. \n\nLike optionsellers!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yes.", "score": 4, "replies": []}]}, {"body": "Probably the least exciting news but I what I make most money on is with selling puts or calls. Go look at some stocks and check some technicals. Take boring stocks and don't do anything stupid neither trade during volatile moments. Like yesterday during around 11 when ROKU was less down I sold 160 calls since ROKU has difficulties going through 160 it was less risky and it looked like they are going a bit downwards. I got 190 per contract expiring today so nice profit with not too much risk. I find that I make a lot more with this then just go gambling on buying calls and puts.", "score": 4, "replies": [{"body": "Thank you! This will happen, selling premium. Obviously not for a long time before I pick this up again, but yes I hear you and appreciate this.", "score": 1, "replies": []}, {"body": "Were those naked or covered calls?", "score": 1, "replies": []}]}, {"body": "F", "score": 3, "replies": []}, {"body": "1 last yolo play", "score": 2, "replies": [{"body": "If he wins then few 2 or maybe more yolos , till it's gone", "score": 1, "replies": []}]}, {"body": "First, thanks for making me feel better about my own fuckups the last 2 weeks (up 14k, now down to 2k profit). Only thing I would have done differently is always take profits. Greed is not good. Any position that was up over 50% I should have closed out.", "score": 2, "replies": []}, {"body": "Take a break.  I lost $13K quickly and then another $12K slowly after that trying to revenge trade.  This will all be here in a month or two and you’ll reset your mind.", "score": 2, "replies": []}, {"body": "I wish I only lost 25k", "score": 2, "replies": []}, {"body": "most i ever put down on options is 1/6th of my portfolio. even thats pretty aggressive. if you want to continue trading options in the future i'd recommend you find an amount you're comfortable with having in the event that all the money you put into options vanishes. final thought, if you're looking at as much as 30% profit, not a bad idea to sell. if you're deep itm then sure hold but... cmon man", "score": 2, "replies": [{"body": "Wow yea, even 1/6th is a lot when you aren't just throwing away your money like I did. Okay, if I ever did I'd probably go back to the 1-3% range like I'm supposed to. Thank you.", "score": 1, "replies": []}]}, {"body": "Take your losses and just learn a lot more about what you are doing. There has to be some specific rational of why you think the underlying will go a specific way, otherwise it is gambling and the cards are stacked against you. The algos will take your money until you have nothing left. \n\nMy suggestion is to start learning about stock investing first (make a few small positions or do paper trading, grow them based on your own research and conclusions) and only then go to learning (not doing them yet) options. you have to understand where the stock would move and how a particular options strategy may give you most benefit and reduce your risk, why that's the case and be grounded through personal DD. Options are not just a gambling device, they can be used to hedge, which i believe was their original purpose.\n\n&#x200B;\n\nA lot of people people here just gamble until they run out of money or can't handle the stress/losses, others are OK with losing what they bet, and a small group actually have some clue about what they are doing despite all the \"wsb reddit speak\".", "score": 2, "replies": [{"body": "I appreciate this!", "score": 1, "replies": []}]}, {"body": "Most people think stocks are going to move way more than they do. Why don’t you try iron condors? If the trade turns bad you can quickly close it for minimum loss.", "score": 2, "replies": []}, {"body": "Why are you buying assets that inherently can depreciate by default simply because time passes, if you want safety of principal (which you do to some degree or you wouldn't be GUHing here)\n\nFurther time to expiry would help, but eventually that option is still probably going to expire worthless because you're just guessing and hey, time passes. I would recommend investing in something that doesn't have a 50% chance to cut itself to death in a month or a few weeks or a day. Think of it this way, would you be happy if your child became a goth?", "score": 3, "replies": [{"body": "Theta gang", "score": 2, "replies": []}]}, {"body": "F", "score": 2, "replies": []}, {"body": "Seems like you should work on your risk management. If a small 5% move is blowing your account your obviously using way to much in 1 trade mate.. golden rule 1% of account value on 1 trade or if you got the balls of steel like me all in $tsla xD ( fuck no jk don't do that ) { Disclaimer} I am not a certified financial advisor and this is just the opinion of a dude on Reddit so reassess where you do your DD 🤣🤣🤣🤣🤣", "score": 1, "replies": [{"body": "So yea I’ve spent a quite a lot of time on the nonwallstreetbets side of options learning, and I didn’t understand why the trade allocation was so small. I understand fully now. GUH", "score": 2, "replies": []}]}, {"body": "You are gambling (high volatility) and it means you can win a lot or LOSE a lot. You can learn strategies but one prerequisite is to being able to accept both win and loss.", "score": 1, "replies": [{"body": "Yea, ain’t that the truth. Thank you.", "score": 1, "replies": []}]}, {"body": "Recognize your Personal Risk Tolerance", "score": 1, "replies": []}]}
