{"title": "When you lose $45,000 because AMZN shit the bed", "selftext": "", "id": "5rveo2", "created_utc": 1486144494.0, "score": 183, "upvote_ratio": 0.83, "num_comments": 154, "comments": [{"body": "Ahhh huge losses, this is what wsb is all about. Good job you absolute faggot.", "score": 95, "replies": []}, {"body": "Lol", "score": 82, "replies": [{"body": "Aww. \"Lots of love\" to you too!  ", "score": 116, "replies": [{"body": "Lots of money to you too  â›µ", "score": 8, "replies": [{"body": "æ­å–œå‘è´¢ðŸ˜˜ðŸ˜˜ðŸ˜˜ðŸ˜˜", "score": 7, "replies": []}]}, {"body": "[L for Love!](http://i.imgur.com/0OiwdVh.jpg)", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 57, "replies": [{"body": "I chortled", "score": 2, "replies": []}]}, {"body": "/u/etherslabyrinth, please post a screenshot showing the header portion to confirm it's not a sim account. Blur out the acct # portion, obvs. \n\n\nNothing against you, we are all just a little scarred from recent events.  \n\n\nOP has been banned for paper trading. ", "score": 1, "replies": [{"body": "As a tda user I can confirm this is a paper account, real accounts are in green as shown [here](http://imgur.com/a/ajgaK). Note, this is an old picture as the values are not right.", "score": 7, "replies": [{"body": "You have the lame tda mobile app,  get the trader version. ", "score": 1, "replies": [{"body": "Is it the black version? I don't have a phone atm, smashed it against the wall.", "score": 2, "replies": [{"body": "TDA Mobile Trader.  Or I think if you search ToS it comes up too. ", "score": 1, "replies": [{"body": "Alright, will check it out. Thanks!", "score": 1, "replies": []}]}]}]}]}, {"body": ">little scarred\n\nI luled so hard at this.\n\n", "score": 1, "replies": []}, {"body": "Delete this if it's fake", "score": 1, "replies": []}, {"body": "Ok, one second. The header only says \"positions\" and then the account number.  \n\nEdit: https://imgur.com/IYPtmbl", "score": -2, "replies": [{"body": "[Would love to know more](http://imgur.com/RUczIbF)", "score": 14, "replies": [{"body": "# BOOM HEADSHOT", "score": 12, "replies": [{"body": "Username checks out ", "score": -7, "replies": []}]}, {"body": "Oh I love reddit! ", "score": -8, "replies": []}]}, {"body": "Banned,  you little cunt. ", "score": 7, "replies": []}, {"body": "YELLOW HEADER = DEMO ACC\n\nban this cock sucker", "score": 15, "replies": [{"body": "Yachtzee", "score": 5, "replies": []}]}]}]}, {"body": "[OP works in retail and drops $45K on calls. Do your DD people, and mods, please ban fuck faces like this. We don't need them](http://imgur.com/fKYbfhU)", "score": 78, "replies": [{"body": "Find proof they are paper and he'll be gone, but just because someone works retail doesn't mean they are poor. You don't know if his Uncle invented Maple Syrup and died or whatever. ", "score": 44, "replies": [{"body": "Ask him to post a screen of this trade from desktop version of ToS, it will tell if the trade was live or simulated. The phone version is hard to verify.", "score": 11, "replies": []}, {"body": "I think the burden of proof should be on OP, not us", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "That's ridiculous to ask him to post his bank info publicly. He should just PM it to me and I'll let everyone know if it's legit. ", "score": 4, "replies": []}]}]}, {"body": "Agreed. He could have $2.5 million to be exact. Not bashing on retail, or poor people for that matter. Preserving this community was the intent.", "score": 1, "replies": []}, {"body": "Proof is in the yellow at the top. On thinkorswim mobile paper accounts are yellow and real are green.", "score": 1, "replies": [{"body": "Yup,  he got gone", "score": 2, "replies": []}]}]}, {"body": "I feel honored. You looked at my posts\n\nEdit: I started with a small loan of a million dollars. ", "score": 47, "replies": [{"body": "He will probably ask you out soon.", "score": 14, "replies": []}, {"body": "I have heard very good things about the jacket overall though besides the zipper on the wrong side. Are they durable AF?", "score": 5, "replies": [{"body": "Some of their jackets have durable fabrics (ie Cordura 1000d). The durability of fabric is known as its denier factor. Most high end jackets will list their denier factor. 20 is weak, 1000+ is extremely durable ", "score": 4, "replies": [{"body": "Hmu with the denier factor for Canada Goose,  been seeing a lot of marks lately and I've worn the jacket a solid 10 times since I've bought it, it looks almost worm out on the spots ", "score": 1, "replies": []}, {"body": "TIL, thank you very much.", "score": 1, "replies": []}]}]}, {"body": "Future president right here", "score": 1, "replies": []}]}, {"body": "Why don't we need him? Because he knows about zippers??", "score": 6, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Spell it with me, S-t-o-c-k-t-w-a-t-s! Now try it again.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}, {"body": "Lol", "score": 15, "replies": []}, {"body": "Lame, obvious paper trading account. What's with all of the fakers lately?", "score": 23, "replies": [{"body": "What's a good paper trading account app?  I'd like to test out some whack job theories then post screenshots for karma.\n", "score": 5, "replies": [{"body": "You could use thinkorswim like OP here, I believe they give you $200k to paper trade with. Great platform but it can be complicated for someone new to trading.", "score": 6, "replies": []}]}]}, {"body": "Lol", "score": 19, "replies": []}, {"body": "Paper trading fagwad", "score": 10, "replies": [{"body": "Thinkorswim phone app has a yellow bar above content for demo acct, but he cropped out the top.", "score": 5, "replies": []}]}, {"body": "Lol", "score": 19, "replies": []}, {"body": "Lol", "score": 23, "replies": []}, {"body": "Lol", "score": 16, "replies": []}, {"body": "Lol", "score": 14, "replies": []}, {"body": "Lol", "score": 8, "replies": []}, {"body": "Lol", "score": 8, "replies": []}, {"body": "Lol", "score": 22, "replies": []}, {"body": "Lol\n", "score": 20, "replies": [{"body": "Lol", "score": 3, "replies": [{"body": "Lol", "score": 3, "replies": [{"body": "loL", "score": 2, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol", "score": 18, "replies": []}, {"body": "Lol", "score": 15, "replies": []}, {"body": "Lol", "score": 22, "replies": []}, {"body": "lol", "score": 6, "replies": []}, {"body": "Lol", "score": 6, "replies": []}, {"body": "Lol", "score": 6, "replies": []}, {"body": "Lol", "score": 15, "replies": []}, {"body": "Lol", "score": 19, "replies": []}, {"body": "Lol", "score": 19, "replies": []}, {"body": "You act like its not going to bounce back lol. Amazon owns e commerce even with Walmart giving free two day shipping. Amazon is too far ahead and it'll further itself when their air hangar is complete in Kentucky.", "score": 5, "replies": [{"body": "Yes but he bet on options. Gotta come back in the next two weeks.", "score": 4, "replies": []}, {"body": "Walmart just laid off half their ecommerce staff anyway (walmart labs). Walmart isn't getting near Amazon.", "score": 1, "replies": []}, {"body": "Should be an easy quadruple from here, no doubt.  Super cheap.", "score": 1, "replies": []}]}, {"body": "I feel partly to blame ... I bought all the kids' christmas presents at Costco and Target. ", "score": 10, "replies": [{"body": "So it's all your fault, you son of a bitch! ", "score": 15, "replies": []}, {"body": "Target was on point this year, BRB checking when they have their earnings call.", "score": 1, "replies": []}]}, {"body": "Look at the bright side! You can still afford a sturdy piece of rope.", "score": 3, "replies": []}, {"body": "You forgot to stream it on youtube. I'd totally watch it. ", "score": 3, "replies": []}, {"body": "FAF - Fake as fuck", "score": 3, "replies": []}, {"body": "fake n gay.", "score": 3, "replies": []}, {"body": "I hope you lose every cent you have and end up with broken bones because you didn't pay Anthony the money you borrowed from him.", "score": 3, "replies": []}, {"body": "The question you really need to ask yourself is \"but did I deserve this?\"", "score": 7, "replies": [{"body": "I guess I need to sacrifice a goat or something to turn my luck around ", "score": 17, "replies": [{"body": "Can you afford a goat at this point?", "score": 11, "replies": []}, {"body": "> luck \n\nThis is why you lost it all to begin with. You are a retard.", "score": 2, "replies": []}, {"body": "Why don't you buy more?  You know its down abnormally.   Numbers are just numbers.   Don't play with what you can't lose with a smile.  Wanting leads to dependence. ", "score": 1, "replies": []}, {"body": "lets hope for a good run in the coming weeks. Sorry about the loss man.", "score": 0, "replies": []}, {"body": "The gods of liquidity will accept 2 chickens. ", "score": 0, "replies": []}]}]}, {"body": "http://imgur.com/gallery/7lZwLKc", "score": 4, "replies": []}, {"body": "lol", "score": 5, "replies": []}, {"body": "Buy buy buy! Double down! Give it 2 weeks. They will announce a certain game changer. \nHi FTC! ", "score": 2, "replies": []}, {"body": "Time for me to up my AMZN yolo", "score": 2, "replies": []}, {"body": "At least it's Amazon and will probably come back", "score": 2, "replies": [{"body": "P/E to the moon", "score": 3, "replies": []}, {"body": "But will it come back in the next 2 weeks?", "score": 1, "replies": []}]}, {"body": "Did you died", "score": 2, "replies": [{"body": "I soon dead. Can I short own life? ", "score": 2, "replies": []}]}, {"body": "Shouldn't have let AMZN sleep in that very expensive bed. lol", "score": 2, "replies": []}, {"body": "u/fordafeet ", "score": 2, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Amazon still has a lot of growing before it will hit. Investors will keep that PE high and the earnings will catch up to the stock price.", "score": 2, "replies": [{"body": "All in all, 40k on Apple earnings would have been the  better bet. But hey hinsight and all that.", "score": 1, "replies": []}]}]}, {"body": "what % of your entire portfolio / net worth was that?", "score": 2, "replies": [{"body": "Kind of wondering myself.  His losses aren't too far off from my entire net worth.", "score": 4, "replies": []}, {"body": "About 10% of his paper trading portfolio. His life will never be the same.", "score": 5, "replies": []}, {"body": "200%?", "score": 3, "replies": [{"body": "YOLOx2!", "score": 1, "replies": [{"body": "Margin trading on options. What can go wrong?^?^?^?^?^?", "score": 2, "replies": []}]}]}]}, {"body": "You're my hero", "score": 2, "replies": []}, {"body": "Fake lol.", "score": 2, "replies": []}, {"body": "What was your analysis?", "score": 1, "replies": [{"body": "Looking for those Christmas Alexa gains", "score": 1, "replies": [{"body": "People actually bought those?", "score": 5, "replies": [{"body": "apparently not", "score": 2, "replies": []}, {"body": "I did", "score": 0, "replies": []}]}, {"body": "1. \"xmas is always priced in\"\n2. 45k is a hell of a loss. what was your potential gain here? what was your risk:reward ratio?", "score": 3, "replies": []}]}]}, {"body": "LMAO ", "score": 1, "replies": []}, {"body": "Atta boy. True wsb fashion. You're goin places!", "score": 1, "replies": []}, {"body": "Why do you go after catalysts like earnings of mainstream tech companies? Everyone has their eyes on Apple, Amazon, Netflix, etc. You have no informational advantage whatsoever. While you may be able to guess their long term trajectory, betting on earnings is just a coin flip at best. At least go with a straddle if you think that options are mispriced.", "score": 1, "replies": []}, {"body": "Dude AMZN will be fine, you shit the bed.. the couch, the drapes, on the dog.. just everywhere.. feces everywhere..", "score": 1, "replies": []}, {"body": "dude. that was an really dumb move. Stocks like amazon are priced nearly to perfection. i feel bad for you.", "score": 1, "replies": []}, {"body": "Always remember. You didn't lose it. You just gave it to other people who are better than you.\n\n^^^I ^^^shorted ^^^lol", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "/u/fscomeau called it so you should have known ", "score": 1, "replies": []}, {"body": "45k? More like 45 gay", "score": 1, "replies": []}, {"body": "rofl", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "FAKE AND GAY", "score": 1, "replies": []}, {"body": "Can someone please explain what I'm looking at so I can join in on the \"lol\" ", "score": 0, "replies": [{"body": "He lost $45,727.50 because AMZN shit the bed.", "score": 22, "replies": [{"body": "Huh?", "score": -4, "replies": [{"body": "He had stock in Amazon, but they lost a ton of money, resulting in this guy losing 45,000$", "score": -7, "replies": [{"body": "Lol. \n\ngo back to reading", "score": 2, "replies": []}, {"body": "Common stock? That's cute.", "score": 2, "replies": []}]}]}, {"body": "But you can just hold your stock until it recovers. Amazon ain't going anywhere ", "score": -11, "replies": [{"body": "Those are options, bruh", "score": 31, "replies": []}, {"body": "Common stock? That's cute. ", "score": 13, "replies": []}, {"body": "Not Feb17 options though. You can only hold them another 2 weeks.", "score": 2, "replies": []}]}]}, {"body": "He has a shit ton of call options bought for 810, 830, 837.5 strikes. 830 and 837 are basically worthless now, if Amazon stays at ~815ish. Also the time is running out, if Amazon is not above his strikes in the next 2 weeks, he just lost it all. Why you would not cap your losses with a put or buy much much farer in the money (or farer out in time) with that kind of money is beyond me.", "score": 4, "replies": [{"body": "2 of his options say 17 Feb 17 so I assume he has 2 more weeks for amazon to go to 837?", "score": 1, "replies": [{"body": "Well he can sell at any time to collect the time value of the option. Which won't be much now because of the 17 Feb 17. If its not above (or anywhere near) 837 at any time in the next two weeks, he will loose a lot of money. ", "score": 1, "replies": []}]}]}, {"body": "A person that didn't correctly hedge or protect their large bet that amazon was going to beat and rocket higher. When you have this type of money you cannot do this.", "score": 1, "replies": [{"body": "HAHA \"hedge\". That's a good one. No hedging allowed on WSB. Just go big", "score": 29, "replies": [{"body": "Sorry I was being a faggot.", "score": 13, "replies": [{"body": "We know", "score": 11, "replies": []}]}]}]}]}, {"body": "Last week, I had someone scam me from Amazon. I bought a Nest thermostat which I thought was super cheap. It said SHIPPED FROM AMAZON.CA and can be shipped by Prime.\n\nGuess what? The little dick shit piss fuck face shit head who sold me that shipped it from China but he shipped me an empty god damn motherfucking box...\n\nTook 2 fucking weeks to get here and when I emailed him about it, he just replied that he will ship another one out. Wtf! So my shit for brains finally clicked and I went to check the seller's review and he got 27 reviews all 1 star because he scams people by delaying the shipments past 21 days so I cant ask for a refund as per Amazon's terms.\n\nAfter spending hours with Amazon, they didnt give a shit and made life hard before i could get a return. They insisted I should send the package back but it was fucking empty, something they couldn't understand.\n\nAfter a painful battle i got my refund but Amazon didnt do shit about the scammer and till today the scammer is still operating. So i said to myself, I hope Amazon's stock eats shit and today it did. But im sad you lost money on this :(\n\nI can pm the link to the POS that operates a scam shop on Amazon", "score": 0, "replies": []}]}
