{"title": "AMD. Wasn't fast, but suck it!", "selftext": "", "id": "5rng2n", "created_utc": 1486049984.0, "score": 2176, "upvote_ratio": 0.91, "num_comments": 189, "comments": [{"body": "I need to speak to my doctor to see if I'm healthy enough to be looking at these gains.", "score": 512, "replies": [{"body": "Noob here no flame pls.\n\nIf am correct he was sitting on 100k worth of stock for nearly 4 years for this pay off?  Earning around 85k?\n\nAlso what app/site is he using for this?  Is it an open public platform?", "score": 131, "replies": [{"body": "[deleted]", "score": 94, "replies": [{"body": "[deleted]", "score": -9, "replies": [{"body": "[deleted]", "score": 28, "replies": []}]}]}, {"body": "Correction: 25k worth of AMD which is quite a bit considering he thought it'd go to 0..... ", "score": 28, "replies": [{"body": "I posted somewhere else in the thread. I didn't think it'd go to $0 when I bought it in the $3.60 range. Only when it fell to the $1.80 range did I start to think it could be a complete loss. By then, I was prepared to ride it either way.", "score": 70, "replies": [{"body": "Well done ", "score": 19, "replies": [{"body": "Your username looks like an LA phone number", "score": 8, "replies": []}]}]}, {"body": "Yeah, so chances are high his portfolio is much bigger", "score": 10, "replies": []}]}, {"body": "If you are only going to long stock like this guy and not worry about the timing of your investments as much, you should use Robin Hood. No commissions on that and if you're dollar cost averaging it'll make a big difference over time.\n\nIf you actually have capital and/or want to trade using derivatives, you need a proper broker. TD, Schwab, and Fidelity are handy because you can bank with them too. InteractiveBrokers and OptionsHouse have favorable commissions; I've no experience with IB, but OH is not bad. ", "score": 2, "replies": [{"body": "This is not proof to use a discount broker. The man made 4 trades ? 100k roughly on the line and your worried about 40 dollars? Use a real broker if you got alot of money. Much safer and dependable", "score": 24, "replies": []}]}, {"body": "he was truly a AMD fanboy ", "score": 1, "replies": []}]}]}, {"body": "You've been holding for the past three years? Now that's a true bagholder there.", "score": 453, "replies": [{"body": "Yeah. Again, it's been a long time waiting... I honestly thought it was going to $0 when it was around $1.80 or so. \n\nI figured, what the hell, this could be a homerun, and at a $1.80 a share, it was basically an option that never expires.", "score": 294, "replies": [{"body": "[deleted]", "score": 129, "replies": [{"body": "Can you explain minimum tax?", "score": 25, "replies": [{"body": "you could/should google this...if you hold a stock for less than a year (short term) you are subject to a tax which equals out to the rate of income tax, if you hold it longer than a year (long term) you are not subject to said tax.", "score": 91, "replies": [{"body": "Lol like r/wsb cares about paying taxes. ", "score": 173, "replies": [{"body": "It's not smart to pay taxes", "score": 119, "replies": [{"body": "Uncle Sam just tryna steal those yolo gainz", "score": 79, "replies": [{"body": "Just leverage your JNUGz losses against the gains tax. Ez", "score": 12, "replies": []}]}, {"body": "I only day trade with my 401k", "score": 13, "replies": []}, {"body": "Then next time you need an ambulance don't call 911. ", "score": -4, "replies": [{"body": "en.wikipedia.org/wiki/joke", "score": 17, "replies": [{"body": "Hard to tell anymore.....", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Is that how we spell r/wsb now?", "score": 0, "replies": []}]}]}]}]}]}, {"body": "no need to pay taxes for r/wsb, when we buy high and sell low", "score": 32, "replies": [{"body": "still useful to know since you can use losses to your advantage for tax purposes", "score": 3, "replies": []}]}, {"body": "Don't need to pay taxes if you only lose, learned that strategy early in from my mentor", "score": 4, "replies": []}, {"body": "My demo account is tax free!!", "score": 1, "replies": [{"body": "Mine too. If I was doing half as good on updown.com as I am doing in real life I would have made a fortune. ", "score": 1, "replies": []}]}]}, {"body": "to add to this, I believe most brokers let you decide what order you want to sell your shares in (FIFO, LIFO, etc). This is important for tax purposes if you buy the same stock over some period of time. If you go with FIFO (first in first out), then the earliest shares you bought are the ones that get sold first. If you've been holding the stock for over a year, these will be considered long term capital gains, which means you get a discounted tax rate compared to short term gains. HOWEVER, if the stock has been going up steadily since you bought it, and you sell those early shares, your capital gain will be substantial. This means you'll pay a large amount of the capital gain as tax, compared to if you had sold a later share that's still over a year old.\n\nThe default for the IRS is FIFO so most brokers assume you're doing that unless you tell them otherwise. But I think you can change it as long as you tell your broker before you make the sale.", "score": 5, "replies": [{"body": "I knew you could do this, but have never understood why you would sell newer stocks", "score": 2, "replies": [{"body": "I don't fully understand it, but I think it can be used in combination with a loss to reduce the net amount you pay taxes on. \n\nFor instance let's say you make the following purchases of stock A:  \n- 1000 shares at $8/share on Jan 1, 2010  \n- 1000 shares at $10/share on Jan 1, 2011  \n\nAnd now in the present day let's say it's at $9/share and you want to sell 1000 shares. If you sold the oldest ones first (FIFO), you would have a capital gain of ($9-$8)\\*1000 = $1000 that you would need to pay taxes on. On the other hand, if you sold the more recent ones, you could claim a loss of ($9-$10)\\*1000 = $-1000. So if the stock goes up later on (say above $10/share) and you sell the rest of it, then by selling the more recent shares now, you'll have avoided paying capital gains tax on 1000 shares. \n\nSomeone should correct me if I'm wrong since I've never actually done this, just basing it on what I've read.\n\n", "score": 5, "replies": [{"body": "Ding ding! Just did this at the end of the year.  Wanted to sell a portion of my gains, but also had some losses I wanted to offset.  Sold my short term gains to offset, as the long term gains are in a different bracket now.", "score": 5, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Someone correct me if I'm wrong but I believe short term profits are taxed as regular income. Long term is taxed at a max of 20% and can be lower depending on your income level.", "score": 7, "replies": [{"body": "It gets more specific than this as taxes do, but this is generally correct, not sure if 20% is max though.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Income in a joint filing over 250k, or 200k individually has an extra 3.8%\n\nErgo, max possible on long-term holdings is 23.8%", "score": 1, "replies": []}]}]}]}, {"body": "Ah, ty. I figured this was all cgt. I should not be investing, lol.", "score": 0, "replies": []}]}]}]}, {"body": "Here's the thing about AMD (I've held it for *ages*).  It's too strategically important to fail.\n\nThere have been plenty of time periods-- say, about the time when the Phenom II was the best they could offer-- where Intel could have smashed them right out of the market by running a few aggressive loss leaders.  They don't because they can't.\n\nIf AMD fails, either Intel ends up in the crosshairs of every antritrust regulator on Earth, or they're forced to say \"our competition is the ARM-based mobile devices that we have absolutely NO clue how to compete with\".  Neither is a fun play for them.  It's worth it for them not to play hardball just to keep AMD alive for the foreseeable future.  Meanwhile, x86 performance gains are getting asympotic, so having the absolute fastest is less and less worth the premium for a mainstream consumer.  This means even if they can't grab the performance crown, AMD can do very well in revenue just by being competitive for the price.", "score": 4, "replies": []}, {"body": "I've traded AMD stock here and there. Made money most of the time, but was never really comfortable with holding it. ", "score": 14, "replies": [{"body": "How about you hold deez nuts?\n", "score": 17, "replies": []}, {"body": "It'll hit a ceiling, then go back down till the next release, then the cycle continues. The issue is their releases are few and far between. I'm holding long because I believe in their product, not so much their business model.  \n\nNVIDIA vs amd is kind of like IBM vs red hat when you consider open source standards ", "score": 10, "replies": []}]}, {"body": "That's actually a pretty funny and accurate way of thinking about it that I never considered. An option is basically a penny stock with an expiration date, and a penny stock is basically an option with no expiration date.", "score": 3, "replies": []}, {"body": "Just wondering why'd you buy 25k on AMD if you thought it'd go to 0? And not a lower amount ", "score": 2, "replies": [{"body": "Well, when I bought it in the $3.60 range, I didn't think it'd go to $0. When it fell to $1.80, I thought there was a chance this would be a complete loss, but I wasn't prepared to let it go yet. At that point, it was worth the risk to just hold it.", "score": 6, "replies": []}]}]}, {"body": "I was the same way. I bought in 2013 or 2014 for $2.50-$3.60 something a share. It dropped to less than half its value and then rose to where it is now. I sold in December at $8.50 a share. ", "score": 9, "replies": []}, {"body": "What's the difference between bagholder and long time investment? ", "score": 5, "replies": [{"body": "Bagholder is generally a pejorative term. \n\n\"Investment\"... Sorry, this is WSB.  I've never seen that word before and I have no idea what it means.", "score": 20, "replies": [{"body": "> pejorative \n\nHow the fuck did you just called me?", "score": 14, "replies": []}]}, {"body": "bagholding means you buy a stock because some fuckhead at the Motley Fool said it was a one way ticket to pussyville and you were dumb enough to invest big into a stock that is either being pumped and dumped (like your mother) or is pure shit and will probaly tank, leaving you holding a bag full of valueless shares of that stock", "score": 8, "replies": []}, {"body": "I'm sorry, what difference? This isn't investing we're here to get rich today or end up howling behind a wolf mask trying.\n\nNew materials to make you look like you know what you're talking about. Maybe you will as well as half the people here in a couple years http://www.investopedia.com/terms/b/bag-holder.asp", "score": 1, "replies": [{"body": "I don't click on external links, nice try fishing my password! ", "score": 1, "replies": []}]}]}, {"body": "yeah.. buying something at 3.00 and holding it until you sell it off 12.00 isn't bagholding. Do you even know what it is or do you just throw terms around you hear to seem \"cool\".", "score": -22, "replies": []}]}, {"body": "What software/brokerage service is this?   \nThe UI looks nice and simple. I love how it shows day's earning and total earning separately and with %s ", "score": 60, "replies": [{"body": "The other guys are correct. That trade is at Fidelity.", "score": 65, "replies": [{"body": ">Fidelcastro", "score": 28, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Fucks Like Adele OD'ed.", "score": 6, "replies": []}]}]}, {"body": "Pretty sure it's Fidelcastro", "score": 129, "replies": []}, {"body": "Am I too late to add that it looks like Fidelity?", "score": 26, "replies": []}, {"body": "Fidelity", "score": 10, "replies": []}, {"body": "#FIDELITY  \n#I  \n#D  \n#E  \n#L  \n#I  \n#T  \n#Y", "score": 33, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Robin hood pro, actually", "score": 7, "replies": []}]}, {"body": "Looks like Fidelity", "score": 11, "replies": []}, {"body": "Looks like fidelity", "score": 12, "replies": []}, {"body": "I think its Fidelity.", "score": 10, "replies": []}, {"body": "Fidelity master race. Could be wrong though.", "score": 6, "replies": []}, {"body": "Looks like Fidelity but you might want a second opinion.", "score": 8, "replies": []}, {"body": "It appears to be Fidelity", "score": 4, "replies": []}, {"body": "Fidelity probably but what do we know", "score": 5, "replies": []}, {"body": "+1 Fidelity", "score": 6, "replies": [{"body": "So... just to be clear, it IS Fidelity. Right?", "score": 14, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Oh ok I didn't know", "score": 3, "replies": []}]}]}]}, {"body": "I would like to know as well. I can't seem to find something I like. I stick to Google Finance. ", "score": 2, "replies": []}, {"body": "Is it Fidelity?", "score": 1, "replies": []}, {"body": "Think it's Fidelity bub", "score": 1, "replies": []}, {"body": "Se parece a la Fidelidad.", "score": 0, "replies": []}]}, {"body": "People were telling me to sell it yesterday. Lmao nah. Bless AMD", "score": 30, "replies": []}, {"body": "http://i.imgur.com/yeb1kVr.gif", "score": 73, "replies": []}, {"body": "You made more than my entire net worth in just last year alone, congrats.", "score": 23, "replies": [{"body": "Poorfag.", "score": 12, "replies": []}]}, {"body": "I fucking hate that I bailed at $8. And didn't buy at $9. Then $10. Probably  $12 later. Then I'll cave and it'll fucking plummet.", "score": 24, "replies": [{"body": "Rule #1 of gambling and stocks: Don't beat yourself (too badly) for missed opportunities. You never know what the future has in fold, so if you sell and make a profit, you still made out on top.\n\nWith that said, I definitely wish I had bought a little into AMD, since I had confidence in their stock growing, but I'm a mere broke college student and stocks aren't for me at the moment.", "score": 27, "replies": [{"body": "Also a broke college student, robinhood is pretty good if you want to give trading a try. I'm trading with $300, and with free trades and free bank transfers, I can essentially use it as a savings account while still trading some lower priced stocks. ", "score": 8, "replies": [{"body": "I might get into it when I don't have so much on my plate. My main concern is that I may lose focus on other things like classwork.", "score": 2, "replies": [{"body": "Good mindset.  If the money means anything don't play with it.  You'll be glued to Robinhood instead of focusing on the important shit.\n\nGaining or losing a few thousand dollars means nothing if you're jeopardizing your hefty 5 or 6 figure education.", "score": 2, "replies": []}]}]}, {"body": "i'm a broke college kid with a part time job and I managed to save $10K in 6 months. Just literally be frugal as fuck. It has been treating me nicely.", "score": 2, "replies": []}]}, {"body": "Don't fall victim to hindsight bias.", "score": 3, "replies": []}, {"body": "It's okay man, I just got in at 12.28. Oh well, let's see where it goes ", "score": 1, "replies": []}]}, {"body": "Man I wish I did that. I originally bought in at 2 something and then sold at 4 like a moron! 100% returns looked so good though!", "score": 20, "replies": []}, {"body": "Congratulations dude. What made you think this was a good time to sell? Earnings showed a promising future. ", "score": 31, "replies": [{"body": "I haven't sold - still holding. Just posting the current position / gain.", "score": 83, "replies": [{"body": "Ah ok, misunderstood. Good on you. I'm still holding as well, in @ 9.10.", "score": 20, "replies": [{"body": "6.29 for me. It's been a fun gravy train", "score": 15, "replies": [{"body": "I'm since 1.90", "score": 33, "replies": [{"body": "Shiiiiiiit\n", "score": 6, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "he must be an /r/amd_stock investor. Those niggas max out at 20 share $10", "score": 4, "replies": []}]}, {"body": "Omar's comin'", "score": 1, "replies": []}]}, {"body": "Me too... 2.10. Then doubled position at 4. I'm happy. ", "score": 2, "replies": []}]}]}]}, {"body": "> I haven't sold - still holding\n\nThis.  I've been holding 500 shares since the $7's. And I have 35 LEAP contracts for $20 Jan 2018. ", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "> Lmao that's a bit ambitious\n\nIsn't \"ambition\" a prerequisite of stock trading?", "score": 13, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "any reason you don't just sell and then re-establish when it dips?", "score": 8, "replies": [{"body": "> When it dips.\n\nIt's AMD. What dips?", "score": 22, "replies": [{"body": "You know, those times where you buy more AMD?", "score": 13, "replies": []}]}]}, {"body": "That takes guts.  I always tend to book some profits with that type of move.", "score": 1, "replies": []}, {"body": "Sell 20%?", "score": 1, "replies": [{"body": "And lose twenty percent of what it could be!?", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "go fuk ur mum lad\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 61, "replies": []}]}, {"body": "You need to get wolf mask and stream your earnings on YouTube.", "score": 9, "replies": []}, {"body": "Now _that_ is a good trade deal. Are you doing this in some kind of retirement account, or full YOLO in a vanilla brokerage account?", "score": 7, "replies": [{"body": "Yeah, that trade is sitting in a retirement account. It was not a full YOLO. So, in that regard, I have failed this sub!\n\nBeing relatively young, I have a fair amount of investments in what I consider \"Swing for the fences\". If a few go to $0, so be it, but if just a couple hit home runs, it will more than make up for it.\n\nI've had a couple that basically went to $0. It doesn't bother me, it's part of the plan (of what could happen). On the flip side, some of my greats have been:\n* Tesla @ $32 (still holding)\n* AMD @ $3.16 (still holding)\n* BIDU @ $33 (still holding)", "score": 29, "replies": [{"body": "\\> TSLA @ $32\n\ngod damn dude, nice. I just opened my own IRAs this year and am hodling tech stocks. I hope I have as much luck as you did.", "score": 17, "replies": [{"body": "My only regret on TSLA was selling part of my holdings too soon. I bought 500 shares (turns out it was $37, not $32). I sold 300 of them around $100 a share. \n\nTesla jumped so fast, I though going from $37 to $100 was insane, and locked in some profit. Obviously, wish I still had all 500 shares now -- only left with 200 now.", "score": 9, "replies": [{"body": "I think taking profits at that point is pretty reasonable. I think they still have huge potential though. 110 shares in my retirement accts. Don't plan on selling for years.", "score": 13, "replies": []}, {"body": "Hate to ask about the other side of this, but what home-run attempts have you had that basically went to 0? ", "score": 5, "replies": [{"body": "bbep\n\nIt was a value oil play, but I mistimed it - and it went to $0.18 or so (filed bk). It was paying a fat dividend, had already fallen a lot from the peak, and I figured they could cut enough to make it through the oil crash ... but they didn't.\n\nAnother loser was sohu. Down 40% right now.\n\nThe thing is, a 40% loss on the $26k I put into it, is down $11k right now. But things like AMD being up $85k, way more than make up for those. Then, add in things like TSLA, BIDU - and suddenly, the strategy works (thus far in my investing career).", "score": 5, "replies": []}]}]}]}, {"body": "What are a few \"swing for the fences\" stocks you're currently holding that you feel good about?", "score": 1, "replies": []}]}]}, {"body": "Fanfucking tastic. I wish I'd though about investing 2 years ago and I'd be in a similar postion. What's your target?", "score": 5, "replies": [{"body": "Don't really have a target price. I'm going to watch how the Ryzen release / response goes. At some point, I'll sell off 50% or so to reallocate into the next couple of stocks. \n\nMy only problem is, it's hard to find the \"swing for the fences\" stocks. They have to be fairly low market cap. For example, Apple isn't going to go up 300% from here -- it's too big. I'm looking for smaller companies that still have room for growth - even if they don't look good now.\n\nEveryone thought I was crazy when I had AMD a couple years ago.", "score": 10, "replies": [{"body": "Is it too late to get into AMD now?", "score": 1, "replies": [{"body": "It's just that it isn't 1.80 a share, its 12.50 a share and could correct until ryzen releases and then it is directly related to its performance and of course the Naples server chip performance.  Those 2 dig in and do well...amd could be over 18/20 at the end of the year", "score": 7, "replies": []}, {"body": "Sounds like a good plan. Take a look at Nokia. Just beat estimations this morning. I've got my eye on them. ", "score": 2, "replies": []}, {"body": "Depends on how the year goes, and we'll get indications of that soon. I went in at 12.28, so... Hopefully not too late. ", "score": 1, "replies": []}]}, {"body": "Let us know where you decide to put your $ in next! ", "score": 1, "replies": []}]}, {"body": "The low was 1 year ago, you'd be up 5x if you bought at the start of 2016. ", "score": 1, "replies": []}]}, {"body": "Props on your patience and the only person in WSB history to make gains. I'll ride this out until options expire.", "score": 5, "replies": []}, {"body": "Hrmmmmm I dunno... I might have you beat here:\n\nhttp://i.imgur.com/YjeNHul.png\n\nI wish I didn't sell half of it when it hit $35 :(", "score": 4, "replies": [{"body": "I don't know about that - looks like you have held your position a lot longer than the OP.  Now, if you were holding call options instead of the underlying stock, your gains would be off-the-chart ridonkulous.", "score": 1, "replies": []}]}, {"body": "Better tell /r/AyyMD", "score": 3, "replies": []}, {"body": "Your reward for your patience is long term capital gains tax.  Take some of that off the table IMO or at least sell some calls against them.", "score": 3, "replies": []}, {"body": "Why are your purchases 4K shares +100/200 on the same day? I read every fucking comment and no one else asked. So it's either a noob question or a great one. ", "score": 3, "replies": [{"body": "I only placed one order each day. When fidelity went to execute it, there wasn't enough shares from one seller to complete the transaction. So, you'll see different lots being filled until the entire order has been filled. ", "score": 5, "replies": [{"body": "Shit so it was definitely a noob question. Congrats, I am bag-holding one of those shitty biotechs these jergoffs pump up - hoping I get to make a post like you in a few years. ", "score": 2, "replies": []}]}]}, {"body": "Fuck, congratulations. I've never had any money to invest, but I really wanted to buy amd stock ~10 years ago when I discovered that they made the cpu/gpu of every then current video game console. I knew they would make a huge turn around.\n\nGood on you op, congrats.", "score": 3, "replies": [{"body": "I got in when ps4 win and Xbox released all with amd. Bought 5000 shares at around 5.30. 5 years ago.\nWatched that baby tumble all the way to 1.60 ish. Held it till now and bought more on the way and now worth 89k. \nAMD was and is a fucking roller coaster . ", "score": 1, "replies": [{"body": "fuck what a ride, I figured they could only do well when they were building the consoles, I truly don't understand why they started to tank i haven't followed their history that much.", "score": 1, "replies": []}]}]}, {"body": "Nice trade.", "score": 6, "replies": []}, {"body": "Reminder", "score": 2, "replies": []}, {"body": "Congrats man, that is awesome.", "score": 2, "replies": []}, {"body": "Good for you.", "score": 1, "replies": []}, {"body": "Holy cow.", "score": 1, "replies": []}, {"body": "Nice pull.  I love me some LEAPS.  ", "score": 1, "replies": []}, {"body": "Congratz bro. Now go lose it all or some other stocks.", "score": 1, "replies": []}, {"body": "Good shit fam ", "score": 1, "replies": []}, {"body": "Nice gain man! AMD has weekly options, have you thought about selling OTM covered calls for some extra income?", "score": 1, "replies": []}, {"body": "Damn, congrats. I need to work on my patience ", "score": 1, "replies": []}, {"body": "I sold at $6 a while ago. Fucking kill me. It's actually making me physically ill seeing these gains.", "score": 1, "replies": []}, {"body": "congrats ON YOUR PATIENCE DUDE!!!! Sell and take your well earned profit and retire in peace :)\nHopefully you don't burn all thT $$ lol", "score": 1, "replies": []}, {"body": "LITERAL GOD", "score": 1, "replies": []}, {"body": "This should be reflaired as \"Lisa Su[cc]\"", "score": 1, "replies": []}, {"body": "That is a serious long game..", "score": 1, "replies": []}, {"body": "Is it worth hopping in on this now at 12. 21? ", "score": 1, "replies": [{"body": "If you're going long I would wait and try to get in cheaper.  But if you're swing trading, buy now because I think we might see a new high tomorrow.", "score": 1, "replies": []}]}, {"body": "That quarterly earnings rally came and went fast. Shit's already tanked from 12.64 to 12.13 since 1pm. Luckily I sold out at 12.62.. but I'll be back in when it drops some more to ride the sick ryzen gainz..", "score": 1, "replies": []}, {"body": "What website is this? ", "score": 1, "replies": [{"body": "Fidelity.com", "score": 1, "replies": []}]}, {"body": "I almost just had a god damned heart attack. I thought I was looking at AMD shares at 82$ per.", "score": 1, "replies": []}, {"body": "I didn't have much money when I invested i bought at 2.20 per share only 50 but i dunno if I should still keep going or sell", "score": 1, "replies": []}, {"body": "Hai guyz.  How do I mutual index the funds of the options?  Can I make an option to sell the funds of the indexes at the stock prices?", "score": 1, "replies": []}, {"body": "So tell me broseph how do I hitch a ride on the next sick gains trains??", "score": 1, "replies": []}, {"body": "see homies, this is called long-term realization. ", "score": 1, "replies": []}, {"body": "Demo account", "score": 1, "replies": []}, {"body": "Man, I bought AMD at $12 watched it fall to $9 then $5. I sold. It stayed there for years and I got tired of watching it do nothing.", "score": 1, "replies": []}, {"body": "Nicely done,  ~41% IRR that's better than most PE investments! ", "score": 1, "replies": []}, {"body": "So, this may not be the right place, but I'm thinking about investing in AMD for probably $100 to start (never bought stock before since I turned 18 like 3 months ago). Would this be a good idea with Ryzen coming out soon? Could I expect to see a spike in AMD stock price with the new technology?", "score": 2, "replies": [{"body": "Buy your 8 shares then look at them a year from now. With only $100, it really doesn't matter. ", "score": 2, "replies": [{"body": "Should I watch it closely for when Ryzen is released? ", "score": 1, "replies": [{"body": "If you want to be excited, sure. If you're not going long and value investing, then you're speculating/gambling. Be aware of that. ", "score": 1, "replies": [{"body": "I know, but I expect it to rise drastically when Ryzen is released. That's why I'd want to watch it closely around that time.", "score": 1, "replies": []}]}]}]}, {"body": "F that noise.  Leverage up that c-note and buy yourself a Jan19 $20.00 call option.  If Huang (CEO of NVDA) gets hit by a car or dies of SARS, AMD might have a prayer at picking up some market share.  Maybe it can clean up its train wreck of a balance sheet.  Next thing you know - stock is rounding $50.00 and boom . . . you are ringing in your 21st birthday with your first YoLo.\n\n", "score": 1, "replies": [{"body": "What is a Jan19 call option?", "score": 2, "replies": [{"body": "Read the sidebar and learn the basics of investing. Options are contracts agreeing to buy or sell stocks at prices different than their current value. It's basically gambling on stocks so you can bet it goes up or down instead of just hoping it rises (long only  investing). \n\nSeriously though, buy AMD if you want. It won't go up on release though. Ryzen is priced in, meaning that everyone knows about Ryzen considering you know about it. That means you won't expect money unless Ryzen is successful down the line. By all means, go for it. But don't expect an immediate jump.", "score": 1, "replies": []}]}]}]}, {"body": "https://youtu.be/bapk460RPOM?t=20", "score": 1, "replies": [{"body": ">[**The office - Suck it [0:41]**](http://youtu.be/bapk460RPOM)\n\n>>Clip from season 6, episode 14.\n\n> [*^Martin*](https://www.youtube.com/channel/UCJNKXIaB3Tzr7c_5U4uTmMw) ^in ^Comedy\n\n>*^269,124 ^views ^since ^Feb ^2010*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)", "score": 2, "replies": []}]}, {"body": "I too have been in since $2 and it feels amazing.", "score": 1, "replies": [{"body": "Proof or fuck you", "score": 2, "replies": [{"body": "How does one post pictures on here? I'm new to reddit. I see that chain icon on top of my keyboard (using iPhone) but I don't have a link to my screenshot", "score": 1, "replies": [{"body": "Imgur.com. upload there", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Yolo", "score": 3, "replies": []}]}, {"body": "I love how AMD is ridiculed in r/pcmasterrace, but worshipped in r/wallstreetbets ", "score": 0, "replies": []}, {"body": "Is it too late to invest? I wanna quit my job", "score": 0, "replies": [{"body": "Considering it's at $12.28 and not the $3.26 he got them for, you aren't going to be quitting your job anytime soon.", "score": 1, "replies": []}]}, {"body": "photoshop", "score": -4, "replies": []}]}
{"title": "Played amd, stx, aapl, nflx and wdc earnings correctly, it's your time to shine amzn!", "selftext": "", "id": "5roike", "created_utc": 1486060283.0, "score": 65, "upvote_ratio": 0.87, "num_comments": 146, "comments": [{"body": "RIP in pieces OP", "score": 72, "replies": [{"body": "INVERSE CANADIAN DOESN'T WORK", "score": 7, "replies": [{"body": "Only works if we give him freedom again.", "score": 3, "replies": []}, {"body": "nothing works every time.\n\neverything works sometimes. \n\nthe canadian has a REALLY fucking strong record still. he's like, 27/31", "score": 2, "replies": []}]}, {"body": "You mean stock up on cheap shares while they're at a discount? It's going to be a great time to buy Amazon either late tomorrow or Monday. They hit their goals people just overreacting to guidance. It's a narrow window to stock up before everyone rushes back in.", "score": 5, "replies": [{"body": "Thats what they all say lol", "score": 8, "replies": [{"body": "If it hits 780 I'll invest 50k more if it hits 750 I'll invest 100k more. I have no problem buying my money back.", "score": 5, "replies": [{"body": "Next support is $400", "score": 5, "replies": [{"body": "Ha, not even a trump tweet can take them to 400.", "score": 6, "replies": [{"body": "Yea, but what about amazon tweeting they support trump? Stumped", "score": 4, "replies": [{"body": "Yeah supporting the president is a terrible idea for a business.", "score": 6, "replies": []}, {"body": "They would explode and hit 1k", "score": 2, "replies": [{"body": "They already did you monkey. Still in 8 hundreds.", "score": 2, "replies": [{"body": "Lol next support level $500", "score": 0, "replies": []}]}]}]}, {"body": "You're delusional, there is no help for you or your money. ", "score": 1, "replies": []}]}]}, {"body": "Dude, play it safe. If you have money to buy 98 more shares since you already have 102 then instead of averaging down with shares sell covered straddles. Bring your cost basis down. If you're already ok with buying 100k more if it hits 750 then sell a straddle 30 days out which will give you a 50$ premium.", "score": 1, "replies": []}, {"body": "Rip you money.", "score": 1, "replies": []}]}]}, {"body": "people forget that amazon doesn't actually make much money ", "score": 1, "replies": []}, {"body": "Rofl, a 4% discount isn't much of a discount you tawt. And no, people are not overreacting. When you miss revenues, what does it mean? IT MEANS YOU'RE GROWTH IS SLOWING. THAT IS THE ONLY REASON AMAZON SELLS AT A PREMIUM. THEREFORE, IT IS VERY BAD.", "score": 1, "replies": [{"body": "Their growth isn't slowing.  There were just really high expectations this quarter, which they missed.", "score": 2, "replies": []}, {"body": "They beat expected earnings", "score": 2, "replies": []}]}]}]}, {"body": "I wish I wasn't poor \n\n*Edit can't lose tons of money if I don't have any to begin with!", "score": 33, "replies": [{"body": "There is more to life than money. Like drugs and fast cars and big houses", "score": 21, "replies": [{"body": "you forgot your yacht", "score": 7, "replies": []}, {"body": "Hookers, blow, and a Nissan pickup truck is good enough for me ", "score": 5, "replies": []}, {"body": "But you need money to get those things.", "score": 3, "replies": [{"body": "found the gun hating liberal.", "score": 17, "replies": []}]}]}]}, {"body": "Holy shit. Down to $810.", "score": 14, "replies": [{"body": "Now 806", "score": 5, "replies": [{"body": "I ain't scared http://i.imgur.com/ytXdXIC.png thanks for the discount", "score": 7, "replies": [{"body": "NO FEAR", "score": 4, "replies": []}]}, {"body": "NOW 805!!", "score": 4, "replies": []}]}, {"body": "They killed earnings but said q1 numbers will be low. Will probably dip tomorrow Anna maybe Monday but 750-780s will be a great price to stock up more at.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "My favorite pizza topping: ripperoni.", "score": 8, "replies": []}]}, {"body": "holy shit nigger. gl\n", "score": 35, "replies": [{"body": "Thanks mang. I did about 5 minutes of dd the other day. I also realized everyone I know has a new kindle, echo and (fire stick or fire tv). Not to mention almost every single Christmas present my friends and family bought were all Amazon Prime. They have small margins, but damn they sold a ton of inventory this holiday season.", "score": 17, "replies": [{"body": "Arent they taking a loss on every echo unit? Plus high shipping costs. ", "score": 9, "replies": [{"body": "Even if so, there's a reason they are doing so - it is an amazing loss leader product, engaging people into staying within Amazon's money-printing environment and making it oh-so-easy to spend more cash with them.", "score": 10, "replies": []}, {"body": "I haven't seen anything recently to say yes or no. They used to, yes. With that being said though a lot of music cost a buck to listen to. I've purchased over 150$ personally in music I wouldn't have ever bought prior to the echo. It's also easy to reorder purchases that you might forget about. Amazon wouldn't sell at a loss unless it meant it'd make profits sooner than later from it. Also it's been out for a few years now I'm sure the cost to build has come way down.", "score": 7, "replies": []}, {"body": "its the connectivity/subscriptions that make it valueable i would guess. like a ps4 not being too profitable, but the accessories and games make loot.\n\ni got a firestick and love it. makes me actually want to go buy more synced stuff like the echo.", "score": 1, "replies": [{"body": "You got Kodi on that firestick? That's next level entertainment.", "score": 2, "replies": [{"body": "> Kodi \n\nnah had to google.\n\nillegal or just an app that gives no fucks? what is it? ill check it out tho.", "score": 2, "replies": [{"body": "Dog it's pretty amazing. It's gotta be illegal but who cares about that. Most TV shows and movies are on it. Sometimes the quality is shitty. I was watching triple x 3 return of Vin diesel with like Korean subtitles but it was still dope as fuck seeing Vin diesel back at it making shitty action movies. ", "score": 3, "replies": [{"body": "oh i didnt ask if it was illegal because i cared. i just assumed it was some sort of illegal service bringing sources together.\n\nim fine downloading stuff,but as a busy old man ill admit id rather not have to prepare to throw on a show or movie i want to see. id sacrifice some quality for ease.\n\ni already have it hooked up to my bros netflix, sis's hbo, my amazon prime, espn, cruncyroll, twitch, some to go aps for network tv.\n\ncant imagine just having everything avail. gonna try it tonight.", "score": 2, "replies": [{"body": "So I don't know how to install it on a fire stick...I bought a \"hacked\" fire stick on ebay with it preloaded. But it can't be that tough. However the point is, we are going to drop cable and use Netflix, friends hbo, and Kodi and should be good. Kodi is the biggest of those with content I like to watch including law and order svu staring ice cube.", "score": 2, "replies": [{"body": "Ill check it out. I'm already in no need of cable but my building has it anyways. Could be nice if I move.", "score": 1, "replies": []}]}]}]}, {"body": "Seriously best decision ever. Get kodi download Exodus. It's like if Premium and cable took steroids", "score": 2, "replies": [{"body": "thanks nick will check it out.", "score": 1, "replies": []}]}]}]}]}, {"body": "Publicly they're taking a loss. Privately they're selling your information to the government. You basically bugged your own house with an Echo and create a profile by giving it all of your information. It's worse than what Google did when they started selling information to the CIA and forcing us to unify all accounts under one umbrella.\n\nTl;DR: There is no loss only profit.", "score": 1, "replies": [{"body": "TL:DR Bezos is a cuck AMZN misses earnings terribly.", "score": 1, "replies": []}]}]}, {"body": "So. did you manage to get out of that trade?", "score": 3, "replies": []}, {"body": "AMZN is the primary reason why traditional retailers are eating shit.", "score": 2, "replies": []}, {"body": "You shouldn't be managing your own money, you have no education on it.", "score": 0, "replies": [{"body": "Which is why I don't manage my investments. My RH account is strictly for gambling.", "score": 2, "replies": []}]}]}]}, {"body": "Looks like I'm betting against you. I am expecting a sharp drop after earnings call. It won't last in the long term, but I have puts from 827.5", "score": 14, "replies": [{"body": "Grats on the gainz ", "score": 9, "replies": []}, {"body": "Down to $810.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "LOL. He molested me. ", "score": 3, "replies": [{"body": "We got fucking wrecked dude", "score": 1, "replies": [{"body": "Ha, it's back to where it closed in regular trading. Bizarre. I have over 2 weeks until expiry, we will see. \n\nEdit: bad data. Never mind. ", "score": 2, "replies": [{"body": "20gs down the drain, i have a week left but fuck maybe we will get a quick bounce in the first 15 like FB did", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "For sure. It will have $10-15 moves/day and get back.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "What time are earnings? You plan on selling right after?", "score": 3, "replies": [{"body": "Today after hours. Usually means 5-5:30. If they miss I'll sell right away no matter what guidance says. If they hit you should almost never sell same day. Only a small percentage can buy after hours so until market open the stock can't fully take off. That's one of the benefits of being able to buy and sell after hours, you can get in or out before most of the public. I'll sell tomorrow sometime if they hit earnings. I'm not after a long investment just a gamble and hopefully a quick 5%+ profit. ", "score": 4, "replies": [{"body": "How do you sell after hours if it's a miss? ", "score": 2, "replies": [{"body": "You have to have an account that allows you to sell after hours to start. Then I wait for the earnings conference call to start and I setup a stop limit loss. If you setup the stop limit loss prior to the call starting it might get hit prematurely as there's usually huge sell offs from people who don't want to play the earnings. Then listen to the earnings conference call and if hits I pop the bubbly, if it misses then I take the bubbly back to the store and return it. ", "score": 6, "replies": [{"body": "I have Robinhood also but I'm new. So with Robinhood gold you can sell after hours. I read about after hours trading  but I thought it was only an additional 2 hours or so. ", "score": 6, "replies": [{"body": "It is. ", "score": 3, "replies": []}]}]}, {"body": "he just has robinhood. it's not that hard.", "score": 4, "replies": [{"body": "This. That's exactly why I like my RH account compare to my other brokers. It's just simple to use and works well most of the time.", "score": 4, "replies": []}]}]}, {"body": "Put a resting buy order in exactly at the market maker move if they miss and double down. You'd be surprised how often it works. ", "score": 2, "replies": []}, {"body": "Do you know a way to trade after hours ?", "score": -1, "replies": []}]}]}, {"body": "Serious question, do you ever attempt to day trade? This is the robinhood platform right? Don't they only have a phone app?\n\nI can't imagine trying to execute trades on that with any kind of meaningful size. GL on your trade", "score": 2, "replies": [{"body": "I day trade on the regular. I average probably 25-30 trades a day. Some trades are less than 5 minutes from buy to sell. RH isn't right for everyone but it works for me the way I use it.", "score": 4, "replies": [{"body": "No issues with execution? I can imagine using them for multi day swings etc, but executing 25-30 trades a day on there seems nuts to me. More power to you. I'm blind without my screens and DOM lol", "score": 2, "replies": [{"body": "I could execute quicker if I was using another platform for sure, but the fees on 25-30 trades a day would probbably gobble up the money I would have saved if I could execute with a hot key. The only thing that drives me crazy is that if you set a stop loss it reserves those shares so if I buy in at say 1000 shares at 10.00$ and set a stop loss at 9.85 on those 1000 shares and then the stock jumps to 12$...I can't sell until I cancel my stop loss first. Maybe that's how other brokers are (the other brokers I have are simply for my long term game and I almost never sell), but it makes no sense. \n\nAs for the screens, I have an app that emulates my phone on my computer so I still use all my tools and then just use my mouse to make trades on my phone. ", "score": 7, "replies": [{"body": "Other brokers would definitely let you have both orders open. That's probably because you can't short with RH. No short = only have outstanding orders to sell # of shares you hold. \n\nOn the side of comms, that definitely makes sense. There are low fee options though that provide some more versatility. Thanks for indulging me. Good luck on your trade! I'll be sitting here waiting for an opportunity to scalp NQ futs.", "score": 2, "replies": []}, {"body": ">Maybe that's how other brokers are (the other brokers I have are simply for my long term game and I almost never sell)\n\nThat is not how real brokers work, just fyi", "score": 2, "replies": [{"body": "I figured as much", "score": 2, "replies": []}]}, {"body": "Merrill edge =accounts over 25,000 get 200 free trades/no pdt if I'm not mistaken, well worth it", "score": 1, "replies": []}]}]}]}]}, {"body": "Get fucked son. Down 3% in after hours", "score": 2, "replies": [{"body": "Good time to buy more", "score": 2, "replies": []}]}, {"body": "youre trading shares youll survive the dip theyre set to hit 1k this year. Easy fucking money boy", "score": 2, "replies": [{"body": "Yeah I'm not worried in the slightest. It'll be back up in a few weeks. Plus I'll stock up on the 780s or whatever it settles at tomorrow. ", "score": 2, "replies": []}]}, {"body": "Bought more on the dip, thanks for the cheap shares. http://i.imgur.com/ytXdXIC.png", "score": 4, "replies": []}, {"body": "Why the fuck do you have RH with 85k bruh??", "score": 2, "replies": [{"body": "If he's only trading stocks, and wants cheap after hours trading, why not?", "score": 11, "replies": [{"body": "oh shit RH has AH trading too??", "score": 2, "replies": [{"body": "You need 2k in your account and robinhood gold.", "score": 5, "replies": []}]}, {"body": "Because if you are spending any significant amount of money there are a shitload of features offered by actual brokers that justify the commissions - such as being able to place if/not orders (e.g. a limit sell and a stop loss, or trailing stop losses) or actual information about the companies you are buying into.\n\nAnd also they are brokers with track records. I am not going to pretend I somehow have insight into Robinhood's book keeping but they are trying to carve out a unique but potentially unprofitable niche and are more likely to go belly up than the established options. You might get your shares or you might not but even in the best case it would take time.", "score": -2, "replies": [{"body": "I use RH for my gambling urges. I have other brokers for my long term investment. I like the gambling feel and no commissions of RH. It strokes a different part of my brain than other brokers.", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "200k in RH I  have 120k in Tesla as well.", "score": 5, "replies": [{"body": "Damn, what is your TSLA entry price?", "score": 2, "replies": [{"body": "Bought in at 216 but I knew I should have bought in at 180s. Either way I'm not too upset about it.", "score": 3, "replies": [{"body": "I have about 15% of my portfolio in TSLA. I have been waiting for another crash to buy significantly more but the damn stock keeps going up. Worried the under $200 ship has sailed.", "score": 2, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "fuck off bot", "score": 0, "replies": []}]}, {"body": "I'm in the exact same same boat. Glad I got in while it was somewhat low but wish I got in for more. Oh well hindsight is 20/20.", "score": 1, "replies": [{"body": "Ya. My plan is to hold on for long term and cash out in 20-30 years to retire. I suppose $50 over my buy price isnt that bad if my plan is super long but i think as we hit summer and more Model 3 info comes out the stock could tank hard. I am half expecting earnings next week (or week after) to tank the stock pretty hard as I am almost certain they will be doing another round of funding soon. That being said, I was called out of the blue by Tesla inquiring on if I wanted more info on the powerwall 2...they even sound like they might be close to expanding their solar roof nationwide as i am in an area that solar city doesnt serve but to expect info on it soon.", "score": 1, "replies": [{"body": "Their earnings are going to miss no question about it, but they already said that and said why so I'm hoping most people already priced that in. I honestly believe that if they get a single model 3 to a consumer in 2017 the stock is going to take off. Plus with Elon knocking elbows with Trump, who knows what could come of that.\n\nI haven't heard anything from my powerwall 2 reservation yet, can't wait until I get it though.  Charge my model s with a powerwall that is charged using solar....just seems epic.", "score": 1, "replies": [{"body": "Ya. Told the guy i am holding off to get a solar roof + powerwall combo. I am not sure it's going to pencil out financially though.. I pay under $0.10 per KWH.", "score": 1, "replies": [{"body": "Trying to convince my wife the solar roof is the way to go as well. Can't wait to get some numbers on complete install.", "score": 1, "replies": [{"body": "Ya. I am super curious on the pricing of the roof. The tsla rep said they were waiting on qualified installers to really start rolling out the roof...suggests they are moving along.\n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Damn, a lot of the Mr Moneybags I know barely have heard of Robinhood. Glad to see some high rollers using it changing the game for a lot of platforms.!", "score": 2, "replies": [{"body": "I think it's a great platform for certain investors. Those that talk trash about it haven't used it or need more then it provides. A Honda civic is great if you want to just drive, but a ferrari is obviously better if you want speed. If you're just cruising though it's much wiser to use the civic because the wear and tear on the ferrari  (aka commissions) is expensive after awhile.", "score": 3, "replies": []}]}]}, {"body": "I believe the word is mr. moneybags", "score": 4, "replies": []}]}]}, {"body": "Robin hood has limit and stop orders", "score": 3, "replies": [{"body": "Not simultaneously. It reserves shares when you place either one. That's a pretty basic trading feature especially if you are playing anything volatile.", "score": 1, "replies": [{"body": "Cant beat the easy user interface I can operate while half a bottle deep", "score": 5, "replies": [{"body": "I'm not saying its not great for whiskey tradin'", "score": 2, "replies": []}]}]}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "RH allows for stop limits, just not trailing stops yet", "score": 1, "replies": [{"body": "I know. But as I said, you can't place contingent orders. ", "score": 1, "replies": [{"body": "Ah, gotcha. Aren't contingent orders for options only though?  And RH doesn't allow options", "score": 1, "replies": [{"body": "No, it is for straight stocks as well - e.g., placing a limit sell while you have a stop loss order sitting (one of which would be cancelled if the other was triggered).", "score": 2, "replies": [{"body": "Ahhh gotcha! Good point - RH won't let you do both. Holy shit I didn't even realize that until now. Maybe I should move at least some of my cash to a different app for the really important stocks that are more volatile....", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Bitches need to get on Optionshouse.", "score": 1, "replies": []}]}, {"body": "Fuck who do I inverse? Myself?", "score": 1, "replies": [{"body": "gotta take out your totem to see if you're stuck in inverse or inverse inverse", "score": 1, "replies": []}]}, {"body": "bruh", "score": 1, "replies": []}, {"body": "I bought 120 shares. And then some $810 calls. :/\n\nhttp://imgur.com/a/c3U2V", "score": 1, "replies": [{"body": "Not responding well AH, might rebound a bit during the day tomorrow", "score": 1, "replies": [{"body": "RIP! :D\n\nYeah, I'm not worried about the stock, the calls are worthless as fuck lol.", "score": 1, "replies": [{"body": "His call is Mar 17 so he still has time.", "score": 2, "replies": [{"body": "I'm newer to understanding options trading so I have a quick question. Why are you able to buy calls lower than the current stock price? Are your premium higher to make up the difference? Whats the benefit of buying call options lower than the current stock price today?", "score": 1, "replies": [{"body": "Because the system is designed that way?  A call that is lower than the current stock price is called an ITM (in the money) option.  Look at fb option tables for an example of all options available.  Note that not all of them is tradedable due to no volume:\n\n\nhttp://finance.yahoo.com/quote/FB/options?p=FB&date=1486684800\n\n\nEach option has a delta value which indicates how much the option will move when the stock moves.  The more ITM an option is, the higher delta it has.\n\n\nPeople have a lot of reason to buy ITM.  When the stock drop, if the option is OTM (out of the money), it becomes worthless.  But if it's an ITM option, it may still retain some value.\n\n\nFor the people who buy deep deep ITM options (delta>.9), they treat it as discounted stocks.\n\n\nTake, an example, if you buy a call fb option at 80 strike that expires in Dec 2017, it'll cost you $53.  That means for $53, you have the right to buy 100 shares of the stock at $133 (80+53).  Since FB is at 130.84 right now, you pay a few dollar more but it's taking you a lot less margin.\n\nOf course, things aren't all rose-colored because if you stock goes down, the option loses a lot more due to the leverage.", "score": 1, "replies": []}]}]}, {"body": "Yeah, I think you'll be fine on a couple of months on the shares.  Wish i had over 100k to invest in one stock..", "score": 1, "replies": []}]}, {"body": "Yeah, so honestly didn't lose much. Calls are down -$4.6k, still worth $5k to sell. Might hold till next week if there's more of a rebound. I bought more AMZN stock on the dip, too LOL. Can't ever have enough AMZN imo.", "score": 1, "replies": []}]}]}, {"body": "Damn...lol lookin like a blood bath ", "score": 1, "replies": []}, {"body": "RIP bruh.", "score": 1, "replies": []}, {"body": "Only 1 loss out of 6. Good job OP", "score": 1, "replies": [{"body": "I made a ton off of amd yesterday so I'm not worried if this misses.", "score": 0, "replies": [{"body": "IF? L O L", "score": 3, "replies": [{"body": "It didn't miss, they beat earnings. ", "score": 1, "replies": [{"body": "you said \"this\" not earnings, \"this\" definitely missed", "score": 2, "replies": [{"body": "Touche, I meant earnings. Earnings were positive so I'm happy. I'll buy a bunch more shares and turn a profit in a few weeks.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Get rekt m8", "score": 1, "replies": []}, {"body": "I'm sorry.", "score": 1, "replies": []}, {"body": "Never change, WSB. ", "score": 1, "replies": []}, {"body": "Is that... Robinhood2k?\n", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "For me it's strictly a hobby. I have my own business that takes all my time. Most of my money is in a different account and heavily diversified. In my robin hood is my risky bets money. Sometimes you win big other times you lose big.", "score": 2, "replies": []}]}, {"body": "> Account size greater than 5k\n\n> Robinhood as main broker\n\nPlease, buy a rope with those gains and figure out the rest. ", "score": -2, "replies": []}, {"body": "Chance of winning 6 coinflips = .5^6 = 1.57%.\n\nRIP.", "score": 0, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Well, looking at it a different way (Bayesian), given that he's won 5,  his chances of winning the 6th is technically 1/2, assuming probabilities are independent as you've both assumed, which they're really not in the stock market.  AMZN is significantly more likely to beat and go up when its peers in the tech sector have gone up too.", "score": 1, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}
{"title": "$AMZN EARNINGS THREAD: Q4 EPS $1.54 vs. $1.35 Est.; Q4 Revs. $43.74B vs. $44.68B Est.", "selftext": "$AMZN EARNINGS THREAD: Q4 EPS $1.54 vs. $1.35 Est.; Q4 Revs. $43.74B vs. $44.68B Est. ", "id": "5rpgir", "created_utc": 1486069457.0, "score": 79, "upvote_ratio": 0.91, "num_comments": 174, "comments": [{"body": "What the hell somebody hold me", "score": 71, "replies": [{"body": "We got Bezos'd again!", "score": 19, "replies": [{"body": "Jeff Bezos shiny smooth scrotum surprise butt secks again. Ugh never playing amzn in Q4 earnings again. ", "score": 15, "replies": [{"body": "Honestly thought they would beat. \n\nLots of those echo dot commercials. Hell, I got 3 and accessories. \n\nSupposedly it was a good time for online retailers. \nhttp://www.forbes.com/sites/shoptalk/2016/12/27/ecommerce-continues-to-be-the-bright-spot-for-holiday-sales/#385d558d2a8f\n\n\nOh well.\n", "score": 7, "replies": [{"body": "Accessories?  Bedazzling them?", "score": 3, "replies": [{"body": "WiFi outlets, Logitech Harmony hub. I'm planning to get more shit so I can tell Alexa what to do without even lifting up the remote.\n\nEdit: Odd, I think accessories and I picture tech... you think accessories and you think homosex. to each their own... own bathrooms that is.", "score": 1, "replies": []}]}, {"body": "Confirming you thought that many ads suggests amazing sales", "score": 3, "replies": [{"body": "No, I was referring to the forbes article for sales. \nI thought the ad blitz would help though.", "score": 1, "replies": []}]}, {"body": "Revs missed...despite the other retailers guiding down...means that AMZN isn't benefiting too much from that.", "score": 2, "replies": []}, {"body": "That's pretty fucked. Why load your house with devices that can be used against you in court? Good luck killing any hookers and getting away with it in the future...", "score": 2, "replies": [{"body": "http://screencrush.com/442/files/2013/09/3bc3c337bb5234ccaeefa2fcaaad861852e38fa97cc391872f4ad3ac.jpg?w=720&cdnnode=1", "score": 2, "replies": []}]}]}]}]}, {"body": "Alexa, can I get a bounce tomorrow to dump my stock?", "score": 8, "replies": [{"body": "[you're showing too much](http://imgur.com/ToJt7iz)", "score": 16, "replies": [{"body": "Damn Reddit detective over here", "score": 9, "replies": [{"body": "Yes, not even allowed to do a little copy pasta. 7 minutes... damn quick Reddit detectives.", "score": 7, "replies": [{"body": "sounds like someone is tryin for that cock man. ", "score": 1, "replies": []}]}]}]}, {"body": "You got stocktwat-ed bruh!", "score": 1, "replies": []}]}]}, {"body": "It was actually a pretty good quarter.  People get hung up on top line but they only missed by 2.2% and expectations were lofty.\n\nWhat really matters is AWS up over $1B Y/Y and cash burn is down/margins expanded.  The dip will be bought tomorrow.", "score": 35, "replies": [{"body": "I was actually happy they missed so that I could get in at a good price. Been looking for a dip to buy in before they compete with steam and make bank from the gaming industry. looks like tomorrow will be my chance. ", "score": 10, "replies": [{"body": "i highly doubt you're alone.  long term faggots are taking their lips off their boyfriends' dicks for this one", "score": 31, "replies": []}]}]}, {"body": "I hate yall. The Canadian would have said long Amzn and we all would have inversed it and be eating tendies tonight.", "score": 13, "replies": [{"body": "Ya. he posted on his sub and gave one of the silly, non-barf writeups on why it was going to tank (aka sign to inverse the inverse). Fucker was right. ", "score": 4, "replies": []}, {"body": "I don't know is why I relied on that clown. ", "score": 1, "replies": []}]}, {"body": "Hey Alexa, feel free to take all my sweet jnug gainz from yesterday", "score": 10, "replies": []}, {"body": "holy shit, 12 days of gains gone.  OMG END OF THE WORLD.  ", "score": 8, "replies": [{"body": "Had to scroll awful far to find this.", "score": 3, "replies": []}]}, {"body": "Ah well, back to more bagholding tomorrow. I was long 200 shares. Probably going to go below $800 in a week. ", "score": 7, "replies": [{"body": "long term though it will eventually be over 1000", "score": 17, "replies": []}, {"body": "Maybe it opens unchanged, FB style", "score": 4, "replies": [{"body": "Or falls fb style like today", "score": 10, "replies": [{"body": "That was also heavily influenced by the ZeniMax verdict.", "score": 3, "replies": [{"body": "Should rebound thought right? I want to at least recoup some money on these calls", "score": 2, "replies": []}]}]}, {"body": "Regardless it's not closing at $830.00 tomorrow. I'm probably keeping my shares. ", "score": 2, "replies": [{"body": "Closing 900 tommorow", "score": 7, "replies": [{"body": "Sold a call at an $830 strike. I'm keeping the premium and the shares.", "score": 5, "replies": [{"body": "Goddamn amzn", "score": 1, "replies": []}, {"body": "Not bad", "score": 1, "replies": []}]}, {"body": "I sold a 900 but it was not enough to cover. I needed it to stay above 814 =(. Today I make 1k on it so there goes all my gains. ", "score": 1, "replies": [{"body": "Good lord wtf amzn", "score": 1, "replies": []}]}]}]}, {"body": "How was FB in AH?", "score": 1, "replies": [{"body": "Up", "score": 2, "replies": []}]}]}, {"body": "Buy more.", "score": 2, "replies": []}]}, {"body": "REKT!... lots of people gonna have sore butt holes tomorrow.", "score": 25, "replies": [{"body": "not sure you know what rekt means", "score": 8, "replies": [{"body": "3% DROP!! GET REKT'D KID!!!", "score": 17, "replies": [{"body": "options", "score": 19, "replies": []}, {"body": "obviously you have never played AMZN options---these cost thousands---IV crush alone will destroy anyone who bought just calls ", "score": 6, "replies": []}]}, {"body": "\"I rekt your mom's anus so bad I was awarded an honorary PHD in Gastroenterology for my ground breaking work in colonoscopy\"... nope pretty sure I know how to use it in a complete sentence.", "score": -6, "replies": [{"body": "That's nicely put!", "score": 4, "replies": [{"body": "He didn't make that shit up on the spot, he's quoting a famous verse from Shakespeare.", "score": 3, "replies": []}]}, {"body": "trading entirely within expected range", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I banned him... i fucking hate that guy too.", "score": 6, "replies": []}, {"body": "Any mods around to ban that child /u/outofsync42 ?", "score": 2, "replies": []}]}]}]}]}, {"body": "Please stay above 800", "score": 14, "replies": [{"body": "I got in at 731.81 and have been bragging about it ever since. don't take this away from me pls", "score": 9, "replies": [{"body": "I have 785/800 put spread as part of my iron condor. I originally had it at 770/785 but I got greedy thinking it would go up after earnings. ", "score": 2, "replies": []}]}, {"body": "This.  So much this.", "score": 3, "replies": [{"body": "taking a big dive in after hours. ", "score": 5, "replies": [{"body": "bouncing around 805-810 in AH.  Start losing on my trade at 795.  Not crying yet", "score": 5, "replies": [{"body": "About to hit that 800 mark, fuck.", "score": 3, "replies": [{"body": "MAKE IT STOP", "score": 1, "replies": [{"body": "Amazon speaks in 30 minutes. Hopefully they got some good news to reverse this shit.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Just a phone call. But it's going back up at the moment.", "score": 2, "replies": []}, {"body": "http://edge.media-server.com/m/p/zd5z9eng/lan/en", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "wtf did you trade", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "GL on that. Falling like a drone shut out of the air.", "score": 2, "replies": [{"body": "not sure you know what gravity is", "score": 5, "replies": [{"body": "Whatever it is, it sounds like I should short it.", "score": 1, "replies": [{"body": "Gravity always wins", "score": 1, "replies": [{"body": "Tell that to my antigrav startup I am going to fund with my jdst gains", "score": 2, "replies": []}]}]}]}, {"body": "it's going down more like a plane would on the hudson\n\nnope more like one of those birds that swoop down into the water to snatch up a fish and fly away", "score": 1, "replies": []}]}, {"body": "pls drop to 10 dollars I want buy in ^^^^pls", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Sweet prince is getting a pegging by the Amazons ", "score": 5, "replies": [{"body": "I went in hopeful, but they went in dry :(", "score": 4, "replies": []}]}]}, {"body": "Well looks like I ended up neutral on this trade. Hoping it stays at 815. Huge bummer. Gonna buy back if it hits 7xx still an amazing stock ", "score": 4, "replies": [{"body": "Hahaha I was hoping it will stay above 814. I have a call deep ITM and sold one at 900. Through the day I managed to make 1K riding the waves but I guess it's all gone now :(. Both calls are out 131 days, so I guess bag hold and may be sell another to lower my price. ", "score": 1, "replies": []}]}, {"body": "How often do AH losses swing back to green after the conference call? Asking for a friend", "score": 5, "replies": [{"body": "1%?", "score": 3, "replies": []}, {"body": "Ask zuckerberg", "score": 2, "replies": []}, {"body": "http://edge.media-server.com/m/p/zd5z9eng/lan/en", "score": 1, "replies": []}]}, {"body": "Sold Feb 3 790/800  870/880 spreads.  Much closer wings than I usually play.  Andddd it's sitting way too close to my puts.", "score": 3, "replies": [{"body": "what was credit?", "score": 2, "replies": [{"body": "Avg 4.831 per lot", "score": 3, "replies": [{"body": "so almost 50% of max loss credit. not bad for so far out. learning and considering doing trades like this, thanks for info.", "score": 5, "replies": []}, {"body": "So if it's above 795 before the end of tomorrow, you're good.", "score": 1, "replies": [{"body": "Prefer above 800 so I keep max profit", "score": 1, "replies": []}]}]}]}, {"body": "eh I think you'll be fine.  You'll at least be able to close for some profit tomorrow morning", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Buy 790 put\n\nSell 800 put\n\nSell 870 call\n\nBuy 880 call\n\nSelling the inner wing 800/870 to collect premium, buy the outer wings 790/880 to define and manage risk.  Goal of trade is to have the underlying close within the inner wings within the time to expiration.  ", "score": 2, "replies": [{"body": "Now i'm hungry for premium chicken wings.  Which reminds me TSN earnings are on the 6th.", "score": 1, "replies": []}, {"body": "what premium did you collect on this? \n\nEDIT: I scrolled down...nvr mind. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Correct.", "score": 1, "replies": []}]}]}, {"body": "Reverse of what you have. You sell the inner ones, buy the outer to limit your loss and make it a defined risk trade. ", "score": 1, "replies": []}]}]}, {"body": "Damn, looks like revenues is what's driving it down AH. Well, I feel better bagholding this instead of something like JDST", "score": 3, "replies": [{"body": "rev has always been what matters for AMZN", "score": 3, "replies": [{"body": "Yeah but now they're profitable. And beating expectations accordingly", "score": 1, "replies": [{"body": "Alright feel free to value them based on their P/E of 200 ", "score": 1, "replies": []}]}]}]}, {"body": "In retrospect buying Amazon and GoPro before earnings wasn't the smartest idea I've had.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I honestly have no idea. The stock was moving up pre-close, I was literally walking down the street and was like fuck it, just bought 50 shares so it's not a big loss but I honestly don't even know what I was thinking. I guess I figured the karma drone thing was priced in to expected revenue already.", "score": 1, "replies": []}]}]}, {"body": "Who got puts?", "score": 3, "replies": [{"body": "i sold puts atm lmfao im cucked on that one", "score": 9, "replies": [{"body": "lets see where it open tomorrow.", "score": 1, "replies": [{"body": "i actually gave myself an extra week, but my strike is 837.50 lol", "score": 2, "replies": [{"body": "2 extra weeks and a strike of 810 here. Hang in there lol. :)", "score": 2, "replies": []}]}]}, {"body": "Gonna need proof of this", "score": 1, "replies": [{"body": "http://imgur.com/t7kwOTD", "score": 2, "replies": [{"body": "you should renegotiate TDA commissions ", "score": 1, "replies": [{"body": "I have?", "score": 1, "replies": [{"body": "you said you're paying 9.99 on equity, whats your options pricing", "score": 1, "replies": [{"body": "I got 1.50 on options. They wouldnt change my equity rate unless i planned on depositing 25k since i asked after the tastytrade break up", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thinking of rolling myself... Fuck you AMZN", "score": 1, "replies": []}]}]}, {"body": "buy the dip?", "score": 3, "replies": []}, {"body": "Im so glad im too poor to buy Amazon", "score": 3, "replies": []}, {"body": "my guess it will hit 760.  Then buy back.", "score": 3, "replies": []}, {"body": "Lol missed revenue by 1 full billion dollars. ", "score": 10, "replies": [{"body": "Which is less than 3%...", "score": 11, "replies": [{"body": "Coincidentally, their stock is down more than 3% now.", "score": 5, "replies": [{"body": "Weak guidance for Q1. ", "score": 6, "replies": []}]}]}, {"body": "missed expectations that were inflated due to pre-earnings rumors of big quarter", "score": 6, "replies": []}, {"body": "A whopping 2.2% below expectations.  Doesn't sound as bad then...top line is not the leading indicator for AMZN.  AWS has much better margins and was up over $1B Y/Y", "score": 5, "replies": []}]}, {"body": "Holy shit that beat", "score": 2, "replies": [{"body": "EPS don't mean SHIT.", "score": 7, "replies": [{"body": "43.74 billion in the fourth quarter from $35.75 billion last year. That's still a 22.4% increase from last holiday season, though. ", "score": 5, "replies": []}, {"body": "Elaborate? Is it because #of shares available isn't indicative of anything?", "score": 0, "replies": []}]}]}, {"body": "My bull credit spread might be okay if we stay around $800-810 after that IV crush. Can only hope.", "score": 2, "replies": [{"body": "I feel you, need this MF to climb back to at-least 812.5", "score": 1, "replies": [{"body": "It's possible. It fall pretty instant, might see a small bounce back. ", "score": 1, "replies": []}, {"body": "Depends on conference call at this point.", "score": 1, "replies": []}]}]}, {"body": "Expected move is $38.That was so obvious. Most of them didn't expect it to move too much.No reason to play it on earning.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "not sure you know what huge means", "score": 20, "replies": [{"body": "Show him your butt hole. ", "score": 3, "replies": []}, {"body": "Huge enough for the market", "score": 5, "replies": []}]}]}, {"body": "Damn it!!! FScomeau was right!!! Inverse failed!!! ", "score": 2, "replies": []}, {"body": "Down 3.5% ", "score": 1, "replies": []}, {"body": "RIP", "score": 1, "replies": []}, {"body": "Now a good time to get in long? ", "score": 1, "replies": [{"body": "Yeah I say so. Margins have expanded, AWS is up, and more shopping is still shifting online. Plus Amazon can turn in a profit every quarter now.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Considering 10 states starting in 2017 have now required a state sales tax on amazon purchases  it'll be worse even if its filled with new inventory shit.", "score": 1, "replies": []}]}, {"body": "Well fuck.", "score": 1, "replies": []}, {"body": "Hope this doesn't drag the rest of the FANG and tech down with it tomorrow", "score": 1, "replies": []}, {"body": "http://edge.media-server.com/m/p/zd5z9eng/lan/en", "score": 1, "replies": []}, {"body": "So it's going to go up tomorrow because it is a great buy in now right...Right... I think clearly I need to average down fuck me I didn't want to tie so much of my money to one company again.", "score": 1, "replies": []}, {"body": "Bottom line good top line bad? Is that right?", "score": 1, "replies": []}, {"body": "Fuck! Was too pussy to straddle. Chicken tendies instead. ", "score": 1, "replies": []}, {"body": "bag to bagholding this again.. why did i buy into this company as soon as they miss earnings??", "score": 1, "replies": []}, {"body": "People should just inverse me. My inverses would make you sooo much money recently.", "score": 1, "replies": []}, {"body": "just fucking glad i sold my weeklies today and got March calls lol", "score": 1, "replies": [{"body": "will be 810-820 EOD tmo minimum\n\nwe goin back up boys", "score": 3, "replies": [{"body": "Yea I wish", "score": 1, "replies": []}]}]}, {"body": "Another quarter, another miss. Yet, it will be green by the end of next week. Don't have the nerves to short this again :/", "score": 1, "replies": []}, {"body": "Funny, people actually care about revs than profits. If it was my company I'd be happy if the company actually makes more money than pulling revs without any profits. But what do I know lul, my condolences for WSB team.", "score": 1, "replies": [{"body": "It's a momentum stock with high expectations - if they miss on anything, it will drag it down. Full stop. ", "score": 1, "replies": [{"body": "I purschased QQQ puts this morning, expecting AMZN would take a shit, but IV was too high on AMZN so I went with QQQ instead. Hope I can capture some of those mad gainz tmr. Strike at 125 btw for like 23 cents each contract.", "score": 1, "replies": []}]}]}, {"body": "I'd like to thank everyone who told me to stay away from this dumpster fire.", "score": 1, "replies": []}, {"body": "Looks like it's settling around $801/$802 in the AH. Volume's 1.7 million shares.", "score": 1, "replies": []}, {"body": "Me and my best friend were talking about buying yesterday. We didnt but we had a good laugh today. ", "score": 1, "replies": []}, {"body": "Take it from someone who shorted before the drop yesterday: Buy the fucking dip.  \n\nThis drop will not last long.", "score": 1, "replies": []}, {"body": "AMZN, FB, GOOG and SBUX all got buttfucked after their earnings. Looks like defying the God Emperor really gets you fucked.", "score": 1, "replies": []}, {"body": "cucked.", "score": 0, "replies": []}, {"body": "Earnings beat but -3% AH???", "score": -1, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Analyst couldn't care less about their EPS.  Revenue miss in Q4 which includes Xmas and Black Friday.... no bueno", "score": 8, "replies": [{"body": "$43.74 billion in the fourth quarter from $35.75 billion last year.  That's a 22.4% increase from last holiday season.  Even though it didn't meet the arbitrary expectations, 22.4% is still a significant increase in revenue--especially when you are talking tens of billions of dollars.", "score": 4, "replies": [{"body": "Don't disagree with that in the slightest, but in the context of market expectations it's a miss and investors demand even more from AMZN as evidenced by their valuation", "score": 2, "replies": [{"body": "I agree with you. I just don't want anyone to think that they had a *bad* quarter.  It was good, just not insanely good.  Unfortunately me and other new bagholders, an insanely good quarter was already priced into the share price. So look out below. I hope it goes back up soon, as I don't want to baghold this shit for like 18 months. ", "score": 2, "replies": [{"body": "Sell calls in the meantime. Takes the sting out of it.", "score": 1, "replies": []}]}]}, {"body": "Still this company is trading at a PE of nearly 200, so any slight deviation from expectations will punish the stock.", "score": 1, "replies": []}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Seriously I thought they would do better. But then again their black friday deals are crap. ", "score": 2, "replies": []}]}, {"body": "Guidance was also lower than expected for Q1. ", "score": 1, "replies": []}]}, {"body": "EPS is too easy to fudge.  Can't fudge revenue", "score": 4, "replies": []}, {"body": "beat? wut?", "score": 1, "replies": []}, {"body": "expect other retailers to be up tomorrow. \n\n", "score": 1, "replies": []}]}, {"body": "From 88$ Gainz to 89$ losses, real quick, real fucking quick", "score": 0, "replies": []}, {"body": "Wait you mean a retailer shouldn't be at 200+ P/E ?????????\n\nBut Amazon got the dot and it goes boop doo\n\nFairvalued stock is boring :'-(", "score": -3, "replies": [{"body": "Haters will hate.  ", "score": 1, "replies": []}]}]}
