{"title": "I have the psychological problem of not being able to choose an investment strategy.", "selftext": "Hello everyone,\n\nfinally I'm blesssed with the opportunity to afford investing $1000 per month. This opportunity has been here for around 5-6 months. But I have the issue of not being able to decide where to invest this money.  Everytime I set up a savings plan in my brokerage account, I start hesitating and cancel it  a few weeks later.\n\nMy troubled thoughts:\n\n1.Any WORLD ETF: \"Hmm, maybe I'm too diversified and won't profit much more than the average investor. Additionally, this might be boring, because everybody else is doing it.\". \n\n2.S&P 500 ETF: everytime I set up a savings plan for this ETF, I start thinking \"Hmm, investing only in the US would make me miss on other opportunities worldwide\". Cancelling.\n\n3.Any actively managed fund: \"Hmm, they've outperformed the market in the last 5-10 years, what's the guarantee that they will manage this in the future? Additionally, I don't want to give them my money, I can pick up the stocks myself\". Cancelling.\n\n4.Picking stocks by miyself: \"Hmm, SQ, MASTERCARD, MSFT and ALPHABET are amazing. But what IF they stop being amazing or what if I miss on other great picks? Cancelling.\n\n5.Back to step 1. And it goes on like this for 6 months already.\n\nHow to \"solve\" this problem? How could I be at rest finally? I WANT to invest $1000 monthly, but keep overthinking every possible choice.\n\nHave you ever been in a similar situation? What would you do?", "id": "os1c82", "created_utc": 1627314093.0, "score": 24, "upvote_ratio": 0.71, "num_comments": 51, "comments": [{"body": "dont look for the needle, just buy the haystack. - jack bogle", "score": 73, "replies": [{"body": "OP Listen to this. \n\nThat Jack guy's teachings really hit home with me. It's soooooooooooo much easier his way. In fact, I pretty much only view these subreddits now to see what everyone's scared of this week.", "score": 24, "replies": [{"body": "the bogleheads guide to investing is also free as a pdf. go check it out, its a great read. https://old.reddit.com/r/Bogleheads/comments/opdn0t/the_bogleheads_guide_to_investing_now_free/", "score": 10, "replies": [{"body": "Thanks for the link! Will start reading tonight.", "score": 1, "replies": []}]}]}, {"body": "Thanks for the quote. So the Total Stock Market it is.", "score": 5, "replies": []}]}, {"body": "Quit with the worldwide vs us stuff. U.S. companies are advantaged by being part of the country that literally prints the world reserve currency. The government,  which again literally prints money, has a vested interest in these companies success.\n\nThat's why U.S. companies should make up largest percentage of your portfolio. They are uniquely advantaged.", "score": 24, "replies": [{"body": "Americans also seem to rather invest in US companies. Compare Moderna performance with BionTech. Moderna has two times the market cap of biontech", "score": 7, "replies": [{"body": "\"Invest in what you know\" kind of thing.", "score": 2, "replies": []}]}, {"body": "And yet they've underperformed compared to some markets that are undeniably less developed.", "score": -3, "replies": [{"body": "Over what time period and when? \n\nCause no, not really", "score": 4, "replies": []}]}]}, {"body": "This is solely my opinion based off of what you wrote and what I think others will say.\n\nThere is nothing wrong with having a S&P 500 ETF with a few hand picked stocks you really like.\n\nThe beauty of the market is you can buy and sell things. You aren't stuck with something if you really don't think it's working out. (Keep in mind tax stuff but you get the point)\n\nWhat's preventing you from having ANY results is not pulling the trigger. 1k a month is going to snowball pretty quickly.\n\nEdit: While there are a few gems in the foreign market. The world's biggest and best Corporations are mainly US based. I wouldn't worry about missing world opportunities.", "score": 12, "replies": []}, {"body": "Diversify.  Capture everything.  Adjust as the market adjusts.", "score": 6, "replies": []}, {"body": "Keep in mind that good investing is supposed to be boring. Keep it simple with not anymore than 3 ETFs.", "score": 5, "replies": []}, {"body": "Option 1.  You'll never need to rebalance.  You'll never need to do anything other than just keep contributing.  Yes, it's boring... but it works.", "score": 5, "replies": []}, {"body": "You can do it all. Just set up 4 different plans and divide the money. \n\nYour biggest problem right now is getting started. Once you start, and have skin in the game, you will slowly figure out your risk tolerance, if you enjoy actively keeping tabs on the market etc.\n\nNobody knows exactly what kind of investor they are before they start. Over time, the results will help you with your overthinking.", "score": 4, "replies": [{"body": "Thank you for the positive and encouraging input.", "score": 2, "replies": []}]}, {"body": "I'm really good at making plans but really bad at keeping them", "score": 2, "replies": []}, {"body": "You could just buy majority indexes and then pick a few stocks you really like? I think that's what most people do isn't it?", "score": 2, "replies": [{"body": "Yes, I think this would be the best solution to my issue. Thank you for your input.", "score": 2, "replies": []}]}, {"body": "Stop being scared and have some damn conviction young man/woman.", "score": 2, "replies": []}, {"body": "Look at each month as a chance to buy $1,000 bricks to build your investment house.\n\n-Month 1: Blue-chip dividend payer like $TSN\n-Month 2: Large Cap Growth\n-Month 3: Mid Cap Income\n-Month 4: Investment Grade Bond ETF\n-Month 5: Developed Market Stock\n-Month 6: Mid Cap Mid Cap Growth\n-Month 7: Large Cap Dividend\n-Month 8: High Yield ETF\n-Month 9: Large Cap Growth\n-Month 10: Small Cap\n-Month 11: Emerging Market\n-Month 12: Global Bond\n\nThis is just a brainstorm.  It gives you full 75/25 diversification, and is programmatic so it takes the emotions out of the equation.  Actually, it gives me a good idea for my own subreddit.", "score": 2, "replies": []}, {"body": "Put it all on 1 stock", "score": 3, "replies": [{"body": "I was thinking about this, but maybe I‘m not YOLO enough to become a superstar on r/wallstreetbets .", "score": 3, "replies": [{"body": "I got 90% on 1 stock & 10% on another. Can’t mention which because I might get removed / banned for ‘recommending individual stocks’", "score": 2, "replies": [{"body": "You can PM me with the stock recommendation :P", "score": 1, "replies": [{"body": "HUIZ & PRTS", "score": 1, "replies": []}]}]}]}, {"body": "Preferably a meme stock", "score": 7, "replies": [{"body": "Dogestock", "score": 0, "replies": []}]}]}, {"body": "> Hmm, investing only in the US would make me miss on other opportunities worldwide\n\nPlease consider how many US companies have massive and/or growing overseas presence, and how increasingly global the economy is.\n\nI've been in the same boat for a while, and am finally getting my brain right. What's worked for me: keep a couple big-name core ETFs (in the vein of VTI or QQQ) and pick a few more that hit sectors or heavily feature stocks you like, maybe something with a solid dividend to carry you through more difficult times (SCHD actually hits on both of these points nicely and I have it myself), and maybe keep a few individual stock picks if you want to have some fun with it.\n\nFor example, I have a reasonably high position in SOXX because I wanted more exposure to NVDA, and VGT because I wanted a higher proportion of AAPL and MSFT; I also hold TGT and COST directly because I have extreme faith in their long term performance, and F because I have some faith and am from Detroit.", "score": 1, "replies": []}, {"body": "Just invest in what you like. \nI have 10% in VFIAX, 5% GLD, 5% SLV, 20% cash for dips, 4% LIT, 4% ETHE/BTC, and then holdings in AAPL, AMZN, NVDA, GOOG, TSLA, GME, COST\nI’ve beat the market 3 years in a row doing a non standard strategy. Buying great companies at discounts, and taking advantage of asymmetric opportunities. I also trade options on NOK, CLF, CAT, PLTR, and some others", "score": -1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Wow, ok. Y’all get back into your bonds and gold and forget about beating the market then. Don’t bother thinking outside the box, just do what everyone else does, that’s what you ought to do right? Pathetic.", "score": 2, "replies": []}, {"body": "I‘m definitely not touching any options. Especially NOK options.", "score": 0, "replies": []}]}, {"body": "Very unorthodox but beating the market is great. I expect it wasn’t much of a feat considering the gains we’ve seen across the board. Do that the next 3 years and I’ll be impressed. Probably do this more reliably with a better approach.", "score": -1, "replies": []}]}, {"body": "I have a retirement account that is pretty much all mutual funds(some active and some passive), and a taxable account where I buy single stocks and speculate.", "score": 0, "replies": []}, {"body": "If you have put your money in any of these options 6 months ago, you'd be richer today.\n\nThis is how you do it: look into a mirror, admit you've been stupid (actually say it out loud), and do then take action.", "score": 0, "replies": [{"body": "This is exactly how I feel. I missed on 6 months of profits by thinking too much what the right would be. Never again.", "score": 1, "replies": []}]}, {"body": "Wow. Your are truly alone. Nobody has ever had that problem", "score": -8, "replies": [{"body": "This is why nobody likes you", "score": 6, "replies": []}]}, {"body": "You’ve already lost 10%+ in opportunity cost. Quit hemming and hawing and jump in! Have a solid core of broad market ETFs and add a few stocks you like. And reap the benefits. Or not. Nothing to fear but fear itself.", "score": 1, "replies": []}, {"body": "Look at all those tickers you just mentioned and check their 3M and 6M returns. Then look at their 1Y and 5Y returns. Certainly they’ve all gone up. With time, so will YOUR investments, no matter what you chose. \n\nYou. Are. Not. Helping. Yourself. Sitting. On. Cash.", "score": 1, "replies": [{"body": "I totally agree.", "score": 1, "replies": []}]}, {"body": "To start just deposit the money at your broker, buy an S&P 500 or other index mutual fund and have money automatically invested.  I'm with Schwab and have auto invest on the 5th and 20th of each month.   If you don't feel like doing more, you will still be way ahead of most.   If you are nervous, you don't need to have the full $1,000 invested.  Put some in a MMA or short term bond fund and wait for opportunities.    I love investing but not everyone does.  Do what you feel comfortable doing.", "score": 1, "replies": []}, {"body": "Buy some of all. You don’t need one fund or stock. Find your backbone and build off it.", "score": 1, "replies": []}, {"body": "The easiest thing in your situation would be to research the investment strategy of the big groups, and just copy their approach. For instance, you can look up what Vanguard would be doing for your stage of investment, which is going to be the typical mix of US + World large/mid/small, with a bit of bonds. But if you copy it from the experts then you no longer have to second guess.", "score": 1, "replies": []}, {"body": "Personally, I would start with FAANG (FAAMG) stocks. Then a semiconductor ETF. Then ROKU and SQ. Then BRK.B. Then some growth stocks that are higher risk, higher reward; CELH, COIN, CRSR, NIO.", "score": 1, "replies": []}, {"body": "My strategy is value meets dividend growth. I like getting stocks at a fair price instead of buying hype. Got to separate a stock and it's price from the company itself. I don't care how innovative a company is if that is priced in. And if the company pays a dividend, I reinvest it with DRIP.", "score": 1, "replies": []}, {"body": "easy, put it all in a Growth ETF to get started. \n\nThen once you make up your mind you can sell and invest in one of the options you mentioned.", "score": 1, "replies": []}]}
{"title": "Am I being delusional with my expectations?", "selftext": "So I've been dabbling with options for a few months now with little success (learned not to play with naked calls). I recently came across the put credit spread strategy. \n\nOf course, the total newbie in me feels that this is an absolute goldmine! \n\nConsider this:\n\nCurrent price of $MSFT: $289.50\n\n16 spreads on $MSFT. $277.5/275.0 at around .25 delta. 2 weeks till expiry.  \n\n$4000 collateral with a credit of $640 (0.40 per spread). \n\nIf I were to let these spreads run to expiry, this would equate to a 16% ROR, however I do not plan on letting this happen. I plan on closing positions the second I make 50% of the total credit I could have gotten ($320) to be even more conservative. \n\n&#x200B;\n\nSo here is my question:\n\nWould it be unreasonable for me to rely on this strategy to generate $300/week to pay for bills/living expenses?\n\nSomething I hear frequently on here is that put credit spreads \"work until they don't\". The thing is...unless the market crashes...I just can't see how this can fail. This is $MSFT! Lets say that there is another big move in the market... I'll just roll the expiry. \n\nAppreciate all feedback!", "id": "osa70o", "created_utc": 1627339845.0, "score": 15, "upvote_ratio": 0.75, "num_comments": 51, "comments": [{"body": "MSFT reports earnings tomorrow. That's why you are seeing high premiums. Also MSFT was at 270 a month ago, it can absolutely return to that without a market crash.", "score": 61, "replies": []}, {"body": "If you don’t see how something could fail you don’t understand it enough to make the move IMHO", "score": 120, "replies": [{"body": "words of wisdom right there", "score": 19, "replies": []}, {"body": "This. 1000* this.", "score": 7, "replies": []}, {"body": "There’s a reason why you’re the dean!", "score": 5, "replies": []}]}, {"body": "Spread that cashola among multiple underlying utilizing different strategies brah. Don't put your 4k into one basket.", "score": 19, "replies": [{"body": "You're right. This would be the most wise thing to do. But the $4k does not make up my whole portfolio so I do still have money to defend the positions.", "score": 1, "replies": []}]}, {"body": "The fastest way to zero out your account balance is to hyper leverage very narrow spreads.\n\nYou should be worried about that WAY more than you are worried about selling naked.\n\nIt takes a much larger move for selling naked to take you under as compared to the kind of move it takes to drown you when you are selling narrow spreads.", "score": 18, "replies": [{"body": "This is one of the better comments here. The long leg does a lot of things. It does cap your loss, but also slows down the position and eats into returns. In addition, there is very little adjustment potential in a spread compared to naked.", "score": 5, "replies": []}, {"body": "\"I'll close at 50% profit before expiration so it's fine\" shows he's never actually sold a narrow spread. \n\n**Narrow spreads do not behave like cash secured puts or covered calls**. \n\nDelta erodes slowly for narrow spreads because you're only exposed to the delta contained in the width of the spread. Since far OTM delta erodes the fastest, and spreads tend NOT to be far OTM, the consequence is that much of the time, you won't even see a profit until the last day before expiration, so forget about closing for 50% profit half way in unless the underlying moves drastically in your favor.\n\nNarrow spreads are basically gamma gambles, both credit and debit. No different from swing trading, but with leverage.\n\nWide spreads behave more like actual theta strategies, though they still don't make sense most of the time, unless you're trading a very expensive stock and can't generate the required leverage otherwise.", "score": 4, "replies": [{"body": "I am not a real big fan of using spreads trading in order to get access to more expensive underlyings.\n\nIf your account is too small to trade a particular underlying, just trade a different underlying.\n\nI understand why YOLO artists would turn to spreads trading, but it sounds like a bad move to me.\n\nMore pricy underlyings usually have bigger price swings than smaller underlyings and that can crush someone with a small account that is using FD spreads in order to gain access.\n\nMax loss is also maximally punishing for people with small initial account sizes.  It's hard to get significant diversification with a small account size, so that one leveraged play against TSLA or whatever might be the only position such a person even has.\n\nIf it were up to me, there would be no spreads closer together than 10% of the strike price (100 wide on a 1000 strike stock, for instance).  I think I might have personally gone as close as 7% before, with a very small position in a very large account, but I would give that up for the greater good.", "score": 1, "replies": []}]}]}, {"body": "MSFT was trading in the mid 270's just two weeks ago.  It wouldn't take much in terms of market news to get it back there again.\n\nThe market has correctly priced the risk.  Your math is incorrect if you think the probability of a total loss on the spread is zero.", "score": 15, "replies": []}, {"body": "[deleted]", "score": 33, "replies": [{"body": "Not really. The idea that the other counterparty knows anything is completely false.You can make money on the trade. Are you holding for a day or 2 hoping for iv contraction. Are you planning to roll out every month? Are you playing for earnings? By that premise, you should ALWAYS sell options to everyone because you should be happy to sell.", "score": 2, "replies": []}]}, {"body": "Unfortunately stocks are extremely correlated so when the market drops, they all drop.\n\nThis means any trading operation focused solely on selling puts will eventually get destroyed. The leveraged nature of options means you can easily get wiped out in a correction, erasing years of profits in just a day.\n\nSo any long-term options trading needs to incorporate a variety of strategies, some of which will benefit from a market correction.\n\nAt a portfolio level, for example, you can try to maintain a relatively delta neutral position so you don't get destroyed in a crash.\n\nBut now you're doing a lot more than selling puts and it's not trivial to generate consistent profits. It becomes a full-time job.\n\nPut selling is one of the most lucrative options strategies but let's think about why that is. If you ran a hedge fund or investment bank, wouldn't you want to plough all your cash into selling puts? And then wouldn't every other fund or manager do the same, depressing premium to the point that selling puts was no longer that attractive?\n\nThe fact put selling remains highly lucrative year after year encapsulates some important information, which is that savvy market participants know the risk of ruin is extremely high.\n\nEach participant is thus limited in how much put selling they can reasonably do. This provides an opportunity for little guys like us, since individually we can each risk a little and take some crumbs off the table that otherwise large investment giants would've gobbled up.", "score": 14, "replies": [{"body": "I really like how you break this down. This makes a lot of sense.", "score": 2, "replies": []}]}, {"body": "If you put this trade on do half of your proposed spread contracts. That way if you have to defend the position you will have the buying power to do so.\n\nLearned this over the last month with my XOM credit put spreads. I started with the 61/62 and had to roll to the 60/62.5 and then to the 54/59.5. Notice the trend there? To defend this position as it fell I had to continue to widen the spread and take on more risk. I  MIGHT be able to get out of this position this week, but I'm planning my next roll already and I'm not happy about it.\n\nJust realize what you think can't happen will happen and you need to prepare for it so it doesn't pin you against the ropes. Always size the position so you remain nimble.", "score": 10, "replies": [{"body": "Replying to this comment because I think it's the best advice in this thread. @ op, your trade is basically 'i hope I can make $300 (closing at 50% profit) before I lose $4000'. If you keep doing plays like this you will absolutely hit a big L much sooner than you seem to think.", "score": 8, "replies": []}]}, {"body": "I’m 40 and been trading on and off since college. And I’ve foolishly chased my share of “this can’t fail” (and still do sometimes) and in the short term and at a smaller scale, there are many strategies that can work. But over many years and at a bigger scale (hundreds of thousands $ or more), the reward goes with the risk. Just calculate the worst case scenario and expect it to happen. When you expect it and plan for it, when it does come, you can be better prepared for it.", "score": 11, "replies": []}, {"body": "Here’s how it falls apart. \nIf MSFT starts falling, the BTC price will start expanding on your spread.  “Ok, so I’ll roll for a credit!”  \nBut spreads are hard to defend. You will only be able to roll for a credit if MSFT is trading closer(ish) to the short strike ($277.5) than the long strike ($275). So if it somehow drops to $277.50 and you roll for a credit, this will keep the dream alive until next expiry… but if it keeps sliding a few dollars while in your next cycle, you will not be able to roll for a net credit since you’ll have to pay more to roll the $275p than you’ll net from rolling the $277.5p (EXT premium always richest ATM). At that point, you either start approaching max loss on the position, roll for a net debit (not recommended), or roll to a wider spread for credit (but now you’re taking on more risk… and still might be hard to get net credit). \n\nFor this reason, If you’re going to trade $4k worth of spreads, I prefer doing one spread $40 wide rather than 16 spreads only $2.50 wide. Wide spreads trade closer to naked short put", "score": 11, "replies": [{"body": "Holy crap I never even thought of selling a $40 wide spread.", "score": 1, "replies": [{"body": "Yeah there are just some tradeoffs\nPro: $40 wide spread will be behave more like naked short put, so it’s easier to defend against a down move. \nCon: at some point if you get too wide, you are adding more width without taking in that much more credit (ie taking on more risk without being appropriately compensated)", "score": 3, "replies": [{"body": "So on an underlying that is less volatile than MSFT (as in the example) you'd tighten them up to a more fair risk/reward. I don't bother much with individual stocks, pretty much stick with QQQ/SPY (still plenty volatile but one bad earnings report from MSFT won't crash it). Also with individual stocks I'd choose to diversify and my mind can't be paying attention to that many squirrels at one time. Going with the old Peter Lynch theme of \"All my eggs in one basket and watch that basket\".", "score": 2, "replies": []}]}]}]}, {"body": "Suppose I said \"if you give me $4000, I'll give you $300/week forever\" - would you believe me or would you think it's a scam? $10k? $100k? (Somewhere between $100k and $200k I might start to think it's possible and at $500k I'd think it's reasonably not a scam, but why not just reach for the bond market at that point.)", "score": 6, "replies": [{"body": "You don't factor probabilities in your response. Whether you have 4k or 500k the odds of making the 300$ are the same on the position. Seems to me you are saying that you can more easily generate 300$ of option premium with a 500k account, but the probabilities remain identical. The difference is that you can play more times at the table.", "score": 1, "replies": [{"body": "It was more of a \"can I do this every week for $300 of reliable income\" - how much would I expect someone to be using to generate a reliable $300/week (including all markets, not just the last 12 months).\n\nIf they have $100k and are only running the trade that OP suggested, that's one thing, but not something I'd expect for consistent gain, so ... Probability isn't really coming in to play as much as the broader question of \"do you have an ideal that consistently beats the market in all conditions\".\n\nMSFT is down on the day - curious how OPs positions are holding up.", "score": 2, "replies": []}]}]}, {"body": "... unless the market crashes.\n\nNo. Unless Microsoft crashes. Specifically falls below 275.\n\nAlso what will you do if Microsoft closes at 275.53 at expiry? When will you find out the expiry price? Before market close or ... ?", "score": 8, "replies": [{"body": "That's also a really short window.  Theta Gang looks for 45-60 dte", "score": 1, "replies": []}, {"body": "I don't plan on holding any spreads until expiry. As I said, I am closing once I gain 50% of my potential credit.\n\nIf this does not happen or if the price of $MSFT starts to get near the strike price of my short put, I will either roll the expiry or the strike price.\n\nI'll be honest, the only thing I am unsure of is in the case of early assignment. If I got assigned 100 shares if $MSFT does hit $275.53, would my long put get exercised automatically or would I manually have to exercise it on robinhood? (given that I do not have the collateral to buy the 100 shares)", "score": 0, "replies": [{"body": "Spreads move very little in terms of theta burn. Just try it out in optionstrat.com and move the DTE slider. Anything could happen in two weeks.", "score": 6, "replies": []}]}]}, {"body": "The good thing about spreads? Leverage. The bad thing about spreads? Leverage.", "score": 4, "replies": []}, {"body": "Just do the math. You’ll need 13 straight wins to break even on your first max loss. You can calculate the odds. You have roughly a 75% chance each trade. Then..what are the odds of winning 13 in a row. \n\n.25 deltas get hit all the time. They may not finish in the money, but can you stomach the rollercoaster if the indexes open down 2% one morning before hopefully V’ing? \n\nLike some have said..IV fluctuates... you may see that profit % get cut in half at some point. I dont trade msft options, so I dont know its IV norms. \n\nOtm Credit spreads are easy money most of the time. They get completely obliterated occasionally.", "score": 4, "replies": []}, {"body": "Max loss is $250 per spread ($4k total), max profit is $640 and you are proposing closing at 50% profit so $320.\n\nIt would only take 1 time of it closing at $275 to wipe out the $4k. That is a 9.4% downward move, but it has run up quite a bit the last couple weeks. I would see it easily going down 2 to 10% over the next 2 to 3 weeks even with good earnings.\n\nIt isn't as risk free as you think. MSFT hit a low of $275 6 days ago.", "score": 3, "replies": [{"body": "I will not hold the spreads until expiry regardless of where the price goes. \n\nSure it could definitely drop 9-10%, but as long as I roll, I don't think I'd lose anywhere near $4k worst case scenario.", "score": 1, "replies": [{"body": "Just keep in mind what if you try and roll and it won’t fill? Had this happen to me today with a tested leg of an iron condor. Tried to roll it down and out… no fill.. can’t always get what you want to go.", "score": 1, "replies": []}]}]}, {"body": "If you can't understand how this can go south, do yourself a favour and never invest more than 5% of your account in one company. Or figure out how it could go south, then never invest more than 5% in any one company.", "score": 3, "replies": []}, {"body": "Dont tell him. Only way for him to learn is to let him try and fail. Try 1 spread, repeat multiple times and see how it goes OP.\n\nEveryday we have new moneys like OP come in asking the obvious question “can I get rich fast without taking risk?”. No! You didnt discover fire. The edge is there, and the best way to know the sharpness is to touch it bare hand. Try them out with caution.", "score": 5, "replies": []}, {"body": "The prem is pumped up on MSFT because they are reporting earnings here tomorrow I think.\n\nThe premise of selling options for income is sound. It is a relatively safe way to generate income, but I would temper your expectations. If you spread your risk around multiple underlying across different sectors and time frames, you can generate 0% - 4% per month (7%-15% ROI per spread) on your full account without ever deploying more than 40% - 60% of your capital into the market at any one time.\n\nAnd the real trick is not gapping into max loss and generally cutting losses out before you hit that max loss. If your short strike is challenged, roll or close for a small loss. That is what leads to reliable gains over time.", "score": 4, "replies": []}, {"body": "Works till it doesnt", "score": 4, "replies": []}, {"body": "So I figured I'd add this little piece of additional info, $4k does NOT make up my entire portfolio. I do have money to defend the positions if things go south. I do not intend on letting the positions expire regardless of where the price of $MSFT goes.", "score": 2, "replies": [{"body": "If you are OK with the risk, take this trade. It's there for a reason and folks have illustrated those reasons here. \n\nI only learn by getting burned. Getting burned is exactly what happened to me with credit spreads, but I'm learning a lot from the experience. Mostly it's taught me that the 'impossible' happens way more than I thought, and that position sizing is absolutely key.\n\nOh, and lesson #3:  don't lust after juicy premium. Look at max risk not how many $$ will be deposited from taking the trade.", "score": 2, "replies": []}, {"body": "It’s usually tough to defend spreads.  You can try rolling, but usually you just take the loss and move on.  The way to ‘defend’ them is to not put too many on to start with.  Also, if you look at the delta of the long put, it looks to be around 0.15 delta.  So the market is pricing that option as having a probability of about 15% of finishing in the money (you taking a max loss).", "score": 1, "replies": []}]}, {"body": "Theta gang here. Suggest OP to try it out multiple times, repeat, and one day you’ll learn how one trade can wipe out all of your previous gains.\n\nPersonally, I think selling naked c/p is way safer than “over-levering” with selling spreads. \n\nSelling c/p credit spreads is safe ONLY if you size your spreads reasonably as if you are selling single short legs. The long leg of the short spreads will be the bottleneck should you need to defend. It’s almost impossible to defend spreads. But it’s a lot easier to defend a single leg short c/p.", "score": 2, "replies": []}, {"body": "With earnings tomorrow and only a two week spread it is going to be extremely reliant on how the earnings are received by the market. Delta and other probabilities can't reliably tell you how earnings is going to go, that .25 delta could become .5 real fast. MSFT has had a huge run up so it could sell off. On the other hand if it only dips a small amount, stays flat, or goes even higher, then that plus volatility crush would likely get you to your 50% profit target by Friday if not Wednesday. For what it's worth I do see a bit of support line at 277 but again it really depends on earnings report/call. Also note...from mid Feb to March and from mid April to May, MSFT and most tech/growth plays found themselves in a down trend which is not fun if you've sold puts. SPY has basically done nothing but go up, so it is possible for MSFT to go down without meaning the market is down.", "score": 2, "replies": []}, {"body": "Yes\n\nAlso i only read the title", "score": 2, "replies": []}, {"body": "If you have a $100k account and you like this trade, then go for it.  If you have a $10k account, then hell no….", "score": 0, "replies": []}, {"body": "Not that simple.  If your spread gets challenged and you back out, you don't eat that month and you die.  Because you said you would be living off of it.  LOL.\n\nYou need to be more right than you think to make money on a spread with *proper management*.", "score": 1, "replies": []}, {"body": "Would not ever do this unless I actually owned 100 shares of Microsoft and sold calls against the position. Selling spreads are a lot more risky than selling covered calls/puts. Good luck", "score": 1, "replies": []}, {"body": "Spreads are too risky to me as they are almost an all or nothing proposition and it is only a matter of time before that happens.\n\nDoing this around earnings gets good premium for that week only so not repeatable consistently but there is a good reason premiums are high.\n\nMicrosoft could announce the quarter of their lives BUT if they say anything about economic headwinds the price will crash 5-10 percent and your goose is cooked.\n\nI do wheel so if I run into that (which I did with dollar tree their last earnings) I can either hold shares until recovery or I can take a loss that is a small portion of my investment and account (example above I held a week extra so my two week investment lost $40 one of only three losses I have realized this year so far).", "score": 1, "replies": []}, {"body": "Yes it is unreasonable, it will come down one week and then you lose all your collateral. I have 600 shares of Amgen I generate about 500 a week on with covered calls. \n\nBeginning of May it dropped 15-20 in 2 weeks. That would blow through your bottom strike real quick and you lose all your capital and then you have no more income.", "score": 1, "replies": []}, {"body": "If you are selling a short put with 25 delta, you have a 75% chance of expiration OTM. Would you do 100 of these? I would.", "score": 1, "replies": []}]}
