{"title": "NVIDIA price target raised to $190 by BofA Securities", "selftext": "On Thursday, BofA Securities reaffirmed its confidence in NVIDIA, raising the price target on the stock to $190 from $165 while maintaining a Buy rating. \n. . .\nThe revised price target is supported by an increase in the projected earnings per share (EPS) for fiscal years 2025 and 2026 by 13% to 20%", "id": "1g67nqf", "created_utc": 1729217721.0, "score": 398, "upvote_ratio": 0.96, "num_comments": 88, "comments": [{"body": "Last year we were going back and forth between $490 and $400. But the target was $650. People talked about that price target like it was a joke. Don’t make this same mistake again. If you see any price below $115 buy. Even buying now near ATH will be a win long term. Just like the “losers” who bought “at the top” last year at $490.", "score": 99, "replies": [{"body": "I was on the fence when it was $115 a couple weeks ago thinking I might add if it goes back to $100 and now I’ve been thinking of adding it it goes to $115 lol. That dip from $130-100 had me worried. Trying to time it seems more difficult than I expected", "score": 28, "replies": [{"body": "Dollar cost averaging takes a lot of risk out. That's what I do now. I'm very confident in Blackwell. Blackwell ULTRA, Vera ULTRA, as well as Rubin have been announced. I don't think it's a bad idea for a person to have their brokerage account set to put in a little each day. I'm doing that until at least Q4 ER in Feb 2025, and I don't plan to sell unless for some strange reason Blackwell Ultra and Rubin aren't successful in 2026, but I imagine it will just compound their growth even further, because those chips power to performance ratios will of course be a leap above Blackwell, and especially Hopper. As long as less power is used per performance, they're going to keep selling out, because it saves more money to purchase these new, higher performance to power ratio chips than to stick to existing chips. I'd be shocked if they aren't still sold out in the beginning of 2027 (after the Ultra series and Rubin have been on the ground for close to a year), and by that point the next big thing from Nvidia will be released. Who knows when this will end.", "score": 8, "replies": []}, {"body": "Actually it is $103 right now", "score": -5, "replies": [{"body": "What are you on??", "score": 3, "replies": [{"body": "Oh brother, actually I was a little high 😂", "score": 4, "replies": []}]}]}]}, {"body": "I don't think we may ever see 115 again.  If you want in, get it.", "score": 9, "replies": [{"body": "120 for sure", "score": 6, "replies": [{"body": "the moment it drops below 120 im gonna all in lol, my only regret is i didnt buy more during the Aug dip", "score": 7, "replies": [{"body": "My cost is $20. I kick myself every day that I didn't put every dime I have available in", "score": 1, "replies": []}, {"body": "do you think there will ever be another dip?", "score": 1, "replies": [{"body": "wont be on reddit if i can predict the market", "score": 1, "replies": []}]}]}]}, {"body": "Agree", "score": 1, "replies": []}]}, {"body": "Invested last year bought 10 at 470 best thing i ever did so far.", "score": 5, "replies": []}, {"body": "Preach 🙌", "score": 1, "replies": []}]}, {"body": "190 by feb", "score": 22, "replies": []}, {"body": "BofA deez", "score": 51, "replies": [{"body": "Skank of America", "score": 3, "replies": []}]}, {"body": "I’m just gunna hold till 2042. What will it be in 18 years?", "score": 26, "replies": [{"body": "$100T market cap", "score": 26, "replies": [{"body": "2027 200C gang represent", "score": 9, "replies": []}]}, {"body": "200 after another 10-1 split. I'll own 555,000 shares, but...a new Truck will cost 800K and a starter home will be 6-7M, a nice house will be 20M so...it won't really matter. \n\nIt'll be like 200 a share right now.\n\n  \nLOL....nobody has a clue. AMD or AVGO or hell, even INTL may pass NVDA. Maybe NVDA will be bankrupt. 18 years is probably a bit too far out to project. \n\nI'd go 18 months at a time.", "score": 18, "replies": [{"body": "😂", "score": 3, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Really dude? I don't think you understand what the word facetious means. \n\n  \nI'm genuinely dumbstruck anyone read that post and couldn't just...on it's face see it for how objectively absurd it was trying to match the absurdity of asking what the stock price will be like in 18 years.\n\n  \nBut...cool.", "score": 1, "replies": [{"body": "people get a little touchy on the inflation subject, that’s it", "score": -1, "replies": []}]}, {"body": "It.Was.A.Joke.", "score": -1, "replies": []}]}]}, {"body": "Seeing as the dollar loses more value per year, on top of Nvidia constantly innovating, there's no telling how high it will be in 18 years. That's a ton of compounding interest. By then $1 Trillion will be similar to the new $1 Billion. That is of course unless Nvidia stops innovating, which is highly doubtful. There has never been an end in sight for more powerful processors since the CPU was released.", "score": 3, "replies": []}]}, {"body": "i think this will rally until Q2 25 like last year. We are about to break out of this 5 month sideways trading", "score": 17, "replies": [{"body": "Agree. Hopefully rips until June, starting with hyperscalers reporting CapEx spend next week.", "score": 7, "replies": [{"body": "yeah. If blackwell demand goes through the roof in the next few quarters and guidance etc we can add another 750bn-1 trillion. So PT between 170-200 in 2025", "score": 9, "replies": [{"body": "Demand can't GO through the roof, demand is already through the roof. They have Demand that they cannot meet for at least the next year.\n\nBlackwell demand is already factored in(I hate \"priced in\" as a catch all like they've factored all the Blackwell revenue at 138 a share).\n\nThe question is what will the margins be and how much can TSMC produce...and what can the Japanese and AZ plants produce that'll take some of the load of the main Taiwan plant so they can just focus on Blackwell?\n\nThat and how is NVDA doing in area's other than the Hopper/Blackwell GPU.\n\nBut there is no \"IF\" Blackwell demand goes through the roof \"in the next few quarters,\" it's sold out for the next 4 based on what they can produce and that's a full year out...\n\nAnd there will be plenty of the other 494 companies in the S&P that will be able to borrow more and invest and...Countries and who knows what applications.\n\nBut the takeaway, Blackwell Demand IS there for 12 months at least.", "score": 7, "replies": [{"body": "You hate priced in so you change it to priced factored in 😂", "score": 2, "replies": [{"body": "That's....fair! LOL...I actually meant to say it's factored into the price right now, the Blackwell demand, I'm just SOO sick of people who just flatly say \"Blackwell is already priced in,\" and that's it. They add nothing and think that 200B in Revenue and 140 in Net Revenue is already \"priced in.\"\n\n  \nBlackwell is factored into the price... and I didn't do a good job of articulating any difference at all between each phrase...", "score": 2, "replies": []}]}]}]}]}]}, {"body": "🚀🚀🌙", "score": 8, "replies": []}, {"body": "Hell yeah…is all I have to say. Usually, I have some insights to share but not today.", "score": 8, "replies": [{"body": "DJ!!!", "score": 2, "replies": []}]}, {"body": "I hope this saves my 10/25 140 calls lol", "score": 3, "replies": [{"body": "Praying for u lol", "score": 3, "replies": []}]}, {"body": "So if I am one of the dumb ppl that bought at 139, I should hold the stock rather than panic sell for a loss right?", "score": 3, "replies": []}, {"body": "Yeah, good and buy , and they will dump tomorrow", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Tomorrow", "score": 13, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Targets are typically a year out", "score": 5, "replies": []}]}]}]}, {"body": "usually when some news like that come out, it usually follows by a dump", "score": 6, "replies": [{"body": "My brother in Christ, the hyperscalers are gonna dump some heavy AI CapEx numbers with earnings next week", "score": 14, "replies": [{"body": "Literally lol, now it’s just an earning release train would be dumb to dump lol earliest big dump I foresee is somewhere at the end of Q1 25 or beginning of Q2", "score": 2, "replies": []}, {"body": "CapEx will be nice, and then bears will rain on the parade if there is no clear signs of ROI.", "score": 2, "replies": []}, {"body": "they are sold out, doesnt matter", "score": 1, "replies": [{"body": "Sold out of Blackwell not Hopper", "score": 1, "replies": []}]}]}, {"body": "Bofa bought in late and are trying to pump it", "score": 5, "replies": []}]}, {"body": "Let’s get this to $140 then we can March to the $190. It’s pausing right at $138-39.", "score": 2, "replies": []}, {"body": "Papa J already bought me a retirement home", "score": 2, "replies": [{"body": "But did you buy it tho?", "score": 1, "replies": [{"body": "Paid in full, cash!", "score": 1, "replies": []}]}]}, {"body": "I have 515 shares at $27 cost basis — I guess I’d be a fool to sell based on these projections in the comments", "score": 2, "replies": []}, {"body": "Holy shit", "score": 1, "replies": []}, {"body": "Pushhhhh", "score": 1, "replies": []}, {"body": "Could they in theory split again and make shares $15-$20 and start another buying frenzy down the road?", "score": 1, "replies": [{"body": "No.  Splitting the stock in not typically seen as a bullish maneuver on the part of the company. Splitting the stock often results in a temporary decline in the adjusted price.", "score": 2, "replies": []}]}, {"body": "![gif](giphy|65CJPPk6ENu2Nabgsn|downsized)", "score": 1, "replies": []}, {"body": "yes", "score": 1, "replies": []}, {"body": "Let’s get this to $140 then we can March to the $190. It’s pausing right at $138-39.", "score": 1, "replies": []}, {"body": "okay it’s getting scary", "score": 1, "replies": []}, {"body": "Thoughts on $150 call for 11/22?", "score": 1, "replies": []}, {"body": "So any chance we cross 140 next week?", "score": 1, "replies": [{"body": "Maybe, but I think it's more likely we hover between 130 and 140 until after the elections.  If Harris wins (avoiding a trade war with China and everybody else) we could see a real run up in the 2-3 weeks before earnings.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Widespread tariffs and the resulting trade war would devastate the economy. And that would impact NVDA. They are not immune from rhe macro-economic conditions the world economy is in.", "score": 1, "replies": []}]}]}, {"body": "Today maybe lol", "score": 1, "replies": []}]}, {"body": "Bofa these nuts", "score": 1, "replies": []}, {"body": "Oh my", "score": 0, "replies": []}, {"body": "Bet op was not around for Aug earnings", "score": 0, "replies": [{"body": "Son, I’ve been HODL 60k shares starting @ $2.37 since 2016. Respect your elders.", "score": 7, "replies": [{"body": "Thank you!!", "score": 1, "replies": []}]}]}, {"body": "My god ", "score": -1, "replies": []}]}
{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1g69idr", "created_utc": 1729224035.0, "score": 14, "upvote_ratio": 1.0, "num_comments": 85, "comments": [{"body": "https://preview.redd.it/z1xsfyn75jvd1.png?width=1543&format=png&auto=webp&s=b950bc01e19152781f978f4c491df1390ef5641f\n\nBig call wall at 138, 140 and 145 expiring today. If 138 seems to be a magnet this week, it isn't your imagination.", "score": 8, "replies": [{"body": "People really did sell at 145?  And someone bought it?", "score": 2, "replies": [{"body": "These are the options calls and puts bought by people that are expiring today. That means a lot of speculation that stock price will exceed 138, 140, and 145 end of this week. If there isn't a lot of volume, options sellers (usually market makers) would like to make as many of them worthless as possible. (ie SP < 138).", "score": 3, "replies": []}]}, {"body": "Great post! Where does that leave us for after it expires?", "score": 2, "replies": [{"body": "Next week's expirations show a smaller 140 call wall with a big one at 150, so less resistance at 140 next week. [maximum-pain.com](http://maximum-pain.com) and other max pain sites will show this information for various dates. It changes every day, but usually not too much.\n\nhttps://preview.redd.it/w0oohqi9bjvd1.png?width=1556&format=png&auto=webp&s=8ae5f43a10b8df0320e02b61a6a75d6620663d11", "score": 5, "replies": [{"body": "It’s crazy how well this predicts the Friday close. We closed at 124.70 on 10/4, 134.8 on 10/11 and 137 something today. Maybe next week is 144. Something", "score": 3, "replies": []}]}]}, {"body": "Actually it closed at $137.98", "score": 2, "replies": [{"body": "Shows exactly 138 on google and yahoo. Heaven forbid that they spend 2 cents more than necessary to ensure their profits.", "score": 1, "replies": []}]}, {"body": "u called it, oracle of reddit", "score": 1, "replies": []}]}, {"body": "After extensive supply chain checks, Bank of America estimates that Nvidia will have $200 BILLI in free cash flow over the NEXT TWO YEARS, and called this a generational investment opportunity. Price target with 38% upside at $190. \n\nSounds like a great stock to day trade for 3% profits, eh?", "score": 7, "replies": []}, {"body": "what is the point of buying calls at or near a new ATH exit point if MM will fuck you?", "score": 6, "replies": [{"body": "Exactly - don’t buy calls at ATH wait for a correction", "score": 1, "replies": []}]}, {"body": "10 and 11 days until MSFT, GOOGL, and META earnings. Our spring board? Or spoiled by AI doubters?", "score": 5, "replies": []}, {"body": "7 cents off the ATH, ill take it", "score": 4, "replies": []}, {"body": "Buckle up for another rollercoaster day!", "score": 4, "replies": []}, {"body": "It it holds at 137-138 range I am happy", "score": 5, "replies": []}, {"body": "Praying for my 140c", "score": 4, "replies": []}, {"body": "Anyone think stock will\nPump today?", "score": 4, "replies": [{"body": "don't think so, think we gonna stay in the 130 until earnings, but who knows", "score": 6, "replies": []}, {"body": "I don’t think so", "score": 1, "replies": []}]}, {"body": "Back to 140 today baby! Let's end the week strong!", "score": 6, "replies": [{"body": "hope so, but I feel like it is going back to around 135.", "score": 8, "replies": [{"body": "i hope so, buying at 130-135 and selling around 140 has been making me lots of easy money this week lol", "score": 3, "replies": []}]}]}, {"body": "Let try 140 eow.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "My strategy is find a dip on a 30 day call and grab that. 0dte and even weeklies on opex can and often will absolutely bring you pain.", "score": 2, "replies": []}, {"body": "I had a first hand lesson about anal probing, but it's not from looking at the market.", "score": 0, "replies": []}]}, {"body": "INTEL dropping out of AI Race with NVDA. Less competition for NVDA, very bullish", "score": 2, "replies": [{"body": "Link? ", "score": 1, "replies": []}]}, {"body": "Super low volume today it seems like. What does this mean?", "score": 1, "replies": [{"body": "Early weekend head start", "score": 2, "replies": [{"body": "Yea. I guess everyone not as greedy as me on Friday", "score": 1, "replies": []}]}]}, {"body": "Usually volatile but today we haven’t moved 1%", "score": 1, "replies": []}, {"body": "What platform are you using?", "score": 1, "replies": []}, {"body": "Tried breaking 140 twice recently, and both times came down. Is this the current ceiling?", "score": 1, "replies": [{"body": "clearly, the true question is when is it gonna break through, until then it seems like it'll bounce between 140 and low 130s, i've had quite a lot of success with buying and selling leveraged shares and cfs during this ups and downs this past week. the risk of course, is never knowing exactly when it'll break out of those two supports and leave them behind, which is why i use a mix of leveraged long shares, normal shares and shorting with cfds for insurance and to have even more money to put back into the other two any time there's a decently sized drop.", "score": 4, "replies": [{"body": "Gj", "score": 1, "replies": []}]}]}, {"body": "All I want is for the price to hit at $150 so I can cash out!!", "score": 1, "replies": [{"body": "Yeah right\n\nThen you will say \n\n>All I want is for the price to hit at $160 so I can cash out!!", "score": 3, "replies": []}, {"body": "dumb", "score": 3, "replies": []}, {"body": "I do feel like there is a retail round number like that which will cause a ton of folks to take profits.  Makes total sense for a sizable dip after two days around $150.", "score": 2, "replies": []}]}, {"body": "Good premarket start.   Let's keep it rolling.", "score": 1, "replies": []}, {"body": "Is nvidia still a long term investment, I don’t see growth potential at all. I see most price target is at 150. We already at 137. Should I sell?", "score": -4, "replies": [{"body": "Yes. Sell. GTFO", "score": 10, "replies": []}, {"body": "yes, youve missed the fast gain. Now is the long haul to 6 trillion.", "score": 8, "replies": []}, {"body": "Please help this channel and sell all your 1150 shares\n\nYou're driving people here crazy 🤪", "score": 6, "replies": [{"body": "I will never sell until I make a decent return. This some bullshit. I WILL BE HERE TILL THAT DAY", "score": -7, "replies": [{"body": ">I don’t see growth potential at all.\n\nSo who is this then?\n\nYour Nvda evil twin?", "score": 8, "replies": []}]}]}]}, {"body": "Bro I need to make money. Nvidia is so slow", "score": -6, "replies": [{"body": "Get a job", "score": 6, "replies": [{"body": "I make 200k a year lmao. I just want to make a lot more investing.", "score": -6, "replies": [{"body": "200k a yr fussing over day trading? And dollar fluctuations😂 ok buddy", "score": 4, "replies": []}, {"body": "lol bro NVDA literally up 20 dollar within a month", "score": 3, "replies": []}]}]}, {"body": "No, it is you who was slow", "score": 3, "replies": []}, {"body": "Little upside.  Look elsewhere", "score": 0, "replies": []}]}, {"body": "Is it too late to buy more ive come into a decent amount of money and at the time it was low I only had enough to buy 2k. Now I have enough to get a good amount. Is it too late?", "score": 0, "replies": [{"body": "Depending on how long u plan to invest", "score": 6, "replies": []}]}, {"body": "Lets go NVDA and RDDT. Woo hoo!", "score": 0, "replies": []}, {"body": "Limp", "score": 0, "replies": []}, {"body": "So many good news wen 140?", "score": 0, "replies": [{"body": "Yesterday", "score": 7, "replies": [{"body": "Haha, exactly! We just saw 140 yesterday! And probably again next week!", "score": 1, "replies": [{"body": "All signs show that we will have a Pull Back. Dollar is Up, MACDs cross down.  Its more likely to see 135$ or 130$ that acts as support.", "score": 1, "replies": [{"body": "If it goes down to 130, I will buy more. But my 140 call…haha", "score": 1, "replies": []}]}]}]}]}, {"body": "I have over 160k in this stock so I can’t even invest in other things. I think ima need to sell and move on. Other stocks are popping off, like Netflix, oklo, etc. nvidia might just be slow growth now.", "score": -9, "replies": [{"body": "😂😂😂 Nice troll", "score": 5, "replies": [{"body": "I ain’t trolling lmao.", "score": -6, "replies": []}]}]}, {"body": "Stupid fucking stock can't hold any momentum to save it's life.  Go Up !!  For fucks sake!!", "score": -14, "replies": [{"body": "wtf shut up, you should even be happy if it goes down so u can stock up more before it goes up for real. We all know it's gonna go up and it's not healthy for it to sky rocket.", "score": 5, "replies": [{"body": "I'll be happy when it finally keeps some momentum instead of retreating back every time it kisses $140.  It's not even at it's ATH anymore.  It's fucking shit", "score": -4, "replies": [{"body": "so what lol ? did u buy this week or what, stocks goes up and they go down, its not a straight line where u become a millionaire in a week. If you expected that you shouldve put 20k in DRUG stock earlier this week. you'd be a millionaire.", "score": 3, "replies": [{"body": "How do you find a stock like that?", "score": 2, "replies": []}]}]}]}]}, {"body": "I hold both NVDA & AMD, somehow I am getting vibes that next year will be AMD’s compared to NVDA, slowly AMD will start eating into NVDA AI space , doesn’t matter to me , I will benefit either ways !! Just a thought", "score": -5, "replies": [{"body": "You gave zero explanations why", "score": 4, "replies": []}, {"body": "Wrong", "score": 3, "replies": []}, {"body": "next year? no... in a decade? probably. The power of NVIDIA chips now is performance per watt and amazing portability of AI models between GPU generations", "score": 2, "replies": []}, {"body": "That’s what they said about Best Buy and Radio Shack", "score": 1, "replies": []}]}]}
