{"title": "Is Tesla beating the entire AI industry and left the gas auto industry and gas energy sector in the dust, im i wrong as i dont see how tesla doesnt win the AI RACE.", "selftext": "[removed]", "id": "1g34uc8", "created_utc": 1728868774.0, "score": 0, "upvote_ratio": 0.11, "num_comments": 86, "comments": [{"body": "They are not close to an autonomous vehicle or robot. No one is close at this point. A dancing robot that serve drinks controlled by human is not new.", "score": 70, "replies": [{"body": "The Waymo cars that constantly drive around my area of town seem fairly good (for these common conditions). I drive around them multiples times every day and I’ve never once seen them screw up. You wouldn’t even think they were driving themselves.", "score": 1, "replies": [{"body": "There’s a lot of limitations on Waymo. It doesnt work outside of mapped area.", "score": 1, "replies": []}]}, {"body": "Eventually.. all the FSD tech will be uploaded to the robot to be a chauffeur ..its only a matter of time.", "score": -3, "replies": [{"body": "Eventually.... coming next year", "score": 7, "replies": [{"body": "They need a huge return on investment for their self driving cars first. Until then they're not going to sell a robot that makes their cars obsolete.", "score": 0, "replies": []}]}, {"body": "Time is not now like he made it out to be. I agree that might be the future.", "score": 1, "replies": [{"body": "When did he ever mention on robot FSD?", "score": 1, "replies": [{"body": "The robot is your fsd.  Tesla is not trying to be a car manufacturer.", "score": 1, "replies": [{"body": "..and your trying to make coherent sense ..but your failing at it.", "score": 0, "replies": []}]}]}]}]}, {"body": "> They are not close to an autonomous vehicle\n\nNot close is a stretch. You can get in a Tesla, enter a location and 99.9 times out of 100 you'll get there without any interaction other than confirming to it that you're there and paying attention.", "score": -16, "replies": [{"body": "That is false. \n\nFSD makes terrible decisions - still. And the latest update has had several people documenting critics safety interventions.", "score": 12, "replies": []}, {"body": "I had FSD on my Tesla as part of the free one month trial a little while back. I turned it on just 4 times, each time for a ~15 minute or so drive on surface roads.\n\nIt was impressive at first. But also high anxiety-inducing the entire time. I suppose that’s expected when giving up control like that. \n\nBut, my 4th and final trip with it activated, the car couldn’t decide which lane it needed to be in and slowed to a crawl while wobbling back and forth between the lanes. It may have figured it out and gotten me to my destination eventually, but there are other cars on the road and I didn’t want to block 2 lanes like a p-bag, so I took over.\n\nOverall, meh. But I think it’ll get there. Eventually.", "score": 3, "replies": []}, {"body": "Get back to me when FSD stops taking freeway exits at 80 mph", "score": 2, "replies": []}, {"body": "Do you have any proof for your claim? Just curious", "score": -3, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "I have zero idea if those figures are true or false, but even going off those - a car being able to drive 175 miles, navigation complex city streets with thosuands if not tens of thousands of other vehicles is clearly CLOSE to being fully autonomous. \n\nNo one is claiming the nut has been cracked, but it's hardly just an idea in a lab.", "score": -5, "replies": [{"body": "Pareto principle. It is the last part, the edge cases that drives up complexity.\n\nSo if you have 10,000 Tsla robotaxis each doing 50 miles per day, you need 3000 interventions per day. That's nowhere near scalable for autonomous driving.", "score": 6, "replies": []}]}]}, {"body": "I own a Tesla with full self driving? I've never personally had to intervene.", "score": -5, "replies": [{"body": "Because you have no proof", "score": 1, "replies": [{"body": "Proof of what? It's in millions of cars? What are you looking for?", "score": 0, "replies": [{"body": "Statistically speaking, 99.9 of 100 times can get to the location without intervention", "score": 1, "replies": [{"body": "It was clearly a rounded generalization. I'm going to assume they don't release that information. They do release that the numbers in terms of crashes are lower when using it. \n\nIt was a response to the person saying they were \"not close to an autonomous vehicle\" which is absolute nonsense as I use their autonomy in my car near daily and have never had an issue. \n\nI'm not saying it is without any kind of issue, but it's clearly much closer than it simply being a talking point.", "score": 1, "replies": [{"body": "Tesla is L2, full autonomous is L4. This is “not close “ refer to", "score": -1, "replies": [{"body": "What does it not do that you expect it to do?", "score": 1, "replies": [{"body": "Can you sit on backseat to watch TV and let FSD drive?", "score": 1, "replies": [{"body": "You know I already covered this in my initial comment, right? \n\nWould disabling the safety input make it closer? The car would still be doing the same automatic driving?", "score": 1, "replies": [{"body": "The fact you need confirm you are there and paying attention means it’s far away from fully autonomous", "score": 0, "replies": [{"body": "The confirmation you're there is a safety feature - it holds no bearing on the ability of the car. \n\nAnd agian nobody said it was fully autonomous. The claim was that it is \"not close\"\n\nClearly if you can get in a vehicle, enter an address and the vehicle take you there, it's CLOSE. \n\nIt's not even an argument, it's absolutely obvious. If it could drive 5 meters in a straight line, yeah that's not very close. Right now as we stand I can get into my car, enter an address and the vehicle will drive me there.\n\nThat's pretty fucking close.", "score": 2, "replies": [{"body": "Then your “close” is different from others’ “close”. For most people,robocab is autonomous means", "score": 1, "replies": [{"body": "You seem to be confusing close with complete.", "score": 2, "replies": [{"body": "For someone,70/100 is close, for others 99/100 is close", "score": 0, "replies": [{"body": "Everything you have described has been 'complete.'", "score": 2, "replies": [{"body": "Might be it’s “complete” for you", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Be able to drive without intervention, safely, without supervision, in all conditions. \n\nLike they promised.", "score": 1, "replies": [{"body": "Right, but nobody is claiming it to be that. It's close to that. It currently drives you there but youhave to supervise 'just incase.'", "score": 1, "replies": [{"body": "It’s not close to that. Be honest. \n\nAnd we are absolutely not supervising “just in case”, we’re supervising because FSD is still suicidal.\n\nTesla AI still doesn’t have functional windshield wipers.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I own a Tesla and have had to intervene multiple times albeit not a lot.  To one of the earlier points, despite 99% sounding great, it’s not in this situation.\n\nI’ve found in find on portions of certain trips such as navigating on a highway and getting off of an exit as long as the weather was great.  Mine has had issues when their maps aren’t updated, tolls, construction zones, or night / weather complications.  This is highway feedback.   For city/urban, I stopped using it a year ago because intervention was rather significant.  \n\nTesla is way behind Waymo.  They also have no clear plan, or at least haven’t communicated a clear plan, on why or how they would catch up with waymo let alone pass them.", "score": 1, "replies": []}]}]}]}, {"body": "which company is planning mass production to sell bots that serve drinks to mass usa consumer?", "score": -22, "replies": [{"body": "Either is Tesla. Those were remote controlled machines. They weren’t AI at all. \n\nRobot bartenders like envisioned would be dumb. They can make automated drink machines with existing technology. There’s no need to create a super expensive humanoid robot version.", "score": 11, "replies": [{"body": "It was basically an rc car with extra steps", "score": 3, "replies": []}]}, {"body": "You know what, man, you're right. Eat it all up. Elon is a visionary and he is definitely not pulling the wool over anyone's eyes and you should just continue to dump alllll your money right into that stock without diversifying or mitigating risk at all.\n\nWe don't know anything about AI for sure other than it's definitely gonna be an Elon company.", "score": 14, "replies": []}, {"body": "Any company that produces those automatic espresso machines that you see at gas stations.", "score": 3, "replies": []}]}]}, {"body": "Tesla does not have working FSD - where did you see that?\n\nAll of their Optimus Bots were remote controlled. \n\nThey have yet to demonstrate anything other than fancy PoC tech demos.", "score": 16, "replies": [{"body": "yes i mentioned that, it is a remote controlled job multiplier and you can build or labor from home while your bot works in extreme heat or cold under remote control.\n\nyou could still control a massive fleet of teslabot labor \n\nbut its conjecture as no one has released if bots where ai or programmed or remote controlled.", "score": -18, "replies": [{"body": "They have been confirmed as remote controlled. \n\nTesla does not have a moat or any tech advantage on their robots vs other competitors. There are better robots that could be controlled out there. Let’s see a Tesla robot survive those kicks that Boston Dynamics gives their robots.", "score": 9, "replies": [{"body": "You can already see the target customer of the robots. Tesla's as a maid in the home a bot to serve people. Boston Dynamics is to serve the military and do jobs in hazardous environments.", "score": 1, "replies": [{"body": "Yeah, sure, right. These bots couldn’t identify or pickup a paper towel off the floor, even with a human driver.", "score": 3, "replies": []}]}]}, {"body": "Until one falls over and knocks the next one over and the next…", "score": 1, "replies": []}]}]}, {"body": "Elon’s little show was smoke and mirrors. None of what he showed is going to bring in any revenue anytime soon.\nTesla is not competition for Microsoft or Palantir.", "score": 18, "replies": [{"body": "YES it is THE UNREAL ENGINE 5 SIMULATION WILL TRAIN TESLABOT FOR LABOR.\n\nUNDER THIS SIMULATED JOB in the goal of EFFICIENCY and improved Performance, the ai  can suggest ways to improve the job environment or processes to speed up production or cut costs while increasing efficiency and productivity.\n\nTHE SIMULATION can even run construction simulation to find the safest fastest way to achieve a resilt with every capability of a teslabot working over 19 hours a day.\n\nsameway the DOJO trains FSD it can Train JOBS SKILLS INTO TESLABOTS or TRAIN TESLABOTS TO EDUCATE OTHERS like teachers or nurses or doctors.\n\nANY JOB A HUMAN CAN DO SO CAN A TESLABOT AND NOT COMPLAIN OF OVERTIME OR TESLABOTS WONT GET DISORGANIZED AND WONT COMPETE WITH OTHER TESLABOTS.\n\nPalantir and microsoft data collection isnt bigger than the data EVERY SINGLE TESLA EV CAR CAN COLLECT AND RECOGNIZE AND LABEL.\n\nTESLA CARS CAN RECORD CRIMES, SOON THEY CAN REPORT CRIMES TOO.\n\nIf teslabot secretary or assistance is going to serve you its master the best way possible IT MUST PREDICT YOUR BEHAVIOR NEEDS AND DESIRES TO ACHIEVE ITS BEST POTENTIAL ASSISTANCE. (bet this will include neuralink and teslabot will be able to predict your behavior and the way you think before you can think of it)\n\nwhich means teslabot can replace you by mimicking every behavior you can do.\n\nfsd has to predict other driver’s intentions more than yours as it is driving.", "score": 0, "replies": []}]}, {"body": "SpaceX seems to be the focus of Musk's efforts. Tesla is quickly turning in a hot garbage fire. Since this is on AI, I'm not even going to get into the poor quality of Tesla cars and how easily you can go bust in the car manufacturing business.\n\nTesla Robots are not automated but controlled by humans. The Toyota car manufacturing claw is more automated than the Tesla bots. Boston dynamics had automated robots a decade before this.\n\nFSD. It's not full self driving. Waymo is way ahead of Tesla despite starting after Tesla. Even Mercedes' new self-driving is more capable than Tesla's. \n\nAI race isn't won by implementers of AI just like a gold rush isn't won by the diggers. It's won by the shovel sellers so Nvidia, TSM are in better position to capitalize on the AI gold rush hype.", "score": 17, "replies": [{"body": "CYBERTRUCK IS spacex MARS ROVER because mars has ball istic razor sharp silica sandstorms.\n\nthe ceramic transparent metal glass of cybertruck is designed to be ball istic resistant like the thicker portholes of the starship.\n\nthe steel of cybertruck and robocab and likely robovan also likely having structural exoskeleton ALL ARE MADE OF THE SAME STEEL AS STARLINK AND SPACE X STARSHIP\n\nSPACEX ALREADY HAS AI NAVIGATION FOR REACHING exosphere and To REENTRY AND LANDING BOOSTERS WITH AI.\n\nSTARLINK SATELLITES BY THE THOUSANDS REQUIRE AI to keep their flight path and not fall into earths orbit they must use batteries and solar power to navigate around earth outer most atmosphere \n\nTHE PURPOSE OF TESLA AI AND AUTOMATION IS MARS COLONY as humans cannot survive mars environment for long in spacesuits under hazardous conditions and razor sharps dust and sands being common everywhere with rust and other rare metals in less minimal percentages on surface of mars.", "score": 1, "replies": [{"body": "Space X starships are made of cast aluminum?", "score": 1, "replies": [{"body": "2 days ago · The launch tower’s monstrous metal arms, dubbed chopsticks, caught the descending 232-foot (71-meter) stainless steel booster \n\nElon Musk has opened up about a big design change to SpaceX's interplanetary spaceship. The billionaire entrepreneur announced earlier this month that Starship — the vehicle SpaceX is developing to take people to and from Mars and other distant destinations — will be made of stainless steel rather than carbon fiber, as originally planned. In a recent interview with Popular Mechanics, Musk explained what motivated the switch. Expense was one factor. Carbon fiber costs $135 per kilogram, and 35 percent of the stuff must be scrapped — \"you cut the fabric, and some of it you can't use,\" the SpaceX founder and CEO said. So the true cost of the material is nearly $200 per kg, compared to just $3 for stainless steel, he added\n\nStainless steel's high melting point is also a big advantage, Musk told Popular Mechanics Editor-in-Chief Ryan D'Agostino.  \"So, typically aluminum or carbon fiber, for a steady-state operating temperature, you're really limited to about 300 degrees Fahrenheit \\[150 degrees Celsius\\]. It's not that high,\" Musk said. \"You can take little, brief excursions above that, maybe 350 \\[degrees F, or 180 degrees C\\]. Four-hundred \\[degrees F, or 200 degrees C\\], you're really pushing it. It weakens. And there are some carbon fibers that can take 400 degrees Fahrenheit, but then you have strength knockdowns. But steel, you can do 1,500, \\[or\\] 1,600 degrees Fahrenheit \\[820 to 870 degrees C\\].\"  Musk also detailed SpaceX's plans for Starship's innovative heat-shield system, which will employ transpiration cooling.  \"You just need, essentially, two \\[stainless-steel\\] layers that are joined with stringers. You flow either fuel or water in between the sandwich layer, and then you have micro-perforations on the outside — very tiny perforations — and you essentially bleed water, or you could bleed fuel, through the micro-perforations on the outside,\" Musk told D'Agostino. \"To the best of my knowledge, this has never been proposed before.\"", "score": 1, "replies": []}]}]}]}, {"body": "How do you feel about capitalization?", "score": 6, "replies": []}, {"body": "The full self-driving with only a camera approach is a mistake.", "score": 14, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "My Tesla dumps 50 million warnings that the cameras are blocked the second it starts drizzling and throws the windshield wipers on when there’s too much sun. \n\nThe self driving stuff is amazing, but I wouldn’t sit in the back and trust it to drive me to the end of the neighborhood let alone across town.", "score": 7, "replies": []}, {"body": "Can’t be the initial phase, since they’ve promised all cars since ~2017 have all of the hardware needed for FSD.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I agree, this does seem possible.", "score": 1, "replies": []}]}]}]}, {"body": "Its a test bed so the robot can self drive...  I see Musk's bigger picture.", "score": -1, "replies": []}, {"body": "isnt spacex only navigating by visual ai, that is elon and his ai experts team doing that to right.\n\neven the starship pod navigation was ai the pilot only took over for docking, Right\n\nif tesla is using same steel and resources as starlink and spacex then he is probably sharing ai tech amongst them.\n\neven cybertruck might be the future mars rover, to survive the razor b4llistic sand silica storms.", "score": -5, "replies": [{"body": "Are you talking about tesla or Elon companies as a whole", "score": 3, "replies": []}]}]}, {"body": "Priced in, Tesla is valued more than all major automakers, ride share and taxi platforms combined and then some including energy utilities.", "score": 5, "replies": []}, {"body": "Because Elon can’t execute. He can’t deliver.", "score": 3, "replies": []}, {"body": "Tesla is a leader in AI for autonomous driving but hasn’t \"beaten\" the entire AI industry. Companies like Google (DeepMind), OpenAI, and Nvidia dominate broader AI research, cloud AI, and chipmaking. \n\nTesla's focus is on self-driving cars, not the broader AI landscape like machine learning, natural language processing, or AI hardware at scale.\n\nAs for the gas auto and energy sectors, Tesla has revolutionized EVs, but gas-powered vehicles still make up around 80% of global car sales, and fossil fuels account for nearly 80% of global energy production (IEA 2023). \n\nWhile Tesla has made significant strides, it's far from leaving these sectors \"in the dust.\"\n\nWhen cars were first invented in the late 19th and early 20th centuries, there were hundreds of gas-powered car manufacturers, many small and regional. \n\nMost of these companies either went bankrupt or were acquired, largely due to their inability to scale production and compete on cost. \n\nFord, initially an unlikely winner, succeeded by introducing mass production through the assembly line in 1913, which dramatically lowered costs and increased output, making the Model T affordable and dominant. \n\nThis led to Ford’s dominance while other manufacturers either merged (like General Motors) or failed.\n\nToday’s EV market shows similarities. Tesla is a frontrunner, but there are dozens of EV startups and established automakers entering the space. However, most struggle with profitability and scaling production. \n\nNotably, Elon Musk himself has admitted that Tesla faces challenges in scaling production efficiently, particularly with complex innovations like the Cybertruck and Model Y . \n\nThe EV makers will eventually consolidate, with only a few EV makers achieving long-term dominance.\n\nTesla isn't showing that it has what it takes to win. It's showing that it was a great pioneer who is falling behind.", "score": 3, "replies": []}, {"body": "I feel you have a narrow field of view of what the \"AI industry\" is.", "score": 3, "replies": [{"body": "as its been studied most LARGE LANGUAGE MODELs AI‘s have only MATHEMATICAL REASONING CAPABILITY.\n\nTHEY HAVE NO ACTUAL HUMAN COMPARATIVE REASONING, most AI ARE JUST PATTERN RECOGNITION.\n\nTESLA AI OR X AI is intentionally teaching the FSD TO THINK LIKE THE DRIVER OR TESLABOT TO THINK LIKE THE HUMAN so they can do the same actions and reactions AND THEY MUST BOTH PREDICT HUMAN BEHAVIOR TO ENSURE HUMAN SAFETY. \n\nthey must try to do their job as they where ordered while predicting the best way to do it to keep humans around safer.\n\nfsd must predict the potential next 10 steps or behaviors you make to avoid a accident by the limited reaction time of humans so tesla fsd and teslabots must react faster than humans to avoid injuring anyone.\n\nnot saying mathematical pattern recognition cant eventually learn to reason but its currently not, its largely just trained programmed ai.", "score": 1, "replies": [{"body": "Rational peoples language online ..is to not shout via caps. Do you have human comparative reasoning?", "score": 1, "replies": []}]}]}, {"body": "The Optimus Bots are fucking Waldos, which have been around for 80 years", "score": 3, "replies": []}, {"body": "Wake up.  You have been Musked.", "score": 3, "replies": [{"body": "NAH with neuralink We USA can copy elons brain and thought processes, get rid of all the hate keep the engineering and still have innovative tesla WITHOUT ELONS TOXICITY AND CENSORSHIP", "score": -1, "replies": []}]}, {"body": "TESLA STOCK IS CRASHING", "score": 3, "replies": []}, {"body": "So this what drinking Elon’s kool aid looks like.  Seems quite effective indeed.", "score": 3, "replies": [{"body": "no TESLA NO LONGER NEES ELON\n\nDOJO can simulate all elons engineering and reverse engineer all the innovative ways and processes elon uses to create anything.\n\ntesla doesnt need elon actually TESLA BENEFITS WITHOUT ELON democrats green energy and zero carbon emissions goals GREATLY BENEFIT TO GET RID OF ELON\n\neasiest way is let republicans DEPORT ELON as he is illegal immigrant and a dr-ug user which bans you from us citizenship as he is born from african apartheid to canadian nationals", "score": 0, "replies": []}]}, {"body": "We have robovans in Oslo today, just it’s not Tesla. Driving people from A to B. Unmanned. It’s a preprogrammed route and it just goes back and forth", "score": 2, "replies": [{"body": "thanks ill look more into it", "score": 1, "replies": []}]}, {"body": ">on teslabot in remote controlled scenarios, it can allow one human to do the work of hundreds.\n\nLol there will be wars and rebellion when people will loose their jobs for robots...\n\nBut it will never happen to have AI vehicles etc. It would mean it must be totally bug free, for safety reason. And nothing is ever bug free in complex programming. And I don't even mention hacking here.\n\nAI is a big bubble that will explode. You can't use AI for stuff where you imagine it being in complete charge. It can be used on very specific things supervised by humans, like medical, etc. But letting AI drives people ? You must not be familiar with AI... Even the chatbots can't give you a good amount of correct answers and you ask for AI driven cars ? Never I would enter in a AI vehicle cause AI don't exist. AI is just a name for a sort of programming.", "score": 1, "replies": [{"body": "NO AGAIN YOU BUY THE TESLABOT\n\nAND I BET SOME COMPANIES WILL LEND TESLABOT TO PEOPLE FOR A COMMISSION OF THE WAGES THEIR RENTED TESLABOTS GET PAID FOR REPLACING THEM IN THE WORKPLACE.\n\nI MAGINE YOU OWN A ORCHARD AND CAN PICK EVERY ORANGE FROM A TREE WITH ONE PERSON AND HUNDREDS OF TESLABOTS. and you can do the work from home or a office.\n\nSMALLER one cop can patrol NEIGHBORHOODS with a fleet of teslabots sending anything recognized as suspicious out of normal previous rounds. that one cop could validate the crime or aid a neighbor climbing a tree to get a cat, she says thank you “SHE NEVER DOES THIS she has not ever just ran out the house before”, you can control at that moment four or five teslabot to clear the house to make sure the cat wasn’t afraid of a trespasser. \n\nbigger lawncare every Wednesday tesla bot fleets descends upon your neighbor hood and all cut the cookie cutter lawns in the identical pattern one human in control can order hundreds of teslabot to cut the lawn at same speed in same direction.\n\nin assembly is huge 1 employee can control thousands to build the same components at the same speeds and sametime.\n\nAGAIN A REMOTE CONTROLLED TESLABOT IS A WORKER MULTIPLIER \n\nyour issue of replacing the human only happens is if YOU ARE NOT ALLOWED TO OWN A TESLABOT.\n\nI INTENT TO OWN THOUSANDS OF TESLABOTS TO COUNTER REPUBLICANS HOSTILITY TOWARD LGBTQ BY OFFERING PAYMENT PLANS FOR OWNERSHIP OF TESLABOTS TO LGBTQ INDIVIDUALS TO REPLACE THEM IN THE WORKPLACE WITH TESLABOTS THEY TRAIN TO DO THE JOB THEY ARE SKILLED TO DO. THEY GET THE COMMISSION OF THEIR TESLABOTS AND I GET A SMALL CUT FOR FACILITATING PURCHASING TO OWNERSHIPS.\n\nI INTENT TO SUPPORT LGBTQ EMPLOYMENT AND LGBTQ CREATIVITY.\n\nI LIVE BY THE IDEAL WORK SMARTER NOT HARDER.", "score": 0, "replies": [{"body": "COME BACK IN REALITY.", "score": 1, "replies": []}]}]}, {"body": "Waymo and Zoox have similar products, and if I’m not mistaken both are on the road already. Teslas new products are not new. I think there are some big regulatory issues being the reason waymo/zoox aren’t bigger right now, of which Tesla is not exempt.", "score": 1, "replies": [{"body": "no, their issue is that they are expensive and cost alot to maintain and even have remote driving assistance\n\nthey just arent profitable enough for mass production, if they could make it cheaper and mass production that would be great i bet it be cheaper to build them than all ice auto industry being forced into ev industry.\n\nev industry doesnt have to be the sole end of oil, we just need to achieve ZERO Carbon Emissions, oil/auto industry can still exist if we can eliminate emissions from combustion engines.", "score": 2, "replies": []}]}, {"body": "For a long time I wrote them off as too expensive considering the fact that at the time they were only a car company.  Now there is a case for undervaluation.  The thing is it’s still high risk.  But definitely a bright future", "score": -1, "replies": [{"body": "I think Tesla has a stong future ..just not for a year or three.. For now, my money goes elsewhere.", "score": 3, "replies": [{"body": "a year or three? 😭 you pull that out of your ass?", "score": 0, "replies": [{"body": "\\[sniffing my past comment\\] ..nah, not out of my ass ..because it doesn't smell like you.", "score": 1, "replies": []}]}]}]}]}
