{"title": "Apple - Regardless of this Quarter; Now is the time", "selftext": "Based on recent market activity I think this is a good entry point for Apple off the lows.\n\nHere are all the reasons why not to like Apple right now\n\n* Fall in phone sales especially in China\n* They have been absolutely sideways for the past 12 months and down \\~9% for the year.\n* Things are going to look bad for this quarter that's a given.\n* Apple Vision is not selling well (give that thing a controller and games my god)\n* Regulators are breathing down their neck (I do feel some of it is justified regardless of what Cramer says)\n* It's been absent in this AI bonanza - probably their worst offense\n\nHowever, with all of that said there is one thing that Apple has in its perpetual back pocket.\n\nInstall Base & Great Product recognition\n\nBefore I get into 2 companies that Apple will absolutely trounce, I want to talk about a prediction that is coming for their upcoming June developer conference.\n\nApple will 1000% announce their AI strategy. It is a foregone conclusion they will do this and in a meaningful way. If they don't do this it would be corporate malfeasance and Tim Cook should resign immediately. But why?\n\nAI is something that YOU MUST get out the door and have people using it. It's not web search where you can make a deal with Google to use their AI offering. And BTW if you think that deal is going to happen with Google it 1000% is not. Apple would insane to do that. You have get your models up, trained and running. If you don't they can never improve. They can't get more training data. And, Apple is already reporting that they have models that are performing well.\n\n~~To pay Google or anyone for Models when Meta is just releasing models for free right now is a non-starter. Apple will make their own AI models.~~\n\nApparently not. Apple is now talking to OpenAI too. So Apple using Microsoft. lol hmmm. Interesting.\n\n[https://www.bloomberg.com/news/articles/2024-04-26/apple-intensifies-talks-with-openai-for-iphone-generative-ai-features?embedded-checkout=true](https://www.bloomberg.com/news/articles/2024-04-26/apple-intensifies-talks-with-openai-for-iphone-generative-ai-features?embedded-checkout=true)\n\nThe fact that Apple isn't even look to compete with their own models is just wild to me. \n\nAs much as I wish Microsoft and or OpenAI would do a hardware device (regarding AI), Apple has the install base to do something meaningful and in a big way with consumers. Literally, this can be another vertical for Apple.\n\nOther hardware, such as \"The PIN\" and \"the Rabbit\" are horrible devices. The Rabbit is OK but it is beyond obvious that your phone is going to be able to do what those devices do shortly. Literally, all Apple has to do is look at anything worthwhile on those devices, what's not worthwhile on them and come out with a future Iphone that does all that and more. It will be like taking candy from a baby.\n\nEdge AI, in my opinion is going to be a great game changer and very practical use case for what profitable AI will look like. Whether it's a Robot or your HER / hand-held device edge AI is where this all goes.\n\nSamsung has already begun AI on the phone and I don't really use it because of 1 reason. It's not a great foundational model like OpenAI's ChatGPT or anything good that is native on the phone. And this is the beautiful thing about Apple. If Apple can just be good enough with their AI models - They're opportunity is different than any other player in the mobile space. They can put a model that they make directly on the phone. True Edge AI. Nobody else has the opportunity to do that in the way Apple does. This will make the AI faster, more responsive, great computer vision, audio capabilities will all be native on the phone.\n\nAll for $20 / $30 a month that Apple sheep will be happy to pay for.\n\nLook for Apple to begin that story this June.\n\nMy position: Currently I have 1 share but I think now is the time.", "id": "1ce31se", "created_utc": 1714183249.0, "score": 48, "upvote_ratio": 0.69, "num_comments": 111, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 2241 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "This mfer said 1 share, I should bonk you but I agree AAPL go BRRR", "score": 154, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don't buy sideways stocks - albeit Nvidia has given me heart attacks lately", "score": 12, "replies": [{"body": "Hate to break it to you but AAPL has been trading sideways for almost two years now", "score": 11, "replies": [{"body": "you're not breaking it to me if I am making the point", "score": 11, "replies": [{"body": "OP he meant he wants to break bread with you, he’s a regard excuse his French.", "score": 6, "replies": [{"body": "French bread my favorite", "score": 4, "replies": []}]}, {"body": "I'm not sure if you know this, but AAPL has been trading sideways for almost 2 years now", "score": 3, "replies": []}, {"body": "Oh I’ll break it to you alright", "score": 0, "replies": []}]}]}]}]}, {"body": "I have more than 1 share now :)", "score": 1, "replies": []}]}, {"body": "Lmao wrote an essay for 1 share", "score": 99, "replies": [{"body": "TL:DR eat apples", "score": 8, "replies": []}, {"body": "I remember the days when poor person posting was against the rules.", "score": 6, "replies": []}, {"body": "I wrote it so you could come here and make this comment lol. Jk. I am thinking that this may be the time apple rebounds but I am not so sure.", "score": 0, "replies": []}]}, {"body": "1 share ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|31225)", "score": 26, "replies": []}, {"body": "I mean, I understand not having enough money to feel comfortable making a big option play, but one share is pretty much nothing. Change it to AAPU at least...", "score": 21, "replies": []}, {"body": "Your 1 share doesn’t show much confidence and I’m also not confident the Vision Pro disaster is done burning money on the books. \n\nTBH this year I’ve also seen more people without iPhones than any other year in recent memory.", "score": 30, "replies": [{"body": "All I see are iPhones🤷🏼‍♂️", "score": 15, "replies": [{"body": "All I see are old iPhones that people don’t upgrade every year 🤷‍♂️", "score": 4, "replies": [{"body": "That’s facts I still got the 11😂", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Almost everyone I know has an iPhone 15.  Would also love a dip back to $125 but we just had that recently…", "score": 0, "replies": []}]}]}, {"body": "They moved out of burning money on an EV that never came. This show pony 🐎 will be next, and some of the experience could be actually go into the phone tech.", "score": 5, "replies": []}, {"body": "We switched to Android 10 years ago.", "score": 3, "replies": []}, {"body": "totally agree. They're by no means dead or anything. Also, this thing has been sideways as hell and I said as much. Why would anyone have any money in there other than WB? The point of the post is that yes that's all bad news but soon Apple come hard with AI. just a theory.", "score": 0, "replies": []}]}, {"body": "One bastard share. GTFOH.", "score": 13, "replies": []}, {"body": "You really don’t know much about Apple. I’ve been following them for over thirty years. They will definitely NOT announce their AI strategy because they never announce their strategy. The most they ever do is say there’s something interesting in a space and they’re looking into it. Then a few things may leak, like the Vision Pro project out the apple car project. \n\nApple is the most valuable company in the world. It doesn’t need to justify its future plans with anyone, at least not now. They the writing on the wall about China years before you did. They knew the Vision Pro was going to be an overhyped stepping stone into future technologies that wouldn’t pay dividends for many years. I’m not saying they’ve got it figured out, because they obviously don’t. But they aren’t worried about the things you’re worried about. They aren’t seeing Nvidia as a direct competitor or competition to beat because see themselves in a whole other space that just happens to overlap in a few places.\n\nThat being said, I think Apple has a LOT it needs to improve on. Siri hasn’t evolved in a decade, Vision Pro strategy needs to rethought, Apple car project was a major flop, iPhone updates have been lackluster for years, the Mac space was a huge jump in 2020 but needs improvement now (especially with base configs, there’s an article how that hasn’t improved at all since TC took over), and much more.\n\nTim Cook is an amazing operations executive, but not a visionary. So I think that, plus the fact that Apple makes nearly all their decisions in the small bubble of a world that is Silicon Valley thinking, is affecting their products and trajectory.\n\nIf Apple was mainly concerned about stock price, they would care to talk more about their AI strategy or make splashy announcements. But like I said, that’s not their style. They could destroy the markets in Monday if they announced they were focusing on building chips for AI based on what they’ve learned making chips for iPhones and Macs, but they won’t do that even if they were doing exactly that. \n\nTLDR; Apple is Apple and doesn’t care what you think or anyone thinks about their stock price. They don’t make announcements reflecting that.", "score": 12, "replies": [{"body": "This guy has at least…2 shares.", "score": 14, "replies": []}, {"body": "The problem is that apple isn't apple anymore. No innovations for a long time - except for the silicon which was a great strategic move it looks like. Every year a better cam - and that's about it seriously.", "score": 2, "replies": []}, {"body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Never bet against Tim apple", "score": 21, "replies": [{"body": "I would if I had any money left, this is the next \" meta earnings\".", "score": 3, "replies": []}]}, {"body": "Just like Tesla apples doesn’t need good earnings just need some AI bs talk , Apple subscription eco growing , maybe some Apple vr news", "score": 9, "replies": []}, {"body": "1 share like wtf? Why even spend time like this on the stock for 1 share", "score": 9, "replies": [{"body": "Kids these days. He's probably in high school 🏫🎒, quite a few parents let an underage gain experience in some secondary  account with a discount broker. This is about learning and confidence, he has an investment thesis which hardly any of the regarded gamblers on WSB bother to develop. I wish him luck (and myself, bought AAPL recently based on seasonality and limited downside)!", "score": 7, "replies": [{"body": "Lets hope the broker doesn't eat too much on each trade", "score": 1, "replies": []}]}]}, {"body": "I got apple puts this earnings", "score": 6, "replies": []}, {"body": "I’ve just been buying more shares over the last 6 months, currently have 90 shares. Apple isn’t going anywhere", "score": 4, "replies": []}, {"body": "Apple is never FIRST to market, they are the BEST to market.", "score": 3, "replies": [{"body": "Do you use Google Maps or Apple Maps. All I'm saying is, that's not always true.", "score": 1, "replies": []}]}, {"body": "Aged well OP! ![img](emote|t5_2th52|4258)", "score": 3, "replies": []}, {"body": "Congrats OP we did it", "score": 3, "replies": []}, {"body": "lol 1 share DD.  This is the beginning of Apples decline. Meta , msft and even google will run circles.  Services company > product company in this day and age.", "score": 5, "replies": []}, {"body": "I thought google was gona work with google and implement gimini , what happened to that?", "score": 2, "replies": []}, {"body": "I fcking bought a strangle", "score": 2, "replies": []}, {"body": "Apple will shed and mid caps will expand in the next quarter resulting in no gain for spy; theta will win", "score": 2, "replies": []}, {"body": "Time to sell it looks like", "score": 2, "replies": []}, {"body": "And their car they've spent awhile on too now scrapped. What is their next big thing? I agree fully with AI, it is embarrassing for them to be in this position. And their next event is on iPads lmao.", "score": 2, "replies": []}, {"body": "So what it is gonna do on earnings? Bad earnings coming?", "score": 2, "replies": [{"body": "i don't see how it's good but they've been sideways to down over years. something's gotta give. it's like Intel but more potential. I don't know.", "score": 1, "replies": [{"body": "So probably nothing good for calls", "score": 2, "replies": []}]}]}, {"body": "before you buy you should be aware of it's biggest investors selling at the top($190 last year), Cook and other from management selling recently, slow down in China ( biggest market), Huawei competition, cancelling the high end Apple car,lawsuits and others, I will be dumping everything I've got just before the earnings.", "score": 2, "replies": [{"body": "they can still compete on the AI front but it won't be compelling if they're going to Google and OpenAI begging for models. My entire thesis may be off.", "score": 1, "replies": [{"body": "yes they can,and so do others, my point is that I'm not sure about this upcoming earnings but for the future they should be doing ok, I don't see it as a growth stock anymore, it's been limping for some while now and I think it's going to come down to 140s -150s.", "score": 2, "replies": [{"body": "you may be right - really depends on the integration with open AI if OpenAI allows models natively onto IOS devices they still can execute that well. That's all I need to hear. and btw this important for a lot companies. OpenAI has to let models exist at the edge it's critical they do that because if you say, for example, I want to control the OS with the model that has to be a native abstraction. If they allow apple to do that with a license. Then it's game on because apple has the best hardware. Figure AI is in the same boat. Do I get a custom specialized model for on the edge. And anyone else with a great hardware idea. \n\n  \nWe'll see.", "score": 2, "replies": [{"body": "Remember, الفقراء هم دائما الخاسرين.", "score": 1, "replies": []}]}]}]}]}, {"body": "Honestly I love how it doesn’t matter whether AI is useful or an improvement to the product its just there so boomer investors think its modern and with the time…", "score": 2, "replies": [{"body": "Typical.\tGet off my lawn, young blood.", "score": 1, "replies": []}, {"body": "This in and of itself sounds like a boomer comment. Do you realize how tech works. Throw spaghetti against the wall and see what sticks", "score": 1, "replies": [{"body": "They have a point. Most people don’t even know how to use Siri. People using chatGPT think it’s cool but most don’t even know HOW to take advantage of it. \n\nI don’t think any AI announcement will make it appeal to the users. This is for shareholders and to stay relevant. IMO", "score": 1, "replies": []}]}]}, {"body": "I’m going to load up on shares but not until after earnings. I think we will see closer to 150 before we see 200.", "score": 2, "replies": []}, {"body": "Apple having to rely on gemini is disappointing, but it has always outsourced key features it doesn't have the resources for (hardware and time currently for AI) to other companies with great success for both parties. With google, search is the obvious one that has continued for almost 2 decades. The iphone also launched in 2007 with google maps and youtube baked into its OS. Apple benefitted from being able to tailor the maps and youtube experience to its own users for years, and google benefitted massively from exposure that contributed to their continued dominance today. Same thing with microsoft and office in the 80s. Apple outsourced office to microsoft for the macintosh and is why MS exists as a company today. And same with apple card and goldman sachs (but maybe not as good for goldman). There are many examples of this. Cutting great deals is what apple does. Would you prefer apple rush development of an in house LLM like it did with maps and tarnish its reputation further in this critical time for the company? Surely given the time constraints and the fact that apple isn't pouring as many billions into H100s, any in house LLM released this year won't exceed let alone match the competition offered by GPT, anthropic, google, etc. But I doubt apple will have any issues 1. cutting a great deal with any existing LLM to integrate into its ecosystem and 2. integrating this LLM to the ecosystem and its local AI efforts in a way that is innovative or at least easier to use than existing AI solutions in windows, android, etc. Steve chose Tim Apple for a reason. I think it's reasonable to still have some faith in this company.", "score": 2, "replies": [{"body": "They can charge for it and a premium so the more I think about it the more I think it's ok", "score": 1, "replies": [{"body": "It's not just whether apple can or will charge for it in the short term. How are you going to use AI in 5-10 years? By going to chat.openai.com? No. It's going to be integrated into your OS. And not just on your phone, but on your computer. It'll help you manage your home automation and know your music/tv preferences. It'll plan your schedule out for you. It'll keep track of your health via daily biometric measurements provided by your watch and offer recommendations to stay in shape. What is the one platform out there that incorporates these across all your devices under a single account? Apple. Apple is by far the best positioned company out there that can bring consumers a jarvis like AI. All this AI hype around chatbots in the browser or suggestions baked into your OS translates to a clunky experience if your windows machine has a different AI than your android phone and your amazon echo. Imagine having to think about which AI to listen to or telling the other AI what it missed out on every day because it doesn't have access to your other devices. It isn't going to work. Apple just needs to pull it off.", "score": 2, "replies": [{"body": "that's what i am saying. the licensing agreement they get will probably be that.", "score": 1, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "There will be bad numbers.  The only reason stock is not $50 is because of all the shares buybacks.  They’re running out of cash with failed product launch and iPhone sales decline.", "score": 2, "replies": [{"body": "but then all they have to say is Ai and should pop 10%. All kidding aside, do you think Apple is just going to fold or something?", "score": 1, "replies": [{"body": "Fold, no.  But it’s overvalued.  I expect meh results and meh forecast.", "score": 2, "replies": [{"body": "not you but I don't want to hear shit about fuck with Tesla where it is. I trust Apple 10x's over to save their product line compared to Elon musk selling cars", "score": 1, "replies": []}]}]}]}, {"body": "Well it is at long term support right now as well", "score": 1, "replies": []}, {"body": "I apologize. If Apple is actively pursuing OpenAI and Google for their AI like they did with search and maps then that means they have nothing brewing in AI and this may be a completely moot point. It means they are not spending on chips and have no desire to do so for their own AI advancement.", "score": 1, "replies": []}, {"body": "My position: Currently €1 in a stock savings plan on apple and a few calls (like $500)", "score": 1, "replies": []}, {"body": "Puts it is", "score": 1, "replies": []}, {"body": "I imagen Apple will take a very hip consumer focussed approach to AI. That was their strength in the past.", "score": 1, "replies": []}, {"body": "All in with one share let’s go", "score": 1, "replies": []}, {"body": "I gotta know. What’s your average on that one share? $190? ![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "Peasant.", "score": 2, "replies": []}]}, {"body": "I have calls ONLY because I want puts, and I think inversing myself is the right decision on apple.  it will be another TSLA situation.  175c 5/17 oughta do fine.", "score": 1, "replies": []}, {"body": "The reason I'm not bullish on Apple is simple, they created a $2T Company because of their innovation, always at the bleeding edge of technology. Where are they now? What technology are they even leading? AI no, phones no, laptops no, TV no, cars no.", "score": 1, "replies": [{"body": "lol \n\nPhones? Yes\nTablets? Yes\nSmartwatches? Yes\nWearables? Yes\nNotebooks? Yes\n\nIn short: in pretty much every category Apple offers they are the “one to beat”", "score": 12, "replies": [{"body": "I can see going the rest of my life without buying consumer electronics from another brand. I like their shit that much more than the competition", "score": 6, "replies": [{"body": "Precisely this.\nThis ecosystem obviously allows them to sell into their vast services as well.\nSo I am not saying Apple needs to pop (as it’s not a cheap stock per se) but claiming “Apple is not innovative” was such a stupid take that I needed to respond, alone what they did with Apple Silicon was such a clear demonstration of innovation excellence.", "score": 2, "replies": [{"body": "At what point do \"growth stocks\" evolve into \"dividend stocks?\" Google just introduced a dividend. Is Apple next?", "score": 1, "replies": [{"body": "Apple does pay dividends already 👀", "score": 1, "replies": []}]}]}]}, {"body": "Bunch of morons out there don’t realize this.  They’re the best in all of this categories.  Soon to be AI as well", "score": 5, "replies": [{"body": "Wtf, they're the best in literally none of these categories.\n\nYou can get better newer hardware that runs circles around apples products for cheaper.\n\nThey run old hardware and buy parts from their competitors and they always have.\n\nThey were NEVER innovators, they didn't even create the first touch screen smart phone. \n\nAll the functionality they created slowed existing processes down. You can drag and drop an entire folder with thousands of soungs in seconds on an android device bit you have to use iTunes and sync your entire library to add one song. How are people so fucking incredibly stupid to keep giving Apple money and repeat tired lies over and over.", "score": 0, "replies": [{"body": "There is a reason most consumers don't care about cpu speeds, ram and other yard sticks. \n\n  \nWhen it comes to the apple phones, the reliability, user experience is unmatched. I had 1 app hang on my iPhone (zuckerbergs app) in the 4 years I have owned my iPhone. Before that on Android, it was a reoccurring thing, have to force close apps all the time. That's because Apple has its own OS, and limited phone models they need to optimize for, so developers can make apps that are resilient, while Android has thousands of phones, at different updates, by different manufacturers at different spec prices- which creates garbage apps. This extends to their laptops and desktops. There is a reason they are leading in so many categories.", "score": 1, "replies": [{"body": "Peasants will use anything given to them.", "score": 2, "replies": []}]}, {"body": "With my iphone I just plug it in to my mac and click sync to move my entire music library over, including albums, playlists, and metadata. Then I plug in my ipad and click the same sync button. Most people don't even do it this way anymore and just pay for apple music. It really is easier than dragging my music folder to a specific folder on an android phone over every time, then exporting updated playlists separately in some third party app like poweramp. Forgive me for being so fucking incredibly stupid for preferring it this way.", "score": 1, "replies": []}, {"body": "They don't know they're fanbois buying over the odds for inferior tech", "score": 1, "replies": []}]}]}, {"body": "You clearly dont understand what innovation is, what can an iphone do that another brand cant do?  What technology does an macbook have that other brands cant do? Or laptop? Or anything else. Youre just a fanboi that is happy to pay more for the same tech as others do, but you dont know it.", "score": -2, "replies": [{"body": "Yea - I clearly don’t understand. You might realize (when you eventually outgrow your basement) that innovation has different shapes. Inventing a new category such as the smartphone results in a “dominant design” and from then one innovation is more incremental than radical.\n\nApple is leading the world in almost all categories they play in - claiming they are not “innovative” just because they haven’t pushed a stupid 2 display phone or whatnot to the market is just pure BS.\n\nAlso - you want some examples of innovation at Apple? \nApple Silicone pretty much changed the game for notebooks and blew everything else out of the water in terms of performance / battery.\nAirPods by itself defined a new category - Apple Watch did the same.\n\nAnd no - I am not a fanboy, I am just not a basement dweller who claims a 2.x trillion company that leads globally in everything they touch is “not innovative”", "score": 5, "replies": [{"body": "Lol, nice try. I retired at 45 a multi millionaire. Now make money on trading. But good luck to you trying to afford to move out from your mum's.\n\nInnovation isnt reselling the same phone for the last 10 years, or charging other companies huge fees. The Apple M1 chip was 4 years ago, and designed by ARM, not apple. Apple *used* to be innovative but haven't innovated for 5 years, and now just relies on fanbois like you who won't buy other brands. \n\nWhen they go back to wowing the market then I'll be the first to say that they're back to their best.", "score": 0, "replies": [{"body": "You write like a highschooler, and argue like one. Literally you can actually read what he said, and disprove that, but you can't. AirPods were revolutionary and set the benchmark, the watch also set the standard and is the market leaders, their M2 cheap are far far superior than anything in the market right now. \n\nWe could use that dumb argument on google. What have they recently made that is revolutionary?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think Apple will certainly do a deal with Google for “web search” ai features. I think on device will be “Siri 2” and you’ll be able to select your AI provider like you do with web search for the heavy knowledge stuff. \n\nThe ai providers will be paying Apple.", "score": 1, "replies": [{"body": "I think AI is going to hurt apple for the next few years.  ARM vs x86 inference speed/quality is night and day right now.  Imo, the Intel NPUs with Windows copilot will be the better product in '24 and '25.", "score": 2, "replies": []}, {"body": "they may actually do it with OpenAI and microsoft. did you hear about that?", "score": 1, "replies": [{"body": "Yeah either or all are good fit the models seem pretty competitive with each other.", "score": 1, "replies": []}]}]}, {"body": "The challenge/opportunity for Apple is to deliver quality handheld ai to the masses asap. Pull it off in June and we’re off.", "score": 1, "replies": []}, {"body": "AAPL earning are what will tank the market and spark a tech selloff.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I don't get what's wrong with Wendy's I like the baconator", "score": 1, "replies": []}]}, {"body": "If you only have 1 share then this post is worthless", "score": -3, "replies": [{"body": "You judge posts buy how much the person bet, not by your interpretation of their words?? A true regard.", "score": 3, "replies": [{"body": "True regards believe in words, not actions", "score": 5, "replies": [{"body": "That’s exactly right and a well regarded summary", "score": 1, "replies": []}, {"body": "Lol good little follower you must be", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "When I read shit like this I think to myself. Well, hmmm, I work in AI too so perhaps this guy posting knows more than I do. Then I look at this guys comment and I notice all he say was I work in ai. Lol nothing else just that.\n\nMy guy, finish your sentence. Say something else then just that because it doesn't mean shit you work in ai.", "score": 2, "replies": []}]}]}
