{"title": "Proposals Recommended by the Tesla Board", "selftext": "", "id": "1c9nhc6", "created_utc": 1713720526.0, "score": 17, "upvote_ratio": 0.67, "num_comments": 97, "comments": [{"body": "I'm kind of disappointed with the arguments they give for moving to Texas\n\n>Our global headquarters – and future – are in Texas\n\n>Our largest manufacturing facility – Gigafactory Texas – is based there\n\n>We have thousands of employees in Travis County, Texas\n\nWhy do these matter?\n\n>Redomiciling requires NO change to headquarters, job, management, properties, facilities, headcount, obligations, assets, liabilities or net worth\n\nSo no negatives in this regard but what are the positives?\n\n>Texas corporate law is developed\n\n>The state has invested in a specialty business court to handle corporate matters\n\nYou mean that court that starts hearing first cases in September this year? That is not developed system. Also why is this better than Delaware court?\n\n>The Delaware Court has demonstrated its ability and willingness to make decisions contrary to the will of our stockholders\n\nThey have demonstrated willingness to challenge decision that didn't follow proper procedure.\n\n>We spend significant time and resources defending Delaware legal challenges to our business decisions\n\nWhy you expect you would spend less time doing same in Texas with less mature court?\n\nHonestly I expected way better arguments than these. They actually raise more questions than answers to me.", "score": 69, "replies": [{"body": "it sounds like the \"positives\" are that in Texas the board and Musk will have more power and the shareholders will have less.", "score": 60, "replies": [{"body": "That's all it's about. The move to Tesla will allow Tesla to issue stocks with more voting power than currently issued stocks. That is how Zuckerberg has majority voting control over Meta. His stock has 10x voting power. \n\nIssuing stock like that after the IPO isn't allowed in Delaware, but it is in Texas. ", "score": 44, "replies": []}, {"body": "So the board is lying again? Did they not learn anything from the Delaware ruling?", "score": 22, "replies": [{"body": "I think lying is overstating it. But I think there is a good argument to reject the move.", "score": 10, "replies": []}]}]}, {"body": "Going against the will of the shareholders is reason enough to leave. Procedure (or in this case) information aside, we knew what we were voting for", "score": 2, "replies": [{"body": "Would the shareholders, had they known that Tesla projected that it would meet all benchmarks prior to bringing the vote, still have voted for the compensation package?\n\n\nWould they have voted for it if they knew the above and that Elon set his rate with no pushback, and that he likely would have stayed for much less?", "score": 14, "replies": [{"body": "Dude. Just because a company has a plan to hit milestone x y and z doesn’t mean it’s easy to do or feasible. You have extreme hindsight bias and are not thinking intelligently", "score": -6, "replies": [{"body": "What they are saying is that board didn't tells us that. If they did then no problem. Difficulty of the task should be relative to compensation. Easy tasks should result to lower compensation while harder ones give bigger compensation.", "score": 7, "replies": []}, {"body": "Tesla's internal projections were that they were on track to meet the benchmarks set out by the vote. Tesla did not inform shareholders of this.", "score": 5, "replies": [{"body": "You clearly were not around in 2018.", "score": -5, "replies": [{"body": "Tesla was lying to you in 2018, and you still believe those lies.", "score": 6, "replies": [{"body": "No, they weren’t. You assume shareholders did not know that the board was close with Elon. That’s a dumb assertion, as most of us definitely knew. It didn’t matter, the package would cost us $0 if Elon didn’t deliver. If he did deliver, we would all reap the rewards. \n\nAgain, you have extreme hindsight bias. This is how all corporate compensation plans should be set up.", "score": -5, "replies": [{"body": "How is any of that responsive to Tesla not informing shareholders that Tesla was on track to meet all of its benchmarks put forth in the compensation plan prior to the vote?\n\n\nYou do not understand what hindsight bias is. Nobody's talking about what happened after the vote, this is about what Tesla knew and projected before the shareholder vote occurred.", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Tesla has had one of its largest drops in a while. And yet it is still the 12th most valuable US today and most valuable automanufacturer.", "score": -1, "replies": [{"body": "i thought they dont' cateogrize as a auto company ???\n\n  \nanyway as a shareholder this doesn't make sense, why would i give up rights to the coporatation?  it will not be a good look for the future as there is unknown risk to shareholders if this vote to move it to texas passes", "score": 1, "replies": [{"body": "Was talking about the Elon vote. Tesla didn't know it would hit those benchmarks. They were not guaranteed by any means and were outright deemed insane at the time. At that time, Tesla had nothing but vehicle manufacturing. They were barely selling Powerwalls and had only completed a handful of grid scale energy plants.\n\nVery few companies in history have achieved a marketcap similar to Tesla. Again, they are the 12th largest market cap in the US today. And not one single automaker ever has. So what benefit is it to screw over the person that actually got Tesla there? If it were so easy that he wasn't needed, then others should have been able to replicate the feat at many other companies.", "score": -1, "replies": [{"body": "did you not read the complaint that this whole thing is revolving around? \n\nif you're a shareholder you should have a copy, i'd read it front to back to understand why it is and the board is a problem. look at other companies that HAVE hit the market cap that Tesla has and then look to see if it has the same probelms with their exec team and BoD.  just sayin... it sounds like you didn't read it or are in denail", "score": 1, "replies": [{"body": "I'm speaking specifically about the comp package. If you think the board needs changing, that's fine. I don't specifically, but to each their own. However, specifically on Elon's pay package, there was no mistaken at the time what was going on. Hit these milestones and stay there. Doing so gets him this much. Not doing gets him nothing. No confusion, no lies, no misunderstandings. Everyone who voted on it knew exactly what was happening. And every single one made bank on it. And the goals were not easy. They were extremely difficult to achieve. And there were measures in place to prevent a pump and dump.\n\nAnd yet some judge says that everyone was too stupid to make their own decisions and she's going to \"save\" everyone by overwriting the decisions of the shareholders. Oh, and this decision to \"save\" the shareholders from their stupidity is going to cost $5B to lawyers who don't care about the company at all. So yeah, I'm on the side on Elon and on the side of leaving any state that would do that in the first place.", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "Your point of view that it doesn't make sense to incorporate in Texas 'just because their headquarters and manufacture are there' sounds like it implicitly takes the current system as though it ought to be this way - that regardless of where you really exist/do business mostly, you should just incorporate a thousand miles away to avoid taxes.\n\nI think the 'current way' is gross and incorporating where you 'really are' sounds like what the honest/ idealistic side of me would want.\n\nI also don't like the fiduciary duty to serve shareholders first and foremost - a lot of the impetus between companies doing stock buybacks instead of investing in their future/employees etc. Being nearly obligated to pay as little as you can get away with to enrich people who are sitting on mountains of money is a doodoo ass way to set up a system.", "score": -7, "replies": [{"body": "The cars are designed in California, Software for Robotaxis is developed in California, Megapacks are in California, and there's a factory in California that makes 4 of their S3XY cars. By Tesla's logic they should be incorporated in California.", "score": 2, "replies": []}]}, {"body": "If you think the Delaware's court's decision about Elons comp was anything but an attack you are delusional. It was an incredibly straight-forward and pro-shareholder proposal:  For every $50 billion in market cap Elon adds to the company, he can buy 1% more of the company for cheap. \n\nThe Delaware courts can't be trusted with the future of the company. It's going to become a much more massive company from here, and will be a threat to too many other industries.", "score": -19, "replies": [{"body": "Why did Tesla lie to its shareholders about the context of the vote?", "score": 7, "replies": [{"body": "They didn't.", "score": -2, "replies": [{"body": "They demonstrably did.", "score": 2, "replies": [{"body": "No, they didn't. They didn't provide all the details that Delaware said they should have. But it wasn't a lie. And even then, it didn't affect a single thing with the vote nor the plan.", "score": 1, "replies": []}]}]}]}, {"body": "Most commenters here are not Tesla shareholders.  Not only do they want him to not get his pay package, they want him to also leave Tesla. If Elon left the company, the stock would tank.  Which leads me to conclude most commenters here are paid shills or bots.  \n\nThere are no other EV companies doing well right now but somehow they argue another CEO would be for the better.", "score": -6, "replies": [{"body": "Who is funding these shills and where do people can apply for getting paid for having a different opinion?", "score": -1, "replies": []}, {"body": "I get your point and I agree: Musk have helped Tesla but Tesla is not 100% Musk's blood.", "score": -1, "replies": []}]}]}]}, {"body": "Someone needs to put out an “missing, return if found” notice for the spines of the Tesla board. Do your job. Defend the stock holders interests, not Musks. (They often overlap but here they do not)", "score": 30, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "The long term, of course!  Musk is completely off his rocker and needs some guard rails put in place by the board. When you later look back at Tesla history and innovation, you’ll see that the earlier managed Musk is not the now Musk unleashed with zero inhibitions. \n\n“Past performance is no guarantee of future success”. People change. The Musk fanboys ought to have it tattooed on their foreheads as a reminder.", "score": 14, "replies": []}]}, {"body": "Pretty sure keeping the greatest business leader in probably world history will be a good thing for shareholders.", "score": -9, "replies": [{"body": "Greatest business leader in history? How’s his latest company that he took over doing? He turned Twitter into a cesspool full of anarchy, hatred, racism, and chaos, chasing away over 90% of its advertisers. He became the business leading fool of the world.", "score": 8, "replies": [{"body": "Twitter has more real users than ever, and is about to post a profit. All without Disney ads. Guh!", "score": -5, "replies": [{"body": "No. It will never post a profit. And it has 90% more bots than ever. Those are your new users. Them and all the new Nazi sympathizers that were never allowed before to disrupt civil discourse. Hyundai just pulled their ads this week due to Nazi support.", "score": 4, "replies": [{"body": "Wow so does CNN just directly code your brain?", "score": -3, "replies": [{"body": "I don’t watch CNN much at all as I don’t pay for cable. I like to get me news from a variety of sources as long as it’s not social media and definitely not Twitter/X.", "score": 5, "replies": [{"body": "Good script", "score": -3, "replies": []}]}]}]}]}]}, {"body": "Who said anything about Jensen?", "score": 4, "replies": [{"body": "He didn't build 2 megacap companies at the same time. And while founding a few more with the same potential.", "score": 6, "replies": [{"body": "I think $NVDA's $1.9T far exceeds the public-market valuations of all Elon ventures combined by a wide margin. SpaceX shares don't have any price discovery and the car company is cratering. If we take Elon's dumb investor's valuations, $180B for SpaceX and $500B for TSLA. The rest of his shit ain't worth shit. Twitter is the dead bird from Dumb and Dumber with taped-on head ($10B max). Boring is not doing much. Neuralink just an elaborate scheme to have some kids. Hyperloop is dead. xAI seems like a half-baked way to capitalize on the AI craze and the Elon craze without much substance, much like Long Island Iced Tea Company changing their name to Long Blockchain Corp.", "score": 6, "replies": [{"body": "Nividia's tapping out while Tesla's future growth potential/TAM blows them out of the water. Tesla's *profit* can be a trillion a year with AI/robotics. Market cap based on future profit from just cars and energy can bring TSLA to $10 Trillion valuation. \n\nTesla stock went to $100 last year, then rose to $280. Being by far the leader in EV, both by volume and being the *only* automaker making a profit on EVs doesn't scream \"failing\" to me. \n\nNeuralink will be a trillion dollar business. They solved computer/mind telepathy and are now focusing on curing blindness, then will cure quadriplegia. \n\nBoring tunnel is making tunnels something crazy like 10X cheaper. They will be a massive success as well. \n\nSpace X's price is based on what institutions are actually paying for shares. When Starlink is fully scaled they will be a goliath of a company. \n\nMusk just wrote a white paper on hyperloop, it wasn't a company start up by him, although Boring Company is doing tests with that technology. \n\nI think you just don't want to learn about any of these companies, including Tesla.", "score": 4, "replies": [{"body": ">Nividia's tapping out while Tesla's future growth potential/TAM blows them out of the water. Tesla's *profit* can be a trillion a year with AI/robotics. Market cap based on future profit from just cars and energy can bring TSLA to $10 Trillion valuation.\n\nAll existing carmaker companies are worth less then $2 trillion. You think Tesla can earn more then all other automakers combined? Also even if market cap does go up, Tesla loves to dilute it's shares so worth of shares doesn't go up.\n\n>Tesla stock went to $100 last year, then rose to $280. Being by far the leader in EV, both by volume and being the *only* automaker making a profit on EVs doesn't scream \"failing\" to me.\n\n[Doesn't look like the share value is increasing to me.](https://finance.yahoo.com/quote/TSLA/)\n\n>Neuralink will be a trillion dollar business. They solved computer/mind telepathy and are now focusing on curing blindness, then will cure quadriplegia.\n\n[https://www.unilad.com/technology/blackrock-neurotech-neuroport-array-brain-chips-technology-273007-20230502](https://www.unilad.com/technology/blackrock-neurotech-neuroport-array-brain-chips-technology-273007-20230502)\n\n>Boring tunnel is making tunnels something crazy like 10X cheaper. They will be a massive success as well.\n\n*TBC has completed one tunneling project that is open to the public, as well as multiple test tunnels.*\n\n>Musk just wrote a white paper on hyperloop, it wasn't a company start up by him, although Boring Company is doing tests with that technology.\n\nHyperloop  declared bankruptcy and ceased operations in 2023", "score": 4, "replies": [{"body": "Teslas auto sales when they scale to 20 million vehicles/year is $40,000 average car price with 25% profit margin (when including everything like software add-ons, the charging stations etc.) That's $200 billoion profit/year. Battery storage will be as large or bigger, meaning combined $400 billion profit/year. A 25 PE multiple brings the company valuation to $10 trillion. \n\nThat's the bear case. Now instead when robotaxi works, that means every car that goes into robotaxi can make $30k profit/year X 10 years. So a car that costs $20k to produce will make $300 k profit. With a business like that $10 trillion market cap would be cheap. \n\nGood luck to the neuralink knock-offs. Unless they're like neualink and developing a robot to cheaply implant, they won't be able to scale. \n\nBoring company just got a 25 mile contract for Vegas. I don't you get the opportunity of cheap tunnels. Normally tunnels cost like $100 molliom to $1 billion per mile. Boring company can do it for $10 million per mile. \n\nHyperloop isn't a Musk company!", "score": 2, "replies": [{"body": "You do know that the PE ratios of mature non-growing companies is in the 3-5 range and not 25 right? \n\nEven if your wild fantasies would come true, the valuation would be closer to1 trillion than 10 trillion.", "score": 3, "replies": [{"body": "Uh, no. Tech companies aren't valued like that. And a company that grows robotaxi and is making a humanoid robot at the same time to replace workers will have an insane valuation. \n\nRobotaxi has the potential to make a Trillion profit per year.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Lmao", "score": 1, "replies": [{"body": "Anyone else you know built 2 mega cap companies simultaneously?", "score": 3, "replies": [{"body": "Anyone else you know destroy the best branding of any company in the world (twitter)?", "score": 3, "replies": [{"body": "Yes Twitter was better when it had less users and was known as a conduit for the democratic party's propaganda.", "score": 0, "replies": [{"body": "I’m talking about the branding. He got rid of a brand name that most companies would dream of. How dense are you?", "score": 2, "replies": [{"body": "Twitter branding was tainted, and had lower user count than X. \n\nHow dense art thou?", "score": 3, "replies": [{"body": "Bro. We are talking about the name, twitter. It could be used as a verb. That is the most valuable aspect for any brand. Elon dropped that like it was nothing for “X” which is as close to a porn site as it gets. \n\nIf you think that changing the name from twitter to X was a good idea, I have a bridge to sell you.", "score": 5, "replies": [{"body": "If you want to re-brand Twitter to be about more than just Tweets, it makes sense to change the name. They want to move to a video platform, money payments/exchange like Cash app etc. Who knows what else. And sure, porn. Also if you want to bring people to the platform that know Twitter as the democratic party's mouthpiece, you have to change the name too.", "score": 2, "replies": [{"body": ">\tIf you want to re-brand Twitter to be about more than just Tweets, it makes sense to change the name.\n\nWhy? After all, Musk is trying to emulate *WeChat* which did not need to toss away their brand in order to implement features outside of instant messaging.", "score": 3, "replies": [{"body": "You really believe something called WeChat will be the dominant platform in 5-10 years? I'd bet on the all-encompassing (including porn) app.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yep. I think forums have been overrun by bots and new investors.", "score": 6, "replies": [{"body": "Beep beep boop!", "score": 0, "replies": []}]}, {"body": "Politics aside, all the delayed projects—solar roof, roadster, 4680, Model 2, and Semi—certainly point to leadership that is unfocused.", "score": 5, "replies": [{"body": "The projects are delayed due to focusing. Model Y became the main focus and pushed everything back. And for good reason. 4680s are in progress, but there are issues ramping. It is a focus as well, put over most everything except Model Y.", "score": -2, "replies": []}]}]}]}]}, {"body": "*Unlike most CEOs, Elon was entitled to receive NO salary, NO cash bonuses, and NO equity that would vest simply by the passage of time. Instead, he was asked to deliver the type of exponential value creation most thought was impossible – or get nothing.*\n\nThis was pretty fucking stupid and if this is true then its still not worth to pay him what the company takes 3-5 years on average to make. \n\nThis is a very untrue statement. Ive lost a lot of money on this fucker selling shares for his own good. **Stop with the horse shit and fire this fucking board.** \n\nThis is dumb as fuck and you can't frame it any other way you god damned clowns that believe this nonsense.", "score": 27, "replies": [{"body": "You obviously weren't around in 2018. \n\nAlso it's not a cash payment, it's a stock option with a vesting time.", "score": 20, "replies": [{"body": "It was proven in court you were not actually informed in 2018, so why is your opinion more valid than someone who has taken the time to inform themselves on what actually took place in the Tesla boardroom in 2018.", "score": -2, "replies": [{"body": "Wow so Roe V Wade was overturned by a court, am I supposed to change my mind about abortion's constitutionality?", "score": 8, "replies": [{"body": "...yes?\n\n\nThe SC decides what is and isn't constitutional. You can disagree about what *should* be constitutionally protected, but abortion, right now, has zero constitutional protections in the USA. States can totally ban it if they want.", "score": 3, "replies": []}]}]}]}, {"body": "What’s wrong with letting the shareholders - owner’s of the company decide?  Interestingly, Elon and Kimbal aren’t voting.", "score": 11, "replies": [{"body": "They can decide. The comment is suggesting shareholders should also decide to terminate the board that first created this mess and now is doubling down on it. \n\nThey are saying they need to do this because he was not paid. Well here is an idea. Take the compensation of the top 10 automotive CEO's over these years. Add them all together. And multiply by 5x. And this would still be 7x less then they want us to give him. \n\nI'm fine with paying someone for their work. He didn't do 55 billion worth of work. If the board was independent they would have given him what was needed for him to stay at tesla and not anything more. That is how salary negotiations work.", "score": 9, "replies": [{"body": "You elaborated in English way better than what I was willing to do. \n\nElon should have compensation. I'm all for voting on his golden parachute - ill agree to pay him 20B to fuck off. Maybe 26. \n\nInterested to see how this plays out in 10 years.", "score": 1, "replies": []}]}, {"body": "Shareholders are not a real thing? \n\nElon and Kimbal don't need to vote in order to skew things in backrooms to get 3-4 years worth of the company's profits. \n\nThere are so many things wrong with this pay package. *Lmao dont act like there isnt if you know what the fuck you're talking about.*", "score": 2, "replies": [{"body": "If shareholders should not decide on a CEOs pay package, who is in a better to do that?  Keeping in mind ethics and fairness.", "score": 8, "replies": [{"body": "im no longer have a conversation with people on reddit. I forgot I needed to delete the app.   \nSorry. \n\nEnjoy your time here.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "My family is up 400% on TSLA as of right now. Give elon his package", "score": 2, "replies": [{"body": "And dilute your shares?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2025-04-22 01:37:23 UTC**](http://www.wolframalpha.com/input/?i=2025-04-22%2001:37:23%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/teslainvestorsclub/comments/1c9nhc6/proposals_recommended_by_the_tesla_board/l0ojqx1/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2F1c9nhc6%2Fproposals_recommended_by_the_tesla_board%2Fl0ojqx1%2F%5D%0A%0ARemindMe%21%202025-04-22%2001%3A37%3A23%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201c9nhc6)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 0, "replies": []}]}]}]}]}, {"body": "Voting yes. No brainer for shareholders.", "score": 9, "replies": [{"body": "Why is voting away your rights a no brainer? The only reason for Tesla to move to Texas is to give Elon more control over Tesla.", "score": 5, "replies": [{"body": "Lol. It’s not a controlling stake.", "score": -2, "replies": [{"body": "Talking about the move to Texas, not the compensation. Keep up. But while we're on the compensation, why do you want to dilute your shares so badly?", "score": 1, "replies": [{"body": "Texas is virtually a non-issue. Doesn’t really matter Delaware or Texas or any other state. It’s all posturing. \n\nAs for shares, because I don’t think anyone else can achieve the moonshot of robotaxi or Optimus. If achievable, potential for significant share holder returns. \n\nIf it was only EV, I wouldn’t care and preferred a manager then over Elon. But because the EV gains have already been priced in and those monies already made, Tesla is gonna need another growth story.  And Tesla is positioned for non-EV AI projects that I think only Elon could pull off. \n\nRisk:reward of additional 10-15% stake to Elon for potential of more profit growth is the bet.", "score": 0, "replies": []}]}]}]}, {"body": "Being a Tesla investor and disliking Elon just sounds like you’re asking to be angry all the time. I mean Lucid is essentially the CTO leaving to be CEO to replicate Tesla without Elon.  It’s also down 41% YTD like Tesla so there’s that.", "score": 1, "replies": [{"body": "Lucid also loses $200,000 per vehicle manufactured (that is, if we are only discussing automotive sales as the sole business case of the company).", "score": -2, "replies": [{"body": "Eh that’s like every EV startup", "score": 2, "replies": [{"body": "So why exactly would I invest in one of the startups when I can invest in the market leader if both are down the same % YTD?", "score": 1, "replies": [{"body": "I’m just saying if you’re adamant of not wanting Elon as CEO literally that option is there", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I will vote yes.", "score": 8, "replies": []}, {"body": "I'll be voting no.\n\nElon self-admits he spends almost no time on Tesla anymore, so why compensate him for a job he's not doing?\n\nPlus... other reasons.", "score": 5, "replies": []}, {"body": "I believe in TSLA long term goals, but I do not approve of Elon's recent behavior. I will be voting no to his pay package, no to relocating the company and yes to proposal of majority vote and board term limits. I think Elon is a great CEO, but the company is at a point where it no longer needs him if he continues with his shenanigans. I also want Kimball Musk and other members who are heavily invested into spacex out of the board.", "score": 7, "replies": []}, {"body": "Vote NO. Anything we can do to to get rid of him we should take advantage of.", "score": 11, "replies": []}, {"body": "Isn’t Tesla’s market cap $461B?", "score": 1, "replies": []}, {"body": "[removed]", "score": -1, "replies": [{"body": "[removed]", "score": -1, "replies": []}]}, {"body": "[ Removed by Reddit ]", "score": -4, "replies": []}]}
{"title": "Please help me explain this", "selftext": "[removed]", "id": "1c97w7w", "created_utc": 1713668965.0, "score": 0, "upvote_ratio": 0.32, "num_comments": 97, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1513 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1c8y5gy/its_time_to_short_blackrock_blk/) \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Avoid this idea! Too much unnecessary risk, the bedrock of 2008’s housing/financial recession is not the same and was a somewhat generational collapse. Even with current 7% rates, housing demand will remain high due to so many families with “golden handcuff” ultra-low rates mortgages. They just aren’t selling! Would rather see you buy an index fund/ETF or undervalued individual stock (after DD).", "score": 15, "replies": [{"body": "Taking out a heloc loan with where rates are right now is not a smart idea.", "score": 4, "replies": [{"body": "Agree", "score": 1, "replies": []}]}, {"body": "Yeah, but an index fund/etf won’t return my equity if the market crashes. Leverage (calls) on Leverage (REIT) will return my equity", "score": -2, "replies": [{"body": "Then wait for a market downturn, with cash (powder) ready for later in the year. Avoid leverage in this scenario.", "score": 2, "replies": [{"body": "I would have to HELOC the whole thing though.", "score": 0, "replies": [{"body": "Start saving cash instead (put in a high yeild MMSA). Leave the HELOC alone for emergencies or a big future investment opportunity.", "score": 6, "replies": []}]}]}]}]}, {"body": "Terrible plan. We’re not in a housing bubble, not sure how you don’t know that because it’s pretty obvious. \n\nGive it a shot but it’s a waste of time and money.", "score": 12, "replies": [{"body": "My house has gone up 100K in 16 months\n\nHow is that NOT A BUBBLE", "score": 0, "replies": [{"body": "Supply? Inflation? Existing home sales have generally been dropping month after month for the past two years. How is that a BUBBLE when sales volume is DROPPING?\n\nSome genius at my job sold his house with his wife in 2020 hoping to rebuy when everhthing “crashed” and here they are STILL renting 4 years later. 😂", "score": 8, "replies": []}, {"body": "I N F L A T I O N", "score": 2, "replies": []}, {"body": "Where in Texas do you plan on moving to? I live in Austin and I’ll telll you now, if you plan on moving here, be prepared to spend at least $600k to live in any decent neighborhood.", "score": 2, "replies": [{"body": "BFE North Texas.", "score": 1, "replies": [{"body": "I understand what you’re trying to do. Taking on more debt to protect against short term future losses isn’t the best approach. Real estate bubbles are highly complex and often linger for decades before even a very minor pullback. You’re betting on something that probably won’t happen anytime soon. If it backfires on you, your nursing salary won’t be enough to cover the loss. There’s nothing wrong with leasing your home for the time being while you figure out something else.", "score": 1, "replies": [{"body": "My wife makes $215,000 a year…RN.\n\nYou just have to be willing to travel.", "score": 1, "replies": [{"body": "My wife is a Nurse Practitioner and doesn’t near that. It has to be very rare for an RN to make that much. Anyways, you still shouldn’t take on more debt.", "score": 1, "replies": [{"body": "We travel nurse. 1/3 of the income is a tax free stipend, and instead of staying in $900/weekly AirBnBs, we bought a camper for $15,000 and stay at a campground for $600 a month.\n\nThe only stipulation is we have to duplicate expenses, hence the house. If you have that, the IRS doesn’t come after you and nitpick. However, you’re not allowed to itemize the travel expenses, or that would be double dipping", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Bidenomics ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "https://preview.redd.it/b4vzcftdgrvc1.png?width=1920&format=pjpg&auto=webp&s=2aded3e10c63aa753ac8796d1d75c94bdb5824b5", "score": 1, "replies": []}]}, {"body": "Well milk has doubled and everything else went a bit too", "score": 1, "replies": [{"body": "Milk is in a BUBBLE.", "score": 4, "replies": []}]}, {"body": "Dude I've been on the sidelines praying for a housing crash but the reality is it may never come again. Totally makes sense you are tyring to protect your ass but even for your house to decline 10% - a lot of things would need to take place that simply are not in the cards at the moment. Stock market might have a correction, layoffs might increase, overall we might stagnate a little but the fed is mega active and will immediately reduce rates to keep up economy. It's just not the same scenario as 2008 was.\n\nYou did well on the purchase. Good location/property. Enjoy the gains.", "score": 1, "replies": []}]}, {"body": "Agree.", "score": 1, "replies": []}]}, {"body": "You’re not a market genius, you wouldn’t know a bubble if it knocked on your door and slapped its dick on your forehead.\n\nBut it’s your money, do with it what you will…", "score": 4, "replies": [{"body": "I’m not a market genius. But I want to protect my equity in the short term, without having to sell my home.\n\nPray tell me, what other method could I use to protect the equity for the next year, without actually selling the home?", "score": 1, "replies": [{"body": "Because there’s nothing to protect, the housing market isn’t going to crash next year. Even in the current interest environment people are still buying homes. People who bought at 2-3% interest rates aren’t going to rush to sell any time soon (with the exception of you I guess)\n\nYou take out a heloc loan for 10k now you gotta pay 7-10% interest on a bet that you’ll likely lose on. Basically just throwing money away.", "score": 3, "replies": []}]}]}, {"body": "Nobody tell him.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "Don’t think you are in any danger here, nobody is selling their house with 2-3 percent interest rates. Demand is still insane.\n\nBut okay - you’re worried…\n\nAssuming you are okay with the taxes- just sell the fucker now and rent for a year locally- you were willing to throw away 10k anyway.", "score": 3, "replies": [{"body": "I don’t want to move right now, it’s so much money to rent a U-Haul in Illinois 😭😭😭", "score": 0, "replies": [{"body": "Use ABF moving trucks instead of uhaul. Much better and easier with no driving.", "score": 1, "replies": []}]}]}, {"body": "Realtors will steal a part of that equity", "score": 3, "replies": [{"body": "Or they can sell it themselves.", "score": 1, "replies": []}]}, {"body": "Yes, do this but Instead sell naked calls on DJT.", "score": 3, "replies": []}, {"body": "Locking in your appreciation for the term you know you'll have the house isn't a bad idea, but the problem you have is that real estate fluctuations are local. You have to be very careful as to which REIT you select, and there might not be one very aligned with your home. The REIT will have to consist of homes, rather than business real estate. It will have to be a real estate oriented rather than mortgage, etc. And then you have to find the inverse, it if it's an ETF, maybe an option, etc.", "score": 3, "replies": []}, {"body": "I may not own a house, but I’ve gambled enough with options to know this is a terrible idea", "score": 2, "replies": []}, {"body": "This is a very bad idea. All of the assumptions in your theory are incorrect. There is no data correlation at all to the home values in your community, and the price movement of some national REITs or other real estate ETFs you can find to trade options on. \n\nYou want to lock in your home equity gains? Sell the house now and start renting….", "score": 2, "replies": []}, {"body": "Nobody tell him that he will lose more money in rent………", "score": 2, "replies": [{"body": "Honestly? The 15-year mortgage payment is like $4700 a month on most of the houses in the area we’re looking. Rentals are like $1,600.", "score": -7, "replies": [{"body": "You are hopeless.  Stay away from money.", "score": 7, "replies": []}, {"body": "How much can you sell the apartment you rented after 15 years for, also rent never goes up bro what", "score": 3, "replies": []}]}]}, {"body": "I wouldn’t recommend a HELOC because of the interest fluctuation (but if you can pay it back fast, no worries). Have you looked into a cash-out refinance?", "score": 1, "replies": [{"body": "But wouldn’t that make the rest of what I owe be at 7%?", "score": 2, "replies": [{"body": "True dat. Do you plan on renting the house out when you move to Texas?", "score": 1, "replies": [{"body": "We are highly considering it", "score": 2, "replies": []}]}]}]}, {"body": "You’re thinking is off… consider why and how the bubble happened in 08… and consider why your equity went up lately… \n\nTwo very different catalysts", "score": 1, "replies": []}, {"body": "I'll be surprised if you get any useful discussion in this sub. Why do people post serious questions in this sub? Memes, DD and loss/gain porn is what this sub's about.", "score": 1, "replies": []}, {"body": "The housing market really isn’t in a bubble though it’s a weird part of the market currently, and if rates get cut even in 2025, there’s alot of money on the sidelines waiting for lower rates to buy homes. Your heloc is also going to have a rate of probably 8-9%. You’re arguably hedged by having a 4.25% interest rate already. You’re also in Texas not a coastal city, without more specifics I’d argue that the volatility of your property isn’t as high as somewhere like Portland or CA areas. If you said I wanna take out a heloc and buy puts on CRE REITs bc you’re a degenerate but have conviction I’d be cheering you on all day though 😂", "score": 1, "replies": [{"body": "I have conviction. I also think this would be a great way to roll some equity into an options play that potentially turns into a 100 bagger.\n\nThe Inverse REITs are up 22% this week alone…", "score": 0, "replies": []}]}, {"body": "keep the house and rent it out. sell it when you want to retire.\nsince you are planning on renting in TX\n\nyou should acquire more asset.", "score": 1, "replies": [{"body": "Renting? I wouldn't bother with such a paltry sum. Just buy it.", "score": 1, "replies": []}]}, {"body": "It's not a bad idea (seeing every other comment being dismissive made me really want to comment), but make sure the ETF doesn't suffer from volatility decay (look it up if you don't know what it is). Inverse ETF and ETNs usually do. So, I'll suggest puts on US REIT ETFs instead, unless you are highly confident that you can time the pivot down to the month to reduce impact of vol decay.\n\nMake sure the ETF you're using does what you think it does. Look into the composition.", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Yes, and I’ll scale in monthly, rolling the strike down and out accordingly. \n\nI’m ok with the $10,000 loss, because I have realized gains of $13,000 this year, and the taxes will also be offset.", "score": 1, "replies": [{"body": "Rolling doesn't work well with long options because theta works against you. Only works if moneyness is aggressively moving in your favour.", "score": 1, "replies": []}]}]}, {"body": "Inverse reits are leveraged. Since you are asking here we can assume you do not know that the value of this thing resets every day. Two days of losses and you are in the hole big add to that the 7+ interest you will be paying for the loan. Your timing to execute this has to be divine and that won't happen\n\nIf you want to hedge the value of your equity get some puts on the market with 10k that you have in other plays without having to tap the HELOC. Tapping into a HELOC to gamble is dumb money but look where we are. \n\nYou are trying to de-risk by magnifying your risk.", "score": 1, "replies": []}, {"body": "Mate, try another subreddit. Here if you don’t have a thesis for 1000X in 5 days, you are better off not posting", "score": 1, "replies": []}, {"body": "This is WSB and I predict that you will lose the house and the 10k options. And you will get kicked out of school and be working at Wendys.", "score": 1, "replies": []}, {"body": "a nursing major playing the option to hedge against the lost of equity from the fear of a housing bubble.. hmm, is this a making of a wall street tragedy?\n\nwhat does your wife think of this idea?", "score": 1, "replies": [{"body": "Umm well she didn’t want to buy the house in the first place, but I convinced her it was smart because I’m good at math and I made 400K with our investments over the last two and half years.\n\nI hedged with puts the whole way up though, and I made quite a decent profit stacking on extra on the pullbacks.", "score": 0, "replies": [{"body": "then you don't need our inputs.  happy wife happy life.   i know a lot of smart math professors who are crappy in the market. \n\ntread carefully. \n\ni'm not sure where you get the supporting data to say there is a housing bubbles other than an appreciation in price from low interest & high demands.  \n\nwith the current interest of 7% and the likelihood of fed bank holding rate steady have priced many buyers out of the market.  so the risk of the cited market bubble has abated.", "score": 1, "replies": []}]}]}, {"body": "There’s no supply and hefty demand so house prices are going to stay where they are now or increase. Supply isn’t estimated to catch up to demand for another year or more. \n\nThe only thing keeping prices from rocketing even higher is 7% mortgages, but people are still buying with cash or just huffing hopium that rates come down in a couple years and getting rate buydowns. \n\nAlso not taking the equity from a house that has appreciated that much and coming to Texas where you most definitely could buy a very nice house for whatever your house sells for, and renting is wild. \n\nBased on your “hedging” I’m guessing the renting is because you think the market will go nuclear and you’ll be able to buy property cheap a year two after you move here.\n\nIdk where you’re looking in Texas but there’s no houses renting for $1600 anywhere near where you want to live in DFW. Even decent pocket neighborhoods next to notoriously bad apartments go for like 1800-2000 at least. Pretty sure Fort Worth and Houston are like the two fastest growing cities in America. If you’re putting down roots here, not buying is just shooting yourself in the foot.", "score": 1, "replies": [{"body": "It’s like 1 1/2 hours NE of DFW", "score": 1, "replies": [{"body": "So basically Oklahoma lol…", "score": 1, "replies": [{"body": "Not quite. I said hours…not miles 😂.", "score": 0, "replies": [{"body": "Durant OK is an hour and a half away from DFW my dude lol…", "score": 1, "replies": [{"body": "It’s longer than that around 3’oclock 😂", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What does a market downturn have to do with your house?  I thought reits were more about commercial real estate.", "score": 1, "replies": [{"body": "Well, they always crash the stock market before the housing market, because people sell their 401Ks at the bottom in order to save their house.", "score": 1, "replies": [{"body": "I dunno. The game was changed after 2008 with all the bailouts and QEs.  I would expect if things fall apart the fed would rush in again.", "score": 1, "replies": []}]}]}, {"body": "Let me tell you about this thing called inflation, when the cost of everything goes up and the government print like mad... it ain't coming down.  You can't unprint money.  The value of your house isn't going up.  The value of your MONEY is going down.", "score": 1, "replies": []}, {"body": "Did u do the math correctly? How much protection would 10k calls provide, what expiiry date are you looking at?", "score": 1, "replies": [{"body": "If I go 30% OTM bimonthly, that protects me from a 20% downturn. If the down turn is of 08 or even the fear spike of 2020…I’d pay my house off three times over.", "score": 1, "replies": []}]}, {"body": "If you locked into a 4.25% interest rate, count your blessings. I get your concept but I think you have completely underestimated both the \"cost\" of this makeshift insurance and how horribly imperfect the inverse REIT's are over time (and particularly options on inverse REIT's). (1) Heloc's carry an interest cost, (2) options are subject to time decay and a total loss at expiration, (3) inverse REIT's are already imperfect tools that don't claim to track the market beyond a single day and can end up losing value over time due to compounding and volatility even when the direction of your bet is correct (4) the REIT's are based on a housing index that will almost certainly diverge from your local market conditions, especially over time, (5) you're distorting that further with the premium and bid/ask spreads on those options, which may be excessive since such options see only light trading.  Hypothetical: I didn't do much searching, but the only inverse REIT I could quickly find with January 2025 options (to cover you till you sell in 2025) is DRV, a 3x inverse REIT.  Share price currently $46.49. These can drop quickly as you can see between 10/25/2023 ($71.18) to 12/28/2023 ($33.30). If you look at almost any long-term chart of these leveraged inverse ETF's they all appear just as an insidious and continuous drop in net asset value as they are not designed to cover any strategy longer than 1 day! From the prospectus: \"For periods longer than a single day, the Fund will lose money if the Index’s performance is flat, and it is possible that the Fund will lose money even if the Index’s performance decreases over a period longer than a single day. An investor could lose the full principal value of his/her investment within a single day if the Index gains more than 33% in one day.\" So your bet can be 100% correct, yet due to a compounding effect and other factors DRV might now come anywhere near reflecting 3x the market loss, and might in fact STILL be down since (another prospectus warning): \"the volatility of the Index may affect the Fund’s return as much as, or more than, the return of the Index.\"\n\nWith all of that said, with DRV share price at $46.49, and the highest strike price available for Jan 2025 at 49, with those calls priced at $990 each (e.g. $9.90), you buy 10 of them and there's your $10,000.\n\nSay the real estate market crashes. In order for you to get your $100,000, the share price of DRV would need to jump to 149 (that would leave intrinsic option value at $10,000 per option x 10 = your $100,000). That's 3x the current net asset value of DRV. Ignoring all of the issues with the compounding and volatility, let's pretend the fund can indeed track the market over extended periods (it can't). That would imply the Real Estate Select Sector Index (the index to which DRV offers short exposure) would need to drop 100% to zero, a total wipeout of equity values, and then you'd have a lot more to worry about than your $100K equity. So of course, absent nuclear war, that's a near impossibility, made even more impossible by the compounding and volatility issues that affect the index over time, with no guarantee that DRV has increased at all from the time you bought those options. All the while paying mortgage interest on a Heloc for money that may not be around for long.\n\n\n\n\"", "score": 1, "replies": [{"body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I wouldn’t yolo 10K into a 1 year option lol.\n\nI’d scale in month to month with 3-month options, $800 per month…obviously letting them expire worthless so that I don’t get spread-boned twice. In 08 AND 2020, the inverse REITs increased 300% within 35 days. \n\nI’m a strong believer in a market crash, because at this point, I don’t see any other way the Government can suck money out of the system. Inflation is REALLY about 100% in the last 4 years. \n\nAt 2% per year, they’d have to stifle growth for 50 years to combat this ridiculous spending spree.\n\nSo what to do? \n\nCrash the market, by 50%. That’s the best way to make all that inflation go “poof”.", "score": 1, "replies": []}]}, {"body": "I wouldn't go from owning to renting. My experience is that whatever you expect to happen in the market, even if it happens, it happens much later than expected. If you do want to hedge, buy some puts on real estate ETFs 1.5 yrs out and don't look at it, and enjoy the new house!", "score": 1, "replies": [{"body": "I talked to a lot of boomers, ok? Most of them took YEARS (10-15) to break even on their home.\n\nI literally put $6,000 down. Equity is $100,000. I’d rather have that much to invest on the next SPY pullback, then have it in a house. I just don’t want to lose it when the market crashes…\n\nI’ve hedged everything I could so far. A few thousand in crypto, to hedge my bonds. A few thousand in copper, to hedge inflation.\n\nThe last asset to hedge is my equity. I didn’t know if there was any other way to hedge against a housing market crash other than inverse residential REITs?", "score": 1, "replies": [{"body": "My point is: a home is worth something on paper, and nobody owning a home for 20+ years is in a loss, regardless when you bought. Rates are more likely to come down, not further up. The 08 crash had way different mechanics compared to what the market is rn. House crash is probably a result of market crash, bad economic conditions and people needing money. And/or interest rates that go through the roof. That means selling bonds....you can't hedge everything with everything as when shit hits the fan, it all goes down except your hedge, that's a net loss regardless of what happens.", "score": 1, "replies": [{"body": "Sounds like they need to stop whining and let the free market do its work.", "score": 2, "replies": [{"body": "And have fun living your life. Take opportunities, not hedge against risks", "score": 1, "replies": []}]}, {"body": "The hedge though, is essentially 100x leverage on an already 3x leveraged Inverse REIT. \n\nIt’s a 300 bagger if the market downturns.", "score": 1, "replies": [{"body": "Careful there in how that product is structured! Those leverage REITS only work on short time-frames, not on long ones. Check the LT chart....they degrade over time due to the financing.", "score": 1, "replies": [{"body": "Yes they do, I’m aware. That’s why you have to scale in and out of the options on them, not just throw money down and hope for the best.\n\nThank you!", "score": 2, "replies": [{"body": "All good, looks like you did your research! Hope it all works out!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Wow. \n\nFunny how he references 2008.\n\nScary posts like this might bring 2008 back.", "score": 1, "replies": [{"body": "My family lost everything in 2008. I was a child, nothing I could do.\n\nI’m willing to hedge in any way I can, they proved in 2008 that they will lie at the top and panic at the bottom.", "score": 1, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Sell the house and naked short spy puts with the money. ![img](emote|t5_2th52|31224)", "score": 1, "replies": [{"body": "I’m thinking BKNG.\n\n1500:1 return on a 70% drop in 3 months.\n\nAnd who’s gonna be traveling luxury during WW3? 😂", "score": 1, "replies": []}]}, {"body": "Everyone saying there no bubble in comment means we are actually in a bubble. Dump all ur money in inverse reit asap", "score": 1, "replies": [{"body": "Now see that’s not the right idea either lol\n\nMy trading account has that luxury. I just want to PROTECT my assets lol", "score": 1, "replies": []}]}, {"body": "Damn bro too many steps to lose 10k\n\nThe worst part is you are planning to sell a house to move somewhere else and live on rent", "score": 1, "replies": [{"body": "I know, but all my family lives there!", "score": -1, "replies": []}]}, {"body": "Unless you know what you're doing, you should sell house and buy a new one or rent in Texas and rent out Cali house. Don't go from owning to renting... it will be the worst decision you'll make in your life.", "score": 1, "replies": []}]}
{"title": "$95 Billion foreign aid package", "selftext": "[removed]", "id": "1c99cql", "created_utc": 1713674135.0, "score": 20, "upvote_ratio": 0.68, "num_comments": 90, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Bullish.... Going right back to American companies", "score": 40, "replies": [{"body": "So buy more RTX or LMT?", "score": 1, "replies": []}, {"body": "😅 more like back to the bidens \nLlcs", "score": -29, "replies": []}]}, {"body": "95 billion, more like chicken feed.", "score": 60, "replies": [{"body": "We can just keep printing more money right?", "score": 14, "replies": [{"body": "Brrrrrrrrrrr", "score": 5, "replies": []}]}, {"body": "Feeding the buzzards, if you think about it", "score": 1, "replies": []}]}, {"body": "Spy calls. ", "score": 8, "replies": []}, {"body": "79% of the Aid package to Ukraine regime will be staying in USA to replenish their own stock piles. 13.7 Billion will be given to the Ukraine regime as a loan. Most of the money just goes back into the military industrial complex.", "score": 27, "replies": [{"body": "> Most of the money just goes back into the military industrial complex\n\nbroken windows fallacy\n\n> 13.7 Billion will be given to the Ukraine regime as a loan\n\nin name only right? since it's forgiveable?", "score": -19, "replies": [{"body": "> broken windows fallacy \n\nGeopolitical stability is the basis of American prosperity. Might as well call fixing cracks in your foundation the \"broken windows fallacy\".", "score": 19, "replies": [{"body": "Mark my words,  the US government is going to forgive the US government for the US government debt owned by the US government.", "score": 7, "replies": []}]}, {"body": "I think you need to look up what the broken windows fallacy is, because it's not that.\n\nThe US enforced full payment after it lent to Britain in 1946 to rebuild and it was only paid off in 2006. No reason to think it would forgive any loan to Ukraine. Besides, $14 billion is a rounding error in the $10 trillion government budget. It's not even 2% of the military budget.", "score": 12, "replies": [{"body": "> rounding error\n\nstill insult to injury when we don't have sufficient healthcare, education, housing at home", "score": -9, "replies": [{"body": "The US has some of the best care in the world. Get a decent job with a few grand premium and you're golden. ", "score": 5, "replies": [{"body": "it's the best for anyone with a lot of money\n\nnot every American has that kind of money, let alone find a decent job in these times\n\n> a few grand premium \n\na 56% majority of Americans could not afford a $1000 emergency expense\n\nthere are also many Americans who have health insurance but for whatever billing or coverage reason, they still end up with multi-million dollar bills\n\nmedical bankruptcy is the number one cause of personal bankruptcy in the US", "score": 4, "replies": []}, {"body": "U sure we live in the same US? If so i think you mean dont get a job, live under proverty level and get cheap world class healthcare. Get a job, make decent money and pay a few grand premium so that you have shitty healthcare while paying huge deductible", "score": 1, "replies": []}]}, {"body": "And that is done by design, lol. When people tell you what they are going to do when they get elected, don't be surprised when they actually do it.", "score": 1, "replies": []}, {"body": "That's a political issue not an economic one, Americans lack the unity as a people to protest the government and demand better conditions. France sets entire cities on fire when they talk about raising pension age. You live in the richest country on earth and refuse to protest the artificial scarcity the wealthy have put you in.", "score": 0, "replies": [{"body": "politicians don't give a shit, they're happy to give billions more to their weapon company lobbyists\n\n> France sets entire cities on fire\n\nAmericans barely did a fraction of that on Jan6 and they were shot dead and most of them are now rotting away in jail", "score": 1, "replies": []}]}]}]}, {"body": "Yes in name only, we should actually just refuse to go along with the charade and call it what is it, free cash", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 37, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "they could double taxes on the wealthy and they’d still pay the same effective rate. No balls to fix the loop holes.", "score": 15, "replies": []}, {"body": "If they mandated that any tax increases on the rich would go directly to paying down debt, I'd be all for it. But let's be honest - any taxes they collect will go to some new dumbass spending bill.", "score": 5, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Tax the super rich not the poor", "score": 1, "replies": []}]}]}, {"body": "Austerity doesn't fucking fix inflation. It has nothing to fucking do with it. All it does is make economic recessions turn into depressions.\n\n\nGod damn man. We have a century of research on how this shit works. This nonsensical thinking is what created the Great Depression.", "score": 6, "replies": [{"body": "spending the same/or less than the amount of money you collect is not austerity - it's called not being a fucking idiot.", "score": -2, "replies": []}]}, {"body": "Ok comrade", "score": 3, "replies": [{"body": "what’s your point, i wish you could elaborate", "score": 4, "replies": []}]}, {"body": "Uhh. Government spending isn’t what causes inflation.", "score": -17, "replies": [{"body": "well if you spend money you don't have, you have to print money to fulfill that spending, so yes inflation in the end", "score": 6, "replies": [{"body": "Let's see, 200+ trillion in assets. 35 trillion debt. Largest military in the world. Largest alliance in the world. Largest disbursement of nukes. And the entire money printer. Largest GDP. Yeah, bearish. ", "score": 2, "replies": [{"body": "> 200+ trillion in assets\n\nprivate assets can't be arbitrarily seized, this ain't a commie society\n\n> Largest military in the world. Largest alliance in the world. Largest disbursement of nukes\n\nneeds money for all that\n\n> And the entire money printer\n\nhence the inflation if you print to spend what you don't have from taxes", "score": 3, "replies": [{"body": "You have a clear misunderstanding of how a national debt works. Who is talking about private assets or seizing? What fuckin speedball are you on right now?", "score": 2, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}, {"body": "More spending means issuing more bonds at a juicy 5%+ means old fixed rate bonds that are all less than 5% will continue to crash\n\nPuts on bond ETFs maturing in 7-20 years (TLH, IEF, etc).", "score": 3, "replies": []}, {"body": "Were building Marine bases on [Guam](https://www.sacbee.com/news/investigations/the-public-eye/article2588151.html) as well as underground bunkers to protect the civilian population. Ukraine is an exercise to evaluate our future military strategies and preparedness. Everything is being set up to fight inflation with a war, but before then we're going to spiral higher and into a recession", "score": 3, "replies": []}, {"body": "Most of it will be spent on Americans in the form of purchases of weaponry and hardware, and services of Americans. We're not giving cash to these people.", "score": 16, "replies": [{"body": "[We’re absolutely paying for Ukrainian pensions…](https://www.ft.com/content/925d2d15-57bf-4a1b-b010-4e009be85f5a). \n\nUSAID is on record for [$13 billion](https://www.factcheck.org/2023/02/bidens-april-2022-remark-about-some-ukraine-aid-covering-pensions-is-not-breaking-news/) in direct payments or “direct budget support”. That’s HR speak for a direct deposit. \n\nYou can dig through [every Ukraine bill to find this funding](https://news.yahoo.com/ukraine-receives-another-international-assistance-100701568.html). It’s a smaller portion of these gargantuan bills but still billions of dollars.", "score": 23, "replies": [{"body": "Yep. The Ukrainians are getting cash as well. The EU has also donated lots of money to keep the country going. Besides arms this is what is needed for them to be able to fight and hopefully win.", "score": 5, "replies": [{"body": "So nice to see the American congress willing to pay for those pensions. Wonder when they’ll get around to the pensions of their own constituents.", "score": 1, "replies": [{"body": "What a dumb, sad little worker bee worrying about those above him.", "score": -3, "replies": []}]}]}]}, {"body": "broken windows fallacy", "score": 1, "replies": [{"body": "What", "score": 4, "replies": []}, {"body": "thank you i didn’t know this economic theory", "score": 1, "replies": [{"body": "we spent over $2 trillion on the Afghan War just to replace the Taliban with the Taliban\n\nyou can imagine what $2 trillion could have done here at home for a lot of people instead of enriching a few weapon companies", "score": 8, "replies": [{"body": "i agree. if i may add, those $2T enriched politicians ad well", "score": 2, "replies": []}, {"body": "You think that is wild. I think it was Brown University that estimated the full cost of the \"War on Terror\" which is 9/11 to the end of the Afghan war, was roughly...\n\n8 trillion dollars. It also killed like 4.5 million people, displaced almost 40 million people, and is going to be the primary driver of America's insolvency - imagine our debt load less the 8 trillion dollars plus it's compounding interest.", "score": 1, "replies": [{"body": "we somehow went from squabbling over $10 Trillion in debt to blowing past $34 Trillion", "score": 1, "replies": [{"body": "Ah, the classic game of pass-the-debt. It's no surprise that it has escalated so quickly, and it will be intriguing to see how high the numbers can climb.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[removed]", "score": 7, "replies": [{"body": "You’re an imbecile", "score": -2, "replies": []}]}, {"body": "Lockheed, ratheon puts?", "score": 4, "replies": []}, {"body": "Rookie numbers", "score": 2, "replies": []}, {"body": "Fk the american tax payer.", "score": 2, "replies": [{"body": "You're being taxed on foreign aid? You understand that your gov can QE at will and these \"aid packages\" are actually loans right? It's why the US became the worlds powerhouse after WW2.", "score": 1, "replies": [{"body": "You understand no foreign aid loans get paid back ever right? You understand QE doesn’t last forever and its not just free money right? You understand government spending doesn’t result in higher taxes it just increases debt that has to be paid by taxpayers 100 years from now right? You understand that unlike domestic government spending foreign aid doesn’t increase our gdp and increases our trade deficit right?", "score": 1, "replies": [{"body": "In this same thread there's a discussion where it's pointed out how nearly all loans from WW2 were paid back, even as late as 2016. If you think the 27 trillion debt is ever going to be paid off by taxes you live in a dream world. Deficit spending goes up every year and is over a trillion anually. The american debt ceiling is a game of smoke and mirrors politicians love to play, because artificial scarcity stops people from asking for more and keeps the discussion of resource allocation between the middle class. Debt is a bill of past spending, as long as there's GDP growth and ways to outsource inflation, the magic debt number simply does not matter.", "score": 0, "replies": []}]}]}]}, {"body": "Shoulda got calls on RTX and LMT. Stayed green last week.", "score": 1, "replies": []}, {"body": "Last thing I want to hear is hot conflict between China and Taiwan. It's very clear that giving money to these countries doesn't solve the problem, but nobody is really making efforts to make peace.", "score": 1, "replies": [{"body": "The \"peace\" by china is when they take Taiwan. The \"peace\" by Russia is when they absorb Ukraine.", "score": 1, "replies": []}]}, {"body": "It means our country is literally fucked, and all politicians are doing rn is trying to rob it’s tax payers for all their worth… every last penny", "score": -7, "replies": [{"body": "No. It means status quo. Bullish.", "score": 4, "replies": []}, {"body": "Money for thee and not me", "score": -1, "replies": [{"body": "Unfortunately yes", "score": -1, "replies": []}]}]}, {"body": "[removed]", "score": -4, "replies": [{"body": "No. You gotta maintain supremacy.", "score": 4, "replies": []}, {"body": "No one's gonna vote for that get your fantasies outta here ", "score": 1, "replies": []}]}, {"body": "it means more red", "score": -2, "replies": [{"body": "Nah. You can't imagine the market failures if US stops being world police. This is Bill means big green dildos. ", "score": 10, "replies": []}]}, {"body": "I’d be more worried about the student loan forgiveness nonsense and other stimulus spending from this moronic administration and how that will affect inflation than the foreign aid which will just add more to the staggering $34+ trillion national debt that this president couldn’t care less about…", "score": -13, "replies": [{"body": "Both things add to inflation because they require the government to print more money to stay funded", "score": 3, "replies": []}, {"body": "> that this president couldn’t care less about\n\nno living politician gives a shit cause the debt bomb is going to explode long after they're gone\n\nsuch is the end state and collapse of most vote-buying democracies", "score": -1, "replies": [{"body": "That’s poetic and idiotic at the same time", "score": 1, "replies": [{"body": "that's because the majority of this country's voters are idiots who vote for lying politicians that promise the moon\n\nas a result, we have a Social Security pyramid scheme and no politician has the guts to deal with it", "score": 1, "replies": [{"body": "I agree but we did have one who tried to privatize social security years ago to address this issue but too many ignorant fools in DC balked…", "score": -1, "replies": [{"body": "it's a fundamental issue with the very concept of democracy and an ignorant electorate\n\nundisciplined people will always vote for free shit and we'll always end up in the same mess", "score": 2, "replies": [{"body": "Agreed, because they’re weak and don’t care about the greater good. We’re in a sad state and it will only get worse for future generations who only seem to care about climate change but are ignorant regarding how this debt is going to strangle them", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Man, fuck all this foreign aid. And why Taiwan? They could easily afford to purchase weapons and equipment from America, but we're still giving them free shit anyway? Ugh....", "score": -11, "replies": [{"body": "🤡", "score": 4, "replies": [{"body": "Good of you to self-identify. Now go read a book, child.", "score": -7, "replies": [{"body": "When you self identified questioning why Taiwan? You have to be in the negative mentally to not grasp that situation lmao", "score": 7, "replies": [{"body": "I grasp it better than you, chump.", "score": -5, "replies": [{"body": "\"  Man, fuck all this foreign aid. And why Taiwan? They could easily afford to purchase weapons and equipment from America, but we're still giving them free shit anyway? Ugh....\" 😭😭😭😭😭😭", "score": 5, "replies": [{"body": "Are you autistic, regarded, or both? You don't come off as intelligent or educated.", "score": -1, "replies": [{"body": "🤡", "score": 7, "replies": []}, {"body": "Okay windowlicker.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}
{"title": "SOXL, SQQQ, & XXXX - Major Market crash upcoming", "selftext": "I would suggest everyone to buy 33.3% of each SOXS, SQQQ and SPXU and hold it for the next few months. Buy the calls and stocks after the dip. My forecasts indicate that the S&P has around 10% left to dip before it stabilizes and Nasdaq a solid 15%, semiconductors a solid 25%. \n\n- CPI is running wild, few months ago I told everyone we would hit 3.5% CPI around now and 4-5% by summer and everyone laughed at me here and said CPI would come down to 2% by now and we'd have 7 rate cuts this year\n\n- CPI wil hit around 5% by summer as oil rates, insurance, and housing continues to rise\n\n- There will be no rate cuts this year, in fact there's a chance for a rate increase\n\n- AI isn't adding any meaningful earnings to stocks, income is only rising because of costs cuts and employees being fired\n\n- Middle East war, possibility of China invading Taiwan, Trump getting elected, Ukraine losing the war\n\nIt's very smart to invest into SOXS, SQQQ & SPXU and oil/health stocks for the next few months to weather out the upcoming crash. You can buy your calls and NVDA stock for $400 each at summer.\n\n\nMy portfolio at the moment\n\nSOXS - 20%\n\nSQQQ - 15%\n\nSPXU - 15%\n\nUNH/ELV/LLY - 25%\n\nOXY, CVX, XOM - 25%", "id": "1c9qsla", "created_utc": 1713728789.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 94, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 35 | **Previous Best DD** | \n**Account Age** | 3 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "I’ve been trying to get people to call me Freddie knuckles", "score": 1, "replies": []}]}, {"body": "my forecasts indicate that you are regarded", "score": 230, "replies": [{"body": "this new WSB has stopped being funny without having a reason why you have an opposite position. but you don't, cause you're regarded and ghey", "score": 1, "replies": []}, {"body": "My forecasts were right last week. If you bought SOXS like I said to on 4/6/24, you'd be up 42% by now. How much are you up in the last 2 weeks regard?", "score": -92, "replies": [{"body": "Zoom out and how much you up?", "score": 56, "replies": [{"body": "Lmao exactly. Last 1 week hella down. Last 1 year still up decent", "score": 9, "replies": []}]}, {"body": "...and his epitaph shall read: “I was right one week.”", "score": 43, "replies": []}, {"body": "would you suck it omfg", "score": 7, "replies": []}, {"body": "\"I've made a good call before so I must always be right\"", "score": 3, "replies": []}, {"body": "Bad forecasts can sometimes be accurate. ", "score": 1, "replies": []}, {"body": "You can start a YouTube channel with this attitude", "score": 1, "replies": []}]}]}, {"body": "Your post history tells me all I need to know", "score": 114, "replies": [{"body": "jesus fuck 💀", "score": 35, "replies": []}, {"body": "Quite literally a gay bear", "score": 28, "replies": [{"body": "The man is the meme. Respect.", "score": 2, "replies": []}]}, {"body": "Thank goodness for default blur.", "score": 20, "replies": []}, {"body": "How did this happen again ![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)", "score": 17, "replies": []}, {"body": "I read your comment, clicked his profile, and now I am scarred for life. Thank you fren.![img](emote|t5_2th52|4260)", "score": 9, "replies": []}, {"body": "LOL", "score": 7, "replies": []}, {"body": "![img](emote|t5_2th52|51295)", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 5, "replies": []}, {"body": "Oh man. I remember this dude now.", "score": 2, "replies": []}, {"body": "WHY GOD PLEASE NO", "score": 2, "replies": []}, {"body": "My forecast indicates that excessive self-creampie's have damaged OP's frontal cortex.", "score": 2, "replies": []}, {"body": "Hooooly cow", "score": 1, "replies": []}, {"body": "I predicted last week's dip.", "score": -50, "replies": [{"body": "Broken clocks", "score": 34, "replies": [{"body": "Broken something.", "score": 5, "replies": []}]}, {"body": "So did I and everyone else not sure what your point is?", "score": 3, "replies": []}]}]}, {"body": "“My forecasts indicate” 🤓\n\nShut up nerd", "score": 41, "replies": [{"body": "\"My foreskin indicates\"", "score": 16, "replies": [{"body": "'My perpuce has forseen'", "score": 3, "replies": []}]}]}, {"body": "I’m not taking advice from a guy that says clitty", "score": 47, "replies": []}, {"body": "Not this dick again. What a weird kink, shitpost to trick users into looking at your dick?", "score": 21, "replies": []}, {"body": "People that cherry pick their past stock predictions to validate themselves, especially non-professionals, are on their own level of stupid.\n\nI don’t disagree about the market pulling back a bit further (not a crash though lol), but I’ve always had the most success when I don’t listen to people like you. OP has a few good weeks on a market pullback and now thinks he’s got incredible foresight?\n\nIt’s called confirmation bias, homie. Your forecasts are useless.", "score": 25, "replies": []}, {"body": "your reddit profile is fucking disgusting", "score": 20, "replies": [{"body": "?", "score": -12, "replies": [{"body": "Self-awareness is a dying virtue lmao", "score": 10, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}, {"body": "Not taking advice from the dude posting his dick on Reddit. Fuck you.", "score": 8, "replies": [{"body": "do you know what 4chan is", "score": 1, "replies": []}]}, {"body": "Ok Nostradamus, on it now.", "score": 7, "replies": []}, {"body": "i had to sift through an unreal amount of degenerate posts to find this gem\n\nhttps://www.reddit.com/r/wallstreetbets/s/U2YJklP8f6", "score": 6, "replies": [{"body": "Lmao. 5% of the time it works all the time though!", "score": 1, "replies": []}]}, {"body": "Just like everyone else was wrong, as you say. You can be wrong too.", "score": 5, "replies": []}, {"body": "Fuck off", "score": 6, "replies": []}, {"body": "I hope you don't manage your funds like you do your reddit karma ...", "score": 6, "replies": []}, {"body": "I would recommend shorting companies that hire the poor. And soon...", "score": 21, "replies": [{"body": "Guillatin manufacturer’s futures are bright from what I read on various Reddit groups.", "score": 2, "replies": [{"body": "See the French just get it. ", "score": 1, "replies": []}]}]}, {"body": "Calls it is", "score": 6, "replies": []}, {"body": "you do know soxl is a semi bull etf right? peak regard level research here", "score": 7, "replies": [{"body": "SOXS", "score": -7, "replies": []}]}, {"body": "I’ll get forecasts from my foreskin thank you", "score": 8, "replies": []}, {"body": "!remindme 30d", "score": 3, "replies": [{"body": "I will be messaging you in 1 month on [**2024-05-21 20:50:54 UTC**](http://www.wolframalpha.com/input/?i=2024-05-21%2020:50:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1c9qsla/soxl_sqqq_xxxx_major_market_crash_upcoming/l0nd65m/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1c9qsla%2Fsoxl_sqqq_xxxx_major_market_crash_upcoming%2Fl0nd65m%2F%5D%0A%0ARemindMe%21%202024-05-21%2020%3A50%3A54%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201c9qsla)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "If you said all this 2 weeks ago I would agree but it’s like you forgot everything that just happened lol…. all of this is priced in homie . Market got smoked on that CPI data, AI and chip makers got smoked not showing profits and then we had the crazy futures night because of possible war.", "score": 3, "replies": []}, {"body": "Your forecasts don’t mean shit, mind sharing what method you used to forecast this 10% dip in the market? inversing your overconfident ass", "score": 3, "replies": []}, {"body": "Since everyone here is inversing you, I have to inverse them to inverse wsb, so I guess that means I agree. I am now the gheyest of bears.", "score": 3, "replies": []}, {"body": "Oh, your \"forecasts\", straight from your chrystal ball. Thanks for that. Let me correct just one thing: Trump would be great for stocks, see 2016-2020 chart. But by all means, let the downvotes commence.", "score": 8, "replies": [{"body": "trump rode out whatever work obama put in and then burned it to the ground lmao", "score": 1, "replies": [{"body": "As Jamie Dimon pointed out, Trump was right about more things that he is given credit for. He was right on China, and he was right about the tax reform.", "score": 0, "replies": [{"body": "studies after studies prove that cutting taxes is bad in the long run", "score": 1, "replies": [{"body": "I'm sorry, I don't agree with that at all. How is cutting taxes bad for the average person, and for the companies. And, it takes care of the inflation.", "score": 1, "replies": [{"body": "[https://equitablegrowth.org/six-years-later-more-evidence-shows-the-tax-cuts-and-jobs-act-benefits-u-s-business-owners-and-executives-not-average-workers/](https://equitablegrowth.org/six-years-later-more-evidence-shows-the-tax-cuts-and-jobs-act-benefits-u-s-business-owners-and-executives-not-average-workers/)\n\n[https://www.forbes.com/sites/simonconstable/2023/05/31/corporate-tax-cuts-dont-always-lead-to-more-jobs-new-research-says/](https://www.forbes.com/sites/simonconstable/2023/05/31/corporate-tax-cuts-dont-always-lead-to-more-jobs-new-research-says/)\n\n[https://www.cbpp.org/research/federal-tax/the-2017-trump-tax-law-was-skewed-to-the-rich-expensive-and-failed-to-deliver](https://www.cbpp.org/research/federal-tax/the-2017-trump-tax-law-was-skewed-to-the-rich-expensive-and-failed-to-deliver)\n\n[https://www.cbsnews.com/news/tax-cuts-rich-50-years-no-trickle-down/](https://www.cbsnews.com/news/tax-cuts-rich-50-years-no-trickle-down/)\n\n[https://www.cbpp.org/research/federal-tax/after-decades-of-costly-regressive-and-ineffective-tax-cuts-a-new-course-is](https://www.cbpp.org/research/federal-tax/after-decades-of-costly-regressive-and-ineffective-tax-cuts-a-new-course-is)\n\n[https://academic.oup.com/ser/article/20/2/539/6500315](https://academic.oup.com/ser/article/20/2/539/6500315)\n\n[https://www.lse.ac.uk/research/research-for-the-world/economics/tax-cuts-for-the-wealthy-only-benefit-the-rich-debunking-trickle-down-economics](https://www.lse.ac.uk/research/research-for-the-world/economics/tax-cuts-for-the-wealthy-only-benefit-the-rich-debunking-trickle-down-economics)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "A couple of Green Days are on deck before the real decision for the bears has to be faced", "score": 2, "replies": [{"body": "Agreed.", "score": 1, "replies": []}]}, {"body": "Can I buy the aforementioned / suggested stocks with your money? Would be great.", "score": 2, "replies": []}, {"body": "Most likely, there will be a retest of highs on the sp500 before a major pullback", "score": 2, "replies": []}, {"body": "I say SQQQ hit 20 next month. Teach has lost its steam", "score": 2, "replies": []}, {"body": "It’s wild how sheeple everyone is. How much they buy into the media and doom and gloom. Dude we had a major run up driven by great earnings and future productivity and cost efficiencies driven by AI and companies going leaner. Market was always going to cool off a bit. A 5-10% is so normal after a huge run. We’ve already dropped 6% so sure, could be a few % to go, but I wouldn’t short there. Just buy the dips in good companies and hold. That’s the better advice.", "score": 2, "replies": []}, {"body": "Why is it that every time there is a red day, or 3, people flock in masses to say the sky is falling. 6 red days of SPY and everyone says I told you so but doesn’t point out the other posts they were wrong about either.\n\nNext week I’m going to make two posts. One will say SPY will be $520 by EOM and the other will say SPY will go to $469 by EOM. Whichever is closest to correct will still and I’ll delete the other, then tell everyone that I told them it was going to happen.\n\nNot saying this is you, but it definitely seems like errrrbody is saying there is more air to let out of the balloon. Which means the market will do the opposite", "score": 2, "replies": []}, {"body": "Don't tell me how to lose my money!!", "score": 2, "replies": []}, {"body": ">My forecasts indicate that the S&P has around 10% left to dip before it stabilizes and Nasdaq a solid 15%, semiconductors a solid 25%.\n\nhttps://preview.redd.it/0i64w4vonxvc1.jpeg?width=348&format=pjpg&auto=webp&s=78e6bca420125b232ff3196280ae4807535c5eb4", "score": 2, "replies": []}, {"body": "Ooooof, rip.", "score": 2, "replies": []}, {"body": "why would you buy SOXL now if you predict semiconductors have 25% left to dip?", "score": 3, "replies": [{"body": "SOXS", "score": 0, "replies": [{"body": "Buy put options then pussy", "score": 3, "replies": []}]}]}, {"body": "Why hold SOXL and SQQQ\nDid you mean SOXS?", "score": 2, "replies": [{"body": "Yeah SOXS", "score": 0, "replies": [{"body": "I’m holding calls on oxy Futures look week on oil ![img](emote|t5_2th52|4260)", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "OXY, CVX, and XOM, 3 of the worst run operators in the business, congrats on the trifecta. You’ll ride the wave of oil price but it won’t be on good fundamentals. XOM Guyana is about the only thing worthwhile here, so much so Chevron is willing to buy Hess for 53 billion just to taste Guyana", "score": 1, "replies": []}, {"body": "Regard knows nothing about decay enjoy the losses lol", "score": 1, "replies": []}, {"body": "Gonna inverse all of this", "score": 1, "replies": []}, {"body": "Trump gets elected... qqq and spy rocket up...", "score": 1, "replies": []}, {"body": "Bers getting desperate. Now they are straight up telling everyone the sky is falling", "score": 1, "replies": []}, {"body": "$rycey kids", "score": 1, "replies": [{"body": "Bought since covid... guud choice!", "score": 1, "replies": []}]}, {"body": "Buy SOXL, got it!", "score": 1, "replies": []}, {"body": "Stuff may fall, sure, especially if Taiwan has problems since NVDA depends on them, as do many others\n\nNVDA at 400 tho? ehhh\n\nAlso this wave be risin before it be fallin", "score": 1, "replies": []}]}
