{"title": "Place your bet guys - “Brace for the S&P 500 to crash 30% before an even bigger collapse after the election, markets guru David Brady warns”", "selftext": "", "id": "1c6t0b4", "created_utc": 1713409360.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 88, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1009 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "80 percent?   Then it would be easy for everyone to become a millionaire from that point on.", "score": 71, "replies": [{"body": "As a 30 year old I wouldn't mind a few crashes before I retire lol", "score": 23, "replies": [{"body": "Literally the perfect time. Not as broke as 18 but enough money and time to take advantage, haha", "score": 12, "replies": []}, {"body": "Shit man I’m 40 and wouldn’t mind a solid crash. My 401k will suffer but recover. I’ve been doing short swings for a while, you give me a 50% crash? I’m going full port and retiring earlier than planned 🤣", "score": 7, "replies": []}]}, {"body": "Sure, but $1,000,000 is the new $100,000", "score": 38, "replies": [{"body": "Exactly.  Then a super huge wealth gap.", "score": 8, "replies": []}]}, {"body": "Nothing comes easy for the people of this sub", "score": 1, "replies": []}]}, {"body": "@Mods permaban David Brady. No positions or nothing. Message them and ask for permaban bet.", "score": 89, "replies": [{"body": "Needs hyphens around “market guru”", "score": 11, "replies": []}]}, {"body": "fuck that noise, S&P 1000 foh\n\nhttps://preview.redd.it/k4i8o04vp5vc1.png?width=1080&format=pjpg&auto=webp&s=cea0e08e206c0655ab4e39a68c6666eb99ddc2c6", "score": 25, "replies": [{"body": "Shit would be wild and would be an amazing opportunity to get rich. That’s if money even matters at that point since it’d be Great Depression levels of recession.", "score": 26, "replies": [{"body": "It’s so completely impossible with the US Fed existing. If we even dipped past 4000 there would be so much legislation passing so fast. Nobody is letting that happen. \n\nThis guy should be fired into space on a rocket for even saying this.", "score": 35, "replies": [{"body": "We already saw how dovish Powell became when it hit 4200 in October. It's like these guys don't remember. The Fed practically begged for the stock and bond market to loosen up.", "score": 12, "replies": []}, {"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Exactly. They’re only great buying opportunities if you have money waiting in the sidelines.", "score": 5, "replies": []}, {"body": "Every crash they introduce new safety-nets, like the plunge protection team and quantitative-easing.\n\nRegardless, imagine Apple and Google having a P/E under 15\n\n![img](emote|t5_2th52|29637)", "score": 4, "replies": [{"body": "#&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Yup most investors commenting on Reddit only know the Covid crash and v shaped recovery. They assume every crash from here on out will be just like that. So many surprises pikachu faces incoming.", "score": 5, "replies": []}, {"body": "I was looking at it too thinking we have to test 4200", "score": 2, "replies": []}, {"body": "I started in 2017.  I'm a late starter.  I only saw one crash.  That was epic.  My coworker was running around the office, \"Time to buy, time to buy, what you buying?\"  I got excited and started buying.  Even bought OXY when crude oil futures prices went negative.  I was like WAAT?!?  Like I would ever pull up to the pump, and it would say, take all you want, we'll pay you $1/gallon, take take take, here's your money.  YA RIGHT.", "score": 1, "replies": []}, {"body": "MSFT in my regarded napkin calculations is worth at least 450 per share...", "score": 1, "replies": []}]}, {"body": "Haha big bear markets always surprise people how low they take the indices. Lower than you can imagine ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "What in the actual F\\*K!  Is he trying to sound intelligent?  If so, why not just say zero then...", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 76, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 0, "replies": []}]}, {"body": ">the most overvalued stock market we've seen perhaps since the great depression.\n\nSuch a short memory he forgot about the .com bubble...\n\n>He also flagged an uptick in bankruptcies, car repossessions due to auto-loan defaults, credit-card delinquencies, and a slide in house prices.\n\nBankruptcies of all types are still lower now than they were before covid.car payments have balooned from inflation, yet defaults are barely above 2019 levels. And I'd love to know where he lives if the housing prices are sliding...", "score": 16, "replies": [{"body": "I think he meant the great recession, 2008. Even then, he’s still wrong. Covid prices were equally overvalued", "score": 3, "replies": []}]}, {"body": "This market guru is an idiot if he thinks that will happen before the election.", "score": 16, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Before an incumbent presidential election*", "score": 3, "replies": []}, {"body": "Nor was 2000", "score": 1, "replies": []}]}]}, {"body": "lol.. this guy knows what’s going to happen!!", "score": 7, "replies": []}, {"body": "Who the fuck is this clown", "score": 13, "replies": [{"body": "Nostradumbass", "score": 29, "replies": [{"body": "He can predict the future the day after it happens with his butt", "score": 4, "replies": []}]}, {"body": "A Jeremy Grantham copycat", "score": 0, "replies": []}]}, {"body": "Awesome! Making money then buy in at the dip Dee dips ![img](emote|t5_2th52|4271)", "score": 13, "replies": []}, {"body": "what are this guru's positions besides reverse cowgirl?", "score": 7, "replies": [{"body": "🧐", "score": 1, "replies": []}]}, {"body": "\"Our unwavering conclusion: Never bet against America.\" - Warren Buffett\n\nI dare say Mr B has a better track record of success", "score": 6, "replies": []}, {"body": "Eat my shit 30% lmao", "score": 5, "replies": []}, {"body": "SPY will go down to 490$ tomorrow. Once it is down/break 500$ then it will be difficult to stay on $500", "score": 12, "replies": [{"body": "that’s what i’m saying. i’m seeing $494 as the minimum for tmrw, gonna make puts at $499 i think it’s safe. then i’ll do some for qqq as well", "score": 2, "replies": []}]}, {"body": "Goofy", "score": 5, "replies": [{"body": "Donald", "score": 0, "replies": []}]}, {"body": "What tf is a markets guru lol?", "score": 3, "replies": []}, {"body": "They do this every time. The only way they can get the economy + 30% is to literally stop the transfer of money by locking everyone in their homes.  The economy is pretty strong despite what the analysts say. Yeah it's going to come down but to collapse. Nah. We will have a war before that ever happens. The market loves war.", "score": 14, "replies": [{"body": "The \"economy\" is not pretty strong right now, just because the markets are doing well, doesn't mean debts arent way up, foreclosures/defaults aren't way up. You are basing it off the markets in a group full of autistic morons who literally gamble their life savings away on penny stocks", "score": -7, "replies": [{"body": "Foreclosures and defaults aren’t higher than pre Covid. GDP is up. Fuck you mean?", "score": 7, "replies": []}, {"body": "Where did you get the debt and default info?", "score": 5, "replies": [{"body": "I have a buddy that is friends with a guy that knows this kind of stuff", "score": 11, "replies": []}]}]}]}, {"body": "Remember when Burry shorted the market predicting a major downturn & guaranteed recession last year? The year ended with record gains lol. Lesson is, don’t be the sheep listening to donkeys. These guys have money they can afford to lose, you don’t", "score": 3, "replies": []}, {"body": "Keep saying crash long enough and you'll be correct eventually ", "score": 3, "replies": []}, {"body": "Just buy the furthest out at the cheapest price and sit on it.. just in case.", "score": 6, "replies": []}, {"body": "Yeah… if I knew this was coming I wouldn’t tell you regards shit. Therefore, dude is full of shit.", "score": 5, "replies": []}, {"body": "Just 30%? What a loser 🐻. I predict 80% drop and sun explodes.", "score": 4, "replies": []}, {"body": "Hi, I’m JP Murgen, this will happen i can gurentee it", "score": 4, "replies": []}, {"body": "Business Insider must post click bait doom articles daily. Before I even clicked it, I knew this headline would be from Business Insider.", "score": 2, "replies": []}, {"body": "So 30% (3650) befor Nov? Don't think so. We will see 6800 befor that. These people come out of the woodwork when we have a small correction, every damn time.", "score": 2, "replies": []}, {"body": "I wish there is a law to post a win/loss record beside anyone writing stuff like this. i.e how many of their past predictions were right. I'd be shocked if any of them are batting above 500.", "score": 2, "replies": []}, {"body": "S&P will be $550 by September 2024. 🔮", "score": 3, "replies": [{"body": "The S&P 500? Or the SPY?  😆", "score": 8, "replies": []}]}, {"body": "LOL not a chance. Buy the dip aggressively", "score": 1, "replies": []}, {"body": "Lol and what spx multiples go to like 10x?", "score": 1, "replies": []}, {"body": "How LONG after the election?", "score": 1, "replies": []}, {"body": "Would be nice to finally have the dip of all dips to buy ![img](emote|t5_2th52|31225)", "score": 1, "replies": [{"body": "you missed out tesla on monday?", "score": -1, "replies": []}]}, {"body": "Thank God for the warning from our marker guru", "score": 1, "replies": []}, {"body": "Priced in, everything, fucking everything is priced in", "score": 1, "replies": []}, {"body": "Historically markets increase on election years leading up to November 19/23 election years which is 83%", "score": 1, "replies": []}, {"body": "This is just a small correction before the reversal anyone clamoring for a crash is dumb ![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "not even gonna read article. who gets elected? lol", "score": 1, "replies": []}, {"body": "Ohhh… buying opportunity!", "score": 1, "replies": []}, {"body": "Ah yes the allmighty clown", "score": 1, "replies": []}, {"body": "Gay", "score": 1, "replies": []}, {"body": "What a clown.", "score": 1, "replies": []}, {"body": "What is his track record lol", "score": 1, "replies": []}, {"body": "This is my dumbest shit I’ve ever read. Everyone is now dumber for having read it. I award David Brady no points and may God have mercy on his soul.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "If the market crashes 30% we all getting rich🤣🤣", "score": 1, "replies": []}, {"body": "I'll agree that it's gonna go down, but only because it's only gone down.  When it goes up, I'll agree that it's going up.\n\nWhen people say the market is gonna crash, they must mean in slow motion.  It's like we drove up to a brick wall, touched it, and continue to step the gas.  The damage is slowly taking affect on the car, but it's not like 100MPH impact.", "score": 1, "replies": []}, {"body": "Why are you guys cheering for crashes is beyond my understanding.   \nWhere would you get a sizable amount of money from when all is -50% including your own stocks. Not like you have 200k sitting on your bank account in cash.", "score": 1, "replies": []}, {"body": "So they're blaming a hypothetical crash on Trump, hypothetically.", "score": 1, "replies": []}, {"body": "GTFO with this same paywall link over and over. \n\nYou bears are fukt.\n\nTake your remaining pennies and buy some green dildos.", "score": 1, "replies": []}, {"body": "I am betting his is right about post election action.  I have no idea about what’ll happen between now and then.", "score": 0, "replies": []}]}
