{"title": "I'm buying more. Let's see how this ages post earnings.", "selftext": "EDIT (4:34PM) - Aging well for now I see! \n\nTake this with a grain of salt. I'm a long-term investor (5-15 years) I've read most research reports and considering how autistic Elon is I think there will be a nice lil rally after earnings tonight. The stock is trading near 2023 lows... Even if it goes lower to $100 I'll just buy more. people keep trying to say whether the stock is fairly priced but don't forget there is no exact comparable to this company... Finance is all about theories. People that say its overvalued are either boomers or those who believe in last decade financial theories that MAY or MAY NOT hold with this specific situation. Have y'all forgotten the previous rally? do you think Tesla is in a better place TODAY vs. then? feel free to bash me but TO THE MOON", "id": "1cb7kmm", "created_utc": 1713886350.0, "score": 38, "upvote_ratio": 0.63, "num_comments": 93, "comments": [{"body": "You can DCA into it.  No one can nail bottom for sure. Selling some options on this also not such bad idea.", "score": 11, "replies": []}, {"body": "Aged life fine wine!", "score": 7, "replies": []}, {"body": "The problem is that when you promise so much and don't see anything resolved after a long time, many doubts arise. Tesla is betting on the robotaxi, it has no other backup plan, car sales figures are falling in China and other markets, they made terrible decisions, the cybertruck was one of them, dojo half dead, 4680 was presented as something revolutionary and It only remains in words, so much so that Tesla has to buy batteries from other manufacturers, there is no news about the semi, another bet that the company made and no one knows what its current pace is, Optimus is far away, things are not going as planned because there is no very clear orientation", "score": 11, "replies": [{"body": "More than half of the ppl here never believed in him anyway like it matters.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Are you referring to the incident in 2022 where the car was on autopilot (not FSD)? This one: https://gizmodo.com/tesla-motorcycle-crash-death-autopilot-washington-1851428850?", "score": -2, "replies": [{"body": "It occurred last week. It was a 2022 Model S.", "score": 2, "replies": [{"body": "Ah, my bad, the article I linked is misleading - the picture in the article seems to be from an unrelated crash altogether, and that crash occurred in 2022. Still, according to the article it was not on FSD, so this is basically like saying it’s the car manufacturer’s fault if someone looks at their phone while using cruise control (which just maintains speed).\n\nNot sure why your original comment is deleted though?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}, {"body": "Probably the opposite. The stock seems to always go down right after Elon talks, even when there is lots of good news. Mainly because he is normally talking about things many quarters out, and Wall St only cares about the past and next quarter. While energy looks up, deliveries are down, and production layoffs drive home longer term downturns. Combine that with price cuts (lower margins), and it doesn't look good near term.", "score": 7, "replies": [{"body": "well, he did say optimus and 25k vehicle will be rolling out EOY and that Robo Taxis demo will be in August.\n\nHow all that happens in 8 months, who knows, but after market seems gaga over the earnings call. So, good luck.", "score": 3, "replies": [{"body": "The market had priced in no 25K vehicle on the horizon.  So that's the reason for the bump.\n\nThe question now is can they deliver?", "score": 4, "replies": []}]}, {"body": "That aged well", "score": 2, "replies": [{"body": "Apparently there are still enough gullible people who believe an announcement of the near term production of a cheap Tesla. That IS what they have should have created and produced instead of the odd CT. Now with the Chinese 25% corporate income tax for 2024 that is killing income, they are under the gun to do something quick that will increase outside of China profits from less than full run plants.\n\nShow-me, I don't believe it will happen in the time-frame stated, but rather in Elon time. I'd love to be wrong (still have some stock), but doubt I am.", "score": 2, "replies": []}]}, {"body": "exactly because of what you said you should be thinking about buying at these prices for the future years... BUT you are wrong... Wall St always cares about the future years cause that changes their model assumptions and therefore the price..", "score": 3, "replies": []}]}, {"body": "I am a fan, owner of a m3, and share holder but curious what others think the future holds for Tesla and why are you so bullish?", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "99% of their revenue comes from selling cars....", "score": 6, "replies": []}, {"body": "What tech outside of making cars are they leaders in?", "score": 4, "replies": []}, {"body": "How much does tesla earn on tech vs what they earn in cars? You might think it will become a tech company in the future. It's a car company now. That is not an opinion. It's a fact", "score": 3, "replies": [{"body": "Yes but the stock market prices a company for its future not the present", "score": 1, "replies": [{"body": "Not true. The stock is based on near future. Not far. Elon promises keep being pushed forward into the future. Tesla is very far away from being a tech company.\n\nThe stock price might be great in 5 years. Might. But wall street doesn't care about 5 years from now. They care about 2024 and 2025. That's it", "score": 3, "replies": [{"body": "I agree but I care about 5 years from now. I guess we'll see what happens!", "score": 1, "replies": [{"body": "I’m with you on that, but I’m much less bullish now as compared to four years ago.  Elon’s infatuation with Twitter, his extreme political views, and his neglect of Tesla do not bode well.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Maybe the fact they’ll have 85,000 nvidia Gpu’s running by year end.", "score": 1, "replies": []}]}, {"body": "Congratulations!", "score": 3, "replies": [{"body": "Congratulations!", "score": 2, "replies": []}]}, {"body": "I’m with you! Bought 4 more shares this morning!", "score": 3, "replies": []}, {"body": "5-15 years?! That’s a big range lol", "score": 4, "replies": [{"body": "I read it that way too, but I think OP is saying they plan to sell in 5-15 years, not that they got in 5-15 years ago.", "score": 2, "replies": [{"body": "Mmmm yeah", "score": 1, "replies": []}]}, {"body": "Not really... within 5 years I will start seeing some big returns so will sell starting from then.", "score": 3, "replies": [{"body": "ok now I get what you are saying", "score": 2, "replies": []}]}, {"body": "To be fair 5 years ago is right when the hype started. So he’s saying he’s still up >700%", "score": 2, "replies": [{"body": "She\\* ;)", "score": 2, "replies": [{"body": "Same. Sorry!", "score": 2, "replies": []}]}]}]}, {"body": "Hopefully he provides an update on the Roadster and when \"you will summon your car from NYC to LA\" makes it to FSD.  And an update on DOJO.   Something more than \"march of 9's\" and how hard production at scale is", "score": 5, "replies": [{"body": "all these sound so unrealistic atm", "score": 5, "replies": []}]}, {"body": "If you’re lucky you will see a more mature and rounded business plan reap rewards in a post Musk era.", "score": 2, "replies": []}, {"body": "could it be that tesla is not worth 10 times as much as ford.", "score": 2, "replies": [{"body": "Yeah keep thinking that. This is the most ridiculous argument clueless people like you have been spitting out for years while Tesla has grown and grown.", "score": 0, "replies": []}, {"body": "They are in two different categories. If people thought Ford is the same as Tesla the Tesla would NOT be (or would have never been) 10 times as much as Ford.", "score": -1, "replies": []}]}, {"body": "Looks like it’s the bottom.. if anything.. we can wait until q2 and post same thing hahahaba", "score": 2, "replies": []}, {"body": "Looks like they did pretty well. Just a little less no big deal. Still billions in the pockets.", "score": 2, "replies": [{"body": "You sure about that? Did you read the earnings? \n\n$26.9B cash vs $29.5B liabilities. That’s a 2.6B deficit. \n\nDays payable outstanding is up from 63 back to 75 days and AP is up vs. Q4. Does that sound like a healthy balance sheet to you?", "score": 2, "replies": [{"body": "I’m not gonna ever tip a valet driver ever again in 3 years.", "score": 1, "replies": [{"body": "Yeah because Summon doesn’t run into walls right now does it?", "score": 2, "replies": []}]}]}]}, {"body": "You done good.\n\nI was prepared for a shit show of a conference call and a continued drop in the stock price to $100. I’m very pleased with what I heard.", "score": 2, "replies": [{"body": "I was so right... fuck yeah", "score": 0, "replies": [{"body": "Honest question, why the hell is the stock up so much after such an abysmal earnings report? I just don't get it. (Even though I'm a shareholder and I want to see the price go up).", "score": 2, "replies": [{"body": "prices dropped because of analyst donwgrades after rumours that they are scrapping M2 but they aren't and in fact delivering it earlier than anticipated. watch this it explains more. [https://www.cnbc.com/video/2024/04/23/watch-cnbcs-full-interview-on-tesla-earnings-with-wedbushs-dan-ives-and-gerber-kawasakis-ross-gerber.html](https://www.cnbc.com/video/2024/04/23/watch-cnbcs-full-interview-on-tesla-earnings-with-wedbushs-dan-ives-and-gerber-kawasakis-ross-gerber.html)", "score": 1, "replies": []}, {"body": "The stock price post earnings is usually more a reflection of guidance than of the financial results of the quarter. In this case the financial results were in line with expectations so that was already baked into the stock price. Looking forward, which is what the stock market does, a lot of fears were allayed. For example, the $25K car has not only not been cancelled, it’s been accelerated. Lathtup is scaling on schedule. 4680 production is ramping such that the Cybertruck ramp will not be slowed. Optimus is proceeding well. Cybertruck production is ramping nicely. Tesla is talking to at least one car maker about licensing FSD. There was a lot to be optimistic about.", "score": 1, "replies": []}]}]}]}, {"body": "I'm loaded up on calls and leaps. No idea where the bottom is, but they're cheap so yolo. If it falls I buy more. Eventually it will work.", "score": 3, "replies": []}, {"body": "earnings will be trash.", "score": 2, "replies": []}, {"body": "It's a moonshot company that is cash flow positive at its worst. Your risk is that it will take a long time to see a return,  but there is no conceivable way they go bankrupt imo.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "To the moon 🌕", "score": 1, "replies": []}, {"body": "Down 5% minimum. Price cuts on everything, cyber truck issues, no one wants a new M3, rumors around the 25k vehicle being cancelled, interest rates high, BYD winning in China, Rivian looking good in the US. There is really nothing positive for Tesla right now other than their model y sales and how low expectations are.\n\nThat being said, if you believe in the company long-term, these are the days you need to be DCA'ing. I'm bullish long-term, but don't see much good news on the horizon in 2024.", "score": 1, "replies": []}, {"body": "I'm in it because they have other income sources like chargers and charging stations.  Not sure if their solar company is included.", "score": 1, "replies": [{"body": "Yes it is. Tesla Energy Operations Inc.", "score": 1, "replies": []}]}, {"body": "Why don't you buy half today and then possibly decide not to buy the other half tomorrow?", "score": 1, "replies": []}, {"body": "i’m just shorting tesla for now. not bad. would prolly get back to swing trading it when it is trending upwards. my main concern is the resignation of important executives. hmm TSLA is ideal for long term investment", "score": 1, "replies": [{"body": "That's my main concern rn too tbh but they might have received better comp packages", "score": 1, "replies": [{"body": "More layoffs announced prior to close as well. About 6k total from CA and TX and 280 in NY", "score": 1, "replies": [{"body": "That's good news tho", "score": 1, "replies": []}]}]}]}, {"body": "Earnings in 25 minutes. \nI think it popped in anticipation but it'll fall tomorrow.", "score": 1, "replies": [{"body": "they released the data already what r u talking about lol", "score": 1, "replies": [{"body": "Oh I read they release it at 530PM EST. My bad.", "score": 1, "replies": [{"body": "The call itself is at 530PM :)", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Tesla Q1 2024. \n\nRevenue -9%  \n\\*Automotive -13%  \n\\*Energy Gen. & Storage +7%  \nGross Profit -18%  \n\\*marg. 17.4% (19.3%)  \nEBIT -56%  \n\\*marg. 5.5% (11.4%)  \nAdj. EBITDA -21%  \n\\*marg. 15.9% (18.3%)  \nEPS -53%  \nFCF -674%", "score": 1, "replies": []}, {"body": "Your time horizon is 5 to 15 years, but FSD still won't be ready in that time frame.", "score": 1, "replies": []}, {"body": "TSLA has a disastrous quarter, stock goes up 15% because Elon made more false promises", "score": 1, "replies": []}, {"body": "I hope you’re able to influence as many people as possible. I want to recover my cost basis so I can get off this insane merry go round with Musk.", "score": 1, "replies": []}, {"body": "You were right… $192", "score": 1, "replies": []}, {"body": "RemindMe! 6 months", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Image/Link submissions are manually reviewed due to spam control. -1B\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Comment on this post please in 6 months.", "score": 1, "replies": []}]}, {"body": "There are plenty of companies to compare to, you just won’t like the results of that comparison.", "score": 1, "replies": [{"body": "Tell me which ones", "score": 1, "replies": [{"body": "Hyundai, Ford, VW, Audi, Mercedes, BMW, and GM to name a few. \n\nAll of these companies get the vast majority of their revenue from car sales, just like Tesla.", "score": 1, "replies": [{"body": "absolutely not. If those companies were comparables why would Tesla be trading at completely different multiples than all those companies? The market itself doesn't even see them as comparables which is why its priced differently. As soon as everyone starts to think Tesla goes into the same bucket then Tesla will have same multiples as those companies but as far as I'm aware none of the companies you mentioned have FSD or a humanoid project in progress...", "score": 1, "replies": [{"body": "Because tesla is grossly overvalued because the CEO keeps making promises he can’t keep and people keep eating it up… despite a long history of not delivering on other promises.\n\nFrom a finance perspective, they are 100% comparable companies.\n\nWhy do you think the stock is down 60% in just a couple short years?\n\nAll of those companies have their own version of “fsd” which is essentially just cruise control. Hell Mercedes even has tech you don’t have to monitor. Something Tesla can only dream of with their current tech.", "score": 1, "replies": []}, {"body": "Hyundai owns Boston Dynamics...", "score": 1, "replies": []}]}]}]}]}, {"body": "Many comments seem to be deleted now that the stock is up 14%...", "score": 1, "replies": []}, {"body": "TSLA cannot be worth all other car companies combined and then some. This stock is headed to the $50 range at best. They are not an energy company, nor a tech company, nor an AI company, nor a semi company, nor a data company, nor a robotaxi company, nor an “insert new grift here” to pump the stock company. \n\nElon has exposed himself as someone who is unstable and quite flawed. The twitter spend destroyed his reputation cause it showed when left alone he will destroy a company and he started saying the quiet stuff out loud", "score": 0, "replies": [{"body": "People were shitting on him and saying the EXACT same arguments years ago before they got squeezed to the tits though... Am I wrong?", "score": 1, "replies": [{"body": "Fools never learn so don’t try explaining.", "score": 1, "replies": []}, {"body": "This time things are different. TSLA got nothing in the pipe and Elon has come out of the closet in terms of who he is", "score": 1, "replies": []}]}]}, {"body": "Lmao 5-15 years Tesla will have so much competition. Tesla is already behind the competition.", "score": 0, "replies": []}, {"body": "Those dumb old boomers! The chart and price action indicate a further falling price maybe to est. $100, but the volume and accumulation say it's a decent buy.", "score": 0, "replies": []}]}
{"title": "Tesla 100 options update", "selftext": "", "id": "1cb92f3", "created_utc": 1713889898.0, "score": 161, "upvote_ratio": 0.91, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 days ago\n**Total Comments** | 5 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "While you’re already up 100% and they expire this week, as well as earnings today you should sell because if TSLA goes down those calls go to 0", "score": 103, "replies": [{"body": "I second this. Take your money and run.", "score": 46, "replies": [{"body": "RIP. Tesla to the Mooooon", "score": 6, "replies": []}, {"body": "Wya now huh", "score": 1, "replies": []}]}, {"body": "I didn’t come this far to come this far", "score": 118, "replies": [{"body": "U can take ur profit and let ur original investment ride through", "score": 19, "replies": []}, {"body": "Well, I wish you good luck then that it works out. 🫡", "score": 20, "replies": [{"body": "Yeah, I'll be betting against him lol", "score": 22, "replies": []}]}, {"body": "You did SOOO well", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Brother I’m in with you ![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "IV crush gonna kill you.", "score": 1, "replies": []}, {"body": "Plz show us the friday value when it’s at 0", "score": 1, "replies": []}]}]}, {"body": "Sell right before close. IV may continue expanding today but tomorrow morning those will likely be worthless", "score": 43, "replies": [{"body": "So fucked no they won’t I’ve been playing earnings all year. They will probably just double but still he’s going to double 10k\nEdit: it’s like you’ve never even degenerated blown 5k pffft rookie", "score": 2, "replies": []}, {"body": "It rocketed and they'll still be red at open.", "score": 1, "replies": []}, {"body": "TSLA +12% after hours lol", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "Keep the 200$ calls 😂", "score": 10, "replies": []}]}, {"body": "Bro, the average for the last 4 quarters is like a 10.5% drop the day after earnings. And literally everyone knows they shit the bed this time (I suspect it is even worse than what might be priced in).", "score": 14, "replies": [{"body": "Lol and this quarter it goes up. Funny", "score": 9, "replies": []}, {"body": "Woops", "score": 4, "replies": [{"body": "Yep, Elon dicked put holders with vaporware. There is no way they are doing model 2 in less than a year.", "score": -2, "replies": []}]}]}, {"body": "Sell you tegard. Even with the right price move, IV will crush you.", "score": 13, "replies": [{"body": "not if the stock goes up to $170", "score": 3, "replies": [{"body": "Which it wont.", "score": 14, "replies": [{"body": "you never know", "score": 1, "replies": [{"body": "Of course not, hence you trade off probabilities. Currently delta for 4/26 170c is 0.083", "score": 1, "replies": [{"body": "its gettin kinda close we’ll see what the market does tomorrow", "score": 2, "replies": []}]}]}, {"body": "You were saying…?", "score": 1, "replies": []}]}]}, {"body": "Clearly, Most-Inflation-1022 needs to work on his risk management skills and learn to close his positions before expiration.", "score": 5, "replies": []}]}, {"body": "Take 80% of your profits and leave some runners", "score": 13, "replies": [{"body": "Good take. He should listen to you", "score": 5, "replies": [{"body": "Meh", "score": 2, "replies": [{"body": "MEH!", "score": 1, "replies": []}]}]}]}, {"body": "Dude sell it and cash in.", "score": 5, "replies": [{"body": "Tesla to the mooooon", "score": 2, "replies": []}]}, {"body": "Jim Cramer says Tesla will surge after earnings today ![img](emote|t5_2th52|4271)", "score": 5, "replies": [{"body": "Jim Cramer is an idiot. I say sell!", "score": 5, "replies": []}]}, {"body": "4/26 202 LOL\n\nThis guy is expecting Tesla to build rocketships to mars?\n\nOh wait..", "score": 4, "replies": [{"body": "No just robots", "score": 1, "replies": []}]}, {"body": "Sell some of them, don't be stupid", "score": 6, "replies": []}, {"body": "Hopefully you sold. FFS IV is going to absolutely destroy you overnight when the air is let out of the balloon.", "score": 5, "replies": []}, {"body": "This earnings call is going to be nuts ![img](emote|t5_2th52|29637). Loss porn/gains incoming.", "score": 5, "replies": []}, {"body": "That $202 call is a little…optimistic?", "score": 4, "replies": []}, {"body": "third", "score": 2, "replies": [{"body": "Fourth", "score": 1, "replies": []}]}, {"body": "The 202.5c ![img](emote|t5_2th52|51295)", "score": 2, "replies": []}, {"body": "I would so sell before close.", "score": 2, "replies": []}, {"body": "can someone tell me what the point of buying far out the money contracts? rather then just buying a few less of in the money?", "score": 2, "replies": [{"body": "If you aim 10x and not 10%", "score": 9, "replies": []}, {"body": "Much much higher returns on a quick spike movement. And if it does go near the OTM strike it’s a much higher return than an itm\n\nAlso less risk for an earnings play. Itm calls die anyways due to IV crush and theta", "score": 4, "replies": []}, {"body": "Those ITM contracts wont 100% like this one. OP made a great move, if he sells them now at high vol.\n\n\nIf he holds them to expiry when theyre 0.01, going this far OTM was stupid.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Lol, you dead. Those will get destroyed on market open tomorrow. IV crush and betting it will go the wrong way... Expect it to open with like -75%.", "score": 1, "replies": []}]}]}, {"body": "Theta burn buddy. Wish you sold. Tomorrow you will be sad.", "score": 2, "replies": []}, {"body": "I will buy these from you at a 95% discount in the am.", "score": 2, "replies": []}, {"body": "Looking forward to the update tomorrow. Thank you for your donation.", "score": 2, "replies": [{"body": "Tesla to the moooooon", "score": 1, "replies": []}]}, {"body": "That shit soaring after hours rn holy f", "score": 2, "replies": []}, {"body": "Congrats!! Your gamble paid off!", "score": 2, "replies": []}, {"body": "You about to be rich", "score": 2, "replies": []}, {"body": "Comments not realizing most of OP’s calls are at 167.5 strike, not 202.5. If we open tmmr at 165 OP is gonna rock.", "score": 2, "replies": [{"body": "Regardless, his exp is 04/26, so whatever it opens tomorrow at, his 167.5 will skyrocket to like $7 per contract. His 202.5 though, may not fair as well, but should also go up quite a lot.", "score": 3, "replies": [{"body": "OP is about to lose a grand total of 45$ on 202.5 calls. I am sure he’s gonna cry us a river😭", "score": 3, "replies": []}]}]}, {"body": "These will open up to like 12$+ or more tomorrow each. 100k by tomorrow. Congrats and fuck you.", "score": 4, "replies": [{"body": "Currently at 4.66 per contract. 40 large. Not a bad gamble.", "score": 1, "replies": [{"body": "Yah it’s after hours too this will be volatile tomorrow beware of Theta Decay and sell some profits prob open up wild high", "score": 1, "replies": []}]}]}, {"body": "Screw everybody don't sell. Lets see where this goes..", "score": 2, "replies": []}, {"body": "AH up already $10, this guys printing", "score": 2, "replies": [{"body": "Nah, he about to be IV crushed", "score": 4, "replies": []}]}, {"body": "Wow how wrong were some of these comments? 🤣", "score": 2, "replies": []}, {"body": "Don’t listen to these regards they’re all poor. Tesla will crush earnings and go up 50% making you a millionaire overnight", "score": 2, "replies": []}, {"body": "Quick question, if you were to \"sell to close\" and the counterparty decided to exercise the call option, would you have to sell them shares at that price?", "score": 1, "replies": [{"body": "No that would only be possible if he sold calls or “sell to open”", "score": 1, "replies": [{"body": "Isn't selling calls the only way he can close his position?", "score": 1, "replies": [{"body": "Yeah but that’s sell to close. It means he will close his position instead of exercising the option. When you buy a call and it expires in the money you can buy the shares at that price or just close the position and take the profit.", "score": 2, "replies": []}]}]}]}, {"body": "Dang. Love to see it.", "score": 1, "replies": []}, {"body": "Damn brooooo you got some BALLZ", "score": 1, "replies": []}, {"body": "3 day expiration mhm", "score": 1, "replies": []}, {"body": "So I should cancel my 202.5c 4/26 order for Wednesday?", "score": 1, "replies": []}, {"body": "So far out of the money tho 😭 even with a good move you’re risking the bag. If this would have been one ITM option you’d have been able to collect on the move tomorrow.", "score": 1, "replies": []}, {"body": "LEGEND ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|8882)", "score": 1, "replies": [{"body": "I don't know why you're telling me this, but I don't care about some random person's comment.", "score": 1, "replies": []}]}, {"body": "Sell half and see where the other half takes you", "score": 1, "replies": []}, {"body": "TSLA going to $200", "score": 1, "replies": []}, {"body": "Man your bought to get IV fucked. Why so far out of the money? 202.5 calls? Just burn your money.", "score": 1, "replies": [{"body": "He bought 9@$5 a piece. I don’t think he’s going to care about losing $45 when his 91 $167.5c rocket in the am", "score": 1, "replies": []}]}, {"body": "HOLD", "score": 1, "replies": []}, {"body": "I'm convinced I have brain damage, trying to learn options. How are you up $5k when your strike price hasn't even hit yet?", "score": -2, "replies": [{"body": "delete the app now.", "score": 2, "replies": []}, {"body": "Options prices go up as stock gets closer to strike price (delta and gamma), even if stock never hits strike price (option never goes ITM). Also IV is driving up the price, IV is especially high bc of earnings this week. But IV crush will start setting in tomorrow (since ER was today) and theta too (since these contracts expire on Friday)", "score": 0, "replies": []}]}]}
