{"title": "TESLA", "selftext": "[deleted]", "id": "kq2vn2", "created_utc": 1609741030.0, "score": 6, "upvote_ratio": 0.64, "num_comments": 47, "comments": [{"body": "I had a FOMO of this stock and decided to join the bandwagon in August 2020.  Been consistently buying every month and so far up 49%\n\nI don’t think it’s too late", "score": 7, "replies": []}, {"body": "Its a total gamble, and for that reason, I don't like it.", "score": 18, "replies": [{"body": "Boomer spotted", "score": 10, "replies": [{"body": "Let's go brota. We need to buy some more pltr 1/15 50c.\n\nThe boomer is gonna wash my yatch baby!", "score": 1, "replies": []}]}, {"body": "You do you. I’m all about finding an edge and then placing smart bets.", "score": 2, "replies": []}, {"body": "You must not be a trader then...How’s your managed portfolio coming along?", "score": -18, "replies": [{"body": "There's also such a thing as investors, and the most successful investors are a lot richer than the most successful traders.", "score": 6, "replies": [{"body": "And the most successful traders are a lot richer then most successful investors.", "score": -2, "replies": [{"body": "Yes, and most successful investors are are a lot richer than most successful traders.", "score": 6, "replies": [{"body": "Yes, and most successful traders are are a lot richer than most successful investors.", "score": -1, "replies": [{"body": "Ehm, no...", "score": 5, "replies": [{"body": "Ehm, yes...", "score": 0, "replies": [{"body": "How is that even possible? You agreed first and now you disagree?", "score": 1, "replies": [{"body": "No one disagreed. The most successful traders are are a lot richer than most successful investors.", "score": 2, "replies": [{"body": "Nice edit.", "score": 1, "replies": [{"body": "What edit?", "score": 0, "replies": [{"body": "Lol, this is just sad.", "score": 0, "replies": [{"body": "What’s sad and what edit? No one did any editing.\n\nIt’s a fact; The most successful traders are are a lot richer than most successful investors.", "score": 0, "replies": [{"body": "Mate, I'm not even gonna respond to this anymore. Pretty sure you're just trolling, but if not you might wanna think about what you're doing with your time...", "score": 1, "replies": [{"body": "It’s a fact; The most successful traders are are a lot richer than most successful investors.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "J5 design is total dweeb", "score": 1, "replies": []}]}, {"body": "Every stock is a gamble...", "score": 1, "replies": []}]}, {"body": "Still a buy if you plan on holding long; but you will never see 700% year again", "score": 10, "replies": [{"body": "imagine that. 700bn \\* 7 = 3.5T company.", "score": 0, "replies": [{"body": "In a few years", "score": 2, "replies": []}]}]}, {"body": "I predict it will hit 800 in 2021.", "score": 5, "replies": [{"body": "$1200", "score": 3, "replies": [{"body": "When will the stock split?", "score": 1, "replies": []}]}]}, {"body": "Stop looking at the stock price alone, look at the company. They have a ton of catalysts ahead and are looking to 2x revenue in 2021, but the stock is very richly valued. It's still a good buy, but don't expect to get more than 40% annual returns.", "score": 2, "replies": []}, {"body": "been riding since pre split, don’t plan on taking it out anytime soon unless convinced to", "score": 1, "replies": []}, {"body": "If you want to buy “tech-type” stocks I would start with apple, Tesla at this price level is pretty risky, I’m holding mine but not adding more", "score": 1, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "Pretty sure we are done with 2020 gains.", "score": 4, "replies": [{"body": "Now it’s 2021 gains", "score": 3, "replies": []}]}]}, {"body": "She’s up to 720 right now. All of you bears saying it’s overvalued probably just didn’t get this and only make 10% gains a year . If you want to make big boy money you got to buy big boy stocks", "score": -4, "replies": [{"body": "I got 1 share @ 400.\n\nAm I a big boy too?", "score": 1, "replies": []}]}, {"body": "Good question.  Im up 40%.  Time to sell or continue to hold?", "score": 1, "replies": [{"body": "I plan on holding long term. If it hits $1200 in q1 would consider selling part and try getting in at a better price. This is only recommended if you believe in it long term", "score": 1, "replies": [{"body": "Well it def aint doubling in the next 3 months. So I don't think 1200 is there for Q1. But if we see some great numbers going into 4th quarter 2021. Over $1000 is definetly achievable if the broad market remains bullish. S and P 4000 for example by year end.", "score": 0, "replies": [{"body": "It's unlikely, but not impossible. My point was that it would take a massive spike like that for me to consider selling off shares", "score": 2, "replies": [{"body": "Fair enough mate. Although I’ve been holding onto some shares from 400 from the announcement of a and p index inclusion until now and I’m starting to itch to want to sell some lol. It’s almost double from where I started!", "score": 1, "replies": [{"body": "I'm in exactly the same boat as you except I also bought in at ~1400 and sold at 2000, and don't want to repeat that. Just think where it'll be in 10 years", "score": 2, "replies": [{"body": "Lol exactly! To be honest. Last year with this stock and a few others I’ve traded. I was better off just holding. It’s just down to whether you believe this year we are better off trying to time the market. Or just holding it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’m holding long term. Musk is a visionary and crushes opponents. In musk we trust", "score": 1, "replies": []}]}, {"body": "Seems to be the sentiment on Tesla. If it does tank, I’d buy. But I doubt it takes, it’ll drop, but it won’t tank lile some analysts think it will", "score": 1, "replies": []}, {"body": "Technically speaking it’s already hit 2k pre split", "score": 1, "replies": []}, {"body": "It’s gonna hit 900 at least in 2021", "score": 1, "replies": []}]}
{"title": "Today I purchased alot of stocks for me, despite the market going down, is this a good idea?", "selftext": "Hi, I'm fairly new to investing and trading, and with the market going down today, particularly in tech companies like apple, amazon, and Microsoft I bought in, hoping that I good see the gains when it comes back up. from the small amount of knowledge I have I think this is a good idea a I can maximize gains from it however I have seen some people on here saying I should have sold rather than bought, especially with my tech stocks. can anyone let me know if this was a good Idea and whether I made the correct move or I should have sold today and bought back in when the market was less volatile?\n\nthanks", "id": "kqefjy", "created_utc": 1609784519.0, "score": 46, "upvote_ratio": 0.74, "num_comments": 57, "comments": [{"body": "Best times are red days. Nobody knows what’s going to happen, nobody.", "score": 65, "replies": []}, {"body": "If you're in it for the long run, chances are you'll be good. Market is never certain, though. If you invested in companies that you believe will prosper, you're on the right path, though.", "score": 64, "replies": []}, {"body": "could have got the same price probably 2-3 weeks ago, today is insignificant in the grand scheme of things", "score": 10, "replies": []}, {"body": "[deleted]", "score": 22, "replies": [{"body": "Agreed, although I'd argue this entire sub has become a sign the market is going to crash.", "score": 6, "replies": [{"body": "There’s so much liquidity and no yielding alternative assets (unless you want to get into a bidding war on a mediocre property) \n\nCant time it, but the volatility is obnoxious \n\nI’m just hoping the profit-taking on loftily valued shit doesn’t cause a run on the entire market", "score": 3, "replies": []}]}, {"body": "A beginner asking a question is a sign the market is going to crash??!! GTFO", "score": 9, "replies": []}, {"body": "Can’t crash is guys like this keep buying!", "score": -2, "replies": []}]}, {"body": "Yes it’s called the dip", "score": 29, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "And for it to be in the red, the price would've dipped.", "score": 0, "replies": []}]}]}, {"body": "yes, you buy on red days that's fine.\n\nI personally wouldn't go tech at this point. but they are OK choices if you believe in them.", "score": 13, "replies": [{"body": "EV, battery technology, IT security. AAPL and TSLA? Why wouldn’t you look at tech stocks now? Tech stocks will always be an enterprising portion of the stock market.", "score": 5, "replies": [{"body": "as i said go for them.", "score": 0, "replies": []}]}, {"body": "New investor here, why is tech not attractive anymore!?Is it because of Biden?", "score": -2, "replies": [{"body": ">Is it because of Biden?\n\nI don't see how Biden would lower the tech industry. Tech in my opinion is very attractive.", "score": 13, "replies": []}, {"body": "no, its attractive for many still.\n\nits just trading very high right now.  it might continue to go higher, but it makes me nervous personally.  COVID i think brought them higher.", "score": 6, "replies": []}, {"body": "Biden wont stop tech, the opposite will likely happen, Biden wont be as hard on tech as Trump has tried to be", "score": 5, "replies": [{"body": "It's pretty hilarious how, considering all the many, many legitimate reasons for politicians to go after Big Tech, they always choose the dumbest, most illegitimate reasons (\"Facebook is biased against Republicans!\").", "score": 1, "replies": []}]}]}, {"body": "You prefer the memes over tech?", "score": 1, "replies": [{"body": "The memes are tech...", "score": 1, "replies": []}]}]}, {"body": "Red days are the first, but not the only, indicator for me to look for buying opportunities.", "score": 4, "replies": []}, {"body": "Yes", "score": 3, "replies": []}, {"body": "Don't sell on a tiny gain.\n\nIf you're buying for the long-term, hold for the long term", "score": 3, "replies": [{"body": "^ Take this advice OP!\n\nI bought AMD at $10 and sold for a 5% gain when it traded sideways. Really stupid of me, especially considering it's a $100 stock now.", "score": 3, "replies": []}]}, {"body": "Buffett, and some greek guys way back, have said that it's good to look left when everyone's going right, or be brave when others are fearful, and vice versa.  So it depends on your strategy.  If you're a technical trader it depends.  If you're buy and hold it's fine", "score": 3, "replies": []}, {"body": "Those are some solid picks so well done.\n\nHow long do you plan on holding your positions?", "score": 2, "replies": [{"body": "im trying to invest long term and got lots of Christmas money so have been investing that, haven't made as much as I thought I would so far but maybe that's just because the markets a bit volatile right now and I've diversified too much, and picked a few bad stocks. but honestly don't have a clue", "score": -4, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "yeah sure, i took a few companies like dover corporation from William Akerman's hedge fund and bought into them after it did really well last year, and then over the past few days that has gone down by around $4 today so I bought in at that low of $123, don't know how fast it'll bounce back but it's in an industrial manufacturing firm and rn my portfolios mainly tech so I needed to invest else where", "score": 2, "replies": []}]}]}]}, {"body": "Just keep them for a long time.", "score": 2, "replies": []}, {"body": "If you are in it for the long run, it is good to buy low (specifically with those stocks). They'll go back up eventually.", "score": 1, "replies": []}, {"body": "I bought the dip as well. My trend criteria were met to sell off about 15% of my portfolio, and I turned around and reinvested those funds in stocks that met my buy criteria. My portfolio flips 100% every 2-3 months.", "score": 1, "replies": [{"body": "Wow sounds like a horrible strategy", "score": 6, "replies": [{"body": "It's a modified ichimoku trend strategy, and it works pretty well for me.", "score": 1, "replies": []}]}]}, {"body": "Yes its totally fine but don't panic tomorrow if the market takes a deep dive because of the election. I also bought a little today and have my wallet ready for tomorrow if any of the companies from my \"solid stocks list\" goes way down (apple is definitely on that list).", "score": 1, "replies": []}, {"body": "Bad idea. Buying on green days is also a bad idea. Maybe it’s a good idea. Who knows.", "score": 1, "replies": [{"body": "But what kind of dipping sauce is best for chicken McNuggets? Hint, there’s only one right answer.", "score": 2, "replies": []}]}, {"body": "Could be a sell off if Dems win Georgia runoff. Don’t panic tho", "score": 0, "replies": []}, {"body": "Hoping for a few more red days this week. This could be the start of a proper correction and a good buying opportunity.", "score": 1, "replies": []}, {"body": "All the stocks you named are going to rise long run anyway, so even if you do have a short term loss, just wait it out and you're good", "score": 1, "replies": []}, {"body": "If you can’t handle the marking going down 2% in a day you shouldn’t be investing.", "score": 1, "replies": []}, {"body": "People are selling, in part, because with the VIX up 28% at it's high today, they have to cut exposure to reduce their portfolio's P/L swings.", "score": 1, "replies": []}, {"body": "large companies like Microsoft tend to be solid choices. buyin' in the low is usually a good thing. now is the difficult part, don't panic and hold.", "score": 1, "replies": []}, {"body": ">however I have seen some people on here saying I should have sold rather than bought, especially with my tech stocks\n\nNo one knows anymore than even the most experienced traders. I bought some MSFT today too. Buy regularly, don't buy dumb stocks or get overconfident in your trading ability, stick to a plan, and you'll make out fine.", "score": 1, "replies": []}, {"body": "Buy the dip", "score": 1, "replies": []}, {"body": "Doesn't matter. 30 years from now your stocks will be worth twice what they are now if you chose stocks like apple, amazon, etsy, disney, coca cola -- all boomer stocks basically", "score": 1, "replies": []}, {"body": "You should find out before investing your money. I would sit aside and watch .Remember \"don't panic\".", "score": 1, "replies": []}, {"body": "The last thing u wanna do is listen to a 22 year old telling u that u shoulda sold instead of bought more.\n\nAssuming u’ve done research on ur companies and they have legit/solid fundamentals, getting in the habit of buying on red days like these is how u go from 8-12% roi to 15%+. \n\nThe argument is u don’t wanna catch a falling knife but in most cases the fact that ure buying on red days is usually the way to go to optimize returns", "score": 1, "replies": []}, {"body": "Better than buying the day before.", "score": 1, "replies": []}, {"body": "Very similar post to what I was thinking the last few days. Thank you! 😃", "score": 1, "replies": []}, {"body": "At least you didn't buy 3k worth of AMD stock at ~98 a share on Dec. 17. I lost like 400-500 easy.", "score": 1, "replies": []}, {"body": "Don't buy when it's red, buy when it's up 2% again AFTER the correction/red. \n\nNever try to time the market though", "score": 1, "replies": []}, {"body": "Just try to think of it as buying a stock at discounted price. Buying the DIP's a good thing.", "score": 1, "replies": []}, {"body": "Buying stocks when the market tanks is only when you buy.  When it’s going up that’s when you sell.  Never forget this.", "score": 1, "replies": []}]}
{"title": "PLTR has fallen like 9 out of 10 last days and it’s starting to p*ss me off", "selftext": "The past week or so has been brutal for this stock. Why is that? It seems that no good news can bring this stock back up, and I’m wondering why that is. Look at other “meme stocks“ like Tesla, and they go up for no reason. Why can’t PLTR do something similar? Yeah it’s up since it’s DPO, but the last week has been miserable. Disclaimer: I have January 2022 leaps at $30 strike currently down 15 K and it’s got me wondering if I should sell. Just looking for a conversation about why the stock is performing so poorly.", "id": "kqjysk", "created_utc": 1609800109.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 57, "comments": [{"body": "2022 leaps. Calm your tits man, that's a year away.\n\nAlso, I think people are cautious about the lockout period.", "score": 31, "replies": [{"body": "A year christ time flys", "score": 9, "replies": []}]}, {"body": "You bought options on the peak ya dumb dumb. That’s why it’s going down", "score": 14, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "**notgreatwithstocks** , KMINDER on [**01-Jul-2021 00:00Z**](https://www.reminddit.com/time?dt=2021-07-01 00:00:00&reminder_id=b424ebc0b30c49f88b34bc9e666dcfa7&subreddit=stocks) (5.9 months)\n\n> [**stocks/Pltr_has_fallen_like_9_out_of_10_last_days_and**](/r/stocks/comments/kqjysk/pltr_has_fallen_like_9_out_of_10_last_days_and/gi49nc0/?context=3)\n\n> 2022 leaps idk why your even looking right now\n\n[**2 OTHERS CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202021-07-01T00%3A00%3A00%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fstocks%2Fcomments%2Fkqjysk%2Fpltr_has_fallen_like_9_out_of_10_last_days_and%2Fgi49nc0%2F) to also be reminded. Thread has 3 reminders.\n\n^(OP can )[^(**Add email notification, Update remind time, and more options here**)](https://www.reminddit.com/time?dt=2021-07-01 00:00:00&reminder_id=b424ebc0b30c49f88b34bc9e666dcfa7&subreddit=stocks)\n\n**Protip!** I have a head on Reddit and an ass on [Twitter](https://twitter.com/remindditbot)\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Fuel Me](https://paypal.me/reminddit)", "score": 0, "replies": []}]}, {"body": "Why would you put that much in options? You could of bought shares and sold covered calls for 2 years and made way more with almost no risk.", "score": 13, "replies": [{"body": "He’s clearly trying to stuff his own ass", "score": 14, "replies": []}, {"body": "Because I am dumb", "score": 8, "replies": []}, {"body": "I'm very dumb and bought 2K shares at 28.40. \n\nI just started learning about options, and really stuck to purely investing in shares the previous few years. \n\nAnyway today I sold 20 covered calls with a 28.50 strike price for $0.61 premium, which equals $1,220. I'm down an obscene amount on PLTR, but should I just keep doing covered calls for 28.50 until either it's too far out of the money to make money, or it finally hits the strike and I keep all the premium I've ever made? Do you think that's a good strategy?", "score": 1, "replies": [{"body": "What date", "score": 1, "replies": [{"body": "Sorry, 1/22 EXP", "score": 1, "replies": [{"body": "How much are you down on contract %\nEdit wrong reply, why are you selling leaps?", "score": 1, "replies": [{"body": "I just looked at the numbers again. I have 20 covered calls for $0.65 exp 1/22. \n\nCurrently the same contract can be purchased for $0.55. So I'm in the money $200 to buy back right now.\n\nEdit: this is for January 22nd. Sorry, not January 2022.", "score": 1, "replies": [{"body": "I wouldn’t sell leaps, if you’re long. You will end up buying back for insane amount or get exercised. I’d sell weeklies, or monthlies", "score": 1, "replies": [{"body": "This is for January 22nd. Sorry, not January 2022.", "score": 2, "replies": [{"body": "Yea that’s not that bad, I’d sell shorter than that, and use money to dca. In all honesty, you shouldn’t of let yourself go that down. \nI waited for this drop because I knew it would be bad, you need to set up limit orders, or trailing stops.\n\nThe way you’re reacting I can tell you put almost all your money into it and that’s fine because you will be ok long term but short term I have no idea.\n\nThat much money is a lot even if you have millions\n\nDo you have other positions? Or is this it?", "score": 1, "replies": [{"body": "This represents like half of my robinhood. But yeah I'm not planning on selling the shares at a loss, are you personally long on Palantir?", "score": 2, "replies": [{"body": "Yea I’m long but I’m bearish more than everyone else here. I try not to let emotions get into it.\n\nI’m honestly expecting, it to drop below 20. And if it does I’ll buy more, if it doesn’t I’m good with what I have. I bought at 12$ sold at 28, and got back in at 23", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "10 days? what am i even reading here lmao", "score": 7, "replies": []}, {"body": "You have many moons until expiration. Patience young grasshopper", "score": 6, "replies": []}, {"body": "Everyone's waiting for the lockup period to buy. Just relax baby, PLTR will moon after earnings.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Why? I’m actually very nice and sweet.", "score": 8, "replies": [{"body": "Name checks out", "score": 4, "replies": []}]}]}, {"body": "This is what happens when you follow a meme stock from Reddit without doing your DD", "score": 9, "replies": [{"body": "He bought when I.V was jacked should have just bought shares .\n\nNothing wrong with meme stocks at all", "score": 8, "replies": [{"body": "Nothings wrong with them but if you don’t do DD you’ll get burnt like him", "score": 4, "replies": [{"body": "DD wasn’t the issue , the issue is he doesn’t understand the Greeks whatsoever", "score": 2, "replies": [{"body": "I'm very dumb and bought 2K shares at 28.40. \n\nI just started learning about options, and really stuck to purely investing in shares the previous few years. \n\nToday I sold 20 covered calls with a 28.50 strike price for $0.65 premium, which equals $1,300, expiring January 22nd.  I'm down an obscene amount on PLTR, but should I just keep doing covered calls for 28.50 until either it's too far out of the money to make money, or it finally hits the strike and I keep all the premium I've ever made? Do you think that's a good strategy?", "score": 2, "replies": []}]}]}]}]}, {"body": "Oh jeez my stocky-wocky doesn’t consistently go up and to the right every day on the charts?? Stocks can move up OR down without any discernible reason?? Someone plz explain I was told “stonks go up”. My stonk tripled after IPO but now its down a little bit? Someone plz call mister Warren Buffer because this stuff doesn’t make sense! How can stock go down, does this mean there is more selling than buying?? 🤔\n\nPeople on Reddit said stock good, yet today, and last week, stock bad. Does this mean Reddit isint right? Plz someone hold my hand and do the thinking and analysis for me, just tell me the ticker/strike/expiry and I’ll take your word 👍🏻👌🏻 k thx", "score": 12, "replies": [{"body": "The bloke asked a question, don't need to be a bell-end about it", "score": 8, "replies": [{"body": "It’s a joke, welcome to the Internet.", "score": 3, "replies": [{"body": "Yeah but your joke was mean and not funny.", "score": -5, "replies": [{"body": "Don’t be so fragile.", "score": 3, "replies": [{"body": "Look. WSB is a safe space for many of us. We don't tolerate insults or bad jokes.", "score": -1, "replies": [{"body": "Sticks and stones. Lighten up my guy. Jeeze.", "score": 0, "replies": [{"body": "Words have power!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "He’s posting about the biggest meme stock on Reddit going down for a week and a half. He deserve it like everyone else. \n\n#viva", "score": 0, "replies": []}]}, {"body": "I like your PLTR post history lmao kinda pot calling the kettle black here bud", "score": 1, "replies": [{"body": "Joke\n\nYour head\n\nI can be self aware and make jokes without being hypocritical 😬", "score": -2, "replies": [{"body": "Oof don't get tilted", "score": 1, "replies": [{"body": "Reply to the wrong person...? Big oof brah", "score": 0, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "He pwned me 😢😢😢", "score": 2, "replies": []}]}, {"body": "No u 🗿🗿🗿", "score": 2, "replies": []}]}]}]}]}]}, {"body": "It jumped Way fast up, what do u realistic expect would happen=?", "score": 2, "replies": []}, {"body": "Should have bought Nio", "score": 2, "replies": []}, {"body": "If I keep buying these dips I’ll go bankrupt.", "score": 2, "replies": []}, {"body": "The more days it drops the higher chance it has of going up.", "score": 2, "replies": []}, {"body": "Tesla goes up for no reason 😂😂😂", "score": 3, "replies": []}, {"body": "Tesla goes up because people like Musk this isn't hard. PLTR has no Musk like figure", "score": 0, "replies": [{"body": "What about Alex Karp?", "score": 4, "replies": [{"body": "What about Peter Thiel...", "score": 2, "replies": []}, {"body": "Who? Sounds familiar", "score": 1, "replies": []}]}]}, {"body": "Meme stock", "score": -4, "replies": []}, {"body": "Check my profile with my DD post on PLTR. It might answer some of your questions", "score": 1, "replies": []}]}
{"title": "India’s Booming Tech Sector", "selftext": "So, I remember reading in my college business class this semester about how India is having a booming tech sector and how they might be the next economy to really grow and this is where a lot of companies are investing in such as **AMAZON**, which just built it’s largest warehouse there or something. Anyway, this economy is predicted to grow a lot and (relatively) soon so I’ll give it a three rocket ships rating 🚀 🚀 🚀 to show that I really am serious. I don’t know of a specific Indian tech ETF but from my research $INDA has a lot of tech in it and it seems like the best Indian economy ETF. And I shit you not one of my calls is already up like 80% and I just bought it. It was over 150% earlier before this recent dip.\n\nActual positions:\n\nINDA 20 Jan 23 55c (+82%)\n\nINDA 20 Jan 23 42c (+11%)\n\nIf people care I can find the paper about India and a screenshot of my positions.", "id": "kq39up", "created_utc": 1609742761.0, "score": 25, "upvote_ratio": 0.71, "num_comments": 52, "comments": [{"body": "Puts on college business classes.", "score": 64, "replies": [{"body": "As a current business major, can confirm", "score": 30, "replies": [{"body": "3rd year BBA, I've learned more about business fundamentals here at WSB than I have in school.", "score": 2, "replies": []}]}]}, {"body": "Infosys is a shitty company and I hate them. Every contract companies I have worked with regretted it. However, they are capable of under bidding anyone else and the have the manpower to throw bodies at the problem until it is fixed. If I need a dozen fresh out of college $15/hour code monkeys or testers to brute force something in a week, they will get it done.\n\nI fucking hate them, but have 2022 leaps...", "score": 32, "replies": [{"body": "Oh shit I worked for them before. I was basically an ambassador for them and I was told to target the wypeple", "score": 6, "replies": []}, {"body": "Fuck you, Infosys can under bid easily any other company, and has many international contracts, now India is digitalizing rapidly, infosys have won many government contracts. It has really good earnings. How about you see their financials before you bad mouth the company", "score": 2, "replies": [{"body": "I bad mouth the company based on years of experience working with them across multiple companies. They are terrible to work with, but make money.", "score": 1, "replies": [{"body": "Yeah lmao, you keep bullshiting about its performance, meanwhile they keep posting profits on profits every year.", "score": 1, "replies": []}]}]}, {"body": "What is Infosys?", "score": -15, "replies": [{"body": "Wait, you wanna invest in India tech companies but don't know Infosys? 40 year old $13b market cap and one of the largest in India. I haven't looked at the specific etf you posted, but if there is any India based tech etf, I am 100% sure it has Infosys in it.\n\nEdit: 3rd largest holding in INDA.", "score": 34, "replies": [{"body": "No I don’t know of individual Indian tech stock, I just read one academic paper on India’s economy", "score": -8, "replies": [{"body": "It would be like saying you wanted to invest in a Chinese ETF but not knowing what Alibaba was. Pretty sure Infosys is the 2nd largest Indian tech company according to a quick Google search.", "score": 3, "replies": [{"body": "I get it, but it doesn’t matter. If I hear, “Indian tech sector is growing”, that’s all I gotta know. I’m not investing in individual stocks.", "score": -3, "replies": [{"body": "go back to middle school", "score": 8, "replies": [{"body": "Fuck off", "score": -6, "replies": []}]}]}]}]}]}]}]}, {"body": "Didn't read but saw 🚀🚀🚀... I'm in brother!!", "score": 12, "replies": []}, {"body": "I played INDA during March times. It just follows SPY.", "score": 12, "replies": []}, {"body": "I don't know what to do with this information...\n\nWhat's the bollywood netflix, I'll throw 10$ at them and call it my \"emerging economy\" portfolio.", "score": 9, "replies": [{"body": "NSE code is : balaji telefilms", "score": 2, "replies": []}, {"body": "Altbalaji", "score": 2, "replies": [{"body": "Wait i thought netflix is our netflix", "score": 2, "replies": []}]}]}, {"body": "apparatus wistful reply shaggy pocket bewildered cable tub north growth", "score": 8, "replies": []}, {"body": "Puts on Deodorant", "score": 38, "replies": [{"body": "Pits on deodorant.", "score": 7, "replies": []}, {"body": "Actually, perhaps it opens up a whole new market for deodorant because it’s perhaps underutilized there", "score": 1, "replies": [{"body": "At the rate you’re overutilizing that ass lube, I’d say it opens up a whole new market in your ass.", "score": 9, "replies": [{"body": "I’m about to over utilize your mom if you don’t stfu", "score": 4, "replies": [{"body": "Why, yo mama’s still sore from all the railing I gave her last night lol? Try your dad... he took it like a champ.", "score": 2, "replies": []}]}]}]}]}, {"body": "We really need a buttons pushing etf, featuring Bangalore consulting companies", "score": 4, "replies": [{"body": "I can manage that etf. Here are my credentials:  https://www.reddit.com/r/wallstreetbets/comments/iq8ul4/button_pushing/?utm_medium=android_app&utm_source=share", "score": 3, "replies": []}]}, {"body": "How is Dr. Patel not making an appearance here? \n\nBTW, there is also EPI for overall Indian economy.", "score": 5, "replies": []}, {"body": "Calls on people shitting on the street", "score": 16, "replies": [{"body": "oh you mean SF and LA ?", "score": 41, "replies": [{"body": "Means his fugly face...", "score": -1, "replies": []}]}, {"body": "Calls on janitors/street sweepers", "score": 6, "replies": []}, {"body": "It's railroad tracks, get it right.", "score": 1, "replies": []}]}, {"body": "https://www.livemint.com/market/stock-market-news/indias-market-cap-swells-to-2-5-trillion-11609719574403.html", "score": 2, "replies": []}, {"body": "India is not China that it will outright ban American tech companies. A booming Indian tech sector would basically mean explosive growth for Google, Apple, Microsoft, Amazon etc. I would personally go buying Nasdaq ETFs than touch Indian IT service  companies that can easily be a beaten by something similar out of Indonesia or Bangladesh.", "score": 2, "replies": []}, {"body": "you mean they have one that does something other than apple and microsoft refund scams?", "score": 2, "replies": []}, {"body": "India been up n coming for decade. I’m sure any day now something will happen... all in chyna!!!!!", "score": 2, "replies": []}, {"body": "No I haven’t looked at each of its tech companies, I read one academic paper about its economy", "score": 1, "replies": []}, {"body": "what? that's your DD? india market is booming let's invest? fucking retard.\n\nI am in.", "score": 1, "replies": []}, {"body": "This is just simply not the way. India is just a shitload of political mess rn, the hardcore BJP supporters are oppressing anyone who doesnt drink cowpiss. Before it was just Kashmir but now its farmers - 60%+ of India is farmland which poses risks of access to resources. \n\nTheyre trying to eek out development and better infrastructure but its really an uphill battle. \nTheyre wealth disparity is an absolute joke. Theyre trying to compete with China rn, and they won't win. Their R&D spending is lower and they dont innovate nearly as enough. Also the Chinese gov can oppress whoever the fk they want too in their nation but it simply doesnt work as well when Modhi does it. \n\nLike someone said, most of its price movements follow SPY so just buy that lol at least you have a federal reserve that guarantees tendies until 2023 (possibly longer)", "score": 1, "replies": []}, {"body": "India is literally a steaming pile of shit, the corruption is over the top and doing businesses there is risky af.", "score": 2, "replies": []}, {"body": "They are taking a shit on the street. I dont believe they'll become serious I'm the next 20 years", "score": -7, "replies": [{"body": "There are different parts of India. Just like how a lot of China very rural, a lot of it is very technologically advanced too", "score": 3, "replies": []}, {"body": "I have several Indian friends and am going to visit the country soon. I simply don't believe in India as a relevant tech market in this decade. China yes, India no. Also, covid hit their economy super hard. Maybe in the 2030s", "score": 4, "replies": [{"body": "India was a shithole country with corruption plaguing even top level of government. Things have been turned around past 5 years. I'm optimistic, but yea..you be the judge.", "score": 0, "replies": []}]}]}]}
