{"title": "Target reports a monster quarter — profits jump 80%, same-store sales set new record", "selftext": "https://www.cnbc.com/2020/08/19/target-tgt-q2-2020-earnings.html\n\nAdjusted EPS: $3.38, vs. $1.62 expected\n\nRevenue: $23 billion, vs. $20.09 billion expected\n\nSame-store sales growth: 24.3%, vs. 7.6% expected, according to StreetAccount survey", "id": "iclcud", "created_utc": 1597834104.0, "score": 127, "upvote_ratio": 0.99, "num_comments": 52, "comments": [{"body": "You can thank my wife.", "score": 124, "replies": [{"body": "And her boyfriend", "score": 74, "replies": [{"body": "Yeah he's got a pretty good job, unlike this loser", "score": 30, "replies": []}, {"body": "and their kids", "score": 9, "replies": [{"body": "And theirs", "score": 4, "replies": []}]}, {"body": "U mean me", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "I know. I have had faith that Target had a good chance for the future, but I needed to consolidate.\n\nOnly had a couple shares, but still. The best part is that I'm still in Walmart, which trimmed off a tad despite the killer earnings they experienced as well, lol.\n\nOh well, water under the bridge!", "score": 2, "replies": []}, {"body": "I wish i kept overstock when i bought at 19 and sold at 22 :(", "score": 1, "replies": []}]}, {"body": "160c 9/11 LET'S GOOOOOOO \n\nBut for real, they seem to be a solid company with some great potential", "score": 4, "replies": []}, {"body": "Picked up 20 x TGT Jan 15 2021 150 Call on 8/14...Up 186%... yay!", "score": 5, "replies": [{"body": "Still learning option.\n\nHow much did it cost you per contract?", "score": 3, "replies": [{"body": "https://www.investopedia.com/terms/c/calloption.asp", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "https://www.investopedia.com/terms/c/calloption.asp", "score": 1, "replies": []}]}]}, {"body": "Target is going to soar.", "score": 6, "replies": []}, {"body": "Target soars while Walmart tanks 🙄", "score": 3, "replies": [{"body": ":(", "score": 2, "replies": [{"body": "Seriously, don't get this at all :(", "score": 3, "replies": [{"body": "I got burned HARD. I could get the bad reaction but what I don’t get is the pump to 137.5 yesterday....", "score": 1, "replies": []}]}]}, {"body": "WMT even got a few upgrades today too. Makes no sense. I nibbled today, and will probably buy more if it's down again tomorrow", "score": 1, "replies": []}]}, {"body": "Same-store growth 24.3!  In the middle of at least partial lock downs nation wide.  I don't even understand how that's possible.", "score": 5, "replies": [{"body": "people need to buy things because they are spending more time at home. plus the kids.", "score": 7, "replies": []}, {"body": "Groceries, cleaning supplies, educational stuff for kids out of school, and Toys (No more Toys R Us).", "score": 4, "replies": []}, {"body": "For us, Amazon had delays so we had to divert to Target and Walmart for far quicker deliveries. Also, those Stimulus checks had TVs moving quickly.", "score": 3, "replies": [{"body": "Funny you mention that ~1/2 of mine went towards an LG 70\" from Target.  I guess I really underestimated how many others did the same.", "score": 2, "replies": [{"body": "nice me too... C5", "score": 2, "replies": []}]}, {"body": "Agreed. Amazon had delays all over the place. We shopped Target online and with their RedCard, shipping is free.", "score": 2, "replies": []}]}, {"body": "Its mostly due to the $1200 and unemployment benefits. \n\nProblem is that money has run out and early signs are showing reduced spending. \n\nIts why so many say trickle down does not work. But trickle up does. Put money into the hands of people that buy things and don't be surprised when they buy things.", "score": 2, "replies": [{"body": "It'll very interesting to see what the economists make of this data as it continues to unfold.  If all of a sudden 'the more money the lower class has the better off everyone is' is proven true through this real-world experiment it will be  hard for anyone to say that raising minimum wage (or maybe even UBI) isn't something that should be seriously considered.", "score": 0, "replies": []}]}, {"body": "same as WMT, checks from the government", "score": 3, "replies": [{"body": "That and being the only place open that sells clothing, electronics, furniture and decorations for several weeks probably helped.", "score": 4, "replies": []}]}, {"body": "Target was never closed", "score": 1, "replies": []}, {"body": "That's where my friends get TP for their bungholes.", "score": 1, "replies": []}]}, {"body": "Glad I got that tgt stock lmaoo", "score": 2, "replies": []}, {"body": "Why did TGT take off and WMT declined? They both had blow out earnings and huge increases in online sales.", "score": 2, "replies": []}, {"body": "What's the betting? Up in pre-market, down when markets open?", "score": 3, "replies": [{"body": "That seems to be the pattern, eh? But I don't think as many people were pouring money into it ahead of earnings with the intent of immediately taking profit on the results like they were in some of the other big names. My prediction? Closes up just 1-2%.", "score": 0, "replies": [{"body": "Still going strong", "score": 3, "replies": []}, {"body": "Still sittin pretty at 12%", "score": 2, "replies": [{"body": "And calls like that are why I'm down for the year.", "score": 3, "replies": [{"body": "Haha at least this one was didn't lose you anything (I hope.)", "score": 1, "replies": []}]}]}]}]}, {"body": "That's incredible. Dang son.", "score": 1, "replies": []}, {"body": "Wow this is so unexpected", "score": 1, "replies": []}, {"body": "I bought 54 shares at $92 and everyone shit on me.", "score": 1, "replies": []}, {"body": "That COVID money worked well", "score": 1, "replies": []}, {"body": "Shorted this shit and made decent money this morning after the pump", "score": 1, "replies": []}, {"body": "I don’t know why people go to target tbh, I guess they just have decent real estate", "score": -21, "replies": [{"body": "So they don’t have to deal with the people of Walmart", "score": 34, "replies": [{"body": "This is why I'm going to buy Kroger stock.", "score": 3, "replies": []}]}, {"body": "It's clean and looks nice. People who work there are nice.\n\nThis all matters more **subconsciously**", "score": 4, "replies": []}, {"body": "I think amazon and online shopping is what helps Target.\n\nWhen we buy online we are searching for deals. The shopping experience isn’t enjoyable in the traditional sense.\n\nThe truth is that sometimss people shop because its a rush, it gets them high and it can be its own addiction.\n\nPeople just aren’t doing it as much with amazon and everything online.\n\nWhen people DO go to a store to shop, the rush is intensified by a nice store, clean, with coffee! and actually nice products to look at.\n\nTarget offers that experience.", "score": 7, "replies": []}, {"body": "They go to target because of the red card.. we don’t have a CC but do have their debit one that connects to your bank. Get 5% off everything plus deals.. not to mention the $50 promotion when you sign up. Just saying.", "score": 10, "replies": []}, {"body": "And if you are into the curbside pickup, target does it better than anyone. You show up and they are at your car almost immediately.", "score": 1, "replies": []}]}]}
{"title": "$2500 Bull Case For Tesla Stock", "selftext": "", "id": "icmezs", "created_utc": 1597838989.0, "score": 40, "upvote_ratio": 0.83, "num_comments": 50, "comments": [{"body": "I completely disagree about what will happen on battery day.\n\n* Tesla will not announce that they are selling batteries to others on battery day, because they're currently battery constrained. They are partnering with Panasonic and CATL in addition to trying to build their own cells just to get enough batteries to meet their internal demand, this is 100 % the worst time to start selling some of their batteries to third parties.\n* Tesla will not announce a million mile battery. Average car goes ~13k miles per year, current battery is good for at least 300k miles, meaning that for the average consume, the battery will need to be replaced every 20 years. That is a non-issue. Until robotaxis are moving paying passengers without a driver in them, the million mile battery is irrelevant.\n\nI suspect Tesla will announce several of the following:\n\n* starting to sell vehicles with made-by-Tesla batteries,\n* made-by-Tesla batteries have significant cost reduction because of Maxwell chemistry,\n* made-by-Tesla batteries have significant power density increase because of Maxwell chemistry,\n* Plaid Model S/X powertrain, and\n* a progress report on the Semi with announcements of range increases and delivery guidelines.", "score": 58, "replies": [{"body": "My understanding is that the million mile battery is a requirement for a vehicle-to-grid offering, which they certainly seem to be exploring.", "score": 30, "replies": [{"body": "Million mile is also a necessity for semi if Tesla is to get into trucking industry. Big fleet maintenance advantage in addition the the EV benefits.", "score": 17, "replies": [{"body": "Do we have any idea about what exactly a 1 million mile battery means? I guess it’s Very dependent of battery size and car efficiency. \n\nWouldn’t it be more informative to talk about X cycles before Y pct degradation?", "score": 1, "replies": [{"body": "I think the idea has been at least 80% range left after a million miles.", "score": 10, "replies": []}, {"body": "Million mile battery is a nice sound bite to sell people the idea that a mild battery longevity upgrade is a huge deal, nothing else.", "score": 4, "replies": [{"body": "What they said. Basically it will last enough and go though enough charge down/up cycles to last 1m miles. Fairly important for Semi and if we want to do vehicle to grid also.", "score": 5, "replies": []}]}, {"body": "The general consensus is that 'the million mile battery' as referenced by Tesla in various public engagements over the last 5 years is Tesla shorthand for a battery optimized for use in an autonomous robotaxi. \n\nWhat this entails requires guesswork but again there is consensus. Overall, such a battery would lose no more than 20% of it's capacity over 4000 cycles (4000 cycles * 250miles per cycle (think 85% of max capacity is an average cycle) = 1 million miles)\nAdditionally, the car battery needs to be capable of long, moderate demands with occasional intermittent sharp demands (acceleration events) and with the ability to condition itself for several different charging rates and types such as:\n++Standard home outlet\n++Rapid charging (v3)\n ++Icremental charging events during discharging - think regenerative breaking and active suspension and maybe some small amount of solar\n\nThe problems with the term 'million mile battery':\n++Whatever Tesla means by this shorthand will be defined by battery day so we are all just grabbing at whatever we can\n++They have been able to make a reasonable sized battery pack that enables a car to run 1 million miles for some time... But they both don't need this until autonomy and the downsides (less flexible conditioning; costly or dirty battery chemistry) have deterred their interest", "score": 1, "replies": []}]}]}, {"body": "I agree on this one. This is how tesla energy grows larger than their car business far of in the future.", "score": 11, "replies": [{"body": "Batteries have a good chance of becoming the new oil. That's how i think about it.", "score": 8, "replies": [{"body": "The the sun is the new oil. Actually also what made oil in the first place. Batteries are storage.", "score": 3, "replies": [{"body": "Oil is storage too.", "score": 6, "replies": []}, {"body": "I meant more in the sense of financial and societal impact. \n\nBut also; renewables are the extraction method (yes from the sun, even wind energy comes from the sun), batteries are the storage method of that energy. Just like we had oil rigs and barrels full of oil.", "score": 3, "replies": [{"body": "I fully agree.", "score": 3, "replies": []}]}]}]}]}, {"body": "It’s also a requirement for robotaxis", "score": 4, "replies": []}, {"body": "Maybe, but I'm not sure that's going to happen any time soon.\n\nDesigning a battery becomes a trade off between price, power density, charge speed and longevity. You can basically always improve one at the cost of one of the others. This means that given a fully working million mile battery, Tesla could relatively easily make a version with identical specs, but a range of 300k miles, that cost a bit less to make.\n\nI doubt that Tesla will be able to recoup that extra cost by saying \"you can now use your car for energy storage\".", "score": 1, "replies": []}]}, {"body": "Given how Autonomy day went, I make the call that we will see a \\*very\\* tech heavy discussion on their battery tech.  Most of this discussion will completely go over the head of 99% of the people there (that's what happened on autonomy day).  The few of us that are tech-savvy will actually have our jaws drop in awe of the tech Tesla has (that's what happened to me during autonomy day, and the day I went all in on Tesla and violated my no more than 10% in any one stock rule).  Most people will still not know what was said for months or even years afterwards.", "score": 14, "replies": [{"body": "yes I wouldn't be surprised if we saw a spike leading into battery day with a small pull back the following day", "score": 5, "replies": [{"body": "I'm expecting a run to $500 ($2,500) leading up to it and then a -15% pullback in the week after. Then it will be a slow climb up from there.", "score": 3, "replies": [{"body": "If that were to happen as you predict, what do think about Q3 earnings? \n\nFall short, meet or beat the 2500/500 Pre battery day spike?", "score": 1, "replies": []}]}]}, {"body": "I think Musk mentioned knowing how Autonomy day went and would adjust the general tone for battery day.", "score": 3, "replies": []}, {"body": "We should throw a chair to the video editor for nintendo/apple press conferences. I can convince wsb gamblers. But I don't want to shill TSLA to the people I care about (well, I do personally think the risk of investing in Tesla is worth the risk, but they shouldn't buy it because one of their friends said so.).", "score": 1, "replies": []}]}, {"body": "I like the fact that you're coming across as less expectant, reasonable and conservative, yet somehow even if you're correct, the reveal would still be really cool.", "score": 3, "replies": []}, {"body": "The energy sector potential of Tesla actually exceeds their vehicle platform, as that too would be merely a... Vehicle, to serve the market.", "score": 2, "replies": []}, {"body": "The cars bring built today need to be robitaxi ready, otherwise they will need a retrofit.", "score": 2, "replies": [{"body": "Not really. It's not like the Model 3, even if it *did* have a million mile battery, would be that well suited to be a robotaxi vehicle. It's a five seater, which is *way* too large for most fares. A much smaller, cheaper and lighter 2-3 seater could serve 90 % of all rides just as well. And there is just *way* too much storage, the performance is too high, etc. Basically, you could design a vehicle that cost only 1/3 that would perform nearly identically for robotaxi duty.\n\nThe sensible plan for a Model 3 robotaxi fleet is to bootstrap the market with one million *acceptable* robotaxis to get the business going, but then create a bespoke vehicle only for robotaxi usage. And the bootstrap vehicles won't need a million mile battery because after 2-3 years, they'll be obsolete anyway.", "score": 1, "replies": [{"body": "Elon has said that the reason why a Model 3 lease can't be bought out is because Tesla is going to be using them for Robotaxi.  \n\nSure, new smaller cars will be cheaper, but by the time Robotaxi comes, Model 3s will already have their depreciation paid off, which may make them economically comparable.  \n\nIt also depends on the use case. If you're using a Robotaxi to transport you and a backpack a couple miles in Manhattan, then a Model 3 is overkill. But if you want to go long distance, or keep the car for a while because you'll be in a rural where the fleet is limited, you'll want a bigger, nicer car.  \n\nUber Black is an option because people will pay for something nicer.", "score": 1, "replies": []}]}]}, {"body": "You were peretty spot on.", "score": 2, "replies": [{"body": "\\o/", "score": 1, "replies": []}]}, {"body": "I believe there is going to be much more than those 5 bullet points", "score": 1, "replies": []}, {"body": "Isnt a huge point of the million mile battery that you can actually keep it charged at 100% without fear of dendrites ruining it? That means 20% more \"useable\" capacity.  Certainly something i would want in my consumer grade car.\n\nE.g. todays teslas have 300 miles epa rated range but they recomend you only charge daily up to 240 miles or so.  (80%).", "score": 1, "replies": []}, {"body": "RemindMe! 35 days", "score": 1, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 1 month on [**2020-09-24 00:27:15 UTC**](http://www.wolframalpha.com/input/?i=2020-09-24%2000:27:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/teslainvestorsclub/comments/icmezs/2500_bull_case_for_tesla_stock/g25uqkr/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Ficmezs%2F2500_bull_case_for_tesla_stock%2Fg25uqkr%2F%5D%0A%0ARemindMe%21%202020-09-24%2000%3A27%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20icmezs)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Didn’t they say that vehicles made with a million mile batteries would happen this year?  What would battery day really be about if it wasn’t at least the one thing they said they were working towards for this year?", "score": 1, "replies": []}]}, {"body": "Sometimes I feel sad that I can't buy on discount, but then I see the gains I have and everything's okay again. It's going to 🌙", "score": 7, "replies": []}, {"body": "This video features Dan Ives (Wedbush) w/$1900 price target and $2,500 bull case. IMO, Dan has been one of the quicker analysts to \"wake up\" to the real Tesla story.", "score": 18, "replies": [{"body": ">real Tesla story.\n\nReal? Tesla?\n\nRealTesla?\n\nr/RealTesla?\n\n💀", "score": 8, "replies": [{"body": "Ouch my brain hurts reading the comments there", "score": 1, "replies": []}]}]}, {"body": "what was the flying kiss for? I think Rob is the gold standard in terms of content, presentation and tone/delivery.", "score": 3, "replies": [{"body": "Does it make you uncomfortable? 😂", "score": 1, "replies": []}]}, {"body": "At this point it feels like each video pumps the stock up $100\n\nGreat quality, probably would have never invested if I didn't see his YouTube videos months ago", "score": 1, "replies": []}, {"body": "Obnoxious presenter, but I get the point. It isn't a car, it's a gadget so the stockprice can go anywhere.", "score": 1, "replies": [{"body": "He says what lots of us think. And he isn’t mincing his words in most of his videos. I have to say I don’t really care whether he sounds obnoxious, because to me at least, he tends to sound 100% correct.", "score": 9, "replies": []}, {"body": "What do you find obnoxious about him? Just curious", "score": 1, "replies": [{"body": "I love Stephen and am a Patreon to his channel, but I can certainly see how he would come across as \"obnoxiously smug / cock-sure\" to some. For me though I see it as brutal honesty, no beating around the bush.", "score": 6, "replies": [{"body": "Not the first time people have found me to be abrasive, nor the last 😁 No fucks given. I am who I am and I don't pander 😂", "score": 2, "replies": [{"body": "👏👏", "score": 1, "replies": []}]}]}, {"body": "Oh I did not see your reply, well to be honest he lost me at the \"Either he is really really not very smart or he has never been in a Tesla\".   \nI've been in a Tesla, maybe I'm a very boring person but being in a Tesla didn't change my perspective on the company or the CEO or the quality of their cars. Don't get me wrong, it is an impressive piece of tech, but i've been in much better cars and honestly they were usually cheaper than a Tesla.   \n\n\nThe overal presentation is alright, but I think I prefer a \"dry\" analysis of the books and reports rather than emotional personal beliefs. Maybe the presenter is not motivated by emotions or personal belief, but that is the way it comes across to a newbie in Tech stocks like me.", "score": 1, "replies": []}]}, {"body": "Can’t stand the guy!! /s 😂", "score": 1, "replies": []}]}, {"body": "I see the content farm is hard at work. This trash is everything wrong with Tesla community.", "score": 0, "replies": []}]}
{"title": "Did you idiots buy the spce and intc dips?", "selftext": "EDIT: well well well look at that intc is up 3% after hours. Who actually listened and bought? Enjoy your printers. \n\nOk listen up faghorn Leghorns cause I’m only gonna go through this once. Did you buy the dips on spce and intc? No? Do you even like money? Intc is literally at its bottom and has been consolidating waiting for a chance to moon. Spce suffered a major happening and dropped 25% to the 15-17 range where it’s been shat on constantly by the likes of you fuckin retards so that should tell you something. \n\nTldr fuck u buy spce intc calls for October and receive money printer", "id": "icfvs2", "created_utc": 1597806802.0, "score": 12, "upvote_ratio": 0.66, "num_comments": 50, "comments": [{"body": "Ahh the dips that keep dipping.", "score": 36, "replies": [{"body": "Dnt wry itll find support at 0", "score": 8, "replies": []}, {"body": "Except for today lmao", "score": 1, "replies": [{"body": "Dude they announced 10 billion buyback, it’s like 5% of a market cap. Congrats but it’s a red flag for me.", "score": 2, "replies": [{"body": "Na I don’t disagree lol just for short term gainz tho", "score": 2, "replies": [{"body": "True, just don’t forget to take profits my man 💪", "score": 3, "replies": [{"body": "For sure brother.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Yes I bought the dip. Then it dipped more. Am now an intcel", "score": 15, "replies": [{"body": "Same", "score": 2, "replies": []}]}, {"body": "INTC has flatlined around today’s price for almost a month. $48.50 is the new value until some news happens.\n\nSPCE is a meme stock that also needs some news to pop so retards can drive it up for a week then dump.", "score": 9, "replies": [{"body": "I mean I agree on both points", "score": 3, "replies": []}]}, {"body": "intc is sideways mostly.\n50C 01/2022", "score": 5, "replies": [{"body": "$665 to trade at $50? Oh ok. That’s dum....in", "score": 1, "replies": []}, {"body": "Pinky promise? Some iron condors may start to fly...", "score": 1, "replies": []}]}, {"body": "I purchased more intc from your post.  Thanks man", "score": 4, "replies": [{"body": "Yessir I’ll check back when we have a good sell opp. See everyone here was like bUy NvIdIa It CaNt Go TiTs uP and see what happened?", "score": 2, "replies": []}, {"body": "Oh we’re up 3% now because they are going thru a buyback 😂😂 you’re welcome enjoy that printer", "score": 2, "replies": []}]}, {"body": "Don't touch INTC until Mac release!!!!!!!", "score": 3, "replies": [{"body": "Fuck.", "score": 1, "replies": []}]}, {"body": "intc dips lol... it's a dead company which will trade sideways untill end of 2022.\n\nYou talk like one who bet lot of money on intels calls..\n\nLong iron condor here taking profits since first dip. You must be retarded if you think intel will moom EOY.", "score": 3, "replies": [{"body": "Maybe maybe not", "score": 1, "replies": []}]}, {"body": "Bumping this for all the 🌈🐻’s to say FUCK YOUR PUTS - 🚀🚀🚀smackin’ $50 AH https://www.marketwatch.com/story/intel-plans-big-stock-buyback-after-shares-plummet-boosting-prices-in-after-hours-trading-2020-08-19", "score": 3, "replies": [{"body": "YEAAAHH BUDDY!!", "score": 3, "replies": []}]}, {"body": "INTC will mooon (+$1 or so 🤣) for their Tiger Lake release first week of Sept and then back to the same sideways for another 2years", "score": 2, "replies": []}, {"body": "Intel been in the same area  for a month straight and there's nothing that will make that just magically jump up anytime soon. Big revenue doesn't always translate to big rises in their stonks They really can't grow anymore and they have several well run companies taking big chunks of their markets. All their competitors have great outlooks for the future. Intel has a poor outlook and all their hype is speculation based solely on \"they are a big company with lots of $\" and nothing else.\n\n SPCE I like but they are a long way from seeing huge gains. Im more interrsted in their Mach 3 being able to go from NYC to London in 2 hours or Cali to Tokyo in a few hours. Time is money. I think that'll be way more profitable than shooting bored rich people into space. There is definitely a lot of time to grt in before this sees a jump. I wouldn't touch it until after covid.", "score": 2, "replies": [{"body": "Pls see stonk go up Bc of buyback ty", "score": 1, "replies": []}]}, {"body": "I got  48/52 stangles on INTC which print about $40 a day, thinking to go in on a spce leap soon mainly because I trust chammath or w/e his name is", "score": 2, "replies": []}, {"body": "I bought intc and it hasn't done shit. After hours means nothing. You're a drunk dumbass but I'm upvoting because \"faghorn leghorn\".", "score": 2, "replies": [{"body": "I’ll take it lmao", "score": 1, "replies": []}]}, {"body": "I lost 2k from msft 220 calls and made it back thanks to you, bought the dip and sold at +50% this morning as much as I think intel is a shit boomer company", "score": 2, "replies": [{"body": "My guy! Great to hear it. Good work. We ain’t here for a long time just in and out and repeat", "score": 1, "replies": []}]}, {"body": "spce and intc were last week. Try to keep up", "score": 3, "replies": [{"body": "have you heard about this little mattress company...", "score": 5, "replies": [{"body": "TSLA makes mattresses too? Is there anything papa Musk can't do?", "score": 5, "replies": []}]}]}, {"body": "Spce literally free money", "score": 2, "replies": [{"body": "Hopefully won’t b/k", "score": 2, "replies": [{"body": "It’s Richard Branson", "score": 2, "replies": [{"body": "He is a fucktward", "score": 2, "replies": [{"body": "Visited their hq last November. There were tendies in the cafeteria... 100% gonna moon", "score": 3, "replies": [{"body": "I once had visited CHK HQ, was so impressed, I bout 15K worth of shares, now they are around 100$, sitting in my account as CHKAQ. Never fall for shits like this. Castles of sand.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "This is so blasphemously obvious...I just had to kill 3 black ants. Their little microscopic bloodlets are on your hands you goddamn demon.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/exliberallibertarian don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Fuk u I changed it", "score": 1, "replies": [{"body": "My posts don't even show up if I post right now and use meme or shitpost for some reason", "score": 1, "replies": []}]}]}, {"body": "Sure did, for INTC anyway. Not fucking around with calls, though. I have no idea when it's going to start being properly valued, but at some point the market will realize that INTC is just printing money.", "score": 1, "replies": []}, {"body": "Whenever i think of buying a really down stock I think \"Why not jut buy qqq calls?\"", "score": 1, "replies": []}, {"body": "thank you, it's these types of posts that always slip through the cracks but age like fine crack", "score": 1, "replies": []}, {"body": "I don't know what people aren't understanding about Intel. They literally have nothing at all going for them right now and for the next 2 years. Their pipeline is massively delayed and they were already VERY FAR behind AMD. I think Intel will be good in the future but that is like 2+ years from now. Unless they announce some new line that drives revenue that has been a secret thus far, they aint doing shit over the next year.", "score": 1, "replies": []}, {"body": "Richard branson boofs pineapples for fun in his spare time.\n\n Buy calls with your 401ks tmrw", "score": 1, "replies": []}, {"body": "Not touching Intel until it's at new highs, dead ass company.", "score": 0, "replies": []}]}
{"title": "Target Q2 net-income soars by a whopping 80%", "selftext": "Target just released quarterly earnings in pre-market Wednesday morning. Compared to the previous year the Q2 profit is up by 80%. Revenue rose by about 5 billion USD. Perhaps more importantly, they have incredible traction in online sales and curbside pickup: 10 million new online customers in H1, stealing 5 billion USD in market share. The full article is [here](https://www.cnbc.com/2020/08/19/target-tgt-q2-2020-earnings.html), as of this moment it is up by 6% in the pre-market and continuing to go up.\n\nThese numbers are mind-bogglingly good. Combined with the fact that pandemic is not going anywhere and the \"online shopping\" rhetoric would resonate very well with the public at a time when Amazon is on everyone's minds and is under anti-trust scrutiny, this thing is going to fly.\n\nIf you are reading this in the morning, try to get in on the action on the market open. It is bound to go up during the day. If you are a few minutes late, that is probably okay, this is no pump and dump stock with a \\~70 billion USD market cap, it is more of a medium-term play.\n\nThe Play: just buy the stock like a boomer. The IV will undoubtedly explode by morning, making options very very expensive.", "id": "icluq4", "created_utc": 1597836483.0, "score": 92, "upvote_ratio": 0.98, "num_comments": 47, "comments": [{"body": "No way any sane person would’ve held through earnings after Walmart, but damn huge congrats to those who actually did. Target killed it.", "score": 63, "replies": [{"body": "I sold 5 x 135, 2 x 136 and 10 x 140 all 8/21 one minute before close yesterday. Made 4K profit on them. Calculated what they’re worth now and it’s around 25k.", "score": 18, "replies": []}, {"body": "this lol", "score": 13, "replies": []}, {"body": "This is why this shit is retarded. I thought i made a good play with WMT. Them and Target basically do the same thing with earnings, yet WMT gets fucked and TGT shoots up", "score": 16, "replies": [{"body": "WMT bagholder here, Doug McMillon basically refused to say anything positive over that call. If there was a blueprint on how to make your stock decline after an earnings blowout, Dougie followed it. No guidance, tons of non-answers to e-commerce questions, and suggesting the only growth came from stimulus checks which are running out.", "score": 11, "replies": [{"body": "Is he wrong though?", "score": 3, "replies": []}]}]}, {"body": "I held 8/21 145c.... mind you it was 1 contract so it was wasn’t a big deal. Held because my pregnant wife goes there everyday and spends money so it could only go up.", "score": 5, "replies": []}, {"body": "I bought more tgt calls yesterday after wmt results.", "score": 2, "replies": []}, {"body": "Yup this was me. Burned by Walmart and sold Target. \n\nF", "score": 2, "replies": []}, {"body": "I did made 14k", "score": 2, "replies": []}, {"body": "Sold 5 $141c yesterday right before close, couldn’t get myself to hold since I was already up 40% on them. R.I.P. me", "score": 1, "replies": []}]}, {"body": "I sold my 08/19 135 calls for 2.55 last week after they doubled. Today they will be worth over 10.\n\n:))))))", "score": 30, "replies": [{"body": "And yesterday you would've sold for a loss", "score": 27, "replies": [{"body": "Eh I usually exit at 50% gains  on options anyway, so i actually held them longer than usual. Just stings a bit today, is all.", "score": 7, "replies": []}]}, {"body": "I got out on Monday, at least I did not loose money.", "score": 2, "replies": []}, {"body": "I sold yesterday.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Yeah, they also have a lot more high margin items: electronics, furniture etc.", "score": 3, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Also keeps sticky fingers from shrinking margin.\n\nBecky will wait.", "score": 3, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Walmart is honestly terrible. Great prices, but the sheer amount of insanity that goes in there compared to Target makes it a no brainer to spend 10-15% more at Target vs dealing with Walmart bullshit. \n\nTarget also has better clothes and furniture selections which makes Becky and her husbands very happy.", "score": 3, "replies": []}, {"body": "Personally never go at Wal-Mart because lowlives go there.", "score": 1, "replies": [{"body": "I live in the Bay Area so pretty everyone is well off considering even cashiers make $25/hr.", "score": 1, "replies": []}]}]}]}]}, {"body": "In retrospect this would've been easy money if I actually did my own DD instead of relying on retards with big words and colorful graphs but congrats to call holders", "score": 11, "replies": []}, {"body": "I’ve been holding various TGT calls for about 3 weeks now. I’ve never woken up to such amazing news 💲💲💲💲💲", "score": 12, "replies": [{"body": "congrats! me too ;)", "score": 3, "replies": [{"body": "what brought target to your attention 3 weeks ago to get calls?", "score": 3, "replies": [{"body": "I'm long-term bullish on Target's hybrid model of e-commerce combined with best in class retail brick and mortar experience.  I got involved a few years ago when I saw AMZN validating that strategy by acquiring Whole Foods.   2 weeks ago or so I noticed Target was still below March 2020 (pre-covid) price levels, despite extremely strong results from the e-commerce players SHOP/AMZN/W/OSTK.  It was being treated like a lower growth stock than WMT or HD/LOW all were at 52 week highs and well above pre-covid levels.  so bought a large OTM call position Oct 16 2020, $145 strike on the idea that if I was right the stock could quickly re-rate 20-25%.", "score": 2, "replies": []}]}]}]}, {"body": "never doubt becky stocks, chicks love spending money", "score": 18, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "This guy fucks", "score": 3, "replies": []}]}]}, {"body": "I actively sought out targets when I Was traveling across country because they're actually clean, well stocked, and organized. Unlike walmart which is a petri dish", "score": 7, "replies": []}, {"body": "If there’s one thing every suburban woman loves it’s target. With that said I’m all in", "score": 6, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Yes, I agree. Let’s see what happens.", "score": 2, "replies": [{"body": "11% increase in one day. Puts?", "score": 3, "replies": []}]}]}, {"body": "explains why there's so many target boxes at my house.", "score": 3, "replies": []}, {"body": "the question is is it too late to get in", "score": 4, "replies": []}, {"body": "The real play is just to watch SPY continue to moon on all the winning the US is doing.", "score": 6, "replies": [{"body": "Would be nice is msft would wake up", "score": 8, "replies": [{"body": "Yeah, those slackers and their 1.6T market cap.", "score": 10, "replies": []}, {"body": "Waiting for it, fucker has been stuck at 210", "score": 3, "replies": []}]}, {"body": "no more reason for fiscal stimulus then. watch spy tank", "score": 1, "replies": []}]}, {"body": "Bought in for a 10/2 $170 @ 70c . Wonder if it’s worth holding for a few weeks or just selling today after the initial pump", "score": 3, "replies": []}, {"body": "This is probably why Walmart made a deal with Instacart.", "score": 2, "replies": []}, {"body": "Crap I wish I had read this in the morning", "score": 2, "replies": []}, {"body": "This is horrible news!!!! Means we have only 3 winners: amzn wmt and tgt.....   unemployment could rise as a net net consequence and barely dent the impact on revenue of the big 3.  I don’t count hd or low since they are in the business of home and diy.  The two can work in unison.  Congrats to all you dbags with calls goin into earnings....", "score": 0, "replies": []}]}
{"title": "UNFI – AMAZONS Grocery Supplier", "selftext": "Once the dust settles on $TSLA and $AAPL I’m suggesting we dive back into UNFI. \n\nMany of us got burned on the last Earnings report because they decided to “prerelease” their amazing numbers a couple weeks before earnings removing any volatility for us to capitalize on and gave a conservative guidance on the actual call (rightly so they did not know what Covid19 might look like in the months to come). To reduce the chance of that I’m making this suggestion 6-7 weeks before their Earnings Call in case they prerelease again you have your calls locked in. \n\nNow, why should we be bullish on UNFI? One word, AMAZON! \n\n***“Amazon saw online grocery sales triple year-over-year during the second quarter as more customers get their groceries delivered versus going to a physical store amid the COVID-19 pandemic”***\n\n***“Amazon, which owns Whole Foods, said it increased grocery delivery capacity by more than 160% and tripled grocery pickup locations during the second quarter.”***\n\nhttps://www.geekwire.com/2020/amazons-online-grocery-sales-triple-q2-people-get-food-delivered-amid-pandemic/\n\n**Amazon is UNFI**\n\nUNFI has been diversifying its customer base (the reason for there overpriced 2018 acquisition of Supervalu) in hopes of not being reliant on Whole Foods / Amazon. At one point in their history a majority of their business came from Whole Foods, sometime last year they put it at less then 25% but more recently they haven’t given a figure making me suspect that as Amazon has tripled its grocery delivery position it has taken on more of the UNFI revenue pie. If true then the tripling of business we saw mentioned during Amazons Earnings call two weeks ago is highly dependent on the services of UNFI. While not direct suppliers for Krogers or Walmart their amazing growth in Grocery can only mean amazing things for UNFI. \n\n**UNFI owns Grocery Stores**\n\nNext up UNFI has its own grocery stores. These assets, from the Supervalu acquisition, Shoppers and Cub Grocery Stores, were originally planned to be sold off for 200-300 Million in the first half of the year. With the rise of Covid19 they became **cash cows**, in turn UNFI decided to hold on to them for now and use their cash flow. Last reports of Cash Flow figures was on the Q3 2019 call when UNFI admitted Cash flows of 70-80million, we could easily expect that to have tripled during the Covid crisis. \n\n**DEBT reduction is Insane**\n\nLastly Debt, they got a lot of it, started with nearly 3.42 Billion in Oct 2018 when their acquisition closed to the current figure of 2.7 Billion. As mentioned above nearly all of their debt repayment plan for this fiscal year was 200-300 million from the sale of their grocery stores and a small bit of Cash Flow pre-sale, with an expected amount somewhere around 300 Million. \nBut because of Covid19 we have seen a freaking miracle borne from tragedy.\n \nThey have managed to take the full year 2020 guidance for debt repayment and smash it. Since January they are on pace to have paid down nearly 500 million in debt, and they still have this quarter to add to that repayment! Also **they have not sold the grocery stores yet**, the very basis for the original repayment was their sale but because of the overwhelming business they are doing due to Covid19 they had cash flow that enabled nearly half a billion dollars in debt repayment for the first 3 quarters of 2020. \n\n**Buy it now, not later**\n\nWe know UNFI is going to be giving a positive earnings call, the success of Amazon Grocery will have existed across its entire customer base. Even if the numbers are just as good as the last earnings it will see the stock spike to $24+. If the earnings are on par with what the performance Amazon reported we could see a larger jump to $28. In all things its about timing, looking at their charts, about 3 weeks out analysts start making suggestions and the build begins making options or shares that much more expensive. \n\nI wish I could know now the exact Earnings call date, its somewhere between September 18 and Oct 5th (likely closer to Oct). \n\n**YOLO**\n\n**Current price is $20.25**. I'm going all in on my Robinhood account, 7K in options. 75% into the November calls and 25% into the September ones (on the chance UNFI cant keep it in their pants and prereleases their numbers)\n\nBeyond that i'm dropping 45-50K in shares on Friday (waiting for it to clear). \n\nI'll update with Pics on Friday\n\n**UNFI $20C 11/04**\n\n**UNFI $20C 09/18**", "id": "icp9hp", "created_utc": 1597849231.0, "score": 18, "upvote_ratio": 0.85, "num_comments": 51, "comments": [{"body": "I worked for a grocery store for many years, the markup amazon makes is minimal, which means UNFI is making less than minimal.", "score": 14, "replies": [{"body": "Low margins high volume is the winning solution for Walmart and all the others. What separates one from another is their ability to scale and grow.", "score": 8, "replies": []}, {"body": "This comment confuses me. Why would the grocery store you work for have anything to do with Amazon, did your grocery store have an online platform thereby helping reduce the traditional costs related to owning a physical grocery store? I would imagine that Whole Foods was doing X business in 2019 and now do to the Amazon Delivery aspect might be doing 2x in 2020, but the relative costs to have remained nearly fixed. \n\nIn that case UNFI was making Y amount on Whole Foods X volume and now should be making 2Y on Whole Foods 2x volume. Margin has already been factored in, no one thinks it has changed. Our conversation is if the volume Amazon is experiencing translates into increased volume for UNFI, I argue it does.", "score": 4, "replies": [{"body": "I saw all pricing direct from the manufacturers, so if a pack of charmin costs 9.99, and amazon is selling at 10.50. I know they're making .51", "score": 1, "replies": [{"body": "As I stated before we can agree on margin. Assuming something hasn't changed in 2020 margin was the same in 2019-2018 so on and so forth. So let's instead consider what has changed, significant increases in volume. So that we have fixed costs fixed margin increase volume. How does that not translate into a more profitable UNFI?", "score": 1, "replies": []}]}]}]}, {"body": "I work for a food importer and UNFI has gobbled all of our product up. They took over contracts to ship to Whole Foods, Supevalu, Ahold, and Market Centre. But wow are they a dogshit run company.\n\n&#x200B;\n\nThe the comment below UNFI makes about 30% for traditional retailers, only 8% margin on Whole Foods though.", "score": 3, "replies": [{"body": "I would imagine the margin on Whole Foods/Amazon has to be lower but the volume in the last 6 months would be a better focus (assuming margins are unchanged YOY).", "score": 1, "replies": [{"body": "They have 8 points built into their contract. Every new item submission has to account for that 8 points. UNFI also does foodservice though which will be down massively\n\nEdit: not saying I hate this play (although I do hate unfi)", "score": 2, "replies": [{"body": "Just to be clear I am stating I acknowledge that their margin might be low because they're only working as the middleman between manufacturer and grocery chains. To that point it's fixed, so having volume increased significantly over the last 6 months means more profit for them. To send 2/3 of a truck to a store versus a full truck of product would be relatively similar in cost but obviously more profitable for UNFI. \n\nI think the reason we're seeing such a high jumping price on grocery chains such as Kroger is because generally speaking their costs are fixed. The largest mechanism to increase profit is to increase volume which is exactly what covid-19 has done for them and in turn their suppliers.", "score": 1, "replies": [{"body": "I have competitive IRI data that shows around 30% growth in the majority of center store categories but chains make a lot off resets which they cant currently do.", "score": 2, "replies": [{"body": "Sorry can you clarify that statement. UNFIs biggest piece of business is center store, their acquisitions we're meant to bring in center store conventional categories as well as fill in the needs for the perimeter (produce, meat and seafood, specialty cheeses, etc). I cannot tell if you're saying UNFI is not positioned percentage for business or that the stores are not able to adjust to their center store needs?", "score": 1, "replies": [{"body": "Unfi brings in the vast majority of specialty food to center store. Png, Unilever, private label stuff all gets brought in direct. Specialty food sales at non big box retailers is up. Unfi has absolutely increased their sales volume in this category.\n\nThe later comment was about retailers themselves as you brought that up. Kroger is up but other retailers like alb/sfy people got stiffed on. It's because they make a poop ton of profit by doing resets on shelf space. Brands pay them or give them cases of free product to be given shelf space. They rotate products all the time to keep this cash flowing which they cant do right now. Kroger announced a more extensive online program which is probably the main reason they are up.", "score": 2, "replies": [{"body": "Honestly you might be correct at conventional locations. I imagine the Walmart and Krogers of the world have direct shipment from larger suppliers, as you mentioned,  to distribution centers they own that they in turn use to fill their stores. \n\nWhole Foods does not operate that way, UNFI makes up majority 70-80% of their center store (if it's on a grocery shelf it's likely UNFI) and a smaller pieces of the perimeter (seafood, meat, produce, flowers, etc). \n\nAlso keep in mind while they have expanded conventional in the last two year but they are still a leader in natural and organic distributor, meaning clients of theirs (co-ops, smaller chains) might not have the ordering capacity to order direct from Unilever Procter & Gamble etcetera.\n\nWith that said enough of you are focusing on margin that I'm going to dig in and see what I can find.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "For anyone saying UNFI makes minimal on sales to grocery stores they are correct but they are wrong in that UNFI makes their money through chargebacks to the people they distribute for. This is very low margin $$$ for them, my only hesitation is that my company got very close to landing a deal working around UNFI in distributing to Whole Foods. I don’t believe that Amazon wants to work with another distributor forever and will find a way to utilize their distribution model to put UNFI out of business entirely and Whole Foods will be their testing ground.", "score": 4, "replies": [{"body": "I 100% disagree that Amazon will want to drop UNFI and go it alone in supplying 500 Whole Foods. it's more likely UNFI has been updating its systems over the last three to four years to better position itself as an acquisition Target by Amazon. \n\nIt's currently in the last four years of his contract with Amazon (ends in 2025). Assuming they've done well for Amazon then it makes more since to be purchased, giving Amazon quick entry into the distribution side of grocery while also enabling them to capture margin they've lost.", "score": 2, "replies": [{"body": "It would make sense for Amazon to purchase a distribution company as opposed to creating their own but I’m uncertain if UNFI is going to be willing to sell. Might mean that Amazon has to look to gobbling up smaller regional distributors to create a larger network. I do however feel that UNFI has room to run for the time being with the shift to more of households budgets being redirected to groceries and less to eating out.", "score": 2, "replies": [{"body": "UNFI is definitely amenable to selling. It was a huge part of the conversation just after things soured from the SuperValu transition, that they could be an acquisition target. I think what the real conversation revolves around is sale price, right? \n\nAssuming my thesis is right they could potentially go from 500 million to 700 million in debt repayment this year. This would be more then 2x their original projection for this year, plus they maintained the assets (grocery stores) that in this climate they could unload for 400 Million+ versus the original projections of 300 Million. \n\nBy sometime in Fiscal Year 2021 they could have managed a debt paydown of nearly 1 Billion dollars (with granted ~2.2-2.3 Billion still on the books). This would free of cash flow initially to increase debt repayment plus they might get a better debt grade meaning they could refinance expanding their debt repayment window from 4-5 years currently to 10-12 years (we are in a low interest enviroment so now is the time to strike). That is a comeback story investors could get behind, the kind of thing that could raise a stock price to $35 inside of 18 months? \n\nNow we would have Amazon sometime in the future (say October 2021) considering buying a company whose share price is $35? So their offer could be as much as $45 plus taking on debt (it would be higher save for the existing debt). \n\nOr in the next 6 months Amazon could just buy them. With a current share price of ~$20 they could easily offer $35, taking on existing debt and everyone (especially those shareholders who held $5 dogs just 6 months ago) would be happy.", "score": 1, "replies": []}, {"body": "Also there arent as many smaller regional distributors as you might think compared to 5-7 years ago. UNFI made 9 regional acquisitions from 2010-2018, thats not including Supervalu, that were focused on creating nationwide distrbution. Its why they became the largest US Wholesaler (beating out C&S) in 2018.", "score": 1, "replies": []}]}]}]}, {"body": "I YOLO'd", "score": 3, "replies": [{"body": "Appreciate it. I'll make my post of all the calls/shares I bought friday.", "score": 2, "replies": []}]}, {"body": "Great DD, thank you for sharing. I hope they pre release and annihilate the shorts. I think 20% or so of the float is short and the squeeze would be epic. \n\nOnce they get the op margin over 2% and get the debt down to two turns on EBITDA this thing is going to 100. The literally printed 400MM in free cash flow the last 12 months. FCF and deleveraging is the story here. \n\nOn top of that, wait till they have major asset sales I.e Cub/Shoppers. That’s going straight towards debt reduction. \n\nAlso it wouldn’t be cost efficient for Amazon to create their own distribution network. UNFIs entire business is built to service Amazon. Their DCs are in close proximity to Whole Foods and they pass down cost savings through economies of scale. Amazon could take them over easily in an all stock deal and it would be a drop in the bucket given where AMZ is trading.", "score": 3, "replies": []}, {"body": "Excellent DD.  I’m in for $17.5c 2/21  strike.", "score": 2, "replies": [{"body": "Thanks. I was originally going to suggest a spread buying February calls and selling September ones to reduce costs and get a better strike, but with UNFI we have no idea if they're going to pre-release mid-September.", "score": 2, "replies": []}]}, {"body": "I think your predictions are conservative and you missed out one of the key things that will run UNFI - approx. 20% of the float is short (10mil).\n\nI hope UNFI prerelease and cause a big squeeze one of these days, I really cannot see them not do big numbers again.\n\nAlso, earnings are meant to be last week of Sept.", "score": 2, "replies": [{"body": "Excellent points. I'll be making updates to the post later today.", "score": 2, "replies": [{"body": "Looking forward to celebrating on this post when this thing geta back into action. Last month has been tedious - 400k volume and dipping under 20 5-6 times just to come up till 20.5...", "score": 2, "replies": [{"body": "Preach! I literally had to remove UNFI from my stock tracker because the movement was non-existent without a eanings catalysts on the horizon.", "score": 2, "replies": []}]}]}]}, {"body": "Good work, I'm going to look into this. However, its hilarious how this post, despite being one of the ever increasingly rare actual DD posts, is tagged as a YOLO. Meanwhile, we have posts like \"Buy AMZN bcuz Bezos has big pp and his new gf can do splits so stock split incoming 🚀🚀🚀\" are labeled DD.", "score": 2, "replies": [{"body": "It was originally DD but since I was putting my old 401k (officially bought 2380 shares) and my entire Robinhood account I went with YOLO. Besides, no one reads DDs anymore", "score": 2, "replies": [{"body": "Haha not faulting you bro. Yolo fits too because of the size you plan to invest. Just thought it was funny how the quality DD isn't actually DD.", "score": 5, "replies": [{"body": "Good luck brotha. I’m with you.", "score": 2, "replies": []}]}]}]}, {"body": "Grocery took quite a hit Friday, several days of decline. Strange since the numbers that have been coming out are strong... any explanation for the drop?", "score": 2, "replies": [{"body": "TBH None, I ended up dropping another 2K in Nov Call options at 2pm because I still be my thesis. Hard to watch but there isnt any salient explanation (and I spent the better part of the day trying to find one). At this point I'll take the hit if it doesnt turn around but i'm not exiting.", "score": 1, "replies": [{"body": "Honestly I think that confirmation of good numbers is a much more drastic thing than bears think - it would confirm no chance of bankrupcy, taking control of debt and finally getting back into making making money for shareholders.\n\nI’ve been long for a bit less than a year, and since the tailwinds of COVID, I literally cannot even come up with a bear case tbh... everything seems to be going there way and they seem extremely undervalued. Just frustrating being in the dark 🤷🏾‍♂️", "score": 2, "replies": [{"body": "If I had balls I'd go all in on this (above and beyond the nearly 60K). Everything I found, even as small as tracking the rise of new positions postings at UNFI over the last 2 months, indicates they are killing it.", "score": 1, "replies": []}]}]}]}, {"body": "Its only about when not if. Shorts are still playing a dangerous and losing game", "score": 2, "replies": [{"body": "Everything is telling me that there is no chance this thing busts - but this wait and decline on low volume is just so hard to watch.\n\nI emailed IR, they confirmed that they wont be prereleasing anything which means we have a horrible month ahead of us.\n\nThis stock is so hard to hold on to at the moment.", "score": 2, "replies": [{"body": "it is heavily shorted by the most insane shorts in the world. I have no idea what the short thesis is, but it has remained above 20% since the stock was 5 dollars. It is crazy to me people are wanting to short any grocery related stock in these conditions, but here we are. Who knows, many theories it could be a whale trying to tank the stock to buy it for cheap. Not sure blackrock is selling though.\n\nAnyways, contact IR and tell them they should stop being silent while short interest is the highest in the sector.", "score": 2, "replies": [{"body": "They told me they plan on going the “normal course” and staying silent till ER end of sept.", "score": 2, "replies": [{"body": "That is very much an abnormal course and atypical of the market for AFTER quarter end.\n\nIm guessing they are done selling the retirement plan off, so now they are trying to buy their own shares.", "score": 1, "replies": []}]}, {"body": "A tiny part of me is thinking maybe there is something I am not understanding, but to the best of my knowledge and rationalisation there is no way this company is worth 1 billion. Looking at all competitors they all seem to be valued at least double what UNFI is and most of them even more.\n\nHonestly, I’m gonna wait it out but I will be very disappointed in my judgement if it turns out this is a bust haha", "score": 2, "replies": [{"body": "They printed 450MM in free cash flow trailing 12 months. The market cap is broken. Once market realizes and the debt is materially paid down, this will triple", "score": 2, "replies": [{"body": "Timeframe is what I am concerned about. I was hoping that the next quarter earnings will be catalyst enough, but looking at some of these others who reported I’m thinking this will not be the case. Guess we have to wait and see a month from now.", "score": 1, "replies": [{"body": "It’s a fair point. I can’t say for certain how far the next ER will push us but I am certain this time next year we should be valued materially higher. It may be a longer play", "score": 1, "replies": [{"body": "I am concerned with the price dropping back down pre earnings limitting upside. For some reason the sentiment is that UNFI is going broke, and a decline to under 15 up till earnings could limit our upside. I’m holding through earnings but if this continues I’m out in October", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s complete insanity. They are asking to die. The only thing I can think is shorts are walking this down into earnings to be able to cover last minute knowing there’s no prerelease", "score": 1, "replies": []}]}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/AllAboutTheSPY the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/AllAboutTheSPY the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Many independents UNFI/SuperValu services are seeing record high foot traffic and claim to be beating remaining market.  This is mirrored across consumption on many GM/HBC brands.\n\nMany GM/HBC vendors are seeing DEEP double digits growth VS. YA.  While most independents serviced via UNFI lack sophistication in supply chain, buying power, and digital services...  They've benefits from consumer habits over COVID and a decrease in foot traffic in industry leading retailer Walmart drove consumers to their stores.\n\nUNFI will beat projections, but I do not believe they are a long term play with most independents lacking the ability to evolve and remain competitive in the future.  WholeFoods relevant GM/HBC most likely have a direct relationship with Amazon with no benefit of eroding margin to a third party distributor.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "icy0sb", "created_utc": 1597876225.0, "score": 400, "upvote_ratio": 0.94, "num_comments": 57, "comments": [{"body": "Please ban me if NVDA trades below $500 2 weeks from now.", "score": 157, "replies": [{"body": "Mods pin this", "score": 43, "replies": [{"body": "This place has mods?", "score": 33, "replies": [{"body": "Only the invisible hand", "score": 23, "replies": [{"body": "Wanking the barely visible dick", "score": 16, "replies": []}]}]}]}, {"body": "So long. It was nice knowing you.", "score": 18, "replies": []}, {"body": "Safe bet. \n\nA M P E R E", "score": 7, "replies": []}, {"body": "I'll join this man. Mods please ban me if Nvidia is trading under 500 in 2w time", "score": 3, "replies": []}, {"body": "14 days. over 500. no ban", "score": 2, "replies": []}, {"body": "nvidia with 2k 3090 i see all that retards", "score": 1, "replies": []}, {"body": "Same. One ban if it isn't past $500 after new 3xxx series launch.", "score": 1, "replies": []}, {"body": "Didn't think somewhat happen last earnings? Big run up, it beats, drops initially then climbs past the share price before earnings?", "score": 0, "replies": []}]}, {"body": "up 100% ytd. ya'll some greedy mfs", "score": 110, "replies": [{"body": "Well it is Wallstreet bets.  Not Wallstreet safe ETFs/Index funds. 🤷🏽‍♂️", "score": 63, "replies": []}, {"body": "Purely for earnings folks who were banking on 520 on earnings.", "score": 14, "replies": [{"body": ":*( \n 8/21\nbig sad", "score": 4, "replies": []}]}, {"body": "If you're only up 100% YTD on NVDA, you didn't listen and you suck at options.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I did an ironfly, profited 40 bucks from it \n\nTheta gang all the way", "score": 2, "replies": []}]}]}, {"body": "The entire market dipped end of day today.", "score": 21, "replies": []}, {"body": "They all sold and bought INTC 😂.", "score": 66, "replies": [{"body": "$INTC calls fittin tuh PRINT!", "score": 11, "replies": [{"body": "INTC goes up $2 and these losers think the calls are gonna print.", "score": 14, "replies": [{"body": "Brrrrrrr...", "score": 1, "replies": [{"body": "Congrats, you’re up... $2 in one month?", "score": 1, "replies": []}]}]}, {"body": "Did you load up on $50 calls for .04?", "score": 3, "replies": [{"body": "By load up you mean 5? Then yes im loaded to the tits.\n\nYea i should have thrown $100 at it.", "score": 8, "replies": []}, {"body": "I have 500 at 50.5 for 0.02", "score": 1, "replies": [{"body": "expiration?", "score": 1, "replies": []}]}]}]}, {"body": "Praise the market gods. I needed both of these moves.", "score": 3, "replies": []}]}, {"body": "\"At 10:51 a.m. ET, a trader bought 424 Nvidia call options with a $510 strike price expiring on Friday. The contracts were purchased near the ask price at $8.75 and represented a $371,000 bullish bet.\"\nUps.. that hurts! https://www.benzinga.com/markets/options/20/08/17161063/option-trader-bets-2-5m-on-nvidia-ahead-of-earnings", "score": 13, "replies": [{"body": "Guh", "score": 3, "replies": []}, {"body": "Not looking so crazy anymore", "score": 1, "replies": []}]}, {"body": "NVDA only knows how to climb, even if slow", "score": 17, "replies": [{"body": "It knew how to halve after earnings in 2018", "score": 11, "replies": [{"body": "It was intentional to get rid of the cucks who didn’t have balls to hold", "score": 17, "replies": [{"body": "That may be the actual bottom of this sub.", "score": 6, "replies": []}]}, {"body": "China Trade war make market go crash.", "score": 0, "replies": []}]}]}, {"body": "👏Priced👏In", "score": 9, "replies": [{"body": "Everyone knew NVDA was killing it and it killed it in the earnings. Still a really great company and I’m going to consider some LEAPs next week", "score": 7, "replies": []}]}, {"body": "better pray tomorrow for those calls to print", "score": 4, "replies": []}, {"body": "still waiting for a NVDA dip, will i retire before it happens?", "score": 3, "replies": []}, {"body": "Really, what a fucked up market. Stomp on earning projections... Tank. Wtf", "score": 11, "replies": []}, {"body": "Knew NVDA will play out like ATVI", "score": 3, "replies": []}, {"body": "After running up from 350 to almost 500, didn't think any type of beat will pump it any further", "score": 3, "replies": []}, {"body": "I love Murdoch Chan!", "score": 2, "replies": []}, {"body": "SIMP", "score": 2, "replies": []}, {"body": "Expected move was $29 . I sold pit spreads and they were a nice winner", "score": 2, "replies": []}, {"body": "Such attention to detail Suit Jensen isn't a winner like leather jacket Jensen.", "score": 2, "replies": [{"body": "You jump in that monkey suit for a spanking", "score": 1, "replies": []}]}, {"body": "Anyone knows what is up with their ARM takeover? Is the deal sealed yet? When will we know for real?", "score": 1, "replies": [{"body": "don’t think this will be seal anytime soon. Both EU and China won’t let this happen.", "score": 1, "replies": []}]}, {"body": "This is just a good time to buy LEAPs", "score": 1, "replies": []}, {"body": "Did he not wear the leather jacket?", "score": 1, "replies": []}, {"body": "[That's because they made no mention of any new game relseases in the earnings report](https://i.imgur.com/y2YH9Cf.png)", "score": 1, "replies": []}, {"body": "\\*Nothing but positive correlation from April until now\\*\n\n&#x200B;\n\nyup, it ran out of steam.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "They're up then", "score": 1, "replies": []}]}]}
