{"title": "Women Now Outnumber Men On U.S. Payrolls", "selftext": "https://www.npr.org/2020/01/10/795293539/women-now-outnumber-men-on-u-s-payrolls\n\nJob growth slowed last month as U.S. employers added just 145,000 jobs. But there was an interesting milestone in Friday's report from the Labor Department. Ninety-five percent of the net jobs added in December went to women.\n\nWomen now hold just over half of all payroll jobs in America, for only the second time in history. The first was during the Great Recession, when a wave of layoffs hit male workers first, temporarily giving women an edge in the workplace. The period was even dubbed the Mancession.", "id": "en7w71", "created_utc": 1578752141.0, "score": 381, "upvote_ratio": 0.94, "num_comments": 85, "comments": [{"body": "All the men are suiciding", "score": 207, "replies": [{"body": "Jesus.", "score": 24, "replies": [{"body": "no, he got crucified", "score": 102, "replies": [{"body": "suicide by government", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "That's why tobacco and alcohol are legal.", "score": 1, "replies": []}]}, {"body": "Not really. 1/6 men of working age have removed themselves from the work force. A lot of these men commit suicide compared to national averages, but it's not a large enough number to seriously impact population statistics", "score": -1, "replies": [{"body": "Drugs..... Opiates in particular. The Fed commented on opiates\\oids' deleterious impact on work force participation. And drugs impact men at like 9x the rate of women. Sad. the US has such a myopic view of drug solutions. Jail and alienation. No other innovative, rich country in the world deals so poorly with drugs than the US. (Maybe Japan can compare but really we take a dumb approach to drugs here)", "score": 20, "replies": [{"body": "[deleted]", "score": -15, "replies": [{"body": "Well, you are already paying for them to be in jail. Rehab is cheaper.", "score": 9, "replies": [{"body": "I'm not really. I don't pay a whole lot of taxes being a single mom. So that's your problem.\n\nI'm too responsible to do drugs, so no need to pay for anybody's rehab. If you do drugs, budget to pay your own rehab.", "score": -13, "replies": [{"body": "...\n\nI think you're missing a big link in the chain here...\n\n\"I'm not really. I don't pay a whole lot of taxes being a single mom. So that's your problem.\"\n\n\"I'm too responsible to do drugs, so no need to pay for anybody's rehab. If you do drugs, budget to pay your own rehab.\"\n\nDo you see it?\n\nSingle and married men, moms who are married, single fathers paying child support but legally cant claim the tax exemption, etc...  are the reason that you don't pay a whole lot of taxes...  *other* people pay more so YOU can pay less....\n\nWhy does a single man have to pay more taxes so you, as a single mother pay less?  He doesn't have any kids.  He shouldn't have that responsibility.\n\nDoes that line of thinking make sense?", "score": 15, "replies": [{"body": ">Does that line of thinking make sense?\n\n&#x200B;\n\nIf you want me to waste $ on your healthcare, you will have to first achieve widespread access to Affordable Housing for single mothers like myself. There's no free lunch. The $ that goes to pay inflated rents is coming from your healthcare. The status quo suits me as I manage to spend $0 on healthcare by self-insuring.\n\nThose with healthcare issues will have to basically defeat NIMBYs if they want any change. It's their problem, not mine.\n\nWhen the Army of the NIMBYs is confronted by the Army of the Sick... who wins? It will be fun to watch.", "score": -10, "replies": []}]}, {"body": "> I'm too responsible to do drugs, so no need to pay for anybody's rehab. If you do drugs, budget to pay your own rehab.\n\n😂\n\n\"I'm too responsible to be a single parent, so no need to pay for your kid. If you have a kid, budget to pay for them.\"\n\nWe both know that it's better for society as a whole to have some form of public subsidy for rehabilitation, just as there is for single parents. Even if you have an excuse like the father died, keep in mind that so do drug addicts - many that start on opiates did so because they were prescibed painkillers for major surgeries, for example. This is just selfish hypocrisy.", "score": 2, "replies": [{"body": "I don't do drugs, don't care if you do them. I'm so healthy that my biggest risk is Medical Malpractice, keeping US mercenary doctors as far away from me as possible benefits me a great deal.\n\nI'm self-insuring on healthcare for the next 7 years I'm forced to live in the USA. Will move to Europe after that. The savings on healthcare premiums alone pay for 25% of the European house I want to buy.\n\nThe USA is designed by and for sick homeowners. As a super healthy renter, I dont benefit.", "score": 1, "replies": []}, {"body": "The USA is designed by and for sick homeowners. As a super healthy renter, I dont benefit.\n\nI'll self insure for healthcare for the next 7 years I have to stay in the USA and move to Europe after that. What I save in US health insurance premiums pays for 25% of my future home in Europe. A no-brainer!!!", "score": 1, "replies": []}]}]}]}, {"body": "I have a feeling like a nuanced discussion on the costs associated with drugs may not be achievable here.", "score": 9, "replies": [{"body": "I'm not affected by that at all. My home country is the 6th drug exporter, super cheap prices. I just buy them back home.", "score": -9, "replies": []}]}]}]}, {"body": "[10th leading cause of death in the US, and men commit suicide 3.54x more often than women.](https://afsp.org/about-suicide/suicide-statistics/)\n\nSure it's not the most impactful factor, but that certainly is significant.", "score": 1, "replies": []}]}, {"body": "Well they already do men are about 3.5 times as likely to die from suicide as women are.", "score": 1, "replies": []}]}, {"body": "Welp we had a good run boys", "score": 190, "replies": [{"body": "Time to pack it in and go back to being home makers.", "score": 106, "replies": [{"body": "Any of you bitches want to come over and make fruit cake?! We can watch the Mcgregor fight afterwards", "score": 56, "replies": []}, {"body": "That’s the dream. Just need my wife to start making about 15k more and we are there", "score": 33, "replies": [{"body": "Teach her negotiation tactics. +15 K  in this economy is entirely possible.", "score": 13, "replies": [{"body": "I don’t doubt that it’s possible, she’s been with this company about 6 months so we are targeting this summer", "score": 4, "replies": []}]}]}, {"body": "More women on payrolls not more women making enough money to be the bread maker, and I don’t mean in the kitchen.", "score": 1, "replies": []}]}]}, {"body": "We need to start some programs to get more men on payrolls.", "score": 198, "replies": [{"body": "It's not fair that women will do the same work for only 70% the wage of a man. /s", "score": 65, "replies": [{"body": "You wonder why the market is soaring? 30% return on capital with no fundamental changes to the business?!?", "score": 7, "replies": []}, {"body": "Clearly these people commenting on this don't understand what \"/s\" means...🙄", "score": 15, "replies": []}, {"body": "Please do research before just spouting Poorly informed nonsense... please please please.", "score": -21, "replies": [{"body": "Do you not see the /s? It's sarcasm.", "score": 22, "replies": [{"body": "I did not see the /s...  thank goodness you weren’t serious", "score": -8, "replies": []}]}]}]}, {"body": "No way, we're finally achieving gender equality", "score": -126, "replies": [{"body": "You aren’t smart.", "score": 68, "replies": [{"body": "says the idiot paying for reddit", "score": -43, "replies": [{"body": "Paying for reddit? That’s a wild assumption...", "score": 20, "replies": []}, {"body": "I don’t pay for Reddit. \n\nI got 4 years of this shit for downloading a free app.", "score": 11, "replies": []}]}]}]}]}, {"body": "I believe it.\n\nHR will literally only send us women candidates sometimes, even if more qualified men applied.", "score": 181, "replies": [{"body": "reverse descrimination in progress.  Can't bring it up though or else you'll get flagged.", "score": 120, "replies": [{"body": "It's just regular descrimination", "score": 21, "replies": []}, {"body": "[deleted]", "score": 28, "replies": [{"body": "That’s because there’s a sexual assault problem with male photographers. Just gonna gloss over that?", "score": -52, "replies": [{"body": "Wait til this guy finds out women can sexually assault people as well", "score": 36, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "No I mean there’s a specifically higher incident rate with male photographers especially in amateur circles. That industry has a major problem.", "score": -13, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "https://www.kqed.org/pop/112955/creepy-photographers-are-a-well-documented-fashion-industry-problem\n\nEven basic research via google would show you this but okay", "score": -2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Fucking chill dude. Do your own research, it ain’t that hard and I’m not your slave. I made a comment in a bro corner of reddit, this isn’t debate club.", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No dude. It’s me admitting I don’t care to argue with you since you have 0 interest in putting in any work. You need to work on your boundary recognition.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yo you need to calm down and reflect on why you are this worked up. It’s entirely one sided.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Who is “you”?", "score": 1, "replies": []}]}, {"body": "I’m looking to get into the stay at home dad market and drink wine and eat Xanax like m&ms all day. Any tips?", "score": 59, "replies": [{"body": "Also learn to bitch and moan. And tell your spouse that staying at home and taking care is a goddamn HARD job", "score": 38, "replies": [{"body": "[deleted]", "score": -15, "replies": [{"body": "Some of us, believe it or not, do take care of the house.", "score": 1, "replies": []}]}]}, {"body": "Make quaaludes great again!!!", "score": 1, "replies": []}, {"body": "Learn to trade stocks, you can work from home. Just take it slow and don't be a dumbass.", "score": 1, "replies": []}]}, {"body": "Just as an FYI: The term “Payrolls” does not include farmers or self employed.", "score": 73, "replies": [{"body": "Right, anyone that has w-2 income, but a lot of self employed people form S corps for tax purposes and then are required to hire themselves as employees. So they would still count.\n\nBasically if you are a half million+ a year business, you probably still count in this statistic. It's the self employed people on the low end that wouldn't...\n\nAnd farmers.", "score": 22, "replies": [{"body": "Ok so genuinely, why are farmers singled out? Wouldn’t they be considered self employed? Why self employed *and farmers*", "score": 5, "replies": [{"body": "Farmers can be seasonal, making for fluctuations that don’t really indicate anything more about the broader economy.", "score": 3, "replies": []}, {"body": "Honestly, I only singled them out because he did. I would normally count them as general self employed.", "score": 1, "replies": []}]}]}]}, {"body": "Damn patriarchy!", "score": 21, "replies": []}, {"body": "What’s a high end/luxury product that caters to women??\n\nLet’s invest in that lmao", "score": 10, "replies": [{"body": "$LULU $SBUX $MC $AAPL $ETSY $TGT $OR $PLNT $ULTA\n\nIt’s the BECKY portfolio and it can’t go tits up", "score": 3, "replies": []}, {"body": "They get their  end/luxury products even without jobs, cause you guys pay for all that shit :-)", "score": 4, "replies": []}]}, {"body": "Yea, my company has a “diversity checkbox,” keeps diversity stats, and is actively trying to reduce the percentage of SWMs (straight white males) who work for and with us. But there’s hope guys. You can always suck a dick. Gay for pay is the new norm in corporate America.", "score": 66, "replies": []}, {"body": "All I’m saying is $BECKY", "score": 12, "replies": [{"body": "LULU stretch pants in every boardroom!", "score": 6, "replies": []}]}, {"body": "Cool for girl power but there is probably a gender swing every December.  Hospitality & retail jobs spike in December and runs through the new year. Transportation & warehousing spikes in Nov & drops pretty much right after Christmas. A lot of plants choose Christmas for their 1-2 week annual shutdown/turnaround.  Construction & mining start prepping to slow down for winter.", "score": 20, "replies": [{"body": "Context is king", "score": 14, "replies": []}, {"body": "Plus, the Great Recession started in the housing sector. I know a lot of home builders were hit hard. That tends to be a male dominated industry. That could explain the Mancession initially.", "score": 3, "replies": []}]}, {"body": "As a dude I feel awkward now for quitting my job (trying to start up my own business)", "score": 4, "replies": []}, {"body": "I, for one, welcome our new sugar mama’s.", "score": 18, "replies": [{"body": "Sugar mama overlords.", "score": 2, "replies": []}]}, {"body": "Maybe if we pay men a premium we can get more of them to join the workforce", "score": 14, "replies": [{"body": "lmfao", "score": 3, "replies": []}, {"body": "lmao", "score": 5, "replies": []}, {"body": "Let’s start at 30%, readjust later. Seems fair.", "score": 2, "replies": []}]}, {"body": "I wonder how this will play with the fact that women are a net negative from tax and social welfare programs standpoint. Less men to move this horse cart forward...", "score": 7, "replies": []}, {"body": "\nWith 95% of new jobs being women, its a pretty sure sign that women who didnt need/want to work before now have to.  The economy isnt doing well and single incomes are harder and harder to support a family on, Is what i read from this.", "score": 8, "replies": []}, {"body": "there are no moms", "score": 3, "replies": []}, {"body": "?", "score": 1, "replies": []}, {"body": "I think i can explain this maybe, construction and lanscape/other outdoor professions are done primarily by men, although as someone who does construction there are more and more women 3very year which is great. But in the northern states it is seasonal for a lot of jobs and many people get laid off for the winter months, myself included...perhaps this skews the statistic?", "score": 1, "replies": []}, {"body": "all in on BECKY", "score": 1, "replies": []}, {"body": "Does this mean women get pay more men. Doubt it. Quantity vs quality", "score": 1, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "I don't think you comprehend the situation. Ahem... DEY TURK UR JERBS!", "score": 3, "replies": []}]}, {"body": "It's about time!", "score": -7, "replies": []}, {"body": "That is why western countries are demographically collapsing.", "score": -2, "replies": []}]}
