{"title": "Top Stock Picks for 2020", "selftext": "The S&amp;amp;P 500 surged 29% in 2019, its best return since 2013. I beat the market by posting a gain of 167% in 2019.\n\nI posted some of my picks last year. Feel free to check out my post history for more.\n\n* [Tech/Software](https://www.reddit.com/r/stocks/comments/apai9i/techenterprise_saas_cloud_stocks_er_dates_2019/)\n* [Fintech/Payments/E-commerce](https://www.reddit.com/r/stocks/comments/b057ft/fintech_payments_ecommerce_crossborder_trade_sq/)\n\nI want to point out that my biggest gains are attributed to my plays in biotech/healthcare ([CVRS](https://www.reddit.com/r/stocks/comments/b35afo/cvrs_sleeping_giant_in_robotics_surgery/), [GH](https://www.reddit.com/r/stocks/comments/aqrxof/guardant_health_gh_blood_test_that_detects_cancer/)). CVRS ran from $1.30 and eventually got bought out at $4.25/share. Guardant Health ran from $30 to $112 with blow-out earnings quarter after quarter.\n\nAs the bull market charges into 2020, here are 3 stocks under $20 billion market cap that I'm bullish about. Let me know if you enjoy these types of posts, and I'll come out with more picks in my portfolio!\n\n**Guardant Health (**[**$GH**](https://finviz.com/quote.ashx?t=GH&amp;amp;ty=c&amp;amp;ta=1&amp;amp;p=d)**):**\n\n\"Guardant Health, Inc. is a precision oncology company. The Company is focused on helping conquer cancer through use of its blood tests, data sets and analytics. It provides Guardant Health Oncology Platform. It provides liquid biopsy tests, such as Guardant360 and GuardantOMNI, for advanced stage cancer. Its liquid biopsy tests fuels its programs developing tests for recurrence and early detection, LUNAR-1 and LUNAR-2. Guardant360 is a molecular diagnostic test that measures 73 cancer-related genes from circulating tumor deoxyribonucleic acid (ctDNA). Its Guardant360 process includes blood collection, laboratory processing, analysis and reporting. Guardant360 is used for a range of applications, including translational science research and identifying target patient populations, drug development and commercialization post-drug approval.\"\n\n**WHY?**\n\nGuardant Health received expanded Medicare coverage for Guardant360, making it the first and only liquid biopsy to be broadly covered for use across the vast majority of advanced solid tumors.(!!!) -- For the Q3 2019 earnings report, Guardant procured an aggressive revenue increased by 181% ($60.8M). The bottom line earnings also improved by the remarkable 92.7%. If Guardant can maintain this momentum, it will generate positive cash flow within the next two to three years. Other catalysts: Monday, January 13 the company will be participating in the upcoming 38th Annual J.P. Morgan Healthcare Conference in San Francisco, CA. Imminent FDA approval within 1-2 years.\n\n**Sea Limited (**[**$SE**](https://finviz.com/quote.ashx?t=SE)**):** \"The Company operates through three segments: digital entertainment, e-commerce and digital financial services. The Company has developed an integrated platform consisting of digital entertainment focused on online games, e-commerce, and digital financial services focused on e-wallet services. Its platforms include Garena, Shopee, and AirPay. Garena provides access to engaging mobile and personal computer (PC) online games, live streaming game play, as well as social features such as user chat and online forums. Shopee is an e-commerce marketplace where users come together to browse, shop and sell on-the-go, anytime, anywhere. AirPay App is the Company’s digital financial services business that provides e-wallet services to consumers through the AirPay App and to small businesses through the AirPay counter application.\"\n\n**WHY?**\n\n[Google Report:](https://techcrunch.com/2018/11/18/google-report-southeast-asias-digital-economy-to-triple-to-240-billion-by-2025/)  Southeast Asia’s digital economy to triple to $240 billion by 2025\n\nSea Limited’s top and bottom lines in 3Q FY 2019 beat previous year’s levels, operating cash flows show huge improvements, Digital Entertainment unit which forms the bulk of Sea Limited’s total revenues saw three-folds jump in top line growth during Q3 2019 to US$329 million, E-commerce unit saw top line growth nearly tripled to $230 million in Q3 2019.\n\n**Progyny (**[**$PGNY)**](https://finviz.com/quote.ashx?t=PGNY&amp;amp;ty=c&amp;amp;ta=1&amp;amp;p=d)**:**\n\n\"Progyny, Inc. operates as a fertility benefits management company in the US with its headquarters in New York City. The Company offers patients a benefits solution with education and guidance from a Patient Care Advocate and access to a network of fertility specialists. Progyny also aims to reduce healthcare costs for employers through their operations.\"\n\n**WHY?**\n\nThe market for fertility coverage has seen significant growth globally with adoption rates picking up given demand seen from top talent. At the time of its IPO listing in 2019, 80 B2B customers (including Facebook, Microsoft, Google) at nearly 100% retention rate, and 1.4 million lives covered (!) The company has only been in operations for a short while, however, has exhibited impressive top-line growth and is already profitable.\n\nEdit 1: Futures are down -200 points. Market might be bloody tomorrow.\n\nEdit 2: Thanks for my first gold, stranger! As expected, the DJIA is down 220 pts at the time of this edit\n\nEdit 3: 1/6/2020 - Citigroup initiated coverage on $GH - rated it a 'Buy'. $PGNY closed up \\~+8.0% today.\n\nEdit 4: Sea Announces Application for Singapore Digital Full Bank License -- [https://www.businesswire.com/news/home/20200106006075/en/Sea-Announces-Application-Singapore-Digital-Full-Bank](https://www.businesswire.com/news/home/20200106006075/en/Sea-Announces-Application-Singapore-Digital-Full-Bank)  \n\n\nEdit 5: $PGNY up 12%+ from date of this post. $SE new ATH. $GH up 5.5% from date of post.\n\nEdit 6: 1/8/2020 .. PGNY SP @  $30.00. 16%+ from date of post.\n\nEdit 7: $PGNY - Closes at New ATH (1/13/2020)\n\nEdit 8: $PGNY up 10% intraday. Technical breakout. Up roughly 27% from date of this post (1/14/2020)", "id": "ej4aqf", "created_utc": 1577999191.0, "score": 677, "upvote_ratio": 0.96, "num_comments": 105, "comments": [{"body": "[removed]", "score": 169, "replies": [{"body": "[deleted]", "score": 105, "replies": [{"body": "2013 was a better year than 2019, so the perf this year is not unprecedented.", "score": 11, "replies": [{"body": "You miss the point. Much of that 29% was literally just recovering losses from the last week of December. Unless you bought on 24DEC18 you didn’t make that much.", "score": 24, "replies": [{"body": "Well, if you bought on January 1st (or December 31st, more correctly) you did get that return. That's how the statistic works", "score": 23, "replies": [{"body": "Except very few people do that. Which is the point that you’re not getting. The market itself is up about 9% from last years high. Which is good. But not 29%", "score": 12, "replies": [{"body": "I get your point, I agree. I was just being pedantic. If you bought on Dec 24th you got 32%. If you bought on Dec 21 you got 34%", "score": 9, "replies": []}]}]}, {"body": "I filled my 402k up by the end of feb, so idc what happened before hand, I still got a great return on that newly invested money so far.", "score": 3, "replies": []}]}]}]}, {"body": "Yup it’s weird how little that gets mentioned. Most of the second half of 2018 was bad which is why the number is so high. It was up 29% in calendar 2019 and less than 12% since August 2018.", "score": 5, "replies": [{"body": "bc the intent is to shed a positive light on the current administration and to increase confidence in the market. Big corporations like the current political climate, and thus will spin the story to their advantage", "score": 1, "replies": []}]}, {"body": "Yeah but beat the SP with biopharma stocks.  Also, this weed stock might be the next Amazon Google Microsoft.\n\nEdit: I thought the s/ was obvious enough.", "score": 1, "replies": []}]}, {"body": "Thoughtful picks, thanks for this. These are well-written elevator pitches - you def sound like you work in the investment industry :)", "score": 21, "replies": []}, {"body": "[deleted]", "score": 40, "replies": [{"body": "I personally think $GH has a lot of room to grow. The Medicare coverage has huge implications on revenue growth. There are a lot of catalysts in 2020 and GH will become a serious buy-out candidate as the bio/healthcare sectors consolidate.", "score": 38, "replies": []}]}, {"body": "RemindMe! 1 year", "score": 11, "replies": [{"body": "RemindMe! 1 year", "score": 1, "replies": []}, {"body": "I will be messaging you in 1 year on [**2021-01-03 00:18:08 UTC**](http://www.wolframalpha.com/input/?i=2021-01-03%2000:18:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/ej4aqf/top_stock_picks_for_2020/fcvuylf/?context=3)\n\n[**15 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fej4aqf%2Ftop_stock_picks_for_2020%2Ffcvuylf%2F%5D%0A%0ARemindMe%21%202021-01-03%2000%3A18%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ej4aqf)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": []}]}, {"body": "Opened a position in GH at $58 — thanks for the tip!\n\nWould you be comfortable with opening a position in $SE at the moment?", "score": 10, "replies": []}, {"body": "Thanks for the post. Bought some $SE this morning. A lot of people are pointing to it having a stellar year.", "score": 32, "replies": [{"body": "[Google Report](https://techcrunch.com/2018/11/18/google-report-southeast-asias-digital-economy-to-triple-to-240-billion-by-2025/) \n\nSo. Much. Room. For. Growth.\n\nI think $SE has an insane amount of upside. Investing with conviction and will buy on every dip.", "score": 19, "replies": [{"body": "You still holding SE? Talk about doing well! I'm still holding lol.", "score": 1, "replies": []}]}, {"body": "+1 on $SE. Surprised that not many people talk about it considering it's huge run the past couple years. They have a wide moat, multiple revenue streams that are growing QoQ & YoY.", "score": 17, "replies": [{"body": "You still holding SE?", "score": 1, "replies": []}]}, {"body": "Is it just me or do the financials show this company to be a money burner? Am i missing something?", "score": 2, "replies": []}]}, {"body": "Very interesting.  I passed on these, I personally picked up ABT and BMY for the health sector; but your comments about fertility drugs does draw my attention, as female reproductive health seems to be horribly under-analyzed in the US.  Thanks for the post, I hope your picks soar!", "score": 7, "replies": []}, {"body": "Thanks for this. Hadn’t heard of some of these and have some orders tees up for the morning.", "score": 9, "replies": [{"body": "No problem! Always happy to help. Making money is fun when everyone else is winning, too :)", "score": 16, "replies": [{"body": "Not how the market works.", "score": -12, "replies": []}]}]}, {"body": "Amazon Microsoft", "score": 5, "replies": [{"body": "Yep, I own both... But you must have missed the part where I said < $20 billion market cap. Lol.", "score": 24, "replies": []}]}, {"body": "I need to follow your trades, you are on top of it", "score": 12, "replies": [{"body": "Happy to help! Hoping to come out with stock picks weekly or bi-weekly.", "score": 39, "replies": [{"body": "Where will you be posting these? I'd love to keep up, fairly new to investing and looking for as much info as possible", "score": 2, "replies": []}, {"body": "When you post a stock you think is a buy, do you also post when you sell it? Or are you a \"hold forever\" kind of guy?", "score": 2, "replies": []}, {"body": "What kind of time frame are you suggesting with these weekly/bi-weekly stock picks?  Short term swing trading or buy and hold?", "score": 3, "replies": [{"body": "These 3 are buy and hold long positions - great question! \n\nMost of my posts are buy and hold stocks, but with any investment, if fundamentals change or new evidence comes to light (ERs, Conference calls, press releases, etc), I re-evaluate at that time. \n\nI try to limit my portfolio to UNDER 30 stocks. It's hard to stay in touch with all my investments beyond that.", "score": 13, "replies": []}]}]}]}, {"body": "$SE is a great pick but not at this price, waiting for a drop", "score": 3, "replies": []}, {"body": "PGNY up 16% since this post.  Thanks for the heads up.", "score": 4, "replies": [{"body": "Please share more of your thoughts!", "score": 2, "replies": []}]}, {"body": "Please do more of these. \n\nThank you.", "score": 9, "replies": []}, {"body": "u/ceud \n\nwhat do you think of TTD? \n\nI really want to pull the trigger and long TTD, but the overall market being so high because of what I think is euphoria has me hesitating from buying anything rn.", "score": 3, "replies": []}, {"body": "What’s your opinion of Burger King? Their PE ratio is so much lower than, for example, Wendy’s. In the same market, for competing brands, doesn't that mean better value?", "score": 3, "replies": []}, {"body": "Jumping in tomorrow captain!", "score": 4, "replies": [{"body": "Godspeed and g'luck!", "score": 7, "replies": []}]}, {"body": "Thanks for sharing !", "score": 2, "replies": []}, {"body": "TSM", "score": 2, "replies": []}, {"body": "+1 on S.E.\n\nI was a huge ATVI fanboy, but S.E. is a better pick", "score": 2, "replies": []}, {"body": "Swear this must be the 10th one of these type of posts.  Will just share what I have in other similar threads.\n\nTop of the list for me is Google. They just have more levers to pull than others. But honestly you really can't go wrong with any of the big 5 tech companies. Google, Amazon, Facebook, Apple and Microsoft.\n\nAlphabet owns Waymo and is the only one with a production robot taxi service without drivers or backup drivers. Some videos of their cars recently.\n\nhttps://www.youtube.com/watch?v=UX_N2up7f8Q \n\nhttps://www.instagram.com/p/B5tP5XqlZpb/?igshid=1m8k9m1rv6ksx \n\nhttps://twitter.com/waymo/status/1194705739492708352?s=21 \n\nBut then there is new things like YouTube TV that is thriving. Or Travel.\n\n\"How Google Has Become The Biggest Travel Company\"\n\nhttps://www.forbes.com/sites/stephenmcbride1/2019/12/06/how-google-has-become-the-biggest-travel-company/#692d3e8f4e09\n\nBut probably the biggest for Google is their lead in every layer of the AI stack. From silicon all the way up to the engineers. Algorithms Google is miles ahead of everyone.\n\nSo the lowest layer is Silicon\n\n\"Cloud TPU Pods break AI training records\"\n\nhttps://cloud.google.com/blog/products/ai-machine-learning/cloud-tpu-pods-break-ai-training-records\n\nThe next layer up is the OS for AI. Which Google completely dominates with TensorFlow with over 140K stars now on GitHub.\n\nhttps://github.com/tensorflow/tensorflow\n\nNext up is the algorithms. Here is the canonical place papers are submitted with AI algorithms and year in and year out Google leads in papers accepted.\n\nhttps://miro.medium.com/max/1235/1*HfhqrjFMYFTCbLcFGwhIbA.png \n\nThen there is the data. Which I think everyone knows Google has more than anyone. By far. The most valuable of any data is what you get through search. Google now has 93% share overall and most important 96% on mobile.\n\nGoogle chief competitor, Microsoft with Bing, lost 50% of their market share on mobile in the last year.\n\nhttps://gs.statcounter.com/search-engine-market-share/mobile/worldwide\n\nThen the next layer up is engineers with recruiting and retention. Google is the dream place to work for young people. It give Google the top draft choices year in and year out.\n\n\"23,000 Millennial and Gen Z workers listed their dream employers and there’s 1 key difference\"\n\nhttps://www.cnbc.com/2018/09/12/23000-millennial-and-gen-z-workers-listed-their-dream-employers.html\n\nRetention Google continues to be rated the best place to work of the big tech companies.\n\n“The World’s Best Employers 2019: Alphabet Takes Top Spot”\n\nhttps://www.forbes.com/sites/sarahhansen/2019/10/18/the-worlds-best-employers-2019-alphabet-takes-top-spot-followed-by-microsoft-and-red-hat/#6e694cd052ef\n\n“Top Companies 2019: Where the U.S. wants to work now”\n\nDo a search as link is not allowed here.\n\nGoogle has barely even got started. We are like 1 inning into a 9 inning game. They are currently growing at 20% and really with all their levers they should be able to keep growth 15% or higher for the next decade.\n\nWill be fun to see in 2030 if Alphabet continues to be the company to own for another decade. I suspect that will be true.\n\nBTW, Google is also the most cash rich company on the planet to boot\n\n\"Google parent Alphabet overtakes Apple to become world's most cash-rich company\"\n\nhttps://www.cnet.com/news/google-parent-alphabet-overtakes-apple-to-become-worlds-most-cash-rich-company/\n\nBut with less than $5B of debt ;)", "score": 2, "replies": []}, {"body": "Thanks for this OP.", "score": 2, "replies": []}, {"body": "**5/11/20**\n\n* GH is up 21.22% YTD\n* SE is up 56.41% YTD\n* PGNY is down -21.86% YTD\n\nIf you invested $10,000 into each on 12/31/2019 you'd have a +$5,577.51 (18.59%) gain YTD.\n\nFWIW: I bought 50 shares of SE at $48.44/share based on this post (and doing my own homework.) I'm up 30%. Thx for that.", "score": 2, "replies": [{"body": "Check PGNY again :D", "score": 2, "replies": []}]}, {"body": "What about BYND? Bill Gates noted in this company a huge potential.  And he owns this company in his portfolio.  what do you think about it?", "score": 2, "replies": []}, {"body": "Been looking to get into stock trading for a while now, been kinda scared to get started. Would you recommend these as starter picks? Im 19 and instead of having my savings still on a seperate account, i would like to get into investing", "score": 4, "replies": [{"body": "Buy after people have been selling for a while, sell later after it rallies and stalls. Choose high liquidity and avoid penny stocks. Be very afraid of margin. Study every single day how to get better because you will lose money at first. This game is hard.", "score": 18, "replies": [{"body": "How do you get the info on:\n\n>Buy after people have been selling for a while, sell later after it rallies and stalls.\n\nThanks", "score": 5, "replies": [{"body": "For instance, if you look at the BA chart you'll notice it's been selling off for quite a while now.  Good part of a year and now approaching what looks to be a 5 year support line.  That's a setup worth looking into for a long position.   Will you time the bottom? Likely not.  Will the support hold? Probably.  Nothing is certain.  \n\nSimilarly, look at apple.  Been rallying since last May without a pullback.  Momentum indicators are starting to look stretched.  If I had a long aapl position I may be inclined to hedge with some puts, covered calls, or take a little off the table.  \n\nTiming is everything.", "score": 6, "replies": [{"body": "Not op but I have a few questions.\n\nJust to clarify: rallying is when a stock has a period of sustained growth without a big fall\n\nMomentum is kind of the derivative of price changes / change in velocity vs velocity itself\n\nRSI: how bearish/bullish a stock is? I was confused when I saw this one online.\n\nIs there a place where this info is readily available? I’ve only been messing around with RH.\n\nWhat do you mean by support holding?\n\nWhat is hedging a stock?\n\nI’ve heard that it is very difficult / impossible to time the market but you are saying that timing is key. Are the two mutually exclusive or are you referring to something different?\n\nIk it’s a lot of questions so answer as many/few as you like or have time for. Thanks!", "score": 3, "replies": [{"body": "A lot of the questions you asked is answered online. In short:\n\nRSI is a measurement of how much a stock is overbought or oversold. The higher the RSI, the more overbought it is, and vice versa.\n\nSupport line is a technical analysis concept that a stock price hasn’t fallen any lower than a specific price range. This means that this price is “supported” by the market and is not likely to fall any further.\n\nHedging is to engage in risk management which allows you to protect your portfolio in case it does go down. Covered calls, puts, and other methods are common ways to protect your account from losing value.\n\nTiming the market is a macro perspective whereas analyzing a stock is a micro perspective. You can’t control or time what happens globally but you can see the behavior of a stock by referring to technical analysis methods like RSI, volume, volatility, and so on.\n\nGood questions but you owe it to yourself to read further online. Good luck!", "score": 5, "replies": [{"body": "Thank you. I will continue to read on these topics! I am a little nervous since I got invited to the 2020 JP Morgan Global Market Webinar through a friend and I want to at least understand most of what is said there. Lot more reading to go it seems", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Essentially you want to learn how to find great businesses who have solid future growth but are priced at a discount. This is value investing. It’s my favourite way to invest because it makes sense to me. You need to understand the fundamentals of business, what the numbers mean to the company and learn how the read financial statements. Pick up lots of books and read everyday, try to apply what you learn. When you learn about financial statements, go read some of real companies, see what makes them so great compared to others. Understand the business model, what makes them different. Do NOT follow the crowd, never buy based on someone’s opinion. It doesn’t matter who they are, professional, neighbour, mate etc. always do your own research and ensure you are well investing within your own circle of competence. Meaning, you’re genuinely interested in the business and fully understand how it works. Once you know the numbers, you can learn evaluation methods that will determine the intrinsic value on the stock and compare it to the price. Your intrinsic value might be different to others, it depends on how your estimations are on the company. It sounds complicated, but it’s not. You don’t need to be a math genius, it’s more dependent on how accurate your estimations are about the companies growth. I’m also 19 and have been learning for the past two years (almost). I’d just recommend learning as much as you can about value investing, use websites, YouTube, books, forums etc. if you don’t want to do this you can just invest in ETF’s that track the S&P or other index’s. It’s a great way to invest your money and just make returns based on the market movement and just consistently dollar cost average. You’ll make solid returns over the long term doing this strategy.", "score": 11, "replies": [{"body": "Where would you recommend me to start learning from? Im from Denmark, and most ive read online is on the US market here on reddit, but i guess its fine as long as i can find a platform i can trade on, that doesnt take alot of percentages from foreign stocks. Ive read that i shouldnt be buying based on others opinions and to do my own research, just dont know how to go about that research. So if you could give me a direction on where to start my research and learning how to trade, that would be appreciated", "score": 0, "replies": [{"body": "Are you able to read and comprehend English at a decent level? If not, you could probably find some translated versions of investing books. You want to learn about business. After all, a stock is equity in a business. You own part of it. You want to know what the numbers mean. Books such as One Up on Wall Street are great simple starters. I read ‘Warren Buffet’s interpretation of Financial Statements’ and that really helped me in understanding the financial strengths of businesses. You can do your own independent research on things you don’t understand. In general try to understand the business model, what gives the an advantage over others. How strong are their financials, understand income, balance sheets and cash flow statements (financial statements). Learn how to evaluate stocks, there’s plenty of ways. Using P/E Ratio’s, Estimated Growth Rates, Cash Flows, Earnings Per Share etc. you want to know the definitions before getting into evaluations. Once you have a decent understanding of these you can jump into some Benjamin Graham books like The Intelligent Investor. This book is considered the greatest investing book of all time by many, but it’s a pretty dry and boring read. There’s no one way to learn but generally any information about value investing is useful. Use any resource you have, just be patient.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "This. \n\nInvesting in individual stocks is a high risk play. There's some real truth to the fact that 99% of the investors don't beat the market. By buying ETFs/index funds and investing over consistent intervals, you'll guarantee gains.\n\nMy stock picks are purely speculative and inherently risky.", "score": 10, "replies": []}]}]}, {"body": "Solid. Thank you for spreading the word, and helping the beginners.", "score": 2, "replies": []}, {"body": "Newbie in stocks. I've always been told stocks with dividends are the best long term investment. If the goal is maxing out my Roth every year, would you recommend these stocks?", "score": 2, "replies": [{"body": "Unless you want to spend time looking at charts and fundamentals then your best bet is to DCA into the SP500 every month for decades. $500/month into an SP500 mutual fund via your IRA and don’t ever stop. Stock picking and trading is a tough game to learn and you’ll need a minimum of a year or two just to begin to understand it.", "score": 6, "replies": []}, {"body": "A stock that pays dividends could be reinvesting it in their own company, you also have to pay taxes on them, you also could be in a non dividend stock and sell it and pay yourself.", "score": 3, "replies": []}]}, {"body": "Has Progyny lockup period passed? Seems like they just went public", "score": 2, "replies": [{"body": "Great question. Wondering same thing.\n\nEdit: 180 days from Sept 29, 2019. Which makes the end of the lockup period March 27, 2019", "score": 4, "replies": [{"body": "There is a big float. So there probably won’t be much happening anyway. But the big float has be worried about how insiders feel about the company. Thoughts?", "score": 3, "replies": []}]}]}, {"body": "Thank you very much, really interesting but I have a question.\n\nI was about to buy the stocks but they are not available on plus500,where do you recommend me to buy them?", "score": 1, "replies": []}, {"body": "Interesting picks, much check out myself.", "score": 1, "replies": []}, {"body": "Remindme! 1 month", "score": 1, "replies": []}, {"body": "Ford should see gains in  Q1 with the release of their first good electric car.\n\nKinda like AMD did when they finally started making the CPUs that people actually wanted and not just low end price-to-performance chips", "score": 1, "replies": []}, {"body": "If you had to buy  mid year calls on either one of these, which one do you expect  to start seeing the most growth  first?", "score": 1, "replies": []}, {"body": "Why did GH drop back in the end of August?", "score": 1, "replies": [{"body": "I believe I heard that some of the company directors had sold some of their shares, so I think that scared away others investing in GH", "score": 1, "replies": [{"body": "Hey, thanks for the info. I tried looking for past articles from end of August through September before I replied, but I don't know how to find older articles. Sounds like the saying when others are fearful be greedy, and when others are greedy be fearful would have applied to that.", "score": 1, "replies": []}]}]}, {"body": "The fact that you think $240k/year is a \"decent salary\" is mind boggling. That's literally the top 3% in the USA! Thanks for the info.", "score": 1, "replies": []}, {"body": "Remindme!  1 month", "score": 1, "replies": []}, {"body": " RemindMe! 1 year", "score": 1, "replies": []}, {"body": "Do you have any other picks for growth in 2020? I’m very interested in your helpful advice!", "score": 1, "replies": []}, {"body": "OMG I love those in-depth posts of yours 🙌🏼 however, most of the stocks are not tradeable for EU citizens :( Those regulations here mess with me...", "score": 1, "replies": []}, {"body": "Remindme! 1 year", "score": 1, "replies": []}, {"body": "Remindme! 10 months", "score": 1, "replies": []}, {"body": "[https://finance.yahoo.com/news/guardant-health-inc-just-reported-133401383.html](https://finance.yahoo.com/news/guardant-health-inc-just-reported-133401383.html)\n\nGuardant Health, Inc. Just Reported, And Analysts Assigned A US$113 Price Target", "score": 1, "replies": []}, {"body": "Would love to hear if you have any updated picks given the bloodbath (valuation / margin compression) of the last week with all the pending corona virus news or if you’re still LT bull on these picks for 2020?", "score": 1, "replies": []}, {"body": "Ruined! Lol", "score": 1, "replies": [{"body": "the market drops 6000-7000 points from all time high and you comment \"ruined! Lol\" on my growth stock picks? .. you're cute lol", "score": 2, "replies": []}, {"body": "lol might wanna check back on se bud", "score": 1, "replies": [{"body": "Baby gains.  Wayfair was the plug", "score": 1, "replies": []}]}]}, {"body": "Came back to say thank you.  Both SE and GH have held up extremely well through the pandemic. \n\nDo you feel like they’re still worth purchasing at the current price?", "score": 1, "replies": []}, {"body": "I like SE but I’m worried of buying in at the top and having the price plummet for the next few months and having to wait for it to break even", "score": 1, "replies": []}, {"body": "Are you still holding PGNY?", "score": 1, "replies": []}, {"body": "Have you looked into the marijuana sector? Do you have any comments Or tips on that?", "score": 1, "replies": [{"body": "I day traded $CGC, $TLRY, and $CRON, but I currently don't have any positions in any weed stocks. \n\nI think the industry will thrive in the (near) future, but it's not a sector I follow or know much about.", "score": 9, "replies": []}]}, {"body": "I just bought 2K worth of SE based on this post. \nWill buy for 2K more if I see a dip.", "score": 1, "replies": []}, {"body": "RemindMe! 5 months", "score": 0, "replies": []}, {"body": "Remindme! 1 month", "score": 0, "replies": []}, {"body": "!remindme 1 week", "score": 0, "replies": []}]}
