{"title": "Netflix earnings - \"Netflix shares fall after missing domestic subscriber estimates\"", "selftext": "Mods asleep again and couldn't see an earnings thread.\n\nShares of [Netflix](https://www.cnbc.com/quotes/?symbol=NFLX) were sliding as much as 2.7% in after-hours trading on Tuesday after the company [reported](https://www.netflixinvestor.com/files/doc_financials/2019/q4/FINAL-Q4-19-Shareholder-Letter.pdf) fourth-quarter results. \n\nHere are the key numbers: \n\n* **Earnings per share**: $1.30 per share vs. 53 cents expected, per Refinitiv estimates\n* **Revenue**: $5.47 billion vs. $5.45 billion expected, per Refinitiv\n* **Domestic paid subscriber additions**: 550,000 vs. 589,000 expected, per FactSet estimates\n* **International paid subscriber additions**: 7.17 million expected expected, per FactSet\n\n[CNBC article](https://www.cnbc.com/2020/01/21/netflix-nflx-q4-2019-earnings.html)  \n\n[Shareholder letter](https://s22.q4cdn.com/959853165/files/doc_financials/2019/q4/FINAL-Q4-19-Shareholder-Letter.pdf)", "id": "es14ck", "created_utc": 1579641043.0, "score": 55, "upvote_ratio": 0.94, "num_comments": 85, "comments": [{"body": "[deleted]", "score": 40, "replies": [{"body": "I was thinking there was no way theta gang wins this one. My puts are worth pennies now :(", "score": 20, "replies": [{"body": "Sorry, man. A lot can change between now and the open. Ya never know.", "score": 3, "replies": []}, {"body": "I sold my out at 3:45 lol when it started sprinting back up to neutral", "score": 2, "replies": []}, {"body": "I wrote a straddle today, still waiting for the crush", "score": 2, "replies": [{"body": "Congrats, theta boi", "score": 1, "replies": [{"body": "beta boy", "score": 1, "replies": []}]}]}]}, {"body": "got an iron butterfly <3 Let's hope it stays in this range $$$$", "score": 5, "replies": [{"body": "What are your strikes?", "score": 2, "replies": [{"body": "315-337.5-360", "score": 2, "replies": [{"body": "Pretty much in the same boat but lower floor. Hopefully the subscriber numbers slow down gains.", "score": 2, "replies": [{"body": "haha yes. It was holiday period, and Netflix is the only savior from initially fun but eventually a drag family gatherings. Their sub count was definitely going to grow over the period, especially with the amount of quality content they added. However, investors hate N for not being profitable, its real strong lol. There was going to be shorting with minimal negative news on US sub count. Butterfly made perfect sense here for the credit.", "score": 0, "replies": []}]}]}]}, {"body": "What are your outer strikes?", "score": 1, "replies": []}, {"body": "I got myself a burning dragon and golden unicorn", "score": 1, "replies": [{"body": "Is my 380/385c spread safe?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "It's like being trapped in a cage watching someone burn your money in front of you. Fantastic.", "score": 10, "replies": [{"body": "Is it really your money if it's margin?", "score": 17, "replies": [{"body": "Hmmmmmmmmmmmmmmmm", "score": 1, "replies": []}]}]}]}, {"body": "How can they come up short on subs, but beat revenue expectations?", "score": 21, "replies": [{"body": "they beat international sub expectations over by a million and fell short by 200k US subs. Even if international subs are cheaper than US, that's still a big number to compassionate for missed expectations.", "score": 18, "replies": [{"body": "Compassion only goes up", "score": 6, "replies": []}]}, {"body": "If I understand correctly they missed on subscribers just in the US. The revenue counts for all subscribers, international and domestic.", "score": 5, "replies": []}, {"body": "Could be due to minor differences in what level of membership the US subscribers pay, i.e. basic vs standard vs premium. \n\nIf revenue was slightly higher than expectation then this could mean  the US average revenue per user was higher than anticipated, which could be due to more of them paying for the premium version instead of standard/basic.", "score": 3, "replies": []}, {"body": "They did it last quarter too", "score": 1, "replies": []}]}, {"body": "1 thing I don’t understand about Netflix and never will...  my family is from Russia and I have a lot of friends from Latin America and China... there are ways to watch everything Netflix Disney apple+ Hulu and amazon prime have for free. I literally can tell you at least 20 Russian websites that have everything Netflix has for free either in English or professional Russian translation. Foreign countries don’t enforce piracy laws because they don’t care if Netflix or universal is losing money same for people I know there are thousands of Chinese and Latin American sites where you can watch Netflix shows for free. My question is who the f from other countries subscribes to Netflix and why?!!\n\nThis idea of growing international subscribers by adding foreign movies makes no sense to me. It makes no sense financially either. 16$ a month may not be a lot for US customers but no one from the developing world will pay that much.", "score": 9, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "True. I noticed that google skews search results when you search for things to watch for free but you can still find it relatively easily.", "score": 2, "replies": []}, {"body": "I watch all my shit online.   I have never not found a movie i wanted to watch unless it was released within the last 8 months.", "score": 1, "replies": []}]}, {"body": "It's mostly about convenience for me. I know how to get all the shows and movies too, but subscribe to various streams anyway. If it were just me then I probably wouldn't but less tech savvy in the house don't want to be messing around with anything more complex than starting the netflix app", "score": 7, "replies": [{"body": "Yeah that’s their business model. Pay us if you don’t want to do a 2 minute google search. And surprisingly for me it works", "score": 5, "replies": [{"body": "If you watch a lot of content it's worth it. Streaming sites have horrendous quality, torrenting makes you wait and do searches, plus you need a VPN these days and that costs money.... Or you could set up a 15 TB NAS and have a script automatically grab everything for you but believe me, maintaining that server is time and money in and of itself.\n\nI'm a seasoned pirate and know how to use couchpotato, etc to automatically grab high quality torrents of the most popular shows and movies. I also know how to use apps such as Kodi to automaticaly parse the internet for free streams, then scrape the ads away for an almost seamless experience. Yeah I use Popcorn Time. I also have a 40 TB NAS that grabs whatever I want using couchpotato. \n\nEven then I pay for Netflix because everything else is not 99.9% reliable like streaming services are, and who the hell doesn't have $15 a month to spare?\n\nI only pirate content that aren't on the services.\n\nok I use my NAS for porn.", "score": 6, "replies": [{"body": "Lol you don’t need all those extra steps there are websites that have all the shows that all those streaming platforms have combined + better movie suggestions based what you liked + you can either watch original or professionally translated + it’s free. Downside? You watch 30 sec of commercial before the film starts", "score": 3, "replies": []}]}]}]}, {"body": "I live in America, and I subscribe because T-mobile pays for 10.99 of it a month and the convenience of watching things without plugging my laptop in my tv.", "score": 3, "replies": [{"body": "TMobile pays 10.99 for me too, and I share my account with two cousins. So it's a no brainier for me.", "score": 1, "replies": []}, {"body": "But would you pay if it wasn’t free? I only have it because I still use my ex roommate’s account that she shared with me 4 years ago", "score": 0, "replies": [{"body": "I would, but probably seasonally, when there's new stuff to watch. It's pretty much paying for the convenience of not having to plug in an hdmi cable and easily play the next episode.", "score": 1, "replies": []}]}]}, {"body": "That's true, and that's why the revenue per international subscriber is a lot less than a US subscriber.\nThe mobile-only plans in India and now Malaysia won't be anywhere near as much as $16 USD a month.", "score": 2, "replies": [{"body": "It’s still a mystery to me why would someone from a foreign country subscribe to Netflix when \n1. Most their shows are in English.\n2. They have a limited choice of shows\n3. They’re not free... \nis it the lack of technical knowledge? People don’t know how to pirate?\n\nIt’s like paying 20$ for a meth addicted fat toothless bold hooker when you’re happily married to Gal Gadot", "score": -2, "replies": [{"body": "There's many shows not in English, they probably don't appear high on Netflix's auto-suggested list when you browse if you're not already watching them.\n\nPlay one foreign show (plenty of Indian or Korean shows) and you'll see the list of foreign shows start to fill your feed.", "score": 5, "replies": []}, {"body": "That... is one of the worst analogies I've ever read... and we're all dumber now thank you", "score": 2, "replies": [{"body": "Yeah a better analogy is paying $20 for Gal Gadot's twin while being happily married to Gal Gadot?", "score": 2, "replies": []}]}]}]}, {"body": "Folks who want to watch the media conveniently on all their devices and fancy 4K HDR TVs are still going to pay up. Silly to go blow $2K on a shiny new OLED/QLED 4K HDR TV then play shitty pirated streams on it so it looks like ass.\n\nThe convenience and quality are worth something and if it's priced right people will pay for it.", "score": 1, "replies": []}]}, {"body": "Climbing back AH", "score": 6, "replies": []}, {"body": "Beat estimate by ~ 150%. just let that sink in. I'm still glad I pulled out early.", "score": 5, "replies": []}, {"body": "good news for Dis+", "score": 3, "replies": []}, {"body": "NFLX popped! FUCK YOU EINHORN!", "score": 3, "replies": [{"body": "[Einhorn, Finkle, Finkle, Einhorn...](https://youtu.be/Y4fI3TruAOw)", "score": 1, "replies": []}]}, {"body": "NFLX don't give a fuck. Going st8 retard strength AH.", "score": 6, "replies": []}, {"body": "Domestic missed by a mile. The reported do numbers are US and CAN. The market’s estimated numbers are US only. \n\nGotta see how they got 1.30 earnings (tax havens or what). \n\nVery meh ER", "score": 7, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "A couple of additional opinions....\n\n1) Domestic  sub growth was negatively impacted by Dis+. The company attributed this to increase pricing in US and increase competition. This means no increases in pricing for the foreseeable future. \n\n2) Disney just announce roll out of service in EU a week early. That means NFLX global growth will also decelerate when Dis+ and HBO enters their foreign markets. \n\n3) NFLX estimate for global sub growth in 2020Q1 is 25% LESS than YoY. \n\nSo how can longs justify that the triple digit PE is a play on the growth story? It’s all slowing.....no end in sight.", "score": 1, "replies": [{"body": "For the rest of the globe Disney is not as popular as it is in the US.\n\nAmericans had Disney/Fox crammed down our throats since we were kids. Not so much for Europe, India, etc.", "score": 3, "replies": []}, {"body": "The marginal cost of new subs is basically zero and once they gain more established IP (stranger things/the Witcher) their fixed costs will decrease (they don’t have to spend as much on moonshot startup IP and can instead invest in sure-things).\n\nThey’re already approaching saturation in the US market so I don’t care about their domestic sub growth so much as how tolerant the market is to price increases. International growth beat expectations and Netflix continues to invest in international broadband infrastructure. \n\nSure, their earnings beat came from a one-off tax benefit, but that’s because Netflix accountants are consistently conservative and under-report earnings in comparison to other media companies, but this is something most investors don’t realize unless they look into how Netflix depreciates their assets.\n\nTL;DR: NFLX good.", "score": 4, "replies": [{"body": "What are you talking about? They are not a software company that spends capex and dev costs to launch a piece of software to 1 or 1 billion users and amortize the cost over years. \n\nNetflix is a media studio that spends billions every single year creating new content. On the conference call, Ted just said they will spend 20% more on content in 2020. You think at some point, they will stop and just stream re-runs? FFS, even the History Channel creates new content. Even Shark Week has new content every year. \n\nNetfix's only hope of profitability is increasing subs and APU to offset the cash burn. They have been in negative cash flow for their entire existence with the promise that positive cash flow is just around the corner.\n\nHaving said all that. I might go long tomorrow if it holds above 340.  If this meh news doesn't tank the stock than the market is looking to close the gap at 365. Good for a swing trade.", "score": 3, "replies": [{"body": ">What are you talking about? They are not a software company that spends  capex and dev costs to launch a piece of software to 1 or 1 billion  users and amortize the cost over years.\n\nI mean media creation for a streaming platform is pretty similar isn't it? Netflix spends money to create a new show and then the cost to launch that to 1 subscriber vs 1 billion is basically just the server costs. Netflix then amortizes the cost of their new IP on an accelerated basis over 10 years (I think, it's either 5 or 10).\n\nNetflix is actually an outlier among media studios in that they do accelerated amortization instead of straight-line, so their EPS would actually be higher if they followed the industry standard.\n\n&#x200B;\n\n>On the conference call, Ted just said they will  spend 20% more on content in 2020. You think at some point, they will  stop and just stream re-runs?\n\nYou're right, I doubt they will start spending less, but I think their spending will become more efficient.\n\nI guess my thinking is that as Netflix moves forward, they will establish more tried-and-true popular IP like Stranger Things. If they manage to have 4 or 5 ongoing cash-cow series, then they can be a lot more efficient with their spending. Like $5mil on Stranger Things will generate a lot more views than $5mil on Sense8 or some other new IP. So yeah they might not spend *less* if they're goal is to keep expanding the amount of new content produced each year, but they'll get more bang for their buck and their service will be higher quality for the same cost as time goes on.\n\n&#x200B;\n\n>Netfix's only hope of profitability is increasing subs and APU to offset the cash burn.\n\nYeah this is the bottom line. Netflix seems pretty close to saturation in the US market and how much they can raise subscription fees before it decreases revenue is definitely up for question. But the US is their most mature market and imo even if domestic growth stagnated and prices didn't change, it's still a promising model if this is how international markets will mature as well.\n\nIt's something like 60% of Americans that have Netflix and the price has been increased considerably since the early days of the service. If Netflix can repeat this in all of the international markets they're investing in, they're gonna be drowning in cash by the end of the decade.\n\nEdit: Disclosure, I've been long netflix for years", "score": 2, "replies": []}]}, {"body": "Their costs will never ever decrease. Their a content creator now. They’ll have to keep pumping out new content for as long as the company exists.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Right. I just meant that the cost of actually providing their service to a new subscriber is very small compared to the price they charge. It's really just server costs which is tiny for the marginal subscriber. It's not like Tesla or something where they actually have to spend lots of $$$ for each new customer in materials and manufacture on top of any marketing costs.\n\nThe costs of acquiring and keeping subs is a whole different story.", "score": 1, "replies": []}]}]}, {"body": "Literally nobody cares about Disney overseas. The most popular streamed show isn't Stranger Things or Mandalorian or The Witcher, it's a high budget Spanish telenovela disguised as a drama.\n\nEveryone else is half a decade behind Netflix with foreign markets.", "score": 1, "replies": []}]}]}, {"body": "yeah part of it was a ONE off tax break", "score": 2, "replies": []}, {"body": "Netflix's overzealous accountants over-accrued for taxes during the year (cos they didn't make enough money?) leading to a [$437m tax benefit in Q4 2019.](https://imgur.com/R74zXtR)", "score": 2, "replies": []}]}, {"body": "I’m not a technician but $340 seems like an obvious area of resistance. Fact that it keeps fighting back up there AH seems bullish. If it can break through there tomorrow I think it could move quite a bit higher. \n\nOn second thought I have no fucking clue what I’m talking about. Something something bollinger bands.", "score": 2, "replies": [{"body": "$341 now :(( I hope it hits 15% tmr so that my $400 call would make me enough for a cup of coffee", "score": -2, "replies": []}]}, {"body": "\\#VegaGang", "score": 2, "replies": []}, {"body": "NFLX rising now", "score": 3, "replies": [{"body": "Lfg", "score": 2, "replies": []}]}, {"body": "numbers are good if not great, I think it will steady out.", "score": 2, "replies": []}, {"body": "Sold my puts at 2:59 for a $25 gain hahaha, at least i didn't hold", "score": 1, "replies": [{"body": "Doing much better than most of the retards on this sub", "score": 3, "replies": []}]}, {"body": "Netflix and disappoint more like lol. Theta gang wins once again!", "score": 1, "replies": []}, {"body": "I for one bought a $300 PUT for 1/31. So help me god.", "score": 1, "replies": []}, {"body": "Huh, maybe my Feb 385 call won’t be a complete loss after all🤞", "score": 1, "replies": [{"body": "You and me both man, daddy Reed better emphasize those international numbers on the call", "score": 1, "replies": [{"body": "Debating on selling at the open or turning it into a spread...guess I gotta see how tomorrow morning looks", "score": 1, "replies": []}]}]}, {"body": "Disappointing guidance and burning through cash but still going horseshit up? \n\nAccounting shenanigans to up EPS are so strong.", "score": 1, "replies": [{"body": "STRANGER Netflix THINGS", "score": 1, "replies": []}]}, {"body": "so my 380C 1/24. let it print tmrw. thanks bud.", "score": 1, "replies": []}, {"body": "\\#StonkGang", "score": 1, "replies": []}, {"body": "Buying puts tomorrow", "score": 1, "replies": []}, {"body": "Dead cat bounce, don't fuck with cats!", "score": 1, "replies": []}, {"body": "I sold my puts for a 40% gain before close like a beta investing subreddit boi", "score": 1, "replies": [{"body": "Better than -1,000%", "score": 2, "replies": []}]}, {"body": "Wait what will happen to my 1/24 Call at $400?", "score": 0, "replies": [{"body": "RIP", "score": 7, "replies": [{"body": "THETA GANG BABY", "score": 2, "replies": []}]}, {"body": "Lmao you’re gonna get cucked by vol crush", "score": 1, "replies": []}]}, {"body": "reminder that everyone still share's their netflix account with 30 people", "score": -1, "replies": []}]}
