{"title": "Model Y Will Make Tesla Billions", "selftext": "", "id": "ej71ok", "created_utc": 1578010913.0, "score": 127, "upvote_ratio": 0.93, "num_comments": 92, "comments": [{"body": "Hey guys. IMO, most people are sleeping on Model Y because it's basically a bigger Model 3. This is a mistake. It's potential is HUUUUUUGE.   \n\n\nI discuss in the video. :)", "score": 55, "replies": [{"body": "I generally hate videos as I read exceptionally fast but this is a very well done one. Take your damned upvote! Also, I hope you’re not anywhere close to the fires down under.", "score": 20, "replies": [{"body": "Haha, cheers.\n\nI'm actually traveling, so safe. Many friends and family", "score": 9, "replies": []}, {"body": "2X speed bro", "score": 10, "replies": [{"body": "It sounds normal at 2x! YouTube 10 minute rule...", "score": 1, "replies": []}]}, {"body": "https://i.imgur.com/cFmUEzh.jpg\nTesla escaping the fires down under", "score": 1, "replies": []}, {"body": "How many words per minute can you read? Trump says he can do 800.", "score": -2, "replies": [{"body": "I’ve never timed it but have always had exceptional reading ability. Much of it is likely due being raised with floor to ceiling bookshelves in my bedroom and being encouraged to “explore the world via books” as a kid. My mother taught me to read simple sentences literally before I started kindergarten. It probably also helps that I’ve always had a mild auditory learning disability that I make up for with above average reading skills (and a semi-eidetic memory). No idea how fast I read (it isn’t a pissing match) but I’ve been told I read faster than anyone else by virtually every teacher I’ve had my entire life.\n\nYou’re probably trolling so I’m not going to answer to the sarcasm though.", "score": 5, "replies": [{"body": "That’s great. When earnings come out can you speed read out loud then post it here? I’m in the car quite a bit and need audio.", "score": -2, "replies": [{"body": "reading out loud is totally different thing than reading silently to yourself. It's almost like it's not even the same thing, like walking and swimming. Just because you are good at one, you are not automatically good at the other.", "score": 3, "replies": []}]}]}]}]}, {"body": "Along with Dave Lee and Rob Maurer of Tesla Daily, I enjoy your videos the most.  Most insightful, well researched and with great points!.\n\nOf course Galileo’s Hyperchange videos are fun, but I don’t think he has the technical chops and deep understanding that the three of you display.\n\nWell done!", "score": 2, "replies": [{"body": "Thanks for the feedback Kirk :)", "score": 2, "replies": []}]}, {"body": "The real question is, will people not already immersed in Tesla know there’s a new option and come into the family? I have a hard time seeing how this expands the pie, rather than cannibalizing the 3.", "score": 5, "replies": [{"body": "Personally I’ve been waiting for pretty much exactly this. Either an SUV cheaper than the X, or perhaps if the 3 were a hatchback like my Impreza Wagon, that’d work too. So yeah the Model Y is perfect for me and that’s why I haven’t bought a Tesla yet. Just waiting.", "score": 18, "replies": [{"body": "First one I ordered too. One car fam so I had ditched an Audi S4 for a Merc GLE that I HATE. This will be super fast, safe, and we can lug our crap up to the cottage on weekends not worrying about space for our young child’s 5,000 toys and car seat, etc.", "score": 10, "replies": [{"body": "You are exactly the target demographic. Young family. There's many more in the same boat. Y is gonna be epic.", "score": 9, "replies": [{"body": "The fact that people disagree is hilarious. And why I could pick up some more calls on that last little hiccup when it went to $410. God bless the naysayers.", "score": 2, "replies": []}]}]}]}, {"body": "Do you know that the EV market--the underlying market for electric vehicles itself--is expanding?", "score": 10, "replies": [{"body": "Yes, I do. Most of the discussion on the Y is “bigger than the 3+S+X combined”. Not super concerned about the +X+S part personally, they are under 20% of the total. The S/X created huge market demand but the price point was beyond reach for many. The 3 satisfied that demand and was a hit.\n\nWhat I wonder is, will the Y equal the 3 (maybe after a year of Y deliveries)? That’s nearly doubling the EV market, which would be amazing. I just am concerned that the early market was enthusiasts, and as word spreads from current buyers, the market keeps expanding, but not doubling. How many people know about Tesla in a positive way, considered the 3, but just don’t want a sedan? If the Y was around when I got mine I would have gotten it over the 3, but the Y itself wouldn’t have pushed me over the edge any more than the the 3 did.\n\nVery much hope I’m wrong - I want the Y to succeed. Just concerned that Tesla can create another doubling for such a similar offering. CYBRTRK, may be a different story, especially if celebs/rappers take to it like they did the Escalade and Hummer.", "score": 3, "replies": []}, {"body": "Where? In the US it hasn’t.", "score": 1, "replies": [{"body": "I'm not seeing 2019 numbers yet but EV sales in the US roughly doubled from 2017 to 2018.\n https://en.m.wikipedia.org/wiki/Plug-in_electric_vehicles_in_the_United_States", "score": 1, "replies": [{"body": "http://www.ev-volumes.com/country/usa/\n\nEV sales declined 9% from 2018 to 2019", "score": 1, "replies": [{"body": "That's not what the article you linked to says. It says sales through Oct were up 2% YoY. And then it *forecasts* that sales will be lower in Nov & Dec, mostly due to Tesla delivering fewer vehicles due to the pent-up demand disappearing -- which we now know is the opposite of what ended up happening. \n\n>236700 plug-in vehicle were delivered in the first 3 quarters of 2019, an increase of just 2 % compared to Q1-Q3 of 2018. Including the October result, 23 200 units, which was 33 % lower than in Oct 2018, the sector is now in reverse for the year. The negative trend is much likely to stay for the remainder of 2019 and the first half of 2020.\n\nWhat actually happened is Tesla's Q4 2019 beat Q4 2018 deliveries by over 20%. I'm on mobile with no time to check geographies so they still may not have blown out 2019 vs 2018 for US but the linked article doesn't say otherwise either.", "score": 1, "replies": [{"body": "Look at the last chart. The total US EV market declined YoY.", "score": 1, "replies": [{"body": "The 2019 column is still just the numbers they forecasted earlier in the article, before actual Nov and Dec results were in. That's why the title of the article is \"USA Plug-in Sales for 2019 YTD October\".", "score": 1, "replies": [{"body": "Yes, but the numbers for sales are now out for December and November and have now confirmed the YoY trend.", "score": 1, "replies": [{"body": "Do you have a source for that? The only thing I've seen is Tesla's IR report showing the opposite -- but it doesn't break out US vs international.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I have a Santa Fe.  The 3 is cool and I would love one, but I am awaiting the Y because I need an SUV-sized vehicle to replace the fossil.  I would consider an E-Kona, but it feels like settling for second-best, not to mention, it does not seem like Hyundai really want to sell it.", "score": 6, "replies": []}, {"body": "Who cares if it canabilizes the 3. It will likely have a better margin and production limited is production limited any way you slice it.", "score": 4, "replies": []}, {"body": "You must not have kids", "score": 2, "replies": [{"body": "A college senior and a grad student! Neither is a factor in car buying anymore.", "score": 2, "replies": []}]}]}, {"body": "I think you’re right, but Tesla hasn’t released specs yet.  I’m concerned that it won’t measure up to other compact crossover SUVs.  At least that’s why my wife is on the fence.", "score": 1, "replies": [{"body": "What specs are you referring to? Range/performance/cost is known. Cargo space can largely be guessed at.", "score": 1, "replies": [{"body": "For my wife it feels smaller than her Subaru Forrester it’s going to be a no go.  She also thinks she’s going to lose the increased visibility you get by having more ride height.\n\nI am optimistic, but I’m currently not increasing my position until I understand how that Y will measure up.  My wife probably isn’t the best gauge, it’s just the best one I have right now.", "score": 3, "replies": [{"body": "Model Y has 66 cubic feet of space, the Subaru Forester has 76.", "score": 1, "replies": [{"body": "That’s cargo space, although I do wonder if the frunk and truck well are included in the 66 cubic feet.  The entire decision may come down to does visibility make her feel like she’s driving a small SUV of does it feel like a car.\n\nI’m concerned that many of the critics are going to call it a car.  Hopefully I’m wrong and I’m a few months I have a Y in my garage and a few extra shares in my account.", "score": 1, "replies": [{"body": "I see your point. I'm pretty sure the Model Y has enough cargo for very nearly anyone, but I don't think it will feel remotely as high as a traditional boxy SUV. To me, that's a good thing, as boxy SUVs have dangeously bad road adhesion, but some people just feel more powerful when they feel taller than everyone else.", "score": 1, "replies": []}]}]}]}, {"body": "Cargo space is also known: 66 cubic feet.   \n\n\nWay more than others in class.", "score": 2, "replies": []}]}, {"body": "What specs do you want to know that they have not released?", "score": 1, "replies": []}]}]}, {"body": "I’m torn between the Y and Cybertruck. I mean I like the looks of the Y more, but the Cybertruck gives more value for the money and has truck uses (which I’ve I would only use to haul something once per month). Buuut the Y looks like it would be a more comfortable road trip car. \nCan’t decide :/", "score": 7, "replies": [{"body": "Buy both", "score": 7, "replies": []}, {"body": "Cybertruck is superior value, but BIG (which has its costs e.g. space needed, weight).", "score": 5, "replies": []}, {"body": "For my preferences the only thing Y has over cybertruck is that it will be available much sooner.  Cybertruck cabin is so spacious and comfortable like so much more room to stretch out.  The dash is almost like having a desk.  Elon is 6'2\"  and he looks like a kid in that giant cab when he was out driving it.  With air suspension ride, tons more storage.  Fix your own flat and re inflate with on board compressor. it  Seems like it would be the superior road trip vehicle.\n\n\n  Y could also win if you had to do a lot of crowded city driving and tight parking.  But for roadtrips it seems tough to beat cyber truck.", "score": 1, "replies": []}]}, {"body": "Model Y is gonna kill BMW. Their growth is in China where their best sellers are X2-X4. Tesla Model Y build at scale will made those obsolete. The iX3 won't be able to compete with the Y.", "score": 14, "replies": [{"body": "BMW already hurting with new 3 series sales vs model 3, model Y will hit x3/x5 hard, and those are their cash cow vehicles.", "score": 6, "replies": [{"body": "Not true. BMW sold more vehicles in 2019 than in 2018. I believe the only European car maker to do so. Also, X5 is in the same class as The X", "score": 2, "replies": [{"body": "3 Series sales are flat though at best after introducing a new model, not what they planned for.\nAnd the Y will take sales from x3 and x5", "score": 2, "replies": [{"body": "RemindMe! 2 years", "score": 2, "replies": [{"body": "There is a 20.2 hour delay fetching comments.\n\nI will be messaging you in 2 years on [**2022-01-03 10:17:19 UTC**](http://www.wolframalpha.com/input/?i=2022-01-03%2010:17:19%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/teslainvestorsclub/comments/ej71ok/model_y_will_make_tesla_billions/fcx174o/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fej71ok%2Fmodel_y_will_make_tesla_billions%2Ffcx174o%2F%5D%0A%0ARemindMe%21%202022-01-03%2010%3A17%3A19%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ej71ok)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}, {"body": "And Porsche.  Their SUVs now account for most of the profits and enable the sports car development.", "score": 2, "replies": []}, {"body": "Agreed. I hope we see some great EVs in the SUV category from BMW & co. soon.", "score": 0, "replies": []}]}, {"body": "Gf3 and model y are worth 200 each to the stock price", "score": 9, "replies": [{"body": "That looks like a pretty random number. I love Tesla/TSLA as much as the next guy and see a bright future for it, but fundamentally GF3 alone isn't worth $35B.", "score": 3, "replies": [{"body": "Gf3 pumps out model 3s directly into the biggest premium sedan market in the world with a hard-on for evs and likely for the lowest manufacturing costs in the world. Gf3 is a money printing machine.", "score": 13, "replies": [{"body": "Lol I agree but that doesn't make it worth $35B, even with the most optimistic calculations. The China opportunity, sure, more than $35B; GF3 as a single factory, nope.", "score": 3, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Crazy. But even that seems low. A standard 10x EBITDA puts the value at $75B heh. A company could more or less buy that factory for $75B and get their money back in 10 years.", "score": 10, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Big players would never export their factories.\n\nBUT.\n\nThis could enable a new age of innovative startups. It would require Tesla to literally create the market, with initial losses. But what if you let a startup redesign the base Tesla frame with accessories, enhancements, or major redesigns that Tesla would otherwise not focus on. They could Tesla cars into a hardware/software platform. \n\nImagine how NVIDIA sells their GPUs. There is the founders edition, but actually the secondary market has much higher volume. This allows NVIDIA to scale while staying more agile by focusing on their core IP. A similar concept could emerge for the Tesla hardware/software platform. Focus on the platform, and allow startups to experiment with different body shapes or interior features.\n\nThis of course pairs nicely with their Supercharger and Self-Driving infrastructure.", "score": 2, "replies": []}, {"body": "I agree. Tesla have talked bout this. They've designed the factory as a product. We saw how quickly Giga 3 was built, then ramped to well over 1,000 a week in no time.\n\n&#x200B;\n\nIMO they will license factory design and/or partner with others to get battery production to multi terawatt-hours ASAP.", "score": 1, "replies": [{"body": "Yea and lest we forget the 30 second silence prior to answering yes to a question along these lines on the last earnings call.", "score": 1, "replies": [{"body": "Indeed.\n\nAnd another instant, Elon literally said \"we don't want to let the cat out of the bad\".. implying they will at battery and powetrain investor day.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I'm not worried about the y but I do think it will cap model 3 sales at about 300k year.", "score": 4, "replies": [{"body": "Globally?", "score": 5, "replies": [{"body": "Yeah unless they find a way to lower prices. They can increase volume by a lot with fairly small price cuts i.e. every 5% price cut might be 10% increased unit demand. If the model y lowers costs because of shared platform then all bets are off. \n\nBut I have to believe anyone who would have bought the 3 is drawn substantially to the y and it could peel off 50% of potential model 3 buyers. That's a strong headwind.\n\nAll I want from Tesla is 50% unit growth and that is not at risk imo. The model y will be supply constrained in 2020 which should lessen the impact somewhat.", "score": 2, "replies": [{"body": "FYI, the battery costs are following a declining curve, that's the most expensive item in the vehicle. Computer costs loads too, also on a declining cost curve. And as a company, Tesla is getting way more efficient -- at EVERYTHING including supply chain, manufacturing methods, production ramps, factory design etc.  Economies of scale.  \n\n\nThey will get cheaper to make, more profitable and lower in cost over time (unless FSD is solved..).", "score": 3, "replies": [{"body": "Agreed", "score": 2, "replies": []}]}]}]}, {"body": "Anticipating model 3 refresh in 2-3 years", "score": 2, "replies": []}, {"body": "Family sedans are dying, but performance sedans are a different beast.", "score": 1, "replies": []}]}, {"body": "the one thing I think they should’ve changed was the front lights but it’s still epic", "score": 2, "replies": [{"body": "Unnecessary complexity.\n\nI get it aesthetically though. Just changing the lights could make a huge visual difference.", "score": 7, "replies": []}]}, {"body": "Wait, *étron* means *turd* in French??\n\nI almost missed that one! Had to go back.", "score": 2, "replies": [{"body": "Haha, yep...", "score": 3, "replies": []}]}, {"body": "I wish it didn’t look so similar to the 3 to differentiate itself on the road and spur more viral interest when it comes out. I have trouble telling them apart in pics. Maybe irl it will look more different. \n\nAlthough I do understand that the more parts in common decreases the cost to produce.", "score": 3, "replies": [{"body": "But that's the point.\n\nModel 3 is like the perfect Sedan.\n\nWhy fuck with it?\n\nJust think of it as an iPhone XL or whatever they're called.", "score": 19, "replies": [{"body": "> or whatever they're called\n\nI think you might be proving his point!", "score": 7, "replies": [{"body": "Not an iPhone owner, know nothing about any of them.", "score": 0, "replies": [{"body": "You should check them out, they’re like the Tesla of pocket computers. ;)", "score": 9, "replies": [{"body": "No, please dont say this. Its tarnishing the name \"Tesla\"", "score": -6, "replies": []}]}]}]}]}, {"body": "Somebody on /r/TeslaMotors posted a Model Y charging next to a Model 3. The size difference is unmistakable and you can definitely tell them apart.", "score": 11, "replies": []}]}, {"body": "Vehicles will be on the order of $100B business inside 5 years, and Elon says Tesla Energy will be as big or even bigger. All with final profit margins in excess of 20%. I’m not even considering RoboTaxis or FSD. The size of what’s coming is mind boggling. I honestly can’t yet wrap my mind around it.", "score": 1, "replies": [{"body": "These statements are reasonable.", "score": 1, "replies": []}]}, {"body": "Thought this was a really great video!", "score": 1, "replies": [{"body": "Cheers dude.", "score": 1, "replies": []}]}, {"body": "Hopefully, no other car has yet.", "score": 2, "replies": [{"body": "lol", "score": 0, "replies": []}]}, {"body": "It’s not a real SUV.. if that doesn’t matter to most people, then ok I guess...", "score": 1, "replies": [{"body": "If it functions how people want it to (e.g. enough space, safe), the label you assign it does not matter.", "score": 6, "replies": []}]}, {"body": "Another great video.  Though you repeatedly refer to the model Y as an SUV.  I think that seems a stretch.  I may be wrong but I dont believe Tesla refers to the Model Y as an SUV themselves (They do call the X an SUV though). Seems more accurate to call it a crossover or hatchback.", "score": 1, "replies": [{"body": "SUV is a major category, crossovers fall within in.", "score": 5, "replies": []}]}, {"body": "Just like the model 3 was supposed to? Yet they've posted a 1.7 billion loss since the 3 was released.", "score": -4, "replies": [{"body": "TIL Chris does not understand that Tesla are investing heavily to scale, not to appease wall st.", "score": 2, "replies": [{"body": "Their capex has decreased quarter over quarter over the past year", "score": -1, "replies": []}]}, {"body": "Nope.  The Model 3 was supposed to deliver $10k gross profit each.  It is now doing that and has enabled Tesla’s gross profits to entirely cover Op Expenses ever since the ramp hit half scale.\n\nI.e. the 2nd half of Model 3 ramp, The Model Y and the Solar Roof gross profits, will pretty much all drop straight through to net profits, since Op. Expenses need to grow relatively little.", "score": 2, "replies": []}]}]}
