{"title": "While we were clouded with news about the Iran conflict and it’s effect on the market, ISM data came back yesterday showing manufacturing has retracted for 5 months in a row to the lowest levels since the Great Recession.", "selftext": "ISM manufacturing survey for December 2019 as it has fallen to it's worst level since 2009 printing 47.2 in December and missing expectations.  Production fell to 43.2 expectations were for 49.1. \n\nhttps://www.marketwatch.com/story/us-manufacturing-slumps-worsens-in-december-as-ism-index-falls-to-10-year-low-2020-01-03", "id": "ek42yn", "created_utc": 1578179057.0, "score": 585, "upvote_ratio": 0.93, "num_comments": 92, "comments": [{"body": "This is mostly from Boeing. We will see in January how many Boeing suppliers are affected and what the economic run-off is.", "score": 179, "replies": [{"body": "This makes sense to me. I work in the aviation manufacturing field but most of my parts go to Airbus and others. Not much to Boeing. We have plans to hire over 200 people this year just at my site. \n\nDuring the recession I could see in my shop when manufacturing was suffering. This time it's not the same as 2009-2012.", "score": 69, "replies": [{"body": "The machine shop my friends used to work at made flap tracks and door hinge assemblies for Boeing. They were on shakey financial ground to begin with due to the owner's poor financial habits. They finally closed shop last month due a production halt. If the owner hadn't been living outside of his means and would have just reinvested or saved his profits they would have been fine. Instead he spent every dime to build a multi-million dollar house, new cars every couple months, etc.", "score": 5, "replies": [{"body": "Sweet user name", "score": 1, "replies": []}]}]}, {"body": "How do you guys know these things?", "score": 20, "replies": [{"body": "It's no secret that Boeing has shut down production lines. This means that their suppliers have lost significant business.", "score": 45, "replies": []}, {"body": "It's my job so I am very in touch with the American aviation market. It's all I've done for the past 10 years. I hired into a large US conglomerate right out of college. I can say one thing for sure. I have never seen a job market like the current. I had to beg for a job out of college. Now I am turning down offers every other week.", "score": 10, "replies": [{"body": "Let me guess, they're addressing an industry-wide talent shortage every way they can except raising the wages?", "score": 6, "replies": [{"body": "Lol, you are correct but I think the tide may be turning on that just because of our huge turnover rate. People are leaving for more pay and turnover rate is over 50%. But accounts don't look at cost from that perspective.", "score": 5, "replies": []}]}]}]}]}, {"body": "*The deterioration in December stemmed in part from Boeing suspending production of its  troubled 737 Max jetliner and the residue of a recent strike at General  Motors*", "score": 82, "replies": [{"body": "This is a terribly disingenuous quote from the article, as the sentence completes\n\n\"but the report showed broad weakness in manufacturing tied to the ongoing trade war with China.\"\n\nWhy didn't you include the entire sentence?", "score": 10, "replies": []}, {"body": "By that logic it technically stemmed from everything.", "score": 26, "replies": []}, {"body": "December I know a lot of people took vacations early", "score": 5, "replies": [{"body": "What does that have to do with the plans of manufacturers? The ISM surveys a collective of manufacturing business planners across industries. \n\nIt's not like because he has a few employees on vacation he is all of a sudden going to abandon plans to start building up a new manufacturing line. This is way more significant than a few people taking PTO.", "score": 1, "replies": [{"body": "Most facilities shut down for a week maybe 2 and then there is inventory. December has always been a low manufacturing month", "score": 1, "replies": [{"body": ">wn for a week maybe 2 and then there is inventory. December has always bee\n\nFrom the respondents, none of which say anything about PTO or vacations. If you have more information on the historic December downturn in PMI I would LOVE to see it. I'm searching but can't find anything to support what you're saying. \n\n## WHAT RESPONDENTS ARE SAYING\n\n* **\"Backlog of orders is shrinking due to new order pace continuing to fall.\" (Computer & Electronic Products)**\n* **\"Due to sluggish sales, we have introduced promotions to generate increased sales.\" (Chemical Products)**\n* **\"Cautiously optimistic is the rule these days. Sales are decent, but we're wondering what 2020 will bring. Still hedging that it will be successful — but maybe not as much as this year.\" (Transportation Equipment)**\n* **\"Starting to see suppliers try to pass on costs associated with tariffs. Uncertainty on the trade front continues to keep agricultural markets on the defensive.\" (Food, Beverage & Tobacco Products)**\n* **\"Down month-to-month, but up over last year.\" (Miscellaneous Manufacturing)**\n* **\"Anticipated large export orders did not materialize. As a result, expected U.S. production has decreased.\" (Fabricated Metal Products)**\n* **\"Dealer inventories have rebounded, and overall customer market has softened, resulting in corrections to near-term production schedules and a tentative forecast outlook.\" (Machinery)**\n* **\"Export markets continue to weaken for plastic resins — Mexican producers are actually trying to sell product back into the U.S. due to weak in-country demand.\" (Plastics & Rubber Products)**\n* **\"Our outlook for the first quarter of 2020 is positive. We have secured contracts from a number of former customers and expect sales growth of about 5 percent over Q4 of 2019.\" (Textile Mills)**\n* **\"The construction market seems to have slowed for end of year. Overall, it’s marginally up.\" (Nonmetallic Mineral Products)**", "score": 1, "replies": []}]}]}]}]}, {"body": "US is not manufacturing country, yes it has effect on economy but maybe not as big as one think", "score": 37, "replies": [{"body": "Manufacturing is about 11% of the economy. You're right that this alone won't drag us into a recession (not at 47 anyway), but services (the other 89%) is also slowing. It's not in contraction yet, but if it gets to like 50.5 or maybe even 51, and manufacturing is still in the dumps, that could be enough to have a minor recession, even though services technically is still expanding", "score": 6, "replies": [{"body": "There's no such thing as a minor recession anymore. We have a bubble economy so it's all up or the bubble is pricked.", "score": 1, "replies": []}]}, {"body": "Don't tell them this. Macro economics doesnt exist and manufacturing should all be brought back into the us, to hell with reason and lower prices.", "score": 2, "replies": [{"body": "Look commie...\n\nThe deep state is putting chemicals in the water to make the frogs gay.  Then even the frogs won't have America's back.\n\nGood luck", "score": 16, "replies": [{"body": "Omg 😂", "score": 5, "replies": []}, {"body": "Death is a preferable alternative to communism.", "score": 3, "replies": [{"body": "That depends entirely on whether you were born black in the projects or not.\n\nI got to smoke weed in my mom's minivan so I didn't get thrown into jail at age 18.\n\nMy parents paid for college.  No debt.  I get to curse off my boss quit and get a new job tomorrow.  \n\nThe more debt you have the more likely you are to let your boss f*** your wife.\n\nAnd private debt is going up.\n\nThey taught me about investing... How to make money off of someone else's work.\n\nBlack Cubans before communism had a lower literacy rate, and higher infant mortality rate than they do now.\n\nBlack women in America have a higher chance of dying during childbirth than anyone in Cuba.\n\nToday Cuba has a higher literacy rate than the United States.\n\nCommunism does suck.\n\nBut it seems good to poor people when they have no choice.\n\nIf capitalism wants to exist it needs to preserve itself.\n\nBread and circuses...\n\nThe Romans understood it... Marie Antoinette did not\n\n\nLong story short I don't want To lose all of my investments when the poor people revolt just because the Walton family with no skills is afraid of being a little less uber wealthy so they don't want to pay any taxes and they want public schools where kids get out of high school thinking the Earth is flat...\n\nF*** it.\n\nNot my kids right?!?\n\nBut it will be our kids getting their heads cut off when the s*** hits the fan.", "score": 5, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Is this why the poor dumb fucks in Cuba have a higher literacy rate and standard of living than the poor dumb fucks in America?", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "No.\n\nThese are statistics buddy.\n\nHigher literacy rate.\n\nWe have a higher percentage of people who can't read than they do... In fucking Cuba.\n\nPeriod.\n\nFacts.", "score": 3, "replies": [{"body": "The USSR also had a higher literacy rate, it did so because your literacy is not a choice, it is a directive. They also (like cuba) have an abysmal standard of living with a joke of an economy and collegic system.", "score": 2, "replies": [{"body": "Literacy shouldn't be a choice.  That's why we have mandatory public education.\n\nAnd our mandatory public education isn't anywhere near as effective as Sweden or Norway or Denmark or Germany or even most of South America... All countries with \"socialist\" policies.\n\nAmerica is not #1.  It's just the best place to invest.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You are an idiot and I do not have time to play this game.\n\nThe poorest people in America are homeless and cannot read.\n\nThe poorest people in Cuba have a shitty house and can read.\n\nThe ratio between the median salary in the median house cost in Norway smaller and that ratio in the United States. That's a fact.  That means on average an American worker needs to work more hours to buy an average house. \n\nThat ratio has been growing.  Faster and faster.  It's good if you are a landlord or a bank selling mortgages.\n\nIt's bad if you want to buy a house and you have student loan debt.  (The ratio between median income and tuition costs has also been growing) \n\nYou obviously don't look at charts.  You're just another stock market fan.  Stocks go up. You make money.  Therefore America works. Because AMD and NVIDIA work.\n\nThe fact that it is taking so long for you to understand macroeconomic statistics that have nothing to do with my opinion or yours is proof of how shitty our education system is.\n\nYou can't accept facts.\n\nIt's like trying to tell you the Bible wasn't written by Moses.  But your Rabbi said it was and mom said Rabbi is right sooo...\n\nCapitalism is a religion to you.  You've been arguing with statistics.  Cuban poor people can read.  Our poor people cannot read... Our schools can't teach them to read.  THESE ARE FACTS CUTE GIRL IN A DRESS.  \n\nSorry.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes. I agree with everything you said....\n\nBut our poor people cannot read sweetheart.\n\nThey can't read as well as Cubans", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "\"apparently\"\n\n\n\"Yeah but poor people don't matter\"\n\n\nYou are cute.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Google what an embargo is.  USA banned trade with Cuba... Effectively fucking them.\n\nThat's not because of communism.  That's because of US military might.\n\nThen compare Cuban GDP to El Salvador or Guatemala...\n\n\n\nImagine if you had the education I had.  \n\nImagine if I didn't like teaching you shit for free.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nobody said it was superior.  Are you 12?\n\n\n\nThey are subsisting.  There are no cartel wars like Mexico. Kids aren't digging through the garbage like in Guatemala... \n\nBoth capitalist countries.\n\nAlso it's not just the US market... Other countries around the US risk pissing off the US if they trade with Cuba.\n\nSanctions and trade embargoes are the opposite of free markets.\n\nYou know you're confused.  You should read up a bit about what free markets actually mean instead of just repeat the argument USA is the best...\n\n\n*If its really that great you should come here and give up your free healthcare.*", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "How much money is spent means nothing.  Half the spending is waste.  If the school nurse has to spend $2500 on epipens because corporations are allowed to price gouge people from medication...\n\nThen it might look like we're spending more money but in reality we're just throwing my money away.\n\nbut all you care about is the fact that you could buy stock in one of those corporations that is ripping everybody off.\n\nGreed\nOr...\nCompassion\n\nOne is for losers.\n\nObviously you think it's the second one.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I have businesses telling me that due to tariffs, they’ve moved manufacturing overseas.  A lot of them were producing parts in the US and shipping them overseas, but using raw materials shipped in from China.  With the tariffs, in some cases it makes more sense just to manufacture where the raw materials and customers already are. Not everything made in the US is for the US consumer.  Not something the orange fella probably factored into his policy.", "score": 4, "replies": []}, {"body": "Ism means nothing. This is a services economy and supply chains are also being shifted to ai instead purchasing managers.", "score": 16, "replies": [{"body": "Can you show me in this chart what you mean by that? \n\n [https://www.tradingview.com/chart/MAN\\_PMI/lMbu8nPl-ISM-vs-S-P500/](https://www.tradingview.com/chart/MAN_PMI/lMbu8nPl-ISM-vs-S-P500/) \n\n&#x200B;\n\nSeems to me whenever manufacturing is contracting via the ISM PMI, there is a correlation in the stock market and economy.", "score": 3, "replies": [{"body": "No. All I can say is become educated on how things change over time and form your own opinions based on facts. You could say the same about a lot of backwards looking outdated economic indicators...if it was as easy as you’re implying everyone would be rich man.", "score": 0, "replies": [{"body": "Have you ever worked for a large publicly-traded company closely integrated with manufacturing? How many of their quarterly all-hands meetings have you attended? I have, and I can tell you the CEO and president are fixated on ISM PMI. If ISM truly means nothing, as you specifically said, then why would the leaders of companies A) still participate in a meaningless survey B) take so much time correlating business performance and investment intentions to it? \n\nI don't see how suggesting I \"become educated\" on things is helpful here.", "score": 2, "replies": [{"body": "You’re working at the wrong companies if this is true.", "score": 1, "replies": []}, {"body": "The fact that I’m getting downvoted on here is great because it means people actually still give this shit weight which means the market will still be just as inefficient going forward 😃.", "score": 1, "replies": [{"body": "In case you’re curious I didn’t downvote you. I appreciate the conversation. I didn’t upvote either but I’ll change my non vote to an upvote. -1 to zero for you! \n\nAlso, I’m not exaggerating about my experience with PMI at a multi billion dollar manufacturing centric company. The ceo cares and so should you. \n\nNow stop being a curmudgeon :)", "score": 1, "replies": [{"body": "Dang less arbitrage ops.... ;)", "score": 1, "replies": []}]}]}]}, {"body": "You've given zero facts. Just \"things change bro\"", "score": 2, "replies": [{"body": "Ism is a survey of human purchasing managers, that’s all you need to know.", "score": 1, "replies": []}]}]}]}]}, {"body": "Bummer for manufacturing, but ISM Service index is still showing expansion, as is GDP and employment data. \n\nSo long as the rest of the economy keeps chugging along, we'll burn through excess inventory and mfg will pick back up. Housing construction has a good 2020 forecast, so that can soak up at least some of the slack.", "score": 9, "replies": [{"body": "The rate of expansion for services is slowing too, and if both are below 50 you're essentially guaranteed recession.", "score": 1, "replies": []}]}, {"body": "I have SPCE and AMD with stop loss set\n\nBring on the recession.", "score": 3, "replies": []}, {"body": "DT used a literal smoke screen", "score": -14, "replies": [{"body": "While I’d like to blame him for everything, Boeing isn’t really his doing. It’s generations of government allowing Boeing to basically run the FAA.", "score": 31, "replies": [{"body": "Eh? FAA has done a pretty good job. Commercial airline crashes are virtually non-existent.", "score": -1, "replies": [{"body": "You need to read into the 737 Max approval process. Unless I’m saying the wrong organization.", "score": 2, "replies": [{"body": "Yeah, I'm sure there were flaws in that process, but the US went something like 9 years with zero large commercial airline deaths in the past decade. Calling them corrupt for generations is a bit harsh.", "score": -5, "replies": [{"body": "No, you don’t “need to be sure”, and I didn’t say “corrupt”. \n\nThe FAA has been essentially allowing airlines to self-certify their products. I’m not just making grandiose statements out of thin air", "score": 4, "replies": [{"body": "K, and then two crashes happened overseas and the FAA said your certifications suck bro, you're grounded.", "score": 1, "replies": []}]}]}]}]}, {"body": "you're both right imo - everything isn't about trump, but trump is def creating a smoke screen", "score": -6, "replies": []}, {"body": "I’m sure the numbers are legit, and might have little to do with trump’s doing, but the manufactured geopolitical crisis is 100% made in the White House", "score": -10, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "You think Trump is trying to hide a PMI report?\n\nO.o", "score": 0, "replies": [{"body": "No i'm the opposite, im saying that the implication that he is striking Iran in order to cover up for that is absurd.", "score": 3, "replies": [{"body": "Looks like I misread the tone of your comment", "score": 1, "replies": [{"body": "At least the silly thought that he is starting a war to deflect away from the impeachment has a 1% thought of it being smart; the ISM deflection is absurd.", "score": 3, "replies": []}]}]}]}, {"body": "The attack of the embassy was after we attacked Iranian militants in Iraq... I’m sure it’s hard to believe that any politician would ever create a distraction ...", "score": -4, "replies": [{"body": "You mean the militants in iraq that are connected and financed by Iran that attack american soldiers?\n\nYou think i'm going to have a problem with that? Iraq is a warzone.", "score": 6, "replies": [{"body": "Yes, exactly those militants! They have been there for years and we never attacked them. What changed in the last two weeks. Maybe someone heard about manufacturing numbers early and needed a smoke screen?", "score": 2, "replies": [{"body": "You mean the militants that are financed and trained by Iran? That are actively attacking the US?\n\nWhat changed in the last 2 weeks?  They attacked the US embassy.", "score": 5, "replies": [{"body": "The attack in the embassy was after we attacked Iranian militants. Whatever sorry I got you triggered", "score": -1, "replies": [{"body": "So an ongoing war between US soldiers controlling Iraq, and a violent militant group in Iraq financed and trained by Iran are fighting.\n\nThe militia group attacks the US embassy, which the US retaliates with a strike on Iranian commanders in Iraq.\n\nI fail to see how this is the US fault unless you're going to somehow tie it to going back to the US going into Iran in the first place.", "score": 5, "replies": [{"body": "This happened before the embassy was attacked. The US decided to escalate the attacks after years of small provocations. Why now? Because it’s convenient, without a unifying theme, what’s left is a deteriorating economy, tax season where most people will remember how they got screwed and the impeachment. \n\n\nhttps://m.youtube.com/watch?v=x3cFFTJYv2c", "score": 1, "replies": [{"body": "So do you have any evidence for your conspiracy theory or are you going to keep thumping the table screaming about correlation == causation.", "score": 2, "replies": [{"body": "Yes, off course. I have video of the meeting where the strategy was discussed along with a copy of the email where everyone was notified. GTFOH", "score": 1, "replies": [{"body": "Right, so you have no evidence or proof substantiating your position or thoughts.\n\nI don't agree that this attack is in any way a distraction from the manufacturing numbers, or his hilarious impeachment process that is so bad that they don't want to even put it to the senate.", "score": 2, "replies": [{"body": "Good for you, keep believing.", "score": 2, "replies": [{"body": "Frankly, I don't really care that Trump smoked a bunch of terrorists that were doing terror.\n\nIf you think that the Iranian General was there for peaceful things, you're wrong.\n\nSo we have the US that isn't blameless, smoking an Iranian that also wasn't blameless.\n\nI don't really give a fuck.", "score": 2, "replies": [{"body": "Nobody is sad that a bunch of terrorist were smoked ... what I said is the smoke has a purpose", "score": 1, "replies": [{"body": "Of which you have no proof, merely reaching assumptions of guilt.\n\nEspecially since everyone who looked into the ISM is saying its reasonable and because of BA and some strikes.", "score": 2, "replies": [{"body": "5 months straight because of BA guys, nothing to sew here!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Aren't the US soldiers the violent militant group in Iraq?", "score": 1, "replies": [{"body": "yes", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It's so surprising to you that brown people in a brown country attack armed white dudes who showed up 17 years ago and blew up schools and hospitals and turned the place into Africa.\n\nThey're shooting American soldiers!\n\nWho the fuck wouldn't?", "score": 2, "replies": [{"body": "so my position is really just \"its a warzone. whats your point\"\n\nand I stand by my position.\n\nPeople get killed on both sides all the time, we shouldn't be there but while we are there, whats the issue? The guy was arming and training militias to attack US soldiers.\n\nNo ones hand is clean here, its just a proxy war.", "score": 2, "replies": [{"body": "These militias were first set up to defeat Isis. Now that those crazies are dealt with, they've turned their attention to the other foreign invading killers in the region. And we're worried a majority Shia country is being run by.. Shias? If we wanted a Sunni we should have left Saddam in.\n\nIt's a bunch of bullshit.", "score": 1, "replies": []}, {"body": "You don’t know anything you ignorant, angry Canadian", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Accurate.", "score": -6, "replies": []}, {"body": "More likely the cia than the wh", "score": -5, "replies": []}]}, {"body": "But it isn't just Boeing. That might be a big factor in the numbers, but the article notes that \"the report showed broad weakness in manufacturing tied to the ongoing trade war with China.\"", "score": 0, "replies": []}]}]}, {"body": "Manufacturing has been on a decline since the late 70s you can thank China for that", "score": -3, "replies": [{"body": "Maybe as a percentage of total GDP, because we've become much more of a services country, but gross USD in manufacturing has **never** been higher. \n\n [https://data.worldbank.org/indicator/NV.IND.MANF.CD?locations=US](https://data.worldbank.org/indicator/NV.IND.MANF.CD?locations=US) \n\n&#x200B;\n\nWhat data are you looking at?", "score": 3, "replies": []}]}, {"body": "And you wonder why he started a war?", "score": -13, "replies": [{"body": "Nothing to do with this", "score": 7, "replies": [{"body": "Republicans start wars to push slowing markets up.  It's the 2nd most popular trick after a tax cut for the wealthy.\n\nIt's also a great way for incumbents to stay in power.  Nobody wants a new president in the middle of a war.\n\nI'm looking for at least 10 downvotes here.  Let's go boomers.", "score": 4, "replies": [{"body": "Again: manufacturing had nothing to do with the Iran conflict.", "score": 2, "replies": []}]}]}]}]}
