{"title": "100 POINT half-hour range", "selftext": "What  a move for the market later in the day today during the Fed Announcement and J-Pow speech.  4150- 4250 range on SPY from 2:30 -- 3:00 PM.  How did everyone do with this huge half-hour move ?  \n\nhttps://preview.redd.it/iakoflalalx81.png?width=1135&format=png&auto=webp&s=ab193639df4db1eda6bc14a969b420f0156e915d", "id": "uipsyr", "created_utc": 1651726780.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 37, "comments": [{"body": "i got burned so hard it made Pompeii look like an ice bath", "score": 17, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No, I was betting on .50. I was shorting, my profits hit 100% but I didn’t close in time. The issue with discussing this in hindsight is the biggest aspect, uncertainty, is now known so it looks “obvious”. It wasn’t\n\nNo one can predict market reaction", "score": 6, "replies": [{"body": ">No one can predict market reaction\n\nWhich is why you don't try. The event volcrush is a given, so unless there is a nasty surprise at 2pm, the odds are in favor of a vanna rally. There is zero point in entering a position on FOMC days before 2:30pm. The market will tell you what direction it wants to go, at the top of it's voice, the trader's only job is to be patient and wait for it.", "score": 2, "replies": [{"body": "Very good point.  My early speculation (before Powell speech but after announcement) really cost me.  Fortunately, my hedge calls covered my put losses and then some.   Staying disciplined to trade the chart and WAIT until the market decides where it is going is better than getting in early on speculation to the downside / upside beforehand", "score": 2, "replies": []}, {"body": "I disagree with that completely . \n\nGood thing too, because that’s what makes a market. \n\nDid you miss the part where I clearly stated my positions were profitable?\n\nYour claims of “vanna” aren’t substantiated, it’s speculation. You have no idea what drove that rally whether it was hedges removed, shorts covering, long only funds initiating, you have absolutely no idea the intention of market participants.", "score": 1, "replies": [{"body": "\\> Your claims of “vanna” aren’t substantiated, it’s speculation\n\nIt's experience, seeing it time and time again. It's also understanding how markets work.\n\nThe person you are responding to is 100% correct -- the only way the volatility doesn't compress today is if the Fed comes out with a downside surprise, because the Fed Heads went to great lengths, each individually, to tell the market in advance of the blackout, how today would go. \n\nNo, no one \"knows\" what the market will do, but one can place odds on outcomes, and because of the market condition going into this event, the odds favored a relief/vanna rally. \n\nFortunately, on days like today, no one \\*has\\* to predict what the market will do. You simply wait until Powell starts talking, and the market will \\*tell\\* you what it is going to do. Which is what I did, and made 63 points in futures.", "score": 2, "replies": []}, {"body": "\\> whether it was hedges removed, shorts covering, long only funds initiating, you have absolutely no idea the intention of market participants.\n\nThe catalyst is immaterial. Event volatility compressed, and none of what you state makes for a 160-point rally without help from a lot of potential energy stored in the options complex.", "score": 1, "replies": [{"body": "“experience” \n\nlol\n\nthat’s actually called speculation\n\nlet’s try again since you didn’t read it the first time \n\n1) my positions were profitable \n2) you can’t substantiate the markets movements with certainty, even if you use a magical word that is a 2nd order Greek derivative very much known to market makers pricing options \n\nI made a joke about Pompeii. Stop lecturing about microstructure.", "score": 1, "replies": [{"body": "I read it. What I read was \"I didn't take my 100% profit when I could have\" and \"I bet on the direction the market would move in advance of a binary event\". The rest is rationalizing your retail mistakes.", "score": 1, "replies": [{"body": "ok now your flirting with me\n\nI find it quite uncivilized to discloses profit \n\nbut you are so concerned ill let you know my long position was up 2,700% off the lows", "score": 1, "replies": [{"body": "What was it when you exited, is the more important question. You said you were short, right? That would mean you either got your face ripped off by the rally, or that was a typo. I'm also assuming that you were short before the event, but you didn't specify.", "score": 0, "replies": [{"body": "have you heard what they say about people who assume?", "score": 1, "replies": [{"body": "Indeed I have. :) And I think you actually already gave your answer -- you were up 2700% and exited at 100% -- well done, money made. \n\nBut if that's the case, I feel you on that one -- I was up 90 points short futures Monday, and not only missed my opportunity to exit around 4055 (ES), but then watched the market rip 100 points on me, and ended up making a pittance. Total retail move there, didn't lose, but wow what a blunder. \n\nI also wasn't properly prepared to trade the post-FOMC today, and so not only missed the fleeting opportunity in the 4140s (ES) (before the market sprinted the other direction), I had previously planned to buy SPX calls, and simply forgot. At least I didn't make Monday's mistake again...", "score": 0, "replies": [{"body": "No. \n\nmy short position was unrealized 100%. I did not realize it. \n\nmy long position total was 2700% profit. \n\n2 different positions. You assumes I only had one. \n\nDon’t assume with people. Or markets.", "score": 1, "replies": [{"body": "Gotcha -- so you weren't providing full disclosure. Don't be surprised when people misunderstand you then.", "score": 2, "replies": [{"body": "“full disclosure”\n\n😂 \n\nin full disclosure pompeii was *not* an ice bath", "score": 1, "replies": [{"body": "Yeah, I still don't get the whole \"Pompeii\" thing but you clearly do, so...\n\nAt any rate, you could simply have said \"I bought a straddle/strangle, so I didn't have to care what happened at 2pm, RV on FOMC days typically outruns IV so I was set.\" But you didn't, and so we had to spend all this time getting there.", "score": 2, "replies": [{"body": "bless your heart", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Markets moved on Powell affirmation and disclosure the tapering starts later, not today,  set for  June 1, and next follow on  hike,  so far, contemplates a 0.50 move, not 0.75 move.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I agree, but not quite. \n\nThe rally today was unusual, even for an expected rally post FOMC. Let me show you why. \n\nToday's low after the announcement was made at 2:35 pm: 4153.46\n\nthe high was made at 3:53 pm: 4307.66\n\n154.20 pts the 2nd LARGEST post 2pm,  range in 25 years(since 1997).", "score": 2, "replies": []}]}]}]}]}, {"body": "Sold my overnight calls by 1:45pm EST because I was getting too antsy. Profited a fraction of what I could have, but at least I can feel superior knowing I was right.", "score": 5, "replies": [{"body": "Did the same thing but with puts two weeks ago when Powell spoke. Had 225 $430 April 25 puts at .38…. Two days later $11.00 fml 🤦‍♂️ I basically broke even cuz I was scared of a rally. What a bitch it was watching that contract price gain like 10000% over two days", "score": 1, "replies": [{"body": "Better to get out at break even or a tiny profit than in a massive hole, which is where holding usually lands me. \n\nCan't sweat the coulda wouldas too much.", "score": 1, "replies": []}]}]}, {"body": "Not great, Sir. Not great.", "score": 2, "replies": []}, {"body": "Play it safe by buying options spread", "score": 2, "replies": []}, {"body": "Made 63 points on ES long futures, entered when $JPOW said 0.75 was off the table.\n\nI see people entering trades before 2:30 on FOMC days and I'll never understand why.", "score": 2, "replies": []}, {"body": "Sold spx 4300 naked. Call for 40 cents.   same day expiry.  It shot to 7$ at one time.  Ended 17 cents itm. Went thru 100 mini heart attacks in the last hour", "score": 2, "replies": []}, {"body": "My condor got f*cked and I managed to close the call legs for a lesser loss than assignment..  \n\nGood lesson,  jumping right back in", "score": 2, "replies": []}, {"body": "Puts got burnt a bit, sold and bought 3 SPY calls. Worked out ok. You?", "score": 1, "replies": [{"body": "I actually was into QQQ puts by 2:30 PM.  Took a QQQ call a few minutes later as a hedge that I sold for 400% that paid for all my other plays, so I came out of it all slightly green.", "score": 2, "replies": [{"body": "Rode SPY/QQQ/EBAY/NVDA puts all morning. Just bought SPY/QQQ/EBAY calls lol", "score": 1, "replies": []}]}]}, {"body": "Sold a couple 325/330 call spreads on qqq thinking it would never hit. Was on an airplane the last few trading hours so I checked as soon as I had service. Too late. 🤬", "score": 1, "replies": []}, {"body": "Bought SOXL and TQQQ weekly calls around market open. Sold for around 80% total profit before Jpow was done taking questions.\n\nHad a thesis that there would be much more room for upside in tech unless jpow came in extra hawkish. I'd say he was neutral-dovish at best, and my thesis was right.", "score": 1, "replies": []}, {"body": "I was running a 412 SPY straddle set to expire on 5/6.  The run up allowed me to sell off for just over 25% profit.  I might've made a few more percent if I'd been a little patient, but I was very happy to get out while it was green.  Even happier now that I see how today went.  Wow.", "score": 1, "replies": []}, {"body": "I was right on at 3:30. And cried that I was an hour late due to meeting. And closed my app. Then saw a few posts about rug pull and thought “I should buy some puts” and checked price and was crazy cheap (420p) and thought “nah, the market is not that crazy”. And yeah. Fucked twice.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "This comment has been automatically removed. Discord and other chat links are not allowed as an anti-spam measure.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
{"title": "Facebook Parent Meta Slows Hiring in Cost-Cutting Push", "selftext": "(Bloomberg) -- Facebook parent company Meta Platforms Inc. is slowing or pausing hiring for some mid- to senior-level positions, part of a broader plan to cut costs and cope with the challenges facing the social media giant.\n\n“We regularly re-evaluate our talent pipeline according to our business needs and in light of the expense guidance given for this earnings period, we are slowing its growth accordingly,” Meta said in a statement Wednesday. “However, we will continue to grow our workforce to ensure we focus on long-term impact.” \n\nThe move follows a generally upbeat earnings report last week -- with the Facebook platform returning to user growth -- but the company warned that the Ukraine war was weighing on sales. Meta said at the time that it would be reining in its spending plans for the year in light of a weaker revenue outlook.\n\nThat marks a reversal from rapid staffing growth in recent years. Meta Chief Financial Officer Dave Wehner had said in February that the company expected “accelerated headcount” to be the biggest contributor to expense growth in 2022, and the company added more than 5,800 new hires in the first quarter. But last week’s revision to its spending budget is now affecting hiring plans.\n\nMeta, based in Menlo Park, California, had more than 77,800 employees at the end of March. That was up more than 28% from a year earlier. \n\nInsider first reported on Meta’s plans to slow hiring.\n\nhttps://www.bnnbloomberg.ca/facebook-parent-meta-slows-hiring-in-cost-cutting-push-1.1761227", "id": "uike8a", "created_utc": 1651709281.0, "score": 56, "upvote_ratio": 0.87, "num_comments": 42, "comments": [{"body": "Obligatory \"Meta is dying\" post lol", "score": 15, "replies": []}, {"body": "> had more than 77,800 employees at the end of March. That was up more than 28% from a year earlier.\n\nThis makes it sound like they made a huge hiring push and now they're returning to normal numbers. Isn't that a good or at least a neutral thing?", "score": 7, "replies": [{"body": "Yep, people read way too much into this without using any critical thinking, they aren’t going to add 28% more employees every year that’s insane.", "score": 3, "replies": []}]}, {"body": "First sign of the recession", "score": 43, "replies": [{"body": "This is one company", "score": 8, "replies": [{"body": "for now...", "score": 1, "replies": []}, {"body": "Today...", "score": 1, "replies": []}]}]}, {"body": "> but the company warned that the Ukraine war was weighing on sales.\n\nUh... No. Ukraine makes a nice scapegoat, sure, but anyone who believes that Ukraine is somehow causing weaker revenue growth for Meta is foolish at best.", "score": 14, "replies": [{"body": "How the conflict affects the already flaky supply chain, thus businesses, and ad money is definitely relevant.", "score": 26, "replies": []}, {"body": "Russia banned social media during the break out of the war", "score": 19, "replies": [{"body": "And the impact is well beyond Russia & Ukraine.  All global-advertisers are citing the conflict as a major head-wind in Europe.\n\nSNAP cited it as a major reason for missing their targets - they'd been on track prior to the crisis (or at least closer):\n\n>“The first quarter of 2022 proved more challenging than we had expected,” Snap CEO Evan Spiegel said in a prepared statement.\n\n>Spiegel blamed some of Snap’s issues during the quarter on macroeconomic conditions, including advertisers who paused their campaigns after the Russian invasion of Ukraine in February.", "score": 12, "replies": []}, {"body": ">Russia accounts for 1.5% of Meta’s advertising dollars, chief financial officer Dave Wehner said Thursday at a Morgan Stanley conference. Last year, Meta pulled in $114.9 billion in sales—with Russia accounting for $1.7 billion, based on Wehner’s comments. That works out to about $4.7 million lost per day.\n\nAt the margin, sure. But, a 1.5% loss in revenue is a rounding error for companies as large as Meta.", "score": 0, "replies": [{"body": "I wonder how much money is actually tied to Russia that is harder to directly track. Facebook is an absolutely massive asset for Russian propaganda.", "score": 2, "replies": []}]}]}, {"body": "Not Ukraine. The Ukraine conflict. Involving 200 million people directly with restrictions/changes by governments that affect Meta", "score": 3, "replies": [{"body": "It's 'Ukraine' and not 'the Ukraine'\n\nConsider supporting anti-war efforts in any possible way: [[Help 2 Ukraine](https://help2ukraine.org)] 💙💛\n\n[[Merriam-Webster](https://www.merriam-webster.com/dictionary/Ukraine)] [[BBC Styleguide](https://www.bbc.co.uk/newsstyleguide/u)]\n\n^(Beep boop I’m a bot)", "score": -4, "replies": [{"body": "Bad bot", "score": 2, "replies": []}]}]}]}, {"body": "I think Meta is megafucked.  This is way too big of a company to convert into a VR hardware gaming company.  Watching any recent John Carmack interview or his Oculus updates makes me squirm, he can barely keep it together without letting it slip that they are doomed.", "score": 0, "replies": [{"body": "Keep pushing this so I can buy more shares at a lower price lol", "score": 13, "replies": [{"body": "The meta oculus keynote speech 6 months ago?", "score": 0, "replies": []}]}, {"body": "I think you are mega dumb.", "score": 7, "replies": [{"body": "Mark Zuckerberg is dumb.  He renamed his company to Meta to capitalize on \"metaverse\" which is a generalized term.  It would be like if in 1998 had Microsoft renamed their company to \"Internet\".", "score": -2, "replies": [{"body": "Yea that totally proves Mark Zuckerberg is dumb. /s", "score": 10, "replies": [{"body": "why you don't believe the \"industry expert\" u/babbler-dabbler ?\n\nmetaverse is dumb, it just happened to be an area of interest for many big tech CEO not just in US, but China, Japan and Korea, but they are very likely making a big mistake.\n\nThere is no reason to believe those silly capital allocator over a Reddit internet expert.", "score": 0, "replies": [{"body": "FB $214\n\n!RemindMe 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2023-05-05 14:02:42 UTC**](http://www.wolframalpha.com/input/?i=2023-05-05%2014:02:42%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/uike8a/facebook_parent_meta_slows_hiring_in_costcutting/i7fdgjp/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fuike8a%2Ffacebook_parent_meta_slows_hiring_in_costcutting%2Fi7fdgjp%2F%5D%0A%0ARemindMe%21%202023-05-05%2014%3A02%3A42%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uike8a)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Facebook will be higher in one year but the metaverse play is not meant to create value within the year. If you listened to the earnings call it is meant to create value towards the end of the decade. Set your reminder for 10 years to see the outcome of Metaverse. All you new traders are funny. Time horizon so short you can't possibly consider doing something now to pay off many years later.", "score": 1, "replies": [{"body": "One year later, metaverse is dead and the stock is at $230.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "When are people going to finally realize that the \"metaverse\" thing is an *addition* to the company, and that the core business of Facebook,Instagram, and whatsapp have not been shut down", "score": 1, "replies": []}, {"body": "If you think the meta verse is so simple as to be linked to a VR hardware gaming company you are already behins", "score": 1, "replies": [{"body": "I think Zuckerberg read Snow Crash and Ready Player One and had grande visions of himself being James Halliday the ruler of the digital world.", "score": 1, "replies": []}]}, {"body": "Got a link for any of those interviews?", "score": 1, "replies": [{"body": "He was on Joe Rogan, and this keynote in particular convinced me Meta is dead meat.\n\nhttps://youtu.be/sXmY26pOE-Y", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Except FB sitting on a pure cash pile of $50B", "score": 2, "replies": [{"body": "What is their annual expense?", "score": 1, "replies": [{"body": "https://www.macrotrends.net/stocks/charts/FB/meta-platforms/financial-statements", "score": 1, "replies": []}]}]}]}, {"body": "Now I am happy that I failed my interview with Meta last year lol", "score": -6, "replies": [{"body": "You shouldn't be. They pay a metric ton and have insane employee benefits.", "score": 3, "replies": [{"body": "I have no possible doubts the salary at Fb but Fb is not the only tech company that pays a lot. I don't want to disclose where I work but the pay is also \"decent\". At least through my conversation during the interview, and my friend's experiences at Fb, I don't like the company.\n\nOn the business side, most employees and manger only care about short-term performance on metrics and don't care about the quality of the growth. For example, DAU is an important user, so they stress so much about it during the earnings call and interviews. The source of DAU growth can vary. If you have a successful marketplace or more groups where people discuss their hobbies, DAU will grow. On the other hand, you can keep feeding controversial/fake news to people's news feeds and push controversial comments to the top. People will want to argue with each other. In this case, DAU will also grow in short term. However, people may leave the platform, because the environment is so toxic. I am not saying this is true, but it's certainly something up for debate. At least, the company should be candid about what kind of growth they want. However, no one seems to care.  Nobody seems to care how about long-term plans. As long as xxx metrics grow within 6 months and I got my promotion, I don't care about anything else. An interesting thing is that in Fb's interview prep videos, they pretty much want you to start every answer with \"The mission at Fb is to connect people\" and zoom in, but in the actual answer, the big picture is simply irrelevant.\n\nOn the employee side, work-life balance can be horrible. To be fair, wlb is heavily team dependent and it's true in the industry. My friend is on the core ads team and she has no life. She works overtime every day and every weekend. Her team leader often chats with her at 11 pm. Everyone on her team still works at 11:00 pm. The part which puzzles me is that a lot of their works aren't necessary. They just want to do something to show the \"impact\" of their team. So they are literally creating works that don't exist and don't help the business. To me, their performance reviewing process is to blame, because it stresses so much, again, on impact. This is a good thing when Fb was in its infancy and growing fast. Naturally, there were a lot of meaningful projects to do and the impact-driven culture encourages people to move fast and work hard. However, now Fb is an established company, and there aren't as many new works as they used to be. So people have to find something to do FAST regardless of whether it helps the business or not. This also creates a weird situation. On one hand, the company is having a hiring freeze because the high-level management believes that there are too many employees. On the other hand, you have teams dying for people to join them to work on the projects they invented to show off their impact.\n\nThese are the reasons I don't like Fb as a company and I don't own its share. Sure, you can say I am sour on Fb, because I didn't pass the interview. However, I am rejected by companies more than I can remember and yet I am still a happy share holder of a lot of them.\n\nEdit:  Just want to add that the culture and the performance evaluation process at Fb make employees feel like people from different teams are competing with each other rather than collaborating. Someone may like it, but definitely not me.", "score": 1, "replies": []}]}]}]}
{"title": "Did you buy any holdings yesterday? If so - what?", "selftext": "Hello lads!\n\nI was sitting 70 % cash since November and just spent a a portion of that  (25-27.5%) to add some holdings (preferably cloud/soft on a discount, since they did not \\*crack\\* under pressure as much as someone would have anticipated (already discounted a bunch), and some even did not touch their March lows. Even though I still consider it overvalued, but it fits my narratives):S @ 29.75\n\nNET @ 81 (wanted 80 ideally, but high faith in the management team and it swings to 120 like wild, if it goes down - not panicking as I believe in the company)\n\nSNOW @ 167.5 (this is trading at insane sales, I know, but the fact that it still holds up that high tells you about the stickiness and quality of the product, also have some friends working there)\n\nU @ 64 (very surprised this went down this hard, but thankful for the discount)\n\nSOFI @ 6.5 (trigger initially was @ 6, but since 6.01 was the bottom, I missed out and bought higher)\n\nGOOGL @ 2300 (bought some days ago, a very difficult choice between this and AMZN @ 2400)\n\nStill not diving too deep, but opening positions with companies that I feel comfortable long-term growth-wise.\n\nHow about you?", "id": "uiprdg", "created_utc": 1651726607.0, "score": 19, "upvote_ratio": 0.75, "num_comments": 46, "comments": [{"body": "TSLA $893", "score": 6, "replies": []}, {"body": "BRK/B, TSM and MCO", "score": 3, "replies": []}, {"body": "AMD", "score": 11, "replies": []}, {"body": "AMD / U / VTI\n\nNot much cash left but I love these prices, hedged with puts so I'm not worried either way.", "score": 3, "replies": []}, {"body": "I’ll wait for SOFI to be closer to book value, GOOGL to be around $2,000 and NET to be closer to $60. SNOW @ $170 is still an insanely high overpay.", "score": 5, "replies": [{"body": "Book value is a fair play. Personally, if the stocks I picked will rally by 25-30 percent, I will highly consider exiting as it's a phenomenal profit and I do not like the current environment. If it is somewhat flat or negative - very fine with that as I love the companies.\n\nGOOGL at 2000 would be an absolute dream! Hope we can snatch them shares :)", "score": -3, "replies": []}, {"body": "What's book value? I was always confused by that. And enterprise value.\n\nHow do i find these values?", "score": -2, "replies": [{"body": "Book value: total assets when they were originally bought minus depreciation, amortization, etc. \n\nEnterprise value: total value of current assets plus liabilities\n\nEx: you bought land in 1980 for $50,000. It is now worth $650,000. Book value is $50,000 (assuming no depreciation). You take out a loan using land as collateral for $100,000. Enterprise value is $750,000 ($650k + $100k)", "score": 4, "replies": [{"body": "Nothing trades at book value unless the company has immense regulatory problems or is Chinese.", "score": -1, "replies": [{"body": "Citi group trades under book value.", "score": 3, "replies": []}]}, {"body": "How is this upvoted. That’s not the formula for enterprise value.\n\nEV = market cap + market value of debt - cash and cash equivalents\n\nAlso book value of a company is far more trivial to calculate than specific asset book value. You calc it by the balance sheet items of common equity - preferred.", "score": 1, "replies": []}]}]}]}, {"body": "Amazing DD!", "score": 3, "replies": []}, {"body": "I bought another share of SMH (I now have 4) right before the Fed meeting. I actually seem to have timed the bottom on this pretty well, cost basis 236, already up 4%. Wish I bought more AMD, I got in late and have aggressively averaged down from 150 to 123. Hoping we get another terrible red day, so I can buy in the 90s.\n\nI trimmed my INTC since it's in SMH and I think that stock is dead money for a few years.\n\nAnd as usual, kept adding to index funds (today was VTIAX since I knew it wouldn't go up as much as VTSAX).", "score": 1, "replies": [{"body": "Check out Invesco dbc etf. It's been going straight up since March 2020.\n\nAlso DVN VLO and ET are good energy plays.\n\nFidelity allows you to buy partial shares by the way.", "score": 1, "replies": [{"body": "I'm not sure buying the peak all time high VLO is a good idea. I just sold mine yesterday. It might go up some more though, but I'd bet that from this point OXY will do better. VLO just published their earnings which were fantastic and the stock went up 25%. VLO's target was $108 before earnings. OXY's targets from 65 to 85. Earnings are coming up in a week I think.", "score": 1, "replies": [{"body": "Thanks. I only put $500 in.", "score": 1, "replies": []}]}]}]}, {"body": "I got ETFs such as TQQQ, SOXL, QQQ, SMH, VGT, OIH, FCG, URA, MORT, XME, XLF and AMZA.\n\nI bought Friday close, Monday morning and Wednesday morning.\n\nWhy so many? It is the way I allocate, my style!\n\n[edit] Downvoting? If so, have further more downvote after seeing my YTD https://imgur.com/fjXN0Cu", "score": -2, "replies": [{"body": "Doesn't matter how many.", "score": 2, "replies": []}]}, {"body": "I bought 1 share of a stock that \"shall not be mentioned\", as it is something I am into.  A buddy from high school was asking me about his May 6th APPL call, and I told him to hold and see if we see a bounce over all ... and he sold for a decent loss when EOD he would have made a good profit.  \n\nI want to buy a bit more GOOG and AMZN so post split I can sell covered calls post split.\n\n\nI'm setting on 40K, and plan to pick up some split of tech and Div plays if there is another significant down trend.", "score": -5, "replies": []}, {"body": "Started a small Uber position, probably build it as we go on", "score": -5, "replies": [{"body": "What makes you confident in Uber? Did LYFT scare you off, if anything?", "score": 3, "replies": []}, {"body": "There’s nothing bullish about Uber’s future. Once driverless cars are driving people around that’s the nail in the coffin. Smart money sold out of Lyft/Uber after Lyft’s earnings.", "score": 3, "replies": [{"body": "Driverless cars? Lol a long way off!", "score": 3, "replies": [{"body": "Tesla FSD is coming like next year.", "score": -1, "replies": []}]}, {"body": ">Smart money\n\nStop", "score": 1, "replies": []}, {"body": "Agreeed. Robotaxis of the world will rekt Uber and Lyft", "score": 1, "replies": [{"body": "Why would it? Uber is going to have one of the largest fleet of robo taxis around", "score": 0, "replies": []}, {"body": "Why would it? Uber is going to have one of the largest fleet of robo taxis around", "score": 0, "replies": []}]}, {"body": "Do you actually see that happen on a large scale in our lifetime though?", "score": 1, "replies": []}]}]}, {"body": "VLO DVN ET", "score": 1, "replies": []}, {"body": "I received a lump this morning, which I put into SSO (2x daily S&P 500) just after market open.", "score": 1, "replies": []}, {"body": "WM", "score": 1, "replies": []}, {"body": "nope.. none of the stocks hit my buy limit.. maybe today..", "score": 1, "replies": []}, {"body": "Nope, but did take some nice profits in CC.", "score": 1, "replies": []}, {"body": "I sold off my BBY and put that money into LOW instead. I expect better dividends and better long-term stability from LOW. My friends said I should have put it into Home Depot instead, but I disagree with them.", "score": 1, "replies": []}, {"body": "RemindMe! 2 years", "score": 1, "replies": [{"body": "I will be messaging you in 2 years on [**2024-05-05 14:33:50 UTC**](http://www.wolframalpha.com/input/?i=2024-05-05%2014:33:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/uiprdg/did_you_buy_any_holdings_yesterday_if_so_what/i7fhxkn/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fuiprdg%2Fdid_you_buy_any_holdings_yesterday_if_so_what%2Fi7fhxkn%2F%5D%0A%0ARemindMe%21%202024-05-05%2014%3A33%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uiprdg)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Buying inverse volatilities.", "score": 1, "replies": []}, {"body": "$TOI.V, nasdaq etf, adbe\n\nThinking of initiating a position in $NOW and $MDB\n\nThinking of adding to Amzn, googl, and $SNOW", "score": 1, "replies": []}, {"body": "HYMCW yesterday mid day", "score": 1, "replies": []}, {"body": "I like NET but its very risky buying before ER. Bought CRM at 167.8 and FB at 179.7 several days ago. Looking at buying TEAM at $160s NET at 60s later.", "score": 1, "replies": []}]}
{"title": "Worker productivity in 1Q fell to its fastest pace in nearly 75 years.", "selftext": "https://www.cnbc.com/2022/05/05/labor-productivity-fell-7point5percent-in-the-first-quarter-the-fastest-rate-since-1947.html\n\nWorker productivity fell to start 2022 at its fastest pace in nearly 75 years while labor costs soared as the U.S. struggled with surging Covid cases, the Bureau of Labor Statistics reported Thursday.\n\nNonfarm productivity, a measure of output against hours worked, declined 7.5% from January through March, the biggest fall since the third quarter of 1947.\n\nAt the same time, unit labor costs soared 11.6%, bringing the increase over the past four quarters to 7.2%, the biggest gain since the third quarter of 1982. The metric calculates how much employers pay workers in salary and benefits per unit of output.\n\nWall Street already had been looking for a 5.2% drop in productivity and an increase of 10.5% in unit labor costs. On a four-quarter basis, productivity fell 0.6%, the biggest decline since the fourth quarter of 1993.\n\nTaken together, the numbers underline the inflation surge in the U.S., which has seen prices rise at the fastest level in more than 40 years. Federal Reserve officials on Wednesday announced they would be raising interest rates half a percentage point as part of an ongoing effort to control inflation.\n\nA separate Labor Department report Thursday showed that jobless claims increased to 200,000 for the week ended April 30, a 19,000 gain from the previous period and above the Dow Jones estimate for 182,000.\n\nContinuing claims, which run a week behind the headline number, fell 19,000 to 1.38 million, the lowest level since Jan. 17, 1970.\n\nThe productivity data reflect a quarter in which a variety of factors converged to cause a 1.4% decline in the rate of economic growth as measured by gross domestic product.\n\nRising Covid cases, runaway inflation and the Russian invasion of Ukraine dented activity, though most economists expect growth to resume later in the year. Fed Chairman Jerome Powell said at his post-meeting news conference Wednesday that he still sees the U.S. in a strong position though inflation must be tamed if the recovery is to remain strong.", "id": "uj1oxt", "created_utc": 1651769454.0, "score": 43, "upvote_ratio": 0.91, "num_comments": 37, "comments": [{"body": "Fell to it's fastest pace?", "score": 42, "replies": [{"body": "Very confusing. Lack of grammar skills abound at news outlets these days.", "score": 17, "replies": [{"body": "OP wrote the headline though lmao\n\nThe headline is different in the actual article", "score": 3, "replies": [{"body": "Guess you’re right. I still don’t like the first sentence of the article. It reads a bit clunky.", "score": 3, "replies": []}]}]}, {"body": "Should be at.", "score": 6, "replies": [{"body": "Roger that.", "score": 1, "replies": [{"body": "That that.", "score": 1, "replies": []}]}]}]}, {"body": "Not surprised.. have workers showing up and can't finish / ship a product due to component shortages.", "score": 20, "replies": []}, {"body": "Well they insisted on bringing everybody back to the office despite being warned that productivity would fall.", "score": 57, "replies": [{"body": "[deleted]", "score": -24, "replies": [{"body": "Where's your evidence that after two years productivity decreases?", "score": 20, "replies": [{"body": "These people will never have any idea of how much work I did not do at the office. It’s mostly work theatre sitting around waiting for some idiot to show up late to a meeting because their other pointless meeting ran late and they needed to eat because they hadn’t eaten all day", "score": 11, "replies": [{"body": "Lmao spot on, this was my experience in an office setting too. Usually the highest ranked individual of every meeting is super late and we all wait like idiots.", "score": 3, "replies": []}, {"body": "It's ridiculous. I don't work with a single person in my office yet I'm there on zoom calls with people in other regions and countries 3 days a week. 🤣", "score": 2, "replies": []}]}, {"body": "He has none. He's probably in leadership somewhere and is used to talking out of his ass.", "score": 3, "replies": []}]}, {"body": "Thats a scalding take.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Real wages are collapsing.  Inflation is poorly understood and most don't realize it fucks literally everyone.  People strangely believe it benefits stocks and actually it doesn't at all.\n\nAt first it leads to negative real returns.  For a while they pay taxes on ghost profits based on a prior capex cycle.  eventually when companies begin replenishing depleted physical capital, that's when they start to hit a wall and cashflow actually goes negative.  Some companies make money nominally *despite* inflation but those are rare.", "score": 3, "replies": [{"body": "It benefits companies with massive debt and good cash flow. They are able to pay the debt down, and the debt is actually worth less then that they \"bought it\" for. \n\n\nBut we all know companies now days are on a spending cycle and won't be paying down debt, but borrowing more.", "score": 2, "replies": [{"body": "> less then that\n\n*than\n\n *Learn the difference [here](https://www.merriam-webster.com/words-at-play/when-to-use-then-and-than#:~:text=Than%20is%20used%20in%20comparisons,the%20then%2Dgovernor%22).*\n*** \n ^(Greetings, I am a language corrector bot. To make me ignore further mistakes from you in the future, reply `!optout` to this comment.)", "score": 4, "replies": []}, {"body": "Initially yes.  Leverage naturally increases ROC.\n\nHowever, debt costs are going to rise with inflation as Fed hikes.  What happens when they need to replenish capital?  Debt costs are going to skyrocket.  Firms will either a) choose to accept higher costs or b) forced to deleverage.  a) the improvement of leverage on returns will disappear and b) again returns go down.\n\nOn top of this, new capital will rise with inflation.  Buffet talked about it here.  https://hollandadvisors.co.uk/wp-content/uploads/2021/03/how-inflation-swindles-the-equity-investor.pdf\n\nInflation is not good for anyone.  Not for the equity market, not for bonds, and definitely not for the vast majority of Americans.  It destroys real standard of living.", "score": 2, "replies": [{"body": "I agree overall but you can go with option b and it will help the company overall. Once inflation goes down they can leverage their assets again. No one really does this but it is the best option for long term inflation. Not trying to fight you, I agree with you but I don't think it's as absolute as you make it seem.", "score": 1, "replies": [{"body": "Yes but de-leveraging reduces returns.  It's one of the only ways to increase ROC \"for free\".  When you de-leverage and it comes time to replenish capital you have to reduce output.", "score": 1, "replies": []}]}]}, {"body": "Also helps anyone with a large mortgage", "score": 1, "replies": [{"body": "This is true but generally this is offset by the fact that real returns on real estate are not very high (as a primary residence).", "score": 0, "replies": []}]}]}]}]}, {"body": "And yet seemingly every business on the market seems to be having blowout quarters and unemployment is at 3.6. Something doesn’t add up here.", "score": 6, "replies": [{"body": "Just wait", "score": 2, "replies": []}]}, {"body": "Labor is highly undervalued and underpaid. Good productive labor is going to companies willing to pay a living wage with benefits everyone else will buckle under the pressure of poor out put", "score": 5, "replies": [{"body": "I mean that's fine and all but real wages are collapsing.  Inflation only fucks the average worker harder.", "score": 1, "replies": []}]}, {"body": "I expected this to happen honestly due to market conditions and easing of Covid restrictions", "score": 2, "replies": []}, {"body": "If only there was a company working on some kind of robot using AGI... Preferably one that's targeting a working prototype soon, maybe this year...?", "score": -2, "replies": [{"body": "It would be hilarious if Tesla did invent a better robot, but the first thing we teach it is how to go online and use Twitter.", "score": 2, "replies": []}]}, {"body": "We gotta work hard to suppress inflation and buy the dip, reach them ATH again", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not really given real wages are collapsing and PMI's plummeting across the globe, as well as GDP contracting in 1Q.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There's a huge difference in saying \"nominal wages went up\" vs. nominal wages up without the expected corresponding increase in output.\n\nThis among many other indicators typically signals recession soon after.\n\nJust like historically low unemployment levels signal recession.\n\nhttps://imgur.com/a/rgTDYf8", "score": 2, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "uj2p18", "created_utc": 1651772106.0, "score": 15, "upvote_ratio": 0.71, "num_comments": 46, "comments": [{"body": "I am generally patient with stupidity, but not with those who are proud of it . . .", "score": 29, "replies": [{"body": "Wouldn’t say proud. 🥲", "score": 4, "replies": []}]}, {"body": "sold your first put, and you didn't know earnings were tomorrow? but it had nice premium?...ohhh grasshopper....", "score": 22, "replies": [{"body": "Read first sentence.", "score": -15, "replies": [{"body": "grasshopper, I read your whole post....I have a feeling that one day you will be wondering why don't my impulses make money", "score": 6, "replies": []}]}]}, {"body": "Well that particular option is up 1400% today, so yeah, as long as the stock stays above $11.50 today and tomorrow, you just made an easy $15. If the stock plummets and you get assigned, and you have to spend $1150 on 100 shares, at least you can start selling covered calls. Welcome to the wheel.", "score": 9, "replies": [{"body": "What if it drop by 10%? No wheel will save you then", "score": 4, "replies": [{"body": "I have a 14% cushion so I shouldn’t be assigned.", "score": 2, "replies": [{"body": "Ok, just don’t panic and close if it goes down by 14% it’s just paper losses. Anyways good luck.", "score": 2, "replies": [{"body": "Yup. I’d much rather getting my collateral back but worse case, I own it at a good price. Some people are acting like I’m donating $1000 to Wall Street. Thank you.", "score": 1, "replies": []}]}]}]}, {"body": "This was the whole idea, yep. Thanks!", "score": 2, "replies": []}]}, {"body": "I usually wait till close to EOD if it has earnings. People will FOMO and cause more iv spikes can get higher priced premium fills. Good-luck nevertheless 👍", "score": 5, "replies": [{"body": "Oh okay I didn’t look at this perspective. I’ll see how this trade plays out and if I’m not stuck bag-holding, I’ll consider it next time. Thank you!", "score": 2, "replies": []}]}, {"body": "Oof", "score": 3, "replies": []}, {"body": "Yikes, total yikes.", "score": 3, "replies": []}, {"body": "Sorry bud, UA -12% pre market I hope you can wheel it don't panic sell", "score": 3, "replies": [{"body": "Thanks! I am currently below my break even pre-market but I’m still keeping an eye out. I think I’ll just let it ride to close. \n\nI’ll update the thread if anyone cares.", "score": 2, "replies": [{"body": "Oh so you are riding to expiry? All right just make sure you can stomach it dropping some more, also consider doing the wheel if it goes deep itm, good luck!", "score": 3, "replies": []}]}]}, {"body": "Bad news", "score": 3, "replies": [{"body": "Staying in!", "score": 0, "replies": [{"body": "2 years late to think that way!", "score": 1, "replies": []}]}]}, {"body": "Rode it out to expiry! Monday I should have 100 shares to sell some calls against.", "score": 3, "replies": []}, {"body": "The chart does show some earnings moves, but the MM expected move is still above 11.50.  The mid-price of the 5/6 11.50 put is 15 cents.  What did you sell it for?", "score": 2, "replies": [{"body": "It was $15 worth of premium.", "score": 1, "replies": [{"body": "... So you could get out without being hurt too much if you close now ...\n\n... Or you could buy the 5/13 11.50 put and leg into a time spread with less risk ...", "score": 0, "replies": []}]}]}, {"body": "Have fun, I think you’ll make some money", "score": 0, "replies": []}, {"body": "I think ur good. 52low was like 12 bucks", "score": 0, "replies": [{"body": "RIP", "score": 2, "replies": [{"body": "Guess first ones free didn't apply for him", "score": 2, "replies": []}]}]}, {"body": "There is a reason why premiums are high. It’s cause the risk is high. Theta gang needs to stop telling everyone they will get rich selling options. You get rich buying options.", "score": -3, "replies": [{"body": "Do both actually", "score": 3, "replies": []}, {"body": "You can make a consistent and predictable income selling options.", "score": 2, "replies": [{"body": "I agree. But people here are playing it like you can get rich by selling “juicy” premiums", "score": 0, "replies": [{"body": "True dat. Chasing fat premiums will burn you in the end.", "score": 3, "replies": []}]}]}]}, {"body": "Hahah i know someone who sold 88 strike AMD puts for 2.9 yesterday. Probably free money now", "score": 1, "replies": []}, {"body": "I wake up at 9:45 this morning and won’t make any trades now until after 11. I used to spot “opportunities” on my morning check until I realized I was getting burned on all of them. In short, I’ve been there too!", "score": 1, "replies": []}, {"body": "Guess you are getting assigned?  Currently $10.07.  -24%.\n\nSitting in lecture.  Fuck it.  Hah!  I remember the good old days when I was stupid and traded without regard to risk assumed.\n\nOne day you may look back and go damn, that was dumb.  I have done that a lot.  You get older hopefully you get wiser.\n\n**No disrespect**, I think most people have to go through this at least once or twice or more to get it drilled in.\n\nSave this picture:  https://i.imgur.com/RVdszPd.jpeg", "score": 1, "replies": [{"body": "That is correct Carol. If it closes below my strike, I will be assigned unless I close the trade.", "score": 1, "replies": []}]}, {"body": "Hey u/squiggly_poop, how do you feel today? You mentioned you were hoping the price didn't take.. but it did.\n\nOr you okay accepting shares for 11.50? I see you can roll out a month to $11 for a credit...\n\nedit: I see you're going to sit on your hands today but what's your play on Monday when you have the shares?", "score": 1, "replies": [{"body": "I never looked into this. This is a decent reposition, hmm. I’ll look into it. \n\nThanks for looking out!", "score": 1, "replies": []}]}, {"body": "I am sorry this market right now is a fickle mistress but I hope you are happy with owning under armor here.  It will get more painful next week but we might get a dead cat bounce from overall market soon", "score": 1, "replies": [{"body": "Aye thanks, let’s see. Let’s get the wheel rolling eh?", "score": 2, "replies": [{"body": "Well good luck you stumbled into the downside of wheel and same boat as the riot I just picked up that the price went way below your strike so those ccs will be worth nothing unfortunately so now you are now more of a long term investor on this.\n\nWhat do you think it’s long term value based on eps and growth is?", "score": 1, "replies": [{"body": "Yeah that’s true, I might have to go a bit below my purchase price. I am looking for a bounce sometime soon and I’ll go from there. In general, I am expecting to see it bounce back eventually in the next coming months at least, seeing as it was beat up pretty bad by Covid, and where the ATH is. \n\nRIOT? Might sell a put against that beast next.", "score": 2, "replies": []}]}]}]}, {"body": "You have my sympathies in these trying times  💐", "score": 1, "replies": []}, {"body": "How is that out going? Saw UA price at end of day and thought of you. This is what I find dangerous about theta gang. People new to selling options think it’s free money and the wheel will save them. I’m sorry this happened to you on your first one.", "score": 1, "replies": []}]}
{"title": "Life In 2029. Rates at 3.5%, Inflation at 69%", "selftext": "It was May 4th, 2022. You remember it so well. JPow had his little meeting where he whisperes some words like \"Economy is strong, we need to raise rates though. I understand the average economic person is being fucked in the ass every night by spending half their income on rent with the rest going to an $11 jar of tomato sauce. Actually I have no fucking clue cause I'm rich AF but for these meetings I have to pretend like I know so that the SPY can go uppy.\"\n\nYou thought that if you cannot even afford to drive to work then the economy is headed for recession. You spent $150 on puts that FOMC day only to have them expire worthless. Damn that was two days worth of gas money. \n\nFast forward to 2029. The SPY has increased to 5 million pesos. Every FOMC meeting JPow says \"It's important we start QT, but I don't think it is the right time. We'll start QT June 1st.\" Every year JPow has said he will QT June 1st but he never does. \n\nYou get out of bed, sorry I mean you get up underneath the park bench and head to work. You made it to Director of Trading at Goldman Sachs. You make a good salary. Making 1,000 Wendy's burgers a year is pretty good in comparison to the general population. The only thing is that a house costs 2 million Wendy's burgers. The other thing is that BlackRock owns every house in America and they use those houses to store their pesos and burgers. An average economic human is not worthy of living in a house, so they keep them empty. It's too much of a hassle to have a lowlife occupy the house. Better to have the inflation appreciate the asset, as well as monetary storage. \n\nIt all sounds bad, but hey it could be worse. You think at least the Fed did a great job at not letting things get out of control. You think damn, I cannot imagine what would happen if they tipped the economy into recession in 2022. Thank god for this soft landing.", "id": "uimh8z", "created_utc": 1651715707.0, "score": 280, "upvote_ratio": 0.94, "num_comments": 50, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|3 years ago\n**Total Comments**|51|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=uimh8z)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=uimh8z)", "score": 1, "replies": []}, {"body": "Jim, are you really sober though?", "score": 54, "replies": []}, {"body": "Buttblasted bears make the best content. It's true. They give it time and thought, you can almost taste the salt behind this one.", "score": 19, "replies": [{"body": "Don't mention \"butt blast\". There is this meme on here... Brings new meaning to the phrases; crotch rocket and rocket to the moon.", "score": 3, "replies": []}]}, {"body": "You can’t have a hard landing if you never land", "score": 16, "replies": []}, {"body": "Don't worry.  Elon's got your back with his 15k tiny house.  Food stamps will cover your grocery bill. And you can park you tiny house in your employer's parking lot, so no gas or transportation costs to get to work.  See, they are working to prepare you a life. Since your real life will suck, you will spend your free time in the metaverse, living the fake life you wanted to live in reality.", "score": 15, "replies": [{"body": "Damn this true", "score": 3, "replies": []}, {"body": ">\tFood stamps will cover your grocery bill.\n\nAs someone feeding a family of four this is easily the least believable thing in the list.", "score": 2, "replies": []}]}, {"body": "Amazing writing skills ..\"It was May 4th, 2022\" and I was glued to what happens next.", "score": 16, "replies": [{"body": "\"You remember it well...\"\n\nYou mean TODAY?! I member..", "score": 12, "replies": []}]}, {"body": "my granddad once told me that the government has always wanted us to be in a high inflation environment.  they want all of us wage earner in check.  billionaires can only get richer.", "score": 18, "replies": [{"body": "He wasn't wrong.", "score": 10, "replies": []}, {"body": "You and your grandad are idiots.", "score": -7, "replies": []}]}, {"body": "Is this really Michael Lewis and his alt account penning this beautiful haiku ?", "score": 9, "replies": [{"body": "Where is Will Smith (to b!tch slap this OP) when you need him???", "score": 1, "replies": []}]}, {"body": "The Zimbabweans are laughing at us.", "score": 3, "replies": []}, {"body": "dont worry eventually you will get a recession", "score": 4, "replies": [{"body": "Look around you, we are in recession!", "score": 9, "replies": [{"body": "no people are still working, sure there is rapid inflation and stocks have fallen, but economy is strong, this \"recession\" we are in will be over soon, inflation will fall, stocks will rally...hopefully", "score": -7, "replies": [{"body": "Is that u JPoW?", "score": 22, "replies": []}, {"body": "> no people are still working.\n\nExactly what jp said : that's the problem, too much demand on the job market.", "score": 4, "replies": []}, {"body": "A GDP declines of 1.5% from last year is strong? A trade deficit of over 108B, an all time record, is strong? A private payroll increase that missed the mark for April by 150,000 is strong?", "score": 4, "replies": []}]}]}, {"body": "The yield inverted and we already had our first quarter of shrinking gdp. You can bet that wecalready are in a recession but it wont be a bad one because jp will kick the can down the road.", "score": 3, "replies": [{"body": "JPow is gonna bend it like Beckham to the point where we reach a fucking recession that wraps around the event horizon of Gargantua.", "score": 2, "replies": []}]}, {"body": "well... only took 1 day...", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Jim you quiefing genius!!", "score": 2, "replies": []}, {"body": "I am a bot. This Meme does not look like it has generated enough approval to stay on /r/wallstreetbets.                                            We algorithmically cull certain submission flairs whose response is not above a certain threshold to try and keep the page clean.", "score": 2, "replies": []}, {"body": "The bear blues 😂 cry me a river", "score": 1, "replies": []}, {"body": "You know you can build a new home not owned by black rock", "score": 1, "replies": [{"body": "Too much work, better pay 750k for a shit hole where wind blows with everything close.", "score": 2, "replies": []}]}, {"body": "You forgot the part about warlords and a murder rate higher than Musk at a Joke Rogan podcast..", "score": 1, "replies": []}, {"body": "Well written! I crave a Wendy's burger now.", "score": 1, "replies": []}, {"body": "Amazing how many put folks are coming out.ve ready to be burned!", "score": 1, "replies": []}, {"body": "This is the DD I come here for", "score": 1, "replies": []}, {"body": "God bless the economy, for she is stronk", "score": 1, "replies": []}, {"body": "🤡", "score": 1, "replies": []}, {"body": "Soft landing because of JPOW's tools. AKA green dildos.", "score": 1, "replies": []}, {"body": "Rate should be 4.20% good sir.", "score": 1, "replies": []}, {"body": "Well said.", "score": 1, "replies": []}, {"body": "People are scraping metals from junk eletronics all over the entire planet and people collecting plastic bottles from pacific ocean, to sell and recycle plastic again", "score": 1, "replies": []}, {"body": "This is nuts, we all know BLK will be bankrupt by year end...", "score": 1, "replies": []}, {"body": "You had the chance to 4.20 69 and didn’t. I’m gonna need you to turn in your smooth brain ape card immediately.", "score": 1, "replies": [{"body": "Fair, agreed.", "score": 1, "replies": []}]}, {"body": "And J Pow speaking from grave - \"Inflation was permanent\"", "score": 1, "replies": []}, {"body": "And J Pow speaking from grave - \"Inflation was permanent\"", "score": 1, "replies": []}, {"body": "And J Pow speaking his last 3 worfs- \"Inflation was permanent\"", "score": 1, "replies": []}]}
{"title": "What will the U.S. annual inflation (CPI) be for April 2022?", "selftext": "Resolution Source: [https://www.bls.gov/bls/news-release/cpi.htm](https://www.bls.gov/bls/news-release/cpi.htm)\n\nAnswer will resolve to total CPI, NOT core-CPI.\n\n[View Poll](https://www.reddit.com/poll/uj0br3)", "id": "uj0br3", "created_utc": 1651765479.0, "score": 21191, "upvote_ratio": 1.0, "num_comments": 40, "comments": [{"body": "Inflation has peaked narrative really starts tomorrow", "score": 27, "replies": []}, {"body": "It’s higher than 9.2", "score": 16, "replies": [{"body": "Do you want to bet $300? My bet is that it is going to be 8.9% or lower.", "score": 14, "replies": [{"body": "I’ll bet you my entire Kia Sportage .", "score": 9, "replies": [{"body": "Looks like you owe someone a Kia Sportage 😂", "score": 7, "replies": [{"body": "Mods, ban or Kia plz", "score": 4, "replies": [{"body": "Well I don't think I'll get my Kia", "score": 1, "replies": []}]}]}, {"body": "The problem with that is I do not live in the US so it would be hard to ship and with a price this large I doubt you are really going to pay me.", "score": 6, "replies": [{"body": "Use Kia will sell for 1000$ :P\n\nIt ain’t that much", "score": 2, "replies": []}]}, {"body": "I wrote you a DM", "score": 7, "replies": []}]}]}, {"body": "There’s a 99% chance it’ll be below 8.7% lol", "score": 9, "replies": [{"body": "Let me guess, you also think J6 was a “peaceful protest”.", "score": 0, "replies": [{"body": "I’ll bet you $10k that it’s under 8.7%", "score": 7, "replies": [{"body": "This aged well. What made you so confident that inflation would be below 8.7?", "score": 2, "replies": [{"body": "Energy was down in April, for inflation to be above 8.7%, core inflation would’ve had to be some insane 1.5% month over month print. The highest it’s been in the last 12 months was 0.6%, so it was a near certainty. I thought it would be lower too tbh. My guess was 8.1-8.2%.", "score": 4, "replies": []}]}]}, {"body": "\"Mostly Peaceful\" in the parlance of our times.", "score": 1, "replies": []}]}]}, {"body": "You are forgetting about the base effect.", "score": 1, "replies": []}, {"body": "LMAOOOOOOOOO you’re bad at predicting", "score": 1, "replies": [{"body": "You laughed your ass off.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Transparent, open source calculations and data sources (bls.gov) computed by the highest economists in the world for the largest financial global market on which the entire global economy rests upon\n\nVs\n\n\"I know because my grocery bill is more\"\n\n🗿", "score": 9, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "It's the federal reserve of the United States. They control the USD which is the global reserve currency. They have significant power over not only the largest economy in the world (US) but by extension every nation that uses the dollar. Trillions of dollars rests upon their judgement. This is arguably the most important work in the world. You don't get in that position unless you're an incredibly esteemed economist. To think they're all idiots is absurd. Yes they still get things wrong because the future is unpredictable. I will trust them over some random WSB user.\n\nNot the \"they changed the calculations\" argument again. No they did not change it to lower inflation numbers. They changed it to better reflect *consumption* because that's what the *consumer* price index is measuring. They changed housing cost from the price of a home to the price of a mortgage payment or equivalent rent. Because real estate is not something that's consumed, it's an asset. You're not buying a house every month, you're paying a mortgage or rent.\n\nYes, everyday items, that's what CPI and PCE measure. Price changes are not uniform over all items. That's why your groceries can go up 20% but if something else went up less or went down then CPI is lower than 20%. CPI is explicitly created to track the average price change of a basket of everyday consumer goods and services.\n\nI don't mean to post a wall of text but unfortunately things are much more complex than WSB makes it out to be. It's a lot easier to say \"CPI is fake because groceries.. they changed the calculations\" than it is to go to the BLS website and see for yourself exactly how everything is calculated, what goods and services are measured, how each has changed in price, how the data is sourced, etc. Every bank in the world depends on this data, and many third party measures exist to verify that the data is correct. It's just absurd to believe against all evidence that it's faked. Literally the world would not function if it was.", "score": 4, "replies": []}]}, {"body": "Tell me you're a bull without telling me you're a bull", "score": 2, "replies": [{"body": "Hard to see the steers without the horns", "score": 1, "replies": []}]}]}]}, {"body": "resolve|15659796", "score": 4, "replies": []}, {"body": "I’ve seen it, it’s below 8.7% 🤫", "score": 3, "replies": []}, {"body": "What will they \"tell\" us it is.....not what it actually is....", "score": 7, "replies": []}, {"body": "Well of course 8.7% or below because 6.9%.", "score": 2, "replies": []}, {"body": "Congress gave a 21%-22% raise in March. 20% is closer to the actual inflation number change my mind. \n\nSummary: I’m...look a banana..retard but inflation big number", "score": 2, "replies": []}, {"body": "So obvious LUL.  \nCPI is ALWAYS underreported", "score": 2, "replies": []}, {"body": "I’d bet $10,000 on under 8.7% if anyone is interested. DM me.", "score": 4, "replies": [{"body": "that 10,000 should go into calls tuesday eod. don’t bet against us, bet against a theta gang member", "score": 6, "replies": [{"body": "There is a 90% chance that it under 8.3% lol, 99% chance it’s under 8.7%. It’s a total certainty and priced in.", "score": 5, "replies": [{"body": "we’re not at 430 yet. 25% iv for 5/16 calls ain’t too bad", "score": 1, "replies": [{"body": "The real over under was 8.2%, yet somehow only 22% of morons here picked under 8.7% LMAOOOO", "score": 1, "replies": []}]}]}]}]}, {"body": "We printed so much money that the money we spent on paper materials cost alone could buyout Musk and all his companies", "score": 4, "replies": []}, {"body": "https://www.reddit.com/r/CoinParliament/comments/ujfvcz/vote_of_the_day_who_will_prevail_shiba_vs_doge/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": -2, "replies": []}, {"body": "It’s on like Donkey Kong!", "score": 1, "replies": []}, {"body": "Nailed it", "score": 1, "replies": []}]}
{"title": "Apple puts morons", "selftext": "", "id": "uj63ek", "created_utc": 1651781455.0, "score": 42, "upvote_ratio": 0.79, "num_comments": 43, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=uj63ek)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=uj63ek)", "score": 1, "replies": []}, {"body": "Show us your all time, morons", "score": 18, "replies": [{"body": "1 week is my all time", "score": -19, "replies": [{"body": "Based af", "score": 2, "replies": []}]}]}, {"body": "Position or ban ! 😏", "score": 5, "replies": [{"body": "I’m down how do I do this!", "score": -8, "replies": [{"body": "Show your order history of the apple trade, what, how much and when 😆", "score": 1, "replies": [{"body": "Until I find out \n\n159 contracts of Apple 157.5 puts @ 1.10 \n \nSold 150 @2.13 \n\nLfg!", "score": 3, "replies": []}, {"body": "I know that. How to I add attachment to comment section boi!", "score": 1, "replies": []}]}]}, {"body": "p_viljaka has challenged someone to post their positions! \n\np_viljaka, if someone has made a claim that they bought / sold something and fail to prove it within 24 hours, message the mods to have them banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Teach me how and I will!", "score": -6, "replies": []}]}]}, {"body": "Nice....just don't lose it on gme.", "score": -1, "replies": [{"body": "If he buys shares it’s not a loss", "score": 1, "replies": []}, {"body": "Short gme too lol!", "score": -2, "replies": []}]}, {"body": "159 contracts of Apple 157.5 puts @ 1.10 \n \nSold 150 @2.13 \n\nLfg!", "score": 0, "replies": []}, {"body": "What is a put?", "score": 0, "replies": [{"body": "Forbidden fruit", "score": 1, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Buy apple calls", "score": 1, "replies": [{"body": "To be honest we might get a rebound but with the way selling pressure was today that’s a risk![img](emote|t5_2th52|4640)", "score": 0, "replies": [{"body": "Tmrw the markets going to rally cuz everything is cheap", "score": 2, "replies": []}]}]}, {"body": "June 6 bro wait on it", "score": 1, "replies": [{"body": "Calls week before or buy them now as they are shit.", "score": 1, "replies": [{"body": "Buy options call now well there cheap hold till a week after June 6", "score": 2, "replies": []}]}, {"body": "why june 6", "score": 1, "replies": [{"body": "Hosting a huge event to talk about the future of apple among other things", "score": 1, "replies": []}]}]}, {"body": "Positions or Ban\nMODS!", "score": 1, "replies": [{"body": "159 contracts of Apple 157.5 puts @ 1.10 \n \nSold 150 @2.13 \n\n1dte \n\nAssuming you bought calls?", "score": 1, "replies": []}, {"body": "chuy2256 has challenged someone to post their positions! \n\nchuy2256, if someone has made a claim that they bought / sold something and fail to prove it within 24 hours, message the mods to have them banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Spy calls?", "score": 1, "replies": [{"body": "Actually yes probably", "score": 1, "replies": []}, {"body": "Yes![img](emote|t5_2th52|4263)", "score": 1, "replies": []}]}, {"body": "Am I a moron tho?", "score": 1, "replies": [{"body": "No you BB", "score": 1, "replies": [{"body": "\\^\\_\\_\\_\\^", "score": 1, "replies": []}]}]}, {"body": "You call people moron and yet you still use RobinHood.", "score": 1, "replies": [{"body": "You lost money in the market.", "score": 0, "replies": [{"body": "No you are an idiot for still using RH.", "score": 1, "replies": [{"body": "Sounds like you lost money in the market ![img](emote|t5_2th52|4271)", "score": 0, "replies": [{"body": "How am I losing money, been playing UVXY..... on Fidelity.   You are a tard, and a special one. Rarely do you bump into something that has overall negative karma on their account.", "score": 1, "replies": [{"body": "Still sounds like you lost money ![img](emote|t5_2th52|4267)", "score": -1, "replies": [{"body": "You sound like a cuck", "score": 1, "replies": [{"body": "🤌🏻", "score": -1, "replies": []}]}]}]}]}]}]}]}]}
