{"title": "I was on the hook for a couple mil in a box spread one time", "selftext": "https://www.reddit.com/r/options/comments/877qhi/a_viable_options_strategy/?st=JR1R28UQ&sh=6d6f663a\n\nA while ago I was messing around with option strategies and I came across what I honestly thought was arbitrage. I never found a name for the strategy exactly but it’s very much like a box spread just with a broken top or bottom. As you can see I was able to execute huge ranges on AMZN for next to no collateral. I thought it was free money so I went balls to the wall that day. I had about 10-15 of these on AMZN and 92 on SPY. Keep in mind 92x100=9200 shares of spy. \n\nObviously I think I had a nice 10 bagger that day no prob, assignment won’t happen and if it does , I’m covered. Go to sleep, wake up the next morning to Tastyworks risk management calling me. Fuck. So I answer , open my laptop. Turned out I got assigned all 92 short puts of SPY and maybe 5 AMZN. It was close to $2.5 mil passed my allotted margin. Needless to say they weren’t cool with me in the position. \n\nSo I’m on the phone, markets about to open in ten minutes , I’m freaking out thinking I’m u/1ronyman .  Luckily for me, market opens much higher that day. *But* you can only imagine how hard it is to close a trade like that. The dude from TW is just pseudo using my account as I watch him try to close this trade hoping market doesn’t reverse early morning. I was watching my account fluctuate by thousands how it normally does dollars. I was fortunate enough to have been exited out of that position at a profit of about a thousand or so, I never really calculated everything. Then also I paid $400 for the day of $2,500,000 margin lmao. I figured out this trade is only arbitrage if you have that $2.5 or so to take assignments with and hold stock till the other options expire for profit. & also at that point the return isn’t worth the investment. \n\nTL;DR, Box spreads are fucking stupid. Use a broker that will assist you in exiting a trade to everyone’s best financial interests. ", "id": "ah8e3l", "created_utc": 1547799663.0, "score": 351, "upvote_ratio": 0.98, "num_comments": 73, "comments": [{"body": "Tastyworks staff is the fucking tits. They treat every single account like it belongs to their own children.", "score": 227, "replies": [{"body": "Every experience I've had with them has been positive. Plus, they're not located in Florida.", "score": 68, "replies": [{"body": "I've seen a few references about Florida. What does being located in Florida imply? They have some particularly lax regulations compared to most other states?", "score": 2, "replies": [{"body": "I would like to inquire about FL's risk free money policy please...  Sure I'll hold.", "score": 2, "replies": []}]}]}, {"body": "Meanwhile Robinhood accounts are actually used by children.", "score": 48, "replies": [{"body": "I wish Robinhood would add a Fortnight skin to its app", "score": 18, "replies": [{"body": "Lootboxes with FDs coming right up", "score": 7, "replies": []}]}, {"body": "Ages 4+!", "score": 12, "replies": []}]}]}, {"body": "is this sub for real about to become a box spreaders anonymous? \n  \n because i want that", "score": 135, "replies": [{"body": "The new $90 MU call...we have entered a new era.", "score": 28, "replies": [{"body": "We should host a WSB “who can profit the most off box spreads” contest ", "score": 16, "replies": []}]}]}, {"body": "Imagine if your brokerage literally had no phone number they dumped those legs indiscriminately...... Muh free commissions though", "score": 181, "replies": [{"body": "Seriously... I have a dedicated staff who has been at E*TRADE for 21 years. That dude isn’t going anywhere on me if I screw something up. ", "score": 49, "replies": []}]}, {"body": "If there was a Hall of Fame for subreddits, WSB would be a first ballot candidate ", "score": 52, "replies": []}, {"body": "https://imgur.com/a/stRySke\n\nEmails that morning ", "score": 98, "replies": [{"body": "I felt like throwing up just reading that.  Good for you making it out alive", "score": 15, "replies": []}, {"body": "I would say u deserve to be mod but u made money so that’s a no go", "score": 5, "replies": [{"body": "Admin it is?", "score": 3, "replies": []}]}, {"body": "Holy shit I just spit my coffee all over my phone reading this fuck", "score": 3, "replies": []}]}, {"body": "Tastyworks is the best, I've had a backup account with them for a bit. Looks like it's going to be my main account for a while. Also have a Roth IRA with them, they let you sell spreads in an IRA!", "score": 91, "replies": [{"body": "[deleted]", "score": 70, "replies": [{"body": "Dont fucking autist shame him you autist ", "score": 22, "replies": []}]}, {"body": "Be sure to let the risk department of your newfound fame here. I'm sure they'd love to hear about it.", "score": 24, "replies": []}, {"body": "> Also have a Roth IRA with them, they let you sell spreads in an IRA!\n\nComing soon to /r/wsb near you....", "score": 3, "replies": []}, {"body": "I thought you were dead.", "score": 1, "replies": []}]}, {"body": "I really like the TD trade desk guys. They've been nice to me through the dark days. But I always thought they sounded a bit hasty and impolite around market open. Now I know why. Thank you!\n\n&#x200B;", "score": 36, "replies": []}, {"body": "https://www.cmegroup.com/trading/equity-index/files/option-box-spreads-as-a-financing-tool.pdf\n\nBoxes ain’t no arbitrage my dudes...\n\nGood for y’a that TW wasn’t retarded about it", "score": 25, "replies": [{"body": "Yeah no I figured that out, trust me lol.\n\nAnd yeah for sure they were very helpful. I would’ve been livid if they handled it in the manner that RH did with our brudder ", "score": 24, "replies": [{"body": "I'm coming in from another sub, can you ELI5 me what is going on?", "score": 1, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "No, sorry.\n\nBut I know what a margin is. I don't understand exactly what it is that he did. Did he essentially margin himself to -60k? Or is there a fundamental difference between margin and box spreads?", "score": 2, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "> Because of time value it is more profitable to sell your options than exercising them\n\nHow so? Doesn't the time value represent the likelihood the option will enter in the money (ITM)? Why would an ITM option keep its time value?\n\nI don't see how the options contracts bought had more value than their intrinsic value. I guess it's related to volatility. ", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Thank you again for your time, it's much appreciated!", "score": 1, "replies": []}]}]}]}, {"body": "He got early assigned on a leg and then rh realized that their margin buying calculation has problems with deep itm options so they let him open a 3mm position for 5k cash and they let him withdraw 10k cash even tho the position went negative 57k because one leg was uncovered due to assignment.", "score": 6, "replies": []}]}]}]}]}, {"body": "\"To the extent that this structure is booked with the\nCME Group Clearing House (CH), the buyer (or\neffective lender) and seller (or effective borrower) of\nthe box are not exposed to the credit risk of the\ncounterparty. Rather, they are protected by the\nfinancial safeguards offered through a centralized\ncounterparty (CCP) clearing mechanism. \"", "score": 2, "replies": [{"body": "It’s a guaranteed loan through the options clearing house, the box is a play on rho, it’s like owning t-bill but more flexible, assuming you use European style options, if you use US style the buyer should absolutely execute immediately and get his money 😂 ", "score": 6, "replies": [{"body": "And the fact 1r0nyman was doing this on deep itm options makes it hilarious", "score": 8, "replies": []}, {"body": "why not use the euro style then.", "score": 5, "replies": [{"body": "Because our l0rd and savior's name is u/1r0nyman", "score": 8, "replies": []}]}]}]}]}, {"body": "Damn, you could be the WSB hero and now no one knows your name.", "score": 9, "replies": []}, {"body": "Robinhood execs are stupid you mean.", "score": 9, "replies": []}, {"body": "It blows my mind how many traders exercise early", "score": 4, "replies": [{"body": "For deep itm options it's often cheaper to exercise than pay bid ask on the option", "score": 8, "replies": [{"body": "Wow i m ashamed i never realized that lol", "score": 2, "replies": []}]}]}, {"body": "TW is great. Sometimes I get automated emails from them like \"your spreads are at risk of assignment\", and I just reply like yeah that's the point. It always surprises me when a real person replies back saying they're just checking.", "score": 5, "replies": []}, {"body": "But how much profit did you make", "score": 6, "replies": [{"body": "$1000 give or take then minus $400 daily interest for the margin. Too much going on to account for though idk exactly. ", "score": 18, "replies": [{"body": "the less you know the more you make", "score": 38, "replies": []}, {"body": "So if I actually have $2.5m, I can make free $1000 a day, got it!", "score": 23, "replies": [{"body": "Sprinkle in a mild heart attack and a forced sell off position and you're gold!", "score": 23, "replies": [{"body": "The 14.6% totally risk-free annual return is worth it", "score": 3, "replies": []}]}]}, {"body": "That’s pretty good if you ignore the fact you had 2.5m exposed. Congrats ", "score": 4, "replies": []}]}]}, {"body": "Damn, this could have been much worse and you could have ended being on the news, [1ronyman](https://www.reddit.com/u/1ronyman) is only famous on WSB but not on the news yet.", "score": 5, "replies": [{"body": "Actually... [https://www.reddit.com/r/wallstreetbets/comments/ah51pi/marketwatch\\_wants\\_in/](https://www.reddit.com/r/wallstreetbets/comments/ah51pi/marketwatch_wants_in/)", "score": 5, "replies": [{"body": "I know dude, just read it. LMAO. This man will be a national treasure soon.", "score": 2, "replies": []}]}]}, {"body": "I wanna give you an award but i’m a cheapster. So here’s a 🍺. I’m wondering how much RH would’ve fucked this up if they had you as a customer ", "score": 4, "replies": []}, {"body": "You can do box spreads on SPX options", "score": 2, "replies": [{"body": "No you can’t, because the put call price spread for American style options weigh in risk factors such as early assignment to calculate a market price. This gives these options a price skew that allows us to set up what on the surface looks like an arbitrage trade, profiting from the skew in credit from short legs. \n\nEuropean style options such as SPX do not have such price skew, because there’s no added assignment risk variable. trying to set up a box spread should profit $0.", "score": 14, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "That s one messy way of replicating zero coupon bond", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "As retailer fees +shit spreads + inability to manage option legs freely make it impossible to get that risk free or any size of it no matter what. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "But that defeats the purpose of it being supposed simple arbitrage. It’s not guaranteed the market moves in a fashion that allows you leg in with ease ", "score": 12, "replies": [{"body": "The purpose isn’t simple arbitrage, these are rare to find. The purpose is supposed to be no risk.", "score": -9, "replies": [{"body": "Arbitrage = no risk trade. \n\nThe risk is the underlying doesn’t move how you expect or need & then you’re stuck in a position or two you had no intention of being in that probably isn’t going your way. I’m not saying it cannot be done , but it’s not risk free by any means. ", "score": 11, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I mean yeah but you’re only reiterating a point I already made that the idea is to profit off initial skew in credit/debit. If you leg in, you’re expecting profit off change in market conditions amongst other variables. \n\nYou’re also not wrong that you *could* leg into this strategy. It would only be worth it in the event you have one winning spread already in place and conditions present themselves to leg into the other side. I would never open up a spread expecting to complete this strategy by legging in over time. ", "score": 2, "replies": []}, {"body": "I think you are correct", "score": 1, "replies": []}]}]}, {"body": "if you are legging into a spread to lock in profit, why not just close the damn position and take your profit home?", "score": 2, "replies": []}]}]}, {"body": "In this situation you will have already made a profit on it moving in the direction you want. “Risk-free” in this situation would be closing the position. However you made profit off the risk in the beginning, where it moves against the way you wanted.\n\nSo no, it’s not arbitrage.", "score": 2, "replies": []}]}]}]}, {"body": "Selling options on RH is what drove me to get a tasty works account.  I wont even open debit or credit spreads.  I solely use it for covered calls, CSPs and shares...", "score": 2, "replies": []}, {"body": "When you got assigned shares, couldn't you just unwind the position? For example, you were assigned 92 puts, sontiu have 9200 shares but you're still long 92 puts yourself at a different strike. \n\nBuy back the stock, sell back the options. However the stock would have moved, the intrinsic value of the option moves as well. \n\nAnd then close the call side too?", "score": 2, "replies": [{"body": "You can't guarantee to close the other side without a hit. ", "score": 1, "replies": [{"body": "So then what's the alternative? Should still be better to try to do something once assigned.  \n\nI guess the alternative is never getting into the position in the first place. ", "score": 1, "replies": [{"body": "U right it s just intimidating. one option controls 100x shares so u d find uself with a huge pos that wipe u out ver quickly. ", "score": 1, "replies": []}]}]}]}, {"body": "Free money ", "score": 2, "replies": []}]}
