{"title": "My parents want me to invest in 20k for them. Which ones do you think is best?", "selftext": "So my parents want me to invest 20k cash (no margin) into some stocks they think will grow. They want something that can be profitable within 1 year.\n\nI'm thinking of either AMD or weed stocks. Reason is because they have room to grow but also since there is no margin investment, there is no need to worry if they drop or rise.\n\n&#x200B;\n\nThe other is like 100 apple shares or fb shares, and sell when it reaches a high again, since they are at a low price now. A lot more stable and less risk imo.\n\n&#x200B;\n\nThey wanted penny stocks, and I told them that was a bad idea. They want basically instant gratifcation which I explained is not gonna happen.\n\n&#x200B;\n\nReason why they want me to do this, is because my dad screwed up royally \"trading\". He basically obsesses over charts daily and he believes he can predict future trends. Then he panic sells. He is kinda a gambler. He already lost a lot of money until I told him to chill and hold onto whatever he had until the stock rises again, since drops and corrections are normal. The minute a stock goes down, he freaks and says they are gonna go bankrupt, then he sells and loses money lol. This was with cash account... like he wasn't even on margin and he was ripping his hair out.\n\nAny suggestions?\n\nThere are also etfs...\n\n&#x200B;\n\nI'm just looking for something stable and profitable. I could care less about their unrealsitic demands lol", "id": "aj2yzg", "created_utc": 1548269277.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 75, "comments": [{"body": "Your dad “ screwed up royally “ Trading, & your thought is to buy weed stocks & amd .   \n\nApple, tree, not far ", "score": 60, "replies": [{"body": "That is the part that's messed up to me. He's doing even worse than his dad and doesn't notice it. Chances are, he's going to lose it and his parents now have someone to blame for the losses.", "score": 11, "replies": [{"body": "I am sorry, but I still had no clarification on the issue with apple shares and  weed shares ... amd I can see the risk.... but what is wronG with the others?\n\n", "score": -2, "replies": [{"body": "If your relationship with your parents is important to you, I suggest you invest in bonds, dude. Don’t lose their hard-earned money by trying to be a hero and beat the market. ", "score": 10, "replies": []}, {"body": "The issue isn't with apple or weed shares. The issue is with you. You're asking a bunch of strangers on the internet what you should be investing in. You're in no position to be managing your parents' money.", "score": 9, "replies": [{"body": "Okay. You do realize people have asked this on here before? If I omitted the context about my parents and just said I got 20k to invest, would you say this? There are posts here not too long ago asking about apple and also what to do with 5k....\n\nAnd no, this was not what the others wrote. The others said more or less \"why would you think apple and weed are a safe bet?\". They had issues with apple and weed stocks.\n\nWeed is volatile, yes yes, but I still don't get why with apple", "score": -2, "replies": [{"body": "If that money was yours, I would not say the same. Your parents gave you that money thinking you knew what you were doing. If you're here asking questions like these, you're aware on some level that you don't know what you're doing. You are doing something that you know you shouldn't be doing, but you're ok with it since you're not the one bearing the loss.\n\nThe comment I answered was a reference to \"the apple not falling far from the tree\", which means the child grows up to be like their parents. Your parents lost money. The contents of your post don't suggest you will be doing better.\n\nFor Apple: They stop disclosing unit sales and lowered earnings guidance. Basically, Apple's reporting to their investors are less transparent than before. ", "score": 5, "replies": [{"body": "Yes but is that the end of the world for apple?\n\nI don't disagree with the other things you said.\n\nIf I just posted like others before, \"is apple a good investment\", I wouldn't be doing any different than others on this sub.\n\nLike im sorry, but is me wanting to invest an apple, making me fall into the same path as my parents (in reference to your apple tree fall quote)... I wouldn't think wanting to do so would be making a horrible decision.", "score": -1, "replies": [{"body": "The question is not \"is that the end of the world for apple?\" The question is \"how would we be able to tell if this is the end of the world for apple?\"\n\nLosing information here is losing the ability to forecast and make reasonable expectations. Before, if US and China halted trade of electronic devices between each other completely, we could look at Apple's unit sales figure and estimate drop in sales. We can't do that anymore. That's why it's become more volatile.\n\nAlso, there is the possibility they are not showing numbers because it is bad and they don't think it will get better.", "score": 1, "replies": []}]}]}]}]}, {"body": "What is wrong with weed shares? Maybe the fact that pretty much all of the companies are overvalued by any traditional metric. Or the fact that it is a brand new industry making it even more unpredictable. ", "score": -2, "replies": [{"body": "No, I got that they are volatile.... but you know they went through massive drops... not sure if it was a correction or not, but they dropped Multiple times and quite heavy before retail sales.\n\nUnless you feel that the shares are worth way less... for example aphria or aurora", "score": -1, "replies": []}]}]}]}, {"body": "I am sorry, but what is wrong with apple shares and what is wrong with weed stocks? The canadian weed companies aren't gonna go bankrupt in a growing sector. Yes there will be volatility, but it isn't so bad in the long term.\n\nFor amd I can see why that is high risk....\n\nBut apple? What is your reasoning with apple being bad. I don't see it as bad in a year....", "score": -3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Ah, okay now I get it. But that doesn't explain the issue with canadian weed stocks... is there a chance they make pot illegal again in Canada? I don't think so.", "score": -1, "replies": [{"body": "weed stocks are incredibly volatile, and their prices tend to change by large amounts very quickly. they're not much safer than just trading in options.  \nnote that i'm not recommending options, because your father's behavior indicates to me that an options strategy would result in all of his money disappearing at a much more rapid pace than it already is. ", "score": 1, "replies": [{"body": "Lol, no you are right about the volatility. Thats what got him in the mess in the first place. I would say that if you invested in it and didnt touch it for a good year, it would be okay of an investment... assuming you buy them when the drop rather than when they are at peak heights", "score": 0, "replies": [{"body": "if every trader was able to accurately forecast when a stock is going to rise or fall, then every trader would be wildly rich. you're just not gonna go far in trading if your only strategy is \"buy low, sell high\" and you don't think beyond that. diversify, manage your risk, and try to earn more than you lose. read everything you can, and never stop learning.", "score": 1, "replies": [{"body": "I don't disagree with what you are saying. And I will keep learning. \n\nI just don't think I can diversify much with 20k. You see what I am saying here right? \n\nLike why buy 10 shares of paypal, 10 shares of fb, 10 shares of xxxx. Wouldn't it make much more sense to just buy 100 of apple while it is low and leave it there since there is no margin pressure? Then there is etf route.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Ha ha.     Apple shares.                   Distance between Apple & the tree ", "score": 1, "replies": [{"body": "I still don't understand the issue with canadian weed stocks for long run", "score": 1, "replies": [{"body": "You say it’s a growing market. ...that’s debatable \n\nYou say none are going bankrupt , that’s debatable \n\nBUT the biggest consideration, & what every stock investor has to learn, is that price is the most important consideration. \n\nA great company can be a lousy investment at the wrong price.      Bought Apple at 230$?    Not a great investment.     A great company can be a great investment at the right price .     Bought Apple at $90 ?  Great investment \n\nA bad company can be a great investment at the right price.     GE at $6.        A bad company can be a terrible investment at the wrong price ....GE at 35$ \n\nEvery stock,every company, has a price at which it’s a good investment and a price at which it’s a bad investment. \n\n\nJust because you think weed stocks will be around forever and you think the market is growing does not mean they are priced to buy right now .     And the fact is that they are not priced right ....they are way overpriced, & I would argue that some are, in fact, going bankrupt . \n\nAdd in the fact that you think they are SAFE and that you want to put your father’s money in them????     \n\nHow about a utility,  a telecom, a bank, a conservative REIT.    ? \n\n", "score": 2, "replies": [{"body": "Edibles are legalized soon... usa may potentially legalize soon or in few years. Beverage and beer companies have already made deals with them.  Though I am sure you heard of the massive drop in aphria price due to short seller's trashy short report....\n\nSo it went from 18 to 5 to 9. I would say not bad of a price.  I do agree that most are overvalued.\n\nBankruptcy... well it depends who you are looking at... I am pretty sure the major players are having less debt with each quarter. The question is whether they will be able to sustain this post-legal sales. From what I gather, there was quite a lot of money made in the first few weeks of sale.\n\nThis is debatable of course.\n \nApple doesn't seem so bad, now that it has been in the lows. I mean I would say amazon was a good buy when it was at 1400 not long ago. I don't know if apple is a good price now, but I doubt you would ever see apple at 90 dollars again... at least not for a long long time. It certainly has been pretty low since a long time so what is the issue with apple. \n\nWeed I can see the issues, but I am surprised for apple you think so... are you expecting it to fall lower? I mean it could, but it has already.\n\nI will look into those, thanks.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If you *truly* want something that will be profitable within 1 year, you'll take that 20k and invest in a high-yield 12 month CD or money market fund like VMMXX.", "score": 11, "replies": [{"body": "Never looked into it, but will start to. They basically want at least 20% profit from original amount.", "score": -6, "replies": [{"body": "20% in one year? Lol. Good luck. \n\nJust throw it into total world market etf/MF.\n\n Don't enable the gambling. I wouldn't help them personally. You'll get blamed if it is down in a year. ", "score": 26, "replies": [{"body": "which etf would you recommend?\n\nIKR? \n\nThis is why am not listening to them on suggestions on what to invest, since they are just gonna go for penny stocks...", "score": -1, "replies": [{"body": "I'm with Vanguard so I'd just dump it in VT. Still pretty US heavy but covers all the main bases. ", "score": 3, "replies": []}, {"body": "Why don't they just do it themselves? ", "score": 1, "replies": []}, {"body": "SPTM, VT, etc", "score": 0, "replies": []}]}]}, {"body": "> They basically want at least 20%\n\nYour parents love you very much. And trust you WAY to much. Even a professional investor with 20 years experience couldn't accomplish this without a significant amount of risk involved. \n\nIf they WANT 20% returns, they better be ready to accept -50% returns as a risk. You can't get 20% returns without a fair amount of risk involved. \n\ni'll probably get downvoted but imo your best chance for 20% gains would be to split it up between weed stocks. So $CGC, $ACB, $APHA, $KSHB, and $CRON. Put $4k each and promise them if they hold 1 year they'll be in the money, then when 1 year say \"PYSCH\" and tell them to hold for 9 more years. They'll thank you in 10 years. \n", "score": 14, "replies": [{"body": "20% in a year... yeah, good luck. I've had triple digit years, but also those -50% ones.\n\n&#x200B;\n\nI personally vote for: SPY, VTI, etc.; nice diversified ETFs. They're a bit slower, but odds of losing tons of money permanently are low. Temporarily, sure - but over time the economy chugs on and these ETFs rise as years/decades progress. And they rise much more than money in the bank, so if you can stomach volatility, you profit with time.\n\n&#x200B;\n\nI have been studying shipping stocks and Canadian oil stocks. Lots of them are trading at levels as low as 3x cashflow, but the dividends are usually sub-10% and most cashflow is going towards deleveraging. The market doesn't seem to like that. For some good examples, check out TGP, NMM, [CVE.TO](https://CVE.TO), etc.; deep discounts, stocks are in the toilet, market yawns.\n\n&#x200B;\n\nProbably the safest way to get a guaranteed 20% is to wait patiently in cash for volatile periods like December 2018, track preferred shares and preferred share CEFs (Closed End Funds - JPC, JPS, FFC, FLC, etc.) which are often as volatile as common shares, but tend to snap back afterwards. You want the CEFs, not the ETFs, because ETFs perfectly track their holdings. The CEFs can disconnect based on supply and demand, and they post the NAV (Net Asset Value) for you on their website, so you always know the exact discount. During December this supply/demand imbalance of shares led to 20% discounts, where you could buy a fund with $9.xx of preferred shares for $7.40. As it snaps back to NAV, you profit.\n\n&#x200B;\n\nStocks like TGP also have their own preferred shares available, and when the market gets skittish, they depart from $25 par value, present a buying opportunity, and then later return to par. Very easy capital gains, usually happening every 1-2 years. I have played SSW (Seaspan) preferred shares a few times, getting them at $20 each time and selling not long after, back at $25.\n\n&#x200B;\n\nThat said, I'd probably just do the ETFs. It's different if you want to watch and trade it and are doing it for yourself - but if you're micromanaging too many accounts, you're more likely to miss something or screw up. And getting blamed for that isn't going to win you any friends in your family.", "score": 2, "replies": []}]}, {"body": "You need to be honest with yourself and your parents, 20% is a truly ludicrous expectation that is not at all realistic.\n\nEven a broad market ETF such as VT or VTI, as some have suggested, averages +5%/year but can drop as much as -50% in a single year. \n\nIf your parent needs this money in 1-3 years and need it to be profitable, a CD or money market is the best option. Anything else is gambling.", "score": 6, "replies": []}, {"body": "> They basically want at least 20% profit from original amount.\n\nThat's delusional. That's not how stock trading or investing works. There are no guarantees.", "score": 4, "replies": []}, {"body": "Hey I can gey you 20% in one year if you let me sell you this bridge. You can sell it later for 20% more. Seriously check out this bridge I have to sell you", "score": 2, "replies": []}, {"body": "> They basically want at least 20% profit from original amount.\n\nWell what they want and what they can reasonably expect are two completely different things. \n\nDo your parents not realize what the average yearly stock market gains are over history? \n\nSounds to me like they are a bunch of gamblers that lost a lot of money and have given up on themselves and are now gambling on you to make unrealistic returns.", "score": 2, "replies": []}, {"body": "Don't invest for them, anything with that sort of return is extremely risky.", "score": 1, "replies": [{"body": "yeah, honestly, I'm just gonna invest them in smth stable and profitable, but I will not guarantee there's a 20% return. I think they don't have a reality check, but they do want me to find smth stable for them to throw 20k in. ", "score": 1, "replies": [{"body": "People in 2001 and 2008 thought what they did was stable...", "score": 3, "replies": []}, {"body": "I just hope you realize any company that is considered stable and profitable today and still go down 40% during a market crash or recession (which very well could be a year or so out). ", "score": 1, "replies": []}]}]}, {"body": "That's awfully high demands from people who have done terribly.", "score": 1, "replies": [{"body": "ikr? I am just gonna throw their cash into a stock that seems reasonable. To be honest, I'm not promising them anything. Like I aint' selling for them. I'm just making sure they invest in smth good. Maybe forget about the 20% return... what would 20k be good for?", "score": 1, "replies": [{"body": "> smth\n\nIs it really that hard to write out something? ", "score": 3, "replies": []}, {"body": "I would plunk it down into a monthly dividend stock, and have it automatically reinvest.", "score": 1, "replies": []}]}]}]}]}, {"body": "Is this fake? This sounds fake.", "score": 12, "replies": [{"body": "Seriously. There is so much wrong with the though process of everyone involved. OP sounds like a complete amateur and his parents sound like gambling degenerates. ", "score": 7, "replies": []}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.4706  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/83528)", "score": 7, "replies": []}, {"body": "Two good etf’s, ffty,hack, stocks,Microsoft, Salesforce,get at least 8 more companies to diversify ", "score": 2, "replies": []}, {"body": "Nvda ", "score": 2, "replies": []}, {"body": "These are all terrible investments for people your parents age. They screwed up investments so they want to invest in shit that’s risky and already overpriced?\n\nPut it in VTI, VXUS, and VWO. VWO might have more upside. ", "score": 2, "replies": []}, {"body": "CRMD", "score": 1, "replies": []}, {"body": "It doesn’t sound like they have reasonable expectations for a one year investment. To get a 20% return you really have to gamble, could be a 20% loss. That being said, Apple or Microsoft seem ok. They may have to wait longer than a year to get to 20%. ", "score": 1, "replies": []}, {"body": "KL - Kirkland Lake Gold\n\n&#x200B;\n\nThe company is well managed and the stock has been performing well lately. They've had great production from their current mines and they say they have new mines that should produce even more for them.\n\n&#x200B;\n\nThey're pretty resistant to downturns in the market as well, since they mine gold. I don't see this company going anywhere in the next year and it has the potential for big returns in that time.\n\n&#x200B;\n\nIf you're looking for your 20% in 1 year return, then I think this is your stock.", "score": 1, "replies": []}, {"body": "sp500", "score": 1, "replies": []}, {"body": ">They want something that can be profitable within 1 year.\n\nWhy? \n\nNo, this is not a peripheral question. Why the *fuck* does it need to be profitable within 1 year? That's ridiculous  and setting you up for failure.\n\n\n", "score": 1, "replies": []}, {"body": "SPY\n\nBut if you want to gamble ala weed stocks or AMD, I like... \n\nTeladoc,\nShopify,\nDexcom,\nThe Trade Desk,\nSquare,\nLive Nation\n\nAnything Software as a service related is high risk high reward...\n\nI like this ETF for Saas S&P Software & Services Select Industry Index - XSW", "score": 1, "replies": []}, {"body": "Total market and S&P500 are both stable and profitable over the long term. If your parents aren't looking to \"Cash out\" and just want a source of income, VNQ is a great option too. You put money in, forget about it, and once every quarter pull your dividends out. ", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Thanks for commenting. I will look into that", "score": 1, "replies": []}]}, {"body": "Low expense ratio Sp500 index fund, wait till it goes to about 2300 and buy in increments of 1/3 of the money, if the economy gets worse wait until you can get into the sp500 at about 2000 to 1500 (if shit goes down). A really safe method and let it sit there until retirement and put in more money over time.", "score": 1, "replies": []}, {"body": "Invest in Mutual Funds, ETFs, Index funds, or bonds. 20,000 can be a lot of money and just to play around with it isn’t smart. Mutual Funds and the others I named are more reliable and won’t be as risky. A ETF like Voo is a smart choice. I would do a lot of research before I throw around 20,000$ and ultimately lose your parents hard earned money. Don’t be dumb about this.", "score": 1, "replies": []}, {"body": "I wouldn't touch weed stocks with a ten foot pole, especially if you're investing your parents money. Invest in an ETF like vanguard growth fund and throw 10% of the 20k into Apple or AMD. Play it safe and in a year if the fund grows by $1,000 they will be stoked.\n\n&#x200B;\n\nBetter than a 20% loss and your parents forever thinking you're a total dingbat. ", "score": 1, "replies": []}, {"body": "VTSAX and chill.", "score": 1, "replies": []}, {"body": "GOOG", "score": 0, "replies": []}, {"body": "MU", "score": 0, "replies": []}, {"body": "Apple or Fedex look for quality growth off the highs", "score": 0, "replies": []}, {"body": "You could buy NLY and blow their minds with the annual dividends, which should be reinvested.  There is risk in a recession or something that they would have to cut dividends though, which would slash the stock price.\n\nSafer bet would be another high dividend etf like HDV.  Set it and forget it. Again with reinvested dividends. ", "score": 0, "replies": []}, {"body": "There is so many things wrong with what you posted. Seems like the answer should be something simple like sticking it all in $SPY or something. \n\n>They want something that can be profitable within 1 year.\n\nAlso make sure you tell them you do not invest in the stock market with money you want/need in a year. If you need it that soon stick it in a 12 month CD.", "score": 0, "replies": [{"body": "They don't need the 20k, which is why it is cash investment rather than margin. ", "score": 1, "replies": [{"body": "Then why are the making request for a particular return by the end of the year as opposed to an average yearly return over multiple years?", "score": 1, "replies": [{"body": "They just want to make sure the money isn't lying there dead. ", "score": 1, "replies": []}]}]}]}, {"body": "BUY 60%ETF  20% blue chip divedend   20% risk like amd and weed", "score": 0, "replies": []}, {"body": "If you want a 20% gain within a year you're likely going to need to make a handful of trades throughout the year.   \n\n\nI'd recommend going after some solid companies and when you're up 5-10% on one of them, sell it all and lower your position in another one. Rinse and repeat.", "score": -1, "replies": [{"body": "Thankfully you were here to inform him of the strategy to buy some good companies and then sell them. I'm sure he didn't think of that one.", "score": 1, "replies": []}]}]}
