{"title": "Don't Go Long On Chesapeake Energy", "selftext": "Hi guy this is my first post and I'm doing it to warn about Chesapeake.\n\nSome of you probably witnessed the monster bull run then followed by the monster crash and thought buy time! This company is not in any position to service a large tranche of debt due in coming weeks. The bankruptcy stories today are old news just rewritten to roll with the big pump and dump. As some of you know the bonds are trading for 5 cents on the dollar even threw the gigantic rise. \n\n The execs paid out $25 mill to each other a few months ago to help \"stay motivated threw this\". What we saw Friday/Monday was likely a enormous short squeeze. This should not be looked at imo as anything else. None of the underlying conditions have changed for Chesapeake in months. I know it might look tempting but the only play is puts and I am only playing the July's.\n\nCHK 7/17 $10P, $5P", "id": "h02kuu", "created_utc": 1591758504.0, "score": 106, "upvote_ratio": 0.91, "num_comments": 78, "comments": [{"body": "You act like we don’t know there’s an influx of robinhood users scraping up all the stocks that are lower than their 52 week high.  But guess what?  They didn’t realize that some of these companies are going bankrupt.  Whoopsie 🤷🏻‍♂️", "score": 58, "replies": [{"body": "I think most people here are pretty sharp compared to the other shit I read. I have seen numerous people talk about trading this shit tomorrow and it is pure danger.", "score": 27, "replies": [{"body": "No more fundamentals baby! I trade on fundamentals and general TA n lost bigly. Its JPOW hopium opium time.", "score": 13, "replies": []}, {"body": "Yeah but people here buy short term OTM options. With weekly OTM calls, it doesn't really matter if the underlying goes bankrupt or drops 10%, you're still completely dead in the water. Like it might be 100% loss vs 95% loss, who gives a shit.\n\nNo danger.", "score": 6, "replies": [{"body": "Except...IV crush is the definition of danger. Suckers buying weeklies on this with massive premiums and huge theta bangs are SOL.\n\nI know you're thetagang so you want them to keep going, but still. :)", "score": 5, "replies": [{"body": "Nah I always buy some lottery tickets too. Bagholding 20x GME 6/19 6c right now in fact.\n\nNothing wrong with speculative FDs. You just need to manage your bankroll well since they are unlikely to hit by definition. Plus most of these meme stocks have higher realized volatility than implied volatility meaning options are actually underpriced vs risk. Hence why I don't run theta gang on shit like CHK.", "score": 4, "replies": []}]}, {"body": "I’m half-convinced some idiots do that just to make the front page lol.", "score": 5, "replies": []}]}, {"body": "That’s what I’m saying, these people are new and don’t know shit....\n\nBut I’m also saying you act like we don’t know this shit gunnah drop", "score": 1, "replies": [{"body": "Everything I know I assume everyone here does as well. Chesapeake is something I had to bring up, it is a special kind of danger like a 30x leveraged ETF that is 80% loser. I have seen so many poor bastards getting rolled for 5 figures today so I spoke up.", "score": 13, "replies": [{"body": "If you get rolled on CHK your deserve it.", "score": 8, "replies": [{"body": "💯", "score": 5, "replies": []}]}]}]}]}, {"body": "LTM\n\n67,000 RH users holding when it delisted this evening.\n\nThey're gonna be in for a big surprise in the AM.", "score": 14, "replies": [{"body": "My point exactly 😂", "score": 3, "replies": []}, {"body": "The Bagholder Quotes from that are gonna be so juicy tomorrow!", "score": 2, "replies": []}, {"body": "i bought in today - lol", "score": 2, "replies": []}]}, {"body": "You mean buying fractionals of Chesapeake was bad?", "score": 1, "replies": []}]}, {"body": "\\*sniff\\* \\*sniff\\* I smell a bear", "score": 89, "replies": [{"body": "100%", "score": 37, "replies": []}, {"body": "Can you smell if he is a gay bear?", "score": 21, "replies": [{"body": "Not all gays are bears, but all bears are gay", "score": 60, "replies": []}, {"body": "Let me fuck him real quick and I’ll let you know if he is", "score": 11, "replies": []}, {"body": "Yeah if you stick your dick in him I’ll sniff it to see if there’s shit", "score": 2, "replies": [{"body": "...or if there's cum that doesn't taste like your own.", "score": 1, "replies": []}]}]}, {"body": "Kinda also smells like honey.", "score": 3, "replies": []}, {"body": "I thought you were doing blow and got excited", "score": 1, "replies": []}]}, {"body": ">Don't Go Long On Chesapeake Energy\n\nFUCK YOU I WONT DO WHAT THEY TELL ME\n\n\nFUCK YOU I WONT DO WHAT THEY TELL ME\n\n\nFUCK YOU I WONT DO WHAT THEY TELL ME\n\n\nFUCK YOU I WONT DO WHAT THEY TELL ME", "score": 16, "replies": []}, {"body": "through*", "score": 30, "replies": [{"body": "Lost all credibility when they didn't know which through to use", "score": 15, "replies": []}]}, {"body": "How many c level exces does it take to change a light bulb?\n\nAnswer: None. The janitor does it while they give other efficieny awards.", "score": 19, "replies": []}, {"body": "Yo JPow, this guy trying to get us buying some “p”s again. Can you please take care of it?", "score": 8, "replies": []}, {"body": ">Threw\n\nHow many times are you going to use this incorrectly in one post?", "score": 23, "replies": [{"body": "Ya that really through me off....", "score": 12, "replies": [{"body": "You were thoroughn off by that?", "score": 2, "replies": []}]}, {"body": "What’s incorrect? Sorry am a tard", "score": 1, "replies": [{"body": "The right word is through.", "score": 3, "replies": []}]}]}, {"body": "Perhaps they sold a fuck ton of treasury stock yesterday and cashed in on the run up and they’ll use the sudden infusion of cash to float a bit longer. \n\n7/17 $69c", "score": 7, "replies": []}, {"body": "Why do you buy puts with 500% IV and shit volume", "score": 8, "replies": [{"body": "Sell naked calls homie", "score": 7, "replies": []}]}, {"body": "CHK has been fucking people for years on their stock. I know boomers that play the game but this is absolutely one stock to stay the fuck away from", "score": 6, "replies": []}, {"body": "I already cashed out $23,000 in profits on chk calls and am letting my remaining 7 on RH and 10 on TDAmeritrade ride.  Best $179 investment of my life.\n\n&#x200B;\n\nAlso i bought more calls.\n\n&#x200B;\n\nAlso, i'm probably going to buy even more calls.\n\n&#x200B;\n\nTLDR: Screw puts.  CHK calls = profit", "score": 6, "replies": []}, {"body": "If I buy puts on a company that goes bankrupt the puts become worthless?", "score": 3, "replies": [{"body": "More complex than that. But let's use a standard CH. 11 example.\n\nCompany ABC is selling at $5 when it declares Ch. 11 BK.\n\n* stock starts dropping on BK news. THE WEIRD PART RECENTLY: it goes back up due to pajama traders on RH grabbing a well-known stock \"cheap\". \n* Ch. 11 means reorg. not shutdown. Depending on the debtholder plan, equity may retain some value. PCG is a good example I think, as equity was never wiped out when they declared Ch. 11 last year though obviously shareholders were hammered hard (traded below $4). \n* What you're maybe thinking of is if a stock gets delisted after failing milestones (google them). No amount of RHers will save it once it goes to the pink sheets. RHers  will freak out because they won't see it listed, and abandon it (watch what happens tomorrow with LATAM bagholders). Institutions will already be out. There will  be extremely low volume, and virtually no \"buy\" orders. Stock will trade for literal pennies.\n* Debt holders will get to write the rules for assets/continued operations. They will undoubtedly wipe out shareholders, meaning stock will be worth $0 or very close.\n* No new option orders will be taken by indices when stock delists. However, existing contracts still stand. So puts will still be good through expiration date. You might have to deal with your broker to handle exercising or selling though.\n\nSo it depends on whether CHK's BK looks like PCG or LATAM for put value. But either way, your existing puts will act normally.", "score": 8, "replies": [{"body": "Thanks, King", "score": 3, "replies": []}, {"body": "Update: looks like they're getting delisted\n\nhttps://www.marketwatch.com/story/hertz-gets-delisting-notice-from-nyse-will-remain-listed-pending-appeal-2020-06-10", "score": 2, "replies": [{"body": "They got the notice on May 26, same day as LATAM. So they had until pre-opening today to officially appeal; the announcement is they are appealing. I have 0 knowledge regarding whether that will work or how long that will take.", "score": 2, "replies": []}]}, {"body": "Is there a reason to not yolo into August - January call credit spreads besides being forced to hold to expiry?", "score": 1, "replies": []}]}]}, {"body": "Can confirm.  Lost an amount of five digits on this joke.", "score": 4, "replies": [{"body": "Only reason I made this post is this. Some guy I follow said his 12 year old sons friends were buying CHK and told him too. It feels like pure tits up. But some sick rally to $45 can run again.....", "score": 12, "replies": [{"body": "To be fair, I initiated my position last April and held until this February, so my losses weren’t form this recent fiasco.  \n\nCareful who you read... Hahahaha I was reading a bull who sounded more researched than any bears I was reading.  Tried averaging down but it never rose back up.", "score": 2, "replies": []}]}]}, {"body": "I had a put that i bought yesterday before eod and today it automatically exercised after there was suspended trading? Wtf. I made tendies but that was weird.", "score": 2, "replies": [{"body": "I have about 400 puts from $3.5-$10.00 I wish that happened to me...", "score": 3, "replies": []}, {"body": "Your put exercised on its own? That's really strange. What brokerage?", "score": 1, "replies": [{"body": "Fidelity", "score": 1, "replies": [{"body": "Your broker said fuck this guy is stupid for not exercising. I’m going to will it for him.", "score": 2, "replies": [{"body": "TFW the AI is trading for me", "score": 1, "replies": []}]}]}]}]}, {"body": "They did a reverse split two months ago? Seee ya", "score": 2, "replies": []}, {"body": "6/12 $0.5p it is. I'm good for $8.", "score": 2, "replies": []}, {"body": "That ain’t a crash u gay bear that’s a V shaped recovery", "score": 2, "replies": []}, {"body": "Because of this post I’m buying calls. Full retard.\n\nEdit: just looked and the premiums are outrageous. I’m too poor to go full retard I guess.", "score": 2, "replies": [{"body": "yeah man the IV is screwing us :|", "score": 1, "replies": []}]}, {"body": "Confused... If its going bankrupt the stock goes up, So buy calls not puts.", "score": 2, "replies": []}, {"body": "Reverse psychology... ok buffet. Calls it is.", "score": 1, "replies": []}, {"body": "“Service a large tranche”", "score": 1, "replies": []}, {"body": "Man the last buy for a 0.5 put was 0.38.  Why even bother at that price", "score": 1, "replies": []}, {"body": "100% going long on Cheesecake Fact-energy tomorrow at open", "score": 1, "replies": []}, {"body": "30 day ban for this 🐻", "score": 1, "replies": []}, {"body": "This man spelled Through as threw...", "score": 1, "replies": []}, {"body": " None of the underlying conditions have changed for any corp", "score": 1, "replies": []}, {"body": "lmfao this POS was below 1 dollar not too long ago....\n\nPUMP N DUMP \n\nlike your mom", "score": 1, "replies": []}, {"body": "I day traded this a bit pre rs. Wouldn’t touch it right now other than massive puts.", "score": 1, "replies": []}, {"body": "Why cant i find any puts or short certificates? Anyone similar problems? Am trading from germany", "score": 1, "replies": []}, {"body": "Sooo calls?", "score": 1, "replies": []}, {"body": "I threw this discussion out, because I couldn't keep reading past the second misuse of 'through'.", "score": 0, "replies": []}, {"body": "He used tranche in his post, that's The Big Short language, confirmed golden DD", "score": 0, "replies": []}]}
{"title": "What did AAPL do in the past 18 months to explain their cap growing by $500bn (to $1,5 trillion)?", "selftext": "", "id": "h0fg50", "created_utc": 1591809737.0, "score": 123, "upvote_ratio": 0.95, "num_comments": 73, "comments": [{"body": "The same thing MSFT did.\n\nIt existed during a time where there was nowhere else to put your money.", "score": 185, "replies": [{"body": "Sort of neat how that happens when you push interest rates down on an already too-hot economy (pre-COVID that is).", "score": 35, "replies": [{"body": "this shit is gonna be wild when it pops lol", "score": 31, "replies": [{"body": "Welcome to the new Trump® Business Cycle, inspired by his own experiences:\n\n1. Get sketchy foreign investment\n2. Get yourself and your friends rich\n3. BANKRUPT", "score": 39, "replies": []}]}]}, {"body": "Bingo.  And had a business that isn’t heavily affected by the pandemic", "score": 9, "replies": [{"body": "I don't know man. Consumer spending has pulled back significantly and will likely remain depressed for quite a while. I would think this would have a significant impact on product sales. Clearly the market doesn't agree, but if iPhone sales are way down when they report next month, watch out.\n\nI don't really get why people think big tech is immune. They need people to open their wallets. People who have lost their job, or if they still have their job, have probably taken a pay cut.", "score": 6, "replies": [{"body": "> Consumer spending has pulled back significantly \n\nApple prepared in advance in the last couple of years by building a credit services component (Apple Card, etc) and is a) offering a lower entry point (iPhone SE) and b) providing direct finance. And they’re doing it without cheapening the perception of iPhone as a premium product.", "score": 8, "replies": [{"body": "Apple card still seems like an idiotic idea to me. iPhone SE has already been done. Any more bright insights?", "score": 1, "replies": [{"body": "Old or not, smart or stupid, easing friction helps sales in a downturn.\n\nUsers who purchase an iPhone through the Apple Card will not have to pay interest for the first 24 months following the purchase. This feature is also available through the iPhone upgrade program, which also lets users switch to a new device after making 12 payments.", "score": 3, "replies": [{"body": "And once your in the APPL ecosystem you’re stuck for life. Trust me.", "score": 1, "replies": []}]}]}]}, {"body": "It's not immune, it's just less affected than most other industries.", "score": 1, "replies": []}]}]}, {"body": "Do you think Apple will hit 260 tmr? Thanks in advance", "score": 6, "replies": []}, {"body": "They are... Not really comparable.\n\nMicrosoft has azure, one of two in what is essentially a duopoly, the enterprise cloud-computing market.\n\nApple has phones. And stopped disclosing their sales 😬 They've got a ton of cash so I'm sure they'll figure something out, but Microsoft is the far superior company going forward. (Then Amazon sits there in the background, and will overtake both of their market caps shortly.)", "score": 4, "replies": []}, {"body": "Came here to say this.", "score": 1, "replies": []}]}, {"body": "Their P/E levels are in bubble levels, they ain't gonna go bankrupt and have a sound balance sheet so people are piling in as most other companies are ass", "score": 32, "replies": [{"body": "apple 27... meh", "score": 3, "replies": [{"body": "Give it another quarter and it'll be even better!", "score": 4, "replies": []}]}]}, {"body": "AIRPODS", "score": 18, "replies": [{"body": "Probably not, but really, the new ones are pretty dope", "score": 2, "replies": []}]}, {"body": "Since most of this occurred pre covid. The market finally started to value them more as a services businesses more than a declining hardware company.  This reevaluation caused the PE to expand from ~12 to ~22", "score": 14, "replies": []}, {"body": "[deleted]", "score": 46, "replies": [{"body": "If you don’t believe in yourself, no one will", "score": 28, "replies": []}]}, {"body": "Buybacks and cheap phone", "score": 38, "replies": [{"body": "overvalued is the new undervalued 😎", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 52, "replies": [{"body": "[deleted]", "score": 37, "replies": [{"body": "What’s your next trade or current position? Please tell me", "score": 48, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "You are correct. The comment above is retarded.", "score": 14, "replies": [{"body": "Actually, the CalmAgent’s comment above you is correct. You cant assume perfect liquidity at the price", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "And a constant relationship between the market cap and share price.", "score": 1, "replies": []}]}]}, {"body": "Hilarious.\n\nBut yea please tell us 😂", "score": 3, "replies": []}]}, {"body": "Pretty much. Except it also alters demand.", "score": 3, "replies": []}, {"body": "Well it might go: Tim Apple buys shares -> stonks go up because less shares -> autists on wsb see stonks go up so pump the stock -> actual market cap increases on retard money and hype -> the whole fucking economy is a bubble.", "score": 5, "replies": []}, {"body": "Market cap is just share price multiplied by the amount of outstanding shares.", "score": 10, "replies": [{"body": "Buybacks mean less shares. lol", "score": 37, "replies": [{"body": "u rite, im dum dum", "score": 9, "replies": [{"body": "It's still not a direct comparison though because buybacks effect supply/demand.  \n\nMost people are not buying shares because of how much money a company has on hand so.", "score": 2, "replies": [{"body": "People absolutely buy shares based on how much money a company has. Even just basic arbitrage looks for that, and this would be a good example of value investing. That’s also why some companies are worth more in bankruptcy than under a failing brand / business model for real estate holdings or IP.", "score": 4, "replies": [{"body": "This is literally the reason the stock market goes up over time, and why stock buybacks increase stock pricee. New money flows to corporations, stock price goes up to reflect more money held. Corporation buys its shares, and the remaining shares soak up more new money per share coming in; ad infinitum.\n\nA commitment to buying at the market price, by definition, doesn't change the market price - it doesn't shift the supply or demand curve.", "score": 3, "replies": []}, {"body": "Yeah but supply and demand effects every buyer and not every buyer cares about money on hand.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That's precisely it. They just reduced the number of shares in circulation driving up prices for the remaining shares and consequently pushing up the market cap.", "score": 8, "replies": []}]}, {"body": "jesus", "score": -3, "replies": []}]}]}, {"body": "Printer went brrrr, and your $ just lost some of their value. Oh and Tech has lots of cash stacked up in taxhavens to survive any downturn and will make keep on making money. Apple, Microsoft, Amazon, Google are the new Bonds.", "score": 10, "replies": [{"body": "I'll believe Amazon and Google when they get past their anti-trust lawsuits. Until then I'm on the sidelines with them. If I'm wrong I'm wrong but I'll bake my tendies in another oven for awhile.", "score": 6, "replies": []}, {"body": "This is what the bears dont get. True bears should be investing in some foreign currency against the dollar", "score": 3, "replies": [{"body": "True bears go precious metals", "score": 3, "replies": []}]}]}, {"body": "Donny saying \"Tim Apple\".", "score": 3, "replies": []}, {"body": "Trying to link the prices of this market to fundamentals is a complete waste of brainpower.", "score": 3, "replies": []}, {"body": "Timmy introduced 69 more colors for Apple Watch bands", "score": 3, "replies": []}, {"body": "its those 3 cameras on their new phones, totally justifies the absurd market cap.", "score": 3, "replies": []}, {"body": "They weren't a shit company like hertz or jcpenny or american airlines", "score": 3, "replies": []}, {"body": "They finally got a market multiple. I honestly don’t think the move was irrational.", "score": 3, "replies": []}, {"body": "they fixed the keyboard! (that they themselves broke in 2016)", "score": 3, "replies": []}, {"body": "Logo looks cool", "score": 3, "replies": []}, {"body": "how has nobody mentioned making their own processors in house... this is HUGE for them", "score": 3, "replies": []}, {"body": "during the riots cops are targeting phones with there batons.... lots of smashed phones in the last week.", "score": 3, "replies": []}, {"body": "Apple literally exist in 2 colors: red and green.\n\nSince the logo is a half bitten apple, probably some retard took a bite and realise it is unripe.\n\nSo probably this is a green unripe apple.\n\nHence stocks go green.", "score": 2, "replies": []}, {"body": "New iPad Pro has $129 stylus", "score": 2, "replies": []}, {"body": "They missed on iPhone sales and spent 50 billy buying back their stock", "score": 2, "replies": []}, {"body": "Stock Buybacks", "score": 3, "replies": []}, {"body": "Still better than buying NKLA, ZM, DKNG.", "score": 2, "replies": []}, {"body": "[get in!](https://eur06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fimgflip.com%2Fi%2F44oeuh&data=02%7C01%7C%7C2acdd1c7f33a4689494208d80d675bdd%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C637274084856578372&sdata=PkyfMKnPM6as%2BNMvbE6BUE3R4UsUSDxmw6a9opkk5n0%3D&reserved=0)", "score": 1, "replies": []}, {"body": "They sold some phones", "score": 1, "replies": []}, {"body": "It's gotta be the Pro Display stand.", "score": 1, "replies": []}, {"body": "App Store and Apple credit card.", "score": 1, "replies": []}, {"body": "Cramer says that made a ton with Apple Pay. I don't know if that wound explain everything.", "score": 1, "replies": []}, {"body": "Robinhooders", "score": 1, "replies": []}, {"body": "Is there a chance this fucker will correct itself by the end of next week? that's the real question here.. lmao", "score": 1, "replies": []}, {"body": "Hell ya bruv how when tf Android nerds gonna learn iOS is God", "score": 1, "replies": []}, {"body": "I would argue the new custom CPU direction is priced in. No more Intel chips.", "score": 1, "replies": []}, {"body": "They got more gayer?", "score": 1, "replies": []}, {"body": "They existed.\n\nS_______  O_____  G__  U__", "score": -3, "replies": []}, {"body": "Not get filled with holes from retarded worms. Names the new species of worm WSB", "score": -2, "replies": []}]}
{"title": "Help!!! Accidentally YOLO'D my entire profile on $BA puts", "selftext": "My theory was that BA will not go below 193 (20 sma on weekly) this week. So I sold 192.5/190 put credit spreads expiring 6/12. But, didn't notice the default trade quantities on E-Trade. Ended up accidentally YOLOing my entire account. I'm up 20% at the moment. Not sure what to do.", "id": "h0kuiy", "created_utc": 1591824960.0, "score": 40, "upvote_ratio": 0.74, "num_comments": 76, "comments": [{"body": "You sound retarded. Welcome. Cash out or let it run. I couldnt give less of a shit", "score": 145, "replies": [{"body": "I have been blocked by E-Trade and cannot make day trades for 2 more months", "score": 50, "replies": [{"body": "big fuck’d", "score": 50, "replies": []}, {"body": "Lmao holy shit lol maybe try calling them and telling them how retarded you are?", "score": 38, "replies": []}, {"body": "I smell bullshit, even if suspended you can close out positions. And how would you have opened the positions in the first place earlier today?", "score": 27, "replies": [{"body": "pics or it didn’t happen OP", "score": 0, "replies": []}, {"body": "It means no day trades.", "score": -16, "replies": [{"body": "You should be able to exit your position while blocked. If not pick up the phone and call them explain that your blocked trying to exit and they will likely unblock allowing you to exit, or place it over the phone", "score": 26, "replies": [{"body": "Will consider that now. Not sure if they can help now since post market hours", "score": -8, "replies": [{"body": "Why are you throwing money at this when you don't even know how it works?  You act like you're helpless.. contact support.", "score": 25, "replies": []}, {"body": "If they can't help you, then close it at the open tomorrow, especially if you're still up.", "score": 4, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Wtf", "score": 1, "replies": []}]}]}, {"body": "Nope. They are off work hours. I need to close it manually tomorrow morning at the market open. \nOn the other hand, the autistic side of me wants to hold it until expiry. In a dilemma", "score": -10, "replies": [{"body": "You made a big oof and you haven’t payed the price for it yet. Your decision on that one bud", "score": 5, "replies": []}]}]}]}]}, {"body": "You can always close positions.  You just can’t open any more.\nIn this case buying the spread.", "score": 10, "replies": []}, {"body": "Welcome to Retardistan, population: You.", "score": 5, "replies": []}, {"body": "Call them on the phone and ask for a variance or exception. I know that at least TD Ameritrade will unlock you three times within a year. Just be super super nice to the person on the phone!!", "score": 3, "replies": []}, {"body": "Ughh. Whatever cash you start the day with is your day trading purchasing power. If you look at balances it literally says day trading purchasing power right below equity call. If you start the day with 5k cash, and you buy 2500 and sell for 3k and bank a 500 profit, your cash should say 5500, but your day trade purchasing power is 2500. You can then trade again but you can’t go over 2500. Once you use up your daily cash limit you have to wait until the next day. Like if you deposit cash at the ATM and then you have to wait a day until it’s available to use. You’re not restricted for 90 days, you just have a daily limit that resets each day, until you have 25k.", "score": 3, "replies": []}, {"body": "Fuck.", "score": 2, "replies": []}, {"body": "Call your broker", "score": 2, "replies": []}, {"body": "It's not a day trade if you close out the next day", "score": 1, "replies": [{"body": "Not with TD.", "score": 1, "replies": []}]}, {"body": "Their system doesn’t stop you from exiting the trade. If you do it may limit your buying power but they won’t force you to stay in the trade. Had some short SPY puts I almost got wrecked on and had them confirm. Repeated abuses can result in them locking the account to no trading but that’s like if you are trying to get black listed lol. Also to one of your other comments E*TRADE is open 24/7", "score": 1, "replies": []}, {"body": "well tomorrow it won't be a day trade, retard", "score": 1, "replies": []}, {"body": "LOL", "score": 1, "replies": []}]}]}, {"body": "Did you delete the app yet that’s usually step 1", "score": 30, "replies": [{"body": "Not yet.", "score": 5, "replies": [{"body": "All u need to do is make it a debit spread sell the next strike below since it’s already in some profit", "score": 1, "replies": []}]}, {"body": "You guys he has to atleast lose 90% for him to consider. Lettem ride I say 🙌💎💎💎", "score": 2, "replies": []}]}, {"body": "Nobody tell him\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 20, "replies": [{"body": "Bood got", "score": 10, "replies": []}, {"body": "Break me off a piece of that... Apple sauce... Football cream... Fancy feast", "score": 2, "replies": []}]}, {"body": "Bake your tendies", "score": 7, "replies": [{"body": "Truly, this is peak WSB", "score": 1, "replies": []}]}, {"body": "“Accidental” and “YOLO” don’t go together. Suspicious.", "score": 8, "replies": [{"body": "May be try to place a trade without knowing any \"default settings\" in the app. You will be posting a similar post.", "score": -3, "replies": [{"body": "\"Ignorance\" and \"YOLO\" don't go together either.", "score": 8, "replies": []}]}]}, {"body": "Just call etrade and ask to be unblocked bro, not that hard", "score": 12, "replies": [{"body": "You should do this, otherwise you are fucked. Usually if you have had an account for a while they will help you out, condescending attitude and all", "score": 4, "replies": []}]}, {"body": "A gay bear buying puts cant be helped seems like the autism has spread too far throughout your brain", "score": 5, "replies": [{"body": "Do you realize his position bullish?", "score": 2, "replies": [{"body": "no im a retarded autsist", "score": 6, "replies": [{"body": "Ah OK. He sold a put credit spread. Meaning he makes money if BA stays above 193. Ideally, it will go up, and he will be able to exit the position sooner at a large profit.", "score": 3, "replies": []}]}]}]}, {"body": "pic or ban", "score": 6, "replies": []}, {"body": "Be better next time...", "score": 3, "replies": []}, {"body": "I’m at the bar audibly laughing at you rn", "score": 3, "replies": []}, {"body": "Cash out retard", "score": 2, "replies": []}, {"body": "Just sell them tomorrow tf", "score": 2, "replies": []}, {"body": "Not selling is essentially the same as buying at the bid price. Would you buy it all again, right now, if you hadn’t already?", "score": 2, "replies": []}, {"body": "Damn, this guy had to wake up at a panic.. 188.50 when I got up this morning.", "score": 2, "replies": [{"body": "He whoopsies his life savings, was up 20%, got greedy and is about to lose it all. WSB at it's finest.", "score": 5, "replies": []}, {"body": "Yup. You said it", "score": 1, "replies": []}]}, {"body": "This aged well.", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/wilywarewolf the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Credit spreads or debit?", "score": 1, "replies": [{"body": "Credit spreads.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "192.5. yes I will be good if it doesn't.", "score": 1, "replies": [{"body": "Uh ohhhhh", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Probably a good idea. I will consider selling a spread for the same price and later date to break even. Fuck.", "score": 1, "replies": []}, {"body": "Expiry date?? 6/12?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not sure what you expect us to do. Crash planes? Cash out or hold to 0.", "score": 1, "replies": [{"body": "My position is bullish. I would be expecting WSBers to be building those God damn 737 Max planes instead of crashing them.", "score": 1, "replies": []}]}, {"body": "Obviously hold", "score": 1, "replies": []}, {"body": "How are you up on selling puts when BA crashed today", "score": 1, "replies": []}, {"body": "Don't know. May be accidents do good sometimes?", "score": 1, "replies": []}, {"body": "Proof or ban", "score": 1, "replies": []}, {"body": "What's your theory? Do you think $BA will close below 192?", "score": 1, "replies": [{"body": "You been watching?  Looks to open below $192", "score": 1, "replies": [{"body": "Yup. It's already 196.80. Jpow printer strikes again. Except for this time the printer is working backwards. Fuck!", "score": 0, "replies": []}]}]}, {"body": "😂😂😂😂 honestly rigging the system and proceeding to be fuqed by said system at same time... You belong here", "score": 1, "replies": []}, {"body": "Prolly it will dump on you and since you’re out of day trades, you will be fucked royally. This is WSB", "score": 1, "replies": [{"body": "Do I belong here?", "score": 1, "replies": []}]}, {"body": "Gay flex, but ok", "score": 1, "replies": []}, {"body": "\"Accidentally\"", "score": 1, "replies": []}, {"body": "Sell asap", "score": 1, "replies": []}]}
