{"title": "HVAC Stocks: The Next Bubble", "selftext": "Recently there has been rising Coronavirus cases in the US in very hot climates, Arizona being the prime example. Why is this happening? Part of it is because in very hot climates, people are more often indoors than outdoors, and we’ve seen statistically that being outdoors is much safer for stopping the spread of Coronavirus than indoors. But it may also have to do with people blasting AC and poor ventilation as Nate Silver suggests in this tweet.\n\n[https://twitter.com/NateSilver538/status/1273329472524222466](https://twitter.com/NateSilver538/status/1273329472524222466)\n\nIt seems very possible to me that the AC/ventilation in very hot states is not good enough to stop the spread of Coronavirus and that many businesses will need to upgrade or rework their HVAC systems. Many businesses have already suggested they will do so.\n\n&#x200B;\n\nhttps://preview.redd.it/ywtvy3dtov551.png?width=630&format=png&auto=webp&s=bbfd94684ecedb74b9e076d9fcd2ff2f136e913c\n\nhttps://preview.redd.it/92nz808rov551.png?width=1836&format=png&auto=webp&s=182264659ae792e9a96499d3b7c6d66feaef9227\n\nSo what HVAC companies should you buy? There are two I think make the most sense. One is Carrier (CARR), which is a stock people on WSB seem to like. Carrier wrote a whitepaper in May explaining how HVAC companies can help slow the spread of Coronavirus.\n\n[https://www.shareddocs.com/hvac/docs/1001/Public/02/COVID-19-WHITE-PAPER.pdf](https://www.shareddocs.com/hvac/docs/1001/Public/02/COVID-19-WHITE-PAPER.pdf)\n\nCarrier has also launched a program called the Healthy Building Initiative. The company clearly sees Coronavirus as an opportunity and that fact makes them seem like the best buy here. Trane Technologies (TT) is also a commercial HVAC company and seems like a better by than Lennox (LII) that does more residential sales. I think Johnson Controls (JCI) is also a solid buy.\n\nCARR July 17 22C\n\nEdit: Thanks everyone for the thoughtful replies. This is a more knowledgeable subreddit than people give it credit for. There were a lot of replies that made great counter points, so I'm no longer as bullish on this idea.", "id": "hc1u4s", "created_utc": 1592577521.0, "score": 37, "upvote_ratio": 0.79, "num_comments": 68, "comments": [{"body": "My father used to work in HVAC business until coronavirus - his company was a Carrier dealer. Yes, they will probably benefit, but only marginally. Major HVAC retrofits are expensive and big commercial jobs take a while to sell and don't come around too often. The volume of commercial installs pales in comparing to residential. Commercial systems are maintained longer and are a major pain to work on or replace. Many require huge cranes/lifts to get the equipment to the roof, etc.\n\nThe makers of HEPA filters (such as 3M ) will benefit as installing and changing a HEPA filter frequently can help against the aerosol spread.\n\nFurthermore, instead of installing new systems, commercial entities will simply add: filtration, will increase fresh air intake, install UV emitters. The cost of such upgrades is a tiny fraction and doesn't require heavy equipment, big crew or new condensers, pumps, furnaces, etc. \n\n&#x200B;\n\nAll this to say that in my oppinion - these companies will NOT see a major jump because of COVID.", "score": 39, "replies": [{"body": "I agree with everything here except UV emitters. They will be sold and installed but they are snake oil. UV radiation does kill micro organisms but it needs a significant dwell time and the way Hvac systems work, air is passed over a UV for a second or two and is basically ineffective. If the air is under constant circulation ( unit is always running) you can increase dwell times and it’s efficacy but this will also increase your power bill.", "score": 4, "replies": [{"body": "You are correct that it does need prolonged exposure time to work and running air through a small section with UV light won't help much. No argument there. Right now even perception and/or reporting of improvement is important to businesses to show they are \"working on safety improvements\" and compliance.", "score": 5, "replies": []}, {"body": "I work in HVAC design and you're mostly correct, the UV systems I have looked at installing have required over 3 feet of run to adequately kill the micro organism so they do work but are a major PITA to design as I'm often working with very limited space. It also increases the static pressure of the air stream due to being located directly inside the ducts, and requires specialty duct materials to prevent the UV from degrading the metal so we opt for alternative solutions like ionization", "score": 3, "replies": [{"body": "Damn UV can damage metal ducts? How so? I thought it could only degrade plastics and paint.", "score": 2, "replies": [{"body": "I should rephrase, it's not the metal itself, but the materials holding it together and everything else nearby within the duct like the insulation and flexible ducts", "score": 2, "replies": []}]}]}, {"body": "bipolar ionization is the future", "score": 3, "replies": [{"body": "HELL YUH. I work for a company that sells it, we just got some test results back that it kills COVID in an airstream and on surfaces. Lab tests so take em with a grain of salt, but bi-polar ionization is WAY better than UV in every regard.", "score": 2, "replies": [{"body": "what company?  pm if needed", "score": 2, "replies": [{"body": "There are a couple of them on the market, but the one we rep is Global Plasma Solutions.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If there was a degenerate way to profit off this I would have informed yall already.", "score": 1, "replies": []}]}]}]}]}]}, {"body": " 80/20 rule states that 80% of sales come from the dumbest 20% of the population, so naturally 100% of advertising is pointed at them. Remember when everyone and their mother suddenly came down with Celiacs and companies started stamping \"gluten free\" on anything they could? Those UV emitters have meme power, it doesnt matter if they do anything, businesses will just put up signage that \"suggests\" they've installed it, and boomers will avoid the ones who dont.\n\nCalls on CMPR", "score": 2, "replies": []}]}, {"body": "Good stuff, ty for the thoughtful response.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "I appreciate the thoughtful response. I'm not an investigative blogger lol I'm just a random guy with a half baked idea.", "score": 4, "replies": [{"body": "HVAC has slim af margins as an FYI. When i worked at JCI before this, they were like 6% on the books, off the books closer to 3% once you accounted for going back to fix fuckups, OT for installers, etc.", "score": 5, "replies": []}]}]}, {"body": "CARR $28 EXP 12/18/20", "score": 5, "replies": []}, {"body": "I work in HVAC design at an engineering consulting company and most of our jobs in major cities like NY are on hold or going through VE to try and decrease cost which is not good for equipment manufactures. \n\nAs a counter there are some office spaces for companies that know they will be fine post pandemic who are taking advantage of the office being closed as a time to do renovations but this is def a minority. In addition we have expanded our warehouse operations for big box clients but they don’t give a fuck about there employees and try to keep cost as low as possible by code which is not great for equipment sales.\n\nFrom all the company wide emails that I’ve half read while paying more attention to this retarded sub the industry will attack air quality with UV and higher quality filters not new systems.", "score": 5, "replies": [{"body": "Others have said similar things, thanks for the feedback.", "score": 1, "replies": [{"body": "Also equipment wise Trane is infinitely better then Carrier", "score": 3, "replies": [{"body": "What do you mean?", "score": 1, "replies": [{"body": "They are a much better company and have higher quality equipment. Also trane has software that helps us engineers select the units and it’s pretty much used at every engineering firm. I might be wrong but I believe that trane also merged or have some kind of deal with Mitsubishi who also make great equipment.", "score": 3, "replies": []}]}]}]}]}, {"body": "JCI has some more room for recovery, but future growth potential seems limited. I don’t think you will see major jumps in price to bank on.", "score": 3, "replies": [{"body": "Why do you think future growth seems limited for JCI? I think all HVAC stocks have the potential to moon here on increased demand.", "score": 2, "replies": [{"body": "I think you’re placing too much emphasis on increased demand. A lot of businesses/commercial buildings won’t be opening back up", "score": 4, "replies": []}, {"body": "I worked for JCI up until the pandemic and I'm still not sure what the future holds for them nor my job. They did very well last year but ended up down sizing our region because of this pandemic. I honestly think carrier would probably be a better choice but I'm honestly not sure. I'm thinking it would take a long time for Johnson to build back up to the momentum they had before this shit happened.", "score": 3, "replies": []}]}]}, {"body": "Anecdotally- I know three different medical practices that are installing new air filtration systems", "score": 3, "replies": []}, {"body": "Yeah but no. I work in equipment sales for HVAC and I can tell sales are NOT hot right now. Projects are being put on hold, or cancelled all together. Building owners don't have money to go forward with these projects when they don't have any tenants and are super unsure of the future. \n\nIn terms of HVAC, building owners are asking what they can do to upgrade the filtration in their buildings to get their clients back in. UNFORTUNATELY that ain't easy. Upgrading filters usually require additional fan power, so thats normally out of the question since air handlers aren't designed with a whole lot of fan static leeway, and its expensive to swap out fans. That doesn't mean filter companies aren't busy, they busy as fuck replacing old filters but to my knowledge none of them you can degeneratly trade on the stock market. Sorry boys. \n\nThere is some other technologies that actually kill COVID and do wonders for air quality, UV and bipolar ionization, but you can't bet on those either since most of the companies are too small to be traded.", "score": 3, "replies": [{"body": "Solid response, ty", "score": 1, "replies": []}]}, {"body": "I have a buddy that is an HVAC tech. The solution to this, that is already being implemented, is retrofitting the duct work with strong UV lights. He’s already installing them regularly on residential units.", "score": 2, "replies": [{"body": "As others have pointed out, UV only works with dwell time. Duct velocities are usually anywhere between 8 feet per second to 25 feet per second. Installing UV lights you'll be lucky if the air is in contact with the lights for more than a tenth of a second. Its a scam unless you have 6ft of duct run.", "score": 2, "replies": []}, {"body": "Is that an expensive install or pretty cheap?", "score": 1, "replies": [{"body": "He told me the last one he installed was $699", "score": 2, "replies": []}]}]}, {"body": "i'm in", "score": 2, "replies": []}, {"body": "EMCOR Group, Inc. (EME)", "score": 2, "replies": [{"body": "They seem to do some HVAC work, what do you like about them?", "score": 1, "replies": [{"body": "I know the organization pretty well. Do zero residential work, but heavy in the commercial space which is your thesis. Independent subsidiaries in major markets that focus on HVAC construction & service.", "score": 1, "replies": [{"body": "Okay thx for the tip!", "score": 1, "replies": []}]}]}, {"body": "They seem to be a fair bit off highs.", "score": 1, "replies": []}]}, {"body": "I work for one of the largest HVAC contractors in the US.  We just had layoffs because the quarantine has majorly slowed down work and customer payments.  \n\nHVAC is construction, and construction is doing poorly.  In addition, buildings take years to build so construction profits generally lag behind downturns in the economy.  The worst is yet to come and this is a terrible time to buy HVAC stocks.  Other HVAC engineers/contractors in this thread have said this same thing, please trust them and don’t throw away your money.\n\nI’d also like to take this opportunity to suggest ya’ll read ASHRAE to learn more about the spread of Covid-19 in buildings.  At this point, there are no verified cases of covid-19 being spread through a central AC system, there is no evidence that anything better than merv-13 filters provides a significant reduction in covid-19 spread in non-healthcare buildings, and UV light in ductwork does not help because there isn’t enough resonance time in duct.", "score": 2, "replies": []}, {"body": "I see HVACs as more of a climate change play than a covid play🔥🔥🔥", "score": 2, "replies": []}, {"body": "One of the funniest things to me is how people think \"airborne\" viruses are literally just out here flying around whizzing through the air, getting sucked up into ventilation systems and spreading through buildings, or they imagine it travels 20 yards to attack the nearest person.\n\nI've seen people mowing their acre sized lawn on a riding mower while wearing a face mask like they think this is the fucking movie The Happening and a stiff breeze is just gonna blow by and give you the corona from some guy who has it a half mile away in town.", "score": 2, "replies": [{"body": "I mow my lawn with a facemask on because I have brutal seasonal allergies. Those n95 masks are great at keeping the pollen out of your mouth and nose.", "score": 3, "replies": [{"body": "Right which is cool but this is not the case for the people ive seen because ive seen these people mow their lawns for the past several years and these people dont even wear N95s they wear cloth masks and bandanas", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Thats funny because Harvard University says it's 3 hours. Even funnier that's only in the most perfect conditions for the particles so that they don't get caught on anything, dissipate or get blown away.\n\nAnyways what you've said is mostly irrelevant to what I've said. What it can do in perfect conditions is of lesser relation to what it does in the real world when there are thousands of surfaces for it to come into contact with.\n\nAgain, this shit does NOT just float around buildings going from room to room through the ventilation system. Maybe if a corona infected AC repairman spent half an hour coughing directly into a ventilation shaft there'd be an argument for it but no, just no.\n\nPeople have no idea how fucked we'd actually already be if this were true to any extent, every hospital would be ravenged by now, this is not plauge inc.", "score": 1, "replies": [{"body": "Hey look my shitty HVAC knowledge is finally relevant. First off, you have to know the fucking scale we are talking about when we discuss biological aerosols that transmit COVID. COVID is roughly 0.125 microns, its fucking tiny. Biological aerosols that carry COVID come from when  people cough. These bad boys are anywhere between 0.3 microns to 10 microns, and ANYTHING less than 3 microns can stay suspended in the air. Sure, air movement will disperse some of the particulate which will land on surfaces, but the fact that the average cough generates over 100,000 aersols if not more, you better bet anything in a region where someone coughs is not bueno to breathe. My point here is, biological aeresols are not something to be fucked with, and they absolutely are a transmission method for COVID.\n\nRegarding your hospital statement; 1. Hospitals have some BULLET proof fucking HVAC systems, HEPA filters laugh at just about 99.94% of every particle in the air and 2. They also have super high air change rates, meaning the air in the space is turned over a large amount of times each hour. This doesn't mean hospitals are bullet proof, but given the precautions they take they are pretty close.", "score": 2, "replies": []}]}, {"body": "100% this\n\nYou can easily catch the flu from suspended air\n\nIf a friend has the flu, hangs out in your living room for an hour\n\nThen you go in there an hour later after he has left for an hour you can still catch it", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Mugtown don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Don't sleep on Johnson Controls. Might be receiving some primo government contracts.", "score": 1, "replies": [{"body": "What makes you say they are in line for possible government contracts?", "score": 1, "replies": [{"body": "They are the go-to on many military and government installations already and I have to imagine that initiatives to retrofit existing systems and future designs will include more HEPA and MERV filtration. That combined with a lot of room to recover to pre-COVID levels.", "score": 2, "replies": []}]}]}, {"body": "i think most people are banking on there being a vaccine.\n\nthere isnt much upside in this idea because HVAC units will not need to be replaced to battle coronavirus. the modifications to disinfect the air is easy to install or they will just open up the returns to fresh air like the first pic says. which cost little to nothing", "score": 1, "replies": []}, {"body": "I feel like this is a longshot. Anyone who lives in the South already has an A/C unit because it's that stupid hot. Nobody is replacing their A/C units for their homes to beat covid, especially against the people they already live with.", "score": 1, "replies": [{"body": "Right I agree with residential not being a great play here. Commercial seems decent though given businesses are actually saying they are trying to improve their ventilation systems.", "score": 1, "replies": [{"body": "Residential has actually been ridiculous this year. \n\nI work in sales for one of the companies you listed and we are +20% YOY in the PNW region. All of us are sold out of 13 and 14 SEER ACs right now. \n\nCARR earning report comes out on the 30th. It will almost certainly be positive.", "score": 2, "replies": []}]}]}, {"body": "LMB - Limbach. Got new ops management, stock price is bouncing off all time lows. Beat earnings for last 2 quarters.", "score": 1, "replies": []}, {"body": "https://www.bloomberg.com/opinion/articles/2020-06-19/covid-19-is-it-safe-to-shop-inside-a-store-with-air-conditioning", "score": 1, "replies": []}, {"body": "Here's some DD for ya, coronavirus cases in the south are rising because they are just now getting into there first wave and everyone down there is pretending covid isn't real.", "score": 1, "replies": []}, {"body": "Lots of nonsense going around about retrofitting existing HVAC systems for COVID 19 mitigation. Building owners won't pay for the substantial cost involved in system modifications and the increased cost of bringing in a higher proportion of conditioned outdoor air. If fact, entire air distribution and chilled water systems may need to be replaced. It's not practical.", "score": 1, "replies": [{"body": "\"entire air distribution and chilled water systems may need to be replaced. It's not practical.\"\n\nWhat do you mean by this?", "score": 1, "replies": [{"body": "A higher % of fresh air means larger cooling coils, which means bigger air handling units, which means bigger central plant like pumps and chillers. For example, the central air handling unit for an office VAV system is generally designed for 20% outdoor air and 80% recirculation. If you start increasing the % fresh air, the cooling coil will not be able to maintain the required supply air temperature. You'll need larger chilled water coils, larger piping, control valves, larger pumps, larger chillers. That's just one example....I have many more. If companies think you can upgrade a commercial office HVAC system to a cleanroom, operating theatre or BSL4 lab type system by adding a few components and increasing % Fresh Air, they obviously know very little about HVAC design.", "score": 2, "replies": [{"body": "Ty you're clearly knowledgeable", "score": 1, "replies": []}]}]}]}, {"body": "I'm a bot, REEEEEEE\n\nI've found these tickers in this submission: [$CARR](https://np.reddit.com/message/compose/?to=WSBStockTickerBot&subject=Subscribe%20Me&message=$CARR) [$JCI](https://np.reddit.com/message/compose/?to=WSBStockTickerBot&subject=Subscribe%20Me&message=$JCI) [$LII](https://np.reddit.com/message/compose/?to=WSBStockTickerBot&subject=Subscribe%20Me&message=$LII)\n\nI can notify you when DD is posted about these tickers in the future.\nClick on the ticker above to subscribe or click [here](https://np.reddit.com/message/compose/?to=WSBStockTickerBot&subject=Subscribe%20Me&message=%24CARR%20%24JCI%20%24LII) to be subscribed to all tickers in this post\n\nComment below or send me a private message (not a chat!) like `$PBB $EMD` to subscribe to other tickers.\nRead how to use me [here](https://www.reddit.com/user/WSBStockTickerBot/comments/gt375p/how_to_use_me/)", "score": 1, "replies": []}]}
{"title": "MSFT 3/20 Memories", "selftext": "", "id": "hc1yj4", "created_utc": 1592577935.0, "score": 1077, "upvote_ratio": 0.98, "num_comments": 76, "comments": [{"body": "I don’t know about Microsoft but I’m still holding my 6/19 Ally calls", "score": 149, "replies": [{"body": "can’t go tits up", "score": 34, "replies": [{"body": "can sag tho", "score": 38, "replies": [{"body": "That's when you call the doc get some staples and fix those bad boys up so they look like your 20 year old man boobs again", "score": 2, "replies": []}]}]}, {"body": "LOL me to.. They will finally be erased today, sick of looking at them", "score": 6, "replies": []}, {"body": "3/20 $31 ALLY call reporting in!", "score": 8, "replies": []}, {"body": "I'm holding ALLY calls as well. 7/17 $28. I turned 200 dollars into 1000 with them. Then I was able to turn 1000 into $74 in one play lol I have over 70 contracts. I got time though luckily.", "score": 2, "replies": []}]}, {"body": "It's a well known conspiracy fact that Bill Gates has been selling MSFT 200c for a year now. Whenever it gets close he just dumps shares and drills the price. Just give up, it's not going to happen", "score": 133, "replies": [{"body": "I’m starting to believe this", "score": 37, "replies": []}, {"body": "whaat ive never heard of this conspiracy. Is there any evidence lol", "score": 13, "replies": [{"body": "Some autist posted it a couple days ago. Basically makes it a fact to me", "score": 101, "replies": []}, {"body": "That’s why it’s called a conspiracy", "score": 17, "replies": [{"body": "I'm convinced TA is just numeric conspiracy theories", "score": 8, "replies": []}]}, {"body": "It's a joke you moron 😂", "score": 4, "replies": []}]}, {"body": "Bill Gates doesn't even own that much MSFT lol", "score": 1, "replies": []}]}, {"body": "Hit a high of 199.29 and went back down. This is hilarious", "score": 61, "replies": [{"body": "199.84 high just before the open", "score": 27, "replies": [{"body": "The resistance at 200 is just comical at this point.", "score": 25, "replies": [{"body": "200$ is too much 199.84$ is just right, simple marketing.", "score": 27, "replies": [{"body": "PrIcE dIsCoVeRy", "score": 7, "replies": []}]}, {"body": "i almost want to dump my entire life savings selling naked $200Cs", "score": 1, "replies": [{"body": "The entire $40???", "score": 16, "replies": []}]}]}]}]}, {"body": "They uhh say call spreads are free money\n\nThey might be right", "score": 26, "replies": []}, {"body": "I saw it break 199 this morning and sold my 200 calls. I've seen that show before", "score": 26, "replies": [{"body": "This is all your fault! We’re cursed!", "score": 2, "replies": []}]}, {"body": "7/17 $220 calls right now :)", "score": 51, "replies": [{"body": "Oof", "score": 27, "replies": [{"body": "Big oof.", "score": 5, "replies": []}]}, {"body": "That’s some platinum carbon fiber balls and  a massive valuation gap up that quick in a pandemic  but kudos to you", "score": 7, "replies": [{"body": "MSFT goes up in pandemic", "score": -2, "replies": []}]}, {"body": "Can I hire you to be a clown at my son's birthday party? you seem pretty qualified.", "score": 14, "replies": [{"body": "I’m already going as your wife’s boyfriend sorry", "score": 5, "replies": []}]}, {"body": "18/22 $160 fly me to the moon baby", "score": 1, "replies": []}]}, {"body": "ONCE AGAIN FUCKING 199 IS THE GODDAMN TOP", "score": 37, "replies": []}, {"body": "I hope this is not similar to the Curse of the Billy Goat lol\n\nImagine how call buyers might have felt for buying $40 calls from 2000 - 2010. A lost decade for MSFT and a boon for Theta gang.", "score": 17, "replies": [{"body": "Shit is cursed. Top is in. Rona weekend rise will force daddy powell to print bigly over the weekend. If we open below SPY 300 we're in for a ride. \n\nSo buy the dip at the open pussy!", "score": 7, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Call and put options have been around since the 1800s, they’ve been actively traded on exchanges since the 1970s. The fuck you talking about?", "score": 1, "replies": []}]}]}, {"body": "I'm convinced at this point MSFT isn't allowed to pass $199.99.\n\nWhich is insane for how big of a company they are compared to some of the garbage over $200.\n\nEdit: Yes, I'm retarded. TIL market cap.", "score": 77, "replies": [{"body": "I respect your deep knowledge of the stock market and your confidence in trading with it", "score": 75, "replies": [{"body": "Thank you, I fit in well with the other retards here.", "score": 20, "replies": []}]}, {"body": "You can’t just look at stock price by itself. For example, msfts market cap is $1.5T with a stock price of ~$198 whereas zooms market cap is only $68B with a stock price of ~$240.  Zoom pales in comparison to the absolute size of Microsoft but it has a higher stock price.", "score": 69, "replies": [{"body": "For sure, just wanted to make a retarded comment as is tradition.", "score": 78, "replies": []}, {"body": "Uh, stonk go up is good. Stonk not go up, no make money. duh.", "score": 5, "replies": []}, {"body": "Why is Google $1,440 with a $980B market cap?\n\nHas MSFT just split a bunch of times?\n\nEdit.  MSFT has split 9 times.. 7 times in the 90's alone wtf.  Last time was 2003", "score": 4, "replies": [{"body": "Yeah man, many many splits. Interestingly enough, splits may be a thing of the past. Time was, really expensive stock had to split so more people could afford to trade it. You’d rarely see an amazon, google, or Tesla with these prices. But with the rise of ETFs, drips, and fractional trading...along with the fact that options trading is so popular, there’s much less of a need to split.", "score": 9, "replies": []}]}, {"body": "Woah man don't teach these people. They need to learn the hard way.", "score": 2, "replies": []}, {"body": "What's the purpose of issuing more shares in msfts case?", "score": 1, "replies": []}]}, {"body": "> Which is insane for how big of a company they are compared to some of the garbage over $200.\n\nPeak retardation. Imagine trading and not understand what market capitalisation is.", "score": 20, "replies": [{"body": "I seriously don't know what is wrong with people.They smoke too heavy shit.", "score": 2, "replies": []}, {"body": "He deleted that sentence lmao", "score": 2, "replies": []}, {"body": "Imagine trading with half the stupid shit people do, say and think on this sub. It’s glorious to watch.", "score": 2, "replies": []}]}, {"body": "Comments like this get screenshoted from boomer media when describing the state of retail investors. Stock price =/ market cap, because share volume.", "score": 9, "replies": []}, {"body": "Yeah, cause stock price alone totally indicates how much a company is worth.", "score": 13, "replies": []}, {"body": "Zoom would like to chat with you", "score": 11, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "they're great aren't they?", "score": 9, "replies": [{"body": "They're outstanding!", "score": 8, "replies": []}]}]}, {"body": "Aaand MSFT is falling... great hahaha", "score": 3, "replies": []}]}, {"body": "I wasn't wrong... I was just late...", "score": 4, "replies": []}, {"body": "I still wake up screaming at night thinking about this", "score": 3, "replies": []}, {"body": "I was looking at what options people in congress bought, and Pelosi bought 200 MSFT 2021 calls on February 20th (4 days before the giant crash). Didn't know she was one of us", "score": 3, "replies": []}, {"body": "God...those were the days...", "score": 2, "replies": []}, {"body": "feels like yesterday.....", "score": 2, "replies": []}, {"body": "Okay, now CNBC is [clearly just trolling you](https://www.youtube.com/watch?v=bTfiYKj1apM).", "score": 2, "replies": []}, {"body": "Aaaaand you jinxed it", "score": 2, "replies": []}, {"body": "Fuck me.", "score": 1, "replies": []}, {"body": "i sold some itm 7/17 190/200 call spreads lol", "score": 1, "replies": []}, {"body": "more lik 2/20..\n\nlost like 300g cause msft is sus", "score": 1, "replies": []}, {"body": "This was my first major burn,never forget.", "score": 1, "replies": []}, {"body": "I held a 190 to be safe and those still became trash", "score": 1, "replies": []}, {"body": "“Back in my day...”", "score": 1, "replies": []}, {"body": "Wait it's not suppose to hit $200? Mine expires next week!", "score": 1, "replies": []}, {"body": "Oh my god rip.", "score": 1, "replies": []}, {"body": "still holding my msft 7/17 230c. Down 84% lmfao. Bought on feb 10th (literally the fucking peak before covid)", "score": 1, "replies": []}, {"body": "lol I have MSFT Calls, I was going to sell and was waiting for $200... I slowly started watching my money fall", "score": 0, "replies": []}]}
{"title": "Apple reclosing stores in Arizona / florida", "selftext": "To anyone wondering why SPY is plunging:  [https://www.cnbc.com/2020/06/18/stock-market-futures-open-to-close-news.html](https://www.cnbc.com/2020/06/18/stock-market-futures-open-to-close-news.html)\n\nThoughts on next week / monday?\n\n&#x200B;\n\nEdit: Fuck me im stupid i gave you a retarded link, heres the real one:  [https://www.cnbc.com/2020/06/19/apple-will-close-some-stores-again-as-covid-19-cases-reappear.html](https://www.cnbc.com/2020/06/19/apple-will-close-some-stores-again-as-covid-19-cases-reappear.html) ", "id": "hc3sr2", "created_utc": 1592584128.0, "score": 207, "upvote_ratio": 0.97, "num_comments": 76, "comments": [{"body": "[deleted]", "score": 82, "replies": [{"body": "My company is largely basing its decision to continue stay at home due to the risk of lawsuits by employees.", "score": 27, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "So if you get sick and can’t work?", "score": 3, "replies": [{"body": "This is America. Conservatives believe you should die at home and be happy that you didn’t cost your employer money.", "score": 3, "replies": []}]}]}]}, {"body": "Do you have a link stating this? Not doubting you but just curious to read more about it.", "score": 8, "replies": [{"body": " [https://www.enr.com/articles/49345-california-opens-door-wider-to-covid-19-workers-compensation-claims](https://www.enr.com/articles/49345-california-opens-door-wider-to-covid-19-workers-compensation-claims) \n\nThis has more details on CA adding fuel to the fire and making it easier.", "score": 5, "replies": []}, {"body": "have you never held a job before in your adult life? Workers comp is huge liability for many businesses\n\nhe isn't stating anything that anyone who has had a job where they could get hurt doesn't know", "score": -7, "replies": [{"body": "Sure but I'd love to be able to send this to my boss, because his managers are trying to get us to all go back to the office already instead of WFH.", "score": 5, "replies": [{"body": "just ask him \"hey, if I get COVID at work, is that covered by workers comp?\"", "score": 6, "replies": []}, {"body": "what state? it's worse in some states than others. Exec order in CA makes it EXPLICITLY prove you didn't, which is impossible.\n\n[https://www.enr.com/articles/49345-california-opens-door-wider-to-covid-19-workers-compensation-claims](https://www.enr.com/articles/49345-california-opens-door-wider-to-covid-19-workers-compensation-claims)\n\nat the federal law it's a maybe but the maybe often becomes yes because it's still litigabable, and can easily be a big problem:\n\n[https://www.ncci.com/Articles/Pages/Insights-Coronavirus-FAQs.aspx](https://www.ncci.com/Articles/Pages/Insights-Coronavirus-FAQs.aspx)\n\n&#x200B;\n\nIn washington, it's easy to imagine how you could make this claim if you come into contact with the public and claim to be quarantined at home:\n\n [https://lni.wa.gov/agency/outreach/workers-compensation-coverage-and-coronavirus-covid-19-common-questions](https://lni.wa.gov/agency/outreach/workers-compensation-coverage-and-coronavirus-covid-19-common-questions)", "score": 2, "replies": [{"body": "The CA EO is going to be litigated, as will most of the EOs that extend beyond healthcare workers. \n\nThere are already statutes that address causation and burden of proof, and an EO does not supersede those. \n\nThere is 0 federal law that deals with WC.", "score": 2, "replies": [{"body": "I need to get more specific details from the lawyer in question, which I'll do, and update back.", "score": 0, "replies": []}]}]}]}, {"body": "I picked up my toys like a big boy. Does that count?", "score": 10, "replies": []}, {"body": "But work comp claims are accidents at work. You can't just break your ankle and file a claim, and the company has to prove it didn't happen at work.", "score": 6, "replies": []}, {"body": "Its unusual though because most workplace injuries are very obvious in cause and origin. Broke your leg on the job? That's pretty clear. Back pain? Somewhere in between. COVID? Who knows.", "score": 2, "replies": [{"body": "No, they’re not. From a cost perspective most WC claims are soft tissue injuries suffered by middle-aged+ adults who are in poor physical condition and have early stage degenerative joint disease and other issues and that are questionably related to work. \n\nActual industrial injuries with clear causation are the exception, not the rule.", "score": 5, "replies": []}, {"body": "for sure... but it is what it is..", "score": 1, "replies": []}]}]}, {"body": "I spoke with my attorney about it in assessing some retail and office real estate investments, and he gave me the download from what his colleagues were saying about it. I don't have a link, sorry.", "score": -2, "replies": [{"body": "There’s no liability at the federal level. WC is a state level system and every state is different. \n\nUncapped multi-million dollar per employee liability?  You realize most companies insure that exposure, and multi-million dollar claims are exceedingly rare due to the structure of benefits available under WC laws. \n\nYou realize that there are no juries for WC claims?  Of course you don’t. If I was you I’d get an attorney who had some fucking idea what they’re talking about, and then I’d get a clue.", "score": 5, "replies": [{"body": "I'll ask them more specifically. I just got the general briefing on prognosis for office and retail re-opening from a CA based firm that does real estate mostly. Their view was - real bad because of the law around workers comp in particular, and said it had a federal issue so should apply elsewhere. I'll get more detail on what they meant exactly and post back.\n\nI may not have understood precisely what was being said, or the attorney telling me got it second hand and didn't understand. I'll get specific statutes or regs this time.", "score": 1, "replies": [{"body": "I wouldn’t go to a personal injury attorney to do due diligence on an M&A, and I wouldn’t go to a real estate attorney for info on WC. \n\nI work in risk management consulting - I’ve been living this shit since February.", "score": 2, "replies": [{"body": "It's a tier 1 firm, they should have experts who know what they are doing, but there may have been a chain of communication that broke down, and my conversation was quite brief. What do you think the risk is with your research and being in the field?", "score": 2, "replies": [{"body": "It depends, but for a small business it’s pretty much 0.", "score": 1, "replies": [{"body": "So why was Coronavirus liability for businesses such a hold up in Congress then? It nearly sunk the stimulus bill.", "score": 1, "replies": [{"body": "Third Party Liability is a thing.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "It's because I bought calls. You're welcome put holders.", "score": 41, "replies": [{"body": "Thanks for taking one for the team", "score": 5, "replies": []}]}, {"body": "My puts just nut", "score": 21, "replies": []}, {"body": "Just creamed my panties", "score": 32, "replies": []}, {"body": "Cruise lines voluntarily suspend all trips out of U.S. ports until Sept. 15, trade group says\n\nhttps://twitter.com/CNBC/status/1274036083534241793", "score": 10, "replies": [{"body": "RIP the cruise industry, a second wave is predicted to start mid-octuber and last til march, those big boats are not going anywhere.", "score": 9, "replies": [{"body": "There’s no 2nd wave, first wave never ended. Record cases a lot of places *today* forget about October.", "score": 6, "replies": []}]}, {"body": "We all know the September 15th date is bullshit. Why do they even bother. There are certainly morons willing to cruise right now, but the cruise lines can't afford the liability of tens of deaths per cruise.", "score": 5, "replies": []}]}, {"body": "DIS Puts people. Imagine if sports players get infected and they cancel NBA/NFL plans (no ESPN $$). And of course, if it is that bad then theres no way they reopen parks on time. Big opportunity here.", "score": 8, "replies": [{"body": "Yup, thinking about this a lot.... I live in Anaheim (actually Orange but no one really knows where that is) and no one gives a shit about COVID for the most part.  OC generally is blase or worse, anti COVID reduction measures.\n\nDisneyland is going to have a serious decision to make in the next week - I don't think that their re-opening schedule is realistic they should be reconsidering; or worse there will be an infection, staff or guest.\n\nPuts for late July or August - the risk is the re-opening occurring will be a nice pump but the drop will hit with either of the aforementioned scenarios.", "score": 2, "replies": []}, {"body": "NBA has solid, Fauci approved plans to keep the virus out of there and even if it does slip in, keep the league from shutting down if a player comes down with it", "score": 1, "replies": []}]}, {"body": "Puts", "score": 7, "replies": []}, {"body": "Call before the storm.  Get ready for a huge fight between a bunch of stores doing this/ being forced to do this.  As well lawsuits for forcing people back to work (meat packing?). This is about to become a dumpster fire.  October put spread 305p, 295p, 285p, 275p.  \n\n275 is unlikely to go ITM but will gain significant value as we detoriate percentage wise.", "score": 11, "replies": [{"body": "*This has been a dumpster fire.", "score": 3, "replies": []}, {"body": "Remindme! 4 months", "score": 2, "replies": [{"body": "I will be messaging you in 4 months on [**2020-10-19 23:26:20 UTC**](http://www.wolframalpha.com/input/?i=2020-10-19%2023:26:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/hc3sr2/apple_reclosing_stores_in_arizona_florida/fve08r1/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhc3sr2%2Fapple_reclosing_stores_in_arizona_florida%2Ffve08r1%2F%5D%0A%0ARemindMe%21%202020-10-19%2023%3A26%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20hc3sr2)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "This is a bad headline. A very bad headline.", "score": 5, "replies": []}, {"body": "Got that APPL 325p 7/10 Wednesday and couldn’t be more erect", "score": 5, "replies": []}, {"body": "B-b-b-b-b-ut nobody cares about covid!!\n\nRetard bulls. You can't impose your beliefs on reality and the markets.\n\nJust like the dumb bears who think we will hit spy 150, don't try to force it just because that's what you believe.\n\nThis thing is most likely going to keep going down and any bulls better be ready to bail since this won't be skyrocketing anytime soon most likely.", "score": 28, "replies": [{"body": "If the weekend is bad with cases, and more companies will close, next week will be a massacre. Otherwise i see this going sideways next week tbh.", "score": 20, "replies": [{"body": "Tulsa rally oughta speed things up a bit, you know people from all around the cuntry are flying in for that, then they'll go home and spread it further. But yeah, next week will likely be another wash.", "score": 14, "replies": [{"body": "Tulsa rally impact going to be felt in 1-2 weeks, but yes at the latest then it should speed things up.", "score": 7, "replies": [{"body": "It's absolutely going to lead to unnecessary infections and deaths but I think it's unlikely to significantly impact the numbers nationally, in the context of how the US is dealing with this in general. There were 33,539 new infections yesterday. 20,000 people gathering at a rally just isn't that much in a country of 320 million.\n\nI don't think it should be happening. Individual events cumulatively make up the whole. But the bigger impact on the numbers is how hundreds of millions of people are going about their daily lives, and what precautions they are (or aren't) taking, not a single event.", "score": 1, "replies": [{"body": "While I agree 20k people isn't that significant compare with the whole country, I think with exponential growth the numbers can become staggering quite fast.", "score": 1, "replies": []}]}]}, {"body": "And I’m\nGuessing the protest had nothing to do with it either?", "score": -5, "replies": [{"body": "Difference is the rally is 20k people in an enclosed area, literally 99% of them will not wear a mask, causing further spread.\n\nProtests will absolutely have something to do with it, but the inverse has been true. 99% of people at protests are wearing masks.", "score": 14, "replies": []}, {"body": "Outdoors with almost 100% mask compliance is going to be exponentially lower risk of transmission than indoors with no masks. Also most of the cities with major protests are not in the states with huge spikes right now.", "score": 5, "replies": []}, {"body": "\"but what about the other side\" \n\nYea we get it. Get your politics out please. Both political ends are retarded in their own ways.", "score": 12, "replies": []}]}]}, {"body": "Cases keep hitting record highs in many states and more will likely follow.  In a month we could be completely overwhelmed since there's no plan to slow it down.", "score": 3, "replies": []}]}, {"body": "The amount of posts you have in just the last week of arguing and baiting on Reddit is pretty sad.", "score": 4, "replies": []}]}, {"body": "Monday morning ( if futures red) - Fed has some new announcement regarding its bond buying. Or there’s some vaccine news.", "score": 3, "replies": [{"body": "If companies start doing the closures without any public govt input, fed coming in starts to matter less over time.  People start to trust AAPL etc instead of politicized asshats.  If aapl willing to give up profits, that speaks way louder than a governor worried about his election and hesitating making a public declaration.\n\nThe thing that made me get short for the initial dump was the billions the major sports leagues dumped as soon as one NBA player tested positive.\n\nEvery major sports owner has his Senator, governor on speed dial and likely knew more than publicly available.", "score": 3, "replies": [{"body": "Back in March the info was widely available, it’s just that folks didn’t believe it yet", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I disagree; I have never purchased an Apple product online. There’s something very satisfying about walking out of the store with a 70% charged new phone. Plus it’s a local hub for tech support.", "score": 5, "replies": [{"body": "B&H for any Mac bro. No tax if you get their credit card & you can get last years shit like 40% off.", "score": 1, "replies": []}]}, {"body": "Its not about that really. Stores are a prestige thing. And its no teven about that either, really. It's about another shutdown / economy fuck getting more likely with news like this. It's spreading fear. If they do it, what about the others? Reopening not coming? Thats what the market is asking itself when news like that come out.", "score": 2, "replies": []}, {"body": "Nah it’s where all the boomers get taught how the mouse goes click clack", "score": 1, "replies": []}, {"body": "The idea of spending $1000 on something I haven’t even held in my hand or seen in person is kind of ridiculous.", "score": 0, "replies": []}]}, {"body": "Lol at bears getting so excited over a 0.5% drop in spy.\n\nJust buy your puts, go broke, and go find a new hobby.", "score": 4, "replies": []}, {"body": "Brrrrrrrrrrrrrr Jpow gonna print more next week", "score": 2, "replies": [{"body": "Actually, money supply has been dwindling since April. It's been retail investors buying up the dip, but not sure if they're willing to hold given SPY at near ATH and QQQ at new ATH already.\n\nhttps://fred.stlouisfed.org/series/RPONTSYD", "score": 2, "replies": [{"body": "Are you sure about money supply? See below what I found today:\nhttps://www.cnbc.com/2020/06/21/banks-have-grown-by-2-trillion-in-deposits-since-coronavirus-first-hit.html\n\nOne guess is most of these retail investors are employed, has salary + stimulus checks...... When wide spread layoffs happen in office/desk jobs, that's when shit hits the fan in stocks imo.... When those layoffs happen? Probably when orders dwindle and growth is slowed down..... When orders will dwindle? When consumers stop spending..... More printing... More spending. Of course all this is fake pumping, at least until election this might happen.....", "score": 1, "replies": []}]}]}, {"body": "I’m incredibly lucky I sold my AAPL calls at open", "score": 2, "replies": [{"body": "Same", "score": 1, "replies": [{"body": "I was getting downvoted for this last I checked lol, this sub is so dumb. But gg though.", "score": 1, "replies": []}]}]}, {"body": "Heavily considering buying some otm vxx calls...", "score": 1, "replies": []}, {"body": "Play here is xrt straddles", "score": 1, "replies": []}, {"body": "We're in Florida ... Stores are closed in my county\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/fqwozt/florida_dd_no_one_cares_about_beer_virus/flt3640/)*", "score": 1, "replies": []}, {"body": "SPY down 2 points and it’s plunging", "score": 1, "replies": [{"body": "Time correlation. It dropped 1% in minutes, that is plunging to me.", "score": 1, "replies": [{"body": "I want to see a 10% drop in minutes.", "score": 1, "replies": []}]}]}]}
{"title": "I'm out, autists; don't fight the future if you suck at this", "selftext": "I haven't pretended like I know anything about options; I'm just a political, tech and economic junkie whose good at theoretical thinking. It's been pretty easy to see what was coming after the dip and it's been a lot of fun buying and selling stock to sell for 30-50% profit in the fed and PPT inflated market.\n\nI'm out though, because I have no idea what is going on anymore with anything except tech. I don't plan on getting caught in the eventual crash back down to reality given that corporate debt is 50% of the GDP, commercial real estate is toxic as fuck, 1/3 of Americans missed their home payments and the world going crazy.\n\nBecause here is the thing. If you aren't a tech junkie and haven't been following what's going on, then allow me to clue you in. The prophesied digital revolution has been kicked into high gear.\n\nAll the social media companies and all the big tech companies have bent over backwards to help promote the necessity of the COVID lockdown and spread \"accurate information\". If you think they did this out of their love for humanity, then you are naive. They understood that if you locked everyone in their houses for three months, they would all be forced to use the digital marketplace and turn to digital services for entertainment. And if you can force people to change out of necessity and the changes add substantial benefits to their lives, then they won't ever fully go back to the way it was before.\n\nDon't believe me? Look to your friends and co-workers and ask them how they have been spending their time these last three months. My personal trainer friend started a new digital fitness business and has been doing well. My kickboxing coach started filming his classes and uploading them online as an additional feature of his business. My ESL teacher friend started uploading her lessons on YouTube to make extra cash. My boss at the bank I contract to has stated that he used to be against working from home, but would be going to a mixed model going forward, because of how much it has benefited him.\n\nNone of these people would have done any of this before the COVID lockdown, because they were comfortable in their existing models. \n\nJust look at me. I got let go as a contractor in the panic and I used this as an opportunity to switch to a remote only model as a software engineer. I setup an office, upgraded my digital identity, assembled a good portfolio on github and have started looking solely for remote only or mixed work opportunities. I get to control my time more and make my high productivity work for me, I get two hours back a day from time in traffic to train at kickboxing, I get more time in the evenings to go dates and spend time with my bros and I cook myself fresh food in my kitchen for lunch everyday. When I get remote only thing going and I pay off my mortgage, I plan on jumping from short term rental to short term rental in Europe while working off my laptop.\n\nA brave new world has started and it's going to be a world of getting custom tailored clothes delivered to your doorstep, picking up groceries ordered off apps, buying everything online and future companies of tech and knowledge workers offering a communal workspace for meetings and a work from home tech stack.\n\nI have rebalanced my portfolio around the AMZN, MSFT, AAPL, XSW, CLOU, WCLD and ARKW. This is all big tech, cloud computing, next generation internet and digital services. I've taken my losses on all my stupid speculative shit and put it into AMZN. Bezos is going to take advantage of this massive displacement of cash from all the companies without a digital footprint and use it to grow his company to new heights. It's P/E is insane and I'll remake all my losses in it by the end of the year. The grow I see off all of this will be anything better than I can do thinking I am some character out of the big short.\n\n**TLDR: If you don't know what you are doing with any of this shit, don't keep being dumb with your life savings. There is an amazing investment opportunity going on with the digital revolution.**", "id": "hc9zjn", "created_utc": 1592604674.0, "score": 47, "upvote_ratio": 0.73, "num_comments": 75, "comments": [{"body": "Did you mean to post about how you finally got an Adderall script on the ADHD sub?", "score": 112, "replies": [{"body": "LOL", "score": 13, "replies": [{"body": "I love that sub, there’s even one for women", "score": 2, "replies": []}]}]}, {"body": "This is a great post for r/investing", "score": 43, "replies": [{"body": "This is a great post for r/retarded", "score": 32, "replies": [{"body": "Every post here is great for r/retarded its wsb", "score": 16, "replies": []}, {"body": "r/subsifellfor", "score": 3, "replies": []}, {"body": "This is a great post for r/allthechromosomes", "score": 2, "replies": []}]}]}, {"body": "nobody knows what they’re doing\n\nthat’s the best part\n\n*weeeeeeeeeeeeeeeeee* 🎢💨", "score": 35, "replies": [{"body": "I second this.  I lost my muthafuckin ass in the beginning learning how to trade options.  Just invest for the long haul and throw spare dolla dolla bills into options. Stonks only go uppy.", "score": 6, "replies": []}]}, {"body": "**TLDR; I’M GONNA BE TAKING EXTRA SHIFTS AT WENDYS**", "score": 24, "replies": [{"body": "I used to work at Wendies, thank you. They really do grill their burgers. I didn't build myself up to this large of an income by being stupid.", "score": 6, "replies": [{"body": "It's all fun and games until you have to pay for healthcare yourself.  It's goes up 10-15% every year.  God help you if you have a family.\nYou will be back gambling to pay for it", "score": 4, "replies": [{"body": "It’s all fun and games until Wendy’s changed their spicy chicken tendies recipe.", "score": 7, "replies": []}]}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 11, "replies": []}, {"body": "Alexa, scan post for a Ticker, date, and strike.", "score": 7, "replies": [{"body": "*I’m sorry, this post is too retarded to quantify. Have you tried nailing your dick to the floor?*", "score": 8, "replies": [{"body": "Alexa, stop. Alexa, what is the point of this post?", "score": 7, "replies": [{"body": "*The point of this post doesn't exist, but some conspiracy theories claim it does. Some people believe this post is about an adderall addicted ADHD infused autist throwing out weird humblebrags that are essentially meaningless in order to scream into the void of the internet. Some people claim that this autist is a 'big dick energy' extrovert in his normal life, and covid is slowly chipping away at his sanity. Other theories claim that OP is just lost and believes he is in r/investing.*", "score": 5, "replies": []}]}]}]}, {"body": "Ban", "score": 8, "replies": []}, {"body": "I'm a simple man\n\nI don't see a ticker, I don't see a strike price, I don't see a exp date... I down-vote\n\nI'm a simple man", "score": 39, "replies": [{"body": "Had to downvote you bro, No ticker, no strike price, no exp date, no upvote, you are truly the simplest of mans\n\n$GM15P Exp1/15/21", "score": 22, "replies": []}]}, {"body": "you might lose your shit by end of june ... i have taken a short position in AMZN, AAPL, MSFT, INTC\n\nlet's see where we are in 14 days", "score": 7, "replies": [{"body": "I don't care anymore about where I am in 14 days. I have just been fucking around in a market that's been rigged to go up. I care about where I am in 5-10 years.", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "See, people keep saying that, but I keep seeing all this cashflow making it's way to the digital service companies and P/Es on those companies are all above 15. So what is exactly there to correct when the bubble bursts and this big correction happens? I wish someone would explain that one to be instead of just repeating it's a bubble.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Appreciate the opinion.", "score": 1, "replies": [{"body": "I read some article where they were making the case that as the tech companies get bigger and bigger their growth rates approach the growth rate of the economy as a whole. You would think that we are nowhere close to that point yet, but they were making the case that some of them are, I think they mentioned netflix and facebook, which you did not. So like I could see Amazon grow faster than the economy, because they do so much, but not sure about Microsoft. If you are looking 50 years out, definitely diversify, you never know when some new company or trend will shake up the bigger players.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "That's how I read this after a little DD on AMZN", "score": 1, "replies": [{"body": "I think AMZN is a fan-fucking-tastic company that will make me a lot of money .. I just don't think it should be above $2300 right now", "score": 4, "replies": [{"body": "Yeah it reminds me of yahoo, AOL, lycos, Fb... Unlimited upside until they do something to put off their users.", "score": 1, "replies": [{"body": "as a put off user... mainly stayed with them for cheap streaming and delivery...\n\nwith so many getting into streaming I'm exploring my other options... \n\nas to delivery... my guaranteed 2 day took 2 weeks", "score": 0, "replies": [{"body": "Yeah I'm thinking that as soon as free shipping is yanked, amzn will have a lot of people say cya.", "score": 1, "replies": []}]}]}]}]}, {"body": "How's that short working out for you?", "score": 1, "replies": [{"body": "INTC was up, I sold out 60% of my position, now I am BE\n\nAapl I sold out 50% of my position, will hold on the rest\n\nAMZN killed me today ... \n\nMSFT I was up 50%, sold off, and kept the rest\n\nMost of these are oct expirations, so I'm not worried", "score": 1, "replies": []}]}]}, {"body": "I'm balancing a significant part of my portfolio in favour of tech and consumer spending stonks like credit cards and square as well as papa Bezos. Tech is the future. Tech creates tech. Tech progresses exponentially. My stonks rise exponentially. Literally can not go titties to the sky", "score": 6, "replies": [{"body": "Finally, a true believer among the plebs. Thank you, my brother!", "score": 2, "replies": []}]}, {"body": "Theoretical thinker huh , well heres a brain teaser go fuck yourself.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "No one likes going to the grocery store anymore since they have forced us all to work as cashiers in self-checkout lanes. No one is stopping anymore to make small talk with strangers since they are on their smart phones. \n\nWorking will always be a mixed environment of working from home and at the office. It's just that we are making more of a shift in the balance toward remote work than office work.", "score": 3, "replies": [{"body": "I love self checkout, I use the kiosk at McDonald's, Taco Bell, Home Depot just so I don't have to exchange gestures with someone being a robot with zero personality anyways 99% of the time. \n\n\nThey can learn to frame houses, sell stonks, learn something new, do IT and be happy without the corporate overlords.\n\n\nI always use them. I'd rather not put up the waiting in line to say how are you when they just want to GTFO anyways.", "score": 5, "replies": []}]}]}, {"body": "So what you’re saying is AMZN puts? Fuck it I’m all in", "score": 5, "replies": []}, {"body": "TLDR What is this - ticker and strike or fucking ban bitch 🚬", "score": 4, "replies": []}, {"body": "This looks like the ramblings of a doomsday prepper talking about how the illuminati tech companies are trying to manipulate your lives. We get it, you're trying to save us sheeple, thanks bro.\n\nNobody fucking cares about your conspiracy. Long term stocks will probably go down later this year. Then they will probably go back up. If you want to believe information and stats are a conspiracy then that's fine. If you think somehow tech companies are going to be ultra powerful if their price goes up 200%, you are retarded and don't know how equities work or what the price means from a normal investor/non gambler's perspective.", "score": 10, "replies": [{"body": "It's not a conspiracy theory. It's just people acting on their self interest. Everyone who defied the lockdown were companies getting swallowed up by their digital competitors like Game Stop. Everyone who was eager to help had a major stake in the digital market already.", "score": 2, "replies": []}, {"body": "Amen", "score": 1, "replies": []}]}, {"body": "A “brave new world” is most definitely coming read that book autists if you want to see what we’re in store for.", "score": 3, "replies": [{"body": "I welcome our dystopian tech overlords. They keep making the quality of life better with every shift we make into the digital world.", "score": 5, "replies": []}]}, {"body": "This has to be a hall of fame post if I’ve seen one.  \n\nI shit myself laughing while taking a bath reading this.", "score": 3, "replies": []}, {"body": "I looked at my friends, they are all literally doing the same shit they were doing before this all happened. Im literally going into work the same way I have before and after all of this.  I've yet to even take my laptop home since January because well, I don't need to and I'm fucking unproductive at home anyway. \n\nI do get my temp checked when I go into my building, that changed. Oh and my project time line got pushed to Nov when I was already basically done so im just relaxing. Had to jump on and help another project covid related so that was different but that took like 2 weeks.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Visa ftw", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Aw fuck.\n\nWell shit maybe ppl just aren't paying off their balances or something", "score": 2, "replies": []}]}]}]}, {"body": "My best macro analyst is forecasting a recession. Sure we'll have a V-shaped recovery but when all is said and done we land in a recession. This COVID was just the single bowling pin that knocks over the rest. FOMOing into tech is far from the worst play here but I would prefer cash", "score": 2, "replies": [{"body": "We can both be right. Not everything is universally affected in a recession. I just think the recession is going to happen to everyone who doesn't have a major stake in the digital market. For what it's worth, I have a maxed out Roth IRA that follows a traditional investing plan and I am holding all my extra cash from this point forward to put in after the election in November.", "score": 2, "replies": []}, {"body": "Sell lots of OTM puts. When it crashes, roll them down and out for a smaller loss and post crash assignment tell me why this is retarded", "score": 1, "replies": []}]}, {"body": "What apps you use for dates bro..", "score": 2, "replies": []}, {"body": "Sir this is an excerpt from the movie Wall-E. I believe AMZN is Buy-N-Large", "score": 2, "replies": []}, {"body": "did you know that the stock market used to be a method of gatekeeping for rich people to fix prices and poor people would literally bet on which direction the market would go. this shit has been made up since the beginning. stop pretending its anything but a gigantic gambling hall", "score": 2, "replies": []}, {"body": "Reading this just quit my job at a car manufacturer and starting to get my Linux knowledge upgraded. The World startet to change and Most of them dont even know whats going on or believe everything is gonna be the same as before the Rona.\n\nLet them use tech and let us use them to live a better life then the average Person.\n\nNo one knows when or what could happen since the printer never stops.\n\nSome Analyst say it's the largest bull run we will ever have and some predict a full blown 1930's Part 2.", "score": 1, "replies": [{"body": "I think it will be both. The longest bull run on tech ever as everyone who didn't invest in a digital footprint gets eaten up slowly.\n\nAnd yeah, man, learn the Linux cmd! It will be universally useful in any tech profession you go into.", "score": 1, "replies": []}, {"body": "Today was big. We are on our way down. I promise you that much. \n\nDips will still be bought, but the market is actually gonna start reacting to news and numbers now.", "score": 1, "replies": []}]}, {"body": "I agree. My personal portfolio is a mix between similar themes: large amounts of big data(FAMG & Data center REITs), cyber sec, semiconductors, and companies poised for rebounds (WM, ALK, DAL for ex.) Oh, and of cours 5% in GLD and 3% in TVIX.", "score": 1, "replies": []}, {"body": "I think you better off waiting until the crash before buying. If the market goes down they are all going to go down as well.  Maybe not as much as other stocks, but they will go down as well.", "score": 1, "replies": []}, {"body": "wait what? you are out because you don't know what is happening right now in thr markets, then you say a crash is comming, PE is hig, debt, etc.. but you put all your money in digital bigcap FANG ... so... wtf?", "score": 1, "replies": []}, {"body": "“Invest in Digital revolution “ , it’s like in I’m 1998 again", "score": 1, "replies": []}, {"body": "Who the fuck are you? Telling me to stop gambling. Because you sucked at it", "score": 1, "replies": []}, {"body": "Look at twiiter or reddit, do they ever seem connected to reality? You think facebook is any better?", "score": 1, "replies": []}, {"body": "Huh, don't be dumb with our life savings...\n\nWho's throwing in their life savings?\n\nDumb.", "score": 0, "replies": [{"body": "I have a maxed out Roth IRA with diversified assets in a variety of domestic and international indexes. It's managed for me by computers. This is my second portfolio with a different stragety. Try thinking less one dimensionally, you dumb fuck.", "score": -3, "replies": [{"body": "Bitch you put in your TLDR \"don't keep being dumb with your life savings\"\n\nI'm literally agreeing with you, you one dimensioned twat.\n\nWhoever is playing with their life savings is being dumb...\n\nJesus Christ...", "score": 6, "replies": [{"body": "dudes got some penis issues for sure man just let him prophesize", "score": 3, "replies": []}, {"body": "The way you talk to me reminds me of my dad. You make me feel all warm.", "score": -5, "replies": []}]}]}]}, {"body": "Have an exit strategy and a [contingency plan!](https://www.tradinganalysisresources.com/2020/06/event-driven-investment-trading.html?m=1) . I’m with you. I don’t know what the hell is going on but I have an idea.", "score": -9, "replies": [{"body": "This cuck has been pimping a dumbass link all day. Someone ban him", "score": 9, "replies": []}]}]}
