{"title": "The Second Great Depression | how close are we?", "selftext": "The article illustrates about how an average American life would be and how economy would evolve from the struggling interdependencies among businesses, consumers, and governments in near future. \n\nFor those who have never seen life and economy through recession, it’s a must read even if you disagree because it gives opportunity to self reflect when reality starts down the read. For those who have seen at least one, it is a recall.\n\nhttps://www.theatlantic.com/ideas/archive/2020/06/second-great-depression/613360/?\n\nWhat are your thoughts?", "id": "hgo6yl", "created_utc": 1593237545.0, "score": 23, "upvote_ratio": 0.68, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|3 years ago\n**Total Comments**|27|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "IF that ever happens....I’ll manage if that happens. What concerns me is the very small number of genuinely decent hardworking people  that do everything right...especially these kind of people with young kids. That’s rough to even think about.", "score": 47, "replies": [{"body": "That's why I didn't bother going to college,I work at a gas station and 2 new employees that just got laid off both have 4-6 years college education and one was a teacher\n\nRip in piss US caste system lol", "score": 7, "replies": [{"body": "The fuck do you get a 6 year college education and work at a gas station?\n\nUnless by new in which case you meant like after covid started and they got laid off. Not trying to rag on you/your work at all, but that’s fucking wack", "score": 2, "replies": [{"body": "There's college education and college education. You graduate in a bullshit useless degree, that's what you get. Especially since more and more people go to college, it becomes less valuable. A Master's Degree is the new college, and a professional or doctoral degree is the new Master's", "score": 3, "replies": []}, {"body": "The one with 6 years of college education is a teacher who is working with me now, she has a lot of specialized training for autism and is a 2nd grade teacher...well not anymore since she got laid off and now works at a gas station lol\n\nThe other guy has a 4 year biology degree and was a prosthetics dealer before he got laid off to work at the gas station - well he doesn't work here anymore either because he had a stroke so that guy is probably gonna be homeless with his family - his wife was a regional manager for a large bank before being laid off and having to work at Starbucks\n\nJust goes to show what a shithole this country truly is, I'm glad I never bothered to go to school or try there's literally no point", "score": 2, "replies": []}]}]}]}, {"body": "Too long of an article very little substance.\nSummary of article, need congress to provide stimulus and the people to wear masks and keep social distancing to fight off the disease. Things are bad and could get worse. We will see what happens.(end summary)\n\nNo one can predict the future but looking at COVID cases in NY, MA, NJ, MD and states that have the virus under control it can work if ppl cooperate and Karens dont go full crazy. \nI see a little turbulence ahead, horrible 2Q numbers so expect a pullback, then To The Moon!!!", "score": 33, "replies": [{"body": "Sir you are underestimating the American Karen 😂", "score": 28, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I went to Chesapeake Inn 2 weekends ago and yeah no1 cares not wore their mask. By 2pm no1 gave a fck. I left. Lol", "score": 3, "replies": []}, {"body": "I hope not I am in MD as well.", "score": 1, "replies": []}]}, {"body": "Article had way more content than that...\n\nIt included statistics on job loss, businesses shutting down, economic activity impacts, impacts by demographics (rich, poor, immigrants etc), it discussed state budgets and government workers, as well as small businesses. The article also discussed how re-opening is doing in states that are trying to do so and what all of these facts and figures might mean for the long term. \n\nThe article provided current facts, opinions on what those facts might mean, as well as forward looking estimates and a critique on the government response.", "score": 5, "replies": [{"body": "Sir, this is wallstreetbets", "score": 3, "replies": []}, {"body": "Ah, we found the article author's degenerate gambler husband! The Atlantic profits entirely off of doomsday-articles like this, and has for a couple years now. It's like--clickbait for \"smart people.\" Meanwhile, ads.", "score": 1, "replies": []}, {"body": "Irrelevant stuff thats baked in to the market. It is nothing we dont already know. So citing old news is irrelevant. Unless you did not know about it. This is all baked in.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I agree Main street wont fully recover w/o vaccine... but wall street will.", "score": 3, "replies": []}]}, {"body": "luckily, most either go or have gone to 🥭 rallies or were at the pool party down south. Hopefully they all die waiting for the manager.", "score": 0, "replies": []}, {"body": "Looking back - 3 years later - you were right. Now as soon as the lower the interest rates it's off to the races again.", "score": 1, "replies": []}]}, {"body": "We are already in the beginning phase my friend, hang tough.", "score": 4, "replies": [{"body": "Recession canceled dude banks survived the stress tests they just have to limit themselves for now by being more conservative with what they loan out.", "score": -2, "replies": [{"body": "So the fed pumps trillions of dollars in liquidity to the banks, and they're told to be MORE conservative in lending? And the average American, with no reasonable access to any of this lending was given $1200? That's wild.", "score": 12, "replies": [{"body": "Yes, and the banks have higher standards for loans now as well.  Like they got billions of dollars for free (that they can now invest in super shady equities due to FED de-regulation) but their major reason for existing (making loans) will now be restricted.\n\nThe banks have gamblin’ problems.", "score": 2, "replies": [{"body": "Literally a week after they took the money they raised mortgage standards. Surprise.", "score": 2, "replies": [{"body": "How big of a hit are banks going to take when nobody meets their loan requirements?  I feel like that’s some sort of snowball scenario.", "score": 1, "replies": [{"body": "Definitely snowball. Even if the banks and tech companies are too big to fail, there will be massive risk heading into the latter half of 2020.", "score": 2, "replies": [{"body": "Just in time for the election.  Oof.  2020 is a hell of a year.", "score": 2, "replies": []}]}]}]}]}, {"body": "Do you have any idea what a stress test does, it takes into account the worst possible scenario and it sees if the banks survive it which they do, those trillions are responsible for that outcome.", "score": 1, "replies": [{"body": "What does that have to do with the central point of making access to credit available to the middle class instead of hoarding it for the ultra wealthy and major corps?", "score": 1, "replies": [{"body": "Pending home sales up 44% from previous -18%\nConsumer confidence at 98% from 85% \nDoesnt sound very limiting to me sounds like they just stopped loaning out to people with shit credit lmao.", "score": 1, "replies": [{"body": "Home values haven't collapsed yet. Wells Fargo has been cutting their customers HELOC exposure. I'm not convinced even asset backed lending like mortgage lending is going to be buoyed for long. \n\nThe consumer confidence index is not expressed as a percent. It was almost 150 in 1998.", "score": 1, "replies": [{"body": "Doubt home values will collapse I predict 10% at the most if I'm right ur gay asf 🤣", "score": 1, "replies": []}]}]}]}]}]}, {"body": "no, its quite the contrary. We are looking at another potential banking crisis in the near future.", "score": 1, "replies": [{"body": "The economic calendar says otherwise...beat a few very important expectations.", "score": 1, "replies": []}]}]}]}, {"body": "No one tell him", "score": 12, "replies": [{"body": "Depression has nothing on our printer.", "score": 9, "replies": [{"body": "... tell that to Zimbabwe", "score": 2, "replies": [{"body": "Zimbabwe < [South Africa ](https://www.google.com/amp/s/newspunch.com/south-africa-print-money-rich/amp/)", "score": 3, "replies": []}]}]}]}, {"body": "Fundamentally we’ve been in a depression since ‘08 - https://youtu.be/f098i4FKpK0", "score": 5, "replies": []}, {"body": "Money printer go brrrrrr BITCH", "score": 6, "replies": [{"body": "brrrr brrrrr", "score": 2, "replies": []}]}, {"body": "Umm millennials *only* know recessions.", "score": 4, "replies": []}, {"body": "With the way the government is printing money, SPY 300 will be equivalent to SPY 200 in January with inflation.  Less chance of a market crash and more chance of the dollar being worth less.", "score": 4, "replies": []}, {"body": "brrrrrr", "score": 2, "replies": []}, {"body": "Unlikely. Everything is dependent on the Pandemic. Eventually it will die off on its own or we'll find a treatment or vaccine for it. Its just a question of when. Even when it rages now, people know to shelter in place, wear a mask or get tested. It will never have a chance to catch people by surprise again.\n\nEven in the worst case scenario, the disease just runs its course and kills 1 million people, mostly elder and obese people. Their economic contribution is limited already and once its over the economy will sky rocket. \n\nTaxes and minimum wage do need to be raised and they will close the wealth gap.", "score": 1, "replies": [{"body": "Minimum wage won’t do shit for the wealth gap. \n\nRaise it to $15 an hour and you’ll just accelerate the automation that’s coming for those jobs anyways. \n\nWe need massive spending from the bottom up and a restructuring on how we view fiscal policy as a whole. Reganomics doesn’t work and it never has.\n\nEdit: unfortunately after all the brrrring the last few months there’s not going to be much political will for go big or go home fiscal policy.", "score": 9, "replies": [{"body": "This is a common arguement about minimum wage but it is unfortunately wrong. This is politicized. Increasing taxes and raising the minimum wage reduces wealth gap 100%. Read some history.", "score": 3, "replies": [{"body": "History didn't have the level of automation we have, adapt to the times. \n\nThe tech revolution will make the strife involved in the industrial revolution look like child's play.", "score": 1, "replies": []}]}]}, {"body": "It will take YEARS to die off. You understand this, right?\n\nR0 is over FIVE. That means more than 80% of us have to get covid before herd immunity and Trump’s claim that *it will just go away* becomes accurate. Do you have any idea how much it still needs to spread? We’re not even remotely close to 25% and look what’s happened already. The answer to your question of when is likely AFTER a vaccine, so this shit won’t end until 2022 at the earliest. \n\nWe need a new government that actually has a plan. \n\nOutside of that,  I agree 100%", "score": 1, "replies": [{"body": "where do you get the R0 is over 5?", "score": 1, "replies": [{"body": "The CDC. Says 5.7 is probably the R0\n\nNote that **R0 is only the R value before human intervention and response kicks in.** Simply wearing masks drops it to *probably* less than 1. \n\nSource: https://wwwnc.cdc.gov/eid/article/26/7/20-0282_article\n\nSo, the reason it’s dropping in many places is because the R value has been reduced below 1. Current R in most places is far lower than R0", "score": 0, "replies": []}]}, {"body": "I don't know of the R0 being over 5. Parts of Europe and Asia are almost back to normal. I can't imagine the R0 being over 1.5 if people wear masks and get tested.", "score": 0, "replies": [{"body": "The CDC says 5.7 is probably the R0\n\nNote that **R0 is only the R value before human intervention and response kicks in.** Simply wearing masks drops it to *probably* less than 1. \n\nSource: https://wwwnc.cdc.gov/eid/article/26/7/20-0282_article\n\nSo, the reason it’s dropping in many places is because the R value has been reduced below 1. Current R in most places is far lower than R0", "score": 1, "replies": []}]}]}, {"body": "Lol wut?", "score": 0, "replies": []}]}, {"body": "Very close the American people are too spoiled for this unfortunately...", "score": 1, "replies": []}, {"body": "The Atlantic 😭😭😭🤣", "score": -1, "replies": []}, {"body": "Fake news", "score": -3, "replies": []}, {"body": "Hahaha Depression? Wat dat with printing brrrrr? Worry about civil war and food shortage with meat plants closures and locusts.", "score": -7, "replies": []}, {"body": "It’s going to hit us hard ... but first brrrrrrr", "score": -2, "replies": [{"body": "No more brrrr, they lied it wasn’t unlimited ;)", "score": 2, "replies": []}]}, {"body": "I was around for obama's recession and that felt like nothing. This will be 2-3-4 times as worst...", "score": -6, "replies": [{"body": "The Great Recession took place from December 2007 - June 2009 following nearly 7 years of the George W. Bush presidency. Obama took office in January 2009 and the S&P500 bottomed in March 2009.", "score": 16, "replies": [{"body": "I want to inverse whatever positions guy above has...", "score": 4, "replies": [{"body": "TSLA 1/15/21 $460P and SPY $325/$330 Call Credit Spreads right now. Traded out all of my other positions yesterday to lock in a multi-week winning streak.\n\nWe are still in a recession and we will rebound strongly out of it when it is time. But I’m not convinced it is time yet.", "score": 3, "replies": [{"body": "I was talking about the dude above you. You know, the one who does not understand the concept of linear time.", "score": 7, "replies": []}, {"body": "SN is PizzaTrader, no positions on PZZA, DPZ or YUM\n\nBan", "score": 1, "replies": [{"body": "You make a good point. \n\nI would support this, but I hold YUM shares and I honestly wish they would just stick to chicken and tacos. \n\nPZZA is trash (product and company), DPZ is above average (product and company) and I should probably invest but feel like I missed the boat. I’ve felt that way for two years and it turns out, the boat keeps sailing. Maybe your ban threat is finally the catalyst I need...", "score": 1, "replies": [{"body": "It seems there is a rational autist among us after all. I agree, PZZA is overrated. Their seasoning packets are fucking fire though, but they frequently leave them out.\n\nDPZ is above average, but the lava crunch cakes are the sole member of the dessert master class. Solid company, innovative for whatever that means in the pizza industry.\n\nTL;DR I reverse my ban appeal, this guy fucks", "score": 2, "replies": []}]}]}]}]}]}, {"body": "That's hilarious. Do you like to lie online or you believe your own lies?\n\nPlease GTFO with your /r/conservative 'alternative facts'.", "score": 7, "replies": [{"body": "What are you socially inept, fuck off", "score": -2, "replies": [{"body": "ohhh… did that hurt your political Trump feelings?\n\nIf you're going to spew politics, at least do it with real facts. Not 'alternative facts'.\n\nBut I suggest just not bringing up politics. It makes you look like a moron.", "score": 4, "replies": []}]}]}, {"body": "I concur. Commercial real estate, corporate debt bubble, bankruptcy, solvency issues, Q3 earnings, unemployment, fed bubble, dollar deflation, and to top it all off.... covid. Watch this market in Q3.", "score": 2, "replies": [{"body": "> Commercial real estate, corporate debt bubble, bankruptcy, solvency issues, Q3 earnings, unemployment, fed bubble, dollar deflation\n\nare there sources that summarize all this data? i have no clue how to gather it all myself or what to make of it probably, how do i learn?", "score": 1, "replies": [{"body": "Not really, I’ve just been counting how many headlines it takes for the markets to act rational. It’s been rational for most of June. Twitter has fast, digestible trading info. Follow a couple of good research junkies and they will give you good data.", "score": 2, "replies": []}]}]}]}, {"body": "Have an exit strategy and a [contingency plan](https://www.tradinganalysisresources.com/2020/06/event-driven-investment-trading.html?m=1). Note that most the stocks labeled as a buy amid a pandemic did good last week.", "score": 0, "replies": []}, {"body": ">I think that the article is interesting and provides a lot of food for thought. I do not necessarily agree with all of the points made, but it is definitely an insightful read.", "score": 1, "replies": []}]}
