{"title": "$CHWY Earnings Play, Week of June 8th", "selftext": "Chewy Inc. reports first quarter 2020 earnings this Tuesday June 9th after hours. To be honest this stock has been on an absolute tear this year, but I have reason to believe it will continue into earnings. \n\n&#x200B;\n\nCoronavirus has had a positive effect on pet adoption rates all over the country, and with boomers too scared to go to Petsmart they have been turning to Chewy to deliver their necessary pet supplies. Autoshipped pet food sales have gone up 45% in 2019 already, soon to be higher this year. Even if there is a nasty recession out there, you know who doesn't give a shit?.. Dogs! Dogs don't care if their owner is poor they still eat and need medical supplies. And for Americans pets are part of the family and spending less on ole Fido for a few months is out of the question. \n\nCheck out this story for more numbers:  [https://www.fool.com/investing/2020/06/03/whos-a-good-boy-chewey-wants-to-shake.aspx](https://www.fool.com/investing/2020/06/03/whos-a-good-boy-chewey-wants-to-shake.aspx) \n\n&#x200B;\n\nLast quarter they reported (-0.15) vs. (-0.17) and soared over 70% in the days after. The estimates for Q1 2020 are (-0.11), but give these new pet adoption and online shopping trends we should expect better numbers and possibly even A NET GAIN! If that happens, chewy shoots the moon my friends. \n\nChewy is no Uber or Lyft, they can ship to 80% of the US population overnight and 100% in two days. As sales increase they will reach economies of scale where costs per sale decrease. This would mean that costs actually go down as they take over the market and make even more profits. \n\n&#x200B;\n\nIf you got FOMO from the earnings run up of SHOP or PTON, don't be a fool. Even if you don't believe me that they will post break-even or profits this quarter, then at least confront the fact that a loss of 0.11 per share is ridiculous.\n\n&#x200B;\n\nTLDR: CHWY $60c 06/12", "id": "gxzofl", "created_utc": 1591479873.0, "score": 86, "upvote_ratio": 0.93, "num_comments": 78, "comments": [{"body": "I held chwy calls last earnings. They beat but tanked right after. It was the next week that they took off- more than 30% If not for diamond hands I would have sold 99% loss, but if I wasn't scared and relieved shirtless I could've made a 500%, or like 10000% if I would yolo'ed when I was down.", "score": 44, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "I tend to agree with this observation. What options are you considering over the next two weeks?", "score": 2, "replies": [{"body": "KR", "score": 5, "replies": [{"body": "Yep KR will beat!", "score": 1, "replies": []}]}, {"body": "IVR 7c 6/19\n\nDGLY.  This one is interesting, volatility is insanely high because of a huge bump from the riots, so I own shares and am selling calls.\n\nAnd LEAPs in JO, coffee producing countries have been hit really hard by covid/locusts/you name it.  I expect to see supply side issues starting this fall.  I hope to see that’s drive commodity prices way up.", "score": 1, "replies": []}]}, {"body": "works till it doesn't", "score": 5, "replies": []}, {"body": "Or twilio", "score": 1, "replies": []}]}]}, {"body": "This reminds me of the Campbell soup play. Rona is cancelled and I can see it dumping post earnings. But I’m usually wrong so maybe it will pan out!", "score": 20, "replies": [{"body": "Fucking soup killed me last week. Lost 33% of my account. I YOLOed into spy and broke even. But fuck soup.", "score": 17, "replies": [{"body": "You are truly an autist if you YOLO d 1/3 of your account into soup calls", "score": 19, "replies": [{"body": "Is there a soup ETF?", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "canned soup is the new paradigm bruh", "score": 1, "replies": []}]}]}, {"body": "I had my finger on the buying of some soup calls", "score": 2, "replies": []}, {"body": "lol im down alot on cpb calls rn but if it somehow gets to  $52 in next couple wks ill make 100 percent profit so we will see", "score": 2, "replies": []}]}, {"body": "Is this your 🐕? Very cute", "score": 8, "replies": []}, {"body": "7/17 70c has better profit potential according to Options Calculator", "score": 12, "replies": [{"body": "That's 40% OTM, the risk-reward is much worse than $60C, after earnings it's likely my calls will be in the money but idk about the 70c", "score": 7, "replies": [{"body": "Are you talking to the calculator?", "score": 12, "replies": []}]}]}, {"body": "60c?  thats pretty optimistic no?\n\nWhy not run a strangle on CHWY - 6/12 50c AND 6/12 46p equal $ amount in both.  Thats how I'd trade this.", "score": 18, "replies": [{"body": "That would cost $5 and would therefore require a more than 10.3% move to start making money. \n\nI'm going to sell some low delta strangles instead.", "score": 20, "replies": [{"body": "Yea  -that's why I am heavily favoring LULU instead - they report A/H on thursday and should have a big move on Friday.  6/12 options should be much cheaper than CHWY - after all I don't really care about wed-fri trading on CHWY b/c of IV crush.  The stock is bound not to move as quickly after earnings print.  So why pay extra to the Theta gods?", "score": 3, "replies": [{"body": "This is exactly why i waited until tomorrow to buy. I am going 6/12 $50 calls and dumping at 3:57 before earnings as usual.", "score": 0, "replies": [{"body": "Good luck!  I am sitting this one out.", "score": 1, "replies": [{"body": "Already sold at open", "score": 1, "replies": [{"body": "Ah very good!  Holding through earnings is like flipping a coin.", "score": 1, "replies": []}]}]}]}]}, {"body": "So you can’t make money if chewy went to say $55 and  the call was for $60?", "score": -8, "replies": []}]}]}, {"body": "God, we are in such a fucking bubble, if someone told me people would be going all in on fucking pet food company which is operating at a loss I wouldn't believe it.\n\nI don't understand what is the trade off, it's not like they have something revolutionary in the future like TSLA, or are playing volume like UBER, they're a fucking pet company!", "score": 9, "replies": [{"body": "Remember the market is never wrong only opinions are", "score": 5, "replies": []}, {"body": "Remember pets.com?  Boomers do, that's why this stock is going to the moon.", "score": 2, "replies": []}, {"body": "Pet company...and pet products have huge margins!! It’ll be easy for them to fill that gap", "score": 1, "replies": []}, {"body": "lol", "score": 1, "replies": []}, {"body": "GoD we R in suuch a fuckin buouB.... yea shut the fuck up. No shit stocks are too expensive, but the company has been killing it during Covid you fucktard. Pets matter more than people, CHWY to $60!!", "score": 0, "replies": [{"body": "You're just pissed someone isn't confirming your DD", "score": 3, "replies": [{"body": "Ehh maybe, I’m just fucking with you anyways I agree. The stock market is too high, but the only thing I can do is continue to ride the wave.", "score": 1, "replies": []}]}]}]}, {"body": "I have 60c 7/17 already. Entered half the position, holding onto some powder to cost average down if they slip after. Because, as we all know, if a company crushes earnings they fucking tank in this market but if they miss and say \"we have some cash laying around\" they fucking moon", "score": 3, "replies": [{"body": "MongoDB beat earnings by 50% only to drop 15% 🤔. I guess investors were hoping for a 69% beat.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Agreed. And very volatile price action.", "score": 2, "replies": []}]}, {"body": "Bought 6/12 48.5C on Tuesday, it's been down, hoping it pans out.", "score": 3, "replies": []}, {"body": "Still holding 6/19 45c and up 150%. Let’s pump this up some more baby!", "score": 3, "replies": []}, {"body": "So buy for the run up, sell before earnings, and rebuy after the tank during the dip", "score": 3, "replies": []}, {"body": "Priced in", "score": 11, "replies": [{"body": "Not fully priced in, but I would 75% of the way there.", "score": 4, "replies": []}, {"body": "If you say so, tell me that again on Tuesday.", "score": 4, "replies": [{"body": "Ru roh", "score": 0, "replies": []}]}]}, {"body": "You already holding these? I sold out of some 6-19 $50 calls at a nice profit earlier this week and now I’m having FOMO", "score": 7, "replies": [{"body": "Yea, i'm holding these rn. Got them on Friday. IV is pretty low for now, probably 200%+ by Monday.", "score": 7, "replies": [{"body": "Good luck. I should’ve held strong to see what happens but oh well", "score": 1, "replies": []}]}]}, {"body": "CHWY has had their run up towards earnings and then sell off after. That’s what’s happened with previous patterns. Hopefully it changes but just something to look at", "score": 5, "replies": []}, {"body": "I was watching chewy closely to  play their earnings but the runup seems pretty priced in. If they drop Monday I might buy in but sell just before earnings. Like others have said, they don’t traditionally do great after earnings. They’d have to crush earnings so hard to pump after earnings. But what the fuck do I know", "score": 2, "replies": []}, {"body": "Becky and her dawgs", "score": 2, "replies": []}, {"body": "Anybody think holding shares and selling covered calls is a good idea... I doubt the stonk will dump after er", "score": 2, "replies": []}, {"body": "lots of mini pump-n-dumps happening today\n\nhodling thru earnings would be true diamond balls", "score": 2, "replies": []}, {"body": "Should I hold through earnings on this?", "score": 2, "replies": []}, {"body": "So puts?", "score": 2, "replies": []}, {"body": "This was a good DD. Made some nice profits before earnings. Thanks u/ld_southfl", "score": 2, "replies": [{"body": "Np, I did the same thing.", "score": 1, "replies": []}]}, {"body": "I’m balls deep in $60 calls for 7/17. Up 20% but ima hold for earnings", "score": 2, "replies": []}, {"body": "PSA: The founder sold all his CHWY, and bought WFC, AAPL\n\n[https://www.marketwatch.com/story/he-sold-his-company-for-billions-then-invested-almost-his-entire-fortune-in-these-two-stocks-2020-06-07](https://www.marketwatch.com/story/he-sold-his-company-for-billions-then-invested-almost-his-entire-fortune-in-these-two-stocks-2020-06-07)", "score": 3, "replies": []}, {"body": "Rona cancelled, puts it is.", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/ld_southfl don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Sorry bro. Dog food Covid plays are not it chief. Casinos and airlines dumbass", "score": 2, "replies": []}, {"body": "looking at the option chains, there are more puts than calls. But there's another dude spent 700k on chewy, I might do the same on Monday.", "score": 3, "replies": []}, {"body": "CHWY to $45", "score": 1, "replies": []}, {"body": "It had a run up last week, on Thursday I believe already but fell pretty fast after", "score": 1, "replies": []}, {"body": "Buy To Open on June 12th  CHWY Oct 16 '20 $65 Call is the play here if you're bullish on the future prospects. \n\nAvoid the high premium and buy at a discount and hold or buy higher and sell higher.", "score": 1, "replies": []}, {"body": "I’m all in on this one already...I couldn’t get my dogs food back in March. They were sold out. Talked to customer service, she said it was insane and they were slammed busy. I ended up ordering 2 extra bags of food to get my wolf through covid...literally bought calls after talking to her. Up nicely ever since 💎 🖐", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "It’s 86% up in 3 months.  Nah", "score": 0, "replies": [{"body": "Does that really matter in this bull market? No.", "score": 6, "replies": []}]}, {"body": "This smells like a good inverse. If it rips Monday im getting a few puts", "score": 1, "replies": []}, {"body": "$60 call 6/12. Can somebody tell me what happens if earnings are good and the stock only goes to $55, do I still make money? Yes I’m ignorant and yes I’m placing this trade. I can’t remember how it works.", "score": -1, "replies": [{"body": "Yes that’s a big move, the $60 calls would still appreciate significantly.", "score": 3, "replies": [{"body": "Ok thanks appreciate the answer!", "score": 2, "replies": []}]}, {"body": "Sell the day before earnjngs. Don’t hold that shit.", "score": 1, "replies": []}]}, {"body": "60c? That seems optimistic..", "score": -2, "replies": [{"body": "Duh. That’s why I made a post about why I think it will go there. Can you read?", "score": 2, "replies": []}]}]}
