{"title": "[Chart] Voodoo & [Options] Chains - $NKE and $FSLY", "selftext": "Somehow we managed a green Monday. Let's hear it for the bulls. Bear gang walks home gay and empty-handed. If you held $SQ or $NVDA over the weekend, congratulations! Occasionally, diamond hands pay off. I'm sure you made some tendies. I know I did.\n\nEnough boasting, I'm not a total dick (only in person). I have a few disclaimers I want to put out real quick: 1) You should never trade anything you see on here without doing research of your own, 2) Never put more into one position than you're willing to lose, 3) Trading is all about patience - which is going to be important this week.\n\nOkay - I know, \"Shut the fuck up and get to the details, moron. I have money to throw away.\" What are some big things to look out for this week?\n\n1) Bank stress test on Thursday - this is going to give us some good insight on whether the financial sector can handle an unexpected event/adversity. Do not underestimate how important this is. Watch for possible lower volume until Thursday. I'm going to play the banks, but it's going to be last minute when I have a better idea of which side to play.\n\n2) COVID-19 daily reported cases. Things are starting to feel uneasy again. I live in Texas, and I know my county made it mandatory again to wear masks while indoors in public. Mamma didn't raise no bitch, but this is definitely something to monitor.\n\n3)  US/China tensions. Is the trade deal over? I mean we all knew it was over 6 months ago, and 6 months before that, and 6 months before that... but is it over?\n\n4) Oil uncertainty. Chevron JV in Saudi Arabia restarting shipments despite OPEC deal. Others likely to follow.\n\nIf I missed anything big, and I'm autistic so I probably did, please put it in the comments. It's show-and-tell and everybody and their brother wants to hear about it.\n\nIf you don't like Kaepernick, you won't wear this brand mid calf and you won't trade this stock: **$NKE**\n\n[1 year chart](https://preview.redd.it/zbk39424qk651.png?width=1012&format=png&auto=webp&s=7a915056770afdec8f82a9621e2e190f281c9ba4)\n\n[1 month chart](https://preview.redd.it/evyxu736qk651.png?width=1013&format=png&auto=webp&s=a304d2bc9a93cd9ad55d1bba7bb96eab2702bfa9)\n\nSo tbh no one requested this one. I was thinking about America, the 4th of July, and tendies... then I had this memory come back to me. Last year - on June 30th - while getting ready for America's most patriotic day, I wrote up some DD on $NKE. I predicted the continuation of a trend (inverse head and shoulders), recommended a play, and it eventually came to fruition. There was money to be made. To the bars! People laughed, beers were drunk, mistakes were made, people cried. Not gonna talk about it.\n\nWhy do I like $NKE? The company makes some dope shoes, joggers, I rep their socks 50% of the time (the other 50% of the time is a mix of random brands), their marketing team is g(ay)reat, they make a mean profit. \n\nMy one complaint about $NKE last year was that they had too much of a cash pile and I suggested more marketing/R&D. Turns out, having too much cash was a good thing (COVID). Not only do they have cash reserves, but the long term debt on the company's books is very modest. As J \"Daddy\" Pow once said \"stonks only go up\", so does $NKE's revenue, EBITDA, and FCFs YoY, QoQ, possibly even DoD. I have multiple degrees in accounting and finance and $NKE's financials make me pretty hard (humble brag...).\n\nEarnings estimates are very reachable at just $0.09 EPS. Even if it beats estimates, can this stock keep pumping? Is the risk of China trade too great to play the upside? How much is already priced in? ER is on 6/25.\n\nQuick peak at the options chain shows a priced in movement of about $3 on both sides after ER. Volume and open interest on the options chain are pretty high. Put/call ratio for volume is pretty bullish, ratio for open interest is barely bearish. RSI and MACD are both pretty bullish.\n\nTomorrow I'm going to watch the price, wait, and make a decision. What looks attractive to me right now? 7/2 105c and 110c. 6/26 105c are pretty cheap, too, but theta and IV decay are something you have to watch out for. There is a lot of uncertainty in the market right now. Don't blindly buy these.\n\nThe next one on the list is one that I have heard a lot about, but was rather unfamiliar with up until now: **$FSLY**\n\n[1 year chart](https://preview.redd.it/ji6axw5ixk651.png?width=809&format=png&auto=webp&s=978330dfcffc5fd2278c87f9ac5590bc4efe3da2)\n\n[1 month chart](https://preview.redd.it/3krds49pxk651.png?width=805&format=png&auto=webp&s=82db0b39170f2ce693a932da00de951e3c99ee41)\n\nSome local retard recommended I do some DD on $FSLY so here it is. $FSLY is not profitable. It is near-profitable. It wants to be profitable. But it is not profitable. When I read a summary of the business operations and took a peak at the financials I saw big data and fast delivery. I'm young and I know what that means: a future of profitability (if properly managed of course). \n\n$FSLY joined our ranks last year with a May 2019 IPO. It's currently trading at ATHs with very high volume to back that up. RSI is signaling overbought, MACD is signaling the bull run must go on. Volume and price action signal investors could never be more optimistic. \n\nThe upside is uncharted territory (seriously go look at options chain. Calls only go up to the 90 strike). It could go *anywhere*. There are no specific resistance levels. The downside is pretty clear. This was a $20 stock not too long ago. It could go *anywhere*. \n\nThe options chain is pricing a movement of about $10 post-ER. Volume and open interest are both bullish. ER is 8/6 and recent EPS have fallen between -$0.05 and -$0.20.\n\nWhat does this stock really have going for it? Coronavirus. Work-from-home. Data and the transfer and storage of that data is more important now than ever. $FSLY will most likely win in the future, regardless, but can rona speed up its success? \n\nMy play for this fast-mover? Wait for a big red day and get in on some leaps. I'm thinking a post-earnings play. 8/21 90c don't look that bad, but I think the premiums will drop. If you don't want to play earnings the 7/10 80c are not that bad. A major part of this play is if daily rona cases continues to rise. Again, I suggest waiting for the price to drop a bit or at least flatten.\n\nTL;DR\n\nBe patient. Look at the events I pointed out in 1-4 and play accordingly.\n\n$NKE barely OTM calls to play ER - 7/2 105c and 110c\n\n$FSLY deep OTM calls to play ER and capitalize on rising COVID cases - 8/21 90c and 7/10 80c", "id": "he7p93", "created_utc": 1592885474.0, "score": 66, "upvote_ratio": 0.91, "num_comments": 71, "comments": [{"body": "Welp I know what I'm spending my SQ tendies on", "score": 19, "replies": [{"body": "Lol tread carefully", "score": 7, "replies": []}, {"body": "I have DD on NET which is a CDN. Same industry as fastly.\n\nI've been advocating this market since the beginning of corona as most tech companies will be highly focused on video software/VR and video SERVICES.", "score": 1, "replies": [{"body": "NET is the most overvalued company in the space. Revenue similar to FSLY with 50% higher market cap. Also Cloudflare is security focused. Nobody uses them for video.", "score": 1, "replies": [{"body": "Video hasn't been their central focus because it wasn't part of their software kit. That has recently changed and I implore that you look into it.", "score": 1, "replies": [{"body": "They don’t have the network capacity to do large scale video. 37 Tbps is weak. Their network performance already sucks I can’t imagine how bad it would get if they started filling their pipes with video. Plus they don’t charge for bandwidth so any video they bring into the network will probably end up costing them money.", "score": 1, "replies": [{"body": "Ok. Get puts if you're so sure then :)", "score": 1, "replies": [{"body": "I should have this morning I would’ve banked", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Haven't done any DD on FSLY. Interesting company to look into", "score": 13, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "DT, eh? Tell my why I should go all-in based on your hypothesis.", "score": 1, "replies": [{"body": "I have DD on NET which is a CDN. Same industry as fastly.\n\nI've been advocating this market since the beginning of corona as most tech companies will be highly focused on video software/VR and video services", "score": 1, "replies": [{"body": "You seem extremely sure about NET judging by your post/comment history. I personally was left disappointed by its earnings but didn’t hold through the report so it didn’t burn me.\n\n\nMight have to forget about that earnings and play this. 👀", "score": 1, "replies": [{"body": "I'm up about ~200% on Net with 8/21 calls...even after today. I plan on selling right before earnings. \n\nFastly seems super intriguing but way to volatile for me", "score": 1, "replies": []}]}]}]}]}, {"body": "Shopify is their client so they are seeing massive gains.", "score": 2, "replies": []}, {"body": "If you want a long term look at FSLY I’d look at u/lekezen2 who did a bit on it last summer and everyone went wild.", "score": 1, "replies": []}]}, {"body": "I'm in on Nike. Think they will have a really good ER based off trends I've seen on the secondary sneaker marketplaces like StockX and GOAT.", "score": 9, "replies": [{"body": "Good to know. I know about StockX but never look at it. I like cool shoes but I'm not a sneakerhead.", "score": 2, "replies": [{"body": "Expensive but always 100% legit - and you can get deals if you’re willing to bid and wait", "score": 3, "replies": [{"body": "Exactly. It’s all about how you play it. To anyone that reads my DD (or any DD) and plays some market orders in an hour, good luck. The only way to win is patience", "score": 1, "replies": []}]}, {"body": "Am sneakerhead. NKE doesn’t benefit from the secondary market (like StockX), but the NKE app is great & despite the recession/high unemployment all of the sneaker drops have sold out in minutes like usual. I’m actually shocked how much demand is still there. \n\nER & guidance should be great.", "score": 3, "replies": [{"body": "$NKE is able to truly tap the China market now. Who really cares about brick and mortar anyway? Online shopping is the future and there’s a 1 bln population over there addicted to online shopping and the pop-up ad galore that comes with it. I’m excited for ER but will eat my shorts if they miss $0.09", "score": 3, "replies": [{"body": "Fell victim to all the bull reports. I’m a noob here with that 7/2 105c. Do I hang out through the weekend and hope for a pop on Monday/Tuesday? @enroncoin", "score": 1, "replies": [{"body": "What disappointing numbers. I read a report on it: China sales were fine, online sales increased 70%, it was sales in the US that really shit the bed down 50% or something. Those contracts are going to get crushed by theta and IV over the weekend. I would try to sell at today’s best price.\n\nGood news about $NKE is they are in a position to handle all of this just fine and they spent a lot on R&D so their web/app will be solid through all of this.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "My dumbass sold my 6/26 $70 call this morning for $2.00 ($50 profit). Then I watched it moon", "score": 9, "replies": [{"body": "Sucks but how could you have known it would take off", "score": 2, "replies": []}]}, {"body": "Ive been waiting for a dip for 4weeks. never happened. Last week i said fuck it and jumped in at 62.", "score": 8, "replies": [{"body": "Same lmao, thank god", "score": 2, "replies": []}]}, {"body": "Both are up pre-market. I'm going to look at the bid ask spreads at open but I'm not buying unless these come down a bit. Probably looking to buy midday", "score": 6, "replies": [{"body": "Are you looking at the $NKE 110c or 105c?", "score": 3, "replies": [{"body": "I like the $NKE 110c for 7/2 but I won't pay more than .62ish", "score": 3, "replies": [{"body": "The 111c is .13 less expensive (0.55), what about that one?", "score": 1, "replies": [{"body": "Opportunity cost. Look at the liquidity on that contract. If $NKE spikes and you want to dump your contracts you’re way better off with the 110c", "score": 3, "replies": [{"body": "Get it, thanks! Lets hope it reaches the sub 0.62", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Your probly gonna get a lot of dip shot comments, so I’m here to tell ya nice post bro 👍🏼\n\nNow start PMing me your plays MFer", "score": 6, "replies": [{"body": "Appreciate it but take me out to dinner first.", "score": 3, "replies": []}]}, {"body": "FSLY is the CDN for SHOP. SHOP has a new WMT deal. SHOP + WMT + FSLY === BIG GREEN DILDOS FOR FSLY.\n\nWait for earnings, you shitting me? You're already a two weeks too late.\n\nFSLY: buy the hype (right now it is hyping big time with WMT/SHOP), sell the results... get out before earnings. Or fuck it, let it ride to 120. I'm loaded to the tits in fsly, so what can I say, it's been great.", "score": 4, "replies": [{"body": "Oh I know I’m late on this play. Doesn’t mean there isn’t hype left. Don’t want to play earnings? Play the 7/10 expiry. If this thing opens up 5-10% tomorrow adjust accordingly. Look I’m not suggesting anyone chase this I’m just saying there is opportunity left and the DD supports that.", "score": 3, "replies": [{"body": "Read my DD on the CDN market. It's about video processing.", "score": 0, "replies": []}]}]}, {"body": "I have NKE puts because they have a high valuation based on future growth in China, and China is in a recession so the guidance might be negative.\n\nI'm probably retarded because everything I see is super bullish on NKE.", "score": 4, "replies": [{"body": "Like I said, estimated EPS is like .09 So guidance was cut. Last time I traded $NKE it was $80-90 and it’s improved financial condition and performance since then. Your downside is definitely being considered but how much is priced in I don’t know", "score": 3, "replies": [{"body": "I'm just amazed at how anything is priced in if it's at the same price it was in January, when its main market is in a recession and it's future growth market justifying its high P/E is also in a recession for the first time ever.", "score": 2, "replies": []}]}, {"body": "China is mostly back to normal and people are going out and about. You are likely retarded", "score": 3, "replies": []}]}, {"body": "Again nice analysis man! Was too poor to play SQ last time! But will try to get in this time.. can you again please keep us informed about when you do positions? I will try to evaluate for myself as well but would still be great to learn", "score": 4, "replies": [{"body": "I will keep everyone as up-to-date as I can real time.", "score": 6, "replies": [{"body": "17% gains so far with $NKE. Best way to play earnings with them? I’m assuming holding up until earnings and seeing where it’s at EOD Thursday?", "score": 2, "replies": []}]}]}, {"body": "I've made a decent chunck of change off of FSLY. I lost money last week for thinking it would go back down. Once it broke 54 and I was down like 700 dollars. Then I started buying calls and now im up like 1,500.", "score": 4, "replies": []}, {"body": "I only run with Brooks shoes. BRK.B owns them last I checked.", "score": 4, "replies": [{"body": "I’m an adidas addict but I recognize $NKE’s dominance. Are these for real?", "score": 3, "replies": []}]}, {"body": "Thoughts on getting into FSLY now?", "score": 3, "replies": [{"body": "I probably won't be playing it above yesterday's close, but it has come down a bit. Premiums are still too high. IMO, look at some 2-3 week further OTMs if you're going to buy.\n\nEdit: premiums just aren't reacting the way I would like", "score": 2, "replies": []}, {"body": "7/10 80c is near today’s open... check the chart it had almost 100% return midday. Not suggesting anything but...", "score": 1, "replies": [{"body": "Yolo’d a 6/26 75c. It came back down near today’s open as well", "score": 1, "replies": []}]}]}, {"body": "I found this post through a search for NKE! So glad I did,, bc I am so bullish on this I'm throwing my whole paycheck at it tomorrow!  But I want to narrow down on just how far it will moon, from my guess it could go anywhere between 7-12 considering its past earnings. It always does well and I'm thinking this time won't be any different. I expect atleast up 7 by Thursday, since that's how high it was during the first months of the pandemic. Anyone care to share their P/T?", "score": 3, "replies": [{"body": "I got some 7/2 $105c and I’m hoping for good news tomorrow.. if not I suppose we still got Friday and the weekend for a rebound. We shall see", "score": 2, "replies": []}]}, {"body": "Uhh 2 months out and 600$? You do realize this is a casino?", "score": 2, "replies": [{"body": "Got him! Found the poor one /s\n\nRead the DD and turn it into your own debit spread? It's not that hard.", "score": 2, "replies": [{"body": "if I wanted to play Iv I wouldn’t trade debit spreads. Additionally, I’m not paying 600$ for a 25% OTM when Covid isn’t gonna last forever. Not to say your DD isn’t right or valid", "score": 2, "replies": [{"body": "You aren't wrong. Oh I definitely like $FSLY cheaper and lower strikes, but I'll play momentum if it's there, and it is. Remember, that contract is $600 because of what happened today. If it drops or flattens for a few days premiums will come down.", "score": 1, "replies": []}]}]}]}, {"body": "Picked up the 7/2 110c and a couple 112c bc volume was picking up on that strike. Took a shower. $NKE takes off again.", "score": 2, "replies": [{"body": "Nice! At what Premium? I think I made the 110c at 0.56", "score": 3, "replies": [{"body": ".65 and .44, respectively", "score": 2, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/enronCoin don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "FYI the charts are YTD not 1 year like I labeled them. I’m retarded.", "score": 1, "replies": [{"body": "$SQ is up even more in AH. Held on to some positions I suppose? #gains", "score": 2, "replies": [{"body": "Haha I wish. Sold most positions then held onto some 7/2 105c for as long as I could. Had to dump them when $SQ looked liked it was coming down", "score": 1, "replies": [{"body": "What’s the play with Nike? Expires 7/2. Do we sell before earnings or ride it out through the weekend into Monday? 🤔", "score": 1, "replies": [{"body": "Really depends on how we open. If it’s up but not in range of the target I might just have to sell the 110c and 112c. These will get crushed post-ER I bet if $NKE isn’t around $105 at close today. At $105 I’ll hold. If we get a red day I’m going to buy cheaper, lower strike FDs at lows.", "score": 1, "replies": [{"body": "Yeah I got the 105c and I’m going to hold. Got back the losses I had from it and hoping for some greenery 😂 if not I suppose we still have tomorrow to see how it moves. Nike is and always has been the best company for athletic and fitness gear", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What’s your thoughts on NET?", "score": 1, "replies": []}, {"body": "i noticed that all the major banks have earnings the second week of July. Would be interested to hear your thoughts on how you might play these dependent upon how things go this week :)", "score": 1, "replies": []}]}
