{"title": "Thoughts on Tesla?", "selftext": "I just sold Tesla, it really is insane how much it will and can go up but Elon is driving me nuts. A single tweet can take away tons of money for me, it’s just too much. Plus other car companies aren’t exactly doing very well right now. Thoughts?", "id": "he0600", "created_utc": 1592857826.0, "score": 4, "upvote_ratio": 0.57, "num_comments": 48, "comments": [{"body": "Other car companies are not doing well because the market for cars is saturated as fuck.\n\nThe market for EV is dominated by TSLA.", "score": 18, "replies": [{"body": ">The market for EV is dominated by TSLA.\n\nOnly in the US which makes about 20% of the world's car sales. TSLA is constantly losing EV market share in Europe and doesn't really shine in China as well.", "score": -10, "replies": [{"body": "Tesla is performing very well in China. The European car market is strange. Even Toyota struggles to break in.", "score": 6, "replies": []}, {"body": "Tesla is absolutely dominating in China.", "score": 10, "replies": [{"body": "They are doing really well but BYD is still the top dog in china and leading by a large margin", "score": 0, "replies": []}]}, {"body": "What in the actual fuck are you talking about? When I was in Amsterdam I swear every other car was a Tesla. I even saw them in Iceland. They’re all over Europe.", "score": 3, "replies": []}, {"body": "What the hell are you talking about? Are you just making up your own facts? Tesla is incredibly popular in China.", "score": 2, "replies": []}]}]}, {"body": "Yea I think it’s over priced and yea I think it’ll keep rising. Idk what to do", "score": 27, "replies": [{"body": "I’m 90% sure it’s gonna cap and fall real hard, I just don’t know when. Probably not soon, but idk either.", "score": -9, "replies": [{"body": "Nice analysis. Very specific and factual", "score": 29, "replies": [{"body": "I’m not analyzing the company in any way, I’m inferring based on my observations of the stock price fluctuations.", "score": -2, "replies": [{"body": "What you said can be said about any stock", "score": 4, "replies": [{"body": "Exactly, that’s how I look at stocks. Also happy cake day!", "score": 2, "replies": []}]}]}]}, {"body": "You’re not buying the car company. Your buying the fact that they have the best battery tech in the world. It’s not just the cars, it’s their patents that carry value.", "score": 0, "replies": [{"body": "It’s okay...shhhh...let him sell so we can buy", "score": 3, "replies": []}]}, {"body": "Ya when Elon is going to Mars.", "score": -2, "replies": []}]}]}, {"body": "I will buy your shares tomorrow, thank you for your sacrifice", "score": 24, "replies": []}, {"body": "Smart fucking man right here.  This shit will tank sooner than later", "score": 3, "replies": [{"body": "Still waiting for this... I’m conflicted if it’s too late to hop on this train.", "score": 1, "replies": []}]}, {"body": "Sell if/when other automakers catch up, not cause of stock price. Otherwise fomo", "score": 2, "replies": []}, {"body": "As long as this bull market is around TSLA will go up in price and P/E will expand as the market expands. It will have pullbacks but the long term trend will be up along with the market. We’ll be in a full on tech bubble again within 5-10 years I’m expecting, and things will get crazy.", "score": 2, "replies": []}, {"body": "I think this is more of a hype stock than a good investment.   I obviously could be wrong,  but they've barely shown a profit over the years. \n\nI just don't get their valuation at all.  I know people have made a killing on it, but it just doesn't feel long term to me.", "score": 4, "replies": [{"body": "It reminds me of another company that didn't show a profit for many years and people used to constantly say was overvalued. Hmm, what was it's name? Oh yeah, it was a little company called Amazon.", "score": 6, "replies": [{"body": "Still does return of it to shareholders though.", "score": 1, "replies": []}]}, {"body": "Absolutely I 100% agree it’s not about the company it’s about the stock.", "score": 5, "replies": [{"body": "Its not something I'd hold long term.   If you made a good profit, I'd take it and run.  The last time it was up stupid high,  it came back down hard and quick.\n\nEspecially with the beer flu stuff.    I would guess another crash would be coming in fall for round 2.", "score": 2, "replies": [{"body": "Exactly, I picked it up at 600 before COVID and immediately decided after it started falling again “once it tops 1000 I’m selling.”", "score": 3, "replies": []}, {"body": "But then it rose even higher", "score": 2, "replies": [{"body": "Yes it did,  and they can fall as fast as they rose", "score": 1, "replies": []}]}]}]}]}, {"body": "TSLA is a car + software company that is changing the world. It is a long term hold. $1,000/share will be cheap when it’s $10,000 within 5-10 years.", "score": 2, "replies": [{"body": "No way! 10000 a share! You’re giving them too much credit. They will go up a lot, but one day it’ll wear off, fall, and stay there. I don’t want to have the stock when that happens. But they definitely will grow.", "score": 1, "replies": [{"body": "It’ll be more like $20k a share, and that’s without FSD", "score": 0, "replies": []}]}]}, {"body": "My theory is the reason it dropped so far in the coronacrash is because so many holding felt it was so high. I also think many who took profits rebought in the coronarebound.", "score": 1, "replies": []}, {"body": "Noob question. If i only have like 1-$2000 to invest. Is it worth getting 1-2 shares of telsa? Or is it to expensive?", "score": 1, "replies": [{"body": "Not a professional, but that would mean you have zero diversification so the answer would be no.", "score": 1, "replies": [{"body": "I would say i have alot of diversification. I have alot invested into VGRO and a few other side stocks.", "score": 1, "replies": []}]}]}, {"body": "The tweet only takes money away from you of you react emotionally and make the mistake of selling even though a tweet is nothing more than short-term noise.\n\nThe last time that Tesla stock dropped because of a Tweet, it started rocketing back up the very next trading day after people came back to their senses and realized that nothing changed about Tesla's long-term prospects.\n\nMy thoughts are that Tesla is going to become one of the most valuable companies in the world over the next decade and you made a mistake by selling.", "score": 1, "replies": [{"body": "I’m not affected by the tweets, the stock is. I know for a fact it’s going to go up, but it’s also overvalued imo compared to other car companies. I know they are “pioneering” electric cars, but once other companies see the headlines they are getting they will no doubt come out with better competition. Next 2 years for Tesla are going to be a rollercoaster going up over 1600 and then back to 700, but after 2 years I don’t know. I just don’t want to sell at the wrong time and lose big. Especially since I’m pretty forgetful.", "score": 2, "replies": [{"body": "They're more than a car company", "score": 0, "replies": [{"body": "I know, but they are mainly a car company. When you hear apple you probably think of iPhones and stuff, and that’s what consumers hear as well. In reality apple is way more than iPhones, just like Tesla is way more than cars. However you have to put yourself in the mind of an everyday consumer. To them Tesla = car company. Which = the stock changing based on their developments in cars and other companies developments in cars. But that’s just my two cents.", "score": 2, "replies": [{"body": "Buy low and hold. Forget about the day to day moves. Do you think Tesla will be here in 30 years? Do you think they will be bigger then they are now? If so buy. If not then don't. That's my strategy anyways.", "score": 2, "replies": [{"body": "Yeah me too, maybe I will buy them in the future when they are a more stable climb, but high jumps and falls are a big no for me.", "score": 2, "replies": [{"body": "Yea I get that. I got some shares a year ago at 237ish. So I feel like I got a good price to gamble with. Bought them in my Roth IRA of all places. Still gota figure out what I want to buy with my 6k this year.", "score": 2, "replies": [{"body": "Nice!", "score": 2, "replies": [{"body": "Lol its been a roller coaster for sure", "score": 2, "replies": []}, {"body": "I can’t get off this ride!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "It’s not really logical, that’s why I posted this, it’s a strange feeling I had that something is going to go wrong on the long term, and I tried to use my reasoning to explain that. I just think it’s too good right now, to be true. But hey, crazier things have happened!", "score": 1, "replies": []}]}, {"body": "You mentioned that you purchased this around 600 and are already looking to sell? Selling it now is the equivalent of selling Amazon before it 1000. Tesla’s valuation is not just based on it being a ‘car company’. You’re forgetting that they are a disruptive company in the automobile industry. Battery tech IS the best, Full self driving is leading compared to other companies and they overall have proven a strong leadership. You should just hold for the long term", "score": 0, "replies": []}]}
{"title": "Tesla Cybertruck pre-orders rise to over 650,000, says new report", "selftext": "", "id": "he2gw8", "created_utc": 1592865425.0, "score": 186, "upvote_ratio": 0.96, "num_comments": 44, "comments": [{"body": "[deleted]", "score": 20, "replies": [{"body": "The question is how many new orders will pop up when it's out on the streets and the youth start instagraming, tik toking, live streaming the truck.", "score": 34, "replies": [{"body": "Agreed. Think in the other direction. People that do not follow Tesla at all. Once they start seeing this truck they'll be like wtf and the orders will flood in.", "score": 11, "replies": []}, {"body": "I imagine people will be able to sell their reservations.  Look at that $100 as a totally refundable investment.", "score": 2, "replies": []}]}, {"body": "I haven't pre-ordered, but I definitely want one... just not sure if I'll definitely have the cash when it becomes available.", "score": 7, "replies": []}, {"body": "i’m estimating initial demand, including those pre-orders, will be around 400k.  That’ll be a mix of pre-orders and new orders based on all of the hype surrounding the initial deliveries.\n\nI really do believe this is on the low end.  I expect Tesla to collect at least another 100k preorders and unless Tesla can’t deliver on what they promised a lot of people are going to like that truck.  Americans like space and this is a cheaper alternative to the X, which can seat 5 (or 6 comfortably).", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Many people continue to buy cars due to lease expirations, others will see a $50k (EV) CyberTruck as a compromise to their usual $70k gas guzzler.  I agree it depends on what happens with this virus, but I think there’s a good probability that we’ll have some sort of vaccine within 12 months.\n\nI’m optimistic that people are back work and the economy has returned in a year and a half, but we’ll see.", "score": 1, "replies": []}, {"body": "The single motor is a ridiculously good deal if you're just bumming around the city", "score": 1, "replies": []}]}]}, {"body": "I pre-ordered one in the UK. I'm hoping to be able to convince them to let me order two (for a business usecase)! Maybe in the place of someone who gives up their order.", "score": 1, "replies": []}, {"body": "I probably won‘t. European roads and parkings are likely too small for that behemoth, but we‘ll see.", "score": 1, "replies": [{"body": "I tried to fit a Model S in my garage and it required me to line it up carefully, stepping out of the car to double check and go in with mirrors folded. Was about 10cm on each side. And my garage is not some old prehistoric one, it was built in 2015.   \n\n\nSo yeah, this will be a big issue with the cybertruck. Also it's quite surprising Tesla has not developed aiding software for entering carports (as in when you're in the car and have to make a sharp turn into a carport, not the summon thing).", "score": 1, "replies": []}]}, {"body": "Long term, 40%-80% will buy a Tesla.", "score": -10, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Broad? It's actually the exact opposite.", "score": -14, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Less than half, to almost all what dont you get?", "score": 11, "replies": []}, {"body": "If you can't understand that it's 60% +/-20% (bull/bear case) I can't help you.", "score": -2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Learn some grammar first.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "my guess would be maybe 5-10% (still 32.500 - 65.000)", "score": -16, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Because the reservation deposit was  low, a lot of People got it but when it comes to actually buy it, they May back out.", "score": -6, "replies": [{"body": ">Because the reservation deposit was low,\n\nYeah, because 650,000+ people are in the habit of typing in their credit card details and throwing away $100 for years with no interest in the product whatsoever. 🤦‍♀️🤦‍♂️\n\nTSLAQ was thruthing about Model 3 reservations as well, and it was a runaway success. I expect the Cybertruck to be similar.", "score": 10, "replies": [{"body": "Refundable $100 for a spot in the queue in case you might want a Cybertruck by the time it comes out. It’s not a stretch that the vast majority won’t convert from pre order to purchase. Myself and I guy I know have reserved a cybertruck, but probably won’t end up buying one. The $1000 pre order price for Model 3 was a lot more substantial, and I did order one of those as soon as I was able.", "score": 3, "replies": []}, {"body": "Model 3 reservations were a significant amount of money. \n\nI ordered a truck. Maybe I'll get it, maybe I won't. Haven't decided yet but I really don't need it and have no use for it.", "score": 3, "replies": []}, {"body": "Man you guys....there is a difference between expressing mild interest and fully committing to spending 40k+ on a new vehicle. 20% max will convert to real purchases", "score": -2, "replies": [{"body": "Conversion is going to be superior to that of the model 3. Why? Because it's a superior product.", "score": 2, "replies": []}]}]}, {"body": "I have 3 friends who put down a deposit the night Of that have NO actual intention of buying the truck. \n\nWell. Maybe one of them if he some how totals his model 3", "score": -1, "replies": []}]}]}, {"body": "I don't think you realized how much that product kicks ass... It's a freaking futuristic stainless beast.\n\n50% will get it minimum.", "score": 4, "replies": []}, {"body": "This is correct and will be compounded by the inevitable build issues the truck will face scaring off even more reservation holders since many will wait to see how they are when they first come out", "score": -2, "replies": []}]}]}, {"body": "I'm one of them!", "score": 15, "replies": [{"body": "Me too!", "score": 11, "replies": []}, {"body": "I’m two of them! But will only buy one.", "score": 7, "replies": [{"body": "Happy to take one of the reservations off your hands if you feel inclined.", "score": 3, "replies": [{"body": "I actually reserved two as well.  Will probably only get one but wanted to have the option just in case", "score": 3, "replies": []}]}, {"body": "Interesting, I wonder how many individual buyers are behind all those pre-orders, it seems people could have preorder like a six pack of these? was there any limit?", "score": 1, "replies": [{"body": "Yea, I agree. I’m not the only one that preordered multiple. I did it purely to lock in prices because I was unsure of which model I want.", "score": 1, "replies": []}]}]}]}, {"body": "TL;DR:\n\n>Now Wedbush Securities analyst Dan Ives is out with a new note to clients today, and he says that the firm puts reservations at now over 650,000 Cybertrucks.", "score": 17, "replies": [{"body": "so it's pretty much just one dude's guess?", "score": 19, "replies": [{"body": "The reservations are sequential and there are trackers where people can report their number.     Dude just read this subreddit or TMC forums.\n\nhttps://sites.google.com/view/tesla-reservation-tracker", "score": 5, "replies": []}]}]}, {"body": "IF 1. I'm still empolyed and 2. my new house mortgage (in the market) isn't outrageous, I'll take delivery.   In any case, while a lot of those reservations may not take delivery,  there's going to be a line for these things, imho, world wide.", "score": 4, "replies": []}, {"body": "Look how many model 3 they sold", "score": 4, "replies": []}, {"body": "Me and my father both preordered! I have the single motor and he wants all the bells and whistles.  I've even been building my credit and saving up for it,  because I've never purchased a new vehicle. I am hoping to have my solar roof by the time they release the cybertruck,  then i'll unload my car,  suv and truck,  since this thing will suit my needs.", "score": 4, "replies": []}, {"body": "I am one, purely because FSD price hike.", "score": 2, "replies": []}, {"body": "Two of those are mine and I’m not sure I’ll actually order either lol. Just couldn’t make up my mind which model I wanted, or any at all. But for 100 bucks each, I can lock in my pricing.", "score": 4, "replies": [{"body": "You can change your config so might as well just keep one. But holding a reservation is more about securing your place in line. The first CT *might* roll off the line in late 2021. More likely early 2022. In the first year they will make 100K trucks. In 2023 they will make 200-250K. Maybe they scale to 400K in 2024. They will just then be exhausting pre-orders and people who jump in line as soon as they start to see them on the street. So if you wait too long you're looking at getting one in 2025 or later.", "score": 3, "replies": []}, {"body": "Where did you see that it locks in your pricing?", "score": 1, "replies": [{"body": "Probably referring to FSD: \"Selecting Full Self-Driving today will secure your price as it increases in the future.\" I did the same. $100 hedge against the future.", "score": 3, "replies": []}]}]}, {"body": "Has anyone else here gotten a call from Tesla on their reservation? A friend of mine in California got a call yesterday on his tri- motor reservation... I'm waiting to hear back from him with more details, but he said he was quoted loan terms, and was told to expect a 2020H1 delivery. He has a very low reservation (he got through the reservation page within the first 30s of reservation opening), reserved the tri-motor, and lives pretty close to Fremont.", "score": 1, "replies": []}]}
{"title": "MSFT 200c 26JUN20", "selftext": "[removed]", "id": "hdrwea", "created_utc": 1592830765.0, "score": 12, "upvote_ratio": 0.67, "num_comments": 45, "comments": [{"body": "“I’m buying calls because I think it’s going up” \n\nFantastic DD", "score": 37, "replies": [{"body": "up 92% gggg", "score": 1, "replies": []}]}, {"body": "Lots of us still living with trauma", "score": 23, "replies": [{"body": "*Audible Shudder*", "score": 5, "replies": [{"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "The last time we hyped MSFT 200c the stock went down to 136", "score": 22, "replies": [{"body": "So what you are saying is we should hype it up again so we can get another sweet buying opportunity on the dip", "score": 13, "replies": [{"body": "this guy fucks", "score": 3, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": []}, {"body": "MSFT posts get my dick hard", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": []}]}]}, {"body": "up 92% gggggg", "score": 2, "replies": []}]}, {"body": "Wait for a better entry point when it tests its support. \n\nNow is a good time for hotels since they will start reopening in many desirable locations.", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "Ok Bill, nice try but we are not falling for that again.", "score": 27, "replies": [{"body": "Currently holding 10 7/2 202.5c.  I fell for it again.  Am retarded", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "Microsoft 120 July confirmed", "score": 5, "replies": [{"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "I'm still recovering from last week stfu with that msft 200 shit, it brings bad juju on us all", "score": 4, "replies": [{"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "the dumbest part about this is that back when the MSFT 200c 3/20 gang was spamming WSB, some people that had a bit more sense were buying MSFT 200c 6/19's and on 6/19 MSFT hit something like $199.60 or some shit. so some people actually were damn close on their price prediction lol. anyone who bought 6/19 180s did pretty good if they held", "score": 3, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": [{"body": "lol why did you post this to both of my comments", "score": 1, "replies": []}]}]}, {"body": "Up 92% wow. GGGGGGG", "score": 2, "replies": []}, {"body": "I’m a big believer in MSFT stock and was heavily invested in MSFT 180c 1/15 until Friday when I sold 75% of them. I think it will bounce off 200 for a couple weeks before breaking through. September 200c look more enticing", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 1, "replies": []}]}, {"body": "“I can’t believe WSB keeps falling for this play lmao”\n\n*Checks PCG calls*", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": []}]}, {"body": "lol MSFT 200", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": []}]}, {"body": "Even if you don’t think anything will effect them, broad market crashes still effect almost everything like it did Thursday before last. Could happen anytime", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": []}]}, {"body": "How many times are we going to have to teach you this lesson old man????", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": []}]}, {"body": "good luck with ur autistic play", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 2, "replies": []}]}, {"body": "MSFT will reach 200 just make sure you give it enough time. Weekly s are not my bet here", "score": 1, "replies": [{"body": "up 92% gggggg", "score": 3, "replies": [{"body": "I m up 150 percent with the Leaps in about 2 months. Great it worked out for both of us.", "score": 1, "replies": []}, {"body": "Say it louder for the 🌈🐻s", "score": 1, "replies": []}]}]}]}
{"title": "Micron Technology (MU) June 29 Pandemic Earning Play", "selftext": "# Micron Technology\n\n**What is Micron Technology?**\n\nMicron Technology, Inc. is an American producer of computer memory and computer data storage including dynamic random-access memory, flash memory, and USB flash drives. It is headquartered in Boise, Idaho.\n\n**How the coronavirus plays in**\n\nInternet usage and online consumerism has skyrocketed during this stay at home virus, we see everyone's mama and baby mama using zoom/online conferencing for chatting with their grandparents to politicians giving 2020 guidance in their pajamas. Businesses are either paying to use these services or paying to upgrade their systems to handle the crazy surge of need. This is were Micron Technology steps in. They are producing memory drives for these big computers that uses crazy amounts of memory. Consoles are sold out every. Everybody and Everything needs to use these chips. Donald Trump also stated with the China tensions he wants to move these chip stocks back into the Americas so deals may be completed to motivate factories to be opened in America. If we all remembers Micron Technology had rumours about moving a factory to America already.\n\n&#x200B;\n\n**Earnings**\n\nEarnings are June 29th.  With Powell Printer printing expecting a great pre earning runup.\n\n \n\nhttps://preview.redd.it/jblnr4qv2i651.png?width=1360&format=png&auto=webp&s=33fb7ec52540c8ed3d5ef97c65ed83292d589d53\n\n**Previous Highs**\n\nBack before coronavirus we got highs of $61. We have Wells Fargo place a price target of $65. With Morgan Stanley at $63. Price is at $51 now. We see a similar company in intel at an ATH, and although it is not a direct correlation we can see commonalities in similar positive performance. I see MU  catching up to intel.\n\n&#x200B;\n\n**What I'm Doing**\n\nI'm going to be buying $57.5c 7/17. Looking at all the variables it is pointing towards a new ath and a premarket runup due to the surge of the need of chips. Chipmakers are making bank on coronavirus demands and with that I will be playing the preearnings runup.", "id": "hdx87j", "created_utc": 1592848701.0, "score": 24, "upvote_ratio": 0.79, "num_comments": 44, "comments": [{"body": "I’m sure you worked real hard on all this, but understand something; $MU has lost people on this forum more money than probably any other stock. We’ve moved on. It’s not 2018 anymore.", "score": 71, "replies": [{"body": "> It’s not 2018 anymore.\n\nDamn it has been awhile. I remember getting in on the MU meme train and decided to do stock instead of options. bought at like $42 back in 2018. Held that MF for like year and a half in the red 95% of the time. sold it at break-even accomplishing nothing but tying up capital for 1.5yr. I came out with nothing and still ended up better than most here lol.", "score": 23, "replies": [{"body": "Yep. Went FDs, lost money. Longer dated, lost money. Finally wrote puts... And, wait for it, lost money.", "score": 10, "replies": []}, {"body": "Lmfao dude majority of people who were investing in $MU back then went through the same thing. (Myself included)", "score": 5, "replies": []}, {"body": "yeah... not even a div to collect. That sucks but at least you got out with a cheap lesson.", "score": 1, "replies": []}]}, {"body": "RIP Marty...", "score": 19, "replies": []}, {"body": "Yeah fuck MU, I never got in but I remember what it did to people", "score": 5, "replies": []}, {"body": "What, people can only post about the Hot stocks? That's stupid", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 59, "replies": [{"body": "I wish we could beat up OP", "score": 17, "replies": []}, {"body": "Time is a fuckin flat circle", "score": 8, "replies": []}, {"body": "This is amazing", "score": 3, "replies": []}]}, {"body": "listen bud, i've lost $4,000 of my own money and $3,000 of a friend's money to this stock doing these plays...\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nwhich is why I got MU $60C 10/16 \n\nsee ya on the moon fellow astronaut", "score": 55, "replies": [{"body": "Oof on friends money, that hits different", "score": 1, "replies": []}]}, {"body": "I work in the sector.. they have raised prices and their lead times are long due to super high demand.  NOt sure how that will translate.. their stock isn't much off from it's high.", "score": 14, "replies": []}, {"body": "Everyone forgets *why* MU was supposed to hit $90.\n\nIt was the 3D XPoint junk that never really displaced cheaper solutions that were \"good enough\" from the market.", "score": 14, "replies": [{"body": "Probably also had something to do with making $12B profit in one year. Roughly the same as AMZN that year.", "score": 6, "replies": [{"body": "Amazon isn't the company to use as a bench mark for \"making a profit\".", "score": 3, "replies": [{"body": "Feel free to substitute with any other company that made $12B profit that year.", "score": 2, "replies": []}]}]}]}, {"body": "No.... not MU again", "score": 13, "replies": [{"body": "Yes Charlie Brown, but this time it will be different. I SWEAR", "score": 8, "replies": [{"body": "You liar!", "score": 2, "replies": []}]}]}, {"body": "I would hire a bully to beat you up.", "score": 9, "replies": []}, {"body": "I'm getting killed on $58.5c 6/26.", "score": 6, "replies": [{"body": "I have the $55 7/2’s and have been sodomized the past week", "score": 4, "replies": []}, {"body": "Yep same", "score": 3, "replies": []}, {"body": "i've been donkey punched by my $60c 7/17's", "score": 2, "replies": []}]}, {"body": "A trader spent 1.5 mil on $52.50c jul 17. Just saying if this shit doesn’t print there’s gonna be some angry people out there lol.", "score": 5, "replies": [{"body": "what's his username?", "score": 3, "replies": [{"body": "https://finance.yahoo.com/news/micron-option-trader-bets-1-184014857.html?.tsrc=rss", "score": 3, "replies": []}]}]}, {"body": "**I have identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|\n|:-|:-|:-|:-|:-|:-|\n|**MU**|**$57.5**|**BUY CALL**|**2020-07-17**|**$1.06**|**$51.1798**|\n\n[You can see the current real time return on investment of this pick here.](https://www.pickmojo.com/pick/ckbqt1u7s9uta0776jh4ww9tr)\n\n[You can see this users current track record and total ROI here.](https://www.pickmojo.com/user/fatassray/)\n\n\n**I am a bot, if I have some information wrong please correct me by replying to this post, and I will learn from it, my owner is monitoring these posts. Thank you!**", "score": 5, "replies": []}, {"body": "I did a DD before the COVID crash. I lost money. Then I bought back, a glutton for more punishment. The run up made me money. MU is like that girl you can't forget.\n\nMy DD:   \nDatacenters + work from home + pc build because we got nothing to do + PS5 and Xbox ramp up + 5G phones + Amphere and next gen Navi = tons and tons of memory.\n\n6000 shares and 55c 7/17.", "score": 3, "replies": []}, {"body": "7/2 52c checking in. Got on last week around 1.25", "score": 3, "replies": []}, {"body": "I would rather continue to gamble on AMD instead 60c 7/10", "score": 3, "replies": []}, {"body": "Bought 10  7/2 55c today for .30. It’s about ready to fly to 60", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/fatassray don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "ill just leave this here  [https://www.thelayoff.com/micron-technology](https://www.thelayoff.com/micron-technology)", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit Inc. has banned Seeking Alpha articles because their payout model strongly encourages spam. \n\nTo get around this, please repost your comment/thread with the link removed. \n\nYou may wish to copy and paste the full article if it adds necessary context to your post. If so, please include the link with a space in the domain (e.g. \"seek ingalpha.com/...\")\n\nWe apologize for any inconvenience this may have caused.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "!remind me 7/17", "score": 1, "replies": [{"body": "**SoaringIcarus** , kminder in **23 days** on [**2020-07-17 00:00:00Z**](https://www.reminddit.com/time?dt=2020-07-17 00:00:00Z&reminder_id=3ec2e0066d884a5aa1c6a134fe69f16b&subreddit=wallstreetbets)\n\n> [**r/wallstreetbets: Micron_technology_mu_june_29_pandemic_earning_play**](/r/wallstreetbets/comments/hdx87j/micron_technology_mu_june_29_pandemic_earning_play/fvsuog5/?context=3)\n\n> kminder 7/17\n\n[**1 OTHER CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-07-17T00%3A00%3A00%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Fhdx87j%2Fmicron_technology_mu_june_29_pandemic_earning_play%2Ffvsuog5%2F) to also be reminded. Thread has 2 reminders.\n\n^(OP can )[^(**Delete comment, Update message, and more options here**)](https://www.reminddit.com/time?dt=2020-07-17 00:00:00Z&reminder_id=3ec2e0066d884a5aa1c6a134fe69f16b&subreddit=wallstreetbets)\n\n**Protip!** You can view and sort reminders by created, delayed, and remind time on Reminddit.\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21)", "score": 1, "replies": []}]}, {"body": "This aged well, how’s it looking op?", "score": 1, "replies": []}, {"body": "thank you retard for this dd, printed large", "score": 1, "replies": []}, {"body": "I live in Boise, micron is constantly laying people off, barely scrapping by. I do not trust", "score": 1, "replies": [{"body": "I checked, no layoffs this year. Last year yes.", "score": 4, "replies": []}]}]}
{"title": "COTY DD: If you’re gonna hold your wife’s bag, you should put on the lipstick too", "selftext": "NOTE: This is not investment advice. Do your own research.\n\nIf you’re retarded like me, you bought at the top and are looking for a way out. This DD will require a 3rd grade degree to connect all the dots.\n\n**The Power of Makeup**\n\nAlthough the market is currently under stress, cosmetic goods remain popular. The cost of consumer retail makeup is still low (e.g. $5 for mascara, etc). The general cost aided with the institutional desire for women to wear makeup, keeps the demand for makeup inelastic. Enabled by the opportunities of a recession, Coty can establish gains in retail cosmetics.\n\nCoty’s consumer retail cosmetic businesses include: Kylie Cosmetics, CoverGirl, and Rimmel London. Please note that Kylie Cosmetics pricing is at a premium compared to the more modestly priced CoverGirl and Rimmel products.\n\n**Big Booty Bounce?**\n\nJune has brought more fizzle than pop in the stock market. This has been a welcome surprise to some and complete dread to others. It is abundantly clear the market has slowed down. The impact of this slow has seen money move away from the retail stocks that flourished from their dramatic rise in April and May.\n\nAs retail stocks slowly pull away, we are still seeing positive trends elsewhere. Stocks that can generate momentum are being featured in the news constantly. One that sticks out at this moment is SPOT. After announcing the Kim Kardashian deal last Friday (6/18) the share price rose 4%. Even though Kim is the one everybody loves to hate, even she can generate hype in the media. Through Kim’s recent traction in the media, Coty’s stock is positioned to rise as well. (https://www.wsj.com/articles/kim-kardashian-west-lands-podcast-deal-with-spotify-11592427337)\n\n**COTY in the News**\n\nCOTY in the news has made significant changes over the last month:\n\n\\- Introduction of CEO Peter Harf: Peter was announced as the CEO of Coty between 1993 and 2001. This was promptly after Coty’s buyout in 1992; sales were estimated at $280 million at the time. Coty has only grown since then under Peter’s direction as Chairman from 2001 to today and he has returned to lead the helm through the recession. (https://finance.yahoo.com/news/peter-harf-takes-helm-coty-120138837.html)\n\n\\- KKR purchased 60% of Coty’s retail and professional hair care business for $1 billion direct and $2.5 billion in net cash proceeds. Nobody can deny that liquidity is king for any company right now and Coty was quick to capitalize. These new assets will create enough runway into 2021. (https://www.businesswire.com/news/home/20200601005387/en/Coty-Announces-Strategic-Transformation-Definitive-Agreement-KKR)\n\n\\- Rumors are circulating around possible KKW Beauty buyout. Seed Beauty (currently partnered with KKWB) is suing KKWB as they feel threatened by Coty’s buyout potential. Seed Beauty was also partnered with Kylie Cosmetics before they were bought out by Coty in 2019. (https://www.tmz.com/2020/06/19/kim-kardashian-west-beauty-sued-kkw-trade-secrets-seed-beauty-coty-kylie-cosmetics-espionage/)\n\n\\- Kylie Cosmetics announces partnership with sister Kendall. The partnership will feature an entire line of products centered around Kendall. The promotion for this partnership was announced yesterday (6/21) and garnered #15 trending on YouTube. (https://www.allure.com/story/kendall-jenner-kylie-cosmetics-collection-collaboration-new-products)\n\n**Connecting Dots**\n\nI hate the Kardashians. Who doesn’t? But it’s time to put your edge-lord fedora away and understand that they are a brand name which can generate hype. Turn your Kardashian hate into an opportunity to make money off their marketing carpet bomb. They will keep rolling out the news hype into announcing a deal between KKWB and Coty over the next month.\n\nMakeup is still considered a mandatory item for females and still has opportunity for sales during a recession. With a new line of makeup from Kylie x Kendall and a heavily implied partnership with KKW Beauty on the back of Kim’s Spotify deal, Coty is cheap DD.\n\nBing, Bang, BOOM! Let’s make some money.\n\n**TLDR;** With sentiment growing towards news/hype based movement in the stock market. The Kardashians are creating a domino effect of media and hype which works. BUY THE DIP RETARD!\n\nCOTY 6C 7/17", "id": "hdy3za", "created_utc": 1592851368.0, "score": 34, "upvote_ratio": 0.78, "num_comments": 46, "comments": [{"body": "**I have identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|\n|:-|:-|:-|:-|:-|:-|\n|**COTY**|**$6**|**BUY CALL**|**2020-07-17**|**$0.16**|**$4.605**|\n\n[You can see the current real time return on investment of this pick here.](https://www.pickmojo.com/pick/ckbquu4k2aeft0776cl606s6q)\n\n[You can see this users current track record and total ROI here.](https://www.pickmojo.com/user/HerroKittyTime/)\n\n\n**I am a bot, if I have some information wrong please correct me by replying to this post, and I will learn from it, my owner is monitoring these posts. Thank you!**", "score": 21, "replies": [{"body": "I dont got 16 bucks", "score": 14, "replies": [{"body": "Go ask your mom for more allowance", "score": 5, "replies": []}]}, {"body": "Yo this is kinda fucking sick", "score": 4, "replies": [{"body": "Thanks!", "score": 3, "replies": []}]}]}, {"body": "I hate them as well but wiling to forgive for tendies. I'm in.", "score": 19, "replies": []}, {"body": "Hmmm.. you look at the chart? Its shit", "score": 12, "replies": [{"body": "What's shit about it?  Looks different to me", "score": 2, "replies": [{"body": "Downtrending since IPO. Sure you can possibly make a few bucks but it's been a weak performer.  Want to go long? Buy elf", "score": 8, "replies": [{"body": "trade here until 6.50.. all im saying", "score": 2, "replies": []}]}]}]}, {"body": "How much long term debt do they have? What are their interest expenses? I like this but I need some more details.", "score": 9, "replies": [{"body": "Loads of debt, somewhat offset by the recent sale of their KKR hairline branch\n\nBut COTY lacks meaningful leadership, they're a pump/dump with volatility.", "score": 4, "replies": []}]}, {"body": "Don’t fuck me OP", "score": 7, "replies": [{"body": "You fuck yourself bruh this isn’t a financial advising company", "score": 1, "replies": []}]}, {"body": "You a Hikaru fan?", "score": 7, "replies": [{"body": "Hikamaru satisfies my blitz obsession", "score": 7, "replies": []}]}, {"body": "Counterpoint.\n\nMost of the women I work with who wear a lot of makeup, have not been wearing it in our video meetings as we work from home.\n\nDisclaimer: I am a COTY 7c bagholder, but am loosing confidence that they will ever recover.", "score": 6, "replies": [{"body": "There are several factors that can determine whether someone will wear makeup in this time period. While I would like to dive deep into it, I've typed quite a bit today. I will focus on age and relationship status as a key in my argument.\n\nKylie Cosmetics, CoverGirl, and Rimmel are retail cosmetic goods which can be purchased at your local grocery store or online. These brands typically promote young women as that is the primary demographic which will continue to purchase cosmetic goods. In short, young single women still give a shit about their looks.\n\nAre your female coworkers single? Do they have children? While makeup sales have taken a hit, the hit is not so severe that Coty will be unable to weather the storm.\n\nOverall I will maintain a bullish sentiment for Coty past my option play. The resources which I provided are merely a guide, you will have to personal research as well.", "score": 2, "replies": [{"body": "The women I am talking about vary in age and relationship. Early-mid 20s to early 30s. Obviously this isn't intense DD, just a trend I noticed with women I am used to seeing wear makeup every day", "score": 1, "replies": []}]}, {"body": "Women are not wearing makeup if they work from home. Skincare is big but I don't think Coty's brands have much of that (Kylie skin is junk)\n\nEdit: does Coty have brands with at-home hair kits or glue on nails? Because those have been big with salons closed. Glue on nails totally sold out not too long ago.", "score": 1, "replies": []}]}, {"body": "coty only going down", "score": 6, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "I took a 15% haircut with this fucker this month. Don’t believe the hype", "score": 5, "replies": []}, {"body": "You bastard, I'm in.", "score": 3, "replies": []}, {"body": "6/19 calls mooning? Nice! Bout time I catch a break", "score": 3, "replies": []}, {"body": "krispy kreme’s own business is a failure, investing in Coty is a retarded idea, but I guess that’s why you’re here.", "score": 6, "replies": [{"body": "Coty has been in mostly the single digit range ince 2018 with competitors more valuable, doesn't make sense unless there's a buyout.", "score": 6, "replies": []}]}, {"body": "This shit gets posted every week.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/HerroKittyTime don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I gave my wife a CC just to see what she would buy with it. \n\nBaby clothes, baby books, and makeup.  Lots and lots of makeup.  Brushes.  Sponges.  All that stuff.", "score": 1, "replies": []}, {"body": "Any idea how much their fragrance division makes up? That's a market that's collapsed.", "score": 1, "replies": []}, {"body": "COTY needs to change its business model and ride the Kardashian/Jenner train hard.\n\nIf they can move to social media advertising and online distribution, they will tenbag.", "score": 1, "replies": []}, {"body": "I've watched COTY bounce between $4 and $7 enough to justify spending my last $22 on this. Tight", "score": 1, "replies": []}, {"body": "I’m in.\n\nWill call my girlfriend ugly to encourage her to buy COTY products.\n\nLet’s do this.", "score": 1, "replies": []}, {"body": "Great call", "score": 1, "replies": []}, {"body": "I jumped in this as well I got the\n\n COTY 5C 8/21\n\nGreat DD I think the same. \n\nNice.", "score": 1, "replies": []}, {"body": "Good stuff. I'm in", "score": 1, "replies": []}, {"body": "Good DD but time horizon is all wrong, you have to wait for people to actually go outside and do something called dating you fag. Tinder usage is surgeing now, people are becoming horny, wait maybe 3mo and boom!", "score": 1, "replies": [{"body": "Dating is not the only context in which women wear makeup. Not everyone has given up like your wife.\n\nYoung girls full of energy are still taking selfies for Chad and Tanner. There are plenty of women that will wear makeup if they expect to be seen in person or on Zoom. Ask all your female friends, \"When was the last time you purchased makeup?\"", "score": 6, "replies": []}, {"body": "You'd be amazed how many women put on full makeup for video calls and to simply run errands. Also went to a mid level restaurant this weekend and everyone, men and women, were dressed up beyond normal attire. Just saying, dating isn't the top reason women wear make-up", "score": 2, "replies": [{"body": "Mind blown. (My post was meant as a joke but yeah) mind blown", "score": 1, "replies": []}]}]}, {"body": "I don't listen to anyone on becky stocks unless they are a becky. Are you a becky?", "score": 0, "replies": []}, {"body": "You suck OP literally posts this on the day of its highest spike then slowly bleeds then deal is announced and I barley got out breaking even loosing 60$ profit and 60$ in commission fees, was a good call but would’ve been better to buy this on Friday so I could’ve doubled my money", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Learn to read the day he posted it was the peak he was expecting it to go to 6$ not drop to 4$ then go up on news everyone who invested on this “dip” lost money or broke even", "score": 1, "replies": []}]}]}]}
{"title": "Guaranteed Million Dollar Strat", "selftext": "Amazon is releasing Q2 earnings on July 23. Put 1/4 of your life savings into July 24 calls right before the reports (NOT NOW!). When they come out, big profits confirmed. If Amazon performs under expectations and falls (which it probably won't, right???), just invest the remaining 3/4 of your life savings into July 31 options. If you don't put your entire life savings into this, you will regret it!", "id": "he3mgq", "created_utc": 1592869561.0, "score": 15, "upvote_ratio": 0.67, "num_comments": 41, "comments": [{"body": "The majority of this sub can’t afford one contract of AMZN that far out.  Solid DD", "score": 85, "replies": [{"body": "Came here to say my entire life savings won't buy me a contract ☹", "score": 27, "replies": []}, {"body": "I own some fractional shares", "score": 8, "replies": [{"body": "When does RH ‘Fractional Contracts’ drop?!?", "score": 15, "replies": [{"body": "Haha I was thinking the same thing. Instead of 100 contracts, break it up to 25", "score": 9, "replies": []}, {"body": "Not sure about fractional contracts just picked up fractional shares last week", "score": 2, "replies": []}, {"body": "That's impossible. Fractional shares only work for things that don't expire", "score": 1, "replies": []}]}, {"body": "The complete lack of punctuation made this particularly funny the innocent way I read it lolol", "score": 3, "replies": []}]}, {"body": "Bruh, buy the calls right before the reports, not that far out.", "score": 6, "replies": [{"body": "Yeah cause the premiums right before won't be nkla status right? Foh", "score": 5, "replies": [{"body": "Depends how OTM ur willing to go", "score": 1, "replies": [{"body": "Oh right, way OTM and 1 DTE. What could go wrong?", "score": 5, "replies": [{"body": "Absolutely nothing. Clearly he's teaching us how to get free money", "score": 3, "replies": []}, {"body": "Lower premium = lower chance of winning. Think of it as buying a lottery ticket. More fun like that!", "score": 1, "replies": []}]}]}]}]}, {"body": "Get on that eurotrash fractional micro-option bullshit for those Deutschland gains.", "score": 1, "replies": []}, {"body": "Go for 3000s, that’s a psychologically desirable level that should be relatively cheap.", "score": 1, "replies": []}]}, {"body": "Did you miss the earnings call where Lex Luthor said Amazon was going to be reinvesting earnings into the company for a while (\"take a seat\") or are you just looking for attention, little guy?", "score": 15, "replies": []}, {"body": "So show your positions, or ban", "score": 11, "replies": []}, {"body": "I have 4$ in life savings", "score": 10, "replies": [{"body": "Bragger", "score": 9, "replies": []}, {"body": "Oh, look at mr money bags over here flaunting his money to us poors.", "score": 2, "replies": []}]}, {"body": "Do you not fucking remember what happened Q1..AMZN’s last earnings...fucking shit the bed so hard. Ended up Losing $10k on a single contract..please remortgage your house retard, really looking forward to that loss porn.", "score": 8, "replies": [{"body": "I’m not in favor or against the method because it’s pure gambling but if you’d tripled down after earnings, then the stock went up $150-170 by that following Friday following that $190 earnings loss.", "score": 1, "replies": []}, {"body": "BRO, that just means that people have lower expectations for Amazon. Don't doubt my 300 IQ logic, this plan is foooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooolproof.", "score": -6, "replies": []}]}, {"body": "Bezos is going to do everything in his power to tank earnings... If he makes a ton of money in an election year while everyone is getting locked down then policymakers are going to come down on him harder than they did on Gates in '01.\n\nNot sure how high it will go in the run-up but on 23 JUL ill put a quarter of my account on puts 1.5% OTM. May the best autist win.", "score": 5, "replies": [{"body": "Positions or ban.", "score": 1, "replies": [{"body": "Thats fair. Ill post on 23JUL", "score": 2, "replies": [{"body": "Obviously earnings wasnt  on the estimated date at the time of this post so I didn't try this play on 23 JUL. It was always a day of earnings play looking for a big move.\n\nGoing to pick up AMZN 3150p 7/31 if they go below $100 today. I only think it will hit that price if AMZN runs up to 3200 before close. The antitrust hearings took all the profit out of this play. But I will try it anyway if the market gets enthusiastic at end of day. Best of luck autist. \n\nAlso, I made big profits on calls over this month and I feel obligated to point out that no matter which way this goes OP was stupid to suggest that anyone should have waited to buy calls til now", "score": 1, "replies": []}]}]}]}, {"body": "Any post that starts with “guaranteed” is guaranteed bullshit", "score": 7, "replies": [{"body": "How dare you not invest your life savings into this ∞ IQ strategy?", "score": 0, "replies": []}]}, {"body": "How many of y’all would do it if y’all had the money? 🙋🏻‍♀️", "score": 3, "replies": []}, {"body": "Did your legs fall asleep in the time that it took you to type this out? This half baked idea could have only been conceived while shitting on the toilet.", "score": 3, "replies": []}, {"body": "Too late - earnings are priced in. You should be looking at calls 4-6 months from now.", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/Akshay537 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I’m kinda sorta down", "score": 1, "replies": []}, {"body": "Thanks will do that", "score": 1, "replies": []}, {"body": "Amazon FD calls? On *my* WSB?", "score": 1, "replies": []}, {"body": "i'm at -12.83", "score": 1, "replies": []}, {"body": "Can we ban this cuck", "score": 1, "replies": []}, {"body": "Might take another month or two but long term not a bad play for the risk", "score": 1, "replies": []}, {"body": "Faggot", "score": 0, "replies": []}]}
