{"title": "Here we go! AAPL $1001 target", "selftext": "Topeka Capital Management has put a new target of $1001 on Apple Inc. (NASDAQ:AAPL) as the firm continues its reign as the world’s most valuable company. Topeka said that the company should meet the price target in the next twelve months. The price target is one of gigantic proportions. The analysis sees the company taking in around $160 billion in revenue this year and having an earnings per share of around $44.61. Apple at $1000+ has been talked about before though those estimates are usually in a longer range, most suggesting a 2015 date.\n\nhttp://www.valuewalk.com/2012/04/apple-inc-aapl-target-now-1001-says-topeka/", "id": "rpq2y", "created_utc": 1333385691.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 11, "comments": [{"body": "This reminds me of shades of 1998.... Caveat Emptor......", "score": 2, "replies": []}, {"body": "I saw that article too. \n\n$630 Calls have become extremely valuable too.", "score": 1, "replies": []}, {"body": "At 44.61 EPS, for AAPL to be $1000 the PE ratio would have to expand to 22.42 from its current 17 range. That is going out on quite a limb.\n\nI'm more conservative on price per share, and more aggressive on EPS. I see EPS around 50, and share price around 800, with PE compressing to 16.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Would you enter a long term position at 21x?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think that's exactly why it's not going to trade at that level. Nobody wants to pay fair value.", "score": 1, "replies": [{"body": "This should be obvious: it's not fair value until it actually reaches fair value.", "score": 1, "replies": [{"body": "Plus, you haven't made any money until you sell for more than you paid.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "wow 12 months?", "score": 1, "replies": [{"body": "Yes.. that is surprising. It should be less, at this rate of climb it should be 6 months. :P", "score": 1, "replies": []}]}, {"body": "There was another article about how this guy just left a small firm and joined another small firm and is trying to promote... something. I believe that before a $1000 price for AAPL.", "score": 1, "replies": [{"body": "That makes sense, its common practice.", "score": 1, "replies": []}]}]}
