{"title": "$TSLA Daily Investor Discussion - December 12, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "e9lbmu", "created_utc": 1576141936.0, "score": 23, "upvote_ratio": 1.0, "num_comments": 237, "comments": [{"body": "Hate crossposting, but wanted to put this somewhere more visible.\n\nBuried in Electrek's [Tesla Model Y production on track for 1,000 per week in mid-2020, analyst says after factory tour](https://ww.electrek.co/2019/12/12/tesla-model-y-production-on-track-mid-2020-analyst-factory-tour/) is this:\n\n>Kallo also noted that he expects FCA to give ~$150 million per quarter to Tesla for European emission credits starting in the next quarter. That’s a deal that has been rumored for a while now and could make Tesla up to $2 billion over the next 2 years.\n\nThis is the first time I think we've had any commentary on what we expect the FCA deal to be on a quarterly basis.", "score": 22, "replies": [{"body": "Every time I hear about the FCA credits it sounds like a huge deal to me and then I feel like everyone else downplays it. What am I missing? Seems like a huge amount of money (at least in terms of swinging the needle from almost-profitable to profitable for TSLA).", "score": 10, "replies": [{"body": "I feel the same way, that it's downplayed.\n\nPart of the reason might be that until FCA cuts that first check, there's a chance that all the OEMs protest to the EU with something that goes like this:\n\n \"WAIT! MERCY! We get it, and we're working on the problem. We're close and just need a little more time. Please delay the penalties by a year, otherwise you'll destroy us!\"\n\nI think until money actually leaves FCA and goes to Tesla, there's still a chance the EU pauses the penalties. But once FCA starts paying, you can't easily stop it, because then you're punishing FCA for doing the right thing.\n\nNot an expert, just my 2 cents.", "score": 9, "replies": [{"body": "If Tesla had halfway decent lawyers and negotiating leverage, the sale of credits would not be conditioned on the applicability of the fines, and the deal was done and contractually committed months ago.", "score": 3, "replies": [{"body": "That’s two big ifs! I’m sure the conditionality of the credits and associated risk impacted the negotiated price.", "score": 2, "replies": []}]}]}]}, {"body": "150M$ is about the same as selling 15,000 more model 3s. I mean that's pretty nutty significant.\n\nAlso, 150M$ \\* 8 = 1.2B$ so .... ?!", "score": 4, "replies": [{"body": "This 150M$ could be the difference between profit and loss, correct? It is recognizable capital for the quarter?", "score": 3, "replies": []}, {"body": "Yeah, I mean, if they do another deal with another OEM and then add the US ZEV credits, they can almost build the next GF with just emissions credits.\n\nThat's insane, and really becomes a negative feedback loop for anyone not meeting current emissions standards.", "score": 3, "replies": []}, {"body": ">Also, 150M$ \\* 8 = 1.2B$ so .... ?!\n\nGuessing it will scale up every quarter as government pressure increases", "score": 1, "replies": []}, {"body": "Also, the FCA CEO said that Tesla will account for 80% of their emissions targets for 2020 but that should drop to 15% in 2021. Especially if you consider the fact that requirements should get more stringent in 2021, that would imply that FCA is planning to ramp EVs significantly in 2021, meaning that 2020 should see the majority of that revenue. Given that it's dependent on EU receiving cars, and Q1 lining up to be a big quarter in non-NL EU, I'd expect that Q1 should see >$300M in FCA credits, but that's all guesswork and maybe this guy knows more than I do.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "Very bonkers. What else is bonkers is that the dude goes to Nobu in a Cybertruck given how many companies and people would benefit from him being killed. Sounds crazy but I’m actually worried about this. How do we convince Elon to get presidential-style security?", "score": 15, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Touché!", "score": 2, "replies": []}, {"body": "Should be fine as long as nobody throws steel balls at the windows.", "score": 1, "replies": [{"body": "They “don’t go through”", "score": 2, "replies": [{"body": "Correct. Also, even without a CBRTRCK, Elon seems to withstand all kinds of sledge hammers.", "score": 1, "replies": []}]}]}]}, {"body": "He already has some serious security.\n\nYou can see them at any of the product unveilings he does, as well as in some of the pictures from the court case against Unsworth. Apparently his security checked out the entire courthouse even though there was security at the entrance already checking everybody entering the building.", "score": 9, "replies": [{"body": "Very cool. \nYa I’m liking what I’m seeing. Terrifying huge Russian guy. Odd job style short stack who looks even more dangerous. Plus lots you can’t see I’m sure. But how does someone get this close to do a YT video on the highway? Just saying! \n\nhttps://youtu.be/tr3HcpiDLyc", "score": 0, "replies": [{"body": "What are they going to do, run it off the road?", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "*elon sheds a proud tear*", "score": 2, "replies": []}]}]}]}]}, {"body": "Didn't he have an escort with him?", "score": 3, "replies": [{"body": "No that's Grimes", "score": 13, "replies": [{"body": "Lol I see what you did there", "score": 6, "replies": []}]}, {"body": "We need like 10 Liam Neesons with him for me to feel comfortable.", "score": 10, "replies": []}, {"body": "Yeah there was a lead car, not sure about the rear.", "score": 1, "replies": [{"body": "Wasn’t there a Model S behind him?", "score": 2, "replies": [{"body": "Per above looks like it.", "score": 1, "replies": []}]}]}]}, {"body": "In one video I saw guards. He had a tailing Tesla when leaving too.", "score": 2, "replies": []}]}]}, {"body": "Configured a Model 3 today, 5-8 week wait.\n\nEdit: San Antonio, Texas", "score": 18, "replies": [{"body": "Im also in San Antonio, could you give me a ride in it? Never been in one and want to convince my wife to get one", "score": 6, "replies": [{"body": "When I get it, Absolutely!!", "score": 7, "replies": [{"body": "what a nice guy", "score": 3, "replies": []}]}, {"body": "Go for a test drive!", "score": 5, "replies": []}]}, {"body": "California: 2 weeks\n\nRest of the US: 5-8 weeks\n\nIt's been like this since yesterday.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "sell the stock??", "score": 1, "replies": []}]}, {"body": "In usa?", "score": 0, "replies": [{"body": "Yup in Texas.", "score": 2, "replies": []}]}, {"body": "USA?", "score": 0, "replies": [{"body": "Yes, TX", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "So. Much. Resistance.", "score": 4, "replies": [{"body": "Not really..  the volume is super low", "score": 2, "replies": [{"body": "~1.25M/hour isn’t that low... Pace is just about in-line with daily average.", "score": 3, "replies": []}]}]}, {"body": "Yeah, though honestly I expected the stock to hit 380 way earlier based on the positive nature of all the news.", "score": 3, "replies": [{"body": "If Cybertruck wasn’t so controversial and was a no-brainer F150 killer we’d be there. Don’t get me wrong it may do just that, but it’s not entirely obvious how it’s going to go.", "score": 1, "replies": []}]}, {"body": "let's do it. I need it to cross to 380!!", "score": 2, "replies": []}]}, {"body": "In other news Porsche hires auto marketing firm AMCI in an attempt to spin their terrible EPA rating.\n\n\nhttp://wikimapia.org/7686655/Automotive-Marketing-Consultants-Inc\n\nhttps://techcrunch.com/2019/12/11/the-electric-porsche-taycan-turbo-has-an-epa-range-of-201-miles/", "score": 14, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "https://www.motor1.com/news/387396/porsche-taycan-turbo-range-independent-test/", "score": 2, "replies": [{"body": "Wow this is fucking brilliant. They had all these different ranges be floated around prior to the EPA numbers coming out, all aimed at muddying the water. Now that it comes out people are like well this one said 288, this one said 230, this one said 250, this one said 275, then EPA said 201, these EPA numbers seem unreliable!\n\nThe fact that they commissioned a firm to get the 288 number floating out there all but confirms that this was the strategy.\n\nGotta say their marketing is absolutely outstanding, this is the worst range on a mainstream EV to come out in like 2 years, and its $150k, yet nobody seems to care, still the hottest car at the moment. Pretty remarkable.\n\nAnd to reiterate my other comment from the other thread: If I'm not mistaken their WLTP range has not been officially tested and won't be for a while since they will ship US first, this is just the number they have released. The EPA rating on the other hand will be officially tested by the EPA so they can't lie on it. If you look at it from a marketing perspective it would be smart to give out a WLTP rating a bit above real value, have all reviewers do their reviews with this number, then drop the EPA rating before US market roll out, and then drop real WLTP rating before EU roll out. This is Porsche after all, they cheated on freaking gas emission, killing hundreds of people, this is child play in comparison.", "score": 2, "replies": []}]}]}]}, {"body": "Demand problem", "score": 13, "replies": []}, {"body": "Made enough off Tesla investments to sell and pay off a lot of my debt. Even tho i am long term super bullish, given the price we are at i fell comfortably selling a large chunk. I plan to buy in later even if it ends up over $400 through 2020. Just feel it is the right move for where i am in life", "score": 24, "replies": [{"body": "Nothing wrong with that. That’s what investing is for.\nCongratulations on paying your debt.\n\nI hope you can find a good re-entry point in 2020. I’m hoping for a dip sometimes next summer to finish building my position.\nAlso expecting a global market correction at some point in early 2020.", "score": 10, "replies": []}, {"body": "this is one of the things i hope to do. congrats!", "score": 2, "replies": []}, {"body": "I sold off most of my options today as well, it has been doing great this week, but with the new tariffs starting on the 15th I am not sure holding onto Tesla over the weekend is a smart move.  If Trump postpones the tariff stock market might rise 3%, but if the tariff does hit, then volatile stocks like Tesla may drop 5-10%\n\nWaiting until EOY to buy in options right before sales number report, i believe Q4 numbers are gonna be amazing!", "score": 2, "replies": []}, {"body": "Congrats!  I'm sure that is a great feeling.", "score": 1, "replies": []}, {"body": "You are welcome!", "score": 1, "replies": []}, {"body": "Yeah it's put me in a very cozy nest. But still maintaining my position. Essentially telling myself that from here on out that my cash flow will go all towards debt paydown and normal spending (student loans, Tesla m3, houses, etc), max out my 401k each year, and let the rest sit and grow untill Teslas first dividend.\n\nNot sure why that's what I am waiting for but have had a dream about getting a Tesla dividend for a long time haha.", "score": 1, "replies": [{"body": "Are Tesla ever going to offer a dividend? Not sure they will given that Elon said they want to put all the money back into the company to help transition the world off fossil fuels. Feel like he will use any money they get in some kind of earth helping project rather than using it to enrich shareholders.", "score": 1, "replies": [{"body": "They either use excess cash to reinvest into growth like AMZN, or shareholders will charge them with pitchforks and torches like they did when AAPL had $100B+ in cash. Tesla is not a charity, shareholders and the board will not allow excess cash to mindlessly get allocated to initiatives that do not return shareholder value.", "score": 1, "replies": []}, {"body": "They will need to or find new places to invest. The public market is not a charity and shareholders expect returns.", "score": 1, "replies": [{"body": "> shareholders expect returns\n\nFor a company growing as fast as Tesla, it's enormously more profitable long term to put the money back into the business than to pay dividends. As another example, Berkshire Hathaway, even after many years of growth since the 1960s, ordinarily does not pay a dividend.", "score": 1, "replies": []}, {"body": "You may be waiting a long time for that dividend. \n\n\"Tesla has never declared dividends on our common stock. We intend on retaining all future earnings to finance future growth and therefore, do not anticipate paying any cash dividends in the foreseeable future.\"", "score": 1, "replies": []}]}, {"body": "Read the master plan. Lots of work to do still before any dividends ;). \n\nhttps://www.tesla.com/en_CA/blog/secret-tesla-motors-master-plan-just-between-you-and-me\n\nPerhaps if they get enormous and they spin out the energy business because it’s commonplace for big infrastructure companies to at least have SOME yield.", "score": 1, "replies": []}]}]}]}, {"body": "2 days in a row of 500+ deliveries in the Netherlands. 😛", "score": 10, "replies": [{"body": "That is 5% more model 3s on Dutch roads in 2 days.", "score": 6, "replies": []}, {"body": "That is an insane pace lol. How do they do it?", "score": 2, "replies": []}, {"body": "Where do you track this? Sounds great!", "score": 1, "replies": [{"body": "https://app.powerbi.com/view?r=eyJrIjoiNWUxZGI1ZjMtMGRmOS00Y2NhLThkZGUtZDllMTA5NGU4ZWY1IiwidCI6ImU0ZTI2YTNkLWIxMDEtNGFhZC1hMGY3LTVlMmIzOWQ5OTZiMiIsImMiOjh9", "score": 3, "replies": []}]}]}, {"body": "I told yall it was a MJ-wearing-#45 day today 🤷‍♂️", "score": 9, "replies": [{"body": "His fade away got Dikembe Mutombo'd ☝️", "score": 5, "replies": [{"body": "“Not in my house ☝️“", "score": 2, "replies": []}]}]}, {"body": "Anyone else get sad when there isn’t any new Tesla news in a day?", "score": 15, "replies": [{"body": "Nah :)", "score": 1, "replies": []}, {"body": "Sometimes no news is good news. Every once in a while, it's nice to take a breather.", "score": 1, "replies": []}, {"body": "You can bet this will cause major FOMO for Elon: Jeff Bezos named businessperson of the decade by global finance chiefs https://www.cnbc.com/2019/12/12/jeff-bezos-picked-as-businessperson-of-the-decade-cnbc-survey.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard\n\nMaybe this sparks some action by Elon. He HATES Bezos.", "score": -13, "replies": [{"body": "Elon doesn't think of himself as a businessman so this likely means squat to him. Elon will feel fomo if Bezos ever manages to burn enough money to become any sort of threat to SpaceX, which judging by the last 10 years doesn't look like it's going to happen.", "score": 12, "replies": [{"body": "Agreed RE businessman. But I’m talking about ego and wanting to be recognized for having a profound, positive impact on the world. Bezos is like the anti Musk. He wants to kill everything in his path where Elon wants to help bring the world, including companies, forward to solve sustainability. \n\nAny of the award attributing to Blue Origin is pouring gasoline on the fire because of how much more SpaceX has already accomplished with far fewer resources.", "score": -1, "replies": [{"body": "Elon is really having an impact on the world, and a very positive one at that. The future of mankind would be much bleaker with respect to global warming if it weren’t for Elon. He is dragging the dino’s by their ears into the 21st century. We now do have a viable alternative for personal transportation.", "score": 11, "replies": [{"body": "Yessir", "score": 3, "replies": []}]}]}]}, {"body": "It's all about the \"disruptor of the century\".", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I didn't downvote but I can imagine a lot of people here being tired about speculation regarding possible shenanigans Elon might get into.  I know I am.", "score": 6, "replies": []}, {"body": "Because people are retarded. But we need that so we can buy up shares on the el cheapo.", "score": -1, "replies": []}]}]}]}, {"body": "Food for thought: what happens to orders of Teslas of all sorts if in fact come YE a first iteration of FSD comes out and it’s even remotely decent? I think we’ll see pre order costs go way up and cash accumulate like bonkers (not to mention it already accumulating cash like mad as we get closer to most sales being local where they collect 100% of cash far ahead of costs to produce). \n\nI’m talking about orders for their vehicles that aren’t set to come out for 1-2 years like the Cybertruck or lower level model Ys? Putting an order on one is like a free call option on these cars that Elon predicts will appreciate (https://electrek.co/2019/04/12/tesla-vehicles-appreciating-assets-self-driving-elon-musk/). \n\nIf indeed this happens then a $100 Cybertruck order now or a $2500 (different in each region) downpayment for a Y starts to make a LOT of sense. Especially if you can cancel it if they haven’t achieved FSD. \n\nWho’s in?", "score": 7, "replies": [{"body": "A couple weeks ago, someone else in the club had the same idea about reserving the Cybertruck as way of reserving the right to buy a Tesla later with the current FSD price. He even described it as a refundable \"call option\" on FSD, as well.\n\nThere was some discussion. Someone reserved 10! I reserved 5!\n\nI think it's most appealing to reserve the Cybertruck because it's only $100 and 2 years away, which sounds like a reasonable time to get to  Robo-Taxi-level or excitingly close. Yes, FSD might soon become what Elon will call \"feature complete\", but it's really tough for me to imagine FSD in the next few months getting close to the point where you can legally step out of the car and send it out to taxi autonomously. With a Model Y, you're likely to have the opportunity to buy the car in a few short months from now, and not know how many more months (or years!) you're going to have to wait until the Tesla Network finally wakes up.", "score": 4, "replies": [{"body": "There ya go.  Any valid devils advocate comments? I’m doing it.", "score": 5, "replies": [{"body": "My main \"Devil's Advocate\" comment on putting money up now to reserve a FSD Cybertruck would be: we're definitely going to be paying some kind of commission to Tesla for each Robo-Taxi.  10%? 20% 50%? Who knows. It might make the economics and the hassle of management, upkeep, storage, charging (automated?!?) less appealing.\n\nAlso, as u/Setheroth28036 said, it doesn't look like the Model Y will be anywhere near Robo-Taxi level of FSD when it comes time to configure. But 5 years from now, our fleets of Cybertrucks probably might not feel like the ideal taxis (at least in terms of cost per mile), compared to the 3's and Y's.", "score": 1, "replies": [{"body": "Good points! If about 1 in 6700 die from car accidents and the data is very compelling I don’t know. I think it’s true it’ll take a long time but thinks can move fast. \n\nElon floated 30% fees during autonomy day but without a driver the margins make a lot of sense. Definitely agree with the other points you have here. \n\nHere’s one fun site to see stats. There are definitely better resources out there but this one is interesting:\nhttps://www.mentalfloss.com/article/564015/probability-being-killed-everyday-activities-chart", "score": 2, "replies": []}]}]}, {"body": "👋🏻 I was the guy that reserved 10.  And I convinced a buddy of mine to do the same!  I also have 2 Y reservations but it’s not looking like FSD will be anywhere close to ready by the time I’ll be forced to configure those...", "score": 3, "replies": [{"body": "YDM ! 🤙🏻🤙🏻\n\nI have 10 now too. One fully tricked out for personal use and 9 AWD with FSD. Have a Y coming so I can get out of my brutal ICE SUV. \n\nThere’s NO way that they don’t jack the down payment way way up when phase I of FSD comes out in and around YE. \n\nThis is going to be quite a show to watch! Just the start.", "score": 2, "replies": [{"body": "Yeah man.  I also own a bunch of 6/2020 $420 calls.  It’s looking more and more like they’re gonna turn out very well 🙃", "score": 2, "replies": [{"body": "Beauty. That’s ballsy. I have 9/2020 $500 calls bought only a few days ago for $13.50.", "score": 2, "replies": [{"body": "I picked mine up several months ago for $4.69.  Suckers!", "score": 2, "replies": [{"body": "Ha ha ha. Dang. Well at that time I still held Nov ‘19 $255 calls that were way up, albeit not enough invested in them to get rich off. Enough gains to buy a Tesla though.", "score": 2, "replies": []}, {"body": "For what it's worth, Elon said 2020 would be increasingly good with Q4 2020 providing the most impressive performance.  Personally, I made sure my calls would see the gains from these periods by getting the longer expirations.", "score": 1, "replies": [{"body": "Yeah, I’m planning on taking what’s left of my profits and rolling them into some 2022 calls", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I'm preordering the Cybertruck as a hedge on future increases in FSD cost.", "score": 3, "replies": []}]}, {"body": "Closing in on ATH", "score": 5, "replies": [{"body": "And it’s about time. It’s ridiculous it’s not ATH yet.", "score": 3, "replies": []}]}, {"body": "I'm really excited to see this Piper Jaffray call  tested: [https://www.cnbc.com/2018/12/10/if-tesla-can-break-this-level-squeeze-could-deliver-45-percent-rally.html](https://www.cnbc.com/2018/12/10/if-tesla-can-break-this-level-squeeze-could-deliver-45-percent-rally.html)   \nIf we hit 400 by EoY I can totally see 500 by earnings; I like this call by piper. SQUEEZE THEM!!!!!!", "score": 5, "replies": [{"body": "The article is from last December", "score": 2, "replies": [{"body": "Damn didn't even notice; it's been recirculating. It's insane how similar the technical circumstance is as well. \n\nConsidering how much more the company has accomplished since then, I can really see this coming to fruition, albeit a year late.", "score": 2, "replies": []}]}, {"body": "The opposite view guy is very funny:\n\n- their \"factories\" are actually tents.\n- they had to recruit unpaid tesla fans to deliver cars\n- they'll not repeat profits because this time they'll have to pay staff.\n- sitting on the sidelines* until we get answer wheter this company wants to burn money or make money.\n\n*) what I hear: losing a whole lot of money", "score": 2, "replies": []}]}, {"body": "4th fade this week? I’ll take another one of these days tomorrow though.", "score": 5, "replies": [{"body": "Same.  It’s been fading late afternoon, but overall trending upwards.  I’m more than cool with that.", "score": 11, "replies": []}]}, {"body": "We've been hearing pretty much nothing but good news lately. What are some upcoming challenges/roadbumps that could negatively affect the stock that you think might happen?", "score": 10, "replies": [{"body": "2019 guidance, margins, upcoming earnings. I've seen expectations raised to around $1.30 EPS, so if they miss or barely hit profitability could take a hit.", "score": 5, "replies": []}, {"body": "not hitting 2019 guidance is the obvious one.\n\n&#x200B;\n\nQ1 2020 will be comparativly weak, it won't be as extreme as Q1 2019, but i can still see it triggering a sell off.", "score": 1, "replies": [{"body": ">Q1 2020 will be comparativly weak\n\nIf the company is production constrained and bringing on a new factory why will Q1 2020 be weak?  I thought the story from Q1 2019 was the spin up of foreign Model 3 deliveries put a lot of units in-transport but not delivered during the quarter.", "score": 2, "replies": [{"body": "Their production wasn’t even close to other quarters Q1 last year either.", "score": 1, "replies": []}]}, {"body": "The market will expect this now though. Last time, people were blindsided and started pricing in a large drop in demand etc. We all expect seasonality effects here now, and most likely we will crush Q1 2019 anyway so YoY will look half decent on paper, especially with China deliveries picking up speed.", "score": 1, "replies": [{"body": "Tesla itself also kinda was responsible for the surprise effect due to the erratic pricing changes and the whole \"we're moving to online sales only\" followed by \"no wait, just kidding\" just a few weeks later.  They did seem like they were in a bit of a panic mode at the time.", "score": 2, "replies": [{"body": "It might have added to the uncertainty, but I still think that the stock price was mainly hit where the rubber meats the road: Sales. Too much pulled forward demand into Q4 was taken from Q1. Analysts had no idea how to gauge this demand move from one quarter to the other, when US subsidies were cut by $3750. Tesla most likely reacted to the demand decrease by messing with prices, since they were in the know on what sales looked like into the new year. That's my take anyway.", "score": 1, "replies": []}]}, {"body": "One would think that, but i don't put that much trust into the market. Q1 2020 will be just about the last hurrah for the Bears, i expect them to take full advantage of that.", "score": 1, "replies": [{"body": "Big investors will be wiser. Retail investors might panic, but that dip will be bought quicker this time by smart money.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, this Q1 had some real BS around half the entire quarter's deliveries showing up in the last 10 days, and a lot more missing that and dropping in Q2.  That all by itself accounts for most of the loss.  That's not (or shouldn't be) a recurring kind of thing.", "score": 1, "replies": []}]}]}]}, {"body": "Buy calls at closing and sell at 10AM. Easy money", "score": 8, "replies": [{"body": "Seems like this would have been super profitable nearly every day the past few weeks.", "score": 3, "replies": []}]}, {"body": "[https://youtu.be/tQOMqsEkdUE?t=67](https://youtu.be/tQOMqsEkdUE?t=67)\n\nJust saw this vid in my feed that was posted today. The guy's order number suggest his reservation is #422,333. I know this isn't entirely accurate due to double orders and cancellations from Nov 21st, but it's leaps ahead of Elon's last pre order update.", "score": 5, "replies": [{"body": "That number likely includes all types of cars... pre-orders and regular orders.\n\nI would love to know what the actual number is by now.", "score": 1, "replies": [{"body": ">includes all types of cars.\n\nnope, it's just for Cybertruck. Counter based on that number has tracked well with the numbers Elon has tweeted. Current order count has crossed 420k assuming zero cancellations so far. \n\n[https://docs.google.com/spreadsheets/d/1--6OR9ECwSwZdkOtWkuslJVCyAAfQv1eJal1fdngfsk/edit#gid=0](https://docs.google.com/spreadsheets/d/1--6OR9ECwSwZdkOtWkuslJVCyAAfQv1eJal1fdngfsk/edit#gid=0)", "score": 8, "replies": [{"body": "That has some discussion on the numbers including other orders or not.  I think they do...  My tri order implied 187k on the 22nd around 9pm, around 17 hours before he tweeted that exact number.  What's the \"correction\", anyway?  It seems a fudge factor accounting for some percentage of unrelated orders.", "score": 1, "replies": [{"body": "You’re probably right", "score": 1, "replies": []}]}]}, {"body": "*If* they get to 500k then I expect Elon might announce that.", "score": 5, "replies": [{"body": "I'll lose my faith in Elon if he doesn't announce 420k reservations.", "score": 12, "replies": [{"body": "i'd be disappointed if it's not phrased like \"420k reservations secured\"", "score": 2, "replies": [{"body": "That would negatively affect the stock but that's a sacrifice I'm willing to make!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Trying to spreadsheet out next year and once again there's a wide spread of possibilities. It's basically hopeless.", "score": 4, "replies": [{"body": "Check out mine and some other contributors' spreadsheets over at TMC if you're interested:\n\n[https://teslamotorsclub.com/tmc/posts/4263147/](https://teslamotorsclub.com/tmc/posts/4263147/)\n\nI think Q4'20 will be at least 10B$ in revenue and 1B$ in EBIT, possibly better.", "score": 8, "replies": [{"body": "Analysts are only forecasting 25% revenue growth in FY20, and with GF3 and MY early I’ve never been more confident that they’re going to crush these — or much more likely, that they’ll soon get revised upwards.", "score": 3, "replies": []}, {"body": "My best guess is that they sell \\~360k model 3 next year but drop prices 2k$ off early in 2020, and then maybe even more again after Y launch, to keep volume that high. Possibly they go even lower price than that, dipping into the FCA booster, in order to maximize as much as possible production because I think that it is a meta-goal to sell as many units as possible rather than sheer profit maximization. A growth company like Tesla I think it is important to understand that they aren't going to maximize profit this early in the cycle. Also, sheer revenue growth leads to free cash flow which is useful as well.\n\nThere's quite a few headwinds I see next year including the Y itself and the main tailwind is increasing awareness, adoption curve, and lowering price. The chief variable that might change my mind is what the state of subsidies are in the EU for 2020, other than NL losing its shine and pressure coming on to ICE manufacturers I'm not that familiar.  I expect a lot of cannibalization pressure from the Y, and the earlier and more aggressive it launches, the more pressure. The Y is both the more popular format and the newer jazz, and Tesla buyers like the newest jazz. But the thing is that I can see anywhere from 250k to 500k for model 3. I know China is built out for 3k/week but I have no idea what the demand actually is. If Tesla dramatically cuts price, which they might, they could likely take themselves to production constrained.\n\nAnother wildcard is FSD and whether improvements there might change uptake. I am expecting more bells and whistles but nothing that really moves the needle financially.\n\nAll of the other line items should improve in terms of contribution except I should think S/X units moved declines slightly though profitability total might slightly improve. All the other line items beyond 3/Y are  important in terms of clearing the profitability line and getting S&P 500 inclusion but I think largely a side show to automotive in regard to \\*valuation of the enterprise\\*. The solar roof I predict will continue to be a very meager contribution.", "score": 4, "replies": [{"body": "Sounds like you are very pessimistic in terms of demand, or at least want proof in terms of sales/order numbers before believing a certain demand level is possible. Here's a few reasons why I think TSLA will sell many more than 350k M3s long term:\n\n1. Demand is currently trending up. They exited the last two quarters with an increase in order backlog, and considering how early Q4 production was sold out this quarter and low inventory levels, I wouldn't be surprised to see this be the case again at end of Q4 in spite of higher sales. The fact that according to this week's Deutsche Bank note less than 5% of sales are from reservation holders further points to there being increasing organic M3 demand.\n2. China alone will almost certainly increase M3 demand well beyond 350k/year. Giga 3 will reduce the price of M3 in China, M3 now qualifies for incentives, and there is a lot of hype in China due to Tesla's official launch in the country. Last but not least, if you simply look at the number of midsize sedans sold in China,  there should be the potential for as many sales in China as in the US, if not more.\n3. Giga 4 should have the same effect in EU as Giga 3 will have in China. Lower prices should increase demand significantly, because currently M3 is up to 50% more expensive in some countries such as NL.\n4. Elon has stated his best guess for long term M3 demand is around 700k/year. Considering Tesla still does not have a presence in many markets (India, Singapore, etc.), and considering a large number of trade-ins are from much cheaper, non-premium models, this does not seem too far-fetched to me.\n\nLast but not least, if there is not significantly higher yearly M3 demand than 350k/year, Tesla is royally screwing up by building Giga 3 and Giga 4 when they are already at 350k/year capacity at Fremont.", "score": 3, "replies": [{"body": "I would be open to understanding China demand better. While it is a big market, the model 3 is still a very expensive vehicle relative to the median vehicle so I'm not sure how big \\*that\\* market is.  When you are estimating China, how big is the market and what is Tesla's marketshare do you think for that price point?\n\nThe principal headwind for the model 3 is the model Y itself. I think the Y will sell between 50% and 100% more than the 3, but that will directly cannibalize a lot of 3 demand. So when  I say 360k/year for model 3 I am also predicting 540k-720k for the Y.\n\nThe other headwinds are the incoming competitive models. The VW model in particular should be attractive because it carries the $7500 tax incentive. None of these will hold a candle in overall sales to Tesla but the stack of them might have an affect especially given just how much pressure these companies have to discount to move metal.\n\nBut yes, I am attempting to skew cautious. Last year at this time my prediction for 2019 turned out to be way off the mark on the optimistic side principally because I didn't see the S/X collapse coming. Likewise, the 3 can collapse in the face of the Y. Normally they would create more price separation but the Y will also be lower cost to build owing to various improvements which makes it more difficult to use this approach while maximizing profit.\n\nBut if they sell 360k this year, 50% more units or 540k  for 2020  (360k model 3, 60k S/X, 120k model Y) that would be great. And then they can sell 50% more in 2021 (add another 270k for model Y and Semi).. all good still. Especially if you add improvements on the other line items this is a perfectly fine pace. Certainly if they do better I'm fine with that as well.", "score": 2, "replies": [{"body": "I haven't done any detailed calculations on demand per market beyond looking at Tesla's planned production, and assuming that they are better informed than me. Of course I don't just take their word for it, but given all the things I listed in my comment above and most importantly that the **premium** mid-size sedan market in China is [the largest in the world](https://ir.tesla.com/static-files/47313d21-3cac-4f69-9497-d161bce15da4) (Page 7/28 of link has chart), I have no reason to doubt that there is enough demand for their planned production capacities.\n\nModel Y will likely influence M3 demand a little bit yes, but I think you're significantly overestimating the cannibalization. People were scared of the Model X cannibalizing the Model S as well, but there was no noticeable dip in Model S demand after the Model X came out. Sedans and SUVs/CUVs are quite different types of cars and are different market segments. The Model Y has also already been unveiled 9 months ago, so some of these people are likely already holding off on buying a M3, so some of the cannibalization should already be accounted for in current demand numbers.\n\nEven if the ID.3 isn't going to be the same range disaster as the Porsche Taycan, I don't think the higher trims of the ID.3 can compete with the Model 3. The Model 3 is simply objectively a better car for the same price. I think only the cheapest ID.3 variant will sell well, because it's significantly cheaper than the Model 3. I think it'll take away more sales from other cheap EVs like the Kona though than from the Model 3.\n\nYes, the S/X did unexpectedly collapse a bit, probably partly due to the Model 3, but also partly because the cheaper variants were discontinued. Remember there used to be a 3rd cheaper trim level for the S/X, but this was discontinued at the start of 2019.\n\nI'm thinking guidance for 2020 will be 600-700k. I personally think 650k is quite achievable. 540k is very much on the low end imo, considering guidance for Q3'19 - Q2'20 was given of 500k vehicles. And the second half of 2020 is when there should be significant MY volume.\n\nAnother way too look at it is that Q4'19 will likely be at least 105k deliveries for a yearly run rate of 420k. With Giga 3 already rumored to be producing 1k/week with just 8/hr shifts (so 3k/week if they operate 24/7), and reports that MY will have no trouble reaching 1k/week production by mid 2020, I am quite confident that they can do 600k+ in 2020.\n\nP.S. They just increased the price of the M3 by $500, so that's another very bullish sign that demand is very strong. Contrast this to a year ago when there would be price decreases, and EoQ incentives/discounts to finish the quarter strong. They no longer need these to sell all the vehicles they produce. Bullish AF sign imo.", "score": 1, "replies": [{"body": "Well anything north of 540k is gravy. I have no doubt that Tesla will guide higher than that. They have a habit of such youthful enthusiasm.\n\nI'm separately a bit concerned about China and potential knock off effects of this extended trade war. They are an economy that's a bit hollowed out with debt and fast growth and their auto industry has already reacted. It'll be interesting to see how fast Tesla moves beyond 3k/week. Clearly any Y they build next year will be immediately sold and so that's a lever they may have some control over as well.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Congrats to $TSLA and also to my $AMD-holding brothers.\n\nSolid $40K day for me. In the right direction this time 😁", "score": 9, "replies": [{"body": "I got 40K too on AMD and Tesla combined! congrats!", "score": 5, "replies": [{"body": "Sweet, congrats!!! It's been a long time coming for both stocks!\n\nRandom question, are you also holding $MU? I have a small position I brought around $19 but it's been stagnant for a long time. Been considering selling it and moving the money into $TSLA.", "score": 1, "replies": [{"body": "No.. I did lose like 20k on MU last year on that. I'm not touching it again.\nI did have some nice gains on LTHM(Tesla needs it) this week though.", "score": 1, "replies": []}]}]}, {"body": "I bought quite a bit of AMD at $10. My only regret is selling most at $25.", "score": 1, "replies": []}, {"body": "Total portfolio up 59.6% this year with around 50% of total gains from AMD and 40% from Tesla. \n\nGood shit.", "score": 1, "replies": []}, {"body": "Congrats for a second time!\nI hope you added another 40k too!!", "score": 1, "replies": []}, {"body": "Congrats for a second time!\nI hope you added another 40k too!!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": ">Elon showing his support for his girl at The Game Awards\n\n[And awkwardly trying to start a standing ovation](https://www.youtube.com/watch?v=aGBzpnB_9RM) (skip to 4:20).\n\nI'd expect nothing less.", "score": 9, "replies": [{"body": "Hahaha, that’s hilarious! 😂", "score": 5, "replies": []}, {"body": "[That nip slip was also pretty wired](https://www.youtube.com/watch?v=dQw4w9WgXcQ)", "score": 4, "replies": [{"body": "damn you", "score": 3, "replies": []}]}, {"body": "Lmao that truly was incredibly awkward, nice.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "He's a billionaire. I'm told these days that makes him evil and unaffected by human emotion or sympathy.", "score": 7, "replies": []}]}]}]}, {"body": "I’m speechless \n\n... Tesla ...", "score": 9, "replies": [{"body": "love2fuckbearasshoe\n\n...2...\n\n2x share price = 720...\n\nThe messiah has spoken\n\n$690 calls it is", "score": 9, "replies": [{"body": "😈😈💵💵👊😏", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "This is why some of us caution people not to get ahead of themselves based on _rumors_.  There hasn't been any confirmation about deliveries in December, yet some people are expecting this to happen now.", "score": 10, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I have no idea why the stock has been moving up lately... for the past 6 months, most rumors didn't really affect the stock much.  The market has been in a bit of \"show and prove\" mode when it comes to TSLA, so I kinda doubt that the rumors of deliveries in December would move it that much.  In the grand scheme of things, whether the cars are delivered in December or January doesn't really make that much of a difference.  Considering that the margins on the first batches of cars out of GF3 probably won't be that high, I'd think it wouldn't have much impact on profitability for Q4 either way.\n\nIf anything, I'd say the market coming to the conclusion that the Cybertruck reactions were way overblown has a bigger impact on the stock than the rumored Chinese deliveries.\n\nAnd also, keep in mind that we have gradual run ups of the stock pretty much every last month of each quarter... it might as well just be that.", "score": 1, "replies": []}]}]}, {"body": "My theory is that they will hit the guidance easily without MIC deliveries, so they'd rather start those in january, allowing for a safety margin for achieving an ambitious guidance for next year.\n\nAlso there must be some costs associated with ramping the production which they might want to absorb in Q1 rather than now.\n\nI might also be wrong and they'll start deliveries very shortly (or have started in silence already).", "score": 5, "replies": [{"body": "Which specific guidance are you talking about? Their quoted year end numbers? Because it seems like they’ll struggle to hit their median guidance. And if the business is running themselves on these quarterly earnings decision making, I question the judgment.", "score": 1, "replies": [{"body": "I'm talking about low end of delivery guidance (360k). Yeah you are probably right. They probably just have to sort some things out before starting deliveries.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "My theory is that those M3s sitting in Shanghai parking lot is a plan B for Tesla Q4 numbers.  The reason why Tesla would rather wait until end of Jan to deliver them is because Q1 will be weak in the US.  So the more Tesla can save up in Q4 the better.  But if for odd reason Tesla misses the 360-400k target, then Tesla can start delivery of those M3s in Shanghai and still make the 36k target.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There’s a marketing reason for this delay too I believe.  Chinese New Year is Jan 25th, so delivering M3 before that would be great for marketing so all the buyers can drive them everywhere to show off to friends and families.  My guess is they will start delivery around Jan 15th", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The upside is to concentrate as many Chinese sales - the surge as a new market is exposed to a product - during the quarter which is traditionally weakest for Tesla.\n\nPut it this way - if you had 500 million dollars of profit across those two quarters, which scenario would you prefer?  \n\n\n|Q4 Profit|Q1 Profit||\n|:-|:-|:-|\n|450M|50M|(large decrease)|\n|300M|200M|(minor decrease, in line with historic realities)|\n\nCertainly the second scenario would be preferable, so if you are going to meet you marks for Q4, you want to reserve surplus to bolster your Q1 numbers.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Pfft, you call this a fade?", "score": 3, "replies": [{"body": "I can live with this", "score": 3, "replies": []}]}, {"body": "This is great and all  but Y'all's getting ready for the MJ fade in the afternoon though?", "score": 6, "replies": [{"body": "I'm pretty ok with the Stock rallying 2% and then fading back to 1% every day", "score": 5, "replies": []}, {"body": "tHiS tImE iT's DiFfErEnT", "score": 3, "replies": []}, {"body": "nah, today is a nr 45 MJ day so that fadeaway is gonna come up short", "score": 3, "replies": [{"body": "Sorry guys I’m dumb....what’s nr 45 MJ?", "score": 3, "replies": [{"body": "when MJ first came out of retirement he was forced to wear nr 45 because the Bulls had retired his nr 23 jersey.  He wasn't quite the same and the bulls came up short in the Eastern conference finals against the Knicks (i think, it's been a while). EDIT: no it was the Shaq led Orlando Magic!\n\nThe next year, MJ started wearing nr 23 again and won another 3 straight championships.", "score": 2, "replies": [{"body": "Thank you for explaining. I'd never seen \"number\" abbreviated \"nr\"", "score": 2, "replies": [{"body": "Oh ok, not a native English speaker/writer so I probably used something rather uncommon :)", "score": 1, "replies": []}]}, {"body": "Didn’t MJ choose to wear 45 his year back because it was his baseball number? I don’t think the Bulls had retired his Jersey yet, and it appears like he switched back to 23 part way through the 95 season: https://solecollector.com/news/2015/03/why-michael-jordan-wore-the-number-45", "score": 1, "replies": [{"body": "His #23 jersey was retired before his first comeback... you could’ve found that out within a minute with a really quick google search:\n\nhttps://sportstar.thehindu.com/basketball/on-this-day-michael-jordan-jersey-number-23-retired-by-nba-team-chicago-bulls/article29852422.ece\n\nMight wanna keep this in mind whenever you reply to Tesla related comments... most thing don’t take more than a minute of googling ;)", "score": 0, "replies": []}]}]}, {"body": "Just guessing here but it seems like a Michael Jordan out of retirement reference.", "score": 1, "replies": []}]}]}]}, {"body": "Hi all!\n\nHow do you buy TSLA options? I was looking for them on Degiro but I can't find them...", "score": 5, "replies": [{"body": "Easiest way is Robinhood, I had to jump through hoops with my normal brokerage account and I still can't even do credit spreads with them.", "score": 3, "replies": [{"body": "Ty!\n\nLooks weird that with Degiro is not doable :(", "score": 1, "replies": []}]}, {"body": "Open a margin account with your discount brokerage then put $ in then go to options trading and put in TSLA. Pick your thread and choose.", "score": 2, "replies": []}, {"body": "I'm using Degiro as well, I would like to know it too", "score": 2, "replies": [{"body": "Nice! Let me know if you get to understand if it is possible...", "score": 1, "replies": []}]}, {"body": "Degiro does not offer stock options, only (some) index options.", "score": 2, "replies": []}, {"body": "You can't trade options on there although they are supposedly working on it for sometime in the future. You'll have to open an account at a different broker if you want to trade options.\n\nI did the same earlier this year and opened an account with IB (Interactive Brokers). Took a few days only and I've been super happy with them so far.", "score": 2, "replies": [{"body": "Thanks a lot", "score": 1, "replies": [{"body": "Enjoy your flair friend!", "score": 2, "replies": []}]}]}, {"body": "I have (e.g) CH0437759183 Call 17.01.20 Tesla 350 which aren't the same as US options but may be interesting to you.", "score": 1, "replies": []}]}, {"body": "35k worth of contracts have been bought boys! let's goooo", "score": 4, "replies": [{"body": "Isn't Q4 report usually out mid February? All 10Qs are out 3 weeks after quarter end except 10-k at year end. Very surprised the contracts are for January and not February. Maybe I'm missing something", "score": 2, "replies": []}, {"body": "What date?", "score": 1, "replies": [{"body": "January 24 at 360 so not that bad. i should've risked more\nup 860", "score": 1, "replies": []}]}, {"body": "Yolo!", "score": 1, "replies": [{"body": "gains are about to be crazy these next few weeks. Christmas came early", "score": 1, "replies": []}]}]}, {"body": "When is next 10q/10k going to be out? Conflicting reports are that it's mid January or mid February. Thanks", "score": 2, "replies": [{"body": "Last year it was  Feb 19.\n\nhttps://ir.tesla.com/sec-filings/sec-filing/10-k/0001564590-19-003165\n\nFeb 19, 2019\n\nFeb 23, 2018\n\nMar 01, 2017\n\nFeb 10, 2016\n\nFeb 24, 2015", "score": 3, "replies": []}, {"body": "ER is Jan, formal filings to follow in Feb.", "score": 3, "replies": []}]}, {"body": "$400 is on the radar!", "score": 6, "replies": [{"body": "420 was on the LIE-DAR last year! \n\n\\*I'll see myself out the door\\*", "score": 9, "replies": []}, {"body": "And then the forward facing camera and finally the ultrasonic sensors.", "score": 2, "replies": []}]}, {"body": "That's the way - aha, aha (I like it)", "score": 4, "replies": []}, {"body": "*Tesla Loses Its Third General Counsel in the Course of a Year*\n\nhttps://www.bloomberg.com/amp/news/articles/2019-12-12/tesla-loses-its-third-general-counsel-in-the-course-of-a-year?__twitter_impression=true", "score": 6, "replies": [{"body": "Tragic. Can we get an update on the toilet paper situation?", "score": 29, "replies": [{"body": "The toilet paper situation is literally the straw that broke the camel’s back... everybody in Tesla’s legal department is shitting their pants due to all of the solar city lawsuits.  The fact that Tesla Legal is toilet-paper-constrained is the reason why these lawyers are leaving en masse.  A few more months of this, and there’ll be nobody left to defend Tesla against Solar City lawsuits and then, the company will finally end up going bankrupt.  TSLAQ was right all along.", "score": 16, "replies": [{"body": "Well, obviously they had to cut back on toilet paper because everyone kept nearly shitting their pants every crisis... 5, 10 times a day.  The TP costs are WAY higher than normal companies.  Company ending crises left and right, correct?  Nobody can get any work done they're just sitting on the toilets.  They HAD to switch to adult diapers (every day is now BYOD day) just to keep moving so the lights would stay on.\n\n/s", "score": 2, "replies": [{"body": "And people wonder why this company still isn’t profitable 🤷‍♂️", "score": 3, "replies": []}]}]}]}, {"body": "😴", "score": 9, "replies": []}, {"body": "I really don't see why this is downvoted.  It seems like shooting the messenger.  Downvote news you don't like?\n\nThis is news, and I find it interesting.... just not particularly important stock-wise.", "score": 14, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "People acting rationally and leaving emotions out of the equation when money is on the line? Is there an investor sub where this actually happens?", "score": 2, "replies": []}, {"body": "This stopped being an investor sub months ago. It’s more of a fan site at this point.", "score": 1, "replies": []}]}, {"body": "That user is a prominent poster on r/RealTesla (literally the r/incels of the investing communities on Reddit). \n\nHe spends an ungodly amount of time posting negative things about Tesla and underhandedly down playing any milestone Tesla achieves.\n\nAlso, check out his Twitter when you get a chance (exact same username). That's all you need to know about him right there.\n\nI'll be downvoting everything flufferbot posts because his intentions are always nefarious.", "score": 23, "replies": [{"body": "I really thought that wasn't his actual twitter. The opinions displayed there, sometimes through caricatures, are objectively insane. If it's really him, maybe he just keeps most of the radical opinions to himself to avoid a ban", "score": 5, "replies": [{"body": "He's got two faces.", "score": 0, "replies": []}]}, {"body": "I don't think this is appropriate behavior. Upvote good comments and downvote bad ones. Don't hate the player just because. This is the definition of bad tribal behavior imo.", "score": 5, "replies": [{"body": "If we were dealing with just a typical bear, I'd agree with you. I have no patience however for people who make a day job out of seeing Tesla fail and go as far as harassing and \"trolling\" people who are excited about the company on twitter.", "score": 1, "replies": [{"body": "I think he has denied being that person on Twitter.", "score": 1, "replies": [{"body": "He puts on two different faces. That account posts similar links and is just as active. It's the same person. It's shameful.", "score": -1, "replies": [{"body": "Regardless, his behaviour here has been perfectly fine. Think of it whatever you want, but until he starts causing trouble here (which I doubt) his posts and comments here will not be removed.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yeah, I know...  and I definitely know that community.\n\nIMO he isn't all that bad HERE, and he provides an interesting perspective.  You can't tune out the people who disagree with you, that's one big thing that's really screwed up rational discourse lately.\n\nThe best situation would be if they can come here and be judged based on what they actually say, as if we went over there and would hope to be treated the same way.  Not going to happen, but it's what we should aim for.\n\nIf they come over here and just throw insults and spew conspiracy theories, sure... make those posts go away.  That's not what he tends to do here.\n\nI'm serious, I think he adds value to the group.  This post here is part of that.", "score": 3, "replies": [{"body": "> The best situation would be if they can come here and be judged based on what they actually say, as if we went over there and would hope to be treated the same way. Not going to happen, but it's what we should aim for.\n\nWe actually tried that a few months ago.  It sorta worked for a while but most of them couldn’t keep up the appearance of being interested in a civil discussion for more than a few days.  After a short while, their comments were filled with their typical snark and trollish statements.  They just can’t help themselves, really.  I truly do welcome bears here who can have a civil discussion but those bears are very rare.  For what it’s worth, /u/flufferbot01 has never broken even a single rule here, and while I also raise my eyebrows when I check that Twitter account, his behaviour in _this_ subreddit is perfectly fine.", "score": 3, "replies": [{"body": "Yeah, I'd expect most to be like that.  That's exactly why we should not be punishing the ones that do not act that way... and I'm glad he's mostly able to contribute here.  It's just sad when a post is interesting but not visible because of who said it.", "score": 5, "replies": [{"body": "Yeah to be clear: i originally responded to his comment with a sleeping-emoji because I was like “this won’t impact the stock”.  That’s just one of the many cases where I disagree with OP about the impact of the ‘story’ but that doesn’t mean he shouldn’t post it.  I appreciate him for posting it (and many of the things he posts), despite me disagreeing with impact of the story.", "score": 1, "replies": [{"body": "I'm happy with the community mods... I didn't mean to appear to drift into some opinion on how to moderate.  I'm just saying I wish people would vote up or down based on content and not who posted it.  :)", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Tesla’s level of executive turnover should be concerning, regardless. In the last year in a half they’ve lost 3 general counsels, 2 chief Accounting Officers, a CFO, and a CTO. That’s hugely abnormal.", "score": -4, "replies": [{"body": "I see this as Elon wanting actual performance from his top officers, not just sitting in the job.\n\nAnd I don't see stasis in the executive level as necessarily a good thing.", "score": 4, "replies": [{"body": "This contradicts every B-school analysis about executive turnover. Institutional knowledge matters. Most of these jobs take 6 months to even grok, much less make an impact at.", "score": 0, "replies": [{"body": "Who gives a fuck about business school? One of the most moronic fields of academic study.", "score": 7, "replies": [{"body": "How else will you understand business other than studying business? Ignore at your own risk.", "score": 1, "replies": [{"body": "> How else will you understand business other than studying business?\n\nHere's a thought: by actually doing business in the real world.\n\nAnd employing MBA stuffed shirts has been the risky play over the last 30 years, rather than scorning and ignoring them.", "score": 1, "replies": [{"body": "Doing business in the real world only gives you a single data point. Studying multiple of these is how you aggregate and make conclusions like “companies with high executive turnover usually don’t perform well”. \n\nWhat is your real argument for why so many people leaving after short tenures is a good thing?", "score": 1, "replies": [{"body": "The only 'data point' that really matters to Tesla is Tesla. Looking at aggregates and drawing conclusions from other businesses doesn't matter because it is way too general. There can be many reasons for executives leaving their positions. In the case of Tesla I would suggest the main reasons are 1) good people who have performed well but found the pace and effort required personally by Elon and by the immense challenges that the company has faced and will continue to face too much after some period of time and 2) people who haven't managed to perform well in that same very challenging environment or who have disagreed on some matter with the strong personal direction and viewpoint of Elon. I see both of those categories as quite natural with such a company as Tesla, which is so strongly and relentlessly led by Elon. A relevant company to compare Tesla to is Apple under Steve Jobs (as many have pointed out before). And Apple also had high executive turnover at various times under Steve Jobs.", "score": 2, "replies": [{"body": "Apple was remarkably stable in executive leadership under Jobs tenure. Tim Cook, Eddy Cue, Johnny Ive, Phil Schiller, Craig Federeghi basically all were there his entire tenure. \n\nThe only real departures were Tong Faddell, who went on to found Nest, and Ron Johnson, who went on to become the CEO of JC Penney.", "score": 1, "replies": [{"body": "Ok, I was actually thinking more of Jobs' first tenure at Apple (1976-1985) when I wrote that but yeah, Jobs wasn't CEO at that time. So I shouldn't have made the comparison to Apple in this instance.", "score": 1, "replies": [{"body": "Jobs first tenure at Apple is also not any sort of guide to effective leadership. There were many reasons he was fired. Any biography of Jobs— you see a guy who managed to learn from some of his worst impulses in adversity and come out better for it.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "OK, be concerned then. I'm not.", "score": 5, "replies": [{"body": "Buyer beware!", "score": -1, "replies": []}]}]}]}, {"body": "I think Elon's cool on the lawyer front homie.", "score": 8, "replies": [{"body": "Legal yes men are usually not a good thing. See the Trump administration for reference.", "score": 1, "replies": []}]}]}, {"body": "Money!", "score": 2, "replies": [{"body": "360 baby!", "score": 2, "replies": []}]}, {"body": "Wait the cybertruck is also a boat?\n\nhttps://www.instagram.com/p/B5-0vmLBEwp/?igshid=k791ired9jo2", "score": 1, "replies": [{"body": "Please don't believe everything you see on the internet", "score": 13, "replies": [{"body": "Most cars and trucks can be a boat.  ... just for how long, that's the question.\n\nI'm curious how the guy in that render is supposed to control it.  With his phone?  Maybe have the wings fold completely down revealing hydrofoils.  Make it more interesting...", "score": 1, "replies": [{"body": "The controls are likely located in the tinfoil hat", "score": 5, "replies": []}]}]}]}]}
