{"title": "U.S. judge says Amazon likely to succeed in Defense cloud contract challenge", "selftext": "", "id": "fey4dy", "created_utc": 1583601440.0, "score": 170, "upvote_ratio": 0.96, "num_comments": 83, "comments": [{"body": "MSFT 4/17 $195 here! I'm dead!", "score": 100, "replies": [{"body": "Sold mine Friday for THREE WHOLE DOLLHAIRS", "score": 52, "replies": [{"body": "lol, at that point why wouldn't you just ride it out", "score": 23, "replies": [{"body": "I sold mine at for $7, couldn't stand looking at them every day", "score": 29, "replies": [{"body": "Actually, I feel that.", "score": 20, "replies": [{"body": "tempting. but im gonna hold and watch it goto $0.01 as a reminder of what a window licking asshole I am", "score": 16, "replies": []}, {"body": "Word.  I like to clear the red sometimes.  Pretend like I am an expert with all my green puts.", "score": 2, "replies": []}]}]}, {"body": "What. Fuck that. Do you know how many gumballs you can get for $3?", "score": 8, "replies": [{"body": "Depends on the size of the gumball.", "score": 2, "replies": []}]}, {"body": "I had some 3/20s that were down over 80% several weeks back. I sold them all and made it all back on SPY puts. If you hit 0 you can't come back", "score": 2, "replies": [{"body": "I've had May contracts that were up 200%+ at times, same with TSM..\n\nI'm just gonna a ride it out. I've already made the money back on TSLA calls and puts since then. It does suck seeing that red text every time I open etrade", "score": 1, "replies": []}]}, {"body": "Bc it just wasn’t going to do anything. I made the money back other places and was still way up for the month. I’m not mad at it.", "score": 1, "replies": []}]}]}, {"body": "Is there a reason why you can’t sell calls agains the ones you already own? In this high IV environment, converting it into a spread could lessen the pain.", "score": 5, "replies": []}, {"body": "Set up some calendar spreads ya dummy", "score": 3, "replies": []}]}, {"body": "MSFT $200c 3/20 anyone still alive?", "score": 65, "replies": [{"body": "Dumped my 3 for 150 bucks a couple days ago, ate a $700 loss but glad i got out of $MSFT March calls. Looking at late April now.", "score": 28, "replies": [{"body": "Dumped mine like 2 weeks ago for about 2k loss but made up for it with SPCE calls", "score": 7, "replies": [{"body": "I wish i wouldve had the balls to do SPCE calls, meme stocks scare me, so i went half balls deep and picked up 10 shares at 18.50ish and sold for 31ish iirc. Never gonna be a P00sy, again. When WSB pumps, its all in", "score": 6, "replies": [{"body": "Msft was a meme stock here and it fucked a lot of people. Don’t feel bad. Also, SPCE is really stupid company to expect to ever be profitable.", "score": 6, "replies": []}]}]}]}, {"body": "No I’m dead", "score": 5, "replies": [{"body": "Hi dead, I’m dad.", "score": 2, "replies": []}]}, {"body": "Yep, clutching all the way to the bottom", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "https://i.imgur.com/K0kKe5e.jpg\n\nI’m on the other side. Picked up 1 min before close. Let the best autist win\n\nEdit: AMZN 4/17 1800P", "score": 16, "replies": []}, {"body": "It’s a $10B contract that had little to impact to their share price when they lost it lol. Good luck though", "score": 8, "replies": []}]}, {"body": "So would the next lowest bidder get the contract or will it be Re-Bid?\n\nAnd yes, my MSFT calls and leaps are dead AF!", "score": 21, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "He’s so spiteful I see this being the only alternative smh.", "score": 20, "replies": []}, {"body": "Nah, it’ll go to IBM or Google or someone who clearly shouldn’t have it.", "score": 7, "replies": []}]}]}, {"body": "Bezos, the richest man in the world, just paid the govt big fuck you to Microsoft. I wonder what Gates will say about this.", "score": 26, "replies": [{"body": "Bezos actually lost the contract because of his ownership of the Washington Post which is hyper-critical of Trump.\n\nThis is why this lawsuit is a thing. Bezos didn't have to pay anyone, if the world is just.", "score": 15, "replies": [{"body": "Your statement is incredibly bias and misses every shady thing amazon did throughout the sales cycle. You’ve already accepted that Trump stepped in on the government contract and gave it to Microsoft. Completely forgetting that Oracle’s CEO was on Trump’s transition team. If Trump stepped in he would have gave it to Oracle not Microsoft. \n\nMicrosoft is ahead of amazon in terms of gov readiness. Amazon is ahead of Microsoft in terms of # of use cases. Oracle is ahead of amazon in terms of technology.", "score": 16, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Amazon has an autonomous database? Since when?", "score": -13, "replies": [{"body": "[deleted]", "score": 17, "replies": []}, {"body": "Wtf does an autonomous database mean", "score": 7, "replies": []}, {"body": "Lmao when I see sales people smashing random tech words together I assume people on the outside also think they are just idiots but people like you actually just eat it right up", "score": 1, "replies": []}]}]}, {"body": "How is Microsoft more government ready? AWS has had an air gapped single tenant government cloud offering for several years now. Microsoft has what, sold them Windows and Word?", "score": 10, "replies": [{"body": "AWS is garbage in SE Asia and South America. So shut the fuck up.", "score": 1, "replies": [{"body": "No one’s talking about SEA or South America. We’re talking about US government contracts. \n\nAnd from a scan of Azure’s website they’ve got 1 PoP in Brazil and (some number) or availability zones in SEA so how are they any better.", "score": 4, "replies": [{"body": "Quality = more money. So numbers doesn’t really count in this case since companies prefer cheaper products. So with new technology and services that is already an upgrade, I’d go with the cheaper option too.", "score": 2, "replies": []}]}, {"body": "lmao okay. My companies chilean branch doesn't seem to have any problems with AWS, they seem to like it more than we do. Also lol who cares.", "score": 1, "replies": []}]}, {"body": "not sure who would be considered more ready between them, but looks like it goes well beyond windows and word-fyi:\n\nhttps://www.crn.com/microsoft-reveals-new-azure-government-secret-data-centers\n\nhttps://docs.microsoft.com/en-us/azure/azure-government/documentation-government-welcome", "score": 0, "replies": [{"body": "Yeah azure government cloud was built to compete with aws govcloud basically for this contract but also to compete in general with AWS. It came out 5 years after the AWS offering. Not saying it’s not a good service, but AWS has been doing it for years already.", "score": 1, "replies": [{"body": "that link was referencing improvements and not sure when it was established, but saw a search result link from 2016 indicating azure government cloud was not new even back then", "score": 0, "replies": []}]}]}]}, {"body": "Why is Microsoft more ahead than Amazon in terms of gov readiness?", "score": 4, "replies": [{"body": "Great question. \n\nCompanies have been developing a new model for delivery of their services. Traditional IT is considered on-prem or on premise technologies. That can range from servers to applications. Technology vendors have been developing “cloud” technology for years and have been pushing this to market. However, because true cloud or “public cloud” is hosted in a vendors data center people are skeptical of using vendors because they don’t control everything. This means all the responsibility is on the vendors to secure everything. \n\nSince cloud is the new way of deploying IT solutions and people are starting to accept the model more governments want in on the benefits of cloud. \n\nBut since the government won’t be in full control of the cloud (see Microsoft, IBM, AWS, Oracle gov data centers) they need a way to ensure security, deployment, and capabilities are met. This is called fedramp. There are multiple levels in getting certified for usage from the government.", "score": 3, "replies": [{"body": "Only dd in this thread", "score": 1, "replies": []}]}]}, {"body": "Your first mistake is being retarded enough to think Oracle could serve the JEDI contract. \n\nYou lose all credibility with that one.", "score": -1, "replies": [{"body": "Your first mistake is saying I’m implying Oracle should have won that contract. \n\nYou lost all credibility.", "score": 3, "replies": [{"body": "> Completely forgetting that Oracle’s CEO was on Trump’s transition team. If Trump stepped in he would have gave it to Oracle not Microsoft.\n\nYou're actually retarded. You should give up now.", "score": -6, "replies": [{"body": "Good. You’ve figured out how to use quotes on reddit. \n\nNow, find out where I said oracle should have won. Do it, monkey. \n\nI implied that Microsoft should have won and should keep the contract because they are more gov ready.", "score": 9, "replies": [{"body": "I told you to give up, and you're just making yourself look even more stupid. Honestly, some people have no self-awareness. It's cringe.", "score": -6, "replies": [{"body": "Can’t argue back. Got it.", "score": 7, "replies": []}]}]}]}]}]}]}, {"body": "Law and order is hanging on... Somewhat. For now.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "This is the whole reason the fucking lawsuit even exists.", "score": 5, "replies": []}, {"body": "Bezos is one of Trump's enemies. You are very naive and/or playing a dumb false equivalence game.", "score": 1, "replies": []}]}]}, {"body": "Azure is never a competitor to AWS. GCP is far better compared to Azure.\n\nIf Microsoft split their cloud revenue and Office revenue, people will know they really don't have staggering growth in cloud.", "score": -10, "replies": [{"body": "Lol you have no idea", "score": 2, "replies": []}]}]}, {"body": "Federal Contracting Officer here.\n\nSome of the lede's buried here, but the protest will likely just cause a re-compete rather than all-out override of the awardee. CICA stay more-likely with a possible override.\n\nThis really doesn't impact either if the protest is sustained.", "score": 5, "replies": []}, {"body": "AMZN should head up Monday then. So puts after it rises?", "score": 3, "replies": []}, {"body": "it's named jedi because Gates is a Jedi, musk and bezos playing with rockets and Gates has literally been preparing for a global pandemic.\n\nThis is why Bezos cant have, not a jedi.\n\njuly 165c msft, I expect this 5% adjustment off some lines I drew with a crayon.", "score": 3, "replies": []}, {"body": "Iv never used amazon cloud services but Iv never recognized them as a tech company. Microsoft produces everything clean and in high quality look at xbox controllers", "score": -6, "replies": [{"body": ">Iv never recognized them as a tech company.\n\nYou belong here", "score": 3, "replies": [{"body": "Bruh what has amazon made besides Alexa, Ill wait...", "score": 0, "replies": []}]}, {"body": "Do more research.", "score": 6, "replies": []}, {"body": "AWS is the leading supplier of cloud computing by a very long way. Their technical breakthroughs are better than Google's who have been in the game far longer.\n\nMicrosoft are always behind the times. They're just doing their usual catch-up now.\n\nI would go so far to say that Amazon has ALWAYS been a tech company, considering their first presence was ONLINE bookstores. Think of Tesla to the car industry.", "score": 4, "replies": [{"body": "Netflix runs on AWS, correct?", "score": 3, "replies": [{"body": "Primarily AWS. Most major startups uses AWS.\n\nThe ones who doesn't are directly competing with other Amazon products, that's the primary reason to go for competitors. \n\nGCP is good for all ML related cloud products. \n\nOld school Enterprise folks are bound to use Azure and most of them are locked into windows ecosystem.", "score": 2, "replies": []}, {"body": "I would imagine they are split among at least 2 of the big 3 at this point.", "score": 0, "replies": []}]}, {"body": "Another thing is without being a tech company it will not be able to scale at the demand created by the customers. You are right. AWS is the leading cloud company and a pioneer. \n\nWhy isn’t Google in the race for this contract? They weren’t able to provide a competitive plan compared to Microsoft or Amazon. According to the comment’s author, Google is probably a tech company but not Amazon, which is a wrong view. \n\nAnyway, who cares since WeWork claims to be a tech company. So there is that.", "score": 1, "replies": []}]}, {"body": "Xbox. Lol\n\nYou never worked in tech have you? They still haven't perfected their windows for over 20 years now.", "score": 0, "replies": []}, {"body": "I mean, you have watched netflix right?", "score": 0, "replies": []}, {"body": "AWS is THE BEST cloud provider there, by a long shot. They are years ahead in terms of technology over their competitors . ORCL is competing but failing miserably. MSFT is better than ORCL, but far behind AWS. The only reason AWS lost the contract is Trump's personal hatred of Bezos (and Washington post).", "score": 0, "replies": []}]}, {"body": "Gross AMZN is a monopoly getting spooky how big they are", "score": 0, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "If this were a real 'judge' he wouldn't be commenting on another judge's case. Politics are always a wild card.", "score": 2, "replies": []}]}, {"body": "So dump MSFT leaps ? :(", "score": -2, "replies": []}, {"body": "Technically AWS deserved that contract for the better good of America but Trump and his personal envy intervened", "score": -4, "replies": []}]}
{"title": "The ultimate collapse of the modern financial system? Eurodollar, Current and the late 2019 Repo crisis and Deutsche bank going bust", "selftext": "[removed]", "id": "fezfqi", "created_utc": 1583606761.0, "score": 289, "upvote_ratio": 0.97, "num_comments": 88, "comments": [{"body": "TLDR", "score": 51, "replies": [{"body": "TLDR \n\nPuts", "score": 42, "replies": [{"body": "Puts are worthless if the whole system fails. Long gold.", "score": 33, "replies": [{"body": "[deleted]", "score": 45, "replies": [{"body": "If the whole system fails, buy guns.", "score": 29, "replies": []}, {"body": "Buying that Himalayan salt bruh bruh", "score": 21, "replies": []}, {"body": "You can’t eat gold bro, that’s why I hoard whiskey and weed.", "score": 8, "replies": []}, {"body": "or food and ammunition. Anyone here around for Y2K preppers?", "score": 8, "replies": [{"body": "pshh just go to r/collapse", "score": 2, "replies": []}]}, {"body": "You need tendies from gold and gold miner calls before you can switch to physical", "score": 3, "replies": [{"body": "most towns have a store where you can buy it ;)", "score": 2, "replies": []}]}, {"body": "Buy lobsters", "score": 2, "replies": []}, {"body": "When no one has money how would you sell physical gold?", "score": 1, "replies": [{"body": "Trade it for goods", "score": 1, "replies": []}]}]}, {"body": "Long real gold", "score": 1, "replies": []}, {"body": "Buy canned beans you can't eat gold", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "I still don't get how Eurodollar works. \n\nIf a non-US bank attempts to lend out USD denominated debt, that loan can't be spent unless the receiving party also accepts Eurodollar. \n\nSo, is it real that so many organisations outside the US economy accepts Eurodollar?  Or is it all just a conspiracy, or is there more to it than my simple understanding?", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Holy fuck.", "score": 3, "replies": []}]}]}]}]}, {"body": "If WSB was a bank, we would be Deutsche Bank.   \n49T in derivatives, 7.5B marketcap.", "score": 49, "replies": []}, {"body": "I came to this same conclusion a few weeks ago so it’s nice to see someone else piecing the liquidity crisis together. I have a tough time seeing DB going bankrupt as it is so systemically connected to the US banks which is why the Feds and even JPM has gone out of its way to provide short term liquidity to repo markets. The world sends their money to the US as safe haven, we use that money to buy cheap shit from China with their own money, and Europe’s been fucked with stagflation so they borrow our money to keep afloat. Globalization is great until it isn’t. \n\nI can see this going two ways. 1) DB is bankrupt and made an example of re:Lehman brothers 2) the world central bank rescue it and we kick the debt can down to the next generation", "score": 50, "replies": [{"body": "I'd guess option 2 - I just don't see the ECB ever allowing DB to go under.", "score": 18, "replies": []}, {"body": "... Sir this is a Jambajuice\n\n(I seriously doubt they will allow one of the worlds biggest banks to implode and take the Euro down with it. They will enter QE Infinite mode instead.)", "score": 28, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Many other countries have good yields, but they have many systemic issues like china. So the combination of good yields and no systemic issues make usa the best place to hold money", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "good point. all those 3 usually go up during crises, but not the usd. thank you", "score": 2, "replies": []}]}]}]}, {"body": "Which means we can't even try to profit. Buy puts when? They can prop it up for 5 years lol", "score": 2, "replies": []}]}, {"body": "There are some fundamental misunderstandings about the current financial system and the role of the central bank.\n\nRepos are the new normal since the GFC since short term liquidity has moved from unsecured LIBOR markets to secured repo markets.\n\nThe central bank is no longer primarily supporting single institutions but whole markets due to the rise of shadow banking which needs to be accounted for.\n\nIf you want to learn more about the current system, I suggest reading up on Perry Mehrling‘s stuff. His money and banking courses are available for free on his website", "score": 32, "replies": [{"body": "Are you saying that instead of interbank settlements being carried out under LIBOR, settlements will be carried out by the US central bank providing liquidity to the global financial market on a daily basis?  I thought the shadow banking market is what everyone is worried about as you have US banks running out of cash to keep foreign client banks solvent. \nReal question not shade.", "score": 11, "replies": [{"body": "It helps to understand that the dollar has two layers: \n\nThe first layer is central bank money (reserves) and payments are ultimately settled in reserves. Reserves can either be cash (notes) or account balances that banks have with the Fed. This first layer money never leaves the banking system and only banks with access to the Fed can have it.\n\nThe second layer is money that banks can create themselves out of thin air. When they grant you a loan they create a claim against you on the left side of their balance sheed and they create your deposits on the right side of their balance sheet. \n\nWhen you wire transfer your deposits to another bank you instruct them to transfer reserves to the other bank, since that is what payments are settled with. Therefore banks can create as many loans as they want and are only limited by their ability to generate reserves.\n\nThis is where central banks come in. In order to get reserves, banks participate in Repo auctions and can get reserves against collateral. It used to be that collateral needed to be really good, but the quality has decreased a lot lately so that the Fed even accepts CDOs or regular bank loans that they just created.\n\nSince shadow banks (which is really just a fancy word for Asset Managers, Dealers/Brokers and SPVs or foreign banks) do not have access to the Fed, they rely on other banks that DO have access to the Fed to lend them reserves. This used to be the case in the unsecured LIBOR market overnight, and if there was any doubt that a player was not solvent, simply nobody would lend to them overnight. In order to stabilize this, the Fed was running QE in order to channel reserves into the shadow banking system by buying assets (CDOs, bonds, etc.). Nowdays, the secured Repo market has replaced the unsecured interbank market by a larger extent since the need for trust is lower.\n\nIn a crisis just like today even the interbank repo market is drying out a bit since the value of collateral in foreign markets is questioned and US banks are protecting their reserves. Therefore the Fed is jumping in to establish trust in market liquidity again by pumping reserves into the market and show their lender of last resort function (today also dealer of last resort). In essence your first question can be answered with yes, even though there may be some middlemen but essentially this is what is happening\n\nI have to run now but can answer more later - check out the Perry Mehrling stuff since it is really fascinating!", "score": 13, "replies": [{"body": "So lowering rates per your model would lead to an increased future necessity for QE/injection. As previously, the first bucket of money would grow by 2,3,4+% and could be leveraged against as needed. But now with lower rates, the size of the first bucket grows much slower and can't keep up with bucket 2's demand for money. So leverage ratios increase as banks seek yields desperately to turn into bucket 1 money as fast as possible. Hence the necessity for leveraged eurodollars as intl banks can't get enough dollars because the real supply isn't keeping up with demand due to low rates.", "score": 6, "replies": []}, {"body": "Thanks for the detailed explanation! It seems like as the economy slows this will become a regular necessity. I’ll look up Mehrling.", "score": 3, "replies": []}, {"body": "Could i get a source on fed accepting lower quality collateral?", "score": 2, "replies": []}]}]}]}, {"body": "DB has been drilling ultra hard the last couple weeks, so I'm sceptical ramming some extra shorts up it's ass. If the FED cuts again, the scaredy cat boomers at ECB will follow and that would be when they tank real bad.\n\nThey will never go bankrupt though. As a German, I can absolutely assure you of that. They will be bailed out with taxpayer money, no matter the cost. Germans are good little taxpayers.\n\nAlso, please keep HSBC afloat. I buy my derivatives off those retards.", "score": 17, "replies": [{"body": "> the scaredy cat boomers at ECB will follow\n\nIf they do that, aren't they going to tank the entire banking sector with negative interest rates trying to save one bank?", "score": 3, "replies": []}, {"body": "If HSBC goes bust and can’t pay me out for my puts on TR I’m gonna be hella mad.", "score": 1, "replies": []}]}, {"body": "TL;DR: Puts on DB @ 0.69 exp 4/20", "score": 16, "replies": []}, {"body": "Great write up.\n\nMy biggest question would be who are the largest counter-parties douche bank has exposure too. That could be where the best shorting opportunities may be.", "score": 32, "replies": [{"body": "🤔🌈🧸🤑👍", "score": 12, "replies": []}]}, {"body": "So.. puts in Deutche Bank?", "score": 13, "replies": [{"body": "yes when it goes to 0 you hit jackpot 😂 and the stock is already so low there is basically no OTM hahaha", "score": 7, "replies": []}, {"body": "Been saying", "score": 2, "replies": []}, {"body": "My TA checks out as well. Volume is there. Breaking supports. This shit is absolute garbage. Not to mention puts are so fucking cheap. Deutche to 0 insiders and big bois know something everyone else has to guess on. \n\n[https://www.tradingview.com/x/mG79wCtd/](https://www.tradingview.com/x/mG79wCtd/)", "score": 2, "replies": []}]}, {"body": "I just read all of this and holy shit man, you connected all the dots I needed connected after last week's DD post. \n\nIf anyone else is wondering if this is worth the read, it is.\n\nIf you don't understand what it means, then get the fuck out of here.", "score": 11, "replies": []}, {"body": "So puts, but sell them before the financial system collapses. Gotcha boss", "score": 8, "replies": []}, {"body": "the day WSB merged with zerohedge... what a month", "score": 5, "replies": []}, {"body": "All this repo talk and snider mentions - anyone actually checked the TIC numbers for the supposedly doomed countries like India or Canada?", "score": 6, "replies": [{"body": "Anywhere you can link to find the Bond rates for provincial/municipal Canadian bond offerings?", "score": 3, "replies": [{"body": "Nah man, TIC - Treasury International Capital. It gives an indication of dollar squeeze for respective country and sector.", "score": 6, "replies": []}]}]}, {"body": "Sir this is macdonald", "score": 13, "replies": []}, {"body": "Will the Bundesbank let DB go down?", "score": 3, "replies": [{"body": "I doubt it", "score": 1, "replies": []}]}, {"body": "Sooo?\n\nFed will print and pump all it can.  Dollar is worthless.  Banks go tits up?\n\nBuy gold and gold miners.  If you're really hardcore buy physical gold or look into [bullionvault.com](https://bullionvault.com).  \n\nBut gold miners are good too.  They aren't trading paper gold.  It's real gold, just stored in the ground/stone.  Plus you get leverage on gold miners.  If there is hyper inflation, the miners debts implode.  If gold goes through the roof and the dollar lives, the miners revenue goes 3x the run up in gold.  They also significantly lag gold and we know there was a huge run up in gold, it hasn't totally played out in the mining stocks.  It's seriously free money.", "score": 5, "replies": [{"body": "$GDX is the ticker you’re looking for", "score": 2, "replies": []}, {"body": "NUGT calls all day baby", "score": 1, "replies": []}, {"body": "Are there specific mining companies you're looking at?\n\nI invested in a smaller one some years back, but they went bust when their mine didn't yield nearly as much as they thought it would.", "score": 1, "replies": [{"body": "I would suggest EFTs to spread the risk. GDX is a popular one. NUGT if you want a leveraged EFT", "score": 1, "replies": []}]}]}, {"body": "Banks that would be in trouble first in a financial crisis: Deutsche Bank, HSBC, Credit Suisse, and the \"Cadillac of all banks\" JP Morgan Chase.", "score": 4, "replies": [{"body": "Got puts on that “Cadillac“ bitch let’s gooo", "score": 2, "replies": []}]}, {"body": "> economic amateur... currently listening to weird music \n\nsoundtrack?", "score": 2, "replies": []}, {"body": "Holy shit that was long.", "score": 2, "replies": []}, {"body": "are American Banks just as exposed as European Banks or will this eurodollar crisis mainly impact the EU", "score": 2, "replies": []}, {"body": "Username checks out", "score": 2, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "PUTS ON DEUTSCHE", "score": 1, "replies": []}, {"body": "Brb", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Big", "score": 1, "replies": []}, {"body": "Dude, why is China missing from that economic impact chart?", "score": 1, "replies": []}, {"body": "I read bank puts, collapse and we'll make tendies. I'm in! But let me do my usual bear stuff first.", "score": 1, "replies": []}, {"body": "I tried searching tl;dr TWO FUCKING TIMES and only came up with your initial lines, where is it man?!", "score": 1, "replies": [{"body": "Try again, should be fixed", "score": 2, "replies": [{"body": "Sorry for shitposting, but I got a real question.\n\nSo I am an economic retard, literally.   \nBut what is stopping them to just load all this shitty debt onto, say, Deutsche Bank and cut it out like cancer?", "score": 1, "replies": [{"body": "In a market there is always a buyer and a seller.\n\n If someone like you buy stocks from brokers but the seller goes bust and don't give you the stock you would not trust it and may lead to you bankrupt if you borrow money from a bank.\n\nImagine it on a global scale.\n\nIf Deutsche bank gets everything and goes bust, the market will feel the impact since those dereatives are owned by someone else or owned by banks.", "score": 3, "replies": [{"body": "Yeah, but that seems to be already partially the case when you say DB operates in the billions, while holding derivates in the trillions?\n\nAll that they need is a regular cheap scapegoat at which the whole world can point it's finger, the rest will be done by the global human consciousness that really just likes to default to how things always were. Really, never underestimate the power of mind of a average Joe retard, they can life all their life in their own bubble and think all is okay, as long as basic needs are provided for.\n\nBut then again, that's just a autist theory.", "score": 1, "replies": []}]}]}]}]}, {"body": "Why no one is worried about \"Eurogold\" (or paper gold)?", "score": 1, "replies": []}, {"body": "If your that good at talking bullshit, go make a corporation.", "score": 1, "replies": []}, {"body": "People have been calling Deutsche Bank the new Lehman since summer 2016. A slow death is not “Lehman Brothers.”", "score": 1, "replies": []}, {"body": "Solid analysis, like puts on KBE for later in the year.  Think DB is fucked and will take Trump down with them, or get bought/bailed/Recapitalized out by Russian banks.", "score": 1, "replies": []}, {"body": "Just telling you there are problems with your DD, as you requested.", "score": 1, "replies": []}, {"body": "Lol, was 2015/16 and 2018/19 also all doom and gloom?", "score": -3, "replies": []}]}
{"title": "Any of you retards looking into psychedelic stocks?", "selftext": "There’s been some chatter about a couple of them IPOing in the next few months. Anybody looking into them? Potential to become a mini bubble? Let’s hear your thoughts my fellow retards", "id": "ff1ljx", "created_utc": 1583615398.0, "score": 19, "upvote_ratio": 0.83, "num_comments": 96, "comments": [{"body": "I'm looking into psychedelics. Screw the stock", "score": 114, "replies": [{"body": "I'm looking into addy. Screw psychedelics.", "score": 10, "replies": [{"body": "First time I tried addy I realized I had ADHD... I just sat there, calming down while my friends were tweaking out.", "score": 18, "replies": [{"body": "guess the convo with your GP to get your meds was fun.", "score": 3, "replies": [{"body": "Nah I just took the test and went to CVS afterwards. Save that shit on weekends sometimes and it's literally free money.", "score": 5, "replies": [{"body": "Those tests are hilarious. just a way to justify prescribing that most people will pass. It’s all questions about attention span that any idiot can get right.", "score": 3, "replies": [{"body": "Uh not really. It depends on the person testing you, I tried 2 different ones before finding literally the most amazing doctor I've ever interacted with. I'm very lucky.\n\nThe test for the two previous docs were pretty close to what you described, but the third one was actually useful. It was an all day affair, 9-3:30 with an hour lunch break. I got extremely extensive results, including USA and global percentiles for my intelligence, personality traits, etc. Part of it might have been because it was also an IQ test.\n\nI made light of the test and medication, but that was actually the biggest breakthrough of my life. It's hard to quantify how much it actually helped me, but it's made a *crazy* difference for me. \n\nI also don't sell it because it's made such a big difference to me that I don't *want* to not take it.", "score": 0, "replies": [{"body": "Am psychologist, the tests are standardized. Sounds like you got a full mmpi and IQ test, which was us useless but can be billed for hundreds, if not thousands of dollars. Useless for adhd diagnosis but still fun to have done. \n\nMeds don’t actually help adhd symptoms, they just make the brain work faster/better, so the symptoms don’t matter. It’s not really a breakthrough, it just feels great to be stimulated.  and studies indicate that effect is mostly gone after 6 months of regular stimulant use. You can slow this by taking vitamin d and some b12/folate daily. Magnesium on the comedown will also slow tolerance build. Using it sparingly will extend this out even further. \n\nThe whole idea that adhd people’s brains works differently and the meds “normalize” this is woo woo bs we sell to uneducated people while making money pushing stims. Not that they aren’t awesome and fairly safe. \n\nSorry to be a downer I just got annoyed with the whole “breakthrough” vibe. \n\nAlso, fun fact. A study posted on /r/drugnerds would indicated cocaine is less neurotoxic than adderall, when taken at equal dosages lol. My field has literally just rationalized stim use to make it acceptable to the masses.", "score": 6, "replies": [{"body": "I should clarify what I meant by breakthrough; it wasn't as dramatic as I made it out to be, the \"breakthrough\" for me was just being able to *choose* to focus during the day. It didn't automatically make me focus, I was just able to block out the \"noise\" if I chose too. \"Greater self control\" is a good way to describe the effect in a couple words.\n\nI think the IQ test was valuable because it helped show me that my current performance in school (grad school at the time) was not my full potential. I should also add that the effect has not diminished in any detectable way after about four and a half years. And yes, I was told about the possibility of having to up the dosage because of tolerance issues, but I have not had to up the dose at all (15 mg). \n\nAnd I was never told my brain worked \"differently,\" I was just told that ADHD sometimes inhibited me from reaching full potential in my work and home life, which I think is a fair sentiment.\n\nIn my comment I almost made it sound like I was taking enough to get high off of addies, but my experience has been nothing as glamorous as my comment suggests. I actually also switched to placebo meds for a month without my knowledge, and it was a *noticeable* decrease in my personal performance. I keep a weekly log and I looked back at my notes from that period and it is a stark contrast from my notes w/ meds.\n\nYou obviously know more but I felt it would be valuable to share my personal experience.", "score": 3, "replies": [{"body": "It’s perfect to keep it low like that. That’s what I tell all my friends to do and is what I did for years. Not much risk at all from a low dose. Some indication it even protects against dementia.", "score": 3, "replies": []}]}]}]}]}, {"body": "The fuck. Good Lord I hate living in the EU.", "score": 1, "replies": [{"body": "I pay so much fucking money for Adderall dude. Literally *every fucking pharma company* makes it and I still pay 150 a bottle.", "score": 2, "replies": [{"body": "That's because you're expected to sell it to middle schoolers for profit", "score": 14, "replies": [{"body": "For profit? lmfao 30mg goes for like 2-3 dollars on the street. I bet middle schoolers would pay a lot more tho", "score": 3, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Holy fuck. People really be making mad bank on that shit, huh. GoodRx Generic addies are like 50/60 for a 3 month 20mg bottle I think, so much profit potential.\n\nFuck options I might just sell adderall", "score": 1, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Damn bro, Salt Lake City has some low ass rates. Or maybe I was looking in the wrong places.", "score": 2, "replies": [{"body": "People wanna get high, but they think it actually works. Atleast the ones who buy them", "score": 1, "replies": [{"body": "What does this comment mean", "score": 1, "replies": []}]}]}]}, {"body": "shit can i put in an order for like 20", "score": 3, "replies": [{"body": "It's no big deal, I'm a dumbass and misinformed. 10 is apparently the normal", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Just get some meth it's the same shit and easier to come by.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Don't brag bro!", "score": 2, "replies": [{"body": "Yeah you're right", "score": 1, "replies": []}]}]}]}, {"body": "Can you get me some lsd?", "score": 2, "replies": [{"body": "Just order it online", "score": 5, "replies": []}, {"body": "This didn’t used to be an issue. Then they arrested one dude in Nebraska in the late 90’s and overnight 80% of the US market lost its supply. Apparently he was the market.", "score": 2, "replies": [{"body": "Is this true? Link pls. But yeah it’s so hard to get lsd now.", "score": 0, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Imagine swimming in a jacuzzi of lsd", "score": 1, "replies": []}, {"body": "Thanks. Crazy shit", "score": 0, "replies": []}]}, {"body": "Come on out to the west coast it’s stupid cheap and all over", "score": 5, "replies": [{"body": "I’m on the other coast. So far away", "score": 1, "replies": [{"body": "My heart breaks for you stay strong my brethren 👊", "score": 2, "replies": []}]}, {"body": "I'm here and I really want some fungi", "score": 1, "replies": []}]}, {"body": "[here’s his wiki ](https://en.m.wikipedia.org/wiki/William_Leonard_Pickard)", "score": 2, "replies": []}]}]}, {"body": "Just get an analogue from a clear net site", "score": 1, "replies": []}]}, {"body": "Yes. Psychedelically looking at stocks.", "score": 2, "replies": []}, {"body": "Same.. microdosing is the way, with a quarterly mindfuck", "score": 2, "replies": []}, {"body": "I’m with you", "score": 1, "replies": []}]}, {"body": "I’m just going to buy puts expiring 8 months out based off no research.", "score": 19, "replies": [{"body": "This is the way.", "score": 5, "replies": []}]}, {"body": "Goddamnit I thought we taught you this lesson with the weed stocks", "score": 14, "replies": [{"body": "Shhhhh don't tell him.", "score": 2, "replies": []}]}, {"body": "Shut yo ass up", "score": 7, "replies": [{"body": "Suck me off", "score": 3, "replies": [{"body": "Stop fighting it you autist", "score": 5, "replies": []}]}]}, {"body": "SHROOMS ARE THE FUTURE OF THERAPY. 50 years from now, everyone is going to be popping psylocibin pills to start their day", "score": 13, "replies": [{"body": "But it's even easier to grow than pot", "score": 5, "replies": [{"body": "Weed is not easy to grow lol when its legal, you think people will be growing their own shit? No, they’ll be buying it from people that do it professionally because its more FIRE", "score": 4, "replies": [{"body": "It's a plant, how hard can growing it be lol. As long as you have some good seeds; you'll be saving hella money", "score": -4, "replies": [{"body": "That just shows you dont smoke. You need to keep the conditions perfect to grow GAS. Sure you can grow some boof at home, but it wont get you as high as what the pros are selling", "score": 6, "replies": [{"body": "I probably don't smoke as much as you, but at the end of the day i bet if you tried it; you'd be suprised", "score": 0, "replies": []}]}]}]}, {"body": "Have you grown them? Not true. Can't grow weed so bad it kills you/makes you sick.", "score": -1, "replies": [{"body": "Head on over to r/shroomery r/sporetraders and your set", "score": 1, "replies": [{"body": "Oh I'm an amateur mycologist, but is nowhere as easy as watering a weed", "score": 1, "replies": []}]}]}]}, {"body": "Could happen in micro doses", "score": 2, "replies": []}]}, {"body": "Losing enough on pot stocks. Fuck $ACB.", "score": 6, "replies": [{"body": "Fuck $ACB.", "score": 4, "replies": []}, {"body": "What’s fucked up is they’re still expensive relative to some other weed stocks", "score": 2, "replies": []}]}, {"body": "you misspelled SPY puts", "score": 4, "replies": [{"body": "Point made...", "score": 0, "replies": []}]}, {"body": "I feel like I’ve been hallucinating since 2017", "score": 3, "replies": [{"body": "This is your trip bro, you still are and it is 2017.", "score": 6, "replies": [{"body": "we're all tripping on salvia and ketamine right now in another dimension", "score": 1, "replies": []}]}]}, {"body": "Ban", "score": 8, "replies": [{"body": "Suck a dick nerd", "score": -13, "replies": []}]}, {"body": "Ban", "score": 8, "replies": [{"body": "Why?", "score": -18, "replies": [{"body": "Perma ban", "score": 18, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Same here but I fucking held like a pig.", "score": 1, "replies": []}]}, {"body": "Less profitable then weed so imo a bad investment. 100 doses of lsd goes for around 200usd with the lowest I've seen costing around 174 usd. Mushrooms are even worse because you can just grow them in some shit. People also arent taking these drugs often enough to make huge profits", "score": 2, "replies": [{"body": "lots of things sold as acid aren't really LSD. Mushrooms grown in shit aren't what people want. People generally don't like throwing up from eating cow shit right as they start tripping balls.\nThey want clean, tank-grown mushrooms.\n\nIt's unlikely that mushrooms will get widespread decriminalization/legalization anytime soon.\n\nMost of the stocks will be around supplying medical grade pill form natural mushrooms for therapy.", "score": 1, "replies": []}]}, {"body": "r/shroomstocks", "score": 1, "replies": [{"body": "Lol that there is actually an active subreddit for this.", "score": 6, "replies": [{"body": "Yeah but they probably “invest”, fuck that. I want no DD balls to the wall autistic plays", "score": -5, "replies": []}]}]}, {"body": "This post actually gave me the auts cord now I have the tisms", "score": 1, "replies": [{"body": "A soft dose of psilocybin will cure you.", "score": 4, "replies": []}]}, {"body": "Im long on $LSD", "score": 1, "replies": [{"body": "I'm long on $CUM", "score": 1, "replies": []}]}, {"body": "Yup. Been following the sector for a while.", "score": 1, "replies": []}, {"body": "Calling my drug dealing for calls as we speak", "score": 1, "replies": []}, {"body": "Growing is where the money is", "score": 1, "replies": []}, {"body": "Call MMED", "score": 1, "replies": []}, {"body": "Shrooms grow in dirt. \n\nI guess there is *some* value in synthesized drugs, but none of the good ones (LSD, MDMA, K, Psilocybin, whatever else is popular) can be patented and the whole value of pharma is restricting access to others and developing a monopoly. \n\nIf some big pharma company made some new drug it wouldn’t be as good as those either tbh", "score": 1, "replies": []}, {"body": "Real dd: none of the psychedelics currently in clinical development are patentable. Even the ones created in labs their patents expired decades ago. Perhaps some companies will try and patent a specific psychedelic therapy combo. \n\nExpect maybe that pharma from Brazil. The one developing 18-MC for opioid addiction?", "score": 1, "replies": []}, {"body": "Alcohol consumption goes up during recessions and breweries hold pretty decently, why not hallucinogens?", "score": 1, "replies": []}, {"body": "For whoever needs this.\n\nhttps://shop.magictruffles.com", "score": 1, "replies": []}, {"body": "BUY $MMED. Its at 40 cents rn. It will hit $30 in 30 years", "score": 1, "replies": [{"body": "And at one points it was at $0.92. I was so close to buying in at that price, thank god I didn't. Instant 50% loss.", "score": 2, "replies": [{"body": "How do you buy it?  Can one buy through RH or TD?", "score": 1, "replies": [{"body": "I’m in Canada. It was offered on BMO.", "score": 1, "replies": []}]}]}]}, {"body": "If this post is against rules I’ll delete, mods let me know", "score": -1, "replies": []}]}
{"title": "Short $INDA", "selftext": "I'm gonna keep it to the point.\n\n# a) India's debt problem is long overdue.\n\n[link:](https://preview.redd.it/2w4i6gknkbl41.png?width=1008&format=png&auto=webp&s=a10d70337818d55c442f7a7794538936927ce139)\n\n[https://edition.cnn.com/2020/03/06/business/india-yes-bank/index.html](https://edition.cnn.com/2020/03/06/business/india-yes-bank/index.html)\n\n&#x200B;\n\nyou can read more about how deep in shit the Indian economy will be [https://www.reddit.com/r/wallstreetbets/comments/fe5s7e/the\\_fed\\_repos\\_are\\_an\\_attempt\\_to\\_prop\\_up\\_the/?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/fe5s7e/the_fed_repos_are_an_attempt_to_prop_up_the/?utm_source=share&utm_medium=web2x)\n\n# b) The virus numbers are going to SPIKE.\n\nThe hygiene is bad. Most of the Indian population work minimum wages. They need to make bank so don't bother with the virus. **The numbers are low right now because the working class can't be bothered with testing. In a week or two, the numbers will spike.** This along with the above point will stab the economy if not cause a crash.\n\n# c) North India is fighting an Insect Plague.\n\nThe locust plague is said to be the worst in nearly 30 years. The pesticides used are killing the insects and the crops.\n\n[https://www.japantimes.co.jp/news/2020/03/06/asia-pacific/pakistan-locust-plague/#.XmQXZ0pS9PY](https://www.japantimes.co.jp/news/2020/03/06/asia-pacific/pakistan-locust-plague/#.XmQXZ0pS9PY)\n\n**My Positions:** Apr24 '20 27 put\n\nedit: India is also having the 'Festival of Colors' , this will increases the chances of spreading.\n\nMonday open might be the last chance to get on the ride.", "id": "ff2bla", "created_utc": 1583618397.0, "score": 79, "upvote_ratio": 0.89, "num_comments": 91, "comments": [{"body": "Only 🌈🐻s would dare short the world’s premier superpower of 2020", "score": 81, "replies": [{"body": "the virus will have a greater impact on emerging markets", "score": 10, "replies": [{"body": "This is true. USA is only feeling it, cause we’re the largest economy. Markets such as Africa and India are f**cked by a 🌈🐻 if it begins to spread", "score": 8, "replies": []}]}]}, {"body": "You son of a bitch, I did this Thursday.", "score": 54, "replies": [{"body": "Same, plus Germany.", "score": 21, "replies": [{"body": "Looking at the overextension of repos, I’d be more inclined to France and Italy as economies that will be crushed before Germany. Germany in all honesty has a great economy and Merkel is a smart bitch.", "score": 11, "replies": [{"body": "Yeah, I have March and April Puts on Italy as well. With Germany I have April and May puts. \n\nI also still have a June call on Michaels for some reason, lol.", "score": 3, "replies": []}]}, {"body": "What's Germany ticker?", "score": 4, "replies": [{"body": "$nein", "score": 27, "replies": []}, {"body": "I'm using the EWG, EWI, and EWJ index funds.", "score": 7, "replies": []}, {"body": "EWG puts here (as well as EWI)", "score": 7, "replies": []}, {"body": "DB", "score": 1, "replies": []}, {"body": "$HTLR", "score": -3, "replies": [{"body": "Not cool you gay", "score": 0, "replies": []}]}]}, {"body": "We’re all autistically psychic. Same on both.", "score": 1, "replies": []}, {"body": "And EWI for good measure", "score": 1, "replies": [{"body": "See my other comment. I'm holding puts against EWJ, EWI and EWG. :)", "score": 1, "replies": [{"body": "Shittt you got it", "score": 1, "replies": []}]}]}, {"body": "Don't bet against Germany. Try Italy instead", "score": 1, "replies": []}]}, {"body": "I fukin posted about INDA Thursday and the gay mods removed it. Puts on curry.", "score": 1, "replies": []}]}, {"body": "I bought the 4/13 29.5s on Friday before the close.\n\nNeed only a 3% move to be ITM.\n\n[obligatory \"positions or ban\" ](https://imgur.com/a/sn7sBJ9)", "score": 13, "replies": []}, {"body": "Shit these puts are super cheap I'm gonna buy them for like April good luck make your money before everyone has no money.", "score": 12, "replies": [{"body": "Exactly my point", "score": 5, "replies": []}, {"body": "The main issue I'm seeing is it barely moves though I really think oil is a faster return right now just short all the oil companies lol", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "😂", "score": 4, "replies": []}]}, {"body": "Bruh this thing is highly correlated with spy imo", "score": 20, "replies": [{"body": "Yeah, but the contracts are dirt cheap compared to spy", "score": 22, "replies": [{"body": "Dirt cheap != money", "score": -3, "replies": [{"body": "It will when this bitch tanks", "score": 16, "replies": [{"body": "Better play nibba HSBC IBN TTM", "score": 3, "replies": []}]}]}]}]}, {"body": "What is the chance of the beer virus evolves and intoxicates the locust?  The locusts will become too drunk to eat anything.", "score": 17, "replies": [{"body": "Hundred percent", "score": 6, "replies": []}, {"body": "This DD right here 👌🏼👌🏼👌🏼", "score": 7, "replies": [{"body": "👍", "score": 2, "replies": []}]}]}, {"body": "Last I looked, $INDA had such low volume and open interest I didn't bother making the play.", "score": 6, "replies": [{"body": "Ball's in your court", "score": 1, "replies": []}]}, {"body": "Idk it barely moves just short all oil companies instead faster returns", "score": 5, "replies": []}, {"body": "Delete this so all the retards don’t hop in.", "score": 13, "replies": [{"body": "What makes you less of a retard than anyone else", "score": 12, "replies": [{"body": "He's not saying he's not one. \n\n\n'Tards are very territorial. This one just feels threatened.", "score": 13, "replies": [{"body": "He’s a bottom bitch tard", "score": 2, "replies": []}]}]}, {"body": "You should be banned. If you are going to make a statement, provide your reasoning.", "score": 5, "replies": [{"body": "Defaults don’t happen in a month. Nor do they happen in 2 months. These strikes are far too soon compared to the reality. If the US Fed doesn’t just sit back and watch our economy tank, what makes you think India’s will? Kinda like the big short....they were too early in the market. Same goes for this.", "score": 2, "replies": [{"body": "Your assumption is Indias problems are just barely starting. Indias problems have started 4+ years ago. The software consulting industry is on a downward slope, auto industry is getting killed by the transition to EV and lack of innovation, agriculture has been suffering. The beer virus is just going to open the dam up", "score": 5, "replies": [{"body": "Perhaps. I’m gonna buy some puts myself, but more so as a lottery ticket and less so because I think it’ll happen so abruptly. You’re talking a 10% drop in a word economic powers economy within 15 days.", "score": 1, "replies": []}]}]}]}]}, {"body": "i’ll just leave this here\n\nhttps://youtu.be/C6Px8se15XQ", "score": 5, "replies": []}, {"body": "TL;DR: Puts on bobs, calls on vagene", "score": 6, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "OP. One question, why do you think that these defaults will happen within 2 weeks when I can miss my car payments for 3 months before people start defaulting? I think you are correct, but how do you time the market? I think your calls are too soon imo.", "score": 3, "replies": [{"body": "I honestly think people are disregarding the disease there. I think a lot of people have it right now but they are just waving it off. Within the next two weeks, those people will be down and the will cause a crisis/panic.", "score": 1, "replies": [{"body": "But I think they’ll just keep waiving it off. For months even.", "score": 2, "replies": [{"body": "The virus becomes really severe after 12 days. How do you think they are going to wave off people dying left and right!?", "score": 0, "replies": [{"body": "They won’t, but April is too early. More like 6+ months expirations", "score": 1, "replies": []}, {"body": "Bro, you came to fast, like always", "score": 1, "replies": []}]}]}]}]}, {"body": "Good, thanks", "score": 2, "replies": []}, {"body": "I've got a couple of 4/17 30 dollar puts. Feeling good about them  normally dont hold more than a week but I might ride these out till the end of march", "score": 2, "replies": []}, {"body": "IBN 4/17 $12P\n\n&#x200B;\n\nedit: now im starting to look at other tickers in India.  I think the individual tickers are subject to bigger moves than the ETFs but what do i know.\n\nFound HDB, an indian bank traded on NYSE.  spread kinda sucks on the options", "score": 2, "replies": []}, {"body": "EWZ. Carnival ended a week ago. I have a small account. I bought the $31 put for .3 there are around .37 now. Monday might be the last chance to hop on those.", "score": 2, "replies": []}, {"body": "INDA 29 4/9 in", "score": 2, "replies": []}, {"body": "Short Big Curry", "score": 2, "replies": []}, {"body": "agree with the short, their banking system is gonna get fucked, yes bank has already collapsef", "score": 2, "replies": []}, {"body": "Festival of COVID-19 coming to you live: [https://www.facebook.com/watch/?v=10157396843738992](https://www.facebook.com/watch/?v=10157396843738992)", "score": 2, "replies": []}, {"body": "Making Tendies off this", "score": 2, "replies": [{"body": "I'm 200%up", "score": 1, "replies": [{"body": "I was until about 10 minutes ago- but shit will hit the fan tomorrow. India just reported its first death and the number of confirmed cases just went up a bunch", "score": 1, "replies": []}]}]}, {"body": "You're already late bro.  Jumped on puts early last week.  Corona and curry go together like beer and cereal.   India is in trouble", "score": 2, "replies": []}, {"body": "I jumped in on Friday. There will be blood!", "score": 1, "replies": []}, {"body": "This one actually makes sense, thanks", "score": 1, "replies": []}, {"body": "Short literally any developing/ less developed country like India, Brazil, Canada (cause fuck Canada)", "score": 1, "replies": []}, {"body": "10 Contracts- Puts for 4/17 at 26", "score": 1, "replies": []}, {"body": "Gas is super cheap. This will help India get through this temporary situation", "score": 1, "replies": []}, {"body": "Makes sense, though I think the puts should be longer out. I'm in on IBN, INDA, TTM puts", "score": 1, "replies": []}, {"body": "I love how people on this thread went and took his position, then this morning bid it up past the point where options with a higher strike price, and with far more time, had lower option premiums. Well played, degenerates.", "score": 1, "replies": []}, {"body": "Yeah Go short \n\nIndia's majority of the population is young \n\nwould love to have your money", "score": 1, "replies": [{"body": "\\-10% today rofl", "score": 1, "replies": []}]}, {"body": "Late af to this", "score": 1, "replies": [{"body": "Not really, New York declared emergency a couple of hours ago and Italy is facing lockdown. It's only a matter of time the infected Indians get recognized (which will most probably happen within this week or the next) then this bitch will tank like whore on a Saturday morning.", "score": 7, "replies": [{"body": "Once it’s mainstream news you missed it. Thursday night the indian banking system collapsed you are late to the party.\n\nEdit: please don’t waste your money on this premiums will be too high Monday but try it out in the paper trading comp if you are right I’ll give you $250 venmoed", "score": 5, "replies": [{"body": "I think you can get a good price at open. No doubt the premiums will rise.", "score": 3, "replies": []}]}]}]}, {"body": "But isn't India maybe too warm for the virus to cause as much damage as it does in colder countries?", "score": 0, "replies": [{"body": "Iran is warm. This virus doesnt care about temp", "score": 0, "replies": [{"body": "Its 9°C over there right now.", "score": 3, "replies": []}]}]}, {"body": "This is stupid.\n\nYou might be right.\n\nBut...\n\nDon't short one of the major growth economies. It's an unnecessary risk.", "score": -2, "replies": [{"body": "Ok boomer", "score": 7, "replies": [{"body": "Now listen here you little shit...", "score": -1, "replies": []}]}]}, {"body": "💮 is this racist", "score": -2, "replies": [{"body": "No u", "score": 6, "replies": [{"body": "No you both", "score": 1, "replies": []}]}]}]}
