{"title": "Recovery may come sooner than you expect", "selftext": "I think the big players are watching the situation in Italy and how it'll unfold. That is the closest model for America and Europe in terms of culture (Western democracy that isn't welding people's doors shut), medical quality, and demographics (Italy is full of boomers but America is full of fat fucks, so they're both equally susceptible to death from the virus) because we'll never copy China's or Korea's containment measures, and Iran has no containment measures. Right now the market is dropping because of the UNCERTAINTY of how bad this thing will get. If new cases taper off soonish in Italy then there's a higher confidence of lower global damage (unless reinfections are possible...). Not saying we'll be back to ATH immediately because damage has already been done/will be done, but at least it'll slow the hemorrhaging. Just watch out for what happens in Italy.", "id": "ficiis", "created_utc": 1584157652.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 93, "comments": [{"body": "Positions or ban this fuck", "score": 105, "replies": [{"body": "Positions or eat my ass", "score": 21, "replies": [{"body": "SPY 3/30 $180p. I'll eat your ass for free.", "score": 21, "replies": [{"body": "😘", "score": 7, "replies": [{"body": "I want in bitches", "score": 4, "replies": [{"body": "It’s not gay if it’s a three way!", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Absolutely no way", "score": 20, "replies": [{"body": "This, sars 2 is a ADE infection, it’s antibodies make it easy to overload your system on second infection.", "score": 11, "replies": [{"body": "Source?", "score": 2, "replies": [{"body": "He saw it on 4chan. Its legit.", "score": 5, "replies": []}, {"body": "Ncbi, look for the info. Google sars, bat virus you can see we’ve fucked with  this shit since the 70s at least.", "score": 1, "replies": []}]}]}, {"body": "Agreed. The death rate in Italy is like double what was reported by China. Who do we believe more?", "score": 2, "replies": [{"body": "china- italy likely had the spread go on for much longer, death rate inflated by lack of testing.", "score": 2, "replies": [{"body": "Hmmm Italian incompetence or Chinese manipulation, which one is more endemic and likely to affect numbers?\n\nI too go with Italian incompetence.", "score": 3, "replies": []}]}]}]}, {"body": "Nice opinion. Now ban.", "score": 28, "replies": []}, {"body": "And folks, this is why we haven't even come close to bottom. Plenty of people thinking like this/not even realizing what is happening yet.", "score": 44, "replies": [{"body": "I work in retail, these business as usual fucksticks who haven't paid attention to the news in 2 months went full panic today.  There's no way this end of day stock pump is gonna last past 9:31 AM on Monday.  Puts!", "score": 25, "replies": [{"body": "I think this is the top. Everyone knows now.", "score": 5, "replies": [{"body": " where's the bottom", "score": 1, "replies": [{"body": "When they ban domestic travel.", "score": 9, "replies": [{"body": "When they quarantine entire cities and hospitals fill up with the dead and dying. It's coming, it's just math and physics.", "score": 5, "replies": [{"body": "Kind of fucked up that I lowkey wish for this kind of stuff to happen so I can profit. I might get some calls just to cover for shit like what happened today.", "score": -2, "replies": []}]}]}]}]}]}, {"body": "Exactly! Worse yet to come!", "score": 3, "replies": []}, {"body": "He's forgetting the insanely inflated market prices/stats, worsening economic situation in America (despite Trump's tweets), and the fact that the American government is infinitely more retarded than the Italian government", "score": 7, "replies": [{"body": "You sound like a Europoor or a Europoor wannabe.", "score": 0, "replies": [{"body": "Just wait. America is getting its face ripped.", "score": 1, "replies": [{"body": "Youre stinking this place up, Europoor. Please, sir, in America we have running water and hygiene etiquette. You do not have to shit in streets.", "score": -2, "replies": [{"body": "Even worse. Canadacuck.", "score": 3, "replies": [{"body": "Disgusting.", "score": 1, "replies": [{"body": "Enjoy your shithole.", "score": 2, "replies": [{"body": "My favorite thing about canada is theyre perfectly happy being our bitches.", "score": 2, "replies": [{"body": "Took you long to shit something out of you head, nice turd.\n\nYou think you are something important ? 'Our' ? There is no 'Our' in the states.\n\nYou are nothing.", "score": 2, "replies": [{"body": "Youre very cute when youre angry.", "score": 1, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Do you wanna come to my house bro? I'm full continental you inbred retard", "score": 1, "replies": []}]}]}, {"body": "What is happening yet", "score": 1, "replies": []}]}, {"body": "OMG throw the bulls a bone and we get this shit.", "score": 6, "replies": []}, {"body": "Doubtful", "score": 11, "replies": []}, {"body": "You're a step behind. What happened to Italy will happen here but 10x or 20x fold, strictly population and city density based. This is not the apocalypse, but shit will get much worse before it gets better.", "score": 13, "replies": [{"body": "Italy is a way denser and more public-transport focused country though?", "score": 6, "replies": [{"body": "the original outbreak was in bergamo, which is not a city like milan, more like a small country city. compared to NYC, Seattle, LA, SF, we're much more dense than italy.", "score": 5, "replies": [{"body": "And people there still probably take public transport as much as your average New Yorker", "score": 1, "replies": []}]}, {"body": "He didnt sell and now he is trying to justify why taking the 20% loss from his ATH isnt a good move.", "score": 5, "replies": [{"body": "Who me?  [Nah](https://www.youtube.com/watch?v=pPDISgMAyWE)", "score": 0, "replies": []}, {"body": "Muaaahhh dead cells", "score": -1, "replies": []}]}]}, {"body": "Thank you.\n\nIdk why everyone who is blowing this off assumes everyone who isn’t is a fucking doomsayer.", "score": 0, "replies": []}]}, {"body": "This isn't it", "score": 4, "replies": []}, {"body": "lol so watching what Italys doing then doing the complete opposite? Because thats what the US is doing.", "score": 5, "replies": []}, {"body": "Italy is death in the streets.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Italy has free and generous health care. Flu patients have priority in terms of hospital care. US hospitals cannot handle this rush of obese patients when outbreak starts.", "score": 3, "replies": []}]}, {"body": "You must have some calls", "score": 4, "replies": [{"body": "Why would I have calls when it's only getting started in America retard", "score": -5, "replies": [{"body": "You're the retard thinking it's recovering sooner", "score": 10, "replies": [{"body": "Lmfao what a dip shit", "score": 7, "replies": []}]}, {"body": "Atta boy. Git em", "score": 1, "replies": []}]}]}, {"body": "I am admittedly stupid, but I think that comparing countries isn't accurate. To start, I think this is blowing out of proportion, once people realize that almost everyone that gets beer flu will will be fine, the general public (right or wrong) wont care as much.\n\nIn terms of infections, I dont think comparing Italy to a country that is almost 100X bigger is worthwhile. Maybe the entire continent of Europe, but you also have to take into account cultural and political norms as well. I'm not sure how it is in other countries but I truly think that most people in US think of it as a inconvenience or a running joke. Sure they stock up on supplies, but they will go to the mall the next day.", "score": 7, "replies": []}, {"body": "No", "score": 4, "replies": []}, {"body": "Italy is not comparable to the US. Much, much more dense.", "score": 5, "replies": [{"body": "2018 Population density in **Italy** amounted to about **205.45** inhabitants per square kilometer.\n\n**Manhattan** \\- **27,346** / kilometer\n\n**San** **Fran** \\- **17,246.4** / mile\n\n**LA** \\- **7,544.6** / Mile\n\nYou are right that the **US** is lower than Italy at an overall value of **90**/mile, but the cities are where it really counts and US has very dense cities.", "score": 9, "replies": [{"body": "Ok, now let's compare US density to Italy. Got those numbers?\n\nBecause Manhattan isn't America.", "score": 2, "replies": [{"body": "What an idiotic comparison.", "score": 5, "replies": [{"body": "I mean are they comparing the entire nation of italy to the city of manhattan because im pretty sure one of those is just a wee bit bigger than the other. \n  \nRome has about 5500/sq mile\n  \nNaples has about 8800/sq km\n\nMilan has 7750/sq km\n  \nFraming it as nation vs city is stupid comparison.\n  \nItaly is also poor and in the midst of an immigration crisis so that is probably important. \n  \nAnd theyre Europearean, which is just gross. Ewwie.", "score": 6, "replies": [{"body": "We also have an immigration crisis but we frame it differently.", "score": 1, "replies": []}]}]}, {"body": "It's literally on there", "score": 0, "replies": []}]}, {"body": "LA people drive, not comparable to Italy\n\nThe US has about 6 cities with old-world type transport infrastructure- SF, NYC, Boston, Philly, Seattle, Chicago.  That leaves most of America better off structurally than Italy, where every city and large town is based around masses of people travelling together in small confined spaces.", "score": 1, "replies": [{"body": "a lot of people drive in los angeles, but more people take the bus and metro system here. and they interact with the drivers... there is no avoiding the two systems.", "score": 1, "replies": [{"body": "Californians have been living amongst poopoo for a long time now they are probably all infected with all kinds of diseases.", "score": 4, "replies": []}, {"body": "Yeah nah nothing like Italy or any of those others cities, facts", "score": 0, "replies": []}]}]}, {"body": "Or is he saying US is more dense?", "score": -1, "replies": []}]}]}, {"body": "Just looking at what happened when they stopped prison visits was bad enough. The US is bound to be the same or worse solely based on population and the stupidity of some people.", "score": 2, "replies": []}, {"body": "Ya ok and I'm having a threesome with Charlize Theron and Taylor swift", "score": 2, "replies": []}, {"body": "Ban this dumbass", "score": 2, "replies": []}, {"body": "Lol @ the scared salty gay bear brigade downvoting this and screeching about the total\ncollapse of the economy. Gg your puts 🤡🤡🤡", "score": 2, "replies": []}, {"body": "Its the dip. Buy now before its too late.", "score": 1, "replies": []}, {"body": "Reinfections are 100% possible... FyI", "score": 1, "replies": []}, {"body": "Genius so smart make me cum.", "score": 1, "replies": []}, {"body": "Dude stfu who the fuck cares about bulls anymore. \n\nStonks go down.", "score": 1, "replies": []}, {"body": "Italy is a bad model in my opinion. Different layout, age variance and size. There will be similarities but not a mirror image.", "score": 1, "replies": []}, {"body": "Hey retard Italy went on a nation wide shut down. Lmk when America does that and then we can compare. Oh wait that’s right it’s already too late here.", "score": 1, "replies": []}, {"body": "\nYou will be lucky, at the end of all this, that America is still a country", "score": 1, "replies": []}, {"body": "Just like H1N1 we will have forgotten about it 6 weeks.", "score": -3, "replies": [{"body": "I feel like I heard this in January, have we forgotten about this corona thing yet?", "score": 6, "replies": [{"body": "It hadn't started yet back then. It's still gonna keep materializing over March. By June/ July, this shit is gonna be ancient history and we are gonna be on the up and up", "score": 1, "replies": [{"body": "I can’t tell if that’s optimistic or cynical, either way I hope your right, I hate having to fight people for toilet paper and hand sanitizer when it’s not Black Friday", "score": 2, "replies": []}]}]}, {"body": "Wait until wave 2", "score": 3, "replies": [{"body": "Sequels always suck though.", "score": 1, "replies": [{"body": "Except the ones that kick ass", "score": 1, "replies": []}]}]}, {"body": "Lol, h1n1 didn't spread at this rate and had fewer deaths over a much longer period of time.", "score": 1, "replies": []}]}]}
