{"title": "ALPHA PROTOCOL - SEEKING IMMEDIATE EXTRACTION", "selftext": "**You have opened the grave of an** **economic cycle**. Before we dig deeper into the nature and consequences of our discovery, we will discuss the background to the thesis and consider first what we know from history a few lessons;  \n\n\n1️⃣ Every other time this happened it ended badly for the global economy via recession.   \n\n\n2️⃣ A Fed that lags and finances the Whitehouse will only add fuel to the flames... \"it's different this time\".  \n\n\n3️⃣ The longer the delay in USD devaluation from Fed, the worst the blow is going to be in Equity markets. Assuming USD does not devalue materially into 2020 its repo will grow and continue expanding the balance sheet , one way or another eventually this is going to look like Fed has been financing the WhiteHouse and then the game is up.  \n\n\n[US05Y-US02Y](https://preview.redd.it/74367vgs2fn41.png?width=2536&format=png&auto=webp&s=9f8ae971f767fa10b1c31d93e8f0e432400d0a84)\n\n[https://www.tradingview.com/chart/US05Y/QaDmIy0Z-ALPHA-PROTOCOL-SEEKING-IMMEDIATE-EXTRACTION/](https://www.tradingview.com/chart/US05Y/QaDmIy0Z-ALPHA-PROTOCOL-SEEKING-IMMEDIATE-EXTRACTION/)\n\n&#x200B;\n\n**Protectionism is a serious error**. There is no yellow brick road to success with protectionism, and it is no surprise the US via media manipulation have the masses deluded. This is a necessary component to the makeup of the next economic cycle ; but it must be in balance, any overshoots or undershoots will destroy the effectiveness in manipulation.  \n\n\nCentral Banks have been buying 20% of Gold supplies, expressing a view on global risk at rates we have not seen since the Nixon era when mortgage rates were surpassed by wages and no surprises this is also happening again now! Those with a background in fixed income will know alarm bells are ringing louder than usual in bond markets with wages ticking higher than mortgage rates. This is not sustainable and when danger threatens and the crowd does not smell it, don't stand like a sheep, rather run like a deer.  \n\n\n[End Of The Cycle](https://preview.redd.it/s63ayufi0fn41.png?width=2548&format=png&auto=webp&s=38f1fe06a02813b2698922c3c3eefb03da1de2c0)\n\nNow that Pandora's Box has been opened, it is equally important to understand the consequences and have a pulse to guide us on [how to proceed](https://www.tradingview.com/chart/US05Y/74DeWBa2-Alarm-bells-ringing-on-the-2-s-5-s-curve-Recession-is-calling/):  \n\n\n[This is not a fire drill...](https://preview.redd.it/mifog6ln0fn41.png?width=2544&format=png&auto=webp&s=9573ab29b7197d82663df8fcd3540e71f9c03166)\n\n  \n**Consumer Staples**[in the decade long chart:](https://www.tradingview.com/chart/XLP/F9dwhY5e-Consumer-staples-Ride-the-Pig/)\n\n&#x200B;\n\n[Consumer Staples](https://preview.redd.it/j7dfdi7t0fn41.png?width=2530&format=png&auto=webp&s=76c686ba0bd57d27efe726b4188444db0ed6db8a)\n\n[Vol exploded from the launchpad](https://www.tradingview.com/chart/VIX/0pHMAQ6d-Capitulation-Waters-in-VIX/), this was the 🔑 to the puzzle that unlocked the use this chart to good advantage, time to start paying close attention for early signs of a turn. 85 was the target I called back in 2019, we are sitting at the highs now so time to start looking for a fade as VIX is miles ahead of the rest:\n\n[Diagram from October 2019:](https://www.tradingview.com/chart/VIX/0pHMAQ6d-Capitulation-Waters-in-VIX/)\n\n[VIX Q419](https://preview.redd.it/6m03zo071fn41.png?width=2524&format=png&auto=webp&s=f021d48a9e2d7f1d47d560538da8345e4a07d723)\n\nAfter the fact..\n\n&#x200B;\n\n[VIX Q120](https://preview.redd.it/5br2etfe1fn41.png?width=2542&format=png&auto=webp&s=c1744a32f82d7f7785657dfe13f1cb1672164f77)\n\n[German Equities](https://www.tradingview.com/chart/DEU30/rHRST8wB-ridethepig-DAX-2020-Macro-Map/) are another to track for signs of a floor at the end of the month, the 2020 targets have been cleared:\n\n&#x200B;\n\n[DAX \\(before the fact\\)](https://preview.redd.it/904fmi762fn41.png?width=2658&format=png&auto=webp&s=e540d3fe9b72679e13ae3f9a12fed1a91a7a1ded)\n\n&#x200B;\n\n[DAX \\(after the fact\\)](https://preview.redd.it/xfxnbizb2fn41.png?width=2620&format=png&auto=webp&s=22e3e7263e016767fd6438db72d6c0edbdb1c6f7)\n\nIt is the same case in US Equities... despite FED cutting 150bps, $700bn in QE and a $1.2T fiscal package. What it means is we have all the ingredients in the pot for a **huge** rally once we clear the coronavirus flows; so what we need to track market-wise are two 🔑 components:\n\n1️⃣ **French & Italian numbers declining**\n\n2️⃣ **Focus shifting from fatalities to recoveries**\n\nRemember in terms of markets we are trading perception. This expectation of panic looks set to continue till month-end, I am no expert in virology but from talking to some Chief Exec’s there is a sense that virologists have created something sensational here which is opening the door to overreaction and hype from governments and unlocking (btw in all the wrong places) doors they never thought were possible on both the fiscal and monetary side. Stress in funding markets continues as I write, as long as this remains the case then **USD** will stay in strong demand until the storm passes, as capital rushes to the doors.", "id": "fko3z4", "created_utc": 1584531306.0, "score": 185, "upvote_ratio": 0.87, "num_comments": 96, "comments": [{"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 161, "replies": [{"body": "Good bot", "score": 48, "replies": []}]}, {"body": "[deleted]", "score": 70, "replies": [{"body": "LOL +1", "score": 13, "replies": []}]}, {"body": "You just predicted a major economic collapse and then said \"as soon as this virus is gone, we are gonna have a huge rally!\" \n\nThat's not how economic collapses work", "score": 160, "replies": [{"body": "Why not? Flight to safety (in this case private assets rally via loss of confidence in public sector)", "score": 27, "replies": [{"body": "Sorry bro I'm too intoxicated to type out paragraphs and shit atm BUT basically \n\n- If the public sector dies so does the private sector. So many businesses rely on the gov and the current global order\n- A global economic collapse in general would screw over everyone especially businesses. The common person would be fucked which would drive down profits massively.", "score": 76, "replies": [{"body": "I am assuming your whole portfolio is filled with puts?", "score": 12, "replies": [{"body": "It has been over this past month but I generally play it safe. You'd have to be insane not to be buying puts on green days in a market like this.", "score": 13, "replies": [{"body": "He’s saying with this large of a unpredictable and unprecedented rally downwards, we could see a large upswing with 3-4 Green Day’s. Don’t be throwing your entire portfolio in puts this late into the game after one green day", "score": 9, "replies": []}, {"body": "bro im not seeing a lot of green", "score": 3, "replies": []}]}]}]}, {"body": "Broad and fundamental changes in american consumer behavior; commercial property bubble gonna pop, WFH for life. restaurant/bar biz not coming back to full capacity til potentially 2-3 years from now.", "score": 5, "replies": []}]}, {"body": "Yeah, all the stocks will go to $0 and then rally up to $1 it will be beautiful", "score": 3, "replies": []}, {"body": "Literally", "score": 3, "replies": []}]}, {"body": "> You have opened the grave of\n\nwoah that's fucking spooky. i couldn't read past this because it was too scary 4 me. it seems like u know about SPY puts though so grats on your gain$ tomorrow", "score": 105, "replies": []}, {"body": "I’m sorry but I don’t see a got damn strike or price anywhere", "score": 161, "replies": [{"body": "TLT puts?", "score": 6, "replies": [{"body": "Puts??? Wut.", "score": 3, "replies": []}, {"body": "my TLT put spreads (15 may 85/90... stupid I know) are not doing as well as I'd have hoped they were super cheap (3 for like $20) but it fucks up my netliq reading caus it's always like negative $600 probably gonna dump if they ever go positive", "score": 1, "replies": []}]}]}, {"body": "Too many words. Didn’t read. Please ban this retard for thinking too hard", "score": 44, "replies": [{"body": "He thinks there will be a huge rally once the virus thing gets under control.", "score": 9, "replies": [{"body": "Plot twist: The virus won’t be under control until a year or two", "score": 1, "replies": [{"body": "Doubt. The people won’t have it. \n\nWe’re impatient. If the streets ain’t filled with bodies in a month or less, everyone is gonna go back to regular shit. \n\nOver a billion already have it. It’s everywhere. They just don’t have the testing infrastructure to show it. Yet. Fatality rate is about 0.00004%. It’s being hyped. It’s actually closer to complete bullshit than legit threat. \n\nBut, I only have an 8th grade education and I’m retarded, so there’s that.", "score": 3, "replies": []}]}, {"body": "Was that the gist of it? Well I could've told you that much ffs", "score": 1, "replies": [{"body": "Op needs to lay off the Adderall", "score": 2, "replies": []}]}]}]}, {"body": "ELIR (Explain Like I’m Retarded)", "score": 22, "replies": [{"body": "I think the author is retarded - or at least a paranoid schizophrenic.", "score": 12, "replies": []}, {"body": "SPY $3.50 3/19", "score": 3, "replies": []}]}, {"body": "Tldr and ticker/puts or call plz Im retarded, cant read so many graphs..", "score": 41, "replies": [{"body": "I looked at every one of them and they all mean nothing.  It's like looking at my family member's faces.\n\nEDIT: saw this little tidbit up top NOT IN FUCKING BOLD\n\n>Every other time this happened it ended badly for the global economy via recession. \n\nbuy more puts retards", "score": 42, "replies": []}]}, {"body": "So where’s the picture of you sucking cock? That’s what I came here for...\nF", "score": 18, "replies": [{"body": "Zaddy", "score": 9, "replies": [{"body": "I can only get so erect...", "score": 4, "replies": [{"body": "I'm here for this 🙌", "score": 1, "replies": []}]}]}]}, {"body": "I ain't tryna read a book nerd. Positions or ban", "score": 31, "replies": []}, {"body": "Who the fuck invited Scooge McGraph to WSB and didn't tell him about the ticker/strike rule!?", "score": 27, "replies": [{"body": "Scooge McGraph 💀", "score": 1, "replies": []}]}, {"body": "The fuck is all this babbeling? had a stroke mate?", "score": 14, "replies": []}, {"body": "Worthless given that your whole theory is conditional on the Corona virus disappearing.", "score": 7, "replies": []}, {"body": "So puts until April then reassess duhhh", "score": 15, "replies": [{"body": "Agree", "score": 6, "replies": []}, {"body": "It could have been so easy and most important so short! u/shitecakes2020 is the real hero here", "score": 2, "replies": []}]}, {"body": "> This expectation of panic looks set to continue till month-end\n\nIf the virus doesn't slow down in warmer weather, we hit the peak in July: https://www.nytimes.com./interactive/2020/03/13/opinion/coronavirus-trump-response.html\n\nThat's the peak in active cases, people that are sick at the same time. Recovery will come very quickly after that since people will get sick at the same time and recover at similar times after that.", "score": 7, "replies": [{"body": "Australia says it doesn't end with warm weather.\n\nKorea says it is killing young adults higher than we expected.", "score": 6, "replies": [{"body": "40% of Korean males are smokers.", "score": 6, "replies": [{"body": "And a third of America is obese what’s your point", "score": 5, "replies": [{"body": "WE'RE ALL GONNA DIE!", "score": 2, "replies": []}]}]}, {"body": "Could you please provide a source", "score": 1, "replies": []}]}]}, {"body": "I appreciate the effort put in to this - honestly. But you need to provide a well thoughtout simple tldr", "score": 6, "replies": []}, {"body": "Looks legit, strike and ticker?", "score": 4, "replies": [{"body": "$TDOC", "score": 4, "replies": [{"body": "$PTON", "score": 4, "replies": [{"body": "$ZOOM", "score": 3, "replies": [{"body": "$Zoom is a chinese car manufacturing assembly lol. \n$ZM is online learning.", "score": 2, "replies": [{"body": "look at ZOOM’s month chart though", "score": 2, "replies": [{"body": "There are plenty of autists who put over 100k into the wrong stonk.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "You need to seek a fucking position", "score": 5, "replies": []}, {"body": "Ban", "score": 4, "replies": []}, {"body": "Those are some pretty lines", "score": 4, "replies": []}, {"body": "Sir it's 7am.", "score": 3, "replies": []}, {"body": "I got to point number one, then reached full brain capacity and shut down\n\n\"1.Every other time..\" - do you mean every time ? like all the times this has happened, or every other time, like there is a 1 in 2 , 50% chance of this happening?", "score": 3, "replies": []}, {"body": "So calls?", "score": 2, "replies": [{"body": "After you see reports of more recoveries than new cases", "score": 2, "replies": []}, {"body": "The things you see now are the result of panic, not bad financials.\n\nOnce the virus panic is over (number of infected/dead starts going down) sentiment will do a 180 (after a few ups-downs).", "score": 1, "replies": []}]}, {"body": "That’s a long way of saying buy SPY puts", "score": 2, "replies": []}, {"body": "Ticker, strike and expiry, retard!", "score": 2, "replies": []}, {"body": "The other recessions have underlying financial problems that were the primary reason for said recession. This is due to an external entity causing mass disruption to every facet of our economy, with no real method of removal other than starving it by not leaving our homes. \n\nThe closest example of this would be the 1918 influenza outbreak. \n\nTl;dr: Buy puts you chungus", "score": 2, "replies": []}, {"body": "just give me the god damn strike and date", "score": 2, "replies": []}, {"body": " Strike and ticker you fucking retard", "score": 2, "replies": []}, {"body": "i love how big economic moves bring out the most mentally ill retards with their big essays and random scribble charts. jesus dude, if you wanted to say something important, you should have gone to school", "score": 2, "replies": []}, {"body": "Positions or ban", "score": 2, "replies": []}, {"body": "Line go up, line go down. I get it. Just tell me what stonks to buy.", "score": 2, "replies": []}, {"body": "I dont understand much of what you wrote, if you have the time and will to do it could you explain it in a simpler way?", "score": 2, "replies": []}, {"body": "Technical analysis is bullshit and always has been.", "score": 2, "replies": [{"body": "No, basically start being a 🌈 🐻 6-9 months after a yield curve.", "score": 1, "replies": [{"body": "So uh... 9/18 $40 P?", "score": 1, "replies": []}]}, {"body": "Technical analysis to me is hindsight.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "UH OH! Someone has been using stinky language and u/GetNoobified decided to check u/mon0poly's bad word usage.\n\n\nI have gone back one thousand posts and comments and reviewed their potty language usage.\n\n ^Request ^time: ^7. ^This ^is ^profanitycounter ^version ^2, ^view ^update ^notes [^here. ](https://www.reddit.com/r/profanitycounter/comments/e9zvta/introducing_version_20_gone_sexual/) ^Please ^consider ^donating ^to ^my ^development [^on ^my ^PayPal ^page. ](https://www.paypal.com/paypalme2/aidanginise1)\n\nHowever, the plans were foiled, mon0poly is a good, Christian boy.", "score": 1, "replies": []}]}, {"body": "Sir this isn’t r/finance", "score": 1, "replies": []}, {"body": "No you are too late for that put. Just buy puts close to price on green days (wait till the last 15 minutes on fridays) and calls on red days except on Wednesdays .", "score": 1, "replies": []}, {"body": "i'm color blind, is today gonna be red or not?", "score": 1, "replies": []}, {"body": "\" in terms of markets we are trading perception.\" the least autistic thing i've seen on this sub in a while", "score": 1, "replies": []}, {"body": "...", "score": 1, "replies": []}, {"body": "s has htf", "score": 1, "replies": []}, {"body": "A 20% unemployment rate doesn’t go away overnight. And, lagging social distancing means Italy is a best case scenario not a worst case. Peak won’t be in April it will be in May/June if we do nothing and slightly further out if we continue and expand heavy social distancing. And a research study out of London predicted 2.2 million US deaths, more than 68,000 per day at the height of this if we do nothing. Given that only some states are enforcing any quarantines and only on small scales right now we might as well be doing nothing. \n\nThis will rebound, but not soon. \n\n[Source](https://www.imperial.ac.uk/media/imperial-college/medicine/sph/ide/gida-fellowships/Imperial-College-COVID19-NPI-modelling-16-03-2020.pdf) so I don’t get banned.", "score": 1, "replies": []}, {"body": "read this like i read my books. just looked at the pictures :d someone tl;dr for me?", "score": 1, "replies": []}, {"body": "Okay", "score": 1, "replies": []}, {"body": "You’re the OP WSB needs, not one it deserves.", "score": -1, "replies": []}]}
