{"title": "Goldman forecast: Output and labor market collapse greater than anticipated", "selftext": "According to a Goldman Sachs update: The data \"show an even bigger output and (especially) labor market collapse than we had anticipated.\"\n\n\"This not only means deeper negatives in the very near term but also raises the specter of more adverse second-round effects on income and spending a bit further down the road.\"\n\nBut this unanticipated data was clearly anticipated, and therefore priced in.\n\nSPY 4/20 $300C", "id": "fse82q", "created_utc": 1585666211.0, "score": 476, "upvote_ratio": 0.96, "num_comments": 90, "comments": [{"body": "$300? JP will own all businesses by 4/20 spy to infinity and beyond.", "score": 126, "replies": []}, {"body": "When I hear the bad news I just close my eyes, put my fingers in my ears and wait for the money printer to drown out the bad thoughts.\n\nSPY 400c", "score": 116, "replies": []}, {"body": "[deleted]", "score": 100, "replies": [{"body": "Spy to $500", "score": 45, "replies": [{"body": "SPY to $1000", "score": 25, "replies": [{"body": "Spy to $$1,000,000", "score": 19, "replies": [{"body": "Buying 2 spy 500 shares will make you a billionaire here shortly", "score": 8, "replies": [{"body": "Just put in my order for 2 shares @ $500! What a deal!", "score": 2, "replies": []}]}, {"body": "good news everyone virus is back in china / never left---means more bodies---means stocks goes UUPPPP!!! are they selling the gold fillings from the bodies or some shit? how does this work?", "score": 3, "replies": []}, {"body": "Options still down 50%", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Spy to $700", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Calls on wheelbarrows for this dudes testies", "score": 12, "replies": [{"body": "calls on wheelbarrows for our currency", "score": 3, "replies": []}]}]}]}]}, {"body": "$300c, that's it? Pussy!", "score": 38, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Heil.", "score": 6, "replies": []}]}]}]}, {"body": "I see they're done pivoting to a net short position.", "score": 24, "replies": [{"body": "Haha. Yes. They have joined the bears and now it's all doom and gloom.", "score": 7, "replies": []}]}, {"body": "FUCK I just put my puts in.", "score": 17, "replies": [{"body": "We need some news like AIDs are cancer cured and vaccine to beer flu expected in 2 weeks for the market to crash again.", "score": 7, "replies": []}, {"body": "Excellent, keep shoveling it in - we need your garbage money to burn", "score": 6, "replies": []}]}, {"body": "The trick is knowing when to follow Goldman’s advice and when to do the opposite.  Either way, Goldman is somehow going to fuck you...", "score": 11, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I have noticed it’s really easy to tell after you’re already rich or completely fucked if you made a good decision.", "score": 2, "replies": []}]}, {"body": "The answer to that is usually whether they completely reversed their forecast within a few days of the last. It's not pumping and dumping when you're the bank.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Something to do with which direction you hold your phone. I have noticed my RH account changed to a red theme recently instead of green. Not sure if bug or feature", "score": 6, "replies": []}]}, {"body": "you fucking pussies\n\nspy 4/20 $420c", "score": 7, "replies": []}, {"body": "I’m laughing about this because the recent rally was due to [this. 🤣](https://www.google.com/amp/s/mobile.reuters.com/article/amp/idUSKBN21E1J8) \n\nSPY $150p 5/15", "score": 20, "replies": [{"body": "The stock market is not the economy. And the value is relative. You could cause stock prices to double off of inflation alone by doubling the money supply. This $6 Trillion in new spending, they're just gonna print. Milk is gonna be $10 a gallon, but the number on the ticker will be high too, so the economy is doing well.", "score": 22, "replies": [{"body": "Regardless how much money they print will not increase inflation.  During times of recessions the United States experiences deflation and during a depression deflation is considerably higher.  We are trending towards depression.  They can print as much money as they want to hold off deflation.  The real issue, as the economy starts to rebound we will experience inflation and risk Hyper inflation.", "score": 14, "replies": [{"body": "If that happens then Stonks go UP", "score": 3, "replies": []}, {"body": "Yep. I'm pretty sure the Fed is actively courting stagflation to buy time to get their shit in order and raise interest rates to throw us into an intentional recession. ...Again.\n\nIt's dumb and the result of a lot of shit decisions, but it might be our only way of riding this out without total economic collapse.", "score": 2, "replies": [{"body": "This is where I think they're headed as well.  They've chosen what they think is the lesser evil and are running at it full speed.", "score": 2, "replies": []}]}]}, {"body": "I want everyone to know, right now, that if you read a comment that includes concerns about *inflation*, the person making the comment has tipped you off that *they do not entirely grasp the situation at hand*.\n\nInflation is what the Fed *wants* right now. We are at risk of entering a deflationary spiral, which is much, much worse than runaway inflation. \n\nThe Fed and Congress could print $8 trillion and we wouldn't see an ounce of inflation. JPow would cry tears of joy if he could print enough money to cause inflation.", "score": 10, "replies": [{"body": "How would injecting $2-$8T not cause inflation?", "score": 1, "replies": [{"body": "Because people are losing their fucking jobs man.  No one is spending money on flat screens and hookers when they are out of work.", "score": 5, "replies": [{"body": "In 2019, personal consumption spending was $14.8T. So maybe  the Fed is expecting about a 30-40% drop. Makes sense. Or maybe personal debt will skyrocket?", "score": 1, "replies": [{"body": "People will be hoarding as much cash as they can until this is over.  Sure the checks will help some people buy food or pay rent, but no one is hoping on a plane and going to Disneyland right now like in 2008.  We see the impacts of the broader stimulus in 2021 on inflation.", "score": 3, "replies": []}]}, {"body": "ok, I get it now. The velocity of money is zero because people are too scared to buy non essentials, or don't have money, because  they don't have jobs.\n\nSo lets fuck with money supply, so that the money folks are trying to guard becomes worthless in their hands, forcing them spend. Lets ensure ALL the usual safe havens, like gold, are manipulated down, so average Joes have no fucking place to escape the inflation theft for their wages or their savings.\n\nHow perfect that the policy benefits the people with hard assets, yet again, i.e. boomers, the same fuckers that are repeating the same insane fucking policies.\n\nIs it a coincidence that every new generation despises boomers? \n\nBoomers ate steak\n\nGen X ate burgers\n\nGen Y ate mince and sawdust\n\nGen Z can eat shit.\n\nGen A will starve", "score": 1, "replies": []}]}]}]}]}, {"body": "Finally! This guy gets it. 💎👐", "score": 5, "replies": [{"body": "🍻 Cheers!", "score": 2, "replies": []}]}, {"body": "Rebalancing aided, possibly greatly, the constant buying pressure.  But, even if it was $1T into domestic equities (it wasn't), that's only 5% of the value of the ENTIRE U.S. market.\n\nYou're getting your storyline mixed up a bit.  To oversimplify things, infinite QE being dropped right when the market was anxious to buy caused the rally.  The rebalancing caused the positive sideways action in the absence of any 'news'.", "score": 0, "replies": []}]}, {"body": "So they have their short position set up?", "score": 5, "replies": []}, {"body": "when this all goes to shot I know I can count on you retards to band together and fend off all the chads from our wives and their boyfriends", "score": 2, "replies": []}, {"body": "correct, priced in!\\~", "score": 1, "replies": []}, {"body": "Greater than anticipated by who? Anyone should have realized this.", "score": 1, "replies": []}, {"body": "Ok SPY 369c 4/20", "score": 1, "replies": []}, {"body": "u/Hadrian_M\n\nTell them what you told me about everything being priced in 2 weeks ago...", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "That's not what you told me....", "score": 0, "replies": [{"body": "Yes it is. I said your glaringly obvious news releases, that literally everyone was talking about already, were mostly priced in. The vast majority of negative earnings/unemployment, etc was priced in. That does not mean *all* possible eventualities are priced in. That's an absurd proposition and obviously impossible.", "score": 3, "replies": []}]}]}]}, {"body": "You are really low IQ if you listen to anything Goldman or any other investment bank says PUBLICLY. \n\nLike legit single digit IQ lol", "score": -6, "replies": [{"body": "So they’re masking a secret amazing economy? \n\nI don’t get your assumption here.", "score": 12, "replies": [{"body": "The economy isnt any one company. Lots of companies are just fine. Look at staples, online security, online shopping (Amazon), etc. The market prices for future earnings. Even 3 quarters of reduced activity are irrelevant if you expect it to go back to normal afterwards. Market is telling you thats the base case but you're ignoring it for some reason!", "score": -10, "replies": [{"body": "Staples will all fall flat if 30% of people stop spending money. If they can’t pay their loans, if they die. This isn’t a hard concept to understand, this is a consumer driven economy and literally no sector is immune.", "score": 15, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lol he's not talking about Staples the company dumbass.\nAs in everyday staples.\n\nBtw, I'm not agreeing with this incel retard.", "score": 9, "replies": []}, {"body": "I mean consumer staples you realize not actual staples LOL. Go look at Clorox or Costco. This is helping them", "score": -4, "replies": [{"body": "And look at travel, entertainment, and retail stocks. They are going to get smashed. Banks very well could too if enough people can’t pay their bills anymore and have a bunch of defaults on loans.", "score": 1, "replies": [{"body": "Which are all way down already? Sure you can gamble and HOPE Carnival or other cruise stocks don't find financing but if they do? You get destroyed. \n\nThe easy money on the short/put side was made weeks ago. Understand?", "score": 2, "replies": [{"body": "I don’t think you understand how the economy all is intertwined my guy. Unemployment=less income=less consumption/more rents not getting paid. We haven’t hit the spiral yet. We got hit by the shock and initial brunt. But if this shutdown lasts longer than April there is going to be a new bottom.", "score": 1, "replies": [{"body": "Whatever you say kiddo.\n\nProtip. Dont ever say my guy. Dates you as an ignorant sub 25 zoom zoomer", "score": -1, "replies": [{"body": "Ok home skillet. Typical response from someone that has no knowledge. Attack the grammar or other word usage. We definitely done here lol", "score": 2, "replies": [{"body": "Yes you are. Kinda like your puts! \n\nYoull grow up someday though i have hope. Once youre done college and have a real job things change son", "score": 0, "replies": []}]}]}]}]}]}, {"body": "you should bet money and prove these guys wrong!", "score": 1, "replies": []}]}]}, {"body": "Shame that all the reports we have seen from staples companies say you're wrong including huge increases.\n\nOr look at food delivery services soar. People will continue to eat and buy cleaning products. Only you are broke enough to can't afford food anymore.", "score": 1, "replies": [{"body": "It’s 2.5 weeks. Were you an adult in 2008/9? Employment lags this shit, but when it hits it cascades bad. And we’ve literally never seen anything as bad as this before. Ever.", "score": 7, "replies": [{"body": "Yes you are much smarter than trillions in hedge funds and mutual fund managers! You with your bachelor degree vs their PHDs/MBAs! You figured it all out! Employment is never coming back!", "score": -7, "replies": [{"body": "They all lost their ass back in 2008 too. Whole huge banks full of phds all went broke. Literally the plot of “The Big Short”.", "score": 11, "replies": [{"body": "Okay bud. Take your bachelors and buy some puts! Good luck!", "score": -2, "replies": [{"body": "Is any analyst saying this market is good? I really don’t understand your point. They’re all publicly predicting 15-30% unemployment. You’re arguing that secretly things are great?", "score": 2, "replies": [{"body": "The market already priced the clearly TEMPORARY declines in earnings in.\n\nLook at cruise lines airlines and such. Hit hard, lots of debt. A company like Microsoft or Adobe? Barely impacted.\n\nUse your noggin.", "score": 2, "replies": [{"body": "Lots of rude awakenings about to be had in here if we can’t get this virus under control. Microsoft lost 50% of its value during the Great Recession.", "score": 1, "replies": [{"body": "Are you really comparing microsoft of 2008 to microsoft of 2020? Wow you really are clueless huh. Good luck!", "score": 1, "replies": [{"body": "What company would you recommend I draw a comparison to? How about food, no one died and we all needed to eat right? Sysco also lost 50% of its value.", "score": 1, "replies": [{"body": "Why are you trying to compare this to 09 anyway? Why not 87 when the market did a straight march upwards after? More similar to that. What about 62's crash? You don't know that even happened i guess. \n\nEarnings won't be down in a year, anyone who buys here will make big gains long term. Long dated calls, shares, hell you can even be shit at stockpicking and make good money.\n\nOr buy puts and lose money. Your choice!", "score": 2, "replies": [{"body": "Because 2008 is the only comparison I both lived through, and where no one could pay their bills all the sudden. Every other recession or downtown didn’t have that “shit we’re all broke now” factor except the Great Depression. \n\nAnd I literally know a shit ton of people laid off in just the last week. This is 2008 on steroids with the My Pillow guy giving briefings in the rose garden.", "score": 2, "replies": [{"body": "Its nothing like 2008. Absolutely nothing similar.", "score": 0, "replies": [{"body": "You’re right, it’s much much much worse.", "score": 1, "replies": [{"body": "hahahahahha oh thats golden!", "score": -1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "So what having a PhD or MBA in business management makes you immune to losing money in a hedge fund or mutual fund? Are they really impervious gods in your eyes for that shiny piece of paper? \n\nYou really are holding true to that 3 quarters of recession and then back on track shit huh? Cya in a year mate.", "score": 3, "replies": [{"body": "LOL okay doomsayer. Your puts are going to zero get the fuck over it and fix your error.", "score": 0, "replies": [{"body": "Lol ok incel. Keep on keeping your head in the clouds :). \n\nAnd naw I don’t do options trading I have a day job, I’m just here cuz I like to screech autistically like you.", "score": 2, "replies": [{"body": "My job is in the industry. Learn from someone with a bigger brain and penis than you.", "score": 0, "replies": [{"body": "Lol. I can smell the projection through my phone mate.", "score": 2, "replies": []}]}]}]}]}, {"body": "you think you have to be a PhD to work at a hedgefund?\n\nI promise you there are more varsity lacrosse HF traders than PhD traders, and it's probably 3:1", "score": 2, "replies": [{"body": "Of course... but they're still much better educated than this sub.\n\nYou do know where we are right? Have you READ most of the posts on here? They literally fail to grasp the market priced in this terrible news for at LEAST another month in early March. Thus no downside left for some time. We are at resistance and likely retest the low in April but none of the silly puts they're buying will pay a cent", "score": 1, "replies": [{"body": "Yes they're better educated than this sub, that's an extremely low bar. \n\nI do believe in Wisdom of the Crowd theory and I believe it's in the best interest of the financial industry to keep the market propped up for as long as possible.\n\nNothing like this has ever happened before, no one knows the ramifications, including PhD Fund Managers and Traders. \n\nTo pretend like they're all-knowing and they've already priced everything in is equally moronic", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Sure staples might,  but what about office depot?", "score": 0, "replies": []}]}]}]}]}]}
