{"title": "2008 Financial crash, how did people make big money in that period ?", "selftext": "I hear a people say that this recession will make some people millionairs, but i am wondering how ? Unless you have $500,000 to invest, then im not sure how you could do that.", "id": "fm49fx", "created_utc": 1584743839.0, "score": 41, "upvote_ratio": 0.86, "num_comments": 97, "comments": [{"body": "[deleted]", "score": 90, "replies": [{"body": "And calls on the way up.", "score": 5, "replies": [{"body": "The market always falls harder than it rises so the calls on the way up aren't as lucrative since you'll be battling Theta the whole time. The only way to do that is to buy leaps I think.", "score": 3, "replies": [{"body": "Of course.  Stairs up.  Elevator down.", "score": 2, "replies": []}]}]}, {"body": "Rookie here: I don't understand puts. How much do you profit on a put? For instance, spy puts are really popular. A SPY $220 04/01 is $8.65 right now. How much do you profit? And you profit when the stock hits the strike price or becomes lower?", "score": -1, "replies": [{"body": "Simply put,  puts are contracts to sell for today's price (100 shares) at a future date. So you are anticipating the stock will go down. The more it drops the more valuable the contract. The future date expires so if the stock doesn't drop (or increases in value) it's a worthless contract. And you lose 100% of what you invested.\n\nIf you predicted correctly, you could sell those contracts for a lot of money in the future.. because people want to sell their shares at the old higher value. \n\nThat's why in a bearish or in this case crashing economy puts are popular.", "score": 27, "replies": [{"body": "okay, thank you! But why are people buying put options for SPY. Contracts costs +$1,000. Are they making more than the price of the contract? Surely they must be since no one would buy it if there are expecting the contract to cost more than however much they make. \n\nA put for SPY is $224 03/27 $8.89. Let's say the stock does drop to $223 by then, how much money would that person have made?", "score": 8, "replies": [{"body": "It'll depend on the volatility of the stock, the Greeks, and honestly, a bit of feeling sometimes. I got Disney puts yesterday and up until this morning I was down 15%. Then the market tanks and all of a sudden, 50% swing.", "score": 9, "replies": []}, {"body": "There’s a lot of math that goes into it but the closer to the expiry date, the more money you lose every day. This is called theta decay. Theta is just one of the many variables that goes into how options make or lose money", "score": 8, "replies": []}, {"body": "For someone to capitalize off a put option.. the stock price needs to get below the strike price ($224) minus the commission ($8.89). So for you to even break even the stock price needs to get to $215.11. Each dollar it gets under $215.11 is $100 profit.", "score": 4, "replies": [{"body": "This is true if held to expiry. In reality, to make money off a put option, it’s just like anything else. Buy it for a low premium and sell it for a higher one. But be careful cause them bitches moves much faster than stocks due to the inherent leverage", "score": 6, "replies": [{"body": "Yea, I did forget to include \"+ greeks\" at the end of that comment. It was just a simplified version since that's what I think he was looking for.", "score": 5, "replies": [{"body": "Yep. Very few hole to expiry in the end.", "score": 3, "replies": []}]}]}]}, {"body": "“A put for SPY is $224 03/27 $8.89. Let's say the stock does drop to $223”\n\nTake the 224 strike minus the premium of 8.89 will equal the breakeven and anything lower will be considered in the money which is the profit per (100) share.", "score": 2, "replies": []}]}]}, {"body": "Keep in mind that the people answering your question are actually describing two seperate ways to make money. One is selling the contract to someone else and the other is actually exercising the contract and buying (calls) or selling (puts) as per the agreement.", "score": 3, "replies": []}, {"body": "This is a great question, since I know lots of folks that probably need help explaining it, don't know why it got so many downvotes, just commending you for asking it for others!", "score": 2, "replies": []}]}]}, {"body": "You could have bought waste management at 30, wfc at 9 etc etc.  Panic prices on value stocks with dividends, compounding interest is a beautiful thing.      Then you just hold triple your investment and earn interest.  If its in a roth it's all tax free. Side note dont touch options.", "score": 11, "replies": [{"body": "Thank you. Everyone is spouting options. They don't mention how you can lose all the premium if you don't get the timing almost perfectly. I know I'm a shitty stock picker and a worse market timer. That's why I diversify heavily and dollar cost average into long positions.", "score": 7, "replies": []}, {"body": "Roth...my preference. WM...been eyeballing that one for a while now.", "score": 1, "replies": [{"body": "God I like it at 65 hope we get it down", "score": 2, "replies": [{"body": "Ten years from now there will be two kinds of people: those who listened to advice like yours and those who wished they had.", "score": 1, "replies": []}]}]}]}, {"body": "Go long . Learn , and profit off the next crash in 5-10 years", "score": 40, "replies": [{"body": "Hmm. I should keep a journal.", "score": 7, "replies": []}, {"body": "Do you mean anything specific by learning or just paying general attention to what’s happening around?", "score": 3, "replies": [{"body": "This was what I did. I played with options with about $2,000 and lost it all but learned a lot more, just in time for this crash and to profit. \n\nEven if you miss the crash, play with options a teeny bit, and learn for the eventual recovery. I don't hold the contracts to expiration because I don't have the capital, but the contracts still can make money for you.\n\nEDIT: I'm just a dude on the internet but I have over 80% of my money in assets. I got a bonus that I threw into some puts, but by no means am I doing some \"YOLO r/wsb\" shenanigans. I don't have the stomach for these 50% swings.", "score": 8, "replies": []}]}, {"body": "Dumb dumb dumb", "score": 2, "replies": []}, {"body": "Put my four kids through college. :)", "score": 2, "replies": []}]}, {"body": "This thread is so fucked. Wsb bleeding thru r/stocks.\nGood luck to everyone finding a pattern with timing puts and calls consistently, if you did and come out on top consistently, congrats you’re special. For the most of us, you wasted money, time, and mental space", "score": 30, "replies": [{"body": "H8r", "score": -1, "replies": []}]}, {"body": "Check reddit's crystal ball to know where the bottom is.\n\nGo all in and max out your Line of Credit into FAANG stocks. Set automatic buys per pay cheque thereafter into FAANG stocks.\n\nJerk off for 10 years and realize your massive gains.\n\nThank me later.", "score": 27, "replies": [{"body": "Dude Tesla truck is gonna crush it. Hodl me 😂", "score": 4, "replies": []}]}, {"body": "Find a company you think will tank. Buy puts for that company. Company tanks, you buy at market price, sell to your put-buddy at your agreed to price (e.g. it's at $30, you agree to sell at $25, it drops to $10, you buy 100 shares at $10 and sell at $25, you make $1500). The bigger the drop, the more you make.", "score": 26, "replies": [{"body": "I realize that I could probably answer this question with a YouTube video explaining options, but I can’t find/watch one right now.\n\nIs the number of shares you can sell written into the contract? I’m assuming yes, otherwise you could theoretically sell them infinite shares at a $15 profit per share (using the numbers in your example), right?", "score": 1, "replies": [{"body": "Options contracts are for 100 shares.", "score": 3, "replies": []}]}, {"body": "Why buy at market price if you think it's gonna tank?", "score": 1, "replies": [{"body": "Read my comment again.", "score": 1, "replies": [{"body": "Yeah, \"buy puts for that company\"", "score": 1, "replies": [{"body": "do you know what a \"put\" is?", "score": 1, "replies": [{"body": "Evidently not... I assumed to put money down on stocks i.e. buy", "score": 1, "replies": [{"body": "So, a put is a contract. The seller agrees to buy 100 shares of a stock at a certain price, by a certain date. The agreed to price is called the strike price. The date is called the expiration date. They sell this contract for a premium. Depending on how far out the expiration date is, and what the strike price is, this can range from a few cents per share, to a few dollars per share. The seller hopes that the stock price remains above the strike price, so they essentially get paid to do nothing.\n\nThe buyer is on the other side of the deal. They get the ability to sell a stock to the contract seller, at the strike price, by the expiration date. They are hoping the stock price goes beneath the strike price. This way they can buy the stock on the market at its current low price, and sell it at the higher price.\n\nDoes that make sense?", "score": 2, "replies": [{"body": "Yep, sounds no different to gambling at the bookies?", "score": 1, "replies": [{"body": "In a lot of ways, yes. But that's stocks in general. There's statistics and analysis, but there's no perfect formula. There's always some risk. \n\nBut, there's also ways of (more) responsibly using these contracts. If you want to buy a stock at a given price, instead of just waiting for it to drop, you can sell puts at that strike price. In this case, it's like you're getting paid to wait for it to drop. You can miss some potential up side (if it drops too low, you don't buy it at the optimal price), but if it takes long enough, it'll make up for it, or even put you ahead.\n\nOn the flip side. If the market is volatile, and you already own a stock that you're worried will drop, it can be worth it to get some downside protection and buy a put. In this case, it's more like buying insurance in case of an emergency.", "score": 1, "replies": [{"body": "And what platforms allow you to do this?", "score": 1, "replies": [{"body": "Every brokerage I've ever come across has this available (Schwab, Robinhood, etc.).", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "offbeat consider ossified rain cautious waiting alive correct illegal label\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 9, "replies": [{"body": "Sad part is all or takes to better position yourself for the drop is to always hold some sort of allocation in bonds and gold. A little asset diversification. I specifically had a long term treasury mutual fund and a gold ETF. Sold all the bond fund once it was at a 20% gain. Still most the gold at around 12% gain because I saw it begin to come down. Still have some of the gold left. Been slowly moving that cash back into equities. When things recover I intend on moving a little bit back to gold and bonds.", "score": 1, "replies": [{"body": "Bonds fell too.  In fact, some of the cheaper puts left this past week were on bonds because most people haven't realized how much trouble bond funds are in yet.", "score": 1, "replies": [{"body": "Yeah, once the Fed started propping up yields, but I sold my position as soon as that news came out, luckily.", "score": 1, "replies": []}]}]}]}, {"body": "My father apparently had an economics professor (\\~60 years ago) who started every class with \"Gentlemen, acquire capital.\" \n\nBut when you buy DOW at $6 and sell at $24, you don't need a LOT of capital. \\[Dow isn't the same company it was then. Stocks go to zero as well as up. Etc.\\]", "score": 7, "replies": [{"body": "This ignoresc the fact that major disruptions always boosts new companies and sectors.  It was the FAANG companies that really boosted the market coming out of 2008.  They are the ones that really had all the explosive growth.  A lot of traditional industrial conglomerates going into 2008 haven't rebounded as strongly, ceased existence or merged away.", "score": 1, "replies": [{"body": "It literally ignores it, yes. GE was another very traditional company that went from about $6 to about $18 in like a year. (Sadly, I held onto it for the long term. Dividends are not a substitute for actual growth. )  \n\n\nYou could triple your money \\[admittedly, with perfect timing\\] in about a year holding an S&P index fund. You didn't need to be a keen-eyed futurist buying Amazon. You could get some very good companies at very, very good prices. Not 10-baggers, but I got a ... quad-bagger? on DOW, and I by no means sold at the top.", "score": 1, "replies": []}]}]}, {"body": "My stepdad made a small fortune on options and TVIX in the last 2 months. Over 2,700% increase in the last month alone.", "score": 6, "replies": []}, {"body": "Puts on the way down, calls on the way up.  The volatility is ripe.  We wont take 5 years to come back.", "score": 39, "replies": [{"body": "The way up was like 3 choppy years that ended with one more big dip in late 2011.... You wouldn't have made money on calls in that environment.", "score": 15, "replies": [{"body": "This. Knowing what's the way down and up is a piece of cake in hindsight, but would be a puzzle for virtually everyone at that time.", "score": 15, "replies": [{"body": "Watch the VIX.  You can't time it down to the second.  But with enough experience you can get reasonably close.", "score": 1, "replies": []}]}, {"body": "You can make plenty of money off of calls or puts in a single day of trading, no matter the market but one with lots of volatility only helps.", "score": 1, "replies": []}, {"body": "Tell that to my CYH $3 Jan 2022 calls @$1.18", "score": -6, "replies": []}]}, {"body": "How will you determine when we are on the way up?", "score": 3, "replies": [{"body": "I mean a vaccine or effective treatment is a sure thing, but buying in small parts on the way down is a safe bet for an issue like this with a clearly defined ending", "score": 2, "replies": [{"body": "Anybody who thinks this has a clearly defined ending isn't paying attention.", "score": 1, "replies": [{"body": "I'll rephrase: the market will know unequivocally  when the COVID issues are resolving.  There's one issue and it's COVID.   We see how China's cases are dwindling.   \n\nGiven all of that, by \"clearly defined ending\" I don't mean a pre-defined timeline.   I mean we know exactly what event must occur for the upward trend to begin.  That event is COVID resolution.", "score": 1, "replies": []}]}]}, {"body": "Most likely when there is a vaccine or some sort of serious action that reduces the rates IMO", "score": 1, "replies": [{"body": "you know a vaccine is 12+ months away?", "score": 1, "replies": []}]}]}]}, {"body": "Look into covered calls, or poor mans covered calls. I know everyone in this sub goes directly to, “oh invest in an ETF and wait” but hear me out. Might as well make some monthly income writing covered calls", "score": 5, "replies": [{"body": "Covered calls are great for stable stocks you are mildly bullish on.   I don't think this is a good time to use them.   The recovery will eventually happen and you will be forced to sell a the strike price, forgoing potentially huge appreciation.", "score": 2, "replies": []}]}, {"body": "Options if you can pull it off which is a VERY small percentage of people. \n\nBuy at the bottom.\n\nI bought 5000 shares of Ford at 99 cents, sold at 14$\n\nI'm just adding to my current positions and VOO. I used to do 1-2000 a month, now I am doing 3-4000.\n\nI use fractional shares, so I invest roughly 150-200 a day", "score": 10, "replies": [{"body": "Even NEAR the bottom works pretty well.", "score": 6, "replies": []}, {"body": "I am new to this. In which cases can you lose more with options than your initial investment? I can’t really find the answer to this.", "score": 1, "replies": [{"body": "yes if you sell calls and puts, if you buy them the max risk is the initial investment", "score": 1, "replies": [{"body": "Did I understand this correctly: there is a difference between selling puts and executing a put that you bought?", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "150$ per day, fractional shares", "score": 2, "replies": []}]}]}, {"body": "VIX (mutiple ETFs) is a good move as well, especially during the initial shock we are experiencing. It measures volatility and does not care about the direction of the actual market.", "score": 5, "replies": [{"body": "Yeah VIXY is up ~340% in the last month", "score": 4, "replies": []}, {"body": "Wow, had no idea that was a thing. Is there an opposite version for when you thinks things wont be volatile?", "score": 2, "replies": [{"body": "Put Credit Spread. I don't mess with those though.", "score": 1, "replies": []}, {"body": "There's inverse volatility ETFs.", "score": 1, "replies": []}]}, {"body": "I cant trade it for some reason", "score": -1, "replies": [{"body": "Look for VXX or VIXM or Google others. There will only be ETFs, it can't be traded directly.", "score": 3, "replies": []}]}]}, {"body": "Shorting or puts when it’s going down\n\nLong and calls when it’s going up\n\nPretty simple... \n\nETFs for the whole market and choosing strong blue chip stocks and dividend aristocrats\n\nDollar cost averaging, buying trends, some fundamentals and news\n\nSome might just stay put and hold and not panic because they know time in the market is better than timing the market so they buy at discounts in every interval down. Buying every 5% down and every 5% up.", "score": 3, "replies": []}, {"body": "Well, you could have shorted a month ago.\nNow? I'd say buy cheap single stocks that have gotten hammered but have good fundamentals.  For example, TEAM VEEV SQ", "score": 4, "replies": []}, {"body": "Buy high sell low", "score": 2, "replies": [{"body": "Ugh, people are actually doing that right now though. At some point some of them might have no choice. Sad state of things atm. Just really hope all the room and gloom doesn't actually become reality.", "score": 1, "replies": [{"body": "It will become reality.  Everyone loaded up on debt.  Consumers, corporations and governments.  This means the recovery is going to be weak.", "score": 1, "replies": [{"body": "Well, they're just doing more of the same to get out of it. Things won't change because of this. They're just trying to reinflate the bubble. Hopefully, when things get better, the fed has the wherewithal to step off the gas.", "score": 1, "replies": []}]}]}]}, {"body": "They shorted MBS thru this thing called \"credit default swap\" (basically insurance for underlying bonds). The bonds went bust, and they got the payout from said \"insurance\".", "score": 1, "replies": []}, {"body": "Spy puts", "score": 1, "replies": []}, {"body": "Shorting the housing market before the crash begun.", "score": 1, "replies": []}, {"body": "They bought shares all the way down then the stocks shot up", "score": 1, "replies": []}, {"body": "Buying all the way down and all the way back up. Just regularly buy the Etf or companies you believe won't be wiped out. This is unprecedented but I think the longest recovery was ~31 months, something to keep in mind. Things will eventually recover.", "score": 1, "replies": []}, {"body": "The problem is most people went all in and many nearly went broke because of the volatility causing the market to go against them in more than one occasion. When it comes to a speculative directional play like this you want to look at specific securities and assess what they’re really worth and how far down they could really go then you come up with a strategy that may be unlikely yet possible, then the safest way to go about it is figure out exactly how much your okay with losing and how much you want to win then go for it. The problem is when it come to this stuff people get too greedy and wait to long at unrealistic prices and then the market crushes them out, so truth be told the people that make tons of cash are taking huge risks to do so. Your best bet is instead of trying to get rich off this by risking it all, is to be conservative and only risk realistic amounts and be happy if you even make moderate gains, because it’s consistent moderate gains that make you rich not random huge ones every now and they filled with a bunch of failures between the successes. Truly successful people build wealth gradually not all in one go risking it all.\n\nPs: you have a much better chance becoming a millionaire playing the rebound after a recession then you do playing the recession itself.", "score": 1, "replies": []}, {"body": "The bank were mostly all under 5$.   If you just would have invested in the banks over 10 years you would have made insane gains.    WHen everything falls to shit, any idiot who buys and holds will do good just throwing a dart  at a bunch of stock symbols on the wall and building a ten year position on what it hits.    \n\nThe stock market is just a little lower than where is really should be if you look at fair value.  The Gains made over the the last 3 1/2 years were really a house of cards anyway and would have eventually popped even if the virus hadn't come a long.   The tax cuts, stock buy backs, cheap debt keeping unprofitable businesses a float, greed and lack of fiduciary responsibility....the market is broken.", "score": 0, "replies": [{"body": "You're being downvoted.  But you're right.  And most people here don't know what CAPE Shiller is or they'd understand your viewpoint.", "score": 1, "replies": []}]}, {"body": "You already missed your chance unfortunately.  Now it's just a long time of suck.  And they did it by shorting at the right time.", "score": -7, "replies": []}, {"body": "They dollar cost averaged thru it.", "score": -5, "replies": []}]}
{"title": "Might be a good time to buy silver", "selftext": "My position: SLV $7 strike 5.50 premium and 1/21/22 expiration.\n\nRationale is that the gold/silver discrepancy is an all time high, there will always be demand for silver as a precious metal and for use in industry.\n\nhttps://www.etftrends.com/thematic-investing-channel/could-this-ratio-suggest-its-time-to-buy-silver-and-silver-etfs/\n\nRSI is 14.98 which is well below the classic 30 marker as “oversold.”\n\nThis is a long play I plan on setting and forgetting in my Roth IRA. Perhaps more suited to /r/investing. If silver trades at 15-20+ at expiration, that’s a nice gain. Could be much more than that. SLV once traded for $46.\n\nIn the mean time, keep day trading spy Puts and calls tomorrow. And Tesla FDs. Godspeed.", "id": "flmvmm", "created_utc": 1584670717.0, "score": 34, "upvote_ratio": 0.72, "num_comments": 100, "comments": [{"body": "Nigga wtf is silver there ain’t no werewolves in the market", "score": 246, "replies": [{"body": "Sounds like OP knows something we don't", "score": 32, "replies": [{"body": "This.", "score": 11, "replies": []}, {"body": "If you are a physical silver investor (a lot of libertarian, anti fed, or doomsday pepper types fall into this category) you will have seen in the last week that if you actually try to buy physical silver at the current \"spot price\"...you just cant do it.\n\n$SLV is at $11.30 and each share represents 1 ounce of physical silver....try to buy a 10oz bar of physical silver for $113.00 and you'll find you're out of luck.  They're selling for 140$+", "score": 9, "replies": [{"body": "Can confirm. I just got filled yesterday for 70oz @ 1135.68 that won't arrive until 4/15 (the IrOnY). Best deal I could find was $5 premium over spot. You know what happens if you try to exercise an $SLV contract fam? Might be a cheaper alternative. Or do they just settle in cash?\n\nAlso\n\n*Mike Maloney has entered the chat*", "score": 2, "replies": []}, {"body": "Are you sure there's a 1:1 ratio between a share and ounce of silver?", "score": 1, "replies": [{"body": "Prior to two weeks ago, it used to track physical price within +/- 5% or so...physical silver always has a little premium, so to buy physical its usually spot price + $0.50-$1 for generic silver bullion.  Specialty pieces, like limited mintages, older rare pieces, or artistic pieces etc of course have a higher premium.\n\nBut typically for the last decade (excluding the last month), if you wanted to buy generic bulk physical silver, you'd be paying around SLV price plus 50 cents or so per oz.   Today you have to pay SLV price plus 3 dollars.", "score": 3, "replies": [{"body": ">+/- 5%\n\nspot price is never higher than physical price, physical being higher than spot is not unusual at all", "score": 1, "replies": [{"body": "Well you could always get some physical silver below spot... just (usually) not pure silver.  Things like sterling tableware, or low percentage silver coins like War Nickles are ways to purchase physical silver below spot.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Banned for saying NIGGA", "score": 5, "replies": [{"body": "deleted my account after 10 years, allowing unelected moderators to control the narrative of subreddits has killed free speech. ` this message was mass deleted/edited with redact.dev `", "score": 15, "replies": []}, {"body": "Guess what nigga.....you said it to we both fucked.", "score": 7, "replies": [{"body": "Nigga you said it first", "score": 9, "replies": [{"body": "Don’t you put this on me nigga.", "score": 6, "replies": [{"body": "funny story about this. I am from NYC where we all say nigga to eachother as a slang word. Nobody up there says \"dude\" or \"bro\" . We say 'wassup nigga\". So, when I moved to florida , I was still talking with my NY accent and everything and I was in 6th grade. So I was talking to a guy and said \"damn nigga haha\". Everybody at the table stared at me and were like \"OH MY GOD WHATT DID U SAYYYY\". The teacher actually sent me to the principals office for being 'racist' and they were going to suspend me until i explained to them that I am from new york city and I dont understand what is a \"racist\"?? Then they explained to me that in florida so the word \"nigga\" is a racist word and that I would not be able to ever use it again.....so yea.. up to today I still use it, just not around the wrong pple i guess. The word is not racist, its just a slang and a way of life. Using it with -er is racist.", "score": 0, "replies": []}]}]}, {"body": "reverse reverse !\n\n*blpblbpblplbl*\n\nreverse reverse !", "score": 1, "replies": []}]}, {"body": "Fuck you, NPR. Trump don't give a fuck", "score": 5, "replies": []}, {"body": "Gotta forgive the newbies fam. Took me a while to get used to the sub culture and realize to use nibba instead, myself. I still enjoy saying ^(no homo) to much of the sub's chagrin all the same. Give him time.\n\nDon't laugh like it wasn't funny af tho. \n\nWerewolves...me 💀.", "score": 1, "replies": []}]}]}, {"body": "gold/silver ratio is at 4000 year lows", "score": 31, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Calls on frog plague", "score": 3, "replies": []}]}, {"body": "we ape now.", "score": 2, "replies": [{"body": "WWIV will be fought with sticks and stones", "score": 2, "replies": []}]}]}, {"body": "Entering the new year, the world’s top silver companies averaged $10.56 in production costs per ounce of silver. The price now just above $11.00. This means if it drops further mines will close. No mines? No silver. No silver price goes up. This is a long play cuz recession length cannot be determined. 2022 LEAPS are 3-4 bucks or just buy the shares. You can’t lose unless there is a global depression that lasts a decade or more.", "score": 26, "replies": [{"body": "This is great analysis", "score": 11, "replies": []}]}, {"body": "I already called for my free brochure.", "score": 49, "replies": [{"body": "Are you buying the collectible coin or what? It has Tim Tebow on it holding a cross and an American flag. I’m kinda down", "score": 10, "replies": []}]}, {"body": "deleted my account after 10 years, allowing unelected moderators to control the narrative of subreddits has killed free speech. ` this message was mass deleted/edited with redact.dev `", "score": 15, "replies": [{"body": "Updoot for boomerbucks", "score": 1, "replies": []}]}, {"body": "Nobody tell him\n\nEdit: after actually reading it it sounds legit", "score": 16, "replies": []}, {"body": "because of high industrial use, slv prob continue to fall as economy contracts?  then be ready to run up", "score": 6, "replies": [{"body": "The price of $SLV isnt tracking the price of physical silver.  If you're a big holder of physical silver like an industry that has a big stock of it, theres a huge arbitrage opportunity in going Long $SLV and selling off some of your physical silver inventory.  \n\nI would buy 6+ month out SLV calls and sleep pretty soundly at night.  It might go down a bit more, but try to find physical silver for under 14$/oz (vs $11.3 for SLV shares) and you'll see why it's a good play.", "score": 10, "replies": [{"body": "If spot stays low a while it will be a lot easier to get physically cheap as well", "score": 1, "replies": [{"body": "Cheap compared to what it cost 2 months ago.  But compared to paper silver like SLV stocks, the real deal will have a premium for a while. So $SLV will likely increase until they are close to parity when the whole market is stable again.  However long that may be.", "score": 5, "replies": []}]}]}]}, {"body": "Spoiler: it’s not.\n\nWas holding SLV for quite some time. It’s not going anywhere.", "score": 12, "replies": [{"body": "This", "score": 2, "replies": []}, {"body": "silver only moves high when there is genuine fear and panic in the markets.  i predict this will happen when Trump issues a decree for more stimulus... except it makes the markets tank. not go up.", "score": 1, "replies": []}, {"body": "Betcha you feel stupid now that the fed has unlimited printing potential", "score": 1, "replies": []}]}, {"body": "Man everyday of the last 100 years was a good day to buy silver! HA\n\n\\#stackin'", "score": 3, "replies": [{"body": "Take 20 mins and watch this though. Fucking good explanation of gold/silver price long-term movements if you're gonna try to trade it.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=2qTOWuL7Zco](https://www.youtube.com/watch?v=2qTOWuL7Zco)", "score": 3, "replies": [{"body": "I'm not watching that shit. Post a tldr", "score": 2, "replies": [{"body": "TLDR: Strong dollar crush gold now, then gold defeat dollar cause dollar is fuk.", "score": 12, "replies": [{"body": "You have such a way with words.", "score": 7, "replies": []}, {"body": "Lol gold will never defeat dollar.  Gold only wins if usd concedes\n\nMore accurately, gold relies on usd", "score": 1, "replies": []}]}, {"body": "Basically buy upp calls", "score": 2, "replies": [{"body": "Strike and date?", "score": 1, "replies": []}]}, {"body": "tldr us dollar crazy and gold not crazy. long time away gold has value and dollar doesn’t.", "score": 2, "replies": []}]}, {"body": "https://www.youtube.com/watch?v=xUUDC11kl9M\n\nCheck out the chart at around 1:46.", "score": 1, "replies": [{"body": "The Dow is a fucking terrible comparison. Constantly changing stocks and making the algorithm fit. \n\nAll I got from that was make paper gains and turn it into metal.", "score": 1, "replies": [{"body": "That and wait for currency debasement to cash out and acquire a shit ton of real assets for pennies on the dollar (RE: investment property and businesses) is pretty much the plan.", "score": 1, "replies": []}]}]}]}]}, {"body": "People diss you but SLV is crazy cheap right now both in dollars and in relation to gold. \n\nI have 1/15 SLV calls and am long SLV shares.   I also have equity puts, a mix of May and Sept SPY puts and a 1/15 LQD put.   I’m thinking about writing puts and calls.   Don’t just depend on one thing.", "score": 5, "replies": []}, {"body": "I love this idea. Silver has seemed undervalued for a long time. What’s the avenue for purchasing options on commodities?", "score": 3, "replies": [{"body": "SLV. I put my position in the post. It’s a LEAP", "score": 1, "replies": [{"body": "My bad, didn’t realize it was in the post. Thanks", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Precious metals are speculating, but derivatives are investing?   Not really buying it, no pun intended. \n\nNobody is saying SLV is great for long term investing in normal markets.   People like precious metals in bear markets and recessions, and they tend to go up.   SLV had a great run in the last downturn.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "LOL okay keep “investing” in those derivatives along with those value-minded algo traders.", "score": 2, "replies": []}]}]}, {"body": "It’s more of a hedge against massive inflation long term than an investment. Still may merit looking into", "score": 3, "replies": []}]}, {"body": "I grabbed a couple.", "score": 3, "replies": []}, {"body": "Always \"demand in the industry\"\n\nGuess what just happened, demand dropped", "score": 2, "replies": [{"body": "Demand will recover though. This is good DD.", "score": 4, "replies": []}]}, {"body": "Holy shit I was happy about my silver longs until /u/fawkesmulder destroyed any prospects of profits.", "score": 2, "replies": [{"body": "Sorry", "score": 2, "replies": []}, {"body": "Hope you are still happy", "score": 2, "replies": [{"body": "Yup. But this is a long term buy (stock, not options).", "score": 2, "replies": [{"body": "LEAP for me but our interests aligned. Also a long play obviously", "score": 2, "replies": [{"body": "Ah right, forgot to look at your expiration because it's WSB so I assumed it's a FD.", "score": 2, "replies": []}]}]}]}]}, {"body": "Get into stacking it physically if you like it", "score": 2, "replies": []}, {"body": "It’s never a good time buy silver, even on a full moon", "score": 2, "replies": []}, {"body": "How rich r u now", "score": 2, "replies": [{"body": "Doing pretty well. Went big into mining stocks and tech too.", "score": 1, "replies": [{"body": "How up r u ytd % wise", "score": 1, "replies": [{"body": "About 20% up. I got massacred in February and early March, was stuck in a company 401k. Quit my job, rolled the 401 into Roth IRA, started my business, started more seriously investing (both in Roth and in robinhood) picking companies, metals, mining, tech I wanted rather than the shit indexes you’re forced into with a 401.\n\nI’d be doing better if I didn’t make some mistakes early on, became a bear at the wrong time with SPY, lost on some 3M call options (fuck that shit company).\n\nTech and metals have been my winners.", "score": 2, "replies": [{"body": "Holy shitc whats ur business?", "score": 1, "replies": [{"body": "I’m a criminal defense and personal injury lawyer in southern CA. Decided to start my own law firm during a pandemic lol.", "score": 1, "replies": [{"body": "Oh shit nice", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Dug the premium is so bad on these just buy the stonks.", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "So why is your strike price $7, and not like $18?", "score": 1, "replies": [{"body": "Cause I like ITM plays sometimes more. Especially in a volatile market.", "score": 1, "replies": [{"body": "Little to no Theta or IV is very sexy.", "score": 2, "replies": []}]}]}, {"body": "Who wants silver in 2020", "score": 1, "replies": [{"body": "ME", "score": 2, "replies": []}]}, {"body": "My 401k is only allowed in cash and short ETFs.", "score": 1, "replies": []}, {"body": "The gold-silver ratio at 130:1 is at a all time high which makes me want to long silver but looking at silver, it can fall to as low as 5. im going to see if 10 holds if I want to long silver.", "score": 1, "replies": []}, {"body": "50% of silver’s demand (commercial use) over the next few months will be close to zero whereas only 10% of gold’s demand is commercial", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I think metals are a good investment due to inflation that will happen from all this printed money, but the market will keep falling. Highly highly doubt we have seen the bottom.", "score": 1, "replies": [{"body": "I thought I posted this in the Daily discussion... Great info though. I have had silver on my watchlist for awhile but I'm thinking about pulling the trigger.", "score": 1, "replies": []}]}]}, {"body": "I don't believe in RSI.  Gold has industrial applications too, and a lot more volatility.  Options may be cheap on SLV but you're still playing with like 7 strikes before hitting the all time high.", "score": 1, "replies": [{"body": "Silver is at an all time low right now", "score": 2, "replies": [{"body": "It doesn't matter if I can't make money with the options prices relative to the maximum value a reversion could get me.  That said, your post did inspire me to go short volatility on SLV, so thank you.", "score": 1, "replies": []}, {"body": "So is everything", "score": 1, "replies": [{"body": "We’re not at an all time low. Go back a few years, we are above that. Go back a few more, we are WAY above that. Check subprime mortgage crisis to compare to now.\n\nSilver as a commodity is really selling at a crazy low level.", "score": 6, "replies": []}]}]}]}, {"body": "Silver = Boomer Play. Ban", "score": 1, "replies": [{"body": "Gold=zoomer?", "score": 1, "replies": []}]}, {"body": "I'm not 60 dude, I'd rather buy into coltan.", "score": 0, "replies": []}]}
