{"title": "Cash gang doing what?", "selftext": "Had the brilliant idea today would be green for no reason like last Monday so sold out of all my puts Friday.  I was 100% puts so i cost myself the equivalent of a new Tesla this morning by not holding through this morning.  My puts were nke, aapl, eww, ewj, spy, tqqq, tsla.  Ugh.  \n\nWhat is cash gang doing this morning?", "id": "fft49j", "created_utc": 1583752586.0, "score": 162, "upvote_ratio": 0.93, "num_comments": 96, "comments": [{"body": "Wait for the Feds to cut the rates, buy puts at the spike.", "score": 201, "replies": [{"body": "Nice.", "score": 37, "replies": [{"body": "[removed]", "score": 15, "replies": [{"body": "Nice.", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Nice", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Nice", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Nice", "score": 1, "replies": []}]}, {"body": "This.", "score": 13, "replies": []}, {"body": "Didn't it instantly tank 5% last 50 basis point cut last week????", "score": 18, "replies": [{"body": "Nope, popped a few percent momentarily then dropped like an anchor", "score": 29, "replies": [{"body": "Lasted less than an hour too..", "score": 16, "replies": [{"body": "Which is an eternity when we're all watching the market every second", "score": 13, "replies": []}]}]}, {"body": "No it jumped like 6% on the rumors of a fed cut then dropped when it actually happened lol", "score": 7, "replies": [{"body": "'Buy the rumor, sell the news' in action", "score": 10, "replies": []}]}, {"body": "We had a bull run that lasted maybe two days.\n\nI'm kinda eyeing SPY atm.  There's got to be a rebound after a drop like this.  Shit's obviously way oversold.", "score": 2, "replies": []}, {"body": "Stayed long enough for me to buy some puts for 6.50 that I sold this morning for 38.00\n\nHighly recommend!", "score": 1, "replies": []}]}, {"body": "They better not cut rates again.  That would be fucking retarded.\n\n\nI suppose that means they’ll do it.", "score": 5, "replies": []}, {"body": "Repeat.", "score": 2, "replies": []}, {"body": "BAC puts still cheap. Go look if you don't believe.", "score": 2, "replies": [{"body": "Yah but after a 15% hit it’s hard to dive in lol", "score": 2, "replies": [{"body": "You have no idea how much lower it could go. Oil made 21 years low today aka 1092 weeks low. US banks are only at 53 weeks low and they are balls deep in Oil. The feds cutting rates 4 or 5 times this year aint helping either. What makes you think it won't fall to 5 year low or 10 year low?\n\nFood for thoughts.", "score": 3, "replies": []}]}]}, {"body": "🤦", "score": 1, "replies": []}]}, {"body": "Shoving it further in the mattress", "score": 60, "replies": []}, {"body": "Waiting until 1030 and buying puts on oil, cruises, travel, spy, tqqq, spce, dis, etc\n\nCalls on Ino, ppl, sqqq\n\nThoughts?", "score": 37, "replies": [{"body": "Not sure if you saw INO this am but the strikes on those bad boys are a pretttttyyyyy prettyyyy high", "score": 17, "replies": [{"body": "Yeahhh. I’ve been day trading ino. In and out on pumps. Easy to catch 50-100% on those. \n\nWe will see. I’m all cash and going to watch this morning", "score": 9, "replies": [{"body": "I think the yolo is puts on INO when they miss their trial date so May puts could be a 100pc nugget right there.", "score": 7, "replies": [{"body": "I sold my $4 calls a week ago because I'm a pansy and got scared when I read they've never gotten a drug to market.  This might be the real bet here.", "score": 3, "replies": [{"body": "They are trying a 3rd gen vaccine never approved by the fda no one has done the leg work to prove they don’t fuck ppl that’ll take at least a 5 year study. It’s hard core genetics. INO is a pump and dump on hype of corona.", "score": 6, "replies": [{"body": "Hhhmmm.... now you got me thinking.  Most of my puts are 3/20, and I've been ruminating on where to put the cash soon....\n\nTotally agree.", "score": 5, "replies": []}]}]}, {"body": "Their earnings is this week 3/12, wonder how that’s going to affect the price...? Small drop I think", "score": 5, "replies": [{"body": "I think it might break positive which they never do, should be a bump up wait to buy puts on that day or even prior to the ER. Keep an eye on the premiums volume", "score": 3, "replies": [{"body": "Premiums are a bit excessive now. Like spce excessive back in the day", "score": 2, "replies": [{"body": "Fuck not wrong but even if you get deep otm puts like 7 range you can print.  5/15\n\nHonestly with this market it’s wait and see and scalp where you can.", "score": 1, "replies": [{"body": "The iv is fucking 238% im not buying that lmao", "score": 4, "replies": [{"body": "Yeah it’s fucked the premium", "score": 1, "replies": []}]}, {"body": "You got it dude", "score": 1, "replies": []}]}]}]}]}, {"body": "I possess a single May INO put so we'll see what happens, haha.", "score": 2, "replies": []}]}, {"body": "Can’t trade ino if Robinhood crashed and my calls at .01", "score": 2, "replies": []}]}]}, {"body": "I’ll also be doing this, puts on crude and spy. bear gang 🐻", "score": 1, "replies": []}]}, {"body": "Think a lot of margin accounts will get called at open.  There will be some panic selling to cover the margin call.  Market drops further.  Seems like 10:45-11:00am est is most common time in past few weeks for reversal to begin.  \nIn short, short or buy puts on open.  Hold for an hour.  Sell.  Reverse course and go long or buy calls.  Hold until 3:00 est and sell.  The last hour of the market has been stupid so can’t predict that.", "score": 26, "replies": [{"body": "Thanks. Makes a lot of sense. Would you sell all puts or keep a few for later? I have 3 SPXS puts. I was thinking of selling my 3/20. Keep both 4/17. Maybe sell half of my 4/17 czr puts.", "score": 7, "replies": []}]}, {"body": "the past 2 weeks wiped my rh portfolio clean leaving me with $200 so i got 1 $152p on $v and 1 $4c on $opk.\n\nchecked the pre when i woke up a all i can say in cantonese is : to che cai shien ye!!!!!!”", "score": 11, "replies": [{"body": "I assume that means \"something something bat soup?\"", "score": 6, "replies": [{"body": "effectively, yes!!! 🙏🏼\n\ncai shien ye is the chinese god of fortune", "score": 2, "replies": []}]}]}, {"body": "Buying more puts", "score": 19, "replies": []}, {"body": "Wait for Fed to pump then then short that's my plan \n\nOil calls", "score": 21, "replies": [{"body": "Oil call? Dafuq please explain I’m smooth brain on this", "score": 12, "replies": [{"body": "how long can the oil market keep producing oil at such a low price?\n\nnot long...", "score": 15, "replies": [{"body": "I’ll be damned that’s fucking brilliant", "score": 7, "replies": []}, {"body": "But it’s different this time.", "score": 4, "replies": []}, {"body": "I see you re in it for the long haul. Good luck.", "score": 5, "replies": [{"body": "My thinking is Saudis want oil low to kill shale, but not *this* low.  They'll announce some kind of minor production cut to try to get crude back over $40 in the next day or two.", "score": 2, "replies": []}, {"body": "No, weeklies.", "score": 1, "replies": []}]}, {"body": "Saudis are actively destroying the price to hog up all the market share. It's a transition of power", "score": 4, "replies": []}, {"body": "I think it can. What's going to happen is American oil producers will feel it long before their Saudi counterparts. Once some of the American producers are out of the game, Saudis will drive the prices back up. It will be awhile.", "score": 1, "replies": []}]}, {"body": "Not op but they'll never be this cheap. Long dated calls could be worth it.", "score": 6, "replies": []}]}, {"body": "Oil calls, nice... Particular companies and strike?", "score": 7, "replies": [{"body": "Interested in the companies too", "score": 5, "replies": []}]}]}, {"body": "I think there is some daily buys to make even at the inflated prices, but I don't think I'll be in them long, we are in the territory of government manipulation now, no way Trump is willing to watch the market evaporate on his watch so they'll be some crazy over reaction intervention at some point and that will turn the whole market on its head.", "score": 10, "replies": [{"body": "So, day swing calls?", "score": 6, "replies": []}]}, {"body": "None of the europe markets are closing lower than the open.. don’t know if i want to open positions yet. I really wish i had some fuckin poots right now", "score": 9, "replies": [{"body": "Buy Spy calls expiring today on open?   Risky move, easy 100% loss potential, but any whisper from JP or trump and it could be a multibagger if only temporarily.", "score": 13, "replies": [{"body": "I’m thinking of grabbing spy call a week out to flip today", "score": 5, "replies": [{"body": "What would be your strikes on those? I got SPY calls $295c 3/16. That are practically worthless now lol and I’m debating on whether to cut losses or hold out for a bit.", "score": 3, "replies": [{"body": "Let them expire worthless", "score": 5, "replies": [{"body": "I’m gonna put that on my tombstone", "score": 7, "replies": []}]}]}]}]}]}, {"body": "buy puts at open they said.. would i lie to you?", "score": 4, "replies": []}, {"body": "I have $3k in cash which is what I originally put into RH. Now I'm only gambling with money I made during this crash.", "score": 6, "replies": []}, {"body": "Man I felt bad cause I put 500$ into gold, rest of my portfolio is in puts.\n\nI can’t imagine how big your vagina is", "score": 13, "replies": [{"body": "Didn’t sell out of fear, sold out of greed thinking I’d lock in profit and rebuy at the end of a Green Day at a better price.  No time to cry, time to figure out how to end my personal day in the green.", "score": 13, "replies": [{"body": "Cash is a position. Nothing to be ashamed of!", "score": 2, "replies": []}]}]}, {"body": "Did the same, sold all my outs Friday not wanting to hold over the weekend. Now I’m kicking myself. Thinking about picking up some long dated calls today since they’ll be cheap. Also thinking about US midstream and oil field service puts, but it’s probably too late to get big gains out of them.", "score": 4, "replies": []}, {"body": "Continuing research into costs to open my own business. Estimating I'll probably buy the equipment some time in July August. Till then, hold and stare into the void until it goes \"GUH\"", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "There has to be, no way feds let the market drop without a fight. But I think Saudi's just fucked them out of any juice they have left. US is one of the biggest oil exports.", "score": 2, "replies": []}]}, {"body": "Gold gold gold gold gold gold", "score": 3, "replies": []}, {"body": "Hoping my put orders will execute. I got on AAL $5p 5/15 to go through.", "score": 3, "replies": []}, {"body": "I'm cash gang too and couldn't do shit", "score": 3, "replies": []}, {"body": "Ya didn’t lose the money if it was never yours to begin with .. u took a profit which is always good (assuming u didn’t have the worst timing possible) and live to trade another day", "score": 3, "replies": []}, {"body": "Buying gold calls, when there is a dip in price.\n\nBut mostly I hold my puts.", "score": 2, "replies": []}, {"body": "are you me?", "score": 2, "replies": []}, {"body": "Buying amd puts", "score": 2, "replies": []}, {"body": "About to book 1st class travel somewhere on the dirt cheap.", "score": 2, "replies": []}, {"body": "Gonna buy some rollies", "score": 2, "replies": []}, {"body": "sleeping", "score": 2, "replies": []}, {"body": "Sold 2700/2695 SPX puts expiring today for a nice credit", "score": 2, "replies": []}, {"body": "Yah really good point, though I think it’s a three year low now. \nThat being said, it’s pretty easy to stay in cash as scared money.\n\nI’ve been looking at all the charts for tech stocks too and we are all the way back to last fall... definitely room.", "score": 2, "replies": []}, {"body": "Are you me?", "score": 1, "replies": [{"body": "Yes. What do we do?", "score": 1, "replies": [{"body": "I just put my money into some puts I’ve been eyeing. Obviously they are at a huge premium now...but still believe there is room to fall. No more 100% gains but money is money.\n\nJust be ready to btfd for those sweet 500% returns!", "score": 1, "replies": []}]}]}, {"body": "Waiting until at least 2500 to wait until 2100", "score": 1, "replies": []}, {"body": "I sold half my puts. My put on the XLE is gonna print!! \n\nBut not puts. This isn’t over", "score": 1, "replies": []}]}
