{"title": "Bubble pop of 3/26/2020", "selftext": "It’s ironic because the crash that will happen today is only a small part due to the 3.28 fucking million jobless claim. It’s more gonna be caused by the fact we’re in a global pandemic following back to back bigly Green Day’s. The bill hasent been signed yet but who gives a fuck the fact of the matter is BUSINESSES ARE CLOSED AND PEOPLE ARE BEING TOLD/FORCED NOT TO GO OUTSIDE. Mayor of Chicago is closing waterfronts and parks. Governments r pissed and won’t stop until Rona is gona which won’t be fore another 12-24 month. stonk market will b depleted.  \n\nSPY 4/13 200\nUBER 4/09 23.5\nAll in 🌈🐻💃😈🐥 no 🧱🤚🏼 for me", "id": "fpaw97", "created_utc": 1585226781.0, "score": 73, "upvote_ratio": 0.82, "num_comments": 89, "comments": [{"body": "no crash today, but a big giant dildo!", "score": 82, "replies": []}, {"body": "Wisconsin did a \"Safer at home\" there's still people walking, jogging, working out at the parks. Yeah.... SPY 4/3 200", "score": 72, "replies": [{"body": "And Tony still shut down golf courses for no good reason.", "score": 14, "replies": []}, {"body": "I went on a run yesterday and the amount of people out there was ridiculous. Normally It’s pretty empty and not a problem to keep your distance but I was dodging people left and right. On one hand it’s nice to see people using this as time to spend with family on the it sucks on the other we’re gonna fucking die", "score": 25, "replies": [{"body": "You're either going to die from obesity in this country or corona. I'd rather die having the body of captain america. Pick your poison.", "score": 15, "replies": [{"body": "Captain America before the super-soldier serum*", "score": 11, "replies": [{"body": "He never said which one", "score": 3, "replies": []}]}]}, {"body": "I've been biking to commute for months. Usually the walking/bike trails in the greater DC area are empty . I figured it'd be a good way to get out and stay away from strangers. However, they've been fucking PACKED lately.\n\nI actually just ride on the road now because I'm afraid I'll kill someone who is walking and not paying attention. The roads and highways are basically empty.", "score": 5, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "It's ok as long as you stay away from people which is usually pretty easy. I pass maybe 1 person on my 5 mile runs.", "score": 7, "replies": [{"body": "With your maths I should only pass 0.2 peoples on my run.\n\nAlso people avoid the fat guy puking so I'm used to getting a 6ft distance from others", "score": 1, "replies": [{"body": "Apparently it's exponential. Passed 6 people today.", "score": 1, "replies": []}]}]}, {"body": "Ah ya got me. I’m single handedly spreading coronavirus to help my puts. I made sure to cough in some people as I passed them. 🌈🐻 gang bitch", "score": 4, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "How the fuck am I supposed to buy a treadmill if I just got laid off?", "score": 5, "replies": []}, {"body": "Funny you think I make enough to afford a treadmill", "score": 2, "replies": []}, {"body": "Nobody likes you. That’s why you got downvoted", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No, karma is irrelevant. I just thought you should know", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You can send the message that you don’t care. Or you could respond. But you can’t do both at once, moron. And while you’re in the business of taking my advice, consider banning yourself and deleting your reddit. For everybody.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "That “only” completely negates the words before. do you often say things you don’t understand? Or are you lying to yourself? I’m gonna give you the benefit of the doubt. You can’t possibly be that stupid. You know you care. It’s ok. Again, you can show you don’t care or you can respond. But you can’t do both", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "All this time you said you didn’t care. Given the ultimatum, of course you care. You were given multiple chances to prove you didn’t care. And you chose to prove the opposite. You couldn’t let who you believe to be a child take you to the cleaners like that. You’re life must be pretty sad, I almost feel bad for you. \n\nAlso, you included all caps the message after you said you don’t care, and in the message where you were calling me a child. You are one of a kind", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Just figure out reverse psychology? You have gone full projection. Hate to see it. And it all started when you said you didn’t care. Have you changed that stance? I can’t tell.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You said you thought I was a child. You have made multiple homosexual allusions since. \n\nEdit: looking back, the homosexual comments from you started only *after* you began referring to me as a literal child.\n\nThis started with you trying to prove you don’t care and ended with you being okay with sexually threatening who you believed to be a child online. This has been a real exercise of character, hasn’t it?", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You said I was a child. Having fun living out your fantasies behind your keyboard?", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Point proven. You were never insulted. You steered the conversation to rp sex with a minor not because you were insulted initially, it was completely of your own accord. Nice man. I’m sure you have a lot going on for you", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Running solo okay, hanging out with your friends and family of 10 at the park not okay", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I read dodging as keeping his distance based on experience.", "score": 2, "replies": []}, {"body": "There are plenty of open roads except the occasional bunch up idiots wearing masks as they fly by in their 11 mpg SUV'S.  They'll stupidly get it touching the gas pump", "score": 1, "replies": []}]}]}]}]}, {"body": "SPY 4/3 WHAT? Put or call. SPY 4/3 10000", "score": 5, "replies": [{"body": "SPY 200p 4/3\n\nForgot the little pp\n\n\nEdit: but why the fuck is there a rally after 3.3million are jobless. My pp is getting smaller from the BRRRR", "score": 5, "replies": [{"body": "I read at least 10 articles saying that we were going to get the worst unemployment rate. I don't think no one wake up today and say: \"Look at the unemployment rate, what an unexpected turn of events, I will sell everything today, because there was no chance I could had foreseen this yesterday\"", "score": 1, "replies": [{"body": "It should've been obvious if people were paying attention to everything shutting down and cancelled events.", "score": 1, "replies": []}]}, {"body": "Fed pumping to cushion the drop", "score": 1, "replies": []}]}]}, {"body": "[Maybe you didn't read through this](https://www.wpr.org/what-know-about-wisconsins-coronavirus-stay-home-order)", "score": 2, "replies": [{"body": "I totally understand this. I get it, people need to go outside. I nag my wife to death, complaining how bored I am at home, but I still don't want to risk giving/bringing anything home to my kids.", "score": 2, "replies": []}]}, {"body": "Is 200 up now or down??", "score": 1, "replies": []}, {"body": "Yea tons of businesses still open and idiots going out for non essentials", "score": 1, "replies": []}, {"body": "What is wrong with jogging?", "score": 1, "replies": [{"body": "Nothing. The problem is a few hundred people jogging in one area.\n\nBTW, my SPY puts look like dog shit right now. I think I'm gonna go join these people jogging.", "score": 1, "replies": []}]}]}, {"body": "SPY 220p AND 200p 5/15 checking in\n\nI took the past couple of days as an opportunity to go cash gang on all non retirement accounts.", "score": 11, "replies": []}, {"body": "Minnesota just did mandatory shutdown until 4/11/2020, hold onto your puts", "score": 37, "replies": [{"body": "Not Minnesota! The final nail in the coffin. After small states like California, Italy and New York shut down I didn't think it could get worse.", "score": 118, "replies": [{"body": "Ah yes. The great state of Italy.", "score": 86, "replies": [{"body": "Only the best countries like Iowa", "score": 16, "replies": [{"body": "Remember USS Steamer Ship Seattle!", "score": 2, "replies": []}]}, {"body": "The state of Italy is where they make all the pizza for the state of New York to eat didn't ya know?", "score": 3, "replies": []}, {"body": "Ah yes, the small state that is California.", "score": 1, "replies": []}, {"body": "I thought he already said New York?", "score": -1, "replies": []}]}, {"body": "Where is Ja-Rule?? What does Ja-Rule think of all this?  Wont somebody find Ja-Rule?", "score": 19, "replies": [{"body": "Holla holla, so much pain, life ain’t a game but I’m livin it up.", "score": 2, "replies": []}, {"body": "Who gives a fuck about Ja rule I'm scared to death!", "score": 4, "replies": []}]}, {"body": "Kek", "score": -2, "replies": [{"body": "Topkek", "score": -2, "replies": []}, {"body": "Wills it", "score": -3, "replies": []}]}, {"body": "When did Trump purchase Italy.  I mean he tried to buy Greenland but I didnt know Italy was on the market.", "score": 0, "replies": []}]}, {"body": "DC and Idaho did last night. Chicago California and New York Ohio all did the previous week. This is really not been affecting anything in the market", "score": 8, "replies": [{"body": "And Colorado...", "score": 2, "replies": []}, {"body": "Anyone know a website that tracks all the closures state by state", "score": 2, "replies": []}, {"body": "Washington state as well. Only 20 people allowed in stores at a time at Fred Meyers.", "score": 2, "replies": []}, {"body": "Chicago is one of favorite states.", "score": 0, "replies": [{"body": "There’s Chicago, then there’s Illinois.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "That's my point. This is just all time but I'm guessing it's priced in. The whole coron a situation is priced in so the news doesn't matter for how bad it gets because that's what the initial drop included.\n\nStill boggled with my mind that that could be.  With everything shut down. \n\nonly other thing I can think of is a giant squeeze play", "score": -1, "replies": []}]}]}, {"body": " The order isn’t a complete lockdown and it allows essential activities and services to continue, Walz said. People will be allowed to exercise outdoors and visit the grocery store, for example, with proper social distancing.", "score": 2, "replies": [{"body": "I need a haircut bro", "score": 3, "replies": []}]}, {"body": "Priced in", "score": 2, "replies": []}]}, {"body": "Colorado did the pseudo shutdown as well last night.", "score": 9, "replies": [{"body": "I don’t know how pseudo it is. My CEO (we are a small contractor for the DoD) sent out a letter for us to carry to be in compliance with Gov. Polis’s order last night (we qualify as essential as we support the DoD).", "score": 3, "replies": [{"body": "Same here my job qualifies as \"essential\", people are still allowed to do activities outside. It's a lockdown but not really at the same time.", "score": 5, "replies": [{"body": "Only buying groceries, food, and medical things from what I saw. Walking pets and exercising. Working if your job is deemed critical. Question is if they will be enforcing it.", "score": 3, "replies": []}]}]}]}, {"body": "SPY 4/17 160P, no way this prints lol", "score": 13, "replies": []}, {"body": "Good luck!", "score": 12, "replies": []}, {"body": "[deleted]", "score": 15, "replies": [{"body": "I’ve been holding since February bro", "score": 12, "replies": []}]}, {"body": "SPY calls, got it.", "score": 4, "replies": []}, {"body": "Confirmation bias is strong with this one.", "score": 7, "replies": []}, {"body": "Idiots, Bc of non seasonally adjusted numbers futures are up. They're better", "score": 10, "replies": [{"body": "These are some big words you’re throwing at me. Position or ban.", "score": 9, "replies": [{"body": "TSLA puts, Roku puts, spy 12/31 calls", "score": 3, "replies": []}]}, {"body": "I keep hearing that but no one is providing numbers for comparison", "score": 3, "replies": [{"body": "2.9 million seasonally adjusted. Still a crushing number soooo of course everything is going up. Yeah, I don't get it either....", "score": 10, "replies": []}]}, {"body": "Are you literally retarded?  It's hardly any better", "score": 2, "replies": [{"body": "You're a dumbass, they're better than 3.28, and that is why futures traders are pumping", "score": -5, "replies": []}]}]}, {"body": "Priced in", "score": 2, "replies": []}, {"body": "ban", "score": 0, "replies": []}, {"body": "I read the title and that’s enough validation for my 3/27 PUTS", "score": -1, "replies": []}]}
