{"title": "I Bought OTM Puts to take advantage of Tesla's two-month downward trend... healthy pullbacks", "selftext": "1 x $TSLA $600 Put 19 Mar 21\n\n5 x $TSLA $350 26 Put 26 Feb 21 \\[expired OTM\\]\n\n5 x $TSLA $200 Put 19 Mar 21\n\n1 x $TSLA $68 Put 19 Mar 21\n\n&#x200B;\n\nArkk Bae herself said Tesla's  healthy. Sounds like Arkk Bae ready to buy all the tips. :)\n\n&#x200B;\n\nEdit 1: Tesla ends February in a downward trend ($670.90).  March will begin the three-month downward trend.\n\nPrice target: $400", "id": "lr5eng", "created_utc": 1614146941.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 42, "comments": [{"body": "It closed up after hours. You should probably sell those\n\nEdit: yup, you’re fucked", "score": 6, "replies": [{"body": "Bragging about unrealized gains = best way to lose unrealized gains", "score": 2, "replies": [{"body": "Wish I felt this good bragging about pissing away $2k", "score": 3, "replies": [{"body": "My piss always 2k or longer", "score": 1, "replies": []}]}, {"body": "huh?", "score": 0, "replies": []}]}, {"body": "Checked Tesla news recently?", "score": 1, "replies": [{"body": "You checked the equity on your puts?", "score": 2, "replies": [{"body": "Idk how Tesla price can create any revenue when the manufacturing plant shut down? Price will continue its two-month downward trend", "score": 1, "replies": [{"body": "Lol they didn’t have revenue and the stock went up over 700% So what’s your point?", "score": 3, "replies": [{"body": "Ahem", "score": 1, "replies": [{"body": "Are your 2/26 puts printing? Any of them? You lost equity right?", "score": 2, "replies": [{"body": "Those were lottery tickets.. buying more monday. :)", "score": 1, "replies": []}]}]}]}]}, {"body": "I check my profits every day.", "score": 1, "replies": [{"body": "F", "score": 1, "replies": []}]}]}]}, {"body": "What is up?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You dropped this \\ \n *** \n^^&#32;To&#32;prevent&#32;anymore&#32;lost&#32;limbs&#32;throughout&#32;Reddit,&#32;correctly&#32;escape&#32;the&#32;arms&#32;and&#32;shoulders&#32;by&#32;typing&#32;the&#32;shrug&#32;as&#32;`¯\\\\\\_(ツ)_/¯`&#32;or&#32;`¯\\\\\\_(ツ)\\_/¯`\n\n [^^Click&#32;here&#32;to&#32;see&#32;why&#32;this&#32;is&#32;necessary](https://np.reddit.com/r/OutOfTheLoop/comments/3fbrg3/is_there_a_reason_why_the_arm_is_always_missing/ctn5gbf/)", "score": 1, "replies": []}]}]}]}, {"body": "As long as you don’t care about throwing money away, you are fine. You must be independently wealthy and bored. \nI bought the dip yesterday and SOLD some CSP. Hope you were on the buying end. \nNot good luck.", "score": 6, "replies": []}, {"body": "Update?", "score": 3, "replies": []}, {"body": "Wait, $350 expires in 3 days? I'm confused. Wouldn't it have to get cut in half? I don't mess with puts, so genuinely curious. That option is cheap and only buying 5 would mean around $25-30 @ risk, correct?, but why?", "score": 2, "replies": [{"body": "The  Feb 21 puts are lottery tickets", "score": 2, "replies": [{"body": "Gotcha. It's bold!", "score": 2, "replies": []}]}, {"body": "Two strategies, you think it’ll dip down tomorrow and you can double your money on a quick flip. Or you actually think it’ll go to $345 or less( not likely). Only play here is a quick flip if it were to tank $50 on open or something like that", "score": 2, "replies": [{"body": "Only be a quick flip if there's a buyer no?", "score": 3, "replies": []}]}, {"body": "I bet Tesla retest resistance and falls", "score": 1, "replies": []}]}, {"body": "I like your style! Percentages is where it’s at. A slight pullback effects all options. Take the cheapest one out there and if it expires, you lost a nice meal at a good Brazilian Steakhouse. Come ahead though, you might just buy it out for the night!\n\nI’m rooting for you!", "score": 2, "replies": [{"body": "Many, thanks.  Might have to look into one of those eateries!", "score": 1, "replies": [{"body": "Might wanna check the dollar menu right now", "score": 2, "replies": [{"body": "What do you make of Tesla shitting down it production plant ?", "score": 1, "replies": []}]}]}]}, {"body": "Just don’t forget about theta, as it gets closer to the date, and it’s less likely go hit, you’ll lose value very fast. Your best chance to profit on the $350/200/68 is to sell after a nice dip, unless you really think it’s going lower then those prices. The $600 for example if it goes to $500 you’ll make about a G. That happened to me on GME, bought puts for $60 that turned into $700, didn’t sell, IV and theta took the value down to $85, shoulda sold on the big spike in vol", "score": 2, "replies": []}, {"body": "I have $600p 3/19... I am hoping to sell by the end of the week. We will see.\n\nI personally think the stock has a long way to fall, but don't want to be killed by theta.", "score": 2, "replies": [{"body": "I think $600 is possible, though i doubt it. Theta will probably get you instead. The rest of the op's options are out there. Hope they were cheap.", "score": 3, "replies": [{"body": "Yeah, vol is my friend here. Would be more likely if CW wasn't pumping the stock.", "score": 1, "replies": []}]}]}, {"body": "Peter Lynch wasn’t pumping his stocks back in the day like Ark. Tesla has to get hyped all the time instead of following up with things like you know earnings.   Look out below when more people become “lucid” and see the reality of Tesla valuation. The put strategy will have you losing a little consistently but then one monster payoff.", "score": 2, "replies": []}, {"body": "my feeling on Tesla, and has been for a while now is that it's that one sports team that your fav. team can never beat.  When you feel its overvalued it runs higher.  You buy on the dip and it drops lower.  It seems to always have the inverse, for me, of what I want it to do.", "score": 2, "replies": [{"body": "I bought a 650p 2 days ago and didn't sell yesterday 🤡🤡🤡", "score": 3, "replies": [{"body": "🥺", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I did not sell the puts... I bought the puts", "score": 2, "replies": [{"body": "Just wow.", "score": 5, "replies": [{"body": "Oh you lose", "score": 3, "replies": [{"body": "did he?", "score": 2, "replies": [{"body": "Next week going to be grand :)", "score": 1, "replies": []}]}, {"body": "I'm living... so I don't lose :)", "score": 1, "replies": []}]}]}]}]}]}
{"title": "A Note To New Investors - A Series of Tutorials", "selftext": "It has become exceeding clear that a lot of new investors, and even some seasoned ones have overlooked some crucial aspects regarding finance as a whole. I am beginning a tutorial series on YT and here, starting with finance and working our way up to investing/trading tools and strategies. Welcome to the first one.\n\nA large portion of individuals understand what money is but few know what we are supposed to be doing with it. Today we are going to discuss the 4 buckets of finance.\n\n**Short, Mid, Long, Retirement**\n\nThe purpose, asset classes, advantages and disadvantages of each will be discussed.\n\n**Short-Term Bucket**\n\n*Purpose:* It is meant to be 3-6 months worth of expenses that you have saved away. It should never exceed more than 6 months as your money in a savings account is actually losing value over time. It is meant to fund short term things such as your car breaking down, we can call this the emergency fund.  It is also a safety net, for instance, if you were to lose your job then you are sure you have 6 months to find a new one. This is perhaps the most important bucket to investors and I will explain why later.\n\n*Asset Classes:* Cash, Checking, Savings, Money Market Accounts\n\n*Advantages:* It is liquid meaning you can withdraw at any time, and it is safe as the money is insured and secured. More than that, it keeps peace of mind. This is why it is so important to investors; one of the largest risks while investing is emotion, with a full short term bucket you will not fall prey to emotion as much as you would if this was all of your funds.\n\n*Disadvantages:* Low returns, typically less than 2%. Now, keep in mind, inflation averages 2-3% and therefore outpaces your returns de-valuing your money over time. This money is also fully taxable. These are reasons why it should never exceed the 6 months worth of expenses mark. All additional funds beyond your emergency fund should be moved to other buckets to grow exponentially, outpace inflation, and increase your net-worth.\n\n**Mid-Term Bucket**\n\n*Purpose:* It is meant to fund mid-term goals such as purchasing a home, paying for college, investing in a company. This is where most people on Reddit are currently operating and where too many are being their financial journey.\n\n*Asset Classes:* Stocks, bonds, mutual funds, ETF's\n\n*Advantages:* Contrary to popular belief 7-8% is the target goal for growth. If you are able to pull off 20% or higher annual returns, then good on you. If you have a separate fund that's available for high-risk investments akin to gambling, this is how you could see 1000%+ returns. Another advantage is that its relatively liquid, meaning you could sell off securities to retrieve your money at anytime. However, it is *relatively* liquid because if they market is moving against you then you would have to sell at a loss, or even if the market is in a bull run you wouldn't want to pull out until you're closer to the top.\n\n*Disadvantages:* First and foremost; risk. Not only are you subject to market risk, but that market risk is controlled by global socioeconomic factors that could be impossible to predict. The way people react to these things is based on emotion. So emotional risk isn't only your own, personal emotion, but the emotion of everyone else in the market. Your personal emotion could be curbed by having a full short term bucket. Gains are taxable...by quite a bit. [Here is a calculator](https://smartasset.com/investing/capital-gains-tax-calculator) so you can see for yourself. Finally, there are some serious barriers to entry regarding FUD (Fear. Uncertainty. Doubt) and knowledge. I am hoping that this tutorial series could help alleviate some of that concern.\n\n**Long-Term Bucket**\n\n*Purpose:* This is meant to diversify and hedge against market risk. This bucket requires some serious capital and should be started after seeing some success in your mid-term bucket. Albeit, some individuals will purchase homes prior to investing but I don't think jumping right into real-estate is always the wisest financial decision.\n\n*Asset Classes:* Real estate, small business, cash value life insurance, fixed annuities\n\n*Advantages:* Relatively safe, several tax benefits, and it creates generational wealth; meaning these are things that could stay within your family line. The returns are typically 4-5% in this bucket. They aren't meant to outpace inflation by a terrible sum, but enough to diversify your wealth and secure tangible assets.\n\n*Disadvantages:* This bucket is probably out of many's reach right now due to the capital requirements. Even still, it is not a bucket I am focused on due to this significant disadvantage: your capital is tied up in the short term. I am personally not at a place where I want my capital tied up, all of it is in the midterm bucket until I have reached my financial goals and am ready to move on.\n\n**Retirement Bucket**\n\n*Purpose:* Well...to retire. I'm sure many of you are familiar with this bucket but a lot of younger folks (myself included) seem to have forgotten that we will one day need to rely on funds in order to survive. We don't put enough emphasis on this bucket earlier on in life.\n\n*Asset Classes:* Roth 401k, 401k, Roth IRA, IRA, Variable Annuity\n\n*Advantages:* A large advantage to this bucket is the tax advantage. Depending on which direction you go, you could end up with tax-deferred or even tax-free growth. Because the market generally trends upward, this also means on a long enough horizon you will see larger returns. The biggest benefit and the prime reason I utilize this bucket is the 401k company match. To turn that down is equivalent to denying free money.\n\n*Disadvantages:* You cannot forget that this is still the market, so you are still held to similar disadvantages as the mid-term bucket. The market could move against you and market or independent emotion could play a factor as well. Another disadvantage is that it is virtually illiquid, while you are able to take your money out you will be hit with a pretty severe penalty. This in conjunction with personal emotion could add up to serious financial disaster. The final disadvantage is that annual contributions are capped. IRA's are capped at $6000 and 401k's are capped at $19,500. Even if you have the wealth to fully commit to both of these for 60 straight years that would equate to roughly $1.5M (of course not including the returns)\n\n**Summary:**\n\nI truthfully don't believe anyone should even consider investing until they have their short term bucket full. It will make you a better investor by helping mitigate emotional response and will also provide peace of mind to allow you to practice patience in the market. On the other side, for those who have filled their short-term bucket and continue adding to their savings account, you are quite literally throwing money away and should consider at least one, if not all, of these follow-on buckets.\n\nThe tutorial series will be focused heavily on the mid-term bucket, primarily regarding stocks. This bucket is single handedly the largest creator of wealth in the entire world.\n\nThe long term bucket is a fantastic way to give peace of mind, diversify your wealth, and create generational wealth for your family and legacy. However, the capital requirements and short term lockup makes this something we won't focus on in the series until a much later date. I hope that myself and you will be considering adding to this bucket at the same time and we could open a new series on this bucket specifically.\n\nThe retirement bucket isn't something that should be ignored but should be getting added to gradually over a long timeline. Truthfully, I expect to retire from the mid-term bucket, however, I am adding to this bucket solely due to the 401k match by my employers.\n\n**TL;DR:** Before you begin investing, or even if you have and don't really know what you should do with this money, you should consider learning a bit about finance first. As we continue to crowd source and share information, I hope this generation to exhibit enough knowledge, perseverance, and grit to create a real shift in wealth distribution. Follow me for the tutorials to come. I look forward to your thoughts and questions.\n\n*Disclaimer: I am not a financial advisor, I am passionate about finance and have utilized certain tools and ideologies to take control of my money and work towards true financial freedom. None of what I say is direct advice and should not be interpreted as such. These are simply things that have worked for me and I want to share them with you.* ", "id": "lqzrk7", "created_utc": 1614130896.0, "score": 519, "upvote_ratio": 0.98, "num_comments": 48, "comments": [{"body": "Thank you for giving out  advice for the new investors like myself. Looking forward to your post", "score": 44, "replies": [{"body": "Sadly you can’t post YouTube links in r/stocks feel free to check out my profile to see other posts where the link exists!", "score": 14, "replies": []}]}, {"body": "You didn't leave a link to your youtube?", "score": 11, "replies": [{"body": "Sadly you cannot leave links to YouTube in r/stocks. Feel free to check out my profile to snag the link!", "score": 14, "replies": []}]}, {"body": "Consider adding HSA to the retirement bucket", "score": 10, "replies": []}, {"body": "Awesome!", "score": 7, "replies": []}, {"body": "Yes. Seconded. I did not start investing (outside of 403(b)) until we had 6 months emergency fund funded. It makes it much easier to stash money in ROTH and not be emotional about it. It’ll go up and down. It’s meant for 25 years from now.", "score": 7, "replies": []}, {"body": "Upvote", "score": 10, "replies": []}, {"body": "Thank you for sharing !", "score": 5, "replies": [{"body": "Of course!", "score": 2, "replies": []}]}, {"body": "Your retirement and mid term are the same asset classes.", "score": 6, "replies": [{"body": "Yeah they both fall under the market but they are different “tools”, the purpose of the buckets of wealth is to divide how you distribute your wealth. While certain components may fall under the same asset classes they are differentiated based on intent and purpose for logical reasoning", "score": 3, "replies": []}]}, {"body": "I realize how important it is to not just be fully invested in the market. Mainly due to days like this. Will be taking off a few weeks of adding in paychecks to build up a short term bucket.", "score": 3, "replies": [{"body": "Not to be counter productive to my post, but now is a great buying opportunity for the market, so you might want to use this opportunity to add first and when things begin running again start building that short term bucket", "score": 6, "replies": []}]}, {"body": "I was always told to not invest our house down payment savings into the market (even low risk) since that money we so important to us. Were we given bad advice? We are planning to buy in the next year or two", "score": 3, "replies": [{"body": "Hmm not bad advice, just incredibly safe advice. To make more money there will always be risk, there are extremely low risk options you can do with your house down payment. Over the course of 1-2 years you could see substantial returns with low risk and then take out your house payment. I wouldn’t say bad advice. Just incredibly safe. \n\nThe point is to use the mid term bucket to create your house down payment, but since you already have it, it could make sense to move it from the market to somewhere safe like a money market account. I personally would be investing it until I’m ready to buy. But I have a very high risk threshold.", "score": 1, "replies": [{"body": "Thank you! This was my initial assumption and was surprised (and disappointed) when two different professionals told me not to.\n\nEdit to add: we currently have it in a money market. So better than a savings, but still lackluster.", "score": 1, "replies": [{"body": "Yeah I mean I can’t knock them because that is the safe move like the midterm bucket is meant to build the wealth you need to fund your midterm goals such as purchasing a home. But you already have it built so the smart advice is to then take it out and keep it safe until you’re ready to purchase your home. The thing here is you are way ahead of schedule, If I were you I would be using that money in the market but remember I am extremely high risk and you will see that throughout my tutorials.", "score": 2, "replies": []}]}]}]}, {"body": "🌈", "score": 2, "replies": []}, {"body": "Following", "score": 2, "replies": []}, {"body": "Spot on with this advice. I find having plenty of accessible liquid makes days like yesterday, much easier to handle. Can't stress that enough to help keep the emotions out of it. Looking forward to learning from this series and appreciate you have taken the time to do this!", "score": 2, "replies": [{"body": "Glad you started off that way! Looking forward to continuing it!", "score": 2, "replies": [{"body": "I was into my 40s before I started investing. Besides a sep 401k that I started at 21 with my 1st business. I have and continue to invest in properties for consistent income. Now that I feel comfortable on my other building blocks, started trading early last year.  I needed a new challenge and found it in the market. I find no matter what you do in life, you can never learn too much. Always wise to know something about anything that can make you money. Diversification is the only way in my eyes. I am looking forward to the knowledge that you are willing to share and I also admire you for taking the time to do so. We can get some serious gratification in life by paying it forward! Its a great feeling to know you help others succeed in life.", "score": 5, "replies": [{"body": "What a wonderful story, sounds like everything is going really well for you! Having all that foundation helps you mitigate virtually all of the emotion, that’s fantastic. Thank you so much for the kind words, I hope it could help some people out and I really hope I can continue down this path. My dream is to monetize it, not because of greed but then I could teach people in a full time capacity, there’s no better win-win-win scenario in my mind! Thanks for the feedback!", "score": 3, "replies": []}]}]}]}, {"body": "Nice write up. Lets not forget that you really need to zero out any high apr debt before starting in on any of these.", "score": 2, "replies": [{"body": "Thanks for that and funny you mention, the second tutorial is going to focus on how to wipe out your debt and build your short term bucket in a relatively quick time!", "score": 1, "replies": []}]}, {"body": "Sorry for a sort of dumb question, but if i have a stop-loss on a stock, can it be purchased in the after hours? Not too experienced with trading yet. Thanks in advance for answering!", "score": 2, "replies": [{"body": "I’m not sure if it’s true for all brokers but I know most of these things do not trigger in after hours", "score": 2, "replies": [{"body": "Aight, thanks!", "score": 2, "replies": [{"body": "No problem! Feel free to ask around because I’m not certain if there are places where they do trigger ATH", "score": 2, "replies": []}]}]}]}, {"body": "For younger people, isn't it advisable to be in a high-risk portfolio for your long-term money, and then as you age you start to de-risk it?", "score": 2, "replies": [{"body": "I personally agree with that sentiment however a lot of people will disagree and say retirement should be the focus starting at an early age. I think it should be both. You should be adding to retirement but not with a tremendous amount of money, I think the midterm bucket should be the primary focus for younger investors and then those gains could be moved into your retirement bucket.", "score": 1, "replies": []}]}, {"body": "Thanks for this, but I disagree with pretty much your entire thesis.", "score": 0, "replies": [{"body": "Nothing wrong with that! But please elaborate, disagreeing without context doesn’t bolster the conversation.", "score": 2, "replies": []}]}, {"body": "...or, you know... wait until it all comes crashing down and buy at the bottom.", "score": -9, "replies": [{"body": "I don’t think this is a crash, it seems like a typical reaction to the rise in yields for bonds especially considering how scary GameStop made the market look", "score": 12, "replies": []}, {"body": "\"Time in the market will always beat timing the market\" -Lao Tsu or someone I dunno", "score": 6, "replies": [{"body": "Given the gains that have occurred over the past decade, the market will need to have a marginally negative return for at least two decades in order to revert to the mean, ceteris fediebus.\n\n   \\- zephod beeblebrox, notorious intergalactic investor", "score": 1, "replies": []}]}]}, {"body": "How much text someone has to put in the post for it to be posted here? Short posts (flair questions) are often more direct and readable", "score": 1, "replies": [{"body": "Yeah I actually tried to post this exact post in r/investing And it was removed because it was “better suited as a comment”", "score": 0, "replies": []}]}]}
{"title": "Bears are gathering at r/thebigcrash. Is this a sign that there is going to be a bubble crash?", "selftext": "[deleted]", "id": "lrde8v", "created_utc": 1614174804.0, "score": 6, "upvote_ratio": 0.55, "num_comments": 40, "comments": [{"body": "Times are tough to go contrarian....everyone talks about Joe Kennedy's shoe shine boy as if that was some sort of clarevoint but what do you do when the local shoeshine boy keeps predicting a crash????\n\n My wife has been telling me to exit stocks as we are headed towards a depression....since 2013.", "score": 45, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Doesn’t that make you the bear?", "score": 3, "replies": []}]}]}, {"body": "as long as there are a lot of people that believe in a crash, that usually means that a crash isn’t nearby. Usually the „crash“ starts when everyone gets greedy", "score": 67, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I’m gay but not a bear", "score": 7, "replies": [{"body": "Twink bull?", "score": 14, "replies": [{"body": "You got it 😂👌🏼👌🏼", "score": 7, "replies": []}]}]}]}]}, {"body": "There can always be a crash. For some -10% is a crash for some others it's not. Be prepared, set a plan and don't freak out. Enjoy the show with a bag of chips.", "score": 10, "replies": []}, {"body": "I keep this chart to remind myself to be skeptical of such things: [https://pbs.twimg.com/media/DloRqfCW4AE6EZs.jpg:large](https://pbs.twimg.com/media/DloRqfCW4AE6EZs.jpg:large)", "score": 4, "replies": [{"body": "It's almost like no one predict the future. /s", "score": 1, "replies": []}]}, {"body": "I’m subbed! Confirmation bias is cool and all but I do like to keep an eye on all aspects. Everyone is always cocky in a bull run then mass panicking when it crashes down. How people were surprised last March is beyond me when the world started shutting down, people were really caught out that the market, which loathes uncertainty, decided to shit the bed shortly after.\n\nIs another crash coming? Absolutely, there always is. But could be weeks or months away or even longer. Still doesn’t pay to really only believe stonks only go up.", "score": 7, "replies": []}, {"body": "> but c'mon the chances that there is a bubble and that it is going to pop anytime soon are close to none.\n\n!remindme 1 year", "score": 5, "replies": [{"body": "I will be messaging you in 1 year on [**2022-02-24 15:17:26 UTC**](http://www.wolframalpha.com/input/?i=2022-02-24%2015:17:26%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/lrde8v/bears_are_gathering_at_rthebigcrash_is_this_a/gol8d5d/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Flrde8v%2Fbears_are_gathering_at_rthebigcrash_is_this_a%2Fgol8d5d%2F%5D%0A%0ARemindMe%21%202022-02-24%2015%3A17%3A26%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20lrde8v)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "The current correction might get extended, but i'll be shocked to see a real crash in 2021. Interest rates are too low, feds are baby sitting too much, and too many good news on the way. At worst maybe a gay year like 2018.", "score": 10, "replies": []}, {"body": "Yeah in 1929 r/thebigcrash was heavily populated aswell.", "score": 7, "replies": []}, {"body": "For those who were invested in 1999, 2007 this sure smells a little bubbly.", "score": 5, "replies": [{"body": "1999, maybe. 2007, absolutely not - this was a housing bubble with inherent systemic issues. I could definitely see this as being a 1999 repeat.. My only reservation: unprecedented amounts of federal defensive actions. Money being printed like mad and the interest rates are still really low. Based on this, a crash shouldn’t happen in the coming months.. But then again, crashes usually come unexpectedly and when you least expect it.", "score": 7, "replies": []}, {"body": "I wasn’t investing back then, but I was an adult even before the 99 crash and I’ve done some research.\n\nThere are major differentiating factors between those two and today, especially the housing market crash. The dotcom crash might look similar in one aspect: overvalued tech stocks. The thing is, those “companies” back then were a few guys in a garage talking about being the next AOL. Consumers had no clue how to differentiate or review them. The internet was in its infancy, so you had brokers shilling pure sentiment. There is a lot more regulation in place now, and a lot more information available to research. A lot of the major new entrants/“disrupters” in the industry are themselves heavily financed and operated by reputable leadership. \n\nThat’s not to say that some won’t bust. I’m sure some of them will. There’s always the potential for a Theranos or WeWork. But they aren’t the majority of them. Most probably just won’t take off, and many of those will get acquired by one of the big dogs. Speaking of big dogs, those also didn’t really exist back then. Today you have giants like MSFT, Salesforce, Oracle, Google, Amazon, etc and they gobble up emerging tech companies. That ecosystem didn’t exist back then, either.\n\nThe housing market crash was different in many ways with the finance sector leading the crash. Today’s finance sector is sitting on double or more reserve cash than in 07, and they’re playing more conservatively with assets.", "score": 3, "replies": [{"body": "Yeah, this time is different.....", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I have to agree if you went through them things are very similar.", "score": 2, "replies": [{"body": "I know. Folkd who are reading about it have my sympathies. There's been some folks who really got hurt already and it's going to get worse.", "score": 2, "replies": []}]}]}]}, {"body": "Quantities easing, literally every single consistent indicator for a crash is going off, and the clerk at the grocery store was talking about his robinhood portfolio. It’s insane. \n\n20% of listed companies can’t pay their debt and are running on stimulus, demographic shift as boomers pull their 401ks and pensions are pulled from hedge funds, or the fact that the margin % in retail investors is beyond scary. \n\nI think we will QE and deficit spend our way to possibly midterms.", "score": 6, "replies": []}, {"body": "I think there will be crash, and soon. It's just that my \"soon\" is a lot longer than other people think.\n\nI think once last stimulus package dries up we will see a crash. I think stimulus creates brilliant conditions for maskimg actual situation in economy. Think about ppp loans for small businesses. One condition for thos loan was that business had to re-hire staff they sacked for the same salary. Yet I think significant number of those employees are sittibg at home, doing nothing. On top of that, a lot of those small companies should be bankrupt but government-guaranteed loans keep them afloat.", "score": 6, "replies": [{"body": "Sadly I don’t know a single business owner that didn’t fudge the numbers on their loan, inflated 2019 numbers and “hired” back less than was there before, my vantage point can’t be extrapolated to the whole economy, but they really didn’t think about structuring it in a manner where negative human tendencies would be avoided", "score": 3, "replies": []}, {"body": "What I find interesting to consider is that a second stimulus package might keep some firms limping along long enough for them to actually recover and get back on their feet.  A big infrastructure package and some other spending might get the economy chugging along again for another couple of years, all while the underlying issues plaguing some businesses remain hidden until things finally go south.", "score": 3, "replies": []}, {"body": "Agreed. I think 2021 will likely be the last bull run. Towards the end of the year when thinks open up again, I would be worried", "score": 1, "replies": []}]}, {"body": "One YouTuber put it this way, and it really made sense to me:\n\nIf everyone is bullish, it’s actually bearish, because everyone’s in, and there are no more buyers.\n\nIf everyone is bearish, it’s actually bullish, because there are plenty of buyers.", "score": 4, "replies": [{"body": "> \n> If everyone is bullish, it’s actually bearish, because everyone’s in, and there are no more buyers.\n\nIf I remember right that's the message from the Shoeshine Boy story about the 1920s crash.", "score": 2, "replies": []}]}, {"body": "Buy the dip or not. Correction is coming either way over next few months. Valuation especially for tech is too much to justify with low interest (which aint as low anymore, 10Y has more than doubled in last 6 mnths). I believe a correction is coming or tech money will stay as is for sometime until earnings catch up.", "score": 3, "replies": []}, {"body": "Don’t pretend like you know any better than anyone else lol", "score": 2, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Not joining your shitty subreddit", "score": 0, "replies": []}]}]}, {"body": "They all bought puts.", "score": 1, "replies": []}, {"body": "Did they forget that the Printer is currently going brr brr", "score": 1, "replies": []}, {"body": "crash happens when nobody knows bout it a part from 2 people that profit from it. If its on reddit we're probably safe LOL", "score": 1, "replies": []}, {"body": "I honestly think Tesla will tank more than another 10% after they release the Starlink IPO and people reallocate funds. That's when a EV market bubble deflating could occur are my personal thoughts", "score": 1, "replies": []}, {"body": "No crash just rotation. I mean TSLA arguably had a crash. Just money going from the high flyers to the reopening stocks. Tax bills are due in April so people need cash to pay Uncle Sam. Stimulus checks probably come in time to prevent too much selling. Market is overall healthy just certain sectors going to correct.", "score": 1, "replies": []}, {"body": "What a shameless attempt to promote your own subreddit. Reported", "score": 1, "replies": []}]}
{"title": "$SCR - Everything you need to know about this company before their IPO to the NASDAQ", "selftext": "I'll start by providing a chronological history of the company, then I'll explain the three pillars of Score Media and Gaming which drive the company today and some further context.\n\nTheir History:\n\n* 1993 - They launched SportScope, a Canadian TV channel with a sports ticker/scroll banner at the bottom.\n* 1997 - SportScope morphs into Headline Sports.\n* 2000 - Headline Sports morphs into \"the Score Television Network\".\n* 2007 - theScore is the first multisport news and data app launched on Apple App Store.\n* 2011 - theScore established itself as market leader in the mobile sports coverage space with 1 million active users.\n* 2012 - theScore Inc is created after theScore sells its TV company \"theScore Television Network\" to  Rogers Communications.\n* 2015 - theScore creates its eSports platform on YouTube.\n* 2019 - They partner with Bet.Works to create betting backend technology. They launch sports betting in New Jersey in partnership with Monmouth Racetrack, becoming the first and only US media company to create and operate a mobile sportsbook. They also enter into a strategic multi-State market access partnership with Penn National Gaming\n* 2020 - They launch sports betting in Colorado and Indiana and up list from TSXV to TSX.\n* 2021 - They've launched in Iowa and have announced their IPO for the NASDAQ. They stated that there will be more state expansions to come this year for theScore Bet.\n\n**The three pillars**\n\n*theScore*\n\n* theScore app is one of the most popular mobile sports apps in North America, ranking 3rd in North America and in Canada among multi-sport news and data applications. In Canada, theScore app had approximately double the users of its closest competitors, TSN and Sportsnet, and approximately ten times the users of ESPN’s app.\n* theScore app generated approximately 3.7 billion user sessions over the last year, with average monthly sessions per active user growing at approximately 9% from 2016 to present.\n* Users of theScore app engaged with the application for approximately 101 minutes per month on average, ranking first among their peers\n* Their user chat features are very popular, particularly among users focused on sports betting, with approximately 48% of users who chat sending betting-related messages, and approximately 40% of their overall monthly active users consuming public chat content.\n* They recently announced their all time record in revenue generated from ads in their app.\n\n*theScore esports*\n\n* theScore esports produces and shares original videocontent pieces across its web and social platforms, including features and documentaries on high-profile teams, games and players from across the world of esports, as well as highlights and interviews. theScore esports’ video content is distributed across YouTube, Facebook, Twitter, Instagram, and TikTok.\n* They have approximately 1.6 million subscribers to their YouTube channel.\n* 1.1 million followers on TikTok as of Dec 2020\n* Their esports video content generated approximately 357 million views across all channels during the three-month period which ended November 30, 2020. Representing a 358% year-over-year growth in total views of their esports video content from the same period last year.\n* Worldwide, it's estimated that 495 million people watched esports online or on television in 2020, and that viewership could grow up to 646 million people annually by 2023. As a result of growth of interest in younger generations of sports fans, it is estimated that esports will become one of the biggest categories of sports betting over the long-term.\n\n*theScore Bet*\n\n* theScore Bet is authorized to provide sports betting services in New Jersey, Colorado, Indiana, and in Iowa. They also have market access for up to nine additional states via their multi-state market access agreements with Penn National Gaming\n* theScore Bet has market access to operate an online casino in New Jersey via a multi-year agreement with Twin River Worldwide Holdings, Inc. and anticipates launching its product in the state in the second half of calendar 2021. This is important because\n* Approximately 50% of users of theScore Bet on iOS devices are also users of theScore app, engaging with their content and their integrated media and betting ecosystem. This means that because they already have the userbase through their media that they don't have to spend as much on marketing compared to their competitors.\n* The total online gross gaming revenue generated in the United States is estimated to reach approximately $18 billion, of which approximately $6.4 billion is estimated to be generated in the states covered by their market access agreements.\n\n**Further Context:**\n\nCanada is on the brink of legalizing single event sports betting through bill C-218. It passed the 2nd reading by a vote of 303 and 15. It's estimated that wagering will begin by September (Start of the NFL). This is important for thescore because of their strong Canadian user base.\n\nOn February 11 2021 theScore completed a 10-1 share consolidation for the purpose of up-listing to the NASDAQ. They announced their IPO this week ~~and several sources indicate that their pricing will take place tomorrow. Usually the stock starts trading 1 day after the pricing, therefore it will start trading on the NASDAQ on Friday. I expect to receive an official statement from theScore tomorrow.~~ The stock will trade under SCR on the TSX and the NAS.\n\nThe two key factors to their success as a betting company will rely strongly on the integrations between their media and betting platforms which no other company can compete with and their massive user base from their sports media app converting to bettors. As I stated above, almost 50% of the users who chat via their media app also bet.\n\nSCR'S market cap currently sits at 1.64B, in comparison DKNG sits at 23.61B and PENN sits at 18.69.\n\nThis shows the kind of opportunity that theScore has and the unique position that it is placed in.\n\nEDIT: theScore [announced](https://finance.yahoo.com/news/thescore-announces-pricing-upsized-initial-010000199.html) that they will be trading on the NASDAQ as of FEBRUARY 25. The IPO price is listed at $27", "id": "lrqsv3", "created_utc": 1614210748.0, "score": 109, "upvote_ratio": 0.97, "num_comments": 40, "comments": [{"body": "This is well done. Thank you.", "score": 15, "replies": []}, {"body": "I use theScore app and have for years. I can't stand the ESPN app, or really even ESPN all together.  \nI'm gonna keep it on my watch list, a little hesitant depending on IPO price", "score": 11, "replies": [{"body": "IPO price is the price because in Canada they did a 10/1 reverse split in order to meet the price requirements to list on the Nasdaq.", "score": 6, "replies": [{"body": "That split certainly scared off a few investors too. I understand it was required but nonetheless. Will be nice when and if this pops", "score": 1, "replies": [{"body": "Yup just need news. \n\nAt the moment for gambling sites the biggest thing is user base you can convert and having a low conversion cost. The amount of people using the app is a large user base that can be converted relative easily to also gambling.", "score": 1, "replies": []}]}]}]}, {"body": "FWIW am Canadian and have used theScore app for years. Always has been and still is the absolute best sports app", "score": 9, "replies": [{"body": "All my friends use it. And all my friends have to go through an American website to do their betting. This is the DraftKings of Canada and potentially even bigger. I'm very bullish on this stock", "score": 2, "replies": []}]}, {"body": "So what usually happens to a stock price when it gets listed? Is it one of those situations where many will flock in before listing and then many will cash in after the listing? \n\nI've been watching this company for a while now, just haven't bought in due to the volatility around the stock price at the moment.", "score": 8, "replies": [{"body": "The difference with this stock is that it was already trading on the main Canadian exchange and OTC in the US. I think we'll see significant gains from the IPO price but nobody knows for sure 🤷‍♂️", "score": 5, "replies": [{"body": "Makes sense, I may still wait and see what happens. These days, good news usually causes a sell off for some reason..", "score": 2, "replies": [{"body": "These days? How long have you been trading?", "score": 1, "replies": []}]}]}]}, {"body": "What do revenues from esports and the app look like?", "score": 3, "replies": []}, {"body": "You son of a bitch.  I'm in.", "score": 4, "replies": []}, {"body": "When is ipo?", "score": 2, "replies": [{"body": "It'll be available to trade as of tomorrow", "score": 3, "replies": []}]}, {"body": "I'll present an abbreviated bear case, based on the financials.\n\n1) The actual non-betting operations of SCR are not particularly worth much. That should be evident based on its historical stock price.\n\n2) theScore seems to be sending signals that they think the stock is overpriced.\n\nIn August 2020, theScore issued 39.5M shares (3.95M now) for C$25.6.\n\nUp until December 2020, theScore was issuing shares at C$1.40 ($14 now).\n\nThey are once again issuing new shares, at an even higher price.\n\n3) In the most recent quarter, C$55.8M was wagered, with negative revenues earned by theScore. This is substantial growth from 2019; however, theScore has not been able to turn that into true earnings yet. It also relies on additional substantial growth in order to justify the current market cap. Even with substantial growth, theScore will still need to find a way to turn that into profit.\n\nI'm not saying this is a disaster in the making - but it is far from a sure thing, and the worst case scenario could be pretty rough.", "score": 2, "replies": [{"body": "1.  IN Q1 2021 they achieved an all-time record quarter for media revenue, generating $10.6 million, primarily driven by strong growth in direct advertising sales in both the U.S. and Canada. This will continue to grow as their betting platform and esports platforms mature. TheScore esports achieved a third-successive record-breaking quarter for video views. Total views of theScore esports’ video content across all platforms reached a new all-time quarterly record of 357 million, year-over-year growth of 355%. It's historical stock price shows how they've had to rebuild after selling their TV company and the 3 different platforms complement each other almost symbiotically. The long term benefits of this will soon become more apparent.  \n\n2.  When a company is disruptive it isn't valued on what it makes today but what it can accomplish in the future. The opportunity presented by the Legalization of single event sports betting in Canada represents massive tailwinds for the company. As legislation progresses the risk of the bill failing is reduced therefore increasing the stock price. This, along with their positive quarterly reports.  \n\n3. TheScore is in their growth phase. As they enter in more and more states they will incur additional expenses in connection with the expansion of their gaming operations and promotional costs. Even DKNG is not yet profitable. These costs will eventually decrease while their generated revenue continues to increase.\n\nFinally, user data is worth more than gold and as one of the most popular sports media apps they have no shortage of it. This alone makes them a very attractive buyout target if things don't work out as planned.", "score": 4, "replies": [{"body": "Look, I'm not saying it's a terrible buy. But your dd is one-sided and glosses over their poor financial performance and management signals. There are a lot of risks. SCR continues to issue equity in lieu of trying to borrow funds.\n\nThere's also a ton of employee stock options that are ITM and will dilute the shares further.", "score": 2, "replies": []}]}]}, {"body": "The 10 to 1 reverse split was a kick in the balls.", "score": 1, "replies": [{"body": "I’ve seen several people complain about this and I honestly don’t know why. The only reason that they did it is so the price per share could meet the NASDAQ requirements. But aside from the # of shares that appear on your portfolio, nothing else changes. You still own the same % of the company and your positions market value remains the same. Is there something I’m missing?", "score": 4, "replies": [{"body": "There's more money to be made for us at a 4:1 or 5:1 .. that's why. With it priced where it's it's you'll have a lot if people looking at cheaper options. I still hold a position in SCR but off loaded and covered my initial investment. Sidenote.. I'm a big fan of TheScore app amd have been using it since the beginning. Also was a big fan of their channel back in the day lol", "score": 2, "replies": []}, {"body": "I had 2 shares and now I have 0 shares", "score": 0, "replies": [{"body": "That sucks, and I’m sorry. But I feel like that one’s on you. This reverse merger wasn’t a secret. You had a chance to to buy up to the min. number of shares necessary to get 1 new share, or if you didn’t believe it was worth it or couldn’t afford it you had ample time to sell.", "score": 3, "replies": []}]}]}, {"body": "This IPO is because of that 10-1 split.", "score": 3, "replies": []}, {"body": "1000 to 100...I know monetarily it was ok but.. Feels bad", "score": 1, "replies": []}]}, {"body": "I'm pretty intrigued by this one, as a longtime user of the app. Sports betting could be a strong play, with the US slowly rolling out legalization. Seems like most states will legalize it in some form within the next few years. \n\nOn a somewhat related note, I'm interested to see if this will have an impact on Sinclair Broadcasting, with the Bally's merger/rebrand of their Fox Sports RSN holdings. They're apparently working on a streaming service for the Bally's networks that will integrate gaming directly into the platform. No timetable on this right now, but they have exclusive broadcast rights for the majority of MLB teams, so it's anticipated to release in March or April based on that. Bally's Corp could also see a boost from this.", "score": 1, "replies": []}, {"body": "ELI5  \n\nWhat happens to my shares of TSCRD (avg $37.24) when SCR hits the NASDAQ tomorrow? I've watched the price slowly drop this past week with the news of the SCR ticker being announced.", "score": 1, "replies": [{"body": "Your shares will be converted to SCR shares and will trade on the NASDAQ", "score": 3, "replies": [{"body": "Thanks", "score": 3, "replies": [{"body": "Already showing up as SCR on FIdelity", "score": 1, "replies": []}]}]}, {"body": "So how exactly did we get screwed here?", "score": 1, "replies": [{"body": "Not sure what you mean? I just remember the price hovering around $3.70-$4.30 for a long time  ($37-$43 after reverse split) and thought I read something about they wanted to lower the stock to match the IPO price of ~$27.", "score": 1, "replies": [{"body": "I’m in for a $38 basis post split so yeah the dilution and low IPO price was unfavorable.", "score": 1, "replies": []}]}]}]}, {"body": "I’m in", "score": 1, "replies": []}, {"body": "The stock has just started trading in the U.S. and available for those interested. I for one like the stock. Like really like it with half my portfolio. 🚀", "score": 1, "replies": []}]}
{"title": "Ark Invest's Cathie Wood on Tesla's recent dip and Bitcoin", "selftext": "", "id": "lrnpvl", "created_utc": 1614202460.0, "score": 278, "upvote_ratio": 0.98, "num_comments": 41, "comments": [{"body": "Starting to think Cathie is a smart cookie", "score": 68, "replies": [{"body": "She is, but then there are those God-told-me-to-start-an-ETF comments...", "score": 30, "replies": [{"body": "So? She left a life long career at AB to run her own fund and has had tremendous success.", "score": 17, "replies": [{"body": "And i am not knocking on her success, she *is* amazing at what she does. It is just that her God comments didnt sit right with me.", "score": -1, "replies": [{"body": "She made to the comments on a podcast called \"Jesus Calling\". Sorry if I'm being overly sensitive, but she's entitled to have religious beliefs and this new craze of looking for ways to discredit someone for their views doesn't sit right with me.", "score": 23, "replies": [{"body": "Yeah, I’m not religious, but as long as her methodology stays in line, which I have no reason to believe it wouldn’t or hasn’t , I have no problems with it. \n\nAnd one may need a lot of Jesus being deep on her picks. It’s certainly not for those lacking faith and conviction.", "score": 11, "replies": []}, {"body": "I couldn't care less if she is christian, muslim, atheist or whatever. Really. What bothered me personally was the *content* of her comments, *not* what belief system she is a part of. As i said in a previous comment, she is fantastic at her job, i am not taking away from it. But lets not fool ourselves, a big part of why we are investing in TSLA is because of Elon, and a big part why people invest in ARK is Cathie. Most of Elon's Covid comments doesnt sit right with me, and neither does Cathie's recent comments.", "score": 2, "replies": [{"body": "Her fund has done all this amazing work and it’s kinda crazy to me how people give the old man upstairs all the credit for doing nothing lol. Whatever gives you drive and purpose I guess! She would have had the same results if she named the fund after GOT or Lord of the Rings. Much more exciting books in my opinion.", "score": 2, "replies": []}]}]}, {"body": "TL;DR: I think I can perceive where you're coming from, but I'd give Cathy the benefit of the doubt.\n\nI'd guess that Cathy, at least in the instance of stock investments and business decision wise, is much more data driven and faith is more a portion of her mosaic (https://www.investopedia.com/terms/m/mosaictheory.asp) and that it gave her the boost necessary when there were naturalistic and/or psychological/spiritual headwinds. (see interview: https://www.jesuscalling.com/podcast/surviving-and-thriving-to-help-gods-children-victoria-damone-catherine-wood/)\n\nEgregious examples of irrationality (historical and present) can give Christians a bad name sometimes, but there are plenty of fastidiously scientific critical thinking Christians too.\n\nHypothetical example of a fastidious manager/executive: \n\nSubstitute any % you want| Decision Support A| Decision Support B| B also determines how A is cherry picked & interpreted |\n---|---|----|----|----\nnonsecular| 50% \"Data\" | 50% \"Gut\" | B consists of arbitrary # of rationalizations |\nsecular| 50% \"Data\" | 50% Gut + \"Faith\" | B consists of arbitrary # of rationalizations and percentage attributions |\n\nWhat others may attribute to \"hard-work\", \"trust in business partners\", \"luck\", \"tolerance of uncertainty\", the religious person may simply attribute under umbrella of \"faith in God.\"  That can be dis-satisfying at first for those that expect a readily digested naturalistic concise and consistent psychological/logical response.  The answer is going to be unique to both the worldy and spiritual experiences of whomever is making that decision and will make sense depending on how well one can momentarily synchronize with said religious person's mindset (regardless of how religious you are or aren't.)\n\nAnd sometimes experiences of synchronicity (i.e., special meaning read from individually unusual events) combined with reassurance of faith are the trigger for what finally motivates religious individuals to enact major changes to effectively escape local maxima (in business, relationships, or other life situation.)\n\nMy points are mainly: (1) don't be too quick to be wary/discount thinking of religious folks (but doesn't hurt to verify if you're concerned) and (2) that there's an existing non-\"data\" portion in secular decision making that isn't necessarily always larger for religious folks.  Decision Support (B) is more like an amalgam of intuition/faith and life experiences.\n_____\nEdit: (added link to her interview.)  She isn't a carbon-dating disbeliever being put in as head of a paleontology department.  I'd assert her faith here is likely effectively orthogonal to her investment acumen (meta-effect of Christians investing in her funds notwithstanding.)  I've known devout highly trained engineers and scientists, and I wouldn't have reason to doubt them in their area of expertise nor would I in Cathy's.  This is coming from someone that has always been pro science and has a wariness of organized religion(more moderated now) and fundamentalism(religious or otherwise) since childhood.\n\nEdit2: typos; minor rewording/disambiguation.\n\nEdit3: Minor rewording for disambiguation/clarification/grammar: \"world and religious\" -> \"both worldy and spiritual\"", "score": 2, "replies": []}, {"body": "That’s being bit of a snowflake on your part.", "score": -4, "replies": []}]}]}, {"body": "What if she was buddist or Muslim or Sikh? Why does this even matter? Many fund managers are Jewish and no one cares.", "score": 2, "replies": [{"body": "Yeah, and neither do i. I dont care about what belief system she is part of or not, it is the content of her comments that creeps me out.", "score": 3, "replies": []}]}, {"body": "'God' = 'listening to her intuition'\n\nSame thing", "score": 2, "replies": []}, {"body": "Gotta get the idea from somewhere 🤷‍♂️", "score": 5, "replies": []}, {"body": "She was on a Christian podcast. Her job is to sell her etfs.", "score": 1, "replies": [{"body": "You are making it sound like she wasn't sincere. I think she was.", "score": 2, "replies": []}]}]}]}, {"body": "she owns a model 3 -Walking the Talk!", "score": 59, "replies": [{"body": "Why not the X? She can swing that!", "score": 6, "replies": [{"body": "Even if I could swing a Roadster, I'd still buy a 3. The roadster is cool, but I can't imagine paying that kinda coin for a car and would get myself in trouble with that kinda performance. \n\nI'd rather have a nice Model 3 and 200-250k to put towards a house, plus if I can swing a Roadster I can probably afford a nice house, so the extra money goes for cool shit, like really good appliances for my kitchen, and making my house awesome.\n\nHaving hte money to buy something doesn't mean you want to.", "score": 26, "replies": [{"body": "I have a model 3 and really want a CyberTruck, but that thing is four feet longer than the model 3 and six inches wider. The model 3 really is a nice size and the model 2 will be a really cool tiny zippy car. Maybe the stock will go up enough so I can buy a 2 and a CT.", "score": 7, "replies": []}]}, {"body": "M3 performance is more fun.", "score": 5, "replies": []}, {"body": "May not fit her garage? 🤷‍♂️", "score": 7, "replies": []}, {"body": "always be grateful what you have!", "score": 2, "replies": []}]}]}, {"body": "We bought A LOT of Tesla! We like the stock!", "score": 25, "replies": []}, {"body": "Brett, the director of Research and Cathie herself said, “when our style of investing falls out of favor, we will concentrate on our highest conviction stocks”\n\nThat itself makes them the most ballsy and honest money managers on wall street.", "score": 17, "replies": [{"body": "And by far the most transparent, which is why 8% of my portfolio is with ARK.", "score": 8, "replies": []}]}, {"body": "Cathie is Bae 🙏", "score": 20, "replies": [{"body": "Truth", "score": 0, "replies": []}]}, {"body": "The true oracle", "score": 2, "replies": []}, {"body": "She's kinda cute", "score": 6, "replies": [{"body": "Oh lonely software engineers...", "score": 14, "replies": [{"body": "I'm a hardware engineer thank you very much.", "score": 3, "replies": [{"body": "Damn, even closer to a rough Scotsman!", "score": 1, "replies": [{"body": "Hells yeah.", "score": 1, "replies": []}]}]}]}, {"body": "GILF 👀", "score": 3, "replies": []}]}, {"body": "Guys around here think shes hot , lol.", "score": 1, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Have alot of respect for her ,absolutely. But some of the comments some guys say is just ridiculous. Cmon shes pretty much a senior citizen and we are gonna say shes hot. I would say she looks good for her age but the way some guys here fawn all over her is laughable.", "score": 5, "replies": [{"body": "r/oldschoolcool", "score": 2, "replies": []}]}]}, {"body": "Someone called her \"Golden Milf\" or something in the daily tread. I found that funny.", "score": 4, "replies": []}]}]}
{"title": "Bought a 120K of apple and down 8K. Thought I could catch a upward wave for a grand and now down for a while.", "selftext": "", "id": "lrcnm1", "created_utc": 1614172615.0, "score": 13, "upvote_ratio": 0.62, "num_comments": 47, "comments": [{"body": "Its apple, at least you know your not going to lose your money.", "score": 35, "replies": [{"body": "Should I put the rest in there", "score": -15, "replies": [{"body": "I personally would diversify.", "score": 9, "replies": []}, {"body": "I would get out immediately, they've been far too over priced for too long and destined to plummet.  All big money is being rotated out of tech stocks. Personally I believe GME and AMC is far less of a risk. This not investment advice and only for entertainment purposes. Apple bagholders will downvote me.", "score": -13, "replies": [{"body": "lol at first i was holy shit is this guy for real.. then i got to the last sentence. Well played my friend.", "score": 9, "replies": []}]}]}]}, {"body": "Apple has screwed me every time I take a position. I must have some sort of psychic intuition for losing money on can't lose plays.", "score": 11, "replies": []}, {"body": "Wait a month or two maybe even less you’ll be right back profiting", "score": 19, "replies": [{"body": "I have a extra 30 K or some thing should I just put it all in there", "score": -9, "replies": [{"body": "NO\n\nPut into XOM or PGX get some dividend action and ride the oil recovery wave", "score": 9, "replies": []}, {"body": "No man diversify your portfolio. Find other stocks to invest in and hold all of them. Look in to some dividend yielding ETFs", "score": 4, "replies": []}, {"body": "Like other have said, diversify, apple is good to hold a large % of your port but it’s important to diversify", "score": 2, "replies": []}]}]}, {"body": "You’re totally fine, it’s apple.  You put a significant chunk into it, you’ll be fine.  Apple is not a WSB stock.  Just hold it and don’t even check it that often.  Hold it for a few years and it will without a doubt multiply.", "score": 17, "replies": [{"body": "I would be open to making a bet with the 34K. Any recommendations?", "score": -4, "replies": [{"body": "Obligatory: NOT INVESTMENT ADVICE!\n\nI like ZOM in the short term.  It’s definitely a gamble, but you asked for a bet, and not an investment!  This veterinary company should have a run up throughout March, as they have their first product launching at the end of March.    \nI’m also a fan of pot stocks and most of them are down significantly over the past few days, so you may be able to get something at a discount.", "score": -2, "replies": []}]}]}, {"body": "These are shares... not a yolo... not realized gains or loss... this is just some guys diary.", "score": 6, "replies": []}, {"body": "is this r/investing", "score": 11, "replies": [{"body": "exactly. Bought apple? doesn't seem like a retard move. doesn't belong here ....", "score": 8, "replies": []}]}, {"body": "sir this is a grocery store", "score": 10, "replies": []}, {"body": "Hold it and sell Covered calls. I think Apple should be in 130’s Next month but Sell Covered calls for extra money at 140’s-150", "score": 7, "replies": []}, {"body": "Buy high sell low!", "score": 3, "replies": []}, {"body": "L is only on paper......paper hands take L’s. L’s only real when paper hands fold. \n\nDiamonds are for winners.", "score": 2, "replies": []}, {"body": "Safe enough long. Maybe split up your big buys over time", "score": 2, "replies": []}, {"body": "I feel your pain, I am in the same boat haha. 100k at $137.  \n\nBut its apple, it will go up eventually.", "score": 2, "replies": []}, {"body": "I’m in at 135 just hold it’s fine", "score": 1, "replies": []}, {"body": "Should be okay", "score": 1, "replies": []}, {"body": "I traded aapl all day and ended the day with just over a hundred shares at $117. It took a lot of trades to get this average down today and I will be a seller at $125. Seems like a lot of work and risk for this small of a gain but I leave the big gains for others.", "score": 1, "replies": []}, {"body": "im applaud by the comments", "score": 1, "replies": []}, {"body": "Of all the stocks that will bounce back after the whales shuffled things around, Apple will.", "score": 0, "replies": []}, {"body": "Will come back again", "score": 0, "replies": []}, {"body": "Right on Brother, Apple car coming soon", "score": 0, "replies": []}, {"body": "Its going to go up ⬆️ dont worry\nPatience is the key", "score": 1, "replies": []}, {"body": "I am feeling you, my first investment was Apple and they kept going sideways and then down 🥺", "score": 1, "replies": []}, {"body": "Start selling covered calls. (Not financial advice, but is sort of, but not really).", "score": 1, "replies": []}, {"body": "i have a stupid question. long term what's the real diff between buying lots of individual big cap stocks and just buying heavily into a 500 index fund? those funds will be weighted toward AAPL, AMZN, etc. anyway right?", "score": 1, "replies": [{"body": "I’d like a detail the answer for this as well but usually from my understanding there is less volatility in ETFs/index or mutual. The trade-off is if for example if Apple does go up really high you are limited to what the weight of Apple was in the fund. And buying and selling stocks have a small commission generally tied to it depending on your platform but the funds have active fees for the safety net of consistentsy they generally provide", "score": 3, "replies": []}]}, {"body": "Sorry it's my fault.  I only bought it recently too and usually when i buy anything it drops a lot.  Sorry...", "score": 1, "replies": []}, {"body": "Buy high, sell low.", "score": 1, "replies": []}, {"body": "sir this is a casino", "score": 1, "replies": []}, {"body": "keep holding, with your luck all of tech will crash while you hold", "score": 1, "replies": []}, {"body": "Holding 251 shares @ 131 each, I'm a noob, only bought so I could earn a quick grand .. but figured if it's not a bottom I can wait safely", "score": 1, "replies": []}, {"body": "By high sell low", "score": 1, "replies": []}, {"body": "I'm in the same boat bud! Luckily it's a reliable company and stock.", "score": 1, "replies": []}, {"body": "Keep it and you'll make money. EASY!", "score": 1, "replies": []}, {"body": "Insane one day i wish to achieve these heights", "score": 1, "replies": []}, {"body": "I bought a few stocks in Apple already am losing money, but I feel in a year, Apple is going to blow.", "score": 1, "replies": []}, {"body": "Sell some covered calls to soften the initial loss", "score": 1, "replies": []}]}
{"title": "Why \"inflation hawk\" expectations are out to lunch", "selftext": "I've been heavily sighing at a lot of posts and news articles lately. Particularly at people crowing about Burry and inflation. Here's a quick explanation of why they are wrong, and why Powell is right, despite other central bankers worrying right now. \n\nInflation is one of the most misunderstood things in economics. Also, Burry is out to lunch on this one. Inflation is not a problem, and won't be for at least the rest of this year, likely longer. \n\nFor starters, asset prices and bond yields are only tangentially connected to inflation. Yields most directly, because they tend to reflect expectations - which, in the current environment, with yields rising from essentially zero, just means \"not deflation\" as opposed to \"runaway inflation.\" Powell's comments yesterday were 100% correct on that account - the only reason other central banks are a little concerned is that a rebound in US yields will drive up EM borrowing costs, and a rebound in the global economy will drive up capital flows to non-US markets, leading to inflation \\*elsewhere\\* (we are a flight to safe haven, relatively speaking).\n\nEven further - US asset prices have relatively little to do with inflation these days, largely because of the relatively open international economy. Stock prices *right now*, in particular, are purely due to there being relatively few places to park money despite a broadly *deflationary* global economy over the past 12-18 months. The retail trading spike is part of it, too, as is international money being parked in the US to hedge against currency risk - again, because we are the reserve currency and a flight to safety. \n\nWhat we are witnessing is a slightly weird, but fairly predictable rebalancing. Major investors are moving out of US tech sectors that are overvalued and heavily weighted in both QQQ and SPY. They are moving into beaten-down industrials (e.g. Alcoa, Oil stocks, transports), consumer discretionary (e.g. restaurants, beverages, hotels, *actual* casinos), and emerging market stocks. \n\nTL;DR: It's fine to expect some inflationary pressures in non-US markets moving forward, but US markets are relatively insulated due to how the open economy functions given the US Dollar is the reserve currency. \n\nSource: I have extensive graduate training in economic policy. These are super basic trends.", "id": "lrfr9n", "created_utc": 1614181263.0, "score": 51, "upvote_ratio": 0.88, "num_comments": 50, "comments": [{"body": "Inflation has not been a problem for many years and suddenly now there is panic? We been printing cash before too. I m buying the dips", "score": 22, "replies": [{"body": "I think what’s concerning people is More than $3 trillion has been printed in 2020 alone, which is almost 20 percent of all existing USD. \n\nI’m not speculating on the effects I’m just saying that is specifically what is concerning people. Probably would be good to see if we’ve ever printed anything close to 20% of USD in the past and compare historical effects.", "score": 14, "replies": [{"body": "50% of usd was printed last year.", "score": 13, "replies": []}, {"body": "I ve read book on hyper inflation in Germany in the 1920s and stocks were the best thing to have (together with food, gold and Foreign currency)", "score": 3, "replies": []}, {"body": "look at debt to gdp ratio during WW2 ( [United States Gross Federal Debt to GDP | 1940-2020 Data | 2021-2023 Forecast (tradingeconomics.com)](https://tradingeconomics.com/united-states/government-debt-to-gdp) ). Pretty much the same level as now and it was followed by the biggest boom in US history. Inflation fears are way overblown and if you look at inflation rates the past 20 years we've been almost always below the 2% rate the Fed targets. That's the reason why they changed the way they target inflation last year to base it on averages so that they can have looser monetary policy to make up for years when they are below target.", "score": 1, "replies": [{"body": "I would have thought that WSB, better than any other place on reddit would understand that you'd a a moron not to borrow money at a 0% interest rate and invest it. \n\nI'd also expect people on here to understand that investing borrowed money is called leverage and is fundamentally different from when your dad bought a new TV on his credit card with 20% APR.", "score": 5, "replies": []}, {"body": "Not saying anything about inflation one way or another, but comparing postwar economy to now is apples and oranges. Postwar the US was the only industrialized nation that wasn't devastated by the war, had by a large margin a much more skilled workforce, and didn't have anywhere near as large proportion of the prime aged workforce killed off.", "score": 5, "replies": [{"body": "Not saying anything either, but comparing things now to then is apples and oranges. We are no longer on a gold standard. When we went off it there were a good few years of inflation, but since then, inflation has been low for its longest period of time by far.", "score": 1, "replies": []}]}]}, {"body": "I read that in the last year the amount they printed is equal to 41% of all money printed in the history of the US.", "score": 1, "replies": [{"body": "The Fed can't even define money.", "score": 1, "replies": []}]}]}, {"body": "\"TeCh iS oVeRvaLuED\" lol jk I bought a bunch more arkk yesterday", "score": 2, "replies": [{"body": "I m holding it too", "score": 1, "replies": []}]}]}, {"body": "I’m too stupid to understand this. I will buy more stonks. Thanks! 🚀", "score": 5, "replies": []}, {"body": "[removed]", "score": 9, "replies": [{"body": "Big chunks of my brain are way overvalued you don't see me complaining because I'm not smart enough", "score": 1, "replies": []}]}, {"body": "With these interest rates it's best to live like inflation will happen.\n\nThen if it doesn't happen you'll still be ok.", "score": 3, "replies": []}, {"body": "Would you be fine with 2% interest right now? No? Exactly. Wake me up when DOW hits 40,000, until then buy the dips. Brrrrrrrrrrrrrrrrrrrr", "score": 3, "replies": []}, {"body": "I think people misinterpreted Burry's tweets surrounding inflation. I do not believe he expects hyperinflation. My reasoning: 1) his other tweets from that day 2) his ASD.\n\n1) Why would he include the other tweets if he was JUST ranting about hyperinflation? He's been cryptic lately. **He's not just going to come out and say his main point.**\n\nImo, he was saying rising rates will be the catalyst for the decline, whenever it may come. He was offering a comparison of the societal and market attitudes of the time, NOT of the macroeconomics.\n\n2) As someone with ASD, he likely talks too much about details, so much so that people miss his main points. His main point was rising rates will cause a market decline.\n\nSee, fall 2018. People blamed the Fed marginally raising rates for the decline. I disagree in part. I opine that the primary cause was structural market issues (ETPs), with the decline initiated by rates.", "score": 3, "replies": [{"body": "This is a reasonable take, so long as we grasp that it's a decline primarily in large-cap US growth and speculative tech stocks.", "score": 1, "replies": [{"body": "Look to XLF. That's not growth or tech, and the constituents benefit from rising rates. Yet, it fell Feb to Dec 2018.", "score": 2, "replies": []}]}]}, {"body": "Does \"I have extensive graduate training in [blank] \" mean I dropped out? Because if so, I will use this for the rest of my life", "score": 3, "replies": [{"body": "LMAO. Yes and No. I have an MA in Development Econ, but I dropped out of my PhD in international political economy after 6 years because fuck editing dissertations for the bajillionth time.", "score": 5, "replies": [{"body": "Respect! I dropped this semester from mech engineering because my school thinks 25 mins of a prerecorded youtube lecture and Master Physics 3rd party software is a sufficient education", "score": 2, "replies": [{"body": "LEL - gotta love the admin decisions of COVID. Was a temporary leave not an option?", "score": 1, "replies": []}]}]}]}, {"body": "I’ve been recently digging more into economics and markets and from what I’m gathering right now (at least what my monkey brain can understand) is people that are heavily invested into commodities want to pass a message and make people panic sell , stocks go down / commodities go up.", "score": 3, "replies": [{"body": "That's certainly part of it, particularly the gold bugs. Silver is a bit different - it's more speculative on solar these days, and even gold is used in a lot of industrial applications. Because of reopening moving forward, industrial commodities are likely to be bullish anyway - it just isn't a treasury yields story. The yield increases are a side effect of broader reopening, just as tech selloffs are a side effect of anticipated increasing brick and mortar shopping.", "score": 1, "replies": []}]}, {"body": "Tldr: Everything msnbc and cnbc says is a lie.", "score": 3, "replies": []}, {"body": "This is good analysis. While inflation is a concern, what’s being ignored is we aren’t in a vacuum ie., the US isn’t the only one dealing with this problem. It’s not that the value of the dollar would necessarily have to go up with the Fed raising interest rates, it just simply has to beat out other currencies in its perception of safety/being reserve.", "score": 3, "replies": [{"body": "Yeah exactly. Look at what happened after the 2008 recession. Even though the crises started in the US there were huge capital inflows to the US because it was considered the safest reserve", "score": 4, "replies": [{"body": "Its not merely that its a 'safe haven'. Most corporates have US denominated debt; ensuring you've got liquidity when the future is uncertain is a good idea.\n\nThats a lot of inflows into USD.", "score": 2, "replies": []}]}]}, {"body": "& When the dollar starts to be less & less the worlds reserve currency!??", "score": 2, "replies": [{"body": "When that happens the calculations will change. But that's not \"this year\", that's \"gradually over the next couple decades\"", "score": 3, "replies": [{"body": "Yeah, I honestly don't see the eurodollar market being disrupted by the 'euroyuan' in the foreseeable future.\n\nEurodollar markets exist partly to avoid oversight and regulation. 2 very sexy words in China.", "score": 3, "replies": []}, {"body": "ehhhh, lots of countries have been decoupling from the dollar over the past decade already. China and Russia began bypassing the dollar with bilateral trade agreements, along with Iran, Brazil and Japan doing similar trade agreements. We are 1 decade in to the decoupling of the dollar as the worlds reserve currency. \n\nIn regards to inflation, we are currently in deflation not inflation and have been printing our way out of it. Now with the pandemic all countries globally are printing their way out of it. When velocity picks up after the pandemic ends and commodity prices rise, which gets passed onto the consumer inflation will spike. Maybe not hyperinflation but high inflation is likely in the cards by 2024.\n\n&#x200B;\n\nHedge and diversify now or be too late to the party. long mining, oil, physical silver", "score": 2, "replies": [{"body": "I mean, I'm also long mining and oil/oil transports. Just not because of some sudden untethering hypothesis - it's just what the reopening rebalance calls for right now.", "score": 1, "replies": []}]}]}]}, {"body": "Its not inflation its rates u big dummy", "score": 2, "replies": []}, {"body": "Until the global markets and other currencies are not made to be subjective to the dollar, inflation will be contained. Once that dam breaks it could get ugly.", "score": 2, "replies": []}, {"body": "If we're printing that much paper - buy stock in paper?  🐵 👵  LOL", "score": 0, "replies": [{"body": "Jokes on you, money isn't printed on paper.\n\nCalls on CR, who has supplied the cotton for 100 years.", "score": 4, "replies": [{"body": "Is it really printing money? Or just adding some zeroes on a computer? Can you imagine a trillion dollars in even $100 bills?\n\nJust some basic arithmetic and it is like 1 million tons of money.", "score": 2, "replies": [{"body": "Money printer go brrrr \n\nElectrons don't go brrrr\n\nThus real money!", "score": 1, "replies": []}]}]}]}, {"body": "Enjoy your first rodeo while it lasts.", "score": -1, "replies": []}, {"body": "Maybe you need to learn LOL?", "score": -2, "replies": []}, {"body": "\"I have extensive graduate training in economic policy. \"  \nYou overpaid for a degree in Cool Aid drinking. \n\nI don't believe you or anything said by government officials.", "score": -2, "replies": []}, {"body": "M1 velocity still trending down since the first QE. Interest rate swaps still concentrated around short terms. T-bills persistent around 0%.\n\nNot only is runaway inflation off the cards - money markets don't see reflation for another 5 years or so.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit has a new paid team called **Anti-Evil Operations** which goes around permanently banning accounts for saying bad words. We made automod block them so you don't lose your account for saying a word and getting reported. It's not our rule, it's the entire website now, we're just trying to look out for our people. Sorry.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Seems like convergence of two things, which are being viewed as combined. 1) yield curve which should be expected and is a good thing. 2) cyclical trade off the back of evidence that vaccines are working so there is some rotation.\n\nThere is still a shitload of dry powder sitting on the sidelines so that should also start to re-enter the market, balancing out\n\nBuy the dip, fa**ots", "score": 1, "replies": []}, {"body": "Did your graduate training in economic policy go over deflation by inflation?", "score": 1, "replies": []}]}
{"title": "DD: Ford is STILL undervalued as fuck but the catalyst could be coming soon 🚀🚀 rocket emoji stonks $F", "selftext": "This is not advice I have no idea what I'm talking about I went to a D-tier state school and got a C in accounting II. Please do your own research and don't come knocking at my door when you don't make gamestop money on Ford. Also this is my first DD after lurking for years so please be as mean as possible. Edited for formatting.\n\n\nSo we all know that EVs are the future and that someday we are all going to be driven around in Teslas, so you could dismiss the legacy automakers as boomer shit stuck in the past, but I think that the market has over-corrected for this and overlooked a couple things:\n\n* Ford has been stealthily morphing into a tech-centric automaker\n* Ford's fundamentals are still really solid\n* Ford's new management team gets it\n\nI'll go into detail into each below. Here are some ford financials from Yahoo finance to set up some context: https://finance.yahoo.com/quote/F/key-statistics?p=F \n\n* Forward P/E: 10.53\n* P/S: 0.36\n* Mkt Cap: $46B\n\n\n**Factor 1: Ford understands where the auto market is going.**\nA couple years ago, when Ford announced that they were going to stop producing sedans for the US market, I thought they were smoking crack. Sedans still represent a thicc market segment. But nah, they kept around the high margin trucks and suvs and let GM, Honda, Toyota have the dwindling US sedan market so that they could focus their resources on developing next-gen products. And some of those are finally here and they are legit actually pretty good. \n\nThe Mach-E: $42k, 300mi range, 3.5 second 0-60. Fast charging. Not quite Tesla good yet but damn close. This is a legit viable product, and you don't get any of the Tesla customer service issues. If you factor in the $7500 federal tax credit, it's cheaper than a Model Y. \n\nElectric F150 coming soon: best selling truck in America getting an EV version. It's going to be good too. The legit info on this car is coming later this year most likely and it's going to be solid. They've already demoed it pulling a million pounds (which is BS because it was on rails so doesn't count - so we don't get a real tow cap number yet but we know it's yoked). And it's going to look like a real truck so they can capture the whole toxic-masculinity-but-my-wife-cares-about-climate-change market.\n\nThey own part of Rivian. Rivian gonna be dope af and if they can leverage Ford's manufacturing experience they could potentially skip a large part of the painful production ramp-up that Tesla went through. And Ford gets paid in the process and gets access to the tech Rivian develops. \n\nTesla's PE is like fucking 200. That's how wall street values tech companies and innovation companies. Share price is gonna go ape once the analysts figure out that Ford is a tech company that is merely funded by a legacy automaker dinosaur.\n\n**Factor 2: Ford's leadership gets it**\nMeet Jim Farley. He's like Jim Hackett, but palatable to the shareholders. What does he care about? Yeah, autonomous tech and EVs. Would you prefer he be focusing Ford's attention elsewhere? Didn't think so. https://www.cnbc.com/2020/10/01/new-ford-ceo-jim-farley-announces-restructuring-and-executive-shakeup.html \n\n**Bear Case: Ford's Fundamentals Alone Under-Price it: They Make Cars People Actually Want**\nLord Elon told God-Conduit Cathie Wood on her podcast (it's on Youtube but I can't link it - search for Elon Cathie Wood Podcast and it's at 3:30) that EVs sales will comprise 1/3 of global auto sales by 2023-2025. That's crazy growth given that EVs were about 2% of US sales last year (I know, not fair to compare US to world but it's not the main point, just context). \n\nIf that growth rate holds we're looking at like 8-10 more years of ICE vehicle sales. Which ICE vehicles do Americans like? That's right, fucking TRUCKS and SUVs, the exact vehicles that are Ford's bread and butter. The F-150 is the best selling vehicle in America and has been for years. \n\nThis vehicle segment is super margin - the average sale price of an F150 is over $40k according to CarGurus (https://www.cargurus.com/Cars/price-trends/Ford-F-150-d337). People pay stupid money for these things and Ford will be happy to accommodate them.\n\nSo, let's assume that my thesis above is incorrect, and Ford has no future in the EV space and will do nothing milk the dying ICE Truck-Yeah market until the day they hit insolvency. How could we value them then?  \n\nFortunately, such a car maker actually exists and it's called fucking Fiat-Chrysler. They Yolo'd everything into the Murica-Fuck-Yeah market segment and will literally sell you a Hellcat powered anything - only car they make that doesn't have a V8 option is the fucking Pacifica - a minivan. These guys are lunatics and pre-Peurgot merger had absolutely no plan for adapting to the future of the auto market except for buying gas mileage credits from Tesla. Let's compare their stats to Ford from above: https://finance.yahoo.com/quote/FCAU.VI/key-statistics?p=FCAU.VI\n \n* Forward P/E: 5.78\n* P/S:  0.24\n* Mkt cap: $42B\n\nSo the market is literally pricing Ford right now quite similarly to Fiat-Chrylser. Ask yourself who's future strategy makes more sense. If Ford fucked up literally everything going forward, I think their valuation makes sense. But if they have just a few product successes in the new automotive landscape, they are going to stick around... and there's your catalyst.\n\nTLDR; ford doesn't make cars, they make rockets that go to the moon 🚀🚀🚀🚀🚀", "id": "lriabl", "created_utc": 1614187681.0, "score": 95, "upvote_ratio": 0.9, "num_comments": 43, "comments": [{"body": "You left out the most important DD which is that Jim Farley is the cousin of Chris Farley. That's right, Tommy Boy.  \n\n\nIf Ford doesn't use this connection to sell it's EV's by showing clips of Chris Farley yelling about living in a van down by the river I'll be sorely disappointed.", "score": 48, "replies": [{"body": "wait is this actually true", "score": 14, "replies": [{"body": "Yes, https://en.wikipedia.org/wiki/Jim_Farley_(businessman)", "score": 18, "replies": []}]}]}, {"body": "Holding and will be buying more. Finally broke $12 today. I like the stock.", "score": 14, "replies": []}, {"body": "You forgot their partnership with Oshkosh. You know, the whole 8 billion dollar new postal vehicle contract thing.", "score": 23, "replies": [{"body": "True, they’re the king of fleet sales and government in general. USPS contract is great news. I think the upcoming Maverick will be an attractive fleet vehicle as well. Just wanted to focus on the Ford being more future-proofed than people think but this is a great point.", "score": 8, "replies": [{"body": "It is a great point and the sole reason it is above 12 right now. The recent recalls were luckily overshadowed by the generator news and now the gov. contract.\n\nI'm heavy in Ford, btw.", "score": 3, "replies": []}]}, {"body": "More details?\n\nI have 50 1/22 $12 C & 60 1/23 $10 C.\n\nSold my shares last month so I could buy a random selection of calls across the board.", "score": 1, "replies": [{"body": "[Googled for you](https://markets.businessinsider.com/news/stocks/ford-could-get-a-piece-of-oshkosh-usps-contract-as-engine-supplier-detroit-free-press-1030116695)", "score": 1, "replies": [{"body": "Thank you for rewarding my laziness.\n\nArticle is only rumors of Ford involvement as Oshkosh hasn't confirmed who the supplier will be.", "score": 1, "replies": [{"body": "Buy on rumor.", "score": 3, "replies": []}]}]}]}]}, {"body": "Why do these DDs come out on green days only", "score": 18, "replies": []}, {"body": "If Ford gets some government contract for EVs they will definitely be a good investment. Whoever gets some of those contract are going to se their share prices soar.", "score": 6, "replies": []}, {"body": "Honestly Ford maintains between 6 and 20 a share for probably 20 years. I stand at anything below 10 is a good buy and sell at anything above 16-18. \n\nThey also have excellent foresight, last 3 crashes Ford laid employees off in a couple years leading up to them. Including the most recent Coronavirus they quietly paid off long term white collar employees. \n\nMy DD I live in metro Detroit my wife worked for Ford Credit and my mom retired in 2018 with a buyout.", "score": 5, "replies": []}, {"body": "No chips no cars...", "score": 2, "replies": [{"body": "No chips no nothing dude", "score": 3, "replies": []}]}, {"body": "I fux with Ford", "score": 2, "replies": []}, {"body": "This is the way. Have $F leaps $20C Jan 20 23", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "&#x200B;\n\nWow. Absolutely masterfully crafted bear DD. Love the argument. It has never been this high, therefore it can not go any higher. Beautiful.", "score": 25, "replies": []}, {"body": "This comment is just straight up wrong. I guess that’s what happens when Robinhood only goes back 5 years.", "score": 12, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "https://finance.yahoo.com/chart/F#eyJpbnRlcnZhbCI6ImRheSIsInBlcmlvZGljaXR5IjoxLCJ0aW1lVW5pdCI6bnVsbCwiY2FuZGxlV2lkdGgiOjgsImZsaXBwZWQiOmZhbHNlLCJ2b2x1bWVVbmRlcmxheSI6dHJ1ZSwiYWRqIjp0cnVlLCJjcm9zc2hhaXIiOnRydWUsImNoYXJ0VHlwZSI6ImxpbmUiLCJleHRlbmRlZCI6ZmFsc2UsIm1hcmtldFNlc3Npb25zIjp7fSwiYWdncmVnYXRpb25UeXBlIjoib2hsYyIsImNoYXJ0U2NhbGUiOiJsaW5lYXIiLCJzdHVkaWVzIjp7IuKAjHZvbCB1bmRy4oCMIjp7InR5cGUiOiJ2b2wgdW5kciIsImlucHV0cyI6eyJpZCI6IuKAjHZvbCB1bmRy4oCMIiwiZGlzcGxheSI6IuKAjHZvbCB1bmRy4oCMIn0sIm91dHB1dHMiOnsiVXAgVm9sdW1lIjoiIzAwYjA2MSIsIkRvd24gVm9sdW1lIjoiI2ZmMzMzYSJ9LCJwYW5lbCI6ImNoYXJ0IiwicGFyYW1ldGVycyI6eyJ3aWR0aEZhY3RvciI6MC40NSwiY2hhcnROYW1lIjoiY2hhcnQifX19LCJwYW5lbHMiOnsiY2hhcnQiOnsicGVyY2VudCI6MSwiZGlzcGxheSI6IkYiLCJjaGFydE5hbWUiOiJjaGFydCIsImluZGV4IjowLCJ5QXhpcyI6eyJuYW1lIjoiY2hhcnQiLCJwb3NpdGlvbiI6bnVsbH0sInlheGlzTEhTIjpbXSwieWF4aXNSSFMiOlsiY2hhcnQiLCLigIx2b2wgdW5kcuKAjCJdfX0sInNldFNwYW4iOnt9LCJsaW5lV2lkdGgiOjIsInN0cmlwZWRCYWNrZ3JvdW5kIjp0cnVlLCJldmVudHMiOnRydWUsImNvbG9yIjoiIzAwODFmMiIsInN0cmlwZWRCYWNrZ3JvdWQiOnRydWUsImV2ZW50TWFwIjp7ImNvcnBvcmF0ZSI6eyJkaXZzIjp0cnVlLCJzcGxpdHMiOnRydWV9LCJzaWdEZXYiOnt9fSwic3ltYm9scyI6W3sic3ltYm9sIjoiRiIsInN5bWJvbE9iamVjdCI6eyJzeW1ib2wiOiJGIiwicXVvdGVUeXBlIjoiRVFVSVRZIiwiZXhjaGFuZ2VUaW1lWm9uZSI6IkFtZXJpY2EvTmV3X1lvcmsifSwicGVyaW9kaWNpdHkiOjEsImludGVydmFsIjoiZGF5IiwidGltZVVuaXQiOm51bGwsInNldFNwYW4iOnt9fV19", "score": 2, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}]}, {"body": "I didn’t say severely. My price target is like $30-40ish. And the share price is nowhere near its ATH, that was $35 in 1999. It’s traded as high as $17 as recently as 2011.", "score": 5, "replies": [{"body": "I owned it when it went up to $16.  It is possible.  They just won truck of the year....again!  But did you cayon eating apes even know they won Utility Vehicle of the year!\n\nChanges are afoot, cancelling Brazil contracts was a huge win for the new CEO!  💎🙌 on $F!  All the way.", "score": 3, "replies": []}]}, {"body": "yeah but.. long post on r/WSB means apes rush in", "score": 3, "replies": []}]}, {"body": "Boomer stock...Yuck!", "score": -3, "replies": [{"body": "Nice try, Elon", "score": 7, "replies": []}, {"body": "Have you seen the new EV mustang?", "score": 2, "replies": [{"body": "Double Yuck. Way too slow.", "score": -5, "replies": [{"body": "You don't need to go fast in your wife's boyfriend's basement.", "score": 4, "replies": [{"body": "But atleast he has standards and doesn't own Boomer trash stock or cars. Nothing Ford has is sexy anymore. They have dropped just about everything for the F-150 because that is their only revenue maker.", "score": -4, "replies": []}]}]}]}]}, {"body": "$F is a loser.... this thread is horrible advice. Now if $F were to cut about 50% of their staff, they could potentially could be a valuable company. Every manager has a manager who has a manager who has a manager...... waste waste and more waste.", "score": -5, "replies": []}, {"body": "Found On The Road Dead", "score": -1, "replies": [{"body": "Fix Or Repair Daily", "score": -1, "replies": []}]}, {"body": "GM dds F dds. Give me a break.", "score": -2, "replies": [{"body": "Am I too retarded for this or is this too retarded for me?", "score": 6, "replies": [{"body": "Yes", "score": 3, "replies": []}]}]}, {"body": "Ford is worthless until they make good products", "score": 1, "replies": []}, {"body": "In years Ford has been below $12 for years. Any sign of an upward trend. You will see a bad news magically in the news.", "score": 1, "replies": []}, {"body": "thanks for report--bought(added) 500 sh last night", "score": 1, "replies": []}, {"body": "i sold all my shares at 12$\n\ndo you think it will dip again to 11$ anytime soon? ill buy 10x more cuz fuck it", "score": 1, "replies": []}]}
{"title": "Solid State Battery-tech/stock", "selftext": "Ok Guys, Listen Up. As You might know this is the last era of the lithium-battery. You know, that chargebale battery and the one and only reason why you have to charge your phone every 2 hours and your Tesla (who doesn’t have one these days?) after 400-500 km. Let’s not forget a battery’s purpose is to stores energy. The more energy you can store in a smaller battery, the happier we humans are. Energy=happiness.\n\nFinding a cost-effective and efficient solid-state battery for electric vehicles could prove equivalent to finding the golden fleece in Greek mythology. According to the legend, anyone who possessed the golden fleece would be considered a true ruler. According to the present technology, anyone who could develop a cost-effective and efficient solid-state battery would rule the EV world.\n\nA few listed companies are working on revolutionary Solid-State Batterys. Instead of LI-ion, Solid-State Batteries use solid electrodes and solid electrolytes. For the ones who never heard about these, use Opera or Google to DYOR.\n\nSolid-State Batteries promise, already today:\n\n\\- Twice the energy  \n\\- 1/100th of the size  \n\\- 6x faster charsing  \n\\- 10X longer lifetime  \n\\- Non-flammability\n\nThis new piece of 21th-century-technology will definitely evolve coming years. Elon Musk already called it the MOAB.\n\nNow let’s talk stocks. A few companies are working on a Solid-State Battery, expecting to bring it to the market within a few years. Today, much of the development work on solid-state batteries is performed with partnerships. Among the players are conventional Li-ion battery-cell manufacturers (i.e., Samsung SDI, LG Chem, A123 Systems), battery separator technology solutions suppliers (Asahi Kasei), and materials suppliers (Solvay, Umicore, etc.).\n\nQuantumScape  \nPanasonic  \nSamsung  \nLG  \nIonic Materials  \nBMW Solid  \nPower  \nToyota  \nIlika\n\nAccording to Yole Développement’s market forecast, mass production of solid-state batteries will begin by 2022 and represent less than 1% of Li-ion battery demand by 2025. This might explain the relative low interest from investors today, which might change when large solid-state battery manufacturing capacities start to be built.\n\nSamsung, LG, BMW etc are all searching for the Solid-State battery for own use, so that is not interesting for me to invest in; they already reached their market share. Today there are 2 stocks I want to discuss with you: Quantumscape and Ilika.\n\nYou might have heard about QuantumScape before. QS went to the moon ($10- $130) when Volkswagen announced it took an extra 20% stake in the battery manufacturing company (crazy times on the stock market back in the days). Now QS is stable between $40 - $50. Fair price for a company with no revenue, but a huge potential in the EV market. QS is already backed by $300 million worth of investment from Volkswagen, Bill Gates and hedge fund billionaire George Soros. Ilika is also a pioneer in solid state batteries, trading around $3-$4. Ilika has has two development programs:\n\n\\- Stereax: miniature batterys for MedTech\n\n\\- Goliath: solid-states for the EV and other battery-powered transportation The scope of growth is huge in both industries. Compared to QS and to see what’s happening with their stocks, lets only focus on the EV market. Ilika aligned a road map where the plan to start production of the Solid-State Battery in 2026, that’s the same period as the planning of QS. Ilika actually plans a pre-pilot this year and a construction pilot in 2024. For more information, DYOR.\n\nSo why is ILIKF trading $2-$4 and QS $40-$50?\n\nFounded by Stanford University scientists a decade ago, with financial backing from Volkswagen AG, QuantumScape became a public company in November after merging with Kensington Capital Acquisition Corp, a special-purpose acquisition company (SPAC). When the SPAC deal was announced in September the parties decided a $3.3 billion valuation was appropriate. Following a blistering stock-market run, QuantumScape is now worth more than 10 times that initial value. Those who bought shares in the Kensington SPAC in August have enjoyed a 1,060% return. QuantumScape’s prominent backers include venture capital firms Khosla Ventures and Kleiner Perkins, Microsoft Inc. cofounder Bill Gates, hedge fund billionaire George Soros’s Quantum Partners and investor Jeremy Grantham. JB Straubel, a former chief technology officer at Tesla, is on the board. These people know how to bring a company to the market and make it moon $$$.\n\nLooking at their financials and progress, QS and Ilika do not differ that much. They both have enough capital to fund the business processes for the next 5-7 years, and both planning to bring their product to market in 2025. To understand the difference we have to look in the type of investors of both companies and their strategy for production.\n\nThe difference is QS plans to build a giga-factory to manufacture their batteries, which asks for a huge investment (0,5 billion – 750 million per GWh). That is the real reason why they are raising these amounts of capital. Ilika has chosen a different route. They will use the UK Battery Industrialisation Centre (UKBIC) as a first step before scaling up through an existing manufacturing company to get to the GWh. UKBIC is a key part of the Faraday Battery Challenge (FBC), a Government programme to fast track the development of cost-effective, high-performance, durable, safe, low-weight and recyclable batteries. Therefor Ilika doesn’t need the same capital investment to fund their growth.\n\nSo here is the point. Solid-State Battery technology is the future of battery. Ilika is growing in multiple industries including the EV market. Therefor I believe Ilike is a save and good investment for the long term. What are your thoughts on this? Is Ilika a good investment?", "id": "lrp9qv", "created_utc": 1614206695.0, "score": 51, "upvote_ratio": 0.8, "num_comments": 42, "comments": [{"body": "Once they figure out how to make graphene batteries efficiently, those will destroy the competition.  Google> \"graphene, brownian motion\"", "score": 13, "replies": [{"body": "Issue with graphene is that as soon as you scale up you lose all its unique properties. That’s why there still is no golden application for graphene despite the fact production has reached very cost-effective and large scale capabilities", "score": 7, "replies": [{"body": "Metals like sodium, potassium, and lithium intercalate into graphite essentially making graphene. There are some critical factors that make large size, single or few layer graphene impractical, biggest ia defect density and fragility. Graphene won't buy you anything special as an electrode material except perhaps surface area.\n\nScale isn't the issue, size and thickness are.", "score": 5, "replies": [{"body": "Size and thickness is what I meant by scale. Graphene isn’t made by the intercalation of those metals, graphene is just a single layer of graphite (all carbon)", "score": 6, "replies": [{"body": "I made graphene during my Ph.D. work by CVD. A single or few  layers isolated from bulk is correct. However, how do you pack that into a high surface area per mass electrode that has associated metal atoms at an anode? Sounds like an intercalation complex right? You also can isolate graphene by intercalation and subsequent expansion of the complex.", "score": 2, "replies": []}]}, {"body": "Agree with your electrode point though!", "score": 2, "replies": []}, {"body": "Is this what they mean by molten sodium as a battery replacement?", "score": 2, "replies": []}]}]}, {"body": "That's not a battery and has a myriad of issues for real applications.", "score": 3, "replies": []}, {"body": "I read there’s some research going into hemp nanosheets for battery production. Very similar performance to graphene but 1000x cheaper.", "score": 4, "replies": [{"body": "Hemp is a plant fiber, not a nanomaterial. Please elaborate.", "score": 5, "replies": [{"body": "https://physics.news/2020-10-08-a-truly-versatile-crop-hemp-batteries-can-be-a-more-powerful-alternative-to-graphene-or-lithium-batteries.html#", "score": 3, "replies": []}, {"body": "Obviously trolling mate", "score": 2, "replies": [{"body": "Not meant as a troll just read something interesting and was sharing. Smooth brain, sorry.", "score": 2, "replies": []}]}]}]}, {"body": "3D printed is the only way but there are some big hurdles. Traditional manufacturing is 90% inefficient.", "score": 2, "replies": []}]}, {"body": "I agree that a company without a real product, is a couple of years away from the first dollar of revenue maybe 5 years plus from a dollar of profit. Basically a real good idea is definitely worth 20 billion dollars or equivalent to the Nissan car company.", "score": 7, "replies": [{"body": "Agreed with the sentiment. Nissan would be a solid pick, but their management has been spotty.\n\nI really think Toyota is the EV play. They have been slow to release an EV because they were waiting for solid state tech. They are the largest automobile manufacturer, which gives them a huge leg up over a start up. They also revolutionized industrialization. I’m sure when their first EV is released later this year their stock is going to leap.", "score": 2, "replies": []}]}, {"body": "Dude I wish more folks saw this post. I see your DD, and think it your research will pay off. Thanks for sharing, you didn’t have to, but you did and that’s cool.", "score": 7, "replies": []}, {"body": "I have been following and touting QS for a little bit. As soon as GME pays off, doubling down in QS, AMC, and two unmentionables.", "score": 6, "replies": []}, {"body": "I think we are a good few years away from solid state batteries hitting the commercial markets. I have been studying battery technology as part of my master's degree and can tell you the technology just isn't quite there yet. Plenty of research being done but still in its infancy.\n\nI've just seen in the news that there's actually a class action lawsuit happening against Quantum Scape for deceiving investors, overstating what their technology is capable of. I'd stay away for now.", "score": 7, "replies": [{"body": "Ilikf already has battery’s in the field testing them and the response must be good. A building is in the process of build out for new production line. This is for small solid state battery’s. They should be selling battery’s sometime in 2022 as long as things go smoothly. The pandemic slowed the r&d down but as long as nothing else happens they are on track to surprise a lot of people. DD has brought me to these thoughts and we are investors.", "score": 1, "replies": []}, {"body": "I got shot down over comments about UTZ on Reddit and our DD has paid off. UTZ is knocking it out of the park doing M&A . A great company out of Pa.", "score": 1, "replies": []}]}, {"body": "I like it. Been watching it lately. Wanted to buy near $50 but was hovering higher. During yesterday’s early pullback sold a couple of $50 3/26 naked puts for $5.40. Either I get filled and effectively get in at $44.60 or I keep the cash. Let’s see.", "score": 3, "replies": []}, {"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}, {"body": "Soooo, you’re like.......lithium is dead......but from my understanding solid state batteries will be lithium. The solid state has to do with purity when creating the cell. Any moisture in the mfg can cause dendrites in the lithium, which causes the breakdown overtime, which is why your phone batteries wear out. \n\nMy money is on Toyota. They have over 1000 patents for solid state battery tech, and already have solid state battery factory in development. The issue is that solid state batteries have to be created in a low humidity environment.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Very cool", "score": 1, "replies": []}]}]}, {"body": "https://finance.yahoo.com/news/shareholder-alert-levi-korsinsky-llp-220900597.html", "score": 2, "replies": []}, {"body": "I put 12k into QS on New Years at 98. Watched it sink by 50%. Watching it climb back to only 30% down for a bit. I firmly believe in 3-5 years it’ll pay off huge. It has the financial backing from VW. Bill gates involved. And potentially a deal with Apple. I am not a financial advisor. I just LOVE the STONK", "score": 2, "replies": []}, {"body": "I had KCAC ticker changed to QS , price went to over $130 and started dropping I sold at over$100 ! Now I’m looking at ILIKF and think will it shoot up like QS did ?!!", "score": 2, "replies": []}, {"body": "27 day old account.... distraction shill", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "Many thanks for this forward looking analysis. Great job. I have no doubt that energy storage and power will be what allows us take the next step in clean energy. Checking them out now", "score": 2, "replies": []}, {"body": "I really like QS but the fact that they’re under multiple class action lawsuits (and quite recently) worries me: https://finance.yahoo.com/news/qs-deadline-alert-pawar-law-202100814.html", "score": 1, "replies": []}, {"body": "Thanks for sharing. Glad to have another battery company on the radar", "score": 1, "replies": []}, {"body": "Lets go first majestic!!", "score": 1, "replies": []}, {"body": "Lets go first majestic!!", "score": 1, "replies": []}, {"body": "Lets go first majestic!!", "score": 1, "replies": []}, {"body": "🍻", "score": 1, "replies": []}, {"body": "Riding with ilikf all the way to the moon.", "score": 1, "replies": []}]}
