{"title": "Comparing standard deviation with actual occurrences", "selftext": "I just finished reading [Option Volatility and Pricing by Natenburg](https://www.amazon.com/Option-Volatility-Pricing-Strategies-Techniques/dp/0071818774/ref=sr_1_3?crid=3U5953KE3TON2&dchild=1&keywords=option+volatility+and+pricing+by+sheldon+natenberg&qid=1607265539&sprefix=option+vol%2Caps%2C164&sr=8-3). Amazing book, but Page 480 (comparing expected standard deviation moves of options with actual moves over a 10 year time period) just blew my mind. Most of my strategies are based on the assumption that the expected standard deviation of an option is roughly equal to the probability, but obviously not. The expected standard deviation of an option underestimates the number of small moves, overestimates the number of intermediate moves, and underestimates the number of large moves. Unfortunately, Natenburg touches on this topic but just moves on, without going into depth about it\n\nDoes anyone know of any books that can help me under this concept better? Something with more research on this, strategies revolving around this, or attempting to create a pricing model that more accurately reflects this? I'm looking to get a better understanding.\n\nhttps://preview.redd.it/coezkv5gyk361.jpg?width=3024&format=pjpg&auto=webp&s=525e5d01121859748a440058121a4f144af3fc56", "id": "k7v0oj", "created_utc": 1607266263.0, "score": 7, "upvote_ratio": 0.72, "num_comments": 23, "comments": [{"body": "https://en.m.wikipedia.org/wiki/Log-normal_distribution\n\nBlack-Scholes assumes underlying prices follow a log-normal distribution, meaning their logarithms are normally distributed. Not sure if this is exactly what you’re asking, but it’s a good place to start.", "score": 4, "replies": [{"body": "Desktop link: https://en.wikipedia.org/wiki/Log-normal_distribution\n***\n ^^/r/HelperBot_ ^^Downvote ^^to ^^remove. ^^Counter: ^^303822. [^^Found ^^a ^^bug?](https://reddit.com/message/compose/?to=swim1929&subject=Bug&message=https://reddit.com/r/options/comments/k7v0oj/comparing_standard_deviation_with_actual/geu4l8h/)", "score": 2, "replies": []}, {"body": "My understanding was Natenburg's distribution I. The chart was based on a BS model, so it's already showing a log-normal distribution. But, I didn't write the book, so I'm not sure. \n\nIn any event, let me see if I can explain it better. Most option pricing is assuming a BS model. Which also assumes a BS standard deviation. If I want to sell a 1 standard deviation put, I'd sell the (roughly) -30delta, which would assume the option would expire worthless (roughly) 68% of the time. But Natenburg's chart is indicating that there is a greater percentage of moves that are within 1 standard deviation, a lesser percentage of moves roughly .5+ standard deviations away, and a greater percentage of moves 5+ standard deviation moves. So if I want to sell an option that will expire 70% of the time, it would be a higher delta than -30. Or alternatively, a -30 delta option should expire worthless more than 68% of the time. All of which should impact the value your willing to sell at. \n\nAnd yet, beyond knowing this, Im at a loss to piece together what to do next, or what to do with this information. So I'm looking for a resource that builds on this, and turns it into something useful. Or confirms the calculations after 2012.", "score": 1, "replies": [{"body": "Novice traders long premium, intermediate traders short vol and trade spreads, advanced traders know that the real money is in the skews.", "score": 5, "replies": [{"body": "And the true geniuses trade skew arbitrage between the different option markets in  indices, etfs, their vol (spot VIX), the options on their futures, and variance swaps.  All of which should have the same skew.  That's the extreme end of the technical playground IMO.", "score": 1, "replies": []}]}, {"body": "Ah, okay. You’ll want to look into volatility curves, then. In practice, options pricing differs from B-S because B-S assumes static volatility that is the same across strikes, whereas in the market IV varied per stroke. So, if a seller is concerned that the probability of his option expiring worthless is lower than the strike implies, he’ll raise the IV and sell at a higher price to reflect that, at which point the probability connection breaks down. For a direct example, look at the IV of SPX options graphed against the delta – you’ll see that OTM puts sell at a premium to OTM calls (all else equal). This is not entirely due to the sellers, of course – it’s a product of supply and demand, and arises primarily because most SPX put buyers are hedging long SPX positions, and so puts are in greater demand compared to calls.\n\nEdit: If you wanted to make a strategy out of this, you could look at what the prices imply about the likelihood of expiring worthless, and compare that to the actual likelihoods over some time period, and try to make money off the spread between the two.", "score": 1, "replies": [{"body": "Any suggestions on where to learn more about volatility curves?", "score": 1, "replies": [{"body": "If you want a book, [this](https://www.amazon.com/Volatility-Smile-Wiley-Finance/dp/1118959167/ref=nodl_) looks good although I haven’t read it, but there are plenty of resources online too", "score": 1, "replies": []}]}]}, {"body": "Intuitively- it looks like this because the underlying distribution isn’t log normal, but the IV (and subsequent greeks) are backed out of prices assuming that normal distribution.\n\nI.e. if you’re getting a sample like this, which clearly shows that 1 std =/= probabilities we would expect assuming normality, then I think what this is getting at is the fact that the implied distribution is wrong. \n\nNothing unusual going on here....", "score": 1, "replies": []}]}]}, {"body": "Download the time series data of whichever financial instrument you like. Calculate the log daily returns of said instrument. Now run 4 separate calculations. The first being the average of the returns (the mean), the second being the standard deviation, the third being the skew, and the fourth being the kurtosis. \n\nAlmost every single time you will see the same thing. A kurtosis value > 3. Kurtosis is the fourth moment of the distribution. Higher amounts of kurtosis (leptokurtosis) causes a higher than expected amount of data to be within +-1σ, and a lower than expected between 2 & 1 σ and an excess of data outside of +- 3σ. \n\nEssentially what this is showing is that there are lots of little moves, and lots of large moves. \n\nAt the back of the Natenberg book there is a brief look at implying distributions from the prices of butterflies. In the BSM world, this implied distribution at time T will be perfectly fit to the normal distribution with mean 0 and standard deviation fit to the annualised standard deviation given by the option prices. However, for equity indices, in the real world option prices observed give an implied distribution that had a negative skew, and fat tails. You can compare the distributions from these prices to the standard normal distribution given by the ATM vol. You can see the difference and it’ll look very much like the Natenberg example. \n\nThe debate is whether skew is underpriced or overpriced. Is it cheap to buy or expensive to sell? There is a tonne of interesting material out there to look at. Whilst he’s a total knob, Taleb makes for good reading with some of his newest stuff. Anyhow, hope that was helpful. Happy reading!", "score": 3, "replies": [{"body": "Helpful and interesting, but I'm still left wondering what I'm supposed to do with the information, you know? I mean, yes, I'm consistently seeing evidence of leptokurtosis (now that I'm looking) as well as skew (which was less surprising to me), but I feel like a monkey that just got its hands on a wrench. Clearly I'm supposed to do something with this, but bashing it against a rock doesn't appear to be doing anything.\n\nI've also been seeing a number of backtests (namely by u/spintwig), showing that selling 30 delta options appears to be profitable overall, which would line up with the leptokurtosis and skew I'm seeing. But other than seeing that both appear to be pointing in the same direction, I feel too dumb to know what else I'm supposed to do, like holding two pieces of a jigsaw puzzle but not knowing what picture I'm putting together. Like maybe it's indicating a more profitable strategy is a 38 delta strategy, or a 25 delta. Or maybe a 38 delta short and a 1 delta long spread (to try and capture the lower volume of intermediate days, but higher volume of large days, that the leptokurtosis is showing). IDK.\n\nSo I know someone else has put this together before. I just don't know who.\n\nAnd I'm in the middle of reading [Fooled by Randomness](https://www.amazon.com/Fooled-Randomness-Hidden-Markets-Incerto/dp/0812975219/ref=sr_1_2?crid=N8IJQMGFFB2F&dchild=1&keywords=fooled+by+randomness&qid=1607281966&s=books&sprefix=fooled+b%2Cstripbooks%2C157&sr=1-2). It's interesting, but I can't say I'm the biggest fan of his writing style. I was planning on finishing this book before deciding if I wanted to read any of his other works.", "score": 2, "replies": [{"body": "Well it depends on which asset you’re looking at. For a currency, either side of the ATM will generally be higher. This means there’s no explicit skew, but a kurtosis that hits in either direction. It just means you’ll pay up for the opportunity to buy the wings. \n\nIn BSM terms, those wings will come with a higher theta bill, a higher vega exposure, and a lower gamma exposure relative to the ATM. That makes it more attractive to sell into. So there may be some positive expectancy in selling those. Though generally I don’t see naked short wings as a great idea. Especially if you don’t intend to hedge out the deltas.", "score": 1, "replies": []}]}]}, {"body": "The optionalpha.com preaches about this distribution especially on the DOW it overestimates the volatility and people lose money on OTM options because of that. The way to take advantage of this is to sell options way OTM. Shit slow money but it’s consistent", "score": 2, "replies": [{"body": "I've heard Kirk consistently praise about how IV is overestimated consistently, but not necessarily how. Just that its overall overestimated.\n\nBut the data in the chart doesn't exactly say that. Ignoring all other factors (which is huge, btw), it's implying that volatility is overestimated for OTM and ITM options, underestimated for ATM options, and massively underestimated for way ITM options.\n\nWhat I read out of that: selling slightly OTM (how slight I'm not sure) could be worthwhile, buying ATM (or slightly ITM) could be profitable, but selling way OTM isn't worth it. Between 2003-2012, the biggest move was 11.58% in one day, which translates to a 8.84 standard deviation move, or a probability of one in two quintillion (that's 18 zeros), while the biggest down move was 9.03% in one day, which translates to a 6.75 standard deviation move, or one in 350 billion. A 6 or 8 standard deviation move in a day is valued near zero in the market, which means if you sold a 5 standard deviation move every day you'd make maybe zero dollars, and one day in 10 you'll get destroyed.", "score": 2, "replies": []}, {"body": "Ok maybe not wayyyyyy OTM but I mean OTM enough to where you give yourself a roughly 70% (or 68% if you wanna go empirical)of success and really the math is almost done for you by the brokers because you can see the probability % for the contract to be ITM. And it’s not really about how much the price moves you just want the volatility to drop dramatically to maximize profit. So it’s best to look for stocks with high IV and as we know IV crush fucks people up.", "score": 1, "replies": []}]}, {"body": "I recommend [The Misbehavior of Markets: A Fractal View of Financial Turbulence](https://www.amazon.com/dp/0465043577/ref=cm_sw_r_cp_api_glc_fabc_j.rZFbQB6Z2BX?_encoding=UTF8&psc=1) to cover fat tail distribution in markets.\n\nAdditionally I recommend [Pricing the Future](https://www.amazon.com/Pricing-Future-300-year-Black-Scholes-Equation/dp/0465022480/ref=nodl_) as a primer on how we ended up with the B-S option pricing model.", "score": 2, "replies": [{"body": "Thanks! Mandelbrot's book was already on my list, but I'll move it higher up. I didn't have Szpiro on my radar, but do now!", "score": 2, "replies": [{"body": "Yeah Mandelbrodt's book is A+", "score": 1, "replies": []}]}]}, {"body": "This is golden. Almost all Mah-ket-May-keeers \nRecommend this book. \n\nE trade has an Implied option move ( standard devs) vs the actual move...side by side for earnings.", "score": -1, "replies": []}, {"body": "The green book is our bible right? \nIf we can understand that book and trade what we learn we will get rich in the market. \n\nRemember- you have to believe you can make a million dollars( market wizards quote). \nI’m definitely enough of an adhd dreamer Autist to believe that boys! \nRemind me of this post in 5 years !", "score": -1, "replies": []}, {"body": "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Option Volatility and Pricing: Advanced Trading Strategies and Techniques, 2nd Edition \n\n>**Company**: Sheldon Natenberg\n\n>**Amazon Product Rating**: 4.4 \n\n>**Fakespot Reviews Grade**: B\n\n>**Adjusted Fakespot Rating**: 4.4\n\n>**Analysis Performed at**: 09-01-2020 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/option-volatility-and-pricing-advanced-trading-strategies-and-techniques-2nd-edition-cfb7997c-b44a-4027-baf8-bb5f4a0e86ac) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*", "score": 1, "replies": []}, {"body": "Believe it or not, seeing the overwhelming +0.5% moves. This makes a strong case for buying and holding like a boomer.", "score": 1, "replies": []}, {"body": "From my understanding, implied volatility is usually priced in excess of realized volatility because otherwise no one would sell options. There is a premium for taking that risk.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "k7x43d", "created_utc": 1607273289.0, "score": 26, "upvote_ratio": 0.84, "num_comments": 27, "comments": [{"body": "Longing volatility (VXX/UVXY) is , in my opinion , the best hedge to have. I personally don’t like inverse etfs and I stay away from leveraged choices like UVXY so I stick to far otm leaps on VXX. Also as mention already in the comments , having a good amount of cash sitting on the sidelines is a must have imo , the combination of these two things really pulled through and helped me during the crash in March and I’m definitely reaping the benefits now.", "score": 8, "replies": [{"body": "What’s the cost to being long VXX the whole time with a percentage of your portfolio?", "score": 1, "replies": [{"body": "You have to look at the option prices for VXX\n\nEdit spelling", "score": 1, "replies": [{"body": "Yeah I know but I was wondering if you had actually done it. Would be interested in knowing how much % it would cost to hedge your portfolio every year with VIX calls. Can’t imagine it being very cheap.", "score": 1, "replies": [{"body": "Never did and don’t plan to. I’m sure it’s expensive.", "score": 1, "replies": [{"body": "So having cash on the sidelines is your hedge? That’s it? The disadvantage of that is your cash is doing nothing and you are missing out on compounding.", "score": 1, "replies": [{"body": "When did I ever say I had cash. I never have cash. I’m invested fully", "score": 1, "replies": [{"body": "Whoops my bad, that was the OP of this thread! And damn, fully invested, you must have balls of steel.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I don’t think it’s a good idea to sit on cash. I think it’s a good idea to maintain a large cash position to average down as necessary.", "score": 36, "replies": [{"body": "“It’s the same picture”", "score": 29, "replies": []}, {"body": "Wouldnt a couple of puts cost less than what would you miss out on while being out of the market with extra cash?", "score": 1, "replies": [{"body": "And if the market doesn’t crash as you expect? You’re assuming it’s a foregone conclusion by buying puts resulting in missed profits.", "score": 13, "replies": [{"body": "If it doesnt crash than etf will rise, you will collect dividends.. hedging doesnt mean i expect crash, i just want to be protect in case of one. So basically the question would be:\n\nIn case of crash, put bring in the lose from portfolio.\n\n\nIn case of no crash, dividends and growth of extra cash cover puts cost and leave u in the green?\n\nIf you average down u still suffer \"loss\" from crash, while.you are not hedged, right.", "score": 0, "replies": [{"body": "Nah sell the puts with the strike at current market value on support.", "score": 2, "replies": []}]}]}, {"body": "Or call options for that matter,.if it's FOMO then that might be the best option but I wouldn't go past 6 months.", "score": 1, "replies": []}]}]}, {"body": "> What are the potential or obvious downsides here?\n\nThe only downside is the cost to insure your portfolio. It doesn't take much effort to figure out exactly how much it costs to protect your entire portfolio from a 20% downside for a certain period of time with puts, for example. But if that doesn't happen, the options expire worthless and you've lost the money. But that's how insurance works in every industry. It's a fixed-time, fixed-cost contract to protect you from a specified amount of damage.\n\nAnother issue is taxes. If the market does drop and you exercise your options to cash in at a higher value, that could be a big taxable event for you.", "score": 6, "replies": []}, {"body": "UVXY  8X return.", "score": 2, "replies": []}, {"body": "I like stocks like WMT. during march 2020 the stock went from 117 to 104. Barely moved down compared to most other stocks.", "score": 1, "replies": [{"body": "Looks like a solid performer. Had a pull back last week which makes it a better buy now", "score": 1, "replies": [{"body": "i had 10 grand in my Roth IRA from selling some somewhat average ETF's and just moving money around in general\n\nand just last week, i had the hardest 2 choices that i ever had to make.\n\nEither go all in on NIO when there was an apparent dip to the low 40's since that drama with the delisting going on or go with the tried and tested second OG before Amazon.  \n\nI decided to pick NIO, but i think i would have been happy if i had chosen Wallmart as well.", "score": 1, "replies": []}]}]}, {"body": "iwm puts, thank me later kid", "score": 0, "replies": []}, {"body": "I don't know if this was the best idea or not, but I sold some puts on VXX. Those positions aren't big enough to protect my entire portfolio, but I figure if the market drops a bunch, then those will provide *some* profit that can be redeployed at better price point than my existing bullish positions. Obviously if VXX trades sideways for a while, then those short puts should turn a profit as well. If the short puts are unprofitable at < 5 DTE, then I'll roll them out for some sort of credit. \n\nI suppose the worst case scenario is that VXX continues downwards indefinitely. \n\nIf anyone sees some sort of grotesque downside to this strategy, I'd be keen to hear it.", "score": 1, "replies": [{"body": "Not really following how selling VXX puts protects against a crash. There’s limited, predetermined upside which you’re probably going to receive anyway (unless the puts are at or near the money). In fact I can see more of a case for selling far OTM covered calls on VXX as protection against a market crash.", "score": 1, "replies": []}]}, {"body": "Ive never had luck with VIX hedges. Bought a OTM VIX call 2 months ago, down 95%. It was maybe $450 or so.  Would have been better just as cash or buy my regular index fund. At least my stocks and ETFs dont go to zero.", "score": 1, "replies": [{"body": "How far out? If they don’t expire for a year or two, they would still crash during a spike. Whether $450 is worth it depends on the size of your portfolio", "score": 1, "replies": []}]}, {"body": "$TQQQ/$UPRO  are up more way than $SH/$SPXS and we just had a crash.", "score": 1, "replies": []}, {"body": "90% of my $ is invested. Relative pennies in the savings account!", "score": 1, "replies": []}]}
{"title": "I'm old. I don't get it.", "selftext": "https://www.caranddriver.com/tesla/cybertruck\n\nBack to the future DeLorean. \n\nUnpainted tanka truck.\n\n1984 radioshack wired forward, back to the left toy. \n\nWould you buy this as a daily driver for functionality or the name on it?\n\nSpace X, fantastic.\n\nOne morning, guys at work was wounding about the lit up capillar across the sky and I had to Google image search star link for them to understand.   I'm 48, they are 20 and 25.\n\nSorry musk,  bell bottoms aren't coming back.   And I remember radioshack. \n\nWhy are you stupid fucks excited about this truck?", "id": "k7lll9", "created_utc": 1607223618.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 29, "comments": [{"body": "Such polarized views are what make Tesla the brand that it is.", "score": 10, "replies": []}, {"body": "Remember when the iPhone X came out and everyone said the notch was ugly as fuck? Now every damn phone on the market has a notch.\n\nTesla is Apple of the EV market.", "score": 7, "replies": [{"body": "I remember when the first iphone came out and everyone, including myself, was like what is this overpriced shit you can’t even customize your ring tone !!!\n\nNow I can not go anywhere without mine.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "I am going to buy this truck because you’re young and you think it looks like shit.  Ever since my first Lamborghini countach poster I’ve always wanted to drive a car that makes me look like a huge douche.\n\nDon’t understand? Then you probably never will.", "score": 10, "replies": [{"body": "Its your dream car Dennis", "score": 1, "replies": []}, {"body": "a lambo might be a douche car but at least it looks sweet! cybertruck is douche and fugly af.", "score": -2, "replies": []}]}, {"body": "Same. It’s a Silver piece of Shite", "score": 0, "replies": []}, {"body": "I’m somewhere in between and I also think this looks like trash. It also doesn’t seem very functional. Not big enough to be used like a regular truck, no trailer to be used like a pickup. So it’s just big for no reason.", "score": -1, "replies": []}]}, {"body": "if the cyber truck comes out at that price will that make other trucks go down in price?? if that's the case im getting a tundra.", "score": 4, "replies": []}, {"body": "650k pre-orders disagree. I agree, looks weird. Otherwise, lots of upside. Exterior will be much less prone to dings and various blemishes, pretty sad how even modern truck bodies are so weak. It could absolutely change the game as a work truck. If it's capable of driving it's heavy ass for 500 miles/charge, it sure would be capable of driving 50 miles round trip and running an air compressor, charge batteries, etc, in between. And on the drive home dust the financial advisor in his gt3 who paid triple for his vehicle.", "score": 4, "replies": [{"body": "50 miles is 80.47 km", "score": 5, "replies": []}]}, {"body": "In case if you didn't know, a lot of what Elon did is for his Mars lifetime mission", "score": 4, "replies": []}, {"body": "I really thought this was a joke first time I saw it!! Totally back to the future.", "score": 3, "replies": []}, {"body": "Tonka!", "score": 2, "replies": []}, {"body": "It's not necessarily the sales the trucks going to take in on its own. It's the technology that backs it. EV's are a growing field and TSLA continually proves that it's got a chokehold on the market. Nobody holds a candle to their specs.\n\nI don't care how pumped you are about your new spac or penny ev stock. If it tries to compete with TSLA on its home field it just loses. It's as simple as that", "score": 2, "replies": []}, {"body": "I don’t have the strongest opinion on the cyber truck, but if I were to have one I’d be absolutely delighted. I think if you outright poo poo it you’re both missing the point, and not who it’s being marketed to. \n\nIt’s not about Musk hearkening back to VCRs, instead it’s a fusion of his generation’s fancy over what futuristic cars would look like, mixed with the romantic appeal millennials find in vintage aesthetics (vintage takes on the future if that’s an odd sentence to reconcile). Combine an opportunity for this aesthetic with a gap in the EV market (electric trucks) and you are awash in a perfect storm of a practical car actually looking like something out of a sci-fi movie. Not the annoying, phony, and over used car world motif of describing aspects of a car alluding to futuristic styling, but actually nutting up and doing it for shits and giggles that are backed up by numbers. \n\nIt’s something I’ll have an excited giggle about even if I just see it on the road, and at least it provides an opportunity to break conventional molds going forward.", "score": 2, "replies": []}, {"body": "Ok, Boomer.", "score": 1, "replies": []}, {"body": "Ok boomer", "score": 1, "replies": []}, {"body": "To all nay sayers.  I grew up with Tanka trucks, Google the old adds.  Tanka dump truck off edge of cliff along a full size.  That didn't happen.   It only took us a couple days to destroy.\n\nTotal tech geek, yup.\n\nI'm 100٪ plus for TSLA.  Starlink, yup.   Space X, yup.   Reusing falcon 9 rockets, holy fuck this truck.\n\nAnyone remember hanging your favorite CD from your review mirror? \n\nEven today no one could bring back bell bottoms and disco.   And yet there is a faithful following of tards that think they can bring radioshack toys back to life.   Did anyone call radioshack?", "score": 0, "replies": []}, {"body": "Beauty is in the eye of the beer holder.", "score": 0, "replies": []}, {"body": "There is no way in hot-ass hell I’m not buying this.", "score": -1, "replies": []}, {"body": "Because if you buy the stock, you get it for free", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Or the forward P/E for 2021 sitting at around 220 (and 138 for 2022) because earnings is growing so fast.", "score": 1, "replies": []}]}, {"body": "Looks pretty awesome to me.", "score": 1, "replies": []}, {"body": "I have a relatively early reservation for one - but I don’t know if I will actually buy it. I’ll have to see it in person cause it might look better in person? It’s also a big chunk of change when 1) my current car is fine 2) I’m now WFH for the foreseeable future.", "score": 1, "replies": []}, {"body": "Here is why. \n\nIt can go 0-60 in 3 second\n\nIt is scratch dent and bullet proof (against small caliber at least) \n\nIt can literally drag an F150 trying to go the other way\n\nIt can drive itself\n\nIt cost less than a 1/3 in fuel costs\n\nIt can power electric equipment on the work site for hours without a generator even 240v ones. \n\nIt is better for the environment and healthier for you if you have to work next to it (no generator) \n\nIt can do all that and cost less than a $100k\n\n\nNow let me ask you this, is the Jeep Wrangler a pretty car ? Sometimes ugly has character and this has character \n\n\nNow imagine this compared to the Ford interceptor for  police cars, it would have twice the range and can charge from solar panels on top of their garage. No need to add armor and can Ram anything it wants without having to be have the paint repaired. I see lots of sales", "score": 1, "replies": []}, {"body": "You’re 1 year younger than Elon Musk.", "score": 1, "replies": []}, {"body": "TSLA as a car business is like AMZN as an online mail order business.  Even both claim that is their core business, if one does DD one realizes quickly they make money doing something else.\n\nTSLA sell carbon credits and hypes up other line of businesses.\n\nAMZN is all about consulting with AWS and gov't contracts.", "score": 1, "replies": []}]}
{"title": "which ARK fund would you buy if you were to buy one this week?", "selftext": "I'm curious which ARK fund would you buy if you were to buy one this week?\n\nThey have all done very well (understanding its been a bull market since April) but I am not sure which to invest in moving forward?\n\nwould appreciate thoughts as to which fund and why? thanks", "id": "k7nr5z", "created_utc": 1607232407.0, "score": 10, "upvote_ratio": 0.86, "num_comments": 25, "comments": [{"body": "im going to buy arkkk because it seems more diversified, not specfic to one sector", "score": 10, "replies": []}, {"body": "ARKG or ARKQ but I own all and keep buying.", "score": 7, "replies": [{"body": "You own every ark etf? Is it evenly distributed?", "score": 2, "replies": [{"body": "Not really, but among the “disruptive innovations” yes it is diversified.", "score": 2, "replies": []}]}]}, {"body": "Arkk seems to be the best one", "score": 4, "replies": []}, {"body": "ARKG this particular week because of the CRISPR news. Any other week I buy them all evenly.", "score": 3, "replies": [{"body": "Priced in already bro", "score": 2, "replies": [{"body": "Yeah fair.", "score": 1, "replies": []}]}, {"body": "What's the crispr news?", "score": 1, "replies": [{"body": "https://www.sciencemag.org/news/2020/12/crispr-and-another-genetic-strategy-fix-cell-defects-two-common-blood-disorders", "score": 1, "replies": []}]}]}, {"body": "Purchased ARKK last week and going to add ARKG either this upcoming week or the following week. Looking forward to having both of them.", "score": 2, "replies": []}, {"body": "haha, so its pretty even from everyone's posts....i know arkk has done the best but wondering if that will be the best with vaccines coming out", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "thanks for the very thorough and explained response....i think i am leaning to ARKK and ARKG...", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not if you’re going for diversification", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "yea", "score": 1, "replies": []}]}, {"body": "I have ARKG, ARKK & PRNT", "score": 0, "replies": []}, {"body": "My pick would be ARKW because I am familiar with software companies but not as much with genomics.", "score": 1, "replies": []}, {"body": "ARKK + ARKF", "score": 1, "replies": [{"body": "can you pls explain why these as opposed to the others, like ARKG?", "score": 1, "replies": [{"body": "I don’t know much about genomics, CRISPR, Targeted Therapeutics, Bioinformatics, etc\n\nMy understanding is that ARKK is the best and all-rounder ARK ETF\n\n35.5% of AKK is invested in Healthcare. \n\nhttps://i.imgur.com/Shu8hhB.jpg\n\nI do follow & understand FinTech & e-commerce, hence my investment in AKF", "score": 1, "replies": []}]}]}, {"body": "I like ARKF and ARKG", "score": 1, "replies": [{"body": "i just looked at arkf. I own some square, se and baba already so maybe i will pass on that one. \n\ni know much less about science, so maybe i will get arkg and let cathy wood do the work for me. \n\nAlso, get arkk for general exposure?", "score": 1, "replies": []}, {"body": "Same here. ARKF is the youngest fund too.", "score": 1, "replies": []}]}, {"body": "Ark seems really good, too bad I can't invest from europe due to regulations...", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "k80pxf", "created_utc": 1607284490.0, "score": 22, "upvote_ratio": 0.81, "num_comments": 18, "comments": [{"body": "Consumers are just itching to get out, go shopping, travel, eat, spend money. It's going to be a good year.", "score": 28, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "People are optimistic. The market does not follow the economy as we've seen.", "score": 8, "replies": [{"body": "Indeed, i sure hope that everything goes as fast as possible...", "score": 1, "replies": [{"body": "I have no idea whether the market is going up or down though, just like everyone else.  I gave up timing the market long ago.", "score": 2, "replies": []}]}]}]}]}, {"body": "The market has proven to be an optimistic self fulfilling YOLO in 2020. Unless we start an actual war with Russia, this train is staying on the tracks. \n\nSource: some guy", "score": 19, "replies": [{"body": "Trump still has a couple weeks, and he's putting his toadies in all the top positions.  Give him time.", "score": -2, "replies": []}]}, {"body": "Big reason stock market is doing so well is interest rates are so low its pointless putting your money into anything else. The returns are so bad what's the point?", "score": 9, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "US and Canada have both said rates won't be going up anytime soon as a way to keep the economy stimulated. As long as rates stay this low, this market will continue to go up. This bubble might take another few years to pop with what they've done during this pandemic. In fact even before the pandemic the markets were soaring because they kept lowering rates. There's been a housing bubble for years and rates keep dropping. No end in site", "score": 5, "replies": [{"body": "True", "score": 2, "replies": []}, {"body": "Long-term rates are already starting to rise along with inflation expectations. That’s reflected in the recent outperformance by energy and materials stocks. If inflation spikes, multiples will decline significantly, with expensive growth stocks falling the most.", "score": 1, "replies": []}]}, {"body": "Interest rates are at minimum going to stay 0-0.25 until 2023 according to Jpow, so I wouldn’t be holding bonds or t bills with such abysmal returns. In fact because of inflation your real return on your money is negative until rates rise past inflation which is on average 1.6-2%. Stocks are the place to be right now because TINA.", "score": 3, "replies": []}]}]}, {"body": "Depends more on covid-19 deaths and gov't response in terms of controlling it.\n\nExtreme down side is more death this year than last year.  An actual hard quarantine, with actual public rebellion.\n\nPeople decide not to vaccinate. Or distribution is disrupted.  Or self promoted numbers are too optimistic.", "score": 5, "replies": []}, {"body": "Canary in the coal for me is bad job data, no one is holding long position no more and are just straight up trading this market. Plus big money been out or missed this market", "score": 9, "replies": []}, {"body": "I think as long as the government doesn’t shoot itself in the foot the stock market will be fine...if they make it crash, it will do what it did in March.", "score": 3, "replies": []}, {"body": "My neighbor said stock crash in March 2021", "score": 5, "replies": [{"body": "Me dog said yolo in 2021", "score": 16, "replies": []}]}, {"body": "Lots of investors will have a s#itty summer.  #21Crash", "score": 0, "replies": []}]}
{"title": "Market Crash", "selftext": "[deleted]", "id": "k8338l", "created_utc": 1607292067.0, "score": 0, "upvote_ratio": 0.18, "num_comments": 24, "comments": [{"body": "Yes April 1, 2021. Short everything. I'm from the future.", "score": 19, "replies": [{"body": "We should listen to this guy everyone. He is a wizard!", "score": 5, "replies": []}, {"body": "We shall see tomorrow.", "score": 2, "replies": []}, {"body": "LIAR!", "score": 2, "replies": [{"body": "April fool's! (Yeah, dumb I know).", "score": 1, "replies": []}]}, {"body": "!remindme April 1, 2021", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2021-04-01 00:00:00 UTC**](http://www.wolframalpha.com/input/?i=2021-04-01%2000:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/k8338l/market_crash/gevsw3d/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fk8338l%2Fmarket_crash%2Fgevsw3d%2F%5D%0A%0ARemindMe%21%202021-04-01%2000%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20k8338l)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "What makes you think it will crash in 2021?", "score": 7, "replies": [{"body": "We're in the recession now, there's a democrat taking over the white house in a month and a vaccine will be widely available by summer. My friend this is the time to buy and hold", "score": 7, "replies": [{"body": "Right? There is also alot of uncertainty overall to which anything could happen, best to continue regularly buying and ride the wave rather than sell off everything and miss any potential growth that will come should a crash not happen", "score": 2, "replies": []}]}, {"body": "Rona pt2?", "score": 0, "replies": [{"body": "Are we not already in rona part 2? This time we just have the benefit of potential vaccine options", "score": 5, "replies": []}]}]}, {"body": "When interest rates go up.", "score": 6, "replies": []}, {"body": "You only need to keep about 10-30% of your balance in cash if you think a crash will happen, this is enough to let you effectively average down and be better off when it does recover some. You'll be made \"whole\" again with less of a rise in the underlying stocks faster than those who had $0 available to average down with. Get it?\n\nYou can also buy put options for  \"when\" you think the market is going to crash. You seem to think it's going to happen because of rising covid concerns over the next few months. So why not buy some Put options going out till like April-June to cover your shares in case?", "score": 5, "replies": []}, {"body": "why is it gonna crash? based on what?", "score": 2, "replies": [{"body": "Based on the fact that some TV guru keeps saying “the market will crash this year” every year since 2010... \nit’s already like a normal thing to hear. \n\nThis is the mentality of the financially uneducated man... nothing is going to crash. Markets go up and down.", "score": 3, "replies": [{"body": "Markets. They go up and down. That’s how they work.", "score": 4, "replies": []}]}, {"body": "We might have another lockdown because of covid so idk.", "score": -6, "replies": [{"body": "You do know there’s a vaccine around the corner rite? That’s over 50% good. I’ll take those odds.", "score": 2, "replies": []}]}]}, {"body": "The people who preach recessions are coming are the ones who make money off of it. Lot of money made in fear.", "score": 2, "replies": []}, {"body": "Can we stop the market crash 2021 talk. 5th thread today. Stop seeking bias confirmation.", "score": 2, "replies": []}, {"body": "No its not going to you boomer.", "score": 1, "replies": []}]}
{"title": "What Delta & DTE would you choose to hedge the systematic risk(by buying Deep OTM SPY/QQQ Put)?", "selftext": "I am attracted to taleb fat tail risk hedging. Just selling 1 more contract per month and it can cover the insurance cost. Simple and useful. I may take loss for several trades and that's acceptable. But if all contracts get assigned, I would probably be wiped out. Therefore, an insurance of systematic risk is helpful I guess.\n\nThe thing is, what delta & DTE should I choose? What's the exit time(roll or let it expire)?\n\n**My current thoughts**\n\nBuy 2 month 0.1 Delta OTM Monthly Put (SPY/QQQ)\n\nLet it expire and open a new.\n\nThe position size is 0.1% of BP. (0.5% of net liquid value)\n\nIf it rise 1000% I would rebalance to reduce the short position.\n\nIn 2020 March, this can rise 10000%(without rebalance), which is 50% of my net liquid value.\n\n&#x200B;\n\nAny advice on optimizing the strategy?\n\nPosting here cuz seller would get higher drawdown than buyer typically so I think this topic suits here (Espicially for people constantly using more than 60% of buying power).\n\n&#x200B;\n\nYou guys probably already knew it so I wouldn't post too much reference.\n\n[https://thefelderreport.com/2016/08/15/worried-about-a-stock-market-crash-heres-how-you-can-tail-hedge-your-portfolio/](https://thefelderreport.com/2016/08/15/worried-about-a-stock-market-crash-heres-how-you-can-tail-hedge-your-portfolio/)\n\n[https://blog.thinknewfound.com/2020/06/tail-hedging/](https://blog.thinknewfound.com/2020/06/tail-hedging/)\n\n[https://boards.fool.com/voti-34649989.aspx?sort=whole#34650260](https://boards.fool.com/voti-34649989.aspx?sort=whole#34650260)", "id": "k826zk", "created_utc": 1607289131.0, "score": 14, "upvote_ratio": 0.81, "num_comments": 23, "comments": [{"body": "I think there's a new method where you buy a ladder of like 4 different expirations, but I don't remember the specifics. Someone knows what im talking about, think it's the option alpha doomsday hedge?\n\nBut dont quote me on that", "score": 6, "replies": [{"body": "Just stumbled upon that idea and will prob deploy. My first attempt at a portfolio hedge.", "score": 2, "replies": []}, {"body": "You are correct, we created this late last year. Here's an extended review that goes over it in detail for anyone interested: [https://www.youtube.com/watch?v=-luY8MHgYW0](https://www.youtube.com/watch?v=-luY8MHgYW0)", "score": 3, "replies": [{"body": "I watch the video. It's like ratio spread. I would take into consideration!", "score": 2, "replies": [{"body": "The idea is that the \"true\" cost of the hedge is really the 1% allocated to the OTM 10 deltas, since most of the time if you can get the ratio/ladder spread for a net credit, it will expire worthless reducing the overall portfolio drag. The trade is not foolproof, however. There is the potential to lose money if the drawdown is not severe enough, but that is a small price to pay, in my opinion, for the convexity protection.", "score": 1, "replies": [{"body": "When would you roll and rebalance to take profit? Or you just keep holding until expiration?(If ITM then execute)", "score": 1, "replies": [{"body": "This strategy doesn't get rolled in the traditional sense. It's a time-layered approach. You keep adding to the position as the market vol environment allows (VIX remains low). If there is no vol spike and/or market crash, you just hold until expiration. Best case scenario, the ladder expires for a small profit and the OTM calls expire worthless. In the event of a vol spike, it's really up to your discretion. Ultimately, when your portfolio is \"sufficiently hedged,\" you take profits. For us in March, that point was decided when the hedge had taken off enough risk that we could get back to net zero if the market reversed within the expiration cycles we were holding. Your mileage may vary.", "score": 2, "replies": [{"body": "Yeah I am discussing about the latter part. It seems that I have to make my own decision. Thanks anyway.", "score": 0, "replies": []}]}]}]}]}, {"body": "How well did this work in March?", "score": 2, "replies": [{"body": "At the worst point we were only down a couple percent while the market was down 30%. We actually took profits on the hedge off too early, but hindsight is 20/20. Had we waited until the absolute bottom, portfolio would have been net positive on the year.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "That is a good read. Thanks!", "score": 2, "replies": []}, {"body": "I agree, trying to go big and play it safe at the same time doesn't really make sense.  It's like taking two steps forward then taking a step back to buy insurance.  Just take more reasonable steps forward instead\n\nAnother strategy I see is people buying a large amount of something highly uncorrelated like TLT so if their main investment crashes they have something that doesn't crash.   \n But that just means if one is doing well, the other is not.  Do I want to own TLT long term?  No", "score": 2, "replies": []}]}, {"body": "You can get ancillary plays much cheaper than direct hedges but still parallel your long positions for the most part to the inverse.\n\nFor example, you want to hedge for a catastrophic event, spy puts are obviously expensive, but alternatively TLT calls, UUP calls, gold? Calls could be cheap. This wouldn’t hedge directly to every situation causing the SPY to crash, but in 90% of situations UUP or TLT would rip if SPY crashed. You don’t hedge against the event of a total loss in confidence in electronic wealth, or a total loss in confidence of US backed securities, but you’re protected against events that Would cause a recessionary cycle in the IS economy, which would be the most likely scenerio let’s be honest.\n\nGold is question marked because it’s behaving a bit erratically, gold calls are expensive, and I don’t think it’s a better hedge than UUP calls for example. Gold is kind of a sharp blade in my opinion, where it’s better than UUP after a collapse, but just as worthless as UUP after an apocalyptic collapse. Best insurance in that case is ammo, MRE’s and water purification.\n\nAt any rate, point is you don’t have to directly hedge, you can find bargains that hedge 90% for a fraction of the price.", "score": 3, "replies": []}, {"body": "Depends on how much insurance you want. I like to run hypothetical scenarios to see how my portfolio reacts with different tail risk insurance trades added to it. Stress testing your portfolio in this way gives you a better idea of what kind of losses you could be looking at, and where you'd like insurance.", "score": 2, "replies": [{"body": "I had vxx calls that tail hedged my portfolio in March", "score": 2, "replies": [{"body": "Can you elaborate? How did you figure out the amount of calls to buy, delta, and what % of the drawdown did it offset? I’m looking to start this hedge myself.", "score": 1, "replies": [{"body": "I was actually delta negative overall and my portfolio increased in March, around 220%. I was extremely bearish and had my first vxx call hedge on in December, which saw a 90% drawdown before increasing exponentially during the crash. I added more negative delta in January and February. \n\nThe amount you want to buy depends on your outlook and strategy. The simplest way is to look at the beta weighted delta of your portfolio, and determine how much you want to balance it. Alternatively you can look at how a 10% correction would affect your portfolio. Buy however much insurance you want. I basically overinsured my portfolio, and I like vix hedging when it is way below its mean.", "score": 1, "replies": []}]}]}, {"body": "Yeah backtesting it is a good idea.", "score": 2, "replies": []}]}, {"body": "That one fellow's suggestion on TMF is quite good:\n\n> \"Options for Volatile Markets\" by Lehman and McMillan is worth buying for Chapter 9 alone \"Volatility and Volatility Derivatives\". IMO, the rest of the book is mostly standard stuff about protective puts, spreads etc, that you've seen elsewhere.\n\nThat chapter is definitely worth reading, and it discusses hedging with VIX calls instead of SPX puts. You could also partially fund buying the VIX calls by selling VIX puts since there is a floor in the VIX. Just be aware that VIX options track VIX futures (/VX) and not the VIX itself.", "score": 2, "replies": [{"body": "I think puts could be more delta neutral and simple? The purpose is to help me through the assignment instead of pursuing profits and I don't want to spend too much effort on it.", "score": 2, "replies": [{"body": "I'd recommend backtesting the strategies. Compare hedging with VIX calls vs. SPX (or SPY/QQQ) puts and see which one either loses you less money as a hedge, or turns a greater profit when the market tanks. You can buy EOD option price data for pretty cheap.\n\nOnce you figure out which one works better, it won't take much effort to place the hedge.", "score": 2, "replies": [{"body": "What data sources do you use for back testing? Anything not super expensive?", "score": 2, "replies": [{"body": "Depending on what you want it's actually not that expensive. The finer the time resolution the more expensive the data will be. EOD data is pretty cheap, though.\n\n[IVolatility](https://www.ivolatility.com) has EOD options price data for $0.15 a day. So if you bought data for VIX and SPX options, and assuming 252 trading days in a year, that's $75.60. Pretty affordable.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Crash and Burn", "selftext": "[removed]", "id": "k7xicr", "created_utc": 1607274499.0, "score": 5, "upvote_ratio": 0.69, "num_comments": 26, "comments": [{"body": "Yeah we all saw that two weeks ago and already lost everything on SPY weeklies but it’s not like I’m bitter or anything.", "score": 5, "replies": [{"body": "Ditto lol I'm not rich enough to stay liquid as long as this market has been irrational", "score": 4, "replies": [{"body": "I just want 1 bonus game! Is that too much to ask? I’ve pumped so much damn money into this machine the least it can do is tease me.", "score": 2, "replies": []}]}]}, {"body": "I learned not to bet against the market. Too difficult to time. If you do want to, just dump a couple hundred in it. That way when you’re wrong like 5x in a row, you’ll only lose $1000. Then when you’re right that one time you can maybe make the $1000 back. \n\nTLDR: Stonks go up", "score": 2, "replies": [{"body": "Just to clarify - the position is 2022 calls on inverse etfs to give some time for the bubble to burst.", "score": 3, "replies": [{"body": "Oh ok well that’s a non retarded way to play it then. But hopefully they’re not 3x ETFs", "score": 2, "replies": [{"body": "Oh but they are.", "score": 2, "replies": [{"body": "Not a good idea for a number of reasons. 3x leveraged ETF’s are designed primarily for day trading/swing trading. If you want to mess with options, best to stick to a non leveraged etf. In addition, puts generally yield a higher return than calls. So even if you were right, and didn’t get IV crushed or burned by theta, it would be a smarter idea to buy puts on the 3x ETF rather than calls on the inverse. Between QQQ, TQQQ, and SQQQ, the smartest play would be to buy puts on QQQ. You shouldn’t really mess with options on the 3x ETFs", "score": 1, "replies": []}]}]}, {"body": "So basically you want to get fucked by IV crush/beta slippage/ and theta decay? Bravo autist.", "score": 3, "replies": [{"body": "Lol I don’t think you’re following the whole “Crash” dynamic of this... if things crash none of the above matters even slightly.", "score": 1, "replies": []}]}]}]}, {"body": "Just post every Monday until it happens and you will be the smartest man in the room", "score": 2, "replies": []}, {"body": "The bear thesis is done. Large cap companies do just fine in this sort of environment. Retail investors who think the economy moves based upon the demand side rather than supply side are so smooth brained it hurts. The only real catalyst to the down side is if the Dems win the Georgie senate run offs in January which would give them all 3 branches of Gov. Or perhaps if COVID somehow mutates and starts killing 5% of infected people with a more normal distribution of ages not just the elderly. Other than that pls explain what the downside catalysts are.", "score": 3, "replies": [{"body": "lol which three branches of gov would the dems have boss?", "score": 2, "replies": [{"body": "Yeah I meant Congress senate and executive my bad... but if they get the senate and expand the Supreme Court there is a fair argument to be made that they would in fact have all 3 branches.", "score": 1, "replies": []}, {"body": "Who knew Tommy Tubberville was a /wsb autist?", "score": 1, "replies": []}]}, {"body": "Mitch McConnells death and a democratic Georgia senate will be the catalyst.", "score": 1, "replies": [{"body": "That is an absolutely fair take. You could very well be right. I think the Republicans will win both run off races, but obviously it is going to be so so close. It is probably true that the markets are brushing off this possibility way too much. As if a little more stimulus would be worth 35% corporate tax rates, higher investment taxes, etc. the additional gov spending would in no way compensate for all of the economic headwinds that they would pass into law.", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/GH2402 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What you’re basically going to do is put your foot down and say “right now the economy ends” do you really feel you’ve done enough research to accurately Time the peak? If not then wait for real news to act on and see if investor sentiment shifts. In the long term you may be right but in the short term buyer sentiment will remain the same and for the most part the market will move upwards, making your position cheaper. So why not wait to time it and buy lower", "score": 1, "replies": [{"body": "My position is basically a hedge with huge upside potential. I have plenty of personal investments that would suffer if this actually happened and I have no intentions of selling them but if this does happen then I’ll take gains on this position that can then be reinvested into the market at the current lows. With that being said it’s a bet like anything else and I’m not putting anything into it I wouldn’t be willing to lose.", "score": 1, "replies": []}]}, {"body": "We’ll find out end of the week if there is no stimulus gg we’re taking as one cannot be approved until Biden’s is in office", "score": 1, "replies": []}, {"body": "I think it’s a lot harder to be a bear. Bulls are right like 95% of the time they feel like geniuses because even the worst of the bulls make money if they’re not yoloing obviously. But even in a bear market the winners are who keep buying with dca", "score": 1, "replies": []}, {"body": "You just watched the movie and now ya’ll full 🌈🐻 yolo mode is what happened, wallstreet will just suck you up and shitz ya’ll over the place", "score": 1, "replies": []}, {"body": "I personally believe we are seeing one of the biggest pump and dumps of all time. Apart from my index fund and a few positions in growth industries I'm going short on everything else so if the market tanks overall I'm not screwed.", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "I’d use the sand wedge here, not the driver. Make a brief, small play and try to catch a December tax loss harvesting selloff. Promise yourself you’ll get away from this idea if this play fails. \n\nOtherwise, you’ll get well into 2021, hoping a crash allows you to get back to break even, so you can exit this shit. Then the crash will happen and you’ll be like “fuck yeah this is the BIG ONE I KNEW WAS COMING.” So you’ll hold, hoping for monumental gainz. The dip will be bought, and you’ll be right back to fucked, but far more depressed that you got greedy. Then you’ll sell on the next minor dip for a 70% loss on this trade.", "score": 1, "replies": []}]}
{"title": "BlackRock Inc. Sells 2,591,327 Shares of GameStop Corp. (NYSE:GME) 12/6/2020 - My 1/15 $30C are gonna be dead :(", "selftext": "[removed]", "id": "k819uo", "created_utc": 1607286246.0, "score": 6, "upvote_ratio": 0.65, "num_comments": 22, "comments": [{"body": "This was back when it firstly hit 15+, all institutions have been trimming, stop posting old info you retarded fuck", "score": 9, "replies": []}, {"body": "This guy must either be from Melvin capital or he has no business trading options...13F filings are released 45 days after the quarter ends, so in mid October for Q3. This is old and blackrock selling part of their stake could be for a lot of different reasons...equities have popped off in Q3 so they might have needed to cut their equity positions and buy bonds to rebalance their portfolios.\n\nTHIS IS NOT EVEN NEWS! HOLD THE LINE!!!", "score": 5, "replies": []}, {"body": "Did you even read that article, or do you even understand how quarters work...? This also isn’t a shock to anyone except maybe you, even if it happened recently (which in terms of how fast things change in the stock market, it didn’t). Blackrock has been decreasing its holdings in the company since 2019. \n\nNice job keeping up.", "score": 8, "replies": [{"body": "LOL you actually read it? /all normie?", "score": 1, "replies": [{"body": "I forgot this is WSB and the majority of you retards don’t bother researching or understanding what you’re doing. \n\nBlackrock has been dumping GME for 2 years now. That’s something you would have known had you bothered doing any DD before buying those calls lmao.", "score": 1, "replies": [{"body": "Go back to r/investing bud", "score": -7, "replies": [{"body": "If you don’t like being called a retard you shouldn’t post your dumbass plays on a sub that constantly insults people lol", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm retarded what does this mean‽", "score": 3, "replies": [{"body": "It means OP is retarded, didn't read the autogenerated article . They decreased their shares __during__ the quarter, they're not selling them monday at open.\nThose intraday bearish pushes everyone here noted? Yeah they probably were a big part of that.\n\nGME 329 Shares at 17.02$", "score": 7, "replies": []}, {"body": "Well, at least 2 things.\n\n- BlackRock selling those shares might signal to other people that GME isn't that good of an investment\n\n- BlackRock selling that many shares puts some downward pressure on the stock price.", "score": 6, "replies": [{"body": "Or perhaps they are simply taking some profits since we've quadrupled since earlier this year? Lol", "score": 5, "replies": []}]}, {"body": "Partys prob over. Institution are unloading", "score": 6, "replies": [{"body": "Blackrock has been unloading GME shares for 2 years. This isn’t really news.", "score": 6, "replies": []}]}, {"body": "It means your mommy dropped you on your head when you were a baby", "score": 3, "replies": []}]}, {"body": "I had no idea robinhood sold options 200% OTM.", "score": 2, "replies": [{"body": "Why wouldn’t they? It’s free money from retards that have no idea what they’re doing.", "score": 1, "replies": []}]}, {"body": "Lmao the bagholders are gonna be real this week. I wanna see that loss porn you sick fucks..", "score": 2, "replies": []}, {"body": "Alright time to buy", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Fuck yeah! Gotta follow those retards", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Good for the call I sold. Bad for my 100 shares... :(", "score": 1, "replies": []}]}, {"body": "Isn’t this from the September filing? The date is the date of the article ffs.", "score": 1, "replies": []}]}
