{"title": "Selling deep ITM covered calls on TSLA/NVDA for 4% monthly returns?", "selftext": "YouTube recommended this guy to me who says he makes 4% every month selling deep ITM covered calls on NVDA and TSLA. He is selling somewhere around the .80 delta calls to extract the extrinsic value from the options and planning to take assignment. He says he makes around 48%+ annualized returns doing this (4% per month \\* 12 months), which I'm highly skeptical about. Here is the [NVDA video](https://www.youtube.com/watch?v=uTDM6Be0KeA) and the [TSLA video](https://www.youtube.com/watch?v=W2RuTls6AQA) I'm referring to.\n\nHere's a current example I came up with for TSLA using this method ([view on OptionsProfitCalculator here](http://opcalc.com/QIa)):\n\n* Buy 100 shares of TSLA at $196.48.\n* Sell the 3/31 170C for $33.25 (\\~32 DTE).\n* Total cost = $19,648 - $3,325 = $16,323 (breakeven at $163.23).\n* Your shares get called away at $170 each, for a gain of $677 (4.15% return on the $16,323 of capital).\n* Rinse and repeat monthly.\n\nI know there's no such thing as a free lunch, so I'm trying to figure out what the trade-offs are.\n\nHere are the downsides I can think of:\n\n* The stock could drop below your breakeven causing you to take an unrealized loss.\n* Wash sale rule could cause tax implications if you rebuy shares that are called away without waiting 31 days (i.e. must pay taxes on the full premium received, but can't write off the \"loss\" of the shares).\n* There is no upside potential if the stock moves higher.\n\nAnd the upsides:\n\n* Lower risk to the downside on the trade (compared to selling OTM covered calls).\n* If the stock does drop significantly, your cost-basis/breakeven has been lowered considerably (down to $163.23 from $196.48).\n\nIt seems like this is effectively the same as selling a cash-secured put (e.g. selling the 3/31 170P for $5.60), except this strategy returns about 20% more premium.\n\nThis is only possible due to the high volatility of these two stocks, right? A few other tickers I've checked don't return anywhere near 4% premium monthly using this strategy.\n\nWhat do you guys think about this? Is there anything else I'm missing here?", "id": "11d5d8s", "created_utc": 1677481362.0, "score": 69, "upvote_ratio": 0.86, "num_comments": 66, "comments": [{"body": "This is completely equivalent to a cash secured put. You are literally reinventing the wheel.", "score": 111, "replies": [{"body": "I thought this was the case. Seems like it's slightly better than the CSP at the moment considering the extrinsic value is currently about 20% higher on the call side.", "score": 16, "replies": [{"body": "With a CSP, your collateral earns the fed funds rate at any competent broker (fidelity, Schwab, etc). So you can stack that(~4.5% annually rn) on its premium", "score": 21, "replies": [{"body": "Does collateral on credit spreads at fidelity (iron condors, verticals,etc) also earn interest?", "score": 3, "replies": [{"body": "As far as I know fidelity gives you their money market interest rate on all cash in the account through cash sweep.\n\nIf you’re asking if you can sell a put credit spread and get the interest rate on the premium, the answer is yes as long as it stays in cash. If you’re asking if your long put will pay you interest, the answer is no.", "score": 3, "replies": []}]}]}, {"body": "the extrinsic value of the call and the put are the same. the only reason the call appears more expensive is because of the implied positive interest rate", "score": 1, "replies": []}]}, {"body": "I am no expert but wouldn’t all of these assignments be wash sales as well?  So they wouldn’t offset profits from the covered calls.  If so this guy is going to get slaughtered come tax time. \n\nAlso that would make this considerably worse than selling CSPs", "score": 5, "replies": [{"body": "People really need to learn more about how wash sales work, if it triggers your cost basis is updated for your future position so when it sells you are back to even", "score": 7, "replies": [{"body": "Ah ok, thanks for the explanation.", "score": 2, "replies": []}]}, {"body": "Wash sales are meaningless as long as you are out of the stock by the end of the year and you stay out for 30 days.\n\nFWIW, the IRS handles short sales differently.  Short positions must be closed 2 business days before the end of the year to clear wash sales for the current year.", "score": 0, "replies": []}]}]}, {"body": "If it works, you make 4% a month.  Projecting that out 12 months is wishful thinking.\r  \n\r  \nDuring the October series last year, TSLA fell about 90 points.  Assuming that returned similar numbers as your example, it would take 3 successful cycles to make up that point loss.  But could you?\r  \n\r  \nSuppose you bought at $300 and sold the $275 CC for $37.  It drops to $210. Your short call expires.  Cost basis is $263 ($53 loss).  Now you're either going to have to write a lower strike that locks in a loss or you're going to have to sell an OTM CC with a further out expiration in order to get enough premium to break even (60 days, 90 days?).  How many months does that take? This all works until it doesn't.\r  \n\r  \nCCs and CSPs of the same series are synthetically equivalent.  Why do this in two transactions (stock + CC) when you can do it in one (CSP)?  Fewer commissions, fewer fees, less bid-ask slippage.\r  \n\r  \nWash sales are meaningless as long as you are out of the stock by the end of the year and you stay out for 30 days.\r  \n\r  \nIf you are fine with owning the stock at the net cost (stock price less premium received for the CC), go for it.  But risking money because the premium is high isn't the best choice.", "score": 25, "replies": [{"body": "I’ve been doing this for a while on other stocks and this is why you do it weekly. It really doesn’t work over longer time frames. And it requires active management, if the option goes OTM you immediately roll out and down.", "score": 10, "replies": [{"body": "Same, albeit with smaller amounts. I consistently do it with AMD and AAPL. My AAPL did get called so then I used that cash to do cash secured puts and eventually re accumulate 100 more Apple shares. \n\nNow in 2021 I did get burned by $SPCE. The price dropped and I got greedy and sold calls below my cost basis. One day the price skyrocketed and it got called away but below my cost basis so I lost money on the entire position", "score": 1, "replies": []}]}, {"body": "Eats into your gains, but you can always buy a put to lock your gains.\n\nUsing rough numbers\n\nTSLA currently $205.26\n\n$180 Call is $32.25\n\n$180 Put is $6.15\n\n\n$(20,526) to purchase\n\n$(615) for the Put\n\n$3,225 for Call\n\n$18,000 if assigned\n\nOnly a 4.7% return annually at that point, but you could play around and actively manage the trade to boost that up, if the stock falls roll the position.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Its 1 example, you can fudge around with different tickets and time periods to get above 5%.\n\nPersonally. I agree, I’d rather do something else for 5%, but it’s not impossible to manage a good return doing it that way.", "score": 2, "replies": [{"body": "A conversion only makes sense if you can lock in a pricing discrepancy.  Market makers use these to lay off the risk to the players while locking in higher yields.  However, it's really tough for retail to achieve this, especially in size.\n\n  \n\nAnd I forgot to mention Pin Risk.  If the underlying is near the strike at expiration, you'll be forced to roll, lowering your return. \n\nIs it really worth your time with the options to get the same return as a CD or Treasury?  This is much ado about nothing.", "score": 1, "replies": [{"body": "If you searched it enough, you could find some that would lock in above 10%.\n\nVZ right now 4/6\n\n38.83 per share, 35 strike call/put, 4.18 spread on those.  Nets you $35.50 on $3,905.  Ends up being about 8.7% annualized.\n\nThere are always plays, the challenge is analyzing enough of them, and having the capital to execute.\n\n8.7% might not be earth shattering, but 8.7% with zero risk is pretty fucking sweet.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, it’s SLIGHTLY off 8.7%… I did quick math\n\n35.5 / 3,905 * (365 / 38) which is roughly 8.7%.\n\nAnd yes… that risk is 0 risk because the put covers your losses if the stock falls below the strike.", "score": 1, "replies": [{"body": "I went to edit my comment and inadvertently deleted it.  So once again...\r  \n\r  \nI would suggest that if you want accuracy, post the actual real time quotes for your position, using the bid for selling and asks for buying.  You're not going to get 8.7% for a Conversion.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Is that not just a collar at that point?", "score": 1, "replies": [{"body": "If the strikes and expiration are the same, technically, it's a Conversion arbitrage and it merely locks in the risk free rate, ignoring slippage.  It's nonsensical to do a collar to capture carry cost.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Lemme guess, you don’t have the account size to do this.", "score": -26, "replies": []}]}, {"body": "If you buy the shares for $196.48 and sell the 31Mar23 170C for $33.25 and share price is below $170 at expiration then technically your cost basis hasn't dropped.  You will have collected $33.25 on one trade and your account will still show a cost basis of what you paid for the stock, which, in this example, would be $196.48.\n\nFor tsla to drop below $170 at expiration on 31mar23 it would require a 13% drop in value, which is nothing for tsla.  Just look at price change from 2dec22 to 4jan23 to 2feb23.  It went from $194 down to $108 and then back at $188. So it drop 44% from 2dec22 to 3jan23 and then rose almost 75% from 3jan23 to 2feb23.\n\nNever sell covered calls on stocks that you don't want to own.", "score": 9, "replies": [{"body": "Last sentence: call or puts?", "score": 3, "replies": [{"body": "Calls...\n\nOP post implies that reason for buying the shares and selling covered calls is to make money off the premium (with the expectation that the shares will get called away).\n\nIf the share price drops below the strike, then the shares do not get called away and you will own them. This is why I say never sell covered calls unless you are ok with owning them.", "score": 3, "replies": [{"body": "Thanks i only heard this for puts un case of assignment", "score": 2, "replies": []}]}]}]}, {"body": "The problem I see is you are taking on the downside risk of it dropping 50% but limiting your upside to 4%.  If you own Tesla you are taking on a good amount of risk you want the chance for a large amount of profit too.", "score": 7, "replies": []}, {"body": "\"Heads, I win. Tails, I lower my cost basis.\"", "score": 3, "replies": []}, {"body": "This works great until Tesla falls to 140 or so.", "score": 4, "replies": []}, {"body": "Consider this.   Instead of doing it monthly.   Do it weekly but not on Monday.  Write the call option that pays you around 1.8-2.1%.   Stocks at 10$ per share.   Write the 11$ call.  They are out there.  Mostly on the stocks that have just had big moves.   This way you’re only on a 3 day period and there will be less time for a major move.   Obviously don’t do this during earnings week.    Do the math on the weekly’s.    You can always dump the stock if it’s dropping and leave yourself naked.   But you’d only be doing that with maybe a day or a half day left on the contract.    Compound 1.8% weekly for a year and even if the stock goes up and you get called out.    Fine.  More profit.   🤑.     Stocks Im doing this with.   RIVN-BHC-PLTR-UBER-BBBY (I know but because I’d the action on BBBY the premiums are juicy!  💰.    DKNG-LMND.   \n\nGL GL🍀🍀", "score": 6, "replies": [{"body": "How long have you been doing it? What are you doing if one of those stocks plummet and you're holding the stock? Those are risky tickers", "score": 1, "replies": [{"body": "I’ve been doing this as a partial strategy in my portfolio for well over a year now.   Along with calls on SPXS and SPXL when the S&P does it’s reversals.   I was an automotive designer for 22 years and decided to stay home when they wanted me back in the office.   I was sick of working for someone else so now I do my own thing.   So avoiding the plummet is the thing right!!   If it starts to really fall for some breaking news reason.   I’ll just sell it and leave myself naked knowing it probably won’t recover above my call strike in a day or two.   That’s also why I write the option on a Tuesday or Wednesday and let it expire on Friday.    Avoiding earnings week or earnings with similar stocks.    Or I’ll just not write the option during earnings.    Example.    I have 1500 shares of RIVN @ 16.56    I didn’t write an option this week because they report today after hours.   If anything I’ll only write it for maybe 5 contracts since the premium is juicy.   Or buy a small put to protect myself on the down side.   I’ll probably write the 22$ call tomorrow if there is a run up before close.", "score": 2, "replies": []}]}]}, {"body": "Another thing to consider is whether or not you’re using a cash account or margin account. While the return may look better using a cash account, it will look much different using a margin account. \n\nJust take a look at the margin requirements for both. The premium for the put is smaller than the premium collected for the covered call, but the margin requirement will be smaller as well. Return on margin capital will be very similar.", "score": 2, "replies": [{"body": "The put premium is smaller because of the carry cost.  But with the CSP, your cash earns interest, assuming that you have a decent broker.  It's a wash.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "> It doesnt work unless you have an extremely flat stock. It especially wont work on TSLA or NVDA.\n\nYou have that exactly backwards. It *only* works for stocks that have overpriced volatility.\n\n> Say you own jan 2025 NVDA 150 calls. You sell March 2023 NVDA 210 calls when NVDA was 185. NVDA moves to $230.\n\nThat's not a covered call and it's not ITM, so not even close to what the OP is asking about.", "score": 3, "replies": [{"body": "A diagonal spread is a covered call only on Reddit.  In the real world, not so much :>)", "score": 2, "replies": []}]}]}, {"body": "4% a month is not 48% a year .... it's 1.04\\^12 which is closer to 60% annually.", "score": 2, "replies": [{"body": "Thank you , I was thinking the same thing for a guy pushing a strategy and misses simple math.", "score": 1, "replies": []}]}, {"body": "I like it. I’ll give it a go tomorrow and see how it pans out.", "score": 4, "replies": [{"body": "Update us with your thoughts.", "score": 2, "replies": [{"body": "It’s just math. So if the numbers work out, I’ll run the edge until it dries up.", "score": -2, "replies": [{"body": "It’s not an edge. You could do this with any stock but you run a risk of the market dropping. You’re only protection is if the market goes long you won’t lose anything.", "score": 4, "replies": [{"body": "No you can’t there may not be enough premium to justify it.", "score": -2, "replies": []}]}]}]}]}, {"body": "I actually really like this play. There will ALWAYS be someone better for the market to go up which is very unlikely for this market right now", "score": 2, "replies": []}, {"body": "I cringe every time I see \"deep ITM\" and \"sell to open\" in the same sentence.\n\nAnyone who calls themself a \"wealth architect\" might as well have \"scammer\" tatooed to their forehead.\n\nThe trade scheme boils down to selling overpriced volatility. That's standard credit trading mechanics and can be accomplished any number of ways, most of which, IMO, have better risk/reward and other characteristics. For example, you could obtain a similar rate of return by rolling OTM short puts, only the puts should have less opportunity cost.\n\n> Wash sale rule could cause tax implications if you rebuy shares that are called away without waiting 31 days (i.e. must pay taxes on the full premium received, but can't write off the \"loss\" of the shares).\n\nAs long as you close the washing trade in the same tax year, this is a non-issue.\n\n> There is no upside potential if the stock moves higher.\n\nYes, but that's true of all credit trading and/or delta-neutral strategies for selling overpriced vol. So not really a negative.\n\n> Lower risk to the downside on the trade (compared to selling OTM covered calls).\n\nI understand why you think that, but it's basically not true. They both have the same downside risk on the stock side. In the ITM CC case, you got more upfront premium, but at higher risk of assignment with attendant higher loss of potential gains on the shares. In the OTM CC case, you have less upfront premium, with lower risk of assignment and lower potential loss of gains.\n\n> If the stock does drop significantly, your cost-basis/breakeven has been lowered considerably\n\nThat's just a restatement of the previous \"advantage\".\n\nTo me, the biggest negative about the scheme is that it is grossly inefficient of capital. There are more efficient ways to use that amount of capital or better ways to use less capital for the same risk/reward. Like this one: \n\n\nhttps://www.reddit.com/r/options/comments/ulvsck/theta_without_delta_intro_to_vol_trading/", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I think 85 delta is plenty deep. One standard deviation is 68% of outcomes (vs. a normal distribution), so 34 delta either side of 50 would be the line I'd draw. That puts 85 delta one point into the \"deep zone.\"", "score": 2, "replies": []}, {"body": "Good point, so why not use this strategy except at 100 strike? Are the premiums not as good when you go that deep?", "score": 1, "replies": [{"body": "You will approach intrinsic value the further ITM you go. Going that deep will get you somewhere around no benefit.", "score": 2, "replies": []}]}]}, {"body": "If he was such an expert he wouldn’t own a trash stock like Tesla.  4% is because volatility is insane on the underlying and that’s because you’re talking about a $20 stock currently priced at roughly $200 and market makers know what the inevitable result will be\n\nWhy retail think that company is anything but a mediocre OEM is baffling to us experts", "score": -7, "replies": [{"body": "Sounds like someone is mad because they shorted Tesla at $120.", "score": 11, "replies": []}, {"body": "I’ll bite lol. I describe myself as a TSLA moderate/realistic bull. Always good to have a discussion to either question or strengthen my belief or position.\n\nWhy do you value the company at $20?", "score": 3, "replies": []}, {"body": "Expert bag holder detected. Keep knowing more than the market bro! We are all super impressed.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Because he’s talking about making 4% per month.    Not per year.   You might have missed that point based on your comparison to the yearly T bill.", "score": 8, "replies": []}]}, {"body": "Easier ways to make 4% in this market.", "score": -2, "replies": [{"body": "Any examples?", "score": 6, "replies": [{"body": "I bought an iBond paying over 9% last year. It only paid that until the 6 month adjustment, but it's paying over 6% now.", "score": 0, "replies": []}]}]}, {"body": "Question: when is a call or put “deep in the money”? Is it like a set amount of strikes away from the underlying price? Or a percentage over or under? Just curious. TIA", "score": 1, "replies": [{"body": "ITM would be any time the options price is below the stock price for a call option.  Stock is $50 and the call is $45 then it is $5 ITM.  \n\n\"Deep\" is not a technical term so is less clear, but generally it is when the option is far ITM.  Using delta can help as the farther ITM the higher the delta amount.  A .75 delta would be far ITM, a ,90 or 1,00 delta would be very deep ITM.", "score": 1, "replies": []}]}, {"body": "I'd rather just sell a program that teaches about selling covered calls. That has netted me 4%/month.\n\n&#x200B;\n\nNot sure if that makes sense or not.", "score": 1, "replies": [{"body": "For how many months tho? I see this alot on here, then turns out it was only 1 or two months lol", "score": 1, "replies": []}]}, {"body": "Just stick with at the money and go in and out of the trade according to whether the market is oversold/overbought. Going super deep ITM on a covered call you have to hold for a year sounds stupid.", "score": 1, "replies": []}, {"body": "Tesla IV in that cycle is around 63, which means a one standard deviation move was about $36 from Friday’s close of 196.48. That call is not “deep itm” by any definition. You are correct that it’s the same as selling the 170 put. Which you might want to do if you have an opinion on the stock, but it’s hardly a free money trade considering that at the start of the year that put would have been in the money by $65.", "score": 1, "replies": []}, {"body": "The only time you should sell itm calls is when the stock is falling hard.", "score": 1, "replies": []}, {"body": "Tesla dropped from 200 to 100 in a month and stayed ~120 for 3 weeks and then recovered to 200 in a few weeks. The emotional that would cause you for $677 is not worth it. Lol.. I am sure most would do something stupid during those down period and lost it. Tesla and NVIDIA are extremely volatile.", "score": 1, "replies": []}, {"body": "I think for the downside you mention (the stock could drop below your breakeven causing you to take an unrealized loss), you may buy a protective put to hedge.", "score": 1, "replies": []}]}
{"title": "S&P 500 rally is a bull trap; bear market will resume in March - MS By Investing.com", "selftext": "", "id": "11db73e", "created_utc": 1677502530.0, "score": 185, "upvote_ratio": 0.81, "num_comments": 76, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|14|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Financial media is trash.", "score": 147, "replies": [{"body": "People behind this definitely swithed to shorts", "score": 17, "replies": []}, {"body": "What about financial advisors?", "score": 5, "replies": [{"body": "If they sell you life insurance, then yes trash.", "score": 8, "replies": []}]}]}, {"body": "Morgan Stanley definitely cares about your financial future. Listen to everything they say. Liquidate all assets into cash and head to the mountains with every can of baked beans at your local Walmart.", "score": 35, "replies": [{"body": "It would be nice to hear the counter bull thesis to support the theory that the majority of companies are undervalued as compared to current and future earnings. Yet instead, you shoot the messenger. I'm pretty sure MS has little to gain by warning people that this may be a bull trap, except maybe some credibility. A rare thing on Wall Street.", "score": 3, "replies": [{"body": "We eat crayons here sir.", "score": 7, "replies": []}]}]}, {"body": "When news and banks saying bear market and time to sell.\n\nIt’s time to BUY", "score": 93, "replies": [{"body": "The other day this page said tsla dropping 20%🤣", "score": 31, "replies": [{"body": "It will. They were just 14 days to early.", "score": 7, "replies": [{"body": "14 weeks*", "score": 2, "replies": [{"body": "28 weeks late", "score": 4, "replies": []}]}]}, {"body": "It did but then it reversed and now it might again.", "score": 1, "replies": []}]}, {"body": "MS is pretty much the only bank that's been consistently sounding the alarm since end of 2021, they were pretty on the mark with their calls\n\nThey called technical bounces pretty well too, called out both the bounce back in October and this year as well\n\nOf course, past performance is no guarantee of future results, etc", "score": 10, "replies": [{"body": "Sooo…..puts?", "score": 4, "replies": []}, {"body": "They were one of two to correctly predict CPI numbers iirc, everyone else gave much more bullish numbers. Idk why ppl say inverse MS when they've been one of the only one's to call the shots right this past year.", "score": 3, "replies": []}]}, {"body": "100%", "score": 1, "replies": []}, {"body": "I'm new to this, so I hope you are correct!! 💯😹", "score": 0, "replies": []}]}, {"body": "Literally no one and nothing except God himself can truly predict the market", "score": 120, "replies": [{"body": "It might sound stupid but I do coin flips to determine whether I buy a stock and how much I go in on it. \n\nIf I keep getting heads in a row I take it as a sign from God/the universe and go in harder.", "score": 35, "replies": [{"body": "What's the most you ever lost on a coin toss?", "score": 14, "replies": [{"body": "1 dime. It rolled into the drain", "score": 34, "replies": [{"body": "https://gfycat.com/alivetotalbasenji-javier-bardem", "score": 3, "replies": []}, {"body": "What? Last time I did a coin toss, I lost my house!", "score": 2, "replies": []}]}, {"body": "Nothing yet. But you have to understand. I paper hand. I have hands made of toilet paper. I paper handed FSR this morning and took $120 gains.", "score": 2, "replies": []}]}, {"body": "Probably more sane than spending 10 hours a day staring at charts and still not doing any trade with full confidence.", "score": 5, "replies": []}, {"body": "\"I kept crawling and it just kept working\" - Jerry Smith", "score": 3, "replies": []}]}, {"body": "God? That's the guy that gives kids cancer right?", "score": 14, "replies": []}, {"body": "so, have you asked this god guy? come on, share his picks!", "score": 8, "replies": [{"body": "god is insider trading", "score": 10, "replies": [{"body": "So is nancy", "score": -2, "replies": [{"body": "I haven’t seen Nancy and God in the same room at the same time.", "score": 9, "replies": [{"body": "Me neither, I think he doesn't like her.", "score": 2, "replies": []}]}]}]}]}, {"body": "What god? Be more specific, there are more than 2000 gods humans believe in right now.\nDo you believe in one of them?\nI don’t", "score": 4, "replies": [{"body": "2000? Where did you get this number? That‘s about one god per 4 Mio. people = fairly too much 😜", "score": 1, "replies": [{"body": "Actually 2500 gods \n\nAnthropologists estimate that at least 18,000 different gods, goddesses, and various animals or objects have been worshipped by humans since our species first appeared.\n\nSo who is right? \n\nhttps://www.amazon.com/Encyclopedia-Gods-Over-Deities-World/dp/0816029091\n\nYou know it’s all depending on where you are born. That’s it.\nWhere you end up with for parents, relatives, teachers, neighbours. That’s it.", "score": 2, "replies": [{"body": "2500, good. And each, of course, is the only true. 2500 times. Rarely laughed so much, thank you!", "score": 1, "replies": [{"body": "I don’t believe in one of them. \n\nReligious people don’t believe in 2 499 gods.\nI don’t believe in 2 500 gods", "score": 1, "replies": [{"body": "I am agnostic.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If God could predict it he wouldn't need to be asking for money all the time.", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "God is fake", "score": -8, "replies": []}, {"body": "Ol JPow can predict it. He runs it", "score": 1, "replies": []}, {"body": "God can’t predict, he just does the opposite of whatever WSB agrees on.", "score": 1, "replies": []}, {"body": "yep. All you can really recommend right now is being very careful with short term trades, but for long term/retirement accounts, you should absolutely be putting some cash in at this point if you have any that you don’t need", "score": 1, "replies": []}, {"body": "God cant predict the market, otherwise hed be a trillionaire", "score": 1, "replies": []}, {"body": "News flash, god has nothing to do with the stock market.", "score": 1, "replies": []}, {"body": "Thank the Lord God made the Devil … god is good all the time!!!", "score": 1, "replies": []}]}, {"body": "But the mother of all trendlines!!!\n\nhttps://preview.redd.it/b4mzrvsr2ska1.jpeg?width=1439&format=pjpg&auto=webp&s=be161a4985bec42af247caceab9bb84e9d3a5cae", "score": 33, "replies": []}, {"body": "Sounds to me like someone is ballsdeep in puts and now crying", "score": 31, "replies": []}, {"body": "People believe investment advice in the media and post it unironically. 😂", "score": 13, "replies": []}, {"body": "Perma bear MS", "score": 14, "replies": []}, {"body": "i HATEEE journalism so much.", "score": 3, "replies": [{"body": "wish trump banned it 💀", "score": 2, "replies": []}]}, {"body": "Sounds like a bear trap", "score": 5, "replies": []}, {"body": "The people that profit off of rube retail investors write these articles", "score": 7, "replies": []}, {"body": "'No one can predict the market' until someone does, then bulls are all like ![img](emote|t5_2th52|19738)", "score": 5, "replies": []}, {"body": "I like investing dot com - but their article writers are just as stupid as all the rest - just think what will 'they' do when the warehouse is full and you'll know why articles say buy or sell", "score": 2, "replies": []}, {"body": "Calls it is", "score": 3, "replies": []}, {"body": "The MS strategist has been pretty accurate lately. The only reasonable counterpoint to the bears has been that sentiment is already too negative, who’s left to sell?", "score": 1, "replies": []}, {"body": "since they said this then the probability for it to come true is less than not saying it.", "score": 1, "replies": []}, {"body": "I agree but when is the real question. Before or after fed meeting.", "score": 1, "replies": []}, {"body": "When WSB and Investing.com agree, it's time to inverse", "score": 1, "replies": []}, {"body": "I said March, but I didn’t say of which year!!!! ![img](emote|t5_2th52|29093)", "score": 1, "replies": []}, {"body": "When media are putting puts on the market or gaining positions for future bull rally", "score": 1, "replies": []}, {"body": "Good thing we have these accurate sources to help retail get rich", "score": 1, "replies": []}, {"body": "Nobody knows what the market is going to do so YOLO your account into out of the money options that are going to expire at the end of the week get rich or go broke trying", "score": 1, "replies": []}, {"body": "Are you the last one to say bear . All in we go", "score": 1, "replies": []}, {"body": "Inverse bank re inverse cramer inversed by kathie...", "score": 1, "replies": []}, {"body": "We will run to 4300-4400 in march and crash early to mid Q3", "score": 1, "replies": []}, {"body": "Yeah sure", "score": 1, "replies": []}, {"body": "They selling as much puts as they can", "score": 1, "replies": []}, {"body": "Feb 29th", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4263)![img](emote|t5_2th52|4263)![img](emote|t5_2th52|4263)", "score": 1, "replies": []}]}
{"title": "Tesla going bankrupt 😢", "selftext": "[removed]", "id": "11dejb6", "created_utc": 1677511696.0, "score": 181, "upvote_ratio": 0.96, "num_comments": 71, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|2 years ago\n**Total Comments**|18|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Cramer and Cathy...  jesus.   That's like getting jumped by the Double Dragon brothers.", "score": 43, "replies": [{"body": "-x-=+", "score": 7, "replies": []}, {"body": "These two can create enough singularity to blackhole the shit out of tsla", "score": 3, "replies": []}, {"body": "It's the investing apocalypse duo 🪦", "score": 1, "replies": []}]}, {"body": "Puts on tesla", "score": 30, "replies": []}, {"body": "WSB is very negative about Tesla… I’m all in..", "score": 26, "replies": [{"body": "Thank goodness for these posts when I spend all weekend wondering if I should have gotten out of Tesla on Friday.  Glad I didnt budge.", "score": 11, "replies": [{"body": "WSB aside, Tesla already is everywhere and has established itself as a luxury brand/toy for the common man.\nI don’t see them going anywhere.", "score": 5, "replies": [{"body": "Luxury band? No, more of a Volkswagen image.", "score": 1, "replies": [{"body": "Nah, you don’t have to own a home and pay 3-5k installing a charger to buy a Volkswagen.", "score": 7, "replies": [{"body": "Volkswagen ID4", "score": 1, "replies": []}]}]}, {"body": "Tesla’s PR is pretty good, they’re established as “luxury” without the luxury price.\n\nHigher-end, sure, but not a 200k vehicle with a self imposed manufacturing cap.\n\nTheir only problem is Elon is regarded", "score": 1, "replies": []}, {"body": "It’s either a toy for the common man, or it’s luxury. Can’t be both. And if anything, it’s the former. If you can afford a true luxury car, you won’t settle for the crappy build and materials in a Tesla.", "score": 1, "replies": [{"body": "99% of people, will never own a true luxury car as you described it. If you roll up with a model S, it will still turn heads in most places.", "score": 2, "replies": [{"body": "I think luxury is completely different for people. I bought a brand new gmc Serria premium plus a few years back and holy crap that thing was amazing. Paid about 60k and it always turned heads. Tesla is on a different level of luxury and they don’t cost much more.", "score": 1, "replies": []}]}]}, {"body": "Except the price of the stock isn't just 'not going anywhere'. It's priced as if they are expected to be an industry leader that will make multiples of profit more than any other auto manufacturer.", "score": 1, "replies": []}]}]}, {"body": "Just bought one whole stock today", "score": 2, "replies": []}, {"body": "To inverse Cramer or inverse WSB. Good luck on that one.", "score": 1, "replies": []}]}, {"body": "Hahaha inverse Cramer and Crashie", "score": 6, "replies": []}, {"body": "eff... i just bought tsla calls too..", "score": 9, "replies": [{"body": "RIP brother", "score": 7, "replies": []}, {"body": "My condolences 🙏", "score": 0, "replies": []}]}, {"body": "I think he just blew up the market sentiment with this", "score": 4, "replies": [{"body": "No like I mean nuked the market", "score": 1, "replies": []}]}, {"body": "How is this guy not in prison for what he says without any ass-terisk?", "score": 3, "replies": [{"body": "Also I read something like this and think...he hasn't even seen this yet so how does he know it's going to be so great that the stock price will go up?  Unless he does know something ahead of time...like...inside info... O_o", "score": 1, "replies": [{"body": "The assumption is that he doesn't have insider access and he is willing to be wrong. But being wrong is lawsuit waiting to happen when you blatantly recommend something.....SEC is quiet about it....I wonder if any lawyer showed this to SEC and asked \"unless you charge Cramer you can't charge my client \"...", "score": 1, "replies": []}]}]}, {"body": "u/cathie_d_wood", "score": 2, "replies": []}, {"body": "pro tip:\n\nWSB - Inverse Cramer\n\nalso WSB - Inverse WSB\n\nInverse Cramer + Inverse WSB = calls on $TSLA 😋", "score": 2, "replies": []}, {"body": "Tesla explosive batteries?", "score": 6, "replies": []}, {"body": "@Stay_Typical Tesla is a joke. The only reason the stock is up is because of fools like you who think it's going to change the world.", "score": 7, "replies": []}, {"body": "Tesla used to be the #electric car brand and far ahead of the rest.. now.. they still hahe the same car as 10 years back and competition passed them by miles.. tesla = history", "score": 2, "replies": [{"body": "Lol I come to WSB for posts like this.", "score": 2, "replies": [{"body": "🤣😅", "score": 1, "replies": []}]}]}, {"body": "They should cars are trash charging stations suck, but PUTS will be forever!", "score": 2, "replies": []}, {"body": "Lol the dump is right on time.", "score": 1, "replies": []}, {"body": "She legit looks like a dude", "score": 0, "replies": []}, {"body": "i feel like nobody really likes the whole charging concept.\n\nalso tons of good manufacturers coming with cool cars rn, why buy this at apple premium prices?", "score": 0, "replies": []}, {"body": "Caitlyn Jenners stunt double", "score": 0, "replies": []}, {"body": "Fuck. Selling my Tesla shares right now ![img](emote|t5_2th52|27421)", "score": 0, "replies": []}, {"body": "That's it tsla bulls this is the kiss of death for ya!", "score": 0, "replies": []}, {"body": "Felon Husk is gonna save the earth on wed I hear.![img](emote|t5_2th52|4640)", "score": -1, "replies": []}, {"body": "aww fuck", "score": 1, "replies": []}, {"body": "Lmfao", "score": 1, "replies": []}, {"body": "the two dark knights of the apocalypses came for Tesla", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "Cant wait to look at the inverse cramer in a month", "score": 1, "replies": []}, {"body": "Sadly... ill just buy more tesla i need the pain", "score": 1, "replies": []}, {"body": "One could only hope", "score": 1, "replies": []}, {"body": "Taking ARK investors to slaughter 2 x 2 ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "RIP EVs long live r/gasguzzlingtoyotas", "score": 1, "replies": []}, {"body": "Hahaha this guy is indestructible force of negative consequences 😂", "score": 1, "replies": []}, {"body": "I didn't know Skrillex gave investing advice.", "score": 1, "replies": []}, {"body": "show hands to TSLA", "score": 1, "replies": []}, {"body": "I bet Bill Gates is still shorting it.", "score": 1, "replies": []}, {"body": "Short it now", "score": 1, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I'm careful - so my approach is that there is no correlation between whatever Cramer or Woods say the market is doing and what the market is actually doing.\n\nSo if both are saying it's a buy, it might be a sell, a buy, a hold...or a pickled herring.\n\nI've never been short or long TSLA, and those two won't change this either way.", "score": 1, "replies": []}, {"body": "If it was anything but tsla id be on margin shorting tf outa this", "score": 1, "replies": []}]}
{"title": "Tesla always makes money", "selftext": "", "id": "11dgd7m", "created_utc": 1677516316.0, "score": 179, "upvote_ratio": 0.88, "num_comments": 73, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 years ago\n**Total Comments**|48|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Today was a good day for my portfolio. I made 4% return on my investments, and 27.93% return on my options strategies. My total portfolio value is now over $200,000. I am diversified across several stocks and industries, so even if one sector or stock declines in value, the others should offset those losses.", "score": 58, "replies": [{"body": "Well, if you started with $500.000 initial deposit, you belong here!", "score": 37, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 8, "replies": []}, {"body": "Shut the fuck up nerd!", "score": 12, "replies": []}]}, {"body": "TSLA always seems to take my money... LOL. I've pretty much avoided trading it for the last year. Sad I missed out on the run from Dec to Feb though.", "score": 11, "replies": []}, {"body": "Good for screenshot, great to sell", "score": 13, "replies": [{"body": "Hes just gettin in lol", "score": 10, "replies": []}]}, {"body": "I will exit my options on 214 and then buy the dip again i will keep the stock growing", "score": 8, "replies": []}, {"body": "Bad R:R", "score": 3, "replies": []}, {"body": "Speaking of EVs, I'm leaning hard towards Rivian at this point. I think it's possibly bled out all that its going to bleed. Any similar thoughts?", "score": 6, "replies": [{"body": "Doubtful.  Even established automakers have plenty of challenges.  I can't imagine starting up makes things easier.", "score": 6, "replies": [{"body": "I'm just sort of looking at how I'm seeing more of them on the road recently and how they have increased manufacturing to operating 24/7 shifts trying to keep up with the demand. I think there is definitely a demand for their vehicles.", "score": 4, "replies": [{"body": "Yes they just have a feature where the batteries spontaneously drain while parked 😬\n\nIdk much about them currently.  I was involved in the startup phase in 2020-21 when they converted a shitty Mitsubishi plant into their facility.  It's pretty remote so I doubt that helps attract talent.  Back then it was pretty chaotic but so is everywhere else.", "score": 2, "replies": [{"body": "Is that the Illinois location?", "score": 1, "replies": []}, {"body": "And I also notice that even though Ford sold a large portion of their stake in Rivian, they maintained a 12% stake and Amazon maintains about 27% ownership. Thats about 30% ownership by strong companies.", "score": 1, "replies": [{"body": "Check your math first ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "I meant 17% ownership by Amazon. Typo on my part", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They are going to bleed money for a long time. They can go down another 50% before they become profitable.", "score": 2, "replies": []}, {"body": "Vertical ovals don't belong on the front end of cars. Never have, never will. Puts.", "score": 1, "replies": []}, {"body": "didn't they have a major recall late 3rd qtr last year? \n\nIt was a small node in the steering wheel or something I think, had a fire risk... \n\nThat alone could BK them. but I dunno, EV's are wierd, Fisker went up 30% today on huge misses, losses, and negative revenue just by telling everyone they think they will be profitable this year", "score": 1, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "FREAKING NICE!", "score": 2, "replies": []}, {"body": "I tried very hard to convince that guy from last week to roll is options from last Friday to this Friday. Moron wouldn't budge. Could not fathom why he wouldn't get options that expire **AFTER** investor day. I think TSLA will end this week at $240+.", "score": 3, "replies": [{"body": "I also have option\n\nhttps://preview.redd.it/srb3o78qrtka1.jpeg?width=1290&format=pjpg&auto=webp&s=d89fd879cd65d42855be436c423943ef39471cf7", "score": 3, "replies": []}]}, {"body": "What app is this", "score": 0, "replies": [{"body": "Roobinhood", "score": 3, "replies": [{"body": "Can anyone trade options on there?", "score": 1, "replies": [{"body": "Yes", "score": 2, "replies": []}]}]}, {"body": "RH", "score": 1, "replies": []}]}, {"body": "Wtf can i get $791 ill pray for you for two years", "score": 1, "replies": [{"body": "Short AMC earnings are after hours", "score": 1, "replies": [{"body": "Amc cons be expensive lol or are you talking bout 0dte? Ive never played amc or them all i trade is spy", "score": 2, "replies": [{"body": "https://preview.redd.it/0t6lmdik00la1.jpeg?width=1290&format=pjpg&auto=webp&s=ed8c0b3ad89a196b138b6c888450b17148defaf7\n\nJust a small put earning is today after hours", "score": 2, "replies": [{"body": "You buying 10 its different i play small like 1 cons lol", "score": 1, "replies": [{"body": "Still guys, I believe tomorrow is a good day for tesla", "score": 1, "replies": [{"body": "It is a good day to have a good day.", "score": 2, "replies": []}]}]}]}]}, {"body": "And lemme tell you if i short it even with my little money say i do $100 it will go up", "score": 1, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": [{"body": "Ferme ta grosse gueule puante.", "score": 1, "replies": []}]}]}]}]}, {"body": "Sheesh OP.", "score": 1, "replies": []}, {"body": "Is this. A call debit spread ?", "score": 1, "replies": [{"body": "Those are buy calls", "score": 1, "replies": []}]}, {"body": "You actually bought the stock lol", "score": 1, "replies": [{"body": "I always buy stocks in the case cover the losses if the stock goes south", "score": 1, "replies": [{"body": "If you’re going long it’s not a bad play especially if you plan on holding it for a while", "score": 1, "replies": [{"body": "Yes I am holding it longer I believe Tesla will touch $300 this year", "score": 1, "replies": []}]}, {"body": "Lt tesla doesn’t make sense to me", "score": 1, "replies": [{"body": "Tesla is the only stock which have 90% chance to go up even in this market", "score": 1, "replies": [{"body": "Idk it can easily go right back to a 100 from here too there are better recession, plays that pay dividends out there if you’re parking 200k into something just saying", "score": 2, "replies": [{"body": "I will never go back to $100 too much big money at least this year it will go up on March 1 Elon investor day, model 2 cheap ev cyber truck this year", "score": 1, "replies": [{"body": "“Any stock can move 50% one way or another in a year” Peter Lynch", "score": 1, "replies": [{"body": "That's true", "score": 1, "replies": [{"body": "I think there are way better plays out there if you’re looking to buy a actual stock and hold though", "score": 2, "replies": [{"body": "Give me some info I will look at it", "score": 2, "replies": [{"body": "Stocks that I am holding for the long term BIG, VZ, GFI, BBY, UPST,", "score": 1, "replies": [{"body": "I will look at it thanks", "score": 1, "replies": [{"body": "Do your own DD but there are a lot of dividend, paying stocks that are on discount now with high probability that they will probably have substantial gains 3 to 5 years from now", "score": 2, "replies": [{"body": "NLY pay 15% I am holding it", "score": 1, "replies": []}]}]}, {"body": "https://preview.redd.it/qeo0qiktzwka1.jpeg?width=1290&format=pjpg&auto=webp&s=1f10b6f29de23caab0f9fe5ff2ff3cc39693ebee\n\nI am holding these", "score": 1, "replies": []}]}]}]}, {"body": "200k could not be a lot of money to you to I don’t know your finances", "score": 1, "replies": [{"body": "I am good. That is the reason I only buy 5 stocks Tesla, Apple, meta, Google, and Amazon. These stocks always come back so if I lose in options I break even in stocks but tomorrow I short big on Amc because I believe after-hours earnings, will be bad", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I've made some good money recently with TSLA puts too.", "score": 1, "replies": []}, {"body": "really hope you sold", "score": 1, "replies": [{"body": "No I have a stocks options I can exercise it will go back up no worries", "score": 1, "replies": []}, {"body": "Tesla start gaining back", "score": 1, "replies": []}, {"body": "Many of you laughed at me when I bought 200k stocks of tesla instead of options now you know why I did that. I believe Tesla will go up in a week's time back to where it was also options I am not worried about I will exercise those options. Still I would have price under 200 I can easily cash out at 210 😆😆😎", "score": 1, "replies": [{"body": "imma need you to chill.. I just wanted the best for you... is why I told you I hope you sold. it's not that deep", "score": 2, "replies": [{"body": "I am not referring to you many thanks I appreciate it", "score": 1, "replies": []}, {"body": "Tesla back", "score": 1, "replies": []}]}]}]}]}
{"title": "TSLA", "selftext": "With the positive media coverage of Tesla including: Quicker production speed in Germany on Tesla vehicles than expected. Along with the investor say coming up, and a pre market surge before the event.\nDo we think it’s a decent bet to stay, if not buy up TSLA stocks in favor of a higher market price possibility?", "id": "11dh0gf", "created_utc": 1677517874.0, "score": 20, "upvote_ratio": 0.75, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "buy the rumor , sell the news", "score": 16, "replies": [{"body": "That’s a great line.\nNoted.", "score": 1, "replies": [{"body": "I was going to say the exact same thing. There is a lot of rumor on what amazing things Elon is going to reveal helping send the price up, but what will he actually have for people?", "score": 2, "replies": []}]}]}, {"body": "I’m currently trying to figure out if the investor day will have a positive or negative affect on its stock price. While always considering well… it’s the stock market. Im trying to get down to if it’s worth keeping a hold onto especially after the investor day.\nMy current projections show a rise in stock price as long as the event goes well of course.\nIm just here to discuss if there’s a contrary about teslas stock price at the moment.", "score": 5, "replies": [{"body": "[https://www.reddit.com/r/wallstreetbets/comments/otwk5v/tsla\\_is\\_still\\_undervalued/](https://www.reddit.com/r/wallstreetbets/comments/otwk5v/tsla_is_still_undervalued/)\n\nMeh investor days haven't done much in the past.\n\nI see Tesla getting above $500 in the next year.  But Elon does everything he can to ruin his credibility and tsla stock price.", "score": 3, "replies": [{"body": "$500 in a fucking year???? Holy fuck. You guys are as crazy as Cathy saying bitcoin will be worth 1.5m each next year. \n\nWhat the fuck am I reading. Some serious copium", "score": 20, "replies": [{"body": "This guy was asking about tesla. \n\nYou're the one without any credibility. you post mulitple times a day bashing tesla.And you appear to have lost money based on your posts. \n\nI have never lost money on Tesla. So my unrealized gains are only up about $300k.\n\nYoure the one with the copium.", "score": -6, "replies": [{"body": "I bash tesla because elon is a fuck and if you actually look at tesla Financials they are severely overpriced due to the massive retail investment. 5IQ monkey brains are keeping the price up", "score": 1, "replies": [{"body": "ElOn ToOk MuH CeNcEnSoReD TwItTeR! Y’all sound like a bunch of crybabies. Short Tesla and post your position or STFU.", "score": 7, "replies": []}, {"body": "It is actually insane the amount of retail that has poured into Tesla, compared to Blue chip stocks and the overall market.", "score": 6, "replies": []}]}]}]}, {"body": "It’s funny, he’s made one of the most, well decently well known multi billion dollar company that moves like a low stock price.\nMajor ups or major downs based in volatility. \nI’m intrigued to see what happens though, I think aside from the driving and competition he’s been on point recently.", "score": -1, "replies": [{"body": "musk has personally gone completely magtarded. \n\nBut tesla has been doing very well. Tsla stock price would be higher if musk wasn't so busy turning twitter into a right wing cesspool and ruining people's opinion of tesla in the process.", "score": -5, "replies": [{"body": "Hey, I’m here to talk stocks and potential.\nI’m not affiliated with the Twitter platform, there’s currently many news articles against Twitter however it doesn’t seem to impact Tesla at the moment. \nI get peoples frustration and all, personally as long as I can type without censorship I’m alright. (Without any threats or anything, the basic freedom of speech in the US)", "score": -3, "replies": [{"body": "I’m excited and interested for the turnout tho!", "score": 0, "replies": []}]}]}]}, {"body": "500$ in a year? base off what exactly? 🤣 this guy just throwing out random numbers", "score": 1, "replies": []}]}, {"body": "Everybody says it will drop. And it’s not good for calls, as you know. It’s a thought call. I have calls", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "True.\nTesla does well with trends that possess hope.", "score": 2, "replies": []}]}, {"body": "Currently, many big firms are placing shorts on Tesla, because they have a potential upside of $20 but potental decrease of $50 after Elon talks.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Competitors that are now making electric vehicles like crazy.", "score": 3, "replies": []}, {"body": "For real though.", "score": 2, "replies": [{"body": "I don’t think Tesla is a 100$ stock, it’s worth too much. My current issue is projecting if they’re due for exponential growth with their recognition of worth (their being Tesla collectively) in regards to the world quite literally.\nTesla opening its ports for charging around the US as pushed by the US government for open competition, etc.", "score": 1, "replies": [{"body": "TSLA has a PE of 57. Even at $100 it would be overpriced by any reasonable standard. But for whatever reason Tesla doesn’t abide by reasonable standards", "score": 4, "replies": [{"body": "Might I pick your brain, why do you think it doesn’t abide by this then?", "score": 1, "replies": []}, {"body": "So at 100 it would have a PE of about 27. \n\nYou think a trailing PE of 27 would be “overvalued by any reasonable standard”. \n\nTSLA grew top line 40% and bottom line almost 100% last year and is guiding for about 40% top and bottom line growth this year. \n\nI don’t think you can correctly judge what is “reasonable”.", "score": -1, "replies": [{"body": "I’m not the person you are responding to but I think you could make the case that a PE of 27 is unreasonable for an auto manufacturer. So then you get into the debate of: should Tesla be valued as an auto manufacturer or a tech company? The tide may be turning to where they are valued more in line with their direct competitors. \n\nBut, Tesla is Tesla and may very well be an anomaly forever.", "score": 1, "replies": [{"body": "They are a company growing top and bottom line at 40%. Doesn’t matter what kind of company they are, a PE of 27 is cheap for that growth rate period.", "score": 0, "replies": [{"body": "Totally agree with that. I think the counter argument is that they are going to face a lot more competition than they had in the past which might limit their future growth (they’ve seemingly already acknowledged this by price cuts to stay ahead of their competition). \n\nFor the record I don’t have an opinion either way. Just pointing out the arguments for either case. On the bullish side, Tesla has always been an innovator and is so far ahead of their competitors and has achieved incredible growth targets. They could end up being like Microsoft or apple with incredible results every quarter for decades to come if their product is the best on the market and they are able to maintain solid margins.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Tsla is going to have to compete with legacy manufacturers along with other new guys on the scene going forward.", "score": 2, "replies": [{"body": "Yea that’ll be hard.. the only thing tesla is competing with is the CCP\n\nHopefully they bankrupt the country giving away free factories and EVs.. obviously not going to happen. China definitely cooks the books harder than anyone else", "score": 1, "replies": [{"body": "To be honest- I see Tesla as americas original electric car brand.\nSo- them against CCP?\nWell wait a few years lol.", "score": 3, "replies": [{"body": "I say that because no one outside of China is actually catching tesla overall. VW is doing well with numbers and due to a lot of luxury sales from Audi and Porsche they directly impact tesla sales. But, they don’t do shit in the west and basically only have numbers in Europe. \n\nTesla is the clear winner in the west. VW, TSLA, BYD all fighting for Europe (VW winning) and BYD crushing it in China (because of the CCP, and good execution). \n\nLegacy auto is doing nothing in North America, VW is the only decent player in Europe, and BYD is winning China. \n\n*legacy is fuc*", "score": 1, "replies": []}, {"body": "To answer your og question tho, normally these investor days have negative affect on the stock. But if Elon pulls something (High chance) it could result in a quick pump. \n\nThere’s speculation of the cheaper model design being revealed. This is the type of thing that could lead to a quick pump.", "score": 0, "replies": [{"body": "True!\nYes I heard of the rumors.\nAll aside, and logic out of view.\nI’m excited for possible bull.", "score": 1, "replies": []}]}]}]}, {"body": "You’re correct.\nHowever most of their Gigafactories for production have overpreformed, and aside from their self driving, I don’t see too much negativity for the brand.", "score": 0, "replies": []}, {"body": "You think you can just easily convert ICE factories to BEV factories and just pump them out? You are very wrong. Ford is finding that out right now.", "score": 0, "replies": [{"body": "No, but they already started a few years ago and are currently building EV specific factories.\n\nAnd it's not just Ford, it's every car company and all the new guys (rivian, lucid, fisker) and the large truck makers are making EV semis too.\n\nTesla has been playing on an open field with an empty net the last decade. And while they are good, the market is pricing the match as Tesla vs. the entire automotive industry.", "score": 2, "replies": [{"body": ">Tesla has been playing on an open field with an empty net the last decade\n\nIncorrect statement. \n\nThey've always had competition with ICE. If their cars weren't compelling nobody would buy them just because they were a EV. Intuitively you know this a true because there were plenty of EV's before Teslas and they were not successful.", "score": 0, "replies": [{"body": "There was never a proper EV before Tesla, just golf carts with car bodies.", "score": 2, "replies": [{"body": "Point is there seems to be this thinking that Teslas are only special because they are EVs. So as soon as their are other BEVs everybody is going to rush to the other manufacturers. Why is this a forgone conclusion?\n\nTo compete with Tesla, they have to make a EV 1.) Profitably, because Tesla has pricing power because of their margins and government incentives. Also survive the overhead from switching from a shrinking ICE business. 2.) Ramp up fast enough to meet demand and no wait times. 3.) Make it compelling enough for people to want it over a established (Tesla) brand with the best charging network etc.\n\nThat's a lot of hurdles, but people like you think this will automagically happen with no hiccups. I don't get it.", "score": 1, "replies": []}]}]}]}]}, {"body": "The only competition they could possibly face is from Hyundai and Kia and tbh there is no competition as long as the supercharging network remains exclusive. Legacy auto just can not make a competitive EV at the moment.", "score": 1, "replies": []}]}, {"body": "Compare Teslas market cap to other auto manufacturers. That ship has sailed... TSLA has peaked. Their \"full self-driving\" is a train wreck. They're no longer the only game in town for an electric vehicle. Their cars have no style or luxury. I am out of Tesla.\nBut If you're on this site you'll probably buy $650 calls for March 17th because you're a Regard.", "score": -1, "replies": [{"body": "So, what trade with Tesla made you so upset? Show me, show me on the doll where Elon touched you…", "score": 2, "replies": [{"body": "Yeah fr- place a criticism, don’t bash other people just because what… public discord? It’s as I’ve said previously. I didn’t post about ‘is musk Jesus Christ’ I posted about Tesla as a stock, based on current trends will it go up or down? Don’t need to get beyond that, and some numbers,insights and ideas.", "score": 1, "replies": []}]}]}, {"body": "That was already priced into the market this morning. It’s anchoring with Apple and the rest of the Nasdaq now. I wouldn’t buy now because it’s probably overbought at the moment, and it’s going to have a lot of downward pressure on it unless other news hits", "score": 1, "replies": [{"body": "If is anchoring on, and essentially moving with the nasdaq.\nEven with potential downward pressure, do you see a potential for it to contest its current price point of 200-210?", "score": 1, "replies": [{"body": "If the nasdaq drops at all this week, Tesla is probably going to drop below 200. I think the 190-200 zone is probably where it’s going to be pressured to align. I was watching it this morning and a lot of sellers were at 207, every time it hit that point it dropped about 50 cents almost immediately afterwards when the sellpoints were triggered", "score": 2, "replies": [{"body": "I think that’s the potential.\nHowever I feel as if there is potential with musk himself with the ‘Master plan 3’ and investor day.\nMusk himself adds value to the company, he’s a wildcard but it might be worth seeing out.\nI think ALOT of investors are waiting for higher prices to sell meaning..\nPotential…", "score": 1, "replies": []}]}]}]}, {"body": ">It is certainly possible that Tesla's stock price will rise in the near future, especially if the company continues to receive positive media coverage and meet or exceed investor expectations. However, there are no guarantees in the stock market, so investors should always be prepared for the possibility of a decline in value as well.", "score": 1, "replies": [{"body": "Nice try Chat GPT", "score": 12, "replies": []}]}, {"body": "And in addition: do we think the investor day will positively or negatively affect the stock price?\nI’ve heard some Wierd comments about investor day hitting the companies price negatively, aside from the current over buying.", "score": 1, "replies": [{"body": "I bought a 216.67C 3/17 @$8.00. I have faith in investor day bumping it up more tomorrow.", "score": 1, "replies": [{"body": "But with it already being inflated with excessive demand for the stock..\nIsn’t there still concern of a major drop down atleast 1-2 price levels?", "score": 1, "replies": [{"body": "I think a lot of people are going to hold to/thru investor day. It’s hard telling what Elon is going to announce. Could send the stock to the moon, might send it to the grave. He’s a total wild card. I only invest with “spare” money. Just deposited $800 in my account and bought the call. Hell, it can moon tomorrow to 225 for all we know. It could crash to 175. My TA, it’s going to go up or down.", "score": 2, "replies": [{"body": "This is the exact recipe for a sell the news situation", "score": 1, "replies": [{"body": "Normally, yes, however, hear me out. Stonks only goes up.", "score": 2, "replies": []}]}]}, {"body": "So did you buy in. Or what", "score": 1, "replies": [{"body": "Well as I’ve already made a few shares of TSLA in profits in the past month, im buying in. ‘Buy the rumor, sell the news’\n\nIf things go well, great, things go bad it’s just my Tesla earnings.\n\nIf you’re looking for advice, I say buy in.\nIt looks bullish. The chart man’s right, teslas one of the wealthiest vehicle companies on planet earth.\n\n*add to cart* \n\nI’m just waiting for it to hit a bit lower like 107 or less.", "score": 1, "replies": [{"body": "I’ve already claimed I have my call option open. Been sitting around 10-20% open P/L for the day. I will probably hold till about mid market tomorrow. We will see how it rides, maybe I’ll take it through tomorrow too.", "score": 1, "replies": [{"body": "If it gets lower than 203, 201 I believe it’s dropping a price level.\n\nIf it goes to 211-215. Prepare for a wild ride, in my opinion 😂.", "score": 1, "replies": [{"body": "I’m ready. Lambo or broke.", "score": 1, "replies": [{"body": "I like the saying lol", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Man, just looked at the options chain for this week, there's some monster calls and puts going on", "score": 1, "replies": [{"body": "Don’t take it for granted!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Thanks a lot for this screenshot by the way. I don’t have these lined up on my interface, this really helped decide overall.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Especially after today, I doubt people get (and or the market gets) teslas possibility yet", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s kind of insane. Because Tesla announced they’re basically cutting all rare earth minerals with their new model. They’re working to cut costs 50% optimize their new factories a 100%, and to face criticism remind how common lithium is.\n\nAnd despite that, because Elon musk can’t look straight at the investing crowd, and hundreds of other mentions- the media slams it.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’m bullish!\nI think Musk has a lot to prove\n\nThe master plans, which will be presented as the third installment, have been pretty bold and I expect nothing less", "score": 0, "replies": [{"body": "OMG You’re so right!\nHe’s announcing máster plan 3!\nI think bullish is the right answer Revolution!", "score": 1, "replies": []}]}, {"body": "elon's a wildcard..... 🤷🏻‍♂️", "score": 1, "replies": [{"body": "For real though.", "score": 2, "replies": []}]}]}
