{"title": "Facebook parent Meta announces $40 billion stock buyback", "selftext": "\nThis is after laying off 11k people already with more layoffs planned!\n\nhttps://www.cnbc.com/2023/02/01/facebook-parent-meta-announces-40-billion-stock-buyback.html?__source=androidappshare", "id": "10r6jkb", "created_utc": 1675286440.0, "score": 158, "upvote_ratio": 0.92, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|10 months ago\n**Total Comments**|1|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Up 28 dollars after hours , fuCkin insane", "score": 72, "replies": [{"body": "retail still has way too much money", "score": -10, "replies": [{"body": "not retail", "score": 37, "replies": []}, {"body": "What’s a few tens of billions in market cap anyway, a dozen retail investors?", "score": 3, "replies": []}, {"body": "Brave of you too to assume retro listen to ERs.", "score": 0, "replies": []}]}]}, {"body": "And then.... stock split", "score": 27, "replies": []}, {"body": "Just artificially propping up the stock.  They all do it, so why not.\n\nLay people off then conduct a massive stock buy back...", "score": 117, "replies": [{"body": "Laying off mostly useless people who were posting on tiktok their daily routine like buying coffee and doing gym in the tights", "score": 33, "replies": [{"body": "Some employees prior to layoff were subject to very unreasonable expectation just to allow them to flag them with underperformance. There were many articles about that, although I agree some of your point was true.", "score": 8, "replies": []}, {"body": "Every single one out of 11k people did that? How do you know?", "score": 3, "replies": []}, {"body": "Im in a META office rn drinking coffee and on reddit. Ugh oh", "score": 1, "replies": []}]}, {"body": "I mean they now have to buy at the “propped up” price lol.", "score": 7, "replies": [{"body": "The point is to prop up the price", "score": 16, "replies": [{"body": "\"prop\" it up by bidding it to that price? People don't have to pay the price they did lol", "score": -5, "replies": [{"body": "Prop it up by reducing the supply", "score": 0, "replies": [{"body": "How is that \"propping it up\"? That's just how prices work lol - you want stuff at a certain price, the price has gone up - decide if you want it or not, but it's not deliberate lol", "score": 1, "replies": [{"body": "It's so easy to just Google when you have questions  about how this stuff works", "score": 0, "replies": [{"body": "I can't ask Google why YOU feel that a company paying back its shareholders is \"propping\" up the price of the shares. It's so easy to talk to people without being a condescending twat.", "score": 1, "replies": [{"body": "This is just such common practice  that it doesn't matter what a condescending twat like me feels about it. Just Google \"how do buybacks prop up the price\" and  stop acting like everyone else is dumb for using that terminology", "score": -1, "replies": [{"body": "I know that Google would explain supply and demand to me, if I asked it what you've asked. \n\nGoogle wouldn't distinguish the connotation that \"propped up\" has like a flesh and blood human being might \n\nStop acting like everyone else is dumb for not acting like a naging robot. If you want to be *anti*social, then cool fuck off and do it elsewhere - the 'too cool for school' attitude stops being cute at about 19.", "score": 1, "replies": [{"body": "I'm 12 so it's still cute", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "They don’t have to but certainly some people will. The idea is that Meta’s overall market cap (total value) remains the same but now there is a reduction in outstanding shares, this props up the share price.\n\nWhy is this significant? Because Meta could have reinvested that $40 billion into the company, they could have issued $40 billion as a dividend, but neither of those would drive up the stock in the short term as much as a buy back will, even though those are more logical decisions. And here’s the kicker, C level compensation is usually heavy tied to stock price.", "score": 1, "replies": [{"body": ">reduction in outstanding shares, this props up the share price \n\nNo, because the reduction in outstanding shares is paired with an increase in individual share value - \n\nYou're sort of putting the cart before the horse - the share value is pushed up because meta has purchased all of the shares listed for less than X dollars. \n\n>even though those are more logical \n\nLogical how? \n\n>C level compensation is usually heavy tied to stock price \n\nYeah? Because if I'm putting you in charge of my multibillion dollar company, I want to make it so if it tanks, you do to. \n\nIf, instead, meta does the 40 billion dividend you suggested (lol btw), that *obviously* just gets priced in - meta goes WAY up before dividend, people cash it, sell afterwards. \n\nSometimes it just is the case that the best investment is owning more of your own products. It's like you feel they've done a disservice to shareholders, but they all just woke up to 25%+ gains lol\n\nTldr: they increased value, lowered liquidity, things continue as expected.", "score": 1, "replies": [{"body": ">Reduction is paired with increase in share value\n \nYes that’s what I described, METAs overall market cap remains unchanged because this action in a vacuum has no effect on the overall value of the company other than they have $40B less cash. If the market cap is unchanged and they have removed shares from the market, the price will increase to reflect the updated ownership value.\n\n> you’re putting the cart before the horse\n\nNot really, you are describing the “how” of this process and I’m describing the “why”. By performing share buy backs META is removing a subset of shareholders that value the stock price at a lower amount, however this also increases the value of those shares because they now hold a greater percentage of ownership. \n\n> Logical how?\n\nBecause doing share buy backs only returns cash to the subset of shareholders that value the company the least (willing to sell at a lower price). A dividend would return cash equally to all shareholders and be more efficient. Re-investing back into the company, assuming competency, would generate further revenue or returns in the future and create theoretically a larger dividend. \n\nBuy backs only reward those willing to sell their stake in the company, it’s kind of like rewarding the least committed.\n\n> Yeah?\n\nThe problem, though, is that share buy backs bring zero value to the company, and if I want to remain a shareholder then they offer minimal value to me as well. Tying compensation to share holder price has given executives a quarterly/yearly vision and they don’t make long term moves that don’t have short term benefits. \n\n> they just woke up to gains\n\nYou asked what the other poster meant by “prop it up” and I explained the why. Yeah I don’t agree with share buy backs, but I also understand why a short term investor would be happy with it.", "score": 1, "replies": [{"body": ">if the market cap is unchanged and they have removed shares from the market, the price will increase to reflect the updated ownership value\n\nWell, they 'removed' them by purchasing them, so all seems well. What's wrong with what you've described? \n\n>Only returns cash to the subset of shareholders that value the company the least \n\nRight, because the rest of them value the shares more than the cash proposed to buy them. All seems well, again. \n\nAlso here you make it sound like the shareholders that sell are being rewarded *instead of* those who held, but in fact, both are getting exactly what they want - a shareholder who sells, *wanted X cash for their shares and got it* and *shareholders positions increased in value*.\n\n>A dividend would return cash equally to all shareholders and be more efficient \n\nNo, I reckon it would have almost the same effect on the market, just less efficiently. *Because* people know this big dividend is coming, the shares become more valuable, people pay more, shares crash after dividend payout. \n\n>Reinvesting back into the company, assuming competency, would generate further revenue or returns \n\nI guarantee they contemplated that and concluded that purchasing shares of their company IS the best reinvestment they have right now. \n\n>create theoretically a larger dividend \n\nYou.. keep talking about dividends like they're an objective end-goal. Not everyone cares about/values dividends. \n\n>Buybacks only reward those willing to sell their stake in the company \n\nNo. Shareholders JUST woke up to a huge increase in value. They ALSO got rewarded, just not in USD. \n\nIt's like your conflating \"value\" with US dollars. The shareholders still have exactly what they want - shares. The people who sold have what they want - cash. \n\n>buy backs bring zero value to the company \n\n\"Bringing zero value\" can be your best alternative - better than losing 40 billion dollars. They have to do *something* with the cash and the best investment could very well be shares of their own company.\n\n>If I want to remain a shareholder then they offer minimal value to me as well \n\nSomeone just came in and bought forty billion dollars of stock that you believe that is \"minimal value\" to you as a shareholder?\n\n>Tying compensation to share holder price has given executives a quarterly/yearly vision \n\nWhat?? Most times these are *restricted shares* that you don't have access to for years at a time - which is what prevents you from making moves that only benefit the company in the shortterm. \n\n> You asked what the other poster meant by \"prop it up\" and I explained why\n\nI understand why it makes the price go up but \"propped up\" has a particular connotation to it. \n\n>Yeah I don't agree with share buybacks\n\n..why? If you invested in my company, and then my company makes money, what's wrong with me paying you back for the investment? Do you expect companies to hold onto investor money *forever*? \n\n> Why a short-term investor would be happy with it\n\nWhy did you specify short-term here? Long-term holders just got a signal from the company that they are so confident in what they're about to do at their best investment was purchasing shares..", "score": 1, "replies": [{"body": ">propped up has a particular connotation to it\n\n&#x200B;\n\nOk, so we are on the same page then that you understand why a share buy back increases the price.\n\n&#x200B;\n\nPropped up has the implication that it is artificial, which is what I would say buy backs are. They do not add value to the company, but instead increase the stock price. If that's what you care about then sure its a great thing, my issue is that they return zero value to the shareholders that remain after the buy back has occurred.\n\n>Shareholders woke up to huge increase in value\n\nThat means nothing if the shareholder does not want to sell. The entire value proposition of a share is that its a present value of future estimated dividends, if there was no actual return on a share than no one would purchase them. If you are a short term investor than all of this is great, you have no desire to hold onto the stock anyways. If you a long term investor that believes in META and wants to ride the company out, then a dividend would be the way they return profit to you.\n\n&#x200B;\n\n>they are so confident in what they're about to do at their best investment was purchasing shares\n\nThis is the assumption that a share buy back is seen as an investment. Alternatively it could be seen as a way for C level executives to guarantee their bonus. Why is that a problem? Because those same executives are not married to the company, they may leave at any time and therefor their priority is not the long term vision but instead the short term return.\n\n&#x200B;\n\nWhat if that $40B could have been used for a long term investment, but would have had zero impact on the share price? You are assuming the executives made the smartest decision for the company, when they could have made the smartest decision for themselves instead.\n\n&#x200B;\n\nThe biggest issue I think you and I disagree on is which method is better to return capital to a shareholder - buyback vs dividend. Dividends do not have the same effect because they get priced in, and after the dividend has been paid the share price decreases back to its original value (in a vacuum). A buy back is permanent (assuming the company does not quickly re-issue the shares) because the shares are no longer available.\n\n&#x200B;\n\nSo, we essentially have two options to return capital\n\nOption 1\n\n\\- Return capital equally to all investors based on their ownership\n\n\\- No effect on share price\n\n&#x200B;\n\nOption 2\n\n\\- Return capital to the investors most likely to sell\n\n\\- Increase share price\n\n&#x200B;\n\nDoes this benefit the other investors? Again, only if they are wanting to sell in the short term.\n\n&#x200B;\n\nYou can view stock ownership as a quasi-scalping scheme where you are buying in at a low price and hoping to get out a higher price, or you can view stock ownership as a way to capture a company's net profit. Thats the difference between short term and long term.", "score": 1, "replies": [{"body": "Holy moly a good faith argument on the internet - imma finish my shift and get back to you. This response was interesting and I'm curious to see what you think of my response when I get to it in a bit lol", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The rich just keep getting richer.  Capitalism in America is dead", "score": 8, "replies": [{"body": "Lol this is actually what capitalism is all about. The rich squeeze the little guy to get richer.", "score": 27, "replies": [{"body": "No capitalism isn’t that, what we are in is called corporatism. Look it up, our free capitalist society died a long time ago. It became corporatism when corporations took over every aspect of our life and squeezed competition out. Our founding fathers did not intend for us to end up like this. But the actions of a few led us into this path.", "score": 21, "replies": [{"body": "It *is* still capitalism. Darn industrial revolution though. This is why antitrust/competition laws are important. Capitalism is sick everybody loves it but it generally tends towards consolidation and that can end up very bad for the little guy.", "score": 8, "replies": [{"body": "So what system would be your alternative?", "score": 0, "replies": [{"body": "There's really only two options, socialism or fascism.", "score": 1, "replies": []}]}]}, {"body": "If only anyone could have possibly predicted with reasonable accuracy *exactly* what late stage capitalism would look like. \n\nOh well I guess we will have to rely on semantics and  fantasizing about the intentions of the fOUnD1nG FuThUrS.", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|28993)![img](emote|t5_2th52|28993)![img](emote|t5_2th52|28993) I guess so you", "score": 0, "replies": []}]}, {"body": ">No capitalism isn’t that\n\nYes it absolutely is lmao. The end game of capitalism is consolidation and monopolies.", "score": 2, "replies": []}]}]}]}, {"body": "You mean returning money to shareholders\n\nWhy else would you buy the stock? To see if zuck is really an alien?", "score": 1, "replies": []}, {"body": "As an investor I’m liking all these decisions, but I’m sure a socialist adjacent Redditor like yourself will have difficulty coping.", "score": -1, "replies": []}, {"body": "How is eliminating a huge part of the float though butybacks or laying people off artificial?  Stocks are valued in long term EPS projections.  These moves improve that calculation dramatically", "score": 0, "replies": []}]}, {"body": "Both moves are consistent with maximizing shareholder value so I don’t understand your objection.", "score": 33, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Well if they’re not sure what to do with the cash, they could either invest more into r&d (aka more metaverse losses), or pay a divided or buy back shares (equivalent).", "score": 2, "replies": []}, {"body": "Meta has unlimited cash reserve", "score": -2, "replies": []}]}, {"body": "Short term shareholder value. Long term these companies are killing themselves.", "score": 9, "replies": [{"body": "No they’re not.", "score": 2, "replies": []}]}]}, {"body": "Ahh that's why it went up lol.", "score": 8, "replies": [{"body": "It’s up over 20 dollars AH", "score": 7, "replies": []}]}, {"body": "MBAs MBA’ing", "score": 10, "replies": []}, {"body": "Don’t understand why this is “bad”. What should I do if I have a lot of cash and my growth prospects turn out to be duds? Fire the people that I hired to research those potential investments and return the cash I’ve got on hand to my shareholders instead of locking it up inside my company with nothing viable to invest it in", "score": 14, "replies": [{"body": "Strong antiwork vibes in here, these people should consider less whining.", "score": -1, "replies": [{"body": "Yep", "score": 0, "replies": []}]}]}, {"body": "This is why I laugh every time I read that tech layoffs are because companies can’t afford to retain the staff.\n\nThese companies didn’t have to layoff. They did it to make hedge funds happy. hedge funds should be illegal.", "score": 13, "replies": [{"body": "At the same time: if the company doesn't need the workers, then the workers are better off where they can do something productive.", "score": 2, "replies": []}]}, {"body": "This won’t end well eventually", "score": 4, "replies": []}, {"body": "Layoffs drive improved op ex margins. Buybacks typically create shareholders value and don't impact the P&L.\n\nBoth a win-win from an investors stand point, hence the uptick in stock price.\n\nShit for the workers getting laid off there thou.", "score": 2, "replies": []}, {"body": "fuckers", "score": 4, "replies": []}, {"body": "The streets of San Francisco must be in shambles these days.", "score": 3, "replies": [{"body": "needles and human feces, actually", "score": 13, "replies": [{"body": "![img](emote|t5_2th52|4263)?", "score": 1, "replies": []}]}]}, {"body": "About time tech companies started returning value to their shareholders.", "score": 3, "replies": []}, {"body": "Yes… both good moves for the stock value. Fucking duhhhh.", "score": 3, "replies": []}, {"body": "Glad to see tax breaks and covid relief dollars are being spent as promised.", "score": 1, "replies": []}, {"body": "The writing was on the wall. Now let's hope the other FAANGs follow, continue with the layoffs and commence share buybacks too! 💹🚀🙌🏼", "score": 1, "replies": []}, {"body": "Towel stock did it and is going bankrupt, popcorn stock is about to do it and while not bankrupt itself (yet) has made it's shareholders value worth less than popcorn butter. Garbage businesses making garbage decisions will always fake it after they lost it.", "score": -8, "replies": [{"body": "AMC is doing everything right compare to other meme stocks brother. Implying ‘yet’ is more opinion then fact. I keep up to date with AMC news. The cult factor is definitely a plus, but I believe this company has one more big run in it.", "score": -8, "replies": [{"body": "Mods!  Right here, this regard right here please!", "score": 0, "replies": []}]}]}, {"body": "Lmao cut jobs and then use 40b to stock buyback, america is great", "score": 0, "replies": []}, {"body": "So, time to buy i guess?", "score": 1, "replies": []}, {"body": "Reminder even with all these layoffs, it's basically just rolling back to a pre pandemic employee count.", "score": 1, "replies": []}, {"body": "I think there was a lot of short interest. Now that the parent company is buying up the stocks there will be $40 billion worth less stocks to short on the market. \nIt is also one way to make salary adjustments. For a good percentage of employees 50 to 99% of their salary is stock based. So instead of individually adjusting everyone's salary by awarding them more stock, buybacks are efficient (they increase everyone's salary in the short term and give them hope). They also don't have to issue new common stock, diluting everyone in the process.\n\nAlso keep in mind that meta is only down to 2021 December staffing levels post layoffs.\n\nP.S. I know nothing.\n\nEdit: for what it's worth I helped some random folks interview with Meta during the pandemic and found their computer science fundamentals pretty shaky. However they were good at retaining information and solving coding problems that are typically asked during interviews. They got in but not sure how they're doing now. \nBack then I definitely got the feeling that layoffs are coming soon.", "score": 1, "replies": []}, {"body": "Pfizer is laying off.  They have tons of cash from the Covid vaccine.  I think they’ll just buy back shares 🙄", "score": 1, "replies": []}]}
