{"title": "Unusual Option Flow Summary for the week: AAPL, ADBE, C, CLDR, ORCL, PBR, WRTC", "selftext": "After 3 weeks of absolutely portfolio-destroying FUCKERY, it seems some players have begun to roll the dice on a reversal and bounce in tech. Will the rug-pull continue or will we get stimulus into our bank accounts (immediate deposit to Robinhood) and perhaps our portfolio’s. The truth of the matter is that NOBODY FKN KNOWS, anyone selling you a subscription telling you where the market is going is playing you like a fiddle. Here’s some of the activity spotted last week, would be great to see some follow through after the last 2 green sessions on Thursday and Friday. \n\nI get a lot of DMs asking about the activity, so if you want to read a bit about option flow, I made [this Reddit post](https://www.reddit.com/r/SwaggyStocks/comments/i2cwm1/unusual_options_activity_option_flow_what_it_is/) describing how it works.\n\nIn addition, if you would like to check out the option flow tool and scan for yourself, here is the [option flow tool](https://www.swaggystocks.com/dashboard/stocklabs/option-flow).\n\n&#x200B;\n\n**AAPL – Apple Inc**\n\nAAPL finally saw some YOLO-ers roll thru late Thursday into the close and Friday throughout the trading day. Nothing extremely specific, but the call buying was in a range of strikes OTM and for short-term expirations. Players looking for a short-term bounce in tech here as they’ve been beaten to a pulp in the last 3 weeks.\n\nhttps://preview.redd.it/jfidvll03pp51.png?width=2040&format=png&auto=webp&s=4454f6b7fb5ad51ab70844f58c1bb3aa20b3a81e\n\n**ADBE – Adobe**\n\nADBE saw a massive call block come through on Friday. 5,000 January 2021 CALLs at the $420 strike (10% ITM). Total position size was $40 million. ADBE was about 10-15% off the recent highs and has bounced multiple times off the $470 level. IF this sell-off is truly over, we might see a good bounce in tech and some of these block purchases seem to be positioning for it.\n\nhttps://preview.redd.it/62fnlua13pp51.png?width=2038&format=png&auto=webp&s=841729d311c8e7305fc10857a9fd6282cb703a09\n\n**C – Citigroup**\n\nVolume in C (Citigroup) has picked up recently. Down 25% from the highs the financial sector has been under-performing (due to interest rates among other factors). Banks usually kick off earnings season which will commence again mid-october. C reports October 12 as of right now. Looks like the bullish option flow is a combination of CALL-buying and PUT-selling.\n\nhttps://preview.redd.it/zv6bqsj23pp51.png?width=2032&format=png&auto=webp&s=00e5a1b0fa2a41abf9807d047e59d3c5145b6015\n\n&#x200B;\n\n**CLDR – Cloudera**\n\nSome short-term bull-bets rolled thru CLDR last week. Possible base forming at the $10-$11 range and might see some movement to the upside on this call-buying. Pretty good volume of calls at the $12 strike expiring two weeks from now. Tech is looking for a much needed bounce, we’ll see how this turns out.\n\nhttps://preview.redd.it/4ctxpsb63pp51.png?width=2038&format=png&auto=webp&s=3f7c116329c5ee9d92e46d98aad5367d3367227d\n\n**ORCL – Oracle Inc**\n\nBig-time PUT-selling in ORCL on Friday in some 2022 LEAPS. Players sold the $50 and $75 strike PUTS expecting ORCL to rise above in the next year + few months. ORCL has been trading in the $45-$55 range for as long as I can remember with not much growth in stock price. They’ve just recently broken out close to $60 range on the TikTok deal news. Will this be a catalyst to keep the stock moving up?\n\nhttps://preview.redd.it/zumbvu473pp51.png?width=2042&format=png&auto=webp&s=3912cadb15e4cb2cdaaef46e1ac0c3c6f505c619\n\n**PBR – Petróleo Brasileiro**\n\nBrazil’s oil giant PBR, seeing some heavy bearish flow recently with some PUT-buying. The oil industry has been getting slaughtered since covid and these long-term bets (mid-2021) are expecting continued downward pressure for the stock.\n\nhttps://preview.redd.it/6y5nfdbb3pp51.png?width=2032&format=png&auto=webp&s=6f88d524d516d1b357e6814fd70db700d9f20249\n\n**WRTC – Wrap Technologies**\n\nAn unusual ticker to see on option flow, WRTC (Wrap Technologies). Not much option flow runs through this name, so to see some heavy volume come through in call-buying caught some attention. Players purchased long-term (2022 expiration) LEAPS at a whole range of strikes in and out-the-money. One of the call blocks were bought for the $17.5 strike which is actually 150% OTM. This ticker is only $250 million in market cap, so quite unusual indeud.\n\nhttps://preview.redd.it/ybg9iy4l3pp51.png?width=2034&format=png&auto=webp&s=d743de0a4e253191922b8f33d551bf690b601cfe", "id": "j0rev4", "created_utc": 1601214633.0, "score": 146, "upvote_ratio": 0.96, "num_comments": 53, "comments": [{"body": "[deleted]", "score": 41, "replies": [{"body": "Why hold after Friday's strong day", "score": 14, "replies": []}, {"body": "When did you open them my brotha. Hope not Thursday morning 😂", "score": 22, "replies": []}, {"body": "yikes..", "score": 4, "replies": []}, {"body": "I do too. I don't think the downtrend has subsided. Will hold my AAPL puts", "score": 5, "replies": []}, {"body": "Same, but mine are dated to end of Nov. Apple indicators are generally very bearish rn though. \n\nI'm so scared!!!", "score": 3, "replies": []}, {"body": "Me too, but they don't expire till like November 6th", "score": 1, "replies": []}, {"body": "Same with NVDA. I’m so f’ed😭", "score": 1, "replies": []}]}, {"body": "What's the take on AAPL calls lads?", "score": 25, "replies": [{"body": "I bought calls on friday following flow apple is going to do great in October when numbers are released", "score": 19, "replies": []}, {"body": "Every time i bought apple calls this year its tanked bigly the following day so ima stay out", "score": 10, "replies": []}, {"body": "I bought a couple for 11/20 hoping they bounce next month for the earnings report", "score": 3, "replies": []}, {"body": "Have (7) 12/18 calls and (3) 10/16 puts", "score": 3, "replies": []}, {"body": "AAPL is still very overvalued. Fair price IMO at this moment is around $95. Honestly, market sentiment for the rest of the year is directly related to stimulus", "score": 10, "replies": [{"body": "I think that's solid advice but I'm really just honored to get feedback from stock-trading dragonite", "score": 15, "replies": [{"body": "Rofl ya but I don't have psychic so take everything I say with a grain of salt 😄", "score": 2, "replies": []}]}, {"body": "you think AAPL is overvalued?\n\nedit: I agree with you, the matter is just how much you think its overvalued", "score": 5, "replies": [{"body": "I don't think anyone can say \"this stock should be XXX\" exactly. I just think investors are not pricing in any impact to their revenue in the future. Apple was around $330 pre covid, $100 would be $400 a share. Their revenue has not bounced that significantly (if at all) to justify that price. Granted, most of that price I'm sure has to do with their robust balance sheet, and the fact that they can aquire other businesses if necessary.", "score": 2, "replies": [{"body": "My opinion.... its also because of the no alternatives (bonds) in today's world vs back then.  \n\nApple is a fairly safe place to take a dividend that beats treasury rates.\n\nThink appl should be worth around ~$100/share still", "score": 1, "replies": []}]}]}, {"body": "iPhone 12 and strong ER will probably push AAPL past $120.", "score": 4, "replies": []}, {"body": "lol", "score": 1, "replies": [{"body": "What?", "score": 0, "replies": []}]}]}, {"body": "bought oct 16 calls mid day thursday.. big bounce incoming for sure, this post just solidifies that.", "score": 1, "replies": []}, {"body": "If we break 112-113 we should fly. We also reached higher lows as\n\nwe didn't reach 103 again. We might have some upside in the short term. If we don't pass through resistance we might revisit 106", "score": 1, "replies": []}]}, {"body": "Thank you! Your website and posts are really insightful and highly underrated", "score": 18, "replies": [{"body": "Thanks brother", "score": 11, "replies": []}, {"body": "Agreed. I love your writing style.", "score": 1, "replies": []}]}, {"body": "I dont see how the tech sector can continue to suffer as we head towards black friday and the holidays, but I've been wrong before. I chucked my money at Oracle after word of the tiktok deal and I'm considering a call on apple for january 2021", "score": 14, "replies": [{"body": "Does the tiktok thing give you anxiety? The companies struck a deal but both countries governments pose a threat to it still. I thought about getting ina few times but the market overreact to everything atm", "score": 4, "replies": [{"body": "Im more worried about China than the US, there's a chance they screw things up over oracle gaining access to source code for tiktok, but I'm optimistic some kind of deal can be struck, simply because no deal would mean cutting off 80 million users.", "score": 1, "replies": []}]}]}, {"body": "Adobe products such as Illustrator dominate the market, they were one of the early tech names to adopt the cloud and benefit from it, and are simply such a stable winner that buying dips just makes good sense.", "score": 8, "replies": []}, {"body": "I don’t believe in “unusual option flow” especially after seeing the 2006 Kramer video about market manipulation", "score": 5, "replies": [{"body": "Unusual option flow is extremely hit or miss. Most of the subscriptions I’ve seen love pushing small $75k bets that are 10% OTM as unusual activity to get people to follow.\n\nWhen I look at my own scanner I’m looking at position size (ie: is it 10k contracts or 300), catalysts/events, and also if they are doing spreads/rolling a position.", "score": 7, "replies": []}, {"body": "Agree. For example a huge call block could be a hedge to a shit ton of short shares. Unless you know who’s buying and what’s their net delta/gamma is then there’s no straight answer if some block was bullish or a hedge to a bearish position.", "score": 4, "replies": []}, {"body": "Kramer is a loud mouthed fool.\n\nI dont know why people follow him blindly.", "score": 2, "replies": [{"body": "Like any stock follower, he’s not expected to be right every time, when he has a  show every day. He’s knowledgeable, and right more often than wrong, but his main value is as a source of information.  H is most certainly NOT a fool.", "score": 1, "replies": []}, {"body": "Yeah, he is. However he explains how hedge funds will use options to make it look like a nice is coming.", "score": 1, "replies": []}]}]}, {"body": "It seems like WRTC is being investigated for engaging in securities fraud, causing their stock to drop. Maybe this was a catalyst for a long term position to be opened?", "score": 3, "replies": [{"body": "Bought 1000of it", "score": 1, "replies": []}]}, {"body": "thanks big swag", "score": 2, "replies": []}, {"body": "Why would someone be buying $5 WRTC call leaps?", "score": 2, "replies": [{"body": "As far as company outlook. I'm guessing increased law enforcement regulations. Probably betting on legislation changes taking a while. \n\nAs far as choosing $5 leaps. Idk. Seems easier to just buy and hold stocks if that's the case.", "score": 1, "replies": []}]}, {"body": "I always see a post like this every week about unusual options on something. What's the purpose of this? Thanks.", "score": 2, "replies": [{"body": "Some people believe large bets are an indication of future movement (i.e. they know something we don't) but it's definitely not the most accurate indicator out there", "score": 2, "replies": [{"body": "Thank you very much :)", "score": 2, "replies": []}]}]}, {"body": "So what’s the play on Citigroup? Buy Monday with the cheap premiums and sell off before earnings when we can (hopefully) see a spike in premium price leading up to the earnings?", "score": 1, "replies": [{"body": "Risky bet banks are trashed due to the pandemic. Citi has said they will be way down already.", "score": 1, "replies": []}]}, {"body": "I positioned myself into 01/15/2021 150 Calls pretty much right before the sell off began. I’ve lowered cost average significantly, but still disappointed at my poor analysis. Most likely Monday I’ll double down and ride off of 5G news and earnings. It is extremely unlikely these will roll ITM much less pull a profit, but at least I might be able to recover some losses.\n\nEdit: I also do believe the tech sector has reached its peak suffering. With Black Friday and then the holidays coming up, consumers will want to get their devices. Although, On the other side of that, the unemployment rate and other pain caused by the corona virus might significantly or not significantly affect consumer purchasing.", "score": 1, "replies": []}, {"body": "Hm", "score": 1, "replies": []}, {"body": "On 1/11/21 bought WRAP puts $5 March19 and they are up 37% through 1/29/21. The stock is up 13.47% in the same period.", "score": 1, "replies": []}, {"body": "Not some fuckery, frankly.  Log in to the VolisWell blog.  You’ll see why the action is what it is.  New post should be out tonight for Monday.  Worth the read.  And it’s free, so, no subscription required.  Not advice either, just info on flows and trends with full YouTube run downs on the weekend.  No,I’m not affiliated with it.  This was a classic blow off top.  The question is not if it can fall further, it’s what is the Fedusry and Congress going to allow.  Since Congress is tied up with the SC nomination, I would expect a CR through the election and then real deal pending the outcome.  That could delay stimulus.  If Wall Street doesn’t want to play that game they will gap this shit down and force the action — remember every airline is laying off thousands next week without “stimulus.”  If the market tanks next week, possible the Fed puts out a fax like in June saying they are going to buy total market MFs.  They are a little trapped though: action all benefits the banks and funds that front run this shit.  So, be careful here.  Could go up, but until we make new higher low, the trend is a slow bleed down to regain price discovery.  We are oversold to be sure, but historically, valuations are still wildly too high.  At some point it’ll matter.  Global economy sucks and getting worse.", "score": -3, "replies": [{"body": "I agree with your point of view, however, it’s been the same story for over 10 years. Everyone is always expecting the “huge crash”, “house of cards”, “broken economy”, and yet here we are still pushing all time highs. Eventually you will be right, but not quite, because to say the market could crash tomorrow, next week, next year, or 2 years from now, is guessing at best.", "score": 6, "replies": [{"body": "Of course this is correct.  The next crash is always right around the corner.  The general trend, over the past 40 years of the market, is like a asymptotic line.  So, I harbor no illusions we will reach a higher high.  I’m talking RIGHT NOW.  we’ve had a correction and do believe we can trend a little higher, but the picture is just meddled.  The Fed has pulled back their outright support due to criticism, and, absent a failing bank, I think they are content to let some air out of the bag.  Don’t know how much, but again, we keep making lower highs and lower lows since the blow off top.  Best of luck.", "score": 3, "replies": [{"body": "Yep, they are OK with letting some steam blow off in the market. We just had the worst September in 18 years and one of the fastest corrections in history and not a peep from the Fed or Trump.\n\n3 months ago if the market dropped 1% Trump would schedule a press conference with the sole intention of pumping the market back up.", "score": 2, "replies": []}]}]}]}]}
{"title": "AAPL Going Down.", "selftext": "[deleted]", "id": "j0xxqu", "created_utc": 1601237434.0, "score": 28, "upvote_ratio": 0.66, "num_comments": 57, "comments": [{"body": "1st: Corona market crash is not really a bear trap\n\n2nd: Look at Mastercard, Visa, ... they all look the same at the moment. Either there is no correlation between your observation and the chart or there is huge market crash coming up", "score": 60, "replies": [{"body": "what if the whole stock market was a bull trap all along 😳", "score": 13, "replies": [{"body": "*Insert always has been astronaut meme*", "score": 3, "replies": []}]}, {"body": "Tech correction is happening, chart is a bit of a joke I found somewhere online but yeah things are going down.", "score": -34, "replies": [{"body": "Maybe you’re right, maybe not. If not, im assuming you will blow up your account. Do you hold any calls at all?", "score": 1, "replies": [{"body": "I have putssssss", "score": 1, "replies": []}, {"body": "Puts on QQQ only.", "score": 1, "replies": [{"body": "Today didnt bode well for those", "score": 1, "replies": [{"body": "We'll see, low volume overall today, Pelossi says she wants to reach a stimulus deal but I'm betting it won't go through, if it does than my puts are dead but I'm waiting it out.  If no stimulus new until the end if the week than I see these printing.\n\nRemindMe! 5 days", "score": 0, "replies": [{"body": "I agree that the stim likely wont pass, but depending on how far OTM and your DTE your puts could be dead by then", "score": 1, "replies": [{"body": "I bag holding 10/16 puts, FOMO bulls are killing me but I'm thinking stimulus doesn't go through this week then October is back to being red.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "What about the iPhone 12?", "score": 14, "replies": [{"body": "Apple is supposed to release 5g news this week or next as well", "score": 9, "replies": [{"body": "I think it's up the last few days in anticipation of iPhone and 5g", "score": 2, "replies": []}]}, {"body": "What about it? I mean everyone knows it’s coming. Idk why this is such a catalyst. It feels priced in to me", "score": 2, "replies": []}, {"body": "Hasn't the debut been moved to Oct 13th? I don't see that as a strong enough catalyst.  Tesla battery day was all hyped up too and it didn't do much.", "score": 1, "replies": [{"body": "Tesla’s PE is the major reason for the reaction after battery day. That’s not the same case with Apple.", "score": 4, "replies": [{"body": "Tesla's ridiculous P/E has not mattered to the market for two years.....why does it suddenly matter now?", "score": 2, "replies": []}]}, {"body": "i totally agree. the stock went down after the iPhone X launch and i doubt Apple can produce something more revolutionary than that rn.", "score": -1, "replies": []}]}, {"body": "They have yet to say anything about the iphone 12", "score": -1, "replies": []}]}, {"body": "Oh man been seeing this periodically since the 2018 mini crash 🤣\n\nI hope no one is actually opening/closing positions based on Reddit posts and does their own DD", "score": 32, "replies": [{"body": "Tech is going down, lockdowns are not happening, stimulus is not happening, and if Biden starts leading the polls than that's a big risk for tech.  Institutions and smart money are taking their profits and moving to sectors with fairer valuation. Good luck.\n\nRemindMe! 5 days", "score": -39, "replies": [{"body": "“If Biden starts leading in the polls”\n\nBiden has led in the polls for over 6 months. Bigly.", "score": 43, "replies": []}, {"body": "Yeah I mean you've just given a few examples of you doing your own thinking. Go ahead and position yourself accordingly.\n\nI was more talking about people who literally open/close positions because of something they see on stock twits or reddit influencing their emotional state rather than themselves practically thinking through and coming to a conclusion - whether they end up right or wrong is regardless (for this discussion).\n\nThat said, I do not see a huge downfall coming any time soon UNLESS Biden actually has a chance at winning. Some polls show him winning now, but those would be the same polls that showed HRC winning in '16 as well anyway...", "score": 4, "replies": []}, {"body": "There is a 60.0 minute delay fetching comments.\n\nI will be messaging you in 5 days on [**2020-10-02 20:54:59 UTC**](http://www.wolframalpha.com/input/?i=2020-10-02%2020:54:59%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/smallstreetbets/comments/j0xxqu/aapl_going_down/g6vy3jc/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fsmallstreetbets%2Fcomments%2Fj0xxqu%2Faapl_going_down%2Fg6vy3jc%2F%5D%0A%0ARemindMe%21%202020-10-02%2020%3A54%3A59%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20j0xxqu)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "Biden has been leading since the polls started", "score": 1, "replies": []}]}]}, {"body": "Your mom’s going down", "score": 16, "replies": [{"body": "Solid dd right here.", "score": 4, "replies": []}, {"body": "*been going down", "score": 4, "replies": []}]}, {"body": "Your 14IQ logic here is connected to nothing actually true", "score": 10, "replies": [{"body": "No stimulus, true.  Election risk, true.  Tech overvalued, true.  Institutions rotating into other sectors, true.  Q3 earnings risk, true.  What's your argument for $AAPL, iPhone 12 announcement + stonks only go up?", "score": -1, "replies": [{"body": ">No stimulus, true. Election risk, true. Tech overvalued, true. Institutions rotating into other sectors, true. \n\nAll of these have been true for months.", "score": 1, "replies": []}, {"body": "Nah, stimulus was suppose to go through for $1 trillion before election but hasn't. The only reason stocks went up today is because Pelossi said deal can still be made.", "score": 1, "replies": []}]}]}, {"body": "I can see it going to 80s/90s\n\nat the end of the day it's a really good company, it won't fall so far as the meme above suggests\n\nat least not this year", "score": 5, "replies": []}, {"body": "I swear to god bears were pulling out this exact graph in April trying to scare people away from the V shaped recovery. \n\nThe moment we don’t get 13 green days in a row people think the sky is falling.", "score": 7, "replies": [{"body": "The moment we get 2 green days in a row people think we're going back to ATH in a week without any catalyst.", "score": 1, "replies": [{"body": "Your only reason for thinking it’s going down is something that was priced in 6 months ago. There is no substance here, just another dude getting his tendies taken by JPOW.", "score": 1, "replies": [{"body": "No, stimulus was not priced in, institutions were pricing in $1 trillion stimulus which isn't happening.", "score": 1, "replies": [{"body": "You speak Like the us isn’t practically completely open, ignoring the virus completely. You don’t even understand why the markets are down in first place. You just grabbed some random ridiculous graph to justify your (completely outdated and wrong) opinion. \n\nAnd btw, there was a 1 trillion dollar stimulus. You’re just expecting them to do that every month In order to “sustain” the economy and reach new highs, but that couldn’t be further from the truth. That’s how you blow the value of a currency and create inflated stock prices.", "score": 1, "replies": [{"body": "I'm not ignoring the virus, tech went up because of lockdowns but lockdowns are done and there is no second wave of lockdowns happening.  Institutions were pricing in that a second round of stimulus would be 1 trillion, Congress isn't passing anything this week, plus the added risk of Dems winning will be bad for tech.", "score": 0, "replies": [{"body": "Please gracefully explain how you linked dems winning to some kind of tech market crash, when they’ve been leading the polls during the craziest bull run anyone has seen. \n\nSeems like you’ve been looking at too much Stockwits trump propaganda.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Inverse this guy. AAPL Going Up!!", "score": 6, "replies": [{"body": "Inverse WSB and SSB, we're doing down!", "score": 0, "replies": []}]}, {"body": "I think we are already down and right now is the bubble burst.", "score": 5, "replies": []}, {"body": "so wait for AAPL to fall, buy the dip and sell on the run-up to the upcoming phone release; fuckin genius.", "score": 2, "replies": []}, {"body": "Rip my 200 apple call", "score": 2, "replies": []}, {"body": "I loaded up on apple puts last friday and everyone told me im crazy. Im fucking scared that im gonna loose it all again.\n\nIm scared because yahoo finance upgraded apple to bullish short term and everyone seem to think im crazy", "score": 2, "replies": [{"body": "Got me some tooo", "score": 2, "replies": []}, {"body": "!remind me 4 days", "score": 2, "replies": [{"body": "I will make tendies!! Wait and watch!!", "score": 2, "replies": []}, {"body": "*👀 Remember to type kminder in the future for reminder to be picked up or your reminder confirmation will be delayed.*\n\n**rprookie**, kminder in **4 days** on [**2020-10-02 03:46:22Z**](https://www.reminddit.com/time?dt=2020-10-02 03:46:22Z&reminder_id=7b2c63fc9bf549aba80fd4558d8cc71a&subreddit=smallstreetbets)\n\n> [**r/smallstreetbets: Aapl_going_down**](/r/smallstreetbets/comments/j0xxqu/aapl_going_down/g6x5zo8/?context=3)\n\n> kminder 4 days\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-10-02T03%3A46%3A22%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fsmallstreetbets%2Fcomments%2Fj0xxqu%2Faapl_going_down%2Fg6x5zo8%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Add email notification, Update message, and more options here**)](https://www.reminddit.com/time?dt=2020-10-02 03:46:22Z&reminder_id=7b2c63fc9bf549aba80fd4558d8cc71a&subreddit=smallstreetbets)\n\n**Protip!** We are lean and mean and stay in motion to serve people. If there is any change you want, contact us by email.\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Donate](https://paypal.me/reminddit)", "score": 1, "replies": []}]}]}, {"body": "You technical \"analysis\" wackjobs always make me laugh.", "score": 2, "replies": []}, {"body": "Ok so you had three weeks to buy into the dip and during the correction...but ok, cool.", "score": 1, "replies": []}, {"body": "People who post shit like this should get banned.", "score": 1, "replies": [{"body": "People that FOMO into trades should get banned, lockdowns are over and no stimulus is happening you really think tech valuations can hold up much longer?", "score": 1, "replies": []}]}, {"body": "Nice", "score": 1, "replies": []}, {"body": "Retards like you make me feel good about my calls", "score": 1, "replies": []}]}
{"title": "big $AAPL short squeeze tomorrow confirmed before bear feast", "selftext": "", "id": "j10o23", "created_utc": 1601247279.0, "score": 1290, "upvote_ratio": 0.96, "num_comments": 56, "comments": [{"body": "Apple gonna moon tomorrow", "score": 182, "replies": [{"body": "[deleted]", "score": 44, "replies": [{"body": "First the bear trap. Then the bull trap. It just alternates days. Monday Nasdaq up 2%. Tue down 2%. Wed up 2%. Thurs down 2%. Friday up 2%. Ok.. I think I’m catching on..", "score": 17, "replies": [{"body": "Join KANG Gang", "score": 2, "replies": []}]}]}, {"body": "Yep. The whole market is going to open as green as a stop sign!", "score": 28, "replies": [{"body": "Hey just to let you know stop signs are red", "score": 5, "replies": [{"body": "Yeah but the market isn't thanks to my prediction. You're welcome for my cervix.", "score": 4, "replies": []}]}]}, {"body": "Currently up 1%", "score": 1, "replies": [{"body": "I mean’t tomorrow as in tomorrow", "score": 3, "replies": []}]}]}, {"body": "why am I aroused by this?", "score": 36, "replies": [{"body": "We all know you touch yourself at night", "score": 22, "replies": []}]}, {"body": "Squeeze that 🍏", "score": 60, "replies": []}, {"body": "Now THIS is proper DD 👏🏽👏🏽", "score": 47, "replies": [{"body": "nobody knows when to squeeze an apple better than an apple tree", "score": 17, "replies": [{"body": "Bet this photo was taken in Timmy cooks backyard.", "score": 3, "replies": [{"body": "Tim cook likes being in guys backyards", "score": 5, "replies": []}]}]}]}, {"body": "Apple is definitely going up. My exercised calls are all the proof you need. Your welcome.", "score": 57, "replies": [{"body": "Selling naked calls is not a long term profitable strategy due to studies as stock only go up", "score": 25, "replies": [{"body": "But then you end up with the stock, which will then only continue to go up right?", "score": 1, "replies": [{"body": "You end up short the stock", "score": 1, "replies": [{"body": "Oh shoot, was thinking puts for some reason.\n\nI promise my spreads work out. >.>", "score": 1, "replies": []}]}]}]}]}, {"body": "Bears r fuk.", "score": 18, "replies": []}, {"body": "Everyone knows fall is Apple season. Prepare to bake those tendies bois.", "score": 27, "replies": [{"body": "Turnovers incoming mmmmmm", "score": 6, "replies": []}]}, {"body": "I just want to make my money back. Invested a lot at 122. Hopefully can recover.", "score": 8, "replies": []}, {"body": "I have no idea what happens beyond October, but I really have trouble understanding anyone betting against aapl here. New phone heading into earnings...it’s so obvious. I got a fuckload of calls cheap. Wouldn’t mind a dip to get more. But October belongs to aapl.", "score": 8, "replies": []}, {"body": "You can squeeze the APPL but it will not pop", "score": 17, "replies": []}, {"body": "How much we thinking\n\nEdit: fuck it 5k in by tomorrow morning gimme a milly", "score": 5, "replies": []}, {"body": "Idk. Supposedly this is mm dumping shares after short calls exp. If iv I'd down calls might be cheaper again might take a few weeks. Prob gonna churn sideways. Might be the time to be short put spreads but theres more premium elsewhere.", "score": 3, "replies": []}, {"body": "Big brain. Look for signs everywhere, even on r/mildlyinteresting", "score": 2, "replies": []}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Fibonacci sequence is based off pi, pi can be found in nature, apples are found in nature this the best dd ever", "score": 2, "replies": [{"body": "Apples are good in pi", "score": 2, "replies": []}]}, {"body": "Poor apple", "score": 2, "replies": []}, {"body": "This image reminds me of my balls getting squeezed by my legs", "score": 2, "replies": []}, {"body": "LETSGOOOOOOOOOOOOOOOOOOOO", "score": 3, "replies": []}, {"body": "🍏🍏🍏", "score": 1, "replies": []}, {"body": "This is the DD I subscribe for", "score": 1, "replies": []}, {"body": "Looks like apple got impaled. Puts it is", "score": 1, "replies": []}, {"body": "🍏🚀🚀🛰🌖", "score": 1, "replies": []}, {"body": "Sodomy", "score": 1, "replies": [{"body": "And homosexuality in Uganda", "score": 1, "replies": []}]}, {"body": "It's either the tree's birthday or the apple's birthday", "score": 1, "replies": []}, {"body": "I wanna feed the Bull", "score": 1, "replies": []}, {"body": "On this day... tomorrow ?", "score": 1, "replies": []}, {"body": "quick. I just came on my MacBook. how do I clean up?", "score": 1, "replies": []}, {"body": "I’m going all in, YOLO! 😂", "score": 1, "replies": []}, {"body": "$AAPL will go up, according to my doctor.", "score": 1, "replies": []}, {"body": "Finally everyone remembered about good company and forget Tesla.", "score": 0, "replies": []}, {"body": "it will moon before the slaughter fest of blood red. careful bulls. tred lightly..", "score": -2, "replies": []}, {"body": "Sideways or bear. As much as I'd like to see it go up, I don't think it's going to rise much this week.", "score": -6, "replies": [{"body": "Would love to hear your positions capitalizing on this crack analysis.", "score": 1, "replies": [{"body": "It's expected to slowly push up, but Short interest is high so it will likely swing back and forth. It could be going up to 119 by Wednesday and coming back down to 113 by Friday.", "score": 2, "replies": [{"body": "based on", "score": 1, "replies": [{"body": "Look at the information from analysts that are covering, their average prices and even just the Nasdaq data. It just broke 20 day MA in AH, and Friday was up in large buys compared to large sells.", "score": 2, "replies": []}]}]}]}]}, {"body": "Last uptick before the crash.", "score": -2, "replies": []}]}
