{"title": "Just went all cash. Bearish for the next couple weeks. 🐻", "selftext": "Put all my positions to close at market open. Market trending down despite earnings beat from the big guys. \n\nI’ve a really bad feeling that another lockdown is coming for the US. \n\nHad a dream that SPY dropped to the 150s. \n\nAnyone who lived through the 2008 crash feel like the first nosedive in March was the smaller one?", "id": "hwz7ez", "created_utc": 1595585477.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 52, "comments": [{"body": "Old man shouts at cloud", "score": 27, "replies": []}, {"body": "Yknow they say dreams are opposite from reality", "score": 6, "replies": [{"body": "No because my cat said go long on spce", "score": 9, "replies": []}]}, {"body": "A lockdown is never coming again. You now have to worry about the unemployment numbers (17M), them losing $600, losing rent protection, losing loan/mortgage protection, no more PPP loans.\n\nThat’s the catalyst for another tank when it all goes away and could be July 31. I’ve already sold 37% of my value yesterday as well.", "score": 8, "replies": [{"body": "Judging by the way things are going, we won’t see eviction prohibition. We won’t see rent protection. We will probably see PPP loans and extension of unemployment benefits.", "score": 3, "replies": [{"body": "Would this pump or dump the market though?", "score": 0, "replies": [{"body": "Pump. Money eventually finds its way into things that cannot be printed away.", "score": 2, "replies": []}, {"body": "What do you think will happen when less people can afford to buy anything?", "score": 0, "replies": [{"body": "Dump", "score": 1, "replies": [{"body": "Market will be fine for the most part up until Q3 numbers come out. It’s going to be a blood bath. Still, not saying market won’t crash before that.", "score": 1, "replies": []}]}, {"body": "Why would you believe this guy", "score": 0, "replies": []}]}]}]}, {"body": "I’m diverging from stocks a bit here but Any other sensible government would call for another lockdown though. (not an American) \n\nTens of thousands of lives are worth more than the trillions lost in another lockdown.", "score": -3, "replies": [{"body": "Deaths here are still in a decline from what they were from March/April. Yes, cases are up but testing has ramped 10x since the beginning but death are not following.", "score": 5, "replies": []}, {"body": "You don’t know shit you don’t even live in the us", "score": 1, "replies": []}, {"body": "You don't understand FoxNews controlled GOP in American politics. It's a cult. There were people saying they would happily kill themselves if Donald could be elected president again. Mind you these are simple numb nuts making minimum wage or something barely above that", "score": -8, "replies": [{"body": "I see so many gwneralizations here I’m not even gonna try", "score": 3, "replies": []}]}]}]}, {"body": "Not gunna lie the market has been acting very strange, but I feel that next week will seen some better gains", "score": 3, "replies": []}, {"body": "I'm debating whether or not I should. My portfolio is all canadian.", "score": 2, "replies": []}, {"body": "then why no silver/gold", "score": 2, "replies": [{"body": "Because gold and silver both ATH", "score": 2, "replies": []}, {"body": "Gold crashes when markets crash. That's because investors dump everything they have. Once the Fed announces QE to stop the the cras then Gold rises", "score": 1, "replies": [{"body": "doesn't seem to hold in practice\n\n[https://goldsilver.com/blog/if-stock-market-crashes-what-happens-to-gold-and-silver/](https://goldsilver.com/blog/if-stock-market-crashes-what-happens-to-gold-and-silver/)", "score": 1, "replies": [{"body": "Didn't silver drop to $12 in March?\n\nYou linked a baised website that sells gold", "score": 3, "replies": [{"body": "you're right about that. silver dropped as much as anything else then recovered better than most. point is that they're somewhat uncorrelated assets, gold especially. nothing is a guarantee i guess, cash isn't either", "score": 1, "replies": []}]}]}]}]}, {"body": "We’ll see at least one more upturn when the second stimulus comes. I will be selling a lot of my portfolio the minute everything goes through the roof that week. In the meantime I will continue to buy in on these beautiful lows!", "score": 2, "replies": [{"body": "When? Don’t you mean if? I feel as though the Dems Would spite the GOP and not pass the next stimulus bill just to get a hold on the next election.", "score": 1, "replies": [{"body": "If they do that though the GOP and Trump are gonna jus tear into them about not actually caring about people dying and struggling. That would most likely ultimately inhibit a dem win in nov", "score": 2, "replies": []}]}]}, {"body": "To.many variables rn... Smart move!", "score": 2, "replies": []}, {"body": "Awesome . All time highs when not economic growth in the country is basically favouring of “big tech “ stocks . Wait for the crash or a bearish phase", "score": 2, "replies": [{"body": "I’d say the last week has been extremely mixed and volatile. Difficult to tell what’s happening", "score": 1, "replies": [{"body": "It’s time to realize some gains and wait and watch . Buying was during march not rn for true investors .", "score": 2, "replies": []}]}]}, {"body": "The democrats cannot afford to do what they pulled in 2008 and don't seem to have much interest in doing so anyway (house democrats at least), the much better question is \"when\" on 1 more final stimulus, and what your reaction is going to be on some kind of unemployment not being extended past July 31st initially, but the most likely outcome is we will see 1 more signed stimulus sometime in the next 2-3 weeks. \n\nThey know if they were to pull petty games that Trump is going to take advantage of that and absolutely body slam them later on with his mouth (not that I like him, I don't and I'm not voting for him, but this is his game). The better question is if both can meet in the middle.\n\nEdit: But I am interested in seeing if we can bounce around 3k/25k eventually again. I think we're stuck in a range and doing that would only confirm.", "score": 2, "replies": []}, {"body": ">Anyone who lived through the 2008 crash feel like the first nosedive in March was the smaller one?\n\nThis is nothing like 2008. Charts represent an effect, not a cause.", "score": 1, "replies": []}, {"body": "How dare you disrespect my kind... the JPows?", "score": 1, "replies": []}, {"body": "No one cares", "score": 1, "replies": []}, {"body": "Stock rally confirmed", "score": 1, "replies": [{"body": "This isn’t WSB..", "score": 1, "replies": []}]}, {"body": "Don’t need to worry about another lockdown, worry about the us China relation, thx to big mouth trump. It looks like he does this whenever the market is ATH, prepared for another market crash", "score": 0, "replies": [{"body": "I hate to time the market and I’ve never tried but things feel very ominous over the next few weeks.", "score": 0, "replies": []}, {"body": "Love to see china market crash tho", "score": 0, "replies": [{"body": "Lol what good does that do to you? 99% American retirements tie to the market. Let say if the market down like in March 30%, oh snap you just lost 30% of money in ur retirement then u about to retirement, bang IRS hit u with a tax bill. You don’t have enough dough to cover all expenses. So it’s shet for u, this 1 of the reasons fed save the market.", "score": 1, "replies": [{"body": "Doesn't matter to me, I wanna see the commies in the ground", "score": 0, "replies": []}]}]}]}, {"body": "Smart man", "score": 0, "replies": []}, {"body": "Yeah I can tell from ur name, a dick being a dick lol.", "score": -1, "replies": [{"body": "I dont support commies, simple as that", "score": 3, "replies": []}]}, {"body": "Neither scenario is happening. Back in March, everyone was taken unawares. If there is a second lockdown, the Fed would still keep pumping money in and there won’t be a dip.\n\nAlso, the pols know that the economy would hit the crapper if they don’t pass the bill. They are going to pass it. The worst case scenario is if they take an extra day or two to pass it. In that scenario, we may see a dip for those days but it is unlikely to be as big a dip as March.", "score": 0, "replies": [{"body": "Someone made a post here recently that in the election year 2008 they purposely didn’t pass a similar bill to make the Bush administration look incompetent which led to the biggest dive. I won’t be surprised if the dems do the same to donny", "score": 3, "replies": [{"body": "If they wanted to do it, why not do it the first time around? Anyway, we’ll find out over the next week.", "score": 1, "replies": [{"body": "Much Closer to election date now. Timing is everything.", "score": 2, "replies": [{"body": "The risk of inaction is different this time. Bush was not up for re-election and McCain was not a populist.\n\nIf the Dems do not pass the bill, Trump will seize on it.\n\nIf they play that game again, they would need to be smarter about it.", "score": 2, "replies": [{"body": "They could be and say a stimulus is not the best way to go about it and put forward some other suggestion which the GOP will refuse.", "score": 1, "replies": [{"body": "True.\n\nDespite the obvious political benefits (and the market opportunities it might create), I don’t like it. The prospect of politics hurting the lives of people who have fallen on hard times through no fault of their own is not pleasant.\n\nBut this is hardly the sub for that discussion so I will stop now.", "score": 2, "replies": []}]}]}]}]}]}]}]}
{"title": "AMD propping up my whole portfolio yesterday and today", "selftext": "Everything's getting killed but somehow this little chip manufacturer that could has spiked hard enough to balance out almost all the loss from everything else. It's been carrying the team right now since yesterday afternoon. No idea how long its gonna keep rising but it hasn't stopped yet.", "id": "hx22ds", "created_utc": 1595598407.0, "score": 68, "upvote_ratio": 0.81, "num_comments": 59, "comments": [{"body": "AMD up 14% and INTC down 14%, what  a day", "score": 44, "replies": [{"body": "Perfectly balanced", "score": 11, "replies": [{"body": ". . . [as all things should be](https://youtu.be/Vx5prDjKAcw)", "score": 9, "replies": [{"body": "As all things [are](https://i.kym-cdn.com/entries/icons/original/000/016/212/manning.png)", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "TSM up 8% as well", "score": 1, "replies": []}]}]}]}]}]}, {"body": "AMD is single handily making my portfolio green today. Them and LULU are the only things positive for me and I’m up a ton today (about 1.2% positive)", "score": 16, "replies": [{"body": "You must have a lot of AMD and Lulu then.", "score": 2, "replies": [{"body": "Yea...my biggest two holdings(due to their growth though). They combine for around 25% of my portfolio. Because of them I ended up 1.7% today with just those two as my green holdings with everything else red", "score": 1, "replies": []}]}]}, {"body": "Both AMD and TSM Today. Intel missed earnings and said it's delaying at least 6 months their 7nm chip. They were down like 18% last time I checked.\n\nSo, people are picking AMD as the current winner and growth potential, and TSM is likely the manufacturer to help Intel do their 7 nm chips, they already work with AMD and Apple.  That, and Apple moving to their chip design, using TSM,  and how much support the tech community is giving to AMD, how much shit Intel has been taking from them as well is the right equation, for now.  Intel led for so long it looks like they have been taking a nap.\n\nI'm so happy I didn't give up on my AMD and TSM shares all this time.", "score": 22, "replies": [{"body": "Thanks for this info. TSM wasn't on my radar at all but ill keep a close eye on them as well.", "score": 6, "replies": [{"body": "Check man, solid company with good balance sheet", "score": 1, "replies": []}, {"body": "TSM is a solid company", "score": 1, "replies": []}]}, {"body": "I'm wondering if it's too late to buy shares of AMD now. Thinking of adding shares to my Roth.", "score": 4, "replies": [{"body": "Short term wise, I believe ~$60 to be fair value\n\nIf you believe in the future growth of the company go for it.\n\nAMD is gonna be solid for at least the next 2 years.", "score": 1, "replies": []}]}, {"body": "MU over here dropping.", "score": 3, "replies": [{"body": "Do you know the reasoning for MU falling?", "score": 1, "replies": [{"body": "Not a clue. Should be fine long term.", "score": 3, "replies": [{"body": "I agree. I am not really worried. Just was curious cause I dont really see the connection that would reflect badly on MU.", "score": 3, "replies": [{"body": "Neither do I. Could just be people selling and going over to TSM and AMD since they are going up?", "score": 3, "replies": []}]}]}, {"body": "People's expectations are too high.", "score": 1, "replies": []}]}]}, {"body": "*INTC beat earnings by a bit but lowered future guidance", "score": 1, "replies": []}]}, {"body": "I sold half my AMD holdings when the stock hit 62. up 170% from the share price I bought in at. When everything else was red in my portfolio. \nI just wanted to make sure I had some profit from it. I'm excited to see where AMD goes.", "score": 7, "replies": [{"body": "Same thing here. Sold half today at 67.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Why not? Honest question.", "score": 3, "replies": []}, {"body": "Because the dude made 150%+ profit? Don’t be greedy, take some profits", "score": 1, "replies": []}, {"body": "yeah reddit simps think a number matters more than company fundamentals", "score": 0, "replies": []}]}]}, {"body": "Do you guys think there will be a dip after earnings? I wanna increase my holdings in AMD, I hadn't bought a lot since I have NVDA too", "score": 5, "replies": [{"body": "I’m up in the air on it think that even if they miss expectations their forward guidance will be strong with this news of Intel along with the new consoles coming out later this year using their chips.", "score": 2, "replies": [{"body": "Could be like Microsoft where they hit their expectations and plummet anyway lol.", "score": 2, "replies": [{"body": "I wouldn’t doubt it either just gives a price to buy in at then", "score": 1, "replies": []}]}]}]}, {"body": "and here I sold amd two days ago because it wasn't moving.", "score": 5, "replies": []}, {"body": "$66 was likely the limit here but what do I know. Got out of some Leaps at a profit", "score": 3, "replies": [{"body": "It was exactly 69 when I checked and I was like \"haha funny sex number should check reddit\"", "score": 2, "replies": [{"body": "I have screenshots of nvidia at 420 and amd at 69. Gonna frame them.", "score": 5, "replies": [{"body": "I’ve got a screenshot of that sweet sweet Nvidia “$420.69” price point", "score": 4, "replies": []}]}]}, {"body": "Haha ya, the upward trajectory stopped just as I finished making this post. Oh well, set the trailing stop loss for today anyway. If it hits then thats that.", "score": 1, "replies": []}]}, {"body": "Yesterday would of been a good day to buy a call lol", "score": 3, "replies": [{"body": "Last I checked some are up 9600% since yesterday, absolutely bonkers", "score": 2, "replies": [{"body": "What strikes & dates? Just curious.", "score": 1, "replies": []}]}, {"body": "I bought ours and got fucking destroyed", "score": 1, "replies": []}]}, {"body": "I should've never sold any of the shares I bought in when it was at $52", "score": 3, "replies": [{"body": "I bought my first shares about 10 months ago at $31.93 share. Bought some more in June at almost $54. My only regret is that I didn't have more money back at $32/share to buy even more.", "score": 5, "replies": []}, {"body": "I sold at $52 and I deeply regret it.", "score": 3, "replies": []}]}, {"body": "Sold at 68.7. will probably buy back in at the next pullback.", "score": 3, "replies": [{"body": "I hope there will be another one because I want to get back in too.", "score": 1, "replies": []}]}, {"body": "Damn up over 11% today", "score": 1, "replies": []}, {"body": "INTC falling hard right now", "score": 1, "replies": [{"body": "Honestly, I think the Intel drop is a huge over reaction. Give it a week and they should start steadily climbing again. I probably going to move my AMD gains over into Intel when AMD starts its inevitable pullback and then just go back and forth.", "score": 4, "replies": [{"body": "I've just done exactly this.", "score": 5, "replies": []}, {"body": "Yeah I don't believe INTC should be down 16% today, but what do I know", "score": 3, "replies": []}]}]}, {"body": "Sounds like a little rebalancing may be in order", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Ive got weak hands too. Sold at $69 because I got scared and seems to be holding throughout the day. I may just jump back on Monday after the morning dips. At least profits are locked and I can play the wait and see game.", "score": 2, "replies": []}]}, {"body": "sold my 60C @ 400%\n \nI didnt want to lose it like I lost out on AAPL. it was up as much as 450% two-three weeks ago. now it's down some 70%", "score": 1, "replies": []}, {"body": "K", "score": 1, "replies": []}, {"body": "Me too.  LOL.", "score": 1, "replies": []}]}
{"title": "That's my tsla!", "selftext": "", "id": "hx50jw", "created_utc": 1595608490.0, "score": 238, "upvote_ratio": 0.95, "num_comments": 50, "comments": [{"body": "<tinfoil hat> I was thinking this exact same thing.  The price now is in line with the price predicted instutions would be paying (not sure where that post is).  Not sure how this could be orchestrated, though, without a notice in number of shares, volume, etc.  I suppose the volume was higher yesterday and today, though....  Any change in # of shares?  Like I said, I'm not doubting that it is possible, but I haven't heard anything that would point to evidence for it.  Kind of hard to hide something like this? </ tinfoil hat>", "score": 18, "replies": [{"body": "All you have to do is have enough machines trading the same few shares around\n\nHave one machine but your shares for lower than you bought, then you buy for Lower than they bought.. back and forth a million times a second and then all of a sudden buy a fuck ton of um", "score": 9, "replies": [{"body": "That’s illegal, but not saying it doesn’t happen", "score": 7, "replies": []}, {"body": "Oh, I want one of these machines.", "score": 6, "replies": [{"body": "the fed sells them but you have to have a money printer to buy one", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "not when its the fed doing it", "score": 6, "replies": []}]}, {"body": "who pays for the losses??", "score": 2, "replies": [{"body": "What? The shareholders who sell at the bottom I guess", "score": 2, "replies": [{"body": "if this theory of machine trading in this way was true, on every trade down they would make a loss", "score": 1, "replies": [{"body": "You have no idea the amount of money they have.", "score": 1, "replies": [{"body": "yeah but LOSING the same amount just to buy them back cheap maks NO sense in any case", "score": 1, "replies": [{"body": "If you are trading your own shares around you don’t lose anything other than a temporary unrealized loss. But if the market moves because of what you’re doing, you can then start buying a lot of shares when it’s low. This will start pulling the price up\n\nBig players do this all the time to drop the price of a stock on a Friday just so all the options they sold will expire worthless. Then the stock bounces right back to where it was on Monday", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Doesn’t work. What stops others from buying the stock and the price simply shooting up the second you try buying more back? If you try selling below the current bid price, it will simply be sold at the bid price. So you would have sell enough shares to get through all the buyers which there be abundantly of because otherwise you would not need to manipulate to begin with. Then you try buy back even more than you sold and the price would go above the level you started with, since again the demand is healthy.", "score": 1, "replies": [{"body": "Um I think you have more to learn", "score": 0, "replies": []}]}]}, {"body": "This is exactly what I was thinking too.. because it doesn’t make sense.  \n\nBut if you look at the day it was the first time Tesla’s movement was almost in sync with the SPY.", "score": 2, "replies": []}]}, {"body": "no memes while the market is open ??\n\n&#x200B;\n\nWHAT ????", "score": 7, "replies": [{"body": "How else will I survive the day?!", "score": 2, "replies": []}]}, {"body": "“Cheap”", "score": 4, "replies": []}, {"body": "Removed for now: as mentioned in the daily thread, memes will be permitted after market close.\n\nFor whoever reported: No, we don't plan for this to be a regular thing. Just people wanting to blow off some steam.", "score": 1, "replies": [{"body": "Please, don't allow memes at all. They're just noise and have killed subs I've loved in the past, drowning out useful content with easily consumed shit.", "score": 1, "replies": [{"body": "Agreed.  Perhaps during off market hours on the daily thread it's tolerable.  But to have a thread just for a meme it's not up to par with a serious investment sub.", "score": 2, "replies": [{"body": "Unfortunately we can't pin more than 2 threads, so we can't do a daily/weekly/monthly meme thread without it either being buried pretty fast or replacing the (more) reasonable threads we have now.", "score": 1, "replies": []}]}, {"body": "There's no intention to make this a common occurrence. Honestly, we're pretty happy with the status quo of post curation that we have now, this is just a morale moment on a weekend that doesn't have any expected news beyond \"here's the umpteenth re-hash of what happened this week\". If something really major happens, we can always remove the memes.", "score": 1, "replies": []}, {"body": "I agree with you the majority of the time, but after the last couple of days, I think we could all use a few memes to help us laugh it off.", "score": 1, "replies": [{"body": "Plus, we just got 4 quarters of profitability and the announcement of a new giga-factory, both are surely deserving of some celebration!", "score": -2, "replies": []}, {"body": "Laugh it off? It's investing, sometimes they go up, sometimes they go down. It's not memes that you need, it's a different and more realistic perspective on investing.\n\nDon't live a long term stock day to day to the point you think you need memes to get over normal things. It's not healthy.", "score": -2, "replies": [{"body": "There is a time and place for serious analysis and contemplation, it should be frequent and lengthy. There is also a time to relax, lighten up a little, and have some fun.\n\n If there were ever a time to do this in a Tesla investors forum, wouldn't it be on the weekend, between the bells, after a historic quarter?", "score": 1, "replies": [{"body": "As you said there's a time and a place. I like this place for its serious content without having to wade through a ton of crap.\n\nTalking about a time and a place for certain things, why not use one of the other subreddits for the memes? \n\nWall Street bets is a place I look at now and again for comedy when I want that, but here? Why devalue a sub that has good content with meme noise?\n\nIt's better for this sub to be quiet when there's nothing much happening, because then the details pop out and don't get hidden by useless non-contributing memes. Quiet is ok. Its one of the main benefits of the subreddit system, separated content.\n\nBy the way, you completely ignored the point I was making in my last comment. I'm telling you it's a better way to lighten up than this sub dialing up to 11 on memes out of trading hours and a brain never resting.", "score": 1, "replies": [{"body": "There is a difference between the entire sub being full of memes that you cannot find serious content, and one or two memes being sprinkled in on occasion. As far as I can tell, they opened the sub up to memes after the close but this is the only one thats really been visible. I'm not too sure why you are painting it to be otherwise. \n\nMore to that point, the mods are already engaging in some amount of throttling by limiting the window in which memes are accepted. This seems perfectly reasonable to me. If there comes to be some kind of memegeddon as you seem to imply, well, they can reel it all in. All is well.\n\nI think we perhaps just share slightly differing perspectives on how we view this sub. That seems fine enough.", "score": 1, "replies": [{"body": "I'm not painting it to be anything. There's one meme now because most people don't think memes are ok on this sub. If the rules change longer term then the number of memes go up. That's guaranteed.\n\nI'm saying this because I've seen subs utterly ruined even when mods swore \"we won't allow too many memes on meme days\" but then you go there after a month and again years later and there's maybe one serious post and the rest are memes. Noise, no signal. \n\nAgain, in your comment you're ignoring the points I'm making and just trying to talk around them.\n\n1. Memes aren't what's going to help you. Getting your head out of the day to day price is what will help you. This is a long term stock, you know that I'm sure. Why stress yourself? Open a window, listen to birds or go for a hike or something (I'm not being fecetious, listen to nature, it's pretty relaxing). The world spins just like it did yesterday.\n1. There are numerous other subreddits for memes. There's one subreddit for serious discussion of Tesla investing. Quality over quantity here is important.\n\nAnyway, we're going around in circles and it seems like you want memes more than you want to actually understand my points, so it's probably time to end this discussion.", "score": -1, "replies": [{"body": "I respect that you want to preserve the integrity of this sub. Cheers to that!", "score": 2, "replies": []}, {"body": "You take yourself way too seriously. I hope you're old. If you're under 40, you need to loosen up a bit.", "score": 1, "replies": [{"body": "Please, I've seen it happen before and I don't want to see it again. That's not about needing to loosen up, it's just not wanting to see it again... Age doesn't come into it. \n\nYou barely even comment in this sub and comment in wallstreetbets all the time. Why not just post there?", "score": 1, "replies": [{"body": "Come onnnnn. You have to tell me if I'm right; Tell me your age.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Oh shoot, I misread that... sorry about that!", "score": 1, "replies": [{"body": "No worries. One hour to go", "score": 1, "replies": [{"body": "Perhaps all memes in their own daily thread? Just a thought.", "score": 3, "replies": [{"body": "We can only pin two threads at a time, we aren't getting rid of the weekly thread, and the daily thread *is* a meme, in spirit. No meme thread for the sub.", "score": 2, "replies": []}]}]}]}]}, {"body": "Institutions buying would increase the price significantly. So its not the case.", "score": -8, "replies": [{"body": "Buying has not yet begun.", "score": 15, "replies": [{"body": "Oh oh ohhhh when it does 🥴🍆👀😳🥰", "score": 7, "replies": []}, {"body": "You dont have any evidence for this do you?", "score": 1, "replies": [{"body": "what can I say? This meme is ahead of its time.", "score": 5, "replies": []}]}]}, {"body": "Perhaps the meme means that as it’s cheaper now by about 20% ,from the peak,  these institutions will be able to buy in “cheap”", "score": 8, "replies": []}]}, {"body": "I think we were all thinking the same thing. Remember what happened the last time someone artificially kept the stock down? We all got rich! What does that tell you now?", "score": 0, "replies": []}, {"body": "Or... gap down because tesla still loses money on every car sold.", "score": -6, "replies": [{"body": "BS", "score": 2, "replies": []}, {"body": "They make money on each car sold.", "score": 1, "replies": [{"body": "yes, they make a negative amount of money on each car. Luckily dor the time being they can offset it selling regulatory credits.", "score": 0, "replies": [{"body": "They spend more than they make as a company, not on cars. And that's because they reinvest so much.", "score": 1, "replies": []}]}]}]}]}
{"title": "Trade $TSLA to buy an actual Tesla?", "selftext": "", "id": "hx8dmp", "created_utc": 1595619147.0, "score": 14, "upvote_ratio": 0.78, "num_comments": 52, "comments": [{"body": "I’ve seen a lot of stories where someone couldn’t buy a Tesla and bought $TSLA instead. Fast forward a year and with appreciation they sold stock to buy the car. Fast forward another year and they’re kicking themselves for not sticking with $TSLA.\n\nHonestly at current valuation it’s not a bad idea to sell the stock for the car if you’ve always wanted the car.", "score": 20, "replies": [{"body": "I owned 138 shares (bought in around 700) and just recently sold 38 of my shares at around $1,500 to put a downpayment on a model X long range plus, 6 seater, FSD, with 22\" rims. Holding onto my other 100 shares for at least 10 more years. No plans to sell that unless I run into a situation where I absolutely need the money.", "score": 5, "replies": [{"body": "Congrats! 👏", "score": 6, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}, {"body": "So it is not just my imagination but could become true?\nI have only a few months in stock trading and forex trading and made my losses and profits (still in the red overall) so the concept of working towards my beloved car through its shares really keeps me going now.", "score": 4, "replies": [{"body": "When I bought my shares, I looked at what the shares would need to hit for me to get a Tesla (about $600) or get one from gains alone (about $850) or pay off my house (about $2,200). I never dreamed it would hit any of those marks so quickly, and now I really, really don't want to sell.", "score": 6, "replies": [{"body": "I feel you friend. I still don’t have a Tesla car...", "score": 3, "replies": [{"body": "I refuse to even take a test drive. I've heard they're very hard not to buy.", "score": 3, "replies": []}]}, {"body": "That is a fantastic result and by not selling and riding the bumpy road you might be able to do it all and still keep half of your position. Well played!", "score": 3, "replies": [{"body": "I have already taken out my entire original investment, so the $100k I have left in Tesla is all free money. It could go to zero and I'd still break even.", "score": 3, "replies": [{"body": "Wow, just... wow!", "score": 3, "replies": [{"body": "When it got under $200, I knew the value was there. It was based strictly on the value of Fremont and Shanghai, which was about to come online. I gave small secondary consideration to the strength of Cybertruck (as yet unveiled) and semi. ZERO consideration given to FSD or energy sector. That was enough to convince me that, at that price, it would out-perform the market.\n\nToday though? Shanhai is likely to double production shortly, and double it again within the year. Too much supply for the market? Maybe, but they can sell vastly cheaper without import taxes, with locally sourced parts, and with increased efficiencies likely to bring retail costs down further.\n\nGiga Berlin is screaming ahead.\n\nAnd Giga Texas will likely follow the pace of Gigas Shanghai and Berlin, since nothing is better or faster than it is in Texas, and the CyberTruck factory looks to only cost $1-1.3B for a plant capable of producing 300-500k units.\n\nI have zero interest in selling my balance. I'm saving that for when I retire, or when my kids sell it upon my death, or when they switch from a growth company to the sorts of blue chips that just sustain.", "score": 3, "replies": [{"body": "A very good insight into your thought process and thus in the decisions you make by holding the shares. This makes me super excited to buy more $TSLA when the market takes a little dip (I hope for it to go back to $800 just for one day but I highly doubt it). Thanks!", "score": 3, "replies": [{"body": "The secondary thought is that, if Shanghai could produce more than the billion consumers in that market could absorb, they could begin export. First to SE Asia, then to Australia/NZ, India, and beyond.\n\nMind you, while China is \"poor\" on average, they still have a vast, virtually untapped market of potential buyers who can afford these vehicles, and it's seen as a marquee brand there like it is in most of the world.\n\nIt will take them a long time to exhaust the market in China. Likely long enough to see the original MIC Model 3s wear out for replacement, and if not that, then for the Model 2 (or whatever the as-yet unannounced smaller variant will be) to swoop in and pick up all that production.", "score": 2, "replies": [{"body": "If all this and more happens Tesla will disrupt markets like I dream they will, thanks for your thoughts.", "score": 2, "replies": [{"body": "Way I see it, they have a bunch of ways to disrupt.\n\nThey can disrupt the auto industry by actually building the CyberTruck, and then a smaller car.\n\nThey can disrupt by bring the semi to market with the specs needed.\n\nAND they can do it with energy storage. Forget the big installations, I mean cars as massive distributed on-grid batteries.\n\nThen there's FSD.\n\nAny one of these could 2x the company, but if 2 or more of them come online, especially if they're first to market, the sky's the limit, baby.", "score": 2, "replies": [{"body": "I am getting ready to go to the moon then woohoo :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "It’s possible. My TSLA shares have reached the value of a Model 3 Performance by now. Been invested for about four years.", "score": 4, "replies": [{"body": "Wow have you gotten in at a great price man!\nAnd even now, or at least when it calms down a bit, I still feel TSLA shares are worth the price as the disruption possibilities are endless.\nAs soon as I have double the amount necessary I will pull the trigger, so like I wrote in the article, see you in 20 years ;-)", "score": 2, "replies": [{"body": "If you believe in the $1T+ evaluation, it’s just a matter of time. Will it be a bumpy ride? Most certainly.", "score": 1, "replies": [{"body": "Not so bumpy that my future Tesla ride can't smooth it out ;-)\nAnd yes I believe in it! Not just because of cars but because of the entire ecosystem that Tesla will create.", "score": 2, "replies": [{"body": "Absolutely agree! And forgot to answer: Yes, got in with an average price of $243.", "score": 2, "replies": [{"body": "Oh sweet! I initially got in under $700 but was greedy and wanted my profits a few days later. Of course that came with regrets all traders will have exprienced one way or another... But I am happy for you!", "score": 2, "replies": [{"body": "The best way to learn is from your mistakes 😉 Just hold 💪", "score": 3, "replies": [{"body": "And hope for some dips to buy more ;-)", "score": 2, "replies": [{"body": "Well, now seems to be a pretty good time actually 🤷‍♂️", "score": 2, "replies": [{"body": "When other positions hit the green well enough I am going to close them down and move more into $TSLA. I can not help it, I am just a fan and believe in them. Thank you and everyone else here for the support!", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "ARK says maybe 22k a share by 2024...", "score": 2, "replies": [{"body": "Even half of that would secure my wishes. Now to find a broker that actually lets me trade ARKK from the Netherlands (because there is none right now).", "score": 2, "replies": []}]}]}, {"body": "Your advice makes 0 sense. The people that sell now, will be kicking themselves later just the the initial people who sold to buy a car did.", "score": 1, "replies": []}]}, {"body": "Well I bought TSLA and a Tesla roughly at the same time, but the stock has appreciated more than what the car cost. Lots of similar situations here", "score": 6, "replies": [{"body": "Same. Very happy with both decisions.", "score": 3, "replies": []}, {"body": "Thank you for confirming that my dream, as useless for the world it may be, can actually become true. I needed that in my life.", "score": 1, "replies": []}, {"body": "Same bought shares and M3 last August and shares have more than paid for the car.", "score": 1, "replies": [{"body": "Yea last August here as well", "score": 1, "replies": []}]}]}, {"body": "I bought a Tesla by selling TSLA shares, and then once having one and understanding how great it is, bought more. Don’t regret it at all. If anything, made the ups and downs more bearable since no one else is providing a similar experience", "score": 5, "replies": [{"body": "This makes me smile and gives me hope :)", "score": 1, "replies": []}]}, {"body": "I bought a Model 3 with cash in Sept 2018. I could have another 166 shares. I’m happy I’ve got 550 but I really should have focused on hitting 1,000 shares with the idea that at $1,000 TSLA would be a $1 million position for me.\n\nI didn’t do that though.\n\nOh well. More money can always be made.", "score": 3, "replies": [{"body": "If all goes down, you at least still have a nice car ;-)", "score": 3, "replies": []}]}, {"body": "That has been my plan all along and the only reason I got into investing. I really wanted the car but I am not even close to being able to afford it. Actually I don't even need a car in my life right now. But in a year or so I should be getting a proper job and I will probably need a car. In the meantime as a fan i knew everything about company and I was already listening to the earnings calls.. so I thought I might as well figure out hot to get some stock. I invested 2k 1 year ago, and 3k more this year including today. By the time giga Berlin is spitting out cars it should be enough. I'm just not sure if its gonna be a 3 or a Y. Might upgrade my goal to a performance if it keeps dropping.", "score": 3, "replies": [{"body": "I printed the Model S to hang it on my wall and keep me focussed, but who knows what model we can buy once we hit the magic number? I am really happy you are so far in already!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I think none of the comments were flexes, just real stories that make me very happy because they confirm what can be done, even though I am late to the game. You have done great, congratulations!", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "YES!", "score": 1, "replies": []}, {"body": "There is a 10 hour delay fetching comments.\n\nI will be messaging you in 5 years on [**2025-07-26 17:56:20 UTC**](http://www.wolframalpha.com/input/?i=2025-07-26%2017:56:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/teslainvestorsclub/comments/hx8dmp/trade_tsla_to_buy_an_actual_tesla/fzbls4g/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fhx8dmp%2Ftrade_tsla_to_buy_an_actual_tesla%2Ffzbls4g%2F%5D%0A%0ARemindMe%21%202025-07-26%2017%3A56%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20hx8dmp)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}, {"body": "I started trading this way. 80 shares at 490. I could have bought my Model 3 already (in 3 months my stocks would have allowed me to buy it) but I decide to keep them instead. They look like a good long term investment", "score": 2, "replies": [{"body": "Congratulations on your trading success and holding them for far more gain is of course the best way to do it. I envy you for being wise enough to not spend the profit...", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Your family will be shocked when you buy them all a Tesla in 5 years ;-) Hold on tight!", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Oh that is so awesome.\nI hope to tell my son one day that his college is suddenly paid for...", "score": 2, "replies": []}]}]}]}, {"body": "Well. If you have $TSLA you most likely believe the robotaxi fleet will launch soon™. So preorder the cybertruck/y/roadster/semi. Because Tesla will stop selling cars for normal prices when the fleet launches.", "score": 2, "replies": [{"body": "I had a Tesla in my shopping cart yesterday, it scared the sh*t out of my wife when she walked in, so I will need to wait ;-) Also I can only afford the 4 wheels so far.", "score": 4, "replies": []}]}]}
{"title": "Why Blink Charging (BLNK) is the future", "selftext": "Blink Charging has been making moves lately for its future development. Currently they are working with the federal government and car companies that produce electric cars (such as Tesla) to have converters for charging ports at their stations. They also are working on unique infrastructure to charge vehicles in public areas such as fast food restaurants, grocery stores, shopping centers. Essentially these will be the parking concrete block will be replaced with something made out of a composite that can charge the car wireless while their customer does shopping/eating. Blink is also working with Tesla and other car companies to make this wireless charging feasible. Here is a video of the BLNK CEO talking about this technology (3:00 min):\n\n[https://www.youtube.com/watch?v=DPSlx2xEc0w](https://www.youtube.com/watch?v=DPSlx2xEc0w)\n\nThis stock will not be like TSLA or SPCE however, making monthly covered calls on this stock will net you more than what you would lose making those riskier bets. TSLA is making the cars, but there is still much money to be made in the infrastructure being developed to make sure those cars can literally drive everywhere without having to go back home to recharge.\n\n&#x200B;\n\nTL;DR BLNK Sell Call $10 08/21 or BLNK Buy Call $10 12/18 or Sell Put $5 08/21\n\n&#x200B;\n\nLet me know your thoughts retards.", "id": "hwt68r", "created_utc": 1595556446.0, "score": 22, "upvote_ratio": 0.83, "num_comments": 54, "comments": [{"body": "The feeling when you buy 10k shares a month ago, baghold forever, and literally sell 2 days before the pump for a loss...", "score": 24, "replies": [{"body": "Don't be a bitch and fomo back in for another loss", "score": 22, "replies": [{"body": "Oh hell no im not touching it", "score": 1, "replies": [{"body": "oof.", "score": 4, "replies": []}, {"body": "Damn", "score": 3, "replies": []}]}]}, {"body": "its $12 now lmao", "score": 4, "replies": [{"body": "Im going to blow my brains out", "score": 1, "replies": [{"body": "For that many shares you have to play the wheel man, the premiums would have been at least a couple thousand of extra tendies a month", "score": 1, "replies": [{"body": "At the time its was shit.", "score": 1, "replies": []}]}]}]}, {"body": "You didn't even hold the stock for one month and you call that holding a bag forever?", "score": 3, "replies": [{"body": "You know how shit it feels to hold that and get cooned", "score": 1, "replies": [{"body": "😂", "score": 1, "replies": []}]}]}, {"body": "Right there with you bud", "score": 1, "replies": [{"body": "Sadness is only one pert of our lives...but its a big one", "score": 2, "replies": []}]}, {"body": "That hurts brotha. Stay the course!", "score": 1, "replies": [{"body": "Wana know what hurts worse... bagholding 500k of fvac", "score": 1, "replies": []}]}]}, {"body": "They are pretty much irrelevant. The majority of EVs are Teslas.. Tesla's network is much better and way faster than this network. \n\nFor the remaining EVs, there are plenty of options already. Also, 80%+ of EV charging is done at home. These will be used on the odd roadtrip, but I find it very hard to see any company in this industry making large profits at ANY point in the future.\n\nPrice to charge on these networks decreases to compete with other networks -> owners can't overcome the cost of electricity\n\nPrice to charge on these networks increases to overcome costs -> people charge at home more often to save money\n\nSource: EV owner and study this stuff", "score": 10, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "it's now $10, so you can suck my left nut", "score": 7, "replies": [{"body": "Why just the left? Can we suck the right too or did you lose it due to cancer", "score": 4, "replies": []}]}]}, {"body": "This is my favorite covered call as well", "score": 3, "replies": [{"body": "I had a covered call but I didn't expect it to jump to $10 so fast", "score": 1, "replies": []}]}, {"body": "Clowns have been pumping Blink since I was in college in 09. It has gone through so many splits that if you look at their historical chart, their stock used to be $3500!  You know what also  came out around that time? Blink Fitness. Many go work out @ Blink Fitness and your wife will stop cheating on you, rather than pumping this trash for over a decade now, thanks.", "score": 3, "replies": [{"body": "it's 10 years later and now the number of EVs on the road have grown exponentially and will continue to do so", "score": 2, "replies": []}]}, {"body": "Spot on DD", "score": 3, "replies": [{"body": "Thanks, everyone else on this thread that doubted me can go fuck themselves", "score": 6, "replies": [{"body": "I bought a month ago at $5.90.  I'm tempted to sell half when it hits $11 and letting the rest ride.\n\nEdit: I sold 300 shares at $13 and 200 shares at $14.\n\nI don't think there's anything wrong with leaving money on the table.", "score": 3, "replies": [{"body": "it's already at $12 after hours, Blink just signed another deal to open up more charging stations, I bought in around $3 but only got around 150 shares because I'm poor. I also had a $7.50 covered call so I missed out on a lot of potential gains on this pump up but whatever gains are gains. My plan is to keep on playing the wheel on this stock.", "score": 2, "replies": []}]}, {"body": "lol everyone that has used a blink charger fucking hates the company.", "score": 1, "replies": []}, {"body": "Spot on DD", "score": 1, "replies": []}]}]}, {"body": "Im all in on blink", "score": 2, "replies": []}, {"body": "I posted this 2 weeks ago and it did get get approved and they told me it was a small cap. Mods gay AF", "score": 2, "replies": []}, {"body": "Elon just gonna buy them if they become relevant 🥱", "score": 2, "replies": []}, {"body": "I work in the EVSE industry (I’m a buyer, not a seller) and these folks are the worst of the worst. Shit product, shit service, shit strategy. They are the Solyndra of the EV equipment world. \n\nHot tip - look for BLNK to go to $0 by 2024.", "score": 2, "replies": [{"body": "are you okay?", "score": 1, "replies": []}]}, {"body": "Um they haven’t done anything for years. Same small quarterly revenue. \n\nWhy are they gonna break out all the sudden now ?", "score": 2, "replies": [{"body": "They recently have been making deals with restaurant corporations such as Burger King to allow them to have a couple designated parking lots where their clients can go charge their car while they can go eat, in return, blink charging pays rent for the parking lots", "score": 2, "replies": [{"body": "I must have missed the part where people that drive Teslas are dining in at Burger King. 🥴", "score": 9, "replies": []}, {"body": "So are they faster than Tesla free stations? Also what happens when Tesla makes more free Stations everywhere ?", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/FootFetishFrank don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Are they catching up to tesla in time to charge?", "score": 1, "replies": []}, {"body": "BLNK 7.5C 12/18", "score": 1, "replies": [{"body": "Congrats on being rich asshole", "score": 1, "replies": []}, {"body": "Please tell me you still have this", "score": 1, "replies": []}]}, {"body": "A BUY n hold stock for sure. Massive growth potential! The gas stations for EVs. Most ICE motor companies are transitioning to electric. Demand > supply for charging stations right now.", "score": 1, "replies": []}, {"body": "Bought at 6, sold at 12.98. \nI think I sold too soon :(", "score": 1, "replies": []}, {"body": "This aged nicely.", "score": 1, "replies": [{"body": "Even more so now...", "score": 2, "replies": [{"body": "Not as much now so but still right there with you", "score": 1, "replies": []}]}]}, {"body": "A lot has changed since this post 😂", "score": 1, "replies": []}, {"body": "😉", "score": 1, "replies": [{"body": "I sold covered calls and lost profit big time fml", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lmao", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "NIO and Palantir, I had most of my portfolio in BLNK and was not able to get into PLUG, if I wasn't so poor I'd have made so much more", "score": 1, "replies": []}]}]}]}]}
{"title": "Zoom pump and dump finally dumping !", "selftext": "Yes they became a household name\n\nBut now fb is giving their shitty video away for free\n\nMicrosoft is taking corporate share with teams. Google with hangouts. \n\nIt’s a fucking video chat. They never monetized retail users. It’s over !!\n\nLong time coming. And a $600 tablet in a world where everyone and their mom has a tablet 😂 what a fucking brilliant idea. Isn’t gonna save them. Btw what an innovation. Shows how shitty this company really is \n\nThis is the face of zoom \n\n\nhttps://i.redd.it/gwosazq58az11.jpg\n\n\n\nNext stop 228. Then 200\n\nEnjoy idiot zoom bulls 🌈🌈🌈🌈🐻🐻🐻", "id": "hx21rv", "created_utc": 1595598342.0, "score": 100, "upvote_ratio": 0.91, "num_comments": 53, "comments": [{"body": "Damn she looks like a druid fortune teller", "score": 53, "replies": [{"body": "She is 😳", "score": 14, "replies": []}, {"body": "Wait, so she is not Wendy? The meth hooker from breaking bad?", "score": 0, "replies": [{"body": "No it's the Dr who girl, like season 5 I think", "score": 0, "replies": [{"body": "Correct but this picture is of her character in The Office (U.S.)", "score": 0, "replies": []}]}]}]}, {"body": "No big caps will adopt a chinese program, running on chinese hardware - the security liability is enormous.  Kids might use it, but it's not going anywhere in the corporate world.", "score": 16, "replies": [{"body": "Yup not when Microsoft is basically giving away teams for free with an overall package from them", "score": 5, "replies": [{"body": "Google Meets is also popular - used in my organization. And Google just made it more integrated with email\n\nZM has no moat - no idea why their stock skyrocketed given the heavy hitters that are their competition. This is gonna be a $70 stock again by the end of next year", "score": 3, "replies": [{"body": "Very much agree", "score": 1, "replies": []}]}]}]}, {"body": "#WE OUT HERE 🌈🐻", "score": 22, "replies": [{"body": "Hell yah ! My zm 190p climbing out of its grave !", "score": 13, "replies": [{"body": "190p gang represent!", "score": 2, "replies": [{"body": "That was definitely a fuck you spite put purchase. Definitely didn’t work out with this autist company and this dumb ass pump 😂", "score": 1, "replies": []}]}]}]}, {"body": "That’s show was unwatchable after she came on.", "score": 15, "replies": [{"body": "Yah she definitely brought it down. That’s pretty much the only bad casting choice they made. Can’t think of any others", "score": 8, "replies": [{"body": "They had it right up to Robert California but downhill from there; Nelly, the interns, Andy’s family.", "score": 14, "replies": [{"body": "Yah Andy’s family dumb. I liked the interns. Plop was a little bad\n\nThe other one hooking up with jan was good", "score": 3, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Ha yes I was so excited for him and total dud", "score": 5, "replies": []}, {"body": "Will Ferrell was pretty funny. Deangelo “something”", "score": 1, "replies": [{"body": "Vickers", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Yeah bruh but I wish I had dumped later. Bought ZOOM in March 1 share for 109 dollars. Dumped it when Google Meets became totally free at $150. Should’ve hung on a little longer but your prediction is probably right.", "score": 7, "replies": [{"body": "Yup it had a very tard run up", "score": 6, "replies": []}, {"body": "No, you dumped right.", "score": 3, "replies": []}, {"body": "People dumped shares after that stellar earnings report in June so I bought 250 shares @ $200. Then I sold it all 2 or 3 days later at $221 thinking I timed it perfectly. Talk about wishing I had dumped later.", "score": 1, "replies": [{"body": "Goddamn that’s crazy.", "score": 1, "replies": []}]}]}, {"body": "I feel like I read this exact post a month ago.", "score": 6, "replies": []}, {"body": "it's a blown off top for pretty much the entire tech industry rn\n\nfuck you retarded bulls, you had this shit coming", "score": 6, "replies": []}, {"body": "This one was obvious. Anyone under 40 years old who's been forced to use Zoom knows how fucking shit it is. It's a Boomer program if I've ever seen one.\n\nAlso LOL at that tablet.\n\nThat said, these kinds of retarded products are often bought by the dozen by Boomer CEOs that have no fucking idea about tech. See: every school and university and hospital.", "score": 7, "replies": [{"body": "Well they’ll learn the hard way with security breaches. Also teams is going hard at that market as well as fb and goog. Zoom is lucky they got out in front. Big boys are like wtf people are excited by a good damn FaceTime app? Alright let’s take that away from them", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "That’s not didn’t know", "score": 1, "replies": []}]}, {"body": "Who's uncle undergoing HRT did they get to model this?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They’ll open up retail stores next !! With zoom video booths 😂😂", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "?? Link?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "😂 it’s from a great show ...", "score": 1, "replies": []}]}, {"body": "There are other players.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "😂😂 just like tsla. Fuck you enjoy your losses", "score": 5, "replies": [{"body": "Thanks for making my point. Tesla can’t go below $0. We always win in the end. So what that it’s down a ton from it’s high? Just need diamond hands. No matter how much money I lose, I always tell myself it can’t go below zero. Unless I write really dumb spreads, but I’m not on RH.", "score": 4, "replies": [{"body": "Sure it can. Might go the way of blackberry :)", "score": 1, "replies": []}]}]}, {"body": "Tell that to oil futures", "score": 3, "replies": [{"body": "Just have to show up with a kiddy pool and accept physical delivery.", "score": 2, "replies": []}]}]}, {"body": "What the hell is she holding\n\n&#x200B;\n\nBTW all of tech is dumping not just ZM", "score": -2, "replies": [{"body": "Ugh. Watch one of the greatest shows in history. The office", "score": 4, "replies": []}]}, {"body": "okay buy calls everyone sell puts lets go", "score": 0, "replies": []}, {"body": "You son of a bitch I'm in. Calls it is!", "score": -2, "replies": []}, {"body": "What if they made it possible to video chat with anyone regardless of the service that they are on", "score": -2, "replies": [{"body": "It’s a video chat ....", "score": 2, "replies": [{"body": "Yes but what if you could connect to any one and it didn't matter what platform that they are on", "score": -4, "replies": [{"body": "Lol. Like you can connect with people on Teams or Facetime via Zoom? Never fucking happen. Anyone who knows anything about the software world knows that will never happen.", "score": 2, "replies": [{"body": "Having separate video chat systems isnt going to encourage growth of video chat. Im not going to sign up for zoom, skype, google hangouts, Facebook and what other flavor of the month just to video chat. Having an inhouse service isnt going to increase retention on any site or app.\n\nSo why would they do it? Because money", "score": 0, "replies": []}]}, {"body": "That would be a lot of deals to make and interfaces to make. No way zoom pulls that off. They are busy with a $600 tablet ...", "score": 1, "replies": [{"body": "Nobody wants a trash tablet in a market saturated with trash tablets. $600 gets you a good used ipad or a couple hundred dollars away from a Microsoft surface that you can do work on or a Samsung tablet.", "score": 2, "replies": [{"body": "I agree. That’s why I was shocked zoom wasn’t sold off on that silly news. It was like blackberry coming out with their touchscreen cell phone after like 6 years of the iPhone being out", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "Top 8 Reasons + 2 Bonus - Return Of The Bear", "selftext": "1) China Retaliation  \n2) Tesla Dives 9% On Downgrade  \n3) Intel Crashes 18% On Earnings  \n4) Apple Gets New Bear Call as Fundamentals ‘Can’t Support’ Rally  \n5) FAA Issues Emergency Order On Thousands Of Boeing 737s  \n6) President Trump interview with the other Presidente  \n7) Those $600 unemployment checks will likely soon end  \n8) Executives are selling stock as the market experiences its epic rebound  \n\n\n**2 Bonus**\n\n  \n1) Bill Ackman came just in time for CNBC interview  \n2) The average daily value of options traded has exceeded shares for the first time, with July single stock options volumes currently tracking 114% of shares volumes", "id": "hx5no8", "created_utc": 1595610505.0, "score": 8, "upvote_ratio": 0.61, "num_comments": 56, "comments": [{"body": "[removed]", "score": 13, "replies": [{"body": "it surely does at the right time.", "score": 6, "replies": []}, {"body": "Remember when it crashed the first time? The market didn't care about the stimulus until it suddenly did.", "score": 1, "replies": []}]}, {"body": "What", "score": 8, "replies": [{"body": "?", "score": 5, "replies": [{"body": "What", "score": 6, "replies": [{"body": "?", "score": 8, "replies": [{"body": "What", "score": 5, "replies": [{"body": "?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Agree but all this DD goes down the drain when the new stimulus package is passed", "score": 6, "replies": [{"body": "[not looking good](https://www.commondreams.org/news/2020/07/22/mcconnell-laughs-when-asked-if-covid-19-bill-will-pass-end-next-week-when)", "score": 4, "replies": [{"body": "Huehuehue", "score": 1, "replies": []}]}, {"body": "Not if it takes them a few months to approve it.", "score": 1, "replies": []}]}, {"body": "1. Retaliating what? in terms of market?\n2. Have you seen Tesla's run up? That said, in CA I've seen almost nothing but Teslas on the road.\n3. Which went directly into AMD...\n4. Lots of tech WFH people got apple products to WFH with, and their next budget phone lineup could be a winner if they aren't having production problems.\n5. Good time, while no one is flying.\n6. This is bound to be bad\n7. No they won't. They'll just get smaller, and there might even be a small stimulus which again fucks over the coastal cities and inspires the midwest to get another new TV\n8. Probably. It's pretty high, but there's also later inflation to consider.", "score": 3, "replies": [{"body": "Is he accurate with this? I should inverse this.", "score": 1, "replies": [{"body": "I have a crystal ball right here. Also an 8-ball for good measure  \n\n\nI seriously do believe there's another round of stimulus coming when they announce plans next week. The republicans have tacitly agreed to it, just smaller in number and scope.", "score": 2, "replies": []}, {"body": "I’ll inverse your inverse and beat both of you", "score": 1, "replies": [{"body": "Ok then I will collect premiums from both of you. IRON CONDOR!!!!!!!!! 50+ CONTRACTS!!!!!! Let's go then.", "score": 1, "replies": [{"body": "I’ll inverse your condor.  Still winning.", "score": 1, "replies": [{"body": "Sorry you can't. You are within my strike prices, securities that goes up/down/sideways I still make money.", "score": 1, "replies": [{"body": "Oh yes, I can.  I’m outside of your long strikes strikes.  ON BOTH SIDES.  Still winning.", "score": 1, "replies": [{"body": "But you collect less premium if you are out of my strike prices. \"No TENDIES FOR YOU\" I still make MORE TENDIES!!!!!!!!!! 90 - 95% of winning and 95% capital gain. Also I launch 1.5 leap years on your holdings.", "score": 1, "replies": [{"body": "I inverse you leaps and take your tendies.  Man, this is soooo easy", "score": 1, "replies": [{"body": "Hahhahahahahhahaahahahahha I guess no wonder why you are making 0 GAAAAIIINNNNZZZZZZZZ this month.  🤣😂🤣😂🤣😂🤣😂🤣!!!!!!!!!", "score": 1, "replies": [{"body": "I think you’re talking about yourself, brah\n\nI got tendies for daaayzzzz\n\nFrom investing yoolooohyu", "score": 1, "replies": [{"body": "To be honest I am down 10k this week but gives me an opportunity to buy more. I still have holdings from late March leaps from MSFT 12/20 DEC. , BABA 1/21, TQQQ 1/21, FB 12/20. IRON CONDOR BAC AND PGR. So all in all I'm still profitable.", "score": 2, "replies": [{"body": "Glad you’re good to go.  I’m a theta gang guy too, mostly iron condors and covered calls . My condors were getting ripped apart by the big bull run of the past two weeks.  I was honestly glad to see the market drop!  Ha", "score": 1, "replies": [{"body": "Hahhahahha same dude. I was worried about my strike prices being itm at least I dont have to roll my trade. What do you usually trade for iron condors.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "1 - Yuan weakened - Dollar strengthens - Bad for markets.  \n2 - Bogus accounting will soon surface and matter?  \n3 - AMD overbought and peaked?  \n4 - iPhone 12 delayed?  \n5 - Not good for BA and Dow  \n6 - Agree  \n7 - Small will have an impact  \n8 - They know about their sales and revenue better than those analysts.", "score": 0, "replies": [{"body": "I wonder if we'll weaken the dollar as fast as china can weaken the yuan, and if they can keep up.\n\nMusk doesn't seem the type to do bogus accounting, though maybe creative. I don't know though.\n\nI hope AMD is both of those. I've got puts for next week!\n\nGood move to delay a product that no one will buy/can get their hands on because Apple doesn't ship their products where they have stores to deliver directly.\n\nEh, maybe short term. From what I read it's corrosion and not a design flaw. Some good cleaning might clear it up.\n\nMy furloughed job just asked to get me back part time so I can remain on partial unemployment and still get paid. A small stimulus on top of that? Pretty significant.\n\nOf course they don't realize I also have another part time job which is causing my unemployment to be denied... even though it's still poverty level here in the bay area. Fucking government. I figure in 2020 we could easily tie pay to geography/taxable location but noooo.\n\nYeah, but skimming profits off the top only to dump it back in after a bit of a pullback is a thing.", "score": 2, "replies": [{"body": "Great points. Thanks!", "score": 3, "replies": []}, {"body": "LOL that you think musk has anything to do with his financial reporting.  Lol.  Literally;  you just make stuff you and claim\nAs fact??? Haha wtf!  \n\nSincerely,  CPA working for large public companies.", "score": 1, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/returnofthebear don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "buy gold and tlt", "score": 1, "replies": [{"body": "Would take profits from gold and silver for the time being. Dollar about to rise significantly.", "score": 1, "replies": [{"body": "where'd you hear that?", "score": 1, "replies": [{"body": "oversold..check the weekly chart. Nice bounce coming.", "score": 2, "replies": [{"body": "truth, I had that feeling, and figured it would be a self fulfilling prophecy, but if the technicals also align, you just might be right", "score": 1, "replies": []}]}]}]}]}, {"body": "I trade the SPDR sector ETFs.  You?", "score": 1, "replies": [{"body": "Qs", "score": 2, "replies": []}]}, {"body": "whats bill ackman got to do with bearish market?", "score": 1, "replies": []}, {"body": "Let me give you 1 reason for the bull - Bbbbbrrrrrrrr", "score": 1, "replies": []}, {"body": " [Billionaire investor Ray Dalio warns U.S.-China conflict could become a ‘capital war’ that hits the dollar](https://www.marketwatch.com/story/billionaire-investor-ray-dalio-warns-us-china-conflict-could-become-a-capital-war-that-hits-the-dollar-2020-07-27?mod=home-page#cx_testId=101&cx_testVariant=ctrl&cx_artPos=12)", "score": 1, "replies": []}, {"body": "Number 7 should be number one", "score": 1, "replies": [{"body": "\\#6 should be #1 me thinks :)", "score": 0, "replies": []}]}, {"body": "Fed is still printing, new stim pack around the corner. Stfu noob.", "score": 0, "replies": [{"body": "Is “US Dollar loses reserve currency status” priced in?", "score": 0, "replies": [{"body": "Right when there is chatter about this The King Dollar Rises From the Ashes.", "score": 2, "replies": []}]}, {"body": "Let's see if that stim pack actually passes", "score": 0, "replies": [{"body": "Whether it does or not markets have made up their minds to go down.", "score": 2, "replies": []}, {"body": "and if it does. this means buy more?", "score": 2, "replies": []}]}]}, {"body": "Soo nothing new, got it", "score": 0, "replies": [{"body": "INTC falling 16% happens every day? Once in a decade or two event. TSLA falling more than 20% after a fabulous (cough cough) quarter is not new? China embassy drama not new?", "score": 2, "replies": [{"body": "Nope not in a way that matters all of this has happened before at one point and besides AMD took what INTC lost so net even there, TSLA hit 1790 of course it was going correct. We nearly caused ww3 by killing Solemani and the market just shrugged it off a week later", "score": 1, "replies": [{"body": "Let's wait for couple weeks and see where we stand I guess. It matters when we think it does not.", "score": 2, "replies": [{"body": "You made good points and I’m not debating that, but this is not a free or fair market its not rational in the way we think it is.", "score": 2, "replies": []}]}]}]}]}]}
{"title": "AMD short", "selftext": "[deleted]", "id": "hxc3o2", "created_utc": 1595632275.0, "score": 11, "upvote_ratio": 0.72, "num_comments": 53, "comments": [{"body": "Be safe. Play Intel instead. Buy calls Intel. 2021. Long play and cheap....", "score": 20, "replies": [{"body": "One can short AMD and see the same thing as Intel happen to it. And then go Long. Yeah?", "score": 2, "replies": []}, {"body": "Liking this idea. Surely they'll climb within 6 months", "score": 1, "replies": [{"body": "Haha yes. Call me surely. I hope, but safer then better then betting against AMD.", "score": 1, "replies": []}]}, {"body": "Price target for intel in 2021?", "score": 1, "replies": [{"body": "1/15/2021 @$52.50.\n\nI don’t plan on holding that long. The moment it goes up, I am pulling out.... taking profit. Swing play... then onto the next..\n\ngot burn this week playing Apple calls... no more short term calls for me :)", "score": 3, "replies": [{"body": "A $2 increase in 6 months? Isn’t that kinda Low hahaha", "score": 1, "replies": [{"body": "Almost guarantee money wouldn’t you say? That is the point of the game :)", "score": 3, "replies": []}]}]}]}, {"body": "short it for premium, then use the premium to hedge with calls on intc?", "score": 1, "replies": []}]}, {"body": "Lol.. there’s thousands of great short opportunities out there and you choose this one? Come on now. For stocks like this you sell the rips and buy the dips, shorting is risky af", "score": 13, "replies": [{"body": "I know that there are much better shorting opportunities and but I genuinely believe that it may drop below $58 very soon", "score": 0, "replies": [{"body": "You’ll get fucked on the IV after earnings. Been there, done that with AMD", "score": 5, "replies": [{"body": "Been there done that with Microsoft this week. IZvsca bitch. Lol 😂", "score": 1, "replies": []}]}, {"body": "You're delusional or dont understand the companies you're trying to game for quick money", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "AMD wont see sub 60 again", "score": 1, "replies": []}]}]}]}]}, {"body": "This thing just broke through resistance and one one ots biggest competitors just said they are 9 months behind. I think this goes go $70 and stays there for a while.", "score": 5, "replies": [{"body": "At 140 P/E? Might reach $70, but unlikely to stay there for now, shareholders will sell to lock in profits, in one day the stock rose about 16%. People will sell, we haven’t even heard their earning yet.", "score": 1, "replies": []}]}, {"body": "Proud AMD put holder...\n07/31 55P at .22", "score": 6, "replies": [{"body": "By looking at your posts, i can see your moms tampons pulled out of her pussy, im inversing you", "score": -8, "replies": [{"body": "I can't see you're mom's tampons. Cause your mum is a dude.", "score": 12, "replies": []}]}]}, {"body": "Got some for 7/31.", "score": 3, "replies": []}, {"body": "1/15/2021 @$52.50. \n\nI don’t plan on holding that long. The moment it goes up, I am pulling out.... taking profit. Swing play... then onto the next..", "score": 3, "replies": []}, {"body": "There it is", "score": 4, "replies": [{"body": "Disagree?", "score": 1, "replies": []}]}, {"body": "Sell a call credit spread AMD for earnings... premiums are juicy even all the way up to the $90 strike. AMD is definitely overbought but it's become a meme stock once again. \n\nPersonally I'm selling puts for AMD earnings.", "score": 2, "replies": [{"body": "Yea got a 70c credit spread. I’m thinking if it turns to a meme stock next week, I might be screwed. Put credit spread at 50p (55p if you’re feeling ballsy) might be a better play.", "score": 1, "replies": [{"body": "It’s been a meme stock for 3 years. Who else do you think is buying a 170 PE?", "score": 3, "replies": []}, {"body": "I'm going to sell some cash covered puts at $55... Not a whole lot of money but I'm trying to play a couple of earnings plays this week so can't take too much risk.", "score": 2, "replies": []}]}]}, {"body": "I’m waiting till after earnings to start grabbing puts on amd.   Amd hasn’t  been dropping this week like it normally does & I’ve made a lot of amd puts in the past.", "score": 1, "replies": [{"body": "Did you forget about yesterday?", "score": 1, "replies": [{"body": "Everything dropped yesterday, & it recovered.  I’m not saying don’t get puts, I’m just saying don’t rush to get some & screw your self", "score": 1, "replies": []}]}]}, {"body": "Your post makes it sound like you’ve watched way too many retarded TA videos on YouTube and still have zero understanding as to what it is.", "score": 1, "replies": [{"body": "Especially with zero mention of earnings.", "score": 1, "replies": []}]}, {"body": "Dummies Morons and Idiots?", "score": 1, "replies": []}, {"body": "See how Monday plays out first, then catch the falling knife... With intels poop earnings, AMD has a solid position, unless..... They bomb earnings too", "score": 1, "replies": []}, {"body": "In Dick Taters are for silly gay bears. Ru not awoke", "score": 1, "replies": []}, {"body": "Their multiples are pretty high right now, and today felt overbought.", "score": 1, "replies": []}, {"body": "Pullback is possible, but I wouldn't expect much. In a breakout that is likely to continue. I wouldn't touch it, but take profits quickly if you do.", "score": 1, "replies": []}, {"body": "AMD is set up to have a strong year. I wouldn’t try to time the short side. Mama Su all the way", "score": 1, "replies": []}, {"body": "It will pull back eventually but who knows when that will happen. It could run another 15% on Monday and you’d be RIP.", "score": 1, "replies": []}, {"body": "I bought a put on amd$ to \n\nNo way it holds that", "score": 1, "replies": [{"body": "Don’t bet against America", "score": 1, "replies": [{"body": "I have spy $ calls bitch", "score": 1, "replies": []}]}]}, {"body": "I have a put I bought at the top....I feel like it has to drop.  I’m probably wrong but we’ll see.  7/31 74p bought it during the last hour when it hit the top.  \n\n[AMD 74p](https://imgur.com/a/9dv3u1B)", "score": 1, "replies": []}, {"body": "Join the Intel gang you fucker", "score": 1, "replies": []}, {"body": "How about you sell a call spread less risk yooo.", "score": 1, "replies": []}, {"body": "Figure out a stock to buy calls on dude. Shorting is tough", "score": 1, "replies": []}, {"body": "\\*holds his AMD shares closer\\* Ain't nobody touching my babies!", "score": 1, "replies": []}, {"body": "I ain't selling my AMD stock until it hits $1000 lol. It's rocket ship to the moon just getting started and this could be the biggest earnings blow out yet. With everyone working remotely we are going to need 10x more computer servers and chips and INTC is 3 years behind now, so AMD and TSM picking up a ton of market share. AMD is positioned to profit greatly over the next few years. Oh and Lisa Su, 'nuff said.\n\nAMD $75c 7/31\n\nAMD $80c 7/31", "score": 1, "replies": []}, {"body": "My comment aged well.", "score": 1, "replies": [{"body": "Good thing i bought 10 contracts of 70c the day before earnings ;)", "score": 1, "replies": []}]}, {"body": "Why hasn't anyone learned yet that computers go in and instabuy and AMD will squeeze up to $80-90 for earnings and then sell-off..\n\n\nSo don't do anything with AMD on options and just wait for the day of earnings and trade it with shares and close those shares the second it jumps up from earnings and close for a major profit in literally like 20 seconds as it sky rockets and then drops.\n\nYou can trade shares after 4pm using a \"EXT\" order type and boom, profit from the computers flinging the price of AMD up in literally 10 seconds.", "score": 1, "replies": [{"body": "Do you think Intel is a good buy right now cause of the dip? Will it squeeze back up to $60 or are they gonna just stay down?", "score": 1, "replies": []}]}]}
