{"title": "GOLD Bull Case", "selftext": "I think that GOLD has had a great run back up towards all-time highs, but it has a lot of room to run to get there. I think right now the stock is a great buy on fundamentals and is above 50 and 200 day SMA.\n\nIn terms of other support for the bull case, gold as a precious metal has been performing well, as expected in this type of market and Barrick naturally will be tied to that performance.\n\nPhotos: https://imgur.com/a/VlW3LHm\n\nAdditionally, utilizing Fibonacci levels shows that if it breaks past this resistance there is more room to run until 22 without resistance. (image 1)\n\nAlso, utilizing a support and resistance calculator within Python, it can be seen that the stock is above average resistance and toeing the line to pass the last current level of resistance generated by the Python script. (image 2)\n\nAlso BRICS being formed and trying to reform a gold standard and China is continuously adding to their gold holdings:\nhttps://www.bloomberg.com/news/articles/2023-05-07/china-s-gold-splurge-reaches-sixth-month-as-reserves-rise-again\n\nLastly, it can be seen that there is a large Ascending Triangle pattern formed, and the last time this happened for the stock, large upward movements were generated. The pattern suggests a move to 21.21->22.29 between the time frame of 05/5/2023 -> 06/19/2023.\n\nAll of these things in combination, especially with the current state of FED being stuck with choosing between increasing rates and causing more bank pain (see image 4 - [https://www.federalreserve.gov/supervisionreg/files/board-briefing-on-impact-of-rising-interest-rates-and-supervisory-approach-20230214.pdf](https://www.federalreserve.gov/supervisionreg/files/board-briefing-on-impact-of-rising-interest-rates-and-supervisory-approach-20230214.pdf), federal reserve report that at third-quarter end 722 banks had already reported unrealized losses exceeding 50% of capital) or stopping hikes/reducing rates and letting inflation run rampant support a bullish case for gold and gold miners such as Barrick, with their leadership sees a strong next quarter ahead.", "id": "13b06dq", "created_utc": 1683487727.0, "score": 19, "upvote_ratio": 0.63, "num_comments": 49, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 month ago\n**Total Comments**|6|**Previous Best DD**|\n**Account Age**|12 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Gold has a lot of upside potential and is a great buy right now on fundamentals and technicals.", "score": 1, "replies": []}, {"body": "JPM is short on gold. However solid your fundamentals on Gold as a buy might be, Jamie Diamond and his best friend are going to brute force it whatever way they want. \n\nI wouldn’t bet against JPM until there’s some clear reshuffling in private and central banking decision-making positions. \n\nUntil then the One Bank to Rule Them All is king. Keep your head low lol\n\n““Wall Street on Parade” notes that JPMorganChase Bank holds 53% of all the monetary metals derivatives contracts in the U.S. banking system.”", "score": 11, "replies": [{"body": "Here’s gold demand data for q1 \n\nhttps://www.gold.org/goldhub/research/gold-demand-trends/gold-demand-trends-q1-2023", "score": 6, "replies": [{"body": "How much do you think it will crash? Also this guy is talking about $GOLD", "score": 1, "replies": [{"body": "I’ve heard big traders talk about 1600 usd per oz for buy in", "score": 0, "replies": [{"body": "Wow, so about -20%", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "If true, yet another reason that JD and his best friend won't allow gold to do any shenanigans. \n\nIf true, a significant rise in gold would threaten the global econo - i mean JPM and his best friend. \n\nCrazy thing is too, when the price of gold drops they're going to move to a net long position and ride all the crazed retail investing when a real recession kicks into gear, then dump it all at new ATH or close and move back to a net short position. \n\nJust like has always happened with speculative markets for all of time. \n\nIt's an easy game when you have insider info, the US fed in your corner, and greater market cap than any bank that has existed in the history of the world. \n\nWhy didn't I think of that!", "score": 4, "replies": []}]}, {"body": "They can’t control the price of gold", "score": 0, "replies": [{"body": "No one can control the price of anything.  Influence/manipulate, however? I think we only have libraries full of historical data that says that this has *always* happened.  Truly truly regarded to assume that it isn’t still happening. \n\nNot my money though, go crazy", "score": 5, "replies": [{"body": "[Silver Thursday](https://www.investopedia.com/articles/optioninvestor/09/silver-thursday-hunt-brothers.asp)", "score": 2, "replies": []}, {"body": "Jim Cramer enters the room", "score": 1, "replies": []}]}]}]}, {"body": "Gold has outlasted EVERY fiat currency for 5000 years and counting. Looks like a good port in a shit storm🎱", "score": 20, "replies": [{"body": "gold is just the heaviest of all fiats", "score": 14, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I think reading the room is the best I Indicator for the real moves in the metals market. I brought big on the day covid was detected outside of China, I was about to pull the trigger anyway as I could see a growing unease in the financial markets. Covid kicked gold along and  accelerated the inevitable on the markets, then the ukraine blew up and Chinese relationships have continued to decline. Im bullish into 2024..", "score": 3, "replies": []}, {"body": "Gold and gold equities are hitting new highs.  Bull market.  I'm buying dips.  Seems like we're in the early innings.", "score": 3, "replies": []}, {"body": "You be postin charts n shiet mane\n\n\nThe prescious metals be goin up n shiieeett", "score": 3, "replies": []}, {"body": "Yea I’m also bullish on gold and I’ve been following producers/explorers since Svb collapse. \n\nSome producers already up 50% but some explorers up 500% already. \n\nThe hard part about profiting from a bull gold market is to time your investment. \n\nYes you can get 50-200% on ABX but some juniors will go x1000-5000…\n\nI’m deep in dlta.v nkg.v ar.to", "score": 5, "replies": []}, {"body": "IVe been long since August 2020, bought the top like a true regard in random junior miners. Still 30% in the red rn.", "score": 2, "replies": []}, {"body": "Debating getting in. \n\nDecent position in: BYN, NGEX, ATX, FDY", "score": 2, "replies": []}, {"body": "WSB gold trading would be with 0 days options", "score": 2, "replies": []}, {"body": "1. Buy gold\n2. When the recession hits gold will increase in value like it always does during a recession\n3. Sell gold at the recession bottom\n4. Buy stuff that is on sale\n5. Profit", "score": 2, "replies": [{"body": "That’s my plan", "score": 1, "replies": []}]}, {"body": "Gold should implement a dividend to being a shareholder until then it'll be just a yellow looking rock with *some* use cases.", "score": 4, "replies": [{"body": "GOLD (the company Barrick Gold that the OP refers to) pays a dividend", "score": 5, "replies": [{"body": "Nevermind then. I am a regard. Sorry WSB 🤡", "score": 2, "replies": [{"body": "Was confused by the original post at first too", "score": 3, "replies": []}]}]}]}, {"body": ">I agree that there is a strong bull case for gold right now, given the current state of the economy and monetary policy. I believe that Barrick is well-positioned to benefit from this environment, and expect the stock to continue to outperform in the coming months.", "score": 2, "replies": []}, {"body": "Regardless of the chart voodoo if we enter a recession/ depression gold will go down. So are we in a bull or bear market? I guess time will tell. They have been promising us this recession for 2 years now.", "score": 2, "replies": [{"body": "Actually usually gold goes up typically during recession, as it’s seen as a safe haven? Idk what you’re talking about", "score": -2, "replies": [{"body": "You could go look at a chart of every depression and see that is not the case.", "score": 3, "replies": [{"body": "https://preview.redd.it/4uyquc3pcjya1.jpeg?width=1200&format=pjpg&auto=webp&s=c1f30bf76518141dfaf337ad39ab61b595d9e5bd\n\nWhere do you get this information? Personal bias or in fact?", "score": 1, "replies": [{"body": "Nice fake chart. Don't be a clown.\n\nCovid depression / or w/e you want to call it.\n\n$1673-$1487\n\n2008\n\n$968- $730\n\n2000\n\n$310-$260\n\n1980\n\n$674-314\n\nGold goes up during the bull run after the depression/recessions.", "score": 1, "replies": [{"body": "And how does it perform vs stocks in that same exact period you’re talking about? Seems to be doing quite well the past few months.\n\nNot only are you being rude, but awfully shortsighted. I’ll let you go so your own research lol", "score": -1, "replies": [{"body": "Does it matter? All I said was recession/depression gold goes down.", "score": 5, "replies": [{"body": "You replied to a post regarding GOLD it not being the case you didn’t just say recession/depression gold goes down. Seeing as gold has been moving up, not to mention it is a mining stock not gold spot price, you need to reevaluate what your saying. Not to mention gold (the precious metal) typically does well when there is inflation, like now.", "score": 0, "replies": [{"body": ">Regardless of the chart voodoo if we enter a recession/ depression gold will go down. So are we in a bull or bear market? I guess time will tell. They have been promising us this recession for 2 years now.  \n>  \n>  \n>  \n>I dont need to re evaluate anything I know what I said and this is what you are responding to.", "score": 1, "replies": [{"body": "!RemindMe 30 days", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Gold demand from jewelry could go down but demand from central banks and retail up", "score": 1, "replies": []}]}, {"body": "If you like gold,  you'll LOVE silver 🚀  🌙", "score": 2, "replies": [{"body": "I'll accept your advice as long as you're not an active wall street bets silver poster.", "score": 1, "replies": []}]}, {"body": "It's just not as much fun to day trade stuff that's nonvolatile like gold. You're talking about getting excited about a gain of >5% over the course of 6 weeks?\n\nYou'll never get very far shilling gold or silver on wsb.", "score": 1, "replies": [{"body": "Penny stock miners are were the action is, gold and copper right now. They have vol of options.\n\nEdited because I can’t spell.", "score": 3, "replies": [{"body": "I got a small holding in argonaut", "score": 2, "replies": []}]}]}]}
{"title": "Week Ended May 5 - Recap and thoughts for next week- Is this \"recession\" with us in the room right now?", "selftext": "&#x200B;\n\nhttps://preview.redd.it/fs6k19crngya1.jpg?width=635&format=pjpg&auto=webp&s=9c7a57ebce7e77e59490c256abe4bb7853451afb\n\nTLDR: After the Fed hiked 25bp as expected, a June pause is on the table. Inflation indicators turned hotter in April with consumer spending leading the way. The US economy showed signs of a rebound in last week's ISM report, while global demand remained soft. The Q1 earnings season is coming to an end with results exceeding expectations. However, things may not be as bright under the hood. Regional and small bank pain may not have ended yet, with deposit outflow and commercial real estate being their biggest risks.\n\n# Market-moving News\n\n**The Fed hike 25bp and putting pause on the table.** On Wednesday, the Fed hiked another 25bp, marking the tenth consecutive raise and bringing the benchmark rate to 5-5.25%. This decision pleased both bulls and bears, as JP raised the possibility of a pause in June while emphasizing that the decision would depend on data. Inflation remains a priority for JP, and he seemed to be happy with the progress made in disinflation while keeping the job market strong. However, he did express concerns about tightening credit conditions, which we will learn more about in next week's SLOOS report. This week's summary of inflation-related news leans mostly towards a neutral to negative outlook, indicating an increased risk of inflation picking up again.\n\nhttps://preview.redd.it/m3okmc85ngya1.png?width=936&format=png&auto=webp&s=aa307490f8ea74e0e0a742f44453e6cdc8984a95\n\n**Economic indicators have largely rebounded from previous lows**, with notable improvement seen in the ISM manufacturing report released on Monday. The report indicated a recovery from the low point observed in March and surpassed expectations. However, it is important to note that both prices paid and received have increased, leading to higher inflationary pressures. Global demand remains weak, particularly in the European Union (EU) and China, while domestic economic activity shows signs of picking up pace. The Atlanta Fed has raised its Q2 GDP estimate to 2.7% due to robust consumer spending. Here is a summary of the major economic data from last month, with a focus on the manufacturing sector.\n\nhttps://preview.redd.it/19eidn16ngya1.png?width=936&format=png&auto=webp&s=83e93d531e63aaa8f0fd2196e31f7cdcb78cdde2\n\n**Q1 earnings have thus far exceeded expectations, although there have been minimal changes to the full-year estimates**. As of Friday, 85% of companies in the S&P 500 have reported their actual results. Among the reporting companies, 79% have reported actual earnings per share (EPS) above estimates, surpassing the 5-year average of 77% and the 10-year average of 73%. In aggregate, companies are reporting earnings that are 7.0% above estimates, which exceeds the 10-year average of 6.4%. The blended earnings decline for the first quarter stands at -2.2%, which represents an improvement from the -3.7% reported last week and the -6.7% at the end of the first quarter (March 31). However, it is important to note that this marks the second consecutive quarter with a year-over-year decline in earnings. Analysts are projecting a decline of -5.7% in earnings for Q2 2023, followed by growth of 1.2% in Q3 2023 and 8.5% in Q4 2023. For the entire year of 2023, analysts predict earnings growth of 1.2%.\n\nHowever, it is worth noting that Q1 earnings were skewed by three companies (AMZN, UBER, TDOC) that had significant losses due to write-downs from acquisitions in the previous year. In Q1 last year, AMZN wrote down 3.8 billion for RIVN, UBER wrote down 5.9 billion for Grab, DiDi, and Aurora, and TDOC wrote down 6.6 billion for Livongo. As these write-downs were removed from their balance sheets in Q1 this year, these companies reported substantial growth in earnings. Excluding these companies, the earnings picture is actually much weaker (though still slightly better than estimated).\n\nhttps://preview.redd.it/ifrkhs47ngya1.png?width=936&format=png&auto=webp&s=45e486ff0c9554aa2618c83ca04da42b11b6b5a4\n\n**The regional bank selloff was the major drama of last week, and not without cause.** While the overall stock market remained relatively stable throughout the week, regional banks faced considerable challenges. Some regional bank stocks experienced a drastic decline of over 50% on Thursday, only to rebound on Friday. The roller coaster ride was largely impulse driven. However, there are potential fundamental risks associated with regional and small banks.\n\nLet's start with the good news. Fed H8 (assets and liabilities of commercial banks) report was released on Friday. Notably, there continues to be a \"walk\" of deposits from both large and small commercial banks. However, the outflow observed during the week was smaller than the previous week, and the outflow from small banks did not surpass that of large banks (no deposit transfers from small banks to large banks like March).\n\nhttps://preview.redd.it/wpiyiaj8ngya1.png?width=936&format=png&auto=webp&s=7ca9813f05dbbd471a51e007436954b544f27953\n\nAnd what's more encouraging is that both large and small banks experienced accelerated loan growth compared to the previous week, particularly small banks, which exhibited the fastest year-to-date expansion in loans. This credit expansion typically signifies confidence from these banks and suggests they may perceive greater stability in the sector and the overall economy (although this is before the selloff on Thursday).\n\nhttps://preview.redd.it/9pxizhd9ngya1.png?width=936&format=png&auto=webp&s=cda1427aec6b771856d4ac17bb987cfd29cffe90\n\nFrom the Fed's perspective, I do not believe they would allow any bank to default and depositors to lose their savings. While the Fed may not care much about small banks, maintaining public confidence in the overall banking sector is crucial. The Fed possesses the authority (via the ability to initiate monetary expansion) and the determination (as demonstrated by the swift bailout of SVB in just two days) to promptly address any potential systemic risks. However, this does not necessarily mean these banks will survive. Currently, there are two risks that should not be overlooked.\n\n1. The risk of deposit outflows and a potential bank run is a significant concern. Fear and panic can often outweigh rationality in such situations. As long as people have alternatives and no compelling reason to bank with these small institutions, there is a diminishing incentive for them to deposit funds. This could lead to a gradual erosion of deposits or even a sudden bank run. I simply cannot see how the situation can be reversed in the short term.\n2. Another major risk for small banks lies in their exposure to commercial real estate (CRE). In addition to potential losses on bonds and debt securities, these banks have a substantial portion of their loan portfolio tied up in CRE loans. As the value of commercial properties declines rapidly, the collateral backing these loans becomes weaker, posing a significant threat to the stability and financial health of these institutions.\n\nhttps://preview.redd.it/cdc2zrmangya1.png?width=936&format=png&auto=webp&s=af89925be2383fea499e0270b294f5a38b8dbb5f\n\nThere are types of CRE loans, but the most significant issue arises from office loans. With the increasing number of individuals working remotely, the vacancy rates for office spaces in the United States have been rising and reached a new high in the first quarter.\n\nhttps://preview.redd.it/i9chnp1cngya1.png?width=936&format=png&auto=webp&s=4fc6637c3449ae535e5781e1ec47d3d47ffe0fa9\n\nAs a result, these office properties are experiencing a rapid decline in value. Office buildings have already witnessed a 7% decrease in valuation since last year, and forecasts suggest that they could potentially lose up to 30% in value before reaching the bottom.\n\nhttps://preview.redd.it/hawmw6vcngya1.png?width=936&format=png&auto=webp&s=e05cd6c07b401042d76ff436fcfe43f1c7aefab6\n\nMeanwhile, there is a pressing issue regarding the refinancing of approximately $700 billion in mortgages on office buildings this year. These loans will need to be refinanced at significantly higher rates compared to when they were initially originated, further complicated by the decreased property values. The consequences of tighter credit conditions and diminishing rental income have already started to emerge. The delinquency rate on office loans has been rising since the beginning of the year, contrasting with the relatively stable delinquency rates observed in other CRE loans.\n\nhttps://preview.redd.it/j08op2qdngya1.png?width=936&format=png&auto=webp&s=8bf89d2b1776bc89c566b5c40659fa82e8daa82f\n\nThe financing rates on subprime commercial mortgage-backed securities (CMBS) have been experiencing a substantial increase since March.\n\nhttps://preview.redd.it/fady5ndengya1.png?width=936&format=png&auto=webp&s=90c8d5e52fa8bb8da5ec2db9806186c8625d3ec3\n\nThe concerns surrounding the office sector are undeniably reflected in the year-to-date (YTD) performance of office real estate investment trusts (REITs).\n\nhttps://preview.redd.it/6ux2xq2fngya1.png?width=936&format=png&auto=webp&s=f68ff9c7f48f8b2a01bb9d211f944ea976837233\n\nIn terms of bank exposures, Wells Fargo & Co. holds the largest office exposure among banks, with a total of $36.14 billion as of year-end 2022. However, this exposure represents only 3.8% of their gross loans.\n\nhttps://preview.redd.it/oqtiuj5gngya1.png?width=936&format=png&auto=webp&s=06bac084d3c7b70af65fa5d399c418e0fbf67fab\n\nWhich small banks has the biggest exposure to CRE loans? You guessed it:  New York Community Bancorp. (NYCB), which recently bought the assets of Silicon Valley Bank, has CRE loan exposure to the tune of 71% of its entire loan book. Other notable names on the list include EastWest Bancorp. (EWBC) with 39%, PacWest Bancorp. (PACW) and Western Alliance (WAL) with 28% and some other names which shall not be mentioned on this board.\n\nIn conclusion, while the overall banking sector may not currently face systemic risk, certain small and regional banks could face significant challenges due to deposit outflows and potential defaults in the CRE (especially office) loans.\n\n# My positions and predictions\n\n**US Equity**\n\n*Valuation*\n\nAfter this week’s earnings reports, 2023 SP500 EPS estimation unchanged last week:\n\n2023 Full Year EPS: $221\n\nNTM: $230 ($2 increase from last week)\n\n2024 Full Year EPS: $247\n\nCurrent forward PE 18.0, lower than 5-year average of 18.5 and higher than 10-year average of 17.3. In terms of valuation, we are slightly lower than last week (18.3).\n\nhttps://preview.redd.it/50g1c0shngya1.png?width=726&format=png&auto=webp&s=db7ecd6fb3b39d4447ad9ece9ef8fdee4a161a59\n\nMy investment thesis has not changed. The stock price is too high due to a low risk premium:\n\nhttps://preview.redd.it/qjrh1ogingya1.png?width=936&format=png&auto=webp&s=eb6563fd3064f92e2a84f3b86466adf59bf04d43\n\nIf we apply a risk premium of 3% to the valuation of the S&P 500, the stock market today should have a forward price-to-earnings (P/E) ratio of 15.4. Assuming the next twelve months (NTM) earnings per share (EPS) is $230 and the projected EPS for 2024 is $247, we can estimate that the S&P 500 index should be at 3542 today and 3804 by year-end (might be higher since the yield on Treasury bills is probably lower at year-end).\n\n*Headwinds and tailwinds based on this week’s data*\n\nhttps://preview.redd.it/yqw7qkpjngya1.png?width=936&format=png&auto=webp&s=a70443b854ab339a8aec3f474f48efceb1887a9e\n\n*My year-end projection:*\n\nMy base case (shown in green) has not changed from last week. Assume SP500 earnings of $247 for 2024, with inflation stabilizing under 4% and continuing to decline. The Fed will pause after May hike and keep rate unchanged until year-end, before starting to cut in 2024. Year-end target is between 3920 to 4410 for SP500 based on 16-18X forward PE ratio.\n\nLight blue box is where we are today. If we use 10-yr average forward PE ratio (17X), 3900 is a more appropriate level, and if we use risk premium model, we should be close to 3600.\n\nhttps://preview.redd.it/284du8pkngya1.png?width=936&format=png&auto=webp&s=400444f6f22ae4f947e6d91a87a574c56680ed3b\n\nIf the current \"Goldilocks\" situation persists, characterized by a resilient economy and consumers, along with inflation reaching 3% by year-end, small-cap stocks, particularly those in the Small Growth style, could present an interesting investment opportunity. These stocks are currently trading at attractive valuations and tend to perform well in a slow expansion environment with low interest rates.\n\nhttps://preview.redd.it/iqorp3glngya1.png?width=714&format=png&auto=webp&s=ce9ac50cbdf1d9f8fba7a192f4910f0c6a11930e\n\n![img](9jz9hy5mngya1 \"U.S. equity size and style total returns as of 5/5/23 (%)\n\")\n\nCurrent Positions (not changed):\n\nSPY 6/15 400 Put\n\nIWM 6/15 165 Put\n\nTLT Jan 2024 110/115 leap call spreads", "id": "13b06ev", "created_utc": 1683487729.0, "score": 92, "upvote_ratio": 0.89, "num_comments": 51, "comments": [{"body": "Excellent read - thank you!!", "score": 9, "replies": [{"body": "Thank you for the support!", "score": 3, "replies": []}]}, {"body": "Dang, gold star. Beats the 5-sentence horoscope fanatics around here.", "score": 9, "replies": [{"body": "Thank you!", "score": 2, "replies": []}]}, {"body": "I CANT believe I had to scroll this far to get here.", "score": 8, "replies": [{"body": "haha I hope you enjoyed the read", "score": 1, "replies": []}]}, {"body": "I wish I could read.", "score": 7, "replies": [{"body": "I put the TLDR at the top. You can ask me anything that you don't understand.", "score": 2, "replies": [{"body": "Too many words. Next time pics do better.", "score": 1, "replies": []}]}]}, {"body": "It’s gonna come down slowly throughout the rest of the week, my guess is we end at 405 to 400.", "score": 3, "replies": [{"body": "My guess is Margot Robbie and Sydney Sweeney are going to have a threesome with me next week 🥴🥴🥴🥴🥴", "score": 7, "replies": [{"body": "Mkay, ban bet it then regard", "score": 6, "replies": []}, {"body": "[My guess is you are broke as fuck and can't even afford nuggets for your fat ass. Post your trades cuckboy.](https://imgur.com/a/TXs0S55)", "score": 3, "replies": []}]}]}, {"body": "So in other words….😁😁\n\nhttps://preview.redd.it/zjc6e2tvuiya1.jpeg?width=2212&format=pjpg&auto=webp&s=2c1c8ec1a12dfbc786c9f50bc3093f8269f29177", "score": 3, "replies": [{"body": "Oh man I love gintama", "score": 2, "replies": []}]}, {"body": "Eloquent.\n\nNo, the recession has not left the room, it is just hiding and waiting to slay us.", "score": 3, "replies": [{"body": "The Margin Call came from within the house.", "score": 2, "replies": []}, {"body": "touché bro", "score": 1, "replies": []}]}, {"body": "Thank for posting. Worth reading in 10 mins", "score": 3, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "“Bearish no matter what” “recession has to happen” “no way we can be bullish” “this is a 7 month bear market rally” “dxy collapsing is somehow bearish” “tech beating earnings is somehow bearish” “march waterfall sell off now moved to July” - 🤡🤡🤡🤡🤡🤡🤡🤡🐻🐻🐻🐻🐻🐻🐻", "score": 8, "replies": [{"body": "Hard to imagine a bull market starting while financials are collapsing.", "score": 5, "replies": []}]}, {"body": "You will lose all your money OP. Do not bet against America 🇺🇸 🦅🤣", "score": 13, "replies": [{"body": "!remindme 8 months", "score": 7, "replies": []}, {"body": "lol you are probably right🤣", "score": 2, "replies": []}]}, {"body": "I really want to play DRV with long dated OTM CALLS.\n\nCRE might get crushed more.", "score": 2, "replies": []}, {"body": "Good read", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "This DD is absolutely superb.  Well reasoned and very thoughtful.  Thank you very much!    \n\n\nPerhaps I missed it, but it would be interesting to see your thoughts on short interest for the regional banks and  REITs.", "score": 2, "replies": [{"body": "Thank you! I haven't paid too much attention to this but I read one article over the weekend and the net position is still long on KRE (both puts and calls piked). Strange but this kind of data is hard to read.", "score": 1, "replies": []}]}, {"body": "Finally some good fucking food.\n\n&#x200B;\n\nGreat post. I really am interested to see what happens with Commercial real estate and see if those same trends bleed into retail real estate.", "score": 2, "replies": [{"body": "Thank you! Overall CER market is still stable except for office loans. But you never know. The kind of derivatives behind these loans are all intertwined and very hard to outsiders to fully understand.", "score": 2, "replies": []}]}, {"body": "Dark Brandon says     'no, it's not'", "score": 1, "replies": []}, {"body": "My dad had an analogy he used often while we worked together and I remember him saying it as a kid.  We sold thousands of Vehicle’s.   Greatest time of my life so far. Regarding our CAR SALESPEOPLE 👩‍💼 if they got there name on the board to often something was not right.  Trouble was lurking 👀….he was always right 99% of the time.\n\nNow picture a CHALKBOARD with a Stagecoach on it (sorry no emoji)…\n\nWFC HAS BEEN on the board for years…..CHALK UP A LOSER when the dust clears", "score": 1, "replies": [{"body": "Are you high?", "score": 3, "replies": [{"body": "Absofuckinglootlee", "score": 1, "replies": []}, {"body": "Wells is fucked as well.  They would be low", "score": 1, "replies": []}]}, {"body": "actually make sense.", "score": 2, "replies": [{"body": "Thanks…\n\nName on board metaphorically speaking", "score": 1, "replies": []}]}]}, {"body": "whole lotta bs for something that you could’ve just said “I think this is what will happen but i’m probably wrong or here’s what i think will happen but none of us know” ![img](emote|t5_2th52|4271)", "score": 0, "replies": []}, {"body": "Everything is priced in. Everything. We are full bull all the way.", "score": 1, "replies": []}, {"body": "4600 EOY", "score": 1, "replies": []}, {"body": "We like SPY to 475.", "score": 1, "replies": []}, {"body": "Great read! Thank you! I take it you're long the 110 TLT leap call and short the 115?", "score": 1, "replies": [{"body": "Thank you. It's a call spread so bought 110 call and sold 115 call", "score": 2, "replies": []}]}]}
