{"title": "Starbucks SBUX - Revenue Generated, by Segment for last 10 quarters.", "selftext": "", "id": "13helma", "created_utc": 1684076798.0, "score": 244, "upvote_ratio": 0.96, "num_comments": 52, "comments": [{"body": "I would love to see their coffee vs espresso vs tea breakdowns.", "score": 49, "replies": [{"body": "Imagine if the sell more milk than coffee", "score": 23, "replies": [{"body": "I work for the company that delivers product to Starbucks. The average store in our market receives anywhere from 80-150 gallons of dairy a week. Estimating coffee products is more difficult because they use multiple mediums; beans, cold brew and concentrates. I would guess they are virtually even though.", "score": 7, "replies": []}, {"body": "Kinda like how Lay’s Potato Chips sale more air than chips. Fuckin’ brilliant assholes!", "score": 2, "replies": []}]}, {"body": "that would be very interesting actually.", "score": 10, "replies": []}, {"body": "Used to run a store. Brewed, espresso, frozen and shaken (other) were the 4 categories I had on my  p&l. From 2016 to 2021 the shaken/other category grew astronomically as the refreshers and such gained popularity, and people could get caffeine without having to drink coffee specifically. The one blip that brought brewed back was the cold foam cold brew stuff. It's still crazy popular.\n\nIt's been 2 years since I ran a store, but I'm happy to try and answer any questions you may have.", "score": 3, "replies": [{"body": "So did brewed fall out of interest or did retailers shift away toward higher margins and disenfranchise brewed coffee drinkers?\n\n\nFor example, Dutch doesn’t even brew coffee.  They will gleefully offer you an Americano though.", "score": 2, "replies": [{"body": "My store had one of the highest brewed coffee ratio in the district, and it was never over 35% (in terms of dollars). Bear in mind that that does not include whole bean coffee, just specifically brewed coffee that we sold at the store. One cup generally paid for a half batch of coffee, so for the most part, it covered itself, but we weren't making a significant amount on brewed. Espresso drinks were much more profitable.", "score": 2, "replies": []}]}]}]}, {"body": "Should have two additional quarters on the chart to account for pre-pandemic levels.", "score": 7, "replies": []}, {"body": "Most recent quarter:\n\n\\-60% revenue from beverages\n\n\\-18% revenue from food\n\n\\-22% revenue from other products (mugs n stuff)", "score": 28, "replies": [{"body": "It looks like beverage revenues barely kept up with inflation (maybe even didn't keep up? hard to tell in the graph).\n\nMaybe COVID caused a lot of people to start making coffee at home and lots of those people haven't really switched back. Or maybe Starbucks finally saturated the market. Or both?", "score": 1, "replies": []}, {"body": "Ok that what counts is the revenue yoy, mom", "score": -19, "replies": []}]}, {"body": "There food options are terrible!", "score": 16, "replies": [{"body": "Idk their bacon egg and cheddar croissant is amazing!", "score": 10, "replies": [{"body": "And sold at Costco. I buy them because Costco makes me hungry and it keeps me from the pizza. Edit. Egg bites*. Sorry", "score": 1, "replies": []}]}, {"body": "I'm actually surprised the food accounts for a quarter of the consumable sales.", "score": 4, "replies": [{"body": "Food includes coffee cakes, muffins, cake pops, grab and go stuff. All kinds of things beyond the hot stuff. It’s not that surprising that it’s 20%. Implies 1 in 4 or 5 buys something to eat with their drink (assumes mostly single orders vs group and similar pricing for food and drink items).", "score": 2, "replies": []}]}, {"body": "Their coffee and espresso are just as bad.", "score": 1, "replies": []}, {"body": "I’m actually a fan of their sandwiches", "score": 1, "replies": []}]}, {"body": "Wow, thanks for sharing this information on Starbucks' revenue by segment for the past 10 quarters! I'm always curious to see how different areas of a company contribute to its overall success. It's interesting to see the fluctuations in revenue between segments and how they compare to each other over time. I'm curious to know if there were any major changes or events that caused these shifts in revenue. Overall, it's great to see Starbucks continuing to bring in strong revenue numbers!", "score": 2, "replies": []}, {"body": "I find it hard to believe that Starbucks, which was built by corporate America, has increased revenue, with all time lows on building rentals and office rentals....are people literally leaving their houses for Starbucks? Or are they buying their brands in supermarkets? Where the fuck is this money coming from?", "score": 5, "replies": [{"body": "Anecdotally, people absolutely leave their houses just for Starbucks. Source: My wife used to work there. Looking at this survey, I'd say it confirms that conclusion with evidence. Or at the very least, it shows that there is no correlation between people working in offices and Starbucks revenues.\n\nEDIT: also, fwiw, this chart doesn't show data from before the pandemic, so it's possible revenues were higher pre-2020, which would confirm your statement. We would have to check additional data to see.", "score": 23, "replies": [{"body": "Mine doesn't work there and still goes out of her way everyday to go there to get her caffeine fix and also do challenges and collect points on the app.", "score": 7, "replies": []}, {"body": "I haven't gone to Starbucks in over 6 years because there's just tons of tiktok girls filling up the drive thru 🙄 and parking lots", "score": 5, "replies": [{"body": "Best reason to go 🔥", "score": 4, "replies": []}]}]}, {"body": "Going out to coffee shops is a cultural tradition in some quarters", "score": 4, "replies": []}, {"body": "They have a foot print that expands nearly globally.", "score": 1, "replies": []}]}, {"body": "They mostly sell milk- I had their “coffee” a few times it’s a complete joke", "score": 4, "replies": [{"body": "Their core coffee is pretty meh, it's nothing but competition for Folger's and such. \n\nTry their Reserve beans some time, the little black 8oz bags. They're not tiny indie roaster good, but they hold up.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "What the hell??? You need to learn how calendars and time works before investing in the stock market.\n\nObviously every single quarter is included from the beginning until the end. \n\nTo be clear: there is no omitted data", "score": 9, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "You’re officially an idiot 🤣", "score": 1, "replies": []}]}]}, {"body": "It’s probably due to when they reported the close of the quarter.", "score": 4, "replies": [{"body": "OP probably should have labeled the quarters instead of the month that the earnings report came out. After all, the quarter is what actually matters for the data.", "score": 2, "replies": []}]}]}, {"body": "It's only up from here", "score": -1, "replies": []}, {"body": "Damn op expenses are 6.4B! Insane", "score": 1, "replies": []}, {"body": "Soooo their “what can I get started for you today” didn’t do jack shit", "score": 1, "replies": []}, {"body": "It’s funny the bev sold increase during pumpkin spice season 😂", "score": 1, "replies": []}, {"body": "Honest question: why are the \"quarters\" inconsistent in terms of their interval?  2021 only has three quarters, for example.", "score": 1, "replies": []}, {"body": "Can’t say I’ve ordered food from there before.  It’s not what I think of when I go to Starbucks but good to see that % increasing a little.", "score": 1, "replies": []}, {"body": "Good for them but like yo people need to put up a pot of coffee lol", "score": 1, "replies": []}, {"body": "Did customers or products prices or both go up over time? I know the answer, but then numbers would be good too.", "score": 1, "replies": []}, {"body": "And then as soon as you buy in… share prices will drop… like the bottom done fell tf out… and then Snoop Dogg’s - 🎶Drop It Like It’s Hot.🎶 starts playing from outta no where. \n\nI came to realize… if you’re not early to the party… then most of the beer is already gone, and the fun has left the bldg. So for this reason… I’m out like a fat bitch in dodgeball.", "score": 1, "replies": []}, {"body": "Now convert the chart to gold", "score": 1, "replies": []}, {"body": "It has an image  ,, it's the best.  Even at $5 z cup", "score": 1, "replies": []}, {"body": "Fuck starbucks. I loat 20k on a earnings play in feb on these overpriced bastards, and oh they missed they most recent earnings too. Fuck them.", "score": 1, "replies": []}, {"body": "This is their peak.", "score": 1, "replies": []}]}
