{"title": "The Election.", "selftext": "I've read a couple posts on here about being due for a recession/crash/pullback which we hear about every month and I haven't pulled out of the market for the past five years upon hearing such fear as I believe in my stocks for the long term.  However, I do believe the market is acting as Hillary will definitely be the nominee as sectors react to what she says and not so much to Trump.\n\nHowever if Trump actually does win I do believe there will be a pullback that will continue to pull back over a longer period of time.  With so much uncertainty on how he will deal with trade/economic/foreign relation, I am for the first time seriously thinking about exiting the market.  This is a much different kind of election and many economists are frightened to the repercussions of a Trump presidency. \n\nI don't want to pull out of the market, but I might preemptively do so at the mere chance that Trump could pull it off.  My question is, am I overthinking this, meaning I know there's always a pullback in election cycles but this one could be way more exaggerated based off the level of Trump's incompetence by what he says publicly.  Is there anyone else out there that feels this way?  If you can talk me down from doing so I would love to hear people's thoughts on the matter..\n\nThanks.", "id": "53i2mx", "created_utc": 1474298667.0, "score": 19, "upvote_ratio": 0.81, "num_comments": 46, "comments": [{"body": "Remember brexit? Something like that will happen to the stock market.", "score": 9, "replies": [{"body": "So a Steam sale for the stock market? Nice.", "score": 2, "replies": [{"body": "Ayy that's what I said.", "score": 1, "replies": []}]}, {"body": "What Brexit? UK is still in the EU. All the fun lies ahead.", "score": 2, "replies": [{"body": "The vote I mean. Just like the American election vote will just be that, a vote, nothing until trump is inaugurated.", "score": 2, "replies": [{"body": "After the vote Trump's inauguration is a mere formality. Terms of the UK's coexistence with the EU, if the Article 50 is triggered aren't certain at all.", "score": 1, "replies": []}]}]}]}, {"body": "I don't understand the rationale of turning 1 million into 10 billion = world financial experts not trusting Trump with economics. \n\nI would have to clarify a little further that I am not a Trump supporter but I just have a hard time understanding how if he is elected that it would incite such a terrible downturn in our country, and the worlds economy. ", "score": 12, "replies": [{"body": "Didn't he also inherit a couple hundred million? Also he's frequently in trouble with debt. His business record isn't exactly spotless.", "score": 3, "replies": []}, {"body": "He did not turn 1 million into 10 billion. First of all, nobody knows his net worth because, surprise, he doesn't publish his tax return. Second, he got *started* with that *small loan*, but obviously when his father died he inherited a ton of money.\n\nAnd, fun enough, he would have made *more* money if he had just put that money into an index fund tracking the S&P 500 instead of building shitty Casinos and fraudulent universities.", "score": 3, "replies": []}, {"body": "his personal business 'success' will have little correlation with how his policies may or may not tank the economy. but he supposedly turned 1 million into 5 billion (so he claims, but we don't actually know). whereas, if he had just invested in an index fund, he would be twice as wealthy now", "score": 4, "replies": [{"body": "The puppet may be different but the hands are still the same. \n\nPeople fear Trump because he's not a part of the establishment and isnt owned by anyone. \n\nI really doubt a president would be able to make a policy that would have such a negative effect on the economy. ", "score": -3, "replies": [{"body": "I actually only respect Trump because of his business prowess (even if he would have had more in index funds). That doesn't make him an economist, nor will it keep him from wrecking the economy in order to push any of his agendas or help his own business positions. ", "score": 0, "replies": []}]}]}, {"body": "Doesn’t he also have a few bankruptcies under his belt? And subsequent bailouts from his family?", "score": 2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Trump University is a bigger scam than Wsb University ", "score": 4, "replies": []}, {"body": "http://www.politifact.com/florida/article/2016/mar/07/did-donald-trump-inherit-100-million/\n\nhttp://www.politifact.com/truth-o-meter/statements/2016/jun/21/hillary-clinton/yep-donald-trumps-companies-have-declared-bankrupt/\n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Meant to reply to u/brochantas not you. He asked a question and I did a 2 second google search. However I like your response. ", "score": 4, "replies": []}]}]}]}, {"body": "Care to provide any sort of proof or you just spewing out rhetoric?", "score": -3, "replies": [{"body": "Uh, those were genuine questions.", "score": 2, "replies": [{"body": "Oh sorry then one second please", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Look 5 comments up there is a few links I had posted. \n\nThere is also google. ", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "And your point is what?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Are you retarded? \n\nI was the one who posted the links. You're replying to a month old post. \n\nAnd you have no clue of the context of the original comments. \n\nGet a life. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "It doesn't matter who wins, initially the market will go down. Just due to uncertainty, just like with Brexit. Then the market will remember that the new president cant really make huge changes, then it will be business as normal. ", "score": 5, "replies": [{"body": "Totally agree", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "how often are you investing, and how much? Im in my mid twenties as well and just got into it. Just wondering, if that's too personal I apologize. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well that's good to here, Keep it up! Sounds like you have a solid plan.Any tips like if you only knew then what you know now type stuff? Also thanks for the response!", "score": 1, "replies": []}]}]}, {"body": "I'm a make white New Yorker. Really anyone could win and if be *okay*, but yeah... Long time horizon", "score": 1, "replies": []}]}, {"body": "Historically, do we have much information about market dips during election months?", "score": 2, "replies": []}, {"body": "Got no stock tips to offer, just wanted to tell you that you have every right to be concerned about this election.", "score": 3, "replies": []}, {"body": "If you're really fearful of a Trump presidency than invest in the industries he champions; weapon and ammunition manufacturers, realestate, and natural resources production.", "score": 2, "replies": [{"body": "Sooo America?", "score": 9, "replies": [{"body": "$MRCA", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I have friends who work with gun manufacturers. Every ti me there is a act of terrorism on U.S. soil gun stores sell out. I don't think it's an Obama thing considering he and Hillary want to take some of the guns away.", "score": 2, "replies": [{"body": "It's not terrorism, after any widely publicized mass shootings the first thing Obama will talk about is gun control at the federal level. Although he has failed at pushing these laws, they still do not deter people from buying.", "score": 2, "replies": [{"body": "And I repeat. Stores always sell out of guns after a terrorist attack.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "\"Minnesota Market sold out in a day near the incident, east coast had a huge spike in demand within 12 hours.\"", "score": 2, "replies": [{"body": "Nice try, but that quote does not exist when searched. ", "score": 1, "replies": [{"body": "Sorry I should've stated, it's from my manufacturing friend. Take if for what you want. Free advice.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I'll preface this with the fact that I'm not a trader and I dont know anything.\n\nThat being said if I did, I'd short everything before the election if I knew trump was gonna pull it off ", "score": 1, "replies": []}, {"body": "If your long term then why not add to your positions if we do have a down market. ", "score": 1, "replies": []}, {"body": "I expect the market to be up and down after the election, but I think it will be back to normal by the middle of next year. It turns out a President can't really make that many changes without Congress. The only version of things going really sideways would be Trump getting elected and getting us into a bunch of wars.\n\nBest site for tracking the election: http://projects.fivethirtyeight.com/2016-election-forecast/?ex_cid=rrpromo", "score": 1, "replies": []}, {"body": "Most realistic scenario: HC becomes the next president - market remains calm. ", "score": 1, "replies": []}, {"body": "Well I actually think that a Trump win would result in a massive decline in international trust and cause instability, especially since he is completely unfit and most people on Wall Street can't stand him including the FED.\n\nHe won't win though, he will get crushed at the debates.", "score": 1, "replies": [{"body": "Of course wall street loves Hillary. Birds of a feather usually flock together. ", "score": 5, "replies": []}, {"body": "Nah. Hillarys got too many skeleton's in the closet and that will crush her at the debates.", "score": 2, "replies": [{"body": "Trump university bro", "score": 0, "replies": []}]}]}]}
