{"title": "Who else planned on waiting for the Fed decision and now is seeing everything rise?", "selftext": "I actually bought Nio yesterday and also Sbux so not entirely a bad position but wanted to buy a lot more. \n\nThought it was kind of risky to do so before the Fed meeting results but now it seems that unless we get a really high interest rate like 2% I'm already not buying the dip. \n\nWhat are your strategies? Are you also waiting for the Fed decision or have you invested already?", "id": "tffou2", "created_utc": 1647430914.0, "score": 31, "upvote_ratio": 0.74, "num_comments": 96, "comments": [{"body": "Zoom out. We’ve had some major rallies within a continuing downtrend.", "score": 82, "replies": [{"body": "Zoom out even more, and we’re in a continuing uptrend.", "score": 43, "replies": []}, {"body": "If I learned anything from this sub it's to inverse the leading opinions here. When everyone here says to sell sell sell that's when I buy", "score": 21, "replies": []}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Some uncertainty will be less uncertain, and other uncertainty will remain uncertain.\n\nAnd there may be additional uncertainty, the nature of which is itself uncertain, therefore it is impossible to determine the degree of uncertainty of this as-yet uncertain uncertainty.", "score": 4, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "As the market gets cheaper smart people buy more shares of either VTI and or blue chips.", "score": 1, "replies": [{"body": "I’m blushing", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "Take a look out 5 or 10 years genius.", "score": 0, "replies": []}]}, {"body": "Don't worry, everything will be back down by Monday.", "score": 83, "replies": [{"body": "Or up, or flat. Just focus on valuations, not price movements. They're irrelevant.", "score": 26, "replies": [{"body": "Not irrelevant if you want to make money on trading the short term price movements.", "score": -3, "replies": [{"body": "Short term trading is dumb.  Long term is the way to think.  Less stress and more money.", "score": 10, "replies": [{"body": "Better taxes too", "score": 3, "replies": []}]}, {"body": "You would be a fool to think you can do this.", "score": 16, "replies": [{"body": "Lotta fools here though.", "score": 9, "replies": []}]}]}]}, {"body": "I need QQQ to be down by Friday. Bought Some PUTS", "score": 3, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "That is the game. One makes money one losses", "score": 3, "replies": []}, {"body": "You'll lose in the end.  Long term investing not short term.", "score": 1, "replies": []}]}, {"body": "Lol QQQ will rally the rest of the week after FED speech.", "score": 4, "replies": [{"body": "That’s how it’s looking..", "score": 6, "replies": []}]}, {"body": "Thing long not short. What you're doing is a losing game.", "score": 1, "replies": []}]}, {"body": "And up 5 years from now......", "score": 1, "replies": []}]}, {"body": "I’m still going to wait, this has been a trend there is a run up then a big sell off after the fed meeting.  I’m hoping this is finally the one where things stabilize but I’m not falling for no day trading shenanigans", "score": 10, "replies": [{"body": "Why? Do you want to pay less or more for shares? I'm rooting for another 20% down.  I'm in accumulation mode not retirement mode.", "score": 2, "replies": [{"body": "Keep accumulating", "score": 2, "replies": []}]}]}, {"body": "Waiting and watching. I think the two most likely scenarios are:\n\n1) They walk the tightrope perfectly and we see a brief rally into the end of the week before the market starts another (final?) leg down; or\n\n2) They indicate their intention to continue with the expected 7 rate hikes this year, at which point the markets sell off big in anticipation of an inevitable recession.\n\nI don't see any scenario in which the market has already bottomed.", "score": 14, "replies": [{"body": "Expected by who? Fed's intention was to go with 4 hikes last time.", "score": 3, "replies": [{"body": "Where have you been man? The markets have been pricing in 7 hikes for months now. Here's an article from yesterday: [https://www.bloomberg.com/news/articles/2022-03-14/fed-traders-are-almost-back-to-fully-pricing-in-seven-hikes](https://www.bloomberg.com/news/articles/2022-03-14/fed-traders-are-almost-back-to-fully-pricing-in-seven-hikes)", "score": 4, "replies": [{"body": "That's why I said by who? Fed's official stance still averages around 4. And if they still keep the same stance (or maybe 5) because of the war and the recent decrease in PPI, it would still show that we've seen the dip.", "score": 1, "replies": [{"body": "Fed's official stance right now is 6 more hikes on 6 more meetings, 75 basis points move for the next two meetings.", "score": 1, "replies": [{"body": "Yep, I'm actually suprised they have decided to go with the expectations of the market in this uncertain environment from war and increasing chances of recession. More suprised that ndx closed almost +4%. I guess 7 increases were really priced in.", "score": 1, "replies": [{"body": "Market probably moved up because of remarks about how strong the market is right now and how little there is a chance that recession will occur. People are trigger happy and bought in. Wouldn't be surprised if we go back to mostly red days by Monday tbh.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Because you're choosing not to.\n\nIf the announcement is what is expected (small consecutive rate hikes to end up in the 2-3% range), the market will recover \n\nUncertainty is the reason for the pullback and interest rates going to where they were in 2019 will not trigger a recession lol", "score": 3, "replies": [{"body": "No, it's because the Fed is in a very sticky situation and it's difficult to see how they can navigate this without putting a scare into investors one way or another.\n\nUncertainty is only part of the reason for the pullback. The pullback is because the Fed is planning to raise interest rates and tighten their balance sheet, and now the impact of the war in Ukraine has increased the likelihood of a worldwide recession. If they raise rates too slowly, inflation gets out of hand and is disastrous for the economy; if they raise too quickly, they risk sending the economy into recession.\n\nThings are a lot different now than they were a month ago, when we didn't have spiking oil and other commodity prices, more COVID lockdowns in China (which will have another ripple effect on supply chains), and a friggin war in Europe.", "score": 1, "replies": []}]}]}, {"body": "Pump before the dump today", "score": 25, "replies": [{"body": "Coming to reddit reminds me that there's so many suckers out there", "score": 13, "replies": []}, {"body": "Awesome bring it on!", "score": 1, "replies": []}]}, {"body": "Always DCA. No one knows what is going to happen, so buy some now, buy some later.", "score": 16, "replies": [{"body": "Unfortunately some insiders already know and they'll profit as usual.", "score": 3, "replies": [{"body": "Who cares about them?", "score": 4, "replies": []}]}, {"body": "Exactly brother!", "score": 1, "replies": []}]}, {"body": "Stop being traders and become accumulators.", "score": 4, "replies": []}, {"body": "Expecting a good couple of days before continued down trend. My plan is to take profits and wait for the next dip", "score": 7, "replies": []}, {"body": "When will the Fed's make the decision", "score": 3, "replies": [{"body": "2pm ET", "score": 4, "replies": [{"body": "phones home?", "score": 3, "replies": [{"body": "Ha!", "score": 1, "replies": []}]}]}, {"body": "Today", "score": 1, "replies": []}, {"body": "In about 7 hours", "score": 1, "replies": []}]}, {"body": "You bought nio? Did you have some Intel? Lol nice move", "score": 3, "replies": [{"body": "Just because it was rising and I regreted not buying at 13 so bought it at 14,5$ lol, was lucky", "score": 2, "replies": []}]}, {"body": "You can’t time the market.  \n\nThe best option is to set up automatic purchases on a fixed schedule (e.g., every week or every two weeks).\n\nIf you insist on not investing automatically, the next best option is to do the opposite of what everyone else does - buy a stock when the price is falling, not when it’s increasing.", "score": 5, "replies": []}, {"body": "Bull trap", "score": 3, "replies": []}, {"body": "NIO is up because of the news of China backing overseas IPOs and trying to stabilize Chinese financial and real estate markets. \n\nSBUX is up because founder, Howard Schultz returns as interim CEO while the current one is set to retire. \n\nBoth were unrelated to the Fed meeting ahead, so I would just chalk it up to being unlucky timing (for you). \n\nI’m not changing any plans with how I invest, whatever money comes in a portion goes to investments/ retirement accounts. My next cash inflow is Friday, so won’t be buying more today.", "score": 2, "replies": []}, {"body": "Isn't this a buy the rumor sell the news?", "score": 2, "replies": []}, {"body": "It is really hard to know if there is going to be a rally now. SPY isn't breaking below about 415, so that seems to be a hard price floor for now. We did pass the death cross 50 and 200 day moving average. Whether that is a leading or lagging indicator, I don't know.  I would say wait for the next down day and then buy. Just buy a little on down days for the next few months.", "score": 2, "replies": []}, {"body": "Sell while others are buying this little pump and buy again once it goes down. And it will since Russia is still bombing Ukraine", "score": 3, "replies": [{"body": "What does Russia bombing Ukraine have to do with SPY?\n\nMost supply chains have been largely unaffected. Dont buy into market hysteria. Or you end up holding Weat at 12.50 and Oil contracts at $120 🤡\n\nPeople really need to read up on details about the export markets they're speculating on. So many clueless traders buying on headlines.", "score": 1, "replies": [{"body": "Definitely not buying oil!", "score": 1, "replies": []}]}]}, {"body": "If you have cash and are buying solid companies at a huge discount I wouldn't worry . NIO is extremely risky though . I'm into LCID + ZEV", "score": 0, "replies": [{"body": "LOL at considering LCID and ZEV \"solid companies\" trading at a discount.\n\nSolid companies trading at a discount are stocks like DIS, PYPL, etc.", "score": 11, "replies": [{"body": "I was referring to NIO.\nMy solid are IONQ + AEHR + RDW + ONDS + CLFD + MQ", "score": 1, "replies": [{"body": "None of those are solid companies. If those are your solids, what the hell does the rest of your portfolio look like?", "score": 4, "replies": [{"body": "Except for MQ all have been extremely stable during these turbulent times", "score": 1, "replies": [{"body": "First of all, a stable stock price does not mean it's a strong company. Second, they haven't exactly been stable. \n\nIONQ is down about 60% since November.\n\nAEHR has been around forever and yet only generates $28 mil in annual revenue. I have no clue why it rocketed 1000% in about 6 months last year, but it's also down about 65% off its recent highs.\n\nRDW is down 50% from its highs and is about 30% below its IPO price. I can't even find financial info on that company.\n\nONDS has $2.5 mil in revenue and is trading at a P/S of about 55. The stock may be flat this year, but it's near all time lows and down about 66% from its highs.\n\nI don't know what you're looking at.", "score": 2, "replies": [{"body": "My portfolio is down 45% since Nov 9th.\nMade a killing with IONQ when it jumped to $29.27.\nIt's a leader in quantum computing .\n\nAEHR Is in an interesting business.  Was up considerably and not so much.\n\nONDS + RDW +CLFD + MQ + NVTS bought 6 weeks ago.\nDown on the last 2.\n\nWhich stocks do you recommend?", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">NIO is extremely risky though . I'm into LCID + ZEV\n\nIsn't LCID at those prices much more risky than NIO was at yesterday price?", "score": 6, "replies": [{"body": "No risk of being delisted. \nThat problem aside NIO has not gone anywhere since I first bought 16 months ago.\n\nAll I read about LCID is promising.  Slow start though.", "score": 1, "replies": [{"body": "Risk of going bankrupt thought. I made more than 300% on both of those stocks, but I think there is a very high risk / high reward to them. (sold both my positions already)", "score": 4, "replies": [{"body": "Great !!", "score": 3, "replies": []}]}, {"body": "Lucid the company is promising, Lucid the stock not so much. Same story with Rivian or NIO above 20 (even if you ignore delisting risks or the fact that you're not actually buying stock in the company).", "score": 2, "replies": []}]}, {"body": "depends how you define risk", "score": 0, "replies": []}, {"body": "IMHO: LCID has a high chance of going bankrupt.", "score": 1, "replies": []}]}]}, {"body": "Market is frothy and that’s usually not a good thing. Lots of room downward still to go", "score": 1, "replies": []}, {"body": "Time in the market", "score": 1, "replies": []}, {"body": "Never in my wildest dreams would I ever have thought I’d hear someone characterize 2% as a “really high interest rate.”  I hit adulthood in the late ‘70s, with the country on its way to a prime rate of 21%.  THAT was Fed tightening and a “really high interest rate.”  Fifteen years ago I would have gone into hysterics if anyone had said we’d get to 0%.  With inflation running at almost 8%, a 2% rate is still free money on a real basis.\n\nI’m long stocks, been long stocks, and will stay long stocks until the day I die.  2%.  Ridiculous.", "score": 0, "replies": []}, {"body": "It is rising now. No guarantee we won't be in the red when trading concludes.", "score": 1, "replies": []}, {"body": "I was deep in red. I am still closing my positions. I am about to get 1500 shares of Rblx assigned at $55 so not much choice for me.", "score": 1, "replies": []}, {"body": "Similar boat here. Been buying PROSY (Tencent proxy) over the last few days. Sounds good now that it's up over 20%... until the fact that I sold all of my BABA (+20%) and JD (+30%) beforehand to trickle into PROSY. Thought I had a lot more time.", "score": 1, "replies": []}, {"body": "No point in timing today what is taking place over the whole year. So pointless, unless you’re a day trader.", "score": 1, "replies": []}, {"body": "Rally probably will be short lived.  Trying to hear that their next move is. Market will likely misinterpret the intend.", "score": 1, "replies": []}, {"body": "I think the market was just oversold the last couple weeks. Whenever there is a major dip it pumps for a time to fuck over option sellers.", "score": 1, "replies": []}, {"body": "I couldn't care less. White noise.  Look out further than your nose.", "score": 1, "replies": []}, {"body": "API controversy: \n\n&nbsp;\n\n reddit.com/r/ apolloapp/comments/144f6xm/ \n\n&nbsp;\n\n comment edited with github.com/andrewbanchich/shreddit", "score": 1, "replies": []}, {"body": "I bought on Monday and sold some today\n\nI couldn't pass on msft at 278 and baba at 74 vti at 210", "score": 1, "replies": []}, {"body": "Just DCA.. you literally cannot go wrong with this if your time frame is 3yr+\n\nI DCA + sometimes buy the dip.. bought a bit of NVDA, Apple, Microsoft before the small rally we see", "score": 1, "replies": []}, {"body": "Reminder: Time in market beats timing of market.", "score": 1, "replies": []}, {"body": "we were at january 2021 levels at march 22 and you were waiting on a 0.25 interest rate decision.", "score": 1, "replies": []}, {"body": "Anyone wanna explain why Toyota’s stock was declining so much before this rally?", "score": 1, "replies": []}]}
