{"title": "For those of you who believe in technical indicators- Nasdaq 100 chart to produce first 'death cross' in nearly 2 years", "selftext": "The Nasdaq 100 Index NDX, +1.70% chart is set produce a bearish \"death cross\" signal on Wednesday, for the first time in nearly two years. A \"death cross\" appears when the 50-day moving average (DMA), a widely followed short-term trend tracker, crosses below the 200-DMA, a longer-term trend guide. Many chart watchers view a death cross as marking the spot that a pullback transitions to a downtrend. The technology-heavy Nasdaq 100's 50-DMA is set to open at 15,054.01, down from 15,089.92 on Tuesday, according to FactSet, while the 200-DMA is set to rise to 15,093.37 from 15,089.91. Through Tuesday, stock charts of 50 of the index's components have produced \"death cross\" patterns. The last \"death cross\" appeared on April 30, 2020, but that was a little more than a month after the index already closed at its COVID-19 bottom of 6,994.29 on March 20, 2020. That \"death cross\" was erased three weeks later with the appearance of a \"golden cross,\" in which the 50-DMA rose back above the 200-DMA. The last \"death cross\" before that one appeared Dec. 3, 2018, and the index fell another 16% over the next three weeks before bottoming. The Nasdaq Composite COMP, +1.62% is currently under the influence of a \"death cross,\" but the S&P 500 SPX, +1.86% and Dow Jones Industrial Average DJIA, +1.79% aren't, yet.\n\n[https://www.marketwatch.com/story/nasdaq-100-chart-to-produce-first-death-cross-in-nearly-2-years-2022-03-02?cx\\_testId=22&cx\\_testVariant=cx\\_1&cx\\_artPos=8&mod=home-page-cx#cxrecs\\_s](https://www.marketwatch.com/story/nasdaq-100-chart-to-produce-first-death-cross-in-nearly-2-years-2022-03-02?cx_testId=22&cx_testVariant=cx_1&cx_artPos=8&mod=home-page-cx#cxrecs_s)", "id": "t5n7hz", "created_utc": 1646297309.0, "score": 57, "upvote_ratio": 0.78, "num_comments": 99, "comments": [{"body": "Does this have literally _any_ predictive ability i.e. More than random chance to predict anything at all?", "score": 66, "replies": [{"body": "No.  TA doesn’t work because it requires you to throw out logic and reason and accept that there’s predictive magic in the price history on the chart.\n\nIn some cases people backtest TA and claim\nIt has predictive ability.  The “death cross” is a perfect example.  When the 50 DMA crosses the 200 DMA it means the market is in a bit of a risk-off panic which usually implies an over correction.\n\nHowever, in this case you’ve simply got 2 crises stacking on top of each other within 3 weeks which has created the “cross.”  That’s the problem with following TA, is you have to suspend your knowledge of situations and trust a price movement chart that is moving for actual, real world reasons.", "score": 45, "replies": [{"body": "Data engineer here.\n\nThese numbers are too \"nice\" looking and makes me doubt their truth. When optimizing a problem it's rare that the answer to it are nice round numbers that people like. \n\nWhy the 50DMA and 200DMA?  Why not (53, 202)? Or (67, 234)? What about using expontial MA?, Why should each day be weighted equally, what about using Volume Weighting? What about dynamically changing the values used based on certain conditions. Etc. Etc. \n\nWhat about using modified definitions of moving averages that allow fractional moving averages to make sense to allow gradient descent like approaches to find minimums and maximums. The stock market is far too chaotic for approaches like this to work but even if it did, the output would not be nice round numbers and would be something like say 53.45, 202.36\n\nThese are extremely basic approaches to quant trading and the back propagation testing has already been done with technical analysis. It's garbage and has no predictive capabilities. And if it did, it would be a complicated algorithm, only able to be used under specific condition and has very thin win rates. And certainly, the optimized numbers to be used would not be round numbers. \n\nThe fact that round numbers are used says more about human nature and liking \"nice looking\" numbers like 50 and 200. Any 2 moving averages could be used so we essentially have a 2 dimensional grid of possibility that people axiomatically choose 1 coordinate on it and used the conclusions from that to drive some sort of \"meaning\" from.", "score": 6, "replies": [{"body": "That’s a bad objection, obviously the numbers are arbitrary but most people consider these tools heuristics that give you valuable but imperfect information", "score": 2, "replies": [{"body": "Valuable in what sense? I can run a backtest and show that an algorithm using an MACD trading strategy is not profitable at all. It has no predictive capabilities.\n\nIt's not even imperfect, it gives you 0 information about future price movement.", "score": 3, "replies": [{"body": "You know how big investors always say to invest in good companies and not worry too much about the details? But then they also talk about buying for the right price. Well, what's the right price, even if you consider the company has \"value\"? Let's say the PE and P/S and book is all good enough to consider it buying. \n\nAt which value exactly do you buy?\n\nConsidering any given stock oscillates on average 50% for the last 70 years (lynch's quote, not mine) naturally you would want to buy when the sucker is lowest.\n\nWhether you lump sum or DCA as strategies to invest, you still want to put money in INTC (for example) at 45, not 50. Where would you even get those values from? Sure you can DCF to analyze it but that still relies on several estimates and the price still variates according to sentiment (world events, fed).\n\nAnd after you go through all that you're faced with past market activity which you can choose to ignore or analyze. TA is just guesstimating based on that activity, once you correlate the full context.\n\nIt's pattern recognition and it can work within the lengths of time when the context remains stable or at least predictable. When people claim \"everyone's a genius within a bull market\" they're already making TA claims on the whole market.\n\nDay traders certainly make use of TA once they do their homework. Always trading the same instrument they know very well: what factors drives it up or down etc.\n\nSure on its own it's no miracle algo but that's only natural. If you shove enough other algos and info in it, it certainly does yield results. Plenty of companies make money doing exactly that.", "score": 1, "replies": [{"body": "I can understand using it as an indicator to gauge a good entry point for a long term play.\n\nI was more addressing people who use it for day trading or scalping.\n\n> If you shove enough other algos and info in it, it certainly does yield results.\n\nUp to a point sure, but more data has a diminishing returns element to it. Quality data is much much more important than quantity. What determines which data is quality and which isn't? Not an easy question to answer. Even people way smarter than you and me can't answer that question.\n\nI think you have a naive view of quant trading. Big hedge funds don't beat the market. Beating the market is next to impossible. You should pop your head in /r/algotrading people there have tried and tried for years.\n\nEven if you do find some algorithm that makes you money, at some point it will stop working, randomly and without warning. and you will lose money. The market evolves and is efficient. If there's a way to make money others will catch on and milk the margins of that easy money down to nothing.", "score": 3, "replies": [{"body": "Afaik there are a couple of investment funds which crawl data from events worldwide, correlate with several algorithms to beat the market. I can't remember the name of a particular company right now since I've seen a documentary on them long ago but supposedly it's built-up by PhDs and consistently beat the market for decades now.\n\nI'll see if i can find the video on it.", "score": 1, "replies": []}]}]}, {"body": "I’m just saying your objection based on those even numbers didn’t make sense", "score": 1, "replies": []}]}]}]}, {"body": "It all sounds like trying to pull out reasons out of your ass for why things happen when nobody actually knows. TA is guessing until you guess right, then it's a 'I told you so' when they are ignoring the 10 other trades that failed. \n\nTA is bullshit and whenever someone tries to provide TA it tells me they have no idea what they are talking about and I shouldn't use any of their ideas. \n\nAny TA experts out there go hang out with the Astro boys that think the stars will tell them the prices because that's how reliable TA is", "score": 9, "replies": [{"body": "That's because you don't understand it.\n\nSpend a bit of time learning about candlestick patterns, moving averages, and supply/demand zones and you'll come to see the value.", "score": 4, "replies": [{"body": "What % edge do you think someone that is using TA has over someone else? Is it 1%? 2%? 5%?\n\nIf the best hedge funds in the world cannot use TA (and other methods) to consistently beat the market over long periods of time (20+ years), what makes you think you'll be able to do it?", "score": 2, "replies": [{"body": "No idea.\n\nHow do you know how TA is or isn't used by hedge funds? I'm sure a lot of professionals use it in some form or another to identify their entry and exit points. I'm not talking about pure TA trading here; I'm talking about using TA to supplement fundamental analysis. You use FA to identify which stocks to buy, and then TA to find the best entry points.", "score": 2, "replies": []}]}, {"body": "Hey if it helps give you purchase bias and gives you confidence behind your buys then hey. You keep doing you. But to anyone that thinks they are better then the market and can predict it have no idea what they are talking about", "score": 4, "replies": [{"body": "Purchase bias?", "score": 1, "replies": [{"body": "Official term is choice supportive bias. Sorry", "score": 3, "replies": []}]}]}, {"body": "No sense in arguing. Fewer competent players is good for us. Use your TA and profit.", "score": -1, "replies": [{"body": "Heh, it's funny to me people will reject it out of hand without any sort of research into it.   I was trading without using any TA and getting slaughtered.  I started to study TA to try and improve my trading.  I barely have any understanding, but even the most basic of recognizing trend lines and having a decent idea of when they will hit support or resistance is a massive leg up to my essentially dart throwing of before.", "score": 4, "replies": []}, {"body": "There is sense in arguing because I'm trying to correct a misconception about TA. But if you want to be stubborn and closed-minded and think you know everything, I couldn't care less.", "score": 2, "replies": [{"body": "Have you beaten the market over the last 15+ years using TA?\n\nIf not, I don't care at all about what you're saying about TA", "score": 3, "replies": [{"body": "I think your mind is too simple to really understand it.", "score": 1, "replies": [{"body": "You claim TA works.\n\nI asked for evidence of that.\n\nYou went to an ad hominem - insulting me - instead of providing evidence that TA works, either through peer reviewed research, or even more anecdotally, your portfolio outperforming the market. \n\nYou can claim my \"mind is too simple\", but the reality is that I base my knowledge and beliefs around scientifically proven statements, and TA providing a statistical edge is not a scientifically proven statement. Simple minds are minds that don't require evidence to prove their baseless claims.\n\nThose who have to insult in an argument - you - have already lost the argument.\n\nHave a great day :)", "score": 1, "replies": [{"body": "You responded to my post by essentially saying that if I haven't beaten the market, my opinion is worthless.\n\nIf you read any of my other replies, you'll understand why posting evidence about the benefit of TA isn't as simple as you think it is. Your comment also shows a lack of understanding of the fact that many people use TA in conjunction with fundamental analysis, which makes it even more difficult to isolate the added value of TA.\n\nLack of evidence that something works isn't the same thing as evidence that it doesn't work.", "score": 1, "replies": [{"body": "\"You responded to my post by essentially saying that if I haven't beaten the market, my opinion is worthless.\"\n\nYes, and I stick by this statement. You're claiming that TA gives an edge, so prove that your usage of TA has given you edge - against the market - by either showing your portfolio/gains, or proving it has made you made more successful trades then failed trades. Or, at the very fucking least, provide some peer reviewed research, or statistics, to back up your claim.\n\n\"Lack of evidence that something works isn't the same thing as evidence that it doesn't work.\"\n\nAhh okay, so you're using the same nonsensical argument that christians use to prove god is real.\n\nYOU claimed that TA provides an edge. Provide evidence of that fact. The onus is on YOU to prove it, since YOU brought it up. If you can't provide evidence because TA's statistical edge is hard to isolate from fundamental analysis, that doesn't really prove your point very much, does it? I'll give you that it can be hard to prove, but if you're really claiming that statistically TA gives an edge, you should have SOMETHING to back that up...And you don't.\n\nFor someone so vehemently in favor of TA, I'd expect you to have some sort of evidence that it works. The fact that you don't is quite honestly shocking.", "score": 1, "replies": [{"body": "Just take a minute to think about this. How could I possibly prove that technical analysis works? There's a reason the data doesn't exist - because it's virtually impossible to study. \n\nIf I told you I've beaten the markets over the past 5 years, is that because of technical analysis or because I chose the right stocks? No way to know. And if I didn't beat the market, is that because TA failed or because I picked poorly? \n\nNow let's say I wanted to test the effectiveness of candlestick patterns, which is partly what I use. Candlestick patterns are visual patterns on a chart, so how would I test that? It would require programming machine learning software and feeding it thousands and thousands of charts until it learns to identify the various patterns. Then I would have to develop a program that the computer would use to make purchase decisions based on specific criteria. Not exactly an easy task.\n\nThe only practical way to study this would be to compare something like a DCA strategy using regular purchase intervals to DCA using technical signals. Here's an example, which shows that DCA using TA is less profitable: [http://rstudio-pubs-static.s3.amazonaws.com/281654\\_cd7523ccedc74ae88abe069770b07917.html](http://rstudio-pubs-static.s3.amazonaws.com/281654_cd7523ccedc74ae88abe069770b07917.html). However, this study uses a very specific technical swing-trading system involving short-term moving averages and a bunch of indicators and oscillators. So all this one study proves is that you're better off DCA'ing on regular intervals than using *this particular swing trading strategy*. That doesn't mean TA doesn't work. To reach that conclusion, at least in the DCA context, you would have to study every single combination of TA strategies.\n\nSee my point?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I use TA every day. It's an art if you ask me. A couple of patterns butter my bread.", "score": 1, "replies": []}]}, {"body": "So, which analysis do you follow?", "score": 1, "replies": []}]}, {"body": "This is a fundamental misunderstanding of TA.\n\nNo actual followers of TA claim that it has predictive power. What it does, if used properly, is it helps you understand the underlying supply and demand and gives you insight into investor psychology. It absolutely can increase your odds of success.", "score": 19, "replies": [{"body": "You just said two things that are contradictory. Increase odds of success implies that it gives you information about future price movements, which implies it has predictive power. This is basic information theory. A model either conveys information or not.", "score": 17, "replies": [{"body": "No, they're not contradictory. There's a difference between:\n\n1) \"This signal means price will do x\"\n\nand \n\n2) \"This signal increases the likelihood that price will do x\"\n\nCritics of TA think its followers subscribe to (1) when they actually subscribe to (2).", "score": 8, "replies": [{"body": "Maybe some people think 1), but that is not what is meant by \"predictive power\". 2) is very much predictive power. And the predictive power mentioned in 2) is actually very, very powerful. Any model that can predict the likelihood of price movement that is better than a random guess, is a model that can make you a lot of money.\n\nSo, when people like me say that TA has no predictive power, we don't mean that it can't predict things with certainty. We mean that it can't predict things with better likelihood than randomly guessing, either. We meant that it can't even do 2). Because here's the thing about the predictive power in 2). It is verifiable. Even a small improvement in the ability to predict likely outcomes can be modeled on a computer and verified through multiple simulations. If you cannot produce such verifiable simulations, the predictive power does not exist.", "score": 16, "replies": [{"body": "Okay sure. I was responding to the \"predictive magic\" comment.\n\nThere are actually some studies showing predictive power for certain candlestick patterns but TA is virtually impossible to study because of the methodological issues.\n\n1. TA covers a whole whack of stuff so you have to be able to isolate exactly what you're studying. Moving average signals? Candlestick patterns? Support and resistance?\n2. Once you isolate a particular TA indicator, you then have to identify a specific signal. So if we're going to study moving averages, for example, you have to decide on buy and sell signals to test. Are we testing what happens if you buy as soon as price pulls back to the moving average? Or within a certain price range of the moving average? Or wait for a confirmation signal?\n3. Then you have to figure out out to account for different variables. For example, how does the daily volume affect the predictive power of the moving average signal?\n4. If you're able to figure all that out, the next challenge is how to test it. If you want to test a large enough sample, you'll have to run computer simulations. Which means being able to program the specific variables into a computer so the computer can identify the signal. That might be easy for testing very simple and specific signals, but it becomes much more difficult with more complex TA indicators that require visual identification. Imagine how difficult it is to teach a computer program how to identify an ascending wedge candlestick pattern, for example.\n\nThe thing people have to realize is that basic TA concepts were developed out of experience - people looking at lots and lots of charts and noticing that certain things were more likely to occur after certain signals on the chart.", "score": 2, "replies": [{"body": "So all your questions have a simple answer: just use the values that you use to guide your decision making. To elaborate:\n\n&#x200B;\n\n>TA covers a whole whack of stuff so you have to be able to isolate exactly what you're studying. Moving average signals? Candlestick patterns? Support and resistance?\n\nUse the set of indicators that you actually use to make your trading decisions.\n\n&#x200B;\n\n>Once you isolate a particular TA indicator, you then have to identify a specific signal. So if we're going to study moving averages, for example, you have to decide on buy and sell signals to test. Are we testing what happens if you buy as soon as price pulls back to the moving average? Or within a certain price range of the moving average? Or wait for a confirmation signal?\n\nWell, what are the signals that you actually use to trade? To make your decisions, you must have already come up with a set of rules that tells you what to do based on how the indicator behaves? Otherwise the indicator cannot guide your action and therefore is not useful for trading. In that case, just test your actual rules.\n\n&#x200B;\n\n>Then you have to figure out out to account for different variables. For example, how does the daily volume affect the predictive power of the moving average signal?\n\nGood question. What do you actually do when you have this signal? Do you take the daily volume into account to use this signal? If so, use the actual method you use to guide your action, with regards to how you treat this input variable.\n\n&#x200B;\n\n>If you're able to figure all that out, the next challenge is how to test it. If you want to test a large enough sample, you'll have to run computer simulations. Which means being able to program the specific variables into a computer so the computer can identify the signal. That might be easy for testing very simple and specific signals, but it becomes much more difficult with more complex TA indicators that require visual identification. Imagine how difficult it is to teach a computer program how to identify an ascending wedge candlestick pattern, for example.\n\nNone of this is difficult for computers. We have decades of existing data to test with. And computers can crunch through complex sets of logic with ease. You have a signal with one million input parameters and thousands of rules? No problem. the computer can go through that in minutes, if not seconds. You need the computer to recognize a pattern? No problem, just feed it some examples of the pattern and it'll recognize it. This is all really basic stuff for computers to do. As long as you actually know what your patterns are and what your signals are, the computer can test them with ease. The only problem is if you can't actually describe these things to a computer. Which is where I suspect the real problem is...", "score": 5, "replies": [{"body": "It is difficult, for all the reasons I've explained. That's why there's so little published data on the effectiveness of TA.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "But TA *does* work. It's just that we don't get to control the price of the stock. Yes, real world events affect the price, but you have to understand that psychology is vastly at play in the markets at all times. TA is a concept waiting for confirmation. No, TA doesn't regard real world reasons for why the price is moving, hence why bracket orders and not having the choice of 'should i take profits/cut my losses here?' is a thing. Stocks either do what you want them to or they don't. They don't always care about the real world reasoning; price is all that matters.\n\nYou could apply this same way of thinking to fundamental analysis users that would argue their method works. \n\nSituation + desired outcome + desired outcome happening = validation of my method, invalidation of your method. Fuck you.\n\nThat is how most traders/investors seem to think, but in either way you want to view it, it's all still a psychological game of gambling on the future. You simply have factors that help or hurt your profits.", "score": 2, "replies": []}, {"body": "TA does work because the majority of the market is traded using algorithms.", "score": -6, "replies": [{"body": "The information that moves big money algorithmic traders is more expensive than a yahoo finance price history chart.  Why would a super smart, rich person spend a bunch of money making an algorithm to trade on the cheapest data on the stock market?  This would make no sense.  Algorithms are looking for more advanced signals than 1920’s era price chart voodoo.", "score": 5, "replies": [{"body": "If you think yahoo finance is used for TA you just don’t know you’re talking about", "score": -2, "replies": [{"body": "If you are trading on a “death cross” why do you need a tool more advanced than yahoo finance?  Plotting a moving average is literally something my 6 year old could do.\n\nBut I guess you could spend 2k a month on a Bloomberg terminal to spot this.", "score": 3, "replies": [{"body": "Because TA doesn’t use 1 indicator. There are technical indicators for everything, sentiment, economic data, options volume, volatility, institutional holdings, etc.", "score": -3, "replies": []}]}]}]}, {"body": "The algorithms don't use TA but they are aware that other people use TA and use it to manipulate people who use TA.", "score": 2, "replies": [{"body": "If they are aware of TA and use it to manipulate people that are using TA then they are using TA", "score": 2, "replies": [{"body": "No, they are trading against TA.  There’s a big difference.  Even if TA “worked” - ie, if there was a trade or a signal that could predict future price movements with an accuracy greater than market alpha smart investors would pile so much money into it that it would stop working.  Then people would pile into the counter-trade to take advantage of the crash.  And the bullish signal would actually turn into a bearish signal.\n\nAnd so TA cannot work like some people say it works.  Pricing information is too cheap and too low bandwidth to be an effective tool for generating alpha.", "score": 1, "replies": []}]}]}]}, {"body": "TA works doubt", "score": 1, "replies": []}, {"body": "I agree with you, but this line of thinking sometimes puts me at a complete loss. Is there anything you have found, any strategy, approach, set of rules or even a single rule you can point to, that has a higher than random chance of working? I suppose the only one that is bandied about is to DCA into indexes and hold for a very long period of time. Anything else beyond this?", "score": 1, "replies": []}]}, {"body": "It has as much predictive abilities as someone saying a stock's P/E is X or EPS is X.\n\nSo no, don't use TA or fundamentals as a way to predict future price movements.\n\nJust use them to measure the price moving.. so yeah a death cross is a BAD; edit: and this type of cross is lagging, so basically the stock dumps and then it crosses later on the chart.  So if you weren't paying attention to the trajectory of the stock price and then all of sudden it's a death cross, you're already f'd.", "score": 3, "replies": []}, {"body": "TA by itself does not work.  But if you know how to mesh TA with reality and sentiment it works.  The problem with TA is ... By itself it's just math and numbers.  Humans have to blend in TA with sentiment, rationale, trends, and real life events/catalyst for it to be truly effective.", "score": 8, "replies": [{"body": "You can literally remove TA from those list of factors and nothing changes.  TA is absolutely meaningless.", "score": 1, "replies": [{"body": "This is inccorect adding TA with these factors can definitely increase your odds of estimating how far or low a stock may rise and fall,  as well as increase your odds of being able to narrow it down to a more specific time frame.  Essentially when applied properly to these factors it's TA that tells you what price will possibly be and a certain time window it may take for a stock to achieve that price.", "score": 2, "replies": []}]}]}, {"body": "Predictive ability only because so many people make a big deal out of it.", "score": 3, "replies": []}, {"body": "Random chance is flipping a coin. TA is much more than that. Try it, and you'll know what I'm talking about", "score": 1, "replies": [{"body": "There's no evidence, I would never try it.", "score": 1, "replies": []}]}, {"body": "TA works and there are billionaires out there (Jim Simmons) that have something crazy like 70% returns on their employee’s retirement funds (the medallion fund). \n\nBut they use math noble laureates, former child prodigies, and supercomputers to do their analysis. This rudimentary analysis is like caveman math compared to what they are doing.\n\nTrading on TA for individual investors is not recommended. Just to give you how significant this is, not even BRK uses TA.", "score": 1, "replies": [{"body": "Thing is, i think rentec uses a ton of other signals as well as just the price history, eg commodity futures related to their industry, economic indicators, options data... They then feed it all info a neural network. I could be totally wrong about this but afaik it isn't the same as TA.", "score": 2, "replies": []}]}]}, {"body": "I never understood how chart signals are relevant for an index, since the price of an index is defined by the price of the included stocks, or isn't it?!", "score": 17, "replies": [{"body": "It isn't. I believe in basic TA(support and resistance levels and reversion between them). In general people hilariously abuse TA and then you get the \"hur dur it's all horoscopes\" people as a reaction to that.\n\n TA *only* works when applied to stable individual stocks who have solid fundamentals, and not when the market is in a state of price discovery like it is now. It doesn't work on indexes because they're an aggregate of hundreds of stocks, it doesn't work on meme and growth stocks because they lack fundamentals. It also doesn't predict anything, it's just used to set price targets on stuff that's already worth buying, and build risk profiles for hedging and entry/exit points. Also chart patterns are BS.\n\nJust look at recurring price ranges in stable and flat-ish moving stocks. People overcomplicate this shit so much.", "score": 3, "replies": [{"body": "TA is 100% the male equivalent of horoscopes/astrology.\n\nIf TA gave you a statistically verifiable edge, EVERYONE would learn how to use it, and then it would no longer be an edge.", "score": 0, "replies": [{"body": "Such a naive take. Do you also believe in efficient market hypothesis too? lawl", "score": 1, "replies": [{"body": "For a sufficiently long time spans, the market is very efficient. For example, the current market cap of carthaginian galley makers is optimal. For short time spans, who the hell knows. Also, i cannot tell you the difference between a short and long time span.", "score": 1, "replies": [{"body": "And if you follow that train of thought you'll come to several very obvious conclusions\n\n1. The market is never perfectly efficient, ever. Because it is always inefficient in the short term. This deviation is largely due to a combination of sentiment and \"randomness\" producing chaotic effects. This is also why nobody who uses TA properly says it's predictive, because the basis of TA requires acknowledging the day to day price movement is completely random at times\n\n2. In the longer term there will be a return to fundamentals as people realize price has deviated too far from what things are actually worth.\n\n3. Given a stable market and no injection of new fundamental information(significant earnings/guidance, major events) this deviation will typically follow a price range as the further you get away from a generally agreed upon price multiple, the harder it is to deviate. The stronger people believe a company should be worth something, eg an established company, the stronger this effect. This creates supports and resistances and reversion to the mean.\n\nPut all of this together and you have the basis of TA in a structure that adheres to fundamentals while acknowledging that the markets are sentiment driven in the short term, which can be used to make money.", "score": 1, "replies": [{"body": "So, what edge do you think TA gives a trader, over someone flipping a coin? \n\nIs it 2%? 5%? 10%?", "score": 1, "replies": [{"body": "Fucks sake you didn't listen to a thing I said. It's. Not. Predictive. If after all that you liken it to coin flipping it's clear you're not worth bothering.", "score": 1, "replies": [{"body": "Would you like to clarify just exactly how the fuck it is supposed to help you if it's not AT ALL predictive?", "score": 1, "replies": [{"body": "Literally just go back and read my topmost comment where I already said all this. It helps set price targets, hedging points, and entry and exit points on blue chips in a stable market. At the risk of an analogy, you keep looking at it from the lense of it being a weatherman saying it will rain tomorrow(predictive) when it's more akin to seeing it's the rainy season(trends) and bringing an umbrella. Worst case it drops even further and you're either hedged or in a good company at a good price, best case you make some money short to medium term and can move on to something else. Particularly in a bull or flat market this can make significantly more money compared to holding by rotating between solid companies as while one is reaching the top of its deviation you can buy into another reaching a general bottom.\n\n You also need to know when to use TA properly which is something so many people fuck up on(again read the first comment, I've already said all this). Right now with all the macro financial and economic things happening? TA isn't useful here because of high volatility and fundamental disruption happening. TA is difficult to quantify and backtest for because it relies on a combination of fundamentals and sentiment. You can't apply some naive algorithm over 20 years on SPY and expect to get some ROI value. I'm sure that makes it sound all horoscopey but sentiment is extremely difficult to quantify.\n\nAs TA is meant to be combined with FA it can be used to set better entry points over a time frame when lump summing or paycheck DCAing compared to a naive \"I'll buy it and wait 5 years\". May as well buy the cheapest of 5 companies using TA entry points instead of buying at the top and immediately getting dicked on 3%.", "score": 1, "replies": []}]}]}]}]}, {"body": "Precisely. Market efficiency hypothesis holds long term. It doesn't guarantee bubbles can't happen in the short term.", "score": 1, "replies": []}]}, {"body": "I mean, long term efficient market hypothesis holds, clearly. It's the exact reason why growth stocks got absolutely shredded recently and a return to fundamentals has happened.\n\nBubbles can exist in markets in the short term, but long term the winners will win and the losers will lose, no matter what.", "score": 1, "replies": []}]}]}]}, {"body": "An individual stock may follow some TA trends occasionally. \n\nAn index built on hundreds, or thousands of underlying assets would not be bound by the same supply and demand issues.", "score": 3, "replies": []}, {"body": "Wouldn’t that make it even more relevant?", "score": 1, "replies": [{"body": "I don't get it.", "score": 1, "replies": [{"body": "It means the market, in aggregate, is facing a bearish signal.  Some individual stocks will still outperform and underperform.  But when we talk about a market correction, we're talking about the market, obviously.\n\nFurthermore, the general trend tends to feed on itself and become self-fulfilling.\n\nThis is how I understand it.", "score": 10, "replies": []}, {"body": "Don’t you think a negative move in the overall index is more concerning than a move in an individual stock? In my mind, a move in the index is more representative of overall market sentiment and economic outlook. That would mean my overall portfolio is more likely to be affected than if only one stock in my portfolio was showing the same signal.", "score": 3, "replies": []}]}]}]}, {"body": "So the market hit bottom and is headed up?!", "score": 9, "replies": []}, {"body": "In 2018 rates have been hiking for a long while now, they were at 1.5 at the first smaller crash, and over 2 in december. Why is everybody comparing this to 2018, when earnings will just go up for the next 2 years?", "score": 6, "replies": []}, {"body": "I used to work as a portfolio manager and we did an empirical analysis on this. Markets actually had a greater chance of rallying than selling off after experiencing a death cross. If memory serves, markets sold off 40% of the time, and rallied 60% of the time.", "score": 4, "replies": [{"body": "Is there any strategy or indicator or anything that an investor can follow that has been shown to work? Beyond DCAing into an index?", "score": 1, "replies": [{"body": "No. There’s a reason why Warren Buffet is such a big proponent of passive trackers.", "score": 3, "replies": []}]}]}, {"body": "Good call.\n\nAltho I sill have PTSD from Facebook's Death Cross in 2018 so Im not touching shit untill dust settles down.", "score": 3, "replies": []}, {"body": "If there's one thing the market loves, it's self fulfilling prophecies. \nNice DD and explanation on this OP.", "score": 4, "replies": []}, {"body": "Every time there has been a death cross on the nasdaq it’s signaled the bottom of a downtrend or bottom at least in a couple weeks since 2008. 2008 it drilled for another month before going up for a few weeks then the real crash began", "score": 3, "replies": []}, {"body": "TA is just horoscopes for “investors”.", "score": 5, "replies": [{"body": "The equivalent of seeing animals in clouds.", "score": 5, "replies": []}]}, {"body": "Oh no, not a death cross! Maybe the golden cross will save us again?!", "score": 1, "replies": []}, {"body": "I can't believe the hatred people have towards technical analysis. Just to be clear, no form of research can accurately predict in which direction assets move all the time, be it fundamental or technical analysis. What TA does is provide traders with entry & exit points. They may work 50-60% of the time, but when they don't, exit with small losses rather than holding on to them", "score": 1, "replies": []}, {"body": "TA tools are not even close to definitive predictors of anything, as they are broadly lagging indicators. They are not meant to be used in a vacuum, you butt plugs.\n\nNo, by itself a “death cross” doesn’t tell you anything. But it’s so tiresome seeing people refer to TA as “useless,” or “horoscope,” etc. People who say those things only demonstrate a deep failure to understand what TA **is**, and claims to be, or what it isn’t, or does **not** claim to be.\n\nThe people who knee-jerk dump on TA posts (yes, some are shite, but some aren’t) are not the same people who consistently earn money trading.", "score": 2, "replies": [{"body": "You're joking?\n\nWhich fund or investment firm uses TA? There's also a big difference between algorithmic trading and TA. \n\nYou'd be considered a joke if you used TA and tried to justify things based on TA to clients. People who consistently make money trading don't use TA - it's seen as a joke among most professional investors.", "score": 6, "replies": [{"body": "Yes, when you don't understand something, and in fact don't even understand WHY you don't understand it, opinions deviating from your thinly summoned dogma are always attempts at humor.\n\nThanks for proving my point, BTW.", "score": -8, "replies": [{"body": "> Yes, when you don't understand something, and in fact don't even understand WHY you don't understand it, opinions deviating from your thinly summoned dogma are always attempts at humor.\n\nMy guy, I work at an asset management firm. \n\nOur firm does 'make' money consistently investing. I'm telling you that most of the industry i.e. people who make money investing consistently regard TA as a joke.", "score": 5, "replies": [{"body": "Good for you, son. Janitor? Receptionist?\n\nI truly can't explain how much I love it when people say \"my guy,\" and how much it deepens my respect for them.", "score": -8, "replies": []}]}]}]}]}, {"body": "Good! Buy put on AAPL", "score": -3, "replies": []}, {"body": "Nobody really pays attention to death and golden crosses anymore. They were more relevant back in the less volatile days of the markets. Now they just lag way too much.", "score": 1, "replies": []}, {"body": "Some ta stuff is a bit out there, but there are very practical things like looking for ‘thors hammer” indicates strong buying at a level and could indicate a good place to enter a position. Also, watching a stock bounce of a level 3-4-5 times could show support; on the flip side of that of the stock gets under that lvl it could become upward resistance. \n\nIn the end even if ta isn’t ‘real’ many people use it and therefore cause it to become realized in the market. Self fulfilling prophecy in a way.", "score": 1, "replies": []}, {"body": "For those of you who believe in technical indicators - Coming around with the worst TA type.\n\n&#x200B;\n\nHere is the real crytal ball: if we fail at SPY 4455 (8.3.22) we may fall to 3977.", "score": 1, "replies": []}, {"body": "So buy April 2022 calls?", "score": 1, "replies": []}, {"body": "But what do the rocks and chicken bones say?", "score": 1, "replies": []}, {"body": "Looks more like a inverted double upside out rimjob-cross to me... /jk carry on.", "score": 1, "replies": []}, {"body": "Analyst price targets for the largest 10 companies in QQQ are overwhelmingly positive. That's around 52.18% of their holdings by volume. I'm not saying you should 100% believe analyst price targets, but hey, those guys at financial institutions do their research. I don't see technology stagnating and if the companies are at fair valuations and are making profit you should definitely buy them.", "score": 1, "replies": []}, {"body": "The only one I really look at sometimes is volume by price. But just for shorter term trades that I don't do much of. It simply correlates the volume with prices so you can see where it could have a lot of volume again and go up quickly. But I've followed lots of TA experts and they're probably right less than half the time.", "score": 1, "replies": []}, {"body": "Oh I remember when media was harping on the death cross in April 2020.... Was the absolute worst time to go bearish on the market. So yea, death cross is as useful as flipping a coin", "score": 1, "replies": []}]}
