{"title": "GM ups wage offer as UAW strike deadline nears", "selftext": "[deleted]", "id": "16is02z", "created_utc": 1694721054.0, "score": 81, "upvote_ratio": 0.95, "num_comments": 83, "comments": [{"body": "I like how Biden has offered government loans if the companies are affected. \"Most pro union president\" my ass.", "score": 52, "replies": [{"body": "Unless I am mistaken, that would be to keep the company solvent while negotiations were happening, so the company would go bankrupt during a strike.  If that is the case, I would say that is more pro-union as if the company goes out of business during a strike there is no job to strike for. \n\nFYI I hate biden.", "score": 31, "replies": [{"body": "Sounds like a free market economy to me.", "score": 2, "replies": [{"body": "I don't understand the connection.", "score": 3, "replies": [{"body": "A free market economy is without interference from government.", "score": 3, "replies": [{"body": "![gif](emote|free_emotes_pack|joy)", "score": 8, "replies": []}, {"body": "Yeah sure, if you have a child-like understanding of the world and ignore the myriad of ways governments “interfere” in every single capitalist economy", "score": 5, "replies": [{"body": "then by definition they are not truly capitalist economies, they are part-command", "score": 0, "replies": [{"body": "Because a truly capitalist economy works about as well as a communist one.", "score": 1, "replies": []}]}]}, {"body": "I am not saying you are an advocate for free market as I don't know, but people who are usually have no clue what they are talking about.\n\nYou know what a real free market is? A huge monopoly buying up any competition that arises.  Collusion between conglomerates to keep prices high. Collusion to keep salaries the same (this happened in tech where they colluded to not poach each others employees to keep salaries low. They were sued for this and lost as it is illegal -- doesn't mean they dont it still)", "score": 1, "replies": [{"body": "Lol you just listed consequences of a free market not what it actually is. It's \"free\" from any regulations. The Market will regulate itself. There is no such thing as a free market. It literally exists in theory only.  As soon as you make a child labor law it is no longer a market free of regulations.", "score": 1, "replies": []}]}]}]}, {"body": "Name a country that has a purely unfettered free market....", "score": -1, "replies": [{"body": "It doesn't exist, I never said it did.", "score": 2, "replies": []}, {"body": "America", "score": -10, "replies": []}]}]}, {"body": "Spot on. GM and Ford are about to go under, Biden is just delaying the inevitable, basically transferring tax payer money to union workers and GM/Ford shareholders for a little while longer.", "score": -5, "replies": []}]}, {"body": "Environment > Unions", "score": -21, "replies": [{"body": "Do you actually think car companies give a flying fuck about the environment? I have a bridge to sell you..", "score": 14, "replies": [{"body": "Companies 'care' about whatever their customer base cares about if it means they can sell more of their product.\n\nThe vehicle market has a large variety of segments and they can cater to them independently.\n\nDo you think people are buying the Prius for its looks,  performance, or price? Does that mean that they somehow can't sell the Supra at the same time?", "score": 1, "replies": []}]}]}]}, {"body": "If you adjust for inflation 20% still leaves the Auto worker making less than they did in 2007. No Cost of Living Adjustment (COLA), No pension. People call the UAW greedy. The machine has so many convinced they aren’t worth a decent living. “I only get paid $22/hr and I make it work” you deserve more , we deserve more ,we need to stop settling. Bezos out here with over $100 Billion and an average Amazon worker starts at $15 <~ THIS is acceptable. Nothing greedy about that?  Unskilled labor, no degree, you can’t get wages that reflect the MULTI MULTI MULTI Billion dollar corporation you work for? Stop letting the top convince you that you’re not worth the pay. Stop thinking that you and your partner (if you have one) need to work 60+hours to scrape by. Stop blaming unions for Corporate greed. A truck is still going to cost you $70,000 if built in Mexico, paying workers $7hr and they’ll keep raising prices.", "score": 29, "replies": [{"body": "> If you adjust for inflation 20% still leaves the Auto worker making less than they did in 2007.\n\nPart of the reason for that is because prior UAW deals have been so awful, even though the auto market was in much better shape back then. \n\nI'm honestly surprised that it took so long for the prior UAW leadership to get replaced given how pitiful some of their more recent deals have been.\n\nAnd the worst part is that right now the Big Three automakers are under a lot of financial pressure right now given the very expensive shift to EV's they've got to finance in order to survive long term (regardless of how fast or slow you think it'll happen). Plus in all likelihood the auto market is heading towards a recession, given that the time the average car sits on a dealerships lot before being sold has been climbing well above the 90 day historic average in a lot of places.", "score": 10, "replies": []}, {"body": "The majority of this site suffers from Dunning-Kruger, so I'm out.", "score": 20, "replies": [{"body": "Thousands of unskilled laborers working and making a multibillionaire his 290th billion dollar is ok with everyone. They don’t deserve a livable wage bc their skill is not scarce? A watch without its inner workings is just a bracelet. If you desire a watch even the smallest insignificant spring is vital.", "score": -10, "replies": [{"body": "The majority of this site suffers from Dunning-Kruger, so I'm out.", "score": 11, "replies": [{"body": "So many redditors don't understand the value added of different jobs. They just idealistically think \"oh you have a job, any job at all, you're entitled to $30 an hour and should be able to own a house in a metropolis.\" They would say a grocery bagger is entitled to the same level of living as a licensed vocational nurse.", "score": 10, "replies": [{"body": "I this is why America will fail.", "score": 3, "replies": []}, {"body": "No, but I think everyone in our society should be able to at least have their basic needs covered with a job if they are working hard. I don’t think that’s crazy to ask. I say that as someone who is very lucky and I have a very good job that covers more than my basic needs.", "score": 1, "replies": [{"body": "> should\n\nhence \"It's not about deserve, it's about reality\"\n\n> I don’t think that’s crazy to ask\n\nmany communists have tried and failed because economic reality is apathetic to human endeavors  \n\n> covered with a job\n\nif labor supply exceeds demand, or the specific set of demanded skills is mismatched/not met, no amount of politicking will resolve it by fiat", "score": 1, "replies": []}]}, {"body": "Tbf that was roughly what happened for the boomers due to rapid post war expansions and global economic dominance. \n\nBack then there also weren’t nearly as many established oligopolies in every industry that are dominated by the top 0.01%. The wealth of middle to upper middle class was much much better spread with small to medium business owners all the way down to unskilled workers \n\nMost people are just dreaming of boomer days but unfortunately that period of time was the exception, not the rules", "score": 1, "replies": []}]}]}]}, {"body": "Yeah because theres so few CEOs even when they fail miserably they are several punished never getting another job.", "score": -8, "replies": [{"body": "The majority of this site suffers from Dunning-Kruger, so I'm out.", "score": 3, "replies": []}]}]}, {"body": "It's not the wage amounts that are ridiculous, it's the things like \"pay us 40 hour weeks for only 32 hours of work.\"", "score": 3, "replies": [{"body": "Shouldn’t work weeks decrease as productivity goes up? Longer than 40 hour work weeks used to be the standard.", "score": -4, "replies": [{"body": "If you're an hourly worker you should get paid the hours you work. Hot take, I know...", "score": 6, "replies": []}, {"body": "they should, but the gains of automation have actually competed against workers rather than returning time to them\n\nworkers in foreign companies already have lower wages and work 40+ hours a week, so unless they also start working less for more pay, American products will end up with a huge cost disadvantage and go under", "score": 1, "replies": []}]}, {"body": "After 32 hours would be OT. They aren't working 40, they were working like 65+", "score": 1, "replies": []}, {"body": "They are not going to get that what it does is introduce an idea of work life balance. Why do we spend the majority of our life at work?  Often times you see your coworkers more than your own family. It’s a new concept many working Americans are against bc it’s absolutely unheard of. A balance between work AND living your life!!A good honest American should be willing to work themselves to death AND be proud. It’s scary, I know, it’s greedy, impossible, unprecedented. So was a 5 day work week, 40hrs, eliminating child labor, Health care coverage, a livable wage, cleaner/ less dangerous work environments. As outlandish as it’s sounds it’s honestly just a concept aimed to improve the American workers life", "score": 1, "replies": [{"body": "Yeah I'm not against it, just don't expect to get paid hours you don't work if you're hourly. Sounds like they want to be salary and get an even bigger $/hr raise than they're saying.", "score": 1, "replies": []}]}]}, {"body": "❤️❤️❤️", "score": -3, "replies": []}, {"body": "Nobody at the top ever questioned if they deserved to be there they just took what they could.", "score": 1, "replies": []}]}, {"body": "Am I the only one who thinks some of these demands from the union are a little too much?", "score": 19, "replies": [{"body": "Possibly but it may be a strategy. I work for a union and we can’t strike if the only reason is pay. So maybe it’s the same for them.", "score": 3, "replies": []}, {"body": "IMHO I feel bad for all parties.  This is not going to turn out well for either side.  The big 3 are in debt and are struggling to transition to EV.  Employees should get paid more.  Some of these asks are silly.  Why can't there be an agreement with employee <> company goals tied to EV that if hit unlock massive upside for all parties?  The \"CEO gets paid a lot\" argument (and similar ones) is silly IMHO because they distract from the real issues.  I'm sorry but if you run a company that generates 156.7 billion per year... you deserve to get paid well.", "score": 7, "replies": [{"body": "> struggling to transition to EV. Employees should get paid more\n\ngoing to be tough when EV manufacturing requires less labor than ICE manufacturing", "score": 2, "replies": [{"body": "Bingo.", "score": 1, "replies": []}]}, {"body": "Are they in debt or do they generate 156.7 billion per year?", "score": 0, "replies": [{"body": "Both can be true :)", "score": 1, "replies": []}]}, {"body": "The issue is most of the workforce is working on ICE vehicles and so wants to keep the focus there. If anything, the union is anti-EV.", "score": 1, "replies": []}]}, {"body": "what do you take issue with?", "score": 2, "replies": [{"body": "32 hour work week probably is the one that makes the least amount of sense. If they reduced the work week by this much, they would literally have a full day of no staff unless they paid overtime which would make their 40% raise even higher. Doing this would literally force the companies to use temporary workers on the last 8 hours in order to avoid overtime pay. Which the union wants to prevent temp workers.", "score": 13, "replies": [{"body": "They're currently working 65+ hours on 40hr schedules.", "score": 2, "replies": []}, {"body": "Well, they’d likely schedule 4-day overlapping shifts.", "score": 3, "replies": []}, {"body": "That's not how it works.  There's interlocking schedules so the factories are always staffed.  It just mean more actual people having jobs (which is a good thing).  \n\nAnd in reality, companies operate too lean and mean, so they fail to have all the necessary workers to adhere to a 32 (or 40) hour work week promise, so they end up working them harder.  This change would mean workers can earn more if they are taken advantage of to work those extra hours.\n\nSo for the worker who bargained for a 40 hour work week but it currently being forced to work 48 hours and miss some time with their family, then get paid OT rates for the extra 8 hours.  This change would see that worker having a right to 16 hours at the higher pay rate.  Ideally, paying these extra hourly rates would spur the company to do a better job of scheduling and recruiting, and actually keeping their contracted promise.  So that way workers would get a balance between work and home life.", "score": 5, "replies": [{"body": "> It just mean more actual people having jobs (which is a good thing).\n\nThat isn't good for the company, as it explodes the costs of benefits.", "score": 1, "replies": [{"body": "It's doesn't \"explode\" the costs.  But if you want to use that word, corporate profits are what's \"exploding\" right now.", "score": 1, "replies": []}]}]}]}, {"body": "Defined pension plan. The pay increase on top of fewer hours worked. Retiree healthcare.\n\nThe pension plan and retiree healthcare are show stoppers for me. These are long term debts that cannot be easily cribbed into pricing and can (will) spiral. Those demands are mortgaging the companies future.", "score": 12, "replies": [{"body": "I think a lot of people fail to see that a 32 hour work week is already a 12.5% hourly pay increase.", "score": 13, "replies": [{"body": "It’s a 20% increase isn’t it?  They work 20% less time.", "score": 10, "replies": [{"body": "No, it’s not based on days, it’s based on hours. They would go from 40 hours to 32 hours.", "score": -1, "replies": [{"body": "… which is a 20% drop.", "score": 5, "replies": [{"body": "Yeah bad mistake there lol", "score": 1, "replies": []}]}]}]}, {"body": "I think a lot of people fail to see that if I can get the same productivity out of you in fewer hours, I can probably automate your job and not pay you at all.", "score": 8, "replies": [{"body": "I think it’s more likely that they move the jobs down to Mexico for people who would happily work 40 hours.", "score": 7, "replies": [{"body": "Then you gotta pay the cartel tax", "score": 1, "replies": [{"body": "He was talking about Mexico.", "score": 0, "replies": []}]}]}]}]}, {"body": "i appreciate you replying. i'll think on this some more.", "score": 3, "replies": [{"body": "You the man.", "score": 1, "replies": []}]}]}]}, {"body": "no , too little . “today’s real average wage (that is, the wage after accounting for inflation) has about the same purchasing power it did 40 years ago. And what wage gains there have been have mostly flowed to the highest-paid tier of workers.”https://www.pewresearch.org/short-reads/2018/08/07/for-most-us-workers-real-wages-have-barely-budged-for-decades/", "score": -6, "replies": [{"body": "Imagine that.  If you keep the same skills and the same job then you make the same money.  It isn't the 1950s when someone could drop out of high school, get a factory job, and expect to make more and more money.  Keeping up with inflation is the best you can hope for if you don't improve yourself.", "score": 2, "replies": []}]}, {"body": "Bargaining strategy", "score": -2, "replies": [{"body": "The majority of this site suffers from Dunning-Kruger, so I'm out.", "score": 10, "replies": [{"body": "Unless they are like my union where we can’t strike if the only issue is pay rate.", "score": 1, "replies": []}, {"body": "Yup at minimum it makes them look somewhat greedy to the general public", "score": 1, "replies": []}]}]}, {"body": "Pro tip: in a negotiation never ask for what you actually want. Ask for more, always.", "score": 1, "replies": []}]}, {"body": "With pensions bankrupting countless local governments and large businesses, they're never going to come back. Our population pyramid just does not have enough young people per old person to support it.\n\nUnions, like all workers, are going to get raises due to post covid stimulus inflation. \n\nBut what's most interesting to me is that Tesla pays more than UAW workers, and Toyota pays about the same while having lower costs. I do not believe auto unions (specifically auto unions) are good for society, and I'm happy to defend my position.", "score": 5, "replies": [{"body": "> post Covid stimulus inflation \n\nDo you think supply chains and PPP loans had anything to do with it?", "score": 4, "replies": [{"body": "PPP loans were part of the stimulus package. Supply chain of course.", "score": 3, "replies": []}]}, {"body": "I fully support your stance. It doesn’t make any sense to pay Joe $50 an hour when Jose will do it for $10. Just keep moving plants to Mexico and this will fix itself.", "score": 2, "replies": [{"body": "It's going to get to a point where all labor and office work is outsourced and the US is a theme park for the rich with a plethora of debt ridden service workers", "score": 1, "replies": []}]}]}]}
