{"title": "Let's talk about a new group of stocks: mention companies that are transforming their business to unlock shareholder value", "selftext": "I like the posts about battered high-growth stocks and reliable stocks to hold with high inflation. But, I would like to get more attention with this post on stocks that are trying to transform to a new business model or due a turnaround. A few ideas I'm aware of:\n\n&#x200B;\n\n* **Warner Bros Discovery**: Invest in WBD if you believe that they will successfully transition from a legacy TV to a streaming TV player and they'll realize all of the revenue & cost synergies of combining Warner Bros & Discovery together\n\n&#x200B;\n\n* **any auto manufacturer not named Tesla**: Tesla has a 10 year headstart on electric vehicles so find a company that you believe can spend their capex efficiently & effectively on CapEx technology and then can harvest those prior CapEx investments someday to be a profitable EV player. Ford, General Motores, and there are a couple more.\n\n&#x200B;\n\n* **Netflix**: Invest in Netflix if you believe their transition from subscription video on demand to a hybrid option that includes cheaper advertising video on demand will help them lose fewer subscribers and continue growing revenue\n\n&#x200B;\n\n* **Meta**: Invest in Meta if you think their metaverse bet will work out\n\n&#x200B;\n\n* **Peloton**: Invest in Peloton if you think a new CEO and the restructuring moves will work out for a stock that has struggled ever since the economy reopened\n\n&#x200B;\n\n* **Intel** Invest in Intel if you believe they'll address their technological debt with their chips & can benefit from geopolitical outcomes on foundry competitors\n\n&#x200B;\n\n*Disclosure: I don't own any of these stocks and not interested in purchasing any of them at the moment except Warner Bros Discovery*", "id": "vq1lvj", "created_utc": 1656797104.0, "score": 29, "upvote_ratio": 0.75, "num_comments": 81, "comments": [{"body": "Ford. Ford never filed bankruptcy and screwed its shareholders like every other car company", "score": 31, "replies": [{"body": "Great opportunity for them to do so here. Bagholder commenting.", "score": 2, "replies": [{"body": "I don’t understand your statement. “For them to here. Bag holder commenting” please explain", "score": 1, "replies": [{"body": "It was poorly written. My bad. I'm just saying that they currently are known to have a lot of debt and going into a time when it is more expensive to have that debt. Bankruptcy risk is rising by the day. But I currently hold it. One of my worst performers.", "score": 3, "replies": [{"body": "> I'm just saying that they currently are known to have a lot of debt \n\nNo, they don't.  They have about $17B in debt (excluding their financing arm) and and EBITDA of about $15B.  This is an extremely healthy debt ratio.\n\n There simply isn't an appreciable BK risk for Ford.", "score": 4, "replies": []}, {"body": "Stay strong  friend. Their 2 way charging is awesome, They have carbon capture contracts and strategic partnerships with intel for autonomous driving. I do t know your price per share but hold on I thought I was screwed when they hit 5$ and held on. DCA on ford.", "score": 1, "replies": [{"body": "It's actually concerning to me they are in carbon capture and makes me more bearish. Carbon capture is mainly used as a tool of the oil and gas industry to convince the public that their products can continue to be used. They are taking advantage of the general public's ignorance of entropy and they know it. In case you're interested, this page does a phenomenal job expanding on this concept. Pursuing carbon capture only makes sense after humanity has expended all resources avoiding carbon and is looking for further improvement; it is the weakest of all options and will remain that way forever.\n\nhttps://rateofchange.substack.com/p/why-capturing-carbon-from-the-air", "score": 1, "replies": []}]}]}]}]}, {"body": "Still paying off loans from 2008", "score": 0, "replies": [{"body": "No, they aren't.  Ford never took loans in 2008; GM and Chrysler did.", "score": 4, "replies": [{"body": "This is true. Ford never took loans", "score": 1, "replies": []}, {"body": "Sorry you are right. It was 2009\nhttps://www.freep.com/story/money/cars/ford/2020/07/29/ford-government-loan-department-energy-debt/5526413002/", "score": 1, "replies": []}]}]}, {"body": "They are consistently declining and have no substantial strategy for Europe.", "score": 1, "replies": [{"body": "One might say a company growing has a “declining stock” doesn’t mean the company is in a bad spot.", "score": 1, "replies": [{"body": "Let's see if they actually grow, though. Their numbers in Europe are declining faster than expected and a good percentage of analysts sees them shrinking on an EPS basis at least for the next 3 years or so. (although consensus estimates see them flat to low growth)", "score": 1, "replies": [{"body": "A quick search just showed me fords European market went from 22% of its revenue in 2020 to 24% in 2021. \n\nIn 2021 ford lost 600+ million in Europe \nIn 2022 ford lost less than 300 million in Europe, and is set to be at a 6% profit margin by 2023. \n\nMaybe I’m a bull on ford and it’s just not for everyone  - Cheers.", "score": 0, "replies": []}]}]}]}]}, {"body": "Intc and meta are both turnaround holds of mine. I would go ahead and add Disney to the list as well. I like the company prospects but sure are feeling some pain currently and are in the midst of defining their image and brand for a newer audience", "score": 11, "replies": [{"body": "I find it funny how people act like Meta needs to turn things around to be successful.\n\nMeta owns the 4 most popular apps in the world: FB, IG, WA, FB messenger.", "score": 4, "replies": [{"body": "It could be that China is just becoming too competitive.  Too many young amazing programmers working 16 hour days.", "score": 1, "replies": []}]}, {"body": "INTC + META are great value stocks. \nDIS at the bottom with NVDA,+ UPST .\nDIS too much debt in this environment of rising rates not good .", "score": 5, "replies": [{"body": "How are you still gonna shill your pseudo-value list?\n\nLads, even if what she says is correct at times, be careful. The guy really just has companies sorted by some very basic valuation metrics and thinks she can determine how much value they are by that. She herself is basically in none of them despite spamming her comments everywhere.", "score": 1, "replies": [{"body": "Ich bin kein Mann. \nGo ask someone who actually knows what a value company is. And what is wrong that you have to warn against my posts? You're the only one wasting time", "score": 2, "replies": []}]}]}]}, {"body": "Trinseo is transforming from a cyclical materials stock to a specialty chemical supplier. PE of 6 and about to sell their last cyclical division any week now. Buying back around 13% of their float every year and paying a dividend over 3%.\n\nSpecialty chemical companies trade for an average PE of 15.", "score": 7, "replies": [{"body": "Trinseo is an interesting one. Got in at $47 and sold near peak. Didn't realize it had dropped so much.\n\nRubber shortages are going to be a big problem in the future and shift more and more to synthetics.", "score": 2, "replies": [{"body": "Right. But Trinseo sold their synthetic rubber division late last year. It was one of their cyclical assets that they're selling for specialty subsidiaries.\n\nInteresting you mentioned rubber though as that's what put the company on my radar in the first place!", "score": 2, "replies": [{"body": "Ah, right. Now that you mention it, that was part of why I decided to sell on the price rise.\n\nProto Labs was another I got into for rubber investing, but they're manufacturing. Ended up getting out of that too.", "score": 2, "replies": []}]}]}]}, {"body": "Why do people like Peloton so much? I thought their products suck?", "score": 30, "replies": [{"body": "OP already said he's not interested in any of the stocks except Warner Bros. But, can still have a conversation on stocks that are turnaround candidates.", "score": 2, "replies": [{"body": "Yeah I didn't ask 'why are you buying Peloton OP?' I asked why people seem to always talk about it when it's been performing so badly and by and large their products are not desirable.", "score": 2, "replies": [{"body": "I thought stationary bike companies were usually safe bets from the late 90s to date?", "score": 2, "replies": []}]}, {"body": "But what makes PTON a turnaround candidate?\n\n\n\nThey got no most, nothign unique and without a pandemic they got a product solving a non-existent problem. Their target audience is women, women love the *social aspect* of training and nothign is better then irl training with friends (or group workout). PTON got a crutch when gyms closed, but failed to build a loyal customer base and now no-one enats what they're selling...\n\n\n\n\nThe Ouya of fitness", "score": 0, "replies": []}]}, {"body": "Peloton fits within a certain demographic that will always thrive. Their management was (I say was because with new management things will turn around) their fatal flaw nearing the end of the pandemic. In my opinion PTON is the poster child of the Pandemic Darlings that’s why it’s talked about so much. My take.", "score": 4, "replies": []}, {"body": "Who says their product sucks? Their product is pretty awesome, it's just niche and expensive.", "score": 2, "replies": [{"body": "Their products are largely low quality in comparison to anything at that price range. Their bike doesn’t have an actual power meter on it like Stages spin bikes (manufacturer behind equinox’s bikes, including the soulcycle bike) or Wahoo. Instead it uses an adjustable magnet on the flywheel and a sensor that reads rpm and proximity to the magnet every 1/3s to “infer” the watt output. It’s wildly inaccurate and leaderboard “cheating” is pretty apparent (people putting in 90min sessions that’d place their output on greater levels than tdf). Similarly their treadmills are priced against Woodway’s with none of the precision or comfort.", "score": 0, "replies": [{"body": "Maybe we're talking about different things, but power meter vs no power meter to me is a design choice difference and is not a reflection of quality. There are plenty of articles and videos comparing peloton with others, I'm sure you've used many too. Very few call the peloton bike low quality, but if you're hung up on the power meter, then sure, you've got it.", "score": 2, "replies": [{"body": "A Toyota Corolla is a very high quality car. A Toyota Corolla priced at $95k is not a high quality car. \n\nManufacturing a very low spec piece of equipment to high fit&finish and pricing it at the same level as a high spec piece of equipment at standard fit&finish does not make it “high quality”. A power meter is inherently mandatory if you’re building a platform that compares scores across others (and if you ever want to gamify the or expand the functionality beyond personal progress). \n\nI say this as someone who’s owned one since 2018, wife rides 3-4x/wk, gone to studio classes regularly pre-pandemic, and I put in 1000 miles/mo of training in 2020. \n\nThe content ecosystem is the only thing that makes peloton high quality and captures its sub base. The bike itself is forgettable in comparison to trainers and spin bikes at the same price range.", "score": 1, "replies": [{"body": "You're changing the framing of the issue. The person said the product sucks. Lots of people love their peloton and used it every day of the pandemic with no issues. It did not suck.\n\nI get it, you don't like that it doesn't have a power meter. Go enjoy a different bike.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think age demographics will be huge. If they can make Peloton (more) senior friendly, and focus their advertising, it may turn around. I'll be on the side lines either way. But if they survive the next few years i'd consider buying.", "score": 1, "replies": [{"body": "Seniors are fragile, technofobic (in general) and seldom like to waste money. They're the opposite of what PTON targets", "score": 1, "replies": []}]}, {"body": "It's a terrible company with a terrible product. It was very prevalent during the memestocks era and some Youtubers hyped it, so I guess some people still have a wrong impression from back then or are bagholders. It hasn't got anything special, it hasn't got a promising strategy like the other names.\n\nNow he's not claiming that it's a good stock so him mentioning it is fair game, but it still feels like an insult to have it in the presence of the other names and to give it a platform at all.", "score": 0, "replies": []}, {"body": "Never been on a Peloton. But they have subsidiary called Precor that absolutely slays the competition in traditional gym cardio equipment. I invested a small amount in them about a month ago 100% because I love Precor. I very well may have just burned $50. Lol.", "score": 1, "replies": []}]}, {"body": "Paramount moving from legacy TV to streaming\n\nAemetis, move from ethanol based products to producing jet fuel and renewable natural gas\n\nShopify is getting into logistics as well as providing the store front software\n\nNot in any of those but could be very big if successful. Warner Bros Discovery is my main stock choice over the next few years", "score": 6, "replies": [{"body": "Do you worry about Aemetis needing to dilute their stock? I hadn't heard of them until I saw a report that mentioned them along with Amyris and Origin Materials,  and those are 2 that I love so I am trying to learn about Aemetis. Any DD you have on them would be great to hear!", "score": 1, "replies": [{"body": "I'm not in any of those and not really kept abreast of the news about them. Aemetis has a 5 year plan that's on their website, not been in since the beginning of 2021 though. I'm in Amyris and it's one of the worst decisions of my life 😂", "score": 1, "replies": []}]}]}, {"body": "Vertex Pharmaceuticals", "score": 8, "replies": [{"body": "Any reason? How is their pipeline transformative or differentiating from any other mid-sized pharma company?", "score": 1, "replies": []}, {"body": "Please elaborate.", "score": 1, "replies": [{"body": "They have the monopoly on cystic fibrosis. And they are going to have their exclusive patents for many many Years\n\nBut\n\nThey're improving a ton and they have a lot phase 3 and phase 4 products in some other areas that can make them (easily in my opinion) one of the big 5 pharma companies. Now they are like between 15 and 20 by market cap. If everything goes well, they can be with Roche, Abbvie, Eli Lilly, Pfizer...", "score": 1, "replies": [{"body": "Thank you for the answer!  \nNot too convincing for me, honestly, especially because their one trick should be priced in. Kalydeco has been around for like a decade iirc. And it's just for certain mutations/subtypes (don't know about the combined treatment with the newer medication, though).\n\nBut assuming 80-100k patients with CF worldwide, the mutation Kalydeco is used for accounts for like 5k or so. And most certainly not all of them get it. Now the medication is very expensive, so we're still talking money, but just to put everything into perspective.\n\nSo it really comes down to their pipeline rather than what they've got.", "score": 1, "replies": []}]}]}]}, {"body": "Here, I'll list one ticker from an un-sexy industry that /r/stocks probably pays little attention to\n\n**Ticker**: Waste Management (WM) \n\n**Traditional business model**: Garbage pickup, utility-style oriented business that succeeds off of scale and gaining market share\n\n**Changes to business model**: Most landfills are the source of feedstocks for renewable natural gas (RNG) and sustainable aviation fuel (SAF) produced under the Fischer-Tropic (FT) method.\n\n**Additional room for upside / growth**: WM has communicated that certain RNG feedstock supply agreements are already in-place and [capex has already been set aside to build out the necessary infrastructure](https://www.bamsec.com/filing/110465922010614/2?cik=823768&hl=11964:11989&hl_id=4yfktt95n) to capitalize on this emerging growth market that's [being made available to a mature, low-growth industry](https://www.bamsec.com/filing/110465922010614/2?cik=823768&hl=11964:11989&hl_id=4yfktt95n)\n\nSame thing with SAF - [WM has already entered into a long term feedstock supply agreement](https://fulcrum-bioenergy.com/partners/waste-management/) with the first private company to begin making SAF from municipal solid waste\n\nFor background, I work in renewable energy M&A advisory, so I'm familiar with the cash flow economics and risk profile associated with the renewable fuels industry.", "score": 3, "replies": [{"body": "Now that's finally an interesting take. WM has gotten thrown around here a lot recently (which is almost a concerning sign lol), but I haven't seen your take yet.\n\nWhat are your expectations for them?", "score": 2, "replies": [{"body": "Completely depends on where the renewable fuels / RNG markets are going in the next 1 - 3 years....[which is up in the air at the moment](https://irena.org/-/media/Files/IRENA/Agency/Publication/2021/Jul/IRENA_Reaching_Zero_Biojet_Fuels_2021.pdf) w/r/t SAF when you consider the lack of publicly traded sustainable aviation fuel companies. The one's I can come up with off the top of my head: Lanza went public by way of deSPAC but I don't think it's closed yet; I think Neste's fairly active in this market, but they're super late to the game compared to some of the privates that are out there like Enerkem, Fulcrum, Red Rock, etc.\n\nIt'd be encouraging to see additional government incentives for SAF that you see with renewable diesel (mostly in a designated RIN pathway) or, even better, a national-level LCFS-type credit system, similar to what you see in California.\n\nThat being said, RNG is different beast (and I have less background in RNG vs renewable fuels), but I think a big game changer here would be, again, another LCFS copycat system - not at the national level, but, weirdly enough, if the state of Wisconsin. \n\nThe reason being is that RNG produced from dairy farms has the lowest CI score by [a wiiiiiiiiide margin](https://ww2.arb.ca.gov/resources/documents/lcfs-pathway-certified-carbon-intensities), which honestly would result in a tooooon of explosive growth, mostly by public companies like CLNE or REG (now Chevron) buying up PE-backed privates. It would likely double or triple the annual FCF most of these small privates are making now in the state of Wisconsin (which is probably why most have been bought by PE funds at this point, waiting on legislative action to take place).", "score": 1, "replies": []}]}]}, {"body": "There is more to those stories, though. Take META. What attracts me to META right now is the fact they are cheaper than blue chips companies like P&G. The difference is that they have margins that are MUCH higher than P&G, way lower headcount and ZERO long term DEBT. I do not care if the Metaverse does not pay off. They are a cash machine and they could easily return value to shareholders just by focusing on core business and start paying a dividend.\n\nAnd sure, there are tailwind such as a recession and threats from other platforms. But META has proven multiple times that they kick ass in their core business of social media. They launched Reels and they are already competing against TikTok. Same thing they did with Stories a few years ago. They are not scared to pivot their apps quickly and keep them as winners.", "score": 4, "replies": [{"body": "I had a hard time getting over them buying back the stock like crazy at 300-350+ in q3, q4, and January and then nearly stopping cold turkey as soon as the stock crashed. That’s saying they believe the drop is warranted and also didn’t see it coming.", "score": 1, "replies": [{"body": "Yeah that’s fair. To their defense though, this was standard practice for all of Tech and beyond. Horrible use of cash and I hope it never becomes the norm again. But they all did it in times of low interest rates.", "score": 1, "replies": []}]}]}, {"body": "DAR- Darling Ingredients. They collect waste to make ingredients. They recently expanded into a big biodiesel operation, which is much higher margin. Biodiesel is under pressure right now, rightfully so, because it uses food to make fuel. With food prices up, biodiesel is kinda a drain. However, darling uses waste to make their products, so it doesn't take away from the food supply. Diesel refining is sorely lacking in this country and darling is helping to fill the gap. They have a second refinery coming online soon too.", "score": 2, "replies": []}, {"body": "Let me preface this by saying I only hold a small portion of this stock. With most of my assets in blue chips. But I think it’s safe to say GameStop fits this category. Brick and mortar game store transitioning into an online marketplace with a crypto wallet and potential NFT marketplace. If you believe in any of those things, they have a pretty diehard shareholder group aswell. Seems like an ok bet", "score": 8, "replies": [{"body": "Cant stop", "score": 7, "replies": [{"body": "Won't stop", "score": 0, "replies": []}]}, {"body": "Yes. NFT and crypto are doing great. They definitely weren't bubbles fueled by excess liquidity. AND there definitely aren't countless players in this arena already.", "score": 6, "replies": []}, {"body": "“A diehard shareholders group” that is a bit of an understatement.", "score": 2, "replies": []}, {"body": "I can’t go one day without seeing this turd of a stock", "score": 5, "replies": []}, {"body": "Industry headwinds moving towards digital will constantly chip away at Gamestop core bizz\n\nNFT market is dead in the water atm..only 1bil in volume in June compared to 8-12billion each month end of 21/start of 22... Alot of that volume was from a small % of users.. Miney laundering etc.. Also for the few retail involved the cost of living has risen so much that buying stupid jpegs just isn't worth it anymore..\n\nGamers also dont want NFTs and they've shown that with the universal hatred thrown at ubisofts NFTs ideas", "score": 3, "replies": [{"body": "I would love to be able to sell my OG Fortnite skins and dances", "score": 2, "replies": []}]}]}, {"body": "I get down voted every time I say it but Blackberry transformation from a phone company to a cyber security company that holds the default operating system for the connected vehicle.  Soon to start collecting all that vehicle data up into the cloud via IVY partnership with Amazon.  And it trades at $5.  I’m all in.", "score": 4, "replies": [{"body": "encourage skirt squeeze air one fine liquid beneficial long tease\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}]}, {"body": "Harte Hanks [HHS] looks like it may qualify as a potential successful business transformation.\n\nIt appears that its turnaround has already begun attracting notice on Wall Street. Its performance is doubly impressive in light of the prevailing gloom and doom atmosphere of the market these days. \n\nhttps://finviz.com/published_idea.ashx?t=HHS&f=070222&i=HHSd225903425i\n\nThe main questions for potential investors/speculators are how sustainable the turnaround is and how long it can continue to buck prevailing macro headwinds affecting the stock market. \n\nAs background to understanding its corporate journey, let’s take a look at HHS history:\n\nFounded by Houston Harte and Bernard Hanks 100 years ago as Harte-Hanks newspapers, the company spent its first 50 years operating newspapers in Texas. In 1968, the company relocated from Abilene to San Antonio. It made its first IPO on March 8, 1972, later diversifying into television and radio properties. In 1984 the company’s managers took it private, later going public again in 1993. In the mid 1990s, the company withdrew from the newspaper and broadcasting business and focused solely on direct marketing and shopper publications…\n\nHarte Hanks owned and operated PennySaverfrom 1972 to 2013.\n\nStarting in 2006 Harte Hanks engaged in a series of strategic acquisitions in the software, digital marketing, advertising and media space as well as database and data analysis industries. \n\nHHS was added to the Russell Microcap Index on June 27, 2022 a few months after being uplisted to the NASDAQ exchange, key benchmarks of the success of their turnaround strategy led by CEO Brian Linscott.\n\nAccording to their current investor relations page HHS is “a leading global customer experience company whose mission is to partner with clients to provide them with CX strategy, data driven analytics and actionable insights combined with seamless program execution to better understand, attract, and engage their customers”.\n\nThose seeking to better understanding HHS’ recent transformation should study their partnership with WIPRO beginning in 2017.\n Wipro and Harte Hanks to Offer Marketing Technology Services https://www.wipro.com/newsroom/press-releases/2017/wipro-and-harte-hanks-to-offer-marketing-technology-services/\n\nWe are in a bear market, folks, and risk must be minimized at all times. In my own estimation, this is a somewhat risky speculation. Nevertheless, the chart is a compelling testament to the success of their recent transformation in contrast to dismal stock market conditions of late.\n\nhttps://finviz.com/published_idea.ashx?t=HHS&f=070222&i=HHSm235028159i\n\nSome say that stock market leaders during a bear market tend to be truly outstanding performers once the bear market ends. If so, HHS speculators might want to strap on their seat belts. The reversion to the mean may be just getting started.\n\nOn a fundamental basis, with a P/E of 5.32 forward P/E of 8.39 P/S of 0.44 Sales growth Q/Q of 12.1% and EPS Q/Q of 257.8% Gross margin of 18.7% and Operating margin of 11.3% (per Finviz) shares do not appear to be grossly overvalued.\n\nI am a long term investor seeking leading best of breed companies possessing sustainable competitive advantage. HHS is a microcap with a market cap under $1B. There is no indication to date that HHS yet qualifies under these standards. \n\nDISCLOSURE The above information should not be construed as a stock recommendation but is presented here to the Reddit community merely as an experiment in crowdsourcing investment information for the benefit of the small investor. This is merely a starting point for further research. Readers are advised to consult an investment professional and to perform their own due diligence.  I have no connection to Harte Hanks Corp. whatsoever and have never owned shares in this company. On the other hand I do own shares of both GOOG and FB within the same broad industry grouping as HHS.\n\nFor more details on HHS and its putative  transformation journey please consult their website, SEC filings including their latest Form 10K and recent investor event presentations.", "score": 2, "replies": []}, {"body": "Johnson & Johnson (JNJ): currently paying down debt and shedding low return projects which is increasing the company's free cash flow. They are also shrinking their interest bearing debt with most capital raised through income. This is increasing their net cash flow and losing their debt ratiom", "score": 1, "replies": [{"body": "And big lawsuits left and right from their baby products laced with a type of asbestos.", "score": 4, "replies": [{"body": "Except they are spinning off that part of the company to a new company that will take the hit instead of them.", "score": 3, "replies": [{"body": "I remember hearing this. A dirty maneuver", "score": 3, "replies": [{"body": "Yeah, I'm not happy about from a moral perspective. Financially it is common and a smart move.", "score": 2, "replies": []}]}]}]}]}, {"body": "Intels leadership sucks, they need to clean house. Then I’ll believe that they’re a turnaround candidate", "score": 1, "replies": [{"body": "Gelsigner 110% made the right decision doubling down on the manufacturing side of the business. Even under the most bearish assumptions where they can’t claw back market share from TSMC and Samsung, demand for semiconductors will only increase. And there simply aren’t that many companies in the world that produce them at scale. They’re moving into the discrete GPU space too where they’ll be able to undercut AMD and Nvidia if they can pull it off.\n\nThe macro plays from Intel have been solid. It’s the execution that’s disappointing.", "score": 3, "replies": []}]}, {"body": "STLA is a promising candidate for traditional car companies moving into the EV space.", "score": 1, "replies": []}, {"body": "Anyone do research on CVS? I've heard they are transforming into a pure health play.", "score": 1, "replies": []}, {"body": "T. Up 14.69% over the past 6 months. 5.21% dividend. Capex falls dramatically next year as they finish replacing their old copper infrastructure. With the infrastructure bill passed, they will likely be expanding their consumer base. They provide some of the fastest internet speeds available with fiber and we are heading to a world that will only ever be more connected and require more bandwidth for the massive amounts of data we produced and consume. With management now focused on their core business (emphasis on being the leading broadband provider) and creating shareholder value, I expect a focus to be a reduction of debt and buybacks in the coming years.", "score": 1, "replies": []}]}
{"title": "Don't get to excited about Friday's ripper: It's a trap", "selftext": "So you guys all saw the insane upwards movement on stocks last Friday. Part of why it happend is the following: The Atlanta Fed published Q2 GDP estimates to be -2.1% basicly confirming we are in recession. \n\nWhy does this matter? I think the markets thought that this means QE aka moneyprinter go brrr is coming back. \n\nHowever what most of yall probably didn't realize is that the FOMC meeting minutes are being released upcoming Wednesday. \n\nI expect the markets to stay flat / drop until Wednesday as investors are getting nervous about the Fed's next move. Good luck yall and trade responsible in these uncertain times.\n\nTLDR: If you bought puts last Friday and you didn't close there may still be a chance for profit & break even next week.\n\nPostitions: 3X 7/15 SPY 380P", "id": "vpqlfj", "created_utc": 1656764379.0, "score": 53, "upvote_ratio": 0.79, "num_comments": 86, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|43|**First Seen In WSB**|1 year ago\n**Total Comments**|1204|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/ntjqav/cpi_inflation_data_important_fed_meeting_coming_up/) [x](https://www.reddit.com/r/wallstreetbets/comments/u7wf7z/interesting_trading_strat_for_guaranteed_gains/) \n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vpqlfj)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vpqlfj)\n    \nHey /u/MikeMikeGaming, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "\"trade responsible\" proceeds to post cheeky position... Some balls I tell ya...", "score": 32, "replies": [{"body": "Do as they say not as they do?", "score": 5, "replies": []}]}, {"body": "I feel like opening a UVXY straddle to exploit a massive change in volatility following the reports. They are trading pretty cheap rn as well.", "score": 9, "replies": [{"body": "Yes. I used various UVXY option strategies to exploit the action Friday 9-12 for ~40% gains (by repeatedly reversing from calls, to puts, and back, with short expiry). Fridays action, general momentum, and a few catalysts all seem to indicate an exploitable volatility peak next week.\n\nPositions:\n\nNone. Long weekends scare me. I intend to enter a bullish option position if there's an opportunity Tuesday AM.\n\nNotes:\n\nI play this extremely risky strategy in a very risk mitigated manner. My gains are usually not like Friday's 40% in hours, instead half the gains in days for options, sometimes weeks for shares. Even Friday, hindsight optimal play was about a four bag. There's lots of potential if one has their shit together.", "score": 3, "replies": [{"body": "Are you me?", "score": 2, "replies": []}, {"body": "RemindMe! Monday", "score": 2, "replies": [{"body": "If I'm wrong I'll post my 100% YTD executing IMO poorly. There's potential that's somewhat difficult to exploit.", "score": 2, "replies": [{"body": "🤞", "score": 2, "replies": [{"body": "This is kinda fucked. UVXY may bounce off of 14, again. Or, maybe the bull market trend persists into tomorrow.\n\nI'll probably pick up some shares in premarket, some options on the opening action. But, I'm hoping the bull trend continues. If UVXY strike hits <=13 tomorrow, good chance I'll be YOLO and options heavy, extreme aggression for me.", "score": 1, "replies": [{"body": "Watching with interest\n\nGo get em champ\n\nRemindMe! 16 hours", "score": 2, "replies": [{"body": "RemindMe! 2 weeks", "score": 1, "replies": [{"body": "I will be messaging you in 14 days on [**2022-07-23 19:31:03 UTC**](http://www.wolframalpha.com/input/?i=2022-07-23%2019:31:03%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/vpqlfj/dont_get_to_excited_about_fridays_ripper_its_a/ific3bc/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fvpqlfj%2Fdont_get_to_excited_about_fridays_ripper_its_a%2Fific3bc%2F%5D%0A%0ARemindMe%21%202022-07-23%2019%3A31%3A03%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vpqlfj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I will be messaging you in 1 day on [**2022-07-04 00:00:00 UTC**](http://www.wolframalpha.com/input/?i=2022-07-04%2000:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/vpqlfj/dont_get_to_excited_about_fridays_ripper_its_a/ielepka/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fvpqlfj%2Fdont_get_to_excited_about_fridays_ripper_its_a%2Fielepka%2F%5D%0A%0ARemindMe%21%202022-07-04%2000%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vpqlfj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "I've been on this train for 6 mo this.    \n     \nWelcome to the party, fam.", "score": 1, "replies": []}]}, {"body": "Everyone and their moms turning into Michael J. Burry in this sub", "score": 10, "replies": [{"body": "Ah yes, the permabulls read my post at last", "score": 2, "replies": []}]}, {"body": "Insane upward movement ? It was a sideways choppy day with a little bullishness at best , far from a ripper", "score": 14, "replies": [{"body": "We went from -0.5% to +1.1% in like 2 hours", "score": 10, "replies": [{"body": "Stop salting my wounds lol", "score": 2, "replies": []}, {"body": "+0.6% is \"insane upward movement\" to you?", "score": -5, "replies": [{"body": "you mean 1.6?", "score": 10, "replies": [{"body": "Yeah, that's what I get for looking at reddit while drinking and camping lol", "score": 4, "replies": [{"body": "Drinking, camping, and WSB? Are you me???", "score": 2, "replies": [{"body": "You can’t call it camping if you are homeless", "score": 3, "replies": []}]}]}]}, {"body": "I am not gonna get over confident and get cocky. I respect the bearmarket rallies as they wipe out my puts.", "score": 1, "replies": []}]}, {"body": "that's still a less than 2% change.  Dramatic much.", "score": -1, "replies": []}]}]}, {"body": "Everyone keeps wanting to make sure everyone else knows we’re about to tank/crash. Surely they can’t all be wrong", "score": 6, "replies": []}, {"body": ">I think the markets thought that this means QE aka moneyprinter go brrr is coming back. \n\nI can assume you that no one thinks QE is around the corner.", "score": 6, "replies": []}, {"body": "Weekly options expiration and fund shuffling. I wouldn't take anything from Friday besides that", "score": 9, "replies": [{"body": "I am so lucky to be scalping puts like crazy last Friday then. If I didn't trade like 50 times for a 400$ profit I would be down 1k now I am just -600 down on my 3k position because of the fuckery", "score": 0, "replies": []}]}, {"body": "Spy definitely going down to 330 🐻✌️", "score": 12, "replies": []}, {"body": "I disagree.", "score": 4, "replies": []}, {"body": "I had about 20 of those I bought after the massive rally the previous week. Lucked out and sold at the bottom yesterday to break even. I bought a bunch of Aug, Sep, and Oct 350p and 370p at the top yesterday... and am curious if that's far out enough. They're going to keep stringing retail along until they either lose all their money or become one of them.", "score": 3, "replies": []}, {"body": "Tuesday or Wednesday, we go up to 401 before dropping. Congratulations call holders.", "score": 5, "replies": [{"body": "That would make zero actual sense, so it's bound to happen.", "score": 2, "replies": [{"body": "That's the gapfill from June 9th that needs to be filled.", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}, {"body": "3k position lol", "score": 2, "replies": []}, {"body": "I see massively over leverage short cucks hedging for the upside while barely being able to hold onto their short positions.", "score": 2, "replies": []}, {"body": "Gap up-crash down, thats the way we like to fuck. I’ll see myself out", "score": 2, "replies": []}, {"body": "That was short covering.  Had nothing to do with any news.", "score": 2, "replies": []}, {"body": "\"Insane\" upwards movement of 1% lol", "score": 5, "replies": [{"body": "Yes, seems small, but it’s the down 1-2%, then up 1-2% in the same trading session that is the real story.  Dramatic shifts, by the minute.\n\nI watched in the 10am ET hour as this thing shifted completely.  Some kind of serious computerized buying kicked in.", "score": 7, "replies": []}]}, {"body": "What you are missing is The Desk has missed their targets for QT. The fed is still not against the market, maybe this is the news that propelled the market ahead. Negative economic news coupled with accomodative fed is what drives bull runs.", "score": 3, "replies": [{"body": "Reposition buying for a 2nd half rally", "score": 3, "replies": []}, {"body": "When has the FED been accomaditve this year? We have only seen higher and more rate hikes so far", "score": 1, "replies": [{"body": "The Fed implementing QT should mean that they’re reducing their balance sheet, but ever since they officially started QT June 1st, their balance sheet has only increased. Pretty sure that’s what he’s talking about. Instead of the Fed rolling off/selling MBS/bonds, they’ve been buying more, even though they said they were going to stop.", "score": 6, "replies": [{"body": "The balance sheet dipped this week by 20 billion", "score": 1, "replies": [{"body": "No.. no it did not.. [Just take a look at their current balance sheet as of June 30th](https://www.federalreserve.gov/releases/h41/current/h41.pdf)\n\nYeah they’ve been rolling off/selling some, but it’s nothing compared to the $9 trillion balance and the amount they said they were going to reduce every month", "score": 3, "replies": [{"body": "https://fred.stlouisfed.org/series/WALCL\n\nI using this as my source the charts shows a dip", "score": 1, "replies": []}]}]}]}, {"body": "The FED say they are going to be not accomodative but their actions dont show they are still accomodative. The pace of rate hikes are just aimed at showing they are trying to fight inflation, not really fight it. The Desk failing to sell its target amount of assets shows that they are going to just keep talking.", "score": 3, "replies": []}]}]}, {"body": "380p was the play last week you dummy", "score": 2, "replies": []}, {"body": "It’s good to be you. My 7/15 SPY are $350", "score": 3, "replies": [{"body": "Same here, trying to play the CPI dump on 7/13", "score": 4, "replies": [{"body": "Yeah, I sold a few at a loss last week and am just hanging on to a few more to see what happens. Starting to hurt though lol", "score": 3, "replies": [{"body": "Yea I was honestly thinking about rolling them up, -40% but I’m waiting to see what happens Tuesday", "score": 2, "replies": []}]}]}, {"body": "8/1 380 put here 🌈🐻", "score": 4, "replies": []}, {"body": "When did you buy those", "score": 1, "replies": [{"body": "About a month ago. I thought it was plenty of time", "score": 1, "replies": []}]}]}, {"body": "WHY DID THE VIX SPIKE 6% right before the rally????", "score": 2, "replies": [{"body": "Q2 GDP was estimate to be -2.1% lol", "score": 3, "replies": [{"body": "🤔 but after the vix spike around 1:30 it quickly fell and spy ran 1.4% it makes no sense to me", "score": 3, "replies": [{"body": "It will next week believe me. Remember last Friday 3% rally to 390 and what happened afterwards?", "score": 1, "replies": [{"body": "I don’t remember remind me please did we tank", "score": 2, "replies": []}, {"body": "I think we might rally to fill the gap on June 9th at 401", "score": 1, "replies": []}]}, {"body": "Plunge protection team in action", "score": 0, "replies": [{"body": "&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}, {"body": "But I thought JP shut off the money printer on june 3rd", "score": 0, "replies": [{"body": "They are like drug addicts they cant just quit printing money cold Turkey", "score": 0, "replies": []}]}, {"body": "Propping those assets up.  No one wants to be the bag holder.  This past 6-12 months, I’ve witnessed more dramatic up and downs in one session than ever before.  Algos are completely in control, and you simply have to trade with them.  Not against them.", "score": 0, "replies": []}]}]}]}]}, {"body": "Friday ripped? Huh, I was busy watching semis crash and burn into oblivion because MU earnings, which were actually good, but Sanjay said they expect PC and phone sales to decline a bit. Lol.", "score": 2, "replies": []}, {"body": "I bought some calls, so you’re probably right", "score": 1, "replies": []}, {"body": "Fed ain’t unwinding shit", "score": 1, "replies": []}, {"body": "\"Trade responsible\" ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "My thoughts are Tuesday quasi flat. 0.75% from high to low.\nWednesday quasi flat. 2% from high to low.\nThursday.... Musical chairs....\nLots if bulls without one.", "score": 1, "replies": []}, {"body": "tots excited can use it to exit my positions Monday prior us open", "score": 1, "replies": []}, {"body": "I'm going to buy calls on everything. Too bearish in here.", "score": 1, "replies": []}, {"body": "Nah fam we about to have a bull run. \n\nBull till fed meeting then bear for a week then bull. This will happen till we crash. textbook ABC pattern on Friday, we will have a small rally especially considering Russia is only wanting to annez a portion of Ukraine at this point. \n\nBought a call spread cause choppy market don't wanna loose my ass if I'm wrong\n\nEdit: all other positions are sold options cause I'm a pussy", "score": 1, "replies": []}, {"body": "Yea okay 👌", "score": 1, "replies": []}, {"body": "I have one put, 7/27 at $354 is all I could afford.", "score": 1, "replies": []}, {"body": "Agreed the market is headed lower, probably new 52 week lows by months end", "score": 1, "replies": []}, {"body": "But they cant do QE unless inflation is down? right? right??", "score": 1, "replies": []}, {"body": "Ripper? 1%?", "score": 1, "replies": []}]}
{"title": "Unity (U) is undervalued due to overcorrection in the bear market.", "selftext": "Unity (U) is an extremely underrated company at its current share price.\n\n**My position:**\n\n\\~100 shares & 2 cash secured puts sold with intention to get assigned in July. This makes up about 20% of my portfolio. Plan to keep averaging in until it is 30% of my portfolio. Cost basis per share is \\~$40. Will reevaluate my position once Unity hits 40B market cap or 5 years have passed.\n\n**The narrative:**\n\nSo why be bullish on (U) which has not been profitable so far?\n\nIs it because they are going to be the heart and soul of metaverse software? No! I don’t see that happening for a *long time.*\n\nIs it because their software is in practically every mobile game every made? No! I hate mobile games and think they are stupid (pc master race ftw).\n\nIt is for one simple reason that is more important than any other. **I hate auto desk**. I use auto desk products every day, and this has to be the stupidest least innovative company I have ever seen. Now if you only know about Unity at a surface level you may be asking yourself, wtf does Autodesk have to do with Unity? Unity is screwing Autodesk in 2 ways (This situation reminds me a lot of AMD vs Intel several years ago)\n\n1). The Weta Digital buyout. Weta makes/innovates/designs special effects. Unity now owns the software and a significant amount of the lead staff. Best known for their special effects in movies such as... Avatar, Lord of the Rings, ***Planet of the Apes.*** This buyout is undervalued imo. It not only gave Unity a major tech boost, but also severally undercut their competitor Autodesk by basically canceling WetaM which Autodesk was expected to benefit from with their “Maya” platform. Ha screw you Autodesk.\n\n2.)  Unity is expanding their presence in manufacturing and architecture. This is a big deal in manufacturing right now and as VR becomes more common Unity is much better positioned to take advantage of virtual tours and allow companies to benefit from prototyping. Nothing sells products like taking your customer on a virtual tour and showing them how it will be made. This a very big deal for industries and the ones embracing it are winning customer contracts.\n\n**Financials:**\n\nUnity is expected to become profitable in Q4 this year as they shift from research/development to profitability. I expect this will involve some moderate layoff numbers this year. I think the decisions they made with their IPO money were great and the Weta Digital purchase last year is really what made me start following this company.\n\nUnity \\~11B market cap Autodesk is 37B as a comparison (lots of room for growth)\n\nUnity is expected to grow Revenue by \\~40% year over year vs Autodesk’s \\~13%.\n\nDebt to Equity Unity 0.72 vs Autodesk’s 3.35 (going to be hard for Autodesk to continue investing in itself)\n\n**Why now?**\n\nUnity has been extremely volatile like many high growth tech companies but has found solid resistance at the $35 dollar level in the last 2months. I think now is the time to start averaging in.\n\n**TLDR:**\n\nUnity has been investing in itself for years building up to this moment. Also, Autodesk sucks and is going down like Intel.", "id": "vptv2r", "created_utc": 1656774680.0, "score": 68, "upvote_ratio": 0.81, "num_comments": 87, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|159|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vptv2r)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vptv2r)", "score": 1, "replies": []}, {"body": "They just laid off hundreds of employees. That doesn’t sound healthy to me. Obviously disgruntled employees are calling the inner workings like a “shitshow” but I found that to be true at every company I worked at.", "score": 45, "replies": [{"body": "There’s nothing more bullish than layoffs", "score": 6, "replies": []}, {"body": "Every tech company hired like dumb morons from alphabet too zillow.\nDo I think this is the bottom? Hell no\nDo I still think tech is the future? Hell yes", "score": 18, "replies": [{"body": "Tech is the future, just like Internet was int he dotcom crash. Doesn't mean buying early or buying dumb companies is a solid investment", "score": 3, "replies": []}]}, {"body": "The lay offs were a culling of unprofitable sectors that had no near term profitability plans. not hemorrhaging staff because they are out of money.", "score": 9, "replies": []}, {"body": "I consider that amount pretty healthy. I mentioned I expected layoffs in the post. Some additional contexts for why I am not worried is that Unity has been buying up a lot of other companies since 2020. Having gone through a few mergers myself, they are typically followed by moderate layoffs to reduce redundancy created by said mergers. Also, mergers and company culture usually take 2-3 years to start acclimating, sometimes longer for really large companies.", "score": 10, "replies": []}, {"body": "Yeah, Unity is downright bad and OP should try to invest in things he understands or rather GTFO from one's he has no idea about. Unity is shit, it's a cheap and bad engine that's outright hostile to do anything slightly out of the box with.\n\n\n\n\nThere's a reason 99% of unity projects you know about are byggy messes made by third world devs and sold at minimal prices. There's a reason you don't see Unity innovate, or devs branch out and expand within the engine. *Unreal Engine rats unity for breakfast* in every use, from Games (almost all AAA games) to movies (The Mandalorian). The only time you'd use Unity is if you have *extremely low budget, low skills, or expect the project to fail*.", "score": -1, "replies": [{"body": "That's not completly true either, there are a lot of successful games made in Unity, e.g.: Hollow Knight, Cuphead, Hearthstone (from the top of my head).\n\nI would say Unity is more accessable to beginner / hobbyist developers than Unreal is. Unity also has decided that if you are paying for the licence you don't have to show the Unity logo on boot.\n\nSo as you have mentioned we end up with a bunch of buggy messes \"promoting\" the Unity engine while the professional stuff is keeping quite about the engine used. But it doesn't mean that the engine is bad.", "score": 6, "replies": []}, {"body": "Ah yes, I did not realize Avatar was a low budget movie. My mistake. Announcing it here folks I was completely wrong. Please ignore everything I said.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Valid points. I bailed on my investment after the iron-source merger announcement. I came out with a 25% profit but that is pure luck. The iron source merger proved I was wrong about the direction the company was trying to go.\n\nI moved all my investment into my NVDA position. I am terribly overweighted but I have high confidence in the NVDA 5 year outlook", "score": 2, "replies": []}, {"body": "> Maybe that is Unitys next frontier\n\nUnity's already targeting movie production, and looks like people have already been using it too: https://unity.com/solutions/film-animation-cinematics", "score": 1, "replies": []}]}]}]}]}, {"body": "At these prices i say it’s a decent enough bet, why not lol.", "score": 24, "replies": [{"body": "Buy low sell lower", "score": 23, "replies": []}, {"body": "\"How much lower can it go?\" - WISHtards mid 2021", "score": 12, "replies": [{"body": "..how about mid 2022, when Feds made the biggest hike in 28 years and asset bubbles finally puncturing?", "score": 2, "replies": [{"body": "Awww lawd mothafuckin bootleg stock valuations 🔥🔥", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "88 @ $114 🙋‍♂️", "score": 11, "replies": []}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "I agree if that trend continues into next year, I won't stay invested. I am taking the companies guidance of increasing profits margins seriously. Part of that means decreasing share dilution.", "score": 2, "replies": []}]}, {"body": "I’m sold just because you mentioned planet of the apes", "score": 5, "replies": []}, {"body": "I like this one too. My investment portfolio is very reduced, and this one is 10%\n\nI'm holding a combo @40-45 for Jan 23, with same idea. Get assigned, or exercise, rinse and repeat.\n\nI see solid growth for multiplatform games and marketplace, more than anything else. There's risk, that's why rewards can be important too.... Financials are solid for the growth prospects.", "score": 10, "replies": []}, {"body": "Good pick but not yet. The market still needs a couple more big shits before the time to buy", "score": 13, "replies": []}, {"body": "This aged very poorly", "score": 3, "replies": []}, {"body": "Why didn't you just do a Cathy Wood and explain everything by squawking \"innovation\" like a parrot ![img](emote|t5_2th52|4275)", "score": 10, "replies": [{"body": "Cathy thinks zoom is going to $1500 a share. I think she has probably lost it.", "score": 11, "replies": [{"body": "SARK.  The valuations on Cathie's stocks are still problematic.  Tesla has 15x the market cap of Ford and so much of Square's revenue was tied to corn transactions which has fallen off of a cliff.", "score": 3, "replies": [{"body": "Square and corn??? Please explain", "score": 2, "replies": [{"body": "https://investors.block.xyz/financials/quarterly-results/default.aspx open the share holder letter.  Page 2 the gray text under the charts, you'll see Q1 revenue was $2.23B excluding Bitcoin.  The current price to sales ratio and other metrics are based on the $3.96B number.", "score": 2, "replies": []}]}]}]}]}, {"body": "Why is this bag holder advertisement pinned?", "score": 10, "replies": [{"body": "WSB pin? Big indicator to not touch this stock with a 10-foot pole.", "score": 3, "replies": []}, {"body": "because some mods prob bagholding", "score": 1, "replies": []}]}, {"body": "The problem is everything that can be done in Unity can be done faster, better and more efficiently in Unreal Engine 5. I say this as a game developer and programmer. I started with Unity and it is far worse than UE4 and 5.\n\nUnity uses C# which doesn’t have the same capabilities or applications as C++, Epic Games (UE5 company) also has their Visual Scripting language - Blueprints, which are great.\n\nI wouldn’t say Unity will disappear, but they aren’t a top dog in any field, they’re just the only publicly listed one.\n\nEdit: And I find it strange you’re comparing Unity to Autodesk. They are very different. Unity is for development (programming) while Autodesk is primarily for 3D modeling and animation.", "score": 4, "replies": [{"body": "I was just about to write this too. The autodesk comparison makes no sense and the unity product and technology are second rate...", "score": 2, "replies": []}]}, {"body": "My cost basis is 200 🥲", "score": 2, "replies": []}, {"body": "Easy another 50% drop", "score": 4, "replies": []}, {"body": "Dont try to sucker in the noobs a hole.", "score": 3, "replies": []}, {"body": "I am 100% with you. I bought another 40 last week. All talk endlessly about the metaverse, without realizing the big majority of all those apps are created in Unity. AR, XR, VR...", "score": 3, "replies": []}, {"body": "I have been trying to find something to say for a few good minutes, but your premises are so deeply wrong that it is hard to even start. You compared Unity to Autodesk, while they have absolutely nothing in common, they are different products that do different things. The only real competitor Unity has is Unreal, and trust me when I say that Unity is NOT the leader here. Sure, it has a dominant position in the mobile market, but it is not as easy as you think  to expand its market there. The amount of time people spend on mobile games has been almost constant for a few years, and it will be very difficult to increase revenues like that.\n\nI am adding also a few more points to this: \n\n1) Unity recently laid off a lot of staff. Never a good sign.\n\n2) They still have WAY TOO MANY employees if you consider that they only develop one product.\n\n3) They acquired a lot of software houses, but they are failing to integrate their products in Unity Engine (Unlike Unreal, which is amazing when it comes to add new software to their suite)\n\n4) This is the most important part: Unity is losing its identity. Until a few years ago, Unity was famous for being easy to use, easy to learn, and easy to teach. It flourished because its community was indie-based and extremely friendly. None of that is true any longer. Unity has failed miserably to keep its engine simple to learn and use. The engine has a lot more scripting required compared to the past (timeline. Cough) and way too many settings.\n\n5) The product itself is losing quality. I don't remember a crash from 2015 (when I started using it) to 2020. Since 2020 it happens almost weekly, because they roll out poorly-tested features.\n\nAll in all, as a developer, I am very pessimistic about its current state, and I do not think that it will improve from now on as a product. That said, we all know that the product quality isn't directly proportioned to the stock value (Laughs in Tesla). If you think it will raise in value well, fingers crossed for you, but if you think that it will happen because of its quality, you are very wrong.", "score": 2, "replies": [{"body": "Thank you for your thoughts. I think you make some really interesting points but let me clarify my position a little. \n\n1). My primary reason for sharing this DD is that WSB is turning into a meme haven and I would like to steer it back towards stock analysis. Be the change you want to see.\n\n2). Your 1st and second points  are a bit contradictory but I get the gist of what you mean. I personally am more in line with the second point, I do not think layoffs will be negative for the company. \n\n3). I never meant to imply that this is a sure bet. I think Unity is in a not so great place right now and a turn around story is in the making for this company. If they are not close to being profitable on their Q4 earnings I will be reevaluating my thoughts. \n\n4). Finally Autodesk has a lot more in common with Unity than you think. Fundamentally though my premise is based on knowledge of customer trends and conversations in manufacturing. This is not a short term play, but something I simply see enough potential for playing out on the next 5 years. I am simply making a “bet” before the story really gets started.", "score": 1, "replies": []}]}, {"body": "So puts?", "score": 3, "replies": []}, {"body": "The Unity game engine is a shit show. The 10 years deprecated networking system with no replacement in sight.", "score": 2, "replies": [{"body": "Out of curiosity what do you use? And just to be clear I am not expecting a large amount of growth on their gaming side. By their own admission they have like 50% of the market share so unless they change their pricing structure in a way that generates a lot more money I don't see that much opportunity for that part of the business.", "score": 2, "replies": [{"body": "Unless the market grows.", "score": 2, "replies": []}, {"body": "Unreal is a better engine, for example.", "score": 0, "replies": [{"body": "Unreal is better for certain situations, i say unity has an opportunity to capture unreal market then the other way around. \n\nC# is MUCH more friendly then c++ (in fact most people will never be able to learn c++ due to how unfriendly the language is). Ofc this all depends on unity’s execution but at this price (and lower) it’s a decent enough longterm bet for what you get (unity engine, ziva dynamics, speedtree and weta digital).", "score": 3, "replies": []}]}, {"body": "Godot! Godot 4 is going to be the shit for foss game dev", "score": 0, "replies": []}, {"body": "Unity for my current project, next project I plan to do more with Godot or Unreal. I made my own networking system the last 2 times I did multiplayer with Unity.", "score": 1, "replies": []}]}, {"body": "Worst engine I've ever had the displeasure of using. This is the place where game devs go to die. No thanks.", "score": 0, "replies": [{"body": "And loads of other stuff than games is made in Unity. Most metaverse apps, vr training, apps on your phone. Most mobile games, which are stupendously profitable.\n\nNot to mention a range of high quality games such as cuphead, hearthstone, tomb raider etc. And the list goes on. You can google it.\n\nIts extremely versatile unlike Unreal, that instantly suck when you try to build anything for Android or IOS. But is a master when it comes to AAA PC and movies.", "score": 3, "replies": []}]}]}, {"body": "Too much money going to the trash bin. In today's date.... Maybe too much risk.", "score": 1, "replies": []}, {"body": "Overcorrection, this company is barely profitable? All tech companies will get crushed in the recession", "score": 0, "replies": []}, {"body": "buying puts", "score": 1, "replies": []}, {"body": "Expanding in construction and manufacturing? Good luck with that. SolidWorks and autodesk make solid software and dominate, also companies tend to use the same software ecosystems for decades due to compatibility and because \"if it ain't broke don't fix it\". The barrier to entry is quite high.\n\nSource: used to work for an industrial electromechanical OEM as an engineer.", "score": 0, "replies": [{"body": "That is what people said about Intel too. Who would use AMD chips? Tides turn quickly and Autodesk is not in a good position to innovate itself. I understand your thoughts though and agree it is not a sure thing.\n\nI am from a similar background.", "score": 4, "replies": [{"body": "Having spent the majority of my career in Civil3d, nobody wants to migrate software from something they have become experts in. It's a difficult sell for anyone.", "score": 5, "replies": [{"body": "Ya there are definitely a lot of old hands that won't change. I see this more as a matter of capability that will be driven by improved sales for companies that go down this path. Eventually forcing an industry wide shift.", "score": 2, "replies": []}, {"body": "I cant compare w engineering, but going from Max to Maya to Blender only takes an expert 2 afternoons to adapt.\n\nAnd Blender is fantastic. No way I am ever turning back. Our entire company and remote offices and all departments use Blender over Maya and Max now.\n\nOnly boomers are complaining. Everyone else loves it!", "score": 1, "replies": []}]}]}, {"body": "Not like they are currently being decimated on all fronts. Starting with Max/Maya being replaced by Blender and more and more engineering firms are also turning to alternative software due to ADs redicilous price model.", "score": 1, "replies": []}, {"body": "I think unity actually is pretty well-positioned to expand in the construction industry. While Autodesk is a giant in the modeling space, beyond clash detection and 4D sims, people aren’t doing much with the models. Unity allows you to easily develop jobsite mock-ups that are navigable by anyone out in the field. Really easy to plan jobsite layouts and simple details like PPE signage and whatnot. I think it can and will go way beyond that. The construction industry is extremely sleepy and people are looking for ways to take advantage of it. Construction tech is a solid play now and apart from the reality capture stuff, Unity is the biggest player to watch. \n\nSource: used to work at a large construction firm as a virtual design & construction engineer", "score": 1, "replies": []}]}, {"body": "Selling at 30x price to sales. Good luck growing revenue to $5B. \n\n\"undervalued\" lol", "score": 0, "replies": []}, {"body": "Autodesk is an industry standard. Unity is a shitty game engine that 12 year olds use to make bad games. The company is already 17 years old and still losing millions every year. Most large gaming studios also have their own gaming engine and don’t need Unity.", "score": 0, "replies": []}, {"body": "Everything that you said is invalid because Unreal Engine 5 is superior and has Fortnite money behind it.", "score": 0, "replies": []}, {"body": "Is this the same Unity that’s getting smoked by Unreal Engine? If so, No thinks. You’re never unseating AutoCad and your engine isn’t preferred in graphics.", "score": 0, "replies": []}, {"body": "You working for Cathie? On ark payroll?", "score": 0, "replies": []}, {"body": "games made in Unity suck donkey dick", "score": -2, "replies": []}, {"body": "Nice DD retard", "score": -3, "replies": []}, {"body": "PE ratio of 0 is fucked. Expected to make profit in 2023? This trash will be private next summer.", "score": -4, "replies": []}, {"body": "Unity is trash. Every company is trash. It’s all going to zero. Fuck your longs", "score": -4, "replies": []}, {"body": "Going down like Intel, you say. Tell me more.", "score": 1, "replies": []}, {"body": "So puts on Unity AND Autodesk? Got it", "score": 1, "replies": []}, {"body": "A stock down 85% is a stock that was down 70% and got cut in half again. The bottom is in the single digits", "score": 1, "replies": []}, {"body": "Good luck taking on Autodesk in AEC industry. AutoCAD and Revit are so heavily embedded in production workflows that displacing them is a major uphill battle.", "score": 1, "replies": [{"body": "It’s exactly because they are so embedded that they have become such poor software products. \n\nI actually know a large company right now that is planning to negotiate a more favorable cost per license or start planning to transition to a new product.", "score": 1, "replies": []}]}, {"body": "They have 5.72 billion working dollars but only make 1 billion in revenue (probably a bit more this year but not higher than 1.5 B). Assuming a target price of $45 (so there’s some upside) they’d need to make $2.5 per share to reach a p/e of 18 which would be around fair value. This equates to 736 M total. They’d need a profit margin of 50% which I don’t see happening with them. Now they could definitely go up from their current levels if they grow smartly but there’s not enough upside for some sweet asymmetric risk", "score": 1, "replies": []}, {"body": "how does it fund its operations? is it profitable?", "score": 1, "replies": [{"body": "It raised a massive amount of capital during its IPO which has since been mostly spent on growth and buyouts. They have committed to being profitable by Q4 this year. \n\nMore details in the post.", "score": 1, "replies": []}]}, {"body": "FCF is positive right now, but how long do you think demand will be stiffled? Unity can't pay off its current debt with its tangible assets right now. Analysts also have the tendency to be shit in bear markets. A 40% revenue growth per year is probably not pragmatic. Good buy if you're optimistic, absolutely horrible if you're not.", "score": 1, "replies": []}, {"body": "Unity~~ *inrickjamesvoice*", "score": 1, "replies": []}, {"body": "Looking good right before earnings. Who knows what will happen.", "score": 1, "replies": []}, {"body": "Wonder if you could do an update for us on this stock 4 months later? Would love to know what moves you've done since this post. Please link to this comment if ever you do thanks!", "score": 1, "replies": []}, {"body": "You weren't wrong, just early :)", "score": 1, "replies": [{"body": ">:)\n\n:)", "score": 1, "replies": []}]}]}
