{"title": "How to sell billions worth of $TSLA like a boss", "selftext": "", "id": "vv8av0", "created_utc": 1657392488.0, "score": 745, "upvote_ratio": 0.88, "num_comments": 88, "comments": [{"body": "We have seen this already, show us something new.", "score": 1, "replies": [{"body": "On god pop off sis ![img](emote|t5_2th52|8881)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 104, "replies": [{"body": "Do you know how much bezos and gates cashed out ?", "score": 21, "replies": [{"body": "Bezos sold about $8B last year.  No stupid conspiracy theories needed.", "score": 39, "replies": [{"body": "You forget about the $40b he got rid of right before Covid in 2019.\n\nHe was probably planning the divorce to coincide with Covid downturn.", "score": 6, "replies": []}]}]}, {"body": "Why can’t they just, you know, sell the stock? Why go to all the charades of pretending to buy another company, and then pull out, inevitably tanking that other company’s stock, and having to pay a 1 billion dollar fee for not buying it. Seems like it would just be easier to sell your stock. Not like the SEC is gonna do anything about market manipulation.", "score": 11, "replies": [{"body": "[deleted]", "score": 37, "replies": [{"body": "He sold 16B last fall... and another 8.5B this year for twitter.  It 100% spooked the market.  He didn't have to answer questions for either sale.", "score": 11, "replies": [{"body": "Didn't seem to spook the market at all, Tesla is holding up extremely well all things considered", "score": -8, "replies": [{"body": "That's the point of this thread.\n\nSell around 10 billion worth of stock for no reason? Other investors panick and they sell a couple of billion as well cutting the price of the stock \n\nTell everyone you are buying Twitter and you need to cash out billions worth of stock? Investors take that at face value and don't sell a lot of their shares. Keeps price stable.", "score": 1, "replies": [{"body": "The guy I'm replying to claimed his sales 100% spooked the market, regardless of his twitter plan", "score": 2, "replies": []}]}]}]}, {"body": "Surely that’s easily explainable. Like when he sold a billion worth of stock to pay his taxes.", "score": 10, "replies": [{"body": "He sold 16B in 2021", "score": 6, "replies": []}]}, {"body": "Ya,but there should be rules in place to prevent this lie. Dont you see how it can have a massively negative effect?  Company owner has inside information of bad shit coming down the pipe for his company, he creates fake ploy to dump stock at artificially inflated price then bag holds other stockholders", "score": 3, "replies": [{"body": "Proving motivation is pretty tough.", "score": 1, "replies": []}]}, {"body": "I'm pretty sure gates has no ties in Microsoft so he can do whatever. \n\nBut if he sells billions of stock for no reason the price will tank.", "score": 2, "replies": []}, {"body": "Like Musk gives a fuck about that. He could say he's building funds for a new venture (which is probably true, what else is he going to do with all that money).", "score": 0, "replies": [{"body": "Pay child support", "score": 7, "replies": []}]}]}, {"body": "Sales like that do not happen often. Last year was an anomaly since it was so much liquidity being pumped everywhere. They want to cash out without causing panic", "score": 2, "replies": []}]}, {"body": "Whats coming!", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "He’ll be safest in cash?", "score": 1, "replies": []}]}]}]}, {"body": "\"Funding secured\"\n\n\\*Pumps another dude's wife on his friend's couch\\*", "score": 19, "replies": []}, {"body": "Didn’t he just take a loan out on the stock and not actually sell it?", "score": 7, "replies": [{"body": "He did both things: sold a big chunk and also took a loan against the remaining shares", "score": 3, "replies": []}]}, {"body": "I've said this since day one", "score": 3, "replies": []}, {"body": "But he lost $75B during this process. People are so stupid to browse these controversies.", "score": 3, "replies": []}, {"body": "Get off his dick. Is riding his cock all you do ?", "score": 9, "replies": [{"body": "sucker", "score": -5, "replies": []}]}, {"body": "jesus stop with the low effort bs", "score": 10, "replies": []}, {"body": "Why does everything have to be a conspiracy? And a convoluted one at that. He couldve used any number of reasons and neither would have been so retarded", "score": 2, "replies": [{"body": "But he chose this. It is, actually, kind of obvious by now.", "score": 1, "replies": []}]}, {"body": "*Comment liked by @elonmusk", "score": 3, "replies": []}, {"body": "Elon has 8 kids,  He dont know how to pull out.", "score": 11, "replies": [{"body": "This joke has been done like 1000 times since the news came out", "score": 49, "replies": [{"body": "The news \"came\" as well?", "score": 6, "replies": [{"body": "just it and elon I'm certain.", "score": 0, "replies": []}]}]}, {"body": "If most of them are IVF babies, I’d argue it’s not his pullout game that’s the problem but his defective swimmers", "score": 3, "replies": []}]}, {"body": "This quality of the sub is going to crap. It's like 80% identical Elon hate memes.", "score": 7, "replies": [{"body": "Went full retard, like the anti-work crowd moved in, took the sofa, and their grubby asshole scratchers got the remote.", "score": 15, "replies": []}, {"body": "Literally just saw a 1600 upvote comment on how musk is a republican fascist. God I hate when subs go mainstream and attract the low iq zoomer crowd", "score": 8, "replies": [{"body": "Can't wait until they are older and have to pay taxes.", "score": 1, "replies": []}, {"body": "True. \n\nWould bet that the people who said that about Elon have no idea what a Fascist is or what political party the Fascists most represent (hint - not the Republicans).", "score": -6, "replies": [{"body": "Yup I call em Homoliberalpus a sub species of Homosapians", "score": 0, "replies": []}, {"body": "I guess they might represent some weird third party. But of the major parties in the usa it would be republicans. That is usually what people mean when they say that. Fascists themselves dislike things about both parties but when they vote they usually vote for the republican party", "score": 1, "replies": []}]}]}, {"body": "It has been worse, just wait until it goes full retard on GME", "score": 3, "replies": []}, {"body": "Last two years it was Lord Elon now it's just IVF Elon", "score": 2, "replies": []}, {"body": "Wdym? It’s always been like this homey lol", "score": -1, "replies": [{"body": "Ahh.. to be ignorant of the old days.", "score": 1, "replies": []}]}, {"body": "Found the bagholder", "score": 1, "replies": [{"body": "No sadly I'm the moron who sold his Tesla stock at $200 pre-split", "score": 1, "replies": [{"body": "Oof. I was looking at buying around that time but our businesses needed the cash instead. Should have yoloed it.", "score": 1, "replies": [{"body": "I'm still salty about it.  Occasionally I'll do the math and check my \"missed gains\" and feel miserable for a bit.", "score": 1, "replies": [{"body": "At least you don't own a Tesla lol.. Things cost me more than any of his tweets. Their service is unreal.", "score": 1, "replies": [{"body": "I've heard that it's not great.  \n\n\nI live too rural and in too cold of a location to make an electric car make any sense.   \n\n\nMaybe some decade but not this one sadly.", "score": 1, "replies": [{"body": "I'm about as rural as it gets. It's about 3-4 hours to closest service center. Closest supercharger is about an hour away. All problems aside it costs me maybe $4 a day to charge for 250 miles? which is exponentially cheaper than gas.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Like a scumbag you mean", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "That original responder to his tweet is so annoying lol", "score": 1, "replies": [{"body": "I honestly think it's bots. I don't use Twitter but literally go on there just to read the replies under Elon's tweets. It's a spooky place", "score": 2, "replies": []}]}, {"body": "Dumb people who've accomplished nothing with their lives pretending to be intelligent and significant.  It's sad and pathetic.", "score": -3, "replies": []}, {"body": "he is buying TRUTH", "score": 0, "replies": [{"body": "That'd be so awesome.. the dumpster fire continues lmao", "score": 1, "replies": []}]}, {"body": "Not true, that’s what dark pools are for, which we well know is being heavily abused at this time", "score": 0, "replies": []}, {"body": "He must be buying popcorn and games.", "score": 0, "replies": []}, {"body": "He has 175m shares of tesla.. less than 20% He didnt liquidate shit.", "score": 0, "replies": []}, {"body": "There's only 1 split on the market that's going to bring value to investors the rest are looking for bag holders ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4267)", "score": 0, "replies": []}, {"body": "Stop sucking Elon's dick, he hates you.", "score": 0, "replies": []}, {"body": "He's sold before and it did nothing.", "score": 0, "replies": []}, {"body": "This post is a complete lie. He made a loan against his Tesla shares with jp Morgan Under the stipulation that it could not drop more than 43% of the current market price", "score": 0, "replies": [{"body": "He also sold billions worth of $TSLA stock. Part of the deal was financed with cash at hand from selling", "score": 1, "replies": []}]}, {"body": "He doesn't need to sell TSLA stock to buy Twitter. That's not how it works.", "score": -8, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Did he actually ever say that or was it just inferred based on the timing?", "score": 1, "replies": []}]}]}, {"body": "Do people really believe this nonsense!! Wall Street bets really is load of conspiracy laden bullsht…. I’m out", "score": -1, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "This is a stupid theory from some who doesn't understand much about the market. One stock doesn't disrupt the market. Also if you check his tweets he's been saying for years his stock is over valued. Also he's been screaming the market is overbought and will correct. Aside from the fact that you have a right to sell stock at any point you choose. Even it it disrupted the market, you can do it. Market makes do it daily. Totally legal.", "score": -5, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|76|**First Seen In WSB**|1 year ago\n**Total Comments**|472|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vv8av0)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vv8av0)", "score": 1, "replies": []}, {"body": "Wondering how much tesla stock dumps after the SEC starts an investigation into market manipulation...", "score": 1, "replies": []}, {"body": "fax", "score": 1, "replies": [{"body": "number?", "score": 2, "replies": [{"body": "hum?", "score": 1, "replies": []}]}, {"body": "number?", "score": 1, "replies": []}]}, {"body": "Always trust the platypus", "score": 1, "replies": []}, {"body": "Wow look at that. Someone said it on twitter. Must be true.", "score": 1, "replies": []}, {"body": "Well. Spooked the market he did.", "score": 1, "replies": []}, {"body": "Facts, lol", "score": 1, "replies": []}, {"body": "Ding ding we have a winner .", "score": 1, "replies": []}, {"body": "A Lot of us called this months ago. He did the same last year when he asked Twitter if he should sell Tesla stock to pay “taxes”. He just wanted to cash out at the top of the market.", "score": 1, "replies": []}]}
