{"title": "Bull case vs Bear case", "selftext": "I wanted to create a list of all the current Bull vs Bear conditions in the current market, and figured I would post it here so people could add in suggestions:\n\n**Bull Case**\n\n* A good amount of damage has been done in markets this year, bringing things down to fair/under valued (based on TTM and Forward EPS estimates).\n* Commodities look to have peaked, along with interest rate expectations, thereby signaling peak inflation (which is what started this whole thing).\n* The job market is still strong, unemployment is low and there's still something like 1.9 open jobs for every person.\n* The consumer is still strong and spending a lot of money. Their balance sheet is also healthy.\n* No recession this year. A slowdown in growth appears certain, but not a recession. Given the recent decline, the market has more or less priced in the current situation.\n\n**Bear Case**\n\n* While there has been a good amount of damage done, markets are only \"fairly valued\" on forward EPS estimates that have not been revised down. \n* Commodities are still higher than pre-covid levels by a significant amount. Peak inflation doesn't mean we instantly go back to 2%. Inflation is sticky, and higher than 2% will have the Fed continue to raise rates. Inflation may slow to 4 or 5% which is still way too high. If they raise and pause rates like the 1970's bear market, it will be a volatile mess.\n* Jobs are a lagging indicator, and things can change quickly.\n* A strong consumer contributes to inflation, forcing the Fed to continue rate hikes until inflation is below 3% at the very least.\n* Until we know what earnings look like, we can't estimate how deep the growth decline will be. It's safer to wait until earnings + forward guidance at the very least.", "id": "w1koet", "created_utc": 1658100849.0, "score": 73, "upvote_ratio": 0.9, "num_comments": 86, "comments": [{"body": "Bull case: most of Reddit is bearish.", "score": 118, "replies": [{"body": "Literally the best indicator.", "score": 33, "replies": [{"body": "I disagree.  I've been seeing some form of \"Be bullish when Reddit is bearish\" for months.  I don't think this is a good way to pick stocks.", "score": 4, "replies": [{"body": "Better than listening to those who sold in cash and selfishly want it to go down more to prove themselves right. Actually yes, sentiment it is a good contrarian indicator.", "score": 1, "replies": [{"body": "Do you have any actual evidence for that last line?  I've yet to see any sentiment index that had real correlation with stock prices, inverse or direct.", "score": 2, "replies": []}, {"body": "Is that really better then listening to a bunch of brand new investors who bought high and are now bagholding stocks at sky high valuations?", "score": 1, "replies": [{"body": "No, it's mostly bears with same tired trope these days. Exhibit A.", "score": 1, "replies": [{"body": "My comment is based in reality.  Yours is based on hope and pretending like reddit matters.\n\nSaying this sub is mostly bears is flat out wrong and questions your logic.", "score": 2, "replies": []}]}]}]}, {"body": "It's what people say who've been here for only 2 years.", "score": 1, "replies": []}]}]}, {"body": "So true! 💯🤣", "score": 6, "replies": []}, {"body": "Not for two weeks now", "score": 1, "replies": []}, {"body": "I remember reading that back in February lol", "score": 1, "replies": []}]}, {"body": " Bear case.  Cramer is wringing opening bell", "score": 77, "replies": [{"body": "Lol he’s gonna wring it around his neck", "score": 32, "replies": []}, {"body": "We’re fucked", "score": 11, "replies": []}]}, {"body": "I think bear case. The job losses come sudden and quickly. We wont see it gradually increase", "score": 14, "replies": [{"body": "Job losses follow the market not the other way around.", "score": 3, "replies": []}]}, {"body": "You didn't mention the dollar.  The dollar is rallying because while the US economy may have issues, they are very small compared to the worries Europe has over energy, and China has over their zero-covid and property bubble right now. \n\nUS clean energy / battery / ev tech is now exactly what Europe needs to wean themselves off Russian oil (and fossil fuels in general).  \n\nOver the next 10-20 years this shift will really start to become noticeable and countries that derive their wealth from the export of fossil fuels will see significant declines in profits.  \n\nWhile there has been some speculation that the US is in decline, the war in Ukraine has shown that the US still has by far the best force projection and intelligence gathering.  \n\nChina's zero covid strategy is hurting them deeply and driving a wedge between the people and the government.  In the face of more and more contagious variants, a collapsing housing market, and most importantly manufacturing moving back onshore, their economy is in serious trouble.  They may have to align closer with western interests which would be a huge win for the US.", "score": 11, "replies": [{"body": "Europe is going largely nuclear with France leading the way.\n\nBut USD going up? Is that a good thing for the US economy as a whole? I mean it’s great for me personality as well as company’s who are net importers. But overall? I’d like to hear your argument there.", "score": 4, "replies": [{"body": "Nuclear takes \\*along\\* time.  It will be helpful in the long term, but batteries/solar/wind can be deployed incrementally.  They can be mass produced and installed quickly with minimal costs compared to building an entire nuclear power plant.  \n\nUSD going up is a net positive for the US, especially right now.  It will help inflation, at the expense of the rest of the world.   \n\nThings are getting quite dire right now in many parts of the world.  See what is going on in Sri Lanka.  Food scarcity is going to get \\*way\\* worse before it gets better.  We could enter a feedback loop where the dollar gets stronger and stronger as the economic outlook in the rest of the world gets more and more dire.", "score": 4, "replies": []}, {"body": "It's generally a negative for US exporters and US based big tech since they have a decent amount of revenue coming in from other currencies. Big tech is a large component of the indexes so you could see an impact if you're mainly holding etfs.", "score": 1, "replies": [{"body": "A strong currency is a good indicator of a strong economy.  The currency market right now is clearly betting on the US.", "score": 3, "replies": [{"body": "In times like this where it's all relative yes, but to jump on that bandwagon you'd want to bet on companies that focus on the US domestic market rather than those that have a large proportion of international revenue like big tech. Stuff like American Express or Southwest Airlines would benefit from a strong dollar.", "score": 2, "replies": []}]}]}]}, {"body": "I’ll have what this guy is having!", "score": 1, "replies": []}]}, {"body": "Uncertain earnings, persistent inflation, and hawkish Fed dominate the Bear case for me.", "score": 19, "replies": []}, {"body": "I don't understand folks saying we are at or near normal valuations.  \n\nhttps://dqydj.com/sp-500-pe-ratio/\n\nAnd the more relevant ratios are just as bad.   price to sales, price to GDP, CAPE ratio, Market Cap/GVA, etc.", "score": 9, "replies": [{"body": "Yea pe average of 15 its from 1917. Look at the average lets say lat 10-20 years. I would say its around 20. Historical data is cool, but how relevant is 100 years old average ? If you followed that you would barely invest anything last 20 years.", "score": 22, "replies": [{"body": "I don’t disagree but at the same time the past 10-12 years includes QE and 0 interest which are both being reversed. \n\nGranted they’re not being reversed back to historical averages and our era of big tech means more growth justifying higher multiples, but I think it’s totally reasonable to at least look at the second half of the 20th century for a little perspective on what the market could look like with a moderate interest rate and fewer dollars in circulation.", "score": 0, "replies": [{"body": "you are right, my point was that time is different, investing is more mainstream, more mainstream creates more hype , more hype creates more demand. And while fundamentals DO matter and always will, i think we just have to adjust what \" average \" means nowadays. Finding good buys using the old and original lets say Graham metrics is almost impossible. For example if you wanted to wait for 15 PE on stocks like nvidia i dont think thats happening in next 10 years. But there are still people who thinks companies over 20 are overvalued.", "score": 7, "replies": []}]}, {"body": "It is very relevant.   The last 20 years has been a cacophony of free money and central bank largesse.  That will end some day, maybe someday soon.", "score": 1, "replies": []}]}]}, {"body": "Ya I'd argue with consumer spending, people are spending on debt which credit cards specifically, I'm sure they can raise rates as they see fit and are already absurd 15-20%+. Student loan payments should be kicking back in and once jobs go byebye good luck paying anything back and any poor bastard buying that 10%+ mortgage home. Gas is going down SLIGHTLY woopie doo it's still going to be 1.5X + what it was a few months ago and food prices skyrocketing will counter that anyways.\n\nWe're in this for the long haul IMO", "score": 12, "replies": []}, {"body": "Toro vs Oso", "score": 4, "replies": []}, {"body": "PE RATIOS with old earnings my friend. Let’s see how fairly valued we are after the next earnings.", "score": 4, "replies": []}, {"body": "They thought inflation peaked last month too..", "score": 4, "replies": []}, {"body": "I’m Team Bull on this one. I feel like the most “recession” we’re going to see is 3-6 months of company’s managing inventory but that’s about it. Some sectors may see more slowdown than others but we won’t see widespread damage.\n\nI think earnings season will be mixed based on sector but I don’t think it’s going to be bad. If it’s just mixed then I think the market will rally.\n\nEconomies in a recession don’t add 350k jobs. The US consumer is strong. In the end if we continue on this path I think we’ll be OK.\n\nBarring a black swan event I just don’t see how we can go any lower with the current circumstances.", "score": 14, "replies": [{"body": "I mean look, idk know what’s going to happen, but barring a black swan event? Are we just stacking the dead swans up at this point?\n\n1. Global Pandemic\n2. Failure of global shipping markets\n3. War in Europe\n4. Global energy crisis\n5. Global food crisis\n6. Heatwave exacerbating global food crisis\n7. Worldwide inflation to a degree we haven’t seen in four decades\n\nThere are a lot of dead swans in the lake right now and I’m probably missing a few.\n\nEDIT: Also, if you know anyone in reinsurance, you might ask them how many 1 in 100 year events they saw that impacted their books over the past two years…", "score": 5, "replies": []}, {"body": "!remindme 3 months", "score": 7, "replies": [{"body": "Dude if stuff goes heavy bull market in three months I will send you the nicest message ever, lol. Shit hit the fan at the absolute worst possible time for me, so I hope I’m wrong.", "score": 2, "replies": [{"body": "Lol can i send u a nice message", "score": 1, "replies": [{"body": "I could certainly use it right now, lol. Just had to liquidate a large number of assets at half the value they were 4 months ago. Granted they were still up 200% from when I bought them, but that was several years ago.", "score": 1, "replies": []}]}]}, {"body": "I will be messaging you in 3 months on [**2022-10-18 02:32:18 UTC**](http://www.wolframalpha.com/input/?i=2022-10-18%2002:32:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/w1koet/bull_case_vs_bear_case/iglfniy/?context=3)\n\n[**5 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fw1koet%2Fbull_case_vs_bear_case%2Figlfniy%2F%5D%0A%0ARemindMe%21%202022-10-18%2002%3A32%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20w1koet)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": [{"body": "Well that didn't age well....", "score": 3, "replies": [{"body": "no sir it did not lol", "score": 2, "replies": []}]}]}, {"body": "RemindMe! 6 months", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Jobs are lagging, but the total amount of job openings is really bizarre. A ton of people left the work force or retired since the pandemic. \n\nhttps://tradingeconomics.com/united-states/job-offers\n\nLook at like the the year chart. Way more job openings than even before the pandemic. \n\nThe unemployment rate is back to the same level as well. \n\nhttps://tradingeconomics.com/united-states/unemployment-rate", "score": 9, "replies": [{"body": "that's because demand is still high. ppl are spending a lot more for many reasons i) pented up demand from lockdowns, ii) a lot more cash in pocket due to stimmy, iii) feeling richer due to property market, iv) one last hurrah this summer before hunkering down \n\n&#x200B;\n\nMy guess is demand and jobs by extension will precipitously once summer ends.", "score": 1, "replies": [{"body": "It’s just weird to say the least. I agree with all your points, but my guess is that consumers are actually cutting back because of inflation, especially high gas. That’s why we are seeing less growth, but I’m in the camp of when inflation peaks and things normalize in the next year, we’ll be in solid shape. \n\nEven if we cut 4 million jobs, that would put us back in the same shape as 2019.", "score": 2, "replies": []}]}]}]}, {"body": "Look at the type of jobs that are actually added, it’s important nuance. Also people get second and third jobs!", "score": 2, "replies": [{"body": "I’m sure you are right, lol. I’m in my 30’s and must be getting too old to see the big picture. Let me find my reading glasses.", "score": 2, "replies": []}]}]}, {"body": "Lol you might want to redo your bull cases. The first two points are just technical, while your last point is non-sense - a slowdown in growth for 2 quarters is a recession.", "score": 2, "replies": []}, {"body": "There is a complete break down with details on the sub\nUltimatetraders\nCan't put links here, but it's extensive", "score": 2, "replies": []}, {"body": "Why did it become the smart thing to say there’s no recession? I feel like the smart people always crowd into certain opinions but never explained why. I thought the Atlanta fed did a preliminary analysis that we’re in a recession now, and that their predictions are always great. I don’t see what’s wrong with just admitting it. I feel like people think going against the mainstream news is now being a conspiracy theorist, because that word lost its meaning", "score": 3, "replies": [{"body": "Yes we are very likely in a recession, q1 gdp contracted 1.6% and q2 was very likely a contraction as well. We'll know for sure if we're in a recession August 25 when q2 gdp numbers are released", "score": 6, "replies": []}, {"body": "People’s savings and investments are getting wrecked and they don’t want to believe it. Mine are too, fwiw. Just for many people, this is the first time they’ve had that many zeros in the bank, and all they’ve seen (outside of crypto) since then has been a crazy SPX, so they are discounting history as something that won’t repeat because it won’t look good for them. I’m probably the same generation they are and I get it. I’m just less hopeful as I might have just been a few years older when the tech bubble burst and saw how it affected the friends of my parents.", "score": 3, "replies": [{"body": "This, to me, is the answer. People *want* this to be over, and for easier times ahead. But reality does not care about your feelings. Ignoring all the signs won’t make this go away.", "score": 1, "replies": []}]}, {"body": "People laughed at Burry last year when he talked about a recession looming.", "score": 1, "replies": []}]}, {"body": "We are going through jobful downturn. So you can remove that from bull case. This situation is like anything else we have seen. So overall bearish.", "score": 2, "replies": [{"body": "Unemployment rate was about the same as it was before the pandemic \n\nhttps://tradingeconomics.com/united-states/unemployment-rate\n\nHowever we have way more job openings than before the pandemic \n\nhttps://tradingeconomics.com/united-states/job-offers\n\nEven with job cuts, we would have to cut an insane amount. A lot of people left the workforce or retired since the pandemic.", "score": 5, "replies": [{"body": "Nothing disappears faster than a job posting in a downturn.", "score": 1, "replies": []}]}]}, {"body": "Inflation is caused by supply side problems so higher interest rates won't work .", "score": 2, "replies": [{"body": "Higher interest rates will still work. It’s just they need to be that much higher to have an effect.", "score": 6, "replies": []}, {"body": "inflation is caused by monetary supply. it is, in the short term, exacerbated by supply-side issues.", "score": 3, "replies": [{"body": "Monetary supply hasn’t changed since GWB, though? What version of QE were we on until it just stoped recently?", "score": 1, "replies": [{"body": "It takes a long, long time for the wave of a trillion dollars to stabilize.", "score": 1, "replies": [{"body": "Out of curiosity where does the 1 Trillion dollar mark come from and from what time period start to finish? I’m not trying to trap you on anything, I just want to understand where the wave you describe starts and ends as far as push into the money supply.\n\nI think the money supply argument is pretty weak for a ton of reasons but I just want to make sure we are talking apples to apples and not apples to a giant man eating horses.", "score": 1, "replies": [{"body": "jerome powell 'printed' over 3 trillion dollars during the pandemic. they were printing money even as inflation hit 7%.", "score": 1, "replies": []}, {"body": "Go read economic theory. Specifically Milton Friedman. He has been spot on when it comes to inflation. For prices to inflate, there has to be money available.\n\nIn the short term, supply limitations can drive up prices, but without the money supply to support those prices, demand/supply with stabilize and prices will lower again. When you have excess money, prices will continue to increase.", "score": 1, "replies": [{"body": "Dude don’t quote Econ 101 to me. I’m actually in the industry, not a first year business major.\n\nThe issue you are ignoring is that the USD is the reserve currency of the world. That’s why QE hasn’t caused inflation. \n\nThe US has had the ability to increase their money supply without inflationary effects in a way not other nation could do in recent times.\n\nInflation is occurring because there are not enough products to meet demand. And that’s at all level of production.\n\nIf companies can’t get enough nails to build their product, they will pay more for them if they have to. If people can’t get enough lumber to complete their renovation, they will pay more.\n\nWe are in an extremely low supply environment that has been also been wrecked by an overwhelmed worldwide shipping system.\n\nIt’s more complicated than that, but this isn’t a “too much money in the system” problem.", "score": 1, "replies": [{"body": "Your question in the way you phrased it made me think otherwise.\n\nI agree that the reserve status has preserved the strength of the dollar on an global economic scale, but that does not say much on how the domestic economy fairs when there is that much free money in circulation. QE has been in effect for a long time through low interest rates, but COVID money printing was a different beast.\n\nRegardless of the reserve status, more money seeking a fixed or decreasing number of goods drives up prices. As long as there is excess money, prices will continue to increase. What we are seeing now is that excess money circulating through the economy - wages are still increasing. Wages increasing will continue to drive up prices. Leading inflation indicators are still growing (e.g., PPI).", "score": 1, "replies": [{"body": "I’m assuming if we went at this hard, we could circle around it all day.\n\nI will also admit that this is not my exact area of expertise and the reason I asked for the number was because I wanted to compare it to prior quarters and other indicators.\n\nThat said, there are so many things happening here that point to supply side problems. I’m just going to touch on one here because I don’t have all night.\n\nWages are going up because a ton of people left or lost their jobs during COVID and many of them decided going back to work wasn’t worth it for any number of reasons. Or they have better offers. \n\nOne example is a lot plans were put on hold and all the sudden there’s a huge demand for construction projects. Now contractors are hard to find and charge more. They start hiring workers at much higher rates than they would get at the 7-11 and now 7-11 starts complaining that no one wants to work for them. This is a nationwide thing but if you visit my parent’s community it’s very visible and absolutely insane. \n\nThen what about airlines? Have you flown recently? If you have I bet it wasn’t the smoothest experience. \n\nI had a major health issue that I needed to speak with a rep on American with before a flight and for three days both the flight every time I called their CS line or went to their chat support, the message was the same: We are experiencing unexpected call volumes. Your wait will be at least 16 hours. Please try again later. Phone would disconnect or the chat window would close. Three straight days.\n\nAmerican took the opportunity to offer early retirement packages to a lot of employees across the company during COVID. Note that American is a union company. So if things get a bit crazy they can’t just ask people to work longer. They are required to stop. That’s pilots, cabin crew, as well as ground crew. So what happens when you just gave early retirement to a ton of your ground crew and you schedule a bunch of flights when demand picks up when COVID slows down? You have to rush to fill those positions from a very limited quantity of applications otherwise you are going to find yourself with planes on the runway that you can’t move and then have to cancel a shit ton of flights. You can probably figure out what happened with American. \n\nPersonally, did I made my flight and everything turned out okay, but it was still stupid fucking stressful. \n\nSo these are just two very specific supply side issues that are having very very real impacts on not only wages, but also have other downstream effects. And these are closer to the norm than they are the rare.\n\nI don’t want to write for an hour but just on labor supply alone the pressures are enormous. And this doesn’t include things like sourcing inputs for your products which every other company is competing with, being able to actually get those inputs shipped to you or being able to ship your completed products, or trying to ramp up your production to more than it was per-COVID to meet pent up demand.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Consumer spending is sustained by depleting savings and draining credit.\nAn ongoing war, with China and Russia openly saying US reign is over.", "score": 0, "replies": []}, {"body": "Bull Case - Nancy Pelosi is front running the CHIPS bill with NVIDIA stake.", "score": 1, "replies": []}, {"body": "Bull Cases you missed:\n\n- Talks between Russia, Turkey, Ukraine and the UN to allow Ukrainian food exports to the Middle East and Africa are advancing. This would cause food priced to fall overnight.\n\n- Despite everyone focusing on CPI inflation, the fed cares more about core PCE inflation, that peaked months ago and is expected to decline this month.\n\n-Banks’ Q2 earnings report were not as bad as you would expect (Citi best earnings). Chip-making companies beat earnings expectations as well. This quarter’s earnings report may be better than we originally thought.", "score": -1, "replies": [{"body": "Fed cares more about inflation and sentiment surveys than CPI", "score": 1, "replies": []}]}, {"body": "We'll be flat for a decent few years. And that's not necessarily a bad thing.", "score": 0, "replies": []}, {"body": "Bull Case - EVs, Metaverse, Robotics and AI blow up!! \n\nLessssgooo!! Cha Ching!! $$$", "score": 0, "replies": []}, {"body": "Let me answer each case. \n\nBull case \n1. Good enough damage? Not even at recession level yet.. \n2. Peak lol? I guess u only goes back to 20yrs ago. Try go back 50yrs ago chart or longer lol. \n3. Lol u seem many company doing lay off., & slow down \n4. Strong? Lol it look healthy because of stimulus. Have u listen to target earning. I’m sure company have many stuff in warehouse . Bloody Christmas huge discount on many stuff, \n\n5. You basically answer it. Obvious it take time to hit recession level. Atlesst this should started slow down then recession .", "score": 0, "replies": []}, {"body": "The bottom was in the moment Apple went sub $130.", "score": -8, "replies": []}, {"body": "Cramer is the best indicator in the history of Capitalism. Every optimism u SELL. Every pessimism you BUY!", "score": 1, "replies": []}, {"body": "Sure, I do think all these are good pointers and another bull or bear case is that the market doesn’t give a shit about fundamentals. It’s not like it’s previously bottomed frequently because of fundamentals.", "score": 1, "replies": []}, {"body": "I was looking the other day at historic insider buys vs sells. At every bigger dip there are huge spikes. This time it's pretty much at all time lows, which is very very odd. Oil is also growing again, which is not a good sign.", "score": 1, "replies": []}, {"body": "Housing...\n\nIt such a large part of the overall economy that any slowdown trickle through other parts of the financial system. The average cost of a home is up 700 per month... It's going to have an impact of it continues to slow down.", "score": 1, "replies": []}, {"body": "Why your bull case sound like bear case? And bear case sound neutral lol", "score": 1, "replies": []}]}
