{"title": "I Read The News So You Don't Have To - Market News (January 24, 2019)", "selftext": "## UNITED STATES\n\n* **Futures** are flat this morning \n* US oil inventories shot up last week to 6.550M up from -0.560M last week\n* Senators vote today on bills from both parties to end the **government** **shutdown**\n   * The *Democrats* bill would reopen all agencies at previous spending levels for 15 days\n   * The *Republican* bill adds a three-year extension of protections for undocumented immigrants who arrived as children, sharply restricts America’s asylum program, and allocates $5.7bn for a wall\n* The Trump administration’s top economist said the U.S. economy may not grow in the first quarter if the government shutdown continues\n\n## OTHER\n\n* **Ford** took a hit to profits in Q4 with an $828m loss on sales outside North America \n* **Canadian** **manufacturing** is slowing (Actual -1.4% | Expected -0.9%)\n* **Japanese** **manufacturing** has slowed and is hovering on the line of contraction \n   * *Production*, *new* orders, and the *backlog* *of* *work* are all in contraction territory\n* Today **Venezuela** experiences its first day with **two presidents** \n   * *Nicolas Maduro* controls won a rigged election last year and has ruined the country but he controls the army\n   * *Juan Guaidó* was selected as head of the national assembly earlier in January and has declared himself acting president. The United States, Canada, and all major South American economies have recognized him as the legitimate president\n\n## CHINA\n\n* **Disposable** **income** growth is slowing -- a threat to retail sales \n* **Credit** **expansion** is slowing \n* **Microsoft** confirmed that Bing has been blocked in China", "id": "ajbxn4", "created_utc": 1548332856.0, "score": 401, "upvote_ratio": 0.96, "num_comments": 32, "comments": [{"body": "Thank you for doing this. ", "score": 65, "replies": []}, {"body": "> Microsoft confirmed that Bing has been blocked in China\n\n\nDirectly affects more than 1,000 people.", "score": 67, "replies": [{"body": "How will they search for google now?", "score": 25, "replies": [{"body": "How can I get it blocked where I live?\n\n&#x200B;", "score": 19, "replies": [{"body": "I wouldn't worry; MS recently announce that they are bailing on Win Mobile. Bing is next...", "score": 2, "replies": []}]}, {"body": "Duckduckgo.", "score": 1, "replies": []}]}, {"body": "But they get pissed if they don't get their way in NA. How is this fair? ", "score": 3, "replies": []}]}, {"body": "And we’re back...", "score": 12, "replies": []}, {"body": "Welcome back! Was wondering what happened with the news the past few days...", "score": 7, "replies": []}, {"body": "Glad you're back, was about to send a search party after you!", "score": 7, "replies": [{"body": "Hahaha I've been moving the last few days and just didn't have the time or the set up to post but we baack", "score": 10, "replies": [{"body": "Yeah I had to read the news by myself. You do great work...", "score": 1, "replies": []}]}]}, {"body": "Not all heroe's wear capes ", "score": 6, "replies": [{"body": "Who says OP doesn’t wear a cape?", "score": 1, "replies": [{"body": "touche", "score": 1, "replies": []}]}]}, {"body": "Thanks for doing this very much appreciated!", "score": 4, "replies": []}, {"body": "Thanks for the news!", "score": 3, "replies": []}, {"body": "What is going on with the biggest strike in North America's history in Mexico right now? Is it just conspiracy that 40 to 70 thousand people are on strike?", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "https://www.wsws.org/en/articles/2019/01/18/paro-j18.html\n\nhttps://www.reddit.com/r/ChapoTrapHouse/duplicates/ahd0tf/matamoros_mexico_strike_of_over_70000_workers/\n", "score": 1, "replies": []}]}]}, {"body": "What is wrong with the world these days. ", "score": 2, "replies": []}, {"body": "Love these", "score": 1, "replies": []}, {"body": "God bless you my brother", "score": 1, "replies": []}, {"body": "Yay!", "score": 1, "replies": []}, {"body": "Hilariously, the new tax bill that was introduced ***relies heavily*** upon the growing of the American economy.", "score": 1, "replies": [{"body": "Can you elaborate?", "score": 1, "replies": [{"body": "The new tax law takes in less money, as long as the American economy stays at or less than ~3% growth in comparison to the previous tax structure. Its intention to promote growth while allowing the average worker to, in the short term, take home more money.\n\nGiven that our economy is not trending to hit said benchmark, the tax law is going to have to be redesigned unless the budget is trimmed down, which as we know doesn’t look like it’s happening. ", "score": 2, "replies": []}]}]}, {"body": "\"Wilbur Ross: miles and miles from a trade deal\"\n\nOhhhhh... Didnt the presidential Just say we were very close and great progress was being made... so uh, that was bullshit then, eh? Duh. ", "score": 0, "replies": []}, {"body": "Lmao bing still exists??", "score": 1, "replies": []}, {"body": "Thanks for this, very much looking forward to reading these blurbs whenever you post :)", "score": 1, "replies": []}, {"body": "I'd go for a 15 day extension in spending with government open so that all those employees could get paid.\n\nAfter all, if the Democrats do not agree to wall spending we will shutdown again after 2 weeks.\n\nIt would show great empathy from the Republican side to agree to this and would literally cost them nothing politically in doing so.\n\nEither way the Democrats give in to wall spending or face this bullshit for 2 years at the very least.", "score": 1, "replies": []}]}
