{"title": "First year of investing!", "selftext": "So it's officially been my first year of trading on the stock market. I started off with $1000 and I got about a 17% return over the year with my shares in Microsoft, Main Street Capital, Ford (sold when it peaked), and AMD (recently bought the dip after I heard the CEO cleared the rumors of her leaving). It's been a fun experience and I really would recommend it for those looking into investing", "id": "cnxu8n", "created_utc": 1565328139.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "Anyone explain the number on the side of the ticker symbol", "score": 2, "replies": []}, {"body": "Can I ask how long it took you (in research time) from deciding to get into this- to actually putting some money down and getting involved?\n\nIe did you ready up / educate yourself for a few months before depositing some funds?\n\nMany thanks", "score": 1, "replies": [{"body": "Yeah I took a few online courses on the topic, studied trends in the market and before I made my initial picks, I was researching many of the top stocks people were buying", "score": 2, "replies": [{"body": "Can you recommend any of the courses?\n\nThanks", "score": 1, "replies": []}]}]}, {"body": "17% is great for going long, but if you're going in with such little money you may as well play 3X ETFs with the same value you came make about $50 in 15mins. 1 years time is enough to understand the inverse. Play your cards right, that $1000 becomes $20k. Why play long with $1k? Makes no sense.", "score": -3, "replies": [{"body": "Can you further explain 3x ETF's? I haven't really looked into ETF's as of now", "score": 2, "replies": [{"body": "Best investing strategy Is long term investing. I don’t like what I think this guy is saying", "score": 4, "replies": [{"body": "With $1000 I'd rather attempt to make more then put it into LT. No way would I go long with 1k", "score": 2, "replies": []}, {"body": "Yeah I looked into it and it's just quick, yet unsustainable gains and I'm no gambler", "score": 1, "replies": [{"body": "Yeah it's day and swing trading. If you take the time to learn charts, basic math and historical data it's definitely worth putting your money into 3x ETFs. Place a tight stop loss on your first few trades. If you continue to put your money into blue chips sure you'll see some growth, but nowhere near 17% annually.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Recent Investments", "selftext": "Thoughts on the below securities:\n\n- PINS\n- CRM\n- SONOS\n- BOX\n- SQ\n\nThanks.", "id": "cnvh3k", "created_utc": 1565315043.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 10, "comments": [{"body": "crm and sq are good pick, I have both in my portfolio.", "score": 3, "replies": []}, {"body": " PINS is volatile between 25-35... But it's new. Who knows where it'll be in a year?", "score": 1, "replies": [{"body": "If I’d have to guess... between 45-50.", "score": -2, "replies": [{"body": "Based on?", "score": 1, "replies": [{"body": "“guess”", "score": 4, "replies": []}]}]}]}, {"body": "I prefer Shopify to Square. Can’t figure out Square for some reason, I just don’t get it.", "score": 1, "replies": [{"body": "Isn’t Shopify at an all time high while Square is at an all time low?", "score": 0, "replies": [{"body": "I believe Shopify had a really good quarter and raised guidance. Highs or lows are only good or bad depending on what the company is doing.\n\nI might dig more into Square but I dunno.", "score": 2, "replies": []}, {"body": "SQ is \"down\", but it was even lower in May. And its 52-week low is just under $50. It's been pretty volatile. You are correct about Shopify though. I might buy it if it hit a major dip, but not at this price. I've been tracking SQ, but I go back and forth and haven't yet invested.", "score": 2, "replies": []}, {"body": "I bought SQ in the 20s, above the all time low, and it’s nowhere near there.", "score": 1, "replies": []}]}]}]}
{"title": "BA Stock", "selftext": "sHoUlD i BuY bOeInG?¿\n\nBut seriously...\n\nYa know, I was thinking. Why isn't Boeing more atrractive than it is? It's a company that is basically backed by the United States government. It's waaay off it's 52wk highs. It's too big to fail. So, why don't I see more people looking at it as a good deal? Or, is it a good deal?\n\nSo someone please tell me why I'm wrong.\n\nThanks ~~dad~~ Reddit!\n\n\nDisclaimer: I'm 19 so I have the Stupid Question Pass.\n\nEdit: I forgot to mention the Max.. It's not a question of if it will ever fly again, but rather how many order delays or lost orders Boeing will experience, right? Is that why it's not attractive because of lost revenue?", "id": "cnxtx9", "created_utc": 1565328080.0, "score": 4, "upvote_ratio": 0.59, "num_comments": 20, "comments": [{"body": "I like Boeing, holding since $200, but sold above $400 (lucky to decide selling!). waiting until dust settles, esp for 737 max fix...potentially they loose lot of order booking...", "score": 12, "replies": [{"body": "Held since 2012 at $85. Should I just hold at this point? (For context I bought this in a bunch of stocks in middle school that I’ve never sold)", "score": 4, "replies": [{"body": "Here's my take, who else is selling airplanes? Theres a tiny handful of other companies, mainly just airbus. They'll be fine long...even if they dont deserve to be.", "score": 3, "replies": []}]}]}, {"body": "I feel like long term it's a good buy but I feel like currently the projected revenue from its massive backlog of orders is still represented in the stock price. Once we start to see how many of those orders have to be discounted or cancelled and how that effects profit margins and potentially Boeing's future growth, that's when I'll look at getting back in. But then again maybe I'm just a little bitch that doesn't have the balls to make some cash before the dip. Jury's out.", "score": 6, "replies": []}, {"body": "Too big to fail? Maybe, but that doesn't mean their market cap or share price cannot go down significantly. Look at Citi bank \"C\" back in 2006. They were also too big to fail and today have an adjusted share price of 1/8 of their peak. Too big to fail does not mean it's a good investment.\n\nCheers", "score": 5, "replies": [{"body": "Excellent example!", "score": 1, "replies": []}]}, {"body": ">I'm 19\n\nIs BA a solid investment? Yes.  Is it the best investment for a 19 yr old?  Probably not.  Dump everything you can into SPY and QQQ and forget about it.  Focus on your studies or career.", "score": 6, "replies": []}, {"body": "Looks like an financial engineering company instead of an actual engineering company.", "score": 7, "replies": []}, {"body": "If you're 100% convinced about buying Boeing, buy it. \n\nIf you're not, buy ITA. It's 20% Boeing and 80% other defense and aerospace stocks. I started a position after the Boeing scandal, and I'm up 9% on it even though Boeing is lower than it was after the scandal.", "score": 2, "replies": []}, {"body": "For anyone considering BA long, take a look where they were in June 2016 and what they’ve done to justify a 150% return since then.", "score": 2, "replies": [{"body": "say more", "score": 1, "replies": [{"body": "With the MAX fuckup, how do you justify beating the S&P by about 100% over past 3 years?", "score": 1, "replies": [{"body": "Take away the MAX trouble, it’s the backlog of 870 planes and $130,000,000,000 that justifies that.", "score": 2, "replies": [{"body": "How can we just take away the MAX trouble?  We don’t know if/when production will resume, we don’t know what they’ll have to do with planes on the ground.  They took some shortcuts on MAX to fit a larger plane onto the same frame, thus the software change that has killed people.  It has been months and no imminent fix has been reported - we can’t rule out that the possibility they’re forced to scrap it as small as it may be.\n\nThey have reputational damage on top of it and will probably have to spend more money going forward since they’ve (hopefully) learned cheap programmers are bad business.\n\nIt’s an engineering company whose decisions are made by financial engineers.  Hard pass.", "score": 1, "replies": []}]}]}]}]}, {"body": "Not sure how all of this work and if it’s possible but my fear is that airlines with 737 Max might decide to sue Boeing because they could not use the planes they bought for a long period of time. If this can happen, even if they resolve the 737 Max issues quickly they won’t be out of the woods for a while. If you guys know that this is not possible because of how the buying contracts of planes are done please let me know!", "score": 1, "replies": []}, {"body": "If the 737 isn't back up in two months Boeing will finally start to actually hurt. Ramping down production, all that. I'd wait and see for now.", "score": 1, "replies": []}, {"body": "Note buying it while the planes aren't on the air yet.", "score": 1, "replies": []}, {"body": "If you can hold for 3-5 years it's a good buy. If your timeframe is shorter than that there are prob better picks.\nI'm holding some BA for the long term", "score": 1, "replies": []}, {"body": "It’s risky. Never buy a company in trouble (and a falling stock) until you’re certain the problems are gone. And it was quite highly valued beforehand so you’re also assuming market will move up. \n\nAre you looking at trading or investing?", "score": 1, "replies": []}, {"body": "Bought some on Tuesday and am already making money.", "score": -7, "replies": []}]}
{"title": "Stocks with most to lose and gain from the outcome of the trade war?", "selftext": "Let’s assume that the trade war gets far worse over the next four months, but then rapidly improves next year. Which stocks will sink the most during the downturn then rebound the highest during the upswing? Apple, semi conductors, agricultural companies, finance sector? Let me know. I would be greatly appreciative", "id": "co8mld", "created_utc": 1565385173.0, "score": 5, "upvote_ratio": 0.79, "num_comments": 11, "comments": [{"body": "A reminder to everyone, please focus on how this is going to affect a specific stock or the stock market in general.\n\nIf your comment is pushing political agendas, memes, insults, trolling, etc then your comment is going to get removed and/or get you banned.\n\nIf you *have* to discuss just the politics, then post this topic to r/PoliticalDiscussion without linking back to r/stocks, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Is this assuming that the US avoids a recession, is in a long one, or is coming out of one early next year?", "score": 2, "replies": [{"body": "This assumes that a cooldown in the trade war will postpone it", "score": 2, "replies": [{"body": "QD, BABA, BIDU, Banks (Citi / C is trading below book value), constituent components of XLF and XLE.", "score": 0, "replies": [{"body": "I should’ve said but I am afraid to touch Chinese stocks", "score": 2, "replies": []}]}]}]}, {"body": "The entire market in general should do fairly well if a deal is reached and assuming the economy remains in decent shape. Chinese stocks in particular should see some solid returns if a deal is legitimately reached. They’ve been beaten down pretty bad since everything started up. Materials and infrastructure should also fare pretty well. If you’re willing to accept the volatility and risk that comes with owning them, Chinese stocks could be a great pick if you’re confident in a deal being reached. If you want something a little more safer and less volatile then I’d go materials as a lot of things like metals, chemicals, paints, parts, etc. are made or come from China.\n\nNow if things get worse and further tariffs are implemented then likely everything will take a hit. We’ve seen this happen a few times already and there doesn’t really appear to be a sector that’s isolated from the pain of such news. Even sectors or companies that remain relatively unfazed from the tariffs seem to suffer like everyone else.", "score": 2, "replies": [{"body": "I won’t touch Chinese stocks for all of king Midas gold. Fucking death trap", "score": 3, "replies": [{"body": "Foolish. Short term, yes, I agree. But China isn't going to die from this. If you have a 5-10 yr horizon, there's tremendous value at these levels. Be greedy when others are fearful, and fearful when others are greedy!", "score": 2, "replies": []}, {"body": "Depends how you look at it I guess. I agree I wouldn’t want to hold most of them long term but there’s absolutely money to be made day trading them or holding them short term due to their volatility and historic performance. Long term, I won’t touch 99% of them due to concerns over the legitimacy of their financials, the way they’re held by US investors, and the way China’s market and government is set up.\n\nI saw some awesome returns with JD and Alibaba playing off some news. Returns that are hard to see with most of the larger US companies in such a short period of time. Also got burned badly with IQ when I jumped in after a decent drop a few weeks following their big run up in the summer of 2018. I thought it would recover relatively fast but the trade war talks started really intensifying and it was all downhill from there for that one. Nature of the game but if someone plays and gets it right with the trade war/tariffs then they could make out like a bandit.", "score": 0, "replies": []}]}]}, {"body": "Move your savings into Chinese autos. Just a tip.", "score": 1, "replies": []}, {"body": "Steel will get hard right in the balls if it ends with no tariffs in place.", "score": 1, "replies": []}]}
{"title": "Too Late for $AMD Gain Porn?", "selftext": "Hope it’s not too late to post some $AMD gains porn. I went balls deep into Su bae and it was amazing. Much better than getting fucked in the ass by tariff man. \n\nNow to gamble it all away so that I don’t have to pay the tax man. \n\n[Su bae rocks my world](https://imgur.com/gallery/0I1aE3l)", "id": "cnuzqc", "created_utc": 1565312511.0, "score": 35, "upvote_ratio": 0.86, "num_comments": 18, "comments": [{"body": "You should thank Tariff man. I sure as hell did. He gave anyone that knew what was coming with Rome basically the single greatest dip possible at exactly the right time. I mean, you couldn't ask for better timing if you're 100% AMD like me.\n\nI stayed out this last ER for basically the first time in 3yrs and wasn't willing to load calls with it over $30. The tweet from hell was a fucking godsend as far as I'm concerned. My only regret is not going in completely recklessly like usual.\n\nLMAO at tax man comment. 2yrs ago I thought I had done really well because I apparently only remember the wins and figured I pocketed like 10k until I did my taxes and realized I actually lost $1k.", "score": 31, "replies": [{"body": "I was a dumb ass and played earnings...and obviously didn’t fair too well from it.  I basically loaded up on FDs based on the launch and the rumor that Google was interested. Glad that worked out. \n\nBut yeah, I guess tariff man did help me out, since everything got dirt cheap this week. Multiple days of ending up in the red was not pleasant, though.", "score": 3, "replies": [{"body": "My account has swung 10k over the last month. If you keep riding this AMD train you better get used to weathering losses for weeks at a time. It's going to be a roller coaster for a while longer.", "score": 2, "replies": []}]}, {"body": "Don’t forget to thank China for bending the knee and pegging the rmb to usd at ~7:1. We might just get a deal in September if China’s gonna keep on having weak ass knees like that.", "score": 4, "replies": [{"body": "7:1 was not bending the knee.", "score": 2, "replies": []}, {"body": "You're either far more optimistic or knowledgeable on the situation than I to expect a deal that soon. \n\nI'm team MAGA but I can totally see Trump stretching this thing out and using it as an election tool. The man, or any other President for that matter, could be doing great things for the country, but if the economy is in the gutter during their re-election the masses won't give a fuck and pull the lever.", "score": 0, "replies": []}]}, {"body": "How much did you make? I literally had no money to move around on Monday and Tuesday, and was afraid of asking family for a bet and didn’t want to deposit funds that weren’t there.", "score": 2, "replies": [{"body": "Cleared just over 8k in options profit. Turned around and put a quarter of that into 34-35p for 8/16 today.", "score": 2, "replies": []}]}]}, {"body": "bought calls last night on rh and it didn’t execute all day today im bigly mad", "score": 8, "replies": [{"body": "If \"last night\" was after market close, I have some news for ya", "score": 20, "replies": [{"body": "Every day, neigh, every hour or two I'm surprised once again with the ignorance I see on WSB. Can spez please quarantine this sub so it stays the fuck off /all? \n\nIt's hilarious at times but now it's getting sad.", "score": 12, "replies": [{"body": "*but bro I placed the trade at midnight and it said queued!!! Why didn't I wake up rich!!!!*", "score": 7, "replies": []}, {"body": "Mods can opt out if r/all if they want.", "score": 5, "replies": [{"body": "Well shit, TIL. \n\nSo what you're saying is they're intentionally destroying the sub? I mean I guess I really can't bitch, it's only appropriate on a sub famous for burning things to the ground.", "score": 4, "replies": []}]}]}]}]}, {"body": "Here’s where my AMD porn would go if my AMD calls went through before pre-market cucked me. I didn’t anticipate an almost $3 jump before market open.", "score": 3, "replies": []}, {"body": "I got some $44 9/20 calls I'm hoping AMD shoots up another 12 bucks like last year and make some $$$", "score": 2, "replies": [{"body": "Blessings be upon you and my itm calls", "score": 4, "replies": [{"body": "I sold my calls and made 200 bucks, then bought 30 .03 60 dollar calls that expire 10/18. Gonna sell them when the stock price hits 40-45 inna few weeks", "score": 1, "replies": []}]}]}]}
{"title": "HPE is fucking worthless", "selftext": "Alright peoples, since everyone is looking downwards, here's a company that is absolutely going to get CRUSHED. \n\n\\-First, HPE essentially sells servers, with a good part of its revenue coming from it. With the trade war, components are becoming more expensive. But, they have to deal with all other competitors both Chinese (Lenovo, Huawei, ZTE) and American (Cisco, IBM, etc). Additionally, the refresh cycle for servers themselves have changed. Clients are either not buying them as frequently, or moving completely towards the cloud (AMZN, MSFT Azure, etc). So essentially market forces are biting HPE's sausage from three ends. \n\n\\-Second, HPE is pursuing a refresh in its strategy that is very risky. They are spending on trying to diversify (Aruba networking and Cray supercomputing), which unfortunately costs a boatload of money. They've been trying to buy other companies too when valuation has been incredibly high, especially in tech. How are they funding it? Debt. Due to the market forces above of refresh cycles slowing down and people going towards shared resources/cloud, the revenue gain from these new companies will still be very slow. \n\n\\-Second-and-a-half. HPE recently introduced their new Greenlake strategy which is essentially leasing their equipment to you as a subscription. Leasing is nothing new, but in the tech world, companies either pay and completely own, or they use a cloud service. If you want to own, you would own (something cheaper, like from IBM) and maintain everything in-house. If you want hands off, you would go into the cloud. This strategy is the worst of both parts - having to maintain something you don't really own, and still have the risk of things going offline and having almost no support. \n\n\\-Third, HPE is essentially leveraged to the hilt already. No one wants to buy HPE stock and they can't really issue more without severely diluting, which is the reason why its capital infusion strategy in the past years has been debt driven, pumped by the cheap interest rates. \n\nSo, revenue is dropping from the cycle change. Costs are increasing due to its expansion strategy. Money will become harder and harder to get. The only thing they do have are patents (but fuck it, China can just copy them). Instead of shorting TSLA or whatever popular stock, take a look at this shitty company that used to be a part of another shitty company which made shitty printers.", "id": "cnvzpv", "created_utc": 1565317716.0, "score": 9, "upvote_ratio": 0.85, "num_comments": 13, "comments": [{"body": "Quality DD. Buying calls.", "score": 9, "replies": []}, {"body": "You convinced me to go long. Buying calls", "score": 16, "replies": []}, {"body": "Your analysis is ok except the part where you say money is becoming harder to get. Lower interest rates actually means money is easier to get, not harder. If this company is as leveraged as you say, they will use this opportunity to roll over their debt. This is a good thing and will make the stock go up.", "score": 4, "replies": [{"body": "Also the part where he is wrong about every aspect of his description of the company and what the industry is doing.", "score": 3, "replies": []}]}, {"body": "- first Lenovo is shit, Dell is shit, supermicro is shit. And the refresh cycles have changed but they are getting shorter not longer. Take the health care industry for example. Staying on the target hardware platform and meeting their performance metric requirements means refreshing  x86 hardware on as little as 18-24 months at times. Normally it gets repurposed but a subscription based hardware agreement could play for those devices. \n\n- second HPE is partnered with Microsoft on the Azure Stack. HCI / hybrid cloud deployments are the future of the datacenter for the next decade at least. \n\n-third nutanix is partnered with HPE on the green lake offering.", "score": 4, "replies": []}, {"body": "How does HP have a decent option chain and a 50+ PE? Wtf.", "score": 3, "replies": [{"body": "My thoughts exactly", "score": 2, "replies": []}]}, {"body": "Your DD is stupid.\nHPE is barely affected by the competitors you mentioned, the only company that troubles HPE is DELL and they have their own list of issues.\nYes, servers business is boring and getting commoditized but their acquisitions have paid off well, for e.g Aruba networks, look at HPE’s recent quarterly report and you will know what I’m talking about.\nNot everyone wants to move to cloud and not everyone can move to cloud, that’s where Greenlake can be useful. \nTheir investments in edge and AI are also very interesting.\nNow with that being said, i agree with you on one thing that the stock sucks and the only way it will go is down.", "score": 3, "replies": []}, {"body": "Calls it is.", "score": 2, "replies": []}, {"body": "Excellent DD, this stonk is an absolute dog. Maybe they can revive this company by rolling out a new Compaq desktop PC that will sell like hotcakes.", "score": 2, "replies": []}, {"body": "Plus they basically bet their entire r&d budget a few years back on the memristor supercomputer.", "score": 1, "replies": []}]}
{"title": "German exports shrank 8% YoY and imports 4.4%", "selftext": "New data from Germany:\n\nGerman newssource because american didn't pick it up until now, probably because they are still sleeping, or I can't find it.\n\nExports in June were 106.1€ billion 8% lower then last year in June and imports were 89.3€ billion in June 4.4% lower then last year.\n\nMost of the export loss was from outside the EU (10.7% lower YoY). Imports from outside the EU shrank 8.9%.\n\nExports inside the EU shrank 6.2% and imports 1.1% YoY.\n\nSource: [https://www.focus.de/finanzen/minus-von-acht-prozent-bundesamt-teilt-mit-deutsche-exporte-im-juni-stark-zurueckgegangen\\_id\\_11013322.html](https://www.focus.de/finanzen/minus-von-acht-prozent-bundesamt-teilt-mit-deutsche-exporte-im-juni-stark-zurueckgegangen_id_11013322.html)\n\nExport loss from Germany to some countries:\n\nUS and France: \\~ -7%\n\nChina: -12.4%\n\nUK: -14.6%\n\nRussia: -12.8%\n\nSwitzerland: -10.7%\n\nNext wednesday germany will anounce its GDP numbers for Q2. If they are negative germany ~~is technically in a recession, because the last Q was already negative.~~ could get into a recession in Q3.", "id": "cnzabd", "created_utc": 1565337924.0, "score": 28, "upvote_ratio": 0.94, "num_comments": 10, "comments": [{"body": "Thanks putting all my money into $DB calls", "score": 16, "replies": [{"body": "genuis!", "score": 4, "replies": []}]}, {"body": "q1 was +0.4% btw.", "score": 4, "replies": [{"body": "yeah you're right. Q3 2018 was negative not Q1 2019.  But who knows if they correct Q1 down afterwards, like they do in almost every recession.", "score": 3, "replies": []}]}, {"body": "Found english news source: [https://www.bloomberg.com/news/articles/2019-08-09/german-exports-slump-most-in-three-years-amid-trade-uncertainty](https://www.bloomberg.com/news/articles/2019-08-09/german-exports-slump-most-in-three-years-amid-trade-uncertainty)", "score": 2, "replies": []}, {"body": "What’re you gunna do, cut rates 😂", "score": 2, "replies": [{"body": "Can you imagine actually buying a 30 year bund with negative interest rate. Investing for a lifetime and being guaranteed to receive less money than you invested.", "score": 5, "replies": [{"body": "You lose interest money for the right to lose inflation money xD", "score": 2, "replies": []}]}]}, {"body": "Brexit deal confirmed.", "score": 2, "replies": []}]}
{"title": "Any suggestions on what to do in this boring bear market ?", "selftext": "", "id": "co5d9m", "created_utc": 1565370764.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Pornhub, xvideos, XNXX, redtube, largeporntube, youporn, xhamster, youjizz, spankbang, tnaflix, tube8, drtuber, spankwire, nuvid, sunporno, ect. Have fun out there brother I'll see you back here sooner than later", "score": 8, "replies": [{"body": "So calls on KY lube?", "score": 1, "replies": []}]}, {"body": "\"Bear market\"", "score": 5, "replies": []}, {"body": "Amd calls baby!!!", "score": 3, "replies": []}, {"body": "SBUX for free bucks.", "score": 3, "replies": [{"body": "Sbux is my shit thank God I discovered that goldmine", "score": 2, "replies": [{"body": "Played earnings and banked, just bought back in today at around $95.50 after cashing out my AMD stuff. (Sold 34c at .93 and it's 2 bucks now, painful...)", "score": 1, "replies": []}]}]}, {"body": "Go outside. Rub one out. Idk", "score": 3, "replies": [{"body": "I can only get hard when I know that I’m losing money", "score": 1, "replies": [{"body": "I feel you on that one", "score": 2, "replies": []}]}]}, {"body": "You’re going to shit your box once you figure out/trade an actual bear market.", "score": 1, "replies": []}, {"body": "BMY long", "score": 1, "replies": []}, {"body": "Buy amd puts!!!! \n\nGuess what happened after a 52 week high!! A dip\n\nRight?", "score": 1, "replies": []}, {"body": "SPY and MSFT calls", "score": 1, "replies": []}]}
{"title": "AMD you beautiful beast! Race to 100...", "selftext": "", "id": "co5p4t", "created_utc": 1565372191.0, "score": 28, "upvote_ratio": 0.94, "num_comments": 19, "comments": [{"body": "I remember i had 500 shares at $8. Shit traded sideways for 2 years, then Trump came", "score": 14, "replies": [{"body": "MAGA ETF", "score": 6, "replies": []}]}, {"body": "I thought my amd puts were dead until saw all the amd calls posts. I’m going to call in for my McLaren in the morning.", "score": 8, "replies": []}, {"body": "I’m like mentally retarded. I bought AMD call a while ago, made some money and sold this morning. It kept going up so I thought “well shit I’ll buy another one”\n\nBought at a 52 week high. Why tf am I so dumb?", "score": 5, "replies": [{"body": "https://m.youtube.com/watch?v=h-Z8_Mzmqgk", "score": 3, "replies": []}]}, {"body": "that average is fucking sexy dude", "score": 6, "replies": [{"body": "That average is more than what I have in my wallet 😱", "score": 2, "replies": []}]}, {"body": "How do you expect to get rich with mostly shares?", "score": 3, "replies": [{"body": "I mean, at least he isn’t betting his entire account like most the people on here", "score": 2, "replies": [{"body": "But like..why not?", "score": 5, "replies": []}]}, {"body": "a novice mistake", "score": 2, "replies": []}]}, {"body": "Something’s wrong here there’s too much diversity...", "score": 3, "replies": []}, {"body": "🚀🌕", "score": 2, "replies": []}, {"body": "Screen was taken before the high, who knows", "score": 2, "replies": []}, {"body": "Please tell me you sold near the high", "score": 2, "replies": [{"body": "Something tells me he didn’t..", "score": 3, "replies": [{"body": "He's waiting for 100.", "score": 2, "replies": []}]}]}]}
{"title": "in a response to BYND vegan patties, sources say Jamaican meat patties are being pumped up into pro-meat bubble.", "selftext": "[removed]", "id": "co8s7x", "created_utc": 1565385909.0, "score": 14, "upvote_ratio": 0.78, "num_comments": 10, "comments": [{"body": "Bumbaclot. Your autismo is criss.", "score": 7, "replies": []}, {"body": "Gentrified neighborhoods in NY are about to be selling vegan Jamaican Beef Patties. Great.", "score": 5, "replies": [{"body": "Bodega patty: $1.50\n\nArtisanal hipster patty : $14.99\n\nIts same product.  I  hate NY\n\nLong golden krust", "score": 7, "replies": [{"body": "Long Bodega\n\nShort 7-Eleven", "score": 1, "replies": []}]}]}, {"body": "Holy shit someone posted on here about a Berkshire Hathaway heavy volume strangle play.... in October I think", "score": 3, "replies": [{"body": "Blame Charlie Munger and his attempt to bang Oprah", "score": 1, "replies": []}]}, {"body": "don't forget those tasty jamaican bonds .32% sounds yummy", "score": 2, "replies": []}, {"body": "What jamaican meat?  Chicken?  Or am I an extreme idiot who's missing a joke here?", "score": 2, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/co1g68/buffett_wants_becky/?utm_source=share&utm_medium=ios_app", "score": 1, "replies": []}]}]}
