{"title": "What are you plays for bank earnings thread 4/12/17", "selftext": "What are you positions in anticipation of the BMO earnings tomorrow? \n\nJPM, WFC, C, PNC and FHN all report BMO tomorrow. ", "id": "64z42h", "created_utc": 1492013388.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 28, "comments": [{"body": "I bought OZRK calls for April 21st, it beat earnings expectations by 0.1 and was down 2%, call tanked like 60% that day. \n\nI've got C calls too, but it all seems priced in at this point unless there's some major upset.", "score": 3, "replies": [{"body": "Yeah this stupid market worrying about Syria and the Norks combined with Congress being, well, Congress has made me hesitant to do anything this week. ", "score": 2, "replies": []}]}, {"body": "Sitting this one out.", "score": 2, "replies": [{"body": "how many positions do you have open through this?  Been closing any up due to it?", "score": 1, "replies": [{"body": "I have AMZN positions and small NFLX position.", "score": 1, "replies": []}]}, {"body": "I feel like I should too. But I'm in LONG on $BAC... so just gotta wait it out. \n\nGot positions in 7 other stocks as well that I'm just holding, not financial ones though.", "score": 1, "replies": []}, {"body": "I opened 10 calls for April 21 today. The premiums were really cheap ($1.03). They're already in the green.\n\n\nIf $JPM goes well consider $GS.", "score": 1, "replies": [{"body": "That's my plan. If Jpm kills earnings, I'm buying GS at open. ", "score": 1, "replies": [{"body": "$GS does move the most :)\n.\n\nBe careful, they report earnings at a much later date. The market will move drastically between now and then.", "score": 1, "replies": [{"body": "That's one of my fears. If something happens during this long weekend, it's going to suck.. They report on the 18th I believe. So it's 2 days of trading before that... Hopefully it can hold its ground! But of course, this all depends on JPM... Are you planning to go in on GS? next week? ", "score": 1, "replies": [{"body": "Depending on specifics of $JPM. I will wait until Monday before opening any positions. ", "score": 1, "replies": [{"body": "Definitely safer play. \n\nAre you going to play BAC at all?", "score": 1, "replies": [{"body": "$GS. I am not a big fan of $BAC.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I like JPM the most out of all those names.\n\nThey have their act together.", "score": 1, "replies": [{"body": "I'm thinking of going in on some calls for JPM and maybe XLF or SPY as well. \n\nWith all their shit I'm staying well away from WFC though. ", "score": 1, "replies": [{"body": "Just be careful with XLF. I got burned buying options on etf's.", "score": 1, "replies": []}]}, {"body": "I have 10 82 puts on them outstanding.  I'll probably double down for next weeks puts if shit rallys tomorrow.", "score": 1, "replies": []}, {"body": "Agreed. Their income from trading will likely be a notable figure.", "score": 1, "replies": []}]}, {"body": "Wait on sidelines, 2 elections before end of april. ", "score": 1, "replies": []}, {"body": "See how AFSI addresses the SEC investigation and NYSDFS investigation. \n\nHolding $10 puts", "score": 1, "replies": []}, {"body": "If JPM beats, I'm looking at bull call spreads on GS. Nervous of large banks like BAC, JPM, C, etc w/ potential for new glass steagall. Even if it's just talk, will likely move the security. Too much variance, imo.", "score": 1, "replies": [{"body": "Wait until closer to $GS earnings. The market may trade sideways in light of new political tensions.", "score": 2, "replies": [{"body": "As with any decision, there's costs/consequences. I considered waiting, and honestly I'm not certain what I'll do yet. That said, GS reports 4/18 premarket, meaning I need to buy tomorrow or Monday. I'm eating 4 days worth of theta if I go tomorrow, but if I buy Monday I'd expect increase from IV, though I'm not sure how much. I'm really not sure which is better. \n\nI'm looking at 5/19/17 C235, theta -.09, so expected to drop 0.36 (-10%) on theta alone...I was going to ask your thoughts on theta vs IV, but I think I convinced myself as I read your post & wrote mine. I have no idea why I'm posting this, must be autistic or something. Thanks!", "score": 1, "replies": [{"body": "Vanilla traders will be all over this.", "score": 2, "replies": []}]}]}]}, {"body": "BAC 04/21/2017 24.00 Calls", "score": 1, "replies": []}, {"body": "All in bac.b", "score": 1, "replies": []}, {"body": "I got 10 calls on $JPM just to stay in the excitement. Only about $1k but they're already in the green.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "651spa", "created_utc": 1492039044.0, "score": 48, "upvote_ratio": 0.94, "num_comments": 20, "comments": [{"body": "fats use android", "score": 22, "replies": [{"body": "Best DD out there.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Can you elaborate?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Neat. Without giving me any details would you recommend Medtronic?", "score": 1, "replies": []}]}, {"body": "He's talking about the people that designed the original insulin pumps.  \n\nEven if Apple does catch up with them, medtronic can do a price gouge or sue the tits off of apple, or both.  ", "score": 1, "replies": []}]}]}, {"body": "Won't save Steve ", "score": 6, "replies": [{"body": "Especially since he had cancer, not diabetes ", "score": 17, "replies": [{"body": "He had pancreatic cancer from too much sugar. raw diets are not a panacea. ", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "me to", "score": 2, "replies": [{"body": "A fasting protocol is a good deterrent towards things like cancer. \n\nhttps://news.usc.edu/103972/fasting-like-diet-turns-the-immune-system-against-cancer/\n\nDiet is the major contributor to the majority of health problems people face. ", "score": 0, "replies": [{"body": "Get out of here Steve Jobs ghost.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "finally a reason to buy an iwatch!", "score": 1, "replies": []}, {"body": "Is Apple betting that we are gonna get fatter?", "score": 1, "replies": []}, {"body": "As a diabetic who owns apple stock, I'd like to see this play out. ", "score": 1, "replies": [{"body": "I want to buy more, but not at these prices", "score": 2, "replies": []}]}, {"body": "I miss cool tech innovation. This is great but I'm not interested in medical devices.", "score": 1, "replies": [{"body": "This isn't just medical devices, this is the #courageous #intersection of tech and medicine. It is #innovative and #disruptive. It is #beautiful. It is #magical. It is not for plebes. ", "score": 16, "replies": [{"body": "It will be #magical when obamacare covers the cost of an iPhone because it is now a medical device. ", "score": 2, "replies": []}]}]}]}
