{"title": "POLL: How much is your portfolio up so far this year?", "selftext": "I'll start. I started investing on RH in mid-December and since then I'm only up 1.29% :/. Lost almost 12% of my portfolio gambling on a penny stock (never doing that again), but I've recovered the last 3 months with a 11.1% gain. I'm hoping to have a similar sort of gain from now until EOY so I can beat the market. (How much is it up this year by the way, I couldn't find a number?).\n\nI've held a number of stocks during my short time. My biggest gainer is WYNN (Wynn Resorts - up 42.48%) followed by MRCY (Mercury Systems - up 39.15%). I also swing trade AMD and after running some numbers, the profits have increased my portfolio by 4.02%.\nMy current largest positions are CRUS and AMD. I owned a pretty decent amount of SHOP but I sold today and will definitely buy back on the dip. I also have a smaller position in GPRO which I am long on along with WYNN, MRCY, and CRUS.\n\nNow lets talk about the negatives... I'm down about 25% on UAA and 18% on UA since I bought in. I love the brand and saw and continue to see it everywhere at the time I invested. They also endorse some of the biggest stars in sports and have a huge untapped international market. I'm long on them as well even though they have a baboon running the company. And finally, the dumbest investment I've ever made - I'd actually call it a failed gamble - is ALT (which was a merger that involved the penny stock I owned: PIP). I don't really want to talk about it, just look at the chart.\n\nLooking forward to hearing how everyone is doing!", "id": "6xb5p0", "created_utc": 1504227061.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 19, "comments": [{"body": "You’re a clown. ", "score": 2, "replies": [{"body": "https://www.youtube.com/watch?v=79QMjxbQ-JQ", "score": 0, "replies": [{"body": ">[**Step Brothers The Clown Has No Penis [0:28]**](http://youtu.be/79QMjxbQ-JQ)\n\n>>I do not own this. Just a funny scene from a great movie\n\n> [*^Cubs4Ev3r12*](https://www.youtube.com/channel/UC7xu8n5BkpyGAoWIxqlUvOg) ^in ^Comedy\n\n>*^115,863 ^views ^since ^Nov ^2011*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)", "score": 2, "replies": []}]}]}, {"body": "> I owned a pretty decent amount of SHOP but I sold today and will definitely buy back on the dip.\n\nYou say this is if it's a guarantee SHOP will dip immediately. What makes you think it won't run up to $130 and then dip back to $115 so your buying back on the dip is at a higher price than you sold at?", "score": 1, "replies": [{"body": "Just my intuition. It went up almost 5% the past two days on no news. Just looking at the [chart](http://www.nasdaq.com/symbol/shop/stock-chart), huge gains in a relatively short period of time have been met with pretty significant dips the following days as well. I think other people are gonna take profits too. I'm hoping for a dip similar to the one after ER and reenter hopefully in the 90s, but I'll probably average down in the low 100s. I should mention that I sold 75% of my portfolio, not all of it. ", "score": 0, "replies": []}]}, {"body": "Curious why you sold SHOP? I bought in at $133. Seems like its got a lot of momentum ", "score": 1, "replies": [{"body": "Check my other comment - let me know what you think too! I'm guessing you meant 103? That's around what I'm hoping to reenter at. ", "score": 1, "replies": [{"body": "Ya I was referring to the price CAD because I use the charts on TD Webroker. I agree with your comment that it will have a dip. But my view is that it'll ride this momentum wave through next week. Thus, I dont think a $5-7 gain is out of the question. Afterwards it will probably dip but the price might still be higher than it is now. I guess time will tell since there hasn't been any news recently", "score": 1, "replies": []}]}]}, {"body": "Is there a link you can direct me to that shows how to figure out how much one makes ytd?  Or do you simple just pull up the YTD page right off you're broker's page?  ", "score": 1, "replies": [{"body": "I built myself an automated tracker in google sheets.", "score": 3, "replies": []}, {"body": "Yup, RH has pretty nifty charts Otherwise it would be a complete pay in the ass to calculate haha. ", "score": 1, "replies": []}]}, {"body": "77.93%", "score": 1, "replies": []}, {"body": "First month, 22 year old, 9% ", "score": 1, "replies": []}, {"body": "20%. Started around May this year.", "score": 1, "replies": []}, {"body": "Stocks purchases this calendar year, ordered by date purchased (oldest to newest).    \n    \n23.00%    \n15.59%    \n63.71%    \n33.27%    \n53.90%    \n32.69%    \n32.88%    \n13.74%     \n3.86%    \n2.95%   \n-0.66%   \n-0.11%   \n0.49%      \n    \nLast 3 buys (bottom) were a couple of days ago. ", "score": -1, "replies": [{"body": "Always been curious as to why some people are so secretive about their portfolio. ", "score": 1, "replies": [{"body": "It may reveal strategies they've been working on or use. The idea is that if it catches on and other people start using it then you have to develop another strat to hold an edge on the market.", "score": 1, "replies": []}, {"body": "Because when you make money someone else lost money.", "score": -1, "replies": [{"body": "Lmao so what? Wouldn't change anything.", "score": 1, "replies": []}]}]}]}]}
{"title": "VIX jump today as people sell off profits for the long weekend?", "selftext": "Asking for a friend who bought a ton of shares at 15.85", "id": "6xe8wp", "created_utc": 1504269569.0, "score": 20, "upvote_ratio": 0.91, "num_comments": 13, "comments": [{"body": "dont trade this if you think thats how vix works", "score": 31, "replies": []}, {"body": "guessing you mean TVIX", "score": 11, "replies": []}, {"body": "Nope. ", "score": 2, "replies": []}, {"body": "Its a long weekend, I've made good money this week and for those reasons I'm out.", "score": 2, "replies": []}, {"body": "Typically before markets close for a holiday, they're up to encourage spending. \n\nThen the true rape starts after they close.", "score": 1, "replies": []}, {"body": "As someone down more than 2% with UVXY, I'm hoping.  Dear God I'm hoping.", "score": 1, "replies": [{"body": "2% on a triple-leveraged ETF is nothing. If that's making you nervous then you need to exit your position immediately lol", "score": 24, "replies": [{"body": "It's only 2x", "score": 2, "replies": [{"body": "you're right, I goofed. my point still stands though", "score": 7, "replies": []}]}]}]}, {"body": "Nah, the market is just green so when my parents ask what I'm doing with all the money they've given me, I can show them a green robinhood profile. Next week the market will put me back in my rightful place as a gainless pleb.", "score": 1, "replies": []}, {"body": "What is vix?", "score": -5, "replies": [{"body": "[duh](http://i.dailymail.co.uk/i/pix/2016/03/11/03/320D432D00000578-3485121-image-a-20_1457667306381.jpg)", "score": 4, "replies": []}]}, {"body": "Never buy TVIX...", "score": -4, "replies": []}]}
{"title": "$AMD", "selftext": "[removed]", "id": "6xekeu", "created_utc": 1504273058.0, "score": 18, "upvote_ratio": 0.88, "num_comments": 16, "comments": [{"body": "Don't be pussies and sell, ride that gainz wave.", "score": 18, "replies": [{"body": "I'm not selling til $14.50. Lisa Make Me Su Horny.", "score": 4, "replies": []}]}, {"body": "I bought AMD when it dipped under $12 AMA", "score": 11, "replies": [{"body": "Do you need help with your hookers and blow?", "score": 4, "replies": []}, {"body": "Congrats on being the first autistic man in space ", "score": 3, "replies": []}]}, {"body": "I got crushed on my AMD calls after the Ryzen release. Been way more careful ever since. Every time it drops to $11.99 I buy $12 calls expiring 1 month out. Sell as soon as it hits $13.30. EZ PZ.\n\nJust made +120% in the last three days. I'll do it again next week when Kim Jon Un throws another missile into Japanese airspace.", "score": 11, "replies": [{"body": "I like this strategy. My future tendies thank you. \n\nHail amd. ", "score": 4, "replies": []}]}, {"body": "Damn I was sweating on these $13 10/20 calls... Phew. Let's gooooooooo", "score": 4, "replies": [{"body": "Let the sweet gainz rain!!", "score": 7, "replies": [{"body": "Put my $14 and $15 Oct 20 calls in the money baby!", "score": 2, "replies": [{"body": "!RemindMe October 21st I think those will be worthless", "score": 2, "replies": []}]}]}]}, {"body": "I see you sent listening and selling, weak people.", "score": 1, "replies": []}, {"body": "These faggots are out here just saying it's name all willy nilly, mf, if you say it's name directly it don't keep going up! My love to Sue Bae", "score": 1, "replies": []}, {"body": "Sold at $13.35.\n\nGood luck to you.", "score": 1, "replies": []}, {"body": "Thought about buying calls when it was @ 12 a few days ago. Didn't pull the trigger so it blasted off", "score": 1, "replies": []}, {"body": "Sold earlier at 13.39 because I don't trust these hoes ", "score": 1, "replies": []}]}
{"title": "Is there a way to bet against the sub prime car loan bubble?", "selftext": "[removed]", "id": "6xemza", "created_utc": 1504273757.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 9, "comments": [{"body": "So did you watch the big short last night or this morning?", "score": 28, "replies": [{"body": "No he just loves his job.\n\n", "score": 2, "replies": []}]}, {"body": "Buy a car and drive it as fast as you can into a brick wall", "score": 6, "replies": []}, {"body": "I've been wary of posting about this topic on WSB. Car loan turnover time is way down, rates are stagnant, indirect loans are gouging the interest well below direct lending, and to top it off packages of direct and indirect loans are being put together and bought and sold between institutions to cut a guaranteed return and open up liquidity. \n\nBetween the over-churning and the impending self-driving revolution to the industry, its only a matter of time", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They are. They work closely with Fiat Chrysler, so every inbred hilljack that bought a Challenger Hellcat has it financed through Santander.", "score": 2, "replies": []}]}, {"body": "Have you seen the interest rate on a sub prime car loan?  There is no way they are losing money even in a default.  Housing sub prime was at historically low interest rates making it the banks problem.  Car loans at usury rates don't pose that risk.  At a 30% rate (and I have seen higher) years till double is 2.4 on a five year loan if they default half way the finance company still got theirs.  Not to mention they follow the guy around so the second they have money again they go after it or he rolls it into a new car they can reposes it faster than you think which people pay because they need it to get to work.  When you default on a house it might bankrupt you but the bank won't follow you after the fact to pay for a house you don't live in but they will for a car you no longer own.  That is the difference.   ", "score": 1, "replies": []}]}
{"title": "Looking for a YOLO", "selftext": "[deleted]", "id": "6xfot6", "created_utc": 1504283637.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 11, "comments": [{"body": "> so now my buying power is way up\n\n$300", "score": 8, "replies": []}, {"body": "Go all in tvix and then wait til Kim fires another missile", "score": 4, "replies": [{"body": "I like this. I like you.", "score": 4, "replies": []}]}, {"body": "Pick a side and buy $SPY/$SPX", "score": 1, "replies": [{"body": "Might make 5% over the next 3 months! Exhilarating ", "score": 0, "replies": [{"body": "All in SPX calls or puts expiring today", "score": 4, "replies": []}, {"body": "lol what? Maybe if you pick something retarded like a 2019 expiry or deep deep ITM you goon", "score": 1, "replies": []}]}]}, {"body": "Yolo $RAD. No balls", "score": 1, "replies": []}, {"body": "$HZO of course!", "score": 1, "replies": []}]}
{"title": "Another great NVDA analysis from Yahoo Finance", "selftext": "[deleted]", "id": "6xh9rw", "created_utc": 1504298075.0, "score": 36, "upvote_ratio": 0.66, "num_comments": 11, "comments": [{"body": "Correct me if I'm wrong...\n\nOversold = People should be selling less.\nBreaking out = Doing good.\n\nEssentially the same thing", "score": 57, "replies": [{"body": "Yea OP is a retard.", "score": 43, "replies": []}, {"body": "Hah, your right. I missed that. It's Friday and I checked out for the weekend as soon as I got up Monday morning ", "score": 5, "replies": []}]}, {"body": "Op retard. Same thing", "score": 15, "replies": [{"body": "Yeah OP, what happened to your reading comprehension?", "score": 0, "replies": []}]}, {"body": "Op reads at an aborted fetus's lvl", "score": 6, "replies": []}, {"body": "Same thing, different authors.", "score": 1, "replies": []}, {"body": "Breaking out, all in on Pro Active!", "score": 1, "replies": []}, {"body": "a lot can change in less than a day...", "score": 1, "replies": []}, {"body": "??? you need to revisit investopedia bro...", "score": 1, "replies": []}]}
