{"title": "Hedge funds are starting to sell off their NVIDIA shares", "selftext": "[deleted]", "id": "1g656i0", "created_utc": 1729209788.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 33, "comments": [{"body": "Source for those hedge funds sales?", "score": 45, "replies": [{"body": "OP is looking for a buying opportunity.", "score": 18, "replies": []}, {"body": "Companies regularly go up by hundreds of billions of dollars a day when major shareholders are dumping shares hard - \"OP\"\n\n\nI dont have any shares, but he's struggling to think here. Also probably isn't aware that reporting is super delayed", "score": 2, "replies": []}, {"body": "Is there any website to see all the hedge funds buying and selling filings?", "score": 2, "replies": [{"body": "That’s precisely my question to OP. The filings for those major hedge funds dumping shares now won’t come out for weeks…. Filings for previous quarters don’t show that sell off.", "score": 3, "replies": []}]}, {"body": "prolly mixing up report date with transaction date", "score": 1, "replies": []}]}, {"body": "iS nViDiA oVeRvAlUeD\n\npost a source", "score": 40, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "do you expect them to throw a bunch of cash and it pops out fully ready to work like an ez bake oven? lmao\n\nits always funny how people complain companies don't innovate, and then also complain when companies invest to innovate", "score": 17, "replies": []}, {"body": "some guy on bloomberg was also explaining most companies don’t have modern CRM systems with centralized data so they can’t do much for years. ", "score": 2, "replies": [{"body": "🤣 you watch how fast that problem gets solved when Vinny VP gets wind that competitor X found a way to do it. Vinny knows they run a shitty old CRM just like his company. Better get your second/third order counterintution hat on when you're listening to the Bloomberg rag.", "score": 2, "replies": [{"body": "Getting data in one spot is way harder than people think. even if it’s just CRM. it can take enterprise systems a decade to upgrade. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Which hedge funds? And are they trimming because the run up made them overweight?\n\nIf we’re going by p/e, nvdas fwd pe is half of that of stocks like tsla", "score": 18, "replies": []}, {"body": "That means it's a great time to load up and take advantage of the DCA. This is a tale as old as time. They Go through cycles like this. Unless you want to take profits then go ahead and sell. But if you want to build on your position then you buy. Whatever your exit strategy is follow that.", "score": 5, "replies": []}, {"body": "If Huangs comments were true that demand for Blackwell is insane, then nvda can still break new grounds, and at least so far Huang isn't known to exaggerate or lie.", "score": 5, "replies": []}, {"body": "Important to remember that hedge funds need to operate completely different than the normal retail investor. They need to lock in profits", "score": 5, "replies": [{"body": "I often stress this. Retail investors have an advantage when you consider there's no customers to appease. This is also why Berkshire does well.", "score": 2, "replies": []}]}, {"body": "As per my experience with hedge funds (I was working in one as an algorithmic trading developer), their portfolio is \"top secret\". Only their brokers know what's inside it and there's of course NDA agreements everywhere (even I as a developer had to sign such an agreement). \n\nTL;DR: you can't know what hedge funds are doing.", "score": 3, "replies": []}, {"body": "redditors think buying palantir is how you fight the man. It’s a cult meme stock at this point. If nvidia drops 60% lots of funds will be having some awkward conversations with their clients. and individuals with their spouses gambling their money away. \n\nMultiple competitors have AI chips, do not speculate on one company. \n\nI think the projected earnings is way off, the positive bias is too strong for now. \n\nIt will go up as long as there’s inflows. ", "score": 5, "replies": [{"body": "Nobody has nvidia AI chips. Yeah, AMD and intel can try, but they don't have CUDA or a massive community of techy gamers with consumer hardware that can all run a model from huggingface within 5min. \n\n\nAs far as the hardware goes for the type of LLMs that OpenAI/MS/Meta/Google all run, everyone else is years behind.\n\n\nAs far as the development community goes for these types of LLMs, everyone else is years behind. \n\n\nWhat you should be betting on are companies and groups that develop competing frameworks to CUDA and Nvidia's cluster architecture. Until something else comes out that can beat CUDA, these large models like GPT-4o, Llama, Gemini/bard, etc. will all run on Nvidia cards. \n\n\nMS and OpenAI very likely just unlocked the ability to do LLM training while distributing the compute across datacenters. Datacenters filled with nvidia cards. If you're a company trying to develop a competing model to OpenAI's or Meta's, you're not getting off the ground floor by telling investors you're working with AMD chips (unless your product is actually the framework or architecture itself). We've seen some of these pop up recently, but obviously they're still in their infancy or clouded by the hype/skepticism loop.\n\n\nJust a perspective from someone who's been playing with PCs for a very long time and was very anti-AI until somewhat recently.", "score": 3, "replies": [{"body": "if you can get the same result for half the cost, might be worth the cheaper chip. I have not spent more than 15 learning about AI as a disclaimer just stating the obvious. \n\nIf you invested all your money in computers the size of a room in 1980, you could have just waited ten years and rented a few hours to do the physics math etc. ", "score": 0, "replies": [{"body": "Very true, but I think once execs bring their techies into meetings with the other players, they're going to realize how turnkey nvidia's solution is and how it can pay dividends now while we maybe wait for AMD or someone else to mature their solutions. This leans things heavily in nvidias favor, probably for the next 10 years like you say. But also, these GPUs aren't consumer cards so they don't age quite as quickly. Nobody gets fired for buying Microsoft or IBM. Nobody is getting fired for buying Nvidia.", "score": 1, "replies": []}]}]}]}, {"body": "Well this hedge fund has 2 thumbs and he’s buying ![gif](emote|free_emotes_pack|grin)", "score": 2, "replies": []}, {"body": "I hope they do. I hope this thing does a massive sell off again... like, I hope big daddy trump says something about Taiwan and shakes the tree. Who doesn't want a good in? Lol", "score": 2, "replies": []}, {"body": "Gosh I guess I’ll just take your word for it", "score": 1, "replies": []}, {"body": "Highly doubt they’re selling everything if they’re selling at all. Blackwell hasn’t even released yet lol", "score": 1, "replies": []}, {"body": "I’ve been listening to this same comment since at least December of last year. “Hedge funds selling, too overvalued”… It wasn’t true then. Why would it be true now?", "score": 1, "replies": []}, {"body": "Buy ionq quantum computing or at least keep a close eye on it. I still have mostly nvda but I have stop loss set for if it trends down too much", "score": 1, "replies": []}, {"body": "If someone showed me a blank-name company with 76% margins, 130% YoY growth, more cash than debt, no recent dilution, and trading at a PE of 65 with a forward PE of 30.. I’d be buying it hand over fist. Literally a dream stock by every metric.\n\nFor some reason when NVDA is that stock a lot of ppl get scared and start screaming to sell. It’s the definition of a poor emotional investor mentality. Sell winners to buy loser companies. It’s the same type of people who sold Apple in 2010 because they thought the phone market was already saturated.", "score": 1, "replies": []}, {"body": "Keep your opinion to yourself or else you look silly.", "score": 0, "replies": [{"body": "I didn’t express any opinion :)", "score": 1, "replies": []}]}, {"body": "It's too over valued. Too risky to own.", "score": -2, "replies": []}]}
{"title": "Intel is Selling a Minority Stake in Altera to Raise Billions in Cash", "selftext": "https://www.", "id": "1g6f3lo", "created_utc": 1729248332.0, "score": 201, "upvote_ratio": 0.95, "num_comments": 36, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 135 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "His eyes don't look healthy at all.", "score": 72, "replies": [{"body": "That’s because he’s living in the trenches, drinking his own urine and thugging it out until Intel gets Nana her $700k back", "score": 105, "replies": [{"body": "I’m joining nana on this quest", "score": 2, "replies": [{"body": "All aboard Gelsinger’s pain train, next stop $25", "score": 2, "replies": []}]}]}, {"body": "Nana's probably haunting him.... 👻", "score": 20, "replies": []}, {"body": "He looks like a zombie... this picture alone would make me hesitate to invest in Intel.", "score": 11, "replies": [{"body": "Maybe he has been up all night helping develop something groundbreaking. I mean dudes paid the big bucks, I assume he has to be a genius level type when it comes to chips.", "score": 12, "replies": [{"body": "He came up with new flavored chips, you turn on your PC and your room smells like ranch dressing.", "score": 6, "replies": []}, {"body": "Actually, ye you're right. I was a bit hasty on my judgement", "score": 7, "replies": []}, {"body": "Or he's suckin and jerking every government boner he can so he doesn't get the chips act money taken away", "score": 2, "replies": [{"body": "or he’s just suckin and jerking anything he can get his hands on, ever thought about that? \n… asshole", "score": 1, "replies": []}]}]}]}, {"body": "Anyone would look like that if they spent all day crying..", "score": 1, "replies": []}, {"body": "a touch of preworkout allows him to talk to god ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}, {"body": "The reality behind Pat's bad appearance : Intel has been intentionally tanking its stock because it discovered the next leap in AI tech a while ago, but Sarah Connor has held Pat hostage since he was made CEO to prevent Skynet's creation.", "score": 54, "replies": [{"body": "Did Sarah smack him in the face? His eyes look like the tail end of recovering from 2 shiners.  Yeesh.", "score": 4, "replies": []}]}, {"body": "Bro looks like me after pulling an Adderall driven 40 hour all-nighter in grad school.\n\nI can *hear* that picture saying: \"Prof... I got the test chip fabbed...\"", "score": 22, "replies": []}, {"body": "sounds like they're doing well", "score": 8, "replies": []}, {"body": "I read that as Altria. Yes go smoke in the fab house", "score": 9, "replies": [{"body": "shit, I thought the same lol.", "score": 2, "replies": []}]}, {"body": "Good thing INTC raised 850k from grandma a few months ago", "score": 14, "replies": [{"body": "Needs  to hit 50 soon", "score": 2, "replies": []}]}, {"body": "Jesus, that guy is a heart attack walking. Look at his face. \n\nI admire the dedication though, he could quit tomorrow, move to an island and ride jet skis the rest of his life but he is trying to see it through", "score": 6, "replies": []}, {"body": "To 40 by end month?", "score": 6, "replies": [{"body": "I hope 🤞🏻", "score": 2, "replies": []}]}, {"body": "My guy is working hard to make my stocks break even... lets go!", "score": 3, "replies": []}, {"body": "Intel is shaping up to be a monster", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 4, "replies": []}, {"body": "Pieces are in motion to culminate in the Gelsinger act.", "score": 2, "replies": []}, {"body": "Yeah intel is cooked. Just like Pat is.", "score": 2, "replies": []}, {"body": "Man looks like he's been and a booze and coke marathon.", "score": 1, "replies": []}, {"body": "But why?", "score": 1, "replies": [{"body": "More liquid cash at hand", "score": 3, "replies": []}]}, {"body": "Naw intel is bottomed and getting a bailout.  LEAPS ftw", "score": 1, "replies": []}, {"body": "Intel is when you sell a stock you like and had nice gains on and believe in, just to pay the rent.", "score": 1, "replies": []}, {"body": "Any day now we’ll find out what Pat has been up to", "score": 1, "replies": []}]}
{"title": "Amazon, X-energy aim to bring more than 5 gigawatts online in the United States by 2039", "selftext": " the largest commercial deployment target of SMRs to date\n\nThe companies will initially support a four-unit 320-megawatt (“MW”) project with regional utility Energy Northwest in central Washington with the option to increase that project to 12 units and 960 MW. Amazon is immediately committing a direct investment in the Energy Northwest project to fund early development work that X-energy will perform\n\n\nLeaps anyone? ", "id": "1g6g94r", "created_utc": 1729252540.0, "score": 98, "upvote_ratio": 0.93, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 10 months ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/x9xkl9anbivd1.jpeg?width=318&format=pjpg&auto=webp&s=352e744fe9e93e8b74add6d9682258c743e6862a", "score": 23, "replies": [{"body": "*jiggawatts", "score": 7, "replies": [{"body": "Jigga whatt", "score": 9, "replies": [{"body": "Jigga who?!", "score": 5, "replies": []}]}]}]}, {"body": "My brain can’t even comprehend the year 2039", "score": 9, "replies": []}, {"body": "Bezowatts", "score": 6, "replies": []}, {"body": "too late", "score": 11, "replies": [{"body": "Agree. The AI race is a race... No-one is gonna wait around for SMR technology to be developed and go through ten years of regulatory hurdles and then scale up and go through another ten years of regulatory hurdles for implementation. They want power yesterday. They're sprinting for AGI by 2030.\n\nAmerica has basically unlimited natural gas, and better gas distribution infrastructure than power distribution infrastructure in most instances. How is Elon powering his $5bn cluster in Texas? With natural gas... Using standalone emergency generators, which are topped up by grid power from the natural gas plant down the road.\n\nNuclear is a meme which big tech ESG teams are distracting you with to green wash their plans to build their gas powered superclusters. How are Amazon data centres powered *currently*? With 'clean fuel cell technology' micro grids..... Yep, powered by natural gas \n\nMicrosoft and OpenAI and the rest will be forced to use natural gas just to keep up pace with their competition in the US who burn natural gas and their competition in China who burn coal.", "score": -8, "replies": [{"body": "Okay but rolls royce already has units deployed in italy lol \n\nWhat the fuck are you on about?", "score": 6, "replies": [{"body": "He’s long on USO and UNG, but not URNM", "score": 1, "replies": []}]}]}]}, {"body": "Current US consumption is around 400 GW.  So while it’s not nothing it doesn’t move the needle.", "score": 1, "replies": []}, {"body": "I'm only bagholding 50 shares from yesterday, how many are you stuck with?", "score": 1, "replies": [{"body": "112 Amazon start of year, 83 OKLO yesterday, sold SMR 20% gain vst for 40% gain \nProbably going to jump in 100 amazon again", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I jumped on it at opening up 57%🥹", "score": 1, "replies": []}]}]}]}, {"body": "Bezos trying too hard to be like Elon....X energy? How original.", "score": -4, "replies": [{"body": "You literally think Jeff Bezos is the CEO of Amazon.", "score": 1, "replies": [{"body": "Oh noes. He is and isn't at the same time you know? CEO is just a title. I mean does Zuckerberg really need the CEO title to run Meta?", "score": 0, "replies": [{"body": "Yes… Zuckerberg is the CEO of Meta.  Bezos left Amazon years ago.", "score": 1, "replies": [{"body": "CEO is just a title. The big decisions are still being made by him. Zuckerberg doesn't need the CEO title either. You have a lot to learn.", "score": 1, "replies": []}]}]}]}, {"body": "It’s funny you think anything elon has compared to amazon, comical even. Elon wishes he was actual big tech instead of having mostly vaporware.", "score": -6, "replies": [{"body": "These elon stans are insufferable, this thread literally has nothing to do with him yet they relate everything because it’s the only thing in their head. X-energy was founded in 2009, completely separate from bezos lol", "score": 8, "replies": []}, {"body": "Oh yeah selling Chinese shit en mass is very techie.", "score": 1, "replies": [{"body": "No owning the most complex/efficient delivery and sort system as well as the largest cloud computing service with the most advanced AI/robotics working for you on the planet as well as having your own chip designers and self driving division AND your own streaming services makes you a tech company.", "score": 7, "replies": [{"body": "Oh yeah that last mile of delivery is very techie. I agree with you. It's not just an army of people with vans. Don't tell Walmart about this trick.  \n\n\nThe largest cloud computing companies that stand among Microsoft , Meta, Google, Oracle...very cutting edge and techie for sure. \n\n\nOh no....not streaming devices that are also readily available through Netflix, Disney, Viacom Hulu YouTube ...Bezos is really pushing the innovation here. /S", "score": -1, "replies": [{"body": "Disney is tech now lol", "score": 2, "replies": [{"body": "Oh yeah great tech stuff there, streaming you know. It's so hot these days.", "score": 1, "replies": [{"body": "It's OK you can stop digging, you've embarrassed yourself enough. ", "score": 2, "replies": [{"body": "I was agreeing with you. Streaming is cutting edge technology.\n\n\n/S", "score": 1, "replies": []}]}]}]}, {"body": "If you think their is no tech involved in how they deliver things than idk what to tell you. Hint hint they don’t just open a map and tell people to go where. \n\nAlso downplaying what they do by comparing them to other companies like cmon it’s one company that is cloud computing/walmart/movie studio/AI/robotics/streaming.", "score": 1, "replies": [{"body": "Oh noe I do think there's a lot of tech in hiring hundreds of thousands of workers. You have to manage them somehow right? You can't have them pee in empty water bottles anymore. People will start to say something again.\n\n\nNow compared that to revolutionizing the car industry and space exploration...that definitely takes the cake. /S", "score": -1, "replies": [{"body": "Amazon revolutionized cloud computing and how retail is done? \n\nListen i’m no fanboy all i’m saying is one held an event where he yapped about how each car will be a data center like aws and one actually owns aws. One is complaining about how AI should be regulated and suing openAI bc they’re salty while the other has anthropic in their corner as well as their own AI. So between elon and bezos one IS big tech and the other is trying to BE big tech they aren’t the same. So who is trying to be what here exactly? How many nuclear power plants has elon commissioned to be build for his goal in carbon neutrality and clean energy? Just saying.", "score": 2, "replies": [{"body": "Oh noes, I wholeheartedly agree with you....web hosting (oh sorry i mean \"cloud computiung\") is very very very innovative and ahead of its time. That NFL contract also did not just sign itself. Took alot of innovation for prime to land that contract. Without Amazon, all those chinese shit would be stuck overseas, so don't get me wrong...Bezos is doing an amazing job.  /s", "score": 4, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}
{"title": "Anyone excited for Nebius (Yandex) resuming trading on Nasdaq this Monday?", "selftext": "Nebius, the company formerly known as Yandex that’s now focused on cloud infrastructure for AI uses (aka “AI compute”), is to begin trading on the public markets once again — more than two years after the Nasdaq halted trading due to economic sanctions imposed in the wake of Russia’s Ukraine invasion in 2022.\n\nThe Netherlands-based company is vying to become one of Europe’s leading players in the burgeoning “GPU-as-a-service” space, and sits in a somewhat unique position — it is a startup in many ways as it’s starting out afresh as a new business, but being a public company means that anyone can invest in it as an alternative to the usual U.S. hyperscalers such as Alphabet or Microsoft.\n\nFounded in 1997, most people know Yandex as the “Google of Russia,” building everything from search engines and advertising products, to maps and autonomous vehicles. Yandex’s core market was very much its domestic Russia plus a handful of neighboring countries, however its parent was a Dutch holding organization called Yandex N.V. which went public on the Nasdaq in 2011, followed by a secondary listing three years later on the Moscow Exchange.\n\nYandex N.V. was doing well as a public company, reaching a valuation of $31 billion at the end of 2021 before the Russia-Ukraine conflict kickstarted a series of global sanctions against companies in the region, and also individuals. Yandex co-founder and CEO Arkady Volozh was forced to resign after the European Union placed him on a sanctions list, although he was removed from the list in March 2024 which paved the way for his return as CEO of the next version of Yandex N.V.\n\nThat next version is Nebius and its business is based on one of Yandex N.V.’s few remaining assets outside of Russia: a Finnish data center and AI cloud business called Nebius AI. The new entity formally emerged back in July, outlining its plans to be a “European AI compute leader,” similar to something like CoreWeave — a company that is also in the midst of expanding into Europe, raising a ton of equity and debt en-route.\n\nWhile the Nasdaq had said in 2022 that it would delist Yandex and several other Russian-affiliated companies, Yandex appealed and the Nasdaq agreed to maintain its listing — but keep a halt on trading as it went about severing its Russian ties. With those ties terminated earlier this year, and $2 billion in the bank from selling its Russian assets, Volozh said at the time that he intended to continue Nebius as a public company, as it was an easier and cheaper way to access capital, in what is a very capital intensive business.\n\n“Our ambition is to build one of the world’s largest specialist AI infrastructure businesses,” Volozh said in a statement. “This requires access to technological expertise, graphics processing units and capital. These are exactly what we have.”\n\nNebius said its Class A ordinary shares will resume trading on Monday, October 21, 2024.", "id": "1g6l4nk", "created_utc": 1729266076.0, "score": 10, "upvote_ratio": 0.58, "num_comments": 33, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 5 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "What about Ozon?!", "score": 1, "replies": []}]}, {"body": "\"They had to rewrite all their code base in order to separate from Yandex.\"\n\nYes. Yes. This is EXACTLY how this works.", "score": 6, "replies": [{"body": "That's pretty much true. Source: know several folks there.", "score": 2, "replies": []}]}, {"body": ">Volozh said at the time that he intended to continue Nebius as a public company, as it was an easier and cheaper way to access capital, in what is a very capital intensive business.\n\nMeaning the issuance of new stock.", "score": 3, "replies": []}, {"body": "No. Fuck them forever.", "score": 20, "replies": [{"body": "No inside her trading. Nor inside him trading. Not having relations.", "score": 3, "replies": []}, {"body": "You now they are completely seperated from Russia and are based in The Netherlands?", "score": -13, "replies": [{"body": "the founders are Russians and they have family ties in Russia.\n\nMost of their developers are Russians.\n\nDo you know what happens when the Russian government asks Yandex to put in virus in their links or have top results be links to Russian propaganda? They will do it otherwise their families will be forced to the Gulags.\n\nYandex will always be Russian", "score": 12, "replies": [{"body": "Is that tin foil hat comfortable?![img](emote|t5_2th52|4271)\n\nHyperscalers are not search engines. They are about hardware/software rentals.\n\nLast, but not least, you are so gullible to believe that only RF pushes propaganda.", "score": -9, "replies": [{"body": "> only RF pushes propaganda\n\nsure, anything else you want to claim that I supposedly said?", "score": 7, "replies": []}]}, {"body": "Yandex still exist and is based in Russia. Nebius has split off from them and moved to The Netherlands taking with them the Nasdaq ticker, the Infrastructure and self-driving cars business.\n\nThe Dutch government nor Nasdaq would ever accept anything else .\n\nAnyway, its a 'startup' with a few billion warchest", "score": -14, "replies": [{"body": "that's the exact point.\n\nThese people are Russians trying to evade sanctions and to get their assets out, and now you're carrying water for them.", "score": 18, "replies": [{"body": "So what's the problem exactly? Do they support war? Are they avoiding individual sanctions? Do they have ties to the Russian government?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Didn't this company relocate to Israel?", "score": 2, "replies": [{"body": "Yes, their only data center outside of Russia is in Finland", "score": 1, "replies": []}]}, {"body": "They took extraordinary steps to rid themselves of the Russian parts so I’m going to consider buying. I would normally flip this after a short hold, but it looks cheap though high risk as single tangible asset and early stage b-plan. \n\nWho is their closest comps?", "score": 2, "replies": []}, {"body": "So two questions: \n\n1) How actually disconnected Nebius from Russia as of today?\n\n2) What is the equivalent to Nebius? It says it was \"the Google of Russia\", but they moved on to \"GPU as a service\". What kind of AI company are they? cause they are alot of them", "score": 4, "replies": [{"body": "1) Completely. They are a Dutch company now and had to rewrite all their code-base in order to separate from Yandex. \n\n2) They aim to be an AI infrastructure provider. So they build data centers and even their own servers that they deploy. Also, they will be one of the first to offer nVidias Blackwell GPU's to clients", "score": -4, "replies": [{"body": "follow up;\n\n1) how big are they? usually IPO's of big companies with proven track record( reddit for example), are inherently undervalued\n\n2) I meant to ask you in what exact business of AI they are in\n\nhttps://preview.redd.it/2t7eois1zjvd1.jpeg?width=1125&format=pjpg&auto=webp&s=70ec26c37d73cd0c34a5f41a76bbf429a23c3ebf", "score": 1, "replies": []}]}]}, {"body": "So now I can sell this shit on Monday. Tired of seeing this in my portfolio for last 2 years.\n\nhttps://preview.redd.it/lnalc20lskvd1.jpeg?width=1170&format=pjpg&auto=webp&s=c5c76cc65d9a127264b856dd10d1972b8d0d9f8f", "score": 2, "replies": [{"body": "Well, that's what you get for investing in russia. Either way, hope you will get some of this money back soon.", "score": 1, "replies": []}]}, {"body": "Thats totally not gonna be either  \nA. a rugpull   \nB. intermingled with russian oligarchs", "score": 1, "replies": []}, {"body": "What will be the ticker?", "score": 1, "replies": [{"body": "NBIS", "score": 2, "replies": [{"body": "Oh thanks, I just looked it up but of course not listed yet, but I guess on Monday then.\n\nIs this almost like an IPO? or just a relist under different ticker...?", "score": 1, "replies": []}]}]}, {"body": "Good reminder, what did Robinhood do with all my Yandex shares when they were delisted?", "score": 1, "replies": [{"body": "Should've done nothing", "score": 1, "replies": []}]}, {"body": "Ties 'terminated'. Suuuuure. These very people were the main asset for the internal russian propaganda and dissent-crushing machine for more than 10 years, and SUDDENLY they are like - \"nope, we honest eurupian businessmen now, give us your data and your money, comrades\". \n\nThis shit will be uncovered as another russian attempt to infiltrate western markets and data pipelines within months, and the company will be devalued to zero.", "score": 1, "replies": []}, {"body": "Nah, that's total shit, lmao", "score": 1, "replies": []}]}
{"title": "October 19th is coming. Can Nvidia's AI PC Day change the rules of the game for investors", "selftext": "[removed]", "id": "1g6mzkh", "created_utc": 1729270608.0, "score": 362, "upvote_ratio": 0.95, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 23 hours ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Thats on a Saturday so I expect it will not move the stock that day or the next", "score": 148, "replies": [{"body": "bold claim!", "score": 16, "replies": []}, {"body": "The market isn't open on the weekend ?", "score": -27, "replies": [{"body": "r/cryptocurrency is this way sir", "score": 24, "replies": []}]}]}, {"body": "[removed]", "score": 73, "replies": [{"body": "Some people will rise up", "score": 21, "replies": []}, {"body": "Tough with current climate", "score": 5, "replies": []}, {"body": "150", "score": 1, "replies": []}]}, {"body": "Jensen walks on stage and declares his open sourced AI is now capable of replacing 3rd world sweat shop child workers thanks to scalping data from Leddit's prestigious Wall Street Bets subreddit.\n\nNVDA goes up 100% on Monday despite multiple halts as BRICS' economy goes into meltdown from their pivotal slavery-powered industry being made redundant over the weekend.\n\nJensen posts a picture of him smoking a cigar while big titty fans queue up to get a signature on their titties from him.\n\n🇺🇸🦅GOD BLESS AMERICA🦅🇺🇸", "score": 94, "replies": [{"body": "the US is who drives the slavery-powered industries 🤔", "score": 8, "replies": [{"body": "Yes and in-exchange for allowing US to do so, the rich and powerful in the 3rd world get our CONSOOMER DEMAND and get paid for it. Don't need 'em no more when we have AI doing it for free so we can save the $0.01 per hour.", "score": 19, "replies": [{"body": "that’s nice, 3rd world will be let alone finally.\nand Americans can keep their dollars, everyone is happy.", "score": 7, "replies": []}]}]}, {"body": "0dte calls on the fucking american economy hell yes!", "score": 2, "replies": []}]}, {"body": "Can they just plug me into the matrix already?  I want to stab someone in the back and then get a program where I’m rich, attractive and bang hot women all day", "score": 19, "replies": [{"body": "Yes but there is a catch. There is only muscular good looking men. No women allowed in the matrix.", "score": 7, "replies": [{"body": "So not much different than the internet? Wait is the matrix just the internet and when you get plugged in you become some cyber ghost that doesn't even get a body like in the metaverse?", "score": 4, "replies": []}, {"body": "Hmmm.  Still probably better than what i got now lol", "score": 2, "replies": []}]}]}, {"body": "Looking forward to NVDA‘s performance next week.", "score": 29, "replies": [{"body": "A small downward, not a downward", "score": 13, "replies": [{"body": "Yes, be optimistic about NVDA.", "score": 11, "replies": []}]}, {"body": "Can’t wait to buy puts at its new ATH. \n\nNever fails.", "score": 4, "replies": []}]}, {"body": "Sell the event. That rtx 5090 gonna cost a couple bands.", "score": 12, "replies": [{"body": "It’s good if it can rise. I don’t care about it", "score": 11, "replies": []}, {"body": "The RTX 5090 is not expected.", "score": 2, "replies": []}, {"body": "Delay to 2027 so you can pump more blackwell bullish.", "score": 1, "replies": []}]}, {"body": "I hope it can rise to 150", "score": 7, "replies": []}, {"body": "Open The Fucking Casino", "score": 2, "replies": []}, {"body": "Praying to Nana they announce a  buyout of intel at $500 billion", "score": 2, "replies": []}]}
{"title": "$MBLY - Freebie", "selftext": "Nobody wants to buy stocks that are down ~70% YTD. Everyone wants $DRUG, $MSTR & soon any miners after they explode. It’s strange how the mind works. FOMO. \n\nEveryone piles in because Bitcoin is now going to the moon! /s\n\nAnyway.\n\nEarlier this year $TSLA was going to rock everyone’s world with the highly anticipated Robotaxi reveal. We see how that went. The event seemed rushed and many important details that investors and Tesla enthusiasts wanted were kept quiet.\n\nWell guess what. The future is still very bright for FSD, ADAS, whatever the fuck you wanna call it. Cars that drive themself.\n\nSo,\n\nMobileye is down 70% this year. Why? Because they’re headquarters are in Israel for starters. Secondly, they reduced forward guidance on their last quarterly earnings due to the shit show going on in China.\n\nWhat has happened since then?\n\nIran and Israel are still in their little weiner match.\n\nChina has been throwing out money left and right via stimulus.\n\n31% of Mobileye’s revenue comes from China. Dont you think they should see some relief from the stimulus as Baba, JD, NIO, and every other Chinese stock did?\n\nWhy hasn’t Intel sold any shares even though the were in trouble earlier this year?\n\nWhy did the CEO spend $10,000,000 on shares in August?\n\nWhy the fuck is short interest at 17% on a company with an actual product producing actual profit?\n\nI have been buying this month every week, but understand that this stock won’t appeal to many until it’s back up to $18-20 at which point shorts will begin to cover and sell their shares back to the ones who FOMO in around $30-$40.", "id": "1g6tq8b", "created_utc": 1729288407.0, "score": 22, "upvote_ratio": 0.73, "num_comments": 36, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 4 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1fwpoa1/teslas_robotaxi_catalyst/) \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "u/maxxTFSA \\- I work at mobileye in a non-tech role (overseeing food supllies...) and I can deny some allegations:\n\n1) Pump and Dump - this isn't true since Mobileye's technology had been implemented in 160 car models made by 18 different OEMs see the wiki page for sources. \n\n2) Israeli company BS + wars - This has zero effect on the stock since all deals are made 3-4 years in advance and the company has 3 years of runway in worst case scenario which is no more productions of cars in the world.\n\n3) Stolen data - That's a joke or a bot or a troll... whatever one the true story is, Mobileye must store all it's data including the top AI models in the world (that have been built over a decade!)in china for all contracts involving Chinese automakers so basically it's the other way around - china gets to steal all of mobileye's IP but it is still worth it for mobileye.\n\nATM Mobileye is valued as a company that has no growth potential which is far from true. In fact, it is a monopoly of ADAS systems and probably 1 of 2 companies in the world that wrok world wide with self driving cars across multiple OEM's. No matter what the OEM's do or where they invest they can't figure out the FSD solution in a way that satisfies the biocracy of world politics and Mobileye has already passed that stage and just waiting for the perfect oppourtunity with the perfect OEM partner to beak the market. it is just a matter of being patient for the first company to declare FSD worldwide and then you'll see the real value of Mobileye.\n\nI own $10K shares of mobileye and I do not hold any data the public doesn't hold. I do see the data in a daily manner and get updated on company news has they happen. So far there is nothing that I saw happen in the past years that justifies the low stock price...", "score": 1, "replies": []}]}, {"body": "Is that you, Bananastocks3?", "score": 53, "replies": []}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 12, "replies": [{"body": "I don’t know what this means. \n\nBut thank you", "score": 17, "replies": [{"body": "Lol you belong here", "score": 27, "replies": []}]}]}, {"body": "Is this Bananas Reddit account??", "score": 7, "replies": []}, {"body": "\"Why hasn’t Intel sold any shares\" -- why hasnt intel done anything smart in the past 5 years?", "score": 6, "replies": []}, {"body": "The moment you typed HQ is in Israel you should have known to stay away.", "score": 14, "replies": []}, {"body": "It was banned by the Chinese government because it stole data.  Branana brought a lot when it's $28.  Don‘t buy this s\\*\\*\\*.........", "score": 6, "replies": [{"body": "Source please.", "score": 2, "replies": []}, {"body": ">It was banned by the Chinese government because it stole data.\n\nSource?\n\nAlso, not sure who Branana is", "score": 3, "replies": [{"body": "Banana3 is a trader on Twitter. He's got TONS of MBLY shares and keeps buying more. I think he owns 2.3 million worth of shares.", "score": 3, "replies": []}]}]}, {"body": "Biggest problem is horizon robotics is eventually going to take their China marketshare. The only western OEM with clear long term partnership is VW (LOL).", "score": 2, "replies": []}, {"body": "Wouldn’t touch it with a 10 foot pole my guy", "score": 2, "replies": []}, {"body": "F that", "score": 1, "replies": []}, {"body": "own some shares...have taken a beating.", "score": 1, "replies": []}, {"body": "Mbly has been just trading side way for months….", "score": 1, "replies": [{"body": "I wouldn’t consider -48% in the last 3 months “side way”", "score": 2, "replies": [{"body": "Yeah, I meant after it plummeted", "score": 2, "replies": []}]}]}, {"body": "Best case of forward P/FCF is 20.... not cheap. Would  consider buying at around 6.", "score": 1, "replies": []}, {"body": "I agree with most of your perspective. I missed the 11 entry this week. Gelsinger has bot intel stock as well and it’s not doing so well. They haven’t released any live beta for their version of FSD so TSLA & Waymo ahead. What catalysts you see on the horizon?  Their latest video showcasing their updated FSD approach doesn’t reveal much. Might be sideways action until good news.  How long you in for? 30-40 $ 🎯?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Why’s it down?", "score": 1, "replies": []}]}, {"body": "Now do the analysis of how many car manufacturers moving from MBLY to QCOM and NVDA... They've screwed up so many OEMs with poor execution. Banana3 is only buying the stock, because he thinks it is overshorted and will get into a squeeze.\n\nhttps://preview.redd.it/9yygrjcixpvd1.jpeg?width=1914&format=pjpg&auto=webp&s=9f7f3bcc599c9c584d090a59d7921abe5daf3bd4", "score": 1, "replies": [{"body": "🤔 poor execution??", "score": 1, "replies": [{"body": "The chip itself is OK, but the ML/AI training for each OEM was poor. Late SW deliveries, poor KPIs. That's why so many OEMs are moving away.", "score": 1, "replies": [{"body": "do you have links to written articles?  \n\ni thought a decline in ev sales was the main reason. i was not aware of late sw rollout or loss oem customers.", "score": 1, "replies": [{"body": "I work in automotive ADAS, exactly with camera systems 🙂", "score": 1, "replies": [{"body": "i see.", "score": 1, "replies": [{"body": "In general MBLY might be a good play if stock gets squeezed.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "No way touching an Israeli Company. Known for stock pump and dumps and taking advantage of retail.", "score": 1, "replies": []}, {"body": "Position or ban, mods!!", "score": 0, "replies": [{"body": "Mods?\n\nWhy didn’t you just ask me?\n\nhttps://preview.redd.it/9g42vgpnamvd1.jpeg?width=828&format=pjpg&auto=webp&s=f06baf5d592699494fd1be18881c58231078835f", "score": 10, "replies": [{"body": "Fellow Canadian idiot, good to see", "score": 12, "replies": []}]}]}, {"body": " Not buying some middle eastern garbage", "score": -2, "replies": []}]}
