{"title": "Amazon takes $7.6 billion loss on Rivian stake after Rivian’s stock plunge", "selftext": "[https://www.cnbc.com/2022/04/28/amazon-takes-7point6-billion-loss-on-rivian-stake-from-q1-stock-plunge.html](https://www.cnbc.com/2022/04/28/amazon-takes-7point6-billion-loss-on-rivian-stake-from-q1-stock-plunge.html)\n\n* Rivian shares lost over half their value in the first quarter of 2022, forcing Amazon to take a big markdown on its stake in the electric vehicle company.\n* On Wednesday, Ford took a $5.4 billion loss on its Rivian stake.\n* Amazon invested more than $1.3 billion in Rivian as part of strategic partnership between the two companies.", "id": "ue4fka", "created_utc": 1651177791.0, "score": 452, "upvote_ratio": 0.97, "num_comments": 82, "comments": [{"body": "It's insane that Rivian IPO'd at the price that they did. Down almost 70% in less than 6 months, and that's just from it's IPO price. From its ATH, it's down more than 80%.", "score": 224, "replies": [{"body": "Idk who bought and why.", "score": 98, "replies": [{"body": "[deleted]", "score": 63, "replies": [{"body": "I remember when i was up over 160k on pre Lucid. Only for it to vanish within a week. My beautiful gains 😔. Im a poor peasant again", "score": 22, "replies": [{"body": "Jesus…", "score": 3, "replies": []}, {"body": "LCID will actually survive and thrive though. RIVN is cooked.", "score": -17, "replies": [{"body": "Oh yeah those 300 cars....mmm sure", "score": 9, "replies": [{"body": "They have orders for 17,000", "score": -4, "replies": []}]}, {"body": "You think Rivian has no shot at being profitable?  I would’ve thought it’s just a matter of time for them to figure it out while having Amazon backing it, no?", "score": 8, "replies": []}]}]}, {"body": "Aka the classy Wall Street criminal’s pump and dump", "score": 3, "replies": []}]}, {"body": "People with FOMO thinking they were investing in the next TSLA", "score": 107, "replies": [{"body": "That's how it is for literally every EV company.\n\nThe most ironic part is that many of those EV companies are insanely expensive compared to Tesla under most valuation metrics. Back around Rivian's IPO's I saw a lot of youtube videos that went through this and outlined just how outright bonkers expensive Rivian was even if you assumed Tesla was trading at fair value at the time.", "score": 55, "replies": []}, {"body": "People forgot about nikola real quick", "score": 30, "replies": []}, {"body": "This needs to be higher.", "score": 2, "replies": []}]}, {"body": "I did. Rode that puppy up. And sold. Then I got fomo because it kept on going up. Thankfully for once I resisted the urge to rebuy.", "score": 11, "replies": [{"body": "Same here, bought when going up, sold…\nForgot about it… and bought again this week 😞", "score": 2, "replies": []}]}, {"body": "I bought it because of the Amazon trucks and because the R1S looks awesome and was getting some pretty good reviews. I'm down like 40% ![gif](emote|free_emotes_pack|dizzy_face). It's not worth the loss to sell. It may be a few years still but I expect that they will turn it around. It probably won't be explosive growth like Tesla, but the price will get back up there sometime between now and my death, hopefully.", "score": 5, "replies": []}, {"body": "Those who’s late on the once in a life time opportunity TSLA and think that anyone who make EV will be the next big thing while forgot to look at how TSLA took a decade of beating while constantly get short by wall street predators.\n\nThose new start up EV will be a good short target for those big short to recoup their lost from TSLA bet", "score": 6, "replies": []}, {"body": "I don't know, but those idiots also bailed me out of my LCID position.", "score": 3, "replies": []}, {"body": "People who would've bought Dutch tulip bulbs.", "score": 3, "replies": []}, {"body": "I tried to convince someone to not buy. He was like dude it’s backed by Amazon and they bought a bajillion Rivian vans! It’s the future. Don’t you invest in Tesla? Etc. Etc. \n\nAnd I’m like man I am not saying don’t buy Rivian *at all*, but the market cap of that company makes no sense and they haven’t produce a single vehicle yet. Just wait for a while for it to come down.  You saw how much trouble Tesla had, right? It seems like a cool company - I’m all for it! \n\nDeaf ears. Thousands of dollars gone. *shrug*", "score": 4, "replies": [{"body": "I’m not saying Rivian is a good stock to buy, but they absolutely are producing vehicles. They’ve shipped over 3,000 trucks so far, and Amazon has an entire fleet of delivery trucks in use. \n\nI know this because I considered buying one but the demand was so high that I’d have to wait too long for an anticipated delivery date. \n\nYou can hate the stock, but you can’t claim there’s no demand for the product or that it’s some sort of vaporware like other smaller EV companies might be…", "score": 3, "replies": [{"body": "Didn’t claim any of that - they aren’t producing vehicles at scale. That’s the barrier. \n\nAt $70bn or w/e it was insanely overvalued", "score": 3, "replies": []}]}]}, {"body": "It’S tHe NeXt TeSLa KiLlEr", "score": -1, "replies": []}]}, {"body": "RIVN has $20B cash raised from IPO. Their market cap is 30B now. They rinsed stock market. They just need to turn $20B cash into productivity. Then they can rinse stock market again.", "score": 3, "replies": []}, {"body": "Imagine if they IPO'd around January 2021...", "score": 9, "replies": []}, {"body": "I mean every stock seemed to ipo at outrageous prices\nCoinbase, snowflake ipo around 200. When they should be -50\nI like unity but it should have ipod at 25 not 70ish and should not have skyrocketed to 200\n\nAnd that doesn't included all the spac crap where $10 stocks went to $60 and then back to $10", "score": 7, "replies": []}, {"body": "I am not sure it is intentional. That is one heck of market timing. They still have 20B from IPO on their books.", "score": 2, "replies": []}, {"body": "People were looking for 'the next Tesla'...not realizing that having two companies with explosive growth in the same, new sector is something that never, ever happens.", "score": 0, "replies": []}, {"body": "I had some puts I bought as soon as you could buy options for 90 dollars man I’d be rich if I hadn’t traded them", "score": 1, "replies": []}]}, {"body": "If you havent loaded up Rivian Puts yet their insider shares unlock on 5/10, 700 million shares versus currently only 100M trade. If amazon or Ford dump expect Rivian to $20", "score": 51, "replies": [{"body": "Wouldn't it be better to buy puts closer to the 5/10 date so we don't have to pay as much time premium?", "score": 4, "replies": [{"body": "Iv will increase closer to the unlock", "score": 2, "replies": []}]}]}, {"body": "Inverse Joseph carlson", "score": 22, "replies": [{"body": "Yeah, bro was heavy Netflix and Amazon. Ouch", "score": 10, "replies": [{"body": "Don’t forget Disney", "score": 6, "replies": []}]}]}, {"body": "7.6 billion dollar loss on an initial 700 million dollar investment. It was previously on their books for over 11 billion. \n\nJust ridiculous numbers.", "score": 37, "replies": []}, {"body": "I still think the company has potential long-term - more than some of the other EV startups. They actually have a functioning vehicle you can buy, and it's extremely capable and versatile. Look at [Doug DeMuro's review of it](https://youtu.be/CYrunRy8hmw) - that has huge reach (3 million views) and influences buyers. Heck, I actually saw one out driving last week. Might take a while, but at least they have an actual vehicle and not vaporware.\n\n*Edit: link to video.*", "score": 67, "replies": [{"body": "I see them all over SoCal. I don’t really like the look but have never ridden in one", "score": 15, "replies": [{"body": "They look bad. They look diminutive in person, just really small. It's probably the size of a Tacoma, but it just looks smaller. [I also can't get over how much their headlights look like a Dyson.](https://ibb.co/3Fp83Z5)", "score": 4, "replies": []}]}, {"body": "Also seems like they are taking their business seriously. They purchased a big 3 year six figure contract of cyber security from a company a friend works at", "score": 2, "replies": [{"body": "Lol I’m not sure you can say big in regards to a 3-year contract for cybersecurity in the 6 figures. 999,999/3 = 333,333.\n\nSo what? They hired on two cyber security analysts?", "score": 16, "replies": [{"body": "Lol yeah, I wouldn’t be impressed by six figures for even a one year contract. There’s no way that’s correct, it’s got to be more than $1 million", "score": 2, "replies": []}, {"body": "Its software. A company that size spending that much on one vendor is a lot especially considering it’s not a big vendor and they only sell one product", "score": 0, "replies": []}]}]}, {"body": "Believe I saw one Here in ny", "score": 1, "replies": []}, {"body": "It’s ugly as sin though", "score": 1, "replies": []}]}, {"body": "How do you take $1 billion stake and lose $7.6 billion?", "score": 37, "replies": [{"body": "headline is pretty poor, its not a $7.6 billion loss, the value of their stake has gone down $7.6 billion", "score": 27, "replies": []}, {"body": "Because their stake started at 10$ a share pre IPO. The loss is only from the peak.", "score": 45, "replies": []}]}, {"body": "RemindMe! Ten Years  \"Rivian\"", "score": 22, "replies": [{"body": "I will be messaging you in 10 years on [**2032-04-28 20:54:51 UTC**](http://www.wolframalpha.com/input/?i=2032-04-28%2020:54:51%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/ue4fka/amazon_takes_76_billion_loss_on_rivian_stake/i6kyuh0/?context=3)\n\n[**22 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fue4fka%2Famazon_takes_76_billion_loss_on_rivian_stake%2Fi6kyuh0%2F%5D%0A%0ARemindMe%21%202032-04-28%2020%3A54%3A51%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ue4fka)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 12, "replies": []}]}, {"body": "People maybe buying the \"next\" tesla what they don't realise is there buying the potential of the next tesla from 2008 not its current value in 2022.\n\nAlot of issues for Rivian and others to go through to even get to sit in their tail winds.", "score": 10, "replies": []}, {"body": "Is it still a buy before the split", "score": 18, "replies": [{"body": "For long term yeah, AMZN is always an expensive stock but there is probably more downside to come so I would just DCA if it's something you want to own.", "score": 21, "replies": []}]}, {"body": "This is why Im in on GGPI while its cheap", "score": 5, "replies": []}, {"body": "You all need to sell tomorrow my puts aren’t itm yet.", "score": 9, "replies": []}, {"body": "The question I would have is whether or not this might be a viable investment, albeit speculative, at or around $30.", "score": 2, "replies": []}, {"body": "I think it's great rivian exists and their truck seems really nice. I hope it matures into a successful company.\n\nBut the stock price a good investment at this price imho.", "score": 2, "replies": []}, {"body": "Glad I sold before the bell :D", "score": 1, "replies": [{"body": "So you are only -70% not -90%? :D", "score": 3, "replies": [{"body": "Bought the day before and sold $150 up, so I'm happy with it.", "score": 0, "replies": []}]}]}, {"body": "Bezos is a sinner. Guilty of envy. He wanted to be like the number 1 guy. He doesn't like to be number 2. The poop.", "score": 1, "replies": [{"body": "He's not even CEO anymore", "score": 1, "replies": [{"body": "He was when he got jealous of Elon lol.. remember that NYC Amazon office fiasco? He wanted to pull Nevada factory type benefits.", "score": 1, "replies": []}]}]}, {"body": "Why people shit on crypto because its so volatile while Rivian drops from 140 to 30 usd in less than a yr?", "score": -12, "replies": [{"body": "You could tell Rivian was overvalued, short it, and make money off of it. I think people don't like crypto as much since it is much harder to valuate.", "score": 11, "replies": [{"body": "> You could tell Rivian was overvalued, short it, and make money off of it. \n\nGabe Plotkin, is that you?", "score": 1, "replies": [{"body": "I think GME was probably undervalued at the time, so probably not.", "score": 1, "replies": []}]}]}, {"body": "I’ll probably never use crypto to buy anything, but there is a remote possibility I could own a Rivian someday. I’m not investing in either.", "score": 4, "replies": []}]}, {"body": "Rivian is sounding pretty good at $30 now.", "score": -5, "replies": [{"body": "It’s got half the market cap of BMW. I don’t think so.", "score": 18, "replies": [{"body": "Exactly. I considered picking up some shares a bit ago, but when I compared their market cap to some of the other big autos, I came to the conclusion their valuation is still way too high even after the correction. \n\nOn the contrary though, the R1 is definitely starting to penetrate the market and it is getting positive reviews all around. Could speak to their future prospects.", "score": 1, "replies": [{"body": "That’s why it was valued as high.", "score": 1, "replies": [{"body": "Mercedes has a market cap of somewhere near $70B and public opinion says they make nice cars, too. I'm not sure Rivian's future prospects justify a valuation 40% of Merc's.", "score": 2, "replies": [{"body": "I doubt it too. But I’ve been making the same point about Tesla and been wrong (or maybe not).", "score": 1, "replies": [{"body": "Agreed. I think it's only a matter of time until Tesla's music stops. They will eventually lose the ability to justify that P/E ratio.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Tesla started out pretty rocky as well.. let see if Rivian will continue to drop after the summer  or once the supply chain issue eases up", "score": 1, "replies": []}, {"body": "iTs A gOOd AMeRiCaN cOmPanY.", "score": 1, "replies": []}, {"body": "Jeff should buy the dip and take it all.", "score": 1, "replies": []}, {"body": "It was the guidance which hurt Amazon the most.  The guidance is due to the fact with higher prices there is less discretionary spending and more spending on food and gas.\n\nThe GDP is negative for the last quarter, and the upcoming quarter isn't looking that great.\n\nHow did the economy tank so quickly?", "score": 1, "replies": []}]}
