{"title": "$TSLA Daily Investor Discussion - April 16, 2022", "selftext": "# This is the daily fun thread/chat. 🥳🚀\n\nAll topics are permitted in this thread.\n\nSee our Monthly thread for more in-depth discussions about news/thoughts/opinions about Tesla.\n\n^((This thread should not be construed as investment advice or guidance.))", "id": "u4qfaf", "created_utc": 1650085209.0, "score": 21, "upvote_ratio": 0.96, "num_comments": 76, "comments": [{"body": "[deleted]", "score": 21, "replies": [{"body": "There's a huge amount of very rich and very powerful people who have a lot to list if Musk is successful. Tesla and SpaceX are disrupting a few businesses that were supposed to be \"safe\" and profitable for decades, and now all of a sudden it looks like they might run in to serious problems in the next 5-10 years.\n\nIt makes total sense that there are people who have a direct or indirect profit motive to spread as much false and negative sentiment about Musk and all his companies. Which doesn't mean I think that all those comments on reddit are coming from paid trolls, I also think that Musk is very easy to criticize on a lot of things. I'd just guess that there's some conservative think tank out there coming up with anti-Musk talking points, and they're extremely happy to see those taking points getting repeated \"organically\" on reddit and Twitter.\n\nThere's also a lot of investors who bet against Tesla and lost a ton of money and are just bitter. And there's a lot of experts (and arm chair experts) who know how the auto business or aerospace business is *supposed* to work and are bitter that all their predictions from the last 10 years are ending up looking ridiculous.\n\nMusk is turning a lot of things upside down that were supposed to be stable and predictable. And he's not doing it in the mature and respectful way that billionaires are \"supposed\" to act. So there's lots of people who are willing to ignore what he's doing and hop on the band wagon of hating him for the way he's doing it.", "score": 19, "replies": [{"body": "Honestly i dont think that many people actually bet against Tesla. Not the sort of people who are on here with flaming hot fingertips. It is much more likely that they are just extra salty due to missing the first TSLA 20x. Life is not fair, and I totally agree, but these people need a target so their egos dont get bruised.", "score": 3, "replies": []}, {"body": "Spoiler: he is successful", "score": 1, "replies": []}]}, {"body": "Just let them be wrong. Arguing on reddit about this isn't worth anyone's time.", "score": 12, "replies": [{"body": "agreed - pick you battles carefully", "score": 1, "replies": []}]}, {"body": "I’m banned from 3 different subreddits Just for trying to have a civil conversation about Elon. What’s wrong with these people? Everyone I talk to in real life loves Elon.", "score": 7, "replies": [{"body": "Sir, this is a Wendy's.", "score": 1, "replies": []}]}, {"body": "The majority of them don't understand the business and IMO, it stems from them seeing massive success in stock appreciation as well as a CEO who is the richest person in the world and doesn't have a filter. Mention Tesla = you're a shill and fanboy. But mention GME and you will have hoards of them agreeing with you. Just take it for what it is. The subreddits that aren't specialized have a lot of idiots.", "score": 7, "replies": []}, {"body": "My biggest curiosity is how much of what we see here translate to the overall population, is it the same as with LGBTHDTV folks (nothing against) that media and online presence make it look it’s a huge parcel of the population when it’s just a few % at most or it indeed it’s representative? My guess is the former \n\nLoud minorities screaming and the rest just going on with their life", "score": 7, "replies": [{"body": "Here’s the thing, people don’t bother to comment about boring folks. They are all commenting about Musk because he’s relevant as hell and the result is that Tesla ends up getting tons of free exposure that no other large company can even hope to buy. Every snarky post by a hater is a free advert for Tesla, what we should really worry about is if they ever start NOT talking about him….that would be a problem.", "score": 7, "replies": []}, {"body": "> LGBTHDTV folks \n\nComments like that are probably not helping with the whole tesla investors are douche bags narrative", "score": 1, "replies": [{"body": "Sorry, if being douchebag means making a little bit of harmless fun on a minority group that has permeating every sphere of society with their demands and so on, I'm a douchebag", "score": 2, "replies": [{"body": "Confirmed, douchebag.", "score": 2, "replies": []}]}]}, {"body": "\"screaming\" is pretty warranted when you're constantly targeted and oppressed for just being who you are, what's your point?", "score": -2, "replies": [{"body": "I think he's just trying to see if the percent of people who are anti-elon on reddit generalizes to the real world or not", "score": 7, "replies": []}, {"body": "You exemplified my point perfectly, at least in my neck of the woods, that doesn't happen, it's just online drama that doesn't translate to real life", "score": 1, "replies": [{"body": "Bro, take your bigotry elsewhere. HDTV?", "score": 0, "replies": []}]}]}]}, {"body": "If you are a hedge fund trying to buy up as much of the stock as you possibly can are you going to allow legitimate discussion?", "score": 1, "replies": [{"body": "The good old conspiracy theory.", "score": 2, "replies": []}]}, {"body": "It depends a lot on where you look. There are a lot of positive sentiment in the comments of TED’s most recent interview with Elon.\n\nhttps://youtu.be/cdZZpaB2kDM", "score": 1, "replies": [{"body": "I think YouTube sensors out any type of negative comments nowadays. I rarely find negative comments on YouTube.", "score": 2, "replies": []}]}]}, {"body": "Let me be the **first** to wish for a lovely weekend of quiet reflection on the future of TSLA", "score": 11, "replies": []}, {"body": "Hi, I have updated [TeslaPriceTargets.com](https://TeslaPriceTargets.com) besides 12 months price targets it now also includes an initial list of analysts with 2030 $TSLA price targets. Also added a 10 years weighted average price targets list from Steven Mark Ryan.\r  \nThe new lists also include your $TSLA value calculation of course.\r  \nIf you know of any $TSLA analysts that are missing in the lists, please let me know. Thank you.", "score": 10, "replies": [{"body": "Thanks for the work!!", "score": 1, "replies": [{"body": "You're welcome! Spread the word 😊", "score": 1, "replies": []}]}]}, {"body": "https://i.redd.it/maajjek7jzt81.jpeg?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n🍿🍿🍿", "score": 7, "replies": [{"body": "Haha", "score": 2, "replies": []}]}, {"body": "How many factories do we think Tesla will announce, and when?\n\nIf \"massive growth\" is the essence of Master Plan part 3, they need to start building more machines to build the machines.", "score": 7, "replies": [{"body": "2 new factory announcements by the end of this year, that's my prediction", "score": 6, "replies": []}, {"body": "I think they will expand Texas and Shanghai alot first. Maybe even Germany. Easier to expand than build a whole new location.", "score": 6, "replies": []}, {"body": "My prediction is massive expansion to Texas and the surrounding areas", "score": 5, "replies": []}, {"body": "My guess is they will want to find the kinks in Berlin and Austin before a new round of factories.  That said, I would hope they are doing massive de-briefs/lessons learned on the design and construction side now and trying to find opportunities for improvement there.  The design differences between the \"High Bay\" and the other areas of the building might be telling on how they woud proceed there.  \n\nI do expect them to select at least two more sites by the end of the year though, possibly by July.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "With a 2 year lead time on new factories, I think it's exactly the right time for this question.", "score": 2, "replies": [{"body": "Shanghai is still expanding, Berlin has only completed phase 1, and Austin is mostly empty.\n\nScaling existing factories is the stated goal, and along with that ~200-250GWh of 4680s.", "score": 4, "replies": []}]}]}]}, {"body": "https://twitter.com/teslatruckclub/status/1515395725538078721?s=21&t=BNJHTtxt3wHd9vK4MboaVg\n\n😂😂", "score": 7, "replies": []}, {"body": "Musk 69,69,42 - perfect triangle. Dead", "score": 6, "replies": []}, {"body": "To be personally honest, I think Elon buying twitter is a great idea.\n\nNo matter what he does these days, someone finds a way to insult him or Tesla or SpaceX in some regard. The thing that frustrates me is the amount of misinformed people that think Elon came from extreme wealth and apartheid money, and that he had everything for himself.\n\nThis is wrong and misunderstood. By in large, Elon is a self made man, he had over 100K in student debt when studying, and he was dirt broke when he first came to Canada. Now that Elon's wealthy these past few years, people automatically think he is so evil, and that he gets everything from the back of his workers. \n\nThe overall sentiment I've seen is that most of these thoughts come from the left. Now I myself lean towards the left to many cases, but rationally speaking, a lot of the right that has common sense, does not think Elon is a bad person and he was born with a golden spoon or some BS. By in large, Elon is a person who did build himself up from basically nothing, and somehow, no one on the left seems to believe that.\n\nThe thing is that, Twitter, in itself these days is silencing a lot of the people who do understand Elon correctly. I like the view that Elon has, in that if you can see stuff on a platform to which you don't agree with, that means the platform endows free speech. I'm sure twitter under Elon will still condemn things like the insurrection and all that, because most of the people on both the left and the right side ended up thinking that was unacceptable, except for a few right-wing radicals.\n\nI think Elon has great potential and a great company to add to the portfolio by buying twitter, and maybe just maybe, he will over time push down the amount to people hating him in some regard, by proving to their rationale that his actions are level-headed and fair.", "score": 6, "replies": [{"body": "Engaging in a Twitter fight with Bernie is what flamed this up much more then usual (IMHO).  Bernie has a lot of fans himself...", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "But by in large, he is self made. That is the context I am making.", "score": 1, "replies": []}]}, {"body": "The idea that Musk didn't come from wealth is wrong.  He did.\n\nBut the good thing about buying twitter is that social media has largely been captured by specific interests and Musk is going to do what he thinks is the right thing without any regard to public pressure.", "score": -1, "replies": []}]}, {"body": "I’m always tuned in to legacy noise that amplifies around Tesla news or earnings. You can see it coming from all sources, and we know they likely missed.   \nExample: Ford ($F) is going to release the trailer for the F150 Lightning early next week, and then they are doing a big press reveal/launch of Lightning **on $GM‘s earning day** as a smokescreen to their own (potentially lackluster) earnings report the following day.\n\nDo you notice this as well?", "score": 5, "replies": [{"body": "All you have to do is turn on the TV, these guys are spending millions to promote their various EVs that either aren't available or are in very limited supply. They are trying mightily to grab future market share because they see the threat Tesla poses.", "score": 1, "replies": [{"body": "Production > Sales > Earnings >>> Marketing", "score": 2, "replies": []}]}]}, {"body": "May 15 my yellow ASS, Gordon.", "score": 4, "replies": [{"body": "First you're putting Listerine where it doesn't belong and now you're jaundiced? Any connection?", "score": 5, "replies": [{"body": "😂", "score": 2, "replies": []}]}]}, {"body": "[https://ark-invest.com/articles/analyst-research/arks-tesla-model/](https://ark-invest.com/articles/analyst-research/arks-tesla-model/)", "score": 5, "replies": []}, {"body": "Lol\n\nhttps://www.reddit.com/r/stocks/comments/u59mqo/whats_a_stock_youve_vowed_to_never_touch/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 2, "replies": []}, {"body": "US stock market open on Monday right?\n\nSource: Not American", "score": 4, "replies": [{"body": "Yeah its open", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "GM leading as always", "score": 1, "replies": []}]}, {"body": "What’s the latest on the stock split?", "score": 2, "replies": [{"body": "Elon loves 420-will announce on April 20 that stock will split into 20. The split might happen sooner for new employees (all employees) to take advantage of company's stock program. Moreover, filing SEC that soon shows that it will happen around June.", "score": 3, "replies": [{"body": "How awesome is the company's stock program? Can someone explain that to me?  I'm also wondering if all employees get to jump into the stock program including janitors, etc.", "score": 1, "replies": []}]}, {"body": "We have to wait for the annual meeting to vote on the share expansion; which could be mid year if we return to pre covid schedule or September/October if we go by the last 2 years scheduling. Board will then announce the split and it will take place 1-2months later. \n\nI'd guess December.", "score": 2, "replies": [{"body": "Thanks for taking the time. Assumed it was a way off with the initial buzz all but gone. No bad thing for the DCA", "score": 1, "replies": []}]}]}, {"body": "Anyone else read Ark’s new projections/price targets?", "score": 2, "replies": [{"body": "Assuming Robin-Taxi development goes according to plan AND cyber truck production begins next year, I think the share prices will increase, but to $4600 per share…? I’m not too sure what to think here. What’re your thoughts?", "score": 1, "replies": [{"body": "I don’t think we see mass adoption of FSD before 2030. I see $3k by 2025 (not factoring the split).", "score": 2, "replies": [{"body": "can't agree. i predict that we will see mass adoption of FSD within 1 year of release", "score": 4, "replies": [{"body": "I sincerely hope you are right and I am wrong.", "score": 9, "replies": []}]}]}, {"body": "I like Gary Black's model of discounting FSD/robotaxi to $0\n\nfor one thing if it's possible somebody else is going to do it eventually, like how IBM ripped off the Apple II w/ the 5150, Microsoft ripped off Macintosh with Windows, and Google ripped off iPhoneOS with Android.\n\nand if it's not possible, well . . .\n\nOne thing I find troubling about FSD is its difficulty with cones in the road . . . this would be the first thing I would have tackled if I were doing the ML, cones just sitting in the road ahead.", "score": -3, "replies": [{"body": "Really? The first thing? More important than lane lines? Driveable space? Identifying pedestrians? Identifying other cars? Etc…", "score": 2, "replies": [{"body": "first thing, yes, because all you need is road and cones.", "score": 0, "replies": []}]}]}]}]}, {"body": "Make sure you do your tax returns - if you have not gotten the third stimulus check last year, they'll add it right to you! Free $1400 coming right up to buy more stocks!", "score": 2, "replies": []}, {"body": "A little more context for why the lockdown in China Shanghai continues to be so severe despite there being \"no deaths\".\n\nBBC News - Covid China: Elderly deaths contradict Shanghai figures\nhttps://www.bbc.co.uk/news/world-asia-china-61117738", "score": 1, "replies": [{"body": "TLDR\nThe requirements for a death to be recorded as due to COVID require both a positive test and a positive scan. Authorities in China are not carrying out scans in post mortems, so likely positive cases are going unrecorded.\n\nThere also seems to be strong evidence that care homes in Shanghai in which COVID has been detected are suffering from high numbers of deaths, none of which are being recorded as COVID.", "score": 4, "replies": [{"body": "If they're gonna lie about it just end the lockdown and stop testing lol.", "score": 4, "replies": [{"body": "They can't for the same reason everyone else couldn't at the start of the pandemic. Their health care system wouldn't cope. People would still need hospital beds and die in large numbers regardless of whether they admitted it was COVID or not.", "score": 7, "replies": [{"body": "There are between a rock and a hard place, both of their own making.", "score": 5, "replies": [{"body": "not holding my breath for CCP to admit they - and Xi, gasp! - were wrong.\nHence, more of this madness", "score": 6, "replies": []}]}]}]}]}, {"body": "I've read on electrek that they will open the factory on the 18th. Is this still valid?", "score": 2, "replies": []}]}]}
{"title": "Tesla just updated the website. The mobile connector is no longer included with a new car", "selftext": "", "id": "u57zq7", "created_utc": 1650145484.0, "score": 92, "upvote_ratio": 0.95, "num_comments": 81, "comments": [{"body": "I just hope the data they used for that decision is\n\n\"A high percentage of cars never use it\"\n\nand not\n\n\"A high percentage of cars use infrequently\"\n\nBig difference", "score": 59, "replies": [{"body": "I put it in my garage and never looked at it again", "score": 15, "replies": [{"body": "Where do you charge? How do you charge?", "score": 1, "replies": [{"body": "Level 2 chargers at work usually, sometimes superchargers.\n\nIf I didn't have charging at work, I'd probably just supercharge. But I'm lucky enough to have one near home and one near the office.", "score": 5, "replies": [{"body": "Why would you supercharge if you had a level 1 at home?", "score": 2, "replies": [{"body": "Level 1 is too slow. The amount of time I'm at home is not even enough to recharge my commute.", "score": 1, "replies": [{"body": "Got it. Well it adds like 30-40 miles overnight so it's more than plenty for mine and many other buyers.\n\nSo many people don't realize this and pointlessly think the need a level 2 bc the community tells them so.", "score": 2, "replies": []}]}]}, {"body": "I'm assuming you have an S or X then?", "score": 2, "replies": []}]}]}]}, {"body": "I guess it doesn’t matter at this point, but I agree.  \n\nMy main issue with this move is they can’t seem to stock their own store with chargers.  In my opinion they should rarely run out and instead it seems the opposite is the case.", "score": 5, "replies": [{"body": "That won’t be the case soon. Since they’ll stop ‘giving these away’ with each car purchased. They should be able to replenish their supply, since the ‘demand/requirement’ will go down.", "score": 5, "replies": []}]}, {"body": "They I work with data analysts.\nThey probably pulled %cars that used it in past month, vs past year or in lifetime if ownership \n\nIf they pivoted to \"# cars that uses in first 3 months if ownership\" they'd get a totally different answer", "score": 5, "replies": []}, {"body": "I’ve used mine 2 times in 4 years and both times it was my only option.", "score": 4, "replies": [{"body": "🎯 this. At the very least, it's a **lifeline**", "score": 8, "replies": []}]}, {"body": "https://twitter.com/WholeMarsBlog/status/1515782556276252677?t=wrCwJlqgoITQszulvUKCvA&s=19\n\n5000 votes, 41% use the mobile connector daily.", "score": 1, "replies": [{"body": "Honestly too low of a sample size for the number of cars in the wild, would be good if Tesla shared the data", "score": 1, "replies": [{"body": "Yup the usage is really higher", "score": 1, "replies": []}]}]}]}, {"body": "wild friendly clumsy smart cows terrific ruthless connect quiet rinse\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 49, "replies": [{"body": "I've been using mine for close to 2 years now on my Y every day to charge up at night. Works the same as when I got it :)", "score": 24, "replies": []}, {"body": "This is what i did as well. I figured that’s how everyone else did it too", "score": 11, "replies": []}, {"body": "Yup, I use mine everyday for nearly 4 years now and think this is the dumbest move they could make.", "score": 17, "replies": []}, {"body": "I live in a condo and don’t have an outlet in my parking space, so I can’t use it to charge at home.  There is a Supercharger about 2 miles away from where I live.\n\nSo your comment really only applies to those people who live in an apartment or condo, plus have access to an outlet. I would imagine that is a small percentage.", "score": 2, "replies": []}]}, {"body": "Boo! It's for emergency use. Especially where I live with minimal Ev adoption and not as many superchargers/chargers. \nI hope to see minimal use of the emergency spare wheel too but you don't see them removing that! Oh wait...", "score": 43, "replies": [{"body": "I’ve had 3 teslas and lived in 6 different places with them over the years. I’ve solely used the mobile charger to charge it unless traveling.", "score": 22, "replies": [{"body": "I've used the mobile connector once for an emergency. Once is enough to justify it imo. \n\nYou never want to have to use anything that's for an emergency, but you also wouldn't discard it because it's never been used.", "score": 10, "replies": []}]}]}, {"body": "Definitely don’t agree with this. They better be transparent with everyone who has placed (and will place) an order because there will be plenty who plan on using this everyday. This kind of cost cutting is really gonna piss people off and will get all sorts of negative coverage, rightfully so. Apple not including a charging brick is one thing, but sending you home with no way to charge your car seems extremely dumb.", "score": 25, "replies": []}, {"body": "I hope that’s not for cars already ordered and waiting. That mobile connector was what I planned to use the majority of time for the daily work commute.\n\nAt least that should mean there should be plenty of stock…oh wait…it’s out of stock.", "score": 15, "replies": [{"body": "I'd double check when you get closer to delivery, or shoot them a message to let them know you assumed like it'd be included like every car for the past couple years. I just learned my dad's model y didn't include a 14-50 adapter... just the 120v one. Kinda shocked...", "score": 1, "replies": []}]}, {"body": "I feel like removing the mobile connector will be seen as the same move Apple did with chargers. And it’s great for environment if statistics prove it’s not used very much. \n\nHowever, we need :\n1) The option during the booking process\n2) Supply for people who need it", "score": 26, "replies": [{"body": "The context is entirely different. By the time Apple did that the world was saturated in a billion-plus iOS devices and charging cables, plus you’re usually a short drive away from being to go buy or borrow one.\n\nan EV charger is a highly specialized piece of equipment which is exceeding hard to find outside of service centers or online. This will 100% result in some new EV owners becoming stranded. This is utterly shameful at best, but given how the online order process for the car doesn’t educate and accommodate this change is nothing short of user hostile.", "score": 25, "replies": [{"body": "Exactly. I never understood the brouhaha around the Apple chargers, but I had like 3 different chargers in my house at any time. Didn’t really need one more with every device", "score": 1, "replies": []}]}, {"body": "I would be *very* interested in seeing some survey statistics. I use mine everyday pretty much. Very appealing to anyone who doesn’t own their house.", "score": 3, "replies": []}]}, {"body": "I suspect this is way to raise the price while keeping certain models eligible for tax credits but… the nickel and dimming doesn’t feel congruent with what the brand is known for", "score": 14, "replies": [{"body": "It seems to go against \"the mission\". I chalk it up to supply chain issues... but damn tesla, they can't be that bad.", "score": 7, "replies": [{"body": "If mobile connector chips are the current limiting factor, then it makes far more sense to sell separately rather than limit vehicle production.", "score": 5, "replies": []}]}]}, {"body": "How will this work in Europe? The mobile connector cable is a check point on the biannual vehicle inspection. If not provided you will get a fault ( at least in Norway)", "score": 6, "replies": []}, {"body": "Most people rarely use airbags, so we decided to make them optional.", "score": 5, "replies": []}, {"body": "Surprised to read quite so many posters don't find the mobile connector useful, whilst I use mine infrequently the time that I do have been incredibly useful. For example, charging at an AirBnb that doesn't have a type 2, same story if I visit someone who doesn't have an EVSE.\n\nIf I were ordering a car tomorrow, I'd still pickup a connector just on the off chance I needed it. \n\nThe only thing I've never used is the commando connector", "score": 4, "replies": []}, {"body": "There’s no way it’s barley used. Anyone with a 3 or Y who lives in a house likely uses it exclusively.", "score": 9, "replies": [{"body": "I don’t use mine", "score": 1, "replies": []}]}, {"body": "Usage statistics were super low, so seemed wasteful. On the (minor) plus side, we will be including more plug adapters with the mobile connector kit.\n\nhttps://twitter.com/elonmusk/status/1515439697425805315?s=21&t=BNJHTtxt3wHd9vK4MboaVg\n\nBased on feedback received, we will drop mobile connector price to $200 & make it easy to order with car. \n\nNote, mobile connector is not needed if you have a Tesla wall connector or to use Superchargers.\n\nRecommend installing Tesla wall connector well before car arrives.\n\nhttps://twitter.com/elonmusk/status/1515577134437347329?s=21&t=js-rKl3-xwoRiP-poevu5g", "score": 12, "replies": [{"body": "Wouldn’t be surprised if sourcing them is a logistics headache, or a bottle neck at worst, right now with all the supply chain challenges. Last thing you’d want is not delivering because of a connector shortage.", "score": 14, "replies": [{"body": ">Last thing you’d want is not delivering because of a connector shortage.\n\nThey could literally just send them later. This would not prevent delivery, it's even a completely discrete, shippable object.", "score": 4, "replies": []}, {"body": "This. I’m sure it’s hard enough delivering 300k per quarter, choosing not to bother scaling a charger factory to >1m units per quarter unnecessarily is a smart move.", "score": 4, "replies": []}]}, {"body": "They removed the 14-50 in 2020 from the included mobile connector. I just found that out for my dad's Model Y when we had to charge over 120v to get some juice and ended up supercharging... Rather disappointed in Tesla TBH. Are they going to stop covering defects at service centers to cut costs next?", "score": 1, "replies": []}]}, {"body": "Like to see the stats of those that use the cable and those that don't.", "score": 3, "replies": []}, {"body": "Wrong move IMO. I got the mobile charger with the 14-50 (and 5-15) adapter with my 3. I used it almost exclusively for one year when I used to live in an apartment and charged at work. Even now I use it when on road trips to plug in at Airbnbs and sometimes hotels that have accessible 110v outlets.", "score": 4, "replies": [{"body": "Sounds like you would be a prime candidate to spend 200$ on a mobile connector then.", "score": 1, "replies": []}]}, {"body": "So how does one charge? And what comes with the car now?", "score": 4, "replies": []}, {"body": "As part of my free speech: I don't like this.", "score": 2, "replies": []}, {"body": "This is so shitty lol. Truly awful.", "score": 8, "replies": []}, {"body": "Disappointing. I always add this as a selling point when telling people and they are always some mixture of reassured / elated. I use mine frequently charging at work, even though I realize this isn’t the case for many people. \n\nWhat’s most disappointing is my wife’s M3 keeps getting pushed back so it stings to learn it won’t come with one now. Although we will be saving thousands on the cost of the car, so can’t really complain…\n\nEdit: almost forgot, for some people this saved them a lot of money when you could just buy the Nema 14-50 pigtail and have level 2 charging in already equipped garages…", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "My DA just confirmed this to me. Still my primary point stands: this was a good selling point when I am trying to spread the good word about Tesla to friends and family.", "score": 2, "replies": []}]}]}, {"body": "Electrician in Norway here. \n\nThe mobile connector is meant as a emergency/rarely used thing. If you plan on charging an EV regularly, you have you get the wall connector. This allows you to charge up to 32A 230V.\n\nCharing using the mobile connector on a regular outdoor socket are only allowed to use 10A (230V), and require a certain Earth-leakage circuit breaker, as well as other measures.'", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "For us atleas, to prevent fires, you have to get a dedicated circuit if you plan on charging at home regularly. \nThe best thing is too have a dedicated circuit and a wall connector. \n\nIt could be dangerous using an old socket with am old circuit which has been spliced multiple places, to who knows where. \n\nWe have very strict laws when it comes the electrical system, you need an Electrician to do everything, even as simple as wiring a lamp.", "score": 3, "replies": []}]}]}, {"body": "We should be very vocal about this ain't the right move", "score": 2, "replies": []}, {"body": "So they also increased the price", "score": 2, "replies": []}, {"body": "I’ve never used the mobile charger. Had the level 2 charger installed prior to delivery.", "score": 2, "replies": [{"body": "What many don't know, you literally could buy a hook and a 240v plug adapter  (if you already have 240 plug) at Home Depot instead of buying the level 2 wall charger and having it installed.", "score": 10, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Tesla sells the adapters too. My kit came with a 14-50 plug with the mobile charger. Not sure if Tesla stopped providing that to boost sales. The mobile charger can def handle 240v. But had to buy a CircleCord adapter to match the 240v socket I have.\n\nSample hook [with photo](https://www.amazon.com/dp/B09J6GSMB2/)", "score": 2, "replies": [{"body": "Ah I see gotcha, so you already had a 240 outlet in your garage. Very interesting, will look into this, thank you so much!", "score": 1, "replies": []}]}]}]}]}, {"body": "Based on feedback received, we will drop mobile connector price to $200 & make it easy to order with car. \n\nNote, mobile connector is not needed if you have a Tesla wall connector or to use Superchargers.\n\nRecommend installing Tesla wall connector well before car arrives.\n\nhttps://twitter.com/elonmusk/status/1515577134437347329?s=21&t=js-rKl3-xwoRiP-poevu5g", "score": 1, "replies": []}, {"body": "Wtf", "score": -1, "replies": []}, {"body": "Elon has already decided no. Move along. Nothing to see here.", "score": 0, "replies": []}, {"body": "As an investor I think this is smart decision. My first impression is that it is smart to sell separately.   It’s really hard to buy a Tesla and know what you need out of the gate if you are new to ev.  Most people with a home can likely get by with mobile connector and 110v outlet.  But that is not very intuitive when your first time buying the car.  It still blows my mind this I plug my car to same outlet I use to charge my phone daily.\n\nTesla has enough superchargers that anyone can pretty much buy a car and not need to worry much about charging.\n\nI think many people will choose to buy the tesla wall connector and once that is installed their is very large incentive to be a repeat tesla buyer for second and 3rd family vehicles.\n\nFor me mobile connector is enough.  95% of time I use 110 volt outlet. Occasionally I will need to use the 220 which gives me over 200 miles of charge overnight and I  do about 1200 miles a month.", "score": 0, "replies": []}, {"body": "Makes sense. Literally never used mine.", "score": -12, "replies": [{"body": "How do you charge?", "score": 8, "replies": [{"body": "I live in an apartment with no home charging, so 95% Superchargers and the other 5% is the occasional slow 7kw free charger at the grocery store.", "score": 7, "replies": [{"body": "I have used supercharger maybe three times and use the mobile connector exclusively at home", "score": 15, "replies": [{"body": "I guess that’s the point of removing it and making it optional. It would make sense for you to buy one, whereas for me it just sat in the frunk for 2 years as expensive and useless cargo. \n\nWith inflation pushing up list prices and eating in to margins, just like the passenger lumbar support you may as well get rid of under-utilised complexity and extra cost. Sure you can argue “but it’s a $50k car, it should come with it” but you can also argue it’s a good thing, just like Apple ditching bundled power bricks, I appreciate less e-waste being generated and if I need one I can still order it so no biggie.\n\nFewer parts and complexity = faster scale with fewer potential bottleneck and parts to transported around the globe. If this were a Telsa owners sub it may be a bad thing, but this it a Tesla investors sub and from that angle it’s nothing but good - won’t impact sales at all and will impact margin positively.", "score": 3, "replies": []}]}]}]}, {"body": "same. I have never even opened/unwrapped mine. been in the frunk for nearly 4 yrs.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Earnings calls are not to ask for this kind of stuff sorry. \n\nThe main question should be about how the company can grow. Ramp production, sales, specific data, new products, timings.", "score": 3, "replies": []}, {"body": "That’s a low quality question to waste time on for an earnings call. There are a thousand things about production ramps in all factories that are way more important to investors, especially given the extremely limited time we get each quarter. Really not worth getting them to waste oxygen responding to complaints about charging bricks when you can just tweet @Elon.", "score": 5, "replies": []}]}, {"body": "Fuck yeah more money for us share holders(edit become of typo)", "score": -5, "replies": []}, {"body": "Is that Canadian?  This link shows [Tesla Gen 2 mobile connector](https://shop.tesla.com/product/gen-2-mobile-connector-bundle)it at $275", "score": 1, "replies": []}, {"body": "So how do you charge your car?", "score": 1, "replies": []}, {"body": "I use the mobile charger daily.  10-12 hours of charging gave me about 50 miles.\n\nDont have level 2 at home except dryer plug.  So i bought 14-30 and 14-50 adapters(in case i charge at camp sites).  \n\nI am going to another city next week and the town i stay at doesnt have superchargers.  Nearest place to charge is a destination charger for customers and supercharger is 40 minutes away.\n\nI really hope tesla just raise the car price for $400 and including the mobile charger.  No one care for extra $400 for a car.  \n\nOr tesla could ask customers if they want or not, if not, give $400 supercharging credit that never expires.", "score": 1, "replies": []}, {"body": "I used it until I could get my wall charger installed.\n\nI used it while my driveway was under construction.\n\nOtherwise, its lived in the lower trunk space, with a 50 foot extension cord and a couple of plug adapters, for emergencies.\n\nHowever, there are many people for whom it's the primary way of charging. Either their mileage is low, or they've installed a dryer socket that lets them charge at close to the rate of the wall charger.", "score": 1, "replies": []}, {"body": "It’s like a spare tire.  I like carrying spare tire even though 99% of the time, I won’t use it.", "score": 1, "replies": []}]}
{"title": "Timing a Recession? [$SPY - Predictions for the week of 4/18]", "selftext": "This is a prediction for the next 5 days except I will be talking about the timing of a recession further down.  \n\n&#x200B;\n\n[1 Day Chart](https://preview.redd.it/rl9ahoicext81.png?width=1479&format=png&auto=webp&s=2bedba763123e9d4535cfaf5275c00ba57bcbd60)\n\n\\~432 Support\n\n\\~452 Resistance\n\nRSI is showing a strong oversold reading, this downtrend will most likely not continue in the near term.\n\n[1 Day Chart](https://preview.redd.it/nbare8b2hxt81.png?width=1480&format=png&auto=webp&s=2f3cd58a26ceff9caadf6399d615a5aa5704c2b8)\n\nThe Bollinger bands are showing we are entering a period of lower volume and lower volatility.  I don't think we will see any major run up or down, in the next weeks (Unless there is major news).\n\n&#x200B;\n\n[10 Year Yield Correlation with Market Events](https://preview.redd.it/ovt5604mlxt81.png?width=604&format=png&auto=webp&s=2d5bd6da40a63d7cb1c96b42ef9f53b24719af37)\n\nSo, back to timing a recession, this chart has gotten me very interested.  You don't need a Bloomberg terminal to do this analysis though, I realized there are many problems with using this as an indication.\n\n&#x200B;\n\n[30 Year Yields Compared to SPX](https://preview.redd.it/x7ljsn94mxt81.png?width=1474&format=png&auto=webp&s=53cbd12a0211926027298578d34e6cac326244d7)\n\nLast week I said that the 30-year yields are better at predicting a market top.  Then I noticed, that both have margins of error, so finding the average of the 30Y + 10Y would be an even better indicator.  Also as the bond yields approach 0 they will decrease slower.  This is slightly an exponential trend, not a linear trend which can be fixed by graphing it logarithmically.\n\n \n\n[Average of 10 Year and 30 Year Yields](https://preview.redd.it/xb0ov8ljyxt81.png?width=1477&format=png&auto=webp&s=d926fc6f86b3307182dd4f7c63aa3e3eba866aa6)\n\n&#x200B;\n\n[Average of 10 Year and 30 Year Yields](https://preview.redd.it/zhuo5860zxt81.png?width=1480&format=png&auto=webp&s=ce7589143354bba01f71f05994a304f552c41a82)\n\nAs a continuation of the current uptrend in bond yields, I would expect the yields to cross this major level around the middle of June.  \n\n&#x200B;\n\n[Average of 10 Year and 30 Year Yields](https://preview.redd.it/lsbab1e71yt81.png?width=1478&format=png&auto=webp&s=9a6fbe97a05d8422c9d5c27ebfe8f80e6c858647)\n\nThis has predicted the top within about 5 months, exception of '94 though. \n\n&#x200B;\n\n[Comparisons](https://preview.redd.it/0zqtd3144yt81.png?width=1475&format=png&auto=webp&s=dff90c779a6a9520481562fc83cd2f8f19f2ea68)\n\nFrom this, I can conclude that when we have some recession in the next year, the central bank is just going to print more money and devalue our currency.  This is not a crisis though, no need to keep gold bars under your bed.  Maybe in another 30 years, it will be time to buy gold bars.  I just hope JPOW does not get too crazy and go to negative rates.\n\n&#x200B;\n\n[Federal Reserve Calendar](https://preview.redd.it/6479csug5yt81.png?width=620&format=png&auto=webp&s=1832a0db4029b7dbc20b208589f0e8df25488da7)\n\n**Predictions**\n\nI am not expecting any major moves in the market this week.  The stock market will most likely be fine until June.  I will look back at this in May though.  \n\nJerome Powell will talk Thursday at 1 pm, he may talk about reducing the balance sheet.  I don't think he will say anything crazy though, they are trying to keep the economy as stable as they can.  \n\nNext Week I am just expecting a general uptrend in the overall market.  I will be looking for opportunities not just opening trades to have open positions.  It's very important to find asymmetric trades not FOMOing into OTM options. \n\nThere is nothing crazy this week...\n\n \\* Not professional financial advice, do not solely make your trades based on my opinions, I encourage everyone to research more \n\n**Forecast**\n\n(Remember the 5-day outlook is the least serious part of my analysis, it is extremely hard to predict which days will be red or green)\n\nhttps://preview.redd.it/9srws8ihmyt81.png?width=1281&format=png&auto=webp&s=e3d8fe52b2c67cff850c80ac4eccd3617600ebf8\n\n I will respond to every comment!", "id": "u57ukd", "created_utc": 1650145055.0, "score": 53, "upvote_ratio": 0.86, "num_comments": 84, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|25|**First Seen In WSB**|7 months ago\n**Total Comments**|711|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/skwpds/spy_current_week_analysis_next_week_predictions/) [x](https://www.reddit.com/r/wallstreetbets/comments/swfwtz/spy_predictions_for_the_week_of_221/) [x](https://www.reddit.com/r/wallstreetbets/comments/tcoh2o/spy_predictions_for_the_week_of_314/) [x](https://www.reddit.com/r/wallstreetbets/comments/sqwd9c/spy_predictions_for_the_week_of_214/) [x](https://www.reddit.com/r/wallstreetbets/comments/t23ypl/spy_predictions_for_the_week_of_228/) [x](https://www.reddit.com/r/wallstreetbets/comments/t7jifc/spy_predictions_for_the_week_of_37/) [x](https://www.reddit.com/r/wallstreetbets/comments/tp494n/spy_predictions_for_the_week_of_328/) \n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=u57ukd)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=u57ukd)", "score": 1, "replies": []}, {"body": "This guy feasts on crayons", "score": 37, "replies": [{"body": "crayon only diet", "score": 17, "replies": [{"body": "Bollinger bands are a lagging indicator, they contract as price consolidates. Contracting Bollinger often indicate upcoming periods of increased volatility and price expansion to the upside or downside.\n\nI stopped reading after you screwed the pooch on the most basic analysis", "score": 1, "replies": [{"body": "Bollinger bands show the moving average 1,2,3 standard deviations away from the mean this is a very useful indicator in the present time because considering an alpha value of 5 anything outside of the 2nd band is very unusual, high frequency algorithms will buy in that range.  Just because there is a period of low volatility right now doesn’t mean we will have increased volatility in the near term, the time cycles are always different for volatility.", "score": 3, "replies": [{"body": "Why are you explaining what Bollinger bands are to me and implying that the reason I am disagreeing with your analysis is because I don’t understand the indicator? \n\nIn your OP you stated that contracting Bollinger bands indicates we are entering a period of decreased volatility.  That’s incorrect, contracting Bollinger indicates that we HAVE BEEN in a period of decreased volatility and that they more they contract that will increase the likelihood of price expansion.", "score": 1, "replies": [{"body": "We are entering decreased volatility though for this week in my opinion… that’s why I looked at the bollinger band width chart as well", "score": 5, "replies": [{"body": "Kick his ass seabass", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "![img](emote|t5_2th52|4735)", "score": 11, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 5, "replies": []}]}]}, {"body": "This is a comment", "score": 9, "replies": [{"body": "I don't know what I'm supposed to say about this, you outsmarted the system", "score": 7, "replies": [{"body": "I am pretty sure we all want to know how this ties to this week's astrological movements.", "score": 4, "replies": [{"body": "stock go up next week", "score": 3, "replies": []}]}, {"body": "WEBR", "score": 1, "replies": []}]}]}, {"body": "Well your flair says you’re the best so I’m obligated to believe you", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4886)", "score": 3, "replies": []}]}, {"body": "Good stuff. Thanks for the info", "score": 5, "replies": [{"body": "thanks", "score": 3, "replies": []}]}, {"body": "We need to remember that the thesis for bond yield analysis as a recession predictor is based on two things:\n\n \\- The idea that bond yield differences and changes reflect investor sentiment.\n\n \\- The fact that banks draw in capital from bond yield spread.\n\nBoth of these require normal market conditions and constrained cash reserves... but right now the Fed is actively manipulating the bond market and will be for the foreseeable future in a way that doesn't correlate to any other time in history, and banks are absolutely swimming in cash reserves right now.\n\nAs a result, the normal assumptions for their relationship to larger macroeconomic recessions are broken. Now I'm not saying that we will/won't have one... I can't see the future... just saying that bond considerations need to be balanced with this in mind and against other macroeconomic factors, many of which point away from there being a recession at the moment.", "score": 2, "replies": [{"body": "True, but this period of easy money is not going to last forever the banks are just starting to raise rates now.", "score": 3, "replies": [{"body": "Sure but the question is whether or not that's going to do anything. For the average consumer? Some sectors (like housing) are affected, but overall consumption is not likely to be impacted by rates (prices yes, rates no) which is the intent of the move... and with banks flush with cash, don't expect the credit markets to be heavily impacted the way people expect. We'll have to see and I think it depends a lot on how much the Fed signals the banks to pull back, which will be in hawkish messaging.\n\nBut none of this will be because of the bond market moves, which are happening for a completely different reason than people citing these as a recession signal are applying.", "score": 1, "replies": []}]}]}, {"body": "My left testicle had an itch, spy to $320 by end of month.", "score": 3, "replies": [{"body": "Lol the central bank wouldn’t let that happen, wait till the yield curve inverts the 2nd time then you can worry", "score": 2, "replies": []}]}, {"body": "Inflation is at 8%+   and the banks are only giving  <1% interest on the money....wtf is going on?\n\n&#x200B;\n\nInflation is 8%+ and the treasuries are barely paying interest. Just 20 years ago , the 10-year Treasury was paying out 5% and currently its still at 2.8%.....wtf is going on?", "score": 3, "replies": [{"body": "if they raised the effective rate to 10% it would fix inflation but it would crash the whole stock market in a month... they are just trying to do this as slow as possible", "score": 2, "replies": [{"body": "No they are not because if they were, effective rates would already be at 2% or 3% or 4%. What they are doing is letting inflation destroy all their debt so they can avoid a credit crisis. All the rich people who are over leveraged with millions or billions in debt will benefit tremendously \\*cough\\* stock market.\n\n&#x200B;\n\nThen, for main street they just say ohhh yeah umm wages will go up dont worry. Go get a job.", "score": 4, "replies": []}]}]}, {"body": "I picked up 444 calls on spy for 4/20 at the end of day Thursday.  I'll probably get rid of them on Monday if it's up enough, maybe hang on until Tuesday morning.", "score": 4, "replies": [{"body": "I would just take out my cost basis if I was up a lot on the contracts.  Then you can hold runners", "score": 7, "replies": [{"body": "You serious? How tf would he be up if he bought end of Thursday and Friday tanked?", "score": -10, "replies": [{"body": "I got them at .82, and there was no Friday.", "score": 7, "replies": []}, {"body": "Idk what his order filled at I am just suggesting an exit strategy", "score": 3, "replies": [{"body": "I appreciate that.  Makes sense to not pull everything, maybe turn and grab some puts at a high point when I sell", "score": 2, "replies": []}, {"body": "You don’t need to know what his order filled at to know that your suggestion makes no sense", "score": -4, "replies": [{"body": "Yeah the value of these contracts at their strike has only been decreasing since thursday", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I agree in short term being oversold. Probably see a little bounce to begin the week and then we’ll see how much momentum that can carry through week’s end.", "score": 2, "replies": []}, {"body": "Aww look at the bear on Wednesday.  He looks cute and cuddly.", "score": 2, "replies": [{"body": "it's bear season 🐻🐻", "score": 1, "replies": []}]}, {"body": "I honestly give more credibility to flipping a coin than I would to technical analysis charts", "score": 0, "replies": [{"body": "One technical indicator never works, a combination of many though can provide little bits of useful information that can predict the future.  Fundamental analysis is a bit more complicated on a whole index though", "score": 10, "replies": []}]}, {"body": "Bro I love your posts and insight but I find it highly odd that you can confidently say we’ll be fine until June. Are you maybe saying that with the assumption that won’t apply if tech earnings are a disaster? Or are you saying thAt you don’t see a sell off even if earnings are disaster?", "score": 1, "replies": [{"body": "I don't think earnings will be too bad yet, inflation hasn't kicked off...\n\nI think we are fine until May, I will revisit this stuff then again to see where we are at.", "score": 5, "replies": [{"body": " I think this is a blind spot for you.  I say that 100% constructively so you aren’t caught off guard. Imo April 27-29 will be a bloodbath and we slide into the may2-3 fed meeting. I’m just saying you may want to reconsider.", "score": 3, "replies": [{"body": "I’ll look for that fed meeting in a few weeks I have a feeling the sentiment will change from today", "score": 2, "replies": []}]}]}]}, {"body": "I have a question- What percentage of the time are you correct in your daily bull/bear predictions?", "score": 1, "replies": [{"body": "about 70% of the days are correct", "score": 5, "replies": [{"body": "Siiiiick- that’s pretty damn good. How long you been writing down your predictions? Do you keep some sort or log of your predictions?", "score": 1, "replies": [{"body": "Yeah just look at my profile", "score": 2, "replies": []}]}, {"body": "And last week was a bit rough, so this week I predict you'll be spot on to make up for it", "score": 1, "replies": []}, {"body": "Impressive.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Technical patterns and market sentiment mainly", "score": 1, "replies": []}]}, {"body": "Here is a question. What do those numbers here mean? Example :4886:", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4735)", "score": 3, "replies": []}]}, {"body": "Good analysis, would read again. I will give the next run of pre-emptive recession fears a wide berth: sell in may and go away, but remember to come back in september.", "score": 1, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "!remind me 1 week", "score": 1, "replies": [{"body": "you did it wrong ![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}, {"body": "My very simplified take is:  \n\\- Open week bullish.  \n\\- Tech earnings go good? momentum up  \n\\- Tech earnings go bad? momentum down  \n\\- Any bad news? bulls in shambles.\n\nOnly pos is SNAP calls.", "score": 1, "replies": [{"body": "I am expecting earnings to be good", "score": 2, "replies": []}]}, {"body": "Do you think that put call ratio is important as more and more options are being traded and with very low level of volumes the market makers will be better positioned to take advantage of pcr. \n\nThe banks who issue options will surely be taking advantage of this. \n\nBroadly, i think you are right and i think that first two days will be flattish. The rest I think should be reassessed based on the data obtained in the first two days. \n\nWhen you say that there will be rally at the time of speech of JPow I think it will be because most of the market and institutions will buy puts as insurance and that will become strong support.", "score": 1, "replies": [{"body": "there are just a lot of people sitting on the sidelines right now, for options and shares", "score": 2, "replies": []}]}, {"body": "Look back to the 70s. Bonds and stock price correlation is closer to one in high inflation regimes vs low inflation regimes (1990-2020).", "score": 1, "replies": [{"body": "Yeah but then the central bank rose rates to 20% to fix inflation before it got any worse", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "So what’s the better play going long bonds or waiting until the summer to short the market?", "score": 1, "replies": [{"body": "I have just been selling options, sometimes I will trade SPY though", "score": 1, "replies": [{"body": "Naked options or covered calls?", "score": 1, "replies": [{"body": "OTM covered calls on stocks with overpriced options", "score": 1, "replies": []}]}]}]}, {"body": "I don't know much but I do know that someone everytime, eventually, has to be the asshole and kick off market crashes. And I don't ever remember that being the Fed, our Government, or any public entity. It's usually just a bank or multiple banks. Not that our Government or the FED isn't responsible. It's the opposite. My point is they are always reactionary and seem to always shift the blame. I think the only thing similar to '08 is now everybody knows they have toxic assets across the board and this is less a game of hot potato and more a game of Russian roulette. No pun intended.", "score": 1, "replies": [{"body": "In the 70s inflation was hot, the effective rate was risen to 20% to stop inflation but it started a market crash", "score": 1, "replies": []}]}, {"body": "Recession not before June - September 2023", "score": 1, "replies": [{"body": "A lot of stuff will happen before then, like a recession", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Ok buy puts then ![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}, {"body": "RemindMe! 1 week \"does this guy eat crayons?\"", "score": 1, "replies": []}, {"body": "Remindme! 5 days", "score": 1, "replies": [{"body": "Damn this prediction was way off", "score": 1, "replies": []}]}, {"body": "I've been following your predictions this week and you're on-point.", "score": 1, "replies": [{"body": "Yeah, this week has been pretty good so far", "score": 1, "replies": []}]}]}
