{"title": "Do you think the market has 50% down from here in all seriousness?", "selftext": "Ok. This is a serious (well half lol, cause I try not take life that serious since wen don't get out alive anyways 😆).\n\nSo in all seriousness how far do you see the market going down from here?\n\nOr do you see it up, even if slightly, or flat by end of year?\n\nI always use 50% as a worse case scenario for my stocks which are mostly blue chips like MSFT AAPL GOOGL UNH UNP etc, although even that may be a bit much really.\n\nI was told it's quite difficult for the whole market to tank 50%, but maybe if you include the 10% we're already down it could go another 40%?\n\nWould be a great buying opp. I would think though which is one reason I'm 30% cash right now.\n\nSo imo I think the market could go down another 20% which from here would put us at 3300?\n\nBut I think that MAY be worse case...not sure though.\n\nSo that would put us down 30% from ath?\n\nSo do you see the year ending or the market gping down to 3500 or lower by years end?\n\nDo you think in all seriousness it will be lower than 3500 in 2023 or at least near where we are now?\n\nI say it'll be at least 4500 in 2023. Just guessing\n\nI can see us hitting 5000 some time either this year or next, but believe if we do hit 5k it will drop from there to 4400 for a while.", "id": "uc1qvw", "created_utc": 1650938823.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 85, "comments": [{"body": "Even if the market tanks like crazy, who knows what will happen after that. 1987 featured one of the largest stock market crashes that took the market down by 35% in a couple of days, but by the end of the year, the market was only down roughly 10% year-over-year. Nov/Dec 1987 was an amazing buying opportunity.", "score": 9, "replies": [{"body": "Yeah.  Just keep buying VTI dca I guess is best strategy!", "score": 1, "replies": []}]}, {"body": "50% is a lot. It takes so much for the market to erode 50% of it's value in the broad market, fairly stable, stocks. There's certainly individual stocks that can see business model shifts that wreak that much havoc, but I think a something like a world war would be needed to cut something like SPY in half.", "score": 15, "replies": [{"body": "World war?  No, SPY dropped just under 50% over a six month period in 2008 - 2009. SPY dropped over 30% in 22 trading days just a little over 2 years ago.  Time and diversity heal all wounds in the stock market but you can take a beating if your timeline isn’t long enough (at least 5 years).", "score": 2, "replies": [{"body": "\"Something like a world war\"\n\nThe collapse of the US housing market and the cascade afterward is nearly as rare as a major world war. A global pandemic that hadn't been seen since polio feels like it qualifies too.", "score": 1, "replies": []}]}, {"body": "Thanks! That's what I think.  If spy was down 50% we'd be in a pretty bad world anyways!\n\nNot that the world's state is that great at the moment lol!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "We're down 10% so far.  Another 30% down?\n\nI don't see that .... But who knows", "score": 0, "replies": [{"body": "Aliens could invade tomorrow,  but like, who knows??? Lol hehege", "score": 2, "replies": [{"body": "Nah, we could use some of those ATGM's on them and they would be as effective as the Russian Army, hehe", "score": 1, "replies": []}]}]}]}, {"body": "Maybe another 10% on sp500 and I don’t even see that , we shall see how earnings go this week and reaction but I don’t see big issues for market even withFed hikes", "score": 4, "replies": [{"body": "So 10% and maybe flattish as worst case eoy?", "score": 2, "replies": [{"body": "I actually think we will hit new ATH this year but who knows", "score": 2, "replies": []}]}]}, {"body": "let me have a look at my crystal ball..", "score": 11, "replies": [{"body": "Gimme a look after you!", "score": 6, "replies": []}, {"body": "Thanks. Mine's not working 😆", "score": 2, "replies": []}]}, {"body": "What makes you think the market is going to tank?", "score": 7, "replies": [{"body": "Take a look around. Inflation, war, China supply problems, covid in fall and winter again?", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Knowing my luck I'll buy SQQQ and the market will rally to 4600!", "score": 2, "replies": [{"body": "“Knowing my luck” is a very commonly used phrase by unprofitable traders. \n\nAre you a trader or a long term investor?", "score": 1, "replies": [{"body": "Both.  More long though. I take small profits if I think a stock is becoming to stretched.", "score": 1, "replies": [{"body": "You shouldn't mix up portfolios. With a trading account you can speculate all you want.\n\nWith an investment portfolio, it should be 100% longs only and you should only rotate from sector to sector or stock to stock based on your research. If you think a stock has reached a target then you can sell it and put it into another stock or reduce it and increase another stock. This is rotation.", "score": 1, "replies": [{"body": "Or just dca into VTI?\n\nI thought you more or less buy and hold in an investment account. Although I don't.\n\nIf you're selling in an investment account you're trading.", "score": 1, "replies": [{"body": "I adjust with my long term portfolio by reducing and increasing where I see fit. But I don’t have any cash available. Cash is not a position for me in long term account. For trading account then I can understand the cash position.\n\nFor example, in mid October last year I reduced NVidia and used that to increased Intel. Both are down of course as it is now but don’t care, it’s an investment.", "score": 1, "replies": [{"body": "But you're timing the market.  It's impossible. You're better off in a long account to just buy and hold.\n\nCould you have successfully pulled off 30 years of trading in and out of UNH?\n\nAnd what did you gain aftern30 years of stress?\n\nYou could've just held since its a great company and now you're $10k would be $950k.\n\nTrading in and out even of individual companies in the long term loses out to just buying and holding.\n\nNow if the company is going down or something maybe, but to constantly try and find tops and bottoms?  No thanks...lifes way too short!", "score": 1, "replies": [{"body": "I don’t time the market at all as you see the example I gave above. I reduced NVdA and increased Intel which both are losing position but I thought at the time that NVdA is great but I think Intel is really more valued play. Both of course are losing positions right now so you can see it is not timing the market or anything. The point here is “no cash position”.", "score": 1, "replies": [{"body": "You got lucky.  What if NVDA shoots back up to 290 in a few months?  You would have more by staying in nvda.\n\nWhat if intc goes nowhere for the next 3 years, but NVDA hits 350 next year?\n\nBut I understand where you're coming from.\n\nBut it's still impossible to concretely know what individual stocks are going to do.\n\nLet's say I'm 30% cash and I believe the market is going to tank.\n\nNVDA goes to 130.  I'd rather buy there, hence holding cash.\n\nMy NVDA position is only 2% right now but my basis is 121.", "score": 1, "replies": []}]}]}]}]}, {"body": "For example lets consider UNH.\n\nA $10k one time \"investment\" 30 years ago would now be worth about $950k.  That's with NO buying and selling.\n\nIf you were to try and trade over those 30 years with UNH you'd most likely have less money now, not to mention all the stress.\n\nYou're better off to find and monitor great companies and just HOLD.", "score": 1, "replies": [{"body": "This is an example in hindsight with no emotion involved in your final decision. But normally probably would have reduced the position once it gets too profitable and use that to increase the position of another stock. This is what I was talking about aka “rotation”. But never cash because cash is bad.", "score": 1, "replies": [{"body": "I'm 30% cash.  I think for the next 2 months I'm ahead being cash.\n\nIf we go to 3800 or less I'll do some buying! If not my 70% in will gain a little.\n\nYou win some and lose some.  Thats life.", "score": 1, "replies": [{"body": "Oh 3800 is definitely not the low. If you check my historical posts you’ll see that I’m expecting a minimum of 3600. Even with that knowledge and expectation, I have zero cash position. Again, I don’t try and time anything because I think it’s just silly for a long term account. Also I advocate to make bi-yearly contributions regardless of market condition. Once in beginning of March and once in beginning of October every year. This is what I have been doing since 2015.", "score": 1, "replies": [{"body": "Most people aren't with you on that call, but ok. Thats why I'm waiting in 30% cash non the less.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Here we go again.", "score": 5, "replies": []}, {"body": "$SQQQ has been a good bet so far.", "score": 2, "replies": [{"body": "Maybe I'll start a small position in my ROTH after this week?", "score": 1, "replies": []}]}, {"body": "Never say never but I believe it’s unlikely.\n\nI would take a step back and look at earnings from the big boys, including guidance.\n\nI would exclude big tech (because they seem to always be in a class of their own).\n\nCoke, Pepsi, 3M, I believe, all beat and raised OR affirmed previous guidance.\n\nI would follow Visa and MasterCard, (visa reports after the bell today), which will show the general direction the customer was and will be heading.\n\nHotels are another sector to follow along with wal mart, Target and the dollar stores.\n\nGenerally, I think it is entirely possible to see another 10-15% from here, likely in an overshoot, but if it goes beyond that then there must be something bigger in the works.\n\nUltimately, if you’re buying for the longer term, any down day (especially) is a good time to buy but at deeper discounts, like we have now, I tend to be more aggressive.\n\nBottom line: would I love to buy the spy exactly at the low, hell yes, but I’m not that good nor am I that precise, so I buy on dips, no matter what, and history has shown that it will pay off in the long term!\n\nGood luck to all and stay the course.", "score": 2, "replies": [{"body": "Yes.  VTI is looking tempting, but I tend to dca.  I have a lot of stocks I'm getting tempted on.\n\nYou're right you can never tell a bottom.\n\nI'm glad I'm 30% cash right now and probably will be over the next couple months.", "score": 1, "replies": []}]}, {"body": "Anything above .50 basis points in may will rock the market", "score": 2, "replies": [{"body": "50% down from here?", "score": 1, "replies": [{"body": "Not from here. MAYBE, from the highs end of 2021 into 2022.  50% from here is a slaughter house i don’t see that happening but i can’t see the future anymore i lost my powers", "score": 5, "replies": []}, {"body": "What did you end up doing?  12500 basically hit", "score": 1, "replies": [{"body": "What you mean?", "score": 1, "replies": [{"body": "Since your OP post did you trade, did you make money, lose money, what", "score": 1, "replies": [{"body": "Still losing.", "score": 1, "replies": [{"body": "It’s ugly af out there", "score": 1, "replies": [{"body": "No biggie. I'm thinking if we rally a little of selling more to cash. I think the market is gonna basically suck this year!", "score": 1, "replies": [{"body": "It’ll be interesting to see how June contacts end.", "score": 2, "replies": [{"body": "I say we're at sp500 2500 by July.  Won't recover to 4400 till 2030 maybe", "score": 1, "replies": [{"body": "Lmao\nNow you’re talking nonsense. \nBut let’s rendezvous in june.", "score": 1, "replies": [{"body": "😆.  I'm being a\nHalf serious but I wouldn't be SURPRISED if we're at 3000 or lower! Who knows in this nutty market!\n\nIts all good though! I wanna pay less for my shares!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Let’s think this through. Every time borrowing costs double in the space of months some fund or company managed by a hot stud who knows shit will have bet the farm on it not happening. So the managed taper becomes a bloodletting. Layer on a madman currently invading Europe, with nukes as a back up plan and I would suggest treading lightly. In terms of market fundamentals, the era of ever declining manufacturing costs is well and truly done, so kiss goodbye to surplus Asian capacity keeping rates at near zero together with dirt cheap delivery to the consumer. Both are done, never to return.  I could go on but can’t be bothered.", "score": 1, "replies": [{"body": "If we go nuclear nothing matters anyways.  So its a moot point.", "score": 2, "replies": [{"body": "The point about supply chains and low rates stands, tho.", "score": 1, "replies": [{"body": "Low rates?", "score": 1, "replies": [{"body": "We’ve had historically low funds rate", "score": 1, "replies": [{"body": "Greed always conquers.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Inflation is growth for companies so 50% down is extremely unlikely. The buying power of each dollar will be less but I believe broad market will continue to rise slightly in 2022 to somewhat level off and offset the huge gains (frontloaded) we saw in 2021. We have to burn some of that fuel off 🔥", "score": 1, "replies": [{"body": "So I'm thinking of holding my 30% cash or increasing slightly in rallies.  Then waiting for 15% down to start buying VTI etc?", "score": 1, "replies": [{"body": "I thought you went to 70% cash?", "score": 1, "replies": [{"body": "I was going to.  Might do 50%.  I have a lot I can sell that's long and then I can sell ROTH.  Not sure.", "score": 1, "replies": []}]}]}]}, {"body": "Need to realize one thing - its not going down because ppl sell, its going down because no one wants to buy. So, yes, if big players don't see an interest so that they can buy, so that then they can sell for more, then there is only one way and it is down. 50% or 30% it all depends on when the big players decide its good enough for them to start buying again.  \n\n\nIf retail grows big and just buys and holds then there is no interest for a fund to get in when everyone is already packed. Fund will keep shorting so retails holdings go down in price and they start panic selling - so fund closes short position, with profit.  \n\n\nThere is a way to make money when market goes up, and there is a way to make money on its way down. Point is, does retail know how to make money on market's way down? Or are we going to bleed till there is nothing left and when we are broke funds will start buying all back for dime?", "score": 0, "replies": [{"body": "SQQQ for down", "score": 1, "replies": []}]}, {"body": "With everything going on now I think a major market correction will occur sooner than later. Inflation at 15-25%, housing market over inflated, debt rising by the second and of course the fed's rasing interest rates in the near future. I see a 50 -60 % market correction. Numbers dont lie !!! I hope everyone comes out of this with tons of $$$ ,can retire early and live the best life possible.", "score": 0, "replies": [{"body": "Most here don't see that much.  That would mean another 40% down.  Maybe it'll happen who knows...", "score": 1, "replies": [{"body": "Hope for the best plan for the worst.", "score": 2, "replies": [{"body": "The best is a sell off!  There will be sales!", "score": 1, "replies": []}]}]}]}, {"body": "50% is extreme - the fed will lower rates before it gets that bad", "score": 0, "replies": [{"body": "Cool", "score": 1, "replies": []}]}, {"body": "No", "score": 1, "replies": []}, {"body": "In all market crashes it always refers to DJIA performance.  In 1986 when -22% market losses occured in a few hours resulted in $1.3 t evaporation or 50% S&P500 loss and that took 2 years to recover. \n\nFast forward, DJIA yty is essentially unchanged. People worry about -7.5% loss TYD(4  months) with no obvious losses in jobs. In fact, the unemployment at 3.6% or is one of the lowest.  The corrections are expected as people put too much money into stocks. The popular stocks are overvalued since investors have no better place to put into safer heavens. Many new tech stocks thrived because investors love to get into new stocks hoping they will replace what people have been doing.  That turned out to be negative. With eV unless government outlaw IC vehicles there will be more on the road while the % of eV from total will be higher in the future.\n\nI expect the market is going sideways for most the year until inflation, interest rate hikes, and war are under control.     [This article essentially  saying what people need to do to get through stock market glitches now](https://www.cnbc.com/2022/03/16/lessons-for-investors-two-years-after-the-covid-19-market-drop-of-2020.html).", "score": 1, "replies": [{"body": "So not 50% down from here sp500?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "So MSFT to $100?  😆", "score": 0, "replies": []}]}, {"body": "Half serious and 50% down— I see what you did there…", "score": 1, "replies": []}, {"body": "S&P 500 to 2,000", "score": 1, "replies": []}, {"body": "I mean like I have no idea. If anybody had the ability to see what the Market is going to do they wouldn’t be on r/stocks talking to retail investors. They would be a billionaire on Wall Street f****n hookers and snorting cocaine. \n\nHowever with that being said it would take a lot for the S&P to fall 50%. I don’t think it even fell that much during 2008 and 2009 overall. I think it fell 40% over the course of those 2 years. Something would have to be going on in the world thats really bad to make the S&P move like that. Is it possible? Absolutely. Is it probable? I don’t think so.", "score": 1, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "50% lol u wish", "score": 1, "replies": [{"body": "Thanks.  Never know.", "score": 1, "replies": []}]}, {"body": "A few “straw” missiles into Poland might get you a quick 25% drop.  And then a few more til 50%", "score": 1, "replies": [{"body": "I'm 30% cash. Might go 50% after this week", "score": 1, "replies": [{"body": "The thing is, if Russia capitulates the market would pop.  \n\nSince my retirement horizon is ten+ years I rather not miss a rally and risk waiting out a decline.  Even if you bail timely you will need to get back in at an opportune time too.\n\nStill, I have held off buying much since January so I understand where you are coming from", "score": 1, "replies": [{"body": "Should I stay 30% or go to 50% cash?\n\nI think we'll definitely go lower.  Maybe 3800?", "score": 1, "replies": []}]}]}]}, {"body": "Way, way too many people on Reddit are certain the market is going to crash for it to crash", "score": 1, "replies": []}, {"body": "In any bear cycle, large caps sell off the last. We are right there. I do think we will see see about an additional 10 to 15% down solely off the large cap selling. Mid caps seem to have bottomed and money seems to be bottom fishing. I think this cycle picks up momentum as folks who are parked in the large caps will start moving their money into midcaps", "score": 1, "replies": [{"body": "And then back into large caps.... Better to just find great companies and hold.  And a lot less stress!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Me too! Id like to buy in at 3500 or 3000 instead of 4500 or 5000!", "score": 1, "replies": []}]}]}
{"title": "Wheel in the bear market. What do you do to stay happy?", "selftext": "I started with 300k cash plus margin and since beginning of March my unrealized is down 25k (premium gains are approximately 10k) and it’s affecting my psychology. I know nothing is lost till I actually complete the wheel but I fear we haven’t seen the end of the crash yet and might be holding these positions for 10 years until they recover. \n\nI wanted to own the ETFs and stocks that I’ve been assigned so far and there is more that I’ll be assigned in the coming weeks but still knowing that it might take another 10 years to get back where I started is eating me alive. How do you cope with that ?", "id": "ucnc1h", "created_utc": 1651008773.0, "score": 56, "upvote_ratio": 0.89, "num_comments": 86, "comments": [{"body": "Yall need to read trading in the zone and stop with the emotional stuff, has no place in trading.", "score": 70, "replies": [{"body": "For real. That said, DO NOT watch the YouTube series. Made me want to kill myself.\n\nJared Tendler's \"The Mental Game of Poker\" is also a superb read for the same psychological mindset.", "score": 7, "replies": [{"body": "Suicide Hotline Numbers If you or anyone you know are struggling, please, PLEASE reach out for help. You are worthy, you are loved and you will always be able to find assistance.\n\nArgentina: +5402234930430\n\nAustralia: 131114\n\nAustria: 017133374\n\nBelgium: 106\n\nBosnia & Herzegovina: 080 05 03 05\n\nBotswana: 3911270\n\nBrazil: 212339191\n\nBulgaria: 0035 9249 17 223\n\nCanada: 5147234000 (Montreal); 18662773553 (outside Montreal)\n\nCroatia: 014833888\n\nDenmark: +4570201201\n\nEgypt: 7621602\n\nFinland: 010 195 202\n\nFrance: 0145394000\n\nGermany: 08001810771\n\nHong Kong: +852 2382 0000\n\nHungary: 116123\n\nIceland: 1717\n\nIndia: 8888817666\n\nIreland: +4408457909090\n\nItaly: 800860022\n\nJapan: +810352869090\n\nMexico: 5255102550\n\nNew Zealand: 0508828865\n\nThe Netherlands: 113\n\nNorway: +4781533300\n\nPhilippines: 028969191\n\nPoland: 5270000\n\nRussia: 0078202577577\n\nSpain: 914590050\n\nSouth Africa: 0514445691\n\nSweden: 46317112400\n\nSwitzerland: 143\n\nUnited Kingdom: 08006895652\n\nUSA: 18002738255\n\nYou are not alone. Please reach out.\n*****\nI am a bot, and this action was performed automatically.", "score": -20, "replies": [{"body": "Bah.", "score": 5, "replies": [{"body": "What if the person on the help line is still advising that I kill myself?", "score": 2, "replies": []}]}]}]}, {"body": "Thanks. Got it and stared listening to it already !", "score": 4, "replies": []}]}, {"body": "Hold to it the ETFs and stocks. Sell CC on them.\n\nWent through 40% down while passively investing in 2009. Same story in March 2020. And still here...  \n\n\n\\[Cliche Edit\\] this prolonged and bumpy down trend really feels like slowly removing a band-aid.... It will pass", "score": 38, "replies": []}, {"body": "Frankly, I’m not coping well. That said, you mention these are ETF and stocks you want to own, so if you were buying and holding them right now you’d be feeling the same pain. Just the way it goes… we have to wait", "score": 19, "replies": [{"body": "Yeah only I actually sold in January to come back later and thought the wheel was going to help me back in slowly while I dca my positions.", "score": 3, "replies": []}]}, {"body": "I've been running the reverse wheel. Short /MES and writing puts against it. It  Helps me generate theta and neutralize my long shares.", "score": 9, "replies": [{"body": "That’s interesting! What delta do you sell that put at?", "score": 1, "replies": [{"body": "I'm not really mechanical with it. I put on two short /MES to mostly neutralize my portfolio deltas and was writing one weekly put around 16 delta. On this last down move I wrote another ~16 delta put to cover my other short put, but wrote this one ~30 days to expiration. \n\nCurrent position:\n\n* -2 /MES @4498\n* -1 4/29 4340p  (-250%)\n* -1 5/31 4120p (-66%)\n\nI'll probably roll the 4340p a week out and keep the strike pretty much where it is at. If we keep drilling and the premium dries up I'll let it cover one of my short /MES. I'm fine going long at these levels. \n\nI'm fine going long at 4120, so I'll let that one sit regardless of what the market does. If we get clarity from the fed and it looks like we have found a bottom before I take assignment from the 4120p I'll just close my short early.", "score": 2, "replies": [{"body": "Hey just wondering how this worked out for you and if your still doing similar?", "score": 1, "replies": [{"body": "IIRC I let the 4340 call away one short /MES and the other put expired just barely OTM.\n\nI currently have a similar strategy on with short /MNQ and writing puts against that, but the /MNQA options aren't as liquid. It has worked \"OK\" for me but my primary profits have been from selling puts as my entry on the shorts hasn't been great. I'm currently waiting on a better entry to write more puts and plan to be a little more aggressive with my strikes.\n\nI'm still happy with the strategy to neutralize delta, but it is very painful to hold through a big rally and not always easy to take off when you should (i.e. when it is working).", "score": 2, "replies": [{"body": "Thanks for the update. sounds like a good way to hedge your long term and still be active selling premium. Have a great day", "score": 1, "replies": [{"body": "If I had it to do over again I would scale into selling calls for assignment, and then sell puts against my assigned short futures. The reverse wheel if you will. I think that would give me better entries and more consistent theta.", "score": 2, "replies": [{"body": "Makes sense, reverse wheel, brilliant, I like it!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "This is a downtrend but it’s not even a crash. Embrace it, know that if you make solid decisions you’ll recover, and try not to worry. Also remember that you don’t need to be active in the market every day. It’ll go up and it’ll come down, you can take a break and sit things out. Just like with work you need to take a break sometimes to keep things in perspective.", "score": 27, "replies": [{"body": ">not even a crash\n\nNot even a crash *so far*", "score": 31, "replies": [{"body": ">Not even a crash so far\n\nBruh, Cramer is bullish. We are *fucked*", "score": 22, "replies": [{"body": "Fucking cramer", "score": 13, "replies": []}]}, {"body": "it is not a crash if we just look at the indexes....\n\nbut many stocks are down 60%+ from their tops already\n\ncan't imagine what 'll happen if SP continues with its \"healthy\" retracement", "score": 4, "replies": []}]}, {"body": "How is this not a crash…", "score": 9, "replies": [{"body": "When in doubt zoom out", "score": 13, "replies": []}, {"body": "you think this is a crash? oh boy", "score": 10, "replies": [{"body": "Crashed is a pretty subjective term but Certain portions of the market are definitely crashing.  Any high growth stocks have crashed. Qs are in bear market and spy is close.  So instead of acting like a seasoned veteran know it all why don’t you just define crash. If it’s 40% then we’ve had one crash in the last 30 years or so.  And certain portions as I’ve stated before definitely crashed already.", "score": 15, "replies": [{"body": "It's definitely a crash but it's my belief that it will continue. There isn't much evidence to suggest the FED hasnt completely fucked us for the next 5+ years.\n\nWe are most certainly entering a recession at best and civil uprising at worst with how bad food inflation is going to get. Gen Zers are just completely fucked when it comes to affording a normal life.", "score": 0, "replies": [{"body": "I mean the fed could easily stop by cooling it with the QT bullshit and just saying we are normalizing rates at a steady and predictable rate.\n\nThat's as opposed to the Helter skelter range they've given of maybe we will do a few .25bp raises, maybe we will come into your house at the middle of the night and burn your piggy bank with a blowtorch.", "score": 3, "replies": []}, {"body": "Civil unrest 🤣\n\nWe saw in 2020 how police quashed protests. The 21st century population has too much bread and circus for any substantial uprising. Riots will peter out after some minor \"victories\" and this bullshit capitalist society will drone on.", "score": 3, "replies": [{"body": "Ok, but 2020 will look like a breeze by 2030.", "score": 1, "replies": []}]}]}, {"body": "I'm not sure why a crash is defined as a single-year event? It's not as if the market resets every Jan. 1.\n\nS&P 500 - \n\n2000... -10.4%\n\n2001... -13.4%\n\n2002... -23.4%\n\n1973... -17.4%\n\n1974.... -30%", "score": 1, "replies": [{"body": "Don’t think anyone ever said it was a single year event. Would assume most people view it from the highs to lows.", "score": 1, "replies": []}]}]}]}]}, {"body": "Love to this type of positive perspective. Stay strong folks. Inthistogether", "score": 1, "replies": []}]}, {"body": "What ETFs and stocks are  you wheeling?\n\nAs to coping, time heals all, especially financial losses. As you age, you will realize the emotional-relationship losses will hurt more and longer.", "score": 6, "replies": [{"body": "Honey  ? Is that you ? 😜\n\nI’m  selling the following  SPY, QQQ, IWM, XLP, VT, VTI, XLF & MSFT, AMD. The following were assigned last week MSFT, AMD & QQQ. I usually sell 30 DTE and a couple of weeklies. CCs depend on the premium and trend at the time.", "score": 8, "replies": [{"body": "You have some good stuff there, Why worried?  I only wheel SPY, QQQ and IWM..  Sleep like a rock every night.\n\nI do not use leverage though.", "score": 8, "replies": [{"body": "All you do is wheel those 3 indexes? Has that worked well for you?", "score": -1, "replies": [{"body": "I think it is acceptable. I am only shooting for 15% a year. 75% of my portfolio is index funds. I consider myself Boglehead ++.  Not trying anything’ crazy like 1% per week.", "score": 4, "replies": []}]}]}]}]}, {"body": "Don’t wheel in a bear market!", "score": 6, "replies": []}, {"body": "My happiness doesn't really depend on my stock portfolio, though getting $3.5k a month from JEPI/DIVO/CDC brings me joy. I also tell myself that I'll be able to \"buy cash flow\" for cheaper. I'm only 30 so I welcome the buying opportunity and will load up while I'm young.", "score": 14, "replies": [{"body": "How do you get $3.5k a month from JEPI/DIVO/CDC  ?\r  \n\r  \nDividend?", "score": 8, "replies": []}, {"body": "How many shares you have of those if you don’t mind me asking? Too lazy to try n calculate lol", "score": 4, "replies": [{"body": "Roughly $200k in each.", "score": 4, "replies": []}]}]}, {"body": "\"What do you do to stay happy?\"\n\nalcohol and light drugs?\n\nAlso working while at your job may help by distracting you a bit...", "score": 10, "replies": []}, {"body": "Just remember you're entering at a better price, and with a premium, than you would have if you had just bought the shares. I'm rolling puts seemingly endlessly for now. Hopefully things will swing back, but if they don't, I'm getting that lower price, and I would've lost a heck of a lot more in the buy & hold position I was in prior to beginning to sell options.", "score": 3, "replies": []}, {"body": "From my instinct, the temporary bottom will set up after the Fed.\r  \n\r  \nThe reversal and rebound will come after the announcement of the CPI .", "score": 3, "replies": []}, {"body": "I would write weekly CCs.  Two standard deviations away down next fifty weeks.", "score": 3, "replies": []}, {"body": "Market is down about 10% and you are down less than that by a few percentage points. Be happy you have outperformed the market. You would be down $30+K in SPY.", "score": 3, "replies": []}, {"body": "Take consolation from me. I was at 400k and held bad stocks all the way down to 140k before taking some losses to offset gains. Now I’m down at 100k. That tax bill I would’ve incurred selling at 400k sure is looking good now.\n\nWish I’d bailed into a house but it wasn’t a good time life-wise, had just moved with my partner to a new city for grad school.", "score": 3, "replies": []}, {"body": "Maybe hedge your trades somehow?", "score": 2, "replies": [{"body": "> somehow?", "score": 1, "replies": [{"body": "Futures, spreads, inflation indexed stuff etc...", "score": 1, "replies": []}, {"body": "I’m looking into it but I don’t know how to do it yet", "score": 1, "replies": []}]}]}, {"body": "Learn from the experience.  What is your overall portfolio delta?  Is it too long?  Maybe manage it so that it's more neutral.  Maybe even negative delta.  \n\nTrading options allows you to be in much more control than simply buying and holding.  If all you do is the wheel then you miss out on opportunities to fine tune your strategies more and actually match how you feel about the market.", "score": 2, "replies": []}, {"body": "Start a you tube channel telling people how you can beat the market Wheeling...", "score": 2, "replies": []}, {"body": "Hmmmm\n\nMaybe not use margin", "score": 2, "replies": []}, {"body": "I have learned a lot in the past four months! \n\nIt sucks, but I will live.", "score": 2, "replies": []}, {"body": "I think people are short sided with the wheel, remember you want to buy stocks you want to own. As the market dips you are going to want to stay well below, then when there is a stock correction you get the stock you wanted at a good price. Remember you want to build a big ass pile of stocks at a good price so when the market rebounds in 2-3 years you ride that up. Rinse and repeat until retirement when you dump it all in QYLD as income lol", "score": 2, "replies": []}, {"body": "Don’t just sell options indiscriminately. Treat them like a trade: sell high and buy low. \n\nThat means, only sell puts after a downtrend in the underlying near what you think will be support. Don’t forget the tenet that you need to wheel stocks you are generally bullish on. \n\nIf/when assigned, either wait for the end of an uptrend to sell the calls, or sell ITM calls if you think there is more downside risk.", "score": 2, "replies": []}, {"body": "I don’t understand why so many new investors are in margin. I have a feeling this is going to end badly for a lot of people.", "score": 4, "replies": [{"body": "Not sure what this has to do with the psychology of an investment or how you came to this conclusion. I’ve been in the green and red for quite some time and got burned in the past but never went through a real bear market. The COVID crash was much steeper and less painful overall than being slow cooked 😝", "score": 5, "replies": [{"body": "I think psychologically you’re going to suffer more because you’re putting yourself in a dangerous position due to the increased risk you’re taking on.", "score": 8, "replies": [{"body": "I see what you mean. I probably shouldn’t have mentioned margin in the beginning as I have the means to cover if needed, it’s just a different portfolio.", "score": 1, "replies": [{"body": "Why be on margin rather than transfer money to that account? Don’t you have margin interest rates to pay?", "score": 2, "replies": []}]}]}]}]}, {"body": "Don't wheel", "score": 2, "replies": [{"body": "I can’t slow down", "score": 4, "replies": [{"body": "I can't let go but I can't hang on", "score": 2, "replies": []}]}]}, {"body": "Running the Wheel on UVXY since March , it’s been a great hedge so far. Took assignment on the 14th, slightly negative. Now I’m up 9 grand", "score": 2, "replies": []}, {"body": "I wheel BECAUSE it works in any market. I don't look at my unrealized movement, only my cash/realized gains. Pick safe stocks and have fun gaining cash.\n\nIf you're in this much pain wheeling, imagine I'd you did any other strategy that relies on a neutral/bull market", "score": 1, "replies": []}, {"body": "i’ve been wheeling SQQQ and SARK - so far it’s printing", "score": 1, "replies": []}, {"body": "Down 15k on a 300k acct is only 5%.  If u feel market has more down side then take the loss and sit back in cash and wait till u feel comfortable going back in.", "score": 1, "replies": []}, {"body": "I  pictured a bear spinning in a wheel like a hamster when I saw the title :)", "score": 1, "replies": []}, {"body": "Don't wheel in a bear market.", "score": 1, "replies": []}, {"body": "I listen to music", "score": 1, "replies": []}, {"body": "Ride dirt bikes and drink beer and go hike with my wife and play frisbee with my dog", "score": 1, "replies": []}, {"body": "You're less likely to get stuck with a stock position if you always sell as close as possible to the money. You'll also get bigger premiums.\n\nOf course, your puts will get assigned a lot more often, but your calls will get you out a lot more often too.", "score": 1, "replies": [{"body": "Actually my strategy is far OTM, around 0.100 delta if not smaller. Imagine how far down we have been :)", "score": 1, "replies": []}]}, {"body": "The market is going to go down, then up. But when up? Who knows. Save some powder when it goes down. I’m pretty much out lol. Hopefully some ccalls will give me breathing room", "score": 1, "replies": []}, {"body": "Reverse wheel", "score": 1, "replies": []}, {"body": "I work overtime and continue to write CSPs. \n\nIt sucks but avoid your gut. If your plan is still sound, stick to it and spend some time either working or in a passionate hobby.\n\nI like to play bass.", "score": 1, "replies": []}, {"body": "Weed helps", "score": 1, "replies": []}, {"body": "Well i’ll argue that you are doing ok…let’s say that sp500 is down 50% from ATH in 6 months and you are down only 30%… you switch from theta gang to buy low sell never strategy and you basically won capitalism until you retire!", "score": 1, "replies": []}, {"body": "Define your risk and limit how much you lose.  \nSo you can just set it and forget it (for a little while anyway)  \nI use this tool to save my money and sanity: [Olive Invest](https://o.oliveinvest.com/welcome-reddit)", "score": 1, "replies": []}, {"body": "Drugs", "score": 1, "replies": []}, {"body": "Wait, so you are down less than 10% or am I reading it wrong?  Less than the overall market and you are scared, lol.  As others have said, learn to live with the losses until they come back.  Many more people have lost more than 10%; the QQQ alone is down 20%!  You should be grateful and lucky that you are down only that.", "score": 1, "replies": []}]}
