{"title": "[deleted by user]", "selftext": "[removed]", "id": "ufa45k", "created_utc": 1651321805.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 84, "comments": [{"body": "Sounds good random Reddit person", "score": 161, "replies": [{"body": "Am guy who knows about stuff with credentials and many experience.", "score": 23, "replies": [{"body": "![gif](emote|free_emotes_pack|joy)", "score": 6, "replies": []}]}, {"body": "Right we've never printed trillions of dollars and gave it away to everyone either before. Everything might go to shit and stay there for long time. Down 150k in 10 ten days I'll worry if want to OP fuck the look back in 20 years bullshit", "score": 9, "replies": [{"body": "Down about the same in 10 days, even more in options to make up for the -20 k daily’s..", "score": 2, "replies": [{"body": "Same I didn't even include my option losses. Fuck  Jerome Powell also soft landing my balls it's going to be jump off a ten story building onto the asphalt type landing I just know it is starting now.", "score": 2, "replies": []}]}]}, {"body": "Yeah", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Plot twist:. This is your advisor.", "score": 7, "replies": []}]}, {"body": "This post out here trying to convince you to be the exit liquidity. It's crashing, though yes, people shouldn't panic.\nIt regains its value over time, all good.\n\nRemindME! 6 months \"market won't crash\"", "score": 25, "replies": [{"body": "I will be messaging you in 6 months on [**2022-10-30 12:51:24 UTC**](http://www.wolframalpha.com/input/?i=2022-10-30%2012:51:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/ufa45k/stock_market_is_not_going_to_crash_and_people/i6s9dda/?context=3)\n\n[**18 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fufa45k%2Fstock_market_is_not_going_to_crash_and_people%2Fi6s9dda%2F%5D%0A%0ARemindMe%21%202022-10-30%2012%3A51%3A24%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ufa45k)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 8, "replies": []}]}, {"body": "Quit trying to sooth the sheep.  I'm over here waiting for them to panic so I can buy. JK.", "score": 35, "replies": [{"body": "You’re kidding, I’m not. I want to buy at lower prices. Let it rip!", "score": 8, "replies": []}, {"body": "honestly, I wouldn't mind an additional 15% discount", "score": 4, "replies": [{"body": "Give it a week", "score": 1, "replies": []}]}]}, {"body": "Op: \"economy is good\"\n\nEconomy: (shrinks 1.4% instead of growing 1.1%)", "score": 12, "replies": [{"body": "“Consumer spending is at a high level” as inflation surges the most in decades. OP should be hoping for a crash. I believe that’s the only thing that will slow down the fed. They have no reason to take their foot off the gas as long as the market continues it’s orderly sell off and consumer spending keeps driving inflation.", "score": 2, "replies": []}]}, {"body": "Hate to break it to you, but we’re right in the thick of it.", "score": 9, "replies": []}, {"body": "How much dope did you smoke?", "score": 10, "replies": []}, {"body": "Is OP Jim Cramer?", "score": 19, "replies": [{"body": "Bear Stearns is fine, netflix is a buy", "score": 7, "replies": []}, {"body": "He needs to stay of the cocaine", "score": 2, "replies": [{"body": "u/shitdealonly Jim? Is that you?", "score": 2, "replies": []}]}]}, {"body": "The futureman has spoken we can now put our money back in the market", "score": 18, "replies": []}, {"body": "Someone sounds like they are worried, sitting too heavy on their buy in cost, and needed to post for getting some feedback to ease their nerves. Without knowing your current position, then you’re probably fucked. We’ve not gotten to the actual worst of it.", "score": 7, "replies": []}, {"body": "Awe shit.  Loading up on puts next week", "score": 12, "replies": [{"body": "Sark", "score": -1, "replies": []}]}, {"body": "I look forward to the day when the fed doesnt inject liquidity into the markets when they do crash.", "score": 11, "replies": [{"body": "You'd have to look backwards to see that", "score": 4, "replies": []}, {"body": "+1", "score": 1, "replies": []}]}, {"body": "40-year bond bull market and 20-year Fed put may both be dead, but markets will keep charging higher? Could be, but far from a certainty.", "score": 5, "replies": [{"body": "There's nothing stopping another Fed put.", "score": 1, "replies": [{"body": "Nations will stop buying t bonds if qt isn't implemented, which hasn't even started yet.\n\nFeds number 1 focus is making their balance sheet better, not worry about the stock market", "score": 1, "replies": []}, {"body": "You realize the Fed hasn't had to deal with any meaningful inflation the entire time the \"Fed put\" has been a thing right?", "score": 1, "replies": []}]}]}, {"body": "I like how you posted a bunch of former market leaders crashing as “proof” the market will not crash.", "score": 9, "replies": [{"body": "Market can't crash because it already has.\n\n\\*Taps forehead\\*", "score": 1, "replies": []}]}, {"body": "Hmmmmm 🤔", "score": 4, "replies": []}, {"body": "Did the market tell you that?", "score": 3, "replies": []}, {"body": "Consumer confidence is at a 40 year low though IIRC, and it is one of the early indicators of what the economy is gonna be doing..", "score": 3, "replies": []}, {"body": ">Historically, every downturn has been a great buying opportunity.\n\nunless we turn into Japan and the major US stock indexes are underwater for 30 years...", "score": 6, "replies": [{"body": "That’s why DCAing is so important but you’re right. I hope we take immigration reform seriously, because without it, our country may very well have the same problem as Japan, with a declining population threatening economic growth.", "score": 1, "replies": []}]}, {"body": ">everything is fine\n\nMore than 8% inflation and the coming world wide wheat shortage due to the Ukraine Crisis, disagree. \n\n&#x200B;\n\n>and there is nothing to worry abou\n\nThere are always things to worry about.\n\n&#x200B;\n\n>it's not going to crash\n\nHow do you know? there might be a crash, there might not be. \n\n&#x200B;\n\n>economy is good, unemployment is at record low rate, and consumer spending is at high level\n\nA lot of the economy is struggling and while unemployment rate is low, labor participation is also down. As there is inflation of course consumer spending is at a high level. \n\n&#x200B;\n\n>stock market is not going to crash, and people need to stop panicking and calm down\n\nIt is never a good idea to panic, but you can't know if it crashes or not. One have to position their portfolio against those tail events. \n\n&#x200B;\n\n>Historically, every downturn has been a great buying opportunity.\n\nExcept in 1929, or 2008 (when bear stears went bankrupt) or in Japan. You never know how low a downturn can go. So you need to adjust the portfolio and how you buy into it (DCA or something else)\n\n&#x200B;\n\n>And this looks to be no different.\n\nHow do you know? If the FED and the ECB adjusts interest rates to quell inflation, it could easily be a 50% drop. \n\n&#x200B;\n\n>\"be greedy when others are fearful\", \"buy when there's blood in the streets\"\n\nThe S&P500 is down 13% from ATH and there are many unprofitable companies that are still valued insanely. There is not a lot of blood on the streets at the moment. \n\n&#x200B;\n\n>here is the proof\n\nA nice some charts. What does that tell me about the future macro environment?\n\n&#x200B;\n\n>if you go 20 years in to the future, this will look nothing but a small dip and a minor correction in the grand scheme of things\n\nOr we can have 15 years of 0 returns.  From 1929 until the 1950s you would have 0 returns. Same from 1969-1981, 2000-2009. Sure it can be a small dip - but given all the current events it might not be. \n\nThe thing is that no one knows. One just needs to have good diversification (international etc) and across different asset classes.", "score": 5, "replies": []}, {"body": "Gotta love the alternating posts of markets crashing followed by we’ve hit the bottom buy buy buy. I tend to find Reddit sentiment overly bearish right now, but the stark contrast and total certainty on either side is crazy to see", "score": 5, "replies": []}, {"body": "Found Cathie’s account", "score": 2, "replies": []}, {"body": "Infact, I got calls for next week", "score": 2, "replies": []}, {"body": "It's not gonna crash? Wait till I buy on Monday", "score": 3, "replies": []}, {"body": "I see unemployment at a record low as a big problem. I still hear every day supply chain issues do to lack of labor. If we can’t get more people to work and resolve supply chain issues prices will continue to run up unchecked regardless of what the fed does. I’m under the impression the fed has no control over this inflation. A study I read months ago interviewed like 5k people and something like 6% of respondents said they wouldn’t work again due to money made from cryptocurrency. Also think about the influencers and other tech jobs out there. Boomers are retiring from manual labor jobs and no young people want to replace them because of the stigma around blue collar work. Your told all the time as a young person to go to college so you don’t end up doin go those jobs. But somebody needs to or the supply chains will not recover. I think it’s a people and society issue the fed is trying to fix with monetary policy. I think it will get worse before it gets better but that’s just my .02.", "score": 3, "replies": [{"body": "The whole “go to college, blue collar bad” schtick we were told, really did have unforeseen consequences. Now every millennial and zoomer has a useless bachelors and a lot of debt.\n\nETA: by the time I was in HS, the late 90s, they had already removed auto mechanics and other blue collar courses from my school and replaced it with computer graphics etc. I remember I wanted to take auto mechanic class so bad but it was dropped the year prior.", "score": 9, "replies": [{"body": "I work for a global company with manufacturing plants all over the world I’m in New England . They have lowered the requirements for people apply so much I think all you need is a pulse. They still cannot hire enough people. The lowest paying job is $20/hr and it goes up significantly from there with good benefits. I’ve heard rumors of the company trying to recruit from Puerto Rico and get people to move to New England to fill the jobs. It’s a shit show. Decent jobs making good money that nobody wants to do.", "score": 3, "replies": []}, {"body": "Agree. Late 90s HS kid here too. I was told “I had too much potential” to attend the local trade school for automotive after I’d asked to transfer there in my Jr. year. I had zero motivation to attend college and ended up dropping out, got my GED and found a entry level job as a lube tech. I’m now a shop foreman with entirely on the job training and no formal schooling for automotive. \n\nEven employee applicants we get that do have some sort of formal automotive schooling tend to be missing some key skills and work ethics to succeed in this industry right now. The education system itself for blue collar is a racket, like all these now-defunct scam trade schools that over promised job placement after graduation and didn’t train for real world situations. \n\nNot to mention how techs, really the only position in a dealership that directly generates income through labor, are always the first to get screwed in policy and pay changes. Not only is the job difficult, stressful, and life-consuming, it’s barely worth doing financially. Well, not if your honest or have some semblance of a life outside your toolbox. \n\nWe can’t find decent, experienced techs. We have a shop full of entry-level people that our experienced guys are helping out, but that just adds more burden on them. They’re not paid to train people, only fixing incompetently engineered cars for impatient customers who don’t understand or care how the industry works. \n\nYeah, unemployment is low, but it’s seems to me to be by people who are unqualified or are just starting out in careers. It’s a *production* problem. We could run this shop with 1/4 the amount of techs if they where all seasoned vets, but those don’t exist at the moment, so we bumble through the weeks, fixing mistakes, dealing with delays, and doing mostly everything except getting the cars out the door in a timely fashion and repaired properly. \n\nI don’t know much about macroeconomics, but if you set up your education system for wrote memorization to regurgitate information back on a test, then those problem solving skills required for diagnosis and repairing accurately for those blue collar positions don’t exist. Hell, I had a new guy ask yesterday me how to do a simple job when he had the step-by-step instructions and the exploded diagram right in front of him. \n\nWe don’t have an “employment” problem, we have an “employee” problem. A shop like mine filled with 50 idiots isn’t going to be a productive, and therefore profitable, as a shop filled with 5 motivated and experienced techs. So the “unemployment” rate is meaningless to me. I’m sure I’m not the only one seeing this down here in blue-collar land.", "score": 3, "replies": []}]}, {"body": "With big gain in retirement , crypto and meme portfolio many are reluctant to work . Once we see portfolio crashing and inflation many will be back to work. I already got email from some early retirees that they want to extend exit. Got calls from builders for offers on new construction houses (last year people were camping outside same builders). While yes u will see slowdown the flash crash is too early. It should go up again and slowly go down. There is still lot of uninvested cash in market.", "score": 2, "replies": []}]}, {"body": "If I give you some money to invest for me, how much returns do you guarantee?", "score": 1, "replies": []}, {"body": "Bwah ha ha ha ha", "score": 1, "replies": []}, {"body": "If it does I'll definitely be jerking it to those red bars", "score": 1, "replies": []}, {"body": "Username checks out", "score": 1, "replies": []}, {"body": "Remind me 6months!", "score": 1, "replies": []}, {"body": "Reversion to the mean, nuff said", "score": 1, "replies": []}, {"body": "So panic it is", "score": 1, "replies": []}, {"body": "We’re already on this ride.", "score": 1, "replies": []}, {"body": "RemindMe! 72 hours", "score": 1, "replies": []}, {"body": "Spoken like a true politician.", "score": 1, "replies": []}, {"body": "I’m happy for people like you to have this opinion. You’re exit liquidity for everybody else.\n\nSee you when the NASDAQ is 5,000.", "score": 1, "replies": []}, {"body": "Trust me bro", "score": 1, "replies": []}, {"body": "Ah satire", "score": 1, "replies": []}, {"body": "I mean it may crash but hopefully too many don’t panic. Fortunate enough to not have invested more than what I can afford to lose. Hoping I can continue to DCA while it’s down.", "score": 1, "replies": []}, {"body": "It might though", "score": 1, "replies": []}, {"body": "I trust you bro", "score": 1, "replies": []}, {"body": "OP just made a post for calming his confirmation bias \n\n\n\n \nI’ll try that too", "score": 1, "replies": []}, {"body": "\"buy when there's blood in the streets\"\n\nThe market hasn't even been cut yet.  There's no blood.", "score": 1, "replies": []}, {"body": "Lot of scared replies on here. Yes we could go into a much larger crash and a 10+ year bear market… but that’s the case in every correction, and statically most bounce back without a recession.\nSeems like most on here are just fearful when others are fearful.", "score": 1, "replies": []}, {"body": "What are your qualifications? Turns out a 21 year old humanities major is giving advice on how the stock market works. A 21 year old any major wouldn't be qualified here tbh.", "score": 1, "replies": []}, {"body": "Unemployment numbers will be out Friday, GDP has dropped, let’s see what dawg Powell has to say first..", "score": 1, "replies": []}, {"body": "What exactly do your pictures prove, besides most of them looking like a bubble with much more room to fall to revert to mean?", "score": 1, "replies": []}, {"body": "Even if it does. AMERICANS ARE INCORRIGIBLE. It's something I've accepted. No matter how deep in the shit we get we're willing to dig a little deeper for some bullshit.", "score": 1, "replies": []}, {"body": "Fed going to crush demand at some point it won’t be with the .5 rate hike next week so I see a rebound after fomc meeting unless they raise it by .75 then we fuk", "score": 1, "replies": []}, {"body": "Aight. I'll put $100 on it", "score": 1, "replies": []}, {"body": "Automatic DCA purchase on monday - fingers crossed sentiment is going down a little bit further over the weekend :D.", "score": 1, "replies": []}, {"body": "nasdaq down 22% this year. you can call it whatever you want, I call it a crash. -4,5% on friday, so still running.", "score": 1, "replies": []}, {"body": "100s of stocks are naver going to see their highs ever again. Valuations were crazy, 100 mutiple of revenue.", "score": 1, "replies": []}, {"body": "It's not going to crash, but it's going down 50% next month. Lol", "score": 1, "replies": []}]}
