{"title": "What could be next signal to end this dead cat bounce?", "selftext": "I did not buy QQQ at 270, today it is trading at 320.\n\nI thought the missed earning season, higher than expected CPI or negative GDP growth could end the dead cat bounce. But the market continued rising.\n\nWhat are some bad news in the future that could end this irrational dead cat bounce?\n\nOr should I just be patient? 2008 crisis also saw a pretty good bull run before it reached new low.", "id": "wfgae5", "created_utc": 1659556490.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 42, "comments": [{"body": "TLDR; The Stock Market does not represent the economy and is very volatile and unpredictable in the short-run.\n\nThis whole recent time period  is a good representative of how impatient and reactionary people are. A couple red days means 2008 and 1929, a couple green days means 2019 and \"this is the bottom\". Truth is, no one has a clue what's going to happen. \n\nWith that being said, there's a lot of negative economic indicators that we're seeing now and in the near future. The July CPI is set to be released on August 10, 2022, and if the report is worse than estimated, that could spook the markets. Consumer sentiment is also at a record low, and I'm not sure how that could get marginally better any time soon. Even the \"good\" news about the economy should be taken with a grain of salt.  At 3.6% currently. the unemployment rate is misleading because of how many people left the workforce in 2020. The rates will likely climb as companies issue layoffs and trim workforce due to recession fears. Earnings season has been good so far, but a lot more weight should be put on Q3/Q4 earnings to actually access the current state of companies/economy. In other words, a lot of the \"good news\" are lagging indicators that could quickly change. \n\nSo basically the market is going up because of better than expected earnings season, jobs reports, and rather soft-stance by the FED on inflation (and alleged belief that they will pivot). We will have a better understanding of everything in the months that follow.\n\nVery few people will predict the markets correctly, while most will lose big attempting to do so. The \"correct\" decision is to just keep putting money in weekly/monthly and you'll be fine long-term.", "score": 16, "replies": []}, {"body": "This is still the dead cat bounce from the bottom of the 1929 great depression. It will only last another few hundred years and then it will crash hard", "score": 57, "replies": [{"body": "Ah yes, the 100 Year Bear Market Rally I've been reading about so much", "score": 11, "replies": [{"body": "under-upvoted comical reply - not sure how I ended back on this thread, but since I'm back might as well post here to write that", "score": 1, "replies": []}]}]}, {"body": "I have no idea of this is real or not.  \n\nBut something people don't talk about when it comes to inflation is, if you have savings and the stock market is going down you're winning. \n\nIf you have cash and the stock market is going up you are losing big time. \n\nThere is a lot if incentive in this inflationary period to park your money somewhere that will give it some protection.  \n\nInflation should ultimately also inflate the value of most stocks.", "score": 14, "replies": []}, {"body": "What makes you so certain this is a dead cat bounce? Earnings have looked surprisingly good overall", "score": 33, "replies": [{"body": "> What makes you so certain this is a dead cat bounce?\n\nHe want his puts back. Retail investors on reddit  are having a meltdown right now because they thought the market had a switch that is flipped depending on the current state of the economy.", "score": 32, "replies": [{"body": "Touché lol", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Oil dropped to $90 though, is a major input to inflation.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">plus he kissed some Saudi arse for some help.\n\nok but if it works it works, Trump did it too\n\nPowell is a Republican that was appointed by Trump so...", "score": 5, "replies": [{"body": "And the Saudis said they won’t increase supply..slap in the face to Biden admin and recent visit", "score": 3, "replies": [{"body": "well +100,000 barrels a day, yea just a token, our local production will be up to 13 million barrels by next year maybe they are worried about flooding the market like trump did. idk, guess I don't blame them, probably for the best for our local production so they don't get to shy about over producing\n\nIt's amazing that a 1% percent change in oil production can change the price by $50 a barrel, delicate balance", "score": 1, "replies": [{"body": "It's like the stock market. The marginal trade determines price, no matter how many outstanding shares exist.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "a ton of names have been killed here. This bounce is just a lack of forced selling and folks running for the hills. These rallies can go on much longer then feels right. For the last 4-5 years its been V runs once things turn. Wouldn't surprise me if it happens again. Just be patient - there will be big down days and if this is/was the bottom you'll get opps to pick up stuff. Just know your pitch and don't chicken out when it comes around.", "score": 13, "replies": [{"body": "Best comment", "score": 1, "replies": []}]}, {"body": "If people think this bottomed out and we are now trending for a bull market u are sadly mistaken…spending is still crazy high and so much info still pending regarding interest rates, unemployment rate, wars, and monkeypox…", "score": 3, "replies": []}, {"body": "People are still buying on credit cards, lots of “revenge holidays” and crazy spendings. The consumption is still too high and might take couple more months for the awaking (the effect of rate hikes). \n\nOn the other hand companies are more realistic and reducing employees already…", "score": 5, "replies": [{"body": "Yup spending is still crazy high im guilty myself. Been spending way too much on unecessary purchases these past few months. Even in my area of work a lot of consumers dropping large amounts", "score": 2, "replies": []}]}, {"body": "Yeah I feel sorry for all the \"I can't take it anymore\"  posts last month who sold out because \"obviously it's going to keep going down why hold\".", "score": 5, "replies": [{"body": "aka 'capitulation'.  \"Bull market's back on the menu, boys!\"", "score": 1, "replies": []}]}, {"body": "Just got back from $COST. On the last earnings call, when asked if there would be a lag between $COST seeing lower costs and lowering prices in-store, mgmt got po'd and said they'd be the FIRST retailer to lower prices.\n\nBeen a member since 1987 and know the 3 stores in my area like the back of my hand. I can unequivocally say there have been absolutely NO price reductions at $COST. Absolutely nothing has come down in price in the last month ex seasonal clearance items. \n\nTake this as anecdotal if you want, but food costs aren't coming down", "score": 2, "replies": []}, {"body": "This is the start of a new bull market...", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I don’t know why so many people against DCA, it truly is the perfect strategy for dealing with uncertainty in markets. I don’t know what next month brings, but if I buy some today then if it went up at least I put something in, if it goes down at least I didn’t put everything in. I don’t know why so many people try to make it an all or nothing in or out thing.", "score": 3, "replies": [{"body": "If your holding for the next 3-5 years DCA right now is the golden strat unfortunately its just still too unpredictable for most ppl. Wars, monkeypix, inflation just to name a few..", "score": 2, "replies": []}]}]}, {"body": "That is a good plan. Markets do not move in straight lines, and the Q's will pull back for an entrance. And DCA'ing in would be a very smart move.", "score": 1, "replies": []}]}, {"body": "QQQ will hit $350 first before hitting 270 again", "score": 2, "replies": []}, {"body": "There is nothing irrational about the recent bounce .\nMost of the economic news has been positive. \nMany companies have shown solid financial results .", "score": 2, "replies": []}, {"body": "Earnings have been far better than expected.", "score": 2, "replies": []}, {"body": "Really waiting for inflation and watch unemployment data.  Summer has tradtional a quiet time for stock market until September.\n\nNext inflation could be slightly improving from reduced energy cost.  But we are using borrowed reserve.", "score": 1, "replies": [{"body": "Energy isn't part of core CPI, which incorporates rents, which are still rising. It's the beginning of August, so only 7/12 of renters have had their rents raised this year (assume yearly contracts).", "score": 2, "replies": []}]}, {"body": "The jobs report out at 8:30am (ET) tomorrow could be the catalyst that starts to bring the market down. Consensus is that it will show higher unemployment numbers, and that combined with the 2 quarters of negative GDP growth leans more towards this being considered a recession. The market will react negatively to that. My guess…..a down day tomorrow. Then, next Wednesday is the inflation number. If that comes in higher than expected, the market will really tank.", "score": 1, "replies": [{"body": "It’s really a double edged sword here.\n\n- lower or equal to last report will signal Fed about to go hard\n\n- more unemployment will show that the recession is a recession and no propaganda can fix it\n\nEither way, a soft landing is looking unlikely.  Inflation is going up despite commodities falling.", "score": 1, "replies": [{"body": "Yeah, if you think a bad jobless claims is going to have a serious negative effect, you don't understand one of the reasons why the Nasdaq in particular has been as much as 20% off its lows.\n\nI get why in not really feeling it because it's a dirty reason (recession, yay! let's pivot to what worked in a slower growth environment!).\n\nMy thought was actually that we see that payrolls are still fine for July, so yields spike and it hurts the Nasdaq, but we saw that happen with June early in July, and the result there was just a 3.3% drop that took place later and happened over multiple days (well, it was a bit more on an intraday basis).\n\nWhat really may need to be looked for is to see if the S&P distributes for a 2nd time here.", "score": 1, "replies": []}, {"body": "The market just wants to go up rn. No matter what the numbers are, the market will spin them positively by the close, esp by people who think they missed the start of a \"new\" bull market.", "score": 1, "replies": []}]}]}, {"body": "People suddenly learning how to value a business?", "score": 1, "replies": [{"body": "That is a lost art. And I guess it's not surprising, since negative real interest rates have made every player a winner.", "score": 1, "replies": [{"body": "Absolutely not lost there's just those who know and those who don't. And those who don't, don't really matter until there's a bid on overpriced assets at the margin, then it turns into a FOMO feeding frenzy.\n\nHappens every 20 years or so.  50s,70s,late 90s and now late teens.\n\nIn the 70s it was coke and McDonald's and Kodak and xerox trading at 45x earnings.\n\nIn the 90s it was dotcom\n\nSame shit different names.  People are inherently lazy and ignorant and overconfident too.   Turns into what you are seeing here now. Won't be the last.", "score": 2, "replies": [{"body": "I remember using a stock screener to find a short-line railroad in the midwest with low PEs and an attractive dividend. I bought it as a widows and orphans sort of stock, and it flew profitably under the radar for me for years. I held it until I saw a more attractive opportunity. The shares even rose a little, but it was, of course, never a crowded trade. I don't know what it's fate was, but it was a good, solid investment in the tradition of getting rich slowly.\n\nYou're right, of course. The market cycles through these waves of extreme valuations and then washes out (and sometimes wiping out) those who thought investing and speculating were the same thing.", "score": 1, "replies": []}]}]}]}, {"body": "Only time will tell if it is a dead cat bounce or a real bull market. But I feel that 10y should go higher before we have another melt down. Both bond market and stock market simply don't believe the fed when they say they are not going to pivot before inflation is down.", "score": 1, "replies": [{"body": "If the Fed pivots too soon, then has to raise to battle inflation some more, they set up the expectation that they won't be serious the next time.", "score": 1, "replies": []}]}, {"body": "SQQQ. You should consider liquidating your net worth and go all in", "score": 1, "replies": []}, {"body": "I keep saying this and I’m going to keep saying it.\n\nPeople expected the FED to act more hawkish than they did with the 75bp. Since they’re more dovish than people expect markets are up. That doesn’t mean we’re out of the woods. The FED doesn’t actually have a solid plan and they’re mostly playing this by ear. They may end up needing to be far more hawkish, depending on CPI numbers in the coming 2 months. Next FED meeting will be telling.\n\nSide note conspiracy time:\nEveryone knew the FED was going to raise rates and markets sold off accordingly. I personally believe there’s something scummy going on. 75bp isn’t enough to tackle this sort of inflation, not by any opinion of reasonable economist that I’ve researched. I think they were swindled into raising rates less than they should, knowing the markets would buy back up, and the swindlers positioned themselves accordingly. Everyone in politics is bought, even the FED.", "score": 1, "replies": []}]}
{"title": "DD: Cramer says ASTS is not a buy. Calls on ASTS", "selftext": "[deleted]", "id": "wew59o", "created_utc": 1659498719.0, "score": 51, "upvote_ratio": 0.91, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|19|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wew59o)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wew59o)", "score": 1, "replies": []}, {"body": "Cramer is bullish on STDs", "score": 15, "replies": [{"body": "Long STDs short Condoms.", "score": 6, "replies": []}]}, {"body": "Remind me in 1 month when everyone is fomo-ing at 60 dollars", "score": 13, "replies": [{"body": "And one year at 120.", "score": 7, "replies": []}]}, {"body": "I have a ton of ASTS and this post just told me everything I need to know.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Dude I was falling asleep as I posted this. I don’t argue that it does asts justice at all. People really interested will come check us out at r/astspacemobile and read what catse and others have to say. They know way more than I do. This is for the smooth brains who will pay attention now that Cramer is throwing shade our way. \n\nAsts is a game changer. A paradigm shift for the industry. American tower sees it as a threat, so they made the wise decision of buying in. Want a potential 20x return in the relatively short term? Asts is the best bet on the market right now.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Another 7 points today and more after hours. Here we go 🚀", "score": 3, "replies": []}]}, {"body": "This aged exactly how we all thought it would. ASTS up about 20% since this post. 🤣", "score": 5, "replies": [{"body": "It never fails. To the moon we go! Well, to orbit at least…", "score": 3, "replies": [{"body": "I’ll take low earth orbit but prefer the moon", "score": 3, "replies": []}]}]}, {"body": "my calls are up 400% today, 1/20/23. i have theta to spare, im hoping the run keeps going😬", "score": 4, "replies": []}, {"body": "Same with $PSNY but there's actually good DD to go with it.", "score": 1, "replies": [{"body": "there exists plenty of good DD on ASTS, maybe not in this post though, not to mention analyst PTs of around 30$. Early stage still so give it time, but a very solid company (might be biased, have held shares for like 2 years lol)", "score": 6, "replies": [{"body": "I did this DD and then we popped 4%, what do mean it’s not good DD?\n\nUpdate: 7%", "score": 2, "replies": []}]}]}, {"body": "We get it inverse Cramer. So funny", "score": -5, "replies": [{"body": "Up 4% today. It wasn’t a joke.", "score": 6, "replies": [{"body": "7% baby", "score": 6, "replies": []}, {"body": "The whole market is up and even more bigly than this trash.  Lmfao", "score": -4, "replies": [{"body": "'this trash' he says about a company that is about to revolutionize global mobile broadband and enable communication for billions who don't have it with no competition for years. I see you did your DD.", "score": 9, "replies": [{"body": "It’s like I’m trying to give him money and he won’t take it.", "score": 9, "replies": []}, {"body": "Yes let me do DD on all the trash that some pinhead posts on WSB, with an inverse Cramer as DD 🤣🤣🤣🤣", "score": -2, "replies": [{"body": "That statement is more retarded than the inverse Cramer shit is. Just because it's in an inverse Cramer post doesn't mean it's necessarily bad.", "score": 4, "replies": [{"body": "What's regarded is your reading comprehension", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It's regarded for a reason LMFAO", "score": -1, "replies": [{"body": "Do yourself a favor and pick up a few shares. You can thank me later. Then go back and troll the clowns over at antiwork.", "score": 1, "replies": [{"body": "Actually incredible that retard thinks in common conversation regarded has a bad connotation. But then again all the other shit that retard said was pretty retarded too.", "score": 2, "replies": []}, {"body": "Nah", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Listen, I get numbers are hard, but the S&P is up 1.3% right now. ASTS is up 7%. 7 is a bigger number than 1.3.", "score": 7, "replies": [{"body": "The whole market does not mean S&P alone.  And S&P being up 1.3% equates to individual stocks being up 5% minimum.  Tell me you have no clue without telling me you have no clue.\n\n\"Hurr duuurrrr inverse Cramer, gimme updoots\"\n\nBeat the dead horse more 🤣🤣🤣", "score": 0, "replies": [{"body": "There are some stocks up 5% today, some are down. Point is that ASTS is drastically outperforming the market today. You can’t deny that. Get some folds in your brain brother.", "score": 6, "replies": [{"body": "Keep moving them posts.  Hurr durrr cramers", "score": -1, "replies": [{"body": "You said “the whole market is up even more bigly than this trash.” That’s demonstrable false. Asts is outperforming the market today. I scored on you on your original goalposts, no need to move them!", "score": 3, "replies": []}]}]}]}]}, {"body": "😏😏😏", "score": 1, "replies": [{"body": "1000% from last week on AMC and BBY calls.  Glad I'm living rent free in your head 😬👍", "score": 0, "replies": [{"body": "Proof or ban.", "score": 1, "replies": [{"body": "Rent free", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "wf1wrj", "created_utc": 1659518589.0, "score": 235, "upvote_ratio": 0.88, "num_comments": 44, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|20|**First Seen In WSB**|1 month ago\n**Total Comments**|490|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wf1wrj)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wf1wrj)", "score": 1, "replies": []}, {"body": "Nah because at least those jeans are doing it’s job", "score": 36, "replies": []}, {"body": "Inflation ain't transitory and I'm lovin it.", "score": 27, "replies": []}, {"body": "How you even put it on ![img](emote|t5_2th52|4271)", "score": 18, "replies": [{"body": "With home made…. Glue", "score": 10, "replies": [{"body": "![img](emote|t5_2th52|4275)", "score": 5, "replies": []}]}, {"body": "On my face.", "score": 27, "replies": []}, {"body": "Paint.", "score": 3, "replies": []}, {"body": "Dude... You stick it in .... All the way!!!!", "score": 2, "replies": [{"body": "That's how new markets are made.", "score": 2, "replies": []}]}]}, {"body": "No problems detected", "score": 4, "replies": []}, {"body": "if she ever sits down...", "score": 5, "replies": [{"body": "Stock split? XD", "score": 9, "replies": []}]}, {"body": "Ahead of the curve", "score": 9, "replies": [{"body": "At least until the next shart", "score": 3, "replies": []}]}, {"body": "i don't want inflation contained, anymore.", "score": 8, "replies": []}, {"body": "tapping liquidity makes sense now.", "score": 5, "replies": []}, {"body": "r/Learmanntwins yw retards", "score": 3, "replies": [{"body": "Science", "score": 1, "replies": []}]}, {"body": "This inflation is giving me a mooning pants rocket, inflating at much faster rate than usual...", "score": 5, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "Baby got back...", "score": 3, "replies": []}, {"body": "😍", "score": 4, "replies": []}, {"body": "how is that comfortable.", "score": 2, "replies": [{"body": "True my pants are awfully tight and tented now too.\n\nBut if I had to guess, she's not wearing it for comfort.... Or she's has really soft silky skin that smells really good.....oh here we go again....", "score": 9, "replies": []}, {"body": "Its very comfortable in photoshop", "score": 4, "replies": []}]}, {"body": "I like FED", "score": 1, "replies": []}, {"body": "When she misunderstood “pump it”", "score": 1, "replies": []}, {"body": "thank you.", "score": 1, "replies": []}, {"body": "Sniff sniff![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Reddit NPCs are gonna love this post.", "score": 0, "replies": []}, {"body": "Now my jeans are also struggling to contain inflation. Except I promised 9 and delivered 2 instead of the other way around.", "score": 0, "replies": []}, {"body": "Can the FED sit on my face?", "score": 0, "replies": []}, {"body": "What are my thoughts ...\n\nfuck if I know ... \n\ngot distracted somehow ...", "score": 0, "replies": []}, {"body": "link", "score": 1, "replies": []}, {"body": "Pump that dump…", "score": 1, "replies": []}, {"body": "inverting my yield curve rn", "score": 1, "replies": []}, {"body": "Naw, the jeans get the job done", "score": 1, "replies": []}, {"body": "Fake pumped", "score": 1, "replies": []}, {"body": "That warm and fuzzy feeling you have in your pants when you see highly contained inflation...", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "wf6ryu", "created_utc": 1659533666.0, "score": 68, "upvote_ratio": 0.89, "num_comments": 43, "comments": [{"body": "Sell enough to double your money then keep the rest. That way you make sure you cash in profits.", "score": 26, "replies": [{"body": "I’m considering this approach, or at least just selling my cost basis \n\nBut I’m still very bullish on PYPL, I love this stock", "score": 9, "replies": [{"body": "Bullish is different than “gonna double in 6 months.”  The price you paid for those options is indicative of how ludicrous that achievement would be.\n\nOptions like that are meant to be sold when you capitalize on the spike in volatility and sentiment shift. Not to expect them to get in the money.", "score": 55, "replies": [{"body": "This comment and post should be pinned on the front page.", "score": 17, "replies": []}, {"body": "I have to agree. I'm not an options trader like most here, so grain of salt stuff. But it seems like a sell is the right play for this guy. At least cover. Make your money before you find yourself holding the bag.\n\nFull disclosure...I'm long PYPL with 315 shares @ an $85 basis. I'm up 15% as of today, but I have no illusions about the next 6 months. After that, after we come out of this mini-growth recession thing we're in, maybe around the time this guy's options expire...well after that I have plenty of illusions.", "score": 5, "replies": []}]}, {"body": "Why not sq?", "score": 1, "replies": []}, {"body": "Sell most let some ride. We are in a recession, and frankly there is no reason for the market to be going up right now.", "score": 1, "replies": []}, {"body": "Why so bullish sir? Expected more is $50 only for Jan 2023.", "score": 1, "replies": []}, {"body": "How many times did you buy the dip and what was your original contract entry price?", "score": 1, "replies": []}, {"body": "The moment it stops moving up the value on those options is gonna disappear. The entire point of buying multiple of the same option is to allow you to take profits without losing exposure to further mooning. \n\nif it goes up more, sell more, if it goes down, buy in options that are closer to the money with your cash. \n\nWhen buying the dip because you are bullish, look for the strikes that lost the most over the day, those are more likely to gain the most when/if it goes back up.\n\nBe Careful buying the dip though, they say \"the first one's free\" because buying the dip is how most option traders lose their first big score.", "score": 1, "replies": []}]}]}, {"body": "Selling is for chumps! I always let mine expire outside the money like a true boss", "score": 10, "replies": []}, {"body": "Why do people who have thousands to play around with buy deep OTM calls instead of ITM?", "score": 8, "replies": [{"body": "OTM calls give you more leverage which goes both ways, he won here if he sold but most people lose", "score": 4, "replies": []}]}, {"body": "Take that 15k and shoot for the moon next time... for free. 👍", "score": 3, "replies": []}, {"body": "Take the money and run", "score": 3, "replies": []}, {"body": "Take the profits man.", "score": 7, "replies": []}, {"body": "Very nice, the whole premise for PYPL dropping was stupid AF. Some old guy who has no clue about fintech decided to downgrade on some very weak assumptions. Such BS.", "score": 4, "replies": []}, {"body": "Sell", "score": 6, "replies": []}, {"body": "Sell 75%, move on to something new.", "score": 2, "replies": []}, {"body": "Let me make sure I understand this.   $0.07 \\* 898 = $62.86.  \nYou paid $62.86 to enter this position?", "score": 2, "replies": [{"body": "It’s .07 x 100 because it’s call contracts. So $7 x 898, over 6k to enter this position", "score": 6, "replies": [{"body": "ah, I knew I was missing something.  Thanks", "score": 2, "replies": []}]}, {"body": "It’s a contract. So multiply that $62.86 by 100.", "score": 3, "replies": []}, {"body": "Looks like a debit spread. So max profit $449k.", "score": 1, "replies": []}]}, {"body": "On behalf of your money, sell.", "score": 2, "replies": []}, {"body": "Good enough to post, good enough to sell", "score": 2, "replies": []}, {"body": "goddamm you did it!", "score": 2, "replies": []}, {"body": "Nice gains! Well Fargo just increased their price target for PYPL to $123 from $97. HOLD!", "score": 2, "replies": []}, {"body": "How is it going on buddy?", "score": 2, "replies": []}, {"body": "Definitely sell.  Those strikes are too far out for that date.  I’lol be surprised if you even get that price on the spread", "score": 3, "replies": []}, {"body": "This isn't a gain post, this is a loss post and everyone here is too regarded to realize it.\n\nThis page is showing you the average price for each option. If you could get the average price, you would be doing great. However, there's this thing called bid ask spread.\n\nYour 195 call has an avg of 0.58, but that could represent a bid ask of 0.30 / 0.85. Looking at the daily high, the absolute highest buy of the day was $0.35. Lets be as generous as possible and say the 200 call had a spread of 0.30 / 0.35 in your screenshot. So at that moment, where RH says you are up 233%, if you sell the 195 bid at the highest buy price recorded today (0.35) and buy the best possible 200 ask (0.35), you get $0. That is the absolute best case if you sold today. Total loss.", "score": 2, "replies": []}, {"body": "Then Monday happened", "score": 1, "replies": []}, {"body": "There is basically 0 chance that these will go in the money and that's reflected by the price you paid. At least take your cost basis out if this wasn't an ER gamble because these will likely expire worthless like most options do.", "score": 1, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "898 PYPL 1/20/23 195/200 bull call spread", "score": 3, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|187|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wf6ryu)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wf6ryu)", "score": 1, "replies": []}, {"body": "The guys voice from the movie 300: MAKE THEM FREE!", "score": 1, "replies": []}, {"body": "How do you have an average cost of .07? Hate to be a conspiracy theorist but this seems photo shopped  the lowest the 200 calls hit was .12 the 195 hit .13", "score": 1, "replies": []}, {"body": "You fool!", "score": 1, "replies": []}, {"body": "If you’re still bullish on Pypl long term, why not roll it into 200x the same strike for Jan 2024? Net debit ~$10k gives you a healthy realized profit and a freeroll that might actually hit max profit?", "score": 1, "replies": []}, {"body": "I have a small fortune invested in this stock but would dump those calls like they’re hot.", "score": 1, "replies": []}, {"body": "Nice. I've seen great discussions and predictions on PYPL on this subreddit r/marketpredictors today", "score": 1, "replies": []}]}
{"title": "My first options buy", "selftext": "Hey everybody, I’m new here and I’ve been learning about options and trying to educate myself about investing. Anyway, I bought the right to 100 shares of intel with a break even price of 41.67 expiring Jan 20, 2023. I’m basically taking a gamble that it’s gonna shoot up again around Christmas time. Plus they’re building a new chip plant around where I live so I figured why not. Idk very much about the Greeks, Intrinsic Value, I don’t even know the difference between in and out of the money calls. What do you guys think? Is this a solid first options trade? Any feedback is appreciated 🤙", "id": "wfg45l", "created_utc": 1659556063.0, "score": 5, "upvote_ratio": 0.63, "num_comments": 43, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 hour ago\n**Total Comments**|3|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wfg45l)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wfg45l)", "score": 1, "replies": []}, {"body": "Nobody tell him.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 13, "replies": [{"body": "Probably best I find out on my own", "score": 7, "replies": [{"body": "Start by selling some options. Helped me learn how they work with the greeks.", "score": 1, "replies": []}]}, {"body": "Good bot", "score": 2, "replies": []}]}, {"body": "That’s a long shot for someone head-diving into options. Now you have to wait. Why not buy weeklys or something like that?", "score": 4, "replies": [{"body": "I figure I can sell anytime before then if it shoots up, which I’m banking on. I just figured I’d do the long call in case it doesn’t go up as soon as I think it will.", "score": 2, "replies": [{"body": "Theta gang says hello", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "Yea really. If this is their first play with options you can get a much better and safer idea of how they work by selling them first.", "score": 0, "replies": [{"body": "I appreciate the advice. I’m hedging my calls by selling puts too", "score": 1, "replies": [{"body": "That wouldnt be hedging as those are both bullish positions.\n\n&#x200B;\n\nHedging would be buying puts if you owned the shares of stock to protect yourself on the downside.", "score": 1, "replies": [{"body": "Thanks for clarifying that for me", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 hour ago\n**Total Comments**|3|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wfg45l)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wfg45l)", "score": 3, "replies": []}, {"body": "For your first option you've done quite well. Strike price is like 10 % OTM, you have enough time (and it's a solid company). Most people fail because a) strike price is too far away and b) short-lived options.\n\nAs far as I know, there is some controversy going on between Intel and AMD. Many people believe AMD is the better company and Intel might not catch up, that's one of the risks.\n\nFurthermore, more Covid restrictions coming this winter (possibly) might trigger even more supply issues, negatively impacting the company.", "score": 3, "replies": [{"body": "Thanks for the info, I wasn’t aware of that.", "score": 1, "replies": []}]}, {"body": "By the time Xmas hits, theta would have destroyed any value if it isn't near your strike price, but yeah anything can happen", "score": 2, "replies": [{"body": "I see what you’re saying. I can sell anytime before that though, right? I figure if it goes up to anything above breakeven I could just sell before theta destroys my profits", "score": 2, "replies": [{"body": "Correct. Plus the closer you get to expiration, the more theta effects the other Greeks as well", "score": 3, "replies": []}, {"body": "Theta kills your value while you sleep. Its already happening.", "score": 2, "replies": []}]}]}, {"body": "Intel is a shit company they still have not recovered from its 2001 high. That was more than 20 years ago. Imagine holding this shit stock for 20 years and still be down?\n\nGood luck holding the bag", "score": 2, "replies": [{"body": "May the power of the YOLO gods be on my side and yours then friend.", "score": 1, "replies": []}]}, {"body": "Sounds like a good buy honestly. Lots of time til expiration and only about 10% OTM. Just make sure to decide how much you're willing to accept losing or how much profit you'd like to make on this trade. And with those numbers in mind, you can keep yourself accountable to sell the contract when either of those #s is hit. Best of luck", "score": 2, "replies": [{"body": "Thank you brother 🙏", "score": 1, "replies": []}]}, {"body": "Bit bold for first play, you could always sell calls against your leap to get some money back while you wait. That being said, your leap is otm so the premium might not be great.", "score": 2, "replies": []}, {"body": "The market will dump the stocks sooner or later.", "score": 2, "replies": []}, {"body": "At least the OP has already figured out that he’s gambling and not investing  😭. Welcome to the club!", "score": 2, "replies": [{"body": "Yessir, I figure I have a better chance in the market then I do buying lotto tickets ![gif](emote|free_emotes_pack|trollface)", "score": 1, "replies": []}]}, {"body": "This guy must be from Columbus Ohio", "score": 2, "replies": [{"body": "Close, you’re right about the Ohio part. I’m actually closer to Akron", "score": 1, "replies": [{"body": "theta gang will eat you up. Why intel tho? You’d should have gone with a strong company like apple or Amazon… anyway, good luck hold the bag man.", "score": 1, "replies": []}]}]}, {"body": "Get January $190C for AMZN, thank me later 🔥😤 or don’t.", "score": 1, "replies": []}, {"body": "Could’ve just said you bought the Jan blankety blank calls with a B/E of 41.67. The right to 100 and 2023 part of it were implied. But even though we don’t know your strike price, these might be okay by then at the rosy rate of this market.", "score": 1, "replies": [{"body": "Thanks for your input, it was a $40 call so I’m guessing that’s the strike price 😂", "score": 1, "replies": [{"body": "Yes sir, that $40 is the strike price, those are considered out of the money (OTM) at this point. It’s a reasonable play, not nearly as degenerate as most of the plays we see around here 😂 . Good luck.", "score": 4, "replies": [{"body": "Yeah man I wasn’t about to go all in and bet something I can’t afford to lose. Some of the YOLOs around here I’ve seen are ridiculously risky", "score": 2, "replies": []}]}]}]}, {"body": "Stop doing “research” and “dd” first of all", "score": 1, "replies": [{"body": "What is dd?", "score": 1, "replies": [{"body": "Due diligence.", "score": 1, "replies": [{"body": "Do you mean, by doing research and dd I’m really fucking myself over? I mean you can never really predict what happens. I mean theoretically the price of a stock could have no basis in reality at all", "score": 1, "replies": [{"body": "I think Cold\\_Forged\\_Memes was being facetious. Doing DD on a stock before forming a position is always a good idea.", "score": 2, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}]}]}]}]}
