{"title": "BLOOD ON WALL ST! Why My Bearish Case Proven & Others Missed. DOUBLE TOP showed itself within ASCENDING TRIANGLE! SPY & DOW TA WEEKLY RECAP 03/10/23", "selftext": "", "id": "11o7mrn", "created_utc": 1678499670.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 57, "comments": [{"body": "I’m the best sports better once the game is over and can yell to everyone SEE I TOLD YOU! Lol", "score": 2, "replies": [{"body": "Incorrect. I live traded today. For many to witness. Nice yet though 😂 and I called this yesterday night. Yikes", "score": 0, "replies": []}, {"body": "Hence, “recap” 😂", "score": 0, "replies": []}, {"body": "Been here all week too huh? I know you held them calls 😂😅", "score": 0, "replies": [{"body": "Wow three replies lol you’re a sensitive one. I play both sides and had 80% puts into this week. Came out 17k on top. Best of luck kid", "score": 1, "replies": []}]}]}, {"body": "got to love the post hoc analysis. Dude's shilling BS like he was paulson and burry buying protection and puts before this week. Sell more courses mate with this elementary lines you have.", "score": 1, "replies": [{"body": "I actually live traded with him during both days. Timed the top perfect. Made a Reddit because he ranted about idiots on here. You must be one", "score": 1, "replies": [{"body": "Bro if you ever came to my fund with this stupid shit, we would walk out 3 min in. You didn't time shit. Your analysis is post hoc and its elementary. great trendlines and MAs you newb. Go trade real capital and raise money and test your prowess with OPM over shilling courses for $19.99/month. Bitch boy\n\nEdit haha dude created a secondary account just to respond once he got suspended. What a clown", "score": 1, "replies": [{"body": "Tag his second account please? Need to follow again!", "score": 1, "replies": []}, {"body": "P.S. sounds like you have a hard on for him. You sound broke. Why would a person from a fund be on here hating on Reddit. Anonymously.. clown 😂", "score": 1, "replies": [{"body": "You just responded to me twice and didn’t switch accounts 😂 \nYou= paper trading clown", "score": 1, "replies": [{"body": "Switched what account? You’re brain dead 😂", "score": 1, "replies": [{"body": "Create more accounts. You just happen to find the one thread talking shit about your mentor (really you) and then come white knighting haha\n\nAs I said before, go raise outside capital cupcake and show them this strategy with all the amateurish TA. They will laugh like everyone here is", "score": 1, "replies": [{"body": "I never once mentioned a mentor 😂 I mentioned we traded live with him the last two days. Wtf are you talking about? 😂😂I’m dead 💀", "score": 1, "replies": []}, {"body": "You really think I’m him don’t you darlin? Christ lol", "score": 1, "replies": [{"body": "Yes dawg, you created an account literally just today to come and talk shit and a random thread with no history. If you had any self respect or money you’d buy bots and come through. \n\nYour shit sucks and your TA courses are basic. Go raise money and test it out and stop thinking ppl give a shit about your “analysis”, because you didn’t make any calls beforehand and this is all hilarious", "score": 1, "replies": [{"body": "Again. You. Dick. Sucking. Cunt. He said in the discord that his account got banned. So I made a discord and came to see the posts he made here. You can still type his username. To see the post and comments", "score": 1, "replies": [{"body": "No you can’t because you’re banned click on OPs name below the title..don’t worry I’ll wait. And that’s why you created this to continue to defend your shitty analysis. You give whole new meaning to paper boi from ATL with the fictitious profits and users you create to hype hahah", "score": 1, "replies": [{"body": "So dumbass, how am I talking to you under his post? 😂", "score": 1, "replies": []}, {"body": "Stupiddddddd", "score": 1, "replies": []}, {"body": "ATL? Wtf lol I’m from Denver. Wow. You’re really deranged lol", "score": 1, "replies": [{"body": "Lol. Keep trying man, your shit sucks and you know it. How come you can’t raise money or trade your own acct with the above analysis full time? Micro lot traders man, always the funnest and most combative about their TA and strategies or lack there of on this case", "score": 1, "replies": [{"body": "Says the person who comments a day later after they lost. Cunt mf 😂😂 and again, I joined his server. We made money you broke ass didn’t bitch", "score": 1, "replies": []}]}]}, {"body": "If only you knew how fucking stupid you sound. Thinking you’re actually arguing with someone who is not that person. That’s wild. You must suck mad dick bro", "score": 1, "replies": [{"body": "Yeah you too bro. Keep on those jac nuts with your shitty discord and doji analysis 🤣", "score": 1, "replies": [{"body": "You’re the only one on his nuts 😂 ima screenshot and post this. He don’t even know you exist probably bum lmao", "score": 1, "replies": []}, {"body": "Probably the cunt that got him banned. Got the Reddit loser lined up to suck each other up on losses. Bum ass fund privileged piece of shit. You ain’t none of that. You’re a keyboard typing whore. Won’t put any money or any validation up to what you’re saying. Just talking . Eat my dick hoe", "score": 1, "replies": []}, {"body": "Yo miserable ass comment miserable shit on everyone post in everything you follow. You’re a piece of shit low life with no logical intel. You eat dick and lost money. Fuckin whore 😂😂😂 go manage that fund and pair them losses bitch ass fraud", "score": 1, "replies": [{"body": "Add more grammatical and sentence structure errors. Oh, and cry more 😅😂", "score": 1, "replies": [{"body": "Now you correcting grammar? 😂😂😂😂😂😂😂😂😂😂 yeah I’m gone now. Done turned to pussy ass to a teacher", "score": 1, "replies": []}, {"body": "Like I said, walk the streets and pair them losses hoe", "score": 1, "replies": [{"body": "Like I said,discount your courses and hope someone buys because this is straight yahoo finance garbage", "score": 1, "replies": [{"body": "I don’t have a course. I bought his dumbass", "score": 1, "replies": []}, {"body": "You need it cunt.", "score": 1, "replies": []}, {"body": "You eat his dick for free. Might as well subscribe and make money hoe", "score": 1, "replies": []}, {"body": "Go paid them losses cunt. Them eat ya fathers cum bitch. You been arguing wit a whole strange who you think is a man you clearly despise. ThTs a shame. Can’t wait to post these screenshots in the group 😂💀", "score": 1, "replies": [{"body": "Waiting… \n\nOn those screensh hahahah I can’t. \nYou know you can make more managing a few mil with AUM and a performa fee then selling courses?\nBut that means you’d actually have to have a track record and not post hoc analysis\n\nAnd I love how you just gave yourself away. You posting screenshots in your own discord but again sure you’re jac nutsright?! \n\nAgain homie, you’re a goober and this “analysis” is dog shit. My baby brother could do the same thing you did with those lines and TA. Stick to discord and keep pumping out those courses it’s noble work", "score": 1, "replies": [{"body": "I’m waiting on you to prove anything. Bitch we made money. What you do?", "score": 1, "replies": []}, {"body": "And you can’t even post screenshots here……. In comments. Dumb. Ass", "score": 1, "replies": []}, {"body": "Boy stfu. Kike cunt fraud bitch. Where ya stuff? You haven’t proved anything!! At least he made videos and live traded. Your on Reddit talking. You’re a dud. A bum. Cunt. Dick eating hater. Post or stfu. You comment on everyone shit and talk shit and cant prove a thing. Probably some fanook with a bald spot, fat belly and hot breath. Go fuck a woman you miserable slob. Before you swallow too many kids dweeb", "score": 1, "replies": [{"body": "Still waitin…haha\n\nYou’re angry huh?!\n\nThis is fun.\n\nIf you actually ran money and not sold courses like 1000s or others showing the same shit as above, you’d know investment advisors act of 1940 regarding performance and marketing regs.\n\nAs I said before, drop that price because this shit is basic", "score": 1, "replies": [{"body": "Bitch stfu 😂 that shit don’t apply to you. You’re an average Joe. Dumb bitch, stop lying on here like you’re up their in the market world 😂😂 stoppp it. You really believe that, I big ole fund manager mad and arguing with a Redditor? 🫠💀😅 doing that. But I found the real fraud. Good day mate", "score": 1, "replies": [{"body": "I’m not that big only manage currently about 15mm so its still growing. But as for you, your shit still will suck this time next year. Do you drop prices during major holidays or even second tier holidays for courses ? Haha \n\nCan’t make money purely from markets and has to shill courses. What a goober", "score": 1, "replies": [{"body": "😂 hell I bought his course. And didn’t give my moment to fund slaves like you 😂😂😂😂💰 bum bitch. Go make your own. You work for them 😂😂 don’t even trade fr. Don’t even work that job fr. Bum cunt. Dick in booty as fund manager… even if that were true, YOURE NOT MAKING ANY MONEY DOING THAT 😂 it’s illegal. You’re bragging about insider shit you were STILL WROGN ABOUT 😂omg what bum manager.", "score": 1, "replies": [{"body": "Nah man 20% of the fund is mine, the rest is LPs. “Its illegal” what are you even taking about?  You know you could use more commas and periods right? What an illiterate person you are. Can’t even pronounce words correctly in your video you goober. \n\nDrop the price, this shit sucks and block me like a good little bitch as you have done. Keep it up man, eventually you’ll graduate to a 10 lot", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "All that dick went to your feeble ass brain 😂😂😂 fuckin goof lol", "score": 1, "replies": []}]}]}, {"body": "Bitch said grammatical errors and then proceed with his own grammatical errors. DUMB! Proves the whole point on this point lol. Especially in the comments. Unless you do it, you won’t believe it. And that why you are broke bitch. You can’t post one statement, trade, algo, video or nothing to validate anything you said but tryna convince me? 😂😂😂 bitchhhh", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "And again, see idiots, like you here. I might stick around for the hell of it 😂 I haven’t been here a day and you really hate that man. Dumb attention whore 😂 got yo broke ass up and make moves bum", "score": 1, "replies": []}, {"body": "And all that dumb shit you asked about. YOU HAVEN’T POSTED A THING. We traded with him on live? How can you fake that. You’re just in denial and obviously mad. Go take it in the ass or blow your father or something damn", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Do you not see the giant b-point down there on the harmonic?", "score": 1, "replies": []}, {"body": "Dude, add more lines at 7:35. It’s bound to bounce off one of them. Non tradable, non sequitur rubbish this whole video is.", "score": 1, "replies": []}, {"body": "And I already said why I’m here. They mentioned Reddit in the discord. I made one and found the idiots I was looking for under his post? You sound dumb", "score": 1, "replies": [{"body": "“Hey everyone, this guy is talking crap about me, go get him hahah” bro you (the same guy as jac nuts) can’t trade at all . Continuing squeezing out 5 points on the Es, it’s noble work you guys do😅", "score": 1, "replies": [{"body": "So at first I was him, you said. Know I’m the help he sent to combat you? Lol nah. You’re just the idiot that showed his head. Couldn’t be missed. Many people were wondering where his page went, actually got him more followers 😂 you on the other handdddd, bummmmm", "score": 1, "replies": [{"body": "No, no you didn’t. Stop lying goober", "score": 1, "replies": []}]}, {"body": "Dyke sucking cunt", "score": 1, "replies": []}]}]}, {"body": "Next time post before you make trade.\n\nNot pussy like yo I told you know…", "score": 1, "replies": []}]}
{"title": "SIVB - a discussion of similarities to the Global Financial Crisis, and what it means for stocks.", "selftext": "As much as I hate to see it, I love to see it.  Because this is the same thing that happened in 2008.  Obviously there are differences yeah, the banks aren't holding so much junk, they're better capitalized, etc. etc . But let's take a look at some similarities:\n\n1. Things started cracking prior to the '08 crisis during a hiking cycle.  The teaser rate mortgages adjusted up and investors took a lot of losses on subprime MBS.  House prices went down making the situation even worse.\n2. We're actually very close to the federal funds highs of 2005-2007 (5.25%) - [https://fred.stlouisfed.org/series/FEDFUNDS](https://fred.stlouisfed.org/series/FEDFUNDS)\n3. This was all preceded by an easing cycle, which had encouraged investors and institutions to use leverage in order to up their returns.  Bad loans were made, also, since servicing and refinancing them was easy.  Liquidity was ample.  There was bubble behavior: real estate.  Today: digital coins, meme stocks, etc. \n4. Hiking was going on in order to combat inflation.  It was not optional.\n5. There was a sense that \"real estate always goes up\", leading to bad bets there, and subsequent losses.  The same could be said for the stock market today (Archegos), or the notion that treasuries are a safe asset (they are, but they can still lose value).\n6. 2008 was a crisis of panic.  The market could not determine who was swimming naked, liquidity dried up.  Today there is growing concern of not only who is exposed to SIVB, but to a larger extent who is exposed to interest rate risk.\n\nLook, I ain't saying \"THIS IS IT BOYS\", because I don't know.  I'm not a doomer.  But economies and financial markets are *complex adaptive systems*, and they have tipping points.  Think of it like Jurassic Park.  Yeah, it seems like everything is under control, but an engineer decides to go rogue, cut the power, and all hell breaks loose.  You can't control everything.  You couldn't have predicted this.  One small event can lead to a cascade that brings the whole thing down.  For a real life example, 2008 is one of them, as is the First World War (the assassination of Archduke Franz Ferdinand).\n\nWhat is the lesson then?  Be prepared.  It was irresponsible to be running rates that low for so long and then hiking massively afterwards.  If the economy was to be stimulated, there are better options, like fiscal policy or directing QE towards productive industries.  Unfortunately, this is the framework the Fed and central banks have adopted, and there's an argument to be made that all we have succeeded in doing with these policies is to pump asset prices and create distortions in markets.\n\nFinally, this is /r/stocks, so as far as stocks go, I'm not saying to pull your money out.  I'm saying to be aware of what's going on right now, and to take that into consideration next time to you decide to buy an asset.  As long as things are going smoothly, stocks will continue their eternal march upward, thus negating the need to look at valuation or margin of safety.  However, if we do reach one of these \"tipping points\", there's a very real risk that things will start to come down and stay down.  You do not want to be caught with your pants down.  Do note, also, that modern investors are used the Fed sweeping in to save them.  With inflation looking the way it is, that may not be as guaranteed as it once was, and certainly not as welcome at a time when we need to get prices down.  Anyway, this is just my 2 cents and not expert advice.\n\nGood luck to all.\n\n\\------------\n\nFor a more academic discussion, I encourage you to read William White's article from the BIS in 2006, \"Is price stability enough?\" Mr. White predicted that prolonged easing would lead to the predicament that we are seeing now:\n\n*\"This implies a delicate balancing act for the monetary authorities, in which tightening must be slow enough to avoid destabilising financial markets, but fast enough not to destabilise inflationary expectations. \"*\n\n[https://www.bis.org/publ/work205.pdf](https://www.bis.org/publ/work205.pdf)\n\nFor more talk about the economy as a complex adaptive system, see here: [http://williamwhite.ca/wp-content/uploads/2018/04/CAEGChapterpdf.pdf](http://williamwhite.ca/wp-content/uploads/2018/04/CAEGChapterpdf.pdf)\n\nFor other examples of \"people swimming naked\" and the delicate balancing act of central banks right now, see UK pension funds and the Korean bond market last year:\n\n[https://www.theguardian.com/business/2022/oct/06/bank-of-england-confirms-pension-funds-almost-collapsed-amid-market-meltdown](https://www.theguardian.com/business/2022/oct/06/bank-of-england-confirms-pension-funds-almost-collapsed-amid-market-meltdown)\n\n[https://www.japantimes.co.jp/news/2022/10/29/business/south-korea-economic-trauma/](https://www.japantimes.co.jp/news/2022/10/29/business/south-korea-economic-trauma/)", "id": "11of661", "created_utc": 1678524522.0, "score": 47, "upvote_ratio": 0.78, "num_comments": 53, "comments": [{"body": "I think there will be contagion but not by the big banks.\n\nI could see a couple more regionals fall.\n\nBut the big problem is all the startups and tech companies with exposure.\n\nThey cannot pay payroll and will not have funds to continue operations. Saw an interview of Y Combinator CEO saying over 1,000 of the 3,000 startups will be effected.\n\nSo 1,000 business who employee hundreds of employees losing their jobs. They can't pay mortgages, rent, car payment, etc.\n\nThen it ripples more.\n\nSEC, FED, Treasuries, FDIC all need to step in a make everyone whole to stop it. In my opinion. Let the big banks each take a chunk of the assets and wind it down.", "score": 32, "replies": [{"body": "They should absolutely not bail out the tech VC sector. It’s one of the most wasteful sectors of the economy.", "score": 18, "replies": [{"body": "It’s not a bail out. It’a backstopping deposits. \n\nThere’s no reason companies should go under because their bank failed in large part due to FED policies. \n\nTech is a driver of the economy. It’s high paying jobs, technological innovation, and future ipo’s. \n\nThere were a lot of zombie companies out there that were circling the drain due to the difficult fundraising environment. Essentially what will happen here is even the strong companies will die.", "score": 3, "replies": []}, {"body": "In the daily thread someone was saying starts-ups are a waste.  Evidence doesn't support that, at all: \n\n[https://www.reddit.com/r/stocks/comments/11ogv2z/rstocks\\_weekend\\_discussion\\_saturday\\_mar\\_11\\_2023/jbt1lx5/?context=3](https://www.reddit.com/r/stocks/comments/11ogv2z/rstocks_weekend_discussion_saturday_mar_11_2023/jbt1lx5/?context=3)", "score": 4, "replies": []}, {"body": "> It’s one of the most wasteful sectors of the economy. \n\nThat's a hot take if i ever saw one. Sure most tech startups try to find solutions for problems that are not even problems in the first place but they are actively contributing in advancing technology. \n\nIf they are wasteful, then what are the companies of gambling, tobacco, alcohol industries? They are damaging for the economy and the society in general", "score": 2, "replies": []}]}, {"body": "https://www.federalreserve.gov/newsevents/pressreleases/bcreg20230209a.htm\n\nA lot of the big banks didn't pass the stress test: BAC, BNY, Barclays, Citi, CS, DB, GS, JPM, MS, State Street and WFC.", "score": 2, "replies": [{"body": "Did you even read the website? Stress test for 2023 hasn't started yet. That link only points to this year's scenario and which component applies to banks. \n\nBig banks passed the last test in 2022.\n\n[https://www.federalreserve.gov/publications/files/2022-dfast-results-20220623.pdf](https://www.federalreserve.gov/publications/files/2022-dfast-results-20220623.pdf)\n\n\" Despite the larger post-stress decline this year, the aggregate and individual bank post-stress CET1 capital ratios remain well above the required minimum levels throughout the projection horizon\"\n\n[https://www.wsj.com/articles/fed-stress-test-finds-big-banks-can-weather-severe-recession-11656016201](https://www.wsj.com/articles/fed-stress-test-finds-big-banks-can-weather-severe-recession-11656016201) \n\n\"The Federal Reserve gave the biggest U.S. banks a clean bill of health in its annual stress test, saying they would be able to continue lending to households and businesses even in a severe recession.\"", "score": 2, "replies": []}]}, {"body": "I appreciate you adding this.  I was a bit vague but that most definitely seems like the most probable path of contagion at this point in time.", "score": 1, "replies": [{"body": "Yeah, I know.\n\nYou can see it already happening if you watch local news.\n\nTech startup CEOs saying they can't make payroll or continue operations without funds.\n\nSo far the government said Monday for FDIC up to $250,000.\n\nRest get IOU dividend certificates for when they sell assets. But how long will that take, unless they just give it to big banks and let them give them funds now.", "score": 6, "replies": [{"body": "FDIC issuing advance dividends, we will see what % it constitutes", "score": 3, "replies": []}, {"body": "Yes, I've seen that.  Great point.", "score": 0, "replies": []}]}, {"body": "I especially agree with ur “low rates, hiked massively”. Ur right, there ARE better ways than they used/are using. U’d think “we’d” b smarter by now?", "score": 2, "replies": []}]}]}, {"body": "who knows the implications of these banks and brokers going belly up. this will take months to unravel what is tethered.", "score": 7, "replies": []}, {"body": "Sorry, but that is simply nonsense.  This isn't at all like 2008\n\n>Things started cracking prior to the '08 crisis during a hiking cycle. The teaser rate mortgages adjusted up and investors took a lot of losses on subprime MBS. House prices went down making the situation even worse.\n\nThe problem in 2008 was that homeowners in those teaser rate ARMs had to refi every two years to keep their payments affordable, forcing them into default.  Homeowners today are largely in 3-4% fixed rate mortgages that are extremely affordable.  It would take dynamite to get most of them out of their homes.\n\n>This was all preceded by an easing cycle, which had encouraged investors and institutions to use leverage in order to up their returns. Bad loans were made, also, since servicing and refinancing them was easy. Liquidity was ample. There was bubble behavior: real estate. Today: digital coins, meme stocks, etc.\n\nRisky investments at the edges of the economy are not the same as unaffordable home mortgages.  Cyrpto and Gamestop could go to do zero with no systemic damage to the economy.\n\n>Hiking was going on in order to combat inflation. It was not optional.\n\nInflation wasn't the problem in 2008.  It was, as you mentioned, leverage in unaffordable loans.  Those don't exist today.\n\n>2008 was a crisis of panic. The market could not determine who was swimming naked, liquidity dried up. Today there is growing concern of not only who is exposed to SIVB, but to a larger extent who is exposed to interest rate risk.\n\nWe know who is exposed to rate risks, and most financials are navigating it properly are doing well.  Big banks mark their securities to market every day and go through rigorous stress tests; all financial companies report their AOIC which reflects unrealized loses from interest rate moves.  We have a good handle on the magnitude of the issue, and it simply is not a systemic risk.\n\n&#x200B;\n\nThis is a garden variety tightening cycle, and saying it is another 2008 is uninformed and irresponsible.", "score": 18, "replies": [{"body": ">The problem in 2008 was that homeowners in those teaser rate ARMs had to refi every two years to keep their payments affordable, forcing them into default. Homeowners today are largely in 3-4% fixed rate mortgages that are extremely affordable. It would take dynamite to get most of them out of their homes.\n\nAt no point did I say that the housing market was the cause for concern here.\n\n>Risky investments at the edges of the economy are not the same as unaffordable home mortgages. Cyrpto and Gamestop could go to do zero with no systemic damage to the economy.\n\nSame thing could have happened with subprime. That's what Bernanke says, at least:\n\n[https://youtu.be/qJsfW7Co0XQ?t=62](https://youtu.be/qJsfW7Co0XQ?t=62)\n\nWhat do you think subprime is?  It was a risky investment at the edges of the economy.\n\n>Inflation wasn't the problem in 2008. It was, as you mentioned, leverage in unaffordable loans. Those don't exist today.\n\nInflation was not a problem like it is today, but there was upward pressure on prices which led to raising rates and pricking the bubble:\n\n\"Higher oil prices boosted retail prices of a broad range of consumer energy products and, as a result, continued to hold up the rate of overall consumer price inflation in the first half of 2005. In addition, the rise in energy prices this year, coupled with increases in the prices of some other commodities, imported goods, and industrial materials, put upward pressure on the costs of many businesses. A portion of these costs was passed on to consumers, which contributed to a higher rate of inflation in core consumer prices (that is, total prices excluding the food and energy components, which are volatile)\n\nWith financial conditions advantageous for households and firms, a solid economic expansion in train, and **some upward pressure on inflation**, the Federal Open Market Committee (FOMC) continued to remove policy accommodation\" (bold added)\n\n[https://www.federalreserve.gov/boarddocs/hh/2005/july/ReportSection1.htm](https://www.federalreserve.gov/boarddocs/hh/2005/july/ReportSection1.htm)\n\nThat source is from 2005.  By 2007 inflation was at 2.85%, and by 2008 it was 3.84%, so you can see the upward inflationary trend.\n\nSource: [https://www.in2013dollars.com/inflation-rate-in-2008](https://www.in2013dollars.com/inflation-rate-in-2008)\n\nInflation did not cause the crisis in 2008, nor did it cause the collapse of SIVB.  In both cases, however, rising prices compelled the Fed to raise rates.  Why do you think the teaser rates adjusted prior to the crisis?\n\n>We know who is exposed to rate risks, and most financials are navigating it properly are doing well. Big banks mark their securities to market every day and go through rigorous stress tests; all financial companies report their AOIC which reflects unrealized loses from interest rate moves. We have a good handle on the magnitude of the issue, and it simply is not a systemic risk.\n\nYou don't know that, and you sound like Bernanke in 2007, who was probably more informed then than you are now:\n\n[https://www.forbes.com/2007/05/17/bernanke-subprime-speech-markets-equity-cx\\_er\\_0516markets02.html?sh=54b57b7b10e1](https://www.forbes.com/2007/05/17/bernanke-subprime-speech-markets-equity-cx_er_0516markets02.html?sh=54b57b7b10e1)\n\n>This is a garden variety tightening cycle, and saying it is another 2008 is uninformed and irresponsible.\n\nYou talk as if we've had many of them over the years.  We haven't, and of the few I'm familiar with since the 1980s, we've had a lot of issues. The first I can think of culminated in the [savings and loan crisis](https://en.wikipedia.org/wiki/Savings_and_loan_crisis), the second in the Global Financial Crisis we are discussing here, the third (in 2019) [ending before it could even get off the ground](https://www.bloomberg.com/news/articles/2019-08-01/fed-move-ends-the-short-era-of-global-quantitative-tightening), and now this one with the second biggest bank failure in US history (16th biggest bank at the time).  That's not a great track record.", "score": -4, "replies": [{"body": ">At no point did I say that the housing market was the cause for concern here.\n\nFrom your post:\n\n\" The teaser rate mortgages adjusted up and investors took a lot of losses on subprime MBS. House prices went down making the situation even worse.\"\n\n&#x200B;\n\n>What do you think subprime is? It was a risky investment at the edges of the economy.\n\nYou don't seem to know your history.  The subprime collapse was largely self-contained, and played out in 2006-07.  Subprime lenders like New Century and Impac were self funded, went broke when subprime collapsed, but did not have a systemic economic impact.  It was when Alt-A teaser rate ARMs failed that the crisis became systemic.\n\n>Inflation did not cause the crisis in 2008, nor did it cause the collapse of SIVB. In both cases, however, rising prices compelled the Fed to raise rates.\n\nIn 2008, the driving factor behind the tightening was an increasing money supply and excessive leverage from the housing boom - not a general increase in prices like today.\n\n>You don't know that, and you sound like Bernanke in 2007, who was probably more informed then than you are now\n\nYou are just flat out wrong.  We have marked to market valuations and stress test results of all systemically important banks, and we see that they have historically high capital ratios.\n\nYour linked article has nothing to do with this topic - it doesn't address bank capital at all.\n\n>You talk as if we've had many of them over the years. We haven't\n\nYes, we have:\n\n\\- 1955-57\n\n\\- 1958-60\n\n\\- 1968-69\n\n\\- 1973-74\n\n\\- 1978-81\n\n\\- 1983-84\n\n\\- 1988-89\n\n\\- 1994-95\n\n\\- 1999-2000\n\n[https://fred.stlouisfed.org/series/FEDFUNDS](https://fred.stlouisfed.org/series/FEDFUNDS)\n\n&#x200B;\n\nSorry, you are just off base here.", "score": 7, "replies": [{"body": ">From your post:\" The teaser rate mortgages adjusted up and investors took a lot of losses on subprime MBS. House prices went down making the situation even worse.\"\n\nThis was the cause of the panic and resulting liquidity crisis.  I did not say that the cause of the panic would be the housing market this time.\n\n>You don't seem to know your history. The subprime collapse was largely self-contained, and played out in 2006-07. Subprime lenders like New Century and Impac were self funded, went broke when subprime collapsed, but did not have a systemic economic impact. It was when Alt-A teaser rate ARMs failed that the crisis became systemic.\n\nIt was when Lehman Brothers failed, on September 15, 2008.\n\n>In 2008, the driving factor behind the tightening was an increasing money supply and excessive leverage from the housing boom - not a general increase in prices like today.\n\nThe Fed doesn't look at money supply or excessive leverage when making monetary policy.  That's not their job.\n\n>You are just flat out wrong. We have marked to market valuations and stress test results of all systemically important banks, and we see that they have historically high capital ratios.Your linked article has nothing to do with this topic - it doesn't address bank capital at all.\n\nYou're missing the point, you missed the point of the whole post.  The issue is you don't know where vulnerabilities are going to be.  Your confidence that \"everything is fine\" is reminiscent of Bernanke's confidence in 2007.\n\nI'm going to disregard the tightening cycles prior to the 1980s or so because that was before the US's massive problem with debt.  Before 1970 or so the US debt situation was contained:\n\n[https://www.visualcapitalist.com/wp-content/uploads/2021/06/US\\_Debt\\_to\\_GDP\\_Shareable.jpg](https://www.visualcapitalist.com/wp-content/uploads/2021/06/US_Debt_to_GDP_Shareable.jpg)\n\nAnd check out the current account: [https://www.researchgate.net/publication/46453208/figure/fig1/AS:307341267357699@1450287276412/The-US-Current-Account-Deficit.png](https://www.researchgate.net/publication/46453208/figure/fig1/AS:307341267357699@1450287276412/The-US-Current-Account-Deficit.png)\n\n1978 - 1981:\n\nNot in the US, but:\n\n\"The Latin American debt crisis started on August 12, 1982, when Mexico's finance minister informed the Federal Reserve chairman, the secretary of the treasury, and the International Monetary Fund managing director that Mexico would be unable to meet its August 16 obligation to service an $80 billion debt\\[1\\].\"\n\nSource: [https://www.fdic.gov/bank/historical/history/191\\_210.pdf](https://www.fdic.gov/bank/historical/history/191_210.pdf)\n\nAfter that period:- 1983-84- 1988-89- 1994-95\n\n\"The Savings and Loan (S&L) Crisis was a slow-moving financial disaster. The crisis came to a head and resulted in the failure of nearly a third of the 3,234 savings and loan associations in the United States **between 1986 and 1995.\"**\n\nSource: [https://www.investopedia.com/terms/s/sl-crisis.asp#:\\~:text=management%2C%20and%20analytics.-,What%20Was%20the%20Savings%20and%20Loan%20(S%26L)%20Crisis%3F,States%20between%201986%20and%201995](https://www.investopedia.com/terms/s/sl-crisis.asp#:~:text=management%2C%20and%20analytics.-,What%20Was%20the%20Savings%20and%20Loan%20(S%26L)%20Crisis%3F,States%20between%201986%20and%201995).\n\n\\- 1999-2000\n\n[https://en.wikipedia.org/wiki/Dot-com\\_bubble](https://en.wikipedia.org/wiki/Dot-com_bubble)", "score": 0, "replies": [{"body": ">This was the cause of the panic and resulting liquidity crisis. I did not say that the cause of the panic would be the housing market this time.\n\nYou specifically cited this as a similarity in your initial post.  Good to see you are walking it back.\n\n>It was when Lehman Brothers failed, on September 15, 2008\n\nWhich was because MBSs were losing value because Alt-A loans were failing.\n\n>The Fed doesn't look at money supply or excessive leverage when making monetary policy. That's not their job.\n\nNo.  Controlling money supply is their job.\n\n>The issue is you don't know where vulnerabilities are going to be\n\nYou keep walking back your initial post.  You claimed that liquidity and rate risk are problems that we don't know the extent of.  This is simply false; we know exactly what the liquidity and rate exposure of all large banks are, and we see that they have historically high levels of capital.\n\n>I'm going to disregard the tightening cycles prior to the 1980s\n\nSo, you are simply ignoring data that proves you are wrong.\n\n>because that was before the US's massive problem with debt. Before 1970 or so the US debt situation was contained\n\nWTF does national debt have to do with this topic???  You are simply throwing crap against the wall at this point.\n\n&#x200B;\n\nYou are simply wrong; I've explained this to you.  I'm done.", "score": 6, "replies": [{"body": ">You specifically cited this as a similarity in your initial post. Good to see you are walking it back.\n\nI'm not walking anything back.  You misunderstood.  This was what I said:\n\n**Things started cracking prior to the '08 crisis during a hiking cycle.**\n\nThat was the similarity.  Not the exact nature of where things actually broke.  You misinterpreted what I said.\n\n>Which was because MBSs were losing value because Alt-A loan were failing.\n\nLehman was arguably solvent.  It was a liquidity crisis:\n\n\"With mark-to-market valuation of assets, solvency is a close call: it appears that Lehman’s true equity was near zero. With valuation based on fundamentals, Lehman was probably solvent.\"\n\nSource: [https://back.nber.org/appendix/w22410/The%20Fed%20and%20Lehman%20Brothers.pdf](https://back.nber.org/appendix/w22410/The%20Fed%20and%20Lehman%20Brothers.pdf) \n\nAlso, you ignored the video where Bernanke said it was a result of panic.  I'll link it again:\n\n[https://www.youtube.com/watch?v=qJsfW7Co0XQ&t=62s](https://www.youtube.com/watch?v=qJsfW7Co0XQ&t=62s) \n\n>Controlling money supply is their job.\n\nNo it's not. From the Fed website:\n\n\"The Federal Reserve Act mandates that the Federal Reserve conduct monetary policy \"so as to promote effectively the goals of maximum employment, stable prices, and moderate long-term interest rates.\"\"\n\n[https://www.federalreserve.gov/monetarypolicy/monetary-policy-what-are-its-goals-how-does-it-work.htm#:\\~:text=The%20Federal%20Reserve%20Act%20mandates,for%20monetary%20policy%20is%20commonly](https://www.federalreserve.gov/monetarypolicy/monetary-policy-what-are-its-goals-how-does-it-work.htm#:~:text=The%20Federal%20Reserve%20Act%20mandates,for%20monetary%20policy%20is%20commonly)\n\nNot a single mention of the money supply on there.\n\n>So, you are simply ignoring data that proves you are wrong.\n\nNo, I'm saying that interest rate hikes are a problem when there is excessive debt in the system.  This really became a problem in the mid 1970's or so.\n\n>WTF does national debt have to do with this topic??? You are simply throwing crap against the wall at this point.\n\nWhen there is more debt in the system interest rate hikes are more harmful.", "score": -6, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yes.  All financials report unrealized gains in their quarterly reports; large banks have to mark to market daily and include them in their capital ratios and stress tests.", "score": 1, "replies": []}]}]}, {"body": "I think this time SVB problem has been no surprise for anyone who read financial statements for living. This is a tweet from Jim Chanos, legendary short seller twt@WallStCynic  :  \n\"IMO, the significance of the $SIVB debacle is not the news overnight, or even the market’s response to it today, but rather that their disastrous asset/liability mismatch has been well-known for months now. Yet it didn’t matter until management said it did. Efficient markets?\"  \nFor unfortunate people and company, FDIC will take 3–4 weeks to get SOME dividend back from the fire sale. For the rest of us, it is a reminder of doing a DD ourselves by analyze the financial statement with fine prints. Even as the 16th largest bank, SVB is insignificant in the world of finance, which revolves  around the mega banks, hedge funds. It is small enough to exempt from stress test. FDIC step in for an organized dissolution. It is not the last casualty of the inflation-fighting war. ‘We Have Nothing to Fear Except Fear Itself’.", "score": 12, "replies": []}, {"body": "Good read, thanks for sharing your perspective!", "score": 11, "replies": [{"body": "You're welcome!  Glad you enjoyed it.", "score": 5, "replies": []}]}, {"body": "\"This year's hypothetical scenario is tougher than the 2021 test, by design, and includes a severe global recession with substantial stress in commercial real estate and corporate debt markets. The unemployment rate rises by 5-3/4 percentage points to a peak of 10 percent and GDP declines commensurately. Asset prices decline sharply, with a nearly 40 percent decline in commercial real estate prices and a 55 percent decline in stock prices. \n\nAll banks tested remained above their minimum capital requirements, despite total projected losses of $612 billion. Under stress, the aggregate common equity capital ratio—which provides a cushion against losses—is projected to decline by 2.7 percentage points to a minimum of 9.7 percent, which is still more than double the minimum requirement. \" - https://www.federalreserve.gov/newsevents/pressreleases/bcreg20220623a.htm\n\nWe will see if the bank stress tests were worth the effort. If banks are not as resilient for whatever reason, then I guess we find out over the next few months. I'm going to build up some more cash in case there's a buying opportunity.  \n\nWatch list: meme stocks, FRC, REITs like MPW and others, pretty much everything, I'm almost always buying. Could you imagine a 50% drop in the markets? I've ordered a vehicle and if the market tanks between now and delivery, I'm canceling the order and buying stocks.", "score": 9, "replies": [{"body": "Well I guess Powell could get his wish if unemployment goes to 10%, real monkey claw scenario", "score": 1, "replies": []}]}, {"body": "I agree with the overall perspective, but there is a lot lacking and not necessarily correct or precise.\n\nGood luck whatever you decide.", "score": 3, "replies": []}, {"body": "This is a long post with lots of words to say nothing useful at all.", "score": 5, "replies": []}, {"body": "I'm all in SQQQ right now. CPI going to come in hot and FOMC meeting the following week. Nothing but FUD booked this entire month.", "score": 1, "replies": [{"body": "Probably not a horrible call.  GL to you.", "score": 0, "replies": []}, {"body": "Same with a couple of puts on seriously bad bio companies.  Probably will get some more of those on Monday too", "score": 0, "replies": []}]}, {"body": "A decent summary of where to focus and what to watch... BUT\n\nThis is not 2008, and you skip past an example:\n\n>... It was irresponsible to be running rates that low for so long and then hiking massively afterwards. If the economy was to be stimulated, there are better options, like fiscal policy or directing QE towards productive industries. Unfortunately, this is the framework the Fed and central banks have adopted, and there's an argument to be made that all we have succeeded in doing with these policies is to pump asset prices and create distortions in markets.\n\nIn 2007, the Fed didn't have authority to buy assets.. QE wasn't yet in the tool box.  The tools then were *print money* or *raise rates*.... They had pitifully little else \n\nIs there enough room to return to a horse and buggy set of tools?  I think we're way beyond that, and we need to be both vigilant about evolving conditions and inventive in or application of solutions.\n\nThanks for a good read..  and *let's be careful out there!*  Best of luck (unless you're a predator)\n\nI'll recap one thing I did in 08... I waited. When the Auto industry seized up (through various credit tools) I looked and saw GM was the big fish going down.  I bought Ford.  It was a nice ride, the only one I'd take in a Ford!", "score": 1, "replies": [{"body": "You're right, the imaginative tools of QE and its counterparts have only been in effect since 2008/2009.  Even so, before then they were still addicted to liquidity.  The situation has only gotten worse.  Japan is a good example of a later game situation and even more drastic solutions, like central bank purchases of ETFs. The story is the same: more printing, more debt.", "score": 1, "replies": [{"body": "I expect Japan's *lost decade* (a repeat of the US in the 70s) is going to be revisited...", "score": 1, "replies": [{"body": "I'm not sure, but the problem is if we need to raise rates to tame inflation but we can't because of financial instability / economic stagnation.  This puts us between a rock and a hard place and none of it bodes well for our future.", "score": 1, "replies": [{"body": "Some big bank will take the carcass, like WaMu.", "score": 2, "replies": [{"body": "I agree.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thanks for the info!   \nThink this is going to be bigger than 2008 tbh. Think they just kicked the can on that one. Now it's time to pay the piper. But im far from an expert in this. Not a trader.\n\nWishing you all the best in these turbulent times.", "score": -8, "replies": [{"body": "I can't see it myself. The FDIC have had 15 years working on preparing for this. There is a lot more expertise and experience. The stakes are better known. This weekend bidding will be playing out, and by Monday a new owner will be announced.", "score": 9, "replies": [{"body": "They could manage to slap a Band-Aid on this and continue on trekking for a little longer. I'm pretty zen right now. Although the crypto world seems to be shaking right now and depegged whatever that means. It looks like all the banks are bleeding right now though, not exactly sure who would buy them, or could.\n\nCan't remember who it was but i think it might've been the FDIC that called a meeting for Monday?\n\nLike i said i'm not an expert by any means i just spend too much time on reddit. A lot of the bond/treasury stuff i never really learned and while i have a basic understanding of how SWAPs work, I usually try and keep my mouth shut when it comes to this stuff. Dunno where your getting that 15 years from for example. Most of what i 'know' is around failure to delivers and operational shorting, but even then i wouldn't say i know a lot. I just read a paper published by Wharton in 2018-2019.", "score": -6, "replies": [{"body": "15 years since 2008.", "score": 4, "replies": []}, {"body": "You managed to write 20 lines without really saying anything dude.", "score": 5, "replies": []}]}]}, {"body": "I do not know if this is a Lehman moment. I get the sense it's probably not, I think we need to see a few more meltdowns before we get there.  In fact, we may even somehow dodge this crisis and achieve some semblance of that \"soft landing\".  That said, I agree that we have been kicking the can down the road.  2008 was a crisis caused by leverage, and ironically, we have come out of it far more leveraged than we even were then.  Despite increased attention being paid to regulation and bank capitalization, the fundamental issue - easy money, financial distortions, and debt - has not been resolved.  It has gotten worse.  Unless we change something, I am of the belief that sooner or later we are headed for a meltdown.\n\nI am not an expert either but have spent a lot of time studying these issues.  I'm glad some people are able to find value in it.  You're welcome and all the best to you as well.", "score": 0, "replies": [{"body": "Be interesting to see what happens with Credit Suisse and the delayed reporting.", "score": 6, "replies": []}, {"body": "I think it's more of a bear Stearns moment which ended worse. Svb is not super closely involved with the big banks so the collapse of svb doesnt have a emergency level danger on the finance system. But the panic in the markets could lead to more panic and may force a bigger bank down which then would be equivalent to Lehman brothers", "score": 1, "replies": [{"body": "Well said, I totally agree.", "score": 1, "replies": []}]}]}, {"body": "This is 1000x bigger than 1929", "score": -2, "replies": []}]}, {"body": "ThIs TiME Is DiFFrEnt", "score": -2, "replies": []}, {"body": "What has changed, what is completely different this time is the invention of quantitative easing or modern monetary theory.  \n\nAll of the worries in this post can and will be fixed by the Fed buying securities to their balance sheet. They have repeatedly done this, expanding the balance sheet to $8.5 trillion and Ben Bernake won a Nobel Prize for concluding that this number will grow infinitely:  \nhttps://www.brookings.edu/blog/ben-bernanke/2016/09/02/should-the-fed-keep-its-balance-sheet-large/  \n\nModern Monetary Theory isn't attached to logic, it decouples the banks and markets from reality and the threats of an free market but *it does exist*.  \n\nAll central banks have been doing it since 2009, they didn't spend 15 years bailing out banks to stop now and let everything (including themselves and their Nobel Prizes) crumble.", "score": 1, "replies": [{"body": "They can't do that right now.  Inflation.", "score": 0, "replies": [{"body": "“Can’t” prevent total collapse because “inflation.”  😂  \n\nWhen the balance sheet was $0 in 2009 they couldn’t buy $2 trillion to it. When it was $3 trillion in 2015 they couldn’t. When it was $5 trillion in 2019 they couldn’t.  Now it’s $8,500,000,000,000 and people are still saying they can’t.  \n\nBernake just won the Nobel Prize in 2022 AFTER the balance sheet reached 8.5 trillion. \n\nRead your own words and laugh at yourself.", "score": 1, "replies": []}]}]}, {"body": "Hopefully, it spreads far and far, resulting in the destruction of most digital coins. Governments should have stepped in a long time ago", "score": 1, "replies": []}, {"body": "Beware the ides of March is a warning to watch out for betrayal or misfortune. It's often used in political contexts. The term ides of March refers to March 15—the day on which Roman Emperor Julius Caesar was assassinated in 44 b.c.e. For this reason, it has become associated with bad omens, betrayal, and misfortune.", "score": 1, "replies": []}]}
{"title": "Elon Musk says he's 'open to the idea' of buying Silicon Valley Bank, but a Tesla investor tells him 'no thanks'", "selftext": "", "id": "11oi9m9", "created_utc": 1678535478.0, "score": 141, "upvote_ratio": 0.85, "num_comments": 50, "comments": [{"body": "Thread locked: very little actual discussion, locking before it devolves further.", "score": 1, "replies": []}, {"body": "Lemme sum it up in one gif;\n\n![gif](giphy|8vUEXZA2me7vnuUvrs)", "score": 92, "replies": [{"body": "![gif](giphy|SRqTQmbYdm5jgS7xH9|downsized)", "score": 16, "replies": []}, {"body": "&#x200B;\n\n![gif](giphy|uuwTV5FgP6rFfwliCE)", "score": 12, "replies": []}, {"body": "There are not enough fucks in front of NO in this gif.", "score": 7, "replies": []}]}, {"body": "Most people don’t understand why before saying no. Gives Twitter access to operate as a financial institution. It’s probably more for the licences and permits rather than the actual bank and it’s customers", "score": 68, "replies": [{"body": "We say no because he will pay with Tesla shares.\n\nEdit: corrected now to no", "score": 89, "replies": [{"body": "Who actually cares if he sells some shares except for media hysteria?", "score": -22, "replies": [{"body": "Shareholders", "score": 51, "replies": [{"body": "The long term value of a company are its products and not how many shares the CEO sells or accumulates", "score": 32, "replies": [{"body": "Thank you", "score": 4, "replies": []}, {"body": "ELON PLANS TO BUY AN ICE CREAM!!! QUICK!!! PAPER HAND EVERYTHING!!!", "score": -3, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Is his selling also largely the the reason why other tech companies also tanked? Nothing to do with the War, inflation, cost of living etc?", "score": 7, "replies": []}, {"body": ">did you enjoy the drop from 300 to 100\n\nYes, of course. It is at $174 now so an easy +74% on what I bought at $100. Another discount sale would be fantastic. \n\nIf you thought the business was worth more than $300 per share why would you not be super excited about something that depressed the stock price but has nothing at all to do with the strength of the business?!\n\nIf it goes to $100 again because of something like this it's an easy 3-5x long term for sure.", "score": 11, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Why not? The only thing not fun is if you don't have a lot of cash to buy more during that massive discount.", "score": 6, "replies": []}]}]}, {"body": "Do you not like when your favorite stock goes on sale when their fundamentals haven’t changed? Unless you needed to sell to buy a house, diversify, or something, a drop in price create a buying opportunity.", "score": 4, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "The markets are often irrational.  Elon was probably responsible for about 30% of that.  The rest was irrational fear and China fears.\n\nAs Tesla expands beyond the US and China, China will make less of a difference.", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I never downvoted you.  Of course no one enjoys a big drop like that at the time.\n\nIf Elon’s Twitter purchase would’ve happened at a different time he wouldn’t have had to sell so much, and the drop wouldn’t have been so great.  He tried to back out.  He was either advised poorly or didn’t take advice, likely both.\n\nPeople act like everyone knew that 2022 would be the worst year since 2008.  If Elon knew what would happen he would’ve probably purchased the company for a fraction of what he paid or bought something else this year.", "score": 3, "replies": []}]}]}]}]}, {"body": "> largely based on ELON SELLING  \n\nNo it was 'largely' based on fears about demand.", "score": 1, "replies": []}]}]}]}, {"body": "Nobody gives a crap about Twitter in this forum. Twitter has done a lot of harm to Tesla.", "score": 14, "replies": []}]}, {"body": "i say buy.  a successful twitter is good for tesla shareholders.", "score": 28, "replies": [{"body": "It is well known that we want to turn Twitter to the everything app, which includes financial services. Buying a failing bank probably speeds up this process by a few years. How much are these years worth?", "score": 19, "replies": [{"body": "Its fun to talk bout, but It’s not going to happen.  The fed is going to be pressured to put those assets in a major institution with deep liquidity, which Elon does not have.\n\nAnd it actually wouldn’t surprise me if there were a couple of big banks that would be enthusiastic about taking over SVB.  It’s actually not that far underwater (it’s assets are actually high quality) and It’s a customer set that those guys dream about having.  I’ll bet you it goes to Goldman.\n\nThe only hope Elon has is if the fed doesn’t step in, which I find extremely unlikely.", "score": 18, "replies": []}, {"body": "Right now a measly 2.5 billion.", "score": 6, "replies": []}, {"body": "No “we” dont", "score": 5, "replies": []}, {"body": "Agreed.", "score": 0, "replies": []}]}, {"body": "He can still have a successful Twitter without buying a bank. They aren’t mutually exclusive.", "score": 4, "replies": []}, {"body": "Why?", "score": 2, "replies": [{"body": "?", "score": -6, "replies": [{"body": "Why is a successful Twitter good for Tesla shareholders?", "score": 5, "replies": [{"body": "why don’t you do a thought experiment and ask what happens if twitter isn’t successful on its own…. good luck.", "score": -6, "replies": []}]}]}]}]}, {"body": "Musk is a PEP and the idea that the SEC (who removed him as Tesla Chair) and the FDIC would allow Musk to purchase an institution of public trust is hilariously devoid of the outer limits of reality. ![img](emote|t5_n9evv|3838)![img](emote|t5_n9evv|3981)![img](emote|t5_n9evv|5717)![img](emote|t5_n9evv|3837)![img](emote|t5_n9evv|3867)", "score": 9, "replies": []}, {"body": "It’s his money/company.", "score": 8, "replies": [{"body": "IIRC Musk is “cash poor” still. Where would he get the cash? No bank wants to buy SVB themselves so you can’t justify a loan from a bank. Would he have to sell $TSLA?\n\nAlso, not his company. It’s a public company.", "score": 10, "replies": []}]}, {"body": "How about being open to the idea of focusing on what you already have on your plate. How much more of a beating do the $TSLA shareholders have to endure?", "score": 6, "replies": []}, {"body": "Musk can do whatever he wants with his money is this not a free country?", "score": 5, "replies": []}, {"body": "Sure, leave Tesla first", "score": 4, "replies": []}, {"body": "No way....focus.", "score": 5, "replies": []}, {"body": "Buy it, make everyone whole, eat the loss with your personal fortune, prop up silicon valley and the economy in the process, and earn back major brownie points with the world.\n\nBut knowing him, if he buys it, its only in order to execute some darkvillian scheme which has nothing but some strange perverse upside for himself.\n\nJust kidding, but at what price would this become a decent idea before someone else scoops it up? If you want to be a bank, start one at 0, don’t buy one in the negative… Elon has created a bank out of thin air before… (PayPal).\n\nThis is nothing but bluster and publicity… well played, Elon.", "score": 3, "replies": [{"body": "Lol, there'd be no brownie points, instead titles like \"Musk fired hard working people from Twitter before bailing out his rich silicon valley investor friends\"", "score": 20, "replies": []}, {"body": "You're not too bright if you think anyone who would buy a failing bank so they can give anyone money back.", "score": 4, "replies": []}]}, {"body": "Tesla shareholders could never catch a break.", "score": 2, "replies": []}, {"body": "“My legacy will be getting people to Mars, making the world completely independent of fossil fuels, and buying failing social media and bank companies that I know nothing about thereby effing over all my company shareholders and eroding their livelihoods.”\n-Elon Musk\n\nShareholders: “Come on bro! Just fucking stop!”\n\nI think this dude is brilliant but he’s letting his fame get the best of him. It changes people, smh.", "score": 1, "replies": []}, {"body": "Elon is distracted big time if he does so with his tsla holdings.", "score": 2, "replies": []}, {"body": "What benefits are there in making such a purchase?", "score": 1, "replies": [{"body": "His everything app, where he will want to do payment transactions etc, could give him a big head start", "score": 5, "replies": []}]}, {"body": "It’s probably not a bad idea for twitter. It’s just not great for tesla unless he can get a new ceo to start asap.", "score": 0, "replies": []}]}
{"title": "Time like this you know which companies have integrity. Only a few companies filed an 8-K on their deposit in SiVB, where are the rest?", "selftext": "Apple, META, Google, Netflix, SalesForce and all of the other big tech companies who have hundreds of millions if not billions of dollars in SiVB are keeping quiet.  The collapsed of SiVB will let us know if any companies had been lying about their earnings.  Madoff 2023 is among us.\n\nThe feds must not intervene and we are going to learn very quickly about the GOP led Congress.\n\nI have been saying this for days, the Feds told us about rising interest rates for over a year, and if you want to ignore their warnings, it is time for you to live with the consequences.  No bailout!\n\nIf the feds stop raising rates to achieve their targets, they are useless and should be eliminated.", "id": "11oud3l", "created_utc": 1678566924.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 44, "comments": [{"body": "OP if this post goes to negative, you wre getting banned for 4 days. This posts shows you dont have basic understanding of things, but yet you still want to give your opinion.", "score": 1, "replies": [{"body": "reading this, then seeing 0 points, i had the power of a god", "score": 0, "replies": []}, {"body": "oh nooo. I am going to be banned!  What a joke, why don't you just ban me already.  Like I care!\n\nAnd your opinion is trash, I forget more than you will ever know.", "score": -13, "replies": [{"body": "Ban this man mods", "score": 4, "replies": []}, {"body": "I’m with you and I like your spirit in the face of certain demise.", "score": 0, "replies": []}]}]}, {"body": ">I agree, the federal government should not bail out companies that have made bad decisions. If interest rates rise and companies can't afford to pay their debts, then they should go bankrupt. That's how capitalism works.", "score": 22, "replies": [{"body": "Did you listen to David Sacks take on the latest pod? Laughable. \n\nMy take: No free lunches. You have 10 millions dollars sitting as a bond paper let it mature or sell it for a loss. But try to change policy after losing millions lmao", "score": 12, "replies": [{"body": "🤣🤣he’s a charlatan", "score": 4, "replies": [{"body": "He even after loudly calling it not a bank calls the whole FTX an run on a Bank lmao 🤡", "score": 3, "replies": [{"body": "DM me the link to listen", "score": 1, "replies": [{"body": "🤣🤣DM me the link to listen", "score": 1, "replies": []}, {"body": "It's on YouTube lol\n\nThe All In Podcast", "score": 1, "replies": []}]}]}]}]}, {"body": "Preach VM. Preach.", "score": 3, "replies": [{"body": "😂😂He got it right this time", "score": 4, "replies": []}]}]}, {"body": "FAANG Wouldn’t hold so much money at SVB. They would be very dumb given all the sophisticated products big 4 banks give them.\n\nSVB doesn’t have the tech capabilities for this", "score": 14, "replies": [{"body": "Exactly. SVB is a startup bank, not an \"all-tech-industry\" bank.", "score": 13, "replies": []}]}, {"body": "Any source on who, even without how much, has money in SVB?", "score": 7, "replies": []}, {"body": "seems like you are heavily shorted in the market just imagine if a big rally happens", "score": 3, "replies": []}, {"body": "Building on this, according to the WSB front page post: \n\n>\"If we mark to market those losses, there is another 80-100 billion in losses\n\nWhy is this relevant (or as relevant) with bonds?\n\nThe purchaser will receive their full investment on maturity.", "score": 1, "replies": [{"body": "A bond is a financial instrument, it’s coupon rate is fixed and only represents one part of calculating its value. Bond portfolios have to be constantly updated to prevent losses in a rising interest rate environment.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -11, "replies": [{"body": "Trump authorized the first two of the three payments, are you an 8th grader?", "score": 11, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Which bills that spent trillions?", "score": 4, "replies": [{"body": "[deleted]", "score": -10, "replies": [{"body": "Which bill?", "score": 5, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Trillions were printed in 2020 during covid. Biden took office in 2021. IDGAF about Biden, but you're just lying at this point. \n\nAlso, which bill?", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Member when Trump went on Twitter and CRIED and CRIED for more QE?\n\n\"The US economy will go up like a rocket!\"\n\nDirect quote. Well he got what he wants.\n\nBiden's probably (intentionally) going to lose the next election. Repubs will get shafted with the fallout. Higher taxes under a Republican. Gonna be funny. GHWB all over again", "score": 1, "replies": [{"body": "I'm not a Trump fan but fact is, he was a much better president than Biden and most everyone I know had a financially better life under Trump. Much better. People were prospering, particularly people of color. It's a good thing that minorities did so well under Trump, isn't it? It's a good thing inflation was 2% or less under Trump. isn't it? \n\nI'm not the type that gives a shit about personalities or appearance because this isnt a beauty pageant, it's a business. So, Trump's over the top assholeness didn't bother me a bit, and neither does Joe bullshit bravado and constant lying about his past. I judge both on how this nation is doing under their watch. And were fucked. Get ready for a landslide tomorrow when the other 3 or 4 banks come out about failing themselves. (But rest assured that tens of millions of your tax dollars are being put to work doing gender study initiatives in Africa, and a few mil are going to build Michelle Obama park, thank God! Even more of this sound finance in the 8tril budget just put forth)\n\nOver 75% of the people think this nation is headed in the wrong direction. That's an incredible stat, not sure if 75% of this nation has ever agreed on anything outside of national security. (Until Biden decided to become the drug cartels biggest trading partner)\n\nAre you one of the 25% that think things are going well?", "score": 1, "replies": [{"body": "Ha. I can tell you aren't great at long term planning. Most Americans think economic problems are created last year, not over a decade or two.", "score": 1, "replies": [{"body": "LMAO, I'm a retirement strategist, helping folks plan for early retirement through investing smartly. Average plans are 30 yrs.\n\nI ask again, is it a good thing that minorities did so well under Trump? By \"well\" I mean better than they ever have in the history of this nation! Bravo, right? And is it a good thing that the overwhelming majority of Americans were significantly financially better off under Trump, right? It's good when American's are doing well, isn't it?", "score": 1, "replies": [{"body": "We get it, you want 2% rates and all that recessionary QE back.  \n\nI'm guessing you've recently found your calling as a retirement Strategist, but are now finding that your strategies don't work outside of unlimited money printing lol.\n\nThe next couple weeks are going to be rough, but idiots like you think Biden tells the bank to keep low rate treasuries as their valuation backstop.\n\nTrump's 2017-2019 recessionary levels of QE, if you even know what that is, was gasoline on a wood fire, and banks were stupid. Now they're begging for a handout and you can't put a cause to an effect.\n\nMy shit' s been doing great since i account for the reliable 10-15 year pull backs. Tons of cash to dump in once this sell off is complete.\n\nShould have been prepared, bud. Now you'll just look clueless to your customers. If you get any more customers.", "score": 1, "replies": [{"body": "Of course not. Only a fool would want 2% interest rates with 2% inflation. I'm much smarter than that and love the 4-5% rates, who cares about the 8% inflation when I have 4-5% rates, right? (12% inflation in real life)\n\nAnd I don't recall saying Biden tells banks anything, you just magic'd that out of thin air. Why would you just make up bullshit like that?\n\nAnd that's quite an astounding bit of \"intuit\" you've popped out your butt about my \"new found calling\". 35yrs and still going strong. About 90% of your posts are this fantasy bullshit you pluck from the ether, but OK, that's a good way to do life, right? LOL\n\nJust so you have a clue, what happened at SVB is quite simple. Long term debt was purchased by the bank at historically low rates. Fatally bad idea. So I'll make numbers up to keep things easy for you in this example. \n\nLet's say they bought 200 billion worth of bonds, and had 180 billion in deposits (which banks view as debt). The 20 billion amount over debt is SVB's \"equity\". All things fine if all things stay the same. They didn't. The rising rates made the bond prices fall hard (value)  dropping the 200 billion purchase down to 170 billion in value while still \"owing\" 180bil to depositors. Now, SVB \"owns\" nothing and owe their clients some serious money. Regulators took control when they discovered this. It's just as simple as that.\n\nI dummied this down as far as I could for ya, I hope you can digest it.", "score": 1, "replies": [{"body": "Haha just you wait. This is the crescendo. Keep an eye on those internet banks 😏\n\nYou know, the ones that sprang up under venture capital recently.", "score": 1, "replies": [{"body": "Do you watch the news? You're a touch behind, read up. \n\nAnd SVP was damn near all VC deposits, but it's far from new. Been around for 40 years or so. The newly founded banks that are underwater recently are crypto centric, not VC money.\n\nAll banks, including JPMorgan/Chase are on the edge, if not over the edge already. SVP only had 15bil in unfunded liabilities and that was way too much, JPM has 49bil. Tick tick tick, and JPM is neither new, nor is it an \"internet\" bank.\n\nAnd as they fall, watch the insurers of these banks go bust as well. And as the layoffs pile up, the foreclosures follow. Nothing new here, we've seen this all before.\n\nThanks to the \"monetary policy\" of the people voted into office, we may be looking at a US dollar meltdown. Nice work, and they all got stinking rich screwing us.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "https://www.cnbc.com/2019/04/30/trump-calls-on-fed-to-cut-rates-by-1percent-and-urges-more-quantitative-easing.html", "score": 6, "replies": []}, {"body": "3 trillion is what you are worried about? Wait until you see how much liquidity the FED made with QE.", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "What? I mean, don't get me wrong, government spending is out of control. But the fiscal policy that the FED can implement is more effective in the short term on affecting the economy then government spending. It went from worst from before the time period you mentioned, to worse under the time period you ARE mentioning, to bad under the current time period. Can getting government spending under control help? Absolutely. But why do you think the FED has the policy control that it does, and how under its policy it can have such a HUGE effect on the global economy? The FED is the single most powerful institution in the world that can affect the economy, barring the entirety of the US Government.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Only one tool ![img](emote|t5_2th52|4641) he doesn't know!", "score": 1, "replies": []}]}]}]}]}, {"body": "This was sooooo infuriating to see this Warren c..t “grilling” baby boy JPow in that hearing recently how he has the gall to take jobs from 2Mio hard working citizens and he was stammering along all awhile I was SCREAMING at the screen …”Cut her throat! Kill her! Embarrass her! Use the money printing argument! Tell her what the “free money” did to the economy!”\n\nBut no, he was stammering along …\nInfuriating.\nI want to see the world burn now. Let’s burn all this down and rebuild better as these morons said all along while they filled their pockets as we worked our asses off to make ends meet!", "score": -7, "replies": [{"body": "No more Addies for this guy!😆", "score": 5, "replies": [{"body": "Dark**Hater**\n\nName checks out 🤣\n\nI for one am poor and am going to suffer either way. I also would like to see it burn 🃏", "score": 2, "replies": [{"body": "I am terrified of the dark.", "score": 1, "replies": []}]}]}, {"body": "Powell is a lawyer, he knows to measure his words carefully. Warren is 100% theater, and bad theater at that.", "score": 2, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 month ago\n**Total Comments**|113|**Previous Best DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "They are waiting next week to see if someone buy the bank.", "score": 1, "replies": []}]}
