{"title": "What companies will have grown into powerhouses in 10 or 20 years?", "selftext": "as title states, I'm looking to buy that Disney, Apple, MSFT back in the 90s.  Any companies come to mind as ones that will be absolute powerhouses in another 20 years?  If you ask me, Tesla is still on its way up.  Then maybe a biotech company like Moderna could totally keep it up and become like the healthcare medicine men of the future.  But I'm talking companies that still have a bit of a lower market cap.  Amazon kinda pulled a fast one on us and went from a bookstore to a retailer.  We need something like that.  Guess maybe like a Palantir, they've shown ability to branch into other businesses.\n\nTo become a powerhouse you almost need like a monopoly over a unique product.  That's what allows for a high profit margin which in business is the cream of the crop.  With Apple you have the iphone, with google you have google search, with Facebook what are you gonna do use myspace?  So its that ability to develop a unique product that people want and ability to charge whatever for it.\n\nSo whats like your 20 year play? your ultimate long play.  ", "id": "p7nneh", "created_utc": 1629407117.0, "score": 4, "upvote_ratio": 0.56, "num_comments": 78, "comments": [{"body": "Most fund managers say their biggest winners came from companies they found that graduated from small cap to mid caps. So I’d look in the mid cap space. Anything over 2 billion and anything under 35 billion. I’m looking for 20-50 baggers so I haven’t really found many yet but I’ve got a few interesting prospects.", "score": 33, "replies": [{"body": "Oh really now, care to share? Asking for a friend, me, I’m the friend.", "score": 11, "replies": [{"body": "3 that I’m currently doing more research on. BR, IT, and SPSC.", "score": 7, "replies": [{"body": "Awesome and I just read your comment pertaining to playing SPY long term, and you suggested VOO. I’ll extend the question in it’s proper thread, but definitely curious as to why. All you hear about on Reddit is SPY SPY SPY. Thank you for sharing your interests, definitely earned a follow.", "score": 3, "replies": [{"body": "Even a small difference in expense ratios can mean you pay a lot more money for the same performance. SPY is much more liquid so it’s better for selling options as the bid ask spread tends to be tighter, but if you’re buying and holding for a period of 10+ years and not actively managing it VOO will out perform SPY because of the difference in expense ratio.", "score": 7, "replies": [{"body": "So many attributes to a play, I’m constantly uncovering something new as a beginner. Do you post any place else, like Twitter? Much easier to follow through notifications, but I’ll add you to my custom feed. Can learn a lot just reading behind sharp people. Take care.", "score": 4, "replies": []}]}]}, {"body": "BR + IT have a very low current ratio .\nFUBO + DKNG + LCID are my choices 2-35B", "score": 2, "replies": [{"body": "I don’t value companies debt using the current ratio.", "score": 1, "replies": [{"body": "It establishes if how easily can they pay their debt. To me that's essential", "score": 1, "replies": [{"body": "Net Debt to Ebitda is a better measure IMO.", "score": 1, "replies": [{"body": "But many  companies have negative EBITDA .", "score": 1, "replies": [{"body": "Yes, that is when it is appropriate to use what you mentioned to make a decision on the companies liquidity risk.", "score": 1, "replies": [{"body": "Thx. The truth is I look at very little. \nLow float + insider ownership 10-25% + quick/current rate . EPS + EBITDA + ROE + ROI  when positive.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "thanks dude, was looking for some red pills", "score": -2, "replies": []}, {"body": "this comment has aged quite well, what are you currently looking at?", "score": 1, "replies": []}]}, {"body": "You could also consider investing in the S&P 400 (like the 500, but for midcaps exclusively).  IVOO and IJH are some examples.  There is also some literature that suggests [mid caps tend to outperform small caps and large caps over the long run as well](https://www.spglobal.com/spdji/en/documents/research/research-sp-midcap-400-outperformance-and-potential-applications.pdf)", "score": 5, "replies": [{"body": "I hold mid cap index in my 401k but I don’t hold any ETFs or Index funds in my IRAs or Brokerage accounts those are for individual stocks IMO.", "score": 1, "replies": []}]}]}]}, {"body": "STEM (or something in the clean energy storage sector)\n\nIf at some point we smarten up and convert our power grids to clean energy someone in this sector will be a powerhouse and I believe that will be STEM.", "score": 10, "replies": [{"body": "Like Encavis! They’re selling energy to amazon in all Europe.", "score": 2, "replies": []}]}, {"body": "Honestly I still think Disney is a good buy in 2021 and can see them continue to grow and perform well for the next 10 years. I’m still buying Disney stock every month and will do so until something changes, I believe that they will overtake Netflix in the amount of users for Disney+ by 2025. People sleep on the mouse", "score": 20, "replies": []}, {"body": "My 20 year play stocks revolve around climate, cloud, and grocers. \n\nClimate is fucked. The last big report says we have 30 years of warming “locked in”. And unless everyone fixes their shit tonight there’s no stopping it. \n\nAggressive: KRBN\nSolid: NEE, FSLR, ENPH\nIn a league of their own: Tesla, VWS\n\nCloud is the future and many legacy companies have yet to make the transition, many companies will carve out a space here. \n\n(I don’t mention chips here hope everyone has some exposure to them) \nAggressive: DDOG, Okta, BABA\nRock-Solid: GOOG, AMZN, MSFT\nLeague of their own: SNOW, CRWD\n\nCan’t go wrong with grocers. Especially with the leeway I’m giving myself with defining a grocer. \n\nAggressive: ACI, SFM \nSolid: BJs, DG, KR \nLeague of their own: Costco, Walmart\n\nDisc: I don’t own all these stocks, nor am I a financial advisor", "score": 6, "replies": [{"body": "hmm I like this CRWD company.  Nice find.", "score": 1, "replies": []}]}, {"body": "I don’t know which company it will be, but Genomics will become a huge thing in the near future. Agriculture, medicine and a lot of chemical products won’t be the same, the addressable market is enormous and the technology offers huge efficiency gains.", "score": 5, "replies": [{"body": "prob have to dig deep and find the genomics start up with that CEO whos got an insane resume.  Maybe Ivy league/stanford young scientist turned medical business executive.", "score": 1, "replies": []}]}, {"body": "10 to 20 years? CRSP hands down will be in the 1k per shares range", "score": 15, "replies": [{"body": "Why CRSP and why not another genetics company?", "score": 4, "replies": [{"body": "Royalty", "score": 3, "replies": [{"body": "can you post some dd", "score": 2, "replies": []}]}]}]}, {"body": "The ones that invest the most into R and D. I think Amazon allocates about $40 billion currently.", "score": 3, "replies": [{"body": "Amazon is unbeatable! They just didn’t grow big for nothing, they were first in many things such as cloud (although Microsoft, apple, google were already having their main core business in computing but Amazon was and is much far ahead)\nThey’re planning much more growth than anyone expects!", "score": 2, "replies": []}]}, {"body": "Water water water water, look into water", "score": 3, "replies": []}, {"body": "TLRY, has the footprint to be worldwide grower.", "score": 3, "replies": []}, {"body": "Genomics for sure. Just remember the  mesager RNA vaccines that kind of gave us a regular life back after COVID come from genomic research going back about 20 years. I am not sure if the company that will explode is already on people's radar though, I am keeping an eye on the sector. Another sector might be in robotization like $PATH. What happened in the 90' with industrial robots is next to happen with back-office jobs where highly paid people just move papers and ping-pong emails in various teams. You would be surprised how many useless people big corporation have as operational support, people that only exist because management doesn't get any incentives to optimize  as money is coming easily.", "score": 3, "replies": []}, {"body": "DKNG", "score": 7, "replies": [{"body": "How? It’s already got a massive market cap", "score": 2, "replies": []}, {"body": "I second this. Huge potential. I need to add on to my tiny position.", "score": 3, "replies": []}]}, {"body": "I’m interested in Pyrogenesis $PYR. Disruptive plasma technology that hasn’t taken off yet.", "score": 4, "replies": []}, {"body": "the holy grail of investing. \nwhile we are dreaming , i would love a pony.", "score": 5, "replies": []}, {"body": "PLTR, SOFI, ABNB , DT, SQ .... just few on top of my mind.", "score": 9, "replies": [{"body": "i rly like sofi and sq I'm long on those.  Price is just a bit high on them alrdy.  Looking for like that small cap -micro cap tier company with insane growth potential", "score": -1, "replies": []}]}, {"body": "Small caps..but you need to stomach them…ughh\n\nEH, LKCO, joby (any stock UAM or electric planes) have technology and good future market access…..but as I said, you need to stomach the waves…not for the weak.\n\nBut then again, Google, Microsoft, apple (almost bankrupted) and any stock today that grew big, had to wait many years before takeoff.", "score": 2, "replies": []}, {"body": "An industry that I would love to invest in for say 15 years into the future would be something that I'm not sure exactly what it's called. but it would combine robots that could do fine articulation. Small robots, millions of them, capable of fine articulation. This would be combined with A.I. and they'd be the new era in manufacturing things. Automation. All fast food restaurant's completely automated, with no need for any human workers. Just the tip of the iceberg. So, I'd want to invest in companies that were super advanced in robotics, along with logistics and how to pair that up with machine learning and neural networks. \n\nWhat would this industry be called and who are the leaders? I know about KUKA, the German company.  (Traded on the German Stock Exchange) Also Kawasaki Heavy Industries, Ltd. (KWHIY), Yamaha Motor Co (YAMHF), ABB, Fanuc, OMRON Corporation (OMRNY)\n\nBut I'm sure I'm missing some factory automation specialist companies or something", "score": 2, "replies": [{"body": "Might want to look at UiPath and Blue Prism", "score": 1, "replies": []}, {"body": "Keyance (Japan) and TKH group (Netherlands)", "score": 1, "replies": []}, {"body": "ARVL", "score": 1, "replies": []}]}, {"body": "Well… it’s probably a combination of things.  I think AAPL had been around for 20 years and nearly went under… and then they invented the iPod, and then the smartphone.\n\nI didn’t follow the market back then, but I don’t see how anyone in 1997 could have possibly known that a company that made clunky desktop computers could in the next decade revolutionize consumer technology.\n\nI also don’t know how someone would have known a brand new search engine in early 2000s turned into a top-5 company.\n\n\nIt is good to be looking for winners, but in some cases it is not reasonably possible to precisely predict which small companies (if they even exist yet) will be the top-10 companies of tomorrow.", "score": 2, "replies": [{"body": "Microsoft bailed them out. Bill gates is the reason Apple still exists. \nAnd apple made the iPod, allegedly, because Steve Jobs hated the mp3 player he owned.  Blackberry invented the smart phone. \nWhat Apple did really well is focus on good user experience and becoming the luxury brand. They also lock their customers into their ecosystem so owning many of their devices enhances usability. \nApple has never been an innovative company, but their execution on making emerging technology easy to use and to create demand for it is second to none. \n\nTo look at your example though, a truly gifted investor would have seen iTunes as the biggest development in the company's history.  ITunes taught their customers to start paying for digital content that they could use on their Apple devices. This was a crucial turning point because, since then, a lot of their profits come from digital content sales, which is almost all profit, and they created demand for redundant devices.  So now you have the laptop, and the phone, and the watch, and the tablet and the ear buds, and they all have the same user interface, the same apps and content. It's so easy to keep spending money with them, once you start. \n\nBut hey, I didn't realize how big of a deal it was either...", "score": 2, "replies": []}]}, {"body": "I am waiting for the big autonomous tech companies to go public (Waymo, Cruise, Argo, considering entering a position in Aurora currently). These have way more room to run than Tesla and I believe that their approach is much more well reasoned.", "score": 2, "replies": [{"body": "Waymo is owned by Alphabet, why would it ever go public?", "score": 3, "replies": [{"body": "They're very likely to get spun off.", "score": 0, "replies": []}]}, {"body": "BOTZ etf", "score": 1, "replies": [{"body": "Those are more industrial companies, that while primed for growth are not going to see the same sort of return as self driving.", "score": 1, "replies": []}]}]}, {"body": "One of these: NTLA, EDIT, BEAM, or CRBU", "score": 1, "replies": []}, {"body": "Baba, dkng, curlf, pltr, qs, crsp, lac are my bets on the future. I think all of these will be the leaders in their fields in 10-20 years. Some (not going to lie, all of them except maybe baba) are high right now. I am buying curlf as long as my monthly market purchase. Curlf feels like more of a 5year time line, so I am adding most to it.", "score": 1, "replies": [{"body": "I'm a big believer in CURLF cuz Web3 is part of the metaverse but bought at 1.92 then 1.46 then more at 0.80. So I'm down 64,%", "score": 1, "replies": []}]}, {"body": "Maybe DKNG . They are getting into nft and other virtual stuff.", "score": 1, "replies": []}, {"body": "Wait I thought I was on r/stocks, not r/What Could Go Wrong", "score": 1, "replies": []}, {"body": "Idk, let me pull out my crystal ball and see the next Apple or Microsoft", "score": 0, "replies": []}, {"body": "You said Tesla is on its way up. That sounds like high conviction. Unless you find something with that same conviction, it’s fine to hold mostly Tesla. Diversification is for fund managers managing billions of dollars to preserve wealth and not shake the market with one stock. For individual investors wanting to 10x their money, concentration in some high potential growth stocks that you have a high conviction in is actually less risky, since you only need one to blow up to make considerable gains.", "score": -9, "replies": [{"body": "Tesla price is just mad high alrdy.  I think they can 5x still but... idk they've alrdy like 200x.", "score": 3, "replies": [{"body": "Remember when people thought Amazon was overvalued in the 2010’s?\n\nIt’s up to you. Do you want essentially guaranteed high growth over a 10 year horizon? Or do you want to go for quick gains, but equally quick losses. Lol people downvoting cuz they’re in the second boat.", "score": -2, "replies": [{"body": "Take it easy bro. Some people just aren’t comfortable investing in just one name", "score": 4, "replies": [{"body": "Sorry if I came off strong. At the end of the day, it’s up to you. I gave my option, albeit maybe a bit too strongly.", "score": 1, "replies": []}]}, {"body": "please correct me if I'm wrong as I'm somewhat speaking out of my ass.  But some of that at least is priced in already.  Tesla stock is perhaps the most speculative stock on the market based on P/E.  Tesla hardly sells any cars compared to GM & Ford but has a bigger market cap than both combined.  Biggest market cap auto but they sell 200,000 autos a quarter.  Hmmm.  Based on fundamentals, their price could be half as much and still be a highly speculative, highly risky play.  Just happens that their CEO made a company that replaced NASA and functioned as their lead rocket scientist for their first rocket.  That's a pretty good guy to have at the helm.  And to think they've supplied some 70+ cargos to the ISS with automated systems leads me to believe that an FSD project by the same people seems like almost an easy feat by comparison.", "score": 1, "replies": [{"body": "Building rockets is a very different problem than not hitting people on city streets. FWIW, Elon does not actually have a history of AI outside of Tesla. Building rockets and making them land is a hardcore engineering/physics/sensing/real time computing challenge but it has absolutely nothing to do with AI. The same algorithms they use to self stabilize the rockets have existed in some form since the 80s.", "score": 1, "replies": [{"body": "B4 SpaceX, NASA did not have reusable rockets.  They can land a rocket standing straight up on a platform in the ocean.  And the algo for SN-15's landing certainly didn't exist in the 80s.  Not even sci-fi could have predicted the belly flop from space maneuver.\n\nPoint is, he's legit accomplished a lot at SpaceX already kind of pushed rocket science to new heights.  And that's an easy guy to believe in, if you can do that, you can do anything.", "score": 0, "replies": [{"body": "Yes it did, its effectively an inverted pendulum control problem- not actually hard, just requires lots of measurements and good mechanics to enabled fine grain control.", "score": 1, "replies": []}]}]}, {"body": "You have a good point dude. Tesla is a very speculative stock. But at the same time there are people who don’t believe in it. Think of the stock price potential when Tesla becomes a speculative stock, but with more people buying in because Tesla has some better fundamentals. Sure there will be bumps along the way but I don’t see any reason Tesla won’t grow at least 5x in 5-10 years.", "score": 1, "replies": [{"body": "it just might 5x in 5 years but that doesn't mean the valuation was correct then or now.", "score": 1, "replies": [{"body": "Valuations are subject to investor sentiment. It’s not cut and dry based on numbers.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "Not sure, but I know Google will be going strong.", "score": 1, "replies": []}, {"body": "Tilray", "score": 1, "replies": []}, {"body": "I’ve been saying this but nobody seems to listen. JOBY", "score": 1, "replies": [{"body": "meh they probably thought about that for the first helicopter companies but in 2021 we still don't see that many chopper in the sky.  I'm sure these will sell just don't see demand being there.", "score": 1, "replies": []}]}]}
