{"title": "AMD!!!!!", "selftext": "Bought a $113 call exp 8/13. What r ur thoughts. Should i hold or just take my mini profits and run?", "id": "ox8hjo", "created_utc": 1628012091.0, "score": 52, "upvote_ratio": 0.74, "num_comments": 77, "comments": [{"body": "Sell immediately", "score": 106, "replies": [{"body": "It's a blue sky bull.  There's absolutely no technical resistance above.  It's your call.  LITERALLY.", "score": 23, "replies": [{"body": "Until there is..resistance lines are made up of previous data..not future data", "score": 20, "replies": [{"body": "Pattern traders are idiots.", "score": 8, "replies": []}]}, {"body": "There was a pretty head and shoulders today. Expect a dip tomorrow", "score": 3, "replies": [{"body": "Sorry what does head and shoulders mean? It sounds like new high bar, higher high bar and then lower high bar, idk if that’s explained and sounds right to you 🤣", "score": 3, "replies": [{"body": "it's a crystal ball with dandruff shampoo inside telling you the price will go down.", "score": 18, "replies": []}, {"body": "Astrology bullshit that's wrong more than it's right.", "score": 6, "replies": []}, {"body": "Lmao. This is so funny. $AMD is going to the moon.", "score": 1, "replies": []}]}]}]}]}, {"body": "I would sell, it’s going to correct soon imo. Regardless I’m still long AMD, 200 shares at $36!!! Wish I had more $$ at the time", "score": 57, "replies": [{"body": "Super price. This guy fucks", "score": 26, "replies": [{"body": "I got 162 @$28.99 and thoughts it was a bad price", "score": 5, "replies": []}]}, {"body": "Greed. It'll take you down.", "score": 2, "replies": []}]}, {"body": "No one every went broke selling for a profit.", "score": 46, "replies": [{"body": "No but some people panic and take profits way too early.\n\nEvery case is different. I tend to let winners run, if they sprint cool. If not I'm happy taking a smaller profit. You're missing out on potential big gains by exiting too early.", "score": 13, "replies": [{"body": "Just as easily as it runs up it can come down. A small profit is much better than being in the red", "score": 20, "replies": [{"body": "If you take profits early every time (assuming you have an actual positive expectancy on the position) and bag hold losses, you are going to mess up your profit and loss distribution to be way more skewed negative, and also lower your average profit.", "score": 0, "replies": [{"body": "Some people would rather risk management and being content with selling for a safe profit rather than going red trying to squeeze every last penny from trying to time the market which almost never works well", "score": 1, "replies": [{"body": "I never said anything about squeezing out every last penny, and I definitely didn’t say anything about timing the market (I personally do neither).\n\nI’m simply talking from a purely mathematical standpoint that statistically your better off on average holding a position if your original thesis is still in play. That isn’t to say there won’t be some variance in doing so, but that’s just how trading is.", "score": 1, "replies": []}]}]}]}, {"body": "A win is a win", "score": 3, "replies": [{"body": "All day!", "score": 1, "replies": []}]}, {"body": "Like Nickola?", "score": 1, "replies": []}]}]}, {"body": "If you have to ask Reddit if it’s time to exit then you should exit immediately. Don’t hold a position without a strategy.", "score": 19, "replies": []}, {"body": "I’ve got Jan 22 $90 calls that are up 200% the past week. I’m asking myself whether I should sell or hold.", "score": 17, "replies": [{"body": "Sellll", "score": 16, "replies": [{"body": "I sold.", "score": 18, "replies": [{"body": "How was the profits?", "score": 3, "replies": [{"body": "The profits on this last two weeks with AMD are phenomenal. First big big trade I’ve had since buying GME shares at an average cost of 52 and selling them in the 150-170 range after the big crash", "score": 2, "replies": []}]}, {"body": "Wise choice. I got out this AM as well.", "score": 1, "replies": []}]}]}, {"body": "Don’t let greed take over", "score": 7, "replies": []}, {"body": "Same here.", "score": 1, "replies": []}, {"body": "Random question but can you sell options after hours?", "score": 1, "replies": [{"body": "Nope", "score": 9, "replies": []}]}, {"body": "If it was me I would take a tidy profit now and let the rest run, but you do you bro.", "score": 1, "replies": [{"body": "How do you take partial profit with options?", "score": 0, "replies": [{"body": "You sell some of the contracts....", "score": 3, "replies": []}]}]}]}, {"body": "Take the money. Move to the next trade.", "score": 7, "replies": []}, {"body": "Set up a trailing stop loss order. Lock in some gains, but don't miss out on future upside.", "score": 4, "replies": [{"body": "Trailing stops are some what fallacious.\n\nTrailing stops lower variance, but do not actually simply remove the bad part of the profit/loss distribution, and it forces average profits to become lower on a positive expectancy trade.", "score": 1, "replies": []}]}, {"body": "Maybe consider rolling to 8/20 or further out.", "score": 5, "replies": [{"body": "how do you roll a call?", "score": 1, "replies": [{"body": "Depends on your platform. Most likely all you need to do is set up your sell order for your calls, while you’re on that order form choice the option to add an option leg. Now select the option you want to buy.", "score": 1, "replies": [{"body": "I'm confused. From what I can gather it sounds like you would be paying a debit to roll. Not that you can't do that but I don't really know why anybody would. Maybe if OP has the capital to sell a naked put along with it to receive a total credit it might be more enticing.", "score": 1, "replies": []}]}]}]}, {"body": "Sell em.. Take the gains!! Better then being in the red anyway of the week 🚀 Throw em into the next set of leaps.. AMD & PFIZER calls expire next Friday I sold em all, the PFIZER calls I should held on I think to at least 10 since $41 calls and I paid $35 a piece on 45 of em", "score": 4, "replies": []}, {"body": "I honestly hate these posts. It’s almost like people are surprised by the fact they made money.\n\nIf you think your trade still has edge, hold it, and if you don’t sell it. If you don’t know, and you didn’t know in the first place you shouldn’t have entered it.", "score": 5, "replies": []}, {"body": "ALWAYS TAKE THE PROFITS", "score": 9, "replies": []}, {"body": "Why does everyone have paper hands? Lol Nvidia probably losing ARM deal and Intel is not even competitive. AMD is gonna eat all their lunches", "score": 3, "replies": [{"body": "But TSM is going to actually make all their chips, even Intel’s! Why are my TSM calls not going anywhere? 🤔", "score": 1, "replies": []}]}, {"body": "Sell on news and count your blessings!", "score": 2, "replies": []}, {"body": "This is why I always buy more than one call. Sell some, keep some = profit.", "score": 2, "replies": []}, {"body": "Sell that shit it's  overextended. Long-term $150+ tho", "score": 2, "replies": [{"body": "Yeah I can’t wait for it to come back to reality, then I’ll load up on LEAPS", "score": 1, "replies": []}]}, {"body": "Your a week late", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Wanted to grab some puts today but talked myself out of it. Screw-up on my part; feel like it's gonna start coming back down tomorrow.", "score": 1, "replies": [{"body": "Consider ratio spreads. If it keeps going up, you win. If it drops, you win more. If it really tanks, sell the long spread for a profit, and roll the remaining put. Worst case, take assignment and sell CCs.", "score": 1, "replies": []}]}, {"body": "You sound like another broke American who lives in his grandparents basement playing video games all day kid.", "score": 1, "replies": []}]}, {"body": "Where can I learn how to option trading at?", "score": 0, "replies": [{"body": "tasty trades have a ton of how-to video's on options trading on youtube.  Seriously worth checking out.", "score": 5, "replies": []}, {"body": "Tastytrade as mentioned is good. I think the Mike and his Whiteboard segments are excellent. But sometimes when I watch tastytrade I feel like the topics aren't really practical enough or sometimes they'll go on a tangent for ten minutes on something not even related to trading. I'm a bigger fan of Option Alpha as it feels more to the point. Sometimes he'll have episodes that aren't specifically related to options trading but he'll tie it together which males it worth your time. Not to mention the fact Kirk is really good at public speaking, at least in my opinion anyways.", "score": 2, "replies": []}, {"body": "For beginners? Kamikaze Cash. Once you understand the concepts and want more, tastytrades", "score": 2, "replies": [{"body": "Thank you, I really appreciate you helping me!", "score": 1, "replies": []}]}]}, {"body": "Sell if you are a pussy", "score": -2, "replies": []}, {"body": "Nah yolo it. I’m long with and bought at $25 it’s a solid company but depends when I play options I usually get out at 50% gain 40% the lowest", "score": -1, "replies": []}, {"body": "scale some to secure profit and let some run and see what happens but maybe set a SL at entry or a little above entry", "score": 1, "replies": []}, {"body": "Take profit and run", "score": 1, "replies": []}, {"body": "Run", "score": 1, "replies": []}, {"body": "If you’re still bullish you can roll that way you might keep and even if you go higher in the strike bank some profits", "score": 1, "replies": []}, {"body": "Eventually people will start to take profits so you may as well be one of them. I know I would. Looking at the Greeks it's got a delta of 50 so theoretically if you hold to expiration there's a 50 50 shot that it will be ITM or worthless. And that 50% chance that it's in the money is just that, being in the money, so even so it could still be worth less than what it's worth now.", "score": 1, "replies": []}, {"body": "Take profits wait for dip the buy again lol", "score": 1, "replies": []}, {"body": "I have been buying and selling AMD calls every day.  I'm not holding them.", "score": 1, "replies": []}, {"body": "Sell it in profit and buy a cheap call for either higher price strike or for this Friday", "score": 1, "replies": []}, {"body": "Have AMD 110 call for 8/27 I’m riding it out for a bit longer.", "score": 1, "replies": []}, {"body": "Hold.", "score": 1, "replies": []}, {"body": "You never know… I sold for some mini profits made quick 1200 in a day would’ve been around 6000 had I waited for today", "score": 1, "replies": []}, {"body": "I made a lil prof t'day scalping puts", "score": 1, "replies": []}, {"body": "Roll up for a credit", "score": 1, "replies": []}]}
