{"title": "Which stocks to play the Battery shortage?", "selftext": "Hi all,\n\nit’s known that the battery shortage is a challenge for Tesla and others to drive the electric revolution. What companies are best in your mind to play this?\n\nI hold Microvast for several reasons but I also look to add one or two stocks to diversify. FREY might be worth a look.\n\nThis is for sure an investment over many years. Also If you know a young, innovative company I am interested too.\n\nThanks.", "id": "p29qg5", "created_utc": 1628674687.0, "score": 49, "upvote_ratio": 0.85, "num_comments": 76, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&restrict_sr=on&include_over_18=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "ABML", "score": 15, "replies": [{"body": "Long term gonna be a winner.", "score": 6, "replies": []}, {"body": "Not a real play as they not produce or mine anything they are at this point recycle only", "score": 3, "replies": [{"body": "Incorrect.  They are in the process of building their pilot recycling plant.  They also have their own mines and are developing extraction technologies.", "score": 8, "replies": [{"body": "Why aren’t you invested in Li-Cycle who built their pilot plant in 2018 and are currently building their third full capacity plant?", "score": 5, "replies": [{"body": "Because ABML's pilot plant will be 2x the size of Li-Cycle's newest production plant and ABML's first production plant will be 10-20x the size. This, plus extraction are worth the wait.", "score": 2, "replies": []}, {"body": "I actually am, but a very small \"watchlist\" position right now.  It's still a SPAC right now.  I'm anticipating the stock price to drop after the merger, which SPACs commonly do, so am waiting for that before adding more.  I likely won't put more into Li-Cycle than I have ABML because I have a greater conviction that ABML will be more lucrative in terms of stock price.  ABML is my largest single holding, so it's my long-shot.", "score": 1, "replies": [{"body": "Li-Cycle hit the market today, and its flatlined at $10.14. I'm expecting it to drop further, at which point I'll start adding. \n\nAlso long ABML.", "score": 3, "replies": [{"body": "Oh wow!  I knew it was soon, but I didn't realize it happened today!  That is an interesting flatline, isn't it?  I'm using other SPAC mergers as sort of a guide.  For example, STPK->STEM was on April 29, which it then fell for 2 weeks from $27->$16 before ramping back up.  \n\nSince I'm expecting volatility, I'll be keeping an eye out for swing trade opportunities.  I haven't specifically decided on a long-term hold.  I heavily hold ETFs over individual companies, so my ideal would be LICY eventually being included in an ETF that I would want to buy, then liquidating my LICY position to buy into the ETF.", "score": 2, "replies": []}]}, {"body": "Good luck", "score": 1, "replies": []}]}]}]}]}]}, {"body": "LIT", "score": 9, "replies": [{"body": "Also $REMX and $batt", "score": 1, "replies": []}]}, {"body": "QS looks promising .  Volkswagen is backing them and betting big on them .", "score": 5, "replies": [{"body": "> betting big\n\nVW only put 300 million in QS. That's about 2% of their yearly R&D spending.\n\nThey've been putting about twice as much into Northvolt in 2021 alone.", "score": 5, "replies": [{"body": "Volkswagen just signed an agreement with QS to build a manufacturing plant somewhere in Salzgitter Germany.   That’s betting big, most likely bigger than their $300 million .", "score": 3, "replies": [{"body": "I have been following QS and it sounds promising, from what I gather manufacturing is the biggest hold up. According to the CEO the battery has been tested and outperforms all including Panasonic looking at the numbers. Very impressive battery. They also have several big time investors. This is just information I have gathered for my own use. YouTube QS…", "score": 2, "replies": []}]}]}, {"body": "hmm, interesting...It was on 134 not long ago?! Why the drop? Thanks", "score": 2, "replies": [{"body": "It’s speculative at best and their project still in lab.  Best time to buy when the sentiment is low.  I initiated small position last week and will built accordingly.  Stanford also betting on them and pretty sure they have much better insights.", "score": 4, "replies": [{"body": "I see. Chance to bet on a winner long term. I will look deeper into it and might start small. Thank you ;)", "score": 2, "replies": [{"body": "Yessir.  High risk high reward.  It looks like they simply polishing the product at this point.  Manufacturing could be a hurdle.  2023 was the plan and another one was 2024.  You got plenty of time to assess accordingly while building your position.", "score": 2, "replies": []}]}]}, {"body": "Because they don’t make anything. It’s all speculation.", "score": 6, "replies": [{"body": "True.  But Toyota has publicly stated that they're planning to release a car powered by similar solid-state batteries within the next decade; I have no stake in QS, but Toyota thinks the tech is feasible.  \n\nIMO, it would be no different from putting money into Tesla when the company was at $20 or so.  \"They're not even making cars yet\" was a valid argument at the time.  \n\nThat said, I don't know how many \"Teslas\" go under as opposed to becoming profitable.  You'd probably need to know more about the battery industry and what QS is working on to make a meaningful addition to this conversation.", "score": 1, "replies": [{"body": "The fact that QS is already planning to build a manufacturing plant speaks volume.   Not a material scientist but that’s common sense.  If they don’t deliver and Volkswagen pull out, the market will be vicious.", "score": 2, "replies": [{"body": "Yeah, and that's the gamble.  Planning to build a plant isn't building one, and if they don't deliver, they don't deliver.  Which is possible.  \n\nI don't know if they're a good bet or a long shot, but there's definitely more to it than \"they don't make anything yet, so don't invest.\"", "score": 1, "replies": [{"body": "Well planning means they already polishing and refining a product.  Volkswagen signed the agreement to build one.  That’s like action speaks louder than words .", "score": 1, "replies": [{"body": "Maybe.  I'm a little less trusting after hearing so much about Nikola and Theranos.", "score": 1, "replies": []}]}]}]}, {"body": "The difference is that EVs were already produced. Tesla just made them better. What QS is working on is developing a technology that’s only theorized. It’s a much riskier bet than Tesla back in the day.", "score": 0, "replies": [{"body": "Solid-state batteries are already being used in pacemakers, RFID, and wearable devices.", "score": 0, "replies": [{"body": "Thanks google. But we’re not talking about tiny batteries here. We’re talking about battery cells to move a vehicle, which has only been theorized and is not remotely close to production. Even QS has publicly stated this!", "score": 0, "replies": [{"body": "Oh, you mean *the same thing but bigger.* \n\nThe tech exists.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Totally agree, QuantumScape now has a 10 cell battery they are testing, 6 months ahead of schedule.  They have found ways to create their separator more efficiently than expected and are installing the production equipment to create their first line of sample batteries to send to automotive producers.  \n\nI'm excited to see their company grow, and see solid state batteries produced.  We need them for widespread EV car adoption.\n\nTo me this isn't a matter of if, it's a matter of when, and how much market share.\n\nI hope to see them secure government funding from this recently announced infrastructure bill as well.  Many more positive things to look forward to with this QS, very exciting.", "score": 2, "replies": []}]}, {"body": "PTRA", "score": 7, "replies": [{"body": "FWIW, Lightning eMotors (ZEV) use Proterra batteries.", "score": 3, "replies": [{"body": "Lets fcking go!!!", "score": 4, "replies": []}]}]}, {"body": "The problem I see right now it is an oversaturated market with China still producing over 70% of the batteries (not all EV but significant). Here is an [image of NA](https://cicenergigune.com/media/uploads/mediacenter/usa_gigafactories_map_cicenergigune.jpg) and an [image of European](https://i.redd.it/7npunt9h3z561.png) existing and planned facilities.", "score": 3, "replies": []}, {"body": "GM", "score": 3, "replies": []}, {"body": "Mvst", "score": 8, "replies": []}, {"body": "Panasonic", "score": 3, "replies": []}, {"body": "LICY is worth a look if you want to do a battery recycling play.", "score": 4, "replies": []}, {"body": "If you have a longer term view and want an 8-10 bagger look at LAC, I bought last Friday at $14, began my DD ~2 weeks prior, it’s not a momo stock (yet) and I didn’t buy it for momo but if u believe EV’s are coming here’s your stock.  For you newer investors there’s a saying “if a war starts I don’t want to pick sides so rather than selling guns to one side I’ll sell bullets to both sides” here ya go", "score": 5, "replies": [{"body": "I too entered at 14. Been doin very nicely past couple of days.", "score": 3, "replies": [{"body": "Yep with hopefully a very long way to go.  BTW, I’ve never bought any mining or mineral stocks but read about this one and DMEHF (Desert Mountain Energy.  They mine for Helium-3 which is imperative for space flight and has been thought to ONLY be available on the moon!  Apparently they’ve been mining it in AZ, just signed a contract with the Government for them to buy EVERY gram they find, also the Gov’t. opened and acct with DME to pay them DAILY!! for what they get the same day. I posted something similar on another subreddit and had several people also say “nope, only on the moon, it’s the holy grail of electronic travel of any sort” EV   May be a big winner \nGoogle Helium-3", "score": 0, "replies": []}]}]}, {"body": "The best play is TSLA because they're building their own factories to solve their own battery shortage.", "score": 2, "replies": []}, {"body": "PLL", "score": 2, "replies": []}, {"body": "Exro Technology (TSX:EXRO) in Canada. Has a Electric Coil Driver and a Battery Control System which has multiple applications (36 patents). In the commercialization phase currently. Revenue to start flowing 1st quarter 22. This technology will help extend the life of the EV battery, along with other applications.", "score": 2, "replies": []}, {"body": "Rio tinto are about to become big lithium producers in Europe. Also we'll established miner so some nice dividends while their battery operation grows", "score": 2, "replies": []}, {"body": "MVST", "score": 2, "replies": []}, {"body": "$LIT $REMX and $BATT are my top ETFs for the EV battery play.  I have all 3.", "score": 2, "replies": []}, {"body": "Have a look at pyrogenesis canada and hpq silicon (not a financial advice)\nBye", "score": 2, "replies": [{"body": "HPQ is definitely a boom or bust, speculative penny stock, picks & shovels battery play. As an MTLer, I hope for their success.\n\nPYR is definitely an interesting product line that could see some serious growth with more all but guaranteed eco-friendly industrial changes, but it's a long term play as they do not have a ton of contracts for the current valuation (more reasonable than earlier this year on its big run up). that could definitely change as their offerings are proven and legit. Their plasma garbage disposal units are already on some US aircraft carriers and would be a huge improvement for cruise ships that just dump their shit in the oceans.", "score": 1, "replies": []}]}, {"body": "LIACF", "score": 2, "replies": [{"body": "This one here. One of my three main holdings for outsized growth over a few years. Just achieved a 95% extraction rate in ten minutes. Freaking mind blowing. Once the environmental assessment gets blessed (another month or so), we’ll start seeing news about sampling from across their plot, and we’ll also see progress toward the start of production. I’m expecting $8-$10 by the end of 2023, being conservative on both price and timeline.", "score": 1, "replies": [{"body": "You're actually the one that told me about it. Wish I had timed my purchase better but long term should be alright", "score": 1, "replies": [{"body": "Yeah I’m still red with my cost average (28k shares) at just above $1.60. I’m still happy with that price. Ran low on powder for now. I could come into some funds in the next week or so. Assuming it’s in the $1.30 range still, I’ll probably add another few thousand shares.", "score": 0, "replies": []}, {"body": "14% for no apparent reason! \n\n((Fistbump))", "score": 1, "replies": []}]}]}]}, {"body": "Plug power, the future is fuel cells, not rare metal limited batteries that add a ton of weight.", "score": 2, "replies": [{"body": "How do I invest in mitochondria?", "score": 1, "replies": [{"body": "Probably Ginko bioworks.", "score": 1, "replies": []}]}]}, {"body": "Nickel miner?", "score": 1, "replies": []}, {"body": "LIT had treated me well so far", "score": 1, "replies": []}, {"body": "ALB is another one. Exited the stock around $210 and thought I'll buy it on the dip, but it continues to climb.", "score": 1, "replies": []}, {"body": "Have a lil position in frey as well, besides the wtf today, I could see them Sit pretty up in the north.", "score": 1, "replies": []}, {"body": "LICY", "score": 1, "replies": []}, {"body": "RemX?", "score": 1, "replies": []}, {"body": "QS is worth watching", "score": 1, "replies": [{"body": "They don’t make any batteries", "score": 5, "replies": [{"body": "They're developing what is possibly [the future of battery technology](https://www.forbes.com/sites/arielcohen/2021/02/11/what-batteries-will-power-the-future/?sh=711c8dd641c0).  More efficient, safer, longer-lasting batteries, that charge more quickly than Li.  Toyota has set a goal of using solid-state batteries (like QS is developing) in a production-line vehicle within the next decade.   \n\nEveryone here is pushing lithium stocks, but everything you read will tell you that lithium isn't sustainable and that cheaper, more efficient batteries are in development.  Things like sodium batteries.  \n\nLithium may be a good short-term bet, but I wouldn't count on it for any long-term investments.  If anyone manages to develop a more efficient sodium battery (or one based on anything else), and that could happen next week, next month, or next year (or possibly never, but given the resources being allocated to Na-battery research, I think it's likely) -- if that happens, the entire Li industry is dead.", "score": 1, "replies": [{"body": "I know what’s proposed. They still don’t make any products and have no experience manufacturing a hypothetical product.", "score": 1, "replies": [{"body": "I'm not just talking about just QS at this point.  There are dozens of labs around the globe working on developing more efficient / cheaper batteries, that don't rely on costly materials like Li.  If any of them succeed, Li is out.", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ve got quite a bit invested in CNC ( Canada Nickel company ). They are a jr mining company based in Ontario that currently has one of the top 10 nickel reserves in the world and are quickly growing and moving towards a PEA at the start of 2022. The are providing nickel for both the battery and stainless steel industries was well as making money of iron/chrome/pgms. Also doing it in a green way… definitely worth checking out…there is some good potential", "score": 1, "replies": []}, {"body": "LODE, they own 64% of LiNiCo which is a battery recycler. The plant is already made, equipment starting to arrive soon. Production starting 1st half of 2022. 100k tonnes annual capacity eventually, it dwarfs ABMLs pilot plant. Abml value = over 1 billion. Lode = 130m, valuatin is a joke rn. Also, LODE has very much more going on. Future 10 bagger, atleast.", "score": 1, "replies": []}, {"body": "BHP materials. They mine all sorts of materials needed in batteries not to mention top copper producer and have a good divided. Buying BHP now is like buying oil stocks in the 80s, everything that moves will depend on these rare metals in 5 years.", "score": 1, "replies": []}]}
{"title": "BofA’s Geoff Meacham stated Moderna is over valued based on the fundamentals", "selftext": "BofA analyst Geoff Meacham said Moderna is over valued based on the fundamentals\n\n\nHe compared 130 years old Merck(MRK) & 40 years old Amgen(AMGN).\n\nAnd the market overreacted in co-ordination(BofA has long hands that can reach too far & wide)\nSee some facts below:\n1) 130 years old Merck and 172 years old Pfizer could not make mRNA vaccine. Pfizer is marketing German BioNTech's vaccine. PFE did not invent it.\n2) Moderna can not be assessed on age-old fundamentals. The same way Apple, Amazon, Tesla because their valuation is way over.\n3) Insulin has increased more than 1200% since it was invented.\n4) Gilead Sciences Sets US Price for COVID-19 Drug at $2340 to $3120\n5) Gilead Sciences Sovaldi, a drug that can cure Hepatitis C in 90 days when used in combination with other antiviral drugs. The initial price was more than $1,000 per day, and the total cost of treatment could exceed $80,000\n6) Moderna has only 1 product to sell. Which happens to be in the middle of a pandemic. Moderna was awarded some funding and it is keeping its prices down for Covid vaccines.\n7) Moderna does not need to keep its prices down for future products since it will not meet with a similar pandemic.\n8) Moderna has developed 100 proteins in the last 10 years but did not have enough funding to continue with the product R&D.\n9) Now Moderna has the cash and can spend money for R&D so it can release many products in the years to come\n\nNow how would you compare the company valuation when there are so many factors in play?\nBofA’s Geoff Meacham said to compare its last 4 successful quarters – Moderna started selling its only product i.e. Covid vaccine from last Dec in the middle of the pandemic.\n\nThe insulin & Gilead was added for comparison that Moderna would not need to cap its future product price(Covid vaccine price is capped due to small government funding & Pandemic) and therefore will not need to sell many doses to make up the revenue \n\nThis coordination looks very similar to Mani Foroohar from SVB Leerink that happened last year.", "id": "p22pdo", "created_utc": 1628644215.0, "score": 63, "upvote_ratio": 0.81, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|6 months ago\n**Total Comments**|11|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/p22pdo/bofas_geoff_meacham_stated_moderna_is_over_valued/) \n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n    \nHey /u/neal_b1, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "I am holding and long on Moderna and long over a year. I am not sure how I can add a screen shot.\n\nI took the screenshot but there is no option to add.", "score": 1, "replies": []}]}, {"body": "BofA deez nutz are overvalued", "score": 21, "replies": [{"body": "You probably are right 😄", "score": 0, "replies": []}]}, {"body": "First of all, everyone knows a stock usually falls after an exponential rise. BOFA is STUPID. THEIR ANALYSIS IS TIMED FOR A FALL WHICH THEY WILL CLAIM THEY SAW.\n\n\nwTF happened.", "score": 30, "replies": [{"body": "You are right about a small pullback but some weak hands were shaken by BofA’s comments", "score": 5, "replies": [{"body": "Shook me out…I’m dumping rest tomorrow.", "score": 0, "replies": [{"body": "Your shares. You can dump or burn whatever you like but I have known folks who did that at $120  saying it will never see this high again, are feeling gobsmacked", "score": 4, "replies": [{"body": "Market cap twice that of Gilead…c’mon man! Get real. It deserves a high multiple but not above Gilead. Let’s not forget the vaccine doesn’t prevent covid, it just lessens symptoms.", "score": 0, "replies": [{"body": "Wtf are you talking about, they make a lot more money than Gilead and also have higher growth prospects.", "score": 5, "replies": []}]}]}]}]}, {"body": "I agreed!  They messed up with several analysis. i think $PLTR as well", "score": 5, "replies": [{"body": "Well I think BofA is a piece of shit . At the same time, pharmacy stocks are just one or a few hit wonders every time there is an announcement. \n\nIMO anyone stuck in this stock tomorrow is waiting to catch a knife", "score": 4, "replies": []}]}, {"body": "You’re right. This is probably just a cheap way to gain credibility amongst the inexperienced investor/trader", "score": 4, "replies": []}]}, {"body": "Pfizer is Pfizer, but Moderna could be anything! \n\n\nIt could even be a Pfizer!", "score": 29, "replies": [{"body": "One of the obvious differences is the dividend. Pfizer gives a significant portion a 3.37 dividend back to investors. That is its strategy. A traditional growth stock like GSK and others vs Moderna which is more modeled after value stocks like Regeneron. Yes I know their volume and market cap are different but this is just to illustrate the dividend vs stock value pharma. Usually these companies fall into one of the types.", "score": 2, "replies": []}, {"body": "With Moderna the possibilities are endless.\nMerck,CerVac & Sanofi failed to even create an mRNA", "score": 3, "replies": [{"body": "First I must say, I don’t trust this guy for one second. HOWEVER, if his stats are on; 1 billion annual sales of COVID vaccine thru ‘38, plus 100% pipeline success, not sure a pullback isn’t in order. 75% is the BS part - they are mRNA tech (pharma), all others will follow", "score": 6, "replies": []}, {"body": "The possibilities are so endless that the Chief Medical Officer has never owned his own company’s stock for more than one day. There have been *two* insider buys since the company went public. Lots of reasons for insiders to sell, but there’s only one reason why insiders buy: they think that the company is undervalued. Only twice has an insider at MRNA thought that. It’s…curious. Not saying that the stock can’t keep going up, because obviously it can (I hope it does and you make lots of money!) but it’s interesting how almost nobody at the company shares your enthusiasm.", "score": 3, "replies": [{"body": "If you are talking about CMO Tal Zaks then he has left the company as he wanted to pursue something else in Israel.\n\nThe new incoming Chief Medical Officer is Paul Burton who was with J&J for 15 years. There must be very good reason why 15 years employment was let go for Moderna.\n\nAs for the insiders selling comment is quite baseless.\nAs of today CEO Stephan Bancel holds 7,294,880 shares\n\nAlso, the leaders at big corps have packages which has shares in large portions and their salaries are symbolic, so they have SEC approved  Rule 10b5-1 and Moderna’s legal team approved sell; which I am pretty sure you are familiar with", "score": 0, "replies": [{"body": "> If you are talking about CMO Tal Zaks then he has left the company as he wanted to pursue something else in Israel.\n\n…after cashing out every share he was ever granted and never holding them. \n\n> As for the insiders selling comment is quite baseless.\n\nUnless of course you count the 24,967,057 shares sold by insiders over the last 12 months. If you don’t count that I suppose it’s baseless. \n\n> Also, the leaders at big corps have packages which has shares in large portions and their salaries are symbolic, so they have SEC approved  Rule 10b5-1 and Moderna’s legal team approved sell; which I am pretty sure you are familiar.\n\nCiting the most abused rule in corporate governance is not persuasive. 10b5 is a fig leaf and we all know it.", "score": 3, "replies": []}]}, {"body": "Yeah so curious, makes me wonder if they know something about the vaccine might not be quite right if you know what I mean.", "score": -7, "replies": [{"body": "Millions of people have been vaccinated and you are still using last year’s comment!!\n\nModerna’s vaccine works and the latest studies have revealed that Moderna is protecting against the main variant and delta.", "score": 3, "replies": []}]}]}, {"body": "Yeah. MRNA might mean the end of so many diseases.\n\nJust imagine all STDs being vaccinated against.\n\nI bet even the moral fuckwits would be secretly lining up for it.", "score": 3, "replies": []}, {"body": "Anyone can make mRNA it's really not that hard, theres going to be MASSIVE competition from every pharma and biotech to improve manufacturing and bring the cost down exponentially.\n\n\nAnd if you're surprised that big pharma would rather partner/buy new drugs versus develop in-house, I don't know what to tell you. It's par for the course.\n\nEvery big pharma would rather buy a late stage product for $2-10B than buy early stage programs that are highly likely to fail or try to develop something that already exists in house.", "score": -1, "replies": [{"body": "Anyone can not make mRNA. Merck, Pfizer, CureVac, Sanofi all failed \n\nDon’t know what are you talking about", "score": 0, "replies": [{"body": "Work in the industry.\n\n\nKnow exactly what I'm taking about. It will be significantly commoditized in the next 10 years.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yeah, so they are magically going to take massive proportions of market share in an already saturated and competitive market where all of the competitors are already flush with cash.", "score": 11, "replies": []}, {"body": "MRNA is going to be the new TSLA of biotech.  mRNA field is a hot sector and their covid19 vaccine validated their platform.", "score": 12, "replies": [{"body": "Covid vaccine indeed validated and it’s much safer product. Now they have 4 other products that are advancing", "score": 5, "replies": []}, {"body": "I think biotech is going to be the new consumer tech. Small companies all around the world are making incredible discoveries most of them powered directly by the consumer electronics industry boom", "score": 2, "replies": [{"body": "It is said that 18th century was for physics, 19th century for silicon and 21st century for BioTech\n\n🤟🏼", "score": -3, "replies": []}]}, {"body": "BionTech ? \n\n\nThe founders have already brought a pharma co public and had it acquired.", "score": 1, "replies": []}]}, {"body": "Do you realize they’ve had a sell on MRNA since feb 2021? Nothing new on this opinion", "score": 6, "replies": [{"body": "Yes, perhaps they miss judged Moderna and now BofA’s investors are furious for not making money on Moderna so BofA is in the process of damage control", "score": 4, "replies": []}]}, {"body": "To be fair, the MOST of the stock market is largely overvalued when going by fundamentals. SPY around a PE ratio of 35-39 but historically around 18.\n\nI look forward to having the market correct.", "score": 3, "replies": []}, {"body": "Too many reasons why mRNA Bntx will be here for a long ass time. They’re already the current “BEST” vaccinations with the highest efficacy we have available to counter covid and guess what? Covid is still rampant, expect yearly shots every year, up to 3 shots a year and more, this is reoccurring billions and we’re only one year into the god knows how many more years of this covid hell", "score": 3, "replies": []}, {"body": "I actually doubled down at about the bottom of the first dip. Hoping it wasn’t a mistake haha I could’ve gotten my calls much cheaper at the end of the day, but I need it to get back to like $480 by Friday 🤦🏼‍♂️\n\nIt definitely made an impact and likely caused twice the pull back would have seen other wise. Hopefully it runs 1 last time this week", "score": 6, "replies": [{"body": "I bought some on the second dip but I am accumulating and not selling anytime soon.\n\nBancel is quite competent and I am hoping it will rebound to over $500", "score": 1, "replies": [{"body": "I think the play is over but i could be wrong", "score": 4, "replies": []}]}]}, {"body": "Moderna is making an hiv vaccine.  A faking cancer vaccine and it is 2x more effective against delta.   Overvalued?  If pe ratio is only 50 vs tesla is 170.", "score": 3, "replies": [{"body": "You are right. Imagine cure for cancer, HIV and many other for which there is no cure.\n\nPlus, Moderna will sell 800-1000 million doses this year and 2-3 billion for 2022. \nNet income for Q2 was ~50% and next year they are not going to spend much for R&D, which they did spend this year", "score": 3, "replies": [{"body": "Cancer mRNA shot is one of the first / early endeavors.", "score": 1, "replies": []}]}]}, {"body": "As if BofA isn't.", "score": 2, "replies": []}, {"body": "when there are one dose vaccines moderna will be over", "score": 1, "replies": [{"body": "J&J and AstraZenica are one shot vaccine.\n\nWhere did it go?\nPatient’s who got theses two vaccines are being offered mRNA shots in many countries", "score": 3, "replies": [{"body": "1.this two is not good enough, they both cause thrombosis.   \n\n2. All existing vaccines on this moment do not preventing covid just facilitate the course of the disease.\n\n3. there are more then 200 vaccines developing. Some of them will be better then existing for sure", "score": 1, "replies": [{"body": "I have heard that before. \n\nOnly time will tell. For now, big pharma like Pfizer, Merck & Sanofi have failed. And also, CureVac", "score": 1, "replies": [{"body": "why Pfizer has failed? it works, at least European use it.\n\nSanofi in process. Even Iran, Cuba and Kazakhstan have vaccines. S Korea and Japan  are able to make something really good", "score": 1, "replies": [{"body": "Pfizer did not create the Covid vaccine. BioNTech did and Pfizer is manufacturing, marketing and sales.\nThey share 50/50 % profit", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Biotech is a sector you can't predict. Biogen and Gilead has a monopoly on treatments, but essentially traded flat for 5 years", "score": 1, "replies": []}, {"body": "It is. Was valued at like 80% of pfizer at yesterday's high, and pfizer has a lot more going for it. \n\ndisclosure i have 450/440p spreads and sold 495 calls on it so i also really want it to go down", "score": 3, "replies": [{"body": "Yes. Often we place value on exponential growth.", "score": 2, "replies": [{"body": "Today, not so much.", "score": 1, "replies": []}]}]}, {"body": "Fuck off geoff", "score": 2, "replies": []}, {"body": "There could be a case that the pitched to stash Moderna’s Billions in cash but it went to BofA’s competition ( I am not certain and it’s just a thought)", "score": 1, "replies": []}, {"body": "It will go down eventually, not right now .\n\nhttps://www.reddit.com/r/BeatTheBear/comments/p1skrr/mrna_up_300_from_the_bull_trap_section/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 0, "replies": []}, {"body": "365 by EOD tomorrow.", "score": 0, "replies": []}, {"body": "I love moderna pasta! Buy calls!", "score": 0, "replies": []}, {"body": "there are about 200 new vaccines, any can be better then moderna. Moderna is decent company but it is really overvalued", "score": -1, "replies": []}, {"body": "BNTX is the other behemoth in the room.  mRNA pipeline, cancer treatment down the road, and contracts for new COVID-19 vaccines signed regularly for 2022.\n\nWhat makes MRNA better than BNTX?", "score": 1, "replies": [{"body": "Moderna doesn share profit 50/50 with any big brother like BoiNTech", "score": 1, "replies": [{"body": "Is this true? \n\n\n> Under the terms of the agreement, Pfizer will pay BioNTech $185 million in upfront payments, including a cash payment of $72 million and an equity investment of $113 million. BioNTech is eligible to receive future milestone payments of up to $563 million for a potential total consideration of $748 million. Pfizer and BioNTech will share development costs equally. Initially, Pfizer will fund 100 percent of the development costs, and BioNTech will repay Pfizer its 50 percent share of these costs during the commercialization of the vaccine.", "score": 3, "replies": [{"body": "Indeed", "score": 1, "replies": [{"body": "So there is no profit share?", "score": 1, "replies": [{"body": "Please read the last few lines from your comments.\n“and BioNTech will repay Pfizer its 50 percent share”\n\nSo yes, BioNTech & Pfizer share 50/50%\n\nWhereas Moderna does not share profit with anyone", "score": 0, "replies": [{"body": "Huh? That’s not what it says at all. Are you intentionally trying to be misleading to pump Moderna? \n\n\n\n> Pfizer will fund 100 percent of the development costs, and BioNTech will repay Pfizer its 50 percent share of these costs during the commercialization of the vaccine.\n\n\nPfizer will receive 50% of the COST of DEVELOPMENT.", "score": 1, "replies": [{"body": "I see. So according to you, Pfizer will fund 100% development costs and BioNTech will repay 50% of these costs.\n\nWhy would Pfizer fund 50% development costs?\nTo gain no profit from BioNTech and do the charity?\n\nAFAIK, Pfizer is not a charity and if they are then they should be delisted from stock market \n\nI don’t think you are that naive", "score": 0, "replies": [{"body": "If you recall dude. That was my original question to which you haven’t been able to answer haha. \n\n\nI mean you could lookup that Pfizer made a large equity investment in BionTech and so has rights to a share of that profit like any shareholder would but apparently that’s too much “DEEDEE” for you.\n\n\nIn the meantime all I’ve done is quote the agreement reporting itself which you can’t believe lol. \n\n\nGood answer by going off about charities though. Sometimes when you don’t understand things instead of trying to be sassy to “win” a pointless internet argument, maybe go look into the topic or ask questions to learn. You gain knowledge and become better.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I only know one Meachum and he was Frank Underwood’s wife’s boyfriend. I’m leaning towards believing this guy", "score": 1, "replies": []}]}
