{"title": "Does anyone on this Sub Sell either Call or Put Options as their income?", "selftext": "The more I study Option Trading, the more I realize that Selling Options are much safer than buying them. I made a lot of money in the Crypto market which I don't plan on selling for a long time but I have debated whether it is worth it to invest in certain Stocks to start options trading. In no way do I want to emulate the dysfunction and gambling of Wall Street Bets. I have been looking into BlackBerry, Snapchat, Wells Fargo, Bank of America, and other stocks within that price range or below it. What are your thoughts?", "id": "p4l0xu", "created_utc": 1628993685.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 78, "comments": [{"body": "have a look at r/thetagang", "score": 25, "replies": []}, {"body": "Yes. However, one thing to keep in mind is selling/writing options is very boring and slow. It is not as exciting as buying options. However, if you do it right (and safely), you can generate consistent income every month. Depending on your initial capital, some even do it full time. You may want to check out r/thetagang,  BTW, if you decided to start with selling, we have a discord community on selling options. DM if you’re interested.", "score": 15, "replies": [{"body": "Interested", "score": 0, "replies": [{"body": "Dm’d", "score": 0, "replies": [{"body": "I’d be interested in checking out the discord.", "score": -1, "replies": [{"body": "Dm’d", "score": -1, "replies": []}]}]}]}, {"body": "I'll take that discord please!", "score": 0, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Please send me the discord too", "score": 0, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Interested as well please", "score": 0, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Interested too, thx", "score": 0, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "If it’s still an open invite, I’d like that Discord, too.", "score": 0, "replies": [{"body": "Dm’d", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "I'm interested in the discord too. Thanks", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "I’m interested too", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "I'm interested in the discord please", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Interested !", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Would you mind sending the Discord? Thanks!", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Ay… DM me too please.", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Send me the discord info, lets make bucks", "score": -2, "replies": [{"body": "Dm’d", "score": 2, "replies": [{"body": "I’m interested as well", "score": 0, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "Me too", "score": -1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}]}]}, {"body": "I’m interested in the discord as well.", "score": 1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}, {"body": "\n\nI'll like to join the Discord as well.", "score": 1, "replies": [{"body": "Dm’d", "score": 1, "replies": []}]}]}, {"body": "Raises hand.\n\nYou wrote, \"...worth it to invest in certain Stocks to start options trading.\"\n\nTurn it around. \"Trade options to invest in certain stocks.\" \\*\n\nAKA, Sell Put Options, that when exercised, let you buy stock at a discounted price compared to what you'd pay on the open market when you sold the option.\n\n\\* If you are new to options, it's probably best to buy 100 shares of something relatively cheap and sell a couple of covered calls against it, in order to get used to the options market. After that, it is better overall to sell puts for premium, and not tie up your capital in owning stocks.", "score": 4, "replies": []}, {"body": "I do. I’ve used it to replace a “real” job. The edge in options trading is on the selling side.", "score": 3, "replies": [{"body": "Did the same, do the same. Positive P&L every month.", "score": 0, "replies": [{"body": "What do you like to sell, Mike?", "score": 2, "replies": []}]}]}, {"body": "Love selling Puts.", "score": 3, "replies": []}, {"body": "Spy put spreads have been doing well for me", "score": 3, "replies": [{"body": "how far out for strike and expiry?", "score": 1, "replies": [{"body": "I know a ton of people that do 0dte. Typically with a ~5 delta short leg. SPX is better for this as the premiums are higher and taxes are lower, if you have the account size for it.\n\nLook up Tammy Chambless on YT.", "score": 2, "replies": []}]}]}, {"body": "Selling RIOT puts and calls should be a natural fit for you. I do it for a living.", "score": 5, "replies": [{"body": "Don’t forget MARA too.", "score": 4, "replies": []}, {"body": "Naked put and calls or spread?", "score": 1, "replies": [{"body": "I do covered calls and CSP on RIOT and MARA.", "score": 2, "replies": [{"body": "Ok. Thanks", "score": 1, "replies": []}]}]}]}, {"body": "As mentioned above, check out r/thetagang", "score": 2, "replies": []}, {"body": "Sell aapl calls mainly", "score": 2, "replies": [{"body": "Sounds smart, especially seeing the quarterly tech high around earnings. They've given you a full month of risk free weeklies to sell.", "score": 1, "replies": []}]}, {"body": "Yes you can make very good income selling options, but not in the way that WSB does it that you mention in your post. Stay away from the meme stuff.", "score": 2, "replies": []}, {"body": "Unless the stocks have a lot of volatility like selling tesla or spy indices on weeklies, there is little money gained on a weekly basis.  These bank stocks one can possibly going out 1-2 months otm hoping not get exchanged.  The option fee can get expensive should one try to sell 10 contracts a week. That is the cost of 20 contracts., round trip. There is a chance that the capital gain tax can be excessive if cost basis is low or bought long ago.", "score": 2, "replies": []}, {"body": "I have a large buy and hold stock portfolio (millions), and I get most of my income from selling puts and often also synthetic longs.  Covered calls are way too tedious but I do occaisonally,  but waiting for short puts to expire is succulent pleasure with low effort or maintenance.  Also,  you get the money today,  but don't book the income till they are closed,  and always considered short term gains (unfortunately).\n\nGenerally, I sell leap puts, out 1 to 2 years, and run a ladder with 2 to 4 positions in each name with increasing prices,  sometimes in the money.   I always pick growth stocks with high volatility and consistent growth.   Examples,  FAANG stocks, SHOP, MELI, etc.  I've done some down on their luck losers with leap synthetic longs giving them time to get out of their funk.\n\nIt can be a great addition to enhancing returns.   After some time decay and establishment of a solid return,  I invest the cash into more long stock positions in my buy and hold portfolio.  I've earned consistently 20 to 25% over a 20 year time frame.  2020 I made 80%.  2121 kinda flat.", "score": 2, "replies": [{"body": "What do you mean exactly by \n\n\n> I sell leap puts, out 1 to 2 years, and run a ladder with 2 to 4 positions in each name with increasing prices, sometimes in the money.\n\n\nAppreciate the time", "score": 1, "replies": [{"body": "Explained in that n other response...", "score": 2, "replies": []}]}]}, {"body": "Selling naked options are like picking pennies up in front of a steam roller. Definitely check out theta gang and do either covered calls, spreads, or those fancy condors or butterflies, etc. Box spreads can't go tits up right?", "score": 0, "replies": [{"body": "I disagree wholeheartedly with that statement as do lots of option traders.", "score": 2, "replies": [{"body": "really? you guys sell a lot of naked options? Alright, good to know it works for some. What do you do to diversify the risk? Look at the greeks to decide the probability that they don't get assigned?", "score": 1, "replies": [{"body": "I exclusively sell naked options. I mean I didn’t apply with my broker to get naked options to not use them.\n\nAssessing risk BEFORE the trade is key along with proper position sizing. The Greeks are tools, not absolutes. Yes, they give you insight to opening a position and then adjusting when in the position, but they are just outputs from the current option(s) pricing. To avoid assignment, there are a multitude of ways (depending on position) to adjust to avoid assignment. Rolling, buying underlying, shorting underlying, converting to spread… There’s a lot of ways to make a losing position a minimum loss or to turn a profit.", "score": 2, "replies": [{"body": "good for you man. I think it is a valid trading strategy. Probably only black swan events will be infinite losses with selling naked options. However, if you know the relative volatility before your position and can close it in time or opening a different position in the opposite direction to minimize risk. You are good. Ya, it's not 100% known how things will play out but ya, there's lots of tools to help estimate. For starting out, I think covered calls are a bit safer in case you do get assigned and you aren't paying attention during the expiration or during major volatility events like earnings, etc.", "score": 1, "replies": [{"body": "I don’t hold long equities almost ever. The last time was a 200 share covered write on TSLA around 680. It started dropping, then spiked, I sold the shares out from underneath at 695, leaving 2 naked calls. TSLA dropped further soon after and I profited fairly large on the 2 (newly) naked calls. If I wouldn’t have been paying attention it would have been a large loss. My trading style and naked options in general does require really close attention. In the case of TSLA it was a literal matter of minutes to sell the shares and then it tanked again.", "score": 1, "replies": [{"body": "> Selling Options are much safer \n\nYa, my original comment was just to say to the OP that selling options aren't \"safe/guaranteed\" easy money. Lol I was on the other side of the trades last year buying naked call options when they were about to be added to the SP500 and made a killing, I think after that event it was a free fall since they couldn't really justify that crazy valuation. Good play selling calls. Imagine if you sold naked puts during the recession when circuit breakers were hitting every day?", "score": 1, "replies": [{"body": "Well… I honestly plan on doing so during the next free fall. Just not before, during. If history can repeat, I hope to catch SPY and QQQ (or other ETF’s) on the way down with heavy premium on sold puts, and ride it back up while simultaneously buying wayyyy OTM LEAPS. For example, I’m kicking myself for the Jan 22 $395 LEAPS. I bought em for a buck or so at the bottom. Sold em off a few at a time for a solid 10 bagger, and finished em off when SPY stalled around $380. Now they’re trading for $68. Learned that lesson.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Don’t waste your time with options. Just buy and hold an S&P 500 index fund and you are ✅. Glta!", "score": -21, "replies": [{"body": "That’s really stupid advice in a sub dedicated to options.", "score": 6, "replies": []}]}, {"body": "It's a slow process.", "score": 1, "replies": [{"body": "It’s not THAT slow of a process.", "score": 1, "replies": [{"body": "I might be conservative then selling all OTM calls.", "score": 1, "replies": [{"body": "Sell strangles, straddles, condors, spreads… A lot more out there than just selling covered calls.", "score": 1, "replies": [{"body": "I only have option  2 on eTrade so I am limited.", "score": 1, "replies": [{"body": "Ah. Well there’s that.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I sell options with a small account. I currently don't make enough to quit my day job but if I keep making consistent small gains maybe one day I can.", "score": 1, "replies": []}]}
