{"title": "How to get on time news of Mergers and Acquisitions ?", "selftext": "I wanted to see if someone knows how to stay on top of mergers and acquisition news  in market. I feel like I keep finding out about major mergers too late and miss out on good investing opportunities . Alaskan airline was one and latest being Pfizer's acquisition of Medivation. \n\nThanks in advance !\n\nGreat replies folks. I will check out the few sites that are mentioned below and continue to find better sources and do more research. I don't like to trade companies based on M&A only , just feel like I miss out on some Good opportunities . ", "id": "4z78lk", "created_utc": 1471968572.0, "score": 21, "upvote_ratio": 0.84, "num_comments": 25, "comments": [{"body": "lmao...if you read about the news of an acquistion it's already too late", "score": 25, "replies": [{"body": "But if you know about it prior to it being made public it is insider trading.", "score": 13, "replies": [{"body": "Stupid question- is this true if you didn't receive the information directly from an insider?", "score": 2, "replies": []}]}, {"body": "That's what I meant exactly .. I see people trade the crap out stocks I am assuming they get the info before somehow or are looking at places I don't know about . ", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It's only partially luck. \n\nA good analyst knows what metrics make a company attractive as a takeover target and if they can also identify a company who might benefit from such an acquisition the beginnings of a solid trade start to form.", "score": 16, "replies": [{"body": "Also look out for company press releases. I dont know about the states, but in Canada if there is little coverage on a company and they announce an M&A deal, you can get in before research analysts come off restriction and write their report on the deal. Since the company is not widely followed by institutions there is the opportunity to ride the gap when they play catch up.", "score": 1, "replies": []}]}]}]}, {"body": "And in my case with the rumored $ILMN acquisition from Thermo Fisher, if you ponder selling on speculation news when the stock goes up 8%, by the time you're done pondering selling, the stock will go back to up 1%.", "score": 1, "replies": []}]}, {"body": "[EDGAR](https://www.sec.gov/edgar/searchedgar/companysearch.html) is where all company filings must be officially submitted. If you are focused on M&A transactions then you are looking for the document called an 8-K. If you really want to be able to move on these announcements before it's \"too late\" then you'll need to create a program to constantly scan EDGAR for new 8-K's being uploaded, then create an algorithm that is able to read the document and accurately determine what it is saying, and then pass that information through a model to come to an investment decision. Then you need to have access to a high speed trading platform that your algorithm can execute your investment decision through. If you can't do all that then you will never be able to be a first mover on an M&A announcement without inside information. Those big spikes in volume you see right when those announcements are made are all from computers doing what I described above in fractions of a second.\n\nIf you're just looking for rumors, not official announcements, then twitter is your best bet. But for every rumor that is true there are a dozen that are bullshit. EDGAR is where professionals go for official filings.", "score": 10, "replies": []}, {"body": "If you have access to a bloomberg terminal they have M&A fields that are real time and trackable.", "score": 6, "replies": [{"body": "I don't and I looked it up online it's quiet costly . I day trade here and there and mostly invest in long term growth stocks, My portfolio is about 30 K nothing fancy so I sure can't afford to pay a 20 000 subscription fee . At least that's what I found online ", "score": 2, "replies": [{"body": "If you're looking at long term growth I would suggest the following platforms because they are geared more towards that investment philosophy. \n\n1) IBD Top 50 - It's a great watchlist\n\n2) Equities Lab - We have a bunch of screens that outperform the market and over 20 years of data to back up each strategy. You can even build your own strategies from scratch.\n\n3)GuruFocus - Another screening product like ours. What I like about theirs is that it is all in browser. \n\n4)R - If you're willing to learn a new programming language based around investing and are proficient in Excel I would suggest learning how to program in R, the standard in quantitative analysis.\n\nThere are a ton of tools out there that make finding stocks extremely easy. I'm not 100% certain if any of the above have real time M&A field, I know Equities Lab doesn't, but the others might so you might want to do a bit of research.", "score": 6, "replies": [{"body": "Just some advice. Automatic starting videos suck massive gorilla nuts, ditch that shit. \n", "score": 3, "replies": []}]}, {"body": "That's the point. Other services are too slow and by the time the news reaches you, the market's already adjusted. ", "score": 1, "replies": []}]}]}, {"body": "By knowing people. By the time it's publicly announced you're way behind.", "score": 3, "replies": []}, {"body": "They don't announce those prior for a reason.", "score": 2, "replies": []}, {"body": "Medivation has been in the news for months now regarding being bought out.  They rejected a bid from Sanofi as they hoped for a better offer.  Part of it was luck in finding the news piece while deciding to lock up funds hoping that it would happen sooner rather than later.  It could very well have backfired had no one else stepped up with an offer or if Medivation decided to accept one at a discount.  But I did my research in the company and the likelihood it would happen, and walked away with a 20% profit.", "score": 2, "replies": [{"body": "Yeah I got in on them at $55 in February. Super happy to see the $14b ", "score": 1, "replies": []}]}, {"body": "Check out www.mergerspread.com", "score": 2, "replies": []}, {"body": "visit the blogs  www.stockrumors.net", "score": 2, "replies": []}, {"body": "People educate themselves enough about an industry and actually do the homework, then try to invest in quality companies they think will do well and hopefully be appealing purchase possibilities for other companies.", "score": 2, "replies": []}, {"body": "Ask Patrick Bateman.", "score": 2, "replies": []}, {"body": "you have to speculate. invest in companies that look like good takeouts and hope one of them gets bought. ", "score": 1, "replies": []}, {"body": "I don't think there is a simple answer. You have to be knowledgable about a sector and the big players inside it. You have to get familiar with companies and their past, listen to the plans of the board and try to figure out what an attractive acquisition for certain companies will be. If you read a direct press release about a merger, it's already too late. ", "score": 1, "replies": []}, {"body": "The best way is to update yourself by going through business news on daily basis. The New York Times will provide you best information on the subject. It has also an online facility. If you put your 15 to 20 minutes daily, it'll be a great help to you on the subject. http://investmentbank.com/mergers-and-acquisitions/", "score": 1, "replies": []}, {"body": "Tradethenews.com.. The best by far ", "score": 1, "replies": []}]}
{"title": "How to hedge against Nuclear apocalypse?", "selftext": "[deleted]", "id": "4z6egv", "created_utc": 1471958248.0, "score": 10, "upvote_ratio": 0.73, "num_comments": 17, "comments": [{"body": "I know the answer to this from experience - hoard bottle caps.", "score": 14, "replies": [{"body": "All in on $PEP and $KO?", "score": 1, "replies": []}]}, {"body": "Personally id buy another yacht ", "score": 7, "replies": []}, {"body": "So the markets have crashed for the last time and metals are worthless because people are just trying to survive, so you want to know what stocks you should be in? For when the market has crashed and is no longer worth a damn? Smart thinking, OP. \n\nHedging for the apocalypse will require investing in physicals. Stock up on guns, ammo, food, water, and med supplies. Probably booze too. Would suck if you couldn't get drunk and watch the shit show. Then start a small colony with all of your cool shit while everyone else is starving. ", "score": 6, "replies": []}, {"body": "You should check out /r/collapse. Stuff like this is asked all the time. \n\nWelcome to the doomsday cult. ", "score": 3, "replies": []}, {"body": "Uhhh if you're serious go buy Bit coin. Everyone over there talks like you ", "score": 3, "replies": []}, {"body": "Why would you want money for a nuclear apocalypse?  Stock up on guns, ammo, whisky, and a fallout shelter...", "score": 6, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "How about gun manufacturers? swhc and rgr.", "score": 3, "replies": []}, {"body": "are you dumb", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "LMT, retaliation to whoever did it", "score": 2, "replies": []}, {"body": "Twinkies and water", "score": 1, "replies": [{"body": "So basically GRSH", "score": 1, "replies": []}]}, {"body": "Just buy like a thousand OTM VXX calls cuz volatility is bound to skyrocket at some point right?", "score": 1, "replies": []}, {"body": "UVXY ", "score": 1, "replies": []}, {"body": "All in on Vault-Tec. Dem vaults don't build themselves ", "score": 1, "replies": []}, {"body": "Don't forget global warming", "score": 1, "replies": []}, {"body": "Hoard toilet papers and canned goods? And lots of guns. Anyone even looks fishy near my vicinity, blow their heads off.\n\nIf talking stock, food industries?", "score": 1, "replies": []}]}
{"title": "TSLA", "selftext": "Fuck Musk", "id": "4z8bt0", "created_utc": 1471981068.0, "score": 8, "upvote_ratio": 0.71, "num_comments": 28, "comments": [{"body": "https://www.tesla.com/blog/new-tesla-model-s-now-quickest-production-car-world/?utm_campaign=GL_Blog_082316&amp;utm_source=Twitter&amp;utm_medium=social\n\n>While the P100D Ludicrous is obviously an expensive vehicle, we want to emphasize that every sale helps pay for the smaller and much more affordable Tesla Model 3 that is in development. Without customers willing to buy the expensive Model S and X, we would be unable to fund the smaller, more affordable Model 3 development.\n\nK", "score": 7, "replies": [{"body": "\"Buy our overpriced cars so that one day we can sell normal priced cars!\"", "score": 11, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "For at least 10 years, in plain english", "score": 2, "replies": []}]}]}, {"body": "I love that the boast there about having the best 0-60 time for a production car is 1. [wrong,](http://www.zeroto60times.com/fastest-cars-0-60-mph-times/) and 2. based on an expected value.\n\nedit: formatting", "score": 2, "replies": [{"body": "The question I have to ask is to whom does it matter that his car has the fastest 0-60? It is a midsize (or full?) Sedan.  It cost as much as an S or a 7.  The interior is spartan.  The new Cadillacs have better trim.  \n\nI think it doesn't know what it wants to be.  And GM is going to beat the model 3 to the punch with the bolt.  And they have an established dealer network and make profit.  \n\nAlthough Henry Ford said \"If I had asked people what they had wanted they would have said faster horses.\" So I could be a fag and be wrong but I think Elon's ego overstates his ideas. ", "score": 3, "replies": [{"body": "My guess is it matters to almost nobody, but like a shitty pharma stock, they're putting out every piece of press they can to bump the price and mitigate future dilution.\n\nI can't speak to the actual quality of the product, but the way the company operates (missing projections, unusual accounting conventions, a CEO trying to do related-party M&A) and the way the stock can be hyped by hundreds of millions of dollars worth of market cap over a tweet make this whole thing reek of \"we're too busy fucking our shareholders to even tell them to fuck themselves in an honest PR.\"\n\nOr I'm wrong and in 10 years, there'll be 30 million Teslas on the road and they will have finally turned a damn profit.", "score": 4, "replies": []}]}]}, {"body": "That is literally Leon's Master Plan 1. People have faith in him and that's why the stock movements are ridiculous. Tesla shorts will only win if the company goes under- which hasn't happened yet, and IMO unlikely to happen in near future.", "score": 1, "replies": []}]}, {"body": "cry wolf musk stank boi", "score": 4, "replies": []}, {"body": "Well there goes a lot of my money on faggot delights", "score": 5, "replies": [{"body": "I really need to stop doing that shit. ", "score": 1, "replies": []}]}, {"body": "What did he announce?", "score": 2, "replies": [{"body": "Some bullshit battery pack. Most profitable thing about this cunt these days is his twitter account.", "score": 2, "replies": [{"body": "What did you guys expect though, flying cars?", "score": 9, "replies": [{"body": "Lmfao ", "score": 1, "replies": []}, {"body": "I honestly don't know. Ideally something that more than a small percentage of the population can afford. A motorcycle would have been great ", "score": 1, "replies": [{"body": "Motorocycle? How much gas you think a motorcycle uses?", "score": 3, "replies": [{"body": "Is that really your argument? Buy a used honda civic, drive it until it's dead and you still wont even reach the cost of a Model S", "score": 1, "replies": [{"body": "I don't think Model S/X buyers are really cross-shopping for beat-ass Civics.", "score": 2, "replies": [{"body": "That's not what this argument is about. He's saying there's no need for electric motorcycles because they don't use much fuel. I'm saying if saving money on fuel is what's important to you, there are plenty of options that are cheaper than a Tesla. Gas prices factored in. ", "score": 0, "replies": []}]}, {"body": "Is that really your argument?", "score": 2, "replies": [{"body": "What I'm saying is, it's not about the cost of gasoline. It's about the amount of devastation petroleum has on our planet as well as in politics.  ", "score": 1, "replies": [{"body": "So devastating. I'm devastated ", "score": 3, "replies": []}, {"body": "Go back to r/politics faggot ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "How much of a cuck he is", "score": 1, "replies": []}]}, {"body": "GFY", "score": 2, "replies": []}, {"body": "This guy...", "score": 1, "replies": []}, {"body": "May not be as fucked as it seemed ", "score": 0, "replies": []}]}
{"title": "One year ago was the Aug 24 flash crash", "selftext": "[deleted]", "id": "4z8p5u", "created_utc": 1471985465.0, "score": 27, "upvote_ratio": 0.88, "num_comments": 27, "comments": [{"body": "No shemitah this time. 2022", "score": 12, "replies": [{"body": "Jubilee year homie... Oct 2nd 2016 is the new date... I also like the 252 year theory as well that predicts September 1st 2016 as an important date.", "score": 7, "replies": [{"body": "Ayyy...YouTube tonight it is.", "score": 5, "replies": []}, {"body": "I'm intrigued what is this 252 year theory ", "score": 2, "replies": [{"body": "It's divisible by 7, so it has my attention as well", "score": 3, "replies": [{"body": "Everything is divisible by 7, you numb nut.", "score": 2, "replies": [{"body": ">di·vis·i·ble - (of a number) capable of being divided by another number \"without a remainder\".\n\n[Let me google that for you](https://www.google.com/webhp?sourceid=chrome-instant&ion=1&espv=2&ie=UTF-8#q=define%20divisible)\n", "score": 0, "replies": [{"body": "Are you in second grade?  Are decimals and fractions too hard for you?", "score": 1, "replies": [{"body": "I gave you the fucking Websters definition of the very word he used \"divisible\" and you're still arguing? You must be a Hillary supporter too.", "score": 6, "replies": []}]}]}]}]}, {"body": "Bo Polny who I think is mostly a quack has a pretty interesting theory about 252 year cycles. [Here is his latest video](https://youtu.be/IRAauJf71jA?t=5m15s)... Hes a cycles guy and while I think most of his stuff is bogus im genuenly curious to see if something happens on or shortly after Sept 1st as its exactly 252 years from the start of the currency act that he talks about.", "score": 4, "replies": [{"body": "Oh fuck. It's got 7 it's got 8 it's got free masons it's got religious ties...its on like a Jewish donky kong", "score": 10, "replies": []}, {"body": "This is the crazy shit I live for", "score": 3, "replies": []}, {"body": "As a person who knows nothing about anything, go fuck yourself.  What is this Bullshit? It is entirely arbitrary.", "score": 3, "replies": [{"body": "of course it is... but think about how cool it will be if its right!", "score": 2, "replies": []}]}, {"body": "lost me at bible..", "score": 4, "replies": []}, {"body": "I'm sure one of the hundreds of crashes he predicts will be right and he will be lauded as a genius.", "score": 0, "replies": []}]}]}]}]}, {"body": "That was so much fun, those following months were exciting and profitable. ", "score": 8, "replies": [{"body": "Pls god let it happen again, I need this.", "score": 2, "replies": [{"body": "It always happens again.... The problem is, it's difficult to predict, you never know how far it will dip (I bought into the oil crunch in Dec-Jan too early and lost 20% and it just came back to even last week),  and often you already have investments that are tumbling along with it. If you can keep keep your stomach, try not to sell, and instead buy more, then you can profit long-term.", "score": 2, "replies": [{"body": "Already 100% in, can't buy more.", "score": 4, "replies": []}]}]}]}, {"body": "It's the 23rd you faggot ", "score": 4, "replies": [{"body": "Meant to write \"one year ago tomorrow.\"\n\nPlus this post will still be \"active\" on the 24th. ", "score": 3, "replies": [{"body": "#[removed]", "score": 1, "replies": []}]}]}, {"body": "More like down .05% and finish flat. This market blows with volume as light as a fat infested turd.", "score": 2, "replies": []}, {"body": "Remind me: 2 hours", "score": 2, "replies": []}, {"body": "Cool, now that it has the attention of wsb: ath!!!", "score": 1, "replies": []}, {"body": "holy shit time flies", "score": 1, "replies": []}]}
