{"title": "Anyone else having a great week?", "selftext": "So far, the reaction to Yellen's announcement on Friday has driven my portfolio up a good margin. $BCS, $LYG, $WFC, $CMG, $PTLA have all climbed up in the wake of the news and should continue (at least the bank stocks) right on through the interest rate hike. \n\nI broke even on $DUST for bag holding too long and getting too reactionary when the price started jumping - would have had a nice profit if I held through today, but oh well. I see Gold continuing to drop but probably won't make a major move until there is an official rate increase. Until then, I prefer not to lose money trying to 'time the market.' \n\nAnyone else having a good week. How's AMD doing ;)?", "id": "50bx6s", "created_utc": 1472573658.0, "score": 7, "upvote_ratio": 0.72, "num_comments": 25, "comments": [{"body": "I'm always having a great week regardless of my stocks", "score": 20, "replies": []}, {"body": "Losing money on AMD. Lost money on a stupid penny stock which I never fuck with. I'm basically at full-retard this week", "score": 12, "replies": []}, {"body": "I'm doing pretty good.  Just ate some decent Italian pasta salad.  Can't complain.  ", "score": 6, "replies": []}, {"body": "Down 5k :/", "score": 7, "replies": [{"body": ":(", "score": 3, "replies": [{"body": "Now I have to decide if I should cut losses and scalp bond etf's till I make my money back or wait for the rebound.", "score": 2, "replies": []}]}]}, {"body": "Been gaining 2-3% each day after changing up my strategy and playing smarter so yeah actually, thanks for asking.", "score": 3, "replies": [{"body": "Same!", "score": 2, "replies": []}]}, {"body": "Yeah. That Yellen non-announcement definitely helped out $CMG\n\n", "score": 2, "replies": [{"body": "After the stressful anticipation, everyone went to relax with a burrito. ", "score": 1, "replies": []}]}, {"body": "Yep riding GSAT to the moon", "score": 2, "replies": []}, {"body": "I was up 8% yesterday so yeah", "score": 2, "replies": []}, {"body": "Up 20% since last thursday.\n\nI think it is safe to say it has been a pretty good week.", "score": 2, "replies": [{"body": "Nice! 20% is my \"liquidate half\" number. Since it's difficult to beat the market over the long term (statistically speaking), anytime I hit the 15-20% mark, I sell half and re-allocate or hold cash until the correction. It's uncommon to continue that level of growth long-term, so I always take my profits.", "score": 1, "replies": [{"body": "This is largely due to an inappropriate number of shares in GSAT and Mast.\n\nWith a decent cost basis on each I will be setting some stops, but both are coming up on binary catalysts this month.\n\nI will probably set trailing stops on half the shares of each with a good bit of wiggle room so I don't get shaken off too early.", "score": 2, "replies": [{"body": "I did exactly that today for mast.  Have my trailing stop just under .42 right now.  Staying out of gsat though, played it when it was at the low dollar mark around 1.03-1.08 months ago but lost interest because it never moved, I'm not about to try to hop on this train and get run over", "score": 1, "replies": [{"body": "Mast was a whim. Saw September coming up and figured what the hell I hadn't taken a ride yet, and yolo'd on 20k shares at .35, you know, just to see how it feels.\n\nGSAT and I have fucking unfinished business to attend to, so I will be fucking that goat until I am good and done with it.\n\nIt is moving a pretty ridiculous amount on what is basically no news though, so if approval does not come soon, it will be time to pull out and wait for it to settle back down.", "score": 1, "replies": [{"body": "I did mast before the drop a few months ago, rode it from .36 to .41 and bailed.  This time I think I'm going to ride it to .50 then cut out all but about a hundred dollars for the binary event so at most it drops ~50% and I'm out 50 bucks but if it shoots I could make 100-200.  \n\nDo you have an exit plan for mast or are you just going balls to the walls right through into the announcement? \n\nAlso check out AERI, same deal.  FDA decision due 9/30 and been going up on hype lately, could make some money on a 2-3 week hold.", "score": 1, "replies": [{"body": "Pretty much balls to the wall.\n\nI will start setting trailing stop losses to pull money out and preserve capital, but nothing too crazy that will cause me to be shaken out by abnormal volatility like what happened with GSAT today.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "up 1k off of buying Jnug on Friday and ARRY and Brew yesterday, to ez", "score": 2, "replies": []}, {"body": "Waiting for a Pennystock catalyst in September :<", "score": 1, "replies": [{"body": "$RJETQ", "score": 1, "replies": [{"body": "Are you saying REKT or?\n\nEdit:  oh, a ticker, sweet 21% jump dude grats!", "score": 2, "replies": [{"body": "edited for clarity", "score": 1, "replies": []}]}]}]}, {"body": "Probably goin back to workin the corner because I've lost most of my dope money", "score": 1, "replies": []}]}
{"title": "Thoughts on $BAC?", "selftext": "Making a nice run today. Was upgraded by S&P global market intelligence to 18 from 16. Thinking the impending interest rate hike will help it out as well. Anyone got any thoughts? Thinking about entering some calls. ", "id": "50c3nn", "created_utc": 1472575730.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 24, "comments": [{"body": "I'm debating whether or not to buy calls right now or wait for a pullback. Should have pulled the trigger yesterday. $16 strike options doubled in value today. Fuck me.", "score": 3, "replies": [{"body": "I'll buy some if you buy some 😅", "score": 2, "replies": [{"body": "I think I'll be buying the 18 strike January expiry ones now. Not sure if there will even be a pull back anymore....\n\nAt least with the January ones, it gives plenty of time to win/take profits.", "score": 1, "replies": []}]}]}, {"body": "Did a covered call at a strike of 16 back before Yellen's speech.  I'm holding til I get assigned.", "score": 2, "replies": []}, {"body": "Im watching this. Its definitely going up on the interest rate news. Im waiting for a pull back to $14-15. The Ex date is this friday if you want  to get the (small 0.08) dividend. Sometimes Im too patient though and miss the rocket launch.", "score": 1, "replies": [{"body": "I literally was thinking about getting in this last week FML. I'll wait for a pullback (hopefully) ", "score": 1, "replies": [{"body": "If the jobs report is solid this week it's only going up ", "score": 3, "replies": []}]}]}, {"body": "I bought in at 12$ after brexit, sold too early. FML, deff hold if you have some, wouldn't buy right now no matter what they say.", "score": 1, "replies": [{"body": "honest question: why do people sometimes say to hold is OK but not to buy. Shouldn't you only hold if you think it'll go up? And if you think it'll go up then buying is a good idea right?", "score": 3, "replies": [{"body": "In my books hold means to temporary don't make a move (sell nor buy)", "score": 2, "replies": []}, {"body": "Because if you already have some shares that means you bought cheaper than this price and have some cushion in case things dont go the way you want, however if you buy now you ll be buying at almost 16$ a share with a price target of 18-19$, its dangerous with this outlook of the economy, only a rate hike will push the prices to 18-19, what if it doesnt happen? Holding the shares for that event seems more reasonable than buying right now", "score": 2, "replies": []}, {"body": "If you're confident in your DD and you really believe a stock will continue to push up then by all means buy in. But make sure you actually take your profits before pull back because your margin of safety is going to be much smaller if you bought on the way up ", "score": 1, "replies": []}]}]}, {"body": "Mine always goes up steadily throughout the day. ", "score": 1, "replies": []}, {"body": "i have had a position in BAC for years. last year it ramped up on the hike speculation, more so than the actual hike. keep in mind it peaked at 18 or so, so the upside doesnt seem to extreme right here imo.\n\nholding some calls now. debating offing them before a dividend drop or retrace. still think they will be good by december in the 16-18 range.", "score": 1, "replies": [{"body": "What period?  I'm holding Jan 20 strike 16s", "score": 1, "replies": [{"body": "the monthlies? i have same lol.", "score": 1, "replies": [{"body": "I'm just watching these go through the roof, I got in at .58.  Can't wait for the Friday jobs report ", "score": 1, "replies": [{"body": "lol i got in at .59.\n\nright before last FOMC minutes.\n\nhow many u got? are we the same person?", "score": 1, "replies": [{"body": "I got a puny 17.  Wanted to be sure I could cover it in case I hold to expiration", "score": 1, "replies": [{"body": "15 : /", "score": 1, "replies": [{"body": "We might be the same person", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Bought in about a month ago for a cool 10% gain to date, looking to hold atleast until an interest rate hike", "score": 1, "replies": []}, {"body": "Lets put it this way, for every 1% increase in the funds rate BAC will make 6B more \n\n", "score": 1, "replies": []}, {"body": "If interest rates go up they will have larger interest payments to the fed, last I read they had like $8T in derivatives to $1T assets. May not be so simple?", "score": -1, "replies": []}]}
