{"title": "Construction Plays?", "selftext": "[deleted]", "id": "4x1oyk", "created_utc": 1470828933.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 19, "comments": [{"body": "The Only Stock I Would Play IS $CAT, Why? I Have A Pug. I need to Inverse Myself.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "i also have a wife whos against the stock market. She a iluminati freak. she just buys $AUY", "score": 1, "replies": []}]}]}, {"body": "Been watching CX, although I may be too late to the party.", "score": 2, "replies": [{"body": "I've been watching CX and wanting to get in but am thinking the same thing. Should have gotten in a few weeks ago", "score": 2, "replies": [{"body": "Looking pretty solid today....makes me think I should have just pulled the Trigger.....", "score": 1, "replies": [{"body": "I think that every time I look at it lol. It just keeps going up and up", "score": 2, "replies": []}]}]}]}, {"body": "You're oversimplifying it... Construction is too broad a term. Multi family is booming, but that bubble will pop in the next 2 years. Small scale commercial is doing pretty good, large scale is slow and steady doing what it can with what we overbuilt in the 90s, home builders are still skiddish so they're playing it safe, roadway and govt contract work are the only ones I see continuing to boom for a little longer. \n\nThat being said, if you can't find a specific \"construction\" company to invest in, you can always go for things like $HDS, $URI, $UFPI, $NUE, etc to get a bit of everything. I'm personally waiting for a good entry on $CAT to follow the roadway work theory. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I work in construction/development as well. Mainly multi family but have equity partners exposed to a variety of industries. Going in to meetings now. Will respond better later. ", "score": 1, "replies": []}]}]}, {"body": "Should probably look into Steel... Like US Steel symbol X; wouldn't necessarily recommend as they just had a secondary offering of some 19 million shares and you have to have some pretty tolerant up down 10% every week sort of nerves.\n\nBut how about symbol SLX, an ETF with 27 different Steel related companies. Pretty diversified, some really decent companies inside.... And I'm guessing you aren't going to do any of the research and just look at graphs...", "score": 1, "replies": []}, {"body": "GVA is heavily diversified and expanding like crazy. Trust me on this one. ", "score": 1, "replies": []}, {"body": "Keep an eye on Tetra Tech stock. They have a pretty good corner on the water and environmental market, which strongly correlates to a busy construction market. They've been doing pretty well since the recession. ", "score": 1, "replies": []}, {"body": "I've traded XHB because I've been too lazy to follow particular firms.", "score": 1, "replies": []}, {"body": "What sort of construction are you seeing a boom in?  I'm seeing a lot of slowdown in industrial projects, but that may be because I'm mostly familiar with the Oil, Gas, and Chemical industries.", "score": 1, "replies": []}, {"body": "Mastec - MTZ", "score": 1, "replies": []}, {"body": "the only one I know and watching is: TSE:BDT\n\nBird Construction: it just released somewhat bad numbers and it dipped hard, i'm still watching, not sure if this is worth it yet. 6.75% Div yield too. Let me know what you think about it.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Don't shit on anything you don't know.. cuz you don't know shit about investing and someone is trying to help you out.\n\nEdit: I would just like to point the conversion potential you could currently be making. If you so happen to find a strong construction company with some sturdy legs and good financials, you would gain from the currency conversion and if you don't mind playing the long game you could win a second time on the way out... That's not to mention the stock movement. Arbitrage.", "score": 0, "replies": [{"body": "I actually find it interesting how a lot of people on here seems to think that Canada=Short. It's almost as if they think Canada is 100% Alberta and 100% Oil. \n\nStay 100% US equities guys, i'll keep the Canadian opportunities for myself.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I know, no hard feelings :) All i'm saying is that it really feels like WSB really don't like Canada and would rather go all in on AMD than DD a Canadian company for 15 minutes.", "score": 1, "replies": []}]}, {"body": "You would get the same answer if you stated anything other than USA... It's the sort of USA is number 1 ideology; it's harder to find great deals in other places because the markets aren't as big in market cap or predominate in the news.  It's very contradictory; they make themselves out to be stock pickers but judge the entire market as a whole... it's a lack of knowledge on arbitrage. ", "score": 1, "replies": []}]}]}]}]}]}
{"title": "$NVDA Earnings Play (My Play)", "selftext": "Try to buy $NVDA at $58 hold till tomorrow, hope it goes to $60. sell before tom bell. buy dip the next morning after earnings. sounds legit? wtf do i know.", "id": "4x2hd8", "created_utc": 1470840592.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 12, "replies": [{"body": "=/", "score": 1, "replies": []}, {"body": "i agree with this faggot", "score": 1, "replies": []}, {"body": "Bear Call spreads bro", "score": 0, "replies": []}]}, {"body": "Why not just sell puts a price you're willing to enter at? If it goes up, you win, if it goes down you exercise and get in cheap. ", "score": 4, "replies": [{"body": "I don't think you understand how selling options works.  They ain't yours to exercise.", "score": -3, "replies": [{"body": "? If you want in at a lower price you sell puts with a strike at what price you want in at. You collect premiums and offset the cost of the stock when they are exercised. If they don't get to the strike you profit. If they hit the strike who cares you wanted the stock at that price anyway. Wow people are getting fucking dumber everyday. ", "score": 7, "replies": [{"body": "Shhh this sub is for meming and comedy.  Without idiots like that guy  this sub would suck!  Also, dead money in the market is great, it's a win win if you just call him a faggot and walk away.", "score": 4, "replies": []}, {"body": "I get it, you lose on the options but the silver lining is you can buy the shares at a lower price.   But you can't \"exercise\" options you've sold. ", "score": 1, "replies": []}]}]}]}, {"body": "Honestly this is my play.  Sell the next morning for minor gains, and re-buy into the inevitable selling dip.", "score": 2, "replies": [{"body": "its the smart way", "score": 1, "replies": [{"body": "If $ATVI taught me one thing, it's fucking sell post earnings and just be happy you made gains, then adjust accordingly.", "score": 7, "replies": [{"body": "Lessons were learned", "score": 3, "replies": []}]}]}]}, {"body": "Added you on the friends list.", "score": 2, "replies": []}, {"body": "$58 seems impossible today... trying for $58.30", "score": 2, "replies": []}, {"body": "Fuck dude. I sold all my  shares this morning. Bought in at $42.25 back it May, and watched NVIDA print money. I sold this morning for $58.81 for a sweet 35% gain. I plan to buy in again on Friday after it dips due to earnings. I really like this stock for the long term.", "score": 2, "replies": []}, {"body": "Here we go [NVDA 10 shares. I ain't rich.](https://imgur.com/a/SiMGu) ", "score": 2, "replies": []}, {"body": "Earning plays are a toss up, any play could be the 'right' play. ", "score": 1, "replies": []}, {"body": "AMD to the moon on NVDA dip", "score": 1, "replies": []}, {"body": "$60 before the market close ", "score": 1, "replies": []}]}
