{"title": "TSLA trade idea, what do you think?", "selftext": "", "id": "1s65jv", "created_utc": 1386262708.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 20, "comments": [{"body": "I think you drew a line on a chart and wrote some things which may or may not occur.", "score": 5, "replies": [{"body": "Ok, so what do you use for your trading strategies?", "score": 1, "replies": [{"body": "Graham valuation techniques.  P/E, Price/book value, dividend yield, net/sales, earnings/book value, working capital, current assets/liabilities, 10yr CAGR, etc.", "score": 3, "replies": [{"body": "Same question as I asked above.\n\nHow are you trading intraday, or swing trading in the short term based off P/E, Price/book value, dividend yield, net/sales etc?\n\nIm showing a you 5min candle chart of TSLA, you are showing me long term investing metrics, we are not on the same page here.", "score": 0, "replies": [{"body": "Nope, strictly buy and hold for me.", "score": 1, "replies": [{"body": "Tried and true method, no argument there.\n\nBut can you tell me how do people who trade in the short term do it?\n\n", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "How do you daytrade or swing trade with that?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Right, which takes me to my point.\n\nThe chart I put up there is a 5min chart of recent trading sessions, no amount of fundamental data is going to help you make a short term trade there.\n\nYou are absolutely correct in your system of using expected future cash flow and any other metric to make long term decisions, but for short term swings for the more active traders, that is not very helpful.\n\nI simply laid out some trade parameters based on the most recent support and resistance levels that showed up.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Ive been trading for 15yrs or so, the way I explain it is that fundamentals tell you why to buy a stock, technicals tell you when.\n\nSo you like what you see in the fundamentals on TSLA? Great! Go check the chart for a good entry.\n\nTypically at this point of the conversation the other person wants proof that trading on technicals can work, to which I answer sure!\n\nHere is a stochasitics crossover technique with a 3% stop loss, back tested since 2007:\n\nhttp://stockfetcher.com/forums/Filter-Exchange/STOCHASTIC-CROSSOVER-SYSTEM-FOR-SDS-AND-SSO/107364\n\nStochastics are just one indicator from thousands, there are a mess of other indicators in that site if you want to look into more.\n\nThe big caveat I put out is that you can give somebody a hammer, that does not mean they can build a beautiful house. \n\nTechnicals are just a tool.", "score": 3, "replies": [{"body": "How do your annual returns compare to the S&P average with your techniques?", "score": 1, "replies": [{"body": "I have a diversified portfolio, but I also trade some.\n\nAside for a recent terrible S&P futures short that needs another 30 points of downside to break even, this year was pretty good.\n\nIve had good and bad years, but overall the good outweighs the bad.\n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "heres one for you. Ratio spread. buy the 140 call; sell the 145 call x2. Make sure its done for a credit.\n\nDont want to use calls?\nSell 2 front month 140 puts. Buy 3 back month 130 puts.\n\nShould leave with the same basic construct on the upside but takes into account what you posit to the downside including + vega as it goes down in the 3 130's. If it goes down to 130~ the 130 delta would be 150~ total and the 140's would be around 135-150~.\n\nYet again if your ganna post a technical chart like this plz add some kind of trade so that people can see what it is your thinking. Leaving it blank and \"open to discussion\" helps no one.", "score": 3, "replies": [{"body": "Im looking to generate some conversation and ideas here.\n\nIt would be great if you could post some what you just posted there with a chart too.", "score": 1, "replies": [{"body": "I retract my last two sentences then. So then what do you think about my suggestion?", "score": 1, "replies": [{"body": "I cant say I ever did option spreads with too many legs on it, but the premiums do look a lot better now than last week.\n\n", "score": 1, "replies": []}]}]}]}, {"body": "Wish I had invested in it couple of years ago but not now....", "score": 1, "replies": []}, {"body": "I don't think TSLA is a short anymore, but the fact it didn't have a follow through day is interesting to me.\n\nI usually trade based on the daily charts, using the 10, 20, 50 and 200 day MA.  At this point, TSLA looks like it's going higher, but only until about 155, where it will meet the 50-day MA.\n\nIf it breaks the 10/20 day support, then it *should* be a short, but frankly I don't want to mess with TSLA shorts anymore after that weird action I saw around 120 a couple of weeks ago.  There are forces far larger than myself at work, and they want TSLA to go up.", "score": 1, "replies": []}, {"body": "I rushed in yesterday at $144.oo lol ", "score": 1, "replies": []}, {"body": "why don't you put your money where your mouth is?", "score": -1, "replies": [{"body": "I laid out the plan, now I wait for the right event to take place.", "score": -2, "replies": []}]}]}
