{"title": "Options Questions Safe Haven Thread | Oct 02-08 2023", "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions.**  &nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING,  PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)    \n[..](https://www.reddit.com/r/optionsmods/wiki/)   \n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling retrieves.**   \n**Simply sell your (long) options, to close the position, to harvest value, for a gain or loss.**  \n**Your break-even is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**    \n\n**Also, generally, do not take an option to expiration, for similar reasons as above.**\n\n---\n\n**Key informational links**  \n•&nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n•&nbsp;[Binary options and Fraud (Securities Exchange Commission)](https://www.sec.gov/files/ia_binary.pdf)   \n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)     \n•&nbsp;[Options Trading Introduction for Beginners (Investing Fuse)](https://investingfuse.com/options-trading-for-beginners/)    \n•&nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n•&nbsp;[Options Trading Concepts -- Mike & His White Board (TastyTrade)(about 120  10-minute episodes)](https://www.youtube.com/playlist?list=PLPVve34yolHY43YaBegHMzN9WjrTnQfFr)  \n•&nbsp;[Am I a Pattern Day Trader? Know the Day-Trading Margin Requirements (FINRA)](https://www.finra.org/investors/learn-to-invest/advanced-investing/day-trading-margin-requirements-know-rules)   \n•&nbsp;[How To Avoid Becoming a Pattern Day Trader  (Founders Guide)](https://foundersguide.com/pattern-day-trader/)    \n\n---\n\n**Introductory Trading Commentary**   \n&nbsp;&nbsp;&nbsp;•&nbsp;**[Monday School Introductory trade planning advice (PapaCharlie9)](https://www.reddit.com/r/options/wiki/faq/pages/mondayschool)**  \n&nbsp;&nbsp;**Strike Price**   \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&nbsp;&nbsp;**Breakeven**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&nbsp;&nbsp;**Expiration**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Expiration & Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&nbsp;&nbsp;**Greeks**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Pricing & The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&nbsp;&nbsp;**Trading and Strategy**    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Fishing for a price: price discovery and orders](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_minimizing_bid-ask_spreads_.28high-volume_options_are_best.29)     \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)  \n\n---\n\n**Managing Trades**  \n•&nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&nbsp;[The diagonal call calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction, trade size, probabilityand luck**  \n•&nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/trade_planning)  \n•&nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&nbsp;[Applying Expected Value Concepts to Option Investing (Select Options)](http://www.selectoptions.com/Edu-Expected-Result)  \n•&nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)    \n•&nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)    \n•&nbsp;[Poker Wisdom for Option Traders: The Evils of Results-Oriented Thinking (PapaCharlie9)](https://www.reddit.com/r/options/comments/qfq82a/poker_wisdom_for_option_traders_the_evils_of/)   \n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/price_discovery)  \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)  \n\n\n**Closing out a trade**  \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position/)       \n•&nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/risk_reward_and_exits)   \n •&nbsp;[Guide: When to Exit Various Positions](\nhttps://www.reddit.com/r/options/wiki/faq/pages/whentoexit)   \n•&nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)   \n•&nbsp;[5 Tips For Exiting Trades (OptionStalker)](\nhttps://www.reddit.com/r/options/comments/qtwsm5/5_tips_for_exiting_trades/)   \n•&nbsp;[Why stop loss option orders are a bad idea](https://www.reddit.com/r/options/wiki/faq/pages/stop_loss)   \n\n---\n\n**Options exchange operations and processes**     \n•&nbsp;[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n•&nbsp;[Options that trade until 4:15 PM (US Eastern) / 3:15 PM (US Central) -- (Tastyworks)](https://support.tastyworks.com/support/solutions/articles/43000435335-options-that-trade-until-3-15-pm-central-)  \n\n---\n\n**Brokers**   \n•&nbsp;[USA Options Brokers (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/brokers)    \n•&nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)  \n\n---\n\n**Miscellaneous: Volatility, Options Option Chains & Data, Economic Calendars, Futures Options**   \n•&nbsp;[Graph of the VIX: S&P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&nbsp;[A selected list of option chain & option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021, 2022, 2023](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2023)", "id": "16xy5fb", "created_utc": 1696256976.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 141, "comments": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Here's the latest memo from the OCC:\n\n[https://infomemo.theocc.com/infomemos?number=53304](https://infomemo.theocc.com/infomemos?number=53304)\n\nI'm open to correction on this, but sounds like on 10/20, you are going to have to pay $(strike x 100 x number of contracts) in cash, and get nothing in return.", "score": 2, "replies": [{"body": "Thats the way I read the memo as well.  Cash settled based on strike price.", "score": 1, "replies": []}]}, {"body": "Your counter party is the entire pool of all long put holders.    \n\nWhen is the expiration?   \n\nIf before Oct 20, you might have a long exercise and randomly matched to  your short.   You would pay the strike price in cash.  Since the shares have been canceled you do not receive anything.\n\n If Oct 20 and later, you will likely be paying the strike price in cash, per the Options Clearing Corporation memorandum.", "score": 1, "replies": []}]}, {"body": "I am new to options trading, smaller investor, so I am not doing any sort of WSB YOLO’s or anything but if y’all have a position that is looking to expire otm do you sell or let it expire? I have a put that expires next week and unless they miraculously shed their recent gains, it is not going to finish in the money, I want to hear what the more seasoned options traders do", "score": 1, "replies": [{"body": "Exit and harvest remaining value, and next time have a maximum intended loss, and maximum intended time in the position.  \n\nSee the educational links at the top of this weekly thread about trade planning, exit planning and risk reduction.", "score": 3, "replies": []}, {"body": "Options have some amount of risk as long as they are open, so letting an option run to expiration will also let this risk on.\n\nMost seasoned traders close options at a preset profit or loss amount to take that risk off.  You don't state the trade details, but it may be letting a risk of a $500 loss on to collect the last $1 in profit.\n\n\"unless they miraculously shed their recent gains, it is not going to finish in the money\"  Stocks can move quickly and drop significant amounts in a very short period of time.  Options can be exercised until about 5:30pm ET meaning an option can expire OTM but still be exercised . . .\n\nNew traders tend to focus only on profits.  Seasoned traders focus more in risk and by closing early it takes off the risk.", "score": 3, "replies": []}, {"body": "Have a [trade plan](https://www.reddit.com/r/options/wiki/faq/pages/mondayschool/yourplan) before you open the trade. It should spell out what you should do in this scenario.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Options generally have lower volume and liquidity than stocks, so they can move faster and \"jump\" prices at times.  The prices can also move well above or below the stop trigger price but not actually trigger, or sometimes can trigger on a short term spike to close when the position was not really in danger.\n\nStop loss orders CAN work with options, but they are not guaranteed to get the price you want or expect, and can trigger erroneously at times, so are not widely used by most traders.  Instead, set an alert to be made aware when an option is out of range to manually address it if warranted.", "score": 4, "replies": []}, {"body": "You do not know what the price change may be over night when exchanges are closed", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Depending on your limit order price, the market may not be located in a place that the order would be filled .", "score": 1, "replies": []}]}]}]}, {"body": "IBKR has a \"pegged to midpoint\" built in algorithm, including for options, that moves your bid or offer (and based on an offset you choose...like mid plus 5 cents) with change in underlying. Very useful close to expiration when mid moves so quickly, and my brain can't calculate mid on a 4 leg order with all 4 numbers moving. But their page about it says it's for \"nonmarketable?\" orders. What could that mean? What if I choose offset from mid is tiny, so within bid/ask spread...why would that be nonmarketable, or rather would they not accept that in pegged orders? If so why? Perhaps it has to fall outside of current best bid/ask to use this algorithm for some reason? \n\n>The Interactive Brokers (IBKR) IBUSOPT Pegged-to-Midpoint order type is useful if the investor wishes to rest a nonmarketable order at the midpoint of the National Best Bid and Offer, more commonly known as the NBBO.\n\nhttps://ibkrcampus.com/trading-lessons/ibusopt-pegged-to-midpoint-order-type/", "score": 1, "replies": [{"body": "https://ibkrcampus.com/glossary-terms/non-marketable-orders/\n\nhttps://www.interactivebrokers.com/en/?f=%2Fen%2Ftrading%2Fdiscretionary-order-handling.php", "score": 2, "replies": [{"body": "Perfect. Thanks.", "score": 1, "replies": []}]}]}, {"body": "10/20 75 PUT XPO - yesterday we broke well below 75 but value of the put went down. Why? Does it have to do with theta? Didn't buy was considering it. IV Crush? There was no earnings that I'm aware of...", "score": 1, "replies": [{"body": "Are you sure you *bought* the put, not sold to open? If you bought to open ...\n\nCould be both. IV crush doesn't require an event to happen, just higher IV when you bought the put than IV is now. Theta just requires time. The longer you hold, the more you lose to theta.\n\n\n**FAQ: Why did my options lose value when the stock price moved favorably?**\n\n* [Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n\n\nBTW, how do you know the price went down? If it's just the *mark* that went down, that doesn't necessarily mean the contract lost value. To confirm, you need to compare bids. Bids are the floor of value for the contract. If the bid went down vs. the previous day's closing bid, despite the stock going down, that is a sure sign of IV crush, theta, or both.", "score": 2, "replies": []}]}, {"body": "First week trading options. Took account from $150 to $202. 6 trades. 5 wins. 1 loss. Currently averaging about a 10% daily ROI just off recognizing patterns, I have no formal chart-reading training or official strategy. I only trade SPY. My dilemma is that I follow trends for how the stock is going or if I believe it's going to end up eventually going the opposite way, and I have been right the majority of the time but what has happened repeatedly now is that I sell for a 10-15% ROI profit and then 15 minutes to an hour later I check and it is now a 50%-300% ROI if I held. I am grateful to be profitable, but I don't want to lose out on any more profits due to ignorance debt. Can someone direct me to the best resource to understanding patterns and swings? Obviously, no one knows when a stock is going up, down, around or out of town but there must be some sort of technical way of analyzing that can help me better predict how far into the profits I could go. Thanks.", "score": 1, "replies": [{"body": "> First week trading options. Took account from $150 to $202. 6 trades. 5 wins. 1 loss. Currently averaging about a 10% daily ROI\n\nThis may be hard to believe, but as you get more experience trading, you'll learn that none of that matters. Six trades is too small a sample size to know if that performance was anything other than luck.\n\nWhat matters is your annual return, or better yet, your average return after every 1000 trades milestone (so 1000, then 2000, then 3000, etc.). That starts to be enough to average out luck, though 10,000 would be better, if you are trading high-variance plays.\n\n> My dilemma is that I follow trends for how the stock is going or if I believe it's going to end up eventually going the opposite way, and I have been right the majority of the time\n\nYou can't make that statement with any confidence. Again, could have been random luck.\n\n>  what has happened repeatedly now is that I sell for a 10-15% ROI profit and then 15 minutes to an hour later I check and it is now a 50%-300% ROI if I held. \n\nStop doing that. What happens after you make the decision to exit a trade is irrelevant. Are you going to pat yourself on the back and call yourself a genius if the trade tanks and loses 69% after you exit? Neither is relevant. All that matters is making the **best possible decision you can at the time you make it and with all the information available at that time**. What happens later won't do anything to improve your decision-making, which is all you have control over.\n\nHere's an essay on this topic you should read: https://www.reddit.com/r/options/comments/qfq82a/poker_wisdom_for_option_traders_the_evils_of/\n\nInstead of coulda/shoulda/woulda fretting about post-decision returns, focus on reviewing your own decision-making, with a skeptical eye. Did you really make the best decision, or were you just guessing? Would you make the same decision in the same circumstances? If your decision means you have loss after loss, is it still the right decision? It very well could be, because short term (small sample) results don't prove a decision is good or bad.", "score": 1, "replies": [{"body": "That probanilities and averaging out luck essay merits being called out in the wiki or Monday School locations.", "score": 1, "replies": [{"body": "As a new essay you mean? Maybe. It would be a good introduction/partner to this post:\n   https://www.reddit.com/r/options/comments/14kdijb/what_you_can_expect/", "score": 1, "replies": [{"body": "For the near term, as a link.\n\nI decided to add, for the moment to the safe haven list, pending other visibility.", "score": 1, "replies": []}]}]}, {"body": "Thanks for the thorough response. Taken to heart. Do you have any resources I can consume that will help me understand good strategies and techniques for options trading?", "score": 1, "replies": [{"body": "Top of this page has links for exactly what you are looking for.", "score": 1, "replies": []}]}]}]}, {"body": "I bought 3 SPY 415 PUT exp 10/13 last week for 1.64.\n\nToday I sold 3 SPY 412 PUT exp 10/13 for 1.90 cents each today to protect the position.\n\n Am I correct in thinking I can no longer lose money on this trade? What are the downsides to selling a leg after your long leg is profitable? Is it just that I have to keep the whole position til expiry? Thanks!", "score": 1, "replies": [{"body": "You have retrieved your initial capital in the trade.  \n\nExit before expiration.  \n\nDownside is the tradibg move limits gains, if SPY were to fall to, say, 405.", "score": 1, "replies": []}, {"body": "Yes, looks like you locked in a small credit. Even if the expiration price is over 415 such that the long put is worthless, you still keep the entire credit for the 412. But as the other reply noted, you also capped your net gain if the expiration price is below 412.", "score": 1, "replies": []}]}, {"body": "why cant i see the bid and ask of options right now ?\n\nmenawhile i can see the bid and ask of every US security", "score": 1, "replies": [{"body": "Was it before the market opened?", "score": 1, "replies": [{"body": "yes, its solved now.", "score": 1, "replies": []}]}]}, {"body": "When do I know I’m ready. I started paper trading today and it seemed too easy. Began with $500 and after two trades to end the day I made over $700 without looking at much data or fancy terms. What goal is satisfactory to set for myself to know “I’m ready to do this for real” maybe it’s a percent gain or time period, I don’t know. Any other paper traders that remember when they knew they were ready to do it for real?", "score": 1, "replies": [{"body": "100 trades makes merely  the beginning of a statistical measure of how you are doing.  \n\n  \n\nMore importantly Paper trading exposes you to questions you do not yet have, and generates  motivation to learn in a new manner.", "score": 2, "replies": [{"body": "I like this, thank you", "score": 1, "replies": []}]}]}, {"body": "What are the risks of sell a covered call of apple stock expiring in 30 days for a strike price of 300?\n\nthis is just an exemple i dont know if theres an exact option for that but i can see options for apple selling for 0.02 cents for strike prices that are just too high and dificult to hit.", "score": 1, "replies": [{"body": "The risk for covered calls on shares is the share holding value goes down.", "score": 1, "replies": []}]}, {"body": "Reverse calendar call spread at far otm (<10 delta, 45 DTE short & 7/14/21 DTE long), ok?", "score": 1, "replies": [{"body": "Ticker, rationale for the trade, reason for long term long, cost or net premium on the trade?  \n\nA reverse calendar is considered a cash secured short, plus a long, in terms of collateral.", "score": 1, "replies": [{"body": "Hmmm low delta 45 DTE short call for theta, 7/14/21 DTE cheap long call for protection? \nSPY or AI stocks", "score": 0, "replies": [{"body": "You do not yet have a trade, and do not have a rationale for it either, so it is not possible to say much about it.    \n\nHere is some background on reverse calendar spreads.  \n\nhttps://www.investopedia.com/terms/r/reverse-calendar-spread.asp. \n\nWhen you have a trade, these are essential to make it discussable: \n\nTicker.   \nFor each leg:  \nExpiration.  \nCall or put.   \nStrike.  \nCost or premium.   \nRationale for the trade position.  \nAn analysis or perspective on the underlying stock or index.", "score": 1, "replies": [{"body": "Example: \nSPY 4600 Short call ~45 DTE,\nSPY 4600 long call ~7/14/21 DTE when they are <$5.", "score": 1, "replies": [{"body": "This is a partial list of essential aspects of a trade.  \n\nDid you review the supplied link?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "apple currently trades at 173.33.\n\nOn option market i see strikes of 172.5 for 4.25.\n\nIf i sell a covered call dont i make more money seling the stock here than on open market? I am assuming i am selling the stock since the strike price is bellow the current price.\n\nWhat am i messing on this covered calls on options market that are bellow current price and with a nice premium?", "score": 1, "replies": [{"body": "You should always specify expiration date.  I presume you are looking at the 10/20 expiration.\n\nYou aren't going to get assigned until expiration.  If AAPL is at less than 172.5 at expiration, you won't get assigned. Also, if AAPL is far above 172.5 at expiration, you will get assigned and have to sell at 172.5, missing out on the chance to sell at the higher price.", "score": 1, "replies": []}]}, {"body": "Newbie here. Have an open call option on Lithium Americas LAC. They just split into two companies today LAC & LAAC. As one would expect I’m now way otm and planned on just closing my position but Robinhood is showing my option is for LAC1 instead of either company and I’m confused. Can anyone help me understand what happens next? Should I just close and cut my losses as I had planned?", "score": 1, "replies": [{"body": "Whenever options are adjusted, you can find the relevant memo from the OCC by googling \"[ticker] theOCC adjustment\".  Here is the memo:\n\nhttps://infomemo.theocc.com/infomemos?number=53302\n\nWhat this means is that your call option still costs\n$(100 x strike) in cash to exercise, but you would get 100 shares of LAC plus 100 shares of LAAC.  Therefore, as shown by the formula in the memo, the call option is in the money if the sum of the share prices of LAC + LAAC is greater than the strike price, and out of the money otherwise.  So be sure to check that. You can't just go by the current share price of LAC to determine whether or not it is in the money.\n\nLiquidity on adjusted options is usually terrible and it is usually best just to close.", "score": 1, "replies": [{"body": "Ahhh ok that makes so much more sense! Yea I figured it’d be best to just close which is what I’ll do. Thanks for the help!", "score": 1, "replies": []}]}]}, {"body": "Is there any website that can send an email alert when an newly launched stock has options become available for the first time for trading?", "score": 1, "replies": [{"body": "None that I am aware of.  \n\nExchanges may not establish options on a schedule, and may not know until the day before, that all exchange regulations have been complied with.\n\nYou can check daily.", "score": 1, "replies": [{"body": "Is it mandatory that every listed stock have options trading available, as in does the exchange mandate it?", "score": 1, "replies": [{"body": "No.\n\nCompanies can veto Options.  \n\nThere are various capitalization, share float, and other thresholds to be met.", "score": 1, "replies": [{"body": "If they can veto option listing, why would they approve it in the first place?", "score": 1, "replies": [{"body": "Change of control.  \n\nOr delay l8sting.  \n\n\nCompanies can control their derivatives.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I want to sell put credit spreads on SPX instead of SPY for number of reasons.\n\n1) Premium generally higher (even if you 10x SPY to compare)\n\n2) European style (no risk of early assignment)\n\n3) Tax Benefits\n\nI am taking positions where I handle a max loss.\n\nSo I would get $350 premium for a little over $2k on the line for max loss.\n\nOne guy recommended that I should still sell on SPY because my account is small. He was like that’s a $400k product. But does it matter? I am selling a put credit spread with defined max loss. Why should the total product matter if I’m not selling naked?\n\nAll that should matter is that I can handle max loss.", "score": 1, "replies": [{"body": "I tend to agree. Cash settled and European style, and credit spread, limits potential for adverse outcomes.  \n\nI would not do this on an American style underlying worth 400,000", "score": 1, "replies": [{"body": "Yeah, so idk what the guy was talking about", "score": 1, "replies": []}]}, {"body": "> So I would get $350 premium for a little over $2k on the line for max loss.\n\nUh, that sounds like a terrible PCS risk/reward. Are your spreads 25 points wide? That means you are only getting 0.14 of credit per point of spread? Even at 20 points wide, that's still only 0.175 credit per point of spread. What is the delta of the short leg? If it is around 30 delta OTM, you need at least 0.34 per point of spread to be profitable on average. If your delta is a lot lower, getting 0.14 per point might be okay.\n\n> All that should matter is that I can handle max loss.\n\nWell, it's not quite as simple as that. It's true you don't have to worry about early assignment or your spread expiring with a price between the legs. But you do buy into some additional complications, like SPX options are marked to market at the end of every year. So if you hold a position over New Years Eve, you'll pay taxes on the position even if you didn't close it.\n\nhttps://www.reddit.com/r/options/comments/xip5bn/1256_spx_options_mark_to_market_lesson_learned/\n\nThere's also the AM/PM settlement times you have to keep straight, and how SET is used to evaluate expiration moneyness.\n\nBut yeah, not sure what that guy was talking about. Maybe he thought you were doing short straddles on SPX? That would be more in line with his concern.", "score": 1, "replies": [{"body": "Is that how you are supposed to calculate if your risk/reward is good, by credit per point?\n\nThis is how I do my calculation:\n\nI sell 45DTE expiry. And close at 50%. Ideally close at 21DTE or sooner. That’s 24 days in between.\n\n365/24 = 15.2 occurrences in a year.\n\n$350/2 because 50% capture = $175. \n\n(175/2000) * 100 = 8.75% return in 24 days.\n\n8.75% * 15 occurrences = 131.25% return for the year.\n\nSometimes I get 50% actually in less than a week if sold in high IV environment. Which would mean higher return. Sometimes it may take longer if I made a bad entry.", "score": 1, "replies": [{"body": "> Is that how you are supposed to calculate if your risk/reward is good, by credit per point?\n\nIn general? No. Only for vertical credit spreads. Because the risk is always the width in dollars and the reward is always the credit in dollars. Or points, in the case of index options. It also is more flexible than the more common, \"credit 1/3 the width of the spread,\" since that only applies to 30 delta spreads. If you have 15 delta, it's a different ratio. I just find it easier to think in terms of how much credit I need per dollar (or points) of width.\n\n> (175/2000) * 100 = 8.75% return in 24 days.\n> \n> 8.75% * 15 occurrences = 131.25% return for the year.\n\nYou understand that both of those results are grossly overstated, right? Because they don't account for losses.\n\nA better way to do that calculation is do it entirely in dollars, then calculate the [expected value](http://www.selectoptions.com/Edu-Expected-Result) in dollars, which gives you an average return, hopefully a positive number so that it's profitable on average, then do your multiplication for occurrences to annualize.\n\nSo 175 x 100 = 17500 = WIN$\n\n(2000 - 175) x 100  = 182500 =  LOSE$ (max loss, but if you manage the trade to a better loss limit, sub that amount in)\n\n70% = WIN% (roughly, using 100% - delta as your win rate, sub in whatever your realized win rate is to adjust).\n\nEV = (WIN% x WIN$) - ((100% - WIN%) x LOSE$)\n\nEV = (70% x 17500) - ((100% - 70%) x 182500)\n\nEV = 12250 - 54750  = -$42,500 per trade on average\n\nAssuming I didn't make any math errors (always a possibility), this is a losing trade on average, as I expected. You're not going to be making 100% a year with this trade.\n\nNow let's change the max profit to a juicier $720 ($.36 per point of width) but still exit 50% of max and also exit at 3x the target reward as a loss limit, so if you are targeting $360 credit, you exit if you have to pay $1080 or more to buy to close. That effectively gives you a 2 to 1 risk/reward ratio, which is ideal for a 30 delta credit spread.\n\n360 x 100 = 36000 = WIN$\n\n(1080 - 360) x 100  = 72000 =  LOSE$\n\n70% = WIN% (roughly, using 100% - delta as your win rate, sub in whatever your realized win rate is to adjusted).\n\nEV = (WIN% x WIN$) - ((100% - WIN%) x LOSE$)\n\nEV = (70% x 36000) - ((100% - 70%) x 72000)\n\nEV = 25200 - 21600  = +$3600 per trade on average\n\nMaking those adjustments turns the trade into a winner, on average.\n\nThen your per trade return is 3600/20000 = 1.8%, or 27% annually, which is a much more realistic rate of return", "score": 1, "replies": [{"body": "Wow appreciate this write up. Will need time to digest", "score": 1, "replies": []}]}]}, {"body": "Good to know about the marked to market? Never heard of it.\n\nI have seen AM/PM, never heard of SET. Can you ELI5 for me", "score": 1, "replies": [{"body": "To determine the expiration moneyness of a SPY call, you just look at the (options market) closing price of SPY shares. But SPX doesn't have shares, so what price do you use? You use the ... \"exercise-settlement value, SET, is calculated using the opening/[or closing] sales price in the primary market of each component security on the expiration date. The exercise-settlement amount is equal to the difference between the exercise-settlement value and the exercise price of the option, multiplied by $100.\"\n\nhttps://www.cboe.com/tradable_products/sp_500/spx_options/specifications/\n\nBasically, you have to take the \"closing\" price of every stock in the S&P 500 index, mash them together to make one number, and that's the SET value for SPX moneyness. SET is quoted like it's a stock ticker, so you can look up the quoted price if you want to know if your call was ITM or not.\n\nI put \"closing\" in quotes, because for AM settled SPX contracts, it's the opening price rather than the closing price, as the excerpt above said.", "score": 1, "replies": []}]}]}]}, {"body": "Need a miracle If u had 1 shot.. I am going all in on option for my daughter what is it.", "score": 1, "replies": [{"body": "This entire weekly thread with its educational links is devoted to doing your homework,  understanding that trading and gains are a consequence of a steady marathon of trades, controlling and Minimizing Risk for acceptable gains.\n\nIf there were regularly occurring  sure trades with payoffs, we would be billionaires.  We are not. And there are no miracles.   \n  \nAll or nothing trades lead to nothing\n\n\n\n\nThus, no such trade is suggested for you.", "score": 3, "replies": [{"body": "It’s ok. I took a risk on plug puts. Just wanted a symbol to take a risk on", "score": 1, "replies": []}]}]}, {"body": "At what point do you stop buying and selling naked contracts?", "score": 1, "replies": [{"body": "Well, it's not possible to *buy* a naked contract, so I guess that the answer is never, since you can't do it in the first place.\n\nIf all you meant is single-legged long (buy to open) contract positions, I think the answer is still never, in the sense that you don't throw your hammer out of your toolbox just because you don't need to hammer any nails right now. You might need a hammer in the future.\n\nYou can sell naked short contracts (that's the only context where 'naked' is used, btw), but the answer is still the same. It's a tool for a specific set of circumstances also.\n\nSo in general, if the circumstances are right, buy options or sell naked options. If the circumstances aren't right, stop.\n\nIf you meant, when do you start using multileg structures? It's the same answer -- when the circumstances are right. It's analogous to asking when to stop using a hammer and when to start using a saw. Circumstances.", "score": 2, "replies": [{"body": "Yes I meant multiple leg options. Thanks for the insight.\n\nI just thought it was strange people say it's more consistent profits but still trying to figure out how.", "score": 1, "replies": [{"body": "A lot of people say uninformed things. It's like saying you can get from point A to point B consistently on a bike but not on a unicycle. Well, sure, if you don't know how to ride a unicycle!", "score": 1, "replies": []}]}]}]}, {"body": "Wash sale rules regarding options:\n\n1. I buy a SPY call\n2. I sell a SPY put\n3. I sell my SPY call at a loss\n4. My SPY put expires worthless\n\nCan I claim the loss on the was sale of selling the call? Or does the option expiring worthless mess it up since that’s when my gain from selling the pit was realized? Or can I still claim the wash sale because I received the gains in my account before I sold at a loss?\n\nThank you", "score": 1, "replies": [{"body": "Your net gain results,   \n\nIt is not clear why you are concerned about a wash sale when you close all your positions.  \n\nAre you planning on crossing a year-end between trades?", "score": 1, "replies": [{"body": "I had a position I sold expire worthless after I sold an option I bought at a loss. So I’m wondering if the gains were realized on when the position was closed or open? If it’s when it was opened I’m good, if it was realized when it was closed, id be missing out on claiming the loss from the purchased options that I took a loss on earlier.", "score": 1, "replies": [{"body": "There is no cash gain or loss until the position is closed.", "score": 1, "replies": [{"body": "So by this, my losses I took will be negated by the gain of the position I sold that expired worthless. I closed the positions and took a loss a day earlier, then the put I sold expired worthless. So I will be unable to claim the loss on my taxes", "score": 1, "replies": [{"body": "Your gain or loss is the net  summed up for all legs of every options tranaction.  \n\nYour taxable gains are reduced by your losses.  You claim losses to reduce the taxable gain", "score": 1, "replies": [{"body": "Copy. So what I’m getting here is everything is summed up after the position is closed/expired worthless", "score": 1, "replies": [{"body": "Correct.   \nThere is no gain or loss, on a taxable cash basis, until a trade is concluded.  \n\nOn a non-cash basis, your broker platform may report gains or losses, using  market teanasaction prices data to estimate what you gain or loss is, if you were to close out the trade.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Are these separate trades or spreads or ?\n\nAs u/wittgensteins-boat says,  it  would  not  matter  if  you  do  nothing  for  30+  days  after  the  last  trade.\n\nYou don’t “claim a wash sale”, the wash sale is imposed on you which prevents “claiming” a loss which requires you to pay more taxes . . .  Wash sales will clear to be used against future years profits and are just delayed recognition of losses.", "score": 1, "replies": [{"body": "Separate trades", "score": 1, "replies": []}]}]}, {"body": "Heyo, this is an easy thing to test but its the weekend now and I'm curious.   \nWhen you are day trading options using Type 1 (cash), does it count towards your \"Day Trade Counter\" that would make you a \"Pattern Day Trader?\" I've been trying to avoid this designation like the plague because its an account restriction, but I am unsure of the answer and google/my brokerage website hasn't really answered it for me. I only ever day traded \"settled\" funds, but it is all happening within a margin account.\n\nMy primary strategy is spreads, so I need to keep the margin feature on the account.  \nThank you!", "score": 1, "replies": [{"body": "A cash account (non-margin) does not have the day trading restrictions, but only settled cash can be used to trade which still limits how many day trades can be made.\n\nStocks take T+2 days to settle and options are T+1 day to settle, so you have to wait for the cash to settle before opening more trades.  If you trade with un-settled funds this is good faith violation which can also get your account shut down.\n\nAs you note, you trade spreads which cannot be traded without a margin account, and so you either have to limit the day trades or use a different strategy that can be used in a cash account, although will still be limited.\n\nMargin accounts go by day trade count and not if funds are settled or not as a cash account would.  \n\nDay trading is high risk and not as profitable as most thing it is, so this is one of the reasons it takes an account of $25K+ to avoid the PDT restrictions.  You should consider trading in a more conservative longer duration way (i.e. 7 to 30+ dte) until you have $25K+ when you can day trade all you want provided the account stays above that amount.  \n\nAlthough an unpopular comment, I’ve said it before and will say it again, if you are a good solid trader, you should be able to build up an account over time to the $25K+ minimum and then trade however you wish . . .", "score": 2, "replies": [{"body": "This is a good comment thank you.\n\nMy account is well over 25k but I've always been concerned about the PDT restriction because my understanding was it's more damaging to have on your account than not.\n\nI messed up and got three day trade liquidations so I have that restriction on my account. Normally I'm not a day trader but I can do it well, however with this new restriction damaging my margin buying power type 1 day trades have become a much better choice for me.\n\nI do trade 30 DTE + the majority of the time and ITM only, it's worked well for me.", "score": 1, "replies": [{"body": ">My account is well over 25k but I've always been concerned about the PDT restriction because my understanding was it's more damaging to have on your account than not.\n\nIt's not damaging at all.  There's often a misconception that it's some sort of punishment.  It's not.  Literally its only purpose is to make sure daytraders keep their account value above $25k.  If that's not a problem for you, the PDT flag means absolutely nothing whatsoever.", "score": 2, "replies": [{"body": "This is correct.  A PDT designation is only an issue if the account drops below $25K, but as long as it is above it poses no problems.", "score": 1, "replies": []}]}]}]}, {"body": "Do you have a margin account?  \n\nSettled funds has nothing to do with being a Pattern say trader.", "score": 1, "replies": [{"body": "Yes its a margin account, so my concern is that day trading even in type cash will add to the day trade counter", "score": 1, "replies": [{"body": "Three day trades in five market days is the maximum number of day trades allowed, while avoiding becoming a PATTERN DAY TRADER.\n\nit has zero to do with your cash, or settlement.  \n\nYou need to read about what a day trade is, and what a Pattern Day Trader is.  \n\nHere:   \n\nhttps://www.investopedia.com/terms/p/patterndaytrader.asp. \n\n---   \n\n\nIf you intend to keep above 25,000 on value in the account at all times, you need not be concerned about being a pattern day trader.", "score": 2, "replies": []}]}]}]}, {"body": "https://www.optionsprofitcalculator.com/calculation/jd-6-legs/UD1\n\nCan someone tell me what is wrong with this trade?", "score": 1, "replies": [{"body": "How about you indicate why you would make the trade, and how you arrived at the positional iseaand state the position in text.    \n\nWrong has to do with your analysis and intent\n\nExample positional notation:     \n\nLong XYZ  call exp Oct 31, cost xxx.   \nShort XYZ call exp Oct 31, credit yyy.  \nNet cost zzz", "score": 1, "replies": []}, {"body": "Like where could this go against me other than the breakevens…. This seems wayyy too good to be true", "score": 1, "replies": [{"body": "You have failed to state why you intend the trade, and the rationale for constructing it.  \n\nYou must measure you intent against the proposed position.", "score": 1, "replies": []}]}]}, {"body": "sold dec 91$ TLT puts now it's 6$ in the money what is the best way to avoid assignment ? keep rolling it every week at 91$ or below strikes ? thanks in adnane  for the tips", "score": 1, "replies": [{"body": "Close the trade.  \n\nTLT  may continue down.  \n\nIf you must stay in,  roll down and out, for net zero or a credit, no further than 60 days out, chasing the shares down.", "score": 1, "replies": [{"body": "TLT is back up and i have made over $600 in gains so far on the 91$ put .", "score": 1, "replies": []}]}]}, {"body": "How to defend a DEBIT spread? Let say I have Call Debit (bullish) spread and stock goes down. Is there a way to defend it? Buying a bearish Put Debit spread adds to the cost, which sounds illogical.", "score": 1, "replies": [{"body": "IMO it is hard to defend a debit spread and is one of the reasons why credit spreads are often considered superior.\n\nSetting a profit and loss exit trigger is best and like any other trade close when the profit or loss hits your target.  Closing at the loss target minimizes the loss to go make new trades that are hopefully winners.  If you’re losing too many or too much then revisit your trading plan.  \n\nYou should open any spread at a risk you are willing to take if it goes wrong, so take the loss and move on.  If your analysis is that the stock may move in the right direction then possibly hold to see if it comes back, but at a certain point it just makes more sense to close and look for another trade.", "score": 2, "replies": []}, {"body": "Debit spreads are defined risk, but expensive if the stock doesn't move according to your directional assumption. If you are consistently losing money on these spreads, you should reevaluate your decision criteria for that assumption to begin with. You may also want to think about how much time you're giving the spread when you buy it. \n\nOne more suggestion: look into butterflies. These are trickier strategies in some respects, but much cheaper so if you are wrong on direction it simply doesn't hurt your P/L nearly as much.", "score": 2, "replies": []}, {"body": "Why do you need to defend a debit spread? It's defined risk. You agreed to a max loss when you opened the trade. If you don't want to lose that much, trade narrower spreads.\n\nAll that said, the conventional way to rescue a losing debit spread is the same as a long option, roll out in time and towards the money. For a call debit spread, that means roll the entire spread as a whole, not one leg at a time, down in strike prices.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "> However, I am making consistent profits lately on QQQ and SPY. Are they implying my losses will eventually compound enough to not be profitable eventually? \n\nYes, after more than fifteen years of continuous trading, or 5000 trades, whichever comes first. Might only be 2000 trades or 10,000 trades, depending on what you trade and how.\n\nDeep dive explainers here:\n\nhttps://moontowermeta.com/if-you-make-money-every-day-youre-not-maximizing/\n\nhttps://moontowermeta.com/understanding-edge/\n\nhttps://www.reddit.com/r/options/comments/14kdijb/what_you_can_expect/\n\n\n\n\n\nThe researched out-performance of broad-based low-cost index funds is confirmed on rolling 15 year averages. Any other kind of trading, like yours, can out-perform indexes in shorter time frames.\n\n> My end goal is to eventually have set enough money into a long term compounding interest account that will earn dividends to retire on, so mostly I’m wondering if it’s viable to earn this income via trading when these billionaires suggest against that, or am I misinterpreting them?\n\nIt's not \"billionaires\". It's economists and financial researchers looking at historical prices and trade performance. Vanguard has [the seminal whitepaper]() on the underperformance of active trading. TL;DR - overhead costs, like transaction fees or PFOF, are prominent reasons for underperformance, though not the only ones.\n\nhttps://corporate.vanguard.com/content/dam/corp/research/pdf/Vanguards-Principles-for-Investing-Success-US-ISGPRINC_062020_Online-1%20(1).pdf\n\nThe References section cites many of the papers from the researchers I mentioned. Carhart is seminal. It basically finds that actively traded mutual funds that outperformed indexes for some years all ended up underperforming eventually.\n\nIf you've got at least 15 years until you plan to retire, a [Boglehead Three-fund](https://www.bogleheads.org/wiki/Three-fund_portfolio) is your best bet. By a lot. Although, I do need to add the caveat that this is all based on the last 60 years of performance. If some major macro-economic change happens that means all bets are off, like I dunno, a worldwide pandemic that lasts for years, the results may not be repeated.\n\nBackground on the Boglehead philosophy, which is based on the research mentioned above: https://www.bogleheads.org/wiki/Getting_started\n\nYou can still use 5% of your asset value to mess around with options. Just don't bet your entire retirement on options, or any form of active trading.\n\nFinally, you don't need dividends for retirement income. In tax-advantaged accounts, assuming they are 100% reinvested, they don't make any difference one way or the other, not helping or hurting. Here's a 1:17 minute vid on the topic: https://www.youtube.com/watch?v=rylJcKFYW5E\n\nIf you want to learn more about your best bet on hitting your retirement goals and why dividends don't matter, check out the other videos on the Ben Felix channel. He breaks down the research into TL;DRs.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> I hope to retire in 18 years at ~35(I know the unrealistic reality of everything, and do have other career prospects where I can earn income, I just have time and this is my plan A)\n\nDo you know about FIRE (Financial Independence, Retire Early)? FIRE investing has some differences from traditional retirement investing, because the length of your earned wages period is much shorter. With FIRE, you either have to curtail expenses, so that more of your earned income can be invested, or you have to earn more than the average person, by taking on side hustles. Many FIRE investors do both.\n\nAll the stuff I mentioned, like Three-Fund, is for traditional retirement, where you start earning in your early 20s and don't retire until you late 60s. While some FIRE investors still use Three-Funds, you should look at FIRE blogs and discussion forums for advice on Boglehead philosophy as applied to FIRE.\n\n\n> What you're saying is that eventually, after around 15 years I will stop becoming profitable and should just rely on the funds I have saved into a bogglehead three fund?\n\nNo, and this is important to get right. It's not like \"everything that goes up must come down\" kind of thing. You don't go 14 years of earning 20% a year and then all of sudden in the 15th year you lose 1200% and end up with less than you started with. This is about *comparing* averages over large sample sizes. Averaging large sample sizes factors out luck and one-time events and gives you a better idea of the long-term trajectory of a trading method. \n\nSo, in comparison to a passive index, like the S&P 500 with dividends reinvested, the long term averages for active trading underperform the S&P 500 index. The active investing might still be profitable, but will be less profitable than the passive index. For example, the passive index might return 8% annually while active trading returns 3%. Active trading might have had some great years, like a 20% year followed by a 15% year, where the index only made 10% both years, but other years the active trading might only earn 7% when the index earned 12%, or active trading might have a negative return while the index was flat. All those differences add up over a long enough period of time and result in one underperforming the other.\n\n>  which I've calculated with dividend rates at 2.0-3.5% returns. Is that not a good way to go about it?\n\nBasically, no. Again, find a FIRE blog or discussion forum for better ways to do projections and financial planning. Here's a start, but you'll need more than this:\n\nhttps://www.bogleheads.org/wiki/Early_retirement", "score": 1, "replies": []}]}]}]}, {"body": "Newbee strategy evaluation request.\nI hold etf I'm bullish long term (in my case voo).\nI sell covered calls at about 10% above my cost basis 6 months into the future.\nAs soon as call is sold, I issue a buy order at \"my sell price - 10 cents\", as soon as I'm once again at 0 contacts, I once again sell at \"my last buy price + 10 cents\" and repeat the cycle. \nBased on my my test run over last week, i made 300$ on 100k.\n1) What am I risking to collect this profit? Based on my (not very good) analysis, my worst case scenario is that I lose liquidity for 6 months if stock goes up.\n2) Is there a way for my strategy to implode, or is it a guaranteed money?\n3) Am I better off just putting my funds in 5% APY account?", "score": 1, "replies": [{"body": "VOO's options are low volume, and relatively low liquidity.\n\nSPY, is based on the same index, has the highest volume options on the planet, and narrowest bid ask spread.\n\nPick SPY as your vehicle.  \n\nLosses occur when the index goes down.\n\nDo not sell covered calls more than 60 days out. Most theta decay  occurs in the final weeks of an option life.  You get more premium at the SAME DELTA, WITH SIX 30-day, or 3 60-day options compared to a 6-month option.  \n\nNever sell covered calls on shares you are not willing to have called away for a gain at the strike price.", "score": 2, "replies": []}]}, {"body": "How are Option Strategy orders filled?\n\n&#x200B;\n\nIf I want to do an option strategy, for example, a long spread, which includes a buy and a sell of calls. Will both buy and sell will be filled simultaneously (or atomically, using the word of programming)? If not, is it possible that part of the order is filled while another part is pending, which may expose a risk if the underlying value changes suddenly.\n\n&#x200B;\n\nSame question for the covered call. If I want to buy 100 share of underlying and sell a call option. Will they be filled simultaneously? For the big security like SPY, the extrinsic value of an in-the-money call is usually < $1. If there is a delay between buying a stock and selling a call, usually the change of the stock price may already be larger than the intrinsic value of an option, which sounds like a no-go for individual trader with broken computer.\n\n&#x200B;\n\nThanks in advance.", "score": 1, "replies": [{"body": "The order type determines the outcome.   \n\nAn order is gor a trading or holding position.   \n\nA strategy is an approach with steps  toward a holding. \n\nOrdering a spread requires the responding market maker to complete an entire order.\n\nSimilar action for a shares and option order, which might be handled by the broker ordering system. system.", "score": 1, "replies": []}, {"body": "> Will both buy and sell will be filled simultaneously (or atomically, using the word of programming)?\n\nIt's desirable that they are simultaneous, but it's up to you to decide if it is or isn't. You have control over that.\n\nThe typical way to trade multi-leg structures is as a whole. Trading structures as a whole guarantees simultaneous execution. However, you can choose to \"leg into\" a multi-leg structure one leg at a time. You typically get worse fill prices by legging in.\n\n> is it possible that part of the order is filled while another part is pending, which may expose a risk if the underlying value changes suddenly.\n\nWhen trading multi-leg structures as a whole, partial fills can happen, but only in terms of quantity. Like if you want to buy 5 spreads, maybe only 3 are filled and 2 are left open. It would never be the case that one leg is filled and the other is not, if trading as a whole. If all legs can't be filled simultaneously, the order won't fill at all. It's inherently All-Or-Nothing.\n\n> Same question for the covered call. If I want to buy 100 share of underlying and sell a call option. Will they be filled simultaneously? \n\nSame answer, that is under your control. If you want simultaneous fill, you will do what's called a \"buy-write\" order. It's the covered call version of trading a multi-leg spread as a whole. However, in the case of covered calls, it's much more common to be legged into over time. Usually the traders has owned shares for years and then decides to write calls against those shares.", "score": 1, "replies": []}]}, {"body": "Learning about options academically, but never traded.  I was thinking about ways to increase income and came up with an idea but I must be missing something.\n\nLet's say I have a meaningful portfolio in a Roth IRA.  Let's say it's all SPY ETFs.  Depending on my overall sentiment, couldn't I sell cash covered calls and be ambivalent if shares are called away as I could just take the proceeds and buy IVV and then sell cash covered calls on IVV intending to bounce back to SPY if they get called away, and so on?\n\nThe assumption is if SPY is up/down then IVV is up/down and vice versa.  No tax consequence and I remain fully invested in *something.*\n\nWhat are the risks?  I have to assume when the options go ITM and options are executed, strike price is not terribly far away from closing price so I don't think I'd be sacrificing much upside, and even so the income would offset.  Am I somehow prohibited from doing this or does my overall capital appreciation get dinged in some way during the tiny window where I am in cash?", "score": 1, "replies": [{"body": "No such thing as \"cash covered calls.\"  There are such things as covered calls.  That's when you own 100 shares of an underlying and sell a short call.\n\nIt's not clear what you think the advantage would be in buying IVV shares when your SPY shares are called away, as opposed to just re-purchasing SPY shares.  Also, why would there be no tax consequence?\n\nEarly assignment is rare.  You normally would not be assigned until expiration, by which time the underlying could indeed have moved significantly beyond the strike price.", "score": 1, "replies": [{"body": "Roth IRA is the vehicle.  Even so, I didn't account for the time duration between options being ITM and option expiration, I (mistakenly) presumed they would be assigned immediately.  Shows my lack of knowledge and answers my question.  Thank you!", "score": 1, "replies": [{"body": "Please review the educational links at the top of this weekly thread.  They were written for you.", "score": 1, "replies": []}, {"body": "Even if you were assigned immediately every time, this still wouldn't work. You don't get notified about an assignment until after the market has closed for the day. So there's still a whole day's worth of price movement that can screw you.\n\nExample: \n\n* You bought SPY shares with average cost of $400/share.\n\n* You write $410 covered calls for $1/share credit with the plan to immediately buy replacement shares at $410 if assigned.\n\n* SPY goes from $400 to $450 in a single day. Your CCs are assigned.\n\nNow what? The market price of SPY or IVV is much higher than $410 now. If you rebuy, you are paying $50 more than you paid for your original $400 cost. Even after discounting by your realized $10/share gain and $1/share credit, you still are paying $39/share more than what you started with. If SPY now drops back down to $400, you have less total account value than what you started with. If you had never written the CCs and only held SPY shares through that up and down, you would nave zero net gain/loss.", "score": 1, "replies": [{"body": "I think a 12.5% move in a day for SPY would be without precedent, but I understand your point.  I knew that you shouldn't write covered calls on something you're not comfortable with selling anyway, but I now see that sentiment is incomplete.\n\nYou shouldn't write covered calls on something you're not comfortable with selling at the strike price, regardless of the price of the underlying.  I think if you bought a stock and fully intended to sell it after a 20% gain then a covered call would make sense. You essentially get paid to sell your stock. It makes much less sense to me to write cover calls on shares you intended to hold for *open ended price appreciation.*", "score": 2, "replies": [{"body": "> I think a 12.5% move in a day for SPY would be without precedent\n\nTechnically true, since the biggest daily moves of the S&P 500 predated the inception of SPY. But moves of that size for the underlying index have happened in the past, in both directions, so there's no reason to say they can't happen again in the future.\n\nhttps://en.wikipedia.org/wiki/List_of_largest_daily_changes_in_the_S%26P_500_Index", "score": 2, "replies": []}, {"body": "That's certainly true. We get posts all the time asking \"help, I wrote a CC but it's gone ITM and I want to keep the shares. How can I salvage this situation?\"  It's good to realize early on that you can't without losing money.", "score": 1, "replies": []}]}]}]}]}, {"body": "putting everything else you said aside, I'm confused, why you would jump between SPY and IVV, in a Roth IRA out of a concern with tax consequences. The way a roth ira works is that there are no tax consequences. It sounds like you are trying to shield yourself from a situation that wouldn't exist under a Roth", "score": 1, "replies": []}]}, {"body": "Let's say Company X currently trades at 100$. \n\nI buy a call at the strike price of 125$, 6 months from now. I pay a premium of, let's say 10$.\r  \n\r  \nOutcome 1 : Stock goes sideways and ends at 100$. I don’t exercise my option and lose the premium (5$).\r  \nOutcome 2 : Stock goes down. Same as above, I don’t exercise my option and lose the premium (5$).\r  \nOutcome 3 : Stock goes up and is in the money, at 138$. I buy the stock for a profit of the difference (13$) minus the premium (5$) = 8$ profit. And I own the stock. \r  \n\r  \nHere’s my question : Where do the greeks, IV and Theta decay come into play ? Why do I care about them ?", "score": 1, "replies": [{"body": "Outcome 4.  Almost never take an option to expiration, nor exercise it, sell before expiration to harvest extrinsic value destroyed by time or by exercising.  Sell before expiration for a gain, or to harvest remaining value if for a loss.  \n\nIntroduction to extrinsic value, the cause of all Greeks.  \n\nhttps://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value", "score": 1, "replies": []}, {"body": "The dollar sign comes before the numeral.  If you are spelling out words, it's \"one hundred dollars,\" but if using a currency sign and numeral, it's $100, not 100$.\n\nNormally you would not want to exercise an option, because doing so sacrifices extrinsic value.  If a stock is trading at 138, a 125 strike call will be worth *more* than 13.00.  How much more depends on, among other things, time to expiration and IV, so that's where theta and vega come into play.\n\nIf there's a lot of time left, and/or IV is high, it may be worth, say, 20.00.  If you sold it, you would receive $2000 cash.  So why would you exercise and receive only $1300 of value?", "score": 1, "replies": []}, {"body": "> I pay a premium of, let's say 10$.\n\nvs.\n\n>  I don’t exercise my option and lose the premium (5$).\n\nThat should be $10 lost, not $5.\n\n>  Where do the greeks, IV and Theta decay come into play ? Why do I care about them ?\n\nYou care about them because at some point, before expiration, the premium may go up to $11 (10% gain), or may fall to $9 (10% loss). Those changes to premium might happen *even if the stock price is flat*. How can that happen? How can the premium go up or down even though the stock price is unchanged (might have gone up to $127 then down to $120 then back up to $125)? Greeks, IV, theta, that's how.\n\nChanges can happen that are *opposite* to the direction of the stock movement. Like the stock goes up in price, but the premium for the call goes down in value. That happens because of greeks also.\n\n**FAQ: Why did my options lose value when the stock price moved favorably?**\n\n* [Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)", "score": 1, "replies": []}]}, {"body": "What happens if I get exercised on the sell side of a debit spread? could you give a simple example please", "score": 1, "replies": [{"body": "\"Getting exercised\" means getting worked up or upset.  Presumably you mean, what if you have a debit spread and you get assigned on the short leg.\n\nAssignment isn't going to happen unless the short leg is ITM, and with a debit spread, that means the long leg is ITM too.  Say you have a 50/55 call debit spread.  If you get assigned on the short 50, you will sell 100 shares of the underlyingt\n at 50.  If this is happening because it's expiration, your long 55 leg will automatically be exercised, and you will buy 100 shares of the underlying at 55, for a net no shares position and a net $500 debit.\n\nIf for some reason you are getting assigned early, you will sell 100 shares of the underlying short at 50.  Provided you had enough buying power, you could actually leave that position open if you wanted to.  If you wanted or needed to close it, usually it would be better to buy the shares on the open market and sell the long leg, because doing it that way would capture the remaining extrinsic value, rather than exercising the long leg.", "score": 2, "replies": [{"body": "So therefore, if I get assigned, my loss is limited to the spread times a hundred no matter what?", "score": 1, "replies": [{"body": "Not necessarily, if you didn't manage your position correctly. You could get assigned esrly on the 50c, selling shares short at 50, and then do nothing for a while, letting the 55c expire worthless. You could then wait while the underlying rises to, say, 100, then receive a margin call.  You would have to buy to cover the short shares at 100, losing $5000 on the shares.", "score": 1, "replies": [{"body": "Mmm ok I understand that. Let's say you get assigned ln the 50c, do you then sell the long leg and you're good to go? Could you walk step by step on what the process is?", "score": 1, "replies": [{"body": "If you got assigned early on the 50c, you would be short 100 shares.  Are you familiar with short-selling stock?  That is what happens if you get assigned on a short call and you don't have long shares of the underlying. You then have a short shares position, which eventually, you have to close by buying shares.  As long as you are not in a margin call, when you do that is technically up to you.\n\nIf this was a spread position, though, you're probably going to want to just close the whole thing.  As I said above, it's better to buy the shares on the open market and sell the long.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Question about accessing data - sorry in advance I'm sure this has been asked before. What is an easy / cheap way to get access to real time data, to like lets say pull up an options chain? I've heard this can be done if you use ToS, on windows , and have, excel and use RTD function in the spreadsheet, but I don't have windows and was wondering if there is an easier way. I have ThinkOrSwim, but I want to be able, for example, to get the data and calculate the P/L of a specific trade for every strike. I thought it would be easy if I could just access the options price in a spreadsheet and have the formulas ready to go. but I can't figure out aw way to do that. I'm willing to learn a bit of python coding too, in order to do this. I just need to figure out where I can get access to options chain real time data. any suggestions would be appreciated. thanks", "score": 1, "replies": [{"body": "TOS has a data function that can deliver data to a spreadsheet.\n\nRTD TOS. \nAre the key search engine terms.  \n\nExample:    \n\nhttps://www.reddit.com/r/thinkorswim/comments/nr6vg8/a_howto_guide_for_using_rtd_functions_in/", "score": 1, "replies": [{"body": "thank you but I actually explained in my post, that those functions can only be used in windows which I don't have at the moment. I have an Apple environment. the RTD calls are built into windows functionality with the Component Object Model. it's a bridge in windows that connects apps to each other. so it doesn't work in a Mac environment. I may just have to get a Windows laptop to play with this if everything else fails. I'd like to see if there's some python solution first", "score": 1, "replies": [{"body": "For less than a thousand dollars you can have a windows machine.  \n\nI suggest posting on the main thread where more eyes will see the item.\n\n\nSuggested title to avoid the posting filter:  \n\nSeeking real time data to manipulate, but not TOS RTD to spreadsheet method.", "score": 1, "replies": []}]}]}]}, {"body": "Lets say you have 2200 shares of SAVE at 18$; Collecting 220$ a month on divi; Sell the Covered Call for Jan 2024 for 20c; 305$ per contract sold, so 6710$; 6710$ sits in money market fund now earns currently 5.3% on the 7 day yield.... easy money?", "score": 1, "replies": [{"body": "⁵Incomplete information.\n\nWhat strike price, what delta, what IV, and are you willing g to sell the shares at that strike?   \n\nRisk in covered calls is the shares going down", "score": 1, "replies": [{"body": "20c delta -0.5099, 116.83 IV of course willing to sell. I have an average price of 18$ currently it’s down at 16.5ish", "score": 1, "replies": [{"body": "The fall is the shares shows that this is not easy money. \n\nImplied above 50 or 60 is gigantic, and indicates that the shares could fall drastically.  \n\nGenerally do not sell covered calls more than 60 days out, as most theta decay occurs on the final weeks of an option life.", "score": 1, "replies": []}]}]}, {"body": "Works, unless SAVE rises above $23/share by expiration. And if that rise happens around the next ex-div before expiration, you may also get assigned early, missing out on a dividend and some of that MMF yield you are counting on.\n\nYou'll have $3/share of downside padding, but that probably won't make you feel all that much better if the stock tanks below $13/share. Of course, just holding the shares without the CC would feel bad $3 sooner.", "score": 1, "replies": [{"body": "Alright thanks for the legwork!", "score": 1, "replies": []}]}]}, {"body": "Hi all!  I’m an occasional r/options reader with what is probably my first ever post here about a happy problem.\n\n\r  \nMaking a long story short for simplicity’s sake, I owned 10 puts of CCL expiring this October 20 with a strike of $16.  Before going into work today I put in a limit order to sell my 10 puts at $2.95/ea.  The puts were sold immediately at market open for $3.34/ea.\n\n\r  \nNow, I’m not going to complain about selling my options for $390 more than I asked for them but it does seem odd.  While there are of course other retail traders like me who cannot monitor markets all day I’m surprised that a market maker or someone with an algo didn’t swoop in and claim that spread for themselves.\r  \n\n\nHas something like this ever happened to you?  That is, get a bid for far more than your ask?", "score": 1, "replies": [{"body": "Your puts sold at the market price, which happened to be higher than your limit order.", "score": 2, "replies": []}, {"body": "Opening of the market trades  can, because of imbalances of orders to buy and to sell, push the active market  price around.     \n\n can result in some selling orders being filled  at better than the minimum limit order price, and conversely, on occasion orders to buy can be filled at less than the maximum limit order price.", "score": 2, "replies": [{"body": "Thanks for the reply! I thought that the market was too efficient to allow this to happen.", "score": 1, "replies": [{"body": "If the market price moves, and the volume and depth of order book at the exchanges is large enough,  the market can  sustain the price, and this kind of fill on a limit order can occur", "score": 2, "replies": []}]}]}]}, {"body": "Anyone know of an options journal that can sync option trades from IBKR (or I can add manually), and give me the following: ROI %, Annualized ROI %, days invested, strike, margin, some reporting features like seeing which ticker is the best, any monthly trends, which ticker gave most returns over the months etc.", "score": 1, "replies": [{"body": "Here's what we have in the wiki, but I doubt they have exactly the columns you want. You may have to take one of these as a starting point and customize:\n\nhttps://www.reddit.com/r/options/wiki/toolbox/links/#wiki_trading_journals_.26amp.3B_record_keeping", "score": 1, "replies": []}]}]}
{"title": "WSJ: GameStop Stock Is on Track for Its Lowest Close of the Year", "selftext": "Link: https://www.wsj.com/livecoverage/stock-market-today-dow-jones-10-02-2023/card/gamestop-stock-is-on-track-for-its-lowest-close-of-the-year-QzyPYEfYQOkUyIBv1Aqn\n\nA rough run for shares of videogame retailer GameStop has the stock flirting with its lowest levels of the year.\n\nGameStop was recently down more than 4% to below $16, setting the shares on course for their lowest close of 2023—and the lowest since February 2021, according to Dow Jones Market Data.\n\nThe company last week named Ryan Cohen, who had been its executive chairman, its CEO. Cohen in a memo told employees to expect \"extreme frugality\" at the company.", "id": "16xyx4d", "created_utc": 1696258792.0, "score": 499, "upvote_ratio": 0.81, "num_comments": 12, "comments": [{"body": "Can’t make the transition to web3 without a long runway. Also, email didn’t go to field employees or store leaders. It went to corporate positions only.", "score": 202, "replies": [{"body": "Which means that Cohen's probably looking to cut the fat near the top. Either people start working hard or you won't have a job anymore.", "score": 160, "replies": [{"body": "It's moot. These white collar employees GameStop hires aren't the best in their field. The best ones are working for large tech or finance companies.\n\nThis isn't an employee performance issue. It's a business that unfortunately, is stuck in the retail industry and unless you're innovative with retail, you're not surviving the modern world of business. People are spending record amounts of money. Just not with traditional retail companies.", "score": -33, "replies": []}]}]}, {"body": "Market cap is 4.6 billion… they have over a billion in cash and no debt and I believe about 700 million in inventory as of last quarterly report. Depending on what they have as other assets, this might be a good entry point. \n\nDo your research tho as hedge funds are in a battle with retail here.\n\nEDIT: since some how I can’t reply to comments? Jeez, since when are we not able to have a substantial discussion about a stock?\n\nReply to below:\n\nThere’s a reason why GameStop sees massive swings in prices every few months (up or down). That’s not a normal market behavior. To me this is indicative of the retail vs hedge fund conflict. And don’t tell me some BS that randomly (seemingly quarterly) retail gets together to buy millions of shares and raise the price of the stock by 30% in one day.\n\nAnd commenter is correct: 1B in cash was raised when the opportunity arose for the company. Without that capital inflow their situation would be much more dire, and the opportunity to be profitable would not exist.\n\nCommenter brings up just revenue as a fact to back your opinion, and yet say that the numbers I cited don’t matter? If you must make that claim then make a complete claim based on a valuation model (DCF, CCA, PTA). Revenue means nothing without context on cost of sales, profit margin, etc..\n\nMy post was simple: at this price point I would consider it a buy for those who believe Ryan Cohen will use those advantages I listed and turn the ship around. If you don’t, then short it. It shouldn’t be a controversial opinion.", "score": 318, "replies": [{"body": "Load of bull with no actual numbers that matter.\n\nIf it weren't for the cash they raised by taking advantage of meme investors boosting the share price, this company would be headed towards bankruptcy right now. That speaks of an operational issue that can't be solved just by having cash. Cash will help you survive longer but unless GameStop has a real business strategy to grow revenue, this company is just delaying the inevitable. Retail isn't a strong sector for obvious reasons.\n\nYou fail to mention that they are doing $6 billion in revenue and it declines every year. In 2009, they did $9 billion in revenue. How do you lose $3 billion in revenue in 15 years and your stock is worth 3x more? It doesn't add up. \n\nYou're still making this out to be a hedge fund vs retail. Hedge funds shorting has NOTHING to do with a company's operations. Hedge funds aren't causing GameStop to lose revenue. Stock price =/= operations. So unless GameStop fixes their operations, the stock price is irrelevant. They will be heading towards insolvency by this decade.", "score": -111, "replies": []}]}, {"body": "Who would have guessed a company that struggles to scrape barely positive earnings with a multibillion valuation and absolutely no growth prospect would be losing market cap", "score": 171, "replies": [{"body": "They had one profitable quarter QT4 what is always the most profitable for retail, they still cannot consistently turn a profit the last two quarters were negative.\n\nHowever Ryan Cohens leaked memo basically saying he as the CEO was out of ideas on how to turn the ship around so the employees would have to make sacrifices for GME.\n\nWhat is what every employee loves to hear, you need to make extreme sacrifices and work harder for your billionaire boss", "score": -14, "replies": [{"body": "[deleted]", "score": 63, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "[deleted]", "score": -25, "replies": [{"body": "...I expect it go down far more before it squeezes. Like it goes down to $5 and then squeezes up to $7 or $8. How will it go to $240? You need way more people buying up the shares for it to squeeze, and the momentum that was there in 2021 just isn't here today.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -31, "replies": [{"body": "You can short the stock instead.", "score": 40, "replies": []}]}]}
{"title": "Tesla misses estimates for quarterly deliveries; shares fall", "selftext": "", "id": "16xwvwq", "created_utc": 1696253899.0, "score": 15, "upvote_ratio": 0.6, "num_comments": 20, "comments": [{"body": "When was this supposed fall?  I'm looking at TSLA and it's still up 8% on the week.", "score": 18, "replies": [{"body": "It fell for 10 minutes then recovered immediately", "score": 15, "replies": [{"body": "💹251.60 USD +1.38 (0.55%) today\n\nReuters = trash", "score": 3, "replies": []}]}]}, {"body": "It’s no big concern as they are revamping their Gigafactories to be lower cost and refreshing the Model 3 with the Highlander refresh and touching up the Model 3. These strategic moves will ensure more profits and higher sales even with reduced prices.", "score": 20, "replies": [{"body": "Word", "score": 0, "replies": [{"body": "Character \n\n\"touching up Model ~~3~~ Y\"?\n\nedit: changed \"Letter\" to \"Character\" to be more precise :-)", "score": 1, "replies": []}]}]}, {"body": "It missed narrowly, by what \\~20K cars? ~~535k~~ 435k cars delivered in a quarter is insane for any car company in this economy.", "score": 6, "replies": []}, {"body": "Tesla Q3 deliveries:\n\nQ3 2023: 435,059  \nQ3 2022: 343,830  \nQ3 2021:  241,391  \nQ3 2020: 139,300  \nQ3 2019:    97,000  \nQ3 2018:   83,500  \nQ3 2017:    26,150  \nQ3 2016:   24,500  \nQ3 2015:    11,580  \nQ3 2014:     7,785  \nQ3 2013:     5,500  \nQ3 2012:        321  \nQ3 2011:           0", "score": 5, "replies": [{"body": "So, up 26% YoY.  In a year where interest rates are way higher now...\n\nNot too bad.", "score": 4, "replies": []}]}, {"body": "So estimates missed reality. So dumb that the market somehow gives more credence to guessing by outsiders than actual growth", "score": 3, "replies": [{"body": "I think they expect us to believe that the price is what it is because of their estimates. Therefore, if the reality falls short of the estimates, so should the price.", "score": 1, "replies": [{"body": "Correct, but they rarely get it right. James Stevenson usually has more data so gets it closer than most.", "score": 1, "replies": []}]}]}, {"body": "It was lightly missed due to Tesla s strategic focus on factory upgrade, to prepare for higher productivity and gigantic casting capability etc.", "score": 2, "replies": []}, {"body": "The company will report third-quarter results on Oct. 18.", "score": -3, "replies": [{"body": "Right so until then this is just speculation.The whole thing is kind of dumb tbh. They are going to be 20k cars less produced but the orders will be filled with old stock so really isn't that a net gain? Maybe I'm too dumb to understand this stuff- not being sarcastic.\n\nI hold Tesla Stock because of what I think Tesla will become if Elon can keep his ego in check which I think is affecting share price more than any of this kind of stuff. It seems like small potatoes in the grand scheme of Tesla.", "score": 5, "replies": []}, {"body": "Crazy, because stock is currently up. \n\nAlso, I hate your headline.", "score": 3, "replies": []}]}, {"body": "Fell upwards", "score": 1, "replies": []}, {"body": "Just wait till next quarter", "score": 1, "replies": []}]}
