{"title": "Free Peer Reviewed & Collegiate (MIT) Courses", "selftext": "I always knew I was a strange kid when in high school I learned about options and became engrossed in learning about markets. For those that don't have that same strange curiosity I do but want a short list to some great free information, here's a list of MIT and other institutions courseware that provide free access. I regularly keep track and take the free courses I can find. I studied stats heavily in my undergrad and grad which has been very useful for me in trading options. \n\nBelow are a few cool courses:\n\n1. [https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/](https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/)\n   1. [https://www.youtube.com/watch?app=desktop&v=eG\\_aRPy1KVE](https://www.youtube.com/watch?app=desktop&v=eG_aRPy1KVE)\n      1. This is an hour and 20 minute course on option pricing and their probability duality\n2. [https://ocw.mit.edu/courses/15-433-investments-spring-2003/](https://ocw.mit.edu/courses/15-433-investments-spring-2003/)\n3. [https://ocw.mit.edu/courses/14-453-macroeconomic-theory-iii-fall-2006/](https://ocw.mit.edu/courses/14-453-macroeconomic-theory-iii-fall-2006/)\n4. [https://ocw.mit.edu/courses/15-997-practice-of-finance-advanced-corporate-risk-management-spring-2009/](https://ocw.mit.edu/courses/15-997-practice-of-finance-advanced-corporate-risk-management-spring-2009/)\n   1. *I really like this one for retail traders to gain a better understanding of how intuitions think*\n5. [https://ocw.mit.edu/courses/18-655-mathematical-statistics-spring-2016/](https://ocw.mit.edu/courses/18-655-mathematical-statistics-spring-2016/)\n6. [https://ocw.mit.edu/courses/14-381-statistical-method-in-economics-fall-2018/](https://ocw.mit.edu/courses/14-381-statistical-method-in-economics-fall-2018/)\n7. [https://ocw.mit.edu/courses/18-175-theory-of-probability-spring-2014/](https://ocw.mit.edu/courses/18-175-theory-of-probability-spring-2014/)\n8. [https://ocw.mit.edu/courses/15-401-finance-theory-i-fall-2008/](https://ocw.mit.edu/courses/15-401-finance-theory-i-fall-2008/)\n   1. This has an hour plus long video included on YouTube covering options utilization - this one is a bit dated but the concepts remain solid.\n\nHere are some of my favorite recent (released within 5 years) white papers.\n\n1. **Easy Volatility Investing (2013)** \n   1. Okay, I lied this one is old but a really great paper that discusses the overly beaten dead horse that is selling options being related to picking up pennies in front of a steamroller (PS. steamrollers are pretty slow, just fucking move)\n   2. [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=2255327](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2255327)\n2. **Retail Option Trading and Liquidity: Evidence from High-Frequency Data**\n   1. This paper dives into the impact of options markets on liquidity of stocks. Primary use here isn't really the liquidity impact to retail traders, but to institutions and MMs, which retail traders still work around. \n   2. [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4567604](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4567604)\n3. **Why Do Insiders Sell Stocks after Receiving Options?**\n   1. This one is pretty cool and talks about insider trading behavior, specifically trading activity around option grants where net sales after receiving options drastically increases. \n   2. [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4587326](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4587326)\n4. **Forecasting Stock Returns with Lstm for Options Trading**\n   1. LSTM is a neat approach to options trading by integrating long short-term memory, it also includes monte carlo simulations. Leveraging different frequency prices as features and incorporating the Gate Recurrent Unit (GRU), the proposed method demonstrates its effectiveness in enhancing backtesting performance and filtering trading strategies based on expected values.\n   2. [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4581285](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4581285)\n5. **A Market Maker of Two Markets: The Role of Options in ETF Arbitrage**\n   1. Another cool study that covers how market makers use options in arbitraging ETFs \n   2. [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4395938](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4395938)\n6. **Trading Activity of VIX Futures and Options Around FOMC Announcements**\n   1. These last two are some of my favorites from this years releases. From the abstract:  We provide empirical evidence that the abnormal order imbalances of VIX futures and call (put) options are significantly negative (positive) during FOMC embargoes. Our results remain robust under various empirical approaches for examining FOMC announcements. We also find that the VIX return (trading volume) is negatively (positively) associated with FOMC announcements. Overall, we document short-lived informational advantages in the VIX derivatives market and provide evidence of potential information leakage during FOMC embargoes. \n   2. [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4559935](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4559935)\n7. **Do Variance Expectations Overreact? Evidence From the Cross-section of Stock Options**\n   1. Second more recent favorite study. They used IV as a proxy for variance expectations and found strong evidence of overreaction to variance news in a cross-section analysis. This highlights how effective things like straddles are at capturing the overreaction effect (variance premiums)\n   2. [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4554103](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4554103)\n\nI stay up to date on these studies because I find them interesting and they give me ideas to test. As always, if anyone has any questions or if there's anything I can do to help, just let me know. In the meantime, I'm done nerding for tonight and headed out to a car meet. Have a great Friday everyone!", "id": "17i510i", "created_utc": 1698463732.0, "score": 112, "upvote_ratio": 0.96, "num_comments": 21, "comments": [{"body": "Awesome post! Thanks.", "score": 4, "replies": []}, {"body": "Thanks for sharing", "score": 3, "replies": []}, {"body": "Awesome!! 🙏🏼", "score": 3, "replies": []}, {"body": "Saved. Thanks!", "score": 2, "replies": []}, {"body": "I am very grateful for these resources. I am deeply interested in learning in this space. Thank you kindly!", "score": 2, "replies": []}, {"body": "Than you so much, great find", "score": 2, "replies": []}, {"body": "I love info like this thank you", "score": 2, "replies": []}, {"body": "Wow.  This is awesome, OP.  Thank you!", "score": 2, "replies": []}, {"body": "Thank you!", "score": 2, "replies": [{"body": "you got it!", "score": 1, "replies": []}]}, {"body": "MIT OCW has so much good content across basically every technical field. Incredible resource", "score": 2, "replies": []}, {"body": "I used OCW to study if I skipped class at MIT. It’s such an incredible free resource", "score": 2, "replies": []}, {"body": "Just was I was hoping to find! I'm very new to options, hopefully this will give me insight. Do you have any suggestions for newer traders? \nI've used robinhood before but would like to learn more about options and leveraging. Etc.", "score": 2, "replies": [{"body": "For options, I'd grab a copy of Options as a Strategic Investment by Lawrence McMillan - great book. I'd also ditch robinhood, really an unimpressive broker all around.", "score": 1, "replies": [{"body": "I'll look into that! Thanks for the information!", "score": 1, "replies": []}, {"body": "Which brokerage do you like best for stocks/equities, and which one do you like best for options?\n\nTYIA.", "score": 1, "replies": []}]}]}, {"body": "Easy volatility investing is about using volatility ETFs to trade vix futures term structure. It's great and I'm implementing it. It builds on top of Simon&Campaso paper https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2094510", "score": 2, "replies": []}, {"body": "Wow. Thank you very much. I will study all your courses and paper trade to see if I am smart enough, logical enough and unemotional enough to have any luck trading stocks.  If you have any questions about new Biotechnology stocks I am a retired physician Pathologist-Scientist and Attorney and can explain In laymen terms what a new biotechnology stock or service is selling or providing.  drbillmanion@aol.com. 856-607-8641 US phone number.  W Manion, MDPHDJDMBA", "score": -5, "replies": [{"body": "The company’s name is webistics", "score": 1, "replies": [{"body": "Thank you very much for name webistics. W Manion, MDPHDJDMBA", "score": 1, "replies": []}]}]}, {"body": "Thank you for sharing the resources you've compiled", "score": 1, "replies": []}]}
{"title": "Is this the easiest 2x you've guys seen since META?", "selftext": "Literally number 1 financial app in app store. Small business use them everywhere. Is this a joke how low it is? 24bill market cap and they make 5bil in Rev a quarter. They should be a 50bill MC. (5 X 10 = 50).", "id": "17i60xs", "created_utc": 1698467523.0, "score": 4, "upvote_ratio": 0.6, "num_comments": 15, "comments": [{"body": "Problem is, despite increasing revenue well into the billions...  THEY LOSE MONEY.\n\nAs we head into a recession, they'll see revenue and more importantly profit, drop.\n\nAny attempt to increase fees to increase profit means loss of subscribers to a competitor. \n\nIs it a potential multi bagger?  Yes, but I think it's going lower before it climbs.  And they gotta get to neutral or profitable so they are operationally stable and saving cash not burning it.", "score": 6, "replies": [{"body": "Why do people keep saying we going in a recession but we never do? It's been almost 6 years since 2018 recession fears. Just look at labor market at all time highs and inflation too. People are spending money like a ******.", "score": 1, "replies": [{"body": "Because we are already in one......", "score": 2, "replies": [{"body": "Then if we in one it's time to buy stocks. That's the best time to buy.", "score": 2, "replies": [{"body": "Not quite yet....\n\nBut you do you if you feel this is the bottom....", "score": -1, "replies": [{"body": "Lmfao atrocious advice.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Not as easy as American  green", "score": 2, "replies": []}, {"body": "Did you know twitter (X) will become a financial app soon?", "score": 2, "replies": [{"body": "no, i didnt know that before i went all in... but isnt twitter going bankrupt? if not, how long would it take for him to make it? cuz i only swing trade stocks.", "score": -1, "replies": []}]}, {"body": "Jack. . . is that you?", "score": 1, "replies": []}, {"body": "I just can't put my money behind a company like them after all the pain they have caused me. My Ex used to send me a relationship request everyday just so she could break up with me again and it made me a little crazy.", "score": 1, "replies": [{"body": "Isn't that ur ex fault? SQ is a good company. Just do it for the money. Or u could wait until SQ goes to 30$. That's a possibility. But I'd rather not wait and hope it goes lower, cuz I missed out on meta after I thought it'd go a little lower.", "score": 1, "replies": [{"body": "Thanks for saying it's not my fault for doing alot of cocaine :)", "score": 1, "replies": []}]}]}]}
{"title": "Telehealth companies", "selftext": "As you know, telehealth has been getting crushed on the market since the pandemic bubble. What are your thoughts on the stock valuation of companies on the market? Is there hope to get back to pricing near/during the pandemic highs? Doesn’t seem like a lot of excitement even though telehealth has so much growth potential and expectation as it integrates into healthcare. I’m long, but wondering what others are thinking and what indicators you may be waiting for. Thanks.", "id": "17i2flr", "created_utc": 1698455005.0, "score": 8, "upvote_ratio": 0.71, "num_comments": 15, "comments": [{"body": "Still can’t believe that phoney ARKK weirdo bid up TDOC to $300/share and was pushing it as a future $2,000/share stock only to watch it drop 95% in two years", "score": 6, "replies": [{"body": "Yeah, I mean they do that for a lot of other stocks too.", "score": 1, "replies": []}]}, {"body": "TDOC is showing slow but steady top line growth, but I’d still say there are better industries to buy into. Anything else you’re looking at?", "score": 5, "replies": [{"body": "I picked up a lot of AMWL since it’s essentially at the bottom. They just announced a contract with US Military and are continuing to integrate their Converge platform to US healthcare system.", "score": 2, "replies": []}]}, {"body": "\"Is there hope to get back to pricing near/during the pandemic highs?\"\n\nNot without another pandemic. I can't see ZM gettting remotely close to where it was (I say this genuinely: I'd like to know what drugs Ark analysts were on when they wrote the report it could get to $1,500 in 2026 not that long ago; I can't fathom the mental gymnastics that it took to get there), CART made a dumb decision to not go public during the pandemic, etc.\n\n\"What are your thoughts on the stock valuation of companies on the market?\"\n\nLVGO selling to TDOC was a huge success for me. They then proceeded to write down most of the value of the $18B they spent on LVGO. I owned ONEM for a while, gave up on it then AMZN bought it for quite a bit lower. There is really ultimately not enough moat to these things; telehealth will continue to be a thing but it feels like it has become commoditized faster than I would have thought. It may be something people use and like but that doesn't always = good investment.", "score": 3, "replies": []}, {"body": "It all has to do with Insurance coverage,  I notice a big drop off in video appointments and my guess is the reimbursements have dropped. that can happen overnight in a policy decision", "score": 3, "replies": []}, {"body": "If you used teladoc at least once, you'd never touch this space", "score": 10, "replies": [{"body": "It has very high customer ratings... I'll take those over your comment.", "score": 3, "replies": [{"body": ">It has very high customer ratings\n\nSo do quite a few things I bought on Amazon that turned out to be nothing but garbage.", "score": 4, "replies": []}, {"body": "Most customers never make a complaint.  They just stop using a product.  So take customer comments with a grain of salt.", "score": 1, "replies": []}]}, {"body": "It makes sense if there’s a pandemic happening, but really only then. People actually need to see their doctors in person.", "score": 1, "replies": []}]}, {"body": "I like HIMS, but valuation has been trending down since first quarter despite strong earnings and revenue growth.", "score": 2, "replies": []}, {"body": "Never understood, my doctor and I have used FaceTime since before the pandemic.   Once, my doctor being in NJ and I was on a business trip in India having an allergy reaction to malaria meds and we FaceTime.", "score": 2, "replies": []}, {"body": "T.TO", "score": 2, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "17ifg5g", "created_utc": 1698504892.0, "score": 0, "upvote_ratio": 0.08, "num_comments": 11, "comments": [{"body": "What?", "score": 5, "replies": []}, {"body": "What?", "score": 4, "replies": []}, {"body": "Lol let’s get you back to bed grandma", "score": 5, "replies": []}, {"body": "You're either thinking of stock buy acks, where they buy their existing stock back, or of shorting stocks. Either way case closed.", "score": 2, "replies": []}, {"body": "Sleep it off", "score": 2, "replies": []}, {"body": "@Op You can, its called shorting. You'll make profits as the price of the stock falls.", "score": 2, "replies": []}, {"body": "OP just invented short selling", "score": 2, "replies": []}, {"body": "You should word this better because it doesn’t make sense at all or I understood it as something idiotic that can be ignored. \nPlease clarify to avoid misunderstanding because like other responses: What!?”", "score": 1, "replies": []}, {"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "![gif](emote|free_emotes_pack|thinking_face_hmm)![gif](emote|free_emotes_pack|facepalm)", "score": 1, "replies": []}]}
