{"title": "[deleted by user]", "selftext": "[removed]", "id": "85tm2w", "created_utc": 1521560036.0, "score": 935, "upvote_ratio": 0.97, "num_comments": 172, "comments": [{"body": "[removed]", "score": 425, "replies": [{"body": "> asked my professor what FDs are\n\nSomeone mod this fuck", "score": 548, "replies": []}, {"body": "LMAO you can't make that shit up. Just out of curiosity what was his response? Was he utterly confused or does he perhaps lurk /r/WSB and properly answered with \"faggot delights, ya faggot!\" ", "score": 204, "replies": [{"body": "[removed]", "score": 147, "replies": [{"body": "> use it in a sentence\n\n\"OP bought FDs deep OTM and now hes fucked\"", "score": 127, "replies": [{"body": "hahahaha", "score": 12, "replies": []}]}, {"body": "holy shit thats incredible. What autistic school do you go to?", "score": 131, "replies": []}, {"body": "Awww lol. ", "score": 22, "replies": []}, {"body": "Well now that you know, you better fill them in. Fucking pussy. Share your knowledge.", "score": 27, "replies": []}]}, {"body": "What FD actually means?", "score": 26, "replies": [{"body": "Faggots delight ", "score": 56, "replies": []}, {"body": "Faggot delights aka weekly expiration options contracts. ", "score": 54, "replies": [{"body": "TIL. Thanks.", "score": 3, "replies": [{"body": "Fuckin' eh, man! No problem. ", "score": 3, "replies": []}]}]}]}, {"body": "Not gonna lie. Until now I didn't know what it meant either. I'm over here thinking that's some option related talk lmao. Fuck you guys!", "score": 36, "replies": [{"body": "> I'm over here thinking that's some option related talk lmao. \n\nAccording to the gentlemen posted above you, it is related to options.", "score": 5, "replies": []}]}]}, {"body": "Found the, very stable, genius billionaire.", "score": 75, "replies": []}, {"body": "I laughed so hard at this I forgot what the actual post was about.", "score": 38, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "FD = Faggot's Delights and it is a term exclusive to this subreddit. They're weekly calls.", "score": 29, "replies": []}]}, {"body": "The real post is in the comments", "score": 4, "replies": []}]}, {"body": "Financial Differentials", "score": 20, "replies": [{"body": "everyone else is lying", "score": 3, "replies": []}]}, {"body": "Did your professor know the answer?", "score": 18, "replies": []}, {"body": "Goddamnit lmfao", "score": 8, "replies": []}, {"body": "rx7 or flush draws", "score": 8, "replies": []}, {"body": "Looks like I need to come teach your class ", "score": 1, "replies": []}]}, {"body": "How far out are your options?", "score": 113, "replies": [{"body": "[deleted]", "score": 165, "replies": [{"body": "[removed]", "score": 51, "replies": [{"body": "fAgGoTs DeLiGhTs", "score": 241, "replies": [{"body": "y u spillin secrets snitch", "score": 93, "replies": [{"body": "Ban him", "score": 11, "replies": []}]}]}, {"body": "Ask your professor.", "score": 70, "replies": []}, {"body": "Fri Day", "score": 23, "replies": [{"body": "Thank god it's FD", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Weekly OTMs", "score": 8, "replies": []}]}]}]}, {"body": "compare divide secretive kiss pot berserk yam unpack hungry cake", "score": 58, "replies": [{"body": "You went all in on these?", "score": 34, "replies": [{"body": "Is there an alternate Robin Hood options strategy?", "score": 112, "replies": []}, {"body": "Looks like it. It's probably just his fuck-you-money to play with.", "score": 16, "replies": []}]}, {"body": "What sucks is they don't offer 0 days.  I want to yolo on SPY 0 day FDs and I guess they are trying to protect me.  Can anyone confirm they also aren't offered 0s?", "score": 5, "replies": []}, {"body": "Yu still holding bubkus?", "score": 2, "replies": []}]}]}, {"body": "GODDAMMIT ROBINHOOD GIVE ME OPTIONS", "score": 193, "replies": [{"body": "I just got an email for it today of all times. Not sure how I feel about it after giving a quick browse.. but if it's free..", "score": 53, "replies": [{"body": "> but if it's free..\n\nthe first hit is always free", "score": 143, "replies": []}, {"body": "What, you got options access without even having an account? Fuck! ", "score": 16, "replies": [{"body": "RH saving you from yourself", "score": 15, "replies": []}, {"body": "I have an account... but I haven't used it in a year. And when I did it wasn't more than a hundred bucks lol.", "score": 6, "replies": [{"body": "God dammit lol", "score": 7, "replies": []}]}]}]}, {"body": "So on top of updating your investment profile based on the other thread, you also need to send support an email asking when you will get options. I updated the profile last week and sent an email yesterday afternoon. Got approved for level 3 this morning. ", "score": 16, "replies": [{"body": "I've done both and still nothing. Meanwhile people with $60 in their account are getting approved. ", "score": 23, "replies": [{"body": "i'm beginning to wonder if they're rolling it out to different types of people to basically run an experiment on which type of person is the most/least successful. then they can further target certain types of users for different products, marketing, etc.", "score": 18, "replies": [{"body": "From what I heard somewhere else, it might be regional (country, state, etc.) I live in the Northeast of the United States and got approved last week on Thursday. ", "score": 6, "replies": [{"body": "I’m in Mi, changed my investment profile and emailed support. Their reply? “Faggots get it in a few weeks”", "score": 11, "replies": [{"body": "I live in MI and got options a week ago. All I did was sign up. Maybe you're being too faggy.", "score": 2, "replies": [{"body": "Faggot delights. Didn’t check the portfolio today until well after market close and those cucks at RH gave me options. So you can kiss my thicc dick fgt.", "score": 2, "replies": [{"body": ">Didn’t check the portfolio today until well after market close\n\nAnd you call yourself an autist.", "score": 2, "replies": []}]}, {"body": "I’m in Grand Rapids and got it a while ago ", "score": 1, "replies": []}]}]}, {"body": "In CA and I got approved this morning, fwiw", "score": 1, "replies": []}]}]}, {"body": "I got approved with 11 dollars in my account. ", "score": 2, "replies": []}, {"body": "I just got approved last week and I have 0 in it right now .", "score": 1, "replies": []}]}, {"body": "which thread describes the settings?", "score": 6, "replies": [{"body": "bump", "score": 3, "replies": []}]}, {"body": "pls link other thread :<", "score": 2, "replies": []}, {"body": "how do I do that? I am on the app now and I don't see any investment profile options", "score": 1, "replies": [{"body": "settings > investment profile\n\non iOS", "score": 3, "replies": []}]}]}, {"body": "I emailed support like \"I can has options pls\" they moved me up in line said I'd get it within 3 weeks, literally the next day I had options. ", "score": 6, "replies": []}, {"body": "[deleted]", "score": 27, "replies": [{"body": "I'm too lazy to switch. I already have RH. ", "score": 22, "replies": [{"body": "And it's free", "score": 29, "replies": [{"body": "Also depending on what you are doing it's good enough.\n\nUnless you are day trading there is no need to use a better broker.\n", "score": 15, "replies": [{"body": "Why would a different broker be better for day trading? ", "score": 7, "replies": [{"body": "Speed.", "score": 15, "replies": [{"body": "Ah, I never noticed any sort of delay on RH. Probably because I don't trade on a short time frame. ", "score": 4, "replies": [{"body": "Yeah it can be hard to make quick trades with a phone app, the big boys got some advanced desktop trading tools. Also speed, I meant the big brokers have better execution speed, as well as reliable. Sometimes robinhood orders won't fill. My friend got 3 accounts for the same reason because he doesn't want to lose an opportunity when a platform just goes down... ", "score": 8, "replies": [{"body": "You can use their website now. I \"joined\" the waiting list and was able to use the website to trade within 45 minutes. I'm not sure how fast it is compared to an actual broker, though.", "score": 3, "replies": [{"body": "The website is all of a sudden working for everyone I guess. Let's see how fast that is. I am sure it's still API (phone or website) that process the order. ", "score": 2, "replies": []}]}]}]}]}, {"body": "Faster fill times,  routes through more market places.  Robinhoods pc app is still in beta.", "score": 2, "replies": []}]}]}]}]}, {"body": "No kidding. I got my option trading enabled same day after filling out a survey through Fidelity. Maybe if these kids had any meaningful income or equity, they would get option trading faster", "score": 8, "replies": [{"body": "i think a lot of people aren't interested in yolo'ing their real accounts with their real brokers through options, but would like to throw money around on their play accounts with RH. the point is -- income, investing profile, requests, etc. don't seem to matter with RH. they just seem to approve options at random.", "score": 10, "replies": []}, {"body": "Some guy with $64 in his account got it. I have almost $10k (I know, baby money) in my account and make more than the average American household but still don't have shit. At this point I'm only staying with rh because I refuse to break.", "score": 8, "replies": [{"body": "If 10k is baby money then what is my 3k??", "score": 11, "replies": [{"body": "\"Cum-left-over-on-her-lips-because-your-mom-almost-swallowed-your-pre-baby-ass\" money.", "score": 14, "replies": [{"body": "Hahahaha I love this sub-reddit you are a savage", "score": -2, "replies": []}]}, {"body": "Fetus money.", "score": 15, "replies": []}, {"body": "And what is my $150?", "score": 0, "replies": [{"body": "Ban worthy. ", "score": 16, "replies": [{"body": "Damn..", "score": 2, "replies": []}]}, {"body": "Not enough for some options contracts lol", "score": 2, "replies": []}]}]}, {"body": "I have 60 cents in mine and got them.\n\n\nEmail their customer support. I got them a week after I did this.", "score": 3, "replies": []}]}]}]}, {"body": "See my post faggot", "score": 2, "replies": []}, {"body": "if u want u can just wire me money and then I'll put it on my robin hood options and u make many monies", "score": 2, "replies": []}, {"body": "I have one dollar in my Robinhood account and they gave me options. ", "score": 2, "replies": []}, {"body": "Just tell me what options to buy I'll tell you how we are doing. I got options and no knowledge. ", "score": 1, "replies": []}, {"body": "Lol I wasn't even interested in options and I just noticed that I was eligible", "score": 1, "replies": []}]}, {"body": "Beast! Why do I keep fucking with SPY in its consolidation formation when Facebook is bleeding out like the boar that ended King Robert. ", "score": 75, "replies": [{"body": "weird you started your comment with ‘beast!’ but i see you have upvotes?", "score": 19, "replies": [{"body": "What an astutely faggy observation of you. Have some karma. ", "score": 7, "replies": []}]}, {"body": "Spoilers", "score": 29, "replies": [{"body": "No spoilers if you don't know King Robert", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah it's fuuuuucked. I'm mostly cash now, waiting for tomorrow's big move if there is any. ", "score": 1, "replies": []}]}]}, {"body": "how do i puts on your battery life", "score": 61, "replies": [{"body": "Fuck that, op knows what he's doing. He'll be plugging it in any minute meow. Buy the dip! ", "score": 17, "replies": []}, {"body": "Straddle at 50% would be my play. ", "score": 6, "replies": []}]}, {"body": "I was gunna say nice, instead I’m gunna say charge your fucking phone", "score": 80, "replies": [{"body": "His phone run exclusively on cocaine, this is wall street ffs", "score": 14, "replies": []}, {"body": "Batteries work like investments. You fully fund them and lose everything in a day. He's down to 7% of his initial investment. Working as intended.", "score": 3, "replies": []}]}, {"body": "me losing money on options has made me hesitant to get back in, but this shit makes me hard af.", "score": 17, "replies": [{"body": "I'm in the same boat\n\nI've been trying to sell spreads but I'm saying too close to the money and getting burned, then closing losers too early. I know the smart thing to do is sell further OTM options, or stay with ETFs to start... but I keep getting greedy and sacrificing probability for the sake of higher potential profits.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Can't afford the second leg. ", "score": 26, "replies": [{"body": "Get that Iron Condor bruh geeez ", "score": 5, "replies": [{"body": "the next thing i want to learn are options strategies. looking up iron condor now. ", "score": 5, "replies": [{"body": "https://youtu.be/Eg8IyTPoaQY", "score": 1, "replies": [{"body": "i literally just watched that. interesting for sure", "score": 3, "replies": [{"body": "Check out my reply to dude below.  I def recommend the Sky View Trading system which is what that vid is from.  The best online course ive ever taken. It's $200 a month but if you ask them they will give you a code for $150. I really didn't wanna pay that much, seems like a lot,  but I renewed for another month.  Their teaching videos are excellent, they post a live trade video of EVERY trade they do, post all their current and past positions, have a good staffed chat room and you actually get legit trading discounts on Thinkorswim. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Iron Condors have been killing it for me. Check out this video from a really great program I've been taking.  If you are interested in seeing my current positions I would be happy to show you.  Basically 30-60 day positions, limited risk and profit, very high probability of profit.  Takes a bit of understanding, I'm def still learning, but I see this as my majority strategy moving forward.  You aren't buying into stock movement...instead you are selling time. I would be happy to further discuss \n\nhttps://youtu.be/Eg8IyTPoaQY", "score": 4, "replies": [{"body": "Found the guy selling iron condors to nubs.", "score": 4, "replies": []}, {"body": "I watched the video and it seems like a very interesting strategy--thanks for sharing! However, the actual reason I'm buying naked calls/puts is that I'm using RobinHood. They don't have support for multi-leg trades and they also don't recognize when there's limited potential loss on the sale of a contract.", "score": 3, "replies": []}]}]}, {"body": "Buy naked calls?  that isn't a thing?", "score": 5, "replies": []}, {"body": "or buying/selling premiums...?", "score": 1, "replies": []}, {"body": "This is a shit posting forum, I hope you weren't expecting good financial planning", "score": 1, "replies": [{"body": "I mean I suppose that's my way of just interjecting my recent growth with option spreads. Poor opening line heh. \nBut I don't see a ton of shit posts in here, seems more noob with some very helpful people. And I'm noob to options so perfect to me ", "score": 2, "replies": [{"body": "Helpful people LOL don't take these guys advice", "score": 0, "replies": [{"body": "I do my own research even after advice but compared to most subs I do see some good dudes pitchong in on basic questions that would get them slammed for asking elsewhere.  I appreciate the selfless answering of noob ass inquiries without insult ", "score": 1, "replies": []}]}]}]}]}, {"body": "Wait. You made 97% in a day on a 5% drop?\n\nWhat the fuck am I doing with boring old long positions?!?!?", "score": 29, "replies": [{"body": "IF THE PRICE OF A LONG IS THE SAME AS THE PRICE OF 5 FDs, THEN YOU SHOULD JUST PLACE FIVE FD TRADES AND REAP THE PROFITS\n\ncome at me bruh, you welcome\n\n* 5 FD trades at different weeks of course, im no degenerate gambler", "score": 23, "replies": [{"body": "As always the real investment advice is in the comments", "score": 5, "replies": []}]}]}, {"body": "Pixel 2??????", "score": 13, "replies": [{"body": "provide innate brave smart normal jeans aback wakeful fanatical different", "score": 8, "replies": [{"body": "petition to allow /u/christianburt to become the head of the WSB tech division", "score": 40, "replies": [{"body": "Where do I sign", "score": 5, "replies": [{"body": "Abort the plan. This guy is useless.", "score": 14, "replies": []}]}]}, {"body": "can tell by your home, back and windows button on the bottom. and top banner", "score": 11, "replies": []}, {"body": "I own one lol", "score": -1, "replies": []}]}]}, {"body": "Damn I just got a random email saying I can trade options on RH and only have $35 in my account. Time to get weird with it. ", "score": 13, "replies": [{"body": "Should be either $500+ or $0 by Friday. ", "score": 31, "replies": [{"body": "It just seems like shit is expensive to buy. Wish RH introduces like half contracts or something. ", "score": 11, "replies": [{"body": "hey it's me ur brother. Send me your half and I'll get us a full contract", "score": 9, "replies": []}, {"body": "Buy an AMD fd call, I got one for only 9 bucks lol", "score": 1, "replies": []}, {"body": "...", "score": 1, "replies": []}]}, {"body": "Lol totally. ", "score": 3, "replies": []}]}, {"body": "Thats crazy man, for such a low account. ", "score": 4, "replies": [{"body": "It might be that I had a lot more money in it before I sold all my stocks and took my $1k in gains. ", "score": 3, "replies": [{"body": "There you go! ", "score": 2, "replies": []}]}, {"body": "I've never had more than $100 in my RH and i got options 😕", "score": 2, "replies": [{"body": "Opps 😋😋", "score": 1, "replies": []}]}]}]}, {"body": "I ditched /r personalfinance for this online community. Thanks god I did", "score": 35, "replies": [{"body": "yeah now you can still do poorly and watch other people do well instead of just doing poorly and watching other people fail", "score": 40, "replies": [{"body": "Amen fellow investor ", "score": 5, "replies": []}]}, {"body": "Even it you suck, odds are you'll still beat the 1.5% from your Ally Savings Account", "score": 15, "replies": []}]}, {"body": "When I can trade options on RH, but have zero knowledge on options... this makes me want to learn ", "score": 10, "replies": []}, {"body": "this guy fucks", "score": 10, "replies": []}, {"body": "Where is low battery bot ? ", "score": 5, "replies": [{"body": "I think it only works for iPhone. This is a Pixel ", "score": 1, "replies": []}]}, {"body": "Posts on this sub are hilarious, but hilarious doesn't usually go hand in hand with good investment advice. OP *bought* short term options (combination of calls and puts) on different underlying assets. When you *buy* an option contract (either call or put), the underlying asset(s), in this case three (INTC, NVDA, and FB), **have** to go in the direction of your option contract. If they go sideways or the opposite direction you can lose your entire investment.\n\nOption contracts have a time factor to them (theta). Judging by the drastic increase in OP's portfolio in a single day, these contracts expire by the end of the week. The closer to expiration, the more closely OP's option contract values follow the move in the underlying asset, but also the quicker they lose value if the underlying asset(s) go against OP's position (hence the gamble). If the underlying assets went against OP's position, its likely he could have wiped out a large portion of his account in a very short time period.\n\nThe reason why the gains are so large is because a single contract represents 100 shares of the underlying, in this case a stock. So, the power (or danger) of options is leverage. You can buy one contract and get exposure to a move equivalent to 100 shares with far less margin or cash. At the same time, if that small amount of cash is your whole account, you can lose it all very quickly.\n\nIf he only bought one contract each for INTC, FB, and NVDA he gave himself exposure to 100 shares of each underlying. INTC, FB, and NVDA opened at $51, $170, and $241, respectively. That means he ***roughly*** got exposure to $5,100 + $17,000 + $24,100 = **46,200** dollars worth of stock with very little amount of money. This sounds attractive, but like I said it can be dangerous and is pretty much a gamble. Keep in mind OP roughly started off the day with $2,000 in his account.\n\nEverything I said above is in regards to *buying* options and is meant to be educational, not advice. It is the opposite when it comes to *selling*, which is what I personally prefer.", "score": 7, "replies": []}, {"body": "Can you sell the contracts now?", "score": 3, "replies": []}, {"body": "Meanwhile /r/amd_stock are asking God what they did wrong ", "score": 3, "replies": []}, {"body": "How do you trade options on Robinhood? ", "score": 3, "replies": [{"body": "You email them and say gimme option and they say ok", "score": 3, "replies": []}]}, {"body": "google pixel, my man", "score": 1, "replies": []}, {"body": "How do you add a “put” on Robinhood?", "score": 1, "replies": []}, {"body": "your bracket bust too huh", "score": 1, "replies": []}, {"body": "I love when WSB makes front page because people come in and are completely astounded by our processes. ", "score": 1, "replies": []}, {"body": "FB is probably a good long call position a few years out.  The stock will tank and Zuckerberg will step down as FB CEO (or be arrested in some European country) reorganize and come back harder than ever. ", "score": 1, "replies": []}, {"body": "What strike prices", "score": 1, "replies": []}, {"body": "Had similar gains with SQ calls and TWTR puts ", "score": 1, "replies": []}, {"body": "The fuck is options, brb learning", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "cats fretful forgetful impolite dam public consist thumb aware salt", "score": 0, "replies": []}]}, {"body": "50% of these people commenting couldn’t tell you what effect IV has on an options premium, more or less what Vega is.", "score": 0, "replies": []}]}
