{"title": "Elon Musk making “kid-sized submarine” to rescue teens in Thailand cave", "selftext": "Elon dodges jail via PR stunt, stranding \"Thai soccer team\" in cave, then rescuing them with submarine built in 8 hours. Everyone knows TSLA can't build anything in 8 hours, expect only 1/3 of promised sub to be delivered in a month. TSLA to the moon regardless. https://arstechnica.com/science/2018/07/elon-musk-making-kid-sized-submarine-to-rescue-teens-in-thailand-cave/", "id": "8wx5pc", "created_utc": 1531004621.0, "score": 157, "upvote_ratio": 0.91, "num_comments": 83, "comments": [{"body": "It's not really a submarine.  Just a pod that the scuba divers will carry to transfer them\n\nThe thread on /r/all, said \"kid-sized submarine\" has a better ring to it than \"kid-sized coffin\"", "score": 111, "replies": [{"body": "Yeah that's a better description. I'd worry about it fitting but I'm assuming they know the sizing. Honestly it's the best idea I've heard anyone suggest so far.", "score": 27, "replies": [{"body": "Sounds like every ex boy/girlfriend  I’ve ever had ...", "score": 8, "replies": []}]}, {"body": ">You know another really good business? Teeny tiny baby coffins. You can get 'em in frog green, fire engine red.", "score": 10, "replies": []}, {"body": "Hey maybe it will be both.", "score": 7, "replies": []}]}, {"body": "what's gonna happen if the sub completely fails with the kids inside and kills them?", "score": 43, "replies": [{"body": "My puts go up in value.", "score": 147, "replies": [{"body": "You bought puts on the kids? Where can I buy puts on the kids?", "score": 41, "replies": [{"body": "It could effect their soccer team in the future. You could try to short the venue ownership group. That’s all I can think of.", "score": 11, "replies": [{"body": "Quick buy calls in their rival team's favorite ice cream venue!", "score": 12, "replies": [{"body": "Nice.", "score": 2, "replies": []}]}]}, {"body": "The derivatives market isn't that mature yet, but I'm sure you can sell your kids and buy some new ones later when the price goes down.", "score": 3, "replies": []}, {"body": "buy puts on tsla", "score": 0, "replies": []}]}, {"body": "Oof.  ", "score": 3, "replies": []}, {"body": "With TSLA, they'd probably actually go to 0.", "score": 2, "replies": []}, {"body": "haha odds of Elon delivering on target carries same odds as $TSLA production numbers. \n\n", "score": 1, "replies": []}]}, {"body": "It looks like it's a one kid sub so hopefully it'll have a failure rate of less than one in 13. Even so, it might not matter 25 hours from now.", "score": 11, "replies": [{"body": "During the civil war the south built a couple of submarines that were some serious death traps. Hoping Elon pulls this off. ", "score": 5, "replies": [{"body": "Pretty sure the only one with casualties was the Hunley and I doubt that Elon plans to equip them with volatile explosives.", "score": 8, "replies": [{"body": "What if it's a Space-X sub?", "score": 2, "replies": [{"body": "It's made from one of their fuel tanks.", "score": 2, "replies": []}]}, {"body": "Rocket thrusters?", "score": 1, "replies": []}]}]}]}, {"body": "We mod the parents", "score": 1, "replies": [{"body": "Flair them as “Elon’s BagHolders”", "score": 1, "replies": []}]}]}, {"body": "To be rolled out on Q3 2018\n\nQ1 2019\n\nQ2 2020\n\nQ4 2020", "score": 25, "replies": []}, {"body": "My Calls are bleeding, please papa elon ", "score": 27, "replies": [{"body": "How the fuck are your Tsla calls bleeding when my puts are full on menstruating ", "score": 30, "replies": [{"body": "FD's would do that to you...", "score": 23, "replies": []}, {"body": "That's what happens when it goes sideways.", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 111, "replies": [{"body": "Who likes short shorts? ", "score": 31, "replies": [{"body": "We like sub subs", "score": 10, "replies": [{"body": "i'm more of a grinder kind of guy ", "score": 3, "replies": []}]}, {"body": "We love de subs. De subs are good for us. De quiznos subs", "score": 4, "replies": [{"body": "I love Quiznos but all their stores keep shutting down in my area. What the hell is going on with that? Quiznos must be hurting bad as a company.", "score": 6, "replies": [{"body": "I didn't realize their were any left.  Ever since subway was like \"lol we can put a toaster in our stores too\" it's been downhill", "score": 8, "replies": [{"body": "Subway cant make a good peppercorn steak sandwich though damnit lol ", "score": 6, "replies": [{"body": "Quiznos was good but I think when they decided to get into the $5 footlong war with subway they couldn't sustain it and their ingredients went downhill.  There were definitely five or six where I live at one point but now zero, and subway wants like 8.50 for some of their sandwiches now lol", "score": 4, "replies": []}]}]}, {"body": "Apparently they intentionally fuck over franchisees and make money off of them\n\nI don't have a source, it was from an ex franchisee on Reddit...iirc they force you to use their equipment and lease it out at a huge profit", "score": 4, "replies": [{"body": "Yeah. That would makes more sense. Every time I went to Quiznos it wasn't like I was the only one. They seemed somewhat busy every time I went. Stupid short sightedness greed must of ruined them.", "score": 3, "replies": []}]}]}]}]}, {"body": "In this sub? I'm surprised no one's opened a line on how many make it out.", "score": 32, "replies": []}, {"body": "If you mean Elon using the kids to stroke his own dick then sure.\n\n95% chance he does jack shit. 5% chance this actually happens AND someone dies. \n\nIf the world turns on him at least the kids' sacrifice won't be in vain.", "score": 26, "replies": [{"body": "How much did you lose in puts?", "score": 14, "replies": [{"body": "No position. Premiums are crazy. Last time I checked you make like 10x if Tesla drops 90% in two years.", "score": 5, "replies": []}]}, {"body": "If he wasn't helping the government rescuers would just tell him to GTFO. The guy has one company making rockets with capsules that can provide an astronaut with an air bubble in space and one company that specializes in boring tunnels through the ground that can be used to transfer people. He has every reason to be helping with this. ", "score": 1, "replies": []}]}, {"body": "If he actually does something, I won't hate. I hate on empty promises, which is all Elon delivers. ", "score": 12, "replies": [{"body": "What about the reusable rockets and selling cargo space to governments and businesses?", "score": 1, "replies": []}]}, {"body": "https://i.imgur.com/2J4ZIM7.jpg", "score": 7, "replies": []}, {"body": "You mean an obvious PR move? Tesla hasn't been having a good time recently.", "score": 6, "replies": []}, {"body": "YES FUCK THEM", "score": 2, "replies": []}, {"body": ">Rich people using their resources to do something good for a change\n\nBro, people get rich (most of the time) *because* they are doing something good.", "score": 1, "replies": []}]}, {"body": "This is ballsy as fuck. Imagine if the pod breaks and the kid dies. Or a diver gets stuck on it. Elon is sticking his neck out, again. That's why people love him. That's why you should never believe the fake news. Go get it Papa Musk.", "score": 45, "replies": [{"body": "I love me some ballsy Musk, but he’s also sticking his dick out too ....\n\n", "score": 12, "replies": []}, {"body": "honestly.\n\nReally though, not much in terms of other solutions.  They're fucked.  Oxygen dropping, it would be nothing short of a miracle IMO", "score": 7, "replies": []}, {"body": "i want that elongated muskrat to cum save me as well", "score": 6, "replies": []}, {"body": "He can't manufacture enough cars in time and he behaves like a teenage girl but you can't deny that his companies have always got the tech and he cares. Probably there are related.", "score": 5, "replies": [{"body": "> his companies have always got the tech\n\ndamn... sick", "score": 1, "replies": []}]}]}, {"body": "It’s a self driving sub. The sub malfunctions on the way back to the surface and all the kids die, Elon goes to jail and Tesla stock skyrockets.", "score": 18, "replies": []}, {"body": "He's going to get to the kids and ask them for another $2,500 deposit", "score": 10, "replies": [{"body": "Oxygen is DLC.", "score": 6, "replies": []}]}, {"body": "Whats with him and these absolutely crazy ideas", "score": 12, "replies": [{"body": "When you literally have \"why not\" money and if you still retain a shred of human decency, why would you not try?", "score": 31, "replies": [{"body": "At least try something more practical first", "score": -13, "replies": [{"body": "They can't drill to them in time, oxygen is running out, the high water marks in the cave indicate that it can rise much higher, it's starting to rain again, and the kids can't even swim much less do a cave dive that's challenging to experienced experts. Crazy or stupid are rapidly becoming the only options available.", "score": 15, "replies": []}]}]}, {"body": "This is what happens when you're crazy rich and have no one to tell you \"no.\" ", "score": 22, "replies": [{"body": "Cooler than buying diamonds or women", "score": 22, "replies": [{"body": "Whats the point in buying diamonds if you can just buy women?", "score": 15, "replies": []}]}]}]}, {"body": "Next Tesla feature will be submarine mode. Long TSLA.", "score": 3, "replies": []}, {"body": "First 2 kids rescued according to Reuters", "score": 3, "replies": [{"body": "Not by Elon’s mini subs though.. just sharing some news", "score": 4, "replies": []}]}, {"body": "Fugggg I don’t want to root for Elon", "score": 12, "replies": [{"body": "But we're all fans of Thai boys here, amirite?", "score": 52, "replies": [{"body": "Just put \"lady\" in front of \"boys\".", "score": 12, "replies": [{"body": "I don't think that's necessary here. We are men of action. Lies do not become us. ", "score": 14, "replies": [{"body": "Well spoken sir.\n\nI don't know that it makes sense in this conversation but well spoken.", "score": 6, "replies": []}]}]}]}]}, {"body": "https://www.cnn.com/2018/07/07/asia/thai-cave-spirits-intl/index.html\n\nStorm clouds threatening them too. Trump and trade war are not the problem. It is them fucking storm clouds. We need to do something before it spirals out of control.", "score": 2, "replies": []}, {"body": "He's too late.. they've started the operation to get them out.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "What are you doing to help?", "score": 7, "replies": []}, {"body": "And you?", "score": -2, "replies": []}, {"body": "Sorry dude, life's a bitch", "score": -2, "replies": []}]}, {"body": "Asia is going to figure their shit out, get the kids rescued and be like \"fuck off, American\".", "score": -3, "replies": []}, {"body": "There's alot of fanboys. ", "score": 0, "replies": []}]}
