{"title": "Long $SPOT DD inside", "selftext": "[deleted]", "id": "90p7wj", "created_utc": 1532179039.0, "score": 87, "upvote_ratio": 0.93, "num_comments": 77, "comments": [{"body": "Excellent research. Nice data set!", "score": 88, "replies": [{"body": "Too large a sample size imo", "score": 66, "replies": [{"body": "Came here to basically say this.", "score": 6, "replies": [{"body": "This.", "score": 3, "replies": []}]}]}]}, {"body": "Opening a position Monday. Will post proof ", "score": 49, "replies": [{"body": "Same, but I will not post proof because it's a terrible idea to tell people on the internet how much money you have.", "score": 1, "replies": []}, {"body": "\\*high five\\*", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "I never said weeklies. I’m not full autistic. I’m going Jan 2019 ", "score": 11, "replies": []}, {"body": "Spotify has been my best experience with a music app. The discovery playlist introduces you to new music that you would actually like. I tried Pandora again when my paid membership for Spotify expired, it's hot trash in comparison.", "score": 2, "replies": [{"body": "Plus it integrates with the google home mini, Alexa, etc.  I don't even look at the app anymore, I just yell \"ok google, play some zeppelin\" and Black Dog starts coming out of my sound system.  The future is now.", "score": 1, "replies": []}]}, {"body": "Has Spotify even attempted to compete against the record labels?", "score": 1, "replies": []}]}, {"body": "OP, the super scientific DD you need is something around how your friends' sentiment has changed, or who signed up for which services lately and why. If you've got 10 iPhone using friends who all signed up for Spotify in the last 3 months, that's 20K YOLO material.", "score": 18, "replies": []}, {"body": "Fuck if only I just bought everything I used instead of Chinese meme stocks I would have been fine a year ago. Amazon, msft, nvda, spot, mu, and Netflix. Literally all the clues in front of me. ", "score": 16, "replies": [{"body": "This is the best piece of advice you will ever, ever get (or in this case, you’ve given t to yourself!). Buy stocks of products you’re starting to use. Or have increased using. And sell those that you don’t use or visit, or like anymore. That way you catch all consumer trends.", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Stuff you're using more than you used to and stuff you're almost completely dependent on is a better proxy. Works with COST and V/MA, and they're not tech", "score": 2, "replies": [{"body": "Lots of retail has made a comeback this year and been a great investment. Ralph Lauren and Abercrombie who I both thought were old and dead have surged massively as people start wearing that shit again. So this is valid for stuff that you come back to as well, as you say “using more than you used to” is the key.", "score": 1, "replies": []}]}]}, {"body": "What if you’re a hipsterfag?", "score": 1, "replies": [{"body": "Hipsters lead trends. Beard oil anyone? Avocados to everything? Didn’t exist a few years ago. ", "score": 1, "replies": []}]}]}, {"body": "I've been feeling this for a while and still haven't changed my ways.  Looking at my life now to see what I should trade... is there an ETF for bull terrier breeders?", "score": 2, "replies": []}]}, {"body": "this is legit. most people cling to their biases but you remained clear and objective in your research. ", "score": 13, "replies": []}, {"body": "Spotify has a 40% conversion rate from free to paid sub. They have almost 100 million free subs, 75 million paid.\nYear on year growth and revenues are similar to Netflix in 2014. Netflix stock price has grown 7 times since then. Spot is gearing up for biiig run. They're also opening concert tours, direct partnerships with artists and getting better at monetizing those free users.\n\nSpot makes me hard. ", "score": 12, "replies": [{"body": "Costs are naturally higher than revenue tho. As it's revenue has grown, it's losses have equally grown", "score": 1, "replies": [{"body": "During the growth cycle the market cares very little about earnings, the revenue stream, market share, and customer base is what's important.\n\nFor example look at AMZN between years 2009 to 2014 where they were reinvesting in themselves heavily, or companies like $CVNA where they're burning cash up the ass and investors lapping that shit up.\n\nNow if they reach a certain size and can't convert to earnings then you get a massive bubble pop", "score": 1, "replies": [{"body": "tell that to JD", "score": 1, "replies": []}]}]}]}, {"body": "Add me to data. 26 year old male, been premium member for 2 years now. ", "score": 12, "replies": [{"body": "Same. 24 and have always paid for it.", "score": 3, "replies": []}]}, {"body": "If you want your bias confirmed even more, watch [this video](https://youtu.be/aqvOigmFccc) where Scott Galloway predicts Spotify to be the 5th Horseman (along with the FANG stocks). He predicted AMZN would be the first $1 Trillion company in 2015 so this guy definitely knows his shit.", "score": 10, "replies": [{"body": "all in amazon er Bay BEE", "score": 3, "replies": [{"body": "My portfolio has been 50% cash and 50% AMZN ever since early April.\n\nI’m so scared.", "score": 4, "replies": [{"body": "Love this. Half risk aversion cowardice and half YOLO meme stock that defies normal valuation. I don't think you even know who you are anymore.", "score": 5, "replies": [{"body": "Once Amazon hits that awe-inspiring $2000 mark (and consequently a $1 Trillion Market Cap) I’m selling and taking a break from the market until the mania is over and the market reverts back to the mean. I was a lot more diversified earlier in the year and last year but after several months of selling, all that’s left are my BezosBux. \n\nI’m sure I’ll miss out on some gains but I can wait for a year or two.", "score": 2, "replies": []}]}]}]}]}, {"body": "haha. I remember when all of WSB was ready to shorts SPOT on IPO day lol", "score": 8, "replies": []}, {"body": "I remember some students at Columbia Business School did a presentation to short sell Spotify because it has costs that increase along with an increase in new customers due to the pay per stream model to pay artists. They also said since other services like Amazon prime offer shows and movies on top of music that spotify wont be able to compete. Take it with a grain of salt though since I'm a spotify premium user myself.", "score": 5, "replies": [{"body": "They dum.\n\nAmazon charges a price comparable to Spotify for full catalog. The freebie music is limited.\n\nNow if they just threw full access into Prime, yeah, that would blow everyone else up. But it would also cost Amazon a fuckton to do that without jacking up the price of Prime again.", "score": 1, "replies": []}]}, {"body": "SPOT is the only subscription worth a damn in my life currently.  that and my ps4\n\nif AMD gibs free money this week i’ll take a core position in SPOT", "score": 6, "replies": [{"body": "Have you tried YouTube premium?  Blows spotify out of the water.  Rare films, full albums from all other the world that never made it to the US, live concerts, music videos the day they come out, I could keep going for days.  I cancelled my spotify subscription a while ago, now the thought of it puts a bad taste in my mouth.  Like cheap wine.", "score": 3, "replies": [{"body": "with youtube aren’t you streaming video, aka an ass ton more data?  i love youtube too but wouldn’t spend money on it to stream video in my car", "score": 1, "replies": [{"body": "Nah, they have a button to turn the video off and you can download anything to your phone and there's a second app called youtube music that just focuses on the music.  It's fuckin incredible.  I've had them all (i think) and i only currently subscribe to youtube, netflix, amazonprime, and soundcloud (this is because I produce music and love what the platform has done for us little guys in the industry).\n\nEDIT:  Also, no advertising once you go premium", "score": 2, "replies": [{"body": "Do you know if there's anyway to check what is available on YouTube Music?\n\nI listen to artists who are independent and some even under 100K views for their music content and covers. Would I be able to access that (turning off video) and/or download for offline use? ", "score": 1, "replies": []}]}]}, {"body": "99.99% of YouTube users don’t pay for shit.\n\nAnd like 99.98% has Adblock when watching/listening YouTube.\n\n", "score": 0, "replies": [{"body": ">And like 99.98% has Adblock when watching/listening YouTube.\n\nyou highly overestimate the technological competence of people", "score": 4, "replies": []}, {"body": "It's more than just adblocking, its about being able to download hard to find music/video/history/lessons/ANYTHING and have it with you anywhere in the world in your pocket.  Full albums without skips in between the songs (the pauses/clicks/whatever).  But I'm not telling you this for a market play, just letting people know what program I've been enjoying.", "score": 1, "replies": [{"body": "Well 99.99% of download from YouTube are made thru 3rd party site or software for free..", "score": 1, "replies": [{"body": "Easily on a safe app on my phone while i'm driving?  I don't live on my computer, I'm out in the world.  I don't think you are seeing the use cases for most people.  Also, if someone is putting a free app out to steal from youtube, it's probably to collect data for malicious purposes or up to its dick in advertising (Audiomack for example, which i still use on my computer now and then to see what's trending).  Google is already collecting everyone's data for the birdwatchers anyway so I can't imagine that giving them a little more room on my phone would change anything.  However, I'm not gonna put some rando's 3rd party app on my phone to save 10 dollars a month.\n\nEDIT: \"up to it's dick\" to \"up to its dick\"", "score": 3, "replies": []}]}]}]}]}]}, {"body": "... in order for this type of DD to work you need to ask about if their usage has increased or decreased over a period of time ... not just if they have the service (that tells you nothing)", "score": 7, "replies": [{"body": "Increased. Everyone says they “love it” and use it “all the time” and all music they listen too is from Spotify\n. Didn’t ask specific questions really but I’ll take that into consideration. ", "score": 3, "replies": []}]}, {"body": "Honestly I love Spotify and yeah the numbers look good? But didn't the numbers look good with their first earnings, but they missed EPS big time and ended up down 11% the week of their earnings", "score": 2, "replies": [{"body": "Look at NFLX. With these subscriber tech services EPS doesn't matter much. It's all about growth potential.", "score": 1, "replies": [{"body": "Ya but NFLX crashed after earnings, so therefore Spotify will follow according to you. This is the real DD Spotify = Netflix", "score": 1, "replies": [{"body": "I didn't say that at all. I said EPS doesn't matter. NFLX crashed because their subscriber numbers didn't meet expectations. They beat EPS projections. \n\nSo yes, if Spotify doesn't add enough subscriptions it will drop. If it has strong subscriber growth, I think it will go up - regardless of EPS.\n\n", "score": 1, "replies": []}]}]}]}, {"body": "UPDATE: I have incorporated flurbars analysis questions. I have asked another 20 *random* people throughout my day. All 5 women employees in lululemon use Spotify and they all use premium and say they use it everyday. Car, workout, on their break etc. I have asked 15 other random people on the strip where people brunch aswell. The answers are basically the same. I’m now kind buzzed/drunk again and spent a stack at lululemon, I’ll continue asking. The bartender with large tutors here uses Spotify. Let’s ride", "score": 2, "replies": []}, {"body": "Honestly, all music services are the same to me. As opposed to Netflix, they all provide you with access to pretty much the same database. People chose whatever they started with. ", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Alright hear me out. Google Play is better than Spotify in every regard. Bigger library (wider breadth of artists and deeper depths for any artist in their catalogue), better discovery tools and playlist creation, and its cheaper. You get 3 automatically with a 9.99 sub. ", "score": 2, "replies": [{"body": "Plus free YouTube Red with your Google Play Music subscription. There really is no beating it.", "score": 1, "replies": []}, {"body": "I've used both, library isn't really better, playlists for discovery on Spotify kicks GPM's ass, and you don't get 3 users for 10 bucks. You did used to get adfree YouTube which was an advantage, but they didn't market that and have changed their policy so Spotify is much better. ", "score": 1, "replies": []}, {"body": "The app sucks compared to Spotify though. ", "score": 1, "replies": []}]}, {"body": "Really?  Scroll up to my comments on Youtube premium and youtube music.  Spotify is garbage compared to paid youtube.", "score": 1, "replies": []}]}, {"body": "They are not, where Spotify differs is in discovery. They make it so easy to find new music that you love. I have very hard tried to switch to Apple as I’m an Apple shareholder, but just can’t do it as I find it useless, it just doesn’t help me find new music.", "score": 1, "replies": [{"body": "It’s not like Apple is the only player out there. Pandora or SiriusXM can do discovery just fine. ", "score": -1, "replies": [{"body": "I think my dad has those. Is that called radio?", "score": 4, "replies": []}]}]}]}, {"body": "Well you convinced me to go a little smaller in my put buy. ", "score": 2, "replies": []}, {"body": "Not to mention they give nice deals to university students. I’m pretty sure everyone I know has it.", "score": 1, "replies": []}, {"body": "I have Spotify premium, and I honestly really like it. Being able to download your playlists for offline listening is really nice, especially to save on data or if your work place doesn't have good reception/wifi.", "score": 1, "replies": []}, {"body": "No, this advice is valid for retail, food, cars... anything consumers buy... or new software or products at work (forklifts, power generators, building materials etc). Whenever someone switches to a new product, that’s the time to buy shares. As they will not be the only ones switching.", "score": 1, "replies": []}, {"body": "I totally called this two days ago. Gonna be huge. Tendies for life.", "score": 1, "replies": []}, {"body": "SPOT reports earnings on the 26th. It will be their second ER ever, 2018 Q1 was their first and it was a flop.\n\nThat said, looks like we have some top-notch DD here boys so open a position ASAP.", "score": 1, "replies": []}, {"body": "solid dd", "score": 1, "replies": []}, {"body": "Spotify option premiums are insane was gonna get in on some puts, but the option premiums now weren’t worth it at all absolutely insane price. ", "score": 1, "replies": []}, {"body": "I use Google play music, what do you think about that shit- checkmate", "score": 1, "replies": []}, {"body": "You've marked this submission as DD. This better be something useful that might help someone make a good trade. Otherwise you should re-flair this to Discussion or Shitpost before you get banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Count me as \"canceled years ago for Google music\"", "score": 1, "replies": []}, {"body": "I don't use Spotify, I listen to all of my music through YouTube Red. Because I'm a YouTube fucking addict and have been for a decade, and there's lots of independent mixes and early release songs not out on other platforms. \n\nSo long $GOOGL ", "score": 0, "replies": []}]}
