{"title": "Futures testing key 2150. Oil continuing downward. Vix trending up. Tomorrow could be the day, and if it's not...", "selftext": "[deleted]", "id": "4vxaoa", "created_utc": 1470208936.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 11, "comments": [{"body": "What's a good Armageddon play? Asking for a friend.", "score": 4, "replies": [{"body": "$UVXY", "score": 5, "replies": [{"body": "Hold this goldmine for at least a year", "score": 3, "replies": [{"body": "Can't lose!!", "score": 2, "replies": []}]}]}, {"body": "Buy the dip", "score": 2, "replies": []}]}, {"body": "$TZA", "score": 4, "replies": []}, {"body": "http://blog.stocktwits.com/predicting-stock-market-crashes-and-financial-panics-is-really-hard/\n\nbecause I know WSB users have half developed brains and low IQs, just look at the picture on that page.", "score": 1, "replies": [{"body": "Yea. I agree it's difficult to find the top. But if you look for the right conditions and buy spy puts or UVXY calls 6month+ ahead using the martingale system. \n\nIf you start after 5+ years from the previous crash, you should be profitable. ", "score": 1, "replies": [{"body": "I personally agree, just saying to be cautious. Hell I wish I had a couple thousand to set aside for late out SPY puts, unfortunately, that's not the case though", "score": 1, "replies": [{"body": "Yea I hate this weekly YOLO nonsense. But then again the one guy who actually guesses correctly is gonna be set for the foreseeable future. ", "score": 2, "replies": []}]}]}]}, {"body": "So wat do?", "score": 0, "replies": []}]}
{"title": "JNUG", "selftext": "[deleted]", "id": "4vymkd", "created_utc": 1470232927.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 10, "comments": [{"body": "Alright listen here, poopstain.  JNUG follows the junior gold miners index, not specifically gold like most dumbasses think.  Read up on the miners index to get a better idea of what's going on there.  JNUG for bull, JDST for bear. It's also a daily reset, so don't hold this shit for extended periods of time unless you like getting fucked in the ass.  ", "score": 12, "replies": [{"body": "^This. Go on stocktwits and you see clowns on there talking about doubling down or bagholding shit 3x etfs. Just play the swings clown.", "score": 3, "replies": []}]}, {"body": "Day traders saw it hit the same peak it stopped at 3 times this month.  We took our profits and ran.", "score": 5, "replies": [{"body": "That'll do it.  I want to play the ATVI earnings and was going to sell my shares this morning after open to fund it but don't want to pull out now with my current losses.  Can never win lol", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I pulled out and accepted it, hope to buy Back in after I take advantage of ATVI tomorrow assuming it hasn't rebounded yet ", "score": 2, "replies": [{"body": "> assuming it hasn't rebounded yet\n\nyea right, because this is the last time it will rebound. \n\nwhat if i told you i witnessed this exact same reaction to gold 3 months ago", "score": 1, "replies": [{"body": "So what do you suggest I do then?  Go fuck myself? ", "score": 1, "replies": [{"body": "Spot on succboi", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Dollar strength ", "score": 3, "replies": []}, {"body": "The action on JNUG/NUGT is really volatile. Opening up/down 10-15% is relatively common, especially when there is news. Stay woke my friend", "score": 2, "replies": []}]}
{"title": "How to play TSLA market reaction?", "selftext": "What is a good strategy to profit on the market reaction to TSLA earnings? I have no clue at all where it will end up tomorrow, but I expect a lot of volatility. I do not have any open position at the moment.\n\nAny good ideas?\n\nEdit: [IV for today's earnings is lower than any other earnings release for Tesla Motors Inc. (NASDAQ:TSLA) over the last two-years. \n](http://news.cmlviz.com/2016/08/03/tesla-motors-inc--nasdaq-tsla-earnings-risk-is-stunning.html)", "id": "4vz7sg", "created_utc": 1470239993.0, "score": 1, "upvote_ratio": 0.66, "num_comments": 11, "comments": [{"body": "One thing you know, no matter what the numbers look like, Musk will promise shareholders the world.", "score": 9, "replies": [{"body": "and they will take it and run with it ", "score": 4, "replies": []}]}, {"body": "Wait until after earnings and if it drops go long for the inevitable rebound.", "score": 6, "replies": []}, {"body": "Buy some cheap puts. With the slight slide in the markets this past week I'm sure people will people will overreact to bad news and be cautious to positive.", "score": 2, "replies": []}, {"body": "I was considering setting a limit buy order at a stupid low price like $140 just to see what will happen", "score": 1, "replies": [{"body": "Not gonna hit 140. Try higher. It will still catch it after the fall ", "score": 1, "replies": [{"body": "how likely is it to get fills on the crazy after hours prices, like googl had last week?", "score": 1, "replies": [{"body": "I don't think the limit order will fill in. Afterhrs trading unless you specifically tell it to", "score": 2, "replies": []}]}]}, {"body": "There's no way you get a fill at 140 but it's a good idea. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I'm worried that it will have an after hours seizure then open with no change. I don't think there could possibly be a big surprise in the ER, we know they are losing money, aggressively expanding, etc.", "score": 1, "replies": []}, {"body": "see the link I added above ", "score": 1, "replies": []}]}]}
