{"title": "What are the various ways to play the VIX?", "selftext": "With the decrease in volatility and the possibility of a September rate hike, I'd like to hedge part of my portfolio by betting for volatility. What's your favorite way to do this?", "id": "5030t7", "created_utc": 1472440777.0, "score": 19, "upvote_ratio": 0.85, "num_comments": 11, "comments": [{"body": "\"If you have to ask you can't afford it\" in all of my life experiences, really only applies to the VIX. \n\nThat being said, you can use ETFs on the VIX to try this, but I don't recommend it, because of decay. \n\nAnother option (literally) could be to buy call options on the $VIX, I believe they have them, and if they don't you could do an option strategy on $SPX. ", "score": 5, "replies": [{"body": "Yeah, maybe like a $VIX call spread or $SPX straddle could work.", "score": 1, "replies": []}]}, {"body": "There's a lot of talk about VIX.  It is not a simple underlying to trade.  The VIX itself isn't a stock, it's an index.  The pure ways to trade it are through it's options or futures.  There are a growing number of ETF's that track it in various ways.  I don't mess with it at all myself.", "score": 3, "replies": []}, {"body": "http://finance.yahoo.com/quote/VXX/?p=VXX", "score": 1, "replies": []}, {"body": "Not only will rates not be hiked in Sept, but the vix is the worst possible play out there (at least in my opinion). The risk to reward is not worth it.", "score": 1, "replies": [{"body": "why?", "score": 1, "replies": [{"body": "Unless you trade it with an ETF, then you're stuck with options. With options means your trade is going to expire. You're chances of it moving far enough in the direction you need to overcome the premium costs are historically not very viable. ", "score": 1, "replies": [{"body": "Is the premium higher than for regular options?", "score": 1, "replies": [{"body": "Premium is going to be similar to others, but instead of fundamentals of the general economy or a companies individual sales, you're trading volatility with the VIX. So for example, in the case of raising interest rates you're probably expecting it to go down. But aside from one line in Yellen's speech she made no other indication of raising rates in Sept. Matter of fact she almost sounded more dovish in the rest of her speech. So you're basically playing a game with trying to guess what the fed will say or do, and historically (at least with Yellen), she is doing as little as she can to rock the boat. Most of it is lip service, yet you're trying to purchase an option, that requires big enough moves for you to overcome premium, that are almost all based upon the lip service of the fed (possible, but too much risk for the reward).", "score": 1, "replies": []}]}]}]}]}, {"body": "$VIX jumped 2.31 (20.37%) last week and moved above its 20dMA.", "score": 1, "replies": []}, {"body": "Buy vix?", "score": -1, "replies": []}]}
{"title": "Thoughts on Dominos? (DPZ)", "selftext": "I'm a big marketing guy so I understand what they did. With the new recipe, the Pizza Turnaround strategy, new menu, etc. \n\nI also understand that their tech is top notch. The app, amazon echo, Ford Sync, Emoji, etc. \n\n Is it ever going to stop going up and up and up? Or maybe a better question, do you think Papa Johns has a shot in getting to that level?", "id": "506arj", "created_utc": 1472493115.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 13, "comments": [{"body": "I think their website will be a massive reason they continue to do well. ", "score": 3, "replies": []}, {"body": "Spreaded comps for them. They have way more stores out there than competitors. The PE last time I check was way above industry avg and reaching a mature company no more growth story here", "score": 1, "replies": []}, {"body": "Too expensive right now, even though they're really massive and constantly expanding, would wait for a drop.", "score": 1, "replies": []}, {"body": " Potential for another new high breakout. imo", "score": 1, "replies": []}, {"body": "This would be my retirement. If you get a stock like this then short term trading doesnt make sense.", "score": 1, "replies": []}, {"body": "Good long term investment", "score": 1, "replies": []}, {"body": "My wife and I ordered pizza and wings last week from Dominos, haven't had it in years. It is absolutely disgusting. The size of the order of wings was a joke. I have no idea why people buy Dominos, it is literally the worst pizza I've ever eaten. It may be slightly cheaper than your avg. pizzeria, but eating dirt is free if price is the determining factor.", "score": 0, "replies": [{"body": "Pizza hut is at least 10x worse", "score": 0, "replies": [{"body": "I'm not sure if you mean as far as owning stock goes or their pizza. I assume you mean pizza. Different strokes for different folks I guess, to me Pizza Hut is decent and they have some OK sides and apps. Dominos is absolute filth. None of the franchise quick pizza places are that good to me. Neighborhood pizza > ANY of the franchises whether it be Dominos, Pizza Hut or Papa John's", "score": 0, "replies": [{"body": "Huh, to each his own. I think Pizza Hut is miles behind Dominos and Papa Johns and I don't really even like those places. Nothing compares to a good actual pizzeria", "score": 1, "replies": [{"body": "I think it's a matter of time before all Pizza Huts go out of business. I think there is one within 15 miles of my house and I am in Northern NJ, where virtually all franchises are only a few miles a part. \n\nWhen was the last time you saw an updated Pizza Hut? The few remaining look like dives. I haven't been in one in over 7 years probably, but even the parking lots look like they've never heard of a landscaper. More weeds/grass than my backyard.", "score": 2, "replies": []}]}]}]}]}, {"body": "Every single commercial they make these past few years is them telling the consumer they used to make crappy pizza because of  ____ reason... \n\nBeing complacent with offering shit for decades, and then only changing after market share erodes from competitors doesn't make me want to run out and buy their new offerings.\n\nSo as a business guy with only a small serving of marketing in me, I don't understand what they did except reinforce to customers all the reasons why they are known as a shitty pizza place to avoid.", "score": -2, "replies": [{"body": "You forget that it is cheap and highly accessible and in every piece of tech out there", "score": 1, "replies": []}]}]}
{"title": "Bought NVDA calls for 5000, sold next day for 14,590 their ending value was 41,000", "selftext": "[deleted]", "id": "502trr", "created_utc": 1472437878.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 14, "comments": [{"body": "NVDA was over 47 before june 3.  I did buy more calls a week later and sold them about a week after that again.  I had just lost a shiteload on disney calls (ended up losing 100% on those) so i was wanting to lock in my gains at the time but ended up missing out on massive gains. I actually had earlier expiration NVDA calls I probably would have profitted more from but, that disney fuck up got me paranoid. Biggest realized gain so far was AMAT calls I held through last 2 earnings statements at 704%, I sold half at 220% and half again at 350% on those though.  I also predicted 3 months ago that NVDA would be over 60 by september but i pussied out on holding calls on them after it got up past 45$ a share.", "score": 3, "replies": [{"body": "Rekt", "score": 1, "replies": []}]}, {"body": "I was debating between NVDA and AMD calls for Jan.", "score": 2, "replies": []}, {"body": "One day I'll have both the balls and the financial security to bet on options through earnings.\n\nUntil then, the sky is the limit partner", "score": 2, "replies": [{"body": "The truth is I used these gains to buy calls on Home depot and hormel the next week and lost 100% on those because I got greedy and wanted to just make 300% a day but that ruined my shite.  Then brexit happened and i got fuked even worse  I had BAC calls too since i was expecting a rate rise.  .  After brexit my BAC calls were down 65% so i bought some more longer expiration options.  Now all these BAC calls are way up.  I stopped buying short expiration options after my HD and hormel losses.  ", "score": 2, "replies": [{"body": "And that's why I stick to daytrading options :P", "score": 1, "replies": [{"body": "I may hold these BAC calls for a year , depending on what happens. ", "score": 1, "replies": [{"body": "I'd be willing to bet my entire $13k portfolio that you must be older than 20. Us millennials would never have the patience to do such a thing", "score": 2, "replies": []}]}]}]}]}, {"body": "dont be mad at profits. lesson learned, trim more next time.", "score": 2, "replies": []}, {"body": "what expiration / strike price do you go for usually?", "score": 2, "replies": [{"body": "For BAC i bought january 2018 calls that were about 20% out of the money at the time of purchase.", "score": 1, "replies": [{"body": "why 2018 so long, not just 1 year or less etc? if price stays the same in a year, you would lose most of your money", "score": 1, "replies": [{"body": "Because they were barely more expensive than january 2017's , so I decided it would be a good idea since I would lose less time value over the near future if they dont raise rates along with a year more time for BAC to go up.  Im up 123% on these allready and the trade was extremely safe compared to my prior trades.", "score": 2, "replies": []}]}]}]}]}
{"title": "AAPL Discussion Thread", "selftext": "[deleted]", "id": "50516q", "created_utc": 1472477805.0, "score": 9, "upvote_ratio": 0.77, "num_comments": 17, "comments": [{"body": "apple died when steve jobs did. also tim cook is a certified faggot, like actually gay.", "score": 35, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Your post has been automatically removed because  https://www.youtube.com/watch?v=P9cObozvAQ0\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Well I happen to have a huge hard on for Timmy", "score": 1, "replies": []}]}, {"body": "Anyone who means anything views Tim Cook as a good CEO. The company is relatively cheap on a EV/ebitda basis and that many smart people with such a huge cash pile for R&D will inevitably lead to further innovation. Anyone who says otherwise is being foolish (\"Tim cook isn't Steve jobs, aapl is going bankrupt\" and the like). One thing I don't like about aapl is that the huge cash pile hinders ROE since cash yields a very low return relative to aapl's actual business. ", "score": 8, "replies": []}, {"body": "Initially I thought that there might be a run up to the release.  Hype might build it up.  So I bought some calls, which are currently getting destroyed.  I was going to sell before the actual release.  At this point I'm hoping that expectations are low and the actual release will salvage something out of my calls.  In conclusion I have no fucking idea.  For the record I have five Sept 19 $110 calls with a cost basis of $1.96.  At this point I'm factoring it as part of my education.", "score": 3, "replies": [{"body": "same, Ive pretty much written off my sept 2 $108 calls", "score": 2, "replies": []}, {"body": "Announcement of the phone isn't going to do much. I'd wait until the holiday season is in swing to start betting. ", "score": 1, "replies": []}]}, {"body": "They are getting rid of the headphone jack on the next iphone. Terrible move imo.", "score": 3, "replies": [{"body": "I think people are blowing this out of proportion.  \n\n1. I wouldn't be surprised if it does have a headphone jack\n2. Apple has always included headphones with the iPhone so if they include Bluetooth or some other type of headphones it will be fine.  In fact it might actually get people to make the switch to Bluetooth headphones.", "score": 5, "replies": [{"body": "Apple has made moves like that 50 times. Remember when everyone lost their shit over the macbook air not having a CD drive?\n\nApple does what it wants, everyone adjusts.", "score": 5, "replies": []}]}]}, {"body": "Always over", "score": 2, "replies": []}, {"body": "Tech companies need new innovation to continue being competitive.  Even though they can just shit out iphones and make money, this isn't going to last. Unless they come up with some serious innovations I see declining sales. There's no way in hell this shit reaches 130 again unless something unexpected comes up. ", "score": 1, "replies": [{"body": "Self driving cars is something they are rumored to be working on. That could change the equation drastically. ", "score": 3, "replies": [{"body": "They are reportedly no longer working on their own car, being so far behind in the race. Software is now the goal apparently but I'm a little skeptical seeing how well their maps app performs.", "score": 3, "replies": []}]}]}, {"body": "For a short-term position: It is undervalued.\n\nFor a long-term position: It is overvalued.\n\n------\n\nIt will definitely go up 10-20% within the next quarter or so due to the iPhone 7 (I believe the iPhone 7 will have a huge turnout), at least 5%. So for a short term position, buy.\n\nNow for the long-term. Don't  get even close to it if you're planning on holding. Nope Nope Nope. If they don't change  some big names, they are definitely fucked. (80% Drop fucked) on the long run.\n\nI wouldn't say \"Short it\" because if they actually do something, remove Tim Cook, get better designers, etc, they should go up, and dominate the market again.\n\n-------\n\nTL;DR: Buy now, sell on earnings after the iPhone 7. Don't short it long term because their problems are very easy to fix, and once they close in on said problems, they're dominating the market. If they close in on these problems. Don't long it either. Just do a short-term play for next earnings/iPhone 7.", "score": 1, "replies": [{"body": "I'd argue the reverse", "score": 3, "replies": []}]}]}
{"title": "Who's riding the TSLA train with me?", "selftext": "", "id": "5063ai", "created_utc": 1472490796.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 10, "comments": [{"body": "I have no DD for this, but I don't think you can ever really DD TSLA.  That shit just pops up like a toaster strudel.", "score": 4, "replies": []}, {"body": "MEEEEEE", "score": 2, "replies": []}, {"body": "What makes you think it's going up?", "score": 1, "replies": [{"body": "Just got a feeling.", "score": 9, "replies": [{"body": "You belong here.", "score": 10, "replies": [{"body": "Honestly, I've been doing a little bit of trading based off of my personal belief that markets are actually irrational and basic technical analysis, over time, yields supra-market results.  So far I've been able to make some money off oil doing this and only recently started trading stocks with options with the same idea.  But that isn't as funny, so I just went with the truthiness of it.", "score": 1, "replies": [{"body": "Few stocks are as irrational as TSLA so you are in the right path. All you need is elon musk to fart and tweet about it. The markets will think he is making a new energy source from his farts and this thing till go up by 5%, them drop 6%, then 10% up since people buy the dip.", "score": 2, "replies": [{"body": "Yeah, basically my thinking.  Who knows, I just needed something to distract myself and watching a ticker is good for that.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Go Yolo with Jan 19 '18 calls. Model 3 deliveries will be in full swing by then.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "If you could get Musk to tweet that, that'd be great ;)", "score": 2, "replies": []}]}]}
{"title": "AAPL announces event set for Sep. 7th. Get your calls ready followed by puts.", "selftext": "[deleted]", "id": "5067jp", "created_utc": 1472492108.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 11, "comments": [{"body": "Thanks for the heads up.\n\nJust dropped 2k on calls\n\nEdit : I'm already down like $250. I managed to buy calls at today's peak around 107.30 -_- buy high sell low am i right ", "score": 11, "replies": [{"body": "which expiry and strike did u pick?", "score": 1, "replies": [{"body": "Sept 16, 104 C", "score": 1, "replies": [{"body": "why did u pick ITM and not OTM? ", "score": 1, "replies": [{"body": "I generally prefer ITM as its done me well in the past. However I'm no options expert. What are the benefits of choosing OTM instead of ITM for this situation? (Serious)", "score": 1, "replies": [{"body": "ITM is safer.  OTM pays better.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Does AAPL usually run up before their events?", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I plan to buy the new iPhone. Mostly because I want the better camera that will come with it. Otherwise I would have just kept my SE. ", "score": 1, "replies": []}, {"body": "Pretty sure that info has already leaked. \n\nMarket has already realized iPhones sales have matured and growth will be minimal going forward. Look for a focus on maintaining market share and an increase in sale of services i.e. Apple Music subscriptions and App Store dominance.\n\n", "score": 1, "replies": []}]}]}, {"body": "It's a new phone annoucement.", "score": 2, "replies": []}, {"body": "I'm ready to buy after the dip!", "score": 1, "replies": []}]}
{"title": "Why is $AMD coming back to Earth from the moon?", "selftext": "", "id": "506sz7", "created_utc": 1472498779.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 10, "comments": [{"body": "No reason. \n\nMean reversion.\n\nIt flew too close to the sun.\n\nEstablishing range until next ER.\n\nYour pick.\n", "score": 11, "replies": [{"body": "Rigged!", "score": 1, "replies": []}]}, {"body": "Had to refuel on phobos were heading for a  long journey to pluto  ", "score": 8, "replies": [{"body": "Weren't we supposed to stop at the moon? Which moon?!", "score": 3, "replies": [{"body": "...that's no moon! ", "score": 2, "replies": []}]}]}, {"body": "Why would a stock up 300+% come back down?  Correction of hype. ", "score": 3, "replies": []}, {"body": "Because you fucks keep posting about it on here", "score": 4, "replies": []}, {"body": "utilize earth's gravity as a slingshot for mars \n\nTL;DR: $$$$", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}
{"title": "DOES ANYONE SEE AMD ACTUALLY GOING ABOVE 7.85 THIS WEEK", "selftext": "[deleted]", "id": "506uq6", "created_utc": 1472499305.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 14, "comments": [{"body": "Could happen tomorrow.\n\n6.85 could also happen tomorrow.\n\nYou feelin' lucky, punk?", "score": 15, "replies": []}, {"body": "It's possible. That's only 30 cents above its current price", "score": 7, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Sounds about right", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Your post has been automatically removed because  https://www.youtube.com/watch?v=P9cObozvAQ0\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Your post has been automatically removed because  https://www.youtube.com/watch?v=P9cObozvAQ0\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "a 3-4% increase? Very possible. ", "score": 1, "replies": []}, {"body": "All I see red and I keep dumping more money into it. GF.Y", "score": 1, "replies": [{"body": "Fuck this new gf.y", "score": -2, "replies": [{"body": "Fuck dipshits asking the same questions a dozen times a day about the same goddamned stock every fucking day.", "score": 1, "replies": [{"body": "Okay", "score": -2, "replies": [{"body": "You were the sixth fucking post today about the same fucking stock.\n\nFuck off.", "score": -3, "replies": [{"body": "Okay.", "score": -2, "replies": []}]}]}]}]}]}]}
{"title": "Keep banking it to the moon?", "selftext": "[deleted]", "id": "507w08", "created_utc": 1472511552.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 12, "comments": [{"body": "Rate increase means the money banks borrow from the FED will be at a higher interest rate. Which in turn would most likely mean banks will charge higher rates to compensate for that. Higher rates mean less loans. ", "score": 2, "replies": [{"body": "But also higher rates = more depositors which the banks also make money off of. The spread between their borrowed money and their loans to consumers would widen and make up for a decrease in loans and then some.\n\nHigher rates are definitely better for banks.", "score": 13, "replies": [{"body": "This is why you're here. I'll be on my way. ", "score": 8, "replies": [{"body": "lol", "score": 3, "replies": [{"body": "No clue why you never received any flair. ", "score": 3, "replies": [{"body": "Give me some :(\n\nedit: :D", "score": 3, "replies": [{"body": "Damn, super rare compliment flair! You're like a holograph Pokemon card or something.", "score": 3, "replies": [{"body": "mine is a compliment. it points to the camaraderie in this sub.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Thanks for explaining it so simply. I need that.", "score": 1, "replies": []}, {"body": "Amd higher rates means a higher rate for CDs and Savings and stuff right?", "score": 0, "replies": []}]}]}]}
