{"title": "Looking to invest in blue chip tech stocks (focus on automation, driverless, machine learning). What is a good entrance strategy?", "selftext": "I'm looking to invest in blue chip tech stocks that are positioned to succeed in driverless, automation, machine learning and other new growth areas. I am mainly looking at Apple, Microsoft, Google, Amazon, BlackBerry and IBM. However, there are scores of other companies. \n\nI intend to invest $10K. I have a robust portfolio of ETFs and mutual funds that will be my backbone. However, I predict there will still be a lot of growth in the tech sector in the next two decades.\n\n**What is a good entrance strategy?** Many of these companies are pretty close to all time highs. I'm looking to buy and hold. Mid 20s investor.\n\nAny suggestions?", "id": "6ij6rd", "created_utc": 1498015181.0, "score": 24, "upvote_ratio": 0.91, "num_comments": 10, "comments": [{"body": "See if there are any actively managed mutual funds or ETFs with the same investment strategy as the one you just mentioned. My understanding is time in the market is more important than trying to time when you buy in. Admittedly if you realize a major loss early on in your investing timeline it has a bigger impact on the long-term balance than an equally sized one 30 years out, but unless you plan to hold the entire $10k in cash until there is a correction I would say start putting it in either as a lump sum or over the course of the next year (also consider transaction fees/break points if applicable, might mean doing a lump sum would cost less).", "score": 4, "replies": [{"body": "As a younger investor, Etfs are going to serve you better than mutual funds. ", "score": 1, "replies": []}]}, {"body": "Seems like you've got a decent idea of the companies you want (though I'd add NVDA and AMD to the mix). You can always just buy the stock directly and save the fees, especially if you're planning to hold for awhile.\n\nAlso if you're holding the for a long time you don't need to worry too much about entrance strategy. ", "score": 2, "replies": []}, {"body": "Dlph", "score": 1, "replies": []}, {"body": "Great choices. Except for me, I will take out BBRY and add TESLA and AMD", "score": 1, "replies": []}, {"body": "You can try an etf  stock fund.  card would be good ,  Baba ,   Nvidia , Amd  , I was going to buy intel just because they bo mobileye but the stock has stayed the same ,  ", "score": 1, "replies": []}, {"body": "With $10k over diversification might be your killer. Stick with 5-6 ETfs that cover the market and broad asset classes. FANG and Amazon could be tactical plays when they become cheap. Twitter might be something to look at.", "score": 1, "replies": []}, {"body": "Checkout FTEC and ARKQ. I own both. (=", "score": 0, "replies": [{"body": "IGM looks pretty nice. Too bad it has a .48% MER", "score": 1, "replies": [{"body": "That's a below average ER for a targeted ETF. I don't really know what you're expecting to find. ", "score": 3, "replies": []}]}]}]}
{"title": "Looking to invest in blue chip tech stocks (focus on automation, driverless, machine learning)", "selftext": "I'm looking to invest in blue chip tech stocks that are positioned to succeed in driverless, automation, machine learning and other new growth areas. I am mainly looking at Apple, Microsoft, Google, Amazon, BlackBerry and IBM. However, there are scores of other companies. \n\nI intend to invest $10K. I have a robust portfolio of ETFs and mutual funds that will be my backbone. However, I predict there will still be a lot of growth in the tech sector in the next two decades.\n\n**What is a good entrance strategy?** Many of these companies are pretty close to all time highs. I'm looking to buy and hold. Mid 20s investor.\n\nAny suggestions?", "id": "6ij4m2", "created_utc": 1498014508.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 19, "comments": [{"body": "GOOGL, AMZN, TSLA, NVDA all worth considering. All also part of my own portfolio.", "score": 2, "replies": []}, {"body": "Add graphene to that \n\nTSLA \n\nINTUIT (yea.. turbo tax. look up their future plans)\n\nULTI\n\nMU\n\nAMAT\n\nSPLK is going nowhere soon. id pass\n\nTSLA is looking into the graphene business as well. \n\nIBM\n\nAMD or NVDA. ur pick\n\nBlackBerry is good at not dying. fuck em. they've had years to do anything but suck ass. \n\nNOKIA has been in the news lately. im skeptical - hold a small position. \n\n", "score": 2, "replies": [{"body": "Had to ask, do you use BlackBoxStocks?", "score": 1, "replies": [{"body": "lul no. never pay for data, (well ok some of it is good, most payed data in algorithmic trading is well worth the money). I write stock trading algorithms and run a private fund: \"TheBlackBoxFund\"\n\nthe downvotes on here are kinda stupid. why is this downvoted: autism seems to be a likely cause.", "score": 1, "replies": [{"body": "Oh gotcha. The name threw me off. It seems like a decent program, but pricey at $80/month. I don't always have the time to do my own DD on the smaller companies & B.B.S. seems to have a nice alert system. But so does Finviz & a lot of stock screener programs I guess", "score": 1, "replies": [{"body": "try it for a month. if it works gr8. i dont have time to handle my trading so I wrote code that does it for me. I only focus (in terms of time) on long term investments now. ", "score": 1, "replies": [{"body": "Yeah I just might check it out for a month. I guess they also have a private Discord chat with all the other subscribers too so they can share info together all morning. Thanks for the replies!", "score": 1, "replies": [{"body": "no problem. I did follow someone who was on there that gave me good info on pharma stocks.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If you want high growth, you might want to stay away from blue chips.\n\nIBM has been rubbish in recent years. I don't know why you want Blackberry. Google n Amazon fair enough. Microsoft, I suppose. Apple is just a luxury manufacturer, not an innovator anymore. Buy on the dips (treat it like a value stock, not a growth stock).\n\nHow about smaller companies?\n\nCGNX. Machine vision company. Think driverless cars, robots, any machine that needs to \"see\".  Quality mid-cap company. Zero debt. \n\nSWIR. This is a pure play on the IoT. It is a small-cap stock with 35% (industry leader) market share. Zero debt.\n\nMELI. The Amazon and Paypal of South America. It is unrivalled and doing very well. A little larger than mid-cap. They got some debt (like most companies), but they could pay theirs off fasten than Amazon.", "score": 2, "replies": []}, {"body": "Splk", "score": 1, "replies": []}, {"body": "I would suggest picking two or three companies to invest only your 10k in. When I began investing, I ignorantly and stupidly invested my 10k in about 7 different companies, and even though one went up 40% (NRG), my gains were very minuscule. I hear lots of talk about NVDA for the driverless movement, may want to wait for a better entry point though. TSLA is also moving into that sector. AMZN is always a good tech choice, and is diversified in itself. ", "score": 1, "replies": [{"body": "probably for the best. realistically i won't keep up with all of them.\n\npretty familiar with microsoft and i think they will continue to be the dominant \"pay\" software company for a long-time. they are doing an amazing job with windows 10. just performed a clean install and it was the most seamless reinstall i've ever had to do", "score": 1, "replies": [{"body": "\nBe careful with payment software, AMZN is making moves on that market as well.", "score": 1, "replies": [{"body": "how so?", "score": 1, "replies": [{"body": "Amazon Pay, which they're going full throttle to integrate.", "score": 1, "replies": []}]}]}, {"body": "Microsoft has also traded sideways for as long as I can remember.\nYou would be relying on an AI breakthrough.", "score": 1, "replies": []}]}]}, {"body": "Check out NOK. It's not just a cell phone company anymore. Their future looks bright and they pay a good dividend. ", "score": 1, "replies": []}, {"body": "ABB is king of industrial automation. That's only one part of the the company too.", "score": 1, "replies": []}, {"body": "How come no one mentions an etf like ROBO or BOTZ?", "score": 1, "replies": []}]}
{"title": "rate my portfolio (mainly dividende paing stocks)", "selftext": "I am 34 year old and normally I would buy stocks 2-3 month and then dont sell it at all. I know that I have a slightly overweight of danish stocks\n\n\nStock name (number of stocks):\n\nA.P. Møller - Mærsk A A/S (2)\n\nALPHABET A (8)\n\nActivision Blizzard. Inc (135)\n\nBAYER AG NA(33)\n\nCoca-Cola Company(120)\n\nColoplast B A/S(56)\n\nDONG Energy A/S(98)\n\nDanske Bank A/S(175)\n\nG4S plc(1600)\n\nISS(90)\n\nInternational Business Machines Corporation(30)\n\nJohnson & Johnson(40)\n\nNordea Bank AB(420)\n\nNovo Nordisk B A/S(99)\n\nNovozymes B A/S(110)\n\nPandora A/S(29)\n\nPhilip Morris International Inc(25)\n\nProcter & Gamble Company (The)(28)\n\nSAP AG O.N.(56)\n\nSIEMENS AG NA(45)\n\nTryg A/S(215)\n\nVOLKSWAGEN AG VZO O.N.(14)\n\nVestas Wind Systems A/S(70)\n\nWalt Disney Company (The)(46)\n\n", "id": "6ijygb", "created_utc": 1498025030.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "I bet you are enjoying that Activision stock", "score": 3, "replies": [{"body": "It has increasd a lot. But the the dividend is still a bit low", "score": 2, "replies": [{"body": "But how is the dividend?", "score": 2, "replies": [{"body": "The dividend yield is 0.50% so it is on the lower end. My avg is app 2 %", "score": 1, "replies": []}]}, {"body": "Dividends are manufactured out of the stock price this making the price of the stock lower", "score": 1, "replies": []}]}]}, {"body": "This is a more in depth data about my portfolio\nwww.dropbox.com/s/rduqswx8e1hevbb/dividend3.ods\n\n", "score": 2, "replies": []}, {"body": "Those are a lot of holdings. I try to limit myself to 5-7 long term holdings since it's easier to manage those. How are you able to hold that many and still be 100% confident in every single one?", "score": 1, "replies": [{"body": "I am not confident enough in a single copmany to put 1/5 to 1/7 of my savings in one holding. I would put it in another view. How can you be that confident?\n\nIf you have asked me 10 years ago if Nokia was a good choice then I would say yes and today the are just a snowflake compared with the former selfs. \n\nI know that if all of my companies goes down then we will see something like what happend in the 1929 and then I would have larger problems. ", "score": 2, "replies": [{"body": "Then you might as well just buy ETFs that track the S&P or a certain sector. ", "score": 2, "replies": [{"body": "Disagree. Weightings and more importantly entry price of stocks may differ drastically. This of course relies a lot on you valuing stocks differently than the market. And that the stocks were bought at different times.", "score": 1, "replies": []}]}]}]}, {"body": "To diverse IMO. then again. I go for the whole \"diversification is protection against ignorance\" approach. I look heavily into the 4-8 stocks I hold and it pays off... it takes a lot of time tho. edit: it takes **a lot** of time", "score": 0, "replies": [{"body": "I am not smart enough to beat the market within a safe margen with only 4-8 stocks. \n\nI should go into an index fund but I accept that I am a little behind inexes (last year I was 0.2% behind). The litthe extra that I dont get is what I call the \"fun tax\". I think it is fun to own part of the companies direcly.", "score": 5, "replies": []}]}]}
{"title": "Question about stop and limit orders.", "selftext": "[removed]", "id": "6imwdz", "created_utc": 1498062209.0, "score": 9, "upvote_ratio": 0.84, "num_comments": 11, "comments": [{"body": "Well they are a shitty broker if they don't support a simple bracket order. \n\nGo to IB", "score": 5, "replies": []}, {"body": "What you're looking for is OCO, an Order-Cancels-Order. So if either your Limit or Stop is executed, the other is canceled.\n\nETA: From investopedia - \n\n**What is a 'One-Cancels-the-Other Order - OCO'**\n\nA one-cancels-the-other order (OCO) is a pair of orders stipulating that if one order is executed, then the other order is automatically canceled. A one-cancels-the-other order (OCO) combines a stop order with a limit order on an automated trading platform. When either the stop or limit level is reached and the order executed, the other order will be automatically canceled. Seasoned traders use OCO orders to mitigate risk.\n\nhttp://www.investopedia.com/terms/o/oco.asp", "score": 3, "replies": [{"body": "Edddie got it\nI do this at Scottrade if i can't monitor the stock or going away from computers for a while.", "score": 1, "replies": []}]}, {"body": "That's the way it works with most brokers - cannot have both a limit and stop order on the same ticker\n\nYou can sell half of your holdings on limit - half on stop market - if that is okay with you \n\nElse - you can set two separate \"trade triggers\" when the stock reaches your high or low level - get an alert and do a manual buy or sell - or trigger a 'stock order' to automate the process\n", "score": 2, "replies": [{"body": "I do this with one of my accounts.  You get the alert, cancel the action you don't want, and then adjust the other action for all your shares.  Not ideal if you can't trade mobile, but better than nothing.", "score": 1, "replies": []}]}, {"body": "Maybe if the stock hits 110 and there's no one buying your shares but the order is in, then it dips down to 90, it will try to sell stocks you don't have ", "score": 1, "replies": []}, {"body": "What's likely happening is that they use software tools to place the orders and it simply doesn't allow both.\n\nI've personally gone around this by writing some scripts using RobinHood's API.", "score": 1, "replies": []}, {"body": "You can set alarms at both 90 and 110. When your alarm gets triggered, you place the order manually.\n\n", "score": 1, "replies": []}, {"body": "My experiance in stocks (fairly new) is thst EVERYTHING takes time, and longer then you would think. \n\n\nThem not wanting to do both at the same time doesnt surprise me.", "score": -1, "replies": []}]}
{"title": "AMZN and WFM (Amazon and Whole Foods) thoughts?", "selftext": "Beginniner trader interested in purchasing....?\n\nAs many already know, Amazon is potentially purchasing Whole Foods soon. WFM stock already rose quite a bit the last week as did AMZN. I didn't buy any stocks for either yet mainly because I am new to all of this and my day to day job has nothing to do with finance per se. \n\nIs it too late to buy either? Would they be safe longterm options?\nAs with the recent Yahoo purchase, I noticed there stock went up sharp and down sharp as well. Thus, im somewhat skeptical. \n\nAny thoughts and advice for a newbie is much appreciated. Thanks.", "id": "6iopad", "created_utc": 1498078236.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 12, "comments": [{"body": "[deleted]", "score": 6, "replies": [{"body": "What?", "score": 1, "replies": []}]}, {"body": "Seems that people think AMZN will have to sweeten the offer for WFM, as the price has stayed above the $42 per share offer.\n\nAMZN certainly has the money, but I wouldn't bank on that trade.\n\nWith this purchase AMZN is clearly ready to use its cash hoard to disrupt new sectors, so even near all-time highs it may be a good investment.\n\nYou could buy an opening position in AMZN and look to buy more on dips, but be aware AMZN can be a very volatile stock so be ready for a roller coaster ride and have a plan.", "score": 2, "replies": [{"body": "What makes AMZN volatile though?", "score": 1, "replies": [{"body": "High price, high volume, and float isn't huge.  Plus it's sort of a war between bears and bulls on this one.", "score": 1, "replies": []}]}]}, {"body": "Too late for WFM, buy AMZN for the very long term.", "score": 2, "replies": [{"body": "WFM won't go up after it is purchased or set in stone at least?", "score": 1, "replies": [{"body": "WFM won't exist after Amazon buys them", "score": 2, "replies": [{"body": "Literally? Like the stock won't exist? What happens to the money I put into it if I buy it?", "score": 2, "replies": [{"body": "It will turn into Cash in your account", "score": 2, "replies": [{"body": "It won't get converted to AMZN stock?", "score": 1, "replies": []}]}]}]}, {"body": "> WFM won't go up after it is purchased or set in stone at least?\n\nInvesting is also a question of proper analysis and risk assessment (probability).  The way I look at it there are 3 possible events going forward:\n\n1. The deal goes through, WFM is done, the price is what it is, I believe $42/share.  **Most likely scenario** IMO\n\n2. The deal falls trough for whatever reason due to some issues coming up during die diligence or other reasons. **Highly unlikely*** IMO; in this case the stock goes back to what it was before, maybe a bit higher.\n\n2. There's a bidding war driving the price up, like a few media outlets insinuate. **Highly unlikely*** IMO.", "score": 1, "replies": []}]}]}, {"body": "Nothing is going to change, except for the very chance of someone else bidding up AMZN, which I doubt.\n\nAs for buying AMZN because of this buyout, I think its rather dumb, none of Amazon's buyouts have resulted in a significant revenue increase, just long term assets and contributing to efficiency. AMZN isng going to roll out a futuristic store tomorrow, or this year, at BEST they will use a single whole foods store as a pilot in 2018, and roll out the rest in the next 5 years.\n\nBasically, there is no short term money to be made from this buyout anymore.", "score": 1, "replies": []}]}
{"title": "Daily NVDA thread.", "selftext": "Up in premarket. Please finish green today.", "id": "6ilop3", "created_utc": 1498050325.0, "score": 9, "upvote_ratio": 0.81, "num_comments": 16, "comments": [{"body": "not looking likely :(", "score": 4, "replies": [{"body": "Or is it ?", "score": 2, "replies": [{"body": "or is it", "score": 1, "replies": [{"body": "I want to get off Nvidias wild ride", "score": 2, "replies": [{"body": "same :(, i sold 6 $162.5 covered calls for this week so im holding my shares until friday but after that im out of this hoe until ER.", "score": 1, "replies": []}, {"body": "scratch that, $200 or bust\n", "score": 1, "replies": []}]}, {"body": "OR IS ITTTT", "score": 1, "replies": []}]}]}]}, {"body": "holding about $25k at 161.x \n\nHolding a company with so many positive articles is truly refreshing. ", "score": 3, "replies": [{"body": "Expiry?", "score": 1, "replies": [{"body": "Equity, not options", "score": 1, "replies": [{"body": "Nice, Im holding calls. Lets both pray for the pre ER run up.", "score": 4, "replies": []}]}]}]}, {"body": "Looks like August live cattle are going to start their bounce.\n\nSell into strength. ", "score": 8, "replies": [{"body": "Pretty sure we can write off last weeks dip as a result of the dead cat bounce in dead cattle. ", "score": 6, "replies": []}]}]}
{"title": "Daily AMZN WF merger thread", "selftext": "[deleted]", "id": "6ilz6q", "created_utc": 1498053504.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 12, "comments": [{"body": "I sold a fuckload of naked $43 WFM calls expiring Jun23.  I'm not going to lie, I'm a little nervous right now.", "score": 3, "replies": [{"body": "For how much?", "score": 1, "replies": [{"body": ".30", "score": 1, "replies": []}]}]}, {"body": "Have a few calls a few months out on $WMT.", "score": 2, "replies": [{"body": "Same, slowing making gains, was a good play imo. ", "score": 3, "replies": []}]}, {"body": "Bought into $COST. Looking like a typical reversal setup which could start showing today!", "score": 2, "replies": [{"body": "COST looks like it'll take its time to move.", "score": 2, "replies": [{"body": "Very slow...", "score": 1, "replies": []}]}]}, {"body": "OCT calls on TGT will get you a nice holiday treat due to q2 being reported by then. They tend to beat earnings 3/4 times, and their only big misses come on q4.", "score": 2, "replies": [{"body": "Fukkin snitch\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Daily?", "score": 1, "replies": []}, {"body": "Hemp futures.  Rope/ hemp clothes monopoly", "score": 1, "replies": []}]}
{"title": "Will AMZN - WFM play into RAD acquisition?", "selftext": "[removed]", "id": "6im8ry", "created_utc": 1498056235.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "no", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That's exactly what I'm saying you fuck. If they enter the pharmaceutical market with WFM it is an additional competitor and the RAD deal is more likely to be approved", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You're good, this thread just frustrated the hell out of me. Note to self: don't come to WSB for good M&A insight", "score": 1, "replies": []}]}]}]}, {"body": "Amazon buying rad is fake news. If they wanted to, they would have made an offer along time ago. Especially when wba cut the deal from 9 to 6.50. These deals take months. Things could change july 7 but atm pray for 1-1 split", "score": -1, "replies": [{"body": "that's not what he's talking about", "score": 2, "replies": [{"body": "I might have misread but the wfm buy out is not related since wfm doesn't have a pharmacy. ", "score": 1, "replies": []}]}, {"body": "Reread my first paragraph. I didn't even hint at them buying rad, I hinted at them having some interest in the 1,200 stores that need to be sold off.\n\nThe realistic question is if the FTC will now view Amazon as a competitor.", "score": 1, "replies": [{"body": "No caz wfm has 0 pharmacy ", "score": 1, "replies": [{"body": "Amazon has shown signs of entering the pharmaceutical market and WFM further opens that door with brick and mortar locations.", "score": 1, "replies": [{"body": "Amazon has tested the waters in a lot of things like phones but they have 0 market share. Until they have real market share, it doesn't matter. This could change but for the deal , it's a non factor.", "score": 2, "replies": []}]}]}]}]}]}
{"title": "Will tesla Model 3 jump or bust?", "selftext": "", "id": "6ipo2w", "created_utc": 1498087868.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 10, "comments": [{"body": "It'll probably just drive. ", "score": 19, "replies": []}, {"body": "Maybe if you order an orange one and paint a rebel flag on the top. ", "score": 3, "replies": [{"body": "Talkin bout that stock price, joker", "score": -1, "replies": [{"body": "Is this the one they plan on selling for $35k?  Its gonna fuckin fly.", "score": 4, "replies": []}]}]}, {"body": "They won't make money at 35k, I foresee a price increase. The ramp up has already been slowed.  Delays are inevitable.  \n\nThat said, it'll prolly still fly.  The 500,000 people who put up that refundable $1,000 deposit aren't going anywhere, meaning the first two production years are already sold.  (I know the target was 500k/year but that's not happening without another assembly plant)", "score": 3, "replies": []}, {"body": "The only thing that will knock this thing down back to anything even beginning to start to maybe look like a reasonable valuation will be missed delivery targets and shit w/ Model 3 but also think that'll be next good buying opportunity. \n\nDaddy Musk knows how to make cars people want. TSLA sells cars faster than they can make them, has the top selling US luxury car, and roughly .01% of total US cars on the road. It's really not hard to imagine them with 3-4% within a few years if they just can make the damn things.\n\n", "score": 2, "replies": []}, {"body": "I'm pretty close to the front of the preorder line I'll let you know when it comes out.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "More like $8-10k. ", "score": 1, "replies": []}]}]}]}
