{"title": "Arm Stocks Jumps Than 50% on AI Craze", "selftext": "\"Shares of British chip designer Arm surged more than 50% after its earnings report surprised analysts and suggested artificial intelligence may be driving a recovery in the semiconductor industry.\n\nThe company said it made a record $824 million of sales in its last quarter, and projected as much as $900 million for the current quarter.\n\nBoth figures topped Wall Street expectations, reflecting a recovery in demand for parts of the chip industry fueled in large part by big investments in artificial intelligence computing.\n\nArm shares rose to about $115 Thursday, sending its market value to over $117 billion and more than doubling its price at its [initial public offering](https://www.wsj.com/finance/stocks/arm-set-to-price-ipo-at-52-a-share-214e3351) last year.\n\nArm’s chip designs are in nearly all the world’s smartphones, making its results an indicator of the health of the handset market.\n\nA faster-than-expected shift to AI gave a boost to the results, Arm executives said. Many of the latest Arm-based smartphone chips have AI capabilities built in, and Arm-based circuits are part of some of the most advanced AI systems made by Nvidia, the leader in AI computing.\n\n“Given we are in the very early innings of AI adoption, we expect Arm’s sales to remain robust” in the coming years, analysts at Citi said in a note.\n\nArm’s earnings surprise and market surge come at a time of mixed fortunes for the broader chip industry.\n\n**Qualcomm**, a major designer of mobile-phone chips, [reported better-than-expected results last month](https://www.wsj.com/business/earnings/qualcomm-1q-revenue-tops-estimates-on-growth-in-handsets-automotive-31f098c4). Nvidia [has reported several quarters of blockbuster results as AI investments skyrocket](https://www.wsj.com/articles/nvidia-joins-1-trillion-club-fueled-by-ais-rise-f515dd6e), sending its shares to new highs and making it one of the world’s most valuable companies.\n\n**Intel** has had healthier sales in recent months as the personal-computer market recovers, although [the company last month gave a muted outlook due to weakness in its programmable-chip and self-driving units](https://www.wsj.com/business/earnings/intel-intc-q4-earnings-report-2023-8b61b812).\" \n\n[READ HERE](https://www.wsj.com/livecoverage/stock-market-today-dow-jones-earnings-02-08-2024/card/arm-stocks-jumps-than-50-on-ai-craze-EdMMfFbOQgRglDjkft2t?mod=lctimeline_finance)", "id": "1alynq0", "created_utc": 1707407171.0, "score": 182, "upvote_ratio": 0.91, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 week ago\n**Total Comments**|35|**Previous Best DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "It’s just crazy af", "score": 121, "replies": []}, {"body": "With all the IV, these options cost an ARM and a leg", "score": 98, "replies": [{"body": "I bought puts for earnings. ARM fisted me.", "score": 38, "replies": [{"body": "Bro what were you thinking??", "score": 16, "replies": [{"body": "That a company that was rejected by Intel and nvidia for being too expensive and never making a profit would be rug pulled by SoftBank like all other IPOs", "score": 23, "replies": [{"body": "Imagine they just design the IP, still on their ass and collect royalties. That’s all they do accept checks all day. No manufacturing, no inventory no selling. All of the profit, none of the risk. That’s why NVDA tried to buy them, they didn’t reject they got turned down by EU regulators.", "score": 21, "replies": [{"body": "imagine doing all that you said and still not turning a cent of profit !", "score": 5, "replies": []}]}]}]}, {"body": "I was going to buy deep OTM calls but premiums seemed expensive, apparently not", "score": 7, "replies": []}, {"body": "lol", "score": 2, "replies": []}, {"body": "You mean they’re ARMs deep?", "score": 1, "replies": []}]}]}, {"body": "This is fukken insane", "score": 25, "replies": [{"body": "Reminds me of QCOM in 1999 (the entire year)...\n\nIt was more epic come Nov/Dec 1999", "score": 1, "replies": []}]}, {"body": "I barely knew how to read when the dot-com bubble burst. Not taking any sides whether or not we're entering a bubble, but is this not the kind of things you'd see back in '99?", "score": 79, "replies": [{"body": "Dot com bubble was full of 0 revenue and 0 profit companies. Pets.com is the easy example, where they IPOd at a $100M valuation despite only doing $500,000 in revenue while spending $11,000,000 on advertising. If you had a webpage, people invested in you. What we’re seeing now is different. Everyone is using AI as a buzzword, but only companies showing good profit and guidance are going up. Snapchat, PayPal, Intel, Alibaba, etc just got decimated because financials weren’t improving enough to justify the hype.\n\nI’d compare what we’re going through now more to the adoption of cloud computing. Everyone uses it as a buzzword, and some will see tremendous value added while others see basically none. Nasdaq is currently sitting at a PE of 25, while it’s historical average is 28 and it’s high during the dot-com bust was 200.", "score": 124, "replies": [{"body": "Thought I was gonna get some crayon eaten essay, but you actually raised some well regarded points ![img](emote|t5_2th52|27189)", "score": 37, "replies": [{"body": "Don't see that around here much", "score": 2, "replies": []}]}, {"body": "We saw this during the unlimited free money during covid.\n\nRemember that Deli that was worth 100M with 1 or 2 locations?", "score": 8, "replies": []}, {"body": "But here's the difference. Alibaba has a Revenue of 130B ish, and this year about 12B net profit. It trades at 195B market cap.\n\nEnter ARM at 3-4B revenue and close to zero profit. Its trading now at 125B market cap. \n\nI'm not saying all of Nasdaq is overvalued. But ARM definately is by traditional metrics.", "score": 22, "replies": [{"body": "BABA is Chinese. Lots of distrust around that. The numbers could be all lies.", "score": 14, "replies": [{"body": "25% ARM revenue comes from China, and ARM china is their single largest customer…", "score": 1, "replies": [{"body": "Different than the company itself being Chinese but hey fair point.", "score": 2, "replies": []}]}]}, {"body": "China’s companies are losing because the government is afraid of its own people and would rather insulate itself from a world they can’t control.", "score": 2, "replies": [{"body": "Even if you dont believe in chinese stocks doesn't remove the fact that ARM has nothing to back up that valuation other than blind believe in AI.", "score": 2, "replies": []}]}]}, {"body": "The problem is it took a decade for big non-tech organizations to adopt AI in the form of Machine Learning and Data Science. The only thing new in 2023 was generative AI, which while promising at that stage is only experimentations and lacks clear enterprise level production use cases. Internet, Cloud, Data Science... each took 10 years between promises and adoption. I don't see generative AI being the exception. For now it is indeed at the 0 revenue 0 profit stage (except for Nvidia and OpenAI, just like Cisco or Nortel in the dot com bubble).", "score": 4, "replies": []}, {"body": "dot com bubble closest reoccurrence was likely in crypto. ICOs. non-meme coins. probably not memecoins or NFTs as dot com bubble despite being hot air had legitimate hope that anything and everything was going to take off. \n\nwas likely most akin to 2020-2021 since that’s really where everyone was adopting the ‘new tech frontier’ just for the sake of it: blockchain, NFT, metaverse.\n\n it was a land grab similar dot com circa 1999.\n\n2015-2017 wasn’t the same mass adoption or land grab. and both in 2017 and 2021, i think the land grab was a lot more conceptual—in same way nonexistent businesses were creating websites, you saw saw something for blockchain.\n\nI think big difference with AI is two fold:\n\none, it’s far more practical and already in application. likely tens of thousands of ppl, myself included, already use it in daily work life to transform or even revolutionize our work. it gives tangible daily results.\n\ntwo, you don’t see a gazillion AI startups with nonexistent businesses at the forefront. it’s persisting tech giants.", "score": 3, "replies": []}, {"body": "Shiller begs to differ: [https://www.multpl.com/shiller-pe](https://www.multpl.com/shiller-pe)", "score": 3, "replies": [{"body": "If he was so smart then why is he so dead? (He's not dead)", "score": 2, "replies": []}, {"body": "Maybe I'm regarded but this chart is showing spy and not the nasdaq", "score": 2, "replies": [{"body": "Correct. Couldn't find it for NASDAQ and GPT didn't help.", "score": 1, "replies": []}]}]}, {"body": "Good information", "score": 2, "replies": []}, {"body": "I'm not going to fact check you but I believe everything you said because of how you wrote it. Thanks.", "score": 1, "replies": []}]}, {"body": "The .com bubble was way more unhinged. Today it’s all massive tech companies getting cash instead of a bunch of randoms that just got off the pink sheets", "score": 10, "replies": [{"body": "Reddit loves comparing every rally to the dot com bubble, as if nothing’s changed over the last 25 years. Yes, some stocks are overvalued and there will be corrections along the way, but the AI hype is for real. It’s technology that’s really groundbreaking *and* it’s already making real money for companies like Microsoft and Nvidia.", "score": 1, "replies": [{"body": "People don't realize that 1 ai software could replace every single customer support phone tech and thats just one application. The more serious ones are finding molecules and theoretical molecules that can cure/treat x disease, ai that's just better than stock algorithms, ai that could astroturf reddit into oblivion, or ai that could make video games from start to finish or movies or scripts or whatever. Or just consider the propaganda like we've seen with freeware ai, like trump vs Biden ai debates. \n\nSomeone traveling back in time from 2050 with current ai would take over the world.", "score": 2, "replies": [{"body": "So, The Terminator is based off real events?", "score": 1, "replies": []}]}]}]}, {"body": "I mean sure company posted ok results. But at the end of the day they are valued at 125B with a quarterly revenue of 800M. That's almost 5 times more compared to Apple, which is trading at inflated valuation. Either that company 10 folds their revenue and profits or there is something seriously wrong in the valuation.   \n\n\nThey say AI in earnings report and everyone goes batshit?", "score": 43, "replies": [{"body": "Their net income is also negative. That's a 125b company that doesn't turn a profit.", "score": 17, "replies": [{"body": "What the ever loving fuck is a 'profit'", "score": 15, "replies": [{"body": "profit is for poor management that cannot raise capital from shareholders.", "score": 9, "replies": []}, {"body": "I think he’s talking about THE prophet?", "score": 2, "replies": []}]}]}]}, {"body": "Not really. The price action was similar, but earnings and revenues were made from thin air. Difference today is NVDA is actually pulling in hard cold cash and their gross margins are sky high last I checked.", "score": 3, "replies": []}, {"body": "PE of 600 is not in bubble? Lol", "score": 3, "replies": []}, {"body": "Yeah, but this is a different market and economy than we had back then. QE and zirp really changed things.", "score": 2, "replies": []}, {"body": "QCOM 1999 rings a bell", "score": 2, "replies": []}, {"body": "Yup", "score": 1, "replies": []}]}, {"body": "This shits so broken", "score": 42, "replies": []}, {"body": "Absolutely nuts. I just cashed out from my $80 2/16 call.  Don’t know how long it will sustain the jump and even if it does that shit is too risky for me right now.", "score": 20, "replies": [{"body": "Soft Bank still owns 90% of ARM.  In the near term, ARM’s stock price is going to be almost entirely dependent on whether Soft Bank sells.\n\nI have to believe that Soft Bank will be a seller.  They already tried to sell the entire company to NVDA before the IPO.  ARM is now worth more than Soft Bank was a day or two ago.  If Soft Bank sells even 15% of its position, that equals the entire public float.\n\nNow that your call has made you some money, maybe a good time to think about selling short!", "score": 14, "replies": [{"body": "We have room March though", "score": 2, "replies": [{"body": "You called it.\n\nWhat I am thinking is that, given the constricted number of shares available for trading between now and March 12, we are going to continue to see an enormous amount of volatility.\n\nAfter March 12, I expect that SoftBank will sell a significant portion of its position (20% to 40% at least) into the market in a way that is intended not to cause a dramatic plunge in stock price but that will set a ceiling on price increases for an extended period of time.  Maybe selling limited blocks of stock with a limit on the price sold for each block \n\nHowever, I don’t have real knowledge of how institutions manage large scale trades to maximize return.\n\nWhat do you think?\n\nI also don’t know how best to take advantage of this.  I am not comfortable trading options.  I came into the recent run up holding 450 shares, sold all for a short term profit and then bought 450 shares when the stock dropped, then sold again (at $143 /share) for a profit, then just bought 500 shares today at $128 / share.  I expect the stock will go up again in the next few days and that it will continue to be very volatile.\n\nWhat I am not sure of is at what price SoftBank will be selling after March 12.  It will probably be somewhat less than whatever the market price is on March 11.  I would like to be a long term owner of ARM.  So, maybe I should cash out on March 11 and buy back in for the long term below what SoftBank sets as a near term ceiling on the price.\n\nWhat am I missing?", "score": 1, "replies": []}]}]}, {"body": "Ya I sold all of my $75, 2/16, for 600% this morning.  Insane.", "score": 5, "replies": []}]}, {"body": "What are the chances SoftBank sells their stock and the whole thing comes crashing down?", "score": 14, "replies": [{"body": "At this point ARM is worth 1.5x softbank", "score": 27, "replies": []}, {"body": "SoftBank rose on this news I think?", "score": 1, "replies": []}]}, {"body": "Why do kids these days say stocks instead of shares?", "score": 7, "replies": [{"body": "Cuz they ain’t sharing shit these days", "score": 20, "replies": []}]}, {"body": "Let's see if this comment ages well, I'm taking a chance: 100$ puts for tomorrow.", "score": 5, "replies": [{"body": "We think alike. My puts are down 70%. Bought them too early. I did make $ on calls this morning though.", "score": 2, "replies": []}, {"body": "Iv crush likely", "score": 1, "replies": []}]}, {"body": "Reddit about to announce some ai shit for their IPO.\n\nAI mods", "score": 4, "replies": [{"body": "The AI bots that trade stocks get hard ons when they read AI in the release and they start buying.  No humans involved.", "score": 2, "replies": []}]}, {"body": "ARM is the new NVDA long dated calls is the game", "score": 5, "replies": [{"body": "META is making AI chips now too", "score": 3, "replies": [{"body": "Microsoft and Meta are NVIDIAa biggest purchasers and they both are making their own AI chips. Google and AWS already do.  Hell the Google TPU v5p is the fastest available.   NVIDIA is going to get boxed out by in house solutions.", "score": 2, "replies": []}]}, {"body": "Can you tell me what ARM does?\n\n\nAnd what NVDA does?", "score": 2, "replies": []}, {"body": "Everyone always saying there’s a new NVDA, but there’s really only been one NVDA. All the “new” ones get outperformed by the original even when you think the stock has already moved up", "score": 1, "replies": [{"body": "[deleted]", "score": 7, "replies": []}]}]}, {"body": "I'm so fkn dumb, I read so much about them and their technology and then I forgot them. Now this. Fuck me", "score": 3, "replies": [{"body": "Same we both missed the boat, oh well we'll have more chances later on", "score": 1, "replies": [{"body": "Nope, nuked my account with puts after that. I'm out for a while haha", "score": 2, "replies": []}]}]}, {"body": "Really didn't expect the random limit sell I set at $120 would actually cash out \n\n\nWas really expecting that one to expire in 90 days", "score": 3, "replies": []}, {"body": "2026 calls are like $10 more than the current price 🤣🚀", "score": 3, "replies": []}, {"body": "Most of the printed money went to the rich who don't need it, so they are throwing all this excess money at the pie-in-the-sky dream of robot slaves. If it all goes bust it doesn't affect them.", "score": 3, "replies": [{"body": "This isn't the trickle down economy we signed up for lmao", "score": 1, "replies": []}]}, {"body": "They gotta make it so those European people have something to cheer about too because they are all left behind the US because they are bitter Europe doesn’t have tech. It went up because societally it was a must to get people excited too", "score": 0, "replies": []}, {"body": "Huh, who knew AI would actually make money for once instead of trying to destroy humanity? Maybe Skynet ain't so bad after all *pretends to understand stock market or technology trends while quietly researching more about ARM shares*", "score": 0, "replies": [{"body": "ARM has about as much relevance to AI as Pepsi does.", "score": 1, "replies": []}]}, {"body": "Mmmhm chips", "score": 1, "replies": []}, {"body": "softbank owns 90% of outstanding share!", "score": 1, "replies": []}, {"body": "I think arm is becoming next game stop", "score": 1, "replies": []}]}
