{"title": "The Appellate Merger Arbitrage Case for Spirit Airlines ($SAVE)", "selftext": "Related Position Disclosure: I own 37,157 shares of $SAVE.  Additionally, I have sold 18 cash secured put option contracts expiring 2/16/2024, at a strike price of $6.50, which, if assigned, may cause me to own an additional 1800 shares.  I am likely to accumulate more of this stock.\n\nImportant Disclaimer: Nothing in this post is, or should be construed as investment advice. I describe my reasoning for why I did what I did. That doesn't mean it is a good idea for you. You can do your own research, consult a trusted financial advisor, or do whatever it is you think makes the most investing sense. What you shouldn't do is blindly follow me. I am not a financial advisor. I am an amateur investor, and any positive past performance I have enjoyed is not a guarantee of future success. All investments carry the risk of loss. This post discusses a particularly risky investment, which will probably not fit with the risk tolerance and goals of all investors.\n\nAdditional Important Disclaimer:  I am an attorney.  Unless you have hired me, unrelated to this post, I am not your attorney. This post is not legal advice to you.  It does not create an attorney-client relationship between us.\n\nMy Background:  I have been licensed to practice law for over 15 years.  In that time, I have handled a wide array of cases.  I do not specialize in anything.  That means, specifically, as it applies to this case, I am not a specialist in antitrust law and  I am not a specialist in federal appeals. I do have some federal appellate experience, but it is not in the 1st circuit, the court which is hearing this appeal.  Analyzing antitrust cases interests me, and it is my belief that the skills I have developed over a decade and a half as an attorney, and of course through my studies in law school, likely give me a better ability to analyze the merits of an appeal than a lay-person.  Nevertheless I am not thoroughly researching and writing a brief.  I am not your counsel, and I am not guaranteeing any particular result.  I am putting some thoughts out there that people can consider, but because I am not thoroughly researching and citing every single statement, it is probable that I will misstate or overlook some things.  What I miss could be important.  Do not read this, rely on it, and make an investment decision based on that.  It is my thoughts and musings, and kind of an explanation of why I did what I did. I am not telling you to do the same.\n\nBackground on related post:  I made this post: [https://www.reddit.com/r/stocks/comments/17lit6s/the\\_arbitrage\\_case\\_for\\_spirit\\_airlines/](https://www.reddit.com/r/stocks/comments/17lit6s/the_arbitrage_case_for_spirit_airlines/)\n\nIn that post, I thought that this deal was about 70% to go through.  I am less sure now, although I am still leaning toward it being completed.  This is primarily due to timeline concerns.\n\nTHE ANALYSIS\n\nBackground:  Spirit and JetBlue signed a merger agreement.  The DoJ sued to Block the deal.  At trial, the DoJ prevailed, resulting in an order by Judge Young blocking the merger.  JetBlue and Spirit appealed that decision to the 1st Circuit Court of Appeals.  Oral Argument is expected in June.  The current deal price, were it to go through, is $29.85/share.  Additionally, JetBlue pays Spirit shareholders $0.10/month for each share held.  If the deal is not completed by July (I believe 24th), either party can walk away.  If the deal is not consummated, JetBlue must pay Spirit $70 million.  There was a termination fee to be paid to Spirit shareholders as well, but the $0.10/share was being deducted from that particular fee, and it is now $0. $SAVE is currently trading in the $6-$7 range, indicating that the market views the merger as extremely unlikely to succeed.\n\nThe currently dominant view expressed in media coverage is that JetBlue and Spirit, who I will refer to as Appellants, have an extremely low chance of success on appeal.  Generally, the media people whom I see expressing this view are not attorneys.  I think of them as lay-people, but they may well have some expertise in finance, etc.  Nevertheless, when they start handicapping legal cases, I can't help but think they're in the wrong wheelhouse.  I am often surprised by just how terrible coverage of legal cases in the media can be.\n\nHere are the main reasons that I think that Judge Young's opinion is likely to be reversed.  I expect, but do not guarantee, that these arguments will be made in the brief of Appellants, which we will see within a couple weeks, albeit, not necessarily in the same order.  They might think of something I missed.  They probably will.  They have a team of attorneys working together on this as their job.  I am doing this alone in my spare time.  It isn't the same.  Now I just want to point out, before I begin, that while I am picking apart Judge Young's opinion, I respect his many years of service on the bench, and this is in no way intended to besmirch him.  Attorneys disagree with each other constantly, and that in no way diminishes either side of a debate.\n\nList of issues (described in greater detail below):\n\nA)  The Court chose the wrong geographic market\n\nB) The Court failed to properly apply the doctrine of estoppel\n\nC) The Court stated but failed to apply the correct legal standard (substantially lessen competition in any relevant market).\n\nD) The Court failed to identify a particular market in which competition was substantially lessened, and failed to conduct the required market specific analysis in that market.\n\nE) The Court inappropriately assigned the burden of persuasion to Appellants, where it should have been assigned to Appellees.\n\nF) The Appellees (DOJ & States) failed to introduce sufficient evidence such that a reasonable fact-finder could determine that they have established a substantial lessening of competition in any relevant market.\n\nG) The Court arguably failed to sufficiently weigh the nationwide consumer benefits of the deal.\n\nOk, now i'm going to dig into the meat of these a little bit.  This is not a legal brief, so there will be cursory and incomplete explanations.  Otherwise, this would be a great many pages long.\n\nA)  The Court chose the wrong geographic market\n\nI submit that the appropriate market was national.  The Court defined the market as city pairs.  The argument used for this is essentially that if I am flying from (for example) Dallas to Fort Lauderdale, and my ticket price goes up, I am not really helped if this is offset by cheaper ticket prices from, say, Oakland to Harrisburg.  Facially, from a lay-person perspective, this is a really compelling argument.  Legally, it is not as cut and dried, however.  When analyzing the relevant market, it is important not only to consider the mobility of consumers, but also the mobility of competitors.  Where you have low barriers to entry and a highly mobile product, it is nearly impossible to successfully monopolize.  This is because if I substantially raise prices, a competitor can just move in and compete.  The airline industry is highly mobile.  Planes (and I know this is shocking) move around.  It is not hard to get slots in most of the airports in which Spirit and JetBlue both operate, and they have made divestitures in the hardest to enter airports, all to make sure that they fall into this category where competition can move in easily, so there is not a specific monopoly concern.  Because we all know airlines shift routes frequently and easily, and because that was established, and because they also compete with each other nationally, I would argue the national market is the appropriate market.  This is a fact specific inquiry, and reasonable minds can differ, but the DoJ was arguing at the same time that the markets were city pairs and that the harm was national in scope, and that just makes no sense whatsoever.  Historically, there have been cases where courts have determined that the appropriate market was national.  I am not aware of any cases where they have determined city pairs were the appropriate geographic markets in the context of an actual airline merger.  They did use them in the NEA case, which was not an actual merger, but in that case the parties agreed to that market definition.  There could be some cases out there that I am not aware of.  If the Circuit Court rules that the appropriate market is National, then it is exceedingly difficult to find any path where this merger is monopolistic, because the big 4 airlines each control, and would control after the merger, a far bigger share of the national market than JetBlue+Spirit.\n\nB) The Court failed to properly apply the doctrine of estoppel\n\nThere was a motion to rule that the DoJ be estopped from asserting certain arguments, and that certain statements which they previously made be \"deemed admitted\".  (Here comes a very basic explanation, because there are actually many types of estoppel and similar other doctrines). Basically, the idea is, if you make an argument in a case, and the court agrees with you, and it is essential to the court's ruling, and the court rules in your favor, then you have to accept that argument as the truth when you come back into court again.  You don't get to argue the opposite side of it, because you argued that thing, and you won.  In the NEA case, the government made a whole bunch of statements, about how JetBlue was a Maverick, a unique competitor, the only company that could effectively compete with the Big 4 airlines, etc.  Appellants wanted them to be stuck with those arguments.  The court never decided this issue anywhere that I saw in the case... it just kind of seemed to not rule on it.  Some of the government's experts seemingly contradicted these statements, and wouldn't say that their analysis would hold up if those statements were true.  I will point out, trying to use estoppel against the government is a bit more tricky than using it against a private litigant.  I think it should have applied here, but there are certainly counterarguments and reasonable legal minds may disagree on this.  If I am correct, however, and the Circuit Court rules that the government was estopped from making some of its core arguments, and that some of its expert's testimony was inadmissible because it makes prohibited arguments, that strikes at the very heart of the government's case, and makes it difficult to see how they could prevail.\n\nC) The Court stated but failed to apply the correct legal standard (substantially lessen competition in any relevant market).\n\nTo be enjoined, a court is supposed to find that it \"may result in a substantial lessening of competition in any relevant market\" - That's pretty right but I am in a groove of typing so I'm not looking it up.  Anyway... there are a few words that are key here \"May\" \"Substantial\" \"Lessening of Competition\" \"Relevant market\".  We already talked about picking a market, but we'll delve into what that means a bit soon..  May, serves to lower the threshold from something like \"will\", for example, but does not lower it to the point of \"might under any circumstances you could ever think of\".  It becomes something along the lines of, could foreseeably reasonably be expected to.  Not a super high standard.  \"Substantial\"  takes us kind of to the heart of it.  It can't be a minor lessening of competition.  It has to be something with both duration and severity.  And then \"Lessening of Competition\". Now sometimes price is sometimes used as a proxy here, but really it is not exactly the same thing.  Like... if the cheapest store in town raises prices, that doesn't necessarily mean competition is lessened, if there are the same number of stores, for example.  It is important though, to recognize, that we are dealing with \"in any relevant market\" not \"in any relevant market segment\".  Here, the court defined a market geographically (city pairs) and product market (passenger air travel). I think the geographic market is wrong, as stated above, but lets just assume arguendo that we are using it on appeal. The judge then went on to say, this will harm the type of customer that flies spirit in this market, so this must be enjoined.  That is the wrong analysis.  You have to look at how it affects the whole market, not just spirit customers.  The Court explicitly asked if the DoJ was trying to define a market of cost conscious consumers, and DoJ said no.  Everyone agrees they are not the market, they are a part of it.  This seems pretty likely to be redone by the Circuit Court.  Now I am not saying (in this paragraph) what happens when the right legal standard gets applied properly.  I am just saying, you can't say, for example, my product market is all medical care, this merger hurts people getting knee replacements, so it must be enjoined.  You have to look at what it does to the whole market for medical care, or you've done it wrong, and the Circuit Court needs to redo it.\n\nD) The Court failed to identify a particular market in which competition was substantially lessened, and failed to conduct the required market specific analysis in that market.\n\nThe Court opinion laid out what market it was using, and then said, basically, there's bound to be a problem in at least one of these city pairs.  That is, at least according to my understanding, insufficient analysis.  Someone may correct me if I am wrong, but my understanding is that a Court has to actually find a market with a problem, and analyze that market, and explain why they find that the merger may substantially lessen competition in that particular market, in order to enjoin the merger.  The Circuit Court would likely need to do this analysis de novo, since it literally wasn't done, to enjoin this merger.  There is a problem, however.  If this were the main problem in the case, the Circuit Court would be well within its rights to remand the case back down to the trial judge to do this analysis.  This could, if JetBlue and Spirit don't extend the deal, kill the merger just by running out the clock.  I believe that the Circuit Court will be cognizant of this situation, and understand that we are in a \"justice delayed is justice denied\" scenario, and not do that.  Nevertheless, there is risk there, because Courts do sometimes remand things for further consideration consistent with an opinion saying what they believe a trial judge failed to do.\n\nE) The Court inappropriately assigned the burden of persuasion to Appellants, where it should have been assigned to Appellees.\n\nAround pages 105-106 of the opinion, the Court stated that Jetblue/Spirit cannot show that a customer will not see increased prices, so the merger must be enjoined (paraphrased).  Now a customer seeing increased prices is not the same thing as substantially lessened competition, as I said above, but that is not the only problem here.  It's the \"Jetblue/Spirit cannot show\".  So... these merger cases are very complicated, and you have burdens of production, which shift in a complex framework, and the burden of persuasion.  The burden of persuasion is with the party trying to block the merger.  It is the government's job to show that competition may be substantially lessened.  It is not JetBlue/Spirit's job to show affirmatively that competition will not be substantially lessened.  It's not the same, but this would be kind of like saying \"the defendant is unable to prove their innocence and is thus guilty.\"  It misconstrues who is supposed to do what.  I am not sure that doing this particular analysis differently necessarily results in a different outcome, but it could, and it is a reason not to uphold this decision as written.\n\nF) The Appellees (DOJ & States) failed to introduce sufficient evidence such that a reasonable fact-finder could determine that they have established a substantial lessening of competition in any relevant market.\n\nAssuming, arguendo, that we are using city pairs as the relevant market, lets move forward.  The Judge stated, in his opinion, that the Appellees experts failed to include other airports from the same metropolitan area in their calculations.  This is hugely important.  Their numbers are wrong, like in a missing whole airports sort of way.  When you look at this case, and realize that Spirit tends to operate out of the secondary, less popular airport in most cities (because it is cheaper, has less wait times, etc.), that means that in most origin-destination pairs, we are actually ignoring the biggest airport and most of the air traffic that is supposed to be included in the calculations.  Without those numbers, it seems exceedingly difficult to make a case that the government's experts should be relied upon in showing that this merger will substantially lessen competition.\n\nG) The Court arguably failed to sufficiently weigh the nationwide consumer benefits of the deal.\n\nThis one is a bit tricky.  If we assume, again, that we are adopting city pairs as the market, then we also assume, for the moment, that you've found some level of harm in some of those markets, and that viewed alone it would rise to the level of substantially lessening competition, but then you look further, and find that there are substantial gains (which the court found) nationally to competition from the merger, the question is, how do you weigh that.  The Appellants take the position that national benefit can offset regional harm, and the Appellees take the decision that it cannot.  I am not certain, but I think this is unsettled law in the 1st circuit.  If someone has a case either from the Supreme Court or the 1st circuit court of appeals which deals with this head on, I'd love to read it.  My current perspective, subject to being updated with any new information I haven't seen, is that this offset should be considered.  If we look at what is actually going on, and we say that this merger will let JetBlue compete much more effectively with the big 4 nationally, but still block the merger on the grounds of a particular city pair, that seems silly.  Almost any airlines that merge are going to have a substantial presence in the same city SOMEWHERE.  If this means that no airlines can merge, it effectively means nobody can ever effectively compete with the big 4, and we are entrenching that oligopoly in air travel forever.  That seems to be contrary to the intent of the Clayton Act.  I hate relying on policy arguments and I'd much rather have strong case law to point to.  There might be some out there I haven't seen, but I have not seen any for either side of this which is binding on the 1st circuit.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThere's a lot more detail that I could have put in above.  There's a lot more research I could have done too, so don't take everything I've said as certain.  My point is, what I look at when I see this case is a pretty strong appeal on all fronts, and what I see reported and reflected in the stock price is an infinitesimal chance of success, and the two don't seem to match.  Either the reporting and the market are wrong, or I am.  Keep in mind, it could be me.  I've bet heavily on this, but I am not an oracle, and there are no guarantees.\n\nThere are other reasons this deal could fail, beyond this appeal.  We are looking at a hearing in June, and it's possible we don't have a ruling by July 24.  I doubt it, but it's certainly possible.  DoT has its stuff on hold pending that decision.  I doubt DoT makes a final call by July 24.  JetBlue has said they'll waive that provision and move forward and fight the DoT in Court if necessary, but if the DoT refuses to provide a waiver to allow them to operate under common ownership pending resolution of the certificate issue, it certainly gives JetBlue an out to walk away if they decide they want one.  That is something I see as a risk to the deal.\n\nSpirit's financial situation in a no-deal scenario is not great.  It is substantially indebted and losing money fast.  It has mostly beat on expectations, but expectations have been bad. It needs to find a path back to profitability.  It's book value is substantially higher than its current market cap and it has substantial assets, substantial liquidity, and expectation of a pretty big settlement coming its way due to engine issues.  I think it is undervalued now, even in the no-deal scenario.\n\nAt the moment, I'm still accumulating, because I think the market is overestimating the risk of bankruptcy and underestimating the prospects of a successful merger still happening, resulting in an undervaluation of the stock.  That doesn't mean you or anyone else should agree.  Do your own research, or hire professionals you trust to assist you, or do both.  Don't just go by what I said.  I'm someone whose Reddit post you read on the internet, who has told you a great many times that he might be wrong.\n\n3/4/2024 EDIT:  News just broke they are terminating the deal.  This is annoying, because A) I continue to believe they would have won the appeal, B) Assuming that this will result in the appeal being abandoned as moot, it also leaves a very bad antitrust decision intact, and C) this will likely cut off the $0.10/share that Spirit shareholders otherwise would have gotten through the walk away date in July, for seemingly no real benefit.\n\n&#x200B;", "id": "1anm3wg", "created_utc": 1707587788.0, "score": 144, "upvote_ratio": 0.93, "num_comments": 122, "comments": [{"body": "Very well written post. One more positive I would note is that JetBlue has hired a very experienced lead attorney on this - Kannon K. Shanmugam who is widely recognized as one of the nation's top appellate lawyers.", "score": 36, "replies": [{"body": "Yes. He is an absolute rock star. I liken it to having Beard in the UK. If you hire him, you know the other side won't be better represented.", "score": 2, "replies": [{"body": "I saw where he entered an appearance at the district court level but I haven’t seen him listed on any filings before the 1st circuit.  Thoughts?", "score": 1, "replies": [{"body": "He is on the service list. You can see his name on the long list of counsel to be served with a copy of the Order on the Motion to Expedite. I expect him to be very involved in this appeal.", "score": 1, "replies": [{"body": "Thanks, great analysis by the way.", "score": 2, "replies": []}]}]}]}]}, {"body": "The antitrust case is more about politics than about law nowadays", "score": 36, "replies": [{"body": "100%. The top 4 airlines are surely whining to politicians and sending campaign donations their way", "score": 1, "replies": []}]}, {"body": "Also providing some historical context to US airline M&A and the reasons behind their regulatory approval or rejection:\n\n\t1.\tNorthwest Airlines and Delta Air Lines (2008): Approved by the U.S. Department of Justice, this merger created the world’s largest airline at the time. It was approved because it was expected to produce efficiencies and provide consumers with more choices. Concerns about reduced competition were mitigated by the complementary nature of the airlines’ networks, with little overlap.\n\n\t2.\tUnited Airlines and Continental Airlines (2010): This merger was approved with the rationale that it would create a more competitive global airline that could better compete with international carriers. The merger faced scrutiny over concerns about reduced competition and potential fare increases, but was ultimately allowed, under the condition that the new entity would maintain levels of service and slots at certain key airports.\n\n\t3.\tSouthwest Airlines and AirTran Airways (2011): Approved by regulators, this merger was seen as a way to expand Southwest’s network, particularly into smaller domestic markets and some international destinations. The deal faced less regulatory pushback due to Southwest’s position as a low-cost carrier and the expectation that the merger would benefit consumers by providing more low-fare options.\n\n\t4.\tAmerican Airlines and US Airways (2013): This merger faced initial resistance from the Department of Justice (DOJ), which filed a lawsuit to block it due to concerns about reduced competition and potential price increases. However, the merger was eventually approved after the airlines agreed to concessions, including the divestiture of slots and gates at key airports to ensure that low-cost carriers could compete effectively.\n\n\t5.\tAlaska Airlines and Virgin America (2016): Approved by regulators after Alaska Airlines agreed to certain conditions, such as reducing codesharing with other airlines to maintain competitive balance. The merger was scrutinized for its potential impact on competition, especially on the West Coast, but was ultimately seen as beneficial in creating a stronger competitor to the major carriers.", "score": 10, "replies": []}, {"body": "I'm not big on gambling these days, but even I've thought of buying a hundred shares and letting it ride. It would be like betting $670 on red at a casino, but at a 4-1 payout. Neither companies are all that big as far as I can tell, so why block it? Spirit going under hurts consumers more than the merger ever could.\n\nHaving said that, there's no sense arguing logic when politics are at play. Biden dug his heels in on this one for some reason.", "score": 10, "replies": [{"body": "That’s right. And there is no non politicized neutral jury to get it right. It was a single judge the last time and three this time.", "score": -1, "replies": []}]}, {"body": "I’m just confused why everyone is always talking about buying SAVE. They’re both trading at half book value.", "score": 15, "replies": [{"body": "Mostly because if the merger goes through, JetBlue pays $29.85 cash for Save shares, which, once you factor in all the $0.10/share dividends between here and there, is almost a 400% premium to current prices, paid in cash, if the deal goes through.", "score": 33, "replies": [{"body": "Fair point. You’re betting on the merger going through, based on your research.", "score": 10, "replies": []}, {"body": "Do we have any idea what the upside for JBLU stock is tho?", "score": 2, "replies": [{"body": "I mean JetBlue will renegotiate the price for sure now but at least 100%", "score": 1, "replies": []}]}, {"body": "Roughly 350% gain not counting any dividends or gains from reinvesting the dividends.", "score": 1, "replies": []}]}, {"body": "I would assume a lot of people just read The Intelligent Investor or Security Analysis and go hmm massive margin of safety without really considering what’s changed since those books were written. Like deep value non cigar butt plays still happen but you gotta weed through a lotta chaff to find em between the companies that are actually just dog water.", "score": 11, "replies": [{"body": "Value investing is a lot of work, and takes a lot more patience than most people have.", "score": 12, "replies": [{"body": "Yeah, most people would just be better off going pure Bogle or for a factor tilt.", "score": 4, "replies": [{"body": "I’m never going to be as smart as Warren Buffet. My value plays are usually just based on charts and technicals.", "score": 1, "replies": [{"body": "I think you’re wildly overestimating Warren and wildly underestimating what being a 19 year old in the 50’s with 100k from your congressman father gets you. Plus Columbia, and literally knowing Ben Graham. Not that Warren hasn’t proven to be a savvy investor, just that before algorithmic trading and the data accessibility that exists today value investing was like shooting fish in a barrel. Market is muuuch more efficient now.", "score": 4, "replies": [{"body": "I don’t know if it’s more efficient now, but it does move faster which keeps things interesting and creates more opportunity for alpha.\n\nThe Nasdaq had pullbacks of 20% or more every two years since 2018, and the correction in 2016 came close at about 15%. That’s a lot of opportunity.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "What is the relevance of the purchase of nearly 900,000 shares of $SAVE stock by the US Treasury?", "score": 8, "replies": [{"body": "Covid era support from the treasury. Gov has some interest in seeing this higher because they have minimum prices they can sell at.", "score": 7, "replies": []}]}, {"body": "Thanks for the excellent write up! With the latest info, what is your updated gut feeling for % chance of success?", "score": 7, "replies": [{"body": "I'm probably around 70-75% on the appeal but 60ish% on the merger, due to extraneous risks, such as timeline issues.", "score": 4, "replies": [{"body": "If the appeal swings the right way the stock will still skyrocket before extraneous risks show their heads", "score": 2, "replies": []}, {"body": "In the worst case scenario, in which there is definitely no merger, do you still feel the current stock price is a good buy?  I know you stated that the restructuring/bankruptcy fear is overstated in the media.. care to expound on why the company can pull through financially? ", "score": 1, "replies": [{"body": "Yes, and yes.  All signs indicate that a pretty substantial settlement is in the works related to the engine issues. Domestic air travel demand appears to be rising and fuel prices have moderated. They have a strong Order book of Planes, at a time when there is a big backlog on ordering planes, and they are in high demand.  If needed, they could likely flip new planes for a profit, rather than incurring more debt on new purchases.  Interest rates are expected to drop this year, which should be more favorable for debt refinancing.  They have a lot of equity on their balance sheet. Now, if they keep burning money at the current rates and couldn't restructure loans, bankruptcy might be on the radar by the end of 2025, but that doesn't look, to me, like where it's headed.  I don't think this is a $29.85 stock real soon without the merger, but nor do I think it is only a $6-7 stock, rationally valued, even in the no-deal scenario.", "score": 1, "replies": [{"body": "Good points.  The only thing that concerns me is that the factors you cited, other than the engine settlement, help all airlines and don’t allow SAVE any comparative pricing power or reduction in costs.  Meaning continued cash burn.", "score": 1, "replies": []}]}]}]}]}, {"body": "Great post. I have 70k deltas ($1 move, 70k pnl) on SAVE.\n\nRight now the market is basically pricing in 0-10% chance of the merger, I think the odds are higher. Imo it is almost a given that Judge Young's decision will be successfully appealed - it's pretty cut and dry that he didn't use the expected standards and actually set out a new one that doesn't actually make sense (billion to one harm). \n\nI think we need to be cognizant that while the First court might reverse Judge Young's decision and rule themselves, they still might decide to go against the merger. I've reviewed the most recent decision - which I believe is the American/US Airways merger - in forming my opinion. It was slightly different but it was challenged and had points that cover some of the JetBlue/Spirit decision.\n\nThat said, adding to SAVE now has a pretty asymmetric risk profile. So long as they truly become cash flow positive in March, even in a no deal scenario it should trade higher.", "score": 7, "replies": []}, {"body": "This case will be cited for years to come if this decision is not reversed\n\nThe historic ASSASSINATION of Spirit Airlines:\n\nFirst they entered into a proxy war, drained the SPR and caused the rise in oil prices\n\n\nIncreasing energy costs led to an increase in prices of goods and services since every industry uses energy as an input\n\n\nThis led to record inflation which made the Fed raise interest rates to their highest levels in decades\n\n\nULCC airlines like Spirit that operate on an efficiency model rather than a scale model were crippled by high oil prices and borrowing costs\n\n\nWhen they tried to find a way out of this using the only option they had, a merger with another airline, the corrupt clowns at the Biden DOJ decided to fight them in the courts and block the transaction\n\n\nWhat a sick joke!", "score": 5, "replies": []}, {"body": "Well said. I agree with all of this that I understand.   Judge Young's ruling, I think, amounts to shallow thinking. That said, how do you see the new twist of the U.S. Treasury purchasing up to 899,560 shares of Spirit’s common stock? Now that the Gov will get rich on this, is this the payday they needed to let it fly?", "score": 9, "replies": [{"body": "You got that right. Maybe they letting deal simmer. While they find a way to get hands in it to make some money. I’m sure it would be some kind of intricate process. (Shady)", "score": 3, "replies": [{"body": "treasury was in this because of Covid for support. BUT, they can’t sell it for $6. They have price points well above the current price where they can unload. I think $11ish is the first and they go up from there. But it’s also dilution. \n\nBlack rock is increasing share too and imo black rock=fed gov.\n\nAs someone else said, this is political. It’ll happen or not based on those winds, not merits.", "score": 4, "replies": [{"body": "I 1000% agree with it being political!", "score": 2, "replies": []}]}]}]}, {"body": "Can I ask a question? No offense intended..why did you feel the need to mix in so many repetitive disclaimers? Good god..we get it you aren’t a financial advisor giving advice. None of us on here are. No need to be so worried mate! \n\nGood insights though! Enjoyed the write up", "score": 20, "replies": [{"body": "I'm used to explaining things at least three times to make sure they get absorbed once.  Probably a symptom of too many juries and client meetings lol. Sorry about that. I know it can be annoying to people that get the point the first time.", "score": 29, "replies": [{"body": "That is legal speak for \"I am use to charging by the hour\"...  Hahaha...", "score": 26, "replies": []}]}]}, {"body": "Beyond the merger, Spirit is not at risk of bankruptcy and the price isn’t reflecting that. Once that narrative gets put to rest we should be trading at 1.5 - 2X book value like every other airline.", "score": 15, "replies": [{"body": "They've already said they expect to be cash flow positive by March. In addition to their 1.3b in liquidity, PW will compensate them for their engine issues and they expect that to be a source of liquidity in the coming years.", "score": 14, "replies": []}, {"body": "I thought they are reddened with debt from other posts on /stocks. But I am no expert on this", "score": 7, "replies": [{"body": "The other guy is correct based on their recent earnings call.", "score": 1, "replies": [{"body": "Sorry English is not my first language . You mean they are not at risk of bankruptcy or the other way around ?", "score": 2, "replies": [{"body": "No one can say that with certainty but in my opinion they’re not. And let what the ceo said on the call, they’re not. They have a lot of debt but it’s in line with the other airlines. \n\nWhich leads to what they’ll do about it if the deal does get permanently scuttled. Refi if rates drop, frontier airlines deal, raise prices themselves, etc. \n\nThe price reflects the risk but it should probably be more like $12 right now based on break up value.", "score": 1, "replies": [{"body": "The “break up value” you mean accounting for  the break up fee paid by JetBlue?", "score": 0, "replies": []}]}]}]}]}]}, {"body": "You okay?", "score": 3, "replies": [{"body": "I am ok. Thanks for asking.  I am still holding my shares and have bought a few more.  I still believe the company is undervalued and prices will go back up, making my play ultimately profitable.  I am substantially less excited about it now, but I won't sell something at market lows if I think a recovery is in line, so I'm more or less locked in until the price goes back up.", "score": 1, "replies": []}]}, {"body": "It should go through, only way it doesn’t is if corruption (the friends and family of the person blocking the merger are shorting or buying puts on SAVE)", "score": 7, "replies": [{"body": "The Judge was a Reagan appointee, hardly a fan of anti-trust law. He blocked the merger because smaller airlines wouldn't be able to replace the capacity lost by the merger *because they literally can't buy any planes*.\n\n>A bigger JetBlue would have more pricing power over consumers, and thus could think about cutting back on legroom and free WiFi and its other “luxurious” amenities. Meanwhile, Spirit’s famously low “unbundled” fares, where the extra fees it charges for everything makes up half of its revenue(!), benefit all passengers by depressing ticket prices for larger airlines. But if Spirit was subsumed into JetBlue’s fleet, it would likely not be replaced by other ultra-low-cost carriers (ULCCs) like Frontier or Allegiant, the judge concluded. It’s worth going through why he concluded that.\n\n>JetBlue was planning to dissolve Spirit and reconfigure its planes, cutting about 11 percent of all seats in the process (6.1 million seats on an annual basis). That cannot help but raise prices, especially because JetBlue cannot build more planes to fill the gap. JetBlue would have also needed to use $3.5 billion in debt to make the purchase, on top of taking on Spirit’s $4 billion in debt. This would leave the company with a debt-to-capital ratio of as much as 111 percent—which, Judge Young said, was in line with the Big Four. That, incidentally, is why they have to be bailed out at the slightest hint of problems, because there’s no loss-absorbing capital in the system.\n\n>Ultimately, this was why Judge Young blocked the merger. Airline growth is largely impossible given the bottlenecks in manufacturing and workforce. One expert witness for the government calculated that reaching Spirit’s capacity would require Allegiant to grow as much as 757 percent for some routes; its annual growth rate for the last decade has been ten percent.\n\n>Therefore, “although other airlines are likely to enter markets left by Spirit… such entry might not be sufficient to replace Spirit’s current presence in the industry,” Young wrote. Passengers who rely on Spirit would be left out in the cold.\n\nhttps://prospect.org/infrastructure/transportation/01-19-2024-how-boeing-ruined-the-jetblue-spirit-merger/", "score": 4, "replies": [{"body": "This is problematic analysis by the Judge. The appropriate test is not whether Spirit would be fully replaced by a ULCC. This flows from two things. Firstly, full replacement, generally, is not required. All that is required is the ability of a competitor to offset a loss in sufficient amounts such that competition is not \"substantially\" lessened. Again, that is not actual replacement, just the ability. The ability to offset becomes reality if the merged entity in fact raises prices sufficiently to make that entry profitable, which is enough to prevent monopolization. The fact that the relevant market is not cost conscious consumers is also important, because that offset does not then need to come from ULCC's.  Additionally, we should have been looking at other airports in these metro areas as well, and the Judge said as much. This is still applying the wrong legal standard.", "score": 7, "replies": [{"body": "The ability of any competitor to replace Spirit is hampered by an inability to get airplanes", "score": 5, "replies": [{"body": "Replacement, again, is not the standard.  And not all airlines are starving for planes, or if they are, that was not in the record that I saw.  The big 4 have lots of planes.  If you are looking at a city to city pair where JetBlue and Spirit somehow combine for the lions share, THAT particular issue could be offset by American, Delta, Southwest, or United having the ABILITY to enter the market... You will not convince me they don't have the ability to enter a market and compete with what Spirit was doing, without some hard facts to back that up. And those facts would need to already be in the record, since the government is required to have already proven its case.", "score": 4, "replies": []}]}]}]}]}, {"body": "The main reason why you are wrong is that there is no way that the First Circuit, which is heavily composed of Biden and Obama appointees is going to reverse this. This is the worst federal circuit for this appeal. The case is over.", "score": 7, "replies": [{"body": "Noob question. Can hey choose which court to appeal to?", "score": 5, "replies": [{"body": "No. Appeals from the District Court of Massachusetts must go to the First Circuit.", "score": 3, "replies": []}]}, {"body": "Honestly, I'd rather be in the 1st than the 9th if I want the right result from most cases.", "score": 3, "replies": []}, {"body": "Everything is politics and the non biased law is bullshit", "score": 2, "replies": []}]}, {"body": "8,387 shares here, I think it's a pretty safe gamble. If the deal goes through you'll get a massive gain, if not it'll still slowly creep back up", "score": 4, "replies": []}, {"body": "Is there a law prohibiting an ULCC to change its business model to create more shareholder value while, most importantly, assuring its survival? If so, will government subsidize cheap air travel to keep such ULCCs which it forced to remain as an ULCC? If not, can anybody help me understand why even there is such a legal case?  Would there be case if SAVE have increased prices in certain cities before or during the lawsuit? I am not profitable, and it is like I am being told “no, you cannot change your business model”. What was the name of the economic system where such things happen?", "score": 2, "replies": []}, {"body": "United’s 737 fleet alone would be larger than the combined spirit/jetblue airline. All the majors have figured out how to sell bare minimum tickets to fill that gap. They won’t need alegent or frontier to grow at 700%", "score": 2, "replies": []}, {"body": "Would it be possible for the DOJ to suddenly reenter negotiations with JetBlue to allow this merger and ask for some additional token divestitures?\n\nI realize this is unlikely but it's possible that DOJ wouldn't want the appeals court to rule against it and set a precedent?", "score": 2, "replies": [{"body": "Yes, but the DOJ has said that they refuse to do this.", "score": 2, "replies": []}]}, {"body": "As someone who enjoys the WSB side of things more than the traditional investing, what do you think about far OTM calls in August or later? For example the 8/16 $17.5c are only .50 right now, but I'd likely buy closer to June or July assuming no significant news", "score": 2, "replies": [{"body": "I generally prefer to be the one selling covered calls and cash secured puts personally, but there is room for an excellent return if those hit. I wouldn't be selling those on my shares right now. That's for sure.", "score": 1, "replies": []}]}, {"body": "I have zero respect for this 83 year old Judge Young\n\nIn what universe is Spirit going out of business via bankruptcy a better option than the merger for low income families?\n\nJust like the DOJ finally called Biden out on his Dementia, this judgement will be studied in the future as one the dumbest legal decisions in US history. \n\nSame judge gave a group of gang rapists 6.5 years in Boston. Read his history. \n\nThis senile 83 year old Judge Young can go to hell.", "score": 2, "replies": []}, {"body": "Thanks for the detailed post.\nI bought some $10 leaps when the share price tanked to $4 and became interested in adding to my position after learn icahn and soros recently invested in SAVE. They put a decent amount in.\n\nLegaleese aside, I found the blocked merger to be interesting because it didn’t make sense.\n\nThanks for adding some color to my thinking.", "score": 2, "replies": []}, {"body": "Still sane OP?", "score": 2, "replies": []}, {"body": "As I feared, JetBlue called it off. Icahn  probably had a major role in this. A company around $6 per share to be bought for almost $30 is not a small thing.", "score": 2, "replies": []}, {"body": "What if you put the same amount of time and effort into choosing chip companies to invest in this year?", "score": 2, "replies": [{"body": "That would only work if they had something depending on the outcome of a lawsuit, since I mostly try to play in a sandbox I think I understand better than the market. I did put this much effort into buying into Activision, and before that Twitter. Obviously past results are no guarantee of future performance.", "score": 3, "replies": []}]}, {"body": "Ah man - hate to break it to you but this play is over. The judge literally screwed so many people and the merger was a good potential play. At $16 it was like $10 this way or 10 the other way. It’s not tanked ok the crappy response from the judge (which after reading even seems a bit condescending). \n\n“70% to go through and you think it’s less now” - yes of course it’s less - it’s in the realms of 0-5% chance at best getting done. \n\nThis play burnt me pretty bad… this one is over.", "score": -3, "replies": [{"body": "I'd love to hear your legal counterarguments why my analysis is unsound. A general \"you're wrong\" is not incredibly persuasive.", "score": 13, "replies": [{"body": "What you’ve written is really insightful. But the play for arbitrage was during the court case where the SP would have swung up over 50% if the result was favourable. The judge screwed the deal, and screwed a lot of us. \n\nThe aims and options laid out here is sounding more like hopium to get a SP back up. But I don’t think the deal will go through now - especially with how Biden’s guys have f’ed this up. Getting GME vibes of when people post that it’s going to squeeze again… or when other meme stocks were close to bankruptcy - that’s where I think we are in that cycle unfortunately. \n\nI’m not here to sh*t on you and can see I’ve got a bit downvoted but I genuinely think this play is now over. Hopefully you’re bags aren’t too heavy and you can turn it around to a profit. For sure good luck with that :))", "score": -1, "replies": [{"body": "The court case is still ongoing lol", "score": 2, "replies": [{"body": "You mean the appeal to the judge ruling is still ongoing yes. The play itself is fairly dead after the $16 to $6 drop (that was the play fyi - from either $16 to north of $26 or down to bankruptcy effectively).", "score": 0, "replies": [{"body": "You do realize that the price drop makes the play even better in the case where the appeal goes through, right?\n\nAt $16 the downside was \\~$10. Now the downside is hard-capped at \\~$7. The upside previously was capped at \\~$10 whereas now it's capped at \\~$20. Both of those are more favorable now than before.\n\nThe likelihood of the appeal + merger making it through are also lower now (which is why the SP is lower), but OP is making the argument that the odds are better than most people think making the R:R attractive.", "score": 5, "replies": [{"body": ">6ReplyShareReportSaveFollow\n\nThat is pretty much my view. I bought more shares on the downturn following Judge Young's opinion, because before an appeal was filed, it just read like an Order that should be appealed, with an excellent shot of success on appeal. Just objectively, less cases are won on appeal than at trial, so of course the odds have dropped. It is definitely possible that the appeals court finds that Judge Young did several things wrong, but come to the same overall answer on different grounds. That is just not what I see as the most likely outcome here. With this risk-reward profile, I really like this stock. I remain optimistic that my averaging down will ultimately prove extremely lucrative. Only time will tell.", "score": 2, "replies": []}]}, {"body": "No now it becomes $6 to north of $26 or down to bankruptcy", "score": 2, "replies": [{"body": "Ok. Good luck on this one - fingers crossed for you. I’m out as was too badly hit with the $16 down play.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "“When you look at this case, and realize that Spirit tends to operate out of the secondary, less popular airport in most cities (because it is cheaper, has less wait times, etc.)”\n\n\n No they don’t. There are not any markets where this is true of Spirit. They DO fly to smaller markets but do not fly to secondary airports like Allegiant.\n\nWhere this is kind of true is NY where there is flow constraints. They don’t fly to JFK but do fly out of LGA and EWR. ", "score": 0, "replies": []}, {"body": "Thank you!!!!!!!!", "score": 1, "replies": []}, {"body": "Are these questions of law (de novo) or fact (clear error?)", "score": 1, "replies": [{"body": "What legal standard to apply and how it applies to the facts are questions of law. What the judge concluded factually, (weighing credibility of experts and lay-witnesses) are questions of fact. The estoppel/deemed admission issue, however, is a question of law. If estoppel and/or deemed admission issues result in the striking of some expert testimony, that could necessitate a revisiting of some factual conclusions. Market definitions are a question of law, but it is a very fact specific inquiry. I would argue that The Court's choice of geographic market fails as a matter of law under His Honor's factual findings. In general, you have three questions: What are the facts? What is the law? How does the law apply to these facts? Only the first question and its answer are factual issues. (The questions are not always addressed in this order. A lawyer tends to think Law, Facts, Application of Law to Facts.)", "score": 1, "replies": [{"body": "Should anything be inferred from the 1st Cir. granting a motion to expedite when the U.S. filed a motion opposed", "score": 1, "replies": [{"body": "No. Motions to expedite are pretty routinely granted in merger cases with an impending deadline. It doesn't imply an outcome. It just preserves the ability of the court to make a decision before their decision becomes moot.", "score": 1, "replies": [{"body": "Ah gotcha. It remember when the 6th Cir. once declined to grant a motion pending appeal in L.W. v. Skirmetti before it ultimately declined to issue a preliminary injunction that made me think there’s a lot of tea leaf reading to be gained from kotions", "score": 1, "replies": []}]}]}]}]}, {"body": "Great analysis but I think most of what is significant about the case as it stands now isn’t going to be settled on those points. What matters now….? Why did black rock buy so much? Where does treasury what the price of SAVE to be to exercise their warrants? Will DOJ accept some kind of a deal to make this go away? \n\nI’m a bag holder, so personally I’m looking forward to this case being over because SAVE by itself or with frontier seems positive longer term. Since frontier or save alone probably isn’t even a thing until after this new case plays out, I expect the price won’t move much until then. But I know nothing, like everyone else speculating on this.", "score": 1, "replies": []}, {"body": "when is the deal expected to close or when is the judge supposed to make a decision?", "score": 1, "replies": [{"body": "oral arguments are in June so I would bet the decision would sometimes in July", "score": 2, "replies": []}]}, {"body": "What’s your average cost ?", "score": 1, "replies": []}, {"body": "What happens if the appeals court rules for JBLU/SAVE? Can the DoJ then try to appeal that up to the Supreme Court level? Is it likely the appeals court would attach additional divestitures to the decision? Or is it purely just reversing Judge Young’s ruling?", "score": 1, "replies": [{"body": "Unlikely that the DOJ can appeal to the Supreme Court.\n\nI believe the court could reverse Judge Young's ruling + stipulate what they want to see in order for the deal to go through - if I'm off someone please correct me.", "score": 1, "replies": []}]}, {"body": "Man, the other day I was looking for an analysis just like this. I've been considering buying some call options rather than actual stock. Seems like a good play if one doesn't want too much skin in the game.\n\n\nThanks!", "score": 1, "replies": []}, {"body": "[https://finance.yahoo.com/news/carl-icahn-reports-9-91-225440081.html](https://finance.yahoo.com/news/carl-icahn-reports-9-91-225440081.html)\n\nI wonder what impact, if any, will this have on the merger.", "score": 1, "replies": [{"body": "Very interesting.  You think this is may be a positive for the merger?\n\nSave down around 7% today. Seems like a decent time to get in, but also wonder if there is room to go lower.", "score": 1, "replies": []}]}, {"body": "I just want to tell you how much I appreciate this write up! I have been searching the web for an opinion based on law and not on how everyone feels about the merger. I lost a significant amount on thinking that this was a done deal and it hurt. I am a lay person and have tried to look up relevant case law, appeal timing, etc, after the judgement but it’s a little above my understanding and so again, I thank you!", "score": 1, "replies": [{"body": "You're welcome, and thank you for your kind words. It is important to remember though, that if you ask three lawyers a question, you are likely to get five different answers, so don't take my view as the singular correct answer. I have invested substantially according to my view, but will continue to review news and filings and question it until the day the shares (hopefully) are converted to cash.", "score": 2, "replies": [{"body": "Any thought on the recent board change in JetBlue? Do you think it will compromise JetBlues willingness to buy spirit?", "score": 1, "replies": [{"body": "Not sure what impact those will have. I could see a few routes on what Icahn could be planning, but not sure what his current thought process is.", "score": 1, "replies": [{"body": "I have read from elsewhere Icahn is some kind of con artist", "score": 2, "replies": []}]}]}]}]}, {"body": "OP - have you had a chance to read the appeal filed today? Would love to get your thoughts.", "score": 1, "replies": [{"body": "I did. It mostly conformed to my expectations, with two exceptions. They did not contest the geographic market and instead used the limited number of routes at issue as a way to attack the expert testimony that the court relied on from an expert hired by the Government which did not do route by route analysis and really only looked at the National market, which was the market JetBlue wanted. (Concede the Market and argue that the evidence doesn't analyze that market. Well played. I'd have made both arguments, in the alternative, but picking your best arguments is also a viable strategy.)      \n\n\n     Secondly, I'd like to see more on estoppel. That may not have been used because the case that those statements arose from is not final and unappealable, in that American Airlines is still litigating the appeal. Still, I'd probably have mentioned those statements more.      \n\n\n     Overall, although I'd have done a couple things differently, these are largely tactical decisions where reasonable minds can differ. The brief was masterfully done and clearly laid out a strong case that the decision could not possibly have been reached based upon the findings of fact, had the correct test been properly applied.      \n\n\n     There are no guarantees, and the government will get it's chance to respond, but I liked what I saw, and I plan to buy more shares. (As of now I'm sitting at an even 39,000 shares.) I am convinced that I am correct about what the court should do under the law. That doesn't 100% mean the court will get it right.       \n\n\n     Unfortunately, we won't likely know who is on the panel until about a week before oral argument which is expected in early June, and then we can all start digging into the previous decisions, statements, and any scholarly works by the judges and try to feel our what their judicial philosophy is. ", "score": 2, "replies": [{"body": "SAVE is at all time lows. I find it troubling that there hasn’t been any insider buys.", "score": 1, "replies": []}, {"body": "Thank you for the insight. I too have taken a rather large position", "score": 1, "replies": []}, {"body": "Is there a link to where I can read the appeal in full? \n\nI'm in for just under 60k shares now. With calls and some short puts my overall position is equivalent to 80k shares. If I understand it correctly, the next milestone is April 11 when we will see the government's argument and then June when oral arguments are made (is it public?).", "score": 1, "replies": [{"body": "[https://www.courtlistener.com/docket/68202336/00108112879/us-v-jetblue-airways-corporation/](https://www.courtlistener.com/docket/68202336/00108112879/us-v-jetblue-airways-corporation/)\n\nThere's Appellants' brief \\^.\n\nOral argument is open to the public to attend, and is expected to have a live audio broadcast.  A recording is also typically posted to the Court's website the evening of the argument.  I'll probably be listening live.\n\nI am jealous that your position is larger than mine.  I'll be adding, but I will not reach the 60k raw shares that you are at.  Good luck! I hope this goes the right way for both of our sakes!", "score": 1, "replies": []}]}]}, {"body": "Any link to where we can read the appeal?", "score": 1, "replies": [{"body": "[Appeal](https://storage.courtlistener.com/recap/gov.uscourts.ca1.51201/gov.uscourts.ca1.51201.108112879.0.pdf)", "score": 1, "replies": []}]}]}, {"body": "OP- what is the possible up side of August 16 12.5C currently trading 0.6-0.7 range?", "score": 1, "replies": [{"body": "If the appeal is successful and deal goes through on time, without extensions, and without any renegotiation of price, the stock would be transformed into cash at $29.85/share... so those 12.5 strike price calls would go from 0.6-0.7 to $17.35. But keep in mind, things do happen, and with options, if you hold them, they are also much more likely than the stock to go to 0. Its a higher risk, higher reward play.", "score": 2, "replies": []}]}, {"body": "Yikes. What do you think of JetBlue pulling out of the deal?", "score": 1, "replies": []}, {"body": "Sorry I thought I was having a bad day. Take care brother", "score": 1, "replies": []}, {"body": "I am just seeing this post now, so this is going to sound like Monday-morning quarterbacking but here is my 2-cent anyhow.\n\nI think your analysis is heavy on the law but light on the economics of the deal. Namely, it's not clear that JetBlue was ever that thrilled about the prospect of acquiring Spirit, JetBlue's shareholders certainly weren't. Second, the borrowing and dilution that JetBlue would have incurred just to acquire a marginal business like Spirit makes this deal unattractive to begin with. I believe every time there was an update that makes the deal more likely to go through, JetBlue's share price tanked. \n\nWith that backdrop in mind, it's no a surprise that there wasn't a lot of desire on the part of JetBlue to continue the legal fight to the appellate level to try to consummate this deal. As of this morning (3/4/2024) when the airlines announced the deal was scraped, I'm sure JetBlue shareholders were breathing a collective sigh of relief, and probably a few of its executives were too.\n\nCompare this deal to MSFT acquiring ATVI, where the FTC and its European counterparts were also putting up significant barriers to the acquisition, MSFT however had the money and the desire to acquire ATVI, so it fought all the legal battles needed to ultimately acquire ATVI. The same cannot be said for JetBlue.", "score": 1, "replies": []}, {"body": "With the merger off, do you still think this stock has room to grow? \n\nOdd timing, but are the fears of near term bankruptcy an overreaction?", "score": 1, "replies": [{"body": "I think, yes, they are an overreaction.  I don't believe the cash burn will continue as it has recently, and I think the engine settlement will be substantial. I also think lower interest rates will come along before 2025 debt maturities, and this will make it easier to refinance debt.  If I am wrong about these things, that could substantially change the outcome.", "score": 2, "replies": []}]}]}
