{"title": "I sold some META and NVDA", "selftext": "[removed]", "id": "1amxv19", "created_utc": 1707510723.0, "score": 41, "upvote_ratio": 0.79, "num_comments": 76, "comments": [{"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "[deleted]", "score": 460, "replies": [{"body": "You earned the upvote", "score": 36, "replies": [{"body": "lol.  Too soon.", "score": 7, "replies": []}]}, {"body": "THIS\n\nI thought about selling my META (up 60%), MSFT (up 30%) and GOOG (up 18%)  to diversify but then I realized these are all companies I want to hold for a decade yet.\n\nIf I wanted to diversify I'd add more capital, not cut loose winners.\n\nOver the past few years since I started investing I made a lot of mistakes and most of them were chasing some other \"new\" thing.\n\nMaybe you do buy back in to those stocks but unless you see them failing at what they're doing why actually change?", "score": 3, "replies": [{"body": "Held MSFT since 2003….this person above speaks the truth.", "score": 2, "replies": []}]}, {"body": "After such a strong week in the tech industry, it seems very likely that Monday will begin with a slight pullback.  OP could follow your advice and still feel wise for selling some of these same shares today.", "score": 1, "replies": [{"body": "If this happen i’ll try to long NVDA for long term, and some 1 month DTE bull calls", "score": 2, "replies": [{"body": "!remindMe 1 month", "score": 2, "replies": [{"body": "RemindMe! 1 month", "score": 2, "replies": []}, {"body": "I'm really sorry about replying to this so late. There's a [detailed post about why I did here](https://www.reddit.com/r/RemindMeBot/comments/13jostq/remindmebot_is_now_replying_to_comments_again/).\n\nI will be messaging you in 1 month on [**2024-03-09 21:25:22 UTC**](http://www.wolframalpha.com/input/?i=2024-03-09%2021:25:22%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1amxv19/i_sold_some_meta_and_nvda/kpoz49l/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1amxv19%2Fi_sold_some_meta_and_nvda%2Fkpoz49l%2F%5D%0A%0ARemindMe%21%202024-03-09%2021%3A25%3A22%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201amxv19)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}, {"body": "NVDA for sure.", "score": 38, "replies": [{"body": "Sell high, buy back even higher", "score": 3, "replies": []}]}, {"body": "I would just put it in SPY, QQQ, INDA and IWM. About 25% to each of them", "score": 12, "replies": [{"body": "Orrrr 100% in VT or VTI", "score": 9, "replies": [{"body": "Ah yes, the Boglehead route.", "score": 1, "replies": []}]}, {"body": "This is the right answer", "score": 2, "replies": [{"body": "Just get a world etf at that point", "score": 2, "replies": [{"body": "Three of those ETF are based on American companies, only INDA is following Indian market which is expanding rapidly.", "score": 2, "replies": []}]}]}]}, {"body": "Taking profits is good especially in an extended market.\n\nHowever, thinking there are \"safe stocks\" that are better alternatives to the mega-cap leaders here and now is a mistake, in my opinion.\n\nYou sold the two strongest stocks in the market. What more do you want from a stock?\n\nSo many people fall into the trap of wanting to by \"cheap\" stocks. This is a mistake. The leaders at all-time highs are the place to be. You were there, now you're not. Nothing wrong with profits, but you may soon regret taking that $30K right now and putting it into other stocks after a 22% move in 15 weeks, one of the fastest moves in stock market history.", "score": 28, "replies": [{"body": "Brain rot", "score": -3, "replies": []}]}, {"body": "safe? S&P500", "score": 13, "replies": []}, {"body": "I have 2 NVDA and 3 META, should i sell or hold? That’s all i have.", "score": 4, "replies": [{"body": "Hold META. Who knows on NVIDIA.", "score": 3, "replies": [{"body": "Hold everything and don’t look at it for 10 years . You will be so happy you’ll do the same another 10 years", "score": 1, "replies": []}]}]}, {"body": "Congratulations!", "score": 3, "replies": []}, {"body": "Msft, Apple and Google, and LLY", "score": 3, "replies": []}, {"body": "\nNvidia, Microsoft, ASML, NXP Semiconductors, ServiceNow, Intuit, Marvell Technology, Alphabet, your lead cybersecurity companies. \n\nEmphasis on leaders - don’t bottom feed or you’ll end up bag holding during a major correction. It’s tempting because of laggard rotation but don’t play stupid money. \n\nStrength begets strength in the AI Space…it’s expensive, takes years to build profit moat, and in a high interest environment the entry bar is high. This could change if the Fed cuts and new innovators emerge. Wouldn’t discount Musk making a move in the future..that’s the ipo to watch", "score": 4, "replies": [{"body": "You forgot to mention buying meta too", "score": 4, "replies": [{"body": "agree! Thx..", "score": 2, "replies": []}]}]}, {"body": "Take your gains, especially if that orange halfwit gets elected .", "score": 7, "replies": [{"body": "Isn’t he better than the Brandon who was planning on taxing unsold capital gains ?", "score": -8, "replies": [{"body": "Idk, you tell me if 10% tariffs on everything is good for the U.S.", "score": 3, "replies": [{"body": "Sounds like a worse problem.", "score": -2, "replies": []}]}]}]}, {"body": "SMCI and SOXX", "score": 2, "replies": []}, {"body": "$AMZN", "score": 2, "replies": []}, {"body": "MSFT", "score": 2, "replies": []}, {"body": "As off these prices if you sold all no one would call you crazy, it would actually be crazy to continue to hold these prices... ", "score": 3, "replies": []}, {"body": "I would buy it back!!!!!", "score": 4, "replies": []}, {"body": "something cyclical and cheap and near cycle bottom like platinum producers. Lithium too but will take a little while to base out", "score": 3, "replies": []}, {"body": "I like PLTR and TSLA", "score": 1, "replies": []}, {"body": "I sold Meta after earnings. Call me crazy but I am thinking bitcoin next", "score": -3, "replies": [{"body": "Crazy", "score": 18, "replies": []}, {"body": "You cray cray", "score": 4, "replies": []}]}, {"body": "Pypl UPS", "score": 0, "replies": [{"body": "So go from companies that have been a winner to an absolute dinosaur where the CEO is a pump dumper", "score": 4, "replies": [{"body": "Go for companies that make money**", "score": 3, "replies": [{"body": "Meta makes money", "score": 2, "replies": [{"body": "And also volatile. He's asking for a safe long term investment.", "score": 1, "replies": []}]}]}]}]}, {"body": "Banks, fintech stocks, green stocks, solar energy, there’s many sectors currently down a lot", "score": 0, "replies": []}, {"body": "ASTS is gonna announce big catalysts soon and the lowest price all year might have passed. Worth a speculative bet at minimum with some profits.", "score": 0, "replies": []}, {"body": "GME I see a very nice pop after profitable earnings.", "score": -7, "replies": [{"body": "No one cares anymore. It’s over brother. You can move on.", "score": 13, "replies": [{"body": "I'm not saying it's going to have a short squeeze. The fundamentals of the company have greatly improved and they're projected to have a full profitable year. I'm not sure why you wouldn't want to invest in a beat down company that's making major improvements to their business model. No need to down vote I'm just making a statement", "score": 1, "replies": [{"body": "The fundamentals are ass. There’s thousands of companies that are profitable that doesn’t mean anything. It’s not some super growth stock that just passed into profitability. It’s an old retailer fighting for survival and it’s very over priced. I wouldn’t recommend this to my worst enemy.", "score": 1, "replies": []}]}]}, {"body": "I actually back this idea, i shorted it late dec of 2023, closed it only 4 days ago, if they can find some sustainable models of business we can see GME pre squeeze", "score": 1, "replies": []}]}, {"body": "I sold some tech mega caps and diversified in qqqm. Big believer in tech, but don’t want too much concentrated exposure ", "score": 1, "replies": []}, {"body": "SPY and you can sell calls", "score": 1, "replies": []}, {"body": "VICI. When interest rates come down eventually, I believe this stock (and other REITS) will do very well. It might be a year or two before the FED actually starts reducing rates but if you're willing to hold for a while, I think you and other investors will do well.", "score": 1, "replies": []}, {"body": "Avgo\n\nIm not really sure why it isnt more popular? Thats my biggest longterm play.", "score": 1, "replies": [{"body": "Probably cost in comparison to the others. As NVIDIA goes, so goes AVGO generally.", "score": 1, "replies": [{"body": "Sure but it seems like they plan on being a bit wider than nvidia. And cost aside theres still good movement.", "score": 1, "replies": []}]}]}, {"body": "You could inverse the tech with something like oil. Good entry right now for oil for a short term swing trade into summer with annual rotation into that market. Then see where the overall market is at in the summer. Maybe a more favorable entry into something you like, or a fund like VOO ETF.", "score": 1, "replies": []}, {"body": "Disney", "score": 1, "replies": []}, {"body": "Buy the NIFTY 50, spy and qqq, then move on with your day. Markets will always be full  of \"cheap\" stocks or \"undervalued\" stocks, if your not willing to do the research yourself, leave it in the index, it is the fastest and most efficient way of generating standardized returns that beat inflation, or be a degen and buy PLTR.", "score": 1, "replies": []}, {"body": "Apple or u can play with PayPal novodisk arm", "score": 1, "replies": []}, {"body": "I sold all equities too, just one day ago, to cash some.. will rebalance in a bit, for now I'm taking a break.. will likely go for index etfs again", "score": 1, "replies": []}, {"body": "I prefer selling covered calls instead of outright selling shares if it comes to taking profits", "score": 1, "replies": []}, {"body": "Why on earth did you sell them?", "score": 1, "replies": []}, {"body": "Selling winners to buy losers.  Good luck catching that falling knife.", "score": 1, "replies": [{"body": "I made amazing profits on them and i felt it was time to sell them. Nothing wrong with cashing in.  😎", "score": 1, "replies": []}]}, {"body": "The AI bubble is just starting, akin to 1990 we all know its name but none of us knows what it does.  And if all things are relative we should 50-100x the previous total market cap of previous bubble.  NVDA at 10-15k would shock me", "score": 1, "replies": []}]}
