{"title": "Meta sold at $210", "selftext": "", "id": "1ahstv7", "created_utc": 1706954566.0, "score": 86, "upvote_ratio": 0.75, "num_comments": 88, "comments": [{"body": "I sold at 110$, for 65% loss, because I listened to the echo chamber on reddit.", "score": 253, "replies": [{"body": "For this reason, I'm thinking of investing in Disney", "score": 48, "replies": [{"body": "I’m thinking of selling my Disney and I’m a dumbass so honestly you might be onto something.", "score": 25, "replies": [{"body": "Right. Just inverse what everyone here says", "score": 7, "replies": []}]}, {"body": "I bought DIS. Also bought Boeing at $99 when the echo chamber of Reddit said it was going bankrupt", "score": 8, "replies": [{"body": "I don't know where BA is trading today, but think you are smart to have purchased it.  In a few years you'll be glad you did.", "score": 1, "replies": [{"body": "It’s $208", "score": 1, "replies": [{"body": "Smart move.  I would buy it today if my money wasn't tied up in other investments.  I have many of the Mag 7 stocks as long-term holds plus some others I think will increase in value in coming years.  For example I like ENPH and ENVX here, taking a paper loss right now but think both will do well in 3-5 years.", "score": 1, "replies": []}]}]}]}, {"body": "Investing in disney is not worth it. After Tesla’s earning fall I would rather invest in Tesla", "score": 8, "replies": [{"body": "To each their own. Both have taken a beating", "score": 2, "replies": []}]}, {"body": "I’m loading up on Google and Costco don’t care if anybody is saying ITS priceD ToO HigH", "score": 3, "replies": [{"body": "You will never go wrong with Costco…best company in the world.", "score": 1, "replies": []}]}]}, {"body": "I bought at $99.83, but only one share…", "score": 4, "replies": []}, {"body": "I started buying around then. Kept dca-ing until around 230", "score": 1, "replies": []}]}, {"body": "Sold at $273 for a net profit of like $0 after holding it for over a year.", "score": 51, "replies": [{"body": "Samw to same", "score": 7, "replies": []}, {"body": "You belong over with us in WSB land you future Ape.", "score": 1, "replies": [{"body": "I didn’t say I lost money!", "score": 2, "replies": [{"body": "Held for a year and didn't make a dime is the kind of debauchery we love over there!  You are a regarded fellow among friends, I salute you.", "score": 2, "replies": []}]}]}]}, {"body": "Don't feel bad I bought soon after their IPO for low 20s and sold I believe at low 40s. I've since bought it back and made money still but I think about the many stocks I should have just held for the long term", "score": 20, "replies": [{"body": "Oh so you remember when AMD was 2 bucks", "score": 0, "replies": []}]}, {"body": "Crazy to think there are people who 4x'd their money in like 1 year buying a trillion dollar company or whatever it is. And here you are not doing that just like me. :)", "score": 44, "replies": [{"body": "Man if I had a dollar for every time I didn’t pull the trigger on such an obvious no brainer buy that could have 5x my portfolio…..\n\nI’d have like 4 dollars.", "score": 40, "replies": [{"body": "You can’t 5x $0 pal", "score": 8, "replies": [{"body": "Hah. I just browse WSB, im not one of them lol.", "score": 6, "replies": [{"body": "Given the right momentum, you can end up behind the Wendy's dumpster too!\n\n*This is not financial advice.", "score": 4, "replies": []}]}]}, {"body": "Me too. When Meta crashed over concerns about their spending on the metaverse I had a dinner table argument with FIL about how I thought it would definitely recover. So it kinda bums me out to see it so high now. I didn't buy any of course. But even if I did, I would have sold once I was up 50% or something because I'm an idiot. Thank god most of my money is in index funds. The one stock I did buy and hold was Intel. God.", "score": 3, "replies": [{"body": "Lmao. Bro I bought meta at 140 and sold at like 142 🤣 also bought Microsoft. Both at bottoms. But didn’t hold.", "score": 3, "replies": []}, {"body": "I bought it all the way down. Holding it now still and %105 up. Was an obvious bounce back. Same as Netflix, Visa etc.\nI’m assuming Disney will go back over $120 in the not too distant future too. Only takes a couple of good films and sentiment will change.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Okay I’ll rephrase. I thought they were obvious in my opinion. I don’t know one person who cancelled a Netflix subscription and I noticed the content has vastly improved over the last couple of years. I don’t know one person who’s stopped using Facebook, WhatsApp, Instagram and most of my friends with kids bought meta quests recently.\nVisa dropped when Amazon said they’d no longer support it. In my opinion that was never going to last so I bought it at bottom. Maybe it’s wrong but I find investing in what you see in real life and personal experiences over Reddit memes and sentiment to have served me well.\nI do agree that I didn’t think it would bounce as quick as it has though as I also thought there was a recession coming…. I still do :/", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Another thing I see is gambling apps as a good bet (excuse the pun). I’m in England and they’ve been around a lot longer than in US with much less regulation. They’re huge and dominate everything sport related to the point of ruining people’s lives. Most the young people I know will bet on everything. Any football match, boxing, golf etc.\nI feel like that will be something that will grow in America especially as more states latch on to what a cash cow it is for tax.\nI am over %145 up in DKNG currently and I’d expect that to carry on…", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yep, I think they’ll all do well. In England there isn’t really a main company. William hill, Ladbroke, bet365, Coral, Skybet, and many more are all massive", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Same with NVDA!", "score": 3, "replies": [{"body": "Ugh another one I didn't buy. Don't even want to look at the chart.", "score": 1, "replies": [{"body": "Sold at 190\n\nIt’s not at that anymore 😭😭", "score": 2, "replies": []}]}]}, {"body": "I bought at 114 and sold at 345 a year later. I don’t know who was selling at $100 thinking Facebook would somehow disappear and die", "score": 1, "replies": [{"body": "That's exactly what I thought. God I feel dumb for not buying any. It's actually a lesson for me that stocks with a high price per share can experience significant growth under the right circumstances. I felt I had it covered by owning a NASDAQ fund and the big tech stocks are so well represented in it but it seems picking up a stock like meta on such an obvious discount would have been smart anyway.", "score": 2, "replies": []}]}]}, {"body": "Bought 2021 for 324. I am +53%.\n\nBought 2022 for 191. I am +146%.\n\nBought 2022 for 89. I am +390%.\n\nBought 2023 for 285. I am +76%.\n\nI am +123% on all positions. I am holding. Trading is not for me.", "score": 18, "replies": []}, {"body": "Why would you sell right before the short squeeze?\n\nAh wrong sub.", "score": 14, "replies": []}, {"body": "I sold half of my NDVA for 410.00 because all the comments were so negative. Wish I never read them.", "score": 7, "replies": []}, {"body": "The funny thing is the negative narrative about meta - going in the wrong direction, spending too much on stupid metaverse …..all of that is still true. It’s just they cut costs, announced a dividend, and the ads revenue increased because the economy improved.  All the metaverse concerns are still there.  Interesting how narrative moves stocks", "score": 4, "replies": []}, {"body": "Success", "score": 6, "replies": []}, {"body": "I bought at 98 and sold at 145 💀", "score": 7, "replies": []}, {"body": "I remember when bots here were talking sh-i-t about meta and everyone was selling. Such a very expected thing from WSB", "score": 3, "replies": [{"body": "Those weren't bots. Those were just normal clueless people", "score": 2, "replies": []}]}, {"body": "Anybody speaking loudly about how they are proud they sold this stock eatly in the game is just jealous. Meta has is will continue to grow and increase growth.", "score": 2, "replies": []}, {"body": "I have a smooth brain so I just buy and hold until I'm dead.", "score": 2, "replies": []}, {"body": "Success! 👍 now let’s deduct 20% in tax & 5% in transaction fee’s, leaving you with a deficit of -5% on your 20% earnings! 🤘", "score": 2, "replies": []}, {"body": "I sold Meta on Friday. Feeling good about it tbh. I’ll nibble at it 15% lower.", "score": 2, "replies": []}, {"body": "I bought on the dip at like 95 when everyone was crying", "score": 2, "replies": []}, {"body": "That looks like a fake app.", "score": 2, "replies": [{"body": "Indmoney app h bhai why you think all people are like you i also shared the transaction ID", "score": 0, "replies": [{"body": "just thought it was weird it doesnt show the number of shares executed. and it has the fb symbol for meta? weird. meta also consists of instagram and whatsapp and no other app shows a logo for tickers", "score": 1, "replies": []}]}]}, {"body": "I was buying from 338 on mid 2021 to 89 end of 2022 with an average price of 130 or something. Stopped buying when it started going up, did not sell and will not sell for the foreseeable future. Will buy more when I get the chance.\n\nMy goal is buy wonderful businesses at a fair price and hold forever. And if it is being sold for 30% of fair value then invest 200% of your net worth on it.", "score": 4, "replies": []}, {"body": "you did alrite. my coworker bought 300 FB shares at 80, and dumped it all at $120.... and bought Baba, Disney, and Paypal with the proceeds. LOL", "score": 3, "replies": []}, {"body": "I have a question. Please excuse my ignorance. My husband passed away and I am not the stock owners of all his stock. He bought meta a few years ago and we just sat on it. I saw it’s way up from what we bought in for. Would you sell some and keep some or leave it alone? I’m so clueless of what is a good plan.", "score": 1, "replies": [{"body": "I am so sorry about your husband. Experts say when you have a life change don’t make any huge financial decisions for at least 6 months or longer. When I was suddenly single I began following Suze Orman, she is great for the basics. Her current podcast is called Women and Money. No matter what you do, even if you pay a financial advisor I would encourage you to understand the basics. In terms of your Meta stock seems like your hubby made a good choice. It’s on the increase this week and while it may go down it’s not like it’s going to crash tomorrow. So maybe it’s a good time to breathe, enjoy your husband’s decision and invest in you…your knowledge and your emotional health. The most challenging thing is not making emotional decisions around the stock market…the struggle is real for everyone. You can do this. And as you get more familiar with money and investing you will gain so much more control of your life. Just baby steps😊.", "score": 2, "replies": []}]}, {"body": "Sold Meta a year ago and don't feel bad at all.  Metaverse was Billions of dollar flop.  I don't even use Facebook anymore ... just use it as a photo album.  Don't know how this company is worth a trillion.  I have Meta in my growth ETF and that's where it will stay.  I DO feel bad for selling SMCI @ $350.00 😆", "score": -4, "replies": [{"body": "Facebook, Instagram, WhatsApp, Oculus and Threads\n\nMore in the future. Used by billions of people. Vast majority of people on Earth know the name and significant portion of them use their products daily.", "score": 4, "replies": [{"body": "Nope ... don't use any of em 😆", "score": 0, "replies": [{"body": "Doesn't matter, I only use WhatsApp as well, but it doesn't matter what you or me do, it is the masses. My closest bubble doesn't use these often, but most of them have an account too, the wider bubble, all of them have accounts there and use the services daily and that is what matters.\n\nWe sometime get biased by our own thinking. I don't smoke cigaters or anything at all, but if I were to invest in cigarete stocks in my country, I would have skyhigh gains every year. Might add them in the future I guess.", "score": 3, "replies": []}, {"body": "Theyre basically an advanced marketing platform for advertisers and because so many people around the world actually log on to these sites, meta makes hoards of cash from ads.", "score": 2, "replies": []}]}, {"body": "Dividen paying", "score": 0, "replies": []}]}, {"body": "The more people misunderstand their “metaverse investment” (really mainly AI & then AR/VR) the more I think I will continue to make on Meta. When the general public starts to really see what they are building and how these things will intersect into a new platform the sky is the limit for the stock. Cause right now the majority of people think they are just flushing 20 B a year into Horizon Worlds…", "score": 2, "replies": [{"body": "I completely agree. When the metaverse happens which it already is starting too. Meta will look cheap at current prices.", "score": 1, "replies": []}]}]}, {"body": "Bought at $83 back in 2015 haven’t sold so it’s relative because it came back to cost basis after so many years and many people would’ve been upset and sold it out thinking it was done but I hodl and now we are reaping the rewards.", "score": 0, "replies": []}, {"body": "I bought at $153. I'm up around 215%. Some picks I consider lucky, but this, Apple, Google, Microsoft, even NVIDIA are all reasonable holds for the next 10-15 years. If l had money back in 2014 (earlier for all except FB and NVIDIA) I would have bought back then. NVIDIA I first considered buying in 2017 due to the boom in the crypto market, AI, and hardware required for some of the big PC games at the time. \n\nI'm not saying I have any special foresight. I'm just holding what I believe in. I'm down $142 on TSLA now, but I honestly believe the stock can triple within the next five years. Maybe I'll get burned, but that's just part of the risk. \n\nThis is what Buffett and Munger say: Buy what you believe in. Hold, when it goes down buy more and diversify with ETFs/Index Funds.", "score": 0, "replies": []}, {"body": "I have invested at $229>>. And holding... believe now it's there time...Meta", "score": 0, "replies": []}, {"body": "long term people ...", "score": 0, "replies": []}, {"body": "Still holding strong 🙏🏽", "score": 0, "replies": []}, {"body": "Sold nvda at 200 look at it now a damn shame I’m so sad", "score": 1, "replies": []}, {"body": "I started buying FB after the drop post IPO.  Sold a bit a few yrs ago to recapture my initial investment.  Playing with house money now at base of $61.  Up over 900% - woooooo.  OTOH, I have small cap pharma that's down 102%.  So easy come, easy go.  Probably should just go VTI - set it and forget it.", "score": 1, "replies": []}, {"body": "Sold mine at $102 what u talking about lol", "score": 1, "replies": []}, {"body": "https://youtu.be/TPD99tdLby8?feature=shared\nNuf said", "score": 1, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "Are you showing off?", "score": 1, "replies": []}, {"body": "Not bad 💪", "score": 1, "replies": []}, {"body": "Bummer, i thought also on selling after the big drop, everyone said that they spend too much money on metaverse and dont know what to do with it.", "score": 1, "replies": []}, {"body": "Sold NVDA at 263 for 10% profit. Till date regretting", "score": 1, "replies": []}, {"body": "Everyone has stuff like this: I had CRWD at 145, sold at 215; have NVDA at 475 but sold a $550 CC for $40; i had just bought BRKB at 355, sold it at 370; I could go on.\n\nI don’t understand the strength of this current rally.", "score": 1, "replies": []}, {"body": "I bought Amazon apple Microsoft google then later facebook and Netflix. If I listened to the so called nay sayers and so called experts I would have sold many times. I read buffets book in the late 90’s on investing and used his philosophy and bought companies that I believed in and hold. Like Buffet says when the minnows are swimming the sharks are eating. I own alot more stocks and not all have been home ones. But I’m not smart enough to time the market so I buy and hold. I definitely agree if people on Reddit are saying to sell a stock I would look at buying it. But that being said I would never buy Disney. I go back to what Warren Buffet said buy good companies with good management that you believe in.", "score": 1, "replies": []}, {"body": "Yeah I bought calls when it was around 110 a share 🥴", "score": 1, "replies": []}, {"body": "Same smh", "score": 1, "replies": []}, {"body": "I don't even want to look at what I sold Nvida for years ago.  I know It was less than $100, but I won't torture myself.  5 years ago, Nvidia was selling for $35 dollars a share.", "score": 1, "replies": []}, {"body": "Are you happy with that price?", "score": 1, "replies": []}, {"body": "The pico-bottom was when Jim Cramer cried on tv lol", "score": 1, "replies": []}]}
{"title": "Walmart is planning to build 150 new stores. 🚀", "selftext": "", "id": "1ahmc14", "created_utc": 1706930436.0, "score": 88, "upvote_ratio": 0.87, "num_comments": 72, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Imagine having to manage an entire Walmart for $128k", "score": 94, "replies": [{"body": "I worked at Target in high school and the store manager made around 160k. This was in Florida, fairly LCOL. Oh yeah, it was also 2006.  I think Walmart is smoking their customers crack", "score": 57, "replies": [{"body": "Everyday Low Price on Store Manager salaries", "score": 24, "replies": []}]}, {"body": "It’s about all the wonderful people you get to work with and meet in the store.", "score": 14, "replies": [{"body": "It’s about the experience you get. That’s priceless.\n\n/s", "score": 4, "replies": [{"body": "We're *FAMILY* motherfucker!", "score": 9, "replies": []}]}]}, {"body": "Imagine having a PhD and making 50k ![img](emote|t5_2th52|27421)", "score": 10, "replies": [{"body": "PHD stands for Poor Helpless and in Debt", "score": 7, "replies": []}]}, {"body": "$128k average base- 200% bonus is possible. I bet the range is huge too so some store managers making $180k base getting another $360k in bonus. Don’t forget the RSUs as well- another $30k at a minimum, not sure what the average is but it’s not small.", "score": 7, "replies": [{"body": "Damn imagine making a quarter million bonus because you successfully kept a shitload of employees at 31 hours so they’re part time and don’t get any benefits and make fucking nothing. I mean money is great but I imagine the employees would hate you.", "score": 2, "replies": []}]}, {"body": "How much of the workload will go to \"AI\"? Amazon is already using algorithms to handle package routes, performance metrics, and the hiring process for the turn over from firing underperformers.", "score": 1, "replies": []}]}, {"body": "putting everything i have on walmart calls", "score": 26, "replies": [{"body": " MORE STORES = HIGHER STOCK PRICE", "score": 12, "replies": [{"body": "Chill out bro, stop shilling in all caps.", "score": 1, "replies": []}]}, {"body": "They way the economy and inflation is going, everyones gonna be shopping at walmart.  Wholefoods and target out of business.  LEAPS not a bad idea.", "score": 3, "replies": []}]}, {"body": "I see Walmarts EVERYWHERE. Crazy that there is the need for 150 more 🤯", "score": 24, "replies": [{"body": "Well they have to open more to make up for the ones they have shut down/are shutting down apparently.", "score": 16, "replies": [{"body": "And that’s what’s crazy about it cause they apparently had a market for those stores that are shutting down for these new ones to open. It’s this cycle they churn for profit while certain areas become more broke and shut those stores down and other become more affluent and add more. Our gov certainly fucks us on how poor or rich areas become whether you like to believe it or not", "score": 8, "replies": [{"body": "I'm assuming Walmart is going for some type of new concept. We have a newish store in my area that has digital advertisements all over the place and is honestly pretty fantastic looking when it comes to department stores. \n\nWhen I lived in Denver my neighborhood Walmart had half of the store locked up and it looked like they weren't really up keeping anything and just kind of trekking along until an eventual closing day. I worked up in Highlands Ranch which was maybe 10 miles outside of Denver and their store looked like a Nordstrom compared to ours. We also had a Walmart like every 2 miles though in the city so I'm assuming that was part of them not caring. \n\nEveryone wants to act like theft is the only issue behind them closing stores but that doesn't make any sense to me. They went through a lot of work to lock up literally half of the store in my area and it remains open years later. I don't see why they would go to all the effort to do these things when they have like 15 stores in a 10 minute drive.", "score": 1, "replies": []}]}, {"body": "A lot of the Walmart stores in the Portland, Oregon area shut down because of theft.", "score": 4, "replies": [{"body": "That's like 3 stores out of the 200 something that I read elsewhere. Walmart is not shutting stores down solely to theft. Even if they were it really makes no sense. When I was in Denver half of the store I shopped at regularly was locked up, if they are shutting down stores due solely to theft than why are they wasting time locking up half the store? \n\nLogic would tell me that there are clearly other reasons for shutting the stores.", "score": 1, "replies": []}]}, {"body": "How many ma and pops stores have to go out of business around these areas for 150 Walmarts to go in? Crazy how the gov raises prices and living costs under a certain admin until big companies like Walmart are able to swoop in with 150 STORES.", "score": -1, "replies": [{"body": "brother that situation is literally just crony capitalism and places like walmart driving small shops out of business. The small shops cannot compete with walmarts ability to be a loss leader on core items and groceries as small shops are unable to make up for that difference in pricing with other item sales.", "score": 6, "replies": [{"body": "Crony crapitalism is just capitalism", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It’s all relative to how it gets passed down. Don’t worry once Walmart has taken over as one of the very few options to shop at the same price action will happen there as well", "score": -1, "replies": []}]}]}]}, {"body": "The big city urban areas lack them.", "score": 2, "replies": [{"body": "No shot they lack them🙃", "score": 2, "replies": []}]}, {"body": "This is such a weird statement.\n\nIt feels like you’re implying that this is a recent thing. \n\nLike all of a sudden you are just now seeing Walmarts everywhere. \n\nMotherfucker, it’s been this way since like 1999.", "score": 1, "replies": []}]}, {"body": "3/1 spilt Feb 23rd as well", "score": 8, "replies": [{"body": "Intrigue", "score": 1, "replies": []}, {"body": "I am excited.", "score": 1, "replies": []}]}, {"body": "They're following migration trends and building in growing and wealthy suburban areas.  Their grocery pickup is immensely popular and their new and newly remodeled stores look sensational.  Largest grocer in the USA for a reason.\n\nMeanwhile, they're closing urban stores they built in the 90's when attempting break out of the rural areas where they began.  Those stores are smaller, with unfriendly local governments and are beset by crime and shoplifting.  Walmart becomes stronger every time they close one.", "score": 29, "replies": [{"body": "Ok but “sensational”? The only thing sensational at Walmart is the size of the people, lol.", "score": 3, "replies": []}, {"body": "Wow! What a brilliant idea!", "score": 1, "replies": []}, {"body": "Mf really just called a Walmart “sensational”.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Because they have been busy literally CLOSING stores permanently. The only real number I can find is 160 but i don't know over what time period. Last I knew they had shut at least 50 over the past 2 years. \n\nI read this and the first things I thought of was how pretty recently I was just reading about how they were announcing a massive amount of store closures.", "score": 9, "replies": []}]}, {"body": "Start shorting target", "score": 3, "replies": []}, {"body": "Ghetto follows everywhere Walmart opens. Recession imminent", "score": 3, "replies": []}, {"body": "Hell yeah", "score": 2, "replies": []}, {"body": "Yeah I read though that Target is opening 151 new stores so", "score": 4, "replies": []}, {"body": "5 Fingers Discount Mart", "score": 3, "replies": []}, {"body": "They closed like 300 in the past 5 years right?", "score": 2, "replies": [{"body": "its just about the news. it drives the stock price up fam", "score": 3, "replies": []}]}, {"body": "blech.\n\n🤮", "score": 1, "replies": []}, {"body": "Catching up on last week's news?", "score": 1, "replies": [{"body": "or like 1 day ago yeah", "score": 2, "replies": []}]}, {"body": "The same walmart who couldn't keep their shrink under control so they started closing stores like crazy? Wow this post isn't shit at all.", "score": 0, "replies": [{"body": "Yup closing stores that get ransacked to open stores that don’t. Crazy!", "score": 12, "replies": []}, {"body": "You dont understand. All im saying is the news about the 150 new stores drives the stock price up. ive made moeny from this recently. chill out reddit police", "score": 5, "replies": []}, {"body": "They got tired of funding reparations?", "score": 1, "replies": [{"body": "Cool goatee incel", "score": -4, "replies": [{"body": "You mad you didn't get reparations before the Walmart near you closed?", "score": 2, "replies": [{"body": "Go jack off to your gun collection you hillbilly fuck", "score": -4, "replies": [{"body": "Go eat canned fish and wish your father loved you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "That’s weird they just had some locations shutdown few years ago.  \n\nHow they are expanding?  Looks like for deliveries more than shopping locations.", "score": 0, "replies": []}, {"body": "There is a 3% chance you will get stabbed in a Walmart parking lot. AMZN my nicca.", "score": -7, "replies": []}, {"body": "So we'll just ignore the 160 stores they have shut down? Interesting bias we have going on here", "score": -6, "replies": [{"body": "The only thing that matters is the news. it drives the stock up. no political shit", "score": 4, "replies": [{"body": "lol wtf did what I say have to do with politics? There is literally zero politics in my comment and it's literally news. Are you like Walmart PR or something?", "score": 1, "replies": []}]}]}, {"body": "Where?", "score": 1, "replies": []}, {"body": " MORE STORES = HIGHER STOCK PRICE", "score": 1, "replies": []}, {"body": "They're opening as much as they are closing 😂😂 I see a closing every week in the news due to theft or minimal traffic.", "score": 1, "replies": []}, {"body": "Fuck the Waltons", "score": 1, "replies": []}, {"body": "maybe that's their strategy:\n\nput the new stores out in the rural areas, and have the customers come to WMT retail stores, so it cuts down on the need for delivery methods to retail customers...\n\nthen, locate the warehouses for online sales in or near urban areas, where the delivery distances are shorter/easier...\n\nthe rural bricks stores will have a lot less shoplifting than there would have been in the cities...\n\nand the city clicks customers shopping online will also cut out the shoplifting...\n\nso they just shift all their bricks from urban (high shoplifting) to rural (low shoplifting, no need for customer delivery systems)...\n\nand then do their clicks in the cities, where they cut out shoplifting, and deliveries to customers are a lot easier...", "score": 1, "replies": []}, {"body": "Putts on Wal-Mart! Lol", "score": 1, "replies": []}, {"body": "Stock split 3:1 was filed, that's why the price is running. 150 stores requires capital. Sounds like creative marketing to me.", "score": 1, "replies": []}, {"body": "nah oversaturated. Walmart is gonna go bust in 20 years.", "score": 1, "replies": []}, {"body": "They gotta keep up with Dollar General's store count somehow.", "score": 1, "replies": []}, {"body": "The societal parasite expands yet again, I guess they bribed more politicians to allow for the new employees to get onto food stamps ahead of the waiting list.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1ahywrz", "created_utc": 1706974985.0, "score": 159, "upvote_ratio": 0.84, "num_comments": 76, "comments": [{"body": "Profits are profits. \nNicely done.", "score": 142, "replies": [{"body": "That data screwed me up, the way spy moved from 492 to 489 in 5 mins had me thinking we would have a red day and slowly bleed all profits away, wasn’t going to let it happen. They really know how to rig this shit", "score": 27, "replies": [{"body": "Its ok man, you just never know. AMD opened way down and went back up at pre-open. Destroying both the calls and puts. So we need to learn to be happy in profits. We will never catch the exact bottom or top, all we can do is take scraps from somewhere in the middle.", "score": 57, "replies": [{"body": "Wisdom", "score": 4, "replies": []}]}, {"body": "Spread is more volatile at open. But yeah profit is profit try not to let it eat at you, it will only cause you to jump into worse trades", "score": 9, "replies": []}, {"body": "Tell me something how did $3 dollars change your behavior so much? I'm not hating nor trolling. I'm actually curious to know what you thought and how you came to that conclusion. \n\nA bit more about me I don't do options but I do trade (maybe 3 months out) and like you here I have lost on capital appreciation solely on the fact I didn't know what the market was going to turn. Any suggestions would be greatly appreciated. (And yes I know what subreddit this is 🤣)", "score": 2, "replies": [{"body": "Data came out, everything went from bright green to red af, we weren’t supposed to go up with 10y yield spiking 5% yet spy mooned. Something is broken and I was cautious", "score": 2, "replies": [{"body": "I said the same thing with Ally financial last March, lmao. Idk why I thought Ally would collapse further lmao", "score": 0, "replies": []}]}]}, {"body": "Yes, they do. It is why people who write options make money whereas people who buy the contracts lose.", "score": 2, "replies": []}, {"body": "5 minutes made you sell ?![img](emote|t5_2th52|4271)![img](emote|t5_2th52|12787)", "score": -4, "replies": [{"body": "META opened right at his strike. Doesn't take much negative movement to wipe out most of those gains. Can happen in minutes.\n\nSo.... yeah. OP made what we call a prudent decision.", "score": 20, "replies": []}, {"body": "0dte made me sell, if I was smarter and bought 2/9 I would of held to zero or hero but I’m a regard and bought 2/2", "score": 2, "replies": [{"body": "Still made $4200 more then most of the barts including myself on the sub", "score": 6, "replies": []}, {"body": "Yeah I prefer weekly options. Still a great return with much less risk. Been doing very well with weekly spy recently. Nice trade on meta btw.", "score": 3, "replies": []}, {"body": "Even if you bought 2/9 youre still a regard unless you had insider info.  This is gambling", "score": 1, "replies": []}]}]}, {"body": "Could had dropped back down. Hindsight is 20/20", "score": 1, "replies": []}, {"body": "You could set a trail stop loss just saying", "score": 1, "replies": []}]}]}, {"body": "You would have lost that $15,000 in another option play anyway. Nothing loss, nothing gain.", "score": 42, "replies": []}, {"body": "Dude shut the fuck up you hindsight ass pussy", "score": 41, "replies": [{"body": "![img](emote|t5_2th52|4271) you had puts?", "score": -26, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Exactly lmao, although not as large as yours I was up 1600 within 40 minutes and seen nvidia was testing 655 for a while so I just sold what I had . If I stayed in longer I coulda sold for around 3k but still profit is profit", "score": 5, "replies": []}]}, {"body": "Can’t miss what you never had. Godspeed", "score": 10, "replies": []}, {"body": "Wild that this is your take on close to 1000% gains", "score": 10, "replies": []}, {"body": "I sold my NVDA at 10:15 after 5 min of sideways action. I’ve been burned on ODTE too many times it hurts but we made money. Just look at the loss porn on that guy who threw 17k into spy puts.", "score": 7, "replies": []}, {"body": "Take your profits and be grateful. If it was a loss you’d be bitching you didn’t sell earlier.", "score": 7, "replies": [{"body": "Exactly. Ca never be happy looking at the past. At least you got a win", "score": 2, "replies": []}]}, {"body": "Scaling in and out of trades can be a good way to maximize profits rather than going 100 % in or out of a trade all at once.  But, as others have said, the 0DTE gives you very little flexibility in this particular trade case.  Personally, given the circumstances, i probably would took profits too. \n\nIt’s always helpful to review your trades, win or lose, after the fact.  Dissect and analyze to see if you can improve profits and/or limit risk for future trades.  \n\nIn any event, you made a very nice trade and that’s the important take away here.", "score": 3, "replies": []}, {"body": "i was super close to selling at open but i had to ride it out", "score": 5, "replies": []}, {"body": "We can see by the cancellations you tried to hold out but anyway congratulations", "score": 2, "replies": []}, {"body": "Nice. But why not hold a few runners?", "score": 2, "replies": [{"body": "I need the money got a 4k mortgage to pay", "score": 1, "replies": [{"body": "I feel ya. But even leaving a runner and raising your stop loss. Keep that in mind in the future.", "score": 3, "replies": [{"body": "I’m just gonna do 2 weeks out for earnings in the future to avoid this nonsense, I’m typically good about it but I aped into meta at open on Thursday when it started running thinking it would run into earnings instead it just bled all day and had me -65% by eod. Lucky I even turned any profit on this one", "score": 2, "replies": [{"body": "You pick up any META puts to hold over the weekend?", "score": 1, "replies": [{"body": "Got some spy 477p for next Monday", "score": 1, "replies": []}]}]}]}, {"body": "So you had FDs for earnings play with a mortgage to pay? ![img](emote|t5_2th52|4271) yea you’re gon lose the rest.", "score": 1, "replies": [{"body": "Nah I took the gains because I had a mortgage to pay, 4k helps a lot brother", "score": 1, "replies": []}]}]}]}, {"body": "Hindsight is 20/20", "score": 2, "replies": []}, {"body": "Same here OP but instead of Meta I had NVDA calls. The huge miss on non-payroll data really fucking scared me, at open dumped my fucking 640s at a 50% gain, just to see it go from $4 to $22 a fucking contract. Literally missed out on $12k because like you, I just wanted to exit the position. If you can tell, i'm pretty salty about it.", "score": 2, "replies": []}, {"body": "You need to start thinking of what you've gained rather than what you missed... gains are infinitely better than losses in any world except maybe weight watchers", "score": 2, "replies": [{"body": "Oprah is coming after you 😂😂", "score": 3, "replies": []}]}, {"body": "You’re not alone. Better safe than sorry", "score": 2, "replies": []}, {"body": "Yep, I left $23k on the table with AMZN and MSFT..", "score": 2, "replies": []}, {"body": "You needed more monitors.", "score": 2, "replies": []}, {"body": "I missed out on an extra $25k by not selling when it hit $485, but happy I got a dub in the end!", "score": 2, "replies": []}, {"body": "Bro it was a 0dte. In that case we all “missed out” by not buying at the open", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|315|**Previous Best DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Gambling addiction", "score": 1, "replies": []}]}, {"body": "You bet too much.", "score": 1, "replies": []}, {"body": "No one ever lost money taking a profit.", "score": 1, "replies": []}, {"body": "Sell half at the open then wait till later for the other 2 quarters", "score": 1, "replies": []}, {"body": "Nothing to be ashamed of here\n\nWith that job data making rate cuts less likely, and the way the market dumped 2% on a slightly hawkish JPOW suggesting near term rate cuts are off the table, it made logical sense that the market would have a red day similarly\n\nIt’s a reminder that the market is not always logical, and might react to the same news differently based on how the news is spun\n\nMade total sense to lock in profit", "score": 1, "replies": []}, {"body": "As a habit, you were smart to sell at open. Congrats", "score": 1, "replies": []}, {"body": "Tomorrow is another day…", "score": 1, "replies": []}, {"body": "Normally, you should have been in the total red! This pump is simply a short squeeze.", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|31224)", "score": 1, "replies": []}, {"body": "lol this is me with nvidia Friday morning.", "score": 1, "replies": []}, {"body": "Just remember this for next time. \n\nYou can think back and say, wait wait wait, I'll hold and make more! Then it goes down and loose everything.\n\nThen come back and you'll really have something to cry about. Smfh", "score": 1, "replies": []}, {"body": "I bought puts and calls on everything. And accidentally missed meta calls. SMH… 🤦🏽‍♂️", "score": 1, "replies": []}, {"body": "You did nothing wrong! Dolla bills are dolla bills yo! No loss pRon!", "score": 1, "replies": []}, {"body": "Yeah, I left about 60k on the table as well.", "score": 1, "replies": []}, {"body": "Options are cool because there is literally always a way you could have optimized it better in hindsight", "score": 1, "replies": []}, {"body": "You made 1000% return, don’t be so bitter\n\nIf we all played on hindsight we’d all be rich", "score": 1, "replies": []}, {"body": "Idk how many times I’ve lost everything from holding too long", "score": 1, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Seriously try not to think of it like that. You make more money from consistent positive trades than you do from one big trade. +200% is smaller than two +100% trades.", "score": 1, "replies": []}, {"body": "Paper hand wins still beat 🌈🐻", "score": 1, "replies": []}, {"body": "Same here I sold at open thinking no way it would go up", "score": 1, "replies": []}, {"body": "You turned 500 into 5k not bad", "score": 1, "replies": []}, {"body": "Gains are gains. Focus on your haves, not your could haves.", "score": 1, "replies": []}]}
{"title": "SNAP-crash coming soon", "selftext": " p/e(FWD) 249 and earnings per share 0.08$?!\n\n* **Revenue Growth Slows**: Snap's growth is hitting snags, with ad revenue not keeping up due to market challenges.\n* **Earnings Warnings**: Past earnings have disappointed, leading to stock drops. Trends suggest more of the same.\n* **Ad Market Struggles**: Despite AI investments, Snap's revenue isn't meeting expectations in a tough ad landscape.\n* **Valuation Questions**: SNAP's high valuation is increasingly hard to justify given its financial and market performance.\n\nafter META earnings on Friday it saw a 7% rally for (seemingly) absolutely no reason. I kick myself for missing it, i hope it opens higher on Monday so i can load up on puts.\n\nmy targets are going to 14p for 2 week out, i will try to get at least 20 of those bad boys.\n\nis there anything i missed? what do you regards think?", "id": "1ai1izf", "created_utc": 1706981921.0, "score": 87, "upvote_ratio": 0.83, "num_comments": 103, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 week ago\n**Total Comments**|115|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Got it. Full port calls.", "score": 123, "replies": [{"body": "Already have SNAP shares. \n\nI wasn't sure if I should sell covered calls, sell naked far OTM puts, sell shares, or just hold. \n\nNow I know my SNAP shares are good to go. Only reason I don't buy more is because this barely made frontpage. If it reaches top I'll buy more.\n\nTake my energy OP 🙌🙌🙌🙌🙌🙌", "score": 11, "replies": []}, {"body": "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4258)", "score": 11, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "Buying $21 call I am !!!", "score": 3, "replies": []}]}, {"body": "The worst thing is that the market uses this piece of shit company as a barometer for the entire ad market. It tanks every ad tech and midcap ad-supported platform with its earnings.", "score": 55, "replies": [{"body": "Right now Ad market is being propped by Chinese e-commerce companies Temu, Shien and gazillion other knock offs. They make no $$ but are being used by Chinese firms to push all unsold Chinese merchandise from economic slowdown there.. ", "score": 7, "replies": []}]}, {"body": "snap crashes every other month", "score": 47, "replies": []}, {"body": "![img](emote|t5_2th52|27189) puts is free money after friday pump", "score": 25, "replies": [{"body": "I’m hoping this is true", "score": 6, "replies": []}]}, {"body": "If META pump - SNAP pump!", "score": 19, "replies": [{"body": "Look at july", "score": 1, "replies": [{"body": "No", "score": 1, "replies": []}]}]}, {"body": "IV is too high for me imo but a crash def coming", "score": 20, "replies": []}, {"body": "missed meta calls makes this feels like fomoyolo", "score": 18, "replies": [{"body": "my favorite frozen yogurt flavor", "score": 8, "replies": []}]}, {"body": "Confirmation that the sub is full of 40 year old virgins… gen z using snap everyday…", "score": 13, "replies": [{"body": "Where do we get gen z news from?", "score": 3, "replies": [{"body": "Being gen z helps", "score": 6, "replies": [{"body": "What catches the attention of your generation? Mostly idiots wasting their lives following other idiots on socials?", "score": 5, "replies": [{"body": "Yeah if tik tok went public it would be worth a trillion personally not a fan but", "score": 3, "replies": [{"body": "Gotta learn from you. Dumb it down?", "score": 2, "replies": [{"body": "People like unique, consistent content. Legacy media have high budget YouTube videos and no one watches them lol. Then a dude with a webcam on twitch can get more views talking about news in his bedroom.", "score": 3, "replies": [{"body": "Why is that? Are people generally just more interested in being dumb now?", "score": 1, "replies": [{"body": "I’m gen z. I don’t wanna think. All of my time goes into things that allow me to not think. The funny people on TikTok think for me. Snap needs no brain power. All of my money goes to weed, but from an investor side that’s a crap shoot. I guess if you just stop thinking, you’ll have the Gen z experience and make decisions from there", "score": 1, "replies": [{"body": "Wut", "score": 2, "replies": []}]}]}]}, {"body": "Not a content creator so no idea lol just make adhd high speed content go watch a mr beast video lol", "score": 1, "replies": [{"body": "He’s killing it. Yeah. I’ll do some acid & make vids.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Snapchat", "score": 1, "replies": []}]}, {"body": "Literally crashed lol", "score": 2, "replies": []}]}, {"body": "Careful, Snap can come out and say they are implementing AI and reducing their workforce because of AI, and using AI for ads, and say AI and increase ad revenue over and over and the stock will skyrocket. We are in the AI cycle.", "score": 9, "replies": [{"body": "Should I stop jerking off?", "score": 1, "replies": [{"body": "Violently continue", "score": 2, "replies": []}, {"body": "Jerk off with AI", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "How far out? What strikes?", "score": 1, "replies": []}]}, {"body": "tbh im just going inverse snaps been monetizing like crazy and getting all the biggest influencers on the app. They also have dropped the past 4Q so if they were to jump this quarter gains would be huge imo. But good luck ![img](emote|t5_2th52|8883)", "score": 14, "replies": []}, {"body": "Priced in?", "score": 12, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/s/tv60xJQD4N", "score": 11, "replies": []}]}, {"body": "I don't even know that SNAP does or how they make money.  So calls it is.", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "literally doomed company, it’s the next bbby and party city ![img](emote|t5_2th52|4271)", "score": 11, "replies": [{"body": "Shut your whore mouth \"Teddy quintuple reverse merger is on the way!!!!\". Didnt you read RC's childen books?", "score": 3, "replies": [{"body": "-37% for you today, ouchie.", "score": 1, "replies": [{"body": "Had puts, was clowning the towel and popcorn apes 😉. No trash for me", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "-37% for you today.", "score": 1, "replies": []}]}]}, {"body": "Prolly going to go with a straddle. Big move either way is nearly guaranteed", "score": 5, "replies": [{"body": "I want to get straddled", "score": 2, "replies": [{"body": "Sounds personal", "score": 2, "replies": []}]}]}, {"body": "Snap is 💩", "score": 4, "replies": []}, {"body": "Snap is laying off people, what if it also pulls a ‘year of efficiency’?", "score": 4, "replies": [{"body": "Its gonna pump i hope first green Q", "score": 3, "replies": []}]}, {"body": "SNAP acquiring OF…. INteresting… ![img](emote|t5_2th52|4275)![img](emote|t5_2th52|4275)![img](emote|t5_2th52|4275)", "score": 4, "replies": []}, {"body": "I'm thinking the same. ![img](emote|t5_2th52|27189)", "score": 3, "replies": []}, {"body": "So not an earnings play? April 23rd for earnings you just think it's going to sell off in a week or two?", "score": 3, "replies": [{"body": "Its going an earnings play for sure. I just like to buy atleast 2 weks out for all my plays, for atleast a small protection since i dont know how hard it will crash. no one knows if it will go down 2% or 20%. if to goes down 2% rather then 20% it will retain much more of the iv value compared to buying next Fridays puts. so i loose some of the gains of if it crashes 20%, but i protect myself form the potential IV crush of buying a same week put.", "score": 5, "replies": []}, {"body": "Rt", "score": 2, "replies": []}]}, {"body": "Rip", "score": 3, "replies": []}, {"body": "Snaps going > 20$ end of next week.  Mark it", "score": 3, "replies": [{"body": "I dare you to do a ban bet on it ![img](emote|t5_2th52|4275)", "score": 5, "replies": [{"body": "Sorry I don’t bet, I trade options.", "score": 2, "replies": [{"body": "AND THIS IS WHY YOU WILL BE FOREVER BROKIEEEEE 🤡", "score": 2, "replies": [{"body": "https://preview.redd.it/rvof98yh2dhc1.jpeg?width=1125&format=pjpg&auto=webp&s=b58ab4279599e807f7bfc21efd2114411d82a5a2\n\nI’m good, made this on Netflix puts 2022.  Bought mostly dividend stocks but yes options trading has been rough lately", "score": 1, "replies": [{"body": "I remember that day like it was yesterday. I bought 50$ deep OTM puts and I think made 25000% or something equally crazy...still haunts me that I didn't put more money into it. Could have retired then 😭", "score": 1, "replies": [{"body": "Yeah man April 20th 2022 I was in Salem mass for a witch tour, dropped 15k.  Got an alert “Netflix all time low”. Saw it was 290.  I’m like yay I did great!  Woke up it was 250$…. Contracts went from 3.45$ to 50.00….  I took more time off after that lol", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I have a 14 yo daughter…. They don’t even text, it’s 90% snaps…. \n\nTread lightly.", "score": 3, "replies": [{"body": "That's the thing though....Snap used to be the hot new thing, the thing to dethrone facebook....what happened? They failed miserably. They went to aggressively on the young demographic, which at the time was seen as a good strategy bcs (normally) people age and the thinking then was that they would continue to use snap once they get a job and have disposable income to spend on subscriptions or ads....but THEY FAILED! They still have a monopoly on every teen, but as soon as those teens turn around 17yrs old their usage of the app falls down a cliff.", "score": 2, "replies": []}]}, {"body": "Did you buy them puts?", "score": 3, "replies": [{"body": "Of course my guy. Although I should have bought more in high signt og course 😂🤣", "score": 2, "replies": [{"body": "But you had the correct insight and carried out your plan! Enjoy printing money tomorrow🍻😁", "score": 2, "replies": []}]}]}, {"body": "Damn! I should have sold my entire holdings!", "score": 3, "replies": [{"body": "Same. Feeling it big", "score": 1, "replies": []}]}, {"body": "lol. I'm all in now", "score": 2, "replies": []}, {"body": "Snapped is still around?", "score": 2, "replies": []}, {"body": "Snap made sense at one time but it's so easy to copy that its obsolete \n\nWhy would i make a Snap story, send Snap pics or watch stories on a seperate app but I can do that on literally any other major app?", "score": 2, "replies": []}, {"body": "Great play bro", "score": 2, "replies": []}, {"body": "Puts finally paying off", "score": 2, "replies": [{"body": "Finally!!!! 🤣🤣🤣🤣", "score": 2, "replies": []}]}, {"body": "Aged like fine wine", "score": 2, "replies": []}, {"body": "Wait till middle of February", "score": 2, "replies": []}, {"body": "looks like its ready to breakout", "score": 2, "replies": [{"body": "The 1 day chart looks like it's about to bust out of the bull pennant.", "score": 1, "replies": [{"body": "Look at the weekly", "score": 0, "replies": [{"body": "Yeah looks pretty enticing", "score": 0, "replies": []}]}]}]}, {"body": "With negative fcf and 350M stock comp.  Those same share being sold by insider at 14-17$ a month ago. Will short this bad boy on monday. Thx for the money Snap 💰", "score": 2, "replies": [{"body": "Dont tell him", "score": 1, "replies": []}]}, {"body": "This isn’t aging well 💰 my calls doing work son", "score": 1, "replies": []}, {"body": "Snap is still in business? Wow", "score": 1, "replies": []}, {"body": "R we call or r we put", "score": 0, "replies": []}, {"body": "Meta rallied for nothing?  AI talk plus now a dividend?  Thats definitely not nothing.", "score": 0, "replies": [{"body": "I said SNAP rallied for nothing. \nTake the fucking crayon out of your mouth and try to word out what I wrote, perhaps then you'd understand it.", "score": 3, "replies": [{"body": "Oh my bad.  Heres my crayon.  Rising tides raise all ships and it’s a tech stock so of coiryits going to pump off of metas run", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "**Defaulted to one day.**\n\nI will be messaging you on [**2024-02-04 20:59:16 UTC**](http://www.wolframalpha.com/input/?i=2024-02-04%2020:59:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1ai1izf/snapcrash_coming_soon/koscdry/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1ai1izf%2Fsnapcrash_coming_soon%2Fkoscdry%2F%5D%0A%0ARemindMe%21%202024-02-04%2020%3A59%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ai1izf)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Damn I was gonna get puts… it’s calls now", "score": 1, "replies": []}, {"body": "SNAP earnings puts are routine", "score": 1, "replies": []}, {"body": "When do they report?", "score": 1, "replies": []}, {"body": "People still use Snapchat??", "score": 1, "replies": []}, {"body": "Wow this aged well", "score": 1, "replies": []}]}
