{"title": "Why isn't anyone talking about Jeff Bezos' $2 billion share sale?", "selftext": "Jeff Bezos recently announced that he will sell Amazon shares worth $ 2 billion. However, most analysts still say \"BUY\" for Amazon shares, and no one is talking about how Bezos's sales plan will affect the value of the stock. Is this normal? Is a $2 billion share sale an amount to be ignored for Amazon?", "id": "1ap41qk", "created_utc": 1707755432.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 90, "comments": [{"body": "He’s 60 years old and several years retired from an active role at Amazon. He sold 1% of his stake. Why would people be talking about it?", "score": 376, "replies": [{"body": "And he sells a billion every year. To fund his rocket stuff. It’s just not that interesting that he sold more this year", "score": 103, "replies": [{"body": "Exactly. He has to fund both his rockets - one that flies to space and the one that Lauren likes.", "score": 58, "replies": [{"body": "Lmao", "score": 6, "replies": []}]}]}, {"body": "It’s bonkers to think 1% of his stake is worth $2 BILLION!!!!", "score": 13, "replies": []}, {"body": "Headline only readers LOL", "score": 6, "replies": []}, {"body": "Except they are talking about, dunno what op is talking about ", "score": 13, "replies": [{"body": "I'm guessing they probably want to hear what's been said in the daily thread on this, that Bezos has generally picked the right times to sell.\n\n\nBut in all honesty, who cares. Insider buys can tell you more than sells.", "score": 6, "replies": []}, {"body": "Wont someone please think about the children!", "score": 3, "replies": []}]}, {"body": "And his net worth is now around $200Billies", "score": 1, "replies": []}]}, {"body": "Everyone knows it was going to happen.  It’s detailed in their 10k", "score": 41, "replies": [{"body": "This, if a price adjustment was warranted, the bots would have trolled the 10k and pulled the relevant Info.  A price change would have occurred then on the 10k filing.", "score": 5, "replies": []}]}, {"body": "do you expect him to hold all shares until death", "score": 135, "replies": [{"body": "No that’s just Buffett", "score": 20, "replies": []}, {"body": "Pretty much what people want.", "score": 40, "replies": []}]}, {"body": "Because it doesnt really matter 😎.", "score": 12, "replies": []}, {"body": "What are you talking about? I've seen half a dozen articles/posts since before the weekend. They are talking about it...", "score": 13, "replies": []}, {"body": "You missed the bigger news. \n\nIn a separate SEC filing, Bezos listed the proposed sale of 50 million Amazon shares around Feb. 7 with an estimated market value of $8.4 billion.", "score": 12, "replies": [{"body": "Definitely sizable compared to recent disposals, but he still holds like 970 million shares? seems ok relatively speaking", "score": 3, "replies": [{"body": "What’s laughable is Nvidia is worth more than Amazon while being completely dependent on    TSMC to make its chips. How?", "score": 3, "replies": []}]}]}, {"body": "I heard he wants to diversify a bit and put it in VOO", "score": 29, "replies": [{"body": "He’s gonna buy 2billion worth of SCHD", "score": 14, "replies": []}]}, {"body": "He legally likely has to dump a certain amount of shares, usually because he has bank loans coming due", "score": 9, "replies": []}, {"body": "He sells $1B every year just to fund blue origin.  Doubling that is unremarkable", "score": 11, "replies": []}, {"body": "Top people at these companies sell all the time for various reasons. You do better trying to look for insiders buying with their own money. There’s only one reason they buy but many why they sell.", "score": 5, "replies": [{"body": "How to look for insider buyings?", "score": 1, "replies": [{"body": "Unusual activity or someone trading in a way they hadn’t before. Besides other traditional means like informants eavesdropping etc depends if they are being watched to begin with really. Especially right before news that causes the stock increase or decrease sharply.", "score": 1, "replies": []}]}]}, {"body": "That’s 0.1% of the market cap. You think that’s worthy of news or an analyst downgrade?", "score": 3, "replies": []}, {"body": "Bezos is trying to prop up a rocket company and also live a playboy billionaire's wet dream while building his girlfriends in the style of Frankenstein's bride. $2 billion is getting him some pocket change. Buy Amazon.", "score": 3, "replies": []}, {"body": "He’s been using his shares to fund a lot of his space company. My guess is he’s also diversifying elsewhere. \n\nI’ve spent a ton of time looking at insider trades, the only time it’s suspicious is if it’s 3+ more non-patterned trades of a size able amount within the same week. Most of the time execs just need to de-risk their compensation and move it elsewhere.", "score": 4, "replies": [{"body": "Is there somewhere I can learn more? I'm not really experienced in stocks, but I do understand how it generally works but my timing needs improvement so that I get in at the right time. If I could have some of my savings earning for me, getting me that much closer to affording my dream farm home. I see so many turning 10/20x on their trades. I know it's possible !!!!", "score": 1, "replies": []}]}, {"body": "2 billion to a guy worth 200 billion is like 20 bucks to 10 grand.", "score": 8, "replies": [{"body": "Well it isn’t is it.", "score": 31, "replies": []}, {"body": "lol, math is hard, 1% of 10,000 is 100.", "score": 17, "replies": [{"body": "relativity is a thing. bezos could lose 2 bil and it wouldn't hurt him at all. losing 1% of a 10k net worth is actually kinda rough.", "score": 8, "replies": [{"body": "Bingo.  You could say that 99.999% of Bezos' wealth is excess, and that $2B is worth as much to him as a piece of pocket lint is to a man with $10k new worth.", "score": 4, "replies": []}]}, {"body": "Yeah, I suck at math. The general point stands, however. Its peanuts for Bezos.", "score": 4, "replies": []}]}, {"body": "would you like to share my username?", "score": 12, "replies": [{"body": "Wouldn’t you guys have to share full_retard instead?", "score": 8, "replies": [{"body": "I'm in for half. 🤣", "score": 3, "replies": []}]}]}, {"body": "That’s… not how math works", "score": 7, "replies": []}, {"body": "couldnt you at least have done the math on this lmao", "score": 4, "replies": []}, {"body": "It's closer to 2 grand", "score": -6, "replies": [{"body": "Let’s just say $100", "score": 3, "replies": []}, {"body": "Are you stupid too", "score": 3, "replies": [{"body": "Explain how I am stupid, 2b:200b vs 20:2000 it’s the same ratio.", "score": 1, "replies": [{"body": "If that's what you meant you could've worded it better. It sounded like you were saying 2b:200b vs 2k:10k", "score": 1, "replies": []}]}]}]}]}, {"body": "He sold shares for 2 billion and filed to sell more for 8 billion. He is running and spending money on his space company Blue Origin which is a usual cash sink but that company also is in talks to buy out second largest rocket company in the US (United Launch Alliance or ULA), the shares sold will probably go to that purchase.", "score": 2, "replies": []}, {"body": "Amazon’s market cap is $1.8 Trillion. $2B is 0.11% of the total market cap. It’s just irrelevant", "score": 2, "replies": [{"body": "Exactly. If anything the small dip this is providing is a buying opportunity", "score": 1, "replies": []}]}, {"body": "Is this a shitpost?", "score": 2, "replies": []}, {"body": "He needs a little spending money. Just something to carry around in his wallet on weekends…", "score": 1, "replies": []}, {"body": "Because he has another 170bi stacked. 2bi is freaking nothing.", "score": 1, "replies": []}, {"body": "People were worried when Zuckerberg sold a bunch of shares before META earnings. Just because a founder is selling shares doesn't mean they're losing confidence in the company.", "score": 1, "replies": []}, {"body": "It’s to fund blue origin he’s been doing it for a while", "score": 0, "replies": []}, {"body": "If he can give me a small donation of 1mil it would be great", "score": 0, "replies": []}, {"body": "Because the sale is nothing to write home about.  They can sell for any reason.  What you want to do it watch what they buy, as they'll only buy for one reason, and it won't be to lose money.", "score": 0, "replies": []}, {"body": "For that many shares usually they setup a block trade, maybe through the dark pool to minimize the effect on the spot price.", "score": 1, "replies": [{"body": "Yeah, usually when folks like a Bezos sells, they'll do it in a block trade, it's only been Elon that's sold shares on the open market.", "score": 1, "replies": []}]}, {"body": "Someone will buy them", "score": 1, "replies": []}, {"body": "Mostly Envy", "score": 1, "replies": []}, {"body": "He's not running amzn and he's worth 195 bill", "score": 1, "replies": []}, {"body": "Some good points in the comments below. Something to consider:\n\n1. His estimated net worth is over $200B, mostly held in Amazon stock, so $2B in shares equates to about 1% of his NW. \n\n2. He typically sells around $1B in shares annually, to fund Blue Origin. \n\n3 between 2020-2021 he sold roughly $20B in Amazon stock (he’s been donating to charities and his stated initiatives more in his retirement). \n\n4. Amazon is worth nearly $2T; so his sale of stock represents roughly 0.1% of Amazon market cap. \n\n5. Trading volume of Amazon stock represents billions of dollars of trades every single day. So his sale is likely to have little impact on the stock value. \n\nIt’s always important to note when large shareholders divest stock, and it often is in the paper when he makes large divestments. However in this case we more or less know his pattern of doing so, and is clearly unrelated to Amazons performance (which I’m assuming was your concern).", "score": 1, "replies": []}, {"body": "No idea. He knows more than us! He knows CPI results since ever :)", "score": 1, "replies": []}, {"body": "Y’all are missing the local news. Jeff Bezos recently moved from WA to FL likely to avoid WA’s new cap gain tax on the wealthy. He’s going to save 600M+ in taxes. Probably waited until he moved to FL to sell a larger stake.", "score": 1, "replies": []}, {"body": "what’s there to talk about?", "score": 1, "replies": []}, {"body": "I love how people think the stock will absolutely nosedive when this happens", "score": 1, "replies": []}, {"body": "most analysts are saying buy, because they need someone to pick up $2B of shares which Bezos is dumping.\n\n&#x200B;\n\nalways ask yourself, if you're Bezos, when would you sell some? when the stock has crashed and near the  bottom, or when it's at relative nosebleed highs?\n\nalso do not kid yourself for a second, Bezos absolutely has information you don't, most of wallstreet doesn't and probably has a team of people that help advise him on these moves.\n\nwhen Zuck and Bezos sell, I sell.", "score": 1, "replies": [{"body": "Good point. If they are expecting the stock is going to increase more anytime soon, why wouldn’t they wait?", "score": 1, "replies": []}, {"body": "haha what if they (Bezos, Zuck etc..) want you to think that way so they can manipulate the market?", "score": 1, "replies": [{"body": "last time Zuck sold was 2 years ago at the last market top. Chamath from All-In called it out and said \"if you aren't selling now, when Zuck is selling his core holding, you are being irresponsible\".\n\nwas 100% correct, FB went to $80 a share shortly after this.", "score": 1, "replies": []}]}]}, {"body": "The last time he did that the market crashed shortly after.", "score": 1, "replies": []}, {"body": "He sold 2b of the >145b.\n\nMaybe he bought his ex-wife’s boyfriend a small yacht so he could taunt him for having such a small yacht.", "score": 1, "replies": []}, {"body": "He's older guy, he has new GF, he is filthy rich ON PAPER and owns 10% Amazon.  \n\nHe sold  0.1% of Amazon (or just 1% of his holdings).  This means nothing!\n\nWhat would be the point of being  filthy rich if you litterally couldn't ever spend any of it?\n\nWhy anyone would have the expectation that the largest sharehold of Amazon should be unable to sell any of his holdings or utilize any of his immense wealth or it must foreshadow a cataclysmic stock event on the horizon.  \n\nAmazon has no dividend. \n\nIf it did, he would have just taken the dividend but the ONLY way he can utilize his wealth is by selling or borrowing against it. Selling a little at these current interest rates makes perfect sense. \n\nHe also has to put more money into BlueOrigin and his $500m Yacht.", "score": 1, "replies": []}, {"body": "Still a buy.  I order from Amazon almost daily. will be switching to Amazon pharmacy too, what a brilliant idea!! People want convenience", "score": 1, "replies": []}, {"body": "$2 billion is a drop in the bucket compared to Bezos's networth so much people on WSB joked he's selling stock to pay for his next Yacht", "score": 1, "replies": []}, {"body": "Cuz no one cares lol", "score": 1, "replies": [{"body": "I care. You should too. Bezos is the almighty.", "score": 1, "replies": []}]}, {"body": "He's selling Amazon shares to try and buyout RKLB", "score": 1, "replies": []}, {"body": "Because he’s selling to fund his lifestyle and keep up with his obnoxious and probably expensive fiancé, not because he thinks Amazon is going to tank. He’s also openly admitted that he’s burning 1 billion a year trying to keep his rocket project alive.", "score": 1, "replies": []}, {"body": "Is Elon also seling?", "score": 1, "replies": [{"body": "That would be horrible. I keep myself away from tesla stocks just because of that risk lol", "score": 1, "replies": []}]}, {"body": "Moved to Florida before pulling the trigger on it as well, couldn't be bothered with those pesky Washington state capital gains tax.", "score": 1, "replies": []}, {"body": "Purchase of ULA?", "score": 1, "replies": []}, {"body": "Because he moved to Florida to evade paying tax on it", "score": 1, "replies": []}]}
{"title": "NVDA Options?", "selftext": "Is anyone willing to touch NVDA with a 10-foot pole for their earnings next week?\n\nTheir premiums are kind of disgusting right now, wondering if anyone else is thinking about opening some CCS’s like i am lol", "id": "1apdqj5", "created_utc": 1707778678.0, "score": 29, "upvote_ratio": 0.89, "num_comments": 82, "comments": [{"body": "2 quarters ago I got my ass absolutely handed to me with some $350 call credit spreads. So i have a little PTSD with nvda, but I did look at some $870 spreads for next week, seem to be paying some good premium for this risk. But there’s a chance this thing just makes a run straight for $1000 so who knows", "score": 19, "replies": [{"body": "$870 is very close to the money i wouldnt do that", "score": 2, "replies": [{"body": "I wouldn’t call $150 OTM very close, but to be fair it is nvda so I wouldn’t be surprised if it hit it. Although at this point the stock is pricing in tremendous growth already, back at $400-500 this thing was undervalued. So I’m not sure if it will keep going up in a straight line.", "score": 1, "replies": [{"body": "I wouldn't either.  It's around 2 x the expected move in the Feb 23rd ... .", "score": 1, "replies": []}]}]}]}, {"body": "NVDA is selling to all 6 mayor n powerfull companies in the world Apple, Msft, Google, Meta, Amazon n Tsla, n making billions, what else you need to know about the earning…", "score": 30, "replies": [{"body": "Gross margins over 50%. Orders pouring in. No serious competition. Has at least a year of dominance in AI chip market. I still think they pull back with earnings report for maybe a day. Followed by rocketing past 900.", "score": 17, "replies": [{"body": "Then what, though? Probably going to get severely stonewalled at 2T mkt cap.", "score": 3, "replies": [{"body": "The earnings are already priced in. Exceptional earnings are priced in", "score": 4, "replies": [{"body": "Critical Mass hysteria will still push this bad boy to new heights.", "score": 3, "replies": [{"body": "There’s a possibility for it", "score": 1, "replies": []}]}, {"body": "Good point, amidst the hysteria.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I mean, people won't stop needing chips in 10 years but demand will definitely fluctuate more than the market is probably pricing in and i'm not sure why the market has forgotten the cyclical nature of the semiconductor industry- thats what I mean when I say then what.", "score": 2, "replies": [{"body": "Market is starting to think cyclicality won't matter given how high their demand is.\n\nThis is like tesla 2.0, except with the difference that nvda isn't really affected by interest rates, their product touches every industry on the planet (while tesla's evs didn't, unless robotaxis became a thing, which they didn't), and they are selling these chips mostly to defense contractors, governments, and big tech, rather then to consumers (which are all less affected by recessionary environments then consumers are) \n\nTLDR - bullish", "score": 1, "replies": [{"body": "Yea I see the bull case and it could definitely support the current valuation plus more if things pan out, and i'm honestly really curious to see where the market takes it from here, so I'll be looking on eagerly- however I feel like if we are indeed entering an AI chip supercycle, and valuations for fabless design firms skyrocket like they have been, I would rather be on the manufacturing side of this world in TSM. If China does invade taiwan, then aapl, msft, nvda, amd all lose their source of chips, and their premium valuation multiples, as well as the world having the threat of war. TSM already trades conservatively due to the threat of conflict.", "score": 1, "replies": []}]}]}, {"body": "You’re right and what’s better is that their customers are in a war for supremacy. So they’ll keep upgrading every year. This isn’t a case of a company buying $1B in chips once. They’re buying $1B a year and that amount will increase. This is the start not the end.\n\nIt’s like people thinking companies weren’t gonna keep buying software from Microsoft or Oracle.", "score": 1, "replies": [{"body": "To add to what you've said here, this is not the same as the dot com bubble (yet but it could become that) because NVDA has:\n\n1. skyrocketing free cash flow\n2. constantly compressing pe ratio which each new earnings call\n3. low PE ratio relative to some of the PE ratios of other AI companies, and low compared to dot com bubble companies\n\nand to compare to Cisco and also Tesla, NVDA\n\n1. does not make a product that is easily recreatable by competitors (AI GPUs are very hard to design and optimize, while Cisco's internet hardware was pretty easy to become a competitor to)\n2. is selling to major players like world governments, big tech companies, and defense contractors, not to consumers like tesla was", "score": 2, "replies": []}]}]}, {"body": "so much for that", "score": 1, "replies": []}]}]}]}, {"body": "lol I sold my call options last week. I looked at strangle but it’s insane. I think I will sit this one out. Can’t lose my decent gains from it", "score": 12, "replies": [{"body": "I'm with you. How could it possibly trade flat?! But the upfront cost is insane.", "score": 4, "replies": [{"body": "Create an otm calendar spread", "score": 2, "replies": []}]}]}, {"body": "I am doing csp but I'm also buying puts deep otm. I need some protection. If I get 50% gain I'm out. I did it last week and worked pretty well.", "score": 8, "replies": [{"body": "Doing CSP as well - 3/28 675p", "score": 1, "replies": [{"body": "I've been actively trading them, it is just so tempting this week before earnings. I always protect with a spread (sell 720, buy 670)\n\nI just keep entering and exiting positions with the vol.", "score": 1, "replies": []}]}, {"body": "Which strikes/exp did you sell and buy?", "score": 1, "replies": []}]}, {"body": "Was just commenting in another sub that I sold my 2/23 $1000c that I took as a joke, for 200%. That's absurd. I'm watching from the sidelines at this point. Wishing everyone good luck, but it's too nutty for me.", "score": 9, "replies": [{"body": "just wondering why did you buy so far out at $1000?", "score": 2, "replies": [{"body": "to save some upfront cost i would guess, just bought 800$ weekly calls yesterday", "score": 1, "replies": []}]}]}, {"body": "Nope. That tulip is still blooming. When it stops, you'll know.", "score": 9, "replies": [{"body": "Kudos for the Dutch tulip reference!", "score": 3, "replies": []}, {"body": "Then it’s to late", "score": 1, "replies": []}, {"body": "Exactly it will run this entire year", "score": 1, "replies": [{"body": "It could keep going up for a long time. It could trade flat or down and never reach a higher high.", "score": 2, "replies": []}]}]}, {"body": "Don't sell puts near earnings. That's CSP 101", "score": 6, "replies": [{"body": "i was gonna get out this week tho.. got 3 on nvda 645 3.15", "score": 3, "replies": []}, {"body": "Why? Just sell the day of ER if you’re making profit.", "score": 0, "replies": [{"body": "And if you're not?", "score": 6, "replies": []}, {"body": "I will sometimes sell a butterfly then buy back my short legs before earnings so I have a discounted strangle", "score": 1, "replies": []}]}, {"body": "....sell if you are confident on your decision, and be ready for the risk\n\nof loss", "score": 1, "replies": []}, {"body": "Some people like to run with scissors, apparently.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "I've been selling CSPs on SMCI\n\nLove it!", "score": 3, "replies": [{"body": "Expiry, delta, theta?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Stopped selling SMCI puts once it went over 800 cuz no more cash. Guess that saved me \n\nI’m on MSTR and NVDA now", "score": 0, "replies": []}]}]}, {"body": "As a day trade only", "score": 3, "replies": []}, {"body": "They are really strong, more than ever before. But, in my humble opinion, overvalued af. It is not normal grow 50% in 6 weeks. The amount of money that got poured into that company is beyond me and they are just beginning to conquer the market. MarketCap of 1,8 trillion, fuck me sideways. I’m out and have built a small short position. If they are getting bigger than apple or Microsoft I will sell everything I have and short them to the ground.", "score": 3, "replies": []}, {"body": "If I had 70k to convered calls I’d be in it all day", "score": 4, "replies": [{"body": "What about opening a position for your username’s sake lol", "score": 1, "replies": []}]}, {"body": "I bet there is some $ to he made if you can find a real roll over. But idk if its too \"hard\" for me haha", "score": 2, "replies": []}, {"body": "No, I wouldn’t risk it. It is going wherever it goes and I don’t want to get trampled either direction. God speed if you try it.", "score": 2, "replies": []}, {"body": "i would not touch with a 12ft or any other pole\n\ntis the new tsla imo", "score": 2, "replies": [{"body": "why do people compare the two? just because the stock shot up?\n\nyou realize that current PE ratio for NVDA is like 90 whereas tesla's peak it was pushing 1000 at that time?\n\nthe only similarity is that the stock skyrocketed, but you have to ignore fundamentals and growth prospects to call them the same thing...", "score": 1, "replies": []}]}, {"body": "I wouldn't take a bearish position on NVDA. OI and GEX continually rolls up each week, skew is pointing up. This morning in the middle of that huge selloff, NVDA continued to push up from the gap down in the middle of the storm. I've never seen anything like it. Maybe AAPL at some points in the past but even then it never had the same strength.\n\nI think the biggest question is whether the beat on earnings is already priced in and it sells off after ER. Even if it does, it will find a bottom and start heading back up after. This is a pattern that MSFT, GOOG, and AMD all followed earlier this ER season. I wouldn't be surprised if NVDA does it too. \n\nI will be flat for ER.", "score": 2, "replies": [{"body": "i tend to agree, a big earnings beat is priced in. they will probably beat, raise guidance again, the market will dislike that they didn't beat by an insane margin, the stock will drop to low 600s, then it will consolidate and we'll hit a new ATH by june/july, and it will end the year at 1000+", "score": 1, "replies": []}]}, {"body": "I really reminds me of TSLA at its peak when it was rocketing to 1300 per share pre split.  Everyone online talking about expected earnings and future growth and not just a car company and forward P/E etc etc etc\n\nI dont know what NVDA is fairly valued at.  Do I think it should be worth more than Amazon and Google? Probably not.  \n\nI would play far far OTM calls based on laws of diminishing returns and its insane 2T market cap currently, makes me think adding another trillion to that is even more... unrealistic? But tread carefully.  I bought back 595C's i sold naked the same day for a few dollars in profit for no other reason than I didn't feel comfortable with the trade the second I made it and was lucky to save myself tens maybe hundreds of thousands as it blew up.", "score": 3, "replies": [{"body": "TSLA PE at the time of peak was pushing 1000\n\nNVDA PE currently is \\~90-100\n\nTSLA was mostly just a car company, with high profit margins at the time, but their explosive demand in 2021 was from global conflict bringing up gas prices.\n\nNVDA does not have those same issues.\n\nTSLA had interest rate risk since they mostly were selling directly to consumers, and through loans, not companies.\n\nNVDA doesn't care about interest rates, since they sell to gov contractors, defense contractors, and big tech, all of which have ample cash to buy their chips.\n\nTSLA had a product that a niche portion of consumers wanted, companies didnt care because it wasn't revolutionary\n\nNVDA is selling chips to massive organizations and their chips affect literally every industry on the planet, minus maybe a couple.\n\nThis is not the same. There are two bear cases for NVDA, which are basically 1. competition will enter and push margins down (which happened to tesla), which is unlikely given their lead, and its a lot easier to make EVs when you already make cars, then it is for basically the only two competing companies which are AMD and intel, both of which are way behind due to CUDA, or 2. AI doesn't amplify revenues enough to justify the large chip cost, which imho is unlikely. AI is only going to get better and better as chips get better and better, and we are absolutely in an AI gold rush right now. \n\nAnd you know what they say about gold rushes. Invest in the shovel sellers.", "score": 4, "replies": []}, {"body": "NVDA ceo is focused and engaged, and isn't dumping billions on the open market every few months because they are trying to buy the social media site they are addicted to...  so shares aren't likely to crash 75% in a little over a year", "score": 3, "replies": []}]}, {"body": "I bought $720 C 2/16 when it went red today.  Bought at $13.75 and sold 10 or 20 minutes later at $16.75.   \n\nI have other long calls for 6 and 9 months out that I don’t worry about too much.  But letting a weekly call ride overnight can be unsettling.", "score": 1, "replies": [{"body": "Wrong sub, thetagang and this post are about selling options", "score": 6, "replies": []}]}, {"body": "If I could afford it lmao", "score": 0, "replies": []}, {"body": "Sold some puts expiring friday today.  Just getting that income.   Staying away next week", "score": 1, "replies": []}, {"body": "I don’t have the $70,000 for a csp sooo nope. Might buy a call though.", "score": 1, "replies": []}, {"body": "I'll sell puts on it all day. But nvda is one I'd prefer to buy options on instead of sell. You don't want to take a credit when it's moving 10+% in a week", "score": 1, "replies": []}, {"body": "90% IV", "score": 1, "replies": []}, {"body": "Idk but the 1000 calls I bought for 0.15 are up 1900%. Been slowly scaling out as we continue running up gonna leave that last 10% on into earnings. Some things are simply too dangerous for retail and you should know your limits.", "score": 1, "replies": [{"body": "In a more constructive comment. Maybe look to other historical parabolics and see if there was a way to have played them without getting run over", "score": 1, "replies": []}]}, {"body": "They have a monopoly. It’s game over for everyone else.", "score": 1, "replies": []}, {"body": "Maybe sell not buy", "score": 1, "replies": []}, {"body": "Is 750 by friday possible?", "score": 1, "replies": []}, {"body": "I might sell call credit spreads and accept I can take max loss", "score": 1, "replies": []}, {"body": "If you are looking for a gamble I’d buy a couple of 5 delta IC’s 30-45 DTE and see what happens. No way ever would I be selling a contract.", "score": 1, "replies": []}, {"body": "I have some out to march, but way OTM, like <500 strike", "score": 1, "replies": [{"body": "I sold them to you so thank you for being a buyer", "score": 1, "replies": [{"body": "This is thetagang, you bellend. I sold them just like you.", "score": 2, "replies": []}]}]}, {"body": "expectations will be sky high, its always a gamble", "score": 1, "replies": []}, {"body": "I sold a $600p with 3/15 exp that I plan to hold through earnings. My thinking is that this earnings report with show that NVDA currently doesn’t have any competitive threats and that the stock will go up (maybe not immediately because I agree that earnings already priced in).", "score": 1, "replies": [{"body": "most likely they will beat earnings, the stock will drop to low 600s and then it will slowly grind upwards and the third earnings report this year will propel the stock to 1000", "score": 1, "replies": [{"body": "Yeah, could see that scenario. I think the biggest unknown with NVDA is stuff that could affect the entire market and take NVDA down a ways too. Such as geopolitical events, China invading Taiwan, US presidential election, etc. I’m sure hindsight will be 20/20.", "score": 1, "replies": []}]}]}, {"body": "I like shorting NVDA 700P 3/1 -- $31 for a $28 OOM option.\n\nmy break-even point would be a -8% move", "score": 1, "replies": [{"body": "i mean if you're that bullish then fair enough but a -8% move for a stock that went +40% in a month isn't that unlikely", "score": 1, "replies": [{"body": "beats owning the stock", "score": 1, "replies": []}]}]}, {"body": "Everyone here seems to not want to touch but I’ve also read here that IVR/IV set up on something like this is ideal to sell CSPs. \n\nIVR 96/ IV 63\n\nIs it just because of the crazy outsized earnings moves monsters like this can make?", "score": 1, "replies": []}, {"body": "I did… might be a mistake…", "score": 1, "replies": []}, {"body": "I will think about playing, but won't be playing it directionally.  To me, earnings plays are put on solely to take advantage of IV contraction and little else.\n\nIf I do grow some balls, I'll look at using the Feb 23rd expiry with its 100.3% IV, after which it contracts to 80.6% in the March 1st, 71.2% in the March 8th, 65.5% in the March 15th.\n\nCurrently, the Feb 23rd 627.5/647.5/860/880 is paying 6.00 and BPE of 14.00 with the short option legs camped out at about 2 x the expected move.  42.9% ROC at max; 21.4% at 50% max, 641.5/866 break evens.\n\nSince it appears to be somewhat inclined to gyrate around (it closed -12.42 on Thursday), I'll probably wait until sometime Wednesday (the 21st) to consider putting something on.", "score": 1, "replies": []}]}
