{"title": "$TSLA Daily Investor Discussion - September 12, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "d358zd", "created_utc": 1568279518.0, "score": 23, "upvote_ratio": 0.96, "num_comments": 156, "comments": [{"body": "Just $10 off reaching my average price. Which means we're $9 off another tanking.", "score": 21, "replies": [{"body": "Lol so true", "score": 3, "replies": []}]}, {"body": "hopefully we continue the momentum.", "score": 15, "replies": [{"body": "I hope not. Not sure why people are happy to see the stock go up. I rather see it stay low, so I have more time to accumulate at these ridiculously low levels.", "score": -9, "replies": [{"body": "> Not sure why people are happy to see the stock go up\n\nDon't be obtuse, this is a subreddit dedicated to people who want to make money off Tesla's stock... almost entirely from the long end", "score": 6, "replies": [{"body": "Me too. The more the stock price is disconnected from what it's actually worth, the more money that can be made off of it.\n\nWould you rather pay me 10 cents or 10 dollars for a 100$ bill?", "score": 1, "replies": []}]}, {"body": "Maybe because they also want to sell some of it one day??? Because they have been long with TSLA already unlike you? :D", "score": 5, "replies": [{"body": "Have been holding for over four years. Wouldn't sell today for 1000$, probably not even for 2000$. Will probably hold until 2030 or so at least.", "score": 6, "replies": [{"body": "That's why he's talking about momentum and not the final price. But good for you!", "score": 1, "replies": [{"body": "If we're talking about the company executing and transitioning the world to sustainable transport, then yeah the more momentum the better.", "score": 2, "replies": []}]}]}]}, {"body": " make money off volatility and some people want to be back in the green", "score": 4, "replies": [{"body": "Why would you care about being in the green? If you're bullish on a stock, low stock price > high stock price until your thesis comes to fruition and you're looking to sell. Way too early to sell TSLA imo. Maybe 2nd half of next decade I'll start to consider selling some shares.", "score": -2, "replies": [{"body": "maybe you might enter life circumstances where you need the money and want to take profit. maybe you have a different investment you want to make idk even just someone's mental health knowing they haven't lost money", "score": 1, "replies": []}]}]}]}]}, {"body": "Which one of you dumped their load once we hit $250? Hm? Admit it, we will be gentle.", "score": 12, "replies": [{"body": "I forgot I even had a $250 sell order on 20 shares. I’m sorry.", "score": 8, "replies": [{"body": "This guy here officer, yes, him.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I can't really understand why you and /u/siege342 would have a sell order at 250 but in the long run, that should be punishment enough for the both of you ;)", "score": 5, "replies": []}, {"body": "You murderers of the soaring price. It surely isn’t those high-rollers dumping hundreds of thousands, it’s you peasants!!!", "score": 3, "replies": []}]}, {"body": "Need to get it to 260 to dump half and average down.\n\nUnfortunatelly, the first buying opportunity I had was right before Q2 results so I got screwed hard :D", "score": 1, "replies": [{"body": "If it closes above $266 it should run higher. Selling at $260 means you're confident it won't :)", "score": 1, "replies": []}]}, {"body": "I sowwy.", "score": 1, "replies": []}]}, {"body": "Have you guy see the battle of $250? Once it reach $250 there is immediate 1m column share knock it down. Holy", "score": 12, "replies": [{"body": "1m, bloody hell. Someone was trigger happy, just waiting for 250.", "score": 3, "replies": []}, {"body": "Macro off the fake news reported earlier", "score": 0, "replies": [{"body": "What fake news?", "score": 1, "replies": [{"body": "I'm forgetting what it was, the market spiked off some tariff talk an interim China deal, then I think Bloomberg mentioned something about it being false that the senior white house offical denied", "score": 1, "replies": [{"body": "The china \"deal\" will happen about 3 months prior to election. It should convince people to vote for trump. And the worst is, it might even works.", "score": 1, "replies": [{"body": "Why on earth would China agree to something 3 months before Trump is probably gone?  Trump would be taking a bad deal if it's 3 months before election.\n\nAfter the election, China can get a better deal as dems eager to make Trump's trade war look dumb take whatever they can get to end it.\n\nI mean, there's always a chance he could be reelected but... the number of people I know who \"woke up\" to politics after Trump got elected is staggering.  And that's in Texas.  I don't think it'll be the same.\n\nHonestly, I'm kinda worried he denies the election result and claims some kind of cheating and refuses to leave.  It would most fit his desired narrative. \"No way I lost fairly, they had to cheat\" He'd have non-majority but still substantial support if he did that.  Could get ugly.", "score": 2, "replies": [{"body": "My theory is Trump will take the deal - no matter how bad - to get votes. Dems may want to show that trump's trade war was dumb af and they MAY take a weak deal too but maybe not. Whose deal would be better is china's gamble and they have Trump pretty desperate as is...", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Ok this has gone on long enough...  I think we need /u/ajdude101 to step in and save the day\n\n*batsignal: on", "score": 10, "replies": [{"body": "How is it that you get 8 upvotes and he gets 8 downvotes? Does conserving vote balance help Tesla's margins or something? lol", "score": 2, "replies": [{"body": "it's even weirder considering that his comment is right above this one... it couldn't be more obvious, right?", "score": 3, "replies": []}]}]}, {"body": "I like Troy's hypothesis for GA5: \n\nBased on reading between the lines in Tesla conference calls, I think the General Assembly Line #5 Tesla is building at Fremont is a more automated version of the current Model 3 production lines that is also capable of producing Model Y. I'd expect all existing Model 3 prod lines to switch to this new 3/Y line. This will improve margins for Model 3. It also means all the design improvements they have come up with for Y (less wiring, fewer parts etc) will also apply to new Model 3. That's how it looks to me.\n\nhttps://twitter.com/TroyTeslike/status/1172107287172976640", "score": 11, "replies": [{"body": "I would think two hybrid lines are slower than a dedicated 3 and a dedicated Y line. Not having experience makes this hard to guess. There are other advantages to being flexible in that way though perhaps.\n\nBringing model Y design features back to the 3 is a pretty bold call.", "score": 1, "replies": [{"body": "Think of it this way....\n\nLine 1 - Jan Model 3, Feb Model Y, March Model 3...\n\nLine 2 - Jan-March Model Y.\n\nI think they can build in batches and the batches can be big, correspondingly time to switch is to that significant if it happens rarely and they have sufficient practice. \n\nI'm expecting the Model 3 body parts reduction and wiring harness to eventually make it into Model 3, but only after Model Y is fully ramped up.... the reason being it will improve margins...\n\nIn fact my hunch is by around 2022-2023 they may move Model S/X production out of Fremont and add a 3rd Model 3/Model Y line.", "score": 2, "replies": [{"body": "I also like Troy's hypothesis.\n\nI think Tesla will build new lines (not only GA5, but also body construction, paint shop, etc.) to be of 3/Y dual-use. The new lines will produce Model 3 first. Then, taking advantage of the seasonaly lower demand in 1Q, they can retool the existing M3 lines to the newer and better method. By the end of 2Q, Tesla will have lower cost Model 3 lines, 1K/week Model Y, and enough learning to replicate this new way of manufacturing in Giga Shanghai.\n\nIt makes sense that Giga Shanghai should take over production for Europe as soon as that can happen. Fremont only needs to handle the US/Canada. So flexible lines at Fremont to respond to unpredictable demand mix shift is something quite valuable for Tesla.", "score": 2, "replies": []}]}, {"body": "Having two dedicated lines for 3 and Y should be easier, faster and less troubles. This is especially true if they have demand to keep both lines busy. If demand mix is hard to predict, then it's better to have flexibility to switch production.", "score": 1, "replies": []}, {"body": "Why would a combined 3/Y line be slower if everything that goes into both 3 and Y is exactly same? For example, a machine installing seats can be instantly switched to work on Y from 3. Combined line may not switch between 3 and Y hourly but probably every few days - say, work on m3 for 3 days and then work on Y for 5 days.", "score": 0, "replies": [{"body": "It's hard to imagine why it would be faster, right?", "score": 1, "replies": [{"body": "They want to use all the learnings from existing lines in a new line with minimum capex. It ought to be faster and more efficient than any of the existing lines.", "score": 1, "replies": [{"body": "Pretty sure he’s saying why that particular line would be faster combined than if it did 3/y exclusively.", "score": 1, "replies": [{"body": "I see what you mean. \nCombined lines would not be slower than exclusive line considering how similar both cars are. Single robot can be trained to do the same task slightly differently. Switching between 3 and Y would be like flipping a switch. And the human operated task will also be exactly same for both cars.", "score": 1, "replies": [{"body": "So although I have no experience with manufacturing, it seems to me that there’s no way that a combined line could be faster than an exclusive line. Can it be the same speed? Maybe but I don’t know enough to say that conclusively.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They are doing basically the same as VW (or visa versa) Only the frame and the interior of the Y is different. All the technology under it is the same.", "score": 0, "replies": []}]}]}, {"body": "Potential NEW dieselgate schandal from Volkswagen with Euro6 diesel engines incoming...\n\nhttps://www.tagesschau.de/investigativ/swr/vw-abgasskandal-157.html\n\ncan only find German sources on this so far, so we'll have to do with crappy translations\n\n> Specifically, it is about the VW engine series EA 288, the successor of the engine EA 189, which was at the center of the first diesel scandal. The follow-up engine has been installed since 2012 in hundreds of thousands of diesel vehicles of the group - including the Golf, Tiguan or Passat. Also with different models of Audi, Skoda and Seat this engine is used.\n\n> In internal VW documents of the department of technical development of the end of 2015 is described in detail how the so-called \"cycle detection\" works on this engine. Under cycle recognition experts understand a software in the car, which recognizes whether an exhaust gas test is being carried out. Such a software was also installed on the vehicles of the first \"diesel scandal\".\n\n...\n\n> The exhaust expert Axel Friedrich, who had uncovered the first diesel scandal and was an expert in the diesel investigation committee of the Bundestag, comes after review of the VW documents to the result that even with the engine EA 288 is a defeat device. \"The vehicle detects whether it is on a test bench - only then is sufficient AdBlue injected, whereas in normal driving on the road much less AdBlue is used.\"\n\n> In fact, the VW documents also contain a \"description of the SCR dosing strategy in the cycle and outside the cycle.\" SCR stands for catalysts in which urea (AdBlue) is injected for exhaust gas purification.   \n\n> Because of possible violations in the AdBlue injection are currently under investigation by the European Commission - against VW, Daimler and BMW. According to a provisional assessment by the Commission, the manufacturers have agreed \"with the common understanding that they thereby limited the AdBlue consumption and the effectiveness of the emission control.\"\n\n...\n\n> In the procedure before the district court Wuppertal an appraiser was assigned to evaluate the engine EA 288. According to the ruling on the issue, the question is whether this model also includes \"software that detects whether the vehicle is on the test bench for driving through the new European Driving Cycle (NEDC).\"\n\n> Software with this feature is described in the technical VW documents available to SWR . According to the district court Wuppertal, however, it could take months before the report is available.\n\nseriously, fuck these guys", "score": 28, "replies": [{"body": "This is a good thing and will speed up EV adoption", "score": 6, "replies": [{"body": "People, politics and judges here in Europe don't seem to care much. They got away witout doing anything the first time. We are litteraly just breath in their shit.\n\nFucking retarded.", "score": 1, "replies": []}]}, {"body": "Volkswagen We: We Share, We Deliver, We Experience, We Charge, We Park, We Cheat", "score": 3, "replies": [{"body": "fixed it for you:\n\nVolkswagen We: We Share, We Deliver, We Experience, We Charge, We Park, We Cheat, WE GET AWAY WITH IT(*)\n\n(*) at least in Europe", "score": 8, "replies": [{"body": "Thanks. Also forgot to mention the popular We Lie app.", "score": 1, "replies": []}]}]}, {"body": "Literally, crimes against humanity.", "score": 1, "replies": []}]}, {"body": "This volume is insane...", "score": 7, "replies": [{"body": "It really is. And there's no real clear direction to it. Like 50% of people are taking profits and 50% are buying more", "score": 3, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "haha. that's true I suppose. But generally there are more of one group than another so the price moves. Today it seems freakishly even. Up 40 cents, down 40 cents. Up $2? Down $2. For such a huge volume it's strange how little the share price has actually changed", "score": 1, "replies": []}]}, {"body": "Any bit of news in either direction will cause another jump or tumble.", "score": 2, "replies": []}, {"body": "Consolidation. Yesterday was quite a run up.", "score": 2, "replies": [{"body": "Definitely. I was expecting a $5 pull back for profit taking. I'm pleasantly surprised it's holding as well as it is", "score": 2, "replies": []}]}, {"body": "🤔", "score": 1, "replies": []}]}]}, {"body": "Short interest posted. It went... up. \n\n39.7M shares\n$9.76B", "score": 10, "replies": [{"body": "Which is actually great news for bulls...and shows the the stock likely has more room to grow in a month:\n\nIf the delivery report / earning is good, and can mostly defeat the demand / asp issues (or one of them), one may see a repeat of 18Q3 in a even more epic scale.\n\nIf the delivery / earning are within expectation and keeps the demand / asp doubts largely in check, shorts will be unable to push down the stock either.\n\nBetter to keep a close eye on delivery status from now til delivery. So far it is on track to beat Q2 handsomely from all sources we can see.", "score": 13, "replies": [{"body": "Couldn't have said it better, however these issues will never be put in check because these people spin things and are very good at pointing the finger at something else *without* admitting they are wrong.", "score": 5, "replies": [{"body": "Yes, they will always exist in some people. The iPhone demand concern persisted for a long time despite strong yearly growth.\n\nA good Q3 delivery (>100K) will make Tsla easily hit its yearly guidance and force a lot of analysts to change their no-growth / bankwuptcy story in early-October -- even a few analysts upgrade is more than enough to propel the stock back above 300 then; and I am suspecting institution buying last two days just for that possibility. \n\nIf we see significantly better margin at the current growth rate, stock will easily rocket to 350 or 400 (but I am not counting on any margin improvement for Q3)", "score": 2, "replies": []}]}, {"body": "If Jack Rickards hypothesis is true, (that the current short interest in Tesla is mostly an ‘expense’ by big oil),a short ‘squeeze’ may never happen.  A closing of big oils position may be very random and at the whim of some board meeting.  A closing of that position would shoot the stock up like crazy, but wouldn’t necessarily be a reaction to some positive news that’s squeezing them out.  My 2 cents anyway..", "score": 3, "replies": []}, {"body": "I think this is true. I also think the sentiment is about to shift as a positive macro theme. Model 3 ramp cont’d, G3, China sales, Y, Pickup, Semi, battery news, ICE producers are slowly showing how far behind they are, etc, etc. Shouldn’t be too much more of this yo-yo stuff.", "score": 1, "replies": []}]}, {"body": "I’m kind of a big fan of Jack Rickard’s hypothesis - that Tesla’s current short interest is not an ‘investment’ by investors, but rather an ‘expense’ by big oil.  The current amount of short interest reflects the value of just two days of profit from big oil.  If this hypothesis is true, 2 things:  1) we won’t see short interest go down for a LONG time.  2) when big oil closes their short positions it will be EPIC.", "score": 7, "replies": [{"body": "Is there anything backing up that hypothesis? Has a single publicly traded oil major disclosed a short interest in Tesla? What about the large middle eastern sovereign wealth funds? \n\n Big oils days are numbered due to policys advocating EVs and other forms of transportation over ICE. Shorting Tesla will do very little if anything to change their long term profit Outlook.", "score": 3, "replies": [{"body": "Shorting a company does affect the amount of capital said company can raise from the public market.  Let’s say TSLA was at $500 instead of $240 during the last capital raise - I have to imagine they would have raised more $, which would have sped up their growth.  Taking a massive short position would be well worth the profits from two days of business.\n\nAs far as proof - no he doesn’t have anything solid.  Just a hypothesis.  A hypothesis based on facts.  Like the fact that the short interest in TSLA seems completely unaffected by the price of TSLA.  The short interest in TSLA is very unlike any other stock.", "score": 1, "replies": [{"body": "I'm sorry but you offer no facts to back the hypothesis. It's a conspiracy theory. TSLA down 21% and short interest up 60% ytd. Short interest in Tesla varies like any other stock - compare it to aapl. Only difference is there's a higher short interest in Tesla. Maybe that's due to the fundamentals of their business.", "score": 3, "replies": []}]}]}, {"body": "This is very like the reasoning from Musk as to why funding was secured: the Saudis (big oil) have the capacity to do it, and therefore they have done it. Rickard has never adequately stated *why* they would do it.", "score": -3, "replies": [{"body": "Because if they can delay EV adoption by just *two days*, that would be worth the expense.", "score": 2, "replies": [{"body": "Seems like it would be easier to just buy enough of the company to shut it down. Shorting the company does basically nothing.\n\nThis is just people trying to find a conspiracy because that creates an antagonist who can be opposed.", "score": 1, "replies": [{"body": "Hard to buy enough of the company when Musk owns half.  Yes, it’s a conspiracy theory.  Conspiracies sometimes do exist.  eg the Koch Brothers or Russian election interference.  The current short interest in TSLA just doesn’t seem to behave like it should..  stock goes up?   Short interest goes up.  Stock goes down?  Short interest goes up.  Just doesn’t seem to make sense.  And it would be silly to think that big oil will just silently allow their fortunes to be taken away from them.  That would be almost a conspiracy theory of itself.", "score": 1, "replies": [{"body": ">Hard to buy enough of the company when Musk owns half.\n\nHe doesn't own half. He owns a lot, but enough of the shares can be bought to control the company if one had the means and the desire. And you said it yourself, if it'd slow down EV adoption by X days, it's worth it.\n\n>The current short interest in TSLA just doesn’t seem to behave like it should..\n\nOnly if you think that shorts should all be daytraders.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Short interest on nasdaq hasn’t updated. Was due yesterday...\n\nAnyone know of this happens often?", "score": 5, "replies": [{"body": "Very rare. From other place, it indicate the current short interest increase 500k to 39.8M.\n\nI believe 105k plus delivery will break shorts’ last mental defense.", "score": 3, "replies": [{"body": "They’ll just keep moving the goal posts. Next one will be they will won’t be able to ramp Model Y fast enough and that there is no demand.", "score": 4, "replies": [{"body": "Exactly", "score": 1, "replies": []}]}, {"body": "What would 105k delivery and 400 million gaap loss mean for Tesla? I think we'll see a repeat of Q2 with a huge run up after delivery numbers are released and a pull back on the earnings report.", "score": 3, "replies": [{"body": "There's a shitload of people that starting shorting anywhere above 300 and all the way up to 380.  They'll probably be good for another while.", "score": 1, "replies": []}, {"body": "It too early to say gaap loss or profit since the profit margin of model 3 is constantly improving. Since the FIAT and Tesla deal already begins, we won't see another 100mil ZEV credit anymore.\n\nSo, basically. The most conservative prediction of Q3 is probably 200Mil gaap loss.", "score": 1, "replies": [{"body": "Analyst estimates range from 630 million loss to 102 million profit with consensus at 80 million loss. Will be a very interesting quarterly result for sure!", "score": 1, "replies": [{"body": "I feel consensus estimation is actually very accurate.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I think that 2 billion was based on one very vague article so I wouldn't hold too much weight to that number", "score": 5, "replies": [{"body": "Fiat discussed on their earnings call. It's 1.8 billion euro spread out over a variety of automakers. Not limited to Tesla.\n\nIn 2019 projected to save Fiat about 300 million in compliance payments. Not sure what the value is for credits relative to compliance payments. Say it's 80% that's 240 million eur or 60 million per quarter.\n\nhttps://europe.autonews.com/automakers/fiat-chrysler-spend-2-billion-co2-fines-and-credits", "score": 2, "replies": [{"body": "Yeah, remember reading that... one thing I do wonder about though: if that 1.8 billion isn't going entirely to Tesla, which other automakers are they buying credits from? Because there simply isn't any other auto manufacturer that is selling EV's in Europe that doesn't need those credits entirely to lower their _own emission fines_.\n\nHaving said that, I still doubt that the 1.8 billion will go to Tesla.", "score": 1, "replies": [{"body": "I thought Volvo and Toyota have excess credits they could sell. Toyotas focus on gas-hybrid cars looks like a great strategic choice compared to \"low emission\" diesel.", "score": 1, "replies": [{"body": "Ah ok, that might be true... I've only cared about zero emission credits so have no idea what kind of credits Volvo or Toyota might have.", "score": 1, "replies": [{"body": "https://ec.europa.eu/clima/policies/transport/vehicles/cars_en\n\nManufactures can pool together. So say Toyota is beating their targets. They can form a pool with Fiat and push vehicles into that pool to get the pool into compliance while still keeping the remaining Toyota fleet in compliance.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Big Oil shorting Tesla that’s why.", "score": 0, "replies": []}]}, {"body": "Bit of a roller coaster of a day", "score": 6, "replies": [{"body": "I don't even know why I watch it so closely, I'm holding long term.  Still fun to watch it run up though.", "score": 15, "replies": [{"body": "Same here... the only reason I follow this in a daily, i mean hourly, ah fuck it, all damn day long is because it's just such an entertaining stock to follow.", "score": 10, "replies": [{"body": "Couldn’t agree more! This is literally me, every day!", "score": 1, "replies": []}]}]}]}, {"body": "I'd blame Mark Spiegel for the 1 million share order but that wouldn't be possible since his \"hedge fund\" only manages $7 million", "score": 8, "replies": [{"body": "And his Tesla Average short price is somewhere around $200. And it’s around 20% of his holding.\nHe probably going to Bankrupt after this times run up.", "score": 10, "replies": [{"body": "I think he has puts, so a 20% ding to his fund would mean he has a $5.6 million hedge fund!", "score": 1, "replies": [{"body": "He mentioned once that he simply short the score because it’s much more simple to do it..........(I can’t believe a hedge fund “manager” could say this)", "score": 3, "replies": [{"body": "This guy is going to be fine. Whoever gave him 7mn just needed him to look like a prominent hedge fund manager who can go out and openly talk bs about tesla. That's all. He's gonna be fine, I'm sure he's skimmed off enough fees for his act.", "score": 4, "replies": []}]}]}]}]}, {"body": "Not a huge fan of this Plaid version at the moment but I trust in Elon. Seems like the roadster might actually start production next year, which is cool. I think all of these new products -- the new S/X/roadster -- being targeted for a year from now is additional support to the idea that the Model Y is ahead of schedule. I can't imagine they are planning on ramping 4 new vehicles in the same quarter. I am hoping they start Model Y production before Q3", "score": 5, "replies": [{"body": "Why aren't you a fan?", "score": 5, "replies": [{"body": "I think the car will be awesome but I wish they wouldn't talk about it until at least Q1 so that potential S/X buyers don't delay their purchase until the new version is out. The higher price should solve some of that, but still. With that said, Plaid seems like a much needed feature to reverse some of that 3/Y cannibalization. Also, all that pent up S/X/Roadster demand could lead to some extremely profitable quarters -- and I am a fan of those.", "score": 7, "replies": [{"body": "hopefully the free marketing this rivalry is generating offsets some of the lost sales.", "score": 5, "replies": []}, {"body": "\\- Better to announce it before it is leaked.  \n\\- Better to knock down the notion which had gained popularity on /r/cars that the Taycan is a Teslaquila.  There will be hesitancy among a significant number of Taycan deposit holders.  \n\\- Better to announce it to those who might have bought a Raven now but really wanted a track car.  Sales delayed, not lost.   \n\n\n\\- Soon they can announce a substantial difference in price between the P100D and \"+\" and many S buyers will realise a P100D will do just fine.", "score": 1, "replies": [{"body": "> the Taycan is a Teslaquila.\n\nNice one, have an upvote :)", "score": 1, "replies": []}]}]}]}, {"body": "Speculation, but this car may debut at the Truck event in November, perfect for a 4th quarter push. We have no idea how long it's been in development as you could test the car all day long in the Freemont area and no one would look twice at a Model S. It's just another Tesla. \n\nSecond, they need to announce the price asap and set it HIGH, like $150,000, so it slots in nicely between the Raven performance S and Base Roadster ...\n\n50% more price is going to appeal to a whole different range of buyers than a $100k  Model S. It will also kill Taycan sales :)", "score": 2, "replies": []}]}, {"body": "Can we do 260 today?", "score": 4, "replies": [{"body": "Get you're expectations up! 285 by end of week is a real possibility. Look for it to crack 300 by end of the month.", "score": 5, "replies": [{"body": "Why do you think it'll keep going up?", "score": 4, "replies": [{"body": "Momentum & stable macro (for now)", "score": 3, "replies": []}]}, {"body": "Now that’s the spirit!!!", "score": 2, "replies": []}, {"body": "doubt it will be at 285 be eow.  it is fighting the resistance at 246. has to stay above 246 for it to hit 257 next", "score": 2, "replies": []}, {"body": "Please! my avg is $310 ='(", "score": 1, "replies": [{"body": "Maybe we get above that after q3 delivery numbers are out. Tesla has taken off at plaid mode the past week!", "score": 1, "replies": []}, {"body": "my avg is 320$ so yes, I would love for this stock to bring me back into the green.  but we have a huge ass shooting star pattern today, tomorrow is going to be interesting.  we could free fall back down to 248 and 210 again.", "score": 1, "replies": []}]}]}, {"body": "Now that didn't age well XD", "score": 1, "replies": []}]}, {"body": "If you are a long term investor, you should *buy low*, hold for long term.\n\nIf you are a swing trader, you should buy low, sell high. Not buy high, then forced to sell at low due to margin calls.\n\nIf you are a day trader, you should try to day trade something else, TSLA is highly manipulated. If you are not a manipulator, you are at a disadvantage. There is no reason to day trade TSLA, unless you really figured out something special.", "score": 5, "replies": [{"body": "I've been watching tsla along time and I have no idea how you would day trade it. Shit is seriously random. I bet it even moves against macro more often than usual.\nAlthough in general I think daytrading is a sad casino slot pulling on any stock and not a skill as such.", "score": 4, "replies": [{"body": "I’d love to see stats on that. It would be interesting to correlate a bunch of metrics together to the stock’s behavior. It is one, if not the most unpredictable stock to trade.", "score": 1, "replies": []}, {"body": "There are indeed people who make significant amounts of money daytrading. They are just far fewer than most people would think. I suspect most people blow up eventually, due to poor money management. On a long enough timeline, anyone will blow up if they don't control their betsize.", "score": 1, "replies": []}]}]}, {"body": "I don't understand this move by Tesla, it doesn't make any sense to me as a Bull. If the production of the new power train won't go into effect till a year from now, why reveal it now? Won't this hurt the p100d sales of the S/X? Can someone explain to me the benefits of doing this? And don't tell me it's the Tycan, cause The S/X have way more range charging infrastructure, software Exc...", "score": 4, "replies": [{"body": "Elon said it’ll cost more than their current offerings, but less than competitors.  My guess is it’ll be 140k range.  Not really competition with the current S/X.", "score": 9, "replies": [{"body": "I sure hope Tesla releases p100d+ with 7 seaters this month, at that price. Since musk has been tweeting about it.", "score": -3, "replies": [{"body": "... he said next year.", "score": 6, "replies": [{"body": "For the plait version, Yes, but the p100d+ could be coming with the rumored interior refresh,7seate, and track mode. I think that would make the most sense. The reveal hypothetically will be during the track  Nurburgring challenge.If that doesn't happen, I'd be really worried about the near-term demand.", "score": 2, "replies": []}]}]}]}, {"body": "Definitely Taycan. No reason otherwise. \n\nAnd by putting the car on that track, it was going to come out that it was not a current model. \n\nIs it right? Who knows. Will it get a lot of attention? Yes. \n\nWill headlines stating a 7 seater Tesla beat the best competitors race car blast all over the internet ? For a 30% discount? Yes. \n\nLet’s see what happens. Maybe they will lower price of non-plaid to make more of a gap between model types. Then if you want the 120k+ model, you wait.", "score": 9, "replies": []}, {"body": "They at least need to let people know that it is something like $30k option.  So people interested in the $80k Model S do not wait.  Or if it is a field upgrade, SAY SO.", "score": 4, "replies": []}, {"body": "It's just an option and certainly not for everyone. It's good that they're transparent with the potential customer.", "score": 2, "replies": [{"body": "it will be an option when you can order it on the website.", "score": 2, "replies": [{"body": "🚗⚡       🚀   🌔", "score": 1, "replies": []}]}]}, {"body": "Halo effect on the brand maybe?", "score": 2, "replies": []}, {"body": "The plaid model S is rumored to to cost 25% more than the current model S performance with ludicrous. IIRC, the performance model S with ludicrous makes up less than 10% of the model S sales, therefore it would only *possibly* cannibalize 10% model S sales. I would be happy to split the difference and say it will only affect 5% of all model S sales, but worth it in the long run because the people who \"wait\" to buy the S are spending more.\n\nJust my .02", "score": 2, "replies": [{"body": "Given what you say it's a pretty decent branding move.", "score": 3, "replies": []}]}, {"body": "Elon has fallen into the trap of letting a competitor set the agenda. Now he’ll do whatever it takes (seat’s seven!) to regain the initiative.\n\nLeapfrogging (whether over — cold gas thrusters, under — boring co., or through — nurburgring) is Elon’s brand. No?", "score": -2, "replies": [{"body": ">No?\n\nNo.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Panasonic builds the cells there.\nTesla builds the battery packs, motors, power walls, and power packs.\n\nIt's also the worlds largest phallic symbol.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Some areas are pretty dense, it seems most are normal though. There are plenty of videos on YouTube.  \n  \nMy favorite part are the cell aging halls where millions of cells wait for their chemistry to settle. There's a power in that room.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "https://lmgtfy.com/?q=youtube+inside+tesla+gigafactory", "score": 2, "replies": []}]}]}]}]}, {"body": "Powerwalls and other battery stuff... I think...", "score": 1, "replies": []}]}, {"body": "Going up right when I am thinking of increasing my position -_-", "score": 4, "replies": [{"body": "Nows your chance!", "score": 7, "replies": []}]}, {"body": "$180 tomorrow. Yuge bull trap", "score": -4, "replies": [{"body": "I think you have a typo. $280 tomorrow. Up bigly.", "score": 14, "replies": [{"body": "Both", "score": 3, "replies": [{"body": "Schrodinger’s investment rule - as long as you don’t check the tape, you haven’t lost any money!", "score": 12, "replies": []}]}]}, {"body": "You're the hero we need but don't deserve. Have an upvote.", "score": 5, "replies": [{"body": ":0 thx", "score": 1, "replies": []}]}]}, {"body": "Why are we going up? Anticipating big deliveries?", "score": 1, "replies": [{"body": "because we're done going down", "score": 23, "replies": [{"body": "Yeah I mean it was only a matter of time. The short selling is keeping the stock suppressed but I think the days of bad news are coming to an end. The model y will cement that.", "score": 6, "replies": [{"body": "You can turn any good story into bad news for mass media.  Tesla and the media taught me that.", "score": 2, "replies": []}]}, {"body": "Maybe not completely done just yet 🤷‍♂️", "score": 1, "replies": []}]}, {"body": "Maybe it’s becoming more clear with the Frankfurt auto show that Tesla is five years ahead.  We’ve seen expensive electric sports cars and a VW ID 3.", "score": 3, "replies": []}]}, {"body": "Why are we going down now?", "score": 1, "replies": [{"body": "+/- 1% is noise", "score": 11, "replies": []}, {"body": "Natural institutional profit-taking on a \\~10% gain over just the past 5 trading sessions...", "score": 1, "replies": []}, {"body": "Check again.  :)", "score": 1, "replies": []}]}]}
{"title": "$TSLA Daily Investor Discussion - September 19, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "d6bfnz", "created_utc": 1568884323.0, "score": 13, "upvote_ratio": 0.89, "num_comments": 154, "comments": [{"body": "I was just having my morning coffee and reminiscing about the good ol' factory days. I miss the fires, lack of yellow, and junked parts strewn everywhere. The days when everyone had an injury, saboteurs were rampant, and flufferbotting was a dead-end career.\n\nDecided to buy 38 more shares.\n\nEdit: Oh, and the vodka-fueled parking lot parties. Bet those were a lot of fun!", "score": 20, "replies": []}, {"body": "Give me 250 this week", "score": 12, "replies": [{"body": "You might get it this day.", "score": 1, "replies": [{"body": "maybe next week.", "score": 2, "replies": []}]}]}, {"body": "When TSLA was at $178 a few months ago I said to the girlfriend \"I should put money into Tesla\". Long story short, I didn't 🤦‍♂️\n\nAnyway, putting $100k in tomorrow. Can't cry over spilled milk... I loved the company before, but since I got my model 3 a few weeks ago I believe in it even more.\n\nI'll be really happy or really sad in 5-10 years", "score": 22, "replies": [{"body": "In Musk we trust. I believe many of us longs will having  the last laughs dude.", "score": 9, "replies": []}, {"body": "Please, please, don't do the same mistake as I did. Buy TSLA stock incrementally!!!!!", "score": 8, "replies": [{"body": "Really do appreciate you looking out for me, but I'm willing to take the risk. I'm not putting a house on the line or doing anything stupid, this is money I'm okay with losing (not really okay with it, but prepared for the risk). If the price dips in the future I'll probably buy more in smaller chunks.\n\nI'm not in this for a year or trying to make a quick buck, I'm in it for the long haul.", "score": 12, "replies": [{"body": "You might find you are in for the long haul, until the pain becomes too much.\n\nI was in for about 40K and have lowered that to a bit less than half, accepting a 5k loss along the way. I simply couldn't justify risking that much when I had other, more stable options.\n\nYMMV, just imploring you to imagine - really imagine - that you are down 40% on that 100k and looking at other stock that went up 10% in the mean time. Some people can handle that, others can't. You just don't know which one you are until you are there.", "score": 2, "replies": []}, {"body": "Yes, but there is no reason for you to rush this. Buy stock for half that money (you're still gonna make great money if it takes off) and then get more in the future when/if it dips. \n\nI understand that you're in for the long haul; I am also investing for the future not tomorrow. However, something might happen and you'll be stuck with a 100k at $250. I don't suppose it should happen, but you never know. Actual global recession, Musk dies, TSLA struggles further with profitability, competitors are actually good... whatever. You never know.\n\nBut yeah, up to you, of course...", "score": 0, "replies": [{"body": "If you think you are likely to get a better opportunity in the future, why put even 1% in right now and not just wait to deploy the whole thing at a later point? And this question is valid at the point you think you've gotten a better opportunity as well. Why now?", "score": 1, "replies": [{"body": "Because I think. I don't know. Nobody does. That's why.", "score": 0, "replies": []}]}]}]}, {"body": "Why? It’s still pretty low lol", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "This is the dip. Ellison and Saudis went “all in” in 2018 when the range was $250-$389. This puppy can pop $100+ any minute.", "score": 6, "replies": []}, {"body": "It's not simple, actually. Explain to me why you'd want to buy incrementally to buy a possible dip, when it is just as likely the price is just getting more expensive and you've wasted a buying opportunity.", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "https://www.theglobeandmail.com/globe-investor/investment-ideas/invest-gradually-or-jump-in-all-at-once-the-winner-is/article8408480/", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "The article explicitly states you should buy in fixed intervals in order to avoid timing the market. That is usually not what is advocated by cost averagers, who tend to think \"hey I want to save some cash to buy a dip\". I was never saying I am purely right or that cost averaging cannot ever work. However it is a little bit more than \"simple money management\" when in fact buying the bulk at once at a valuation you deem fair is not wrong.", "score": 1, "replies": [{"body": "I long ago came to your conclusion as well. Dollar averaging is a psychological ploy to avoid a kind of false regret. I don't think there are strictly rational arguments to buy less than your entire decided position for that price. You are buying because you anticipate the stock to go higher so delays rationally imply your expectation is to only have worse entry prices by delaying. Note I didn't read any of the links above. Most investment articles are garbage written by non experts to hock ads or newsletters.", "score": 2, "replies": [{"body": "My biggest question to those that want to do the whole averaging thing; if you feel confident you're going to get better buy opportunities anyways and that you shouldn't deploy all your money at once, why don't you wait for that **guaranteed** lower price and then deploy the entire thing. I mean why even deploy 1% if you are just going to \"buy the dips\" in the future. \n\nAveraging works as a way to get an average price point in a volatile stock; you do so by buying the same amount of dollars every set interval regardless of the price per share. What it does is get closer to the short term price average.", "score": 2, "replies": [{"body": "Yes. That is a good rhetorical question that looks like proof by contradiction. Well done.", "score": 1, "replies": [{"body": "It gets even better. How do you know you're in the absolute dip, and if you're not then why not wait and catch the dip? This goes on and on. Why not $245? Why not $244? Why not $243? You start relying on \"technical analysis\" (nonsense) and are basically left with; timing the market. Which is exactly what most people advice you not to do. If the fundamentals tell you this is an attractive buying opportunity and the stock \\*\\*should\\*\\* go up from now on (regardless of whether it does or not), then buy.\n\nConclusion; you just end up waiting forever and are likely to miss out on all the buying opportunities in the progress.", "score": 1, "replies": [{"body": "Yeah I think the way you expressed it the first time is sufficiently elegant. The only assumption is that the model is 'the stock should be X but is currently lower'. If someone brings a more complicated model like 'first it will go down then go up, roll over, get tired, then go way up' then the argument of course has to be a bit more complex, but then occam's razor kicks in. Anytime you see someone with a complicated theory they are almost certainly lacking intuition about how knowledge and prediction work. TA is mostly all superstitious mumbo jumbo intended to make people feel in control without the least bit of rigour.", "score": 1, "replies": [{"body": "Yeah I read someone say Q1 might be bad so you get a good opportunity then. So in that case the stock would first go down and then up, which means if you believe that you should buy 100% of the shares in Q1. The downside of course being wrong and the stock being $350+ and having wasted a really good opportunity right now.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "There is always a dip, no matter what's the stock. It's just a matter of being patient.\n\nTrump could just tweet something stupid again, there is also a risk of recession. Then Q1 2020 will probably see a decrease in sales and starting production on model Y will cut potential profits.\n\nI bought my first Tesla share at 320, scaled in until it reached 220. Then when it reached 180 I averaged down and doubled my amount of shares. Not having enough money to buy all these shares at once actually was a good thing for me, otherwise I would have bought everything at 320 with the hype back then.", "score": 1, "replies": []}]}]}]}]}, {"body": "In your situation I would be patient and scale in and not put 100k instantly. 2.5k or 5k at the time over a 6-12 months period, or wait for a dip. It could drop around Q1 2020.", "score": 7, "replies": []}, {"body": "**Don't** buy it all at once. Tesla's stock is so volatile that you'll likely be able to lower your average share price overtime.\n\nI bought a small amount at the lower price and got a 25% almost right away, then panicked that I hadn't bought more and bought a bunch before the last earnings report, only for the shares to tank. I only just recently got back into positive ROI territory after that mistake. I was staring at a negative 10 percent ROI for over a month on my spreadsheets.", "score": 5, "replies": [{"body": "This is a good strategy. I missed the boat to buy more at 175 because I was waiting for lower...ended up buying more at 197", "score": 1, "replies": []}]}, {"body": "Massive congrats on making the investment. Good luck! Hold for the long term. It will drop at times but it’ll be worth the stress in the long run.", "score": 3, "replies": []}, {"body": "Elon won’t let his baby die. Worst case is he takes SpaceX stake to buyout/rescue Tesla or merges the two", "score": 2, "replies": [{"body": "I agree. People said the model S wasn't possible. People said the Model 3 wasn't possible. They're usually (always) later than they say, but they always get it done. The capital investment right now is massive, and I expect it will continue like that for several years. Amazon was going to be a failure too... Remember Netflix, that company that failed to Blockbuster? \n\nWhen you innovate this much you draw a lot of skeptics. One of the best parts is, we aren't just investing in a car company, even though most people only know it as that. They are reinventing so many things, it's actually a bit crazy", "score": 9, "replies": [{"body": "Agreed. Highly innovative companies like this are usually frowned upon by the media initially due to old-school companies refusing to adapt (also most of them owns part of the media). They know EV is the future and Tesla is clearly going to be the leader, but they don't want people to know that. Once the skeptics and short sellers give up, Tesla will skyrocket up as it is severely undervalued right now.", "score": 3, "replies": []}, {"body": "I don't remember people saying Netflix would fall to Blockbuster ... Other way around, if anything..", "score": 0, "replies": [{"body": "I was talking more about the beginning of Netflix. DVDs in the mail. No one took them seriously, but they were innovating. In the beginning, people thought it was silly to not go to a video store to get your movies. Who wants to wait for the dvd to come in the mail, right? Later, Blockbuster copied them mailing DVDs. By then the damage had been done. When the streaming came along there was definitely still naysayers who believed that people would still want that \"experience\" of going to the video store and picking out a movie (and the selection on Netflix sucked compared to Blockbuster, at the time). Everyone knows the rest of the story. People weren't always saying Netflix would kill Blockbuster, not until the writing was on the wall.\n\nSounds pretty familiar if you ask me. Tesla comes out with an electric car (the Roadster, or the model S for that matter). Everyone laughs at them. Now the other manufacturers are trying to play catch up and stating their desires to go all in on an electric future. The future was here 7 years ago with the model S...", "score": 1, "replies": []}]}]}, {"body": "Why do we assume that SpaceX has the capital to buy Tesla? They also aren’t sustainably profitable", "score": 4, "replies": [{"body": "SpaceX stake", "score": 1, "replies": [{"body": "?", "score": 2, "replies": []}]}, {"body": "Huh? SpaceX has been sustainably profitable for years and is only growing stronger.\n\nDo you have some insider info that contradicts Shotwell, “industry insiders”, and the Wall St. Journal?", "score": -1, "replies": [{"body": "“The terms of SpaceX’s 2018 fundraises are unknown but Bloomberg did acquire information suggesting that the company was only profitable or break-even with after a range of very specific and dubious accounting decisions.”\n\nhttps://www.teslarati.com/spacex-10-percent-workforce-fired-bfr-starlink-launches/\n\nBasically they are only profitable if you remove any form of R&D line items, which is to say not GAAP profitable", "score": 4, "replies": [{"body": "So... Bloomberg (known for always being accurate about everything) merely speculating about something that contradicts Shotwell. *shrug* Private company and I am not an owner. So I cannot claim to know facts capable of contradicting a blog.", "score": -1, "replies": [{"body": "Bloomberg obtained documents related to their 2018 fundraise, which are going to have way less wiggle room than a statement from the COO that they are “profitable”. Profitable in what sense? This makes it clear it wasn’t by GAAP standards. Which is unsurprising, given that their revenue is on ~$2 billion.", "score": 4, "replies": [{"body": "Fair enough, although I usually just assume anything Bloomberg says is not true. But it is not like I can claim to have seen documents.", "score": 0, "replies": [{"body": "Why would you assume that? Bloomberg is one of the leading financial news sites and has won multiple Pulitizers for its reporting. All news requires context, but they definitely have better institutional fact checking and verification in place than most outlets and should not be dismissed out of hand.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "You could buy in by selling weekly or bi-weekly puts.  That way you're capturing premium and lowing your cost-basis.  Only case you miss out is if you think there's going to be a run-up faster than the premium you'd be collecting.", "score": 1, "replies": []}, {"body": "I remember that day, if only my wages had come soner.", "score": 1, "replies": []}]}, {"body": "What is Tesla Inc.?\n\n\n1. Auto Manufacturer (Like Ford and Dailmer)\n\n2. Car Dealership and Services company (Like Penske Group and Autonation)\n\n3. Charging infrastructure company (Like CHAdeMO and ChgargePoint)\n\n4. Automotive battery maker (Like Bosch and LGChem)\n\n5. Vehicle insurance company (Like Geico and State farm) \n\n6. Residential and commercial solar provider (Like Sunpower and Sunrun)\n\n7. Energy storage solutions company \n\n8. Roofing manufacturer\n\nIn future: \n\n\n9. Battery cell manufacturer \n\n10. Autonomous ride hailing company \n\n11. Autonomous logistics service provider\n\nand more ...", "score": 24, "replies": [{"body": "Also in future:\n\n1. App platform (Google Play, Apple App Store)\n2.  Entertainment portal (Roku)", "score": 8, "replies": [{"body": "3. Content creator (streaming “reality tv” to your Tesla from the colony on Mars)", "score": 3, "replies": []}, {"body": "No way *mindblown. I didn’t even think of that", "score": 1, "replies": []}, {"body": ">  Entertainment portal (Roku)\n\nSeems unlikely to me if you're talking about creating his own. Too simple a problem to solve for him and already exists in a way that's pretty good. I'd prefer if he were to just get actual roku integration instead.", "score": 1, "replies": []}, {"body": "I'd bet that by the time they would be interested app platforms will be obsolete.", "score": 1, "replies": []}]}, {"body": "Elon had promised to start a candy business a while back. Maybe he will do it under Tesla, and sell the candies at supercharging stations.\n\nTesla chocolate bar!", "score": 6, "replies": [{"body": "Don't forget Teslaquila.", "score": 9, "replies": [{"body": "How is that trademark fight going, any changes lately?", "score": 1, "replies": []}]}, {"body": "I really think at the time he was foreshadowing a potential deal with the Chinese car company Kandi.  I think the factory they our building now was plan A and if they couldn’t get their foot in the door with the factory they were going to go with plan B and team up with Kandi.", "score": 2, "replies": []}]}, {"body": "Yeah. Will be the worlds biggest company in 20 years. Our Tesla’s will be equivalent to what is seen on iRobot in 2037, we can stream video to our windshields. All cars will have 400 miles of range and the ability to charge in less than 10 minutes. Very excited for the future Elon is building. Because I know he’s thinking about all this as well. Wouldn’t be surprised if the battery tech eventually leads them to venture into electric jets/ships.", "score": 7, "replies": []}, {"body": "12.  Selling all personal insurance lines.  They said it would be very easy to sell all personal insurance lines so customers could get multi-policy discounts (and Tesla could pocket free additional premium for no additional spend).", "score": 2, "replies": []}, {"body": "12. bAnKwUpT $TSLAQ \n\n/s", "score": -3, "replies": []}]}, {"body": "Yesterday a record number of M3P were delivered in the Netherlands, 44 out of \\~350. They are really skyrocketing over here.", "score": 10, "replies": []}, {"body": "Looking at eu-evs.com I get impression that only the model 3 is still gaining ground, all the other leading vehicles are fairly stable to slightly down, and the ipace has really crumpled decisively.\n\nShame what has happened to s and x though. What a major dropoff. I really missed that last year when I was thinking 100k yet again. We'd probably be at 400+ if that had held steady. These vehicles are cheaper too.", "score": 7, "replies": [{"body": "S&X are like the ipod.  DwArfed by iphone (3&Y) that hang around bc they still bridge that tech gap and mgmt still wants them around for various reasons.  I think Tesla would be better off dropping them both bc they should be focused on 3&Y.  platforms for larger vehicles should focus on rideshare rather than serving traditional luxury sedan & SUV.  \n\nTldr: s&x served their purpose, but no longer meet Tesla’s next level mission statement.  I love the cars tho, no offense to owners meant.", "score": 3, "replies": [{"body": "I see it differently. \n\nStaying with apple, the S and X are the \"flagship or Pro\" version while the 3 is the standard version. \n\nThe problem today is that the model 3 version is in many ways better than the Pro version at a cheaper prize. Therefore it is overall the better buy for most people. S and X are still cash cows in terms of profit per car.\n\nWhat tesla needs, is to make the S and X better than the 3 in *every* *way* except price ofc. On the other hand, the luxury market is limited, so the 3 is overall way more important for tesla because of the size of the market. This is why they don't focus on the S and X right now.   \nI bet that we will see newer and better S+X in the future and sales coming back up. Especially from people who owned a M3 and want a bigger car at some point in the future.", "score": 11, "replies": [{"body": "Yeah I think you're right. Driving a 3 makes me really want to try an X now.", "score": 2, "replies": []}, {"body": "Yea thats cool.  Elon said on the conf call they are mostly still around to be the sx in sexy.  They know what they are doing better than me.\n\nWith apple i think their ‘pro’ lineup is more gimmicky bullshit to increase margins.  Apple’s mission under Cook is coolish products at 40% margin, Tesla’s purpose is all about getting people into evs.  That’s why I think Tesla is so much more polarizing than apple or any company of all time.  They have the coolest tech products with an actual purpose that many people believe in.  That’s why it gets clicks & fanboys (you rang) & everything in between.", "score": 1, "replies": [{"body": ">Apple’s mission under Cook is coolish products at 40% margin, Tesla’s purpose is all about getting people into evs. \n\nThat sounds like a good reason to be an Apple shareholder and a terrible reason to be a Tesla shareholder.", "score": 2, "replies": [{"body": "Not really, it WAS a good reason to be an Apple shareholder. Today their products are not cool anymore, they are behind on innovation.\n\nTesla on the other hand is a cool kid. It will take time, but long-term vision and rapid innovation will pay off.", "score": 2, "replies": [{"body": "Yup.  Exactly.  This isnt your father’s apple lol", "score": 1, "replies": [{"body": "Still made more profit this year than Tesla is likely to make in the next twenty.", "score": -3, "replies": []}]}, {"body": "Based on what statistic is Apple behind on innovation? They make close to 90% of the profit the smart phone business produces", "score": 1, "replies": [{"body": "Do you think you can measure innovation in a statistic?\n\nThere is nothing innovative in new iPhones at all. Other companies have already improved their cameras with post-shot algorithmic enhancements. Now Apple is finally doing that, but it used to be the other way around.\n\nWithout the new \"wow\" factor sales of the new models will shrink, people would simply opt for older models. It is already happening.", "score": 1, "replies": [{"body": "> Do you think you can measure innovation in a statistic?\n\nI think there should be some form of statistic you can measure everything in, yeah.\n\n> There is nothing innovative in new iPhones at all. Other companies have already improved their cameras with post-shot algorithmic enhancements. Now Apple is finally doing that, but it used to be the other way around.\n\nThey have close to 15 hours of battery life, which seems like a huge improvement. Also, acting like every enhancement in a mature industry is going to be like the original release of the iPad or iPhone isn't the way to read things. Smartphones have been asymptoping for years. Gains now will be more incremental.\n\n> Without the new \"wow\" factor sales of the new models will shrink, people would simply opt for older models. It is already happening.\n\nThe replacement cycle for all smartphones is increasing. Why do we assume this is specific to Apple's innovation and not an industry-wide concern.", "score": 1, "replies": [{"body": "There is a difference, compared to other companies Apple is sitting on a ton of cash and cannot think of much else other than buying back it's own stock and longer battery life. Wasted opportunities is a lack of innovation.\nFinally they got a clue and got into streaming and original content, but they are late to the party. Amazon thought of that before Apple, how ridiculous is that.\nThey don't have the \"cool\" anymore, it is the ecosystem that keeps people in. Too much hassle to change.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla driving toward ever lower margin models is not a good reason to invest in the company.", "score": -2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Agreed.  That roadster is going to be nuts.", "score": 2, "replies": []}]}, {"body": "Both models are a profitable product with great margins and an enormous amount of sunk costs that are getting less per unit with each one made. They are definitely a different type of vehicle.\n\nS and X have definitely served the purpose of growing Tesla into the position they could start making mass market production vehicles. In your analogy, they are the Macintosh desktop computer, not the ipod.", "score": 2, "replies": []}, {"body": "except the original iPod's were $399 and the original iPhones were $499/$599, and both were massively profitable.", "score": 2, "replies": [{"body": "Yea and Jobs was the leader.  It’s a different company now.", "score": 2, "replies": []}]}, {"body": ">I think Tesla would be better off dropping them both bc they should be focused on 3&Y.\n\nSounds good to me.", "score": 0, "replies": []}]}, {"body": "The crazy thing is all of the Model 3 gain is coming from the Netherlands.  Sales are actually way down QoQ in both Norway and Spain.  It will be interesting to see how sales in the Netherlands hold up as the extremely generous tax benefits there get reduced next year.", "score": -18, "replies": [{"body": "NL+NO+SP numbers were also greater in Q1 2019 than Q2 2019, but overall EU deliveries were up in Q2 compared to Q1. There are only so many cars to go around and they're obviously prioritizing the Netherlands at the moment.", "score": 13, "replies": [{"body": "Yes, I agree with that.  My concern is we could see another situation like what happened with the S and X in the Netherlands.  In 2018 sales skyrocketed as people rushed to buy before incentives went away; in 2019 sales have crashed by like 90%.  The incentives for the Model 3 will not be reduced nearly as much as those for the S/X were, so a drop in sales nearly that big is extremely unlikely.  But there is clearly a reason why Tesla is trying to prioritize sales there now.", "score": 0, "replies": [{"body": "There is a demand cliff after every tax incentives cliff. No argument about that, we have observed this phenomenon all over the world. If every investor and short think along this line, together they could cause the stock to drop.", "score": 0, "replies": []}]}]}, {"body": "It will be interesting to see how sales in the Netherlands hold go up as  the extremely generous tax benefits there get ~~reduced next year~~ increased the year after it.\n\nFTFY", "score": 5, "replies": [{"body": "[Here](https://insideevs.com/news/358500/netherlands-phase-out-bik-tax-incentive-evs/) is an article saying the tax incentives will be gradually phased out.  Do you have a source for the incentives being increased?  I may have old information.", "score": 1, "replies": [{"body": "That would be a tax incentive, this is a subsidy:\n\n[https://nos.nl/artikel/2261387-iedereen-aan-de-elektrische-auto-6000-euro-subsidie-in-2021.html](https://nos.nl/artikel/2261387-iedereen-aan-de-elektrische-auto-6000-euro-subsidie-in-2021.html)\n\n> Onder de voorgenomen maatregelen vallen belastingvoordelen en subsidies.  Voor nieuwe emissieloze auto's voor privégebruik komt er in 2021 een  aanschafsubsidie van 6000 euro, aflopend naar 2200 euro in 2030. \n\ntranslates to\n\n>The proposed measures include tax breaks and subsidies. For new emission-free cars for private use, there will be a purchase subsidy of 6,000 euros in 2021, decreasing to 2,200 euros in 2030.", "score": 5, "replies": [{"body": "Thanks.  Interesting that they are phasing out some subsidies and increasing others.", "score": 0, "replies": []}]}, {"body": "Netherlands set a plan to reach 100% clean energy transportation in 10 years. That means a lot of people will stop buying new and used ICE vehicles way before 2030. In another word, EV sales in this country will  rise from 2% to 100%. Sure you could bet next two years EV might drop to 1.5% and 0.7%. You could be right. Most other people would look at the overall trend and predict the 2% gradually rise.", "score": 3, "replies": []}]}]}]}]}, {"body": "High chance we get a trade deal with China.", "score": 5, "replies": [{"body": "Source?", "score": 1, "replies": [{"body": "No source. Common sense. Trump needs it for reelection, China needs it to prevent a deep recession.", "score": 3, "replies": [{"body": "Seems like Trump needs the deal much more than China. Whatever economic problems the trade war is causing China can safely be blamed on America acting erratically, and if a Democrat wins the election they'll probably want to get something of a compromise win-win deal sorted asap to end the trade war to decrease the chance of a recession at the start of their term.", "score": 4, "replies": [{"body": "China's one-party control could be at risk if they let the economy to have a free fall: inflation, unemployment, bankruptcies...", "score": 1, "replies": [{"body": "Yeah, but has the trade war had that big of an effect/will it? There's a massive difference between economic free fall, and growth at somewhere between 4-5% instead of the expected 6%. And again, however bad the trade war is for the Chinese economy, the government will say it's entirely America's/Trump's fault. At that point it becomes a question of \"resisting American domination\" and national pride, rather than a question of the CCP's ability to maintain growth.", "score": 2, "replies": []}]}]}, {"body": "Trump needs an actual deal though.  He will get roasted if he doesn't get real concessions from China.", "score": 0, "replies": [{"body": "You think he needs something real in order to claim it is real?", "score": 2, "replies": [{"body": "You think the democratic candidate is just going to be like, \"ok, if you say it is a good deal, good job!\"?", "score": 1, "replies": [{"body": "Wild prediction: no matter what Trump says or does, Dem candidate will say it is bad. And the other way around.\n\nThis sort of insight is why they gave me my degree.", "score": 2, "replies": []}, {"body": "You think the he-said, she-said nature of the press will actually make this matter?", "score": 1, "replies": []}]}]}, {"body": "By whom? His entire administration has been to construct self-inflicted crises and then claim victory by making a deal similar or worse than the original status quo. See North Korea, NAFTA, NATO, Iran, etc.\n\nThe conservative media has still stuck by him, and the centrist and liberal media have been understandably critical. It hasn't effected his approval.", "score": 1, "replies": [{"body": "> It hasn't effected his approval.\n\nI mean, his approval ratings are the lowest of any president at this point in their administration other than Jimmy Carter.", "score": 1, "replies": [{"body": "Yeah, but they’ve been that way basically his entire presidency", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Slightly unrelated but: GM has over 40k workers on strike and the stock isn't down more than 0.5% or so...", "score": 11, "replies": [{"body": "That’s not bad news. You don’t know market moving bad news. \n\nThat’s when a company puts out an internal news letter to reduce unnecessary expenses...\n\nDUH!", "score": 6, "replies": [{"body": "GM shuts down unprofitable plants.", "score": -1, "replies": [{"body": "They're going to be doing that a lot then.", "score": 6, "replies": []}]}]}, {"body": "The strike started overnight Sunday.  GM's stock closed Friday at $38.86 and dropped to $37.21 on Monday, down 4.25%.", "score": 2, "replies": []}]}, {"body": "Is it possible that we might have just gotten rid of \"mandatory morning\" dips? 🤔🤔🤔", "score": 3, "replies": [{"body": "it did bounce off the gap of $242.  next ceiling to hit/test is 257 so we aren't really in an uptrend just yet.  There might be some sell off starting around $250.", "score": 2, "replies": []}]}, {"body": "Anybody else beginning to think that Elon outed the Late 2020 Plaid Model-S because they aren’t selling much of the current Model-S Anyway?", "score": 3, "replies": [{"body": "My guess his motivation is to outperform competition and glide the PR wave.\n\nI don't think plaid is going to hurt current S sales much, as it will cost quite a lot more compared to the performance version. Most people buy long range S, not performance (20k$ difference).", "score": 7, "replies": []}, {"body": "Honestly, I really think he just wants to show off. As far as I know the history of the guy, that would be much more like him.", "score": 6, "replies": []}]}, {"body": "Watching the latest [video](https://youtu.be/aDGgdGMOT78)  of V10 NOA with a hw3 computer is really hopeful they are getting closer to FSD. I think there is a chance we see some major progress in Q4 for FSD as Elon’s timeline with feature complete by year end might be close. I don’t think it will be feature complete but we will see some amazing potential come out with these hw3 computers. This is why I’m holding OTM Calls for Jan 2021.", "score": 3, "replies": [{"body": "\"video is private\"", "score": 3, "replies": [{"body": "I wanna see this video, /u/WhatExperience pls deliver", "score": 1, "replies": [{"body": "Dang idk wth happened but seems like he took the video down...", "score": 1, "replies": []}, {"body": "Check out todays posts on electrek", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "That video was getting a ton of flack this morning because the driver was using a steering wheel weight and being generally careless by doing an animated \"look ma, no hands\" every time the car changed lanes on its own. He also called V10 \"almost level 3\".\n\nSomeone on the main sub outed the youtuber's VIN (and that thread itself was quickly locked and deleted shortly thereafter).\n\nUnclear if the youtuber took down the video on their own or if Tesla got involved.\n\nThe video showed a 40 minute commute, on three highways, in reasonably heavy traffic, performing almost flawlessly (there was one small intervention, I think during a merge). AP performed multiple lane changes on its own and overall seemed very good.\n\nThe new display looks nice, although it still has some jitter when a vehicle changes camera zones or when there's a big truck two lanes over with a smaller car in between.", "score": 6, "replies": [{"body": "Thank god they took down the video, could you imagine the media backlash and Fred is dumb for reporting on it. Had he just held on to the steering wheel, it would've been an awesome showcase of the v10 autopilot. Instead, he's endangering the future of the whole system, by forcing regulators hands into stopping Tesla.", "score": 3, "replies": [{"body": "I know. The execution was horrible. Could have been a great a sneak peak (because it did work well). Instead it was THIS close to being a PR nightmare.", "score": 2, "replies": []}, {"body": ">and Fred is dumb for reporting on it. \n\nI'm glad we all agree that Fred is merely a shill.\n\nOn the off chance we don't, why do you think that a citizen-journalist-blogger should take something like that into account?", "score": 1, "replies": []}]}, {"body": "Really appreciate you, thanks. Looking forward to seeing some videos in the coming days.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Anyone else see that 30,000 $70 strike puts got bought today, for the 10/18 expiration\n\n&#x200B;\n\n[https://www.barchart.com/stocks/quotes/TSLA/options?expiration=2019-10-18&moneyness=allRows](https://www.barchart.com/stocks/quotes/TSLA/options?expiration=2019-10-18&moneyness=allRows)", "score": 2, "replies": [{"body": "Seems like someone is planning to burn down Fremont the coming weeks. I seriously cannot think of any other rationale for buying these puts.", "score": 5, "replies": [{"body": "slightly better odds than lotto tickets.", "score": 1, "replies": []}]}, {"body": "Insane.", "score": 2, "replies": []}, {"body": "Is that an unusual quantity? And what was the price for that?\n\nI have never gotten involved with options, but I respect that they may show some information.", "score": 2, "replies": [{"body": "Yes before this their were only 60 some contracts open for the $70 strike price.", "score": 1, "replies": []}]}, {"body": "If I had to guess I think it was someone closing their position. Probably took a huge loss but didn't want to let that remaining $120,000 get away", "score": 2, "replies": []}, {"body": "Probably someone hedging or freeing up margin.", "score": 1, "replies": []}, {"body": "At $0.04 each, the total cost of those Puts is only $120k. Not a big amount.\n\nThis behavior is very common for Tesla. Every month someone buys a large amount of Tesla Puts at a few cents. Could be someone buying lottery tickets, hoping TSLA bankruptcy in a month. Which is a wild dream. They just keep throwing money away.\n\nOr someone bought lots of TSLA with margin, they need this kind of Puts to prevent margin calls.", "score": 0, "replies": [{"body": "For far OTM call/put, they are normally just hedging. Maybe mean somebody is going to buy a big chunk of shares in coming weeks.", "score": 1, "replies": [{"body": "Or they already bought shares and use Puts as hedge. More likely it's just some body truly believe Tesla will fail. There are tons of crazy people firmly believe Tesla will reach zero. Even though we explained to them that there are companies which are interested to purchase Tesla.", "score": 2, "replies": []}]}, {"body": ";-).", "score": -3, "replies": [{"body": "1 Contract = 100 Shares\n\n100 Shares/Contract * $0.04/Share = $4/Contract\n\n30,000 Contracts * $4/Contract = $120,000", "score": 4, "replies": []}, {"body": "Yeah, but each Put represents 100 shares, so it really costs $4 to buy a Put, even though the price is listed at $0.04. ;)", "score": 2, "replies": []}]}]}, {"body": "Well, 30,000 x $.04 = $1,200.   Nothing to see here.\n\nCould have probably gotten the same deal at the $130 mark but congrats to whoever wrote the contracts.  Easy money.", "score": -4, "replies": [{"body": "Options are priced per share, so it's 30,000 x 100 x 0.04.  it is $120,000", "score": 3, "replies": []}]}]}, {"body": "Pump and dump again, horrendous volume", "score": 2, "replies": [{"body": "one pump and dump please, hold the dump", "score": 5, "replies": [{"body": "Kinky", "score": 3, "replies": []}, {"body": "hold the dump indefinitely.  i fear q3 might bring bad news, according to elon's statement in q2 er.", "score": 1, "replies": [{"body": "What statement? I am cautiously optimistic about Q3", "score": 1, "replies": [{"body": "It was in the q2 er transcript.", "score": 2, "replies": [{"body": "The er transcript said \"q3 might bring bad news\"? Doubt", "score": 0, "replies": [{"body": "sorry for some reason I keep thinking it is q3 that he said will be tough.  here's the extract from the transcript:\n\nA.M. Sacconaghi -- Sanford C. Bernstein -- Analyst\n\nYes, thank you. I was wondering if you can comment about whether you felt that Q2 benefited from consumers in the US sort of rushing out to buy Model 3 in advance of the declining federal tax credit, a phenomena that you sort of saw in Q4? And part of the reason I ask is, at least by my analysis, it looks like maybe 70% of the Model 3 sold in the quarter were in the US, which is sort of higher than your normalized percentage of US sales. And so do you feel that, that phenomena may have occurred in Q2? And are you still confident that Q3 deliveries can improve sequentially? And beyond the data point that you provided on the call that the orders quarter data better than last quarter, is there anything else you can point to that provides that confidence?\n\nElon Musk -- Chief Executive Officer\n\nYeah. I think we'll -- demand in Q3 will exceed Q2. It has thus far and I think we'll see some acceleration of that. So -- and then I think Q4 will be, I think very strong. So we expect that quarter-over-quarter improvements. I think Q1 next year will be tough. I think Q3 or 4 will be good, Q1 will be tough. Q2 will be not as bad, but still tough. And then I see like Q3 and Q4 next year will be incredible.", "score": 2, "replies": [{"body": "Ahh, yep. I was lookin for that quote recently, thanks. I thought Q1 would be relatively easier than Q2 but we'll see", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Looks like it's going to up in green today.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "IMO:  The \"threat\" narrative is old.  Less ICE cars on the road is better for the planet.  Tesla is now an established and proven EV maker.  The market is large enough to support multiple manufacturers.", "score": 7, "replies": [{"body": "All these “Tesla Killer” threats have always been based on the assumption that EVs will remain a tiny market of tree huggers. Even the “demand cliff” is based on that assumption...that the only people who will ever want to buy a Tesla are the small group of weirdos who reserved one, that the reservation list (essentially) was the entire potential customer pool.", "score": 7, "replies": []}]}, {"body": "Well, Amazon buying Rivian is also supporting their own large investment in said company. They will probably get near cost prices on all those vehicles.", "score": 1, "replies": []}]}, {"body": "What will come first? 280 or 230?", "score": 1, "replies": [{"body": "It all depends on delivery numbers", "score": 3, "replies": [{"body": "Well, probably moreso on margins. Delivery numbers can still affect it though.", "score": 3, "replies": [{"body": "When do we get deliver numbers", "score": 2, "replies": [{"body": "Probably first week of October.", "score": 5, "replies": []}]}]}]}]}]}
{"title": "Netflix CEO admits there will be ‘tough competition’ as streaming wars heat up with Apple and Disney", "selftext": "https://www.cnbc.com/2019/09/20/netflix-ceo-hastings-tough-competition-from-apple-disney-coming.html\n\n\nIn an interview with Variety, Netflix CEO Reed Hastings admitted that it’s a “whole new world starting in November,” with the launch of Apple TV+, Disney+ and other new streaming services.\n\nHe believes Netflix can still win by sticking to its tried and true strategy of binge-able content. \n\nHowever, Hastings revealed Netflix lost out on the rights to Amazon’s hit comedy “Fleabag.”", "id": "d6wilx", "created_utc": 1568993232.0, "score": 573, "upvote_ratio": 0.98, "num_comments": 157, "comments": [{"body": "I still haven’t heard one person say they’re canceling Netflix for one another service.\n\nEdit: gram", "score": 191, "replies": [{"body": "No. But they are losing money as it is. So to justify the current valuation you need to assume that they would eventually be able to raise their prices substantially. That's a bigger ask.", "score": 78, "replies": [{"body": "Can you explain this. If no one is cancelling service and Netflix no longer paying for any Disney shows, wouldn't they be saving money?", "score": 6, "replies": [{"body": "You are right that they could also become profitable by cutting costs, but that's hard, and they are not going to be very profitable even if they succeed in following this strategy. Their very high valuation was predicated on the belief that they would build an even larger customer base and eventually be able to raise prices. The entry of more competitors makes that less likely even if they remain the dominant player. I also think that the Uber and WeWork debacles cause investors to sour on non-profitable companies with an unclear path to profitability. The belief that an enormous marketing success would eventually translate to enormous profits has taken a hit. It's very possible that the business Netflix is in would never become truly profitable, particularly with competitors like Apple that (because of spillovers to their broader ecosystem) can benefit from the customers even if they don't make any profits.", "score": 4, "replies": [{"body": "I'd also add that they aren't as profitable because they spend a lot on rights, developing original content, etc. - prices which have gone up substantially as streaming has grown.\n\nAnd personally your reply is one reason why I hate investing sometimes. Profit is never enough, it needs to be enormous profit.", "score": 3, "replies": [{"body": "You only need to make an enormous profit if your valuation is based on making an enormous profit. If the market expects you to do poorly, then merely doing OK is more than enough for the share price to double. Conversely, if the market is expecting you to be amazing, and you are only very good, then your share price will crash. Picking stocks is not about finding good companies. It's about finding companies that will do better than the market expects, or otherwise experience a positive shift in market opinion.", "score": 3, "replies": []}]}]}]}, {"body": "The need to stop pouring millions and millions into garbage Netflix originals. Outside of their marquee shows like Stranger Things, everything fucking sucks.", "score": 3, "replies": [{"body": "Part of their appeal though is while they have many shows with broader appeal, they have shows with very niche appeals.", "score": 2, "replies": []}]}, {"body": "Netflix gross profit for the twelve months ending June 30, 2019 was $6.490B, a 38.01% increase year-over-year.\n\nCorrect me if I’m wrong, but how are they losing money?", "score": 1, "replies": [{"body": "That's gross profit, which is not particularly meaningful. According to [this](https://www.forbes.com/sites/stephaniedenning/2019/05/26/why-debt-isnt-killing-netflix/#639ad3f65407), they are expected to make a cash loss of $3.5bn in 2019. For the longest time the market was content to focus on user numbers and gross revenues, but now they want to see the bottom line, and it ain't pretty.", "score": 1, "replies": []}]}, {"body": "Eventually market forces will require Netflix to offer an ad supported model.  Queue The Trade Desk.....", "score": 1, "replies": []}]}, {"body": "Not gonna lie, there hasn't been a good alternative so far (in europe). I will switch between Netflix for series and D+ for movies.", "score": 16, "replies": []}, {"body": "If they lose the office and with D+ offering Hulu in a package all lower than Netflix, you might see quite a few people make the switch", "score": 14, "replies": [{"body": "Well they are def losing the office and all nbc programming.", "score": 6, "replies": []}, {"body": "People will get disney, but they will go for the 6.99 package without hulu imo. No one wants fuckin hulu with its ads an shit", "score": -2, "replies": [{"body": "So I used to not want Hulu because I thought it was dumb they had ads but they're shorter and more bearable than commercials and if offered at a low price point (currently paying 1.07 a month) or as part of a good bundle, it definitely has its attraction", "score": 2, "replies": [{"body": "Fewer, more relevant ads model is the future. Netflix won’t be able to compete without an ad supported model. Cost to create content is insane.  With so many options, consumers will have a ceiling as to how many subscription based (with no ads) services they’re willing to pay for. Low to no cost options will be necessary, and can only be supported with a low frequency, targeted ad model.", "score": 2, "replies": [{"body": "so cable lol", "score": 1, "replies": [{"body": "Less ads, targeted using precision, more relevant. Something only possible with programmatic advertising via CTV.  So no - not cable.", "score": 1, "replies": []}]}]}]}, {"body": "I have hulu with ads right now and its fucking awesome.", "score": 2, "replies": [{"body": "I run two ad blocks so I disable one to bypass the please disable adblock feature. Then the second one blocks ads", "score": 2, "replies": []}]}, {"body": "I have Hulu and no ads. Don't know what your talking about", "score": 2, "replies": [{"body": "Premium?", "score": 2, "replies": []}]}]}]}, {"body": "Yeah but they’re operating at a loss with all the money they pour into exclusives.\n\nNetflix doesn’t just need to maintain existing subscribers, they have to have *growth* to actually profit, which is an entirely different issue from cancellations altogether. \n\nThe customers they’re looking for - individuals/families who are looking to add a streaming service to their households - are going to have a plethora of options to choose from come November. Consumers will compare and contrast each service’s offerings/price before coming to a decision, rather than using Netflix by default. \n\nNetflix’s hay-day is long gone. They had an absolutely incredible run with a *ton* of growth, but that was when it seemed like every good movie/show was on Netflix. Things have changed - there are a lot of players in the game consolidating media for the purpose of launching their own streaming services. Netflix is losing great shows and movies to the original studios or, in some cases, higher-bidding streaming services (Southpark going to Hulu, for example.) \n\nI’m extremely bearish on $NFLX over the next five years. We’re about to witness a massive correction when the presence of the other streaming services begin to truly be felt. I think they’re going to tank.", "score": 33, "replies": [{"body": "The new market is direct streaming from content producers. Netflix has to either become a content producer or die.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "> I think it's become too ingrained in our culture. \n\nand tv wasn't?\n\nMoney dictates what's gonna happen. I'd drop netflix if it wasn't worth it, hell now that i've finished star trek i dont really watch anything but Hulu", "score": 5, "replies": [{"body": "Hulu has some great content now. That plus D+ bundle is a great deal", "score": 3, "replies": []}, {"body": "But the vernacular will change.  Once Disney is our of Netflix and in full content swing on D+, we could see change.  Look at HBO as an example.", "score": 1, "replies": []}, {"body": "Look at the money being spent in TV. They're fine for now.", "score": 1, "replies": []}]}, {"body": "Sears thought this way once too.", "score": 2, "replies": [{"body": "I don't have a counter to this other than Netflix being a more regular aspect of people's lives than something like Sears is, respective to their demos.\n\nEdit - or was.", "score": 1, "replies": []}]}]}, {"body": "Ok, but even if Netflix loses shows here and there; they are building an HBO-like cult following of their original content. Nearly anything they stamp with their Netflix logo is worth a watch; how many other streaming services offer the kind of original content that Netflix is putting out? While Hulu seems to be doing better at have a vast assortment of tv series; they also have ads. They’re original content and movies lag far behind Netflix. I actually think that adopting ads may be a good business move for Netflix to increase revenue maybe 1 ad once you’ve finished a show or movie for instance could produce a good amount of revenue", "score": -4, "replies": [{"body": "Nothing about Netflix is HBO-like. A lot of their originals just...aren’t good", "score": 19, "replies": [{"body": "All my friends are watching oitnb even though we all agree its become trash.", "score": -1, "replies": [{"body": "Wait...is that somehow supposed to refute what I’m saying?", "score": 1, "replies": [{"body": "No. Just stating once people start something they dont rely give it up", "score": 1, "replies": [{"body": "Right but that isn’t at all relevant to Netflix’ profitability. Existing subscribers aren’t the issue - they’re worried about growth and for good reason.", "score": 1, "replies": []}]}]}]}, {"body": "Ok well I disagree I think next to HBO they are putting out some of the most genuinely watchable shows; light years ahead of anything on network television", "score": -6, "replies": [{"body": "Just because a show / movie has the “Netflix Original” logo does not mean they paid for production, it just means they paid to license a show / movie and can make it a Netflix exclusive.\n\nThis strategy greatly diminished the quality of their “exclusives”, since they tried so desperately to associate this type of branding to every new show/movie.", "score": 8, "replies": [{"body": "That strategy really hurt them. \"Netflix Original\" did have premium quality tied to it at the start but then they just took a shit on it and slapped it on everything that they own any tiny bit of. Such a dumb move. They didn't need to market their name because it's already a household name and they devalued the brand by associating it with lower quality content.\n\nNetflix has to step up or they might not be around in 10 years.", "score": 4, "replies": []}]}, {"body": "The fact you disagree with someone about it being HBO quality... Means it's a smaller market than HBO.", "score": 1, "replies": []}]}]}, {"body": "That is just not true. Even Amazon Studios has been producing better content than Netflix.", "score": 5, "replies": []}, {"body": "I agree with this 100%. It sounds like you’re just like everyone else who is trippin out about Netflix. They’re gunna be fine", "score": 1, "replies": []}]}]}, {"body": "Just wait. The services aren’t even out yet. Netflix will die slowly", "score": 8, "replies": [{"body": "Netflix isn't going anywhere, although that is not too say they're current stock price isn't overvalued.", "score": 3, "replies": [{"body": "I think they will decline slowly, but we'll see. They have some tough competition now.", "score": 2, "replies": []}]}]}, {"body": "Well their US subscriptions last quarter went down, so apparently some people are and the Disney and Apple streaming services aren't even out yet.", "score": 5, "replies": []}, {"body": "I’ve heard plenty of people say they are going to a rotation system.", "score": 4, "replies": []}, {"body": "Because economy is doing well and people obviously have excess money for unnecessary stuff. As soon as people have to start saving money they'll start to cancel subscriptions.", "score": 3, "replies": []}, {"body": "Nobody is \"cancelling\" their service. But people are obviously putting them on hold for one month, two months, etc. On their last earnings call Netflix reported that they lost subscribers for the first time in eight years. So people are obviously cutting their service. But if you ask someone if they're \"cancelling\" Netflix, they're gonna say no because they fully intend to come back to binge watch their fav shows in a couple months. This is the problem. This had not been happening with enough regularity before for it to be an issue.", "score": 2, "replies": []}, {"body": "Well, I can say that I stopped downloading movies when Netflix came, but earlier this year I realized that I needed 4-5 subscriptions to be able to reach all content. (I am from Sweden Btw) so I just canceled my three subscriptions and went back into downloading again. The competition really ruined streaming for me at least.\n\nIt has not happened to music yet, I rock the same subscription to spotify since 2011.", "score": 2, "replies": []}, {"body": "A lot of people don’t really know what the other services have to offer", "score": 1, "replies": []}, {"body": "I cancelled due to lack of quality content. Hulu and Prime seem to have better content that I find interesting.", "score": 1, "replies": []}, {"body": "I’m canceling Netflix this fall.", "score": 1, "replies": []}, {"body": "Well let me be the first one to tell you lol", "score": 1, "replies": []}, {"body": "Canadian here - my family no longer has Netflix. I have a couple friends who don't have it. \n\nPrime video comes with an Amazon membership and Crave (HBO and Showtime content) comes bundled with internet. Is the UI as good as Netflix? Not yet. Do they have good alternative content? No doubt.\n\nI think these are serious threats for Netflix. Most of us have had the service for ~5 years. There's a risk people go for novelty at a cheaper price vs a library they've been overexposed to and is becoming more expensive. \n\nWe have a limited number of hours in a day. How many streaming services are people willing to have?", "score": 1, "replies": []}, {"body": "As long as Netflix has Bojack and Rick and Morty I’ll never cancel", "score": 0, "replies": [{"body": "Where do you live? I don't think they have rick and morty in the us", "score": 7, "replies": [{"body": "They don’t. Hulu has it", "score": 6, "replies": []}, {"body": "U.K.", "score": 2, "replies": []}]}]}, {"body": "I'm cancelling netflix for another service...ok no I'm not netflix and hulu aren't going amywhere", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 83, "replies": [{"body": "They screwed up. Instead of pouring money into quantity, they should have went the HBO route and focused on quality.\n\nThey did at the very beginning, then I feel like they just gave anyone money, which unfortunately dilutes content. Let alone, their preference algorithms are absolutely horrible. I'm sure they make/have great stuff I just don't see.", "score": 80, "replies": [{"body": "Their business model was to get as big as possible as fast as possible. Being niche would not have helped them. \n\nThey make content for literally every demo. Could their batting average be higher, sure. So can every other studio in town if you remove the difficulties in making content that makes everyone happy. The fact that they went wide with original content as they did might be what keeps them in business\n\nBTW get ready for HBOs brand name to tank as HBOmax will take the same approach by making a ton of content across a broad spectrum of demos.", "score": 52, "replies": [{"body": "As much as I hate it you are right, HBO’s brand name used to be enough to get me to try a show, but it’s going to soon start meaning the practically nothing when HBO Max comes out", "score": 10, "replies": [{"body": "It's funny because when HBO started, their reputation was too much shitty content. But then they got Sex and the City, Sopranos, etc and now their reputation is stellar. \n\n\nNetflix just needs a few more shows that hit it out of the ballpark.", "score": 5, "replies": [{"body": "I think rather than a few more shows that hit it out of the ballpark, it needs less shows that are completely panned by critics and audiences alike and needs to actually emphasize its good shows", "score": 8, "replies": []}]}]}, {"body": "They will definitely stay in business. They are not going anywhere.", "score": 1, "replies": []}]}, {"body": "Literally *anyone*.  They even made a pretty good joke about it [on South Park](https://southpark.cc.com/clips/birfp7/youre-green-lit).", "score": 5, "replies": []}, {"body": "Netflix is fine. There is market for mediocre quality shows and there is market for high quality. The thing with high quality shows is that they are expensive to make hence HBO doesn’t have a lot of shows.", "score": 1, "replies": []}, {"body": ">  they should have went the HBO route and focused on quality.\n\nWhich is what Apple is doing.  Whether the shows are HBO quality remains to be seen.  But if they are, we'll get an idea of whether that model works.", "score": 1, "replies": []}]}, {"body": "Same.\n\nThe fact is too many of the content makers thinks that exclusivity in their own streaming service/TV channel gives them more money then making their content available in as many places as possible. Everyone is moving to set up their own walled garden and pulling their stuff from Netflix. \n\nI think NBC's announcement about Peacock streaming (not joking about the name) makes them the last big broadcast TV channel to get into the streaming game, which will cut out a large amount of content Netflix could have shown.\n\nUntil a content maker decides to do away with exclusivity, and makes a huge amount of money making their content available on as many networks/streaming services as possible, I don't see this trend reversing anytime soon. And the longer this trend goes on the worst it'll be for Netflix (8 out of 10 of Netflix's top 10 shows are owned by other networks).", "score": 9, "replies": [{"body": "Basically going back to how things were before Netflix. All streaming services including Netflix becomes \"channels\". The only difference is that we get to choose the ones we want rather than having everything bundled up. I doubt they will move away from exclusivity but might partner with each other and replicate the current cable bundle", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "[dvd.netflix.com](dvd.netflix.com)", "score": 4, "replies": [{"body": "??", "score": -2, "replies": []}]}]}, {"body": ">Ignoring Netflix as a film/TV studio, I don't see what they have to offer long term.\n\nNetflix is throwing money at the task of creating genius art, which Hollywood has been doing since its inception yet hasn't really been efficient at despite all their experience and all the precedent. Ultimately, they all have to throw money at the right people and under the right terms", "score": 4, "replies": [{"body": "> Netflix is throwing money at the task of creating genius art, which Hollywood has been doing since its inception yet hasn't really been efficient at despite all their experience and all the precedent. Ultimately, they all have to throw money at the right people and under the right terms\n\nWhich was why I excluded it from my analysis. \n\nIf you are investing in Netflix because you feel they have innovated and proven they can make high value films and TV series for the budget they invest in it, then I think that's a fair investment. \n\nIf you are investing in Netflix because you feel they are a good platform to bring together content from many different suppliers of content like when they were founded, I think that's a harder argument to make.", "score": 3, "replies": [{"body": "Don't get me wrong. I'm not long on Netflix--they overspent. However, it only takes like 3-4 hits to revive a streaming service", "score": 3, "replies": []}]}]}, {"body": "If that were to happen wouldn’t that just reinvent cable.", "score": 3, "replies": []}, {"body": "> I think everyone knew that once they proved the model to be profitable, the big players would cut them out.\n\nReed Hastings predicted the future was streaming back in 2011. \n\nSo Reed Hastings said he was spinning off the DVD business as \"Qwikster\" and would focus Netflix purely on streaming.\n\n\"Everyone knew\" that would be a disaster, and the stock tanked.\n\nThen came House of Cards.\n\n\"Everyone knew\" Netflix could never compete with Hollywood, so the stock traded sideways.\n\nEven after House of Cards was an absolute hit, the stock barely moved.\n\nNetflix has been very clear that the big players would try to cut Netflix off.\n\n> Ignoring Netflix as a film/TV studio, I don't see what they have to offer long term.\n\nWhy would you ignore the one strategy that Netflix has gone after?\n\nIt's the one thing they have consistently said they can do better than anyone else.", "score": 3, "replies": []}, {"body": "So basically they’ll make cable for the internet?  Got it, so we will be in the exact same place we were when this whole streaming thing first started and we thought how cool it would be to “cut the cord,” per se.  Should have known that was a fools dream in the capitalist system we reside in.", "score": 5, "replies": []}, {"body": "This is making a good case why I should maybe go back to picking up DVD for cheap again. Otherwise I can see having to pay for a handful of subscriptions a month. Getting expensive quick", "score": 1, "replies": [{"body": "The rate of Piracy among films and TV is going to rise. \n\nI paid for Netflix for a few years, even though I could pirate literally everything on it, simply because for the money, it was worth the ease of use. \n\nIn the future, if there are 20+ different subscription services, then its just easier to pirate everything.", "score": 7, "replies": [{"body": "Yea, similar to how I used to pirate music, but because of the ease of streaming, I haven't in years because of the time it saves me.  If video streaming becomes fragmented(looks like it) I can see it going up a ton.", "score": 4, "replies": []}, {"body": "Yep, totally agree. I’ll pay for content on Netflix and Hulu. But if I suddenly need to pay for like 8 other streaming services, I’m out.", "score": 5, "replies": []}, {"body": "I don’t know about this... sadly Pirate services are getting more and more difficult to use; corporations and governments appear better and better at going after the people who run pirate sites and softwares. Less people want to take the risk on. Once reliable apps and sites are spotty.", "score": 1, "replies": []}]}]}]}, {"body": "If Disney buys out NBCUniversal, Netflix is done.", "score": 8, "replies": []}, {"body": "Do people really think that Apple TV+ is a threat? They have so little to offer.", "score": 38, "replies": [{"body": "Apple TV+ will *technically* have over 70 million clients by the end of this year, like much more as 70 million is just the expected number of new iPhones expected to be sold, as there are also millions buying new computers, Apple watches, airpods, etc especially during the holiday season\n\nThat’s a huge base to watch the few shows they come out with and now they have a year to build up their content library to get these people to renew their subscription, plus auto renew is automatically on so likely many people will forgot to turn that off for when their free trial expires\n\nHad Apple priced the service as Standalone I would be skeptical but free 1 year with a new Apple device purchased is fucking genius as they will gain an insane amount of subs. Now all they need is quality content to get the millions upon millions of subs to renew their subscription 1 year later which I have no doubt they will do", "score": 22, "replies": []}, {"body": "Y not? Its free for the first year if u buy iphone/ipad/apple tv/mac. It doesnt matter if Apple’s shows are straight up garbage because people have limited time to watch TV. Just the fact that its there as an option makes it a threat.", "score": 9, "replies": []}, {"body": "No. Neither is Amazon. \n\nBut AT&T, Comcast, and CBS/Viacom are huge threats.", "score": 8, "replies": [{"body": "I’d say amazon has a better chance of being that aggregator than Netflix in an eventual exclusive environment. \n\nI personally find myself using amazon more and more given I can move my hbo go subscription to app.", "score": 16, "replies": []}, {"body": "The value of amazon and Apple is the fact that the services are not standalone\n\nYou get prime video with prime, which is very very popular \n\nApple TV+ will be given when you buy a new Apple device, which an insane amount of people do. \n\nThat gives these companies time to build their streaming catalogue and time to build a steady consumer base for just the service and with their resources they can afford to take small losses for the long run", "score": 14, "replies": [{"body": "Sure. But it also gives people plenty of reason to subscribe to other services. Hence, not a competition per se. Amazon and Apple have all the money in the world to burn, and they will. Amazon has been for some time. \n\nHowever the legacy companies (sort of) have nearly all the IP and worthy back catalogues. Depending on Disney’s global deals it will almost certainly be on par with Netflix, if not well surpassing them, in less time than it took Netflix to get to where it is. Disney will almost certainly be number one in North America quickly. HBOmax won’t be far behind. And then Peacock is right there as well. Because of current business models, cash reserves, and pricing structures, Amazon, Apple, and a couple others can all exist together. The question is: can Apple, Amazon, Netflix, Comcast, AT&T, Viacom, and Disney all survive together.", "score": 3, "replies": []}, {"body": "At&t is also giving a free version to cell phone customers as is Comcast offering a streaming service to internet only subscribers", "score": 2, "replies": []}]}]}, {"body": "I disagree vehemently. Apple has 2 amazing market advantages:  \n1. HUGE hardware user base is an inherent advantage when the hardware in question is an easy to access channel for their streaming service.  \n2. Their cash flow for a massive company (over 1 tril market cap today) is outstanding and will allow them to out spend Netflix without having to accumulate massive debt.", "score": 0, "replies": [{"body": "I have 3 apple devices and have no intention of using apple streaming. They have no content. Another poor decision by a dying giant.", "score": 1, "replies": [{"body": "“No content”\n\n3 shows is small to start but they are just starting.  It’s more of a wait and see what’s good in a little bit.  Hence the here’s a year free.  Gives them time to build out more.", "score": 1, "replies": []}]}]}]}, {"body": "People are forgetting 1 thing when it comes to Netflix\n\nInternational numbers. Netflix crushes everyone internationally. Disney+ for example isn’t coming to many countries until 2020 and even 2021. While Netflix will drop in the us unless they can pump out more quality shows and fix their recommendations UI internationally they will stay number 1 for a long time", "score": 18, "replies": []}, {"body": "Short Netflix, buy Disney!", "score": 8, "replies": []}, {"body": "I hate this, I have no desire to buy a subscription just to watch Disney movies. I’ll rent them individually on the rare occasion I do want to watch one.", "score": 19, "replies": [{"body": "people with kids though.  I'll be on it for sure, for the library of disney movies for the kids, plus Marvel movies/shows, plus Star Wars movies/shows, plus fox and maybe FX properties??  That's a decent bundle not to mention the exclusive movies and shows planned around all those properties like Lady & the Tramp and Mandalorian.  Also, Disney owns ESPN too, so theyll have the sports crowd if they get a stand alone model for that.  Plus with ownership of Hulu, I mean they're pretty much going to be in every home one way or another.", "score": 27, "replies": [{"body": "ESPN+ is already the standalone model for that", "score": 2, "replies": []}, {"body": "FX properties might wind up in Hulu, which Disney currently owns.", "score": 1, "replies": []}]}, {"body": "One month subscription is cheaper than one movie rental tho", "score": 11, "replies": [{"body": "How much is a Disney subscription I dont even know", "score": -5, "replies": [{"body": "$7/month. $70 for a year", "score": 13, "replies": []}]}]}, {"body": "\"Just to watch Disney movies\" - if this is what you actually think this is, and not just trying to downplay Disney Plus, you should look into it. Disney will be the biggest streaming service hands down and will smash Netflix into the dust.", "score": 8, "replies": [{"body": "Which is why I bought DIS at $108 last year when this was rumoured.", "score": 4, "replies": [{"body": "One of my regrets was not pulling the trigger when it was just floating along at $100. That said, I don't think the $130s is where it will be next year - it'll be a lot higher.", "score": 7, "replies": [{"body": "I wasn't looking at it when it was in the $90 range😭😭😭", "score": 2, "replies": []}]}]}, {"body": "What would the service have to offer? Other than Marvel, Star Wars, and Pixar films? I honestly don’t know", "score": 2, "replies": [{"body": "I'll start off with this isn't a counterpoint to your original comment - if this service is not your cup of tea that's cool. \n\nDisney owns practically every IP that has a rabid fan base. I wouldn't discount Disney properties in terms of being a selling point (they have some of the most rabid fans on this planet - and that's not factoring in the family-factor), not to mention Marvel and Star Wars. Original series born out of those are strong sub-sellers, in addition to the entire Fox library they purchased recently (remains to be seen where they park those, but probably on Hulu which they control as well, and they're offering a Disney+Hulu+ESPN sub for less than $15/month). \n\nThey have a deep, deep bench of content to pull from, as well as the creative muscle to sustain it (which Netflix has not been able to produce). Content is king and Disney branding is unparalleled - I wouldn't bet against this thing.", "score": 11, "replies": []}, {"body": "Hannah mon-fuckin-tannah", "score": 6, "replies": [{"body": "You get the best of both worlds.", "score": 7, "replies": []}]}, {"body": "Imagine they might make it bundled with Hulu for a reduced cost at some point. Disney owns so many networks and Ip's.", "score": 2, "replies": [{"body": "They already [did](https://www.theverge.com/2019/8/6/20757626/disney-plus-espn-hulu-bundle-price-date-streaming-service)", "score": 4, "replies": [{"body": "Welp, when that's out, looks like I will actually cut Netflix. Hulu has enough random shows and movies. Plus I love sports, so I can watch a little of that with ESPN+. Disney is a damn goliath. People underestimate them because they only think of Mickey mouse. They have everything to offer, and own most of it too.", "score": 6, "replies": []}]}]}]}]}, {"body": "Ahoy matey!", "score": 1, "replies": []}, {"body": "Cool. Then don’t sign up.", "score": -2, "replies": []}]}, {"body": "Should I buy/sell/hold Netflix stock?", "score": 3, "replies": [{"body": "Yes", "score": 10, "replies": []}, {"body": "I'd take my profits and move on", "score": 4, "replies": []}, {"body": "I’d sell, i did a year ago", "score": 2, "replies": []}]}, {"body": "Netflix is going to nose dive in the coming years. Too much competition", "score": 18, "replies": [{"body": "[deleted]", "score": 35, "replies": [{"body": "Because all of Netflix's most watched content is not theirs. And with networks pulling the content to put on their own subscriptions, it reduces the want or need from it. As it is, I find myself having to look elsewhere because Netflix hardly has any movie I think of watching.", "score": 12, "replies": []}, {"body": "Netflix stock value is so high based on projections that they will own the market. Unless they come out with another product/service, they gonna have to share the streaming market with hulu, disney, apple, hbo/att, amazon etc. If I were to pay for these services, i would just rotate them monthly. 2 months of amazon prime, 2 month netflix, 2 month apple etc", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I think networks will have to evaluate whether consumers will switch services or get their streaming service if they take their shows off Netflix. \n\nLike if NBC’s Peacock or whatever has The Office but not much else that’s enticing, how many people will sign up *just for* The Office. I wouldn’t. If enough consumers don’t, then it might not be worth it for NBC.", "score": 2, "replies": [{"body": "It's a matter of Netflix being able to survive long enough for the market to conglomerate again; their originals don't necessarily seem quality enough to sustain them long term", "score": 3, "replies": []}]}, {"body": "All the shows?? Are we just ignoring all the wildly popular content Netflix has actually produced in this thread? I mean I get they will lose a lot, but they are just as successful with their own content as any of these competitors are in this new era.", "score": 4, "replies": []}]}]}, {"body": "The only real competition Netflix has is Amazon, Disney+ and (maybe in a couple of years) Apple TV+. The other streaming services are US only. Netflix is trying to become a 'global tv network'. Over 150 million subscribers of which only 60 million are in the US. Too many people seem to forget Netflix is playing a global game.", "score": 2, "replies": [{"body": "Good point. I personally forgot about that", "score": 1, "replies": []}]}]}, {"body": "If I own all 3 I’m guaranteed to win, right?", "score": 2, "replies": []}, {"body": "Water is wet.", "score": 2, "replies": []}, {"body": "NFLX is down 6% today. Looks like it'll be a good purchase soon.", "score": 5, "replies": []}, {"body": "#YEAH NO SHIT, HONEY\n\nBut realistically, duh. The massive spend on churning out original content that isn’t great and isn’t appealing to many people is going to be the death of them. More focus is needed on securing exclusivity contracts for highly popular shows and spearheading original content that appeals to wider audiences", "score": 2, "replies": []}, {"body": "Seinfeld to Netflix Game Over Disney", "score": 3, "replies": [{"body": ">Seinfeld to Netflix, check mate\n\nMissed opportunity there", "score": 1, "replies": []}]}, {"body": "If by tough competition, he means companies are creating a streaming bubble that will explode in all of their faces...", "score": 1, "replies": []}, {"body": "They are f’d", "score": 1, "replies": []}, {"body": "The fact Netflix cancels shows left and right is why they'll probably lose out", "score": 1, "replies": []}, {"body": "I think that as long as Netflix doesn’t do anything that might alienate its core demographics, they shouldn’t face much competition. Netflix is basically THE streaming service when it comes to this stuff and I think that they won’t be overtaken unless they just do something outright wrong", "score": 1, "replies": []}, {"body": "What’s there to “admit”? He knows it, we know it, and it will not change our opinion about Netflix. It’s the one of those household brands that you might not like everything about it, but it sure feels sinful to leave it. In the last few months i probably watched more hours of the auto-trailers and browsing the library than the actual movies and shows, yet I still feel I’m getting my money’s worth. Disney would be an addition, not a replacement in my house.", "score": 1, "replies": []}, {"body": "Eh not really, people cut the cord because they're tired of paying a ton of money for crap they won't watch. Why would I go and buy half a dozen or more streaming services now?", "score": 1, "replies": []}, {"body": "Streaming is a lousy business with lousy returns on capital. Netflix spends a fortune making content and then their free cash flows are negative so they just keep taking on more debt.", "score": 1, "replies": []}, {"body": "Netflix as a business probably isn't going anywhere, however their growth story has come to an end. With a PE > 100 NFLX is going to get hit hard. They have been a big winner for me but it's time to face facts. I think they're going to be headed for $200/share", "score": 1, "replies": []}, {"body": "Crapple vs DisneyShit. Hopefully they destroy each other", "score": -4, "replies": [{"body": "They will merge into one MEGASHIT", "score": 2, "replies": []}]}, {"body": "Maybe this will encourage them to stop fucking auto-playing their ads when I open the app. I'm about to cancel for that reason alone.\n\nEDIT: Why am I being downvoted?! Are there seriously people that enjoy that?", "score": -1, "replies": []}, {"body": "I think it's going to go towards renting/buying individual movies and tv shows because of all the exclusive rights bullshit; each service is going to have exclusive rights to stream a few big shows/movies but I doubt people are going to pay for every service so they can have access to all the content, easier to just go platform to platform watching what you want", "score": -1, "replies": []}, {"body": "How is it competition when you don't have the same content? All they're competing against is piracy.", "score": -5, "replies": [{"body": "Do you not think that cable TV channels are competing with each other for viewers?\n\nIt's the same way with Netflix and other streaming services. They aren't going to pay for every single streaming service out there, people have a limited budget to spend on streaming services.", "score": 6, "replies": [{"body": "This. Disposable income is limited and content is king.", "score": 3, "replies": []}, {"body": "whichever streaming services with the best content will win.", "score": 1, "replies": []}]}, {"body": "Not sure about that. Netflix has built a massive library of shitty content, and previously unheard of b movies. Admittedly, their direct produced content is half way decent, but it all will come down to which service has better product.", "score": -3, "replies": []}]}]}
{"title": "INVESTING Netflix is negative for the year now and Wall Street analysts are starting to panic", "selftext": "https://www.cnbc.com/2019/09/24/netflix-stock-is-negative-for-2019-and-wall-st-analysts-are-panicking.html\n\n\nPivotal Research Group cut its price target on Netflix shares by nearly a third on Tuesday, to $515 from $350.\n\nKeyBanc Capital Markets similarly expressed concern about Netflix’s upcoming results, saying that “even good results are unlikely to address competitive fear.”\n\nPivotal and KeyBanc join a chorus of concern that began in the past week by Bernstein and Barclays.\n\nIn July, 38 of the 40 analysts covering the company had either buy or hold ratings on Netflix shares, according to FactSet at the time.", "id": "d8mu34", "created_utc": 1569329912.0, "score": 321, "upvote_ratio": 0.96, "num_comments": 152, "comments": [{"body": "Sell, move over to Disney+\n\nThen sell Disney+ and move onto next trend", "score": 190, "replies": [{"body": "It is on reddit so it is already to late. When it was announced it was a great buy", "score": 50, "replies": [{"body": "[removed]", "score": 41, "replies": [{"body": "It was more as an year ago since the disney plus announcement.\nSo it was a little late to the hype", "score": 2, "replies": []}]}, {"body": "Still more room to grow then Netflix IMO, but they also have more income streams. Netflix has one and once a dominator in the field, now has competition from basically everyone. (Tinder even has a streaming service now)", "score": 11, "replies": [{"body": ">once a dominator in the field\n\nEnh, still are.  It's the future that's uncertain.", "score": 16, "replies": [{"body": "Agreed — I’ve invested them thinking they could innovate. I thought bandersnatch and interactive shows was a step and I thought it was smart of how they were able to start having dedicated content.\n\nI’m not so sure now", "score": 2, "replies": [{"body": "I was excited about their interactive shows and the experiment was sooooo disappointing. I don’t think it has legs at all.", "score": 1, "replies": []}]}]}, {"body": "Blockbusters was also once a dominator ;)", "score": 4, "replies": [{"body": "So was Boeing! I mean, it still is, but it was!", "score": 3, "replies": [{"body": "Are you saying i need to buy Airbus stocks?", "score": 1, "replies": [{"body": "No, just pointing out the antithesis to your comment.", "score": 2, "replies": []}, {"body": "BUT BRANIFF!", "score": 1, "replies": []}]}, {"body": "In manufacturing airplanes. In a market where there's essentially no switching costs and only switching benefits being a dominator is a tough place to stay.", "score": 0, "replies": []}]}]}, {"body": "Streaming video is a commodity.", "score": 2, "replies": []}]}]}, {"body": "You can’t just move to Disney+. You’re moving From a tech boom growth company to a fully matured and diversified multi-national. \n\nThe two services are comparable. The two holdings are not. \n\nThat being said, Disney isn’t a bad long term investment.", "score": 7, "replies": [{"body": "Hey, if the best option happens to belong to a much larger corporation, so be it", "score": -1, "replies": [{"body": "Yeah. But that wasn’t the point at all.", "score": 1, "replies": []}]}]}, {"body": "I literally thought about this last week,recently bought some Disney stock, and now I’m thinking about shorting Netflix (Though I still think it’s a risky move)", "score": 2, "replies": [{"body": "Could wait and see, currently 52 week low so might go up. If no support soon then I would get out and try to make gains else where. Just out a stop limit on Netflix and you'll be fine.", "score": 0, "replies": []}]}, {"body": "This guy (or woman) gets it", "score": 2, "replies": [{"body": "I continue to believe that Disney+ is complement, not a substitute, for Netflix.\n\nNetflix's main competition is Amazon, HBO, Hulu (also owned by Disney), Showtime, Starz, Cinemax, CBS All Access, Peacock (still can't believe they named it that), etc., etc.\n\nI don't believe the average adult is cancelling Netflix to subscribe to Disney+. They are **adding** a Disney+ subscription for their kids or to cater to their own nostalgia.", "score": 24, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "And has ESPN+. The real competition for Netflix is their Disney+/Hulu/ESPN+ bundle.", "score": 5, "replies": []}]}, {"body": "Take a look at what content Disney owns, then reassess.", "score": 2, "replies": [{"body": "Disney's adult content is going on Hulu, which I mentioned as a competitor.", "score": 2, "replies": [{"body": "Lion King cosplay porn has been around for years", "score": 3, "replies": [{"body": "And I'm just now hearing about it??", "score": 1, "replies": []}]}, {"body": "Are you serious? Or trolling? Can’t tell anymore.", "score": -1, "replies": [{"body": "Care to elaborate?", "score": 1, "replies": [{"body": "I guess it depends on what you mean by competition. It's D+ not hulu that will compete in terms of overall subs numbers. But there's a case to be made that hulu will cause more people to leave netflix than d+ will.\n\nIt may seem like option 2 matters more and it very well may but another service garnering a comparable amount of subscribers will put a ceiling on how much they can increase prices", "score": 1, "replies": []}]}]}]}]}, {"body": "> I don't believe the average adult is cancelling Netflix to subscribe to Disney+. They are adding a Disney+ subscription for their kids or to cater to their own nostalgia.\n\nYou need to go take a look at the stupid amount of media holdings Disney has since acquiring fox studios. They are easily poised to be a Netflix replacement.", "score": 1, "replies": [{"body": "I'm well aware. I mentioned Hulu as a main competitor to Netflix. But Disney+ will not be a direct competitor as it mostly serves a different market/niche.", "score": 1, "replies": []}]}]}]}, {"body": "Ehh Disney+ will just be another prong for a massive company. For Netflix, it’s their livelihood", "score": 1, "replies": []}, {"body": "Disney plus is trash. Only a small collection of old movies, and shows. Consumers will catch on.", "score": -2, "replies": [{"body": "Netflix is the same. Once you watch everything you want move onto the next. Disney+ is the new fresh thing. It will catch a decent amount of market share then level out. But the real question is how many consumer streaming services will the typical household have? 1,2,4? Who knows", "score": 7, "replies": [{"body": "Netflix continually adds good content. The problem is now everyone binge watches. None of these services can add new, high quality content as fast as we can watch it.", "score": 4, "replies": []}, {"body": "The real thing will be a comprehensive streaming service that negotiates rates with all services and sells it as a bundle. Granted, this will just be streaming \"cable\" essentially.", "score": 1, "replies": [{"body": "Whoever masters all-access live sports wins. That’s the only reason people still have cable", "score": 1, "replies": []}]}]}, {"body": "Yes but Disney has the merch/park game. They don’t even need to streaming fee money itself necessarily to make a profit.", "score": 2, "replies": []}, {"body": "Hahahahaha clearly you haven’t looked at the content list yet.", "score": 2, "replies": [{"body": "Man the \"I-land\" is premium content!", "score": 1, "replies": []}]}, {"body": "Do you realize how many movies and shows Disney has made? Thousands", "score": 2, "replies": [{"body": "You're correct. However, Disney has never publicly stated that their entire back catalog will be available on Disney+.\nIt's looking like they will offer rotational access to their back catalog while periodically adding new content.\nEveryone thinks that every Disney show ever made is going to be available on day 1. This is not the case....", "score": 2, "replies": [{"body": "They’ve never said that. All indications is that the entire library will eventually be available. The only reason it isn’t now is because a lot of content is locked up in previous deals that need to expire.", "score": 0, "replies": []}]}]}, {"body": "Rabble rabble rabble.", "score": 1, "replies": []}, {"body": "Literally half of existing content. Only downside is new content might be limited", "score": 0, "replies": []}]}]}, {"body": "CNBC needs to fix their summary.\n\n>Pivotal Research Group cut its price target on Netflix shares by nearly a third on Tuesday, to $515 from $350.\n\nThat last bit should say \"to $350 from $515\".", "score": 39, "replies": [{"body": "This. I was confused for a good 10s there.", "score": 8, "replies": [{"body": "Yup. I thought this was some shitposting till I got to this comment.", "score": 1, "replies": []}, {"body": "Your brain is on a 9,600 baud modem", "score": 1, "replies": []}]}]}, {"body": "overdue", "score": 12, "replies": []}, {"body": "When things start to balance out I might pick up some $NFLX. While there's other services that are emerging, most prominently Disney+, Netflix will remain the gold standard for streaming services. Hulu and Prime Video have been around for a while already, and Netflix still remained on top. They continue to regularly generate hype and win awards for original films and series. I see Disney+ as a complement to, not a replacement for Netflix. When it comes to monthly subscriptions, Netflix is still the best value. I think people will grow frustrated with how many services they have to subscribe to, prioritize, and choose to keep Netflix, either because it has the incumbent advantage and its what they know or because it's still the best value.", "score": 13, "replies": [{"body": "Be careful bud. Take a look at who Netflix is competing with...\n\n\nHBOmax - could easily become everyone’s “favorite” as the HBO brand carries a ton of weight and regularly puts out high caliber buzzy content. Could also end up killing its own brand by adopting the Netflix model of making shows for everyone, which as we’ve all seen has lead to a narrative that Netflix sucks and makes garbage. This service will be the deepest (behind Disney) in terms of IP and back catalogue since anything under the WB banner will be there. (HBO, Warner Bros, Turner, Cinemax, and more)\n\nDisney+ - will utterly dominate the US market in very short order. At least in terms of number of sustained subs. (Hulu, Disney, Pixar, Marvel, ABC, ESPN, Fox and more)\n\nPeacock - seems like a bit of a wild card. For some reason NBCs brand name always seems less interesting to consumers. But the library of shows and Universal films has its share of heavy hitters. (NBC, Universal, and more...)\n\nCBS all access - should do better than it will, still run with a dinosaur mentality, still needs to re-merge with Viacom so Paramount and the cable networks are all fully involved in generating content for the platform and providing full back catalogues of shows and movies.  (CBS, Paramount, and more...)\n\nNetflix - global growth means they are in fact “too big to fail” in a way. But their bread and butter in the US could be eroded massively by the legacy companies. Doesn’t have the catalogue or IP comparable to the legacy companies. Doesn’t have the cash to burn like the tech companies. Doesn’t have any ad revenue. Netflix could fall victim to the surge of streaming. Don’t be surprised if Netflix tries to do some exclusive deal with Lionsgate, MGM, or Sony.\n\nAmazon Prime - has all the money in the world to burn, and has already shown a willingness to burn it, and has already produced plenty of attention grabbing content. Because of the business model they can stay in business as long as they want to be in business.\n\nApple+ - has all the money in the world to burn, but that’s about it thus far. this one looks wonky from the start. It will have a lot of subs from iPhone purchases. But if they don’t hit homeruns early and fill out the service with a ton of licensed content there just won’t be much of a draw for paid subscribers. But, all the money in the world and a business model that isn’t exactly in direct competition. They could co-exist in the marketplace as long as they feel like it.\n\nQuibi - HAHAHAHAHAHAH\n\nThe big question is, will people have a true favorite and stick with it? Will one or more get sick of spending the money to churn out content like Netflix without seeing “tech darling startup” type of effect on its valuations and quit the game? Will there simply be two or three services that are just “better” and become everyone’s default? Will they all kind I’d blend together and who ever has the best flavors on the month get the subs until someone else puts out the new “it” show, and so on and so on?", "score": 4, "replies": [{"body": "This right here. There’s only so much market share to go around. Netflix might still be on top after the smoke clears, but how much market share will they bleed out to these other streaming services? My guess is quite a bit.", "score": 1, "replies": []}]}, {"body": "Netflix is the best value *for you*... you're forgetting about all the children in the world that don't give a shit about mindhunter and have parents that just want them to shut up so they buy Disney.", "score": 5, "replies": []}, {"body": "lol you down voted me just for describing my plans? i am taking my upvote back from your comment then, shit.", "score": 0, "replies": [{"body": "I didn't actually, but if you want it you got it", "score": 2, "replies": []}]}, {"body": "I just bought a lot of Disney this month for my taxable account (hold it for a long time) and like you, also waiting for Nflx to calm down to buy for my Roth to use as a short term flip", "score": -2, "replies": []}]}, {"body": "Is Disney+ available globally?", "score": 11, "replies": [{"body": "Not yet.", "score": 4, "replies": [{"body": "So Netflix will still have the global market.", "score": 8, "replies": [{"body": "Not really when they fragment the content available per country.", "score": 4, "replies": []}, {"body": "That way that can lose money globally!", "score": 6, "replies": []}, {"body": "Disney+ will have a full global rollout within 2 years. That’s nothing. A far more accelerated pace than Netflix when it rolled out globally", "score": 1, "replies": []}]}]}, {"body": "It's not available yet period.", "score": 3, "replies": []}]}, {"body": "I think Disney is pretty well positioned to make a killing on Disney+, even though it will take a long time to catch up to Netflix's subscriber numbers. Netflix is in a much rougher position.\n\nNetflix has been spending $12-15 billion on content just to have enough stuff for people to watch. I think I read that the Disney+ content budget is only $500 million for the launch, since they already have an unfathomably large catalog of Disney and Fox stuff just sitting there. \n\nAnd that's just going to keep increasing as existing streaming licensing deals expire and revert back to them, as well as new releases that will hit the service after making a killing at the box office. This kind of stuff is free for Disney and very expensive for Netflix.\n\nNetflix either needs to expand to new revenue streams somehow, or continue what appears to be a very unsustainable subscriber growth trajectory. Disney can pretty much just sit there and print money.", "score": 16, "replies": [{"body": "Disney has the pipeline of production already in place too. Plus they make money from studio releases and then to streaming. It's actually quite perfect.. Netflix can't release in theaters and has all their content go straight to streaming which loses a lot of value in the process", "score": 4, "replies": []}, {"body": "$12-15bn......And most of it besides the tent poles are complete rubbish.", "score": 7, "replies": [{"body": "Netflix doesn’t even make tentpoles.", "score": 5, "replies": [{"body": "Stranger Things is a cultural phenomenon, and Black Mirror is pretty popular.\n\nBut other than that they have a handful of niche shows in the IMDB top 100. I don't know anyone who watches Peaky Blinders.", "score": 8, "replies": [{"body": "Peaky Blinders is actually BBC - which adds to your point.", "score": 5, "replies": [{"body": "That's hilarious, I thought it was a Netflix original.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "every successful company faces competition", "score": 9, "replies": []}, {"body": "Still holding mine.  There will always be churn.  I own Disney too, but wouldn't subscribe to it.  Wall St. is always nervous, but you never know what new series NFLX will come out with to sway film fans.", "score": 22, "replies": [{"body": "El Camino", "score": 19, "replies": [{"body": "It’s not a series though, if you really wanted to watch it and you didn’t already have a subscription then you’d just use the free trial. Or just pirate it...", "score": 5, "replies": [{"body": "Pirating goes for all shows and movies though...", "score": 3, "replies": [{"body": "Yeah just sayin’ one film ain’t gonna save Netflix.", "score": 1, "replies": [{"body": "NFLX along with Amazon always introduce new shows and series, plus have a backlog of things to watch.   If you enjoy films, series, etc. where are you going to go?", "score": 2, "replies": [{"body": "Popcorntime, primarily. Rarely need much else.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "He also says to buy at a reasonable price. At 102 times forward earnings, I don't think you'll hear Buffet recommending Netflix anytime soon.", "score": 4, "replies": []}]}]}, {"body": "There are multiple Netflix direct competitors with great streaming content coming online.  They are well financed and take market shared directly from Netflix.", "score": 27, "replies": [{"body": "I disagree. I think many of these streaming services will serve as a complement to, not a replacement for Netflix.", "score": 13, "replies": [{"body": "Reposting my comment from another thread...\n\nHBOmax - could easily become everyone’s “favorite” as the HBO brand carries a ton of weight and regularly puts out high caliber buzzy content. Could also end up killing its own brand by adopting the Netflix model of making shows for everyone, which as we’ve all seen has lead to a narrative that Netflix sucks and makes garbage. This service will be the deepest (behind Disney) in terms of IP and back catalogue since anything under the WB banner will be there.\n\nDisney+ - will utterly dominate the US market in very short order. At least in terms of number of sustained subs.\n\nPeacock - seems like a bit of a wild card. For some reason NBCs brand name always seems less interesting to consumers. But the library of shows and Universal films has its share of heavy hitters.\n\nCBS all access - should do better than it will, still run with a dinosaur mentality, still needs to re-merge with Viacom so Paramount and the cable networks are all fully involved in generating content for the platform and providing full back catalogues of shows and movies.\n\nNetflix - global growth means they are in fact “too big to fail” in a way. But their bread and butter in the US could be eroded massively by the legacy companies. Doesn’t have the catalogue or IP comparable to the legacy companies. Doesn’t have the cash to burn like the tech companies. Doesn’t have any ad revenue. Netflix could fall victim to the surge of streaming. Don’t be surprised if Netflix tries to do some exclusive deal with Lionsgate, MGM, or Sony.\n\nAmazon Prime - has all the money in the world to burn, and has already shown a willingness to burn it, and has already produced plenty of attention grabbing content. Because of the business model they can stay in business as long as they want to be in business.\n\nApple+ - has all the money in the world to burn, but that’s about it thus far. this one looks wonky from the start. It will have a lot of subs from iPhone purchases. But if they don’t hit homeruns early and fill out the service with a ton of licensed content there just won’t be much of a draw for paid subscribers. But, all the money in the world and a business model that isn’t exactly in direct competition. They could co-exist in the marketplace as long as they feel like it.\n\nQuibi - HAHAHAHAHAHAH\n\nThe big question is, will people have a true favorite and stick with it? Will one or more get sick of spending the money to churn out content like Netflix without seeing “tech darling startup” type of effect on its valuations and quit the game? Will there simply be two or three services that are just “better” and become everyone’s default? Will they all kind I’d blend together and who ever has the best flavors on the month get the subs until someone else puts out the new “it” show, and so on and so on?", "score": 3, "replies": [{"body": "None of what you said convinced me that anyone is capable of being a Netflix replacement. As much as I like HBO, nobody drops Netflix for HBO. Prime Video is a complement to Amazon Prime, which is worth it even without Prime Video. Hulu even is nice for filling in niches that Netflix and Prime don't have, but is an otherwise second or third tier streaming service.\n\nNetwork streaming services don't even rate. The only things they'll put a dent in is cable television subscriptions. I imagine that most people don't want to subscribe to six different services, and I don't network streaming services will make the cut unless customers fit their niche.\n\nAnd Disney+ my lord, people act as if they have a monopoly on entertainment. Yes, Marvel is nice and Disney movies are good, but guess what? Just about every Disney movie on there most people would have seen. Sure, they have a few originals coming out which is great, but it's *not enough to replace a comprehensive streaming service like Netflix*.", "score": 6, "replies": [{"body": "It’s amazing that no one else seems to understand that. How much utility will Disney + have if you aren’t a child? Are these adults seriously going to rewatch all these Disney movies or marvel movies month after month? Disney won’t be the end all be all streaming service.", "score": 2, "replies": [{"body": "Hulu. They have an entire second streaming service (within Disney+ that will contain a fuck load of adult content. They bought Fox precisely for this. A full film and television studio to produce non-Disney. They’ll have FX, FXX, NatGeo...\n\nAnd yes, a load of adults are going to rewatch Star Wars, Marvel, Pixar, and Disney movies.", "score": 1, "replies": []}]}, {"body": "I mean this with respect, if your investing in any of these companies you need to catch up a bit. Hulu is Disney and will be in Disney+. It’s where they will house everything not Marvel, Star Wars, Disney animation, Disney live action, Disney Channels, Simpsons... so all of Fox features, Fox network, FX, ABC...\n\nAnd obviously all the new content produced exclusively for the service AND all the new feature films for Marvel, Star Wars, Disney animation, Disney live action, Fox, and new television for Disney Channel, Disney Jr, Disney XD, Fox, FX, FXX, ABC, ESPN, National Geographic,\n\nThe idea that Disney+ isn’t going to be comprehensive is shortsighted. The idea that Disney isn’t coming after “adults” is also shortsighted. It’s a big part of why they bought Fox and will continue using it to produce non “Disney” content by the boat load. \n\nAs for HBO, its being mandated from AT&T that is expand its programming way beyond just HBO. It’s adopting a much more Netflix like approach by making content for “everyone”. Not just HBO prestige stuff, but everything Warner Brothers and DC produce, as well as a lot of new stuff that’s made for different demos (key to Netflix’s success). \n\nNetflix’s saving grace is that it’s gone global and it makes content for every demo. But it doesn’t have cash reserves or a vast library or multiple studios producing content. It has to spend at a big deficit to maintain. Without major growth it suffers. With three serious competitors and two alternatives that a ton of people will just have as by products of other services, there are certainly some reasons to think that Netflix could contract.", "score": 1, "replies": []}, {"body": "Hbo max isn't just hbo stuff though. Lot more than that", "score": 1, "replies": []}]}, {"body": ">Apple+ - this one looks wonky from the start.\n\nMy girlfriend and I howled with laughter at the See preview that played during football. No idea who they're going after with that one, but unfortunately I think you're right that it'll generate revenue purely because of bundling and the cult of Apple.", "score": 3, "replies": []}, {"body": "No Hulu???", "score": 2, "replies": [{"body": "Hulu is going to be in Disney+", "score": 1, "replies": []}]}]}]}, {"body": "Netflix also has a cash flow problem", "score": 6, "replies": [{"body": "That's intentional though. They're spending heavily on original programming, and I think the idea is to build a large back catalog that they own. They'll probably scale it back eventually to return to profit, but not whilst competitors are popping up.", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That is their strategy. (Not saying it’s gonna work)", "score": 2, "replies": []}]}, {"body": "Yes and no. Their largest expense is renting content not producing their own. They are trying to make their own catalog which is good for the reason I listen in another comment. But long story short Netflix has being bleeding money from operating and has a massive challenge ahead.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "They spend a lot more than they make", "score": 11, "replies": []}, {"body": "Just because net income doesn’t mean shit. It can be be hidden with interest and depreciation and etc..but that’s what’s taxed. Low NI lower taxes. The problem with Netflix is they are losing money operating IE their fcf and ocf are negative. Which means the lose money the longer they operate. They make money by people subscribing so even if the make great shows they still have a fixed revenue while all the content they don’t make is having to be paid for which causes them to have to constantly pay providers for these shows just to keep and maintain currently subs. All these new streaming services which have a vast amount of context they already own and very deep pockets are going to kill Netflix’s sub base even harder and can pull all their content off Netflix. Now Netflix has to produce all their own content and can only sell it for a fix revenue while prices to produce these only get higher. This created a dramatic problem with their cash flows. \nAka Netflix might have a positive net income but have a massive cash flow problem they are trying to address with new competitions join. \n\nSorry if this is confusing or error riddles. I’m on mobile and just ranted.", "score": 3, "replies": []}, {"body": "The company's core operations are consistently negative. We're talking billions of dollars lost year after year. Meanwhile, the company continues to add billions in debt. It's a financial nightmare. \n\n* Cash flows from operating activities (Q2): -543.75 million\n\n* Proceeds from issuance of debt (Q2): 2.24 billion\n\n* Long-term debt as of March 31, 2017: 3.37 billion\n\n* Long-term debt as of June 30, 2019: 12.59 billion", "score": 1, "replies": []}]}]}]}, {"body": "Or distilled to its essence:  Netflix price target $350", "score": 4, "replies": []}, {"body": "I'm still holding, the next quarter is usually good for subscriber growth & I think a lot of people are underestimating international growth.", "score": 6, "replies": [{"body": "Winter is generally good for netflix subscriber growth.", "score": 8, "replies": [{"body": "Why? I'm intrigued.", "score": 2, "replies": [{"body": "Too cold. Must stay inside and stream.", "score": 6, "replies": []}]}]}, {"body": "In addition if you look at analyst ratings almost all\nthe recent once were still positive, in the article they just pick two ratings that were lowered and created a doomsday article about it.", "score": 3, "replies": []}]}, {"body": "Movie pass anyone? 😂 jokes aside. I think that disney+ will compliment other services like hulu and netflix. The real battle is between those platforms. However one way i keep looking at is is. We all remember the high costs of cable bills. Well most do... as long as the total cost of the platforma is less then the costs of cable was i think consumers will be happy. How many services is that 1,2,3 4? I dont think there will ever a be an all streaming platform and atleast 1-2 will be required for a full viewing scope. The stock prices of these streaming services are grossly over valued for companies that are majority losing money on subs. Just like movie pass their plan to scale revenues isnt working with more subs. They are hemorrhaging Money like most growth tech stocks and when the reckoning comes we are gonna have only the strongest services left. Cant tell you which it could be but i can tell you from experience nothing...is to big to fail.", "score": 2, "replies": [{"body": "The amount of people that don’t know Hulu is Disney and it will contain all the adult and Fox\nContent are in for a rude awakening.", "score": 4, "replies": [{"body": "Every single time I see someone talk about streaming they talk about Hulu and Disney+ separately. It’s really not public knowledge at all and kind of hilarious when people knock Disney+ in favor of hulu (among other companies)", "score": 1, "replies": [{"body": "I’m seeing a lot of people (possible investors) here severely underestimating Disney+. As if it’s only for children.", "score": 1, "replies": []}]}]}]}, {"body": "From $515 to $350.  Fine.  Netflix is currently trading at ~$250.  So it’s a buy, right?\nConvince me it’s not.  They have a strong list of new and/or original content coming.  Excellent platform support, solid streaming performance at scale.", "score": 2, "replies": []}, {"body": "Not surprising.\n\nCompetition from all sides (Disney+, Peacock, Apple TV) - both for customers and for content.\n\nPeople disliking Netflix taking political sides, dropping subs.", "score": 2, "replies": []}, {"body": "Ugh, should've sold at $425", "score": 2, "replies": []}, {"body": "panicked selling = buying opportunity", "score": 2, "replies": []}, {"body": "I guess Netflix is gonna get delisted from FANG turning it into ....", "score": 2, "replies": []}, {"body": "It’s ‘to $350 from $515’.", "score": 1, "replies": []}, {"body": "Hm", "score": 1, "replies": []}, {"body": "Sandler.", "score": 1, "replies": []}, {"body": "I'm starting to panic but my NFLX shares are in my Rollover IRA that I can't touch for almost 50 years anyways so I guess I should just hide the red ticker in my account.", "score": 1, "replies": []}, {"body": "I just don't see competition taking away from Netflix subs. Netflix original programming is good enough for me to keep it. It's not expensive at all.", "score": 1, "replies": []}, {"body": "Netflix has more competition than ever, not to mention the slight price changes in various markets.  \nWith Disney + on the way, launching in most key markets at the same time - I suspect Netflix will lose a small % of its user base. (Short term)\n\nHowever they may regain the lost customers after a short period of time, but Disney is going to have an impact long term, and it would seem just like the PC gaming market , every god damn service out there is creating their own platform. Netflix could still rise should they some how negotiate deals with those others.\n\nRumour also is Apple want to buy Sony pictures - whether thats true or not, Apple have the least content on their platform so they do need something", "score": 1, "replies": []}, {"body": "\\>> Pivotal Research Group cut its price target on Netflix shares by nearly a third on Tuesday, to $515 from $350.   \n\n\nDid you get to and from backwards?", "score": 1, "replies": []}, {"body": "Netflix puts ftw.", "score": 1, "replies": []}, {"body": "lol at $515 or $350 price targets.\n\nThis is going to be $20 or less in 10 years.", "score": 0, "replies": [{"body": "I actually agree with you. Their debt load is unsustainable given the competition and they won’t be able to borrow to refinance in a coming downturn when cash rich companies like Apple, Disney and Amazon are their new entreat competitors who are literally using the streaming services as loss leaders for their real products.", "score": 1, "replies": [{"body": "Price. Increases. Incremental to the point that we shrug it off as ‘same price as a coffee’.", "score": 1, "replies": [{"body": "I disagree, for the first time I’m seriously considering getting rid of Netflix I have I’ve had since blockbuster was still a thing. \n\nAnd likely I will. I rarely find the shows I know and love and the Netflix idea that I only want to watch a show for three seasons is wrong. That may allow them to make more content but I’m tired of getting to the last episode with a cliff hanger and no more episodes.", "score": 1, "replies": [{"body": "I’m sure you’re not alone in being aggravated by early cancellations. But they are starting to create better content imo. That said you might have a shorter fuse than most that will chalk up another price increase as inflation, or whatever you want to call it. \n\nSide note, they are brokering deals with other service providers I.e Tmobile and AT&T to offer their service as an incentive. Lots of Netflix users aren’t directly paying for the service so increases aren’t felt directly, thus they don’t give a shit", "score": 1, "replies": [{"body": "Sure, but those deals don't mean the same subscriber pricing. They do not get the same income from them as they would if those users came directly to them.", "score": 1, "replies": [{"body": "You have an article on what AT&T and Tmobile are paying Netflix? I’d love to know as I’ve always been curious if they’re paying less than us individuals", "score": 1, "replies": []}]}]}]}]}, {"body": "Is $20B debt with $160B market cap really that bad tho... I didn't think it was bad", "score": 1, "replies": [{"body": "Those are mostly unrelated numbers. You need to look at debt vs ability to pay it (i.e. income)", "score": 1, "replies": []}]}]}]}, {"body": "Anyone else think Netflix is going to get bought out soon?", "score": -5, "replies": [{"body": "No.", "score": 7, "replies": []}, {"body": "Not soon, no.  Which isn't to say they may get bought out later by someone like Apple, they have deep pockets.   But if you already own NFLX then you are ready if they get bought or not.", "score": 4, "replies": []}, {"body": "SOny, MGM, and Lionsgate are all currently on the outside looking in. \n\nApple seems happy to do its own thing for now.", "score": 1, "replies": []}, {"body": "Netflix doesn't own anything for them to be bought out.", "score": -3, "replies": [{"body": "Huh? I guess I misphrased. I think Apple is going to but Netflix within 2 years.", "score": 3, "replies": [{"body": "Apple isn't going to buy Netflix. How absurd.", "score": -3, "replies": [{"body": "Why do you think thats absurd? Apple+ and Disney+ are coming out. The video streaming space is getting crowded.", "score": 4, "replies": [{"body": "Why the fuck would Apple buy Netflix.  \n\n\nNetflix doesn't do or own anything special to be bought by Apple.   \n\n\nAre you dense?", "score": -9, "replies": [{"body": "Can we address the unnecessary hostility on reddit? We are on r/stocks, we are not executives on wall street, I’m just a dude. I don’t claim to be some smart whiz who knows everything. Check how you talking to me behind your keyboard buddy. Everyone I know has Netflix. Apple is making their own streaming platform. The best way to beat your competition is to buy them.", "score": 14, "replies": [{"body": "I stopped my netflix. \n\nYou know why?\n\nBecause all the companies took their hit shows off of it.\n\nNetflix is dead and the people who have netflix are just people letting their subscriptions roll on every month while watching < 5 hours of it per month. \n\nNetflix is circling the drain. 5 years will be the spiral and 10 years will be the death.", "score": 1, "replies": [{"body": "> Netflix is dead and the people who have netflix are just people letting their subscriptions roll on every month while watching < 5 hours of it per month.\n\nThis month I’ve already watched four hours of the GBBS, a few hours of The Chef Show, two Lord of the Rings movies, a couple hours of Dark Crystal, American Factory, Bill Burr and Dave Chapelle’s new stand up, and I’m probably going to watch Between Two Ferns, and Travel’s With My Father, and maybe that Bill Gates thing. \n\nNotice how I didn’t even mention any of their hit shows that a fuckload of people watch. \n\nNetflix is not dead, but it does have a lot of competition soon.", "score": 2, "replies": []}, {"body": "I just don’t see people canceling Netflix and paying for Disney/Apple+. Netflix was the first to the game. But I do think you’re right and that’s why I think Apple or Disney or some other company will buy Netflix. The company has hit its peak, if I were the founders I would be ready to cash out my chips, before they are worth less. Then whoever buys Netflix can put their content on it while having that built in subscriber base that Netflix has.", "score": 1, "replies": [{"body": "I think torrents will be more popular soon with all the fragmented streaming services. :) Where can i buy Torrent stocks?", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Trump's trade war with China has badly hurt Netflix international expansion.", "score": -11, "replies": [{"body": "How so?  Is China imposing tariffs on streaming services?\n\nIt doesn't seem related\n\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2019/05/10/netflix-has-a-china-strategy-it-doesnt-involve-launching-there-soon.html", "score": 5, "replies": [{"body": "https://finance.yahoo.com/news/how-trumps-trade-war-could-hammer-netflix-160034721.html", "score": 1, "replies": []}]}, {"body": "Most retarded comment on Reddit today.", "score": 5, "replies": [{"body": "https://finance.yahoo.com/news/how-trumps-trade-war-could-hammer-netflix-160034721.html", "score": -1, "replies": []}]}, {"body": "No it hasn’t \n\nNetflix got majorly cock blocked in China way before the trade war started.", "score": 1, "replies": []}]}]}
{"title": "$TSLA Daily Investor Discussion - September 27, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "d9xrso", "created_utc": 1569575530.0, "score": 22, "upvote_ratio": 0.96, "num_comments": 150, "comments": [{"body": "Just when I thought I was out… they pulled me back in!\n\nAnother record breaking day in Netherlands, 537 Model 3 delivered yesterday:\n\n30% SR+  \n58% LR AWD  \n12% P", "score": 20, "replies": [{"body": "> Just when I thought I was out…\n\n<elon haha>", "score": 5, "replies": []}, {"body": "Wow", "score": 1, "replies": []}]}, {"body": "https://electrek.co/2019/09/27/tesla-police-patrol-performing-extremely-well-fremont-misleading-story/", "score": 19, "replies": [{"body": "Looks like fake news again.\n\nThe article claims:\n\n> We emphasized that it was a “user error” since an officer forgot to plug in the car to charge it after a previous shift.\n\nBut the official statement from the police department is:\n\n> While not policy, we recommend officers begin their shift with at least a half tank of gas or in this  case, a battery charge of 50%. On this date, our officer driving the Tesla noted approximately 50% of battery life when he began his shift.\n\n[https://local.nixle.com/alert/7552308/?sub\\_id=293429](https://local.nixle.com/alert/7552308/?sub_id=293429)\n\nSo this was not user error, not even close.  Will see whether Fred corrects his own \"user error\". .\n\nedit.  fixed quote format", "score": 5, "replies": []}, {"body": "One incomplete side of the story was reported to push a certain narrative?\n\nNo way! /s", "score": 6, "replies": [{"body": "i was shocked and appalled!", "score": 3, "replies": [{"body": "So they are going to report this side of the situation now too, right?!", "score": 3, "replies": [{"body": "i mean, i'd expect nothing less from any balanced media outlet", "score": 3, "replies": []}, {"body": "Yes.  They reported the truth, rather than the \"user error\" spin from that blogger.\n\n> While not policy, we recommend officers begin their shift with at least a half tank of gas or in this case, a battery charge of 50%. On this date, our officer driving the Tesla noted approximately 50% of battery life when he began his shift.\n\nhttps://local.nixle.com/alert/7552308/?sub_id=293429", "score": 2, "replies": []}]}]}]}, {"body": "I read that headline yesterday .. \"Tesla police car almost runs out of battery during high speed chase\" .\n\n\nSooo ... In other words, everything went perfectly? Job was done?\n\nBest not to concern ourselves worrying about the idiots who will read a headline like that and come away making jokes about a Tesla actually running out of power during a chase ... they're lost anyway", "score": 0, "replies": [{"body": ">Sooo ... In other words, everything went perfectly? Job was done?\n\nNo.  He gave up pursuit. \n\n> Best not to concern ourselves worrying about the idiots who will read a headline \n\nNo need to concern ourselves about people who don't read the article and draw conclusions about the job being done.", "score": 6, "replies": [{"body": "Eheh \\^\\^\n\nThe troubles of not wanting to give clicks to the negative articles ... Lesson learned", "score": 1, "replies": []}]}]}]}, {"body": "NL+NO+SP in Q3 (9884) has now surpassed Q1 (9427) which was higher than Q2 (8253).  There are 2 more working days left in the quarter... Definitely looks like it'll be an all-time European high for Tesla.\n\nAlso interesting: the percentage of Performance models in NL+NO+SP has gone up to 6.99%.  AWD is 60%, RWD 0.53% and SR+ is 34.45%", "score": 18, "replies": [{"body": "Saw that. Looks like it was a day behind too if I remember correct (9/26).", "score": 3, "replies": []}]}, {"body": "I got V10 release. I think V10 and 10.x will make Tesla cars even more compelling than other brands, regardless of EV or ICE.", "score": 16, "replies": [{"body": "Any noticeable improvements to AP? I'm surprised at the lack of posts on v10 AP given that's it's now been out for 24 hours.", "score": 8, "replies": [{"body": "I love to use autopilot. In the past, my only complaint was when red light turns green, the car in front of me pulls away, my car hesitate a bit. Now it's just 100% perfect, just like how I would drive. \nSome people may think this is a minor thing, to me this is huge. In the past because of my car's slow reaction, I frequently have to push accelerator to keep up with the flow. Now it's 100% perfect. There are other improvements around visualization.", "score": 12, "replies": [{"body": "I’ve definitely noticed this problem. Even more hyped for v10 now", "score": 2, "replies": []}, {"body": "This hesitancy is the computer erring on the side of caution.  Waymo does the same, especially at non-stop light left hand turns.  95% confident isn't safe enough.  99% confident probably isn't safe enough either.  It functioning smoothly may seem small, but it represents a significant increase in confidence as a result of a significantly improved software.", "score": 1, "replies": [{"body": "I guess it's just a constant they set in the program to decide how fast the car accelerates after the front car left. But who knows, if they let AI to decide this action, and improved this much, that's impressive.", "score": 2, "replies": []}]}]}]}, {"body": "I was watching a car commercial recently and they were touting their \"amazing\" interface and screen. It looked clunky, dated, and tiny compared to my TM3 and I laughed out loud.", "score": 13, "replies": []}, {"body": "in which way would it be more compelling? Because of Enhanced Summon? Or because of Tesla Theater? Those are pretty much the major new features... It remains to be seen how well Enhanced Summon will do, but Tesla Theater is really only relevant for EV's (and even then...) since people generally don't spend a lot of time sitting in a parked car.  \n\nFor me personally, I don't really expect to use Tesla Theater as I prefer to get out of the car while charging.\n\nTo be clear: i definitely think it's a nice update, but I don't think it really makes Tesla's _even more_ compelling.", "score": 6, "replies": [{"body": "ah I can imagine Spotify is compelling for a bunch of people... i always take that one for granted because the european Tesla's have always had it, and because i'm an apple music user :)", "score": 9, "replies": [{"body": "I was an Apple Music user until I got my Model 3 in the UK a month ago. Moved to Spotify in a heartbeat. Funny what Tesla adding it as an app can do - wonder how many new users there might be. Also love the web player as that was really missing with Apple Music.", "score": 1, "replies": []}, {"body": "I'm not sure how Spotify would make Tesla 'more compelling than other brands' when other brands have had Spotify available on CarPlay/AA for quite a while now.", "score": 1, "replies": []}]}, {"body": ">since people generally don't spend a lot of time sitting in a parked car.\n\nYou must not be a parent :)", "score": 3, "replies": [{"body": "I am", "score": 1, "replies": []}]}]}]}, {"body": "Somehow they managed another 200+ delivery day in Norway today. I think they were at 150 at like 6:15PM. If the 3k Netherlands story is true, I am excited for next week (I'm actually excited either way). TSLA looking really strong against the market today, considering the run yesterday", "score": 16, "replies": [{"body": "Yeah, and from what I’ve heard about Norway, work-life balance is very important there, so they generally avoid working late.  The fact that that number went up over 200 after 20:30 is pretty telling.  I wouldn’t be surprised if we’ll see some Norwegian deliveries over the weekend as well then (which they usually don’t do).", "score": 5, "replies": [{"body": "I gotta imagine they're delivering this weekend in NL too. Do you recall if they've done that before?\n\nEdit: looks like there were ~50 MS/X today too. Nice", "score": 5, "replies": [{"body": "No idea, I’ve never really followed the NL deliveries so I don’t know what to expect.  If they really want to go for those extra 3K deliveries, I wouldn’t be surprised if they keep going till midnight on Monday really.", "score": 4, "replies": []}]}]}]}, {"body": "Fiat lied about monthly sales... Old news?\n\nhttps://finance.yahoo.com/news/fiat-chrysler-pay-40-million-163644107.html", "score": 13, "replies": []}, {"body": "Me: Smart Summon is awesome. More people will want a Tesla when they see it in person. \n\nJim Thanos: Porsche is coming - with smart turbo", "score": 21, "replies": [{"body": "Jim Who?", "score": 12, "replies": []}, {"body": "Smart turbo....\n\nLike a real turbo this time? Or are they still confused on what turbo means?", "score": 3, "replies": []}]}, {"body": "Heavy volume out the gate.", "score": 7, "replies": [{"body": "Over a million in the first 5 mins!", "score": 5, "replies": []}]}, {"body": "Looking to add another 100 shares at any time in the next few months. Started in Jan at 300 and have averaged down to about 252 since. When would you think is best to make the purchase and why?", "score": 5, "replies": [{"body": "Now is a good time. Relatively under-valued. (of course two days ago is a better time). Or wait til next Monday, since SPY is shitting now.\n\nReally anytime next few months is ok though. If you are long term, simply buy it on a red day (yes buy when it is falling on negative news).", "score": 8, "replies": [{"body": "Great point. Was afraid of this when buying my first Tesla shares and ended up buying as a result of FOMO on really good days. Since then I’ve only bought on bad days and accumulated a fair bit when it was around 240. Just wondering what could happen to the stock if there is a recession in the next 12 months.", "score": 4, "replies": [{"body": "Yep, I learned that in a hard way as well :-)\n\nThe market talks about recession a lot nowadays. Personally, I don't see any systematic risk, just potential growth slow down for SPY. But that alone can bring SPY back to 2 years ago and a 10-20% correction.\n\nAs long as there is no systematic risk, individual stock with good growth prospect will still be fine, speaking of Tsla back to 2 years ago....\n\nUnless terrible things like 2008 surfaced in next year, then a 30-50% discount can happen for every stock. I don't think anyone is seeing that at this stage, or whoever sees the true risk won't tell the public until it matures....", "score": 2, "replies": []}]}]}, {"body": "Q: When?\n\nA: Now\n\nQ? Why?\n\nA: Gonna moon any time now", "score": -1, "replies": [{"body": "Downvoted for using moon like we are some cut rate bitcoin bro blog.", "score": 14, "replies": [{"body": "Haha I'll take it. I may have needed to add some humor indicator or something", "score": 3, "replies": [{"body": "That darned poe got me again", "score": 1, "replies": []}]}, {"body": "Hodl gang going to $420 says millionaire. Click to find out more", "score": 1, "replies": []}, {"body": "Tesla is WAY more volatile than Bitcoin and probably has more swing traders than holders", "score": 1, "replies": [{"body": "Not sure if this is troll post or not, even after seeing who the commenter or is lol", "score": 1, "replies": [{"body": "Actually not even being sarcastic", "score": 1, "replies": []}]}]}]}]}]}, {"body": "https://twitter.com/mortenlund89/status/1177622496490803201\n\n>\t3000 deliveries of Teslas especially #Model3 in Amsterdam from Thursday until 23:59 Monday \n-\tDutch sources tell me!\nAll hands are on deck! \n#EOQpush\n#Tesla\n\n>\t@EVNewsDaily @alex_avoigt @BarkMSmeagol @TeslaArmy @ronhuiskamp @SteveHamel16 @tesla_truth @nasalahe @jpr007 https://twitter.com/mortenlund89/status/1177622496490803201/photo/1", "score": 11, "replies": [{"body": "If they can delivery 3K til next Mon, which we can track via registration, that will be a great feat for the Dutch delivery team! \n\nHoping that is 3K that tops above 100K, not 3K to reach 100K delivery...", "score": 5, "replies": []}, {"body": "Holy schnitzel", "score": 6, "replies": []}, {"body": "That's not a wave, that's a tsunami.", "score": 3, "replies": [{"body": "They do know a thing or two about 420 over there... maybe they’re just extra sympathetic", "score": 2, "replies": [{"body": "Been a while since Elon sold some custom merch. I vote for a Tesla vaporizer with 2170 cells for cordless operation.", "score": 2, "replies": []}]}]}, {"body": "M3 deliveries in the Netherlands are already more than last q. So far", "score": 1, "replies": []}]}, {"body": "Any bets on the number of Smart Summon videos that will be uploaded on youtube by the end of this weekend ?\n\nVegas over-under is 72.", "score": 6, "replies": [{"body": "At Apple Park, with over 700 registered model 3s, we are all wondering who will be the first one to try and summon it out of the ring.", "score": 3, "replies": []}]}, {"body": "Is /u/stockbroker still banned? I would like to see his buy and hold TSLA vs S&P500 chart although it's a little late.", "score": 5, "replies": [{"body": "Test.", "score": 9, "replies": [{"body": "There you are! If you don't want make a dedicated post, I'm alright with a link in my pm. I look forward to this chart monthly regardless of it's findings. I tried to make it myself but I'm not as proficient in Excel, and the overlay on tradingview does not show a hold to date comparison.", "score": 5, "replies": [{"body": "Will probably just post it here over the weekend using data at close today.", "score": 7, "replies": [{"body": "I appreciate that", "score": 1, "replies": []}]}]}]}, {"body": "I ended up recreating the chart when he was banned.  \n\nI added in both sides of the trade, when it would beat SPY to short TSLA.  I know its not quite 1:1 since shorting is on margin, but hopefully its an accurate enough comparision.  \n\nAlso have one more chart to map change in short interest, so you can see at what point short interest increased or decreased.  Value of 300 is pretty interesting since it shows shorts covering at the best times to short the stock (wonder if those were short squeezes)\n\nFinally, put in a field to enter a hypothetical value for TSLA if you want to see how the chart looks at different values.\n\nWould love feedback on what other information we can gather or if you find any errors.\n\nhttps://docs.google.com/spreadsheets/d/1Gbqve4lPxz0ApnebalVwidVFxwmwZZG4vPgZzb4ywYY/edit?usp=sharing", "score": 3, "replies": [{"body": "Good effort. \n\nCouple comments:\n\n1. You aren’t adjusting SPY for dividends. You’re basically reducing the true S&P500 return by about 2% per year, which is significant. You should use the total return index or a proxy of it (mutual fund with reinvested dividends) for a more accurate comparison. \n\n2. No short-only fund in the history of mankind has outperformed the S&P 500. No -100% short should be expected to beat the S&P 500. That said, I like your charts presentation.", "score": 3, "replies": [{"body": "Ahh good call on the SPY dividends.  Didn't realize those weren't reinvested.  Thanks.  Updated my local copy for the next time someone asks for the chart.", "score": 1, "replies": []}]}, {"body": "Whoops, missed the last 3 months in the chart even though it was in the data.  Updated the chart.", "score": 1, "replies": []}]}]}, {"body": "White House is considering extreme measures against China firms in US and investment going to China.\n\nIt does not seem to affect Tsla or GF3 in a direct way though...But if the US-China clash escalates further, GF3 may become affected.", "score": 5, "replies": [{"body": "I don't think Europe or China would take any extreme measures against GF3 or GF4. Trump can take action against GF1 or GF2 if he wants less American production.", "score": 7, "replies": [{"body": "One cannot exclude this possibility with China. \n\nI do agree the likelihood is very small, since Elon and China appears to be in a good relationship, which rarely happens with other American entrepreneur.", "score": 3, "replies": []}]}, {"body": "Let's not forget that GF3 is financed by the Chinese officials, and they want it to succeed. I can't see the Chinese taking unnecessary actions against their own investment.", "score": 1, "replies": [{"body": "They could confiscate it for their own purposes and there would be nothing Elon could do about it.", "score": 0, "replies": [{"body": "Yes, I also understand the stipulations of the mud pit. It will employ almost 7,000 people in the Shanghai area. Why would they put any sort of unnecessary pressure on Tesla for all those people to lose their job? \n\n>for their own purposes\nSo another Chinese \"Tesla killer\" like NIO can produce there instead? Ha.\n\nBTW, how is NIO doing? Weren't they supposed to crush Tesla in China? 🤔", "score": 1, "replies": [{"body": "Wasn't Tesla supposed to be profitable every quarter? 🤔", "score": 1, "replies": [{"body": "I wonder what you will grasp onto once GF3 is at capacity and fsd revenue starts being recognized each quarter. Must be getting hectic over there. Just keep up on your talking points and you'll be fine.", "score": -2, "replies": [{"body": "I wonder what you'll grasp on to when Tesla has to raise capital again.", "score": 0, "replies": [{"body": "Lol yeah, because capital raising is the end all be all of companies 🤦‍♂️\n\nTesla was supposed to go bankwupt every year for like, what, the last 8 years? Ha.", "score": 0, "replies": [{"body": "It's the be all and end all of Tesla.\n\n>Tesla was supposed to go bankwupt every year for like, what, the last 8 years? \n\nAnd they would have, had they not been able to continually raise capital. Which they're going to continue to have to do.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Start preparing now for the quarterly FUD headlines:\n\"Tesla sales are down 60% MoM as demand concerns return again\"", "score": 3, "replies": [{"body": "\"Tesla revenue down for the quarter YoY despite massive increase in production and sales\"", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "\"One year on: Profit a distant memory despite record sales after ramping up Model 3 production\"", "score": 1, "replies": []}]}, {"body": "Buying any dips that these headlines are causing", "score": 1, "replies": []}]}, {"body": "“Musk going to jail for selling SpaceX some Tesla S/X battery packs at cost! Tesla shareholders furious!”", "score": 1, "replies": [{"body": "FYI, in case you do not follow SpaceX...they are literally installing multiple S/X battery units in the Starship prototype. I believe, six per rocket. They are there to drive the massive electric motors that power the high-speed trim fins. So this joke was brought to you by reality-adjacent.", "score": 2, "replies": []}]}]}, {"body": "Macro has a micropenis.", "score": 7, "replies": [{"body": "Its good that Tesla has been able to maintain growth when China/Europe aren't.  At the moment I'm still expecting there to be a pretty large panic moment which should be a good buying opportunity.", "score": 2, "replies": [{"body": "There's going to be a point of escape velocity for Tesla soon enough. Once they post profit 2 quarters in a row purely due to manufacturing improvements, I'm going to likely double my holding.", "score": 2, "replies": [{"body": "at this rate it will happen, but most likely 2020 Q3 and Q4, at which time their volume is enough to post healthy profit => stock may rise significantly.\n\n2020 Q1 may repeat the same seasonal drop like 2019 Q1, I suspect, so profit is unlikely. But this time everyone is familiar with the situation so probably stock will stay stable.", "score": 1, "replies": []}]}]}, {"body": "which is again good for individual stocks!\n\nThe story is brewing though, and there are still plenty room for SPY to drop today and Monday...so I will wait a bit...", "score": 1, "replies": []}]}, {"body": "As today is option expiry day, not expecting much rise -- staying around 240 shall be a good sign.\n\nNow that 100K is priced in, really hoping Tsla can report a little more than that for some upward movement leading to earnings. \n\nAt 100K with smart summon release, my expectation for Q3 earning is still a loss, but hopefully a very small one.", "score": 2, "replies": [{"body": "Nothing is ever priced in with TSLA.", "score": 13, "replies": []}, {"body": "what about the profitability this qtr? any estimates about it?", "score": 4, "replies": [{"body": "from Yahoo finance, current revenue estimate is 6.36B, Eps is -0.43 per share, which is about -70M profit.\n\nAt 100K delivery, the revenue estimate is a bit low, while eps is unreasonably high. By simple comparison with Q2 finance, I think revenue lies in 6.5-7B, while profit shall be about -100M to -250M considering some deferred revenue recognition.\n\nI don't know why Wallst keeps on high-balling the profit estimate though -- they keep on doing this for the past three quarters, which caused post earning stock price to drop quite a lot.", "score": 5, "replies": [{"body": ">I don't know why Wallst keeps on high-balling the profit estimate though\n\n>which caused post earning stock price to drop quite a lot.\n\nExactly", "score": 5, "replies": []}]}]}, {"body": "Maybe some priced in. But might not fully get there until it’s actually reported. And if it came in lower could be downside.", "score": 2, "replies": []}]}, {"body": "When is the official last day of the quarter?  How does reporting deliveries work? Do they file anything with the sec first?", "score": 2, "replies": [{"body": "The last day of the month. Tesla a few days after the end of the quarter has a practice of reporting deliveries for the quarter. How much info,they choose to give is up to them at that time. Several (3-5) weeks after end of quarter, official quarterly financial reporting for public company will happen.", "score": 5, "replies": []}, {"body": "Tesla will put out a shareholder letter probably Wednesday. Check the blog or investor relations section of the website.\n\nSee here for the pervious letters, and this is where it’ll be posted.\n\nhttps://ir.tesla.com/index.php/press-releases", "score": 4, "replies": []}]}, {"body": "What do we know about demand or shipping to Japan? Apparently they just added the Japanese language to the UI.", "score": 2, "replies": [{"body": "Curious here too - typically the Japanese market is pretty hard for foreign companies to penetrate if there are domestic alternatives.  \n\nRegardless of BEV vs ICE, the Japanese market is pretty loyal to domestic industries.", "score": 1, "replies": []}]}, {"body": "Attach your seatbelts people, next quarter we're going to the moon.", "score": 3, "replies": [{"body": "Slow and steady...", "score": 5, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Yeah, no need to talk about the moon, Mars, or short squeeze. Just have a solid investment plan, earn/save as much money as you can, add shares (not just TSLA shares) when it's obviously a bargain. Never use margin.", "score": 4, "replies": []}]}, {"body": "You mean to the mars? :P", "score": 5, "replies": []}]}, {"body": "> MORGAN STANLEY: \".. we underestimated\" the \"multiple challenges\" that have caused slower near-term adoption of autonomous driving. (Jonas)\n\n> * Lowers its forecast for shared miles traveled in the US to 25% by 2030 -- down from prior 46%.", "score": -1, "replies": [{"body": "Jonas is a complete joke.", "score": 12, "replies": [{"body": "It’s gotten so bad that I might even rethink my investment if he becomes bullish again 🤷‍♂️", "score": 11, "replies": [{"body": "Solid play honestly.", "score": 3, "replies": []}]}]}, {"body": "Adam Jonas is the poster boy for being out of your depth. He was handed Tesla because it vaguely falls under being an \"auto\" analyst, so he's faking it till he makes it. Shame you can say w.e. the hell you want as an \"analyst\" and keep your job, but it's  career suicide to honestly admit you don't know.", "score": 3, "replies": []}, {"body": "Jonas is pretty much a joke analyst. And I don't know why any investor, retail or institution, would listen to his view. The same can be said for many other analysts on the street, bear or bull alike.\n\nOne can come up with better delivery estimate using basic registration statistics and do a better job, just like insideev and Troyteslike. Yet Jonas simply pulls out a number from nowhere (250K delivery estimate for Tesla at Q1, and $10 bear case stock price, etc.), and keeps on being wrong on Tesla...", "score": 3, "replies": []}, {"body": "It does seem like everyone doing it other than Tesla has hit a brick wall due to using lidar.", "score": 7, "replies": [{"body": "The crutch that keeps on giving", "score": 4, "replies": []}, {"body": "I'm not so sure the brick wall is related to Lidar.  It seems more like experts in the field are realizing that the task is a LOT more complex than they bargained for.", "score": 5, "replies": [{"body": "From what I saw of autonomy day it seems like the expert actually is making better progress than he expected.", "score": 5, "replies": [{"body": "Would you expect anything else from a pre-capital raise event? \n\nCoast to coast 2K17.", "score": -2, "replies": [{"body": "From a capital raise perspective I would have expected more confidence about demand rather than \"I don't know, I think it will work out\" which is what I remember from the event.  Autonomy isn't really driving the stock price at the moment.", "score": 1, "replies": [{"body": "On the investor call to actually raise money after the autonomous day, Musk basically said that the hardware part of the business is a “backdrop of value” and that autonomy is what will take them to a $500 billion valuation. \n\nSo, I dunno about autonomy not being relevant to the valuation or the fundraising.", "score": -3, "replies": [{"body": "I mean just fundamentally the analysts didn't really have the technical background to care about autonomy day.  So if it were about short term fundraising they would have talked about demand, etc.\n\nThey were just talking about autonomy day because the idea of talking about demand and so on is boring to them.", "score": 1, "replies": [{"body": "I think Elon really expected it to be received differently... he was really looking for visual feedback from the audience at multiple times in the video, stressing specific parts or trying it to make it less technical.  It just went over most people’s heads IMO, but I’m pretty sure Elon expected that to really boost the stock.  Especially since it was planned 2 days before the horrible Q1 earnings.", "score": 3, "replies": [{"body": "You have to look at the context of what was going on at the time...Autonomy Day was held in late April just before Uber launched their IPO roadshow.\n\nGoldman Sachs was an active bookrunner on the Uber IPO, and ultimately also led the TSLA capital raise in early May.\n\nI would be willing to bet that in the weeks prior to Autonomy Day, Goldman told Elon that early investor feedback for Uber indicated that investors were going to impute a lot of value on Uber's autonomy technology.\n\nMy hypothesis is that Musk saw the Uber IPO coming and wanted to capture a portion of that buzz for TSLA.  Hence: the bullsh!t robotaxi idea was born", "score": 3, "replies": [{"body": "Bingo.", "score": 2, "replies": []}, {"body": "Tesla Network was known way before that... your post was really good, but the last sentence is very telling.", "score": 2, "replies": [{"body": "So you're a believer in the robotaxi?", "score": 2, "replies": [{"body": "Not at all, but to act like it’s a new thing since autonomy day is, to be blunt, pretty ignorant", "score": 3, "replies": [{"body": "My argument is that: knowing Uber's autonomy pitch to investors and Uber's likely IPO timing (both thanks to Goldman), Elon decided to jump ahead and hype Tesla's own version of Autonomy.  The robotaxi (and the appreciating car) were part of that hype message.\n\nI know you're not suggesting that I'm ignorant...that would be a rule violation.", "score": 2, "replies": [{"body": "> You will also be able to add your car to the Tesla shared fleet just by tapping a button on the Tesla phone app and have it generate income for you while you're at work or on vacation, significantly offsetting and at times potentially exceeding the monthly loan or lease cost. This dramatically lowers the true cost of ownership to the point where almost anyone could own a Tesla. Since most cars are only in use by their owner for 5% to 10% of the day, the fundamental economic utility of a true self-driving car is likely to be several times that of a car which is not.\n\nhttps://www.tesla.com/blog/master-plan-part-deux\n\nPublished in 2016.  If you’re gonna voice strong opinions about Tesla, and you don’t know about this, you’re either ingorant or trolling.  Being ignorant isn’t against the rules, trolling is.  Pointing out that somebody’s knowledge is lacking isn’t exactly against the rules either.  Feel free to report my rule violation to one of the other mods if you feel confident about it.", "score": 3, "replies": [{"body": "Published in 2016 and it magically becomes a focus again in April 2019...\n\nStop twisting my words.  For the 3rd time: my point is that the timing and messaging of Autonomy Day was not random.  It was driven by the timing and messaging of the then upcoming Uber IPO and TSLA's own need for capital.  \n\nOf course Musk was looking for feedback during Autonomy Day -- he was about to announce crappy 1Q results and he had capital to raise.  Uber's IPO hadn't launched yet, so TSLA's capital raise was going to be the test case for the autonomy thesis", "score": 2, "replies": [{"body": "> my point is that the timing and messaging of Autonomy Day was not random\n\nYes, this is pretty much what I’ve been saying from my first comment in this thread as well.\n\nI’m just saying that your statement that robotaxi came out of this whole thing is ignorant, and the link I posted clearly showed that.", "score": 3, "replies": [{"body": "I will stand by my view that the concept of robotaxis (especially in 2020) and appreciating cars were blatant and baseless attempts to pump the share price in the face of disappointing results and the near-term need for capital.\n\nDoes this strong opinion qualify as trolling?  I'm making an important point on an investor forum -- the readers of this sub should know that TSLA will need even more capital if MY, pickups, semi's, roadsters etc are ever going to become a reality.  Absent better financial results there is more hype and exaggeration yet to come.", "score": 2, "replies": [{"body": "Nah i wouldn’t call it trolling\n\n>\t will stand by my view that the concept of robotaxis (especially in 2020) and appreciating cars were blatant and baseless attempts to pump the share price in the face of disappointing results and the near-term need for capital.\n\nBut I stand by my point that this is ignorant.  Neither of us is going to change each other’s mind here, so I guess we’ll just have to agree to disagree.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The model 3 was designed from the start with an internal camera that is currently inactive, but there for when the Tesla Network goes active. The internal camera is specifically to record passengers when you have put your taxi on the Network.\n\nThe “robotaxi idea”, whether it works out or not, has been around at least from the design stages of the model 3. They wanted to make sure all owners of every Model 3 could choose to put their var on the Network if they wanted to (paying for FSD if they haven’t).\n\nRegardless of who wins the autonomy race (uber, google, tesla, one of the 50 startups), why is it “bullshit”? A great deal of money seems to disagree with you.", "score": 1, "replies": [{"body": "Truly autonomous vehicles may one day be a reality.\n\nIf Tesla survives, it may even be a leader in this technology.\n\nI am 100% confident, however, that there won't be a single robotaxi in 2020, let alone a million of them.  Recent comments by Waymo confirm that this technology will not be deployed until much further in the future -- and Waymo would know, as their cars are closer to Level 5 than anyone else's.\n\nWhat I think is \"bullshit\" is Elon Musk talking up this vision as if it's really going to happen next year, and then to sell stock to retail investors a few days later without any mention of robotaxis in the offering prospectus.  Do  you not think there's something wrong with that?", "score": 1, "replies": [{"body": "Well, there are robotaxis opperating right now, just not Teslas. (Not just Waymo, but all have safety drivers still...even though Florida law does not currently require it.)\n\nAlso, Musk never claimed a million robotaxis operating next year. He said there will be a million cars on the road that have all the hardware (and software if you believe his projection) to BE robotaxis if the Network meets regulatory approval...allowing however many people choose to mess up their Teslas with cab passengers.\n\nI’ll factor in the revenue of the Network the quarter they actually report revenue from the Network. But no, I do not think it is fraud. I am also sure neither one of us is the foremost expert on the planet concerning machine learning, visual neural network computing, or AD.", "score": 1, "replies": [{"body": "I know what Musk said and what he said is pure bullshit.  Robotaxis without safety drivers are so far away that no one (besides Musk) is even trying to estimate when it's going to happen.  See this [Bloomberg article](https://www.bloomberg.com/news/articles/2019-09-27/waymo-valuation-slashed-on-autonomous-vehicle-tech-delays)\n\n>The hype around self-driving cars has subsided as investors and analysts realize broad adoption won’t happen as soon as many thought. Waymo, [Uber Technologies Inc.](https://www.bloomberg.com/quote/UBER:US), [General Motors Co.](https://www.bloomberg.com/quote/GM:US), [Tesla Inc.](https://www.bloomberg.com/quote/TSLA:US) and others keep making advancements and running tests, but the dream that human drivers could be eliminated in the next few years has largely been abandoned.\n\nI know a lot about securities law and the SEC is holding Musk to a different disclosure standard than other public company executives.  I for one think this is wrong.", "score": 1, "replies": []}]}]}]}]}, {"body": "Exactly. A big part of the presentation was: here is years of Tesla investment and work that has produced the computing hardware for autonomous driving and it is far better than NVIDIA’s solution in the market segment because it is specifically designed for our cars and FSD. \n\nReaction by crowd: uhhh...so you have a new computer in your car now? You already had one of those and your people said fancy words, but your hardware could never, ever be better than an actual chip company’s product like NVIDIA. “We also don’t care you make your own crappy car seats.” Clearly another case of Musk being delusional about his tech, the crowd mutters to itself. \n\nAnother part was monetizing the Tesla Network as access to a new order of magnitude of potential revenue off the back of the Neural Network learning.\n\nReaction by crowd: uhh, if it will be so valuable, what’s to stop someone just starting their own taxi company using your cars? (An actual audience question from that day.) Your numbers mean your cars are more valuable to use as taxis than to sell. That could not possibly be true.\n\nMusk’s counter reaction: Anyone is welcome to buy our cars, but they will only be able to FSD taxi service using the Tesla Network, which gives Tesla a cut of the revenue.\n\nAnalyst counter-counter reaction “No, you are wrong, I don’t see it.” Musk shrugs.\n\nThe whole thing went like that. Really only one crowd member, a tech guy, asked an interesting question.\n\nThe next day, talking heads were saying “Musk not focusing on demand cliff. Instead of taking action to sell more cars, car company CEO is babbling about make-believe science fiction stuff they are wasting money on. Tesla should stop doing anything other than ‘focusing’ on making a basic car, everything else is a costly distraction.”\n\nFor next spring,I can only wonder if wall street car analysts believe battery technology and production are a real thing; or if they have always been saying to themselves “batteries are batteries...why does Tesla waste resources on battery tech?”", "score": 2, "replies": [{"body": ">Your numbers mean your cars are more valuable to use as taxis than to sell. That could not possibly be true.\n\nAre you saying that \"it makes no sense to sell the cars given these nbers\" can't be true or are you just putting them together as statements that were said?", "score": 1, "replies": [{"body": "The analysts did not believe the numbers. The analysts at the event (you can watch) clearly were not buying the math they were giving. Musk kept looking for a positive reaction. They were looking at him like they were being forced to sit through Musk telling them a fairy tale. The talking heads on CNBC also mocked Tesla.\n\nPersonally, I think the number of people willing to put their Tesla on the Network to make money is smaller than many projections I have seen. But it seems to me that every Uber/Lyft driver would probably trade in their car to do it if the Network actually becomes a reality.\n\nIMO, and I am not expert on this type of market,  Elon’s vision of most cars being used for ride sharing the 90% of time they are just sitting around is not going to happen. I see people wanting to buy a Tesla and running it all day in a big city as a side-job. I just do not see people who can afford a Tesla without needing to put it on the Network being willing to do so regularly. But people who could not otherwise afford a car? Sure...they would take on the risk and work cleaning and maintaining a taxi.", "score": 2, "replies": [{"body": ">The analysts did not believe the numbers.\n\nNeither do I. We're talking about an actually ludicrous rate of return.\n\nI tend to agree with you on who is likely to rent their cars out on the Tesla network, except that it won't be just one car. If those numbers are true people will be buying fleets.", "score": 2, "replies": []}]}]}]}, {"body": "I agree my point is that is the classic engineering mistake of not asking your audience what they care about.", "score": 1, "replies": []}]}, {"body": "I don’t know how you can look at Tesla’s valuation and say “yeah, it’s the money-losing hardware (cars, panels, batteries) that justify this valuation.” \n\nLike, even on the last call Musk was pushing the FSD margin expansion story and a lot of people are buying it. \n\nI think a lot of Tesla longs are in it for the FSD moonshot. IMO, Tesla needs to win the FSD race for this valuation to make sense. \n\nThe technical stuff was just the background for the pitch that came with the equity/debt raise. Needed some “meat” to the pitch.", "score": 1, "replies": [{"body": "The valuation came before they ever claimed that they were trying autonomy.  It's more about the iPhone of cars idea in my opinion", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Everyone using lidar has to create annotated HD maps of every road in the world, maybe they are realizing that could take a while.", "score": 3, "replies": [{"body": "Its more that that just isn't good enough.  They haven't even managed to do a single road without a driver.", "score": -1, "replies": [{"body": "Yea I still don't understand how they will get lidar to work in rain, fog, snow & dust either. The lasers just get scattered and are useless. Whereas Tesla's cameras seem to do better than humans at seeing lanes in the rain.", "score": 2, "replies": []}, {"body": "Are you saying that Waymo has never driven on the street without a driver?", "score": 2, "replies": [{"body": "I mean there is nowhere where I can go to get in a Waymo car and go  on a road without a driver.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ah yes, Jonas. The $10 per share guy, right?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -26, "replies": [{"body": "Stock going down due to some fud in the news = buying for cheap.\nBut stock going down due to bad results = a real concern.", "score": 10, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "If you are in for a long time, then the difference between 230 vs 240 is insignificant. Imagine someone  regretting buying tsla 24$ instead of 23$. Thats silly", "score": 11, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": -7, "replies": []}]}]}]}]}]}
{"title": "Noob Safe Haven Thread | Sept 30 - Oct 6 2019", "selftext": "Post any options questions you wanted to ask, but were afraid to ask.   \nA weekly thread in which questions will be received with equanimity.  \n**There are no stupid questions, only dumb answers.**  &nbsp;  **Fire away.**  \nThis is a weekly rotation with past threads linked below.   \nThis project succeeds thanks to people thoughtfully sharing their knowledge and experiences (YOU are invited to respond to questions posted here.)       \n\n----\n\n**Perhaps you're looking for an item in the frequent answers list below.**  \n\n----\n\nFor a **useful** response about a particular option trade,  \ndisclose position details, so that responders can assist.  \nVague inquires receive vague responses.    \nTell us:     \nTICKER -- Put or Call  --  strike price (for each leg, on spreads)  \n-- expiration date -- cost of option entry -- date of option entry  \n--  underlying stock price at entry -- current option (spread)  market value     \n--  current underlying stock price      \n-- your rationale for entering the position.  &nbsp;       [.](https://www.reddit.com/r/options/comments/8c90wg/how_to_ask_smart_questions_to_get_smart_answers/)\n\n-----\n\nKey informational links:     \n•&nbsp;[Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)            \n•&nbsp;[List of Recommended Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)             \n•&nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)        \n•&nbsp;[The complete side-bar informational links, for mobile app users.](https://www.reddit.com/r/options/comments/bda4yh/noob_safe_haven_thread_apr_1521_2019/elce2oi/)     \n \n**Links to the most frequent answers**\n----     \n*I just made (or lost) $____. Should I close the trade?*       \nYes, close the trade, because you had no plan for an exit to limit your risk.    \nYour trade is a prediction: a plan directs action upon an (in)validated prediction.       \nTake the gain (or loss). End the risk of losing the gain (or increasing the loss).        \nPlan the exit before the start of each trade, for both a gain, and maximum loss.       \n•&nbsp;[Exit-first trade planning, and using a risk-reduction trade checklist (Redtexture)](https://www.reddit.com/r/options/comments/9at2fu/noob_thread_aug_26_sept_1/e4ywq0u/)   \n\n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)     \n\n*Getting started in options*     \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/9m9u0w/noob_safe_haven_thread_oct_0815_2018/e7di9s8/)    \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/comments/cqg536/exercise_assignement_a_guide/)    \n•&nbsp;[Some useful educational links](https://www.reddit.com/r/options/comments/9m9u0w/noob_safe_haven_thread_oct_0815_2018/e7orrtb/)       \n•&nbsp;[Some introductory trading guidance, with educational links](https://www.reddit.com/r/options/comments/a0enaz/noob_safe_haven_thread_nov_26_dec_2_2018/eahpg7m/?context=3)     \n•&nbsp;[Options Expiration & Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n•&nbsp;[Expiration time and date (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)   \n\n*Common mistakes and useful advice for  new options traders*          \n•&nbsp;[Five mistakes to avoid when trading options (Options Playbook)](\nhttps://www.optionsplaybook.com/rookies-corner/five-options-trading-mistakes/)      \n•&nbsp;[Top 10 Mistakes Beginner Option Traders Make (Ally Bank)](https://www.ally.com/do-it-right/investing/top-10-option-trading-mistakes/)          \n•&nbsp;[One year into options trading: lessons learned  (whitethunder9)](https://www.reddit.com/r/options/comments/8jsj8o/one_year_into_options_trading_lessons_learned/)    \n•&nbsp;[Here's some cold hard words from a professional trader (magik_moose)](https://removeddit.com/r/Forex/comments/bmwz72/heres_some_cold_hard_words_from_a_professional/)    \n•&nbsp;[Thoughts after trading for 7 Years  (invcht2)](https://www.reddit.com/r/pennystocks/comments/cw9sjr/thoughts_after_trading_for_7_years/)   \n•&nbsp;[Avoiding Stupidity is Easier than Seeking Brilliance (Farnum Street Blog)](https://fs.blog/2014/06/avoiding-stupidity/)   \n•&nbsp;[20 Habits of Highly Successful Traders (Viper Report) (40 minutes)](https://www.youtube.com/watch?v=el10dgDa2Do)   \n•&nbsp;[There's a bull market somewhere (Jason Leavitt) (3 minutes)](https://www.youtube.com/watch?v=udnVXIQdRQs) \n\n*Trade planning, risk reduction and trade size, etc.*      \n•&nbsp;[Exit-first trade planning, and using a risk-reduction trade checklist (Redtexture)](https://www.reddit.com/r/options/comments/9at2fu/noob_thread_aug_26_sept_1/e4ywq0u/)   \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)          \n•&nbsp;[An illustration of planning on trades failing. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)          \n•&nbsp;[Trade Simulator Tool  (Radioactive Trading)](http://www.radioactivetrading.com/trade_sim.asp)     \n•&nbsp;[Risk of Ruin  (Better System Trader)](http://bettersystemtrader.com/riskofruin/)    \n\n*Minimizing Bid-Ask Spreads (high-volume options are best)*        \n•&nbsp;[Fishing for a price: price discovery with (wide) bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)       \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)            \n•&nbsp;[List of option activity by underlying (Barchart)](https://www.barchart.com/options/most-active/stocks)      \n•&nbsp;[Open Interest by ticker (optinistics)](http://www.optionistics.com/f/open_interest?op=highoi&bystk=stk)  \n      \n*Closing out a trade*       \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position)            \n•&nbsp;[When to Exit Guide (Option Alpha)](https://optionalpha.com/wp-content/uploads/2015/01/When-To-Exit-Guide.pdf)          \n•&nbsp;[Risk to reward ratios change over the life of a position: a reason for early exit (Redtexture)](https://www.reddit.com/r/ActiveOptionTraders/comments/ataw61/why_close_out_a_call_or_put_at_50_profit/eh00lie/)  \n                     \n*Options Greeks and Option Chains*     \n•&nbsp;[An Introduction to Options Greeks  (Options Playbook) ](https://www.optionsplaybook.com/options-introduction/option-greeks/)  \n•&nbsp;[Options Greeks (Epsilon Options)](https://epsilonoptions.com/options-greeks/)  \n•&nbsp;[Theta Decay: The Ultimate Guide (Chris Butler - Project Option)]\n(https://www.projectoption.com/theta-decay/)    \n•&nbsp;[Theta decay rates differ: At the money vs. away from the money](https://www.reddit.com/r/options/comments/9j8m42/theta_question_linear_decay/)   \n•&nbsp;[Theta: A Detailed Look at the Decay of Option Time Value (James Toll)](http://jtoll.com/post/theta/)     \n•&nbsp;[Gamma Risk Explained - (Gavin McMaster - Options Trading IQ)](http://www.optionstradingiq.com/gamma-risk-explained/)    \n•&nbsp;[How Often Within Expected Move? Data Science and Implied Volatility (Michael Rechenthin, PhD - TastyTrade 2017)](https://www.tastytrade.com/tt/shows/the-skinny-on-options-data-science/episodes/how-often-within-expected-01-12-2017)     \n•&nbsp;[A selected list of option chain & option data websites](https://www.reddit.com/r/options/comments/a0enaz/noob_safe_haven_thread_nov_26_dec_2_2018/eaip9lx/)     \n     \n*Selected Trade Positions & Management*    \n•&nbsp;[The Wheel Strategy  (ScottishTrader) ]( https://www.reddit.com/r/options/comments/a36k4j/the_wheel_aka_triple_income_strategy_explained/)    \n•&nbsp;[Rolling Short (Credit) Spreads  (Options Playbook)](https://www.optionsplaybook.com/managing-positions/)   \n•&nbsp;[Rolling Short (Credit) Spreads (Redtexture)](https://www.reddit.com/r/options/comments/db6mpt/noob_safe_haven_thread_sept_30_oct_6_2019/f25vssp/)   \n•&nbsp;[Synthetic option positions: Why and how they are used  (Fidelity)](https://www.fidelity.com/learning-center/investment-products/options/synthetic-options-recorded-webinar)    \n•&nbsp;[Covered Calls Tutorial (Option Investor)](https://www.optioninvestor.com/page/oin/cc/tutorial/)    \n•&nbsp;[Take the loss (here's why)  (Clay Trader) (15 minutes)](https://www.youtube.com/watch?v=Bw5R02Gx-bs&t=2m53s)    \n•&nbsp;[The diagonal calendar spread and \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/comments/9w8q85/noob_safe_haven_thread_nov_1218_2018/e9pmdhf/)     \n•&nbsp;[Creative Ways to Avoid The Pattern Day Trader Rule (Sean McLaughlin)](https://medium.com/@chicagosean/creative-ways-for-undercapitalized-options-traders-to-avoid-the-pattern-day-trader-rule-ccdc504de794)   \n•&nbsp;[Short calls and puts, and dividend risk (Redtexture)](\nhttps://www.reddit.com/r/options/comments/db6mpt/noob_safe_haven_thread_sept_30_oct_6_2019/f2rxzu3/)    \n•&nbsp;[Options and Dividend Risk (Sage Anderson, TastyTrade)](\nhttp://tastytradenetwork.squarespace.com/tt/blog/options-and-dividends)     \n•&nbsp;[Options contract adjustments: what you should know  (Fidelity)](https://www.fidelity.com/learning-center/investment-products/options/contract-adjustments)         \n•&nbsp;[Options contract adjustment announcements / memoranda  (Options Clearing Corporation)]( https://www.theocc.com/webapps/infomemos)      \n\n*Implied Volatility, IV Rank, and IV Percentile (of days)*     \n•&nbsp;[An introduction to Implied Volatility (Khan Academy)](https://www.khanacademy.org/economics-finance-domain/core-finance/derivative-securities/black-scholes/v/implied-volatility)   \n•&nbsp;[An introduction to Black Scholes formula (Khan Academy)](https://www.khanacademy.org/economics-finance-domain/core-finance/derivative-securities/black-scholes/v/introduction-to-the-black-scholes-formula)       \n•&nbsp;[IV Rank vs. IV Percentile: Which is better?  (Project Option)](https://www.projectoption.com/iv-rank-vs-iv-percentile/)     \n•&nbsp;[IV Rank vs. IV Percentile in Trading (Tasty Trade) (video)](https://www.youtube.com/watch?v=KvuQGqKBh2U)       \n\n*Miscellaneous:   \nEconomic Calendars,  International Brokers, RobinHood,  \nPattern Day Trader, CBOE Exchange Rules, Contract Specifications,  \n TDA Margin Handbook,  EU Regulations on US ETFs, US Taxes and Options*     \n•&nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/comments/9ybg17/noob_safe_haven_thread_nov_1925_2018/ea1yf2z/)         \n•&nbsp;[An incomplete list of international brokers dealing in US options markets (Redtexture)](https://www.reddit.com/r/options/comments/a0enaz/noob_safe_haven_thread_nov_26_dec_2_2018/eaxtgk2/)   \n•&nbsp;[Free brokerages can be very costly: Why option traders should not use RobinHood](https://www.reddit.com/r/options/comments/bk9ehg/got_screwed_by_rh_on_assigned_shares_sold_the/)  \n•&nbsp;[Pattern Day Trader status and $25,000 margin account balances  (FINRA)](https://www.finra.org/investors/day-trading)   \n•&nbsp;How to find out when a new expiration is opening up: email: marketservices@cboe.com for the status of a particular ticker's new expirations.   \n\n•&nbsp;[CBOE Contract Specications and Trading Days & Hours](http://www.cboe.com/products/contract-specs-and-trading-hours/contract-specs)   \n•&nbsp;[TDAmeritrade Margin Handbook (18 pages PDF)](https://www.tdameritrade.com/retail-en_us/resources/pdf/AMTD086.pdf)     \n•&nbsp;[Monthly expirations of Index options are settled on next day prices](https://www.forbes.com/feeds/options/2007/06/01/options17391.html)    \n•&nbsp;[PRIIPS, KIPs, EU regulations, ETFs, Options, Brokers](https://www.reddit.com/r/options/comments/8u5la2/priips_kips_eu_regulations_etfs_options_brokers/)   \n•&nbsp;[Key Information Documents (KIDs) for European Citizens (Options Clearing Corporation)](https://www.theocc.com/about/publications/kids.jsp)    \n•&nbsp;[Taxes and Investing  (Options Industry Council) (PDF)](http://www.optionseducation.org/content/dam/oic/documents/literature/files/taxes-and-investing.pdf)   \n•&nbsp;[CBOE Exchange Rules (770+ pages, PDF)](https://www.cboe.com/aboutcboe/legal-regulatory/cboe-exchange-inc-corporate-documents-and-rules)    \n•&nbsp;[NASDAQ \n Options Exchange Rules](http://nasdaqphlx.cchwallstreet.com/NASDAQPHLXTools/PlatformViewer.asp?selectednode=chp_1_2_1&manual=%2Fnasdaqomxphlx%2Fphlx%2Fphlx-rulesbrd%2F)\n\n----  \nFollowing week's Noob thread:  \n[Oct 7-13 2019]\n(https://www.reddit.com/r/options/comments/deczdg/noob_safe_haven_thread_oct_713_2019/)   \n\nPrevious weeks' Noob threads:   \n[Sept 23-29 2019](https://www.reddit.com/r/options/comments/d826tu/noob_safe_haven_thread_sept_2329_2019)    \n[Sept 16-22 2019](https://www.reddit.com/r/options/comments/d4vr7l/noob_safe_haven_thread_sept_1622_2019/)    \n[Sept 09-15 2019](https://www.reddit.com/r/options/comments/d1p8xy/noob_safe_haven_thread_sept_0915_2019/)    \n[Sept 02-09 2019](https://www.reddit.com/r/options/comments/cyik9q/noob_safe_haven_thread_sept_0209_2019/)     \n[Aug 26 - Sept 02 2019](https://www.reddit.com/r/options/comments/cviwyn/noob_safe_haven_thread_aug_26_sept_02_2019/)      \n\n\n[Complete NOOB archive, 2018, and 2019](https://www.reddit.com/r/options/comments/a90p4t/noob_safe_haven_thread_dec_2430_2018/ecfjiwt/)", "id": "db6mpt", "created_utc": 1569819075.0, "score": 11, "upvote_ratio": 0.93, "num_comments": 150, "comments": [{"body": "3 months ago I made a big mistake and I sold an IC near dividend pay out date of the stock and lost 10% of my account after being assigned. I didn't realize the option seller pays the dividend to the option buyer. I have since made back all the money I lost, however it begs the question...\n\n\n\n\nWhat else don't I know? Do any of you experienced option traders have a similar story that you learned from. \n\n\n\n\nI like to avoid future mistakes by learning from yours. Thanks.", "score": 4, "replies": [{"body": "It is not the short option holder that pays a dividend.   \n\nThe holder of short **stock** pays the dividend to the party that lent the stock to the trader  \n(lent in order for the trader without stock to fulfill assigning stock to an exercising long call holder).\n\nThe entire list of resources at the top of this weekly newby thread surveys many of the key areas to be aware of. \n\nThere are definitely more areas to be aware of than the  list's items.\n\nThis item surveys some typical areas to  review for each trade.\n\n*Trade planning, risk reduction and trade size, etc.*      \n•&nbsp;[Exit-first trade planning, and using a risk-reduction trade checklist (Redtexture)](https://www.reddit.com/r/options/comments/9at2fu/noob_thread_aug_26_sept_1/e4ywq0u/)   \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)          \n•&nbsp;[An illustration of planning on trades failing. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)          \n•&nbsp;[Trade Simulator Tool  (Radioactive Trading)](http://www.radioactivetrading.com/trade_sim.asp)     \n•&nbsp;[Risk of Ruin  (Better System Trader)](http://bettersystemtrader.com/riskofruin/)", "score": 3, "replies": []}]}, {"body": "Ok so I’ve done a bit of reading and I think I understand this, but I just wanted to confirm. I sold a put, the value of the put has since gone down. If I want to close my position to limit risk I would click buy from the screen in RH where it shows my position on the put, and I would buy 1, correct?", "score": 2, "replies": [{"body": "yea", "score": 1, "replies": []}, {"body": "Can you share specifics?\n\nI don't use RH so I'm not sure how this is calculated there.\n\nBut you have to keep in mind that options lose value as time passes. But if you sell them, you get a net credit from the start, so if the put expires without being assigned, you get to keep all of it. You'll have to pay if you want to get out of it, however.\n\nThis somewhat mirrors buying options where your position is actually losing value as time passes.", "score": 1, "replies": [{"body": "I sell outs for $.69 per contract, they go down in value to $.29, if I buy those puts my position is closed, and the profit is $.40 per contract, correct?", "score": 1, "replies": [{"body": "Yes, that's correct. (well x100... You got probably got paid 69$ per contract, and you buy them back at 29$ each, with a net profit of 40$ per option)", "score": 1, "replies": []}]}]}]}, {"body": "How is something like a vertical credit spread, or any other credit spread, considered profitable in the long run because of probabilities?\n\n  \n\n\nLet's take Stock XYZ, I sell a vertical call spread with a $1 strike width that's 70% OTM probability (30 Delta). The credit received is 30cents, and the max loss is 70cents.\n\n  \n\n\nI do this trade 100 times, 70 of those times let's say I make the full credit, so I'll make a total of $2,100 (1 lot, $30\\*70 trades), and 30 of those times I lose $2,100 (1 lot, $70 \\* 30 trades).\n\n  \n\n\nObviously I'm really simplifying the hell out of it, and not including commissions and fees, and of course a host of other factors, but based on just that simple math alone...is their something I'm not getting? It seems like in a pure, ideal environment the trade will ultimately break-even, so how can it be a net winner in the long run?\n\n  \n\n\nAnd I think the same principles would apply at other OTM probability and other strike widths.", "score": 2, "replies": [{"body": "But, why would you let any of these trades expire for the full loss?  You wouldn't as you would adjust or roll them so the loss would be much less than the max.  Oh, and you might close for a partial profit, like 50% which will lower the total profit but also increase your win rate up to 75% or more.\n\nThe difference between the lower profit and lower loss amount is how an experienced and knowledgeable options trader makes a profit.\n\nThis is what you need to learn and do as it is not as black and white as you describe it.  With that said credit spreads are a tough way to trade and are a bit of a slog . . .", "score": 2, "replies": [{"body": "You're right, you wouldn't let them expire.\n\nI use The Wheel strategy you've posted about, and for that I close/roll the CSPs when they're at 50% of their value, I would also close out credit spreads when they're at 50%.\n\nHowever, in regards to The Wheel, even if I wait until expiration and the option ends up ITM, I can afford to buy the stock thanks to my cash reserves. I still have something of value (and I will sell CCs against it for more credit).\n\nBut when it comes to credit spreads, a loss becomes a loss.\n\n>  You wouldn't as you would adjust or roll them so the loss would be much less than the max.\n\nSince I've never traded credit spreads before, I'm not aware of how they can be adjusted/rolled, would you willing to go into more detail to explain that?\n\nI've rolled CSPs that are nearing the ITM level, and when doing so I roll for a profit. However, it was my understanding that when rolling spreads, there isn't any profit to be made since the value will be the same...30/70 as in my theoretical example. If losing credit spreads can be rolled for a profit like losing CSPs can...than I am quite the fool for not realizing that, lol.", "score": 2, "replies": [{"body": "Rolling a credit spread. \n\nBuy back the existing credit spread (or iron condor, or iron butterfly).  \nSell a new credit spread, at the same strikes, \nwith the same spread distance between the long and the short legs. \nThe same spread distance maintains the same risk on the trade:  \na wider spread makes for a greater risk of loss more than the additional premium,  \n(though tempting because a larger credit premium can be obtained). \n\nExtend the expiration out an additional 30 to 45 days in time, or less. \n\nDo so for a net credit for all trades combined.  \n\nAssuming the trader is rolling the credit spread, because  it is losing, or in danger of becoming a losing trade, or, has reached a maximum loss, attempt to move the location of the strikes (as the case may be) further from the money (out of the money), or out of the money if in the money, or, if in the money, less in the money -- but only if you can do so for a net credit.    \n\nASIDE:  \nYou could roll out in time for a debit, or roll in time, and roll in strikes, but notice this move increases your risk, as you are paying to stay in the campaign and trade.  It is a reasonable point of view if you are very confident on the future (favorable) direction of the underlying stock.  Just be aware that paying to stay in a campaign increases your potential loss and risk. \n\nBack to the main topic:  \nThe net credit for rolling the position in time reduces the loss in this campaign, as you accumulate incremental income, the income pays for use of capital, and the position waits for an opportunity for the underlying stock to cooperate and swing towards a more favorable price.  \n\nThe game is over, (if your strategy is to roll for a net credit), when you cannot roll out in time for a net credit, for a \"reasonable\" amount of time, less than around 45 to 60 days maximum.  That time limit is suggested, because there are diminishing credits obtained for each week further out in time the trader pushes the expiration.  \n\nI am aware of traders that have rolled a credit spread or iron condor, or iron butterfly repeatedly, as long as ten months, for a net credit each roll, waiting for a profitable move, and exiting for a gain.    \n\nIf you search on \"rolling an option credit spread\" you likely will find a number of blog posts and videos on the topic.", "score": 3, "replies": [{"body": "So basically it's possible to roll a losing credit spread for a profit, but there are times when doing so isn't possible?", "score": 1, "replies": [{"body": "Yes.   \nSometimes,   \nafter the extrinsic value has been run down in the challenged trade (the last week or more in the life of the options), even if in the money and at maximum loss, there can be enough new extrinsic value in the rolled out position to obtain a net credit on the entire transaction.     \n\n This tends to work better for options with higher rather than lower implied volatility values.  \n\nYou could test it out using the option chain, on an arbitrary credit spread, or iron condor, paper trading the concept.", "score": 1, "replies": [{"body": "Are spreads your main strategy?\n\nAs of now I'm only doing The Wheel and would like to expand into other strategies, one of them being credit spreads.", "score": 1, "replies": [{"body": "Mostly spreads, including   \nvertical debit spreads,   \nvertical credit spreads,   \nbutterflies (debit)   \ncalendar spreads     \nand other combinations.", "score": 1, "replies": []}]}]}]}]}, {"body": "One of the benefits from the wheel is that it is very easy to roll a single put option and it is harder to roll a spread or any multi leg position so you are not missing anything.\n\nI don’t typically trade spreads so am no expert so know it can be more difficult but not impossible to do so from a credit.  Like a CSP the goal is to do this at the right time and before the stock gets too far past the short strike when a credit is unlikely.  Some teach to open another spread on the other side to make it an iron condor and to get more credit that lessens the loss, but this just seems to accept and lock in a loss.\n\nWhat I really dislike about spreads is the idea of accepting a loss if it goes against you, and since they are more difficult to roll this just increases the likelihood of having to take a loss.  Of course, just paying for the long leg is a drag on profits to begin with, so I sure don’t see the point.\n\nWhere these seem to be best are for new traders to get a feel for how it all works with the “security” of the long leg to limit the max loss, especially in a smaller account.", "score": 2, "replies": [{"body": "Are there any other strategies you recommend besides The Wheel? I like it, but I'd need to add other strategies to further grow my account.", "score": 1, "replies": [{"body": "The issue is that many other strategies tend to have losses that must be overcome and I have not found any that didn't have these losses.  When you take away the losses these strategies typically do not do as well as the wheel.\n\nOne that many say does well for them are short strangles.  These are simply short puts (CSP or not) and a short call together and of course have a higher risk but also bring in a lot more credit per trade.  I did trade these for a while but ended up closing some for losses that I then had to recover from by making that many more profitable trades, also the buying power required was pretty high.\n\nWhat I found was while the wheel didn't bring in 100% annual returns it didn't have the issue of trades that were losers setting the account backwards.  If you find a strategy that has a high win rate and brings in more return please let me know!", "score": 1, "replies": [{"body": "I have a set amount of capital just for the wheel (this includes reserve cash and buying power), and eventually am going to fund my account with more capital.\n\nThe non-Wheel capital will be used for trading spreads and other strategies.\n\nDo you think is a good idea?", "score": 1, "replies": [{"body": "It really doesn't matter how you segment it, whatever helps you keep track and manage trades is how you should do it.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "The good trader still should be contemplating whether the underlying has a tendency to be range bound, or to be moving away from the short strikes of the credit spread. \n\n It is not entirely about probabilities, but also managing the trade, and exiting early to reduce losses, and reducing risk on trades with gains.", "score": 2, "replies": []}, {"body": "Also Interested.", "score": 1, "replies": []}]}, {"body": " Major noob here….\n\nNo matter how many different ways I ask this question and no matter how many articles I read or videos I watch I still can’t wrap my head around option pricing….\n\nIf IV is directly related to the underlying price, how is it that it goes up so high before e.g. big news event, when the underlying may not move at all….?\n\nIs the volume of options being traded affecting the price of the option - and if so where is this in any formula?", "score": 2, "replies": [{"body": "This is all complicated so it is understandable to take some time to understand it.\n\nI went through this pricing and volatility course some time ago and it really helped -  [https://optionalpha.com/members/video-tutorials/pricing-volatility](https://optionalpha.com/members/video-tutorials/pricing-volatility)", "score": 2, "replies": []}, {"body": "The implied volatility is related not only to the underlying price...also the price of the option, and how much extrinsic value is a componant of the total option price.  \n\nBasically, the more extrinsic value, typically a consequence of prices driven up by demand for buyers of the option, the more implied volatility there is affiliated with the option.", "score": 1, "replies": [{"body": ">Basically, the more extrinsic value, typically a consequence of prices driven up by demand for buyers of the option, the more implied volatility there is affiliated with the option.\n\nOK but where in the any of the pricing models is there anything about demand of the actual option itself?", "score": 1, "replies": [{"body": "That is located in the market price of the option, which is fed into the model.", "score": 1, "replies": []}, {"body": "Relevant item related to this topic\n\n\n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "FB may or may not rise in price on the weeks before earnings, and may indeed have significant theta decay for expirations near the earnings event. \n\nI avoid earnings events generally, as they are not very predictable, and implied volatility values make trading them a particular challenge. \n\nToday Oct 2 2019, FB  closed at 174.60  \n\nA longer term long option may have less theta decay, say January or February expiration.   \nJan 15 expiration at 180 has an ask of 9.95.  \n\nYou could also buy a calendar spread,   \nwith the front option expiring before earnings to help pay for theta decay. \n\nExample, above at the money:    \nSell Oct 25 Call at 180.00 for 3.05 credit    \nBuy Nov 18 call 180.00 at 6.55  debit   \nNet 3.50 debit.     \n \nOr you could buy a vertical call debit spread   \nBuy Nov 1 call at 175.00 at 7.85  \nSell Nov 1 call at 185.00 at 3.50  \nNet  4.15 debit.    \n\nBeware of earnings implied volatility crush with these trades. \n\n\nCharts showing implied volatility related to earnings events:  \nhttps://marketchameleon.com/Overview/FB/IV/\n\nEarnings implied volatility crush: \n\n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You'welcome.", "score": 3, "replies": []}]}]}, {"body": "Going out in time reduces your leverage, but with shorter expirations you pay higher theta costs to hold the position. I'ld sell some put verticals (10/18-11/15) and use the proceeds to buy $180-190 calls for 11/15 or 12/20. You get a lot less leverage than buying calls this way, but you should be theta positive if your puts don't go ITM.", "score": 2, "replies": []}]}, {"body": "Is it possible to roll losing long options and debit spreads for a profit?\n\nAnd if so, is this a viable strategy?", "score": 2, "replies": [{"body": "> Is it possible to roll losing long options\n\nYea, you do this for a debit so you effectivly increase your breakeven point. \n\n> and debit spreads for a profit?\n\nIf a debit spread is greater than 50% ITM, you usually can roll the position for a credit to a longer expiration. Like the long position if you pay a debit to roll, you will increase your breakeven point.\n\n> And if so, is this a viable strategy?\n\nNo, stocks are cyclical, but the swing may not be big enough for you to be profitable when it does happen. Roll only if you have a profitability zone you are comfortable with.", "score": 1, "replies": [{"body": "Would you be able to give me an example of this, using stock XYZ, on how the roll (good and bad) plays out?", "score": 1, "replies": [{"body": "Not sure what you are looking for, a good roll is one where the movement is favorable to you while the opposite is true for a bad roll.  If you roll too far in time, the price swings will be reduced.", "score": 1, "replies": [{"body": "I suppose I'm asking you to explain it in a way that you would explain it to a golden retriever.", "score": 1, "replies": []}]}, {"body": "---\n\nMay 1 2019 XYZ is at $100.  \n\n----\n\n**Roll for a debit**  \n\nBought a call on XYZ at strike 110 for 5.00 on May 1, expiring August 1.  \nBreak even at expiration Aug 1,  XYZ  at 115.00.\n\n\nOn July 15, XYZ was at 105.   \nThe trader sells the Aug 110 call for $1.50,   \nand buys a new call, strike 110, expiring Oct 1 2019 for $8.50.  \nNet cost to roll.   \n1.50 credit, 8.50 debit, net cost 7.00 debit.  \n\n**New breakeven**     \nTotal OPTION CAMPAIGN  outlay, net, 12.00.   \nBreakeven at expiration, Oct 1, XYZ  at 122.00. \n\n**Positive outcome**,   \nwhen XYZ spikes up to 130 on Sept 10.  \nOption sold for $22.00, less $12.00 cost for a gain of $10.  \n\n**Negative outcome**,   \n when XYZ expires at 112 on Oct. 1, 2019,   \nNo spike in price,  expires,  \nfor a $2.00 gain minus $12.00 total outlay for a loss of $10.00.\n\n----\n\n**Rolling for a net credit**  \n\nSame initial trade as above.     XYZ rises.\nBut move the new strike up 15 points to reduce the cost of the rolled new call.\n\nJuly 15, XYZ at 116.   \nSell the 110 Aug 1 option for 7.50 credit,  \nBuy new call at 125 expiring Oct 1 for 5.00.  \nNet on the roll credit 2.50.\n\nCampaign net  so far: DEBIT 2.50.   \nInitial call 5.00 debit, credit on roll 2.50.  \n\nCampaign break even at Oct expiration \nXYZ AT 127.50.\n\n\n---", "score": 1, "replies": [{"body": "Thanks for making it very clear.\n\nIs this even a viable strategy?", "score": 1, "replies": [{"body": "Updated and expanded the reply above.  \n\nViable only if the stock moves your way, and keeps moving.  \nBasically, a credit for every roll is required, or a big move that pays off the campaign.  Each new trade should be evaluated for cost and probability.\n\nExamples:  \nDB / Deutsch Bank starting in 2014, and starting in Jan 2018, as rolling puts.   \nSPY calls, in 2018 through August 2018.    \nFXE puts since March 2018 to the present.    \nTLT calls since May 2019.", "score": 1, "replies": [{"body": "Hmmm, if I'm interpreting this correctly, rolling long options seems like a great way to eat into your capital if the underlying never moves to at least the new break-even price after every roll.\n\nLike you can end up with a $20 debit after a bunch of rolls and end up taking a major loss if you reach a point where you can't roll for a credit.", "score": 1, "replies": [{"body": "Vertical spreads reduce costs and thus risks.\n\nMany traders exit early on trades and harvest value if expected moves fail to appear according to plan.\n\nThe key take away, also said by u/manojk92, is paying more for a trade, by rolling, the payment increases the breakeven move required, and the amount at risk.", "score": 1, "replies": [{"body": "> Many traders exit early on trades and harvest value if expected moves fail to appear according to plan.\n\nSo are you saying I should be ready to roll sooner rather later if a failure seems imminent?", "score": 1, "replies": [{"body": "Here are links / resources from the top of this weekly thread, which will help you to think about exits.    \nThese are not the only points of view.  \n\nYou may not want to roll at all, depending on your new assessment of the trade, and merely exit. \n\n*Closing out a trade*       \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position)            \n•&nbsp;[When to Exit Guide (Option Alpha)](https://optionalpha.com/wp-content/uploads/2015/01/When-To-Exit-Guide.pdf)          \n•&nbsp;[Risk to reward ratios change over the life of a position: a reason for early exit (Redtexture)](https://www.reddit.com/r/ActiveOptionTraders/comments/ataw61/why_close_out_a_call_or_put_at_50_profit/eh00lie/)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "What strategies are ideal for newbies?", "score": 2, "replies": [{"body": "The Options Playbook surveys most popular options positions.   \n\n•&nbsp;[An Introduction to Options Greeks  (Options Playbook) ](https://www.optionsplaybook.com/options-introduction/option-greeks/)  \n\nDeep in the money long options behave the most like stock, and because of that are useful.  \n\nThe reason why is these options have relatively low extrinsic value, and that is the reason options surprise most starting option traders, before learning about greeks, implied volatility, and extrinsic value.\n\n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)     \n\nPeople can reasonably have other views than this list: \n\n- Deep in the money long options  \n- Vertical Debit Spreads  \n\nSubsequently, \n\n- Vertical credit spreads   \n- Covered short calls  (owning stock, and selling calls above the net cost basis of the stock, potentially allowing the stock to be called away).  \n\nOption Alpha has a comprehensive point of view, but it is not the only view for people starting out in options.     \nhttp://optionalpha.com   \n\nTastyTrade is useful for perspective as well.   \nhttp://tastytrade.com/tt/learn", "score": 2, "replies": []}]}, {"body": "Covered calls question: buy-write or write-buy? I've been doing the former and the options are always harder to sell than the stock is to buy, even on liquid tickers.\n\n(I still make money, it's about optimization :))", "score": 1, "replies": [{"body": "Options typically have one-thousandth or less volume than stock, so getting an option will always be more challenging than stock, if you have limit orders.  And limit option orders are the only way to buy or sell options, because of the low volume and jumpy option prices.", "score": 1, "replies": []}, {"body": "You may want to put the buy-write in as a spread, one order, instead of buying the stock and then selling your call.  Your fills should be better.  You may also consider simply selling a put.  Fundamentally this is the same as buying stock and selling a call.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "As far as I understand, Think or Swim's OnDemand uses genuine historical data; you can use it to replay an entire day of the market, for example.  Because each day has variable prices, depending on the time of day, you can have widely varying results with the OnDemand feature. \n\nOptions Profit Calculator estimates outcomes based upon manual inputs. \n\nSPY's expirations: it depends on your time frame.   \nGenerally, if working with 90 day expirations, you have no choice but monthlies and quarterlies.  Monthlies are in existence through Jan 2020, Quarterlies through June 2022, and weeklies about five or six weeks in the future.  \n\nMonthlies and Quarterlies tend to have the most volume, because they have been in existence longer, and also have built up open interest.  For near-term SPY options, generally the volume is so high, it does not matter much which expiration option you choose, as they all (near the money) have small bid-ask spreads.", "score": 1, "replies": []}]}, {"body": "I understand that with buy call options, you want to the stock to increase early. That way time decay has a smaller effect on the increased premium.  And that most options do not get exercised prior to expiry. \n\nMy question is, if I purchase a call option ATM or slightly OTM, and it increases to a point that I would be willing to sell it for a nice profit, why would someone purchase that option from me? The premium would be higher, and they would be in a position where they have less of a chance to make money on the option?", "score": 1, "replies": [{"body": "> why would someone purchase that option from me?\n\nThe market maker is required to respond to orders. \n\nNew retail participants to an option do not have a history a prior owner of a strike and expiration may have, and new entries base their choice on current pricing data.   \n\nThey also may be driven by portfolio interests that are invisible to you, or may be shorting an option, or using the option as part of a multi-leg spread.", "score": 5, "replies": [{"body": "First off, thank you and everyone else that answers questions in this sub, I have learned more here in the last week than I have reading around the rest of the internet over the past few months! Keep up the great work.\n\n\nSo beyond stocks with normal liquidity issues, it sounds like there shouldn't be an issue offloading a call option ITM. But over all it is better to get out with profit earlier rather than trying to wait it out to irk a little more money out of it.", "score": 1, "replies": [{"body": "Generally, yes, to harvest extrinsic value, if there is significant extrinsic value in the position, when long.  And,  otherwise, to reduce risk.    \n\nMy mini essay on changing risk to reward is how I suggest people think about the topic for their particular trade and situation. \n\nFrom the links for this weekly thread:  \n\n*Closing out a trade*       \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position)            \n•&nbsp;[When to Exit Guide (Option Alpha)](https://optionalpha.com/wp-content/uploads/2015/01/When-To-Exit-Guide.pdf)          \n•&nbsp;[Risk to reward ratios change over the life of a position: a reason for early exit (Redtexture)](https://www.reddit.com/r/ActiveOptionTraders/comments/ataw61/why_close_out_a_call_or_put_at_50_profit/eh00lie/)", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": [{"body": "You are welcome.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I've been paper trading on both TDA and IB and the experience is pretty weird honestly. On TDA more often the not i get my mid price filled and if it doesn't work i increase it by a penny or so and it'll just fill. On IB my mid price almost never fills even if I add an extra dollar. I understand that a wide b/a price is due to low open interest but TDA just does fine. I guess what I'm really trying to say is which one is more realistic of the real world, TDA or IB?", "score": 1, "replies": [{"body": "Paper trading cannot be realistic.  \n\n**EVER**.     \n\nNeither of the paper-trading applications of Interactive Brokers, nor TDAmeritrade match reality.  \n\nThe paper-trading programmers must make arbitrary assumptions that fail to match the  real-world adversity of trading.\n\nIt is best for you to assume the least favorable prices will occur, called the \"natural price\", which also apprises the learner that trading is not easy.\n\nDo not trade options with wide bid-ask spreads,  \n and stick to high volume options with  low bid-ask spread options \n  on your first year of option trading.  \n\n\n\n---\n\nFrom the links associated  with this weekly thread.  \n\n*Minimizing Bid-Ask Spreads (high-volume options are best)*        \n•&nbsp;[Fishing for a price: price discovery with (wide) bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)       \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)            \n•&nbsp;[List of option activity by underlying (Barchart)](https://www.barchart.com/options/most-active/stocks)      \n•&nbsp;[Open Interest by ticker (optinistics)](http://www.optionistics.com/f/open_interest?op=highoi&bystk=stk)\n\n---", "score": 2, "replies": [{"body": "Thank you for putting in the effort.", "score": 1, "replies": []}]}]}, {"body": "Hello so I am currently holding a single OTM 10/18 $55 $BEAT call. Just something to get my feet wet and it was priced rather cheaply. I was under the impression that if enough people were trading it then I would be able to sell to close for a profit. I noticed this morning that the contracts jumped from $0.22 from $0.03. This appeared to be the result of the ask jumping to $0.51x21. However while the bid stayed at $0.00x0 I noticed that if I tried to sell to close at any price (such as a limit sell of $0.20) the price of the contract would instantly drop down. \n\n&#x200B;\n\nTo further my confusion, the bid is now down to $0.05x21 and the contract price has returned to $0.03. Can somebody explain to me what has happened? I am assuming that because nobody is buying the contract and that somebody has sold a bunch of OTM calls that the contract price was manipulated but I would like to be clear on what's going on.", "score": 1, "replies": [{"body": "No one is trading it. Sounds like you were the only buyer. The price moves on the near worthless RH app, but you saw the bid. Zero. That's what your option is likely worth if there isn't even a token 1 cent bid \n\nNoob mistake number two is trading illiquid options. Click through to see the live bid ask. Try to find options with 10 percent or less in separation. So on a 10 cent bid, 11 cent ask. For a 50 cent bid, 55 ask.\n\n Options cheaper than 10 cents tend to be extremely low probability. On RH a fair number are bid zero. Buying these are flushing money away.", "score": 2, "replies": [{"body": "Thank you, that is actually very helpful. Judging by the number of bids/asks is that how you determine the liquidity?", "score": 1, "replies": [{"body": "Volume is a good indicator.  \nNear the money makes for more volume.  \n\nBeat has not been near $55 since May 2019, so this trade did not take into account the present and long lasting trend on BEAT.  In other words, a very improbably successful trade. \n\n*Minimizing Bid-Ask Spreads (high-volume options are best)*        \n•&nbsp;[Fishing for a price: price discovery with (wide) bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)       \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)            \n•&nbsp;[List of option activity by underlying (Barchart)](https://www.barchart.com/options/most-active/stocks)      \n•&nbsp;[Open Interest by ticker (optinistics)](http://www.optionistics.com/f/open_interest?op=highoi&bystk=stk)", "score": 2, "replies": []}, {"body": "A quick measure of liquidity is the bid/ask spread...the difference between the bid and the ask.  In general, a tight bid/ask spread indicates good liquidity.  If you see a zero bid on a strike, that's a bad sign.", "score": 1, "replies": []}]}]}, {"body": "The displayed \"price\" is the mid-bid-ask, which is not where the market is located if there are zero bids.", "score": 1, "replies": []}]}, {"body": "Rbc canada trade user. How long is the delay showed on options usually. I placed a practice bet this morning and it still appears as n/a. The play is short term as i wanted to watch what would happen within 5 day bet. If i cant see live action i guess im losing out on immediate profit/ loss chances no?", "score": 1, "replies": [{"body": "I guess you mean what is called \"paper trading\", without real money. Correct?  \n\nI guess a trade has not occurred; perhaps  the bid to enter the position was not close enough to the market price to be completed.  \n\nYou could call or contact the RBC help desk to confirm this guess.", "score": 1, "replies": [{"body": "Yeah thats a good idea thanks.", "score": 1, "replies": []}]}]}, {"body": "https://imgur.com/gallery/9UzZVvr\n\nCan anyone explain why RH has the short leg showing up as a loss on my put calendar spread?\n\nI received credit for these at .34 and it’s now worth .13 debit, if I closed it out right now for a .21 credit, why is it asking for collateral?\n\nI believe I understand the trade. If MO stays above 38.5 on 10/11 I keep the credit, then I have 3 contracts left at 38.5P for 11/8", "score": 1, "replies": [{"body": "> MO 38.5P for 11/8  0.34 credit on open; 0.13 now  \n\nIt appears you have a gain for 0.21,  times three contracts, assuming you can close the position for 0.13 debit.   \n \n\nRH reports the mid-bid-ask on pricing, and the market is not typically located there on low volume options. \n\nYou could confirm with the people over at r/RobinHood.", "score": 1, "replies": [{"body": "Thanks. Yea I understand this trade but I think it’s just RH crap. Appreciate the confirmation", "score": 1, "replies": []}]}]}, {"body": "If I think MSFT will be rangebound for the next two weeks and will likely sit around 138, [does the iron condor make sense?](https://i.imgur.com/wj2mvl2.png) Thanks.", "score": 1, "replies": [{"body": "No. \n\nMSFT at 137.30 at Oct 1 2019 close. \n\nYour proposed trade:      \nhttps://i.imgur.com/wj2mvl2.png   \n\nSELL -1 IRON CONDOR MSFT 100 18 OCT 2019   \nSell 137 call / buy 141 call  \nSell 139 put / buy 134 put   \nNet credit @3.79    \n\n\nNotice that your initial proceeds are a credit of $3790, for ten contracts but the maximum gain is only $1790.   This is because your short strikes are inverted with the short put in the money, and the short call in the money, and you would have to pay about $2000 to close the trade (the amount the short  call and short put are inverted), and you would need $900 of collateral for each contract, or $9,000 collateral to enter the trade initially for ten contracts.  \n\nIron Condors are constructed with both credit spreads out of the money, with the aim that the closing trade is for a small debit, unless the underlying travels \"outside\"  of the credit spreads for a loss. \n\nThe trade is unbalanced, in that if MSFT goes up, more risk is on the high side, with max loss of 1210, and max loss on the low side of 210.    This could be reasonable if you expect MSFT to go down but you did not state that expectation. \n\nHere is a balanced version of a MSFT Trade, for a single contract requiring collateral of   $300 per contract, and a max loss of $223 per contract (300 spread minus proceeds of 77), on both high and low side. \n\nSELL -1 IRON CONDOR MSFT  18 OCT 2019   \nSell  144 call /  Buy 147 call  //    \nSell 132 call /  Buy 129 put    \nNet credit: @0.77\n\nOr more conservatively:  \n\nSELL -1 IRON CONDOR MSFT  18 OCT 2019   \nSell 145 call /  buy 147  call  \nSell 131 put /  buy 129 put   \nNet credit  0.46 LMT    \nCollateral per contract: $200    \nMax loss of $154 per contract  (200 spread minus proceeds of 46)", "score": 4, "replies": [{"body": "Awesome reply, super helpful. Thank you.", "score": 1, "replies": []}]}, {"body": "No really, inversion is something you enter into from adjustments, not something you start out with. Go with a butterfly or short straddle.", "score": 2, "replies": [{"body": "Ok, thanks for your input.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": ">but when I initiate a sell of it they don’t go through.\n\nThe options in this underyling has very poor liquidity.  That's why you're having trouble getting out; very few contracts are being traded.  In fact, *zero* put contracts were traded today at your strike and expiration.\n\nWith that said, you can try price discovery...offer your contract at the mid price and then slowly reduce the price until it sells.  Good luck.\n\nYou can avoid this in the future by not trading illiquid options/illiquid underlyings.  Look for tight bid/ask spreads before you put on a position\n\nEdit: here's a similar story further down in this thread: [https://www.reddit.com/r/options/comments/db6mpt/noob\\_safe\\_haven\\_thread\\_sept\\_30\\_oct\\_6\\_2019/f1zxlgi?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/options/comments/db6mpt/noob_safe_haven_thread_sept_30_oct_6_2019/f1zxlgi?utm_source=share&utm_medium=web2x)", "score": 2, "replies": []}, {"body": "*Minimizing Bid-Ask Spreads (high-volume options are best)*        \n•&nbsp;[Fishing for a price: price discovery with (wide) bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)       \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)            \n•&nbsp;[List of option activity by underlying (Barchart)](https://www.barchart.com/options/most-active/stocks)      \n•&nbsp;[Open Interest by ticker (optinistics)](http://www.optionistics.com/f/open_interest?op=highoi&bystk=stk)", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I have a VIX spread. The short expires OCT18, the long leg expires JAN21. If the short leg gets assigned, can I exercise the long leg to cover it? \n\nWith stocks the underlying is the same. A stock is a stock, no matter the expiration. But I wanted to make sure cash-settled options are also interchangeable.", "score": 1, "replies": [{"body": "Cash settled options usually cannot be exercised early (only exception I can think of is OEX). If you don't have enough cash to cover assignment, you will either need to come up with the money or your broker will close the long for you and use the proceeds to pay off the deficit.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Vertical spreads, and other kinds of spreads limit risk of loss, and reduce theta decay, at the price of limiting potential gains.  \n\nHighly desirable to learn  about.  \n\n\n> Also, should I be calculating my max risk based upon the option expiring worthless(100% loss) per trade?\n\nYes  \n\nStop losses are not used because option prices are jumpy, and trade, at each strike / expiration  at less than one thousandth to one ten-thousandth of the volume of stock, with much wider bid-ask spreads than stock.    The only option I would contemplate stop loss on (which converts to a market order) is an at the money SPY option, and even then, I do not use them. \n\n\nThere are a lot of resources here to apprise you of nuances of options.  \n\nHere are the top three.  \n\n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)     \n\n*Getting started in options*     \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/9m9u0w/noob_safe_haven_thread_oct_0815_2018/e7di9s8/)    \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/comments/cqg536/exercise_assignement_a_guide/)", "score": 1, "replies": []}]}, {"body": "Is there a more affordable option for long puts for companies with a negative long term outlook? \n\nA few I've been looking at are ANF, GPS, and GME, but even 1 lot at a strike price with an ok-ish delta, out of the money is in the thousands for all of them. Are long puts in these types of companies just too popular to see affordable long puts? Are there more affordable methods to bet against companies that I'm missing?", "score": 1, "replies": [{"body": "Long puts are going to be the most cost effective way ($/delta) to get negative delta. Here are some less cost effective ways:\n\n1. Short Calls (uncovered)\n\n2. Short Shares (consider borrowing costs first)\n\n3. Put Backspreads", "score": 2, "replies": [{"body": "Thanks for the additional info! I'll do some research on each.", "score": 1, "replies": []}]}, {"body": "You can always buy a put spread, with the short leg at or below your target price.", "score": 2, "replies": []}]}, {"body": "Would it be better to focus on selling options on ETFs like the SPY and GLD since there is less factors and more volume?", "score": 1, "replies": [{"body": "It depends on your goals.    \nBetter is measured by the particular trading concerns and values that you think are important.  \n\nSPY is the most active option,  \nand highly liquid with low bid-ask spreads,  \nand does not have earnings events,  \nthough you do need to watch out for ex-dividend dates on short calls. \n\nGLD also has high volume and small bid ask spreads.  \n\nHere is a list of options tickers by volume, via Market Chameleon.   \n\nhttps://marketchameleon.com/Reports/optionVolumeReport", "score": 2, "replies": [{"body": "Could you elaborate on why one would have to watch out for ex-dividend dates on short calls? If I'm understanding correctly, the ex-dividend would have no effect on a single leg long call or long put but would influence a call credit spread?", "score": 1, "replies": [{"body": "The excluded dividend (ex-dividend) trading date and short option holders.    \n\nFor example: SPY's dividend has been around $1.30 to 1.50 a quarter lately, in 2019.  \n\nBoth short calls and short puts with small amounts of extrinsic value are at risk of early exercise. Calls the day before the ex-dividend date, and puts the day of the ex-dividend date, and later on.   \n\nTraders care about extrinsic value, because long option holders destroy their option's extrinsic value when exercising the option.  Intrinsic value (the amount the option is in the money) is conserved upon exercising. \n\nIf, before the ex-dividend date a call, (and a put) can be obtained with low extrinsic value that is significantly less than the value of the dividend, a trader can buy the call, exercise to obtain the stock (and the dividend), and dispose of the stock promptly via the put, and have a net one-day gain via the dividend.     \n\nOwning the stock with a put is the same risk position as owning a call:  \nlimited risk on price down-moves, potential gain on price up-moves.  \n\nTypical locations of low extrinsic value calls, and the corresponding low extrinsic value puts of the same or nearby strike: \n   \n-  in the money calls nearing expiration (expiring out of the money puts have low extrinsic value)   \n- out of the money calls nearing expiration (expiring puts in money with low extrinsic value)    \n- deep in the money calls of many expirations  (puts far out of the money with low extrinsic value)   \n- far out of the money calls of many expirations (puts deep in the money with low extrinsic value)  \n\nBackground on extrinsic and intrinsic value:  \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)\n\nOptions and Dividends - What you need to know    \nby Sage Anderson - TastyTrade  - May 25, 2017     \nhttp://tastytradenetwork.squarespace.com/tt/blog/options-and-dividends", "score": 2, "replies": [{"body": "Thank you very much for the detailed response!", "score": 1, "replies": [{"body": "You're welcome.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "My understanding regarding a good time frame for selling options is 1-2 months out from expiration due to rapid time decay which works in the seller's favor.\n\nWhat about the buyer's side? What's a good expiration date to consider when buying options? If a short time frame is good for selling options, does that mean a long time frame is good for buying options? Let's say 6-12 months?\n\nWhat do you think?", "score": 1, "replies": [{"body": "Generally the selling short sweet spot is from 30 to 60 days from expiration, and many useful credit spread or short option trades are made for shorter expirations. \n\nFor buying long options you want to reduce theta decay, and also have time for the trade to be wrong, and recover from wrong timing.  \n\nReasonable people can have widely varying views on this, and it depends on the position.    \n\nSome positions are relatively immune to theta decay, or benefit from it, such as debit calendar spreads, and debit butterfly spreads.   Vertical spreads tend to reduce theta decay, especilly compared to simple long options. \n\nI habitually for 30 day trades, pick an expiration at least twice as long, and for a week long trade, a two to three week expiration, often as a spread of some kind. \n\nExtra long expiration options, six months and one year tend to have high extrinsic value, and are more affected by changes in volatility (which shows up as VEGA, on the greeks), and can have that extrinsic value go away with a decline in implied volatility (which tends to occur on steady price rises). \n\n  It's going to depend greatly on the location of the position, whether in the money or out of the money, the implied volatility values, the underlying, what the position is, and what your particular trading goal is for the trade.  \n\nThere is no single answer, and all choices involve particular trade-offs.", "score": 2, "replies": []}]}, {"body": "Help me understand buying ITM and OTM for a single contract.   \n\n\nTheoretically, lets say stock xyz is trading at $100. If I buy 1 ITM call contract at 100 and 1 OTM call contract at 105, and at expiry the stock is at $110, would both contracts have the similar value considering a higher premium was paid for the at the time $100 call vs $105 call?", "score": 1, "replies": [{"body": "Impossible to answer without real world prices, and a time line.\n\nFar too many noobs focus on the fantasy of predicting exact time and price, and which option purchase gives the greatest percentage gain. I suggest novices buy at the money to keep it simple.\n\nThe lottery ticket buyers, playing FDs are mostly feeding the pot, week after week. Once in a while they win big, but like lottery scratcher buyers almost inevitably give it back.", "score": 1, "replies": []}, {"body": "At expiration:\n\nThe 100 call is worth $10\n\nThe 105 call is worth $5\n\nAt expiration the call is worth the stock price minus the strike price.  If the stock is below the strike price, your call expires worthless.", "score": 1, "replies": [{"body": "I'm asking if if the contracts have same value once you factor in premiums.", "score": 1, "replies": [{"body": "Almost certainly, no.  For them to be the same including the initial cost you would have to have paid $5 more for the 100 call than the 105 call, right?  You would only see this if the calls were both very deep in the money.", "score": 1, "replies": []}]}]}]}, {"body": "If I can’t afford 100 shares can I still buy SPY calls? If I’m in the money and I am profitable can I sell the contract? Or will no one want it and I won’t be able to get out of the trade unless I execute? Confused beginner here", "score": 1, "replies": [{"body": "> If I can’t afford 100 shares can I still buy SPY calls? \n\nYES \n\n> If I’m in the money and I am profitable can I sell the contract? \n\nYES.  You can sell a contract one minute after buying it.  You can have a gain without being in the money.  \n\n> Or will no one want it and I won’t be able to get out of the trade unless I execute? \n\nSPY is the most active option on the planet. You will be able to sell it.  \nNO need to exercise the option.\n\n\nVarious useful items to aid understanding, from the links at the top of this weekly thread: \n  \n*Getting started in options*     \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/9m9u0w/noob_safe_haven_thread_oct_0815_2018/e7di9s8/)    \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/comments/cqg536/exercise_assignement_a_guide/)    \n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)  \n\n*Minimizing Bid-Ask Spreads (high-volume options are best)*        \n•&nbsp;[Fishing for a price: price discovery with (wide) bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)       \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)            \n•&nbsp;[List of option activity by underlying (Barchart)](https://www.barchart.com/options/most-active/stocks)      \n•&nbsp;[Open Interest by ticker (optinistics)](http://www.optionistics.com/f/open_interest?op=highoi&bystk=stk)", "score": 4, "replies": []}]}, {"body": "Thanks! Seriously. I’ve traded stocks just not options.", "score": 1, "replies": []}, {"body": "I’d the underlying stock is trading at $1.00 and the $0.50 call is selling for $0.45, couldn’t you just buy the option for $45, exercise the call to buy 100 shares for $50, and then sell them for $100? Quick $5.  Am I missing something, or is that easy money?", "score": 1, "replies": [{"body": "There is no easy money in options.  \n\nYou are seeing the mid-bid-ask price on the option,  \nand you would probably have to buy at the ask for more.", "score": 2, "replies": [{"body": "I knew it didn’t make sense, that would be too easy. So theoretically if I were to get the option for less than $0.50, and the stock price didn’t move, it would be profitable as fast as I could buy and sell the 100 shares? Is the option price the only hang up in this situation?", "score": 1, "replies": [{"body": "These types of mispricings happen occasionally, however, they are only in the market for fractions of a second before the industry algos gobble them up before you even blink.  It is extremely hard for retail traders to compete in the arbitrage space.", "score": 1, "replies": []}, {"body": "Commissions can be a factor and some brokerages still charge to exercise the option.", "score": 1, "replies": []}]}]}]}, {"body": "Noob question, making sure I understand it.\n\nSo as I’ve been reading up on options and whatnot (around week 3) what trips me up is figuring out when your option are profitable, specifically in regards to time decay. \nThe way I have it set up in my head is basically this: you buy an option (typically or so I’m told you want a little otm or just barely atm strike) you are paying for two things: the extrinsic (time value) and intrinsic value (how much money you would make if the expiration was today) so my question is this, could we think of an options profitability as intrinsic value increasing so much that it outpaces the time decay (I’ve noticed on my paper trading apps that listed ‘premium’ goes down every day, esp when a stock is sideways) thereby increasing the premium so much that you could to sell to close it for a profit? Also quick aside is time value still preserved in sell to closes (it’s my understanding you don’t exercise options because you lose the extrinsic value)", "score": 1, "replies": [{"body": "Time decay is one among many factors.\n\nYou can have a gain without ever being in the money, and you can have a loss even if in the money.\n\nRemaining time value may be harvested by selling before expiration.\n\nRelevant item:  \n\n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "When there is a 3 or 4 percent market move in two days,  as there was Oct 1 and 2, 2019,  95+ percent of all stocks are going to travel together.\n\nIn more moderate times, stock and sectors travel in price and direction at differing rates.\n\nI am swing trading my own down side calendars and butterflies, expiring in Oct and November with the so far modest move at the start of October 2019.\n\nThe point of view I can give,    \nand reasonable people may have widely differing views,   \n is to take gains when you can,    \nand not when you have to  \n(because  of impending near term expiration, or receeding gains).       \n\nIf still confident about the continuing  trade,  \nre-implement another similar trade,   \nwhile  bearing in mind that prices and implied volatility values may change with changing market conditions.\n\nScaling into, and out of a position,  \n via multiple contracts or multiple positions,   \n is a variety of taking gains while continuing a trade.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It is always OK to exit a trade early for a gain.  \n  Even unexpectedly early.\n\nThere is real value in exiting all trades now and then, allowing a fresh reassessment.  \n\nHaving an exit plan at the start of the trade aids you later on.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Some platforms allow traders to set orders based on underlying prices.  I would only contemplate that for SPY because it has the highest volume  of all options (and I don't do it for SPY yet).  \n\nAlert setting is the way to go in my view.  \nOr trade in a more balanced way, so that price moves are slower in affecting the trades.   \nThis might mean calendar spreads, or butterflies, perhaps set up out of the money, waiting for a price move, for example. \n\nYou're only going to get paid for the option, so there is a two dimensional thinking required (option, underlying).    \nThree dimensions with time,   \nfour with thinking about extrinsic value / implied volatility value. \n\nThis link, from the list of links above for this thread, surveys some of this. \n\n*Why did my options lose value, when the stock price went in a favorable  direction?*     \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/8q58ah/noob_safe_haven_thread_week_24_2018/e0i5my7/)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You're welcome.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "School me on this one - If I am selling Calls for 100 and the underlying asset has gone above 100 shouldn't my Calls be more valuable?", "score": 1, "replies": [{"body": "The calls will be more valuable, and it would cost more to close out the trade (buying to close), and thus a loss for a short seller.   The short call seller desires to buy back the call for less than they sold it, for a gain. \n\n(Unless selling short a call,  via a covered call, while holding stock, and the stock is called away for a gain, because you with savvy sold the call at a strike that is more than the cost basis of the stock.)\n\nMaybe this item from the links at top of this thread gives perspective.  \n\n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/comments/9m9u0w/noob_safe_haven_thread_oct_0815_2018/e7di9s8/)", "score": 1, "replies": []}]}, {"body": "What happens if I had a vertical spread that expired with a maximum loss? Are both options just cleared by the broker and that's all?\n\nDoes the margin needed to open a vertical spread equals the maximum loss or is it any higher?", "score": 1, "replies": [{"body": "Assuming both are in the money,  \nboth would be exercised automatically upon expiration, and after stock and money changes hands, you have maximum loss. \n\n> Does the margin needed to open a vertical spread equals the maximum loss or is it any higher?\n\nYes.  Maximum loss is the cash collateral needed.  \n\nIf you are with RobinHood, they have a habit of freezing the account, and not allowing access for a day or two, if the account has insufficient funds to buy stock outright, while all of the funds settle, and freeze the trader out of dealing with the rest of their trades. \n\nIt is desirable to close out vertical spreads in advance of expiration if only one strike may be in the money; in general, I close out before expiration to avoid commissions on assignment, and needless activity in my account.  \n\nA choice available on credit spreads is to roll the spread out in time, for a net credit (buy back current vertical credit spread for a debit, sell a new one 30 to 45 days out, desiable for a greater credit). \n\nLink to an explanation of rolling a credit spread:   \nhttps://www.reddit.com/r/options/comments/db6mpt/noob_safe_haven_thread_sept_30_oct_6_2019/f25vssp/", "score": 1, "replies": [{"body": "Thank you!", "score": 1, "replies": [{"body": "You're welcome.", "score": 1, "replies": []}]}]}]}, {"body": "If a cash secured put I wrote gets exercised, what happens to the credit?\n\nStock XYZ is trading for $10, I sell a $5 Strike Price put for $0.50.\n\nXYZ goes down to $4, the put is now worth $1.\n\nIm assigned the stock, so I buy 100 shares of XYZ.\n\nBut what's happened to that initial $0.50 credit?", "score": 1, "replies": [{"body": "You keep the premium you sold the put for, here $0.50 (x 100) for $50 credit.  \nYou pay $5 (x 100) for the stock. for $500.   \nNet cost / basis of stock: 500 minus 50 = $450.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I would suggest a longer time frame, such as 60 days on the hypothetical trade.    \nYou may be right, but need to have time to be right.  \n\nYou need to define superior.  \nThere are a number of varieties of superior.  \nRisk, gain, rate of gain if not in the money, and other dimensions of interest.   \n\nThe long put has higher cost, and thus risk, and higher gain when in the money. \n\n> I could simply by a 282 put settling in 2 weeks.   \nI have every intention of immediately exiting the trade upon hitting $282.  \n\nYou may want to try 283, and exit after it goes in the money. \n\n> I buy a put at $282 and sell a put at $280(does this make sense?). I set my take profit for the maximum possible. If the price is at or below my target I should be in the maximum possible profit, right?\n\nNo.   \nSpreads behave differently, and the maximum gain, before expiration, occurs at a price beyond the short strike.    You could consider a vertical debit spread higher up, perhaps long put at 287 // short put at 283, fulfilling your desire to exit at 282.", "score": 1, "replies": []}]}, {"body": "I'm really having trouble understanding how to use stop loss in Questrade. I've read the help files and watched the videos, but I can't wrap my head around it. I've tested it based on what I researched but... it's not working.\n\nI'm testing BTO naked calls/puts in the Questrade demo account. I want to get out of my position if the price per share falls by, say, 20%.\n\nI tried a bracket order in the demo account... it didn't work despite the price per share hitting my target. I also tried this in my live account and, again, it didn't trigger/exit my position (I had a BTO Call for 0.86 and I used a bracket order to STC at 0.76... 0.76 was reached as the price per share, order never triggered/filled).  I must be doing it wrong?\n\nAs a note, 99% of the time I am actually available to watch the market as I generally work from home during market hours. As a work around, I thought about placing alerts to my desired stop loss but this is just inane. I want to feel confident that the market will close my naked options position if I've lost 20% of the price per share. I also just want to remove myself from the decision making process so it becomes less emotional.\n\nAny help with this is appreciated!", "score": 1, "replies": [{"body": "Not a user of Questrade.\n\nGenerally stop loss orders are not used by option traders because of low option volume, wide bid-ask spreads, and jumpy option prices. \n\nI wonder if calling up Questrade's help desk would be fruitful.   \nThey want to keep their customers, so they should be motivated to assist.  \n\nPerhaps these can assist:  \n\nCreating a stop order - Questrade  \nhttps://www.youtube.com/watch?v=tv4p19s_WGg\n\nCreating a stop limit order - Questrade  \nhttps://www.youtube.com/watch?v=CwbH70FeB1w   \n\nCreating a trailing stop limit order  - Questrade   \nhttps://www.youtube.com/watch?v=8cs7AaTBsdA", "score": 1, "replies": [{"body": "Thank you for your reply. I've tried the Questrade help desk and these videos; unfortunately, I don't really get it despite reviewing them multiple times - or perhaps the bracket order I tried didn't work because of the issues with stop loss orders you mentioned above.\n\nIn case I am unable to monitor my trade and know the exact price I want to exit at in case my trade isn't going my way, does it make sense to just set up a GTC order for the price per share I want to liquidate my position at - right after buying the contracts? Or does this expose my position to being sold by the market maker at any time because it is now an open order in the market? Say the current price per share is going at 1.50 and my order is set to STC at 0.50... is it possible my order will go through at any time, or will the current price per share have to drop to the 0.50 range for the order to go through? I hope my question makes sense, let me know if I need to rephrase it.\n\nThank you again!", "score": 1, "replies": [{"body": "I admit to not using automated orders, so I am not much help.\n\nIf you are thinking about the price of the options being the trigger, the problem is that Option prices are jumpy, and can be triggered because of low volume and changing prices that are not steady at one moment, and you might prematurely exit. \n\nI do tend to have Good 'Til Cancelled orders that sit, sometimes far away from the market prices, waiting for me to adjust the order closer to the market for a smaller gain, when I am ready to actually close.", "score": 1, "replies": [{"body": "Thanks again, that bottom comment is what I was looking for. If I had a GTC order set up as a way to exit a Call position with a small loss (so the GTC order would be well below the current market price per share, let's say the order is set to sell for 0.50 PPS but the market PPS is going for 2.50) would I be at risk for having my order go through at 0.50 at any time, or would the market PPS have to drop to around this range for the order to be executed?", "score": 1, "replies": [{"body": "You're welcome.  \n\n> let's say the order is set to sell for 0.50 PPS but the market PPS is going for 2.50) would I be at risk for having my order go through at 0.50 at any time, or would the market PPS have to drop to around this range for the order to be executed?\n\n\nIf it is a GTC limit order on the option, it would execute immediately, probably around 2.45 to 2.50, above the minimum acceptable limit price of 0.50.  \n\nIf it is a stop loss order triggered by reaching the price of 0.50, the order would sit until that (stop loss) price trigger of 0.50 was reached.", "score": 1, "replies": [{"body": "Thanks so much, that confirms my thoughts. Time to do more research on how to enter this into Questrade. Many thanks once again for your time and knowledge. :)", "score": 1, "replies": [{"body": "You're welcome.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Position size I noticed is super important for new options traders. Would you consider this example to be too big of a position?\n\n\n\nExample. An account has $1000. Options trader opens up an iron condor on stock XYZ at 300/302.5 and 280/277.5. Taking in a credit of $50 on both sides the max risk would be $225. 22% of the account. The POP on each wing is 85% or more. \n\n\n\nThat leaves 78% in buying power.  Which seems like would be enough to roll and keep the loss to 10% or even less. \n\n\n\n\nDoes this risk seem like too much for an account of this size?", "score": 1, "replies": [{"body": "For your example, the spread is 2.50 (times 100) for $250, less the credit of $50, for a net risk of $200.   \n\nIt is a pretty high risk relative to a 1,000 dollar account.   \nIf you can reasonably arrange less then 5%, that would be preferable.   \n\nThe concept is to be able to survive 20 to 25 bad trades in a row.  \n\nIdeally, especially while a trader is making neophyte mistakes with real money,  \na trader keeps their trade risk down to 5% or less of their account on any one ticker or trade.   \n\nI grant that that is a challenge.  \n\nMethods to do so could include credit spreads of  risk 0.50, (or 1.00 if necessary),  \nor taking on long debit calls or long debit puts, or vertical option debit spreads,  with a total outlay of less than 0.50.  \n\nRelevant links from the resources at the top of this weekly thread:  \n\n*Trade planning, risk reduction and trade size, etc.*      \n•&nbsp;[Exit-first trade planning, and using a risk-reduction trade checklist (Redtexture)](https://www.reddit.com/r/options/comments/9at2fu/noob_thread_aug_26_sept_1/e4ywq0u/)   \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)          \n•&nbsp;[An illustration of planning on trades failing. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)          \n•&nbsp;[Trade Simulator Tool  (Radioactive Trading)](http://www.radioactivetrading.com/trade_sim.asp)     \n•&nbsp;[Risk of Ruin  (Better System Trader)](http://bettersystemtrader.com/riskofruin/)", "score": 2, "replies": [{"body": "You're right I originally had it at $200 max loss but confused myself and edited it. Thanks.", "score": 1, "replies": []}]}]}, {"body": "Is holding options over the weekend bad? Let’s say i got a weekly call option i buy on Friday and on Monday it opens higher but would time decay cause me to still lose 🤔", "score": 1, "replies": [{"body": "Weekends are a fact of life.  \n\nThere may be a little more time decay over a weekend.  \nMost of the time overnight, and weekend theta is smaller than other influences on an option: underlying price movement, or implied volatility changes.", "score": 1, "replies": []}]}, {"body": "Is it recommended to use a stop-loss for LEAPs?\n\nI've read that using a stop loss for most option trades is a bad idea because the stop-loss gets hit one day, and the next day the that option you closed becomes quite valuable because of the underlying's movement, IV, the Greeks, etc.\n\nHowever, since LEAPs are sometimes treated as stock replacement, should similar rules apply, like having a stop loss?", "score": 1, "replies": [{"body": "No. Stop losses are not a good tool for options, especially low liquidity LEAPs. I suggest alerts on the underlying and mental stop levels.\n\n Have a plan before getting in. Follow the plan.", "score": 2, "replies": []}, {"body": "Long Term Equity oPtions have among the lowest of volume, even for high volume options.   Limit orders are especially necessary for these particular options with wide bid ask spreads and with jumpy prices.  \n\nParticular option strikes and expirations have at best one thousandth to one ten-thousandth the volume of the related stock, which is why limit orders are always desirable for options. \n\n\n*Minimizing Bid-Ask Spreads (high-volume options are best)*        \n•&nbsp;[Fishing for a price: price discovery with (wide) bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)       \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)            \n•&nbsp;[List of option activity by underlying (Barchart)](https://www.barchart.com/options/most-active/stocks)      \n•&nbsp;[Open Interest by ticker (optinistics)](http://www.optionistics.com/f/open_interest?op=highoi&bystk=stk)", "score": 1, "replies": []}]}, {"body": "Reading reading reading, I understand both trades now, but I don't understand what the hell is the difference between a call butterfly and an iron condor?", "score": 1, "replies": [{"body": "Presuming you are talking about a long call butterfly, and a short iron condor.\n\n---\n\nA short iron condor is two vertical credit spreads,  \none credit spread with calls, (typically above the money),  \nand the other credit spread with puts (typically below the money). \n\nFor XYZ at 100, a short iron condor centered at the money might be:    \nShort call at 110, long call at 115.   \nShort put at 90, long put at 85.    \n\n\n---\n \nFor a long call butterfly,  \nthat is a pair call spreads: a long call spread, (typically below the money), and a short call spread (typically above the money), jammed together and sharing the short strike.  \n\nFor XYZ at 100, a long call butterfly might look like this. \n \nLong call spread:   long call at 90, short call at 100   \nShort call spread:  short call at 100, long call at 110    \nAlso written as:   \nBuy long call at 90   \nSell 2 short calls at 100   \nBuy long call at 110\n\n---\n\nThe primary similarity and difference:\n\nBoth benefit from the options expiring \"within\" the spread,  \nor alternatively from exiting the position later in the life of the trade while the underlying is within the spread.  \n\n\nThe long call butterfly, your maximum risk is the outlay paid out.   \n\nThe short iron condor, your maximum risk is the credit spread width, less the premium received. In the above example, $5.00 less premium received.\n\nBeyond that, I'll have to respond to your particular questions about how they differ.\n\n---", "score": 3, "replies": [{"body": "Income generation and strategies, I am missing the difference in how I care in choosing one or the other in evaluating a trade. \n\nAppreciate all that you do.", "score": 1, "replies": [{"body": "There is a lot that can be said.  So, here is one incomplete point of view.\n\nGenerally, a guide to exit a butterfly is on reaching 25% to 35% of max gain, and on iron condors, 50% to  65% of max gain.  Smaller percentage for butterflies, because pinning at the peak of the butterfly is a low probability event, \n\nLong debit  butterflies can be advantageously used when offset from at the money, with some similarity to both a vertical spread and an iron condor.  They are resistant to changes in volatility, have modest negative vega.  They can be useful when Implied Volatility or IV Rank is high, when calendar spreads can be less advantageous (when the IV drops on a calendar spread, its high vega can lead to a loss). \n\nLong butterflies also can be useful for centered pinning plays similar to a centered iron condor, for an underlying that is not going to move much. \n\nIron Condors most useful when centered, with each credit spread contributing to the premium.  If offset (not centered), because the trader may expect a move, one may as well only have a one side on, for a single credit spread near the money that the trader expects the underlying to move away from. \n\nSome examples.  \n\nIWM has been trading in a range for a few months, between 145 and 160. At the moment at about 149.   It might swing up to around 155 in the next week or month\n\nHere: 8 points wide from the center, expiring Nov 15   \n\nBUY +1 BUTTERFLY IWM 100 15 NOV 19   \n 148/156/164 CALL @2.80 LMT  \n\nOr 5 wide from the center at 155, expiring Oct 25. \n\nBUY +1 BUTTERFLY IWM 100 (Weeklys) 25 OCT 19   \n150/155/160 CALL @1.40 LMT    \n\n\nThis off-set from the at money play cannot be done with an iron condor. \n\n\nFor short iron condors, the risk is generally about four times or more than the potential maximum gain; for long butterflies, the risk is the outlay up front.\n\nOff-set from at the money long single option condors (all calls, or all puts) can have similar risk characteristics to off-set long option butterflies\n\n\n\nGavin McMaster of OptionsTradingIQ surveys many aspects of butterflies   \n(use the \"next\" button at the bottom of that page, for the complete multi-post series)    \nhttp://www.optionstradingiq.com/butterfly-course-part-1-the-basics/", "score": 1, "replies": []}]}]}]}, {"body": "I want to buy a call on SPY, and sell when I hit 20% profit. Is there any benefit to turning this into a spread by selling a further OTM call?", "score": 1, "replies": [{"body": "You reduce the cost of the trade with the short call, and thus the risk, and this may reduce the move necessary to obtain 20% gain.  \n\nYou may desire to explore how the short  call changes the position and outcomes,  via your broker platform's analyze tab, or perhaps via another method, such as OptionsProfitCalculator  http://optionsprofitcalculator.com  \n\nThe short call, depending on how close it is to the long call option, works against the rise in the long, and time becomes a factor in the position, as extrinsic value decays out of the short.", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": [{"body": "You're welcome.", "score": 1, "replies": []}]}]}]}, {"body": "Using optionsprofitcalculator, it looks like my max profit for a call debit spread is at expiration. If the underlying is above both the purchased long and short sold strikes, for max profit, do I close it out on expiry date? Or do I let it expire?", "score": 1, "replies": [{"body": "Generally traders close out trades before expiration. Maximizing a return also maximizes risk that the gain will go away.   Think in terms of \"good enough\" results, instead of \"maximum\", as the risk does not warrant getting the last few percent of the trade.\n\nIf you're near expiration, you can avoid moving around money and sometimes fees by just closing instead of going to expiration. \n\nFrom the list of resources at the top of this weekly thread. \n\n*Closing out a trade*       \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position)            \n•&nbsp;[When to Exit Guide (Option Alpha)](https://optionalpha.com/wp-content/uploads/2015/01/When-To-Exit-Guide.pdf)          \n•&nbsp;[Risk to reward ratios change over the life of a position: a reason for early exit (Redtexture)](https://www.reddit.com/r/ActiveOptionTraders/comments/ataw61/why_close_out_a_call_or_put_at_50_profit/eh00lie/)", "score": 3, "replies": [{"body": "Thanks for the response. I have always closed before expiration and will likely continue to do so. My curiosity was more about whether there is actually anything to be gained by letting it expire. I guess if I sell the contracts on expiration day, I'd probably take a small hit in premium (because it would have to be worth it for the buyer)?", "score": 1, "replies": [{"body": "There is the last few percent that might not be obtained by closing 15 minutes before the trading day ends.  \n\n On low volume options, with wide bid ask spreads,  it sometimes can be better to go to expiration or exercise, rather than closing and paying for the bid-ask spread, and some traders knowing this will trade low or no-volume options planning on exercising or going to expiration.", "score": 1, "replies": []}]}]}]}]}
