{"title": "Roku is growing even faster than Netflix did at the same point, analyst says", "selftext": "https://www.cnbc.com/2019/08/27/roku-growing-faster-than-netflix-did-at-same-point-william-blair-says.html\n\nStreaming business Roku will reach 80 million active accounts by 2025, a William Blair analyst says.\n\n\"Roku will experience similar phased stages of international growth as Netflix did during its international expansion,\" says William Blair's Ralph Schackart.\n\nShares of Roku, which sells its own streaming devices with thousands of channels and provides an operating system for smart TVs, have been on a tear this year, climbing nearly 370%.", "id": "cw4k8b", "created_utc": 1566913002.0, "score": 422, "upvote_ratio": 0.94, "num_comments": 107, "comments": [{"body": "The comparison between Roku and Netflix is flawed. Roku sells devices with a small free streaming platform, not a subscription content service.", "score": 335, "replies": [{"body": "Came here to say this. Like they’re two completely different services. With that being said I have both. Both come built in on newer TVs too.", "score": 72, "replies": [{"body": "[deleted]", "score": 8, "replies": []}, {"body": "and I own one, and Ill never buy a TCL tv again due to them snubbing airplay 2 update, claiming \"we are going to support our users instead\" statement and the TV now flashes a white LED while its on, since I block it from pinging its servers all day reporting what I am watching.  Fuck that\n\nDownvoted for stating true things, oh okkkkkk", "score": 1, "replies": []}]}, {"body": "Roku's business model is ads, not devices.", "score": 36, "replies": [{"body": "Isn't it to sell devices as a means to sell ads?", "score": 16, "replies": [{"body": "Yup, but their profit isn't in the devices, nor is their growth. In 2018, ads were the largest portion of their revenue. In 2019, that will spread significantly.", "score": 11, "replies": []}, {"body": "They may have more hardware integrated at this point than aftermarket devices (I don't have a source, just a hunch). They pushed advertising as the revenue driver leading up to the IPO.", "score": 3, "replies": []}]}]}, {"body": "Does roku have its own streaming service like Netflix?", "score": 10, "replies": [{"body": "negative. their devices provide a platform to download apps in which you can stream from. some free some with subscriptions. My favorite thing about it is that I can search for something and it will search through apps I don't have downloaded.", "score": 26, "replies": [{"body": "Although they do have a roku app on the TV which has some movies.", "score": 14, "replies": [{"body": "Hmm I have never seen that before. I'll have to check it out later", "score": 3, "replies": [{"body": "It has some good stuff...like the full series of Who’s the Boss?.", "score": 1, "replies": []}]}]}, {"body": "so it's a fire stick?\n\ni'm not familiar with roku, hence my naive question.", "score": 2, "replies": [{"body": "Its like a fire stick that you can put any streaming service on (I know Amazon budged on this recently, and Apple as well with allowing Amazon video on the Apple TV). I currently have and subscribe to Crunchyroll, Netflix, Hulu, Amazon Prime, and HBO and I have access to all of them through my Roku device. I can't actually count the number of \"channels\" (Roku calls each streaming app a \"channel\" in their software) that I have access to, because new free ones are being added all the time. \n\nI understand that you can also add pornography streaming channels, but you have to jump through some hoops.\n\nMy smart TV also has some Roku hardware, and they broadcast a small selection of channels over the Internet. As long as you're connected you have like 4 channels, but I only remember two: one is cartoons, the other is Geek and Sundry.", "score": 8, "replies": [{"body": "You can put almost any streaming service on fire stick/fire tvs. \n Netflix, Hulu, Crunchyroll, and at least the major premium cable subscriptions are available on the Fire TVs.  They also have countless apps for others services free and paid. Essentially it works almost identical to Roku in that sense.", "score": 2, "replies": []}]}, {"body": "I'm not to familiar with fire stick lol. but a quick search tells me they are very similar.", "score": 2, "replies": []}, {"body": "Yes, which is why this is so funny.", "score": 2, "replies": []}]}]}, {"body": "Yea but free. They don’t produce their own content", "score": 5, "replies": []}]}, {"body": "Actually Roku makes money from ads and also makes a cut off subscriptions if activated through a Roku device in addition to a percentage of every movie bought via one of the services it provides like YouTube movies for example. They have also launched their own channel if I'm not mistaken.", "score": 1, "replies": []}, {"body": "ROKU sells a software platform as well... everyone mistakes it for a hardware company still and that allowed a lot of us to get some great cost basis in :)\n\nROKU also has astounding ARPU (comparable to Facebook's) and good margins because they don't have to pay for the content that they profit from. Comparing ROKU to NFLX is laughably inappropriate.", "score": 0, "replies": []}, {"body": "I use a fire stick so how does amazon having streaming devices (fire sticks. Tv and cube etc... ) and prime video not make roku irrelevant?", "score": -7, "replies": [{"body": "Because your personal situation is not the same as everybody else on the planet.", "score": 10, "replies": [{"body": "Thank you so much for not answering my question whatsoever. \n\nRoku just makes streaming devices, right? Many other companies make devices and streaming TV to go with them. \n\nSo I'll ask again - what makes them worthy of a buy or why are they relevant. \n\nI personally dont have one so I cant speak on the topic, hence the question.", "score": -3, "replies": [{"body": "Roku is built into the tvs. A third of tvs sold on amazon uses roku as os", "score": 4, "replies": []}, {"body": "Roku's interface is so easy to use, even a 5 year old can use it. Test a 5 year old using a fire stick\nand you will see the value of Roku is just having the easiest in app use.", "score": 6, "replies": [{"body": "Rokus is definitely the best option for older generations", "score": 2, "replies": []}, {"body": "I have a 5 year old so I can indeed do this.  \n\nCurrently my 5 year old can speak into the fire remote.  Roku have features like that worth noting?", "score": 0, "replies": [{"body": "Yes. it can do that.", "score": 1, "replies": []}]}]}, {"body": "It's not so much devices as it is a platform used on TVs and devices sold by other companies. The main draw is the ease of use and breadth of applications.", "score": 3, "replies": []}, {"body": "Roku makes standalone hardware streaming devices equipped with their software platform, as well as partnerships with TV companies to use their Roku software as the interface for the “smart” aspect of a smart TV. With this software platform, they have the Roku Channel which is their first step into content delivery (not to be confused with content creation, like Netflix), but the revenue comes from advertisements mainly, but also from the percentage of the cut that they get from signing up members to streaming services found on their platform (as in, if I sign up for Hulu through my Roku, then Roku gets a cut), as well as a portion from hardware sales obviously.\n\nAll of these are reasons why Roku is relevant. The software is great, the platform is popping up everywhere, and the hardware is inexpensive. I prefer Roku, but if for no other reason than “they are just as good”, this is enough for them to be relevant. Touching on the “wouldn’t Amazon make Roku irrelevant?” (Paraphrasing) question...I’ll ask this, does Uber make Lyft irrelevant? No, because people like options, and sometimes the big name isn’t the “best”", "score": 2, "replies": [{"body": "Thank you! I've been seeing a lot of replies about the UI and the OS.  Sounds worthy enough to be given a try.  I stream everything as it is and have smart tvs, samsung with no roku UI.  I've just always used fire sticks butnill have to check out the roku for my 5 year old and maybe for my folio!", "score": 3, "replies": []}, {"body": "A couple of good comments here Roku makes almost no money on hardware and gives away for free their os for TVs. The one advantage they have is that multiple subscriptions can be managed with one account. The cost I believe is that you have to use their app to access the media. My one real question is how valuable is shitty licensed movies and cheap os and Roku sticks? I feel for the time there will be explosive growth but reality will set in eventually.", "score": 1, "replies": []}]}, {"body": "brand name recognition and partnerships with other companies", "score": 1, "replies": []}]}]}, {"body": "If a content producing company does not want their data feeding into another competing content producer ecosystem roku gives them an agnostic choice. \n\nPeople call this the streaming wars but it will really be the content wars I believe.", "score": 1, "replies": []}, {"body": "Roku being just a platform means they want to get every content provider, while Fire stick has had battles with Google.  They also have a better user interface from my experience.  i have seen it built into TVs and some new apartment complexes just have it as an accessory where they would not do that with a Chromecast or fire stick", "score": 1, "replies": []}, {"body": "you can watch prime on roku", "score": 0, "replies": []}]}]}, {"body": "I bought some at 34 a year ago or so and sold at 70.. can't believe it went that high.", "score": 43, "replies": [{"body": "I'd be pretty happy with that! You shouldn't regret something that you couldn't possibly foresee. You came out as a winner :)! Don't look at it that way~", "score": 16, "replies": []}, {"body": "I’m extremely new to trading. I got 5 shares at $22 and sold 4 of them when it doubled. Oh well!", "score": 6, "replies": []}, {"body": "Can I ask how you decided to buy?  Personal research or following analyst  advice?", "score": 1, "replies": [{"body": "I saw my parents were using it, and I even bought it. A coworker raved about it also, decided to buy it and made some money off it, but did not expect it to go 100+.", "score": 2, "replies": [{"body": "yep, wild ride.", "score": 1, "replies": []}]}]}, {"body": "Still a big win!", "score": 1, "replies": []}, {"body": "How were you 34 years old last year and suddenly you’re 70 a year later?", "score": -1, "replies": [{"body": "You tried.", "score": 2, "replies": [{"body": "I really did.", "score": 2, "replies": []}]}]}]}, {"body": "Roku seems more similar to GoPro imo...", "score": 29, "replies": [{"body": "similar, but not as bad. one you have a gopro you're done.\n\nbut roku is getting integrated into TVs and people re-buy those. plus they have pay per view.", "score": 10, "replies": [{"body": "Yeah, I think they executed better there but GoPro definitely had software offerings/integrations they were planning to add to their offering.", "score": 2, "replies": []}]}, {"body": "The parallels are striking, none more than the insane valuation so early into going public. \n\nI don't doubt that they've seen growth and are viable, but I still haven't heard a person utter the word \"Roku\" since my 2011 college professor mentioned it to me.\n\nI still haven't seen a product of theirs in the wild since then either.", "score": 2, "replies": []}, {"body": "You even check their last earnings statement?\n\nThey’re Very very different:\n\nRoku has been profitable and can continue to be profitable even if they don’t sell anymore devices.\n\nGopros are one time gigs, they sell hardware.\nIn fact Roku losses money on hardware, selling less units would help drive profitability.\n\nLastly Roku margins are great: they sell ads and now more and more are selling their SW as a license.\n\nI’m long on Roku, bought <$30. Will ride to $400.", "score": 1, "replies": [{"body": "It's not something I'm interested in looking into tbh...there are better things to buy that I've made much more money on and believe will continue to be better than Roku. Shopify, MongoDB, MELI, etc.", "score": 1, "replies": []}]}]}, {"body": "September 20 $145 calls are going to pay!", "score": 9, "replies": []}, {"body": "So is roku a buy today?", "score": 4, "replies": []}, {"body": "Yeah, but can it go higher. What's the potential market cap?", "score": 3, "replies": []}, {"body": "Is it just me that thinks Roku is not a sustainable business in the long run? I feel like they are force up-sellling their products inside TVs. People would eventually either buy Android boxes or apple TVs, but why would anyone buy Roku. To put it aptly, Roku is the Nokia of media centers. It too will perish if it doesn't switch to Android or iOS.\n\nWhat do you guys think?", "score": 8, "replies": [{"body": "Anecdotally their set top boxes work so much better than Amazon firestick, chromecast and built in smart tv's. The only device in my personal experience that came close was apple's, but their device is expensive.", "score": 5, "replies": [{"body": "I tried Roku but love the Firestick.", "score": 2, "replies": []}, {"body": "Extremely expensive.", "score": 1, "replies": []}]}, {"body": "Roku devices are so cheap. I imagine grandparents/ older people that are hoping on the stream train will just buy a 30 dollar roku device with the nice colorful “Netflix” & “Hulu” buttons on the remote. They would need a device to watch Disney+ as well when the grandkids are over. Roku is also beating android boxes and Apple TV by a large margin.. for now", "score": 2, "replies": [{"body": "Understand. You could get a decent Android box 2x the power of Roku for the same price. Except that it's some generic brand.", "score": 2, "replies": [{"body": "Some of those TVs have Roku integrates into it out of the box.", "score": 1, "replies": []}, {"body": "I've never used android, only roku. I like it a lot so can you explain what I am missing?", "score": 1, "replies": [{"body": "It's exactly the same difference between using a Nokia (Roku uses a Linux variant but cannot download/run apps from Android play store) and an Android phone. The Android apps market is by far the largest. Even iOS cannot come close. But for the average man, that doesn't matter as the basic apps are available on all platforms.", "score": 1, "replies": [{"body": "Well yeah I guess I dont watch my tv much. It had a built in roku, but basically I use netflix, hulu, sling, amazon, and twitch. Have never really felt like it was doing a bad job at any of those. Was just curious", "score": 1, "replies": []}]}]}, {"body": "Except no one is. User experience on a Roku is far superior, at least according to the 30M users they have.", "score": 1, "replies": []}]}]}]}, {"body": "I bought Roku at the beginning of the year. 2 shares :(. I bought it mostly for my son, who was showing an interest in stocks. I had just bought a Roku as I had just dropped DirecTV in favor of YTTV. I thought it would be a nice combination of showing him how the stock market worked with a real living thing that sits in our living room and he uses just about every day. I certainly accomplished my goal, I just wish I had invested  A LOT more money. Que sera sera.", "score": 9, "replies": []}, {"body": "Somewhere, John Oliver is cursing the day that he mocked Roku", "score": 3, "replies": []}, {"body": "Those must be great in the USA. In Canada, most of the channels are \"this channel has two black and white movies\" or nothing.", "score": 3, "replies": []}, {"body": "Anyone else find it ironic that Netflix built the Roku and then they decided they didn’t want to be in the hardware biz so it spun it off into its own company?", "score": 2, "replies": [{"body": "I don’t think ironic means what you think it means", "score": 2, "replies": [{"body": "That’s ironic too.", "score": 1, "replies": []}]}]}, {"body": "Roku is irrelevant. Or will be sooner than later. Their devices are obsolete considering how commonplace smart TVs are getting. Not to mention if you have a gaming console it’s the same and doesn’t have bogus ads like roku. My PS4 can run all the same streaming services.. again, without ads.\n\nThe only allure I see is the mobility, which in my case I have all the streaming apps on my phone and a hdmi output converter for my phone to put the display on any TV.. which again if you have access to a smart TV just log in to you account on the apps.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Cheap TV brands are using Roku inside. This is all about selling ads on their home screen.  No one wanna see ads on paid TV . This will be below 100 soon.", "score": 0, "replies": []}]}]}, {"body": "Somehow I find this article to be bullshit. Netflix has way more growth and potential", "score": 2, "replies": [{"body": "Netflix does have potential to grow but its losing content to providers like Disney.", "score": 10, "replies": [{"body": "Disney is late to the game and Netflix was born on the idea of streaming content. Their original content is far from losing viewers or lacking in production. Just look back 7 years when Netflix was garbage with a ton of B movies and little original content at the time and look where they are now, it's a night and day difference.", "score": 3, "replies": [{"body": "But Disney is compensating for lack of content with their pricing model", "score": 3, "replies": [{"body": "panicky lock library ten history support different worry afterthought illegal", "score": 3, "replies": []}]}, {"body": "They aren’t just losing Disney stuff. NBC is pulling the office and Parks and Rec in 2021 I think", "score": 2, "replies": []}]}]}]}, {"body": "Roku cannot have the same growth as a product that already has won over early adopters. Some will either use both, or switch only if Roku will find a way to unite all the other platforms and focus on dedicated hardware. I don’t think Roku will ever produce content, so it’s a bad comparison from the start. We do forget that smart tv’s are still pretty stupid and there’s no really good alternative in europe for AppleTV, so maybe if their strategy relies more on hardware they might see something others are missing.\n\nIt’s interesting that we start seeing the segmentation of “channels” as we did in television. What do you think of bundling services like Hulu, Amazon, Disney+ and potentially others into one offering?", "score": 1, "replies": [{"body": "Early adopters don’t always prevail but they do get the reputation that they’ve been doing it the longest. Hence, they’re more reliable. \n\nBut many early adopters grow exponentially but once they have competitors do it the same or better that grow minimizes.", "score": 1, "replies": []}]}, {"body": "The analyst is probably 40 years old or older and has no idea about what Roku really is. Most all analysts wrongly call all these young tech businesses.", "score": 1, "replies": []}, {"body": "Surprised no one here mentioned Walmart in relation to Roku. That’s really been the differentiator for Roku as they compete with amazon, Apple and google.  They win at retail in a store where Fire TV isn’t sold. TVs are still an in person purchase for many (they want to see the resolution firsthand, even if they then order online) or the sticks are given as a cheap holiday gift. \n\nAgreed if Apple ever created a cheap stick (<$40), it would be bad for Roku.", "score": 1, "replies": []}, {"body": "Noooo. I bought ROKU at $34 and sold for a loss at $32 last year, whaaaa.", "score": 1, "replies": []}, {"body": "Roku is terrible", "score": 1, "replies": []}, {"body": "Roku is in so many TV’s we buy it’s tech is biggly used. I was reading about it three years ago but of course I didn’t buy any. I have no idea if it’s too late", "score": 1, "replies": []}, {"body": "I simply don't get this.  Who buys a ROKU anymore??? Virtually every TV and Blue Ray player sold now does the exact same thing.  What am I missing?\n\nEdit: everyone here has provided some good points.  It certainly helps explains why the stock is doing what it does.", "score": 1, "replies": [{"body": "College students or adults who don't want to spend $500+ on a tv with these features. Instead, they settle for a cheap $200 tv and $10-$50 device that does the same.", "score": 2, "replies": [{"body": "I get that I guess,  but I'm under the impression that most of these $200 TVs come with most the apps anyways now-a-days. \n\nThe other reply had a good point (travelers). But if it went for this,  I would swear it's days are numbered.", "score": 1, "replies": []}]}, {"body": "It’s great for those who travel a lot - consultants etc.", "score": 1, "replies": [{"body": "Ok, I never thought of that.  Makes a lot of sense.", "score": 1, "replies": []}]}, {"body": "The standalone devices are usually much faster.  Menus and such are snappier/less lag. Apple TV isn’t avail yet built in but I imagine at some point Apple TV will be similar to CarPlay/AirPlay where you just run it from your phone and the tv supports it.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "To be fair,  I have not looked at new TV's in a while so perhaps yes,  I've been under a rock.  Back in my days,  the app's were on TV. Now your telling me it's ROKU preloaded?", "score": 1, "replies": []}]}, {"body": "Roku is the easiest one by far and for the price offers the most value and quality. The biggest thing is the ease of use...for anyone over 40 I recommend Roku simply bc it is simple. There is like 10 buttons on a Roku remote compared to every other tv that has around 50-60.", "score": 1, "replies": []}]}, {"body": "i’m sorry has anyone ever used a roku? these things are absolute trash...", "score": 0, "replies": [{"body": "I have. And it’s not trash", "score": 1, "replies": [{"body": "are you old tho", "score": 1, "replies": [{"body": "Yes and there are a lot more of me’s", "score": 2, "replies": []}]}]}]}, {"body": "Doubt it’ll go any further if it’s only selling streaming devices. Good deal they had was inputting their device with some TVs manufacturers already. Most TVs are already smart TVs now that can download most streaming apps. Roku is becoming more useless unless they offer something new.", "score": 0, "replies": []}, {"body": "hur dur dur hur", "score": -1, "replies": []}, {"body": "To bad Rokus device are super shitty and competition will only grow long term dont think it will do well", "score": -5, "replies": [{"body": "My Roku Ultra is so much better than my Fire Cube.  UI is cleaner and snappier.", "score": 1, "replies": []}]}, {"body": "What stocks do you guys recommend that are blowing up recently similar to Roku? And not necessarily in terms of the industry, but rather just by sheer amount of people wanting to buy the stock, that it's price is going up.", "score": -1, "replies": [{"body": "Shopify", "score": 1, "replies": []}]}, {"body": "Hm", "score": -2, "replies": []}]}
