{"title": "I've recently got into stocks and created a semi-automated spreadsheet", "selftext": "**DESCRIPTION**\n\nI've created a semi-automated spreadsheet that pulls information from google finance and gives me an overview over my current portfolio. It also converts my portfolio into a graphic and is updated automatically when reloading. All you have to do is type in the symbol and the amount and it works.\n\nIt then calculates if I made money or lost money and how big the stake of each position is compared to others. Really helpful.\n\n**LINK TO THE THING**\n\n[https://docs.google.com/spreadsheets/d/1TZsd\\_zeDHmksV9CccrigeOcBsBRfl94wzxIctjONT3E/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1TZsd_zeDHmksV9CccrigeOcBsBRfl94wzxIctjONT3E/edit?usp=sharing)\n\n**HOW TO USE**\n\n1. Make a copy and save it to your own drive so you can edit it. have fun with it.\n2. Choose Currency (on bottom of the sheet). You can delete all other sheets.\n3. Type the symbols and values into the fields I marked blue. Stock prices have to be negative! (E.g. if you paid USD2000 for 10 $FB stocks you need to type in -2000)\n4. All non blue fields are either optional or will be calculated automatically\n5. Delete all other rows you dont need\n6. ???\n7. Profit\n\nI've created a [tutorial](https://i.imgur.com/zy6dGyi.png) here\n\nIf it works you can send me a PM with a screenshot. Obviously, blur all the sensitive information! Would be interesting to see.\n\n*Updates:*\n\n**EUR, USD, CAD, AUD or GBP**\n\nI'm from Europe, so this is built for Euros. But I've included a USD, CAD, AUD and GBP version for you guys. Just have a look at the bottom of the sheet and pick your currency. You can delete all others.\n\n**UNUSUAL STOCKS, ETFS or MARKETS**\n\nSometimes google doesn't recognize the symbol. Especially if it is a Non-American stock, or ETF. Then you have to also type in the market. So what you do to make it work is put =googlefinance(<yourmarketcode>:<sharesymbol>) inside current price row. you can find an example at the Daimler row way down in the sheet. There I used =googlefinance(\"FRA:DAI\"). You can research the market code and stock code on  [https://www.google.com/finance](https://www.google.com/finance)\n\n**MORE SOURCES** *by /u/* [*ado136*](https://www.reddit.com/user/ado136/)\n\nThis link might be useful as well: [https://support.google.com/docs/answer/3093339?hl=en](https://support.google.com/docs/answer/3093339?hl=en)You will be able to \"download\" the data from e.g. Finviz, Yahoo. I have created my own Excel Spreadsheet, where I use both GOOGLEFINANCE and IMPORTHTML functions.\n\n**BUGS**\n\nIf you find something, let me know. Especially with the different currencies section. Since I'm not using this myself, it was not tested.\n\n**DISCLAIMER**\n\nthe numbers of the shares I own and the price I have paid have been changed. this was created for myself and I share it without gaining anything from it. Be aware of any possible mistakes the sheet may contain. Don't take it as single source for accounting and use with caution. It's only a tool to give an estimated overview. Don't make any financial decisions based on the sheet.", "id": "cpu1j7", "created_utc": 1565707196.0, "score": 954, "upvote_ratio": 0.98, "num_comments": 98, "comments": [{"body": "Please share a link to a template!", "score": 51, "replies": [{"body": "I edited it in, along with a small tutorial.", "score": 33, "replies": [{"body": "Do you show how to make it automatic?", "score": 3, "replies": []}]}, {"body": "I agree", "score": 6, "replies": []}]}, {"body": "You're awesome dude!!", "score": 38, "replies": [{"body": "Oh, stop it you", "score": 38, "replies": [{"body": "Oh, you stop it you", "score": 3, "replies": []}]}, {"body": "No u!", "score": 7, "replies": []}, {"body": "MAshallah alhamdulillah Inshallah better", "score": 1, "replies": []}]}, {"body": "Yes link please. I tried doing this myself never got the automated part 100% would be good to see something similar", "score": 6, "replies": []}, {"body": "Interesting, thanks!\n\nHow does it handle stocks with dividends and potential reinvestments?", "score": 10, "replies": [{"body": "I too was thinking \"but what about the DRIP\"?", "score": 3, "replies": []}]}, {"body": "Nice. thank you!", "score": 4, "replies": []}, {"body": "Can we get a GBP one too?", "score": 5, "replies": [{"body": "done", "score": 2, "replies": []}]}, {"body": "Cool of you to share bro, thanks", "score": 3, "replies": []}, {"body": "Is there a way to also see this in a line graph form along with the pie chart?", "score": 3, "replies": [{"body": "No. It doesn't track results over time, so a graph doesn't make sense for what it currently can do. It's just a tool to give you an overview over the current situation.", "score": 1, "replies": []}, {"body": "Definitely possible to build. OP's tracker is nice but seeing P/L over time, 24 Hr change etc. adds a lot more insight.\n\nExample of mine: https://imgur.com/a/LVO0Ri9", "score": 1, "replies": [{"body": "It looks pretty cool. Do you mind sharing a template?", "score": 2, "replies": [{"body": "I used this link to help me set up a line graph showing results over time: https://business.tutsplus.com/tutorials/how-to-track-stock-data-in-google-sheets-with-googlefinance-function--cms-28182", "score": 3, "replies": [{"body": "Thanks a ton bro.", "score": 1, "replies": []}]}]}, {"body": "mind sharing the template?", "score": 1, "replies": []}, {"body": "Wow could u share?", "score": 1, "replies": []}]}]}, {"body": "since we're at formulas... probably a simple answer, but I can't find a good one for \n\n\n**Total portfolio daily change (%)**. I already have it for each holding, and it's respective weight. What am I missing?", "score": 3, "replies": [{"body": "Total portfolio daily change (%) = ((previous day portfolio value - portfolio value today) / portfolio value today) * 100", "score": 4, "replies": [{"body": "Ah wait, *that's* the question I should have asked lol. I am aware of this specific formula, but I don't know how to store the previous day portfolio value", "score": 2, "replies": [{"body": "I used this link (https://business.tutsplus.com/tutorials/how-to-track-stock-data-in-google-sheets-with-googlefinance-function--cms-28182) to help me set up a chart in Google Sheets to pull the closing values of every day (historically). And then you can add a chart to show the trends over time.", "score": 2, "replies": []}]}]}]}, {"body": "Thank you this is so useful! I've added a row and column for 'dividends and distributions' in the top section of the portfolio which you might find useful.", "score": 3, "replies": [{"body": "absolutely. mind sharing it? possibly via PM?\n\nIf it is working I can edit it in.", "score": 1, "replies": []}]}, {"body": "Thank you sm. Ily", "score": 3, "replies": []}, {"body": "Can it handle options? That’s always been my obstacle when trying to do these types of spreadsheets.", "score": 2, "replies": [{"body": "I'm not sure, but I doubt it. It is limited to what google finance offers.", "score": 3, "replies": []}]}, {"body": "Awesome thanks for this.", "score": 2, "replies": []}, {"body": "Looks good", "score": 2, "replies": []}, {"body": "Thanks so much Dude, excellent work!\n\nPlease let me know how to change the currency to GBP ( Pound Sterling ).\n\nMuch appreciated!", "score": 2, "replies": [{"body": "I changed it to USD through \"File -> Spreadsheet Settings -> Locale = United States\"", "score": 2, "replies": [{"body": "Thanks, will give that a go!", "score": 1, "replies": []}]}]}, {"body": "Nice!", "score": 2, "replies": []}, {"body": "This link might be useful as well: https://support.google.com/docs/answer/3093339?hl=en\n\nYou will be able to \"download\" the data from e.g. Finviz, Yahoo.\nI have created my own Excel Spreadsheet, where I use both GOOGLEFINANCE and IMPORTHTML functions.", "score": 2, "replies": [{"body": "protip right here. haven't heard of that, thanks for adding that. will edit it into the description!", "score": 1, "replies": []}]}, {"body": "Wow, great work!  It's funny how similar this is to the spreadsheet I keep in Excel - down to the graph and arrangement of the values.  PM me if you want to see what I'm doing.", "score": 2, "replies": []}, {"body": "Does this template work if you are reducing your position by say half the shares you currently own?", "score": 2, "replies": [{"body": "I don't see a reason why it shouldn't.", "score": 1, "replies": []}]}, {"body": "Holy shit amazing, what I have been looking for. Do you think you could add a Canadian currency for the Canadian market? And is it possible to add from other exchanges other than nyse or nasdaq like Canadian exchanges tsx n tse", "score": 2, "replies": [{"body": "done", "score": 2, "replies": [{"body": "Wow thanks!! I will give this a go n let u know updates", "score": 1, "replies": []}]}]}, {"body": "Thank you mate! I am from Australia. I need to add a tab for Australia stock exchange.", "score": 2, "replies": [{"body": "done", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}, {"body": "You the real MVP", "score": 2, "replies": []}, {"body": "Man I really appreciate your work! \n\nVery kind from you to share your file with everyone and still work on to improve it.", "score": 2, "replies": []}, {"body": "This is amazing, good job op.", "score": 2, "replies": []}, {"body": "Thank you, you are great", "score": 2, "replies": []}, {"body": "This is really well made! Stealing it to use for myself :D", "score": 2, "replies": []}, {"body": "Thanks!", "score": 2, "replies": []}, {"body": "Nice.  I’ll check it out after work", "score": 2, "replies": []}, {"body": "This is awesome dude! Been thinking of doing this myself but it seems labor intensive... many thanks for sharing!", "score": 2, "replies": []}, {"body": "I’ve been trying to make something similar to this for a few weeks, but I don’t have the knowledge, skills, or experience to do such a beautiful work of art. Thank you for both discouraging me from learning this skill, and more importantly for making my life easier by making this.", "score": 2, "replies": [{"body": "very happy to hear that, you're welcome!", "score": 1, "replies": []}]}, {"body": "This is awesome dude! One thing that would be cool would be to have the ability to 'add' share buys to an overall holding of a specific stock without having to add a new holding.", "score": 2, "replies": []}, {"body": "This is awesome!", "score": 2, "replies": []}, {"body": "So cool! Thank you!", "score": 2, "replies": []}, {"body": "Thank You so much for this. Do you know how i could change it to USD?", "score": 2, "replies": [{"body": "I know it is a bit Euro-centric, since I am from Europe.\n\nI've integrated a USD version now too. Just have a look at the bottom and pick the \"Stocks USD\" sheet.", "score": 3, "replies": [{"body": "Thank You!", "score": 1, "replies": []}]}, {"body": "~~On the bottom left of the doc there’s a button for EURO and USD~~\n\nI’m wrong.", "score": 1, "replies": []}]}, {"body": "Share link pls", "score": 1, "replies": []}, {"body": "Have you tried to make a graph yet because I have created a similar spread sheet, but cannot create a graph the updates automatically.", "score": 1, "replies": []}, {"body": "What about dividend yield?", "score": 1, "replies": []}, {"body": "The issue I see with this is that it won't track performance overtime. But nice overall.", "score": 1, "replies": [{"body": "Depending on what you are wanting to track I believe this could be setup without to much hassle.", "score": 3, "replies": []}]}, {"body": "Very cool work dude! Do you mind sharing a bit how you did to connect it to Google Finance? Thanks!", "score": 1, "replies": [{"body": "Ok, I found this [article](https://business.tutsplus.com/tutorials/how-to-track-stock-data-in-google-sheets-with-googlefinance-function--cms-28182). It seems that by using =GOOGLEFINANCE in a cell you can access information from the stocks on Google Finance such as name, price, specific date price,P/E and more", "score": 2, "replies": []}]}, {"body": "This is great, thanks!", "score": 1, "replies": []}, {"body": "Awesome", "score": 1, "replies": []}, {"body": "This is incredible. Good for you dude!\nDoes it work with CDN $?", "score": 1, "replies": []}, {"body": "This is great, thank you", "score": 1, "replies": []}, {"body": "Do you think this could work for Australian markets too?", "score": 1, "replies": [{"body": "It works for every market listed on google finance, yes.\n\nSo what you do to make it work is put =googlefinance(<yourmarketcode>:<sharesymbol>) inside current price row. you can find an example at the Daimler row way down in the sheet. There I used  =googlefinance(\"FRA:DAI\")", "score": 2, "replies": [{"body": "Awesome, thanks!", "score": 3, "replies": []}]}]}, {"body": "Literally can’t go tits up", "score": 1, "replies": []}, {"body": "TIL google finance has a python module. Game changer.", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "What do you mean with Total realised and Total not realised?", "score": 1, "replies": []}, {"body": "   ..", "score": 1, "replies": []}, {"body": "Could some one explain to me the earnings / loss %?  What does it mean?", "score": 1, "replies": []}, {"body": "Does this only work in google sheets btw? And how can I edit it ? It only says view only. even though I copied it to my own drive, if i download it to an excel sheet and open in desktop excel, links are all broken", "score": 1, "replies": []}, {"body": "Thank you for information, І want, to tell sth, too. There is a [Barter Smartplace](http://barter.company/) project — a confidential digital asset exchange platform based on a legal smart contract. The primary round of pre-sale financing is held in the amount of 2% of the issue and is distributed to participants at a price of $0.01 per token. At the stage of the initial exchange offer, it is planned to place the following 10% of the total share of the circulation at the price of $0.3 per token.", "score": 1, "replies": []}, {"body": "There are literally 100s apps for that", "score": -5, "replies": []}, {"body": "Send a refined version over to r/options thanks", "score": -6, "replies": [{"body": "pass. thanks.", "score": 3, "replies": [{"body": "Already done.", "score": 0, "replies": []}]}]}]}
{"title": "$TSLA Daily Investor Discussion - August 13, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "cpqm50", "created_utc": 1565687748.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 100, "comments": [{"body": "money is ready to go! If i can buy at 227 (or below), i'll be picking up 69 more shares, to bring my total to 333.  Eventual target is 420 shares.", "score": 12, "replies": [{"body": "Nice stuff! I'm at \\~500 with another \\~10k of long term call options. Eventual target: as many as I can get my hands on.", "score": 8, "replies": [{"body": "What’s your long call position? Strike and exp?", "score": 1, "replies": [{"body": "5x 300 Aug'19\n3x 280 Jun'20\n1x 400 Jun'21\n4x 450 Jun'21\n\nFirst ones were very cheap, didn't pay off, but I think it was a good bet.\n\n2020 ones I bought when stock was <200 and thought Tesla would almost certainly return to 300 if not 350+ at some point in the next year. Plan is to hopefully sell around 360-380, but might change a little depending on macros.\n\n2021 options are a bet on Tesla having a 15B revenue, 1B EBIT quarter after MY ramps to 5-7k per week. Might not quite happen in time for Jun'21 Options, but I'm highly confident this will happen before Jan'22. At 2x revenue, 30x EBIT multiple stock price would be ~600$. If there is significant autonomy progress that could be icing on the cake.\n\nCan't wait for Jan'22 options to come out because I am highly confident MY will reach significant volume by then, but it's a bit of a gamble on this happening by Jun'21. Will definitely load up on a bunch of Jan'22 options when I can, and might convert some of the Jun'21 ones.", "score": 2, "replies": []}]}, {"body": "i have 2 call spreads for sept.  hopefully it will play out.  it is kind of hard to use TA to track the movement.", "score": 1, "replies": []}]}, {"body": "68 at 230... when i saw macro going green I caved and upped the limit to 230 instead of 227.  Oh well :)\n\nEDIT: this will age well :p", "score": 6, "replies": []}, {"body": "285 shares will make you a millionaire at $600 billion market cap.", "score": 2, "replies": []}]}, {"body": "Ipace only selling under 300 a month with severe discounting is something notable it seems. Will the offerings coming up from other companies be a better product or a better value than the ipace? It is well reviewed and I, without driving one, suspect it compares well objectively (aside from charging solution).", "score": 13, "replies": [{"body": "Driven both, feels like a boat in comparison. I'm saying this while setting my bias aside. It's not a terrible car in the broader spectrum but it really doesn't stack up well against the Tesla. I don't see how someone would drive both and buy Ipace unless their primary reasoning is service and brand loyalty.", "score": 5, "replies": [{"body": "Service, brand loyalty, and looks should be enough to sell more than 200 a month. Point is, if ipace can't do it, and everything else has failed so far, then what does it take? Will the VW id.3 be more compelling than an ipace?", "score": 6, "replies": [{"body": "The Id.3 is in a whole different price range, so it's definitely gonna appeal to a lot of people.  The E-Golf is still popular, even though it's recently been discontinued.  I'd expect the Id.3 to pick up where the e-golf left off.  And it looks pretty good too, the only thing I dislike is that weird little thing on the hood.  Other than that, that car looks like great to me.", "score": 2, "replies": []}]}, {"body": "Are you comparing it to the Model 3 or S/X? Despite its size, Jaguar is always positioning it against Model X... just wondering because of the “feels like a boat” comment, which you frequently hear from Model 3 owners after they drive a Model S/X for the first time.", "score": 2, "replies": [{"body": "Comparing it to the X of course!", "score": 2, "replies": [{"body": "I've never driven an X before... Am curious to try it, but it's the one I've never driven before and I doubt I'll get the chance in the next couple of years... the only remaining issue on my Model S is the MCU1 yellow bands thing, and it doesn't look like the definitive solution is clear for now so I won't be going in for maintenance/repairs unless I really need it... and I don't know anyone with an X so no way to test-drive it :)", "score": 1, "replies": [{"body": "Just go test drive it at Tesla?", "score": 1, "replies": [{"body": "Nah, i don’t want them to waste time on that. Last time they already let me go nuts with a P3D because I happened to be in for a service about right after they got the Model 3 test-drive cars but right before their schedule filled up.  I don’t want to waste their time if i’m not gonna buy the X.", "score": 1, "replies": [{"body": "Good man haha", "score": 1, "replies": []}]}]}]}]}, {"body": "Model S is a boat, yes. But the P85D with the performance suspension (limited run that ended April 2015) drives like its on freaking rails. Honest to god more fun than a P100D", "score": 1, "replies": [{"body": "> Model S is a boat, yes.\n\nIt's a heavy car, but you just have to throw the steering wheel around in ways you will not feel comfortable with at first ;).  Obviously, it’s not as nimble as the Model 3, but I rarely have anyone keeping up with me on winding roads ;)", "score": 2, "replies": []}]}]}, {"body": "I'm sure looks could play a big role too. The Ipace does look good imo.", "score": 2, "replies": []}]}, {"body": "Chinese companies like Byton and Nio, are the only threat atm. they are doing over the air updates and collecting data for autonomy in China. The range is getting closer to Tesla's spectrum. They aggressively use Tesla's patents some of their SUVs are super similar to the X with the touchscreen Exc.. Eu, Japanese and American car makers will never catch up. They had 10 years and came out with nothing, mostly garbage luxury Suvs. If Chinese cars start hitting the US/ and European market, it's game over for everyone except Tesla.", "score": 5, "replies": [{"body": "Yep I totally agree here. It's very similar to Huawei in the mobile industry.\nI see the similarities very often. It is a very aggressive response which is good overall for the market but it's a higher threat than merc or BMW catching up. The European and us markets are however a bit resilient to Asian products especially when the interface looks cheap or extremely cheap-shiny. But they might get better at understanding the customers and they might just bring cheap competition to invade with it. \nBut yea, i think the focus should not be channeled on the already established automakers for them might be the least of the threats in the end.", "score": 3, "replies": []}, {"body": "but NIO has a _very_ low sales numbers though: http://carsalesbase.com/china-car-sales-data/nio/\n\nI doubt they'll ever catch up with Tesla in China.", "score": 1, "replies": []}]}, {"body": "This is a jaguar add that they’re pushing in a Belgian business paper: https://imgur.com/gallery/rwHoIQI\n\nThe ad doesn’t even show an I-Pace... note that in Belgium, companies make extensive use of offering employees company cars as a benefit. Automakers usually go all out to promote their latest and greatest cars to businesses.", "score": 1, "replies": []}]}, {"body": "https://www.teslarati.com/jaguar-ipace-tesla-conquest-3k-discount/\n\n15K discount in total... 3K “tesla conquest” discount 😅", "score": 10, "replies": [{"body": "Targeting the completely wrong audience. Again.", "score": 1, "replies": [{"body": "Yup, but this is even funnier than the e-tron ‘marketing event’ conveniently placed at a supercharger location ;)", "score": 1, "replies": [{"body": "Lol, yeah.  That happened in Germany right?  Where the e-Tron outsold the Model X by 1,782 to 318 in the first half of the year?  So funny!  ;)", "score": 3, "replies": [{"body": "Considering that Audi is a German brand that a lot of Germans are proud of, it certainly would be very troublesome for them if they weren't able to beat the Model X in their first months of availability ;)\n\nConversely, in the US the e-tron is being outsold by the ancient-and-in-dire-need-of-a-refresh-according-to-the-bears Model X by 5572 to 1835... I mean, that's just embarrassing considering the e-tron has the luxurious premium interior and completely new look whereas the Model X looks the same as it always has been.  And Tesla didn't have to spend Superbowl-ad money to sell those old cars either.", "score": 1, "replies": [{"body": "> Conversely, the e-tron is being outsold by the ancient-and-in-dire-need-of-a-refresh-according-to-the-bears Model X by 5572 to 1835...\n\nYou forgot to say \"in the second quarter in the US, where Audi is basically only selling for compliance purposes at the moment and where deliveries only really started in the second month of the quarter\".  \n\nAt any rate, I'm not arguing that Model X sales won't hold up better in the US where other manufacturers aren't really competing.  The problem is steady sales in the US don't offset the huge drop in international sales they are seeing.  And Tesla isn't going to be profitable if they can't move vehicles at volume in international markets.", "score": 3, "replies": [{"body": "Why on earth wouldn't Audi send more cars to the US where they're already selling more than in their home country?  That's like saying “jeez, we wanna make money, but we're just not gonna put in the effort for it”\n\nEDIT: unless Audi is selling the e-trons at a loss, but that'd be kinda bad for your narrative, no? ;)", "score": 1, "replies": [{"body": "US import taxes and transportation costs reduce margins in the US.  While they are still supply constrained it makes sense to sell in their home markets.  This might sound familiar to you.  The exception is when sales in the US will remove the requirement to buy regulatory credits.  Those sales will have incrementally higher margins.", "score": 1, "replies": [{"body": "Ah yes, the huge legacy manufacturer that has to restricts its marketing and operations in foreign markets due to supply constraints, which the young and naive Tesla seems to have gotten under control.  Tell me again how legacy manufacturers are gonna easily crush Tesla?", "score": 1, "replies": [{"body": "> Tell me again how legacy manufacturers are gonna easily crush Tesla?\n\nBy not losing billions of dollars selling vehicles for a loss.", "score": 3, "replies": [{"body": "But these legacy manufacturers are apparently supply constrained, yet they sorely need the volume to get away from the upcoming European emission fines.  If they are currently unable to produce EV's in a profitable manner, yet have to do so to face the even worse European penalties, it doesn't look too good, does it?\n\nThe more I talk with you, the better I feel about my TSLA bet... thx for that :)", "score": 1, "replies": [{"body": "Why do you require legacy manufacturers to do something right now that Tesla can't? 🤔", "score": 1, "replies": []}, {"body": "> If they are currently unable to produce EV's in a profitable manner, yet have to do so to face the even worse European penalties, it doesn't look too good, does it?\n\nOk, so you understand why they are increasing sales in Europe now.  Have you noticed that Tesla can't produce EV's in a profitable manner now either?  The difference between Tesla and their competitors is that their competitors have other models they sell that are very profitable.", "score": 1, "replies": [{"body": "> Have you noticed that Tesla can't produce EV's in a profitable manner now either?\n\n600M in FCF and they're deferring almost all of the FSD revenue for now.  They're not GAAP profitable yet, but they will be soon enough.\n\n> The difference between Tesla and their competitors is that their competitors have other models they sell that are very profitable.\n\nAnother difference between Tesla and their competitors is that their competitors currently employ a lot of factory workers on those ICE lines... those competitors have already said they'll need less factory workers in the future because EV's require less workers than ICE-vehicles.  Which means they're gonna have to let go a lot of workers over the next decade, which is gonna lead to union problems and _high_ severance payments.  That's gonna put a big dent in the profitability of these competitors.", "score": 1, "replies": [{"body": "> 600M in FCF and they're deferring almost all of the FSD revenue for now. They're not GAAP profitable yet, but they will be soon enough.\n\nFCF is negative $350 million so far this year, and that is despite the company severely restricting capex.  They said they would be profitable every quarter this year, but they've already lost over a billion dollars and can't even promise a profit in Q3.  \n\n> Which means they're gonna have to let go a lot of workers over the next decade, which is gonna lead to union problems and high severance payments.\n\nOne of the great things about not being completely vertically integrated is you don't have to employ nearly as many people to begin with.  Ford only has ~4x as many employees as Tesla, despite selling well over 12x as many vehicles.  As you said, any reduction in employment will take place over a decade, allowing companies to gradually reduce numbers by letting some of their workforce age out.  Those severance payments aren't going to be significant to companies earning billions in profit every quarter.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Kind of like how Tesla cut the price of the Model X by over 20% this year, but sales still dropped by 30% and it is getting outsold by the e-Tron by nearly 2-1 in Europe 😅\n\nI think we can all agree the iPace, like pretty much any Jaguar, is not a great vehicle.", "score": -6, "replies": [{"body": "Because the model 3 ate the s and x sales crazy bad, am I right?", "score": 5, "replies": [{"body": "You’re not wrong!", "score": 3, "replies": []}]}, {"body": "How come when Model 3 first comes out and sells like hotcakes, it's just \"pent up-demand\". But when the etron has some good initial sales, all of a sudden that theory goes out the window? Send convenient.", "score": 1, "replies": [{"body": "I think e-Tron sales may dip a bit in the future in Europe, but Tesla's problem is by that point the EQC and iX3 will be out too.", "score": 2, "replies": []}]}]}]}, {"body": "https://finance.yahoo.com/news/stock-market-news-august-13-2019-124507840.html\n\n> U.S. stocks jumped after the Trump administration announced it would be removing some goods from its proposed tariff list and delaying tariffs on others beyond the previous September 1 deadline. The news also sent bond yields higher, after the curve flattened the most in more than a decade earlier in the session.\n\napparently, this is being delayed into december", "score": 9, "replies": [{"body": "Yeah, this is great news, TSLA should start going up again.\n\nGot some AAPL as the market climbed.\n\nGrats on your new shares :)", "score": 1, "replies": [{"body": "Thx, really lucked out on the timing", "score": 3, "replies": []}]}]}, {"body": "If andrew yang is elected president he will give tesla so many ev credits", "score": 8, "replies": [{"body": "Force the incumbent ice ppl to subsidize tesla", "score": 3, "replies": []}]}, {"body": "When is battery investor day and when are they unveiling the truck. The suspense is killing me!", "score": 10, "replies": [{"body": "This is what Elon said about Battery day in the Q2 earnings call: \n\n>The time for this probably is about six months like maybe February or March next year, show and tell \n\nPick up truck is still slated for Fall 2019.", "score": 5, "replies": [{"body": "I must've missed that actually.", "score": 2, "replies": []}]}, {"body": "Personally I'll be a little disappointed if the truck reveal happens before the first model Y comes off the line.  Seems like they'll get flack for drumming up hype and that'll take away from both vehicles.", "score": 9, "replies": [{"body": "All car makers reveal the product well before production...\n\nAfter that, there is a 2-3 year process all cars/trucks seem to go through before being produced.\n\nModel Y can short-cut some of this process as it is based heavily on a Model 3, otherwise it just takes time.\n\nThe main reason for the reveal is to let buyers who may be considering an ICE Pickup or a competitor Pickup know it is coming. Prospective buyers have a time-frame, specs and a price, that is enough to make a decision.", "score": 5, "replies": []}, {"body": "It is almost certainly going to happen in that order. Per elons last tweet the truck is a couple months away and contingent on some final last touches.", "score": 3, "replies": [{"body": "They may come out with the truck before the Y, but not at scale IMO. They would use up to much batteries for the trucks. \n\nBut who knows, Tesla is always good for a surprise.", "score": 1, "replies": []}]}]}, {"body": "Later this year. That's all we know so far.\nI am not so super hyped about the truck. No offense to anyone, I just don't get hyped by it at all. I am hyped by the roadster, yes. I am hyped by the semi, yes. The truck seems too much of a long shot and a gimmick bigger than all model x's gimmicks combined. I may be terribly wrong and I surely hope it will actually triple the stock, but I just have very limited expectations there.\n\nThe battery day however, well that's an entire different story. That's my main thing. That's why I invest. Not for fsd or for the cars themselves but for the batteries. It's a key aspect and even if everything goes horribly to shit, in the batteries I trust. \n\nI am very interested in the announcement of Europe's factory plans this year too. It's something often overlooked around, but as an European (Sweden) I am interested to find out more about the timeline, location, capacity, etc.", "score": 5, "replies": [{"body": "I just wanted to ask if you are American, but now I get why you won't get it. And I'm European also, but been there and saw how Americans feel about their trucks. That is great opportunity, although mainly for USA domestic market. One way or another it will expand their market and push up revenue. Also Tesla will be accepted as the most innovating Automotive company in the world... After all who would even thought about Blade Runner kind of truck before :)", "score": 6, "replies": [{"body": "People that love their trucks aren’t the type to get a hybrid or electric vehicle. They love their big gas guzzlers and diesel engines", "score": 1, "replies": [{"body": "What are you suggesting then? That Tesla Pickup truck sales will come from \"environmentalists\" and EV early adopters only?", "score": 1, "replies": []}]}]}, {"body": "Wait an see,  of the 2 things battery day is the most exciting  as it has a bigger impact.\n\nWhat I am expecting from the truck is a good work truck that makes sense for commercial use, it is an important piece of the puzzle.\n\nAlso like the Semi Tesla will be able to make good internal use of the Pickup, it seems like an ideal platform for Mobile Service.", "score": 2, "replies": []}, {"body": "I agree about the truck. Even if they end up selling a bunch, as a self-described oddball design I expect the stock to tank on the reveal. Battery Day might be a better reveal...unlike autonomy neural networks, people understand what a battery is.\n\nAnd I guess Top Gear agrees with you, since they said they believe Tesla will stop making cars entirely soon and just make batteries. I disagree, but they said it.", "score": 1, "replies": []}]}]}, {"body": "S&P500 going crazy", "score": 6, "replies": []}, {"body": "Why has it been so desolate in here recently?", "score": 6, "replies": [{"body": "vacation, lots of people aren't working, which means they aren't on reddit :)", "score": 6, "replies": []}, {"body": "No big news to talk about. It will be less desolate once Pickup is announced, Q3 Data is out, GF3 is up and running, any new autopilot/ fsd news (like Smart Summon or city street driving). In between all of those things there will be less people here.", "score": 4, "replies": []}, {"body": "Work work work and not so much talk. I like it tbf.", "score": 5, "replies": []}, {"body": "Short term speculators got wiped out and only real longs are left", "score": 9, "replies": []}, {"body": "Beginning of a new quarter, not much news, little volatility, short thesis falling apart. \n\nLong investors are waiting for the battery day, truck reveal, Q3 numbers, insurance and GF3.", "score": 9, "replies": [{"body": "> short thesis falling apart. \n\nLOL.", "score": -1, "replies": [{"body": "If you’re short, why are you laughing at the short thesis falling apart?", "score": 2, "replies": [{"body": "Because it's not, and Tesla has been the most profitable short of the year.\n\nhttps://www.bloomberg.com/news/articles/2019-08-13/tesla-bears-reap-2-75-billion-in-most-profitable-u-s-short-bet", "score": 4, "replies": [{"body": "Very crowded trade. One silly pump will wipe out half of the shorts once again. Happens time and time again. Tutes play both sides. Good luck", "score": 1, "replies": []}]}, {"body": "I’m laughing at the suggestion of the short thesis falling apart given: \n\n1. Two quarters of losses totaling >$1 billion\n2. A multi-billion dollar capital raise that management (Musk) previously said wouldn’t be necessary. \n3. Back to back to back downward revisions in earnings guidance. \n4. Substantial price cuts across the line up\n5. Declining sales of the most lucrative models (S/X)\n6. A very likely YoY decline in revenue in Q3 and Q4.\n\nEdit; Nice to hear from you, btw. Remember when you told me I was going to be flipping burgers soon after Q2 earnings?", "score": 4, "replies": [{"body": "Okay, this is a better response than just LOL", "score": 2, "replies": []}, {"body": "1. They're growing faster than any other company and have a profit margin already 2x+ other car manufacturers per car. It's just a matter of time before this argument falls apart.\n\n2. It's not about being necessary or not, it's about being the best thing to do at that point in time as a recession may be coming.\n\n3. They're just learning to lower unreasonable expectations and be realistic. Finally.\n\n4. Was the plan all along. It's in part accelerated by the success of Model 3.\n\n5. They finally admitted that Model 3 is in such demand it's cannibalizing S/X sales. Tesla was never going to thrive on a car that is only affordable for the wealthiest people anyway. \n\n6. That's not likely at all and it's not the general consensus. \n\nAnd don't forget the macro environment. Clean energy is the future and the battery cost is going down. A.I. is the future and Tesla will have some of, if not the first smart cars on the road.\n\nThe bear thesis only works on the short term.", "score": 2, "replies": [{"body": "Just a quick point about Tesla's margin per car, Tesla doesn't include R&D in their margin calculations like most other auto manufacturers. They separate it more like a software company would. I don't think it's a big deal but at first glance it does make their profit margins seem more impressive than they are.", "score": 9, "replies": [{"body": "In addition to this excellent point, Tesla sells at the retail level so it should have higher *gross* margins than other car companies that sell wholesale to dealerships. \n\nOf course, selling at the retail level also means higher SG&amp;A costs than other automakers that sell wholesale to dealerships.\n\nIf you look at any margin line that includes SG&A, Tesla’s are obviously negative, which is lower than everyone else who reports a positive number.", "score": 7, "replies": []}]}, {"body": ">The bear thesis only works on the short term.\n\nStock is flat over five years.", "score": 4, "replies": [{"body": "It’s undervalued.\n\nAnyway, I’m looking ahead not back. Bears have been predicting TSLA bankruptcy forever, it has never been less unlikely.", "score": 2, "replies": [{"body": ">It’s undervalued.\n\nWhat does that have to do with the bear thesis being successful?", "score": 4, "replies": []}, {"body": "Elon has been predicting profitability longer than most of us have been predicting bankruptcy.", "score": 5, "replies": []}]}, {"body": "Stock is down over five years, get your facts straight.", "score": 1, "replies": []}, {"body": "Yep. So the bears were wrong too? Looking at it this way is silly.", "score": 1, "replies": [{"body": ">Yep. So the bears were wrong too? \n\nDepends what you did from the proceeds of going short. If you invested in an index fund you're very very up.", "score": 1, "replies": []}]}]}]}, {"body": "Well... did he specify the year? 🤔\n\n(It's a joke, don't take it the wrong way)", "score": 1, "replies": []}]}]}]}]}, {"body": "Honestly, on a day-to-day, or even quarter-to-quarter basis, there isn't a whole lot to say.  \n\nTSLA is truly a long-term gamble, where the outcome will not be known for years.  The vast majority of the chatter here over the past few months has been arguments over who is correct and who is not.  Most of the time, these conversations are pointless because neither party can have any reasonable certainty of being correct.  Consequently, the sub becomes a psychological battleground where speculators try to make the other side doubt their bet and close out.\n\nWhen Gigafactory 3 begins production, or Firmware v.10 rolls out, there may be more interesting information to discuss.", "score": 3, "replies": []}, {"body": "Slow news.", "score": 1, "replies": []}, {"body": "People are sick of the lowered quality the sub has seen for the past for the past year. There is no more level headed, high quality discussion on here.\n\nI used to get involved on discussions here daily. 2 weeks ago i unsubbed. Today it the first time i came back only to see if the news of the recent tesla fire was on here.", "score": -4, "replies": [{"body": "Agreed. People here don’t want to discuss TSLA anymore. They just want to talk about the shorts, and the other side of the trade.", "score": 5, "replies": [{"body": "I honestly don't get this argument... we talk about both Tesla and TSLA all the time\n\nJust to be clear on this, could you tell me what about the following recent posts is not related to TSLA anymore?\n\n- https://old.reddit.com/r/teslainvestorsclub/comments/cpbdhq/the_next_recession_and_tesla/\n- https://old.reddit.com/r/teslainvestorsclub/comments/cot76w/tesla_model_3_outsold_bmw_mercedes_audi_lexus/?st=jza5ax1i&sh=4e20325d\n- https://old.reddit.com/r/teslainvestorsclub/comments/coeqve/what_would_it_take_for_you_to_change_your_opinion/?st=jza5aswy&sh=b0995857 (i noticed you replied in the same thread over on the other sub about this, so surely, this particular topic must've met your standards?)", "score": 2, "replies": []}]}]}]}, {"body": "I was all ready to get me some shares below 229 today, but then of course I got so busy at work that I couldn't do it the first few hours, and then the stock had soared several points since then. :(\n\nWell at least I still have 60 shares that went up today.", "score": 3, "replies": [{"body": "In the long run, it won't matter that much :)\n\nBut yeah, I actually declined a meeting at 15:30 (my time, but that's when NASDAQ opens for me) because I wanted to get my trade in 🤷‍♂️", "score": 10, "replies": [{"body": "Ya, I noticed you went from 264 to 332. Keep going.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Your post was removed by the spam filter, but I confirmed the removal because, despite its importance, it's not really related to this sub and we already have another thread about this.", "score": 7, "replies": [{"body": "Oh, sure. As long as the removal is sound, I’m OK. I post it solely for responding that post.", "score": 3, "replies": []}, {"body": "I see you've purchased your new shares!", "score": 4, "replies": [{"body": "Yup, still gotta get them framed and hung up on the wall though", "score": 3, "replies": [{"body": "Get to 420 then compose a suggestive collage", "score": 3, "replies": [{"body": "I'm never gonna get wifey-approval for that", "score": 2, "replies": []}]}]}]}]}]}]}
