{"title": "WSJ - The $8.8 Trillion Cash Pile That Has Stock-Market Bulls Salivating", "selftext": "https://www.wsj.com/finance/investing/the-8-8-trillion-cash-pile-that-has-stock-market-bulls-salivating-0a1b4a8c\n\nWall Street wants your money off the sidelines.\n\nRising interest rates drew trillions of dollars into money-market funds and other cash-like investments in the past two years, with more than $8.8 trillion parked in money funds and CDs as of the third quarter of 2023. Investors are optimistic that with rates poised to fall, people will redirect that money and fuel markets’ next leg higher.\n\nVivek Trivedi, 37 years old, a pharmacist in Indianapolis, has around $80,000, or a bit more than 10% of his overall assets, in money-market funds and inflation-adjusted U.S. savings bonds (I bonds). He plans to eventually use that cash to buy a rental property but would consider investing it in blue-chip stocks in the meantime should interest rates fall and render yields less attractive.\n\n“Every month, I’m looking at inflation,” he said. “If I’m not earning at least 1.5% more than inflation, I have to think about different strategies.”\n\nWhat Trivedi and others decide is key to what happens next in markets. Expectations that the Federal Reserve will cut interest rates later this year spurred big rallies at the end of 2023, driving major indexes near records. That heat is beginning to dissipate. Some investors say markets have little room for further gains and are already priced for a perfect scenario, in which inflation moderates without significant job losses.\n\nWall Street is pinning its hopes on cash moving from money-market funds to provide the next big boost. Rates above 5% were flashy after years of safe investments offering little interest. Their fall could drive investors to U.S. stocks, which have historically provided the highest returns in the long run. \n\nBond yields have declined from their peaks, but rates offered on Wall Street remain high relative to recent history, pulling cash toward money-market funds. Stocks also still look expensive, meaning bargain hunters might find rates on CDs more alluring than playing the market—for now.\n\n“The assets in money-market funds are staggering,” said Randy Gwirtzman, a portfolio manager at Baron Capital. “All that dry powder is on the sidelines and waiting to invest.” \n\nElizabeth Cathcart, 26, works in corporate finance at an investment firm in Denver. She says the math of homeownership has risen so much that without an aggressive investment strategy, it will be unattainable. \n\n“It’s hard to pass up CDs over 5.5%, particularly for seven months. That’s not a bad deal,” said Cathcart. “But 12 months or longer, I don’t want to lock away cash for that long. I’m young, I want to take more risk.”\n\nExpectations for cash to pour into the market once rates fall may prove overly optimistic, however. Money-market funds raked in cash during previous Fed-tightening cycles but didn’t hemorrhage it when the central bank began to ease. Assets retreated from their peaks, but still plateaued at much higher levels.\n\nInvestors also tend to tap money markets during periods of market stress, not necessarily when yields are higher. Assets in money funds peaked at nearly half of the overall money supply in 2008. There was a similar spike in 2001, the aftermath of the dot-com bubble.\n\nFrancisco Pena, 30, a data scientist in New York City, said he is using short-term Treasurys, CDs and I bonds as a temporary home for his money. He is saving for a down payment with his husband.\n\n“I didn’t want my cash sitting in a bank account, losing real purchasing power—especially with inflation on the rise,” said Pena. If rates fell substantially, he would stick with a high-yield savings account to keep his cash at the ready.\n\nThere is some debate over how much of the assets in cash-like products should be thought of as investments, with potential to enter other parts of the market, versus as bank deposits to be saved or spent later on. Total deposits at U.S. lenders have fallen to $17.4 trillion from a peak of $18.2 trillion since the Fed began tightening policy in early 2022.\n\nThe path of interest rates will affect how much money is pulled from fixed-income products. In the past, rate cuts have often been large and rapid, aimed at stemming a crisis. Wall Street foresees a smoother glide path this time around, with rates ending up much higher than near zero, where they sat for years. Traders’ base case is for the federal-funds rate to remain above 3% in the coming years. Fed officials expect the benchmark rate to decline to 2.9% by the end of 2026.\n\nMark Wiggins, 27, a management consultant living in Miami Beach, Fla., is currently stashing 17% of his income in a high-interest savings account earning 4.4%. Another 13% goes into his 401(k). When rates were lower, he would invest a percentage of his paycheck directly into stocks and crypto. He is planning to invest a significant chunk of his savings. \n\n“If rates fall below 3.5%, I would probably cut the amount I’m putting into my savings and instead direct deposit to my investment brokerage or crypto,” he said.", "id": "199ttbu", "created_utc": 1705594674.0, "score": 119, "upvote_ratio": 0.87, "num_comments": 74, "comments": [{"body": "All of these people interviewed are going to massively underperform someone who just blindly buys VTI every month. WSJ interviewing a bunch of 20-something financial professionals who all have a significant amount of cash/MM/CDs just “happy to beat inflation by 1.5%” when the S&P500 is up 20% in a year makes me think the bull market is just beginning..", "score": 160, "replies": [{"body": "The first dude has $800,000 at 37. I think he’s gonna be fine. Most of these people are exceedingly financially literate. “I am saving for a house down payment in the next 3 years so my money is in CDs and bonds” this is exactly textbook on what you should do. Short term money should not be in volatile assets.", "score": 35, "replies": [{"body": "I didn’t know pharmacists did that well.", "score": 9, "replies": [{"body": "Probably had a big inheritance or something", "score": 6, "replies": [{"body": "Indian soundingnname.. probably inheritance", "score": 0, "replies": []}]}, {"body": "It’s unbelievable. All they do is take pills from big bottles and put them in little bottles while standing 2 feet higher than everyone else.", "score": 3, "replies": []}, {"body": "I know a lead pharmacist who I do house flips every so often with.  Makes over 100k a year. Walgreens. He hates it, but tough to give up that consistent income.", "score": 2, "replies": []}]}]}, {"body": "I don't disagree, but I can understand the idea of getting a 5% risk free return being appealing. Especially if you're closer to retirement age. But for younger folks I'd absolutely say they should be investing what they can in VOO or VTI as early and often as possible.", "score": 34, "replies": [{"body": "Unless you’re in the market for a house, which a disproportionate amount are now due to priced-out pent up demand from already high prices and now higher rates on top of that", "score": 11, "replies": [{"body": "Pent up demand is only realized if the reasons people haven't been buying houses change. Insufficient down payment savings may end up being invested in the market.", "score": 2, "replies": []}]}, {"body": "How about if you’re saving for the impossible housing market.", "score": 3, "replies": []}, {"body": "I don’t disagree with the sentiment; however, there are other reasons for people to play it safe right now. For example my wife and I were lucky (if that’s the right word, kind of morbid) to receive a decent sized inheritance from her uncle that passed away a few years ago. It’s nothing that would make us millionaires overnight, but it’s more than we’d be able to contribute over the course of say 5-7 years. Right now we’re about 1/3 invested in the market, and about 2/3 in short term bonds (3 mo, 6mo, 1yr) yielding close to 5%. Since it’s money we can’t just replace at the drop of the hat we’re more than happy to take 5% which is just slightly less than the average S&P return while all the giant uncertainties in the market work themselves out. Plan on going fully back in once this Saga is at the conclusion. Don’t mind missing out on some gains, if that means I’m protected to the downside while there are 5000 lbs elephants in the room.", "score": 7, "replies": [{"body": "Sure. But you are assuming this \"saga\" is worse or better than the next \"saga\". There's always a \"saga\" if you look hard enough. \n\nI have cash in the sidelines making 5% because I need it in less than 5 years. Regardless of \"saga\".", "score": 11, "replies": [{"body": "I get that, but when was the last time real estate was in this kind of hot water along with rates being this high. I get there is always something, but it doesn’t take a genius to realize what’s happening right now isn’t the run of the mill bump in the road. Could end up being ok, but this is one of those things that if it goes south it goes way south.", "score": 3, "replies": []}]}]}]}, {"body": "True, and I'm one of the people blindly buying FXAIX every month, but life is about more than just watching a number go up.\n\nAt least one of the people interviewed had IMMEDIATE PLANS with money they have, so for them it probably makes sense to use conservative allocations. For if the market hits the toilet for a year or three, it could significantly alter the plans they've made. Don't throw money into SPY that you're going to need in the next 4 years.", "score": 5, "replies": []}, {"body": "You do realize the S&P was down ~20% in 2022 right? It doesn’t just moon every year. Moving money into fixed income is a way to lower your risk profile while still generating guaranteed returns.", "score": 2, "replies": [{"body": "I was happy it was down in 2022 because valuations were more reasonable. When my coworker told me about ibonds and fixed-income opportunities mid-2022 I took it as a sign to sell some VTI and pick up 3k GOOGL which has returned like 10x the ibond rate..", "score": 1, "replies": [{"body": "I think you’re missing the point, which is that equities have a much higher risk profile. For some people, keeping what your have is just as important as making more.", "score": 1, "replies": []}]}]}, {"body": "One of my buddies spent a lot of time trying to convince me that iBonds were genius. He's currently got about 40% of his investments locked up into iBonds. Telling me he made 7% return on investment! \n\nDidn't have the heart to tell him that my portfolio went up 12% in that same time frame. And it won't adjust down to track inflation. \n\nIt's scared money - you guarantee you'll make 1.5% ROI, never less but never more.", "score": 2, "replies": []}, {"body": "Funny how you think after a 20% runup in a year that a bull market is just beginning...", "score": 1, "replies": []}]}, {"body": "I don't see people rushing to deplete their MMFs and buy stocks at ATHs just because the rates decline around 1% (with 3 rate cuts predicted this year only.) Maybe they'll not put new funds into MMFs as much but the psychology for tapping into that war chest is different IMO. \n\n(Is that the optimal route for performance? Probably not.)\n\nIf the rates drop to 0% in the short term, then that's likely because something's gone wrong and it's an emergency rate cut. Stocks will be cheaper then, so the cash holders will have benefitted.", "score": 27, "replies": [{"body": "I think the subtext of the article is that the idea is wishful thinking and is not likely to come to pass.", "score": 8, "replies": [{"body": "I don’t trust anything the WSJ pushes out.", "score": 2, "replies": []}]}]}, {"body": "In general the problem is everyone is thinking 2008 might happen all over again and everyone is sitting in cash waiting to pile in the market whenever a sizable dip occurs. If what is in this article is true, now is the time to buy- if people start mobilizing cash into the market when interest rates drop the cash influx should create new ATHs.", "score": 11, "replies": [{"body": "Different era, but I regret not getting into investing during the COVID crash. At least now I know to buy the dips if something similar happens.\n\nUntil then — and beyond — “time in the market” is the name of the game.", "score": 2, "replies": []}]}, {"body": "Cash as a % of wealth is near record lows \n\nA lot of people already own a lot of stock exposure.\n\nMany ask, why expose more to equities? I can buy bonds with 2% real yield alongside inflation adjustment.", "score": 34, "replies": [{"body": ">Cash as a % of wealth is near record lows\n\nInteresting, do you have a link / source on that?", "score": 17, "replies": [{"body": "https://www.reuters.com/markets/us/6-trillion-cash-hoard-could-fuel-more-us-stock-gains-fed-pivots-2023-12-15/", "score": 4, "replies": [{"body": "It says cash is at 15.5% in line with the median.", "score": 3, "replies": []}]}]}, {"body": "No it isn’t. Cash is a huge part of people’s portfolios.", "score": 8, "replies": [{"body": "Can’t both be true?", "score": 2, "replies": []}]}]}, {"body": "The issue is it’s already priced in & jumping in now could mean you get in at the peak. When rates do inevitably fall and interest on money accounts are no longer worth it, the flow into the market will drive it to all time high & likely screw the people who go in at that price. ", "score": 29, "replies": [{"body": "pretty much the problem with trying to time entry and exits into money market funds based on rates. \n\nPeople all last year saying why invest in S&P when I can get 5% in a cash etf. Well, S&P had a great return last year and once the rates go down so that the money market etf is no longer attractive you already missed a lot of the gains.", "score": 20, "replies": [{"body": "Wanna know how much SPY is up since Sept 3 2021?  Just 5%.  5% total in over 2 years.", "score": 8, "replies": [{"body": "Yeah so? You can cherry pick windows with hindsight, doesn't change my point", "score": 0, "replies": [{"body": "It absolutely does, and your refusal to acknowledge it doesn’t matter.  It’s pointing out that parking money in a high yield MMF can provide better returns than the market.  You cherry picked the “great returns last year”.  What about the year before that?", "score": 12, "replies": [{"body": "The point Is if you are trying to time the perfect time to sell you investments to move into money market funds, and then the perfect time to sell your money market funds to move back into equities, you'll underperform.\n\nAnyone can point to a specific window with hindsight where xyz trade did better than just buying and holding, but that's not really useful because the chances of timing it right at the time when the trades must be executed are not good. Sure some people might get *lucky* with the timing, but luck is not something to rely upon with retirement funds\n\nBut hey, you do you, go ahead and time the market if you want, you'll underperform long term, and if that's what you want to do, go for it.", "score": -5, "replies": [{"body": "“You’ll underperform” again, you’re speaking in absolutes as if you have a crystal ball, and you don’t.\n\n“Anyone can point to a specific window” and that’s exactly what you did.  You focused only on last years gains, and as soon as I spoke up and made you zoom out an extra 16 months, suddenly your tune changes to “well that’s cherry picking and doesn’t change my point.”  It absolutely does.  There’s zero reason to buy right now near all time highs when there is a guaranteed 5%+ for just parking your cash and then when the market inevitably pulls back 10%+ which it does often, you can then start buying back in.", "score": 3, "replies": [{"body": "Ok good luck, you'll need it", "score": -5, "replies": [{"body": "Oh really, would you like to compare account performance?", "score": 4, "replies": [{"body": "Ok Mr. Crystal Ball", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Timing is everything! The people in this article are missing the boat.\n\nThe time to buy/build a house was in 2020/2021 prior to the surge and before rates drove up.\n\nThe time to buy long term CDs was in October/November 23. You could have got 4.8% 10 year CDs that pay monthly. You could cash those CDs out today for like a 4-6% gain on secondary market. Imagine the value if rates get destroyed.\n\nThey should be using their interest to invest in market weakness today, not down the road.\n\nIf rates get fucked and they find themselves almost all cash at or near all time highs in the stock market. In my opinion, they have 5 options.\n\n1. Buy 20% into market immediately and don't worry about what happens. Sell covered calls if they want to supplement income. In the end, a big market crash would be beneficial in that position, even if 20% of their portfolio gets caught at the top.\n2. Buy short term treasuries at shit rates while praying for a crash or market weakness. Banks/oil/crypto/tech etc.\n3. Buy rental properties if they have a lot of money and don't mind that work.\n4. Sell puts in a laddered strategy. At least get paid premium to buy into the market at a discount from the current levels. Worst case you pocket the premium.\n5. Do a mix of any of the above.\n\nAll that said, these people will potentially kill it if market crashes.", "score": 9, "replies": [{"body": "Hindsight has always 20:20...", "score": 11, "replies": [{"body": "While that's true, there are indicators to these things.\n\n1) Covid stock crash meant buy. Could it get worse? Yea, but companies being down that much was worth the risk.\n\n2) Rates at 3% prior to price surge knowing houses appreciate year over year for the most part was a no brainer. Especially when you compared it to renting at the time.\n\n3) The Feds were literally saying for months that a pause in rates followed \\*most likely\\* by cuts eventually was coming. That's after already raising rates that many times. There was a 2-3 month window to bet on long term treasury/CDs. Worst case was getting 4.8% for 5/10 years+\n\n4) Buying stocks again in 2023 when market was down 30%.\n\nI'm not even saying all in on all of this stuff, but each event was worth investing in just based on odds without even knowing the outcome.\n\nThe current market conditions is far harder to tell what is going to happen at this point in my opinion.", "score": 1, "replies": [{"body": "I had a hard time buying because everything was going way over asking. Property values shot wayyyy up. So yes, it was better to overpay but it was a hard pill to swallow. No way can you expect people to buy a house\n\nhindsight is 20/20", "score": 2, "replies": [{"body": "Every market is different and everyones position is different so it's hard to cover all the ins and outs in a post.\n\nI was there for that experience, looking at houses in 2020. I built a house instead. Was it the exact house of my dreams? No, but it's a nice house. I took what I could afford at the time knowing that if prices dropped, I might not recover that equity for a while if ever. I bought this house with a 10 year horizon. My hope is to build a new house or move out of state or both within the next decade.\n\nMy point just was, that it doesn't matter if you were looking to buy a house for 100k, 400k, or a million, the low rates were worth the risk in that moment. Hindsight so far just confirmed my belief at the time.\n\nI'm just sharing what I view are indicators of improved odds for a good outcome. Timing it perfectly is impossible so I try to play the odds.\n\nFor example, I have been slow buying banks and oil as it dips as an entry position. If both those bounce back, I'll make a nice profit. If it continues to dip, I have it mapped out to buy more all the way down.\n\nOnce the nasdaq stops going up and pulls back 4-5%, I'll auto buy the index. Stuff like that.", "score": 1, "replies": []}]}]}]}, {"body": "Spy is still near an ath. How is that market weakness?", "score": 3, "replies": [{"body": "I know, I meant they need to look for things that are down or buy pullbacks.\n\nBank of America for example is down 5.74% in the last 7 days. That could be a 5.7% gain if banks pop. You could also sell puts on that since it is down already from its recent high and potentially buy it on a \"10%\" discount.\n\nOil stocks are down. Exxon mobil for example is down 13.66% in the last 3 months.\n\nI'm not saying those are must go buy now! Each company/sector is different. Just a few examples that not everything is up.\n\nThe nasdaq for example hit 15150 in late december but fell to 14490 by January 5th. That would have been a perfect time to deploy some cash. You would already be up 3.9% in 13 days.\n\nIt's also not the worst idea to establish a position with interest from CDs etc. incase the market plows higher if you were starting today.\n\nIt all varies based upon each persons individual situation.", "score": 4, "replies": [{"body": "I am with you. I misunderstood your comment.", "score": 1, "replies": []}]}]}]}]}, {"body": "The world is a tinder box right now. Eventually, something is gonna go down. Won’t take us to 0, but it’ll cause a sizable dip. This is the time to strike and call it a day. Until then, get 5% guaranteed.", "score": 12, "replies": []}, {"body": ">\"Every month, I'm looking at inflation\" he said. \"If l'm not earning at least 1.5% more than inflation, I have to think about different strategies.\"\n\nHowling at this terrible strategy, perfect recipe for long term underperformance.", "score": 26, "replies": [{"body": "Right these quotes read like an AI pulled them of certain other subs….", "score": 5, "replies": []}]}, {"body": "I love how his answer is that he is saving for a rental. Lol", "score": 11, "replies": []}, {"body": "Everyone loves repeating this money on the sideline myth", "score": 9, "replies": []}, {"body": "How much of that money is boomers retiring on a risk free 5% and never coming back?", "score": 2, "replies": []}, {"body": "I ain't touching a crumb till this shit goes into\nDiscount.\n\n\nThen I'm waiting for MMs to pull back on the sidelined money that FOMO'd in.\n\nThen I'll begin my dca'ing into wash sales for a tax offset.\n\nSo fuck off shills. I'll wait.", "score": 6, "replies": [{"body": "I can’t imagine hating money this much ", "score": 1, "replies": []}]}, {"body": "I’m 65% cash in a money market and 35% in stocks. I’m going to collect the 5.3% interest on my cash for as long as I can as it’s safe. I’m also looking to buy a house soon so I don’t want to take on the risk of the stock market. \n\nMaybe buying in the stock market right now is a once in a lifetime opportunity, but for me I have never seen a 5.3% rate on money market accounts before. Feels like it’s also once in a lifetime opportunity to take advantage of.", "score": 5, "replies": [{"body": "By the time the yield on cash dries up you will have missed out on a lot of gains", "score": 3, "replies": [{"body": "History says the opposite - big drops in the stock market historically when rates are cut, more often than not at least. Maybe this time is different though!", "score": 3, "replies": [{"body": "It depends on if a soft landing is actually achieved or not.", "score": 1, "replies": []}]}, {"body": "Maybe but if I want to buy a house and stock market goes down I would lose a lot too. There is no promise stock market is going to increase more than 5% in 2024.", "score": 2, "replies": [{"body": "I agree then if you’re planning to buy a house in the near future I would keep it in cash equivalents as well", "score": 5, "replies": []}, {"body": "thats not the point. The point is there's like a 99% chance VTI/the market as a whole in 5 years would beat the ~25% you would from guaranteed interest in a money market 5% each year. And thats a profit gap that widens the longer term it is if you believe in America's economy/ it being the #1 superpower.", "score": 3, "replies": [{"body": "The difference is OP is looking to buy a house. That means they don’t have a 5 year investment horizon.", "score": 2, "replies": []}]}]}]}, {"body": "You’ve missed out so much last year. Lmmmaaoo", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I think inflation is the bigger concern than stock market performance.", "score": 4, "replies": []}, {"body": "Who is \"they\" in this comic strip dialogue masquerading as market commentary?", "score": 3, "replies": []}]}, {"body": "I don’t see all of it coming into the stock market but even a part of it would be bullish.", "score": 1, "replies": []}, {"body": "There's something about these \"cash on the sidelines\" arguments I don't understand.  If $8.8T in MM funds moves into the stock market, then $8.8T leaves the stock market, no?  For every buyer there's a seller, no?\n\nWhat do the sellers do with the cash they get?", "score": 1, "replies": [{"body": "It basically means a transfer of wealth held in treasury bills (gov bonds) to stocks.", "score": 2, "replies": []}, {"body": "Not saying I agree with the conclusion but the idea is that that money would only leave if the price was adequately high.  Then they could go into private credit, alternative assets, creation of new debt, etc. if they couldn't find suitable opportunities in equities.", "score": 1, "replies": []}]}]}
{"title": "Trying to understand Elon's reasoning and could there be a legal way to relinquish one's shares' voting power?", "selftext": "I've been thinking, I personally wouldn't mind giving away my voting rights. By the way, as a French investor using a French broker I have never been able to vote. I did register on Tesla's website but the verification has been pending for over a year, I doubt I will ever be able to vote. Kinda sucks but I have no idea if it's even possible to validate my right to vote.\n\nSo first, I have been trying to understand Elon's reasoning. Here's what I'm thinking without giving any opinion: him wanting to keep some control makes sense in his rhetoric, as he is really afraid of the unchecked power of AI. I agree that he then shouldn't have sold shares, but he viewed controlling Twitter as inevitable if he wanted to protect humanity's freedom of speech, whose impediment he considers a threat at least as dangerous as AI. He basically has what he considers moral imperatives to ensure humanity's survival, in our case the control of AI has been hindered by the protection of freedom of speech.\n\nElon is quite often misunderstood because people focus on one of his opinions or actions instead of looking at the whole picture which is quite complex.\n\nAnyway, since Elon wants 25% control, and I do believe he can get us to $5 trillion and we need him, what if enough shareholders were somehow able to hand over their voting rights to Elon while keeping their shares? It's probably an impractical idea but it would actually solve the problem without resorting to dilution or other shenanigans. For me, it wouldn't make any difference as I am not able to vote anyway lol.\n\n&#x200B;", "id": "199pgm5", "created_utc": 1705582274.0, "score": 2, "upvote_ratio": 0.52, "num_comments": 80, "comments": [{"body": "Most companies fix this by having 2 classes of shares. Normal shares for the open market, with 1 vote per share. And preference shares that only get awarded to C-suite and board members, that have 10, 100 or 1000 votes per share and cannot be traded on the open market.", "score": 8, "replies": [{"body": "Most companies? I don't know a way to check but I assumed only a small minority would have that.", "score": 4, "replies": [{"body": "Companies that want to raise money by issuing shares, but not give up a controlling interest.", "score": 2, "replies": []}, {"body": "Yeah it's usually a bad thing when companies take away power from shareholders. That means they can do whatever they want.", "score": 1, "replies": []}]}]}, {"body": "That’s interesting. I’d defer my voting power to Elon indefinitely if it made him get his head out of Twitter and into Tesla.", "score": 6, "replies": [{"body": "I hope that the people that voted for him to buy Tweeter are happy now after all the  damage this has caused to everyone.", "score": 1, "replies": [{"body": "not everyone. He paid me well for my sharses...", "score": 1, "replies": []}]}]}, {"body": "Elon could get us to 5T eventually but I believe there are multiple CEOs out there who could do it and so there is no point trying to hold on to Elon at all costs. CEO has much less significance when company is stable and has plans already set for years forward. Like next 5 years at least will happen similarly regardless who is CEO. Elon was more important in 2018 when company was struggling and that is not the case anymore.", "score": 29, "replies": [{"body": "However no other CEO will try to protect against abuse of the technologies developed at Tesla. Other CEOs see any company they lead as just \"some company\"...and they will do whatever brings in most cash. \n\nThey couldn't care less whether that means e.g. selling AI/Teslabot as soldiers or other ways of oppressing humans. If large investment funds demand bigger returns then they will do it. They will just go on to be CEOs at some other company if that backfires.", "score": -3, "replies": [{"body": "I don't really believe Elon should be trusted to be some caretaker of AI. He certainly didn't end up being caretaker of free speech so why would this be different?", "score": 29, "replies": [{"body": "Do you think Microsoft will be a better caretaker?", "score": -2, "replies": [{"body": "Well Microsoft is controlled by more than one person so yeah I would take company with multiple individuals over single individual.", "score": 9, "replies": [{"body": "Do you think Microsoft was a good caretaker by making OpenAI to CloseAI and for profit?", "score": 1, "replies": [{"body": "Do you think Tesla won't be using FSD and other AI products for profit? I see nothing wrong with company using it's products to make profit because that is literally what companies do. No one is here for the charity, we are here for the money.", "score": 6, "replies": [{"body": "We are speaking about caretaker, OpenAI was ment to be \"OPEN\" to the public, hence be free like LINUX, and see what did happen then Elon was kicked out.", "score": 3, "replies": [{"body": "Elon left himself citing conflict of interest. He was not kicked out. OpenAI was really never open (we never got to see their code for example) and it is preposterous to assume people invest money on company and expecting nothing in return. It is not cheap to run ChatGPT so it is illogical to assume investors will just fund the losses from their own pocket instead of having users pay for that service. No company can operate with zero revenue. Even Elon now has Grok and is asking money for usage.", "score": 7, "replies": []}]}]}]}]}]}, {"body": ">I don't really believe Elon should be trusted to be some caretaker of AI.\n\nYou have someone better in mind? Currently no one is doing it. I'd trust Elon over no one. It's certainly no guarantee that it'll work but it's better than nothing, for sure.", "score": -7, "replies": [{"body": "I don't think it should be trusted on any single individual. That would just lead to same thing as in dictatorships. Instead have board of multiple people.", "score": 10, "replies": [{"body": "Given the right individual, single individual is more efficent in making decision. Dictatorship is not always bad, provided its the right individual. In this case, imo Elon is the right man.", "score": 0, "replies": []}, {"body": ">Instead have board of multiple people.\n\nSure taht would be another option. It's no better, though and without shares such a board wokd be a paper tiger.\n\nIt might work for a while...but eventually you get the same problem as in any democracy. Piece by piece people get bought out...and they'll rationalize this because \"there are always enough others who will overrule my bought vote\"\n\n...until there aren't.", "score": -2, "replies": []}]}, {"body": "> I'd trust Elon over no one\n\nI don't. I don't believe in gods. Elon has shown, in several situations that he can be temperamental,  unhinged etc. Look at what he has been doing in Tweeter.", "score": 1, "replies": []}]}]}, {"body": "Exactly. Tesla could become like General Motors, Boeing or so many others. Not to mention it would probably not be good for finances long term.", "score": 4, "replies": []}, {"body": "What if one of the other Tesla officers took the job? I think Zach Kirkhorn would be great CEO.", "score": 1, "replies": [{"body": "Zach is not with the company anymore", "score": 5, "replies": [{"body": "The Board could pursue him to return as CEO.  Personally, I'd like to see JB at the helm if/when Elon is out.  You listen to any interview with him and he's just as technically knowledgable and forward thinking as Elon but doesn't have the batshit polarizing tendencies.", "score": 2, "replies": []}, {"body": "True and tragic. I still think he'd make a great CEO for us.", "score": 1, "replies": []}]}, {"body": "Zach is a snitch", "score": -1, "replies": [{"body": "What the hell does that mean?", "score": 2, "replies": []}]}]}]}]}, {"body": "Give Elon the shares but make them unsellable. Easy.", "score": 11, "replies": []}, {"body": "I think he just wants a repeat of the 2018 deal.  That deal was 1% of shares for every 50b he increases the market capitalization . Tesla was about 50b at the time, so it was pretty much 1% payout per 100% increase.", "score": 3, "replies": []}, {"body": "Still doesn't account for his compensation.\n\nHe is basically working for free for the last 2 years.", "score": 3, "replies": []}, {"body": "We don’t need him for Tesla to succeed long term\n\nThere isint a single CEO on the planet that is not replaceable.", "score": 21, "replies": [{"body": "He isn’t replaceable in the direct sense. Anyone who thinks so is pretty naive to how he runs his companies. You should read “Musk” by Walter Isaacson if you think this.\n\nThat doesn’t mean Tesla will fail if he is fired or quits and a new one comes. It does mean the company will have to drastically change though, which is what I mean by not being directly replaceable.\n\nThe company has formed arojnd Musk and how he leads. He clearly pushes progress in a way that is unprecedented. But he is also erratic. The types of people how companies attract, and the roles they fill, and how they fill those roles, are in compliment to Musk.  You can’t just exchange him for another CEO. \n\nNot withstanding how the company would fair all other things being equal, there would be a bit of a exodus of his followers if he left too. \n\nHere’s the thing people forget, tesla share price isn’t based on what is now. It is also based on some expectation on the future under Musk. Musk has made many promises and people generally expect Musk to eventually deliver. When you look at teslas marker cap compared to competitors it makes no sense unless you are factoring in that robotaxi might actually come, Optimus might actually make it, cybertruck might actually be a success. These sort of pursuits… do you think they would happen without Musk? I don’t think so. However tesla what it is today can be maintained with far more stability with another CEO. But Tesla shares are far overpriced if you just want stability with what is currently on market.\n\nWe need to keep Musk. But man I wish he would prioritize improving his public image.", "score": 14, "replies": [{"body": "No one is 1:1 replaceable. Everyone is replaceable tho\n\nTesla is mature enough to have a culture within the company, musk and others did that. Without them it will continue to\n\nI’d love for him to stay too, if he sold Twitter, deleted his social media accounts, and only ever spoke to the public about Tesla", "score": 1, "replies": [{"body": "Tesla won’t continue to be what it is without him. That’s extremely clear. And again, you can have a more stable company without him but that’s not what share holders are banking on, realize it or not. The stock is valued with some level of expectation that these business multipliers will succeed, and some expectation that new business multiplier ideas will come. And that’s Musk. Even if the idea didn’t stem from Musk, it is Musk who steers the company. \n\nHe’s one of a kind. Love him or hate him. How he turned Twitter into a startup company within 30 days is extraordinary. Right wrong, it’s unlikely there is anyone else alive who could do that. You might think it was wrong that he did it, or how he did it. But it’s incredible that he was able to.\n\nThe way he forces changes and culture at his companies is unique to him.\n\nYou remove him, Tesla changes. Ford spends twice as much on RandD than Tesla. They have more vehicles, but they don’t have people designing their own ASICS for car and server. They don’t have people creating ai farms. They don’t have people creating Optimus robots. They don’t have people reinventing alloys. They havnt been able to do thjngs like steer by wire or 48v or 1gbps canbus. They aren’t reinventing assembly lines like Tesla. \n\nThis is the people Musk attracts. “Hard core” people as he calls it. People who are happy to be called at 1 am on a Saturday to come into the office to try something, or to explain why a certain assembly has 3 bolts instead of 2. Musk spear heads the “hard core” work mantra and people follow.\n\nThere’s a ton to hate about Musk. But give the devil his due. He runs extremely efficient companies, he controls company direction and narrative like no other, he attracts efficient people like no other, and these roles and teams are moulded to his behaviour. \n\nTo summarize, Remove musk, remove the growth curve. But you can create stability. But the stock isn’t priced for stability. Remove musk and the marketcap will change to something reasonable in comparison to their revenue and profits and that of their competitors.", "score": 3, "replies": [{"body": "I agree in some cases. The biggest risk to losing musk is a CEO that replaces him does things to derisk and slow down development. \n\nThe risk of him staying while trying to dilute us by demanding another 15% is insane, hes definitely not nearly as dedicated to tesla as he once was, and he’s actively turning customers against the brand. \n\nI still think he’s a net positive to the world, but not to Tesla as he stands. \n\nI want the Old Elon back", "score": 2, "replies": [{"body": "He has always gone in waves with Tesla dedication. It seemed like there is/was good synergy with Spacex atleast and it was a nice brand to be associated with. I remember so much marketing over the years “designed for use with nasa”, memory foam beds anyone?\n\nSame thing with Tesla. Using alloys that are used with a rocket ship always sounded good.\n\nTwitter association is a negative one, and there isn’t really any shared technology/materials. Maybe some AI stuff but not really. \n\nBoring company is also positive. They use Tesla cars so that’s a nice small market for Tesla. And as boring company expands, if they become successful, it’ll be a good way for folks to experience teslas even if the number of teslas sold to boring is low.\n\nNeural Net is a negative for Tesla I think. But it doesn’t seem like Elon puts much effort there. Even when he does a talk there… it seems like he is quite disconnected. It’s clearly out of his expertise. He can talk software even if he gets it wrong sometimes. He has built software systems and has done software startups. He built the first real navigation map system. He is good with material science and structural. He is able to visualize stresses. But he seems to lack biosciences and I don’t think he is all that interested in learning it. So even if Neuralink does nothing for Tesla, atleast it doesn’t seem to be much of a distraction.\n\nTwitter wouldn’t be as much of a distraction but media won’t stop reporting on it.  Neuralink and boring company hardly make the news. Twitter is in msm every day.", "score": 3, "replies": []}, {"body": ">trying to dilute us by demanding another 15% is insane\n\nYou never herd about A and B shares? Tesla can give Elon a B share that give 100 000 votes/share, after completed new goal, like sell 3 million car, market cap of 2 billion, 5 million car etc  \n\n\nThe dilution will be minimal.", "score": 3, "replies": [{"body": "That's not possible once the company is public", "score": 2, "replies": []}, {"body": "If there 0 dilution, then yea give him the ownership. \n\nIf there’s any dilution tell him to buy it back, he’s not entitled to it", "score": 2, "replies": []}]}, {"body": "Data shows that more people would buy a Tesla because of Musk.  I can’t remember where the poll was done otherwise I would post it. Just because you don’t agree with him doesn’t mean others don’t. More and more people see his free speech crusade as a plus.", "score": 1, "replies": []}]}, {"body": "2 bolts are better than 3. But no bolt is better than all.", "score": 2, "replies": []}]}, {"body": "Elon can be replaced once we got fully working FSD and Optimus, automotive and energy global domination then the valuation of over $1T+ is justified without crazy innovations and then we can put some kind of Tim Cook-type figure as CEO", "score": 0, "replies": [{"body": "You shouldn’t consider them in your stock valuation, too much speculation and if either of them do end up working Tesla will be worth far more than 1T\n\nHe also is not needed for either to work. Although he’s probably one of the few that would still push them even if they were failing.", "score": 2, "replies": []}]}]}, {"body": "Amen. Well said", "score": 0, "replies": []}]}, {"body": "Misleading statement. Everything I’ve said is true, but the expected outcome with and without Elon is radically different, say in terms of share price at 2030.", "score": 4, "replies": [{"body": "What’s everything you’ve said?", "score": 1, "replies": [{"body": "I meant you’ve *", "score": 2, "replies": [{"body": "Whats the expected share price with and without him in 2030", "score": 1, "replies": [{"body": "600 \n higher", "score": 1, "replies": []}]}]}]}]}, {"body": ">There isint a single CEO on the planet that is not replaceable.\n\nBut some CEO will drive a company, look at Steve Jobs, he did drive Appel to record heights. Look at Appel now, they make ridiculous amount of money, and can afford the best brains on the planet, but they are unable to successfully do the \"next thing\"\n\nIf Elon is gone from Tesla, Tesla will be the new Appel, they will do ridiculous amount of money, but not thirst for the \"next thing\"", "score": 1, "replies": [{"body": "100% true. There isn’t a company on the planet with as many projects that have as big a potential on the planet or history for that matter.   Tesla has numerous ways to get the company to 10x+ within the next 10 years.  I feel bad for the people that can’t see that and will miss out. Just the potential of the Optimus Bot alone is mind blowing.  Car margins aren’t a concern I have.  Price cuts for traditional auto makers would be problematic but Tesla is constantly working to reduce cost. Their battery costs because of the reduction of raw material costs have already  been lowered. When humanoid bots are added to their production line they will dominate the auto industry.", "score": 2, "replies": []}]}]}, {"body": "His post seem pretty clear: he doesn’t want nefarious entities to take control.\n\n“At 15% or lower, the for/against ratio to override me makes a takeover by dubious interests too easy. “", "score": 4, "replies": [{"body": "What nefarious entities and what does he think they'll do?\n\nHe's at 20% with his options. He sold like 1-3% for Twitter. He shot himself in the foot and claims he wants more guns to fight off bears or something. If he wants more control the board should abide and make more difficult challenges, with clawbacks if they're just hot air -- which a lot of the current valuation appears to be.", "score": 4, "replies": [{"body": " Technology in the wrong hands is dangerous. You really can’t see that?", "score": 3, "replies": [{"body": "Are you sure that AI in Elon's hands is the right hands?", "score": 1, "replies": [{"body": "Yes I am.", "score": 1, "replies": [{"body": "Just like he protected free speech at Twitter? I guess he could sell Twitter and buy some Tesla stock, should be enough to take back control once he does sell Twitter with profit. I mean I'm assuming he should be able to after he fixes the bot problem already.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If he wanted to maintain a 25% stake he shouldn’t have sold and bought a messaging app.  Giving him more shares just to sell them again only hurts everyone else.   It’s time for Tesla to move on from musk. ", "score": 2, "replies": []}, {"body": "No. No. NO! What is this bullshit?", "score": 1, "replies": []}, {"body": "> but he viewed controlling Twitter as inevitable if he wanted to protect humanity's freedom of speech\n\nI don't buy this. He complies with dictators all the time", "score": 1, "replies": [{"body": "Trump?", "score": 0, "replies": [{"body": "Erdogan", "score": 1, "replies": []}, {"body": "Turkey and China", "score": 0, "replies": []}]}, {"body": "huh? free speech means everyone can speak.", "score": 0, "replies": [{"body": "https://arstechnica.com/tech-policy/2023/05/musk-defends-enabling-turkish-censorship-on-twitter-calling-it-his-choice/", "score": 1, "replies": []}]}]}, {"body": "I, for one, would find it deliciously ironic if Tarpanning and Eberhard joined forces and took Tesla back.", "score": -2, "replies": []}, {"body": "He was kicked out from OpenAI, the company he did co-started, that would develop a Open AI, noe OpenAI is closedAI and own by Microsoft.   \n\n\nHe do no want the same thing happen with Tesla. So he put a ultimatum, give me the voting power, not this do not need to be \"real stocks\" but voting stocks like Mark Zuckerberg have in Meta/Facebook, so it do not need to dilute the monetary value of the stock.", "score": 1, "replies": [{"body": "Do you  seriously believe OpenAI can thrive with been open source? Do you realize how expensive it is to train their model on H100?", "score": 0, "replies": []}]}, {"body": "Let’s buy X from Elon for 100B. Great IP for Optimus to achieve Tesla-vision towards exponential Von Neumann AGI and true FSD as Elon outlined in his original white paper.", "score": 0, "replies": [{"body": "X provides... none of those things.", "score": 5, "replies": [{"body": "X provides unlimited data for X.AI", "score": 1, "replies": [{"body": "For a chat bot trained in the style of Tay 2.0... Nothing to do with self driving or even robotics at all, or even generalized intelligence since there's basically ZERO facts or research on twitter at all -- just reactions. So zero benefit to humanity or Tesla.", "score": 1, "replies": [{"body": "Sorry but you’re wrong. There are facts and research on X that are part of the posts. it also collects real time data from events, photos and videos.", "score": 1, "replies": [{"body": "There's bots being trained on bot data as well, which make up a large percentage of posts now. Live breaking news is pretty much gone (see recent earthquake in Japan, flooding last year in CA, TX snow this year, etc.). There's more lies and disinformation than before. Have you even used Twitter? Its not a valuable dataset for anything anymore.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "He’s just a rich guy trying to get richer.  He has no real humanitarian intentions or he wouldn’t tell everyone to vote for the party of climate change deniers.", "score": -1, "replies": [{"body": "There isn’t a party of climate change deniers but there is a party that knows you can’t switch overnight and Elon agrees with that. You need to not be brainwashed by MSM.", "score": 1, "replies": [{"body": "Oh I’m sorry I meant party that argues climate change is good because it keeps people from freezing to death.  Better now?", "score": 1, "replies": []}]}]}, {"body": " \"He viewed controlling Twitter as inevitable if he wanted to protect humanity's freedom of speech, whose impediment he considers a threat at least as dangerous as AI\"\n\nI don't buy this idea that you protect humanity's freedom of speech by buying Tweeter. Actually i get really annoyed by this childish believe. I really think it's a fantasy planted in his brain.  Do Elon think that all  the world is in Tweeter? This idea seems to be from someone detached from reality. Only a tiny fraction of people use Tweeter.", "score": 1, "replies": []}, {"body": "Guys be real. He says it’s about control. Yes he wants the control but obviously he wants the money just as much.", "score": 1, "replies": []}]}
{"title": "$AMD Double Top", "selftext": "", "id": "199e5v4", "created_utc": 1705542120.0, "score": 159, "upvote_ratio": 0.87, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|834|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "When there’s an obvious double top, you gonna get rekt on fomo puts, squeeze ur nuts till 169 and when you are down 60%, 3days to expiry you finally take the loss & sell, 3 hours later AMD will then dump hard and there you are filling wendy’s application to blow whoever behind their dumpster for 15bucks per.", "score": 85, "replies": [{"body": "This is exactly what will happen. Also my 140 CC expiring this Friday is so fucked.", "score": 8, "replies": []}, {"body": "Bullish", "score": 0, "replies": []}, {"body": "You fuckin wizard", "score": 0, "replies": [{"body": "I’m experienced I would know the price, I mean the bj.", "score": 1, "replies": []}]}]}, {"body": "Dang, OP getting double topped. Calls on double penetration", "score": 34, "replies": []}, {"body": "Literally make or break.", "score": 42, "replies": []}, {"body": "You regards were saying this at the end of last week\nYou're gonna get rekked till earnings", "score": 31, "replies": [{"body": "I feel like it could have legs to 180 considering that’s the 1.618 and it’s held structure on the fib retracement, it already Backtested $130 support and there’s time before earnings. I can’t believe I had 2000 shares of this shit at $14 in 2017 and took a loss on it😑", "score": 31, "replies": [{"body": "Oh no its regarded...", "score": 4, "replies": []}]}]}, {"body": "Calls it is!", "score": 25, "replies": [{"body": "I bought calls 21 days out 😆", "score": 6, "replies": [{"body": "Buys calls that just doubled in price lmao buy stock", "score": 2, "replies": [{"body": "Ill report back with numbers", "score": 2, "replies": [{"body": "What's did you place calls at", "score": 2, "replies": [{"body": "7.15", "score": 1, "replies": [{"body": "https://preview.redd.it/yno92ed8s7dc1.jpeg?width=903&format=pjpg&auto=webp&s=4002202d129bed793f07a42e1d52252fa109dbf0", "score": 1, "replies": [{"body": "I need the % number. But regardless gz.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "While I make the money with PUT in the morning ![img](emote|t5_2th52|4271)\n\nhttps://preview.redd.it/z0qvpyzm14dc1.jpeg?width=1290&format=pjpg&auto=webp&s=e205ee3688a11c90769087fef2f93fc9d63f3ee1", "score": 24, "replies": [{"body": "Annnnnd it's gone.", "score": 18, "replies": [{"body": "![img](emote|t5_2th52|4259)", "score": 2, "replies": []}]}, {"body": "Congrats and fuck you, I saw it and didn't act on it.", "score": 9, "replies": [{"body": "Why not?", "score": 1, "replies": []}]}, {"body": "congrats man!", "score": 3, "replies": []}, {"body": "Puts in what pal ?", "score": 1, "replies": [{"body": "AMD", "score": 3, "replies": []}]}]}, {"body": "This shit chart is going no where until ER", "score": 9, "replies": []}, {"body": "Regards see double top, so jump in puts…so I’m jumping into full port calls, not selling till we clear 164.60.\n\nOr am I Regard.🫥", "score": 11, "replies": [{"body": "Lots of call OI this Friday exp. My vote is call obliteration via gap down. Who knows tho, have a ton of puts ATM", "score": 6, "replies": [{"body": "They'll dissolve both by staying sideways", "score": 7, "replies": [{"body": "Who is they? You guys are regarded as fuck", "score": -1, "replies": [{"body": "Says the regard", "score": 0, "replies": []}]}]}]}]}, {"body": "nothing can stop lisa su and her team. ![img](emote|t5_2th52|8882)", "score": 3, "replies": []}, {"body": "Just zoom in a little and you are in clear up trend with no end.", "score": 5, "replies": []}, {"body": "Puts print like brrrrrrr", "score": 7, "replies": []}, {"body": "What does it mean?", "score": 2, "replies": []}, {"body": "Going to $200 clowns", "score": 2, "replies": []}, {"body": "In this market - charts are useless. EVERYTHING just GO UP :D", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I will be messaging you in 1 month on [**2024-02-18 03:14:27 UTC**](http://www.wolframalpha.com/input/?i=2024-02-18%2003:14:27%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/199e5v4/amd_double_top/kidu201/?context=3)\n\n[**7 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F199e5v4%2Famd_double_top%2Fkidu201%2F%5D%0A%0ARemindMe%21%202024-02-18%2003%3A14%3A27%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20199e5v4)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Fucking thank you", "score": 1, "replies": []}]}, {"body": "facts. NVIDIA and AMD to the moon!", "score": -2, "replies": []}, {"body": "sorry have you been lost for the past 17 days?", "score": 1, "replies": []}, {"body": "Everything go up... until a door plug blows off", "score": 1, "replies": []}]}, {"body": "To the moon", "score": 3, "replies": []}, {"body": "you’re not zoomed out far enough, try ALL", "score": 1, "replies": []}, {"body": "The great x3D CPU's AMD released last year in combination with the high VRAM on their GPU's which sell like never before, the shitty Intel 14 series whom are not a threat and the mediocre overpriced 'Super' GPU's from nVidia released this January made AMD settle in a strong position.  \n\nCurious what nVidia can bring with their 5000 series.", "score": 1, "replies": []}, {"body": "Waiting to inverse WSB. For now, it looks like it is going to moon.", "score": 1, "replies": []}, {"body": "I see about 5 tops", "score": 1, "replies": []}, {"body": "Muffin top", "score": 1, "replies": []}, {"body": "Disregards $164 and goes to $200", "score": 1, "replies": []}, {"body": "Please keep buying my puts.", "score": 1, "replies": []}, {"body": "Buy a ton of AMD?", "score": 1, "replies": []}, {"body": "Not yet. 164 is coming , at least, is my expectation", "score": 1, "replies": []}, {"body": "So calls?\n\nCuz your charting skills are crap if you think that's a double top.", "score": 1, "replies": []}, {"body": "Put", "score": 1, "replies": []}, {"body": "Nvda had triple tops and it’s about to hit 600 soon lmao", "score": 1, "replies": []}, {"body": "I would say it’s a monstrous invers SHS😱😱", "score": 1, "replies": []}, {"body": "It’s always the best interest for retail traders to be bullish.. they make money when we make money if everyone lost there would be no stock market or economy the same for if everyone won …the word market literally means fluctuating prices bid & ask supply & demand stuff amd will pull back but these pull backs will be lighter", "score": 1, "replies": []}, {"body": "Sometimes I wonder if the AMD guy is still living", "score": 1, "replies": []}, {"body": "It's not a double top unless the bottom of the valley is confirmed again, and even then it doesn't mean it will play out, case in point: see gold weekly chart.", "score": 1, "replies": []}, {"body": "double trouble", "score": 1, "replies": []}, {"body": "A double top can only be established if it stops making highs. If it makes a new higher high, you are fucked. And it will.", "score": 1, "replies": []}, {"body": "short that shit, put your money where your mouth is", "score": 1, "replies": []}, {"body": "s&p double top on the monthly/weekly..", "score": 1, "replies": []}, {"body": "Look at price to earnings, wowza.", "score": 1, "replies": []}, {"body": "People said the same about NVDA...", "score": 1, "replies": []}, {"body": "Say it the right way = SPY double top.", "score": 1, "replies": []}, {"body": "No, it's a, take off", "score": 1, "replies": []}, {"body": "You do know that institutions love to buy and sell into obvious resistance/support patterns cuz regards like yourself are consistently buying/selling at these spots.", "score": 1, "replies": []}, {"body": "So, in other words, there's only two ways this can play out:  Either it's about to go up, OR it's about to go down.", "score": 1, "replies": []}, {"body": "...for now", "score": 1, "replies": []}, {"body": "You stupid?? That’s a big ass inverted head and shoulder. $400 a share incoming ", "score": 1, "replies": []}]}
{"title": "Why the EU COMMISSION can't legally veto the Amazon and Irobot Merger/Acquisition. (All in 40k.)", "selftext": "Currently, the Irobot stock price is around 25$ and the buy out price by Amazon is 52$. That is around a 100% ROI. The EU Commission is set to make a final decision on the Acquisition by February 14th 2024. This is my due diligence analysis about why I believe the EU cannot veto this Merger legally and ethically. Note: I am all in with 989 total shares at around 27 $ a pop. \n\n&#x200B;\n\n**Chapter 1 - Basics:** Lets get to the basics, I've worked for the government before and what I've learned is usually decisions such as these are not decided based on Government employees \"feelings\" but rather they have a set of  policies that they follow and interpret to decide if they should or should not veto a merger/acquisition. Knowing this the EU commission sent out a [Statement Of Objection](https://ec.europa.eu/commission/presscorner/detail/en/IP_23_5990) to Irobot/Amazon that outlined its perceived concerns  with the merger/acquisition. If I can confidently prove that the Statement Of Objections holds no merit, then that proves they have no merit/case in vetoing the merger/acquisition.\n\n&#x200B;\n\n**Chapter 2 - Statement Of Objection:** The Statement Of Objection mainly claimed that \"Amazon may have the ability and the incentive to foreclose iRobot's rivals by engaging in several foreclosing strategies aimed at preventing rivals from selling RVCs(robot vacuums) on Amazon's online marketplace and/or at degrading their access to it.\". It also claimed \"Amazon may have the incentive to foreclose iRobot's rivals because it may be **economically profitable to do so**.\"  That last part that i've bolded is them showing there hand allowing me to checkmate them later on in this post.\n\n&#x200B;\n\n**Chapter 3 - The Digital Market Act:** [The Digital Market Act](https://commission.europa.eu/strategy-and-policy/priorities-2019-2024/europe-fit-digital-age/digital-markets-act-ensuring-fair-and-open-digital-markets_en) is an Act by the EU commission to allow Business users who depend on gatekeepers, such as Amazon,Apple, and Google, to offer their Services/Products in a fairer business environment. For example this Act disallows gatekeepers such as Amazon to \"treat  services and products offered by the gatekeeper itself more favourably  in ranking than similar services or products offered by third parties on  the gatekeeper's platform.\" Non-Compliance for these gatekeeper company's will result in *fines of up to 10% of the company’s total worldwide annual turnover, or up to 20% in the event of repeated infringements.*\n\n&#x200B;\n\n**Chapter 4 - Check Mate:** There is no denying that Amazon has the **ABILITY** to foreclose and/or provide preferential treatment to Irobots products on its platform if the acquisition goes through. **But  Ability is nothing without incentive.** So, all we have to prove is that the incentive for Amazon to do so does not exist. In the Statement of Objection it said that the incentive for Amazon to do it is because it would be \"**economically profitable to do so**.\" \n\nFor the EU Commission to say Amazon has the incentive of profitability to treat Irobots products more favourably than its competitors would be saying that either:\n\n***A)*** *The profitability of favouring Irobots vacuum on the Amazon platform and/or foreclosing all its competitors is more profitable than up to 10% of Amazons total worldwide annual turnover+future fines for repeated infringements.* \n\n**B)** *that the EU commision does not plan to enforce the Digital Market Act fines on gatekeeper platform such as Amazon in the future.* \n\n\"A\" can't be true because profitability of undermining Irobots competitors is **NOT** MORE PROFITABLE than the fines incurred from the Digital Market Act for doing so.\n\n\"B\" cant be true because If thats the case then the entire Act serves no use if it is not enforced on. \n\n Economic profitability *incentive* CANNOT exist if its not economically profitable to do it!\n\n&#x200B;\n\n**Chapter 5 - Wrap it up:** The UK's CMA came to a similar conclusion before approving the acquisition that although Amazon has the ability it does not have the incentive to do what was outlined in the Statement of Objections submitted by the EU Commission. Things to keep in mind this does not take into account if the FTC will decide to sue block the merger and I do not promote gambling if you believe my analysis then put in what your comfortable with. I wont lie I regret going all in but I believe in my analysis.\n\n&#x200B;\n\n&#x200B;", "id": "19a0jt7", "created_utc": 1705611268.0, "score": 138, "upvote_ratio": 0.9, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "This could be one of the all time great posts - EU commission blocks this deal an hour after you posted", "score": 186, "replies": [{"body": "Wish he would have posted earlier after reading it I was ready to buy puts.", "score": 38, "replies": []}, {"body": "Isn't it just \"intends\" not confirmed blocked yet?", "score": 8, "replies": []}, {"body": "Aaaaaaand the account got deleted, lol.", "score": 2, "replies": []}]}, {"body": "Here you go boys, after losing half your money in the SAVE merger, surely it can't go tits up twice for you.", "score": 161, "replies": [{"body": "literally 4 minutes ago EU intends to block merger ![img](emote|t5_2th52|4271)", "score": 100, "replies": []}, {"body": "Yea, this won't end well.", "score": 14, "replies": []}, {"body": "Well the ATVI merger went the right way… 1 - 1", "score": 7, "replies": []}, {"body": "blocking mergers left and right is en vogue right now\n\nglobal communism next", "score": -3, "replies": [{"body": "How is this communism?", "score": 5, "replies": [{"body": "How is it not?", "score": -2, "replies": []}]}]}, {"body": "Aaaaaand the account is gone.", "score": 1, "replies": []}]}, {"body": "1 hour after you made this post...\n\n-34% and counting in aftermarket LOLOLOLOL YOU REGARD", "score": 92, "replies": [{"body": "50% down how far can we go ![img](emote|t5_2th52|4271)", "score": 24, "replies": [{"body": "This is so freaking funny\n\nFirst SAVE, now IROBOT,... wsb never disappoints", "score": 16, "replies": []}]}]}, {"body": "“In at $27” with 40k cost basis.\n\nCurrently trading at $13.94 after hours. GUH. ![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31226) (account deleted one hour later), RIP.", "score": 78, "replies": [{"body": "so he lost 20k? Pretty sure I saw those kinds of losses on wsb every other week during the pandemic", "score": 2, "replies": []}]}, {"body": "Lmao, speed run to u/deleted ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 80, "replies": [{"body": "People that delete their accounts because of their wrong DD are such massive pussies.", "score": 20, "replies": [{"body": "Actually for regards like this the safe choice to ever have money is to delete both their account as well as the portion of the brain in which the memories of WSB are stored. These degenerate gamblers just cannot return for their own good.\n\nImagine having two giant loses in 2 days - SAVE and now this xD (both with \"excelent\" DD of course)", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 9, "replies": []}]}, {"body": "Dude you're a wizard\n\n[https://www.wsj.com/tech/eu-commission-intends-to-block-amazons-irobot-acquisition-268a8a1b](https://www.wsj.com/tech/eu-commission-intends-to-block-amazons-irobot-acquisition-268a8a1b)", "score": 35, "replies": []}, {"body": "iRobot literally scammed him his $40k.. lol.", "score": 25, "replies": []}, {"body": "https://preview.redd.it/urqrq4hyw9dc1.jpeg?width=1080&format=pjpg&auto=webp&s=7df91ee5b7277bd3b9e3edccef489e055ebc9dbb", "score": 19, "replies": []}, {"body": "Account deleted lmao, I love the stock market", "score": 20, "replies": []}, {"body": "WSB hall of fame", "score": 34, "replies": []}, {"body": "Look at the 1000's of Puts bought today that expire tomorrow. Wow someone knew ..", "score": 13, "replies": []}, {"body": "He deleted his account lol", "score": 10, "replies": []}, {"body": "another one for the history of wsb regards (10/10)", "score": 10, "replies": []}, {"body": "It's completely illogical for EU to block this so I should have inversed and bought puts.", "score": 8, "replies": []}, {"body": "Amazon stone walled the EC to get out of the deal. IRBT revenue’s down 33%  yoy.  Unlike Musk with Twtr the Amazonians had a shady but eloquent solution to kill the deal.", "score": 8, "replies": []}, {"body": "Wow, deleted his account. Regard AND a pussy.", "score": 8, "replies": []}, {"body": "are you trying to convince us or yourself", "score": 15, "replies": []}, {"body": "At least he has shares and not options. This is definitely an overreaction. He won’t have to kill himself", "score": 7, "replies": []}, {"body": "The largest porn loss in history", "score": 5, "replies": []}, {"body": "Legally? Since when has any government ever cared about what was legal? Just find out if the bureaucrats at the EU are buying, puts or calls, and then you'll know what they \"legally\" will do.", "score": 19, "replies": []}, {"body": "Whats the FTC point of view on all this", "score": 4, "replies": []}, {"body": "OP deleting his account just like his RH app", "score": 4, "replies": []}, {"body": "the EU reading this: fuck this guy lol blocked", "score": 4, "replies": []}, {"body": "account deleted ![img](emote|t5_2th52|4267)", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 0, "replies": []}]}, {"body": "Is this the sub we should go against the posts? Or was that ~|cc sub?", "score": 3, "replies": []}, {"body": "we gotta put this regard up hall of fame of the month. Eu judge cockblock him 2 time ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "This aged poorly.", "score": 3, "replies": []}, {"body": "what was their user name?", "score": 2, "replies": []}, {"body": "All in 40K but you have 989 shares at 27$ which is just under 27K... bruh can't even do math", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)\n\nThis sub manages to get everything wrong.\n\nIRBT is now trading at 2009 levels.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Deal is Not yet blocked, just notice to block was announced, the decision is on February 14th. Amazon has time to provide clarification on questions by EU investigation. Stock is $17 now and can be back to $50 on February 14th.", "score": 2, "replies": []}, {"body": "Dang, didn't even make it half a day and eu regulators are already saying they're going to shit on your parade", "score": 2, "replies": []}, {"body": "> For example this Act disallows gatekeepers such as Amazon to \"treat services and products offered by the gatekeeper itself more favourably in ranking than similar services or products offered by third parties on the gatekeeper's platform.\" \n\nSo that nullifies example (ii) out of the four examples that the Statement of Objection gives for Amazon foreclosing rivals. What about the other three?", "score": 1, "replies": []}, {"body": "ouch man ![img](emote|t5_2th52|31225)", "score": 1, "replies": []}, {"body": "Any change in your thesis now?", "score": 1, "replies": []}, {"body": "Lol did he delete his account?", "score": 1, "replies": []}, {"body": "If you think governments can’t block whatever they want you’re deluding yourself. The TPP never passed. Corporations are not second to governments.", "score": 1, "replies": []}, {"body": "To enforce Digital Market Act takes time, money and lawsuits that might be stalled in litigation for decades, while the violation meanwhile continues. In addition, the fines rarely, if ever, rise to the whole 10% of global revenue figure.\n\nTherefore, Digital Market Act by itself is not a sufficient safeguard against monopolistic behavior of Amazon, which does have ability to monopolize, and little incentive of not to monopolize. \n\nTherefore, the situation might need the support of European Commission in the form of prohibition of the merger.", "score": 1, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "I'm gonna pass on being a baggy this time but good luck to you brotha!", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "I made a quick k on this in less than 12 hours.  Bought after hours last night around $14, sold for $17", "score": 1, "replies": []}, {"body": "Tell that to Ursula", "score": 1, "replies": []}, {"body": "It looks like the stock is way punished here. If Amazon was to buy at 50., surely there is value in the product and the data that comes from the product — it gets into the home, which is as close as it gets for data marketers. Will be interesting to see how this plays out.", "score": 1, "replies": []}, {"body": "It's a big wetter whether you get in there now or not. \n\nThe share volume is so low that the share can quickly shoot back up towards 50. \nHowever, given the sales trend and the lack of innovation, it could go even lower.\n\nAnd what do you do, no risk no fun or is the risk clearly too high?", "score": 1, "replies": []}]}
