{"title": "Tesla Daily Last Episode", "selftext": "Thank you Rob for all the great coverage over the years.", "id": "198ud0b", "created_utc": 1705490624.0, "score": 234, "upvote_ratio": 0.95, "num_comments": 85, "comments": [{"body": "man that podcast was always a great listen for breakfast here in Germany, definetly level headed news with a realistic take and not only hype\n\nsad to see him go, but all the best for his new ventures", "score": 85, "replies": [{"body": "Yeah, Rob was a part of all our daily routines. Hard to find a level-headed replacement.", "score": 2, "replies": [{"body": "there is none :(\n\nI despise all those hypemen", "score": 5, "replies": []}]}]}, {"body": "We’ll miss you Rob!  Thanks for years of amazing research and content.  Best of luck with First Principles Investing (I think that’s the name?)", "score": 47, "replies": [{"body": "First Principles Group", "score": 16, "replies": [{"body": "I'm sad I don't qualify as an investor. I would if I could.", "score": 9, "replies": [{"body": "same . i was a little dissapointed that after all the talk about retail investing they only take high network investors", "score": 8, "replies": [{"body": "Understandable with all the regulations you’d need to take on especially just starting out.", "score": 3, "replies": []}]}]}]}]}, {"body": "Yeah, while understandable, this fucking sucks. Rob was such an excellent level-headed presenter of Tesla news over the years. He was almost alone in a polarized world of \"ThIS WiLl bRiNg TsLA tO 5T\" and \"TsLA WiLl bAnKwuPt tOmORroW\" over the same piece of news. I think I am much more sad at this point to see Rob go than I would be with Elon leaving.", "score": 116, "replies": [{"body": "Seconded. Thank you Rob!", "score": 8, "replies": []}, {"body": "Elon leaving would destroy Tesla’s pace of future innovation. Elon understands the company better than anyone in the world", "score": 14, "replies": [{"body": "I’d be concerned with the possible diversion of Tesla employees to Musk’s side projects and possibly inconsistent or unwise messaging from him, which can also hinder innovation.", "score": 13, "replies": []}, {"body": "oh c'mon.   Tesla engineering needed to delay, and waste time and energy to convince Elon that the next generation vehicle NEEDS A FUCKING STEERING WHEEL.   FSD isn't ready.  Even if it is, it could be years before it is street legal (government regulations - local, nationally, internationally - are slow to change).  Even if it was, 99.9999% of customers will still want a steering wheel.  \n\nI've been invested a long time - I was probably saying similar things back when the really-not-needed gull wing doors were holding up the Model X release.", "score": 6, "replies": []}, {"body": "I would have been totally onboard with that til give or take 2022. These days - i am not so sure anymore. But that is like just my opinion man.", "score": 35, "replies": [{"body": "Lately I've come around to the concerns people have with Elon's obsession over automation (robotaxi & Optimus) and his constant need to feel like he's in Startup-mode and constantly solving problems.\n\nI was watching Tailosive EV's live stream yesterday, and he put it best: Tesla isn't a startup anymore; it's a stable company with a wide array of useful products.", "score": 11, "replies": [{"body": "Wtf has happened to r/teslainvestorsclub ? This perspective is insane. Tesla has a current P/E of 70x. If you ever want it to grow its valuation it *has to* keep innovating like a startup. If it behaved like a regular old company you should expect the share price to crater by 70-90%.", "score": 13, "replies": [{"body": "If you honestly believe FSD or Optimus is going to do that you are dillusional. How many more years will you put up with zero progress on FSD? Avg DE isn't getting better.", "score": 1, "replies": []}]}, {"body": "Right but they’re still executing on the other stuff extremely well so that’s okay.", "score": 3, "replies": []}]}]}, {"body": "He’s the CEO. He SHOULD understand it better than anyone else. \n\nBut he’s created huge teams of extremely talented people at the company who know what they’re doing.", "score": 7, "replies": [{"body": "It is not just understand it better, he is able to see problems through a multi-disciplinary approach and is able to direct the team quicker to solve the correct problem. Without him, they would spend much more time on dead ends till they finally figure out the solution that Elon would have realized that much sooner.", "score": 0, "replies": []}]}]}]}, {"body": "I wish he switched to 1 episode every 2 weeks, or 1 a month or so. ", "score": 24, "replies": [{"body": "Towards the end it sounds like he’ll actually do something like “one episode every sometimes,” for important events at least.   I’ll fucking take it.", "score": 33, "replies": []}, {"body": "He said he plans to do so to a degree", "score": 8, "replies": []}, {"body": "Tesla weekly?", "score": 6, "replies": [{"body": " i've been toying with the idea of doing a tesla we@kly podcast. one of the many things i have not got around to.", "score": 3, "replies": []}]}]}, {"body": "There’s no one as good as Rob in the Tesla content community", "score": 22, "replies": [{"body": "But but what about Steven mark Ryan /s", "score": 8, "replies": []}]}, {"body": "A great source of information as a Tesla investor lost. However, if he does do consolidated updates every once in a while under his new venture, it'll be okay.", "score": 14, "replies": []}, {"body": "It's totally understandable, but it's also a damn shame. Tesla Daily has been the main way I've kept track of Tesla news for years now. My morning routine won't be the same without it.", "score": 31, "replies": [{"body": "Same. Does anyone have suggestions on alternatives that are level headed, and not just hype fests?", "score": 6, "replies": [{"body": "we need a skunk lab to use AI to build a Rob Meower.", "score": 3, "replies": []}, {"body": "We need to find an alternative! Let me know what you find out. I’ll be checking out the “Now you know” podcast and see if that’s any close to the quality of content Tesla daily provided.", "score": 2, "replies": []}]}, {"body": "Same here, Rob was a daily staple to my routine of keeping up on all things Tesla!", "score": 3, "replies": []}]}, {"body": "I suspect he will still do it, in another format. But yes, it's a loss", "score": 18, "replies": [{"body": "The daily format seems to be a grind.  I'd be happy with a Tesla monthly at this point, and a few impromptu episodes when something big happens", "score": 32, "replies": [{"body": "Exactly.\n\nMaybe he'll miss us and do some kind of \"month in review\" for the big news, as well as earnings days. I don't even care about his nice production - just get on and talk and share screen with your spreadsheet once in a while.", "score": 7, "replies": [{"body": "He said he'll do something like that towards the end of this video, just that he no longer wants to commit to the daily format, understadably so.", "score": 2, "replies": [{"body": "Oh sweet, thanks! I haven't been able to listen to it yet, so I should have held my comment.", "score": 1, "replies": []}]}]}, {"body": "Yeah, tbh I was kinda tired of all this tesla \"news\" that's not really news or moves the markets.\n\nI'm fine with a weekly or monthly recap. More like the ark invest video's.", "score": 6, "replies": [{"body": "Agreed. His coverage of the important news is fantastic, but the fluff stories were starting to take more and more of each episode. Weekly would be perfect imo, or maybe daily cut down to 5-7 minutes, with top line summaries and maybe a daily dive into one or two specific topics. He said he would occasionally pop in for things like earning reports and big news, but I do hope its at least weekly or every two weeks because the important stories he does cover, I value his reporting on them above anyone else I have found.", "score": 3, "replies": []}]}]}]}, {"body": "Rob was my one and only :) What YouTube news source do you recommend? I never found one as good as Rob.", "score": 9, "replies": [{"body": "Same. I can't stand SMR. Many of the better analysts are too rambling and long winded. Concise, balanced, well-informed, and regular coverage of Tesla is insanely hard to find, and it's what made Rob so good. He will be sorely missed but I'm really happy for him to make this transition. \n\nI hope he comes back to share his thoughts with us periodically - like ever few weeks or so. I will still watch everything he produces because his track record is simply unmatched.", "score": 11, "replies": [{"body": "yeah so many of the alternatives are just hype-men.", "score": 7, "replies": []}, {"body": "Oh my god. SMR. Why is he LIKE that? He seems like a smart guy! Why does he insist on the constant unfunny tedious sarcasm in every sentence? Great example of the wasteland of Tesla tubers.", "score": 3, "replies": [{"body": "he is a self admitted autist", "score": 2, "replies": []}]}]}, {"body": "there is no one else. All the others are either grifters or hype people.", "score": 3, "replies": [{"body": "That’s definitely what I’ve found after a year of searching, and trying out whomever I could find. Do you think now X is just the way to go instead of YT? Certainly Rob showed us some tweets with every episode I think. We can follow who he followed for example (most of you surely already do)", "score": 2, "replies": [{"body": "Honestly, I'm pretty wary of people on X as well, same kind of grift. \n\nThe main people I would pay attention to in Rob's absence would be the analysts that Rob has highlighted in the past. Gary Black, Piere some other guy I can't remember. \n\nPersonally for me I am in a hold position, so I'm not following the stock as closely anymore, it's just too rough on my mental health to follow the dips.", "score": 3, "replies": [{"body": "I’m gonna make it a project - rewatch a bunch of his vids and write down some of the sources he cites that I can monitor myself. I know what you mean about the mental health!", "score": 1, "replies": []}]}]}]}, {"body": "Now You Know is my favourite.", "score": 2, "replies": [{"body": "Yeh those guys are among the best. They do ramble on for an hour, but so do most ppl.", "score": 2, "replies": []}, {"body": "How does that compare? Will take a listen", "score": 1, "replies": [{"body": "It's a weekly recap of all major Tesla news, and it's a great one. They also timestamp all stories in description below, so you can watch only stories that you want.", "score": 3, "replies": []}]}]}, {"body": "Electrified by Dillon Loomis is the best for following the daily news. Not so much for financial analysis. \nhttps://youtu.be/IwwXL_qbTv8?si=gKnS_kXIBirShodz", "score": 1, "replies": [{"body": "Yes I’d noticed him. Yes he does a good job of just running down the list of developments instead of rambling on and on like most do. I did think of him as a distant second best for that. I just can’t stand that repetitive intonation that only YouTubers have, with every sentence ending in the same artificial intonation. No one talks like that.", "score": 2, "replies": []}]}]}, {"body": "So where do we get our real Tesla (largely unbiased) news now?", "score": 7, "replies": []}, {"body": "Rob was **the** best source of Tesla information.", "score": 5, "replies": []}, {"body": "Rob was great. I relied on him to distill the headlines into something meaningful (or more often telling me the story was irrelevant altogether). I look forward to whatever he does post in the future.", "score": 6, "replies": []}, {"body": "Just putting it out there. Wouldn't it be better for him to find a team of hosts to take over? The channel has a lot of value and even a share of it would be worth it to let it keep happening.", "score": 5, "replies": [{"body": "Agreed but at the same time I probably spend too much time obsessing over Tesla and we could all use a little bit of time away from Tesla ness", "score": 2, "replies": [{"body": "I didn't watch him every day. Weakly probably would have been better for your reason though.", "score": 1, "replies": []}]}]}, {"body": "Nooooo! 😭😭😭😭\nGreat content, will be missed🥲", "score": 5, "replies": []}, {"body": "First discovered Rob's commentary, probably back around battery day, when we were all trying to pick apart the implications of what was laid out then (something that will be another couple of years till mature). I was not an avid listener for the most part as I found much of this stuff obvious, but it was very appreciated to see someone who was an ambassador for a vision that many of us believed in that to many others was not obvious (not everyone is a geek who spent hours analyzing each tidbit Tesla would reveal). Especially back then the noise the doubters made required voices to say otherwise.\n\nSo thank you Rob for all your dedicated work here! For the times I ever wanted an update you were always the #1 choice. Your ability to see through the noise to understand what matters will serve you well and I wish you best of luck in your new endeavor.", "score": 5, "replies": []}, {"body": "To be part of his new investing group you need to have over 1 million dollars or earn b/w $200,000 and $300,000 for the last 3 years.\n\n> Accredited Investor\nFor an individual to qualify as an accredited investor, one of two conditions must be met:\n\n> The individual must have earned income exceeding $200,000, or $300,000 when combined with a spouse, during each of the previous two full calendar years and a reasonable expectation of the same for the current year. The same method (single or joint) must be applied to the income test in all three years.\n\n> The individual must have a net worth greater than $1 million (alone or with a spouse), excluding the person's primary residence.\n\n> Any entity, if all owners are Accredited Investors", "score": 3, "replies": [{"body": "I can buy TSLA at any income level, I don't see a need to be part of his group.", "score": 4, "replies": [{"body": "SpaceX shares could be a reason.", "score": 2, "replies": [{"body": "Can you elaborate on that?", "score": 1, "replies": [{"body": "Rob has SpaceX shares and began talking more about the company on Tesla Daily the last year or so.  I'd bet his group gets a stake in SpaceX as well so it could be a way for people to get in.", "score": 2, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}]}]}, {"body": "These aren't rules that Rob made up because he wants a few rich buddies. They are from SEC and they have to do with investments in privately-held companies: [https://www.sec.gov/education/capitalraising/building-blocks/accredited-investor](https://www.sec.gov/education/capitalraising/building-blocks/accredited-investor) and don't apply to publicly-traded stocks like TSLA.", "score": 3, "replies": [{"body": "Tell me something I don't know.\n\nWhile you are at it look up the term \"diworsification\"\n\nWhile you are doing that I'll hold my TSLA", "score": 0, "replies": [{"body": "To be fair I think his portfolio is just SpaceX, X, and Redwood Materials", "score": 1, "replies": []}]}]}]}]}, {"body": "I would’ve shed a tear if I wasn’t a sociopath", "score": 3, "replies": []}, {"body": "Thats not good. Now we have to get news from the AG1 shill guy.", "score": 2, "replies": []}, {"body": "Peek Tesla just passed?", "score": 2, "replies": []}, {"body": "its weird but this actually effects my reason to hold tesla shares. the constant commentary on the company was great.", "score": 2, "replies": []}, {"body": "Augh gonna miss this - really looked forward to each episode. But I understand how it could be a slog. We need to train and AI on Rob and let it bring is the news and level headed analysis.", "score": 1, "replies": []}, {"body": "My main concern with this is that it might be a canary in the coal mine. Is it a warning that interest in Tesla is waning?\n\nDoes Tesla need this level of enthusiasm with people producing Tesla podcasts that are sought out by listeners to have massive growth? Or can they have sufficient demand to continue growing without that?\n\nMaybe Tesla/Musk are letting demand stop growing as much because of issues with 4680 holding up the explosive growth plans?", "score": -1, "replies": []}, {"body": "Dude! With Apple Podcasts coming to Tesla I had just started listening to Tesla Daily on a regular basis 😭 As mentioned above, I appreciated how level headed Rob was. I will definitely miss the podcast.", "score": 1, "replies": []}, {"body": "Maybe a sign that Tesla is hiring him for PR 😅", "score": 1, "replies": []}, {"body": "Stock stayed flat for too long, lost interest I guess 😁", "score": -24, "replies": []}]}
