{"title": "How to verify BlackRock really has Bitcoin?", "selftext": "Is there BTC address to verify BlackRock really has Bitcoin and not selling air? Or this is a trustmebro and we should trust them or their auditors that coinbase really store some real Bitcoin for them?", "id": "1940nv7", "created_utc": 1704976389.0, "score": 30, "upvote_ratio": 0.66, "num_comments": 76, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 month ago\n**Total Comments**|4|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "So the largest and most wealthiest wealth management fund in the world is going to risk everything it has built to dupe a small number in comparison to the rest of its investors by pretending to have Bitcoin it does not?\n\nThis is not an FTX or Binance that is exempt from audits by every major agency in the United States, this is a 100% regulated entity, and everything they do has to be legal, albeit grey area legal at times, but still nonetheless legal.\n\nDo I think BlackRock is a shady evil company? You're darn right I do, but pretending they have assets they do not to make a measly 0.25% in management fees is regarded on the highest of levels.", "score": 137, "replies": [{"body": "I think they sold pieces of paper in '06 saying they were diversified real estate assets, no?", "score": 37, "replies": [{"body": "You mean every bank in 2006?", "score": 33, "replies": []}]}, {"body": "There’s a first time for everything.", "score": 7, "replies": []}, {"body": "What?  Black rock regulated?  Per say, they are the regulators, they are the world banks.", "score": 2, "replies": []}, {"body": "Plus, if they did, it would probably only be like 0.03% of their portfolio.", "score": 2, "replies": []}, {"body": "They're not evil dude. They just sell index funds. Black rock introduced proxy voting, so shareholders in indexes get to vote on the votes that black rock casts while owning shares of companies. That's the only real argument for being evil and taking over America🇺🇸 and they are actively trying to give their investors control.", "score": 2, "replies": []}, {"body": "Ok. So it’s trustmebro Bitcoin \n\nBinance has proof of reserves. No need to trust them", "score": -20, "replies": [{"body": "Where is Binance located?", "score": 6, "replies": [{"body": "Here you can check their Bitcoin addresses \n\nhttps://www.binance.com/en/proof-of-reserves#:~:text=What%20is%20Proof%20of%20Reserves,as%20well%20as%20some%20reserves.", "score": -9, "replies": [{"body": "Does this tell you where they are headquartered?", "score": 9, "replies": [{"body": "I dont care. All I want to know, they are not selling paper", "score": -25, "replies": [{"body": "You really live up to your name 🤣", "score": 18, "replies": []}, {"body": "Okay, and good luck.", "score": 5, "replies": []}]}]}]}]}, {"body": "I think question to ask is : \n\nWhat happens if you wake up tomorrow and check Binance's addresses and the bitcoin have been transferred out? What do you think will happen if everyone realizes this and goes to get their money out of Binance exchange?\n\nBlackrock has $9T AUM \\*and\\* you have legal recourse if something goes sideways in terms of custodianship.\n\nAnd finally ask yourself this: If you buy UST, considered the literal safest investment in the world, how do you know USA has the actual money to pay you back on those treasuries?", "score": 5, "replies": []}]}, {"body": "People have done stupider things for less, just saying", "score": -1, "replies": []}, {"body": "Can you cash out BTC ETF shares for BTC directly?", "score": 1, "replies": [{"body": "Afaik yes. And you can also redeem in cash. It really doesn't matter much if redemption is in cash or Bitcoin. If they sell redeemable ETF units without backing them with Bitcoin, it would mean that they are short Bitcoin, which would be a straight up regarded risk just to collect 0.25% management fees.", "score": 3, "replies": []}, {"body": "Not sure.", "score": 1, "replies": []}, {"body": "Lol no.", "score": 1, "replies": []}]}]}, {"body": "I haven't read a single official document, but I trust WSB regards and they state that they will not have their own addresses and they will be bought from Coinbase and have Coinbase also as the custodian.\n\nAbsolute chitshow if you ask me, calls on Coin.", "score": 25, "replies": [{"body": "Sounds like a conspiracy brewing. Seriously.", "score": 9, "replies": [{"body": "I doubt it’s a big illegal fraud when a perfectly legal scam could be just as profitable. All the costs to settle in cash, acquire BTC, and manipulate the price through self-dealing will get passed on to ETF customers. The market makers and ETF managers will do great regardless of what the price of Bitcoin does.", "score": 9, "replies": [{"body": "So you're saying to sell shovels.", "score": 4, "replies": []}, {"body": "yes sir! They will buy low and sell.tomcustomer high for sure", "score": 0, "replies": []}]}]}, {"body": "I’m guarantee their custodial fees are much less than the vig they charge customers when buying BTC directly from Coinbase.", "score": 1, "replies": []}]}, {"body": "You are thinking about it like a crypto moron instead of a Wall Street moron. If an AP can’t redeem their ETF shares for the underlying cash/BTC (depending on regulation) it would be noticed immediately. It doesn’t actually matter if they hold the underlying BTC assuming the SEC gets their way and forces them to settle in cash, because obviously APs will arbitrage any discount between the spot price and ETF price, if the money stops flowing it’s because something much bigger than a single fund’s mismanagement is very wrong at BlackRock.\n\n\nBasically the scam is that you pay a management fee, the extra costs to settle redemptions in cash, and the premium that the fund trades at relative to its NAV.", "score": 7, "replies": [{"body": "ETF is cash settled. Fed can print them unlimited dollars, and no need to buy real BTC, because it will only increase the price. What if they want to suppress the price like gold", "score": -6, "replies": [{"body": "If they had the ability to make the fed print them arbitrary amounts of money at will, they wouldn’t need to do it through a crypto fund. \n\nThe control on them buying the Bitcoin prior to selling it in order to settle the redemption is their custodian. If they just never show up and buy Bitcoin, or report a NAV that doesn’t match the balance in their account with the custodian, the custodian will send in their lawyers immediately with cut and dry evidence of fraud. Again it’s all Wall Street, nothing to do with “verifying on the blockchain” as much as you want that to be the control.", "score": 4, "replies": []}, {"body": "Very regarded. You belong here because none of that is true.\n\nGold is suppressed because its a fucking stupid investment that hasn't even kept up with inflation over the last decade. \n\n11% of gold is used for utility and the other 89% is literally just a much, much shittier version of Bitcoin, socially accepted by the masses to be a store of value due to it's scarcity, even though come April bitcoin will be more scarce.", "score": 1, "replies": [{"body": ">  11% of gold is used for utility and the other 89% is literally just a much, much shittier version of Bitcoin\n\n\nAs opposed to Bitcoin, 0% of which is used for utility and 100% is literally a much, much shittier version of bank money transfers. ", "score": 1, "replies": [{"body": "If you believe that, then stay on the sidelines, kiddo \n\nStick to VOO and ignore the most appreciating asset in the last 15 years", "score": 1, "replies": []}]}]}]}]}, {"body": "Aren’t they holding their BTC on Coinbase? That was the irony- SEC suing Coinbase while many of the ETFs are using Coinbase to hold their bitcoin.", "score": 3, "replies": []}, {"body": "I’m going to start a beanie baby ETF", "score": 5, "replies": [{"body": "Anybody down for a yugioh etf?", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|33495)", "score": 1, "replies": []}]}, {"body": "If it's a problem to you then you're not the target of btc etf. Buy yourself", "score": 2, "replies": []}, {"body": "This is not some unregulated CEX lol\n\nIts a spot ETF, they will need to back it with the underlying asset. And they will.", "score": 2, "replies": [{"body": "In bankers we trust (not)", "score": 0, "replies": [{"body": "I've been long Bitcoin for years. All in a cold wallet.", "score": 0, "replies": [{"body": "Will be fun when you lose your cold wallet one day with no recovery means", "score": 0, "replies": [{"body": "Yeah so, let me explain this to you so you don't go saying regarded shit like this in public. We'll keep your dignity in tact for you...\n\nYou could lose it 50x and nothing would happen\n\nYou could drop it in the toilet, run it over with a tank, throw into a fire, off a cliff, and still recover the Bitcoin easily every time.\n\nYour asset is on the blockchain. A wallet just gives you access to it. Any wallet will do. Just buy another, plug in your seed phrase and presto, your assets are right there waiting for you.", "score": 2, "replies": []}]}]}]}]}, {"body": "Who cares if they really have coins stored? If blackrock cant pay you out, shit is so bad that you wont have electricity in a few hours. Good luck with your coins.", "score": 4, "replies": []}, {"body": "This guy on WSB asking about things like “custodianship”… he’s probably not even brain damaged.", "score": 2, "replies": []}, {"body": "Found on net...\n\nBlackRock received $100K seed funds in October 2023 from an unknown investor for its spot Bitcoin ETF \\[ETP-exchange-traded product\\] -- SEC filing\n\nThe SEC filing revealed that the investor agreed to purchase 4,000 shares for $100,000 USD on October 12, 2023, at $25.00 per share, with the investor \"acting as a statutory underwriter with respect to the Seed Creation Baskets.\"\n\nHow to verify BlackRock really has Bitcoin?\n\nBlackRock has ZERO \\[0\\] Bitcoin\n\nE&OE/CYA", "score": 2, "replies": []}, {"body": "Welp, the eroded trust in auditors is really concerning.", "score": 1, "replies": [{"body": "In all my audits they just trust the data that I give them.  A big joke as far as I can tell.", "score": 5, "replies": [{"body": "If you feed the auditor false information, that's on you.", "score": 1, "replies": [{"body": "Then what’s the point of an audit ?", "score": 1, "replies": []}]}]}]}, {"body": "Take a step back and realize it wouldn't matter. Not your key, not your coin.", "score": 1, "replies": []}, {"body": "The fines they would get from the SEC are nothing from the profits they will get from investors. They will always break the law , and they will always profit from it no matter what. This will be no different.", "score": 1, "replies": []}, {"body": "In BlackRock we trust ![img](emote|t5_2th52|4271)", "score": 0, "replies": []}, {"body": "If they are so big, why can’t they give proof of reserves?", "score": 0, "replies": []}, {"body": "If all the 11 etfs started buying BTC yesterday after approval. Shouldn’t that have triggered BTC price jump?", "score": 0, "replies": []}, {"body": "I hate to say it, but they don't.", "score": -2, "replies": [{"body": "So it’s totally paper?", "score": 1, "replies": [{"body": "Yes. ETF is tracking the price of Bitcoin. They need to hedge the trades, but not necessarily with Bitcoin. Without hedges they would take too large risk. They are just earning the fees with the spread. Think of papers with oil or gold as underlying value. Institutions issuing these papers does not own any gold or oil.", "score": -2, "replies": []}]}, {"body": "they hold 227.9 bitcoins in the etf.. you could read from their portfolio", "score": 1, "replies": [{"body": "Ok wallet adress?", "score": 0, "replies": []}, {"body": "How much did the Blackrock ETF trade for first day?", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "ETF is totally not Bitcoin\n- it’s derivative", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There is no arbitrage. Arbitrage is possible if you can withdraw cheap Bitcoin and sell it higher in another place, then repeat. But ETF is cash only\n\n\nLike if etf Bitcoin is 40k and binance is 42k, you can’t make arbitrage. You can only withdraw 40k in usd not in BTC", "score": 1, "replies": []}]}]}, {"body": "Do you really think that Satoshi had no idea that ETFs existed, or that during the process of bitcoin being adopted by the world that countries would try and capitalize on it? Get real.", "score": -1, "replies": []}]}, {"body": "Buy 1 share of Blackrock.\nAttend AGM and raise the question as shareholder.\nReport back to us.\nThanks!", "score": 1, "replies": []}, {"body": "ask Gerry … he has to answer to them as well. lol", "score": 1, "replies": []}, {"body": "Pretending they have assets they do not…. Like the who MBS scandal/housing collapse? Yea, no body does that, not even black rock, especially for millions in fees.", "score": 1, "replies": []}, {"body": "Btc is air brother", "score": 1, "replies": []}, {"body": "I'm no genius, but if you sell shares in the ETF, you can't demand the bitcoins, just like if you sell shares of the Gold ETF, you can't demand physical gold.   So really, it doesn't matter how many they have as long as they have enough cash to allow sellers to cash out when they sell the ETF.", "score": 1, "replies": []}, {"body": "Unless you are worried about counter party risk who cares?", "score": 1, "replies": []}, {"body": "I don’t know. I don’t care because if they own or do not own it does not change how I will operate.", "score": 1, "replies": []}]}
