{"title": "Microsoft lays off 1,900 Activision Blizzard and Xbox employees", "selftext": "Microsoft is laying off 1,900 employees at Activision Blizzard and Xbox this week. While Microsoft is primarily laying off roles at Activision Blizzard, some Xbox and ZeniMax employees will also be impacted by the cuts.\n\nThe cuts work out to roughly 8 percent of the overall Microsoft Gaming division that stands at around 22,000 employees in total. \n\nAlongside the layoffs, Blizzard president Mike Ybarra has decided to leave the company. “As many of you know, Mike previously spent more than 20 years at Microsoft. Now that he has seen the acquisition through as Blizzard’s president, he has decided to leave the company,” says Microsoft’s game content and studios president, Matt Booty, in an internal memo.\n\nhttps://www.theverge.com/2024/1/25/24049050/microsoft-activision-blizzard-layoffs", "id": "19fdsei", "created_utc": 1706201503.0, "score": 394, "upvote_ratio": 0.96, "num_comments": 77, "comments": [{"body": "How the hell did a guy named Matt Booty make it so high up in Microsoft?", "score": 287, "replies": [{"body": "Selling booty to make it to the top", "score": 77, "replies": [{"body": "Matt booty got topped", "score": 10, "replies": [{"body": "Sloppy toppy", "score": 1, "replies": [{"body": "Pussy, Booty, I don’t know his last name!", "score": 3, "replies": []}]}]}, {"body": "He came looking for booty.", "score": 2, "replies": [{"body": "Swiggity swooty", "score": 5, "replies": []}]}]}, {"body": "Fun fact - email addresses at Microsoft are the first two letters of your first name plus your surname.", "score": 14, "replies": [{"body": "Mabooty!", "score": 16, "replies": [{"body": "And this is not Booty’s alias", "score": 2, "replies": []}]}, {"body": "Wrong", "score": 1, "replies": []}]}, {"body": "unrelated, but i know a guy from college whose name is Michael Hunt that became a gynecologist \n\nhe used to go by \"Mike,\" but now exclusively goes by \"Michael\"", "score": 11, "replies": [{"body": "I used to play a game called Duck Hunt.", "score": 4, "replies": []}, {"body": "something something normative determinism", "score": 2, "replies": []}, {"body": "Dr M. Hunt.  Are you by chance, M--\n\n*NO!!*", "score": 3, "replies": []}]}, {"body": "And why didn’t his parents name him Max?", "score": 2, "replies": []}, {"body": "What they didn't tell you is that was a nickname before the name change.", "score": 2, "replies": []}, {"body": "… the CEO of Nintendo, North America’s last name is Bowser…", "score": 2, "replies": []}, {"body": "He shines other booty so his remains matt. He attached his lips to a high flyers arse and rode it all the way to the top. If other people kissed his arse his name would be Shiny Booty.", "score": 1, "replies": []}, {"body": "They legit didn’t fire somebody when they suggested word comments needed a like button. I am never surprised by decisions that make no sense at Microsoft.", "score": -1, "replies": []}]}, {"body": "I hope the full Diablo team is gone.", "score": 143, "replies": [{"body": "I hope the WoW team gets replaced.", "score": 32, "replies": [{"body": "So is the SC2 team just gone now?", "score": 7, "replies": [{"body": "I think the starcraft 2 team has been gone since after the heart of the swarm,", "score": 11, "replies": []}, {"body": "They been gone, edit: they made more money on a mount in the cash shop than they did on sales if that game.", "score": 4, "replies": []}]}, {"body": "Why? WoW is in a really good spot right now. Both retail and classic.", "score": 3, "replies": [{"body": "Bots forever", "score": 2, "replies": []}, {"body": "Maybe compared to a year ago.. compared to a decade ago? Hot garbage.", "score": -1, "replies": [{"body": "A decade ago was WOD which sucked balls.", "score": 4, "replies": []}]}]}]}, {"body": "Overwatch2 too", "score": 2, "replies": []}]}, {"body": "Hope they lay off everyone that developed wz 2&3", "score": 44, "replies": [{"body": "Wait what. There's a 3?", "score": 6, "replies": [{"body": "He’s probably counting Blackout as 1", "score": 1, "replies": []}]}]}, {"body": "And Microsoft is worth more than $3 trillion…", "score": 3, "replies": [{"body": "And they didn’t become so by keeping irrelevant employees who didn’t contribute", "score": 1, "replies": []}]}, {"body": "Jesus. While this is good for me personally as a shareholder, I hope those guys get a good severance package at least. It's crazy that the world's biggest company is just like yeah, we wanna make even more money and you guys are getting in the way. But I guess efficiency is why they've got to where they are...", "score": 50, "replies": [{"body": "This was coming from a mile away. Reducing redundancies after an acquisition is extremely common, and that's what this is. The ATVI deal closed late last year.", "score": 82, "replies": [{"body": "Not redundancies, they axed an entire Blizzard game.", "score": 3, "replies": []}, {"body": "Not entirely. They cancelled at least one project (survival game) and fired most/all of its team.\n\nRedundancies are definitely not the only people getting cut. The last calendar year has been brutal for gaming in general. Lots of companies, including ones who were not recently acquired, have been doing big layoff rounds.\n\nToo much COVID hiring is the main problem.\n\nSource: I am in the industry.", "score": 6, "replies": []}]}, {"body": "So what do want Microsoft to do? Just pay people a salary when they aren’t needed anymore? Pay two or three people to do the same job? Pay them Salary and not work?", "score": 59, "replies": [{"body": "I guess not. But if I was one of those guys getting let go I probably would think so, yeah.", "score": 18, "replies": []}]}, {"body": "Rotating your bottom 8-10% is entirely normal and healthy. Ideally these 8% will leverage their Microsoft creds to get a nice pay bump at another company. In a month or two Microsoft will start a hiring round, so new people will have that opportunity to work at MS. \n\nAlso, generally when you dig a little deeper, a lot of times the layoffs are really just hiring freezes for a significant portion of that percentage.", "score": 13, "replies": [{"body": "The fittest and strongest will survive. They are using nature as a blueprint.", "score": 2, "replies": []}]}, {"body": "You’re in a stocks subreddit complaining about companies making a decision that benefits them? I don’t get it.", "score": 6, "replies": [{"body": "I'm not complaining. Just being empathetic.", "score": 3, "replies": []}]}, {"body": "How is that crazy in any way whatsoever?  It’s so normal that it didn’t even elicit a response from me when I read the headline.", "score": 11, "replies": [{"body": "If it was your job you might think differently. As investors it's easy to just focus on the numbers and forget the humanity and the livelihoods. The employees are the ones that make the company what it is. Some of them will be coasters but many won't see this as fair and normal. Especially when the business is in the best position it has ever been in.", "score": 23, "replies": [{"body": "You can choose not to invest in a company if what they do doesn’t align with your morals. Otherwise you’re just talking out of both sides of your mouth. You want to make money and feel good without the guilt…even greedier of you", "score": 10, "replies": [{"body": "Microsoft is one of my biggest positions", "score": -6, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm not a gamer just a fellow worker", "score": 1, "replies": []}]}, {"body": "Most people don’t want to get fired, but that doesn’t make it crazy.  Downsizing, layoffs, firings, these happen all the time in every industry.  Some industries become obsolete and those jobs disappear.  I’ve been laid off before, is what it is.  It is the nature of society.  Stay hirable.  Companies bloat, objectives change making other departments and tasks unnecessary, new management has new visions or analysis, etc.\n\nActing like companies should be obligated to keep employees just because they were hired once is something for government jobs and communism.  That’s especially true of mergers and acquisitions.", "score": 5, "replies": []}, {"body": "Exactly. We can’t get too into the numbers. Especially because we’re barely investors… we’re just regular guys working normal jobs putting some of our money into the stock market…", "score": 1, "replies": []}]}]}, {"body": "I don't know what is next, but Microsoft really needed to clean house at Activision Blizzard. They were rotten to the core, and desperately in need of a change. Hopefully this is just a reset button so that they can turn these companies around.", "score": 0, "replies": []}]}, {"body": "Gaming industry is on its last leg. XBOX is a shadow of its former self, Sony has no competition and the games are average at best, and micro transactions have ruined pretty much every game. It's jus not fun anymore. I see more people going back to older games Han playing anything new.", "score": 3, "replies": []}, {"body": "Hearing the survival game is cancelled sucks - was looking forward to that ", "score": 5, "replies": []}, {"body": "I was waiting for this,this is why more tech workers need to unionize. This is normal for a merger though.", "score": 4, "replies": []}, {"body": "At least they waited until the holidays were over.", "score": 2, "replies": []}, {"body": "Meanwhile they are sending Ballmer $1billion in dividends for sitting on his ass.", "score": 2, "replies": []}, {"body": "Question: how many workers did microsoft acquire?? Sounds like they fired everyone and just wanted the ip", "score": 3, "replies": []}, {"body": "Bullish AF.", "score": 10, "replies": []}, {"body": "I hope Gen Z eventually take over and put worker protections in place for things like this. Despite looking to shareholders like this might be a great short term profitability boost, shit like this is toxic to company culture and employee morale, and in the long term it harms their ability to find talent and make quality products. ", "score": 2, "replies": [{"body": "Silly to think they will do anything.  They just like everyone else will follow the money.", "score": 2, "replies": []}]}, {"body": "Everybody knew that they will only destroy Blizzard after acquisition.", "score": 0, "replies": [{"body": "The blizzard that made 'Overwatch 2', can't make a game better than Diablo 2 twenty years later, and abandoned Starcraft?  That blizzard?", "score": 2, "replies": [{"body": "Actually not that Blizzard since it has already fully ship of Theseus'ed since then.", "score": 1, "replies": []}]}]}, {"body": "MSFT will drop below $370 before December 2024", "score": -4, "replies": [{"body": "Yeah probably. That’s less than a 10% drop. It will also likely finish 2024 higher that $404", "score": 15, "replies": []}]}, {"body": "Wow that was quick, even by Microsoft's standards.\n\nWell, at least I got mine as an Activision shareholder 🤷‍♂️", "score": -3, "replies": []}, {"body": "Hopefully it’s the people who make the decisions not rank n file developers", "score": -7, "replies": [{"body": "Usually it is middle to upper management that get the axe after a merger/acquisition, specially in HR, It and finances.", "score": 12, "replies": [{"body": "You can simplify it by saying support services. Everyone in HR, recruiting, finance/accounting, data analytics, etc. are potentially on the chopping block. ", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Yet no company has made a first person shooter that sells on that level in 15+ years now. Also, they mostly bought it for the mobile money printer called Candy Crush.", "score": 2, "replies": []}]}, {"body": " So long as not Bethesda. We need them to work on Skyrim.", "score": 1, "replies": []}]}
{"title": "What to put money in when betting on a long-term (1 year+) market downturn?", "selftext": "[deleted]", "id": "19fkzsf", "created_utc": 1706219935.0, "score": 34, "upvote_ratio": 0.75, "num_comments": 81, "comments": [{"body": "High yield savings account if you want it liquid and ready to invest or a CD if you want to set it and forget it.", "score": 33, "replies": []}, {"body": "You can lock in a no penalty cd for like 13 months at 4.6% right now. Obviously need to do it before they start cutting rates.", "score": 31, "replies": [{"body": "When will they cut rates tho?\n\nI mean we have a exceptional low rates in the past. I feel like we could be close to the average now.", "score": 11, "replies": [{"body": "the entire \"risk\" of CDs in a bad market is that rates might keep going up lol", "score": 3, "replies": [{"body": "Yes, but if rates start going up, the stock market is going down. Not only that, this is a no penalty cd, so you can withdraw your funds any time penalty free. If rates go up, you simple close the cd and reinvest.", "score": 1, "replies": [{"body": "Man you really think if rates go up, and the rich get even more than the 1 trillion dollars in interest rate payments that they are already getting each year, that the markets gonna crash?", "score": 1, "replies": [{"body": "I didn’t day crash. I said going down, big difference. Have you even been paying attention to the stock market the last few months. The entire rally has been predicated on rates coming down. Why do you think the stock market declined 25% right when they started raising rates two years ago. \n\nBruh, do you have any idea how the stock market and money flows work? If you can get above 5% risk free return, why would you put your money in stocks that historically generate 8% at a time when any increase in rates increase the risk of a recession. Ever heard of TINA: there is no alternative? This was the term for the need to put money in the stock market during the COVID pandemic when rates were at all time lows because there literally was nowhere else to put it. You couldn’t generate anything at all on bonds, so everyone put their money in stocks, and of course stocks went on a speculative tear. \n\nNot only that, the higher rates go, the more restrictive policy is and more likely it is to cause a recession and that risk gets priced into stocks through lower PEs and stock prices. I don’t really think you understand how this works", "score": 1, "replies": []}]}]}, {"body": "Oh I didn't know that.\n\nI thought whenever it went up the CD's might pay better since it's cheaper to lend from you.\n\nIs this wrong?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "if you're buying CDs during a bull run, it makes sense that you think the federal reserve controls the economy with one number.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[The Fed lowered rates BEFORE the 2008 subprime mortgage crisis](https://abcnews.go.com/US/delicate-balance-banking-crisis-fight-inflation/story?id=97984223) They are a Boogeyman. Jerome Powell isn't rubbing his (((hands))) together trying to individually steal your money.", "score": 1, "replies": []}]}]}]}]}, {"body": "Futures have priced in 7 rate cuts this year, that’s a little over the top but there’s probably gonna be rate cuts within the next few fed meetings\n\nEdit: 1 year treasury yield minus fed funds is -0.37% (1-2 cuts), fed futures is more like 5-6 cuts, it’s changed since I looked at it last", "score": -5, "replies": [{"body": "Bonds are currently pricing in 5 cuts total this year", "score": 1, "replies": [{"body": "The difference in yield between the 1 year treasury & fed funds is -0.37%, that’s priced for about 1-2 rate cuts over a year. Futures have priced in 5-6", "score": 1, "replies": []}]}]}, {"body": "The Fed has hinted at multiple rate cuts in 2024.", "score": 0, "replies": []}, {"body": "You can literally see the odds of a rate cut at future meetings that fluctuate daily. Once it becomes probable, that's when you want to lock in your rates.\n\nThere's almost no chance they won't cut rates by June at the latest unless there's some big unexpected surge in inflation. If the economy starts to stumble then rates could be cut sooner.", "score": 1, "replies": [{"body": "When I look at [fed rate since 1955](https://fred.stlouisfed.org/series/FEDFUNDS) I see that the rate we had between 2008-2021 has been exceptional low.\n\nI am no expert I just see that about 4-6% is the average. Can that average continue or are we heading towards a low-rate environment as we had these past  two decades?", "score": 0, "replies": [{"body": "I’m the short to medium term, the overwhelming consensus is rates will be lower. At 5% the feds policy is restrictive (meaning they are actively creating a drag on the economy) and as inflation comes down it becomes even more restrictive in real terms. Just to keep the same relative rate of contraction on the economy they have to cut rates. This is why unless inflation comes back they are done raising rates and actually can’t keep rates unchanged unless they want to make policy more restrictive, which they don’t.", "score": 1, "replies": []}]}]}]}]}, {"body": "Buy the dip", "score": 10, "replies": []}, {"body": "We had a one year slump in 2022", "score": 21, "replies": [{"body": "I love how this is forgotten. 2022 was the correction. We are now in a bull market 📈", "score": 15, "replies": [{"body": "Reality is, is we're still in the same tech stock led secular bull market from 2009. It didn't end in 2022, it just got pushed to the limit.\n\n\nThere will be one day where it ends, but I do suspect it's probably more likely towards the end of the decade or past it.", "score": 8, "replies": [{"body": "It’ll end once there’s nothing new left for tech to successfully push. For now, we’re only seeing the start of AI.", "score": 4, "replies": []}]}]}]}, {"body": "Bear ETFs will short for you and take the risk. Most are leveraged though so you just have to be familiar with that and comfortable with the possible loss from reverse splits. Unless you think there will be a market crash though idk what you'd be too worried about. The last downturn ended up being a great buying opportunity in a relatively short period of time.", "score": 7, "replies": [{"body": ">possible loss from reverse splits.\n\nGot a link that explains?", "score": 1, "replies": [{"body": "https://www.investopedia.com/terms/r/reversesplit.asp#:~:text=A%20reverse%20stock%20split%20consolidates,(only%20its%20stock%20price).\n\nReverse splits.\n\nhttps://www.proshares.com/browse-all-insights?series=Portfolio+Hedging+Series\n\nLeveraged ETFs.", "score": 2, "replies": [{"body": "I misread, I thought you meant that a rev. split = loss, not possible loss.", "score": 2, "replies": []}]}]}]}, {"body": "High yield bond or guaranteed return investment product.", "score": 14, "replies": [{"body": "Hugh yield bonds tend to correlate with the stock market. So probably not the best bet if stocks take a dive like the OP is concerned about.", "score": 0, "replies": [{"body": "Down vote me all you want. Just check your research on high yield bonds.", "score": 1, "replies": []}]}]}, {"body": "If you think a 1-year slump is “long term” don’t do stocks.", "score": 13, "replies": []}, {"body": "TLT is good imo for what your trying. Has a 4% or so yield and if your betting on a recession like I am it can be a good bet on interest rates decreasing which I think they will. Otherwise farther out KRE puts are good to bet on continuing regional bank struggles", "score": 4, "replies": []}, {"body": "There are a lot of creative ways to hedge against-, or bet on downturns. \n\nExamples: \n\nCollar on a stock, sector ETF, or index fund. Sell covered calls + buy puts. This defines your range of outcomes, and allows you to do things like sell to close on the puts so that you can make money without giving up your shares. That would make sense if you expected a downturn to be followed by a period where the shares would be back up in value. \n\nSpread bets. Long S&P 500, puts on Qs, as an example. This bet is basically that the S&P 500 outperforms the Qs whether they go up or down. \n\nHaving said all of this… if you do not understand the risks, and how you win or lose mechanically, DON’T PUT THE POSITION ON.", "score": 2, "replies": []}, {"body": "Utilities, telecoms, insurance companies, consumer staples, fast food chains, and sometimes banks tend to be the best investments during recessions. Maybe oil and gas as well. Avoid real estate (while rates are high) and companies with high ticket items that often require financing options like cars, washing machines, home improvement, solar energy systems, infrastructure/construction related companies, most small caps, etc.\n\nStill think it would be worthwhile staying invested in the Mag 7 though. Their brands are really strong and a lot of their products and services are basically considered essential. The market often trends downwards months or even a year+ before a recession hits and this is related to the yield curve and interest rates so it's not always simple figuring out where to make adjustments to your portfolio.", "score": 2, "replies": []}, {"body": "SQQQ", "score": 2, "replies": []}, {"body": "If that's your opinion you could go SPXU or SPXS. Both are 3x inverse leveraged S&P500 ETF's.", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "How long can I hold? I started a small position 1 week ago and was going to average down if needed", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Ohh great explanation. Great appreciate this , thank you . I didn’t put too much money yet. Was going to put a bit every time until I’m up 5% and then repeat. Market is pretty hot right now", "score": 1, "replies": []}]}]}]}]}, {"body": "Time in market > timing the market", "score": 4, "replies": []}, {"body": "Sqqq", "score": 2, "replies": [{"body": "SPXS too", "score": 1, "replies": []}]}, {"body": "1 year is not long term in the investing world.\n\nLong term is minimum 7 years.\n\nAnd unless you expect the US to become 1990 Japan. We will not have a long downturn.", "score": 3, "replies": []}, {"body": "real assets like real estate, guns and gold ,   (things you stockpile)  when the civilization ends the gold will work for a while and then the guns.", "score": 1, "replies": []}, {"body": "If you don’t know how to invest in your outlook, you’re probably not educated enough to formulate your own outlook. Ask this question in r/burryology", "score": 1, "replies": []}, {"body": "I have had a bunch of money in vanguard's market neutral fund.  It has an equal weighting in long and short positions - actively managed.  Great returns for the past 3 years....double digits every year regardless of what the market does. ...  only problem is the gargantuan cap gains distribution at end of last year.", "score": 1, "replies": []}, {"body": "!RemindMe 1 year, this way I can ask you if you learned the lesson we all had to learn. You’ll be back here in a year as part of the “don’t try to time the market” and “the market can stay irrational longer than you can stay solvent crew”. Oh wait, you already mentioned that one, there is no hope.", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2025-01-26 12:25:25 UTC**](http://www.wolframalpha.com/input/?i=2025-01-26%2012:25:25%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/19fkzsf/what_to_put_money_in_when_betting_on_a_longterm_1/kjnc7hf/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F19fkzsf%2Fwhat_to_put_money_in_when_betting_on_a_longterm_1%2Fkjnc7hf%2F%5D%0A%0ARemindMe%21%202025-01-26%2012%3A25%3A25%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2019fkzsf)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "I have a serious question.  Is it ever too late to get into a stock that does nothing but go up?  Even if the price is ridiculous.", "score": 0, "replies": [{"body": "You answered your own question. Price being ridiculous is an opinion. Even if you buy in at $600 a share, if the stock does nothing but go up as you state, then theoretically that stock will eventually hit 2k. 1 share would net 1400 profit if you would have jumped in at that “ridiculous” price. It would seem a lot more ridiculous when it’s 2k and you thought about where you could have been in at.", "score": 2, "replies": [{"body": "> It would seem a lot more ridiculous when it’s 2k and you thought about where you could have been in at.\n\nThat's the thing for a lot of people - we're \\_at\\_ the 2k mark right now and it feels ridiculous to buy in to a lot of things", "score": 1, "replies": [{"body": "Again, opinionated. I’m not telling him or anyone to buy in. We are breaking ATH for a few weeks now and at some point it’s going to come back down slightly. I feel the same way as you, everything seems expensive - but that’s my opinion. Market could just keep going up, or it could drop Monday. Only time will tell if it was smart to buy in now, or later. If you are playing long game, you shouldn’t really worry about current prices & just DCA the dips cause *theoretically* the stocks will be much more valuable in 10 years. I’m just answering OP when he says “the stock does nothing but go up”. I’ve ever met a stock like that but if that’s the case for him, it shouldn’t matter buying today, because tomorrow will be higher.", "score": 1, "replies": []}]}]}]}, {"body": "Look for something that gives a good return even in today’s market that also offers security of the deposit.\n\nCD. Discover bank has 5% 12 month. Also check your local credit unions.", "score": 0, "replies": [{"body": "A one year t_bill pays better than that. Treasurydirect.gov", "score": 2, "replies": []}]}, {"body": "the prices of stocks keep going up because the federal reserve keeps printing funny money.  So when we get the next market tank whats the response gonna be?  Print a bunch more money probably to the tune of 10-15T.  So the dollar price on the stock market will likely recover and keep on trucking.  What you need to be worried about is counter party risk.  You already identified there is likely going to be a downturn.  Banks are susceptible because they are leveraged out there ass the greedy fucks.  You go and drop all your cash on a 1yr CD, you gotta hope the fuckin bank doesnt go bust.  I can guarantee you you’re fucked with a cd in a bank thats failed.  So whats the one place that has virtually no counterparty risk?  US treasuries.  They control the dang currency.  Before they go bust, they just call up the fed and have another fat T cooked up.  Problem solved and you get your cash back, plus interest, at maturity.  Minus their capital gains cut the greedy bastards.", "score": 0, "replies": []}, {"body": "gold is always a safe bet, also bitcoin? I mean it will be on the rise if stoxk market is down for so long.", "score": -6, "replies": []}, {"body": "Faz", "score": 1, "replies": []}, {"body": "$URNM long is best hedge", "score": 1, "replies": [{"body": "Up nicely on URNM but suggest you put in a protective covered put as it's been facing pricing pressure as CCJ Cameco has a 101 PE and UEC is at nearly a 778 price to earnings multiple. One bad news story URNM goes nuclear!", "score": 2, "replies": [{"body": "Agreed. I took profit. On house money now", "score": 2, "replies": []}]}]}, {"body": "Put options is an easy way to hedge such a bet with less capitol", "score": 1, "replies": []}, {"body": "You could sell covered calls on your shares is you have enough.", "score": 1, "replies": []}, {"body": "BMO has a 1year CD topping 5.25% and Everbank 9 month CD not far behind on full balances not teaser 🐂 ...\n\nThinking flight to safe harbor may make sense before Tesla, Boeing and rest of the transportation industry sink the market but who honestly knows these crazy times.", "score": 1, "replies": []}, {"body": "Buy something like BUFR. Hold. It uses options to prevent downside while preserving most of the upside\n\nAnd stop trying to time the market, much less pull a big short. Especially based on a reason that seems so very logical to you. Market has a way of giving no fucks", "score": 1, "replies": []}, {"body": "Bear Call Spread- limited risk, benefits from theta decay, can be profitable even if market goes up.", "score": 1, "replies": []}, {"body": "It’s always best to remember “ the market can remain irrational much longer than you can remain solvent” being an election year of course there will be rate cuts and other efforts to stimulate the economy. But you can’t hide the fact company earnings are trending lower and lower. Your long term market downturn started last year for many companies. We’re already in a recession the Government just hasn’t called it yet. That being said I’m in gold and uranium plays.", "score": 1, "replies": []}, {"body": "Buying treasuries would be my play.", "score": 1, "replies": []}, {"body": "you can buy an inverse etf", "score": 1, "replies": []}, {"body": "Inverse index fund ticker SH  It will do the opposite off the s&p. or if your really sure SDS,  it will do double the opposite of the s&p.  Or if you are really really sure SPXU.  It is a triple inverse.  You can also buy all those on margin and increase your losses when your wrong", "score": 1, "replies": []}, {"body": "Just buy BRK.B and be happy", "score": 1, "replies": []}, {"body": "PayPal.", "score": 1, "replies": [{"body": "PayPal what? Long? Short? Calls? Puts?", "score": 1, "replies": []}]}, {"body": "Short coin", "score": 1, "replies": []}, {"body": "buy 6 month tbills", "score": 1, "replies": []}]}
