{"title": "$AMD gonna pop after Lunch", "selftext": "Here's the most recent SMAs for AMD today. TA patterns show that if the 25 SMA just breezes by the 50 SMA (and doesn't cross) AMD is in for gains on the day. This is further supported by the fact that the 100 SMA is moving to it's place ABOVE the 200 SMA.\n\n[Buy in now boys before lunch is over!!](http://imgur.com/a/ABvFv)\n\nThe lines in the picture are as follows over a 3 day period:\n\n-Teal: 25 SMA\n\n-Green: 50 SMA\n\n-Orange: 100 SMA\n\n-Blue: 200 SMA\n\n-Purple: 300 SMA\n\nDisclaimer: TA is mostly bullshit (especially mine) and never right, but you should buy $AMD anyway.\n\nEDIT: This is great. Taking a second look a \"pop\" really wasn't in order, but that's the pattern AMD followed the last couple times the 25 SMA grazed the 50 SMA as it did this morning.\n\nIf anything it's consolidating as the 100 SMA moves into position above the 200 and 300. The end of the week should be interesting.\n\nEdit:\n\nI'd like to point out the interesting sentiment of this board. So before my prediction was wrong, this post was upvoted to like 20+, as soon as it was wrong, the downvotes flow in.\n\nThat's hilarious.", "id": "505jd1", "created_utc": 1472484281.0, "score": 18, "upvote_ratio": 0.66, "num_comments": 63, "comments": [{"body": "[deleted]", "score": 57, "replies": [{"body": "It's a slow pop, like the titanic.", "score": 15, "replies": []}, {"body": "A pop wasn't really in order, looking back, but it's definitely consolidation movement.\n\nLike I said in my edit, end of the week should be interesting.\n\n", "score": -20, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "Like it even matters we're all balls deep in AMD anyway", "score": 2, "replies": []}]}, {"body": "Spoken like a true ta fag.  Go look up confirmation bias.  Fucking homo.  Thanks for giving the rest of the market your money", "score": 2, "replies": [{"body": "Who said I bought in?\n\nI already had positions, it was just TA.\n\nGood try though, proud of you.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol I have positions in AMD and I never made a claim to make a play on the TA I did post, which doesn't break the rules.\n\nCan we ban this fuck face for blabbering like a phaggot?\n\nSee I can request bans too. Am I cool now? Tool....", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Nice disclaimer. Looks like TA is bullshit once again.\n\nNext time try reading tea leaves. It will be as effective.", "score": 16, "replies": [{"body": "You're not wrong.\n\nPublic sentiment is such a driving factor in this market it's silly.", "score": -8, "replies": [{"body": "What the fuck does that even mean. \"What people think about the market is throwing off my pretty drawings.\"\n\nPut down the TA before you hurt yourself. Its the homeopathy of investing. ", "score": 10, "replies": [{"body": "> It's the homeopathy of investing\n\nTagged as \"retarded\"\n\nYou're welcome.", "score": -14, "replies": [{"body": "Thanks! Your disapproval means a lot to me.\n\nGood thing you have all those charts to be your friends.", "score": 4, "replies": [{"body": "Better than none!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Lmao you idiot. Good try", "score": 6, "replies": [{"body": "The big execs and hedge fund managers caught wind of my superior TA and wouldn't let me profit, so they had to manipulate the market so the pop happens tomorrow. /s", "score": 9, "replies": []}]}, {"body": "This lunch is actually a 6 course meal held at their grandparents house and each time they get up to leave to pop the stock the grandmother is like \"ONE MOOORRRE DISH\"", "score": 5, "replies": [{"body": "Why couldn't everyone else read between the lines like you?", "score": 1, "replies": []}]}, {"body": "Im bored enough to throw in a few Gs based off your TA.", "score": 10, "replies": [{"body": "Excellent. We'll go down together.", "score": 3, "replies": []}]}, {"body": "Well, you tried.", "score": 5, "replies": [{"body": "I sure did.", "score": 5, "replies": []}]}, {"body": "Holy shit, lol. Between 11:50am and 1:30pm EST, it dropped 6¢ and is now down by ~0.07%.", "score": 4, "replies": []}, {"body": "I upvoted so more people can see how retarded you are", "score": 5, "replies": [{"body": "Thanks!\n\nI'll be posting another shortly.", "score": 1, "replies": []}]}, {"body": "Dead cat bounce deluxe.", "score": 4, "replies": [{"body": "I feel like I'm playing Kitten Cannon again ", "score": 3, "replies": []}]}, {"body": "AMD is trading way above daily/weekly WMA. However, it is below 250 WMA on a monthly basis. I personally like Micron little more. AMD had a run since OCT15 (excluding FEB mkt crash). If markets hold, I see AMD over $10\nhttp://i.imgur.com/JSqgvz7.png\nhttp://i.imgur.com/XZSdKMl.png\n\n", "score": 2, "replies": [{"body": "RSI also just took a dip while the price movement went up. TSI continues to go lower even as the price movements are increasing.\n\nAll signs point to $10.", "score": 6, "replies": [{"body": "It definitely reads like consolidation, not any sort of real bearishness.", "score": 2, "replies": []}]}, {"body": "I should start using WMA. I've just started on TA and mostly use those SMA's along with RSI, TSI, and Momentum to make decisions.\n\nWMA would definitely be a good thing to add, if not just for comparison to the SMA.", "score": 2, "replies": [{"body": "What's TA on Micron? As for the WMA http://i.imgur.com/0msUhDA.png", "score": 1, "replies": [{"body": "Micron isn't even on my watchlist, though I've heard their name around here a few times, I'll add them now and get back to you.", "score": 2, "replies": []}, {"body": "Hey, no pictures but from a quick look, $MU is pretty much on the up and up, all SMAs are lined up perfectly.\n\nTSI and RSI indicate possible overbought status, may pull back tmw. Volume has dropped since opening so momentum has slowed down but it looks like it might be kicking up again.\n\nFirst time looking at $MU though, whereas I've been doing TA for $AMD almost every day for the last couple of weeks.", "score": 2, "replies": [{"body": "Thanks man. Only thing that concerns me w/ AMD is that it skyrocketed since February, from $1.70", "score": 1, "replies": [{"body": "It skyrocketed from being undervalued.  All it needed to get where it is was a CEO without an extra chromosome and a few quarters of not going bankrupt.", "score": 2, "replies": [{"body": "AMD CEO is legit. I think she is authentic and a very smart person. PhD from MIT I think, watched her on CNBC not long ago ", "score": 1, "replies": [{"body": "Yep.  Bachelor's, Master's and doctorate from MIT.  She's an engineer with a decent helping of business experience.  And so far, AMD has done exactly what she said it would.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Will it ramp at 3:30pm? \n\nHey, that's as good a theory as bullshit TA. ", "score": 2, "replies": [{"body": "AMD's volume usually spikes before close, so it'll go SOMEWHERE\n\n", "score": -1, "replies": []}]}, {"body": "http://imgur.com/a/Ux9td\nI feel like I'm taking crazy pills here", "score": 5, "replies": [{"body": "That's annual data only up to 2015. There isn't event Q1 and Q2 2016 factored in there.\n\nI give zero fucks about AMD last year because if one were to trade this year, strictly based on AMD's performance for the last few years, they'd be further in the hole than my dick was in your mother last night.", "score": 21, "replies": [{"body": "This is the kind of T&A I come here for.", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Dr", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "NP", "score": 2, "replies": []}]}]}, {"body": "The ride never ends.", "score": 4, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Your post has been automatically removed because  https://www.youtube.com/watch?v=P9cObozvAQ0\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I read this as AMD going to poop after lunch.", "score": 1, "replies": [{"body": "It was a typo in the title. Idk why everyone is saying I was wrong...", "score": 1, "replies": []}]}, {"body": "I don't even know why you are looking at those moving averages over 3 days.", "score": 1, "replies": [{"body": "Because AMD trades like wild-fire. The overall trend is positive over 3 months (everything lined up, pretty boring chart) and AMD makes moves at least once a week in some direction. 5 days may be a better period, but 3 has worked ok for me (until today).", "score": 1, "replies": []}]}, {"body": "fuck u", "score": 1, "replies": []}, {"body": "In for 1K @ $5.20", "score": -1, "replies": [{"body": "that has literally nothing to do with this post\n\ncongratulations you bought a stock last month", "score": 1, "replies": []}]}, {"body": "I'd like to point out to all the haters rn, that the 25 and 50 still haven't crossed, so I'm not technically wrong yet. \n\n[They touching tips though](http://imgur.com/a/GER8Q).\n\nJust saiyan, my time estimate may have been poor.\n\nEdit: Andddd they cross", "score": -1, "replies": []}, {"body": "AMD is good and all. I'm a fan boy and use their processors. Hope to hold off for a Zen for my new build. But this is getting a little crazy for what is realistically around a $3 stock. Even if the Zen specs are awesome, I think the hype that's currently driving the stock won't hold and there will be a pull back. Look into buying puts or shorting right before the Zen specs are announced. ", "score": -7, "replies": [{"body": "Nope, I'm pretty much long on AMD.\n\nI drained by options account the one time I bet against them (last Friday when they popped to 8 after making a run to $7.10 on Thursday). I bought Aug 26 7 puts on Thursday that got totally annihilated.\n\nThat's the last time I bet against AMD this year.\n\nAlso, Zen is good and all and definately a factor into the hype and the SP in general, but I'm not investing in AMD because of Zen, I'm investing because I think they have a solid strategy for the next 5+ years in VR and SoC solutions.\n\nMaybe the stock tanks with Zen spec announcements, either way, cheaper shares for me.", "score": 3, "replies": [{"body": "Oh yeah. If you're looking long term holding, things look fine. I don't do tech stocks much, but with pharma stocks, it seems to go \"buy on the hype, sell on the news\" even when the news is good. I'm not sure if tech stocks follow that pattern as much, but the higher this one goes, the more I'll be considering buying some puts that expire soon after the Zen specs being officially announced. ", "score": 2, "replies": []}, {"body": "What really is surprising me is how well the 480 must be doing. It's objectively worse or at least on par with the 1060 and significantly more expensive, so I'm not sure who's buying these things. If anything they were a more competitive choice during the HD 7XXX series than they are now, though definitely more competitive than when Nvidia blew them up with the 9XX series.", "score": 0, "replies": [{"body": "i think the 480 is better for virtual reality games while the 1060 isn't. i'd go with the NVDIA card even if it was a little worse. i just like to stick to my brands. AMD cpu and NVDIA cards.", "score": 1, "replies": [{"body": "You sound like you're stuck in the early oughts.\n\nPolaris is better for DX12.  Pascal is better for DX11.  Each has different benefits for VR, so which one is best will depend on implementation.", "score": 1, "replies": []}]}, {"body": "> It's objectively worse or at least on par with the 1060 and significantly more expensive, so I'm not sure who's buying these things.\n\nNo, it's not.  RX 480 wins in DX12 and compared card for card, it's cheaper.  It's also very popular with anyone using it for compute workloads, particularly crypto-coin mining.  And as long as it sells out as fast as they can produce ... There's no reason for them to cut into their own margins.\n\nOn the low end, the 470 is already available for $10 less than the gimped 3GB 1060.  AMD is still providing the better value cards.", "score": 1, "replies": []}]}]}]}]}
