{"title": "Anyone else see substantial potential upside and limited downside for Apple within the next 2 years?", "selftext": "Disclaimer - 35% of my portfolio is in AAPL \n\nHistorically, Apple EPS is in this order : Q4,Q3/Q1, Q2\nQ4 is always the highest earner. Q3 and Q2 are next and usually very similiar. Q1 comes in last place.\n\nWe can expect this Q3 EPS to be ~ $1.4. That gives a TTM EPS of 1.68+1.4+1.3+1.4 = 5.78. \n\nThis gives Apple a PE of 25, the historical average of the NASDAQ, suggesting it is fairly priced in a generally overvalued market (current NASDAQ PE sitting at 31). \n\nObviously 2020-2021 has been a massive year for all tech, but there are still significant growth prospects for many of big tech companies. For Apple, I see massive growth with new chip Macs coming later this year that will take a much larger share of the laptop,computer market. We also have the iPhone 13 which although doesn’t have much hype, they seem to be sold out and delayed showing demand (yes I know there’s a chip shortage). Services are yet again projected to grow and there are products such as the VR headset,apple car and who knows what else in the pipeline. Add to this the consistent share buybacks which don’t look like they’re going to stop anytime soon. \n\nEveryone always seems to think Apple is overvalued but it’s proved investors wrong many times over the last 20 years. \n\nIf you’re not bullish on Apple, why not?", "id": "q24i7u", "created_utc": 1633464690.0, "score": 15, "upvote_ratio": 0.7, "num_comments": 22, "comments": [{"body": "When you at the top like Apple it is an inverse. It is harder to go up and very easy to slip and fall", "score": 20, "replies": []}, {"body": "I believe we are going to see an amazing version of VR glasses brought to market by Apple soon and they are going to change lives more than the smartphone did.  \nFor those old enough to recall the launch of the i-pod, there were mp3 players that were common place, then Apple came along and created their vision.  Then they did this same thing with phones.\n\nMaybe it is hopium but I see AR glasses as this same next big swing.  Sure, Snap and FB have some and Google made them years ago, but soon it will be the time for Apple drops the first real AR glasses.  We will then see 5+ years of amazing AR evolution.", "score": 6, "replies": []}, {"body": "Will hold until I’m six feet under clutching my iPhone 43 in my withered right hand", "score": 5, "replies": []}, {"body": "I like apple, but I wonder what the revenue implications might be with the recent court ruling on in app purchases. (I think in the US it is in appeal, but in South Korea it may be passed).\n\nI mean, app makers are willing to figh apple in court  for forcing in app purchaese to go through the apple play store,  so the apple skim must be substantial.  \n\nMight they see revenue slippage if vendors start to take payments apple is not aware of in the future.", "score": 2, "replies": []}, {"body": "It's going to be an Apple Christmas.", "score": 2, "replies": []}, {"body": "Personally I’m extremely bullish as well. I have a strong feeling we’re going to see the AR glasses in the next two years. Between that and the healthcare features going into Apple Watch I believe it’s going to print money. The quality of wearables is becoming a strong incentive for picking up an iPhone, especially for old people interested in the health monitoring", "score": 2, "replies": []}, {"body": "Apple TV is a huge sleeper.  The current price assumes it will fail and imo it will be be a huge growth streaming success story that will eventually be a strong competitor for 2nd place behind Netflix.", "score": 2, "replies": []}, {"body": "Im bullish.  Bought at $130 and plan to hold.  Car will turn apple into a mem stock, granted it wont do much for their revenue.  On the other hand, if they scrap their plans, stock will suffer, for a few days.\n\nEdit:  would never use an iphone or apple computer though.  Cant stand them", "score": 2, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "You make a case why they will continue to be profitable, but then refuse to think AAPL shares are worth buying?", "score": 11, "replies": [{"body": "On the contrary. They'll probably just keep printing money. \n\nI don't get the brand not the stock. Fan boys gonna fan boy.\n\nIf it makes money it makes money.", "score": 2, "replies": [{"body": "You may need to reword your first sentence then.  Reads like you'll never own it.", "score": 6, "replies": []}]}]}, {"body": "What an ignorant statement about the iPhone 13", "score": 1, "replies": []}, {"body": "> They could literally just slap a 14 badge on the 13 and their fanboys would rebuy the phone they've already got just for the 14 sticker and pay 4 figures for the pleasure.\n\nThat sounds to me like a reason to invest.", "score": 1, "replies": []}, {"body": "You ever buy a Tandy? “Phones” seem cheap to me.", "score": 1, "replies": []}]}, {"body": "I think upside and downside are limited. It’s a boomer stock now…", "score": -2, "replies": []}, {"body": "It's weird AAPL does this well... they use outdated technology at a crazy markup and just about everyone knows their stance on labor practices. They have a nice smooth interface on their technology but if you want the AAPL \"experience\" (TV, phone, computer, laptop, etc) it costs a lot. Their \"upgraded\" phone they bring out every year or so, brings little innovation while making customers have to pay for QOL perks (most phone companies are following this trend too) like headphone jack adapters and idk if they've gotten rid of power jack yet but that's on the chopping block. Overall it's a blue chip stock for a reason. Popularity and easy to use products. I guess it's downside would be, technology sector sell offs during crashes or depressions, if you think that might happen at all in the near future (next couple of years) might be worth a deeper dive for some actual factual due diligence.", "score": -3, "replies": [{"body": ">they use outdated technology\n\nNot sure what you are thinking of. In the Iphone 12/13 they use a 5nm  chip technology giving very high performance at very low power consumption. This is second to none in the market as far as I know. The Iphone camera technology is is at the edge as far as I know.  Just some examples. \n\nThere could be areas where they lag behind, please share some examples.", "score": 2, "replies": [{"body": "Last iphone I owned was the XS Max. Great phone awful price point for the A13 Bionic technology. Which is still being used in iPad that were made last year. The iPhone 12 does everything a 13 does except take better videos... not worth the upgrade imo. I'm not really even talking about the phone. The computers are great and all but if you want to buy your kid or niece/nephew or even yourself a gaming rig it's not Apple. That's a billion dollar industry that they're only taking advantage with on the their phones. You can't buy upgrades for the iMac or iBooks  they are priced ridiculously, and on a propriety OS. But there are other windows can be installed on anything. Back to phones for a sec; If I was serious into photography or making videos I'm not buying an Apple product. I'm going with a Nikon or Canon. Ron Swanson once said \"Never half ass two things, whole ass one thing.\"", "score": 0, "replies": []}]}]}, {"body": "I never underestimate apple. However, a large amount of bran new apple devices were purchased during the pandemic. So there could be a slow down in sales for 2022.", "score": 2, "replies": []}, {"body": "I’m heavy AAPL. But my hold is much longer than 2 years", "score": 3, "replies": []}, {"body": "Not heavy on Apple, but always in my portfolio", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Tuesday, October 5, 2021. Please enjoy!", "selftext": "**PsychoMarket Recap - Tuesday, October 5, 2021**\n\nVolatility in the stock market continues, with the three major indexes, particularly the Nasdaq (QQQ), reversing hard after suffering one of its worst days all year, with Apple (AAPL) and Microsoft (MSFT) leading the charge. Market participants continue to closely monitor developments out of Washington and wait for upcoming economic and earnings data to gauge concerns over supply chain disruptions and inflation. Tech stocks once again came under pressure as the benchmark 10-year Treasury yield continues to rise. The S&P 500 (SPY) closed 1.04% higher, the Nasdaq closed 1.35% higher and the Dow Jones (DIA) closing 0.92% higher. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed, closing just 0.35% higher.\n\nWe’ve seen previous episodes of rising rates, both earlier this year as well as when the Fed first announced intentions to begin tapering quantitative easing in the not too distant future. Each of these episodes caused a hiccup but didn’t derail the broader bull market. According to Edward Jones, yields went from below 1% to 1.75% during the first three months of this year, a period that included pullbacks in the S&P 500 of 3.7% for four days and 4.2% for 12 days. However, during that entire three-month stretch in which rates were rising, the stock market rose more than 7%.  In this current spate, 10-year rates have jumped from 1.30% on September 15 to as high as 1.54% last week, reflecting a renewed concern over inflation pressures and reduced Fed stimulus expectations\n\nStocks are struggling to regain their footing after the September selloff, given that many of the concerns that sparked last month’s drop remain. Congressional lawmakers have yet to come to an agreement on a solution to raise the debt limit to prevent a potential government default sometime mid-October. Failure to do so would be catastrophic for the US economy.  As a reminder, Congress successfully averted a government shutdown last week. The House approved a bill late on Wednesday suspending the debt limit through December 2022. The Senate could vote on it as early as this week Senate Majority Leader Chuck Schumer said, but Republicans are expected to block it again as they have twice before. This is an evolving situation. In my humble opinion, I think the Republicans are playing political games with the debt ceiling and will pass it last minute, similar to the spending bill to avoid the government shutdown.\n\nLooking ahead, the September Jobs Report will be released later this week. Market participants are hoping to see payroll gains accelerate after a shockingly disappointing August report, which shoed just 235,000 new payrolls gains versus more than 700,000 expected. Consensus economists anticipate that 475,000 payrolls returned in September, and that the unemployment rate fell to 5.1% or the lowest since March 2020.\n\n**Highlights**\n\n* According to Facebook (FB), yesterday’s nearly six-hour outage was caused by a mistake during a routine maintenance on how internet data routed through its network. Here is a blog by the company [https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/](https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/)\n* Despite broad weakness in tech in recent weeks, shares of Netflix (NFLX) have been on fire, with the company breaking previous ATH twice in the last five days. Perhaps, could be attributed to the immense popularity of “Squid Game”, which has become the company’s most popular show in less than a month. I watched it, it lives up to the hype.\n* Microsoft (MSFT) unveiled a new version of its flagship operating system today, with the company debuting Windows 11. Here is a WSJ article about the features [https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj\\_RHF](https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj_RHF)\n* Today, Facebook whistleblower Frances Haugen gave testimony before the Senate exposing FB’s business practices and calling for more stringent regulation of the company.\n* The price of ... topped $50k again and up 25% this week\n* Three top US hedge funds, Man Group, Elliot Management, Marshall Wace, and Soros Fund Management, who combined manage roughly $200b in assets, have warned that Chinese businesses have become “uninvestable” amid the anti-monopoly scandal, power shortages and Evergrande situation. I agree and personally divested all my holdings in Chinese stocks months ago, some at a loss. Just my opinion.\n* National Union of Metalworkers of South Africa (NUMSA), South Africa’s largest metalworkers union with over 155,000 members, said it was launching an indefinite strike to press for wage increases. This action could block critical supplies for car manufacturing, threatening to further strain a supply chain already stretched thin.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Chipotle (CMG) target raised by Stephens from $1850 to $2000 at Overweight. Stock currently around $1680\n* Capital One (COF) target raised by Piper Sandler from $177 to $188 at Overweight. Stock currently around $168\n* General Motors (GM) target raised by Wells Fargo from $63 to $64 at Overweight. Stock currently around $54\n* International Business Machines (IBM) target raised by Credit Suisse from $167 to $176 at Outperform. Stock currently around $143\n* NVIDIA (NVDA) target raised by KeyCorp from $245 to $260 at Overweight. Stock currently around $204. My favorite stock :)\n* Texas Instruments (TXN) target raised by KeyCorp from $240 to $250 at Overweight. Stock currently around $240\n\n“More money has been lost trying to anticipate and protect from corrections than actually in them” - Peter Lynch", "id": "q28db1", "created_utc": 1633476711.0, "score": 105, "upvote_ratio": 0.96, "num_comments": 23, "comments": [{"body": "Every day, another fantastic market review by u/psychotrader00\n\nLove the personal touches to your posts btw… don’t own any direct shares in Netflix, but after watching halfway through Squid Game I’m personally bullish on future quality programming", "score": 19, "replies": [{"body": "Hahaha same, I havent invested in Netflix in the last year but Squid Game is making me want to invest.\n\nThe hype is real, I havent been captivated by a show like I was in years. I literally watched 8 episodes just on saturday, went to bed at 5am😂😂", "score": 5, "replies": [{"body": "I haven't watched it yet but read an article today about the creator. He tried for 10 years to get his show made. Similar to the Stranger Things creators. If I was manger of any production group that rejected these shows, I would be firing the whole staff that processes incoming new material. Makes wonder how many amazing creators are out there that just can't get past these Hollywood type blockades", "score": 3, "replies": [{"body": "I know!! I actually posted that WSJ article on my twitter https://twitter.com/psychotrader00/status/1445461384796401670?s=21\n\nSuch insane perseverance, so happy to see it pay off. The show is so amazing he totally deserves it\n\nI would fire my staff as well, let the best show since breaking bad/better call saul thru their fingers (my opinion of course)", "score": 2, "replies": []}]}, {"body": "Squid game is soooo overrated, but the NFLX hype is real", "score": 2, "replies": [{"body": "Hard disagree on squid game, one of the best shows ive watched in years, probably since better call saul IMO", "score": 1, "replies": []}]}]}]}, {"body": "Thank you so much, hope your day has been good, cheers.", "score": 10, "replies": [{"body": "I hope yours was as well, my friend", "score": 6, "replies": []}]}, {"body": "This is always one of my favorite posts. Thanks for the time and effort you put in.", "score": 7, "replies": [{"body": "My pleasure!", "score": 1, "replies": []}]}, {"body": "\" I agree and personally divested all my holdings in Chinese stocks months ago, some at a loss. Just my opinion.\" does that include NIO ?", "score": 6, "replies": [{"body": "I really like that company but unfortunately yes, I don't feel comfortable investing in any Chinese stocks at the moment", "score": 3, "replies": []}]}, {"body": "Thanks psycho trader but I think there is a typo in the chipotle headline.", "score": 3, "replies": [{"body": "Yes there is, thank you for pointing it out, will be amending the mistakes", "score": 3, "replies": []}]}, {"body": "Happy Days Are Here Again?", "score": 4, "replies": [{"body": "Hard to say, honestly I expect a lot of choppiness going forward", "score": 3, "replies": []}]}, {"body": "Thanks for the recap.\n\n\"International Business Machines (IBM) target raised by Credit Suisse from $167 to $176 at Outperform. Stock currently around $143.\"", "score": 3, "replies": []}, {"body": "Is the current price a good entry point for NVDA?", "score": 3, "replies": [{"body": "Up to you and what your risk tolerance is\n\nBut in my humble opinion, NVIDIA is my fav stock in the market, I think they will play a big role in crucial in currenrt and emerging tech", "score": 2, "replies": [{"body": "Thanks for your input on this. \nKeep up the good work man!", "score": 1, "replies": []}]}]}, {"body": "Great overview of the situation, thanks for the DD.", "score": 2, "replies": []}]}
{"title": "Tesla Ordered to Pay Worker $137 Million for Racism at Plant", "selftext": "", "id": "q1knxm", "created_utc": 1633398398.0, "score": 5, "upvote_ratio": 0.57, "num_comments": 28, "comments": [{"body": "$137M? How do they come up with a number like that? Sure seems a bit high no?", "score": 19, "replies": [{"body": "Tesla might want to hire a better attorney:\n\n> In her closing arguments to the jury, Tesla attorney Tracey Kennedy said “Mr. Diaz’s story simply doesn’t make sense”", "score": 9, "replies": []}]}, {"body": "https://www.tesla.com/blog/regarding-todays-jury-verdict?redirect=no\n\n\nRegarding Today’s Jury Verdict\n\nOctober 4, 2021\n\n*Sharing this recent note to employees from Valerie Capers Workman, VP People:\n\nHi Team,\n\nEarlier today, a jury in San Francisco decided that in late 2015 and early 2016 Tesla failed to make sure that one contract employee (Owen Diaz) was not racially harassed while he worked at the Tesla Fremont factory. I heard the testimony of every witness. I was at the defense table for Tesla every day during the trial because I wanted to hear firsthand what Mr. Diaz said happened to him. It’s important to understand the facts of this case. Here is what the jury heard:\n\nMr. Diaz never worked for Tesla. He was a contract employee who worked for Citistaff and nextSource.\n\nMr. Diaz worked as an elevator operator at the Fremont factory for nine months, from June 2015 to March 2016.\n\nIn addition to Mr. Diaz, three other witnesses (all non-Tesla contract employees) testified at trial that they regularly heard racial slurs (including the n-word) on the Fremont factory floor. While they all agreed that the use of the n-word was not appropriate in the workplace, they also agreed that most of the time they thought the language was used in a “friendly” manner and usually by African-American colleagues. They also told the jury about racist graffiti in the bathrooms, which was removed by our janitorial staff;\n\nThere was no witness testimony or other evidence that anyone ever heard the n-word used toward Mr. Diaz.\n\nMr. Diaz made written complaints to his non-Tesla supervisors. Those were well-documented in the nine months he worked at our factory. But he didn’t make any complaints about the n-word until after he was not hired full-time by Tesla – and after he hired an attorney.\n\nThe three times that Mr. Diaz did complain about harassment, Tesla stepped in and made sure responsive and timely action was taken by the staffing agencies: two contractors were fired and one was suspended (who had drawn a racially offensive cartoon). Mr. Diaz himself testified that he was “very satisfied” with the results of one of the investigations, and he agreed that there was follow-up on each of his complaints.\n\nEven though Mr. Diaz now complains about racial harassment at Fremont, at the time he said he was being harassed, he recommended to his son and daughter – while they were all living together in the same home – that they work at Tesla with him.\n\nWhile we strongly believe that these facts don’t justify the verdict reached by the jury in San Francisco, we do recognize that in 2015 and 2016 we were not perfect. We’re still not perfect. But we have come a long way from 5 years ago. We continue to grow and improve in how we address employee concerns. Occasionally, we’ll get it wrong, and when that happens we should be held accountable.\n\nThe Tesla of 2015 and 2016 (when Mr. Diaz worked in the Fremont factory) is not the same as the Tesla of today. Since then, Tesla has added an Employee Relations team, dedicated to investigating employee complaints. Tesla has added a Diversity, Equity & Inclusion team dedicated to ensuring that employees have the equal opportunity to excel at Tesla. And Tesla now has a comprehensive Employee Handbook (replacing the Anti-Handbook Handbook) where all of our HR policies, employee protections, and ways to report issues are published in one easy-to-find online document.\n\nWe acknowledge that we still have work to do to ensure that every employee feels that they can bring their whole self to work at Tesla. And as I posted in July, we will continue to remind everyone who enters the Tesla workplace that any discriminatory slurs – no matter the intent or who is using them – will not be tolerated.\n\nThank You For All You Do For Tesla\n\nValerie\nVP, People", "score": 9, "replies": [{"body": "I just imagine a white person going to a black person and saying “hey, you can’t use the n word, even with your black friends.”\n\nBut it looks like that is exactly what would have to happen to avoid being sued.  Madness.", "score": 9, "replies": []}]}, {"body": "https://casetext.com/case/di-az-v-tesla-in\n\nGuy was from a staffing agency ( not employee ) and the beef ( which was with multiple people ) were also from staffing agencies.\n\nAnd it's not from white people. Read the names. It confirms what Tesla said at the time. It's a bunch of black people and hispanic people fighting among themselves.", "score": 20, "replies": [{"body": "Is he the same guy was caught on video calling other people the n word while and suing Tesla for the same thing?", "score": 9, "replies": []}]}, {"body": "So, an African-American worker used the word to another African-American worker and Tesla getting sued? Outrageous.", "score": 10, "replies": []}, {"body": "$137m seems like way too much. People who have family members wrongfully killed by cops don’t get a fraction of that. \n\nSomething fucked up is going on. Like this judge really hates Elon on a personal level or California gov is getting revenge? \n\nExpect they will appeal but still this is crazy. Hope Tesla moves out of CA asap", "score": 9, "replies": []}, {"body": "What a joke. 137 mil??  How the fck they justify this…", "score": 7, "replies": []}, {"body": "Black guys calling a black guy a n? I think that qualifies as bullying, not racism?", "score": 3, "replies": []}, {"body": "[removed]", "score": 19, "replies": [{"body": "Do you not think a case like this warrants a lawsuit?", "score": -7, "replies": [{"body": "Lawsuit is fine.  Article states the plaintiff had encouraged his own children to get a job at Tesla while the supposed issues were occurring.  Also, Tesla’s lawyers say there is an complete lack of evidence.\n\nI actually don’t see any claim of evidence in the article, but the plaintiff read a touching poem in his closing remarks so it must be true.  Give me a break.", "score": 22, "replies": [{"body": "I imagine this case will get appealed for sure.", "score": 5, "replies": [{"body": "If not overturned, then that award will be reduced.", "score": 2, "replies": []}]}]}, {"body": "I don't. I think he is a shakedown artist who doesn't deserve a cent. Even if he was called a slur by someone, it doesn't seem like Tesla tolerated it.", "score": 2, "replies": []}]}]}, {"body": "Elevator operator? What’s this the 1940s?", "score": 6, "replies": [{"body": "I assume it’s a freight elevator.", "score": 3, "replies": []}]}, {"body": "That number seems quite a few orders of magnitude too high to be reasonable... What am I missing here? Can the decision go to a higher court?", "score": 3, "replies": []}, {"body": "Meh who cares", "score": 2, "replies": []}, {"body": "Assuming Tesla's statement is accurate and doesn't leave out some important context, I definitely find it hard to understand what in this case would justify a 130+ million dollar payout\n\nThough I guess we'll have to wait and see what happens in the appeal. From people who know more about the legal process it sounds like it's not uncommon for these numbers to get drastically reduced before everything is said and done", "score": 2, "replies": []}, {"body": "Paywall", "score": 1, "replies": [{"body": "[https://archive.ph/aKlPN](https://archive.ph/aKlPN)\n\nps: I've built a bookmark for finding a non-paywall version, it's at newsyup.com", "score": 3, "replies": []}, {"body": "[https://archive.is/aKlPN](https://archive.is/aKlPN) Looks like the paywall is needed for the juicy \"updates\".\n\n\"Tesla Inc. lost a trial with a Black former elevator operator and must pay him $137 million for having turned a blind eye to racial taunts and offensive graffiti he endured at the electric-car maker’s northern California plant, **according to the man’s lawyer**.\"\n\n\"**The verdict couldn’t immediately be confirmed in electronic court records**.\"\n\nHopefully the lawyer is a liar. What are the odds?", "score": 0, "replies": []}]}, {"body": "This in not going to reflect well in the ESG ratings. . . . .", "score": 0, "replies": []}, {"body": "Is this a joke?\n\n>Black former **elevator operator**\n\nElon has made analogies between self driving cars and self operating elevators before.\n\nEdit:  Its not.  Other sources confirm it.", "score": 1, "replies": [{"body": "Construction elevators are manually operated sometimes.   Also some buildings call their front desk security elevator operators.", "score": 1, "replies": []}]}, {"body": "“The verdict couldn’t immediately be confirmed in electronic court records.”  How can it not be confirmed?", "score": 1, "replies": []}]}
{"title": "NEWS: $TSLA is inflicting more pain on short sellers, and many of them are giving up; The percentage of stock borrowed by traders has slumped to 1.1% of Tesla’s shares available for trading; That’s the lowest since 2010, when Tesla went public.", "selftext": "", "id": "q1wu1p", "created_utc": 1633442007.0, "score": 127, "upvote_ratio": 0.98, "num_comments": 21, "comments": [{"body": "Yeah we ate them yesterday at the opening time. 🤭", "score": 22, "replies": []}, {"body": "The CEO's other company is landing rockets on barges in the middle of the ocean. This is not someone you bet against.", "score": 51, "replies": [{"body": "This is lost on the simple-minded. And probably many intelligent too. \n\nHow many engineering and technology challenges had to be overcome to LAND A ROCKET BOOSTER ON A DRONE SHIP? If that same effort and drive is at Tesla too, and I believe it to be, then 1) $800/share is a fraction of its true value, and 2) anybody who shorts this stock isn't playing with a full deck.", "score": 39, "replies": []}, {"body": "Yet people have been doing it for years, and I expect them to try again after regrouping", "score": 6, "replies": [{"body": " i get to retire early because these people believe Gordo's lies. I hope they come back.", "score": 14, "replies": []}]}, {"body": "And the CEOs Roadster is floating in space somewhere after quickly passing by Mars. Good luck GM!", "score": 3, "replies": []}]}, {"body": "Lowest percentage, but Tesla is still the most shorted by value.", "score": 18, "replies": [{"body": "1.1% of TSLA is still 8.5 billion dollars, and max loss for shorters is not limited by that value.", "score": 6, "replies": []}, {"body": "Let’s have more barbecue to enjoy them.", "score": 3, "replies": []}, {"body": "Not doubting in the least, but I just want to double check, are you certain? If you happen to have a link that lists such stats, that would be most excellent.", "score": 1, "replies": [{"body": "https://www.marketbeat.com/stocks/NASDAQ/TSLA/short-interest/\n\n$20 billion volume shorted, I think\n\nIt's higher than anything on this list. Not sure why it's not in the list:\n\nhttps://www.marketbeat.com/short-interest/", "score": 3, "replies": []}]}, {"body": "Yesterday I saw that shorts were at a record low for Tesla.", "score": 1, "replies": [{"body": "Record low percentage, not dollar amount:\n\nhttps://www.marketbeat.com/stocks/NASDAQ/TSLA/short-interest/", "score": 5, "replies": [{"body": "Like I said, record low.", "score": 0, "replies": []}]}]}]}, {"body": "From the daily thread: Someone opened 100k bearish put debit spread today..\n\n\nLong 50k 10/15 $700p and 50k 10/15 $690p\n\nShort 100k 10/8 $700p\n\nPaid $90M for the long legs and got a credit for $33M for the short legs. That is why stock is down today. Someone is betting huge that stock is going to tank in the next week.\n\nhttps://www.reddit.com/r/teslainvestorsclub/comments/q1nu6f/tsla_daily_investor_discussion_october_05_2021/hfhz449/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3", "score": 4, "replies": []}, {"body": "Straight shorted shares is record low... but due to low IV, it's now the most shorted megacap through long puts. C/P ratio is staggering.", "score": 2, "replies": []}, {"body": "Michael burry has entered the chat", "score": 2, "replies": []}, {"body": "They are either bankrupt or mentally destroyed. Why not join the force to make a better world!?", "score": 1, "replies": []}, {"body": "Yea buying calls ahead of “eye popping” P&D numbers turned out to be a mistake. This stock is fucked up", "score": 1, "replies": []}, {"body": "I wonder how much of this is downside protection vs those actively shorting?", "score": 1, "replies": []}, {"body": "I wonder how Michael Burry's position is going.", "score": 1, "replies": []}]}
