{"title": "(AMD HOLDERS) You guys selling now or waiting for more gains?", "selftext": "I don't know if I should either wait for more gainz or sell now. What about you guys?", "id": "6pjl8l", "created_utc": 1501020025.0, "score": 43, "upvote_ratio": 0.93, "num_comments": 61, "comments": [{"body": "Gonna hold for more gains. I expect 18 by next week then a slump due to Goldman.", "score": 52, "replies": [{"body": "Yup. AMD had 15% shorts going into earnings. We should see layers of shorts peel off sending us higher in the next few days. That guidance boost was huge.", "score": 23, "replies": []}, {"body": "My nigga you took the words straight out of my mouth", "score": 11, "replies": []}, {"body": "goldman bitchmade sachs", "score": 9, "replies": [{"body": "(((Goldman)))", "score": 3, "replies": []}]}, {"body": "I need more friends in GIR for the heads up when they start making stocks crash", "score": 1, "replies": []}]}, {"body": "this shit just broke 15.70 on 20 milAH volume. gonna hit 16 tmrw after 10 am", "score": 18, "replies": [{"body": "Jesus Christ that is a sexy sexy graph. ", "score": 14, "replies": []}, {"body": "Yup I am selling my 13 C FD's tomorrow morning. Mmmmm tasty tendies.", "score": 3, "replies": []}, {"body": "now at 14.90 10:04 am", "score": 1, "replies": [{"body": ":(", "score": 1, "replies": []}]}]}, {"body": "Say it with me fam: S H O R T S Q U E E Z E", "score": 13, "replies": []}, {"body": "I have Aug 18th exp 14s and 15s.  I want to sell some... but the potential for a short squeeze is too much.  ill sell half at 16", "score": 6, "replies": []}, {"body": "I''ll sell at $69", "score": 6, "replies": [{"body": "69.69", "score": 9, "replies": [{"body": ":O", "score": 3, "replies": [{"body": "♋️", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Not according to gaap accounting, still losing. Also keep in mind they have more debt and less money than end of 2016.... But better cash flow", "score": 8, "replies": [{"body": "Turning the corner with momentum is a better time to lever anyway.", "score": 1, "replies": []}]}]}, {"body": "Holding till it hits 17$ at least. ", "score": 5, "replies": []}, {"body": "HOLD. And then buy more if/once it dips.", "score": 5, "replies": []}, {"body": "Thinking of actually holding on to a stock for more than a few months for once", "score": 4, "replies": [{"body": "Me dos ", "score": 1, "replies": []}]}, {"body": "Probably start writing calls. I have 500 shares so I'm sitting pretty happy. :)", "score": 5, "replies": []}, {"body": "Gonna sell a few shares so I can go buy more cocaine.", "score": 7, "replies": [{"body": "Naughty.\n\n", "score": 3, "replies": []}, {"body": "You deserve it.", "score": 3, "replies": []}]}, {"body": "People should sell, it will dip under 15 again.", "score": 9, "replies": [{"body": "i will get it for discount ! thanks !", "score": 1, "replies": []}, {"body": "Just make sure you sell before vega flops and buy before APU's get released.", "score": 1, "replies": [{"body": "I like selling poor man covered calls easy money for amd", "score": 3, "replies": []}, {"body": "This, Vega does not look good based on what we know. There are very likely going to be some extremely negative articles coming out in the next week about AMD's ability to compete with NVDA. I sold today at 15.53 and am looking to jump back in after a Vega dip.", "score": 1, "replies": []}, {"body": "Did you see the Vega FireStrike results? Its on par with the 1080Ti and will probably be priced for far less. Stay long on AMD.", "score": 0, "replies": [{"body": "It was lower than the 1080.\n\nhttps://www.reddit.com/r/Amd/comments/6pfcld/amd_radeon_rx_vega_3dmark_fire_strike_performance/\n\nVega is DOA.", "score": 1, "replies": []}]}]}, {"body": "sell it to me faggot", "score": 1, "replies": []}, {"body": "Nope", "score": 1, "replies": []}]}, {"body": "Sell. Rebuy the dip ", "score": 7, "replies": []}, {"body": "Fucking hold. ", "score": 3, "replies": []}, {"body": "I think I'll be selling sometime tomorrow and putting some into Nokia, perhaps play a little with that foxcon rumor I just saw, and put all the capital back from the small caps that they came from this morning. \n\nKidding. YOLO SNAP. ", "score": 4, "replies": []}, {"body": "I'm not sure either but I am holding ", "score": 2, "replies": []}, {"body": "I'm fucking holding on boys.", "score": 2, "replies": []}, {"body": "Sold 1/4 after hours, will sell another 1/4 in the next day or so", "score": 2, "replies": []}, {"body": "Selling my $1k in calls that expire 07/28 at the end of tomorrow. Holding my $9k in actual stock for life", "score": 2, "replies": [{"body": "Same. Long term goal is for AMD to become one of my dividend paying stonks.", "score": 1, "replies": []}]}, {"body": "I plan on holding through Q3", "score": 2, "replies": []}, {"body": "I'm confident we'll see >25$ in a couple of years. I'm holding to the moon.", "score": 2, "replies": []}, {"body": "Everyone knows vega will be 1080 at best with power demands more than your grandma's dildos, but if they can somehow price it cheaply and still make a small profit, can't see the SP tanking a result. Benchmarks are already leaked, the only thing we're waiting for is the price, unusually for investors, I think the lower the better. ", "score": 2, "replies": []}, {"body": "Amd probably going to get a bump in ratings after this quarter", "score": 1, "replies": []}, {"body": "Holding long on these and will slowly increase position moving forward. AMD's well-positioned to take more of Intel's market share moving forward. Baidu is already committed to using their EPYC server chips. Threadripper is set to make a splash in the HEDT segment. \n\nIf they progress well and hit their goals according to Su's roadmap, this is easily a $20-stock in 2 years or less. ", "score": 1, "replies": []}, {"body": "Buying some calls. Holding til mid August or 100%, whichever comes first and hope Toshiya Hari doesn't pop out of his troll hole. \n\nUnless he pops out to say Nvidia is a convictioj buy then sure. ", "score": 1, "replies": []}, {"body": "MOAR GAINZZZZZ!!!!!", "score": 1, "replies": []}, {"body": "I'm holding for the gains. Honestly feel that they have long term potential.", "score": 1, "replies": []}, {"body": "Will hold through end of this year for sure. Not going to pay regular tax rate.", "score": 1, "replies": [{"body": "If only you had a shit ton of capital loss carryover, then it wouldn't even matter!", "score": 1, "replies": []}]}, {"body": "Selling tomorrow", "score": 0, "replies": []}, {"body": "AMD will tank Q4", "score": -9, "replies": [{"body": "Why you think that?", "score": 5, "replies": [{"body": "Because he's a fucking psycho that posts shit like this on a public forum?\n\n>Did you smear it or eat it? That's all I care to see... I love when women take a hot steamy runny shit, smear it all over themselves, then start dildoing their ass and pussy simultaneously, finally to end it all, they suck on that shitty dildo and lick it clean. I'll pay $0.99 for that...", "score": 12, "replies": [{"body": "Jesus. W.t.f", "score": 1, "replies": []}, {"body": "Scat porn. Plenty of ppl enjoy it. But now that camming has become more popular than ever and allows for anyone to create their own custom videos, I'm just digging at this one girl who has her own subreddit r\\CassieScat and does custom requests for scat videos. She will take a steamy shit and rub it all over herself, possibly even eating it if someone pays enough. At first I was making fun of her. But in an attempt to get her to do something truly obscene, I had to appeal as a fan.\n\nFyi, no one would do anything for 0.99. That number was part of my sarcastic joke. They usually charge $12-20 for a video request.", "score": 1, "replies": []}]}]}]}]}
