{"title": "TSLA PUTS PRINTING TOMORROW!", "selftext": "", "id": "fkhg5x", "created_utc": 1584495815.0, "score": 66, "upvote_ratio": 0.92, "num_comments": 59, "comments": [{"body": "I sold mines to early so mad bought at $4.00 sold @ $20 now is worrh $120+", "score": 45, "replies": [{"body": "You still made a decent profit no shame in that", "score": 29, "replies": [{"body": "Little bit of shame.", "score": 18, "replies": []}]}, {"body": "Wow, I bought some at 1.50 sold at 1.60. It was 450 3/20s 🙃 now worth 40+... Now I learn for me if the play is good, let it ride. Incorporate risk management and you will be good, cut losses, never hold, unless it's a YOLO", "score": 10, "replies": [{"body": "Jim cramer says bear make money bull make money pigs get slaughter u sold very early wow", "score": 7, "replies": [{"body": "I'm gay. I don't listen to Jim Cramer. But grats on your future gains ✌️", "score": 2, "replies": []}, {"body": "And pussies get reamed 🤷🏿‍♂️", "score": 1, "replies": [{"body": "Ohhh yeah", "score": 0, "replies": []}]}]}]}, {"body": "F\n\nBut profits are profits. 5X gain nothing to sneeze at", "score": 4, "replies": []}, {"body": "I was close to yoloing but the premiums were so high. Is it high because it’s extremely volatile or is Tesla just an outlier and a special form of retard.", "score": 1, "replies": []}]}, {"body": "Follow Daddy Musk's guide to becoming a millionaire in 1 month!! \n  \nStep 1: Start off as a billionaire.\n\nStep 2: Go long on $TSLA", "score": 90, "replies": [{"body": "Lmao", "score": 11, "replies": []}, {"body": "😂 dude thats fucking hilarious", "score": 6, "replies": []}, {"body": "is it legal for elon to short tsla?", "score": 3, "replies": []}, {"body": "Dude they did sell off their stock right at the peak tho.", "score": 2, "replies": [{"body": "Elon actually bough $10 million worth of stock last month when the share price was in the $700s \n\n\nhttps://www.bloomberg.com/news/articles/2020-02-20/tesla-ceo-musk-buys-10-million-of-shares", "score": 3, "replies": []}]}]}, {"body": "Yup!!! Been swing trading them since March 11th. People keep downvoting me for telling them to jump on the train before it’s too late.", "score": 16, "replies": [{"body": "Made 10k just doing puts and calls on it today, fun stock", "score": 9, "replies": []}, {"body": "I told my dentist that. He said he was holding. Oookay, I'm only your financial advisor.", "score": 8, "replies": []}]}, {"body": "Tsla puts have been printing for the past month and a half", "score": 14, "replies": []}, {"body": "Seriously the economic consequences of this virus panic are going to cause a lot more death, suffering, and just reduced quality of life than the virus itself.", "score": 9, "replies": []}, {"body": "Got mine", "score": 5, "replies": []}, {"body": "SPCE - the  poor man's tsla short?", "score": 6, "replies": []}, {"body": "This is a rich mans put. The options right now are expensive.", "score": 4, "replies": [{"body": "I bought 5, 230p 3/20 today at the midday rally. The impending cliff has me rock hard.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Oh fuck", "score": 8, "replies": []}, {"body": "Those will probably all expire worthless - why wouldn’t you buy further out than tomorrow - you’re literally burning money", "score": 11, "replies": [{"body": "SPY is hitting $230 this week brother. Though that guy should definitely get out before Thursday close", "score": 8, "replies": []}, {"body": "Yeah theta will murder those. Those won’t be profitable for anyone to buy because their break even would be too low. You’ll be stuck exercising those at best unless spy drops at like light speed tomorrow :/\n\nI hope you make money but damn :(", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Still not itm", "score": 4, "replies": []}, {"body": "It has to drop another 13% at least for those to be worth anything tomorrow with them expiring. There’s no value in people buying OTM or even barely ITM options the day the expire, you have to hope they reach your break even point so you can exercise :/\n\nEdit: misread your strike price.. not 13% down but still risky. My point about buying options the day they expire still stands", "score": 0, "replies": [{"body": "They won’t with that attitude!", "score": 2, "replies": [{"body": "Like I said, I hope he/she makes money. I don’t want anyone to lose money", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "What you wanna bet?", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "If you’re right I give you 100$ if I’m right you get banned?", "score": 1, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "How would we settle this bet?", "score": 2, "replies": []}, {"body": "So if I’m right you get banned, but if you’re right you get 10k?", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Gonna post tomorrow?", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "As long as they include your tendies", "score": 1, "replies": []}]}]}, {"body": "I really hope you plan on selling those at open", "score": 2, "replies": []}, {"body": "!remindme 1 day", "score": 2, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 23 hours on [**2020-03-19 02:43:13 UTC**](http://www.wolframalpha.com/input/?i=2020-03-19%2002:43:13%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fkhg5x/tsla_puts_printing_tomorrow/fksvjhn/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffkhg5x%2Ftsla_puts_printing_tomorrow%2Ffksvjhn%2F%5D%0A%0ARemindMe%21%202020-03-19%2002%3A43%3A13%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fkhg5x)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "You my friend, are a savage 😜 high fuckin five", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "To think it was reading 360 2 months ago.", "score": 3, "replies": [{"body": "Tsla 420c gang gonna be a thing again.", "score": 2, "replies": [{"body": "I just want to be able to buy 500c 2021 for 60$ like I originally did", "score": 3, "replies": []}]}]}]}, {"body": " I bought a $395 5/15 put back on feb 6 but sold it March 6. If I hadn’t used that money to buy spy puts I would have killed myself", "score": 2, "replies": []}, {"body": "Calls at the end of the day?", "score": 4, "replies": [{"body": "Hahaha why would you buy calls? Chances are they get shut down and stop making Tesla’s entirely until this over.", "score": 16, "replies": [{"body": "Yea but these swings tho", "score": 4, "replies": [{"body": "True, however, Alameda county sheriff  tweeted and said they will be making sure that Tesla is working at a very basic capacity tomorrow, which nbc Bay Area just outlined who has to work in the last 5 minutes.", "score": 1, "replies": []}]}]}, {"body": "Probably, after it comes out Elon is ignoring the order to no consequence", "score": 0, "replies": []}]}, {"body": "\"aNaLyStS dOnT uNdErStAnD tHiS cOmPaNy\"", "score": -1, "replies": []}, {"body": "Hehehe I straddled. Already lost 2k on theta. I knew TSLA news would come out again soon. Hehehe my put gonna be pretty", "score": -1, "replies": []}]}
{"title": "Which companies will declare bankruptcy?", "selftext": "I saw we compile a list of companies which are loaded with debt, weak, have poor management, and will be severely impacted by this recession. \n\nLet's ride them all the way down to $0 with puts.", "id": "fkqbnf", "created_utc": 1584541560.0, "score": 13, "upvote_ratio": 0.72, "num_comments": 62, "comments": [{"body": "Hold on let me look into the fucking future\n\nEdit: Am back from future, am still retarded, Elon made it to Mars, Spy is at -6372848, Government is giving us all $69,420/month, Trump is still president", "score": 116, "replies": [{"body": "It's been 5 minutes mf, how long do you expect us to wait???", "score": 18, "replies": []}, {"body": "Shit boys we lost an autist in the future...I know one of you fucktards got a DeLorean\n\nEdit: FUCK that..Let's send him back with that Megautistic info he came back with.", "score": 6, "replies": []}, {"body": "Sarcasm aside it was a good question.\n\nThere’s too much of people posting “company x is going down buy puts”\n\nYo they’re all going down.  Intelligent discussion involves are the option fees worth it, and if people\nHave good knowledge of a companies financials that they are in risk of bankruptcy with this, that’s good info.", "score": 2, "replies": [{"body": "That's why we need to compile a list of companies with ridiculous amounts of debt, not enough cash flow, which are non-recession proof.", "score": 1, "replies": []}]}, {"body": "What’d you see?", "score": 3, "replies": [{"body": "Op losing all his money after making a bad bet as his all time high.", "score": 3, "replies": []}]}, {"body": "legit AF", "score": 1, "replies": []}]}, {"body": "Your wife already rode them. Long Trojan, just kidding she doesn't like condoms.", "score": 17, "replies": [{"body": "Or OP", "score": 3, "replies": [{"body": "True indeed", "score": 1, "replies": []}]}]}, {"body": "AAL a bailout may not come they could be nationalised. \n\nDB no reason for them to survive this. Currently holding 100 5.50 puts for April 17\n\nTSLA. They don’t earn a profit and the recession will kill anyone buying $40k cars. \n\nF. They bet huge on China. And they fucking lost. \n\nGM. Not building cars. Not selling cars. Not enough cash reserves. \n\nBA. Unless bailed out they are toast. If bailed out expect to see them ride down to all time lows. Half of what they are now.", "score": 18, "replies": [{"body": "TSLA declaring bankruptcy? I highly doubt that. Even when they need help the worst case scenario is that another company is buying TSLA completely for knowledge and especially data transfer.", "score": 13, "replies": [{"body": "Which company has cash?", "score": 1, "replies": [{"body": "aapl", "score": 2, "replies": []}, {"body": "Alphabet could buy TSLA or other more hardware oriented tech giants like Apple will do it. Seriously, I don't see any chance that TSLA might have to declare bankruptcy. The data is too valuable.", "score": 1, "replies": [{"body": "Well they fucking drilled today. I made 200% in 20 mins.", "score": 1, "replies": [{"body": "Congrats!", "score": 1, "replies": []}]}, {"body": "What data?", "score": 1, "replies": [{"body": "From their autonomous driving fleet. Not even mentioning the point that they are even developing the AI software for data evaluation for autonomous cars. This isn't trivial but very valuable experience and data.", "score": 1, "replies": [{"body": "> From their autonomous driving fleet.\n\nWhat autonomous driving fleet? You know their cars don't send any driving data back right? Autonomous cars generate 4TB+ of data per hour. You think they are sending that over a cellphone connection? Lol. \n\nNo wonder Tezzler stock went to $1000.", "score": 1, "replies": [{"body": "Where the hell did I state that they would send it through their cellphone connection? Fact is that Tesla has data in terms of fleet kilometers no other company has. And when it comes to the current state of AI the more (good) data you have the better and/or more generalized your predictions will be.", "score": 1, "replies": [{"body": "What are fleet kilometers? And what can you predict with them? \n\nIf all they have is your location data every cellphone company + Apple/Google already have that.", "score": 1, "replies": [{"body": "Fleet kilometers = kilometers of the autonomous driving fleet while collecting important sensor data. It isn't just the location data they are collecting, it is the video and sensor data from their autonomous driving fleet what I am talking about. They won't throw away this data, they are storing and using it to train their evolving AI models for better segmentations, object classifications and resulting actions by the autopilot.\n\nIt would be extremely pointless to just train the current AI model with the incoming sensor data and discard the data itself because it is highly likely that future models have to be trained with the raw data they have already collected.", "score": 1, "replies": [{"body": "> kilometers of the autonomous driving fleet while collecting important sensor data\n\nTesla collected less than 30km of test data [last year](https://www.caranddriver.com/news/a31122014/tesla-testing-autonomous-mode-12-miles/).  \n\n*Companies working on self-driving cars are required to give the state of California regular reports on how many miles they drove and how many disengagements from autonomous mode there were (number of times a human intervened).Tesla reported, for 2019, only one autonomous drive in the state, of a mere 12.2 miles, and no disengagements. For comparison, Waymo reported nearly 1.5 million miles and Cruise claimed more than 830,000 for 2019*", "score": 1, "replies": [{"body": "This is weird since this [Forbes articl](https://www.forbes.com/sites/greatspeculations/2019/11/08/just-how-far-ahead-is-tesla-in-self-driving/#6e6ffc8a1b24)e (data [overview](https://dashboards.trefis.com/no-login-required/XXi3qy1H/Just-How-Far-Ahead-Is-Tesla-In-The-Self-Driving-Race-?fromforbesandarticle=tsla191108)) says that \"Over 2018 alone, Tesla's Log Of Autonomous Driving Data Was Orders Of Magnitude Higher Than Rivals\". However, I think that this inconsistency is simply because of the fact that \"autopilot\" and \"autonomous\" miles are mixed up in several articles like these ones. For the AI it isn't relevant if it is data from an autonomous car or not as long as they are collecting the data.\n\n&#x200B;\n\nJust aside, they clearly have the advantage that most of their cars actually have the hardware (e.g. sensors) needed for autonomous driving capabilities which is unique for a car company.", "score": 1, "replies": [{"body": "> as long as they are collecting the data\n\nThat's the point. They are not collecting any data. Other than probably location data. Why is that hard to understand?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "DB 5p 7/17 are $1 right now", "score": 2, "replies": [{"body": "Free money", "score": 1, "replies": []}]}, {"body": "F strike and exp?", "score": 1, "replies": [{"body": "Fuck if I know.", "score": 1, "replies": []}]}, {"body": "F and BA I think there’s a good chance shareholder equity will be wiped out. Either through bankruptcy or as a condition of large government assistance.", "score": 1, "replies": []}, {"body": "Macys", "score": 1, "replies": [{"body": "Yup", "score": 1, "replies": []}]}, {"body": "How long do we hold the ford 3/27 puts , up 220% do we run or do we hold...", "score": 0, "replies": [{"body": "I have a rule. When I make 300% I sell half my position and have a beer. It works for me.", "score": 2, "replies": [{"body": "Well here's hope for some beer later this week.  Yee yee", "score": 1, "replies": [{"body": "Beers at lunch. My spy puts hit 1000%", "score": 1, "replies": [{"body": "Definatly beers at lunch.  F 3/27 $5 and $4.5  puts gain 300%. Sold and reinvested half back into F 4/3 $4 puts. Taking tendies and running. CHEERS!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Outback steakhouse.\n\nEdit: it's bloomin brands \n\nThey have lost 50% of their value in a week. I wish I put the shit out of it a week ago.", "score": 5, "replies": [{"body": "So its going to become brokeback steakhouse?", "score": 7, "replies": [{"body": "🌈🐻", "score": 1, "replies": []}]}, {"body": "I fuck with outback", "score": 3, "replies": []}]}, {"body": "Mar,hil, expe, ihg", "score": 5, "replies": []}, {"body": "If I had to guess, Ford, and if you're ballsy AAL", "score": 4, "replies": []}, {"body": "Probably half of the oil shale and oilfield services companies.", "score": 4, "replies": [{"body": "USO 10c 1/15/21 am i retard?", "score": 2, "replies": [{"body": "Not completely. It's just most of these companies were already running thin. Gov will probably provide assistance, just hope it happens before too long.\n\nMight look at the banks with too much oil exposure... like BOK", "score": 2, "replies": []}]}, {"body": "HAL is furloughing 3500 employees in Houston. Blinding them with the Arabian goggles before the throat bruiser a month from now.", "score": 1, "replies": []}]}, {"body": "Ford will be a penny stocks here shortly.", "score": 3, "replies": [{"body": "It technically already is. Penny stocks are anything below $5 \n\nAlthough it does have a large market cap. \n\nhttps://www.investopedia.com/ask/answers/050115/what-difference-between-penny-stock-and-small-cap-stock.asp", "score": 2, "replies": []}]}, {"body": "Ladies and gentleman, they’re talking about swaps on CNBC. Buckle your seat belts, because it’s gonna be a bumpy ride.", "score": 3, "replies": []}, {"body": "ONDK is fucking gone for sure. \n\nMaybe LYFT gets wrecked, LC is fucked, CHK is fucked.. we're all fucked\n\nBuy puts", "score": 2, "replies": []}, {"body": "LYV might go bankrupt with 1 bad quarter. \n\nMaybe they could hold mini concerts instead. 10 people at a time minus the band", "score": 2, "replies": []}, {"body": "WH Smith's. CINEWORLD. UBER. And on and on.", "score": 1, "replies": [{"body": "You think Uber would declare bankruptcy?", "score": 2, "replies": [{"body": "Close enough to profit from shorting it. I wouldn't try and hold to zero.", "score": 1, "replies": []}]}]}, {"body": "$AMC looks like it’s about to do a merger of equals with $ROPE", "score": 1, "replies": []}, {"body": "Michael Scott", "score": 1, "replies": [{"body": "Hahahahaha", "score": 1, "replies": []}]}]}
{"title": "Tesla Possibility", "selftext": "[deleted]", "id": "fkqnp3", "created_utc": 1584542867.0, "score": 63, "upvote_ratio": 0.89, "num_comments": 59, "comments": [{"body": "Not if we ALL buy a shit ton of Puts against Tesla. \n\nThen take the Tendies and order Tesla's.\n\nThen buy Calls on Tesla's.\n\nThen take Tendies buy more Tesla's\n\nCan't fucking lose", "score": 98, "replies": [{"body": "Literally un-fucking-beatable strategy", "score": 39, "replies": [{"body": "It's the kind of DD I come here for.", "score": 6, "replies": []}, {"body": "I'm in.  Gotta go do some truck stop tricks to buy those puts, but easy money in the long run.", "score": 6, "replies": []}]}, {"body": "Woah", "score": 3, "replies": []}, {"body": "Brilliant!", "score": 3, "replies": []}, {"body": "Can't go tits up", "score": 2, "replies": []}]}, {"body": "My TSLA puts say fuck that", "score": 94, "replies": [{"body": "My Tesla puts are OTM and barely printing right now...", "score": 13, "replies": [{"body": "Got 20 $100 6/19 Puts for 1 buck each. Already up 475%, might actually bag 50k from it", "score": 18, "replies": [{"body": "Huh. Interesting. I took a 250p 3/27. Probably roll for profit today. Waiting for Trump to come on and tell us the virus is good for America. Hold my beer...", "score": 7, "replies": []}, {"body": "When did you buy?", "score": 6, "replies": [{"body": "march 9th", "score": 8, "replies": []}]}, {"body": "This is retarded lmao.  Is there even interest at that level", "score": 1, "replies": [{"body": "Volume 332 open interest 18,619", "score": 1, "replies": [{"body": "Lmao this is amazing.", "score": 1, "replies": []}]}]}, {"body": "Are you sure you can even sell those", "score": 1, "replies": []}]}, {"body": "Tsla calls $$", "score": 1, "replies": []}]}, {"body": "Fuck every square inch of that", "score": 1, "replies": []}]}, {"body": "If Tesla goes under 300 I’m buying a fuckload of leaps", "score": 25, "replies": [{"body": "yes", "score": 6, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Are you going to refinance anyways since rates got slashed?", "score": 2, "replies": []}]}, {"body": "Do you know how expensive the leaps are?", "score": 1, "replies": []}]}, {"body": "Yeah fuck tesla and I drive one", "score": 25, "replies": [{"body": "I drive a '95 Honda Civic with 250,000 miles, all highway.  Want to trade?", "score": 15, "replies": [{"body": "Dude, I have an 04 Civic with 225k! Those cars are beast.", "score": 3, "replies": []}, {"body": "That Honda Civic will probably outlive Tesla Inc.", "score": 6, "replies": []}, {"body": "Yo! I had a 1989 Corolla that ran until 300k", "score": 2, "replies": []}]}]}, {"body": "I’ll stimulate Elon", "score": 9, "replies": []}, {"body": "So you wanna go full u/WSBGod and make tendies? Damn, you are truly a special kind of autist.\n\nTesla gets shut down, the stock price plummets to $200 in one single swoop. At that point a leap call deep OTM would be pretty cheap and certainly good cause this company is invested in the future even though the drop that they are experiencing is because a lot of companies see Tesla as a car company only.\n\nI think the stock will fall so hard, it will make the shares and call options a steal to buy because it isn’t the company that it was 1 year ago if you do some diligent DD.", "score": 7, "replies": []}, {"body": "TSLA has enough cash, will withstand a recession easy. LEAPS under $330.", "score": 5, "replies": [{"body": "What is a leap? A far out call? Why not just buy shares?", "score": 2, "replies": [{"body": "Leverage", "score": 1, "replies": [{"body": "Is that French?", "score": 2, "replies": []}]}]}, {"body": "When the tide goes out we will see who is not wearing short shorts.", "score": 1, "replies": []}]}, {"body": "I don’t even want the government to give the airlines money, why the fuck do you think I would want to give some meme car company my money?", "score": 6, "replies": []}, {"body": "The News saw workers going into the factory today even with the order to stay home", "score": 2, "replies": [{"body": "They (and everyone there) are allowed to operate \"minimum basic operations\".\n\n>“Minimum Basic Operations” are defined by the order as “[t]he minimum necessary activities to maintain the value of the business’s inventory, ensure security, process payroll and employee benefits, or for related functions,” and “[t]he minimum necessary activities to facilitate employees of the business being able to continue to work remotely from their residences.”", "score": 3, "replies": [{"body": "Ah ok. Thanks", "score": 1, "replies": []}]}]}, {"body": "Does anybody think Tesla’s SEO was perfect? I believe their upper management in China warned Elon and the board of that shit show and what could happen. Damn well knowing they aren’t too big to fail, I believe they covered their asses at a perfect time. When the smoke clears from this mess and we can pinpoint 10-25 events that gave us clear warning of an economic crisis, I hope Tesla issuing a 2b offering is one of them.", "score": 2, "replies": [{"body": "Do you mean CEO? \n\nIt’s possible they got a warning that’s why they did the offering.... but also because the stock was ridiculously overvalued", "score": 1, "replies": [{"body": "SEO? Secondary equity offering? Lullll", "score": 1, "replies": []}]}]}, {"body": "Daddy Elon can keep the factory running himself. You'll see GM, Chrysler, Ford and VW go first.", "score": 2, "replies": []}, {"body": "Elon can bail himself out, fuck that guy.", "score": 2, "replies": [{"body": "Elon isn’t actually that rich... his worth and what he actually has are two very different things", "score": 2, "replies": [{"body": "He has a net worth of $30b, how he chooses to leverage his own wealth isn’t my fucking problem. He’s a complete douche nozzle.", "score": 0, "replies": [{"body": "You clearly don’t understand what net worth is comprised of", "score": 2, "replies": [{"body": "No I don’t think you understand liquidating assets when necessary to not be a pig and generate cash flow.", "score": 1, "replies": [{"body": "I’m acutely aware of all the above. Tell me how, when 90% of his net worth is stock, he could liquidate that and keep Tesla alive? Lol", "score": 2, "replies": [{"body": "Bro he doesn’t own $27b in stock, he has sold tons of stock in the past and his buy backs are always in the millions not billions. That being said, even if he had $1b liquid and he truly believes in the cause and the company as every dipshit Elon praiser seems to think, a cash injection of $500m would still make a huge difference in a company with that small of a manufacturing output and I’m sure he could live off of $500m. He doesn’t have 90% of his wealth wrapped up in that dogshit bubble company I am sure.", "score": 0, "replies": [{"body": "He has ~34 million shares of Tesla. His net worth was calculated using Tesla stock at the 7-800 mark, go ahead and look at the stock now. Even while private, he still owns stock in SpaceX and who knows what else. Read his testimony from when he faced the SEC, he doesn’t have shit for cash or real tangible assets.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You're so new I can't even describe what a bitch you are for posting this", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "well you're both", "score": 1, "replies": []}]}]}, {"body": "What don’t you understand?", "score": 1, "replies": []}]}]}
