{"title": "What’s your analysis on the impact of political changes?", "selftext": "Election year. And the wind seems to have changed direction recently. I am curious how you think different political outcomes will affect NVDA and the stock market in general.\n\nI am honestly a bit concerned about the overall economy, nothing specific to NVDA. But we are part of a bigger ecosystem and the political and macroeconomic atmosphere do matter. I am curious to see what the group thinks about this.\n\nCheers.", "id": "1e7fvqk", "created_utc": 1721426815.0, "score": 17, "upvote_ratio": 0.77, "num_comments": 66, "comments": [{"body": "There is honestly no way of knowing what either candidate will actually do. \n\nTrump says he wants Taiwan to provide more money/military - but, that’s posturing. Their manufacturing is part of the reason many American companies are so dominant, and he knows that. China cannot, under any circumstance, be allowed to take Taiwan. We’d need to both replace manufacturing (too expensive and time consuming) and ramp up development because China will catch up almost immediately. \n\nUltimately, in my useless opinion, things will continue to improve for Nvidia under either candidate. It’s too important to the US.", "score": 28, "replies": [{"body": "yea you do 2016-2020 is a pretty good reminder of what trump is capable of", "score": 7, "replies": [{"body": "And what is that? I’m not sure what you’re trying to imply. \n\nDid trump destroy Nvidia in 2016-2020? \n\nDid we start new wars from 2016-2020?\n\nOr, maybe, are you just hoping for a particular candidate?", "score": -3, "replies": [{"body": "he was basically moving the markets with tweets when he wanted to either up or down", "score": 5, "replies": [{"body": "Well, at least you can time the markets if he wins?", "score": 1, "replies": [{"body": "lol but you dont know which way he'll tweet", "score": 1, "replies": [{"body": "Maybe Elon will give us another option? $25 a month to get presidential tweets 5 minutes before everyone else.", "score": 1, "replies": []}]}]}]}, {"body": "Wasted everyone's time with the nightly rage tweets from 11PM to 2 AM and showing up for work at 1 PM every day. Then republicans have the nerve to complain about quiet quitting when Trump more or less invented it and they desperately want more of it from him. Sad.", "score": 3, "replies": [{"body": "Yea, this is exactly what I was afraid of lol. \n\nIt’s a stock, not your favorite political celebrity.", "score": 0, "replies": [{"body": "NVDA for President! Spread the word!", "score": 1, "replies": []}]}]}, {"body": "- DJT did try to get involved in manipulating interest rates by complaining about the FED.  That made the market nervous.\n\n- He handled SARS-CoV-2 badly.  He thought, mistakenly, that the stock market tanking was his fault (the president, short of starting a war, has little control over these things) \n\n- Also had he simply taken *credit* for getting the vaccine done (cutting a tremendous amount of red tape) and encouraging people to get the vaccine  (which ***he*** got) rather than allowing stupidity to rule because he was worried about his “base”: we would have recovered sooner.  \n\n- now economic demand has surged because the death rate is no longer 6 for every 100 people diagnosed with it and now is less fewer than 1.5 per 100 people.\n\n- I’d agree prices have gone out of control.  We could blame that on democrats wanting to raise the minimum wage. Corporations, in turn, have raised their prices to cover the increased labor costs.  Corporations have done so to maintain their massive inadequately taxed profits.\n\n- If the president has any control over the stock market, under Biden, it is stronger higher than it has ever been. \n\n- unemployment is extremely low right now. Can that be blamed on or credited to Biden?  \n\n- Ukraine has pumped billions into the economy as Congress authorizes more aid which is enriching AMERICAN defense contractors and their employees. \n\nWorld events have much more effect on the US economy and citizens well-being than the president.\n\nThe tax revenue which Congress under Trump has massively cut has affected the wealthy.  They have a lot more money.  They like them tax cuts.  Still the government is unable to fund basic services that people need. \n\nConservatives love making government agencies suffer for their funding as long as it isn’t the defense department.  I guaranty, if you talk to service members you know, they can identify massive waste spending that almost sounds illegal.", "score": 2, "replies": [{"body": "Excellent write up. This should calm some of the more worried folks. Whether it’s trump or biden or me, Nvidia is probably gonna be ok. Business is better than ever, profits are higher than ever. Corporations are living a luxurious and profitable life right now. Which translates to these wonderful gains we’ve enjoyed.", "score": 2, "replies": [{"body": "I just can’t survive another four years of Trump whining hour after hour about how everyone is out to get him.  He’s a whiny bitch and Biden can’t think straight anymore.  Biden will back out, but the market will be in turmoil until they decide who will run. \n\nCongress works only for themselves and are allowed insider trading (as long as they disclose it within 30 days of their making a trade). Pelosi just bought a shit-ton of NVDA so there is that …", "score": 1, "replies": [{"body": "Lol yea, no bullshit, pelosi buying is why I bought originally.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "The long term impact will be minimal but NVDA was due for a pull back. It is an incredible growth story but the expectations are too optimistic right now.  It will still be a good long term play but the short term could be rocky.", "score": 2, "replies": []}, {"body": "You can't count on what Trump would do either way. It may be posturing or it may not be. He'll do whatever he wants when he wants and it doesn't have to make a lick of sense. The markets are going to be more volatile as we approach the election and they will be totally unpredictable after the election.  \n\nThe GOP has had 4 years to prepare to steal the next election and they are going to interfere and contest it with an army of lawyers. This country is going to see a level of chaos we've never seen before. \n\n  \nNvidia is probably going to be OK but the ride is going to be wild. I plan to move most, if not all, of my portfolio to cash during that time. I might miss a little bump up but won't lose big.", "score": 1, "replies": [{"body": "I think you’re entirely rooted in bias.\n\nI do think we see $95 before we see $150.", "score": 1, "replies": []}]}]}, {"body": "Probably none long term. A bunch of posturing happens, and then after the election is over nothing happens as far as economics … or if anything does happen, it doesnt happen for years - close to the end of the term of the elected person - and that is if they remember what they promised. They spend the first year and a half appointing all their cronies/donors to positions of power.  Then their cronies gotta spend the next year replacing staff and creating their new policies … finally, in the final year and a half of the 4 years, a few things are attempted (seems like most things they try to pass fail) - and hopefully they forgot about most of what they promised, because they almost always screw it up somehow when they try to change things.", "score": 6, "replies": []}, {"body": "As an non American/German pls don’t vote for Trump or you probably open Pandoras Box, I hope iam wrong but this guy is dangerous and don’t knows what he’s doing.", "score": 6, "replies": [{"body": "Lot of Americans want that dangerous guy doing dangerous things. It is not a worry or hypothesis. It has been demonstrated time and time again. He did plenty of horrible things, crimes, got convicted and everything. There are an abundance of proofs and evidences. \n\nBut trump supporters still want him. And there are many of them. Like so many that can potentially win an election. It’s just what the reality is. \n\nThere is nothing in the law of nature or in evolution that will guarantee that what majority of the people will want will be morally or socially good for us. \n\nJustice or truth do not always prevail. It’s a continuous and difficult battle between the light and the darkness. The force of the good wins only in a small percentage of the time.", "score": 2, "replies": [{"body": "oh yea.. really dangerous guy that had the economy booming during his term, was securing the border and there were no wars.. sounds like a dangerous guy.. whats dangerous is the corrupt democratic party which is owned by china and have been systematically destroying this country since biden was placed as a puppet by the elite, via rigged election.. how on earth can anyone think about voting for these criminals again.. I think i’ll vote for the “dangerous” guy that will give my children a chance of a life in america.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "😂 you think kamala and biden do, open borders, $750 for each family that had their lives destroyed by hurricane milton, meanwhile sending billions to ukraine, tampons in kids bathrooms, astronomical inflation.. you’re too low iq to realize they are destroying the country..", "score": 1, "replies": [{"body": "and you want to vote for that again! insanity", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "One thing that Trump could do that would be negative for the chip industry writ large is kill the Science and CHIPS Act. While this wouldn’t directly affect NVDA, it would hurt sentiment towards chip manufacturers and the industry as a whole. NVDA could see some blowback from that. \n\nBut I don’t see that happening tbh just throwing it out there as a possibility.", "score": 6, "replies": [{"body": "I don't think that is going to happen either. I think after the election, GPT-5 will be released. It’s not going to be a game changer, to be honest, but it will be enough to make people lose their minds a little. We will be back to A.I. madness again, at least for a while. If elected, Trump, seeing all the potential cost savings and advancements by the new A.I., is going to do a 180 and low-key support it. I say low-key because he wouldn't want to be seen openly supporting A.I. while benefiting from it greatly. Because he is going to try to take credit for advancements or cost-saving applications of A.I. like it was his doing. Meanwhile, NVDA stocks are going to rise. I truly believe they will at least double in the first quarter of 2025.", "score": 4, "replies": []}]}, {"body": "I would tread carefully. I had about $7k invested early in semi’s like NVIDIA, AMD, and Intel. I figured it was the future and a no brainer. I had other investments as well, separate from my 401k. \n\nTrump’s tariff’s hit them hard. I was furious, partially because at that time of my life 7k was and still is a lot of money. I think I was down 50% and it took well over a year to recover. Every day I checked the markets and every time he tweeted it impacted the market. \n\nTrump is chaos. For average people who don’t have time to play stocks, it’s not fun. His supporters love his chaos. For the wealthy, his chaos means money. Traders love volatility and as we all should know by now, market makers and hedge funds love using volatility as a reason to drive wild price swings and pocket the panic profits. \n\nAs for me, I sold back then. I shouldn’t have but was new to the market and it scared me. I thought I made educated choices and almost lost my life savings because of him. If I had stayed the course, I’d have a lot of money. But I got to break-even and sold. \n\nNow, I’m smarter with trading but am very aware that he is unpredictable and thrives off of other people suffering. He loves power and control. He doesn’t love when someone like Jensen looks as powerful of a force as he does. So, it wouldn’t shock me if he fucks with additional tariffs simply to take Jensen down a peg. \n\nHedge funds are fine with this because they have the algorithms to trade the swings up and down (and we all know retail trades are in the dark pool, which doesn’t impact price). They’ll make profit, regardless. He’ll have an even weaker SEC than we currently have. \n\nSo, in short- set stop losses. Diversify your investments. Be prepared to hold for 4 years at a potential loss if you don’t want to sell. \n\nTLDR: not good for retail, great for MM’s and hedge funds.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 36, "replies": [{"body": "For the whole world except Putin and xi", "score": 19, "replies": [{"body": "And Kim", "score": 7, "replies": []}]}, {"body": "Yeah, let's use one tech stock's performance to gauge the economy. Your brain should be studied in a lab", "score": -12, "replies": [{"body": "multiple have taken a dive lately.", "score": 7, "replies": [{"body": "Dude, no one in their right mind is taking the tech sectors performance on July 17-19 and using that to gauge how the economy performs under Trump. Look at the news right now and you'll see why it's tanking.\n\nTrump's not even in office!!! You two forgot to turn your brains on this morning.", "score": -10, "replies": [{"body": "irony. lol", "score": 6, "replies": []}]}]}]}]}, {"body": "Shorts doing what shorts do! You should only be concerned if you can’t buy the dips and you bought in the 130s", "score": 3, "replies": []}, {"body": "Heaven forbid tRump gets in we'll get more of the crap losses the last couple days has given us.", "score": 10, "replies": []}, {"body": "After Trump spouting about protection money from Taiwan, that's a hard pass for me. That tells me he knows shit about geopolitics. Taiwan can't be taken by the Chinese. Full stop.", "score": 6, "replies": []}, {"body": " The easiest thing would be to look at the performance of the market during Trump's first term in office from January 20th 2017 through January 20th 2021.   Look at the annualized rates of return for the S&P 500,  Nasdaq 100,  and NVDA during that period of time and make up your own mind.   ", "score": 2, "replies": [{"body": "Trump inherited Obama’s economy! By 2019 our economy was dropping, before 2020.", "score": 1, "replies": []}]}, {"body": "Whatever your feelings about Trump are, I think it's an objective statement that to say that he is a chaos agent.  His personal life is chaos, his leadership style (if you can call it that) is chaos.  He manipulates people by creating uncertainty....and that is what the markets hate most.  The Democrats are far more predictable and stable, but they will certainly mean the 2027 tax cuts sunset next year.", "score": 2, "replies": []}, {"body": "Some stocks will go up. Some will go down. Some will stay sideways.", "score": 4, "replies": []}, {"body": "political concerns aka dips", "score": 1, "replies": []}, {"body": "We should all pay fairly, same percentage. If you work hard and make $400,000 you should pay the same percentage as the person that works hard and makes $60,000.", "score": 1, "replies": [{"body": "Of the few things both parties agree on, one is letting the ultra-rich write their own tax code and another is trading on insider information. We're never getting to any variant of the flat tax or a drastically simplified tax code. And we're absolutely not getting to a place where the IRS writes your tax return for you automatically, and you can choose to sign off on it or work on filing your own return because that would be madness!", "score": 1, "replies": []}]}, {"body": "China invades Taiwan earlier because they don’t want to wait for trump to get into office", "score": 1, "replies": []}, {"body": "There's a reason so many are showing up to support Trump. It's because the media outright LIED to you during his presidency. Well, most of them. \n\nMe personally? During his presidency on average my house brought in at the very least 250% of any of the last 3 years. One year was 420%. That was the year I paid over $90,000 in personal income taxes, and I still have nightmares, lol. This year is shaping up to be our worst of the last 10.\n\nThe bottom line is, change the channel, burn the rag, or change the station on the radio. The media is ideologically bent, and they'll probably do it all again.", "score": -5, "replies": [{"body": "If you're really paying upwards of $90k in personal income tax, you deserve to be taxed. That means you're basically independently wealthy. \n\nFrom a quick chatgpt, to pay $90k in income taxes in the US, you'd need to be making approx. $400-450k per year. You absolutely should be paying taxes. I think you should be paying *more* taxes.", "score": 2, "replies": [{"body": "Yeah no. If he were paying $900K in personal taxes, then he'd be wealthy (At least for that year). We really need to adjust the definition of wealthy for the past 50-100 years of inflation and it makes all the whining about raising the minimum wage look even worse so there ought to be bipartisan agreement on this. But who are we kidding?\n\nYet as much as I dislike Trump, had he not botched the pandemic response when he stopped listening to Steve Bannon, the architect of Project WarpSpeed, he was heading for a \\~55% popular vote landslide. And that piece of data came from an NPR piece on it in January, 2020. I remember listening to an episode of War Room as Bannon laid out the pandemic as Trump's crisis opportunity for an easy 2nd term and I was agreeing with everything he said. And I hate Bannon too.\n\nNow this one really ought to get downvoted from both sides for seeing both sides. Have at it!", "score": 1, "replies": []}, {"body": "He should get taxed more because he works harder? Flawed logic.", "score": 1, "replies": [{"body": "No because he's making over $400k per year.", "score": 2, "replies": [{"body": "So you’re telling me that the harder you work, the more taxes you have to pay.", "score": -2, "replies": [{"body": "The more money you make, the more taxes you pay. That's how it should be.", "score": 5, "replies": [{"body": "you’re not seeing the correlation between making money and working hard… hello?", "score": -3, "replies": [{"body": "That quarter will never hit bottom, lol. [https://www.amazon.com/Liberalism-Mental-Disorder-Michael-Savage/dp/1595550437](https://www.amazon.com/Liberalism-Mental-Disorder-Michael-Savage/dp/1595550437)", "score": 0, "replies": [{"body": "\n Hi, I’m Vetted AI Bot! I researched the **Thomas Nelson Liberalism Is a Mental Disorder** and I thought you might find the following\n analysis helpful.\n\n **Users liked:**\n* Insightful analysis on liberalism (backed by 10 comments)\n* Relevant and thought\\-provoking content (backed by 6 comments)\n* Timely and prophetic insights (backed by 2 comments)\n\n **Users disliked:**\n* Poor writing quality (backed by 2 comments)\n* Lack of substantial arguments (backed by 2 comments)\n* Extreme and polarizing views (backed by 2 comments)\n\n \n\n Do you want to continue this conversation? \n\n \\[Learn more about Thomas Nelson Liberalism Is a Mental Disorder](https://vetted.ai/chat?utm\\_source\\=reddit\\&utm\\_medium\\=comment\\&utm\\_campaign\\=bot\\&q\\=Thomas%20Nelson%20Liberalism%20Is%20a%20Mental%20Disorder%20reviews) \n\n \\[Find Thomas Nelson Liberalism Is a Mental Disorder alternatives](https://vetted.ai/chat?utm\\_source\\=reddit\\&utm\\_medium\\=comment\\&utm\\_campaign\\=bot\\&q\\=Find the best%20Thomas%20Nelson%20Liberalism%20Is%20a%20Mental%20Disorder%20alternatives) \n\n This message was generated by a (very smart) bot. If you found it helpful, let us know with an upvote and a “good bot!” reply and please feel free to provide feedback on how it can be improved.\n \n\n *Powered by* \\[*vetted.ai*](https://vetted.ai/chat?utm\\_source\\=reddit\\&utm\\_medium\\=comment\\&utm\\_campaign\\=bot)", "score": 1, "replies": []}]}]}]}, {"body": "Since when does hard work = tremendous wealth? People don’t just work hard and make $400,000. For most of us Americans we’re lucky to see $400,000 in three years. That’s why we own shares to begin with. This IS our retirement funds, vacation funds, down-payments for homes etc. Also, have you ever googled how much the average American makes annually? The top one percent is only ONE percent of the population for a reason my friend. That’s not to say that the other 99 percent doesn’t work hard, but we don’t necessarily have the same connections or generational wealth to give us a head start. \n\nI apologize for going full-blown political but these type of comments really tick me off. I don’t understand people even defend the top earners… I mean they wouldn’t pay us average folks any mind or any day. We shouldn’t be paying twice the amount of taxes while these dingbats get to cheat the system.", "score": 5, "replies": [{"body": "Independent of ideology, if you don't pick up a trade or learn how to run a business, you're on the hamster of wheel of despair for life and it won't end well. Unskilled jobs become a bigger and bigger trap with every passing year as we refuse to index them to inflation.", "score": 2, "replies": [{"body": "Absolutely. I agree wholeheartedly.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes, he should be taxed at the same rate as everyone else. It's protection money to the Federal Government not raiding his home, beating him up, confiscating his property and selling his children into slavery. And the more you make, the more you pay, or you get to visit Vinny The Fish, in prison if you're lucky, or in his undersea mansion if you're not. If you don't like the rules, there are plenty of 3rd world $h+holes that don't pay for their upkeep you can emigrate to any day.\n\nBut also, hard work != more money most of the time. Ask any sub 0.1% startup employee who was silly enough to socialize the risk and privatize the gain to the 5+% TLAs running the joint. You guys never learn how it works so you'll never fight back.", "score": 1, "replies": []}]}]}, {"body": "Well, my net worth went up 50% under Trump. But under Biden, it went up 900%. I know how I'm voting if the fauxgressive hectomillionaire oligarchs don't push him out of the race. Not my fault if you merely worked hard instead of working smart. But the freedom to work stupid is The 'Murican Way! You're not one of those pinko freedom haters, are you?", "score": 1, "replies": []}, {"body": "I'm getting downvotes from the SFB crowd because I did well under Trump, lol. \n\nHere's a little advice, kids. Pull your head out of your a\\*\\*, and stop living your life by the cable news channel. All they're trying to do is manipulate your emotions so you'll tune in again tomorrow. Sadly, there's not much money in praise, but there's billions in creating evil, whether it's real or fantasy. You're being manipulated. Free your mind, and your ass will follow. \n\nAs for your favorite politicians, you should ask yourselves WHY they hate him so much. Apply a little Occam's while you're at it. Because the answer to that question is VERY simple. He's costing the swamp money. YOUR tax money, that they steal regularly when they're left alone to do it. You know, like right now.", "score": -5, "replies": [{"body": "Nope. Not the reason at all. But I love you think you can generalize people the way you think your getting down voted for. None of us like to be told what or why according to your great experience we think or feel the way we do. \nRemember all of this we do on reddit is just us expressing out opinions. You roo. But where you cross amd where I think your wrong is when you suppose to know why I think and feel the way I do. You can tell me you did better under Trump. Amd I can tell you I have done way better under Biden. Research tells us that how we see the economy is highly correlated to if our side in in power. \nHere's a little advice kids, humble out, know neither side is completely right. Voice your opinion, but don't think other are brainwashed by cable news, because we are not watching that, and we will try to not to assume you are brainwashed in the Cult of Trump.", "score": 7, "replies": [{"body": "👆👏👏👏", "score": 1, "replies": []}, {"body": "Learn to generalize. It helps one identify and avoid patently ridiculous conversations. I mean really, it's how big things get done. The only reason those idiots standing at the head of the class worked so hard to demonize it is their quest to stomp out racism. Yes, racism is pure evil idiocy. Yes, a component of racism IS generalization. So one should never generalize certain things, for sure. \n\nNot to mention to be against generalizing is a very general perspective, and thereby an oxymoron in and of itself. Stop wasting my time with the idiocy of academia.", "score": -4, "replies": []}]}]}]}]}
{"title": "What are  Crowdstrike competitors?", "selftext": "https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2024/01/Gartner-2023.webp\n\nCrowdstrike is known, maybe was, as the 900 lbs gorilla in this EDR space.  Keep in mind you cannot just walk away from crowdstrike.  There are long term 3 year contracts in place and it takes months to replace this technology. \n\nSentinelOne - EDR with MDR services.  Burning a shite ton of cash annually.\n\nMicrosoft  - EDR only, Defender solution comes with E3/E5 subscriptions.  Microsoft security for Microsoft vulnerabilities!\n\nSophos - EDR with MDR services.  Privately owned and cannot enter the casino.\n\nPaloAlto Networks - EDR with really expensive MDR services.  Palos Cortex offering is one of the newer solutions.\n\nTrendMicro - EDR with MDR services.  I rarely run into this one.\n\n", "id": "1e71myc", "created_utc": 1721389214.0, "score": 43, "upvote_ratio": 0.81, "num_comments": 65, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 8 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "PANW bagholder here ![img](emote|t5_2th52|29637)", "score": 19, "replies": [{"body": "PANW bagholder? dafuq", "score": 11, "replies": []}]}, {"body": "SYSDIG  \n[https://www.gartner.com/reviews/market/cloud-native-application-protection-platforms/vendor/sysdig/product/sysdig-secure](https://www.gartner.com/reviews/market/cloud-native-application-protection-platforms/vendor/sysdig/product/sysdig-secure)\n\nhttps://preview.redd.it/6e2oacq52hdd1.jpeg?width=720&format=pjpg&auto=webp&s=1f5c67ed92684ce8e631a3aa3366e50fc4015956", "score": 14, "replies": [{"body": "Very niche tbf", "score": 1, "replies": []}]}, {"body": "What about Cloudflare $NET or is that something completely different", "score": 7, "replies": [{"body": "Cloudflare doesnt play in this specific space.  They focus on Network security mostly.\n\nBest analogy I can give you is you need a seatbelt and they make windshield wipers and windshields.", "score": 16, "replies": [{"body": "Alright thanks. I've been long $NET for a few years but honestly don't really know all this tech too much. I have just seen the DDoS protection \"checking your browser before accessing\" from cloudflare so many times for many years, so I wanted a position in them, expecting them to grow as website traffic grows", "score": 7, "replies": []}]}]}, {"body": "Contracts wont mean shit after this. Uptime guarantee in the contract just got blown to shit. They'll be gladly voiding the contracts in exchange for not being sued for damages.", "score": 4, "replies": []}, {"body": "$BB https://www.blackberry.com/us/en/products/cylance-endpoint-security/cylance-mdr", "score": 34, "replies": [{"body": "Joke of the year no wait joke of the decade", "score": 20, "replies": [{"body": "Your opinion matter because….the experts disagree.\n\nCustomers Have Spoken: BlackBerry Named a 2024 Customers’ Choice for Endpoint Protection Platforms in Gartner® Peer Insights\n\nhttps://blogs.blackberry.com/en/2024/06/blackberry-recognized-gartner-customers-choice-endpoint-protection-epp", "score": 6, "replies": [{"body": "stock market doesn't think so though...", "score": -1, "replies": []}]}, {"body": "Hey, ya.  I guess cycberattacks don’t work on machines you brick.  CRWD !", "score": -6, "replies": [{"body": "That fact that no one talks about BB being a competitor is all you need to know about their solutions.", "score": 6, "replies": [{"body": "We are talking about it right now", "score": 6, "replies": [{"body": "In the comments. OP and others are posting about PANW and Sentinel One. But go ahead and make a post about Cylance, I would love to read the comments.", "score": -1, "replies": [{"body": "Because you asked, I did my first  and only Cylance deal in 2015/2016.  It was new, cool, and different at the time.\n\nFrom my personal experience I do not see customers buying Cylance, I only see them moving off of it.  Feedback I get is it’s clunky, generates false positives, and spikes CPUs.  \n\nA lot of us in the industry use Gartner who analyzes these products for us.  And they do not even recognize Cylance/BB.  Gartner is a bit like the IT Mafia though and is known as a pay to play analyst.", "score": -2, "replies": [{"body": "Do you even read Gartner?\n\nCustomers Have Spoken: BlackBerry Named a 2024 Customers’ Choice for Endpoint Protection Platforms in Gartner® Peer Insights\n\nhttps://blogs.blackberry.com/en/2024/06/blackberry-recognized-gartner-customers-choice-endpoint-protection-epp\n\nhttps://blogs.blackberry.com/content/dam/blogs-blackberry-com/images/blogs/2024/07/gpi-epp-2024a.png", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "Goat company", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "No one serious goes with blackberry for security", "score": 1, "replies": []}]}, {"body": "Small financial services firm of 150 people - billing about 20 million a year. I love our SentinelOne platform! Although I brought S1 in myself, the MSP we have worked with for over 30 years also recommends it and sells it to their customers. Yes, it is a bit pricy, but its been good for us for over 5 years now. We control the endpoint agent upgrades ourselves, and so control that through our change management process - allowing us to test, and stage upgrades.", "score": 5, "replies": []}, {"body": "Anyone with a pulse and common sense at this point", "score": 9, "replies": [{"body": "Pretty much", "score": 1, "replies": []}]}, {"body": "SentinelOne", "score": 10, "replies": []}, {"body": "Cisco and Fortinet have pretty compelling XDR platforms, I’ve seen both multiple times and they will be leading Gartner MQ sooner than later.", "score": 3, "replies": [{"body": "Yep, Cisco has a pretty decent competitor", "score": 1, "replies": []}]}, {"body": "I strongly doubt any of the decisionmakers will even consider switching out the company, if they were happy with the performance before. IT systems can fail. And while we are talking about a massive impact in total, most of those companies will have experienced an outage of a couple of hours individually before. \n\nThis isn´t a cryptotrojan, which takes out your system backup as well. And to protect against those cs is being hired. Google, how many IT security companies have had some issue of some kind. Anybody telling you, they can guaranteed rule that out is not someone you should entrust with the safety of your IT infrastructure.\n\nThis is most definitely a storm. But it will blow over.", "score": 7, "replies": [{"body": "Yeah it’s like saying I am moving out of Azure because it went down for 2 hours. Good luck moving your whole platform over to another provider. Outages are baked into the contracts, how your company deals with them is a whole other story.", "score": 6, "replies": []}, {"body": "I would imagine there might be something companies can use to get some money back from the contract due to revenue loss", "score": 2, "replies": []}, {"body": "Couldn’t they be susceptible to lawsuits?", "score": 2, "replies": [{"body": "Software companies are not responsible for damages caused by software. This is standard legal language since the beginning of time. \nThere will be uptime guarantees (mostly Cloud), which might pay for outages beyond certain commitments.", "score": 3, "replies": [{"body": "When you do something so blatantly negligent, bringing half the global economy to its knees and grounding more flights than 9/11 in the process, the standard legal disclaimer isn't gonna be as airtight as you might think.\n\nNegligence changes things considerably when it comes to liability.\n\nEven if they end up not being forced to pay any judgements, the legal costs alone can get pretty spendy in a hurry.", "score": 3, "replies": [{"body": "I think you have to consider Crowdstrikes amount of failures they have caused including 2 months ago with the Linux crashes", "score": 1, "replies": []}]}]}]}]}, {"body": "Crowdstrike has a decent amount of competitors. Here is the IDC Marketplace comparison for the last ratings given:\n[IDC Marketplace](https://www.crowdstrike.com/blog/leader-idc-marketscape-worldwide-mdr/)\n\nDecent company, and very fast growing the past 5-10 years.", "score": 2, "replies": [{"body": "This is for managed detection and response.  A company could be using one of these other vendors for mdr and crowdstrike for endpoint protection.\n\nCrowdstrike’s bread and butter is their endpoint protection platform.\n\nMS and PAN are the real contenders in that space imho.", "score": 2, "replies": [{"body": "Just providing a list of competitors in certain areas in general. Some others in the thread have named the other areas.\n\nTheir bread and butter is 100% endpoint for many companies.", "score": 1, "replies": []}]}]}, {"body": "Cisco https://www.cisco.com/site/us/en/products/security/endpoint-security/secure-endpoint/index.html", "score": 2, "replies": [{"body": "Oh HELL no", "score": 5, "replies": [{"body": "but they ARE the competitor in that space", "score": 3, "replies": []}, {"body": "Hell no? You can’t get any worse than CrowdStrike now. Emerging business for Cisco while having a robust income from other products. Safer bet.", "score": 2, "replies": [{"body": "As an IT person of the last 20 years....\n\nCisco isn't even the most trusted name in NETWORKING right now.  The literal core of their business.  Why? Because their licensing sucks, their equipment has gone down hill, and they over charge for ALL of their training.\n\nOne of the largest employers around here has dropped them for Aruba, Juniper, etc.\n\nCISCO went from a brand, to an eco system thinking they'd be fine because they had everyone locked in. They didn't. I suspect they'll lose more and more contracts over the years, as equipment phases out and companies realize it's cheaper to replace their devices than stick with Cisco.", "score": 1, "replies": []}]}]}]}, {"body": "Microsoft has MDR https://www.microsoft.com/en-us/security/business/security-101/what-is-mdr-managed-detection-response", "score": 1, "replies": []}, {"body": "I feel like EOD will be a good time to buy into CRWD.", "score": 1, "replies": []}, {"body": "Who?", "score": 1, "replies": []}, {"body": "Trend Micro has changed for the better over the last decade, but unfortunately, they are only on the Nikkei", "score": 1, "replies": []}, {"body": "Today? The off button", "score": 1, "replies": []}, {"body": "Security switch overs take 6-8months to switch, trust me. It’s not a 2-3 month project. \n\nJust getting through security assessments takes 2 months by itself. So yea, I wouldn’t start just buying competitors\nI want to see where this leads. But even with Splunk acquisition, it’s not like every person has jumped from that wagon (lots have mind you, it’s just super slow moving. Super)", "score": 1, "replies": []}, {"body": "Pan and MS are the most likely to make inroads into crowdstrike customer base.  Trust me on this.", "score": 1, "replies": []}, {"body": "I posted a pretty in-depth analysis of SentinelOne ($S) about 2 months ago. I thought it was a great value then regardless, but this should at the very least present a tailwind as it relates to winning in the enterprise sales motion.  SentinelOne has a war chest... their burn isn't really concerning relative to capitalization. \n\n[SentinelOne ($S) Full Write up w/ Charts](https://intrinsicinsights.substack.com/p/s-unlocking-value-in-the-cloud?r=2lehzc)\n\n[SentinelOne Reddit Post w/ Discussion (2 Months Back)](https://www.reddit.com/r/ValueInvesting/comments/1d4b4hd/unlocking_value_in_the_cloud_with_sentinelone_s/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "score": 1, "replies": []}, {"body": "Is S1 still burning a shit ton of cash? They just reported their first ever positive cash flow quarter. And they have a Billion in cash with basically zero debt so they can still burn cash for a few years. Will probably be profitable in a couple years I’d imagine.", "score": 1, "replies": []}, {"body": "SentinelOne NYSE:S is the only real competitor to CRWD. You can now see the action from Monday for S1. For some reason wallstreet has been punishing S1 like mad. I am hoping someone here can figure out why before I call or put on either.", "score": 1, "replies": []}, {"body": "As someone who writes software for a living, this type of event usually has the opposite effect than people think. All IT systems have things like this happen and anyone saying otherwise is someone you should run away from as fast as you can. What ends up happening is customers stick with the product and the news provides free marketing.", "score": 1, "replies": [{"body": "That would make sense if no competitors capitalise the situation", "score": 1, "replies": [{"body": "There’s nothing to capitalize on. Any competitor who says they don’t occasionally have the same issue is lying.", "score": 1, "replies": [{"body": "Its a mixed bag because CrowdStrike become a house hold name via a failure. A better marketed competitor can win new company over", "score": 1, "replies": [{"body": "That’s what people said about aws in 2014 shortly before their explosion in value. That’s not to say Crowdstrike is going to go higher in value (it’s already overvalued in my opinion) but events like this are rarely a deathblow on their own.", "score": 1, "replies": []}]}]}]}]}, {"body": "Rubrik", "score": 0, "replies": []}, {"body": "cyberark (CYBR), Zscaler (ZS), Check Point Software (CHKP), Fortinet (FTNT).", "score": -6, "replies": [{"body": "lol, this is why I posted the list.  Y’all keep spitting out security companies that are not in the same swim lane.  Zscaler is an internet gateway and VPN alternative and CyberArk is identity management.", "score": 13, "replies": [{"body": "Check Point and Fortinet have EDR solutions", "score": 4, "replies": []}]}]}]}
{"title": "Bers won yet again ", "selftext": "Loss mostly from nvda, amzn, and meta. Current positions are 12 $150 8/2 nvda calls, 12 $152 8/2 nvda calls, 5 8/9 amzn calls, and one $147 nvda call for 8/16. Currently down almost 2k from these plays. ", "id": "1e725p5", "created_utc": 1721390944.0, "score": 67, "upvote_ratio": 0.89, "num_comments": 59, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 9 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 280 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "they massacred my boy![img](emote|t5_2th52|31225)", "score": 46, "replies": [{"body": "It is absolutely dreadful", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|4260)", "score": 4, "replies": []}, {"body": "*hug*", "score": 2, "replies": []}]}]}, {"body": "You still have almost 3k to lose don’t give up yet", "score": 29, "replies": [{"body": "I’m trying to decide if I should just cut my losses and salvage what I can or just let these nvda contracts ride", "score": 5, "replies": [{"body": "150 8/2.... bro sell or roll out", "score": 7, "replies": [{"body": "Sell 💀", "score": 4, "replies": []}]}, {"body": "I have NVDA calls that are down as well, but for September, October and November (strikes 125:135.) I actually rolled out one of the September ones today (and will likely do the rest on Monday when I free up buying power.)", "score": 2, "replies": [{"body": "And I just sold some August AMZN calls outright.)", "score": 2, "replies": []}]}]}]}, {"body": "[removed]", "score": 14, "replies": [{"body": "Thetagang won.\n\nOP is getting BTFO is because they bought cheap^(low prob & OTM) short dated options. \n\nBears don't really win. They rarely ever do. Their idea of \"\"\"winning\"\"\" is calling for recession +655 days (that's how many days the yield curve has been inverted but we all know bears never really stopped since the 2020 lows) and will call it a \"\"\"win\"\"\" when we really eventually hit recession and the market drops 15-25% (after going up a few hundred percent).\n\nNah, OP just a degen who got his money taken from him by thetagang at the casino. He's regarded in the fact that he doesn't even know who took his money and wrongly believes it's because of bears.", "score": 7, "replies": []}, {"body": "Bike cuck vibes", "score": 5, "replies": []}, {"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Love WSB so much! Last week everyone is shitting all over the Bears. Now its they won yet again.", "score": 12, "replies": []}, {"body": "Even gold and silver are dropping as hell", "score": 8, "replies": [{"body": "Yet BTC is rallying (saving my portfolio today.)", "score": 2, "replies": [{"body": "But what did make gold \"the safe harbor drop\"?", "score": 2, "replies": [{"body": "Idk. It’s odd. Looking to bonds for after rate cuts maybe?", "score": 1, "replies": []}]}]}]}, {"body": "https://preview.redd.it/p7p9y159vgdd1.jpeg?width=1284&format=pjpg&auto=webp&s=76593b028b960bee14597abde3c161169bdbd391", "score": 7, "replies": [{"body": "It seems like you’d have been up on these for a while since purchasing them? I mean before the dip?", "score": 1, "replies": [{"body": "I bought one back when it was first making the downward trend and bought at about $131 and KNEW it was going down further and purposely kept money aside to continue to buy more but did not expect it to not only go down further than I thought but actually stay in this current range for as long as it has and I thought I might as well sell them all since I needed nvda to have a literal moonshot in order to even break even so I sold but kept 20 shares", "score": 3, "replies": [{"body": "Understand now. Guh, I’m sorry. (Also down on NVDA but lower strikes and further out. Sold AMZN for a pittance.)", "score": 2, "replies": []}]}]}]}, {"body": "Ouch. Pick yourself up, dust yourself off and remember nothing is a sure thing, especially in these markets. Good luck trader!", "score": 5, "replies": [{"body": "This is not my life savings so as much as it sucks to see on a screen I know it’s not ALL my money", "score": 4, "replies": [{"body": "Good man. Agree the loss is very, very tough. It is just money though and I'm glad to see you didn't risk what you were unwilling to lose.", "score": 3, "replies": [{"body": "It’s oddly enough a small victory since the account was started this January with just 1k.", "score": 2, "replies": [{"body": "Atta boy. :) Look forward to the future gain porn.", "score": 2, "replies": []}]}]}]}]}, {"body": "At what point did you say, “maybe this isnt for me”", "score": 4, "replies": [{"body": "Nah ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/g4fboybcvgdd1.jpeg?width=1284&format=pjpg&auto=webp&s=aabc3c9c2a5e3a953a4165aa349a07b92bc190c3", "score": 3, "replies": []}, {"body": "i thought bers always lose!", "score": 3, "replies": [{"body": "This is the third time Bers have beaten me ![img](emote|t5_2th52|4267)", "score": 6, "replies": []}]}, {"body": "my port does not define me?", "score": 3, "replies": []}, {"body": "That’s not too bad for 3months.. I took a -15K option loss from Nvda in a 5day period :/", "score": 3, "replies": [{"body": "Hopefully that wasn’t your life savings because that’s infinitely worse than my situation", "score": 2, "replies": [{"body": "I still have $24K left in my stock account and 17K extra in my bank account. But dammit this is the 2nd time I dropped down from 50K down to 25K.. It’s making me quite worried", "score": 1, "replies": [{"body": "It’s definitely jarring to loose that kind of money constantly", "score": 1, "replies": [{"body": "I hope we make it back in time I think of jumping back in NVDIA before earnings.", "score": 3, "replies": []}]}]}]}]}, {"body": "Bears are the haters of the market. can't convince me otherwise.", "score": 3, "replies": []}, {"body": "My Pfizer took an absolute monstrosity of a shit on me.", "score": 3, "replies": []}, {"body": "For 3 months? Youre just bad. Everything you’re doing is wrong. Restart, or give up options ☠️", "score": 3, "replies": [{"body": "For more transparency, I DID gradually take out over 7k between late April early may but yes I agree very wrong ![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "That makes a big difference lol. Honestly, look up super trend indicator. Toss in settings 3:1 and make yourself a robot on qqq, nvda, aapl. Only buy at or in the money. \n\nShorter time frame for shorter dates contracts\nVisa versa \n\nI use daily chart and quarterly expiration. And 5 minute chart EOD/EOW expiration. But I follow the trend, and risk the same every time. End of days are never more than 5% of port \n\nSmall wins + small losses + big wins = account to the moon", "score": 2, "replies": []}]}]}, {"body": "DA BEARSSSS", "score": 2, "replies": []}, {"body": "Nice Donation history", "score": 2, "replies": []}, {"body": "Bears can’t lose when they have pussy wall st analysts balls deep in every stock panic selling when the slightest little thing goes wrong", "score": 2, "replies": []}, {"body": "Mike Wilson's 3 day of glory", "score": 2, "replies": []}, {"body": "Bears can win battles, but they never win the war", "score": 2, "replies": []}, {"body": "Wait, we were supposed to inverse the shoeshine boy?", "score": 2, "replies": []}, {"body": "China", "score": 1, "replies": []}, {"body": "Sold my nvda options and just holding 20 shares, keeping the amzn position as well", "score": 1, "replies": []}, {"body": "How do people not just DCA on blues and stay in the green", "score": 1, "replies": []}, {"body": "Didn't you just lose to things not going up a bunch?\n\n\nIt's not really bears.", "score": 1, "replies": []}, {"body": "Question for Mods:\n*is it inappropriate to just post a gif of a pride parade?*\n\n🏳️‍🌈🐻", "score": 0, "replies": []}, {"body": "Bears always win", "score": 0, "replies": []}, {"body": "Another delusional NVIDIA moonboy. Thanks for providing liquidity for my shorts. I have big gains.", "score": 0, "replies": []}]}
