{"title": "PYPL's last earnings was beast mode on an 0.83 EPS. this earnings is expecting a 0.93 EPS and the stock is lower now than last earnings. EZ MONEY CALLS TO MOON! 🚀🚀🚀", "selftext": "", "id": "yhkgt9", "created_utc": 1667151237.0, "score": 40, "upvote_ratio": 0.71, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|22|**First Seen In WSB**|1 year ago\n**Total Comments**|264|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=yhkgt9)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=yhkgt9)", "score": 1, "replies": []}, {"body": "You realize stock price also rises/falls based on the outlook they communicate at earnings right?\n\nThey could exceed their current earnings number, but if the outlook is poor, then the price will immediately fall.", "score": 48, "replies": [{"body": "What do you mean? Stocks only go up.", "score": 14, "replies": []}, {"body": "Puts on PYPL", "score": 16, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}, {"body": "Yeh like idk if they happened to lose alot of customers this quarter for some reason. Easy puts tbh when they say how many active users they lost. People not gonna like that, Netflix was the opposite and rallied hard showing how important active user base is to the markets.", "score": 10, "replies": []}]}, {"body": "Fuck paypal", "score": 78, "replies": [{"body": "Fuck paypal", "score": 42, "replies": [{"body": "Fuck then pay, Pal.", "score": 11, "replies": [{"body": "Fuck, pay then pal", "score": 10, "replies": [{"body": "Yap, Lap then kcuf.", "score": 5, "replies": []}, {"body": "Pay, pal, and then fuck", "score": 2, "replies": []}, {"body": "Fuck pal then pay!", "score": 2, "replies": []}]}]}]}, {"body": "$2500 please and thanks", "score": 6, "replies": []}]}, {"body": "Dumbest post that I’ve seen in years", "score": 26, "replies": [{"body": "You are here not very often or?", "score": 10, "replies": []}, {"body": "First time on Sort By New?", "score": 2, "replies": []}]}, {"body": "They are being dropped by numerous amounts of people after the 2500.00 charge BS. I say it dips 12-16%", "score": 52, "replies": [{"body": "How widespread is the concern outside of these forums? I haven’t seen anything mainstream on this round of changes.", "score": 16, "replies": [{"body": "Well, the sell-side analysts are bigger horse shit than these forums even and are a f-in joke.  You need to announce bankruptcy to get even half of them to downgrade to a sell rating, and even then there might be some looking for “value” on the off chance you don’t go bankrupt even if your CEO just announced you filed.\n\nOver 50 analysts had a Buy rating on AMZN with 2 Holds and 1 Sell before they plunged 20% after that last earnings as just one example.  At least AMZN is a good longterm play, but they are supposed to be focused on short term with 1 yr target prices and pull this shit for everyone, not just AMZN, and including horseshit investments.", "score": 6, "replies": []}, {"body": "I'd say small because not to many people know about it. I haven't seen it on any main stream news yet either. But a private company trying to fine people for speech not even on their platform is crazy. Huge step over just banning someone. Anyone who cares about free speech should be against this.", "score": 2, "replies": []}, {"body": "Non existent.  Only tin foil hat wearing dunces are concerned with that drivel.", "score": -9, "replies": [{"body": "Lol you’re wrong. This post won’t age well.", "score": 3, "replies": []}]}]}]}, {"body": "So buy Puts? Got it.", "score": 13, "replies": [{"body": "This is da way", "score": 7, "replies": []}]}, {"body": "F PayPal. Tried to sneak in up to $2,500 fine right out of your bank if you say something on social media they don't like.\nThey said \"it was a mistake, and no idea how it got in there\".\nIt was removed...\nGuess what. It's back in there again now. \nF PayPal.", "score": 18, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[https://www.paypal.com/ga/webapps/mpp/ua/useragreement-full#restricted](https://www.paypal.com/ga/webapps/mpp/ua/useragreement-full#restricted)\n\n\\- You acknowledge and agree that $2,500 USD (or equivalent) per violation of the Acceptable Use Policy\n\n\\- Provide false, inaccurate or misleading information.\n\n\r\n\nHow responsible they will be with this might be up for debate but they put it in there again after saying it was implemented by mistake...", "score": 2, "replies": [{"body": "Twice by mistake?..within a couple weeks...hm...", "score": 2, "replies": []}]}]}, {"body": "What a laughable misconception of the facts.  Yeah, they're going to charge you 2500 for speaking.  Get a life, trumper.", "score": -20, "replies": [{"body": "Where your calls at? 🤡", "score": 4, "replies": []}]}]}, {"body": "So buy puts. Thanks.", "score": 4, "replies": []}, {"body": "Bless his heart.", "score": 3, "replies": []}, {"body": "RIP", "score": 2, "replies": []}, {"body": "90% of earning is forecasted outlook not eps regard", "score": 2, "replies": []}, {"body": "Thanks, adding puts Monday", "score": 2, "replies": []}, {"body": "Love posts like this. Shows how out of touch someone is.", "score": 2, "replies": []}, {"body": "Going to inverse WSB on this one", "score": 2, "replies": []}, {"body": "Puts", "score": 2, "replies": []}, {"body": "PayPal = 🌙 🚀", "score": 2, "replies": []}, {"body": "People dumped PayPal and went to Venmo.", "score": 7, "replies": [{"body": "PayPal owns Venmo", "score": 17, "replies": [{"body": "People dumped Venmo and went to Wells Fargo.", "score": 5, "replies": [{"body": "People dumped one account at Wells Fargo but 3 other new accounts showed up.", "score": 3, "replies": [{"body": "For real. That shit was crazy", "score": 1, "replies": []}]}, {"body": "People dumped Paypal and went to Walmart.", "score": 1, "replies": []}]}, {"body": "For OPs sake I hope that remains a secret.", "score": 1, "replies": []}]}]}, {"body": "im in cause the boycot just started this month, it wont affect until next Q", "score": 1, "replies": [{"body": "Market is forward looking", "score": 4, "replies": [{"body": "Day to day trading isn’t. Why do you think index’s have been so volatile? WALLSTREET trades, looking to make a cent wherever they can. Markets are forward looking but traders are less so.", "score": 1, "replies": [{"body": "Earnings are very forward looking. Institutions don’t buy on profits already made, they buy on future income.", "score": 1, "replies": [{"body": "That’s true but a lot of funds don’t play that game. What do you think algos are doing all day long", "score": 1, "replies": []}]}]}]}]}, {"body": ">2:28 Yes, I predict that PYPL will increase by 66% today.", "score": -11, "replies": [{"body": "😂😂", "score": 2, "replies": []}]}, {"body": "What app is this?", "score": 1, "replies": [{"body": "Ligma", "score": 4, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "Why not post during market hours so we can trade it too…", "score": 1, "replies": []}, {"body": "It's down 63% in last year. 300 day downtrend . Inflation is high and retail buying of dumb shit has halted drastically. So paypal cant make money when people arent owing credit and they have to pay or paypal charges 50.00 late fee", "score": 1, "replies": []}, {"body": "Sold, Calls it is.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Nothing. I just bagholding and want to break even.. ![img](emote|t5_2th52|4260)", "score": 1, "replies": []}]}]}, {"body": "Buy calls after 12% gain? k", "score": 1, "replies": []}, {"body": "That's.. that's not how this works.", "score": 1, "replies": []}, {"body": "Loaded with puts to the damn old titties. Lfg", "score": 1, "replies": []}, {"body": "PE of 50x still\n\n\n#YIKES", "score": 1, "replies": [{"body": "Intel had a 10 pe last year and it dropped 50%. PE doesn't mean anything", "score": 0, "replies": []}]}, {"body": "Guys this is exactly like Game stop!", "score": 1, "replies": []}, {"body": "rip", "score": 1, "replies": []}]}
{"title": "My Full Plan for this Week 10/31 + Challenge Update (7 Earnings Plays, 1 MAJOR Economic Event (FOMC), 5 Stocks & 1 Lotto 10x Play)", "selftext": "Hello ladies and gentlemen\n\nI'm ash and write detailed DD on stocks and events, so last week I published my Full plan and analysis.In this post, we will cover\n\n* $2k to $100k Challenge Update\n* This week’s Earnings\n* This Week's Major Economic Events\n* This week’s Watchlist\n* This Week’s lotto 10 bagger Play\n\nOk so let's get this show on the road\n\n# $2k to $100k Challenge Update\n\nFor those of you who dont know, im 17 trading days in challenge where i trade live everyday, starting with $2k (actually $1.8k) and trade my way to $100k, live in front of everyone everyday.\n\n**Options Starting Amount:** $1000\n\n**Day 17 Closing Amount:** $5038\n\n**Port % Change:** 400%  \n**Proof:**\n\nhttps://preview.redd.it/m7dh205b10x91.jpg?width=1633&format=pjpg&auto=webp&s=5ecf4dece8117c832473836daf9665ea89ced868\n\n**Futures/Commodities Starting Amount:** $800\n\n**Day 17 Closing Amount:** $1500\n\n**Port % Change**: %87.5\n\nI found that people for the most are not really interested in Global/Futures plays, but if you guys want i can definitely add that to the watchlist next week. Let me know in the comments.\n\nThis week we gained big by predicting 2 main moves, the drop on the GDP release, we ran on very bad news for Feds, the drop was inevitable. And another big gainer was PCE release, got in PM into SPX calls when i saw Bullish divergence between price action and RSI and added size after PCE meet expectation as it was good news for the Feds and PCE is one of powells favorite metrics to look at for rate hikes.\n\nThe following is basically my plan for next week.\n\n# Major Economic Events\n\n**Monday 10/31**\n\n9:45 AM Chicago PMI\n\n10:00 AM Dallas Fed Manufacturing Index Oct\n\n**Tuesday 11/01**\n\n9:45 AM S&P Global PMI Final Oct\n\n10:00 AM ISM Manufacturing PMI Oct\n\n10:00 AM Jolts Job Openings Sep\n\n**Wednesday 11/02**\n\n8:15 AM ADP Employment Change Oct\n\n2:00 PM Fed Interest Rate Decision\n\n2:30 PM Fed Press Conference\n\n**Thursday 11/03**\n\n8:30 AM Balance of Trade Sep\n\n10:00 AM ISM Non-Manufacturing PMI Oct\n\n**Friday 11/04**\n\n8:30 AM Non Farm Payroll Oct\n\n8:30 AM Unemployment Rate Oct\n\nSo all these are very important events that will move the market, but the offcourse the important event is the Fed Conference on wednesday which is the only event ill playing.\n\nSo my play here is in 2 parts.\n\nPart 1 - The Rate Hike\n\nBelieve it or not the rate hike is not that important and is unlikely to affect the market that much, let me explain.\n\nhttps://preview.redd.it/owgfdped10x91.png?width=1262&format=png&auto=webp&s=a466d5bcb721e09c65cc449128a726a17b262b77\n\nAs of Friday 28Oct the market is pricing\n\n0% chance of 100Bps\n\n81.3% chance of 75Bps\n\n18.7% chance of 50Bps\n\nNow in my previous watchlist we have been predicting the rate hikes right every single time by just following the highest odds, the Fed doesnt like to freak the market. They also dont want the market to rally too much so its also unlikely that we get 50Bps, in addition to that why do 50Bps when they can get away with 75Bps without freaking out the market.\n\nIn all cases, they definitely not doing 100bps, if they do 75bps as expected we run a little (ill tell why a little later on) if they 50Bps we run alot. It seems to me for the first part the very obvious play here is calls before the rate hike, and sell on the spike for that delicious IV spiked premium.\n\nPart 2 - The Meeting\n\nWell this is where it gets very tricky, so as you may know that market has been rallying lately and thats because alot of people are expecting the Fed to pivot, or at least start talking about pivoting this time.\n\nIf they say we are pivoting the run continues at least till we hit the 200MA on the SPX 1D chart, if they we cant do that yet, we are getting new 52 week lows.\n\nThis part is easy to figure the part is figuring out whether they will pivot or not, for funsies ill give you my expectations, but honeslty im going to play it by ear. Im 50/50 on what they plan to do, and the move will be so big you can get in at time and still make $$, you can also do a straddle.\n\nAnyway Looking at the PCE report inflation is not so bad, thats why ran hard after the report was out, its not the best report in the world, but its an improvement for sure, add to that the St. Louis Fed came out with report stating the Fed is wrong to look only at CPI as it is lagging data heavily weight down with rent prices going up and that if we remove rent, inflation has actually cooled off and we are actually deflating now.\n\nThe fed doesnt want to risk deflation by forcing a recession when we dont really need to. (This is a much worse scenario than inflation, thats why the Fed is being careful)\n\nOn the other hand, GDP came out pretty damn positive, the so called earnings recession and end of the world stock market destruction is nowhere to be seen. While some growth tech companies ‘’missed’’ (most of them just lowered guidance, they didnt actually miss) most of the not so sexy companies beat. This is good for the stock market, VERY bad for the feds, this means that demand is not getting crushed, and if demand is high, prices will likely remain elevated. So all this might signal to the Fed that job not done yet, we need more pain.\n\nAs you can see there are very good reasons for the Fed to go either way, i think we get a pivot for an important reason no one is really talking about. The US treasuries the most liquid market in the world, is losing its liquidity. With UK and Japan selling US Treasures to prop up their currienses and markets and the Fed tightening and no longer buying assets this is starting to affect the treasuries market.\n\nGuys if treasure market goes no bid or crashes, 2008 + 2001 + Great depression will NOT even come close to the global collapse that we might experience. Central Banks Chairs around the world have been pestering Powell about that recently. I think they will do anything to make sure that doesnt happen.\n\nBut like i said we shall see.\n\n# Earnings\n\n# Tue 1 Nov\n\n**After Close - Advanced Micro Devices ($AMD)**\n\n* Technology/Semiconductors\n* Estimate Earnings Call Time: 4:05 pm EST\n* Estimates: EPS $0.57 & Revenue $6.7B\n* Options pricing in a 12.1% move on earnings\n* My Play: Been in this one for a while, since it reported Revenues and dropped hard but i keep selling because it keeps running. Will load some calls $62 Nov11 calls, i think a bad miss was already priced in.\n\n# Wed 2 Nov\n\n**Etsy Inc ($ETSY)**\n\n* Catalogue/Specialty Distribution\n* Estimate Earnings Call Time:\n* Estimates: EPS $.36 & Revenue $563.7 million\n* Options Activity ($100K+ Premium - 1 Month Out): No clear side dominating the options list, but the bullish premium is at 57.10%\n* Options pricing in a 16.3% move on earnings\n* My Play: Bearish Flow, im guessing because of $AMZN, but i think $SHOP and $PIN are better indicators of performance, going with calls here $99 Nov11\n\n**Roku Inc ($ROKU)**\n\n* Telecommunications/Cable and Other Pay Television Services\n* Estimate Earnings Call Time:\n* Estimates: EPS -$1.28 & Revenue $702.46M\n* Options Activity ($100K+ Premium - 1 Month Out): The bearish activity seems to be dominating this options list. The bullish premium is standing on thin ground with a premium of 50.35%\n* Options pricing in a 19.1% move on earnings\n* My Play: I still dont understand why this is not a penny stock, Grabbing $54p Nov11, Flow extremely bearish. Will hold this till $28 support\n\n# Thu 3 Nov\n\n**After Close - Carvana Co. (CVNA)**\n\n* Retail\n* Estimate Earnings Call Time: 4:05 am EST\n* Estimates: EPS -1.86 & Revenue $3.75B\n* Options pricing in a 25.3% move on earnings\n* My Play: Great Idea shit company, will be surpised if they beat earnings, taking a straddle here, with such a expected move, in the rare case it beats, i dont want to miss the 25% possible move.\n\n**Moderna ($MRNA)**\n\n* Health Care/Biotechnology\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS 4.10 & Revenue $410 billion\n* Options Activity ($100K+ Premium - 1 Month Out): A mixed list, although the big bullish bulk seeking to put on the 21st of October make it seem to be more bullish. The bullish premium is at 52.75%\n* Options pricing in a 13.7% move on earnings\n* My Play: Every Healthcare company (hell even $TDOC) beat this quarter, taking some $152.5 Calls here Nov4 exp, IV is not too high\n\n**Block Inc ($SQ)**\n\n* Technology/Computer Software\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $.23 & Revenue $4.49B\n* Options Activity ($100K+ Premium - 1 Month Out): You couldn’t really whose activity was dominating the list unless you counted them. The bullish activity, however, is in the lead with a 55.11%\n* Options pricing in a 16.2% move on earnings\n* My Play: Lots of bullish activity and lot of beats in the finance sector, going with $65 Nov11 Calls will likely hold till 1D 200MA is tested ($88) trimming on the way up\n\n**After Close - Twilio ($TWLO)**\n\n* Industrial Machinery/Components\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS:-$0.393 & Revenue 972.71M\n* Options pricing in a 17% move on earnings\n* My Play: Flow is very bullish and alot of Growth companies that got crushed in the bear market have beat expectations ($SHOP, $PIN etc..) Going with Nov11 $76 calls, also will likely hold till 1D 200MA is tested  ($110) trimming on the way up\n\n# Watchlist\n\n**- $TSLA Long**\n\nhttps://preview.redd.it/xf5d6mcf10x91.png?width=1488&format=png&auto=webp&s=d0ee3eae96a82cee42fcf3f93488dfd70d3e66a5\n\nIf TSLA continues its run, and finally break the 230 resistance, we can easily see a run to $250 level, will take calls on Monday\n\n**- $SPY Short**\n\nhttps://preview.redd.it/q96wt5pg10x91.png?width=1488&format=png&auto=webp&s=278dc0bbd5025aca467cb822a03603f7ecd7a914\n\nWhether we run or not after FOMC the 1Hr is VERY over extended, and we are due a pullback, its not going to be a sharp one likely but still could make for a nice trade.\n\n**- $PIN Long**\n\nhttps://preview.redd.it/em2jx6hh10x91.png?width=1488&format=png&auto=webp&s=754fa108ef21a21dc4a22bb0b10c6c4d855fd71c\n\nStrong beat by PINS still has room for more if it breaks the $25.9 resistance we can get $27.95, quickly, taking some call here for a possible run\n\n**- $DB Short**\n\nhttps://preview.redd.it/bt550y5i10x91.png?width=1488&format=png&auto=webp&s=20ba5802ea52e0d4b92c01b6f45dd1e765f2b507\n\nRan so much on that earnings beat, creating a short gap fill to $9.5. Its also very Overbought on the Daily chart making a nice %3 move down at least, picking up some puts as long as it doesnt move down before the open\n\n# Bonus Potential 10 Bagger Play\n\nAlright boys and girls so played this one before as 10 bagger and we got our 10 bag (and then some) But this one has more left in the tank for another run.\n\nIts NFLX baby.\n\nSo we ran hard before and on earnings securing our 10 bag ( This was my firs 10bag call on my first watchlist, check my profile for proof).\n\nNow it crossed the 200MA on the daily chart after filling half the gap so take a little rest. What we are looking for here is for NFLX to reclaims 50 and 21MA  on the 1hr time frame. Once we get we reclaim that we will continue to fill the remainder of the gap fill all the way to $330\n\n&#x200B;\n\nhttps://preview.redd.it/5fgoc8zi10x91.png?width=1488&format=png&auto=webp&s=f20f77fa437d99ebb2baab3facbe3078a58561ad\n\nAlright, so that's it for this week, ill be doing this every week and going through the previous week’s play to see how much we gained and where we went wrong.\n\nIf you have any questions let me know, none of this is financial advice, I wish you all a very green week!", "id": "yhociw", "created_utc": 1667160155.0, "score": 148, "upvote_ratio": 0.96, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|8 months ago\n**Total Comments**|61|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/y7chpu/earnings_season_50_major_company_earnings_this/) [x](https://www.reddit.com/r/wallstreetbets/comments/xbgory/my_full_plan_for_this_week_0912_2_earnings_plays/) [x](https://www.reddit.com/r/wallstreetbets/comments/xbgirb/my_full_plan_for_this_week_0912_2_earnings_plays/) [x](https://www.reddit.com/r/wallstreetbets/comments/xhrszm/my_full_plan_for_this_week_0919_2_earnings_plays/) [x](https://www.reddit.com/r/wallstreetbets/comments/x6s01x/my_full_plan_for_this_week_5_earnings_plays_2/) [x](https://www.reddit.com/r/wallstreetbets/comments/yho3e3/my_full_plan_for_this_week_1031_challenge_update/) [x](https://www.reddit.com/r/wallstreetbets/comments/yhociw/my_full_plan_for_this_week_1031_challenge_update/) \n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=yhociw)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=yhociw)\n    \nHey /u/Flimsy-Willow-3086, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "Also, he had coin up as a play initially. Any chance we can get confirmation. I want to know if he’s editing posts after misses\n\nThanks", "score": 1, "replies": []}]}, {"body": "\nI can't wait for Jpow to say bullish things and at the last closing statement he says 250 bps hike 😂", "score": 18, "replies": [{"body": "That would be a dream come true lol, ride it on the way up and down 😂", "score": 9, "replies": []}]}, {"body": "So the NFLX play, is the focus on weeklys or monthlys (if the trigger occurs of course)?", "score": 6, "replies": [{"body": "Good question I forget to mention that. Given the strength of NFLX the past month, I wouldn’t go out more than 4 weeks tops if you want to be surfer safe. I’m going with 2 weeks out calls, and will reassess from there.", "score": 7, "replies": []}]}, {"body": "Any opinion on Airbnb?", "score": 5, "replies": [{"body": "No sorry, didn’t include ABNB or UBER because I can’t find any edge on them. You can argue that because Airlines beat, ABNB will benefit from\nHigher bookings as people travel more, that’s best I got for ABNB, I’m slightly bullish.", "score": 6, "replies": []}, {"body": "Bullish", "score": 3, "replies": []}]}, {"body": "SOFI earnings Tuesday morning. Thoughts on that? I’m thinking it could be big with good results/guidance. Considering taking a lotto position.", "score": 4, "replies": [{"body": "Finance has been doing well but I worry about the fundamentals of SoFi, lotto can’t hurt 15% implied move", "score": 8, "replies": []}]}, {"body": "We were expecting a .75 hike last meeting and the print of a .75 hike at 2pm made spy drop 10$. I don’t believe in this priced in BS. Nothing is priced in.", "score": 9, "replies": [{"body": "Market pricing the rate hike is not the same as priced in these are 2 different concepts. If it was priced it, market would dump on every report that meets expectations.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "$XOM and $CRV beat earnings, they all benefited from Oil prices the last quarter, probably will beat too imo.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I’m sure as hell gonna try lol. Believe it or not this is the watered down list", "score": 3, "replies": []}, {"body": "How many of each are you thinking?", "score": 1, "replies": [{"body": "Earnings are lotto plays for me very small size 1-2 contracts tops for my account size ($5k) for my main account it’s around 5% size max.", "score": 3, "replies": []}]}]}, {"body": "Wasn’t intel earnings only good because they are going through a huge cost reduction plan? They cited weakened demand in chips and pcs which I feel like would hit Amd hard. You can say Amd fell hard on the pre released guidance which I agree with, but has also run up since then. What if they reduce their future guidance even more?", "score": 3, "replies": [{"body": "I'm feeling AMD may give a better opportunity after earnings", "score": 1, "replies": []}]}, {"body": "OP you are amazing!!!", "score": 3, "replies": [{"body": "Thank you kind Sir!", "score": 1, "replies": []}]}, {"body": "Excellent post. Loved reading every bit of it. You should start a discord so we could follow you every day. Thank you so much!", "score": 3, "replies": [{"body": "Thank you so much thats very nice of you to say means alot, i have one, its in my profile!", "score": 2, "replies": []}]}, {"body": "Bullish on amd? Bearish on roku? Thanks", "score": 2, "replies": [{"body": "Yes IMO, AMD missed rev already so that’s priced in already, Intel had great earnings, Risk to Reward favors the upside for AMD. As for Roku I’m basing that on huge options bearish activity even with the bullish last week.", "score": 5, "replies": [{"body": "Many new TVs coming with AndroidTV, or GoogleTV, whatever.  Seems like Roku is  in a difficult spot.", "score": 2, "replies": []}]}]}, {"body": "This is solid dd. Like the Netflix and AMD trades. I’ll be watching you trade this week. Nice work", "score": 2, "replies": [{"body": "Thanks man, AMD played out, NFLX no trigger yet, lets see!", "score": 1, "replies": [{"body": "Yeah I’d be nervous with any longer term calls after todays FOMC.", "score": 2, "replies": [{"body": "Couldn’t agree more, too risky. Maybe after CPI if we get good data", "score": 1, "replies": []}]}]}]}, {"body": "what netflix calls should i be getting? not financial advice", "score": 2, "replies": [{"body": "PUT YOUR HANDS UP dubweb32!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}]}, {"body": "Fun read, will consider -- thx.", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "commenting to come back to later", "score": 2, "replies": []}, {"body": "Thanks!! Ballz in on SOXL 😎", "score": 2, "replies": [{"body": "LFG!", "score": 1, "replies": [{"body": "Cashed out in time 😎 LFG", "score": 1, "replies": []}]}]}, {"body": "Thats a long post and it includes pictures. \n\nIm in!", "score": 2, "replies": [{"body": "LOL, glad you liked it!", "score": 1, "replies": []}]}, {"body": "I like your view. It is very good. However, I think FED will not talk about pivot in the next meeting because there is no sign that inflation is cooling down, 1 time data is not enough, it is a bit early because if they break the curve, they cannot compensate and all of the previous hike would be meaningless. I also look at personal savings and they are going to lower level. I think FED will hike 75 bps as expected, will not mention about coming meetings.", "score": 2, "replies": []}, {"body": "When you talk about the rate hike, do you mean the coming one (which is almost certainly 75), or the hike in December? Nice write up btw.", "score": 2, "replies": [{"body": "I was talking about today, and thank you!", "score": 2, "replies": []}]}, {"body": "Excellent post. Please keep publishing these!", "score": 2, "replies": [{"body": "Thank you, next watchlist next sunday!", "score": 1, "replies": []}]}, {"body": "I'm thinking $COIN. I don't see a scenario they beat earnings this week. What do you think?", "score": 1, "replies": [{"body": "Ok, I’m not crazy, he did have coin up as a play…", "score": 1, "replies": []}]}, {"body": "Thoughts on $YELL?", "score": 1, "replies": [{"body": "Couldn’t post it here, will post tmw about it elsewhere 100% getting in on it, love it! 50% implied move, lots of insider buying and turned around fundamentals", "score": 1, "replies": []}]}, {"body": "He had COIN as a play and removed it….so he puts up all the plays and the one he misses on he edits???", "score": 0, "replies": [{"body": "Well to be fair. Tesla didn’t play out either and he left that up", "score": 4, "replies": [{"body": "He left Twilio up and that was a miss right?  Editing anything here seems shady to me tho regardless.", "score": 3, "replies": []}, {"body": "Fair, but why edit? If you have conviction let it stand, makes you less trustworthy knowing you will only post majority gains to look good for viewership purposes", "score": 2, "replies": [{"body": "Yeah. I would appreciate leaving the winners and losers stand. People expect some trades not to work out anyways", "score": 3, "replies": []}, {"body": "TWLO is in post rn and he got that wrong.. posted wasn’t edited", "score": 1, "replies": []}]}, {"body": "Agreed, OP quit editing out your big losers.  If you lose, keep them and teach from them, if not you can’t be trusted, bc then you’re shilling how good you are when in fact you’re just the same as everyone else on here.", "score": 1, "replies": [{"body": "Are you that guy I banned from the server for being racist? \nI can’t think of any reason why you just lie like that with no proof.", "score": 1, "replies": [{"body": "Lol, no I’m not racist and when I tried to go on your discord it made me pay. \n\nMy only problem is you editing posts with your plays. I’m not here to make things up. I read when you posted it at the beginning of the week. \n\nYou didn’t think coin would hit there earnings. Would go with the options flow and buy $52p. \n\nIf someone can confirm I would appreciate it.\n\nCareful coming out and saying things that aren’t true. Never been on your discord, definitely not racist", "score": -1, "replies": [{"body": "I don’t have a paid discord that’s another lie. I don’t have a paid anything. \n\nShow me verifiable proof or be branded a liar.\n\nYou know people can just look these things up. I’m not sure How far do you think your lies will go, these are not even good lies.\n\nYou’re definetly the rasict guy I banned, you are the only  person who had a problem with anything I posted.\n\nCome on man, this is not worth it, move on with your life, do better. I know it’s fun to troll people and stuff, but you will look back on your life and regret this years from now. Trust me not worth it.", "score": 1, "replies": [{"body": "Apologies on the paid part, you are correct…I was thinking of the spy trader\n\nI stand by the coin statement", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Yeah I never had COIN up there, and I don’t edit any of my posts. I don’t understand why you are lying. Do you have any proof of your claims?", "score": 2, "replies": [{"body": "I didn’t see coin. Thought the post was solid.", "score": 2, "replies": [{"body": "I started reading his posts a few weeks ago when he started. Well thought out and laid out with dates and plays. Then after like 3 weeks he disappeared, then came back last week. His initial post had coin on it, then when I looked back after earnings it was gone. I’m not against this guy as long as he’s not editing posts to up his hit ratio. Every YouTuber is out for viewers and the more they can say they are an “expert” the more money they make from likes etc. \n\nI was all in when he started, but have become cautiously skeptical. I will start to screen shot his posts when they get put up. Just to make sure everything is on the up and up. If he doesn’t edit his posts, he’s got nothing to worry about and I’m the asshole.", "score": -1, "replies": []}]}, {"body": "I read your post when it was posted at the beginning of the week, you said you were going with the options flow on it and were buying $52p for earnings. \n\nJust be truthful, that’s all. \n\nI didn’t screen shot it because I didn’t think you would be a person to manipulate posts as the plays played out. \n\nDoes anyone have a screen shot with his $coin play from the beginning of the week?", "score": 1, "replies": [{"body": "He never had COIN in his post, he may of replied to a comment on COIN as he did ABNB", "score": 1, "replies": []}]}]}]}, {"body": "Am I wrong or are all positions in the red as of 3:00 on 11/1?", "score": 0, "replies": [{"body": "You’re wrong", "score": 2, "replies": []}]}, {"body": "Thoughts on ALRP?", "score": 1, "replies": []}, {"body": "My plan is to play the volatility on Wednesday after the announcement with Friday expiration SPY calls. I’m hoping that the next two days are fairly red. On Wednesday, I’m going to put in a order for SPY calls expiring Friday. The strike will probably be $20 or so outside of the money(probably 410). I’m hoping to snag them for $1 or $2 during the huge swings and volatility crush that usually follows the announcement.  I think we will for sure get a 75 bps hike, but Powell is under a lot of pressure from lawmakers to stop crushing Main Street with these hikes. Your treasury point is also a very valid concern.  Any dovish talk about rate reductions, which I think we will hear, will ignite a face ripper. My hope is that we fill the gap to 410 by Friday.", "score": 1, "replies": []}, {"body": "Earnings Zillow. Is this such an obvious Short/ Put or am I missing it??", "score": 1, "replies": []}, {"body": "For your play on AMD are you planning to load up tomorrow morning? Anything you're looking for prior to buying calls?", "score": 1, "replies": []}, {"body": "Dkng?", "score": 1, "replies": []}, {"body": "What do you think of 10X bagger ASTS?", "score": 1, "replies": []}]}
