{"title": "BlackRock Profit Falls 16%", "selftext": "Firm’s assets under management decreased to $8 trillion, from $8.5 trillion in the second quarter \n\nA souring market weighed on investing giant [BlackRock](https://www.wsj.com/market-data/quotes/BLK) Inc. [BLK -0.01%▼](https://www.wsj.com/market-data/quotes/BLK?mod=chiclets) in the third quarter, pushing profit down 16%. \n\nThe world’s largest asset manager reported net income of $1.41 billion, down from $1.68 billion in the same period a year earlier.\n\nEarnings amounted to $9.25 a share. That exceeded the $7.06 expected by analysts polled by FactSet. \n\nRevenue dipped 15% to $4.31 billion, above analysts’ estimates of $4.2 billion. \n\nCentral banks including the Federal Reserve are raising interest rates to try to cool red-hot inflation, adding stress to a market that is increasingly jittery over a possible recession. Stocks started the third quarter relatively strong, but soon headed lower as the Fed made increasingly clear that its rate increases are here to stay. \n\nBlackRock is a top provider of exchange-traded funds and other low-cost alternatives that track market indexes, and demand for passive investing has helped fuel the firm’s growth. \n\nBlackRock is also a large provider of actively managed investments, which include businesses like stock-and bond-picking funds.\n\nInvestors’ faith in the market declined, evidenced by slowing inflows of $17 billion, down from $75 billion a year ago.\n\nThe firm’s assets under management were about $8 trillion, down from $8.5 trillion in the second quarter. That marks the third quarter-over-quarter decline in a row. BlackRock ended last year with $10.01 trillion in assets, the first time any money manager surpassed that milestone.\n\nBlackRock’s base management fees—fees not tied to performance that the firm receives for administering fund holdings—dipped 10% from a year ago to $3.53 billion.\n\nPerformance fees from the firm’s actively managed funds fell 76% to $82 million. BlackRock said that partly reflected lower fees from a single hedge fund. \n\nIts technology remains the asset manager’s bright spot. Revenue from Aladdin, its proprietary software that helps investors manage their portfolios and assess risk, rose 6% to $338 million.\n\n[https://www.wsj.com/articles/blackrock-profit-falls-16-11665658006?st=hhy94ybpg18aped&reflink=desktopwebshare\\_permalink](https://www.wsj.com/articles/blackrock-profit-falls-16-11665658006?st=hhy94ybpg18aped&reflink=desktopwebshare_permalink)", "id": "y2x84v", "created_utc": 1665663445.0, "score": 269, "upvote_ratio": 0.97, "num_comments": 74, "comments": [{"body": "Blackrock went so heavy into China during the pandemic. I imagine those investments are fractions of what they put in, if not scattered ashes. Blackrock is also suffering from being targeted by ESG investing antagonists, who want their state funds to divest from its products.", "score": 84, "replies": [{"body": "Also one of the largest owners of real estate in the U.S.", "score": 6, "replies": []}, {"body": "You do realize that \n\n1.\tThey mostly manage passive funds \n2.\tmost of their revenue is from fund expenses\n3.\tthey likely dont have a high stake in their own funds and its mostly managed money\n\n\nSo I really don’t see the relevance with China.\n\nIt’s simply global AUM is down, so the same goes for their revenue and performance fees and of-course inflows.", "score": 5, "replies": []}, {"body": "Serves them right for investing in the authorities an Chinese economy.", "score": 3, "replies": []}, {"body": "Please provide actual information instead of just saying Blackrock went heavy into China. Which funds under BLK management invested in China, how much they invested and into what segments. Otherwise the statement is worthless.", "score": 2, "replies": [{"body": "So, in this information age you can look things up. In this case, it's as simple as Googling \"Blackrock China investments\". If I were writing an article on this topic, of course I'd supply grounding and support references, but otherwise, it's not my job to do that. If you want to send me some money to pay for my time, I'll set aside some time to write you a pro-level article, but my rate is 10x minimum wage for stuff that's not interesting.", "score": 1, "replies": []}]}]}, {"body": "[https://terminal.bavest.co/#/stock?symbol=BLK&name=BlackRock%20Inc](https://terminal.bavest.co/#/stock?symbol=BLK&name=BlackRock%20Inc)  \n\n\nDue to the macroeconomic situation, it is quite normal that even a giant like Blackrock does not perform like at the peak of the economy. Blackrock is one of the last companies I would worry about.", "score": 35, "replies": []}, {"body": "Can somebody explain the big EPS beat despite revenue and income falling? I know Blackrock does a lot of share buybacks so did this help boost the EPS or was it something else?", "score": 10, "replies": [{"body": "EPS basically accounts for net income(minus preferred) divided by outstanding shares. It means their bottom line grew. EPS grows more with there are share buybacks… that basically lowers outstanding shares. \n\nRemember, the other half of earnings is expectations. Expectations were significantly lowered from the past 2 quarters now.", "score": 0, "replies": []}, {"body": "Reduced expenses will cause higher EPS if the reduction is higher than the revenue drop.", "score": 1, "replies": []}]}, {"body": "oh no 8 trillion", "score": 63, "replies": [{"body": "They don’t make 8 trillion. That’s the AUM", "score": 56, "replies": []}, {"body": "> The world’s largest asset manager reported net income of $1.41 billion, down from $1.68 billion in the same period a year earlier.\n\nThose are the profits.", "score": 36, "replies": [{"body": "They are tied to the WEF, I hope they burn to the ground !", "score": -2, "replies": []}, {"body": "Isn’t that income, not profit?", "score": 1, "replies": []}]}, {"body": "When you comment after reading only the first line in an article…….", "score": 16, "replies": []}, {"body": "Pretty sure I saw Fink at my local Dollar General picking up some cans of Vienna Sausage and a box of expired Stuffing. Sad", "score": 8, "replies": []}, {"body": "It would be amazing if the FED don't involve them in this crash and finally the global economy find it's way out of BlackRock pockets", "score": 1, "replies": []}]}, {"body": "I hope their earnings go to zero and go bankrupt", "score": 8, "replies": [{"body": "Same", "score": 2, "replies": []}]}, {"body": "Sold BLK, didn’t even know about this. Their financials frankly suck.\n\nThat’s what I get for not doing a deep dive when I initially bought. You’d think the “world’s largest asset manager” who “owns” the world would be better.\n\nI guess all that ESG and China investment really starting to fuck Fink over.", "score": 9, "replies": [{"body": "Haha", "score": 1, "replies": []}]}, {"body": "But dang it was a nice trade from pre market to the end of the day.", "score": 2, "replies": []}, {"body": "Well the whole market fall over 20%. Unless blk make a lot short bet, their profit fall is expected", "score": 3, "replies": []}, {"body": "Pardon my ignorance but what does AUM really do? Explain like I am five please! Thanks", "score": 3, "replies": [{"body": "AUM stands for assets under management. It basically means the capital they grow for clients", "score": 27, "replies": []}, {"body": "Money going into their ETFs or other funds", "score": 3, "replies": []}, {"body": "Blackrock (all hedge funds) make their money from management fees.  A bigger pool of money  = more fees, more profits.  If people withdraw money, you have fewer AUM and make less fees, less profit.  \n\nIf you burn billions of USD in China, people withdraw money and your AUM goes down.", "score": 2, "replies": []}, {"body": "They make fees as a percentage of AUM, like how your ETF charges you an expense ratio.", "score": 18, "replies": []}]}, {"body": "Good.", "score": 2, "replies": []}, {"body": "Blackrock cares more about Larry Finks woke pervert social issues than looking after investors money, anyone with a brain would dump these lunatics asap!", "score": -1, "replies": [{"body": "Context?", "score": 7, "replies": [{"body": "They are fucking idiots. Is that enough for you?", "score": -9, "replies": []}]}]}, {"body": "BlackRock owns 4.57M shares of GWH.  They’ll be okay.  😉🤣✌️", "score": 1, "replies": []}, {"body": "Drop in a bucket for them. I’m sure market regulators will devise some strategy to get that money back and more. It will be from the wallets of retail of course.", "score": -1, "replies": [{"body": "Found the guy who didn’t start “investing” until GME/AMC", "score": 5, "replies": []}]}, {"body": "What they’re not reporting is the fact that states, like Louisiana, that have pulled all funds from BR because of the firm’s ESG stupidity.", "score": 0, "replies": [{"body": "More to follow and I personally can’t wait until they lose even more money. ESG is quite frankly dumb as hell", "score": 2, "replies": []}]}, {"body": "- Equity flows: -29b, -233b net loss qoq\n\n- Fixed income: +90b, -126b net loss qoq\n\n- 402b qoq loss, 134b in extra losses because of the milkshake dollar, down 2.2T ytd. \n\nNot looking good on the macro scale.", "score": 0, "replies": []}, {"body": "[removed]", "score": -23, "replies": [{"body": "*proceeds buying more iShares ETF*", "score": 18, "replies": [{"body": "More like getting rekt by demonic spirits they work with.\n\nCheck out the Blackrock stones of the UN etc.", "score": -13, "replies": [{"body": "Demonic spirits? Buddy, those pills the doctor prescribed? You're meant to take those.", "score": 14, "replies": [{"body": "I think he might be snorting them", "score": 2, "replies": []}, {"body": "If you know you know, if you don't you don't.\n\nI can link webpages etc but the mystic can only be understood through personal experience.", "score": -10, "replies": []}]}, {"body": "> Blackrock stones of the UN \n\nThe what?", "score": 4, "replies": [{"body": "https://steemit.com/christianity/@truth-be-told/the-occult-connections-to-the-united-nations-part-1\n\nhttps://www.google.com/url?sa=t&source=web&rct=j&url=https://m.youtube.com/watch%3Fv%3Daj2_uVFReiI&ved=2ahUKEwiQgc7Vu936AhXRa8AKHaNXB3UQtwJ6BAgOEAI&usg=AOvVaw3FtKsgP6HoGPylIWmu0Jne\n\nIt isn't \"Secret\" but it is extremely odd. This is just a sprinkle of the many bizarre connections. Enjoy.", "score": -1, "replies": [{"body": "Your first link doesn't mention any blackrock stones, I even ctrl f'd black and every instance didn't mention them.\n\nYour second link is just a youtube video of a meditation room? That doesn't seem very sinister. Oooh nooo a room to meditate that means they are evillllll. Is that what goes through your brain?", "score": 7, "replies": [{"body": "No, not even close. It's a lot to go through. If you know you know, if you don't you don't. You're not engaging with honest intentions, like most, so I won't explain it.", "score": -1, "replies": [{"body": "I'm literally responding you exactly what you sent, if a youtube video of a meditation room is all you send me then wtf do you expect me to say? The first link wasn't even related to what you said.", "score": 8, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": ">The connections with demons etc quickly is that demons act in shared material reality in fast violent ways requiring sacrifices of a sensual material nature to be satiated. The actual \"\"ruler\"\" of shared material reality is not the proposed Abrahamic God of Yahweh or whatever else you might believe, its instead \"Satan\" or \"Samael\" or an illusory veil of \"Maya\" or \"Samsara\" or \"Yaldaboath\". In all cases the defining link is that we are to be trapped within material reality and kept from achieving true Divinity. This is enforced in a greater capacity within consumerist Capitalism and hyper-media and social media and whatever else you can point to all of which are things obviously pushed greatly by Blackrock and its interests etc etc etc all of this requires exegesis each to their own.\n\nDo you not see the problem with basing your worldview (which leads you to real life hatred of a company and the people within it) on non-falsifiable claims? \n\nIf you allow this to be your worldview, you cannot be persuaded to change your mind with facts or logic. Violence will be justified in your mind based on these non-falsifiable views.\n\nDo you not understand how dangerous this is?", "score": 3, "replies": [{"body": "No. That's stupid. Why would I be violent?\n\n>You cannot be persuaded with facts or logic.\n\nActually I can if it is relevant. I'm very open to it.\n\nIt's just that most people aren't able to approach the topic on its own terms and immediately resort to \"that's stupid, crazy, haha take pills\" and are never able to actually refute or argue any of it.", "score": 1, "replies": [{"body": "You would be violent because it is logically rational under your worldview to stop Blackrock, and since you don't have the power to stop them without violence, violence would be the logical conclusion. \n\nWhat can I possibly say to refute a religious argument? How do I prove to you demons don't exist? What test can I run to show you this? This is why I said your statements were non-falsifiable. I can't do anything to refute your beliefs.", "score": 1, "replies": [{"body": "No that's absurd. Very much in line with the nature of logic people who are ignorant of the topics expressed use. All I did was write a reddit comment. I've accepted there's nothing I can do to stop the big players and have zero intention to. The eponymous \"\"they\"\" are more powerful and prepared and organised than I'll ever be.\n\n>How do I prove to you demons don't exist?\n\nYou don't.\n\n>What test can I run to show you this?\n\nNone.\n\n>I can't do anything to refute your beliefs.\n\nBecause they're based off real experience. And you don't know anything about the topics you're trying to refute.\n\nIts like me trying to refute the particularities of financial policy or whatever when I don't really understand it.\nExcept, all that stuff *is* completely made up, isn't it? Except it still affects your life to a significant degree.\n\nThe supernatural broached very broadly tends to affect at real phenomena in combination with the power of human imagination and consciousness. Just like the stock market. Its all completely imagined. Still very real.", "score": 1, "replies": [{"body": "Then you admit to making non-falsifiable statements. I cannot do anything that would change your mind about demons. You make a statement about real experience, but personal experience is not scientific. There is a reason witness testimonies are terrible. Their perceived reality often doesn't match what a video camera ends up showing to be the truth. \n\nYou believe yourself to be essentially infallible, believing your personal experience with 'demons' to be accurate and not in any way caused by mental illness or the like. But if you had a mental illness, how would you know? You need others to verify. You need to run tests. You experiment. Double blind studies. \n\nNone of which you'll do.", "score": 1, "replies": [{"body": ">Then you admit to making non-falsifiable statements.\n\nNo. You haven't the first clue of how to engage these topics. That's fine. You don't have the necessary mental framework to understand. That's fine. Don't believe me. You shouldn't. I wouldn't. I didn't. That's fine.\n\n>I cannot do anything to change your mind\n\nApparently not because you don't understand it. It's like someone with no understanding of financial theory trying to discuss it.\n\n>You believe yourself to be essentially infallible\n\nNot in the slightest. You don't know me at all.\n\nNo, I don't need to do any of that to understand reality. What a silly statement. The scientific method is a very recent concept. Brilliant for advancement in material.\n\n>You need others to verify.\n\nHave done. These things result in influence. They don't operate like spooky pop culture stuff. In reality occult practice is influence. Engineered coincidences. Etc etc.\n\nI engage in these kinds of discussions because I am genuinely open minded, and curious to see if anyone can actually make a convincing refutation but they can't.\n\nMental illness doesn't mean useful data can't be collected, by the way.", "score": 1, "replies": [{"body": "Okay, I'll bite, how do you 'engage these topics'?\n\nPlease tell me what is wrong with this logical chain I have.\n\nUser AG states demons exist.\n\nUser NI requests evidence of demons.\n\nUser AG unable to provide, reverts to personal experience argument.\n\nUser NI concludes demons unfalsifiable. \n\nUser AG states that conclusion is incorrect.\n\nUser NI questions why.\n\nUser AG provides no information on why it isn't.", "score": 1, "replies": [{"body": "Boarding plane. I will respond to you when home.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "No wait, go back to the part where you said you wouldn't explain it.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Short it.", "score": 4, "replies": []}, {"body": "There are so many reasons to legitimately dislike Blackrock and it's business practices, like their predatory home acquisition scheme. But you...you went with occult mysticism and demonic spirits.", "score": 3, "replies": [{"body": "You not understanding it doesn't make it go away.\n\nThe opposite, actually.", "score": 0, "replies": [{"body": "I completely agree, tell me more about the occult demons. How far up does this go? Was Jeffery Epstein possessed by the demons so the Vatican had him killed? Did Apollo find moon demons? Is that why we never went back? I'm enthralled, tell me more.", "score": 3, "replies": [{"body": "Suck my sweaty balls.", "score": 0, "replies": []}]}]}]}, {"body": "Short it.", "score": 1, "replies": []}]}, {"body": "Profits down big but somehow up over 6% today", "score": 1, "replies": []}, {"body": "Big loss. Makes sense why they’re up 7%", "score": 1, "replies": []}, {"body": "So if the stock market and its assets drops by 20-25% and yet blackrocks assets only dropped From 8.5 to 8 trillion which is 6.25% to me that is Fking amazing.", "score": 1, "replies": []}, {"body": "8 trillion of AUM and just 1.41bn in revenue? How is that possible?", "score": 1, "replies": [{"body": "8 trillion of other people's assets under management... they only make only a few bps on that money...", "score": 1, "replies": []}]}]}
{"title": "I hate this market", "selftext": "I’m glad I’m a loser that still lives with his boomer father with no mortgage or outstanding debt to inherit, y’all are completely SOL in the future…how does having the highest inflation in 40 years of US market history not trigger a correction. \n\nInstitutions are making you poorer while they get richer. \n\nBuy real estate or real property. Electronic trade confirmations only do so much to pad your wallet.\n\nAgain days like these kill people’s “faith” in the market, secret time it’s manipulated by people much more conniving and evil than you or me.\n\nGood luck navigating the hellscape that is the “stock market”.", "id": "y35pda", "created_utc": 1665684935.0, "score": 12, "upvote_ratio": 0.59, "num_comments": 71, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|2 years ago\n**Total Comments**|6|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y35pda)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y35pda)", "score": 1, "replies": []}, {"body": "Sir, this is a casino. Stop your bitching and join us.", "score": 65, "replies": [{"body": "There are more fundamentals in casino plays than today’s market move", "score": 2, "replies": []}, {"body": "Oh I’m a benefactor of the GameStop debacle but the market has been stingy since. Fundamentals mean nothing in the face of media manipulation and dark pool investing.", "score": -36, "replies": [{"body": "Fundamentals of gambling![img](emote|t5_2th52|4271)", "score": 10, "replies": []}]}, {"body": "Sir this is the dumpster behind the Wendy's", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "![img](emote|t5_2th52|4270)", "score": 3, "replies": []}, {"body": "Well my mother walked out on our family after 30 years of marriage and me being an only child kinda can’t leave the big man hanging like that alone, but that’s a different can of worms.", "score": -2, "replies": [{"body": "Leave the man so he can bang b*tches off tinder", "score": 13, "replies": [{"body": "Op is recruiting the tinder bitches then dad answers the door and fucks them. He’s a good boy", "score": 3, "replies": []}, {"body": "Finally someone who gets it 😩", "score": 1, "replies": []}, {"body": "This right here. Let the man cope with cocaine and tinder hoes", "score": 1, "replies": []}]}]}]}, {"body": "A lot of people have enough money to buy stocks, but not enough to buy any kind of real estate in a place they have any kind of a connection to.", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "Not necessarily true it takes a lot less than you think to get a mortgage", "score": -1, "replies": [{"body": "Median household income is $70,784. Plug that in to an affordability calculator [https://www.zillow.com/mortgage-calculator/house-affordability/](https://www.zillow.com/mortgage-calculator/house-affordability/), and you get a house for $247,000. Median house price is now $440,300.", "score": 1, "replies": [{"body": "Skewed because of places like NYC. You can find plenty of very nice homes in the suburbs or country in the US with $250k.", "score": 6, "replies": [{"body": "Which is why I said in a place they have any kind of a connection to. I live in Switzerland where this effect is amplified to the max, median house prices in Zurich are around $1.8 million, wages are around $6500/month.", "score": 1, "replies": []}, {"body": "Median house price on longisland is 500k", "score": 1, "replies": [{"body": "Look at the surrounding areas and add in that the northeast is far more expensive than the south and midwest in general for example. Again, the median being over 400k is skewed because of areas like that. My house would be worth easily triple in Denver.", "score": 1, "replies": []}]}, {"body": "I mean technically it could be argued that median household income is skewed because of hcol areas as well. Pickings start getting slim for a house big enough for a nuclear family when your working budget in a lcol is in the 150-200k range.", "score": 1, "replies": [{"body": "That's exactly what I'm getting at.", "score": 1, "replies": []}]}]}, {"body": "Fuck your calculator I live in colorado the median home price in my area is 700k average apartment is near 1500$ a month with the first time home buyer aid I put 3.5% down for my house was 10k with fees I make the median income and pay slightly more than what I would at an apartment you’re lying to yourself", "score": 2, "replies": [{"body": "When did you purchase your house? Interest rates have doubled this year.", "score": 1, "replies": [{"body": "I locked in my rate about 6mo ago just under 5% not the best but doable for me", "score": 1, "replies": []}]}]}]}]}]}, {"body": "R/thetagang thanks you for your contribution", "score": 6, "replies": [{"body": "And really they’re just the cleaner fish feeding off the scraps that shed off the real players, who are the market makers.\n\nHonestly, what do people think happens when everyone decides they’re a genius who’s gonna buy puts because the market is obviously going down?", "score": 1, "replies": []}]}, {"body": "Learn market mechanics. The SPY/SPX 350/3500 puts were sold off which makes the price pop. Now is a decent time for 30-60 DTE 360 or 355 puts, but we may go up to 373-380 so don't go all in at once.", "score": 7, "replies": [{"body": "This but I am waiting a bit longer. Could see 4k or 4100 if tech earnings are decent.", "score": 1, "replies": []}]}, {"body": "\"ow does having the highest inflation in 40 years of US market history not trigger a correction.\"\n\nIt HAS triggered a correction lol. SPY down almost 25% YTD and almost 8% over the last month.\n\nGreen days happen sometimes even in bear markets. You're mad you can't predict daily (or in this case, hourly) moves.", "score": 6, "replies": [{"body": "I don’t understand why this sub seems to ignore this, it’s forever “the correction /downturn is coming11!1!!”, all the while we’re in a full-fledged Bear Market, with broad indices down 20-35% this yr. The Dow hit a 52 week low this am, the NASDAQ and S&P are at 2 yr lows.", "score": 7, "replies": []}]}, {"body": "Things haven't been super good for American people in the last decades, still the market roared.\r  \n\r  \nSince 1971 education, food, housing, healthcare to name a few, became more expensive while wages lagged.\r  \n\r  \nUS is a nice prison for consumers. Markets like that.", "score": 11, "replies": []}, {"body": "Show us on the option chain where the scary dark pools touched you.", "score": 4, "replies": []}, {"body": "You say buy real estate or real estate property like it's as simple as buying a loaf of bread", "score": 5, "replies": []}, {"body": "But did you die?", "score": 3, "replies": [{"body": "I did....but fortunately I lived", "score": 1, "replies": []}]}, {"body": "Just shut up and post your loss porn", "score": 3, "replies": []}, {"body": "Puts got wrecked?", "score": 3, "replies": []}, {"body": "Stock market as a raw number goes up. Invest in a good index fund and leave it alone for the next 30 or 40 year. Most likely it'll be up 10% a year give or take. \n\nNow if you want to Day Trade Stonks, well thats just gambling. Sometimes you are way up and some times you are left holding the bag. Looking at you blackberry. So pull up a chair my dear friend maybe you'll buy yourself a Tesla, maybe you'll have to give your wife's boyfriend a handy behind the Wendys. Either way it'll make a good story.", "score": 5, "replies": []}, {"body": "“No”", "score": 2, "replies": []}, {"body": "Oh please, SPY $17 gain in one day makes perfect sense.", "score": 2, "replies": [{"body": "It does actually.", "score": 1, "replies": []}]}, {"body": "Today was just funny. You gotta remember.  Its all transitory lol", "score": 2, "replies": []}, {"body": "man, you lost big huh. It's okay, first time stings the hardest.", "score": 2, "replies": [{"body": "I lost $120 haha, lost $20k last year I’m just here to build my tax write offs for life ya know?", "score": 0, "replies": [{"body": "sure, sure", "score": 3, "replies": []}]}]}, {"body": "If you take an underlying like SPY, there’s good liquidity, tight spreads, and people are free to take either side of the trade. Just because the movement is sometimes unintuitive, that doesn’t mean it’s a conspiracy.", "score": 2, "replies": []}, {"body": ">how does having the highest inflation in 40 years of US market history not trigger a correction.\n\nbecause the market is still holding out hope for a Fed pivot if my guess. Believe me we are getting closer to crashing into the wall.", "score": 2, "replies": []}, {"body": "have you seen the one year chart on spy? 40 years of inflation has triggered a bear market. Nothing changes from todays report a .75 bps was already priced in", "score": 2, "replies": []}, {"body": "You do understand that people that aren't living with their dads just constantly buy more while it's going down and even when it goes up ![img](emote|t5_2th52|4735)", "score": 1, "replies": []}, {"body": "It's not a hellscape, it's a market. Nothing goes up in a straight line or down in a straight line. If you play options, you are almost certainly going to lose it all. The market is no manipulated, it's based purely on emotions. Almost EVERYTONE was bearish the last few weeks. Talk about a buy the rumor sell the news on CPI. Smart shorts covered, and late shorts got squeezed by buy the dippers.   \n\n\nPeople who take a short term view of the market are destined to leave it.", "score": 1, "replies": []}, {"body": "Too many people bought puts, they had to pump it so most would panic sell 🤷‍♂️", "score": 1, "replies": []}, {"body": "It’s all Traps", "score": 1, "replies": []}, {"body": "Imagine bragging about living in the basement", "score": 1, "replies": []}, {"body": "Any bounce is a head fake, locked and loaded with puts", "score": 1, "replies": []}, {"body": "Emotions and puts", "score": 1, "replies": []}, {"body": "Correction??????\n\nWe've been in a bear market since June and a correction for a few months before that.", "score": 1, "replies": []}, {"body": ">Again days like these kill people’s “faith” in the market, secret time it’s manipulated by people much more conniving and evil than you or me.\n\nYou're just now figuring this out?", "score": 1, "replies": []}, {"body": "Market bled the all week till today. The CPI numbers were already priced in buy this morning.", "score": 1, "replies": []}, {"body": "If you look at the global housing market, this is the wrong time to invest in property!", "score": 1, "replies": []}, {"body": "Haven't you figured it by now ? It's all controlled by daddy. when he feels like pumping your young boy hole , he will. And when he's finished blowing out your hole, he'll take a break for a while.... Then do it again, unexpectedly.. whenever he's in the mood to blowout a tight hole.", "score": 1, "replies": []}, {"body": "“Buy real estate and real property” is only good advice if you also have a Time Machine back to 5 years ago for buying it. As much as you hate the current stock market, the real estate market is its own breed of awful for investors right now.", "score": 1, "replies": []}, {"body": "Market has been selling the rumors of a bad inflation number. This was buy the news and massive short covering. Let’s see how long this bear market rally last", "score": 1, "replies": []}, {"body": "Never trade the cpi day", "score": 1, "replies": []}, {"body": "The market goes in, the market goes out, you can’t explain that", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "My bro.\nIt should go down, but it didnt, so long it.  It went up but it didnt, so short it.\nThis is las vegas baby.  And to las vegas comes 2 types of people, the gambler and the owner of the casino. If you have an edge, you are the owner of the casino.  Just one loss in a big sample of plays,netting positive. \n(Market wizards and Master the trade )", "score": 1, "replies": []}, {"body": "Why would you inherit debt? What third world country do you live in? Where I live if an estate has a negative net worth the result is that nobody inherits anything but you don't have to pay because your parents are bad with money.", "score": 1, "replies": []}, {"body": "I started with zero dollars 9 years ago now I have 200k invested I will never stop investing", "score": 1, "replies": []}, {"body": "i love the new leftist bears that are going to get totally left behind when this shit takes off again", "score": 1, "replies": []}]}
