{"title": "SolarCity stock soars 26% on Tesla acquisition bid", "selftext": "", "id": "4p7133", "created_utc": 1466544046.0, "score": 64, "upvote_ratio": 0.91, "num_comments": 90, "comments": [{"body": "[deleted]", "score": 86, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I also believe this link will be useful for explaining the situation:\n\nhttp://en.wikipedia.org/wiki/Ponzi_scheme", "score": 11, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}]}, {"body": "He fucked himself", "score": 3, "replies": [{"body": "So is he fucking himself or is he sucking his own dick? ", "score": 1, "replies": [{"body": "He's having his dick and eating it too.  And everyone knows you can't do that, so I haven't invested.", "score": 1, "replies": [{"body": "That makes sense to me. I bought it at 219. I'm holding it ", "score": 1, "replies": []}]}]}]}, {"body": "top kek", "score": 4, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.3178  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/64704)", "score": 1, "replies": [{"body": "Bueller. He's just buying cheap and praying to god he'll find cash wherever his next fucking rocket lands. ", "score": 4, "replies": []}]}]}, {"body": "An unprofitable company with a ton of debt buys another unprofitable company with a ton of debt. Nice, this will be wsb's new darling.", "score": 53, "replies": [{"body": "Honestly, TSLA under $200/share is really hard to not buy. Have the past three years of TSLA volatility not taught you anything? It's a beautiful fucking stock; fanboys hop on the hype train and then shit their pants and panic sell everytime the price drops more than 1% in a day.\n\nIf you can stomach a possible drop back down to $160 ... $190 is a nice entry point to get back up to $250 within the next few months (unless of course the global economy finally melts down like we've been waiting for it to do)", "score": 21, "replies": [{"body": "TSLA gives away their technology (no ip) he wants to make the world a better place, he's not shareholder friendly. Hell he's even come out before saying TSLA is over valued.", "score": 18, "replies": [{"body": "He's justified the patent release as a way to facilitate infrastructure development that would make the market more electric car friendly (e.g., I've not seen a single charging station for any brand of car in person in my fucking entire life ... I cannot buy a fucking TSLA if I can't charge it anywhere but my own house).\n\nHe's definitely not shareholder friendly. I own zero Musk stocks right now because he's such a fucking douche canoe.\n\nHe said it was over-valued when it was up at $260 or so, he also said that TSLA is the next AAPL.\n\nMy take away right now is that if you buy at $190, you're going to have some nice looking gains within the next couple of months. Go ahead and remindme this :)\n\nI'm not buying TSLA though, I'm just saying it's a good buy at $190, Musk pissed on my face too many times. Plus when he dies of stress induced heart failure, all his shareholders are going to commit suicide. ", "score": 14, "replies": [{"body": ">next apple, implying it will be throwing shit on the wall for 20 years until something sticks.\n\nThe real race is autonomous vehicles by 2020-25, not electric, IMO. Tesla doesn't hold many IPs in the industry but certainly has the current best implementation of it.\n\nElectric cars will ownly work (mass acceptance) once we work out rapid car charging (under 30mins, full charge). My money is on Samsung making that breakthrough in mobile devices and porting the technology to automotives.\n\n\nEDIT: spelling ", "score": 6, "replies": [{"body": "I really think the breakthrough will be in third party companies equipping normal non-autonomous vehicles with autonomous sensors and controls. This is by far the cheapest and lowest barrier of entry model and Uber/Lyft would be able to revolutionize the individualized transportation industry", "score": 1, "replies": [{"body": "so buy MBLY? ", "score": 1, "replies": []}]}]}]}, {"body": "\"Wants to make the world a better place\"?!  Lolz.  He's shooting for major gainz.", "score": 1, "replies": []}]}, {"body": "I see it more as a short candidate. It's a buy in 140-160 range.", "score": 5, "replies": []}, {"body": "Dilution but then again fanboys. Fuck this is hard.", "score": 3, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Debtception?", "score": 4, "replies": []}, {"body": "Savage", "score": 1, "replies": []}, {"body": "it wasnt before?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "congrats. youre now an official member of wsb, where idiots gather to lose money.", "score": 8, "replies": []}, {"body": "Start a service annoucing your trades.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Another excellant call! Fuck me for being AFK. Keep'm coming.", "score": 2, "replies": []}]}]}, {"body": "Don't worry, this is a good sign for TSLA long schlongs.", "score": 6, "replies": [{"body": "Buying a failing solar company that bleeds many tens of millions per quarter? Explain", "score": 6, "replies": [{"body": "Elon Musk is a Christ-like genius who invests in revolutionary technologies that only 18-34 year old males can comprehend.", "score": 39, "replies": [{"body": "I'm definitely an Elon fanboy, but this is hilarious. ", "score": 11, "replies": []}, {"body": "No doubt.  I mean, an ELECTRIC CAR!!!?!  Wow.  Just... wow.", "score": 1, "replies": []}]}, {"body": "It still bleeds less than my girlfriend on her period", "score": 4, "replies": []}]}, {"body": "My Tesla boner is so hard right now\n\n\nLONG and STRONG and covered with throbbing veins, oh yes", "score": 1, "replies": []}]}]}, {"body": "So that's why they kept releasing bad news and making the company look like shit for the last year.  It went down from what?  60?   Now he buys at discount and watches value grow again?  Genius.", "score": 17, "replies": [{"body": "And the way they fudged those numbers to show -$800M free cash flow - amazing.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I know right? Although I think he got poorer overall due to the decrease in TSLA's market cap.", "score": 3, "replies": []}]}, {"body": "My entire portfolio is currently in SCTY. I nearly creamed myself while I was watching the news and running on the treadmill. The girl in yoga pants jogging next to me wasn't impressed with the sounds I was making. But I gave no fucks as I held a shiteating grin, and began picturing the yachts I'll be shopping for.", "score": 14, "replies": [{"body": "What channel was this announced on?", "score": 1, "replies": [{"body": "I'm sure a few networks were reporting it, but my gym's only financial channel is CNBC.", "score": 1, "replies": [{"body": "Nice baby boi", "score": 1, "replies": []}]}]}]}, {"body": "I just got both AHs\n\nTSLA @ 189.1\n\nSCTY @ $24.2", "score": 13, "replies": [{"body": "Nice job on TSLA.", "score": 6, "replies": []}, {"body": "got in at 192.... lets see where this goes now.", "score": 5, "replies": [{"body": "good luck pal!", "score": 2, "replies": []}]}, {"body": "and how are you buying AH? ", "score": 0, "replies": [{"body": "He has a real broker.", "score": 26, "replies": [{"body": "So he just calls up Lloyd Bankfein?", "score": 3, "replies": [{"body": "Bud fox", "score": 2, "replies": []}]}, {"body": ">real broker\n\nDoes RH count? Kidding only faggots use RH\n\nFaggots", "score": 1, "replies": []}]}]}]}, {"body": "RIP the $200 strike puts I sold on TSLA.", "score": 7, "replies": [{"body": "Quick, order a TSLA to drive the price back up!", "score": 8, "replies": []}, {"body": "Some fine lube should ease the pain....", "score": 3, "replies": [{"body": "Astroglide, KY Jelly, or Boy Butter? ", "score": 1, "replies": [{"body": "Car battery acid", "score": 2, "replies": []}]}]}]}, {"body": "How long before CNBC realizes they put the ticker as TLSA?", "score": 6, "replies": [{"body": "As soon as creamer buys the wrong stock bc of this", "score": 5, "replies": []}]}, {"body": "be prepared for some SCTY bear raid market manipulation\n\nsome big names got shorts to cover", "score": 11, "replies": [{"body": "it is gonna be pretty wild tomorrow and all the way to friday", "score": 3, "replies": []}, {"body": "BIG NAMES...who was the guy who recently came out with the huge short position? ", "score": 3, "replies": [{"body": "chanos, net worth 1.5B", "score": 10, "replies": [{"body": "Yea, that guy, he's gonna be pissed.  Didn't Elon also buy a ton of the stock a little bit ago?  Haven't they been releasing bad news for like a year bring the price down?  ", "score": 2, "replies": [{"body": "Nah, he has an even bigger short on Tesla. In combination he made a huge profit. ", "score": 2, "replies": []}, {"body": "Is he pisssed?", "score": 1, "replies": [{"body": "Yea, he's not happy at all.  Pretty much staging a coup and calling Elon a bullshit artist.", "score": 1, "replies": [{"body": "Then I guess I'm in good company.  I've been calling Musk a bullshit artist for quite some time.", "score": 1, "replies": [{"body": "nah...that guy is a butthurt bitch", "score": 1, "replies": [{"body": "That could be, but Musk is still a major con man.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "More likely than if you had asked me 2 hours ago", "score": 5, "replies": []}, {"body": "You are going to get a hard lesson in liquidity. Welcome to $0.00 bid territory.\n\nEdit: Even worse, the ask will probably be something BS like $4.80 and your \"mark\" may show up as having a value of $2.40, but the reality is that they will be $0.00 or close to it. \n\nSpeaking from experience. If you have any bid/ask spread at the open go for the best price possible. GFY", "score": 3, "replies": []}]}, {"body": "What happens to people who own massive short positions? Do you have to cover and return the shares or can they just wait and buy back TSLA shares whenever?", "score": 2, "replies": []}, {"body": "Sold SCTY yesterday.\n\nwoops", "score": 2, "replies": [{"body": "Ouch", "score": 1, "replies": []}]}, {"body": "Those october OTM calls I have on SCTY are looking pretty good now", "score": 2, "replies": [{"body": "Are they ITM now?", "score": 1, "replies": [{"body": "Yes.... lucky me.", "score": 1, "replies": []}]}]}, {"body": "So Ponzi scheme? Why Ackman doesn't have his Jew claws all over this?\n", "score": 2, "replies": []}, {"body": "GOD DAMN IT there go my fucking calls", "score": 1, "replies": [{"body": "At least you'll lose less money than those who own TSLA outright.", "score": 3, "replies": [{"body": "Yes, thank god I didn't do that. I had been eyeing it but it seemed like it was still crawling downwards.", "score": 1, "replies": []}]}]}, {"body": "Well, good thing I didn't short this yesterday.", "score": 1, "replies": []}, {"body": "I'm wondering whether to hang on to my SCTY shares in the hope that I'll get TSLA stock. I'm not very keen on TSLA but my SCTY cost basis is 10$/sh, so I'm willing to gamble on Musk's crazy ambition working out.", "score": 1, "replies": []}, {"body": "Ugh sold my shares yesterday morning like an idiot...did they put up that suicide hotline yet?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "While I don't think it's 0%, I agree it probably won't go through.  Any idea when they'll be voting on it?", "score": 1, "replies": [{"body": "Yeah I thought about editing the figure upwards to 25%, but this being WSB [land of wild assumptions and guesses], I'll just leave it as is. It will likely be at least a month before a vote is distributed, from my experience in past buy outs/mergers these things move slowly", "score": 1, "replies": [{"body": "[Looks like you're right](http://www.reuters.com/article/us-solarcity-m-a-tesla-idUSKCN0Z72WP)\n\nPlenty of time for TSLA shareholders to evaluate Elon the Great's claims that there won't be a negative impact to cash flows.", "score": 1, "replies": [{"body": "Something I didn't account for is that TSLA may have a dual-class share structure which would allow one person to keep voting control even without majority economic ownership...so Elon may be able to approve his own deal O_O\n\nThat is, if Musk didn't merely float this TSLA-SCTY deal to burn SCTY shorts. Musk is a big fan of taking to twitter/media to pump his company\n\nI'm going to have to look into this further", "score": 1, "replies": [{"body": "He's said he won't be voting, but [good luck](http://s125.photobucket.com/user/Paladinramoth/media/TinFoilHat.jpg.html) on your DD.  \n\nPersonally, I'm just hoping TSLA moves dramatically one way or the other - either tanking because clearly Elon's lost his mind, or recovering because a deal like this will never happen.  The current lack of volatility is killing me.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why isn't it jumping to 26?", "score": 1, "replies": [{"body": "I will trade you a dollar for a dollar.  maybe.  next month.  Deal?", "score": 2, "replies": [{"body": "Tempting.   ", "score": 1, "replies": []}]}]}]}
