{"title": "10k account looking to wheel for 1% per month", "selftext": "Finally have saved enough to start a decent wheel. Looking at trying to clear 1% a month. Any thoughts on stocks to trial. \n\nLooking at KDP, PFE, SOFI", "id": "1f7cesc", "created_utc": 1725297787.0, "score": 49, "upvote_ratio": 0.8, "num_comments": 95, "comments": [{"body": "I'm largely an ETF guy, so here's the list of stuff under $100 with highly liquid options:\n\nBITO (76.35% yield), KWEB, URA, SLV, FXI, EWZ (6.12% yield), EWG, EWU (3.64% yield), GDX, GDXJ, TAN, EEM, XLRE (3.56% yield), ARKK, XLF, EWW, INDA, KRE, XME, TQQQ (leveraged), EWJ, USO, XLU (2.91%), XRT, XLP (2.82%), XLE (3.13% yield), TLT (3.89% yield), IYR.\n\n(I probably wouldn't advise playing TQQQ as a \"cut your teeth on\" underlying due to its being leveraged, nor probably BITO, which has /BTC rollover risk/erosion).\n\nMy general advice for smaller accounts (hey, we've all been there) is to not wheel, but rather take a different strategic approach and that is defined risk nondirectionals (e.g., iron condors, iron flies).  Doing things this way allows you to budget trades with a preset risk built into them and allows access to instruments that you could not ordinarily play with the wheel.  Relatedly, defined risk allows you to have a far more diverse set of trades on in different underlyings at any one time than the wheel would.\n\nA three-wide, after all, is a three-wide, regardless of the instrument it's in, so that you can play everything from SPY and QQQ (which your account is far too small to wheel) down to $20 underlyings without having to navigate troublesome meme/quasi meme stocks with sketchy strike availability and/or non-robust term structure (i.e., no weeklies, limited monthlies) or having to gravitate toward quasi-meme sub-$20 stocks with high IV because that is the only thing you can afford to play.\n\nIn my experience, the general progression of things from a smaller to a larger account should be (a) narrow defined; (b) wider defined; (c) naked; (d) multiple nakeds (with various other tools in the tool kit deployed when it's appropriate and where the setup makes sense for your account size).", "score": 177, "replies": [{"body": "This person did a lot of work for you, OP. This is an amazing answer.", "score": 59, "replies": [{"body": "Yes! They did - thanks for calling it out 👍", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "BITO has nice dividends but option premiums and volumes are low. What was your strike for CSP and CC?", "score": 3, "replies": [{"body": "I’m currently wheeling BITO - around 0.2 delta which currently translates to 17.5-18.5 for CSPs and 22 for CCs - weeklies and biweeklies", "score": 0, "replies": [{"body": "CCs at $21 are $3-$5 in premium. I guess you’re just holding it for the dividends?", "score": 1, "replies": [{"body": "My current cost basis is around 20 - so anything above that based on IV and OI in the 7-15 DTE range works. I’m a serial wheeler… so dividends are just a bonus 😀", "score": 2, "replies": []}]}]}]}, {"body": "It will be equally as tough on the CC side when BTC rally's for 12-18 months. Im playing BITO on leaps personally as just a leveraged proxy trade for a bullish q4-24 through end of 25 on BTC. Not sure when the real bull market will hit ( maybe never) but if so it has one of the best risk rewards I have seen.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not in actual practice. On the past run up in Q4 and Q1 2024, my leaps positions did almost a 10X. Im positioned in again for another rally sometime between now and Jan 2026. If im correct that this happens at some point during that time frame, the position could easily do another 2x-20x depending. But understand this is a relatively small position and not a core part of my accounts. Hence why I say the risk/reward is so good. Less than a 5% position helped my overall account do 100% last year. If it does so again, great but if not the most of a drawdown I can see is roughly 5% overall.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "it really depends. I have a wide range of strikes that I legged into from ATM and OTM out all the way to the highest priced available at the time I bought them for the Jan 2026 exp. You get bigger returns with far OTM if rally several deviations from expectations. But obviously there is a less likely chance of those do as well overall.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I agree - ETFs are better than individual stocks as there’s a lesser risk of them going down to 0", "score": 2, "replies": [{"body": "I’ve never heard of someone wheeling with cash settled instruments", "score": 0, "replies": [{"body": "You mean SPX/NDX/XSP? I think it can be done, but for me, the premiums are not juicy enough. Plus, with cash settled options, the losses are realized immediately. I would rather get assigned shares so I can sell CCs on them until they’re above my cost basis.", "score": 2, "replies": [{"body": "Yes exactly I would think you can only wheel by getting assigned then selling covered calls to collect premium", "score": 2, "replies": [{"body": "Yeah, but people do variations of the wheel like just selling CSPs or selling naked puts/calls/strangles. This can be done with futures as well.", "score": 2, "replies": [{"body": "Nice did not know this. What is the goal doing it this way? I’m assuming just hoping nothing changes / low vol speculation. But now I am wondering where does the name “wheeling” come from", "score": 1, "replies": [{"body": "Yep, that’s right. Wheeling in the strictest sense does involve getting assigned something and then recycling it. But there can be variations of it. Some people avoid assignment like the plague. They keep rolling for as long as possible. Another variation is with futures options like /MES. You can play the regular wheel, but you’re assigned 1 contract (not 100 shares). Plus, these options have quarterly expirations. So if you’re holding your position until then, it will be cash settled.", "score": 1, "replies": [{"body": "Isn’t this concept just rolling and not wheeling", "score": 1, "replies": [{"body": "Rolling until assigned…then wheeling", "score": 1, "replies": [{"body": "I see what u mean now; then it would make sense for the underlying to not be cash settled because without the covered call premium on the underlying shares it’s just rolling", "score": 1, "replies": [{"body": "Or am I also misunderstanding this part", "score": 1, "replies": [{"body": "If you break a wheel 🛞 into two halves, think of a naked short strangle for a cash settled instrument as the two pieces of the broken wheel - it cannot function as a single unit, but still part of the wheel and will require maintenance as two separate components of the wheel.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "but this is not wheeling, neither any sort of wheel. It's some other (short) options strategies.", "score": 1, "replies": []}]}]}, {"body": "They are cash settled. Ie. impossible to wheel as there is no assignment. You can of course write puts. At the end, you can either roll or cash settle; there is no assignment so you cannot enter the covered call phase as such.", "score": 2, "replies": [{"body": "Yep, agreed. You can sell naked calls as well in a similar manner.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ya bito is tricky, you get slaughtered if you miss the dividend", "score": 2, "replies": [{"body": "Yep.  Only with the dividend have I not been net-net losing money on my covered calls.  Without the dividends, I would be quite a bit down ... .", "score": 1, "replies": []}]}, {"body": "ES/NQ is also an alternative", "score": 1, "replies": []}, {"body": "I've been trading options for years and I'm saving this. Great ideas (and very good advice)!", "score": 1, "replies": []}, {"body": "Yes yes yes also instead of holding cash \nI would hold a large majority in sgov your  getting 4-5% in dividends right there doing nothing", "score": 1, "replies": []}, {"body": "Can you explain wider defined? I'm assuming it's scaling the narrow defined by widening the strikes?", "score": 1, "replies": [{"body": "Moving from an iron condor with 3-strike wide wings to 5-strike wide ones, for example.", "score": 1, "replies": []}]}, {"body": "IC and IF trades are almost always a losing proposition except in times of higher IV and playing for a decrease in volatility. Neutral spreads will almost always get tested one way or the other. People tend to over manage them and get whip sawed. If Vol was med to low when initiating them, they can become losers pretty quickly and rolling becomes difficult to do for a profit. They are fine as a learning tool, but saying they are a good way to build a small account is wrong  IMO. Id much prefer someone with 10k just buy and hold and dollar cost average with extra funds along the way. Maybe continuing to learn or paper trade until getting to 30k+, 50-100k would be better to really start wheeling the liquid ETFs. At 1% per month on 10k if everything goes to plan you only have 11200 at the end of the year and if in a taxable account, you owe a couple hundred to taxes plus the pain of taxes as an active trader. Not really worth the effort when just DCA approach would probably get similar results with no effort and no taxable event.", "score": 1, "replies": []}, {"body": "Say one has a ~60k account, is it inadvisable to wheel with 100 shares of SPY on that?", "score": 1, "replies": [{"body": "If that is your entire portfolio, then probably not wise to throw it all into one trade but if it is a smaller part, then I don't see why not. Another way to collect premium would be PMCC, which is what I am currently doing even though I could wheel SPY.", "score": 5, "replies": []}]}]}, {"body": "Finally someone with a realistic return in mind.  But let me ask, is this for income that you *need* monthly ? \n\nOtherwise you're going to be better off just parking it in an index that tracks the S&P 500.  Short term vs long term capital gains and all that.", "score": 23, "replies": []}, {"body": "If you are looking for only 1% a month, why don’t you just put it all in some covered call etf like jepq. You will get your 1% in dividends", "score": 27, "replies": [{"body": "Or just buy SPY. Why over complicate it for likely worse tax inefficient returns", "score": 17, "replies": [{"body": "SPY is historically 10.26%, so a 12% aim would be a significant alpha over time.", "score": 1, "replies": []}, {"body": "Can’t wheel spy with 10k without pmcc", "score": 0, "replies": [{"body": "He said **buy** SPY, not wheel SPY.", "score": 3, "replies": [{"body": "OP is asking for wheeling options not just buy and hold", "score": 1, "replies": [{"body": "Yes, and with a 10K account, B&H is what you should be doing, not wheeling.", "score": 0, "replies": [{"body": "That’s not what OP asked tho", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Only 9% dividends with 5.8% return over the past 5 years, so not really close to 12%.", "score": 1, "replies": []}]}, {"body": "SOFI is not a bad choice. I prefer it around the $7 level, but $7.50 is still fairly safe. \n\nAnother ticker to look at is SOUN. With SOUN you can probs Lu pull in 6-8% per month selling ATM puts and calls at the $5 strike.", "score": 9, "replies": [{"body": "How many DTE would you do on SOUN?  Are you wheeling it?", "score": 1, "replies": [{"body": "I do wheel soundhound. I have 6000 shares currently. \n\nLooking at the option chain, the October 4th $5 put has a 10% premium paid ($0.50) with a .5 delta. If it were me, that is what I would sell. If you are a little more risk adverse, you can sell the $4.50 put of the same expiration. It still pays ~5.5% return on risk over 30 days ($0.25).", "score": 5, "replies": [{"body": "I'm gonna look at it tomorrow AM.  Thanks for the tip!!", "score": 1, "replies": []}]}]}]}, {"body": "You have to make the decision on which of these would you be good to hold for weeks or months if you had to.\n\nJust glancing at some data -\n\nKDP is poorly rated but is profitable and even pays a small 2.3% divi. It is not highly liquid without weekly options chains and low 7M shares avg day volume. \n\nPFE is also poorly rated and has returned to profitability since it was losing money in Q3/23 reports and pays a nicer 5.8% divi.\n\nSOFI is poorly rated and is just now starting to have small profits but is lower priced for less overall risk per contract. It has a lot more volume and has been fairly stable moving between about $6 and $10.50 in the last year. \n\nWe each need to make our own decisions. Trading a $30+ stock will lock up \\~30% of a $10K account for weeks or months if the stock drops so keep this in mind as you try to diversify.", "score": 14, "replies": [{"body": "My thought is to lock up 60-70% of the account and keep 30% liquid for an anticipated market pull back", "score": 3, "replies": [{"body": "Be careful. Here is what happened during the covid crash - [How the Wheel Worked in March during the Crash : r/Optionswheel (reddit.com)](https://www.reddit.com/r/Optionswheel/comments/lp22xe/how_the_wheel_worked_in_march_during_the_crash/)\n\nAlthough with a smaller account more risk may have to be taken.", "score": 3, "replies": []}]}]}, {"body": "Premiums on those tickers will make it hard to get to your goal. You may have to consider assets that have more leverage or volatility. \n\nI took a look at the $100 SP for NVDA on 10/4. It would be your entire account held up in CSPs (not advisable), but it looks like that contract is selling for $1.03, so you’d hit your goal. Worst case, you’ll get assigned and own 100 shares of NVDA to sell weekly CCs.", "score": 7, "replies": [{"body": "If this is a margin account, it will be easier: NVDA Oct 18th 100 short put, 1.80 credit on BPE of 28.46, 6.32% ROC at max, 50.14% annualized; 3.16% at 50% max; 25.07% annualized.\n\nCash secured, it'll be tougher: NVDA Oct 18th 100 short put, 1.80 credit on BPE of 98.20, 1.83% ROC at max; 14.52% ROC at max.", "score": 3, "replies": []}]}, {"body": "Save $2,000 more and buy 100 shares of NVDA. 1% a month would not be difficult", "score": 4, "replies": [{"body": "Or just wait 1 day :D", "score": 2, "replies": []}]}, {"body": "I am also mostly wheeling with a 10K account, looking for a 10% annual return. Nearly there already in realized gains.\n\nWould recommend PFE. Premiums are tiny but it’s stable and pays a good dividend. If you can get in around $28 that’s solid. Rather than get in via CSP though, I would buy and immediately sell CC’s since the beta is so low, and unless you sell a CSP very much ATM, you’ll not get assigned.", "score": 2, "replies": [{"body": "Do you mind me asking why you do it? The S&P500 is up 25% in 12 months so you could possibly make more there with no effort and have spare time for some other cash generating activity", "score": 3, "replies": [{"body": "I can make money while markets are flat or mildly bearish\n\nI do invest heavily in the S&P in my 401(k) and my Roth IRA\n\nWhile still slim, and my skillset still small, it possible to find a couple of great tickers and generate more profit and capitalize on a trend or a great product\n\nThis is a learning experience for me as I force myself to study markets (mostly the domestic US markets) by holding more active positions in stocks, which compels me to do research into individual positions and identify what fundamental factors can mean for a ticker.\n\n\nBuying and holding the top 500 companies is an amazing strategy. But we do have a recency bias. The recent performance of the S&P 500 (really just the Mag 7) has made everyone an evangelist without context that a bad year does indeed wipe out the last few years gain. Sometimes with proper stimulus it recovers quick, like within a year. Sometimes a bit longer. Everyone and their mother praises SPY and VOO and such. And I’m sure after a bad year we’ll have people crawling out of the wood work to say that we should just do T Bills/Bonds/Money Markets/CDs/Global Portfolios etc. Not to say there aren’t smart people who will DCA down (if they can) when a bear market comes around.\n\nTL;DR, I do invest in the S&P. My brokerage account is where I earn money on the side and learn without my money being *entirely* beholden to whether Nvidia/Alphabet/Microsoft/Meta are having great quarters", "score": 5, "replies": []}]}]}, {"body": "BSTZ. Has a 14% dividend with monthly payouts and has been outpacing the market for 5 years.\n\nIt’s a black rock fund that focuses on emerging tech.", "score": 2, "replies": [{"body": "Yahoo says it's an 8% dividend?\n\nAnd it's -6.7% over the past 5 years\n\nAre you sure thats the right ticker?", "score": 1, "replies": []}]}, {"body": "I have an account I started as an alternate for when my main one goes down. $2k in it. I’m just wheeling INTC and RKLB. I’m already up 5% and have just barely started.", "score": 2, "replies": []}, {"body": "Someone in a value stocks sub pointed out stellantis (Dodge, Chrysler, Ram etc.) and I realized I been sleeping on them for a while.\n\nThey have good dividend and are pretty solid at ~$50B market cap. \n\nIm looking at selling some CSPs for longer hold, maybe sell some CCs, but maybe not even doing that for a while, to collect the dividends. \n\nAfter a year, then maybe sell CCs far otm for some icing on the cake", "score": 2, "replies": []}, {"body": "FLEX, AMKR, URA, PINS, PAVE, CPNG, BUG, BBW\n\nPick any 3.", "score": 2, "replies": []}, {"body": "10k account, when my account was 10k I picked 5 stocks and did spreads.\n\n\nWhen I had a little more I added Ford as my wheel, then over time I've added some more wheels, some I totally regret and I'm debating if I should average down or sell for the l.. I will calculate my profit in December if I need some write offs I may take the l.. ", "score": 1, "replies": []}, {"body": "Try one contract with TQQQ.  It is the levered fastest growing large caps, in general.  It is great for options and has lots of OI and volume. No individual stock is safe from some problem hitting it hard.   Obviously, if the market tanks, stay away, but that is true for everything equity.", "score": 1, "replies": [{"body": "When the market tanks, leveraged ETFs aren't \"similar\", they are wipe out awful.\n\nA theortical leveraged QQQ from 2008 would still be underwater today.", "score": 1, "replies": []}]}, {"body": "BAC,JD, GDX,SLV", "score": 1, "replies": []}, {"body": "I am currently wheeling SOUN", "score": 1, "replies": []}, {"body": "Buy VOO, 10k isn't enough to wheel.", "score": 1, "replies": []}, {"body": "NVDA", "score": 1, "replies": []}, {"body": "That's 12% per year.\n\nIf you can do that consistently, open a hedge fund.\n\nOtherwise, you need to reevaluate your expectations.\n\nAlso, don't bet the rent.", "score": 1, "replies": []}, {"body": "Ford is at the perfect point to start a wheel. Wait for it to drop close to $11 and then sell cash secure puts at $11. They also pay a healthy dividend. And it’s an undervalued stock at $11. Should run up to $14 or more.", "score": 1, "replies": []}, {"body": "I'm currently wheeling DKNG.🍷🤙", "score": 1, "replies": []}, {"body": "Why target 1% per month wheeling when you get that on average just holding the index?  Your efforts are wasted on that kind of return imho", "score": 1, "replies": [{"body": "Technically speaking if consistently achieved OP would outpace the sp500's historical average of about 10.26%. I don't think you can safely say the sp500 will always repeat this year's returns\n\nBut even if OP could actually achieve it, it's quite a lot more work to carve out an additional ~1.5% over buying and holding the index over the long term.", "score": 2, "replies": []}, {"body": "What index is historically 1% per month?\n\nSP500 is 10.2% since 1950 something but that's VERY different to 12% over a long period of time.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sorry, you're close to retirement and super paranoid about losing capital, but you're using a leveraged day trading ETF on technology?\n\nThat's absolute Russian Roulette. FWIW TQQQ didn't exist in 2008, but a theoretical version of if it did exist would STILL be underwater 16 year later despite QQQ being multitudes after break even in the same time period.\n\nOne big pullback and TQQQ is completely gone. Like wipe our 97% gone, no recovery option.", "score": 1, "replies": []}]}, {"body": "Thanks for the help. KDP, is mostly a play for long term NA brews.", "score": 0, "replies": []}, {"body": "TQQQ", "score": 0, "replies": []}, {"body": "BiTO looks to speculative", "score": -1, "replies": []}, {"body": "If you're looking for 1% Jepi or even the WEEL etf would get that done no problem", "score": -1, "replies": [{"body": "JEPI isn’t yielding 1% per month. It’s < 9% / year.", "score": 1, "replies": [{"body": "It did almost 13% last year total return and as of my last portfolio update is up over 9% this year already. \n\nPrice appreciation counts too", "score": 1, "replies": []}]}]}, {"body": "you rly would keep this stock? like imagine you go for PFE and well, we don't speak about funflu anymore, so they drop 30% on earnings again and what next?", "score": -2, "replies": []}, {"body": "Just get a scanner and wheel stocks less than $10", "score": -6, "replies": [{"body": "Yeah, pick stocks at random, what could go wrong? ;-D", "score": 11, "replies": [{"body": "People like juggling chainsaws and running with scissors, apparently.", "score": 4, "replies": []}, {"body": "To scan for stocks with a small account. OP is trying to wheel a $35 stock with $10k. That isn't the way.\n\nObviously scan for price, premium, delta, market cap, etc..", "score": -3, "replies": [{"body": "OK, but don't forget to then research for profitability, guidance, rating, management team, product and service outlook, moat, etc.", "score": 5, "replies": [{"body": "and good vibes. Don't forget vibes", "score": 6, "replies": []}, {"body": "Ya I hear ya. I was just letting them know to just scan because of the limitations of a small account. \n\nOP you should check out RealThetaGang on Twitch. He has a small 5k account that he's built up. Him and Scottich here give the best advice on the whole sub.\n\nhttps://www.thetagang.com/joonie", "score": 2, "replies": [{"body": "Thank you for sharing this. I have not come across it. Good luck on your trades sir", "score": 1, "replies": []}]}]}]}]}, {"body": "Which scanner?", "score": 1, "replies": [{"body": "I like thinkorswim", "score": 2, "replies": []}]}]}]}
{"title": "INTC - Acquisition Potential?", "selftext": "It looks like pieces of Intel are being sold or spun off.\n\nWould be very surprised if one of the other big chip makers didn't buy those pieces.\n\n  \n[https://finance.yahoo.com/news/exclusive-intel-ceo-pitch-board-194933608.html](https://finance.yahoo.com/news/exclusive-intel-ceo-pitch-board-194933608.html)\n\n  \nThe proposal does not yet include plans to split Intel and sell off its contract manufacturing operation, or foundry, to a buyer such as Taiwan Semiconductor Manufacturing Co. ([TSM](https://finance.yahoo.com/quote/TSM), [2330.TW](https://finance.yahoo.com/quote/2330.TW)), according to the source and another person familiar with the matter.\n\nThe presentation, including the plans around its manufacturing operations, are not yet finalized and could change ahead of the meeting.\n\nIntel has already broken off its foundry business from its design business, and has been reporting its financial results separately since the first calendar quarter of this year.\n\nThe company has erected a wall between the design and manufacturing businesses to assure that potential customers of the design division would have no access to technology secrets of customers using Intel’s factories, known as fabs, to manufacture their chips.\n\nIntel is suffering through one of its worst periods as it attempts to play catchup in the AI era against the likes of Nvidia ([NVDA](https://finance.yahoo.com/quote/NVDA)), the dominant AI chipmaker with a $3 trillion market capitalization. In contrast, Intel's has now sunk to below $100 billion after a disastrous second-quarter earnings report in August.", "id": "1f79nop", "created_utc": 1725291145.0, "score": 3, "upvote_ratio": 0.52, "num_comments": 85, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The whole point of the foundry is the re-shoring of US semi production. There’s zero chance TSM will ever be able to buy the foundry from Intel.", "score": 62, "replies": [{"body": "Correct", "score": 9, "replies": []}, {"body": "Uhhh…. TSM foundry in Arizona would like a word with you….", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No it isn’t lol. Chips act got 6.6billion in investment in TSM bringing manufacturing stateside.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I see you don’t understand where current chip fabs stand, and the current + future state of affairs will be. TSM is a national security issue. So I’m just gonna say “haha, okay bro.”", "score": 0, "replies": []}]}]}]}]}, {"body": "Walmart has more chances of acquiring that than TSMC.", "score": 2, "replies": []}, {"body": "I have seen NVIDIA, TSMC, Marvell, and IBM as potential buyers according to others. Know any good places to do deeper dive research on this?", "score": 1, "replies": []}, {"body": "Is that with the gov know they will have to continuously prop up Intel? Even if Intel reaches parity in performance, they have the problem of paying workers more money for less work, while having to do packaging on the other side of the world instead of them already being in E Asia. \n\n\nIt's a real problem that the US has to decide is it ok spending hundreds of billions to prop up US manufacturing to be the best in the world. Else just realize the US can't compete in manufacturing and will forever be wholly reliant on E Asia for leading nodes.", "score": 1, "replies": []}, {"body": "Concerning.", "score": -3, "replies": []}]}, {"body": "why do we get a new INTC post every 5 minutes? How many bagholding grandsons does nana have?", "score": 38, "replies": [{"body": "A lot. I am one of them", "score": 3, "replies": []}, {"body": "We never hear about nana’s other kids/grandkids…hopefully as a family they got some more diversification amongst their investments", "score": 2, "replies": []}, {"body": "It was a proud Catholic family. Nana was loaded", "score": 1, "replies": []}]}, {"body": "Imagine Intel being bought over by Nvidia in a share swap deal. Nvidia gets production capabilities and together with CPU and GPU tech they will rule over the data center market.", "score": 19, "replies": [{"body": "Feds would block sadly", "score": 9, "replies": [{"body": "You mean luckily...", "score": 12, "replies": [{"body": "No I don't mean luckily because I want to cash out my intc calls for 20k profit", "score": 15, "replies": [{"body": "Short term gains in exchange for tech monopolies. Sounds great.", "score": 10, "replies": [{"body": "The entire US economy is already monopolized by the big players my man.", "score": 0, "replies": [{"body": "Sure thing.", "score": 3, "replies": []}, {"body": "Flair checks out.", "score": 2, "replies": [{"body": "Nah you're just stupid", "score": -2, "replies": []}]}]}]}, {"body": "Then Nvidia would sit on their cash piles with no r&d for 10 years like intel did while china slowly rules the chip market.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nvda can just issue 3% shares for intel market cap, anyone saying intel can catch up is beyond regarded", "score": 13, "replies": [{"body": "I don’t think FTC would allow NVDA to buy intel", "score": 11, "replies": [{"body": "If NVDA becomes a key defense stonk due to AI/drone tech, Nvda can probably make a case to buy Intc’s fabs in the US once they are built", "score": 1, "replies": []}]}, {"body": "25 years ago that’s what they said about Intel and its rivals.", "score": 8, "replies": [{"body": "These regards have a memory of about 2 days ago and a forward thinking of about 1 day, please be gentle with them.", "score": 7, "replies": []}, {"body": "People were saying this up to around 2020. Things change. People have the excellent ability of expecting the future to maintain linear continuity with the past", "score": 1, "replies": []}]}, {"body": "You do realize INTC is worth like 100x NVdA, it’s just that the market is allowing us to get in cheap so new wealth can be created", "score": -15, "replies": [{"body": "You need to reevaluate how you value stocks…..", "score": 8, "replies": []}, {"body": "Is that you nana..?", "score": 5, "replies": []}, {"body": "Nono, explain yourself ![img](emote|t5_2th52|12787)", "score": 2, "replies": []}, {"body": "How regarded can you people fucking be", "score": 1, "replies": [{"body": "Look at their assets.  One of the ASMl machines is worth all of NvDA chips. Intel has a straight plug for ASML", "score": 4, "replies": [{"body": "To quote house - are you being intentionally dense?  \ndo you really think intel has some secret sauce amsl machine that tsmc hasnt fucking perfected for years and years and let me guess ur going to say that only intel has the newest 2nm fabs from asml but what you in ur shortsighted utterly useless garbage take dont realise it that it takes  goddamn years to optimize the process especially for new fab machines which just happen to be worth over 200million and the size of 4 buses and all of this is not mentioning the fact that amd is cleaning their clocks (pun intended) for years now in terms of efficiency clock speeds and overall stability the only reason oems havent utterly given up on them is because its a fucking household name at this point and most people cant tell a core ultra max pro i9 from their fucking elbows anyway and dont even think that they can get a slice of the pie from the destop gpu market where nvidia has over 70% market share and amd is doing a phenomenal job with just shut the fuck please", "score": 1, "replies": []}]}]}, {"body": "found a lost ape ![img](emote|t5_2th52|4271)", "score": 0, "replies": [{"body": "We need to create r/INTC_Stock\n\nEdit: it already exist ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "[https://www.visualcapitalist.com/nvidia-is-worth-more-than-all-of-these-companies-combined/](https://www.visualcapitalist.com/nvidia-is-worth-more-than-all-of-these-companies-combined/)\n\n\n\nhttps://preview.redd.it/ri4rbri4hfmd1.jpeg?width=1200&format=pjpg&auto=webp&s=019a4726d9f04274d4bb178eeb152240c0f7fd74", "score": 1, "replies": []}]}]}, {"body": "no, not really.  altera is being spun off in an ipo and no one else wants anything intel has or would face difficulty re: antitrust.\n\nalso, why are there 500 intel threads/day now?", "score": 8, "replies": [{"body": "a. low value relative to its historical average b. bagholders c. Nana", "score": 26, "replies": [{"body": "Nailed it. \n\nConspiracy theories are enjoyable though... Waiting for the Fomo to bring me back to $30 so I can sell lol", "score": 6, "replies": []}, {"body": "P/B ratio", "score": 1, "replies": [{"body": "That and their FPE is lower than last quarters PE.", "score": 2, "replies": [{"body": "That means nothing when their assets are worth more than their stock. If you were a corporate raider from the 80s you'd buy them and liquidate everything and make a killing.", "score": 0, "replies": [{"body": "Why is the FPE irrelevant?", "score": 1, "replies": [{"body": "Because if you buy the stock right now you're getting any future earnings for free at this price", "score": -1, "replies": [{"body": "You’re agreeing with me no? FPE being < previous Q PE suggests the stock might be undervalued. With that combined with the less than 1.0 P/Book (mrq) it kinda comes across as undervalued.", "score": 1, "replies": [{"body": "Oh I misread what you initially said. Yes I'm agreeing with you LOL.", "score": 0, "replies": [{"body": "Flair checks out ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "looking past the not so immediate future, no one's stepping in hard enough to replace them in processor design. they still own the cpu.", "score": 7, "replies": []}, {"body": "Calls brinting", "score": 3, "replies": []}, {"body": "The USG will never let the manufacturing business be sold to a foreign company - it’s a national security concern.\n\nIf they spin off I’m buying calls on the foundries *asap*. There’s a huge national interest in having a domestic, 100% US-jurisdictioned foundry, and without the design side of the business weighing them down they’ll be bulletproof. They can be behind on tech, whatever, but the USG won’t let them fail.", "score": 5, "replies": [{"body": ">and without the design side of the business weighing them down they’ll be bulletproof.\n\nYou're kidding right? The design side is making more than 10b per year right now.", "score": 8, "replies": []}, {"body": "Design is making all the money right now which is helping fund the expansion of the foundry business.", "score": 2, "replies": [{"body": "Shows what I know.. Is it their manufacturing that’s underperforming then? Which side is tanking their stock?", "score": 2, "replies": [{"body": "Manufacturing is getting saddled with all the expansion costs. If you took out the expansion costs the foundry unit would be very profitable.", "score": 2, "replies": []}]}]}]}, {"body": "Government would never approve this", "score": 2, "replies": []}, {"body": "Oh we are in the denial stage where we talk about acquisitions", "score": 3, "replies": [{"body": "You spelled \"Despair\" wrong. Shit has never been so low how are you calling it denial stage lmfao", "score": 2, "replies": [{"body": "Denial to admit that your money is cooked ![img](emote|t5_2th52|4271)", "score": 2, "replies": [{"body": "Marko-2091 said my money is cooked, I will sell first thing first at open!!!", "score": 1, "replies": []}]}]}]}, {"body": "Its certainly in the realm of possibility. Mee maw whispering in the ears of some executives.", "score": 2, "replies": []}, {"body": "No duh. Let’s keep posting the same shit.", "score": 1, "replies": []}, {"body": "I don’t think acquisitions are likely. Those projects are being sold off for a reason, they are unprofitable and INTC is looking to improve the bottom line.", "score": 1, "replies": []}, {"body": "Yes let’s get INTC to NVDA levels! I would definitely buy in if they reach NVDA levels! Someone needs to knock NVDA down off their high horse!", "score": 1, "replies": [{"body": "There should be a competition for market share. It keeps prices competitive. I say that going both ways, it's good that AMD takes CPU market share and in kind, the others should take GPU market share from NVIDIA. These large corporation hyperscalers can afford NVIDIA tech but many business will not be able to.", "score": 1, "replies": []}]}, {"body": "Intc - what's the next cope?", "score": 1, "replies": []}, {"body": "PAMP EET  ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "They should sell some of this to NKLA.", "score": 1, "replies": []}, {"body": "So granny's little boy is saved?", "score": 1, "replies": []}, {"body": "Can Nvidia buy Intel's fabs without the FTC blocking them?", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4259)", "score": 1, "replies": []}]}, {"body": "Intel can acquire deez nuts 🥜", "score": 1, "replies": []}, {"body": "I think they liquidate their position in MBLY.", "score": 1, "replies": []}, {"body": "Maybe that’s why Warren buffet was getting some cash together", "score": 1, "replies": []}, {"body": "I’m sure Hock Tan would love to ginsu it up into bits of AVGO", "score": 1, "replies": []}, {"body": "Reminder: NVDA would never want to buy any manufacturing business.  Anyone who speaks of NVDA securing production as a positive for NVDA is wrong.\n\nI bet Altera goes toward MRVL.", "score": 1, "replies": []}, {"body": "Grandma says hold", "score": 1, "replies": []}, {"body": "Intel would eventually be bought by IBM. The place where technology goes to die.", "score": 1, "replies": []}, {"body": "Nvidia acquiring Intel is a definite possibility. The USG would support such a thing no doubt, it would be a win win, let's see..", "score": -2, "replies": [{"body": "It’s not even remotely possible.", "score": 2, "replies": [{"body": "Don't agree with your position.", "score": 1, "replies": []}]}]}, {"body": "I will only say if they can pull off the foundry then the stock will recover. Right now the current CEO made the wrong moves and now paying the price for. Some of those are internal and some are external like the China ban for some of their chips. \n\nI will say Intel is a solid bet that it will recover but still a risk.", "score": -1, "replies": []}]}
{"title": "Detail analysis: What if you had just bought the highest market cap stocks", "selftext": "I was inspired by this [post](https://www.reddit.com/r/wallstreetbets/comments/1f5l4c6/update_what_if_you_had_just_bought_the_highest/) to take a closer look at various scenarios. My analysis assumes the stocks are bought once a month - at the beginning of every month. It can extended to rebalance everyday but not everyone can do that.\n\nInitial investment: $1,000\n\nMonthly investment: $100\n\n**Strategies**\n\n* Buy and hold: buy the top N market cap stocks of a given month. Do not sell the stock if it's not in the top N list in the following months.\n* Rebalance: If an existing stock in the portfolio is not in the top\\_n stocks list in the current month then  check when was the last month it was part of the top\\_n market cap stocks. If the resulting month difference is greater or equal to `rebalance_threshold_months` then sell the stock and tax the gains. The sale proceeds (minus short term taxes) are added to the monthly investment budget equally among the current top\\_n stocks. If there was a loss then I simply use the total sale proceeds. Eg, Assume AMZN was top 3 stocks last month but not this month.  If the threshold months is 1 then we sell AMZN this month, tax the gains, and distribute the sale proceeds equally to buy this months top 3 stocks.\n\nBacktesting. Start: 2018-1, ~~End: 2024-1.~~ Edit: End 2024-8.\n\n|Strategy|Rebalance threshold months|Top 5|Top 3|Top 1|SPY|QQQ|\n|:-|:-|:-|:-|:-|:-|:-|\n|Buy and hold|N/A|$20,793|$21,967|$17,530|$15,266|$17,989|\n|Rebalance. Short terms capital gain tax 24%|3|$19,791|$22,383|$13,625|$15,266|$17,989|\n|Rebalance. Short terms capital gain tax 24%|2|$19,802|$22,108|$14,141|$15,266|$17,989|\n|Rebalance. Short terms capital gain tax 24%|1|$19,582|$22,206|$13,982|$15,266|$17,989|\n|Rebalance on tax advantage account|3|$20,229|$23,050|$15,555|$15,266|$17,989|\n|Rebalance on tax advantage account|2|$20,181|$22,738|$16,138|$15,266|$17,989|\n|Rebalance on tax advantage account|1|$19,847|$22,825|$16,142|$15,266|$17,989|\n\nRegardless of the strategy buying top 3 market cap stocks seems most optimal. Buy and hold handily beats SPY and QQQ. And if you have the itch to rebalance then rebalancing on the 3rd month seems most optimal. But note that past performance is not indicative of future performance.\n\nBack testing longer term. Start: 2010-1, End: 2024-8\n\n|Strategy|Rebalance threshold months|Top 5|Top 3|Top 1|SPY|QQQ|\n|:-|:-|:-|:-|:-|:-|:-|\n|Buy and hold|N/A|$107,205|$122,673|$75,026|$58,958|$90,923|\n|Rebalance. Short terms capital gain tax 24%|3|$127,848|$146,441|$42,948|$58,958|$90,923|\n|Rebalance. Short terms capital gain tax 24%|2|$123,116|$145,579|$44,803|$58,958|$90,923|\n|Rebalance. Short terms capital gain tax 24%|1|$127,423|$143,843|$51,132|$58,958|$90,923|\n|Rebalance on tax advantage account|3|$129,959|$150,096|$56,915|$58,958|$90,923|\n|Rebalance on tax advantage account|2|$124,976|$148,884|$60,258|$58,958|$90,923|\n|Rebalance on tax advantage account|1|$129,178|$147,589|$72,899|$58,958|$90,923|\n\nLong term, buying top 3 market cap stocks seems most optimal, regardless of the strategy. Buying and holding handily beats SPY and QQQ. If rebalancing then rebalancing on the 3rd month seems most optimal (maybe 4th or 5th month is even better but I didn't check it).\n\n**Disclaimers**\n\nTHIS IS NOT FINANCIAL ADVICE. THIS IS PURELY A THEORETICAL EXERCISE AND IT SHOULD NOT BE USED UNLESS PROPERLY STUDIED AND REPRODUCED BY YOU. USE AT YOUR OWN RISK.", "id": "1f7hmop", "created_utc": 1725310370.0, "score": 196, "upvote_ratio": 0.93, "num_comments": 91, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Backtest it for 50 years (not just the era where tech outperformed) or compare it with nasdaq.", "score": 140, "replies": [{"body": "QQQ, which is part of the analysis here, tracks Nasdaq 100. I am happy to backtest it going way back in time if I can get the ticker list of top 5 market cap stocks for every year.", "score": 29, "replies": [{"body": "You're right, I actually missed it when reading your post. No Idea why I got any likes at all. \n\nI do think backtests should be more extensive and more analyse is required to better understand all the factors at play. HoweverI don't work in the industry anymore so can't help you with providing data. Good luck!", "score": 2, "replies": []}]}]}, {"body": "Soooo buy hi and sell low ehh", "score": 73, "replies": [{"body": "momentum trading.. buy high & hoping to sell higher.  🤷‍♂️", "score": 18, "replies": []}, {"body": "I see the logic.  Usually the highest cap stock stays there for a long while before being overtaken, and grows significantly.  Generally, you should sell and rebalance when there is a break-even point between a new front runner and the current stock. So it should, hypothetically, be neutral in terms of selling one stock to buy another to ride the second stock's wave up.  I can see why this outperforms the SNP 500, as you are only chasing the currently winning stocks without being bogged down by lower performers.\n\n\nThe two fundamental issues I see with this strategy are:\n\n\n1.  Taxes neutering gains.\n\n\n2.  Unless you watch like a hawk, you aren't going to be 100% efficient meaning you aren't maximizing the benefits of it.  Out of town for a week when one stock overtakes another, and you basically are going to miss some percent of the gains.", "score": 8, "replies": [{"body": "This analysis seems to take taxes in account. Agree with the second point. It’s hard to be diligent enough to buy every month and potentially rebalance on top of that.", "score": 9, "replies": [{"body": "I mean a rules-based strategy that's this simplistic can be coded in Python and deployed in the cloud on a platform like quant connect and handle all of the trading. I could do it in an evening", "score": 4, "replies": [{"body": "It would also be cool to just have ETFs that do this topN quarterly rebalance.", "score": 2, "replies": []}]}]}, {"body": "What if you code a little program to watch the changes and alert you?", "score": 1, "replies": []}, {"body": "Gambling w Roth IRA neuters the tax issue\n\n2 would drive me nuts. Watching like a hawk but not panicking? Not my style baby", "score": 1, "replies": [{"body": "What is the tax issue? I’m currently on a cash account on Webull and trading. I’m at a loss right now so isn’t the taxes only based on my total gains -losses?", "score": 1, "replies": [{"body": "Basically, taxes cut into your reinvestment amount, and you aren't trading $1 in the stock that was #3 for $1 in the stock that moves to #3.  Instead, assuming your #3 had some level of gains, your reinvestment amount will be lesser than your current valuation.  When you go to redistribute, you cut into you value, meaning you are never rebalancing dollar for dollar.\n\n\nI actually missed that this analysis took into account capital gains tax, so it's interesting to see.", "score": 1, "replies": []}]}]}]}, {"body": "There is nothing here that implies selling low. Simply that the company is no longer in the top-n of market cap. For the top performers it's often the case that one company's growth will out pace another rather than it being a zero sum \"winners must mean losers\" scenario.\n\n\nI wonder how often it is the case that in the top five companies by market cap there are two competitors in the same industry.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}]}, {"body": "14 years is long term now? How would this have done from 97 to now?", "score": 35, "replies": [{"body": "I don't have a handy ticker list of top 5 market cap stocks going back to 97. If someone makes this list I'm happy to run the analysis.", "score": 21, "replies": [{"body": "I’ll run it on Bloomberg when I’m back in the office later in the week. I suspect that the tech bubble would have really hurt it.", "score": 34, "replies": [{"body": "Yeah I really want to see this started in at least the late 90s. Please report back", "score": 10, "replies": []}, {"body": "Subscribe", "score": 2, "replies": []}, {"body": "Potentially, but assuming you stay in only the highest market cap stocks, I think the overall losses would be somewhat insulated against the larger downturn. The pitfall here is if one of the top 3 has a sudden massive downturn practically overnight, destroying your redistribution value.", "score": 1, "replies": []}, {"body": "So did you try it? It does seem like the tech bubble would hurt it- What I'd really like to see is the top 10 rebalanced annually. less tax and easier strategy plus I think there would be enough diversity that the tech bubble drawdown on that would be similar to the spx drawdown overall, and at the same time there would be a little more upside than the full index in other years. Just a thought.", "score": 1, "replies": [{"body": "Took a look at top 3 from 95 to now. Rebalancing quarterly and monthly. Up until 2018, it underperformed SPY on a gross basis, after tax would be even worse and had a lower sharpe. After 2018 is when all the returns came from.", "score": 1, "replies": [{"body": "That makes sense. Thanks.", "score": 2, "replies": []}]}]}, {"body": "I think the market dynamics changed a bit after 2000. It's not playing by the same rules as it used to. \n\nIf it backtests that far, I'd call it good for our current environment.", "score": 1, "replies": [{"body": "And how would you tell if they changed again?", "score": 1, "replies": [{"body": "For our purposes? antitrust starts happening again.\n\nEdit: Antitrust is there to stop big players from abusing their dominant market positions. Without it, simply choose the biggest players, because they have an unfair advantage just from being big.\n\nEdit 2: a lot of the tech bubble really should have been broken up/heavily penalized for business practices on the grounds of antitrust - Apple with intentional incompatibility, Microsoft with the bundled side channel products, Amazon with bundled services (sign up for streaming video and music to use our delivery service), basically any big player you care to shake a stick at. Without it, they'll just keep doing abusive shit that smaller players cannot manage, and reaping obscene profits from doing so.\n\nEdit 3: It's all about marketing data now, and who has it. Dominant players are further abusing their positions to extract this data, even if their services have nothing to do with it - just having presence is worth money, and bigger presences are worth more.", "score": 2, "replies": []}]}]}]}]}, {"body": "On WSB, long term is 1 week", "score": 5, "replies": []}, {"body": "shit bro the massive dot com dip would have made you a ton of money if you kept buying non-stop", "score": 2, "replies": []}, {"body": "prob pretty poorly if started right before the dot com bubble lmao", "score": 1, "replies": [{"body": "That’s kinda the point though. If you think something like this works, it needs to perform through all market regimes OR you need to have a clearly defined rule for when to stop using it. \n\nI have my doubts about how it would do 07-08 as well.", "score": 1, "replies": []}]}, {"body": "Mathematically, it'll work out no matter what, as you are just shifting money around between various growers while being agnostic to broader market trends.  Basically, you are always going to be invested in the absolute best performing stocks, no matter what the time frame is as a new up and comer that overtakes others that you simply reinvest in. \n\n\n That said, it falls apart due to innate innefficiencies with people.  You aren't never going to time the move from one stock rising to another taking it over with perfect accuracy, which would reduce the effectiveness.", "score": 1, "replies": [{"body": "They could have appreciated to the largest and then stop appreciating right as you buy them though. You’re using market cap as a proxy for momentum and it’s a poor one. \n\nImagine a company with 1b in market cap and another with 500mm\n\nThe 1b company goes up 10% per year and the 500mm goes up 15%. How much and for how long do you under perform by holding the larger one?", "score": 1, "replies": [{"body": "This beats the 500, but not individual stocks.  \n\n\nReason being I imagine is that the most growth comes from a relative few number of top stocks, and not the broader market.  \n\n\nOnce a stock gets to the top it usually continues to grow at a pace outpacing the general market for some time until it is replaced by a different stock.  By rebalancing between one highest growing stock to the next one that outpaces it, you should outpace the SNP 500.\n\n\nAll this analysis is *really* saying is that the SNP500's growth is carried mostly by the top 3 stocks in the market at any given time. \n\n\nNow, you would miss out on massive runups, yes, but the growth of the top 3, at any given time and regardless of the exact company, is going to be better than the next 497 companies averaged out.", "score": 2, "replies": [{"body": "\n“Once a stock gets to the top it usually continues to grow at a pace outpacing the general market for some time until it is replaced by a different stock.  By rebalancing between one highest growing stock to the next one that outpaces it, you should outpace the SNP 500.”\n\nDo you have any evidence of this statement?", "score": 0, "replies": [{"body": "This analysis, in this thread is saying exactly that and providing the evidence, at least back tested for 15 years. Its why it works. If it didn't work, neither would this analysis.  I see no reason why this wouldn't work regardless of period, as most companies don't grow at a pace better than the SNP 500 or broader market. In fact, they mathematically *can't*, because of most companies beat the average, then the average would just increase.\n\n\nConsider it logically.  If a top company isn't outcompeting the broader market on growth, then it will inevitably be overtaken.  If it maintains it's spot in the top 3, then it *has* to be growing, and more importantly it has to be growing faster compared to other companies.  If it weren't, it will no longer be the top spot eventually.\n\n\nAnd at that point, you would switch out of it to whatever replaced it.  \n\n\nSo, basically, this analysis proves that the top 3 stocks beats the average growth of the next 497.  That's really about it, and it makes mathematical and logical sense.  Growth isn't going to be evenly distributed, and in order to maintain the \"top spots\", a company *has* to grow faster than the index. If it didn't, then some other company will inevitably take them over in a run up, and it's doubtful they just barely get there and stop.  You miss the run up, yes, but you will still beat the average market as the only way a company can get to that point is by beating the market.", "score": 3, "replies": [{"body": "From 97 to 2018, buying the top 3 and rebalancing quarterly would have got you 5%. SPY alone would have been 7%. \n\nTell me again about your mathematical certainty?", "score": 1, "replies": [{"body": "I would very much like to see the data on that.  The only way this would be possible is if the top 3 were massively outsized compared to the next 497.  ", "score": 1, "replies": [{"body": "As per Bloomberg EQS, sorry not violating my license to post a screenshot to Reddit, lol.\n\nETA: I will say this strategy really came into its own post 2018. I’ll guess a few super large caps are driving it in a way that hasn’t happened before. Good luck predicting the persistence of that.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "It's not 14, is 6 years 8 months.", "score": -2, "replies": [{"body": "Yup, you belong here.", "score": 5, "replies": []}, {"body": "2010 to 2024. Idiot.", "score": 3, "replies": [{"body": "Where'd you get 2010 from? Because OP mentioned it twice he started January 2018......regard", "score": 0, "replies": [{"body": "Sentence above the second table.", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/mmjljedo6kmd1.png?width=1080&format=pjpg&auto=webp&s=9185b212cd921e80dbae49d6b76b2f83fb7f19d9\n\nDouble regard.....", "score": -1, "replies": [{"body": "Amazing. A screenshot showing you’re wrong. Sentence before the second table. \n\nWhy 2 tables if not different time periods? Failed coat hanger abortion.", "score": 6, "replies": []}]}]}]}]}, {"body": "I saw the other analysis, buying the #1 company but had thought what if bought top 5, so buying top 3 is best.\n\nI want to do this when fear and greed index crashes to 25 range, can you test buying the top 3 when fear and greed index tanks vs buying first of the month, instead save for those big drawn down periods and invest all then. I think can have even bigger gains.", "score": 15, "replies": [{"body": "I think buying top 3 is most optimal because the top 3 stocks usually have upwards momentum. And if they end up not becoming top 3 in the future then they can be rebalanced. See \n\nhttps://preview.redd.it/lenl78hbtgmd1.png?width=1211&format=png&auto=webp&s=37544a2ffeb2d7e776a494e4eb6a9fee530594d4", "score": 15, "replies": [{"body": "Do you hold onto them when they're no longer the top 3?", "score": 3, "replies": [{"body": "I believe the idea is you sell 100% of your stake in them (including gains) and rebalance every x months", "score": 3, "replies": []}]}, {"body": "Please do this for SP 400 mid cap and SP 600 small cap. May work even better. Rotate to next biggest market cap once they move the company from small to mid, and mid to sp500. For mid, top 3 are IBKR, ERIE, and LII kinda interesting let's see please let me know", "score": 1, "replies": []}]}]}, {"body": "Can you clarify a little more please? So buy and hold means never sell a stock in this case? So you start off with 1, 3 or 5 stocks but as things progress, your portfolio could contain 10s of stocks over a 10 year period? Just feels strange not having an exit plan for a stock you're entering into...", "score": 6, "replies": [{"body": "was also confused by the buy and hold. If I started last month, bought nvda aapl and msft, but then this month lets say meta magically jumps to 3 over msft, do I just not buy msft and buy meta with the next set of 100 dollars every month? Isnt this a sure way to lose money in the long run as companies in the top 3 change. If you never sell, you'd be holding on to IBM shares from when it was a topper which are now worth nothing relative to inflation? idk im confused.", "score": 3, "replies": [{"body": ">last month: buy nvda, appl, msft\n\n>this month: buy nvda, appl, meta + shares of msft from last month. If you rebalance every nth month and msft was last the top 3 stock more than n months ago then you'll sell msft. If you simply buy and hold then you'll likely be bag holding a few long term loser stocks.", "score": 5, "replies": []}]}, {"body": "You're understanding is right. I guess you would exit the loser stocks in the portfolio at some point. They are just not included in my analysis :)", "score": 1, "replies": []}]}, {"body": "So where am I buying calls?", "score": 3, "replies": []}, {"body": "It's buy high & sell higher strategy \n\n\nIt works 10/10!!\n\nTrust ! ❤️💯", "score": 6, "replies": []}, {"body": "Wow, really interesting. Thanks for doing this, I’m going to continue to research this strategy", "score": 2, "replies": []}, {"body": "This is cool and sounds a lot like the old school Dog's of the Dow where you buy only a handful of the biggest caps and rebalance yearly.\n\n[https://www.dogsofthedow.com](https://www.dogsofthedow.com)", "score": 2, "replies": [{"body": "Dogs of the Dow was the opposite approach, buy the worst performing stocks of last year. This analysis is interesting and 14 years seems long enough to establish some trend. Liking the “ marry winners no matter the pe etc” strategy", "score": 3, "replies": [{"body": "Dogs is a value play. This idea seems to be a momentum play. The analysis for both are extremely simple.", "score": 1, "replies": []}]}]}, {"body": "In essence, Google, Microsoft, Amazon and Apple have outperformed since they became leading companies around 2017. However if you go further back, the portfolio would have instead consisted of underperformers like Exxon, GE, Petrochina, Gazprom, IBM, Citi, Cisco, NTT and Coca Cola.", "score": 2, "replies": []}, {"body": "Breaking news: big tech outperforms the S&P 500. Regards everywhere shocked and confused.", "score": 6, "replies": [{"body": "It seems to outperform QQQ too.", "score": 7, "replies": [{"body": "Yea QQQ still a broad index it has shit like Costco and Starbucks", "score": 2, "replies": [{"body": "Costco literally performs like a tech company lol", "score": 3, "replies": []}]}]}, {"body": "Nah, more that the top 3, agnostic of what exact company it is, outperforms the broader index.  It's somewhat more lucrative than buying straight SNP 500 with effectively similar risk profiles, but without the huge reward of individual stocks or risks.\n\n\nThe major downside is the level of involvement you need to have.  SNP 500 is the Ron Popeal of investing, where you set it and forget it.  You don't get an amazing meal, but it's consistently alright.\n\n\nThis is more akin to a traditional home cooked meal.  Usually pretty good, but takes a lot more effort.", "score": 2, "replies": []}]}, {"body": "Can you explain rebalance?  Evenly distributing the total amount invested in each security purchased during a time period?", "score": 1, "replies": [{"body": "Yes. Say you're buying top 5 stocks and the total monthly budget is $100 ($20 each). Last month you bought $20 of AMZN for the first time but this month AMZN is not in the top 5 stocks. If you're rebalancing every month then you'll sell AMZN this month, and say it's worth $30. Then you'll end up with $20+($10\\*0.76)=$27.6 (after taxes). When this month's top 5 stocks are bought this $27.6 will be divided evenly 5 ways ($5.52) resulting in budget of $25.52 each for this month's stock.", "score": 5, "replies": []}]}, {"body": "$nvda $aapl $msft ftw", "score": 1, "replies": []}, {"body": "Oh no everyone seems to have discovered my secret strategy. Been doing exactly this recently, buying biggest and best as these days hype generates more hype, and also the big firms just buy all new competitors if they appear, e.g. facebook buying Instagram etc.", "score": 1, "replies": []}, {"body": "Is this comparing apples and oranges - capital gains tax applied when rebalancing but not when buying and holding? Should you include a column for ‘buy and hold net of capital gains tax on gains to date’?", "score": 1, "replies": []}, {"body": "so you basically indexing on the highest performing companies in the US market? isn't it what everyone is doing regardless because of the magnificent 7 thingy?", "score": 1, "replies": []}, {"body": "Intersting post and comments, thanks.\n\nSo, how does one run or backtest this analysis quickly. \n\nI can download data and write some python or excel scripts, but what platform (besides Bloomberg) enables a non finance professional to run this analysis?", "score": 0, "replies": []}, {"body": "I think another good exploration would be looking at the stocks at the bottom of the top 10 or so. \n\nAs others have pointed out, in this scenario one ends up buying all the stocks at their peak position, relative to the market, which they most likely won't sustain. Buying the stocks that lie at the bottom of the table leaves a bigger room for them to grow and being in the top 10 does signify their importance in the market.", "score": 0, "replies": []}, {"body": "\"most optimal\", aka \"the most best\"", "score": 0, "replies": []}, {"body": "Can somebody put in simple terms what this guy is talking about? No more than 4 words per sentence please. ![img](emote|t5_2th52|8883)", "score": 0, "replies": []}, {"body": "that is what i do and it works for me. then when one stock overperforms, i sell it and profit when i am low on cash. it works if you know a lot about the companies and trends related to them", "score": -1, "replies": []}, {"body": "Can you add in a transaction cost? Maybe 0.1% is lost every time you buy", "score": -2, "replies": [{"body": "I assumed no transaction cost since these days most platforms offer 0 transaction fees. Worse case we will sell  5 stocks and buy 5 stocks each month, which is low enough number of transactions.", "score": 12, "replies": [{"body": "You always lose something to the bid-ask spread.", "score": 0, "replies": [{"body": "Got it. Accounting for 0.1% lost every time you buy in the first analysis table and buy and hold strategy: $20,793 -> $20,625 (top 5), $21,967 -> $21,794 (top 3), $17,530 -> $17,387 (top 1). I don't think this will cause a significant difference.", "score": 8, "replies": [{"body": "Ok great work.", "score": 1, "replies": []}]}, {"body": "They always get you somehow.", "score": 0, "replies": []}]}]}]}]}
{"title": "My Well Regarded Position - $NVDA", "selftext": "[deleted]", "id": "1f7ig5a", "created_utc": 1725312382.0, "score": 122, "upvote_ratio": 0.95, "num_comments": 83, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 hours ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "https://preview.redd.it/c2l5wz7b4imd1.jpeg?width=1179&format=pjpg&auto=webp&s=d7d2a360e7868414cb57e74ceffa531b13199799\n\nIf only i bought more", "score": 1, "replies": []}]}, {"body": "My regards", "score": 42, "replies": [{"body": "Say hi to them for ne", "score": 3, "replies": []}]}, {"body": "130c exp next week, truly regarded...BB money", "score": 45, "replies": [{"body": "When is the JPow's early Christmas? If he gifts us 0.5, this regarded fellow may get his money back.", "score": 7, "replies": [{"body": "Priced in", "score": -6, "replies": [{"body": "0.5 is priced in? ok", "score": 10, "replies": [{"body": "As regarded as the Market is, it would take 0.5 as \"OMFG RUHSESHON!\" and everything is red", "score": 0, "replies": [{"body": "Rusheshon lol. Took me a second to understand that, then I had a chuckle haha", "score": 1, "replies": []}]}]}]}]}, {"body": "plus fed talks - economic outlook on friday , definitely cooked", "score": 1, "replies": []}]}, {"body": "As a person who gets clapped in anything he enters, I don’t wish that shit on no one. I hope it pays for ya OP.", "score": 17, "replies": [{"body": "🫡", "score": 4, "replies": []}]}, {"body": "Update:\n\nLadies and gentlemen, I honestly don’t know how anyone could be as well regarded as I am. Screenshot is…not great.\n\nhttps://preview.redd.it/dirqq6iyuomd1.jpeg?width=1179&format=pjpg&auto=webp&s=c3a276a29cffdd520203856a2501a734eb28275d", "score": 13, "replies": [{"body": "![img](emote|t5_2th52|4267)", "score": 6, "replies": []}, {"body": "I knew once I saw this post there could only be 1 possibility. RIP OP", "score": 2, "replies": []}, {"body": "As long as the punt was within your risk tolerance you'll come back with other plays.", "score": 2, "replies": []}]}, {"body": "I’d say it hits by eow good luck bro", "score": 9, "replies": [{"body": "🙏🏼", "score": 3, "replies": [{"body": "See im in the same call but for 9/6 I’m full regard we shall talk soon brotha", "score": 4, "replies": []}]}, {"body": "LMAOOOO", "score": 1, "replies": [{"body": "Hedged spy puts lmao", "score": 1, "replies": []}]}]}, {"body": "Solid DD, exceptionally regarded yolo. You love to see it, rooting for you bro", "score": 8, "replies": []}, {"body": "130 is not crazy at all .", "score": 6, "replies": [{"body": "How bout now?", "score": 8, "replies": [{"body": "It expires the 29th panic pussy seller", "score": 3, "replies": []}]}, {"body": "LMAO", "score": 1, "replies": []}]}, {"body": "Damn today is not looking good bro. Update?", "score": 6, "replies": [{"body": "u/ykorea u/banditcleaner2", "score": 2, "replies": [{"body": "u/ykoreaa", "score": 2, "replies": []}]}, {"body": "Bro went all in on $ROPE", "score": 2, "replies": []}]}, {"body": "Evidently the folks stopping by to wish me \"well\" don't quite seem to understand just how well regarded I am.\n\nI am nobility. I am royal. I am often regarded as \"king\". ![gif](emote|free_emotes_pack|kissing_heart) \n\nhttps://preview.redd.it/2lobwkwr1mmd1.png?width=2608&format=png&auto=webp&s=62e91f1f46ef1bcf6348cbeaf9662d83922fa7f8\n\n(edit: I am too noble to get grammar right)", "score": 6, "replies": [{"body": "Still a rich guy is all what I can see", "score": 5, "replies": []}, {"body": "Dare you bought shares?! Just sell them all and buy the option, buy the fvking dips please!!😭😭😭", "score": 2, "replies": []}]}, {"body": "how you doin today?", "score": 6, "replies": []}, {"body": "Wellbeing check", "score": 7, "replies": [{"body": "Bro couldn’t have timed this shit better lmaoooo 💀", "score": 2, "replies": []}]}, {"body": "My condolences 🫡", "score": 6, "replies": []}, {"body": "Not as sound this morning darling", "score": 6, "replies": [{"body": "What’s he at now?", "score": 1, "replies": [{"body": "-90% on the 130 for sure", "score": 6, "replies": [{"body": "LMAOOOO", "score": 1, "replies": [{"body": "I am losing like 20% in my calls for 09/27", "score": 1, "replies": []}]}]}]}]}, {"body": "Get rinsed boy", "score": 5, "replies": []}, {"body": "https://youtu.be/gcNJUrRhPhU?si=mN-d94Bwr8S2Bfcx", "score": 4, "replies": [{"body": "This is awesome lmao", "score": 3, "replies": []}, {"body": "How did you get this video of me???", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "Bye bye nvda holders ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 4, "replies": []}, {"body": "Well, the rich didn't get richer this time I guess...\n\nIn all honesty, why don't you buy even more shares (you own 3.000 already and sell covered 150c to collect massive free premium cash and if the stock skyrockets you collect massive profits from shares.\n\nAm I doing this wrong?\n\nThis is what I would do.. Unfortunately I'm not rich and can't afford to use this strategy :(", "score": 3, "replies": []}, {"body": "Good luck bro", "score": 2, "replies": [{"body": "Thank you! I think I’ll need it!", "score": 3, "replies": []}]}, {"body": "Nice", "score": 2, "replies": []}, {"body": "Damn it be the most regard with the most money.", "score": 2, "replies": []}, {"body": "Wow. Great job mate", "score": 2, "replies": []}, {"body": "Me too 130C 09/06 good luck man", "score": 2, "replies": [{"body": "RIP", "score": 2, "replies": [{"body": "Yeah i am fucked but idc", "score": 3, "replies": []}]}, {"body": "What are the chances u reckon this’ll happen lol", "score": 2, "replies": []}]}, {"body": "Sell and wait for a drop", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|27421)", "score": 2, "replies": []}, {"body": "There’s a universe where these happen. Wouldn’t be the craziest thing. Personally I have a 125 10/18\n\nBest of luck to you soldier 🫡", "score": 2, "replies": []}, {"body": "130 was not crazy 24 hrs before but it sure is now", "score": 2, "replies": []}, {"body": "If only that C was a P", "score": 2, "replies": []}, {"body": "Well this aged like milk", "score": 2, "replies": []}, {"body": "Memaaw is proud, (from above)", "score": 2, "replies": []}, {"body": "These contracts are down 77% today and probably down another 20% tomorrow.", "score": 2, "replies": []}, {"body": "Yikes after today!", "score": 2, "replies": []}, {"body": "OP are you still alive?? Come to buy the dips come on! Generation wealth is waiting for you!!", "score": 2, "replies": []}, {"body": "Make the options expiration more long term otherwise that 100k will evaporate into nothing by next week", "score": 1, "replies": [{"body": "WiSE LOL", "score": 2, "replies": []}]}, {"body": "Making insane amounts of money using short expiration options on meme stocks is like taking candy from a baby.. until that baby kicks you in the balls and steals your lunch money.", "score": 1, "replies": []}, {"body": "How low can nvidia go down under 100$?", "score": 1, "replies": []}, {"body": "How many more millions do you have have ? Ask your dad to open up the trust fund a bit more - should be fine", "score": 1, "replies": []}, {"body": "Those are long calls? Why don’t you just sell them instead?", "score": 1, "replies": [{"body": "Cuz...it could go 130+...any day before expiry...let me take another hit of the *hopium*", "score": 2, "replies": [{"body": "Ahahah, I bet he wish he’d sold covered calls right about now.", "score": 2, "replies": []}]}]}]}
