{"title": "Nordstrom founders offer $23 per share to take the department store private ", "selftext": "Nordstrom’s founding family has offered to take the department store chain private for $23 a share, teaming up with a Mexico-based retailer in its latest bid, a filing showed on Wednesday.\n\nThat price would value the company at roughly $3.76 billion. Its shares have gained 35% since Reuters first reported in March that the family showed interest in taking Nordstrom private.\n\nNordstrom’s sales have been stronger of late than some of its peers such as Macy’s and Kohl’s as it focuses on stocking its shelves with trendier products.\n\nThe bidders include CEO Erik Nordstrom, President Peter Nordstrom and Mexican retailer El Puerto de Liverpool, who sent a non-binding letter proposing to form a new entity that would buy the chain, according to the filing.\n\nThe company in April confirmed the family’s interest in a potential deal and formed a special committee of independent directors to evaluate such a proposal.\n\nThe Nordstrom family owned about 54.6 million shares, or 33.4% stake in the company, as of Sept. 4. Liverpool owns 15.8 million shares, or nearly 10% of the shares.\n\nThe deal would be financed through a combination of rollover equity and cash from the Nordstrom family and Liverpool as well as $250 million in new bank financing.\n\nIn May, Reuters reported that Sycamore Partners had shown interest in taking the company private.\n\nThe chain was founded in 1901 by John Nordstrom, the great-grandfather of the current CEO and president.\n\nIn 2018, Nordstrom rejected a $8.4 billion bid from the family, saying it was too small and later ended discussions after failing to agree on a price.\n\nSource: https://www.cnbc.com/2024/09/04/nordstrom-founders-offer-23-per-share-to-take-the-department-store-private.html", "id": "1f8vx7x", "created_utc": 1725463016.0, "score": 709, "upvote_ratio": 0.97, "num_comments": 81, "comments": [{"body": "They got offered $8.4bn in 2018 and said no. 5 years later they are getting a $3.8bn offer...", "score": 755, "replies": [{"body": "\"I know what I got\"", "score": 350, "replies": [{"body": "\"No lowballers\"", "score": 97, "replies": [{"body": "AC Blows", "score": 19, "replies": [{"body": "As is", "score": 3, "replies": []}]}]}, {"body": "And it's not worth as much as you're offering. I'll have you know it's less than half, thank you.", "score": 10, "replies": []}]}, {"body": "Greed can make you do very stupid things..", "score": 122, "replies": [{"body": "If they took 8b, it would be greed. If they didn't take it, it is also greed.", "score": 89, "replies": [{"body": "But rejecting the offer because it wasn’t enough is more greed", "score": 43, "replies": []}, {"body": "But if they did both, double greed.", "score": 8, "replies": [{"body": "It is called quantum greed.", "score": 0, "replies": [{"body": "Around my townhouse complex we call that greed cubed", "score": 2, "replies": []}]}]}, {"body": "Schrödinger's greed", "score": 2, "replies": [{"body": "It is quantum greed. Schrödinger's means there is greed and no greed. In this case it is both greed like particles going through 2 slots at the same time.", "score": 2, "replies": []}]}]}, {"body": "I just bought a $155 shirt from Nordstrom that costs $5 to make. Greed is their middle name", "score": 2, "replies": [{"body": "and yet you bought it", "score": 10, "replies": [{"body": "Well yeah it was a nice shirt", "score": 3, "replies": []}]}]}]}, {"body": "To be clear, they were offered 8.4 B to buy out the current owners?\n\nThis seems to be the opposite, where the owners are valuing the company at a buy out share price, so of course it’s beneficial to them if the price is lower", "score": 47, "replies": [{"body": "It looks like the family were ones who made the offer in 2018 also, but they don’t control the board so it was rejected. \n\n[Bloomberg article](https://www.bloomberg.com/news/articles/2018-03-05/nordstrom-rejects-takeover-proposal-from-chain-s-founding-family?embedded-checkout=true)", "score": 15, "replies": []}]}, {"body": "Reminds me of a small cap that was offered $5 per share... shareholders refused. Before covid. Then all activities forcibly stopped, debt was unmanageable, the company had to issue shares just to stay alive, next is a downward spiral of increasingly large share issuance at increasingly low share prices, today it trades at 0.007 with a total share count in the 10 (11?) digits.", "score": 8, "replies": []}, {"body": "Investors are the ultimate used car sellers on craigslist that mark way above FMV and wonder why no one's biting.", "score": 10, "replies": []}, {"body": "They were also worth 45 to 65 depending when the offer was made. \n\nSo 2x to 3x their current value of 3.8bn.  And since the current offer is essentially market price they probably didn't offer a premium back then either.", "score": 3, "replies": []}, {"body": "It's the ole blockbuster Netflix story ", "score": 2, "replies": []}, {"body": "> 5 years later they are getting a $3.8bn offer...\n\nKind of hard for management to predict COVID 19 a year in advance when share price craters from $60 / share in Q4'18 to $18 / share Q3' 20.......", "score": 1, "replies": []}, {"body": "Theoretically this is 35 % up from the initial march start of all this as well.     Nordstrom never really recovered from Covid.  But is ding better than many big boxes", "score": 1, "replies": []}, {"body": "Oh no how is Erik Nordstrom going to survive?\n\nI don’t care if billionaires get lowballed", "score": -2, "replies": []}]}, {"body": "Absolutely no chance they will take this offer.", "score": 100, "replies": [{"body": "Why?", "score": 7, "replies": [{"body": "Stocks already trading at 22.75 or so.  Lots of positive momentum with the stock, Rack chain is growing and making money.  Cohen on the board bought his 5% between 23-27 per share, he will be actively against the offer i'd guess.", "score": 35, "replies": [{"body": "The current price of the stock does not indicate if current shareholders would be willing to sell at the offering price. In March, the stock was around 17.00 before the announcement as per the article. The current price of the stock could potentially be that high only because of the potential buyout", "score": 8, "replies": [{"body": "Hard agree. When the board rejects the offer I think the stock will swing back to 20", "score": 3, "replies": []}]}]}]}]}, {"body": "I think the family enjoys the window shopping but never actually has the intention of moving forward. They have been doing exactly this for as long as I can remember", "score": 92, "replies": [{"body": "Tbh Nordstrom Rack’s quality went down. I used to shop there a lot but then they start selling off brands that you can’t find in their normal line stores and designer deals aren’t much of a deal.", "score": 53, "replies": [{"body": "Nordstrom Rack feels like it went one step forward, two steps back. It’s like an upper middle class Ross.", "score": 51, "replies": [{"body": "Yes! That’s so true!", "score": 3, "replies": []}, {"body": "Middle middle class", "score": 3, "replies": []}, {"body": "I just started shopping there in the past year. What was it like before? Similar to Ross and TJ Maxx?", "score": 1, "replies": [{"body": "It used to be solely (or at least significantly) cast-offs from the mainline Nordstrom stores. Now it’s full of product you will never find in a Nordstrom, purchased specifically to be sold at the Rack. Much better sizing, but it’s no longer a place to get designer deals. It’s just a nicer TJ Maxx.", "score": 10, "replies": []}]}, {"body": "> It’s like an upper middle class Ross\n\nWasn’t that always the point of Nordstrom Rack?", "score": 1, "replies": []}]}, {"body": "Damn, haven't been in a while, but used to like it.   Sounds like it's using the outlet mall model, where they just sell shittier outlet specific versions.", "score": 1, "replies": []}]}, {"body": "Their $8bn offer a couple years ago was legally binding should it have been accepted", "score": 11, "replies": [{"body": "Twitter anyone lol", "score": 9, "replies": [{"body": "I love how simply nobody can or will call it X. Strong rebrand effort Elon.", "score": 9, "replies": []}]}]}, {"body": "Pretty sure they kick this rumor up any time the stock starts to slip", "score": 5, "replies": []}]}, {"body": "It’s amazing that just a few years ago the board turned down an $8b going private deal as too low. Now the family wants to buy it for less than half that amount. Any shareholders want to join in a class action suit against the board?", "score": 195, "replies": [{"body": "Don’t think you have a case there to be honest. \n\nJust because the value of a company drops does not mean shareholders can sue. What would have happened if they sold for 8.5 billion but the shareholders believed they could’ve sold it for 9.5 billion?", "score": 78, "replies": [{"body": "Yeah unlikely to have a case, but keep one thing in mind, ANYTHING can be securities fraud and securities fraud is expensive to litigate. So even a flimsy case can turn a few bucks for the lawyers because the defendant would rather settle.", "score": 16, "replies": []}, {"body": "Either way they continued to mismanage the company", "score": -4, "replies": []}]}, {"body": "It's been 5 years. Covid happened. No human operates with the perfect insight that is hindsight.", "score": 38, "replies": []}, {"body": "there's a reason Ryan Cohen called them out", "score": 29, "replies": []}, {"body": "I bought this year and it’s doing well. Are investors panicking? Should I be panicking right now?", "score": -1, "replies": [{"body": "Depends on your cost basis", "score": 1, "replies": []}]}]}, {"body": "Liverpool will likely take Nordstrom into Mexico and cover the High End Retail segment. which they lack currently.  This seems like a good idea given they already own 10%. and the Mexican upper class is already very familiar with Nordstrom due to them spending lots of time in Large Border cities(SD,LA,PHX,MIA,Dallas and Houston come to mind)", "score": 18, "replies": []}, {"body": "Hope the bagholders DCA'd it from the highs....", "score": 14, "replies": []}, {"body": "They were literally above 23 today. \n\nNormally when you offer to buy someone out you pay a premium.\n\nWhy would anyone agree to this lol 😆 \n\nShould have offered it in November when they were at 13", "score": 5, "replies": []}, {"body": "So no premium now? No thanks", "score": 4, "replies": []}, {"body": "They took r retail", "score": 3, "replies": []}, {"body": "So if this goes through and price is 22.75, I could make a quarter?", "score": 8, "replies": [{"body": "Yes. The difference in the current price is the skepticism of the deal going through.", "score": 13, "replies": [{"body": "That's apparently a lot of faith in it going through lol", "score": 7, "replies": [{"body": "Or it’s a low offer", "score": 4, "replies": []}]}]}]}, {"body": "One thing I learned living in Seattle is Nordstrom’s management has been a clusterfuck for a while.", "score": 2, "replies": []}, {"body": "I’d let them have it if I were a shareholder.", "score": 1, "replies": []}, {"body": "to be honest, they should just do it without the Mexican retailer (i mean if they had 8bil 5 years ago, they for sure have 4bil today)..... and allow the Mexican retailer to run the Nordstrom stores in Mexico via agreement to keep the business in the family hands.", "score": 1, "replies": [{"body": "Liverpool already owns around 10% of the company. they are a large Retailer/Mall operator and Credit card issuer. They currently cover the upper middle class and below in terms of their offering. Nordstrom would fit in nicely by catering to the upper middle class and above and competing with the Other giant which is \"el Palacio de Hierro\" which mostly covers the higher end.", "score": 9, "replies": []}, {"body": "They didn’t have the $ in 2018, it was contingent upon financing - and the board didn’t think the brothers could get financing together for it.", "score": 2, "replies": [{"body": "didnt think but wanted it and didnt test it?... no they just didnt want it so they didnt even try.", "score": 1, "replies": []}]}]}, {"body": "Did the family realistically think the board would accept this offer? Or is there an underlying strategy to this bid? Are they trying to attract other buyers?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "And almost 10 years ago it was $80, what's your point?", "score": 37, "replies": [{"body": "Past results are indicative of future performances, and stocks do go back to all time high and then to the moon, which is why we buy buy buy regardless of any price or value assumptions.\n\nIts a casino after-all, so why do you even care?", "score": 5, "replies": [{"body": ">Past results are indicative of future performances\n\nReality is actually the exact opposite.", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "What actually makes it undervalued, and don’t say the reason is because it used to be valued higher", "score": 13, "replies": []}, {"body": "yesterdays price is not todays price. Paypal's stock was ~$280 3 years ago, does that mean it should reflect a higher price? What about nordstrom makes you think it's undervalued at it's current level?", "score": 6, "replies": []}]}]}, {"body": "KSS rejected an offer at $63 in 2022 and is now $20, M rejected offers in the low $20's and is now $15. In 2018, the Nordstrom family tried to take the company private at $50 and that got rejected, 6 years later and now it's offering $23.\n\nThings are now quite a bit worse for department stores then they already were 5 years ago. There's not a better offer coming and imo shareholders should take it.", "score": 7, "replies": []}]}, {"body": "The only thing I know about Nordstrom is the failed store they had at the Toronto Eaton center since I live down the street from there. When the renovations finished and the store was open, I would quickly glance at the prices  as I walked through to get to the other stores. I don't know who's buying 400 dollar shoes or 600 dollar purses, etc but I'm glad that kind of store is gone.", "score": -5, "replies": [{"body": "Toronto is literally the home of Hudson’s Bay Company, owner of Saks and Nieman Marcus.", "score": 8, "replies": [{"body": "The Bay has to be the next retailer to fall. The stores are slow, the merchandise is no longer good quality.", "score": 3, "replies": [{"body": "They’re a holding company at this point, IMO. Mid- to mid-high department stores have been getting squeezed for decades.", "score": 1, "replies": []}]}]}]}]}
