{"title": "I'm currently down A LOT, like 16%. I bought in at like 123, which was a huge mistake. Should I just cut my losses and sell and put my money into something safer?", "selftext": "[deleted]", "id": "1f9dmtf", "created_utc": 1725509594.0, "score": 0, "upvote_ratio": 0.21, "num_comments": 89, "comments": [{"body": "What’s your point?  It sounds like you have it all figured out.", "score": 12, "replies": [{"body": "My thoughts exactly. With such conviction of where the the “ceiling” will be for the next 2 years, why is he asking this at all?", "score": 6, "replies": [{"body": "He’s not. Just trying to convince himself that Nvidia is a bad investment when in reality he just got in at the wrong time.", "score": 5, "replies": []}]}]}, {"body": "No. Hold it. It will climb", "score": 9, "replies": [{"body": "earnings are solid, good products and wise management. Why sell?", "score": 5, "replies": []}]}, {"body": "So, your plan is to compound your initial error by selling? I'm curious - what was your initial premise in buying NVDA? Or, as you alluded to - greed was the reason you bought NVDA at $123? In effect, you thought you would make a 1-2 week killing . . . sort of a get rich quick scheme? \n\nUsually, I don't waste time with imbeciles, but I am going to give you some simple advice. To wit, do NOT sell. Yes, it may take a week, perhaps a month or two to reach $123, but I can almost guarantee you that it will be at $150 or above by January 1st. Oh wait, your time line is 1-2 weeks, right? Nevermind . . . \n\nSome people are wise. You are otherwise.", "score": 16, "replies": [{"body": "Let him sell and learn the hard way lol", "score": 7, "replies": []}, {"body": "Don’t be a fucking dick. ", "score": 0, "replies": []}, {"body": "disarm middle cobweb library deserve marvelous fanatical strong fear dazzling\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -9, "replies": [{"body": "Lol where is the general sentiment that Nvidia will go down to 50 dollars? It was at 98 a few weeks ago and climbed back to 130. Get your head out of your ass", "score": 7, "replies": [{"body": "I think he's looking at the trolls on here.\n\nI don't think it's going to 130 in the next month or two...there's really no catalyst and it should mostly trade sideways, but...Blackwell. That's all you need to know. Q3 earnings, they'll have updates on shipping Blackwell(Should be shipping in large quantities by then) and...I think it's a 200B revenue year in Fiscal '26. \n\nI can't imagine buying at 123 and selling, but...the the market is great for transferring wealth from the impatient to the patient.", "score": 7, "replies": [{"body": "It will be back to 130 in October. The rest I agree with ", "score": 1, "replies": [{"body": "What's the catalyst you see pushing it up to 130 by Oct?\n\nThis is just a bad stretch for NVDA. I don't think it goes below...\\~98 or so, but there's no catalyst and now, it'll be treated as a NORMAL company. If it beats by 4%, it's going to get a massive bump, not punished.\n\nI expect earnings of \\~34.5B, 74% revenues and then guide for 40B. THAT is the next catalyst...unless you have another.", "score": 2, "replies": [{"body": "Lol what do you mean? The same catalyst that has been pushing it since the end of 2022, AI. You think there was one catalyst that launched it to where it is now? It definitely wasn't their earnings because they were undervalued for a long time and we have this most recent debacle as a reminder that their earnings don't really mean shit to this market. Stocks go up, stocks go down. ", "score": 0, "replies": [{"body": "Yeah, it was absolutely their earnings and their insane growth. It went from beating expectations by \\~32% to 3.8%(and the whisper expectations were actually closer to 33B this past quarter).\n\n  \nI'm not sure how you can say it was \"undervalued\" for a long time...that...just doesn't make sense. Based on what metric?\n\nAnd the latest earnings absolutely do not prove earnings \"don't really mean shit,\" they prove that NVDA's growth has decelerated to the point now it'll be treated like an MSFT, AAPL, AMZN, other top companies. \n\nIt won't have unrealistic growth expectations, if it does beat now by 5%, the stock will go up. \n\n  \nBut...the insight, \"stocks go up, stocks go down,\" is...enormously helpful! I've been in NVDA since 2020. I've seen it go up and go down plenty. The stock is not in the same place as it was when it was beating expectations by 30% or 15%. The time of exponential growth is over and now it's just going to be normal, steady, healthy growth. I don't know why you think it's going up over \\~10-15% based on nothing by Oct, but...sure. Hope you're right.", "score": 1, "replies": [{"body": "Based on nothing, sure. You should go back and look then since you've been a stock holder since 2020 genius. You're absolutely wrong about it not being undervalued when the growth skyrocketed at the end of 2021. But sure, just lie to be right on reddit 👍 By the way you're parroting the same thing all the other analysts say, nothing unique at all. The stock is crashing because of growth slow down. You know that's literally just guessing right? What makes you think you're right in that analysis? Other people have said Anti trust rumors, market makers scaring retail, a whole list of other \"analysis\". You're all just guessing. Your analysis isn't helpful, educated, or right! It's just guessing! ", "score": 0, "replies": [{"body": ">The stock is crashing because of growth slow down. You know that's literally just guessing right? What makes you think you're right in that analysis?\n\nUh...wait, who said the stock was \"crashing\" now? You said some magic, unknown catalyst was going to push it back over 130 in \\~3 weeks for...absolutely no reason other than \"just cause.\" Now it's an argument why it's \"crashing,\" when it's not \"crashing,\" it's correcting, but...sure. \n\nAnyway, \"literally guessing?\"\n\nYou know there is a record of this, right? \n\n[https://finance.yahoo.com/news/the-biggest-challenge-for-nvidia-stock-in-one-chart-142146081.html](https://finance.yahoo.com/news/the-biggest-challenge-for-nvidia-stock-in-one-chart-142146081.html)\n\n>You're absolutely wrong about it not being undervalued when the growth skyrocketed at the end of 2021.\n\n  \nHuh? You know it was in the red 3 straight quarters in there. \n\n  \nBut why don't YOU share what is a \"fair\" value for a company that's generating significantly less revenue than AAPL or MSFT right now, but you think is UNDERVALUED at 3T market cap? Should a company have a 4.5T Market Cap and a 80PE? Does that make sense to you?\n\n\n\n>  \nBut sure, just lie to be right on reddit\n\nWhat did he lie about? Are you ok bud?\n\n  \nSome of you are not investors, you're fanatics. You're looking at this shit more like a sports team...and it's weird. \n\n>  \nYour analysis isn't helpful, educated, or right! It's just guessing! \n\n  \nWhat analysis? That the growth has slowed? That's just objectively true.\n\nThat it's not going to go up to 130 for NO reason in the next month? Uhm...sure. That's a guess. What do you think you're providing?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "trees jobless hobbies snow swim subtract concerned frighten memory juggle\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": [{"body": "No, it's not. You have no idea how stupid you sound. \n\nJust...again, GO-BUY-AN-EFT.\n\nYou don't have the guts for this. You'll get a nice 10% return on an EFT. You won't make as much, but we won't have to listen to you whining, asking for advice that you're not going to take anyway.", "score": 2, "replies": [{"body": "desert merciful sort intelligent apparatus piquant impolite oatmeal reach payment\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": [{"body": "Cool. Then you're out...because you're too dumb to listen to actual professionals, look at historical trends, listen to META, MSFT, AMZN, GOOGL all talk about INCREASING their CapEx moving forward and the demand vastly exceeding the supply well into Fiscal 2026, but...sure, NVDA will be down another \\~30%.\n\n  \nYou're a special brand of stoopid that really should have someone else manage the 15 shares worth of NVDA you do have.", "score": 2, "replies": [{"body": "Agreed with this post. The CapEx is increasing, blackwell is coming out, etc. If OP can hold on, which it sounds like they can't stomach it and is trolling us all to make them feel better, then you'll be rewarded once Blackwell ships. Everyone is concerned it will continue to slip - that's how program management works. If NVDA achieves shipments in this next quarter then we'll see the stock pop. If not, it'll continue to trade sideways / slightly decrease until it does.", "score": 1, "replies": []}, {"body": "wide quiet groovy sugar offend test fact nutty cautious governor\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "Cool. And I'm guessing you think that's a lot...that's less than 90K. What are you crying about? You're down like...12-13K in SEPTEMBER?\n\nYou're not mature enough to invest in this kid.\n\nNVDA went from 974 in March to 720 intraday on April 19th. It went from 140.5 to \\~92 on August 5th. Went from 500 to 400 last Sept. The Sept before that it was down. It's always down in Sept.\n\nIt's volatile. You can't handle that.\n\n  \nYou're actually dumb enough to think it was EVER priced in ANYWHERE that they were going to beat expectations by 30% moving forward?\n\n  \nYou have to be a troll...I don't think someone can fake this type of stupid.", "score": 2, "replies": [{"body": "placid wakeful historical caption abundant retire scary shaggy swim angle\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "Holy Fuck dude...did you NOT see my post? It does that ALL the fucking time!\n\nSo buy an ETF as you're not built for this.\n\nIt wasn't because ANYONE priced in a 30% expectations beat. Do you know what that would have been?\n\n\\~39B in Revenue  \n\\~22.5 in Net revenue\n\nHow new to investing are you? Seriously, this has to be your first time investing if you thought they were EVER expecting 30% growth(OVER expectations) this quarter and that was \"priced in,\" the stock would be in the 70s right now. If they missed by 30 fucking percent of what the street expected and they WOULD be at 70-something instead of just going through a normal Sept dip. If they'd beaten expectations and come in at 39B in revenue and nearly 23B in net, they'd be at about 180 and I WOULD be selling as THAT is insane!\n\nI'd suggest VUG, but even that's too volatile. VTI. That's a good ETF for you to be in. You're too goddamn delicate for this.", "score": 1, "replies": [{"body": "ten cough spotted ink towering smile squealing observation workable scary\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "Yup. That's cool. Some people don't have the stomach to invest any time the VIX is above 3. \n\n  \nJust don't do the whole, \"if I'd have just stayed in, I'd have made\\_\\_\\_\\_ \" down the road and you'll be fine. \n\nBut if you're this upset over that little of a loss, you definitely need to be in not just an ETF, but a LOW risk ETF.", "score": 1, "replies": []}]}]}]}]}, {"body": "You should really do some actual research on the Stock instead of just crying about losing a few dollars.  \nOr you shouldn't invest money you need right now.  \nHow broke are you?\n\n  \nAnd now, not \"priced in.\"  \nhttps://finbold.com/wall-street-predicts-nvidia-stock-price-for-next-12-months-4/#:\\~:text=In%20many%20ratings%20released%20after%20Nvidia%E2%80%99s%20Q2%20earnings,results%20as%20strong%2C%20with%20%2430%20billion%20in%20sales.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "It likely won’t even go past 100", "score": 6, "replies": [{"body": "bedroom encourage mindless fearless zealous silky offbeat deer towering fear\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -6, "replies": []}]}, {"body": ">The general sentiment seems to be that Nvidia can go a lot lower than it has. Like it could get down to 50-60 dollars in a month or two, it dropped 10% in one day and it didn't recover today, plus there's a likely bad jobs report Friday.\n\nWhat in the fuck are you talking about, the \"general sentiment?\" \n\nLOL...no, it's one of the fastest growing companies in the world Go back and look the last couple Septembers. It's the worst month of the year. \n\nBut if you can't handle it, put the money in ETFs. Don't come running back here when Blackwell comes out and the price shoots up to the 150 range next year. \n\n>  \nYup and I could have sold that day and made a few thousand, waiting until after earnings fucked me. Lesson learned.\n\n  \nThe lesson should be don't try and time the market. Your lesson has ABSOLUTELY not been learned. \n\nI bought this stock in 2020. It immediately went down. I've held and it's up...I don't know, 3000%. A lot in any event. \n\n>  \nI'm not seeing ANYONE targeting that price in 1-2 months. It is unlikely that is going to happen. It will likely be much lower than today at that point, like 70-80\n\n  \nI don't know who the fuck you're listening to, but go look at the price target by EVERY analyst. ONE has a 90$ price target on it...and he's the same one who's been wrong the last 2 years. EVERY other one is \\~130-180. \n\n  \nDo you think for yourself or are you using REDDIT posters price targets?\n\nI don't know if it'll be over 123 in the next month or two, but it's going WELL past that when Blackwell revenue comes out. \n\nQ3 earnings and Q4 Guidance will likely push it back to the 130 range, Q4 Blackwell earnings and Q1 Guidance in the 150 range. But...if you're listening to me or anyone else, then...yeah, sell. \n\n>\n\n>Probably not, we're probably in for an even bigger selloff at next earnings.\n\n\n\n  \nOk, so you...just don't really understand what's going on. Then...again, yes, you should sell.", "score": 2, "replies": [{"body": "aromatic cover quack violet frighten fragile slap ancient judicious subsequent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "No, they won't kid. They quite literally adjusted them AFTER the earnings report. They adjusted them UPWARD after earnings.\n\nThis happens every Sept. \n\nI know the person who sets the prices and researches this stuff for one of the largest investment firms in the world. He was the one telling me to get into NVDA in 2016. He's the one who got me into TSM at 80 a share, AMZN at 80, AVGO, PAWN, etc...\n\n  \nNVDA's price target has gone up. Where the fuck are you getting they'll be \"adjusting those,\" in the next week coming off STRONGER than expected earnings?\n\n  \nI'm at a loss for words. Just get out. Go buy VOO or whatever and stop whining. And then when it's back at 160, don't bitch about THAT either, cool?", "score": 1, "replies": [{"body": "fear grandiose lunchroom existence pot mighty familiar dolls cats light\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": [{"body": "THE PRICE TARGETS CAME FROM AFTER THE EARNINGS REPORT...you fucking child!\n\n  \nAnd Blackwell was delayed. \n\nBut why are we still doing this? I told you, get into an EFT. You're too gutless to do this. You're not cut out for it. A little volatility and you're whining like a child.\n\n  \nHow much did you invest?", "score": 1, "replies": []}, {"body": "Oh shit...I just got it. In your post about not fucking in 10 years. You're \"Apooroldinvestor,\" with a new account!\n\n  \nLMFAO...yeah, you're definitely that sorry dude.", "score": 1, "replies": [{"body": "whistle hateful puzzled knee hard-to-find attractive elderly entertain distinct march\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "Don't believe you...but also don't care.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If you're so intelligent that you can accurately predict all the price action, then why ask us? You obviously have no idea what you're doing, or you wouldn't be posting this on Reddit. In your comment, you act like the oracle of the stock market, yet all your opinions are based on what other people think.", "score": 1, "replies": []}]}, {"body": "Thinking this will ever get above 140$ again is absolutely delusional....", "score": -5, "replies": []}]}, {"body": "I’m at 129, you’ll be fine. Just stop looking and come back in a few months.", "score": 8, "replies": []}, {"body": "So you thought the company was overvalued and yet still bought in? According to your own analysis, you think it would fall into the 80-90s, why not get in then or short it? I assume it was probably FOMO?", "score": 7, "replies": [{"body": "truck late heavy numerous sparkle entertain impolite spoon cooing possessive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -3, "replies": [{"body": "Well, I don’t think it’s gonna go down as low as you think. At worse, I’m thinking in the 90s if it even goes that low. \n\nYou mentioned you’re already rich so money shouldn’t be an issue. That actually gives you more options- either sell and eat the lose or hold. But I think you’re making a mistake to sell now; your analysis was wrong to get in at 123 and I think your analysis is wrong that it’ll drop as low as you’ve stated. If you sell now, you’ll have brought in high and selling low. \n\nBut it’s your money and ultimately your choice.", "score": 1, "replies": []}, {"body": "What in the actual fuck makes you think that a company with more demand than supply for the next at LEAST 18 months and a product coming out NEXT QUARTER, the B200 NV72 stacks which are roughly twice as expensive as Hopper...is going to drop to a...\\~1.6 market cap and 60 dollars a share!\n\n  \nLOL...that's SO incredibly stupid...\n\nWhat stocks have more growth but also SO much less downside? NVDA just have a 4% beat, 30B in earnings, nearly 17B in net revenue and it WAS a relatively bad quarter as Blackwell was delayed...slightly.\n\n  \nBut yeah, you're asking a stupid question. You seem to have it figured out. So well. Just don't whine when you lose out on the tens of thousands of hundreds of thousands of dollars of gains(I'd assume you have at least 4-5K shares for you to be this panicked).", "score": 1, "replies": []}]}]}, {"body": "I’m leveraged and honestly kinda calm. Bought and trimmed during early August and did the same thing now. \n\nMy luck sucks cuz it has a chaotic drop when I buy but it’ll bounce back. Fundamentals are great and man I’m just hyped for Rubin and Blackwell. It is going higher by their next earnings for sure", "score": 3, "replies": [{"body": "vast judicious recognise chop nail stupendous deserted encourage humor ad hoc\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": [{"body": "Short it", "score": 3, "replies": [{"body": "plough bright shaggy public paltry attractive dime dinosaurs tie overconfident\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "But you sounded so sure that it’ll go lower in your post. Into the 80s-90s if not lower.", "score": 3, "replies": []}]}]}]}]}, {"body": "Yeah you should sell that way it can go back up to new all time highs lol", "score": 4, "replies": [{"body": "chop dam deserted busy one stocking shocking aspiring friendly makeshift\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": [{"body": "Okay then sell 👌", "score": 7, "replies": []}]}]}, {"body": "I lost more than 2x value in the last two days than I originally spent four years ago. This is not the first time it’s happened and it won’t be the last. I still have it.", "score": 2, "replies": []}, {"body": "Dude I bought 150 shares at 130 lol. I plan on buying more if it dips down. No biggie", "score": 2, "replies": [{"body": "overconfident cable groovy sophisticated aware degree escape fuel shocking flag\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "Nvidia is heavily manipulated by mm. Patience grasshopper. If you believe the in company, then there’s nothing to worry about (unless you’re heavily leveraged lol). I believe nvidia is going to explode in the coming years and I want to hold on a few hundred in my portfolio so I look at it, if it dips, I’ll average down. Winning for me in the long run.", "score": 2, "replies": []}]}]}, {"body": "Premise 1: You're rich (according to you)\n\nPremise 2: NVDA will be dropping to 50 (according to you)\n\nConclusion: As NVDA drops to 50, buy more. A LOT more. It will lower your average cost basis, and set you up in a solid position for the recovery back up.", "score": 2, "replies": [{"body": "dog office hospital straight agonizing cough rob worthless encouraging screw\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 2, "replies": [{"body": "\"I don't think Nvidia is a good investment at all.\" - Genius move buying at 123 then\n\nstop pretending like you know what you are doing, just sell and stop wasting our time lol", "score": 4, "replies": [{"body": "IKR\n\nDoesn’t think it’s a good investment yet invests in said bad investment.", "score": 3, "replies": []}]}, {"body": "Well, that's a conclusion only you can make for yourself. Why did you invest in NVDA at all if you don't think NVDA is a good investment at all? It's pretty clear what NVDA is contributing to our rapidly emerging technological society. If you want out, get out, but the overall sentiment here is to hold. Not because we're a Gamestop crowd, but because we see and we believe.", "score": 2, "replies": []}, {"body": "I feel like you’re just trying to push blame on your own bad investment. Nvidia is not like the GME short squeeze. Plus, this run has been going on for well over a year now, but you chose now to get in.", "score": 2, "replies": []}, {"body": "Have you done any research into the company? Have you listened to their earnings or checked out their financial statements? It sounds like you just read articles and social media posts and that's your basis for investing. \n\nYou're clearly oblivious to what the company is doing and what it's outlook is if you're comparing it to GameStop. The right thing for you to do would be to sell and buy an index so you don't have to think too hard about the specifics of a company.", "score": 1, "replies": []}]}]}, {"body": "Is 16% really ALOT to you. Goodness. That is nothing. I’m assuming you didn’t live through Covid, the housing debacle or 1999?   16% in my world is nothing. \n\nClearly, if you are upset over normal ups and downs please stick to VTI and only look one a year.  Good Luck!!", "score": 2, "replies": []}, {"body": "Same but at 126..  not sure what to do. If I sell now I’d lose over 18k which is a lot for me. 951 shares", "score": 2, "replies": [{"body": "wild smile subtract ask stocking cats rhythm cobweb mourn start\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": []}]}, {"body": "Let me know when you're down 80%", "score": 1, "replies": []}, {"body": "I know what you are saying but it was 123 just a week ago. Personally i have a feeling it might go down more and who knows for how long. BUT i will not let my feelings dictate and i will observe whats going on. Possibly sell at my average price when it goes up and buy back when it goes down more.\n\nSo the short tip is to cut the feelings and stick to your plan. So your plan depends on multiple factors, like how long could you wait, do you need the money right now? Anyhow, jumping the gun after just a week might be a bad idea. You might be affected by the doom and gloom talk, which might turn out to not be correct.", "score": 1, "replies": [{"body": "flowery fragile shy jeans enjoy skirt scandalous crawl one unite\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -1, "replies": [{"body": "Ok, the doom and gloom got you. My perspective is that very recently it dipped to 92 and then back to 130 and it might happen again.\n\nBut only you can decide what your financial plan is. We shouldn't give you advice on this and you shouldn't listen to any either. Just make an informed decision.", "score": 2, "replies": []}, {"body": "“Than any other stock in history”. Are you 9 years old?!? What??", "score": 2, "replies": []}]}]}, {"body": "At 123 you should be fine. In the next 6 months it will be more than that (unless you need the money)", "score": 1, "replies": [{"body": "mountainous run plucky cooperative one wide aback marry strong hard-to-find\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -1, "replies": [{"body": "You're not built for this kid. Go buy an EFT.", "score": 2, "replies": []}]}]}, {"body": "Why not just sell covered long term calls?", "score": 1, "replies": []}, {"body": "Profits go up if you learn to average down.", "score": 1, "replies": []}, {"body": "So you were clueless when you bought in at $123, and now all of the sudden you're Warren Buffet and you just happen to know that the stock is overvalued and that VOO will provide more stable returns? Which is it? Are you a bumbling fool or an investing savant? I have a guess as to which one... Also 16% isn't that much. If you're shook from that then just sell and move on and stop making garbage posts in this sub.", "score": 1, "replies": [{"body": "rock melodic divide profit narrow encouraging toy normal tan crown\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "You don't even know what the company does, what exactly were you looking at in the earnings? Sounds like you were gambling and it didn't work out. The right thing to do is hold because the company is actually viable and is a multitrilion dollar company at the forefront of a new industry. Kinda like Google in the early 2000's. But in your case just sell, because you clearly don't know what you're doing.", "score": 1, "replies": []}]}]}, {"body": "DCA and sit tight for a while.", "score": 1, "replies": []}, {"body": "Remind me in 60 days.", "score": 1, "replies": []}, {"body": "As if a trillion dollar company isn’t a good investment.", "score": 1, "replies": []}, {"body": "It’s going to get brutal this month and this whole winter. If it does go back up it’ll take a very long time. I won’t blame you if you sold and cut your losses. I do think it’s going get worse. So it’s up to you.", "score": 1, "replies": []}]}
{"title": "NVIDIA WILL GO DOWN FURTHER ", "selftext": "[removed]", "id": "1f9cijz", "created_utc": 1725505911.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 weeks ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 7 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Nvidia debunked the DOJ subpoena. It’s going to the moon tomorrow", "score": 31, "replies": [{"body": "I hope you are right but at this point I’m no longer excited to wake up and check the market", "score": 3, "replies": []}, {"body": "By that logic, it should have done so after hours.", "score": 3, "replies": []}, {"body": "Your upvotes show most people are optimistic right now which is right in long term but wrong in short term…", "score": 2, "replies": [{"body": "I mean I’m just waiting for the markets to open to see what kind of shit show happens. I’ve decided I’m not selling at all, we’ll see where it’s at in 10 years", "score": 3, "replies": []}, {"body": "You're just a guessing gambler like everyone else.", "score": 1, "replies": []}, {"body": "Bill Shortterm just quits.", "score": 1, "replies": []}]}]}, {"body": "No one knows anything, risk or perish", "score": 27, "replies": [{"body": "Right, but ???", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "“Buy high, don’t sell” - Grandma", "score": 11, "replies": []}, {"body": "“Buy Buffet, Sell Warren” - High Low", "score": 9, "replies": []}, {"body": "\"Llllllet's get ready to sell lowwwww!\" -Michael Buffer", "score": 2, "replies": []}, {"body": "\"Buy Buy Buy' - NSYNC", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "You basically said what every and their mema has said for the past month. The stock will trade up down and sideways because it fucking can. In the end, stonks always go up!", "score": 14, "replies": [{"body": "No they don’t\n\nhttps://stockanalysis.com/actions/bankruptcies/", "score": -1, "replies": []}, {"body": "Yessss but people don’t listen as an example look at that INTEL grandma guy !!!", "score": 0, "replies": [{"body": "https://preview.redd.it/b3z0kuxacxmd1.jpeg?width=1024&format=pjpg&auto=webp&s=72f716cb5be0036e8cd334d73e6c8f03a5548771\n\n*poor Intel guy*", "score": 3, "replies": []}, {"body": "That guy was just plain regarded. I feel that if he would have straddled it, he would have hit big. But time will tell. It would be fucking nuts if intel gets bought for a premium and the guy rakes in millions.", "score": 0, "replies": []}]}]}, {"body": "To $91? Got it.", "score": 11, "replies": [{"body": "You mean $19?", "score": -2, "replies": [{"body": "No, OP said $91, so the market and the forces of the universe have to align and somehow make NVDA drop exactly at $91, and then that will *freak alot of retail traders and force them to close their positions*\n\n...and then it will bounce back making *newer higher highs*", "score": 5, "replies": [{"body": "If this happens lm gonna give you a blowjob for free and l hope it will happen.", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4640)![img](emote|t5_2th52|31226)", "score": 4, "replies": []}, {"body": "He doesnt visit wendys", "score": 1, "replies": []}]}]}]}]}, {"body": "All u gotta do is tell me when it will go down that low buddy", "score": 9, "replies": [{"body": "Buddy be patient, don’t let the market break your precious heart 🫡", "score": -12, "replies": []}]}, {"body": "Still pumping INTEL. Sorry.", "score": 8, "replies": [{"body": "Grandma last words, “Buy INTEL” 💀", "score": 1, "replies": [{"body": "Those words were \"bye Intel\". He fucked up.", "score": 3, "replies": []}]}, {"body": "RIP", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/tq3n9dorzwmd1.png?width=750&format=png&auto=webp&s=7fbfd5fb8860274fe43496bd54292a2961f73b14", "score": 3, "replies": [{"body": "You don’t clean it afterwards?", "score": 1, "replies": []}]}, {"body": "This is it +10% tomorrow or ban ", "score": 3, "replies": []}, {"body": "Nvidia already went down to 91.  It’s putting in a higher low.", "score": 5, "replies": [{"body": "YUSS!!!", "score": 2, "replies": []}]}, {"body": "I will buy more when it gets below my current average", "score": 4, "replies": [{"body": "Way to goooo", "score": 1, "replies": []}]}, {"body": "Great in depth DD and thoughtful analysis\n\nBut I do think there is further downside based on how few binary events turn out in a week", "score": 4, "replies": [{"body": "I agree but I wish market will respect that sentiment", "score": 0, "replies": []}]}, {"body": "Put your money where your mouth is then, show us your short positions.", "score": 2, "replies": [{"body": "I don’t short, I only long, you got a problem???", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "Wait for Cerebras to go public. More disruption coming.", "score": 2, "replies": [{"body": "Never heard of it let me go check!", "score": 1, "replies": []}]}, {"body": "It’s time to flip on the dark side now and made shitload of money.", "score": 1, "replies": []}, {"body": "Moon 🌙", "score": 1, "replies": []}, {"body": "Thanks for saving my calls", "score": 1, "replies": []}, {"body": "ima buy Puts just to prove OP is wrong! the market always inverses me!", "score": 1, "replies": []}, {"body": "On a long enough timeline the survival rate for every stock is 0", "score": 1, "replies": []}, {"body": "lol what  happened in the comments![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "https://preview.redd.it/zuikqi1eaxmd1.png?width=318&format=png&auto=webp&s=c4776b83a42ee7741bf538eec8b1025c52b95b12", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/ceyxbkw2cxmd1.jpeg?width=1024&format=pjpg&auto=webp&s=36364fc06955c7e9af738054c347c1836addf2c5\n\n*it will do what further???*", "score": 1, "replies": []}, {"body": "NVDA puts !", "score": 1, "replies": []}, {"body": "Post wasn't in CAPSLOCK, could not take it seriously.", "score": 1, "replies": []}, {"body": "Sure. Yawn.", "score": 1, "replies": []}, {"body": "FFS...\n\nY'all just farming karma now with these posts.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Cool", "score": 0, "replies": []}]}, {"body": "What do you mean everyone is optimistic? I’ve read more pessimism on the stock than positive.", "score": 1, "replies": [{"body": "Maybe all you seeing is negative but not the case for me 😬", "score": 1, "replies": []}]}, {"body": "THE RESISTANCE, IT WILL RESIST!!!! (trading like this has never worked out for me but if you say it will im all in)", "score": 1, "replies": [{"body": "That’s why you are a SuperGuy!!!", "score": 1, "replies": []}]}, {"body": "I’m gonna buy it tmrw, or day after.\n\n$100~ is safe", "score": 1, "replies": [{"body": "Where did you get that number from? Is that your lucky number? Coz I don’t see any logic behind it lol", "score": -1, "replies": [{"body": "Nvda chart 3 weeks ago. \n\nI didn’t say $100 on the dot, nothings ever on the dot.\n\n$97, $103, whatever", "score": 1, "replies": []}]}]}, {"body": "It’s time to flip on the dark side now and made shitload of money.", "score": 1, "replies": [{"body": "How much is shitload of money for you? Just curious!", "score": 1, "replies": [{"body": "Just enough to pay for a “Hip-replacement”. Need to change this hip it’s been sitting on this chair for 3 weeks  looking for breakouts .", "score": 2, "replies": []}]}]}, {"body": "https://preview.redd.it/7al3h9dixwmd1.jpeg?width=750&format=pjpg&auto=webp&s=3b9c94bacc51dd8352c10cceac52da4c42b9fe33", "score": 0, "replies": []}, {"body": "It will not go up long term. Rate Cuts will be it's bubble pop trigger just like tapering was SHOP Bubble pop trigger November of 2021. Escape while you can. We are seeing it's long term top.", "score": -1, "replies": [{"body": "and you will become next president! Right?", "score": -4, "replies": [{"body": "No but I'll make another 800%+ this month. 800% last month, 85% shorting NVDA at exact top, now one more big one to get this bear market started right.", "score": -4, "replies": [{"body": "Positions or suck it", "score": 2, "replies": [{"body": "You can absolutely deep throat it bud, I'll show my hand when I close in roughly 3 weeks. I will say entered megacap tech puts expiring 1 month out. Pretty much just short QQQ. Overall market downturn only time you should short anything anyways.", "score": -2, "replies": [{"body": "Bro show proof!!! (every other person on reddit is a billionaire 💸)", "score": 2, "replies": [{"body": "I'll post my gain just like I posted all the others. You want more you can pay me for it bud.", "score": 1, "replies": []}]}, {"body": "Ok, somebody needs to put a remind me bot here. I don’t know how to do this or else I would. Then if true I’ll absolutely deep it, if not you will be my bitch behind a Wendy’s dumpster.", "score": 1, "replies": [{"body": "Yall can keep throwing remind mes all you want. NVDA bulls who missed it's 300% or so put spike so far certainty threw those around. I gave you general guidance. 10 to 13% drop nasdaq. Should be able to print plenty with that yourself. GL​", "score": 0, "replies": [{"body": "You closed your short. Do you see NVDA dropping more?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "5 min cost me $4000", "selftext": "Bought 100 AMZN 180 calls yesterday at $0.16\nSold at $0.35\n\nIf I would have just waited 5 min, would have been $4000 more.\n\n", "id": "1f9mqll", "created_utc": 1725543537.0, "score": 259, "upvote_ratio": 0.88, "num_comments": 84, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Don't dwell on lost profits.  Just take your W.", "score": 234, "replies": [{"body": "I know I know. But I tend to do this a lot with my winners.", "score": 41, "replies": [{"body": "Winners? What's that?", "score": 39, "replies": [{"body": "People can profit from stocks?!", "score": 28, "replies": []}, {"body": "https://preview.redd.it/b4t7o2xya2nd1.jpeg?width=511&format=pjpg&auto=webp&s=95b52bd0b1155ec767e0fde4221e5857ba78bd98", "score": 27, "replies": []}]}, {"body": "Yeah this is wallstreetbets not r/investing. This is the land of regards", "score": 11, "replies": []}, {"body": "Don't. Profit is profit. Be happy with it. \n\nI had 100 of the 100p for DG, sold them for $750 each, roughly. Hour later, they were worth $1100 each, EOD $1600 each. \n\nCould have made over $150k, but so what? Onto the next one, brother. Nice gains regardless.", "score": 7, "replies": []}, {"body": "Then you should start selling gradually", "score": 3, "replies": []}, {"body": "Don’t get mad about small wieners…. OH WINNERS", "score": 1, "replies": []}]}, {"body": "My stance.  Yes, If I didn't automate, might have made 5% more, but I like not sitting at the screen minute by minute.  And, I don't look at prices later.  Just move on to next trade.", "score": 6, "replies": []}]}, {"body": "If you waited 10 minutes it could have cost you your entire investment. Don't hit yourself for taking profits.", "score": 94, "replies": [{"body": "That isn’t an investment, it’s a gamble. \n\nI approve, but let’s call a spade a spade.", "score": 20, "replies": [{"body": "an investment intended to be held for 1 day is still an investment. no where in the definition of investment is the requirement of a large amount of time.\n\nnow you can call it a bad investment, since the probability of success due to such a low time scale is very low, but that's different.", "score": -5, "replies": [{"body": "Not sure why you’re getting downvoted, options are kind of like flipping houses…you buy a thing for cheaper than you hope to sell it for, and you hope to make a tidy profit quickly, but often times the longer you hold, the more risky it is.\n\nInvesting is about balancing risk and reward, not about time horizon…it’s just that most people consider long term buy and hold the only kind of “real” investing.\n\nOptions are gambling because most people don’t know what they are doing, but it is an investment vehicle, it’s a derivative form of investment vehicle, but it still involves an underlying asset and a prediction of appreciation.\n\nI think you’re right, but yes, most people are taking a chance and haven’t done enough due diligence, but that can even happen with long term buy and hold, house flipping, or any other investing.", "score": 7, "replies": [{"body": "I guess this is being picky, but options would be more like wholesaling than flipping houses.", "score": 2, "replies": [{"body": "On the money", "score": 1, "replies": []}, {"body": "Ok, I’ll accept it, since it’s a transaction involving an underlying asset with the hope that before you own the underlying asset you can extract value on the difference between what you can buy it for and what you think you can sell it for.\n\nI’ll approve that.", "score": 1, "replies": []}]}]}, {"body": "Would you call betting on the outcome of a coin flip “investing?” Because that’s what 1dte options are.", "score": 0, "replies": [{"body": "You are literally always betting on the outcome in investing, what are you even talking about?\n\nThe only difference is how much risk is involved. 0DTE are higher risk than Leaps, but you are still betting on the future.", "score": 1, "replies": []}, {"body": "Technically", "score": 1, "replies": []}]}]}]}, {"body": "Correct ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 2, "replies": []}]}, {"body": "Profit is profit king. Especially around +90%", "score": 63, "replies": []}, {"body": "You doubled your money, I think atp it’s clearly being ungrateful. Just gear up for the next ape move.", "score": 11, "replies": []}, {"body": "\"if I would've waited 5 mins, it would've been 4k more.\"\n\nyeah, and if you waited 2 hours more, you'd be down.\n\noptions are very volatile. next time if you think its going to keep spiking, scale out of your position slowly. \n\nbut don't dwell on what could've been, it will kill your mental health", "score": 10, "replies": []}, {"body": "They say the same for losses. Only 5mins. Went to $0", "score": 9, "replies": []}, {"body": "It didn’t “cost” you, you just missed out.", "score": 7, "replies": [{"body": " It's easy to fall into that trap of wishing you held on just a little longer, but you did make a profit. That's a win in itself. Don't let the what-ifs cloud your judgment. Just keep moving forward and look for the next opportunity. Markets are always shifting, so focus on building that next bag instead of dwelling on this one.", "score": 1, "replies": []}]}, {"body": "You left someone pregnant?", "score": 4, "replies": [{"body": "Plan B is $50", "score": 3, "replies": [{"body": "OHM my choice baby, 6 bucks on Amazon. Same amount of levonorgestrel. Extra 44 bucks to spend on options.", "score": 1, "replies": []}]}]}, {"body": "$4k could’ve gotten you a lot of cocaine and hookers 🤷🏻‍♂️", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Dem. Now they are $11,000", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "CLOV got me the other day, I sold when I hit even at around $2 ... it continued to climb to nearly $4.", "score": 1, "replies": []}, {"body": "lol did the same shit with Meta AND Nvda. total woulda been $120k or so. womp womp", "score": 1, "replies": []}]}]}]}, {"body": "Congrats and fuck you", "score": 2, "replies": []}, {"body": "Try Oklo 🫢", "score": 2, "replies": []}, {"body": "Well you obviously have the market figured out just go for it today and revenge trade", "score": 2, "replies": []}, {"body": "If you could repeat this level of success day over day you’d be a millionaire in no time", "score": 2, "replies": []}, {"body": "Gotta know when to fold 'em. Good job. Fuck you. Congrats!", "score": 2, "replies": []}, {"body": "So it didn’t really cost you anything. You just sold too soon. \nI read this thinking you lost $4k in 5 minutes and my boner was killed instantly", "score": 2, "replies": []}, {"body": "Sell half at 100% then sell again later if you're going to watch it", "score": 1, "replies": []}, {"body": "THERE'S ALWAYS ANOTHER ENTRY AND BE HAPPY WITH YOUR PROFITS.", "score": 1, "replies": []}, {"body": "Don’t sell at open when spreads are huge", "score": 1, "replies": []}, {"body": "Idk how many times I checked on my nvda 125 calls exp 8/28 when I could've made 500%", "score": 1, "replies": []}, {"body": "Brother, speaking from experience: do not beat yourself up over this trade. You did great already! \n\n$4,000 is a lot more but FOMO is the #1 way to lose all the bankroll you just built.", "score": 1, "replies": []}, {"body": "I had 40 of these contracts sold for .80 instead of 1.50 actually believed it would just keep going up smh", "score": 1, "replies": []}, {"body": "I feel for you bro. Pulled out of DLTR at like 6k profit with later wouldve been 26k. But at the end of the day I made money and got to buy a bodykit lol", "score": 1, "replies": []}, {"body": "GCT", "score": 1, "replies": []}, {"body": "f the Greeks, I will never understand it", "score": 1, "replies": []}, {"body": "If you have held .. you would have made $4000 less", "score": 1, "replies": []}, {"body": "If goes to 1.60", "score": 1, "replies": []}, {"body": "I always sell a fraction at a time, or limit orders at increasing prices. Maybe it’s not as good as “sell all at open immediately” but psychology it helps a lot.", "score": 1, "replies": []}, {"body": "Bro take the win.  The market isn’t going anywhere.  There’ll always be chances to make money on other opportunities.", "score": 1, "replies": []}, {"body": "Or 4000 less…", "score": 1, "replies": []}, {"body": "A win is a win", "score": 1, "replies": []}, {"body": "*woulda-coulda-shoulda* is gonna blow up your account someday", "score": 1, "replies": []}, {"body": "I wonder how did he able to turn the $0.16 into $0.35 how does that happen the call option I bought still shows the same $.05", "score": 1, "replies": []}, {"body": "Should have waited 10 more minutes. Could have saved you 15% or more on car insurance.", "score": 1, "replies": []}, {"body": "A gains a gain man don’t kick yourself in the foot \n\nIt could be worse you could be like the one dude who bought Disney outs during the pandemic made a million and then lets it expire to zero", "score": 1, "replies": []}, {"body": "Imagine if you waited till today", "score": 1, "replies": []}, {"body": "Why you didn't scale out", "score": 1, "replies": []}, {"body": "\"If only I had waited\" but if you would have waited 5 more min what would have stopped you from waiting 5 more. And then 5 more. Then 10 more. Until you held so long you weren't even making profit. Just be happy you were on the right side of things this time.", "score": 1, "replies": []}, {"body": "Wow. Really going to fucking complain. I’ll never understand why the universe rewards the biggest whiners", "score": 0, "replies": []}, {"body": "$15,000", "score": -9, "replies": [{"body": "Shouldn’t be dwelling on missed gains my man. You made out with a profit. If AMZN tanked today you would be thinking “thank god I exited my position when I did”. You’re gambling and you won for now", "score": 4, "replies": []}, {"body": "Just think of all the cocaine and hookers you could’ve had.\n\nOr accept that gains are gains and stop being a bitch 🤷‍♂️ your positions could’ve easily gone the other way", "score": 1, "replies": []}]}]}
