{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1fhvpvr", "created_utc": 1726459252.0, "score": 19, "upvote_ratio": 0.86, "num_comments": 86, "comments": [{"body": "Hey you, yes you panicking over there in the corner. The stock will be volatile before the rate cuts are announced. This is the most uncertain time of the year, high volatility is to be expected. Stop being a \\*\\*\\* and wait it out.", "score": 9, "replies": [{"body": "There will be blood", "score": 3, "replies": [{"body": "Shed", "score": 1, "replies": []}]}, {"body": "The stock will still be volatile after the cuts...that's kind of NVDAs thing.", "score": 4, "replies": [{"body": "Yes of course but extra volatility. \n\nI see people panicking left and right cuz it dipped. They read dieselcocks post and take it as a fact even though he said it might dip before it retraces to ATH.\n\nIt's already back above $117 lol. Just breath and wait.", "score": 3, "replies": []}]}, {"body": "Still holding 106 calls till next year", "score": 1, "replies": []}]}, {"body": "well that was a very lame and boring afternoon", "score": 9, "replies": []}, {"body": "here comes the opening dump, but i m holding", "score": 7, "replies": []}, {"body": "HOLY POOPA LOOPA!!! WHAT THE BAZINGA IS GOING ON RIGHT NOW", "score": 6, "replies": []}, {"body": "1.21 Gigawatts!!!! Great Scott!!! \n\nNow I know why Doc Brown was so crazy about that amount of power.", "score": 7, "replies": []}, {"body": "Meanwhile PLTR is up 1.15%... Why?", "score": 7, "replies": [{"body": "Because <insert random Bloomberg talking head reason>", "score": 2, "replies": []}, {"body": "3 letter agencies", "score": 1, "replies": []}, {"body": "Meme stock", "score": -3, "replies": []}]}, {"body": "$117 is fighting for its life rn", "score": 6, "replies": [{"body": "It died\n\nBut it'll revive", "score": 4, "replies": []}, {"body": "Premarket low volume….expect it to drop even more", "score": 0, "replies": []}]}, {"body": "It’s just a regular Monday.", "score": 5, "replies": []}, {"body": "⠀⠀⠀⠀⠀.　　　　　　　　　　⠀⠀⠀✦ ⠀ ⠀　　　　　　　　　　　　　　⠀⠀⠀⠀⠀* ⠀⠀⠀.　　　　　　　　　　. ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀✦⠀　ﾟ　　　　　.⠀⠀ 　ﾟ　⠀⠀⠀⠀⠀⠀⠀⠀⠀☄️⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀ ⠀⠀⠀⠀⠀⠀.　　　　　　　　　　　　　.　　　ﾟ .　　　                               　　　ﾟ                                           🌒                  🪐　. 　　   ✦　　　　　　　.\n\n⠀⠀⠀⠀⠀        ⠀⠀⠀⠀    🚀⠀⠀⠀⠀⠀                        .               *               .     * ⠀⠀⠀.\n\n　　　　　　*　　　　　　　　　　　.\n\n.　　　　　　　　　　　　　. 　　✦⠀　   　　　　ﾟ　　　　　.　　　　　　　　　*\n\n　🛰️ 🌎⠀⠀⠀⠀⠀", "score": 7, "replies": []}, {"body": "I’m all in. Just added 5.5k onto the 50k I got in. I’m scared that it’s going to crash this week due to the rate cut fiasco. Either way, I’m holding that bag till retirement or chinas invasion.", "score": 3, "replies": [{"body": "If you feel Nvda is going down in the short term, you could just dca the 5.5k over the next few weeks/months and see how the market digests the fed cuts. Either way, since you're a long term investor, it won't really matter too much in the end. Maybe a few percent here or there.", "score": 2, "replies": [{"body": "This is the way.", "score": 1, "replies": [{"body": "It is! It’s just fun to watch it go up and down. Haha", "score": 0, "replies": []}]}, {"body": "That’s smart! It just swings so wildly some times. I’d rather get on the better half of a 10% dip or rise. A little bump can go a long way but you’re right, long term it doesn’t matter. It just hurts when it happens but I just can’t panic. Lol", "score": 1, "replies": [{"body": "Invest an amount you're comfortable with given the volatility.", "score": 1, "replies": [{"body": "I’m in it for the long haul. I should diversify more but I truly believe in this company vs just trying to make a quick buck. I’m excited for the future! Haha", "score": 1, "replies": []}]}, {"body": "You’re in luck then. Already bleeding money before the market opens. Here’s to another week of dips.", "score": 1, "replies": [{"body": "The good news is it bled enough before it opened that when it executed, it left enough funds over for me to buy an extra share. :)", "score": 1, "replies": []}]}]}]}]}, {"body": "Why is that everytime I buy this stock with huge amount of shares, it collapses. Bought at 1000 shares at 119, and of course 116 to premarket.", "score": 6, "replies": [{"body": "The best way is to be long", "score": 6, "replies": []}, {"body": "119 is so a bad entry point.  Given the negative momentum it is really just about at a local top", "score": 4, "replies": [{"body": "Very true….ppl were saying it’s a new low 😹", "score": 1, "replies": [{"body": "permabulls will always say that.  But charts and data are powerful to give a real picture.", "score": 3, "replies": []}]}]}, {"body": "Because if you looked at last week 120 was pretty much resistance.  It tried to materially break through numerous times and kept getting rejected.", "score": 4, "replies": []}, {"body": "Because unfortunately retail investors are the losers when it comes to this stock", "score": 3, "replies": []}, {"body": "Because your money isn't going to double overnight \n\nYou need to be patient and wait at least a couple months to see results and more likely a year or two", "score": 4, "replies": []}, {"body": "Stay strong! Going 175 EOY...", "score": -4, "replies": []}]}, {"body": "The only stable ATH will come after a quarter of ongoing Blackwell deliveries reported with earnings. Until then just keep stocking up and ignore the volatility. Nuclear power plants, accelerated computing, etc are just stories that won’t actually move the needle in the next few years.", "score": 6, "replies": []}, {"body": "Institutions doing everything they can to keep the price low before it breaks out again", "score": 5, "replies": []}, {"body": "Please stay above 116 today...", "score": 2, "replies": [{"body": "even better", "score": 1, "replies": []}]}, {"body": "# Sell ​​tomorrow, buy back on Monday, What do you think?", "score": 3, "replies": []}, {"body": "Drillin today", "score": 2, "replies": []}, {"body": "Wil nvidia ever reach 130 again?", "score": 1, "replies": [{"body": ":(", "score": 4, "replies": [{"body": "Bought 1200 shares at Nvidia for 119, should I sell?", "score": 2, "replies": [{"body": "I bought 951 at 126 the day of the earnings report. If you bought in the stock because you believe in it, then don't sell it at a loss. I'm holding. It's a very volatile stock, I almost lost it when it went down to 102 and almost sold for -22k, but.. I held and within a week it was at 119. It's going to move up and down, but in the long term I believe it should trend upward.\n\n  \nNot financial advise though, if you can't tolerate the risk.. maybe sell it off and diversify lol. I just started selling covered calls to make some $ on the side from NVDA. 1K premium for this week (126 strike).", "score": 3, "replies": [{"body": "Bet bro you convinced me, I’m just hoping it can reach 140 so I can sell and diversify", "score": 3, "replies": []}]}, {"body": "My average was near 117 and I ended up selling out even today, I’ve held this for just over a month and twice this has fallen down now to under 105. It would not surprise me if we end up getting another scenario where that occurs, so I rather just wait and get in lower if possible", "score": 2, "replies": []}]}]}]}, {"body": "What's everyone's opinion on rate cut? Good or bad?", "score": 1, "replies": [{"body": "Yes!", "score": 3, "replies": []}, {"body": "Depends on if you look at history, maybe this time is different haha", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Bulls vs. Bears today", "score": 1, "replies": []}, {"body": "Stock will rise with Blackwell, but if it means that the stock is at 100 and rises to 120, is that a rise for most of you? Buy the dips and not the rips.", "score": 1, "replies": []}, {"body": "It’s so cool to know that all of us will be so rich by next year", "score": 0, "replies": [{"body": "Who knows", "score": 3, "replies": []}]}, {"body": "so if fed cuts rates, what will happen to the market?", "score": 1, "replies": [{"body": "From what I understand, if the Fed cuts rates, expect Nvidia to go down as money rotates into small caps. When the Fed cuts rates it becomes cheaper to get loans, which means more small companies can pull in funds.", "score": 6, "replies": [{"body": "TThere's also record amounts of assets sitting in money market funds, CDs, bond funds and other interest bearing products that will begin shifting into stocks.\n\nYes, small cap growth companies that rely on debt to grow operations will rise disproportionately and rebalancing ones portfolio to trim the S&P 500 Index pie to fatten up the Russel 2000 Index pie is a bit is a good idea.\n\nHowever, ALL stocks will be going up as fixed income assets are incentivized to migrate into stocks. \n\nIn general, as interest rates go down, assets tend to move down the \"risk\" scale, but to their closest neighbor. In other words, money rotating from bonds into stocks is going to primarily go into the safest stock funds and companies.\n\nEver since Powell said they'd be lowering interest rates last November money has been flowing from fixed income into stocks and it greatly benefited the stock performance of large and mega cap stocks.\n\nIt's literally already been happening for 10 months because markets are forward looking.\n\nThere is a healthy bull market consolidation period in the markets right now because they've already priced in the 1st cuts over the last 10 months and there's near term uncertainty on the pace of future cuts AND uncertainty on whether the economies trend to low (but all positive) inflation, growth, employment numbers is going to flip negative or stabilize like it did throughout the 2010s.\n\nMarkets and individual stocks can't go up every day, so consolidating and breathing after a good run last week is exactly what should happen going into Wednesday.", "score": 2, "replies": []}]}, {"body": "Nothing. It’s all theatre. Expect a 25 cut", "score": 4, "replies": []}, {"body": "depends on the reason Powell gives for cutting. \n\n We cuttin 50 bps cuz we see dramatic slowdown in economy would cause a fucking mkt crash.\n\nWe cuttin 25 bps cuz we see soft landin takin place and will cut more going forward to land this big beautiful plane would likely not do much but wont crash the mkt.\n\nWe aint cuttin till inflation at 2 percent would crash the mkt.", "score": 2, "replies": []}, {"body": "stock market crash of 1928", "score": 0, "replies": []}]}, {"body": "I have 3 shares, is that better than no shares?", "score": 1, "replies": [{"body": "No shame on that. I would say if that’s all your budget allows it’s better than nothing, but if you’re that low on cash, you may just want to have it in an emergency fund imo", "score": 5, "replies": [{"body": "I already have an emergency fund so I’ll take the first half of your comment and run with it.", "score": 4, "replies": []}]}]}, {"body": "Why the low volume these past few days?  \nI heard the CN stock market is down, but that shouldn't affect people from coming into the US markets no?", "score": 1, "replies": [{"body": "Yeah, I noticed this too.  It was unusual price action too.  We drifted down in the AH despite futures being up.  There was notable lack of buying interest.  I think many are scared of another violent selloff.  All the traders flocking to the stock make it more likely.", "score": 2, "replies": []}]}, {"body": "Which is stock so volatile for a 3T stock? Lol", "score": 0, "replies": []}, {"body": "DCAing 100 daily till I have enough for my wedding", "score": -4, "replies": [{"body": "Please don’t invest for a short term goal", "score": 1, "replies": [{"body": "Are we talking stocks or the marriage? Lol", "score": 2, "replies": []}]}]}, {"body": "Jensen's aggressive selling continues. Today, he sold another 240k shares. Still not even 2% of his overall share, but getting close to cashing out $1bln in 3 months. Good on him. Cashing out what he can while share prices are at euphoric levels. We would all do the same in his position.", "score": -1, "replies": []}, {"body": "This stock is about to reload💦", "score": -3, "replies": []}]}
{"title": "The Double-Correction is Likely Over; Nvidia to Revisit its ATH", "selftext": "# This article was [originally published ](https://sam-weiss.com/the-looming-fed-pivot-moves-markets-to-crescendo/)at Sam-Weiss.com.  See the [Original Article ](https://sam-weiss.com/the-looming-fed-pivot-moves-markets-to-crescendo/)for charts and tables mentioned in the post.\n\nThe NASDAQ-100 (QQQ) and Nvidia (NVDA) went into last week trading at extremely oversold conditions on their hourly charts and were both due to bounce big time as we noted in our weekly round-up article entitled “[Double-Correction: Where’s the Bottom and How to Navigate the Turmoil](https://sam-weiss.com/double-correction-wheres-the-bottom-how-to-navigate-the-turmoil/).” In no uncertain terms, we wrote: \n\n>Both the QQQ and NVDA have reached extremely oversold conditions on the hourly chart and are now likely to bounce early this week. As we’ve mentioned a few times before, while overbought conditions (RSI>70) has very little in the way of predictive value, oversold conditions is a different story. Anytime we get oversold markets (QQQ/SPY/DIA), there’s high probability for a near-term bounce at a minimum. \n\n>A back-test of ANY period in the market’s history bears this out quite clearly. There’s no question that deeply oversold conditions on the hourly chart preceded a big bounce in the market in the overwhelming majority of cases in the historical record. That’s one indicator that is independently very reliable. The NASDAQ-100 finally reached oversold conditions on Friday and is likely due to bounce on Monday or Tuesday of this week. With CPI due out on Wednesday before the open, I expect we’ll see the market up big on either Monday or Tuesday of this week.\n\nWe backed up those comments by going 50% long in both our common stock and options portfolio at the September 6 lows. We bought our entire Nvidia (NVDA) common stock position at $101 and $104 and we’re set for the long-term. We’re not adding to that position as it represents a full allocation into Nvidia (NVDA). We also bought 70% of our Nvidia (NVDA) call-option position and we’ll add to that on the first Nvidia (NVDA) pull-back which we’ll discuss below. \n\nSuffice it to say we were pretty confident both the NASDAQ-100 (QQQ) and Nvidia (NVDA) would see a substantial rebounds at a bare minimum last week. Our near-term rebound price targets called for Nvidia to rebound up to $110-$112 a share and for the NASDAQ-100 (QQQ) to rebound to $462 a share (from $448.50 lows). Both Nvidia (NVDA) and the NASDAQ-100 (QQQ) far surpassed those price-targets and now both are sitting at relatively overbought conditions on the hourly. \n\nSo the question is where do we go from here and how the looming Fed Pivot impact the near, intermediate and long-term outlook. \n\n# Double-Correction Update\n\nFriday, September 6, 2024 represented the low-point of the double-correction that began when the NASDAQ-100 (QQQ) reached $485.50 a few weeks prior. As we mentioned last Sunday, “With the NASDAQ-100 down 7.7% from its $485.54 highs set on August 22, 2024, there’s no question that a double-correction is now underway. In fact, that already puts this correction at the same level as the April 2024 correction (8%) and puts it ahead of at least 8 other corrections going back to 2010.” \n\nOur expectation for the double-correction was that the NASDAQ-100 (QQQ) was unlikely to take out its August 5 lows. Why? Because the rebound from the August 5 lows to the August 22, 2024 highs represented a near 80% retracement of the entire July-August correction. This is significant because anytime the market retraces 50% of its losses, it’s a huge indication that the lows are in. \n\nWith the QQQ having risen $62 from $423.50 up to $485.50, the chances the QQQ would ever take out much less revisit the August 5 lows was very slim. Last week’s rebound from $448.19 up to $476.50 makes it even more unlikely that we see the lows. In fact, the rebound we saw last week makes it very likely that the lows of the double-correction are already in. Chances are the NASDAQ-100 (QQQ) breaks out this week on the Fed Pivot and then rallies back to its all-time highs in the coming weeks. That’s what we expect to happen and we believe this given the size of the rally this far. If the market was really all that uncertain or tentative, the NASDAQ-100 (QQQ) would have peaked well below its 50% retracment line. Anytime we see a rally take out the 50% retracement, the bulls are back in control. That’s what separates a dead cat bounce, from the real deal. The chart below shows the NASDAQ-100 breaking the 50% retracement line on the 7.7% correction from $485.50 down to $448.19:\n\nBut as anyone can also see in the chart above, the NASDAQ-100 (QQQ) reached overbought conditions during the trading day on Friday. Not a huge deal, but at some point soon we’re likely to see a sharp pull-back this week. I do think that this pull-back could potentially represent the final pull-back before the NASDAQ-100 (QQQ) embarks on a new rally toward its all-time highs. In fact, our plan is to do our final buying during that pull-back if and when it happens this week. \n\nStill, it’s important to note that last week’s rebound has basically killed any chance for the bears to take the NASDAQ-100 back to its $423.45 or $448.00 lows. That’s the key takeaway from last week’s rebound. The damage to the downtrend is done. So here’s where we expect the NASDAQ-100 to trade over the coming days and weeks. We expect a small short-term pull-back to happen anytime between now and the next few trading days. As we noted last week, the key resistance points to watch are $477.50 and $485.50. Those are the two key lines of resistance. If the QQQ rises to $485.50 this week, it will have rallied nearly $40 straight, and have traded overbought for a decent amount of time. At that point, we’d expect a pull-back to the low $470’s. That’s where we old do our remaining buying. The point is the meat of the rally we’ve seen off of the $448.16 lows is already over. A short-term pull-back is going to happen somewhere in the next $13 of upside. \n\nBut that’s not super important because chance are right after that we rally straight up to all-time highs. If the QQQ gets up to $485.50, and pulls back to $470 as we expect, the next move up takes the QQQ to $503. This chart below represents our official outlook (see Original Article for chart):\n\n# Nvidia (NVDA) Bulls Back In Control\n\nClearly this is good news for Nvidia (NVDA). I do think Nvidia is at a similar inflection point as the NASDAQ-100 (QQQ). In fact, I’d even venture to say it’s an even stronger position given that it tested and held its $100 support for the third time in a three months. Not only that, Nvidia (NVDA) retraced 66% of its entire correction from $130 down to $100 a share. That’s a dagger for the bears. Nvidia (NVDA) is unlikely to take out its $100 lows even if the Fed Pivot results in a sell-off for some unexpected reason. I think the correction is largely over and any selling we do see is just residual selling. \n\nOne thing to pay attention to is the Nvidia (NVDA) hourly chart, which like the NASDAQ-100 (QQQ), has pushed into deeply overbought territory. Right now, it’s just a concern worth watching. As I’ve mentioned several times, there is far less predictive value in overbought conditions as there is in oversold conditions. Stocks can remain overbought for substantially longer periods of time that they could remain oversold. At least when it comes to solvent names which are a going concern. \n\nIn fact, I think Nvidia (NVDA) is more likely to push up to $130 before it ever pulls back than it is to pull-back from current levels. That is because Nvidia (NVDA) has a history of building strong momentum off of overbought conditions. Not only that, the stock is currently forming a bullish pennant on the hourly. Thus, we’re probably going to see a breakout before we see a pull-back. \n\nThat being said, as we’re 100% long our allocation to Nvidia in the SW common stock portfolio and 75% long our target option allocation in the options portfolio, we would use any pull-back as an opportunity to buy our remaining call-option position. See Original Article for the chart:\n\n# S&P 500 Flirts With All-Time Highs\n\nSo one thing that I think represents a bit of a double-edged sword to the market is the S&P 500 (SPY). The SPY, unlike the NASDAQ, has never really pull-back off of its all-time highs. In fact, the S&P 500 didn’t really sustain a double-correction. It merely pulled back 4% from its all-time highs after reaching that point during the post August 5 rally. \n\nAnytime the market tests all-time highs for a third time just as the fed is about to pivot, it does present a bit of a concern. I still think on balance the market is set-up to breakout. A big reason for that is the way the markets have behaved after reaching its August 5th lows and again after reaching its September 6th lows. There is a lot of momentum and strength in the market and that all points to higher markets ahead. Every time the S&P 500 or NASDAQ-100 has pulled back off of their highs, the rebounds have been so robust as to erase the most of the losses. That has occurred twice now in three months. \n\nSo while it’s a concerns, I do think the markets are probably headed higher. It’s just worth mention. See below (see original article for charts).\n\n# What Can Derail Our Outlook?\n\nOur outlook couldn’t be anymore clear. We expect the NASDAQ-100, SPY and QQQ to potentially see a SMALL pull-back off of overbought conditions. The timing of that pullback isn’t clear yet because we’re simply not overbought enough yet. Chances are we see higher prices in the near-term before the markets see a small pull-back. That small pull-back will likely represent our final buying opportunity before the QQQ and Nvidia make a big run to fresh all-time highs. That’s our outlook. \n\nSo the question now is what could derail that outlook and what we should be concerned about. There a few things that do concern me at the moment. The big concern I have right now is the [CME Group’s Fed Watch Tool](https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html?redirect=/trading/interest-rates/countdown-to-fomc.html). That tool tracks the fed fund futures which are traded on the CME. Usually, we don’t see a big split in expectations right ahead of a fed meeting. Usually, there’s a general consensus of what the fed is likely to do post-meeting. But here we are three day ahead of the fed decision and 43% of traders on the CME still expect the fed to cut 50 basis points. That’s not a great set-up because it means the market could potentially be disappointed by the fed’s decision on interest rates (see original article for table).\n\nSo that’s a concern worth watching this week. I expect there to be more consensus as the week progresses. The flip-side of this is that if the Fed does cut 50-basis points, then with only half the market expecting as much, we’d see an absolute explosion in the market. There’s an inherent asymmetry there. A 25 basis point cut has the potentially of spark a moderate sell-off, but a 50 basis point cut would set the market on a direct course to all-time highs. \n\nThe other big thing worth noting — which we mentioned last Sunday — is the possibility for a third correction like we saw last year. For those who read last Sunday’s post, we explained how this exact period last year marked a 71-day total correction which was the largest on record. The NASDAQ-100 peaked in July 2023 — just like this year — and then didn’t bottom out until late October or early November. After having two separate 8-9% corrections, the NASDAQ-100 rebounded back toward the highs before heading into a third and final correction. \n\nHowever, it is worth noting that the markets didn’t make substantial new lows on each leg lower, the total correction was only 11% — less than the 16% correction we saw this year — and then the QQQ immediately went on to rally to fresh all-time highs by December. What’s more, that correction represented a 15-year record 71-days. We’re already at 45 days in this total correction. \n\nThus, any way you look at it, I do think in the reasonable worst case scenario, the market has either already bottomed or will bottom very shortly. Even if the NASDAQ-100 were to sell-off on the fed and even if we saw another big leg down toward the September 6 $448.16 lows, we’d like see a bottom fairly quickly and would probably launch into a massive rally back to the highs in October anyway. \n\nThe key point investors should focus on here is this. The economy is strong. The fed has largely manufactured a soft landing as expected. Inflation is in check. The fed is about to cut interest rates and we’re still in the early stages of the post-2022 bull market. At $503 a share, the NASDAQ-100 has only rallied 25% above its previous highs. Bull market to bull market usually goes for 50-100%. There’s nothing in the economic outlook that should lead us to conclude that the correction we’ve seen is anything but a standard correction. \n\nThat being said, we are well positioned to weather any storm that comes. Being invested on a 2-year time horizon, our portfolio is built to handle even a 2008 type financial crisis. And I can’t stress enough how important it is for investors to take a long-term time view when making their investment decisions.", "id": "1fhxx1b", "created_utc": 1726467814.0, "score": 188, "upvote_ratio": 0.92, "num_comments": 128, "comments": [{"body": "2x NVDA, got it!", "score": 52, "replies": [{"body": "Not till SPY is confirmed to be over ATH brother", "score": 12, "replies": [{"body": "With these diamond balls, ima do it", "score": 8, "replies": []}]}, {"body": "NVDL da way brothers", "score": 9, "replies": [{"body": "nvdx gives me more shares and smaller expense ratio, plus t-rex's are cool", "score": 7, "replies": [{"body": "Why not both on margin 😎😏", "score": 2, "replies": [{"body": "My balls are not hard enough for that", "score": 6, "replies": []}]}]}]}]}, {"body": "So its gonna tank then...", "score": 26, "replies": [{"body": "Yep already tanking", "score": 12, "replies": [{"body": "Down 1%.  That isn’t a tank.", "score": 3, "replies": []}, {"body": "How about now", "score": 1, "replies": []}]}]}, {"body": "Bump this at the end of September and let’s see how it aged.", "score": 16, "replies": []}, {"body": "DIESELCOCK DIESELCOCK DIESELCOCK!!!", "score": 18, "replies": [{"body": "116...116..", "score": 8, "replies": []}, {"body": "The great and powerful", "score": 1, "replies": []}]}, {"body": "What about the idea that a 50 basis point cut could spook markets? That things are worse than expected and the Fed knows something we don't know.", "score": 7, "replies": [{"body": "That’s a possible reaction.  But I think it’ll be short lived if that’s the way the market reacts.  The overall set up we’ve seen since July suggests the markets aren’t too keen on to trending lower.  We keep fully retracing the losses.  That’s a big sign for a trend reversal.  \n\nWe wouldn’t be seeing such big retracement if the market wanted to trade lower.", "score": 16, "replies": []}, {"body": ".50 is basically a black swan.", "score": -3, "replies": [{"body": "Anything seen as 25-50% probability of occurring can't be considered a black swan.", "score": 7, "replies": []}, {"body": "“bLaCk sWan” — gdp for last quarter revised positively, unemployment isn’t awful considering where it is historically during a recession. \n\nCalling an extra 0.25% cut, i,e quantitative EASING phase cut “a black swan” is the most cliche/regarded thing one can expect from Reddit experts", "score": 7, "replies": [{"body": "Thanks for the kind words.", "score": -1, "replies": [{"body": "So no actual retorts lol", "score": 3, "replies": [{"body": "What is there to retort?", "score": 0, "replies": []}]}]}]}]}, {"body": ".50 cut might be really bad... It means the FED is in a hurry to correct something really bad in the economy. The market has priced in a cut of 0.25 and it will be good. 0.50 will be mass sell off i believe. Don't forget the Japan bank has meeting this week.", "score": -4, "replies": [{"body": "Not sure why the downvotes... I think this is right however I think the reaction would be short lived depending on the other data/commentary. Prevailing wisdom seems to be .25bps with 1-2 more by EOY.", "score": 1, "replies": [{"body": "I don't understand the downvotes too, guess what... It's Reddit 😀", "score": 2, "replies": []}]}]}]}, {"body": "So this was a spot on forecast. Thank you", "score": 5, "replies": [{"body": "Your welcome. Enjoy the money money money", "score": 6, "replies": [{"body": "Any predictions from here?", "score": 2, "replies": []}]}]}, {"body": "All hail and long live dieselcock.\nI’ll continue to DCA $100 daily, nothing will derail me", "score": 7, "replies": []}, {"body": "Any chance NVDA goes below $115 ?", "score": 3, "replies": [{"body": "50% chance", "score": 2, "replies": []}]}, {"body": "We should have bought PLTR instead of bitching at each other about a price neither party can c", "score": 3, "replies": []}, {"body": "this guy went radio silent", "score": 3, "replies": []}, {"body": "I would want to buy... I didn't have money back then😭😭", "score": 2, "replies": []}, {"body": "I am loading up on shares if it dips to $ 110 this week", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "Control", "score": 2, "replies": []}, {"body": "Yo Diesel,\n\nHow invested are you in NVDA, anyway?", "score": 2, "replies": []}, {"body": "I’m not touching options, only buying the stock and positioning myself as a long term holder", "score": 2, "replies": []}, {"body": "Wait...you guys can read?", "score": 2, "replies": []}, {"body": "Mf was right", "score": 2, "replies": []}, {"body": "Praise be to St Dieselcock, patron saint of GPUs", "score": 2, "replies": []}, {"body": "How ironic that the market is seeing red now 👁️👄👁️", "score": 3, "replies": [{"body": "I think it went down 1 whole dollar $$. Watch out guys!", "score": 6, "replies": [{"body": "Ironically enough it’s down 2,22 dollars but ok.", "score": 3, "replies": [{"body": "That's fine, call me when it drops 20$. Then I may check. Lol", "score": 4, "replies": [{"body": "Alright see you on Monday", "score": -1, "replies": []}]}]}]}, {"body": "Aged like milk", "score": 1, "replies": []}]}, {"body": "Will definitely make the September lows at least once before the election", "score": 1, "replies": []}, {"body": "Thanks for the work and NVDA analysis.", "score": 1, "replies": []}, {"body": "!RemindMe 104 days", "score": 1, "replies": [{"body": "No need to wait for December. All time highs today.", "score": 5, "replies": [{"body": "Holy fuck you were right. Congratulations. I still think it's going to plummet because it all feels like one huge pump and dump. But what the fuck do I know.", "score": 2, "replies": [{"body": "lol I didn’t know what position was or whether you were long, short, bullish or bearish. You just asked to be reminded without comment one way or the other.", "score": 5, "replies": [{"body": "Yeah true. But regardless that's what I hoped to do. Get a reminder in December and see Nvidia at 40-50 range to come back here and be a salty asshole. Unfortunately you get to do that Instead now", "score": 2, "replies": [{"body": "You really need to get out of your room once in a while. Lol", "score": 4, "replies": []}]}]}]}]}, {"body": "I will be messaging you in 3 months on [**2024-12-29 18:32:52 UTC**](http://www.wolframalpha.com/input/?i=2024-12-29%2018:32:52%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/NVDA_Stock/comments/1fhxx1b/the_doublecorrection_is_likely_over_nvidia_to/lng5nlw/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FNVDA_Stock%2Fcomments%2F1fhxx1b%2Fthe_doublecorrection_is_likely_over_nvidia_to%2Flng5nlw%2F%5D%0A%0ARemindMe%21%202024-12-29%2018%3A32%3A52%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fhxx1b)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Remind me! One week.", "score": 1, "replies": []}, {"body": "Spy or Nvda or qqq or some other .01 call?", "score": 1, "replies": []}, {"body": "I bought qqq calls after reading this and now im bout to make LOT of money. Great DD", "score": 1, "replies": []}, {"body": "Remind me! One month", "score": 1, "replies": []}, {"body": "Do you think the last major correction for the year is in after markets know about the rate decision?", "score": 1, "replies": []}, {"body": "Praised be to Diesel Cock. Looking forward to your next post", "score": 1, "replies": []}, {"body": "Nice prediction", "score": 1, "replies": []}, {"body": "Pre market is $117, we could easily see $110 this week", "score": 1, "replies": [{"body": "Not a chance", "score": 1, "replies": [{"body": "You’re essentially saying the stock that went up 16% last week can’t go 6% down this week?", "score": 3, "replies": [{"body": "110, that’s nearly 8%. And I don’t think that’s possible", "score": -1, "replies": [{"body": "We opened at $116 today, I’m not talking Fridays price.", "score": 1, "replies": [{"body": "Even lower, this shit is definitely going to 110", "score": 0, "replies": []}]}]}]}]}]}, {"body": "lol yes double top and double correction. It only makes sense💡", "score": 1, "replies": []}, {"body": "Lord Dieselcock brings joy for allll!!!!", "score": 1, "replies": []}, {"body": "We shall see 🧐", "score": 1, "replies": []}, {"body": "We fooked now", "score": 1, "replies": []}, {"body": "dump at opening help lol", "score": 1, "replies": []}, {"body": "Has today's dump changed your outlook at all?do you believe it will keep going lower this week ?\n\nOr do you still think its going to go higher?", "score": 1, "replies": [{"body": "No.  Today's sell-off is largely in-line with our expectations.  Our outlook is for the markets to pull-back off of overbought conditions followed by another big leg up in the rally.  Today's pullback hasn't even met certain minimum criteria just yet to constitute a real pull-back.  We'll see if we get there today or tomorrow.", "score": 11, "replies": []}]}, {"body": "There’s no way this happens before October 1.", "score": 1, "replies": []}, {"body": "Need a TLDR.\n\nIn the meantime, this is my TLDR: Whatever rate cut announced, NVDA and Qqq will go sell off to retest a recent low. If we HODL-ed and emerge intact, next week will begin the ascent to ATH towards election", "score": 1, "replies": [{"body": "We’ve got a Cramer here.", "score": 1, "replies": [{"body": "Haha so I was correct by fluke. There was a sell off. There was a hodl, by me. And then was the glorious to the moon. Lol… another sell off today?", "score": 1, "replies": [{"body": "I’m glad if you made some bucks in the volatility. But it’s funny to read your comment today when the market hit ath. Anyways, today is witch day. Will be interesting.", "score": 1, "replies": []}]}]}]}, {"body": "NVDA down to 115.59 already LMAO", "score": 1, "replies": []}, {"body": "AHHHHHHHHHHHH HE IS HERE OUR MESSI, DIESELCOCK FUARKKKK AHHHHH IN ME AWWWWWWWW", "score": 0, "replies": []}, {"body": "So there is probably no second correction, but there could be a second correction. There could be a 3rd correction, but maybe not.  The Fed announcement may or may not affect the market.  Nvdia is a bull stock so go long and it won't matter is what he is saying.  Brillant.  \n\nHow many usernames do you have on here?  Which other subs do you repost the same content on?", "score": -4, "replies": [{"body": "We already had a second correction.  The NaSDAQ-100 fell 7.7% from August 25 to September 6.  The question is whether we’ll see a third leg down.  \n\nDon’t mischaracterize what you don’t understand.  There’s always one like you in every thread.  \n\nI don’t get how anything in the post could be so badly misinterpreted.  Note under the heading “what can derail our outlook”. The outlook is summarized for you right there if you don’t understand what it is. \n\nHedging statements aren’t the outlook.  They’re there so that good investors hedge out those risks.  We’re full long hedged out against different less possible outcomes.  \n\nBut less likely outcomes IS NOT THE SAME AS OUR OUTLOOK!  \n\nSmall pullback, then higher. That’s our outlook.  Don’t know how else to make that clear.  \n\nThere’s always one of you in every thread. “The market may go up or it may go down.”   \n\nGood job.  You sound like every other person who seemingly doesn’t have the capacity to understand the balance between outlook & risk.", "score": 19, "replies": [{"body": "Don't listen to the Trolls. For 1 inept here, there are other 500 people very grateful for your work. Never miss one of your posts! :)", "score": 11, "replies": [{"body": "Little bro. Asking questions doesn't render someone a troll lil bro...", "score": -4, "replies": [{"body": "What about calling then lil bro, big boy?", "score": 6, "replies": []}, {"body": "If you want to fight, join a gym. I'm not gonna waste my time with you. Lol", "score": 2, "replies": [{"body": "Lil bro I twist you up and pummel you. One hand little man. Don't test me.", "score": -2, "replies": [{"body": "Glad for you, or sorry that happened. Lol", "score": 2, "replies": []}]}]}]}]}, {"body": "Nice response...but in fairness, your level of detail - can it be backed up by similar instances of this much coverage with the outcome being what you forecasted? Not being a smartass, I just don't know you and before everyone starts worshipping you even more, it'd be nice to know you have some XP in correct analysis. Have you covered anything else like this and seen massive gains like you predicted?", "score": 1, "replies": [{"body": "So everything written in this post can be backtested against historical trends. There's nothing magical going on here.  Not to rehash the entire post, but you can do a check on any single point yourself. For example:\n\nGo to any charting app (I use stockcharts.com) and check for yourself what happens when the market retraces more than half of its losses on a rebound.  The NASDAQ-100 recently dropped around 16% from $503.50 down to a low of $423.50 between mid-July and August 5.  Half the losses is $40.00 (50% retracement) or a rebound up to $463.50 per share.  The NASDAQ-100 rebounded to $485.50 far surpassing the 50% line.  That's a full $23.00 past the half-way mark.  My contention is that due the rally far eclipsing the 50%+ retracment, the NASDAQ-100 is unlikely to revisit its $423.50 lows.  Okay.  Notice how I said DUE TO THE 50% RETRACEMENT > XYZ will happen.\n\nIf you dont' trust it. Just go look it up for yourself.  This isn't some hidden secret I'm spilling the beans on.  Go to [www.stockcharts.com](http://www.stockcharts.com).  Put in the QQQ, look at a 20-year chart and note every instance when the QQQ has a correction and then went on to retrace more than 50% of its losses on a rebound.  What generally happens next?\n\n\\^This is how all the analysis in the post above proceeds.  Go check each point. It really doesn't take a lot of time or effort to do.\n\nI'm never going to say \"XYZ is going to happen becuase I said so.\"  I'm going to provide the reasoning.  If you want to challenge it, feel free to do so.  I welcome it.  Bring some points. I'll bring some counterpoints.  That's how an actual intellectual discussion should proceed.\n\nEDIT.  For example, here's what's said in the actual post above: \n\n\"Our expectation for the double-correction was that the NASDAQ-100 (QQQ) was unlikely to take out its August 5 lows. Why? Because the rebound from the August 5 lows to the August 22, 2024 highs represented a near 80% retracement of the entire July-August correction. This is significant because anytime the market retraces 50% of its losses, it’s a huge indication that the lows are in.\" \n\nYou can verify if that is accurate or not very very quickly.  If you're familiar with charting applications, probably in no more than 5 minutes.  If not, I'd say maybe 15 minutes.", "score": 10, "replies": [{"body": "FYI, I think you present your analysis in a really digestible way especially for new investors. Caught my attention in March/April, but I was fairly new. But your way triggered me to educate myself in this area. This area is ofc huge, but this helped me to focus on the basics and seeing correlations/probabilities for certain outcomes. \nSo to everyone questioning the analysis - fair enough, but use the information presented to you to do your own research and you will see, it is absolutely reasonable. Ofc no one can predict the market with 100% certainty. And he doesn't claim so either. It's mainly a game of probabilities. And you certainly want to base your decisions according to the right probabilities.", "score": 3, "replies": [{"body": "This is exactly right.  It is a game of probabilities.  If I draw a conclusion based on a 90% back-tested trend and I’m wrong about it, the conclusion itself isn’t any less valid.  \n\nAll we can do is make investment decision on the greatest probable outcome.  And we can further reduce our risk by hedging against the least possible outcome.  \n\nFor example, we believe the market has bottomed for the season I’ve outlined above.  But I’ve taken positions on a 2-year time horizon in case some unforeseen exogenous event occurs.  \n\nAnd that’s exactly what all investors should be doing.", "score": 5, "replies": []}]}]}, {"body": "He analysed the march/April double top/pullback pretty precisely. I was reading along at that time.", "score": 6, "replies": []}]}, {"body": "It's fairly low brow to immediately discount someone for questioning you.\n\nI'm not sure I'd call a 7% dip in the nasdaq-100  over about two weeks a dip when there are volatile stocks mixed in. plus you are posting in a nvida sub.  Your last point you were using QQQ as an anchor now you switched.\n\nIn a forum full of people paid to hype this stock up, what's with all the cloak and dagger?  If you are really trying to get subscriptions, why is there no about us page with detailed information?\n\nWhy do you post anonymously?  Why do you state no qualifications or no research affiliations? Sam Weiss is a fake name, the website is a hack site thrown together with zero effort, and generally, you preach the gospel.   Who is \"we\" when you say \"we\" are hegging long or \"we are well positioned\".", "score": -5, "replies": [{"body": "You didn't question a single point.  Not one single point.  You mischaracterized the entire post as being a \"it may go up or it may go down\" horseshit.  Which is often quite literally the dumbest criticism any investor ever comes across on anyone's post.  \n\nWhat's low brow is being unable or unwilling to realize that any good analysis is going to outline a clear-cut outlook and expectation followed by the risks to those expectations.  A good investor hedges those risks.  \n\nEvery point made here is supported by an argument.  Challenge the fundamental argument in support of the conclusions and I'll respond in kind.", "score": 8, "replies": [{"body": "I generally am on your side of this argument — your line of thinking is logical, verifiable and precise.\n\nI am not questioning that, but I will echo one sentiment of the guy you’re responding to — what’s with the anonymity? Why is there no About Us page on your website or is it a work in progress? What’s your background?\n\nYou can say you don’t want to share that, in which case, fair enough, appreciate the analysis anyway.", "score": 1, "replies": []}]}, {"body": "You’re questioning why people want relative anonymity when posting online? That’s insane\n\nAnd why is that even part of the equation? If there is something wrong with his numbers or his analysis of them then why don’t you actually disagree with them? You can do this without knowing his name, address, and dick size\n\nIf you don’t value advice from anyone who is not affiliated with a large firm then reading about stocks on reddit doesn’t really seem right for you?", "score": 1, "replies": []}]}]}, {"body": "The OP took time to post this instead of a ridiculous yolo post. I do agree that many of the OP’s  posts basically give a blanket approach to the market covering “all” possible outcomes. It is hard to say he is wrong with all the caveats. \n\nThe TA is correct though. There are a lot of other factors outside of TA that are at play here. Historically bearish months vs bullish months, Fed rate cut news and basic economic data have been creating sell offs and rally’s all year and in 2023. Historically rate cuts will create a short term sell off. Really depends on the economic conditions surrounding recessions. Longterm if the economy maintains growth the market will benefit with a broadening. \n\nI don’t find the OP’s posts as “gospel” as many of the Reddit users do here. I do appreciate him taking the time to post something with substance.  You do not see many taking the time to post something like this. A lot of haters on Reddit unfortunately discourage these types of post IMHO.", "score": 1, "replies": []}]}, {"body": "Will test the bottom at $39 before end of month", "score": 0, "replies": []}, {"body": "Wow a bullish NVDA article…. Look at the downward channel of RSI the past month, bear flag, see ya at 90 suckers", "score": 0, "replies": [{"body": "How did that go?", "score": 7, "replies": []}]}, {"body": "Only way to really find out is time.  NVDA triple decreasing top with decreasing negative momentum and possible wedge formation doesn’t look too good,", "score": -4, "replies": [{"body": "Too realistic here, bruh....stay heady.  Emotional traders here.", "score": -1, "replies": []}]}, {"body": "Sentiment of Trump winning can also cause NVDA to 📉", "score": -3, "replies": []}, {"body": "So he says buy Calls now after this dip. Done and done!", "score": 0, "replies": []}, {"body": "you've convinced me. i'm taking out loans for $200 january calls.", "score": -5, "replies": [{"body": "Make sure to send the bill to him", "score": 7, "replies": [{"body": "And the gains", "score": 2, "replies": []}]}]}]}
{"title": "U.S. Awards Intel $3 Billion for Military Supply Program", "selftext": "The Biden administration announced on Monday that it would award Intel up to $3 billion to expand the company’s manufacturing of advanced semiconductors for the U.S. military.\n\nThe program, called Secure Enclave, aims to create a trusted source of computer chips for the U.S. government. It will be funded out of a pool of money from the 2022 bipartisan CHIPS Act, which lawmakers passed in an attempt to reduce the nation’s dependence on foreign sources of semiconductors.\n\nMuch of the world’s semiconductors are currently made in Asia, particularly Taiwan. China claims the island as its own territory, a position that Taiwan rejects, and American officials have long had concerns about the consequences for the U.S. economy and military if China were to invade Taiwan.\n\nIntel officials said on Monday that the company would help “secure the domestic chip supply chain” and work with federal officials to “enhance the resilience of U.S. technological systems.”\n\nThe announcement comes about six months after the Biden administration awarded Intel a grant of up to $8.5 billion to help the company fund major construction projects in Arizona, Ohio, New Mexico and Oregon. That money, along with the award announced Monday, stems from a $39 billion pot of CHIPS Act funding intended to encourage companies to build and expand semiconductor plants across the United States.\n\nFederal officials also awarded Intel up to $11 billion in loans, and the company is expected to claim federal tax credits that could cover 25 percent of its U.S. expansion projects, which are expected to cost more than $100 billion over five years.\n\n[https://www.nytimes.com/2024/09/16/us/politics/intel-chips-semiconductor-grant.html](https://www.nytimes.com/2024/09/16/us/politics/intel-chips-semiconductor-grant.html)", "id": "1fiewko", "created_utc": 1726518248.0, "score": 544, "upvote_ratio": 0.97, "num_comments": 87, "comments": [{"body": "So in 2 weeks we get a good 3bil stock buy back?  lol", "score": 218, "replies": [{"body": "Plus executive bonuses", "score": 87, "replies": [{"body": "Buy backs *are* executive bonuses.", "score": 23, "replies": [{"body": "But what about the second bonus?", "score": 15, "replies": [{"body": "I DO think they know about second bonus.", "score": 1, "replies": []}]}, {"body": "*Congressional inside trader bonuses", "score": 1, "replies": []}]}]}, {"body": "They buy back the options awarded to execs at a premium to the stock price by 20%.", "score": 11, "replies": []}, {"body": "Why are you bitching about buybacks? That's essentially a tax efficient dividend and something you'd want a company to do when their stock has been oversold.\n\nAre we in r/politics or r/stocks? Lol.", "score": -7, "replies": [{"body": "I hate to explain jokes but...  Instead of using the government money as it supposed to they will instead use it as a stock buyback or exec bonuses.  Feel free to look into past cases of this with something like AT&T.", "score": 7, "replies": []}]}]}, {"body": "thank you, pool of money", "score": 124, "replies": []}, {"body": "Intel should just keep buying back shares, the government will bail em out anyway", "score": 42, "replies": []}, {"body": "So, 14 days ago Nancy , made a small purchase  !", "score": 165, "replies": [{"body": "Not just Nancy this kind of amount requires bipartisan cooperation in the Congress.", "score": 60, "replies": []}, {"body": "It's cute you think it's only Nancy.", "score": 53, "replies": [{"body": "Not only, but always", "score": 22, "replies": []}]}, {"body": "1 month ago, granny made a small purchase", "score": 16, "replies": []}, {"body": "Bro why didn’t you tell us 14 days ago our queen bought, we should be rich now", "score": 5, "replies": []}]}, {"body": "We hate giving food to the homeless and kids in schools but we love bailing out poorly run organizations.", "score": 191, "replies": [{"body": "Boeing I'm looking at you.", "score": 20, "replies": []}, {"body": "Because homeless and kids are guaranteed to squander the money, whereas there's only a 90% chance Intel will", "score": 39, "replies": [{"body": "Homeless and kids spend the money, and it goes right back into the economy.  Intel gets the money and it goes into their majority shareholder’s off-shore account.", "score": 28, "replies": []}, {"body": "Homeless people don't need money, they need supportive housing, treatment for mental health and addiction problems.", "score": 12, "replies": [{"body": "Good luck trying to do that without money", "score": 5, "replies": []}, {"body": "From their pov they probably need more fent👍🏻", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Because some people are better at detecting sarcasm than you are", "score": 5, "replies": []}]}, {"body": "Good one lol", "score": 0, "replies": []}]}, {"body": "Just gotta frame the homeless and kids in schools as a poorly run organization of cells", "score": 4, "replies": []}, {"body": "from a strategic perspsective the alternative is having the only major manufacturer in america go out of business, weakenign your security", "score": 4, "replies": []}, {"body": "We do both those things already", "score": 1, "replies": []}]}, {"body": "Oh, good. I’m only slightly less underwater. Thanks papa gov.", "score": 62, "replies": []}, {"body": "Coffee Is back on the menu", "score": 58, "replies": []}, {"body": "Called themselves true capitalist economy, yet bailing out failing companies. \nHave they forgotten the core of capitalism is let those poor buggers die … (now i know who they meant by poor buggers!!)", "score": 36, "replies": [{"body": "You don’t know what you are talking about.  There are only a couple of us fabs that are DoD secure trusted fabs.  It’s a really big deal.  DoD ics require special fab processes and often completely different materials and equipment.  These evolved over decades and are not used commercially.  They are very advanced in ways unneeded by commercial ics and require immense r&d expense.  Trusted dod fabs are further highly secure and require personnel security clearances and monitoring and tracking that are sometimes absurdly extreme.  I highly doubt that Intel makes much $ out of this.  It’s a huge commitment and difficulty.  They probably agree to do this as opposed to want to do this.   Probably requires some arm twisting and certainly patriotism.  DoD electronics is very difficult.", "score": 20, "replies": []}, {"body": " The poor bugger you refer to is the last company that makes advanced microchips within US borders.\n\nIn that sense, it would be capitalist to outsource production of the F-22, the F-35, and the nuclear weapons arsenals to third world countries for cost savings, but that wouldn't necessarily be a smart strategic move", "score": 46, "replies": [{"body": "Don’t use logic they just want to sound cool", "score": 21, "replies": [{"body": "Especially when their competitors in Taiwan and Asia have massive massive subsidies.", "score": 14, "replies": [{"body": "Yeah, like you think China doesn't subsidize it's chip companies and EV companies?\n\nCountries have started adopting silicon valley blitzscaling strategies to capture marketshare... with all the crazy risk that entails.", "score": 5, "replies": []}]}]}, {"body": "TSMC has a N4 fab near HVM, 2nd one topped off, and 3rd(N3?) planned, in Arizona:\n\n[https://www.msn.com/en-us/money/other/tsmc-s-arizona-fab-matches-taiwan-in-early-yield-test/ar-AA1ql1z9?apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1](https://www.msn.com/en-us/money/other/tsmc-s-arizona-fab-matches-taiwan-in-early-yield-test/ar-AA1ql1z9?apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1)\n\n[https://pr.tsmc.com/english/news/3122](https://pr.tsmc.com/english/news/3122)\n\nSamsung is building a SF3 fab in Texas, maybe coming online in 2026. They are behind TSMC(of course they are), but they've committed billions in new US fab:\n\n[https://www.tomshardware.com/tech-industry/samsungs-yield-issues-reportedly-delays-taylor-fab-launch-to-2026](https://www.tomshardware.com/tech-industry/samsungs-yield-issues-reportedly-delays-taylor-fab-launch-to-2026)\n\nAll these projects received billions from the CHIPS Act. The US government don't need to and are not putting all their eggs in the Intel basket.", "score": 5, "replies": [{"body": "Ok, Intel is the last American company fabbing advanced chips within US borders. That's still significant. Both Samsung and TSMCs corporate offices could come under control of China or even North Korea in a major conflict", "score": -1, "replies": []}]}]}, {"body": "Who ever said we live in a pure capitalist country?", "score": 8, "replies": []}, {"body": "Are there other american semiconductor companies the CHIPs money should go to?", "score": 4, "replies": [{"body": "GlobalFoundries but they don’t do advanced chip making anymore.", "score": 3, "replies": []}, {"body": "not without spending billions more to get them capable of running the classified military fabs intel already has. like tens of billions more, so if you want to be the person suggesting we invest tens of billions, if not more, just to set up the exact thing intel does already for the military, then go ahead\n\nlook people, corruption is a real thing, but can we maybe for a second trust that sometimes politicians make the best decisions with the information and resources available to them?", "score": 1, "replies": []}]}, {"body": "Exactly but it still will likely go bust in the next 6 months or so. Theyve got very little cash left and are almost insolvent. Friends of mine working there say that the company is pretty much done", "score": 1, "replies": [{"body": "Cool story, just makin shit up for reddit likes, fuckin pathetic", "score": 1, "replies": []}]}]}, {"body": "ah yes, more money for the bottomless hole of no returns !", "score": 6, "replies": []}, {"body": "Damn I can't afford more than 1 call without breaking the bank, at least that guy's grandma will be relieved in heaven.", "score": 5, "replies": []}, {"body": "US is a shitshow. Taxpayers money dumped to save a poorly managed company.", "score": 11, "replies": [{"body": "What other company would you suggest to give it to? Based on why they are giving it to Intel type of company.", "score": 2, "replies": []}, {"body": "not what happened here at all lol", "score": 1, "replies": []}, {"body": "We spend hundreds of billions supporting illegal immigrants. What does a few billion to Intel hurt?", "score": -10, "replies": [{"body": "Citation needed", "score": 1, "replies": [{"body": "https://www.congress.gov/118/meeting/house/117257/witnesses/HHRG-118-BU00-Wstate-KirchnerJ-20240508.pdf", "score": 2, "replies": []}]}, {"body": "Dont let them brainwash you.", "score": -1, "replies": []}]}]}, {"body": "If \"Too Big To Fail\" was a company", "score": 2, "replies": []}, {"body": "They be doing this for this one guys grandma", "score": 2, "replies": []}, {"body": "You really don’t want to own companies that need handouts. Like, really don’t want to own them over let’s say $NVDA. Unless you can somehow buy for a super low price like $5B MC.", "score": 3, "replies": [{"body": "this isnt a handout but ok, this is how defense industrial supply works lol, unless you want the US to depend on foreign countries to manufacture all it's military equipment", "score": 3, "replies": [{"body": "Its a grant and a granted contract to a US based manufacturer because of security concerns VS \"intel is the best manufacturing option over TSMC\"\n\nIts a hand out. Because Samsung manufactures domestically too.", "score": 1, "replies": [{"body": "because Samsung is not an american company buddy\n\nit's an investment in american industry so our country isnt left with it's pants around it's ankles if an actual war breaks out but ok", "score": 2, "replies": [{"body": "Exactly. The domestic nature of INTC is why they got the contract even if they aren’t good manufacturers. \n\nSome real… affirmative action going on", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "[https://finance.yahoo.com/news/ocean-power-technologies-awarded-1m-124100439.html](https://finance.yahoo.com/news/ocean-power-technologies-awarded-1m-124100439.html)", "score": 0, "replies": []}]}, {"body": "Raimundo is pretty smart.  I'd bet she has a plan.", "score": 1, "replies": []}, {"body": "US government hate monopoly that they willing to throw billions of dollars to failing enterprises to balance the market. Just like Boeing, INTC gonna solely survive by government subsidies and contracts.", "score": 1, "replies": []}, {"body": "Isn't TSMC AZ plant already running at the same run rate as Taiwan for 7nm? Why not just put more money to established and one that can make the chips instead one that is just burning money. Yes Intel is an US headquartered company but this is such a waste when a company that is based in a country that is really an US puppet with regard to military and international influence can already produce chips for the US gov", "score": 1, "replies": []}, {"body": "I’m not from America, but why the fuck is the government giving away $3 billion to big corp instead of using it to help people who are struggling with health issues or facing serious life problems?", "score": 1, "replies": []}, {"body": "Wouldnt be surprised to see US Govt pushing fear about China Taiwan, or \"imposing\" to get Intel back on its feet.", "score": 1, "replies": []}, {"body": "So a bail out.", "score": 1, "replies": []}, {"body": "Bailed out by the gov for what? I wonder how many politicians they own.", "score": 1, "replies": []}, {"body": "if other countries support their industry, its protectionism and unfair subsidies. If the US does it, its an military supply award", "score": 0, "replies": [{"body": "Yea why did you ever think the US ever plays in a fair way?", "score": 2, "replies": []}]}, {"body": "Why can’t the citizens of this country be awarded money from the government?? Wtffff", "score": 1, "replies": []}, {"body": "so much for capitalism. Intel will keep taking government money and keep squandering it away while other companies focus on actually innovating and creating new business. such a shit company.", "score": -1, "replies": []}, {"body": "This stock has inverse reddit written all over it.  Do yourself a favor and buy now.", "score": 1, "replies": [{"body": "Half the subreddit is still Intel bagholders. If anything it's direct Reddit.", "score": 1, "replies": []}]}, {"body": "And stock is still more than cut in half from what it was beginning of 2024.\n\nInvestor are still overly pessimistic about Intel and their terrible earnings. Is there any hope they can compete with the likes of TSM, Samsung, Broadcom, Nvida, AMD? Like... ever????\n\nIntel are too big to be more specialized like On Semis and Global Foundries. \n\nBut they are so far behind the competition to be a decent blue chip. Can they even get on par with the likes of Texas Instruments, Analog Devices, and Qualcomm?", "score": 1, "replies": []}, {"body": "They need to be making a bigger investment in GPUs. Government is so behind in tech.", "score": 0, "replies": [{"body": "cagey cows many follow market shelter normal subsequent cobweb decide\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 1, "replies": []}]}, {"body": "Look at it this way, if they run it back up to the low 30s it will only be 50% off it's all time high 😂", "score": 0, "replies": []}]}
{"title": "Why are Tesla puts so juicy in November?", "selftext": "I mean $7 OTM is going for like $18???\nI get the election and earnings but really?\n\nAm I missing something? Probably not going to sell because of the uncertainly but still feels weird. ", "id": "1fi65ua", "created_utc": 1726497179.0, "score": 22, "upvote_ratio": 0.74, "num_comments": 89, "comments": [{"body": "Because tesla swings 10 bucks a day off no news.", "score": 51, "replies": []}, {"body": "Iv is really high for Tesla delivery numbers, robotaxi event, earnings. Then maybe election.\n\nI can see it going to 170 or 300 lol.", "score": 63, "replies": [{"body": "Yup same. Hard to play. Last delivery numbers made it go nuts up to 265? On not great info. Was dumb.", "score": 13, "replies": [{"body": "That was because of the robotaxi hype, not delivery numbers. When musk delayed robotaxi, it dropped back to 200 before rising again now for the new robotaxi event", "score": 4, "replies": [{"body": "What is the robotaxi event actually going to deliver to shareholders?\n\nEven if Musk suddenly spun up that business, how much money could that possibly stand to make with regulatory headwinds and lots of competitors developing the same autonomous driving tech. Is Tesla's software superior? Seems like the answer is no.", "score": 0, "replies": [{"body": "Thats not the point. What value is crypto providing to justify current values? Nothing. It’s speculative trading. People looking for a profit so they are trading the hype around it. It could very well dump like all hell after the event or it could pump. Either way, I’m exiting my positions before the event.", "score": 3, "replies": []}]}]}]}, {"body": "If people ever realize Tesla is a car company it’s going to $20 a share", "score": 12, "replies": [{"body": "Teslas car business, if it never grows again, is worth around that.\n\nWhat the doom bears have to realize is that Tesla just isn’t a car company. It has energy, FSD, bot, solar. Those don’t make much money now (maybe never), but still have some value. How much is the hard and much debated part. There’s companies/startups out there that have no revenue or earnings worth billions.\n\nAt the same time, the moon bulls have to realize it’s going to take a lot of time to justify TSLA valuation with actual earnings even if everything goes right.\n\nThe right answer for a fair value is somewhere in between and the fun part of the market.", "score": 3, "replies": [{"body": "Aren't most of those things bullshit? FSD? Yeah right. \"Bot\"? You mean that ugly thing they were teleoperating? What are the margins in solar?\n\nTesla is an aimless shell trying to find a footing for its business. It's already way off its peak, but even at these prices it's a shitshow. \n\nAdd to that the fact that the CEO is a nutcase who seems to be getting worse all of the time.", "score": 2, "replies": [{"body": "FSD is doing no intervention drives currently. It gets us to restaurants door to door and back without issues. It’s still far from perfect all the time and really far from robotaxi dreams. But the direction of improvement is there over the past 2 years.\n\nBot went from a dancing clown to where it is in like 2 years as well. Time will tell if they ever get it to be useful.\n\nBeing skeptical on Tesla may be right in the end, but that’s almost the same as being skeptical of open ai and chat gpt saying it’s a fancy google search that’ll never replace workers with no earnings being valued at $150b. \n\nThe ceo could be as crazy as a bag of cats, but doesn’t detract from the talent at Tesla or his other companies doing great things.", "score": 3, "replies": [{"body": "What great things? All I see is vaporware.", "score": -1, "replies": [{"body": "My friends Tesla drives us regularly to places without any input.\n\nLook up Noland and any interview with him and his neuralink implant.\n\nThen basically anything spacex has done.\n\nMore than happy to have a genuine discussion about anything. But if you’re in the Elon bad everything bad cult, it’s not worth our time.", "score": 1, "replies": []}]}]}, {"body": "The official term (seriously) is \"Supervised Full Self Driving\" now. So SFSD lol", "score": 1, "replies": []}, {"body": "Then short it", "score": 0, "replies": []}, {"body": "CEO is a libertarian with a vision and balls, definitely need more like him and less like the CEO's of Ford or Stelanntis", "score": 0, "replies": [{"body": "lol, you're an idiot if you actually believe any of that.", "score": 0, "replies": [{"body": "Maybe an idiot, but Ford stock hasn't made any investors or employees rich in 60 years", "score": 0, "replies": [{"body": "Who gives a shit? What does any of that have to do with Tesla's woes?\n\nAre you drunk?", "score": 0, "replies": [{"body": "What woes? Stock is up 50% since April lows. Either you are drunk, or short, not sure which", "score": 0, "replies": [{"body": "Are you really this dense?\n\nFirstly, TSLA is trading almost 50% off it's ATH, which was made back in 2021. \n\nSecond, I'm referring to the financial woes, not the stock price. \n\nGood grief, there are some dumb people in this subreddit. 🙄", "score": 1, "replies": [{"body": "I am dense enough to realize I would much rather own TSLA than VW, Ford, Stellantis, or pretty much any other car company save for RACE. Both from a stock and financial perspective", "score": 0, "replies": [{"body": "How about rather owning none of those and something else instead?\n\nHave you ever done a DCF analysis on TSLA? \n\nWhat do you make of the company's declining revenue as they slash prices on their vehicles? \n\nWhat will you think if the Oct event is a dud?", "score": 1, "replies": [{"body": "DCF means a lot of you are evaluating an oil company for sure. Companies like NVDA, AVGO and TSLA would never have passed your filter 15 years ago", "score": 0, "replies": [{"body": "lol what? What is that supposed to mean? What even is my filter?\n\nAre you seriously suggesting to me that you don't both to evaluate TSLA's financial outlook whatsoever? You just invest because the line goes up?\n\nlmao", "score": 1, "replies": [{"body": "Discounted cash flow is your filter. Great for valuing utilities and oil companies. You invest because the dream that no one else sees becomes a reality and you make tons of money. NVDA dreamed of a new way to compute, and now is 30 times more valuable than INTC. Put that into your DCF spreadsheet. TSLA dreamed a new car up, and now could buy Ford 17 times over. Does your spreadsheet show that? You should read \"The Innovator's dilemma\", DCF isn't mentioned in the book.", "score": 1, "replies": [{"body": "DCF is just a general framework for assigning a valuation to a company. It's not a fixed number. But generally speaking, you want to understand how a company is making money and managing its balance sheet. Comparing TSLA to NVDA is laughable because NVDA is churning out revenue like mad right now. Yes, both NVDA and TSLA have had periods of speculative stock appreciation, but at the end of the day only one of these companies is delivering meaningful growth and earnings.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "People have said this same thing for years now.", "score": 1, "replies": [{"body": "When high margin electric cars with no other competitors was the status quo for almost a decade it was not too unreasonable for a high valuation now with smaller margins and more competition Tesla has to shift focus to unrealistic goals like Tesla taxi and home robots.", "score": 1, "replies": []}]}, {"body": "Good thing it’s not lol", "score": 2, "replies": [{"body": "What is it then?\n\nThe CEO seems very unstable.", "score": 7, "replies": []}]}, {"body": "its a robot company. They are replacing humans", "score": 0, "replies": [{"body": "Don’t hold your breath", "score": 2, "replies": []}]}]}]}, {"body": "Next earnings call is probably in the third or fourth week of October. Anything after that is going to have much higher IV than anything before. Most of the IV will drop off a day after the earnings report.", "score": 9, "replies": []}, {"body": "The earnings call in April flabbergasted me. The stock jumped after they reported their “worst revenue numbers in 12 years”. And kept climbing. Then they reported lower deliveries, even after lowering the cost of their cars, and it climbed even more. It makes no sense.", "score": 9, "replies": [{"body": "Market was expecting worse, so it was a positive surprise.", "score": 3, "replies": []}, {"body": ">It makes no sense\n\nshort term (less than 10 year) stock price movement is all about demand and supply", "score": 1, "replies": []}]}, {"body": "\"and earnings\"\n\nKinda burying the lede there, don't you think?", "score": 5, "replies": [{"body": "Not really when it comes to this stock. Last 2 earnings were absolute shit. Negative cash flow, no growth in the car sales, inventory rising.", "score": 1, "replies": []}]}, {"body": "There's also the robotaxi unveil happening in October* in vegas\n\n*Maybe", "score": 7, "replies": [{"body": "I think it got moved to a Hollywood studio in California?\n\nEdit: it not I. I have not moved to a Hollywood studio.", "score": 8, "replies": []}]}, {"body": "> I get the election and earnings but really?\n\nyou answered your own question. don't forget, trump has talked about giving elon a government job that would (at least temporarily) take him away from the day to day at tesla.", "score": 3, "replies": [{"body": "> trump has talked about giving elon a government job\n\nYeah, but that's predicated on Trump winning, which he's not going to do now that he's actually had to debate someone with a working brain.", "score": 0, "replies": [{"body": "> Yeah, but that's predicated on Trump winning, which he's not going to do now that he's actually had to debate someone with a working brain.\n\nyou're letting your biases overrule reality. the fact of the matter is that polling shows he has a very good shot of winning, and that's going to bring uncertainty about what to expect from tesla in the next few months.", "score": 1, "replies": []}, {"body": "Trump is leading in key states like Michigan now. Something MSM isn't covering", "score": 1, "replies": []}]}]}, {"body": "Because Elon Musk has gone full crazy and it is singlehandedly destroying the stock.   \nHe spends more time on X these days, then he does actually being a CEO of a major company.   \nWorse of all, he is spending it there insulting the very people who buy his Tesla cars.. Or used to.", "score": 15, "replies": [{"body": "I literally bought a Tesla last month because of all the smack he’s been talking. Always remember when your little feelings get hurt by something - chances are there’s someone else in the world who 100% agree with the original statement.", "score": -10, "replies": [{"body": "That's pretty funny that you'd buy a specific brand of car because of political beliefs.\n\nThat being said, I think this might not be a terrible move for Tesla.  There are many Americans who are disassociated with politics.  No matter what Musk says they're planning to buy an EV and they know Tesla is the leader in the market.   On the right, he could open up more prospects by pandering to that base.  The risk is that Trump is QUICK to dump people, especially when they don't show loyalty.  Musk knows this relationship is held together by a thread.\n\nHis political pivot could work out by adding additional buyers or it could blow up in his face and he can lose the market he was targeting and SOME of his previous market.  Only time will tell.", "score": 8, "replies": [{"body": "He got pivoted on tbh, he pledged a buncha money to trump and immediately after trump went on stage and talked about how stupid electic vehicles are. Lmao.\n\n\nThat said, protectionist policy is really his 'moat', if we got some BYD or NIO here tesla would get shellacked. But, thats not on the ballot. However, anti EV laws can come from the right and the liberals hate his guts. Pretty high risk a big event around november hurts them.", "score": 2, "replies": []}, {"body": "I would definitely consider buying a Tesla because of Elons political beliefs. Leftist enviros will only take a product so far", "score": 1, "replies": [{"body": "Hate to break it to you but leftist make a ton of the products you use. (Reddit)", "score": 1, "replies": [{"body": "A manufacturer with leftist beliefs can still do well selling a product people want. A manufacturer who ONLY sells to leftist enviros won't do well, or at most will only be a niche player, like Subaru", "score": 1, "replies": [{"body": "lol at Subaru, a Japanese company, targeting leftists. \n\nDo you differentiate leftists from liberals?", "score": 1, "replies": [{"body": "What used to be liberal (free speech, anti war, anti surveillance) is now considered alt-right. Look at RFK Jr for example. So to answer your question, no, liberals are leftists now", "score": 2, "replies": [{"body": "You are radicalized my friend, and this is coming from a centralist who thinks Harris’ economic policies are bonkers. \n\nGood luck.", "score": 1, "replies": [{"body": "Radicalized minarchist libertarian, yes, I agree", "score": 2, "replies": [{"body": "Haha you rock dude.  Upvoted.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Just as funny as not buying a car because of political beliefs.", "score": 1, "replies": [{"body": "There's a subtle difference between \"He said some things I agree with and so I went out and bought his car\" and \"I want/need to buy a car and I'd rather not buy one from the company of the CEO who said things I disagree with.\"\n\nEvery day I'm not buying a Tesla because of the things Musk says. But also for other reasons, chiefly that I don't need to buy a car.", "score": 3, "replies": [{"body": "Not buying a particular brand of car. People really think they are better than the other side. Then there's the rest of us on the sidelines watching the shtshow.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol. Ok. Nice gymnastics.", "score": 1, "replies": [{"body": "You did have the correct answer squeezed in there though. \n\n>you should base your decision on the car itself.", "score": 3, "replies": []}]}]}, {"body": "I agree.", "score": 0, "replies": []}]}]}, {"body": "The only one's who's feeling are hurt are you.\n\nMusk has had this problem time and time again; he can't shut up and his stock goes up and down based on the next stupid thing he's doing. It's not a matter of political allegiance; a CEO who spends as much time on twitter as he does is problematic for a stock price.", "score": 4, "replies": [{"body": "Honestly its the same shit that made the stock go up in the first place. Its certainly not the quality of vehicle hoisting the PE ratio 100x that of every other auto manufacturer.", "score": 3, "replies": []}, {"body": "Exactly. Contrast this with RR CEO, Tufan Erginbilgiç: the stock went up 380% from 2023 and isn't looking to stop, but the CEO made 0 political, personal, or otherwise work unrelated public comments.", "score": 0, "replies": []}]}, {"body": "Hope you got a cyber truck because that thing is a piece of shit.", "score": 1, "replies": [{"body": "Model Y .9% financing. Zero maintenance besides tires. Saves $1000+ a month in gasoline. Kind of worth it for the wifey who commutes to work.", "score": 1, "replies": [{"body": "$1000+/month? Dafuq? Are you driving 300 miles a day?", "score": 2, "replies": [{"body": "86 miles round trip. Last car was a v8. Also live in Southern California where gas is $5+", "score": 1, "replies": [{"body": "Daily driving a V8 for an 86 mile commute is a hell of a choice.", "score": 2, "replies": [{"body": "That’s why it makes sense. Plus she has chargers at work so basically charges for free.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Teslas are absolute junk, enjoy :)", "score": -1, "replies": [{"body": "I’m not going to lie they are junk. But my wife saves a minimum $1000 a month so it’s definitely worth it", "score": 1, "replies": [{"body": "Holy cow, how much do you all drive?", "score": 1, "replies": [{"body": "Good ol California traffic", "score": 1, "replies": []}]}]}]}]}, {"body": "He is very effective for a full crazy person.  He has single-handedly destroy the stock? Does that mean he single-handedly made the company successful and the stock up from where it was?", "score": 0, "replies": []}]}, {"body": "\"Probably not going to sell because of the uncertainly\"\n\nI think you answered your own question.", "score": 2, "replies": []}, {"body": "$7 is only 3% OTM for 60 days. \n\nIf I would to sell that put, I would worry about reaction to Fed cutting rates and 10/10 event as Tesla always drops after events. Delivery numbers and earnings will be positive for the stock though.\n\nTesla heading into an exciting year, but I will wait until we are past the coming recession before playing options on Tesla again.", "score": 2, "replies": [{"body": "this TSLA can do that move in 1 hr", "score": 1, "replies": []}]}, {"body": "TSLA has a lot more downside, can easily revisit $170 in a week when the news are bad.  I think upside is capped, so I occasionally sell credit spreads OTM like a 250/260 or just a few singly 250 naked calls", "score": 2, "replies": []}, {"body": "There is high IV and IVR that's why put options are expecnsive.\n\nBut the calls are more expensive, there is call volatilty skew there: [https://www.tradingview.com/x/Iyw6qInG/](https://www.tradingview.com/x/Iyw6qInG/)\n\nI'm not shorting put until IV is rising.", "score": 1, "replies": []}, {"body": "If trump wins Leon is going to go join his administration they say. Hard to imagine he can run 4 multi billion dollar companies and a country.", "score": 1, "replies": []}, {"body": "With how good their FSD is shaping up, tons of videos on YouTube. It could easily be the defacto standard of the future. Just like their charging standard and supercharger network. They aren’t missing, even the one thing that people swore was failing the Cybertruck. It’s outselling all the competition.", "score": 1, "replies": []}, {"body": "It's a trap!", "score": 1, "replies": []}, {"body": "What strikes you looking at? Also isn't that when earnings is?", "score": 1, "replies": []}, {"body": "You said the reasoning yourself - uncertainty.", "score": 1, "replies": []}, {"body": "It means Trump is expected to win. Bye bye EV credits.", "score": 1, "replies": []}, {"body": "because trump wil lose and elon wil lose his shit, might sell everything and run away to SA", "score": 1, "replies": []}, {"body": "I think $100 is more likely than $300 if deliveries decline significantly and energy biz can’t save them", "score": -2, "replies": []}]}
{"title": "Intel awarded up to $3B by Biden-Harris Administration for Secure Enclave", "selftext": "https://www.tipranks.com/news/the-fly/intel-awarded-up-to-3b-by-biden-harris-administration-for-secure-enclave", "id": "1fic500", "created_utc": 1726511561.0, "score": 274, "upvote_ratio": 0.92, "num_comments": 88, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 12 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Hooray for the kid who invested his inheritance. Make grandma proud!", "score": 204, "replies": [{"body": "Honestly the stock hasn't done as well as I thought it would considering all of this positive news.\n\nIt's only up 1 point today", "score": 62, "replies": [{"body": "INTC is a cash burning mega factory. They will burn those $3BN quickly!", "score": 33, "replies": [{"body": "Executive salaries will account to 25% of that", "score": 11, "replies": []}]}, {"body": "Got $20 calls at 0.80 today. They are up to 1.12 (40%) at this time. INTC YOLO.", "score": 17, "replies": [{"body": "Meanwhile I’ve been stacking $34 yearlys for 20 bucks and now they are all worth 80 🫦", "score": 6, "replies": []}, {"body": "They were that cheap? It opened at $19.86 so that's not really that far OTM.", "score": 2, "replies": [{"body": "0.57 before opening, and premarket was ~20.15-20.20", "score": 2, "replies": []}]}]}, {"body": "Because it’s meaningless money. Intel still needs to prove they can turn a profit with the grant money. If you give them 100B and they use it towards manufacturing but they still sell chips at a loss or nobody buys them then it doesn’t matter does it?", "score": 5, "replies": [{"body": "Please tell me what chips they are selling at a loss 🤣", "score": 4, "replies": [{"body": "With all the rmas for 13900 and 14900k, it's essentially at a loss now. They're refunding ppl with 13900k issues the full retail price on release and some are lucky enough to receive a 14900k instead of 13900k from RMA (presumably because they're out of 13900k)", "score": 2, "replies": [{"body": "I can still buy all of those chips, show me what you are talking about, because Intel already has a 14th gen line and are working on their newest chip line releasing soon in Nov, I don’t see any losses to be had. Sounds like complete fud to me considering Intel is one of the longest standing chip manufacturers", "score": -1, "replies": [{"body": "Sure bro, if Google is too hard for you I can send you some links.\n\nFirst here's a post directly from the Intel sub about someone trying to RMA one week ago and them not having stock. People in the comments also confirm they are receiving 14900k or $600 for the RMA. \nhttps://www.reddit.com/r/intel/comments/1f86w3n/intel_currently_out_of_replacements_for_defective/\n\nhere's an article: https://www.tomshardware.com/pc-components/cpus/intel-customer-scores-core-i9-14900k-as-a-replacement-for-degraded-core-i9-13900k-another-received-a-dollar599-check-for-a-fully-working-core-i9-13900k\n\n\nBut hey maybe all these people are lying and you're correct. I wouldn't know, I'm not attempting to RMA since I'm on an AMD chip", "score": 2, "replies": [{"body": "Because AMD chips never needed an RMA right? What a joker! Keep shorting Intel kid", "score": 0, "replies": [{"body": "I have no reason to short Intel, but at the same time I have no reason to buy Intel either when it's overpriced rn. Maybe at 17-18.", "score": 1, "replies": [{"body": "RemindMe! 60 days", "score": 1, "replies": [{"body": "I will be messaging you in 2 months on [**2024-11-20 15:10:59 UTC**](http://www.wolframalpha.com/input/?i=2024-11-20%2015:10:59%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1fic500/intel_awarded_up_to_3b_by_bidenharris/lo7v0vz/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1fic500%2Fintel_awarded_up_to_3b_by_bidenharris%2Flo7v0vz%2F%5D%0A%0ARemindMe%21%202024-11-20%2015%3A10%3A59%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fic500)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Can't wait for Intel to get bought out! Would actually be worth buying then", "score": 1, "replies": []}]}]}, {"body": "Please do comment again in 60 days", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "its a small stock\n\n1 pt is 5%", "score": 1, "replies": [{"body": "Perception is warped to the point where 7% day is meh.", "score": 6, "replies": []}, {"body": "Fair", "score": 2, "replies": []}]}]}, {"body": "He bought at low 30s…", "score": 4, "replies": [{"body": "$22.61 in after hours. Maybe there is hope for him soon, to get out of the position.", "score": 1, "replies": [{"body": "Stocks need to go up another 40% to get from 22.61 to $30… 😂", "score": 3, "replies": []}]}]}, {"body": "I think his grandma was Nancy Pelosi.", "score": 4, "replies": []}, {"body": "Never gets old \nFlippin love it ere 😆", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/lbcce2sq28pd1.jpeg?width=920&format=pjpg&auto=webp&s=da24a1789139500e1eadbd945f039ddc90565112", "score": 56, "replies": [{"body": "powered by Nana's inheritance money\n\nhttps://preview.redd.it/1owk3gamdbpd1.jpeg?width=511&format=pjpg&auto=webp&s=e6aca810d7055a9118f8ab938a62728b563372ee", "score": 5, "replies": []}]}, {"body": "Did the guy that spend all grandmas money diamond hand untill now? Might get some money back!", "score": 37, "replies": [{"body": "I think he bought in in the 30s lol", "score": 30, "replies": [{"body": "Oh god loool well who knows...", "score": 11, "replies": []}, {"body": "Then he is going to hold it till in his 90s", "score": 6, "replies": []}]}, {"body": "He sold yesterday", "score": 0, "replies": [{"body": "One of us! One of us!", "score": 1, "replies": []}]}]}, {"body": "Governments doing what they do best. Socialize losses, privatize profits.", "score": 99, "replies": [{"body": "The government bought the dip on Intel and they’re trying to make it work now.", "score": 7, "replies": []}, {"body": "Why you buy the dip, duh", "score": 2, "replies": [{"body": "I haven't played the market much yet, at least on the options. Maybe in the future.", "score": 1, "replies": [{"body": "Who said we were playing options? Either way! Your in WSB for a damn reason. Options are instruments to secure an investment and should be used as such. Buy and hold shares kid, once you get over 100 you are able to sell calls on weeks the shit doesn’t move. Which is what I have been doing, selling early Intel calls and buying farther out ones with the profit. 100 shares gives you the right to sell 1 call. Either way don’t play options unless you know what your doing. You will lose 90% of the time, which is how I get paid from selling.", "score": 6, "replies": [{"body": "The maximum risk in selling the covered call is you loose the 100 shares, right? \n\nAnd uncovered calls have (in theory) infinite risk?", "score": 2, "replies": [{"body": "That is correct! I would always rather take the small loss than losing my shares though, but most calls expire worthless, espeicallly when we just hit bottom and shits about to range for a week or two", "score": 2, "replies": [{"body": "Works until it doesn’t and all your premiums are gone", "score": 2, "replies": [{"body": "Like I said, if you don’t know what your doing then stay away, but 90% of calls expire worthless, it’s simple math really", "score": 1, "replies": []}]}]}, {"body": "You can’t sell uncovered calls…", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Taxpayers coming in to save the day!", "score": 28, "replies": [{"body": "![img](emote|t5_2th52|8882)", "score": 4, "replies": []}, {"body": "Intel bag holder here. I knew the whole time my bet was backed by the us government. ", "score": 3, "replies": []}]}, {"body": "https://preview.redd.it/3pahrcw3h8pd1.jpeg?width=844&format=pjpg&auto=webp&s=44e7de84cfd9b4bd36ea2493f1fe806bdd4c85d9", "score": 8, "replies": []}, {"body": "*LET’S GOOOOOOO*\n\nhttps://preview.redd.it/n3eqd4jc18pd1.jpeg?width=1024&format=pjpg&auto=webp&s=1ac755103b442e0261e504790acef870306319ff", "score": 15, "replies": [{"body": "Needs more Nana.", "score": 3, "replies": [{"body": "Nana sauce with them tendies", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Possibly something like Stale Diffusion (generative \"AI\") with a custom fine-tuned model? Or he uses slight variations of the same (long) prompt.", "score": 1, "replies": []}]}]}, {"body": "https://preview.redd.it/rexyfknt78pd1.jpeg?width=1179&format=pjpg&auto=webp&s=9092486e332a250e40f7ac14302a7cf7f8146111", "score": 7, "replies": []}, {"body": "Gov bailing out INTC wtf", "score": 7, "replies": [{"body": "Yeah really gross honestly", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 10, "replies": [{"body": "This could be the origin story. \n\nDefense technology megacorp survives the apocalypse.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Secure Enclave isn't a bailout.", "score": 3, "replies": []}]}, {"body": "Cutting 15,000 jobs . Slashing their way to prosperity. Gov't bailout .. Nana's boy if you can hear me . Please pull the ripcord at $25 . Take the hit and be glad.", "score": 4, "replies": []}, {"body": "Wow, I wish they did the same for people.", "score": 3, "replies": []}, {"body": "grandpa biden to the rescue!", "score": 3, "replies": []}, {"body": "Last chance to grab some tickets to the moon  🚀", "score": 6, "replies": []}, {"body": "Sounds like Pat is getting a nice bonus (RIP my former dividends).", "score": 2, "replies": []}, {"body": "Quick! Someone dig up Grandma! I don't think she's dead!", "score": 2, "replies": []}, {"body": "Intel has to be the most subsidized private company of all time next to Boeing. But all these free money is just absolutely wrecking their quality and innovation capabilities.", "score": 2, "replies": []}, {"body": "According to investing.com, the stock “soars”… 8% after hours. Come on give me a break, it’s pathetic.", "score": 2, "replies": []}, {"body": "Was the other 7 billion not enough?", "score": 2, "replies": []}, {"body": "with this amount pf moola- they really should be offering free SBux coffee ☕to employees", "score": 1, "replies": []}, {"body": "Dayum.", "score": 1, "replies": []}, {"body": "I didn't know Buicks got that expensive.\n\n  \nCalls on autos!", "score": 1, "replies": []}, {"body": "the government is absolutely inflating intel holy shit", "score": 1, "replies": []}, {"body": "Intel just might be a buy. It looks more and more everyday like the government will do anything to bail them out.", "score": 1, "replies": []}, {"body": "I think they should build a plant in El Salvador", "score": 1, "replies": []}, {"body": "Does this mean there will be be no foundry spinoff?", "score": 1, "replies": []}, {"body": "So NVDA puts?", "score": 1, "replies": []}, {"body": "The F. So govt bail out", "score": 1, "replies": []}, {"body": "If we had a quarter for every time the Gov subsidizes a huge corporation we wouldn’t need the stock market. I know dumb statement", "score": 1, "replies": []}, {"body": "Make Intel Great Again!", "score": 1, "replies": []}, {"body": "ti pranks dot com \n\nIs thsi a prank?", "score": 0, "replies": []}]}
{"title": "Apple shares slid Monday after reports that demand for the new iPhone 16 is lower than expected — and down 12% year over year", "selftext": "", "id": "1fif4jv", "created_utc": 1726518776.0, "score": 461, "upvote_ratio": 0.95, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "They are still rich as fuck and all that. But as future investor, there are some question marks here right? They are churning repeat product lines with almost meaningless upgrades to the average user. Their significant “innovation” is on payments/pay and expanding that revenue. ", "score": 267, "replies": [{"body": "As the company gains in maturity, they’re likely to increase the dividend to keep investors happy.", "score": 89, "replies": [{"body": "I guess that's what they're saving that mountain of cash for. It's the \"rainy day\" fund.", "score": 43, "replies": [{"body": "You would too if you almost bankrupted few decades ago.", "score": 1, "replies": []}]}, {"body": "or fuck you, buybacks", "score": 21, "replies": [{"body": "Buybacks will still increase the share price, no?", "score": 11, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271) first time?", "score": 20, "replies": []}]}]}]}, {"body": "Anyone who has an old phone has to update at some point. Having a new model that’s current to update to your timing cycle is better than a year old model. There’s always a customer to cater to. 16 is for the stragglers who didn’t go to 15. 17 is for the main wave. 18 for the stragglers. Same thing every two to three years. No one cares because everyone knows this at the institutional level. ", "score": 24, "replies": [{"body": "I have a 13 pro and I’m just gonna have them replace the battery for $90 instead of shelling out $1k to get a camera button. Not sure what would compel me to get the 17 but it’ll need to be fairly major", "score": 20, "replies": [{"body": "What about this: with AI picture generators getting really good, people in the future won't be able to tell what's real and what's fake anymore. Eventually phone makers will start adding a digital signature to the photos that's somehow secured across the entire picture taking pipeline to prevent tampering, starting with the sensor chips (and maybe the photo includes depth/lidar data to prevent just taking a photo of a screen). So you will be able to *prove* that your photos are real, and maybe social media sites will add a little \"verified photo\" badge only to such pictures.", "score": 6, "replies": [{"body": "Whatever you'd do to \"digitally sign a photo\" on the client side could be also used for the fake photos. Even if it was hard (assuming not cryptographically hard), it wouldn't be impossible. And we're back to square one — you can't 100% trust the photos you see", "score": 7, "replies": [{"body": "If the chain starts all the way at the camera sensor chip (and the other sensors), it would be far beyond your typical consumer or company.\n\nSure, even things like TPM chips have been cracked in the past, and this probably wouldn't stay reliable forever as technology improves, but it should be good enough for a while. You could also combine it with verified timestamps from a server and stuff like that.\n\nNot to mention, known compromised individual chips could be blacklisted, which would prevent their use for mass spamming fake pictures. It would never be completely 100% (you can always fake *any* sensor data the analog way if you're dedicated enough - but at the moment no AI image generators include lidar data), but it would take care of a large majority of the problem.", "score": 2, "replies": [{"body": "What would be the advantage of starting at the sensors? After all in the end you get a digital photo that's made up of ones and zeros, and you can always modify it to bypass any security measures (as long as the security process has been reverse engineered). Server timestamps would also provide little to no security (you could simply request them for the fake photo).\n\nEven if a working solution was created, I think it would cause even more harm than good, because those who would benefit the most from faking photos (e.g. opposing political parties or foreign powers (Russia, China, North Korea)) would find out a way to mark an AI generated photo as verified, no matter how costly or hard it would be.\n\nThe average person would be made to believe that the verification process is almost impossible to crack, so they'd trust any photo with the verification mark — that's a malicious actor's goal.\n\nIf the process is intellectually hard but not computationally intensive, then it's not enough. Programs get cracked/hacked because they're *just obfuscated*; someone with enough skill and time can bypass all restrictions. Cryptographic security on the other hand is pragmatically completely infeasible (e.g. it'd take a billion years to crack an SSL connection that lasts a few hours/days) no matter if you have access to the best supercomputers on Earth (although quantum computers may change it in the future)", "score": 2, "replies": [{"body": ">After all in the end you get a digital photo that's made up of ones and zeros, and you can always modify it to bypass any security measures \n\nHow? You don't have access to the private key like the hardware does - if you modify it, the signature won't match.\n\n>What would be the advantage of starting at the sensors?\n\nThe reason to have some form of encryption built into the sensor itself is so you can't just desolder it and swap it for a sensor that would feed in fake data. The sensors need to be trusted. Of course there is always the \"analog hole\" - just take photo of a display - that's why you add sensors that make reproducing realistic data in an analog way more difficult (depth etc.).\n\n>(e.g. opposing political parties or foreign powers (Russia, China, North Korea)) would find out a way to mark an AI generated photo as verified, no matter how costly or hard it would be\n\nThat's not the problem this aims to address. Hell, if they really care *that* much, they can just re-create the scene in the physical world, or coerce the phone maker to give them the keys.\n\nThere is still a ton of value in having a cheap (relatively) way of taking more mundane pictures with some basic non-absolute level of trust for regular people, in a world we're heading into.", "score": 1, "replies": [{"body": "> The reason to have some form of encryption built into the sensor itself is so you can't just desolder it and swap it for a sensor that would feed in fake data. The sensors need to be trusted\n\nI'm pretty sure the Chinese would manage to reverse engineer and copy the hardware within days of it being released. As long as it's client-side, it shouldn't be trusted\n\n> if they really care that much, they can just re-create the scene in the physical world\n\nYet that haven't been doing that (successfully) for the past years/decades (before AI). You can't just mimic a person's appearance. It would be easier to photoshop it, but it's still error prone and easy to debunk\n\n> or coerce the phone maker to give them the keys.\n\nIn the same way they could coerce a corporation to give them private data of the people they'd target — easier to destroy someone's credibility/career using their personal information than by attempting to spread fake photos\n\n> There is still a ton of value in having a cheap (relatively) way of taking more mundane pictures with some basic non-absolute level of trust for regular people, in a world we're heading into.\n\nI don't see many use cases if they don't regard famous/important people.\n\nBy the way, what if you wanted to photoshop the signed photo (e.g. to apply some filter, add stickers, remove background etc.)? I suppose it would break the signature.  If it had to be re-signed then the re-signing software would be another vulnerability (even easier to exploit than hardware)", "score": 2, "replies": [{"body": "You seem to think that if the whole system is not perfect, then it must be completely useless.\n\nThere are tons of things (laws, processes, etc.) in the real world that we rely on in our day to day lives, that have limitations or flaws. And we mostly get by just fine.\n\n>I'm pretty sure the Chinese would manage to reverse engineer and copy the hardware within days of it being released. As long as it's client-side, it shouldn't be trusted\n\nEven if you have the design, the point is that each individual chip has its own unique key, and all the keys that were ever issued are signed by the manufacturer and have an entry in their database. Copying the hardware design does nothing here if you can't also issue valid keys.\n\nIf a random noname phone company makes the same kind of hardware, all they will be able to claim is that some picture was definitely taken by one of *their* phones - and people may chose whether they want to trust that claim or not, based on the reputation of the company. Which will probably mean less to people than a similar claim from Apple or Google or Samsung.\n\n>By the way, what if you wanted to photoshop the signed photo\n\nYou simply won't be able to get verification on modified photos, they would be unverified.\n\nMaybe some sites could have some kind of lesser \"verified + filtered\" badge, where the original must also be available if people want to compare it themselves, but the modified version could show up on the page by default? There are many ways that could be done, but only the original would have the real signature.", "score": 1, "replies": [{"body": "> You seem to think that if the whole system is not perfect, then it must be completely useless.\n\n> There are tons of things (laws, processes, etc.) in the real world that we rely on in our day to day lives, that have limitations or flaws. And we mostly get by just fine.\n\nMy point is: what are the use cases apart from protecting from e.g. spreading fake propaganda videos (which would get even more valuable if people believe that they're almost impossible to fake (as is with e.g. secure internet connection))?\n\nIf you come up with some minor ones (like the average person posting on their social media), then yeah it's not worth to consider irrelevant flaws in the security system. Although I don't see why regular people would care about any of that, especially that they almost always use photo filters, beautifiers etc. Just check the average girl's social media.\n\nHowever if the only people who'd use it were high ranking politicians, CEOs etc. then it would be necessary to make the process completely safe. Otherwise you're giving the bad actors (who have the means to bypass tour security systems) even more power.\n\n> Even if you have the design, the point is that each individual chip has its own unique key, and all the keys that were ever issued are signed by the manufacturer and have an entry in their database. Copying the hardware design does nothing here if you can't also issue valid keys.\n\nSo I suppose the keys would be public, one key for a device, and the device signs the photo with the public key? If so, then simply copying the device (with the key that's attached to it) would replicate its security process. (If I'm missing something here, well, you didn't explain in detail how you think it could be done, so I must do some guessing). The manufacturer would see that the fake photo is signed with the exact same (simply copied) key it recognizes, so it'd assume it's an original, verified photo.", "score": 1, "replies": [{"body": "There are reasons why people would want a verified photo, like insurance claims, shutting up doubters, fun things like UFO discussions and so on.\n\n>So I suppose the keys would be public, one key for a device, and the device signs the photo with the public key?\n\nNo, obviously the photos are signed with the *private* key. Which would have to be stored in some tamper-proof way (https://en.wikipedia.org/wiki/Tamperproofing#Chips). None of this is exactly new technology.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hear me out here…blockchain", "score": 0, "replies": []}]}]}]}]}]}, {"body": "And me just sitting here buying the refurbs for pennies that last forever.  14 pro refurb for a few hundred in excellent condition that will last me 3-5 years…", "score": 16, "replies": [{"body": "> refurbs\n\n> last me 3-5 years \n\nThen you are still the market for the next iphone XXX.", "score": 13, "replies": []}, {"body": "How many hundreds? Feel like the 14 pro hits the sweet spot if you can find one with good battery health", "score": 3, "replies": []}]}, {"body": "…I’m going from 11 to 16 Pro…", "score": 1, "replies": [{"body": "I'm still on a 10 max plus, haven't updated in forever either.  prob going to explode soon fwiw", "score": 1, "replies": []}]}]}, {"body": "Nickel & diming at its worst. But they can almost afford to buy back all their stock with how much cash they have. Or would if most of it wasn’t being offshored", "score": 1, "replies": []}]}, {"body": "But infinite growth is supposed to happen.", "score": 141, "replies": [{"body": "Yes, this was my understanding after 4 years of market experience. I’m pretty much a well tenured expert on technical analysis with a deep understanding of what a “market cap” is.\n\nApart from the aforementioned technical analysis, Investing is basically all about compounding growth. If a company is not growing by 25% every year, and every previously gained 25% is also growing by 25%, I’M NOT INTERESTED. Only moon.", "score": 37, "replies": []}]}, {"body": "It’s the same every year. Next quarter “iPhone 16 demand was surprisingly strong”. Classic market manipulation.", "score": 33, "replies": [{"body": "Best part is the “reports” in question is an article with 0 data sources/proper Methodology by a clown Taiwanese analyst posting on twitter and medium", "score": 12, "replies": [{"body": "Dude does the same shit every iPhone release. \n\nI think he is looking at SKU’s and estimated shipping times compared to the last iphone launch- i believe this data is only for the pro models. \n\nLike maybe they just made more phones? Maybe more people are getting the regular non pro version?\n\nSeems like an attempt at stock price manipulation to me…", "score": 2, "replies": [{"body": "Exactly. Apple already beefed up the initial supply of the 16 so what does looking at shipping times even prove? And what the fuck even are the supply chain surveys he made? How is that even credible at all.\n\nThe numbers are literally from his fucking ass, and the base expectation numbers are also from his ass. He has 0 official data sources from Apple. I bet his puts are paying off huge right now. Such easy manipulation.", "score": 2, "replies": []}]}]}, {"body": "It was already weak with the Iphone 15\n\nIn order to justify the current share price, iphone sales would have to grow 20 - 30%. That aint gonna happen.", "score": 3, "replies": []}]}, {"body": "They can't reinvent the wheel with their phones and laptops. Vision Pro was supposed to be the next big thing but it fell flat. I'm sure Tim Apple has some aces in his sleeves, otherwise the services side of the business still looks healthy", "score": 71, "replies": [{"body": "There's no way they expected Vision Pro to catch on with a $3500 price tag, I still can't really work out what the aim was. Maybe business adoption?", "score": 54, "replies": [{"body": "Business consumers are the largest base so far, besides business, nonprofits are the second one the Obama library for example  and a couple outreach locations buy dozens to create interactive experiences and events.\n\nThe regular guy doesn’t need a 3500 mixed reality headset but it’s what the HoloLens was trying to be", "score": 8, "replies": [{"body": "What business applications need VR headsets?", "score": 5, "replies": [{"body": "very, very niche. it was doomed a product.\n\napple needs a killer another killer product, wont be easy to do it again.", "score": 1, "replies": []}, {"body": "Architecture visualization, literally the biggest consumer we had is an architecture school within a university. They also did some for the physics department but they spent more on computers and racks than the Vision Pros", "score": 1, "replies": []}]}]}]}]}, {"body": "I work at a verizon store. This year vs last year, pre-orders are much much lower. Last year, most pre-orders will backed up till October. Right now, most are still available.\n\n\nI'm sure the stock will drop, but by how much, I have no clue.", "score": 59, "replies": [{"body": "Good insight, thanks.", "score": 16, "replies": []}, {"body": "I couldn’t find anything available, everything was pushed back to October just 1 hour after it went on sale.", "score": 8, "replies": []}, {"body": "Part of the reason could be better supply chain this years after years of bottlenecks post COVID. Pre COVID iPhones had a lot of innovation and took until last minute to make these phones. This year’s update is mostly Software that is not ready. The hardware updates were probably figured out a long time ago.", "score": 7, "replies": []}]}, {"body": "After 4Q earnings: AAPL skyrockets to ATH on middling iPhone 16 sales weren’t as bad as everyone was expecting.", "score": 38, "replies": [{"body": "Probably whats gonna end up happening, same shit happens every year lol", "score": 22, "replies": []}, {"body": "but that doesn't help me when the LEAPS i bought half a year ago expire this Friday.", "score": 6, "replies": [{"body": "lol maybe don’t buy short expiry options?", "score": 1, "replies": []}]}]}, {"body": "Apple sales will outperform. Will be looking for some discounted calls this month.", "score": 31, "replies": []}, {"body": "Nah. It’s gotta be something else. Those shit phones are “sold out” pretty much everywhere in CT and other States.", "score": 20, "replies": [{"body": "Yeah our demand in store might be down from like the 14 release but still very much alive", "score": 9, "replies": []}, {"body": "they release 100phone per store. off course they are sold out", "score": 6, "replies": []}]}, {"body": "No s**t, let’s give people 4 years to pay off a $1500 phone and expect them to buy a new one every 18 months.", "score": 28, "replies": [{"body": "A lot of people buy them mindlessly, because shiny new colour ✨", "score": 14, "replies": [{"body": "Then proceed to put a case on that shiny new color.", "score": 7, "replies": [{"body": "The pitfalls of buying a thing you can't really afford", "score": 1, "replies": []}]}]}]}, {"body": "I’d be more likely to upgrade my phone if it wasn’t $1800+ CAD for a new one.", "score": 6, "replies": [{"body": "New iPhone 16 is $799 wtf are u talking about.", "score": -1, "replies": [{"body": "I have a 13 Pro - The 16 pro with 512gb of storage, equivalent of mine is like $1900+ tax. My 13 pro only cost like $1100 when I got it.", "score": 2, "replies": []}]}]}, {"body": "They'll just buy back their shares.\n\nAgain.", "score": 4, "replies": [{"body": "Ya that’s called capitalism lol. Apple makes a shitload of profit.  They need to do something with it.", "score": -1, "replies": [{"body": "Fun Fact: It used to be illegal to buy back shares.", "score": 2, "replies": [{"body": "Ya and more companies paid dividends back then what is your point? Times have changed.", "score": -2, "replies": [{"body": "Oh, you think I'm attacking you with a random fact.\n\nNot the case here.", "score": 1, "replies": []}]}]}]}]}, {"body": "Wait till they check sales on their airpods max and ultra 2.", "score": 3, "replies": []}, {"body": "China's economy going to the shitters lmao, get fucked", "score": 3, "replies": []}, {"body": "besides a chip upgrade and camera improvements,  it's the same phone. really no point upgrading if you have an iphone15", "score": 2, "replies": [{"body": "It’s the iPhone 15S", "score": 2, "replies": []}]}, {"body": "I just switched from iPhone to android this past Sunday. Tired of the same worn down apple ecosystem. Galaxy Z Fold 6 has been a refreshing change.", "score": 2, "replies": []}, {"body": "Zoom out mother f******", "score": 2, "replies": []}, {"body": "Americans are cutting back on Dollar General, and they think people are just going to buy a rehash of the same old cell phone every year.", "score": 2, "replies": []}, {"body": "They need to come up with some real, or at least visible change. The \"dynamic island\" needs to go away, or make a foldable version, anything showy enough to make the poser crowd switch", "score": 5, "replies": []}, {"body": "But we’ve thrown AI at our disciples!", "score": 2, "replies": []}, {"body": "I would’ve upgraded if they did some cool shit like an Iflip (foldable Iphone) … or a phone that shoots up a hologram \n\nchop chop Apple…i swear my phone got dramatically slower this past month too", "score": 2, "replies": [{"body": "They are supposed to incorporate their AI software through updates apparently, but even MKB said that was dumb, because for a new phone that should be the selling point.", "score": 4, "replies": []}]}, {"body": "If Apple had  any testicular fortitude they would make a Physical Keyboard phone but with all the new tech, something similar to Blackberry Key 2.", "score": 1, "replies": []}, {"body": "I’ve been actively looking for a reason to upgrade my 13 pro since the 14 came out, but I still can’t find one. I guess I’ll wait for the 17 and see.", "score": 1, "replies": []}, {"body": "There’s honestly no innovation in the phones to justify a bigger increase in stock price.\n\nFor apple to justify it’s current price, they have to release a new succesful line of products.", "score": 1, "replies": []}, {"body": "Mature market. I don't know what people are expecting", "score": 1, "replies": []}, {"body": "I watched the MKB video and it wasn’t super impressive. Definitely seems like a skip and waiting for the 17 is the move once the AI software is fully integrated. \n\nI’m someone who likes getting the new phones if they are worth it, but the 16 and 16 pro feel underwhelming.", "score": 1, "replies": []}, {"body": "What no AI?  No super cycle?  What a joke these clowns are on cnbc.", "score": -1, "replies": []}]}
