{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1fd93ix", "created_utc": 1725940832.0, "score": 11, "upvote_ratio": 0.93, "num_comments": 93, "comments": [{"body": "WE DIDNT LOSE MONEY TODAY (2 DAYS IN A ROW)", "score": 10, "replies": []}, {"body": "Low volume. People are waiting for the CPI report and Jensen at GS tomorrow it seems.", "score": 8, "replies": [{"body": "Nvidia CEO Jensen Huang to speak at the Goldman Sachs conf. Wed. 10:20 am ET.", "score": 1, "replies": []}]}, {"body": "TSMC reported a pretty good August overnight….and of course is going down in pre market. Gotta love this logic", "score": 6, "replies": [{"body": "It’s as if good news make some investors sell so they can buy cheap, and bad news make everyone sell to force the company to do better 🤔", "score": 4, "replies": []}]}, {"body": "Another rugpull day on NVDA", "score": 6, "replies": [{"body": "I read that’s mainly due to the fact that most trades are made with an algorithm. And this is prone to sudden drops because they constantly buy and sell like every second or minute", "score": 2, "replies": [{"body": "Yeah. It’s still impressive for NVDA to erase 2.7% gain in less than an hour after being in the oversold territory.", "score": 1, "replies": [{"body": "I think people need more tangible proof that ai is or going to be impactful when these data centers get new hardware. But for now it’s hard for people to understand technology. Old money is probably skeptical", "score": 2, "replies": [{"body": "Yeah. We are really behind in terms of AI applications. That’s why I’m bearish on the stock. Even China got FSD buses everywhere.", "score": 0, "replies": [{"body": "Oh yea? That’s interesting. I saw a Chinese self driving taxi and it looked pretty cool. So what company are bullish on then? In AI?", "score": 1, "replies": [{"body": "Yeah. I saw pictures of those FSD buses and they also got so many amazing AI innovations with those trash H20 chips. We should encourage leading companies like NVDA instead of punishing them for being great. To me, nothing in AI is bullish ATM", "score": 0, "replies": [{"body": "Oh damn. Apparently they access to the American hardware anyways. They would definitely use it to censor and propagate their agenda", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Watching NVDA skip across it's close like a stone across a pond. Ripples soon become waves.", "score": 5, "replies": [{"body": "Haiku version:\n\nNVDA skips,\n\nlike a stone across a pond.\n\nRipples become waves.", "score": 5, "replies": [{"body": "**Silicon dreams soar,**  \n**Nvidia price descends,**  \n**Investors’ hearts ache**", "score": 3, "replies": []}]}]}, {"body": "2 Green Day’s in a row would be bliss", "score": 3, "replies": [{"body": "The pump and dump came quicker today", "score": 1, "replies": []}]}, {"body": "I cant wait to break even and get out of this stock", "score": 8, "replies": [{"body": "Same.. but I'm at 126.11. Long ways.", "score": 3, "replies": []}, {"body": "Will you though... nvda people flip from doom to moon in a nanosecond.", "score": 3, "replies": []}, {"body": "Ive learned to not check it during the day, its way to volitile for whatever you see at 11 am to be what it will be at 4pm. I nearly drove myself insanse checking it like every 30 minutes, especially as it has been tanking", "score": 6, "replies": []}, {"body": "Just curious..what is your break even?", "score": 2, "replies": []}, {"body": "Sell covered calls at your cost basis.", "score": 1, "replies": [{"body": "I applied for permission yesterday from my broker. Completely new at that type of investment but some others have suggested the same for me. To make sure, I either collect the premium and stay with stocks or if the strike number hits, I sell my stocks and keep the premium? So either way I'd win right?", "score": 1, "replies": [{"body": "You would sell to open a call. Only do this if you have the shares (at least 100). Never sell naked calls (where you do not own the stock). You always keep the premium no matter what. I'd start off selling monthly contracts. It may take a while to dig out of the hole, but it can be done. So you would sell a covered call at the $126 strike price, receive let's say 300 in premium, which lowers your cost basis to $123.11. If it does not hit the strike price you keep the premium and repeat. If it hits $126, it will execute at $126 and you still keep the premium. My cost basis is around $111 right now. I have 2 covered calls and 1 put that I have sold. Do not sell at a stroke price below your cost basis.", "score": 1, "replies": [{"body": "Copy, I do own the shares (951)! That sounds good, even if I can recover some of that money that'd be great. Can I PM you when Vanguard approves my level 1 permission to sell calls? if you don't mind, some guidance would be nice!", "score": 1, "replies": [{"body": "Yes that's fine.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Ok which asshole caused this", "score": 3, "replies": [{"body": "A lot of assholes caused this", "score": 4, "replies": []}]}, {"body": "and...we red!", "score": 3, "replies": []}, {"body": "i hope those selling assholes will get it for them, no way people are selling at $107 hope it bites them in the ass", "score": 6, "replies": []}, {"body": "We'll rise up, rise like the day, I'll rise up", "score": 4, "replies": [{"body": "WHAT'S YOUR NAME, MAN?!", "score": 2, "replies": [{"body": "I just realized you *weren't* making a Hamilton reference. :/", "score": 2, "replies": []}]}]}, {"body": "We’re good it could be way worse right now. Patience", "score": 6, "replies": [{"body": "True that. Same shit happened yesterday", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It’s so long… when buyers slack, the sellers destroy", "score": 1, "replies": []}, {"body": "I think this is due to the fact that most trades happen in like the first hour", "score": 1, "replies": []}]}, {"body": "Max pain this week is $110. No wonder the market makers won’t let it go past there. Fuck corrupt Wall Street.", "score": 2, "replies": [{"body": "The market is rigged. We are just remoras (also known as suckerfish or whalesuckers) hitching rides on whales. We are all suckers, but we lose when we sell.", "score": 1, "replies": []}]}, {"body": "The stock is going to reverse twice in one day!", "score": 2, "replies": [{"body": "looks like a y=sin(x) graph", "score": 1, "replies": []}, {"body": "multiple times", "score": 1, "replies": []}]}, {"body": "Zero logic. Can anyone tell me why anything happened today?", "score": 2, "replies": [{"body": "Broadcom and AMD flying while NVDA can’t hold morning little pump. Then more semis people are rotating to AVGO and AMD", "score": -4, "replies": [{"body": "That’s until those get dumped for NVDA to up. Cleanse and repeat. Load up", "score": 1, "replies": [{"body": "AVGO pumps nearly 6% today and 2% yesterday after the 10% unfair earnings dump. While NVDA not close to the pre-ER 130s", "score": 0, "replies": [{"body": "Unfair?  NVDAs may have been unfair but AVGO's non AI business is an anchor right now. They had a bad, bad not uninspiring, earnings forecast, I own AVGO and they should be hurting right now, but they are up on the Apple news from yesterday.", "score": 1, "replies": [{"body": "So you are basically saying AVGO had a bad bad earnings and lost 2.6% after ER. And NVDA double beat and raise but lost 18% after ER?", "score": 1, "replies": [{"body": "Mr. Market doesn't always act rational is my point.", "score": 1, "replies": []}]}]}, {"body": "And Oracle is up nearly 11%, what’s your point?", "score": 0, "replies": [{"body": "Good companies rebound well even with unfair earnings or as you are saying, up 11% after an ER beats. While the bad company to invest lost 18% after a double beat and raise.", "score": 1, "replies": [{"body": "AVGO is still down 20% from its all time high in June which is when you say you turned bearish on NVDA? AMD is down 33% since March or 22% since July? NVDA is off 20% as well since June....but I am not seeing any great performance difference between any of them.  NVDA market position and history make me far more comfortable about future performance than the other two stock do.", "score": 1, "replies": []}, {"body": "“Bad company to invest”? How am I up 70% in 4 months then…", "score": 0, "replies": [{"body": "I turned to bearish on NVDA on that 7/11 rugpull.", "score": 1, "replies": [{"body": "It did the same thing in 2023 and then shot up like a rocket in November and January.  NVDA is just reflecting the market,  QQQ is down 5% over the same time period.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The movement looks exactly like a share offering. It’s fucking weird. Constant heavy sell pressure in the morning when there is highest volume.", "score": 2, "replies": [{"body": "It’s weird how some people still think this stock makes any sense. Stop trying to searching for logic!", "score": 2, "replies": []}, {"body": "Jensen selling beats stock buybacks", "score": 1, "replies": []}]}, {"body": "Up, down, sideways?", "score": 3, "replies": [{"body": "Looks like sideways till septembear is over", "score": 3, "replies": [{"body": "Till October is over.....", "score": 0, "replies": [{"body": "At least.. If you're smart sell everything.", "score": -5, "replies": [{"body": "You can take my shares from my cold, dead hands!", "score": 1, "replies": [{"body": "*pulls trigger*", "score": 2, "replies": []}, {"body": "They won't do you any good if you're dead..", "score": -1, "replies": [{"body": "You still not getting them lol", "score": 1, "replies": []}]}]}]}]}]}, {"body": "We know where it's trending.  Today doesn't matter, nor does tomorrow.", "score": 2, "replies": []}]}, {"body": "It's now a meme stock. 30% down on good results. 20% up on interview comments. There's no basis anymore", "score": 1, "replies": []}, {"body": "The pump and dump is immense", "score": 1, "replies": []}, {"body": "Direct train to 110 today", "score": 1, "replies": [{"body": "The most optimistic thing I think I’ve ever seen you say about nvda", "score": 1, "replies": [{"body": "And sadly, that’s a pump fake. I was so confused. And now it’s gone. Back to buying puts.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "The market hasn't bottomed out yet.  Would have been better if it had opened down yesterday and hit the bottom.", "score": 0, "replies": [{"body": "You don’t think $100.95 was the interim bottom?", "score": 1, "replies": [{"body": "I didn't yesterday.  I do now.", "score": 2, "replies": [{"body": "!!!", "score": 1, "replies": []}]}]}]}, {"body": "Look at how Broadcom rebounding from earnings dump. That’s why I’m always bearish on NVDA.", "score": 0, "replies": []}]}
{"title": "Spy puts made my account and NVDA calls will destroy it ", "selftext": "Tldr: basically if NVDA goes down tomorrow, i default on rent and car payments ", "id": "1fdulbb", "created_utc": 1726006738.0, "score": 174, "upvote_ratio": 0.89, "num_comments": 83, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 104 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Brother, never invest more than you can afford to lose.  \n\nIf tomorrow fucks you, please learn from it.  I wish you the best.", "score": 48, "replies": [{"body": "Thats not even an invest, he’s gambling", "score": 13, "replies": [{"body": "Gambling was an investment if you win.  Half joking.", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 9, "replies": [{"body": "Lmao ChatGPT taking care of regards", "score": 1, "replies": []}]}, {"body": "Account is down 10k this year, this aint my first rodeo", "score": 8, "replies": [{"body": "You're right. You never took home a buckle but keep coming back paying the hospital bills", "score": 15, "replies": []}]}, {"body": "He, in fact, did not get fucked tomorrow. Shit should have printed today if he held it", "score": 1, "replies": [{"body": "That’s good.  I it’d still be a good idea to be cautious though.\n\nIf the bets are extreme enough to win or lose your house, that is bad.", "score": 1, "replies": []}]}]}, {"body": "Considering eviction and reposession is on the table, I would really take a MAJOR step back and think about your gambling problem.", "score": 30, "replies": [{"body": "1800 gambling hung up on me after I told them my plays tomorrow", "score": 13, "replies": []}, {"body": "Yeah, normally I might joke something about how 95% of gamblers quit before they hit big, but I draw the line here. He needs to step back and increase his income so he doesn't have a problem with his rent or car note, THEN risk some EXTRA Money on robinhood gambling bullshit.", "score": 6, "replies": []}]}, {"body": "Jesus bro! Rooting for ya.", "score": 33, "replies": [{"body": "I'm also rooting for him. \n\nNot because I care about him.  But I sold some put credit spreads on NVDA so I need it to go up as well.", "score": 19, "replies": [{"body": "😆 I need it to go up too! I got a shitload of put contracts expiring this Friday!", "score": 6, "replies": []}, {"body": "We should be fine brother", "score": 4, "replies": [{"body": "We in this together!", "score": 2, "replies": []}]}]}]}, {"body": "Buy call and puts them you win no matter what", "score": 10, "replies": [{"body": "Its like 2x leverage ![img](emote|t5_2th52|27189)", "score": 2, "replies": [{"body": "You shouldn't even have leverage. That shits not designed for people in your situation.", "score": 2, "replies": []}]}]}, {"body": "I'm praying for a hard nvda rally, my nvdx calls(-99%) expiring 9/20 need it.", "score": 8, "replies": [{"body": "Held my 9/20 nvda 125 calls that were so tasty…. 2 weeks ago…😐", "score": 2, "replies": []}]}, {"body": "Nvda bout to be at $117 by EOW.", "score": 8, "replies": [{"body": "Thats what it looks like. Hopefully it pops so I can buy a 2012 honda civic", "score": 6, "replies": []}, {"body": "Man! I hope so! I got strikes 10 $100, 10 $95, 10 $80 put contracts! Let’s go!!!", "score": 3, "replies": []}]}, {"body": "Oh dear. (*Oh dear*) I think this will do great! Really. And rooting for you, fully. (Have some calls myself, but lower stakes.)", "score": 5, "replies": []}, {"body": "I usually don't care much ..but rooting for you. Nvidia to 114 tomorrow. I have some stock there but that's long term", "score": 9, "replies": [{"body": "Thanks! Hopefully we get a nice green donger tmrw", "score": 2, "replies": [{"body": "You got it!!", "score": 3, "replies": [{"body": "We did it Joe! We did it ![img](emote|t5_2th52|4275)![img](emote|t5_2th52|4276)", "score": 1, "replies": [{"body": "How much you up on your calls? Is it in the money yet?", "score": 1, "replies": []}]}]}]}]}, {"body": "An account for ants", "score": 7, "replies": [{"body": "Yeah but it's his whole account. A 200k loss by someone who makes 3 million a year doesn't mean shit. This is literal Wendy's dumpster territory.", "score": 11, "replies": [{"body": "A tough situation for sure. Yet, when the rent's due, a man's gotta do what a man's gotta do. ![img](emote|t5_2th52|52627)", "score": 1, "replies": []}]}, {"body": "r/antstreetbets", "score": 2, "replies": [{"body": "“0 online” AWARE", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|8883)", "score": 1, "replies": []}]}, {"body": "Not your rent and car.  Jesus. \n\nJust risk what you can afford to lose. If $100 a month doesn't change anything, fuck it throw that $100 in crazy OTM options where you might get lucky and get $5,000 or $10,000. Get those lottery tickets. Don't use your fucking rent or your car. If I was your father, I'd slap you in the head for being so idiotic.", "score": 3, "replies": []}, {"body": "park your car at a friends house tonight before bed", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": [{"body": "Crippling credit card debt is no joke. NVDA must go up!", "score": 3, "replies": []}]}, {"body": "consistent PULL OUT GAME  ON TOP", "score": 2, "replies": [{"body": "Yes but, sometimes I have problems putting it in too though", "score": 4, "replies": []}]}, {"body": "I did the same thing in a week with funds from a payday loan lmao", "score": 2, "replies": [{"body": "Why are we so regarded ![img](emote|t5_2th52|52627)![img](emote|t5_2th52|8883)", "score": 3, "replies": []}, {"body": "Did it work", "score": 1, "replies": []}]}, {"body": "My man stopped holding ![img](emote|t5_2th52|27189)![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Were these itm or otm ?", "score": 1, "replies": []}, {"body": "Spy puts were mostly 0dte otm contracts I would sell within 15-30 minutes. Id just buy when the opportunity presented itself", "score": 1, "replies": [{"body": "Bro take what most of you have and put it in SPLG.", "score": 1, "replies": []}]}, {"body": "https://sh.reddit.com/r/wallstreetbets/comments/1fdw857/nvidias_blackwell_overcomes_delays_as_gb200/ \nYou’re printing tomorrow, congrats!", "score": 1, "replies": [{"body": "Bruh I can’t see this, and my entire portfolio hinges on me seeing this", "score": 1, "replies": [{"body": "My Reddit app is fucked up. This is the article at least:\nhttps://www.trendforce.com/news/2024/09/10/news-nvidias-blackwell-overcomes-delays-as-gb200-reportedly-sets-for-december-mass-production/", "score": 2, "replies": []}]}]}, {"body": "I knew I should’ve sold my NVDA calls today", "score": 1, "replies": [{"body": "We shall see brother", "score": 1, "replies": [{"body": "🤑 just sold", "score": 1, "replies": [{"body": "Nvda calls did not destroy me. I have set up a time to look at this nice honda civic and I payed off my credit card debt entirely. Thanks wsb 🫡", "score": 5, "replies": [{"body": "Bless 🙏🏽", "score": 1, "replies": []}, {"body": "Post gains bro", "score": 1, "replies": []}]}]}]}]}, {"body": "Dam I was hopeful nvidia goes up with my calls but now because of this post we’re F", "score": 1, "replies": []}, {"body": "GL, I’ll sacrifice my puts for your benefit tomorrow but only if you gamble more responsibly next time", "score": 1, "replies": [{"body": "After tonight I think your puts are safe![img](emote|t5_2th52|31226)", "score": 1, "replies": [{"body": "Nothing is safe in this market, tomorrow at 8:30 will be a much better indicator. Too many times I’ve been burned watching overnight swinging in my favor to be smoked by 9:30", "score": 2, "replies": []}, {"body": "Nothing makes sense in this market", "score": 1, "replies": []}]}]}, {"body": "I did the opposite. NVDA puts from $115 and SPY calls to $543 last week.", "score": 1, "replies": []}, {"body": "Why not continue trading SPY puts when you looked kinda successful doing it?", "score": 1, "replies": []}, {"body": "https://preview.redd.it/rjnz1q4xd5od1.jpeg?width=1179&format=pjpg&auto=webp&s=db6a63d05dc6f65bc508a191fab811a6bc80e5b6\n\nThere’s only room for one of us in this here town, and I’m Dirty Dan.", "score": 1, "replies": []}, {"body": "As others have said before me, but it is worth compounding the point, never invest money you need, or are relying upon. This is not even bad practice, but absolutely the most financially irresponsible and moronic thing you can do. \n\nNot to say that you are not even investing, you are straight up gambling...", "score": 1, "replies": []}, {"body": "You better hope the transition to pre market to open market doesn’t kill todays performance", "score": 1, "replies": []}, {"body": "I don't understand why you invested in NVDA if you already had good results with Spy.", "score": 1, "replies": []}, {"body": "Welp, congrats. I saw this post yesterday and actually wanted to see how it went so just checked Nvidia lol", "score": 1, "replies": []}, {"body": "Update?", "score": 1, "replies": [{"body": "Sold +200% 5k profit", "score": 4, "replies": [{"body": "You should really take some money out and put it into savings/index funds and start fresh with how much money you originally started the account with before you potentially lose a lot", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "DJT saving the day?", "score": 1, "replies": []}]}]}
