{"title": "Leveraged Index Fund ETFs", "selftext": "[removed]", "id": "bkrxwy", "created_utc": 1557017389.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 25, "comments": [{"body": "i also think there’s nothing wrong with leverage ETF when the market is bullish. i remember Warren Buffett said all you need is to believe in the American economy and buy S&P500 in the 60s. by now you are probably a millionaire. \n\nIf the market is constantly moving up, there is no reason not to buy the index. the only problem for leverage ETF is when the market hit recession. you will definitely end up losing money compare to regular ETF due to the decay. the chart shows it.", "score": 4, "replies": []}, {"body": "Leveraged positions aren’t good if you want a “set it and forget it” investment. When they lose, they lose even harder than when they win.\n\nYou have the right idea with rebalancing your leverage %. The trick is successfully minimizing your losses by reducing your leverage in times of uncertainty. Surprises happen.", "score": 1, "replies": []}, {"body": "I only half ass looked at your math, but it seems you looked at monthly changes instead of daily. I think the fact that they recalibrate daily and can miss after market fluctuations makes it even harder to calibrate a model of your returns.  This is a huge problem with the math because with leverage daily losses matter a ton.  I think you can find people who did the daily math and it performs worse than the underlying index long term.  However, I feel like there was some optimal amount mathematically and it was <10% of your portfolio. But that means there is some merit to the investment. I'll go try to hunt the article or post about it and edit it in if I find it.\n\nEdit: I'd also swear on article I read pointed out that in general investing with margin is cheaper than daily rebalancing fees of leveraged ETFs.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Ah, well fair enough.  I may have to actually look at your math.  :)", "score": 1, "replies": []}]}]}, {"body": "People often ask about market tops. This kind of post is a marker. Someone relatively intelligent, convinces themselves to do something foolish with data from a bull market.\n\nIf five years in, there is a 25 percent down year, and loss of job, the account is basically wiped out after the 80 percent loss. That's the significant downside. Worse is if happens later. Those kind of down years are near certain and sometimes occur back to back.", "score": 1, "replies": []}, {"body": "I keep hoping for someone to come out with a leveraged, low beta ETF.  Personally, I'm coming around to the idea that this may be the way to go over a very long time horizon.  I haven't looked as closely as you but it seems, in general, the leveraged ETFs more than make up for the extra fees and decay.  I don't know though, still researching.", "score": 1, "replies": []}, {"body": "All the index has to do is go down 33% during a bear market and if you hold a 3x leveraged etf, it’s dead. The market could bounce up 50% next year and you’re still dead.", "score": 1, "replies": []}, {"body": "Learn options and buy long in a company you believe in.\n\nBeing young is the time for risk.", "score": 1, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "\"I don't think there's any reason to believe that any particular company will give me better EV\"\n\nWhy do you think so? There are many examples of investors that outperformed the S&P 500 in the scale of decades. One famous example: \"Through his firm Gotham Capital, Greenblatt presided over an annualized return of 40% from 1985 to 2006.\" \n\nI never heard of any big Investors that got wealthy via leveraged ETFs. I would ask myself: If leveraged ETFs are a good opportunity to generate wealth, why couldn't I find a single Investor who has been very successfull in doing so.", "score": 1, "replies": [{"body": "Aren’t ETFs, especially leveraged ones, relatively new as a vehicle? That would explain it. I think the OP agrees that he won’t be able to reliably pick a single company; he’d rather diffuse the exposure across the market as a whole.", "score": 1, "replies": [{"body": "Well I can find articles from 2011 http://www.calculatinginvestor.com/2011/04/29/geometric-vs-arithmetic/ and 2009, where it says: \"Over the past several years .. one particularly interesting type of ETF is the leveraged ETF\". So it's definitely exist more than a decade. And the math has already been done, OP is not the first one. So my question then would be, where are the track record proven leveraged ETF success stories from the current decade?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "If the sample size is big enough, than you are likely to find a few investors that got lucky. I would like to hear from them, why they picked a certain leveraged ETF ten years ago and how it worked out so far for them. Maybe there's one on this sub, who could share his experience with leveraged ETFs over the long run (say 5+ years).", "score": 1, "replies": []}, {"body": "That took ten years. I traded myself and gained 800% last year.\n\nDifference is buy and forget or actively seek opportunity.\n\nDont go full WSB but they can teach you all the ways not the do it.", "score": 1, "replies": []}]}, {"body": "I think of anything from the last 20 years as relatively new (as far as financial instruments go). I don’t think anyone s getting rich in a decade investing in any ETF. I see that as a 40 year play.", "score": 1, "replies": [{"body": "Hmm what kind of strategies don't work on the scale of a decade, but on the scale of four decades? If I couldn't make good percentages in 10 years, then I doubt that I could in 40 years.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Let's say I don't need the money and let it on the table. It's not good over 10 years, but good over 40? Sounds strange to me.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "The Art of Making a Deal — Trump’s Trade War", "selftext": "[deleted]", "id": "bkzkuz", "created_utc": 1557073025.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 21, "comments": [{"body": "Damn... hold on to yer horses...  🐴 🤠", "score": 10, "replies": [{"body": "I got the horses in the back...", "score": 5, "replies": [{"body": "Horse tack is attached", "score": 1, "replies": []}]}]}, {"body": "Sh*t", "score": 5, "replies": []}, {"body": "Elon Musk - $420 funding secured.  \nTrump - Hold my beer", "score": 3, "replies": []}, {"body": "Stop panic!!! This is helping to make a deal happen before friday", "score": 2, "replies": []}, {"body": "I keep getting the impression that this economy keeps doing what it's doing in spite of him more than because of him.", "score": 1, "replies": [{"body": "Here’s how I see it: I think Trump’s election provided an impetus for investors to believe that there would be a strong economy under his tax cut policy. Given this trajectory, I think the expectations were already set high and we’re living up to them, regardless of Trump. But it’s hard to deny that he isn’t completely independent of the economic growth.", "score": 1, "replies": [{"body": "He's done so many incredibly dumb things just in this trade war alone that I'm shocked we're in the position we're in.", "score": 3, "replies": [{"body": "Completely with you on that", "score": 2, "replies": []}, {"body": "Hes done a great job in terms of deregulation and improving business laws.", "score": -7, "replies": [{"body": "Name some.", "score": 3, "replies": [{"body": "The biggest thing that's helped us (in family small business) is the depreciation rules change. Were allowed to depreciate assets at a much higher rate now, which ultimately leads to lower tax expense.\n\nMassive deregulation came from when he rolled back a lot of the regulations Obama put in place. Obama's regulations crippled businesses because it was too much money to comply with them. Then the tax cuts were huge too. Hes done a great job man. Doesnt get enough credit.", "score": 2, "replies": [{"body": "Can confirm the new tax laws have helped my small business. I’ve actually hired more help this year.", "score": 9, "replies": []}, {"body": ">The biggest thing that's helped us (in family small business) is the depreciation rules change. Were allowed to depreciate assets at a much higher rate now, which ultimately leads to lower tax expense.\n>\n>Massive deregulation came from when he rolled back a lot of the regulations Obama put in place. Obama's regulations crippled businesses because it was too much money to comply with them. Then the tax cuts were huge too. Hes done a great job man. Doesnt get enough credit.\n\nOk those are some nice examples, thanks for your input. Here is a list of things people didn't like so much in which he offended or outright lied or both.\n\nhttps://www.mcsweeneys.net/articles/atrocities-1-to-112", "score": -2, "replies": []}, {"body": "Which regulations did he get rid of that helped you? I hope they werent safety/environment related...", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "So.... Is this bad for $MU ??", "score": 1, "replies": [{"body": "Yes. Overall long term I think it evens out.\n\nShort term you will see a lot of fearful shorting for mlst companies that are in anyway involved with China.\n\nEdit: I would buy it after it falls below $30.", "score": 1, "replies": [{"body": "Yeah, I aint really too bothered. The companys financials are rock-solid. Tariffs or not, people will still be needing memory in the years to come. \n\nAlso when a trade-agreement is finally reached, its bound to react positively (i hope), especially if any agreement has some ramifications for chinese theft of IP. \n\n*Bagholding quite alot with avg price of 38.x*", "score": 1, "replies": []}]}]}, {"body": "Funny seeing people panic on his every word\n\n\nLike get a life", "score": 1, "replies": []}, {"body": "Wait until Friday. Don’t panic just yet.", "score": 1, "replies": []}]}
{"title": "one person is buying 3 millions worth of teslas call option. cool or fool move? and why?", "selftext": "source:  [https://www.cnbc.com/video/2019/05/02/one-options-trader-just-bet-3-million-that-tesla-shares-are-about-to-rev-up.html](https://www.cnbc.com/video/2019/05/02/one-options-trader-just-bet-3-million-that-tesla-shares-are-about-to-rev-up.html)", "id": "bl3fxg", "created_utc": 1557092493.0, "score": 3, "upvote_ratio": 0.71, "num_comments": 27, "comments": [{"body": "It's most likely a hedge on a short position that is already profitable.", "score": 8, "replies": [{"body": "Yes!", "score": 3, "replies": []}, {"body": "Can u check the price of fb?", "score": -13, "replies": []}]}, {"body": "Well, they are double that price now. Don't think a $3M +100%+ gain needs explanation.", "score": 7, "replies": [{"body": "So u think that the stock will go up?", "score": -3, "replies": [{"body": "I think you are too late.", "score": 7, "replies": [{"body": "TSLA nearly $255 now.", "score": 3, "replies": [{"body": "Its hundred off highs \n\nBuy", "score": 0, "replies": [{"body": "Doesn't mean it's going back to highs. Enron way off highs. Sears way off highs. I love Tesla too. I became bearish back in December. Doubt they'll make if through another recession. Otherwise, I would agree.", "score": 2, "replies": [{"body": "I was bearish for years until this capital raise\n\nBuy and ignore fudders\n\nEnron?? Wtf man", "score": 0, "replies": []}]}, {"body": "They would not make it through a recession in current state. If recession happens after they are consistently profitable for quite a few years and have all their factories built and programs rolled out, sure, buy away. They don't though. They're just scrapping buy based on nothing but projections. Not gonna raise $2 billion to make it through another quarter in a week in a recession.", "score": 0, "replies": [{"body": "Buy\n\nIgnore fudders\n\nWall st bought the capital raise with ease\n\n\nShorting idiots will be gone fudding soon", "score": 1, "replies": []}]}]}, {"body": "Can u tell me the price of fb stock then?", "score": -4, "replies": [{"body": "Google 'Facebook Stock' and there you go", "score": 4, "replies": []}]}, {"body": "Send me source and send be a pic FB too?", "score": -8, "replies": []}]}, {"body": "The price is at 250", "score": 2, "replies": [{"body": "It's at $255. Your picture is from 5/2 around noon when TSLA was about $240.", "score": 2, "replies": []}]}]}]}]}, {"body": "Why tf is this post gilded 😂", "score": 4, "replies": []}, {"body": "They already won. The stock moved almost 5% the day after their \"bet\" and again, the next day.\n\n&#x200B;\n\nI will not be surprised to see the stock go on a bit of a tear from here. Successful capital raise, second raise since the markets were happy to throw more money at Tesla, plus the full extent of the arrangement with Fiat re: emissions credits... have been revealed.", "score": 3, "replies": [{"body": "Wouldnt doubt 350 in weeks", "score": 2, "replies": []}]}, {"body": "still remember there is one dude placing a 7 million dollars bet on FB to hit 270 by 2020\n\n[https://www.cnbc.com/2018/09/06/trader-makes-7-million-bet-facebook-will-surge-more-than-60-percent.html](https://www.cnbc.com/2018/09/06/trader-makes-7-million-bet-facebook-will-surge-more-than-60-percent.html)", "score": 2, "replies": []}, {"body": "Gunning for $420", "score": 4, "replies": [{"body": "And bashers bashing whole way up", "score": 1, "replies": []}]}, {"body": "The move already happened.", "score": 1, "replies": []}, {"body": "If 3 mil is about 1% of his liquid assets then it's a reasonable risk to take. It gets progressively more foolish if he's poorer than that.\n\nJust curious however how do you know this? Unless it's yourself, people with this kind of money rarely share this sort of info about themselves.", "score": 1, "replies": []}, {"body": "Tons of bashers,tons of shorts in this.\n\nTsla one of the few interesting growth stocks \n\n\n\nBuy", "score": 1, "replies": []}, {"body": "How do you know it was one person?\n\nHow do you know that they bought the options? Couldn't they have placed a $3 million sell order? Like covered calls or something?\n\nHow do you know it wasn't a hedge for short position?", "score": 1, "replies": []}]}
{"title": "$AMZN", "selftext": "[deleted]", "id": "bkrp8x", "created_utc": 1557015837.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 19, "comments": [{"body": ">  Historically management starts selling more and more shares when the price reaches to the point it is now.\n\nApproaching ATH unprecedented before Sept '18?\n\n\n> AMZN fluctuates 5% around 2K mark in September\n\n[STRONG CORRELATION: UNATTRACTIVE TO INVESTORS](https://i.ytimg.com/vi/ghrdSTC66MA/hqdefault.jpg)", "score": 8, "replies": []}, {"body": "Laughs in Warren Buffett", "score": 7, "replies": []}, {"body": "Wtf is this trash. Mods ban this autist", "score": 11, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol gtfo you predicted the trade war tweet? You’re delusional", "score": 0, "replies": []}]}]}, {"body": "You should write a book", "score": 5, "replies": [{"body": "how to get addicted to adderall by jimmy\\_bags", "score": 12, "replies": [{"body": "Your not wrong though", "score": -4, "replies": []}]}]}, {"body": "Already BTFD just after open Friday and sold near the top for a 3 bagger. If I wasn't a 1 contract pleeb I would still be farming the karma from a 100 contract play.", "score": -1, "replies": [{"body": "what does this \"karma\" get you? I don't understand why young people give a fuck about this shit", "score": 3, "replies": [{"body": "I thought you could cash this shit in for hookers and blow? Whadaya mean?\n\n&#x200B;\n\nFor the record, that bit was tongue in cheek. I've a total of 101 of the worthless shits and could care less if I gain or lose.", "score": 1, "replies": []}]}]}, {"body": "It’s also a growth stock, that doesn’t pay a dividend.  Soo what happens when there’s no room to grow?  Does the stock drop or does it do a split to start the cycle anew?  Does it start a dividend?", "score": -6, "replies": [{"body": "> does it do a split to start the cycle anew?\n\nlol wut?", "score": 3, "replies": [{"body": "Paper industry in the 70s-80s had multiple 2/1 splits to keep the share prices at a lower entry point.  Although they had dividends as well, the stock for example Wausau Papers would split when it would hit $100 price point.  The 401k plans at the time were basically company stock.\n\nIf AMZN would split 1 for 2 price opens at $975, new investors would scoop up blocks of 100.  Some who would not buy at the $1950 price.", "score": 1, "replies": [{"body": "ok so a way to sucker in stupid retail money. there's a reason brk a never split.", "score": 1, "replies": [{"body": "I’m truly curious what reasoning you use to compare BRK.A to AMZN.  Two companies with completely different methods of obtaining revenue.", "score": 1, "replies": [{"body": "we're talking about splits. read up on why buffett has talked about why he never split the A shares", "score": 1, "replies": [{"body": "There’s also no options chains.  AMZN does have options, though, investors with shares divisible by 100 could benefit from being able to write more options.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'd assume they would split most likely, the dividend would have to be huge to make investors buy at that price. Market cap is almost a trillion dollars. People who are making calls for $2k and 2100$ are seriously risking some neck. If anything that shit will drop. Wouldn't shock me if bezos came in and sold his usual 38$mil in shares to keep everyone calm and prevent a split/ severely overbought situation.", "score": -5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Apparently just now.", "score": 1, "replies": []}]}]}]}]}
{"title": "View: All Systems Go Non-Apple Devices Services Ecosystem, or GoNADES, or Why I'm Super Bullish on Apple", "selftext": "I'm going to put my price target for 2020 right here at the top to shock you and to spark some shitposting. \n\nPrice target: $450 EOY 202)\n\nApple isn't failing. Stop with your humdrum, never read any business news, don't know a thing about tech whining. \n\nFor a long time, Apple was a hardware company mostly. It had software, which was an operating system that was installed on the Macintosh computer. Over time, innovators like Steve Jobs helped the company create the iPod, the iPod Touch, the iPhone, etc. Along with that came a \"services\" ecosystem. These are softwares that are not just the operating systems of the devices, but things that run on them, Software as a Service. or SAAS, I think it's called. These are things like Apple Music, iTunes, Maps, facemojis or whatever that's called, the watch OS, autonomous tech, SIRI, and stuff like that.\n\nWhat's happening with Apple is that they are at peak mobile technology. They have realised that you can make mo re mobile phones, but if you did, you would ruin the Apple brand name, because you would be forced to make compromises on performance and design.\n\nInstead, you start making a lot of peripherals that use SAAS, and then -- AND THIS IS THE MOST IMPORTANT PART THAT PEOPLE FORGET -- you start pushing your software services on to non-Apple devices.\n\nSo, basically Apple is taking its vertical integrated software and hardware silo and while it is innovating within this silo in Apple's ecosystem, it is now pushing that software / services out into other devices, like Android devices.\n\nYou have about 4 million paying apple music subscribers on Android devices, and about 40 million Android devices right now that have some form of Apple music on them, but they are not subscribers.\n\nSo, if you think about it, Apple stands to make a huge amount of profit from having its systems on other devices, and that is why, in my view, they are trying to bill themselves as a services company.\n\nThey are administering and delivering a Software as a service to the non-Apple ecosystem.\n\nWith this are also moonshots like autonomous driving software and cars, etc. You may see them make more acquisitions here.\n\nI have bought tonnes of Apple stock on weakness and this cynical belief that somehow Apple is failing. And I think people are going to be surprised. People are way too focused on the first generation of apple as an exclusive hardware brand and not at all knowledgeable about their innovations in software design and innovations in AR, etc.", "id": "bktbvm", "created_utc": 1557026969.0, "score": 21, "upvote_ratio": 0.81, "num_comments": 28, "comments": [{"body": "I just came here to laugh at GoNADES because it sounds like gonads.", "score": 20, "replies": [{"body": "Thank you.", "score": 6, "replies": []}]}, {"body": "Ok so they get a higher PE ratio on the service revenue the half of revenues iPhone business still get the hardware PE ratio for now. \n\nAlso I think your wrong about the adoption of Apple services on non Apple devices. The biggest growth driver for the services is the Apple customer base. With a click of a button they can allow iPhone users to try apple arcade, apple tv, apple news or Apple music with a click of a notification. You can't do that on other devices. Apple users are usually 90% apple products, meaning they have the phone, Mac, headphones, watch, use the services but maybe use a few other apps like Spotify or Netflix.", "score": 15, "replies": [{"body": "They’re so good at trapping you. \n\nWhen I had an Android I didn’t care whether I used a Roku, Chromecast, amazon fire stick or Apple TV. I just cared about the price.\n\nNow that I’ve bought an iPhone, I really want n Apple TV. It’s just way better experience than the other devices when you have an iPhone. \n\nSame with android and Spotify, google play music etc. Didn’t really matter to me. Now with Apple Music on an iPhone.....\n\nYou just feel trapped with them.", "score": 2, "replies": []}]}, {"body": "A price target of 420.69 would have gotten more upvotes.", "score": 9, "replies": [{"body": "Thought about that. But want to leave room for surprise when it happens. Makes the people feel good.", "score": 3, "replies": []}]}, {"body": "You’re price target is a tad too high. At 450 would make them a $2trillion company. Not saying it’s impossible, but highly improbable, how are they going to double in size in a year?\n\nRegarding the autonomous car space, I can’t see them getting into that space, doesn’t make business sense.", "score": 6, "replies": [{"body": "They will buy google.", "score": -8, "replies": [{"body": "Companies don’t just buy a majority stake in a company like *that* it’ll go under review by the SEC and probably get denied. You have to remember that these are 2 of the 3 largest players on the American phone market. The SEC wouldn’t allow so much to go through", "score": 4, "replies": [{"body": "Then they will buy Huawei.", "score": -6, "replies": [{"body": "Why\n\nCompanies don’t buy shit for no reason", "score": 2, "replies": [{"body": "No. Huawei.", "score": -4, "replies": [{"body": "If a company is buying random companies without a formal structure for implementation in the next few years it leads to vast uncertainty in the management of a company. This would likely show a decline in insider trading. \n\nAnyone who knows anything about stocks knows what happens when banks, and people, aren’t certain about their investment.\n\n   Don’t take it from me, just throw a put down for $450, I’m sure you’ll have fun", "score": 1, "replies": [{"body": "Puts it is.", "score": 3, "replies": [{"body": "Autist", "score": 3, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Won't it drop because of the repairs on MacBook pros? About half of them are broken, and the repairs are costly as fuck. I had mine fixed in October, and the replaced not only my keyboard but also the entire topcase, and then because they noticed scratches in my screen they also replaced that even though I didn't even ask for it. So I effectively have a new laptop all on Apples dime. The guy in the shop said he had some customers come in 3 times with the same defect. I know if my keyboard starts acting up again I'll be bringing it in.\n\nApple is definitely noticing it, because apparently instead of having the keyboard repairs sent out to repair centers they are now training their in store staff to do it. I bet my shenanigans cost them well over $1000, which will be more than their profit margin.", "score": 2, "replies": [{"body": "How could they drop if the repairs are “costly as fuck.”", "score": 1, "replies": [{"body": "Costly as fuck to them. They pay the repair center, I don't pay anything. And I didn't pay for apple care either.", "score": 3, "replies": [{"body": "Well price target $87 then. Clearly they are going bankrupt.", "score": 2, "replies": [{"body": "If they're going bankrupt, wouldn't the price target be $0? But no.. mac revenue is 8%, so I guess the max hit it would take from this is like 4% or something..", "score": 1, "replies": []}]}]}]}]}, {"body": "On the note of 4 million paying android subscribers.\n\nIf you look closely at how the statistics of those stats place their requirements as to what a “paying subscriber” is, a despairingly large portion of android subscribers simply are attached to a family plan.\n\n    I think what’s largely happening is that people are purchasing Apple Music as a family, and sharing it cross-platform to family members who hold androids.", "score": 2, "replies": [{"body": "Great information 👍", "score": 2, "replies": []}]}, {"body": "The fuck are you talking about? None of the products you mention are even remotely SaaS. I know this is WSB and our DD is *supposed* to be grossly misinformed, but good god. My only rational explanation is that this must be trolling.", "score": 2, "replies": []}, {"body": "This is lame ass DD even for WSB.\n\nAlso, another trillion dollar market cap in just one year\n\nRetards Galore", "score": 2, "replies": [{"body": "Retarded Gonads.", "score": 1, "replies": []}]}, {"body": "TIL people still “pay” for music.", "score": 0, "replies": [{"body": "Are you a time traveler from 1999", "score": 5, "replies": []}, {"body": "Yes they do.", "score": 5, "replies": []}]}]}
