{"title": "Bear Credit Spread on AAPL", "selftext": "[removed]", "id": "qy57pv", "created_utc": 1637413532.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 52, "comments": [{"body": "What do you mean this run up didn’t make any sense, Bloomberg  literally reported that Apple will have a fully autonomous car by 2025", "score": 12, "replies": [{"body": "The news came out of nowhere.  I bought puts thinking it was going back to 147 after it hung out at 152 for a few days like it has been.\n\nI sold once it broke 155.", "score": 2, "replies": [{"body": "To be honest, my thinking about Apple is to only buy long bullish calls, nothing else at all because no matter what AAPL is one of those stocks that is literally only going up.\n\nUnless you only got good insider info never buy puts on apple and also in cases like the pandemic mini-crash where it was logical that stocks will go down or in case of a clear bubble that is about to pop (but this is more tricky as its not recurring very often)", "score": 4, "replies": [{"body": "Agreed. Apple is essentially going to go straight up for the next decade. Trying to time short term puts seems way too risky to me.", "score": 3, "replies": []}]}, {"body": "Out of nowhere, as in, perfectly timed right in the middle of an EV bubble?", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "2025 isn't that far away. More importantly, it means to have a fully autonomous car ready by 2025 they are working on it NOW. This means Apple is already in development and therefore gaining valuable ground. Applying for patents on ev tech alone creates value.\n\nIf you can't understand how this news would affect stock price then perhaps trading isn't for you.", "score": 5, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "You also need to work on your reading comprehension lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Trade small, trade often. Use longer exp so you more time to be right", "score": 6, "replies": [{"body": "yep to both comments...\n\nhave a look at the Op Int in Jan 2022", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Username does NOT check out", "score": 3, "replies": []}]}]}]}, {"body": "How was this a safe play when you opened it?\n\nYou were greedy and got burned.  You are most likely facing max loss by expiration.\n\nIf you get lucky on any pullback on Monday (and it's a short week because of Thanksgiving) close the position and take the loss.\n\nA \"safe\" bear call spread would have been out of the money at 0.1 delta for the short leg.  But the premium for those type of verticals is tiny, which is why you went for the fat premium with an in the money short call.", "score": 6, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Your thesis was very wrong. Take the L and don’t bet against Tim Apple", "score": 2, "replies": []}, {"body": "Boohoo it doesn’t make any sense!  😂", "score": 1, "replies": []}]}]}, {"body": "The hardest thing to do when trading options is to escape from a call spread that you sold when the stock goes against you and goes up quickly. The reason for this is because the implied volatility of AAPL is dropping while it’s price is rising. And so, if you want to roll this spread out to mid December to buy yourself some time, you aren’t gonna get any credit for it, in fact at this point it’ll cost you more money as both legs are ITM and the one you own is ATM giving it the most extrinsic value possible. \n\nWhat’s it worth right now, like $18.50? You sold it for almost $10. Tough call, I would say see what happens Monday morning. If you get lucky and get a drop in AAPL to like 157, you can probably buy it back for maybe $15, or you could more cheaply roll it to December at that point. But it we are green on Monday and AAPL goes to 162 in premarket I’d say put in a limit order at $18.50 right at the open and hope you get filled. Take the $850 loss and move on to the next trade", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I think you mixed those up, you sold the 140 call for $10 last week now it’s $20. You bought the 160 call for 14 cents now it’s $2.34. \n\nSo yeah, you can buy the spread back for like $17.66 hopefully Monday morning and you’ll realize the $3500 loss, or roll them out to December. You could consider rolling them up too to like 145/165 spread: but that’ll cost you even more. \n\nIf I were you I’d hope for red on Monday, but if I didn’t get it I’d cut my losses and go back to the lab for the next idea", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Ooof, 5 contracts…yeah, that’s a pickle you’re in. My guess is if you roll it out two weeks it’ll cost you another $3-$4, you’re break even will become 145ish. But honestly, I don’t see AAPL dropping 10% (160 to 145) in two weeks, especially at this time of year. \n\nGood luck!", "score": 1, "replies": []}]}]}, {"body": "Go with a dragon tail put chain. Increase your allocation as you move down the chain. \n\nThe other option would be a long call butterfly straddle. \n\nGood luck.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "That's the idea! It is a figment of options trading. Look at all the strange names that are used. Heck, Vega isn't even a Greek letter, but it was the name of a car at one time.", "score": 1, "replies": []}]}, {"body": "How does a dragon tail work? Couldnt find anything online", "score": 1, "replies": [{"body": "No idea. I just make sh!t up.", "score": 5, "replies": []}]}]}, {"body": "The only thing holding up the entire market is FAANG, why would you step out in front of a freight train with such a weak thesis. Hope for a red monday.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Just one of the most cash rich, profitable, and successful companies on earth. Investors obviously see long term value. How long have you been playing apple? It’s done nothing but go up for 10+ years. Just the announcement of a new product line is enough at this point.", "score": 1, "replies": []}, {"body": "Relevant tweet: https://twitter.com/xtrends/status/1462064524236840962?s=10", "score": 1, "replies": []}]}]}, {"body": "Yeah apple has like some of the highest bull call volume right now. I’d be careful, those Chinese love buying up our robust stocks at the top to hedge their shit slave labor manufacturing economy", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Confirmation that Apple is getting in the game. A very lucrative game. The patents alone on EV tech has immense value.\n\nAlso, Rivian does have prototypes. With that said, they would be a better candidate to short than Apple lol.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Apple hinted at EV investment last year, but specifics were never made. This time they gave a year (2025). This suggests to investors that they are currently involved in development. It's more than just words.\n\nThere are certain companies I would never short because they are so popular and any little optimistic news drives their share price up. AAPL is one of those companies. You took a big gamble, in my opinion.", "score": 1, "replies": []}]}]}]}]}, {"body": "Even the sub that shall not be mentioned knows that rule número uno is to never bet against 🍎", "score": 2, "replies": []}, {"body": "OP, here are some thoughts, and of course, don’t take advice from some guy on Reddit. \n\nI am putting my kids through college selling credit spreads and here are some basic rules I follow. \n\nThe overall market is bullish. Therefore, I am very hesitant to sell bear call spreads on any underlying. I not saying I never do, but I need to have no doubt the underlying is in a downtrend. I look for a convincing MACD crossover and RSI crossing down through 70. And even then I might pass. For example, ROKU is down, but in this bull market, I’m not selling call spreads it. \n\nI sell the spread starting at around .09 OTM. If the IV is high, I go even farther out. Premiums are small, but I’m okay with that. I sell 25-35 DTE and I consistently close in under 14 days with a 65% profit. Occasionally there are losses, which wipe out a number of wins, but  losses are rare and I make money. \n\nAll the best.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I have tried others but credit spreads is what works for me. Probably 90% are credit puts and 10% credit calls. For me, and I’m not making recommendations, the Russell 2000 index, RUT, is my go-to. That being said, it’s letting off some steam right now and I will likely sell put spreads on RUT in a week or so.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I do trade individual stock options, but not as much as indexes and ETFs. And, I try to stick to big name companies like GOOG and AAPL; no meme stocks for me. For CCs, there’s a good, short book, “Beginners Guide to Covered Calls” by Freeman Publications. Get it on Amazon. It has very solid advice.", "score": 2, "replies": []}]}]}]}]}, {"body": "I was tracking they are not doing many major projects, outside of their autonomous car, so they were going to start massively doing share buybacks which has started me to get more interested in buying AAPL over MSFT recently.", "score": 1, "replies": [{"body": "Did msft ever do that 60b buyback they announced in September?", "score": 2, "replies": [{"body": "Last I’ve heard was they don’t have a timetable.  I’m certain it will be next year.  Honestly, I had forgotten about their board approving the buyback so thanks for the reminder.", "score": 1, "replies": []}]}]}, {"body": "AAPL hot right now with ev announcement will probably stay that way till earnings", "score": 1, "replies": []}]}
{"title": "Car company or tech company? Tesla drivers left unable to start their cars after app outage", "selftext": "", "id": "qyd1y0", "created_utc": 1637437194.0, "score": 157, "upvote_ratio": 0.76, "num_comments": 55, "comments": [{"body": "Share price shoots up 15% following day", "score": 79, "replies": [{"body": "Hopefully not that’s fucked up if bad news drives it up", "score": -1, "replies": [{"body": "Tesla stock has been irrational for a minute", "score": 8, "replies": []}]}]}, {"body": "Don’t believe everything you read online. I used my car during the “outage” normally. Apparently you couldn’t access the app but that doesn’t mean you couldn’t use the car. You basically had all the functionalities that non teslas have.", "score": 29, "replies": [{"body": "Yes this article was pretty lacking in actual substance.  Your phone key still worked, the only thing that was down was remote controls of the car.  The only potential issue is someone who let someone else drive their car and said I’ll remote unlock/start it for you. Or if your app was corrupted and needed reinstall you couldn’t repair your phone to the car, in that case you should still have your card key.  Both situations pretty rare.  Was it annoying if you wanted to preheat your car, sure. Did it really matter, no.  These articles read like there was a million bricked Teslas.", "score": 7, "replies": []}]}, {"body": "Your puts are fucked bro. Give it up.", "score": 38, "replies": [{"body": "I do agree with one part of that; most of the people trading options are probably dude-bros.", "score": -34, "replies": [{"body": "Ok lol", "score": 15, "replies": []}]}]}, {"body": "I don’t own Tesla and don’t really care which way the price goes. But most of these articles are borderline defamatory. \n\nEvery Tesla comes with a FOB. Owners also have the additional choice to use the Tesla app to start their vehicle. Tesla themselves recommends against relying solely on the app due to potential software bugs (as we see now). But also other unforeseen issues like your phone being stolen, running out of battery, having bad reception, etc.", "score": 85, "replies": [{"body": "Every Tesla does not come with a fob. You have to buy it separately. Every Tesla comes with a key card. Most people don't use it because the phone is the key. I bought a fob for stuff like this. It's just a bad situation to be in either way. It's an article... Tesla not going to sell less cars because of this :D", "score": 28, "replies": [{"body": "Fob is basically the same thing as a keycard, except it fits in your wallet. Same function, different form", "score": 3, "replies": [{"body": "The fob works on proximity as the phone does. The key requires you to physically unlock the car and then physically turn it on. If you own one it's a minor inconvenience but still relevant. I don't like the key card. Our other car is not a Tesla but the key fob does everything to the car. Our input is limited. Seems silly but it you're paying 60+ for a car i think a fob should be standard... The key card was not my favorite thing to be honest.\n\nWhen we lived in NYC the garage guys hated the key card. It was confusing if they had not dealt with it before. Very specific positions to just open the vehicle.", "score": 1, "replies": []}]}]}, {"body": "THIS article is not borderline defamatory.", "score": 6, "replies": []}, {"body": "I don't have any positions on them either, and your own comment is clearly defamatory against the BBC. You're basically accusing them of fake news.\n\nNot because it didn't happen, but because you blame the vehicle owner. And yet, the story doesn't cast blame. If, as you say, they also get a FOB, and they got locked out anyway because they were conditioned to use an app instead, then it is just a \"grandpa forgot his email password\" type of story. But still a real thing that happened.", "score": -125, "replies": [{"body": "“Grandpa forgot you can start the car with a fob”\n\n\n“Humans left unable to feed themselves because phone died and Apple Wallet was unavailable” credit card / cash was left at home.", "score": 14, "replies": []}, {"body": "[deleted]", "score": 35, "replies": [{"body": "She’s right.  Focus.", "score": -7, "replies": []}]}, {"body": "[removed]", "score": 17, "replies": [{"body": "Yea what a retard", "score": 8, "replies": []}]}, {"body": "Wtf lol", "score": 3, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Disagree.", "score": -2, "replies": []}]}, {"body": "Retard!", "score": 8, "replies": []}, {"body": "The article is even more dishonest or misinformed then suggested because the phone app did work as long as you had set it up as a key before hand. \n\nThe only people who would of been locked out were ones who normally use the fob and today decided they wanted to use their phone but couldn't connect to set it up.", "score": 3, "replies": []}, {"body": "Found the author", "score": 4, "replies": []}, {"body": "The article obviously didn’t give you the correct information. That’s the problem with some Tesla coverage.  The app still worked, your phone key is a bluetooth connection from phone to car.  What was down was the remote server side controls.  So if I walked up to my car it still unlocked and worked.  If I was on the other side of the house and wanted to preheat my car it couldn’t connect to the car. It was the same affect if ATT cell service was down, or the car was in an underground garage.  \n\nThe only people it could have truly affected were people trying to re-pair their car keys (which you need the key card for) or the weird situation which you let someone borrow your car and your remote unlock/start for them (which is kinda sketchy to rely on the cell for). Other than that I can’t imagine a situation besides trying to summon/preheat/adjust charging time/etc that would be more than a minor inconvenience.  \n\nWhen my Volvo remote app was down for a day I never saw articles about it.", "score": 3, "replies": []}, {"body": "It's a hit piece otherwise known as a \"short report.\" I closed my positions and feel the valuation is insane, but that article wreaks of borderline falsehood. The kind of lies lawyers tell basically.", "score": 0, "replies": [{"body": "LOL! I don't have any positions, how can it be a \"short report?\"\n\nPeople are crying that somebody doesn't like the same stock as them. Bulls make money, bears make money, pigs get slaughtered.\n\nYou should learn to respect the market.", "score": 1, "replies": []}]}]}]}, {"body": "I just used my key card I keep in my wallet. This was not a big deal at all.", "score": 6, "replies": [{"body": "The funny thing my car still worked with my phone during the outage, go figure.", "score": 6, "replies": [{"body": "The phone worked because it talks Bluetooth directly to the car.  It doesn’t need cellular coverage or the Tesla servers to be working.", "score": 2, "replies": []}]}]}, {"body": "This is ridiculous and the amount of upvotes with every single emoji looks even more suspicious.\nThe outage was only if you wanted to REMOTELY open or REMOTELY start your car. \nI don’t know any Tesla owners that starts their car remotely. The cellphone app worked flawlessly during the outage and if for some external reason that doesn’t work, the keycard also works as a backup.", "score": 7, "replies": []}, {"body": "This is FUD. Tesla recommends you always carry a keycard as a backup incase your phone dies or something like this happens.", "score": 36, "replies": [{"body": "It's not \"FUD\" (Fear-Uncertainty-Doubt) which is a type of misinformation.\n\nIt's the news. And in the news you find out that a lot of people didn't carry the keycard, and were locked out.\n\nYou can say it is their own fault; but it is still news that it happened.", "score": -56, "replies": [{"body": "It is their own fault.", "score": 24, "replies": [{"body": "Yes. That is what makes it funny. They're like the BMW driver for the modern age.", "score": -23, "replies": [{"body": "So if it's the owners' fault, the story is FUD 🤦‍♂️", "score": 9, "replies": []}]}]}, {"body": "It's clearly a click-bait title that's leaving out key details. Pun intended.", "score": 7, "replies": []}, {"body": "Funny I would see you here. You are genuinely insufferable and incredibly stubborn. It's almost as if you seek to create an argument just so you can 'show off' your perceived intelligence.\n\nIt's quite obvious that Tesla recommends keeping an alternative way to unlock your vehicle. The app feature is complimentary.", "score": 1, "replies": []}, {"body": "You’re barking up the wrong tree.  These are Cult of Elon worshipers, not people you wish to discuss stock strategy over a cold drink.  Watch my ticker:\n\nTesla cars are great.  Elon’s a putz.  🤣", "score": -1, "replies": []}]}]}, {"body": "Fucking idiots, cars are technology.", "score": 5, "replies": []}, {"body": "Meh. I drove 400km and 5 stops with the family with the app giving a 500 error.\n\nIf people don't have a phone setup as a Bluetooth key and are using the app itself to unlock the car and start it they will be shit out of luck the day they don't have internet coverage too..\n\nThis whole thing is stupid.\n\nYou have a car card.\nYou have bluetooth phone key.\nThen and only then you have the app.\n\nThis whole thing just makes me angry coz it's total FUD from other car makers...", "score": 2, "replies": []}, {"body": "Just take the key along you dummies!", "score": 2, "replies": []}, {"body": "Lots of jealous ppl still trying to shit on Tesla. \n\nIs it meh? Yeah. Is it overvalued? Fuck yeah. Does it keep going up and making me money? Fuck yeahhh!\n\nYall sound like that bitter chick who didn’t want to date a guy but he turned out a fkin chad and now you gotta talk down on him to justify your decision", "score": 7, "replies": [{"body": "You need help.  🤣", "score": -5, "replies": []}]}, {"body": "How the F is this a top awarded post?", "score": 1, "replies": [{"body": "Pretty easy to award your own posts.", "score": 1, "replies": []}]}, {"body": "Literal fake news headline.", "score": 1, "replies": []}, {"body": "Lots of tesla owners here butthurt", "score": 0, "replies": [{"body": "Stock holders\\*", "score": 1, "replies": []}]}, {"body": "Maybe if they put some Bitcoins in it will unlock the ignition.", "score": -1, "replies": []}, {"body": "Tesla is so over valued it kinda scary. Ole melon husk literally just pumps his own garbage. Cant wait till that bubble pops tbh. Altho hes such a good con man it may never pop. Y’all remember his revolutionary public transport system that was just a car in a tunnel lol. Its sad how he manipulates the markets and all these people who worship him. With that said op is clearly just tryna fud for some weird reason.", "score": -2, "replies": []}, {"body": "Well am I the only one here that can see every car connected to the internet will be hacked and all crashed at the same time.  I mean I think a 5 yr old would be able to figure that out.  Self driving cars?  Nope not going to happen.  This tech will work on other things like robots etc. yes but 4.000 lb cars driving on the same road with families.  Hell no.", "score": -3, "replies": [{"body": "So on this note.  Who wants to build a regular car company that you only can easily work on.  Remember how much oil was at the start of the pandemic?  Negative $22 per barrel.  When all these electric killer cars are out on the road gas should go back to under $1 per gallon.  That is a niche that no one is working on.  A simple car that you can work on that runs on gas.  It will be so much cheaper than electric trust me. Also much safer.", "score": -2, "replies": []}]}, {"body": "I'm excited for the future of horror movies. Imagine:\n\nExt. Woods. Night\n\nSHARON runs toward the car. She pats her hands against her pockets but...\n\nA GLOVED HAND is holding SHARON'S PHONE. \n\nSHARON pats her pockets, searching as she tugs at the DOOR HANDLES of her Tesla.\n\nTHE KILLER smiles as he enters a series of commands into SHARON'S phone. \n\nSHARON'S TESLA'S HEADLIGHTS alight and the engine ROARS to life. \n\nSHARON is still tugging at the door handles to no avail as the TESLA (independent of SHARON'S actions) lurches backwards and then faces her. SHARON begins to run -- not from the unseen killer but from the vehicle that she thought would provide her safety.\n\nSHARON screams as the vehicle she once ran to runs her over.\n\nECU. SHARON\n\nSHARON lies motionless and bloody as we hear the sound of the TESLA REVVING. \n\nCUT TO:\n\nINT. LIVING ROOM, NIGHT\n\nThe NARRATOR sits cross-legged sipping wine.\n\nNARRATOR: I am happy to give this scene away for money or Tesla stock. Any money received will be used to buy a cyber truck. Any Tesla shares received will be sold to acquire funds to purchase a cyber truck.", "score": 1, "replies": []}]}
