{"title": "Stocks to buy during crash", "selftext": "I don’t want this to happen but if it happens what are the stocks that I can invest. I missed 2020 crash as I was new to investing. Now I have funds that I want to set aside for opportunities like these.", "id": "r48co6", "created_utc": 1638117557.0, "score": 28, "upvote_ratio": 0.69, "num_comments": 54, "comments": [{"body": "Yolo TQQQ at bottom of crash = +1000%. Just don't buy it at the peak!!!", "score": 66, "replies": [{"body": "I did that last time but I don’t know that I could do that again. It was scary.", "score": 6, "replies": [{"body": "Well played.. how much u make?", "score": 2, "replies": [{"body": "Maybe 40k by the time I sold a couple weeks ago. Very very stressful to buy into tqqq at 40, then 30, then 20 dollars a share knowing full well the etf could go to zero", "score": 9, "replies": []}]}, {"body": "i like how both of your avatar look almost the same for doing the same thing", "score": 2, "replies": []}, {"body": "What you sold QQQ?", "score": 1, "replies": [{"body": "I dropped nearly all of my tqqq, CAPE at 40 was stressing me out.", "score": 1, "replies": []}]}]}, {"body": "Tough because how do you ever know the trough?", "score": 11, "replies": [{"body": "Time in the market > timing the market with the exception of triple leveraged etfs like TQQQ where a 30% crash will wipe out 90%+.", "score": 10, "replies": [{"body": "You're being downvoted but the stats are in your favor", "score": 7, "replies": []}, {"body": "y u getting downvoted?", "score": 2, "replies": [{"body": "Because of the TQQQ longs that don't want to hear the 30% crash = 90% down. The response would probubly be that as long g as you continue to buy dips at 90% down you will come out ahead eventually. This assumes you keep lots of cash available to buy all dips. I have only day traded TQQQ never held it over night (yet..) be interesting to see \"how low can we go\" on Monday... most people think it will be a green day which has me thinking more bloodshed awaits...", "score": 5, "replies": []}]}, {"body": "Nah, you don't even need a 30% crash. Just a long bear market (like after the dot-com bubble) eradicates you capital by giving you 3x losses daily. If you bought TQQQ at the peak of the market you'd need seventeen years to get back to break even...\n\n\n\nThe fotona crash was nothing, it was quick and hence leveraged funds survived. A long bear market will slaughter them...maybe not go to zero but make you suffer for a decade or more...and that's bad enough.", "score": 2, "replies": []}]}]}]}, {"body": "During a real crash like the 2000 crash you want stable and profitable companies.\n\nYou don't want companies with almost no revenue, none with a too much debt, no hype companies. You want companies who can also survive some bad years.\n\nBecause during a real crash many companies will file bankruptcy.\n\nYou want the lame boomer stocks.\n\nBut then again every crash is different, see march 2020 which was completely different than any crash before.", "score": 28, "replies": [{"body": "The difference now is that the top 4 most profitable companies on earth with no debt and more cash in the bank than most nations now make up more than 60% of the Nasdaq. Hence why big tech is called secular, because it does well in all economic cycles. \n\nBoomer stocks are more economically sensitive to downturns. That’s why they’re called cyclical.\n\nBig difference between now and 2020. Back then those .com companies were mostly garbage. Now Apple Microsoft Google and Facebook are running the show and they’re not speculative, they collectively generate almost a trillion dollars a year in revenue.", "score": 0, "replies": []}]}, {"body": "Nothing is ever the same - so it’s impossible to KNOW.\n\nBut - I would buy companies that have money to outlast any kind of economic downturn. AAPL, MSFT, DIS, GOOG, AMZN, etc.", "score": 39, "replies": [{"body": "Add to the mix NVDA AMD Qualcomm MU LAC....", "score": 18, "replies": []}]}, {"body": "Berkshire.", "score": 8, "replies": []}, {"body": "Depends what causes the crash.", "score": 8, "replies": []}, {"body": "Buy $SPY on the way down. It's the lazy destination for passive investors when they bring their cash back into the market. No need to worry about finding the bottom since it will eventually come right back up. \n\nPut a smaller portion into high conviction stocks that have taken big hits. \n\nThen there's always crash proof stocks like AAPL, GOOG, AMZN, but they are even more boring than $SPY", "score": 8, "replies": [{"body": "Eventually can be a very long time.  If you bought SPY in 2000 it wasn’t until 2013 before it broke above the 2000 high.  That’s 13 years of waiting to break even.", "score": 2, "replies": [{"body": "And now with stock buying as easy as pressing a button on an app, a lot of new people come in to buy the dip.  Heck, the market can't even go down a percent these days without being bought up.  2000 to 2013 didn't have all these automated buying options we have today", "score": 10, "replies": [{"body": "I think it’s going to be the opposite. Part of why the tech boom and bust was so bad was because it was the first time retail investors were in the market in a meaningful way. They didn’t understand fundamentals and pushed prices way to high for no reason other than hope and ignorance. Then panic sold themselves into the poor house. The new tech may make it that much worse the next time.", "score": 2, "replies": []}]}, {"body": "True - but DCA in that period and you have a much more desirable outcome..", "score": 6, "replies": []}]}]}, {"body": "Identify the business sectors that crash the hardest. Revenue is going to fall across the board, but certain sectors (e.g. airlines, hotels, restaurants during the latest crash) may be temporarily hit harder than other business sectors.\n\nOnce you identify a sector or sectors, identify individual companies that may be harder hit than the sector as an average. Figure out why. Invest. Profit.\n\nOr apply this same approach to identify undervalued stocks in undervalued sectors and don’t try to time the market. The market could crash tomorrow or it could crash in 10 years. Would be unfortunate to be sitting on your hands for 10 years waiting on a crash.", "score": 3, "replies": []}, {"body": "Lol does anybody even use the search on here?", "score": 10, "replies": []}, {"body": "There's a bunch of quality companies that I feel are overpriced so I have on a watch list. If there's a crash and those companies become attractive I'll pounce on them.", "score": 8, "replies": [{"body": "Username checks out", "score": -2, "replies": []}]}, {"body": "How long do you hold them for", "score": 6, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "Pokémon cards?", "score": 6, "replies": []}, {"body": "I keep buying some of the aforementioned stocks like msft and apple every week which I have been doing for the past few months. Few ETFs like SOXL which are more focused on specific industries", "score": 1, "replies": []}]}, {"body": "Are people serious? It was a short week and new covid strain. Why r people worry about a crash?", "score": 2, "replies": []}, {"body": "If you're new to investing you shouldn't be setting money aside. Being new that means you don't have a substantial investment. You should be investing all of your \"extra\" money and if the market does go down get a second job to load up. Trying to time the market is a losing endeavor. \n\nI actually made over $30 an hour for a week driving for Uber eats when the COVID lockdowns started and the market had tanked. Got to know a city i had just moved to and invested all of it.", "score": 3, "replies": []}, {"body": "MSFT GOOGL NVDA", "score": 2, "replies": []}, {"body": "You never know when the recovery will be done but when things hit the fan safety is what you need so here are 5 cash cows\n\nPsec, afrin, brmk, zim, gogl", "score": 1, "replies": []}, {"body": "Don’t forget Adobe", "score": 1, "replies": []}, {"body": "QS", "score": 1, "replies": []}, {"body": "During a crash? ETFC IBKR SCHW HOOD and any of their friends. If you think I’m wrong check out the charts of those stocks for the past 25 years. (Except RobinHood -  but brokerages print money during crashes)", "score": 0, "replies": []}, {"body": "Anything that has dropped like 40%. If it’s a solid product that people like then they will buy it back up even if it was overvalued before. For example chegg, bumble, Lyft. All the money printed means everything will stay more expensive forever, including stocks.", "score": -19, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "In your humble opinion you prefer companies that make money…?\n\nWild talk!\n\nI agree with you - these wouldn’t be on my list of stocks to buy should we have a hard downturn.", "score": 2, "replies": []}]}]}, {"body": "Kintara  is getting ready for its approved breakthrough……", "score": 1, "replies": []}, {"body": "I like DUK and ENB. They both have solid performance, pay solid dividends and even in a total catastrophic situation people will need to turn the lights on.", "score": 1, "replies": [{"body": "ENB is having a really bad run at the moment", "score": 1, "replies": []}]}, {"body": "EAD", "score": 1, "replies": []}]}
{"title": "Tesla to Start Production in Germany in December: Automobilwoche", "selftext": "", "id": "r459v8", "created_utc": 1638109084.0, "score": 249, "upvote_ratio": 0.99, "num_comments": 53, "comments": [{"body": "Tesla Inc. will launch its overdue German production operations in December, Automobilwoche reported, estimating as many as 30,000 vehicles will be manufactured there in the first half of 2022. \n\nProduction was to have begun in July but was delayed because the company hadn’t received environmental clearance. Local regulators are expected to grant the necessary permits within days, the magazine said, without reporting where it received its information. \n\nFive units of Model Y have already been completed at the Gigafactory near Berlin, though not on the production line. In January, serial production will start with 1,000 cars per week and gradually increase, according to Automobilwoche.  ", "score": 55, "replies": [{"body": "Honestly, given the German reputation for multi-year long delays (e.g See the [Brandenburg Airport](https://en.wikipedia.org/wiki/Timeline_of_Berlin_Brandenburg_Airport%27s_construction)), starting production in December is still quite remarkable.  Congrats on the Tesla team for making this happen.", "score": 38, "replies": []}, {"body": "5 months wasted so far.", "score": 18, "replies": [{"body": "I doubt Tesla is wasting that time. Probably working hard on getting everything ready-er.", "score": 27, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "More time to get battery stockpile ready...", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "There is a battery stockpile of 4680 cells from the Kato Rd facility. Since Tesla production manufactures exactly zero vehicles with 4680 cells as of today, those cells which have been rolling for months now are just being piled up somewhere. That said, according to The Q3 earnings call, they are going to Texas first, not Berlin. Berlin will likely start with 2170 cells.", "score": 1, "replies": [{"body": "There’s no evidence on that. Kato Road is just about a development line. They can just spin up the line up to some run rate then shutdown again for improvements over and over…. Stockpile batteries are waste of capital, and as a Agile company, we can presume the next batch will always better than the previous one. So it’s better to recycle and improve the line continuously without worry about stockpile or anything like that. Build the real production line is a big challenge.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Meh. I think Tesla has ultimately been chip constrained this year. Probably could not have produced much more anyway.", "score": 1, "replies": []}]}, {"body": "They start with 1000 per week. All going well, they will soon be at 5000 per week, then 1000 a day, then 5000 a day etc. They are being cautious because with the new double casting and the other innovations, you don't know where the problems are coming from. This isn't Toyota, where factory 7 works like factory 6. Continuous innovation means continuous risk of production hiccups.\n\nI believe the 1000/week at the start. I don't believe the 30k in a half year. It will be, all things working fine, much, much more.\n\nI saw today another video (Tesla Economist) with  the rumour of another huge production increase in Shanghai, like 1600 MY + 2000 M3 a day. Not believable if you ask me, but certainly they are not done ramping up in Shanghai, and they have started MY production only around a year ago.\n\nSo this is Tesla saying \" we start very slow and we want to see how it goes first. All things going well, we are going to smash projection every quarters for many quarters to come\".", "score": 5, "replies": [{"body": "I believe the Shanghai number. Shanghai is their sleeper factory. Most people don’t realize they never really stopped construction there and have been adding structures continuously on that site. Today it is over 9M sqft which makes it about 15% bigger than the gigantic Giga Texas. 1.25M a year is very possible out of Shanghai as it stands today.", "score": 2, "replies": []}]}, {"body": "Something does not quite make sense with the math here. If they are going to start with 1,000 cars a week in December and there are 26 weeks in the first half of 2022, they are accounting for almost zero ramp in this 30,000 estimate number. Very very conservative.", "score": 2, "replies": []}, {"body": "30k that's it?", "score": 1, "replies": [{"body": "Ramping up is hard. Also sandbagging", "score": 14, "replies": []}]}]}, {"body": "Wake me up when the final permit is given. I’m tired of waiting 😪", "score": 48, "replies": [{"body": "10th article about 20th delay. German engineering.", "score": 6, "replies": []}, {"body": "WAKE UP ... sorry false alarm.", "score": 1, "replies": []}]}, {"body": "Says they’ll start producing 1000/week in Jan with an expected 33K produced in H1 of ‘22. 33 seems a bit low to me but still, if the reports true it’s great to see some movement.", "score": 25, "replies": [{"body": "Kind of discredits the report on the whole honestly.", "score": 1, "replies": [{"body": "> Kind of discredits the report on the whole honestly.\n\nWhy? Tesla has matured a lot and they tend to sandbag their production targets:\n\n- Giga Shanghai was listed  in the Q3 earnings report, late October, with a \"450k+\" annual \"installed\" production capacity.\n- Fast forward two weeks, ***actual*** October production: 55.5k units, which with 23 workdays extrapolates north of 700k/year...\n\nSo yeah, I can very much believe that 30k is the \"official\", overly cautious target. Because shit happens.", "score": 9, "replies": [{"body": "Yep. The Wikipedia page of the Giga Shangai still has: \"The factory's initial production rate target is 3,000 cars a week, eventually ramping up to 250,000 electric cars per year.\" \n\n\"Eventually\" 250,000 a year. I say they'll make more than 1 million in 2022.", "score": 4, "replies": []}, {"body": "30k isn't official, it's just as much as a leak as the rest of the information here. \n\nAnd that 450k+ has been there since the Q2 report. Yes they're sandbagging. Once again unsure how that's related to this report of unofficial information.", "score": 0, "replies": [{"body": ">30k isn't official, it's just as much as a leak as the rest of the information here. \n\nAt least one other figure in the report has been confirmed independently.", "score": 2, "replies": []}]}]}, {"body": "Yeah I can see them starting slow as they fine tune the production process but surely they should be ramping up full speed by end of q1", "score": 4, "replies": [{"body": "Initial Model 3 production in year 1 of GF Shanghai was ~150k.  And remember Berlin will be debuting completely new manufacturing techniques and that Elon warned there will therefore be problems and issues.", "score": 9, "replies": [{"body": "I look forward to finding out all about those new manufacturing processes. It is worth it to spend some time figuring this out properly now so that Tesla can efficiently scale production to millions per giga factory", "score": 3, "replies": []}]}, {"body": "They'll be nowhere near full speed in one quarter.", "score": 2, "replies": []}]}]}]}, {"body": "*9/12 intensifies*", "score": 16, "replies": [{"body": "12/9 😛", "score": 3, "replies": [{"body": "Damn, I couldn't remember which one it was.", "score": 1, "replies": [{"body": "Im just poking fun at the month vs day first debate. \n\nIt's on the 9th of December\n\nEdit: doh, meant to say December", "score": 0, "replies": [{"body": "Ackshually December", "score": 1, "replies": []}]}, {"body": "for me, it's 9/12", "score": 1, "replies": []}]}]}]}, {"body": "PRAISE THE LORD!", "score": 5, "replies": [{"body": "...and pass the ammunition...", "score": 5, "replies": [{"body": "And the vaccination…", "score": 1, "replies": [{"body": "Free Omicron for all. Happy Holidays!", "score": 3, "replies": [{"body": "Omicron keeps yield low. I'm loving it", "score": 2, "replies": [{"body": "Buy the drip!", "score": 0, "replies": []}]}]}]}]}]}, {"body": ">*Local regulators are expected to grant the necessary permits within days, the magazine said, without reporting where it received its information.*\n\nWell that’s a big fat nothing-burger.", "score": 4, "replies": []}, {"body": "someone has a screenshot from the article? i don' really want to pay to read it", "score": 2, "replies": [{"body": "This is the entire article:\n\nTesla Inc. will launch its overdue German production operations in December, Automobilwoche reported, estimating as many as 30,000 vehicles will be manufactured there in the first half of 2022. Production was to have begun in July but was   \ndelayed because the company hadn’t received environmental clearance.   \nLocal regulators are expected to grant the necessary permits within   \ndays, the magazine said, without reporting where it received its   \ninformation. Five units of Model Y have already   \nbeen completed at the Gigafactory near Berlin, though not on the   \nproduction line. In January, serial production will start with 1,000   \ncars per week and gradually increase, according to Automobilwoche.  Tesla  \n Inc. will launch its overdue German production operations in December,   \nAutomobilwoche reported, estimating as many as 30,000 vehicles will be   \nmanufactured there in the first half of 2022. Production was to   \nhave begun in July but was delayed because the company hadn’t received   \nenvironmental clearance. Local regulators are expected to grant the   \nnecessary permits within days, the magazine said, without reporting   \nwhere it received its information. Five units of   \nModel Y have already been completed at the Gigafactory near Berlin,   \nthough not on the production line. In January, serial production will   \nstart with 1,000 cars per week and gradually increase, according to   \nAutomobilwoche.", "score": 11, "replies": []}, {"body": "The fist comment (by u/ElonMydaddy) actually contained the whole article.\n\nopening bloomberg articles in incognito mode seems to work for me (or it could possibly be the 'Bypass Paywalls' browser extention I am using)", "score": 4, "replies": [{"body": "That is awesome- did open incognito and passed the paywall", "score": 2, "replies": []}, {"body": "If you close one eye, website allows you to read full article", "score": 1, "replies": []}]}]}, {"body": "Riveting article! Bloomberg nails it with depth 👏🏻👏🏻👏🏻", "score": 1, "replies": []}, {"body": "I wonder if the German work policies would ever be brought over into the US markets for Tesla", "score": 0, "replies": []}, {"body": "Bullish", "score": 0, "replies": []}, {"body": "Ispc 🚀 stock to the moon this week!! Let’s go rich before christmas!", "score": -5, "replies": []}, {"body": "I am sure we'll get more accurate information soon from Tesla.", "score": 1, "replies": []}, {"body": "Should have built the factory in Spain!", "score": 1, "replies": []}, {"body": "I swear. If this turns out to be BS I f ing quit!", "score": 1, "replies": []}, {"body": " DEC 9", "score": 1, "replies": []}]}
{"title": "Chinese NVDA incoming", "selftext": "", "id": "r4hzt9", "created_utc": 1638143641.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 53, "comments": [{"body": "Chinese NVDA hahahahahahahaha.\n\nHahahahahahahahahahaha.\n\nFirst chip will probably be based on stolen VHDL from ARM MALI or something. Rebranded as \"Golden Dragon Video Core.", "score": 94, "replies": [{"body": "And the chip will be made out of wood", "score": 29, "replies": []}, {"body": "What's next, Taiwanese Micron?!", "score": -14, "replies": []}]}, {"body": "More innovative ways for investors to get scammed!", "score": 81, "replies": [{"body": "*Moore innovative ways\n\n\n Ffs, This sub has gone downhill", "score": 5, "replies": []}]}, {"body": "bagholders incoming", "score": 51, "replies": []}, {"body": "sweet they can get de-listed too!", "score": 56, "replies": []}, {"body": "The party approves this message comrade! + 420 social credit score. Report to your nearest CCP office for an extra ration of rice and more Evergrande bonds!", "score": 25, "replies": [{"body": "irony on social media is wrong, comrade. -500 social credit score. you have also forfeited your monthly rice allocation.", "score": 3, "replies": [{"body": "My government assigned wife and her boyfriend left me because of that -500. Thanks you for doing you part and reporting me to our glorious leaders! 😂", "score": 1, "replies": []}]}]}, {"body": "Ide rather work for citadel than buy another China soon to be FUD story. So over China BS at this point. Go away, delist them all fuck it", "score": 25, "replies": [{"body": ">Ide rather work for citadel than buy another China soon to be FUD story.\n\nBeing miserable and soon to be poor WITH cocaine or being miserable and soon to be poor without.. Yeah checks out", "score": 3, "replies": []}]}, {"body": "Jokes on you, nvidia already Chinese. Gogo daddy Jensen", "score": 10, "replies": [{"body": "taiwanese", "score": 5, "replies": []}, {"body": "😆🤣😂", "score": 1, "replies": []}]}, {"body": "SoTheyCanWatchYouPlay", "score": 6, "replies": []}, {"body": "This sounds like the bagholders saying wish is the next amazon.", "score": 3, "replies": []}, {"body": "Oh man. I wonder how much of this is stolen NV/AMD tech 😂😂", "score": 6, "replies": []}, {"body": "Personal experience. A bag holder! \n\nExcept few big names like NIO, Baba, etc., the rest of Chinese stocks are just out there to get huge fund flow from the USA while their company maybe valued at $1M.", "score": 5, "replies": []}, {"body": "Its all stolen IP with probably espionage backdoors built in", "score": 5, "replies": []}, {"body": "Yeah..... I'm sure people and governments will be fawning all over this bleeding edge technology that sends all your information on it to China...", "score": 3, "replies": []}, {"body": "Every time someone posts 'Chinese' version of a successful company/high cap, it just means it's the 10 cent version", "score": 4, "replies": []}, {"body": "👎🏽", "score": 4, "replies": []}, {"body": "Nah, I prefer to stay away from China.  God knows the CEO will disappear for a month after liking a picture of Winnie the Pooh, and the last thing we'll see is someone reading their apology letter.  Meanwhile my shares lose 50-80% of their value and my wife leaves me for the guy who invested in WISH.", "score": 3, "replies": []}, {"body": "Chinese gifts keeps on giving!", "score": 2, "replies": []}, {"body": "Chinese? Psssshhhhh", "score": 2, "replies": []}, {"body": "No", "score": 2, "replies": []}, {"body": "Nope. Thank you.", "score": 2, "replies": []}, {"body": "RIP in peace my social credits.", "score": 2, "replies": []}, {"body": "You just know this will be featured on $Wish.com", "score": 2, "replies": []}, {"body": "I believe you can buy these on wish lol", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|2 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r4hzt9)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r4hzt9)", "score": 1, "replies": []}, {"body": "Whats the ticker", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Doesn’t have nearly the respectable ai language compared to leather jacket man. Not even close to a competitor to Nvda or Amd . It’s taken those companies 15 years to be where they are at.", "score": 1, "replies": []}, {"body": "I am primed to buy puts, Chinese stocks and WISH are the only reasons my portfolio is green", "score": 1, "replies": []}, {"body": "China rips off every company that goes for cheaper labor.  Clearly a bad sign for any Chinese company.", "score": 1, "replies": []}, {"body": "Funny. I remembered when Nvidia fucked up with Microsoft. They got the shaft and their FX series were a giant paper weight. I bought the thing and I moved to the red team. I didn't look back until the 1080Ti was released.\n\nNow some Chinese punk wants to enter the market and somehow hope he could bully his way with Microsoft, Google and Apple?\n\nI could see them working on CPU if they bank on the mobile market but GPU is not something they could enter without serious support from the OS companies themselves.", "score": 1, "replies": []}, {"body": "Until I see that they have an architecture ready for tape out on an advance TSMC node, this is all bullshit.", "score": 1, "replies": []}, {"body": "Wasn't there already Chinese nvidia? I'm sure there's AMD as well due to an agreement with them a while ago.  Although,  supposedly,  the tech they got was years behind where it is now.", "score": 0, "replies": []}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "TAKE MY MONEY!!!", "score": -5, "replies": []}, {"body": "Moore traps.", "score": 1, "replies": []}, {"body": "Horseshit", "score": 1, "replies": []}]}
