{"title": "Is TLT Hitting its Bottom? My Play for the Upcoming Rebound.", "selftext": "Throughout 2023, TLT has been on everyone's radar, with hopes of a resurgence. The fund has consistently drawn interest, attracting a whopping $16.68 billion since the year's start, nearly doubling its assets. Yet, it's mostly been a downhill journey.\n\nWhile it's a stretch to claim today as the definitive low, it feels like we're in the ballpark. For those willing to take a bold stance, consider a weighted ratio put bet:\n\n* Purchase 10 Nov17 puts at $85 for $1.26 each.\n* Sell 40 Nov17 puts at $80 for $0.39 each.\n\nTo capitalize on a potential bounce back, integrate a modest ratio call:\n\n* Buy 5 Nov17 calls at $92 for $0.96 each.\n* Sell 15 Nov17 calls at $98 for $0.18 each.\n\nThis strategy results in a neat credit of $90, against the standard collateral of $30,000.\n\nIn essence, I'm sensing a short-term trough. While a recovery might be followed by another dip in TLT, I'd welcome a drop below $85 in November. But should this rebound evolve into a rally, I'll be all smiles.\n\nhttps://preview.redd.it/corxd3evsurb1.jpg?width=1152&format=pjpg&auto=webp&s=e0e35336d1f58325b42d6d96022d741977b7789e\n\nhttps://preview.redd.it/r6ya18s5turb1.jpg?width=1600&format=pjpg&auto=webp&s=206b831b9c4675c1f231ce983d8cc8312c9dc026", "id": "16y8d1m", "created_utc": 1696280648.0, "score": 35, "upvote_ratio": 0.89, "num_comments": 49, "comments": [{"body": "What we think and what we feel doesn't matter, this thing can rip higher or shat lower and seems to do so defying what everyone thinks and feels. Good luck with the play though.", "score": 25, "replies": [{"body": "Many fell into TLT or TMF without knowing what drives the price and yield !\n\nUntil yield curve comes to normal, TMF or TLT slide can not be stopped!", "score": 7, "replies": [{"body": "I don't entirely agree. I don't believe the Fed can maintain high rates for long. As a result, the yield curve will likely normalize soon due to falling short-term yields. Since this is inevitable (from my perspective), there's no need to push the long end of the yield curve higher than the current rate.", "score": 2, "replies": [{"body": "[https://www.cnbc.com/2023/10/03/something-is-breaking-in-financial-markets-heres-whats-behind-the-sell-off.html](https://www.cnbc.com/2023/10/03/something-is-breaking-in-financial-markets-heres-whats-behind-the-sell-off.html)", "score": 4, "replies": [{"body": "🤯", "score": 2, "replies": []}]}]}]}, {"body": "Thank you! You're damn right. But I'm not trying to predict where it will be. I'm just trying to make a profit wherever it might be.", "score": 2, "replies": [{"body": "Put in an order to buy when it's uo a few dollars from today's price . Personally I'd feel better buying on the way up then being stuck riding it sideways or down", "score": 1, "replies": []}]}]}, {"body": "Catching falling knives is very hard to do. There isn’t a bid to be found in the bond market right now. All the big boys tried to call the bottom 75 bps ago and that’s working out wonderfully for them. Rates are up there but they can absolutely continue to rise and stay higher for longer than anyone thinks. “It feels like” and “I’m sensing” are simply placeholders for “I’m completely guessing.”", "score": 18, "replies": [{"body": ">Catching falling knives is very hard to do.\n\nJust stick your hands out, you don't even need to grasp to catch them. EZ", "score": 4, "replies": []}, {"body": "You're right about catching falling knives—it's a thankless task. But as I mentioned in earlier comments, I'm not trying to do that. Perhaps it was a bit overconfident of me, but I felt I could control the descent of those knives. That's why I opened the position... I would've preferred not to have done so 75 bps ago.", "score": 2, "replies": [{"body": "Well you’ll either look like a genius in a few years or like anyone else trying to time the bottom. Guys like Dimon think rates are headed for 7.5%+ so 75bps will be a drop in the bucket at that point. Or the economy will roll over and rates will be 2% in two years. Guess we’ll find out.", "score": 1, "replies": [{"body": "I'd be intrigued to see a 7.5% rate. But the path there is still distant, unlikely by November 17th.  \nMoreover, long-term yields don't necessarily have to rise in lockstep with the rate. The real threat here is from the skyrocketing budget deficit. I agree that a continued trend of rising yields could pose a significant challenge for me.  \nLet's say I'm provoking a rate hike just to see what happens :)", "score": 1, "replies": []}]}]}, {"body": "Buy in a bit every day and you get some nice returns.", "score": 1, "replies": []}]}, {"body": "Don’t be a coward play TMF", "score": 8, "replies": [{"body": "With options it really doesn't matter. It doesn't make sense to buy options on TMF compared to TLT due to IV. IV on TMF will be around 3x that of TLT so you will make about the same if it runs past your strike given it moves 3x more (your break even will be 3x higher for an equivalent strike) but lose more if it doesn't. He's using spreads which will have better liquidity with TLT and you can setup a spread that has the same or better risk/reward per move in the underlying as with the 3x.", "score": 7, "replies": [{"body": "Absolutely right. And yes, liquidity is crucial for me in multi-legged strategies, which TLT has in spades.  \nI occasionally trade options on leveraged funds, like KOLD. But only because they decay over time, making selling calls on them a tad safer.", "score": 2, "replies": []}]}]}, {"body": "I have been waiting for this play for over a year,  but respectfully, I dont think right now is the time. However, I am still constantly running puts on $TLT and have been wildly successful. We will only know when the right time is when it's a month or two behind us.\n\n\nI pwrsonally think that we can see a repeat of October 22' to May 23' in the short run, where we might climb a bit, only to have another big leg down.\n\n\nPlease keep in mind that JPMorgan CEO Jamie Dimon said that “investors need to be prepared for 7% interest rates and most of them aren't.” I agree with this and just want to put this nugget into your head so you can maybe see a bigger picture and maybe save yourself from potential losses.\n\n\nGood luck, and I'm happy to be playing $TLT with you!", "score": 8, "replies": [{"body": "Thank you! Congratulations on your successful put strategy with $TLT. I'm also delighted to be playing alongside you!\n\nRegarding the potential 7% interest rates, few are prepared for such a move. Still, I'm hoping that by November 1st, the rate won't be raised to 7%, and my sold $80 puts will comfortably expire OTM", "score": 4, "replies": []}]}, {"body": "Trying to time the bottom and trading counter trend is futile. You might get lucky on occasion but you'll never be consistent in the long run which is all that matters.", "score": 8, "replies": [{"body": "I don't know where the bottom will be. And frankly, it doesn't matter much to me... 85...82...80 or even 75 – it's not crucial. It's just that if TLT plunges to 75 in the next couple of weeks, it'll be harder for me to turn a profit, and it might take more time.", "score": 2, "replies": []}]}, {"body": "that's like asking is SPY at top.. lots of commentary in WSJ barron's etc about when long Treas's will bottom out but *shortly before the last int rate hike* pops up a lot.", "score": 3, "replies": []}, {"body": "Im waiting for 82.5 then doing an 80p/90c risk reversal for Dec.", "score": 2, "replies": [{"body": "I'm also hoping it reaches 82.5. What I'll do next depends on when it gets there.", "score": 1, "replies": []}]}, {"body": "Dont you think, that if economic data continues to come in strong that week, that there might be a further downside?", "score": 2, "replies": [{"body": "I fully acknowledge that. That's precisely why I'm not simply going long. There's a risk that my sold options at the $80 strike could end up ITM, and in that case, I'd indeed be positioned long. However, firstly, it would be at a lower price. And secondly, I believe I'd have the time to roll my position into December and beyond, ensuring that, in the end, my options expire OTM.", "score": 2, "replies": []}]}, {"body": "A little too early but if you can stand not being washed out,  you'll be good", "score": 2, "replies": []}, {"body": "I'm bored so let me give you some deeper analysis for your play, and also for anyone who wants deeper understanding of TLT. \n\nFirst you have to know how a basic bond works. The price of the bond and rates are inversely related; that means when interest rates go down, the price of the bond goes up, and vise versa. Longer term bonds are more prices sensitive to interest rate movements. \n\nThe fed effective rate right now is 5.33%. For illustrative purposes, if you held a bond that paid 5.33%, and next month the fed announced rates are going down, the price of this bond would increase, given the inverse relationship. \n\nKeeping the inverse relationship in mind, if you look at all the bonds TLT owns (which I have), the coupon rates on each bond are between 1.25% and 5.34%. When you look at the weight of each bond in relation to the overall ETF, 7.38% of the ETF has bonds with coupons between 4%-5.34%. \n\n92.62% of the ETF has bonds under 4% coupon rate. \n\nFor example, bond CUSIP 912810SU3, this is the largest weighted bond in the TLT ETF at 9.2%. It was bought Feb 2021 and matures (\"expires\") Feb 2051. It's coupon rate is 1.88%. Right now it's worth $53.04, assuming the par value was $100. For this bond to get anywhere near it's par value, the fed interest rate has to drop significantly, whole percentage points to have impact. \n\nOne question I  ask myself is, longer term bond are more price sensitive to interest rate movement; when just over 92% of the TLT ETF has bonds that have coupon rates below 4%, how much does the fed rate have to drop to cause meaningful (however you want to define what that means) positive price increase?\n\nAnother question is, at what point in time is the fed going to start dropping rates, and how fast? No one knows, but it's probably safe to say certainly not within the next year. 2+ years from now they *may* start to drop, but again, for how long and how fast?\n\nSo 2+ years we can speculate the ETF will probably not significantly increase in price based off: \n\n1. of how bonds work;\n2. the specific bonds that TLT holds;\n3. the inflationary environment;\n4. and how adamant the fed has been about fighting inflation by increasing rates and holding them where they are. \n\nOn the flip side, how much more can it be anticipated to drop? Right now it appears the market is pricing in further increases, and I say this based off when TLT first started falling off a cliff in December 2021, comparing that date to when rates first increase in March 2022. \n\nMarch 2022 was the first rate increase. TLT closed at 148.19 in December 2021 and has been dropping ever since, with the first largest drop in March 2022. The last four months have shown increasingly large drops again, starting in July. The market is supposedly forward looking, so what is the market pricing in (assuming the market is efficient)?\n\nI welcome any critiques and pointing out of flaws in my analysis.", "score": 2, "replies": [{"body": "Thank you for your analysis. I read it with interest and have a few comments.\n\n**1. Long-Term Bond Price Sensitivity to Interest Rate Movement.**\n\nIf short-term rate hikes led to equivalent yields in long-term bonds, their prices would decline significantly. And so would TLT, for the reason you mentioned - a majority of the bonds in TLT's portfolio were issued at low rates with smaller coupons.\n\nHowever, long-term yields don't necessarily move in sync or even in the same direction as the Fed's rate. If the rate hike cycle ends in a year and they go back to zero in 2 years for another 3-4 years or longer, why should the yield on 20-year bonds rise to 6% and pressure bond prices?\n\n**2. The Opposite is Also True.**\n\nA decrease in the Fed rate doesn't necessarily translate to a mega-rally in long-term bonds. Though they will surely appreciate.So, in response to your question, \"how much does the fed rate have to drop to cause a meaningful positive price increase?\" - I don't know. I can only reasonably assume that there will be some positive price increase.\n\nThat's enough for me. Because I'm not betting on a sharp rise in TLT. Rather, I believe its decline should slow a bit. And that's what we're seeing.\n\n**3. About Timing.**\n\nYou rightly pointed out that TLT began its decline in December 2021, three months before the first rate hike. The reverse will likely be the same. A year ago, we already saw a rally in TLT from 93.21 (October 21st) to 109.47 (December 7th) based solely on rate hike termination expectations. These expectations were unmet, but the movement was telling.\n\nSimilarly, with actual rate cuts, TLT's rise will start 2-3 months in advance.As for when this will happen - next year or later - I can't say. But I sense it might be sooner than many anticipate, perhaps by spring 2024.\n\nThe trigger won't be inflation reduction, but a potential stock market crash. Maybe even a bond market crash. Markets will need salvaging, and inflation concerns will be set aside.\n\nOf course, this poses significant risks for long bonds and TLT. When shorting TLT through put options, one must be prepared for this scenario. Preparedness means sizing your position so it doesn't get forcibly closed before the rates are reduced.", "score": 3, "replies": []}, {"body": "You don’t know how bonds work. The lower coupon rate bonds has been priced appropriately you are buying the bond at a discount. It doesn’t need to get to par value for you to see a huge increase. Your cost basis is what matters. TLT has rallied and all you people acting like you understand bonds \n are sadly mistaken. Please people don’t take investment advice from one random guy on Reddit that doesn’t understand low price/par value bonds and ETF dynamics.", "score": 1, "replies": [{"body": "Explain it to me in detail then. \n\nAlso, a blanket statement of how I don’t know how bonds work is inaccurate, you shouldn’t discount everything I said based off one inaccuracy of, what you pointed out (thank you), my misunderstanding of the relevance of the par value dynamic within the ETF. \n\nNext time don’t offer blanket criticism when we are all here trying to learn something no one is teaching us; you’ll be a better person for trying to correct someone’s misunderstanding of a topic, rather than criticizing someone’s ignorance when they are trying to learn.", "score": 1, "replies": [{"body": "Sorry, I’m just pointing out that people should do their own research rather than investing blindly and losing money. Theres so much misinformation about bond ETFs vs actual bonds on Reddit. Here is a bond calculator so you can see exactly how much a low par bond with higher convexity will move (more upside during a rate cut): https://dqydj.com/bond-pricing-calculator/", "score": 1, "replies": []}]}]}]}, {"body": "Long term Treasury interest rate can definitely go past the current 3.49 percent....and have done so in my lifetime.", "score": 1, "replies": [{"body": "US 30-YR 4.782%.. Almost double soon enough", "score": 2, "replies": [{"body": "3.49 is the current yield on TLT. I am old enough to remember the 30 year strip being 15% yield to maturity.", "score": 1, "replies": [{"body": "Why didn’t you put all your savings into 30yr bonds giving 15% yield? That’s crazy!!!", "score": 1, "replies": [{"body": "I ask myself the same thing. I did earn very high CD rates for a while.", "score": 2, "replies": []}]}]}]}]}, {"body": "Nah", "score": 1, "replies": []}, {"body": "Im slowly nibbling at TLT now at these levels. Also have multiple put positions. I have done around 20 option contracts this year for TLT and basically just rolling them diagonally during these red days.. I have been very profitable with TLT.  \n\nI am definitely hoping for a decent sideway or a slow rise up soon so I can let a few of my option contracts go.", "score": 1, "replies": []}, {"body": "I’ve been watching this too. I’m not sure where the reversal will be. Short term because we are oversold? Or market crash and easing by the Fed?  Or sideways for a few years while Fed holds steady.", "score": 1, "replies": [{"body": "I believe that a market crash followed by the Fed's easing is a very plausible scenario. But even without such extremes, there are enough reasons to anticipate a slowdown in the decline over the next 2-3 weeks.", "score": 1, "replies": []}]}, {"body": "There's no bid for treasuries right now. Yields just keep going higher. Term premium being priced into the market and so it should with the retards in Washington spending like they just hit the lotto.\n\nI'm a long way away from wanting to buy long bonds.\n\nOn a long term time frame treasuries are right at the median level of yield.", "score": 1, "replies": [{"body": "So bonds and Treasuries are selling off...driving the 10-year rates up.....in anticipation of better auctions later? Another Fed rate hike coming possibly.....?", "score": 1, "replies": []}]}, {"body": "Looking at this a day later it seems like it's still falling too fast for a Nov 17 trade and could blow right past your lower strike on the put side.", "score": 1, "replies": []}, {"body": "sorry im so dumb. so does that mean its gonna go up or down?", "score": 1, "replies": []}, {"body": "My concern with ratio spreads is that having more shorts than longs risks the gamma of the shorts overpowering the delta of your longs even as it enters your profit zone. 3:1 and 4:1 ratios make me want to shit my pants. How have you got on with them?", "score": 1, "replies": [{"body": "I'm scared too, but I'm holding on.To be honest, I opened this aggressive position based on two assumptions:\n\n1. I was expecting a local bottom around here. I'm hoping we'll tread water here or slightly below for the next 2-3 weeks or even until the Fed meeting.\n2. TLT isn't the most volatile security. So, I should have time to reduce risks before gamma blows me out. My exact approach will depend on the circumstances. I do have a plan.I could be wrong on both counts.\n\nI'll keep a clean pair of pants at the ready :)", "score": 1, "replies": []}]}, {"body": ">This strategy results in a neat credit of $90, against the standard collateral of $30,000.\n\nWhy bother?", "score": 1, "replies": [{"body": "He’s only making $90?", "score": 1, "replies": []}]}, {"body": "Nov 17? Are you serious?  You should buy leaps for 2 years and sell puts for the same.", "score": 1, "replies": []}]}
{"title": "RKLB Mystery Mega Constellation Customer Revealed?", "selftext": "Update: my thesis was wrong.\n\nBack in March 2023, Rocket Lab announced that they had entered into a contract with a company attempting to build a mega constellation, much like SpaceX’s Starlink, to supply thousands of reaction wheels annually. Immediately, many observers began to question if this customer might be Amazon, who is currently building Project Kuiper, but the company would not say one way or the other. Interviews with the CEO, Peter Beck, have led some to believe it is indeed Amazon as well.\n\nHere is where the thesis comes in. On Friday, October 6, ULA is launching the prototype satellites for Kuiper. I believe that an announcement will be made on Friday or Monday which discloses the contract between Amazon and Rocket Lab. Here’s why:\n\nOn April 5, 2022, Amazon first announced that they had secured 83 launches with different launch providers, like ULA, Arianespace, and Blue Origin. In this announcement, they revealed details about these contracts and stated that the next actionable step for Kuiper was the launch of the prototype satellites. This press release, alongside upcoming AMZN events, supports my thesis.\n\nFirst, Amazon has yet to announce their next steps for Kuiper. I would expect that pending a successful launch, they will give a press release sharing what the next steps are. After all, they want to compete with Elon, so they will try to drum up as much hype as possible. \n\nSecond, if Amazon has such a large contract with Rocket Lab (easily $100M+ annually), it would likely be included in such a press release. Amazon wants as many reputable names as possible attached to Kuiper, and a company like Rocket Lab is well known for the quality of their hardware. And even if Rocket Lab is not specifically mentioned, this information would likely be released from NDA and be announced by RKLB themselves.\n\nThird, Amazon has Prime Day next week. With the launch coming this week, they are walking a tightrope. On one hand, they don’t want to distract from the sale; on the other, they want to get Amazon in the news for both Prime Day and Kuiper. Therefore, an announcement on either Friday or Monday would serve both goals best, Amazon is in the news with a few days left to hype up Prime Day.\n\nIn short, if the launch is successful, Amazon will announce information that benefits Rocket Lab, and RKLB will fly 🚀", "id": "16y29of", "created_utc": 1696266658.0, "score": 56, "upvote_ratio": 0.85, "num_comments": 43, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 months ago\n**Total Comments**|173|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: I believe Rocket Lab will be mentioned in an Amazon press release this week.", "score": 1, "replies": []}, {"body": "You will give the Dish Guy, a highly respected community member, a run for his money.", "score": 24, "replies": [{"body": "Dish guy was a prophet", "score": 14, "replies": [{"body": "I made a ~100% on that. But didn’t put much into it. Bought after his post then sold in the first minute at open.", "score": 1, "replies": [{"body": "I also got a pp tingle on it and bought. Held too long, but it was easy money.", "score": 1, "replies": []}]}, {"body": "who is dish guy", "score": 1, "replies": [{"body": "He was a prophet. He came to us with knowledge and we shunned him.", "score": 1, "replies": [{"body": "I listened. Dish Guy made me a few hundred bucks, I shoulda listened harder so I could’ve made thousands!", "score": 1, "replies": []}]}]}]}, {"body": "Great!", "score": 0, "replies": []}]}, {"body": "Worth a gamble. My extremely advanced TA says it is in the support zone if you zoom out. And anyway I was always fan of rockets.", "score": 14, "replies": []}, {"body": "Another day, another “Amazon will magically step in to save my play” DD.\n\nIf AMZN already announced partner companies previously, why would this one agreement with RKLB be held as a secret? It's not really big news for Amazon to say that *another* company has been contracted do the same things they’ve already announced openly.", "score": 27, "replies": [{"body": "Amazon has announced the companies who will be launching Kuiper, but they have not announced any companies who will be supplying parts. Rocket Lab will not be launching for Kuiper, at least not at this point.\n\nAlso, all communication from Rocket Lab has indicated that they are prohibited from announcing anything yet, hence why they have described the customer as an “undisclosed large mega constellation customer” and not Amazon. If they were able to say something, they would’ve, and then they could’ve used an uptick in SP to sell shares.\n\nAs to why Amazon would keep this a secret, it’s anybody’s guess. But for whatever reason, Rocket Lab is unable to tell us who the customer is despite having a pattern for announcing their contract partners to all investors.", "score": 7, "replies": [{"body": "> use an uptick in SP to sell shares \n\nSo even if your DD is right you think they’ll immediate dilute when the news breaks? That’s… not ideal", "score": 1, "replies": [{"body": "I’m not sure if they will or not, but it would be silly and deceptive to think that dilution following an announcement is impossible. I’m not trying to trick anybody into investing, it’s good to remember the very real possibility of a share offering", "score": 1, "replies": []}]}]}]}, {"body": "Big if true", "score": 7, "replies": [{"body": "Very Concerning.", "score": 4, "replies": []}]}, {"body": ">I think you may be onto something with your theory. It would certainly make sense for Amazon to want to capitalize on the Prime Day hype by announcing their contract with Rocket Lab then. I'll be keeping an eye out for any news next week and see if your prediction comes true!", "score": 10, "replies": []}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Don't know about their suppliers but Amazon is a part of my share portfolio and they haven't disappointed me to date..", "score": 3, "replies": [{"body": "How are you feeling about Kuiper? Do you think it’ll end up being a staple of Amazon’s business, like AWS?", "score": 2, "replies": [{"body": "It sounds good in theory.\nHowever,\nI don't see it being a big earner.\nCountries that don't already have decent internet are broke.\nThey will struggle to re coup the initial outlay I feel.\nBut hey, what do I know .\nIf someone of note was backing it I might take a look.\nAgain, I'm not interested in Amazon's suppliers .\nOnly the whole package.\n3 or 4 years @ a 30% gain.\nIt's not my best but certainly not my worst holding.", "score": 2, "replies": []}]}]}, {"body": "I find it a little hard to believe such an announcement hasn’t already been priced in. It’s all pretty much accepted that they are supplying parts for a mega constellation and that it’s almost positively Amazon. Might see a spike when it’s finalized and public, but… I don’t know seems to much of a given to have an effect on the stock. And if there’s one thing I’ve learned from investing, it’s that inevitability is bound to produce results contrary to your belief. E.g. with Virgin Galactic it was so widely discussed and believed that once SPCE has a successful flight with Richard Branson the stock will soar. Come flight day, they had a successful launch and the stock tanked 20%+ and got decimated for a few weeks.\n    \nThis Amazon contract is reaching that “inevitable price jump” state for me that scares me", "score": 4, "replies": [{"body": "I can definitely see that. The only problem with that theory is that there remains some uncertainty about who the partner is (we’re fairly sure it’s Amazon, but not certain) or the size and frequency of the contract. Also, the SP is only slightly higher now than it was back in March. Neither of those are fool-proof metrics, and there is a big risk that the market has already priced in an AMZN contract. However, I am still interested, especially since RKLB will have tens of thousands of eyes on it when the announcement does come.\n\nOne thing I will say, because the ULA launch on Friday is likely to generate interest in RKLB, it is possible that anticipation for an announcement will be a bigger catalyst than the announcement itself. Played correctly, this could be a profitable trade, even if an announcement does lead to a dump (which I do not anticipate, but is very possible).\n\nTo be fair, you are right that it being priced in is a realistic concern. This is far from a certain trade, and I wouldn’t want to give anyone the impression that it is risk free.", "score": 1, "replies": []}]}, {"body": "My shares (and options to buy more) will be ecstatic.", "score": 3, "replies": [{"body": "I’m with ya, I’m loaded up on 10/20 $4cs", "score": 4, "replies": [{"body": "I'm holding 20 $8 calls for 10/20 that I bought before the share price plummeted. Not very confident at this point that those will be in the money.. but I'm looking at possibly grabbing some new calls and wondering if it would be a safer play to go with the 11/17 expiration. If the contract is real but they don't announce it immediately after the launch, I would expect it to be announced in the next earnings call which should take place in early November.", "score": 3, "replies": [{"body": "Those $8c are tough… the 10/20 is definitely a gamble for me, and I wouldn’t recommend such an early date, but I’m confident in my thesis. 11/17 might be good, but don’t forget that we’ve been red after ERs pretty consistently for the past 2 years. Also, I’m not personally convinced they would wait till then to announce a contract, since they usually announce new contracts outside of ER, but we will see. It’ll be fun couple months regardless", "score": 2, "replies": []}]}, {"body": "Same, but 4.50 (still getting crushed by IV though). In a rarity, I actually bought the calls with the intent of exercising since my shares are still above water. We'll see how it plays out, but I'm optimistic.", "score": 3, "replies": [{"body": "You might have your own strategy, but it is very unlikely that exercising your calls will be more profitable than selling the premium and buying shares. Unless you’re dead set on holding them through expiration, you would be throwing away theta if you exercise", "score": 1, "replies": [{"body": "Excellent point. I’ll take another look", "score": 2, "replies": []}]}]}, {"body": "5Cs here like an ape", "score": 2, "replies": [{"body": "Were you the one who bought 300 10/20 $5c today 😂", "score": 2, "replies": []}, {"body": "me too friend", "score": 1, "replies": []}]}]}]}, {"body": "Ahh… loved Dish guy!!", "score": 2, "replies": []}, {"body": "Hell yeah read this post last week and don’t regret buying calls 🔥🔥🔥", "score": 2, "replies": [{"body": "I’m glad you made money, even though my thesis was wrong 😂 I made +50% on calls anyways so I’m not mad", "score": 1, "replies": []}]}, {"body": "Rocket Lab will be providing Amazon with reaction wheels. Amazon has already revealed the three companies that will be doing the launch. I dont see any logical reason to assume Rocket Lab is a secret 4th company that will carry out launches", "score": 4, "replies": [{"body": "I don’t think you read my post. I am not arguing that Rocket Lab will provide launches for Kuiper, and the reaction wheel contract has NOT been announced, despite many rumors. I am arguing that the announcement will occur in the next week.", "score": 10, "replies": []}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "Okay.", "score": 1, "replies": []}]}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Wait, Amazon share holders are suing Amazon at the moment because of kuiper right now. They have out so much money and no results. And it’s because they’re showing favoritism to Jeff bezos blue origin and blah blah", "score": 1, "replies": []}]}
