{"title": "Warren Buffet and Berkshire Hathaway has $160 billion currently. Could make a huge deal soon. How to play this?", "selftext": "https://finance.yahoo.com/news/warren-buffett-enough-firepower-160-170746878.html\n\nThe article suggests they could invest in the utilities sector? Anyone going to buy something specific, trying to guess what they will go after? ", "id": "7zonl2", "created_utc": 1519398297.0, "score": 178, "upvote_ratio": 0.92, "num_comments": 87, "comments": [{"body": "probably views most everything as too expensive and waiting for either a recession or market correction to occur", "score": 168, "replies": [{"body": "It's buffet way ", "score": 51, "replies": [{"body": "When Buffet's holding such a cash position, you know the bull market's still on. ", "score": 28, "replies": [{"body": "sarcasm?", "score": 3, "replies": [{"body": "Truth? ", "score": 1, "replies": []}]}]}]}, {"body": "Ok but isn’t that timing the market? Oh but it’s Buffet so it’s ok right? 😂", "score": 2, "replies": [{"body": "He generally looks at individual stocks, and just assumes that given enough time the markets will trend will be upwards.  He does not try to predict the small market fluctuations.  However, there have been times when he believes that most equities are overbought.  He is opportunistic and will (maybe reluctantly) sell an overbought stock if he sees a better long term opportunity.  However, Buffett has explicitly said that he does not believe that current market is grossly overbought.  His explanation is that even though the market is trading at higher valuations, bond yields are so low that investors don’t have a good alternative. ", "score": 30, "replies": []}, {"body": "No it isn't. That's buying after it's fallen. Timing would be buying/selling before something happens.", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "IMO, there's a huge difference between \"I want to buy this, but at a cheaper price\" and \"I want to buy this just before it starts climbing again\".", "score": 9, "replies": []}]}]}, {"body": "He generally looks at individual stocks, and just assumes that given enough time the markets will trend will be upwards.  He does not try to predict the small market fluctuations.  However, there have been times when he believes that most equities are overbought.  He is opportunistic and will (maybe reluctantly) sell an overbought stock if he sees a better long term opportunity.  However, Buffett has explicitly said that he does not believe that current market is grossly overbought.  His explanation is that even though the market is trading at higher valuations, bond yields are so low that investors don’t have a good alternative. ", "score": 2, "replies": []}]}]}, {"body": "Buy BRK B maybe?", "score": 45, "replies": [{"body": "Nah, this is way too simple. There has to be a more complicated way to play this.", "score": 54, "replies": [{"body": "Short enough BRK.B until you have the cash to buy 1 BRK.A. \n\nStep 3: Profit!!!!! ", "score": 35, "replies": [{"body": "I like how this is so complicated, step 2 can't even be put in human words.", "score": 29, "replies": []}]}, {"body": "lol", "score": 3, "replies": []}]}]}, {"body": "BRK has over $100B in net cash, meaning it's trading at a discount to the market. That's the play. Speculating which company theyre going to buy is likely impossible. ", "score": 58, "replies": [{"body": "That’s not at all how net cash works for an insurance enterprise.  BRK trades at a premium of 1.6x to book value.", "score": 22, "replies": [{"body": "I have it at a PB of 1.6 too. Care to explain your comment please?", "score": 8, "replies": [{"body": "Net cash is an arbitrary balance sheet calculation that doesn’t immediately flow into any valuation framework without context. There are liabilities against that cash. Book value by definition incorporates cash.\n\nAnd to your other point about BRK as a buyer, net cash also has little bearing on that too.  BRK has plenty of debt capacity and many many other financing alternatives available.", "score": 6, "replies": [{"body": "The idea of net cash is that it's cash net of liabilities. It's how you arrive at enterprise value. ", "score": 3, "replies": [{"body": "You’re still confused. Let me try again.\n\nNet cash is cash minus debt (not all liabilities). Yes correct, it generally can be used to translate between market cap and EV.  However in this case it’s not applicable for many reasons.  Firstly, you’re looking at a consolidated balance sheet which includes cash held at regulated insurance subsidiaries which is not necessarily available to pay off HoldCo debt so it makes the cash figure arbitrary.  Secondly, financial institutions are unique in that they hold other marketable securities to support claims (or for banks, deposits), so in effect the amount held in cash is irrelevant when considering other fungible forms of liquidity available.\n\nAnd when you keep expanding that idea further, you’re right back at either total assets or tangible assets.  And that’s why it’s very common to look at valuations based on GAAP book or tangible book value for insurance companies.\n\nSaid another way, valuation techniques like EV/EBITDA are meaningless here because they seek to strip away the effects of financing from the value of the overall enterprise. But insurance companies are funky beasts and finance themselves with small amounts of traditional sources with positive capital costs (equity and debt) and large amounts of insurance liabilities with negative capital costs.  Trying to make sense of stripping out financing from a financial business is meaningless so it’s just not done.", "score": 4, "replies": [{"body": "Interesting, do you have a resource where I could learn more?", "score": 1, "replies": [{"body": "Any abbreviated corporate finance or basic accounting textbook is probably a good start followed by some of the early/basic chapters in a CFA curriculum.    For understanding how the insurance industry works, reviewing all the historical BRK annual letters to shareholders is full of good tidbits about insurance, investing and life.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "If only I could afford a share of BRK.", "score": -7, "replies": [{"body": "BRK.B is the one you want to look into. ", "score": 40, "replies": []}, {"body": "[deleted]", "score": 25, "replies": [{"body": "Yes.  Thanks to B shares I own 1/10th of an A share.", "score": 16, "replies": []}, {"body": "I bought when it was at 90", "score": -26, "replies": [{"body": "Well aren’t you a fucking great investor.", "score": 61, "replies": [{"body": "I’d love this response so much more if it made sense ", "score": -3, "replies": []}]}, {"body": "did I offend someone?", "score": 4, "replies": []}, {"body": "i bought 10 shares of brk.a at $100. still holding!!!", "score": 0, "replies": []}]}]}]}]}, {"body": "pls poppa save GE and my bags.", "score": 9, "replies": []}, {"body": "Well buffet buys what he understands to put it simply, so utilities/mining/industrial/production, pretty vast scope there it could really be anything ", "score": 21, "replies": []}, {"body": "Let's decide how we will play his retirement which is almost there. Sir Buffet has been trying to make this as smooth as possible with succession announcements. $160B will just sit in there until the next major correction ", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "> Buffett is a very shrewdinvestor, as such he does not pay huge premium when he buys a company.\n\nthis must mean $AAPL is cheap as hell.", "score": 7, "replies": []}]}, {"body": "I've always wondered why he didn't just outright buy $KO\n\nIt makes sense for berkshire no? anyone?", "score": 10, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "They only had enough money to buy 8% of the business in 1987. At the time, Buffett had hoarded cash for 5 years. Over the next 3 he put 25% of Berkshire's book value into this one stock. Since then they haven't added to it because they have found better opportunities. They haven't sold because it is essentially risk free, and they don't want to pay the tax. Their ownership of the business has increased over time due to share repurchases. The investment has compounded at 9% per year and he has received an additional 4% a year in dividends. These dividends have been invested and compounded at roughly 14% since then. ", "score": 12, "replies": []}, {"body": "Also, why run the company? Considering he can make money *not* running the company. ", "score": 8, "replies": []}]}]}, {"body": "Ally bank", "score": 3, "replies": []}, {"body": "My layman's opinion/guess is that knowing Buffet will make a move in the dips, he will wait for some bad Trump policies to weaken renewables and buy them, knowing that the next administration will have to pursue and support renewables. ", "score": 3, "replies": []}, {"body": "GE", "score": 3, "replies": []}, {"body": "Dunno bout down in the US, but up here in Canada utilities have been getting killed. If WB bought into an Utility... that could light a fire underneath the sector that's been beat up by interest rate fears.", "score": 2, "replies": []}, {"body": "If they really want too they will pump the whole sector premarket, hype it up, let everyone else get their hopes up and then correct the initial pump. checkmate.", "score": 2, "replies": []}, {"body": "It's difficult to play this to your advantage without knowing for sure if they are saving to acquire a company, and if so - which one? \n\nBuffet could be saving for a recession, he typically doesn't mess around with smaller market fluctuations which is a goodish thing I suppose, and he could be looking to acquire a new organization - which could be anything from another firm to some place that sells cheeseburgers.", "score": 1, "replies": []}, {"body": "WDAY is the target.", "score": 1, "replies": []}, {"body": "Buying expi?", "score": 1, "replies": []}, {"body": "My guess (and hope) is they buy a stake in a solar manufacturer like First Solar, Inc. $FSLR", "score": 1, "replies": []}, {"body": "Not GE, but a piece of GE (or 2). 1-30 billion\n\nMarket takes another 10-15% correction, he loads up on Apple and may a bit of Jpm . 5-15 billion.\n\n1-10 billion on a solid mature company that prints cash\n\nStill have over 100 billion in cash, ready for a major crash.\n\n\n\nBut if I could speculate some more, if warren just makes one huge move, I could see him buying waste management.\n\nPrints cash, moat, pretty recession proof, and warren can envision people needing garbage service in 20 years. I think it fits nicely in the Berkshire portfolio \n\n", "score": 1, "replies": []}, {"body": "$PCG.   You heard it here first.  ", "score": 1, "replies": []}, {"body": "lol that they even mention BH share buybacks or dividends. WB has said he would never do that, they made BH public because people wanted it so badly and he could use it to raise easy capital.", "score": -4, "replies": [{"body": "Super duper wrong. Warren Buffet would definitely buy back shares, but as the article suggests, the stock price isn't low enough that he would buy them back. He has said over and over again he would buy back shares if the company was valued at 1.2 book value.\n\nhttps://www.investopedia.com/ask/answers/031815/why-does-berkshire-hathaway-prefer-buy-back-shares-instead-paying-dividends.asp\n\nHe doesn't pay dividends because he can invest the money better than you. ", "score": 49, "replies": [{"body": "Thank you for the link. Very interesting. ", "score": 6, "replies": []}]}, {"body": "why do people buy berkshire if they will supposedly never issue a dividend or participate in buybacks? What other mechanisms are there to increase shareholder value?", "score": 0, "replies": [{"body": "Acquisitions", "score": 18, "replies": [{"body": "but how does that go to the shareholder?", "score": 2, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "but you aren't given the portion of the acquired asset in any way, since berkshire doesnt pay you a salary, give you a dividend, or buy back its own stock. So how is value returned to you if berkshire acquires a company? Sure their bottom line can go up, but what part of that do YOU get?", "score": -7, "replies": [{"body": "You get part ownership in the company! When a company makes a huge investment with big returns, people see that and want to get big returns along with the company, so they buy shares. Your share value just increased due to supply and demand. Also, it does buy back its own stock!", "score": 17, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": ">If an acquisition increases their bottom line, their stock value increases\n\nif it were this easy ford stock would be worth much more than its current price, and tesla would be worth nothing.", "score": -12, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Do YOU know how stock options work?  Not one part relates to options in anyway, it's just basic equity ownership.", "score": 10, "replies": []}, {"body": "I don’t think you know how they work ", "score": -1, "replies": []}]}, {"body": "This is an interesting thread. Shame on people for downvoting you for asking a question. Here is my answer:\n\nThere are two scenarios: \n\n1. The stock price is high: In this case you just sell your shares\n1. The stock price is low: you lobby with other shareholders to vote in a board that will issue a dividend or engage in buybacks. \n\nUltimately it's a testament to \n\n1. How well Berkshire has performed relative to the market\n2. The faith people have  in how safe their money is with Berkshire Hathaway  during downturns when all stock prices were low\n\nthat not enough of it's shareholders have had to force the issue. \n\n", "score": 0, "replies": []}]}]}, {"body": "read the most recent buffet letter, he explains how the stock price goes to its intrinsic value vs its book value.  http://www.berkshirehathaway.com/letters/2016ltr.pdf", "score": 3, "replies": []}, {"body": "Company makes more money so the assets increase so the share price has to increase.\n\nRemember that your share represents ownership of the company, so if the company has its value increase then your share does too. As long as they're doing things with cash to make more cash in the future then its fine. If a company has its book value idle and they aren't doing anything with cash then that is bad.", "score": 5, "replies": [{"body": "why does the share price \"have\" to increase? Theres plenty of examples of companies \"worth\" more than their share price (ex, Ford), so price/book or whatever metric you use to correlate assets and share price is clearly not the only thing at play.\n\nThe only reason share price has to increase is if someone wants to pay more for it, which clearly they do for berkshire- my question is still WHY they want to pay more for it when they will never see a tangible return unless someone else will pay more for it. Its like the only thing happening here is the greater fool theory, but its strange to see that apply to a massive conglomerate that makes boatloads of money.", "score": -1, "replies": [{"body": "Ford pays a dividend and their book value doesn't go up much more than the dividend pays out. \n\nIf company A has a million dollars in assets and consistently makes 500k a year and never does anything to save the profit or distribute it to shareholders so their book value stays the same then that's bad. On the flip side if they save the money and acquire companies instead of blowing the money or distributing it to shareholders then their book value will grow.\n\nBasically there's 3 ways to give value to the shareholders; 2 direct: dividends, buybacks, and 1 indirect: grow the value of the company. ", "score": 8, "replies": []}, {"body": "you own a piece of the company. If the company were to be sold at X price you would be entitled to the money at the percent you own. So if the value of the company goes up. wouldn't you say the amount you own of that company should too? I don't understand how that doesn't make sense.\n\nedit: I'm also only talking about intrinsic value.  Market value is super speculative so, good luck with any short term consistency.  But in the long term the market reflects intrinsic value.", "score": 3, "replies": []}, {"body": "\"Greater fool theory\" - the same could be said about any asset. Gold, real estate, stocks, art.", "score": 4, "replies": []}, {"body": "The market values asses at a certain valuation historically. One measure is P/E ratio which is within a certain range depending on company conditions, industry, interest rates etc.  So if earnings increase, there is a high chance that to maintain the average ratio the price may increase. There is no certainty anywhere, but this is how the market has valued such companies and you will see the price adjust accordingly. ", "score": 1, "replies": []}]}]}, {"body": "Stocks are priced on the possibility of 2 things. Voting power and dividend. Even if there is none of any of them in a stock, the future prospects make the stock valuable. Acquisitions can inxeesd future revenue stream which increases the potential future value for shareholders ", "score": 1, "replies": []}]}]}, {"body": "A lot of people love buying Berkshire specifically because they don't pay dividends. If you are retired, you can simply not sell any shares of the stock and you won't be taxed a penny unless you decide to do so. It's like strategically deciding when you need money / want to pay taxes.  ", "score": 8, "replies": [{"body": "but if berkshire goes down you earned nothing over all the years you owned it. the same cannot be said for a company that has paid you a (compounded) dividend for decades.", "score": -2, "replies": [{"body": "\"But if Berkshire goes down\" - short term it may, but if you gave Buffett 10k in 1965, it would be close to 100m today. What you are saying is correct, but it's hard to bet against the man.", "score": 11, "replies": [{"body": "I wouldn't bet against him...but he's not going to be around forever.", "score": 4, "replies": [{"body": "what are you talking about. he's a god ", "score": 3, "replies": []}, {"body": "And Munger's even older. ", "score": 3, "replies": []}, {"body": "True, but Apple has seem to be okay without Jobs..", "score": 3, "replies": []}]}]}, {"body": "So just sell tiny portions of your holdings over time to mimic a dividend.", "score": 5, "replies": []}, {"body": "It's a bit of an investment philosophy. Do you want cash flow or want to grow paper gains. On top of that cash flow means taxation vs growth means deferred taxes (pay when you sell).\n\nBuffett said something along the lines of: a company that pays out dividend instead of retaining and reinvesting cash is a company that has run out of room/ideas to grow. Hence, BRK does not pay out a dividend, because he thinks they will continue to grow.\n\nOn the flip side Buffett said something about liking dividend paying companies.\n\nWhenever a dividend is paid out, the company is giving out a portion of its assets. When you hit the ex-dividend date the stock tends to dip. This is because the company is actually worth a little less as the cash of a paid out dividend is no longer part of the company.\n\nWhen you look at BRK the stock price is up because they are retaining the earnings and reinvesting it back into the business/making acquisitions to increase earnings instead of paying out cash to shareholders. All things being equal, if a dividend paying company did the same and retained cash, it theoretically would have a higher share price.\n\nSimple example, not getting into cash flow, debt, etc. Pretend you have a company with 1,000 shares each worth $1. This means your company is valued at $1,000. If you issued a dividend of $0.10 / share (x1000 shares = $100 dividend) then each share would be revalued downwards to $0.90 and hence (x1000 shares), your company is now worth $900 because you took out $100 of the company valued $1,000 in the form of dividends.\n\nAs for why people would buy a company that didn't pay out dividends there's the tax reason and retained earnings/growth aspect. How could you extract value/cash flow from a company that doesn't pay dividends? You could try writing options on the holding or use it as collateral to borrow funds to invest in other companies.", "score": 2, "replies": []}, {"body": "Depends how far it went down, the dividend %, the taxes on those dividends\n\nIf a company is going down for decades  what are you dripping or even owning the stock for?", "score": 1, "replies": []}]}]}, {"body": "The businesses they own can also increase profits. I think what you might be missing when it comes to stock is that you own a part of the company. \n\nSay a company liquidates its assets for whatever reason, after they pay off debts and preferred shareholders, common stock holders are paid.  Your stock value is tied to the company’s assets. ", "score": 1, "replies": []}]}]}, {"body": "He needs to buy up a bunch of gun companies and shut em down", "score": -5, "replies": []}, {"body": "[deleted]", "score": -11, "replies": [{"body": "What? BRK is half of AAPL. AAPL can buy BRK not the other way.", "score": 10, "replies": [{"body": "Maybe he was talking about an apple.", "score": 13, "replies": [{"body": "Red or Green. ", "score": 1, "replies": []}]}]}]}]}
