{"title": "So about Disney...", "selftext": "Have any of you guys put in DIS calls yet? Or are you waiting for a more secure sign of a reversal to an uptrend? I've been studying the candle chart and there was a pretty big hammer on 8/06. Plus the RSI says its mostly undervalued as of now. What do you think?", "id": "3g9t4m", "created_utc": 1439061413.0, "score": 6, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "just to be clear, RSI doesnt determine whether or not a company is 'undervalued' or have anything to do really with the valuation. It's oversold or undersold, and those can be completely justified based off of the valuation or not, but it's not an indicator of the true valuation.\n", "score": 5, "replies": [{"body": "Ah, true. I stand corrected. My mistake ", "score": 2, "replies": [{"body": "No worries i just wanted to make sure you understood that. RSI is an indicator but it unfortunately cant tell us valuation lol", "score": 2, "replies": [{"body": "I won't pretend to be an expert haha, I'm still really knew! Is there any indicator of true valuation?", "score": 1, "replies": [{"body": "nah nothing can give you a picture of that unless you know Fundamental Analysis and Accounting pretty well. \n\nThats why analysts get paid by big banks like JPM UBS and GS to come up with valuation models and what not. Theres no valuation indicator.", "score": 2, "replies": []}]}]}]}]}, {"body": "Bought in $130 calls for Jan @$1", "score": 3, "replies": []}, {"body": "Yes.", "score": 2, "replies": [{"body": "Good to know ", "score": 1, "replies": []}]}, {"body": "I actually had 120 calls pre-earnings.. And decided to hold. Fml", "score": 2, "replies": [{"body": "Sorry man", "score": 1, "replies": []}]}, {"body": "I will make a short put vertical spread for August 21st ! ", "score": 1, "replies": []}, {"body": "I got a bunch of $120 calls on Thursday morning. Bit of a falling knife for most of it, was able to avg down slightly, currently sitting at a small gain. ", "score": 0, "replies": []}]}
{"title": "AAPL investors", "selftext": "[deleted]", "id": "3g9sh8", "created_utc": 1439061065.0, "score": 98, "upvote_ratio": 0.88, "num_comments": 13, "comments": [{"body": "[$AAPL short sellers vs $AAPL investors](http://i.imgur.com/RkqLtDW.gif)", "score": 18, "replies": []}, {"body": "You mean traders?\n\nMy dollar averaged cost on AAPL is in the mid 400s, and before that it was in the 110-150 range. I've been laughing all the way to the bank since the 2008 crash =D", "score": 16, "replies": [{"body": "I bought initial shares in 1994 at around $0.50 per share split adjusted and still have incredible average cost pricing with future purchases of the stock at higher rates. I have been adding more this week on the dip. The fundamentals on this stock are still incredibly good.", "score": 13, "replies": []}, {"body": "Exactly. I bought it in 08 at 98. ", "score": 3, "replies": []}, {"body": "I am guessing those are before split prices? ", "score": 3, "replies": []}]}, {"body": "quality post", "score": 6, "replies": []}, {"body": "RIP in peace ", "score": 4, "replies": []}, {"body": "Why? Is there some news that came out recently and i missed it?", "score": 2, "replies": [{"body": "Just a shitty quarter, only $50B revenue and $11B profit...total wiff :(\n ", "score": 14, "replies": [{"body": "They might as well declare bankruptcy now...", "score": 12, "replies": []}]}]}, {"body": "Just bought my Sep 120/125 1x2 spread, looking forward to my return ", "score": 1, "replies": []}, {"body": "lol", "score": -2, "replies": []}, {"body": "/r/youareverydumb", "score": -9, "replies": []}]}
