{"title": "Big tech lawsuits and reform coming soon apparently", "selftext": "In the article below, it mentions the justice department is about to file several antitrust lawsuits against google and Apple and others. Plus executive action and/or senate law changes against big tech. \n\nI’ve been reading about these for a while now.  Not sure how much, if any, will affect the stock price of apple, google, meta, Amazon but it might be significant.\n\nEdit: the article title is very clickbait (as usual), info in it seems very important. Senate hurrying up to pass big tech legislation and justice dept finally filing these lawsuits in the upcoming weeks. \n\n\nhttps://www.marketwatch.com/story/biden-finalized-his-plan-to-reign-in-big-tech-big-tech-wasnt-invited-11662754059?siteid=yhoof2&yptr=yahoo", "id": "xbvhl3", "created_utc": 1662934619.0, "score": 158, "upvote_ratio": 0.86, "num_comments": 71, "comments": [{"body": "I feel like I hear this every year and nothing happens", "score": 139, "replies": [{"body": "It's an election year.. they won't actually do anything as those are big time donors.. but they will shake some branches.. make a few speeches and nothing of any real substance will happen.. this happens every 2 years.. it just a different group.. they kinda rotate them per cycle", "score": 49, "replies": [{"body": "Good to see people seeing through their shit. Don't buy into it.", "score": 11, "replies": []}]}, {"body": "Didn’t something similar happen to Microsoft and took like a decade to play out in court?", "score": 6, "replies": [{"body": "Actually in the US nothing happend and in the EU they were forced to give a choice on browser.\n\nEnd result is Google won the browser war with almost the exact same percent of market share in the EU and the US.\n\nhttps://gs.statcounter.com/browser-market-share/desktop/united-states-of-america\n\nhttps://gs.statcounter.com/browser-market-share/desktop/europe\n\n\nWe get a kind of A/B test of sorts and shows that it makes ZERO difference.\n\nA perfect example would be search.   Force Apple to give a choice in the EU when you first turn on your iPhone and don't in the US.\n\n\nI am willing to bet Google would still have 92%+ market share in both regions.", "score": 2, "replies": []}, {"body": "Spotify filed complaint against Apple in EU for antitrust behaviour in 2019, just charging Apple took 2 years lol", "score": 2, "replies": []}]}, {"body": "Ioii", "score": 1, "replies": []}]}, {"body": "In the information age, these companies might be as important as advanced military weaponry. The data collection + surveillance they could offer government is unprecedented. It's basically impossible to use the internet without interacting with at least one of them. Combine that with the amount of money they spend on lobbying and I'd be surprised to see anything happen.\n\nIt'd be nice to not have everything in the control of a small handful of companies and I support disrupting their ongoing invasion of individuals' privacy, but I'm doubtful we see reform.", "score": 25, "replies": [{"body": "The problem is tech often forms natural monopolies overtime due to synergies and benefits to the consumer & market for doing so. So even if you break up these big companies, someone else will inevitably end up acquiring their near monopoly position sooner or later.\n\nTake OSes for example. It would be a giant pain for software developers if 5 different OSes all held near equal percentages of the desktop PC market share, and then another 5 different OSes were all just as popular as each other in the phone and tablet market. Developers would probably have to put in a lot more extra work to get their software to work on multiple extra OSes, or leave a large portion of the market untapped. \n\nSo from the government's perspective a break up of those companies wouldn't really work. The better solution for the government would be regulating them and preventing them from doing things the government considers abusive.", "score": 18, "replies": []}, {"body": "With midterms looming, the idea of a “win” might get something done. Doubt it would be as big as what Europeans would do.", "score": 1, "replies": [{"body": "“Wins” don’t get voters to the booth. Wins get folks to be satisfied and stay home. \n\nSaying “We were totally going to bend Google over but those evil Republicans/Democrats (interchangeable really) prevented us! Vote for us and we’ll totally do it next session!” Is what gets folks to vote.", "score": 1, "replies": []}]}]}, {"body": "This was supposed to happen for awhile. Honestly I couldn’t care less as this will take years and unless the gov has an ace in the hole will probably end up settled for a chunk of money and the stocks will pop.", "score": 46, "replies": [{"body": "I know, I think even before 2020 there was talk about passing legislation.\nThe anti trust is a little more new imo.  I do remember a few mentions but kinda faded away.\n\nThe App Store for Apple could be a big issue since there’s a big chunk of service revenue that comes from there. With that said, Apple is getting revéd up to do more ad sales biz. \nPlus all that cash they have.", "score": 5, "replies": [{"body": "You do realize Apple already won 9 of 10 arguments on the App Store including that they are not a monopoly? I would not be surprised if the appeal makes it 10 of 10.", "score": 5, "replies": []}, {"body": "Apple is chump change. Google being challenged on search is such a larger issue. The vast majority of the world uses Google to search for everything. The app store is a small concern compared to “we decide what information to show you any time you search for things on the internet, plus cross reference that search against your life and sell that info.” You think it’s bad that Facebook knows what your friends like? Google knows every friend you email, every company who sends you email receipts, and every thing you search on the internet. Oh, and you use their in-house web browser.", "score": 7, "replies": []}]}, {"body": "That was before Lina Khan", "score": 0, "replies": []}]}, {"body": "Breaking up companies usually benefits the investor. Sum of all parts are usually worth more than its whole. Then you can also sell those portions of the company you don’t like.", "score": 25, "replies": [{"body": "Breaking up Standard sent Rockefellers, and his investor's, wealth into the stratosphere. \n\nSadly i'm thinking they're more interested in just leveling shit tons of fines on tech. Government just wants its cut.", "score": 11, "replies": [{"body": "You right, those companies are paying taxes.", "score": 2, "replies": []}, {"body": "Its going to be the targeting of misinformation.  They want to control the political narrative.", "score": -2, "replies": []}]}, {"body": "Not always. \n\nGoogle, YouTube and Android for example have a lot of synergies. YouTube may not even be able to survive independently. Breaking them up would hurt investors.", "score": 9, "replies": [{"body": "I didn’t say always, I said “usually”.\n\nYou think YouTube wouldn’t survive if split off?", "score": 9, "replies": [{"body": "Well it will certainly hit YouTube hard. Think about how much their ad revenue would go down without having access to Google account data, etc. That's extremely valuable for advertisers and allows Google to command a premium across its services.", "score": 2, "replies": [{"body": "Oh you think in a split off the companies would no longer do business with each other. Maybe YouTube would use AWS for cloud.", "score": 5, "replies": [{"body": "They'd probably be prohibited/restricted from doing so by the orders made in the anti trust proceeding.", "score": -1, "replies": [{"body": "You can’t restrict a company from being a consumer.  That’s not antitrust that’s fascism.", "score": -7, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Who benefits from splitting them up? It’s not Socialism, Communism, Capitalism, or a Free Market. It’s control by the government with the treat of violence. If you buy products and services from each other you will go to jail.", "score": -7, "replies": [{"body": "Anticompetitive cartels and monopolies hurt capitalism. Capitalism thrives with vibrant, competitive markets. Which is why there are extensive market practices which are prohibited such as monopolising or establishing cartels. \n\nThink about if Google banned your accounts tomorrow and indiscriminately stopped you from ever using their services again. How would you feel? Are you satisfied with the offerings of competitors and the ability of Google to do that at a whim? \n\nIn fact as companies grow larger they begin to resemble corporate statism, hearkening back to mid-century fascists such as Mussolini and Pinochet.", "score": 3, "replies": [{"body": "No problem if Alphabet shuts down on a whim, you can’t force anything to continue. We had a civil war over the issue.\n\nYes my day will be inconvenienced but that’s about it. I’ll find someone else to provide email service, I’ll watch my entertainment on a different platform, and I’ll use a search engine that gets me to where Google would get me just 10 seconds slower. \n\nThese companies don’t have militaries so slightly different then the governments that want to dictate their actions for the benefit of national security", "score": 0, "replies": [{"body": ">10 seconds slower.\n\nOr a couple of miliseconds faster, actually.", "score": 1, "replies": []}]}]}, {"body": "...", "score": 3, "replies": []}]}]}, {"body": "Nope, that's just an injuction.", "score": 2, "replies": []}]}]}]}]}, {"body": "YouTube survives due to ad monetization and a well paid legal team. Prove me wrong", "score": -6, "replies": [{"body": "YouTube survives because they produces a large amount of content at an extremely low cost.", "score": 8, "replies": [{"body": "Both things can be true. The amount of theoretically \"infringing\" content is...large", "score": 3, "replies": []}]}]}]}, {"body": "What? What is equivalent to YouTube? That’s never going away.", "score": 3, "replies": []}]}]}, {"body": "It is like a decade too late. I don’t even know what they can do anymore besides puny fines - if they even get that far.", "score": 6, "replies": [{"body": "Lina Khan is at the helm. That's a big difference.", "score": -4, "replies": [{"body": "Can you help me understand this difference?", "score": 3, "replies": [{"body": "She studied law at Yale.\nHer thesis about Amazon went viral \nhttps://en.wikipedia.org/wiki/Lina_Khan", "score": -3, "replies": []}]}, {"body": ">Lina Khan \n\nLOL. She will be ousted by a new administration before anything gets done.", "score": 5, "replies": []}, {"body": "https://youtu.be/iauuuhpSfRQ", "score": 1, "replies": [{"body": "Good one", "score": 0, "replies": []}]}]}, {"body": "When is it not? The browser war legislation...a decade too late, Microsoft and Intel's \"per unit PC tax\" a decade too late x2", "score": 1, "replies": []}]}, {"body": "Again? Sure", "score": 3, "replies": []}, {"body": "The irony is that the big tech companies have been lobbying for this. It’s much better for investors when a company breaks up. Even more advantageous when it comes to building that process with the government and having tax advantages that otherwise are not available if done privately.\n\nThis will hurt the companies in the short term, but will be a great buy on the dip", "score": 3, "replies": []}, {"body": "The big bad gov now wanna take control of all the personal data we have? Wow, this is big news", "score": 3, "replies": []}, {"body": "I doubt much will change. Tech companies lobby big. Slap on the wrist for minimal compliance", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "> Besides, Apple is untouchable.\n\nI do not think anything will happen.  But one thing that has changed is Apple and I would no longer say if it did that they are \"untouchable\".\n\nWhat changed is they now have material market share.   Apple tends to be very anti-competitive.   So for example with Google you can use whatever app store you want but with Apple you can NOT.\n\nWith Google they allow sideloading but with Apple you can NOT.\n\nOr the biggest one that is an actual issue for me.   Google allows you to use whatever browser you want and Apple will NOT allow any other browser on iOS.  Only skins.\n\nApple had cover before because they had so little market share.  But that is just not the case any longer.\n\nBTW, I do not think any of these things would make a material financial difference to Apple if they were forced to change.  But the one that would in the US is if Apple was forced to allow interoperability with iMessages.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I agree.   But I think if one is gone after it will more like be Apple than it was in the past.", "score": 1, "replies": []}]}]}]}, {"body": "Ahahahaha This dog and pony show again. Yeah, no, nothing will happen. \n\nCorporations own America.", "score": 2, "replies": []}, {"body": "I think one of the big issues here is that the DOJ essentially already went through this with Microsoft. It didn't really work out well for either party. It was really a shit show for the DOJ who ultimately dropped the case during appeals court and took a settlement instead. Microsoft leadership was bogged down with this and it hurt the company for nearly a decade.\n\nLobbying aside, does the government/DOJ really want to start dismantling these huge economic engines of America? I firmly believe these companies should be far more regulated than they are but I can't help but see more lose-lose situations if the DOJ goes full anti-trust.", "score": 2, "replies": [{"body": "I agree. Seems most likely they’ll get some rule in place related to privacy and some competition stuff the public doesn’t know about. \nThe App Store seems significant but at the same time everyone uses it anyways so its not like The average consumer will go out of his way to side load apps. \nAnd apples advertising push might be exactly for this reason. Keep developers pushing their users to download from the App Store ecosystem.\nGoogles privacy or data between apps might hit them harder. But maybe they reach a compromise.\nBut these old geezers dont see these apps being like a real company. \nIf it was more analog to the old days, meta would be forced to sepaRate fb, ig and whatsapp. Same as google search, YouTube and email. And so on. Each one of those apps are a massive company on its own. \nBut so far I think itll be some regulation that wont affect them much. But the stock might move abruptly at first.", "score": 2, "replies": []}]}, {"body": "One important aspect of big tech monopoly is manpower. They are able to poach and recruit best of the best college grads based on sbc (mega cap of these companies helps a lot to not dilute more than 5 pct even though they are paying millions in sbc). Private and small firms cannot compete.", "score": 2, "replies": []}, {"body": "Apples court date is already schedule for Oct21. The DOJ already filed it with the epic games suite", "score": 2, "replies": []}, {"body": "So, in the wake of Zuckerberg revealing that the FBI helped lid a story in an election year to benefit a candidate, this news story leaks. The state actor argument has never been more ripe than it is now for suits against tech companies as publishers and for 1A violations (based on state actor theories).\n\nExecutive order is kind of funny because people don't understand how limited they are (constitutionally, but they're abused like the CDC eviction moratorium).\n\nExpect any proposed legislation to be narrow in scope and ineffective. Democrats threaten social media to ensure compliance with censorship (sorry, \"content moderation\") and conservatives don't do anything when they get the chance because it would remove a victim whine from their toolkit.\n\nExpect minimal impact, some paperwork shuffling, and maybe an entity spinoff here or there at best.", "score": 1, "replies": []}, {"body": "you're cute", "score": -5, "replies": [{"body": "How to do you know that", "score": 0, "replies": []}]}, {"body": "These lawsuits aren't uncommon, doubt it will affect the companies much.", "score": 1, "replies": []}, {"body": "Oh man..I know now how conflict of interest feels like..On the one hand I know something needs to be done to regulate the concentration of internet in the hands of 2 or 3 megacaps..on the other hand I own those in my portfolio..\nWhat's a good hedge? All cap weighted etfs will go down a little..Google and Facebook are a lot more susceptible to regulation here IMO cause they're software only and bad trade practices lead to a lot of their revenue..Then there's the whole CHIPS act and bringing chips manufacturing to USA..those will likely be more expensive than the ones made in China leading to lower profit margins for Apple and other companies sensitive to chip prices..Interesting times ahead..", "score": 1, "replies": []}, {"body": "Heard this for a long time. Big tech has too much money and these politicians only want that", "score": 1, "replies": []}, {"body": "They're big boys, they have lots of lawyers.   They will deal with it.", "score": 1, "replies": []}, {"body": "That's cute. Like big gov is going to do anything to reign in big tech who owns all the politicians it needs. It's just election fundraising.", "score": 1, "replies": []}, {"body": "The individuals in charge of this effort on the Gov side are a bunch of losers that will not accomplish anything.", "score": 1, "replies": []}, {"body": "Gov \"or else\" sabre rattling for campaign contributions.", "score": 1, "replies": []}, {"body": "Highly doubt they will do anything that is material.\n\nLucky for investors is that the GOP is obsessed with a wrong interpretation of the first amendment.  Which means we get gridlock which is a good thing here, IMHO.\n\nBut what the mega tech companies should be doing is pour on the fear mongering.   That is how you get left alone.\n\nPush the narrative that the China are going to crush the US if the tech companies are not given free reign.\n\nHeck if you do it enough maybe you can convince them to ban TicTok which would help the mega tech comapanies and even more the smaller ones like Snap and Twitter.", "score": 1, "replies": []}, {"body": "Finally, let's hope it will be the end of this fang regime.", "score": 1, "replies": []}]}
