{"title": "I want in on the meme money", "selftext": "I have been trying to piece together the strategy on WSB and I am still pretty lost. I have only been investing for a few months and was taking it seriously but I see all these \"to the moon\" posts and wanna know how that is done. \n\nFrom what I have gathered people do puts (which are like a temporary fraction of a share ownership?) and pick a mostly random date that it ends on.\n\nI have mainly been using E-Trade but I just made a Robinhood account to try out this high risk high reward style after seeing a post featuring Jim Cramer raging that people on reddit [WSB] \"always win\". \n\nThe companies that seem to be working right now with the short term strategies are Tesla, NIO, PLTR, and several others that I am unsure of but there is more or less a general consensus on those 3.\n\nOn Robinhood, say I wanna try this with Tesla. I select an option or something? Any help or tips would be appreciated. I'd rather not risk more than a couple hundred bucks on this either. My personal rule is to not gamble with money that I need or wouldn't mind losing. Is there a minimum amount you need?\n\nI wanna go to the moon but don't have a rocket yet.", "id": "k0g1x9", "created_utc": 1606259390.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "Watch some YouTube dude", "score": 6, "replies": [{"body": "will do thanks, any channels you like in particular?", "score": 1, "replies": [{"body": "I would just search for option basics if you want to yolo, learn more about the greeks if you want to be sophisticated", "score": 2, "replies": [{"body": "thanks, I will google and youtube that", "score": 1, "replies": []}]}, {"body": "Checkout in the money’s channel", "score": 2, "replies": [{"body": "that \"robinhood for beginners video\" of his looks perfect! Just what I was looking for, thank you!", "score": 2, "replies": []}]}]}]}, {"body": "Calls seems to be the way to do it. Buy 3-5 weeks out and pray it goes up. If they go up, it prints. Goes down, you just lose what you pay up front. Gotta risk it for the biscuit. I have a 100% print rate\n\nDisclaimer: I have only tried one time with the meme stock of the month", "score": 5, "replies": [{"body": "That is great, thank you for the explanation. Is there a reason that you would do 3 weeks rather than 5? Is that assuming that it will drop soon so you would wanna cash out sooner rather than later?\n\nCongrats on the 100% wins thus far!", "score": 1, "replies": [{"body": "Some people go all in on calls that expire in a day or two", "score": 2, "replies": [{"body": "Ah and that is a lot riskier? Or would it be less risky?", "score": 1, "replies": [{"body": "Fuckin DON'T. Unless you really like losing money. Buy something that isn't at all time highs, 3-5 months out, at the money or in the money and sell at least a month or two before expiry. \n\nWhy do you want to lose money? Because you're almost certainly going to. You're approaching this whole situation with the absolute worst mindset possible. Loaded with fomo and ignorance.", "score": 2, "replies": [{"body": "Definitely going to buy in the money and at least a month call. Now that you mention it 3 to 5 months sounds even better. Why something that isn't at all time highs? I was thinking Tesla because it actually seems pretty safe. Is Tesla going to drop soon you are predicting?", "score": 1, "replies": []}]}]}]}, {"body": "More time for it to go up, but the price per contract will be higher (you can sell anytime as long as there’s a buyer). Shorter time frame will (generally)  be cheaper, but riskier. Again, I know nothing but the bare basics and am surprised I didn’t fuck it up. I rolled 120 into just over 400 and could’ve made more if I wasn’t a vagina. You live and learn. I found some options basics posts on other subreddits that would be helpful if you just scroll for a bit", "score": 1, "replies": [{"body": "I will search reddit for options basics. Googling it too. I appreciate you breaking it down a bit. Looks like I have a lot of studying to do. Good luck to you buddy", "score": 2, "replies": [{"body": "Cheers! If I find any good info, I’ll DM", "score": 2, "replies": [{"body": "Sweet, thanks man. I watched a video of this guy explaining all the terminology of buying options and so much stuff makes sense now. It's like another language but with the definitions it is like a translator. The video is a little over an hour, I took notes on it. Here is the link if you wanna check it out too https://www.youtube.com/watch?v=SD7sw0bf1ms&t=5s", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "How far for TSLA?", "selftext": "I've been watching TSLA for a while, and it keeps going up and up. On one hand, it seems like a fun investment with a lot of momentum, however as a novice trader it seems a bit TOO good, if that makes sense.\nRealistically, where do you, the more experienced traders of reddit, think it will finally level off?", "id": "k0dr5u", "created_utc": 1606251891.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 12, "comments": [{"body": "Holding long", "score": 8, "replies": [{"body": "Any particular rationale? Just trying to learn what other people watch for", "score": 1, "replies": []}]}, {"body": "As a big Tesla doubter for years, that \"TOO good\" feeling just won't go away.  They continue to innovate and people love their product.  I don't see them slowing down.", "score": 3, "replies": []}, {"body": "I don’t think it‘s gonna cool off anytime soon. TESLA is on it’s way to become a 4 trillion dollar company.", "score": 3, "replies": [{"body": "Why 4 trillion?", "score": 1, "replies": [{"body": "They’re just BSin there isn’t any reason for Tesla to be a 1 trillion dollar company not even 4. The market of the entire auto industry is almost 1 trillion alone and Tesla is half of that. The market is acting obnoxious and it will stay that way for a while. All these comments are FOMO because of the sweet sweet earnings they missed out on", "score": 2, "replies": [{"body": "Tesla is not concentrated on cars only. They have plenty of other „green“ projects. Time horizon for this assumption is 20+ years.", "score": 2, "replies": []}]}]}]}, {"body": " I hold long and but options on every piece of big news", "score": 2, "replies": [{"body": "is there a benefit to doing both?", "score": 1, "replies": [{"body": "I won’t lose money after I’ve made more money through stocks I’ve been able to trade options with the profit", "score": 2, "replies": []}]}]}, {"body": "Tesla's ascend has only started\n\nUK just set a deadline for banning petrol and diesel cars by 2030\n\nTheir sales will go through the roof in a few years and today's valuation will be insignificant", "score": 1, "replies": []}, {"body": "if you are investing hold TLSA till you die, instead if you are trading sold a % of your holdings  at x price level to take gains and reduce risk on your trade", "score": 1, "replies": []}]}
{"title": "Im underaged and i want to trade!", "selftext": "Hi,\nIm a 16 year old boy who's trying to get into trading stocks. I have had this dream for almost half a year now and I have been trying to get my parents(father) to create an account for me. This has sadly never happened eaven after days of reminding him, telling him what i want to buy an so forth.\nWell now this stock that i have wanted to buy (not tesla)for a long time has risen by 30% in a week. I feel like im loosing free money, but my father still says \"ye we should do it\" but guess what... nothing happens. Is there any way for me to create a trading account of my own? Can you give me any tips that i could use to get my father to do something? Thanks!", "id": "k0e8d9", "created_utc": 1606253373.0, "score": 0, "upvote_ratio": 0.22, "num_comments": 17, "comments": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Oh\nFk me lmao", "score": 2, "replies": []}]}, {"body": "I was the same about bitcoin before it spike to like 20k or whatever", "score": 3, "replies": [{"body": "I think many can relate😁", "score": 1, "replies": [{"body": "Too young to invest", "score": 2, "replies": [{"body": "Ye its so shit when you see your stock just slowly rise day by day and you can't do anything about it", "score": 1, "replies": []}]}]}]}, {"body": "My suggestion is to create a paper account with your dad. Show him what you want to purchase and why. Right down the date and time of your “purchases” and have him initial or something to prove your decision. Keep track and in a month or 2 or 3 both of you look at the pricing and see how you did. If you do well, he might decide to help you open an account. It can be done. I have an account for each of my kids. They want to buy Roblox when it goes public. Make it fun for both of you. Good luck on your endeavors", "score": 2, "replies": [{"body": "Thanks ☺️", "score": 1, "replies": []}]}, {"body": "If you aren't paper trading, start with that. There will always be more opportunities.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks ill try👍", "score": 1, "replies": []}]}, {"body": "You’ll shoot your eye out kid!!!!\n\n😂😂😂\n\n\nSounds like you missed the bus on one pick but trust me, a new bus comes by every day. No FOMO, I repeat, no FOMO, the way I see it you have two options, convince your dad with proof you have what it takes by starting a paper trading account and growing it. Your success and motivation may convince him to help you get started. Or you can commit to studying and paper trading until your old enough yourself. Either way it’s a win for you. Sounds like you found a decent pick this week. Good job!! But get ready for some bad ones as well. Trust me they will come. Your Dad May know this and is reluctant to throw you to the dogs. If you can prove your ability over a period of times he may get off his poot cannon and help you out. \n\nGLTY", "score": 2, "replies": [{"body": "🙌", "score": 1, "replies": []}]}, {"body": "Tell your dad he can just open a Schwab brokerage account, put whatever amount of money he wants you to gamble with and let you go ham. He can set the account so there's no margin and no options for you to lose the house on (and in any case, Schwab has a tier system where they need to approve you for options anyway). They have no commissions on small trades and StreetSmart Edges give you a crapload of learning tools.", "score": 2, "replies": []}, {"body": "Focus on academics, and sports. Hard truth is that the only asset you should be managing at the moment is your time. Educate yourself, work on your fitness and social skills, and mature a general hierarchy as to how much time & effort to allocate where and when. These are the tools which will make you successful in trading stocks, as well as in life.", "score": 4, "replies": []}, {"body": "Firstly, I would greatly recommend creating a paper trading account on something like TD or investopedia stock sim, as it can help alleviate a lot of early mistakes (you will still make a bunch anyways, but less so) and can allow you to interact with the markets risk-free\n\nIf you do well on the paper trading account, it is also likely that your father would have a greater impetus to open the account for you\n\nOne thing I will say is though that typically stocks that move in that manner are extremely unstable, and it is difficult to consistently make money off of those types of hype-based plays. Most people lose money day trading, and almost everyone loses money trading penny stocks.", "score": 1, "replies": []}, {"body": "I would do paper trading. I'm 15 and I've been doing paper trading for a couple years now. I have also found it useful to take some business finance courses. You can find a lot of free ones from great schools like Columbia University or Imperial College on edx.org.", "score": 1, "replies": [{"body": "**I found links in your comment that were not hyperlinked:**\n\n* [edx.org](https://edx.org)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20gdiaupr&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3", "score": 1, "replies": []}]}, {"body": "Trading stocks is like going to the casino. You have to be willing to lose some to win some but the house always wins. There are those with a magic touch and can't ever lose much but stay on top. Those are the ones you should ask how they do it. Otherwise most of us are in it for the sport.", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Tuesday, Nov 24, 2020. Please enjoy!", "selftext": "**PsychoMarket Recap - Tuesday, November 24, 2020**\n\nStocks rallied today with market participants optimistic that an effective coronavirus vaccine can be deployed in the near term. The Dow Jones hit 30,000 points for the first time ever, extending a crazy rally of more than 10% in November. In spite the good news, the surge in coronavirus cases continues in the US.\n\nThe Dow Jones (DIA) finished the day 1.53% up, the Nasdaq (QQQ) finished 1.41% up and the S&P 500 (SPY) finished 1.61%. Overall a great day for the market.\n\nExpectations for relatively quick distribution of the vaccine has analysts upgrading their growth prospects for 2021. A fully inoculated public would bring back beaten-down industries, like travel and cruise lines, that were devastated by social distancing guidelines. As a result, market participants have rotated out of stay-at-home stocks like Zoom (ZM) and Peleton and into reopening and cyclical stocks. \n\nThe political uncertainty in the United States is beginning to clear up. Weeks after Joe Biden was declared President-Elect, General Service Administration (GSA) head Emily Murphy acknowledged Biden’s win and approved the official transition process. The GSA is a government agency that works largely behind the scenes to support other federal entities, with responsibility for managing federal office space, procuring supplies and improving the use of technology across the government. The GSA provides a presidential transition team with Washington office space and coordinates access to federal agencies to plan potential policy changes with current administration officials, using $6.3 million allocated to support its efforts. This will finally allow Biden’s team to gain access to crucial information needed to effectively govern the nation. Mark Haefele, UBS Global chief investment officer, said, “We believe that the recent reduction in political uncertainty in the U.S., though far from complete, is another supportive factor behind the recent stock rally,\n\nMarkets were also encouraged by Biden’s appointment of former Federal Reserve Chair Janet Yellen to Treasury  Secretary. Yellen served as Fed Chair from 2014-2018, helping steer the historic bull market that followed the 2008 recession.\n\nFinally, after four painful weeks, the surge in coronavirus infections are showing early signs of improvement. The national weekly average for daily new infections is 172,118, according to data from Johns Hopkins University. While that is an all-time record, it only represents an 11% increase to last week. In the past four weeks, average daily new infections were posting a roughly 30-40% increase every week. The daily average deaths are more than 1,500, similar level to early May.\n\n**Highlights**\n\n* Big banks were on fire today, performed very nicely today. Especially Wells Fargo (WFC). \n* Tesla (TSLA) reports that its new battery sells could give semitrucks more than 600 miles of range.\n* General Electric (GE) warned employees that more job cuts are coming to the conglomerate's jet-engine business because of the pandemic's impact on commercial air travel even with the promise of a vaccine on the horizon.  \n* Yunji (YJ), a membership-based, e-commerce platform, announced it had signed a cooperative framework agreement with Douyin, a live streaming platform owned by Bytedance.\n* Despite posting better-than-expected earnings, iClick (ICLK) fell 10% after opening 6% up in the day. This is one we like, keep it on your radar.\n* Elon Musk has surpassed Bill Gates to become the second richest person in the world, behind Jeff Bezos.\n* Urban Outfitters (URBN) with target raise by Barclays from $26 to $37. Stock currently around $31.\n* Extended Stay America (STAY) target raised by Barclays to $17 at OVERWEIGHT. Stock currently around $13.\n* Moderna (MRNA) target set by SVB Leerik at $60 at UNDERPERFORM. Huge downside given stock is around $100.\n* Honeywell (HON) target raised by Robert W Baird from $167 to $221. Stock currently around $204.\n* (ETSY) target raised by Wedbush from $165 to $170 at OUTPERFORM. Stock currently around $140.\n* Agilent Tech (A) with multiple target raises. Stock currently around $112.\n   * SVB Leerik at $120 OUTPERFORM\n   * Robert W Baird at $118 OUTPERFORM \n   * Wells Fargo (WFC) at $120 OVEREIGHT\n\n“I find the harder I work, the more luck I seem to have” - Thomas Jefferson", "id": "k0epo6", "created_utc": 1606254915.0, "score": 272, "upvote_ratio": 0.98, "num_comments": 17, "comments": [{"body": "Great summary and love the finishing quote nice job 👍🏾", "score": 13, "replies": [{"body": "thank you!", "score": 5, "replies": []}]}, {"body": "Excellent recap thank you for the summary :)  Hope you did well today!", "score": 7, "replies": []}, {"body": "Great report!", "score": 3, "replies": [{"body": "appreciate it", "score": 3, "replies": []}]}, {"body": "You should have a stock blog and be the next motley fool for Reddit.  Always a good read.", "score": 4, "replies": []}, {"body": "Iclk... frustrating", "score": 2, "replies": [{"body": "yeah can be frustrating with price action like that", "score": 1, "replies": [{"body": "bounce today :)", "score": 1, "replies": []}]}]}, {"body": "Applause’s for the excellent  Recap ..", "score": 2, "replies": []}, {"body": "All news and no crap. thank you u/psychotrader00", "score": 2, "replies": []}, {"body": "Send this out daily/weekly. A perfect read. I’d subscribe.", "score": 2, "replies": [{"body": "You can subscribe to a mailing list here   \n[http://psychotrader00.com/](http://psychotrader00.com/)", "score": 3, "replies": []}]}, {"body": "Beautiful recap! \n\nLoved the last quote.", "score": 1, "replies": []}, {"body": "Great summary, thank you for sharing!", "score": 1, "replies": []}, {"body": " Perfect  summary, good job. thanks", "score": 1, "replies": []}, {"body": "Thanks so much, I'm 14 and I've learned alot from your threads. I only have 10k in the market, (saved from soccer reffing and instagram promotions) and I've already made 30% since quarantine. your highlights contributed much.", "score": 1, "replies": []}]}
{"title": "Nio, pltr got my portfolio out of whack. Rebalance or let it ride?", "selftext": "So now nio, pltr and tesla is overweight in my portfolio. Those 3 are now worth over 50% of my entire portfolio of 14 stocks.\n\nDo nothing and let it ride? Rebalance? Add more ev companies?\n\nI'm sure once the ev bubble pops, it's going to drag nio and Tesla down", "id": "jzwqx0", "created_utc": 1606186704.0, "score": 12, "upvote_ratio": 0.79, "num_comments": 17, "comments": [{"body": "I'd rebalance by selling all that other junk and buying all tsla and nio.", "score": 17, "replies": [{"body": "A true believer", "score": 1, "replies": []}]}, {"body": "I got into NIO back in July when it was in the low teen's. I have no plans to sell until I've held it for a year. I have more unrealized gains in NIO than most Americans make in a year that I do not want taxed as income, considering I'm already a high income earner in California as it is. I have no reason to sell until I become a buyer in the housing market in 2022, and even then, I'll just sell my other stocks.", "score": 5, "replies": []}, {"body": "I would trim and rebalance.", "score": 3, "replies": []}, {"body": "I felt the exact same way as you when NIO hit $33 and I thought that was it, so i cashed out. I got back in after the Citron bullshit and plan on riding it", "score": 5, "replies": []}, {"body": "I'll probably regret it but I rebalanced.  Truth be told.  You'll make more money doing the opposite of what I do.  \n\nToday I sold NIO, WKHS, SBE, QFIN so they will all moon tomorrow.", "score": 6, "replies": [{"body": "Sold all?? I got NIO, WKHS, and SBE, the last few trading days in EVs have felt like Christmas but they are bound to dip here soon.. I’ll Sell once the dip comes but I couldnt while they’re so hot", "score": 3, "replies": [{"body": "what's your exit plan?  Stop loss or just decide when it has dipped enough?", "score": 1, "replies": [{"body": " I Buy and ”HOLD” like William Wallace, just keep holding until I feel the ground shaking and then make a move. I invest the way I gamble, I’m willing to lose whatever I put on the table, of course we don’t want to lose but that’s the game I play.", "score": 7, "replies": []}]}, {"body": "I sold about half of NIO.  Sold all of the others but I didn't have a ton of those.\n\n&#x200B;\n\nAs expected, QFIN and SBE mooned. NIO dropped some and WKHS is flat to a little down.", "score": 1, "replies": [{"body": "Tough day for NIO but I held it. Held all my Workhorse as well (I have the biggest love/hate relationship Workhorse) I can’t see NIO continuing to drop for too long, it’ll be back up to $55-60 next week.", "score": 1, "replies": [{"body": "I would've nibbled back in on both today if my funds were settled.  I also want to increase my position in SQ.", "score": 1, "replies": [{"body": "Lol, I actually sold all my SQ to buy SBE two weeks ago.. Of course SQ took off after the sell but SBE has been good to me.", "score": 1, "replies": [{"body": "Too funny.  I sold SBE (and others) to buy SQ.  I missed the big SBE jump day but did ok.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The league appreciates your sacrifice.", "score": 3, "replies": []}]}, {"body": "How old are you?\nWhat are your goals?\nWhat is your risk tolerance?\n\nDeciding how big your positions are is a critical question... I just watched Kyle Bass answer this same question here https://youtu.be/VzoN6YFoJ7w", "score": 3, "replies": []}, {"body": "This completely depends on your personal risk appetite. \n\nAlso depends on the other 14 stocks.", "score": 2, "replies": []}]}
{"title": "BABA brief bull case", "selftext": "Here’s info on BABA! \nBABA grew 9x since IPO in 2014 vs. only 3.8x for Amazon over the same time period.\n14, priced at $68, but the stock first began trading at $93 (9/19/2014). \nSince then the stock is up 230% in 6 years or 22% per year. \nTheir scale has now reached 1/6 of China’s total retail sales ($6 trillion). User growth in China has reached 780 million -\n one out of every two Chinese are now buying on Alibaba platform\nNot to mention the AliCloud, not to mention the rapid growth rate and china is just\nnow coming into the cloud space. AliBaba is set outperform. \n704.682 BN market cap, with a P/E of only 29 times earnings. Yahoo finance lists year\ntarget Est at 337 with a 45% est return. \nLast quarter they posted 509 BN in revenue, TTM is increased to 584 BN revenue\neven during the pandemic. Total assets have increased from 965 BN to 1.2 TRILLION.\nTotal debt 147 BN, with a free cash flow of 157 BN, and a total end cash\nposition of 318 BN. \n\nCompare this to Google, their free cash flow is 31 BN ttm, cash positon of 18 BN with \n15 BN in debt. \nCompare to Berkshite hathaway with a net debt of 39 BN, total debt 103 BN,  free cash flow 26 BN\ncash position of 27 BN.\n\nBABA is a bull, I absolutely reccomend BABA at this price. It's a large position in my\nportfolio. I have 272.5 call for this Friday we’re already at the strike price now after market. Next Friday 275 call. Hold the stock, buy it it’s a good price, long call, whatever you like. This is a thicc boi.", "id": "jzx3cu", "created_utc": 1606188036.0, "score": 18, "upvote_ratio": 0.87, "num_comments": 19, "comments": [{"body": "I think BABA is one of the few stocks with a solid business, and a low P/E ratio. I have long calls for April/2021.", "score": 12, "replies": []}, {"body": "BABA is great", "score": 9, "replies": []}, {"body": "Chinese stocks are usually undervalued on US market though, due to the risk. \n\n(Apparently not those EV stocks these days..)", "score": 4, "replies": []}, {"body": "BABA is too good at this price to be ignored. i just loaded up more", "score": 4, "replies": [{"body": "Hell yes you did!", "score": 2, "replies": []}]}, {"body": "I think BABA is worth the risk too and I'm holding it but there's a real bear case that's not there with American tech. Chinese government controls all their companies, nothing stopping them from destroying BABA to prop up something like Tencent or NIO if things aren't ran their way, and this is a major reason why BABA dipped from it's ATH to 250s because of Jack Ma.", "score": 4, "replies": [{"body": "I'm concerned about this as well. What about the risk of getting delisted on US stock exchanges?", "score": 3, "replies": []}]}, {"body": "Thank you I needed this. Because I was confused on today’s news regarding Alibaba and it’s new “regulations”. So long story short, you’re saying to hold and not sell BABA right ? Regardless of today’s news", "score": 3, "replies": [{"body": "Hold this bitch for a year you won’t be sad at a an average of 22% return YOY\nEven during pandemic they are soaring\nLook into their cloud business, China juuust got into cloud and has a way bigger market. The us cloud is currently 8x? Larger than chinas, yet\nBabas will dwarf ours and is growing extremely fast, a huge cash cow with 40% margins, if I recall correctly.", "score": 7, "replies": [{"body": "Thank you so much, I appreciate it", "score": 1, "replies": [{"body": "No worries friend. Stay strong 💪", "score": 1, "replies": []}]}]}, {"body": "Baba even before this post was a hold and not sell. It’s at a discount rn thanks to Jack. So get it while you can! Early Black Friday discount from Mister Ma", "score": 4, "replies": [{"body": "Thank you for ur advice", "score": 1, "replies": []}]}]}, {"body": "$272.5 call executed today at $5.75 ea at $277.17! Good day for baba! Up 2.75%  +$6.13", "score": 1, "replies": []}, {"body": "Relationship between Ma and CCP has been tense recently.", "score": 1, "replies": [{"body": "Good thing Ma isn’t the CEO anymore", "score": 9, "replies": []}]}, {"body": "You'd have better chance of succeed by putting your money into NIO or TSLA instead. As long as Xi is in power, BABA's development is limited. The Xi administration has effectively cock blocked BABA's pathway into fintech. This makes BABA seems more like a retailer/platform then a tech company. What? Ali Cloud you say? Dude, the ship's already sailed for cloud already. The cloud industry is too saturated with A+ tech companies competing.", "score": -4, "replies": []}, {"body": "What about the SEC plan to delist chinese companies? Pushing regulations?\n\n[https://www.google.com/amp/s/www.bloomberg.com/amp/news/articles/2020-11-17/sec-pushes-urgent-plan-that-could-delist-chinese-companies](https://www.google.com/amp/s/www.bloomberg.com/amp/news/articles/2020-11-17/sec-pushes-urgent-plan-that-could-delist-chinese-companies)", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "k05app", "created_utc": 1606225760.0, "score": 31, "upvote_ratio": 0.91, "num_comments": 14, "comments": [{"body": "Kind of ridiculous how NIO is up more than Tesla YTD despite Tesla getting past the two biggest challenges for a company already (getting to mass production and getting to profitability) while NIO hasn't.", "score": 8, "replies": [{"body": "Not really, Tesla is near the end of its growth phase. Nio is still in the middle of it. If this were to account for a 5 year growth half of these companies wouldn’t be on here and Tesla would up in the quadruple digits.", "score": 6, "replies": [{"body": "How is Tesla near the end of its growth phase when they're aiming up to increase production by 50% a year for another decade and they've only just started moving towards volume production for solar?", "score": 4, "replies": [{"body": "Tesla is reaching its mature phase as it just hit $500 Billion market cap and joined the S&P 500.", "score": 3, "replies": [{"body": "By that definition Amazon was near the end of its growth phase by mid 2017, I don't think that's reasonable.", "score": 3, "replies": [{"body": "As a company reaches a mature level, growth tapers off. Amazon's equity CAGR has left the thousands of percent and is now in the double digits, as the [Economies of Scale](https://www.investopedia.com/terms/e/economiesofscale.asp) dictates. \n\nLeaving a growth phase does not mean the company does not grow anymore. As it grows, it becomes harder to sustain the growth levels of its early years as it is much bigger now.", "score": 3, "replies": []}]}]}, {"body": "Exactly, Tesla still have at least 7-10 years of growth ahead", "score": 1, "replies": [{"body": "[Please read, I am so tired of explaining this to people](https://image.slidesharecdn.com/new249-130802070227-phpapp02/95/five-stages-of-business-growth-3-638.jpg?cb=1375427006)", "score": 3, "replies": []}, {"body": "And that's just in automotive. In software, energy, cargo and ride-hailing they may have even much longer growth ahead. I wouldn't even be surprised if they'd turn to aeronautics in 5-10 years' time.", "score": 2, "replies": []}]}]}]}, {"body": "Its all about the hype...", "score": 3, "replies": []}]}, {"body": "Appreciate you for doing this! Really helps visualize this sector better.", "score": 3, "replies": []}, {"body": "Great work", "score": 2, "replies": []}, {"body": "First time I've ever heard of a one year compound annual growth rate.....", "score": 1, "replies": [{"body": "It’s the norm on FactSet", "score": 1, "replies": []}]}]}
{"title": "DOW JONES INDUSTRIAL AVERAGE CROSSES 30,000 BENCHMARK", "selftext": "[https://finance.yahoo.com/news/stock-market-news-live-november-24-2020-233338198.html](https://finance.yahoo.com/news/stock-market-news-live-november-24-2020-233338198.html)\n\nThe Dow crossed a historic milestone today, with the 30 breaking 30,000 today.\n\nDo you think this momentum will carry over into December or will virus cases post-Thanksgiving cause it to shrink back below 30k?", "id": "k08suu", "created_utc": 1606237046.0, "score": 25, "upvote_ratio": 0.91, "num_comments": 20, "comments": [{"body": "I really can’t say. It’s amazing that it’s risen so much, it makes me nervous though on how high the market is currently. Anyone thinking we could have a bubble?", "score": 18, "replies": [{"body": "It is a bubble but this market is so manipulated its hard to tell anymore.\n\nAlso the fucking FED destroyed the bond markets.", "score": 4, "replies": [{"body": "We're at the point where the market is so full of dumb money it can justify its own idiocy. Which terrifies me. Companies not worth anything getting so much money thrown at them that they actually, somehow, become viable. It's like giving some methed out homeless man a billion dollars and watching him become a tech giant. Like, how does one even respond to such insanity?", "score": 9, "replies": [{"body": "I mean, if you give a methed out homeless man a BILLION dollars, he kinda has no choice but to become some kind of industry giant.  But maybe that's your point.", "score": 1, "replies": []}]}, {"body": "10% of my Roth is in bond. They have moved a tiny bit because of global bond markets.", "score": 2, "replies": []}]}, {"body": "It could easily go another 10%, but at the same it can go down 30% and I won’t bat an eye \n\nEnd of the day, I’m holding", "score": 2, "replies": []}, {"body": "I think people are escaping fiat currency. We (the US) printed tons of it during this pandemic.", "score": 1, "replies": []}]}, {"body": "Recession, pandemic, unemployment, businesses closed => stock market at all the time high.", "score": 19, "replies": [{"body": "it really clarifies the economic value of the average american doesn’t it...\n\ni continue to be shocked by how low it is.", "score": 5, "replies": []}]}, {"body": "All the people who sold in October to “buy the post election dip” are absolutely seething right now lmao.", "score": 3, "replies": []}, {"body": "I thought the market was going to crash and old people were going to have their air conditioners taken away if Biden won? I’m so confused", "score": 9, "replies": [{"body": "Well, big money have spoken and they want Biden lol. Both candidates are so corporate that I don't think anything could've crashed the market but a Bernie Sanders candidacy. Not saying I oppose a Sanders platform. Getting corporate interest out of politics would be a nice change for once but big money never votes against their own interests so whatever/", "score": 4, "replies": []}, {"body": "Good thing I own carrier because then they’d have to buy more AC units.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 3, "replies": [{"body": "I mean its quite the accomplishment. \n\nI couldn't be happier.   I am up 120% since March.\n\nI'll exit my positions before Biden is in. and buy a house with my Trump winnings :)\n\nBiden cant touch me,   well besides raise my taxes a bit which he will,  but Trump got me enough cash in his 4 years to compensate for high Biden taxes for the rest of my  life.\n\nI'm happy. \n\nand on the plus side I can now cancel my cable that Trumps gone (they gunna lose so many ratings) , and I now have a reason to purchase my first firearms (Biden).\n\nill just vote straight red the rest of my life without even watching the news now. \n\n(and I voted Obama my first election)     Trump changed this country forever.\n\nand basically bought me my first house.\n\nthere is an entire generation of young professionals like myself.\n\nwe are not going anywhere  :)", "score": -9, "replies": [{"body": "Okay buddy 👍🏼", "score": 7, "replies": [{"body": "your first ever post?\n\nLOL!\n\nCheers  :)", "score": -5, "replies": []}]}]}]}, {"body": "🥳", "score": 1, "replies": []}, {"body": "For me it was interesting to see interest in big Tech jump as soon as Dow crossed its ATH. Algos? I dunno, but it definitely seems strange. I think the rotation might be complete..", "score": 1, "replies": []}]}
{"title": "Kind investors of Reddit, can you explain to me why isn't Pfizer going up?", "selftext": "Background: New to investing. Did some research on Pfizer some weeks ago and believed they were leading on COVID vaccine development. Not wrong in the end.\n\nI was expecting the price to go up quite significantly because of it (perhaps like 15%)? But since news on this Pfizer vaccine announced, the price has been steady at $34-$36, and no visible benefit derived from this breakthrough.\n\nMy other stocks have gone up but I couldn't seem to find any obvious rationale as to their increase (other than the market is generally going up).\n\nCan anyone kindly explain to me why Pfizer isn't going up? Thanks.\n\nI'm holding 40 shares atm.\n\nEdit: share position.", "id": "k0erz2", "created_utc": 1606255131.0, "score": 6, "upvote_ratio": 0.87, "num_comments": 12, "comments": [{"body": "The vaccines, from any and all companies, are not being priced for profit. Regardless, PFE is a good long-term hold with a strong dividend.", "score": 4, "replies": [{"body": ">PFE \n\nwould you say it's more a \"dividend\" stock rather than one for capital gain?", "score": 1, "replies": [{"body": "100%\n\nBe careful...Dividends *are* capital gains.", "score": 1, "replies": [{"body": "thanks! to be honest I was holding it in hopes of riding the wave of COVID vaccine breakthrough; seems not happening now...", "score": 1, "replies": []}]}]}, {"body": "> The vaccines, from any and all companies, are not being priced for profit.\n\nGood.", "score": 1, "replies": []}]}, {"body": "Pfizer is huge company. Takes a lot more to move the needle.", "score": 4, "replies": []}, {"body": "Pfizer is a massive company, where it would need a pretty insane amount of buys for it to affect stocks.\n\nIt shot up on announcement of vaccine by like 5-8% from what I remember, which is pretty significant considering how big the company is", "score": 5, "replies": []}, {"body": "It hit $40 today. Well.\n\nI sold at 36. Well.\n\nMoney. Well.", "score": 1, "replies": []}, {"body": "PFE did spike about 9% on the day of news. Then Amazon announced their online pharmacy and PFE took a hit.", "score": 1, "replies": []}, {"body": "I think they’s a hearing for emergency approval of the vaccine in mid December (Dec. 15th?), which is before moderna’s. I would be shocked if the FDA didn’t approve it. If they do, I’d expect a bounce then at least in the short term, however idk about long term prospects— the vaccine will help drug companies gain notoriety but probably not contribute much to profits.", "score": 1, "replies": []}, {"body": "a big pharma company means more than this. they make the vaccines so we can resume life and consume their products.", "score": 1, "replies": []}, {"body": "I also hold Pfizer stock. Part of the reason might be Pfizer spun off part of its business into a different company with a different ticker for regulatory reasons it seems.", "score": 1, "replies": []}]}
{"title": "Tesla Discovers Legal Loophole To Get Autopilot Approved | CarBuzz", "selftext": "", "id": "k09vy5", "created_utc": 1606240216.0, "score": 15, "upvote_ratio": 0.8, "num_comments": 15, "comments": [{"body": " TLDR: \"After doing its homework, Tesla realized the Dutch registration authority RDW is in charge of approving software updates not only for the Netherlands, but for the entire EU. Here's the loophole: this responsibility does not include software updates. Germany's Federal Motor Transport Authority (KBA) has no control on the matter.\" \n\n&#x200B;\n\nSeems there is some kind of mispelling, but my understanding is that the dutch authority approves the inital software only, so tesla is upgrading FSD after delivery to avoid having to get additional approvals. Is this right?", "score": 16, "replies": [{"body": "Don't underestimate European bureaucracy: my guess is that there will be many many legal hurdles to overcome before FSD is approved in all of EU", "score": 6, "replies": [{"body": "EU law is weird, often takes what is approved in one country as a precedent for the whole EU, this is how the current car makers get around some issues also, its not just tesla exploiting this.", "score": 3, "replies": []}]}, {"body": "For what it's worth, I am guessing the same as you", "score": 4, "replies": []}, {"body": "I think the article is regarding Autopilot, not FSD. Germany had said that Autopilot wasn't allowed because the name would give the impression of being fully autonomous. The same would apply to FSD though", "score": 2, "replies": []}]}, {"body": "Does EU not allow the old style \"Cruise Control\" on cars?  Where it just blindly moves forward at a locked speed?\n\nIf they've allowed that all these decades like the US has then there's absolutely no reason not to allow FSD/Autopilot which is a thousand times safer.  And if so it proves to me this is not about safety but lining someone's pockets with cash.", "score": 9, "replies": [{"body": "Yes, it allows it.", "score": 3, "replies": []}, {"body": "There's a lot of weird restrictions like lane changes have to be completed in x seconds after turning on the turn signal or must be aborted, wheel torque limited, acceleration limits.", "score": 1, "replies": []}]}, {"body": "Article is a bit meh. As a European, two things:  \n1. It's not the Dutch regulator responsible for the whole EU, it can be any regulator of any country. Once a car is approved in one EU country, the approval stands for every EU country. This is the point of the single market. Tesla could seek approval from a regulator that would approve it, if that exists.  \n2. It is not a good idea to use legal loopholes in the EU. You don't want the next EU law to plug the loophole and make everything a lot tighter. One problem with the EU is that if you anger just one country everyone else joins them, as long as they have nothing to lose.", "score": 1, "replies": [{"body": "The only way to plug those \"loopholes\" is to switch to a federal Europe.\n\nAnd you know that won't happen, look at this mess [https://en.wikipedia.org/wiki/Multi-speed\\_Europe](https://en.wikipedia.org/wiki/Multi-speed_Europe)\n\nBut great for tech startups.", "score": 3, "replies": [{"body": "Agree. We need tighter integration.", "score": 1, "replies": []}]}, {"body": "But every country in the EU is playing their own game against the others", "score": 1, "replies": []}]}, {"body": "A rather confusing article. It quotes:\n\n\"Tesla's latest software update includes autonomous lane change improvements for Autopilot. Tesla, not surprisingly, had no comment on the matter\"\n\nHas anyone in the EU gotten an update which allows autonomous lane changes?", "score": 1, "replies": []}]}
{"title": "LGVW - Butterfly pop will continue, ARK buying in", "selftext": "Well if you missed the pop for Butterfly, which is merging via a SPAC with LGVW, it popped again in AH as ARK released their daily fund updates showing they bought around $6m stock. \n\nIf you haven't heard of ARK, well they have a massive hard on for Tesla and more recently they bought Palantir. \n\nI reckon LGVW is heading to $20+. Position: 500 shares at $13.50.\n\nButterfly overview - [https://www.cnbc.com/2020/06/16/butterfly-network-disruptor-50.html](https://www.cnbc.com/2020/06/16/butterfly-network-disruptor-50.html) \n\n&#x200B;\n\nhttps://preview.redd.it/q120glqp53161.jpg?width=719&format=pjpg&auto=webp&s=8879d78ada33582a6409734ed72f882c6dfc0e1c", "id": "jzuox3", "created_utc": 1606179168.0, "score": 28, "upvote_ratio": 0.94, "num_comments": 20, "comments": [{"body": "I bought at 14.33 this morning, spent all day kicking myself for terrible timing - suddenly feeling pretty good during AH!", "score": 14, "replies": [{"body": "14.45 for me. I think we all had to wait on that contract to fill at the top this morning lol.\n\nI have 69 shares", "score": 4, "replies": [{"body": "I'm also 14.45.  With 700 shares.  I should've waited, but was worried it would just go straight to 15.\n\nAnd the worst fill I've had from Fidelity in a while, but it was still all my fault.", "score": 3, "replies": [{"body": "7.27% BB 💕", "score": 1, "replies": []}]}]}, {"body": "Yeah I bought in premarket last night and immediately lost money, so, happy with the ARK news. We've seen ARK buy a ton of IPOB too, so who knows if they will accumulate daily.", "score": 1, "replies": []}, {"body": "Same", "score": 1, "replies": []}, {"body": "Bought 50 shares at open and was seconds away from burning a day trade to offload it when I had lost $50 in 5 minutes immediately after and the drill seemed destined to run all day. Feeling *much* better about the buy and not panic offloading now too.", "score": 1, "replies": []}]}, {"body": "Isn't the options chain supposed to open pretty soon?", "score": 7, "replies": [{"body": "Hope so", "score": 3, "replies": []}]}, {"body": "$14 1k shares. \n\n—> 50 boys. \n\nIf all these other spacs like CIIC and SBE can run to 35-40, I don’t see why TF this can’t get to 50 with Ark Gates hype.", "score": 6, "replies": [{"body": "Fuck I might just buy another 500 premarket", "score": 2, "replies": [{"body": "Get in before the other hedge funds decide to copy Ark. \n\n\nHedge funds regularly check each other’s portfolio; and Ark has been incredibly hot in finance world with SQ, Teladoc, Tesla early picks; so much so that the other hedge fund managers under performed. \n\nThere’s a ton of big money pressure for other funds to pick up at risk of underperforming and their clients considering ditching them for Ark", "score": 4, "replies": []}]}]}, {"body": "Would you say it is worth getting in even if it opens above $15?", "score": 5, "replies": [{"body": "Well it closed at 15.50 so to open at 15 at least is likely. Its going to be volatile but I can't see 15 as being the ceiling on a stock that's backed by Bill Gates, made the CNBC top 50 disruptor list , and now has ARK buying.\nI'm trying not to come off as pumping it but there's some aspects I think will drive the stock higher at least in the short term. Plenty of SPACs have traded up to $20 prior to merger and beyond if there was good sentiment behind it. \n\nIf you want a bit more risk with lower capital, you can buy the warrants instead.", "score": 6, "replies": [{"body": "These SPAC stocks are always $10 from the go and then they merge with a company that wants to go public and from there the market prices the stock. So these always feel like sketchy penny stocks, but can turn into something real solid depending on the company. \n\nSBE ChargePoint is a great example because ChargePoint owns the EV charging market in North America with around 70%, I drive a Tesla and after super chargers ChargePoint is the best. \n\nThis ultrasound product seems incredibly disruptive and the product is incredibly affordable. I think this stock based on their current valuation should be around $30 a share, but hype might take it higher. Long term it should be higher, maybe they have other products to bring to market. But this seems solid.", "score": 1, "replies": []}]}]}, {"body": "Thanks", "score": 3, "replies": []}, {"body": "Bought 50 shares this morning.", "score": 3, "replies": []}, {"body": "I bought 300 at 14.12 early afternoon, and during power hour I revenged traded what I though was going to 100 additional shares, but TOS had the 300 in share count so I got another batch at 13.80 ish.  looking for 20 for the first half, and will probably keep the last 300 for a few years.  This feels like $EXAS where I got in for upper teens.", "score": 3, "replies": []}, {"body": "BFLY will be huge...I used to work for Rothberg in one of his restaurants. This man is a revolutionary...some of the best scientists in the field have flocked to shoreline CT to work for this guy. Butterfly has 700+ patents and will change the medical imaging game. The incubator that houses Butterfly, 4Catalyzer, also is innovating in the MRI, cancer treatment, COVID, and other spaces right now. This is going to make a huge dent in the ultrasound industry. I bought 95 shares today and will continue to buy more over the next few days", "score": 3, "replies": []}, {"body": "Hmmm", "score": 0, "replies": []}]}
{"title": "Why BYD is rarely mentioned here?", "selftext": "It's the top EV seller in China: [https://www.statista.com/statistics/976376/china-electric-vehicles-sales-by-oem/](https://www.statista.com/statistics/976376/china-electric-vehicles-sales-by-oem/) (H1 2020)\n\nthe second EV producer in the world: [https://cleantechnica.com/files/2020/02/Top-electric-vehicle-producers-companies-in-world-2019-CleanTechnica.png](https://cleantechnica.com/files/2020/02/Top-electric-vehicle-producers-companies-in-world-2019-CleanTechnica.png) (2019)\n\nIt produces various types of vehicles and sells electric buses to Europe: [https://www.bydeurope.com/news-cases-list](https://www.bydeurope.com/news-cases-list)\n\nIt designs and produces its own batteries; it's held by Berkshire Hathaway by about a quarter btw.\n\nIt's fundamentally and financially much better than Nio, how could its market cap get exceeded by Nio?", "id": "jzv87h", "created_utc": 1606181112.0, "score": 18, "upvote_ratio": 0.95, "num_comments": 10, "comments": [{"body": "Well now that you mention it.... autists assemble!!! Last one in, is a 🌈🐻", "score": 17, "replies": []}, {"body": "We don’t buy shares sir. This is a casino", "score": 12, "replies": []}, {"body": "You mean BYDDF?  The OTC company?\n\nThats why.", "score": 11, "replies": []}, {"body": "It just doesn’t sound cool like Nio. And there’s no X in the ticker.", "score": 5, "replies": []}, {"body": "because once people dig more into byd, they will realize the other's market cap is absurd", "score": 4, "replies": []}, {"body": "Otc.", "score": 3, "replies": []}, {"body": "🤫", "score": 3, "replies": []}, {"body": "Im in already. Stonks.", "score": 2, "replies": []}, {"body": "They make vegan cars too?", "score": 0, "replies": []}, {"body": "I think the OTC thing really is affecting it. Not sure why they can't just list on NASDAQ like all the other EV stonks so it can 🚀🚀🚀", "score": 1, "replies": []}]}
{"title": "$REGN; Covid Play, Recovery Play, TA play, Sheeple Play, absolute banger of a trade.", "selftext": "[deleted]", "id": "jzvloy", "created_utc": 1606182485.0, "score": 10, "upvote_ratio": 0.75, "num_comments": 13, "comments": [{"body": "if it was gonna pop off because of this, why didnt it pop off today?these news are old, nah?\nAnyways I actually believe in this play, I aint gonna put money in it but there's space in the market for both Regeneron and vaccines. different purposes.", "score": 9, "replies": [{"body": "Yeah I want to know why it didn’t pop today too. \n\nI heard the news last night and was eyeing it all day and was extremely underwhelmed by the response.", "score": 3, "replies": []}, {"body": "It's not a meme stock. It's also extremely high priced which keeps WSB retards and most retail traders from pumping it. It will, however, begin it's small climb back up, and once efficacy and distribution rolls out larger, it will begin to climb. Delta on contracts is 1:2 theta. It will print.", "score": 5, "replies": []}]}, {"body": "Regn was only popping off cause donald kept blabbering about it", "score": 2, "replies": [{"body": "It's met $500 in the past before Orange Man said anything about it", "score": 2, "replies": []}]}, {"body": "I made over 200k this year trading REGN calls on its way up to all time highs last summer and then proceeded to lose almost all of it in the last month as the stock got annihilated for no apparent reason and my calls expired one day before their emergency use authorization was announced. I am now obsessed with this stock and I will continue to YOLO on calls until I get my money back.", "score": 2, "replies": [{"body": "You are the man homie.", "score": 3, "replies": []}, {"body": "Strike?", "score": 1, "replies": [{"body": "I have some January $530 and $560. I might switch to February $540.", "score": 1, "replies": [{"body": "Yea February way safer and covers ER", "score": 2, "replies": []}]}]}, {"body": "No one cares", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on [the DD list](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da).\n\nDon't fuckin' misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. \n\nDD is for wall-of-text deep-dive Pepe Silvia shit. [Read this to learn how to do your own DD.](https://www.wallstreetoasis.com/forums/on-the-job-with-simple-as-my-research-process)\n\nPlease message [modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets&subject=DD%20Flair%20Abuse&message=Link%20to%20thread:) to report this DD if it is low quality, or violates the [Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "The Walrus who makes great plays agrees with you on REGN moving up from here.  https://twitter.com/WarlusTrades/status/1330303480410599426?s=19", "score": 1, "replies": []}]}
{"title": "Let's Keep This Bubble Growing (My first one of these videos, be nice. or not idgaf)", "selftext": "&#x200B;\n\nhttps://reddit.com/link/jzvoau/video/acax2fz3g3161/player", "id": "jzvoau", "created_utc": 1606182749.0, "score": 34, "upvote_ratio": 0.92, "num_comments": 13, "comments": [{"body": "‘I only buy shares’ 😂😂", "score": 9, "replies": [{"body": "I tried to include everyone", "score": 3, "replies": []}, {"body": "That’s me :) \n\nLet’s gooo r/investing", "score": 0, "replies": []}]}, {"body": "This was awesome", "score": 5, "replies": [{"body": "Thanks.", "score": 3, "replies": []}]}, {"body": "CIIG DD guy brought me on board lol", "score": 4, "replies": []}, {"body": "Nobody tell him\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "SBE shares!", "score": 3, "replies": []}, {"body": "This was actually pretty good! Should’ve slapped “TSLA shorts” next to gay bears but awesome nonetheless", "score": 3, "replies": [{"body": "Good idea. I wanted to do the emojis 🌈🐻 but couldn't figure out how to.", "score": 1, "replies": []}]}, {"body": "This feels like 2016 all over again...", "score": 3, "replies": []}, {"body": "THCB let's go 🚀🚀🚀", "score": 2, "replies": [{"body": "Hell ya brother!", "score": 1, "replies": []}]}]}
{"title": "I made a recovery stock video", "selftext": "[removed]", "id": "jzvogk", "created_utc": 1606182765.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "You look like a gay boy mixed with a fish\n\nWhat I think of your video to many steps to get to the video so I made up my own transcript in my head", "score": 7, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "i think shake shack is great buy", "score": -1, "replies": [{"body": "people that dislike what i wrote yet i made 5000 times what they did this year", "score": -2, "replies": [{"body": "unironically", "score": -1, "replies": []}]}]}, {"body": "not at all", "score": -2, "replies": []}]}, {"body": "Is this a joke", "score": 3, "replies": [{"body": "no", "score": -1, "replies": []}]}, {"body": "\"I wanna make like a financial YouTube\"", "score": 3, "replies": [{"body": "yes", "score": 1, "replies": []}]}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}]}
{"title": "LGVW SPAC", "selftext": "[deleted]", "id": "jzvugd", "created_utc": 1606183371.0, "score": 16, "upvote_ratio": 0.91, "num_comments": 16, "comments": [{"body": "“Tired of EV?” Umm no. Let me take this time to shill two of the greatest EV stock opportunities currently. \n\nTHCB, they have a strong chance to merge with a large ev battery manufacturer in China called Microvast. China? Ev? Moon. Best of all the stock is dirt cheap for a spac currently. Low risk high reward.\n\nThe next stock is ticker NBAC about to merge with company Nuvve. Ever heard of blink? Heard about SBE? Well this EV company is another competitor in the charging industry. Which means it’s about to moon. It’s also dirt cheap at around $12 currently.", "score": 20, "replies": [{"body": "This fuckin dude with the EV plug 💀💀💀", "score": 7, "replies": []}]}, {"body": "$LGVW accounts for 20% of my portfolio. \n\nThis company is amazing. Butterfly basically put an ultrasound machine on an iPhone.", "score": 4, "replies": []}, {"body": "PLTR TO THE MOON🚀🚀🚀🌕", "score": 9, "replies": [{"body": "Agreed. But not next week. PLTR is my only boomer stonk.", "score": 4, "replies": []}]}, {"body": "sir, I bought this the minute I saw butterfly", "score": 3, "replies": []}, {"body": "I keep hearing ppl say this is not big news because hospital wont utilize this anytime soon due to engagement with established ultrasound manufacturer. BUT,\n\nU all forgot the big upside of this tech, to give distant patients the ability to submit ultrasound for medical evaluation. Even community centers to have. \n\nThings like this are perfect since it doesnt require expertise to use (supported by AI assissted image capture shown by Bfy iq) and are noninvasive. So for u gay bear out there. This is real tech", "score": 2, "replies": [{"body": "If doctors offices want to keep having remote appointments, they can just door dash one of these bad boys to a patient and have them use it during the appointment.  Door dash it back.", "score": 2, "replies": []}]}, {"body": "Hope you all made money. \n\nEasy double up for everyone who’s held until now, I salute you all.", "score": 1, "replies": []}, {"body": "The TAM for lgvw ain’t as big as what people would think. Sure thing they might do well in the next 2 or 3 years but even themselves expect their revenue to drop by half.", "score": -1, "replies": [{"body": "This is probably true for Corsair as well, \n\nBut I don’t think TAM matters when low interest is banking on companies like this to innovate and do more than just ultrasound going forwards", "score": 1, "replies": [{"body": "There’s a bear case comments on one of the posts and I think the guy did a fantastic job at explaining it. He also mentioned that philips and ge have already started to penetrate into a lot of hospitals and even if butterfly is better and cheaper, it might be hard to convince them to switch over. Also, crsr is a short term play really...", "score": 2, "replies": []}]}]}, {"body": "Is the ultra sound the only thing they have? what else do they have in the pipeline?", "score": 1, "replies": [{"body": "I’m not sure if you’re aware of how an MRI works. \n\n\nThis is like asking if you can have a hand held nuke.", "score": 1, "replies": [{"body": "true fixed", "score": 1, "replies": []}]}]}]}
{"title": "NFLX and BABA", "selftext": "Netflix and baba are looking very attractive for longterm leaps. \n\nNetflix: Increase in number of covid cases, purple tier lockdowns increasing in multiple states. Tripple bottom on the chart, increase in subscription price. \n\nBABA: most undervalued company imo. ANT ipo being pushed back for another 6 months but Chinese economy increased dramatically after covid compared to other countries. \n\nPositions: \n\n400C jan 2022 - BABA - 11$/ contract\n600$ jan 2022 - NFLX  - 4100$/ contract\n\nThoughts appreciated.", "id": "jzx87z", "created_utc": 1606188559.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 18, "comments": [{"body": "I think BABA is undervalued right now as well as a good long term play.  It has had a recent rally however so I might risk waiting for a pullback.", "score": 6, "replies": [{"body": "By recent rally you mean the last 3 days going from $255 to $273(and today was flat).  Baba going back to $300 quick. Those last 3 days just let you know the reversal has already happen from down to up.", "score": 6, "replies": [{"body": "The reason it was flat was because of Chinese tension and sanctions. I sold all my shit at 274 at open today (150 shares).", "score": 2, "replies": [{"body": "Chinese tension and sanctions aren't new.  In fact I saw this ass kissing article and think it is probably bullish now https://www.google.com/amp/s/amp.benzinga.com/amp/content/18481520.", "score": 1, "replies": []}]}]}]}, {"body": "Netflix and Chill is over. Hulu and Hang is the new move.", "score": 4, "replies": [{"body": "I prefer Amazon and Anal.", "score": 15, "replies": []}]}, {"body": "Got a ton of BABA calls for 430 Oct 2021 @ \\~$5 per. Gonna be printing mad in a couple weeks.", "score": 2, "replies": []}, {"body": "So many other leaps you can buy that are cheaper and will print so much fucking harder than these two", "score": 4, "replies": [{"body": "You can't shit and stare. What you got?", "score": 3, "replies": [{"body": "NNDM dec calls $5", "score": 2, "replies": []}]}, {"body": "Suggestions?", "score": 3, "replies": []}]}, {"body": "What are leaps why cant i see them on robinhood", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Got a little more work to do for that. Currently sitting in the 60s right now.", "score": 1, "replies": []}]}]}, {"body": "There is nothing to fucking watch on NFLX and that shot just went up 2$ so I canceled that shit!", "score": 1, "replies": []}, {"body": "Just buy EV, why pick anything else rn", "score": 0, "replies": []}]}
{"title": "Sold UBER to buy INTC, AMA", "selftext": "Basically I have been holding Uber stock for less than a year but more than a week so the shares started to itch and I had to scratch them, sold 95% at 46.37 to buy intel at 44.99 (fucking blue chip value play bullshit I know, could have bought calls like a Chad ). So anyway I looked at the stonks after a few days of binge drinking with hookers, and waddya know, fucking Uber keeps on fucking mooning, past $50 now. Total rocket ship. \n\nAnd you know the best part? Looking back at the retards who told me, when I was buying around $26, that Uber was definitely going bankrupt, etc. Like these bro-king Tech Chads weren't going to Rockefeller the shit out of their bullshit monopoly and manipulate an election to keep making money. Truckloads of money. You know they barely even pay these Uber drivers a living wage, right? Wall Street loves this story. It's a badass story, and everyone likes it, actually. \n\nAnd yeah I'm a small timer, literally only had 20 shares. Not even worth the screenshot lol. But I have skills. I pick winners, and believe that I can do it again. Stay tuned for free dollars!", "id": "jzxwiv", "created_utc": 1606191230.0, "score": 8, "upvote_ratio": 0.79, "num_comments": 14, "comments": [{"body": "Skills? Sir this is a Wendy’s", "score": 11, "replies": []}, {"body": "INTC is going to take looong time to move up to the likes of what AMD is doing, or what NVIDIA has done, if they even do it.", "score": 5, "replies": [{"body": "Well, it's going to be $50 by EOY. It just will. AMD could be $100, or it could be $60 by EOY (I have been in AMD since $8.00, was literally my first stonks). I'm holding about 5:1 AMD:INTC", "score": 3, "replies": [{"body": "Hope it does for your wallet :)", "score": 1, "replies": []}]}]}, {"body": "Money Printer go Spaaaaacccccccccc", "score": 5, "replies": []}, {"body": "Sell intc. Its a dead stock. Spy, nvidia, amd will all have better returns.", "score": 2, "replies": []}, {"body": "INTC is a solid play. Undervalued right now, and will become a major player in the robotaxi technology in the EV market.", "score": 2, "replies": []}, {"body": "Buy my wheel calls.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I own more AAPL and a lot more AMD than INTC, but yeah, I know. I should have just held the UBER.", "score": 1, "replies": []}]}, {"body": "Lol buying intel while their x86 architecture is being marginalized and outplayed. Well to each their own I guess", "score": 1, "replies": []}, {"body": "I just threw up a little", "score": 1, "replies": []}, {"body": "Hahahaha this guy bought intel", "score": 1, "replies": []}, {"body": "Out of all the companies out there you choose Intel?? Godspeed", "score": 1, "replies": [{"body": "no, yeah, I know. It was the stupidest shit. Literally the next day Uber was +$5.00.", "score": 1, "replies": []}]}]}
{"title": "So I got about 15k to dump in TSLA calls", "selftext": "The title says it all, but before I do this retard move\n\nTesla joining the S&P means it can ONLY GO UP but I am seeing plenty of posts about IV crush, can’t I just avoid this by buying long dated contracts? \n\nLet’s say 2022-2023 TSLA call options and simply avoid the IV crush.\n\nOr would I still get fucked hard no matter what", "id": "k00pob", "created_utc": 1606203949.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 16, "comments": [{"body": "You’ll be fine Tesla goes to 580 eow", "score": 8, "replies": [{"body": "* EOD", "score": 2, "replies": []}]}, {"body": "So many better options", "score": 2, "replies": [{"body": "Like what?", "score": 2, "replies": []}]}, {"body": "Do it, q4 will be a blast aswell", "score": 2, "replies": []}, {"body": "Don’t do it man! Gme is popping off. 15k turns easily into 150k!", "score": 2, "replies": []}, {"body": "Tesla is super exhausted and getting overpriced for a car company. You have more chance of making more money on PLTR. Wait for the dip if there is one.", "score": 3, "replies": [{"body": "Wait till it’s 100 lol", "score": 6, "replies": []}, {"body": "Just you wait, someone gonna tell you its a tequila company. Hold on, thats me.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "LOL, your right Tesla is not a car company it is a teleportation company or maybe a mini millennium falcon because it is priced like it is anyways. Whatever makes you happier", "score": 0, "replies": [{"body": "It's actually a tech company that happens to sell cars.\n\nIt's an energy company that is funded by selling vehicles\n\nBut most importantly, it's a tendie printing machine", "score": 1, "replies": []}]}]}, {"body": "look at that dude, i am sure he is been saying this since a year now", "score": 0, "replies": []}]}, {"body": "God speed soldier", "score": 2, "replies": []}, {"body": "Thats pretty much the best move you could make with tsla options.", "score": 2, "replies": []}, {"body": "IV crusssshhhhh", "score": 2, "replies": []}, {"body": "Wish i was here 79 days ago😂😂", "score": 1, "replies": []}]}
{"title": "¿¿TSLA 600C 11/27??", "selftext": "Hello my fellow degenerates, so I basically dumped my whole 3k account onto TSLA contracts this week, anybody see this motherfucker cracking $600 at some point these next couple of days? I bought some calls and it’s already past the 20 day HMA Line. I feel like this rally will keep going for quite a bit. Any thoughts?", "id": "k02sog", "created_utc": 1606214657.0, "score": 9, "upvote_ratio": 0.74, "num_comments": 10, "comments": [{"body": "seems pretty safe to call, the bubble will grow for 2 to 3 more weeks before it goes pop and you retards blow all of your tendies", "score": 19, "replies": []}, {"body": "what could go wrong. seems like a sensible move. we still have 2021 left for massive growth.", "score": 4, "replies": []}, {"body": "Market closed on Thursday, Closes at 1pm Friday. Theta decay might get you ! Be careful!", "score": 3, "replies": [{"body": "True.", "score": 1, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/BullsforBulls the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Ive been slowjacking for the past week over muh tesla gains and still got plenty white left in the chamber. Testys go brrrrrrr", "score": 2, "replies": []}, {"body": "wish you luck. we've lost too many to crazy FD's. this one seems 50/50 except you lose 1 day to holiday.", "score": 2, "replies": []}, {"body": "Went in on this. Yolo’d my last \n🌈🐻 1k in this morning at .79 a pop decay might get me but ya never know too many of us degenerates for half day rally on Friday", "score": 2, "replies": []}, {"body": "Tendies for cocaine and a tesla", "score": 1, "replies": [{"body": "And whores! Never forget whores", "score": 2, "replies": []}]}]}
{"title": "Gentlemen Start your Jet Engines (RR.L)", "selftext": "**RR.L is on the move, more to the point it's taking off!**\n\nIf you don't want all your money on PLTR calls (though I do get why you would) consider Rolls Royce. Not the car company, the engine manufacturer. \n\n**The Good.**\n\nThe current share price has been depressed by a new issuance of shares and is still rock bottom after COVID-19. It has tumbled from \\~700GBX ($9.10 USD aprox.) to \\~120GBX as of now. The stock was hilariously oversold s boomers jumped ship, while its stock lost over 80% of its value its actual revenue dropped 23% (H1 2020).\n\nIt's not just a widebody jet engine manufacturer, it granted is still about 45% of overall revenue. It's defence arm actually grew their profit 19% YoY (H1 2020). Another key point is that most of its engines are already out in the wild and aftermarket sales and service is a significant generator of revenue over the service life of all their products. Therefore, it's not their new engines that are likely to be taken out of service if the airline industry struggles or even fails to fully recover.\n\nAs a further point to that rolls Royce is one of the few countries in the world with the skills and experience to design and build small scale nuclear reactors. Whether that's impotnat to you or not, Nuclear power may yet gain a place in the drive for cleaner energy.\n\nIt’s a household name, the company does have a lot of brand recognition and public goodwill and is still developing new products.\n\n**The Bad**\n\n*It is not optionable.*\n\nThe company is currently laden with debt, and overall, the company is in negative equity. To the tune of £3.3B (Full year 2019) this is most definitely NOT a potential value investment. They also do not have an efficient manufacturing process, estimating their current headcount to be 33% above what they expect they will need in the coming years. \n\nThere is a high level of uncertainty in the commercial aviation market, at least with passenger aviation, and Rolls Royce have based many their forward-looking statements on a 90% recovery by 2022. If that is not the case the company could struggle, or even collapse.\n\nThe company has reduced the deficit on its pension find, closed to new employees since 2007, but it is still large, at £1.38B (FY 2019).\n\nSources: [https://www.rolls-royce.com/\\~/media/Files/R/Rolls-Royce/documents/investors/2020-hy-presentations.pdf](https://www.rolls-royce.com/~/media/Files/R/Rolls-Royce/documents/investors/2020-hy-presentations.pdf)\n\n[https://www.rolls-royce.com/\\~/media/Files/R/Rolls-Royce/documents/annual-report/2019/ar2019-financial-statements.pdf](https://www.rolls-royce.com/~/media/Files/R/Rolls-Royce/documents/annual-report/2019/ar2019-financial-statements.pdf)\n\nPosition, 206 @ 109.45GBX", "id": "k03alo", "created_utc": 1606217169.0, "score": 9, "upvote_ratio": 0.91, "num_comments": 12, "comments": [{"body": "Agree- i bought in at £1 - long term investment, hopefully a 10x return in 3 years? I have a friend who works at RR- the current wave of redundancy’s in the company is “the last” so hopefully they’ll start ramping back up in the next 12-18 months", "score": 5, "replies": []}, {"body": "Fuck off with your sensible buy and hold for 2-3 years boomer investment advice", "score": 2, "replies": []}, {"body": "[https://www.world-nuclear-news.org/Articles/Rolls-Royce-enlists-Exelon-to-help-deploy-SMRs](https://www.world-nuclear-news.org/Articles/Rolls-Royce-enlists-Exelon-to-help-deploy-SMRs)\n\n&#x200B;\n\nFission and frigates ftw", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on [the DD list](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da).\n\nDon't fuckin' misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. \n\nDD is for wall-of-text deep-dive Pepe Silvia shit. [Read this to learn how to do your own DD.](https://www.wallstreetoasis.com/forums/on-the-job-with-simple-as-my-research-process)\n\nPlease message [modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets&subject=DD%20Flair%20Abuse&message=Link%20to%20thread:) to report this DD if it is low quality, or violates the [Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Yeah but can it melt steel beams?", "score": 1, "replies": [{"body": "Saudi Arabia can.", "score": 2, "replies": []}]}, {"body": "I already made 100% on this on it’s initial pop back up from 70 to 120 using the 3x leverage ETF. This is easy gains if you time it correctly (even tho that is partly luck)", "score": 1, "replies": [{"body": "What's the ticker?", "score": 3, "replies": [{"body": "RR.L for the UK listing RYCEY for US i think.", "score": 2, "replies": []}]}]}, {"body": "\" *it's not optionable* \" I'm out", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "k04hyr", "created_utc": 1606222645.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 9, "comments": [{"body": "Excellent analysis.", "score": 4, "replies": []}, {"body": "Oh man this is the way, the way of r/smallstreetbets", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "How are you only up $477.84 if you bought before the split?? Did you buy fractional shares?", "score": 0, "replies": [{"body": "This autist...", "score": 3, "replies": []}, {"body": "That's tesla's run up.", "score": 1, "replies": []}]}, {"body": "Volume going lower and lower before the rug pull.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Check moving averages for insightful data (but I’m not into technical astrology, don’t believe that shit, me perma bull, me rich)", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Moving averages can be computed on any stochastic processes. Don’t care about your volume explanation, move along nothing to see here. Permabull.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Moving averages are used to smooth stochastic signals, it is not reserved to stock price", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}
{"title": "Would it still be wise to invest in Tesla/Space X?", "selftext": "[removed]", "id": "k05c76", "created_utc": 1606225916.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 14, "comments": [{"body": ">!https://   .         .com/  _  /     -     -          -     -     -    .html!<", "score": 11, "replies": [{"body": "Well, they have been wrapping spaceX up with tesla lately, but IIRC SpaceX will never be publicly traded because Elon doesn't want to answer to anyone when it comes to his pet projects.", "score": 2, "replies": []}]}, {"body": "Buy calls no balls", "score": 2, "replies": []}, {"body": "would it be wise for you? no. could you make money? yes, could you lose money? yes.\n\nthere's your answer.", "score": 2, "replies": []}, {"body": "Space x has nothing to do with Tesla. Elon is gonna do an ipo when space x is more profitable though in an interview he did. Don’t buy Tesla thinking any big news space x did something big it won’t effect the stock in any way.", "score": 0, "replies": [{"body": "Space X or space x’s side projects as it is already planned for starlink", "score": 1, "replies": []}]}, {"body": "If you're asking for wisdom on a well known gambling subreddit, I hate to inform you, but... you're guess is as good as our collective guess.", "score": 1, "replies": [{"body": "Yea already realised I made a mistake lol", "score": 1, "replies": []}]}, {"body": "SpaceX is privately held. If you can buy part of it you should.\n\nTesla depends entirely on your investment goals and appetite for risk. Personally I have invested in Tesla because I believe it is far in front of competition is first real player in the EV space and believe we will see $1,000/share within 3 years.\n\nBut also recognize there is higher than average risk around this investment due to competitive pressures and potential regulatory impediments.", "score": 1, "replies": [{"body": "A 1T market cap 😂😂", "score": 2, "replies": [{"body": "An 82% market share and the disruptor of a global market.\n\nMade the EV market place.\n\nWill be first to offer Full Self Driving vehicles\n\nFirst to market with a Commercial truck.\n\nInventing new batteries.\n\nSolar power and Grid level power storage on a grand scale,", "score": 1, "replies": []}]}]}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Well Tesla doesn’t really make money, doesn’t sell many cars, is losing registrations, losing its edge on competition, and is worth about 500 billion dollars. Despite it being an absolute shit company with no path to live up to current valuation, it continues to go up. I could never bring myself to buy the stock, but I can’t argue against the trend. Should go down to about 30$/share, but will probably go to 1000$/share", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}]}
{"title": "Been informed that apparently Chegg tracks students IP’s and hands them out to profs. That’s a bad look and not a company I want to hold. Let’s burn this Bitch to the ground! $71 hmmm let’s see about that", "selftext": "I’m unloading, refuse to accept such a scum company. More Tesla stocks it is boysss, it’s shooting for 700 end of December! Maybe Apple can get some love, Apple gives the middle finger to the FBI when they ask for info. Privacy matters let em know.\n\nWow 100 first year 17/18 year old kids might get kicked out because of them. https://ibb.co/tzthbpF", "id": "k060cv", "created_utc": 1606228265.0, "score": 32, "upvote_ratio": 0.83, "num_comments": 13, "comments": [{"body": "They have to choose a side : investors or academy ?", "score": 4, "replies": []}, {"body": "they don't willingly do that, unless asked by the school or professor.", "score": 3, "replies": [{"body": "Yea but they give ip of somebody who even viewed the question, not somebody accused of posting illegal material. Sketchy, what a soft company. Tim Cook needs to teach them a thing or two about standing firm on privacy", "score": 12, "replies": []}]}, {"body": "Have you heard of PLTR? Morality about data isn't strong around here right now..", "score": 2, "replies": []}, {"body": "apple been doodoo lately.", "score": 0, "replies": [{"body": "Don’t worry M1 power will be taken serious soon, YOLO", "score": 3, "replies": [{"body": "was about to sell my apples.. M1 is enough to hold?", "score": 1, "replies": []}]}]}, {"body": "Wait you're mad you can't cheat anymore? That's like being mad walmart hired a security guard and now you can't shoplift", "score": -8, "replies": [{"body": "Shut it nerd", "score": 0, "replies": []}]}, {"body": "No, the 100 first year kids would be kicked out for cheating on an exam. Every school lays out in every syllabus that cheating will get you expelled, the students would have been well aware of the consequences of their actions.", "score": -3, "replies": [{"body": "That’s not even the discussion. It’s the fact they are giving out user data", "score": 1, "replies": []}]}, {"body": "Wait so if you view chegg while taking a test the prof will see that?", "score": 1, "replies": []}, {"body": "Lol IP addresses aren’t a universal internet ID. They’re usually dynamic on the WAN.", "score": 1, "replies": []}]}
{"title": "How do you come back from Loss?", "selftext": "A couple months ago, I got addicted to gambling apple options > was like I was in fantasy land \n\nAll of a sudden after being up 200% for the year I make a bad call and am now down 80% from where I started.\n\nI took some time off and reevaluated other things in my life and now I finally feel as if I am comfortable to start investing again, but how do I come back from an 80% loss?\n\nThanks in advance \n\n-Just another Autist", "id": "k0697v", "created_utc": 1606229080.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 14, "comments": [{"body": "Always take out the initial amount you started with.\n\nLosing profit money feels better than losing hard earned worked for money", "score": 14, "replies": []}, {"body": "You don’t. You start again with what you have and try to build from there. Don’t ever go chasing losses and act like you need to get them back. They’re gone, likely in some other autist’s pockets. Start fresh and forget the past, it’ll keep you more sane when you start building again.", "score": 8, "replies": []}, {"body": "One dollar at a time. Forget that 200% gain number because that’s gone and you won’t be seeing it this year unless you want to continue to gamble.", "score": 5, "replies": []}, {"body": "Rope", "score": 7, "replies": []}, {"body": "Buy APHA and FCEL", "score": 2, "replies": []}, {"body": "From the looks of it, I'll let you know tomorrow...", "score": 2, "replies": []}, {"body": "Get a fucking job", "score": 0, "replies": []}, {"body": "Start taking profit .", "score": 1, "replies": []}, {"body": "Been there. Take it as a learning lesson (s) then move on. Examine what you did wrong and don't do it again.\nThen creep back up with careful plays until you can make better/bigger plays.\nThat's what I've done. Ymmv\nGood luck!", "score": 1, "replies": []}, {"body": "1 dolla dolla bill at a time.", "score": 1, "replies": []}, {"body": "Brick by Brick, dollar by dollar", "score": 1, "replies": []}, {"body": "Lost 1k not so big of a loss anyway this pissed me so hard.\nThe problem is that I didn't take profits and wished for more and more.\nI learned that you have to take profits when they come to you.\nI've recovered like 100 bucks at a time and now I'm going into the green side.", "score": 1, "replies": []}, {"body": "your not investing your gambling, fix your verbiage", "score": 1, "replies": []}, {"body": "Well 80% loss means you currently have 1/5 of what you started with. All you need to do is yolo everything left and get a 400% return to be back at square 1. Problem solved. 👍", "score": 1, "replies": []}]}
{"title": "Some magic fucking lines. Short NFLX. 360p 1/15/2021. Fuck you", "selftext": "[deleted]", "id": "k06v70", "created_utc": 1606231125.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 10, "comments": [{"body": "I’m down to short. But $360 pretty far down there", "score": 5, "replies": [{"body": "It’s all I could afford, look at that IV. What’s the opposite of IV crush?", "score": 1, "replies": [{"body": "hsurc VI", "score": 5, "replies": []}]}]}, {"body": "Dumb dumb", "score": 2, "replies": [{"body": "🐼", "score": 1, "replies": []}]}, {"body": "Got it. Calls on NFLX.", "score": 2, "replies": []}, {"body": "Did you take a picture of your monitor?", "score": 2, "replies": [{"body": "Fuck yea!", "score": 2, "replies": []}]}, {"body": "I don’t trust anyone who can’t take a screenshot in 2020", "score": 2, "replies": []}]}
{"title": "I'm dumb. Someone explain me TSLA,PLTR", "selftext": "I've been trying to understand Tesla's surge since months for now. I know how valuation works, but isn't this too much? Papa Elon added 100bn to his net worth. Why are people buying TSLA so much even when they know it can't make huge profits or it isn't worth that much. At least with Palantir I can understand that they have deals with the US government and private companies. I don't know what words to use, is Tesla's surge just in the air, but not on paper?(This sentence doesn't make sense) .\nIs it legit or just a type of bubble?", "id": "k06xxx", "created_utc": 1606231372.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 15, "comments": [{"body": "Sir I think you meant to type this shit in r/investing this is a casino.", "score": 33, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Here I’ll help you out. If you estimate future markets value and Tesla’s stake in ev vehicles it is not overvalued. Same as apple was in smartphones people are betting on future growth and Tesla remaining a dominating player in the ev market. Hope that helped.", "score": 6, "replies": [{"body": "Now tell this man thank you for explaining old news!", "score": 5, "replies": []}]}]}]}, {"body": "Why would we explain smart stuff to someone who’s dumb?", "score": 15, "replies": [{"body": "Stonks!", "score": 1, "replies": []}]}, {"body": "The whole market doesn’t make sense right now, ride the wave.", "score": 12, "replies": []}, {"body": "Because TSLA is years ahead of its competition in both car modeling, battery development, and automated driving. Ford announced its \"interested in building batteries\" meanwhile Tesla has a full blown battery facility up and running. No one comes close to its autopilot. And they make decent cars (with some flaws). = years ahead of competition? STONKS go up \n\nPLTR - Nerd shit with shady government contracts = STONKS only go up", "score": 9, "replies": [{"body": "Bullshit! Tesla got eslon musk the saviour! Thats why it cannot fail and wil hit 1000$ soon", "score": 1, "replies": []}]}, {"body": "Tesla is a type of company we’ve never ever seen the potential is insane", "score": 5, "replies": []}, {"body": "If you are a billionaire and you want more money, and you know that dumb kids want to buy the latest hip growing flying up stock that can make them millionaires in one year, not have to work, and do crack, cocaine, have prostitutes, and a yacht, what do you think you would do to make you more money?\n\nyou got it! Pump up stocks to get people to want to buy in and then you profit because you were the one who started the pump and knew idiots would just herd in and buy up as who doesn't want to make money?\n\nSo what you are seeing is why the market is up and up and up through all the news of this and that.\n\nNobody cares who is dying, but EVERYBODY cares who made $30,000 from a stock moving up from Robinhood kids buying and literally the insiders who pump it up knowing that, are the real ones getting rich. They have been in since they started the pump and knew it was going to here since they knew all you have to do is get a stock to jump up 5-10% in 1 day or less and all the sudden \"everybody wants in\"  example : all EV stocks and etc.. (the chinese stuff etc..)", "score": 3, "replies": [{"body": "Boomer talk", "score": 1, "replies": [{"body": "It's real talk. It's what is literally happening in front of your face.", "score": 1, "replies": []}]}]}, {"body": "Tldr! \n\nJust buy it, retard. \n\nYou do not questien of how electricity works, so why start now?", "score": 3, "replies": []}, {"body": "Tesla along with their EV buddies is a bubble", "score": 1, "replies": []}, {"body": "Jesus, does someone wanna tell him?!", "score": 1, "replies": []}]}
{"title": "Crash for Robinhood stocks are emminent", "selftext": "[deleted]", "id": "k07j7y", "created_utc": 1606233250.0, "score": 7, "upvote_ratio": 0.78, "num_comments": 15, "comments": [{"body": "Cramer has been wrong 100% of the times, IDK why people even listen to him!!!", "score": 15, "replies": []}, {"body": "Cramer is the guy from Seinfeld, right?", "score": 15, "replies": []}, {"body": "Shut up retard", "score": 9, "replies": []}, {"body": "This bitch can't spell", "score": 8, "replies": []}, {"body": "Fuck outta here boomer", "score": 5, "replies": []}, {"body": "He called tesla a cult stock. His mind only changed when Q3 earnings came out. Having that said, he called it on SAM.stock back in march", "score": 5, "replies": [{"body": "He looked so guilty somehow when admitting he was 'caught off guard' on Rob's interview... I couldn't help but think he'd been paid to try and downplay it.", "score": 1, "replies": []}]}, {"body": "Bold of you to assume I have profits to solidify", "score": 3, "replies": []}, {"body": "Chinese EV might crash but pltr moon", "score": 2, "replies": [{"body": "I’m fucking PRINTING right now!!!", "score": 1, "replies": []}]}, {"body": "Lmao theres always a winner and a loser on trades, and its comical how often Cramer is the loser", "score": 1, "replies": []}, {"body": "They are confused because they don't understand.", "score": 1, "replies": []}, {"body": "Cramer has cost me money in the past, and I'm 100% that he is wrong. Inversing him is the smartest thing to go, stocks going to moon.", "score": 1, "replies": []}, {"body": "Lol always do the opposite of Cramer. Remember this is the guy who advised you to buy Bear Stearns in 08 haha", "score": 1, "replies": []}]}
{"title": "Diversify 20% REITs, 40% Tech, 20% Travel, 20% Energy or all in on Tesla? The answer is simple.", "selftext": "[deleted]", "id": "k07xkb", "created_utc": 1606234464.0, "score": 21, "upvote_ratio": 0.85, "num_comments": 15, "comments": [{"body": "Better diversification:\n\nTSLA 33%\nNIO 33%\nPLTR 33%\n\nThen buy some tendies with the remaining 1%", "score": 6, "replies": [{"body": "Avg cost NIO $5 and PLTR $9 on my other brokerage! We getting these tendies. This account is solely for wheeling Tesla lmao", "score": 7, "replies": [{"body": "I'm with you all the way brother I'm 100% in on Tesla bought in at $388 split adjusted, gonna be riding this wave for the next ten years 👏🏻🙌🏼", "score": 1, "replies": [{"body": "Hell yeah! Do you wheel it or just hold the shares?", "score": 1, "replies": [{"body": "I've played around with it trying to time dips but it's too stressful so I just use all the self restraint I have and leave it alone now lol", "score": 1, "replies": []}]}]}]}]}, {"body": "The real perfect diversity is 50% tech 50% weed", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/waterfly9604 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What app is this? I moved to think or swim today, and first day the app was down at open, and funds aren’t available for options until my deposit clears. And when I bought stock yesterday and sold today for a profit, none of those funds are available for use today.\n\nBasically want to switch again.", "score": 1, "replies": [{"body": "This is the TD Ameritrade app. I use ToS too but just flip flop. The deposits usually take 3-5 days to land :/ also make sure you’re not on a cash account because that would explain why you can’t use funds directly after making a sale.", "score": 2, "replies": [{"body": "Which do you like better? How long does it take for closing out a position before the cash becomes available? I assumed if I opened yesterday, closed this morning, I could use the cash again right away...sorry I’m a RH newb moving over to something else.", "score": 1, "replies": [{"body": "I use RH and TDA both but TDA fills my positions way better than RH. It should be right away but you should email their support and ask if your account is cash or margin. A cash account would mean you could day trade as much as you want without $25k, but you’d have to wait 2-5 days before your cash settles to re-use that money. ThinkOrSwim’s desktop app is far superior to everything else out there imo. Lots of good tools and such.", "score": 2, "replies": [{"body": "I have the new iPad Pro and I’m absolutely loving it.  Maybe I just need to turn on the margin account. My initial deposit hasn’t cleared yet. I deposited 20K but I dumped it all in to stocks right away with stop losses, but I when I sell I can’t re-use that cash - I’d like it to be immediate.", "score": 1, "replies": [{"body": "Oh I think I understand the issue. You deposited and used it so I think you were using margin they gave you based on your deposit. Happened to me with my tesla shares. Wait a few days till your cash gets settled and you should be good to go. It’s not immediate like robinhood but TDA in general is leaps ahead in terms of actual trading abilities.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Which reits ? Have you looked into wpg etc", "score": 1, "replies": [{"body": "Nah I’m kidding fuck reits, TSLA to 800 by March 2021", "score": 1, "replies": []}]}]}
{"title": "What do we think about TSLA puts? Shits overvalued asf right?", "selftext": "", "id": "k080i9", "created_utc": 1606234710.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 17, "comments": [{"body": "Find another way to make money", "score": 20, "replies": [{"body": "Meet me in the parking lot behind Wendy’s", "score": 3, "replies": []}]}, {"body": "Don’t short a cult stock look into Boeing or Disney puts", "score": 10, "replies": [{"body": "Don’t bet against the mouse...", "score": 6, "replies": []}]}, {"body": "Lol. Tesla got a price upgrade of 700 and another one of 1000. It’s about to officially get into S&P. Good luck dumbass", "score": 8, "replies": []}, {"body": "Careful. Elon’s gonna whip out a big green cock to dick you with just until expiry.", "score": 5, "replies": []}, {"body": "Don't do it. Shorting stupidity is a mistake. Its like shorting religion. It might happen but pretty u likely.", "score": 3, "replies": []}, {"body": "Bro stocks only go up idk what your retard logic is here lmao.", "score": 2, "replies": []}, {"body": "Puts on boomer stocks, calls on meme stocks. FFS, What don’t you people understand?", "score": 2, "replies": []}, {"body": "Why is it overvalued?", "score": 1, "replies": []}, {"body": "Short Nio or Xpeng instead buddy. Why go after the innovators? Short the dam imposters if you think EV companies are overvalued", "score": 1, "replies": []}, {"body": "Use your brain for once. TSLA will keep mooning until 1 dec guaranteed", "score": 1, "replies": []}, {"body": "“ Fighting Tesla is like trying to fight the Fed “ - some talking head on CNBC . So good luck.", "score": 1, "replies": []}, {"body": "Seems like you’re way ahead of the curve! A trailblazer! Go all in", "score": 1, "replies": []}, {"body": "There’s others stocks you can short. I never like betting against TSLA.", "score": 1, "replies": []}, {"body": "Wait until it reaches 600. It may even go up to 650ish. Then consider buying a put at least 3 weeks out. That’s how I’m playing it.", "score": 1, "replies": [{"body": "or just buy the stock tbh", "score": 1, "replies": []}]}]}
{"title": "Weed stocks are like selling ice to an Eskimo.", "selftext": "Ive been a lifetime reefer smoker (27 yrs) I just started investing this year and as of today I'm up 227% mostly on the EV bubble..Now I love weed, but I wouldnt touch that shit in the market with your grandmother's dick. Buying weed from a dispensary was cool the first time I did it in Colorado when it was first legalized...once. (sure I'll buy a gram of weed at 2x the price because of tax) but after that I'm calling Jeff.\n\nJeff is my weed guy he drops my weed off and we smoke together (good guy) and with Jeff I don't have to go to a dispensary and wait in line to get charged too much for weed with a bunch of other mouth breathing stoner retards, while listening to shitty jam band music live from some STD infested music festival. \n\nPoint is nobody going to buy smoke from a dispensary as long as it's so easy to grow your own or call Jeff. So I dont understand why people think this is going to be a good market to go into.\n\nThere's a market for edibles and soon you'll be able to buy them in the liquor isle in your stupid towns grocery store, I mean I'd go down to piggly wiggly for weed infused organic Cheerios twice a week if I could.\n\nWas going to tag this as DD but then I got high.", "id": "k08544", "created_utc": 1606235101.0, "score": 9, "upvote_ratio": 0.73, "num_comments": 13, "comments": [{"body": "Lol I’m Jeff", "score": 7, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "That part. Not to mention not everyone has a Jeff. Some of us have a Tommy-two-tone taking his time. \n\nIf you look at it as medicine the conversation changes too. Every news story about a shop opening includes a quote of someone saying “I’m so happy to be able to finally buy my medicine legally.” Between dick and jane’s who smoked in college, rec users who are happy to have a place to walk in to and get exactly what they want (hey), and medicinal users; I’m in on pot stocks. With the weed taboo fading and more legalization why wouldn’t weed stocks go green? \n\nAt the end of the day idk shit about fuck I’m just hoping to ride Aphria to the moon.", "score": 2, "replies": []}]}, {"body": "This DD is shit and anecdotal. I prefer my dispensary to my weed guy and will 100% go there instead. Just because Colorado dispensaries suck doesnt mean all other states have shitty dispensary experiences.", "score": 4, "replies": []}, {"body": "Buddy... where do you think Jeff is getting his weight from lol. Federal legalization just opens the door for infrastructure to come in and make better yields, better concentration of THC, and they can likely automate the process. Meaning their margins are going to be crazy.  \n\n\nSmoking home grow and baking your own edibles is cool and all... but people aren't going to stop going to dispensaries where they can get professionally grown, and tested flower. Plus vapes. Plus oils.", "score": 6, "replies": []}, {"body": "I don't know much about the stocks, but you make a lot of assumptions about dispensaries that I would disagree with, even if most of it is anecdotal. \n\n- I have never been to a dispensary that didn't have at least 75% of its PoSs being used.\n\n- Jeff doesn't take debit cards.\n\n- Jeff doesn't sell edibles, drinks, or cartridges.\n\n- Jeff might be tied up playing Fortnight with 13 yo's.\n\n- When the dispensary delivers, it doesn't expect to be smoked out, too.\n\n- I don't have a Jeff in towns I am visiting.\n\n- Jeff is nowhere near as attractive as the people that work at the dispensary.\n\n- Dispensaries price by content, not just weight, and Jeff doesn't have shit pushing 30% THC, thus making the dispensary a better value.", "score": 3, "replies": [{"body": "Jeff does have carts, Jeff does have cash app, Jeff’s network has been growing primo bud for decades, it’s Jeff’s six figure job and he runs a 4 man crew, so yes he delivers 24/7. Jeff sells zips of kill for $40. \n\nYou need a better Jeff.", "score": 1, "replies": [{"body": "Or I just got to the dispensary.", "score": 1, "replies": []}]}]}, {"body": "Couldn't agree more. Ill still be seeing my boy \"jeff\" long after its legalized (NY)", "score": 0, "replies": []}, {"body": "Jeff is getting beat the fuck up in this thread and I'm jumping on board because it's what I do. \n\nFuck Jeff. Puts on his health.", "score": 1, "replies": []}, {"body": "Sadly not everyone has a Jeff. Especially not suburban moms or old ass farmers. Also my Jeff serves me shit ass cheese bud half the time so I was glad to switch to dispensaries. I’ve only bought cresco CRLBF bud since legalization in Illinois’s. Prices are now down to street value in dispensaries. Get this wack ass DD out of my face.\n\nLiterally your whole argument goes out the window when you look at how much Colorado rakes in despite growing being legal", "score": 1, "replies": [{"body": "How much Colorado makes is exactly right. The companies are barely moving. And maybe you do need a new Jeff but they're not all that hard to find, weed has been illegal since I first took a puff and since then I've been able to find it without much problem without a dispensary in existence. \n\nDon't get me wrong I hope everyone makes money but the weed industry just doesn't make sense to me", "score": 1, "replies": [{"body": "Lol you obviously haven’t been following the American weed companies then. They’ve been going up like crazy this year. Cresco has increased revenue 40% at least for the last 3 quarters. You literally have to know nothing to say American weed sales aren’t growing", "score": 1, "replies": [{"body": "In that case I'm sorry for being wrong, it was a shit post after all I was stoned and just thinking about how dispensaries are a rip off, but your probably right soccer mom need somewhere to go too I guess", "score": 1, "replies": []}]}]}]}]}
{"title": "What are the chances of PLTR dipping? Shorting? Company selling shares? Market crash?", "selftext": "[deleted]", "id": "k0877z", "created_utc": 1606235279.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 12, "comments": [{"body": "U just missed the dip retard", "score": 26, "replies": []}, {"body": "It got down to $20.65 earlier...then ran up to $24.26...", "score": 15, "replies": [{"body": "Exactly. I feel like its a pump and dump in the next week or so", "score": -9, "replies": [{"body": "Cool story...you do know that they have contracts with the military and that Biden is gonna be president right? Biden equals wars which equals gains", "score": 9, "replies": [{"body": "OH SHIT ITS A LONG GAME LOOOOL OK WERE GOOD FOR THE NEXT 4 years. Entering tomorrows pltr dip then.", "score": -2, "replies": [{"body": "Hey dildo if you were interested in the short term you would have bought this morning and sold a few minutes ago.", "score": 1, "replies": []}]}]}]}]}, {"body": "When American gov collapse maybe PLTR will be dipping but then it will recover when there is civil war", "score": 7, "replies": [{"body": "So thats the only way? What are the chances of that happening?", "score": 1, "replies": [{"body": "It’s pump and dump just because soros is selling on every AH then buy it at dip on every Friday but now a lot of big funds put their money on PLTR so i doubt there will be dip on Friday. If that happened it always recover in pre market Monday so just sit back and buy PLTR", "score": 6, "replies": [{"body": "Thank you for the explanation. Goodluck fellow retArd", "score": 1, "replies": []}]}]}]}, {"body": "It literally can’t go tits up, $30 EOD", "score": 4, "replies": []}]}
{"title": "Grimes appreciation day", "selftext": "They say behind every great man is an even greater woman.\n\nWith Elon rising to #2 on the world's wealthiest list, it's time we take a closer look at Grimes.\n\nGrimes, born Claire Boucher, met Elon where he spent most of his days, on Twitter.\n\nThe couple quietly began dating, as activist short shorts Einhorn loudly spread FUD.\n\nElon was quoted saying he loves Grimes for her \"wild fae artistic creativity and hyper intense work ethic\".\n\nShortly after, she encouraged Elon to blaze a blunt with Joe Rogan, announcing taking TSLA private at $420.  Funding secured. He later admitted he picked the $420 share price as a joke to amuse Grimes, according to the SEC.\n\nAt this point, the short shorts were drooling and the barbarians were at the gate.  \n\nWith the Grimes' creative direction, Musk recorded RIP Harambe on his new Emo G soundcloud account.\nhttps://m.soundcloud.com/user-209448905/rip-harambe1\n\nFinally as short interest was at an all time high, Elons master squeeze was ready.  And squeeze he did, all the way to a 5:1 split.\n\nTo celebrate, Grimes presented Elon with his next Grammy potential hit single, Don't Doubt my Vibe.\nhttps://m.soundcloud.com/user-209448905/dont-doubt-ur-vibe\n\nWith this release, he also dropped the cyber truck, with Grimes presenting it on stage as his cyber girl.\n\nThe rest of the story is mostly history, but Grimes also gave birth to Elons favorite son, named X AE A-XII.\n\nSo with that, a big Thank You to Grimes from everyone at WSB.  We know it wouldn't have been possible without you, because Elons ex wives never made him happy the way you do.\n\nWe cheer for your successes as a couple in 2021, and look forward to these TSLA 600c 12/31s maturing.  What we lack in talent, we make up in risk appetite. We stand with you Grimes and Elon!\n https://www.businessinsider.com/elon-musk-girlfriend-grimes-relationship-photos-2018-8", "id": "k08v9u", "created_utc": 1606237233.0, "score": 54, "upvote_ratio": 0.93, "num_comments": 12, "comments": [{"body": "Well, thanks for painting a clear picture of how fucked up Elon is.", "score": 27, "replies": [{"body": "RIP Harambre will be a platinum hit", "score": 7, "replies": []}, {"body": "I sire your kid and you each get 69,420/yr for life. Says it right here in the prenup", "score": 2, "replies": []}]}, {"body": "Musk found his MPDG", "score": 5, "replies": []}, {"body": "This post was flaired as DD so it's on [the DD list](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da).\n\nDon't fuckin' misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. \n\nDD is for wall-of-text deep-dive Pepe Silvia shit. [Read this to learn how to do your own DD.](https://www.wallstreetoasis.com/forums/on-the-job-with-simple-as-my-research-process)\n\nPlease message [modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets&subject=DD%20Flair%20Abuse&message=Link%20to%20thread:) to report this DD if it is low quality, or violates the [Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": ">https://m.soundcloud.com/user-209448905/dont-doubt-ur-vibe\n\nfu", "score": 2, "replies": []}]}, {"body": "shit post, fuck off, ban this idiot", "score": -1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**TSLA**|**$600**|**BUY CALL**|**2020-12-31**|**$31.17**|**$543.42**|**3043**|**977**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckhw8ilsk6vu00716s5vo7v4h) | [Track Record](https://www.pickmojo.com/user/hallalex831/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "Position Stats: TSLA 600C 12-31-2020\nRecent best performance: 100.59%\nAll time performance: 100.59%\n[Price history chart](https://tendiechart.com/pricehistory.cfm?symbol=TSLA&date=1609372800&s=600&t=C)", "score": 1, "replies": []}, {"body": "great detail. consider ghostwriting his autobiography", "score": 1, "replies": []}, {"body": "What's to appreciate? That she looks like a crack whore, or that she probably also has the intelligence of a crack whore?", "score": 1, "replies": []}]}
{"title": "Who is calling this EV bubble early? Place you Puts here", "selftext": "&#x200B;\n\nhttps://preview.redd.it/op8q199i98161.png?width=1588&format=png&auto=webp&s=57ef8745c0f97888d48a375664babf7dc754bf3c", "id": "k0a59e", "created_utc": 1606240991.0, "score": 10, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Just draw the line the other way and it goes up. Problem solved", "score": 21, "replies": [{"body": "Well there is a thought. What goes up must come...", "score": 1, "replies": [{"body": "When stocks go up they keep going up retard", "score": 5, "replies": []}]}]}, {"body": "While everyone’s over there jerking off over electric vehicles I’m over here cashing out on dead dinosaur guts.", "score": 11, "replies": []}, {"body": "Idk but make sure you short the Asians and not Tesla", "score": 7, "replies": [{"body": "Exactly. Short Bigly", "score": 2, "replies": []}]}, {"body": "I bet on an LI drop by March. Maybe a battery blows up or revenue discrepancy etc.", "score": 3, "replies": [{"body": "I am thinking end of next week", "score": 1, "replies": [{"body": "I was a little aggressive. Need it to go under $22 to really make anything happen.", "score": 1, "replies": []}]}]}, {"body": "🏳️‍🌈🐻 detected", "score": 3, "replies": []}, {"body": "NIO 24.5p 12/4/2020", "score": 0, "replies": []}, {"body": "Never know when a bubble’s gonna burst but they can be very fun in the run up. I think we’ll probably see a market cap on $TSLA around $750B and $NIO around $125B before burst.", "score": 1, "replies": []}, {"body": "With Yellen in treasury people only gonna get more stimulus checks and feed it into Robinhood like the autists they are. When’s the last time\nThe bubble popped in stock?", "score": 1, "replies": []}, {"body": "Finally made money from NIO puts. Yep, and I got out too early", "score": 1, "replies": []}, {"body": "well played sir", "score": 1, "replies": []}]}
{"title": "It all started with a yolo Tesla $550 12/4c", "selftext": "", "id": "k0a82o", "created_utc": 1606241231.0, "score": 45, "upvote_ratio": 0.94, "num_comments": 10, "comments": [{"body": "How many did you buy?", "score": 8, "replies": [{"body": "probably 420 contracts or something like that lol", "score": 2, "replies": []}]}, {"body": "why’s there no percentage next to the gain?", "score": 4, "replies": [{"body": "Good catch. Might be edited", "score": 2, "replies": [{"body": "lmfao it is. zoom in really close on his buying power. u can see the grey outline. what a cuck", "score": 3, "replies": []}]}, {"body": "Because I withdrew 20k", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "They bought a call with a strike price of $540 that expires on 12-04-20. Not sure how much they paid or how many calls they bought.", "score": 1, "replies": []}]}, {"body": "Fuckkkkk youuhh", "score": -1, "replies": []}, {"body": "Fuckkkkk youu", "score": -2, "replies": []}, {"body": "Fuckkkkk youu", "score": -3, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "k0athm", "created_utc": 1606243010.0, "score": 60, "upvote_ratio": 0.94, "num_comments": 17, "comments": [{"body": "Congrats and fuck you bozo", "score": 19, "replies": [{"body": "Thanks bb", "score": 4, "replies": []}]}, {"body": "Cool now you can qualify for day trading and lose it all", "score": 9, "replies": [{"body": "Yessss", "score": 3, "replies": []}]}, {"body": "If anyone wants to know my current positions I’m holding are : NIO $30 1/15 $29 2/19 $43 4/16 and $50 1/21/22 calls : TSLA $550 1/21/22 call : DKNG 1/15 $55 c and CRSR $40 5/21", "score": 6, "replies": []}, {"body": "Teach me ya ways", "score": 4, "replies": [{"body": "Does anyone here actually know what they are doing though", "score": 5, "replies": []}]}, {"body": "damn i really need to learn how to do these option things", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "3. annnnnnnnd its gone", "score": 14, "replies": []}, {"body": "I've just started looking into it. I barely understand ITM, ATM, and OTM so I don't think I'm quite there yet lol. \n\nIf you've got any recommendations for educational material I'm all ears.", "score": 1, "replies": [{"body": "I'm just going to go ahead and assume you're using Robinhood. Even if you aren't this video is really good at getting started. But youtube in general has tons of videos explaining options and the market in general. \n\n[https://www.youtube.com/watch?v=SD7sw0bf1ms&t=2803s](https://www.youtube.com/watch?v=SD7sw0bf1ms&t=2803s)", "score": 1, "replies": []}]}]}]}, {"body": "Congrats bro now buy the dip on NIO", "score": 2, "replies": []}, {"body": "This is the way. Don't forget to take profits!", "score": 2, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "nice", "score": 2, "replies": []}, {"body": "POSITIONS OR BAN", "score": 1, "replies": []}]}
{"title": "finally bought some Tesla", "selftext": "[removed]", "id": "k0b4jr", "created_utc": 1606243906.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 12, "comments": [{"body": "Is tsla value of 2500 per share fair?", "score": 6, "replies": [{"body": "We can only wish", "score": 2, "replies": []}]}, {"body": "Better late than never. I bought in yesterday as well.", "score": 4, "replies": []}, {"body": "Welcome to the gang my friend", "score": 3, "replies": []}, {"body": "500 shares here with a basis of $23k", "score": 2, "replies": [{"body": "wow,  I saw it but missed it", "score": 2, "replies": []}]}, {"body": "Shares?", "score": 1, "replies": [{"body": "I think that means he's *sharing* tendies?", "score": 3, "replies": []}, {"body": "18", "score": 1, "replies": []}]}, {"body": "i cant wait to get IV crush  😂  😂", "score": 0, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "You mean shares", "score": 3, "replies": []}]}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}]}
{"title": "what is with apple?", "selftext": "I made a bundle on 200 shares, then it split.  Bought 200 more for a total of 1000.  Any opinions on why it is static or declining?  After the previous split ( not the recent split)I bought it at 92  and saw it hit the moon.", "id": "k0bexv", "created_utc": 1606244739.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 18, "comments": [{"body": "its worth like 2 trillion, do you have any idea how much a 1% move of 2 trillion is? of course its barely moves", "score": 7, "replies": [{"body": "This.  I own a few thousand dollars but at this point I’m not sure I see the point.", "score": 2, "replies": [{"body": "It’s not a bad place to park money imo cause I don’t think it’ll be worth less but I don’t see monstrous growth coming", "score": 3, "replies": [{"body": "Their M chips will be pretty game changing in helping them increase margins on their laptops and their audio business continues to grow. I agree, I don’t see how it gets to 135-150 a share anytime soon", "score": 3, "replies": []}]}]}]}, {"body": "sell covered calls nerd", "score": 4, "replies": []}, {"body": "No, last earning was dog shit cuz it did not account for iPhone sales and blah blah just hold next earnings it will pop", "score": 4, "replies": []}, {"body": "It's overvalued.", "score": 2, "replies": [{"body": "True maybe the new phones will kick in some growth", "score": 2, "replies": [{"body": "here's my theory: boomers love aapl because they made tons of money on it over the past 10 years. Now it's flat and overpriced relative to earnings but nobody wants to sell cause nobody ever thinks AAPL will go down. So it stays flat. \n\nI bought stock back in 2012 and am holding it still for this reason. Sold half of it a few months ago and trying to decide when to dump the rest.", "score": 2, "replies": [{"body": "So yo are actually one of them 😂?i just keep it for fun because i have like 3 share and wtf not , maybe they pay big dividends in a couple of years.", "score": 2, "replies": [{"body": "guilty! I'm not really a card-carrying WSB member...never done an options trade in my life. I'm just here for the lulz and seeing which way the winds are blowing in this demographic.", "score": 2, "replies": [{"body": "Same im just 26 but im rather risk adverse no options for me im here for the memes", "score": 2, "replies": [{"body": "I'm 40 now, got into stocks when I was 32. Wish I'd started earlier. Mostly a hobby. Any favourites you're watching? I just bought into SUMO this morning, holding PACB (genome sequencing), and INGR (raw ingredients for food) as a few of the lesser known picks I've gone with. Also took up positions on TOT, NOK, ING, VWAGY, and a few other \"value\" stocks that looked undervalued just before the US election.", "score": 1, "replies": [{"body": "Nah im mostly bullish on china rn i buy the big dogs like baba , tencent , jd and a china etf , i want to hold for the next 5-10 years = tendies", "score": 1, "replies": [{"body": "Yeah I'm with you. I went in on BABA at IPO actually (that was a while ago!) and am holding BIDU as of a few months ago. Haven't gone for the others yet but think it's a good bet. What do you think about SE and MELI? I've been watching them for a while.", "score": 1, "replies": [{"body": "Holding both since 3 months 😅", "score": 1, "replies": [{"body": "Nice. I was afraid of them being over-valued, but am re-thinking entry.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "After the split it went up. It just isn't moving right now because there's better stocks to buy like TSLA.", "score": 1, "replies": []}]}
{"title": "People are making so much money on tesla Trading212 has stopped it's CFD offering it", "selftext": "", "id": "k0bme3", "created_utc": 1606245343.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 10, "comments": [{"body": "If ur UK the only thing close to options trading is CFDing which is where u place a leveraged bet against the trader on whether or not the stock goes up", "score": 6, "replies": [{"body": "Tastyworks my man", "score": 3, "replies": []}]}, {"body": "Wtf app is this", "score": 3, "replies": [{"body": "Europe.", "score": 4, "replies": [{"body": "Ah I see. If I fly out there can I stay at your place", "score": 6, "replies": [{"body": "Sorry no I've got a dozen or so refugees in my house already.", "score": 8, "replies": []}]}, {"body": "I feel sorry for you!!", "score": 1, "replies": []}]}]}, {"body": "Same as XPEV, NIO, PLTR, CRSR.\n\nMost meme instruments are already topped out", "score": 3, "replies": [{"body": "CRSR is good I think", "score": 2, "replies": []}]}, {"body": "What a shitty platform. Had to go to my expensive ig account to make some cash monies.", "score": 2, "replies": []}]}
{"title": "Took losses today on 2021 and 2022 OTM $AAPL calls held since July after theta burn. All in mostly on $PLTR. When should we start to cycle back into $AAPL?", "selftext": "", "id": "k0btgj", "created_utc": 1606245906.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 10, "comments": [{"body": "You had 2021 and 2022 calls? You did not have theta burn. Theta doesn’t really become a problem until the last month, and than really the last week.", "score": 7, "replies": [{"body": "Was probably IV burn", "score": 1, "replies": []}]}, {"body": "No. Long pltr", "score": 7, "replies": []}, {"body": "Apple? Old news. All in PLTR", "score": 4, "replies": []}, {"body": "Oh yes I did. $185 and $250 strikes", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I did but all reinvested after incredible summer run. Still made a lot on the trade but should have got out at 135.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Wasn’t overly worried but wanted to put capital to better use in $PLTR. Any predictions on when $AAPL will be hot again?", "score": 2, "replies": []}]}]}]}, {"body": "$AAPL is like a MILF that was hotter than ever after COVID hit but then turned fugly after oversized COVID 15.", "score": 2, "replies": []}, {"body": "APPL is at 2t valuation. They need sthing massive to move them.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I was half in at 10. Worked out well so far. ;)", "score": 2, "replies": []}]}]}
{"title": "What a fucking year. Up 25.9% YTD after a drawdown of $1.4M in March. It's been a wild ride and after 9 months of drama I finally established a new ATH. Thank you AAPL, AMZN, APAM, BX, & PLTR!", "selftext": "", "id": "k0c2xp", "created_utc": 1606246683.0, "score": 49, "upvote_ratio": 0.9, "num_comments": 16, "comments": [{"body": "Hey remember when I gave you that gum in math class, yeah can you pay me back\n\nEdit: but congrats dude", "score": 8, "replies": [{"body": "Thanks!  I had a big margin loan so I was sweating bullets for a while.", "score": 4, "replies": [{"body": "Understandable haha but feels good winning", "score": 2, "replies": []}]}]}, {"body": "fuck you and congrats\n\n&#x200B;\n\nedit: adopt me?", "score": 6, "replies": []}, {"body": "no tesla?", "score": 3, "replies": [{"body": "A long time ago I shorted TSLA, made money, and got out right before it exploded (Thank God or I would be broke).  I don't want to tempt fate.  But I am jealous of the gains for sure.", "score": 6, "replies": []}]}, {"body": "The graph indicates this guy doesn't do options. I can tell by the volatility.", "score": 3, "replies": [{"body": "You are mostly right.  I do buy LEAPS in one account but it is a small percentage overall (maybe 5% of the value of the combined accounts)", "score": 1, "replies": []}]}, {"body": "Nice. Current positions?", "score": 2, "replies": []}, {"body": "Daddy?", "score": 2, "replies": []}, {"body": "Dad? Can you venmo me gas money ?", "score": 2, "replies": []}, {"body": "Immediate reaction was to laugh and say you idiot. So you managed to stay rich, grats my dude indeed", "score": 2, "replies": []}, {"body": "Standard & Poors, is that you?", "score": 3, "replies": []}, {"body": "damn", "score": 1, "replies": []}, {"body": "Congrats and fuck you", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I am waiting for WSB to tell me!  (I'm only half joking).  Honestly, and I know this is very un-WSB, I think boring is about to become the new exciting.  But we'll see--other than piling into PLTR I am in a holding pattern on most of my other trades.", "score": 3, "replies": []}]}]}
{"title": "My thoughts are to let these go till it’s listed on the s&p 500 dec 21st. Thoughts ? $TSLA", "selftext": "[deleted]", "id": "k0c4bk", "created_utc": 1606246795.0, "score": 10, "upvote_ratio": 0.82, "num_comments": 11, "comments": [{"body": "💎", "score": 6, "replies": []}, {"body": "Am wondering the same thing. My fear is Elon is a loose cannon lol.", "score": 4, "replies": []}, {"body": "Can’t imagine much will happen specifically on the 21st but also not a bad hold", "score": 2, "replies": []}, {"body": "Never bad to collect profits with a crazy run up like this", "score": 2, "replies": []}, {"body": "Sell before. I can’t find the post to link, but basics to another users DD was that the S&P announced the addition so far ahead of the date it’s actually being added because the indexers have to buy up enough shares to carry while the stock is part of the S&P 500... something like $34B worth.\n\nOne could assume that once enough shares are bought, the trading volume MIGHT drop and the price might dip.\n\nAs other users said before, never bad to collect gains ¯\\ _(ツ)_/¯", "score": 2, "replies": [{"body": "I sold 1 and I’m keeping 1 . Thank you !", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "What", "score": 1, "replies": []}]}, {"body": "Maybe a little before,\n\n5x 1/15 500c (bought around 480/490)\n\nEnjoy the tendies", "score": 1, "replies": []}, {"body": "Sell 1 & let 1 ride if you’re scared", "score": 1, "replies": [{"body": "That’s what I did", "score": 1, "replies": []}]}, {"body": "Roll them up to 650s", "score": 1, "replies": []}]}
{"title": "We are the market.", "selftext": "These old bulls have slowly started to plow into the forest and don't realize why they keep running. Earnings per share? How are the old-growth stocks doing? Don't get me wrong, for the investors, and that's the keyword of this post, INVESTORS, who gave their cash to companies, decades ago, to see them grow like IBM, telecom stocks (ATT), computer hardware and software companies, tobacco (MO), pharma (CVS, PFE), big oil (XOM), whatever else you can picture with mud still clinging to its old shaking knees is exactly what the old bulls formerly bought into so that they could experience life in SPCE.\n\nThose great companies that still bring in revenue are dependant on Earnings Per Share and other boring but essential metrics to watch those slow-ass crops of old grow what little percentage points they still can. So do we care about Earning per Share? Yeah marginally, of course, we want to make a rate of return that beats inflation. Cash gang is almost Bi-🌈🐻. But what is the original idea behind investing other than the giant Plutocrats that need a place to sit on their Bi-🌈🐻 cash-mountain while they wake up not knowing why they are still alive and the game hasn't restart? Well, it's to give cash to the finite producers of the world to watch them fucking grow.\n\nI swear every other old bull is historically embarrassed they were once us and investing in shit that aimed for the moon while it was still in a garage. Now we have to remember for them because they are old bulls and old bulls sometimes forget to fucking plow. They may be sitting on their cash Bi-🌈🐻 hills now and not looking towards the horizon and starting to face plant into the dirt, but we're still ready to bust one for the future.\n\nSo why do we hear about pump and dump when it's really pump and pump? We decide where the market goes. We get to invest in whatever we decide is the future of the Earth-Mars marketplace.   We are the market.", "id": "k0cbz1", "created_utc": 1606247421.0, "score": 19, "upvote_ratio": 0.92, "num_comments": 12, "comments": [{"body": "Solid DD", "score": 3, "replies": []}, {"body": "Tendyfied", "score": 3, "replies": []}, {"body": "Don't mix up growth with overvaluation. Sure, there are a lot of companies right that have huge multiples but they potentially have a fundamental business model that can grow (not maybe to the extent their multiple implies) significantly over the next few years. There comes a point however, under name of growth, everything becomes muddled and then you see the bubble popping up.\n\nWhat is happening with EV is something similar to what would have happened if we had financial markets and technology available to us in the early 1900s. While people knew that auto industry was obviously going to change everything we knew, if you look back winners after 100 years, only a few survived, and with small gains/margins. Clearly, nobody could have picked winners or how profitable survivors would going to end up.\n\nEven though I agree first mover is def advantage, I don't think EV market can exhibit \"network effects\" and 20 years from now we could totally be looking at a major EV car or car company that is far more profitable/has a better technology/design that does not exist today.\n\nSo while EV clearly will be the winner as a whole, it is totally different for an individual company perspective. But it can take many years before this whole thing fades and consolidates.", "score": 3, "replies": [{"body": "Maybe 2030 when gas is pushed out. How long was the tech bubble up?", "score": 1, "replies": []}]}, {"body": "Well said!", "score": 2, "replies": []}, {"body": "I have Pfizer shares and call but I agree 😂", "score": 2, "replies": [{"body": "PFE moves only one direction. Sideways.", "score": 2, "replies": [{"body": "I’m in this with my fellow autist boy Dr. Michael Burry. Scion has sizable PFE calls 😎🚀", "score": 2, "replies": [{"body": "I wish you the best of luck! I had calls guessing they would have successful phase 3 trials. The stock only went up 8% that day and was down a fair amount from my purchase price. Still got 30% profit.\n\nI made a higher percentage on just owning CNK stock which bounced 50% on the news.", "score": 2, "replies": [{"body": "Thanks bro lets get it.", "score": 1, "replies": []}]}]}]}]}, {"body": "\"Earth-Mars marketplace\"\n\nLMFAO. What a time to be alive...", "score": 2, "replies": []}, {"body": "GME is the future!", "score": 1, "replies": []}]}
{"title": "Bull Trap?", "selftext": "The entire Market is currently mooning, including NKLA. Given that NKLA is literally fraud and will be bankrupt within a year, doesnt this prove we are in a bubble?", "id": "k0ckj3", "created_utc": 1606248136.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 18, "comments": [{"body": "You’re a fucking bubble", "score": 27, "replies": [{"body": "And a retard", "score": 3, "replies": [{"body": "A bubble retard", "score": 4, "replies": [{"body": "a fucking bubble retard", "score": 1, "replies": []}]}]}]}, {"body": "Stocks. Go. Up.", "score": 5, "replies": []}, {"body": "how often do we teach you this lesson, old man?", "score": 8, "replies": []}, {"body": "Enjoy and ride while it lasts!", "score": 1, "replies": []}, {"body": "Maybe though I think it's a tad too early to call it that, there are catalysts behind today's moon such as more vaccine news, Trump conceding, and new treasurer.\n\nIf this level of rise continues into next week I might hedge with some puts.", "score": 0, "replies": [{"body": "I agree with that, and am long term Bullish...but NKLA has none of that. There is no reason for NKLA to be going up, yet it doubled", "score": 0, "replies": []}, {"body": "The catalyst doesn’t mean anything if the infection rate is 100,000k a day. This market is irrational to the point it doesn’t make sense. This is all great news and all but doesn’t solve the problem.  Look at the greed and fear index on CNN. It is correlated with last few dips. I’d be hella concerned if I was a bull.", "score": 1, "replies": [{"body": "Relax dude it was 2 green days in a row and today it's looking red. We're much closer to a vaccine now than June or August. There is no reason to dump stocks right now.", "score": 2, "replies": [{"body": "The point I made, calmly, was that regardless of how close we are to a vaccine, it does not solve the indirect consequence of rising covid cases in the short term.  \n\nI’d be happy to rephrase it if you still don’t get my point. 🌈🐻", "score": 2, "replies": [{"body": "Well markets are forward looking and they're seeing a definitive end point. If something goes wrong and changes that then yeah stocks crash.", "score": 1, "replies": [{"body": "I agree", "score": 2, "replies": []}]}]}]}]}]}, {"body": "No, NKLA has like a billion in cash on hand, someone (probably GM) is gonna take over. So the price reflects that speculation", "score": 1, "replies": []}, {"body": "So?", "score": 1, "replies": [{"body": "NKLA is my Canary. I Know its overvalued, and it rose about the same amt as the rest of the MKT, so doesnt that mean all the gains are on...nothing?", "score": 1, "replies": [{"body": "Yeah, so?", "score": 1, "replies": []}]}]}]}
{"title": "Everyone out here hyping PLTR, NIO, and TSLA and I'm just chilling with F", "selftext": "", "id": "k0cp5p", "created_utc": 1606248527.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 14, "comments": [{"body": "Boomer asf", "score": 22, "replies": []}, {"body": "disgusting", "score": 19, "replies": []}, {"body": "You realize that if you buy just 1 contract you can make that same amount of profit with a fraction of the capital?", "score": 9, "replies": [{"body": "Tbh I know you're right. I'm pretty shit with options trading, so I just stick to stocks. Less effective? Hell yeah. But, I'm more comfortable in knowing what the fuck is happening then yoloing prems", "score": 3, "replies": [{"body": "Fair enough. Took me while before I bought my first option. Nothing worse than losing money and not understanding how.", "score": 4, "replies": []}]}]}, {"body": "U make pennies while we make dollars", "score": 3, "replies": []}, {"body": "Same with those GE options", "score": 3, "replies": []}, {"body": "Stocks that don’t up at least 10% are gross 🤮", "score": 3, "replies": []}, {"body": "Only 1k? And in Ford fuck that", "score": 4, "replies": [{"body": "Not all of us can yolo 10k homie", "score": 1, "replies": []}]}, {"body": "Pathetic", "score": 1, "replies": []}, {"body": "FORDDD BABY LETS GO\n\n\n my 9c 1/15/21 contracts ready to hatch 🥚", "score": 1, "replies": []}, {"body": "I'm the definition of not a YOLO person...but how DARE you come here and trample on the graves of giants like u/controlthenarrative and u/1R0NYMAN just to show off a $300 gain in Ford. You should be ashamed of yourself.", "score": 1, "replies": []}, {"body": "‘Murica 🇺🇸", "score": 0, "replies": []}]}
{"title": "Elon Musk has only made $12,700,000 /hr this year", "selftext": "As of yesterday he broke 100B in gains this year on his Tesla Calls. We are approximately 7872 hours into 2020.\n\n100,000,000,000 / 7872 = $12,703,252\n\nWhat this has made me realize is that I should also buy TSLA calls. \n\n11/27 600C", "id": "k0cvq0", "created_utc": 1606249100.0, "score": 110, "upvote_ratio": 0.94, "num_comments": 16, "comments": [{"body": "Elon found the gta money glitch irl", "score": 51, "replies": []}, {"body": "I hope he gets all this employees a bonus this year for all the hard work that culminated into this accomplishment.  A bonus ham or an extra lump of coal maybe.", "score": 10, "replies": [{"body": "TSLA employees all get stock. Even the factory workers.", "score": 6, "replies": []}, {"body": "Hey commie bitch TSLA employees get paid a lot go cry passive aggressively some more.", "score": -8, "replies": [{"body": "I think you dialed the wrong number, sir.", "score": 2, "replies": [{"body": "Yeah you would flee from your own bs\n\n>lump of coal\n\nCry more", "score": -6, "replies": [{"body": "It was a joke referencing A Christmas Carol.  Stop acting like angsty teenage brat.  No one is crying here you nut.", "score": 2, "replies": [{"body": ">I’m not saying he’s miserly I’m just comparing him to Scrooge \n\nAre you stupid? Because before you were pretending TSLA doesn’t comp well which is stupid enough. But now you’re pretending that wasn’t your point by saying the #1 “I’m talking about the selfish guy whose employees are too poor to eat” story you could think of. Christ that’s stupid.", "score": 0, "replies": [{"body": "I never said TSLA doesn't comp well.  Your whole aggressive premise is a strawman.   And you're getting bent out of shape over it.  \n\nYou need serious mental/emotional help man. I'm sorry.", "score": 0, "replies": [{"body": ">I never said TSLA didn’t comp well. I just implied Elon screws his workers by pining for him potentially handing out coal because I see him as equivalent to Ebenezer Scrooge\n\nIt gets dumber and dumber\n\n>if you don’t agree with all my double speak it’s because you’re in mental crisis\n\nMaybe you’re in crisis dipshit. If you believe anything that you’re saying.", "score": 0, "replies": [{"body": "Well let's see here.  So far you've called me:\n\n* a 'commie bitch' and told me to 'go cry passively aggressively some more.'\n* further to 'cry more'\n* asked me if I'm stupid.\n* and doubled down on my supposed stupidity.\n\nAfter all of this you're telling me *I'm* crying?  You're unhinged.  And you lack the ability to discern what other people are saying versus what you want them to say, in order to attack them.\n\nYou have nothing of value to provide to this interaction.  Please just stop.  You're digging yourself into a bigger hole with each remark.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Position Stats: TSLA 600C 11-27-2020\nRecent best performance: 4,920.00%\nAll time performance: -66.97%\n[Price history chart](https://tendiechart.com/pricehistory.cfm?symbol=TSLA&date=1606435200&s=600&t=C)", "score": 5, "replies": []}, {"body": "remember that thursday is closed and friday is a half day", "score": 4, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**TSLA**|**$600**|**BUY CALL**|**2020-11-27**|**$2.64**|**$558.3459**|**13817**|**59604**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckhwfawvq9tpz0716cc5k5cmx) | [Track Record](https://www.pickmojo.com/user/pumpkinparty000/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 3, "replies": []}, {"body": "Calculate that by 2080 full time hours in one year minus December", "score": 3, "replies": []}, {"body": "I am going to ask the question. How do puts work? I read these things like 11/27 but whay does it mean", "score": -1, "replies": []}]}
{"title": "AMZN taketh, PLTR giveth", "selftext": "[deleted]", "id": "k0cy52", "created_utc": 1606249325.0, "score": 20, "upvote_ratio": 0.92, "num_comments": 11, "comments": [{"body": "Fuck man, you're up for all time! Cashing out or double or nothing? A really baller move would be to take out everything but the $0.68 and use that to get back to where you are now so your whole portfolio is profit", "score": 7, "replies": [{"body": "I locked in most of the gains. Still holding some long term calls - PLUG 35c 1/21/22, PLTR 12.5c 2/19/21 and RKT 35c 1/21/22", "score": 2, "replies": [{"body": "That PLTR call is gonna print so hard. I'd personally dump the RKT call, that shit is more like the Challenger space shuttle, or Apollo 13 maybe? Didn't explode but it couldn't make it to the moon, limp that shit back to earth before it's too late!", "score": 3, "replies": [{"body": "We'll see. I don't believe in the company. I'm just holding out for a pump n dump soon. I might cash out since I'm up 20% right now", "score": 1, "replies": []}]}, {"body": "What was the premium on that long PLTR?", "score": 1, "replies": [{"body": "500$ Its not a yolo by any means", "score": 1, "replies": []}]}]}]}, {"body": "Amzn about to pop... jan 4000 calls only 600$. Perfect gamble", "score": 1, "replies": [{"body": "Yeah I'm looking into that. I just lost everything on AMZN calls back during the Sep-Dec 2018 dip", "score": 2, "replies": [{"body": "She a tuff nut but when she hits she hits", "score": 1, "replies": []}]}, {"body": "I'm a call-holder of AMZN too but I'm getting quite agitated with its performance as of late - while it did go up today, its gains paled in comparison to other FAANG stocks (literally all 1-3% +)...any idea why?", "score": 1, "replies": [{"body": "People used amzn and other gang stocks as a store of wealth during covid. Post covid people are selling fang stocks to speculate on recovering industries", "score": 1, "replies": []}]}]}]}
{"title": "Quality DD", "selftext": " \n\n* Actually makes profit\n* gov contracts\n* aims to lower hydroprocessing emissions\n* automation\n\nI bought as a meme stock then looked into it more.\n\nhttps://preview.redd.it/tujomtbqd9161.png?width=1291&format=png&auto=webp&s=67fea17e480eef2486fd7f15eb485fbc64baae38\n\nGross Profit – Gross profit for the year ended December 28, 2019 was $7.9 million, an increase of $1.0 million, or 14.2%, from $6.9 million for the comparable prior year period. Gross profit margin was 14.0% for the year ended December 28, 2019, an increase from the 12.8% gross profit margin for the year ended December 29, 2018. Gross profit in the Automation segment increased $2.4 million, or 60.3%, to $6.3 million for a gross profit margin of 17.0% for the year ended December 28, 2019 as compared to $3.9 million with a gross profit margin of 13.1% for the year ended December 29, 2018. The increase in gross profit is primarily due to increased utilization of personnel.\n\nRevenue – Overall, our revenue for the year ended December 28, 2019, as compared to the year ended December 29, 2018, increased $2.5 million, or 4.5%, to $56.5 million from $54.0 million. Revenue from the Automation segment increased $7.2 million, or 24.0%, to $37.0 million for the year ended December 28, 2019, as compared to $29.8 million for the comparable period in 2018. Revenue from the EPCM segment decreased $4.7 million, or 19.5%, to $19.4 million for the year ended December 28, 2019 as compared to $24.1 million for the comparable period in 2018. Our 2019 revenue for the EPCM segment continued to be negatively impacted by the sustained reduction in oil and gas prices and the resulting drop in our clients’ activities in the upstream, midstream and downstream sectors of the energy industry. The Automation segment benefited from a significant downstream project awarded in 2019 for the production of clean fuels as required under new international standards in the maritime fuel sector.\n\nThats right it actually made a profit of 7.9m. With a market cap of 79million, that makes a profit to company valuation ratio of 1:10\n\ncompare that to AAPL with a net profit of 57.4 billion and market cap of 1.96 trillion making a profit to market cap ratio of 1:34\n\naccording to that the stock should go up 300% more.", "id": "k0elct", "created_utc": 1606254520.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 17, "comments": [{"body": "You compared this kinda EV stock to Apple? Please sell before youre left holding a bag", "score": 6, "replies": [{"body": "Okay compared to TSLA which had a net profit of -862 million in 2019 to a market cap of 526 billion would make it a profit to market cap ratio to something that I cant math.", "score": 0, "replies": []}]}, {"body": "Couple things.\n\n- just use P/E ratio (same thing really)\n\n-Apple is not the comp you are looking for there\n\n-look for better comps if you’re using multiples for valuation. Something in same industry or business structures\n\n-I’d recommend qualitative forward look at on the ground business operations competitively. Who do they compete with? How do their products line up comparison for price&performance ect\n\nNot a bad job though. Just wouldn’t use Apple as a multiple comp", "score": 5, "replies": [{"body": "thanks for the constructive comment. I'm not done researching this one was just amazed it made a profit.", "score": 3, "replies": []}]}, {"body": "I bought at 1.50 and sold at 4.00 will not enter again until it holds a stable position over 10. Then I will actually hold long term and invest.", "score": 3, "replies": [{"body": "🌈🐻 hold the fuckin line man", "score": 1, "replies": []}]}, {"body": "Heyyy this isn’t palantir", "score": 2, "replies": []}, {"body": "Stop the penny stock pumping", "score": -1, "replies": [{"body": "Check it’s volume and cap first u retard", "score": 1, "replies": [{"body": "78m market cap, you don’t think that’s a penny stock?\n\nVolume today was 53m compared to its normal average of....less than 1m", "score": 1, "replies": []}, {"body": "Volume went up by 3M today", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/gman1123 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "It took a massive dip this morning but it still has the potential to reach 5 by January when Biden comes in", "score": 1, "replies": []}, {"body": "Tendie town. In for 800 shares to forget about.", "score": 1, "replies": [{"body": "The volume went from 51M to 54M today", "score": 1, "replies": [{"body": "Not sure what that means but I got into nio at $5, watched it go all the way down to ~1.50 and then up to $50. This company has some solid fundementals and is very under valued. Not a good idea to get in at a 52 week high but w/e I can add another 5k shares and not care.", "score": 2, "replies": []}]}]}]}
{"title": "Do you want FOMO or a low price.. LGVW and THCB about to pop autists don't be a FOMO or FUD merchant and join the ride", "selftext": "[removed]", "id": "k0eoug", "created_utc": 1606254840.0, "score": 36, "upvote_ratio": 0.95, "num_comments": 20, "comments": [{"body": "GIK i tell u. Merger announcement next week. (Hopefully)", "score": 3, "replies": []}, {"body": "Merger agreement is being moved to April, why sit on them when you can buy a house with palantir stocks", "score": 4, "replies": [{"body": "Which one was moved to April?", "score": 1, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Got it, thanks", "score": 1, "replies": []}]}]}]}, {"body": "Gimme dd on lgvw", "score": 1, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "This shit should legit be wsb mantra", "score": 3, "replies": []}]}, {"body": "to me it is all about the portability and a refresh of old tech\n\nI don't get how THCB is cutting edge though. I almost bought this morning but decided against it when i saw chatter about the merger date being pushed and i couldn't figure out how they separated themselves from other charge points", "score": -3, "replies": [{"body": "They are pushing back the deadline from December 7th to April and having the vote on the 3rd. They could literally announce the merger on the 4th or the 8th or the 30th. This is just to provide additional time if needed. And what other charge points??? And are you retarded. Most SPACs merge with company’s that don’t even have a product and moon. This EV battery company does and its one of the best if not the best in the industry. That’s why there’s so much hype around this merger.", "score": 5, "replies": [{"body": "umm ChargePoint, Blink, Sema, EVConnect, hell even Telsa.. am i missing something about Microvast?", "score": 2, "replies": [{"body": "They make battery’s that can last for the life of the vehicle and can be fully charged in as little as 10 minutes. They are also playing in the Chinese market and not the U.S.? Have you researched this company at all? You are comparing them to charging stations and EV car makers.", "score": 4, "replies": [{"body": "Interesting... who would potentially buy their batteries vs creating their own? Any Chinese ev makers we know?", "score": 1, "replies": [{"body": "Look man I just need this EV company to hit 30 dollars, not 50 like NIO or 500 like Tesla. It might not be revolutionary or greatest thing since slice bread but I think it’s worth 30 a share and if not? Idc I make profit on anything above 12", "score": 3, "replies": [{"body": "Fair, $20 to $30 is doable with enough interest. Have a longer horizon until merger now so price can creep up", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "yup, glad i diversified a bit from EV/Clean Energy yesterday", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}
{"title": "3k->20k Done the \"RIGHT WAY\" (actually held shares)", "selftext": "I'm 19 and trying to accumulate some fuck you money. Deposited 3k a while back and picked some stocks it went well. Completely avoided meme stocks picked some small cap stocks that had great financials and were trading like they were about to declare bankruptcy. Never traded an option in my life.\n\nhttps://preview.redd.it/n4n99bx8e9161.png?width=1047&format=png&auto=webp&s=98b057a2b95ba49cdcf13918aed6e605c408609f\n\nPositions:\n\nAPHA\n\nSAVE\n\nUVXY\n\nAccording to these guys I still got 16k worth of buying power, so tell me about an undervalued stock and I might actually buy it. Don't tell me about a 10 billion dollar company that is trading at 20x sales that just had some 15 million dollar deal that will do great things for it.\n\n&#x200B;\n\nEdit: Imma getting a lot of hate so I want to emphasize this again. Fuck investing in meme stocks. Fuck PLTR, Fuck NIO, Fuck GME, Fuck TSLA, Fuck AMZN, ect... They are all overvalued or fairly valued and deserve to go down.", "id": "k0ex7l", "created_utc": 1606255602.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 15, "comments": [{"body": "Sir this is a Wendy’s", "score": 35, "replies": [{"body": "Did the customer accept the Krusty Krab Pizza?", "score": 1, "replies": []}]}, {"body": "Why does every fucking post start with “I’m 19” no one gives a shit", "score": 66, "replies": [{"body": "If your girlfriend is 16, some states give a shit", "score": 32, "replies": [{"body": "got emmm", "score": 7, "replies": []}]}]}, {"body": "Ban", "score": 19, "replies": []}, {"body": "Ban for buying shares of non meme stocks", "score": 30, "replies": []}, {"body": "Now it’s time to yolo!!!!", "score": 10, "replies": []}, {"body": "Bro you gotta yolo your cash. I was up 10k in summer, lost all my profits and in the hole $5k now I’m almost even with principal. Buying and holding shares is for pussies. Man the fuck up and play options.", "score": 12, "replies": []}, {"body": "Shit dawg this is wallstreetbets all we do is yolo into stocks. Have you seen the number of posts on palantir or nio or Li or any other swwwwwweeeet tendy stocks? \n\nOk for real though how about recaf? They are searching for oil in Africa and have a play the size of the Eagle Ford leased from a couple governments lead by a smart group of older oil and gas executives. That’s all I got for you now dawg!", "score": 8, "replies": []}, {"body": "You retard. If you bought gme when I did and invested that 3k in april 12c leaps you would have netted 51k in profits at today's price. That's a real flex. Your boomer ways are making you lose big potential profits.", "score": 5, "replies": [{"body": "Our definition of meme stocks are different. You buy before it becomes a meme stock you dont buy NIO at 50.", "score": -1, "replies": [{"body": "Ah. I understand. Carry on sirfluffypuffs", "score": 3, "replies": [{"body": "Pee HARD to keep your bladder STRONG!", "score": 1, "replies": []}]}]}]}, {"body": "Good for you, thats the way. Love your apha position, but wtf is wrong with you and that uvxy shit?", "score": 2, "replies": []}]}
{"title": "Update: my dad is now proud of me.", "selftext": "A while back I posted about how my dad was pissed because I told him to but Tesla but in recent days as y’all know the prices have been going up:). I wanted to say thank you to all you retards you’ve given me something to bond with my dad about.", "id": "k0eysm", "created_utc": 1606255738.0, "score": 21, "upvote_ratio": 0.84, "num_comments": 10, "comments": [{"body": "Did he spank you? Wtf is this?", "score": 37, "replies": [{"body": "Rofl", "score": 2, "replies": []}]}, {"body": "I think I posted this story under your old post but maybe it was some other autist.\n\nWhen Tesla IPOd I was a broke college student and had like 650 to my name. Told my dad I was going to put it all in on Tesla at $16 a share or whatever it IPOd at. He told me I was retarded and should buy penny stocks \n\nI still bring it up anytime we’re talking about money", "score": 12, "replies": [{"body": "Damn, $16.  What a move mate", "score": 1, "replies": [{"body": "Would’ve been a move if my dad didn’t convince me that penny stocks was the wave. I did open my etrade account like a year ago and find like $1200 in it. So I guess I at least doubled my money, I think I pulled out like 500 on top of that when I was younger, but still missed out", "score": 2, "replies": []}]}]}, {"body": "My dad used to beat me", "score": 3, "replies": []}, {"body": "Nothing can be this wholesome here", "score": 6, "replies": []}, {"body": "Is he back to touching you again?", "score": 5, "replies": []}, {"body": "Congrats mane!!!!!!!", "score": 1, "replies": []}, {"body": "I told my dad to sell Tesla for Amazon when tesla was at 450 and Amazon was 2950. I was bragging for a couple weeks now I’m never gonna live it down lol", "score": 1, "replies": []}]}
{"title": "IT IS NOT TOO LATE TO GET INTO TSLA!", "selftext": "I see people here regret not getting into TSLA as soon as the announcement happened. I mean any sensible person that wants to make money would've got into TSLA on Tuesday/Wednesday of last week. I knew it would hit 600 by inclusion date but didn't think it would go up this much so fast already. To everyone who thinks it's too late, IT'S NOT. GET IN NOW BEFORE IT POPS EVEN FURTHER. \n\nDuring my careful analysis of the other tesla posts and comments in this sub, a couple of major indexes has to buy millions of shares before December 21. Now these huge indexes are probably counting on people to paper hands their shares at 450, 500, 550, etc. and buy them up slowly, causing the price to steadily rise. If all us autists who have shares and calls STOP FUCKING SELLING from now on, the indexes will have no choice but to buy at current prices, causing the price to skyrocket. Again, during my extreme analysis with charts and graphs which I cannot post here for confidential reasons, indexes will probably look at the last week before inclusion to buy heavily if they see us not selling.\n\nHonestly, TSLA will probably hit 600 this week and run up to 750 by 12/18. GET IN NOW AND DIAMOND HANDS THIS SHIT.\n\nEverything I said here comes from my ass so do that as you will.\n\nPositions: 2x 12/24 550c bought after announcement.", "id": "k0fodg", "created_utc": 1606258101.0, "score": 8, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "Bro 750 by Dec. 21st, 1000 by end of March 2021", "score": 12, "replies": [{"body": "The S&P inclusion for Tesla got changed to Dec. 1st BTW.", "score": 1, "replies": [{"body": "Thanks for the heads up, was unaware", "score": 2, "replies": []}, {"body": "I looked on Google, couldn't find any info there on the date change. Could you kindly share a link? Appreciate it.", "score": 1, "replies": []}]}]}, {"body": "Give me a spread so I can afford to get in. My dumb ass has 500c and 510c and feel really retarded for capping my profit this much", "score": 1, "replies": [{"body": "You sold calls?", "score": 1, "replies": [{"body": "Bought 500c sold 510c. So capped my profit to like 700 when you include what I paid for the difference in price between contracts", "score": 1, "replies": [{"body": "Oh damn, sucks but profit is profit man. Still...sucks.", "score": 1, "replies": []}]}]}]}, {"body": "Trying to figure out if I want to sell you these options or start looking for a put entry.", "score": 1, "replies": []}, {"body": "Feeling pretty good about getting on the TSLA train right after the 5-way split!  👍", "score": 1, "replies": []}, {"body": "$620 call 1/15/21", "score": 1, "replies": []}]}
{"title": "WSB Calls the Top", "selftext": "I think we can all agree the market right now is retarded. Stupid high valuations, SPAC pump and dumps, China-mania, all while the real economy collapses and the country is about to go back into lockdown. Most concerning of all, there have been nothing but gain posts for the last few days, and that screams bear flag. Not even mama Yellen can save this steaming pile of bull-shit. \n\nObviously we shouldn't start sucking cock and buying SPY puts while we're still making money. Ride the wave, etc, etc. But unfortunately for the retards, stonks do sometimes go down, and if that happens we are all fucked.\n\nI just read that \"fundamentals\" DD about how 90+% of the market runs through passive loser funds that follow the retail geniuses here at WSB. It seems simple to me that if we are capable of causing the current bull runs on tech, EV, SPACs, whatever, we can also start a bear run. So we just gotta figure out a way to coordinate, if a critical mass of retail sells off and flip bear: the algos follow us, the market collapses, and we all get filthy rich and gay like we always wanted to be. If we don't start the inevitable bear market, then eventually some Wall St Christian Bale fuck will.\n\nFor once, the institutions will hold our bags. Even if it fails, at least we'll show them we're gay before our account goes to 0.\n\n&#x200B;\n\ntldr:\n\ngme 20c 1/15", "id": "k0gr8a", "created_utc": 1606261847.0, "score": 13, "upvote_ratio": 0.72, "num_comments": 13, "comments": [{"body": "Shoo! Shoo! Get outta here bear!!", "score": 15, "replies": [{"body": "I can't read anything other than positions. What language was that first bit.", "score": 5, "replies": []}, {"body": "You need to use Twinkies to lure them away.", "score": 1, "replies": []}]}, {"body": "Stfu nerd, all in on thcb", "score": 9, "replies": []}, {"body": "Can't identify whether OP is a boomer or 🌈 bear. Lookin a little bit like both. It's as if a boomer + 🌈 bear had a child and created OP.", "score": 5, "replies": []}, {"body": "Thanks.  Gme calls it is.", "score": 9, "replies": []}, {"body": "The difference is we are experiencing a worldwide transfer of wealth, and the market is where it's being transferred through, meaning if you are smart (or autistic) enough to play the market while it's happening, it will be easy to ride to tendie town. Now quit being 🌈🐻 and double down on your positions!", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "All the oil and banks are still low but are catching up. I'm up 40% on oil.", "score": 1, "replies": []}, {"body": "I usually swing trade but ur right holding overnight is a shot in the dark. Real economy is so disjointed at this point, I wish I had a 🐻 crystal ball to time crash.", "score": 1, "replies": []}]}, {"body": "lmao the tldr", "score": 3, "replies": []}, {"body": "There’s a name for that, it’s called securities fraud", "score": 3, "replies": []}, {"body": "Nigga shit up", "score": 1, "replies": []}, {"body": "“90+% of the market runs through passive loser funds that follow retail geniuses here at WSB.”\n\nNot. Even. Close.", "score": 1, "replies": []}]}
