{"title": "Are we in Bear rally territory?", "selftext": "[deleted]", "id": "v1cwzw", "created_utc": 1653953851.0, "score": 51, "upvote_ratio": 0.77, "num_comments": 73, "comments": [{"body": "Remember, access to the stock market works both ways. It makes it easier to buy into the market, but it also makes it way easier for everyone pull out. And institutions and the big banks have the red phone to the market.", "score": 29, "replies": [{"body": "Most guys aren’t good at pulling out though", "score": 22, "replies": [{"body": "my dad ain't either", "score": 10, "replies": [{"body": "You know my dad?", "score": 5, "replies": []}]}]}, {"body": "I think this means we will see a lot more volatility.", "score": 2, "replies": []}]}, {"body": "In my experience I don't fight the Fed.  If they are increasing interest rates, I'm not bullish.", "score": 91, "replies": [{"body": "This right here. The Fed is doing the exact opposite of what they’ve been doing for the past decade (which fueled one of the best bull runs in history). The Fed is sucking all the oxygen out of the market", "score": 8, "replies": [{"body": "Also QT is starting on Wednesday. The last time that happened the Fed needed to do two emergency rate cuts to save the repo markets.", "score": 4, "replies": []}]}, {"body": "To play devil's advocate though, in the past the stock market has usually gone UP after interest rate hikes", "score": 1, "replies": [{"body": "I really dont care i play the stock not the market invest in good business", "score": 1, "replies": []}]}]}, {"body": "No one knows what the market will do. It may go up; it may go down; it may go sideways.\n\nIn the long run, markets prevail. I continue buying into my portfolio and I stopped looking back in March", "score": 46, "replies": [{"body": "Every market crash is a new one, and different from the last one, we’ll never have two that are the same. It’s also human nature to compare and categorize things. \nContinue to DCA, the markets will prevail in the long term.", "score": 7, "replies": [{"body": "Perfect this is 100% true", "score": 1, "replies": []}]}, {"body": "You might wanna look…", "score": 0, "replies": []}, {"body": "That's not exactly true though, some people do know", "score": 0, "replies": []}]}, {"body": "With the oil prices the way they are and supply chain issues people will have less money to spend on things they want which will lead to lower profits and layoffs. This on top of all the tech layoffs that have happened and are happening as we speak. The labour market is just going to get worse.", "score": 7, "replies": [{"body": "Anecdotal for sure but several of my friends n tech in different cities in different states have echoed that big layoffs are coming for the tech world. I really wonder what triggered it. I think that people are realizing that there is too much tech trying to sole entirely minuscule problems, just like the dot com bubble. Too many players promising way too much return and not living anywhere close to the hype. Who the fucks needs a motion sensor activated sink that runs on 8 double a batteries??? Like god damn how hard is it to just use your wrist to pull the knob down? The age of tech providing substantial leaps in QOL improvement is over and that means the house of cards is going to fall.", "score": 6, "replies": [{"body": "Technology will be king until the apocalypse or we build ftl travel and find a civilization that evolved differently.\n\nUntil technology is doing everything that requires “work” or effort, on free energy, there is a market.", "score": 3, "replies": []}, {"body": "Also all that cheap money being thrown around created a lot of companies burning through cash like there's no tomorrow. If capital dries up a lot of those will have problems ahead of themselves.", "score": 1, "replies": []}, {"body": "I have always been a boring tech person only working for profitable products in profitable companies. This way of thinking has not been “cool” for quite some time", "score": 1, "replies": []}]}]}, {"body": "The ‘anyone can buy’ argument works both ways. \n\nIf ‘dumb money’ bought in as they thought everything was ‘going to the moon’ and then it starts crashing, that ‘dumb’ money will indeed prove dumb by irrationally selling for a loss. \n\nI’m no TA expert but I picked up some basics recently. If you draw a LONG term trend line on the SPX (like decades) you’ll see it likes to revert back to the mean every few years. We’re currently well over that line. The covid crash brought us back to it but it’s again gotten too extended.", "score": 10, "replies": [{"body": "What are some decent basics to pick up?", "score": 2, "replies": [{"body": "Basic support and residence lines, momentum, volume, common patterns etc. It also helps to watch videos by reputable traders. \n\nA lot of people claim TA is nonsense but my own amateur research strongly disagrees.", "score": 1, "replies": [{"body": "RSI is a good one to keep on your radar, and with TA its not a golden goose by any means, its almost a self full-filling prophecy, if enough people \"use\" TA then TA will have an effect ...", "score": 2, "replies": []}]}]}, {"body": "I agree with your opinion", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 12, "replies": [{"body": "How did you come up with that number?  Curious about the relationship. Thxs", "score": 6, "replies": [{"body": "Because it’s directly related to estimates of inflation. The higher inflation the higher the 10 year to compensate.", "score": 4, "replies": []}]}, {"body": "If you use a forward cash flow model a 1% rate increase can result in a 10-15% drop on a company with no current profits(like many tech). On a company like GOOG it would result in 5-8% drop.\nSo if you are looking for a 40% broad based drop it seems yields would have to rise a further 3-5%, so to a yield between 5.5-7.5%", "score": 3, "replies": []}]}, {"body": "I think sentiment is getting better. Im just worried about end of year earnings and next years.", "score": 3, "replies": []}, {"body": "“This time seems different” - most famous words\n\nAre you suggesting that just because everyone has access to buy via mobile phones the market will now skyrocket past the moon and to Uranus?\n\nBy that logic they can also sell via mobile phones and drive the market down even further. This is more likely because most of retail investors trading on mobile phone don’t know what they are doing in this casino.", "score": 6, "replies": [{"body": "something something apes something GameStop something blackrock #diamondhands!", "score": 2, "replies": []}]}, {"body": "Sorry mcdonalds does not serve bulls or bear we have chicken", "score": 8, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "100% wrong about china. Vaccine doesn't stop infections even in the US or EU and they want to contain it within the city at least.", "score": -6, "replies": [{"body": "The vaccine 100% prevents some infections lol, it doesn't stop all infections and never claimed to do so. It also stops most infections from becoming lethal. In the same way seatbelts don't prevent car crashes but keep people from dying at substantially better rate.", "score": 7, "replies": []}, {"body": "Vaccines reduce hospitalizations considerably. China has a large older population. They are simply not able to handle a large number of patients.", "score": 1, "replies": []}]}]}, {"body": "I stopped reading at “this time it’s different”. No, it’s not\n\nJust look at Nasdaq chart in 99-00 and ARKK recently, \n\nHumans will be humans", "score": 7, "replies": [{"body": "This is such a dumb attitude. The fundamentals in the Nasdaq are wildly different compared to 99-00 and ARKK is already down below the pre-Covid valuations (which didn't seem stretched). Why would you expect it to half again?", "score": 2, "replies": [{"body": "I don’t expect another 50% drop, I’m only saying that this time it’s not different. Plot the 2 charts together and you will see the same patterns. Buyers at extreme levels, a lower low and new buyers who get rekt. It’s the same and will always be the same. Bubbles are not driven by fundamentals", "score": 1, "replies": [{"body": "I don't understand what you want to say. Arkk Innovation has dropped 73% already. Also you say we are still in bubble territory(?!) and there is no more 50% drop? Isn't this a contradiction?\n\nLike with Arkk a 10-20% move is just normal volatility, right? So either it was already bubbly in 2019 and we can expect another 50%+ drop, or it has bottomed out outside of more short-term volatility.", "score": 2, "replies": [{"body": "[here](https://images.app.goo.gl/zVeCMiU8LRyjTX7L7)", "score": 1, "replies": [{"body": "Yes, if it plays out like this you expect to drop another 40-50%.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The qqq fell 50% of the rally it’s had since the Covid bottom. It bounced off that 50% hard. I don’t expect another 20-40% fall that’s pretty ridiculous. I expected a couple months of green market until we see if companies can keep up good earnings in the third and fourth quarters. If they can’t, that might turn ugly then but we’ll be up substantially by then", "score": 6, "replies": [{"body": "2 months?  Maybe 2 weeks", "score": 5, "replies": []}]}, {"body": "Whether the market goes down more or not now is the time I'm buying more with some stocks down nearly 50% from ATH I think it would be smart to get in now", "score": 2, "replies": []}, {"body": "*This time seems different*\n\nEvery time is \"this time it's different\", not all crashes happen the same way, you are correct. Nasdaq down 30% in a few months isn't a flash crash, different than 2008. Yes.\n\n*now were in a society where anyone and everyone can buy stocks from their phone. Never in human history have we had this much access to the stock market.* \n\nThey see big red drops faster too, so they sell faster, as we have already seen.\n\n*Money is getting pumped in to the stock market by us the retail guys.*\n\n  \nonly as long as you have a job\n\n  \n*With unemployment at near all time lows money is abundent in the economy.*\n\nIs it? you must believe inflation is only 8% too... fed is actively targeting millions of layoffs to drive down labor costs as the source of inflation, if you thought you saw stock selling before you should buckle up.", "score": 2, "replies": []}, {"body": "No sir, this is a Wendy's.", "score": 7, "replies": []}, {"body": "pass the spliff", "score": 4, "replies": []}, {"body": "Yes, no, maybe, I don’t know. \n\nI certainly am not going to go long on much of anything right now. There are a few I’m holding. For the most part I’m just daytrading and staying mostly cash.", "score": 4, "replies": [{"body": "I honestly don’t know why you got down voted.  I am up $10,000 playing the volatility.  It’s the same as long term investment:  buy low, if it falls more dca and dump when the cost average provides a profit.\n\nSame as long, just faster", "score": 3, "replies": []}]}, {"body": "Yes.  Much of the stock investment was coming from free cash and govt incentives.  Those in the Pandemic lockdown betting on stocks have all disappeared when their incentives ran out. \n\nBiden is meeting with Powell this week see what it takes to get it out of trouble w/o triggering into a recession. The feeling is Americans are tapping into their savings for spending which may not be a bad thing.   People are cautious and unwilling to commit any until they get their lost money back.", "score": 2, "replies": [{"body": "No it is a bad thing. This will get much much worst. This is going to be 2008 five times over", "score": -1, "replies": [{"body": "So 50% unemployment?", "score": 1, "replies": [{"body": "I dont know why im being downvoted lol. Do you think i want to be right? No. But its simple math at this point. The gov't can not unfuck the situation that has been created. In fact they are making it worst. Seriously.  Trudeau? Biden? Yall think they can fix this ?", "score": 1, "replies": [{"body": "Trump certainly could god bless America", "score": 1, "replies": [{"body": "Well maybe but i think with his age he is out of depth. If DeSantis runs for it, and can get there sooner rather than later, maybe north america could unfuck itself", "score": 1, "replies": [{"body": "The DeSaint we need", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Bear rally? I believe we're still in a bull market. Dip buyers are still out there and who knows how much cash is waiting to jump in.", "score": 1, "replies": []}, {"body": "we are, make sure to sell all your shares before you lose it all. Not financial advice.", "score": 1, "replies": []}, {"body": "Yep. Technicals are king in this market.\n\nhttps://www.reddit.com/r/technicalanalysis/comments/v0yyrv/why_we_are_in_for_a_rally_for_the_next_one_or_two/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 0, "replies": []}, {"body": "Bears worship idols. Bulls don't.", "score": -5, "replies": []}, {"body": "Pump to drop bags on retail maybe.  It’s a complete fantasy that retail is propping up the entire market.", "score": 1, "replies": []}, {"body": "All in the earnings. See you in July and August.", "score": 1, "replies": []}, {"body": "Check out the stripper indicator.", "score": 1, "replies": []}, {"body": "The main question right now is inflation, and how the economy will be affected by combating it (genreally a recession). Right now it seems that current inflation will stick around longer than most thought, indicating a more significant economic slowdown to get it under controll. Very hard to estimate the timeframe and whats currently priced in doe, but the bear case is very convincing rn.", "score": 1, "replies": []}, {"body": "To answer your question Simply. NO", "score": 1, "replies": []}, {"body": "> money is getting pumped in to the stock market by is the retail guys\n\nRetail only accounts for like 20-30% of the market from what I remember, don’t allow lack of knowledge to fool your investment/trading strategy", "score": 1, "replies": []}, {"body": "I don’t know if the data has changed but my understanding was that retail traders can’t really sway the markets much. Obviously it did with GME but that was millions of people making a coordinated effort on one stock, the market as a whole I think we have much less of an effect on.", "score": 1, "replies": []}, {"body": "Where are all these people going to get the money to pump into their RobinHood accounts?", "score": 1, "replies": []}, {"body": "Easy answer.... no one knows, stop over analyzing stuff.", "score": 1, "replies": []}]}
{"title": "7 tech stocks that are most worthy of \"cheap\": Micron's forward price-earnings ratio is only 5.8 times", "selftext": "This year has been a brutal year for U.S. stocks, and technology stocks have been hit hard, with the Nasdaq $IXIC down 22.46% for the year. Rising bond yields and recession fears have been weighing on the tech sector since late last year.\n\nFortunately, U.S. stocks recovered last week and stopped the losing streak. The Nasdaq rebounded nearly 7% for the week.\n\nBank of America had previously predicted that in order to avoid worsening economic conditions, the Fed may pause in September to tighten policy.\n\nJPMorgan Chase bluntly stated in the report that the stock market may be close to bottoming out, as the amount of corporate buybacks announced so far this year has reached a record $429 billion, stronger than the same period in 2019 and 2021.\n\n**So what's there to watch when market sentiment turns positive?**\n\n**Micron Technology ranks first in the \"cheap\" list, with a forward price-earnings ratio of only 5.8 times**\n\nBarron's has compiled a list of tech stocks that are \"worth picking up bargains\" as U.S. stocks pick up. The criteria for listing are: Nasdaq 100 $NDX constituents that have fallen more than 20% this year (calculated for dividend impact), and forward P/E ratios below 16.7 times (average of S&P 500 constituents, based on expected 2023 revenue) , while sales are expected to grow by at least 8% in 2023.\n\nIn the end, only 7 stocks met the above screening criteria.\n\nIn terms of forward P/E ratios, the cheapest on this list is Micron Technology $MU. Shares are down 21% so far this year and trade at a forward price-to-earnings ratio of 5.8, with sales expected to rise 20.3% in 2023.\n\nChip giant Qualcomm $QCOM is No. 2 on the list, with its shares down 23% this year. It is understood that the company is increasing investment in improving business diversity to reduce its dependence on Apple orders, and it is making efforts in the fields of automobiles, VR (virtual reality) and computers.\n\nShares of Facebook, which changed its name to Meta $FB last year, fell more than 42% in 2022, and its earnings report said the shift in focus to the \"metaverse\" would be expensive. The company's advertising business is also challenged by TikTok and Apple's $AAPL privacy reforms that have upended the company's successful model of advertising on mobile devices. But Barron's believes the stock is a bargain given the company's 12.6 times forward price-to-earnings ratio and 16.3% sales growth forecast.\n\nThis was followed by Applied Materials $AMAT and Lim Research $LRCX. The two semiconductor equipment makers trade at 13.5 and 14.1 times forward earnings, respectively.\n\nAt the bottom of the list are Google $GOOGL and Netflix $NFLX. Google trades at 15 times forward earnings and is expected to grow sales by 16.3% in 2023. Notably, macroeconomic concerns could put some pressure on Google's search and cloud businesses in the coming months. Last Tuesday, the stock price of snapchat $SNAP, which is also in the Internet industry, plunged 43% after the earnings report missed expectations. The company's CEO Evan Spiegel said: \"The macroeconomic environment is definitely deteriorating faster than we expected,\" he said, adding The company is slowing hiring to manage spending more carefully, it said.\n\nNetflix's stock price has fallen sharply because of the loss of users. Currently, the company trades at a forward price-to-earnings ratio of 15.6, with an expected sales growth rate of 9.1% in 2023.", "id": "v0zuvq", "created_utc": 1653916128.0, "score": 67, "upvote_ratio": 0.84, "num_comments": 70, "comments": [{"body": "Micron is *highly* cyclical.  Like, bear markets mean -20% annual ROIC kind of cyclical.  They also have, even in good times, relatively poor FCF generation because of the ever increasing capital requirements of memory production.\n\nMicron isn't necessarily a bad value at it's current price, but forward P:Es that deviate drastically from the median generally do so for good reason, and you probably won't find a $100B diamond in the rough with a simple forward P:E screener.", "score": 48, "replies": [{"body": "According to Google Finance, Micron was more productive in 2018 than in 2019, 2020 and 2021. That seems suspicious to me, considering almost every tech company made bank in 2020 and 2021. Not exactly impressive.", "score": 4, "replies": []}, {"body": "Micron is that abusive lover who doesn’t love us today, but we can change them! Don’t loose the faith /s", "score": 1, "replies": []}]}, {"body": "Rant ahead: I think it's a mistake to lump semiconductors in with \"tech\" generally. \n\nTheir product goes *in* technology, but at the core it's still a commodity. \n\nIf you own a SaaS business like Adobe, or a platform like FB, or a payments network like MA: you have some fixed costs to run the thing, pay your software engineers, and so on. But, your value proposition will be unique, you collect ongoing revenue as people use your service/platform, and the marginal cost per added customer is very low. The result can be very high, stable profit margins and lots of cash to reward investors.\n\nSemiconductors are not that. They have large fixed costs and capital expenditures to stay on the cutting edge of chip development. Then, the chips they make become indistinct inputs into durable goods and the only real edge is \"ours is faster and smaller\" so they're constantly consuming more more more R&D spend to not fall behind. The production cost per chip is low so margins get competed down to nil because the big input-buyers like Apple hold the bargaining power.\n\nSemis are a miserably cyclical industry, and every decade or so, investors forget about this, buy the peak because \"they look cheap on last year's earnings!\" and lose lots of money. \n\nStuff like MU is justifiably cheap. Commodity industries usually are. Fabricator and QA companies like AMAT, LRCX and KLAC are moderately better but when the cycle next turns, they'll look bad too.", "score": 58, "replies": [{"body": "So I’m long chips and when I see comments like this I’m conflicted. I definitely want to know as much as about my positions as possible and I want to bail before this cycle starts to turn.\n\nThing is, you make chips sound almost uninvestible. Take a look at SOXX over the past 10 years. To me that says that chips are indeed a worthy investment. \n\nFinally, while I think the euphoria around chips is overblown I think they way you describe the industry is far too bleak. Chips are commodities, something I’ve tried to argue with others that are too positive on the sector, but in fairness they’re by far - bar none - the most sophisticated commodities on the planet and they do command more of a premium than you insinuate.\n\nWould love to hear your reply, for real. I do want to know the bear case as well as possible.", "score": 13, "replies": [{"body": "Fair question and I want to give a fair answer without too much exaggeration for effect. But, I do think the cycle has peaked already, and we're headed for the downward trough now.\n\n> Take a look at SOXX over the past 10 years...\n\nA few thoughts:\n\n(1) How much of that sector outperformance came just from AMD, and was that lightning in a bottle? (not a rhetorical question, I genuinely don't know). \n\nWe can look at a [graph of the last 5 years of SPY, SOXX, and AMD for context.](https://i.imgur.com/7yvrRFM.png)\n\nGiven the structure of the industry now, could another AMD ever come along and give a return like that? And who would they be disrupting to make that happen?\n\n(2) it's been a great past 10 years for semis, because tech like Apple, Microsoft, etc has been driving S&P returns. But, if you go back a bit further, the story was different. 2000-2010, financials were the core of the economy, and semis/tech went nowhere because of hangover capacity from the dot-com bubble splurge.\n\n(3) Now, let's have another graph, [adding Intel to the mix.](https://i.imgur.com/Tvvwzw3.png)\n\nJust looking at the shape of that, it screams at me that we're on the backside of another peak.\n\nLike, how do things possibly get better for semiconductor makers from here? The entire electronics industry is hung up on a shortage of their product. They can name their price and manufacturers will probably pay it. Piles of new capacity is coming online to clear those shortages. \n\nI read investment books from 50 years ago, and money managers complaining how they got burned by Texas Instruments peaks and dumps. And the narrative was always the same: \"these chips go in everything, demand can only go up.\" But manufacturing capacity gains have been even more efficient. Cheap semiconductors are a win for consumers, but historically have been at the expense of investors who overpaid to build that capacity.\n\nI think the semi's bull case now has to be \"this time is different\" and who knows, maybe it is. But so far it never has been!\n\nEdit: a book I like is Edward Chancellor's *Investing through the Capital Cycle*. His point is that lots of people try to forecast demand but that's really hard to get right. Demand is fickle. Supply, on the other hand, is much easier to see coming because it takes time. You can watch an industry's supply expansion coming. Don't be in the places where there's about to be a huge glut of supply, and you're less likely to get caught holding bags.", "score": 16, "replies": [{"body": "As someone who has maintained a very similar skeptical position on semis having inferior economics relative to dominant software demand aggregators for many of the same reasons, I suspect you may be missing a few things. The first is that the semiconductor industry has become far more consolidated, which should theoretically reduce the cyclicality compared to the past. That doesn't mean the semiconductor industry will avoid cyclicality, although the swings should dampen. The second is that cloud computing is a massive secular growth driver that will require building lots of data centers over the next decade or more as businesses are migrating in droves to the cloud and making more use of more sophisticated, intensive capabilities (e.g. AI workloads).", "score": 5, "replies": []}, {"body": "I’m pretty big on the “this time it’s different” view for semis. Curious as to what you think when it comes to public cloud spend over the next decade from AMZN, MSFT, GOOG and what powers their data centers", "score": 3, "replies": [{"body": "I don't think demand is the key issue, rather that supply can easily overshoot and leave semi-producers with little profit.", "score": 2, "replies": []}]}, {"body": "All fair points. I actually don’t think the bull case is ‘this time it’s different’ I think the bull case is we’re not in the backside of the peak yet and semiconductors are becoming more profitable as time goes on. I do think there’s a bubble and I want to get out before it pops but the cycles are growing more and more lucrative.", "score": 4, "replies": [{"body": "You might be right. It just feels to me that there are less risky ways to make money!", "score": 4, "replies": []}]}]}]}, {"body": "AND....\n\nNFLX is a media company. They don't have reliably positive cash flows and just like capex, they need to continuously spend on content creation. There's nothing tech about it.\n\nFB and GOOGL are ad companies. They're classified by GICS into the communication services sector. If you look at the past 5 years of capex, GOOGL's and FB's capex is higher than QCOM, AMAT and LRCX as a percent of cash flow.\n\nThe only company on that list with large capex is MU with 80%+ of cash flow spent on capex.\n\nI think classifying tech companies by customer acquisition cost, profit margins, capex etc. is outright flawed. You're going to be classifying two companies in the same line of business based on their financial metrics. Are GOOGL and FB considered tech companies just because they're the most successful ad companies on the planet whose main platform is on the internet? (lucky they weren't Yahoo and Myspace) What about all the unprofitable internet companies? Are they not tech? \n\nIt's also strange to generalize semiconductors companies as large fixed costs and high capex with low margins when NVDA has capex < 10%, operating margins greater than FB and almost every SaaS company (majority of them have negative op. margins). There's clearly a wide spectrum of semiconductor companies at different points of the supply/value chain that have wildly different metrics. \n\nWhile your point of PE can fluctuate stands, yes semi companies have more volatility than other stocks, you can literally look up their historical earnings and see a clear upwards trajectory even on stocks like MU.\n\nYou can also see that stocks like ADBE, MA and FB are not invulnerable to revenue shocks. FB is facing weakness now, MA had revenue declines during 2020, and ADBE revenues declined during 2013 and the GFC. \n\nAll businesses collect ongoing revenue as people use their service/ product. The platform definition doesn't hold up to scrutiny to define what is tech and non-tech. People pay ADBE an ongoing subscription, people pay FB to display ads, people use MA to process their payment... is the same as people paying interest to the bank, buying oil, buying toothpaste which runs out so they have to buy more...\n\nWas MSFT not a tech company before they introduced the subscription business model? They sold software. It wasn't ongoing.", "score": 4, "replies": [{"body": "Maybe the tech/non-tech distinction distracts from the point. \n\nReally what I'm going at is if your product is: consumable; a recurring revenue subscription; has a brand that customers care about; low marginal cost to add extra clients -- all of those make a company much easier to stand the test of time.\n\nOn the other hand, if your product is: durable, purchased only as needed, with many perceived substitutes, and your buyers have negotiating power to push you around on prices -- it's a lot harder to make money long term.\n\nWhen Google and FB spend piles of money to improve their ad algorithm, it becomes harder and harder to compete with them. When a new semiconductor factory goes up, it's only a competitive advantage until fabricators improve and the chips can go one nanometer thinner.", "score": 4, "replies": []}]}, {"body": "Interesting analysis", "score": 1, "replies": []}]}, {"body": "I’m long on QCOM. Their last earning report was solid. I like Cristiano Amon as CEO. Always think internal hires, especially engineers can make great CEO’s. \n\nReally excited to see their automotive business grow. They signed a deal with Stellantis Brands and VW is going up use them for self driving cars. \n\nTop that with the growth of 5G. I’m really stoked on their future.", "score": 24, "replies": []}, {"body": "Long $MU and $FB  \n\n\nMicron - was and remains a solid business, even if there are some years of low sales growth. I like to think of it more like a \"steel miner\" than a tech company, because its main revenue comes from memory chips, which are almost pure commodities. Over a 5-10 yr timeframe, no reason to expect memory demand to not grow; occasionally competitors bring online too much supply though.   \n$FB / Meta - One of the few Nasdaq - 100 companies that don't have much exposure to China unlike the biggies - Aapl, Tsla, Nvda.", "score": 10, "replies": []}, {"body": "\"Forward\" earnings are analyst predictions, which are notoriously backwards looking. None are taking into account the possibility of a large contraction in the money supply or a recession. Few are taking into account lower profitability due to higher borrowing and transport costs.", "score": 9, "replies": []}, {"body": "More than $7 trillion has been wiped out from the stock market this year, Fed reducing is equity balance by only 30B a month which it’s total 90B from June to September", "score": 7, "replies": [{"body": "This either means that the markets way overdone its reaction or that there was a massive bubble that popped.", "score": 4, "replies": [{"body": "I feel that the market's sentiment is at a point where some (but not all, maybe half) of the downside/worst case scenarios were being priced in. \n\nInterrupting that downward slide is an upward correction from some data that suggest that the downside/worst case scenarios might not be as bad as expected (for example, the rate of inflation may have started falling in April). So there's a temporary correction upward while the \"better\" downsides are being factored in. \n\nBut recall the downside wasn't even fully priced in yet. We can go either way in the short term but unless market fundamentals change, in the long term we should have more downward slide in store.", "score": 2, "replies": [{"body": "Tldr: the market can go up or down and nobody knows. Could have said that and saved 5 minutes of typing", "score": 9, "replies": [{"body": "The difference is that if you understand the WHYs -- WHY the market is probably going up when it's likely to go up and does go up, and WHY the market is probably going down when it's likely to go down and does go down, then you can make money on the volatility. \n\nWhen you're part of the \"nobody knows anything\" crowd, you don't. From your post history:\n\n> Only -35% down on my msft leaps woo\n\nMaybe that's because when you play the market as a \"nobody knows anything\" person, you're just gambling.", "score": 2, "replies": []}]}]}]}]}, {"body": "Former investor in MU here, got out just before my gains were almost completely wiped out by the market crash this year. The price action on MU puzzles me every day, they are very strong in their segment, the demand is huge, have great partners like AMD who is growing 100% rate in datacenter space yet the stock is back to prepandemic levels.", "score": 7, "replies": [{"body": "The semis have been beaten up this past year. Most analyst have said it’s due to slower PC demand. However, a lot of the names are crushing it. QCOM and AMD raised guidance. NVDA lowered, but due to gaming only and the issues with the war and lockdowns. In fact, data center overtook their gaming segment. \n\nI do think there’s is some issues with inventory glut, but overall, semis are going to be great long term and this is a case of be greedy when others are being fearful, if you are a long term investor.", "score": 4, "replies": [{"body": "Nvda market cap is almost the same amount as what total projected semi worldwide sales will be in 2025. The larger manufacturers such as intel and MU really have no advantages to be valued so low?", "score": 3, "replies": [{"body": "Not sure on your question. Intel is a foundry and is behind Samsung and TSMC in terms of technology. AMD, QCOM and NVDA are all fabless and use TSMC. \n\nIntel is doing a lot of investment in terms of building new foundries in the US. However they are still behind TSMC and Samsung. I think they new plant might leapfrog them, but it’s basically the thesis in going long with INTC. It’s possibly they might miss their goals. \n\nI don’t really follow MU or the DRAM market.", "score": 2, "replies": [{"body": "No I’m very ignorant when it comes to the processor industry but it appears that the entire industry sales only amount to ~550bln yet take for example NVDA with a market cap of almost 500bln with only 1/20 of that in revenue. I’m just confused on how the entire semi industry is valued as compared to other industries, total value of equities is magnitudes higher than their respective real world sales.", "score": 2, "replies": [{"body": "Well NVDA is a growth story. The sector tends to trade at a higher PE in general. Part of the reason is margins. NVDA has 65% gross margins. Since 2016, revenue for NVDA is growing more than like 40%, other than 2018 which was only 20% and 2019 which saw negative growth. \n\nI’m not sure if I can think many other billion dollar companies growing that much with that high of margins.", "score": 2, "replies": [{"body": "I’m just trying to understand the narrative. It’s still not quite making sense yet. Let’s say that NVDA continues its trends with its current annual sales of around 30bln. When it triples in size to 100bln and maintains its margin, which tends to drop with expansion, but let’s say they maintain it, then the company has captured roughly 20% of the total semiconductor market. What would a fair valuation be if they stopped growing then? I’d say around 300-450bln or about where they’re at right now. But what about the other 3 trillion in current market cap of competition? This industry seems over valued on a speculative basis, albeit it seems that the margins tend to be higher. The industry looks like it’s priced for triple redundancy", "score": 2, "replies": [{"body": "I’m not sure if margins will drop with expansion for some of these companies. I mean their last earnings report, data center growth actually beat their gaming sector. Data center offers the best margins as well. \n\nYou have to remember, companies in the sector offer different products. You can’t compare an NVDA to a QCOM to MU. They offer different type of chips to uses. \n\nThe demand for chips because of IOT, AI, data centers, etc do not seem like they are slowing down. When NVDA does actually being to slow down, there will be compression in the price which will lower the PE and market cap. \n\nCan you can name another companies that are higher that like 100 billion dollar market cap growing more than 50% YoY?", "score": 1, "replies": [{"body": "Okay so I see what I’ve been missing. Cloud revenue. Definitely the fastest growing space in tech, of course, since it is basically akin to a public utility. But whether or not NVDA can compete with monopolized conglomerates like AMZN is yet to be seen. Peripheral competition tends to grow quickly but plateau earlier than pioneers. IOT is a dubious application for processors as it’s mostly gimmicky marketing of useless features. How long that marketing can be kept up seems to be shortening by the day due to social pressures for actual products", "score": 1, "replies": [{"body": "They aren’t competing against Amazon or MSFT, but they are supporting their growth. \n\nhttps://aws.amazon.com/nvidia/\n\nhttps://partner.microsoft.com/en-us/case-studies/nvidia\n\nBoth Amazon and Microsoft are buying NVDAs chips to help grow their cloud space. \n\nPlus there is a huge market for IOT and business. \n\nQCOM is more of a IOT business, which they are seeing huge growth. \n\nhttps://rcrwireless.com/20220428/chips/qualcomm-in-q2-double-digit-growth-in-handsets-automotive-rffe-iot\n\n> To the numbers: Total revenues hit $11.164 billion up 41% year over year. By segment, handset revenue grew 56% to $6.325 billion, RF front-end grew 28% to $1.16 billion, automotive grew 41% to $339 million, and IoT grew 61% to $1.724 billion.\n\nWe are going to see a huge wave of growth as we transition to 5g.", "score": 1, "replies": [{"body": "Yeah I understand the marketing pushes, but as a technologist, it’s better to try and analyze the narrative in terms of real added utility, rather than marketing features. And about the AWS partnership, which seems to mean that they aren’t really into cloud infrastructure, just supplying semis that the total industry value has accounted for. The public cloud will eventually plateau as well, probably at around 500bln total", "score": 1, "replies": [{"body": "What do you think the cloud is? It’s simply server boxes. NVDA are some of the chips on those boxes. Regardless if it’s public or private, AMD and NVDA offer some of the best chips for those spaces. \n\nAssuming analysts are correct, the cloud space will be worth roughly worth 1600 Billion by 2030. \n\nhttps://www.prnewswire.com/news-releases/cloud-computing-market-size-worth-1-554-94-billion-by-2030-grand-view-research-inc-301489396.html\n\nIf NDVA has 20% of that space, that means revenue will be 320 billion on cloud alone by 2030.", "score": 1, "replies": [{"body": "Yes the cloud is physically made of servers but cloud revenue comes from subscriptions for provided upkeep. Is NvDA involved beyond selling hardware? NVDA inherently cannot maintain a 20% share of a subscription based service that only depends on their hardware. I’ll check the portion of total cloud cost related to hardware. It’s a small non recurring portion. My estimate on the plateau was admittedly an ass pull but Grand View Research Inc. isn’t one of my go to sources. I’d wager that their estimate is heavily bullish.", "score": 1, "replies": [{"body": "I believe they are primarily just selling. Even then, you still need to update and continue to build more. What companies are going to need less space and computing power in the future. Costs of the cloud service will come down, but not the demand to expand and increase computer power.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Yeah I’ve called for the mu hype before… I’ve already got heavy enough bags (glares at Amazon and Google)", "score": 4, "replies": []}, {"body": "Link to the Barron's list?", "score": 2, "replies": []}, {"body": "I feel the fed is like a dog trying to shake extra fleas and these tech stocks are some of them.\n\nI don’t doubt these specific stocks are solid buys, but tech is being having a huge sell off and might keep going down until even the big ones are at normal valuations and less speculation of what future might yield.\n\nHey maybe it’s time and they’ll go up and don’t want to miss the boat. \n\nBut it’s the same boat as “tech stocks” that became a magnet for speculation and inflated prices so the whole boat is determining the price instead of the actual company.", "score": 2, "replies": []}, {"body": "Long on Google, not the biggest gainer but long term has and will beat the S&P500 average imo", "score": 2, "replies": []}, {"body": "This article doesn't give context as to why these stocks are \"cheap\". It just gives percent down from their high and a lowish p/e ratio. It says nothing if those stocks are actually cheap, or if trading lower than they were before. \n\nWe love to anchor to the previous high price and see things as \"on sale\" when in fact they were likely overvalued before, and probably closer to a normal valuation now.", "score": 2, "replies": []}, {"body": "Great, this sub is onto MU.  Time to offload my position....", "score": 2, "replies": []}, {"body": "Id much rather buy dips in google / FB", "score": 1, "replies": []}, {"body": "Anyone from wall street bets class of 2017 remember this one?", "score": 1, "replies": []}, {"body": "JPM > BAC every day of the week for financial sector.\n\nNeed to do more research on MU.\n\nQCOM is certainly worth adds now and long term. Very bullish on selective tech after the burst.\n\nGOOGL is always a yes, especially with the split coming up. \n\nI wouldn’t touch Meta or Netflix with a 10 foot pole. Both has past deep value, no longer desirable in anyway.", "score": 1, "replies": []}, {"body": "Most have big growth expectations. Forward PE is absolutely useless.", "score": -8, "replies": [{"body": "Big growth expectations are exactly why the forward P/E is useful.\n\nForward P/E is useless in industries that have 1-2% YoY growth.", "score": 18, "replies": [{"body": "No, because what if they don't materialize? So you buy a company based on growth expectations that might not come to fruition?", "score": -1, "replies": [{"body": "It entirely depends on the quality of the estimates.\n\nQuality names with a lot of analyst coverage and good management that tends to sandbag on guidance often exceed estimates.\n\nMicron hasn't missed in some time.  AMD has been killing estimates for a long time.\n\nCould the whole sector experience a massive slowdown and cause negative forward earnings revisions?  Sure.  But, right now, it already looks like the market is *expecting* that.", "score": 5, "replies": [{"body": "Netflix had a very low forward P/E back in the summer of 2021 based on analysts reports that will keep growing their base in the foreseable future.\n\nCopying from news back in January.:\n\n//////\n\nNetflix shares fell more than 20% in after-hours trading, as the company forecast 2.5 million net subscriber adds for the first quarter of 2022. For Q1, Wall Street analysts had been projecting a gain of 7.25 million subscribers, per FactSet.\n\n////\n\nSo analysts who follow thoroughly the company estimated that in Q1 Netflix will add 7.5 million and management said will add only 2.5 million. \n\nWe all know what happened next. \nNetflix lost 2 million users in Q1 and even excluding the Russian users the lost half million. \n\nThis is the danger of forward P/E. \nIf you follow analysts who said Netflix will add 7. 5 million users in a Q1 '22, paying 700 dollars per share would be justified. \nNow the price is at 180 and everyone who bought on the top blame themselves why they listened to those analysts", "score": 2, "replies": [{"body": "And like I said, it all depends on the quality of the analysts.  I've never followed NFLX so I can't comment on that.\n\nThe pandemic darlings were a lousy investment thesis, IMO.\n\nZoom, Netflix, Peloton, Carvana, Wayfair, Snapchat... there were dozens.\n\nIt still appears to me that some of these are the best investments available right now.  OP didn't mention them, but AMD is probably the best growth company at the best price right now.", "score": 1, "replies": []}]}, {"body": "Nvda market cap is currently equivalent to projected worldwide semi sales in 2025. By numbers they are nowhere near as large as MU or INTC so how is this entire industry so overvalued relative to entire potential market value?", "score": 1, "replies": [{"body": "Not sure what projections you are looking at.\n\nI was just looking at some projections from 2015, which showed 2025 at $650B, and 2021 at $500B.  2021 was $600B.\n\nBut, in any case, I'm not sure we even know how much demand there will be from AI-driven applications for GPU capacity in 3 years time.  And it cuts across a lot of segments.\n\nInterestingly, WSTS thinks the memory segment (Micron) will show the weakest growth in 2022, but others like Gartner think it will be one of the strongest.\n\nI don't own NVidia, but I also wouldn't be short that stock, at this price, or even 30-50% above this price.\n\nI do own AMD, because I think they're worth at least $120 *right now*.\n\nAnd I am short Tesla.", "score": 1, "replies": [{"body": "Yeah I misremembered but I’ll leave the comment unedited. As far as investment, there are better opportunities than the semi industry. But as far as current valuation, they both seem priced for growth. As far as AI-driven applications, well that’s an interesting market segment as many businesses are slower to adopt than they should be for necessary services, while the fast adopters are obviously over relying on their models and getting in lots of hot water as well. Will the open source nature of powerful and specific AI models suffer from the same non profitability issues as academic research?", "score": 1, "replies": [{"body": "I do know that governments (particularly the US and China) are absorbing a ton of supercomputing semi capacity right now (almost certainly for AI-related applications), and it's flying somewhat under the radar.\n\nFrontier just came online, and El Capitan is slated to come online early next year.  Both of those are consuming a TON of Epyc CPUs and a boatload of AMD GPUs.\n\n\nThe US has used DPAS and the Defense Act to skip to the front of the line for a lot of parts.\n\nAMD is growing at a 60% YoY clip, with increasing margins, and it's priced at a forward multiple of 23.\n\nAs far as I'm concerned, Intel is dead money, at best, for the next 4 years, at least.", "score": 1, "replies": []}]}]}]}]}, {"body": "What exactly are you investing in if it’s not the future cash flow of a company?", "score": 3, "replies": [{"body": "Doing my own models and not relying on analysts.", "score": -1, "replies": [{"body": "What are you doing differently or what are you taking into account in terms of investment?", "score": 1, "replies": [{"body": "Looking at supply chains and the costs that are rising there. Money liquidity.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "buying companies based on assets values or cigarbuts.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "cigar butt investing. Look up benjamin graham. Historically speaking they have outperformed the market. Only possible for retail investors.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Works like a charm", "score": 1, "replies": []}]}]}]}]}]}, {"body": "When growth isn't realised the stock gets punished... that's how guidance and performance work on the stock market. If the market is forward looking how can you expect company expected growth to be ignored? People don't just invest quarter to quarter. Wtf are you talking about", "score": 1, "replies": []}]}]}]}, {"body": "I look for companies with high sales/share relative to price + low P/FCF + PEG and low debt \n\nThe only company on your list is FB.\nPFE + INTC + DELL + HPQ + HOG + DBI are some companies in my list.\n\nI recently purchased UNFI + RCMT + STKL + CPNG + TITN + CONN", "score": -1, "replies": []}, {"body": "Sell me on Facebook. Isn’t fewer and fewer people using the platform?", "score": 0, "replies": [{"body": "The number of monthly active users by the end of 2021 was 2.9 billion. Facebook's penetration rate for the United States in 2021 was 70.59 percent, up from 67.4 percent in 2020.", "score": 3, "replies": []}]}, {"body": "I’m thinking about buying Micron back after I sold it all after seeing what an idiot their current CEO is. I love their products and I think all of the memory and SSDs I’ve bought the past decade were from them, but I’m concerned about their bad leadership.", "score": 1, "replies": []}]}
{"title": "If most of your savings are in stocks, I really suggest at least partially liquidating your assets this week", "selftext": "Eventually, all stock market crashes recover. If you have adequate cash reserves to supplement a loss of work or business, then you are fine.\n\nbut if you don't have adequate reserves, then you'll be forced to liquidate your equity when recession gains steam and the stock market is very low.\n\nAgain, we want to buy low and sell high. If you need cash, you will not have that luxury to hold and sell at high since bills will need to be paid.\n\n\"No one can predict the bottom ...\". Yes, I agree, but I think most people can see we are not at bottom. Recession is here and still coming. Quantitative tightening is coming. And lets not forget there will be a domino affect with over leveraged individuals\\companies being exposed and getting bankrupted. Stocks prices will keep going down. \n\nagain, the the key to surviving a stock market crash is to have adequate reserves to pay those bills. Every individual is in their own unique situation so deciding how much needs to be liquidated to supplement a job loss or business loss needs to be thought out.\n\nedit: During the 2008 crash, people liquidated at such low prices since they needed to pay rent after getting laid off, keep their business a float, etc...\n\nLook over your portfolio. Look over your occupation and business. Is it sensitive to a recession? If so, you better have some cash reserves to weather the coming storm. Don't sell when market is at height of recession when everyone else is trying to sell too. the only people who make money then are Warren Buffets and hedge funds. The average joe who needs to support his family after getting laid off will be liquidating their 401k and will get screwed", "id": "v1bv3s", "created_utc": 1653950532.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 77, "comments": [{"body": "*\"No one can predict the bottom ...\". Yes, I agree, but I think*... (and then you proceed to give us all your prediction of the bottom).\n\nSelling  in  a  downturn  is  rarely  a  strategy  for  financial  success.  I'm with u/Brokenwrench7.    If  you  need  to  sell  your  stocks  to  pay  your  daily  bills,  you  messed  up  long  ago.", "score": 28, "replies": [{"body": "Agreed. The OP’s clear ulterior motive is to try to paint a picture of a “guaranteed recession right around the corner!”\n\nLame attempt at planting more FUD than there already is if that’s possible.", "score": 4, "replies": [{"body": "it doesn't matter what i say, the stock market valuation always happens during earnings anyway. What i want to see prevented is people because of severe cash flow problems being forced to sell at some ridiculously low price. And then who picks up these cheap stocks? doctors, rich people, and others who are not in a cash starved situation. The average joe who got laid off, now can't pay his mortgage and ends up liquidating his 401k.\n\nWe are not going above 4500 anytime soon. no one is buying netflix at $600 with p/e > 100 anytime soon.\n\nEveryone is going to rush for the exit. If we can get the risky people safely and orderly out, then it will be better for everyone. People will have more control of when to sell, rather than selling due to desperation", "score": -4, "replies": [{"body": "> no one is buying netflix at $600 with p/e > 100 anytime soon.\n\nBut netflix is sub $200, with a 17x P/E?", "score": 2, "replies": []}, {"body": "Nobody cares if someone loses their ass in the stock market..it sucks but its the truth.\n\nBuy quality stocks with long and strong histories instead of speculative stocks. Generally speaking....if a stock doesn't have a good dividend history...one that survived 2001 and 2008.....its worthless to me.", "score": 2, "replies": []}, {"body": "You are so cute, acting like you’re some shepherd of stock market actors. Big narcissistic energy here. Glad I don’t have to deal with you in real life.", "score": 1, "replies": [{"body": "Is what I said really that unreasonable?\n\nJust have some cash so you won't be forced to liquidate during desperation", "score": -1, "replies": []}]}, {"body": "Wish I was so naive to be so sure of something like the short-term direction of the market. Ignorance is bliss as they say!", "score": -1, "replies": [{"body": "If you have cash and a stable job, you have nothing to worry, you can ride out the recession.\n\nBut when recession does hit, and you cant pay your mortgage, you'll want to liquidate to get some cash, and guess what, the recession is being faced by many people other than just you, and they too are looking to liquidate, and when everyone is selling, that is when the price drops to super low levels.", "score": 3, "replies": [{"body": "Dude… people on Reddit are so thick headed…\n\nI never said anything about having an emergency fund for a recession. No duh that is a necessity.\n\nMy issue is with your 100% assurance that a recession is right around the corner. It is impossible to make that call and the fact you think it is guaranteed shows your ignorance of anything capital markets related.", "score": -1, "replies": [{"body": "I guess gdp being negative for 2 months in a row is not enough?\n\nWe are at the edge of an abyss.  Maybe it will be a soft recession,  but people should take precautions", "score": -1, "replies": [{"body": "How old are you? Do you have any experience in any capital markets capacity whatsoever? CFA chartholder? Anything? \n\nI’m guessing not. I promise you- macro calls like you’re making are near impossible to time.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "If you're in a position to where you need to sell your stocks just to pay your bills....you dun goofed.\n\nI for one...keep looking forward to more red days so I can buy at a discount and whole I keep collecting those sweet sweet dividends", "score": 41, "replies": [{"body": ">If you're in a position to where you need to sell your stocks just to pay your bills....you dun goofed.\n\nSadly, that is what happens. During the 2008 crash, people liquidated at such low prices since they needed to pay rent, keep their business a float, etc...\n\nLook over your portfolio. Look over your occupation and business. Is is sensitive to a recession? If so, you better have some cash reserves to weather the coming storm.  Don't sell when market is at height of recession when everyone else is trying to sell too. the only people who make money then are Warren Buffets and hedge funds. The average joe who needs to support his family will get screwed", "score": 3, "replies": [{"body": "If my entire portfolio went to zero tomorrow I'd still be living comfortably \n\nWhen I buy stocks I don't spend enough to put the cart infront of the horse.", "score": 10, "replies": [{"body": "You are wise. unfortunately, not everyone thinks like you.", "score": 2, "replies": []}, {"body": "Wow your whole $5000 portfolio?!", "score": -5, "replies": [{"body": "It's closer to 70k but, if you want to assume", "score": 3, "replies": [{"body": "Hey me too.", "score": -4, "replies": [{"body": "Cool", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Buying more this week thanks for the advice", "score": 30, "replies": []}, {"body": "No. This is stupid. This is what causes the market to crash.", "score": 21, "replies": [{"body": "If you're the one who gets out early enough that's a good thing.", "score": 3, "replies": [{"body": "If everyone thinks like that then it’s a self fulfilling prophecy.", "score": 3, "replies": []}, {"body": "If you are the one that gets out early enough and back in right before you should have,  then that is a great thing.", "score": 2, "replies": []}]}, {"body": "no it doesn't. market crashes happen when everyone wants to sell at the same time. but if we have just a few people, the ones at risk, sell some of their holds, we will actually avoid a crash.", "score": 1, "replies": [{"body": "So selling avoids market crash. Got it.", "score": 3, "replies": [{"body": "its about supply and demand.  \n\nIf people can have cash at hand to weather the recession, no one will be forced to sell at such low prices. and the markets, though it may still have a correction due to changes in p/e valuation of many stocks, won't drop so much.\n\nIf all the people who will need the cash during the recession, slowly start selling to recoup their capital, then when the recession does hit, the price won't drop so much. The only people who won't like this is the people with stable incomes who are just constantly dca and hedge funds who also buy at the low.", "score": 2, "replies": []}]}, {"body": "True. But putting this out as advice on the internet causes more people to do this. The more people that pull money out instead of riding it out, the lower stocks go for everyone. \n\nRiding it out helps the market stabilize sooner and prevents crashes.", "score": 3, "replies": [{"body": "it only goes down temporarily. if you are holding stocks for the long term, you'll be fine. \n\nthe larger issue is people selling stocks due to desperation, and because of the situation they are in, end up selling on the dime for the dollar.  in feb 2009, stocks were so damn cheap, they lost 50% from of value from their top, and reason was people needed to liquidate their 401ks to pay off bills. And when tons of people across the country did this across all their 401ks, the stocks cratered", "score": 1, "replies": [{"body": "True. That was my entire point.", "score": 1, "replies": []}]}]}]}]}, {"body": "Naa", "score": 5, "replies": []}, {"body": "This is what Robinhood & the fed put has done over the last two years.....make newbie  randos on /r/stocks feel like stock market gurus with an insatiable need to give  personal finance 101 lessons", "score": 9, "replies": [{"body": "To be fair, I would trust a random user on /r/stocks over a FA who says, \"YOu Can'T TIMe THe MARKeT,\" and, \"JuST BuY ThE MarKET ReGarDLEsS of PricE.\" \"Go LoNG AMERIca.\" \"NeVER SeLL. JuST HoDl.\"", "score": -3, "replies": []}]}, {"body": "Yes if your entire portfolio is only crypto definitely sell!!", "score": 3, "replies": []}, {"body": "Don’t invest what you can’t afford to lose. Plain and simple. Sell now and you’re saying you never expect the market to recover which is absurd. Too many new guys these days acting like the worlds ending. If you can’t hold during a downturn then get the fuck out and don’t bother investing again. Some of you fuckers got in at the start of the pandemic and think you’re investors because everything went up and you made money. Now you don’t know what to do with the first downturn. It’s fucking comical", "score": 3, "replies": []}, {"body": "Yeah no, consult a professional. Set stop losses or hedge with options", "score": 9, "replies": [{"body": "A professional is going to tell you the cost of hedging your equity now the VIX is above 25 on a daily basis is . . . meh. \n\nPeople are wedded to their long-term gains tax rate when they should be thinking about exiting equities on this rally.", "score": -2, "replies": []}]}, {"body": "Someone loaded up on SPY puts expiring this Friday...", "score": 3, "replies": [{"body": "If it goes up OP will blame everyone but his/her self. If it goes down they'll see it as confirmation of their own brilliance. There is a reason only something like 10% of actively managed funds beat the market every year.", "score": 3, "replies": []}, {"body": "I do have puts, but they expire 2 months from now", "score": 2, "replies": []}]}, {"body": "Instead of selling I’ll just pretend my current portfolio is a total loss and plan out how I will use income from my high earning job to build up a better one.", "score": 3, "replies": [{"body": "Wow you make that much at McDonald's?!", "score": 1, "replies": [{"body": "Wendy’s", "score": 1, "replies": [{"body": "😆", "score": 1, "replies": []}]}]}]}, {"body": "You can't time the market. A great financial plan takes care of swings and bear markets. It also includes emergency reserves, the relevant insurance policies etc etc. This bipolar situation of fully invested in the stock market and starvation due to a bear market is irresponsible on many levels. Recessions happen and this one will pass. During recessions and market downturns real investors have a great opportunity to buy assets at discounts. De-leveraging should have happened when everyone was giddy and markets going up like crazy.", "score": 2, "replies": [{"body": "It's quite obvious we are not going up anytime soon. maybe 10% chance we go side ways.\n\nBut I think anyone who is mostly in stocks need to make a prudent decision and liquidate some of their holdings into cash or something like bonds", "score": 2, "replies": [{"body": "We're going up this week.", "score": 2, "replies": []}, {"body": "That's not how the forward looking stock market works, if there is a zero percent chance of going up and a 90 percent chance of going down, we would be down already. That's just your opinion that either is completely genius were you are seeing something noone else does (in which case you should share your info) or you are overly confident making stuff up to confirm your own bias and make yourself feel better about your short position", "score": 1, "replies": []}]}]}, {"body": "I work at McDonald's. Job security.", "score": 2, "replies": []}, {"body": "We've known about recession and QT for months. Anybody who was going to sell based on that should've sold already. Lots of people smarter than us are not only holding but still buying. Puts are relatively cheap right now if you need to sleep at night.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Serious question: were you invested in 2007?", "score": 0, "replies": []}, {"body": "3810 intraday was probably a low for the time being unless we revert back to what had been seen since April 20th until last week.\n\nIt probably wasn't the low of this year though.\n\nYes, I know what happened after May FOMC, but the argument is there to be made that June is probably going to be March instead of May. If you want it to be less likely that it will, you 100% want SPX to trade 4300+ before FOMC to make the rebalance less tilted to stocks.\n\nOtherwise, end of quarter stuff is going to get in the way and throw everything off again.", "score": 1, "replies": []}]}, {"body": "Well said. I started last april and couldn't not make money. Thought i was a genius. Now just went thru the exact opposite and still going thru it, but riding out the storm like a mf rollercoaster. What a ride!", "score": 1, "replies": []}, {"body": "Buffett was sitting on a pile of cash and has been buying  quite a bit over the last few months so we need OP to talk some sense into him.", "score": 1, "replies": []}, {"body": "For all... terrible advice.\n\nFolks really don't seem to understand you don't make money in bull OR bear markets.  You make money based on the few best days of the market.  Did a post awhile back on the investing subreddit awhile back on this.  In the last 20+ years the entire market return was in 20-30 best trading days.  Without those days your returns would be less then just putting it in the bank.  That came out to <1% of all trading days.  So, to make money just do nothing and stay invested.\n\nOf course, everything above is based on index fund investing.  If you are individual stocks ANYTHING can happen including losing it all.\n\nEither way one should only in in ANY stocks when they have a time horizon of that money for 5-10+ years.  One should have a Emergency Fund (EF) of 6m-1y if one is going to be 100% stocks.", "score": 1, "replies": []}, {"body": "This guy is correct liquidate partially, dont be left holding the full bags of dog shit wrapped in cat shit when this market falls off a cliff soon.", "score": 1, "replies": [{"body": "If you are in fact holding dog shit, then sell it off and never buy it back. But don’t sell off decent companies that are just down due to market conditions.", "score": 2, "replies": [{"body": "Everything is about to become shit. I believe what Dr. Michael Burry has been warning about is almost here and his predictions of a serious crash are becoming true again", "score": -1, "replies": [{"body": "Everything isn’t shit. There’s a lot of real value out there.", "score": 2, "replies": [{"body": "Very True but most things are very overvalued the last 2 years and alot of people who believe we are not about to enter a recession soon with be left holding stocks that may take 3-5 years to recover to these current levels. You have to be prepared to hold longer term and be down $ and not everyone wants to be down $ for years waiting to recover. You instead could cash out now and buy even more at a 50% discount after we fall off this cliff top.", "score": 1, "replies": [{"body": "3-5 years, damn that’s quick. I got 30 years.", "score": 1, "replies": [{"body": " Not everyone does", "score": 1, "replies": []}, {"body": "Most crashes take 13 years to fully recover to the previous highs thou 3-5years is a best case scenario", "score": 1, "replies": []}]}]}]}, {"body": "Dr.?  😆", "score": 2, "replies": [{"body": "Yes Michael Burry recieved his M.D. from Vanderbilt University School of Medicine. DR Burry doesn't practice medicine but he has kept his license as a physician active. So yes he is Dr. Michael Burry", "score": 1, "replies": []}]}]}]}]}, {"body": "In Japan market and yesterday it follows the US markets Friday. Hope for another up day today so I can take some profit. Still have almost 70% in cash ready to buy anything cheap enough.", "score": 0, "replies": [{"body": "Same here! My portfolio is $500 but I'm 80% cash! I don't want to risk losing my whole $500 retirement!", "score": 2, "replies": []}]}, {"body": "Why does this seem like a post that should be on S\\*&\\*&\\*!         A\\*(!&   ?", "score": 0, "replies": []}]}
{"title": "I sold my $TSLA shares and yolo’d into 3x leverage ETF $3LTP because it literally cannot go tits up when you retards actually think “the competition is coming” and somehow got away with pushing papa Elon’s empire down to $620", "selftext": "", "id": "v0zzln", "created_utc": 1653916554.0, "score": 150, "upvote_ratio": 0.83, "num_comments": 81, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|1 year ago\n**Total Comments**|7|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v0zzln)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v0zzln)", "score": 1, "replies": []}, {"body": "I support this position", "score": 31, "replies": [{"body": "I just hope jpow also supports", "score": 14, "replies": [{"body": "F", "score": 2, "replies": []}]}]}, {"body": "Welcome! You are the very definition of a retard.", "score": 21, "replies": [{"body": "Unless it works.", "score": 6, "replies": []}]}, {"body": "Was worried to buy these on t212 because of the spread, is there enough volume in these etfs to get out of your position easily?", "score": 8, "replies": [{"body": "Not the best to day trade due to spread/liquidity", "score": 5, "replies": [{"body": "The GraniteShares in GBP have 20-50k in volume but the ones in USD can have up to 500k in volume but UK users would have to pay an exchange fee which seems worth it. OPs position size is probably half of an average days volume lol. So i would pick 3LTS over 3LTP.", "score": 2, "replies": [{"body": "I'm always buying USD when its an option, keep gaining on the FX ![img](emote|t5_2th52|4258) GBP is only going to go down even more vs USD imo", "score": 2, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4887)", "score": 3, "replies": [{"body": "That sounds like something someone should think about before buying it", "score": 6, "replies": []}]}]}, {"body": "Nice bro, i hope you get laid too", "score": 15, "replies": [{"body": "Are you op’s sister? ", "score": 1, "replies": []}, {"body": "Fuck or famine", "score": 1, "replies": []}]}, {"body": "Should probably sell at this point", "score": 7, "replies": [{"body": "When he is showing a 50% gain of 50k. Definitely time to take cash off the table", "score": 1, "replies": []}]}, {"body": "Bill gates is looking for you.  He wants you to give him a massage.", "score": 18, "replies": [{"body": "Bill will be servicing me behind Wendy’s very soon", "score": 24, "replies": []}]}, {"body": "I have $1000 TSLA calls. I’m with you. To the moon and may tendies be in our favors. 🥂🙌🏻", "score": 17, "replies": [{"body": "What’s the DTE on your $1000 TSLA calls?", "score": 2, "replies": [{"body": "6/10 and further.", "score": 3, "replies": [{"body": "Outjerked again", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I’m up 20% on my lowest call. My highest one is up 210%.\n\nI’m not selling until bearish trend forms again.", "score": 3, "replies": []}, {"body": "If I have to, I’ll just keep rolling my positions. I believe in TSLA.", "score": 3, "replies": []}]}]}]}, {"body": "I don't see how we can lose !?!", "score": 3, "replies": []}]}, {"body": "Omg it’s retarded", "score": 6, "replies": []}, {"body": "Let us know how much you lose", "score": 4, "replies": []}, {"body": "You belong here, more so than others", "score": 3, "replies": [{"body": "Not as much as me, I bought GraniteShares PYPL 3x two days before earnings in the quarter they lost the eBay contract while their PE was at 47x.", "score": 1, "replies": []}]}, {"body": "You can’t buy these types of instruments in USA, can you ?", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "I've been scalping Tesla last 2 weeks, carried a Call and a PUT over but bought the call early so it's green and bought the PUT when it was up to hedge the call, very cheap PUT I'm more bullish than anything going into the week, well for Tesla, Microsoft, and GME", "score": 3, "replies": []}, {"body": "I hope you are aware that next quarter Tesla can beat analysts numbers only of there is a miracle sent from God to help us retards. Shanghai was locked down and not only they couldn't make enough cars, their supplier were locked down so no parts and no ships to take out the cars. Texas and Berlin are tuning the assembly line.", "score": 4, "replies": [{"body": "Yea I bought this dip but looking forward to that dip because I expect a big one. Bullish as fuck on Tesla so will buy more for sure.", "score": 3, "replies": []}, {"body": "Everyone and their brother and his cat is aware of this, this is why it’s priced in.", "score": 2, "replies": [{"body": "Priced in Elon's ass selling some billions to buy Twitter.  RemindMe! 3 months \" quarter miss is not fully priced in.\"", "score": 2, "replies": []}]}, {"body": "Yep well aware this also likely impacts our margin numbers per car sold significantly. That’s the bit I’m worried isn’t priced in which is why I will not be so leveraged to the tits when earnings comes around", "score": 0, "replies": []}]}, {"body": "Very nice.", "score": 2, "replies": []}, {"body": "i'm intrigued...might add to my IRA", "score": 2, "replies": []}, {"body": "I’m in with you bro sane entry, what’s the worst that could happen?", "score": 2, "replies": []}, {"body": "🦍TSLA 💪", "score": 2, "replies": []}, {"body": "Jésus H Christ", "score": 3, "replies": []}, {"body": "Tsla gonna hit 500 soon", "score": 2, "replies": []}, {"body": "Tsla going down has nothing to do with competition. It’s just way overvalued. It still hasn’t proven its anything more than a car company. It’s fcf yield is .9% and that’s at current prices.", "score": 1, "replies": [{"body": "Have you considered that it's value as a car company alone is justified due to it's unrelenting innovation in the factory to increase margins. Margins increase every. single. quarter.\n\nThis is unparalleleld Pricing Power in the auto industry.\n\nNo one will ever catch up to their margins, and so if they somehow become demand-constrained anytime over the next decade, they'll always be able to saturate supply through their pricing power.\n\nTesla will own minimum 20% of the entire global auto production after this EV revolution has taken hold.", "score": 1, "replies": [{"body": "There’s a lot you’re missing here, but you’re proving my point. Your valuation is not based on fundamentals but a projection. Tesla has failed every single quarter to deliver on so many of the promises that saw it’s multiple sky rocket.\n\nTesla has pricing power right now essentially bc it’s a luxury product. By your logic nio should be valued at a multiple much closer to Tesla. Their margins have also only gone up. On a margin comparative analysis alone nio should be worth 500 then.", "score": 1, "replies": [{"body": "Are we looking at the same results? Tesla is achieving margins people thought were impossible in the automotive industry (30%+ gross, en route to 40%), with unprecedented demand, and massively improving cash flows quarterly. \n\nNot to mention the majority of TSLA longs are not banking on the cars being the end game, but a means to the renewable/AI end-game. Modern markets evaluate the TAM of these companies and apply a multiplier for likelihood of capitalizing that TAM. (This market concept is nothing new, but explained thoroughly and beautifully in Peter Thiel's Zero to One.)\n\nThe three combined TAM is \"$/mi driven\" for the robotaxi theory, \"$/kwh\" on the energy grid theory, and $ per labour unit on the moonshot AI-Robot theory. Collectively this could be a multi-trillion opportunity, but most people will scoff at it. Those people also scoffed at TSLA $500 pre-split, so it really is a moot point.", "score": 1, "replies": [{"body": "Those margins are not sustainable bc of competition. Right now they basically are the EV market and a luxury good, so they have massive pricing power, I agree. \n\nThat said every other theory is pretty much entirely unproven. The robotaxis fleet is running on pure hopium. There’s no reason to believe tsla will even be the first to true fsd bc we don’t know which tech will get there first. Their solar is a failing business and their Robot is a man dressed in a robot suite. You can talk TAM all you want but it doesn’t change the fact you’re projection has infinite uncertainty built in and is therefore meaningless. I say this as a tsla long holder.", "score": 1, "replies": [{"body": "So we agree it's hopium with a multiplier for likelihood of execution, like Thiel wrote. The multiplier can be 0.01 (unlikely) or 0.5 or 0.99 (imminent.) \n\nIf it was certain then it would be baked into the price, and that's called hindsight investing and is the sure-fire way to average returns. \n\n\"Competition will destroy margins/moat/etc.\" has been a bear thesis since 2013 and we still haven't seen it. Not saying it won't happen (it's capitalism -- enemies always chip away at market share), but I'd say it requires more *hopium* to assume FCA/Toyota/VW et al to produce comparable EVs at anywhere-near-comparable-margins, navigating the Innovators Dilemma, and being dragged down by technological debt + infrastructure debt + dividend obligations. \n\nIt will take billions upon billions, cutting off gangrene, and ridiculous execution to compete with Tesla *today*, all while Tesla still moves at the speed of light towards the end-game of an energy utility. \n\nThe cars are a means to the end, so we get in line now -- and that's why the big vision bears are going to be at 500B or 1TN market cap. Same reason I was leveraging my house to buy *Amazon: The book company* or *Netflix: The video streaming website*. The Stage-1 products are always a means to the end.\n\nDespite that, I think we agree on a few things if we hash it out.", "score": 1, "replies": [{"body": "The multiple you’re paying is super unreasonable bc they are nowhere near proving let alone delivering their concepts. \n\nIt’s pedantic and vapid to say we agree you’re paying for a multiple bc that’s a tautology. \n\nThe point is the risk reward especially against the current macro context is totally unjustified even at current levels. \n\nThe competition bear thesis is necessarily going to play out unless you think Tesla will be the only EV. You say it’s been a bear thesis since 2013 like that’s relevant. Elon has been promising full fsd since forever too. But there are two realities: 1. Tesla will not be the only EV so competition is imminent and 2. It’s totally unclear that Tesla can deliver robotaxis, robots, or apparently even profitable solar. \n\nThe competition does not have to come from legacy car makers either. So that’s not really a counter argument. I agree competition in the luxury space is going to be hard to come by but if you’re talking the eV TAM most people would just buy an EV ie tesla less the software. For most people the TAM for EVs is a market for just battery powered cars, not teslas, and price wise Tesla can’t compete there at the level they currently are in the luxury space of a nascent market.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Do it again! Let’s bring those TSLA shares down", "score": 1, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "What broker/platform is this?", "score": 1, "replies": [{"body": "Trading212\n\nAs a bonus, here in the UK, this is a completely tax free ISA account for any and all gains made at any time", "score": 5, "replies": [{"body": "Gotta love our ISA accounts.\n\nSomeday I hope to make some gains that I won't be taxed on, but thus I am a simple money-losing retard.", "score": 3, "replies": []}, {"body": "You could even buy NIO in an ISA until Trading212 realised they'd done an oopsie", "score": 1, "replies": []}]}, {"body": "It's the one the broker can't afford their own platform so they have to embed Trading View for their charting software.", "score": 1, "replies": [{"body": "better than having to go to trading view anyways", "score": 2, "replies": [{"body": " true.", "score": 3, "replies": []}]}]}]}, {"body": "Why didnt you just buy your own calls lmao", "score": 1, "replies": [{"body": "I dont have access to options instruments in this brokerage", "score": 2, "replies": []}]}, {"body": "you have 165k and your using trading 212? or is that on a demo account?", "score": 1, "replies": [{"body": "Yeh why not have that in T212? These are all profits I’ve already cashed out my starting capital", "score": 1, "replies": [{"body": "because there's better brokers for the wealthy", "score": 1, "replies": [{"body": "Do tell. I’m not wealthy, but intrigued. I have a SIPP with HL and they are balls", "score": 1, "replies": [{"body": "most people use IBKR trading 212 is basically a middle man for them, it's who your trades go through", "score": 1, "replies": [{"body": "I've got a margin account in IBKR, but not much money in it because I can't have my ISA there", "score": 1, "replies": [{"body": "Yeah exactly!", "score": 1, "replies": []}]}, {"body": "Oh ok, I managed to open an IBKR account through TradeStation, and I just use it direct rather than their shitty interface ala T212, but it’s just for trading, not retirement! Definitely wouldn’t have a retirement fund if it was sat in IBKR!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Is this actually  better then holding tesla shares what are the cons how high are the fees", "score": 1, "replies": []}, {"body": "Lend us a 10er 😅", "score": 1, "replies": []}, {"body": "!remindme 18 months", "score": 1, "replies": []}]}
{"title": "Market/Meme summer insanity coming. UVXY explained", "selftext": "So for all you nose bleeding, fairy godmothers out there, I am here to put some pepto bismol up ur ass for the summer. I want to help you, even though I hate your guts. I am extremely good at timing major market moves- this last 2 months was a very brutal ass pounding, but pretty precise in its wave dynamic in setting up for one of the most bullish moves with the vix <25 in my lifetime for the next \\~2.5 months. Last week was a very strong initial confirmation and this week will solidify it.\n\nDoes anyone know why the Vix was smashing 35, but unable to break and why UVXY did not move in a parabolic way on this \"correction\" or \"bear market\"? Because we're not in a fucking bear market you finger smelling substitute teachers. This was the most violent bear trap I've seen in my life.\n\nThere's so many answers to this question, but one parameter to have a VIOLENT correction, the market needs to stabilize up. Wave 5, or B wave if you will. It's a FUNCTION of the stock market. It HAS to, or it will never go back up ever again. We haven't had that- it's represented by the movement in UVXY and the overall day to day movement in the market- We STILL HAVENT HAD IT. The importance of UVXY movement can tell you the \"strength of spy\" on a minute to minute, hour/day/month to month etc. Anyone who talks about UVXY and tries to explain its movement with \"decay and contango and front month futures\" just go back in your cage, Harambe.\n\nThe easiest way to explain/show this is how UVXY peaked early May, but the market went lower the next 3 weeks. On May 5th the market went up 1% in 1 minute. ONE % IN ONE MINUTE!!!! This is a stabilizer of momentum. The BULL MARKET stabilizes up, to allow for a violent overextension downwards (aka bear trap) **WHILE MAINTAINING A BULLISH BIAS**. I thought this overextension would last \\~3 days. The drop(hedge funds blew up that day), the doji, then CPI reversal, as most simple vix events last 3 days with that pattern. Instead it took 3 weeks- but the same pattern held true. The purpose of this is to maintain bearish momentum in the market...either much further out-years, or EXTREMELY violent this year, we'll get to that. \"that means the market knows where it's going?\" Yes. It does. Crazy for a million reasons? Yes, but true.\n\nThe importance of Friday's move is this...Market up 2% Thurs, UVXY flat. Market up 2.2% Friday UVXY flat. Market up \\~.4% in the last 30 seconds of trade, UVXY CRUSHEDDDD. The last week of movement wasn't bullish- it was just NOT BEARISH. The \"bull market\" just activated the last 30 seconds of trade...so what do you think is coming, apes? The market wasn't even impulsing higher, it was a reactive move off of the blow off bottom the last 3 weeks...and you know this...because of HOW UVXY MOVED. I've watched UVXY/SPY movement every day for 10 years. This is the correlation. This is why so many people are confused when they are both up or down together. It has NOTHING to do with decay. ur mother's ass warts, or Trump.\n\nAnother way to see this is May 19th. The market was flat but UVXY got CRUSHEDDD. This represents the market \"catching the weight of the market and holding+accerlerating up\". I know this to be true because, again, I've watched the correlation for 10 years. It may take a day a week or 6 months to play out, but it always does and it's up to YOU to figure it out. **It is the larger wave dynamic in the market doing what it needs to do to prepare for future moves.** And in this case, it is confirming it already!\n\nThis is only 1 piece of many many things I see and, thus, I see an enormous wave higher coming into the summer. I have my targets and assumptions of what to see. Basic TA can NEVER see these waves, which is why so many people get fucked. A candle is not a candle is not a candle. The quality of the intraday movement actually matters.\n\n**Targets: SPY ATH or close to ATH by August- we are in buy the dip trend not sell the rip- everyone in the world is saying sell the rip :), The meme/arkk trade will explode in June/July. I expect GME to break at least 250 with a target of about 380 with possible ATH. All other meme targets will track GME target as they are all basket stocks and move together.**\n\nSorry to burst the bubble, though, after this rally there is a very high chance we'll have a flash crash in about August **if** things get triggered. We will flash crash in a way the market has never seen before as per the VIX wave dynamic. This down momentum NEVER DISAPPEARS. It is FOREVER in the market until it gets released. If not this year, it will eventually happen that I can time when ready. I've never seen something this scary before. Like actually I get scared thinking about it. My guess is \\~75 on the vix, but REALLY fast with a fast recovery. This isn't \"the big one\" for the memes or the market itself either. It'll be a great buying opportunity into 2023 for boomer stocks if it happens in Aug.\n\nTLDR: Hopefully I could have shed some light on UVXY, which blew up my account many years ago- if I can help a few degens not double down on bearish sentiment, why not? Buy and hold memes into July and if things get triggered, a flash crash of epic proportions in August. Also, recession 2023 not 2022 fucking nerds xD\n\nNot financial advice\n\nFor those crying about show something. Max bear copium. I have no problem taking ur money. P.S. dont do like me and buy SPY. Buy SPX for 60% LTG instead. Whoops\n\nhttps://preview.redd.it/1pd1hcft5p291.png?width=971&format=png&auto=webp&s=ae3ca49fb04c5f1dcec80a620d41a616483388ae\n\nhttps://preview.redd.it/8yry7zyn5p291.png?width=989&format=png&auto=webp&s=5d4cd572caa4b6ce3109c1c0a608b2487814ec11", "id": "v1a1oc", "created_utc": 1653945159.0, "score": 54, "upvote_ratio": 0.71, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|114|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/v1a1oc/marketmeme_summer_insanity_coming_uvxy_explained/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v1a1oc)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v1a1oc)\n    \nHey /u/Grimbarbs, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "This post taught me that i have using pepto bismal wrong for years.", "score": 49, "replies": [{"body": "Yep. Pepto in the enema bag = god mode.", "score": 9, "replies": []}, {"body": "Do they trade publicly, the makers of pepto? They about to \"moon\" if you get my drift", "score": 4, "replies": []}, {"body": "Face paint that tastes great", "score": 1, "replies": []}]}, {"body": "This ain't no movement you fuckin mouthbreather. Trading is not a team support.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 31, "replies": [{"body": "Good bot. Mouth breather definitely spotted.", "score": 11, "replies": []}, {"body": "team support", "score": 6, "replies": []}, {"body": "Team sport stupid bot.", "score": 4, "replies": []}, {"body": "Tell that to the good ol boys at gme", "score": 2, "replies": []}, {"body": "This bots so good you can eat it with a spoon. Spoonbot", "score": 0, "replies": []}]}, {"body": "This shit is mad dumb, I wasn’t able to get thru it but UVXY is a derivative of VIX futures which are  expected future values of a derivative of option prices on SPX, which are of course a derivative themselves as all options are.  So trying to do any analysis on UVXY is like a 4 layer exercise in retardation.", "score": 22, "replies": []}, {"body": "this guy is high as fuk, money printer is going to reverse, aka QT, and he thinks stock goes all time high during the reverse printing.\n\nQT starts on Wednesday btw.", "score": 52, "replies": [{"body": "but he’s been watching vix for 10 years!!!!!", "score": 42, "replies": [{"body": "who the fuck is vix?", "score": 6, "replies": []}, {"body": "You are missing the point, on May 5th the market went up 1% in 1 minute. ONE % IN ONE MINUTE!!!!", "score": 1, "replies": [{"body": "basically happened again today lol", "score": 1, "replies": []}]}]}, {"body": "I kept reading for the bear take, and all I got was some retard who forgot his helmet telling me the market is going to moon during QT.\n\nI swear to God I'm not mad at these idiots, someone has to sell those covered puts in going to print money with... But Jesus Christ, take the hint. Dead cat bounces usually look like a full market reversal. Exactly what we saw last week.\n\nMarket is losing last week's gains by Wednesday, and searching for new 52 week lows by EOD Thursday.\n\nTA is not taking into account the ludicrous money printing of 2020. 60 years of studying VIX is useless when the market conditions did not match those of today.", "score": 30, "replies": [{"body": "i think you’re wrong. Last week’s high at the bull trap was SPY $408. It’s broken that resistance and we are definitely more bullish now. Even look at the monthly chart with last day of May tomorrow. It’s incredibly bullish if we end May with that candlestick going into June. Unless we see some kind of -$20 day tmrw, we gna keep rallying for atleast a month or two more. Biggest bear trap in recent 2 years since 2019. Just my 2cents.", "score": 2, "replies": [{"body": "I hear what you're saying. But I don't think the TA and resistance levels are indicative of the overall market. There's a sentiment of no resistance again until 420-430. We'll see how it pans out. I don't know shit, in just snorting crayons and trying to make sense of my blown up account following a lot of bear ideology.", "score": 2, "replies": [{"body": "lol, bearish ideology. I leave that shit to the care bears, it's strong stuff.\n\nYou forgot that the market plans ahead for adverse events...then once that's 'done' goes wherever it wants. QT hasn't even started yet and all that QE money is still floating around, much of it sitting as cash after the recent selloffs.  The market wants to go up now.", "score": 3, "replies": []}]}]}, {"body": "Look at you, giving yourself awards", "score": 1, "replies": []}, {"body": "Adding the inflation around 13% cumulatively since Feb 2020, the pre-pandemic highs of 3390 equate to right around 3800 which is what we touched a couple weeks ago.  Is it wrong to say that’s the bottom because of QT policy now vs Feb 2020?", "score": 1, "replies": []}]}, {"body": "J Pow gonna clench our buttholes for us…", "score": 6, "replies": []}, {"body": "The market corrected in anticipation of QT BUT QT (like the rumored recession) hasn't started. That means lots of QE money is still looking for a home. There's lots of room for a surge before the money actually dries up.", "score": 1, "replies": []}]}, {"body": "Why are you not making money with this great knowledge?", "score": 16, "replies": [{"body": "OP has more than enough correct to be making gobs of money even without the AI I've got behind my VIX strategy. But, that assumes OP doesn't actually trade the extremity of these predictions. Betting everyone gets worked up again, but the market *doesn't* crash, winning \"small\" (20-50% gains) repeatedly but missing out on \"the big one\", is far more profitable than *actually* betting the market crashes.", "score": 1, "replies": []}, {"body": "![gif](emote|free_emotes_pack|facepalm)", "score": 1, "replies": []}, {"body": "Because it hasn't happened yet...", "score": 1, "replies": []}]}, {"body": "Thank you fag, very cool!", "score": 31, "replies": []}, {"body": "If not tomorrow, then next week, or next month, or next year ... trust me bro VIX 75", "score": 11, "replies": []}, {"body": "This will not age well", "score": 10, "replies": []}, {"body": "![img](emote|t5_2th52|6880)", "score": 8, "replies": []}, {"body": "Positions or ban", "score": 12, "replies": [{"body": "flowergirlnextdoor has challenged someone to post their positions! \n\nflowergirlnextdoor, if someone has made a claim that they bought / sold something and fail to prove it within 24 hours, message the mods to have them banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "It blows my mind how many people are super focused on a couple charts and make all of their long term moves based solely on that and don’t look at the big picture.", "score": 4, "replies": [{"body": "Because they have 0 understand of (macro)economics", "score": 1, "replies": []}]}, {"body": "NEW HEADLINE:  Oil price going to $140 kills rally and so does Biden and Jpow meeting tomorrow because Biden wants inflation to die ASAP", "score": 6, "replies": []}, {"body": "Loved the post, great insight and an overall unusually based contrarian opinion. On that note, I would love if you could write up a greater more detailed post on all of your findings  of the correlation between SPY and VIX in this regard; you've definitely got me intrigued and I would love to see more", "score": 5, "replies": [{"body": "Same here! Not sure I understand how you're interpreting UVXY and why", "score": 3, "replies": []}]}, {"body": "Uvxy $45 September calls. Got it.", "score": 5, "replies": [{"body": "good luck with that LMAO", "score": 1, "replies": [{"body": "Yea. I loaded the boat. Cue rockets.", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4735)", "score": 4, "replies": []}, {"body": "So my 2023 calls are safe?! Gotcha ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|8882)", "score": 5, "replies": []}, {"body": "So this aged well.", "score": 3, "replies": [{"body": "Still Relevant", "score": 2, "replies": []}]}, {"body": "best DD u deserve so much more. I agree w/everything you said abt UVXY and VXX. Biggest bear trap ever.", "score": 7, "replies": []}, {"body": "SQQQ. Soon as the reverse split was announced, I knew they were trying to make the short side expensive. Look at the QQQ, and much more room to fall...", "score": 2, "replies": []}, {"body": "31st is SPX expiration. UVXY tracks what, again?", "score": 2, "replies": [{"body": "UVXY follows VIX. VIX follows SPX", "score": 1, "replies": [{"body": "It follows SPX what?", "score": 1, "replies": [{"body": "Implied Volatility of SPX over 30 days or the up/down movement in price action of the index.", "score": 1, "replies": [{"body": ">derived from real-time, mid-quote prices of S&P 500® Index (SPX℠) call and put options\n\nYou think maybe closing a bunch of options positions on SPX before expiration has some effect on the VIX?", "score": 1, "replies": [{"body": "There’s a buyer and seller for everything until it settles. So it really depends on how close to expiration it is and how close to the strike it is to determine IV. So if supply/demand is there, no matter call or put side, it’s a measure of the sentiment for the future of SPX price as measured by the options contracts. If you sell before expiration then someone is buying it. I think it has to do with the number of OI and volume on that call/put strike as a whole  and less to do with the individual buy/sells. I know sometimes VIX and SPX can go down together and while it’s happened multiple times recently, my understanding is it isn’t really common to occur…", "score": 1, "replies": [{"body": "Yeah, you don't see it often. There was a lot of open interest on SPX puts that kind of died. I think the option writers buying them back to close had a little impact throughout the days, but the IV was dropping. On the call side, there was such little OI until later in the week because nobody (big enough) was certain of the rally. On the put side, a lot of contacts that were ITM went OTM. Cheap enough to close both sides from the option writers position and I can't imagine most holding over the long weekend. \n\n\nMy quote is also directly from the CBOE website. I realize I don't know enough about the weighting to make any kind of informed statement in the matter, so I'm reading about it now, instead of doing my reading for my programming class.  I do know I've seen volatility die a bunch of times right before expiry, which is why I think that's all that really happened. Just about every time people get excited for quad witching, it amounts to IV crush and boring, flat days.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "My wee wee went BIG BIG reading this", "score": 2, "replies": []}, {"body": "The attitude I see in the comment section is hostile to say the least. OP is making tons of money with this one simpler trick traders wouldn’t want you to know. Now he’s lending you the goose that lays golden eggs and this is the reward he gets? You know he can get back to writing his book “How to make 300% year over year regardless of the economy” but instead he’s extending an olive branch to everyone just to get ridiculed. I for one will go to his seminar when he’s visiting Idaho on his tour.", "score": 2, "replies": []}, {"body": "Dude's -90% on his July 15 SPY 420 calls", "score": 2, "replies": [{"body": "I bet he's up %1000's now though", "score": 1, "replies": [{"body": "Yeah hopefully he timed his entry and expiration date well.", "score": 1, "replies": []}]}]}, {"body": "tldr\n\nstonk up", "score": 4, "replies": []}, {"body": "No they stopped all fha loans this month. That's like 90% of loans.\n\nQ T is secretly here .\n\nHousing will fall fall\n\nMarkets will crush crush\n\nHahahahahahahahahahuauauauauahahahahahahhahahahahahahhahahahahahhahahaha", "score": 2, "replies": []}, {"body": "What about 9T$ QT and 2T$ RRR", "score": 1, "replies": []}, {"body": "Positions?", "score": 1, "replies": []}, {"body": "Housing market crazy=banks make money=market go up", "score": 1, "replies": []}, {"body": "Wendy’s Management is second to none🤪", "score": 1, "replies": []}, {"body": "Remindme! Six months", "score": 1, "replies": []}, {"body": "If your investing thesis is long vol on UVXY - your timing must be impeccable, as shorting vol will always make profit (eventually) as UVXY’s underlying NAV is a losing proposition fundamentally", "score": 1, "replies": []}, {"body": "Take my last Award you filthy animal", "score": 1, "replies": []}, {"body": "OP “I’m very good at timing things” \n\nAlso OP: “this will only happen IF everything goes according to my prediction which should workout because I said it would but if it doesn’t then I said it might not so I’m still right”\n\nSummarized more or less", "score": 1, "replies": []}, {"body": "*Crazy Charlie Meme*", "score": 1, "replies": []}]}
