{"title": "For the first time in a century! Dow in eight straight weekly losses as recession fears rise", "selftext": "Recession worries rise.\n\nRecession worries rise, once the S&P 500 index into the bear market, but the main stock index late strong pull up, the Dow and the S&P 500 index erased weekday losses, the latter temporarily escaped the bear market range.\n\nAs of the close, the Dow rose slightly by 8.8 points to 31,261.9 points, after once sinking more than 600 points during the day; the S&P 500 was almost flat at 3,901.4 points, the largest intraday pressure, the stock index fell 20.9% from its January intraday high, entering the bear market range for the first time in more than two years; the Nasdaq closed down 33.9 points or 0.3% at 11,354.6 points.\n\nThe last time U.S. stocks entered a \"bear\" was back in March 2020, when the epidemic hit Europe and the United States, and countries imposed blockades and suspended economic activities to control the spread of the virus. However, in that month, the Dow returned to the bull market in just 11 trading days, i.e., a rebound of more than 20% from the previous low.\n\nCurrently, U.S. stocks are suffering from multiple shocks, including high inflation, accelerating interest rates, rising recession risks and the uncertainty of the situation in Ukraine. Selling pressure has long spread from technology stocks to all sectors, year-to-date, energy stocks for the only sector to achieve gains.\n\nThis week, the latest earnings reports from major retailers have investors worried about weakening consumer purchasing power and the inability of companies to cope with inflation, which is at a 40-year high. Shares of retail giants Wal-Mart and Target fell sharply after disclosing their results, with both stocks posting their biggest one-day losses since Black Monday in 1987, with Wal-Mart down 19.5% for the week and Target down a cumulative 29.3%.\n\nTo sum up the week, the Dow accumulated a 2.9% decline, the eighth consecutive weekly closing decline, according to foreign media statistics, for the first time since 1923, i.e., a century; the S&P 500 and the Nasdaq fell 3.1% and 3.8%, respectively, both hit the weekly seven consecutive negative, the longest decline since 2001.\n\nNational Securities chief market strategist Hogan (Art Hogan) said the past seven weeks of market struggles, largely related to inflation, \"what high inflation means for corporate profitability, the Fed will take more aggressive measures to fight inflation. While this issue is old hat, it will continue to be the number one headwind for the market.\"\n\nBill Stone, chief investment officer at trust company Glenview Trust, wrote in a report that despite the many headwinds triggering the current sell-off, the immediate cause of the accelerating decline in stocks is investor concern about the consumer market. \"For the first time in the post-epidemic period, retailers are struggling with excess inventory, coupled with rising costs due to inflation, squeezing retailer earnings. There are signs that lower-end consumers are feeling the pinch from higher prices.\"\n\nRoss Stores, which missed revenue and earnings estimates, was another strong evidence of these concerns, with shares plunging 22.5% for the day. The company reported after-hours earnings Thursday for the year ended April, with revenue down 4 percent to $4.3 billion and net income down 29 percent to $340 million. The company's CEO, Barbara Rentler, said that the external environment is very challenging, the situation in Ukraine to exacerbate inflationary pressures, suffering from rising logistics and labor costs, revenue is expected to continue to weaken in the quarter ending July, sales will be backed by 4% to 6%.\n\nJohn Deere, the largest U.S. farm machinery maker and considered a global economic bellwether, closed down 14.1%. For the quarter ended May 1, the company reported earnings of $6.81 per share, better than market expectations of $6.71, up 20 percent from a year earlier, on revenue of $12.03 billion, less than the expected value of $13.2 billion. The company said that despite higher costs for seeds and fertilizers, crop prices continued to be high, boosting farmers' interest in buying tractors, harvesters and other equipment. Therefore, the company raised its full-year earnings guidance, with a full-year net profit range of $7 to $7.4 billion. However, the company's management also noted that supply chain issues were disrupting production and delivery, and was confident that the situation would improve in the second half of the year.", "id": "uucub7", "created_utc": 1653097149.0, "score": 189, "upvote_ratio": 0.79, "num_comments": 76, "comments": [{"body": "I’ve read that first paragraph about 8 times and I cannot process whatever it’s trying to say. Something is off or a word is missing.", "score": 132, "replies": [{"body": "Oh, It’s bad. It’s one more than just one missing word. The whole paragraph is messed up.", "score": 47, "replies": [{"body": "Is OP a bot who's trying to become sentient?", "score": 10, "replies": []}]}, {"body": "Looks like an AI post tbh", "score": 42, "replies": [{"body": "    If Recession worries rise  \n        then the S&P 500 index into the bear market  \n    else the main stock index late strong pull up\n        the Dow and the S&P 500 index erased weekday losses\n        the latter temporarily escaped the bear market range.", "score": 14, "replies": []}]}, {"body": "It's as if Charlie Kelly wrote it", "score": 17, "replies": [{"body": "I bet a pirate wrote it.", "score": 3, "replies": []}, {"body": "The only part I understood was the section referencing Bird law.", "score": 1, "replies": []}, {"body": "... filibuster...", "score": 1, "replies": []}]}, {"body": "It’s not your fault this was written by GPT3.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Not at all. I think it has something to do with comma placements or maybe…hell I donno. I’ll go to sleep and try again in the morning.", "score": 11, "replies": [{"body": ">Recession worries rise, once the S&P 500 index into the bear market, but the main stock index late strong pull up, the Dow and the S&P 500 index erased weekday losses, the latter temporarily escaped the bear market range.\n\nYes, it's terrible.", "score": 19, "replies": [{"body": "Glad it’s not just me.", "score": 9, "replies": []}]}, {"body": "It’s not you.  I thought the same thing when I read it; doesn’t make sense.", "score": 5, "replies": [{"body": "It's because it claims the index falling into a bear market while referring to a strong market pull up and recovering losses.", "score": 3, "replies": []}]}]}]}, {"body": "He's saying eff the market and hedge yourself. \n\nOr hang on, this is going to be a wild ride", "score": 2, "replies": []}, {"body": "Reddit", "score": 0, "replies": []}, {"body": "He probably reworded it and cut out bits without proof reading it again.", "score": 1, "replies": []}]}, {"body": "Did a bot make this post?", "score": 45, "replies": []}, {"body": "Exciting times.", "score": 19, "replies": []}, {"body": "lol, \"Strong pulling up.\"\n\nLike a pilot has a strong pull up right before they crash into the mountain.", "score": 9, "replies": []}, {"body": "Pisses me off how companies act like they don’t know how to manage this inflation when their ceos make 100m a year.", "score": 29, "replies": [{"body": "CEO’s just charge more lol \n\nBoard: OMG they’re a genius!", "score": 10, "replies": [{"body": "CEO: *I need a raise.*", "score": 6, "replies": []}]}, {"body": "CEO compensation has nothing to do with the supply chain issues that companies are facing...", "score": 1, "replies": [{"body": "You’re right.", "score": 2, "replies": []}]}]}, {"body": "Why did Deere drop so much? The results weren’t that bad", "score": 9, "replies": [{"body": "The company has been up since the start of the year and the S&P is down around 20%. A company has to absolutely be crushing it to not get pulled down in this market", "score": 2, "replies": [{"body": "Keep adding? I have over 700 shares and took an absolute beating Friday but long term this company is on the right track. The challenges they are dealing with are not company specific.", "score": 2, "replies": [{"body": "I don’t know what to tell you. I mostly play with options. You should wait until Tuesday though to buy so I can unload my put on Monday ;)", "score": 1, "replies": []}]}]}, {"body": "I'm not in Deere but sometimes what makes a stock go down is based on forecast and not so much earnings. A company can do awesome in their last quarter earnings hit if they forecast that they aren't going to make much next quarter, then investors will be worried and sell off and maybe get in later on when things get better. Not financial advice but that's an idea of many ideas.", "score": 6, "replies": [{"body": "they gave strong guidance though", "score": 5, "replies": []}, {"body": "*most times", "score": 1, "replies": []}]}, {"body": "Maybe there aren't enough raw materials (i.e. labor and fertilizer) for farms to capitalize on the higher demand for food production.", "score": 1, "replies": []}]}, {"body": "This is why I’m now happily betting against the market", "score": 31, "replies": [{"body": "How does one do this?", "score": 6, "replies": [{"body": "Either short selling or using inverse leveraged funds", "score": 19, "replies": [{"body": "Futures is even easier but there is no limits to your losses if the trade goes wrong", "score": 2, "replies": [{"body": "Even better", "score": 1, "replies": []}]}]}, {"body": "Get a Mohawk, leather jacket, listen to real punk not the poser emo crap.", "score": 27, "replies": [{"body": "I suggest Operation Ivy", "score": 1, "replies": [{"body": "All I know is that I don't know nothing.", "score": 5, "replies": [{"body": "To me that line was about not having any degrees or skills as a teenager.", "score": 1, "replies": [{"body": "Well, they were all around 18 at the time and lived in drug infested bay area before the tech boom.", "score": 0, "replies": []}]}]}]}, {"body": "You have good taste. And I'm sure you're talking about MGK being the power emo crap lol", "score": 0, "replies": [{"body": "I actually love pop punk and metal core pop punk. I'll listen to Avril or mgk but I'm also a corporate sellout.", "score": 1, "replies": [{"body": "I'm ok with Avril but MGK, I pass on MGK lol", "score": 1, "replies": []}]}]}]}, {"body": "short stocks or buy puts", "score": 1, "replies": []}, {"body": "SQQQ", "score": 1, "replies": []}]}, {"body": "May be a little late. The big money already made imo, just like big money was to be made in puts in Feb 2020. By March, everybody was doing it and all over WSB, at that stage it was too crowded. Big money is made going against the crowds *before* something happens. Do you believe at this stage the risk/reward is still worth it?", "score": 11, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "It’s called that not due to the performance of any individual stocks, but rather because of a 20% drop from ATH of one or more indices. As such “bear market” is actually a technical term, not an arbitrary feeling.", "score": 4, "replies": []}]}]}, {"body": "Cute of you to think that it’s still the time to short", "score": 2, "replies": []}, {"body": "I have been burned doing that in the past, so now I miss out there.", "score": 1, "replies": []}]}, {"body": "Green week ahead then more blood", "score": 3, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I know it's a meme lately but I think the market is pricing in a recession already. Could be something that once we know we're in it then we go flat or up. Recessions are usually over rather quickly.", "score": 7, "replies": []}, {"body": "Q1 was reported in April. Down 0.4%. The market went up that day then resumed the slide it's been in since the year began.", "score": 3, "replies": []}]}, {"body": "Monday is red but rest of the week idk", "score": 2, "replies": []}, {"body": "We are already in and have been in a recession for some time now", "score": 2, "replies": []}, {"body": "Time to liquidate and reinvest in companies that are going to bounce back fast. Being on the fence is very uncomfortable but you can't just wait until you run out of grass to figure out which side is greener. Pack up and pack out, if we all were to drop next week and plan on getting back into the market in a couple weeks, then we can possibly make a market upswing.", "score": 2, "replies": [{"body": "What classes are you looking into? Or just companies with strong cash reserves and growth potential", "score": 1, "replies": []}]}, {"body": "First time in a century? What? Lol?", "score": 0, "replies": [{"body": "Not the case for flirting with bear market territory by the S&P but that is the first 8 week losing streak by the Dow in nearly a century, yes.\n\nIn all honesty, I think it’s likely that records get broken (there is no 9 week losing streak here in history and I don’t think there is an 8 week one for the S&P/Nasdaq), but if that doesn’t happen that could turn into an interesting early signal.", "score": 1, "replies": []}]}, {"body": "how are supply chain issues surrounding semiconductors going to be impacted by potential for violence between china and taiwan. Let's say russia drags the west into war and china decides it's time to take taiwan, what happens to the whole of vehicle production.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Bruh", "score": 1, "replies": []}]}, {"body": "Bear market is a term that's thrown around like its candy. People don't really seem to understand what bear market actually means. It shouldn't mean 20% down. You can easily find bull market corrections of even 30% but that doesn't mean its bear market. Bear market is phase, its both price and time destruction not just price. 2001 and 2008 was bear market. This isn't yet.", "score": -5, "replies": []}, {"body": "Sell it all so I can pick it up for cheap. 😂.", "score": 1, "replies": []}, {"body": "Here's my take! Go with the companies that are needed! \nConnections, speed, robotic companies, communication companies, Energy companies Electric, solar And Nokia!! These types of solid needed companies will beat the downwards markets and rebound much more rapidly than the rest!!  particularly watch NOKIA this will be the big winner!!! Just my take 🚀", "score": 1, "replies": []}, {"body": "…so how long until house prices drop", "score": 1, "replies": [{"body": "Praying on housings downfall", "score": 1, "replies": []}]}, {"body": "So if retailers are mad about consumers spending less why are they increasing prices on everything? \n\n“We raised prices 10-30% on goods and now nobody is buying anything. 🤬”  shockedpikachu\n\nWanna get people spending?  Lower your fucking prices.  It’s almost as if corporations can control this inflation narrative.", "score": 1, "replies": []}, {"body": "Before we are finally in bear market, there will be at least handful of crazy bulls rallies.", "score": 1, "replies": []}, {"body": "Bag holders unite!", "score": 1, "replies": []}, {"body": "The consumer is getting weaker. Excess inventories bc companies are double booking as preparation against supply chain issues. The true signs of hot inflation are coming in. Unfortunately, inflation has now become entrenched bc Jerome Powell dragged his feet looking for the 'perfect' time to raise rates..", "score": 1, "replies": []}]}
{"title": "Can you envision MSFT and AAPL down 50% from here?", "selftext": "Do you think AAPL GOOGL and MSFT (big tech) could fall 50% from here?\n\nWhat about FB?\n\nI had a nightmare about my portfolio being down 80% and the sp500 was about 2000 or something. I woke up sweating!\n\nCan the sp500 hit 2000 this summer?\n\nI mean do you think it will?\n\nI think sp500 3000 and even 2800 is definitely possible very easily!\n\nDeutsche Bank said a recession will most likely put the sp500 at 3000.\n\nWhat about MSFT AAPL GOOGL going down 50%?\n\nI was looking at their charts on Google and they're in a downward trend since around November.\n\nThey've yet to break that trend! \n\nLook at the lines, they're straight down! Yes a little relief rally all along the line (probably where institutions are cashing out) but the trend is down and lower lows lower highs!\n\nGood luck all!\n\nI'm scared and excited at the same time!\n\nScared that my 60% in is going down but excited to have 45% cash when we get to sp500 low!\n\nHave cash ready.... I recommend 70%!!", "id": "uuw7yx", "created_utc": 1653167752.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 73, "comments": [{"body": "So many questions.  Yes, I can imagine any of these stocks dropping 50% from here.  I don't think it's likely, but it's certainly not impossible.  They would be great buying opportunities if that happened.  \n\n\nNo one knows where the bottom is, analysts included.  \"Recession\" isn't a binary state, so saying stocks will fall to 3000 if we have a recession is sort of like saying I'd wear a size XL if I became obese.", "score": 16, "replies": [{"body": "All I know is that I'm glad I'm 45% cash!\n\nThe hard part is putting money in after a big fall also! I remember in March 2020 being afraid.  But I'll have to buy something at least!", "score": -5, "replies": [{"body": "I was lucky enough to move to pretty much all cash about four months ago.  My portfolio is down about 3% over the last six months.  I wish I could say I'm just that smart, but I think I'm really just that lucky.", "score": 2, "replies": [{"body": "Now the second trick is picking an entry for your capital. Good luck 👍🍀", "score": 2, "replies": []}]}]}]}, {"body": "I'll make you a bet. If AAPL and MSFT dip under $200 combined.. not quite 50% I'll buy 100 shares of each.", "score": 18, "replies": [{"body": "I will join you in this endeavor.", "score": 11, "replies": [{"body": "Sheeeeit idk about a hundo but I’m in too", "score": 3, "replies": [{"body": "Doesn't matter. We going to pump and du~hold.", "score": 5, "replies": [{"body": "Taking my shares to the grave 😤😤", "score": 2, "replies": []}]}]}]}, {"body": "That's a promise not a bet.", "score": 1, "replies": [{"body": "Well the bet is that they won't get that low.", "score": 2, "replies": []}]}]}, {"body": "3000 yes. 2000, unlikely.", "score": 12, "replies": [{"body": "Then when (if) we hit 3000 your answer will be \"2000 yes, 1500 unlikely\" ....... 😆", "score": -22, "replies": [{"body": ">Then when (if) we hit 3000 your answer will be \"2000 yes, 1500 unlikely\" ....... 😆\n\nWould that be incorrect?  The fact that we fall to 3000 wouldn't imply we will certainly fall to 1500.  Your reasoning here doesn't hold up.", "score": 7, "replies": [{"body": "How far do you think we'll fall?", "score": -5, "replies": [{"body": "I have no idea how anyone could answer this without knowing what it will take to get inflatino under control.  We'll fall further if terminal rate goes to 7% than if it goes to 3%.", "score": 3, "replies": [{"body": "Sp500 1000 I think.", "score": -9, "replies": []}]}]}]}, {"body": "anything is possible technically!", "score": 7, "replies": []}, {"body": "I highly doubt a 40%± from top will occur, that puts us at around 2800\n\nEven a 50% drop would be 2400.", "score": 1, "replies": [{"body": "2800 sounds about right.\n\nI say we're at 3200 in July", "score": 1, "replies": []}]}]}]}, {"body": "If they do, then I think a majority of people would be worrying about a whole lot more than the stock market…", "score": 11, "replies": [{"body": "Right. But that's the time to buy!", "score": 1, "replies": [{"body": "You shut your mouth when you’re talking to me", "score": 18, "replies": [{"body": "?", "score": -1, "replies": []}]}]}]}, {"body": "They can, nobody knows. If they are down 50% from here, hundred others would likely be down 80%.", "score": 3, "replies": []}, {"body": "News media wants the recession because people are tired of hearing about Ukraine and bishes wearing sundresses outside again so news companies ad revenue margins are in the shitter", "score": 5, "replies": []}, {"body": "If things got that low I’m taking out loans and selling all my shit and buying everything", "score": 2, "replies": [{"body": "If that happened… good luck getting a loan!!! 😂", "score": 5, "replies": []}]}, {"body": "I would be a little worried but at the end of the day all companies/markets go through cycles. The fundamentals of those big three aren’t any different. So in that respect I look at it as a buying opportunity. Personally, I’m holding right now and just keeping a sharp eye. And if the price is right I’ll add a few shares here and there. Definitely don’t go all in since no one can predict the actual floor. Eventually all markets will turn around. The war in Ukraine will end. And Covid/Omnicrom/Megatron/Cybertron/TronLegacy will barely be mentioned. Lol", "score": 2, "replies": [{"body": "Dan Nathan on cnbc said it's better to just nibble at QQQ instead of buying the big tech individually since it contains all the beat down crap along with MSFT GOOGL AAPL and nvda", "score": 1, "replies": [{"body": "“contains zombie companies that have been floating on cheap money”\n\nI’ll talk Apple over QQQ anyday…", "score": 1, "replies": [{"body": "Yeah but it also has MSFT GOOGL PYPL NVDA etc.  Zombie companies will eventually die off.\n\nPlus you're buying into FB which is beat down about as far as it'll probably go.  Only upside left.", "score": 1, "replies": []}]}, {"body": "I have some VOO already. So I’ll probably add more eventually. They’re pretty similar ETFs", "score": 1, "replies": []}]}]}, {"body": "3000 very likely. 2000 would mean that some sht has gone horribly wrong.", "score": 2, "replies": [{"body": "Agree. I think we could see 3000 - that just puts us back to pre Covid QE levels of late 2019. I think 2000 would be a much more nasty situation and that feels more unlikely unless we have economic catastrophe.", "score": 1, "replies": [{"body": "Jeremy Grantham said 2500. I'll start dca at 3600.", "score": 2, "replies": [{"body": "Grantham is very bearish. I like your idea of starting DCA at 3600.", "score": 1, "replies": []}]}]}]}, {"body": "Have you looked NFLX chart? Zoom out to max. That chart is insanity. It looks like something out of the 1929 market.\n\nAt this point, all bets are off.", "score": 2, "replies": []}, {"body": "IT and Maintenance is seen as just expenses for most companies. If revenue starts going down, then they will look for areas to cut. IT is an easy place to cut…\n\nMSFT: People will easily cut gaming from their lives for heating expenses. A lot of companies planning on migrating to Azure could cancel or delay and continue with their current servers. \n\nGoogle - Adsense would suffer…\n\nApple - IPhone sales sink, my 2 year old iPhone isn’t much different than the 13… Very little need for 5G where I live.\n\nI doubt it will happen, but it can", "score": 2, "replies": []}, {"body": "most we fall is to precovid levels", "score": 2, "replies": [{"body": "No", "score": 1, "replies": []}]}, {"body": "Depends on whether China starts war with Taiwan or not. Hopefully not.", "score": 1, "replies": []}, {"body": "If AAPL and MSFT collapse 50%, it will mean the worst beat market in history.", "score": 1, "replies": []}, {"body": "Why are you sitting on cash and not precious metals and ammunition? You think your cash will be worth anything in this collapse?", "score": 1, "replies": []}, {"body": "Overall there are a number of stocks  that are currently in the process of reverting to their pre-covid valuations, Apple and MS could easily follow this pattern and hit 50% down.", "score": 0, "replies": [{"body": "I don't know....", "score": 0, "replies": []}]}, {"body": "I have $AAPL intrinsic value at $93, so yes.", "score": 0, "replies": []}, {"body": "Don't worry\n\nTom Lee of Fund Strat said FAANG stocks (and this would include MSFT even though it's technically not FAANG) are undervalued now.. Even if they go lower a bit, they should be OK in the long term lol", "score": 0, "replies": [{"body": "Yeah", "score": 1, "replies": []}]}, {"body": "We're already in a recession which means equities have already been pricing it in the last 6 months. We may be closer to a bottom than you think. Equities always bottom and rebound first in a recession because of this. I'm starting to DCA a little heavier", "score": 0, "replies": [{"body": "Bottom is 2800.\n\nGrantham says 2500", "score": 1, "replies": []}]}, {"body": "Some people say yes it will go lower others say it’s cool. Why not hedge with some inverse ETFs or something?", "score": 1, "replies": [{"body": "Inverse etfs are hard to do.  If you bounce up and down don't they lose?", "score": 1, "replies": []}]}, {"body": "No, because it would drop the S&P so much. It would cause GOOGL, TSLA, AMZN and others to fall too.\n\nLeading to S&P under 3600.\n\nMaybe even causing huge margin calls and fear.", "score": 1, "replies": []}, {"body": "http://stockchoker.com/stockwatch/?s=AppleMicrosoftIBM", "score": 1, "replies": []}, {"body": "Buy dips", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Yes. I think AAPL is overvalued and I bought some puts to hedge my portfolio a bit. I don't know enough about MSFT. When I saw Burry do the same thing I got a nice dose of confirmation bias.\n\nDon't get me wrong, AAPL is a brilliant company. But it's priced for growth that I don't see happening over the next 12 months. I think QE and free money pulled a ton of their growth forward last year. One earnings miss and it will experience what FB and NFLX did.", "score": 1, "replies": [{"body": "Burry owns FB. Also owns OVV", "score": 2, "replies": [{"body": "Yes. I own FB too. Would buy AAPL around 90. If it doesn't drop there then I'll just buy something else .", "score": 1, "replies": [{"body": "I'd buy AAPL at 120 easy. But only a few shares. Average down slowly.", "score": 2, "replies": [{"body": "Nothing wrong with that! At least you didn't buy at 180 or whatever the top was.", "score": 1, "replies": [{"body": "I have 2 shares AAPL at 103, but I sold 25 at 165.", "score": 2, "replies": []}]}]}, {"body": "Check out PANW UNH ENPH COST\n\nAlso VLO DVN ET", "score": 2, "replies": []}]}]}]}, {"body": "If MSFT AAPL and GOOGL drop a further 50%. I'll double up each position on margin.", "score": 1, "replies": []}, {"body": "Can I envision it? Yes. Apple is overvalued currently. It can not only revert to the fair value, but also downshoot. Will it happen? Who knows. I don't buy Apple directly but it's pretty much unavoidable in index funds.", "score": 1, "replies": []}, {"body": "Literally this sub is cracking me up lmfao", "score": 1, "replies": []}, {"body": "All it takes is a major bankruptcy or another world catalyst and yes.", "score": 1, "replies": []}, {"body": "50% from here or around 70% total.. No, i don’t want to belive that we are heading into the greatest crash since 2000. Chances for this are also slim, but unfortunately it is possible.", "score": 1, "replies": [{"body": "50% down from here.\n\nI think we will be at sp500 3000 within a few months.", "score": 1, "replies": []}]}, {"body": "Apple maybe because they're overly reliant on iPhone sales and politics could crush that and half of the world's mobile gaming revenue.  Google and especially Microsoft less so since most of their money comes from software that isn't going to be impacted by supply chain problems and also isn't overly exposed to any single country. Amazon is probably going to get hit hard in the next few years but they'll find a way to recover.", "score": 1, "replies": []}, {"body": "And more than 50%. Easily.", "score": 1, "replies": []}, {"body": "Here’s a general feature of all stocks; the lowest they can possibly go is zero. \n\nFor MSFT and AAPL that risk is indefinitely small (especially considering they both hold lots of cash!). That they’ll slide 50 % from here also seems improbable but not impossible. I’d buy both if they get anywhere near those levels.", "score": 1, "replies": []}]}
{"title": "peanut prices haven't significantly dipped yet = no recession", "selftext": "While I appreciate canned dry beans, I prefer a basement full of peanut butter to prepare for the zombie apocalypse. Got me thinking, so decided to look into peanut butter futures and then peanut futures before discovering a little know fact I just made up. \n\n[PPI for Farm Products: Peanuts \\(approx. 1970-present\\)](https://preview.redd.it/0dz8brjpov091.png?width=1177&format=png&auto=webp&s=6f40d383f3d759c10ebc95892e91a8bc26c111b9)\n\nEvery recession since approx. 1985 has been preceded by a significant drop in peanut prices. The March 2020 recession was preceded by a sharp drop in 2019. Since then there's been no significant drop in peanut prices, so no future recession can confidently be called.", "id": "uutyt7", "created_utc": 1653160706.0, "score": 151, "upvote_ratio": 0.88, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|217|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=uutyt7)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=uutyt7)", "score": 1, "replies": []}, {"body": "This is nuts!", "score": 113, "replies": [{"body": "Did you know that peanuts are not actually nuts but legumes? Not that it matters, no nuts or legumes is stopping this recession.", "score": 24, "replies": [{"body": "This is legumes!", "score": 9, "replies": []}, {"body": "I do now!", "score": 3, "replies": [{"body": "Got learned", "score": 1, "replies": [{"body": "I love to learn. It’s the one thing I always need.", "score": 1, "replies": []}]}]}, {"body": "No nuts or legumes were harmed in the making of this post……………………..👀 *crunch*", "score": 2, "replies": []}, {"body": "r/pealegumes\n\nThere's a sub for that", "score": 4, "replies": [{"body": "The subreddit r/pealegumes does not exist.\n\nDid you mean?:\n\n* r/league (subscribers: 4,776)\n* r/pedale (subscribers: 7,920)\n\nConsider [**creating a new subreddit** r/pealegumes](/subreddits/create?name=pealegumes).\n\n---\n^(🤖 this comment was written by a bot. beep boop 🤖)\n\n^(feel welcome to respond 'Bad bot'/'Good bot', it's useful feedback.)\n^[github](https://github.com/Toldry/RedditAutoCrosspostBot) ^| ^[Rank](https://botranks.com?bot=sub_doesnt_exist_bot)", "score": 2, "replies": [{"body": "Ughh good bot. You ruined my trap though", "score": 3, "replies": [{"body": "Good human.", "score": 2, "replies": [{"body": "You don't fool me, imposter!\n\nGood bot? Just in case", "score": 3, "replies": []}]}]}]}]}, {"body": "The peanuts haven't capitulated yet", "score": 1, "replies": []}]}, {"body": "Best caption", "score": 3, "replies": []}, {"body": "I dunno what OP is talking about...  \nI've been lowering my nuts in his girl for over a year now.", "score": 0, "replies": [{"body": "So you're the one...", "score": 1, "replies": [{"body": "I swear its not mine.... and if it is just tell them I went looking for formula.", "score": 1, "replies": []}]}]}]}, {"body": "You know how there’s like a global supply chain problem, a war in Ukraine, and not-super-great-trade relations with China? Commodities, ESP food, are becoming extremely scarce. Low supply, high demand - commodities are BY FAR the best hedge against economic downturn right now, and the best way to take advantage of inflation.", "score": 22, "replies": []}, {"body": "Well, I only use the James Cameron’s Avatar movie series index.  The economy always crashes right before he releases a new Avatar movie", "score": 9, "replies": [{"body": "The real dd is always in the comments ![img](emote|t5_2th52|12787)", "score": 4, "replies": []}, {"body": "isn’t that within, like, the next year?", "score": 3, "replies": [{"body": "December this year. So economy goes in the toilet by September", "score": 2, "replies": []}]}]}, {"body": "Agriculture usually feels a recession first. That is what my parents always told me.", "score": 7, "replies": [{"body": "While this post is making fun of all of these idiots trying to justify their beliefs on the market, your comment is actually very correct.", "score": 3, "replies": []}]}, {"body": "Not gana lie. Pennutbutter prices are outrageous compared to a couple years ago but I still keep paying.", "score": 7, "replies": []}, {"body": "As a peanut farmer I hate to tell you but peanuts are contracted. Meaning the only way to plant them is under contract and the price mostly based on last years crop not how much peanut butter was sold. Have a bumper crop one year and peanut contracts are hard to come by the next year. Have a significant drought such as 2011 and peanut contracts go higher. Also with other commodities such as corn or cotton higher contracts will increase to insure enough peanuts are planted to meet demand. Just my two cents", "score": 7, "replies": []}, {"body": "Aww man I was hoping for recession tent cities are fun when they are overpopulated.", "score": 5, "replies": []}, {"body": "The majority of the peanuts grown within a hundred mile radius of my house! You can’t invest based off this chart. The technology and equipment used to farm peanuts changed drastically over the years. A couple years ago they stopped using the small wagons and pickup trucks to haul peanuts. Now they take diesel trucks and trailers directly into the field. Everything is bigger.", "score": 6, "replies": []}, {"body": "Jif recall for salmonella, bullish on peanuts", "score": 4, "replies": []}, {"body": "Seems legit", "score": 9, "replies": []}, {"body": "Coronavirus downturn was completely unexpected, the 2019 peanut price can hardly be representative of the future", "score": 8, "replies": [{"body": "That's what Big Peanut wants us to think.", "score": 11, "replies": [{"body": "🥜 the peanut overlords have spoken", "score": 6, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "This is the 2020 crash just 2 years behind.", "score": 4, "replies": []}, {"body": "Chinese takeout restaurants are the biggest source of demand for peanut products by far.  As far as delivery goes, Chinese takeout is an inferior good that if people stop buying, it's because belts are really tightening. Chinese delivery shops have tiny margins so peanuts are the first thing to go when demand drops.  It's the perfect proxy for middle class spending.", "score": 4, "replies": []}, {"body": "Milk dropped a lot at Walmart.  Last week = 3.75 per gal, today 3.3.", "score": 4, "replies": []}, {"body": "Remember when you took statistics in high school and they taught you correlation and causation?", "score": 11, "replies": [{"body": "You think we went to high school?", "score": 14, "replies": []}, {"body": "They taught us stats in high school? Shit, must have been replaced for the standardized testing....", "score": 7, "replies": []}, {"body": "Remember when you browsed WSB and you didn’t see a joke or someone say something completely moronic?", "score": 0, "replies": [{"body": "No", "score": 8, "replies": []}]}, {"body": "Woosh", "score": 0, "replies": []}]}, {"body": "Pay peanuts, get Monkey Pox.", "score": 3, "replies": []}, {"body": "Peanut prices have actually gone up where im at. Bullish.", "score": 3, "replies": []}, {"body": "You may want to check this out.  \n\n\nhttps://www.reddit.com/r/collapse/comments/uuwpa9/jiffy_recall_not_sure_how_bad_but_we_have_thrown/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 3, "replies": []}, {"body": "Best DD of all time", "score": 3, "replies": []}, {"body": "There is a recall on peanut butter this very afternoon, really, look it up.", "score": 3, "replies": []}, {"body": "Mr. Peanut would like to know your location", "score": 3, "replies": []}, {"body": "Spoke to soon, Jif just recalled a bunch of peanut butter.", "score": 3, "replies": []}, {"body": "Watch out for the Jif recall.", "score": 3, "replies": []}, {"body": "I hope you aren’t stockpiling Jiff. There’s a recall.", "score": 3, "replies": []}, {"body": "Peanut allergies weren't a thing really up until maybe 10-15 years ago. I don't believe it's as popular as a food for younger kids as it once was. Adults generally don't eat peanut butter and jelly. And I believe peanut butter is the largest consumption of peanut", "score": 3, "replies": []}, {"body": "moles ate all the peanut seeds in my garden.", "score": 5, "replies": []}, {"body": "It’s when penis prices go down due to oversupply that you are close to the bottom.", "score": 2, "replies": []}, {"body": "I’m allergic", "score": 2, "replies": []}, {"body": "I want to know why no one is talking about the lipstick indicator?", "score": 2, "replies": []}, {"body": "yes comparing the market to nuts. i like your trading strategy.", "score": 2, "replies": []}, {"body": "Ironically China is the largest grower of peanuts in the world, then India who just banned food exports. USA only produces 2 percent of the worlds peanuts. Maybe time to buy peanuts", "score": 2, "replies": []}, {"body": "His logic checks out", "score": 2, "replies": []}, {"body": "Deez nutz", "score": 2, "replies": []}, {"body": "I’m about to dip my nuts on my wife’s boyfriends girlfriends chin", "score": 2, "replies": []}, {"body": "Living in GA, I have to say...peanuts are a good investment.  Jimmy Carter approves!", "score": 2, "replies": []}, {"body": "all 4 (or 5 idr) recessions since 1985? lol", "score": 2, "replies": []}, {"body": "There is no signal in the noise of that chart.", "score": 2, "replies": []}, {"body": "Oh thank god so this is the bottom then ......", "score": 2, "replies": []}, {"body": "Legumes aren’t real!", "score": 2, "replies": []}, {"body": "So I should buy pPlanters? I'm confused.", "score": 2, "replies": []}, {"body": "Ill have my recession crunchy please.", "score": 1, "replies": []}, {"body": "Jif announced a recall nationwide on peanut butter batch number ending 425 \n\nPeanuts going down", "score": 1, "replies": []}]}
