{"title": "Finally we have a strong recession signal boys...", "selftext": "", "id": "dpr7go", "created_utc": 1572544489.0, "score": 103, "upvote_ratio": 0.93, "num_comments": 68, "comments": [{"body": "Last time we had a recession, I had a penis.\n\nI checked today and I have a penis. Recessions IS COMING MY DUDES.", "score": 61, "replies": [{"body": "That was a rollercoaster of expectations.", "score": 34, "replies": [{"body": "Just doing my jerb. Professional Recessionist with a penis", "score": 11, "replies": []}]}]}, {"body": "255p here I come", "score": 29, "replies": [{"body": "Nov 8, or should we be thinking long term like December or something?", "score": 27, "replies": [{"body": "6k vol on the December expiration. I think my target is actually going to be around 278 though. 255 is just a meme.", "score": 8, "replies": []}, {"body": "Just bought nov 8 amd $32 puts at .17 a pop...couldn’t resist", "score": 3, "replies": []}, {"body": "Mid 2020..", "score": 2, "replies": []}]}]}, {"body": "Looks like a good time to buy puts then..", "score": 21, "replies": []}, {"body": "[deleted]", "score": 42, "replies": [{"body": "He doesn’t have kids. If you’re a retard like me you would’ve read his book (which was published around 2005-06, while he was on top of the fucking world).", "score": 5, "replies": []}]}, {"body": "This guy is the personification of everything that went wrong with America after the Cold War. Smug, complacent, dumb.", "score": 103, "replies": [{"body": "[deleted]", "score": 95, "replies": [{"body": "Alan Greenspan was born in 1926", "score": 20, "replies": []}, {"body": "I fucking hate boomers", "score": 55, "replies": [{"body": "[deleted]", "score": 61, "replies": [{"body": "Didn’t stand for shit, fucked the world for everyone else, don’t have anything to show for it", "score": 49, "replies": [{"body": "Good news! They will all be dead soon and we get to inherit whatever crumbs they didn't shove into their bloated old bodies.", "score": 22, "replies": []}, {"body": "Fuck boomers", "score": 25, "replies": [{"body": "And they resented their parents, and told them to fuck off with their values. Imagine saying that shit to literally the people who stormed Omaha.\n\n\"I don't care that you bayoneted Hitler DAAAD! I'm going to the Beatles concert, stop telling me how to live my life! Ugh!'\n\nBoomers, the true millennials.", "score": 59, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "The most self absorbed generation in human history? \n\nNaw dawg they gonna put that in safety deposit boxes and GIC's for they grandkiddies to go to school wit. /s", "score": 3, "replies": []}]}]}]}, {"body": "And they think everyone else is to blame. Fuck them.", "score": 6, "replies": []}]}]}, {"body": " There are only two things I can't stand in this world: People who are intolerant of other people's cultures, and the Dutch", "score": 5, "replies": []}, {"body": "OK Boomer", "score": 8, "replies": []}, {"body": "When can we start a market on Boomer scalps? I'll start the bidding at 500 shares of AAAU", "score": 5, "replies": []}]}, {"body": "No, I don't stand for that shit either. Our kids will be bitching about us in similar terms, come 2050.", "score": 6, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Gen X is solid. Good people.", "score": 5, "replies": []}, {"body": "Lmao yep.\n\nAll the millennials bitching about boomers right now, will be the boomers who bitch about Gen Whatever in AD 2050.\n\nI know people who unironically think that oldies should die for progress. Not sure if they realize their own parents are those oldies.", "score": 1, "replies": []}]}]}, {"body": "You meant another group of (((people)))", "score": 4, "replies": [{"body": "Juice", "score": 4, "replies": []}]}]}, {"body": "Seriously.  I blame him and Paul Volker for the mess were in.....", "score": 1, "replies": [{"body": "Why Volcker lmao", "score": 3, "replies": []}]}]}, {"body": "Greenspan is a 93 year old turd.  Here is a fun snippet from his House testimony in 2008 regarding the financial crisis:\n\n>Greenspan, 82, acknowledged under questioning that he had made a “mistake” in believing that banks, operating in their own self-interest, would do what was necessary to protect their shareholders and institutions. Greenspan called that “a flaw in the model ... that defines how the world works.”\n\nHe failed to realize that businesses would do anything to make money for share holders for their next quarterly earnings, even if it ruins the long term picture.  Gee, how could he have missed that... everything a business does is to maximize profits and short term gain.  It's how the system is set up.  It's why we go balls deep in FDs before an earnings call.\n\nJust like in 2008, the fundamentals of this economy are different than they were when he began his reign at the fed in the late 80's.  During his tenure, we did not have near 0% interest rates with low inflation.  We also didn't have other stable countries with negative interest rates.  Consumption and growth may be OK right now, but something is rotten in the bond markets.  He fails to even mention that... ok boomer.", "score": 39, "replies": [{"body": "You are also forgetting that a lot of these institutions were required by law to provide these mortgages. It was part of the basket of 'progressive' measures to make loans more accessible, particularly to vulnerable communities. Greed just exploited the loosened rules on loans. Most people forget about that regarding the financial crisis.", "score": 17, "replies": [{"body": "Yup, I believe it was both Bill Clinton and George Bush who really headed this effort to push home-ownership to all social classes. It's a good idea in theory, but when it is forced down the throats of impoverished citizens by greedy lenders and salesmen, 2008 is what you get.", "score": 16, "replies": []}, {"body": "Definitely agree.  I didn't understand this fully until 2015 when I bought my house, but then it dawned on me, why don't more people know about government backed mortgages via these banks?  It is insane to me that Random Bank makes the loan, then immediately sells it off to Fannie / Freddie.  It's literal tax payer subsidization of the housing market.  People get outraged all the time about Section 8 housing, and how people who are in Section 8 housing are \"lazy\", but these same people don't realize that their house's mortgage is in a mortgage backed security owned by the government.  That suburban McMansion that no one wants anymore (and is some boomers retirement plan) is being subsidized by the government as well. A lot of people ended up in houses they should have never been able to afford, and clearly they couldn't when the whole thing collapsed in 2007.\n\nIf America ever ended the subsidization of the housing market via Fannie / Freddie, I wonder if we would still be the \"land of home-ownership\".", "score": 10, "replies": [{"body": "wait till you figure out that the mortgage interest deduction you take on your income taxes is also a massive subsidie that only homeowners benefit from.", "score": 4, "replies": []}]}, {"body": "Yeah, you don’t need unions for the workingman if anyone can get a loan. It’s a win-win situation for those fuckers.", "score": 4, "replies": [{"body": "Interesting take on it. Ever read 'Player Piano'?", "score": 1, "replies": []}]}]}, {"body": "An he subscribed heavily to capitalist and libertarian ideals. What does that tell us?\n\nNeither of those ideologies really recognizes how selfishness really works... despite Ayn Rand’s prostestations and books to the contrary", "score": 5, "replies": []}, {"body": "That guys 93?  He looks pretty darn good for a 93 year old.", "score": 3, "replies": []}, {"body": "Debt is a cash creation piñata and \"the market\" are three hundred 13 year old boys hyped up on sugar and testosterone squeezed into a barrio housing backyard all swinging for the same thing at the same time.  Responsible adults simply do not wade into that melee hoping to achieve anything other than a black eye and a chipped tooth.\n\nThe only thing the FedResInk really does is control the height of the piñata and the number of bats available to the market.", "score": 1, "replies": []}]}, {"body": "Isn’t corporate debt at record highs?", "score": 12, "replies": [{"body": "You mean it’s not free money?", "score": 6, "replies": [{"body": "Yea it’s honestly crazy, like I’m reading this article, “businesses are not over-leveraged,” and I think JPowell was saying something like this the other day as well. So I looked it up, and corporate debt levels are at record highs, according to the sources I viewed. So is Greenspan just flat-out lying here, or what’s going on?", "score": 5, "replies": [{"body": "They’re not lying they think corporation should spend more and obviously their hope is to kill all that debt pissing it away with printing and low inflation. They think like this because they assume qe and low yields will always hold. I think this lead to a liquify trap where everyone is hoarding cash/assets: 1) the creditor don’t want the low yield they’d rather invest 2) most borrowers realize the risk on yield so they limit their margin & hold assets... so assets go higher and everyone holding cash, leveraged assets and waiting for yields. \n\nFed & Economists are just been dumbasses with their model of lower rate will have everyone taking money out to spend and they’re left wondering why no one borrow/loan", "score": 2, "replies": []}]}, {"body": "You mean I have to pay it back? When? Never...ok", "score": 2, "replies": []}]}]}, {"body": "\"nO rEcEsSiOn In ThE LaST HaLf CeNtUrY bEgAn FrOm a PeRiOd oF DeLeveRaGinG\" \n\nOk ok ok but hear me out..... \n\nrecessions are starting from bubbles now, not pullback. From the dotCom Boom to now, every recession has big fuckin smarty boys like this going \"ItS JuSt NoT PosSiBle\" as the Titanic sinks behind them.", "score": 18, "replies": [{"body": "Shit even before then. Portfolio insurance was also in some ways kind of a bubble. It caused so much shit because it ended up being used by damn near every money manager.", "score": 9, "replies": []}, {"body": "I also don't believe this sentiment on either count. Every recession is ultimately a story of deleveraging. Are we to argue about the word \"began?\" Does he mean unemployment is low and PE's are high, so somehow deleveraging must follow something? The timing of deleveraging doesn't have anything to do with the total resulting economic contraction... ??? am I retarded, or him?", "score": 2, "replies": [{"body": "Them’s a lot of 5 dollar words and I just spent my last 500k on SPY puts", "score": 3, "replies": []}]}]}, {"body": "Lol it had to be today hahahahga. Former chair indicator", "score": 6, "replies": []}, {"body": "Everything that man says is a meme", "score": 5, "replies": []}, {"body": "What the fuck is he talking about? What exactly is de-leveraging now, except the oil industry? Does he even use FRED?", "score": 5, "replies": []}, {"body": "I thought creamer was the signal", "score": 3, "replies": [{"body": "Who creamed you? I'm interested, not for financial reasons.", "score": 9, "replies": []}, {"body": "He is the big daddy of Cramer", "score": 1, "replies": []}]}, {"body": "He's wearing lipstick isnt he.", "score": 3, "replies": [{"body": "Dude is in his 90s still hustling on the street, now that's a good hard working man", "score": 7, "replies": []}]}, {"body": "Thread title delivers", "score": 2, "replies": []}, {"body": "Capital to operating ratio is up for capital spend but Business Investment is down?  Something tells me there's some fudge in the data", "score": 2, "replies": []}, {"body": "When greenspan dies, he'd better get cremated, because there's going to be a line of people waiting to piss and shit on his grave if they put him in the ground.", "score": 2, "replies": []}, {"body": "Inversing Greenspan is probably a more secure way to make money than even inversing WSB,.", "score": 2, "replies": []}, {"body": "Ok boomer", "score": 2, "replies": [{"body": "Ok Boomer.", "score": 1, "replies": []}]}, {"body": "as if that will change trajectory", "score": 1, "replies": []}, {"body": "Bro he’s making up words", "score": 1, "replies": []}, {"body": "Oh fuck. You guys are hilarious.", "score": 1, "replies": []}, {"body": "STRONG RECESSION SIGNAL \n\n\\*\\**market hits ATH\\*\\**", "score": 1, "replies": []}, {"body": "Ok, Boomer.", "score": 1, "replies": []}]}
