{"title": "My journey after discovering WSB 1 year ago - Thank you.", "selftext": "[deleted]", "id": "dnmnf1", "created_utc": 1572138437.0, "score": 404, "upvote_ratio": 0.96, "num_comments": 72, "comments": [{"body": "Onward, autistic soldier!", "score": 178, "replies": [{"body": "Thank you brethren.", "score": 47, "replies": [{"body": "People new to this subreddit are going to get the dumbest fuckin lesson on what to expect here", "score": 13, "replies": []}]}]}, {"body": "Just buy some more money, dillweed", "score": 73, "replies": []}, {"body": "Green mode looks so much better than red mode", "score": 36, "replies": [{"body": "Sicko mode", "score": 5, "replies": []}]}, {"body": ">Joined about a year or so, a year after I graduated college.\n\n&#x200B;\n\n>I immediately lost 40k on china stocks weeklys\n\nSo what you're saying is there was leverage involved? If so update story to reflect your ~~retarded~~ autistic bio. Otherwise ask your parents for a small million dollar loan, to max out gains.", "score": 66, "replies": [{"body": "Or you know, start a business or invest in a mutual bond but nooooo just gamble on weeklies lol love this sub", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "See, what you do is, you get a 1% interest loan to invest in cre and instead dump it into spy weeklies", "score": 2, "replies": []}, {"body": "Lol where in the US does re return 2% a year? Mobile, Alabama?", "score": 2, "replies": []}]}]}]}, {"body": "Yeah.. i usually buy shares of something immediately after money goes into my account to protect myself against buying weeklies.... fucking dangerous.", "score": 15, "replies": [{"body": "Thinking about transferring most out of Robinhood and leaving it with only a set amount of money for plays, that'd be the dream", "score": 6, "replies": [{"body": "And putting it where else to earn you income exactly? If you're not making money you're losing money..", "score": 2, "replies": [{"body": "Just transferring my stocks to a real brokerage ;]", "score": 5, "replies": [{"body": "Just buy gold. That should be making a comeback soon. Worthless, worthless gold every 20 years.", "score": 2, "replies": []}, {"body": "Oh ok i thought you meant putting cash on the sidelines waiting for whatever..", "score": 1, "replies": [{"body": "Nah lol just transferring my core long term stock holdings (Tesla nvda jd amzn). I'd actually be up maybe 5% if I didn't sell a covered call before earnings, learned a lesson there", "score": 1, "replies": [{"body": "M1 Finance.  Put all your stocks in a basket and buy the basket automatically.  All free.", "score": 2, "replies": []}, {"body": "Yeah covered calls aren't that great.. great in a flat market maybe, but it's October.. don't sell calls, buy calls.", "score": 1, "replies": []}, {"body": "Just transfer everything to a real paid broker", "score": 1, "replies": []}]}]}]}, {"body": "If you're not losing money, you're not losing money", "score": 1, "replies": []}]}]}, {"body": "That’s why I have two accounts; one for stocks investments (no options approval), the other account has options approval. Prevents me from dumping my savings into retarded shit like weeklies", "score": 2, "replies": []}]}, {"body": "My mom says you’re gonna grow up to be strong big boy", "score": 7, "replies": []}, {"body": "It's all about luck.  Dumb luck leads to bad luck and vice-a-versa.\n\nI found options last August.  Went up, then down to a fraction of my original balance, then rallied up to 4x that original balance, and now fighting weekly battles between 2x and 3x...", "score": 18, "replies": [{"body": "Litterally started last week. Made one good Uber put. Then made one good KO call and thought I was a God. So far breaking even, (PCG is going to f me raw like F did). I put a small, small amount in to see what I could do. But the lose vs gain swings are both stressful. This may not be for me.", "score": 5, "replies": [{"body": "A knock out call? Which trader do you use? I've been looking for one with barrier options.", "score": 1, "replies": [{"body": "Coca-Cola, Robinhood. If you find one let me know. The only trades you can make in RH that I know of are within bid and ask.", "score": 1, "replies": []}]}]}]}, {"body": "Where’s your current balance? You’re saying that pic is when you were down bigly right?", "score": 5, "replies": [{"body": "Scroll down there's two pictures lol", "score": 2, "replies": [{"body": "I figured it out 😤😤", "score": 1, "replies": [{"body": "Just came up with the logical idea to update the picture into a single one with both screenshots. Conquered my autism there for a few.", "score": 6, "replies": []}]}]}]}, {"body": "Good shit brother", "score": 5, "replies": []}, {"body": "So your break even now?", "score": 3, "replies": [{"body": "? I'm up 0.17%. not sure what you mean.", "score": 28, "replies": [{"body": "That Ally Bank yield looks PHAT AF in hindsight", "score": 18, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It only shows one of the pics on mobile idk why. click on the link in the post you'll see it. I prob shoulda posted two separate pics", "score": 1, "replies": [{"body": "Holy shit you got banned fast wtf. LOL", "score": 1, "replies": []}]}]}]}]}, {"body": "FUCK YEAH \n\nnow get some escorts and hookers dude so u can think straight", "score": 3, "replies": []}, {"body": "I too have plnt calls into Nov 15 and Jan 17. Holy hell did it drop though.", "score": 2, "replies": [{"body": "i have exactly the same positions, lol been doubling down but shit isnt recovering with the mkt. hopefully it picks up when we hit ATHs", "score": 3, "replies": [{"body": "That's actually hilarious. If there is a quick sell off I'm likely going to buy a few hundred shares. Odd how it's remained basically flat for 2 weeks now.\n\nWith it's track record I don't see why it wouldn't climb back in the near/medium term.", "score": 1, "replies": [{"body": "My recovery started with PLNT stock, it used to be so predictable. Haven't touched it for a month now.", "score": 1, "replies": []}]}, {"body": "Aaaaand here we go", "score": 1, "replies": []}]}]}, {"body": "Just put half your deposits into VOO or VIG or whatever the fuck and put the other half into stuff that gets you to 150 BPM and gives you a half chub. Best of luck in your future endeavours with us in WSB", "score": 2, "replies": []}, {"body": "Posts like these, Cialis, vodka and cocaine make life worth it!", "score": 2, "replies": []}, {"body": "I can make you a millionaire with AMD options this week", "score": 2, "replies": []}, {"body": "This sadly looks like my chart too. One of us", "score": 1, "replies": []}, {"body": "Never mind. I found/saw it! Nice! 💕💕", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Gains offset losses, still need to account for my wash sales though. They're all over the place and Robinhood tax files are like a maze", "score": 2, "replies": []}]}, {"body": "One of us!!", "score": 1, "replies": [{"body": "Thanks brother.", "score": 2, "replies": []}]}, {"body": "Woohoo!", "score": 1, "replies": [{"body": "woOHoOooO for no gains in 2 years!", "score": 4, "replies": [{"body": "Ehh I would take sideways, as sideways is all my portfolio ever did since my main holding is Ford, and Mr. Market fucking hates it.  Thank you for this post, as I finally dipped my toes into options at the end of August and have now torched about $30K.  A lot of very expensive lessons. 🥶", "score": 3, "replies": [{"body": "Ford wtf!? Put it into Tesla or amazon and thank me in a few years.. maybe not Tesla because it already ran up 40% but now is a great time for amzn imo", "score": 1, "replies": [{"body": "Amazon is going to lag. Most companies are doing daily deliveries now. Find a small upstart commercial delivery service and invest in that. I mean if I can get Doritos in an hour instead of a day....I mean come'on.\n\nFord killed me but ER will be higher than GM and there is the Mustang CUV on 11/17...so if you are long I'd hold.", "score": 3, "replies": [{"body": "Who’s servers do you think those other companies use?  Amazon is making money on both ends.", "score": 1, "replies": [{"body": "AWS was a buzzword. There are soo many providers that provide the same service. Anyone one with any coding or Office experience \"could\" make better/more personal interfaces. Contract coding will go up in value once it is realized they don't have to pay overhead. Once people understand that they are not proprietary owners and could make millions of the items they develop, they will walk...in maybe 2025. Servers are a minor investment once large capital is realised.", "score": 1, "replies": [{"body": "[Okay boss](https://www.forbes.com/sites/andriacheng/2019/07/14/amazon-and-rival-retailers-are-much-tighter-than-you-think/#1a260da73265)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What?! Thought I saw gains in the hundred thousands!", "score": 1, "replies": [{"body": "Look again closely", "score": 1, "replies": []}]}]}]}, {"body": "You forgot to put the green one on the left.", "score": 1, "replies": []}, {"body": "Thanks sir for inspiration me", "score": 1, "replies": []}, {"body": "Great job!", "score": 1, "replies": []}, {"body": "Holy shit. Your phone lost 33% battery because of us?", "score": 1, "replies": []}, {"body": "So you started out being smarter than 99% of the people here and then got dragged down to their level. Nice.", "score": 1, "replies": []}, {"body": "Hey mind if i message you? I just started dabbling in options. Read on it a few months ago, still somewhat small minded on them. I'm also on RH 😀", "score": 1, "replies": [{"body": "Don't do it man. All I can say lol. Buying stocks is the way to go, trust me on this. Look for bargains and hold and sleep well", "score": 10, "replies": []}, {"body": "Options=gamble \n\n\nstock=less gamble \n\n\nTrying to figure either out=impossible", "score": 3, "replies": [{"body": "Not impossible, just difficult.  And patience.", "score": 1, "replies": []}]}]}]}
