{"title": "Netflix (NFLX) tanks after cutting subscriber forecasts", "selftext": "", "id": "kghpj", "created_utc": 1316094028.0, "score": 17, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "I'm not really bullish or bearish on it but I would stay away because I think it could drop as fast as it went up. Plus it has a lot of competitors coming into its space.", "score": 2, "replies": []}, {"body": "Seems an overreaction to me, especially since roughly 12 million subscribers are now paying 60% more.  Good buying opportunity or is the beginning of the end as more competitors catch up?", "score": 1, "replies": [{"body": "I'd bet they make a recovery. They still have many advantages over their competitors.", "score": 1, "replies": [{"body": "I completely agree, but many would argue that Netflix and most tech-stocks in general, are in a bubble. This could be in part, a natural re-adjusting period. Although I'd argue that NFLX is still pretty overvalued at 43.26 P/E; it will probably be back up to 220 in the next 4-8 months. However, I'd still stay away from it.", "score": 1, "replies": [{"body": "Well, if Netflix is completely rigid and doesn't respond to the market and their competitors, then they will eventually lose their edge, just like any company in any business would.\n\nBut they have so many natural advantages built into being the first ones to figure out how to do quality video renting / streaming on such a wide scale the way they have. Of course they have other real competitors trying to snag that revenue away from them, but I think that they have enough of an edge that they'll rebound from this pretty well.", "score": 1, "replies": []}, {"body": "I will say however, that netflix does something that simply no one else is doing right now, sure hulu has the subscription based model, but there are commercials and a limited content library as well.  I think this is the reason for the high price, because of the lack of competition in that realm, netflix really is the only one doing what they're doing, and no one else comes close to affordability of the content.", "score": 1, "replies": []}]}]}, {"body": "I cancelled my streaming subscription with the price increase...  I have Uverse and can barely watch enough stuff I record on that.  But I am merely one consumer (with two young kids).", "score": 1, "replies": []}, {"body": "It was an over reaction when people bought into it as well though.  It needed to go up at the time but it kinda went crazy.", "score": 1, "replies": []}]}, {"body": "I personally think it is an entry point, however, I also see more risk in this name.  I personally think Coinstar is a better risk/reward play currently with their growth in RedBox.", "score": 1, "replies": []}, {"body": "I love NFLX, but I don't love the stock.   They are the first real entry into the streaming business, but I'm not convinced that they have the staying power.  They don't have a huge content library or infrastructure or dominant device.\n\nWe could see a long slow slide with NFLX.\n\nSony, Fox, WB, Universal, etc., could all pose huge threats with their content libraries.\n\n", "score": 1, "replies": []}]}
