{"title": "Navigating the stock market. What are your plans?", "selftext": "With such a fast decline and recovery. I can see another big drop coming in the next half year once things start to reopen and alot of businesses potentially going bankrupt. In a perfect world everything goes back to normal But I don't think this would happen so easily. Eventually we will go back to normal but nobody knows when that would be.\n\nCurious to hear everyone's plans and strategy moving forward. Are you liquidating your stocks? Loading up on cash? Buying? Or holding?", "id": "gjjabm", "created_utc": 1589449774.0, "score": 27, "upvote_ratio": 0.89, "num_comments": 58, "comments": [{"body": "Keep putting the same amount in every week. Ride the wave. \n\nMight put in more as it starts dropping tho.\n\nMostly all VOO, VOOG.", "score": 25, "replies": [{"body": "how do you decide between voo and voog? What's the reason for your split. Just curious.", "score": 1, "replies": [{"body": "Well I started with VOO but then with the drop I started going VOOG. Rly depends. VOOG seems better for the current situation. \n\nIt’s prolly split 90-10 VOOG VOO right now.", "score": 1, "replies": []}]}, {"body": "This is so dumb lol. Put in more money into something that’s losing value??? Post some screenshots of your gains and let’s see how much this advice is worth. \n\nEveryone who I respect from an investment standpoint including people like Buffet and Cuban (4 others I follow) are all going into heavy cash positions. Right now is not a time for risk averse Investor’s to be in the market, especially when the tumble down seems so imminent. \n\nI would say if you really want to ride the volatility then you need to get into shorts as well as longs. Learn things like SQQQ and GOLD that generally behave inverse to the market. Read the news obsessively and be prepared to act fast on good or bad news of corona. \n\nI’m about 30% cash, and 60% tech. Shorted Tesla twice for profit and rode it back up. Bet earnings on Lyft and PayPal made some money. The only stock I plan on holding long term is Google which I bought at the dip and if I hadn’t sold amazon too soon like an idiot I would hold that too. Everything else you gotta be on your toes, nothing is safe. \n\nAlso if you’re a doomsday once in a decade depression thinker, bitcoin. I bought $1000k cuz fuck it, if everything goes belly up I could 10x, and if not it’s generally come back up from its valleys that’s not a huge amount to sweat over", "score": -15, "replies": [{"body": "This guy wrote a whole essay to tell us he doesn’t understand averaging down your positions to the bottom to mitigate risk/mistimed entry", "score": 18, "replies": [{"body": "Right. Like you can time the market. I’ve tried and I failed so I gave up. If he thinks he can go ahead. I remember everyone saying it has to go down further and it just kept rebounding. \n\nCan’t miss time it if you always putting it in.", "score": 1, "replies": []}, {"body": "Lol I absolutely do understand that I don’t catch a falling knife. Buy on the way up from the bottom you lose a lot of risk you’d otherwise get riding it down. PM me your returns I’ll send you a screenshot of my entire 2018/2019 trades. A lotta people here say shit with no backup", "score": 1, "replies": [{"body": "1. It’s not catching a falling knife, it’s averaging down, totally different concept. It’s about constantly lowering your price per share, bc you’ll never time the bottom right. Saying “just buy the bottom” is how investors get ripped apart in these markets. You won’t time the bottom, you’ll buy a false bottom or a bull trap and get eaten. Averaging down is a better solution to this problem than just pretending you’re some guru who knows how to time it. \n\n2. “Buy it up, not down” is the dumbest thing you said of all. Do you think when it recovers we stop buying? You average to the bottom, you’re avg price per share drops significantly, and then you buy up. I shouldn’t have to explain this to you. \n\n3. 2018/2019 returns aren’t important if you’re playing a long term game, AT ALL. If you would like to track me down in 30 years I’ll show you where I’m at then", "score": 1, "replies": [{"body": "Point #2, you wouldn't ride an elevator to the lobby if you were trying to go up. Same with stocks. It doesn't seem like you do any technical analysis before buying and are probably giving up 10+ percent or more just 'averaging down'. \n\nLOL to anyone who thinks two years of returns don't matter at all if you're investing long. You'd be fired instantly as any fund manager. You think the people who do this professionally don't care about long term investments? \n\nI'm very familiar with averaging down. If you wanna keep playing a noobs game and say \"buy it low, sell it high...market always goes up long term!\" set a reminder to reply to this comment end of 2020. The difference between what you're doing and what people who don't give up all their gains are doing is not riding a stock down as its tumbling. No one can time the bottom perfect, but you can at least wait for it to be trending in the right direction (and I'm not saying that means  for a day or two). \n\nAll I can say is good luck buying all the stocks on discount now! Please do let me know how it works out for you just don't quit your day job!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Another drop coming soon. Wait it out. Stocks are too over valued right now.", "score": 12, "replies": [{"body": "This is what most people think. Hint hint. Warren Buffet have the best advice of his career when he said, “Be greedy when others are fearful and fearful when others are greedy.”", "score": 9, "replies": [{"body": "Actually, what Buffett (not Buffet) said was a little different.  He said he recommended you don't attempt to time the market.  But if you couldn't resist timing the market, to be greedy when others are fearful etc.  You can probably run down the quote.", "score": 3, "replies": [{"body": "It's tough rn because it feels like half the people are being greedy and half are being fearful lol", "score": 6, "replies": []}]}, {"body": "Why buy now, when I can buy it even cheaper later. ?", "score": 1, "replies": [{"body": "If you know its going to fall and when, why don't you just take out a large loan, buy some puts, and start a fund?", "score": 8, "replies": [{"body": "Too much risk", "score": -3, "replies": [{"body": "So you don't know when its going to fall, so you don't know whens the next time you can buy it cheaper?", "score": 3, "replies": [{"body": "Everyone’s situation is different and the risk appetite is different. All I can say is, the corporations in tech are seeing  demand contractions, which will lead to reduced earnings and hence the market could go lower. All of a sudden, stock values will be a thing again and the market will go south. Unless we see some betterment, will wait it out. Look up 2008. The real crash happened many months later and was deeper. Not saying anyone can time it .", "score": -3, "replies": [{"body": "I lived through 2008. I'm saying no one can time the market.", "score": 1, "replies": [{"body": "Not perfectly, but you can avoid buying in at the worst moments.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "The big \"if\" is \\*can you buy it cheaper later?\\*", "score": 10, "replies": [{"body": "You could have yesterday.", "score": 1, "replies": [{"body": "I totally did!", "score": 3, "replies": []}]}]}]}, {"body": "I would argue that the majority of people are greedy right now looking at the stock prices. Following Buffets actions and advice, I would wait it out. Couple of days ago he himself that he didnt buy any stocks yet because he didn see anything of value on the stock market. You misquote a man, to argue that you should invest now. Knowing that Buffer doesnt invest in the stock market currently because he feels every stock is overvalued.", "score": 1, "replies": []}, {"body": "Can I pm you a question?", "score": -3, "replies": []}]}, {"body": "I invested in alot of different stocks. Overall made profit. But already 3 of my companies went bankrupt. Good thing I only put in $100-500 in each. I still lost about $800. After that I'm changing my investment strategy. Learn from your mistakes. I now have a buying stocks checklist and I'm dollar costing and holding. Those strategies seem to work.", "score": 1, "replies": []}, {"body": "Completely agree.....Fiscal intervention will only bring the U.S so far. Huge un-employment will cause massive disruption to companies and there subsidiaries. Spending habits are going to be rocked. 2-3% of the population have only been tested. 2nd, 3rd and 4th wave to hit big time over there. Market being propped up by large Institutions right now......and as stated above, stocks are overvalued.", "score": 0, "replies": []}]}, {"body": "I'm buying. Sure, there might be short term pain ahead, but in the long run, we'll be just fine.", "score": 10, "replies": []}, {"body": "I haven't stopped buying as I usually do (every two weeks coinciding with a portion of my paycheck). Automatically into my 401k through my job, I maxed out my Roth IRA for the year, so the rest of the portion of my savings I set aside every two weeks goes into my trading account. I'm 30, so my investment horizon is long. I always have a large stash of emergency cash in my checking account; my investments in the market is only money I potentially could lose. I'm pretty diversified in mutual funds, ETFs, but most of my equities are in tech (Apple, Microsoft, Ali Baba, Salesforce, Square, etc). I'm looking into more Chinese companies (Tencent specifically). Ali Baba is estimated to have a good earnings call coming up so my recent buys have been with them. \n\nI truly believe you can't time the markets. I'm not going to sit on the sidelines and wait for it to happen which is why I always buy at a consistent basis. In the long-run, this strategy is profitable. The economic indicators are showing we might have another price correction shortly, but that still won't change my buying habits. Also, although buying stock in distressed industries such as restaurants, airlines, hotels might seem like a good idea now, it's too risky for me and not worth it.", "score": 8, "replies": []}, {"body": "VTI and QQQ.", "score": 4, "replies": []}, {"body": "3x leveraged short Russell 2000 (SRTY)", "score": 3, "replies": [{"body": "Ah I see you are a man of culture as well.", "score": 2, "replies": []}, {"body": "RemindMe! 3 months", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2020-08-14 13:23:55 UTC**](http://www.wolframalpha.com/input/?i=2020-08-14%2013:23:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/StockMarket/comments/gjjabm/navigating_the_stock_market_what_are_your_plans/fqlnzbp/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fgjjabm%2Fnavigating_the_stock_market_what_are_your_plans%2Ffqlnzbp%2F%5D%0A%0ARemindMe%21%202020-08-14%2013%3A23%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gjjabm)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "My remindme bot just reminded me.  You aren't still holding this are you?", "score": 1, "replies": []}]}, {"body": "I got 30-35 years until retirement so I'm buying as much as I possibly can, if it goes up great, if it goes down better", "score": 3, "replies": [{"body": "Same exact boat doing the same thing. Don’t have a ton to spare but I figure a few hundred bucks a month in quality stocks and VTI is better than keeping it in a savings account 👌🏻", "score": 3, "replies": []}]}, {"body": "I just buy on red days", "score": 3, "replies": []}, {"body": "Waiting for another dip, still expecting it to happend and that it’s going to be a big one. I don’t expect a fast rise afterwards also but we’ll see.", "score": 2, "replies": [{"body": "I keep waiting for a crash but it never comes... what gives?", "score": 1, "replies": [{"body": "FED’s pumping money like it’s nothing, that’s what’s going on. Massive unemployments are also happening. I personally think that it can’t go forward this way forever and it will crash before we know it, because the stock prices don’t reflect the current situation. I did however think that the prices would crash earlier but who knows, maybe it’ll crash even further because of that.", "score": 2, "replies": [{"body": "Q2 earnings will be abysmal.", "score": 1, "replies": [{"body": "Yes, that’s why I think it’ll go down ALOT ;)", "score": 1, "replies": []}]}]}]}]}, {"body": "Buy tech (QQQ), and hold everything else.  I'm a long termer so not too too worried S&P Index holdings.  I tend to think that the markets themselves will hold together even as the economy itself falls into shambles (just an opinion since this country does everything it can to save markets).  Betting on  FAA(M/N)G today is like betting on Standard Oil before trust busting.", "score": 2, "replies": []}, {"body": "I have been dollar cost averaging in since the end of March. Buying on nice pull backs. Individual stock picking. Staying away from ETFs for the most part but not totally. Buying stocks looking to next year. Forget this year unless there is an effective treatment or vaccine.\n\nOne controversial position I have is that I have expanded my energy holdings as the economies open back up. However, still with a sight of 12-24 months. After 24 months, I will start looking towards airlines barring a vaccine or treatment.\n\nI do not believe that the country will simply snap back. Many businesses will close permanently or use this crisis to restructure. Either way, a lot of jobs will not come back; definitely not coming back immediately. More will close if governors keep extending lockdowns. Unfortunately, these are in states and areas with the biggest economies; think California, NY, and Illinois. Further, there is no evidence that those that came out of this with a job intact will spend this year. I think there will be another downturn as the market digests this. However, I don't believe that we will hit the lows of March again. However, I would use any nice sized downturn to expand further positions on stocks of solid companies that have simply been unjustly beaten down.", "score": 2, "replies": [{"body": "You don't think we'll have a second wave this winter? I feel like it will be way worse. We got hit rather late in the flu season this year and we're now going back to work really because we're tapped out, we have no choice. The feds tapped out. Imagine if we get hit harder with attrition already taking hold and we're battling the flu season, cold weather, and whatever political turmoil will be going on from the election season.", "score": 1, "replies": []}]}, {"body": "Hear me out.  I think in gonna throw at least 5k into McCormick and company - the spice company.  I think a paradigm. Shift has occurred where many more are going to be eating at home.", "score": 2, "replies": [{"body": "You’re paying a pretty high valuation of McCormick (33x ltm eps), because it’s growing rapidly. Alternatively, you can buy another rapid growth company, FB for (28x ltm eps). \n\nIdk about you; but I’d rather get Fb at a cheaper valuation", "score": 1, "replies": [{"body": "yeah your right, i may wait two more earnings reports to hear what they are saying.", "score": 1, "replies": []}]}]}, {"body": "I'm 90% invested in stocks and 10% cash and in index fund i do systematic investment plan (SIP) which i will not be touching.", "score": 1, "replies": [{"body": "I'm older, so I have more of a mix, with bonds and stocks. Just watching. Maybe drinking a little more now.", "score": 3, "replies": [{"body": "Don't drink and trade.", "score": 1, "replies": [{"body": "Never", "score": 1, "replies": []}]}]}]}, {"body": "Im buying and holding. Havent sold in months.", "score": 1, "replies": []}, {"body": "It has been creeping down since I purchased last, a month ago. Glad I have a lot of dry powder to deploy.have 3 screens running here and real-time, I see the trend. Stocks are over valued. Let’s talk when they come down from their 50 day moving average.", "score": 1, "replies": []}, {"body": "I will buy every month", "score": 1, "replies": []}, {"body": "Long a bunch of large cap tech and tech and some pharma (by weight) AMZN, SHOP, OKTA, MSFT, PYPL, ATVI, APPN, ZM, ZNGA, AMD, SGMO, RHHBY, AMD, TSLA) Hedged maybe 20% at this point via SDS, and SRS calls and shorts.  Buying physical platnium and more gold when it drops or when the premiums drop.  Sold all my SP500 or anything with energy for big cap tech. Sold all bonds.", "score": 1, "replies": []}, {"body": "*another big drop in half a year*?\n\nIt’s happening right *now*. Stocks are literally returning to their March/April lows. Expect another -500pts tomorrow. I was riding the wave up, which means I’m shit out of luck right now.", "score": -1, "replies": []}]}
{"title": "What are your favourite/best non-tech stocks for long term hold?", "selftext": "Hi folks.\n\nI want to extend my long term portfolio. Currently it consists from primarily tech companies: MSFT, AAPL, ENPH, SEDG, BABA, AMD, GOOGL, TSLA, V, MA.  \n\nI'm aware it's too tech focused, therefore I want to add non-tech stock to have it better diversified. I can add one position at this moment (transaction commission).  \n\nSo, what's your favourite non-tech stock for long term holding (10-20 years) that you believe is really safe, will still grow and can give you decent gains?", "id": "gji5ks", "created_utc": 1589444187.0, "score": 24, "upvote_ratio": 0.86, "num_comments": 55, "comments": [{"body": "The name of the company, Aerotyne International. It is a cutting edge high-tech firm out of the Midwest awaiting imminent patent approval on the next generation of radar detectors that have both huge military and civilian applications now.", "score": 68, "replies": [{"body": "How the fuck did you do that", "score": 11, "replies": [{"body": "I tell you what, you show me a paystub for 72,000 and I will quit my job right now and work for you.", "score": 18, "replies": []}]}, {"body": "I’ve watched that movie so many times and I still Googled it 😅", "score": 8, "replies": []}, {"body": "I'll buy 10.000$", "score": 2, "replies": []}, {"body": "If you call them, their mom will answer. She’s so sweet.", "score": 2, "replies": []}, {"body": "Lolll!!! 😂", "score": 2, "replies": []}]}, {"body": "DIS, NKE, ISRG", "score": 8, "replies": []}, {"body": "My biggest non-tech holding is with McDonald's.\n\nThey have been one of the strongest brands in the world for many decades and I don't see that changing in my lifetime plus they have a reliable dividend that they have increased for 45 straight years in a row so no worries about them going out of business or reducing their dividend payments.\n\nThey have also had excellent growth and have been outperforming the market over the last few years which I expect to continue given the excellent job that management has done in recent years to keep them ahead of the curve. And they are even pretty recession-proof given that if people have to cut back on expenses and can no longer afford to go to more expensive restaurants then they are more likely to go get some cheap comfort food at a place like McDonald's.\n\nI also just love their business model. After I watched The Founder, I became so fascinated by their business which is unusual as most non-tech companies bore me and I don't even really like McDonald's food, but McDonald's business model is so interesting and brilliant in my opinion. Most people just think of McDonald's as being in the burger business, but don't realize that their business is actually in owning the global real estate empire upon which that burger is cooked, so they will continue to benefit from the tax breaks and long-term appreciation of real estate and inflation while most of the costs and risk is on the franchisee. It's such a brilliant business, I love it!", "score": 4, "replies": []}, {"body": "CARR if we aren't counting pharma. ABBV/ABT if we are.", "score": 5, "replies": []}, {"body": "BAM!", "score": 4, "replies": [{"body": "Why do you think that?", "score": 2, "replies": [{"body": "Because half of my portofolio is BAM. Alright honestly I done only very basic research but their EPS is better than other dividend financial stock like O, their earnings is also on a steady raise, I'm in for the long run. Honestly though, if it goes up I'll sell some and buy other stuff like SE to diversify", "score": 2, "replies": [{"body": "I bought BIP.UN this morning as governments are picking up so much debt right now they will be hiring more companies to build toll roads. The cost to build toll roads is real low compared to the profits, but elected politicians just care about optics - lowering deficits and taxes - and ignore that overall taxpayers will pay more to a private company than they would have paid through taxes to the government. I hate it, but if the politicians are going to do it anyways, I might as well profit off of their evilness.", "score": 2, "replies": []}]}]}]}, {"body": "O, AWR", "score": 5, "replies": []}, {"body": "CRSP, SHOP, COST?", "score": 4, "replies": [{"body": "What is your long term target price on shop?", "score": 1, "replies": [{"body": "$1000 by mid-2021.", "score": 1, "replies": [{"body": "You’re more than right on this one lol", "score": 2, "replies": [{"body": "He got it on the mark. You think its too late to open a position?", "score": 1, "replies": []}]}]}]}]}, {"body": "HD SBUX WM NEE NKE UNH LMT LULU", "score": 2, "replies": [{"body": "I like quite a few of those, but want to throw MMM in there too.", "score": 1, "replies": []}]}, {"body": "OMVV", "score": 2, "replies": []}, {"body": "BUD. It's cheap now. It'll pop once the market opens back up. Not immediately, but after a few positive earnings reports. So imo, a good long term hold.", "score": 2, "replies": [{"body": "As someone who worked at Anheuser....they won't be seeing positive earnings for a minute.", "score": 1, "replies": [{"body": "How long do you mean by a minute? I thought that was implied with the long term investment", "score": 1, "replies": [{"body": "Probably multiple years like 3-5. You technically specified a few earning reports which could be half a year or a year which I would not consider long term.", "score": 1, "replies": [{"body": "Yeah, you're right. I guess I've just got it stuck in my head that I'll be holding these for 10+ years, so that's long term..", "score": 1, "replies": []}]}]}]}]}, {"body": "DIN, DIS, KO, T", "score": 2, "replies": []}, {"body": "SYK really good surgical company.", "score": 2, "replies": []}, {"body": "Waste Management (WM)", "score": 5, "replies": [{"body": "Rev went up marginally while operating income decreased YoY. Debt : Cash ratio is bad... what do you see in the company aside from it being an \"all-weather\" company?", "score": 1, "replies": []}]}, {"body": "DIN", "score": 3, "replies": []}, {"body": "KO", "score": 1, "replies": []}, {"body": "Sysco", "score": 1, "replies": []}, {"body": "DOW", "score": 1, "replies": []}, {"body": "DHT tanker stock. Fantastic balance sheet, increasing record earnings/revenue for a while. It's my safe haven during an economic slow down.", "score": 1, "replies": []}, {"body": "SBUX", "score": 1, "replies": []}, {"body": "Amazaon. Nvidia. DKNG. Beyond Meat.", "score": 1, "replies": []}, {"body": "BYND hands down. Climate change is real. With global population reaching 10Billion, the planet is going to be toast is everyone keeps consuming meat at current rate. Switch to plant based protein which tastes just like meat is inevitable.", "score": 0, "replies": [{"body": "There are four different companies selling fake meat at my grocery store. Probably the store will soon release it's own store-brand fake meat, and fast food joints will want their own special recipe. \n\nA good product does not always mean the company producing it will do well.", "score": 5, "replies": [{"body": "Correct, first does not always mean best. Looking at pharmas and the generics when the patents run out.", "score": 1, "replies": [{"body": "Of all the fake meat products, BYND and Impossible Foods are hands down the best.", "score": 1, "replies": []}]}]}, {"body": "BYND sells fake meat made out of the things hot dog manufacturers refer to as \"filler\" when they advertise their product as containing \"no fillers.\"", "score": 1, "replies": [{"body": "Who cares. It's the taste that matters.", "score": 1, "replies": [{"body": "Which is why meat will always be king.  Nothing will ever beat a delicious dry aged grass fed steak.", "score": 1, "replies": [{"body": "Agree. Real meat tastes best. Problem is with climate change becoming more serious, carbon tax is coming. So real meat is going to become expensive. Rich can afford it. Poor I am not so sure.", "score": 2, "replies": []}]}]}]}]}, {"body": "GM, F, CCL, DAL", "score": -5, "replies": [{"body": "These are so risky tho. And GM / F are awful. \n\nGM has been sliding for years. \n\nFord is in bad shape.\n\nCCL is risky. \n\nDAL is risky. \n\nAny airline or cruiseline is a gamble in my eyes.", "score": 6, "replies": [{"body": "!remindme 1 year\n\nDAL will be here for 40+ years, as will GM and F.", "score": -1, "replies": [{"body": "Were you invested in GM in 2009?", "score": 1, "replies": [{"body": "I'm invested in GM now and am exiting at $25.5", "score": 2, "replies": []}]}, {"body": "I’m in dal at $23 avg... it’s $18 now. Dca some more?", "score": 1, "replies": []}, {"body": "I will be messaging you in 1 year on [**2021-05-14 10:43:04 UTC**](http://www.wolframalpha.com/input/?i=2021-05-14%2010:43:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/gji5ks/what_are_your_favouritebest_nontech_stocks_for/fqlbike/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fgji5ks%2Fwhat_are_your_favouritebest_nontech_stocks_for%2Ffqlbike%2F%5D%0A%0ARemindMe%21%202021-05-14%2010%3A43%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gji5ks)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Ford killing the game now lol", "score": 1, "replies": []}]}]}]}
{"title": "Sold off about 1/3 of my portfolio for some buying power", "selftext": "So just now I’ve finalized my decision to liquidate about a third maybe a little over a third of my investments. The reason I did this is because I am indeed expecting a second “crash” I put crash in quotations because I am uncertain if this is going to reach the lows we saw in March. The market shot up too high too fast it’s time for some sort of correction period. Do you guys agree or disagree and why?", "id": "gjr8p3", "created_utc": 1589478554.0, "score": 23, "upvote_ratio": 0.76, "num_comments": 55, "comments": [{"body": "Banks, manufacturing, automotive etc will continue to take hits. While other areas will grow. In my opinion, it's only a crash if you're invested in the wrong market.", "score": 35, "replies": [{"body": "All aboard the tech train", "score": 3, "replies": [{"body": "I was in pharmaceuticals, but the FDA has been focusing on the COVID products first. Kinda sucks to see all the delays on my investments lol.", "score": 2, "replies": []}]}]}, {"body": "I don't expect a second crash, but I do expect ongoing volatility and think it's wise to hold cash in accordance with your personal risk tolerance.", "score": 17, "replies": [{"body": "Would love to hear your reasoning behind why you don’t expect a second crash?", "score": 5, "replies": [{"body": "I outlined this in another post, and can fill in details if you have questions:\n\n\"There are some significant structural weaknesses in the economy that were revealed in 2008 but never fully addressed. In short, the USA is a consumer-driven economy populated by folks who do not earn enough to consume. Hence it is in fact a debt-driven economy.\n\nAddressing that is complicated, and I don't pretend to have any easy solutions. But you'll know it's happened when interest rates are allowed to rise.\n\nThe trap we're in right now is that interest rates are super-low, often negative in real terms, while the financial market rewards folks who are already bought-in just for being bought-in when new liquidity flows into it. The market doesn't distinguish between real demand for equities, and a general influx of cash. On net that makes stocks a better safe haven than cash.\n\nWhen this disparity is small, it's not a huge concern, but right now as liquidity measures are breaking records daily, the disparity is massive. Bears who expect the bubble to pop due to further havoc in the real world are basically expecting heat to flow from a fridge into an oven.\"", "score": 19, "replies": [{"body": "Well put thank you for the comment", "score": 9, "replies": []}, {"body": "Don’t you think enabling reward for savings would motivate consumers and come out of debt driven economy in the long run?\n\nAnyways, do you think the lowest corporate revenues/earnings from the second quarter due to shutdown businesses in April & May, missing consumer payments due to highest unemployment through third quarter, and tightened credit from banks in third quarter would generate fear/uncertainty to drive another market crash? I have noticed the domino ripple effects during Great Recession.\n\nI think new liquidity may stop right around election time because Trump doesn’t have to win again if he wins and Biden creates oversight if he wins.", "score": 2, "replies": [{"body": ">Don’t you think enabling reward for savings would motivate consumers and come out of debt driven economy in the long run?\n\nYes, that's another way of looking at my point about negative real rates.  This will only get worse as we move to negative nominal rates, which we will if Trump gets his way.\n\n>Anyways, do you think the lowest corporate revenues/earnings from the second quarter due to shutdown businesses in April & May, missing consumer payments due to highest unemployment through third quarter, and tightened credit from banks in third quarter would generate fear/uncertainty to drive another market crash?\n\nWell, if my thesis is wrong, then I will be wrong about this too, but I think it won't drive a crash.  Maybe a dip like we've seen these last couple days, certainly a more focused hit to tickers that are coupled to credit markets (banks, REITS), but nothing near what we saw from the initial COVID response. Because my thesis is that the credit market is already garbage, and that's why liquidity is driving stock market inflation rather than real-world economic activity.\n\n>I have noticed the domino ripple effects during Great Recession.\n\nThere's a lot to say here, but I'll sum it up by saying that there are two key differences to the GR: 1) The GR was ultimately a bubble in real assets; 2) the bubble was driven at least in part by fraud and malpractice.  We crashed in the GR precisely because a rapid, equal and opposite reaction to the cause of the bubble occurred.  In this case, that equal and opposite reaction looks (to me) to be something very different, but if it happened at the scale and speed that the reversal of the GR did then I absolutely expect the resultant crash to be as bad - worse, really.\n\nThe only way I really differ from most doomsayers is in what the trigger will be.  Otherwise, yes, I expect a correction could be very bad.\n\n>I think new liquidity may stop right around election time because Trump doesn’t have to win again if he wins and Biden creates oversight if he wins.\n\nCould be.  I will certainly become more risk averse as the election creeps closer, and I am definitely not taking crazy positions on the basis of what I think is going on, because I am not fully confident in it.  It's just a plausible explanation for why everything seems to be going in the opposite direction than conventional economic wisdom would dictate.", "score": 3, "replies": []}, {"body": ">Don’t you think enabling reward for savings would motivate consumers and come out of debt driven economy in the long run?\n\nWe wouldn't want to be not driven by debt. Debt might be the greatest invention of all time.", "score": 1, "replies": [{"body": "You may be right. The problem with debt is that rich knows how to leverage it but middle or poor doesn’t know how to save from it.\n\nI hope USA doesn’t shoot itself one day having largest debt in the world.", "score": 1, "replies": [{"body": "A lot of it is good debt though. I couldn't have gotten my Master's without student loans. It has more than repaid itself in the decade since. I bought a house with a mortgage rather than saving up for the whole payment. It was absolutely a good thing that I could own that asset with so little up front. In my job, my company (as all do) borrows money short term to pay for my paycheck, thus always knowing where the money comes from and providing a secure knowledge that it will be an honored agreement. I recently got my first credit card and now I don't need to carry as large of a savings balance because I can finance things like home repairs and move interest earning money later. Debt is a tool. Used right, it absolutely improves lives. Yes, it can be used irresponsibly and get people in trouble, but that's more of a critique of behavior, not the tool. Responsible debt is super beneficial.", "score": 1, "replies": []}]}]}, {"body": ">Don’t you think enabling reward for savings would motivate consumers and come out of debt driven economy in the long run?\n\nAgreed, look into 1980s , the savers were finally rewarded with 20% rate hike by Paul Volcker, the last fed chairman that ever did the right thing.\n\nThe economy was sick and it was forced to take medicine. Right now, the market is high on cheap money like cocaine, and they want more of it. Rehabiliation (higher rates on savings account) would be detrimental for the debtors and will tank the economy as with all medicine/rehab, the healing process is usually painful but better in the long term.\n\nAnyway, I'm not going to gamble that the government will ever do the right thing at this point. I am willing to bet they will continue to fight this to the point that they'd eventually have to buy equities to prop up markets. Therefore, I am 100% invested into VEQT.", "score": 1, "replies": []}]}, {"body": "What would happen if China pulled out their $1T from the US Stock market?", "score": 1, "replies": [{"body": "We get tendies.", "score": 2, "replies": []}, {"body": "Market drops by the 2.6% this represents?  People really over-estimate the leverage China's tentacles give it, and President Baby-fists has been slowly inuring us to the idea that US-China trade is on the out so I'm not sure the knock-off effects would be as drastic as even four years ago.\n\nI could be wrong, of course.  I don't know of anyone who has a convincingly full understanding of the degree to which China \"owns\" the US.  But keep an eye out on supply-chain reshuffling post-COVID, because whatever that degree of ownership is, it's on the way down.", "score": 1, "replies": []}]}]}, {"body": "Because crashes are difficult to manifest when everyone is waiting for a big crash. People will buy up the “crash” preventing it from truly crashing.", "score": 4, "replies": [{"body": "You can see this on a granular level too with individual stock. Even 1 unknown, niche tech stock with any sort of positive earnings fucking sky rockets by 10-20% like its nothing.\n\n&#x200B;\n\nDisney lately too. Datadog, Okta, a ton of drug companies etc etc.", "score": 1, "replies": []}]}]}]}, {"body": "so, you are swing trading based on your emotional reactions to current events? Get ready to lose money.\n\nEdit: looks like most posters in this thread like losing money too.", "score": 4, "replies": [{"body": "I sold fairly deep in the positives and only cut about 30% of my shares from each company I hold stakes in I didn’t sell any company completely", "score": 2, "replies": []}, {"body": "how is it an emotional reaction? investing doesnt always have to be long term, despite what people on this subreddit might think. Holding cash is perfectly fine if you have a solid strategy and plan B", "score": 2, "replies": []}]}, {"body": "I am mostly in cash - 80%, in 401k, Rothira, brokerage accounts and savings accounts. \n\nLook at current market levels. Go back in time to when we were at these levels before. Everything was pretty good back then. A LOT has changed. \n\nAre we (ie economy, jobs, small/medium businesses) as good as we were in 2017?  I’ve been expecting some major problem or event to come up so I was not surprised when a huge 100 year event happened. \n\nAlso - politically I don’t think that things are being handled well or effectively.  Even if government was doing a great job I would be planning for hard times ahead. But leadership now jokes about injecting bleach and directly contradicts their own recommendations. \n\nThings are not normal, not ok, not well run, and not about to change in the short to medium term.", "score": 6, "replies": []}, {"body": "I sold about half. I can't wait to find the real bottom, or at least load up for another bear market rally.", "score": 3, "replies": [{"body": "Cheers to that", "score": 1, "replies": []}]}, {"body": "I’m working on doing the same. I’m expecting a crash as well.", "score": 3, "replies": []}, {"body": "Did the same. Sold off a lot of stocks that has run up. Now about 50% cash. \n\nIf there's a crash, I'll get back in big tech. If not then going to research companies that has not recovered yet.", "score": 4, "replies": []}, {"body": "I haven’t proven to know anything at this point, but I don’t think that even the mightiest of mighty tech giants are immune from legitimate economic contraction like we’re already seeing. \n\nTo use the growth lens: it simply means that forward earnings are gonna go down. \n\nHow can things be so assuredly priced in when all guidance is removed for the rest of the year? Honestly, how can it?\n\nThe argument that bears don’t know anything can just as easily given to bulls who think that stocks near ATH and with no earnings guidance whatsoever are good buys. \n\nI’m about 30% cash for these reasons. Maybe I’ll get fucked.", "score": 2, "replies": []}, {"body": "no crash unless there's threat to the financial system like what we had late Feb to mid March. It's all stabilized now so money printing will prop up equity markets.\n\nGlobal banks are now full on helicopter money, the only way to take advantage of global nationalization is to buy the indices, therefore, i am 100% VEQT.", "score": 2, "replies": []}, {"body": "CNN today had an expert on saying vaccine in 10 years. WHO said yesterday this may be endemic. If we switch to the 🇸🇪herd immunity model the demand will be sufficient. I’m going almost all in and only leaving out 10% to throw into tripling stocks like amc and Red Robin.", "score": 2, "replies": [{"body": "Lol lost me at cnn", "score": 14, "replies": []}, {"body": "The reason countries go into lockdown is not because they don't want herd immunity but to make sure their healthcare system can keep up. Herd immunity is (hopefully) a result of people getting infected and building immunity. The question is still if that will be the case and for how long that lasts.", "score": 3, "replies": []}]}, {"body": "Is this hmm....timing the market?", "score": 3, "replies": [{"body": "Indeed it is sir! If done correctly could be very profitable!", "score": 3, "replies": []}, {"body": "None of this market makes sense acting like old quotes or advice such as this still applies is a rookie move. Timing the market may very well be a profitable strategy right now, do you really see the market returning to all time highs right now? Of course you don't, because it won't happen. Furthermore we're not even that far off from ATH as it is right now, indicating that yes a crash could be incoming and healthy", "score": 2, "replies": [{"body": "Timing the market is always a profitable strategy, there's no argument there. Too bad it's a 50/50 shot in the dark that not even the greatest economical geniuses could figure out", "score": 4, "replies": [{"body": "Only in particular circumstances I.e. The big short, etc. However I agree it's a shot in the dark right now whether things crash next week or after the US election that's why I'm not shorting", "score": 3, "replies": []}]}, {"body": "Ah yes! In times of economic uncertainty throw out all of the rules made for.... wait for it.... ~economic uncertainty~", "score": 0, "replies": []}]}]}, {"body": "Agree. Did the same.", "score": 2, "replies": []}, {"body": "totally dependent on what you are invested in....quarantine friendly stocks won't be affected as much. At home use of computers, the cloud, printing ink, printers, scanners, video-conferencing, etc. will all gain from the changing way the market place and industries conduct  business. Certain medical and bio stocks will gain. Other sectors of the market negatively impacted, have room to drop.", "score": 1, "replies": []}, {"body": "There should be a crash...it could be happening now but as we move into June and 2Q earnings are around the corner and if the virus starts making second waves and unemployment numbers stay high(they will) it doesn’t matter what anyone’s charts states...the market will go down....charts and all.", "score": 0, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Not gonna be any dumb money left", "score": 0, "replies": []}]}, {"body": "LOL you don't know shit just like everyone else.\n\nWhy not just admit it?", "score": 0, "replies": [{"body": "You are correct but apparently most do not. I made a little bit the last 7 weeks and am now holding back. \nJust my opinion. The forces are strong with the Fed and this President but the next 6 months could be brutal and more out of their control.", "score": 4, "replies": [{"body": "I hear you.\n\nPersonally i am staying in, but all the stocks i bought were down around 70% from a few months ago when i bought in. and i am already up a decent amount (not as much as before) with the stocks still extremely low. i got lucky and had no money in during the crash where they lost the initial 70% or so.\n\nTime in on my side,  i'm holding.", "score": 3, "replies": []}]}, {"body": "Aren’t you the person who just got into stocks the last two months, bought a bunch of CCL with 60k of your life savings or something, and goes around on this sub hyping up your own plays and the stock itself? \n\nJesus Christ I remember you. Now you’re attacking other people claiming no one knows anything. Lol.", "score": 0, "replies": []}]}]}, {"body": "Gotta be liquid man take what the market gives you. I liquidated all my stocks besides tech and reentered in April now a majority of my positions are TQQQ calls and mostly mega cap techs", "score": 1, "replies": [{"body": "TQQQ calls 😂\n\nYou realize you get the same amount of leverage as QQQ options just with less liquidity.", "score": 2, "replies": [{"body": "Wait rlly? No huh? TQQQ moves at 3X QQQ though", "score": 1, "replies": [{"body": "The premium prices that in and you’re just getting worse bid/ask spreads", "score": 1, "replies": [{"body": ".... I'm idk wtf I'm doing 😭 shit need to research this ty for bringing this up.", "score": 1, "replies": []}]}]}]}]}, {"body": "I agree that we will see more dips, especially with specific stocks. I'm sold some of my stocks Wednesday morning and bought puts. Turned out to be good timing for once.", "score": 1, "replies": []}, {"body": "I agree with you.", "score": 1, "replies": []}, {"body": "Cash gang never loses", "score": 0, "replies": []}, {"body": "BUY BACK AT ATH", "score": -2, "replies": []}]}
{"title": "Are Any of These Bad Long Term Holds?", "selftext": "I’m mainly looking to invest for 2-5 years. I obviously have most of my money in ETFs but I am investing directly in some stocks that I think are good long term plays for the most part. Want to know if anyone would disagree with any of these listed:\n\n(FB) Facebook\n\n(BABA) Alibaba\n\n(MSFT) Microsoft\n\n(V) VISA\n\n(MCD) McDonalds\n\n(BRK.B) Berkshire Hathaway\n\n(DIS) Disney\n\n(NKE) Nike\n\n(SBUX) Starbucks\n\n(UBER) Uber - This one is just more because I see lots of potential growth as it relates to their stock price in the future. Maybe the most controversial one listed?", "id": "gjx5t2", "created_utc": 1589497083.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 51, "comments": [{"body": "Love them all personally", "score": 6, "replies": []}, {"body": "BAD???  No.  Not one of the stocks you've listed is a BAD long-term hold.  Uber and its CEO can GFT.  I'll never invest a cent into that company.", "score": 8, "replies": [{"body": "Idk what GFT is but if your moral compass is guiding you on stock trading things will get rough. A lot of the companies I listed besides Uber have ethical concerns. FB and privacy. NKE and labor. MCD and workers rights. Etc etc. Most bigger companies aren’t going to be perfect. If that’s what your worried about just put all your money into ESG stocks", "score": 3, "replies": [{"body": "There are always other oportunitues. I would rather get 3% on a decent company than 5 on a corrupt immoral one. Not that there are many morak anyway nowadays 😁", "score": 1, "replies": []}, {"body": "GO F THEMSELVES (GFT).  Every single stock you mention is a growth/blue chip stock.  They'll be fine long-term and ALL companies (stocks) aren't perfect and run into issues (hence:  the stock market goes up ad down).  I'm not worried about anything -- what makes you think that?", "score": 0, "replies": [{"body": "Well your reason for saying Uber should F themselves would be on moral grounds no? I’m saying if you’re letting morals play a role you’re probably being hypocritical considering lots of companies have moral concerns. Unless you’re investing in some type of socially responsible ETF.", "score": 2, "replies": [{"body": "Correct.  I think Uber as a whole is a shitty company and the CEO is a f'n douchebag.  So, due to these reasons alone, I'll invest elsewhere and if the stock happens to skyrocket in the future, so be it.  I'll be perfectly fine missing out and making gains/profits elsewhere via companies I like and believe in.", "score": 1, "replies": [{"body": "I don’t understand or agree with it but to each their own. The world will continue to spin one way or the other.", "score": 2, "replies": [{"body": "Fact of life.  Cheers and good luck to you.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Baba will definitely moon earnings is Wednesday", "score": 2, "replies": [{"body": "I actually think they are potentially the best value right now of the bunch. As it relates to a long term hold. FB and BRK.B as well imo.", "score": 2, "replies": [{"body": "I agree. I kicked myself for not getting in at the dip this morning but I won’t miss the next one", "score": 2, "replies": []}]}]}, {"body": "Good selection imo", "score": 1, "replies": []}, {"body": "Where’s the airlines", "score": 1, "replies": [{"body": "Too risky for my blood", "score": 3, "replies": []}]}, {"body": "i know lots of people are high on berkshire hathaway because of warren buffet, but i'm definitely skeptic of their long term prospects. he's very old, and it's not clear how the company will fare without him when he inevitably steps away from the busines and/or dies.", "score": 1, "replies": []}, {"body": "No love for MMM?", "score": 1, "replies": [{"body": "Doesn’t look like a stock I’d want to own, no", "score": 1, "replies": []}]}, {"body": "BRK.B imo, age of the guys who run the company and your 2-5 yr time frame. \n\nAlso realistically Disney will be the biggest one to jump imo, all the other big ones are riding highs atm. When things return back to normal they will eventually level off. And I am not a fan of Uber nor SBUX.", "score": 1, "replies": []}, {"body": "No.\nI think your only two controversial holdings are BABA and UBER.", "score": 1, "replies": [{"body": "BABA is controversial??  Care to explain why you think that?", "score": 1, "replies": [{"body": "I wouldn't touch it because I don't trust China. That alone crosses it off my list.", "score": 4, "replies": [{"body": "I think that's a valid point, but overhyped.  People use Luckin Coffee as one of the bigger reasons not to trust China companies (stocks).  I honestly don't buy (the explanation) it, but I think being cautious is always a good thing.  Cheers and good luck to you.", "score": 0, "replies": [{"body": "I didn't touch China even before Luckin Coffee. It's simply that any corporation that does extremely well either gets subsumed by the CCP (behind the scenes) or gets crushed by it. I'm not risking my dollars on Beijing's authoritarians having a shred of self-control.", "score": 4, "replies": []}]}]}, {"body": "It's a common position I see in the investing subs. Not my personal opinion.", "score": 1, "replies": [{"body": "Huh.  I've yet to run into someone stating they think BABA is controversial.  I think it has way more upside than people think.", "score": 1, "replies": [{"body": "Personally I'm a cheerleader for them. Especially if they get into colo", "score": 1, "replies": [{"body": "Nice.  I own a wide number of shares, so obviously, I'm a fan.", "score": 1, "replies": [{"body": "I haven't jumped in yet, directly. They're in one of my baskets. Just keeping an eye on things for now.", "score": 1, "replies": []}]}]}]}]}, {"body": "I don’t invest in BABA because I’d don’t live in China and thus don’t have any experience with the business, so I’ll be really behind the curve if things happen to the company. I like to know what I’m getting into.", "score": 1, "replies": []}]}]}, {"body": "I wouldn’t touch Uber based on their CEO and culture and the fact that they burn cash like crazy. I think you could do better than Berkshire. They haven’t done much in the past several years with them hanging onto their cash.", "score": 0, "replies": [{"body": "I know Uber is the most controversial, I just think they have a lot of room for growth. I’m putting my morals aside. As for BRK.B I’m mainly using them to offset the crazy amount I have invested in tech. Plus I think they are a solid value buy. Smaller gains but that stock won’t be going belly up. I see the cash they’re holding as a positive for future growth no?", "score": 2, "replies": [{"body": "I understand wanting to have a safer pick. But they have only been up around 15% during the last 5 years. That’s trailing the market. Most of their gains has been through their shares of Apple. I think owning Apple directly would be a better move. Having cash is great if they are making investments. But they haven’t done much with it and are not expected to do so based on what Buffet has said recently.", "score": 1, "replies": [{"body": "Hmmm interesting. I was of the mind he’ll be using this downturn to take advantage of the cash he has on hand. You’re thinking he will just continue to hold and do nothing for the foreseeable future? They may only be 15% over the last 5 years but I won’t hold a pandemic where they’ve lost 25% in the last 3 months too much against them.", "score": 1, "replies": [{"body": "He talked about the challenges he’s facing toward buying companies. He thinks everything is overvalued. And he said during his annual meeting that the Fed stepped in too soon for him to deploy Berkshire’s cash. There doesn’t seem to be any indication he will do something soon. He could for all we know buy something tomorrow but I still think buying another stock is worth it long-term.", "score": 1, "replies": []}]}]}, {"body": "If you want a company like that look into facedrive. It is early days for it, so it could go bust, but it has had great pr through the crisis. Geared towards a more climate friendly crowd. Look into them, do your own DD, but I think they have a bright future, since uber and lyft are leaving the door open.\n\nDisclaimer: I have stake in facedrive.", "score": 1, "replies": [{"body": "Is Lyft not the moral superior to Uber already?", "score": 0, "replies": []}]}]}]}, {"body": "I’ve heard of those companies so I’m sure they’re good.", "score": 0, "replies": []}, {"body": "₿", "score": -1, "replies": []}, {"body": "the economy is collapsing.  everything is a bad long-term hold.", "score": -2, "replies": [{"body": "Lol this isn’t true at all. There’s plenty of opportunity to buy into companies right now at the right price for future growth. I put heavy positions into a lot of these in March. Market always rebound eventually.", "score": 1, "replies": [{"body": ">  Market always rebound eventually.\n\nexcept when they don't, or don't for decades", "score": 1, "replies": [{"body": "There is no scenario where the US market hasn’t rebounded eventually. If you see this as a decade long bear market then by all means hold all your money.", "score": 1, "replies": [{"body": "it could be a decade or more, or just a few years, but it will be at least a few years.", "score": 1, "replies": [{"body": "We’ll see. If states are all open by August I don’t see much of an impact. Federal govt is still pumping in money it seems. Company bailouts coming.", "score": 1, "replies": [{"body": "You think they will stay open if the virus triples in infections?  Because the way people are behaving un the US, we will have to start again from square one.", "score": 1, "replies": [{"body": "Once these states open, they will not be shutting back down. There will be more infections no matter when the country opens back open. It’s just the reality. But these governors won’t go back into isolation after coming out. Guarantee that", "score": 1, "replies": [{"body": "I disagree.  I guess we will see.", "score": 1, "replies": [{"body": "There’s legitimately no incentive for them to. Their state’s economies are already in trouble. It’s all about re-election and them shutting the state back down would do the opposite of that. Businesses elect them, just the reality.", "score": 1, "replies": []}]}]}]}, {"body": "the Fed can't artificially prop up the stock market much longer--U.S. debt is getting totally out of control", "score": 1, "replies": [{"body": "They definitely can and will. US can continue to print money for some time. Only country that can considering it’s the world reserve currency", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "My TSLA Valuation Model - predicting a 2030 share price of $5200", "selftext": ">***^(tl;dr and notable points lower down)***\n\nHey all, here's my Tesla (TSLA) Valuation Model, up until 2030:\n\n# [https://docs.google.com/spreadsheets/d/1RFNyL5k2vEELjfMOGEsF0Rdj8C1taHdOzukfuA8oY9c/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1RFNyL5k2vEELjfMOGEsF0Rdj8C1taHdOzukfuA8oY9c/edit?usp=sharing)\n\nThis model provides data including and excluding Autonomous MaaS (AMaaS) revenue, allowing for comparison of potential outcomes dependant on whether full Autonomy is achieved and marketable as a robotaxi program in the next decade.\n\nI believe that this model is relatively conservative in both financial calculations and production growth predictions. This is in comparison to both statements by the companies and to predictions from many buy-side analysts, namely ARK Invest and Baron Funds.\n\n\\-----------------------------\n\n# tl;dr:\n\n2030 predictions excluding AMaas: >!$5235 share price from $591B revenue, $158B profit, $1.6T market cap!<\n\n2030 predictions including AMaas: >!$24844 share price from $1.28T revenue, $365B profit, $5.8T market cap!<\n\n&#x200B;\n\n**major notes:**\n\npredicted 1.2m vehicle sales 2024 is 40% of Musk's stated expectation of 3m\n\nAMaaS release 5yrs behind Musk's original timeline\n\npredicted auto production growth is 35-40% yoy, Musk has stated that he expects 50% yoy\n\n% AMaaS vehicles on network and hrs/week could be 2-3x realistically once safety and owner profitability has been proven\n\ncomparing EV/EBIT and P/S ratios to similar growth companies and the total market in general (as of Feb20) portrays the predicted 2030 valuations as extremely conservative and could realistically be 1.5-3x\n\nvehicle and energy production costs (and thus gross margins) have been modelled in line with Wright's Law; prices have been modelled to steadily decline with costs - alternatively, Tesla could maintain prices and allow their margins to increase much faster\n\n^(\\^these points and many others are further explained within the Notes section of the spreadsheet)\n\n&#x200B;\n\nDespite my longer term (4-10 years) expectations remaining unchanged, here are my model updates for 2020 estimates specifically regarding potential CoViD impact:\n\n>**2020 estimates pre-CoViD:**  \n>  \n>Auto Total #: 520000  \n>  \n>Auto ASP: $55000  \n>  \n>Auto Gross Margin: 21%  \n>  \n>Energy MWh deployed: 2700  \n>  \n>Energy $/MWh: $735  \n>  \n>Energy Gross Margin: 15%  \n>  \n>EOY Share Price: $1088  \n>  \n>**2020 estimates post-CoViD:**  \n>  \n>Auto Total #: 419000 (-20%)  \n>  \n>Auto ASP: $49000 (-11%)  \n>  \n>Auto Gross Margin: 20% (-5%)  \n>  \n>Energy MWh deployed: 2160 (-20%)  \n>  \n>Energy $/MWh: $698 (-5%)  \n>  \n>Energy Gross Margin: 15% (no change)  \n>  \n>EOY Share Price: $806 (-26%)\n\n&#x200B;\n\nExpect another update in the next couple of weeks following Battery Investor Day. The date for this event is yet to be confirmed, however it has long been expected April or May. It may not occur until early-June, however Musk maintains that they will be revealing some of the most important battery-related plans and information of Tesla's history. I am expecting long-term plans to be revealed for multi-TWh battery production in the next decade, allowing for something ridiculous like 20M vehicles *annually.* If they reveal anything crazy like this I'll definitely be updating the model with that kind of growth.\n\n***-----------------------------***\n\n*full disclosure, I've a current share price buy target of* ***$875 USD*** *with the expectation of that to* ***sextuple by 2030*** *excluding revenue from Autonomous MaaS*\n\n*i of course must also say that i have no idea what i'm talking about + that you should take everything in these spreadsheets with a mouthful of salt water, making no investment decisions based on me nor my numbers.*", "id": "gjjx6t", "created_utc": 1589452818.0, "score": 65, "upvote_ratio": 0.87, "num_comments": 54, "comments": [{"body": "Yeah but have you taken into account the ressurection of the USSR in 2022 and the alien invasion of 2027? Didn't think so buddy.", "score": 37, "replies": [{"body": "Priced in", "score": 35, "replies": []}]}, {"body": "I see bull tesla thesis I hit upvote.", "score": 13, "replies": []}, {"body": "Thanks for sharing.\n\nI’ll be super disappointed if the 2020 auto gross margins is 20%. \nQ1 was at 18.5% without regulatory credits and 25% with it, despite the fact that Model Y was in early stage and Shanghai wasn’t fully efficient. We should see big jumps in auto gross margin in rest of the 2020.", "score": 11, "replies": [{"body": "I honestly expect similar. I was mostly trying to factor in a large corona impact w/o just halving production numbers. cheers for feedback\n\ndo you have any long term estimates of margins?", "score": 2, "replies": [{"body": "I expect price pressure to be relevant as long as there is no Model 2 and Model 1. These mass markets would be taken up by VW, and then you get the usual technical progress where these low models get better (longer range) and benefit from larger production numbers.\n\nSo, I’d be happy if he can keep it at 12-20%.", "score": 2, "replies": [{"body": "agreed. especially if they're growing at 30-50% and have a raging energy business at the same time", "score": 1, "replies": []}]}]}]}, {"body": "Interesting figures, thanks for sharing. I'm continuing to buy as many shares as I can with any disposable income I have at the end of each month. All in TSLA baby!", "score": 6, "replies": [{"body": "I'm gonna steal your flare and join small🐟 gang", "score": 1, "replies": []}]}, {"body": "Haven't seen people sharing their work recently, approved.", "score": 1, "replies": []}, {"body": "This is great! Please post again whenever you make significant updates to your model or predictions.", "score": 8, "replies": [{"body": "will do, cheers for the interest:)", "score": 5, "replies": []}]}, {"body": "I so hope you’re right. 💵💵💵💵", "score": 3, "replies": []}, {"body": "This doesn’t help my 07/17 calls", "score": 6, "replies": []}, {"body": "This isnt exciting enough for me. ARK says 7000 by 2024 ... now you're talking!!", "score": 3, "replies": [{"body": "\\^By the end of 2024. A.K.A. by 2025.", "score": 2, "replies": []}, {"body": "I'm actually more with ARK.  I think FSD causes a huge skyrocket in price at some point.", "score": 2, "replies": [{"body": "I agree, which is why there's a massive (5x) disparity between my AMaaS and ex-AMaaS predictions\n\nto my understanding, Ark's 2024 estimate w/o robotaxi success is about 1700, of which is much more in line with mine", "score": 2, "replies": []}]}, {"body": "that's with Robotaxi success next year, of which I honestly doubt.\n\nI believe that without AMaaS their 2024 target is 1700, of which is much closer to my estimates", "score": 1, "replies": []}]}, {"body": "Thank you for sharing. Wish we had more content like this more often!\n\nThe share price doesn’t equate for me based on the market cap valuation, am I missing something? Current stock price ~$800/share @$150Bn valuation means (assuming no dilution) a $1.5T valuation as OP mentioned would be $8,000/share stock price no?", "score": 2, "replies": [{"body": "have a look on the spreadsheet, I've accounted for regularly dilution of shares. I'm not able to look at it now so can't give the specific number though essentially as the number of shares increases, the share price can be lower and give a higher market cap.\n\neg. a $100 share price can give a $10k market cap with 100 shares available. say dilution occurs and there are now 120 shares available, that same $10k market cap can now be reached with a share price of $83\n\nthanks for reading:)", "score": 2, "replies": [{"body": "Yup I see that now, thanks.", "score": 1, "replies": [{"body": "no worries:) cheers for having a read", "score": 1, "replies": []}]}]}]}, {"body": "5600 I think is probably a reasonable price target for 2030. There were a fair number of calculations I don't really follow in the model with the bull case of 24800 though. Also, the 2019 EBIT is incorrect? Is it outdated?\n\nAlso, I don't think it's a reasonable thing to be growing EBIT 70-100% a year. Maybe for a few years this would reasonable, but not for a decade\n\nThanks for sharing this though. I think I'm going to rebuild my model and post it here as well", "score": 2, "replies": [{"body": "for the 20k+ model that factors in huge revenue increases from their robotaxi program. I've provided the other model in case this doesn't work out.\n\nI believe the $5200 model is more reasonable, it's based more on currently planned outputs rather than potential breakthroughs in autonomy tech.\n\nis the 2019 ebit wrong? I believe I based it off info provided in Jan for EOY financials. maybe I was basing it off un-audited numbers. where are you getting your numbers from?\n\ncheers for the response. I hope to see more financial models in this sub, I find they really aid constructive discussion", "score": 1, "replies": [{"body": "Might not be correct but got it from here [https://www.macrotrends.net/stocks/charts/TSLA/tesla/ebit](https://www.macrotrends.net/stocks/charts/TSLA/tesla/ebit). I think so too! I found your model interesting", "score": 1, "replies": []}]}]}, {"body": "That's really cool! I like that it\"s both fairly conservative and optimistic\n\n[I also made a valuation model for Tesla's 2030 stock price recently by the way](https://imgur.com/r/CryptoCurrency/pwsaH96)", "score": 2, "replies": [{"body": "hahah I like your projection, hopefully it's accurate", "score": 1, "replies": []}]}, {"body": "yes please", "score": 1, "replies": [{"body": "projections (financial or otherwise) , especially over such long term, are inherently meaningless.\n\n\nAs a rule of thumb, tsla auto business alone should be worth $800/share at least as of today. Add on to the power business and other initiatives, and account for a multiple premium due to the fact that tesla is a category killer with one of the most powerful (pun intended) and recognizable brands on earth on par with Apple and few other enterprises, it certainly seems reasonable that tesla should be worth north of 2000/share over this decade.", "score": 0, "replies": [{"body": "Why $800/share?  What are you basing that number on?", "score": 5, "replies": []}, {"body": "I know there meaningless. None the less, yes please.", "score": 2, "replies": []}, {"body": "didn't you just say that long term predictions are meaningless? what are you basing your own numbers off, if not financial projections?", "score": 1, "replies": []}]}]}, {"body": "How do calls work if there were to be a split?", "score": 1, "replies": [{"body": "They should react in the same way to the split.\nIf it's a 2 for 1 split, your strike price will be divided in half.", "score": 4, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}, {"body": "In what universe is 40% yoy growth \"conservative\" ?", "score": 1, "replies": [{"body": "when they're expecting 50% growth, 40% would make a huge difference in long term estimates.\n\nagreed, it doesnt seem *conservative*, however comparatively I believe my numbers are on the low end. especially considering someone like Ark with a 2025 target of $7000/share", "score": 1, "replies": [{"body": "> when they're expecting 50% growth, 40% would make a huge difference in long term estimates.\n\nAre you aware of what the average company the size of Tesla would be able to grow at over 10 years?", "score": 1, "replies": []}]}]}, {"body": "Just curious why the avg hours / week decrease from 100 to 35, then 45?\n\n&#x200B;\n\nlove the work btw, love looking at stuff like this.", "score": 1, "replies": [{"body": "cheers for the feedback:)\n\nthose first handful of numbers I simply left in there for reference as the AMaaS model was initially based on one from a blog by u/Peel7 (check his posts out btw). despite the variance, none of those number actually impact the model until 2025", "score": 1, "replies": []}]}, {"body": "What is your price to sales/P/E ratio under this scenario and total shares outstanding", "score": 1, "replies": [{"body": "if you open the spreadsheet and have a look in the Totals sections it gives all that info for AMaas and ex-AMaaS estimates\n\nsorry I'm not able to access it atm", "score": 1, "replies": []}]}, {"body": "That's a yearly growth of aroughly 10 %. Seems perfectly doable.", "score": 1, "replies": [{"body": "yeah, I think so. p sure it averages out ~13% from 2023, comfortably above s&p averages", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "sure, I'll aim to get us there.\n\nalso feel free to send me any of those 500+ shares if they get too heavy at any point:)))))", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm complete with you on the first two. Probably also right on the third but I just can't stand the way Amazon runs their business and feel like there is a chance it may catch up to them long term.", "score": 2, "replies": []}]}]}]}, {"body": "RemindMe! 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 11 months on [**2021-05-15 00:54:31 UTC**](http://www.wolframalpha.com/input/?i=2021-05-15%2000:54:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/teslainvestorsclub/comments/gjjx6t/my_tsla_valuation_model_predicting_a_2030_share/fqnyrc2/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fgjjx6t%2Fmy_tsla_valuation_model_predicting_a_2030_share%2Ffqnyrc2%2F%5D%0A%0ARemindMe%21%202021-05-15%2000%3A54%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gjjx6t)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Wouldn't Auto revenue skyrocket if AMaaS comes to fruition? They would have every reason to have model 3/y cost 250K per car.", "score": 0, "replies": [{"body": "potentially, however there's no way to accurately model that.", "score": 1, "replies": []}]}, {"body": "About 10 years ago there was a global financial crisis that few saw coming and it wrecked the economy and almost destroyed the global financial system.\n\nToday, about 10 years later, there was a pandemic that few saw coming and has create  the worst economic problem since probably the great depression and it's not even over yet.\n\nYou're trying to predict another 10 years from now? Good luck!", "score": 0, "replies": []}, {"body": "How does your model justify the $300 from last year jump to $800 this year?", "score": -3, "replies": [{"body": "what do you mean, we're already at 800?\n\nvaluations aren't linear, they take into account future prospects. if that weren't the case, Tesla would probably be sitting in the 200s and then bump right up post-Corona. that's simply not how the market works [most of the time]", "score": 1, "replies": []}]}]}
{"title": "Solar energy will have explosive growth coming out of lockdown DD [ENPH $65 call 6/19]", "selftext": "Hello Autists. I predict that renewable energy, most notably solar will have an explosive growth in the next month and years. With the entire world on lockdown, we see pictures of once heavily polluted cities are now very clear and clear of smog. We have to accept that oil is becoming a commodity of the past and renewable energy will take over the future. This lockdown will be that catalyst for consumers to go green. Hydrogen powered vehicles, solar power energy, and self sustainable ways to harvest energy is becoming increasingly attractive in the media. \n\n==============================================================\n\nTaken from a user on Stocktwits named WantedtoRetireEarly: \n\nGood comment from a solar installer: \"We've had to field more calls in the last month than I can remember in any April. We've made three sales with no contact with customers. It think the pandemic brings out the \"preper\" in people. Also, Tesla's solar tiles don't compete with anybody. They are a premium product and require special training to install. They also are integrated into the roof so maintenance and trouble-shooting is a bit more complicated. On that note Generac's inverter/battery offerings are a potential competition, but if you call them (I have numerous times) they don't have anyone who has information to give you on the technical aspects of an installation of their product line, specifically a retrofit for AC coupling of an existing PV installation. Finally, **Enphase's battery offing is whole house (up to 150 amps). SolarEdge's battery offering is only up to 25 amps per 7.6k inverter. I expect Enphase to overtake SE in the battery market when it becomes available.**\"\n\n==============================================================\n\nAn example for the growth of the renewable sector particularly solar:\n\n[https://oilprice.com/Energy/Energy-General/Trump-Administration-Approves-Largest-US-Solar-Project-Ever.html](https://oilprice.com/Energy/Energy-General/Trump-Administration-Approves-Largest-US-Solar-Project-Ever.html)\n\nYesterday, an article was released **\"Trump Administration Approves Largest U.S. Solar Project Ever\"** \n\nU.S. Department of the Interior [approved](https://www.doi.gov/pressreleases/interior-approves-plan-largest-solar-project-us-history) this week the biggest solar project in the United States ever—an estimated US$1-billion solar plus battery storage project in Nevada. The project will consist of a 690-MW photovoltaic solar electric generating facility plus a battery storage facility. The project will be the world’s eighth-largest solar power facility and is expected to generate enough electricity to power 260,000 homes in the Las Vegas area and potential energy markets in Southern California, the Department of the Interior said. The Gemini project is expected to be built in two phases, with the first phase coming online in 2021 and final completion as early as 2022, the Department of the Interior said. The on-site construction workforce is expected to average 500 to 700 workers, with a peak of up to 900 workers, supporting up to an additional 1,100 jobs in the local community and injecting an estimated US$712.5 million into the economy in wages and total output during construction, the Interior said, at a time when [more than 20 million Americans](https://oilprice.com/Energy/Energy-General/Oil-Holds-Gains-Despite-Massive-Unemployment.html) have already lost their jobs during the COVID-19 pandemic. Abigail Ross Hopper, President and CEO of the Solar Energy Industries Association (SEIA), said, commenting on the project’s approval:\n\n“**The solar industry is resilient and a project like this one will bring jobs and private investment to the state when we need it most**. We appreciate the work that the Trump Administration has done to make this historic project a reality.”\n\n“Gemini offers the **opportunity to showcase, at an unprecedented scale, what we believe to be one of the most promising technological advances in coupling battery storage to utility scale solar power to produce low cost renewable energy over the long term**,” [said](https://www.quinbrook.com/post/blm-doi-issue-final-record-of-decision-for-milestone-690mwgemini-solar-battery-storage-in-nevada) David Scaysbrook, Co-Founder and Managing Partner of Quinbrook.\n\n==============================================================\n\nTechnicals say that as long as the market remains bullish, we can expect ENPH to continue to rally in up to $69 target in the short term. \n\n&#x200B;\n\nhttps://preview.redd.it/3qee15xaomy41.png?width=966&format=png&auto=webp&s=b765a872e1dd0135c2bf6f6b59e985802324d031\n\nhttps://preview.redd.it/s5qrknh7omy41.png?width=968&format=png&auto=webp&s=857107525681ac61e8ab5a50109386079ed0364a\n\nBarclays analyst Moses Sutton raised the firm's price target on Enphase Energy to **$80 from $76 and keeps an Overweight rating on the shares following the company's Q1 results**.\n\nEurope - **doubled revenue over Q4. Tripled sales force.** Spain, Netherlands, Belgium Germany all exciting. Asia and Latin America are seeing revenue increases. Australia is seeing expansion but they expect a slow down in the region but they believe we are well positioned to do well in the long term.  \n\n\nNew products: Engineers have been working hard to implement remote debugging. Shelter in place did impact overall engineering and were unable to ship beta units at end of Q1. They are shipping now and expect to have revenue in Q2.  \n\n\nIQ8 will be launched by Q4 and IQ8D for two panels is coming along well. Their solar panels will be **97.5% efficient.** Another big initiative: **Digital transformation**. Looking to develop a comprehensive digital platform for both homeowners and installers. When done right, it will serve as a **powerful catalyst to launch further sales. Expect to make significant progress in this area in 2020.** \n\n&#x200B;\n\nENPH has been experiencing explosive growth pre-coronavirus era going from a $2 stock in 2018 to $59.09 in March 2020 and now they rallied up to $65 just two days ago and is now sitting at $58. Their balance sheet is pretty healthy, and they're expecting to continue to increase their revenue. Their estimated EPS growth next year is 38.80% but I'm 100% sure its going to be way more. As per Finviz, their annual EPS Growth in the past years is **53.50%,** annual sales growth in the past 5 years **12.70%,** quarterly revenue growth is **105.10**, and quarterly earnings growth is **2393.20%.** ENPH was also recently added to the S&P midcap growth 400. I project this stock will skyrocket to $200 in the next 1-2 years and possibly >$300 within 5 years. Right now, I currently have 11 contracts for ENPH $65 C 6/19 since I'm playing on this currently rally, and will continue to add in increments for longer dated calls for a long term investment. SEDG and TAN are good stocks as well but I currently like ENPH for the growth. \n\n&#x200B;\n\nTL;DR ENPH $65 C 6/19", "id": "gjc8lu", "created_utc": 1589418597.0, "score": 41, "upvote_ratio": 0.78, "num_comments": 57, "comments": [{"body": "No, it’s nearly at 52 week highs. Yeah the breakout stock in a recession/depression with extreme unemployment is a solar company that has high costs to convert struggling businesses/homeowners from fossil fuel dependency to solar dependency. Maybe if things were going really well for businesses and consumers, this would. And it probably will be in the future. But to say with 30% or whatever of citizens out of work and majority of businesses showing decreased revenue and earnings, now is clearly not the time to pay a big up front fee to convert when they’re worried about paying employees and leases next month. Long shares, sure. Calls a month out? Fuck no. Maybe leaps. **maybe**. Even jpow said this shit economy will take longer than originally expected to bounce back. Enph is cyclical, it drives up then drives down. I would be weary and trying to find a peak to sell your shares and I goddamn sure wouldn’t be buying a call.\n\nAlso as another comment posted, your claim of 97.5% efficiency from solar panels is only attainable if you have some fucking alien technology, they all sit around 20% and MAX 45%. Ain’t no fucking business or consumer paying 10,000% premium to squeeze an extra 20% off efficiency when I can connect to city power for 1/25 of the upfront cost and even if I did, I wouldn’t expect to see a recoup of my initial upfront investment of “going green” for 5 years. Plus, virus.", "score": 32, "replies": [{"body": "Plus oil is going to be cheap af for a while", "score": 7, "replies": [{"body": "oil has nothing to do with electricity. you mean natural gas. Oil is for cars, not powering houses.", "score": -1, "replies": [{"body": "Gas is often a byproduct of shale products (and all oil production, really).  So supply could come down as oil wells are shut down.  And so many power plants have converted to gas, the glut could turn into a shortage once the economy is rolling again.\n\nThat may take a while but not as long as it may seem.", "score": 5, "replies": [{"body": "Unlikely. More likely that foreign companies based in countries like Brazil, Russia, Saudi, or Venezuela with lower production costs come in to replace any supply that goes missing due to bankruptcy. The whole reason Saudi and Russia had their little spat was to reduce oil prices and shoulder USA producers out of the supply chain.", "score": 2, "replies": []}]}, {"body": "Fuel oil is a competitor for electric in the north, for heating. There are plenty of oil based powerplants around the world and when oil is this cheap solar isnt likely to get any increase in production. You might ask why its relevant whats going on in other countries, but keep in mind solar panels are mass produced and when demand drops in other countries, less are produced. With less produced the producers will need to charge higher margins to make their bottom line, and prices for panels will go up.\n\n40% of people in the usa making less rhan 40k have been laid off due to corona. No one will be able to afford solar panels while they are trying to scrape by to pay their bills.", "score": 3, "replies": [{"body": "Fuel oil as in LNG? Liquefied natural gas or Liquid petroleum gas. I am saying oil isn’t the ones powering most of our houses. Idk about most north but most countries rely on coal as a main source then gas and then nuclear. US is like 40% reliant on gas for electricity. Im only saying oil ain’t electricity. Oil doesn’t power houses. The byproducts from drilling like gas, yes. But oil? No.", "score": 3, "replies": [{"body": "No. In my area oil or gasoline is used for fuel oil. People refer to other fuels as petrol, natural gas, or propane.\n\nI know a lot of people in the northeast (the densest part of the country) that use gasoline or oil for fuel oil.", "score": 2, "replies": []}]}]}]}]}, {"body": "Underrated comment. LEAPs on solar is a power play.", "score": 2, "replies": []}, {"body": "Efficiency <> capacity factor. Efficiency degrades over time, bringing down capacity factor.", "score": 1, "replies": []}, {"body": "I have a 300$ generator that makes more electricity than a 30,000$ solar setup.... It can give me power during the night, and can actually power my house on its own", "score": 1, "replies": [{"body": "What are the all-in costs (fuel, maintenance, replacing the generator as it wears out, etc.) of running 16 hours/day for 30 years?", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 36, "replies": [{"body": "Yeah, WTF? The best we have now are just over 20% right?", "score": 16, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I work in the industry, peak modular efficiency for any residential panel on the market is 21%. The post is likely referring to DC -> AC conversion which for enphase is 97.5%. I echo the sentiment that enphase is a great long term play, but some of the cited evidence is truly retarded.", "score": 26, "replies": []}, {"body": "That's only for high energy solar cells where you use mirrors or lenses to bundle sunlight onto the cell.", "score": 3, "replies": []}, {"body": "I’ve seen “99%” efficiency with a polymer.", "score": 1, "replies": []}]}]}, {"body": "100% I don't care though. I'm buying dinosaur juice. Sudden demand, solar takes too long to charge. USO $13 10/16", "score": 3, "replies": []}, {"body": "i mean he aint wrong. He forgot to add the word weighted efficiency. Those are rated at like 30% being 100% or something.", "score": 2, "replies": []}, {"body": "Efficiency <> capacity factor. Efficiency degrades over time, bringing down capacity factor.", "score": 1, "replies": []}]}, {"body": "Last ENPH DD resulted in a -87% trade. Fool me once...", "score": 15, "replies": [{"body": "? They’ve been going up consistently for the past weeks. Up 51% in the past month.", "score": -1, "replies": [{"body": "And before that what did they do? Take a look at late September. Someone here had solid DD and I got in at 25 (30c & 35c for Oct) and it dumped to like 18. Once you’ve been hurt by someone you don’t want to see them ever again.", "score": 11, "replies": []}]}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "Wait for it to pull back to like 48 then grab your calls 3 months out.", "score": 6, "replies": []}, {"body": "Been holding ENPH stock and calls through the crash and recovery, this shit is gold. Great management, balance sheet and fundamentals. Kicking myself for not averaging down during the crash", "score": 7, "replies": [{"body": "I read through yahoo finance comments every day for this company and one guy invested $75,000 back when they were a penny stock and now he’s sitting at $1.3 million.", "score": 8, "replies": []}]}, {"body": "No it won't.", "score": 2, "replies": []}, {"body": "I love enph but it’s overpriced rn", "score": 2, "replies": []}, {"body": "High capital cost during a recession, low oil prices, and no tax revenue to fund subsidies. What could go wrong?", "score": 2, "replies": []}, {"body": "This post aged well...", "score": 2, "replies": []}, {"body": "Man I bought $65 c 5/15 yesterday morning and was up to 150%. And now... Still holding onto hopes for tomorrow", "score": 3, "replies": []}, {"body": "First non bot! Also god damn I remember when ENPH was worth $18 I lost a fuck ton on calls, if only I had bought further out😞", "score": 2, "replies": [{"body": "I bought 100 shares at 18/19 and its the only stock saving my small portfolio rn.", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Saw that $69 target", "score": 1, "replies": []}, {"body": "I have been a big fan of my ENPH shares.  Only reason I don’t own more is there hasn’t been any obvious average down opportunities.\n\nNOVA and SEDG have also been good to me.\n\nWith NOVA, I always get to hear Johnny 5 in my head as I scroll past...", "score": 1, "replies": []}, {"body": "Thanks for the writing. I might miss out something but please help me fill the logic gap here: why this pandemic would be catalyst to push people towards more environment friendly energy?", "score": 1, "replies": []}, {"body": "Solar energy is one of the most expensive forms of energy. How many people, companies etc do you think have spare money, or can get a loan that will take 20 years to pay off, not to mention oil is FUCKING NEGATIVE.", "score": 1, "replies": [{"body": "cheaper than the other renewables. You cant build a dam for hydro, or a wind farm if you live in a rural town. Only source is solar.", "score": 2, "replies": []}]}, {"body": "VSLR. Just gonna leave that here", "score": 1, "replies": [{"body": "what about it", "score": 2, "replies": []}]}, {"body": "$69 price target, 69% buy rating on Robinhood 🤔", "score": 1, "replies": []}, {"body": "Hey Im also in to solar. Currently holding SEDG. Why did you choose ENPH over SEDG. Their earnings this Q was supported by tax paybacks. SEDG is see is more financially sound. And in the future as the world goes into electric cars, which run DC to charge, it is very inefficient to go from DC to AC back to DC, as in the case of microinverters ENPH provides. SEDG on the other hand have an inverter box, meaning that you can save the energy in a DC battery and convert to AC if need be, or just use DC right away.", "score": 1, "replies": []}, {"body": "Beware of the trap of betting that what you think *should* happen, will happen.\n\nThat being said, if rates are near-zero or even negative for 30 years, that makes solar more attractive.  And gas is very cheap now but in 10 years it's hard to even guess.  Solar gives certainty.  And stimulus programs may give them an extra boost (as long as the programs don't prohibit renewable energy, which they might).", "score": 1, "replies": []}, {"body": "I just came here to say no one's been talking about solar at all in this sub, and in 3 months I've gained 60% *from stocks alone*", "score": 1, "replies": []}, {"body": "I am a single data point but I’m looking at installing a solar system with all of this and the cash I’m saving by not driving and getting my student loans deferred. 13k to eliminate my power bill, financed I’m saving $80 a month.", "score": 1, "replies": [{"body": "It’s hard to deny that self sustainability is the future. Harvest the energy of the sun to power your home and your vehicle.", "score": 2, "replies": [{"body": "2 Powerwalls for 10k and you can completely disconnect from the grid.", "score": 2, "replies": []}]}, {"body": "My boomer parents just finished installing their solar array seriously like today on their AZ house.. I know .. I know.. typical boomer.  But it’s still really expensive upfront costs and is going to take 8 years to break even on their investment.", "score": 2, "replies": [{"body": "Still 26% tax reimbursement all year long.", "score": 2, "replies": []}]}]}, {"body": "Finally! Someone posts some solid DD on ENPH. I play them every earnings, they make great products, ones which can virtually monopolize the micro inverter components and now cut into the  battery storage from a different angle. I've talked to several solar installers around the neighboor hood myself and they every time they bring up ENPH new products that are gonna be just easier to install, more capable of backing up homes for on / off peak load shifting (not just say 4 regular circuits per the LG chem battery?) and not having to retrofit the electrical of the home essentially which can be a financial deal breaker for homeowners going solar, and especially adding the battery storage solution. \n\nHome energy storage will be a game changer, albeit a long and long play but it will literally transform the way macro and micro grids will operate from here on. The extreme fires in Northern and Southern California prove this will help in that regard with resilience to large utility scale outages... Battery efficiency increasing year over year, cost going down year over year? Most homes will have it EVENTUALLY but will take a long time. I don't usually buy and hold stocks but I always fuck with ENPH options and I always make butt loads of money on them, like every time.\n\nI didn't even read your post, 0 words, I'm drunk but I'm super pro ENPH and this post and those are my thoughts. Will read your post later", "score": 1, "replies": []}, {"body": "Now this is real shit", "score": 0, "replies": []}, {"body": "ENPH is my best stock at 80%. You really think it can go even higher?", "score": 0, "replies": [{"body": "I absolutely think they have so much more room to grow. This will be the blue chip stock of the renewable sector.", "score": 3, "replies": []}]}, {"body": "I'm long JKS seems undervalued", "score": 0, "replies": []}, {"body": "ENPH, BEP, TAN, FSLR, HASI are all stocks to watch. All are undervalued. Solar and renewables will be the next global revolution, just so happens you can trade it", "score": 0, "replies": []}]}
