{"title": "Dow futures fall 175 points Wednesday night ahead of report that may indicate 1 out of 5 Americans are out of workz", "selftext": "", "id": "gnph8d", "created_utc": 1590032131.0, "score": 71, "upvote_ratio": 0.93, "num_comments": 51, "comments": [{"body": "Aren’t these usually bullish indicators?", "score": 76, "replies": [{"body": "Usually indicate that at next open, the indice will be up at least 3%.\n\nIt's thursday, always play out to be a bear trap. Futures are down until 30 minutes before open where it surge 1000 points from nowhere.", "score": 30, "replies": [{"body": " The markets resilience has surpassed our collective autism", "score": 12, "replies": [{"body": "Or maybe WSB is not autistic enough anymore. You know it's a bit like when you think you are the best at something, but you are actually not anymore...", "score": 2, "replies": [{"body": "This sub is moving from being a numbers crunching autistic kid (zenith was early 2019) more towards a Down syndrome situation", "score": 10, "replies": []}]}]}, {"body": "So they are controlled by randy orton ????? RKO", "score": 1, "replies": [{"body": "I guess they were controlled by our new prophet the shitting dog.", "score": 1, "replies": [{"body": "June it will lill yatchy", "score": 1, "replies": []}]}]}]}, {"body": "Just some weak hands selling.  JPow wakes up at 8am and starts pumping.", "score": 1, "replies": []}]}, {"body": "This level of unemployment will push the market into ATH.", "score": 49, "replies": [{"body": "This guy unemploys", "score": 11, "replies": []}, {"body": "308 special SPY", "score": 8, "replies": []}]}, {"body": "More unemployed Americans = More unemployment checks going to the stock market , 100% green dildo tomorrow", "score": 30, "replies": [{"body": "lol", "score": 2, "replies": []}]}, {"body": "1/5? Fuck that’s amazing news. Probably the best news I’ve ever heard. Calls.", "score": 15, "replies": []}, {"body": "Very bullish news.", "score": 25, "replies": []}, {"body": "But they always go up when the report comes out.", "score": 6, "replies": []}, {"body": "i aint scrrd", "score": 6, "replies": []}, {"body": "This Dow Jones dude don't give a fuck about no poors outta work. He hittin new ATH by end of June", "score": 5, "replies": []}, {"body": "1/5? You mean 4/5 have jobs. SPY 400C", "score": 5, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "When’s the last time we were red on a Thursday. It was a long time ago.", "score": 6, "replies": [{"body": "Titanic was still being built.", "score": 7, "replies": []}, {"body": "2 Thursdays ago", "score": 5, "replies": [{"body": "Lmao fuck outta here with your science and numbers nerd", "score": 15, "replies": []}]}]}, {"body": "Spy 300c 5/22 free money", "score": 5, "replies": []}, {"body": "Finally the rug pulled. Now onwards to greater highs.", "score": 2, "replies": []}, {"body": "40m out of work = 1/5 of the US labor force? So there are 200m in the labor force which is 2/3 of total population?\n\nThat sounds like dumb math. Who’s retarded, me or this article?", "score": 2, "replies": [{"body": "I believe those numbers use 16-64 as the labor force or something like that. \n\nI've seen the 0 - fucking old labor participation rate is roughly 50% in the past.", "score": 1, "replies": [{"body": "\"The U.S. labor force reached a high of 164.6 million persons in February 2020\", according to Wikipedia.\n\nhttps://en.m.wikipedia.org/wiki/Labor_force_in_the_United_States\n\nThat would mean we have a 23.45% unemployment rate (if all the claims are still happening).", "score": 1, "replies": []}]}]}, {"body": "and we are about to go green again lol.", "score": 2, "replies": []}, {"body": "Green open", "score": 2, "replies": []}, {"body": "Something something algos", "score": 1, "replies": []}, {"body": "175 points lol", "score": 1, "replies": []}, {"body": "2.4M ? nay or yay", "score": 1, "replies": []}, {"body": "They are lol didn’t last weeks numbers not include those looking for work?", "score": 1, "replies": []}, {"body": "Workz ok", "score": 1, "replies": []}, {"body": "Anyone care to explain why this is a bullish indicator?", "score": 0, "replies": [{"body": "Because 1 out of 5 Americans with no jobs still means 4 out of 5 Americans with jobs. SPY 300", "score": 29, "replies": [{"body": "This is how dow jones sees it", "score": 6, "replies": []}, {"body": "1 out of 5 Americans all day making money and 4-5 Americans all day spending money.", "score": 5, "replies": []}, {"body": "Also a lot of those unemployed are now making more than when employed. And now they have the time to spend it.", "score": 1, "replies": []}]}, {"body": "they always go up every unemployment Thursday", "score": 5, "replies": []}, {"body": "Employees are expensive as fuck. Companies are saving a ton of money. Very bullish.", "score": 3, "replies": []}, {"body": "Because imagine the amount of jobs we can create. Record job \"creation\" once the virus is controllable.", "score": 2, "replies": []}, {"body": "If they are collecting unemployment, we can guarantee they are collecting an OK wage. While the calculation is not based on number collecting UI, it's probably a high percentage of that group. So they are doing better than the worst case scenario of $0 income.\n\nAlso, it is bullish because it removes uncertainty in the market.", "score": 3, "replies": []}, {"body": "trump bux for everyone!", "score": 1, "replies": []}, {"body": "More Netflix subscribers", "score": 1, "replies": []}]}, {"body": "Priced In", "score": 0, "replies": []}]}
{"title": "DD - Your Wife's Boyfriend Works at NVIDIA", "selftext": "***Hello All-*** \n\n&#x200B;\n\n&#x200B;\n\n***I am here today to explain why your wife's computer runs Youtube better than your Fortnite Gaming PC. For starters, your dumbass probably has never heard of NVIDIA. Who's NVIDIA? That gaming company? Jesus christ have you ever thought about what makes our newfound digital life possible?!, they provide a lot more than just gaming cheepz for the 144hz refresherrz. Not to discount the fact that they do...*** ***~~and they're also the best at that. (Also, won't be covering in this post, but they also have a huge hand in self-driving cars. Look it up.)~~***\n\n&#x200B;\n\nAside from games, they are the company that drives almost every Professional Artists' workhorse. I'm talking PHOTOGRAPHERS and VIDEOGRAPHERS that take & edit your wife's nudes & pornos. I'm talking about what APPLE uses to power their machines, who are widely recognized by many to be the BEST CREATIVE tool in the markets. I'm talking about what DIGITAL ARTISTS use to draw up KILLER RENDERINGS of FAKE BEARS to trick your dumbass into buying PUTS. \n\n&#x200B;\n\nOh, they power ADOBE TOO?! The company that also has a monopoly in pre and post-process editing and content creation down to full blown 3d renderings? Jesus fucking christ. \"But wait, those programs are so hard to use and learn, they have a big barrier to entry and will never become mainstream.\" You're right. Kinda. Fucking boomer. \n\n&#x200B;\n\n**If only there was some way to tackle that.... The only way this could get any better was if they created a unified cloud platform that allowed these new students and existing practitioners a platform to connect and edit together instead of watching 5HRs worth of YouTube tutorials....**  Holy shit?! They just announced the Omniverse? WTF IS AN OMNIVERSE? I'll let NVIDIA explain:\n\n[\"Omniverse aims for universal interoperability across different applications and 3D ecosystem vendors. It provides efficient real-time scene updates and is based on open-standards and protocols. The Omniverse Platform is designed to act as a hub, enabling new capabilities to be exposed as micro-services to any connected clients and applications.\"](https://developer.nvidia.com/nvidia-omniverse-platform)\n\n&#x200B;\n\nSince I know you probably can't comprehend that, think of a google doc where you and all your little friends can see what work the other person is doing, while editing, in real time. This platform will, with no doubt, change the ENTIRE WAY that 3D artists and products operate.. making workflows faster, more efficient, and overall more enjoyable. What does this mean? They will hold a MONOPOLY over what is the future of our marketing assets, visual art outputs, and any game that shows up on a screen. To put this metaphorically- **This company has built the engine, installed it in all the cars, and has now paved the roads on which you will drive it on,**\n\n&#x200B;\n\nNow that you are aware, I want to let you know that this company is reporting EARNINGS after-hours TODAY. I forget exactly where, possibly in my fucking dreams, but they were recently upgraded to a target price of $450. The market just tanked a bit as I was typing this (hahaha), but they are currently at $355. Their revenue is UNTOUCHED by COVID. IF anything, they will BEAT EXPECTATIONS BIGLY because every little boy and little girl decided to buy GPUS to power their PornHub Machines and Instagram Editors. Now go make some money so your wife will look at you again. \n\n&#x200B;\n\n&#x200B;\n\n**TLDR; BUY NVIDIA  CALLS NOW BEFORE IT EXPLODES TOMORROW $NVDA 400C 5/29**", "id": "gnybht", "created_utc": 1590072923.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 57, "comments": [{"body": "Your DD is 1 week late retard", "score": 29, "replies": [{"body": "It is never too late sir", "score": -6, "replies": [{"body": "You made Good points. but there is risk due to renewed China trade tension plus stock is at ATH", "score": 4, "replies": [{"body": "I too have considered this... but many times I have found logic to be inverse of market price.", "score": 2, "replies": []}]}, {"body": "U sir are a faggot if u think this sub hasn’t heard of Nvidia gave it some dd then moved on and bought AMD years ago.", "score": 3, "replies": []}, {"body": "My NVDA call last week has 8x and you are saying it is not too late", "score": 2, "replies": []}, {"body": "Well it is too late now, it is tanking", "score": 1, "replies": []}]}]}, {"body": "I want to believe, but the run from 300ish to 360 has been too good to keep up. I’m hoping for a no reason dip off a good ER - one of those ‘well it’s a huge beat, but not THAT huge’ kinda drops, and then load up without that pesky IV", "score": 11, "replies": [{"body": "Yes I am averaging down on the way as well. Will probably get a lower strike & Exp out to end of June if this happens!", "score": 2, "replies": [{"body": "I know it’s not cool here but this is one I think everyone should have shares on as well. The type of stock you buy and just never sell", "score": 3, "replies": [{"body": "That's possible?", "score": 1, "replies": []}]}]}]}, {"body": "This aged well. Enjoy that crushing sensation.", "score": 7, "replies": []}, {"body": "Wow, this guy is retard. NVDA is going up because of AI, not some photographers somewhere", "score": 6, "replies": []}, {"body": "How do you play earnings on NVDA with IV so high?", "score": 5, "replies": [{"body": "Sell spreads or condors", "score": 5, "replies": [{"body": "this is da wae", "score": 2, "replies": []}]}]}, {"body": "You son of a bitch!  I'm in!", "score": 5, "replies": []}, {"body": "I’ll inverse this NVDA 300p 05/29", "score": 6, "replies": [{"body": "lol really? 3080 and AI and now this and you are buying puts?  Hey moron. Everyone is home = gaming.", "score": 1, "replies": [{"body": "They’ll probably beat earnings, but knowing this retarded market it’ll go down.", "score": 7, "replies": [{"body": "Ive lost money on NVDIA twice now. Both times it was while good news was coming out the doomer boomers couldnt understand. \n \nAnyways my retarded position is 6/19 $350c third times the charm boys.", "score": 2, "replies": [{"body": "i am trying to get thru to them. LET'S PRINT", "score": 1, "replies": [{"body": "Well how did you do?", "score": 1, "replies": [{"body": "not the greatest. time to take this long weekend to mentally reset. hope you as well!", "score": 1, "replies": [{"body": "I almost broke even. I didnt think volatility would get that low. It always does after earnings calls though. I dont know why i continue to play options on earnings. Its always a stupidly retarded move", "score": 1, "replies": []}]}]}]}]}, {"body": "Good time to get in while they are dropping... Once boomer money finds out about these guys it's over.", "score": -2, "replies": [{"body": "They already have... did you not see the run up since last week?", "score": 2, "replies": [{"body": "What news was that based off of? Largely irrelevant to the points presented here IMO", "score": 1, "replies": [{"body": "Based off pure speculation, logic isn’t that important of an factor considering this market", "score": 2, "replies": [{"body": "You're absolutely right. I guess DD shrimp, gecko, and dog are just as viable", "score": 1, "replies": [{"body": "Before coming to a conclusion, you must look at all arguments to determine which has the best risk/reward. Think of it as a debate...", "score": 1, "replies": [{"body": "Dont forget to read their balance sheet, ive betted against them and lost, so im making money back betting for them", "score": 2, "replies": [{"body": "Okay, but what do you think they’re truly worth though?", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Nice call faggot stock didn’t do shit great DD since everyone obviously uses Nvidia to play video games", "score": 0, "replies": [{"body": "Dumbass. Welcome to /r/wallstreetbets did you buy the CALLS I was selling? 5/22", "score": 1, "replies": []}]}]}]}, {"body": "with 75-80 IV on the 5/29s, wont you get crused after earnings when that thing gets cut in half?", "score": 3, "replies": [{"body": "Only if the price stays stagnant. If we see a $5-$10 gap up it will print", "score": 1, "replies": []}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I bought 425c 6/5 \n\nWill that works ?", "score": 2, "replies": [{"body": "May the tendie gods be in our favor", "score": 1, "replies": []}]}, {"body": "$NVDA has  plateaued, country is opening  up and getting  off their electronics.  I'll buy puts.", "score": 2, "replies": [{"body": "The whole point of this post was that they provide the backbone to a lot of our functional digital consumption... not just games", "score": 2, "replies": [{"body": "That's why I said electronics. not just games.  School will be in person again.  Work will be in person.  shopping in person. Electronics,  social distance, has peaked.", "score": 1, "replies": [{"body": "Also, new XBox and PS5 are AMD/ATI based.", "score": 2, "replies": [{"body": "That's good. I have AMD stocks.  might pick up some  options", "score": 1, "replies": []}, {"body": "Developers needing 3D renderings of new projects wont turn to an XBOX artist", "score": 0, "replies": []}]}, {"body": "If anything, I believe stay at home has demonstrated to the commercial sector how unnecessary it is to call EVERYONE into the office. If anything, the power of electronics and digital assets has been solidified due to stay at home", "score": 1, "replies": [{"body": "Yes. But it also shows. People  are less productive at home. It'll be a balance,  between lack of  productivity,  which means losses, and being able to rent/lease smaller properties,  which means gains.", "score": 2, "replies": [{"body": "I guess this comes down to a coin toss of the tendie gods. good luck sir", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Can you do a DD like this for FB and DIS?  Those bags are weighing me down too", "score": 1, "replies": [{"body": "sir i have no stake, send some options over", "score": 1, "replies": []}]}, {"body": "I’m out no thanks, it’s too rich now.  Too scared for puts.", "score": 1, "replies": []}, {"body": "How many capital you put into this?", "score": 1, "replies": [{"body": "1/5th of my portfolio", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/atruautist don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "John ($DE)ere and your chance to harvest some gains", "selftext": "[deleted]", "id": "go1hzc", "created_utc": 1590083171.0, "score": 56, "upvote_ratio": 0.9, "num_comments": 39, "comments": [{"body": ">John Deere (DE). There’s hardly a more American company.\n\nAnti consumer as fuck, so I guess you're right lol.", "score": 46, "replies": [{"body": "Basically the apple of farm equipment in the worst of ways.", "score": 24, "replies": [{"body": "Laughs in Ukrainian software to hack their bullshit subscription services", "score": 10, "replies": []}]}]}, {"body": "everything you said made sense. Which means. it'll go green", "score": 22, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "down $1,000 today. \n\n\nFriday  DOW (chemical) was at $33. Monday jumped to $38. Headquarters literally go under water.  Somehow it still  hasn't dropped.", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "everything is going opposite. So I placed a couple orders on the opposite of what I thought would pay. That didn't work either.", "score": 5, "replies": [{"body": "Same thing happened to me, nothing works anymore", "score": 3, "replies": [{"body": "might just yolo on something. I don't  even know what.", "score": 2, "replies": [{"body": "That $ZEN 6/19 90c pump and dump DD on here looks pretty risky, could be worth a look, I would dive in were it not for the fact that an hour ago I impulse spent my last $130 on a BB call that went above price in ten minutes but can’t sell it since there is literally 0 buyers for it lmao I’m done", "score": 3, "replies": [{"body": "yeah. bought some $LOW(es) calls. I'm out of buying power.", "score": 2, "replies": []}]}]}]}]}, {"body": " Buyers cashing out", "score": 1, "replies": []}]}]}]}]}, {"body": "Fuck John Deere, the only thing worth investing in of theirs are the old trucker hats that people pay $200 for.", "score": 20, "replies": []}, {"body": "So looking at news lately small farms have pivoted from selling to suppliers to selling direct to customers, and their revenues are down. Large farms have been mulching produce that they can't sell. Companies like Cysco have cut their delivery routes because restaurants aren't buying. So there's an entire outflow from the agg market that's just not happening. Lower agg sales/production would indicate to me lower purchases of agg equipment. This might not be a bad idea..... But I live in the middle of the corn stalks so it just might be my biased perception.\n\nEdit: I regret this decision.", "score": 14, "replies": [{"body": "Larger farming operations also aren’t trading in their equipment for newer models as often, and they definitely haven’t been this planting season.\n\n [Reading ](https://www.deere.com/en/our-company/news-and-announcements/news-releases/2020/corporate/first-quarter-earnings/) their safe harbor statement from February you can see the writing on the wall.", "score": 2, "replies": []}, {"body": "Sysco and Ag.", "score": 1, "replies": []}]}, {"body": "Earnings are Friday morning so I bought $1k of $141 strike for tomorrow. Price dumped from 144 to 142 and the PUT stayed the same. Almost got more.\n\nMy assumption is that DE is TERRIBLE on their conference calls. They are always under promising.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "BUSSCCCHHHHHHHH", "score": 2, "replies": []}, {"body": "Hindsight being 20/20 I should have know that everyone would have bought equipment before covid. Next quarter will be bad.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't like to bet against America and that is kind of what we are doing with Deere. But, NOBODY is going to buy anything big during this season because of Covid.\n\nGreat to see that it is in the $140s and I should have had diamond hands. Or, followed through with the short I was going to put on at $143.\n\nWith that said, I think $75 by Jan is a bit crazy unless you think there will be a complete failure of the entire US system. I am looking at $125 for next earning season though.", "score": 1, "replies": []}]}]}]}, {"body": "This did not turn out well...", "score": 3, "replies": []}]}, {"body": "Now this is some DD, long calls on KUBTY.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Sarcasm?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Honestly there's something to this. Probably because of retail investors like us buying up shares while stocks are low.", "score": 1, "replies": []}]}]}]}]}, {"body": "Was talking to a Deere employee recently who said something along the lines of \"we are not Google or Amazon yet, but we'll get there\". Can't understand why farmers keep buying their overpriced equipment, especially when as soon as they buy something they retrofit it with multiple 3rd party add-ons. Midwest farmers haven't seen much profits in over a decade while Deere CEO takes the corporate jet to fly <75 mile trips to regional airports like a fucking big shot. Fuck Deere.", "score": 5, "replies": [{"body": "It's been 6-7 years since farmers were turning a $1,000 profit on an acre of corn. Did they stick that profit in the bank and pay income tax on it? Fuck no. They built big fucking Shops  and filled them with new JD equipment and King Ranch pickups and then Section 179 depreciated the lot of it.", "score": 3, "replies": []}]}, {"body": "The big takeaway for me is the in house financing that is going to double fuck DE.  05/22 $125p", "score": 3, "replies": []}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "They might be rising recently cause Trump announced aid to farmers.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "If I remember right from growing up in Iowa, seems like most farms got new equipment after harvest or in like Feb.  They aint got time for that shit right now.", "score": 1, "replies": []}]}]}, {"body": "I don't know if this is just E\\*trade, but there's a niche at $120p for 25 dollars, where all the rest are >$400. Anyone know why?", "score": 2, "replies": []}, {"body": "My bro does sales for Caterpillar.  Most people he sells to tells me about think Cat is superior in anything they are competing in head to head.  These are important projects in cook county with guys committed to Cat.  One aspect of the bidness", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/oohcharlie don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Didn't farmers just get hefty stimulus checks or something? (more money more JD tractors) Loved your DD and your disclaimers, but I'm having a hard time getting on board with betting against anything that supports farms/farmers right now. That being said, good luck boys!", "score": 1, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "For most farmers, the stimulus money is helping to offset operating losses from 2019 and projected operating losses for 2020. The stimulus barely makes up for the massive shit that the commodities market has taken recently and it's tough for farmers to make money when the cash bid on corn is $2.50.\n\nAnd, most of these farmers will likely be facing CapEx restrictions for the 2020 production year.", "score": 6, "replies": []}, {"body": "Receiving money and using it to buy new equipment is likely priced in. The livestock and forestry/crop distinction in an interesting angle though.", "score": 1, "replies": []}]}]}, {"body": "I know, you’re probably thinking how the fuck do my cousins and I have internet out here?\n\nPresumptious, I was actually thinking how can you trade while your fucking your cousins.", "score": 1, "replies": [{"body": "Doggystyle so you can both watch x-files. Obviously", "score": 3, "replies": []}, {"body": "You’re *", "score": 2, "replies": []}]}, {"body": "Did the DD on this company a while back - great company longer-term, not something I'd want to hold in the next year or two. Corn/soybean prices are in the shitter and COVID-related cuts in meat production = cuts in demand for feedstock. Brazilian produce is literally like half the cost of US produce so no incentive for China to boost purchases from US. On top of all of that, farmers might not get the MFP payments. govnt has been artificially propping up farmers net income over the last 2 years. [look at this shit.](https://data.ers.usda.gov/reports.aspx?ID=17833) government intervention was 10% of net income last year and crop prices were better than now.\n\nDeere has the highest incremental margins on its big-ticket items for megafarms. Those guys are cutting capex = no AI-loaded planters from Deere this year.\n\nWhy not puts you ask? Stock is already punished enough for this. DE's a hell of a company, best in class with great mgmt and growth trajectory longer-term through precision agriculture. I'll prob buy some for my PA at some point before the end of the year, just have to figure out good catalyst.", "score": 1, "replies": []}]}
