{"title": "Some good news coming AMDs way", "selftext": "Very powerful CPU AMD are supposedly producing.\n\nhttps://www.techradar.com/uk/news/amd-ryzen-4000-renoir-leak-hints-at-a-seriously-powerful-8-core-apu", "id": "ggiafk", "created_utc": 1589041175.0, "score": 119, "upvote_ratio": 0.91, "num_comments": 58, "comments": [{"body": "I actually own AMD...so I am sure this news will make the stock fall somehow.", "score": 75, "replies": [{"body": "Lmao all news makes AMD stock, positive earnings, good guidance, etc. There’s stocks that defy gravity with news, this one doesn’t.", "score": 9, "replies": [{"body": "Has it even cleared $50? I remember earlier this year there was a whole lot of news about something they were releasing and it never quite got there...", "score": 1, "replies": [{"body": "Yes, it had cleared $50. Before earnings the stock was at around $57.", "score": 3, "replies": []}]}]}]}, {"body": "How much can they go up? - Aren't they already trading at ridiculous multiples?", "score": 43, "replies": [{"body": "Never underestimate meme stock", "score": 65, "replies": [{"body": "But it’s not even a meme stock", "score": 6, "replies": []}]}, {"body": "So are most tech stocks right now.", "score": 7, "replies": [{"body": "Not compared to AMD", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 119, "replies": [{"body": "> The second best time is now\n\nLol can't tell if troll but that's a bold claim", "score": 46, "replies": []}, {"body": "I wish I was what you are on when I was 16. Keep up the good work, you’ll get far in life. 💯", "score": 7, "replies": [{"body": "Thanks 👍", "score": 2, "replies": []}]}, {"body": "I had them at $1.72 sold them at $14...shoulda held 😭", "score": 6, "replies": []}, {"body": "What sort of time frame are you looking at? How long are you going to  hold ?", "score": 9, "replies": []}, {"body": "I second the encouragement to put money in the market early! Im 26 and looking back 10 years on how much the economy has grown... Wish I started earlier! It's even easier now, with apps like Robinhood", "score": 3, "replies": []}, {"body": "Isn’t it close to all time highs right now?", "score": 10, "replies": [{"body": "AMZN was above it's all time high in 2013.\n\nedit: I'm not super bullish on AMD, but using all time highs as a justification not to buy loses a ton of context when they are about 25-30% the market cap of their comparable competitors.", "score": 15, "replies": [{"body": "I sell IT for a living. I’m having success flipping customers off blue now where they wouldn’t even entertain the conversation a year ago.", "score": 6, "replies": []}, {"body": "\"amzn was above..2013\" \n\nWhat a retarded thing to say. You cant compare every stock to amzn", "score": -13, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "What about when does was above it's all time high... Now where is it? Can't just cherry pick examples to fit your perspective either", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Picks stock at ATH that went higher to support logic of it's okay to buy at ATH... Ignores literally every other stock that was at an ATH only to never go higher again.\n\n\nNah you right not cherry picker at all my man", "score": 1, "replies": []}]}]}, {"body": "Yea good point. But my point is that the other guy was comparing amd to amzn. Which is a dumb thing to do", "score": -6, "replies": [{"body": "Then explain instead of being a pickle dick like your name suggests you are. As far as IT news are concerned, it is an apt comparison when AMD is definitely not going to stop here. It already broke Intel's monopoly over the desktop, mobile and server CPU market. They are also already in the midst of making phone gpu and will be directly taking on Qualcomm and ARM. As stock  market goes; nothing is for certain of course. But calling it retarded? It's like a peanut farmer saying potato farms won't be rich; stupid remark about a different product, different market and lack of knowledge. It's one of the few industries that are still going up despite the pandemic, that speaks a lot by itself.", "score": 5, "replies": [{"body": "Yes that's exactly what I'm calling you, a fucking retard", "score": -4, "replies": [{"body": "Yeah that contributed to nothing except showing how jaded you are. Don't be mad because all your stock investments are dropping like flies.", "score": 4, "replies": []}]}]}]}]}]}]}]}, {"body": "Hold on, if the past is eligible to be a “best time”, and we’re going by increments of years. Than 2017 would be the 2nd best time", "score": 2, "replies": []}]}, {"body": "They're even a little too bullish for me and amd makes up most of my portfolio. I think if they release a GPU than can compete with nvidiax they'll hit 200. But anything above 70 right now seems meme stock like", "score": 10, "replies": [{"body": "Honestly I feel like anything above 40 for AMD is already meme stock-like", "score": 3, "replies": [{"body": "Yeaaaa, but I think when they announce at computex this year, they'll go higher simply based on hype", "score": 1, "replies": []}]}]}, {"body": "Glad I loaded up on puts going into this weekend!", "score": 15, "replies": [{"body": ">market cap\n\nWhat do you mean? thin im miss understanding puts :b what is it", "score": -1, "replies": []}]}, {"body": "I have $AMD 5/15 56c wish me luck", "score": 7, "replies": [{"body": "Good luck.", "score": 2, "replies": []}, {"body": "5/15 55c is gonna be crazy this week", "score": 1, "replies": [{"body": "I hope", "score": 1, "replies": [{"body": "+150% today on the 55 calls", "score": 1, "replies": []}]}]}]}, {"body": "Growing Market plus growing market share, idk how AMD could lose when they’re consistently coming out with better value products than intel. Plus the sector they’re in is just going to keep growing. The thirst for computing power and web services will only grow", "score": 5, "replies": []}, {"body": "AMD will be quick to release better products every year and not be complacent like intel did to solidify its lead in the CPU market because NVIDIA will make life difficult for them in the GPU one.  applied AI, graphics  rendering and data centers is quickly becoming an extremely lucrative market and AMD is looking like it may not be able to compete with NVIDIA on the GPU front in the long term.\n\nI really like AMD as a company and I admire Lisa Su, but I agree with people saying it's a \"meme stock\", or a cult stock. maybe a little bit too bullish.", "score": 24, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "Agreed, I was an Intel till i die man for a very long time and would have never bought that \"AMD trash\" now my next processor is going to be AMD without a doubt, unless Intel can find a serious way to compete.", "score": 21, "replies": []}, {"body": "Yeah it's cyclical tho. AMD was huge with enthusiasts very early to mid 2000s.  They also lost a lot of market share, myself included, when Nvidia and Intel made bigger strides. Enthusiasts are fickle and performance is king.  As much as I loved AMD in 2006 there was no way I wasn't putting a core2duo in my gaming PC.\n\nI still like AMD but this year could be the first time having one of their components in my machine in over a decade.\n\nThere are plenty of other reasons to invest in AMD but I just wouldn't put too much long term value over the current enthusiast flavor.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't know what you guys are talking about. I'm in commercial computer sales for medium businesses and no one buys AMD.", "score": 1, "replies": [{"body": "Go to /r/pcmasterrace \n\nThere are plenty of AMD consumers. Not to mention multiple companies buying into AMD chips for their next products like Samsung, Sony Playststion, Xbox, as well as google and twitter for servers.", "score": 3, "replies": []}, {"body": "And AMD investors believe that will soon change following the move happening among those who build their own PCs away from over-priced Intel. \n\nI have a Ryzen 5 2600, great price compared to the Intel equivalent. I also have an RX580, great price compared to the comparable Nvidia gpu, plus I saved hundreds more by not needing a Nvidia compatible monitor.", "score": 0, "replies": []}]}]}]}, {"body": "Intel’s 1st quarter EPS was $1.31 and AMD’s was $0.14.", "score": 2, "replies": []}, {"body": "Additionally, both Microsoft and PlayStation are releasing new consoles this year with AMD manufacturing the CPU and GPUs for both.  I’m curious how that will affect their numbers.", "score": 2, "replies": []}, {"body": "Has AMD started encroaching on Intel's sever space yet? Have not followed the news on that but I remember articles that were mentioning it could happen. Isn't the server market the real money maker for Intel?", "score": 2, "replies": []}, {"body": "Anyone on a budget would go amd id say", "score": 1, "replies": []}]}, {"body": "I have friend who works for AMD and their sole job was to build low level ML libraries.", "score": 1, "replies": [{"body": "and that is ?", "score": 1, "replies": []}]}]}, {"body": "Love AMD personally, but the stock valuation is still too high for me. Just sold my shares, hope to buy in again, but not at 50+", "score": 3, "replies": []}, {"body": "All hail Lisa Su.", "score": 3, "replies": []}, {"body": "I'm into AMD for a year or two. I'll take the chance that I see", "score": 2, "replies": []}, {"body": "I would never miss my chance to start a position into a 123 P/E ratio business. With some luck It can be valued well in the next ten years.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Pinned between two goliaths, Intel and Nvidia? AMD has been bangin but a 5 year call is a bold call for your claim", "score": 1, "replies": [{"body": "I feel AMD to be the hungriest of the 3. They've solidified chip contracts with all console players, and bringing out new CPU/gpu chips each week (exaggerating but you get the point). As for Nvidia, I was all for them when they'd partnered Tesla, but Tesla said they' themselves would be able to build a superior chip for their cars, and that's a 'wtf' moment.\n\nIntel. I've no idea.", "score": 1, "replies": []}]}]}]}, {"body": "Man. I wanna buy some to bandwagon. So my small portfolios got 1 share. Maybe I’ll make it two. Hehe", "score": 1, "replies": []}, {"body": "I own a few stock for AMD, I know as a ryzen user this isnt good, but business wise. People have seen performance to price is amazing and I think thats why they are making this move. This way people will have to upgrade their CPU and Motherboard. There is going to be lots of movement in used hardware during this release.", "score": 1, "replies": []}, {"body": "It was amazing how fast things changed.\n\nAMD used to be king in the early 00s when they were battling it out with Intel in the GHZ wars.\n\nIntel came out with the multi-core CPUs and kicked AMD out into the budget CPU ring.\n\nIntel started getting greedy and overcharging on their CPUs by a lot, but we just took it... then AMD comes out of no where and completely shoves Intel out of the room with their budget high-quality 8 core and higher CPUs.\n\nI switched to AMD on the initial Ryzen run and plan on staying with them.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "ggmn5g", "created_utc": 1589054913.0, "score": 48, "upvote_ratio": 0.73, "num_comments": 60, "comments": [{"body": "TL:DR Colorful graf you won't understand,  Spy could go up, could go way down, maybe, maybe not. Trump likes stuff", "score": 131, "replies": [{"body": "It’s hilarious to me that people think they can predict what will happen in a situation that has never happened before based on graphs.\n\nIt’s a fools game.  It’s human nature to want to put patterns on things when patterns don’t exist.   Same reason people see faces in the bark of trees.  It’s how our brain works. We want explanations and order even when there aren’t any.\n\nThis shit only works to explain retrospectively but isn’t helpful to predict future moves.   If it were, everybody would know exactly what to do.\n\nTomm trump could tweet something, or China could say or do something, or Iran could shoot a missile at a US ship, or trump gets corona virus, Powell says he’s backing off making money or is going to make more money, virus cases could surge or go way down.  \n\nWho the fuck knows", "score": 5, "replies": []}, {"body": "Trump will win in 2020, therefore 10,000 shares of CCL I dropped 142,000$ USD on will be worth 157,000 on monday", "score": 5, "replies": []}, {"body": "if you don’t understand those graphs you should delete robinhood", "score": -5, "replies": [{"body": "Robinhood😂", "score": 28, "replies": [{"body": "i use rh and td lol", "score": -2, "replies": [{"body": "Me too, Robinhood for gambling TD for investing", "score": 21, "replies": [{"body": "Same lol. I play levered ETFs with leverage on my Robinhood and my TD is a cash account with no leverage and no taxes. Tos makes me feel smart even though I don't understand how to read the options spreads", "score": 1, "replies": []}]}, {"body": "Sour poor losers sure are bringing down the community. Thanks for sharing, this is leading me to read up in some new stuff I hadn’t known to look in to. I appreciate it.", "score": 6, "replies": [{"body": "Agreed\n\n-sour poor loser", "score": 2, "replies": []}, {"body": "thanks man i appreciate it :)", "score": 2, "replies": []}]}]}]}, {"body": "lol Robinhood", "score": 1, "replies": []}]}]}, {"body": "Can you draw the green line a few more weeks to the right pls thx", "score": 18, "replies": []}, {"body": "Stopped reading after “I am in no positions”", "score": 14, "replies": [{"body": "I prefer “all-in on US Dollar.”", "score": 4, "replies": []}, {"body": "Same lol", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "rly ? i have to check that out", "score": 3, "replies": []}]}, {"body": "What makes you think trump wants a healthy market? That’s absurd", "score": 40, "replies": [{"body": "he brags about his economy and stock market all the time no?", "score": 3, "replies": [{"body": "Just the stock market. Fuck the economy, that’s the future’s problem. He can keep this zombie market alive by printing oodles of money indefinitely.", "score": 35, "replies": [{"body": "Everyone says the stock market isn't the economy. Why then does Trump always tote about his great stock market, not his great economy.", "score": 0, "replies": [{"body": "Is this a serious question? He does that because the stock market is going up but the economy is shrinking. His supporters don't understand the difference and often don't have any money in the share market, so as far as they know the graph going up is all that matters.", "score": 8, "replies": []}]}, {"body": "You realize that Trump / the federal government doesn't print money, right? They have no control over what the federal reserve does, which was the whole reason behind separating it from the government.", "score": -5, "replies": [{"body": "So that is why the president appoints the chair of the federal reserve?", "score": 1, "replies": []}, {"body": "so why is the fed always whining that their power is limited and need Congress to pass bills or them to operate?", "score": 1, "replies": []}]}]}, {"body": "Trump wants whatever makes him look good to happen. That’s it. That’s as far as his brain can function.", "score": 10, "replies": []}, {"body": "Trump is the definition of superficial, he would brag about SPY 600 even if we reached it by crashing the economy with 200% inflation. And he's not exactly a stickler for integrity or honesty either...\n\nHe wants the market to stay strong until November and he'll sabotage whatever he needs to to do it.", "score": 2, "replies": []}]}]}, {"body": "My boner is making big moves as we speak", "score": 5, "replies": []}, {"body": "Kids dying: priced in", "score": 9, "replies": []}, {"body": "Sir, this is Wallstrbets.", "score": 4, "replies": []}, {"body": "Yeah the markets are going to crash again. Look at all you idiots switching to calls now like yall did with puts back at 220 spx. Pretty good indicator", "score": 3, "replies": [{"body": "short plays, extremely short while earnings run.  Nothing's wrong with that when it's consistent.", "score": 1, "replies": []}]}, {"body": "I’m bc he referred to “DIX.”", "score": 3, "replies": []}, {"body": ">But look towards the end there's a large sell off and everyday past few days its growing and growing.\n\nNot really. There was a sell-off, then another buy-in, then a smaller sell-off. DIX was lower on 4/27 than it was 5/8, and yet SPY is still higher than it was on 4/27.\n\n>But I believe \\[Trump\\] wants a healthy market as well and if we can correct and climb back up, we can see our all time highs get crushed and climb higher.\n\nWhat makes you think Trump cares about the actual health of the economy at all. He's a PR hack who's left multiple bankrupt business in his wake, and yet he's the most powerful man in the world.", "score": 3, "replies": []}, {"body": "Nothing wrong buying shares if you hedge properly. I've got long dated otm puts that will mitigate much of a major drop and I'm long shares to ~80% of portfolio value. I'm not autistic enough to play options at the moment since the market makes no sense and I'm not brave enough to use all cash +30-40% margin that I usually do. Overall I'm bearish, mainly because I disagree with your notion Trump wants a healthy market. I really don't think he cares if the stock market burns post election", "score": 2, "replies": []}, {"body": "wary, not weary", "score": 3, "replies": []}, {"body": ">But I believe he wants a healthy market as well\n\nLOL", "score": 4, "replies": []}, {"body": "With unlimited QE in place, SPY will not drop again to 260 level. It might drop 10-15 points from the high but it will go back up in the next 2-3 days after the drop.", "score": 3, "replies": []}, {"body": "What is meant by trading “in the dark”. Is that just after-hours trading?", "score": 1, "replies": [{"body": "google \"dark pools\"", "score": 11, "replies": [{"body": "this", "score": 2, "replies": []}]}, {"body": "no overseas trading isn't listed publically its all hidden", "score": 2, "replies": []}]}, {"body": "Ok……… when do I buy puts?", "score": 1, "replies": [{"body": "Scale in this week on up days. After 5/15 there’s little to no support for the market makers to keep going up. Need to get to opex first though.", "score": 3, "replies": []}]}, {"body": "That’s a lot of hubbub for people trying to save 10%", "score": 1, "replies": []}, {"body": "thought dis nibba was non-biased but he sounds pretty bearish to me \n\nthink i'll pick up some more puts now", "score": 1, "replies": []}, {"body": "Position or ban", "score": 1, "replies": []}, {"body": "Do we know, what caused the deeper crash in March 2009, after the initial drop in late 2008? May be, we are ticking?", "score": 1, "replies": []}, {"body": "\"I think we can hit spy 300 in the coming days with some nice rallies  but as soon as we get there (give or take a few dollars) I think we can  drop to 260 again. \"\n\nI like how you presented a bunch of ambiguous data charts then made a prediction with arbitrary values that did not appear in the data. Now you are ready for CNN interview.", "score": 1, "replies": []}, {"body": "Too many words... Spy only goes up", "score": 1, "replies": []}, {"body": "You lost me after citing the \"dark pools\" graph, which is bullshit and has no useful applications or correlations. Might as well be reading tea leaves.", "score": 1, "replies": []}, {"body": "DIX is not reliable as it’s never been tested in a bear market/crash. \n\nI don’t see how it’s useful in any traders arsenal given the current economic climate.", "score": 1, "replies": []}, {"body": "neXt Leg Down isComingG!!!!", "score": -3, "replies": [{"body": "Gonna be worse than march!! \n\nSPY 240p 4/17", "score": 2, "replies": [{"body": "Wut?", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Wait there are people that believe order flow and time / size of trades of SPY actually mean something?\n\nLol ok.\n\nIt's pegged to an index. When trades take place, what size they take place in, etc. doesn't affect the price or mean anything. \n\nWhat is this shit?", "score": -6, "replies": []}, {"body": "You lost me when you said Trump wants a healthy market. C'mon man. Unbiased my ass", "score": -2, "replies": []}]}
