{"title": "First ever stock purchased!!! (AMD)", "selftext": "[deleted]", "id": "eo6zv2", "created_utc": 1578935524.0, "score": 17, "upvote_ratio": 0.68, "num_comments": 70, "comments": [{"body": "This isn’t going to age well", "score": 58, "replies": [{"body": "i’m a relative new investor myself but am holding AMD. I’m curious what you see as a negative towards them right now? This is just question, not coming at you for doubting them haha", "score": 6, "replies": [{"body": "To be honest, I don’t think this has anything to do with AMD in particular, but it seems new investors are rushing into the market at the moment and it’s usually a really bad sign that the market has topped/is topping", "score": 18, "replies": [{"body": "One random person making a decision to buy a couple shares of stock means the market has topped?", "score": 14, "replies": [{"body": "I could probably get the aggregate data on all the posts about “hi I’m new, hi I need investment advice I’ve never bought stocks, hi I just bought x as my first stock” over the last 6 months to a year but it would take too much time knowing just off the top of my head, just how many there have been", "score": 3, "replies": []}]}, {"body": "Haven't we been writing this for years though?", "score": 5, "replies": []}, {"body": "Yep.  I pulled everything thursday and set buys 7% below the ATH on all 3 indexes.  We should see a market pullback any day now.", "score": 2, "replies": [{"body": ">August 2030\n\n>a-any day now guys haha trust me, these ATHs are ... um.... they're definitely unsustainable... hah ...", "score": 12, "replies": []}]}, {"body": "the market in general or only that stock?", "score": 1, "replies": [{"body": "Both, but particularly the stock. In my experience trying to time the market is dumb though. What I do is  go in with firm buy and sell rules and I stick to them. If a stock triggers a sell rule, I sell no matter what, limiting my losses I've usually halved my position once or twice by the time I reach that point though.", "score": 1, "replies": []}]}, {"body": "Makes sense. Yeah maybe AMD wasn’t the best first buy since they just had amazing growth in the last year. OP will have to get back to us in a few months.", "score": 1, "replies": [{"body": "No. AMD is looking to have another amazing year. Do your research. This guy doesn’t want his tendies. He’s spewing random information.", "score": 6, "replies": [{"body": "AMD will definitely continue to grow this year. I believe the stock price will grow with it, but I also think this is a particularly risky stock because the price may have risen faster than the value.", "score": 5, "replies": []}, {"body": "I believe so too. I’m gonna hold my position still. Bought in last March!", "score": 1, "replies": []}]}]}]}]}, {"body": "I thought I was in WSB for a second.", "score": 1, "replies": []}, {"body": "Damn man", "score": 1, "replies": [{"body": "I am expecting a drop in price, in the short run. But am holding for the long run, using the drop to buy more. Don't be discouraged if a drop happens and dont panic sell. If you had an opinion about a stock, it doesnt change just because the graph changes in the short run", "score": 3, "replies": []}]}]}, {"body": "Congratulations!", "score": 7, "replies": [{"body": "Thank you!", "score": 3, "replies": []}]}, {"body": "are you into computers or something, why is AMD always a top pick on RH...  maybe I should buy some too", "score": 4, "replies": [{"body": "A lot of people that are interested and take the time to learn about the market are also (in my experience) more interested in computers than your average joe. \n\nI personally don't hold any AMD shares as I'm in Australia and don't bother with the US market. However they are a solid company that has been putting out awesome products that are now often beating their CPU competitor in a duopoly market.", "score": 7, "replies": []}, {"body": "imo they’re a solid competitor to Intel. They are creating processors that are just as, if not more, powerful as Intels for cheaper. They’re becoming more trusted and popular amongst computer enthusiast as well as being in all the next gen consoles.\n\nThey were my first stock pick and I have an I7 (Intel CPU) in my PC, so i’m not just fan girling. I think they’re a great company that’s going to do extremely well this year.", "score": 3, "replies": [{"body": "Yeah 3 years ago I bought an intel chip without even thinking about it because it was the safe chip. Now, I don't know. AMD isn't just a better deal for my dollar, the chip may actually be better. Good chance my next chip will be AMD.", "score": 4, "replies": []}]}]}, {"body": "Have you looked at their long term chart?  Their P/E is 255. That gives you an earnings yield of 0.255%\nI’m happy you started investing, and AMD might work out. I just don’t want you to get burned right away. So I hope you are aware of the risks involved when all of your returns rely on increasing investor sentiment.", "score": 6, "replies": [{"body": "Yep, great company, but super risky stock right now.", "score": 4, "replies": []}]}, {"body": "Good choice! I felt so happy when I bought my first shares in the market! I’m pretty sure AMD is a long-term hold since they are slowly cutting into Intel’s revenue due to AMD having better processors. I could be wrong, but that’s what I’ve heard", "score": 5, "replies": []}, {"body": "Enjoy investing!!!", "score": 2, "replies": [{"body": "Thx brah", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Let's hope you are correct..that would be amazing", "score": 1, "replies": []}]}, {"body": "It's a good company, I'm currently holding a dozen shares myself after taking profit on half the shares in my initial purchase. Personally I bought NVDA and LULU today. The only reason I wouldn't recommend AMD right now is that it could pull back hard in the coming weeks. It could also rocket to new heights, but it's risky at the moment. I'm holding because I already sold for a nice little profit cushion so even if it drops by 30% I still break even.", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Hmmm", "score": 1, "replies": []}]}]}, {"body": "If you want speculation Bitcoin is a better buy than AMD right now", "score": 2, "replies": [{"body": "Why doe", "score": 4, "replies": [{"body": "Bitcoin is pure betting. Nothing wrong about it but you have to be aware of it. AMD is actually a manufacturer even if it is a volatile one in the short to middle run", "score": 2, "replies": []}, {"body": "I got into stocks recently , like late 2017. But I was actually looking at AMD around that time, actually around early to mid 2016 when AMD shares were around $3, I was looking because I was a big believer in AMD to recapture the CPU market and some of the GPU market but mostly CPU as I knew they were working on zen and zen 2. Had I actually been an investor I woulda followed my foresight and put money where my mouth was but I just had never invested anything before. It wasn’t until late 2017 I got into both stocks and crypto. I see myself as someone who likes to bet on being to forecast outcomes based on my research (not that there is enough research, but just enough to justify my reasoning) and bitcoin/crypto definitely seems like the next step. \n\nI might’ve missed out winning big on AMD , but I have a really good feeling about crypto and where it’s headed and decided i would rather be a part of it then sit on the sidelines again. Especially with Bitcoin and it’s 21 million supply and demand economics. With there being a halving of the supply every 4 years it causes it to produce less bitcoins by miners and essentially making bitcoin rarer and more valuable. The demand is rising and it’s clear to see with MANY I mean MANY institutions increasing liquidity for bitcoin.(check Rakuten, eToro, CashApp, ICE/Bakkt, etc...)The blockchain concept of digital money behind bitcoin is also ingenious as it allows people to be their own bank and be an asset that is uncorrelated to the economy. Trust me when I say I believe even at 8k bitcoin will grow bigger than what you can with AMD, this might sound like lunacy right now but I believe one bitcoin will be worth $1 million by 2030. There’s also more upside as bitcoin is actually a different form of digital currency which you can be a part of early. The value proposition behind it is uncanny because it works as sound money.\n\nIf you look hard enough you can see that almost every country is racing to roll out their own central digital bank currency (cbdc). This is massive because they are ALL based on blockchain meaning a true digital economy/currency. This will only help increase liquidity in bitcoin even further.", "score": 1, "replies": [{"body": "First off when was AMD 3$ in 2017? It wasn't 3$ since 2016. \n\nNext there is nothing elegant about blockchain. It is extremely slow and it's entire premise is based off inherent inefficiency- proof of work. This is the future? I hope not. It's terrible all around. \n\nNext just because there is limited supply of something does not result in a higher intrinsic value. There is no inherent value in an individual bitcoin. THere is only value in the network of miners which now (and for many years) is no longer distributed. Mining power has been consolidated. Why is is this an issue? Because this cosolidation can result in greater than 50% network mining power and result in surreptitious modifications to the blockchain if a malicious actor was to control a majority of the mining power of the network. This is inherent to the design of the blockchain.", "score": 0, "replies": [{"body": "“actually around early to mid 2016 when AMD shares were around $3,”\n\nThanks for reading thoroughly.... not.\n\nI’m not sure if you heard of lightning network but I would not be surprised if you didn’t. It’s a second layer solution that solves Bitcoins slow transactions. I still don’t anticipate bitcoin to be used for daily purchases but it can be used for purchases, much more so and reliability than Gold. Also, I wouldn’t be surprised if you never heard of block lattice either which is a new form of digital currency allowing wallets to be their own blockchain and enables peer to peer transactions without ANY fees and instantly. Although, there are also many really fast blockchains, xrp is one, can literally be sent in a second at a REALLY low cost (low fees goes the same for almost every crypto really) The only issue with XRP is that it is centralized, still not as centralized as the dollar. \n\nThere’s really just too much to explain to the non educated that I feel like I’m wasting my time. There’s tons of evidence we are moving toward a crypto future and you really can’t argue that, again what about all these institutions offering crypto - eToro, Rakuten, ICE, Fidelity, CashApp/Twitter. You really don’t have anything to say about that. The FED, the US fed is going to announce a digital dollar (yes a fucking blockchain) in the coming months and you’re going to think that’s fine but if you were smart then you would know it would only increase bitcoins liquidity and dominance in the blockchain space.\n\nIf you don’t understand the value proposition of crypto currency at the moment, you’re going to in the coming years. Especially as banks deny you your hand earned cash, when you’re trying to send money across the country to your family and having to pay a premium to do so, etc...\n\nhttps://www.youtube.com/watch?v=vROTmMzJnXk&feature=emb_title", "score": 1, "replies": [{"body": "I've been involved in the space since 2010 so do not portend to have an educational advantage. You do not. The initial developers of bitcoin who took over after satoshi admitted they failed if measured according to their original goals outlined for blockchain development. There have been key goals that they have failed- one of prime importance was the decentralization goal. The mining power became centralized which results in the undermining of the entire protocol.\n\nLightning network is just another layer, another bandage ontop of a purposefully crippled protocol. I've heard all the nonsense arguments oh one is a settlement layer and the other is a transactional layer. This is just a justification for a shift of control and thus another method of extracting fees.\n\nThat being said the impacts of these technologies cannot be fully understood by anyone as they will unfold over the decades to come. There are improvements, changes, and who knows what will come. However  bitcoin as the  is unlikely to be the dominant player in the future.", "score": 0, "replies": [{"body": "Sure that’s fine, I still wouldn’t bet against Bitcoin. I encourage people to own a little bit of bitcoin and they can choose to explore the rest of the crypto space and what peaks their interests , ethereum and many other coins offer more than what bitcoin does\n\nRegardless of whatever research you’ve done on Bitcoin and about it’s “centralized” you can believe it to be or not. Bitcoin is the only decentralized currency that has never been down in the last 10 years. The resiliency, the network effect, the fact that there is no one who controls bitcoin, and its ability to never have once skipped a beat for 10 years has my trust. The original creator has implemented a inflation mechanism that allows bitcoin rewards by miners to halve every 4 years and it continues to chug along at that exact rate. I think there are many more reasons to bet on bitcoin than to bet against it but it’s everyone’s own choice or logical conclusion right ? Regardless of how “centralized” it is, it is mathematically secure sound money. Good luck to you", "score": 1, "replies": [{"body": "I am very well aware of the block reward size reduction. what do you expect to happen when the block reward becomes ~0? Transaction fees will be the only mechanism to incentivize the miners. Will this be enough? Tx Fees will have increase even more. bitcoin has fallen to rule under a committee. They are not adapting for what is best for the protocol. They are operating to make the most money for themselves", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Because it’s had a nice downtrend already so it’s not as expensive and the halving is this May", "score": 0, "replies": []}]}, {"body": "agreed", "score": 0, "replies": []}]}, {"body": "congrats.", "score": 1, "replies": []}, {"body": "Congrats on getting into the game. What’s your plan with these 13 shares?", "score": 1, "replies": [{"body": "The plan is to hope it makes my money grow!!! LOL", "score": 5, "replies": [{"body": "Yes, that’s always the plan. I’m just wondering what your outlook is currently. For example, if the price rises past X or falls below Y, are you planning to sell? Or are you planning to ride this out to retirement?", "score": 2, "replies": [{"body": "I honestly don't know man. Last night I lost $500 betting on the Seahawks. I'm that type of guy If you feel me", "score": 2, "replies": [{"body": "lmao", "score": 1, "replies": []}, {"body": ">Last night I lost $500 betting on the Seahawks.  I'm that type of guy If you feel me\n\nCome join us at /r/wallstreetbets. One of us.\n\nWhy gain 4% on a rare good day when you can gain 40% while taking a shit on a tuesday.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Thank you bro", "score": 1, "replies": []}]}, {"body": "Kind of late to the party on AMD you should’ve bought when it was $30~ but I’m sure it still has some room to grow. they’re making some very competitive products", "score": -7, "replies": [{"body": "Someone told me the exact same thing a few weeks ago but I went in anyways and I’m up 11%. \n\nYour results may very of course haha", "score": 5, "replies": [{"body": "What made that person wrong? He couldn’t have know the stock would rise 11%. It could have gone the other way as well. AMD is cyclical, and right now it’s really high. At some point it is going to fall. Just like it has done in the past.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "They have done a good job paying down their debt, which they only managed to do via massive share dilution. They still have huge cash flow problems, and they are barely profitable. They also don't have PE ratio of 255, which gives me some 2001 vibes.  \nEven you use the forward PE of 45 that is incredibly high. If you compare their price to the last time they saw these types of profits and revenue, which was in 2010, where the stock price was 8.  \nIf you are seeing something I'm not I would love to hear it.  \nAnd please don't tell me growth. They have seen growth spurts before.", "score": 1, "replies": []}]}]}]}]}, {"body": "Its at a 35 years old resistance. Set your stop.", "score": 0, "replies": [{"body": "Can you write this for dummies LOL. Appreciate it", "score": 0, "replies": [{"body": "Sure. This is the price chart since 1981.\n\n[https://www.tradingview.com/x/ocgbE9mG/](https://www.tradingview.com/x/ocgbE9mG/)\n\nThe $48.75 price was rejected twice, once in 2000 and once in 2006. when you put that with the fact that the price is now at the same resistance point, and that it has gone up 2800% since mid 2015, some other technical indicators that says its extremely overbought (expensive), plus its Price/Earning ratio of 248 (for reference AAPL which is also overbought has a P/E ratio of 26!), That makes it highly likely that the price gets rejected now again.\n\nHope this was clear enough.\n\nLet me know if you have any other questions.\n\nEdit: sorry, not trying to ruin your day! :)", "score": 0, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Sure, i honestly hope it goes another 2800%. I just care more about my risk/reward, which i know is not here.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nothing is crazy enough in this market, everything is possible. Wish you good luck, as long as i get invited to the yacht christening.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Definitely not long AMD, shorting at the first confirmation of a reversal.\n\nWe will see who gets the yacht first ;).", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I wouldn't stand a chance against fundamentals, but i trust my TA a good amount. There might be the greatest company in the world and i wouldn't care, thats the beauty of TA, i don't even have to know the company name, all i need to do is look at the chart.\n\nTesla's fundamentals were garbage and its the most shorted company in history, and i got in at $230 and i am riding this baby till its out of steam.\n\nAgain, thats just me and i am no expert by any means. Only time will tell.", "score": 1, "replies": []}]}, {"body": "RemindMe! One year", "score": 1, "replies": [{"body": "There is a 4.7 hour delay fetching comments.\n\nI will be messaging you in 1 year on [**2021-01-14 00:07:30 UTC**](http://www.wolframalpha.com/input/?i=2021-01-14%2000:07:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/eo6zv2/first_ever_stock_purchased_amd/febmldf/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Feo6zv2%2Ffirst_ever_stock_purchased_amd%2Ffebmldf%2F%5D%0A%0ARemindMe%21%202021-01-14%2000%3A07%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20eo6zv2)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Extremely late to the game", "score": -6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Oh, I say too late to buy AMD, not your introduction to the market", "score": 7, "replies": [{"body": "Compare the market cap of both intel and nvidia and look up AMD market cap. The potential is not gone, it is still there. Just a question of how quickly can AMD approach or if they need time for infrastructure", "score": 1, "replies": []}]}, {"body": "I concur! Better late than never.", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "eo8pho", "created_utc": 1578942785.0, "score": 38, "upvote_ratio": 0.77, "num_comments": 68, "comments": [{"body": "I think I just lost all of my brain cells", "score": 77, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "If they went down everyone would be poor", "score": 16, "replies": [{"body": "except the bears, they would be rich", "score": 2, "replies": [{"body": "No such thing as bears", "score": 10, "replies": [{"body": "\"Bears? Why, I haven't heard that word in years...  \nYes, there used to be bears, grandson. Long ago, before the Great Pump...\"", "score": 9, "replies": []}]}]}]}]}]}, {"body": "Yes u buy calls when u think the market is going down.", "score": 139, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "You really bought $350 TSLA puts expiring in about a week (before even the earnings report)?\n\nIf it does go below $300, yes, you’ll make more money, but those are very likely to expire worthless dude... You’re much more likely to make money going to a cassino and betting everything on red", "score": 32, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No. With 0/00 in some casinos, roulette is the statistical worst odds for your money. The way you compared this to your \"play\" however, is spot on.... You're a damn fool, welcome home.\n\nEdit: post your position btw. You spent like $50 right? You should sell them yesterday and never touch options again.", "score": 14, "replies": [{"body": "Yeah $50 at $0.02, but if I sell the puts do I lose a percentage of the max cost?", "score": 2, "replies": [{"body": "I didn’t get your question, but if you sell for $0.02 you break even, unless your broker charges per contract", "score": 2, "replies": [{"body": "[deleted]", "score": -9, "replies": [{"body": "Please post a screenshot of that stupidity or go troll r/investing\n\nYour story is inconsistent so you are either an amazing source of entertainment (see post your position) or you're getting a 3/10 because I'm responding.", "score": 13, "replies": []}]}]}]}]}]}]}, {"body": "Are you there, Guh? It's me, Margaret.", "score": 9, "replies": []}, {"body": "Dude do your research outside of this place, you're being baited, this place is only good for laughs at the dregs of society that brag about losses and probably have  shit buckets", "score": 6, "replies": []}]}, {"body": "Careful, With this advice he may actually make money", "score": 2, "replies": []}, {"body": "[deleted]", "score": -30, "replies": [{"body": "Shut up", "score": 19, "replies": []}, {"body": "After u have finished trading, you start playing the Seinfield Theme song.", "score": 8, "replies": []}, {"body": "Nerd", "score": 4, "replies": []}, {"body": "why are you lying?", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 35, "replies": [{"body": "I can’t get any of my posts through and this dogshit gets rubber stamped.", "score": 21, "replies": [{"body": "Fucking preach.", "score": 6, "replies": []}]}]}, {"body": "you bought 25 calls and don’t know what a call is", "score": 30, "replies": [{"body": "Imagine if he'd actually bought 25 $350c instead of 350p. $375k of deep ITM calls without knowing what an option was lol", "score": 23, "replies": [{"body": "I was really hoping this sub was going to get to explain to someone that they’re rich.", "score": 10, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "and you have puts", "score": 5, "replies": []}]}]}, {"body": "Do brokers even allow you to make a trade like that without having the money in your account to back it up?", "score": 0, "replies": [{"body": "> Do brokers even allow you to make a trade like that without having the money in your account to back it up?\n\nWhen you buy a call or a put you dont have to \"back it up\", you own it and can sell for the profit.\n\nIf you sell a call or a put, you need to back it up somehow, cash, stock, margin.", "score": 1, "replies": [{"body": "So if I were to fuck up a call, the most I can lose is how much I put into the call? But if I fuck up a put, I can be on the line for more?", "score": -1, "replies": [{"body": "No.\n\nIf you are long (you bought) the most money you can lose is what you put into the call or put. You own it, which gives you the right (but not the obligation) to buy(call) or sell(put) at the strike price on or before the expiration date.\n\nIf you are song (you sold) you *received* the premium as profit. Thats the most you can make on the deal. However, you essentially sold insurance. You have the obligation (not the right) to buy/sell the call or put you sold (you are on the other side of the deal to the person who bought the option). If you sold a put, you better have the ability to buy the stock at the strike price at any time (cash secured, or margin, or w/e). The most you can lose is the strike price * 100 - premium you received. Selling a call can be dangerous, as you no longer need money to finish the deal, you need shares of the stock, which could in theory cost you an infinite amount of money overnight. Its best to only sell calls you have shares for (covered call).\n\nYou can combine these 4 trades (buy/sell call/put) into more complex strategies. For a beginner look at Cash Secured Puts, Buy-writes, and The Wheel.\n\nEdit: Also read and understand what the greeks are.", "score": 3, "replies": [{"body": "Okay, I think I'm kinda getting it. One more stupid question though. If I place a call and the price of the stock goes above the strike price I picked before the expiration date, am I obligated to buy all 100x of the stock in the contract at once or can I like buy/sell/buy/sell individually?", "score": 0, "replies": [{"body": ">  If I place a call and the price of the stock goes above the strike price I picked before the expiration date, am I obligated to buy all 100x of the stock in the contract at once or can I like buy/sell/buy/sell individually?\n\nI assume by \"place\" you mean \"buy\". When you buy, you  have the right, not the obligation. You *could* let it expire and lose all the value it has, your broker may attempt to settle it somehow for you (by exercising or by selling) - *you need to read the rules of your brokerage or at least send them an email asking how they would handle this*. Dont use RobinHood. Its typically better to sell the option, as the fees for exercise are typically higher and you can capture the time value remaining as cash.", "score": 1, "replies": [{"body": "God bless you buddy. Thanks for the advice. I think I'm just gonna stick to traditional stonks, I'll bungle this for sure.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "> normally a bear \n\nExplains the autism\n\n> doesn’t know wtf calls are \n\nExplains membership in r/wallstreetbets\n\nMod/sticky this autism", "score": 22, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 23, "replies": []}]}, {"body": "God bless Robinhood. They really do give options to anybody", "score": 21, "replies": []}, {"body": "Stick to scratch-off tickets, man.", "score": 15, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Then you should REALLY stick to that", "score": 23, "replies": []}]}]}, {"body": "I'm going to laugh hysterically if this position ends up printing. We'll find out Tesla used asbestos in the seats and air system to cut costs.", "score": 13, "replies": [{"body": "Is that when you laugh until your uterus is removed?", "score": 2, "replies": [{"body": "maybe. The right word wasn't coming up on the keyboard so I second guessed the spelling. Fixed now.", "score": 1, "replies": []}]}]}, {"body": "The tism.", "score": 8, "replies": [{"body": "I’m crying right now, this seriously tickled me pink", "score": 6, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I can’t tell if you’re trolling or not, but here. \n\n\nhttps://www.investopedia.com/terms/c/calloption.asp", "score": 3, "replies": [{"body": "So if I'm understanding right it's essentially a premium on 2500 stocks assuming they fall to <$350? Wow that's a lot of leverage...", "score": 1, "replies": [{"body": "No man, if you bought at $500 a share or so, and the stock FALLS to $350, you lose all your money.", "score": 1, "replies": [{"body": "Oh my verbage isn't my strong suit... I bought $350 puts not calls.", "score": 1, "replies": [{"body": "Yes, if you have 25 puts and it falls to $350 you’re filthy rich.", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "W8 you bought $350 puts expiring this Friday. Tesla is trading at $518, you need Tesla to fall $200 in a week to make up for your loss, basically your options are gonna expire worthless, you may want to turn that into a credit spread. Also note that even if a stock moves in your favor you can still loose money, look up the greeks.", "score": 6, "replies": [{"body": "On weeklies He's probably already too theta fucked to make a decent credit spread without exposing himself to massive assignment risk.\n\nBut given RH risk management track record, they might just let him open the short puts.", "score": 2, "replies": []}]}, {"body": "Yes", "score": 4, "replies": []}, {"body": "Yeah you literally just lost all of whatever you spent on those.  Not a snowball's chance in hell tsla falls 150 in a week lmao.  The headquarters would have to be bombed and all Teslas car computers would have to be hacked by Iran to seek out and run over babies and be unable to be turned off", "score": 3, "replies": []}, {"body": "You're not even autistic. Just flat out retarded", "score": 3, "replies": []}, {"body": "Uh oh", "score": 2, "replies": []}, {"body": "\" Okay maybe I messed up, but what are the chances Musk goes for a second offering and stock prices drop? \"\n\nIn the next 4 days?\n\nSlim to none.", "score": 2, "replies": []}, {"body": "Definitely belong here. Good Lord what did you do", "score": 2, "replies": []}, {"body": "Stocks. Down?", "score": 1, "replies": []}, {"body": "Buying Calls are for when you are optimistic about the stock. Buying Puts are when they go down. Selling calls is the same as buying puts and selling puts is the same as buying calls. Stick to buying first. Do not sell yet.", "score": 1, "replies": []}, {"body": "A call is betting that the stock price will go up, not down.", "score": 1, "replies": []}, {"body": "Just remember to do something with the options before close on the 17th or you will lose everything.", "score": 1, "replies": [{"body": "Will I be able to sell them to recoup any losses?", "score": 2, "replies": [{"body": "You can recoup losses by joining bullgang", "score": 6, "replies": []}, {"body": "You can sell your options any time the market is open(but it really depends on you not have a gay broker)\n\nIf the option price is above what you paid for it then you make money, if it goes below what you bought it for then you lose money. \n\nOr you could figure out how to exercise the option but that is capital intensive.", "score": 2, "replies": [{"body": "Only if he can get some dumbass to buy it, tho", "score": 1, "replies": [{"body": "Theta gang here.  I buy back nearly worthless options at 0.05 so I can close out my position and sell chumps more theta", "score": 1, "replies": []}]}]}]}]}, {"body": "I think injust discovered 1 of the way lottery winners end up broke again.", "score": 1, "replies": []}, {"body": "Tsla gonna drop 250 points in 3 days is ur bet?\n\nWelcome home", "score": 1, "replies": []}, {"body": "This is why you always sell premium. As long as RH keeps brining these kids in the bull market wont stop", "score": 1, "replies": []}, {"body": "Pics or ban", "score": 1, "replies": []}, {"body": "Top kek", "score": 1, "replies": []}]}
{"title": "So Puts on $MSFT and $APPLE", "selftext": "This growth is not sustainable. The markets injected with money by the FEDS. The valuation are crazy and it does not make sense that trillion dollar companies are moving like penny stocks. The markets literally being held up by like 10 stocks. This is just not right.\n\n\nPuts on everything.\n\nEDIT! : call on TSM \n\n\n[TSM call ](https://m.imgur.com/a/AxHk5ci)", "id": "eoc7ki", "created_utc": 1578957280.0, "score": 5, "upvote_ratio": 0.59, "num_comments": 71, "comments": [{"body": "Fuck no puts on MSFT, this is the silent juggernaut that keeps chugging along when apple price corrects", "score": 30, "replies": [{"body": "I’m putting puts on everything.", "score": 4, "replies": [{"body": "You must be retarded. Valuation and TA has nothing to do with the constant rally.", "score": 15, "replies": [{"body": "Ok well rally’s don’t last forever retard and when it stops and people actually realize wtf is going on it won’t be good. People are buying on hype. When you buy just because there’s a rally that’s when you get the rug pulled out from under you. Goodluck", "score": 4, "replies": [{"body": "Microsoft is fundementally sound man. It isn't riding the wave like other stocks. Their Azure business alone and future plans show they're damn good at gaining marketshare and propelling growth under Nadella - even with aws competing for the same contracts. As crazy as it sounds it's in another period of growth as a company in multiple services like cloud, AI, AR/VR, hardware, gaming, of course their office offerings. \n\nBet against whoever but Microsoft is a lifetime stock. If you're rationale is \"well they all have to go down sometime\" best of luck correctly guessing when that is \n\nSource: my siblings work there and Microsoft is fucking killing it.", "score": 13, "replies": [{"body": "A lifetime stock FOR sure, let's not forgot that once MSFT hit 1 trillion market cap, it stayed there and didnt sell off like apple and amazon did", "score": 5, "replies": [{"body": "If its for a lifetime why rush and buy today\n\nBuy at 20% off", "score": 1, "replies": []}]}, {"body": "Azure is horrible", "score": 1, "replies": []}, {"body": "If your brother is anything like me he is smashing the refresh button on the charts and praying it keeps going till the stock bonuses vest (if he started withing the last 4 years).", "score": 0, "replies": []}]}, {"body": "People been saying that for years. Good luck with your puts. Easy part is deciding to buy puts, hard part is timing the top. Good luck :)", "score": 4, "replies": []}, {"body": "Show us your puts, mr.", "score": 2, "replies": []}, {"body": "And then your options expire worthless", "score": 1, "replies": [{"body": ".001 isn’t worthless", "score": 3, "replies": [{"body": "Lol neither is my toilet water but i cant find any buyers", "score": 1, "replies": []}]}]}, {"body": "I mean I feel ya dude but you might run outta mulah before you get it right. But then again I haven't tasted a tendie in a while so what do I know lol", "score": 1, "replies": []}, {"body": "I don't disagree with you but people have been making the same good point for 10 years now and it keeps going up", "score": 1, "replies": []}]}]}, {"body": "Your puts will get burned just like the rest of the bears. RemindMe! 1 week", "score": 2, "replies": [{"body": "There is a 4.8 hour delay fetching comments.\n\nI will be messaging you in 6 days on [**2020-01-21 00:32:05 UTC**](http://www.wolframalpha.com/input/?i=2020-01-21%2000:32:05%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/eoc7ki/so_puts_on_msft_and_apple/febrsye/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Feoc7ki%2Fso_puts_on_msft_and_apple%2Ffebrsye%2F%5D%0A%0ARemindMe%21%202020-01-21%2000%3A32%3A05%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20eoc7ki)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Good luck (you will help pay for my calls)", "score": 1, "replies": []}, {"body": "The market can stay irrational longer than you can stay solvent.", "score": 1, "replies": []}]}]}, {"body": "Are you suggesting stonks don’t go up?", "score": 16, "replies": [{"body": "Heresy!! Burn the witch!", "score": 10, "replies": []}, {"body": "Shun, shun the unbeliever.... Shuuuuuuuuunnnnnn", "score": 3, "replies": []}]}, {"body": "People said the same about $TSLA... But look what happened to them.  \n\n\nGood luck.", "score": 8, "replies": [{"body": "These valuations are just not right lol", "score": 2, "replies": []}, {"body": "There not even profitable!", "score": 0, "replies": [{"body": "You should just put all your money on MSFT and AAPL puts. Hell, short BRK.B.  For funsies", "score": 8, "replies": [{"body": "BRK.B might be the #1 best purchase if the market crashes.  500b market cap and they are holding 200b+ in cash.  Pappa Buffet is ready to feast when the music stops.", "score": 6, "replies": []}, {"body": "B? Fuck it, short A on margin.", "score": 1, "replies": []}]}, {"body": "I’ve also looked at this as well. Tesla’s net profit margin is -2.85% and the earnings per share is at -4.78 When this bubble pops, markets will crash. And people will be losing there jobs while the people who had puts are making fucking bank. I wouldn’t mind buying AMZN or AMD puts long term.", "score": 0, "replies": [{"body": "People who play puts will be broke by then and the CEOs who know when the bubbles will burst will be there only ones buying puts", "score": 1, "replies": [{"body": "What retard is going to play puts now? The fed keeps pumping lmao.  Most likely all the way until April. Market will be bullish until fed stops qe, when fed stops, markets will go down and recession would start to happen. A huge catalyst needs to happen though to trigger the recession.", "score": 1, "replies": []}]}]}]}]}, {"body": "What's weird is it took $MSFT 16 years to recover from the dot com bubble.\n\n$MSFT only moved 32% over 8 years right up til the 2008 housing crisis.\n\nand since the start of this bull market after 2008 crisis $MSFT is up 900%.\n\nbasically $MSFT hasn't had this much growth since it ended with the dot com bubble. \n\n$AAPL is a whole different beast. the stock has only moved up since it left penny stock territory.", "score": 9, "replies": [{"body": "> basically $MSFT hasn't had this much growth since ~~it ended with the dot com bubble~~ their monopoly was broken up\n\nFTFY", "score": 3, "replies": [{"body": "what?", "score": 1, "replies": [{"body": "There was an anti-trust suit back in the 90s over Internet Explorer they lost and the company got broken up into seperate segments.", "score": 1, "replies": [{"body": "no, no you are wrong.", "score": 1, "replies": [{"body": "Actually, correction to that. They ended up settling out of court and shared the API.", "score": 1, "replies": [{"body": "I looked into it, competition actually started to exist and that hurt MS stock and worth. it was around the same time as the anti trust case you brought up but that shit got thrown out.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "MSFT is stupid to bet against. Will probably see 50% growth in cloud. They got the new Xbox coming out that doesn’t mean shit for revenue but still good rumor. With how much market share they can still pick up in cloud why shouldn’t this be a 2 trillion dollar company", "score": 6, "replies": []}, {"body": "Seems like a good way to lose money. The top is always in, until it’s not.", "score": 3, "replies": []}, {"body": "*This is just not right* .. the famous last words of all dying men who perish tragically.", "score": 3, "replies": []}, {"body": "You’re joining bear gang too early. Wait another 6 months", "score": 3, "replies": [{"body": "Bullish on TSM. Calls will be bought tm.", "score": 4, "replies": [{"body": "Which ones you going for?", "score": 1, "replies": []}]}]}, {"body": "Yeah you do this while I continue to smile at my 1/15/21 Apple and Microsoft calls that are printing money", "score": 3, "replies": []}, {"body": "It’s crazy tbh, short term AAPL will decrease, long term it will go up", "score": 5, "replies": [{"body": "Agreed !", "score": 2, "replies": []}]}, {"body": "Why don’t you put the order in and then screenshot? Anyone can screen shot the review screen fuck nuts", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I’m expecting a 5-10% market decrease very soon.", "score": 3, "replies": [{"body": "And that'll be bought up in about 1-2 weeks", "score": 6, "replies": []}, {"body": "If we correct 5-10 we are correcting 25-40. Mark it.", "score": 4, "replies": []}, {"body": "Over what time period?", "score": 1, "replies": []}]}]}, {"body": "As Marco from tropoja said “güd luck”", "score": 2, "replies": []}, {"body": "F", "score": 2, "replies": []}, {"body": "Buy puts already then ya pussy. I already tried shorting this beast and got fucked.", "score": 2, "replies": []}, {"body": "Are you serious? MSFT? No matter what happens, Microsoft never lets my down. I literally only goes up.", "score": 2, "replies": []}, {"body": ">puts on everything  \n  \nRetards famous last words", "score": 2, "replies": []}, {"body": "Lol aapl puts i already saw this episode. A remake would still be spectacular", "score": 2, "replies": []}, {"body": "Too early brah", "score": 1, "replies": []}, {"body": "yur a fucking idiot. and yur gay", "score": 1, "replies": []}, {"body": "Gtfo", "score": 1, "replies": []}, {"body": "I sold some aapl puts maybe ill do msft next, thanks for the tip", "score": 1, "replies": []}, {"body": "Man don't try puts on AAPL. Apple's china sales went up and they going to beat earnings the end of this month. Your ass is going to get burned. DONT MESS WITH MY DISCOUNT.", "score": 1, "replies": []}, {"body": "I have my entire portfolio in aapl puts rn. These guys will get cucked n we'll get those bear tendies hehe", "score": 1, "replies": []}, {"body": "How many times does this subreddit have some asshole that thinks Apple puts are a good idea.\n\nDon’t. Do. It.", "score": 1, "replies": []}, {"body": "Agree u nailed it\n\nTrillion dollar companies trading like penny plays including tsla", "score": 1, "replies": []}, {"body": "yeah you are right, selling puts on msft and aapl is a good play.", "score": 1, "replies": []}, {"body": "Worked out well :)", "score": 1, "replies": []}, {"body": "all of you are fuckin retarded please shut the fuck up", "score": 1, "replies": []}]}
