{"title": "[deleted by user]", "selftext": "[removed]", "id": "ewp749", "created_utc": 1580480827.0, "score": 349, "upvote_ratio": 0.98, "num_comments": 66, "comments": [{"body": "Yikes hope you’re rich", "score": 98, "replies": [{"body": "He *was*", "score": 86, "replies": [{"body": "this makes my hands sweat", "score": 16, "replies": [{"body": "Imagine going bearish in AMZN earnings after they admitted several times \"they had the best sales theyve ever had by alot\".   Shoulda set it on fire and posted it on youtube and hoped it went viral.  Better returns lol.", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Just show it", "score": 11, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "8====D", "score": 9, "replies": [{"body": "show bobs", "score": 4, "replies": [{"body": "( . )Y( . )", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Rich enough for some Chinese bats", "score": 5, "replies": [{"body": "and rats and snakes", "score": 1, "replies": []}]}]}, {"body": "*closes PornHub*... Now here's some shit I can jerk off to.", "score": 57, "replies": []}, {"body": "GUH.", "score": 44, "replies": [{"body": "GUH.", "score": 6, "replies": [{"body": "GUHGIDDY", "score": 7, "replies": []}]}]}, {"body": "You lost so that others may profit. Your sacrifice will not be forgotten brother.", "score": 31, "replies": []}, {"body": "Someone on this sub got the other side of that trade.", "score": 29, "replies": []}, {"body": "Respect for posting", "score": 19, "replies": []}, {"body": "Thanks for making us feel better. We were depressed after looking at that +500k play", "score": 26, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Amazon had earnings coming up, why would you sell calls? Sorry about your loss but you can't blame this on Theta gang. Theta gang works always, you just didn't do it right.", "score": 13, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Except un December AMZN said they had their best holiday sales in the history of the company", "score": 9, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "This is complete and utter bullshit when it comes to investors. If AMZN says “our sales were amazing” then you should expect their stock to rise significantly. I sold my shares this morning at open because it will be going back down to 1920 by feb 14th", "score": 9, "replies": []}, {"body": "[you right now](https://i.imgflip.com/3nu8ws.jpg)", "score": 2, "replies": []}]}]}, {"body": "But vega and IV!!!", "score": 1, "replies": [{"body": "Why let things like common sense get in the way of a good YOLO?", "score": 2, "replies": []}]}]}]}, {"body": ">• Theta gang works until it doesn't\n\nDipshit, Theta gang doesn’t ever play earnings.\n\nWould you take a giant shit on the floor and proclaim that shit in the toilet gang works until it doesn’t?", "score": 9, "replies": []}, {"body": "thanks for sharing to the rest of the sub man. \n\nposition sizing is definitely important for that 10-20% chance when it goes horribly wrong so ur account wont get blown up.", "score": 2, "replies": []}]}, {"body": "F", "score": 6, "replies": []}, {"body": "some nigga win the prize of half a mil.\n\nsome nigga donated $53k to the prize such life.", "score": 11, "replies": []}, {"body": "Wait so the people on top with the amzn calls took ur $$$.", "score": 4, "replies": [{"body": "people with debit spreads, yes.", "score": 1, "replies": []}]}, {"body": "Yea... This is the dark side of theta gang they would never tell you..", "score": 4, "replies": []}, {"body": "Well at least you sold spreads, otherwise you and could join stormy giving out handies behind the MacDonald", "score": 3, "replies": []}, {"body": "Burn you motherfcker burn lol", "score": 3, "replies": []}, {"body": "Respect", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Anytime", "score": 2, "replies": []}]}, {"body": "I thought theta gang was primary put credit spreads because stonks only go up???", "score": 2, "replies": [{"body": "That's more of bull gang.  This guy apparently had an Iron Condor because he didn't expect it to move as much as it did (extremely dangerous during earnings, even with IV crush on your side).", "score": 1, "replies": [{"body": "How is IV crush on your side with condor? I do get straddle-strangle swap (double diagonal) with later expiring longs can benefit from IV crush for short legs, but condor??? Mild decrease, yes, but crush??!?", "score": 1, "replies": [{"body": "Maybe not at expiration or if it moves outside the short legs, but as long as the price is still within the body of your condor when it happens, you can close and lock in that profit earlier, rather than risk waiting longer and having it move against you.\n\nYou can simulate that IV crush on thinkorswim.", "score": 1, "replies": []}]}]}]}, {"body": "You dumb bitch.", "score": 2, "replies": [{"body": "Sounded better in the bedroom last night Daddy 🦄🍆🌈", "score": 2, "replies": []}]}, {"body": "You made someone very rich my friend.", "score": 1, "replies": []}, {"body": "i relate to this. also did an IC and got burned. very similar strikes to yours too.", "score": 1, "replies": []}, {"body": "Thanks, now I need to go & change my pant.", "score": 1, "replies": [{"body": "Sell it on eBay and donate 5% to my GoFundMe so I don't need to live in a cardboard box next month  🥺", "score": 1, "replies": []}]}, {"body": "F", "score": 1, "replies": []}, {"body": "What happens if you don’t have the money to pay for your losses?", "score": 1, "replies": [{"body": "I'll be joining ⛈🔜 giving handy's behind your nearest mcDonalds to cover.", "score": 2, "replies": [{"body": "You could be there for quite a few years.", "score": 1, "replies": [{"body": "it's honest blue collar work", "score": 1, "replies": [{"body": "You’d better off going white collar as it’ll hide the stains!", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Oh god! 😂", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Although I haven't done this, my thought would be to play strangles at earnings.  But ehhh", "score": 1, "replies": [{"body": "nah. it might have worked this time but so would calls..80% of the times it doesn't unless you've been holding for a while.", "score": 1, "replies": []}]}, {"body": "Least those weren't naked.\n\nAlso Theta gang and it's not a fun way to make money.", "score": 1, "replies": [{"body": "I'd never do short strangles on earnings. great way to destroy the entire portfolio", "score": 1, "replies": [{"body": "How do you pick names and determine what to sell? IV rank?", "score": 1, "replies": [{"body": "partially, but I only do this on stocks I follow and won't mind bag holding. I also tend to do this on higher priced underlying since moves like this are generally rare. For weekly stuff though, I tend to have my list of favs for put credit spreads : ROKU, GOOG, AMZN, TSLA, SHOP, and /ES, /NQ.", "score": 1, "replies": []}]}]}]}, {"body": "GUH, I lost 26k today shorting AMZN calls.", "score": 1, "replies": [{"body": "that sucks. I would have been only 10k down but i was greedy af.", "score": 1, "replies": [{"body": "No kidding, like you I was banking on 3-4% jump. Funny thing, if I held off from closing till the end of the day, I would've only lost $12k, lol.", "score": 1, "replies": []}]}]}, {"body": "Not cool how some people in here are beating someone down when they're already down.", "score": 1, "replies": []}, {"body": "Going against Amazon is the most retarded shit ever. They are already delivering more packages (their own and others) than FedEx and already catching up to UPS. Retail is dying and Amazon is making sure to eat their meal. On top of that, AWS. \n\nYou are just dumb.\n\nRIP\n\nF", "score": 1, "replies": []}]}
{"title": "Tesla is up 120% since I tried to buy and couldn't because I'm Brazilian and I'm actually depressed", "selftext": "I'm Brazilian. I had 250k to put on Tesla as soon as the truck came out. I signed up to half a dozen Brazilian exchanges, not a single one of them allows us to buy US stocks. I spent a whole work day researching, then I watched some videos and found out the only way to legally do so as a Brazilian is being a qualified investor that has at least $1m in stocks. I gave up and watched it rise 120 fucking % since then. Each rise makes me sad and I try to avoid looking the price but I can't. I'm not complaining at anyone, just venting. I hate my country so much. :(", "id": "ewsqpz", "created_utc": 1580495736.0, "score": 122, "upvote_ratio": 0.88, "num_comments": 67, "comments": [{"body": "You haven't researched enough, there are many options for a Brazilian with BRL 250k to invest in TESLA. You can buy TSLA34 ADR (American Depository Receipt) direct in Bovespa Exchange with any Brazilian broker account, which you can open with as little as 1k BRL. You could also open an international account in Charles Schwab, which would be possible for anyone with an initial deposit of USD 20k, including Brazilians.\n\nSorry, but you really can't complain.", "score": 110, "replies": [{"body": "Shit", "score": 52, "replies": [{"body": "Just buy in now, Tesla 4000", "score": 32, "replies": []}]}, {"body": "I meAn he did spend whole 1 day researching", "score": 21, "replies": [{"body": "He should have spent 5 mins posting to WSB", "score": 8, "replies": []}]}, {"body": "Any idea how I can find an appropriate affordable tax lawyer/accountant to deal with IRS maze if I open this Charles Schwab international account, so my holdings are smoothly transitioned over to my beneficiaries? Any guidance would be super helpful.", "score": 2, "replies": []}]}, {"body": "Here’s a hug from America. 🖕🏻", "score": 142, "replies": [{"body": "Have a happy American life you lucky bastard!", "score": 37, "replies": [{"body": "At least you'll always have off duty cops to keep you safe", "score": 28, "replies": [{"body": "You misspelled shoot you in the back...", "score": 10, "replies": [{"body": "It isn't that bad though, as long as you know where to walk. Right now I'm in a very busy road with a relatively low robbery rate, so it is very unlikely someone will steal my", "score": 42, "replies": [{"body": ">  I'm in a very busy road \n\nConfirmed dead.", "score": 16, "replies": []}, {"body": "i see what you did there", "score": 5, "replies": []}]}]}]}, {"body": "U Venmo me I invest for u we both win", "score": 6, "replies": []}, {"body": "I can't imagine a quarter million dollars to play with in Brazil is a terrible life.", "score": 2, "replies": []}]}]}, {"body": "Should've sent me the money. Id buy them for you and keep a small commission besides taxes. You get the rest.", "score": 35, "replies": [{"body": "Yeah I would have done the same for a very small  20% commission fee plus 10% management fee plus another 5% labor fee.", "score": 15, "replies": [{"body": "And a 69% yolo fee", "score": 9, "replies": []}]}]}, {"body": "Have you tried leaving Brazil? Between the import tarrifs and poverty (I assume favelas are everywhere since I see them everywhere when I travel there), and getting absolutely destroyed in the world cup, I don't know how you tolerate it.", "score": 16, "replies": [{"body": "I don't", "score": 4, "replies": [{"body": "With that much money, you should surely be able to comfortably move to the United States", "score": 3, "replies": [{"body": "With 250k? That doesn't get me anywhere on the US if I understand the situation correctly...", "score": 6, "replies": [{"body": "It may not get you into LA or Miami. But there are many locations in the U.S where you can get by on far below that.", "score": 8, "replies": [{"body": "He needs $900k for an EB-5 visa. \n\nThen he can start worrying about living expenses.", "score": 10, "replies": []}]}, {"body": "Most people don’t even have $300 in their savings accounts here", "score": 7, "replies": []}, {"body": "don’t listen to these retards. with 250k in america you’d live normal. but $250k i assume your living like a king and it’ll go way farther, you must be slaying there", "score": 3, "replies": [{"body": "Probably deals cocaine", "score": 1, "replies": []}]}, {"body": "$250k will get you a student visa at least. That one is actually pretty good from what I’ve heard", "score": 2, "replies": []}, {"body": "Gets you plently bro, there's so many people coming into the country with no money, someone actually interested in investing and contributing to the country will get a high priority", "score": 1, "replies": []}]}]}, {"body": "Aren’t the girls super hot? Why would you care to move?", "score": 2, "replies": [{"body": "they are though", "score": 1, "replies": []}]}]}, {"body": "Big booty hoes everywhere..", "score": 1, "replies": []}]}, {"body": "A friend of mine uses PlaceTrade to trade US stocks, since he can't do so with brokerage firms in his country. The only drawback is that he has to figure out capital gain tax documents for his country himself.\n\nEdit: All you need to do is open an account with a US brokerage firm. The documentation requirement would be different since you are a non-resident (so no Tax ID and no taxes due in US), so some brokers might not support it.", "score": 3, "replies": [{"body": "I have an Interactive Brokers account now, but it is too late. There is no stock that I want to buy right now.", "score": 6, "replies": [{"body": "I have been buying back AMD after their latest ER, I believe it should get back to $50+ in a week or two.", "score": 3, "replies": [{"body": "God I fuckin' hope so. I'm betting on Su to erase my losses on pot stocks.", "score": 1, "replies": [{"body": "ACB to the moon bro", "score": 1, "replies": []}]}]}, {"body": "The fact you won't buy TSLA now makes me really happy. TSLA $1500 CONFIRMED", "score": 2, "replies": [{"body": "nooooo", "score": 1, "replies": []}]}]}]}, {"body": "Is there a Brazilian electric vehicle brand?", "score": 3, "replies": []}, {"body": "How does an off duty cop make 250k?", "score": 3, "replies": [{"body": "corruption.  has a pretty good rate of return", "score": 8, "replies": []}]}, {"body": "You didn't do your research so your pain is self inflicted. You could have easily opened up an account at a us brokerage as a foreigner.", "score": 3, "replies": []}, {"body": "Your women are smoking hot, though.  Win lose draw.", "score": 5, "replies": []}, {"body": "You can open a trading account in USA. All you need is apply for a Tax Id number (TIN) and then open an account with an online broker. You will be subject to tax withholding.", "score": 2, "replies": [{"body": "He doesn't need to get TIN for this purpose, usually non-residents are exempted from paying capital gains taxes (at-least on stocks) in US.", "score": 1, "replies": []}]}, {"body": "F\n\nthat's fucked up", "score": 1, "replies": []}, {"body": "Interactive Brokers takes Brazilian clients. I used them when I lived in Colombia.", "score": 1, "replies": []}, {"body": "If it makes you feel any better, you would have sold at 20% profit", "score": 1, "replies": [{"body": "The worst thing is I actually wouldn't...", "score": 0, "replies": []}]}, {"body": "Tudo bem brotha?", "score": 1, "replies": []}, {"body": "It's all good fam. DM me for my bank account #, you can wire it over to me and I'll buy what you need fam.", "score": 1, "replies": []}, {"body": "I’m pretty sure $250,000 is enough to get you an investors visa", "score": 1, "replies": [{"body": "It is in Malta", "score": 1, "replies": []}]}, {"body": "Bruh you must live like a prince with that kind of money in Brazil.", "score": 1, "replies": []}, {"body": "You may be legit autistic, I'm Brazilian, and I literally opened my second brokerage account last month and put $1000 on it and that's it. \n\nThere's plenty of brokers that accept us poor people, research propertly. \n\nVisit us @ r/investimentos bro", "score": 1, "replies": []}, {"body": "You know there’s brokers and wealth managers from any bank that will easily take $250k and give you access to anything, right ? In the US if that’s not obvious.", "score": 1, "replies": []}, {"body": "Dude, you probably got fucked out of a brazillion dollars.", "score": 1, "replies": []}, {"body": "I wanted to buy into AMD at $2 a few years ago but was too lazy in the end. I'd rather be in your shoes where at least you tried.", "score": 1, "replies": []}, {"body": "Brazilian retard.", "score": 1, "replies": []}, {"body": "Is this why they keep forming those caravans and storming our border?", "score": 1, "replies": []}, {"body": "Dude, hit me up with a DM. I’m an honest guy, I’ll buy your stocks and keep them in my account set up by you, I’ll mail your profits to you monthly, yearly, got leave a bit for taxes, but you know, I’ll hook you up!", "score": 1, "replies": []}, {"body": "It seems like you shouldn’t have decided to be Brazilian", "score": 1, "replies": []}, {"body": "but iqoption is available in brazil...", "score": 0, "replies": []}, {"body": "We hate your country too. Drugs sell well in south america because you people keep buying. Surely there's a way for you to trade your money somewhere. glhf", "score": -2, "replies": []}]}
{"title": "Am I the only one who remembers that just FIVE DAYS AGO we were at literal all time highs, and analysts were calling for Dow 50,000 and world peace was all but assumed to be on the horizon?", "selftext": "[deleted]", "id": "ewu6ev", "created_utc": 1580501602.0, "score": 238, "upvote_ratio": 0.96, "num_comments": 75, "comments": [{"body": "We are still at all time highs. Dow was just at 1,000 in 1980", "score": 26, "replies": [{"body": "PERMANENTLY HIGH PLATEAU STATUS: ACTIVATED", "score": 10, "replies": []}]}, {"body": "Imagine telling your kids they can't go to college  because you lost all their money buying calls at an all-time high, flu or not, lmao.", "score": 131, "replies": [{"body": "Oh well my kids are going to be too dumb for college anyways.", "score": 52, "replies": [{"body": "Hopefully by then Prager U will have a mail-order degree program for them lol", "score": 26, "replies": []}, {"body": "Good for you vaxxing them", "score": 3, "replies": []}, {"body": "[deleted]", "score": -17, "replies": [{"body": "Cuz they’ll be the ones living in your basement with a mountain of debt.", "score": 23, "replies": [{"body": "Dad?", "score": 4, "replies": []}]}, {"body": "I've read some retarded shit on the sub, and this comment wins by far. \n\n*\"I have zero plans of saving...\"*\n\n*\"I had to get loans for my college, why shouldn't they?\"*\n\n**Slave mentality.**", "score": 27, "replies": [{"body": "This is why some families are perpetually in poverty no matter how many generations go by", "score": 9, "replies": []}]}, {"body": "If I have the ability, I will 100% help my kids with tuition.  Why not?  They are my kids, if I don't help them, who will?", "score": 12, "replies": []}, {"body": "[deleted]", "score": 25, "replies": []}, {"body": "This makes me feel so much more successful as a parent knowing that I will be able to contribute to my kids having such a better and more enjoyable life along with a better relationship with my kids in comparison to the future poor lil fucks that /u/HarrisonJC will have and will be experiencing. \n\nMy kids would look upon /u/HarrisonJC's kids and think \"Fuck That Life! How's having a dad that only wishes you to experience the same sufferings he went through during his life?\"", "score": 6, "replies": [{"body": "If your kids look at other children who are less fortunate than them and think \"fuck that kid's life!\" then I think there's an irony here that you're missing.", "score": 1, "replies": [{"body": "thinking \"fuck that kid's life\" doesn't mean they don't respect the kid as a person, they just wouldn't ever want to experience the life that is your kid's. I think \"fuck your life\" to you too, considering the shitty life you've shared with us. It has nothing to do with not respecting you as a person. Your life just sucks, and you want to continue the tradition of passing on a legacy of shitty lives to your kids as well.", "score": 0, "replies": [{"body": "I guess I shouldn't have expected any better from this sub. I like my life, and I hope to raise kind kids one day. And I hope they understand the value of money at an early age, because that seems like a good thing to teach them. That's all. \n\nI'm sure you're a lot richer than I am, true. And if that makes my life shitty and yours great, then I think I'll keep my shitty life.", "score": 2, "replies": [{"body": "I'm not saying being richer makes your life better, but there's plenty of better ways to teach your kids the value of money without forcing them to experience the same suffering you despised. Just because you had to go through a bad phase of life with student loans, shouldn't you wish that your kids don't have to? It's not even about being rich, it's not taking responsibility and giving up on improving your kid's life and justifying it by saying you had to suffer the same.", "score": 1, "replies": []}]}]}]}]}, {"body": "Never have kids. You’re the worst kind of parent.", "score": 8, "replies": []}, {"body": "You sound like a boomer", "score": 7, "replies": []}, {"body": "I have kids,  I hope to pass on some cool shit and maybe some stacks of cash. But that'll be after college.  Every kid I know that went to college on mom's dime either dropped out or got bullshit degrees.", "score": 2, "replies": [{"body": "You sound jealous.", "score": 2, "replies": []}]}]}]}, {"body": "Imagine being retarded enough to think shit goes straight down.", "score": 1, "replies": []}]}, {"body": "BuT It’S jUsT liKE 2008!!", "score": 56, "replies": [{"body": "January 2018.", "score": 6, "replies": [{"body": "If only it was that predictable...", "score": 3, "replies": [{"body": "It was", "score": 1, "replies": []}]}, {"body": "december", "score": 0, "replies": []}]}]}, {"body": "This dip is one that happens during crashes.  It can recover but not intraday", "score": 12, "replies": []}, {"body": "Elon Musketeer will save us", "score": 10, "replies": [{"body": "The ticket to his Mars colony is one share of TSLA", "score": 12, "replies": [{"body": "✅ Funding secured", "score": 7, "replies": [{"body": "Anyone see the Virgin Voyage ads on cable?  Long $SPCE", "score": 3, "replies": []}]}]}]}, {"body": "Some of you guys are so obsessed with 🐻 vs 🐮 that you ignore that shit goes up and down. Even if it mainly goes up it will sometimes go down and get good reason for it to go down would be a potential epidemic.", "score": 15, "replies": [{"body": "Cow?", "score": 19, "replies": [{"body": "Unicorn", "score": 5, "replies": [{"body": "female dog", "score": 3, "replies": []}]}]}, {"body": "I think you mean 🐂", "score": 3, "replies": [{"body": "Nope, what do rhinos have to do with this?", "score": 1, "replies": []}]}]}, {"body": "Am I the only one who's disappointed it isn't the zombie apocalypse?", "score": 15, "replies": [{"body": "It is, but zombie mode is not activated until virus has already spent one year in host.", "score": 3, "replies": []}]}, {"body": "Watching [this video](https://www.youtube.com/watch?v=A-hcbYwuY3g) calms my worries, his videos always make me hold my longs", "score": 10, "replies": [{"body": "27 minutes of \"could be this or could be that, but we don't know either\" lol", "score": 8, "replies": [{"body": "I think you missed the point, it's saying that by quantatitvely studying similar events of the past you can provide statistical probabilities for the future", "score": 7, "replies": []}]}, {"body": "Is that fucking Ray Liotta narrating this thing? Way too funny man", "score": 2, "replies": [{"body": "No clue who that is", "score": 3, "replies": []}]}]}, {"body": "There won't be college once the Corona zombies reach USA", "score": 4, "replies": [{"body": "They are already here.", "score": 2, "replies": []}]}, {"body": "You must be pretty deep in call positions. Please get a hazmat suit sooner than later, brother. I hope to see you when we leave the bunkers. God Speed.", "score": 11, "replies": [{"body": "No one here can afford the bunkers that’s why they are pretending it doesn’t exist", "score": 7, "replies": [{"body": "If you had spy puts you have a down payment on a bunker", "score": 3, "replies": []}, {"body": "bulls been winning free money for 10 years from bears, you dont think there is bunker money on this side?", "score": 1, "replies": []}]}, {"body": "post your own hazmat suit or ban", "score": 2, "replies": []}]}, {"body": "def headed towards 315 perhaps 300 worst case", "score": 5, "replies": []}, {"body": "This \"pull back\" is just a way for the fed to justify the massive pump that's coming. We'll be back to bull mode in a week or two, a month max. \n\nRight now just sit back collect premiums, or buy puts on shitty energy companies until the bull run starts again. \n\nIn Jerome we trust.", "score": 3, "replies": []}, {"body": "Am I the only one who remembers just a few months ago if we didnt have a trade deal the world economies were going to crash? Why tf would you be bullish when that same country that we HAD to have a trade deal with has shutdown at least until feb 8th, because of beer virus? Now flights have been halted...this is a fucking wet dream come true if you're not holding weekly otm calls on spy cuz StOnKs oNlY gO Up.", "score": 7, "replies": [{"body": "I'm new to this sub, maybe you can explain why everyone seems to think being bullish or bearish is part of their identity. \n\nIs it just a meme, an inside joke? Or are there actually people dumb enough to play one side, permanently?", "score": 9, "replies": [{"body": "Generally speaking each persons personality leans bullish or bearish, especially at any given moment. They may change that view but it’s based on how they perceive risk and fear etc.", "score": 3, "replies": [{"body": "Hmmm... I guess I can understand that, even if I don't empathize. My approach is more clinical; math is king, I do as it says. \n\nBut if someone *is* trading based on their own fear, wouldn't actively working against that to break that comfort zone be the productive approach?", "score": 1, "replies": [{"body": "If you’re trading on maths alone and have managed to remove all bias from your calculations, well done to you. But I suspect there is still some bias in your calculations even if it is unconsciously.", "score": 6, "replies": [{"body": "That's 100% accurate, there is. But when my bias and the fundamentals/technicals disagree, I just find a different market.\n\nBrowsing around on here, I've found several instances of people talking about having been losing money all year because the market was in an uptrend and they \"identify\" as bears. \n\nI guess I was just wondering if anyone knew if those were legit, people just trading the way they want and hoping the market moves for them, or if it was just a meme.", "score": 3, "replies": [{"body": "i think its mostly a meme. at least, i hope it is", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I'm down for that. Vulcan trading strategies, inbound.", "score": 1, "replies": []}]}]}]}]}, {"body": "\\*American stonks only go up\n\nRestriction apply to Chinese equities.", "score": 3, "replies": []}]}, {"body": "It go down so it can go up more", "score": 3, "replies": []}, {"body": "this is land of emotional autism, of course you are the only one that remembers", "score": 2, "replies": []}, {"body": "Kids can go to trade school.", "score": 1, "replies": []}, {"body": "Such euphoria", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "french or onion?", "score": 5, "replies": []}]}, {"body": "Live Cat Fall.", "score": 1, "replies": []}, {"body": "#DONT LET THE BEARS WIN THIS", "score": 1, "replies": []}, {"body": "pretty funny, cuz in two weeks time this could all be done and all that money shorts made is back in our pockets.. atleast my tsla calls have continues to fuck the gay ass short short wearing bears", "score": 1, "replies": []}, {"body": "Retards, retards everywhere.", "score": 1, "replies": []}, {"body": "This is why bear gang are terrorists", "score": 1, "replies": []}, {"body": "Je huuurle 😂😂😂", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Fatality numbers lag infection numbers by 7 days.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Perhaps you are correct and this researched is biased. I’m not an expert, just following the news.\n\nWall Street Journal (published 1/27): “U.S. Drugmakers Ship Therapies to China, Seeking to Treat Coronavirus... AbbVie Inc. and Johnson & Johnson are among the drugmakers that have begun shipping drugs approved to treat HIV, while Gilead Sciences Inc. is exploring whether it should send an antiviral therapy it is developing.”\n\nThe study was published 1/30 so it follows. I can’t call it though, there’s too much conflicting info out there.", "score": 1, "replies": []}]}]}]}
