{"title": "TSLA (Tesla) Road map to $1080, then to $648, then to $1425", "selftext": "[removed]", "id": "esnyck", "created_utc": 1579752613.0, "score": 68, "upvote_ratio": 0.84, "num_comments": 71, "comments": [{"body": "Can your magic crayons predict if Tesla goes ups or downs tomorrow?", "score": 40, "replies": [{"body": "If they taste good it goes up, bad goes down", "score": 15, "replies": [{"body": "I prefer Mr.Sketch. Cus I huff markers", "score": 2, "replies": []}]}, {"body": "Up", "score": 6, "replies": [{"body": "Cause stonk", "score": 3, "replies": []}]}, {"body": "Hahah wish I could. How about not worrying about tomorrows price movement? \n\nMay $1000 Calls are $7.20\n\nJust sayin'", "score": 7, "replies": []}]}, {"body": "I hate TA with a passion because it’s retarded\n\nBut I think the current price for TSLA is retarded and so is this market\n\nFor that reason using the negative multiplication rule where negatives times negatives gives us positives, I’ll let this TA slide\n\nTSLA could hit $2k before end of year\n\nCould go up, or down, but probably will go up and surpass BRK.A", "score": 59, "replies": []}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Followed by a 40% pullback and NO consolidation.", "score": 20, "replies": [{"body": "Not my price action. This is what happened in 2013", "score": 5, "replies": []}]}, {"body": "YES ABSOUTELY", "score": 6, "replies": []}]}, {"body": "I will personally buy you 4 top shelf escorts and an ounce of blow for each if your chart is accurate", "score": 16, "replies": [{"body": "Awesome", "score": 3, "replies": []}, {"body": "Can I have one? He only needs 3", "score": 2, "replies": []}]}, {"body": "You just made my dick so hard\nEdit: thanks for the peasents gold", "score": 38, "replies": [{"body": "Happy I could help", "score": 7, "replies": []}, {"body": "So much horny for Tesla.", "score": 8, "replies": [{"body": "many are right now. Public will catch on soon, but by then, it will be 'too late' ... as it usually goes for the retail investor", "score": 3, "replies": [{"body": "Buy high sell low", "score": 7, "replies": []}]}]}]}, {"body": "Have you been eating the crayons too? You're only supposed to draw pretty pictures with them.", "score": 9, "replies": [{"body": "That's as pretty as it's gonna get for now. Glad you appreciate the effort though!", "score": 4, "replies": []}]}, {"body": "A 720 dollar lotto ticket. Fuck I wanna believe so bad. Also op do you have good sources for learning how to do proper ta, I know it's fake and gay but might come in handy if the market starts acting rational.", "score": 5, "replies": [{"body": "With some of the losses I see around here on a day-to-day basis, a $720 lottery ticket ain't so bad. I'm putting in 6k, and holding on for the ride.\n\nGreat place to start your TA journey> Trading in the Zone; Mark Douglas", "score": 3, "replies": []}]}, {"body": "I only buy into TA when my balls are cupped and handled", "score": 5, "replies": []}, {"body": "What about stop loss hunting?", "score": 4, "replies": [{"body": "No stop losses with options, only weak hands. If what the chart is showing is correct, we are currently in the parabolic price expansion phase. That is, small down days, followed by many large up days", "score": 1, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}, {"body": "This was exactly the motivation I needed to pull the trigger on the March $1000 calls I was eyeballing", "score": 3, "replies": [{"body": "Spooky too. See the 5 waves up? That was totally unintentional. God Speed my friend.\n\nI like those March 1000 calls too. I will have to add a small position just in case.", "score": 1, "replies": []}]}, {"body": "So calls until April, puts until May, then calls again until August?", "score": 3, "replies": [{"body": "Ha. Can you imagine the tendies that would print if TSLA were to move some approximation of that? I mean, we would be talking a once in a lifetime opportunity...\n\nBut what the fuck do I know? Hardly anyone can believe the price action that's already happened, so making the most **difficult** trade (being long from here) would really make the most sense.\n\nAs far as a May/June short, I'd really like to see some chart weakness before considering. \n\nThis thing is ripping shorts apart like the Bakersfield Chimp right now", "score": 2, "replies": [{"body": "I’m too poor to afford TSLA calls but I may open up some spreads once I have some more capital", "score": 2, "replies": []}]}]}, {"body": "Buy TSLA $1160 Call 6/17/2022\n\nYOLO", "score": 3, "replies": [{"body": "That's the spirit!", "score": 1, "replies": []}]}, {"body": "LOL. I love how this is on point. I hope you are following through with this", "score": 3, "replies": []}, {"body": "I know. It seems totally improbable for the price to shoot up to over $1000 in just a few months, but keep in mind, markets can be totally irrational for long periods of time.\n\nThis is EXACTLY what happened in 2013 to the price in TSLA.\n\nThe hype surrounding TSLA now is probably even higher than it was then, so a repeat of this price movement seems totally reasonable when you think about it.", "score": 4, "replies": [{"body": "It takes real courage to draw \"Stonks go up\" 🙄", "score": 5, "replies": [{"body": "and down (occasionally, for short periods of time)", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "link or it doesn't exist", "score": 0, "replies": []}]}, {"body": "I saw this same pattern. Thanks for confirming my bias. Brings comfort to my 690s and 900s", "score": 2, "replies": [{"body": "No shit?", "score": 1, "replies": [{"body": "On the monthly chart I noticed the stair step moves since IPO. I used fibs and have a target of 1199ish by june.", "score": 2, "replies": [{"body": "Damn man. That is really eerie. We both arrived at a very similar price at a nearly identical time utilizing totally different methods.", "score": 1, "replies": [{"body": "Well there was 10k oi on the 800 when they first releaso them on rh. Don't think we are alone.", "score": 2, "replies": []}]}]}, {"body": "https://www.tradingview.com/x/sghKzn6X\n\nI tried to clean up some other shit I have all over it, but hopefully that shows the gist.", "score": 2, "replies": [{"body": "I can't really tell - Is your chart showing any topping and pullback after June and then rally to higher highs? What about after this massive move (if it were to happen of course)? My honest guess would be another 6 years of consolidation between $700 and $2000", "score": 1, "replies": [{"body": "I measured about how long the last move took. Which was 6 months. The June monthly contracts were the closest.\n\nFor the range, that sounds good. I haven't mapped anything out though.", "score": 2, "replies": []}]}]}, {"body": "i agree with your graph, but my bet is that it will be less abrupt", "score": 2, "replies": []}]}]}, {"body": "god damnit bobby", "score": 2, "replies": []}, {"body": "Remind me! May 15th", "score": 2, "replies": []}, {"body": "RemindMe! 5 months", "score": 2, "replies": [{"body": "I will be messaging you in 22 days on [**2020-06-23 09:43:56 UTC**](http://www.wolframalpha.com/input/?i=2020-06-23%2009:43:56%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/esnyck/tsla_tesla_road_map_to_1080_then_to_648_then_to/ffbmg5m/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fesnyck%2Ftsla_tesla_road_map_to_1080_then_to_648_then_to%2Fffbmg5m%2F%5D%0A%0ARemindMe%21%202020-06-23%2009%3A43%3A56%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20esnyck)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Found Elon's Reddit account", "score": 2, "replies": []}, {"body": "So, this is the top then.", "score": 2, "replies": [{"body": "Perhaps. This is simply some food for though", "score": 1, "replies": []}]}, {"body": "Cool chart. Hope it’s right, but TA makes no sense to me. The Tesla Germany Giga could have a super shitty launch and have lots of QC issues or something and tank the stock back into the 300s. How does TA account for hype based on news, earnings reports, crucial milestones for the company? The historical charts reflect those so you’re just projecting future events based on past milestones. Makes no sense to me.", "score": 2, "replies": [{"body": "Just so you know, TA comes in many forms. This is my stab at a harmonics based theory off of a 6 year long consolidation pattern. Is it right, is it wrong? We will just have to wait and see,\n\nAlso, I would NEVER speculate on this type of long-term TA analysis to lead anything, because it's purely a guess on my part. Take what I've shown here and make your own decision on whether or not it makes sense.\n\nThat being said, for shorter TimeFrame TA, the technicals ALWAYS lead the news. Not ther other way around.\n\nEdit; In case what I say was confusing, I'll just give a quick example. Intc chart to me showed an extremely high probability of releasing great earnings today because of the way the technicals were setting up, so I purchased a few ITM INTC calls the other day.\n\nI also said last week that TSM chart setup looked very weak to me, so I was staying away on earnings. They blew earnings out, but the stock didn't move. \n\nThis would be my example of 'good news' lagging the technicals. \n\nOf course, just like anyone, I'm not always right. Sometimes the technicals are more murky than other times...\n\nNFLX technicals looked decent to me ahead of earnings, but it was down 3% after earnings then up 7% the very next day (very strange)", "score": 2, "replies": [{"body": "Thanks for taking the time to write a thoughtful response to my criticism lol. I can see TA being useful for intraday trading but quickly lose its merit for anything longer than a few weeks just due to the news/milestone factor IMO. Anyhow, interesting nonetheless and I hope you predict accurately", "score": 1, "replies": []}]}]}, {"body": "Im confused this isn’t flaired as a shitpost", "score": 2, "replies": [{"body": "Would that help you? Let me ask the mods.", "score": 2, "replies": []}]}, {"body": "My TA is saying your robinhood balance is gonna lose another 10k.", "score": 2, "replies": [{"body": "Chart please", "score": 1, "replies": []}]}, {"body": "I’m starting to think you’re right about this.", "score": 2, "replies": [{"body": "But... but TA is total BS for retards, and can't be used in any meaningful way. That's all I keep hearing. \n\nFuck market patterns - they are TOTALLY AND COMPLETELY MEANINGLESS - Jim Simons,  Renaissance Technologies", "score": 1, "replies": []}]}, {"body": "Harmonics is bollocks FYI.", "score": 2, "replies": [{"body": "100% wrong. It's cool though if that's how you feel", "score": 3, "replies": []}]}, {"body": "Double itself again? Probably not.", "score": 1, "replies": [{"body": "most DEFINITELY not. Especially since Ralph Nader yesterday said that Tesla is wildly overvalued and will single-handedly tank the stock market:\n\n [https://finance.yahoo.com/m/352d7108-f695-382b-8da0-e4cf4ecd5051/tesla-will-mark-the-beginning.html?.tsrc=rss](https://finance.yahoo.com/m/352d7108-f695-382b-8da0-e4cf4ecd5051/tesla-will-mark-the-beginning.html?.tsrc=rss) \n\nYou should probably sell short", "score": 1, "replies": []}]}, {"body": "This has aged fairly well", "score": 1, "replies": []}, {"body": "Can’t get over how accurate this turned out to be", "score": 1, "replies": []}]}
{"title": "Quick tendies $NFLX", "selftext": "", "id": "et1l5f", "created_utc": 1579822483.0, "score": 294, "upvote_ratio": 0.97, "num_comments": 70, "comments": [{"body": "*autistic cave man noises*", "score": 130, "replies": [{"body": "Oughhhhh auurrrrfph", "score": 13, "replies": []}, {"body": "Oooohh ugh ugh ugh", "score": 8, "replies": []}, {"body": "[*rabble rabble rabble*](https://www.youtube.com/watch?v=WnRzSHTrQtw)", "score": 3, "replies": []}, {"body": "*inserts penis*", "score": 1, "replies": [{"body": "***turns on garbage disposal***", "score": 0, "replies": []}]}]}, {"body": "*Moans in retard*", "score": 80, "replies": []}, {"body": "***IF ITS GOOD ENOUGH TO SCREENSHOT ITS GOOD ENOUGH TO SELL REMEMBER BOIS***", "score": 30, "replies": [{"body": "Hope he held! Would be up another $8 bucks", "score": 5, "replies": []}]}, {"body": "I lost big on earnings and held because fuck taking 10% back and doubled my position and now I'm up 680% today and almost 9% overall on it. Need a green day tomorrow so I can sell, I was in a meeting and missed the 7 dollar run-up to close", "score": 55, "replies": [{"body": "What was the bullish catalyst?", "score": 11, "replies": [{"body": "Smashing every single metric in their ER but people being too retarded to understand subscriptions are a 0 sum game.", "score": 19, "replies": []}, {"body": "Everyone who said they were cancelling Netflix never actually did and internationally they are gobbling up new subscribers. I think NFLX is still the best streaming platform currently on the market", "score": 6, "replies": []}, {"body": "tendies", "score": -4, "replies": [{"body": "You son of a b*tch, I'm in.", "score": -4, "replies": []}]}]}, {"body": "There's no need to sell unless you have a huge position.", "score": 2, "replies": []}, {"body": "You know you can set profit targets and calculate how much your contracts will be worth right?", "score": 2, "replies": [{"body": "Yeah but I'm a degenerate", "score": 2, "replies": [{"body": "https://lmgtfy.com/?q=Options+calculator+app\n\nYou lazy fuck", "score": 1, "replies": []}]}]}]}, {"body": "All time chart or BAN\n\nWhat time today did you purchase these? Like 2 hours before bell close today? Gain was only 200%. If you purchased these close to bell opening, gains would have been closer to 5,000%   I'm guessing", "score": 17, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Bought a spread before the call and bailed on it after, while trying to figure out why it was tanking.  \n\nI should have just skipped trading and watched porn on Wednesday.", "score": 5, "replies": []}]}, {"body": "*squaks in autist*", "score": 8, "replies": []}, {"body": "Catalyst was how fucking Comcast was bleeding streaming subscribers and market realizing that Netflix has no reasonable competition", "score": 8, "replies": [{"body": "Its funny they beat total subs by 1 million, more than doubled earnings, but because they only added 550k domestic instead of 590k despite increasing sub costs analysts went full retard. Goes to show how dumb the analysts really are", "score": 13, "replies": [{"body": "Exactly. The real growth story is international subscribers. Obviously every blue blooded American already has Netflix.", "score": 3, "replies": []}, {"body": "They only doubled earnings because of a fat tax credit they cashed in this year. EPS would have been in line with analysts predictions without it", "score": 0, "replies": [{"body": "Source that 400Million tax credit please", "score": 1, "replies": [{"body": "Go look at their income statement man, oh I forgot this is wsb we don't do that here", "score": 0, "replies": [{"body": "Its not there my guy\n\nhttps://s22.q4cdn.com/959853165/files/doc_financials/2019/q4/Q4'19-Website-Financials.xlsx", "score": 1, "replies": []}]}]}]}]}, {"body": "Get some roku", "score": 1, "replies": []}]}, {"body": "You buy before earnings?", "score": 6, "replies": [{"body": "must have purchased an hour or so before bell close today. If he purchased before earnings, this trade would be negative most likely", "score": 6, "replies": []}]}, {"body": "bruh how did you know it was going to go up?", "score": 5, "replies": [{"body": "if you know then it ruins the fun. research is gay", "score": 14, "replies": [{"body": "Then call me Freddie Mercury cause I would self amputate my left nut to be able to see 5 minutes into the future just once a week", "score": 5, "replies": []}]}, {"body": "[removed]", "score": -14, "replies": [{"body": "Lmao", "score": 4, "replies": []}]}]}, {"body": "Post all time", "score": 3, "replies": []}, {"body": "Cries is Caucasian", "score": 2, "replies": []}, {"body": "Show all time", "score": 2, "replies": []}, {"body": "What time did you buy these at today? And man you got cohones I could never pull the trigger on that", "score": 2, "replies": [{"body": "Purchased a $355 call around 12pm CST today.. up 71%. Was down almost 50% most of the day until rally at last hour.. logged in to green!", "score": 3, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "You sound like such a fuckin loser", "score": 2, "replies": []}]}]}, {"body": "Did u sell? Might hold til 360", "score": 1, "replies": []}, {"body": "SEXY.", "score": 1, "replies": []}, {"body": "Oh my puts!!!", "score": 1, "replies": []}, {"body": "More gains to come.  The pullback after earnings was one to buy.  It's already breaking out after the pullback.", "score": 1, "replies": []}, {"body": "Have an iron condor that maximizes profit around the current. Hope it doesnt move too much up or down.", "score": 1, "replies": []}, {"body": "When did you purchase these you baboon", "score": 1, "replies": []}, {"body": "I bought this stock at 364. I've been waiting a long time for this.", "score": 1, "replies": []}, {"body": "Fuck that's nice \n\nEdit: I hope you sold before the dump", "score": 1, "replies": []}, {"body": "reVerSE GUH", "score": 1, "replies": [{"body": "HUG?", "score": 1, "replies": []}]}, {"body": "How come when I try to close out my put credit spreads on Robinhood, even if I'm above the strike price they ask me to add more fucking money? I thought I could close out with a partial collection of collateral? What am I missing here, shit got me afraid to join theta gang.", "score": 1, "replies": []}, {"body": "In the immortal words of our lord and savior, Bartholemew Simpson,\n\n \"¡Aye, caramba!\" \n\n\n\nDaddy likes...", "score": 1, "replies": []}, {"body": "Fuck\n\n&#x200B;\n\n&#x200B;\n\nYou.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "current price of contract at time of screenshot = 4.23 per share in contracts\n\n4.23/3.13333333 (current price over 213.33333% gain) = 1.35 starting price\n\n(4.23-1.35) x 50 contracts x 100 shares per contract = $14,400 gain\n\nthe appeal of options is you don't have to exercise when you're winning, you can just exit by selling the contracts, and the contracts grow/fall much faster than the underlying stock price.\n\nyou can make money on meme otm calls that have no hope just because their price will go up if the stock rallies and some memer is gonna buy them hoping the memeing continues (this only works on high volume meme stocks)", "score": 3, "replies": []}, {"body": "Greek, motherfucker! Do, you, speak, it!?", "score": 3, "replies": []}, {"body": "The contracts' value went tf up", "score": 2, "replies": []}, {"body": "Imagine you have a watermelon. You bought it for three dollars. News comes out that watermelons cost $10 now because of some shit you don’t understand. Your watermelon is now worth $10. Where did the $7 come from? That’s where this motherfuckers tendies came from.", "score": 2, "replies": []}, {"body": "You see, it's the *implication* of profit that makes this profitable.", "score": 2, "replies": []}, {"body": "the value of his investment at expiration if the underlying stock price is 345 is 0. there's value attached to the contract as there is still time to expiration. so yeah, stonks go up", "score": 1, "replies": []}, {"body": "Learn how to use google", "score": 1, "replies": []}]}, {"body": "Saw it moving today, i knew some of ya'll jumped on this.\n\nNever a dull day.", "score": 0, "replies": []}, {"body": "Holy shit you missed out on alot of money. I bought 3 of that same call this morning for 2.06 and sold at 6.65 before lunch.", "score": 0, "replies": []}]}
