{"title": "Major Tesla short seller, Mark Spiegel cuts TSLA short position in half. For 2019, his fund was -6.5% while the S&P +31.5%. (top of page 2)", "selftext": "", "id": "eiopng", "created_utc": 1577916996.0, "score": 170, "upvote_ratio": 0.98, "num_comments": 68, "comments": [{"body": "This is an individual who purposefully perpetuates lies about Tesla and Elon Musk. He has a history of being horrifically crass (what he said about Greta and other women on Twitter). I don’t feel any sympathy for this person.", "score": 79, "replies": [{"body": "Yep fuck him,  he's also put himself in a bubble and trading purely on his hate.", "score": 43, "replies": []}, {"body": "I saw the Greta thing, too. So uncalled for. It is really going out of one's way to be an asshole.", "score": 35, "replies": [{"body": "I just looked this up.  What a scumbag.", "score": 3, "replies": []}]}, {"body": "He also said that a 16 yo cannot be sexually molested if she has anything less than 34 size breasts.\n\nhttps://twitter.com/rgz175/status/1207157602255290369?s=09", "score": 10, "replies": [{"body": "Holy shit. I'm all for making blue, deeply off-color jokes. But there is zero that can be read into this as funny. It's very creepy and a bit horrifying.", "score": 9, "replies": []}, {"body": "Suddenly I dont feel so bad that I made money off someone like him. In some way I'm glad that he still sticking to his short position, it will only get worse.", "score": 1, "replies": []}]}]}, {"body": "Shed no tears for this FUDster.", "score": 43, "replies": [{"body": "lets hope Tsla bankrupt him tomorrow else it is just going to give the douche more ammo to brag about.", "score": 2, "replies": []}]}, {"body": "Boy there was a lot of copy and paste from the last letter. And it didn't take him long to put the letter out, early January 1st lol", "score": 21, "replies": [{"body": "Start to think he will never reduce his short position just to keep on ranting in those horrible emotional letter. His must acquire his client by the same principles as Nigerian scammers. Just filter for the dumbest early on. They will be on board until the end.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Eh?  I suppose the Long TSLA bit depends on the specifics.  I did better than any index (I think)...  I'm up 101%, 60%/yr.  Some of the shares are over 6 years old, but we averaged down like crazy around 200.", "score": 4, "replies": [{"body": "The specifics are based on this article which mentions the 2019 performance.", "score": 4, "replies": []}]}]}, {"body": "Mark tweeting out the letter: https://twitter.com/markbspiegel/status/1212389652562415616\n\nSad for them. This is their third down year. Since inception, they are up 53% compared to S&P 187%.\n\nFunny enough, I retweeted Mark, asking if they cut their short position in half and Mark blocked me within a few minutes - on NEW YEARS DAY! hahah.  For someone who derides others as snowflakes....   \n\nHere is the most relevant bit from their letter:\n\n> 2) I cut the Tesla equity short position down to approximately 10% of the fund (it had most recently been 20% and was often higher in the past)and—barring unexpected positive developments for the company—will maintain it at around 10% going forward. Unlike our other equity shorts which were \"just bubbles,\" there's major league fraud involved here and all the Fed printing in the world won't ameliorate that; I thus want to have some meaningful equity participation in addition to our short call position, which we’re also maintaining", "score": 26, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "He thinks elon is making up the numbers on the balance sheet out of thin air.", "score": 16, "replies": [{"body": "so he doesn't source any claims?  or he just makes batshit crazy arguments? i don't follow any of these people so this mindset is new to me.", "score": 5, "replies": [{"body": "He was bringing up how they only made a profit because they lowered the warranty amounts on the cars thus boosting profits.", "score": 3, "replies": [{"body": "So making the cars more reliable is fraud now?", "score": 2, "replies": [{"body": "Welcome to the thinking of Mark Spiegel. His fund is down like 25% in the last 3 years whereas the market is up like 50", "score": 1, "replies": []}]}]}]}, {"body": "Could tesla and elon sue him for defamation?", "score": 4, "replies": [{"body": "Yes, but then media would talk about it non stop, and people woul dbe like \"wait theres fraud at Tesla? didnt know that\"", "score": 1, "replies": []}]}, {"body": "didnt SEC just finish an investigation into Teslas accounting?", "score": 3, "replies": [{"body": "If you're asking me I don't know. The lawsuit that just ended was the defamation one with Vernon Unsworth, maybe you're thinking of that.", "score": 2, "replies": []}, {"body": "yes, the sec looked at q3 and cleared it.", "score": 2, "replies": []}]}]}, {"body": "A broad brush to cover his lies", "score": 10, "replies": []}, {"body": "They eRRR cooking ZE bOOKsssssssss\n\nBut nevermind the regular audits from the SEC and all the unfair scrutiny Tesla has been under because of these fudsters.", "score": 1, "replies": []}]}, {"body": "Why did you ask him if he cut his short position in half?  To rub it in?  Or did you not know he already announced that?\n\nI mean, the guy is complete slime.  But I’m not sure how you would expect anything other than him blocking you.", "score": 6, "replies": [{"body": "I'm not an investment professional. I wanted to make sure I wasn't misreading it. I was pretty shocked, actually.\n\n..but ... also to rub it in a little bit.  :/  AITA? Sorry.\n\nHere is my tweet: https://twitter.com/rio517/status/1212496402431053824", "score": 21, "replies": [{"body": "MSITA", "score": 3, "replies": [{"body": "That would be NTA in official parlance.", "score": 2, "replies": []}]}, {"body": "10/10 tweet.", "score": 1, "replies": []}]}]}]}, {"body": "*The only way for Stanphyl Capital to be profitable once again is to go public and short itself. $TSLA $TSLAQ #Tesla*\n\n\n\nhttps://twitter.com/Shalxxx1/status/1212488935865274369", "score": 19, "replies": [{"body": "Wouldn't shorting yourself create a paradox and destroy the fabric of spacetime?", "score": 3, "replies": [{"body": "Accounts Receivable frod Is worse bRUH !!!!", "score": 2, "replies": []}]}]}, {"body": "Wow looking through his Twitter history. This guy is a real piece of ****! Glad he won’t stay solvent long enough.", "score": 8, "replies": [{"body": "People keep him alive to keep doing what he does.\n\nEven if Tesla gets to a point where they ship more cars than Toyota this guy will keep posting the same crap.", "score": 1, "replies": []}]}, {"body": "I just read the entire letter and it's so funny all the claims that Mark makes, like last year when he said the jaguar i-pace and etron would destroy the market for Tesla and since then they've sold less than 10k in the united states. I love seeing him be proven wrong again and again.\n\n&#x200B;\n\nAlso, doesn't this guy only manage like 10 million dollars?", "score": 6, "replies": [{"body": "I was looking for some kind of totals, but it's all percentages.  It could be $1000.  Does anyone know?", "score": 4, "replies": [{"body": "I thought I saw that 10M a year or so ago.", "score": 2, "replies": []}]}, {"body": "I know people with that in their 401k.  He really isn't a fund manager if thats all he is managing.  Not sure why he gets so much press.", "score": 3, "replies": [{"body": "Both sides and all that.", "score": 1, "replies": []}]}]}, {"body": "At what point does a fund manager shut down and return the money to the investors?", "score": 12, "replies": [{"body": "When people stop letting him invest their money?", "score": 20, "replies": []}, {"body": "Individuals investing in Spiegels fund do not care about ROI from the fund, they just need more FUD against tesla because they have larger positions in oil and gas.", "score": 2, "replies": []}, {"body": "When he feels bad about his fund.", "score": 0, "replies": []}]}, {"body": "This is a person who really needs to take emotion out of it. Doesn't he get it? People don't care about any of the negativity surrounding Tesla. Look at the q4 delievery event. 5+hr wait time, hundreds of people. They don't care..I understand you think AP kills, Tesla catches on fire, Elon is a nut case..sure..believe it all you want..but people who pays Tesla $$$ give two fucks about it and that's a huge ass problem for your short thesis. Yes..believe how they like the apple crowd are all delusional..believe it all you want, but that doesn't stop these companies from printing money. It's idiotic at this point. It's like trying to stop a train with a rope.", "score": 6, "replies": []}, {"body": "I wonder how much of him actually believe the lies he’s spreading and how much of him actually just acts along just to keep his face on. He had his mind set long ago, but now that he’s been proven wrong for months upon months... He’s clearly ego driven, but I wonder how much he actually believes in the alternative reality he lives in.", "score": 4, "replies": []}, {"body": "Jan 2020 will be tough for Mark Speigel\n\nhttps://mobile.twitter.com/ElonsWorld/status/1204074581226594306/photo/1?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 10, "replies": [{"body": "Bahahahha, this is wonderful. Fuck him", "score": 8, "replies": []}, {"body": "I sure hope he held on to those and they weren't part of the cut in his position.", "score": 3, "replies": [{"body": "They're likely already near 0 anyways by this point", "score": 4, "replies": []}]}, {"body": "This is great! Thanks for sharing!", "score": 4, "replies": []}, {"body": "Holy fuck...", "score": 1, "replies": []}]}, {"body": "Omg this is so sad.", "score": 3, "replies": []}, {"body": "Just hate to see it when an \"expert\" performs worse than stuffing your money in a mattress.", "score": 7, "replies": []}, {"body": "The letter is absolutely riddled with emotion and absurd, unfounded statements.\n\n&#x200B;\n\nPlease take the time to read it.\n\n&#x200B;\n\nAmazing example of clouded judgement.\n\n&#x200B;\n\nPoor Mark, he's such a gentleman. Couldn't be happening to a nicer guy.", "score": 2, "replies": [{"body": "The format is similar to what you'll see on some of the political subs. Lots of emotion, meandering and weird trains of thought, overemphasized conclusions, and then a wall of links that try to support the arguments.\n\nHe's obviously spending most of time following the Tesla story and fuming over every little bit of news or tweet.\n\nPolitical subs are the same way - a politician will do something iffy, and someone will immediately make a huge angry post with lots of links trashing whatever the politician did and calling for immediate arrest.\n\nIt's a very strange mindset that's very divorced from how the world actually works. It's holding onto parts of the story, e.g. 420 tweet, that almost everyone put behind them but that Mark thinks is still a key underpinning of his thesis.\n\nIt's almost as if Mark sees Musk as a sort of anti-god, infallible and all-knowing, and therefore anything Musk does can't just be a mistake and something Musk can correct in the future. It HAS to be part of some big conspiracy that Musk perfectly planned 15 years ago.\n\nWould love to read some psych analysis on these kinds of people.", "score": 1, "replies": [{"body": "> Would love to read some psych analysis on these kinds of people.\n\nHere, I stole this from his shrink:\n\n- Did not receive enough attention from parents during childhood\n- Was never loved unconditionally, only praised for accomplishments\n- Was never told \"You're good enough\"\n- His most important of the 6 human needs is SIGNIFICANCE, it drives everything he does\n- He meets that need for significance by being a wiseguy, making highly provocative and outrageous comments, insulting people, and most importantly, by being RIGHT\n- He must--ALWAYS--be right because, by being RIGHT, he gains significance and in his mind, becomes \"enough\" to be loved\n- He will lead himself off a cliff chasing this need for significance\n- We will continue weekly sessions for some time...", "score": 2, "replies": [{"body": "Wow. That's both hahaha and frighteningly accurate at the same time. Well done!", "score": 2, "replies": [{"body": ":)", "score": 1, "replies": []}]}]}]}]}, {"body": "What's the size of this guy's fund?", "score": 1, "replies": [{"body": "A few million, less than 10 I think.", "score": 1, "replies": []}]}, {"body": "So in the letter to his investors he talks almost exclusifly about a single investment that is just 10% of his fund? I'm starting to think that his investors find that acceptable because he is the only remaining investor in his fund.", "score": 1, "replies": []}, {"body": "Thank you for fact check.\nMaybe Mark Spiegel just wanted to buy back TSLA", "score": 1, "replies": []}, {"body": "All around bad person judging from his tweets. Also this guy is loud but not a major short because he manages a tiny fund.", "score": 1, "replies": []}]}
{"title": "Real reason Intel why failed to deliver 10nm for so long is because of feminism", "selftext": "[removed]", "id": "eim1g2", "created_utc": 1577904978.0, "score": 88, "upvote_ratio": 0.63, "num_comments": 72, "comments": [{"body": "Intel wished they got Su Bae instead", "score": 100, "replies": [{"body": "Su, who happens to be a asian and a woman. Haterz gonna hate asians and women idk why?", "score": 8, "replies": [{"body": "[removed]", "score": 12, "replies": [{"body": "She’s related to the ceo of nvidia. I guess it runs in the fam", "score": 1, "replies": []}, {"body": "So the other asian women are...asian and women first but not quality like Su Bae because they are just being objectified bc they are asian and women loop de loop\n\n+ when will asian women be treated fairly for their quality instead of being objectified as asian and women?\n\n+ perhaps if more asian women had opportunities to succeed then there would be more successful asian women like Su Bae?", "score": -9, "replies": []}]}]}, {"body": "Nah. Ellen Pao.", "score": 1, "replies": []}]}, {"body": "I think you’re wrong OP. Clearly a lesbian dance theory degree is necessary to build CPUs for computers.", "score": 86, "replies": []}, {"body": "So where does Su Bae fit in all this?", "score": 56, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Jensen Huang is Lisa Su's uncle.", "score": 2, "replies": []}]}]}, {"body": "You should create an inverse ETF with Intel, Citi, and Estee Lauder. $INCEL", "score": 82, "replies": [{"body": "u/ControlTheNarrative can YOLO Robinhood's money into weekly options on it", "score": 8, "replies": []}, {"body": "Then we market it to passive autists", "score": 8, "replies": []}]}, {"body": "I read the whole thing thinking I was in the amd subreddit and thought \"holy fuck someone forgot their medication\". Only after reading some of the comments, I checked the sub and realized this is actually quality wsb DD", "score": 34, "replies": []}, {"body": "So you are saying Carly Fiorina should be Intel CEO ?", "score": 15, "replies": []}, {"body": "controlthenarrative alt?", "score": 63, "replies": [{"body": "I have no idea why some ppl think we're full of incels and are toxic. It's soooo strange.", "score": 39, "replies": []}, {"body": "Lol was thinking the same thing", "score": 6, "replies": []}]}, {"body": "can confirm, computer science major. 200-300 person lectures average about 3-4 girls total. Had a few in group projects and they didn’t write a single line of code. Am virgin. Pay for sex and get denied then hooker beats me up for money that I make nerding out with my autistic knowledge of basic logic and google searches.", "score": 50, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "When I was in college, in the entire Computer Science Department, there was 10 women for my graduating class. We had close to 700 students.\n\nFunny enough, the Mathematics department had more women.", "score": 2, "replies": [{"body": "There seem to be a lot more women in math and statistics, including data science, than in CS/engineering", "score": 1, "replies": [{"body": "Better looking women in the math during college also as you had all the soon to be math teachers taking classes.", "score": 2, "replies": []}]}]}]}, {"body": "avg graduating gender ratio for women in CS and Computer Engineering is 2% in North America.", "score": 2, "replies": []}]}, {"body": "CTN, is that you?", "score": 14, "replies": []}, {"body": "I’m pretty sure you are gay bro", "score": 50, "replies": [{"body": "Didn't the mods make it clear to you, too, that being gay is a requirement to get into this sub?", "score": 21, "replies": []}]}, {"body": "Coincidentally, OP’s penis is 10nm.", "score": 27, "replies": []}, {"body": "Incel DD", "score": 55, "replies": [{"body": "[deleted]", "score": 33, "replies": [{"body": "Did your mom give you permission to come out of the basement?", "score": -2, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Hard same", "score": 2, "replies": []}]}, {"body": "Its called Intel not Incel", "score": 13, "replies": [{"body": "Incel inside!", "score": 2, "replies": []}]}, {"body": "If there is one thing hardware engineers hate more than showering and basic hygiene, it’s taking photos.  They probably wheeled out the most photogenic staff members from accounting, legal, etc.", "score": 9, "replies": [{"body": "this guy gets it.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Vote for Trump", "score": 7, "replies": []}, {"body": "First step [midget dating site](https://www.littlepeoplemeet.com)", "score": 1, "replies": []}, {"body": "You're on WSB so you're 🌈. You have by definition, shorted wonder.", "score": 1, "replies": []}]}, {"body": "Lmfao, boy am i not surprised that you post in /r/shortcels. Get a grip on life you degenerate.", "score": 17, "replies": [{"body": "That place is delusional. I'm 6'2\" and still can't get laid. Turns out you need some \"personality\" bullshit.", "score": 17, "replies": []}, {"body": "Wow, that place...", "score": 9, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "Have you tried not being retarded ?", "score": 14, "replies": []}]}]}, {"body": "non sequitur buddyyy", "score": 5, "replies": []}, {"body": "listen for semiconductors  you need Taiwanese these ppl got fucking chip design gene in them.", "score": 2, "replies": []}, {"body": "Real reason OP why failed to deliver 10cm for so long is because of incelism", "score": 2, "replies": []}, {"body": "There are studies from HBR, McKinsey etc that show how gender diversity makes no difference in the tech, utilities and industrial sectors yet companies still dump millions into it. it only helps a little where women are the consumers of the business like healthcare etc. Equality of outcome 🤮", "score": 2, "replies": []}, {"body": "Leftist company culture is enough DD for me, intel puts en route.", "score": 5, "replies": [{"body": "puts are retarded even if the company is braindead\n\nbuy calls on their competition", "score": 4, "replies": [{"body": "Oh thats right, I forgot that stonks only go up. AMD calls it is", "score": 4, "replies": []}]}]}, {"body": "This is happening in every major US company. The bigger they are, the more this is present in my experience. \n\nSome companies are on a 3-5 year crash course because of this shit and they don't see it coming.", "score": 3, "replies": []}, {"body": "Imagine blaming minorities and women for your problems 😂", "score": 7, "replies": []}, {"body": "This post is by far the dumbest post I’ve ever seen on this subreddit.", "score": 3, "replies": []}, {"body": "Sounds like Boeing.....\n\n\" Boeing makes strides in diversity and inclusion\"\n\n [https://www.boeing.com/features/2019/05/diversityinc-top-50-05-19.page](https://www.boeing.com/features/2019/05/diversityinc-top-50-05-19.page)", "score": 2, "replies": []}, {"body": "The real reason your mama failed you is because she didn’t swallow", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Is it an ironic meme or serious? I cant tell", "score": 1, "replies": []}]}, {"body": "Didn’t they hit a 52 week high not too long ago", "score": 1, "replies": []}, {"body": "Reminds me of that time they built that Sweetwater diversity bridge in Florida.", "score": 1, "replies": []}, {"body": "Maybe that's why their CPUs use makeup pads instead of solder for the IHS.", "score": 1, "replies": []}, {"body": "OP REALLY hates the Mongols holy shit", "score": 1, "replies": []}, {"body": "See also HP", "score": 1, "replies": []}, {"body": "That’s because women have smaller brains then men.  \n\nThe world chess championship is opened to all players, but no woman has ever make the candidate games because they don’t have enough brain power.  They have to create a separate woman world chess championship just for women.", "score": 1, "replies": [{"body": "NBA NHL etc is also open to women! Problem is U15 teen boys with avg age of 13 can destroy the countries Female soccer team (Australia) or when Serena Williams can't score against a dude ranked 200th in the world.", "score": 1, "replies": []}]}, {"body": "Google is next!", "score": 1, "replies": []}, {"body": "I'm convinced, intel calls it is..", "score": -1, "replies": []}, {"body": "It's the exact opposite of what you say, any woman capable enough to achieve a C-suite position in a semiconductor company is going to be better than 90% of her peers. The problem is Intel had a retarded man (Kraznich) who only elevated females to high positions in order to fuck them. \n\nCompare this to a female CEO like Lisa Su and the relative performance of both the stock and the company is night and day. Women are (generally) better than men at things because they have to be. You could make a convincing argument that the best men are better than the best women at certain things, I guess, but that would only describe statistical anomalies.", "score": -24, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I feel like evil morty provides a different perspective to this skew. Somewhere out there, there’s a female evil morty. Finna get riggidy wrecked son", "score": 1, "replies": []}, {"body": "If that's true I'm surprised I never heard it to be honest, though IQ is just part of the patriarchy anyway.", "score": -5, "replies": []}]}]}]}
