{"title": "poor fscomeau is broke", "selftext": "[removed]", "id": "4pvqkn", "created_utc": 1466908412.0, "score": 53, "upvote_ratio": 0.84, "num_comments": 75, "comments": [{"body": "I feel like this is a bit of a misrepresentation.  \"Broke\" means you don't have any money.  He says in the video that he has fifty cents left.  That's more than enough to buy a share of MSTX.", "score": 130, "replies": [{"body": "Don't you fucking dare put that idea in his head, I think half of WSB has their entire portfolio in there. If he jumps in we'll all be in the inflatable Mickey mouse yacht club.", "score": 38, "replies": []}, {"body": "Am I misunderstanding his portfolio picture? I see many thousands of dollars of stock in his portfolio, it's just down 3/4/7% across some of them, he's still worth a heap unless he margin loaned it?\n", "score": 3, "replies": []}, {"body": "YOLO", "score": 3, "replies": []}, {"body": "> That's more than enough to buy a share of MSTX.\n\nWhat  about fees?", "score": 1, "replies": [{"body": "rh", "score": 3, "replies": [{"body": "Can you really do a 50 cent robinhood account with no fee?", "score": 2, "replies": [{"body": "I just made a limit order for 1 share @ $0.43. ", "score": 3, "replies": [{"body": "Limit order for 1 share @ $0.36.  Gfy", "score": 3, "replies": []}]}]}]}]}, {"body": "LOL!", "score": -1, "replies": []}]}, {"body": "Gambling addiction is a serious thing, folks.", "score": 58, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "This isn't fun anymore.", "score": 40, "replies": [{"body": "reddit's fuckin shit yo", "score": 14, "replies": []}, {"body": "Speak for yourself. Amusement and concern aren't mutually exclusive in my book.", "score": 1, "replies": []}]}, {"body": "I want to troll his live stream pretty bad", "score": 8, "replies": []}]}, {"body": "It was a SURE thing though!", "score": 4, "replies": []}]}, {"body": "[removed]", "score": 55, "replies": [{"body": "just typical addict stuff.\n\nattention seeking.\n\nmanipulation.\n\nlying.\n\nand ofc the gambling on 50/50 events.", "score": 22, "replies": [{"body": "AK v QQ all day baby", "score": 5, "replies": [{"body": "TILTED", "score": 2, "replies": []}]}]}, {"body": ">  I'm pretty sure he has a mental illness.\n\nYou just figure this out? ", "score": 21, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "I've been saying this seriously for about two years now.\n\nHe's either mentally ill or it's all really weird performance art. And he's been leaving less and less room for it to be the latter. \n\nBut it's the intenet, what you gonna do?", "score": 6, "replies": []}, {"body": "question still stands", "score": 2, "replies": []}, {"body": "I think I may change my vote from Fremain to Frexit...", "score": 2, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "you think the guy that released a book about child murder on christmas eve has a mental illness?", "score": 8, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "2k?  that's all he lost?\n\nand he dares to make a gofundme page?\n\nwhat a fucking cunt", "score": 40, "replies": []}, {"body": "I didn't watch the whole video, but I still don't see a single fucking screenshot of his actual losses.\n\nI mean, it would be easy for him to FAKE a fucking screenshot and he doesn't even bother doing that. I think he's full of shit.", "score": 31, "replies": [{"body": "For someone who supposedly made A FUCK TON off his DWTI short earlier this year 10 and 20k loss puts him no where near being broke. Even if he didn't make that money from DWTI I've seen his stock portfolio from when he first started streaming all that time ago, no way all of that magically turned to 0. Its so fake. ", "score": 6, "replies": []}, {"body": "Plus stocks don't drop to zero. Yea you may lose a lot but you won't sell off at $0.50.", "score": 5, "replies": [{"body": "With leverage, you can get your investments to drop to negative.", "score": 8, "replies": []}]}, {"body": "on his last few second...he shows few of his trade.\n\nYea....the loss is really not impressive.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 27, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "But at the same time is [hitting on underage girls in a lifting sub](https://www.reddit.com/r/formcheck/comments/4p6mqx/form_check_5x50kg/d4igeep?context=3).", "score": 7, "replies": [{"body": "Isn't 17 legal in more states than not?", "score": 1, "replies": [{"body": "doesn't mean its a good idea tho", "score": -2, "replies": []}]}]}]}, {"body": "fscmoeau is mentally ill. Ken M is just a troll.", "score": 2, "replies": []}]}, {"body": "There are lies, damned lies, and fscomeau.  He [said](https://www.reddit.com/r/wallstreetbets/comments/4pf5x1/if_brexit_happens_i_will_be_bankrupt/d4kgpye) he was:\n\n> 1) Super long on US stocks\n> \n> 2) $10k on brexit not happening on bet365\n\nand said he ended up losing $20k.  Now it's pretty hard to lose $10k being \"super long\" on stocks with a 1.5% dip on open, unless you have some massive stock holdings.  \n\nEven with leverage and a 10% loss he should have $30k-50k left. (assuming we think *anything* the dude says is true)\n", "score": 14, "replies": [{"body": "If you also remember, he posted a pic of his account saying he was up 6.66% or some shit, and some dollar amount. I calculated his account size to be about ~230k (I don't exactly remember). He has deleted the post a while ago, wish I had a copy. Troll of the century right here.", "score": 2, "replies": []}]}, {"body": "1. He is an author AKA professional bullshitter. He could work for WSJ. \n\n2. He said 4 hours ago, \"Monday at bell opening, I am going to massively short the S&P500 by short selling the SPY\"", "score": 11, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nope, still there:\n\nhttps://www.reddit.com/r/wallstreetbets/comments/4puqu9/ladies_and_gentlemens_its_officially_time_to/", "score": 3, "replies": []}]}, {"body": "good. i need a bounce.", "score": 1, "replies": [{"body": "Hopefully my UWTI goes through the roof.", "score": 1, "replies": []}]}]}, {"body": "Mother**fucker** isn't even subscribed.", "score": 8, "replies": [{"body": "Subscribing is so 2013\n\nAlthough it kind of sucked when schrelli put the sub to private...", "score": 2, "replies": []}]}, {"body": "his gofundme is next level trolling\n\ni'm actually impressed", "score": 10, "replies": []}, {"body": "http://imgur.com/YUENQJz", "score": 6, "replies": []}, {"body": "Dude is actually scary as fuck. Who would be that obsessed with pedophiles and do break down analysis of their interviews and write books on them?", "score": 8, "replies": [{"body": "I had an addictions professor who did something similar. He would frequent clean forums where they would talk about their lives-like any other community forum. He would post online based questionnaires and tests among other data collection methods to study the population, from how they make decisions to events in childhood.\n\nHe was raided by the FBI under suspicion of soliciting images. They found nothing on his computers, so the case was dropped.\n\nMaybe that will happen to this dude.\n\n", "score": 3, "replies": []}]}, {"body": "man faking all these posts is one thing but setting up a gofundme is pretty slimey.", "score": 6, "replies": [{"body": "He deleted it though. I don't know what to believe anymore", "score": 1, "replies": []}]}, {"body": "What is wrong with his voice? Is he an autist? ", "score": 4, "replies": [{"body": "I think he is French Canadian, so pretty much...", "score": 5, "replies": [{"body": "Yep. There generally terrible people who feel very self entitled... Sort of like how the bottom of the barrel thinks there cream of the crop.", "score": 1, "replies": []}]}]}, {"body": "I read an interesting article on a smart guy's site titled \"GoFundMe is Beyond Dumb, it’s Criminally Stupid\".  Maybe fscomeau should read that first: http://www.fscomeau.com/driving-drunk-and-end-up-being-paralysed/", "score": 3, "replies": [{"body": "It was studied [time.com](http://dangerousminds.net/comments/pedophiles_harassed_by_pedophilophiles)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "I wish the french Canadian had a sign beside there user names so you could specifically avoid any of there messages...", "score": 6, "replies": []}, {"body": "This guy is a attention seeking whore... Stop feeding his troll attempts", "score": 2, "replies": []}, {"body": "gambling addict. hope he gets help. id advise against funding him. its not grocery money its more gambling money.", "score": 2, "replies": []}, {"body": "All he has to do is reset his paper account..problem fixed ", "score": 2, "replies": []}, {"body": "From the Amazon Book Review\n\n> It might be easy to say that a book so replete with spelling and grammatical errors on nearly every page should not be taken seriously as a work of literature. NO! This is shortsighted and ignorant. Much like Lorne Armstrong, the man, Lorne, the novel, is a monumentally flawed creature. But this is by design. Trevor, a French Canadian, whose native tongue is not English, I believe deliberately avoided proofreading or spellchecking the final manuscript as a tribute to its imperfect subject. At some point, the myriad of errors simply becomes part of the novel and enhances the story. It reminds us: who are we to judge? This was a brilliant play by Trevor.", "score": 2, "replies": []}, {"body": "[Fscomeau-\" Gofundme is beyond dumb it is criminally stupid\"](http://www.fscomeau.com/driving-drunk-and-end-up-being-paralysed/)", "score": 2, "replies": []}, {"body": "Why people upvote his posts, believe his stories, amounts of money, comment about him on here, and now give him money is not anything I understand. It's like acting like a 12 year old investor is celebrity worthy around here. ", "score": 2, "replies": [{"body": "> acting\n\n", "score": 1, "replies": []}]}, {"body": "Ya'll are just getting trolled by this guy, posting links to all of his shit. ", "score": 1, "replies": []}, {"body": "he is an idiot, thinks indicators don't work , he deserved to lose ", "score": 1, "replies": []}, {"body": "Who cares! Mind your own portfolio!", "score": 1, "replies": []}, {"body": "His accent reminds me of Chistopher Lambert.  There can be only one.  Lmaoooo", "score": 1, "replies": []}, {"body": "what a loser. ", "score": 1, "replies": [{"body": "like what kind of retard puts all \"everything\" on every side of the same bet. you deserve to lose everything. ... especially the bet that everyones taking... follow the sheep to slaughter. fuckin slaughtered.  PS get a fuckin job not a gofundme page. ", "score": 1, "replies": []}]}, {"body": "he has to be trolling. 8 per - cent?!?! 13 per - cent?!?!\n\nLOL", "score": 1, "replies": []}, {"body": "He said it's a prank. \n\n[Youtube vid](https://www.youtube.com/watch?v=ZEtkSwdJhgU)", "score": 1, "replies": []}, {"body": "At least pump up his amazon reviews so he can earn some $ back!", "score": 1, "replies": []}, {"body": "THIS VIDEO IS (LITERALLY) A JOKE\n\nFS uploaded a video 6 hours saying that it is all a stupid joke:  https://www.youtube.com/watch?v=ZEtkSwdJhgU", "score": 0, "replies": []}]}
