{"title": "India may look to woo Elon Musk's Tesla with five-year tax cuts on EV imports - Times of India", "selftext": "", "id": "17ud7jk", "created_utc": 1699889656.0, "score": 248, "upvote_ratio": 0.87, "num_comments": 71, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|750|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "*Try my googy googy!*", "score": 33, "replies": [{"body": "Michael, this is racist!!!", "score": 6, "replies": []}]}, {"body": "Was back home recently, and every other car was a Tata EV. Most people I know now have an EV they use as a daily driver + another ICE/hybrid machine used for long distances. \n\nBut Tata EVs are cheap, so Tesla would fill the demand for people who want EVs but don't want something more premium (which would be a pretty huge number if they implement the Supercharger network properly).", "score": 8, "replies": [{"body": "Actually it doesn't seem all that common yet but yes among EV tata dominates. You will see the occasional Mahindra and Hyundai(rare).\n\nRegarding Tesla - well there are an insane number of people here will mad amounts of money for expensive cars. Audis, Mercs and BMWs have become a daily sight on most roads even in suburban areas of metro cities. We were expecting Tesla however to come manufacture here a car completely for Indian market. If they can sell cars at rates the Korean automakers do then even middle class people will buy Teslas easily.", "score": 1, "replies": []}]}, {"body": "If they can sell within $25k, tesla is literally going to moon!!!", "score": 7, "replies": []}, {"body": "Idk how in tf they would afford them", "score": 5, "replies": [{"body": "You might be underestimating how wealthy certain percentage of Indians are.", "score": 132, "replies": []}, {"body": "India has 1.5 billion people.\n\nJust the top 5% alone is still 75 million people with lots of money..", "score": 91, "replies": [{"body": "Per India salary tax data, if you made $13k USD last year, you would have been in the top 5% in India. \n\nTop 1% made 66k USD, so that's 13M people where a $40k+ car is potentially affordable (but still kind of a stretch). \n\nLooking at it a different way - for the luxury goods players, India is a similar sized market to Hong Kong or Australia, and you probably need a similar amount of disposable income to buy a Tesla as you do to buy a ~$8k Chanel, since the Chanel is cheaper but also less essential to daily life than a car. Markets like Australia are worth participating in for a player like Tesla, but not going to move the needle compared to China, the US or Europe.", "score": 4, "replies": [{"body": "Salary isn't the important metric, top 5% of wealth is. \n\nExample, even in Canada the top 20% of salaried income earners are nowhere close to being able to buy a single family home, but the top 20% of the wealth is able to easily.", "score": 6, "replies": [{"body": "Okay, in India the top 5% by wealth is 45k USD, so if you own a Tesla and literally nothing else, you're in the top 5%. Given that most people would prefer to own a home than a premium car, by this metric a Tesla is still pretty out of reach until you get to the top 1%+.\n\nIn general, the gap between developed and developing countries is actually even bigger looking at wealth than it is looking at income, since families, governments and institutions in rich countries have had more time to accumulate wealth. \n\nIn that context, looking at income actually overestimates the market size of developing countries relative to developed countries. The mitigating factor is that wealth is sometimes even more unequal in developing countries than in developed countries.", "score": 3, "replies": []}]}]}, {"body": "I come in the top 1% of earners in India. Yet I can't fathom buying 5000$ car let alone a 50000$. Add multiple layers of tax that we have here for imported and luxury vehicles and the price will be around 120000$. \n\nTLDR Not happening", "score": -13, "replies": [{"body": "You’re not in the top 1%. The top 1% income threshold is a crore-ish. A $5000 car is cheap.", "score": 23, "replies": [{"body": "5000 pre tax boi, and no, its not in the crores, a monthly salary over 50k inr per month will land you in less than 1%", "score": -15, "replies": [{"body": "Where did you look this up? Top 1% threshold is 1.44 Crores. About $160,000. Which is in monthly about 1,100,000 INR. Quite a bit higher than 50k. Did you check your info or just making shit up?", "score": 15, "replies": [{"body": "Pretty sure you’re mixing up 1% networth with salary. No way 1% salary is 1cr+", "score": 4, "replies": [{"body": "You’re right. Net wealth top 1% is 1.44 cr . And income for top 1% is 0.55 cr.", "score": 8, "replies": []}]}, {"body": "i make my shit up", "score": -12, "replies": []}]}]}]}]}, {"body": "More like the top 1%. 5 percent will still not even have middle class purchasing power compared to a developed economy.", "score": -11, "replies": []}, {"body": "[removed]", "score": -21, "replies": [{"body": "Bro You're clearly tight about something else lol. Get off Reddit and learn about the world.", "score": 14, "replies": []}, {"body": "It seems very obvious that you got easily scammed by someone. \nDont worry they will come and take your job and kick you out of yours", "score": 10, "replies": []}, {"body": "Perfect example of 9gag kids hitting puberty", "score": 9, "replies": []}]}]}, {"body": "All the macro numbers about india do not reflect how large and diverse india is.\n\nThe tragedy of india is that there are some states with Thailand/Malaysia level wealth and then there are some states with African country level wealth.\n\nInternal wealth inequality between states is insane. \n\nSo there are plenty of states where Tesla will sell well, as long as they price it under $60k. With India’s size, that’s a significant market", "score": 61, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "In 20-30 years you guys are going to have fun with climate change. USA ain’t any better but we have way more air conditioning\n\nTruth hurts downvoting Indians 🤡", "score": -23, "replies": [{"body": "Not if you havent shot each other", "score": 13, "replies": [{"body": "Still less of a shithole than India", "score": -10, "replies": [{"body": "not for long . \n\nwith how poor americans are getting day by day , they will be a shithole country soon enough \n\non the other hand india lifted record number of people from poverty in recent years. atleast it is looking much better for indians than it does for americans", "score": 10, "replies": [{"body": "Come back to reality. The majority of us, especially our major city centers, are at a standard of living 99% of your population will never experience. America is absolutely on the decline, but it’s still at a higher level than India will ever achieve", "score": -1, "replies": [{"body": "did you even read what i said. i did accept that indian living conditions arent as great as it is in USA \n\nbut they will eventually catch up to USA . with standard of living declining in USA at alarming rate , i wouldnt be surprised if they would catch up in a decade or two.", "score": 8, "replies": []}]}, {"body": "You are all literally still dumping corpses into the river and your air is toxic. \n\nhttps://www.thenationalnews.com/business/economy/2023/11/13/why-indias-air-pollution-is-also-suffocating-economic-growth/", "score": -3, "replies": [{"body": "air is toxic in all of india ? you realise that is bullshit you are speaking right \n\nhave you ever even lived in india ? i can tell you have zero idea what  most of the cities even look like.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You're right, the majority of Americans are ignorant and uneducated. They get their information from propaganda news sources and don't have any real-life experience. This is why we can't expect anything more than ignorance from them. For Americans, every country is shit except Japan. They don't understand what's happening in the world or how the US is losing its battle against other countries. People in the US don't get proper education like we do in India because the government makes colleges and universities too expensive for most people to afford.", "score": 2, "replies": [{"body": "Based Vmod.", "score": 1, "replies": []}]}]}, {"body": "You're arguing with a WSBer who is no smarter than the average American with a room temp IQ.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "No they aren’t and it’s peanuts compared to what we’re still dispensing \n\nHate to say it but india is fucked", "score": -1, "replies": []}]}]}]}, {"body": "according to this article, tesla will be looking to sell at $25k so people can afford it.\n\nAnything higher than that is way too expensive and I don't see why people would prefer it over Tata EVs or any other Indian manufacturer.\n\n[https://timesofindia.indiatimes.com/auto/policy-and-industry/can-teslas-affordable-indian-evs-become-a-headache-for-tata-motors-mahindra/articleshow/101762035.cms?from=mdr](https://timesofindia.indiatimes.com/auto/policy-and-industry/can-teslas-affordable-indian-evs-become-a-headache-for-tata-motors-mahindra/articleshow/101762035.cms?from=mdr)", "score": 10, "replies": [{"body": "Love me some tatas", "score": 9, "replies": []}, {"body": "Brand craze.", "score": 10, "replies": []}]}, {"body": "India went free market in 1992.. the bizmen got fucked for 50 years. There is a good reason indians moved out and did well.", "score": 1, "replies": []}]}, {"body": "Then You might be surprised to know rich people exists in countries outside US and UK.\n\nMercedes-Benz, BMW and Audi have recorded record numbers in the first half of 2023.\n\nhttps://auto.economictimes.indiatimes.com/news/passenger-vehicle/luxury-car-market-in-india-poised-for-record-sales-in-2023-after-stellar-h1-numbers/101842494", "score": 11, "replies": []}, {"body": "Dude India not only has millions of wealthy people they love to SPEND.", "score": 11, "replies": []}, {"body": "Tesla is trying to make a cheaper car over there", "score": 3, "replies": []}, {"body": "Most people have no idea how poor Indians are. Only 3% earn $4K pa. Only  0.1% earn over 35K.\n\nMost Western companies leave India when they discover the **real** market for high end products is only the size of a single US state.", "score": -2, "replies": [{"body": "Most Western countries leave India or other Asian countries like China or SEA because they could not crack the code to operate in these markets.\n\nUber had to leave China and SEA because they simply could not compete.\n\nMarket exists, but they lack understanding and if they approach it like any other American city they are bound to fail.", "score": 3, "replies": [{"body": "Best way to enter Indian markets is to license the whole thing out to an Indian company. Like Starbucks did with Tata and McD did with hardcastle restaurants.", "score": 4, "replies": []}]}, {"body": "Still if you go to India, you won’t be able to afford a house in big cities.", "score": 3, "replies": []}, {"body": "What kind of BS are you shitting? The top 1% income threshold for India is $144,000. 1% is about 12.5 million people. That’s a huge customer base.", "score": 3, "replies": []}]}, {"body": " Short-sighted and narrow-minded regards are best regards\n\nlol", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This is not surprising, given that India has a much larger population than the US. However, it is still noteworthy that so many people in India can afford luxury cars. This indicates a growing middle class with disposable income.", "score": 2, "replies": []}]}]}, {"body": "pleas help them.\n\nthey are paying M4 money for a civic.", "score": 1, "replies": []}, {"body": "Short shorts are covering.$TSLA still has alot of growth left globally. \n\nhttps://preview.redd.it/gn2od4ray40c1.png?width=223&format=png&auto=webp&s=16d01060712a9a25ff98aeb4b82d939071e80951", "score": -5, "replies": [{"body": "No it is overweight", "score": 1, "replies": []}]}, {"body": "Bleep Bleep Bleep, hopefully no - this guy is a man-child and we don't need people like him.  There are plenty of other companies that are up and coming in EV space.  TSLA should be considered as bad as Chinese companies.", "score": -12, "replies": [{"body": "While I don't like Musk, I don't want to cut the technology out of spite.\n\nTesla has a lot of good tech in the automotive and green energy industry", "score": 2, "replies": []}, {"body": "Agreed. The local Indian brands are already making some really good affordable EVs in India. This asshole will spoil the market.", "score": -1, "replies": []}]}, {"body": "Puts on Tesla. My bet is Chinese EV manufacturers will win.", "score": -1, "replies": []}, {"body": "Doesn't this help Gogoro a bit more?", "score": 0, "replies": []}, {"body": "What about the interstate taxes?", "score": -1, "replies": []}, {"body": "If you think this is bullish.. China's gonna retaliate, just watch.", "score": -1, "replies": []}, {"body": "Whoopin out the cobra snake flute", "score": -17, "replies": []}, {"body": "Show me bob", "score": -14, "replies": []}, {"body": "That would be a big mistake for Tesla, about the only places worse to do business than India in are: Argentina, Russia, Iran, and North Korea.", "score": -29, "replies": []}, {"body": "1 year later: indian EV comapny comes out\n\nSame mistakes willingly made in china will be repeated here.", "score": -19, "replies": [{"body": "India doesn’t force companies to have a local partner like china does….google,meta,amazon all operate in india while they are banned in china…india hasn’t banned any american companies like china does…the only thing they ask western companies is to contribute to their economy(employment and investment) if they are going to disrupt local companies.", "score": 14, "replies": []}, {"body": "india already has in-house built EV’s from tata and mahindra.", "score": 2, "replies": []}]}, {"body": "Indian govt is using Elon musk as a trumpcard, to add up pressure to the local auto companies to innovate. It takes much more than elon to beat Maruti Suzuki. When Suzuki goes full steam on EV, Tesla would be needing US govt support to survive", "score": -12, "replies": []}]}
