{"title": "Factors which affect the price of gold?", "selftext": "Hi everyone. I'm new to reddit and also a newbie trader (using just a few hundred dollars of throw away money in order to figure out what I'm doing). Recently, I've been curious about gold and have feverishly been searching the web about factors which drive its price movement. \n\nHowever, it seems to be a bit unintuitive and traditional factors such as inflation and fed rate changes don't seem to be the entire picture from what I have seen.\n\nBasically, I was hoping someone could explain to me the basics of the gold market, or forward me other sources. Additionally, the relationship between physical gold and gold miners is a little blurry for me too and it would be nice to know a little about that as well.\n\nThanks in advance :)", "id": "7709q2", "created_utc": 1508262603.0, "score": 7, "upvote_ratio": 0.73, "num_comments": 16, "comments": [{"body": "1) I've seen gold act more as a contra-currency than an inflation hedge during times of sovereign or currency instability. I think ZIRP has really reforged what gold means which is really ironic given the endless doomsaying we've heard for the last 10 years. \n\n2) The juniors react crazy with gold price because they are all hedged/leveraged and so  a small move in physical gold price has a disproportionate impact on their stock price.", "score": 3, "replies": [{"body": "Thanks for taking the time to reply! It makes sense for gold to be inversely proportional to currency now that I think about it. Makes me see it in a whole new light! ", "score": 1, "replies": []}]}, {"body": "Don't forget about neutron star collisions!", "score": 3, "replies": [{"body": "I’ll make sure to add it to my due diligence  ", "score": 2, "replies": []}]}, {"body": "You'll get better returns trading silver. I made some coin off of USLV a couple months ago. It's a leveraged ETF but don't let that scare you. Silver and gold prices are directly correlated. Both are inversely correlated to value of the dollar. Market uncertainty will drive up the value along with the potential of more war, ie. North Korea.", "score": 3, "replies": [{"body": "Thanks for the info!", "score": 1, "replies": []}]}, {"body": "[Look through these](http://www.scotiamocatta.com/reports/mr_overview.htm)", "score": 3, "replies": [{"body": "Awesome resource. Ty!", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Just curious then... with all of the risk and uncertainty associated with today’s political climate, why has gold not skyrocketed the last several months?", "score": 2, "replies": []}]}, {"body": "Supply and demand. Since the marketplace has no control over supply, it is primarily demand.\n\nGold is seen by many as an alternative currency to dollars, euros, or whatever. For those who do, uncertainty is the biggest factor in price on whether or not price goes up or down.", "score": 2, "replies": []}, {"body": "Following!", "score": 2, "replies": []}, {"body": "peoples minds", "score": 1, "replies": [{"body": "Guess gold isn’t so different than other financial instruments after all :)", "score": 1, "replies": []}]}, {"body": "Soros and the Rothschilds. That's how I know what silver and gold prices will do. YOLO", "score": 1, "replies": []}]}
{"title": "nice little cramer bit on earnings. Pretty good.", "selftext": "[deleted]", "id": "76wivj", "created_utc": 1508218484.0, "score": 17, "upvote_ratio": 0.83, "num_comments": 20, "comments": [{"body": "He is saying buy Paypal? He's just saying the new price of 75 might be hard to reach. I believe paypal can hit 72 no problems, but 75 might be a tall order. I bought in at 68 on Friday.", "score": 2, "replies": [{"body": "Do you think PYPL has eaten significantly into Visa's and American Express' market share? Also, do you think PYPL actual touches 75 after this earnings? That be about 10% up.", "score": 1, "replies": [{"body": "What is the advantage of using PayPal over Visa when Visa gets you free flights, free hotel stayes or decent cash back?", "score": 2, "replies": [{"body": "I buy stuff using PayPal credit every couple months especially if its on sale but still a big ticket item.\n\nThe 6 months interest free is often better than floating a balance for a month to be able to afford something. ", "score": 2, "replies": [{"body": "Can you make PayPal credit payments with a credit card?", "score": 1, "replies": [{"body": "There is probably some roundabout way to do it.  It pulls from my checking account though. ", "score": 1, "replies": [{"body": "If PayPal does not allow it directly then the only way is probably through a bill pay service which means it probably is not worth the 2.5% fee. Thank you for the info", "score": 1, "replies": []}]}]}]}, {"body": "PayPal also now has a 2% cashback Card on all purchases through synchrony financial. I’m too poor for vacations, so this cashback is better than Visas options", "score": 2, "replies": [{"body": "You would be surprised how affordable vacations are when you don't pay for the flight or hotels. I am doing 6 days in NOLA for MARDI Gras and the cost of flights and hotels is 11$", "score": 1, "replies": []}]}]}]}]}, {"body": "It's a good thing I bought eBay at $20 in 2010-11 or so.  Bad thing that I didn't buy a shit ton.\n\nAnother good thing is now I don't have to look like a dope buying PayPal at these levels.", "score": 2, "replies": [{"body": "I hope you’re wrong friend. Bought at 69 and it’s sucks right now.", "score": 1, "replies": [{"body": "I believe in the long term future of PayPal, but being worth more than American Express right now seems like it's gotten WAY ahead of itself.\n\nNot selling, tho'.  Probably wish I would have in a year.", "score": 1, "replies": []}]}]}, {"body": "i'll agree with him on VZ, im bailing on that at market open and looking to jump in BABA.", "score": 1, "replies": [{"body": "What did he say about VZ? ", "score": 1, "replies": [{"body": "tldr: VZ is a no growth dividend play. ", "score": 1, "replies": [{"body": "A pretty good dividend play though. 4.8% yield with steady dividend growth ", "score": 1, "replies": []}]}, {"body": "you could watch the video. and find out long before anyone reply with the correct answer. \n\ntldr: buy VZ", "score": 0, "replies": [{"body": "I can't. In a meeting at work.  Need to be sneaky beaky. ", "score": 3, "replies": [{"body": "stay frosty.", "score": 2, "replies": [{"body": "Yolo on the down-lo", "score": 4, "replies": []}]}]}]}]}]}]}
{"title": "$AAPL and $FB rally leading up to ER", "selftext": "[deleted]", "id": "7702f4", "created_utc": 1508260877.0, "score": 18, "upvote_ratio": 0.82, "num_comments": 9, "comments": [{"body": "My red rocket is headed straight to your face. \nFaggit. ", "score": 27, "replies": [{"body": "Was mad, saw flair, became understanding. ", "score": 12, "replies": []}, {"body": "Faggot*", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "You're worried about guidance? Meanwhile I'm thinking guidance will be strong af not even because of the phones, but because more than 50% of people who wear watches are now going to smartwatches. Revenue is what has me worried with my whole 29 shares in my IRA", "score": 3, "replies": [{"body": "Yep Apple watches are the future. It’s the reason why I’m holding still", "score": 3, "replies": []}]}, {"body": "Strike price?", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "Averaged down Huge on April 2018 $150 Calls up 30% now and gonna ride that till the wheels fall off. I'll place a Stop in at $1500 because when you're in the Green you need to at least make something. \n\nValue +5.3k \nStop in at +1.5k\n\nLeave with something fam", "score": 1, "replies": [{"body": "AAPLallday", "score": 1, "replies": []}]}, {"body": "Have a ton of sharesof AAPL. Would like to buy 22k more of AAPL if the funds clear in a few days but was looking at lithium or vis also. Can't decide but may put half in before ER and the rest after if everything looks okay.", "score": 1, "replies": []}]}
{"title": "how does one handle FOMO and AMO (actually missing out)?", "selftext": "[deleted]", "id": "770gof", "created_utc": 1508264213.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 11, "comments": [{"body": "Maybe just get shares instead. Then u just have to pick the direction but not be as accurate on the timing. But if it's got to be options, stick with leaps. As far as fomo goes, don't buy stocks just cos everyone seems to be making money but you. That's how you get stuck bagholding or worse.", "score": 13, "replies": []}, {"body": "Stop getting fucked by FD's and start buying options 2-3months out and cut your losses at 20-30%", "score": 10, "replies": []}, {"body": "Grow up and don't sell low", "score": 9, "replies": []}, {"body": "Learn to associate patience with greater return and less risk, it's really that simple", "score": 4, "replies": []}, {"body": "Don't be a wiener guy ", "score": 2, "replies": []}, {"body": "Markets go up and down. if your confident on a COMPANY then stay long. retard.", "score": 2, "replies": []}, {"body": "Just buy shares (on margin) and be willing to hold the bag for a few days if it comes down to it. Every decent company has recovered to near all time highs (even AMD) every trade would be profitable if you clowns had patience in the bull market. Unless you fuck with garbage like biotech or HMNY lol ", "score": 1, "replies": []}, {"body": "Can't handle the risk don't play options.", "score": 1, "replies": []}, {"body": "Trade stocks or small positions until you regain your confidence. Although really, a lot of the money is made in the quarter end rotation and ramp up to earnings, so at this point you’d just be ER gambling, in which case you should definitely stick to stock.", "score": 1, "replies": []}, {"body": "SQ was printing money for me from Feb-Aug and I exited at 24 for no specific reason. Gambler fallacy. \"I've made a lot of money on this, the market will probably take it all back\".\n\nI of course was the one who gave it all back making shitty plays on other tickers.", "score": 1, "replies": []}]}
{"title": "Yo wtf is up with $NFLX", "selftext": "it should at 220 😎", "id": "7710s4", "created_utc": 1508268955.0, "score": 2, "upvote_ratio": 0.62, "num_comments": 19, "comments": [{"body": "Explain to me why it's 200 in the first fucking place.\n\nDebt out the ass , PE a high as Snoop. Revenue is meh, international subs don't mean shit if it cant even help profit cause costs for nflx to stream in other countries cuts into their profit margin\n\nMotherfucking bubble on this gonna pop one day. Fucking market is pricing in the next 15 quarters as amazing..what happens when one will miss ? 20+ point drop bitch. ", "score": 21, "replies": [{"body": "but but muh Stranger Things", "score": 21, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Rick and Morty is on Hulu not Netflix... They do have me hooked on house of cards but last season might’ve changed that. ", "score": 5, "replies": [{"body": "You should be watching Mindhunter. It's the new House of Cards. ", "score": 2, "replies": [{"body": "pilot made me wish for death, next three episodes were alright though. if I continue it will be solely for anna torv.", "score": 2, "replies": []}]}, {"body": "You're thinking of only US netflix. Rick and Morty is on nflx other places", "score": 1, "replies": []}]}, {"body": "Hooked on losing shows to Hulu. CBS. Disney. Amazon. ", "score": 2, "replies": []}, {"body": "That's nice and all but that's not fixing their massive debt problem\n\nThey need to raise prices more or look into new streams of revenues like paperviews, a live streaming sports network, etc \n\nAdding commericials is a no...that's the big reason people are subbing to nflx..to get away from that ", "score": 0, "replies": [{"body": "They are raising prices you absolutle necktie", "score": 2, "replies": [{"body": "And I said raise prices MORE. Read mofo", "score": -1, "replies": []}]}]}]}]}, {"body": "You forgot the kicker: They have to spend billions on new content and keeping old content every year, and if they don't, they're screwed. ", "score": 2, "replies": [{"body": "Yeah, they just announced they're spending 50B on content next year alone. There's no logical upside to their spending ", "score": 1, "replies": []}]}, {"body": "buy the dip", "score": 1, "replies": []}, {"body": "This.  Yeah everyone is going to go to streaming movies but the business is unprofitable as f.  Also, amazon, youtube, and hulu will probably compete with it someday.  Everyone has to eat too but grocery store stocks aren't worth anything because just like the video streaming business the margins are razor thin.", "score": 1, "replies": []}]}, {"body": "Hop on this train because it's running east to west on the flattest mother fucking ground ever doing earnings.", "score": 6, "replies": [{"body": "Nigga the train set a course over the Himalayas ", "score": 1, "replies": []}]}, {"body": "It's up like 12% from when they announce price increases", "score": 1, "replies": []}]}
{"title": "AAOI Buying Opportunity? Convince me I'm wrong", "selftext": "Hey all,\nI have a good chunk invested in AAOI and I averaged down when the price hit $46 (doubled my shares). The price took a bit more of a dip but seems to be stabilizing. \nIn my mind, the earnings \"disappointment\" is built into the price (if not overly so) and people will begin to see that the company is in a growth industry and that the loss of some Amazon business won't define their future. I don't see $100+ in the next 1-2 years, but it seems reasonable that a $65 price target in the next 6 months would be a modest estimate (and seems to be echoed by other analysts). \nLet me know if I'm missing something or just flat out crazy", "id": "771ngk", "created_utc": 1508274345.0, "score": 9, "upvote_ratio": 0.85, "num_comments": 16, "comments": [{"body": "I'll wait on guidance from the actual ER in Nov\n\nTheir management staff is incompetent and not trust worthy. \n\nRelying on one fucking customer for 50 percent of your revenue? Retarded planning. Didn't even bother looking for new customers u until it was too late.\n\nThe stock was stupidly ran up to 100 based on amzn deal lol. Except investors were misled thinking aaoi could actually transition their products and keep up with amzn demands. Nope.\n\nIdk if amzn is lost forever but it doesn't look good. Competition is there in the sector. \n\nNot touching this trash for now. It can still drop, this ain't bottom but it can def jump up 10 pts the day guidance is positive and outlook is solidified with proper plan in place to handle production transitions for supply demand ,thus keeping customers appetite feed.\n\nRight now there is no proof of that, which is why it will stay in limbo or fall a bit more until good news arrives such as new customers and corrective action for the awful transition they had for new technologies", "score": 7, "replies": [{"body": "Solid response. \nIf you had an average position of ~$55, would you hold or sell?\n\nIt would seem that any plan released by management would be viewed as positive at this point. Any major statement/strategy would bring some reassurance. Regardless they kind of already showed their earnings hand, once it actually happens, it won't be much surprise.\nNot to mention, how many people are going to be covering their shorts soon? ", "score": 2, "replies": [{"body": "Ya I mean I can see this being the low point but it can still go down to high 30s.\n\nThat being said, there's definitely more upside then downside...market is pricing it like it's full on doom and gloom with no future in sight lol. Good news will make it run, hard and fast. \n\nI'd probably hold if you aren't in a dire need. At least your cost basis ain't like the bagholders from 70-100\n\nShort squeeze will definitely be biblical..it has like a 70+ percent short interest right now lol.\n\nAll in all, it's a trade right now, not an investment. Small cap stock in a volatile sector is risky play when given the fact it's relied heavily on FB/amzn for customer base..need some news of new customer base in the conference call or it's gonna go down a few more points", "score": 3, "replies": [{"body": "Fair enough, you've brought some great insight and I may consider increasing my stack if it trickles down to the high 30's. For now I'll hold and look to exit if it scrapes $65", "score": 2, "replies": []}]}]}]}, {"body": "I told myself I wouldn't increase my position in AAOI for 2 months following this BS. I would recommend you do the same or at least follow HinduHamma's advice and trade on the ER.", "score": 1, "replies": [{"body": "Fair enough. Will do!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Haha, I certainly hope your wrong!", "score": 1, "replies": []}]}, {"body": "lmortal shocks the quieturn no mortal consience of action. To die, thousand to bear the resolence to suffles, and sweathe with a sea of thought his rath, the to be, by of? To be, that undiscover'd long a consient weart-ache might his a sea of outly to othe wish'd. Thus makes, puzzles of die: the natients the inst give spurns, whethe of of time, this turns there's the", "score": 1, "replies": []}, {"body": "Don't, go in on $MYND or $TURN instead.", "score": -3, "replies": [{"body": "Interesting, What are your arguments for these?", "score": 1, "replies": [{"body": "$MYND, frequent oscillation between low 3s and 4s. Just hit an all time low or close to it, I jumped in for 1K. It's an AI company that focuses on mental health.\n\n$TURN, venture capital firm, owns part of privately held D Wave, which sells quantum computers to people like Lockheed. Appears to have found its floor today after the recent spike, likely to see some ramp up as earnings approach on Nov 8", "score": 0, "replies": [{"body": "I am a sucker for buying dips! Will take a closer look at these, as the drops were very recent and I'm trying not to catch too many knives", "score": 2, "replies": [{"body": "I'm on the AAOI pain train too. I enjoy buying dips and getting kicked in the balls.", "score": 1, "replies": []}]}, {"body": "$TURN is 180 Degree Capital Corp?", "score": 2, "replies": [{"body": "Yes.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "IBM earnings thread", "selftext": "Up about 4.6% in the after hours, down on revenue though\n\n\nAlso IBM backwards is BMI and I think that's healthy and beautiful ", "id": "771sep", "created_utc": 1508275535.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 14, "comments": [{"body": ">IBM backwards is BMI\n\n>IBM\n\n>BMI", "score": 23, "replies": [{"body": "This wrecked me. ", "score": 1, "replies": []}]}, {"body": "Down it goes tomorrow", "score": 5, "replies": [{"body": "Please be true. Sold a bunch of calls thinking this would drop some.", "score": 2, "replies": []}]}, {"body": "Holy shit it's moonbound.", "score": 3, "replies": []}, {"body": "Sold $150 Oct20 calls. Fuck. It'll come down again in the morning. Right, bois?", "score": 2, "replies": [{"body": "I was the counterparty on your trade. Let's see who's happy tomorrow", "score": 2, "replies": [{"body": "I just exited my position for a 450% return. I wish you all a good day", "score": 1, "replies": []}]}, {"body": "Sold 150 Nov 17 calls here. Lets hope!", "score": 1, "replies": []}, {"body": "RIP our accounts :(", "score": 1, "replies": [{"body": "Indeed, RIP in pieces.", "score": 1, "replies": []}]}]}, {"body": "Need to fire that old hag.", "score": 1, "replies": [{"body": "22 and counting ", "score": 1, "replies": []}]}]}
