{"title": "GM wants to overtake Tesla as EV leader in the US with new $30,000 electric crossover, and more", "selftext": "", "id": "q2pca9", "created_utc": 1633541674.0, "score": 5, "upvote_ratio": 0.59, "num_comments": 52, "comments": [{"body": "How does it feel to want?", "score": 23, "replies": [{"body": "Is this a CKY reference?? Five stars either way", "score": 5, "replies": [{"body": "Can't tell either, with my perceptions in a mix.", "score": 1, "replies": []}]}]}, {"body": "I want to overtake Tesla with MY $29,000 electric crossover… AND MORE!", "score": 14, "replies": [{"body": "Gimme your SPAC!1! I'm in!", "score": 7, "replies": []}, {"body": "I want to overtake Shakira’s sweet ass with my sensible mid sized boner. Doesn’t mean it’s going to happen.", "score": 3, "replies": []}]}, {"body": "I want to discover gold in my backyard and overtake Jeff Bezos as the worlds richest man", "score": 12, "replies": [{"body": "Me too, but I PLAN to discover gold in my back yard, so I'm in the lead. /s", "score": 7, "replies": []}]}, {"body": "If GM produces an EV that does not blow up, yes they could probably give Tesla some competition.", "score": 9, "replies": [{"body": "Especially if it’s $30k pre-incentive", "score": -2, "replies": [{"body": "Pre incentive? Umm yes they could they would just a ton of subsidies like they did with Volt. Or get one from SAIC, which would cost them fk ton to get US safety spec. I sometimes forget they had Volt for such a long time. And Bolt is such a compliance car. \n\nEveryone announces they are going to produce an EV at an eye popping price. Only car maker that is close to delivering on that promise is Tesla, even for them it has taken 10+ years.", "score": 1, "replies": [{"body": "Yep. We've been hearing this for at least 9-10 years, and from most of the major brands.", "score": 2, "replies": []}]}]}]}, {"body": "GM only discovered software last week.", "score": 18, "replies": []}, {"body": "Anyone can make a 30k EV, the trick is to do it with sustainable margins.", "score": 7, "replies": [{"body": "Well with GM, if they make a ton of cash elsewhere it may be fine with them to break even or barely turn a profit…something Tesla cannot do right now", "score": -7, "replies": [{"body": "Exactly but that’s not sustainable", "score": 5, "replies": [{"body": "I bet I’d get a ton of business if I started selling $10 notes for $5. Think of the volume I could achieve!", "score": 3, "replies": []}]}]}, {"body": "GM’s joint venture is selling a $4,500 EV in China. If they adapt it for the US, they might be able to stay within their $30,000 target.", "score": 1, "replies": []}]}, {"body": "I'm sure they do.", "score": 4, "replies": []}, {"body": "And people in hell want ice water.", "score": 5, "replies": []}, {"body": "They do know they have to actually make better and cheaper cars right? You can't just spend billions and billions on advertising in the hopes people believe your bullshit, some will but most will do 5 minutes of research and buy a Tesla if they can afford it.", "score": 5, "replies": [{"body": "Butt-seating is believing. The more Teslas that get on the road, the more people who experience them, and the demand keeps climbing.", "score": 3, "replies": [{"body": "It's like moving from a Nokia 3310 to an iPhone when people get in Tesla's.", "score": 4, "replies": [{"body": "3310 the shit man!", "score": 1, "replies": []}]}]}]}, {"body": "When? By 2050?", "score": 3, "replies": []}, {"body": "Was not GM leading the ev revolution all along with ford? Maybe they meant they are competing to go behind Tesla? Who got confused here???", "score": 2, "replies": []}, {"body": "Blowup EV LE buy now under 30k,  non blowup EV XLS buy now 40k ..", "score": 2, "replies": []}, {"body": "If GM can produce a $30k EV…with the tax credits…wow it’s going to absolutely eat market share", "score": -4, "replies": [{"body": "GM won't create anything or be able to produce enough of anything to compete with model Y any time soon. They just need to announce anything they can to take the heat off of the worst deliveries in the whole auto industry last quarter.", "score": 16, "replies": [{"body": "A $30k crossover wouldn’t even be targeting a $55k Model Y LR market.\n\nThat kind of car would be to grab up all the market share of people who can’t afford nicer cars", "score": -6, "replies": [{"body": "I'm thinking Tesla will likely have something cheaper and better by the time GM actually makes it.", "score": 16, "replies": []}, {"body": "That's true.  There is or will be a large market of people who can't really afford a Tesla and will happily opt for a cheaper EV.  This won't be eating Tesla's market share though... This is GM eating the leftovers that Tesla doesn't find it worth eating.", "score": 7, "replies": [{"body": "Tesla is said to be working on a $25,000 EV, so that market should shrink. GM coming to market at $30,000 is not really eating leftovers.", "score": 1, "replies": []}]}]}]}, {"body": "Without some ballpark specs or even a vague timeline it’s just fluff imo. It was already obvious they would at some point in the future, they just stated the obvious without giving any extra information.", "score": 12, "replies": []}, {"body": "If…in 10-15 years, not adjusted for inflation", "score": 2, "replies": [{"body": "I initially thought that 2030 was a typo and it was really 2080, with inflation making their market valuation even lower than it is today.", "score": 1, "replies": []}]}, {"body": "If I could produce the same it also be wow.", "score": 2, "replies": []}, {"body": "Will it be actually be profitable?  How many will they be able to make?  Will it be any good?\n\nTesla could make a $25k car today, but they don’t have the excess capacity that GM does, so it’s a non-starter.", "score": 1, "replies": []}, {"body": "They could pull it off if they brought the Wuling Hong Guang Mini EV to the US. After they have finished adapting it to US standards, $30,000 might be an attainable price point.", "score": 1, "replies": []}]}, {"body": "Y’all downvoting me for just stating the truth.\n\nIf GM can figure out batteries, they have the cash on hand to create and sell a $30k car. So don’t be all shocked 5-10 years down the line they come out with one and y’all are like “how?!?”", "score": -5, "replies": [{"body": "The thing is, it’s clear that GM can’t figure out the batteries or any other tech that Tesla is currently light years ahead on.  Did you not follow the whole GM-Nikola partnership?  Any CEO that is willing to partner with Nikola MUST have zero understanding about EVs.", "score": 9, "replies": [{"body": "Oh yeah! I forgot that GM was in bed with that obvious fraud. Really does show their incompetence when it comes to EVs.", "score": 6, "replies": [{"body": "Don’t forget about Lordstown motors and the issues they have, but most importantly, don’t forget about how GM built the first EV and their customers loved it, but they destroyed everyone of those care when they took them back from customers (leases) and continued with ICE. Just imagine how much of a lead GM could have had if they kept making EVs, but they didn’t and allowed Tesla to get a running head start that they will never catch up to.", "score": 5, "replies": []}]}, {"body": "> Did you not follow the whole GM-Nikola partnership?\n\nThey were both counting on the other to bring the battery technology. Neither actually had it.", "score": 2, "replies": [{"body": "Not true.  In their partnership agreements it clearly states Nikola will source everything from GM including batteries.", "score": 2, "replies": []}]}]}, {"body": "Which of those companies currently has growing sales? Hint: only one", "score": 2, "replies": []}, {"body": "> If GM can figure out batteries,\n\nThat remains an \"if\".\n\n> they have the cash on hand to create and sell a $30k car.\n\nThey don't though. It's very difficult. It's like saying the have the cash on hand to create and sell an $8,000 ICE car. I mean, maybe they do, but it's simply out of reach.", "score": 2, "replies": []}, {"body": "They already made a $4,500 EV in China. If they adapt it for the US, they probably could keep it under $30,000.", "score": 1, "replies": []}]}, {"body": "the real issue is manufacturing", "score": 1, "replies": []}, {"body": "The current tax credit doesn't apply to GM or Tesla (the only two companies who have exhausted it,) and a new one would likely benefit both companies, though perhaps not equally.", "score": 1, "replies": []}, {"body": "And I want a toilet made out of solid goooolllddddd!", "score": 1, "replies": []}, {"body": "lol. GM won't overtake shit other than bankruptcy which they will excel at.", "score": 1, "replies": []}]}
{"title": "PSFE….the next SQ / PayPal to the moon", "selftext": "Paysafe (PSFE)\n\nHave you Apes been missing the news lately on a stock that is one of us?  Why? Paysafe is a leading supporter of online gaming and the deals recently announced are not priced into the stock.  If anyone should be supporting gambling it is us?\n\nIt’s has a high potential of being bought…\n\n“The Bottom Line\n\nSomeone is going to buy this company.\n\nProcessors are looking for growth and innovation. They’re all focused on Square (NASDAQ:SQ), which has only grown more popular as it has gone into various banking and investment niches.\n\nGambling doesn’t scare the payments industry. Casino contracts are highly prized. Processors don’t hand gamblers money they don’t have. When the gambler is out of money, they reject the transaction. Many casinos have special rules for gambler transactions aimed at keeping them, and the gamblers, out of trouble.\n\nThis means the downside risk of PaySafe stock is limited. There remain potential suitors for the company. The most likely is Fidelity National, which has a market cap of nearly $75 billion. But if Foley sees a better bid, he will certainly take it.\n\nThe debt means PaySafe’s enterprise value is fair, not low. But you can buy it here.”\n\nIt now has deals with Fubo, Montana Lottery Sportsbook, and many more on the way…\n6 days ago:\n\n“FuboTV Inc (NYSE: FUBO) is trading higher Thursday after the company's subsidiary, Fubo Gaming, announced a partnership with Paysafe (NYSE: PSFE).\nFubo Sportsbook will plug into Paysafe for credit and debit card payments. It is expected to launch in the fourth quarter.”\n\n2 Days Ago:\n\n“HOUSTON, October 04, 2021--(BUSINESS WIRE)--Paysafe (NYSE: PSFE), a leading specialized payments platform, today announced a new partnership with INTRALOT, a leading global gaming solutions supplier. INTRALOT’s sports-betting platform has integrated with Paysafe to enable the Montana government-operated lottery to provide its online sportsbook patrons with a comprehensive suite of traditional and alternative payment methods via a single API.”\n\nThe third and fourth quarter earnings are going to beat.  There are no supply chain issues with this company and gambling is through the roof.  I don’t YOLO but I’m considering it with this stock.  At only $7 and $5 Billion Market Cap this is one of the best deals.  \n\nMore institutional ownership then ever:\n\n\n“The number of bullish hedge fund positions improved by 9 lately. Paysafe Limited (NYSE:PSFE) was in 50 hedge funds' portfolios at the end of June. The all time high for this statistic was previously 41. This means the bullish number of hedge fund positions in this stock currently sits at its all time high. Our calculations also showed that PSFE isn't among the 30 most popular stocks among hedge funds (click for Q2 rankings).”\n\nGet on the rocket at this price…its not going to zero so very limited risk at this level.  Revenue increasing every quarter….just look at the charts.  I wouldn’t be surprised if they announce getting into BNPL as well since that is the hot industry.\n\nPositions:\n\n3000 Shares\n11/19/21 8C", "id": "q2lrum", "created_utc": 1633531029.0, "score": 140, "upvote_ratio": 0.83, "num_comments": 56, "comments": [{"body": "Down 50% on this. I hate money", "score": 45, "replies": []}, {"body": "I am a legit bag holder, currently 44% down, but the fundamentals of the company are okay and it does have quite a lot of room to expand. Will probably average down my stake over time as I am confident this will rise", "score": 27, "replies": [{"body": "Hey! Me too. That said, I'm probably going to buy another 2000 when it drops below 7. May as well DCA down.", "score": 12, "replies": [{"body": "Here’s your chance! 🙂 $4.50", "score": 3, "replies": [{"body": "I'm hurting, I bought thousands of shares at the dip and it kept going down", "score": 2, "replies": []}, {"body": "Decided to take my L and \"HaRvEsT LoSsEs\". :-(", "score": 1, "replies": []}]}]}, {"body": "Did it really go from $2.50 to $21 now.. ?", "score": 1, "replies": []}]}, {"body": "10000 shares at 7.6 average holding", "score": 22, "replies": [{"body": "F you have my average beat.  looks like I’m buying more.", "score": 7, "replies": []}]}, {"body": "Ok I’m in 1000 shares. It better go up 😂", "score": 19, "replies": [{"body": "Welcome brother", "score": 8, "replies": [{"body": "Ouch.", "score": 1, "replies": []}]}]}, {"body": "Whatever, I’m in, for 1/2023 leaps, if you’re right I’m up $30k, if you’re wrong I’m out $250", "score": 18, "replies": []}, {"body": "PSFE 🚀", "score": 15, "replies": []}, {"body": "So cheap here I hopped in", "score": 16, "replies": [{"body": "Even cheaper!", "score": 1, "replies": [{"body": "Haha good thing I was out awhile ago. Swing traded some calls.", "score": 1, "replies": []}]}]}, {"body": "3,850 shares @ $8.", "score": 14, "replies": []}, {"body": "This company keeps taking my money. I even took losses and went back in with a wash sale, then it went down some more.", "score": 14, "replies": [{"body": "I'm amazed how this stock can go down no matter what. Interest rates go up, PSFE down, interest rates go down, PSFE down. Markets up, PSFE down, Markets down, PSFE down...and yet I keep buying more.", "score": 19, "replies": []}]}, {"body": "I've been holding this bag for weeks, solid company but then again I bought GME at $300", "score": 24, "replies": [{"body": "Ouch", "score": 1, "replies": []}]}, {"body": "oooooooooooooof", "score": 11, "replies": []}, {"body": "“Just look at the charts”", "score": 8, "replies": [{"body": "What charts?", "score": 6, "replies": []}]}, {"body": "I hope you’re right. I got 2000 warrants that need to move up.", "score": 14, "replies": []}, {"body": "5,300 shares/ 5,000 warrants. A few calls. Some leaps. Waiting on next bump to sell some weeklies. That usually bumps the price up a bit.", "score": 7, "replies": [{"body": "It is nice that weeklies are now available", "score": 5, "replies": [{"body": "Once this reverses I’ll play with fire for a little bit. I personally can get this stock up above $10 with a few bad moves. I’ll take one for the team.", "score": 5, "replies": []}]}, {"body": "Nice $.10 run this afternoon.  We need a couple green candles to get a turn around going.", "score": 4, "replies": []}]}, {"body": "Buy the 17 layer dip. 3500 shares. All my calls are dead.", "score": 5, "replies": []}, {"body": "been holding since 13, now the average is 9.5", "score": 4, "replies": []}, {"body": "ive been in this little fart for a while...not been good so far - Looking for greener days!", "score": 3, "replies": []}, {"body": "In today 1775 shares at 7.30", "score": 4, "replies": []}, {"body": "Nice run today but hopefully this is just the beginning of the turn around.", "score": 4, "replies": []}, {"body": "I remember seeing some DD on this when it was about $10-11. I bought 25 calls and they expired worthless, 5 months later and I'm not surprised to see it under 8 lol. I'm hands off", "score": 6, "replies": []}, {"body": "www.GuruFocus.com shows Major HF buying in $PSFE including David Tepper, Dan Loeb", "score": 2, "replies": [{"body": "Call Volume up big on $PSFE Bullish option flow detected in Paysafe Ltd $PSFE   \n26,384 calls trading, 1.9x expected, & implied volume increasing over 1 point to 64.03%. are the most active options, with total volume in those strikes near 0 contracts. The Put/Call Ratio is 0.08. Earnings are expected on November 10th.", "score": 3, "replies": [{"body": "I upped my shares today.  I’ll be surprised if this doesn’t get to $12 in the next few months.  This is a stock that can outperform the market in 2022.", "score": 2, "replies": []}]}]}, {"body": "Dude the game is SOFI", "score": 3, "replies": [{"body": "I think SOFI is a great investment.  I was just waiting for mid October to go back into it and RKLB.", "score": 4, "replies": [{"body": "I'm finally in the green with SOFI, holding that one for a bit. Stopped selling calls against it until earnings and official bank charter news. Agree on RKLB, I rode SOFI all the way from my first $22 entry like a fucking moron but now that i've gone through it, i'm hoping to capitalize on RKLB's inevitable PIPE selloff. Sitting on a couple hundred shares of ASTR and want to offload a bit but not at sub $8, if the stars align they'll announce the next launch attempt, it'll get back to 12 or 13 and I can shift some of those gains to RKLB when that fucker gets to 11ish. I'd say 10 for SPAC NAV, but that's wishful thinking", "score": 3, "replies": [{"body": "I did some PMCC on SOFI and they were great then it dropped down to 14 so I closed out the long legs.  Thinking of doing LEAPS on SOFI and RKLB again and selling calls against them.  At this leave I might do that on PSFE or just sell covered calls on a few hundred shares.  The premiums don’t seem to be quite what I would want.", "score": 2, "replies": []}]}]}, {"body": "or affirm", "score": -1, "replies": [{"body": "I bought AFRM at $60 and made some money after the Amazon announcement.  I should have just kept holding!", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|7 months ago\n**Total Comments**|120|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/pq6a5p/dnathe_new_mrna_stock/) \n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=q2lrum)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=q2lrum)", "score": 1, "replies": []}]}
