{"title": "Apple vs Epic", "selftext": "Anyone think this strange judge rules against apple and there is a huge drop in share price initially?  I'm gathering some dry powder for the day this crazy judge does something awful to my beautiful Apple stock.  I think it could hit 105 if this arrogant judge slaps Apple around.", "id": "ni8zca", "created_utc": 1621651359.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 13, "comments": [{"body": "AAPL too big to fail if it drops 105 I’m going all in aapl", "score": 8, "replies": [{"body": "AAPl is already undervalued at 125.  It won't fall to 105 but if it ever falls to 115 that is a very safe buy.  In fact any steep drop in AAPL from here is a buy buy buy opportunity and I would personally go on margin a million or more to buy cheap AAPl shares in the 110-115 area.  That said, this would require a huge market sell-off and/or a surprising defeat in this case and others. The odds of that happening are slim. Right now it appears Apple has a 80% of winning, a 19% of compromising and a 1% of losing entirely. Plus then they would appeal.", "score": 2, "replies": []}]}, {"body": "Epics case is like a vendor from Costco trying to sell its products down the street and then complaining when Costco doesn't want to place it on the shelf anymore.  If it dips just buy more.", "score": 7, "replies": []}, {"body": "No i dont think so. They have some very valid arguments. Epic CEO is playing on a bluff and has played a major gamble. And 105? Its just 50 bill in revenue. It wont cause an almost 20% drop. However, if it goes to 105, i am buying with both hands", "score": 5, "replies": []}, {"body": "The judge cannot do that unless Epic can prove a monopoly, plus that the fees Apple charges hurt consumers. After all it is perfectly legal to charge tolls for use of your property, no one is forcing anyone onto the Ap store and IOS is a platform which apple built and therefore is Apple's property.   Google, Microsoft, Facebook all do the same and Amazon charges a 15% commission to third party sellers plus is tyrannical in how they can throw off any seller they want with no recourse and for no just cause.  Amazon, Facebook and Google are also more monopolies than Apple is.   -- If you sell an Ap on Apple IOS you get a billion paying customers to profit from and that is worth a lot.  Also, since Netflix was able to do great after opting out of the Ap store, that proves it can be done. In fact Epic is profiting now without the Aps store.  So just because the judge asks Tim Cook tough questions doesn't mean she can make up new laws. And if the judge were to rule against Apple she'd also have to rule against all the other platforms, and all the mega cap techs would collapse throwing the entire internet into chaos.  So though she is tough, she is also smart and cannot make up new laws, so expect Apple to win, though perhaps suffer some bad PR in the process.  On the other hand Apple could agree to maybe lower commissions to 25% and be done with it just to please this judge. And if this judge rules in Apple's favor this also protects Apple from any similar lawsuits including Spotify in Europe. Plus then Apple could force Epic to pay 100 million in damages.", "score": 2, "replies": []}, {"body": "Just listening to an expert on CNBC and he is right. The worst thing that could happen to Apple, though it is unlikely, is that Apple will be forced to slightly lower their commissions, and that Google, Microsoft and others then will have to do the same thing. Who goes first? But it may not be legal for a judge to dictate profit margins.  PLus since everyone else charges 30%, why pick on Apple?  Epic i also not the right plaintiff and was never damaged by Apple. Epic benefitted net-net from Apple.  Also, it is not a monopoly since Netflix was able to opt out and still be extremely successful.  Now Jim Cramer is weighing in nd saying Apple is justified. Developers and businesses can either make 70% of a much larger pot or 88% of a much smaller pot. Some like Netflix can even pour millions into promoting their own website and do it themselves, but only the biggest companies could opt out of Apple's system and still succeed.  Btw this also shines a light on Amazon on their rather high 15% commissions for 3rd party sellers. Well, I sold on amazon for ten years and made . million bucks, paying Amazon about $1,000,000. So I netted 3 million.  Once during a suspension I tried selling the same products on smaller websites. Guess how much I made in one month?  About $500. Not even enough to survive. So paying these commissions to big platforms with a billion customers is worth it.  In fact, it is a bargain.  yes Apple is getting some  bad PR due to epic, but Epic is going to lose and then Apple will counter-sue for 100 million in unpaid commissions.", "score": 2, "replies": []}, {"body": "Chill man and less name calling…", "score": 0, "replies": []}, {"body": "Did you see facebooks stock despite all the bad press?", "score": 1, "replies": [{"body": "I've seen it but Apple seems to just trade sideways for so long now.  If the ruling doesn't go in their favor I see some panic selling.  I keep seeing \"sector rotation\" nonsense but I don't see it rotate back around to Apple.  LOL!", "score": 2, "replies": [{"body": "AAPL is up 70% in the last year.  It got ahead of itself at 145 and has been consolidating ever since, despite stellar grand slam home run earnings, the stock actually went down after earnings. What that means is that the stock is undervalued now and is building a base for another big run-up, probably at the end of the summer.  Every stock goes in and out of popularity and ever big company has speed bumps and problems to solve, but Apple is becoming more and more dominant around the world, and covid or no covid people live on their internet devices these days.  So expect the stock price to catch up to their success fairly soon.  Another thing is that if AAPl wanted to be truly greedy as Epic claims they are, they could replace Google on IOS and be the kings of ads and data harvesting.  They cold also create their own Instagram and Facebook.  That goes against their credo, but it is also always an option for them to make an extra 100 billion per year.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Problem for regulators is that splitting up huge corporations actually unlocks even more value and can the pieces of the former company even more valuable and dominant. Also it is convenient to post something on Instagram and also have it posted on Facebook.  I can't stand Zuckerberg because he allowed the creation and weaponization of ten million Russian trolls for Putin and Trump,  but as a business model the company is genius.", "score": 2, "replies": []}]}]}, {"body": "No, I don’t share that view. \n\nCan it? Yes. Should it? No. \n\nThis has been discussed already. See [this. ](https://www.reddit.com/r/AAPL/comments/n8xk96/entirety_of_500k_in_aapl_with_epic_court_battle/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 1, "replies": []}]}
{"title": "Best Bank/Mobile App for Options", "selftext": "Hi All! First of all I appreciate all comments from this group! Keep up the good work. \n\nMoving to USA in a few weeks..  looking for the best combo between Bank and mobile app for trading options. \n\n1. I mostly sell options.. both CC and puts.. almost exclusively on Tesla.. I have a sizable account and no issues picking up shares if the puts go sideways. Usually I sell same week and open position on Monday.. will close by Thursday.. and reopen a new position for Friday and depending on how I feel open another for same day exp. (Looking forward to not paying my insane commission where I am) but will pay for a real broker. \n\n2. Mostly these are 100% cash secured puts.. but if my mood changes may extend myself. I like to be prepared for any type of margin call.. and I do this currently by having a line of credit outside my trading account that I can move in and out of same day etc. \n\n\nSo I am looking for the best general bank for everyday use and to trade options on. Thinking TD Ameritrade or CS. I like to have everything in one place. \n\nAlso looking at webull as I currently use it just to look at the chain because my current broker is a pretty shitty mobile app.  I also dont have time or capabilities to use a professional desktop suite during business hours. \n\nThanks all!", "id": "nihcwo", "created_utc": 1621685760.0, "score": 11, "upvote_ratio": 0.77, "num_comments": 17, "comments": [{"body": "Some say tastyworks is better fitted for options trade. Stock and ETF trades are fee-free. Options on stocks and ETFs cost $1 per contract with a $10 maximum per leg. It suits those who already have some experience in trading options, but its fees aren't the cheapest. I don't deal with options (but I'm thinking of starting), but some friends are satisfied with tastyworks app. Others claim that TD Ameritrade is better. I guess you should try every app and find out which one will fulfill your goals. As for the bank, you can access https://usa-banks.info/ and pick up the first one you like. Every bank is interested in new clients, so it invests in new technologies and keeps up with progress. Any bank will suit.You can even try some trade unions; their fees are lower, and the customer support is better.", "score": 8, "replies": []}, {"body": "I use TD", "score": 6, "replies": [{"body": "+1.", "score": 3, "replies": []}, {"body": "TD + thinkorswim app is the best mobile options platform IMO", "score": 2, "replies": [{"body": "They offer classes...and you can sign up for a one on one instructor to help you on the application.", "score": 1, "replies": []}]}]}, {"body": "I use tastyworks and the mobile platform is decent. They aren’t also a bank so you could do a chase bank account and link the two.", "score": 3, "replies": []}, {"body": "Robinhood is the best one bro... lol just kidding, another vote for either Chase or TD Ameritrade, I'd recommend Fidelity as well, the app sucks but if you're not actively trading but only selling options a couple times a week it should do and Fidelity has the best fills, which should save you a few more bucks vs TD Ameritrade or Chase", "score": 3, "replies": []}, {"body": "TD or ETrade", "score": 2, "replies": []}, {"body": "I use TD but they have a .65 per options contract fee, if you trade hundreds of contracts at a time this adds up really fast. I have heard if you call them sometimes you can get it lowered.", "score": 2, "replies": [{"body": "I pay %9.99 and 1.25 per contract today.. so that seems super cheap lol. \n\nBut I am also considering using webull.", "score": 2, "replies": []}]}, {"body": "There are 100's of options strategies.  Patterns for the basis of success frequently is found in the underlying data defining your trades.  This makes your journal a most important, actually critically important tool.  Spending time understanding the specifics of your losing trades, is required to effectively finesse next year's entry criteria.  A phone is handy for taking an emergency action from time to  time, however, documenting details in excel on a computer is required for having the money to still be in the game 10 years from now.", "score": 2, "replies": []}, {"body": "[Chase Referral Link](https://accounts.chase.com/raf/share/2508583731)\n\nIf you use chase use a referral link to get free $ lol\n\nYour friend gets rewarded too\nwhen they open an eligible Chase checking account and complete qualifying activities.\n\nhttps://accounts.chase.com/raf/share/2508583731", "score": 1, "replies": []}, {"body": "I use TDA for trading not as a bank,  CS bought them out and there will be a merger sometime in the future. I was told that CS is offering no commissions on virtually all trades at the moment.", "score": 1, "replies": []}, {"body": "I would certainly say TD Ameritrade.\n\n1- They're an established broker and not only do they have a web presence but they also have actual branches you walk into and talk to a rep.\n\n2-Their software is pretty much the standard for doing research (Thonkorswim). Every tutorial out there has Thonkorswim in it. They also have a very good learning center for getting the hang of their software. So support is beyond good.\n\n3-Their customer service is pretty awesome. I guess this is a mix of them having branches and being an established broker, but it's definitely good.\n\nThat's just my $0.02 on it.", "score": 1, "replies": [{"body": "Thank you! I am leaning toward TD!", "score": 1, "replies": []}]}, {"body": "Another vote for Chase. Their banks are everywhere, and the trading platform is quite nice. You can do it all in the chase app.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}
{"title": "A BoA survey shows that inflation is one of the top worries for investors, I build a tool to track fear of the inflation narrative", "selftext": "", "id": "nifshi", "created_utc": 1621679703.0, "score": 61, "upvote_ratio": 0.97, "num_comments": 13, "comments": [{"body": "I build a tool that quantitatively follows narratives in financial media by means of machine learning (sentiment analysis and topic classication). I use this also to measure inflation expectations (amongst other narratives). In case you are interested in the full dashboard with more data, it is on: https://narrative-investing.io/reports/narrative\\_report\\_narratives.html", "score": 5, "replies": [{"body": "Thanks for the hard work OP, will be looking at later.", "score": 1, "replies": []}]}, {"body": "Narrative investing is very under-rated, IMO - have you read [the narrative machine](https://www.epsilontheory.com/the-narrative-machine/) by epsilon theory? I think the concept here is very similar.", "score": 3, "replies": [{"body": "No I haven’t. I had a quick glance and it does indeed seem to drawing on the same concept, seems interesting so thanks! Shiller (narrative economics€ and Andrew Lo (adaptive markets) also have really interesting books that point out the power of a narrative in financial markets", "score": 2, "replies": []}]}, {"body": "Can you build in the actual rate of inflation? BLS CPI is a complete lie and uses a cost of living index instead of cost of goods sold. They use substitutes and constantly change the formulas (which are not released or known to the public) to curtail the inflation data. \n\nNo one believe inflation is or has been under 2% for decades. I’m interested in seeing what actual inflation is, presumed to be 6-8%, and if that forces the fed to remove seven trillion from their balance sheet.\n\nEdit: \n\n[BLS Website](https://www.bls.gov/cpi/questions-and-answers.htm) openly telling you they calculate cost of living index and not cost of goods sold YoY. \n\n[Investopedia Article](https://www.investopedia.com/articles/07/consumerpriceindex.asp) detailing the problems with current CPI calculations. \n\n[Old Forbes article ](https://www.google.com/amp/s/www.forbes.com/sites/perianneboring/2014/02/03/if-you-want-to-know-the-real-rate-of-inflation-dont-bother-with-the-cpi/amp/) detailing the amount of times the BLS changes their CPI formulas.", "score": 2, "replies": [{"body": "6-8% is where subconsciously I had assumed inflation had been tracking just based on what I experienced with my own purchases\\living expenses has been. \n\nGood to see it laid out like this.", "score": 2, "replies": []}, {"body": "The goal of this tool is not to track actual inflation but rather the inflation narrative or the fear of inflation. It stems from the thought that the forming of narratives can drive markets , for example in this case the fear of inflation can actually cause inflation (ie a self fulfilling prophecy). So with this tool I try to catch fear of inflation regardless of what inflation level currently is.", "score": 2, "replies": []}]}, {"body": "Super nice! This is real valueable DD. Thank you for sharing.", "score": 1, "replies": [{"body": "Your welcome", "score": 1, "replies": []}]}, {"body": "Weird though because stocks are a hedge against inflation. Tech/innovation should be hit, but real companies should be fine.", "score": 1, "replies": []}, {"body": "but nothing to worry about, its just transitory :)", "score": 1, "replies": []}, {"body": "Can confirm, I’m concerned about inflation.", "score": 1, "replies": []}]}
{"title": "good individual companies for my new fidelity portfolio?", "selftext": "[removed]", "id": "nif769", "created_utc": 1621677216.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 20, "comments": [{"body": "Why don't you learn to trade by using the paper trade feature they many brokerages.  Your not playing with real money but your learning how you're decisions would have played out. In the meantime for the 20 percent you allocated for learning.  Leave that as cash.  There's no need to blow up real money to learn.", "score": 15, "replies": []}, {"body": "Can’t go wrong with some allocation to Big Tech if you are holding for the long term.\n\nApple, Alphabet (Google), Amazon, Facebook and Microsoft", "score": 7, "replies": []}, {"body": "I wish my parents were as hands on about finances as yours are. I had to learn what little I know all by myself. Just wanted to pop in and let you know that you are pretty lucky haha", "score": 8, "replies": []}, {"body": "for single stocks I'd start with some big \"blue chip\" names: McDonalds, Wal Mart, Comcast, Visa, etc. not too exciting ... but boring, established, profitable companies tend to be the best picks in the long-term.", "score": 3, "replies": [{"body": "MSFT NVDA UNH HD SHW AAPL AMZN", "score": 2, "replies": []}]}, {"body": "Many great companies out there; just make sure the current stock price is undervalued in addition to being a great company to own.   Such as limiting yourself to companies that currently have a Morningstar 4-5 Star Rating.  There are many great companies to own; now just might not be the right time to buy in for some of them.", "score": 2, "replies": []}, {"body": "S&p 500", "score": 2, "replies": []}, {"body": "Look at your purchases in the past thirty days.  Invest in companies that you buy products from or the retail locations you go to.  Service companies too.", "score": 1, "replies": []}, {"body": "I like AB ML + RBLX + PLBY . FUBO + PLTR + DKNG are all at a huge discount right now.", "score": 0, "replies": []}, {"body": "A Big correction is coming, just chill for a month or two", "score": -11, "replies": [{"body": "Said everyone holding cash at the end of Q1 last year", "score": 18, "replies": [{"body": "I hope you are right dude", "score": -4, "replies": [{"body": "Me too, but in the end I would rather average into the market continuously than sit around with cash twiddling my thumbs waiting on a crash that may not happen for years", "score": 4, "replies": []}]}]}, {"body": "So, the big crash is finally only a month or two away now? Sweet. I’ve been waiting, literally, for years.", "score": 1, "replies": [{"body": "Its always a personal bet at the end. I have always invested normally but I do try to react to the movers of the big players. All of the large boys are holding big sums of cash so they are expecting something. I'm just a small time investor so what do I know", "score": 2, "replies": [{"body": "I don’t disagree to an extent. But even the big boys aren’t fortune tellers. They could be holding cash because they don’t believe there are good values right now that fit their firm/fund ethos. And I don’t doubt they may be holding cash because they *think* there will be a correction, but I’m not going to change what I do just because they’re holding cash. But, I also have a ~ 25 year time horizon so if there is a correction in the next few months, I should be all right long term. In fact I’d be fine with it so my 401k and other regularly scheduled deposits can pick up a little more each time.", "score": 1, "replies": [{"body": "With such a long horizon corrections only matter if you are close to retirement. Corrections are even good for you because you get more bang for your buck.", "score": 1, "replies": []}]}]}]}]}, {"body": "UNH HD SHW.  GOOGL AMZN LRCX AAPL and MSFT.", "score": 1, "replies": []}, {"body": "NVDA and SOXL.", "score": 1, "replies": []}, {"body": "Worthwhile checking out stable blue chip companies that pay decent dividends. Holding for the long term means short and medium term minor volatility just gives opportunity for Dollar Cost Averaging, and you also get quarterly cash to reinvest.\n\nAlso, start looking at company fundamentals and buy things you think are undervalued. As Mr Buffett once said \"the market is a way to transfer money from the impatient to the patient\" (or words to that effect).", "score": 1, "replies": []}]}
{"title": "Placerville Police in California purchase Tesla Model 3", "selftext": "", "id": "nionn9", "created_utc": 1621707542.0, "score": 165, "upvote_ratio": 0.97, "num_comments": 13, "comments": [{"body": "Lol my hometown! The old cop cars used to have nooses on the doors, I always thought that was......something. This is the same town that made the news recently about this noose logo in general, and there was some outrage over the hanging dummy at a cross street. \n\nAlso the grant they used is the same one residents get, it's a nice 1k rebate!", "score": 19, "replies": [{"body": "Article says 38k grant?", "score": 4, "replies": [{"body": "Yeah it’s from the same program/pool of money, I don’t know why they got theirs fully covered. Probably has something to do with it being a government purchase.", "score": 2, "replies": []}]}]}, {"body": "Are they going to paint this or it’s an undercover car", "score": 4, "replies": [{"body": "Article said undercover. But also says for administrative use.... So... The chief gets the drive around in a Tesla? Interesting use of money", "score": 9, "replies": [{"body": "Cheaper to drive per mile vs most anything else unless you want to stick him in a used 2015 Nissan Leaf.", "score": 3, "replies": []}]}]}, {"body": "They have tesla cop cars in Fremont, Ca, where Tesla’s headquartered", "score": 2, "replies": [{"body": "They have ONE Tesla cop car in Fremont. It’s a Model S they bought used.", "score": 1, "replies": []}]}, {"body": "My girls hometown\nToo fucking hot there", "score": 1, "replies": []}, {"body": "my question is why the USPS does not put out a massive contract to replace all of their mail trucks with BEV... \n\nthese things may cost them like a model S every 5 years or more.... I am sure that would be enough for an extra tent.. sorry production line in Freemont for a model 3 RHD van...", "score": 0, "replies": []}, {"body": "Hellcat challengers are fucked now", "score": 0, "replies": []}]}
{"title": "What's the best way to exit deep ITM long verticals/broken wing butterflies?", "selftext": "Lets say for example I entered a monthly broken wing butterfly on AAPL:\n\nAAPL current price: 120\n\nBTO: JUN18 1 AAPL 125C\n\nSTO: JUN18 2 AAPL 135C\n\nBTO: JUN18 1 AAPL 140C\n\nAnd at expiration AAPL closes at 150.\n\nIm aware that you should always close spreads before expiration but my deep ITM 125 call will most likely have an abysmal spread so slippage will ruin the whole position if I market order and I most likely wouldn't get a fill at any favorable limit order. If I don't sell the spread I run the risk of being exercised long and not assigned short and be exposed to weekend risk, or vice versa where Im assigned short and not exercised long opening me up to tremendous losses. I use TOS and what the rep told me is that the margin management team would most likely make me exit the entire position at a limit order or market order if time is short if I don't make a decision myself (I believe that what they will try to do but anything can happen); If this occurs then I am exposed to slippage again. They also assured me that they would not let me be assigned short and not exercised long/vice versa but as I said anything can happen.\n\nSo to all those who trade long verticals/broken wing butterflies/diagonals or any other type of spread, what are your methods of exiting these trades to avoid these types of risks towards expiration? I'm guessing a popular answer would be to close the trade a week before expiration or something but what if 1 week into my monthly spread AAPL skyrockets and doesnt go back down and im already deep ITM?\n\nMany thanks.", "id": "ninf9d", "created_utc": 1621704013.0, "score": 12, "upvote_ratio": 0.82, "num_comments": 14, "comments": [{"body": "Note that your example is backwards. BWB would be 130-(2)135-145 to get a credit. \n\nFor call BWBs, I typically set a GTC to close out the debit portion at 90% of max value, so if the underlying spikes I can try to lock in that profit. \n\nFor the credit spread side, if the underlying spikes I evaluate a roll before it’s too far gone. Not much else you can do except sell a put credit spread for a little more credit - turn it into either an iron fly or condor. \n\nOn TOS, if it expires fully ITM, they’ll auto close everything for you. I typically buy back the ITM short spreads for max value the day of expiration just to avoid any odd situations.", "score": 3, "replies": [{"body": "I should have specified that the spread was entered for a net debit. How does acting on the day of expiration allow for easier exiting of DITM positions?", "score": 1, "replies": [{"body": "It doesn’t. The robots should take your orders for those spreads at full value before close since AAPL is very liquid. On some underlyings you’ll need to penny it up and see what hits, but I’ve never paid more than 10.05 to close out a 10 point spread. Markets are pretty damn efficient.", "score": 3, "replies": [{"body": "Hmm interesting. Then I guess it would be best practice to stick to highly liquid stocks and ETFs then. Thank you for the input.", "score": 1, "replies": [{"body": "Yeah, I got stuck in OSTK with short call spreads on the run up and those were my worst fills. Very illiquid.", "score": 1, "replies": []}]}]}]}]}, {"body": "It went against you so there isn't a great answer.\n\nRolling to a further expiration, possibly adjusting the strikes, and hoping for reversion might be the best you can do \n\nAside from that, I quote Walter C Dornez -  \"I highly recommend pissing yourself, followed by a course of praying to your impotent God.\"", "score": 1, "replies": [{"body": "Uhmmm....he made 10.00 on likely an entry of about a third of that, not sure how you see this going against him....\n\nOP, no good answer...realistically, slippage shouldn't be that bad if you're looking at expiry. My experience you'll give up a bit but usually not that much since the slippage is guaranteed income given how DITM....\n\nI usually see more slippage trying to get out of DITM early or, worse, I've been pinning the 2x write...that is a killer because they'll hold extrinsic (x2) very late in the day while the lower long is nearly all intrinsic and the upper usually worthless...that really hurts returns.", "score": 4, "replies": [{"body": "Nearing/at expiration minimizes slippage with DITM positions regardless of how deep ITM it is? I'd think it would be tough to exit the position at a favorable limit order given that there wouldnt be that many buyers of a 1-0 DTE deep ITM call no? How does expiration increase liquidity for DITM options?", "score": 1, "replies": [{"body": "Virtually no risk and no extrinsic value. The stock will be anywhere from 10-30 points in the money on a 150 stock....the less time left the lower the likelihood the stock makes that kind of move....afternoon of expiry in a stable name no 150 stock is moving 30 points. \n\nThrow a few extra pennies on intrinsic value and you'll get hit....even if you have to give a couple pennies per leg won't matter, being DITM your profits are deep enough to afford it....Quick arbitrage for some machine on the other side of the trade.\n\nBWB is a go-to trade for me in certain situations...as I mentioned before what will kill your flexibility is pinning the writes....pick your strikes with that in mind", "score": 2, "replies": [{"body": "intersting, giving up a few cents would get me out of a profitable trade and provide the bot with an arbitrage opportunity I get it. Might I ask, what does pinning the writes mean?", "score": 1, "replies": [{"body": "In your example the stock settling in at 135...that will produce a large extrinsic value ATM, times two. \n\nThe change in the write position usually is enough to outweigh the delta you're picking up on the single lower long...the upper long hasn't really hit good gamma yet either....so you can find yourself in the situation of picking the right direction but showing a loss or little/no profit in the total position so it's hard to exit unless the stock really explodes (to 150 in your example) or you approach expiry and the extrinsic drains from the pinned writes....\n\nIt's uncomfortable...hard enough to be correct on direction but you also need to be correct on timing, and frustrating to see the gains in stock with not commensurate gains in your BWB.", "score": 2, "replies": []}]}]}]}, {"body": "Since this is Theta Gang, I missed the \"Long\" part as we are normally selling short options\n\nIn any case, in this hypothetical example, if it's profitable then why are we even here?\n\nYeah, you might not get a perfect fill, such is life", "score": 1, "replies": []}]}]}, {"body": "First of, not sure that AAPL will be at 150 on June 18.", "score": 1, "replies": [{"body": "most likely not, but for example's sake", "score": 1, "replies": []}]}]}
{"title": "Don't do Calendar on vol instruments", "selftext": "Don't do Calendar on vol instruments like VXX, UVXY, VIX, or /VX, or any ETF/ETN where the underlying is a futures contact.\n\nThey said that each expiration has a different futures contract as the underlying. So you never know what the value of the far dated futures contract will be worth. You can see this in the term structure.\n\nIs this true? What about indices like SPX, NDX?\n\nAlso thetagang is not WSB.", "id": "nir1sq", "created_utc": 1621714474.0, "score": 18, "upvote_ratio": 0.82, "num_comments": 20, "comments": [{"body": "Afaik (not 100% on this), calendars on volatility instruments require the margin of a naked short option. Your broker does not recognize a back month long as collateral for a front month short\n\nSuper interesting", "score": 11, "replies": [{"body": "Correct. The back month option is not at all a collateral. You're running a naked short call options. I learned this is because the front month contract is tracking a different underlying futures contract so you're not properly hedged. If VIX spikes, the front month future contract will moon causing backwardation, this can blow up your account since you can't guarantee to be able to \"roll\" for a credit, since you never know what next month's VIX futures will be trading at.\n\nI don't know if this is the case also with Index options, but I don't think so.", "score": 7, "replies": [{"body": "Looks like its not the case with index options. My broker let's me place the 5000c calendar spread for $5", "score": 3, "replies": []}, {"body": "This is the case with futures options...but they may be different structure than VIX. ES  (spx) for example is a quarterly contract not monthly.", "score": 2, "replies": [{"body": "Ok for SPX it's just the spot price of the index itself, the options that track the futures term structure is listed under /ES", "score": 2, "replies": []}]}, {"body": "Which is super annoying because I can’t sell calls on my VXX long position on Saxo.", "score": 2, "replies": []}]}, {"body": "Yep! This is beyond stupid but IBRK does the same thing...treats futures spreads like individual positions. VIX is my main trade and recently noticed the dec/jan spread trading at .85 which was a ridiculous miss-pricing...had to sell some positions and cover some CSPs to get a few more spreads on short as the $50k free cash i had only covered 2...what exactly can happen here?...one contract to explode and the other to crash? In what universe is this even a possibility? So retarded!", "score": 1, "replies": [{"body": "This is at the exchange-level. I've checked 5 different brokers and they all charge this (ridiculous) amount on VIX futures spreads.\n\nGone are the days when a M1-M2 VIX fut spread only charged you $1200 of margin. It was fucking glorious. I made 450% in 3 months. Then lost 50% in like 3 days haha.\n\nI'm also mad they don't offer margin offset for butterfly contracts (-1, +2, -1). That should be extraordinarily safe compared to like ... a naked short vol contract\n\nBtw, buy the fucking Oct - Nov at -$0.09. It was $-0.18 like 2 days ago, but it's still a good buy now. It'll be $0.30 in like 3 months. It's basically guaranteed, without the risk of the front month", "score": 3, "replies": [{"body": "Why would you think there is mathematical probability of that trade working? I don’t see it this close to 0 and it seems like it’s a market directional trade...ie dependent on market rising. I tend to short only on excesses. The one I mentioned was just too wide spread too far in time making it an arbitrage candidate...they closed the spread down to .40 just a day later...", "score": 1, "replies": [{"body": "you want the long version or the short version?\n\nthe short version is that we're almost always in contango, and even if we get to backwardation, it doesn't last for months on end. The long term will rise until we're in contango again. So have some capital, and brace if it gets bad.\n\nThe long version is: it's based on the distribution of possible VIX's. The VIX is right skewed, so the mean is always higher than the median. So the future trades at the mean expected price, but it'll actually end up at the most likely price, the median. This effect is stronger for longer terms. For example, if the vix is 20.15 today, I'd say there's a small chance that the vix will be 25 in a week. However, the chance that it'll be 25 TOMORROW is even smaller than that. And of course, the median is probably around 20.15 or slightly lower (I'd claim 20.05 or so). So, longer terms automatically give a higher mean / median ratio, which is why there must mathematically be contango. So right now, there's backwardation in the Oct-Nov, which must be resolved, and I believe it'll go to 0.40 in about 2 - 3 months. If we get a correction, maybe it'll go to like -0.25 or -0.30 or something, but will for sure get back up to 0.4 or more, even if the VIX would go up and stay up (even around 30) If the VIX goes up to 30 and stays there (for example, if the India variant coronavirus goes worldwide or something), then the back end VIX fut will go up to like 35\n\nI wouldn't dare do that in the front month. If the Jun-July was underpriced, for example, I'd think long and hard before buying that spread, because there's no time for it to come back to normal.\n\nPS lemme check the dec/jan. I ususally don't look that far. I stick to the first 7 months\n\nP.P.S. I own the position I've described, as well as others. So I have a vested interest in the price action I've described. caveat emptor", "score": 3, "replies": [{"body": "Always the long version :-)\n\nI have been studying VIX for almost 10 years and trading the futures for last 6 so you can’t possibly bore me talking about it.\n\nI usually don’t trade past M3/M4 either but this one was obviously out of line. Keep in mind however that the dec/jan spread has a bias to be bigly positive due to Dec Santa rally and Jan selloffs so you should not expect this to come and stay close to 0 like other pairs. I’m out of the trade at this time but will short again if the spread/vix=>.05\n\nI will look on Monday into your suggestion to see of that particular spread has a bias and where the sweet spot is.", "score": 2, "replies": [{"body": "You can verify what I'm saying by looking at the option implied probability distribution. Basically take the option fly for each strike to get the implied probability. \n\nFor example, short 25 long 2x 26 short 27 gives you the implied probability that the VIX will expire at 26 exactly. \n\nCalculate that for the whole strike surface,  and you'll get a distribution. You'll see that:\n\n1. Each expiration has a right skew\n\n2. The median is lower than the future. The mode is lower than the median\n\n3. The longer term expirations are fatter on the tails \n\nMy earlier argument is the logical conclusion of these observations (imo).\n\nLemme check out your claims too", "score": 1, "replies": []}]}]}]}]}, {"body": ">what exactly can happen here?...one contract to explode and the other to crash? In what universe is this even a possibility? So retarded!\n\nI hope these aren't your famous last words...", "score": 1, "replies": [{"body": "Lol...i know I shouldn’t have said that here with all the gamblers lurking and previous history of the saying but who trades volatility knows what I’m talking about. These are short term trades and this one in particular was on M8/M9 futures...so far out they move in tandem and wide spreads get corrected fast. What kind of event in present time would move dec future but not jan? No kind! Anyway, i was out of the trade a day later when the gap got closed by .40", "score": 2, "replies": []}, {"body": "I got demolished once -- the vix was at like 11 and the front month was in backwardation. It was fucking wild. I tried to hold until expiration and it fucking exploded on me. The usual contango then is close to like $1.50", "score": 1, "replies": [{"body": "I don’t think i ever held a future to expiration...i never hold past Monday if expiration is on Wednesday. There can be some manipulation at expiration...there was a famous example 2-3 years ago when some trader with just a couple mil bought some otm puts and bumped the vix on expiration by like a point when no one was paying attention.  For spreads, i never trade the front spread. If there is money to be made here I haven’t seen it in the data series...too much randomness for my taste.", "score": 1, "replies": []}]}]}]}]}, {"body": "That is wrong.\n\nVXX, UVXY is an ETN. It is like a stock and is physical settled and not cash settled. Therefore if it is in the money, you can then own the stock and wheel or do whatever as you see fit. The only thing to be aware of is the positive skew on the vol which could disrupt your calendar calculations\n\nVIX cannot be traded\n\n/VX futures behave as you describe and thus are on different underliers. You can still trade a calendar on it, though, it just behaves kind of weird since you have to keep in mind the basis risk too, so you can't just net the deltas. You have to consider the risk from the contango as well", "score": 5, "replies": [{"body": "Vxx and Uvxy are Etns but they hold a rolling position made of m1 and m2 vix futures contract. You can try to wheel them but in general since the underlying futures expire, the etn needs to continue rolling, until it decays to near zero and reverse splits.\n\nIf the m1 futures moon, vxx and uvxy goes up. Else they mathematically and slowly decay to zero over time.", "score": 1, "replies": [{"body": "Yes but the difference is:  futures are fundamentally different assets while the vxx and uvxy is one continuous asset and so the underlier for all options on the chain are the same,  while VIX future options are all independent", "score": 4, "replies": []}]}]}, {"body": "This is not accurate for VXX or UVXY.", "score": 2, "replies": []}]}
{"title": "134K gains in 2020. TSLA was my winner.", "selftext": "[removed]", "id": "nit48v", "created_utc": 1621720554.0, "score": 36, "upvote_ratio": 0.75, "num_comments": 18, "comments": [{"body": "Man only if I wasn’t caught up trying to win my gf back I would’ve been in tune with the market around this time", "score": 11, "replies": [{"body": "Lmao this was me in 2020. So much missed so sad", "score": 2, "replies": []}, {"body": "I’m right there with you bro I spent the beginning of the pandemic depressed over my girlfriend leaving me when I should’ve used my free government money to make more money in a recovering stock market. You win some you lose some", "score": 3, "replies": [{"body": "Bro same. Except i never had a gf, i just got depressed from not knowing what i want in life. If i had the mindset i have now about stocks, the market, and money back in December 2020. I could’ve been rich enough by now😔. But it starts now!", "score": 1, "replies": []}]}, {"body": "Stupid ape. Why u betha? Stonks over Birthing person", "score": 2, "replies": []}, {"body": "Don’t chase em. Replace em.", "score": 1, "replies": []}]}, {"body": "Oh no. This is when ya know Tesla about to sink even further . Gain porn from a year ago", "score": 8, "replies": []}, {"body": "Eastman kodak i remember that good times lol", "score": 5, "replies": [{"body": "Xerox..", "score": 1, "replies": []}]}, {"body": "Congrats or whatever the fuck but I thought it was bad when people were posting their January gme gains now we’re going back to 2020 shit sucks man 😔", "score": 3, "replies": []}, {"body": "Not a single long term hold, love it", "score": 3, "replies": []}, {"body": "Now show 2021", "score": 3, "replies": []}, {"body": "Everyone is about to cash out and call it a day on Tesla.", "score": -3, "replies": [{"body": "About to. It's not a car war it's a battery war. The automation software should have been open architecture like Linux and developed with a GitHub kind of affair.\n\nIt's batteries and load capacity war. That and energy density on batteries which is getting interesting.\n\nI read an article the other day that said buildings of concrete and rebar have a capacity for storage and discharge.\n\nThe real plays to come are all in green and capacity. What tech gets standardized as in plugs, connectors, filling / recharge stations.inevitable decline of a hydrocarbon market with a glut of capacity.", "score": 2, "replies": []}]}, {"body": "On what kind of nut?", "score": 1, "replies": []}, {"body": "No losers?", "score": 1, "replies": [{"body": "The cuck got called out and deleted this post. Hahaha what a loser", "score": 1, "replies": []}]}]}
