{"title": "FB and SNOW - Puts - TA", "selftext": " **Options Triggering:** \n\nFacebook, $FB, has finally climbed back to major resistance (purple highlighted line) that it has rejected three times in the last year. The length back to the 50 day MA (red line) is the same as the length of the decline the last time it tested this resistance. It is likely that FB will consolidate next week before testing the resistance again. More so, the stochastic RSI and MACD are both showing sign of overbought. Therefore I believe that weekly puts could work nicely here. Friday's session will show us which direction $FB will move, and then we can pull the trigger. \n\nhttps://preview.redd.it/ikltuzokvr171.png?width=1125&format=png&auto=webp&s=ad299e978226dac7983163367412c2fd814773b4\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n \n\nSnowflake Inc, $SNOW, is a highly underrated company. They. provide cloud-based data platform in the United States and internationally. The company's platform offers Data Cloud, an ecosystem that enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data.\n\nEarnings came out yesterday and they didn't do so well on paper, but actually this is one of the fastest growing billion dollar companies out there right now with some of the most million dollar contracts. Even with earnings underwhelming, $SNOW closed up more than 8% and looking like it is breaking through my resistance. \n\nPersonally I think this can go either way from here although I think it is more than likely to consolidate back to the 50 day MA which is currently intersecting with a strong trend line that has been both support and resistance dating back to last October. Like FB above, I'll be waiting for market open to see the direction before pulling the trigger. \n\nhttps://preview.redd.it/c8v8ocpmvr171.png?width=1120&format=png&auto=webp&s=765f206058206e2d499099a5d62932c2647606aa\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n \n\n*Waiting for set ups to trigger on the following before entering options:*  \n\n$DFS\n\n$V\n\n$SNOW\n\n$OKTA\n\n$GPS\n\n$BHP\n\n$AMAT\n\n$TTWO\n\n$MS\n\n$NAIL\n\n$FB \n\nPatience for a good entry is key.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n Here is a summary of key points that the Senate Republicans countered the Biden Infrastructure bill with. This is great progress and I believe that EV's and Semis will benefit the most from this. Especially since the EV credits could be up to $12,500.  \n\nhttps://preview.redd.it/03k873ftvr171.png?width=971&format=png&auto=webp&s=1f1f4b00073381a0a5c212c5dcdb8b6412b78291\n\nQuote from Morgan Stanley: “We believe the biggest beneficiaries of growing & extending BEV incentives will be based on who can produce the most BEVs (& batteries) to meet demand; GM & Tesla stand out here”\n\nTheir 12 month price target for TSLA is $880. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n Disclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.", "id": "nmnrko", "created_utc": 1622169078.0, "score": 16, "upvote_ratio": 0.87, "num_comments": 12, "comments": [{"body": "The fact the CEO of $SNOW makes more in option adjusted comp than the annual revenue of SNOW, in of itself, makes me want to buy puts", "score": 7, "replies": [{"body": "Frank Slootman did good things with ServiceNow.", "score": 1, "replies": []}]}, {"body": "It's probably not the correct place to ask, but, can someone point me to the place where I can understand how to read these bar charts and understand resistance(s)?", "score": 2, "replies": [{"body": "There are tons of resources online actually. You basically just need to google what you want to learn and take a minute to read about it.", "score": 2, "replies": []}]}, {"body": "Thanks!", "score": 3, "replies": [{"body": "You are welcome!", "score": 1, "replies": []}]}, {"body": "My man. Have you looked at AAPL? Curious to hear your thoughts. There’s a head and shoulders on the daily and a bear flag on the 4hr.\n\nWe’re also sitting on a bullish previous demand zone and a bullish macd daily crossover. I can’t make up my mind on this one.", "score": 1, "replies": [{"body": "AAPL is on major support from Covid right now as well as 180MA. I personally think it is good short term to $130.", "score": 1, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}, {"body": "AAPL looks like they are looking into crypto payments.", "score": 1, "replies": []}]}, {"body": "if your TA does not include the position of andromeda with relation to the milky way, I dont believe it will work", "score": 0, "replies": []}, {"body": "What sort of expiry do you look for on your options set ups?", "score": 1, "replies": []}]}
{"title": "What are the known secrets of the stock market that are unknown to ordinary investors?", "selftext": "Insider trading happens a lot more often than we know, because most of them aren’t caught. All it takes is an insider to tell X person (friend, family) that Y will happen to the company, and that person will buy/sell/short.\n\nIndividual investors have no control over the market. Institutional investors, however, can completely shift markets by a media comment. Look at what happened to Tesla and crypto when Musk goes on Twitter. People with status have a lot of leverage. Institutions (whales) with large sums of money can also shift the market when they buy/sell. That’s why you might see random spikes. That’s usually done by someone with a lot of leverage.\n\nThe stock market is essentially a transfer of wealth from those who are impatient and stupid to the patient and educated. It serves many people well when the majority of people in the game are uneducated.\n\nBeware of “pump and dump” schemes. A group will hype up a stock, pump loads of money into it to jack up the price, when other laymen see the trend and don’t want to miss out on profits so they pump their money in, the original group will dump their stock, cash in the profit, and essentially crash the value.", "id": "nmuhji", "created_utc": 1622196402.0, "score": 22, "upvote_ratio": 0.81, "num_comments": 21, "comments": [{"body": "Nobody tell him", "score": 16, "replies": [{"body": "He’s not ready", "score": 6, "replies": []}]}, {"body": "The game was rigged from the start.", "score": 22, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Bad bot", "score": 4, "replies": []}]}, {"body": "You never actually own any of your stocks\n\nhttps://www.reddit.com/r/Superstonk/comments/mvk5dv/a_house_of_cards_part_1/?utm_medium=android_app&utm_source=share\n\nGive this a read, you would be surprised", "score": -1, "replies": [{"body": "Individual Stocks is on a ledger in the brokerage account and has voting rights to the company. ETF's & mutual funds investors owns the funds and has no voting rights.", "score": 3, "replies": [{"body": "So is the link “house of cards” wrong? That you actually do own the stock?", "score": 2, "replies": [{"body": "Yes, your the owner in name of the individual stock, voting rights, stock splits,  and class action suits if necessary. I don't click on links due to security concerns.\n\nWhat Is In Street Name?\n\n\"In Street Name\" is slang for when a brokerage account holds a customer's securities and assets under the name of the brokerage firm, rather than the name of the individual who is the legal owner of a security. Although the name on a stock certificate is not that of the individual, they are still listed as the real and beneficial owner and have the rights associated with the security.\n\nAdvantages of Street Name\n\nConvenience\n\nImagine the amount of work that would occur if your broker held stocks in your name. Every time you needed to sell them, the broker would have to find the exact stocks you own and deliver them to the buying party. They would then have to send the shares back to the company to have the name on the certificates changed to the new owner's name.\n\nThis process would take a great deal of time and effort, not to mention the fact that you wouldn't collect payment until the purchasing party physically received the stocks. By holding the securities in street name, the broker can avoid most delays associated with the transfer of ownership and quickly execute trades at a minimal cost.\n\nThe cost savings of registering securities in street name can provide a material boost to investment returns.\n\nSafety\n\nIf brokers were to hold the physical security certificates, there would be an increased risk of physical damage, loss, and theft. By keeping them in street name, brokerages are able to retain the securities electronically. That reduces the probability of disastrous events occurring.\n\nThis safety is also extended to payments. By holding the securities in street name, the broker is ensuring that they will be delivered promptly when a transaction occurs. This system removes any uncertainty that would exist if the customer were responsible for providing the security every time a trade took place.\n\nFinally, almost all broker-dealers in the United States are members of the Securities Investor Protection Corporation (SIPC). According to the SEC, investors holding securities in street name are covered by up to $500,000 of SIPC insurance.", "score": 1, "replies": []}]}]}, {"body": "The brokerages are a part of the [Indirect holding system](https://en.wikipedia.org/wiki/Indirect_holding_system). As their customer you also participate in it. Yes, you're not the registered owner of the stocks, but you can trade more quickly, efficiently and you are shielded from the obligations that come with actually trading stock (instead of changing your allocations in the broker's ledger).\n\nIf you want, you can be registered as the owner of the stock. To do so, you need to contact the Stock Transfer Agent for that stock. For example: Vanguard are the STA for their own ETFs.\n\nA bit more info about the [Direct holding system](https://en.wikipedia.org/wiki/Direct_holding_system#Electronic_system_in_the_US)", "score": 1, "replies": []}]}]}, {"body": "The greatest secret is, that the average retail investor has an incredible number of advantages over larger and more developed funds.  The fact that you are at a disadvantage, is the ultimate \nlie.", "score": 6, "replies": [{"body": "How?", "score": 4, "replies": [{"body": "For starters, you can enter and exit a position without moving the stock itself.  Secondly, you can buy or sell exactly when you want and however you want (there’s no charters, rules, oversight committees or boards to meet with to gain approval and no fixed processes you are forced to follow).  Third, you don’t have to diversify to certain standards (you can buy as much as you want of your favorite pick without having to then buy twenty other stocks with near equal weighting).  You don’t ever have to make choices based upon what your boss thinks, or whether or not it could get you fired or make you look stupid (you can afford to take unpopular stances and can wait to be right).  All massive advantages.  \n\nThe one advantage that you could argue that major funds have is “information”.  But most of them are looking at all the same things you are and making predictions just like you.  The secret “insider information”?  If it’s secret, it can also be a lie.  It could be a rumor that turns out not to be true, or gossip, or a total fabrication.  By the time you work out the losses you take from the fake secrets and weigh them against your gains from the real secrets, you are back to square one.  Trading like everybody else with the only information you can truly trust.  Publicly available and vetted filings and mainstream news and investor conferences / calls.  All the things that everyone else can do as well.\n\nYou are more nimble, flexible, and capable than most funds can ever be.  YOU can do all the things that THEY wish they could.  That’s the truth, and it’s an obvious truth.  Their whole profession however relies upon you not realizing it.", "score": 1, "replies": [{"body": "Well said and thank you for this...embrace advantages of retail rather than complain about being disadvantaged by institutions/hf's.", "score": 1, "replies": []}]}]}]}, {"body": "Way late here. Found this on a Google search. In this day and age, it's hardly real. I say this as a  successful investor/trader (not every year of course, but the overwhelming majority, I've done really well). I've seen it rapidly change over the last decade. I used to sit on small cap sell orders for 2-3 days at a time when things were slow...just waiting on the next sucker tbh. Now, it's gone in the snap of a finger and I get a statement immediately. It sure seems to me like computers doing 99% of the trading AT ALL times. Also seems to me, it's for no other reason besides feeding human impulse and keeping the players coming back for more. It's a computer game now. Learn how the game works and one will succeed in it. Find the cynic within is the only advice I give people. That was my only advantage...seeing it for what it really was. It rarely has anything to do with company funnymentals or the like (in the short to medium term). Over the long term, the best companies provide the greatest gains but thats a game of luck without firsthand info. The entire industry is in place (analysts, funds, money managers, etc.) to keep you coming back. It stimulates the pleasure center of the brain and their job is to manage hope essentially. We all want more, more, and more. A taste of that possibility and \"managing a portfolio\" is enough for most. While the big boys (who are market neutral at just about all times) buy mansion, after mansion, after mansion. Don't be the fool.", "score": 2, "replies": []}, {"body": "The stock market is a transfer of wealth period. Education has nothing to do with it. All the analytics on earth don’t matter if the money believes in the value of the stock, especially in a bull market. \n\nThe market is a leaky system in which the same money moves from one stock to the next and back. Swashing back and forth like mouth wash. The retail investor is always the chump, putting in new money that the whale will take off him when he sells.\n\nThe retail investor has absolutely no idea what is going on and therefore The retail investor’s money is the markets profit. \n\nSince you don’t know anything, then every investment is a 50/50 bet. “Diversification” is just another word for make as many 50/50 bets as you can afford. \nIf you win sell and make more 50/50 bets based on general market direction.\n\nThe whole thing is nothing more than Vegas in suits. You are the chump. Never forget this.\n\nNow if you are a multimillionaire, then it’s a different story.", "score": 5, "replies": []}, {"body": "That GME is going to be infinitely squeezed", "score": 4, "replies": [{"body": "Buy, Hold & Vote!", "score": 3, "replies": []}]}, {"body": "Ok", "score": 2, "replies": []}, {"body": "Buy BB", "score": 2, "replies": []}, {"body": "You really thought they are going to share it 🤣\nAsk your Aunty for that awesome cookie recipe..lol \nEven ordinary people don't share secrets and you thought business people would :)", "score": 1, "replies": []}]}
{"title": "Meme stonks strategy", "selftext": "I got into AMC yesterday on the break above the highs from a couple months ago. I’m doing the same with a few other meme and high short-interest stocks which could see rapid gains in a short amount of time on the hype. I already made quick gains on JMIA, SPCE, and BYND. My strategy is always to have a stop loss I’m OK with, take partial profits on any jump up, and constantly raise stops as price appreciates. I also keep my position size small compared to my total portfolio. \n\nAs a part of the general market I think the moves back to meme stocks is because people are frustrated where stocks are still bottoming and consolidating. The crypto correction has sent traders looking for wild gains elsewhere. This is causing rushes into smaller names wherever momentum starts to pick up and it means the moves could be short-lived. \n\nMarkets get more and more wild as a top happens. Then it seems like just another dip when a decline has really begun. At this stage of the bull market while I’m being aggressive when the moment is right I will prioritize safety and honor my stops if things don’t go as I hope. \n\nHave a set strategy in any stock you buy.", "id": "nmvq9o", "created_utc": 1622201124.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 14, "comments": [{"body": "I use stop limits, and would highly recommend anyone do the same. It gives you a buffer in case of a flash crash, and ensures (well not completely, actually) that you get paid the price you set.\n\nMeme stocks tend to suffer from flash crashes a tad more often than normal stocks. Wonder why 🧐", "score": 2, "replies": [{"body": "New investors + herd mentality can make for some wild moves. When a stock runs out of bids or asks and traders make market orders it causes huge spikes and swings.", "score": 1, "replies": []}]}, {"body": "I bought AMC this AM and now it is in the red (since I bought) - is there still upside and at what price do you recommend selling?", "score": 0, "replies": [{"body": "No clue. Know what you are willing to risk and hold to it. Its just gambling that more people will keep coming in, but no one knows when that momentum will stop. I set breakeven stops on any new meme stock positions once they go positive at all.", "score": 1, "replies": []}, {"body": "Be careful with meme stocks I was able to recover the losses from some of the meme stocks that were mentioned on WSB thanks to Virgin Galatic but as far as AMC there is no telling on what is going to happen with its price some think it’s going to go to $50 a share it might fluctuate between 25-36 a share today since it’s a shorter trade day", "score": 1, "replies": []}]}, {"body": "AMC has so much HYPE behind it right now.  \nLiterally AMC is going to rocket into the 100s next week  \nprolly close today around 50 bucks a share today  \nbut the ITM calls that will expire will force a gamma squeeze next week   \nnext week is going to be BANANAS! BANANAS! its going to be insane  \nAMC is going to be the largest short squeeze mankind has ever seen in history !   \nmark my words! [https://discord.gg/8HKNPY3v](https://discord.gg/8HKNPY3v)\n\n  \nape helps ape btw. if amc moons before gme amc apes will buy gme and force it to squeeze paraboic as well  . watch & mark my words! but hopefully gme and amc moons at same time", "score": -1, "replies": [{"body": "I just want to take a small slice. Getting greedy will lead to problems eventually. Take partial profits when it really jumps and raise stops on the way up is how I manage these trades. Crazy times.", "score": 1, "replies": [{"body": "Roger that", "score": 1, "replies": []}]}, {"body": "Check post history.", "score": 1, "replies": []}]}, {"body": "I use stop-loss when ready to take profits. I have a hard time setting a stop-loss when I enter. It’s emotional thinking about how much I’m willing to lose.", "score": 1, "replies": [{"body": "It is hard to think about, but necessary if you are balancing the probability of that loss versus your expected gain. Setting a stop loss when I enter has stopped me from making many bad decisions because it makes me realize the risk I’m taking is too high for the gain I expect to make.", "score": 2, "replies": []}, {"body": "I use the stop loss as well and when I do, it works and I get out in the green, however minimal.", "score": 2, "replies": []}]}, {"body": "I don't think it's wise to use stop limits during a squeeze until the top is officially in. It will be a visible plateau, not a sharp increase or decline. Stop loss hunting is a thing, and could make you miss out on huge gains.", "score": 1, "replies": [{"body": "I disagree. I use stops to make sure the position I take doesn’t go for a bigger loss than I’m comfortable with. That’s important in any trade. Once it jumps like AMC and BB have, I move stops up to breakeven to assure no loss, or to lock in a gains. Not doing this leaves me open to being an emotional trader in the moment and take risk I’m not willing to accept.\n\nI agree the volatility can get extreme. The stops i use leave a wide range of room to work. If there is too big a gap between current price and my stop I just take gains. Then if price falls and action still looks strong I get back in and repeat the process.", "score": 1, "replies": []}]}]}
{"title": "Is Tesla Stock Actually Overvalued? Michael Burry Might be Wrong", "selftext": "", "id": "nmxjl7", "created_utc": 1622207531.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 13, "comments": [{"body": "he bought his puts when TSLA was $900 early Jan.. he already made a killing -$300 Million or so, hes not wrong lol, nost likely closed position already", "score": 1, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "because he is not wrong, why you put a title like that? thats what i am answering to, i dont need to watch a video to know he is NOT wrong", "score": 4, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "change your title then, clickbite", "score": 4, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "It's baitey, but don't be ashamed. Everyone does it.\n\nHas Burry every said Tesla is over valued? I honestly don't know", "score": 6, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Alright. You got me to watch it. I'm watching it. Here have a thumbs up.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Really depends on how soon vehicles are released and how well they preform. \n\nIf Tesla does take over the semi truck realm its super undervalued right now. If all their cars flop its super over valued.\n\nIts not as easy as bad vs good", "score": 1, "replies": []}]}
{"title": "Question about hosting Netflix and Disney+ on AWS", "selftext": "[deleted]", "id": "nmmoz4", "created_utc": 1622165388.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 11, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "No thats now how it works. AWS can not access their code or data.", "score": 20, "replies": []}, {"body": "Well for one, I'm sure if aws was caught stealing secrets from users they would be absolutely screwed. Like, stock dropping 50+% from all the big fish canceling their deals in addition to any legal trouble.", "score": 21, "replies": []}, {"body": "My company is a competitor to a few Amazon services and we host 90% of our infrastructure in AWS. There is zero worry about them stealing our code or data", "score": 3, "replies": []}, {"body": "AWS provides the infrastructure for streaming and it has cost advantages over Azure. I believe there is an agreement to protect the content and it will be no problem. Further, sometimes the rival could become a partner and it is common practice. Apple buys AMOLED or screen from Samsung, even the first iPhone powered by Samsung chip. Nvidia and AMD both powered laptops manufactured by Dell or Asus..and so on, and so on", "score": 2, "replies": []}, {"body": "It would be crazy illegal for Amazon to steal code, and monetarily AWS is the best option.\n\nCompanies aren’t countries, they don’t usually go to total war with each other just because.\n\nApple and Google are basically mortal enemies, but Google gives Apple $10 billion in cash a year to be the default search engine for Safari.", "score": 2, "replies": []}, {"body": "Idk but must be a reason", "score": -9, "replies": []}, {"body": "Scale and growth, also when NTFX started there really wasn't another cloud operator like AWS.  \n\n&#x200B;\n\nThere is absolutely no way AWS would steal their code, not to mention that's really not how AWS works...  They run FedRamp and various high-security workloads, if there was ever a chance AWS was illicitly accessing data it would be catastrophic.", "score": 1, "replies": []}, {"body": "Technically their code and data are on AWS servers but:\n\n1.\tAll larger companies use all three big cloud service providers in some capacity.\n2.\tThey wouldn’t risk their multi million dollar per month contract with Netflix. Plus other companies including federal governments would probably look into terminating their contracts if this news came out \n3.\tAnd no one cares about each other’s code. Maybe what’s in their data warehouse but it’s all about the content on the platforms. (See their purchase of MGM)", "score": 1, "replies": []}, {"body": "Technically speaking Netflix ist nothing special imho. Maybe the user data, but even that for “Amazon prime”? Dunno\n\nAnd I’d say that Netflix’s contracts are worth more. Or their license for shows / movies.", "score": 1, "replies": []}, {"body": "AWS is secured against everyone including AWS.", "score": 1, "replies": []}]}
{"title": "Tesla Apps ? Store ?", "selftext": "", "id": "nmqz25", "created_utc": 1622180942.0, "score": 11, "upvote_ratio": 0.77, "num_comments": 15, "comments": [{"body": "There is APPS, GAMES & a STORE ???\n\nWhy they don't put games and store sub APPs?", "score": 4, "replies": [{"body": "🤷‍♂️  Dunno but well in Apple App Store you have Games and Apps seperated 🤷‍♂️", "score": 4, "replies": []}, {"body": "Because all input is error.", "score": 1, "replies": []}]}, {"body": "From FIG.6C : https://uspto.report/patent/app/20210156705?fbclid=IwAR0Vcpr7CTbVFJUcFbBqPQcE-hF4sQNpMWJmBspqD9m1sn6wG-4G51N5zWQ#D00007\n\nWhat’s your take on that ? And when will we see the Tesla App Store ?", "score": 1, "replies": [{"body": "They will definitely have a store, but I don’t think it’ll matter financially for a long while.", "score": 8, "replies": [{"body": "Woaw you really think that ? That will be a cash cow. Just look at how much cash Apple generate with their Store", "score": 1, "replies": [{"body": "How? Apple nets something like $20/device/year from the app store right now. That's a big deal when you have a billion phones and tablets. It's not a big deal if you have only a few million cars. Someone will pay 1% of the phone's purchase price to buy a game or app without thinking about it too much. That won't be true in a car because most people don't throw hundreds of dollars around like that. What apps could actually produce a meaningful amount of revenue? FSD, acceleration boost and anything else Tesla software locks. What do you think they'll sell that they aren't already selling?", "score": 2, "replies": [{"body": "I think the comparison is flawed.\nAlmost anyone with employment can sign up for a iPhone through a carrier payment plan.\nTesla owners at this point in time are certainly wealthier than most, and probably have more disposable income.", "score": 1, "replies": []}]}, {"body": "The most profitable part of the store will be the Tesla performance and feature upgrades.  The things you can do through the app will also be available in the store,  but Tesla will likely add more of them.", "score": 1, "replies": []}]}]}, {"body": "Yeah could come with V11? Maybe we’ll here more about it next week:))", "score": 1, "replies": []}]}, {"body": "i don't see $$$$$ unless it can play both PlayStation AND Xbox games", "score": -2, "replies": []}, {"body": "So, this is progress?! Who cares about games? I have an Xbox at home if i want to play games.", "score": -3, "replies": [{"body": "Sitting in my car playing games while it’s charging would be epic\n\nHuge game changer for road trips among millennials", "score": 2, "replies": [{"body": "Was thinking the same.\n\nI'd pay to have some games while I'm charging.", "score": 1, "replies": []}]}]}]}
{"title": "Auto Trader Best Car for Families Award 2021 – Tesla Model 3", "selftext": "", "id": "nn0pmt", "created_utc": 1622216804.0, "score": 111, "upvote_ratio": 0.98, "num_comments": 12, "comments": [{"body": "Only because the Model Y is not sold in the UK yet.", "score": 23, "replies": [{"body": "Hopefully the Berlin Y will be worth the wait. Megacastings, new paint shop, structural batteries and (at the moment, fingers crossed Brexit doesn't cock it up) no 10% import duty.\n\nNot long now..", "score": 2, "replies": []}]}, {"body": "I love that the US Auto Trader site has a list of \"Best Electric Cars in 2021\" that includes zero Teslas, while the UK site has the Model 3 as \"Best Car for Families\", among all car types.  Then again, their review of a \"family\" car seems to be based on actual surveys rather than dealer marketing material, and made zero mention of safety.", "score": 12, "replies": []}, {"body": "Wish the Model Y was cheaper. Definitely a better vehicle but much too pricey.", "score": 2, "replies": []}, {"body": "Love my model three but seems a bit small for a family car. Even with just one kid it would start to feel tight for road trips", "score": 5, "replies": [{"body": "We pack it full to the brim with a great dane and 2 person's gear for 1-2 weeks and it's always been spacious feeling still on long drives compared to most sedans I get into. We normally pack blankets and such under the dog seat cover for optimum storage and a nice dog bed at the same time, which means the dog looms over us even more than normal if she's standing to stretch. Must just depend what your needs are for one kid but I doubt we'll have problems making that work.", "score": 7, "replies": [{"body": "That’s sort of my point, you pack it full to the brim with one big dog. There’s not much space left. And I think a kid needs more stuff than a dog, what about the stroller etc.", "score": -2, "replies": [{"body": "I think you missed the multi week statement, and a large dog needs a 5 gallon bucket of food for a 2 week trip on top of the usual fully packed bookbag (tbh, I'm under the impression our large dog requires more things than a child on average). We also had a set of beach chairs which are awkward sized and difficult to pack around (probably similar to a stroller), and an extra backpack of stuff for two adults to work remote on top of separate clothes bags and bathroom supplies. Less obvious things we pack are food for road trips so we don't burn money unnecessarily, so coolers and snack bags littered throughout the frunk and trunk.\n\nI'm convinced there's plenty of room for road trips with kids, but I was a kid raised in middle class with tiny sedans shoved in with my sister for 24 hour trips. It worked out, and this car is way more spacious and the planned stopping regimen should make it easier for setting kids expectations while traveling.", "score": 3, "replies": []}]}]}, {"body": "Lol what? Our model 3 is considered a pretty decent size sedan in Northern Europe. Easily big enough for a family with 2 kids.", "score": 6, "replies": []}, {"body": "Right? I mean it _is_ a sedan after all.", "score": 1, "replies": []}]}, {"body": "Such a load of shit. I own a model 3 and have two kids and i find it cramped and not nice at all to get them in and out. I am literally selling it to get a model X because it is not good with a family.", "score": -2, "replies": []}]}
{"title": "Tesla releases Conflict Mineral report, extending history of humane mining practices", "selftext": "", "id": "nn8fvt", "created_utc": 1622238134.0, "score": 63, "upvote_ratio": 0.96, "num_comments": 16, "comments": [{"body": "This appears to be a compromise for the [4th proposal](https://www.rev.com/transcript-editor/shared/bddnAgrmqDzx7qFVetaIWEpnW5_Uy8_ik7KKaAdWHN2uEQPSNj4aZCUeJiAQK53DH-L25vOGrkZKaCOSJ00UeI78pP4?loadFrom=PastedDeeplink&ts=3454.35) from the shareholders meeting last year, concerning Human Rights, with a special mention about DRC and Cobalt.\n\nThe proposal was voted down.\n\nEDIT: reread the report - dated 12/2019, yeah this old and has no mention of Cobalt.", "score": 10, "replies": [{"body": ">In addition to our efforts regarding conflict minerals, Tesla continues to monitor our supply chain for other areas of risk contrary to our values, such as the sourcing of cobalt from the DRC. Our efforts in this area include due diligence efforts in line with OECD Guidance and the RMI’s Cobalt Reporting Template. Moving forward, additional information regarding our cobalt sourcing practices and oversight will be provided through our annual Impact Report available on the Tesla website.", "score": 8, "replies": [{"body": "ahh did a search, must of fat fingered `cobalt`\n\nin any case, the sooner they move away from cobalt the better.\n\nI still don't like that they rely on 3rd party auditors.  I mean who is going to admit they buy from artisanal miners that use children?", "score": 7, "replies": [{"body": "They aren't moving away from cobalt for all lines. That's not how chemistry works.\n\n>I still don't like that they rely on 3rd party auditors.  I mean who is going to admit they buy from artisanal miners that use children?\n\nIt's just some NGOs trying to shake money , unsuccessfully. It's not an actual issue. No one cares.", "score": -1, "replies": [{"body": "as a shareholder, I care", "score": 4, "replies": [{"body": "Well , the majority of us don't , given most of us know how it's complete bullshit.", "score": 1, "replies": [{"body": "> given most of us [know] it's complete bullshit.\n\nWe know because of a 3rd party auditor, that's my question, do they ever report, well these suppliers use child labor in their sourcing from miners? If so, who?\n\nMy bet the number is 0.", "score": 1, "replies": [{"body": "No , we know because of how baseless the source of the claim was. Tesla sources batteries LG chem ( not an issue with Panasonic \n\n[From article](https://electrek.co/2016/01/19/automakers-battery-makers-cobalt-child-labor/)\n\n >Even tough Tesla Motors’ battery cells are made using cobalt for the cathode, the company is not named in the report because its main battery cell supplier, Panasonic, sources its cobalt from the Philippines and not Congo. \n\n) , which sources it's cobalt from Umicore. They allegations are against Unicore's procurement , but the suit presents no proof regarding that nor is Umicore named in the lawsuit , opting instead to go after large cap companies like Tesla and Apple that they can shake for money.", "score": 1, "replies": [{"body": "thanks for the information, given me a place to start....\n\n>As Umicore’s cobalt supply is exempted from any artisanally or small-scale mined materials (ASM), in 2018, more than 75% of the cobalt raw materials entering our battery material supply chain originated from large-scale mining (LSM) activities in the Democratic Republic of Congo and were refined by Umicore or at facilities scheduled for audits by Umicore.\n\nhttps://www.sciencedirect.com/science/article/pii/S2214790X21000290", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Lmao what", "score": 1, "replies": []}]}]}]}]}]}, {"body": "A report? Reading? Nah fam, I'm just going to sit here on the internet and critique Tesla for building all their cars out of lithium mined by the entire Congolese child population.", "score": 2, "replies": []}, {"body": "WHAT. We fucking voted this bullshit down 80/20 last meeting.", "score": 1, "replies": [{"body": "How is this bullshit? It's responsible consumption. \n\n> In the report, Tesla outlined its processes for securing minerals used in its products, ensuring they are obtained in humane ways that do not involve any child labor, human trafficking, or slavery. Many of the minerals are obtained through the efforts of Tesla’s suppliers. The minerals must be “DRC Conflict Free,” meaning that the materials do not benefit “armed groups in the Democratic Republic of the Congo, or any adjoining country", "score": 7, "replies": [{"body": "Because the shareholders voted it down. \n\nBecause it could disrupt the supply chain.", "score": 3, "replies": []}]}, {"body": "I think they’d want to do supply chain reports regardless of the shareholder proposals \n\nSome of them are pretty whacko\n\n>\tFor example, if the Elon Musk cared about implementing a zero tolerance child labor policy, instead of having a useless paper policy, Tesla could employ satellites or drones at every mine it sources from to actually monitor child labor. I encourage all Tesla shareholders to vote for item seven, human rights disclosure. Thank you for your attention.\n\nSatellites to watch ages of miners?! Lunacy. That by itself discredits their “research” into the extent to which Tesla was even dependent on such mines in the first place. Same people who think Elon is wealthy due to apartheid inheritance and that he actually was involved in a Bolovian coup to secure  Tesla’s lithium supply chain. Loony toons be loony toons", "score": 3, "replies": [{"body": "Not crazily out of the picture to do it. AP did it to catch slaves. [https://www.ap.org/explore/seafood-from-slaves/ap-tracks-slave-boats-to-papua-new-guinea.html](https://www.ap.org/explore/seafood-from-slaves/ap-tracks-slave-boats-to-papua-new-guinea.html)\n\n&#x200B;\n\nBut probably easier just to do supply chain auditing and literally just send a jet with 3 Tesla employees to go check.", "score": 2, "replies": []}]}]}]}
{"title": "tsla selling covered call against losing LEAP", "selftext": "so I bought tsla call leap expiry Jan/21,2022 in jan 2021 for $230 premium, current premium is $55.\nStrike price $800\nCurrently leap is -90%.\nIs it good to sell covered call against the leap and if yes then @ what price and quantity?\n\n\nThanks", "id": "nmmw03", "created_utc": 1622166051.0, "score": 9, "upvote_ratio": 0.91, "num_comments": 18, "comments": [{"body": "What you paid doesn't matter.\n\nIf you paid $100,000 for a Honda Civic, it's no different than if you paid $25,000 for a Honda Civic.\n\nYou have minus money and plus Honda Civic.\n\nWhat you should do with it is whatever you would otherwise do with a Honda Civic.  Drive it or something.\n\nIt would make zero sense not to drive a Honda Civic just because you paid $100,000 for it.  Nor would it make sense to sell a Honda Civic for 10k just because you paid $100,000 for it.\n\nHow to choose strikes is a different problem.\n\nI have never heard anyone make a convincing argument as to why one strike should be chosen over another.  I have heard tons of stupid arguments, though.\n\nChoosing strikes is part art and part science and it's something you have to get a feel for yourself.\n\nFrom my perspective, it's a terrible idea to choose strikes based on delta, for what that's worth.\n\nThe only metric that makes sense to me is one which maximizes profits and minimizes losses.  In my experience, far OTM doesn't do that.  Data I have read also does not support choosing far OTM strikes.\n\nIf you can't sleep at night unless you are writing far OTM, then write far OTM, I guess.", "score": 13, "replies": [{"body": "Not to hijack the thread but it's there any strategy you think would use far OTM options or is it really just a lotto ticket hoping you'll get ITM before expiration?", "score": 1, "replies": [{"body": "This guy is saying *selling* far OTM options for little premium (*to* the gambler) isn't really profitable, but it is a little safer.", "score": 7, "replies": []}, {"body": "He is talking about writing the far OTM option so you would want to stay OTM.", "score": 3, "replies": []}, {"body": "Far OTM options are typically the most mispriced options.\n\nThat means they are being sold for too little premium compared to the risk involved.  That's bad for sellers.\n\nIf you intend to buy options, which I would generally suggest you don't, then there is a case to be made for buying far OTM options.\n\nMarket makers like Jane Street often keep far OTM options on the books as a hedge against catastrophic market declines.  They hold them as a cost of doing business.\n\nIf you want to treat investing like a business, you might consider doing the same.  I personally don't do that as of right now.  I have at least considered starting to do so.", "score": 3, "replies": []}]}, {"body": "What are the drawbacks of using delta to pick strikes?", "score": 1, "replies": [{"body": "It doesn't really impact your P&L, for one.  Just ask Karen the Supertrader.  She made great returns on like 99% likely to be ITM sells, then the 1% happened and it sunk her 9 figure fund.\n\nOptions are priced so that if you win 9 times out of 10, then on the 10th time you will give back all the money from the 9 times you won.  If you win 99 times out of 100, then on the 100th time you will give back all the money from the 99 times you won. \n\nAlso, people are stupid and they have serious difficulty with probabilities.  Play Xcom if you want to see this.  If the game tells you that you have an 80% chance to hit, your mind will translate that into \"can't miss\", like it's 100% or something.  Same thing if the enemy has a 20% chance to hit you or something, your brain will tell you that the enemy effectively has 0% chance to hit you.\n\nEvery person thinks they are an \"above average\" driver, even though half the people must be below average.\n\nThirdly, just because some stock has X delta, that doesn't mean that it really has that chance to be ITM or whatever shorthand you might be using delta for.  Those numbers are just guesses, even if they tend to be pretty accurate.\n\nIt's better just not to use probabilities in your decision-making.  Especially since it doesn't really help you anyway.", "score": 1, "replies": []}]}]}, {"body": "Look, if you are down 90% you probably don’t want to set up a diagonal.  If you still believe in Tesla try and roll up and out to keep the position alive.  If you don’t, then close the position and take the L like a man.\n\nYou don’t want to set up a PMCC unless the LEAPS has a delta of 75% or greater because if the underlying blows past your short strike you’re going to take a bigger loss.", "score": 4, "replies": []}, {"body": "Sell 30-45 DTE at 30 delta. Roll it out for a credit periodically", "score": 3, "replies": []}, {"body": "I would definitely sell calls against it.  What strike price is not as easy to answer.  What is your break even price in your LEAP? Or original strike price?", "score": 0, "replies": [{"body": "Edited. Strike Price $800", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, not sure about delta in Jan 2021 when I purchased. tsla was around 850ish then", "score": 1, "replies": [{"body": "Okay, so you can't go back in time to fix your mistakes.\n\nHowever, let me help with 1 thing here. A \"LEAP\" is usually understood as being Deep ITM, a .7 Delta on a glacier moving stock and a .9+ on a volatile one like Tesla.\n\nSo can't fix any past mistakes so let's not harp on them.\n\nIn order for it to be a \"covered\" call your selling of a call strike needs to be above $800. If you sold at a lower strike, that wouldn't be \"covered\", that would just be selling a naked call (although you would have some backside protection in the rise of your current call).\n\nThere's not much premium to be had above $800 and you're breakeven is $1,030.\n\nA July 02 strike of $1,050 will net you $65 (which is a tiny fraction of your $23,000 investment). \n\nIf Tesla did Zoom past $1,050. You'd net $2,000 above your breakeven and the $65. However, you'd lose the time value from July to January. \n\nUltimately, being $23K in and your contract currently worth $5,500.\n\n1) Cut your losses now. Take your $5,500 and walk away\n\n2) Wait for the next Tesla upswing (if there is one) and reevaluate at cutting losses at that time,\n\n3) Ride it to $0 or the moon, because as of now, you need Tesla to make all time highs, probably around $950 by end of July to make your contract get back to break even.", "score": 1, "replies": [{"body": "Planning to hold on for 1 more Q.\nJan,21 2022 has highest open interest for strikes $1030,1300,800 and 1000", "score": 1, "replies": [{"body": "Learn from the experience.\n\nFrom the outside it looked like you had no plan other than to purchase a contract and hope/expect Tesla to keep rising.\n\nEvery purchase (especially on options) should come with a plan.  That plan should account for multi scenarios.", "score": 1, "replies": []}]}]}]}]}, {"body": "Damn man that’s ruff.  The proper way to do a LEAP is deep deep in the money.  You need for it to it $1030 to break even.  Which isn’t impossible but I wouldn’t count on it.  If you sell a CC every week for like a $700 in premium you will make money on it, but good luck not getting your short call in the money at some point and cutting into your profit by having to roll or manage some other way.", "score": 1, "replies": []}]}]}, {"body": "You're in a tough spot here.  \n\nFrom a news standpoint, Q2 numbers are forecasted to be very good.  If you're going to hold the LEAP for now, you might as well sell premium.  Strikes and expiry at your discretion.", "score": 1, "replies": []}, {"body": "You are already down 90%. Just hold it, prospects for TSLA for EOY are very good. You won't make all your money back by selling calls against it without exposing yourself to a lot of risk.", "score": 1, "replies": []}]}
{"title": "Another stupid idea I thought of right before I went to sleep.", "selftext": "So, I had this thought with AMC skyrocketing, obviously I wouldn’t do this on AMC so let’s use a more secure stock. AAPL, trading at 126.04, what if you bought 100 shares at 126.04, did a sell call on it at 126.00, the premium for AAPL next week June 4th is 113$. That means if by next week if AAPL is at 126$ or higher then you would sell the 100 shares at 126 with a -4$  but wouldn’t you technically make money because of the premium? Because you’re total profit in this case is 113-4=109$ for the week. Is my logic flawed? Or wouldn’t this technically be an easy way at getting money through premium?", "id": "nmp2kf", "created_utc": 1622173813.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 10, "comments": [{"body": "Yes it will work. \n\nYou can get same risk reward with less capital by selling put at 126 or by put credit spread 126p/106p or call debit spread with short leg at 126 and long deep ITM.", "score": 9, "replies": []}, {"body": "Yes but\n1. Your underlying could tank\n2. You are putting up 12600$ to make 100$, i supposed if you can consistently pull this off it aint bad but... in the long run idk about this", "score": 6, "replies": []}, {"body": "If you are going to buy the stock any way. sell a put until you get assigned. Hold those shares for as long as you like. Then, instead of selling the shares sell that call. if you sell one close to the money really far out you can collect dividends for that period. boring and slow. buy back the call when ever you feel.", "score": 2, "replies": []}, {"body": "You're not wrong, but you need to consider the risks of ATM. The stock would have to be higher than $126 in the first place for your call to be exercised, and it can drop to theoretically 0, but more likely 2.49 by current IVx. Considering worse case scenario a drop of 2.49 or higher you would loose $249 - credit received + $4 difference + commissions if applicable. Also, some brokers don't like risky positions so they might force close your position.", "score": 2, "replies": []}, {"body": "If Apple drops to $124.90 (or lower) at expiration then you lost both money and time.", "score": 2, "replies": []}, {"body": "It's easy money when you guess right and potential unlimited loss when you guess wrong.\n\nThere's much, much safer ways to make $100 with significantly less capital. Sell a vertical put spread if you're bullish. Or an iron condor if you're neutral.\n\nWant directional delta for a fraction of buying the shares? Try a ZEBRA.", "score": 1, "replies": []}, {"body": "Thank you guys again!", "score": 1, "replies": []}, {"body": "Logic is correct, but the plan is pretty faulty. At $113 premium profit, that means you expect AAPL will not move up by more than $1.13/share in the next week. That is a gain of 0.89% basically. If AAPL moves by more than $1.13 up you would be better off just holding shares and selling them for a profit.\n\nThe reason why this is not going to be worth it on a stock like AAPL is because it CAN easily move +/- 0.89% and if it moves up you are missing upside, but if it moves down you are easily breaking even/losing. Since the change in % is so low on this position (<1%) it can easily trap you in a bad spot. Now, sure you can sell the ATM CC and not care if AAPL runs up to $130, take your premium profit and leave. This is totally fine to do. The problem is with the downside protection. \n\nBasically, the consideration here is \"Am I ok risking money to make $113 as long as this stock does not drop by more than 0.89% in the next week\". \n\nIn these cases, I would either write a OTM CC to at least capture some upside, or a further dated ITM CC to have more downside protection. ATM is only good in specific cases where you think the stock is trading within a specific deviation, and AAPL seems to be fluxing more than 0.89 in a given day right now.", "score": 1, "replies": []}, {"body": "For me, the problem would be the taxes for all these operations, including the 100 shares sold :/", "score": 1, "replies": []}]}
{"title": "You can cancel a GTC order even if the market is closed.", "selftext": "I did not realize this till earlier this morning\n\nSold a CRM 5/28 225p thirty days ago and immediately put in an order to close at 50%. Company surpassed expectations yesterday. Initially thought I would be missing out on profits. Went on to my Tastyworks account and canceled the GTC order. I will now collect every penny.\n\nWhat are some things that you feel should be mentioned on this sub, but don't decide to cause you feel it is so obvious and basic?", "id": "nmv0wv", "created_utc": 1622198552.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 18, "comments": [{"body": "Took me a while to realize I only needed collateral for the widest side of an iron condor.  I wondered why people would even do them until I had that epiphany", "score": 5, "replies": [{"body": "I've had that epiphany now, don't have much to do with ICs and was like: \"Why would a broker allow this? I mean..oh, oh right.\"", "score": 2, "replies": [{"body": "But for some reason, for a jade lizard, ToS requires the full collateral for the put plus the call spread.", "score": 1, "replies": []}]}, {"body": "Depends entirely on the broker and their risk management strategy. IB, for example, does not recognize uneven iron condors so maintenance margin on each spread is calculated separately. Same with jade lizards.", "score": 2, "replies": []}]}, {"body": "when you wipe, wipe *away from your balls*, not towards", "score": 3, "replies": [{"body": "But why", "score": 1, "replies": [{"body": "The next time you see a female, ask her.", "score": 1, "replies": [{"body": "I get why girls need to do it", "score": 1, "replies": [{"body": "\"That guy gave me a UTI\" isnt how you want to be known.", "score": 1, "replies": [{"body": "Man I worry about your wiping ability", "score": 2, "replies": [{"body": "Read my first comment. No worries needed", "score": 1, "replies": [{"body": "Apparently there is if your incapable of adequate genitalia hygiene should wipe the opposite direction...", "score": 1, "replies": [{"body": "No U", "score": 0, "replies": [{"body": "I'm not concerned", "score": 1, "replies": [{"body": "Neither am I. Its your cross to bear not mine", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "...dude", "score": 2, "replies": []}, {"body": "put-call parity", "score": 2, "replies": []}, {"body": "Why should the basic stuff clutter the sub? Traders need to learn options and then come here.", "score": 1, "replies": []}]}
{"title": "Your favorite tech stocks during Nasdaq pullback?", "selftext": "What are your favorite tech stocks you’re looking to sell puts on during this tech pullback? Or maybe you’re looking to buy some shares outright and start selling CC’s on a green day?\n\nI’m looking at MSFT and AMD if they continue to show some red today, possibly some others. TWTR and FB could have potential too with this Trump social media regulation drama (though TWTR isn’t the most stable stock in my experience but nonetheless).", "id": "nmvpjs", "created_utc": 1622201051.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "I like CRM. It is up big today because of earnings but it remains one of the cheaper growth stocks in the market. I also like FB for the same reason.", "score": 5, "replies": [{"body": "Agreed. Wish I’d bought more - but still a relative bargain.", "score": 1, "replies": []}, {"body": "Only problem with crm is i feel the ceo is a mega bullshitter just strictly from every interview i’ve seen but they seem to do good business anyway and make money....product is decent imho", "score": 1, "replies": []}, {"body": "You wouldn't like crm for the past 9 months or so since its continuous  downtrend.", "score": 1, "replies": [{"body": "I mean the big jump you need to ignore unless you bought the absolute top. I like it as a premium selling play on the bullish side.", "score": 2, "replies": []}]}]}, {"body": "Microsoft", "score": 3, "replies": []}, {"body": "None of the techs really look good to me from a theta view. All the one you mention in particular have quite low IV. With the low VIX in general, if anything, would be looking to pick up some LEAPS for cheap to PMCC against. But none really stand out as things I would want to pin high-deltas on right now...\n\nMSFT if I had to choose. Strong bones and the office/teams ecosystem is not going anywhere as the default business solution.\n\nHappier with the more physical/industrial side lately with covid snapback. X, AAL, F. Companies poised to hit society and much juicer IV from thetagang perspective anyways.", "score": 2, "replies": [{"body": "Im still kicking myself for not buying those X bonds last year.\nThat was really really dumb of me", "score": 1, "replies": []}]}, {"body": "Im short tech.", "score": 2, "replies": [{"body": "I'm bearish on the market overall due to inflation concerns until SPX reliably breaks through to new all time highs. So I'm being more cautious with selling puts.", "score": 1, "replies": [{"body": "My longs are all in commodities and precious metals right now. Im actually neutral regarding the market overall, but I suspect that the rotation will continue. If rates spike then yeah I think the market will throw a tantrum for a bit. \n\nRates up= Tech down. Its a pretty cheap hedge all things considered, especially when Crazy Cathie's been selling off her liquid holdings to meet redemptions and doubling down on the illiquid dogshit. \n\nVolatility is cheap in my opinion right now, I dont see much value in selling it. I sold some BTU puts on the dip last week and thats really it. In fact, at the moment Im a net buyer.\n\n\nIf it gets really low, Ill maybe sell some puts on QQQ if it hits the 200ma or something.", "score": 1, "replies": []}]}]}, {"body": "I made a ton selling ABNB strangles when it first opened and margin requirements were low. Now that it's back to 140 I'm switching it up and going PMCC. Long the 100 in January and short the July 155.", "score": 2, "replies": []}, {"body": "I hold FB, INTC, AMD & CSCO and wheel on these. Not massive premium like my TQQQ or LABU wheels, but solid underlying (and dividends, in most cases) and happy to hold. \n\nI try to price CC close to get most premium & not be assigned, a tightrope walk, but there you go. Happy to swap an assignment back to a CSP for a week (or two) if it happens.", "score": 1, "replies": []}]}
{"title": "How Tesla is Quietly Expanding Its Energy Storage Business - CNBC", "selftext": "", "id": "nmv1vp", "created_utc": 1622198654.0, "score": 55, "upvote_ratio": 0.89, "num_comments": 14, "comments": [{"body": "I love Tesla! This is a long and short play to me. They have ONLY scratched the surface and people don’t realize TESLA has pushed the narrative into a more sustainable future on a global scale! Every auto maker is now making EVs, and oil companies are expanding into green energy! Mr. Musk is leading this change globally. Something to be said on this point alone. I am betting big on this horse.\nGreat company, great leader, great Autist!!!!\n💎💎🙌🙌🙌💎💎", "score": 11, "replies": [{"body": "Soo… inverse WSB? 🤪 Buying Tesla Puts", "score": -1, "replies": [{"body": "You sir....are a fucking genius!", "score": 1, "replies": [{"body": "I‘ll buy Tesla Puts, no joke, but I‘ll take a deeper look at their energy department", "score": 1, "replies": []}]}]}]}, {"body": "Tesla is the only Position in my Portfolio thats not a meme ❤️", "score": 6, "replies": []}, {"body": "Good since half of my net worth is in Tesla 🙌🏻💎💰", "score": 12, "replies": []}, {"body": "Tesla has guided for years that energy would match automotive revenue in the long term. \n\nMedia: \"Did you know that Tesla, just a niche car company, makes fewer cars than Toyota?\", \"Is 0 tailpipe emissions really better for urban air quality?\"\n\nI'm excited for tesla's revenues when it is a major global power utility and sells it's AI software and neural network as a service. I'm actually starting to get less excited about the apple moment where seemingly every somewhat luxury car is a model Y, but it will be good for the stock.", "score": 6, "replies": []}, {"body": "Should read Elon Musk is quietly taking over the world I mean universe", "score": 0, "replies": []}, {"body": "Fuck Elon", "score": -7, "replies": [{"body": "Soo triggered 😂😂😂", "score": 5, "replies": []}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "very cool", "score": 1, "replies": []}]}
{"title": "$RUN / $TSLA tax credit trade", "selftext": "[deleted]", "id": "nmy4w5", "created_utc": 1622209419.0, "score": 43, "upvote_ratio": 0.85, "num_comments": 6, "comments": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Sounds good to me just picked up 5 1K calls lol", "score": 3, "replies": []}]}, {"body": "Sold me. I’m in.,", "score": 4, "replies": []}, {"body": "I’m in. Explain why I’m in run to me please? I’m an idiot", "score": 2, "replies": []}, {"body": "Fuck thats alot bannanas!", "score": 2, "replies": []}, {"body": "$RUN bout to runnnnnn", "score": 2, "replies": []}, {"body": "Good luck", "score": 1, "replies": []}]}
{"title": "Tesla is going to get beaten by Nio and Xpeng", "selftext": "[removed]", "id": "nn0zvt", "created_utc": 1622217600.0, "score": 5, "upvote_ratio": 0.58, "num_comments": 14, "comments": [{"body": "I don't think Tesla will be beaten, but I do think there's plenty of a market for NIO and XPENG in China (at least) so all can coexist and reach higher prices.", "score": 6, "replies": []}, {"body": "Tesla isn't just cars", "score": 15, "replies": []}, {"body": "Holding 14k in nio 💎🙌🚀🚀🚀 to the moon", "score": 4, "replies": []}, {"body": "Fuuuuuuuuudddd\n\nHow you going to discount their solar partition of the company? It’s massive. \n\nWhat about the Berlin giga? Germany’s #1 registered car was Tesla last year. That was before the factory 🏭 \n\nHow about that new EV credit that just passed Senate? Save $12,500? Sky rocket. Hmm… did we forget they just raised the prices for the model 3 and model y? It’s almost as if they knew a tax credit was coming for the consumer. So now their balance sheet grows and the consumer still gets a good deal. Genius. \n\nOh, what about Tesla acquiring its own chip factory? Wait, so you’re completely self-reliant, Tesla? \n\nYeah… but XPEV and NIO are gonna beat Tesla. LMAO. Dream ooon, broham.", "score": 4, "replies": []}, {"body": "That's doubtful but good luck", "score": 4, "replies": []}, {"body": "Tesla is gonna get smoked eventually.", "score": 1, "replies": []}, {"body": "I have shares in Nio and Xpeng. Deliveries going to only increase YOY with china wanting to be emission free and becoming fully EV.", "score": 1, "replies": []}, {"body": "I would not buy an Xpeng or a Nio over a Tesla given a similar price. Most people wouldn't either.", "score": 1, "replies": []}, {"body": "lol where will I charge my nio oh yeah I can’t even buy one yet lol", "score": 1, "replies": [{"body": "Regardless it will probably become the new Honda down the line when cobalt becomes more reliable to make electric cars.", "score": 1, "replies": []}]}, {"body": "AMC SELL. TLRY BUY HOLD!!", "score": -2, "replies": []}, {"body": "Tesla is so big", "score": -1, "replies": []}, {"body": "Battery swapping 🤣🤣🤣 Renault tried that concept decades ago.  Not going to happen.\nPeople buy a car with a battery and. The want ther own. Renault stil has the battery lease option. And that held buyers off for years.", "score": 1, "replies": []}, {"body": "Being 100% aligned with Tesla’s mission I fully support Nio and Xpeng and I think they will both do well in China and elsewhere. But it is not a “zero-sum game”, same reason there are countless ICE vehicle manufacturers today. And no they will not “beat” Tesla, nor vice-versa.", "score": 1, "replies": []}]}
{"title": "NVDA YOLO", "selftext": "", "id": "nn5eh9", "created_utc": 1622229665.0, "score": 20, "upvote_ratio": 0.76, "num_comments": 20, "comments": [{"body": "Jesus my man thats a hell of a YOLO 🤞🤞💎", "score": 7, "replies": []}, {"body": "I think you bought the top but for your sake, I hope I'm wrong", "score": 5, "replies": [{"body": "It's going to 700 before split, they're fine", "score": 1, "replies": []}]}, {"body": "are you stupid", "score": 3, "replies": []}, {"body": "That's some brave stuff 😅", "score": 2, "replies": []}, {"body": "Oof, rip", "score": 2, "replies": []}, {"body": "This is the way.", "score": 4, "replies": [{"body": "This is the way.", "score": 2, "replies": []}]}, {"body": "Godspeed", "score": 2, "replies": []}, {"body": "You just want to lose money? Sell while you're up.", "score": 1, "replies": []}, {"body": "Chill guys, I use all the money gained today to play this YOLO, I bought dozens of calls yesterday so I’m ok if I lose all.", "score": 0, "replies": [{"body": "Should have pushed the exp date back. I think this ones gonna flop", "score": 1, "replies": []}]}, {"body": "I bought shares at the dip because of the split. Let's go APE", "score": 0, "replies": []}, {"body": "You should roll it forward one week to take advantage of the upcoming post split price action", "score": 1, "replies": []}, {"body": "Someone explain to me why this is YOLO. I haven’t been keeping up with NVDA that much", "score": 1, "replies": []}, {"body": "//", "score": 1, "replies": []}, {"body": "Wish I bought into NVDA yesterday, shit popped off today. Was to focused on AMC.", "score": 1, "replies": []}]}
