{"title": "Whitch dividend stocks would you pick next?", "selftext": " Now we are approaching the time of the month where I pay. Some of these will be spent on dividend shares. I have looked a little at Visa, Mastercard, Sampo, Rockwool, Nvidia and Unilever. And I think they all look good.\n\nWhich one will you choose from or will you take another large cap dividend share?\n\nYou can see them I already have: https: //financialindependent.finance.blog/my-current-portfolio/", "id": "chn0d8", "created_utc": 1564057647.0, "score": 42, "upvote_ratio": 0.87, "num_comments": 71, "comments": [{"body": "Assuming you already have dividend kings or aristocrats like T, JNJ, and MMM in the portfolio correct? JNJ is at a solid price right now and so is MMM", "score": 20, "replies": [{"body": "All my american stocks are from that list. I have looked into T and I dont think it is that good over the long run. JnJ has been a killer for me. I should look in MMM.", "score": 6, "replies": [{"body": "JNJ is down like 6% for me but its a long haul play. T is going to be fine (people overestimate the debt burden) I've been watching MMM, waiting to get in at the right price. They release earnings today so it should be interesting", "score": 4, "replies": [{"body": "T has underperformed the S&P for around 30 years.", "score": 8, "replies": [{"body": "So has every single other utility company. Whats your point?", "score": 3, "replies": [{"body": "Are we including dividends when comparing T to SP500?", "score": 5, "replies": [{"body": "Yes. Including dividends, T has underperformed S&P for \\~30 years.", "score": 2, "replies": [{"body": "I own T, but I'm not holding it for long. I bought it as a defensive play against the 8th inning of a business cycle that guarantees me at least 6% dividend even in down markets. But yeah, I could imagine owning a utility for 30 years", "score": 1, "replies": []}]}]}, {"body": "That T isn't \"fine\" as anything other than an income stock.", "score": 1, "replies": []}]}]}, {"body": "I’m just over JNJ, finally sold my position recently. All it has done since June 2017 is bounce around $130-$140, and is currently back at the low end of that spectrum. It also has exposure related to carcinogens in their baby powder, opioid lawsuits by states, faulty hip replacements... ugh, I just couldn’t invest in them anymore. I k ow a lot of companies are shit, but with JNJ it’s one bad news cycle after another.", "score": 1, "replies": [{"body": "Fair enough, it's been a bumpy ride. It's a small part of my portfolio though so I'm not too worried", "score": 2, "replies": []}]}]}, {"body": "Try BMY,  this is one of the lowest now, plus positive earnings", "score": 3, "replies": [{"body": "Buying after earning when it’s up 4% though? But yes, it does look like a good value.", "score": 2, "replies": [{"body": "No one really buys at bottom as they may not know when/what is the bottom. Review the fundamentals of the company with current price. The 4% jump is by the positive company results.\n\nDividend investing is long term goal, buy then hold forever and reap dividends longer run. The important point is $42.76, way below the value of company better margin of safety, was the lowest in last  1000 days and $45.5 may be one of the lowest.\n\nWhy not, yesterday after hours, it dropped to $41.57 which I missed when I noticed late night !\n\nI had similar issue of BBBY (missed the boat at 9.16 lowest), but got into it at $9.90 today for 7.2%. div\n\nCompared to BBBY results, BMY is not a risky candidate.", "score": 2, "replies": [{"body": "You can only reliably buy the bottom if you buy the way down, which obviously comes with risk in itself.", "score": 5, "replies": []}]}]}]}, {"body": "Hi, i just started looking into buying stocks /Roth IRA. Why do you think that \"T\" (I am assuming Tesla?) doesn't look good long term and what should I do/learn to be able to come to a conclusion like that?", "score": 1, "replies": [{"body": "Tesla is traded as TSLA. T is AT&T.", "score": 3, "replies": []}, {"body": "T is AT&T; https://en.wikipedia.org/wiki/AT%26T\n\nTesla still have to be a bit more succes full before I will buy it (they have a track record of loosing money) and they dont pay dividends", "score": 3, "replies": []}]}]}]}, {"body": "V, MSFT, OHI, OXLC and I'm long all 4.\n\nV = +38% YTD (0.55% annual yield)\n\nMSFT = +38% YTD (1.3% annual yield)\n\nOHI = +4% YTD (8% annual yield)\n\nOXLC = +9% YTD (15% annual yield)\n\nS&P up 19.5% YTD", "score": 14, "replies": [{"body": "> OHI\n\nwhat did u pay for them just curious, or do you think they are still a good buy at current price?", "score": 2, "replies": [{"body": "Got in at $25, current price is just north of $36. It's a REIT, so the yield is consistent. I'm not taking profits, just DRIPing the divs back into it.", "score": 3, "replies": [{"body": "Nice. What do you reckon is the biggest downside of this stock? Seems pretty solid.", "score": 2, "replies": []}]}]}, {"body": "How consistent are the OXLC and OHI dividend yields?", "score": 1, "replies": [{"body": "they haven't fluctuated much since I've owned them. OHI pays quarterly while OXLC pays monthly...dividends start adding up quickly. OHI has gone up quite a bit since I've been in, while OXLC has been pretty constant as far as price, between $10 and $11/share.", "score": 3, "replies": []}]}]}, {"body": "I'm in on ABBV and OSK at the moment", "score": 3, "replies": [{"body": "I am in ABBV too as dividend payer, yet to see results tomorrow morning.", "score": 1, "replies": []}]}, {"body": "CSCO", "score": 4, "replies": []}, {"body": "TLRD, ANF, NWL and WFC", "score": 3, "replies": []}, {"body": "AMT", "score": 2, "replies": []}, {"body": "only 'dividend' stock i own is T and NOK. \n\nNOK also just went up a good amount cause 5G contracts are finally starting to bring in money. They reassured FY guidance. Good things to come for them unless they trip up somewhere along the way. The dividend is also nice, currently around 4%", "score": 2, "replies": []}, {"body": "Look into the Canadian bank stocks like BMO", "score": 2, "replies": [{"body": "CIBC has a higher yield, but yes look at all major banks they have great divs.", "score": 2, "replies": [{"body": "Damn that's a crazy high yield, didn't realize that one was that good", "score": 1, "replies": []}]}, {"body": "How about some Canadian Gas&Oil stocks, VET got that crazy high yield, and still sustainable for the future.", "score": 2, "replies": []}]}, {"body": "I wouldn't really call Visa, Mastercard, or Nvidia dividend stocks. They pay pretty small dividends. Unilever would be more what you would consider a dividend play", "score": 2, "replies": [{"body": "V is growing its dividend in a steady manner. The yield increases over time because dividends are paid in absolute dollars and not a percentage of the stock price. V has an excellent divided for those who bought at $45 a share and growing every year.", "score": 1, "replies": []}]}, {"body": "I'm in ABBV, T, BNS, KO, IBM, GSK, HSBC and F right now. Looking to get into OHI too.", "score": 2, "replies": []}, {"body": "LMT. WM. MO. O.", "score": 2, "replies": [{"body": "MO", "score": 2, "replies": [{"body": "MO Money.", "score": 3, "replies": []}]}, {"body": "O and WM are overvalued. They should start correcting soon if the economy doesn’t get tanked by the hippies in the next election.  Both are great companies and I would buy at a lower price. Right now you are just rewarding those who bought two years ago.", "score": 2, "replies": []}]}, {"body": "NAVI", "score": 2, "replies": []}, {"body": "NOC\n\nThey have good numbers, solid business connections and multiple governments contracts outside the DoD involving satellites and development of the SLS engines, in addition to their healthy drone development and production programs.", "score": 1, "replies": []}, {"body": "No one talks about EPD or any of the Midstream MLP's.  If you want to gamble on a dividend paying stock, that would be the bet.", "score": 1, "replies": [{"body": "Please understand the K1 tax implications before purchasing MLPs", "score": 2, "replies": [{"body": "I don't at all. I guess I will take your word for it. Is it that bad?", "score": 1, "replies": [{"body": "The short version is that the money you get is taxed, even in an ira. You get a K-1 form from them every year and it can be complex when you do your taxes.", "score": 1, "replies": []}]}]}]}, {"body": "I'd take a look at TLRD. Just above their 52 week low and seems like a decent undervalued option.", "score": 1, "replies": [{"body": ">TLRD\n\nWhen was your last time you went into a Men's Warehouse other than for a suit rental? I think younger generations are really going back to quality over quantity as well. Obviously there is a market for companies like this, but I think it is shrinking, not growing.", "score": 1, "replies": []}]}, {"body": "MO if your not morally opposed. WFC also at the moment is a decent buy imo. BMY is a good at the moment now too. Possibly F. Buy and hold forever.", "score": 1, "replies": []}, {"body": "ORI DUK NEE BEP", "score": 1, "replies": []}, {"body": "Stock: STORE Capital\n\nETF: SPHD", "score": 1, "replies": []}, {"body": "BMO", "score": 1, "replies": []}, {"body": "I like it. I bought some and plan to hold long, collect some dividends along the way.", "score": 1, "replies": []}, {"body": "I like BDX, pretty safe investment.. Not the greatest dividend but it is pretty stable..", "score": 1, "replies": []}, {"body": "Starbucks and Walmart", "score": 1, "replies": []}, {"body": "I’ve had Nintendo for a few years and have been happy with the return.", "score": 1, "replies": []}, {"body": "CCI, really good dividend and 5g on its way using the smaller cell towers that they lease ... I own it", "score": 1, "replies": []}, {"body": "Altria (MO) and Philip Morris (PM).", "score": 1, "replies": []}, {"body": "BTI , ABBV , MMM", "score": 1, "replies": []}, {"body": "Vail resorts", "score": 1, "replies": []}, {"body": "Altria Group, Dominion energy, Duke Energy, Southern Company (look deeper into them, but the dividend history is solid).", "score": 1, "replies": []}, {"body": "BA is down 3.5 % at the moment. Might be a good time to buy in", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Boeing goes down because of... Well, not sure why. It is a very \"safe\" stock, because the company itself is so diverse.", "score": 1, "replies": []}, {"body": "No production hasnt stopped. The CEO said it would be an option if grounding delays went to 2020.", "score": 1, "replies": []}]}]}, {"body": "Disney AMD nvda msft V MA WM", "score": -2, "replies": [{"body": "amd doesnt pay a dividend...\n\nnvda is like 0.5% yield. Just put your money in a high yield savings acct..", "score": 5, "replies": [{"body": "NVDA also offers growth though, something a savings account doesn't do.\n\nBut yeah, if you're just looking for dividends I wouldn't do that one", "score": 0, "replies": []}, {"body": "Im very long term on it", "score": -1, "replies": [{"body": "Im not saying either one is bad investment, Im long over 300 shares AMD myself, but OP asked for dividend stocks, which these aren't", "score": 6, "replies": [{"body": "Oh yeah didnt saw that my bad", "score": -5, "replies": []}]}]}]}]}]}
{"title": "Multiple-pointed plan to get TSLA back to $280 by next Friday", "selftext": "Elon Musk is a man who can be influenced. His shareholders are the people most likely to grab his attention. Yesterday, ya boy (me) bought two calls that expire next week—therefore I am a shareholder and Elon will care about me...then I can influence him.\n\nI have compiled a comprehensive list of multiple-pointed plans that can help us influence Elon Musk to give us some tendies. You need to understand that Elon is like a reverse vending machine that gives you money, and right now he’s just broken—so we need to influence him and get back to giving us tendies.\n\n**Plan A:** Get him to call someone a pedophile on Twitter. Simple, yet effective. Just tweet him a question about Jeffery Epstein and sit back and watch. (Chance of success: 88% // Estimated price movement: $56)\n\n**Plan B:** Find him in person and ask him to buy shares of TSLA. Elon is a great guy, he cares about us. So when you see him, sit down and have an intimate conversation with him. Ask him to buy a few million shares. Gently rub his thigh. If worse comes to worse, he might just hand some cash and tell you to find a motel for the night. Best case scenario, he hands you cash for a motel, and then tweets about how you might be a pedophile. (Chance of success: 100% // Estimated price movement: $51)\n\n**Plan C:** Ask Elon to print Beyond Meat out of the TSLA CD trays. Nobody uses CDs anymore, creating new forms of mass and printing food out of it is the new rave. Turn those CD trays into chemically grown meat buffets. May not work if Tesla’s do not have CD trays, but maybe an external part that can connect via Bluetooth or USB would work. Coin flip Chance at success, but massive gainz. (Chance of success: 50% // Estimated price movement: $600+)\n\n**Plan D:** Convert Teslas to run off of coal. The president is a massive supporter of coal, and we have all this coal laying around that nobody uses anymore—maybe daddy Elon should use it to run his cars. No more charging stations, no more coal plants closing. The president will definitely make this a law if we tweet some solid memes at him. (Chance of success: 71% // Estimated price movement: $12)\n\n**Plan E:** Drug Elon and video tape it. This worked for Joe Rogan when he was a desperate bagholder. Now Joe owns a Tesla—think about that. TSLA price skyrocketed out of sheer pity for Elon after seeing him drugged like that. Better drugs may yield better results. Nobody really knows. (Chance of success: 100% // Estimated price movement: $90)\n\n**Plan F:** Ask Elon to shoot another car in space, but going the opposite direction. May find aliens, which equals ungodly gainz. And doubles the success from the first car that he shot into space. Play Old Town Road in the car, throw a Snapchat sticker on the hood—maybe some kids will buy some TSLA shares. (Chance of success: 89% // Estimated price movement: $89)\n\nAny one of these will bring us the tendies back. Elon cares about all of us shareholders. We just need to connect with him on a personal level.", "id": "chmalw", "created_utc": 1564053111.0, "score": 367, "upvote_ratio": 0.96, "num_comments": 69, "comments": [{"body": "What a waste of good adderall.", "score": 132, "replies": [{"body": "Go ahead and laugh away with your putrid little $234 TSLA shares. They’re cute\n\nI’ll be buying TSLA shares at $280+ and you won’t find it funny anymore", "score": 69, "replies": [{"body": "You’ve found your home, you absolute dullard.", "score": 11, "replies": [{"body": "Thank u bby", "score": 14, "replies": []}]}, {"body": "Ummm. If he bought shares at 234 and it goes to 280, I’m pretty fucking sure he’ll be delighted. \n\nMeanwhile you’re over there buying shares at 280 🤔\n\n\nYou retarded fuck. You belong here.", "score": 29, "replies": [{"body": "Here's an example of actual autism. Notice how he does not seem to understand OPs joke of buying at a higher price. Also note the 20 upvotes. There are other silent autists nearby", "score": 62, "replies": []}, {"body": "Wooooooosh", "score": 22, "replies": []}, {"body": "Buy high sell low", "score": 8, "replies": []}, {"body": "🤔🤔🤔🤔🤔🤭🤔🤔🤔😫😫😫😫👌👌👌👌", "score": 4, "replies": []}]}]}, {"body": "LOL", "score": 8, "replies": []}]}, {"body": "Elon came into my work literally an hour before the earnings call. He seemed really happy and not concerned at all. I work full time at Wendy's, waiting for my Tesla calls to pay for my retirement. I told Elon I had just seen the earnings report they put and I was shocked at how people received it. Company grew on almost every metric available. Told him to dump solar and become super profitable. He winked and smiled. He ordered a baconator and asked me if I would bring it out to him when its done as he wanted to go sit in his car (too many people asking him questions and stuff). I told him of course I would. So his order gets bagged by the slaves up front and I yelled for them to give it to me. I took it out to Elon but I couldnt find his Tesla. He whistled from behind me. He was parked in a Ford F-350 with the muffler removed. Black smoke was pouring out. I slammed his food on the ground and stomped it. Anyways long $F. Trust me.", "score": 51, "replies": [{"body": "Short Wendy’s. Long Ford. Long Waste Managment. Short solar\n\nThank u", "score": 22, "replies": []}, {"body": "Yeah I know what you mean dude, like his internet personality is so wacky (in kind of a loveable way) but you can't really help but get disappointed by some aspects of him (and by extension, TSLA) if you meet him in real life.\nLike just the other day I saw Elon at a grocery store in Los Angeles and I told him how cool it was to meet him in person, but I didn’t want to be a douche and bother him and ask him for photos or anything.\nHe said, “Oh, like you’re doing now?”\nI was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen Milky Ways in his hands without paying.\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\nWhen she took one of the bars and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bar and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly.\nNeedless to say I just can't believe in TSLA like I once did before.", "score": 9, "replies": [{"body": "I don’t think this really happened", "score": 7, "replies": [{"body": "Idk it might have", "score": 4, "replies": []}]}]}, {"body": "Lol what that’s crazy I’m actually your assistant manager , get back to scrubbing the toilets .", "score": 3, "replies": [{"body": "Dan? I’m off today you know that. I swear I didn’t post this at work please don’t fire me (pussy)", "score": 3, "replies": []}]}]}, {"body": "This is why Tesla isn't a company.  It's a lifestyle. 💯💯💯🔥🔥🔥👌👌👌", "score": 49, "replies": [{"body": "💦💦💦💦", "score": 17, "replies": []}]}, {"body": "If anything would connect with Elon I think it’s this post. How do we get him to see this he would get a good laugh", "score": 17, "replies": [{"body": "I'm sure he frequents this sub. We just have to wait now, and buy way OTM calls on TSLA.", "score": 9, "replies": []}, {"body": "i doubt he has the time to read all this crap", "score": -2, "replies": [{"body": "He cares about us", "score": 7, "replies": []}]}]}, {"body": "I'm starting to think that $420 funding secured tweet was actually $4.20.", "score": 17, "replies": [{"body": "Or the company would have 4 shares worth $20 each.", "score": 4, "replies": []}]}, {"body": "You had me at 'rub his thigh'", "score": 17, "replies": []}, {"body": "Imagine if you used this effort for something useful in your life OP", "score": 17, "replies": [{"body": "Story of this subreddit: \n\nImagine if you used this money for something useful in your life OP FTFY", "score": 4, "replies": []}]}, {"body": "No 420 references, no supurless 69 thrown in. I think he is serious, full on autism.", "score": 27, "replies": [{"body": "Thank u", "score": 8, "replies": []}, {"body": "Wtf is supurless lol", "score": 2, "replies": [{"body": "> supurless \n\nsuperfluous for us that just don't give an f anymore", "score": 6, "replies": []}]}]}, {"body": "Wait. So you bought calls and are now a shareholder? 🤔🤔🤔🤔\n\nBig if true!", "score": 12, "replies": [{"body": "2 calls are basically 200 shares that magically vanish in a few weeks", "score": 6, "replies": []}]}, {"body": "What about an Elon porno in the Model X?", "score": 14, "replies": []}, {"body": "They have some open seats on the board why dont you write mr. Musk a letter?", "score": 10, "replies": []}, {"body": "Plan C can't fail. Tesla to the moooooon", "score": 8, "replies": []}, {"body": "This guy is me 2 months ago", "score": 7, "replies": [{"body": "Have officially gone from adderalled out brainlord to hungover reassessment of my values", "score": 7, "replies": []}]}, {"body": "Just wait till Neuralink says it can connect you to your Tesla. To the moon it goes", "score": 7, "replies": []}, {"body": "How about 160?", "score": 7, "replies": [{"body": "Those are rookie numbers we gotta put those up! Wallstreetbets style!!", "score": 2, "replies": []}]}, {"body": "I like it! Lets kick this plan into high gear, say this friday? Just threw $155 on red with $230 TSLA calls 7/26 exp.\n\n&#x200B;\n\nAlrighty then, see you boys tomorrow at $280", "score": 5, "replies": []}, {"body": "The funny thing is that since the markets are 99% controlled by robots that scan news headlines, a targeted reaction campaign towards someone like Elon could legitimately bend the market however you want", "score": 11, "replies": []}, {"body": "I'm all in, but which plan?", "score": 5, "replies": [{"body": "Plan B has the best chance of sexual intercourse with Elon", "score": 15, "replies": []}]}, {"body": "BYND meat jerky just hang it around the car cabin to let it cure", "score": 4, "replies": []}, {"body": "Plan D most likely to succeed.  Get a lobbyist on it ASAP", "score": 4, "replies": []}, {"body": "Elon does other companies while remaining at Tesla, why can’t JB multitask?", "score": 3, "replies": []}, {"body": "Am I late? Any plan left for me?", "score": 3, "replies": [{"body": "Tweet death threats at Elon", "score": 2, "replies": []}]}, {"body": "What if Elon says \"yesterday's results were actually a joke. Here are the real results\" and shows some results with profits and shit.", "score": 4, "replies": [{"body": "I think he'd be sued and the price would drop further", "score": 4, "replies": []}]}, {"body": "Options ≠ shareholder pal.", "score": 5, "replies": [{"body": "Yes it does stfu", "score": 28, "replies": []}]}, {"body": "Buys calls...thinks he's a shareholder....\n\n\nJesus Christ you're fucking stupid", "score": 8, "replies": [{"body": "Thinks \"therefore I am a shareholder and Elon will care about me\" is a serious post", "score": 16, "replies": []}, {"body": "Not the brightest bulb huh?", "score": 6, "replies": []}, {"body": "This is Wall Street Bets, everyone is fucking stupid. Including you amigo.", "score": 8, "replies": []}]}, {"body": "Teslas already run on coal and natural gas", "score": 1, "replies": [{"body": "You mean \"freedom gas\"", "score": 7, "replies": []}, {"body": "Unless you live in France, then it’s a nuclear Tesla 🤺", "score": 5, "replies": [{"body": "The French can’t afford them", "score": 3, "replies": [{"body": "Government pays half. Teslas for everyone!", "score": 3, "replies": []}]}]}]}, {"body": "You tesla folks are dilusional cult followers who will be obliterated when that company GOES TITS UP. god damn bro read their balance sheet its only a matter ofbtime retards", "score": -9, "replies": [{"body": "Stfu nerd! Don’t discredit our stonks!!", "score": 3, "replies": []}]}, {"body": "This is funny but Teslas already run on coal power for the most part.  It’s why the virtue signaling of driving an electric car is such bullshit", "score": -20, "replies": [{"body": "No they don’t. Over 50% of Tesla’s in the US are in California. California doesn’t produce electricity with coal.", "score": 3, "replies": []}]}]}
{"title": "Recession Playbook from Morgan Stanley 7/22/19", "selftext": "[http://www.mediafire.com/file/5py1d1zrii5rr1a/The\\_Recession\\_Playbook.pdf/file](http://www.mediafire.com/file/5py1d1zrii5rr1a/The_Recession_Playbook.pdf/file)", "id": "chnp3n", "created_utc": 1564061500.0, "score": 183, "upvote_ratio": 0.97, "num_comments": 68, "comments": [{"body": "I've uploaded the file to be scanned by VirusTotal, [which found no hits](https://www.virustotal.com/gui/file/a66ba3b8720003eda1e04dcc19cf42e96abb557d8016c2587535b7ba397a6e44/detection).\n\nHere is also [a DocDroid mirror](https://www.docdroid.net/5reJGOA/mstrp.pdf) which allows you to preview the file without downloading.\n\nor idk just use your work computer if you're worried about a virus\n\nEDIT: ninja'd by bamasmith", "score": 1, "replies": [{"body": "Thanks", "score": 5, "replies": []}, {"body": "This mod doesn't have HIV", "score": 5, "replies": []}]}, {"body": "TLDR: \n\n* start buying when NBER declares a recession\n\n* Food/beverages and healthcare/pharma/biotech outperform. software to a lesser extent but with more variance\n\n* autos and tech hardware underperform", "score": 45, "replies": [{"body": "So what you are saying is this is bad for $MU.", "score": 7, "replies": []}, {"body": ">NBER declares a recession\n\nhow would they declare it?\n\nlike in a paper?", "score": -1, "replies": [{"body": "They yell \"I DECLARE RECESSION\" out the window.", "score": 36, "replies": [{"body": "You forgot 1, 2, 3, 4.....", "score": 1, "replies": [{"body": "https://youtu.be/C-m3RtoguAQ?t=63\n\nmore like this really", "score": 3, "replies": []}]}, {"body": "THIS MOP IS DIRTY AND I'M NOT GOING TO TAKE IT ANYMORE!", "score": 1, "replies": []}]}]}]}, {"body": "ELI5 I'm too retarded for this level of DD", "score": 39, "replies": [{"body": "* Right now there's a relatively low probability of a recession ( 13% - 20%)  , but things are worsening, if it doesn't improve coming september the outlook is very grim.\n* keep an eye for a jobless claims pike, very good leading indicator of shit hitting the fan. As opposed to a NBER  recession declaration, that is actually a good and time proven buying signal rather than a selling one.\n* If shit hits the fan, short autos , tech. Rotate to bonds", "score": 58, "replies": [{"body": "Much obliged, fellow autist. May your calls moon today and evermore.", "score": 13, "replies": []}, {"body": "The end of this decade seems to mirror the start of 30's a little bit. Weird times. Ray Dalio says gold might become a preferred asset, which is kind of ironic considering gold standard was abolished in the 30's because of a depression.", "score": 16, "replies": [{"body": "[deleted]", "score": 1, "replies": []}, {"body": "Wasn't he one of the ones who thought we should all buy commodities in 2012? Not knocking him overall as a person/investing genius, but if he's from that group, I'm getting tired of the scaremongering", "score": 1, "replies": []}]}, {"body": "Why is NBER declaring recession be a good signal to buy?\n\ndisclaimer : i haven't read the pdf yet", "score": 1, "replies": [{"body": "From the page 8 of the  report : \n\nNBER recession declaration is a goodbuy signal. Given the con-\r\nsiderable identification and confirmation lag inherent in the \r\nNBER's recession calls, by the time a macro peak is officially confirmed, risk markets tend to already be looking ahead to the sub-\r\nsequent recovery", "score": 7, "replies": [{"body": "hmmm, Thanks now I understand.", "score": 1, "replies": []}]}]}]}, {"body": "Might go up, might go down. Fancy words.", "score": 17, "replies": []}]}, {"body": "Anybody else notice that one of the authors is called \"Wanting Low\"?", "score": 19, "replies": [{"body": "Sounds like a bear", "score": 17, "replies": []}]}, {"body": "Scanned it in virustotal, mediafire isn't some random upload site.\n\nhttps://www.virustotal.com/gui/file/a66ba3b8720003eda1e04dcc19cf42e96abb557d8016c2587535b7ba397a6e44/detection\n\ntl;dr: 0/52, file is likely benign", "score": 15, "replies": [{"body": "That’s what you want us to think", "score": 5, "replies": []}, {"body": "Thank you", "score": 2, "replies": []}]}, {"body": "this sub is amazing\n\nI love you", "score": 9, "replies": []}, {"body": "This PDF is great information giving us some historical data on what companies or areas of the market were basically almost recession proof. Also this PDF does mention every recession was different. This cloud be great to use if you need a can of beans to eat, hopefully you pull off the right short 😁 because now your entire accounts are almost wiped out from the crash.", "score": 11, "replies": [{"body": "Wow! Now we can totally outsmart wall street and get in early.\n\nWe need to stick to our guns. Meme stocks.", "score": 2, "replies": []}, {"body": "“X, Y and Z companies are recession proof but they may not be recession proof”", "score": 2, "replies": []}]}, {"body": "Took a risk and opened the PDF, here are the first page gains:\n\nRecession risks are rising. Our economists recently downgraded \r\ngrowth forecasts across the board. Despite the relatively benign out-\r\ncome out of the G20, they see uncertainty from trade tensions as \r\nalready having done significant damage to the cycle, with whatever \r\npolicy easing may come likely insufficient to revive growth; if trade \r\ntensions escalate, the global economy and the US may fall into a \r\nrecession; see Global Economics: Uncertainty Still Prevails (30 Jun \r\n2019).\r\nFor now, the path to the bear case of a US recession is still \r\nnarrow, but not unrealistic. While our US Economics team's own\r\nrecession probability indicator points to only a 13% chance of a reces-\r\nsion in the next 12 months, they have also highlighted a significant \r\nloss of momentum in business activity over recent months, even as \r\nthe services sector and consumers appear to be in good health. \r\nHence, their subjective probability stands at 20%. If trade tensions \r\nescalate further, our economists see the direct impact of tariffs inter-\r\nacting with the indirect effects of tighter financial conditions and \r\nother spillovers, potentially leading consumers to retrench. \r\nCorporates may start laying off workers and cutting capex as margins \r\nare hit further and uncertainty rises. The large negative demand \r\nshock that ensues could drive the US economy into a recession, with \r\nGDP growth falling from 2.2%Y in 2019 to -0.1%Y in 2020. \r\nRising risks and our review of historical market performance \r\naround prior recessions support our more cautious view on risk \r\nassets — we remain underweight equities and, within equities, \r\nprefer more defensive sectors; see Cross-Asset Dispatches: \r\nDowngrading Global Equities to Underweight (7 Jul 2019).As growth \r\nslows, markets tend to be forward looking — treasury yields tend to \r\nhave already fallen by about 50 bps by the time the economy peaks, \r\nequities and credit tend to start lagging typical returns during the 12 \r\nmonths before a recession starts, and equity returns generally shift \r\noutright negative shortly before and into the first few months of \r\nrecessions. \r\nExecutive Summary\r\nWatching the Economic Data \r\nAbove all, we're watching the US consumer and employment \r\ndata. A review of 100+ data series helped us establish some of the \r\nmore reliable signals where decelerations could mean recession is \r\nahead and the most consistent of these center around employment \r\nand US consumer confidence, income, and spending. \r\nl Employment: Survey data around the availability of jobs can con-\r\nfirm turns in the unemployment rate and slowing job creation \r\n(and eventually job loss). Once job growth goes negative and the \r\nunemployment rate rises, a recession is hard to avoid. \r\nl Consumers: Stagnating consumer earnings growth, declines in \r\nconsumer confidence by more than 15% y/y, and growth in real \r\npersonal consumption expenditures falling below 2.5% y/y are all \r\nwarning signs of a potential recession.\r\nl Corporates: Falling durable goods orders and ISM manufacturing \r\nPMIs sustainably below 50 tend to line up with recessions. \r\nl Aggregate Indicators: Sustained y/y growth in the Conference \r\nBoard Coincident Indicators Index below 2% and its Leading \r\nIndicators Index going below 0% y/y both tend to reliably lead \r\nrecessions. \r\nCurrent trends are just outside the danger zone, but could be \r\nheading there ( Exhibit 1 ). Comparing the recession signals above \r\nwith current trends shows that many data points are still outside of \r\nthe danger zone, but history tells us that these series can deteriorate \r\nrapidly and current deceleration trends continuing would materially \r\nincrease the risk of recession.", "score": 28, "replies": [{"body": ">Corporates: Falling durable goods orders and ISM manufacturing PMIs sustainably below 50 tend to line up with recessions.\n\n&#x200B;\n\nDurable goods orders was reported up 2% this morning and ISM PMI is at 51.7% for June. **Recession fuckin canceled bois 🐮**\n\n&#x200B;\n\n*Disclaimer: i don't know what any of this means.*", "score": 19, "replies": [{"body": "Tesla is down 13% so that can't be true smh", "score": 4, "replies": []}]}, {"body": "For anyone else that believes it's risky, I went ahead and scanned the PDF myself. It's completely benign (I regularly remove malicious javascript and other actions from torrents and direct download sites):\n\n    $ python pdfid.py The\\ Recession\\ Playbook.pdf\n    PDFiD 0.2.5 The Recession Playbook.pdf\n     PDF Header: %PDF-1.4\n     obj                 2961\n     endobj              2960\n     stream               843\n     endstream            843\n     xref                   1\n     trailer                1\n     startxref              1\n     /Page                 79\n     /Encrypt               0\n     /ObjStm                0\n     /JS                    0\n     /JavaScript            0\n     /AA                    0\n     /OpenAction            0\n     /AcroForm              0\n     /JBIG2Decode           0\n     /RichMedia             0\n     /Launch                0\n     /EmbeddedFile          0\n     /XFA                   0\n     /URI                  48\n     /Colors > 2^24         0\n\n[This is what VirusTotal uses to provide extra details](https://www.virustotal.com/gui/file/a66ba3b8720003eda1e04dcc19cf42e96abb557d8016c2587535b7ba397a6e44/details) along with their aggregate scans.\n\nIf you want to scan it yourself, do the following\n\n1. Download and install Python on your machine.\n2. Download [pdfid.py](https://blog.didierstevens.com/2009/03/31/pdfid/) to whatever directory you downloaded the document.\n3. Open whatever terminal your machine has (cmd or powershell for windows users) and type in `python` `pdfid.py \"The Recession Playbook.pdf\"`\n\nFeel free to ask any questions if you want more info.", "score": 3, "replies": []}]}, {"body": "Who to short this time??", "score": 10, "replies": [{"body": "SPY.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Tea leaves. \n\nIf you’ve never read Manias Panics and Crashes that’s the next best option.", "score": 5, "replies": []}]}, {"body": "Definitely internal, this wasn't released to the public.\n\nGood points!", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "If it was internal it would have confidential and proprietary markings at the footer of each page. This is just standard research they share with clients.", "score": 5, "replies": []}]}]}]}, {"body": "It’s similar to their space frontier research one", "score": 5, "replies": [{"body": "Where’s that one?", "score": 1, "replies": [{"body": "I downloaded it then lost it might try to find it, really great info", "score": 1, "replies": []}]}]}, {"body": "No viruses for me, reading it now", "score": 6, "replies": [{"body": "This sounds an awful lot like what a virus would post.", "score": 11, "replies": [{"body": "Virus scan came back clean, computer still runs:\n\n[https://imgur.com/gallery/yed5Zfk](https://youtu.be/dQw4w9WgXcQ)", "score": 4, "replies": [{"body": "Sounds an awful lot like what a virus trained with a neural network to post responses would post.", "score": 7, "replies": []}]}]}]}, {"body": "tldr for those of us who don't want our PC's to get AIDS?", "score": 14, "replies": []}, {"body": "NICEEEEEE!!!", "score": 4, "replies": [{"body": "Niice.", "score": 1, "replies": []}]}, {"body": "Great now lets all follow this so our accounts survive!", "score": 5, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Need this for later", "score": 2, "replies": []}, {"body": "Anyone actually download this? How many viruses do you have now?", "score": 4, "replies": [{"body": "its furreal", "score": 6, "replies": [{"body": "unknown pdf on an unsecured website? I'll pass.", "score": 2, "replies": []}]}, {"body": "It's a PDF file", "score": 4, "replies": [{"body": "Someone doesn’t know about interactive content/PDF macros 😈", "score": 5, "replies": [{"body": "Don't download it then 🤷‍♂️", "score": 4, "replies": []}]}, {"body": "This is exactly what a bot would say.....", "score": 6, "replies": []}]}]}, {"body": "Can someone confirm this is a real pdf?", "score": 3, "replies": [{"body": "Nah man, it's a virus. I'm trying to hack into your RH account to rob your $100", "score": 48, "replies": [{"body": "Jokes on you, I'm already at -100", "score": 20, "replies": [{"body": "Well, you won't mind a -200 then", "score": 9, "replies": []}]}]}, {"body": "Its legit.", "score": 6, "replies": []}, {"body": "I ain't clicking that shit", "score": 2, "replies": []}, {"body": "If you are scary, just use FreePDF or any other PDF readers instead of Adobe Reader - most Vulnerabilitys are in Adobe products", "score": 1, "replies": []}]}, {"body": "Good stuff.  Thanks!", "score": 1, "replies": []}, {"body": "Upload pixxx to imgur thx", "score": -6, "replies": [{"body": "It's eighty pages, fuck you I'm gonna sit here and do that when you can just read it yourself.", "score": 9, "replies": []}]}]}
