{"title": "Stock watch for bulls, bears, earnings, and pennises stonk players (7/25-8/2)", "selftext": "Tip of the hat to all those who reached out with kind words for the DD. It truly makes me day to see the effort is not in vain - this is my way to give back for all the trading advise I've gotten throughout the years, and I truly believe good karma (irl and in reddit) helps with tendies. That, and because **I'm determined to earn a Nostradamus flair badge.**\n\nTHIS EARNINGS SEASON HAS BEEN BOUNTIFUL. In the last couple of weeks I've seen people print more tendies than they ever had before. I'm up \\~450% this week alone, and will keep that rolling to close the week at 500-600%, hopefully. Thank goodness because I'd just depleted my RH account about a month ago to have an extravagant honeymoon around Europe.\n\nI will be posting the results of last week's picks tomorrow, for the sake of accountability.\n\nStill more earnings to go and plenty more tendies to print (even outside earnings, of course!!) for bulls and bears alike. Here's a list of options to keep in mind for earnings on Friday and early next week, as well as other stocks to keep in your radar for the next 4-5 trading days:\n\n***For the bulls: $***ROKU, $CRWD (now it's time to get back in!), $BIIB, $MDB, $DIS, $HUM (whether you hold for earnings or not, this will print good tendies)\n\n***For the bears: $***NFLX, $SHOP, $TIF, $CVNA\n\n***For those with balls of steel*** **(earnings plays)\\*:**\n\n* Bullish: $Illumina (Monday), BJRI (), Groupon (Tuesday), PAYC (Tuesday), TWLO (Wednesday)\n* Bearish MCD (this Friday), SPOT (Wednesday), BOOT (Wednesday)\n\n***For the broke breddas*** **(penny stocks)*****:***\n\n* For those too broke but who dream of affording an earnings play: $GRPN calls\n\n**\\*Keep in mind that EARNINGS PLAYS ARE RISKIER PLAYS, by default**\n\n**\\*\\*I'll post in-depth DD on this during the weekend!**\n\n&#x200B;\n\nEDIT (7/24, 8:25PM):\n\n**\\*\\*\\*Had to edit out my other penny stock pick because of guidelines and mods.** Just trying to stick to the rules here", "id": "chfqg3", "created_utc": 1564010575.0, "score": 74, "upvote_ratio": 0.96, "num_comments": 64, "comments": [{"body": "Hey guys, just letting everyone know that /u/esteevtrabajos1 was banned. Just so everyone knows, in case you're wondering why he hasn't/isn't updated/updating or responded. \n\n\\*\\*Not taking sides or looking to start anything with the mods here.. their sub - their rules, just posting this as a PSA to everyone that was following his DD threads and posts as I was.\\*\\* :(", "score": 13, "replies": [{"body": "free /u/esteevtrabajos1", "score": 10, "replies": []}, {"body": "Why was he banned? Enjoyed his DD.", "score": 4, "replies": [{"body": "Not really sure about exact reasons, thats for the mods to say if they want to, Im just letting everyone know so they dont think hes ignoring or dipping out.", "score": 6, "replies": []}]}, {"body": "Oh no...\nHe was too accurate!\nSo rhis was his last message I assume :(", "score": 3, "replies": []}]}, {"body": "I have you tagged as \"MAKES MONEY sometimes\"\n\nGood luck OP", "score": 20, "replies": [{"body": "What an honor! Thanks my maine", "score": 16, "replies": []}]}, {"body": "You’re an angel. \n\nFor CRWD would you recommend the 8/16 $95c?", "score": 10, "replies": [{"body": "My man. Happy to help. Any calls that aren't too far OTM should work. 8/16 $95 should work, but I'd personally go for 9/20 $105 calls (they are only slightly more expensive). Good luck!", "score": 10, "replies": [{"body": "Esteev el animal\n\nily❤️", "score": 3, "replies": []}, {"body": "Honestly are 9/20 $110 too far otm at this point?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah but I definitely want to go all in. OPs confidence got me wanting to risk it all", "score": 2, "replies": []}, {"body": "Went in on $105 calls 9/20, bought the dip", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lmfao I bought in @2.20, could’ve gotten lower @2.00 but hey, I think we’re both in a really good spot. Was getting nervous last week bc it was getting so expensive, but now I can’t wait for these tendies", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Same here... if crwd hits 105 by mid august ill be so happy", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Such beautiful tendies. Best part is that this is only the beginning lmao", "score": 2, "replies": []}, {"body": "My guy. We aren’t just back... we’re going to the moon", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah im holding for as long as I can... really trynna get itm here", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "4. Bought more today and bought the dip. Avg contract cost of 2.39", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah 9/20. Im holding lol no need to rush, its literally a month and a half away till expiration. No worries mate youll be in the green soon", "score": 2, "replies": []}, {"body": "Youre back in the green!", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah man hopefully this is the last of it", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Literally cant go tits up", "score": 2, "replies": []}, {"body": "What the fuck", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bro I felt so good about this but idk man", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah true..... im holding for the long term. Really hoping this is the last of it", "score": 2, "replies": []}, {"body": "Might buy more", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I looked at the options chain for crwd, IV is quite high at 50% on my IB app", "score": 1, "replies": []}]}]}, {"body": "OP was banned. Goodbye our source of excellent DD. Check his profile for more information", "score": 8, "replies": []}, {"body": "Love your posts. You did real good this week. Give us uneducated assholes some strikes and expirations if you wouldn't mind. I know its a lot to ask, but that would be peachy.", "score": 11, "replies": [{"body": "Thanks, amigo! It means a lot.  \nI'll definitely keep this in mind for future posts and will try incorporating price strikes and expirations in posts for the next weeks.", "score": 6, "replies": [{"body": "That's when people will start accusing you of front running them and blaming you for their losses. That's what happened to the other guy in the past who posted his DD for everyone. Appreciate the knowledge that you share though!", "score": 1, "replies": []}]}]}, {"body": "How do you find your picks and do DD?", "score": 5, "replies": []}, {"body": "Any opinions on SBUX? They've been on an uptrend with analysts revising their estimates upward, and given the success of Chipotle I'm expecting Becky to take this one a step up as well.", "score": 4, "replies": [{"body": "Good call", "score": 1, "replies": [{"body": "Nostradamus right here", "score": 2, "replies": []}]}]}, {"body": "Are you seeing a dip in $SHOP this week or the next? NFLX \"dead cat bounce\" today was grossly overbought I think. I bought puts at the peak, hoping they don't die tomorrow", "score": 4, "replies": [{"body": "SHOP and NFLX dips as early as tomorrow. Totally agree with your assessment of NFLX today. Very likely to tank tomorrow", "score": 3, "replies": [{"body": "Your thoughts on why SHOP exactly? Personally bullish on $SHOP, think there is quite a bit of upside to it still.", "score": 1, "replies": [{"body": "Looking at the charts I expect to see a profitable pullback in the next couple of days, but would definitely switch to calls a couple of days before earnings. The stonk has a history of rallying shortly before earnings, so that'll be my strategy with this one. I do expect an earnings beat, but that's one stonk that will be dangerously expensive to play for earnings (which is why I didn't include it for my earnings plays).\n\nSo yeah, I'll be picking up a few puts tomorrow and unloading on Friday, depending on price action. Not touching it for earnings, most likely", "score": 3, "replies": [{"body": "Took your advice on $CRWD, bought in at IPO and sold right before earnings which was a mistake. Luckily I was able to pick up cheap calls in the morning. Hopefully skies are clear for $95 -> 100+ between now and Aug!", "score": 1, "replies": []}]}]}]}]}, {"body": "Hmm, just think MCD will miss earnings? I sold a put spread that closes 7/26, been thinking about closing it early anyway. \n\nInterested to hear about that, DIS and GRPN a bit more if you have the time.", "score": 3, "replies": []}, {"body": "I been eating a lot of mcd but I know the menu well so I can do shit like get a meal with a large drink because it doesn't cost extra if you don't get large fries too. They should have strong earnings but not quite match up to expectations because it's easier to get the data showing I ate there a lot than it is to get the data showing me being a frugal ass least profitable customer possible. So I can confirm, you're correct about everything", "score": 4, "replies": []}, {"body": "You are the guy I was seeking! Heard so much great things about your predictions!!\n\nI see that Apple is not in your list. Can you explain why? I just purchased Apple calls...\nI shouldve talked to you first sigh", "score": 5, "replies": [{"body": "\\>>", "score": 1, "replies": []}]}, {"body": "OP, what’s your analysis on GRPN, other than the fact that’s it is in play because of earnings? Historically it hasn’t done so hot—what’s the rationale?", "score": 3, "replies": [{"body": "Plenty busy with work now, so I'll try to explain as much as I can very briefly. You can research any of these points further - a lot of this is recalling FA I did over the weekend. Apologies if the writing is a bit scattered:\n\n* **Huge efforts in marketing should translate to better numbers in terms of # customers, both domestically and internationally, and better earnings/outlook**\n   * Craig Rowley hired as CMO shortly after their last earnings; solid advertising campaigns with Mila Kunis, Hasan Minhaj and others. Combination of using internationally known stars (Minhaj, Kunis) and an emphasis on marketing abroad are expected to drive # of customers both nationally and abroad, especially in Europe (they're expanding their presence in countries like Spain, Germany, Italy, etc.). \n   * Internationally, Spain, Italy, France and Germany should have very positive numbers, and if the company manages to bring back the UK to positive trends, its international outlook will be raised substantially\n* **Expected earnings are already quite low, and they've made huge efforts to retain and attract new customers (outside of advertisements) in the last quarter, to go along with their fierce marketing campaign**\n   * Most notably, they've rolled out their new program (**Groupon Select**), which is a paid membership program where users pay a monthly rate to have access to special deals.\n* **Rolling out their card-linked version of the standard Groupon offers will both attract new customers (who hear about Groupon from those companies) and also help with retention. This should also help with earnings, and to increase the company's outlook for the rest of the year**\n\nThis is not the strongest earnings play of the bunch - I only included it because I see lots of potential for the stock in this round of earnings, and because of options activity that indicate a potential upswing from earnings. But again, all earnings are a gamble in one way or the other (ask PEP, V, FB or even PYPL earnings holders, for instance). And in the grand scheme of things, this is by no means a weak gamble.   \n\n\nPlay at your own discretion, of course! Hope this helps :)", "score": 4, "replies": []}]}, {"body": "Roku reports on 8/7, by the way.", "score": 3, "replies": []}, {"body": "Why do you like GRPN?", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "thoughts of JnJ?", "score": 1, "replies": [{"body": "JNJ is the devil and is run by a bunch of Mr. Burns mofos.   \nLong $JNJ", "score": 5, "replies": []}]}, {"body": "first of all, thanks for the BIIB earnings rec.. Wasnt sure but after some grueling DD and deciding I did it but sold in the morning (wish I held)\n\nIllumina is in a similar boat, both having major down gaps, but whyare you bullish on ILMN? BIIB had the failed drug trials but still had enough other revenue to make up for it, but ILMN recently downgraded their EPS from like 13% to 7\\~%; I see they still have a value of $320, but with pretty much warning pre-earnings, do you still think earnings will do well?", "score": 1, "replies": [{"body": "I also sold my BIIB positions after earnings and printed serious tendies. I opened new (longer dated ones) and will be riding those for a while. I'm glad to hear that trade went well for you!\n\nIllumina is one of the trickiest stocks to trade, but it is perhaps one of the ones I'm best at trading as I'm quite familiar with the company. I called the massive drop in the stock a couple of days before it happened (I don't think anyone here was bearish with Illumina at that point - the chart was lookin pretty strong). \n\nThere are many reasons why Illumina should moon after earnings, and I'll be posting about those here some time tomorrow. I have a few important deadlines coming up for work so I'm a bit swamped with those.\n\nY GRACIAS POR TUS AMABLES PALABRAS EN OTROS POSTS PARCERO.  Colombia is the sickest country with the kindest people <3. \n\nLong $COLO", "score": 4, "replies": [{"body": "Cool, I was thinking of re-entering but I think Im mainly focused on short-term swing trading, ER plays, and short term right now. I do have CRWD for 2 months though.\n\nThanks for the explanation, sometimes simply having experience with a certain stock is the best tool. I think Im gonna jump in on the ER play. Edwards also made me 2k on the earnings play.\n\nYa tu sabe parce, Pereira!!! De veras, gracias para todo, te lo agredezco.", "score": 1, "replies": []}]}]}, {"body": "What do you do for a living? Also out of everything you listed which plays do you think have the most potential?", "score": 1, "replies": [{"body": "Final (fifth) year of PhD, got my masters a few years ago. Data scientist (statistician) with strong background in machine learning. I teach at university, (slowly) work on my own research/publications, and as a side gig manage small-ish portfolios for a couple of wealthier folks.\n\nAs per the plays, it depends on what trading strategy you want to pursue and how much $ you want to put on the line. If you want safe trades, pick longer dated options for stocks that you know and are confident about. If you don't have any such stocks, here are some potential plays:\n\nCRWD has plenty of potential, and if it breaks out you should expect it to reach $100 in no time. I'd recommend this stock with my eyes closed to anyone - pretty much any strike price (not too far OTM) and expiry (the further out, the better)\n\nCVNA puts or ROKU calls if you're looking for FDs to play til EOW\n\nHUM calls if you're looking for longer (next week or week after expiration)\n\nBOOT puts if you're looking to make a safe(ish) earnings play", "score": 10, "replies": [{"body": "Thanks for the reply. Could you explain why you’re so confident with CRWD? I’ll look into it but I’m just curious about your reasoning. Looks like it’s had a huge run up since coming to market which is a little bit of a red flag. Also, is most of your DD fundamental or technical (because of stat background)?", "score": 2, "replies": [{"body": "I've made all sorts of brief posts about CRWD for a while (well before earnings), and was quite bullish here about the stock right before earnings - you can go to my profile and do a Ctrl+F to find all those quickly :). \n\nIn short, the company is a game changer when it comes to cybersecurity. Well ahead of OKTA and ZS in many ways. Monster growth, impressive client portfolio, and their technology is 2-3 steps ahead of the game.\n\nAlso, quite crucially: cybersecurity is a sector that is expected to absolutely skyrocket in the short-, medium- and long-terms. As crucial as it gets in today's economy, and will keep getting more and more important as Chinese and Russian hackers do more of their shenanigans.", "score": 7, "replies": []}]}]}]}, {"body": "Any thoughts on AMD", "score": 1, "replies": []}, {"body": "Well, boo. Followed BJRI into earnings and took a big hit (on the 1 play I made). Closed my $MCD put spread and $DIS condors defensively.\n\nStill hoping to hear the rationale on $MCD and $GRPN, but open to hearing a correct play for the next week on a small budget.", "score": 1, "replies": []}, {"body": "BJRI WAS ROUGH, DOWN 15% AFTER MARKET. SELL AT OPEN OT HOLD?", "score": 1, "replies": []}, {"body": "Thanks for this wonderful DD, you're a fucking saint. What's your rationale for $MDB? I'm eying them for a little while but kinda get the feeling that they are overpriced and will dip in the near future or at least move sideways until something big happens. \n\nThoughts?", "score": 1, "replies": []}]}
