{"title": "What is your holy grail stock?", "selftext": "What is your secret sauce?  The stock that you truly believe will be the next Amazon?", "id": "cbbk8z", "created_utc": 1562730465.0, "score": 16, "upvote_ratio": 0.75, "num_comments": 74, "comments": [{"body": "Amazon.", "score": 14, "replies": [{"body": "Yep its amazing I dont understand why its so expensive and too much of a pleb to even buy 1 share, just like the holy grail.", "score": 1, "replies": [{"body": "Valuation divided by # of shares in circulation.\n\nSort of like how apple has a high value but much more shares circulating.\n\nThat's how shares are worth something", "score": 2, "replies": [{"body": "Thats not what r/wallstreetbets says", "score": 1, "replies": [{"body": "That's exactly what they say. Are you referring to the idiot who made the hurdur amazon bad post yesterday?", "score": 3, "replies": [{"body": "No just the general lord of tendies YOLO rhetoric they like to spew day to day.", "score": -1, "replies": [{"body": "That's memes, my man.", "score": 2, "replies": [{"body": "Well course my original comment was more meant as satire anyways", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Disney", "score": 8, "replies": [{"body": "Disney was for sure a buy in the 80s, got in in high 90s prying for the best. God bless, it turned out swell. 52w high today.", "score": 2, "replies": []}]}, {"body": "To try to find a small company that could be the next amazon would be pure speculation and i don’t consider a speculative bet to be a holy grail stock.  I think of a holy grail stock as something that is pretty much a sure bet to make you money in the long-term, not necessarily be the next amazon.  If I had to pick one sure-thing individual stock for the next 30 years, I think I would choose DIS.", "score": 13, "replies": []}, {"body": "AMD", "score": 22, "replies": [{"body": "That p/e tho", "score": 2, "replies": [{"body": "its only going up.", "score": 1, "replies": [{"body": "Yea that is a bad thing", "score": 2, "replies": []}]}]}, {"body": "This - in it at 6, 9, 11. and sold some at 33. If there is a dip ill buy more. If not. Profits are profits and only going up.", "score": 1, "replies": []}]}, {"body": "SPY, liquid, safe, core of my total investments", "score": 12, "replies": [{"body": "Preach", "score": 3, "replies": []}]}, {"body": "CRSP, EDIT, and NTLA\n\nThey're working on utilizing the emerging technology of CRISPR-Cas 9 to cure previously-un-curable diseases, like sickle cell and the most common type of congenital blindness. \n\nThe technology and trials are young so the shares are in low double-digits.", "score": 7, "replies": []}, {"body": "twtr", "score": 3, "replies": []}, {"body": "$BIDU", "score": 3, "replies": []}, {"body": "Shop", "score": 6, "replies": []}, {"body": "Amazon/Apple/Disney\nIs my holy trinity.\nI can see them double in 10 years", "score": 2, "replies": [{"body": "A doubling in 10 years would mean an annual return of about 7.2%, less than the SPY average, so not really spectacular.", "score": 11, "replies": [{"body": "With dividends reinvested it is more, probably more like 10 or 11%", "score": 1, "replies": []}]}, {"body": "add in MSFT and that's my top 4!", "score": 2, "replies": []}]}, {"body": "$SPX", "score": 2, "replies": []}, {"body": "Hoping it will be hmus", "score": 2, "replies": [{"body": "I do enjoy hummus", "score": 2, "replies": []}]}, {"body": "ENPH", "score": 2, "replies": [{"body": "Shhhh don't tell them the secret.", "score": 2, "replies": []}, {"body": "Down today, hoping for a nice bounce back tomorrow.", "score": 1, "replies": [{"body": "Yea", "score": 1, "replies": []}]}]}, {"body": "BAM. If I could only own shares of one company, that'd be it.", "score": 2, "replies": [{"body": "Probably the same for me - not a holy grail really, but I agree with it being closest to okay for a single holding (although I'd never do that), they have very diverse portfolio, both by asset type and location, and the management is great. It adds a lot of diversification to a portfolio.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Lol. Nice.", "score": 1, "replies": []}]}, {"body": "$SHOP all the way", "score": 2, "replies": []}, {"body": "INTU - little competition, rock star dev/marketing culture/philosophy.", "score": 2, "replies": []}, {"body": "Sq", "score": 2, "replies": [{"body": "This is mine too!", "score": 1, "replies": []}]}, {"body": "Im gonna get a lot of shit for this one but whatever.\n\n$TSLA\n\nHope the profit pays for a Model 3 Performance in the future.", "score": 5, "replies": [{"body": "Would of on reservation day. Man I'm upset didn't invest heavy back then 😬. Now it's time for the truck to stomp the yard.", "score": 2, "replies": []}, {"body": "Honestly I was scrolling through my list of stocks I own, and couldn't think of a good answer. Somehow I scrolled right past $TSLA and didn't even think about it. But absolutely, Tesla is years ahead of everyone. Just like Amazon was and is.\n\nThey are making their own Chips, and producing the best technology with the best efficiency on their batteries. \n\nYou will start to see a Tesla on every road.", "score": 2, "replies": []}]}, {"body": "Nio", "score": 1, "replies": [{"body": "Oh child....", "score": 2, "replies": [{"body": "🤔\n\nCost averaged to around 2.8 dollars..thought that was smart", "score": 1, "replies": []}]}]}, {"body": "LQMT", "score": 1, "replies": []}, {"body": "$PLAN -> think it could be the next Microsoft", "score": 1, "replies": []}, {"body": "ADA", "score": 1, "replies": []}, {"body": "Match Group", "score": 1, "replies": [{"body": "I wouldn't consider it a holy grail (that would be some larger company that I would always be comfortable to buy more, probably V for me), but I love this stock. I am so glad I bought at the low prices in the last quarter of 2018, it's been very rewarding. But it has been quite volatile lately, I'm not drawn to buying more right now. But I'm sure that there is huge growth ahead. I know Americans are skeptic, since growth is slowing there, but being from Europe, I am seeing a huge increase in local users here, both from using and from talking with others. Also, I was surprised how many people use their premium features. And if they can get a piece of the Asian, especially Chinese market, they have a lot of potential. That won't be easy, but I believe in the company.", "score": 2, "replies": [{"body": "Wow. Thank you for the reply. I got a little to into the title, not the whole post, and now understand holy grail. Haha", "score": 1, "replies": [{"body": "Well, I think the meaning of it is subjective. To me, personally it means what I described, something I would be comfortable with buying at nearly any level. But for someone it might be the stock with the greatest growth prospect, disregarding downside risk.", "score": 1, "replies": []}]}]}]}, {"body": "For me it is a tie between Amazon and Google.", "score": 1, "replies": []}, {"body": "$BYND ^(/s)", "score": 1, "replies": []}, {"body": "Not my next Amazon but FTNT returned me 108% as of today", "score": 1, "replies": []}, {"body": "$BLNK still holds in my heart, despite the company being a little broke right now. I think they will power through and the Electric Car industry will begin to blossom and they'll figure it out.", "score": 1, "replies": []}, {"body": "Nintendo is the next Disney", "score": 1, "replies": []}, {"body": "Without a doubt, V.", "score": 1, "replies": []}, {"body": "MSFT \n\nHas strong positions in Cloud, enterprise/productivity software, gaming\n\nAlso the only big tech company thats flying under the radar with government probes, despite having a larger market cap than Apple, Amazon, Alphabet and Facebook", "score": 1, "replies": []}, {"body": "RAD", "score": 1, "replies": [{"body": "Troll", "score": 3, "replies": []}]}, {"body": "NTDOY", "score": 1, "replies": []}, {"body": "WING", "score": 1, "replies": [{"body": "wing stop will be the next amazon.  You nailed it.", "score": 8, "replies": [{"body": "Id go in on it.", "score": 1, "replies": [{"body": "Wingstops first goal is to have a box of chicken wings in every house in America.  After that, world domination.", "score": 2, "replies": []}]}]}]}, {"body": "AMD. Doubled my money in the past 2 days with Calls.\n\nI've been following it since last December and it's made me so much money consistently.", "score": 1, "replies": [{"body": "Financials vs stock gains look terrible. But i am building an amd pc", "score": 1, "replies": []}]}, {"body": "Aurora Cannabis", "score": 1, "replies": []}, {"body": "Snap", "score": -1, "replies": []}, {"body": "$COKE. Not KO, but the bottling company COKE. It’s massive rise, that blip was a run, but otherwise it’s been consistently upward. Went in  at 150. I’m rather pleased.", "score": 0, "replies": []}, {"body": ".........Amazon............", "score": 0, "replies": []}]}
