{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b2vxhi", "created_utc": 1709197131.0, "score": 0, "upvote_ratio": 0.17, "num_comments": 28, "comments": [{"body": "Market crash being imminent but unpredictable? Okay, which one is it? Is it imminent, or is it unpredictable? \n\nDepending on your time horizon you shouldn’t focus too much on macroeconomics and more on finding and buying fantastic businesses. I bought ULTA just this week at all time high, I don’t care about the market, I am in for 10+ years.", "score": 8, "replies": [{"body": "Not an expert by any means. But the market is terribly high right now. Basically. I don't want to buy at a high price right now to invest for 10+ years but would rather buy cheap and invest for 3-5 years.", "score": -6, "replies": [{"body": "What do you mean the market is terribly high? If we assume that the market will go up over any given long term time period, it has to be on all time high or near that most of the time. Most of the stocks are not even that much higher than 2021. \n\nIf you really want to invest in single stocks you need to dedicate yourself to reading (books, financial reports, 10ks) and be open minded. Also there is no need to rush or FOMO, there is always a deal to make, you “just” need to find it.\n\nFor the beginning I would just try to Focus in avoiding mistake, more than in trying to find the “next NVIDIA”. You will learn a lot in the beginning. Trust me, it is better to have +0% after your first 2 years*, than already being massive in the red due to FOMO and meme stocks.  Try to analyse easy stocks with products you are using in your daily life. Read the reports and try to create your thesis where the product/stock could be in 5 years.\n\nIf that’s to much work, fine! You can get great results with just sticking to ETFs in the S&P500 or MSCI world. Single stocks can lead you to unlimited growth, but it can also ruin you, high risk, high reward. \n\n*Buffetts rule no 1, never lose money. Rule no 2, don’t forget rule no 1”", "score": 5, "replies": []}, {"body": "Time in the market beats timing the market. Also most of the time the market is at ath.", "score": 2, "replies": []}]}]}, {"body": "ATHs are usually followed by more ATHs.\n\nIt seems like you aim to invest driven by FOMO, so an inexpensive S&P500 ETF is probably the best product for you while you get a broader understanding of investing, the stock market and on how to pick stocks through due diligence instead of emotion.\n\nNot financial advice.", "score": 3, "replies": [{"body": "No offense. But I'm trying to stay away from the s&p500 since it's (controversial opinion) very manipulated. Been trading stocks for about 2 years now, and I was just asking what stocks the rest of this subreddit is into right now", "score": -7, "replies": [{"body": "So you want to stay away from the s&p500 because it’s heavily manipulated… but you are happy to buy into individual companies? Not only the big boys either, random suggestions on Reddit! I think you are confused my friend, market manipulation happens consistently but not in the way you think, and there is no cabal out there adjusting the prices of a whole ass index to fleece retail", "score": 2, "replies": []}, {"body": "I'm into VOO, it's a great stock.", "score": 1, "replies": []}]}]}, {"body": "Honestly with the imminent crash you are predicting, I’d sell everything you have right now. \n\nThen buy back later when prices are higher and I am ready to sell.", "score": 3, "replies": []}, {"body": "Put the money in a money market account", "score": 2, "replies": []}, {"body": "Voo is your safest bet", "score": 1, "replies": [{"body": "Wich is what?", "score": -2, "replies": [{"body": "It’s an etf that tracks the s&p500.", "score": 4, "replies": [{"body": "Aah okay gotcha", "score": 0, "replies": []}]}]}]}, {"body": "Beyond meat 🍖 lol", "score": 0, "replies": [{"body": "U sure??", "score": 1, "replies": [{"body": "No man just joking. It’s dead money. \n\nWhat’s your objective and time horizon", "score": 1, "replies": [{"body": "I actually preemptively ordered 1000 shares of beyond meat. Something I belive in", "score": -1, "replies": []}]}]}, {"body": "I just checked it and god. Investing 2 days ago would be a banger", "score": -1, "replies": [{"body": "You are seriously not ready to invest. Put your money into a index fund or brk.b and forget about it. I rather sleep at night then be nervous about this and that stock.", "score": 2, "replies": [{"body": "Not ready to invest bc I saw that it rose by 100% for 2 days ago or wha?? And no I did not actually order 1000 stocks for beyond meat", "score": 1, "replies": []}]}]}]}, {"body": ">With the market crash being imminent\n\nGo short then if your crystal ball is so amazing that you know the market is going to crash.", "score": 1, "replies": []}, {"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "Some people shouldn’t be allowed to have money.", "score": 1, "replies": [{"body": "OP is included", "score": 1, "replies": []}]}]}
{"title": "Starbucks, Workers United union agree to start collective bargaining, contract discussions", "selftext": "Likely bullish for SBUX share price and market seems to have a positive reaction thus far.  I was beginning to think the standstill would slowly damage their brand over time.  Also union efforts only seem to be growing over time at SBUX chains (at least US) so ignoring it and sweeping it under the rug doesn't seem like a smart solution.  Getting a contract signed is probably in the interest of all parties including shareholders.\n\nhttps://www.msn.com/en-us/money/companies/starbucks-workers-united-union-agree-to-start-collective-bargaining-contract-discussions/ar-BB1j3vw8\n\n>Starbucks announced Tuesday that it will begin discussing potential collective bargaining agreements with the labor union representing nearly 10,000 employees from around 400 stores.\n\n>The coffeehouse chain's decision comes nearly three years after Workers United, an American and Canadian labor union, initially organized baristas at a Starbucks in Buffalo, New York.\n\n>\"Starbucks and Workers United have a shared commitment to establishing a positive relationship in the interests of Starbucks partners,\" Starbucks said Tuesday in a statement. \"During mediation discussions last week for the ongoing brand and IP litigation, it became clear that there was a constructive path forward on the broader issue of the future of organizing and collective bargaining at Starbucks.\"\n\n>In addition to opening up discussions, \"as a sign of good faith,\" Starbucks agreed to allow employees represented by Workers United to receive credit card tips from customers and other benefits, which the company announced in May 2022, according to Starbucks' statement.\n\n>\"While there is plenty of work ahead, coming together to develop this framework is a significant step forward and a clear demonstration of a shared commitment to working collaboratively and with mutual respect,\" Workers United said in a statement. \n\n>**Starbucks, Workers United relationship taking turn for the better**\n\n>Starbucks and the union's relationship began going in the right direction in December 2023 when the company sent a letter to Workers United as an \"attempt to propose a path forward that would allow us to resume productive contract negotiations.\"\n\n>\"We collectively agree, the current impasse should not be acceptable to either of us,\" Starbucks said in the letter. \"It has not helped Starbucks, Workers United or, most importantly, our partners. In this spirit, we are asking for your support and agreement to restart bargaining.\" \n\n>**Pending lawsuit between Starbucks, Workers United**\n\n>Despite efforts to improve the relationship, both sides still have \"outstanding litigation,\" which Starbucks said Tuesday it hopes to resolve with the labor union.\n\n>The company sued Workers United in October 2023 over pro-Palestinian social media posts shared by the union's account, which angered hundreds of Starbucks customers, put other employees' safety at risk and blemished the chain's reputation, according to court records. Starbucks filed the suit in the Southern District of Iowa.\n\n>The company also sued over Workers United's \"unauthorized use of the famous Starbucks name and logos that copy the famous Starbucks logos,\" court records show. The company accused the union of using \"copycat logos\" to promote fundraising, sell merchandise and falsely promote political and social topics on behalf of Starbucks. \n\n>Starbucks requested a jury trial and permanent injunctive relief prohibiting the union from using logos similar to theirs, court documents show.\n\n>Workers United countersued against Starbucks in a Pennsylvania federal court and requested that the union be able to use Starbucks' name and similar logos, according to court records. Workers United also accuses Starbucks of defaming the union by associating them with terrorism. \n\n>**Starbucks announced pay raise, Workers United planned 'Red Cup Rebellion'**\n\n\n\n>After filing the suit, Starbucks announced in November 2023 that it would increase hourly wages and benefits for most U.S. workers. The pay raise came after the company had a fiscal year with record sales, according to a statement by Starbucks.\n\n>During the same month, Workers United planned a strike that led to thousands of Starbucks employees at hundreds of locations walking out during Red Cup Day. The union-coined \"Red Cup Rebellion\" stemmed from claims that Starbucks was \"illegally refusing to bargain with baristas over staffing, scheduling and other issues,\" Workers United said in a news release.\n\n>\"Promotion days like Red Cup Day, half-off ThursYays and Buy One Get One Free offers cause a flood of customers to stores without any additional staffing to cover the influx of orders,\" the union said in the release.", "id": "1b34soy", "created_utc": 1709224949.0, "score": 52, "upvote_ratio": 0.85, "num_comments": 22, "comments": [{"body": "bearish for SBUX then", "score": 12, "replies": [{"body": "Pretty much", "score": 3, "replies": []}, {"body": "Bs collective bargain contracts are great it gives stability and create stable labour relations. a lot of sucesful companies have collective bargain contracts.", "score": 0, "replies": [{"body": "Like which ones?", "score": 5, "replies": []}]}]}, {"body": "SBUX is screwed.", "score": 10, "replies": []}, {"body": "It will be interesting to see how things go over time.  I think the market is going to \"wait and see\".  Unions have traditionally(over time) created top heavy zombies.  Think auto companies...  GM and Stellantis should have died in 2008, their pension obligations alone are enough to keep stock value low.  Ford hasn't don't anything for at least a decade, nothing moves their stock.  Then look at other heavily unionized sectors, mining, steel, etc...  unless they are able to have double digit profit margins that usually unions stagnate growth, restrict spending, and cut way back on shareholder benifits(less buybacks, lower dividend, etc..)\n\nPlease keep in mind that this only from an investment perspective.  I am making no claim as to weather private unions are good for workers, or the general population....", "score": 19, "replies": [{"body": "One of the reasons UAW was so pushy in negotiations was that profits at the Big 3 auto companies skyrocketed 92% from 2013 to 2022, totaling $250 billion. Also their stocks have gone up and are generally following the market. Unions help reduce turnover which is the greatest cost to any company. I respectfully disagree with your economic take here.", "score": 7, "replies": [{"body": "In 2009 it is about $2000 per car of just pension obligations.  My understanding is it has risen to about $5000 per car.  Even at the 2009 numbers that is 22 Billion dollars a year just to service pensions.  Sure that is fine when profits are up, but the minute things slow down in the market GM is instantly in trouble again and those obligations aren't shrinking.  GM's stock closed today at 40.98, that is virtually unchanged from 2013.  Ford is worse at $12.41 which is basically the mean since the 90's...  How about US steel?  $47.37 again basically the same since the 90's.", "score": 8, "replies": [{"body": "I mean I hear this but you're just overlooking the less obvious economics here. Turn over costs companies billions a year. Churn and burn might work at amazon where you need workers to move boxes but nothing would crash their stock/profit/competitive edge like a dive in quality doing a skilled job would. I havent even brought up safety statistics in unionized v/s non unionized companies and the cost of workers comp/lawsuits. ", "score": 2, "replies": []}, {"body": "Pensions and unions are two different things. Just because they went hand in hand before doesn’t mean they will today. Unions are good for business", "score": -1, "replies": []}, {"body": "Also US steel and steel problems have nothing to do with unionization. You could union bust every steel union and pay them minimum wage and it would still be more expensive than the influx of chinese steel we had.", "score": 0, "replies": []}, {"body": "That sound more that the pension system the companies created is kind of stupid pay-as-you go systems are kind of stupif . Capital based pension systems don't have that problem", "score": 1, "replies": []}]}]}, {"body": "Unions did nothing to create those cherry-picked examples.  Are railroads, package delivery, postal services and Costco \"top-heavy zombies\"?  No.  You're just regurgitating false anti-union propaganda.", "score": 7, "replies": [{"body": "Uhh...  Yes.  Railroads are a huge mess and many have consolidated, closed, or gone private.  UPS and FedEX have regular problems with their unions from pilots to drivers.  Don't even get me started on how bad government unions are for those paying...\n\nAgain though, I am not trying to stay Unions are specifically bad.  Just that they are not a boon to investors and have regularly been the opposite.  While they might be great for employees, that usually comes at the cost of investors...", "score": 13, "replies": [{"body": "> Uhh... Yes. Railroads are a huge mess and many have consolidated, closed, or gone private. UPS and FedEX have regular problems with their unions from pilots to drivers. \n\nEither you're grossly uninformed or lying.  Possibly both.\n\n\n> Don't even get me started on how bad government unions are for those paying...\n\nYeah, ok, confirmed: both misinformed and lying.\n\n\n> Again though, I am not trying to stay Unions are specifically bad. \n\nPants on fire level now.\n\n> Just that they are not a boon to investors and have regularly been the opposite.\n\nMore anti-Union false propaganda.\n\n>  While they might be great for employees, that usually comes at the cost of investor\n\nYeah. More false propaganda.", "score": -13, "replies": [{"body": "Aren't you going to like.. give any good points rather than just say no to everything?\n\nYour shit sounds like the school of Donald Trump, mastery of deflection, but you're on the other side...", "score": 1, "replies": []}]}]}]}, {"body": "Stellantis is a worldwide company I doubt some pension commitements are a real problem.", "score": 1, "replies": []}, {"body": "Good on them for beginning the process of unionizing", "score": 0, "replies": []}]}, {"body": "People should remember that Starbucks has around 30-35,000 stores worldwide. Only half of which are in the U.S. It’s business as usual internationally and they are always busy.", "score": 1, "replies": [{"body": "Europe is pro Union. This will ripple across the pond.", "score": 2, "replies": []}, {"body": "Starbucks has control on their price and very good loyalty from their customers.   \n    \nI don't see a serious problem, people will still want to walk around with their giant starbuck cups to show the world what kind of cool drink they are into.", "score": 1, "replies": []}]}, {"body": "Auto makers and steel producers are a bit different than coffee makers.  Thats a high school job with no skillset needed.\n\nThis is just a bunch of liberal pukes that took a college couse at their local community college... \"Corporations evil: Unions good\"  derp...", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b2sjhj", "created_utc": 1709184301.0, "score": 25, "upvote_ratio": 0.84, "num_comments": 25, "comments": [{"body": "Puts on Beyond meat should print too! Definitely more profit taking there", "score": 12, "replies": []}, {"body": "c3 has gone though 9 cfos? i wonder why?", "score": 7, "replies": [{"body": "So are you saying we should watch out for a dead cat bounce?", "score": 1, "replies": []}, {"body": "Check the CEO..", "score": 1, "replies": []}]}, {"body": "Already in on AI, which is great, just not sure when to hit eject.\n\nWhat about PSTG? Whats your position? Not too late on this, had great ah gains.\n\nAlso, PSNY I absolutely want to get in on I just am not sure (as you said it may have sailed) if that’s shares or calls.", "score": 7, "replies": [{"body": "With earnings due in two weeks, are we sure it’s too late? Looking at the trending of it, shares or calls both seem plausible. But I also have zero financial training and read stocks the way a mystic reads tarot cards. It all sounds interesting but how much of it is made up bullshit? 🤷🏻‍♂️", "score": 10, "replies": [{"body": "You’re referring to PSTG correct?", "score": 1, "replies": [{"body": "PSNY. Polestar…", "score": 2, "replies": [{"body": "Okay cool. Earnings call is right now that’s why I was confused.", "score": 1, "replies": [{"body": "On another note. I just looked at Fiskers earnings call q&a with their stock holders…fucking brutal. People are very unhappy. And apparently the car they offered up for review, the Ocean, was horrible. Not looking good. They post earnings tonight. Rough day at the Fisker camp.", "score": 1, "replies": [{"body": "What can ya even do with Fikers at that price? 0.5p? lol", "score": 1, "replies": [{"body": "Absolutely nothing. Make a few bucks but it enough to warrant buying.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Today was a wild ride for c3ai. Woke up and bought 38 call for 3/1 and up 220% before I sold.", "score": 1, "replies": []}]}, {"body": "PSTG - headquarters is 13 minutes from SMCI headquarters in California. It’s a “small world” All IN!\n\nHave shares and a 35C 3/15\n\nI have seen more and more use of pure storage coming into the Datacenter, just like it did with SMCI back in 2018 and it was a huge missed opportunity. Not letting it happen again.", "score": 4, "replies": [{"body": "Have you looked into PSNY and feel more confident in PSTG?", "score": 2, "replies": [{"body": "Just a normal Regard, but I do like Pure Storage long term. \n\nI own both. But down 60% on PSNY( to me they are just electric Volvos). No faith, just another electric car… I have more faith in RIVN, down 50% and that still got me nowhere.  Car market is hard. \nMaybe they turn it around?", "score": 4, "replies": [{"body": "You must be pleased with how PSTG is going today, it's looking great", "score": 4, "replies": [{"body": "I’m probably wrong more than I am right…. Sad truth", "score": 1, "replies": []}]}]}]}]}, {"body": "C3 AI has a 4.1B market cap while making $73M revenue and having GAAP adjusted loss of $25m. Idk man, maybe they'll get bought out by one of the big players, but I don't see them being the play.", "score": 2, "replies": [{"body": "78m quarterly revenue, guidance of ~300m for the year", "score": 1, "replies": [{"body": "They also have like $700M of cash, so a good chunk of the market cap can be explained by that.", "score": 1, "replies": [{"body": "Yeap but the price is definitely inflated still but if you see the multiples of revenue that palantir is trading the current valuation is not that outlandish", "score": 1, "replies": []}]}]}]}, {"body": "https://preview.redd.it/940xjnopkklc1.jpeg?width=1290&format=pjpg&auto=webp&s=8707a63dde1e399913da4deafe3947342852ee3f\n\nPicked up some long dated calls. Would be crazy if this is back above 220 by mid March. I got $10k in MARA losses to recouperate", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "30 percent profit and keeps getting bigger", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b2uk28", "created_utc": 1709191478.0, "score": 7, "upvote_ratio": 0.71, "num_comments": 24, "comments": [{"body": "It’s not a ai bubble. It’s the ai battle of Mordor. Look at snowflake they are losing their battle.", "score": 12, "replies": [{"body": "\"I already just gave guidance, not sure what else you want from me.\"", "score": 1, "replies": []}]}, {"body": "[Why you might not see an AI bubble once it‘s formed…](https://www.chaotropy.com/stock-market-why-you-might-not-see-an-ai-bubble-once-its-formed/)", "score": 2, "replies": []}, {"body": "If we just for a minute assume it is a bubble and it will crash, what do you think it'll drop to?", "score": 2, "replies": [{"body": "18-24x P/E is always a safe and fair valuation", "score": 3, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 4 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "There wont be one.", "score": 1, "replies": []}, {"body": "It won't be a bubble. It will gradually replace a lot of shitty jobs and force the issue of UBI.", "score": -1, "replies": [{"body": "UBI is a death knell for a society", "score": -2, "replies": []}]}, {"body": "The people administrating / working in  Google and Facebook datacenters are going to be among the first ones to know. They are going to know how many chips are are needed before Nvidia themselves do.", "score": 0, "replies": [{"body": "It doesn't matter how many is needed. It only matters how many can be produced.", "score": 0, "replies": [{"body": "Not really, we also have a limit on how many chips we can fit inside of data centers", "score": 3, "replies": []}, {"body": "for now, yea.  ASSUMING, supply catches up with demand, then the future could say otherwise.", "score": 1, "replies": []}]}]}, {"body": "SMCI earnings will keep some of these shit stocks. Nvidia is fine tho", "score": -1, "replies": []}, {"body": "Well I'm using ai rn to update my resume.", "score": 1, "replies": [{"body": "And you haven’t paid for the service, and never will you", "score": 1, "replies": [{"body": "They get my data. That's payment enough", "score": 2, "replies": [{"body": "Lucky them, now they know the guy to go to if they need someone who has a 4 year gap since their last job and knows how to use Microsoft Excel", "score": 3, "replies": [{"body": "Well yeah. This is a wendys", "score": 1, "replies": []}]}]}]}]}, {"body": "It shall be transitory unless it can defeat JPow.", "score": 1, "replies": []}, {"body": "AGI is 90% completed according to the stock market ![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "The potential of LLM sis just epic. It can help everyone and make everyone save a shitload of time, it's already the case for many of us. Just make it pay $5 a month with a nicely package for personal usage and imagine the potential revenue for B2C only, while for B2B it may take a little longer but companies are already getting on board.\n\nLook at CEOs spending policies in IT, AI is everywhere, they all want to get on board. \n\nBiggest risk is regulatory IMO, this is still a gray area for copyright and shit.\n\nBut go ahead, short AI players if you want, we are on WSB", "score": 1, "replies": []}, {"body": "Not a bubble, safe place to store money with huge potential upside. \n\nAI will keep improving and has use cases for every aspect of life. Economy and markets might shit the bed, but there is just a shit ton of cash/money so who the fuck knows anymore.", "score": 1, "replies": []}, {"body": "There will be no crash. What people define as a bubble is backed by a growth unseen before, so we get P/E numbers unseen before. The comparison with the dot com crash is misleading, back in the days loads of companies that had a questionable business models and were pushed to the moon shortly after their IPO, this time everything is backed up by very solid numbers.\n\nThe only real risk I see, especially in the EU, is the political and regulatory side of things. Saying this, the EU doesn't have a major AI players anyway...and I highly doubt anyone in the US is willing to mess with the stock market in times like these, war in Ukraine, crumbling Chinese economy and constant threats towards Taiwan, sanctions here, sanctions there, messed up middle east with various conflicts going on.", "score": 1, "replies": []}]}
{"title": "META insiders sold shares worth $822 mln in February. Record monthly sales volume for last 5 years.", "selftext": "", "id": "1b2yowj", "created_utc": 1709208077.0, "score": 71, "upvote_ratio": 0.88, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 131 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "well sure they are selling on highs, not lows like you idiots", "score": 85, "replies": [{"body": "Right! The real news would be if they were buying more shares at this price.", "score": 6, "replies": []}]}, {"body": "You should show the shares sold instead, because the graph above mirrors META stock price. That Oct 2022 low was 80-90 range and now it's at 480's. Instead you showed the value of the shares ... Have insider increasing share sales or are they selling the same shares ? I obviously can look myself, but I think it gets the bears in this one dimensional view.", "score": 9, "replies": []}, {"body": "Please stop using this awful chart to show insider sales, show it in number of **shares** not USD. If you sell at a steady pace and the stock grows 3x it looks like you are selling 3x as much even though you didn't touch your allocation", "score": 11, "replies": []}, {"body": "Breaking news. People with lots of shares sell some when the price is high 🤷‍♂️ \n\nYou regards would do well to follow their lead. Especially the part where they get their shares for free…", "score": 3, "replies": []}, {"body": "Why is retail pouring so much money here? It’s so strange.", "score": 2, "replies": [{"body": "It’s normal", "score": 1, "replies": []}, {"body": "It's what retail does, buys the top.", "score": 1, "replies": []}]}, {"body": "Everyone rushing to buy bitcoin", "score": 6, "replies": []}, {"body": "Nobody cares", "score": 2, "replies": []}, {"body": "What website is this?", "score": 1, "replies": [{"body": "It’s from FinFab app for iPhone", "score": 4, "replies": []}]}, {"body": "this is guaranteed a bullish sign", "score": 1, "replies": []}, {"body": "Tax tax tax. This is normal. Also, maybe because it was Valentines day and they needed crystal Bilbo baggins. Who knows?", "score": 1, "replies": []}, {"body": "Fml I was giving mf’s 7 figures of stock a year ago as a recruiter at around 100/share.  Then got laid off.  Thanks Mark.", "score": 1, "replies": []}, {"body": "Here is the real reason you idiot: Each year employees get refresher RSU with fixed dollar amount(not fixed for everyone but let’s simplify)Since people got it at the bottom last year,  it’s value tripled. This is just regular sell and diversify for Meta employees.", "score": 1, "replies": []}]}
{"title": "When will Nvidia pick up again?", "selftext": "[removed]", "id": "1b2z1si", "created_utc": 1709209310.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 24, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "March 4th 11:36am bro. What else do you want to know", "score": 16, "replies": [{"body": "What do I do until then? We don't have Wendy's where I live.", "score": 5, "replies": [{"body": "Try Hesburger", "score": 7, "replies": [{"body": "prefer Herburger ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|8882)", "score": 2, "replies": []}]}]}]}, {"body": "It’s ogre", "score": 4, "replies": []}, {"body": "After I put my puts in", "score": 3, "replies": []}, {"body": "How do you buy calls in Europe, which app do you use? I'm interested in getting regarded too", "score": 3, "replies": [{"body": "Freedom24 for basic options trading or Interactive Brokers for more advanced stuff. Beware of the risks involved in options and get educated on especially IV, and the Greeks before you try. Or just YOLO in like a regard.", "score": 5, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}]}, {"body": "Not after AMD starts roaring", "score": 2, "replies": []}, {"body": "Im expecting 50%+ gains in the next 3 years, that is if demand keeps growing and they can hold their market share.", "score": 2, "replies": [{"body": "I'm hoping for 10% in the next two weeks.", "score": 2, "replies": [{"body": "I was with you. I got out and took a $350 loss on my first option trade. I’m sure it will be better the next trade", "score": 2, "replies": [{"body": "It just jumped, almost back to no losses after earnings gains. If I sell now I made a profit.", "score": 1, "replies": []}]}]}]}, {"body": "Yo Dawg when will this stock that just 300% in one year go up again.\n\nIf you haven't cashed out by now there's no helping you lmao", "score": 2, "replies": [{"body": "Yes, we had first tendies, but what about second tendies?", "score": 2, "replies": []}]}, {"body": "After your calls expire", "score": 3, "replies": [{"body": "That's the neat part, they don't.", "score": 2, "replies": [{"body": "Nothing to worry then you’re all set. Should be at the 1000 in no time", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 94 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "What do u think about Autodesk Earnings?", "score": 1, "replies": []}, {"body": "https://preview.redd.it/u7ikx4micjlc1.jpeg?width=1080&format=pjpg&auto=webp&s=1d19d1d102034b11ddc08b23ff86d40fd60eec5e\n\nWow, thank you guys, that's a really quick response! I'll remember that the next time I want a stock to move! (This in Central Europe time, it's 15:30 arm)", "score": 1, "replies": []}]}
{"title": "Easy 💰 🔥 smci/nvda", "selftext": "", "id": "1b31vsw", "created_utc": 1709217644.0, "score": 25, "upvote_ratio": 0.79, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 431 | **Previous Best DD** | \n**Account Age** | 2 weeks | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Easy money bro you got 103k casually sitting in there. I’ve got 500$ lmao.", "score": 15, "replies": [{"body": "Do me a favor. \n\nType this into a calculator \n\n500 * 1.1687 \n\nNow hit enter….\n\nAnd every time you hit enter after that is you turning that stack into a little bit more every time. \n\nNow keep going and keep track of how many times until you hit 100k.  Now try 1M\n\n\n500 is going to be gambles.  To get closer to the money. Save more cash come back and Make a big boy play close to the money when it’s down or sideways a week… on a short week… then grow your stack.", "score": 2, "replies": [{"body": "My main issue is I have zero idea how any of this works and I am scared to take the big risk. \n\nReally wish I had the money to take the risk and be okay with the chance of loss but right now I can’t", "score": 2, "replies": []}, {"body": "Yeah he needs to go back to working at Wendy’s", "score": 2, "replies": [{"body": "I’ll throw him a bone", "score": 1, "replies": [{"body": "So nice of you", "score": 1, "replies": [{"body": "I hope it works for him. I got lucky with these 19x SMCI 900c 3/15 I got earlier this week \n\nDown to 10 at close - but exchanged for 11 x 1300c 3/15 \n\nWith I just bought 1 extra SMCI instead tbh lmfao \n\nWould be an over million by wed. Or open Monday? Lmfao", "score": 1, "replies": [{"body": "1300 there’s no way it couldn’t break 1000. 3/15 id close those out and buy some strikes closer to reality", "score": 1, "replies": [{"body": "When your baby account is less than some of my 0DTE YOLO’s. \n\n1000 doesn’t mean what you think it does and what happened in the past doesn’t always happen again. \n\nRip if you buy puts next week", "score": 1, "replies": [{"body": "https://preview.redd.it/858z1kp3nvlc1.jpeg?width=500&format=pjpg&auto=webp&s=bbd0dbd002a00a316141c30a5765cee9a5c46037", "score": 1, "replies": []}, {"body": "I usually only buy puts if it’s down at premarket if it’s up I Buy calls me and the trend are friends we have an on and off relationship I was pissed at him a few times last year but we’ve made amends through smci and nvda", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "That’s pretty shitty stuff to say. I have a full time job and save as much as I can. \n\nMust of been nice getting lucky", "score": 1, "replies": []}]}, {"body": "Buy some 3/15 MRVL 100c before close….\n\nMonday at 935am sell them for whatever the bid is. You’re welcome", "score": 1, "replies": []}]}, {"body": "Congrats and fuck you", "score": 13, "replies": [{"body": "![img](avatar_exp|166996155|bravo)\n\nNice hahhhahahha", "score": 4, "replies": []}]}, {"body": "You have a 100k and made 7k? So like 70 bucks my money? Is this even gambling?", "score": 2, "replies": [{"body": "Gambling in the stock market is for regards this is for people who know what they are doing obviously you don’t understand the value of money that’s almost 1 stack go work at Wendy’s for a month and report back I have 50k 100k bp", "score": -3, "replies": [{"body": "???\n\nthen why tf are you here? you're obviously familiar with the slang that WSB uses, but yet you seem to not know that this place was specifically created for sharing degenerate gambles...?\n\nlol go back to r/bogleheads, cunt", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> I’m here because I can look at stupid ignorant people \n\nobviously not, because you're here posting your \"gains...\"   \n\n\nlol you ain't foolin' anyone, regard, so you should really stop while you're ahead. you look pathetic trying to don this superiority bullshit.   \n\n\nyour fragile ego was hurt from someone pointing out the obvious and now you're describing selling calls as if it's some esoteric nonsense. HAHA. fucking hilarious.", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "HAHAHAHAHA\n\nyou mad, regard...? both edited your response and responded to my comment multiple times ![img](emote|t5_2th52|4271)  \n\n\nlol any fucking chimp like you can learn to sell calls, but apparently can't learn to answer a basic question (let alone, use paragraphs - what's the matter, your hands busy stuffing your fat face with all those Wendy's?): why the fuck are you here...?  \n\n\nthe sub is literally called Wall Street ***Bets*** and you started clowning because \"gAMbliNG iS fOr rEGarDs.\" no. fucking. shit. it's the entire purpose of the sub, you illiterate monkey.   \n\n\ngo back to watching your daddy get reamed by his boyfriend in your basement, you insecure incel.   \n\n\ni'm done dealing with your tantrums", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "blocking me then unblocking just to make these comments   \n\n\n![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b34vf1", "created_utc": 1709225137.0, "score": 21, "upvote_ratio": 0.79, "num_comments": 24, "comments": [{"body": "Still holding, I got big hopes on it just like Nvidia.", "score": 15, "replies": [{"body": "yeah I definitely left early and it's up 7%, breakout rules say you sell half and hold the rest. I Just wanted to keep my profits. It's just a sympathy play off of NVDA that was ready to break all time high, so I don't expect it to go far past 190 but who knows", "score": 2, "replies": [{"body": "Funny because at one time both these chips were battling back and forth. AMD was pretty prominent in gaming systems for a while. I have no doubt they are one ARM chip design away from battling Nvidia agajn for top spot.  So at this price and value I think it’s a buy. AI just getting started and hasn’t even done much in the real world. The average person Doesn’t really see much AI as of now", "score": 1, "replies": [{"body": "ya pretty sad I pussied out.. I was waiting a week for the chart to set up for the breakout lol..", "score": 1, "replies": []}]}]}, {"body": "Same here", "score": 1, "replies": []}]}, {"body": "curious why up so much today", "score": 5, "replies": [{"body": "Because hedge funds are dumping money into the only other chip maker that can serve all this AI demand any time soon. ARM has potential which is why they popped too.", "score": 6, "replies": [{"body": "What potential does arm have? They don't make shit?", "score": 1, "replies": [{"body": "They are bad at generating income but they are the ones (along with IMEC for example) that hold the most IP to license on the ARM chips designs themselves, as compared to ASICS chips which are not so gatekept.", "score": 1, "replies": []}]}]}, {"body": "someone certainly knows somethin", "score": 0, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 107 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 2, "replies": []}, {"body": "Just the start.", "score": 2, "replies": []}, {"body": "BUY $187 calls on $SNOW", "score": 2, "replies": [{"body": "What exp?", "score": 1, "replies": [{"body": "March 1st", "score": 1, "replies": [{"body": "I think I may buy a few with a further out exp and little more otm", "score": 1, "replies": [{"body": "Understandable! I just want the stock/option to go sky high tmr that’s why I’m pushing", "score": 1, "replies": []}]}]}]}]}, {"body": "What is ta? Is it a ticker?\n\nJkjk", "score": 2, "replies": []}, {"body": "I just bought puts at 189. I thinkkkkk I’ll be ok", "score": 4, "replies": [{"body": "Ur fked", "score": 1, "replies": [{"body": "Oh I know but I think it’ll drop a bit hopefully lol. I’ll get out with a fat L still but maybe I’ll scrape by", "score": 1, "replies": []}]}]}, {"body": "It’s just starting, 250 by April if hedges keep piling up", "score": 2, "replies": []}, {"body": "Could you elaborate on your TA and signals you looked for on this play?", "score": 1, "replies": []}, {"body": "Not sure about amd. Do people really hope they will bring some AI cards soon that compete with nvidia? I mean nvidia goes to the moon because they actually deliver, but i don't see how amd is going to compete with nvidia when the current success of nvidia is the result of decades of ai research that amd doesn't have.", "score": 1, "replies": []}]}
{"title": "How regarded am I? (AMD/CELH)", "selftext": "No clue what I just bought \n", "id": "1b36p7q", "created_utc": 1709229534.0, "score": 24, "upvote_ratio": 0.83, "num_comments": 25, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 23 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "If you google fomo this post shows up", "score": 49, "replies": []}, {"body": "250😭😭😭😭😭", "score": 31, "replies": []}, {"body": "Sell CELH. You made a great trade, lock in those gainz", "score": 14, "replies": []}, {"body": "I’d sell CELH, they’re gearing up to become a monster but historically sell off after rallies so this call will get washed out.  Take the win, since AMD is probably going to $0.", "score": 7, "replies": []}, {"body": "Very regarded. Close both positions right now. Win profit from the CEHL option and minimize losses from the AMD call. It's too far OTM and unlikely to happen in a month. You'd be much better off with a 200-210 strike price in late April or late May. Options aren't a wishlist you have to be realistic.", "score": 8, "replies": [{"body": "I'd have agreed with you about AMD until I watched it pop almost 12% on nothing. Truthfully though OP, $250 is too ambitious. ", "score": 2, "replies": []}]}, {"body": "Very. Congrats.", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "AMD $250 😂😂😂", "score": 2, "replies": []}, {"body": "I am the most regarded person in the investing world. 7-8 years ago I looked at AMD @ 9 and said…why at 9?  Makes good chips and compete with intel. I never ever bought AMD. Not even a single share.  Another thing to put on my list of regrets which is my entire fucking life.", "score": 2, "replies": []}, {"body": "window licker level", "score": 2, "replies": []}, {"body": "This is like those regards who bought NVDA 1000c", "score": 1, "replies": [{"body": "I was one of them. I got fucked sideways. AH the simulator said 1700 dollars, I was hyped. Then I woke up to a reality check and learned about IV crush and making calls to far OTM.", "score": 2, "replies": [{"body": "Just buy them further out so your dreams can last longer before they come crashing down", "score": 1, "replies": []}]}]}, {"body": "Has about a 7 percent chance of profit", "score": 1, "replies": []}, {"body": "Firstly, it is too early", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Only problem you're gonna have is that you didn't buy more", "score": 1, "replies": []}, {"body": "Enough", "score": 1, "replies": []}, {"body": "That AMD call ain’t lookin so bad now", "score": 1, "replies": []}, {"body": "Buy high sell low baby.", "score": 1, "replies": []}, {"body": "But maybe AMD going to $250? \nSo if you think about it, what could make you the most regarded is not buying more shares", "score": 1, "replies": []}, {"body": "+69, nice", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b3d0ys", "created_utc": 1709244673.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 30, "comments": [{"body": "I keep wondering when to sell AMD….. I’m up like 700% so far… like wtf", "score": 9, "replies": [{"body": "So right now lmao", "score": 21, "replies": []}, {"body": "Sell half at least.", "score": 1, "replies": []}, {"body": "If it's good enough to screenshot, it's good enough to sell", "score": 1, "replies": [{"body": "https://preview.redd.it/ajqpvm7m3tlc1.jpeg?width=1170&format=pjpg&auto=webp&s=45a61b4f16027a11266a8599948067e4a89bcbfd\n\nI was a averaging… here is one and in another account I have 27 shares at like $96. Why did I only by 17. Haha", "score": 2, "replies": []}]}]}, {"body": "https://preview.redd.it/2cfvl4wqpllc1.png?width=828&format=png&auto=webp&s=85fe6dc99cf26304a44c18f6cd8af594fab5476f\n\nAh shit", "score": 5, "replies": [{"body": "AMD just needs to say “AI” in the news and you’re good.", "score": 3, "replies": []}]}, {"body": "First time I ever buy puts and all of them tank:(", "score": 9, "replies": [{"body": "Dr. Lisa Fucking Su said fuck your puts!", "score": 8, "replies": []}, {"body": "What strike", "score": 2, "replies": [{"body": "180 and 182.5 puts Expires 3/8\n\nBought separately throughout the jumps. Maybe I can break even if it tanks a bit in the next day or 2..", "score": 1, "replies": [{"body": "Hmm you would need a big red day tomorrow, or else theta kills", "score": 2, "replies": [{"body": "Definitely lol. Really hoping tomorrow", "score": 2, "replies": []}]}]}]}, {"body": "Oof, hope it was more towards end of day today.", "score": 1, "replies": [{"body": "Half at like 10 am and the rest at 2ish. \n\nDefinitely taking an L let’s hope it’s not half my account tho … really wish I took these calls 💀", "score": 2, "replies": [{"body": "It’s definitely a lesson learned. Can’t win them all.", "score": 1, "replies": [{"body": "Oh yaaaa. Plan on getting out as soon as it dips a little lmao", "score": 2, "replies": [{"body": "Same. Only thing giving me hope is that amd has had a history of popping for a day, then a couple days of tanking", "score": 3, "replies": [{"body": "Yeah like I’m sad but there’s a decent chance I can break even or a slight loss if things aren’t too crazy", "score": 1, "replies": [{"body": "With $DELL backlog from its ER? I think tomorrow is gonna be straight up with multiple bumps along the way.\n\nOr it can take a U-turn around/after 2 because it's Friday/profit-taking time. Or maybe all the way down for me to load up some shares.\n\nI don't pretend that I know, other than the fact that all my covered calls are fucked.", "score": 2, "replies": [{"body": "Well I bought in at 183 then at 190. So if it falls back to 190 give or take I won’t cry just tear up", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I need the floor to fall out on this one for my puts tm or Im on the ramen diet for some time", "score": 3, "replies": [{"body": "Sounds like a win-win to me. I love ramen 🍜", "score": 2, "replies": []}]}, {"body": "lol cope nvidia fanbois\n\n![img](emote|t5_2th52|18630)", "score": 3, "replies": []}, {"body": "Always play both sides.", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 40 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 2, "replies": []}, {"body": "TheStreets articles seemed to be rehashed AI content now.   \n\n\nI thought AMD bumped up guidance for the MI3000 from $1 to $3 billion on their CC, with analysts now saying they expected $5 billion?  ", "score": 2, "replies": []}, {"body": "People who actually create AI models would understand why AMD sales haven’t grown.  People don’t get it that gpus aren’t  all the same. What nvidia built was an industry standard toolkit that allows you to code your models to use the gpu in many different ways. That code doesn’t port over to other gpus.", "score": 5, "replies": [{"body": "Boom. It’s all about the CUDA ecosystem", "score": 0, "replies": []}]}, {"body": "I bought $15 worth last month and now I'll lay awake at night thinking about how regarded I am for buying so little", "score": 2, "replies": []}]}
