{"title": "If you aren’t selling puts, or using the wheel strategy, you are missing out!", "selftext": "For two years I traded options… had lots of ups & downs. At the end of the year, either losing money or not making very much money.\n2 years ago I started selling CASH SECURED puts with small stock like CHPT, NIO, MARA, ect… as I got more comfortable, I moved into AMZN GOOG & of course TSLA. Best strategy for actually making consistent gains! Starting with 40k at the beginning of August, i closed the month with $42,700.00 Strictly selling puts. =$2,700 for the month!\n*the negativity of this subreddit is overwhelming. Wow. I thought it was more about people working together & trying to help each other. My mistake", "id": "168ielp", "created_utc": 1693700207.0, "score": 64, "upvote_ratio": 0.67, "num_comments": 345, "comments": [{"body": "It’s not just your options trading strategy that’s making you money. It’s the underlying asset move upward.\n\nGoog went up 5% in August\nAMZN up 3.2% in august \n\nMost successful wheeling folks just picking the right stocks to ride the wave.", "score": 59, "replies": [{"body": "yeah homie hasn't taken a big L yet, just wait", "score": 11, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "Ouch… harsh market. That goes for every type of trading in the market, including investing.", "score": 3, "replies": []}, {"body": "what kind of noob loses everything in 1 trade?", "score": 2, "replies": []}]}]}, {"body": "You’re exactly right! Ive made over 20k in 2023 using this strategy. ONLY with stocks I wouldn’t mind owning, if I get assigned.", "score": 9, "replies": [{"body": "Everyone wouldn't mind owning a stock in theory when you think of it trading around your cost basis. I dare say you would indeed mind owning the stock if it were trading 90% below your cost basis for months or years...", "score": 28, "replies": [{"body": "If you really didn’t mind owning the stock, not only would a 90% drop not be the end of the world, you’d actually be excited that you could buy more, at a 90% discount….which, in theory would mean you lowered your average cost basis, and you wouldn’t be down 90% anymore. \n\nWhat I found is that most people SAY that they don’t mind owning the stock, but when asked WHY they like that company, they don’t back their thoughts with facts….so a 90% drop is too risky because they didn’t really have a thesis to believe in anyway. \n\nPoint is, if you actually believe in a company, there is no 90% drop, there is a 90% discount. If it goes bankrupt you can bake in the 100% drop however, and learn that you can be wrong.", "score": 11, "replies": [{"body": "Wow CriticismMost3450, that's a good point, and really helpful. Thats what im talkin about!\n\nHelpful, not straight up somethin like where someone don't like or agree with a poster or commenter and because they're always right and know everything they cant wait to criticize the guy or girl just to make their self feel good about theirself, that or they're lookin for likes or up arrows or that  just they're just a plain psycho or simply sociopathetic.\n\nMan, it's sad but your comment is rare at Reddit's options sub and their daytrading sub(aforementioned sub I wont even participate in anymore because of the psychos and sociopaths and even their mods in there are horrific to be around for even 5 minutes now days), but yea, your comment was actually helpful and packed with information that helps, not turns the attention to yourself, so thanks because at that point lot of us learn things. So yea, again,wow, good point and thanks for that.", "score": 1, "replies": []}]}, {"body": "That can happen with any stock. I’m still holding DIS from 2021. No one said this is risk free.", "score": 8, "replies": [{"body": "I don't disagree but people don't buy 100 shares of a stock while claiming they'd be happy to still own it if it immediately dropped a lot. Obviously they understand that if it was to drop that way they'd be happier to have purchased it at the bottom. But somehow for the wheel they do say that.", "score": 8, "replies": [{"body": "I agree… & people have to trade within their means & understand the risks involved.\nThis is a small portfolio size for me.", "score": 8, "replies": [{"body": "As long as it's within your personal risk tolerance then it's fine.", "score": 4, "replies": []}, {"body": "100 shares of amzn is small for you?", "score": 2, "replies": [{"body": "I would say it’s medium. But small risk. I would definitely invest 12k into amzn.", "score": 5, "replies": [{"body": "So why don't you wheel qqq/spy/iwm ? Much less risky and great premium.", "score": 2, "replies": [{"body": "They are too expensive for me. Maybe someday.", "score": 2, "replies": []}]}]}, {"body": "If you are a real trader or investor, 100 shares of a stock or ETF shouldn’t scare you.", "score": 1, "replies": []}]}]}]}, {"body": "Do you sell covered calls against it?", "score": 3, "replies": [{"body": "No. I don’t have 100 shares. I have 70, & I refuse to buy anymore right now. I feel that it can go quite a bit lower", "score": 2, "replies": []}]}]}]}, {"body": "My fund uses the wheel - selling calls on stocks I own, and selling puts on stocks I want to own...", "score": 3, "replies": [{"body": "Nice!", "score": 3, "replies": []}]}]}, {"body": "Well on this red day, i banked as well. It’s not always upward that makes money. If you’re doing it correctly", "score": 1, "replies": [{"body": "Yea I’m up 33% YTD after todays red day. Selling options on the ups and downs gives me 1-3% to the upside.\n\nBut I still need that underlying asset move upward", "score": 1, "replies": [{"body": "Hopefully we get a bounce this week", "score": 1, "replies": []}]}]}, {"body": "Indeed lol", "score": 0, "replies": []}, {"body": "Agreed. It may not be the case when stocks move down.\nDepends how the position is managed.\nCovered calls cap upside potential after all", "score": 1, "replies": []}, {"body": "The KEY is which stocks you put into your wheelhouse - never chase high premiums and never sell puts on a stock you do not want to own long-term...", "score": 1, "replies": []}]}, {"body": "detail paltry fly unique dinner screw instinctive aware bedroom salt\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 42, "replies": [{"body": "it is no more risky than just buy and hold? Your buddy got paid a cash premium and basically bought a $270 stock for $250. Ok then the stock went down - this happens...I try and ladder into positions 4-5 times to reach my max %.", "score": 5, "replies": []}, {"body": "My BF got assigned TSLA at 197, & rode it up to 297. It goes both ways. Hopefully this person is hedging their portfolio. That’s the only way to protect yourself in either direction", "score": 4, "replies": [{"body": "Good point. By the way, for me I HATE buying ins or protection especially when it turned out I never needed it, lol!! But...ive learned to accept the purchases of \"insurance\" and try to keep the charges as small as poss now days.", "score": 1, "replies": []}]}, {"body": "You’re right… ANYTHING you do in the stock market has potential risk. That’s a fact! That’s the reason I only trade with 40k.  \n& with stocks I wouldn’t mind owning. But no stock or eft is risk free", "score": -3, "replies": [{"body": "this is a very green mentality, which is why you see it come up frequently.\n\nthe cyle is this.\n\nlong calls/puts, then short calls/puts, then iron condors or strangle/straddles, maybe calendars, then ratio, then back around again.\n\neveryone looks at iron condors and csp as free money when it isnt.\n\ni like csp as well, but you should realize you shouldnt be doing it every month. you should have a specific set of conditions you follow...w.e that may be.\n\nfor example, the SPY 30-45 day atm contract goes for 1-3% dependent on a few factors. ive yet to see it at 4+%.\n\nif you sold one earlier this year, you wouldve tied up alot of capital since you wouldve been assigned and depending what premium you collected either be down or just near b.e . this would be 2-3 months lost time and youd still likely be down.", "score": 6, "replies": [{"body": "Absolutely! Every type of trading comes with risk. All we can do is try to minimize that risk & hedge", "score": 5, "replies": [{"body": "The beauty with options is that they enable you to leave enough cash for downturns/corrections and other opportunities.", "score": 3, "replies": [{"body": "💯", "score": 2, "replies": []}]}]}, {"body": "It is a green mentality. I do hedge with SQQQ, but I don’t understand why bears are investing in the first place. Maybe you can give me some insight?", "score": 1, "replies": []}]}, {"body": "These people act like you shouldn’t own stocks hahaha are they even traders?? Doubtful", "score": 3, "replies": [{"body": "So true!!  If they are bears, they shouldn’t be investing/trading at all", "score": 2, "replies": []}]}, {"body": "one wrench march history roof repeat lavish detail light glorious\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 10, "replies": [{"body": "Never said easy money.", "score": 3, "replies": []}, {"body": "Enlighten me, please. Since you seem to know so much more. I would love to learn. I’m sure others would appreciate your superior knowledge as well. Thank you in advance:)", "score": 2, "replies": []}, {"body": "Well I never said easy $. It’s a good strategy for me & I do know what I’m doing. Obviously.", "score": 3, "replies": []}]}]}, {"body": "buy an otm put for cheap insurance for this exact scenario. the insurance is worth eating into those profits a bit for the peace of mind.", "score": 1, "replies": []}, {"body": "I partially agree with you. Your buddy’s trade should have been sold once he broke even. But I’m not being critical, just pointing out what I do. Once the price matches the cost basis sell an in the money call, guaranteeing to get it called away. Then watch the price action and go right back at it selling puts. Not selling for a loss following assignment shows experience. The hardest thing to control when trading options are your emotions. The first reaction after an assignment that shows a sizable loss, is to want to sell. Fighting the urge and thinking through your next move is what experience teaches us.", "score": 1, "replies": []}]}, {"body": "You made 270 with 40k in one month?", "score": 18, "replies": [{"body": "Bro he started 2 years ago. Idk how anyone started 2 years ago made money,  so mad respect for that even lol. Maybe if we include the recent pump. But that's pretty good if you're being safe.", "score": 9, "replies": []}, {"body": "$2700… sorry. Typo", "score": 7, "replies": []}, {"body": "That was my thought - that's um... not great...", "score": -6, "replies": [{"body": "6.25% for a month is fantastic. But, thats just a month. We’ll have to see what that 1y is in due time.", "score": 11, "replies": [{"body": "Yeah OP edited the post, originally it was 0.625%.  Not terrible, but not great.", "score": 2, "replies": []}]}, {"body": "Edited sorry", "score": 4, "replies": [{"body": "Can you share what stocks you own and share the process? Do you sell weekly calls?", "score": 2, "replies": [{"body": "Yes, of course. I can post it here or you can DM me if your interested in the past plays", "score": 2, "replies": [{"body": "> if your interested\n\n*you're\n\n *Learn the difference [here](https://www.wattpad.com/66707294-grammar-guide-there-they%27re-their-you%27re-your-to).*\n*** \n ^(Greetings, I am a language corrector bot. To make me ignore further mistakes from you in the future, reply `!optout` to this comment.)", "score": 9, "replies": [{"body": "Get em, bot.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Yeah it’s amazing until you inevitably get blown up on a trade.", "score": 34, "replies": [{"body": "Well worst case scenario is getting assigned, which I have. So I sell covered calls. I also only play stocks I want to own. I never chase high IV Or speculative stocks.", "score": 17, "replies": [{"body": "Yep then you compound the error and get blown up on the covered call when it unexpectedly explodes on you", "score": 9, "replies": [{"body": "It’s happened so many times! Almost happened with TSLL last week, but then it dropped on Friday, so I didn’t get all my shares called away.", "score": 4, "replies": []}, {"body": "If he sells the call at the same strike he sold the put at he technically makes the premium of the sold put and the sold call.", "score": 0, "replies": []}, {"body": "More great insight.", "score": 1, "replies": []}]}, {"body": "You haven't had a real blown up Wheel trade yet, then.\n\nI trade the Wheel, but they don't always work out. Here's a real example.\n\n1. Stock I wanted to own KSS, good retailer with positive acquisition prospects, trading for around $50 at the time.\n\n1. Rolled $60 short puts (mine were levered, so even better returns than a CSP). Collected nice credits. Wheel is great and I'm a genius!\n\n1. Whoopsie, KSS merger offer fell through, stock tanked to $28. Now what? My cost basis on the assigned shares, even after deducting accumulated credits, was around $50. $50 CCs had zero bids. I had no choice, I had to write CCs below my cost basis at $35. If the stock rallied above $35 I'd be totally fucked.\n\n1. But that never happened. The stock stayed near the low 20s for the better part of a year, with me making $15-$20 (that's $.15-$.20 per share) credit per CC, barely making a dent in my loss on the shares.\n\n1. Finally gave up and dumped the shares for a big loss.\n\nThat's not my only Wheel failure. I've had other similar failures. Am I just bad at picking stocks? Maybe. But I've had Wheels that succeeded as well, more than failed, so I don't think it's bad stock picking. The Wheel just can't handle a stock that tanks and stays down for a long time. The Wheel works best for a stock that is bullish and rallying. It's not so good for any other pattern.", "score": 7, "replies": [{"body": "No trading is 100% all the time. Of course", "score": 1, "replies": []}]}, {"body": "Join us at thetagang", "score": 5, "replies": [{"body": "Ok I will!", "score": 5, "replies": []}]}, {"body": "Mara, I was selling puts on riot at 30 it's at what now 😭", "score": 3, "replies": [{"body": "I don’t trade RIOT, but I just looked. What the heck happened to it? I know BTC is down. But RIOT tanked hard", "score": 1, "replies": []}]}, {"body": "Good strategy", "score": 1, "replies": []}]}, {"body": "Great insight", "score": 2, "replies": []}, {"body": "Isn’t that the case with all trading? It can’t ALWAYS work in his favor….", "score": 1, "replies": [{"body": "Once a week people get in here and act like it’s a can’t lose strategy. I’ve seen lots of blowups wipe out all those pennies", "score": 0, "replies": [{"body": "I’m sure…. But CSPs are not a “can’t lose” strategy & I don’t feel like that is what this person is saying at all. My take is that he’s saying to try it out. \nHave you ever sold CSPs?", "score": 1, "replies": [{"body": "Yep", "score": 0, "replies": []}]}]}]}]}, {"body": "I have made money using the wheel in the past and still do it as an overlay to my more profitable strategies. But if you do the wheel carelessly on individual socks that are volatile (which you would be tempted to since that's where the highest premiums are) you will get your account blown up sooner or later. \n\nHere is what happens sooner or later: you sell a put quite far OTM then suddenly it ends up expiring deep in the money like you are assigned and  you end up with the shares. It's not so bad I mean maybe if you sell  covered calls repeatedly eventually the premium will get you back to breakeven. Except that's only if you sell much lower than your cost basis because right now there's basically no premium if you sell above your cost basis so you sell significantly below and it goes well for a while. Then suddenly the underlying takes off like a rocket and your shares are called away. You look at your spreadsheet and realize that your trade is deep in the red and now you don't have the shares. In fact the trade is so deep in the red that all the profits you made from all the iterations of the wheel you did this year don't make up for it.\n\nThere is no edge in the wheel or selling options naively. You can be consistently profitable by selling options but only if you do it in a way where the losses that will inevitably occur don't give back all of the profits from all of the winning trades and then some.", "score": 27, "replies": [{"body": "People need to know when to close their short puts before it goes from deep OTM to deep in the money. Take a small loss if the trade is working against you instead of holding out hope for a turnaround.  Of course, easier said than done.", "score": 15, "replies": [{"body": "If you are selling a naked or cash secured put then absolutely. But this won't protect you against overnight gap risk.", "score": 6, "replies": []}, {"body": "Wow, 50 responses and someone (Mooky) finally talks about risk management. If a CC underlying drops 15%, sell. Even is you like the stock. Little losses don’t hurt, big losses blow up your account. I’ve made plenty of money over the last two years using the wheel, but you have to manage risk!", "score": 2, "replies": []}]}, {"body": "How are you protecting the downside? Vertical spreads? (Buying a lower priced put?) Assuming you are, how do you decide how low is too low?", "score": 2, "replies": [{"body": "Yes that's one way to cap max loss and ensure you don't end up having to sell calls for years below your cost basis. But it's not necessarily the most efficient way. I don't do it this way because I don't trade the wheel by itself in individual socks, I do it as overlays to other strategies that are negatively correlated or uncorrelated so that's a different story. \n\nBut if I needed to do it this way and wanted to figure out how low to buy the long put I'd backtest wins and losses of the strategy for the specific underlying over long periods of time. This would tell me what's the max loss I can sustain while still being above my long term profit target for the strategy. Then I'd simulate a pessimistic scenario where the max loss occurs a little more frequently than it has in the past and buy the corresponding strike put. I would do this only if given the pessimistic scenario the strategy is still expected to deliver profits above my target in the long run otherwise I just won't put on the trade.", "score": 2, "replies": []}]}, {"body": "Agree 100% with you... What do you suggest instead? OR do you even suggest something? Maybe Options is just a fools game... I have been trading for years and my account remains flat, at least I have not lost any money but have not made any either.", "score": 2, "replies": [{"body": "Everyone's trading style is different and since aspects of trading are psychological I think you have to find something that works for you. For me what works is to trade purely based on data. I don't try to predict future directions of individual stocks or where the market might go. I simply base my decisions on patterns that existed in the past and that I can be reasonably confident will hold on the future. When you are in a bull market like we were just a few years ago it doesn't matter what you do you'll make money and options can make you a lot of money due to leverage. But in this market environment you need reliable strategies or you will lose money or be flat.", "score": 2, "replies": []}]}, {"body": "I agree. Thank you!", "score": 2, "replies": []}, {"body": "hey there, exploring the wheel and came across this good comment. is this worst case scenario you’re describing mostly going to happen if you’re chasing higher premiums on volatile stocks? is it more palatable for you if I’m ok with being incredibly boring and trading much lower volatility for less premium?", "score": 1, "replies": []}]}, {"body": "You're missing out until the market tanks ... Then you get crushed like option sellers in 2008 and 2020. You're optimistic based on a small time sample that has favored your strategy.", "score": 7, "replies": [{"body": "Oh I did in 2021 lol", "score": 1, "replies": []}]}, {"body": "I have found that CSPs are great strategy for options traders, the downside is that it requires a lot of capital that most of these jealous, know-it-alls don’t have.\nSo keep doing what you’re doing. Glad it’s working for you!", "score": 5, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "I 'll keep this simple because I do the same thing..........CONGRATULATIONS and keep up the good work!", "score": 5, "replies": [{"body": "Yay! I love hearing it! Thank you! :)", "score": 2, "replies": []}]}, {"body": "Wheeling is only good for neutral to bullish markets/stocks. You don't mind owning the stock, but lot of times you'll be bagholding stocks when they get assigned after a big dump either due to poor earnings (or related news) or general downturn. Some stocks never recover. How do i know? By bagholding WBA, T, and a couple other stocks that haven't seen my cost basis in 5-6 years or more. Lot of times stocks go down because their businesses have fundamentally suffered.", "score": 3, "replies": [{"body": "I agree. Pretty much the same risk as investing. Which I did a lot of in 2021 & got burned pretty bad. (Thanks DIS & PYPL) & i hold T as well. At least we collect some dividends there.\nThere’s NO WAY to know if your investing in a “good/safe” company. Look at DIS TGT & BUD over the past year. I would have thought they would be good/strong long term holds… WRONG!😂 \nThis isn’t the strategy for anyone bearish. That’s for sure. Unless they want to trade SQQQ. (Which I do as well, as a hedge)", "score": 2, "replies": [{"body": "So, just trade SPY", "score": 1, "replies": []}]}]}, {"body": "im building a position in AMZN to wheel, not quite at 100 shares yet but i like the premiums on CC's and CSP's as well as weekly options...  you are right its a no brainer", "score": 3, "replies": [{"body": "Have you tried TSLL? I wheel about 10-12 contracts as at time. Great premiums!", "score": 5, "replies": [{"body": "Interesting! I might try this out in the coming week. Have you ever been assigned for this ticker?", "score": 4, "replies": [{"body": "Yes. TSLA dropped on Friday, so I got assigned 200 shares. Which is fine. I’ll sell covered calls with those on Tuesday.\nOr maybe wait for a Green Day for TSLA. I still have 9 more TSLL contracts with different strikes & expirations…", "score": 3, "replies": [{"body": "Good strategy to sell at different strikes. I was wheeling TNA, too, and it was working well. Just worried it will be higher risk since TSLL is leveraged on a single stock", "score": 1, "replies": []}]}]}]}, {"body": "What can I do with 100 shares of SCHD they don’t really move I just like the dividends give me a share other then that thinking of selling and buying spy any thought", "score": 2, "replies": [{"body": "The IV is very low on SCHD, but you could still sell covered calls, if you don’t mind losing your shares if it’s runs up", "score": 4, "replies": [{"body": "Thanks a lot for the advise I. Think I’m just gonna let it sit I found VTI is gonna be my next build", "score": 2, "replies": [{"body": "I buy VTI weekly! Great idea :)", "score": 1, "replies": []}]}, {"body": "My luck it will pump to $80 over night", "score": 1, "replies": []}]}]}, {"body": "Consider AMZY", "score": 1, "replies": [{"body": "yield max funds are pump and dump funds, they have horrible options chains w/ poor liquidity and low premiums, if they screw up on their options trades they employ  Return of Capital, their fees are way high .....    avoid YM at all costs   i dont need to pay a fund .99%  to make an options trade.", "score": 1, "replies": []}]}]}, {"body": "Don't listen to anyone discouraging you, check out barchart, pick solid CSP and make money indefinitely. Just make sure your daily/weekly support is equal to your breakeven. If you get assigned above your breakeven, sell the stock... You're net profit", "score": 3, "replies": [{"body": "Thank you so much. I posted because I thought i could help people learn this. But I guess everyone else knows a better way. I’ll stick to a different subreddit & Twitter, where everyone works together to help each other!", "score": 3, "replies": [{"body": "Most of these folks on here are net losers. Even research have shown that buy puts or calls are at best around 30% win rate. I'm above 70% win rate going on 3 yrs with CSP. Hit me up if you need further help, for free... Good luck G", "score": 2, "replies": [{"body": "Thank you for your positivity. Are you on Twitter? I can follow there", "score": 1, "replies": [{"body": "i'm not too active on twitter with my strategy...W4L32 is my twitter handle", "score": 1, "replies": [{"body": "I just followed you", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Your basically buying stocks but your capped on upside potential temporarily but you get paid for that upfront. You carry 100% of the downside risk but only gain the value of your put. That’s why your getting paid. You best hope we stay in a bull/flat market.", "score": 5, "replies": [{"body": "I sell SQQQ CSPs also. Just in case!", "score": 1, "replies": [{"body": "The strategy is sound. You just need to do it on quality profitable stocks you wouldn’t mind owning anyways and cut losses immediately and run for the hills as soon as things cross into strong bearish territory.", "score": 2, "replies": [{"body": "Absolutely! Thank you :)", "score": 1, "replies": []}]}]}]}, {"body": "$2700 on AMZN GOOG and TSLA alone in this low IV environment? What delta and DTE are you using?", "score": 2, "replies": [{"body": "Sounds like he's in tsll?", "score": 2, "replies": []}, {"body": "I’ve been trading TSLL (multiple contracts) COIN & MARA (multiple contracts) Delta below -.30\n& one month to 6 wks out. Typically close at 75% & immediately sell another further out.\nOr get assigned & sell covered calls.", "score": 2, "replies": [{"body": "that stopped working a month ago", "score": 1, "replies": [{"body": "Not for me. I did well in Aug. but of course I did amazing in JULY. Let’s see what Sept brings! \nI also sell SQQQ as a hedge & have a few 1/2024 TQQQ puts in my other portfolio. \nI was trading in 2020. I know what can happen", "score": 2, "replies": []}]}]}]}, {"body": "Can you please share some more details? I have a similar amount of capital and I am aiming for $1k/month. Looking for entry and exit strategies", "score": 2, "replies": [{"body": "Absolutely! 1k/mo. Would be low risk with that amount of capital. \nI’m currently in COIN, TSLL, MARA, & SOFI. Are you familiar with these? Or i should say, are you comfortable with these?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah crypto in itself is speculative. Everyone has to trade within their comfort zone", "score": 1, "replies": []}]}, {"body": "Yeah, I am fine with those. What sort of strategies do you use? Do you look for a particular delta when you look to sell options? Also how far away are the expirations?", "score": 1, "replies": [{"body": "Can you DM me? I’m leaving this negative subreddit & going to a more positive group", "score": 1, "replies": []}]}]}]}, {"body": "Yep great strategy as long as strike price selection is right.. thats the key 🔑.  And ofcourse stock fundamentals matter.", "score": 2, "replies": [{"body": "Absolutely! & there’s always more to learn. I’m definitely no pro trader, but I found a strategy that’s working for me. So I thought I’d share", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah the 3rd & 4th wk in august were not very nice and historically in September we pull back. So let’s be careful!", "score": 3, "replies": [{"body": "This is good advise. But the challenge is that no one knows if history will repeat. Like in April this year someone told me \"sell in may and run away\" i.e. market usually goes down post May of every year. That hasn't happened until now. So maybe it will, may be it won't.", "score": 1, "replies": [{"body": "I agree. The market is very volatile & any type of trading is risky. I ONLY sell CSPs on tickers I don’t mind owning long term. Just in case. \nI don’t chase high IV, or speculative stocks (like AMC) … this minimizes stress & risk! \nSo far, it’s worked extremely well for me, but I also hedge my account with SQQQ shares & long TQQQ puts. Just in case! :)", "score": 2, "replies": [{"body": "Touche, I too sell CSPs on stuff I don't mind owning. I also keep investments low.", "score": 1, "replies": []}]}]}]}]}, {"body": "Why cash secured puts and not covered calls? Doesn't that require you to have a bunch of cash that's uninvested sitting in the account?", "score": 2, "replies": [{"body": "I do sell covered calls when I get assigned 100 shares", "score": 1, "replies": []}]}, {"body": "I choose high yield stocks to short put", "score": 2, "replies": [{"body": "Nice!", "score": 1, "replies": []}]}, {"body": "The farther out of the money the less delta risk you have. Better plan then selling ATM also you get a better Imp>realized move", "score": 2, "replies": []}, {"body": "It works until it doesn’t", "score": 2, "replies": [{"body": "100%", "score": 1, "replies": []}]}, {"body": "I agree with you, same strategy here. I do look at PE and fundamentals to determine if it is a financially strong stock, allowing me to sell CSPs below the price I would have bought anyway. Been doing it for 6 years now.\n\nCovid drop was the black swan event that will test the wheel strategy, I rmb taking a 80k loss in the crash. The next year, it went back up to a 50k profit. If you have the discipline and funds to back up, it is a safe long term strategy.\n\nIf I had a small \"war chest\" of funds however, I'd advise against going into too much CSP that you can handle, cause it is always great during a bull run, but back swan events where everything is red overnight will kill all your positions, and you need to be ready for it.", "score": 2, "replies": [{"body": "Yeah it’s hard. 2021 killed a lot of my long term investments, with companies that I THOUGHT were good, after doing my TA. We can only do our best & hedge accordingly. The market can tank fast & hard", "score": 2, "replies": []}]}, {"body": "I agree with you if yoy learn the wheel strategy and buy jn a very low entry you be making consistent income and managing risk if a stock ever sold off.. you can sell a cover call below the avg and collecy more premium if you do your homework on resistance and rebuy your collateral and trade again just probably be paying more taxes i havent got to that yet. But alot better than buying and selling a stock. Keep it long enough you dont get tax capital gain on selling your stock too", "score": 2, "replies": [{"body": "Capital gains taxes are going to hurt 😖", "score": 2, "replies": [{"body": "Thats not true.. losing hurts. Lol. Lesrn the tax system. The wealthy pay someone to do taxes for them :) . All i know or heard is this. When you pay enough taxes you can open a business and have that tax deductible. When you pay enough taxes you can buy a property have real cash flowing in. Thats called good debt. Cant make it in america without good credit and learning the tax code", "score": 1, "replies": [{"body": "That’s the truth!!", "score": 2, "replies": []}]}]}]}, {"body": "There are horror stories about put sellers - 1987, 2000, 2008, 2021, with more to come..It all seemed so sweet and easy right up to the sudden bankruptcy you never saw coming", "score": 2, "replies": [{"body": "As with any investing or trading. You’re exactly right!", "score": 1, "replies": [{"body": "Thank you for your positivity. It looks like your enjoy trading… probably shouldn’t post or take advice from this sub. It is all negative kids trying to be traders", "score": 2, "replies": []}]}]}, {"body": "I at least appreciate your commentary.\nNew to Options and started with Put Credit Spreads on a very small account. Mainly been into Dividends, but I've built up enough to learn Options now on another account.\n\nI have came across several articles and such about how good CSP are, utilizing Theta. My thing is getting use to actually doing it and being patient for the long game. \n\nI read you mentioned going 4-6 weeks out and 25 Delta and a high% IV. IV is still something I need to understand better. I've read elsewhere about using 20-30 Delta.\n\nDespite all the slack people are giving, this is exactly the type of posts/comments I was looking for in r/Options.\n\nKeep up the Puts", "score": 2, "replies": [{"body": "That’s awesome! It’s great to learn new ways of trading & keeping an open mind. I’m always willing to learn new ways. What stocks do recommend for dividends? I’ve never focused on that, but would like to. \n\nPersonally, I would say if you were trying to learn CSPs pick a low cost stock, as practice. Of course research the stock. \n\nEveryone trades CSP’s differently. According to your risk tolerance, your portfolio size, how much interest you have in the actual stock/ETF. \nI play some stocks that i actually WANT to own .40 delta & let it ride. \nThen some that I only want to trade, closer to .20 delta. \nHigh IV pays a higher premium, but that is not always a good thing. Never chase high IVs. I’ve been burned doing that when I first started. I have a small list of tickers I trade. If you want ti DM me, I can give you the list, so you can research them yourself.\n\nThank you for your comment. I thought that’s what this sub was for. Unfortunately, I was proven wrong.", "score": 1, "replies": []}]}, {"body": "love it man keep up the good work. Ignore the haters. people don't want you to succeed. I write puts on SPY/QQQ/AAPL/TSLA low deltas low risk setups. I try for 1% per month which includes the 5% i am getting on my cash reserves at fidelity while in the CSP. Only Singles and Doubles here no homerun's those are for the degens at WallStreetBets", "score": 2, "replies": [{"body": "Thank you for your comment! I made a mistake posting here. Lesson learned. \nWe are making our money & that’s what matters. Your set up sounds great!!", "score": 1, "replies": []}, {"body": "5% for sitting in money market? or where do you store the CSP cash? also at fidelity!", "score": 1, "replies": []}]}, {"body": "Trade small. Trade often. Still, follow some mechanics.", "score": 3, "replies": [{"body": "Edited … sorry. $2700 in august", "score": 1, "replies": []}]}, {"body": "In this sub, there's no point in having the guts to make a post. All you get is contrarian replies and negativity from those who have had a bad week.  \nCowards waiting to pounce on your idea or thought. \nGood job, OP. Keep it up.", "score": 2, "replies": [{"body": "I just learned this the hard way lol… thank you :)", "score": 2, "replies": []}]}, {"body": "Don't waste time here. Everyone on this subreddit seem to know everything and only call away your mistakes without knowing you and your strategy besides the clear envy they have. Keep up the good work!", "score": 1, "replies": [{"body": "I’m actually very surprised. On Twitter we all help each other, ask questions & learn from each other. Good & bad… I had no idea this subreddit negative lol", "score": 2, "replies": [{"body": "Can you name me some good twiter pages? I'm trying to learn some more", "score": 1, "replies": [{"body": "My handle is TslaGroupie, look through the people I follow. They are all good! They don’t do call outs or tell you what to buy/sell, they tell u what they are doing & why… it’s great for learning", "score": 1, "replies": []}]}]}, {"body": "This is true. Remind me to NEVER POST HERE", "score": 1, "replies": []}]}, {"body": "im a level 3 trader and was turned down for level 4 selling naked puts and options\n\ncan i do a modified wheel?\n\nhow much more money do you make selling puts? if you cant is the wheel not doable?", "score": 1, "replies": []}, {"body": "So you made $270 in a month? That’s not very good returns. You can a bit more aggressive than that. I’m doing the same with Tesla at the moment. 500 shares, selling covered calls now collecting premiums. It’s not THAT easy as there are stressful days when it shoots up $13 because I’m an idiot and bought at $280 average lol.\n\nBut yeah you’re right, it is one of the more ‘consistent profit’ strategies I’ve seen.", "score": 1, "replies": [{"body": "Edited… sorry. I made $2700.00 last month. $4,600.00 in July", "score": 2, "replies": []}]}, {"body": "whose going to tell him?", "score": 1, "replies": [{"body": "Tell\nWho?", "score": 1, "replies": []}]}, {"body": "I’m doing over $5k per month selling cash-secured puts.", "score": 1, "replies": [{"body": "You mush have more capital than me. I hope I can get there!", "score": 3, "replies": []}]}, {"body": "Lowkey this is perfect way to use option, fuck the 0dte bullshit, that thing is a like lines of coke you can’t get enough lmao.", "score": 1, "replies": [{"body": "Exactly… this is the only way I use options now. Theta is a butt kicker for buyers! I love being the seller", "score": 3, "replies": [{"body": "Wait for it, how about 0DTE SELLING???", "score": 2, "replies": [{"body": "Snorts a line again", "score": 2, "replies": []}, {"body": "Some people will do that with SPY, I don’t have enough capital for that. It’s a good way to make $ daily though, unless there’s some really bad news one day.\nI have bought back contracts, same day if a stock runs up quickly. I always take profits when I see them lol", "score": 2, "replies": [{"body": "Pmcc? Altho I left options now I don’t touch them very tempting lmao", "score": 1, "replies": [{"body": "I used to sell CCs with leaps (PMCC) got burned there too. CSPs are really the best strategy FOR ME", "score": 2, "replies": []}]}, {"body": "Every time I think I will set my boundaries with options, 3-4 days later of making solid 130-180$. \nI go back to trading tesla 0dte on Friday for the week, I just can’t help it man. \nI just don’t even trade options anymore lmao. \nSo many times I told myself no more tesla options I always went back to it, it’s like a fkn drugs and I’m being legit rn, it’s real hard to not trade them. \nAnd those Spx calls that turns from .35 to 7.55 by close when spx moved just before close. \n\nGod damn those are the days.", "score": 1, "replies": [{"body": "Ohhh I get it 100% I’m a TSLA stock addict. I play it every way possible 😂 win $, lose $, whatever… I watch that stock move all day (& night now because it’s a 24hr trade) lol \nI like TSLL, lower cost/higher IV, I invest in TSLY for the dividends… my Twitter handle is TslaGroupie. \nIt’s a real addiction 😅", "score": 1, "replies": []}]}]}]}, {"body": "Ahhh, sweet, sweet seller theta.", "score": 1, "replies": [{"body": "Love me some Theta :p burn baby burn", "score": 1, "replies": []}]}]}]}, {"body": "csp has been one of my better options strategic moves. but yes, know stocks and tracking to know when to hold and when to sell is still important.\n\nanother aspect I have seen lately, which is interesting is csp, but then sell back for partial gains. if I did this a few times I would have saved a bunch of headaches... and it is also partially a tax loss harvest too, I think. \n\nyou get a gain of x but only keep y of x so x-y is now a tax loss. if I'm in error, someone correct me.", "score": 1, "replies": []}, {"body": "Your trading strategy **worked for one month**.\n\nThat is not a long enough track record to be giving people advice.", "score": 1, "replies": [{"body": "I’ve been doing this for 2 years. Made over 20k this year. But I also understand we have been in a bull market & that won’t last forever.", "score": 2, "replies": []}, {"body": "I don’t think he gave any advice here, just saying to look at a strategy 🤔", "score": 1, "replies": []}]}, {"body": "Well, selling Puts always makes sense. The guy who runs the private Discord group I am part of only sells puts and he does very well. He has a unique way but after being in there for some time. I'll have to agree that buying options is no good due to the theta effect. Just my 2 cents.", "score": 1, "replies": [{"body": "Agreed 100% I rarely buy options.", "score": 1, "replies": []}]}, {"body": "I just roll the puts indefinitely even if the option becomes a leap (if it’s a swanny type event). Good stocks always rise back. The only cost is opportunity for tying  up capital but the rolls also increase your ROI assuming we just roll out dates leaving the strike unchanged to take in more premium.", "score": 1, "replies": [{"body": "I was thinking about this! Just roll it out to 2025 & wait Hahahhaa. Thank you!", "score": 1, "replies": []}]}, {"body": "Smart thinking. Be the house. House always wins. You need ridiculous amounts of skill (and luck) to beat the house and basic commonsense to choose to be the house. \n\nYou won't hit many home runs but will steal a lot of bases.", "score": 1, "replies": [{"body": "Exactly… & there are people out there with those skills, but it’s not the majority.", "score": 2, "replies": []}]}, {"body": "Y’all are just mistaking bets for alpha. It’s simultaneously hilarious and depressing.", "score": -1, "replies": [{"body": "*beta", "score": -1, "replies": [{"body": "Sorry, what are you talking about?", "score": 7, "replies": []}]}]}, {"body": "Be careful. Trading naked without any hedge or with too big of size can be detrimental to your account. One bad trade can make you lose the gains of months.", "score": -3, "replies": [{"body": "I’m selling cash secured puts, on stocks I don’t one owning", "score": 5, "replies": []}, {"body": "Cash secured puts are not naked options", "score": 4, "replies": [{"body": "Yes. I only sell cash secured puts", "score": 1, "replies": []}, {"body": "That was not in the description as all it said was “selling puts” which could mean naked or cash secured", "score": -2, "replies": [{"body": "I only sell cash secured puts.", "score": 1, "replies": [{"body": "Repeating yourself here again and again won’t change your original post", "score": -1, "replies": [{"body": "Ok thanks", "score": 1, "replies": []}, {"body": "Success is in selling & trading at your own pace. Please let me see your portfolio. 🤭", "score": 0, "replies": [{"body": "Bot", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Your selling puts on the big boys now?  You are about to get your ass handed to you.  Just my opinion, you do you.", "score": 0, "replies": [{"body": "I guess we will see!", "score": 1, "replies": []}]}, {"body": "\"Ive found the holy grail of trading - just sell CSPs!\"", "score": 0, "replies": [{"body": "For me… it is!", "score": 1, "replies": []}, {"body": "So much less stress", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Well it’s not blindly. I’ve been doing this for years & I do my research first :)", "score": 3, "replies": []}]}, {"body": "If you aren't using a terrible investment strategy, you should be!\n\nNot.\n\nIf you aren't doing something that's got Alpha (and, on average, Wheel doesn't have any) then you probably should be.", "score": 0, "replies": [{"body": "Assuming you know nothing about CSPs, or don’t have the capital to sell them. It’s a no-brainer for options traders. Unless you like to be on the losing end of a trade 70% of the time …", "score": 2, "replies": [{"body": "Considering that the Wheel is a negative Alpha strategy, you 70% will be on the losing end of your trading career if you use it.", "score": 0, "replies": [{"body": "I’m sorry, but you’re very wrong", "score": 1, "replies": [{"body": "If you say so.", "score": 1, "replies": []}]}, {"body": "Just to clarify, you’re saying sellers do not have the advantage in the market?", "score": 1, "replies": [{"body": "Their advantage, if any, is negligible.", "score": 1, "replies": []}]}]}]}, {"body": "Would you mind teaching me the investment strategy that you use? I would love to learn something better than CSPs. Post here, I’m sure there are lots of people that would love to learn it! Thank you!", "score": 1, "replies": [{"body": "Indeed, I have.  I just don't rehash the whole thing every 5 minutes.  It's in my post history.", "score": 0, "replies": []}]}]}, {"body": "\"If you are not gambling, you are missing out\", there i fixed it for you OP", "score": -5, "replies": [{"body": "You think selling cash secured puts is gambling? How?", "score": 7, "replies": [{"body": "Really? It's like betting on a big team, like Real Madrid. Of course it will win against the small ones. Until it doesn't.\nYou are in for a small profit compared to the less probable, but still possible, big loss.", "score": 1, "replies": [{"body": "Hey there, I'm been using Wheel Strategy for 6 years. I can vouch for the strategy as it has been making me 1-1.5% a month on my portfolio. If you feel that this is gambling, then you are not viewing the strategy with the correct mindset. I treat CSP as limit buy (+ premiums) and Covered Call as limit sell (+ premiums). Also, I track all trades diligently and if I were to own a stock, I keep lowering my cost basis of my stock ownership through more CSP, covered calls and dividend. Bottom line for the strategy to work is a good stock.", "score": 6, "replies": [{"body": "Exactly! We are agreeing to pay a certain amount for a stock of it drops to that price. If it doesn’t, we keep a premium. Win-win", "score": 3, "replies": []}, {"body": "I see your point. However i also think you need a huge starting capital to play with csp. Moreover, you say you make 1-1.5% a month, that's 2.5x on your portfolio in 6 years. It's way less that owning a \"good stock\".", "score": 1, "replies": [{"body": "Well, I considered DIS PYPL & TGT good stocks a few years ago. Look where those Would have left me… investing is a different story all together. What type of trading do you prefer?", "score": 3, "replies": []}, {"body": "It's the same for investors isn't it? To own a good stock not on margin, you also need a huge capital. You can always use CSP to enter the stock you don't mind owning", "score": 3, "replies": [{"body": "Not necessarily if you are not playing with 100 shares all the time", "score": 1, "replies": [{"body": "Would you invest in a company with less than 100 shares?", "score": 2, "replies": []}]}]}]}]}, {"body": "Luckily I haven’t taken any big losses with this strategy. Ive been assigned the shares, but I don’t play any stock that I don’t want to own.", "score": 5, "replies": []}, {"body": "I felt like you didn't really answer the question. You said a whole bunch of stuff but nothing that indicated that you were backing up your claim.", "score": -1, "replies": [{"body": "I’ll be more than happy to show my trades, if your interested. I keep track of each & every trade! DM me if you’re interested!", "score": 1, "replies": [{"body": "I answered to the person above me....?", "score": 1, "replies": []}]}, {"body": "You belong here", "score": 0, "replies": [{"body": "?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "$2k a month isn’t pennys to me. I like the extra $", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Oh I got steamed rolled in 2022… don’t you worry lol", "score": 0, "replies": []}]}]}]}, {"body": "Nice job helping people blow up their accounts.", "score": -1, "replies": [{"body": "If they don’t do their own TA, that’s absolutely true. Never follow someone else plays", "score": 2, "replies": [{"body": "And what do you call your post??", "score": 1, "replies": [{"body": "Telling people to check out CSPs. It’s a great way to trade. I’ve had tremendous success with it.", "score": 1, "replies": []}]}]}]}, {"body": "Not really a good salesman!", "score": -1, "replies": [{"body": "Selling what?", "score": 1, "replies": [{"body": "Really ? Bad heggie !", "score": 1, "replies": [{"body": "No clue what your talking about", "score": 1, "replies": []}]}]}]}, {"body": "Congrats on gambling on a fart and winning.  Report back after a year and let us know how things are smelling.", "score": -5, "replies": [{"body": "Still wrong! September was my second most profitable month I’ve had in my 4 years of trading. Looks like you have a lot to learn.", "score": 1, "replies": [{"body": "Pennies in front of a steam roller. Post some screenshots", "score": 0, "replies": [{"body": "If you’d like to see all of my trades, I journal them on Twitter (X) Be my guest! You might actually learn a thing or 2. Sounds like you need it.\nFYI- with the wheel strategy, you make money when the market moves in either direction.\n\n& surly you know to always hedge your portfolio, correct?", "score": 1, "replies": []}]}]}, {"body": "I’ve been selling CSPs for 2 years. Would you mind telling me what strategy you use to trade?", "score": 1, "replies": [{"body": "How's selling those MARA puts going?  Seems like drill o'clock since your genius post", "score": 0, "replies": [{"body": "They are going pretty good. I got assigned some shares, cashed in on the covered calls & my MARA put/hedge today! Thanks for asking :)", "score": 1, "replies": []}, {"body": "I’d love to know how your trading is going as well..?… i also cashed in on my SQQQ position. I make sure to always hedge my portfolio.", "score": 1, "replies": []}]}]}]}, {"body": "Naked puts?", "score": -2, "replies": [{"body": "No. Cash secured", "score": 3, "replies": [{"body": "Sorry , but imo , you are naked in terms of risk. \nSure you will have cash to pay for the stock assignment but in the end this is still naked. \nOnce assigned you have downside to zero. \nNaked. \nI know a few guys who did this before 2008 and were absolutely destroyed during the GFC.", "score": -5, "replies": [{"body": "By this logic, even buying shares of a stock straight up is “naked.”", "score": 3, "replies": [{"body": "As you wish.", "score": -2, "replies": []}]}, {"body": "There are always risks involved with trading. That’s for sure!", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Yeah, then I’ll own a lot of shares 😅", "score": 1, "replies": [{"body": "You have done well so far but I would suggest that you try to limit the majority of your options to companies that are actually profitable. Owning crap companies in a major downturn is a recipe for disaster. You also need to work on your position size, 10 contracts of TSLL is like 30% of your account, try to stick to 5%, maybe 10% max with your account size, in your positions. The wheel does work, but be smart.", "score": 2, "replies": [{"body": "Well this is only my CSP trading account. I play 10+ contracts of TSLL instead of 1 TSLA contract. \nI originally opened it to play 2 TSLA contracts only. (I have other accounts) but that was when TSLA was around 200.\nSo I’ve ventured out a a few others. \nThe amount in this account was originally dedicated to TSLA shares, if I got assigned.", "score": 1, "replies": []}]}]}]}, {"body": "something something picking up pennies in front of a steam roller something", "score": -5, "replies": []}, {"body": "What are the tax implications here?  Seems very inefficient in that regard.", "score": 1, "replies": [{"body": "Im assuming about 20% in taxes, so maybe $450ish. Which still leaves me $2250, for the month. Taking into consideration, you set it and forget it. I still have a job.", "score": 1, "replies": []}, {"body": " opposed to what?", "score": -1, "replies": [{"body": "??", "score": 1, "replies": [{"body": "I was asking 5loko. it's not like you're long term investing so what you're doing isn't qualifying long term capital gains. I'm not trying to prove this person wrong I'm literally just asking what would be better. Yeah my phone autocorrected \"apposed\" when I meant \"opposed\" but whatever. This guy isn't responding so I'm over it lol.", "score": 1, "replies": [{"body": "It depends on your tax bracket, but my capital gains tax will be around 22%", "score": 1, "replies": [{"body": "Wheel an IRA.", "score": 2, "replies": []}, {"body": "That's not too bad. I mean it's straightforward, that's why I'm asking him what he means and what would be better. But you did say \"selling puts\" so I think this person may have thought you meant you're selling naked puts, which is very different than CSP's... But not that different on taxes tbh, a lot more dangerous of a strategy, but not much difference on  how the gains are taxed. I'm really just trying to learn something here maybe he knows something I don't.", "score": 1, "replies": [{"body": "Yeah I should have been more specific. I wrote it up pretty quickly. I’m post again next week with more clarity", "score": 1, "replies": [{"body": "Anyways I think it's awesome you found success with them so far, I did some early on when I started trading options. You probably understand that they can go bad, so just keep that in mind and stay disciplined... Have a plan if you get assigned and it keep dropping etc. Overall though you should be good and congrats.", "score": 2, "replies": [{"body": "Thank you!", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "opposed.... ?", "score": 1, "replies": [{"body": "Yea...", "score": 1, "replies": []}]}]}]}, {"body": "i blew up mine with SPY. dont' trade the SPY. LOLs. Well the spreads are dangerous.", "score": 1, "replies": [{"body": "I have been burned by SPY so many times…. I don’t trade it anymore ever!! Lol were you selling cash secured puts with it?", "score": 1, "replies": [{"body": "yup", "score": 1, "replies": []}]}]}, {"body": "What is your plan when the stock KEEPs falling? After your put is assigned for example?", "score": 1, "replies": [{"body": "I assume he would hold it. No different than if he liked it and bought some on the open market and it falls.\n\nHe might even buy more at the lower price.", "score": 3, "replies": [{"body": "👍🏻", "score": 3, "replies": [{"body": "Nice lol I recently sold a put on a stock. Not to wheel it but because I wanted to own it and collected a few bucks in premium as well.", "score": 1, "replies": [{"body": "Best way to buy a stock you want to own!", "score": 2, "replies": [{"body": "I have a decent size portfolio but still struggling a bit with the 100 shares at a time. It's costly especially with the added 36% of my canadian funds.", "score": 2, "replies": []}, {"body": "I am fairly new to options and yes it has been very useful.", "score": 1, "replies": []}]}]}]}]}, {"body": "Selling covered calls or average down. I guess the same thing i would do in my long term investment portfolio.", "score": 2, "replies": []}]}, {"body": "I agree that it’s a very profitable to sell puts and I do it when I want to short volatility and want to get long exposure which is most of this year. However I would highly recommend getting some put protection and vix calls with all that credit coming in. Also I would have some game plan for rolling and hedging by selling calls instead being a deer in headlights and get assigned without putting up a fight. It’s threads like this that makes me thing a volatility spike is right around the corner and everyone selling naked will get exposed", "score": 1, "replies": [{"body": "I should have clarified, I’m selling CASH SECURED PUTS. & I always hedge my portfolio, mostly with SQQQ.  I will edit now.", "score": 2, "replies": [{"body": "If you are selling using cash secured puts, it is either extremely capital inefficient or you are taking on a lot of delta risk and have to sell closer to the money. Selling a 30 delta put is just as much a long bias as it is a short vol play and at that point, there are better long plays with more reward than selling a put. When I sell puts its like 5-10 delta max. Also hedging with sqqq, though better than nothing, is also very capital inefficient. The amount of spy/qqq delta that you get for the capital you are putting up is very bad. I would consider financing some vix calls or spy/qqq put spreads with other put sells where you can. Right now it is insanely cheap to buy vix calls spreads and closer to the money spy puts with the insane skew out there.", "score": 1, "replies": [{"body": "I usually pick an exp 4-6wks out & pick a lower strike. I should have mentioned that 40k is in my CSP acct. this is NOT my main account & not a high percentage of my personal income. This is for extra fun money.  I’m trying to double this account.", "score": 2, "replies": [{"body": "I don’t understand why you keep saying this is not your main account and it’s just for fun. That’s irrelevant. I think everyone in the comments is bringing up valid points about this strategy and how it can be suboptimal and your rebuttal is “it’s just my fun account” is irrelevant. I would focus more on what can be improved in your strategy or what you are doing to offset the tail risk everyone is talking about. Saying you have 40k of fun money is not a valid way of offsetting tail risk", "score": 3, "replies": [{"body": "I’m not quite sure what you’re asking, this strategy is working for me. I do my TA & I hate my portfolio multiple ways. (SQQQ is the main one) but don’t worry I will delete this post and move back over to Twitter where we promote positivity and helping each other win. \nEveryone has their own way of trading  & can teach each & work together. Looks like this subreddit is more about bashing others strategies", "score": 1, "replies": [{"body": "The reason why the other commenters and I are negative towards your post is because you claim that selling puts with no management and no hedging is a good strategy when it is not. I propose several ways to mitigate the tail risk you have in your strategy and hope that you, and anyone else reading this post, consider them alongside put selling. \n\nI warn everyone against posts that are simple theta strategies that are easy to execute because they are the ones that have the highest losses, take a very long time to demonstrate their true risk and reward and take the longest to recover. I much rather have beginners learn ta and scalp and swing with stop loss than use these simple theta strategies which will essentially lose them money while teaching them nothing.", "score": 1, "replies": []}]}]}]}]}, {"body": "Where did you get the cash from? I'd like to try this strategy but need some cash first I assume", "score": 1, "replies": [{"body": "I work full time & own a business. I’m not a kid trying out the market lol.  The cash in this account is from my job", "score": 1, "replies": []}]}, {"body": "I’m not familiar with CSP, but reading through this thread it sounds like theta is not a component of this type of trade. Is that true? Can someone quickly educate me about CSP?", "score": 1, "replies": [{"body": "Theta is on your side as a seller. Higher IV, means higher premiums as a seller. As a buyer, it will eat you alive. \nDM me, I’ll be happy I explain how it works.", "score": 1, "replies": []}]}]}]}, {"body": "Plus, study what is the greeks, the wheel is a delta positive strategy. You can fuck up with this strategy. In some scenarios the wheel can be the worst thing you could do. Do not do any options strategy without knowing what you are actually betting against.", "score": 1, "replies": [{"body": "I agree 100%. I know the post made it sound easy, but there is a lot to it!", "score": 1, "replies": []}]}, {"body": "If everyone sells puts, who’s buying them?", "score": 1, "replies": [{"body": "I think more people buy them, than sell them. Lol", "score": 1, "replies": []}]}, {"body": "Only in an upmarket x \n\nBetter strategies out rhere", "score": 1, "replies": [{"body": "Would you mind sharing? I love to learn", "score": 2, "replies": []}]}, {"body": "Happy wheeling until gamma strikes your puts… practice risk management aye", "score": 1, "replies": [{"body": "I do. Thank you!", "score": 1, "replies": []}]}, {"body": "As long as you stick to stock you would actually like to own this could work.", "score": 1, "replies": []}, {"body": "Or you could’ve swung ATM calls on $40k on any index or any of the “magnificent 7” stocks in the past 2 weeks and you’d be up 40-50%. Could’ve even morphed them to diagonals and bumped the returns even higher.", "score": 1, "replies": [{"body": "Absolutely… so many ways to trade.", "score": 1, "replies": []}]}, {"body": "I'm really new to this, but wanna ask anyway.... Is buying better???", "score": 1, "replies": [{"body": "It depends if you’re investing or trading. If I get assigned, I would be a buyer of 100 shares", "score": 1, "replies": []}]}, {"body": "You should also check out r/thetagang", "score": 1, "replies": [{"body": "I will. Thank you!", "score": 1, "replies": []}]}, {"body": "I sold AFS puts expires on September 15 I hope the stock will bounce, it has been dropped everyday this week", "score": 1, "replies": [{"body": "Is there a reason you played AFS? High IV?", "score": 1, "replies": []}]}, {"body": "Just take out the profit for from the broker every time, don’t reinvest the profit for next trade, you may loss the whole gain in one trade later", "score": 1, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "Fine, I'll give it a try Tuesday", "score": 1, "replies": []}, {"body": "A strategy I use when selling a put that goes against me. \nFirst, I pick stocks that I consider to have potential to move in both directions, and reasonable earning/ fundamentals- so- I don’t expect downturns to be unremitting. Of course it can still happen. A degree of volatility also ensures that you will have premium to raise when it comes time to sell/roll options\nAnyway, when I’ve sold a put, and the stock moves down and I am threatened with assignment- I roll the puts down and out - usually I can gain 5 or 10 points of breathing room for a few weeks of time. This can usually be repeated if needed, as long as stock is not headed straight down. I have dug my way out of a few holes in this way. Not risk- free obviously, but may be helpful in selected situations\nImportant to think risk scenarios BEFORE you put on the position…", "score": 1, "replies": []}, {"body": "Why does this post read like it's the script for some YouTube furu trying to build his channel?", "score": 1, "replies": [{"body": "Haha definitely not lol.", "score": 1, "replies": []}]}, {"body": "Wheel isn't a strategy in itself it's only one part of many strategies you should be using depend on market conditions of course. You should always be long spy cos strategies like these will underperform simple b+h over a long enough TF.", "score": 1, "replies": []}, {"body": "Sell 25% out of the money", "score": 1, "replies": []}, {"body": "Just buy BTC mining stocks until 2025. No need for all that extra-ness.", "score": 1, "replies": []}, {"body": "Some facts about the wheel strategy:\n\n* All sorts of confusion about which type of investor you are (e.g. if you are doing long term investing,, why  are you foregoing the upside of the stock, if you are doing technicals, why are you risking long term assignment)\n* It is riskier than buying and holding because you are subjecting yourself to the risk of the underlying. Individual stocks tend to have massive drawdowns. No matter how \"safe\" you think the stock you are picking\n* It is the poster boy behavior for unsuccessful strategies: hold on to losers forever and sell winners very quickly\n\nIt's nice that you have made a good return, but I wouldn't go singing the praises of an inefficient trading strategy without that information. Unfortunately this work until it doesn't", "score": 1, "replies": [{"body": "After seeing DIS TGT BUD & numerous bank stocks, there’s actually no “safe” stock.", "score": 1, "replies": []}, {"body": "I agree, ANY TYPE of trading in the stock market is risky. Period. No such thing as a fool proof strategy, or else we would all be millionaires. It all works, til it doesn’t", "score": 1, "replies": [{"body": "this is conflating things. There are no such thing as fool proof strategies, **however** there are clearly inferior strategies when looking at the risk / return adjusted distributions. The wheel lies under that umbrella, for just the reason outlined above. Here is a [video](https://www.youtube.com/watch?v=ekqgjT_-ggc&ab_channel=OptionsGeek) for you if you are interested.\n\nGlad that it has worked for you for now. If I were you I would move towards something more sensible. \n\nGood luck", "score": 2, "replies": []}]}]}, {"body": "great marketing. This kind of post is what it takes to attract more newbs into the game.", "score": 1, "replies": [{"body": "Thank you.. so many traders gave up in the 2021 disaster, they are trying to come back now. Different strategies are key to success", "score": 1, "replies": []}]}, {"body": "I'm also doing the same.  Only selling csp in stocks I wouldn't mind owning.  If I get assigned I'd sell my other stocks I'd want to sell, and sell cc on the stock I'd get assigned.  If assigned I'd sell ccs as well.  I'd sell csp if I believe the stock was toward its bottom, ie PayPal and dis (made a bunch when pltr was in 8-10 range)  I sell long dated ccs on many stocks, always far otm.  Hey, if I make 100% gain in a year on a stock and collect premium I'm happy, can't be too greedy).  I only sell options or puts, cause I like the time decay effect.  So far in 2 year I've never been assigned.  If one my trades gets 10% or less to getting assigned,  I usually roll farther out.  I could always manage or close the option completely if I feel the fundamentals of the company have changed or a new strategy arises.", "score": 1, "replies": [{"body": "Sounds like you know what you’re doing! I love hearing about successful traders.", "score": 1, "replies": []}]}, {"body": "How do make anything selling options with the VIX at 13? Sell them ATM instead of OTM?", "score": 1, "replies": [{"body": "I personally go 4-6 wks out with my exp, to be able choose a lower strike. Delta under .30 & I play it 2 ways. If the stock runs up, I close the CSP & take profits. \nIf it drops drastically (like TSLL did on Friday, I sell another contract, same strike/exp to ave down) \nI’m 100% ok with getting assigned TSLL shares. That’s important to know.\nIF we were to have a black swan event/ market crash, I would probably (depending on the situation), roll them way out & collect more premium, & ride it out.\nI also hedge with SQQQ.", "score": 3, "replies": [{"body": "But you’re still only getting 1-2% of the stock price/contract, right? In other words, you’re tying up $3000 of capital for 1-2 mo. to make $30-60? Just seems kinda “meh” to me, unless you have a $1 million+ trading account so you can sell a lot of contracts.", "score": 1, "replies": [{"body": "With 3k I would usually make around $150 with 2 TSLL contracts. I do this with approx 40k…", "score": 1, "replies": [{"body": "I didn’t realize you were selling puts on a leveraged Tesla ETF with very little trading history. Do you understand the risk inherent in leveraged ETFs, e.g that over time they tend to lose NAV that’s never fully recovered due to contract roll decay? It means if you’re assigned on OTM contracts it will be much harder to get back to BE than if you just owned TSLA shares.", "score": 2, "replies": []}]}, {"body": "Right now I have 7k in a COIN CSP opened it last wk, 10/6 expiration, collected $275 premium. I probably will not hold til expiration though. (Delta .25 IV was 70% at the time)", "score": 1, "replies": []}]}]}]}, {"body": "\"$2,700 for the month\"\n\nCongrats - making your stocks work for you!\n\n&#x200B;\n\nESP", "score": 1, "replies": [{"body": "Thank you! Yes, this strategy is working very well for me. So I thought I’d share. Instead I got a bunch of hate. Oh well… I enjoy trading!", "score": 1, "replies": []}]}, {"body": "That’s a good month look like you understand risk and risk management if u had my 4000000 would of caused a course of concern", "score": 1, "replies": [{"body": "I see people using that kind of capital … it’s so scary!!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Holy crap… good job!", "score": 2, "replies": []}]}, {"body": "Hahaha, UNTIL", "score": 1, "replies": []}, {"body": "Dude, you’re not a genius. The trend of the market and big cap tech was up.  If we get a 10% correction and you get assigned a bunch of stocks at a price above where they trade by the end of that month your unrealized losses will wipe out your gains and then some. QQQ is trading at a forward PE of over 27. That’s an earnings yield less than 4%. My vanguard MMF yields 5.5%. This can’t continue. The market and QQQ is due for a correction.", "score": 1, "replies": []}]}
{"title": "Opinion on AMD vs Intel?", "selftext": "What's the overall thoughts on AMD and Intel?\n\nAbout 2 years ago, it almost felt like Intel was just a blast from the past, AMD will finally be the next leader in the CPU market, at least thats what the stock prices looked like.\n\nBut then, Intels performance throughout this year has been a slow, but steady gain, while AMD has been well below its ATH.\n\nWhat will the future bring? Intel has just recently confirmed its ramp in production capacity, while AMD as a fabless company is strongly dependent on foundries like TSMC, who, howerer, have already confirmed to prioritize apple, nvidia and then also intel with their 3nm node. Will AMD manage a way back to its former value, especially since the whole industry seems to be full of turbulences and uncertainty? Despite the overall damp in the consumer market, iIs intel still undervalued?", "id": "1698req", "created_utc": 1693776159.0, "score": 89, "upvote_ratio": 0.84, "num_comments": 182, "comments": [{"body": "Intel has been deemed a matter of national security by the current administration.", "score": 117, "replies": [{"body": "And select customers will still be paying a certain premium to get US manufactured chips. Reminder that silicon used to be made in the US but moved away because it wasn't cost competitive with Asia.", "score": 30, "replies": [{"body": "Is this true? Where’s your evidence? I was under the impression TSMC / Taiwan took over to their superior technology, I.e EUV and their ability to create smaller nodes w higher yields.\n\nPlease show me evidence that the reason they moved was labor cost, or something else the US cannot compete with.", "score": -1, "replies": [{"body": "I wouldn't say it is simply labor costs. TSMC is 100% in the foundry business and is one of the most effective wafer manufacturers in terms of costs, yield stability and customer line item performance. There isn''t really any US company that can compete with that - which was basically the motivation for the CHIPS act.", "score": 6, "replies": [{"body": "Totally agree. TSMC simply got ahead and is the best in the game. But I think the commenter I was replying to was basically insinuating there was some structural advantage of outsourcing semiconductor fabs - I.e labor, land, taxes, work ethic etc. that would imply that chips will remain cheaper outside of the US.\n\nIf it is just a technological moat, there is no reason to think that Intel and US fabs won’t catch up with an influx of cash.", "score": 2, "replies": [{"body": "Agree. But it's gonna take decades to catch up.", "score": 1, "replies": [{"body": "Decades is pretty extreme. It really depends on how much improvement TSMC can continue to make. If they stagnate like Intel did in the 2000s, Intel will easily catch up in the next 5-10 years. If they continue to successfully reinvest money into growth and improvement, it will take a loong time for Intel to catch up", "score": 1, "replies": []}, {"body": "Doubt decades, but also doubt intels gonna see you any huge gains like nvda.", "score": 1, "replies": []}]}]}]}, {"body": "TSMC becoming the world largest and most capable chipmaker doesn't happen overnight.\n\nit all start with cost", "score": 2, "replies": [{"body": "Of course, a cost that the CHIPS act is trying to compete with. And Intel was the worlds largest and most capable chipmaker for a long time, all it took was some setbacks and complacency to put them behind. Who’s to say that there is some inherent disadvantage the US has in silicon manufacturing?", "score": 1, "replies": []}]}]}]}, {"body": "Well that should be enough for you to be able to invest in it.", "score": 6, "replies": []}, {"body": "Bullish", "score": 3, "replies": [{"body": "If that's not bullish then I don't know what would really be.", "score": 3, "replies": []}]}, {"body": "Wtf is this chip nationalism 😂", "score": 3, "replies": [{"body": "Best not rely on foreign dependence in case they turn the taps off. It's why Taiwan is very hot at the moment.", "score": 23, "replies": []}]}]}, {"body": "About being fabless, Nvidia is also fabless and they are the 6th largest company in the world. Apple is the largest company and both of them rely on TSMC which is the 12th largest.\n\nThis is fine, with the margins Nvidia has the cost of manufacturing is minor. Their focus should be spent working on their technological advantage, which is what is allowing them to maintain those high margins.\n\nFabless means you can shop around and use whoever has the best silicon, which pushes your products further ahead. Having your own fabs can cut down on costs, but I don't think that's what neither Nvidia, Apple, AMD needs to do right now.", "score": 44, "replies": [{"body": "People mistake supply chain with quality. \n\nIt's like saying farming and oil are the best investments, because without food, people die. Or without energy the entire world shuts down. \n\nPeople say INTC is great because it's a matter of national security.\n\nIt's fact that food and energy production are the most important to national security because everything shuts down without it.\n\nBut they are the worst investments. Food and energy are commodities, there is no pricing power. \n\nThe largest food companies don't make money selling food, they make money marketing - getting the entire world to buy sugar water the costs nothing to produce.", "score": 27, "replies": [{"body": "People need to understand all this, and make better decisions on the basis of that.", "score": 7, "replies": []}, {"body": "The point of Intel fabs is to compete with TSMC though. Not to create commodity chips. If they are going to be capable of it, is a different story though.", "score": 3, "replies": []}]}, {"body": "I doubt Apple will ever run its own Fab or assembly. They much rather mitigate the risk of high volume investments required to ramp up production to their subcons.", "score": 3, "replies": [{"body": "I doubt anyone else (outside Intel, Samsung and TSMC) will run a leading logic fab, the fabless model has been well-proven for so long now and the scale needed to compete goes up and up every year.", "score": 4, "replies": []}]}, {"body": "Having your own fabs can potentially cut costs if you have the scale, but it also splits the focus of the company between design R&D and fab R&D. \nTSMC focuses exclusively on fab, nvidia/amd exclusively on design, Intel tries to do both fab and chip design\nI don’t see intels business model being competitive against companies that have more exclusive focus… not to say they’re going out of business but I think they’ll be a middle of the road player versus a best in class.", "score": 3, "replies": []}, {"body": "TSMC is absolutely huge, everyone depends on them at this point.", "score": 2, "replies": []}]}, {"body": "Intel is looking to become one of the leaders in semiconductor manufacturing and have government funding behind them.", "score": 62, "replies": [{"body": "Well it Can't be more bullish than that, it's just huge for the investment.", "score": 3, "replies": []}, {"body": "Intel was the leader and is still one of the leaders", "score": 18, "replies": [{"body": "Went from solid #1 to perhaps #3 in the span of about 5 years, has deteriorating margins, and plans to retake the leadership from a larger manufacturing rival in possibly the most capital intensive industry that has ever existed, all during a wave of rapidly increased cost of capital.\n\nBut they have a plan.", "score": 75, "replies": [{"body": "They used to be really good at moving to new process nodes, they have some room to run. Didn’t they finally get their 10nm chips into mass production after being stuck on 14nm+++++ for years? 7nm should be coming this year. Unless they get stuck in hell again.", "score": 6, "replies": [{"body": "Imho they have some pervasive management culture problems that really started to manifest in execution during the mid 2010s. Also some of the cost-cutting that ejected senior technical personnel that they \"didn't need\" according to some stupid spreadsheet. I think Gelsinger has identified this and is driving for more accountability but it's a big challenge.", "score": 2, "replies": []}]}, {"body": "This is why they want / need the govt backing  (former INTC bag-holder for a feckin decade Before giving up)", "score": 3, "replies": [{"body": "Gov is a nice backstop for them. They won't be allowed to go out of operation or go under foreign control. Could they go bankrupt in the process? Maybe, if the plan fails miserably.", "score": 3, "replies": []}]}, {"body": "Well atleast they're trying for it. That's better than nothing.", "score": 3, "replies": [{"body": "It's not a bad plan at all, but it's devilishly hard to pull off.", "score": 1, "replies": []}]}, {"body": "> #1 to perhaps #3\n\nTSMC, Samsung, and then Intel?", "score": 1, "replies": [{"body": "Pretty sure he said \"perhaps\" number 3 because of the contention between Samsung and Intel being number 2. No other fab really comes close to Intel, Samsung, and TSMC, and the gap between these 3 fabs aren't really that far regardless.", "score": 10, "replies": [{"body": "Intel is not a fab yet", "score": -6, "replies": [{"body": "What do you mean? Intel's been making microprocessors for 50 years.", "score": 8, "replies": [{"body": "But mainly for Intel.\nTSMC and Samsung prosuce chips for other companies.\n\nIntel has yet to prove they are capable of doing so at scale too", "score": -5, "replies": [{"body": "That doesn't mean they aren't a fabricator", "score": 3, "replies": [{"body": "You are right. They do have fabs but they are not a foundry", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "In a market with 3 players, any playet is the leader lol", "score": 19, "replies": [{"body": "Looking to be #1", "score": -4, "replies": [{"body": "They’ll be lucky to stay as high as they are dude\n\nTheir entire product lineup is trash and no enterprise customer is lining up to desperately buy their products over amd or nvdas offering", "score": -10, "replies": [{"body": "People who have done no research will wonder why they’re still poor 🤡", "score": -11, "replies": [{"body": "Intel can’t fab worth a damn. No one wants an intel manufactured chip over TSMC", "score": -6, "replies": [{"body": "the point of the threat was saying that the US government won’t let intel go down. it isn’t the worst investment for this reason. I also invest in microsoft for the same reason. the us government runs of this shit, they ain’t letting it go anywhere.", "score": 0, "replies": [{"body": "I know intel is too big to fail. That doesn’t mean a god damn thing\n\nPeople want to invest in companies that show proven growth and quality . Boeing is too big to fail as well so is GE and Wells Fargo , ford GM etc etc but they are uninvestible because they are trash and poorly ran and you won’t make much money if any by holding their stock \n\nI don’t care about them being safe from going bankrupt lol. I care about their stock appreciation. If it can’t beat the sp500 in gains? It’s trash", "score": 1, "replies": [{"body": "i’ll agree with you, but i’m pretty sure the only company that has consistently beat the s&p is berkshire. if there are others please lemme know. i know a lot of big tech hitters have been crushing it but i’m talking about consistent growth", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yeah and it'll still remain that way, it's not going to change", "score": 3, "replies": []}]}]}, {"body": "I'm 60(Intel)-40(AMD). I had it other way round until recent funding made it clear that USA wouldn't let Intel not perform. It ain't just business, it is national security (better design, better chips, fabs)", "score": 28, "replies": []}, {"body": "If We're talking about the investment potential then I'm going with intel.", "score": 7, "replies": []}, {"body": "Personally, I think Intel is preposterously cheap. I've been buying since $24.", "score": 58, "replies": [{"body": "Cheap for a reason", "score": 42, "replies": [{"body": "It’s a constant game of up and down. Agreeing with others here that Intel has too much government backing. With Gelsinger, I believe he’ll help push the company towards higher profitability. \n\nI mean, look at Intels market cap vs NVDA.\n\n5-10, even 20 years while getting dividends. I don’t see how this wouldn’t hit half the market cap in the next 20 years. Seems like a no brained to buy when low", "score": 8, "replies": [{"body": "AMD eating more and more of its lunch every year too.", "score": 11, "replies": []}]}, {"body": "i think they’ll top out around $55. that’s the absolute max tho imo", "score": -1, "replies": [{"body": "Yeah but when. If $55 in 10-15 years from now I’d rather park my money elsewhere for a while.", "score": 2, "replies": []}]}]}, {"body": "19 USD now.", "score": 1, "replies": []}]}, {"body": "AMD. Very low room for growth on Intel. Won’t be surprised if the stock price goes even lower.", "score": 42, "replies": [{"body": "1) you clearly don't understand the semi business at all. 2) \"won't be surprised if the stock price goes lower\".. holy shit, we have a genius here. Stocks can go down?", "score": 7, "replies": [{"body": "Well bro, a year on, AMD is up \\~30%. Intel tanked.", "score": 3, "replies": [{"body": "And in a year which stock will be higher? Investing isnt a one year game\nIntel has had quite a rough time though", "score": 1, "replies": []}]}, {"body": "100% agreed", "score": 1, "replies": []}]}, {"body": ">Very low room for growth on Intel.\n\nTheir plan is to transition to sell wafers to other designers, which is a pretty huge market. I don't see how that is \"very low room for growth\". The feasibility of that plan is a different matter though.", "score": 9, "replies": [{"body": "Because thier node is underwhelming compared to Samsung and TSMC. AMD sold their wafer manufacturing facilities for a reason.", "score": 4, "replies": [{"body": "Lmao, I wouldn't bring up Samsung. Samsung is nearly as much of a meme as Intel is for yields and deadlines. \n\nTSMC is valid, but even Intel's 'non leadership' nodes aren't bad in comparison to TSMC. Intel 20A is esentially a nerfed TSMC 3nm with all the DTCO goodies of BSPD and GAAEFET. TSMC isn't getting GAAFET until 2nm, and not getting BSPD until N2P. You obviously don't *need* those two extra features for a node to be good, but they add extra layers of flexibility that separates them from TSMC as a node and gives another reason for customers to warm up for Intel 20A/Intel 18A. \n\nIntel 4 is impressive for what it is, density wise. TSMC 3nm level HP cell density. I'm guessing perf/watt isn't up to par to call it a \"3nm\" class node though, it lacks HD cells, and SRAM density is horrendous. Intel 3 looks to be fine though, albeit still worse than TSMC 3nm. It's going to have to be priced worse than TSMC 3nm, but tbh even if Intel 3 was *better* than TSMC 3nm, they would still be forced to price those wafers low since they are unproven, etc etc.", "score": 12, "replies": [{"body": "Samsung ain't doing that in terms of chips, but other than that they're good.", "score": 3, "replies": []}, {"body": "Didn’t Intel score Qualcomm and Micron already for semiconductor manufacturing ?", "score": 2, "replies": [{"body": "Don't know about Micron, but Qcom info is very conflicting. \n\nIntel claims Qcom is a ramp-c customers, which makes it seem like Qcom would be tapping Intel for chips, but recent rumors surfaced about Qcom dropping Intel 20A due to expense in designing chips.\n\nOther than that, they also have amazon for packaging, ericsson for Intel 18A, some military contracts and the ramp-c program.", "score": 4, "replies": []}]}, {"body": "You bring up all these intel nodes and yet they are still on 10 nm right now. Watch this become the +++ bs they did with 14nm", "score": 1, "replies": [{"body": "Intel 4 with Meteor Lake is launching this quarter according to Intel, and very likely to be announced in like 2 weeks at the Intel Innovation event on the 19-20.", "score": 1, "replies": []}]}]}, {"body": "That's not a good sign if you're asking me about it so yeah.", "score": 3, "replies": []}]}, {"body": "Amd can have growth, but I feel that the Intel is going to get Higher.", "score": 1, "replies": []}]}, {"body": "Always bullish on the Intel, that's how it is for me here man.", "score": 2, "replies": []}, {"body": "That's nonsense", "score": 1, "replies": [{"body": "INTC is down 43% since my comment, make of that as you will", "score": 2, "replies": [{"body": "Yes but now it shall go to the moon", "score": 1, "replies": [{"body": "Down 4% since your comment, we’ll see in the future maybe :)", "score": 1, "replies": [{"body": "I took a loan to buy more", "score": 1, "replies": [{"body": "Smart choice", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Intel is looking to become something completely different from AMD. \nWith IDM 2.0, Intel is looking to become a foundry business and compete with TSMC mainly by manufacturing chips, instead of being a GPU/CPU/Product focused business like AMD or Nvidia. With this strategy, Intel gets BILLIONS from the US CHIPS act while AMD gets basically nothing.\nThose who say Intel has no room to grow maybe underestimating the market that could be taken from TSMC, given the political risks with manufacturing in Taiwan.\n\nTLDR: I am an intel simp", "score": 16, "replies": [{"body": "Tsmc is also building in the US as well as other countries.", "score": 4, "replies": [{"body": "Yeah sounds like that they're going to make it good here.", "score": 6, "replies": []}]}, {"body": "Intel already had billions and they did nothing with it for 20 years", "score": 3, "replies": [{"body": "And now they're doing something completely different and have a new CEO with a compelling vision to make chips for companies like NVIDIA and even AMD and other traditional competitors. \n\nIntel previously dropped the bag by hiring a non-engineer MBA doofus as CEO, who only saw numbers and missed the opportunity to adopt technologies like EUV. But with Pat as CEO I would like to think there's a future for Intel.", "score": 1, "replies": []}]}, {"body": "Intel 1 trillion market cap ![gif](emote|free_emotes_pack|laughing)", "score": 1, "replies": [{"body": "I would cum so hard if that happened.", "score": 0, "replies": []}, {"body": "Well that's going to happen, it's a matter of time at this point.", "score": 0, "replies": []}]}]}, {"body": "AMD hands down, they are gaining market share from Intel and their products are years ahead. Lisa vs Pat is also unfair comparison.", "score": 3, "replies": []}, {"body": "Normally I don't like to overlap.  I'll try to identify best of breed and make that a large position.  But I currently have AMD and INTC and NVDA.  \n\nThe reason is they offer different risk/reward propositions and different (perceived) times scales and values.  \n\nI would have sold AMD at my $130 PT but missed, so I've been marking time with it.  The thesis is that if they make some well received announcements in the coming months, my PT might be attainable.  \n\nINTC is for value, with more of a time-based exit around foundry and domestic chip production that's one or more years out.  \n\nNVDA is for the shortest term, when it dipped to $425 in the quiet period before an anticipated earnings report.  My sense from extrapolating comments from company officials made just before the quiet period was that their business was so overwhelmingly strong that any or all hiccups with China would be meaningless.  I then averaged up between $425 and $450 and had an exit PT of $525.  I think $5252 was hit, but not during regular session, so ended up holding it.  I'll give it a 10% down stop from here so it won't hurt me.  If it does hit my PT really quickly, I'll be out.  I'm aware I might be selling stuff $525 on an escalator ride to $750, but my method is to harvest 20-25% rapid gains whenever possible.  It's a get rich slow method but it works.  \n\nAnd if the day comes soon that it blasts through $525, I'll of course consider the present facts of why and how, and whether I want to consider altering my exit plan.\n\nSo basically NVDA for quick trade or exceeding even high expectations and feverish sentiment (scale = weeks) AMD on upcoming product announcement and continued solid business (scale = months) and INTC on long term reformation and infrastructure/chips act (scale = years)", "score": 10, "replies": [{"body": "In this case you might want to consider selling covered calls on NVDA since you already know your selling point, might as well make some money off it\n\n...Assuming you have 100 shares now that I typed it out lol", "score": 1, "replies": []}]}, {"body": "I have been invested in INTC and AMD at various times in the past 5 years.  I am currently only invested in the former.  My thesis is less that INTC is undervalued (we will know within 6 months and Intel 3’s ramp becomes more clear) but AMD is overvalued.  They appear to be missing the AI bubble and TSMC is prioritizing others for their most advanced processes, which lets INTC catch up more easily in the datacenter (they already caught up on Client)", "score": 5, "replies": [{"body": ">we will know within 6 months and Intel 3’s ramp becomes more clear\n\nI mean Intel 4 is a good yard stick as well, since Intel 3 is esentially a slightly buffed Intel 4, but Intel 3 ramp won't become something regular people can analyze really until after both Sierra Forest and Granite Rapids launch- and then have volume numbers reported by Intel or articles released by other 'industry insider' analysts. Otherwise, we just have to take Intel's word for it. \n\n>They appear to be missing the AI bubble\n\nI mean compared to Nvidia, sure. But compared to Intel? I mean they have Gaudi ig... \n\n>and TSMC is prioritizing others for their most advanced processes\n\nI don't think that's as much as TSMC not prioritizing AMD as much as AMD not wanting to use TSMC's cutting edge process. AMD typically doesn't use TSMC's latest node, for a couple reasons really. Cost, node maturity, volume, just to name a few. Yet AMD is still using N3 for Zen 5 (likely Zen 5-C based DC products), and these are probably launching around the same time as Intel's TSMC 3nm based Arrow Lake CPUs. \n\n>which lets INTC catch up more easily in the datacenter (they already caught up on Client)\n\nDefinitely. And Intel has actually been slowly climbing back starting with ICL really in terms of how competitive they are. I still expect GNR to be worse than Turin, but it looks like it would close the gap even more than say, SPR vs Genoa. However it's important to remember that node isn't everything- core design heavily matters as well. And I don't think AMD is losing in that department vs Intel either.", "score": 5, "replies": []}]}, {"body": "I'm not a fan of intel. Their GPUs suck. Their CPUs suck. They are quickly losing market share to AMD. They are losing money\n\n\nI can't see the upside", "score": 20, "replies": [{"body": "Their GPU is, as far as I remember their first GPU - nobody makes a market leader as their first product.\nWith recent updates to the firmware, the performance per the price, makes it a well recommended GPU.\n\nRegarding their CPU's sucking - they might not be number one on all parameters, but that is not the same as them sucking.\n\nAnd on AI they outperform AMD by a lot, which is where the big money is currently.", "score": 13, "replies": [{"body": "How and where do they outperform AMD on AI?", "score": 2, "replies": [{"body": "Source: trust me bro", "score": 2, "replies": []}, {"body": "I am pretty sure it was in tests done by Linus Tech tips, or one of the other bigger tech news.\n\nIf you want me to, I can see if I can find the video of it", "score": -1, "replies": [{"body": "I would be interested. As far as I know AMD is the only competition in the horizon for NVIDIA especially with improving open source software and Mi300 incoming", "score": 2, "replies": [{"body": "On the GPU side, Intel has nothing AI ready - but according to themselves, they have on the CPU side\nhttps://www.storagereview.com/news/intel-habana-gaudi2-accelerators-offer-nvidia-alternative-for-large-language-models\n\nRegarding the benchmark video, to be honest I can't seem to find it.\n\nIt was made by someone reputable, and it basically said that Intel was behind in every category, except for some AI benchmark.\n\nAlso, for the past few years Intel was still king of single core performance - not sure if that is still the case.", "score": 1, "replies": [{"body": "But the AI market is not in the CPU space so I think you can not call this a win really.\n\nAlso each generation AMD and Intel trade blows and they dont release at the same time so might have been intels latest against old AMD.", "score": 1, "replies": []}]}]}]}]}, {"body": "Doesn't have to be a market leader however it serverly underperformed internal goals which is more concerning.", "score": -5, "replies": [{"body": "I don't know the internal goals for it, so can't comment on that", "score": 2, "replies": []}]}]}, {"body": "The upside is they turn their company around and make competitive products again, and/or taste a fraction of the AI market that Nvidia has captured. Jensen Wang has already praised Intel’s foundry chips, which won’t be made in Taiwan and don’t carry any of the risk associated with that.\n\nSo if you believe any of those things, the stock is insanely cheap. Of course none of these things could materialize, but when they do it will be too late for stock buyers.", "score": 5, "replies": [{"body": "Jensen definitely wants Intel to survive, and Samsung. TSMC will have Nvidia over a barrel if they don't have viable competition.", "score": 16, "replies": [{"body": "You would assume the same logic would apply for Qcomm, but they haven't been *nearly* as warm to the press as Nvidia has been about Intel, and I'm not just talking about those 'leaked' reports of Qcom ditching Intel's nodes.", "score": 1, "replies": []}]}]}, {"body": "Aren’t their CPUs per core still like 50% better then AMDs?", "score": -6, "replies": [{"body": "More like similar in performance, higher in power consumption, and more critically, using about 2x the silicon area. New products might close that gap but for the near future they are buying silicon from their largest foundry competitor, TSM", "score": 15, "replies": [{"body": ">and more critically, using about 2x the silicon area\n\nA portion of that area is from specialized core extensions such as AMX, or being able to use AVX-512, and larger caches (which is pretty important for server workloads, where cache latency is often trumped by cache capacity).\n\nEdit: sorry I should be clear, this is iso node, when AMD has a node advantage, obv they are way ahead in area. GNR should be \\~iso node vs Turin and Genoa though. In the comment above, I was specifically talking about SPR vs Milan, which are iso node. Genoa has AVX-512, though SPR still has larger core private caches and AMX. \n\n>New products might close that gap but for the near future they are buying silicon from their largest foundry competitor, TSM\n\nNot for their flagship DC products, Granite Rapids and Sierra Forest. These products are those that should be getting the highest margins as well.\n\nClearwater Forest continues that trend with using Intel 18A.\n\nThe products that use TSMC are GPUs/GPU tiles, LNL and the CPU tiles for ARL, and related SOC tiles for client. However, they are also fabbing client products using their own nodes as well, Intel has reiterated the existence of 20A ARL tiles numerous times so far. It's likely to be pretty low volume and/or limited to one die as Intel 20A is likely to be a pretty low volume node, especially at the time ARL launches.", "score": 4, "replies": [{"body": "AMD supports AVX-512 on zen 4 consumer and DC chips.", "score": 2, "replies": [{"body": "Yes, my edit 10 hours ago mentions that:\n\n>Genoa has AVX-512, though SPR still has larger core private caches and AMX.", "score": 2, "replies": []}]}]}, {"body": "Intel largely manufactures their own chips, and they’ve done so for many years. This also means that they have to develop their own manufacturing processes, which can sometimes be behind in terms of transistor density. This is actually advantageous though since they don’t have to rely on TSMC (and by extension, Taiwan’s sovereignty) for wafer supply like everybody else.\n\nIf I had to guess, Intel’s large local manufacturing chain is probably why the current administration has deemed them as a critical business.", "score": 5, "replies": [{"body": "In-house manufacturing is a double-edged sword. When it works well, profits are great and supply is predictable.\n\nOf all of the dozens of businesses using this model with leading edge products, only two survived until today. Many more have been pulled into bankruptcy by expensive, underperforming fabs.", "score": 5, "replies": []}]}]}, {"body": "50% more expensive and with barely any real performance upside? Yeah", "score": 3, "replies": [{"body": ">50% more expensive and with barely any real performance upside? Yeah\n\nIronically, in many cases Intel is cheaper than AMD for low budget client users. In DIY, Intel is extremely competitively priced, and have been starting with Alder Lake (for the entire stack). \n\nAs for servers, Intel has been slicing prices (and as you could see in their financial reports, margins) in order to keep on pushing out sales for their server CPUs. When Pat talked about stemming the bleed of CPU marketshare in the DC market, it's not because SPR was competitive with Genoa, it's because they priced SPR insanely low compared to what it cost to make. \n\nAs for the 'real performance upside', Intel has a better argument there than with client through the use of specialized core extensions (AVX-512, AMX) as well as HBM. They won't win in generalized performance though against Genoa, or hell, even against Milan in many cases.", "score": 4, "replies": []}]}, {"body": "Through a combination of clocks and IPC, Intel CPU's per core performance is generally 10-20% stronger than AMD's in single core. Nvidia actually cited strong single core performance as the reason they are pairing Sapphire Rapids with H100 in their DGX H100 systems. \n\nAMD has made a very strong effort in regaining ST perf leadership though, and with Zen 5 Turin, it's *extremely* likely they win back the ST crown against Granite Rapids throughout 2024. \n\nHowever, Intel also uses a disproportionate amount of power per core, and is drastically less efficient than AMD in both single core and more importantly for DC, multicore workloads. This is due to a combination of worse core architecture and using a worse node.", "score": 1, "replies": []}]}]}, {"body": "AMD has better potential has a business, but terrible short-medium future as a stock. Just like nvidia \"investors\", people will realise what it means to overpay for something.   \n   \nINTC potential is mitigated and people's opinion diverge immensely. The CEO has its good and its bad too, he is someone who doesn't mind sacrificing next earnings report to bring better returns later, which is what every company should crave for. On another hand, he is not very honest in his guidances, in his communication to investors and there has been quite a few notable \"accounting creativity\" (misleading numbers) in the past year.  \n   \nI think the semi-conductors industry will grow significantly in the next 10years. I personnally wait the inevitable fall off the cliff from Nvidia (hitting to some extents all the other players in the industry) then i'll shoot big on $SOXX instead of guessing who will come on top.", "score": 2, "replies": []}, {"body": "I was rooting for Intel but it feels like they are following the steps of Kodak or IBM. Too big, lack innovation, vision less management. Competition keeps chipping away at there market and they are behind the curve. For sure, if they can pull it together there is upside, but history has shown companies like this have a slow death. I'm already in it and I'll hold, but I'm not gonna double down.", "score": 6, "replies": [{"body": "Lack innovation?  Visionless management?  The CEO and the fab folks have quite a bit of vision, and the company is poised to deliver innovations like GAAFETs and backside power delivery before TSMC.  Most of the division heads are chuckleheads though (I’ll call out Sandra Rivera as being the worst).  The current trends in market share are due to decisions made 5+ years ago.\n\nThe one thing that concerns me, as an ex-employee, is how few of my acquaintances are still left.  There has been a massive churn in people with 5-10 years of experience, who are usually key rank and file engineers", "score": 12, "replies": [{"body": ">The one thing that concerns me, as an ex-employee, is how few of my acquaintances are still left.  There has been a massive churn in people with 5-10 years of experience, who are usually key rank and file engineers\n\nYe, there have been reports of rounds of layoffs over layoffs at Intel.", "score": 2, "replies": []}, {"body": "When I said vision less management I meant top execs just pushing what already makes money. I'm not in the industry but a quick search shows GAAFETs was first demonstrated in 1988 by Toshiba. My point is they aren't looking beyond their core products(CPUs).", "score": -1, "replies": []}]}, {"body": ">lack innovation \n\nIronically, most of the problems Intel has self inflicted on itself is due to them being too ambitious and trying to be too innovative.", "score": 7, "replies": [{"body": "Yep, they're always trying. And that's a good thing I think.", "score": 2, "replies": [{"body": "I mean, always trying but never executing isn't a good thing since they are wasting millions of dollars and likely thousands of hours in man power designing, validating, and debugging over and over again for a product that is at best, *competitive* with the competition due to delays. \n\nIf Intel can execute their over ambitious products, then they would be crushing the competition. Alas, meteor lake and arrow lake are both delayed an year compared to their original release dates. Really, the first \"non delayed\" Intel product won't release until 2025 or 2026, but I think Intel has been trying to tone down their new product ambitions to focus on executing on time.", "score": 2, "replies": []}]}, {"body": "Seems like the focused mostly on cloud and desktop CPUs, which is there bread and butter. If thats true I don't feel trying improve what you have already been making that innovative. I hope they can pull it together because if they do it's a great value now.", "score": 1, "replies": [{"body": ">Seems like the focused mostly on cloud and desktop CPUs, which is there bread and butter.\n\nI mean that's true, since they were lagging so far behind there, but even their CPU designs are wildly more complicated than AMD. SPR uses four massive chiplets with a massive mesh and monolithic L3 and some pretty advanced packaging. AMD went the simpler route, using iFOP with much higher latency, and doesn't deal with the problems and complexities that come with huge meshes by clustering their L3s. With MTL, you get an insanely complicated product once again, using an interposer with chiplets stacked on top. AMD is sticking to their monolithic design in mobile and then you get iFOP in client and server parts. Now, this isn't commenting on performance, as you can design an insanely *complex* design, and still perform pretty bad, but it is much harder to design (initially). \n\nHowever, both MTL and SPR were plagued with design problems as well, partly due to how ambitious they were. A lot of people think that SPR was forced to come out as late as it did because of node problems, but no, alder lake released using the same node and cores as SPR like a year or two earlier, and Intel 7 was yielding fine by then. It took several die steppings to fix how buggy SPR was, which added monumental cost and time. \n\nThe biggest killer of Intel's dominance though, was their delays in 10nm. And the reason for those delays was because Intel was too ambitious with how dense their 10nm chips were projected to be. There's a reason that Intel's chip density (SPR for example) is so much lower, and their cores so much bigger, than AMD even when comparing TSMC 7nm and Intel 7, and it's because that Intel kept on slowly lowering density on their 7nm chips as they traded density for yield. \n\n>If thats true I don't feel trying improve what you have already been making that innovative.\n\nIntel tries to be pretty innovative in other markets as well. They tried breaking into the HPC GPU space before Ponte Vechio before (Larabee, though that was more of a hybrid between a GPU and CPU), but failed. They tried entering the mobile space a while back, but thought that market wasn't going anywhere so dipped (which is ironic since it's huge now). They actually planned to release an GPU+CPU combo (like MI300 is) before delaying that all the way back into 2026 or 2027 IIRC. \n\nPonte Vecchio, which did eventually release in 2023, was delayed for a while, and is a massively complex and innovative design. Arguably too complex tbh. It uses something like 60 chiplets and both EMIB and Foveros. Again, an insanely complex, innovative design, that was delayed almost certainly due to how needlessly complex it was. \n\nIntel is great at planning to innovate and coming up with these crazy designs, it's their execution that just sucks.", "score": 3, "replies": [{"body": "Interesting I appreciate the educated and what sounds like an insider response. I agree I always felt Intel made a better CPU than AMD. So I guess my question for you is do you see hope for Intel? Are they worth investing in as a value play now?", "score": 2, "replies": [{"body": ">Interesting I appreciate the educated and what sounds like an insider response.\n\nI just want to disclose that I'm not an insider lol, though I do follow CPU tech pretty closely, and am majoring in Computer Engineering. \n\n>I agree I always felt Intel made a better CPU than AMD\n\nIntel doesn't make more performant or more efficient CPUs than AMD, just more complex. Some might say needlessly so, but there are certain advantages in certain workloads because of the more complicated way Intel is approaching CPUs (for example, core to core latency for SPR). \n\n> So I guess my question for you is do you see hope for Intel? Are they worth investing in as a value play now?\n\nNot a stock guy haha, just a tech guy. Completely my opinion though, I'm more optimistic for their fab side than their CPU design side tbh.", "score": 3, "replies": [{"body": "Yea I just meant you clearly were in the industry. I thought Intel still had the higher performing CPU albeit less efficient.", "score": 1, "replies": [{"body": "In per core perf, Intel has a slight lead depending on the workload. AMD's \"x3D\" lineup also takes the performance crown depending on the application. Intel's generally stronger single thread performance was the cited reason Nvidia chose to partner up with Intel's Sapphire Rapids for their DGX H100 systems. \n\nIn multicore workloads though, which are much more common in server instances, you have AMD stomping Intel, due to the fact that AMD has way more cores. \n\nEfficiency wise, AMD is also stomping Intel as well. Even AMD's Milan, which is AMD's last generation server CPU (vs current AMD gens server CPU being Genoa using Zen 4) is more efficient than Sapphire Rapids. This is pretty much solely due to AMD's better core design team in terms of balance across performance, power, and area, since both Milan and SPR use a \"7nm\" class node.", "score": 3, "replies": []}]}]}]}]}, {"body": "Yeah I hope that they do, I've got hopes in them. They'll do it.", "score": 1, "replies": []}]}]}]}, {"body": "The problem with Intel is that you better have a 3 to 5 year time horizon for the investment.", "score": 4, "replies": [{"body": "That's the minimum time horizon for any stock market investment", "score": 14, "replies": [{"body": "reddit investors in shambles - if the depot doesnt go up next week imma dump the stock", "score": 12, "replies": []}]}]}, {"body": "Before AMD, Intel was pretty much the only CPU...they were the dominant market player.\n\nThen came AMD. They sucked a lot but they persevere. After a while AMD became better than Intel for a short while, and then Intel became better and now AMD is better.\n\nThe story is that, Intel and AMD will always wax and wane. AMD is not the same quality company they used to be. Their GPU driver sucks. If Intel can get a better driver for their Arc GPU, I think they have a shot in a two player market.", "score": 3, "replies": [{"body": ">Their GPU driver sucks\n\nAMD's GPU drivers (client side) haven't \"sucked\" since RDNA 2 really. \n\nAs for server, both Intel IIRC and AMD are going for an \"open sourced\" approach vs Nvidia, and both companies don't have nearly as much history or resources as Nvidia in terms of investing there. \n\n>If Intel can get a better driver for their Arc GPU, I think they have a shot in a two player market.\n\nThere's way more than drivers for Intel to fix with Arc. One example is their massive difference in area efficiency vs Nvidia and AMD, meaning that they have to yield bigger chips for the same level of performance, lowering margins.", "score": 3, "replies": []}]}, {"body": "Intel looking like a good value buy right now.", "score": 2, "replies": []}, {"body": "Intel gets some points for being deemed, I guess, critical infrastructure in the US now. Opening Uncle Sam's wallet for investments in Intel. However they're still technologically behind and have been for years now. They have a plan, and they need to execute on that plan to succeed. Until then they're dead to me.\n\nIf war breaks out in Taiwan, I think Intel will surge for being in the US. I expect TSMC to go up in flames in that scenario, and AMD will absolutely tank. TSMC is building fabs in US to mitigate this risk.\n\nUntil Intel catches up to AMD technologically (if they ever do), AMD will continue to take market share from Intel imo. AMD may be threatened by NVIDIA's AI dominance by being slightly later with their chip, but I think Intel is devastatingly behind on AI chips. I've seen some analysts wonder, if NVIDIA will sit so hard on the AI chip market, that everyone else has missed the boat. Everyone is pouring money into AI chips, and if they're all buying NVIDIA, it can be hard to get them to buy something else later on. Either because of the tech/architecture/software or simply because money dries up for additional investments. I've also read that AMD's forthcoming AI chip can certainly compete with NVIDIA. So far I consider that marketing and rumours, but I have faith in Lisa Su.\n\nMy money's on AMD, but with the China-Taiwan risk, it wouldn't hurt to have some Intel as well.", "score": 2, "replies": [{"body": "&#x200B;\n\n>AMD will continue to take market share from Intel imo.\n\nPat announced that they stemmed the marketshare bleed from AMD in DC with SPR. I fully expect Intel to continue selling their Xeons at terrible margins in order to stem AMD from gaining market share. And I'm guessing AMD is relatively fine with this lol, considering they are going to be selling their CPUs at comparatively crazy high margins where perf is more important. \n\n> AMD may be threatened by NVIDIA's AI dominance by being slightly later with their chip, but I think Intel is devastatingly behind on AI chips\n\nI think this is a pretty fair assessment. Ponte Vecchio looks like a HPC focused, massively complex GPU that I doubt is going to be able to ramp much at all simply because of how ridiculously complex it is for the perf a customer can get. To be fair though, Intel also has Habana. [Hugging Face](https://huggingface.co/blog/bridgetower) recently released an article talking about how Gaudi 2 can be optimized to run 40% faster than H100s in vision-language models. \n\nWhile CPUs will be obviously less powerful for most tasks, Intel claims that something like 1/4 of SPR sales were related to AI as well. \n\n>I've also read that AMD's forthcoming AI chip can certainly compete with NVIDIA\n\nHardware wise, based on rumored TFlops, it looks like it could, but the main point of contention is the software gap.", "score": 2, "replies": []}]}, {"body": "Intel is the United States’ symbol in Semiconductor. They are not going anywhere. After adapting EUV, they looks very green now. e.g they will have PowerVIA in production next year. while Tsmc will be lagged behind 2-3 years.", "score": 2, "replies": [{"body": "Stuff like Powervia and GAAFET are \"toppings\" to a node PPA dessert, but even according to Intel themselves, TSMC 3nm is going to be better than Intel 20A.", "score": 1, "replies": []}]}, {"body": "Way back Intel used to have the highest performance CPUs for PC but AMD had better bang-for-your-buck. Last I checked, AMD has both now. So no surprise amd has been taking their market share and, by extension, no surprise amd has a higher market cap now. They are pivoting to chip fab at least in part because the rest of their business is failing due to poor execution.", "score": 1, "replies": [{"body": "> Last I checked, AMD has both now.\n\nNo, Intel still has a very competitive budget segment.  \n\n>So no surprise amd has been taking their market share and, by extension, no surprise amd has a higher market cap now.\n\nIntel has reported they stop the market share bleed in DC this quarter due to SPR. The problem is that they are doing this by selling their CPUs dirt cheap. AMD is fine selling high margin chips to customers who prioritize performance, and honestly maybe even cost, considering that even if the chips are priced higher initially, the energy efficiency of said chips ensure they will save in power costs vs Intel over time. \n\n>They are pivoting to chip fab at least in part because the rest of their business is failing due to poor execution.\n\nYe I agree. Intel's DCG in particular is a mess in terms of post silicon validation. Client is decent enough (but still worse than AMD). Their core development team isn't as good as AMD's either.", "score": 0, "replies": []}]}, {"body": "Recession?\nPrice target AMD$50\nPrice target Intel $20\n\nContinued interest rate hikes with minimal economic fallout\nPrice target AMD$80-100\nPrice target Intel $16\n\nChina invades/ military intervention with Tiawan\nNot buying AMD\nBuying Intel immediately", "score": 1, "replies": []}, {"body": "Fabs matter a lot.\n\nYou cannot build a fab over night or year, even if you have cash.\n\nMeanwhile cpu design? Thats way easier, there is many startups that do that", "score": 0, "replies": [{"body": "Yes you are right. And I know intel is investing a lot in production capacity. Yet, just having a fab doesn't mean the yield is at expected levels, let alone it's operating profitable.", "score": 1, "replies": [{"body": "Intel has been making their CPUs for decades while having huge revenue\n\nAnd while there is room for improvement for margins, then I believe thet they have knowledge and experience to make it work\n\nThey are currently in race with TSMC for leading node with their 18A\n\nIf they manage to deliver it in 2025 then thats gonna be big", "score": 2, "replies": [{"body": "You are right with everything you are saying.\n\n... IF they manage to deliver ...", "score": 1, "replies": [{"body": "Ive bought their stocks and Im holding, so Im betting on their growth :p\n\nBut Im also buying other semico stocks because I believe whole semico will grow in next years (4?)", "score": 2, "replies": [{"body": "It's definitely going to grows, thats why I also invest in suppliers like Applied Materials, LAM and ASML.", "score": 2, "replies": [{"body": "$LRCX is the way", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "AMD merged with Xilinx. The stock is currently near all time high market cap prior to the merger and AI hype so either AMD was vastly overvalued or is currently undervalued.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Ran by suits? Wtf", "score": 3, "replies": []}]}, {"body": "I've been an AMD fan boy going back to 1999, however with the release of intels core processors around 2009 they kind of stood alone for the next 7 years, but since the Ryzen release I was back as an AMD guy. However I just recently put together a budget build for a friend and Intel has the best budget build right now with the i3 12100f for $92 (which is arguably the best budget processor of all time), which blows away AMD's Ryzen 5 5500 for $85. The next processor up from that that competes with the i3 12100f is the Ryzen 5 5600 for $145, but there's a big price jump in there. The 5600 beats the i3 in multi core performance by around 30% but in everything else they're about the same, but from the 5600 up I have to go back with AMD, but both companies and their price points are very competitive.  Also the intel motherboards offer much more for the price on your lower budget builds. I'm not well versed on the above the higher budget builds but I like AMD in the middle and middle lower budget builds over intel (but it's so close you can go either way)... but the i3 12100f is such an awesome processor for the price for a low budget build. As an AMD fan boy it was a compromising position to either go with the i3 12100f for $92 or the AMD Ryzen 5 5600 $145. if the 5600 was only $20 more I would probably go with that... it would be a definite but as I said, the intel motherboards currently give you more bang for your buck in that $100 realm (it never used to be that way and I look at both used and remanufactured... I was able to get an Asus Z690 for $100).\n\nAs I said I I pull for AMD and have an AMD bias, but I was blown away with the i3 12000f processor, which is essentially beating AMD at it's own game, but it's only in that one category of an ultra budget build everything above that I give the edge to AMD, but the price/performance is priced pretty similarly.\n\nBut intel almost seems to good to be true right now and I wonder if there's a catch. Like a vulnerability in the architecture that's going to reduce the performance by 35%  or something. They're in a very tough position to where they need to get stuff out quickly that's going to compete and they would rather put out a future/problematic issue looks good during the time of the release, but I'm merely assuming (there doesn't seem to be any current evidence to suggest this, but who knows).", "score": 0, "replies": [{"body": "You realize this is not r/buildapc right?", "score": 2, "replies": [{"body": "Performance per cost is the single most important factor when analyzing AMD vs Intel, so to ignore that is insanity (and the future of both companies lies heavily in value per price).  We can of course bring in some other potential factors, but that's by far the most important one.\n\nIf you want to make it about the stock market... there are so many corrupt/nonsensical components associated with the big players control that which goes beyond a company's quarterly/annual sales. A company could have an excellent quarter/year and their stock could tank and vice versa. If it was that easy we'd all be rich playing the market... it doesn't work that way. Not sure if that's what you're getting at, but the initial post went into it.", "score": 0, "replies": [{"body": "This is r/stock. If you wish to not discuss the companies stock performance, but their products, you should do this someplace else.", "score": 1, "replies": []}]}]}]}, {"body": "I know nothing. But I know semiconductors are just getting started, everything relies on them, and intel is like the only American company with American fab (with huge government backing) which Americans flock too in times of turmoil. \n\nNvidia is too expensive for my under $100 rule, so intel vs AMD? Who knows, I bank on the fight and buy both and any other semi money goes to soxq (same thing as soxx to me but cheaper) cause no one knows what will happen with AI or otherwise. Not advice, I’m an idiot.", "score": -7, "replies": [{"body": "Please don't have an \"under $100\" rule.  Other than penny stocks, the price of a single share is meaningless.  A $2000/share price doesn't necessarily mean a stock is expensive, and an $8/share price doesn't mean a stock is cheap.  \n\nAll that changes is the number of units.", "score": 16, "replies": []}, {"body": "Intels a 58 year old company that’s just getting started?", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "But what you're talking about is TSMC. Not Intel. If you want all the tiny chips that are in nearly everything, you should buy TSM not INTC.", "score": 3, "replies": []}]}]}]}, {"body": "Nvidia won, this debate is over", "score": -1, "replies": [{"body": "Wrong portfolio.", "score": 0, "replies": [{"body": "I’ll downvote you sir", "score": 1, "replies": []}]}]}, {"body": "SMH 🤦‍♂️", "score": -12, "replies": []}, {"body": "It’ll take a while for intel to do it’s turnaround and be the us version of tmsc and more. \nAmd has still lots of room to grow. \nBut both are good imo. \nNvdia might be way too overpriced now. So amd has potential.", "score": 1, "replies": []}, {"body": "Both are underpriced and forward operations work at fundamentally different levels, with AMD looking to challenge ARM and Nvidia more while Intel is looking towards TSMC and the like.", "score": 1, "replies": [{"body": "Intel still *should* be competing with ARM and Nvidia (they don't compete very well though). I highly doubt IFS 2.0 is going to be a large part of their companies business moving forward until *many* years into the future.", "score": 1, "replies": []}]}, {"body": "I’ve bought and held AMD for over a year. Grown from 68 to 109 at present. Intel is still too much of a risk to me.", "score": 1, "replies": []}, {"body": "I'm about to buy a laptop and Intel options look better deal to me than AMD. Just saying", "score": 1, "replies": []}, {"body": "Amd has a far better chance of hitting its highs again than intel does. I’m biased towards amd, they’re one of my better holdings but I wouldn’t touch intel. I’m also long on them, I’m not looking for a short term flip. \n\nIntels never had an issue with money and they seem to think that they can solve their problems by throwing money at it and that’s only true to an extent. In my opinion, what intel has going for it is the weight of its name.", "score": 1, "replies": []}, {"body": "Intel stock was too cheap, almost trading at book values amd stock was expensive = performance of this year explained considering the slowdown in semiconductor sales", "score": 1, "replies": []}, {"body": "Intel is gas always been better.", "score": 1, "replies": []}, {"body": "Intel price target: $100", "score": 1, "replies": []}, {"body": "ARM", "score": 1, "replies": []}]}
{"title": "One of us! One of us!", "selftext": "Had turned 900 > 7880 post Nvidia earnings back in may? June ? idk (not last earnings lamao! one before) gambled half and furnished my apartment with the rest, then kept winning and pulling out, until I YOLOED into SPY PUTS on this fabled past week aaaaaand.....\n\nI'ma sell some PSA 10 Pokemon cards and be back in the casino, fellow regards 🩵", "id": "168iiq7", "created_utc": 1693700515.0, "score": 377, "upvote_ratio": 0.95, "num_comments": 122, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 years ago\n**Total Comments**|57|**Previous Best DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": ">That's an impressive return on investment! Well done.", "score": 163, "replies": [{"body": "So VM came back with sarcasm, smh Vivi", "score": 45, "replies": [{"body": "Even the bots in this sub are regarded", "score": 9, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "You sound autistic", "score": 0, "replies": []}]}, {"body": "I’ll meet you at the back of the Wendy’s dumpster if you’re interested in recuperating some of your loses.", "score": 70, "replies": [{"body": "is the offer only for OP?", "score": 16, "replies": [{"body": "fr that’s what i’m tryna figure out 🥺", "score": 2, "replies": []}]}]}, {"body": "Good to see a healthy amount of philanthropy on this sub, really warms my heart", "score": 41, "replies": [{"body": "This made me spit out my coffee", "score": 6, "replies": []}, {"body": "Two sides to every trade..  we all play an important role", "score": 4, "replies": []}]}, {"body": "RTX looking juicy rn tbh", "score": 22, "replies": [{"body": "Don’t buy. OP is a fool and should have seen this coming\n\nhttps://www.cnbc.com/amp/2023/08/16/cramers-lightning-round-raytheon-is-a-buy.html", "score": 8, "replies": [{"body": "Agreed", "score": 2, "replies": []}]}]}, {"body": ".69 cent buying power… nice", "score": 21, "replies": [{"body": "Nice", "score": 4, "replies": [{"body": "Nice", "score": 4, "replies": [{"body": "Nice", "score": 2, "replies": [{"body": "Nice", "score": 2, "replies": [{"body": "Nice", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why is that that everyone who posts Loss Porn is on Robinhood?", "score": 20, "replies": [{"body": "Makes perfect sense", "score": 6, "replies": []}, {"body": "Because of instant deposits, which is shit lately..\n\nThey changed the rules, so you can only instant deposit once every 5 days or you go into account deficit.", "score": 1, "replies": []}]}, {"body": "wait so this entire journey started with $900?", "score": 13, "replies": []}, {"body": "A wins a win, cash out that 80 dollars!", "score": 9, "replies": []}, {"body": "You’re so fucking stupid", "score": 47, "replies": [{"body": "Your*", "score": 16, "replies": [{"body": "Yore*", "score": 24, "replies": [{"body": "Ur*", "score": 16, "replies": [{"body": "u dum*", "score": 13, "replies": [{"body": "You’*re", "score": 5, "replies": [{"body": "Eeyore", "score": 9, "replies": [{"body": "Yur*", "score": 3, "replies": [{"body": "Yer", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "U'our", "score": 1, "replies": []}]}, {"body": "Yer*", "score": 2, "replies": [{"body": "Wsb*", "score": 7, "replies": []}]}, {"body": "You are", "score": 1, "replies": []}]}, {"body": "Welcome home 🏠", "score": 10, "replies": []}, {"body": "Chart look like a middle finger", "score": 8, "replies": []}, {"body": "Only 50k... amateur", "score": 8, "replies": [{"body": "Yo know you’re an amateur when your loss porn is only 50k, we want to see a $1m loss on a Robinhood chart", "score": 1, "replies": []}]}, {"body": "Welcome to Wendy’s.  Git on yer knees and open up.", "score": 5, "replies": [{"body": "At least there would be plenty of grease available", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4267)", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4267)", "score": 2, "replies": []}]}, {"body": "You could have bought SPY and sells 0dte for $100 daily. But no, you just gotta do this  ![img](emote|t5_2th52|4271)", "score": 4, "replies": [{"body": "Got about 500 to gamble every month, I ain't hear no bell!", "score": 2, "replies": []}]}, {"body": "Thank god. Now that your puts flopped, the market can finally crash in peace. Never forget, You were up!\n\nSee you behind Wendys", "score": 4, "replies": []}, {"body": "This explains all the “Struggling with depression or anxiety?” ads on this subreddit", "score": 5, "replies": []}, {"body": "69 cents of buying power, Elon would be impressed", "score": 7, "replies": [{"body": "Nice", "score": 3, "replies": []}]}, {"body": "Thanks, we’ve been seeing too many fake green graphs lately.", "score": 3, "replies": []}, {"body": "Nice. You’ll recover.", "score": 3, "replies": [{"body": "Ty 🩵", "score": 2, "replies": []}]}, {"body": "You have RTX call my friend! I’m too and broke 😀", "score": 3, "replies": []}, {"body": "25 basis points away from perfect score", "score": 3, "replies": []}, {"body": "What Pokémon cards? Asking for a friend", "score": 2, "replies": [{"body": "Honestly many many, but from vintage like a Shadowless,  first edition Blastoise PSA 8 and a shit tone of modern 10's", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4640)", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4275)", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 2, "replies": []}]}]}]}, {"body": "Just one more hit!", "score": 2, "replies": []}, {"body": "You still have $80.69 left", "score": 2, "replies": []}, {"body": "I'll buy pokemon cards if you need cash 👍", "score": 2, "replies": []}, {"body": "As a relatively new investor in stocks (I always just shoved savings into CDs and bonds), my wife and son would like to thank you and all the other WSB regards like you, for providing the strong motivation to remain boring and just invest sensibly in ETFs and the like. I may never be one of you, but the awe left in your wake on your way to Wendy’s is truly inspiring, legendary even. To those on their way to the dumpster, we salute you.", "score": 2, "replies": []}, {"body": "Shit bro, you'll climb back, truth the process.", "score": 2, "replies": []}, {"body": "Turn that $80 to 80k. U got this", "score": 2, "replies": []}, {"body": "Dude ur better than me I'm down what 173k since 2020....FJB", "score": -7, "replies": [{"body": "❄️", "score": 2, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -2, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Show us how you mess up?", "score": 1, "replies": []}, {"body": "First spike gets em all", "score": 1, "replies": []}, {"body": "Make it 99.99%", "score": 1, "replies": []}, {"body": "Welcome aboard 🤝", "score": 1, "replies": []}, {"body": "😹", "score": 1, "replies": []}, {"body": "No buy an hold not option an loose", "score": 1, "replies": []}, {"body": "At least you still have that RTX call left ![img](emote|t5_2th52|4260)", "score": 1, "replies": [{"body": "Prolly gonna expiry worthless due to theta", "score": 2, "replies": []}]}, {"body": "Makes me want to Yolo my 401k. I bought rtx shares and made money, options probably not for you either bud", "score": 1, "replies": []}, {"body": "er’uoy", "score": 1, "replies": []}, {"body": "All these sarcastic comments, it really makes the person feels better.\nBunch of clows in this chat room..", "score": 1, "replies": []}, {"body": "Buying calls on VinFast is less regarded than what you did", "score": 1, "replies": []}, {"body": "Mustang GT500 Poof", "score": 1, "replies": []}, {"body": "Welcome to the club, it's official, you're one of us now.", "score": 1, "replies": []}, {"body": "You have 69 cent…69… and the cent thing going on", "score": 1, "replies": []}, {"body": "!GUH", "score": 1, "replies": [{"body": "#[GUH](https://www.reddit.com/r/wallstreetbets/comments/kkc8ev/just_in_case_yall_forgot_this_video_exists/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Let it ride I'm sure it will turn around.", "score": 1, "replies": []}, {"body": "Congrats", "score": 1, "replies": []}, {"body": "At least you have a plan..", "score": 1, "replies": []}, {"body": "I liken this entire WSB experience to well as you say one of us what it is kind of like the tide pod experience after you eat that tide pod yes you're one of them good job man", "score": 1, "replies": []}, {"body": "That’s what my Robinhood looked like too", "score": 1, "replies": []}, {"body": "That's some buying POWER,  in like 1920", "score": 1, "replies": []}, {"body": "Jesus RTX call at 94.....", "score": 1, "replies": []}, {"body": "Looks like the Doge spike", "score": 1, "replies": []}, {"body": "Double bottom, bullish imo![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "Hey just for dinner for 2 but no dessert or wine", "score": 1, "replies": []}, {"body": "$80.69 is still a lot of money for cheeseburger", "score": 1, "replies": []}, {"body": "Turn that chart upside down! 🚀 💥", "score": 1, "replies": []}, {"body": "‘Enables options’", "score": 1, "replies": []}]}
