{"title": "Overpopulation… Forever", "selftext": "Preface - I’m completely new, ignorant, investing for the first time. Apologies for the word count below.\n\nCurrently - doing research\n\nThe past - Observing massive media doom going back to pre-2016. The message on 8 year old YouTube videos from CNBC etc = doom. \n\nThe past in reality - massive, unprecedented, unpredicted growth. Growth so delicious that ETF boom occurs. \n\nPresent - uncertainty is identical to past 8+ years. Narrative is the same\n\nFuture - the truth as I see it, as an outsider, as a complete noob = overpopulation ->\n\nWorld overpopulation is the reason the market can’t stop, won’t stop. These aren’t bubbles. The bubbles you’re seeing are new investors in the US, India, everywhere.\n\n330 million in America = inevitably more investors. 8 billion worldwide. People exiting the third world in South America due to Lithium alone will be huge. Continent of Africa has barely begun industrialization.\n\nWe, as ignorant new investors don’t know anything but buy. African new money = buy. India buy. USA buy. Unemployment low, more retirement accounts = buy. As noobs, we don’t even know we are bulls. Buy VOO? Sure. Nvidia, makes sense. Noobs buy.\n\nLook at housing market, 65 million new homes predicted in USA. 1% of housing market currently for sale = overpopulation. Endless growth. \n\n5 trillion in ETF’s? Go ahead and short that bubble. But will there be 50 trillion in ETF’s by 2030? \n\nYup. Because of overpopulation. The answer is always overpopulation. Going forward humans are literal compound interest as 8 billion grows and grows and grows. \n\nThere are so many people visiting Venice that it sinks WHILE tourists are there, and rises when they leave. Google any location, too many people, too many tourists not enough houses, schools, not enough condos, hotels\n\nLast thing. I like to learn. So if I’m wrong tear me a new one. Best way to learn is be dead wrong.\n\nIf you’re experienced figure out a way to fleece the noobs. Or maybe just get swept up in their unprecedented, world-changing, buying power", "id": "16s254b", "created_utc": 1695671851.0, "score": 14, "upvote_ratio": 0.52, "num_comments": 137, "comments": [{"body": "I've never seen someone type so much and say so little", "score": 459, "replies": [{"body": "And incorrect. Only India and Nigeria are expected to have significant growth over the next 20 years. All mature economies, including china are starting a downturn.", "score": 175, "replies": [{"body": "True, someone that does not know a negative birthrate is our forward looking reality will not do well investing.", "score": 54, "replies": [{"body": "I would take such predictions with a grain of salt, because it accounts for factors that are not possible to predict.\n\nIt's far from the first economists and other fields have predicted doom based on assuming things will continue exactly as they have been", "score": 5, "replies": [{"body": "those predictions are true, for all the economies lol", "score": 1, "replies": []}]}, {"body": "Population overall is still growing rapidly, and there will be influx of immigrants everywhere.", "score": -10, "replies": [{"body": "“Influx everywhere?”", "score": 4, "replies": []}]}]}, {"body": "I dunno, 8 billion I people in the world, while resources dwindle.  Maybe not the same exponential growth he was talking about but I think he’s onto something.", "score": 1, "replies": [{"body": "If you insist we can start some radical religious movements and whittle that down a bit. Biggie puts the E in ethnic cleansing!\n\nOr we could just you know...wait a bit", "score": 2, "replies": []}, {"body": "My best guess is that OP is seeing the short term (20-30 years) effect of massive money printing and debt increases by the US govt. In 2008, there was $10T of debt/GDP. By 2016, money orinting had pushed the price of GDP to $20T. And CVd “stimulus” pushed it to $30T. \nTripling the money in circulation in 15 years, without also tripling the goods available to buy, must have an effect on the value of a dollar.", "score": 1, "replies": []}]}]}, {"body": "This sub has gotten so incredibly dumb its entertainment value has skyrocketed inversely proportional with any semblance of value financially lol. 100/0 ratio now", "score": 15, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Na WSB gives you a chuckle every now and then here it’s just brain injury from the face palming", "score": 4, "replies": []}]}, {"body": "yes true people ask dumb questions get the most views", "score": 1, "replies": []}]}, {"body": "This is what meth and conspiracy theories do to people.", "score": 7, "replies": [{"body": "Can confirm", "score": 2, "replies": []}]}, {"body": "Bullish", "score": 3, "replies": []}, {"body": "Future in politics they have!", "score": 3, "replies": []}, {"body": "its like the chatgpt copy and paste but from 10-20 years ago", "score": 3, "replies": []}, {"body": "Hilarious, but I really enjoyed this post.  I thought it was fresh and excellent inspiration. Kudos to the guys effort and research", "score": 13, "replies": [{"body": "What research?", "score": 13, "replies": [{"body": "He watched some CNBC videos on YouTube from 2016. Keep up", "score": 26, "replies": [{"body": "On 3.0x no less mad skillz", "score": 2, "replies": []}]}, {"body": "The research he referred to, but declined to cite. Instead he gave an impassioned overview. Let’s not kill OP’s excitement. Right now I think he just smells possibilities", "score": 1, "replies": []}]}]}, {"body": "It’s a talent show in Indonesia. I believe it’s called are you speak English are you have talent?", "score": 0, "replies": []}, {"body": "lol! I was thinking exactly the same thing. A giant nothing burger.", "score": 1, "replies": []}]}, {"body": "Current estimates have the global population peaking in the 21st century, at less than 35% higher than today (under 11 billion).", "score": 91, "replies": [{"body": "Which to be fair still means a lot of growth for our life time especially since many countries with high populations aren't very developed yet", "score": 33, "replies": [{"body": "Yes obviously, but not because of endless population growth as claimed in the OP", "score": 26, "replies": [{"body": "Not to mention many social structures will need reform due to the nature of how we’ve built things. \n\nThe assumption of infinite growth is baked into everything in a capitalist society. Whether we agree with values of different countries is irrelevant. The fact is that today, most countries are competing on a capitalist stage including authoritarians and communists and liberals etc etc. \n\nSocial Security in the US for instance is basically just a huge Ponzi scheme, and relies on more young people than old. Same with most paper trading markets and real estate markets as OP is pointing out. \n\nOnce we get the inverted age triangle in more places than not we’ll probably be in some deep shit as a species.", "score": 2, "replies": []}]}, {"body": "And in all developed countries the population is collapsing. Yay", "score": 8, "replies": [{"body": "Remove countries and think global market and it doesn’t matter to the globally diversified investor. You win with higher per capita incomes in developed economies and growth/inexpensive labor in lesser developed countries. You don’t need infinite population growth for economic growth and healthy market returns.", "score": 3, "replies": [{"body": "“Globally diversified investor” aka anyone who owns an index fund that tracks large cap US stocks no?", "score": 1, "replies": []}]}]}]}, {"body": "Source?", "score": 1, "replies": [{"body": "[https://ourworldindata.org/population-projections](https://ourworldindata.org/population-projections)\n\n[https://www.un.org/development/desa/pd/sites/www.un.org.development.desa.pd/files/wpp2022\\_summary\\_of\\_results.pdf](https://www.un.org/development/desa/pd/sites/www.un.org.development.desa.pd/files/wpp2022_summary_of_results.pdf)\n\nPage 30, median scenario", "score": 4, "replies": []}]}]}, {"body": "Google’s location : *farm in Midwest*", "score": 36, "replies": []}, {"body": "i would say this is chatgpt generated but it is far too incoherent in general to have been produced by it", "score": 31, "replies": []}, {"body": "Sir, this is Wendy’s.", "score": 95, "replies": [{"body": ">Sir, this is Wendy’s.\n\nHe's right where he belongs.", "score": 15, "replies": []}]}, {"body": "Population increases are quickly coming to an end. Kids are too expensive, the baby boom days are over.", "score": 61, "replies": [{"body": "I keep hearing that but OP's points seem to be true in my anecdotal experience.  Everything is so fucking crowded nowadays.  Golf rounds are guaranteed 5 hours if you live near a major metro.  Airports crowded and dysfunctional.  Can't get seats at restaurants.  Shortage of vehicle inventory, shortage of housing inventory.   Traffic is worse than 10-20 years ago.  Everything just seems crowded as hell.", "score": 13, "replies": [{"body": "I meant global population. \n\nIf you live in the USA, it is the premier destination. It is truly the greatest melting pot country of the world. Population growth will keep increasing in USA for quite some time. So yes, everything will only be busier. \n\nIt will be interesting too see how the USA handles future immigration. Their current citizenship laws aren’t working.", "score": 21, "replies": []}, {"body": "That's a result of population density, not population", "score": 18, "replies": []}, {"body": "Well you called it anecdotal for a reason", "score": 12, "replies": []}, {"body": "That's because people flooded into cities looking for opportunities. Rural places in the US are very often bereft of people.", "score": 4, "replies": []}, {"body": "Yes, but you can always get a seat, in your car, at the Wendy’s drive thru", "score": 3, "replies": []}, {"body": "Its always been like this.\n\nI do think there are days coming when remote work become more and more viable and appealing and with it the conceptualization of the \"City\" isn't as necessary or required. \n\nThere is a ton of space for people to live. We just aren't using it.", "score": 2, "replies": []}, {"body": "> OP's points seem to be true in **my anecdotal experience**", "score": 2, "replies": [{"body": "What point do you think you just made?  I recognize my experience is anecdotal..  It doesn't mean it has no value or merit.", "score": 1, "replies": [{"body": "That personal, anecdotal evidence shouldn't be extrapolated over any entire market (or used to make investing decisions, generally)?", "score": 1, "replies": [{"body": "“Ignore your eyes and ears and trust the “experts””\n\nI agree that it shouldn’t be the only source, but when media is corrupted it’s basically all we have left", "score": -1, "replies": [{"body": "> “Ignore your eyes and ears and trust the “experts””\n\nNot really.....you made no mention of using your brain and coming to conclusions after evaluating objective data vs the stupid / lazy way of making investing decisions by relying on conclusions from your own experiences and bank that millions of buyers and sellers in the market will arrive at the same conclusion.\n\nTL;DR: Get off your ass and crack open an SEC filing if you want to make a positive return on your invested capital.", "score": 1, "replies": [{"body": "Yeah fuck people's experiences, they are meaningless!  I'm an idiot for every round of golf being 5.5 hours of waiting instead of 4 hours pre covid.  Trust the data!", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "Not sure how much you travel but it is crazy out there and there is no way to accurately count the population in most countries. For example in india where i go, most people don’t even report or do census in villages.", "score": 6, "replies": [{"body": "I dont report or do census, and I'm American", "score": 12, "replies": [{"body": "That is un-american.", "score": -2, "replies": []}]}, {"body": "That is false. \n\nIndia itself is under replacement rate now actually, but this is a good thing in the long run for India.", "score": 2, "replies": [{"body": "and for the world lol", "score": 3, "replies": []}]}, {"body": "Even if population rates were declining, it will still take time for it to \"take effect\". Still a decade or (dare-I-say) two of growth left. Us \"poors\" still haven't got a taste of that good life of having a decent place to rent, sufficient electronics to entertain us while we waste away in outsourced jobs, and a reliable insurance plan.", "score": 1, "replies": []}]}]}, {"body": "Literally what are you talking about", "score": 25, "replies": [{"body": "Man yells at cloud", "score": 6, "replies": [{"body": "Cloud owns him with silence", "score": 3, "replies": []}]}, {"body": "the stock market tends to go up?", "score": 1, "replies": []}]}, {"body": "Malthus said this in 1766.\n\nHe was wrong.  He will continue to be wrong.\n\nNot only that, Malthusianism is running rampant and is only going to get worse as doomers persist infecting people.\n\nEventually the tide will turn.", "score": 27, "replies": [{"body": "Thank you. Googled this right away. We are doing a damn fine job of avoiding the Malthusian Catastrophe… so far. Until then, let’s keep teaching the poor about Roth IRA’s. In fact, there’s a thread on this Reddit written by a 16 year old who just got an investment account setup by his parents. He’s so excited. These kids master all kinds of complicated video games and coding, imagine if they learned investing. The poor aren’t poor by nature, they just don’t know anything yet", "score": -3, "replies": [{"body": "I couldn't tell if you were being sarcastic about the rest of reddit or not.....I am dense.  This sub is generally pretty optimistic.  But yes.  I agree.  The problem is that it will take quite some time to get past this and move forward as a species.  Reading the 4th turning and Generations helps a bit as well.  We are in a 4th turning now and I personally think the backlash when people start thinking for themselves again and re-embrace pragmatism and individualism we will see massive advancements provided we don't nuke each other first.", "score": 6, "replies": [{"body": "People start critical thinking, and become more adept problem solvers? Pass that shit this way.", "score": 2, "replies": []}]}, {"body": "Malthusian ideas are fundamentally wrong. We could have 100 billion humans and not have any more of a crisis that when we had 100 humans.", "score": 0, "replies": []}]}]}, {"body": "Do you know anything about the demographic collapse? Birth rates in the majority of countries are well below replacement already... China and Japan are essentially collapsing in slow motion from lack of new babies and the west isnt that far behind.", "score": 16, "replies": [{"body": "Every day there's more than 2x people being born than dying.", "score": 2, "replies": [{"body": "For now, but apply a simple formula, and you will see the global population is on par to collapse, in the not so distant future", "score": 1, "replies": []}, {"body": "As countries start to initially develop they get basic things like healthcare, sanitation, and clean drinking water which lowers the death rate and allows for huge increases in population. After this the country starts getting contraception, women’s rights, and people moving to urban areas. The birth rate starts to drop. Even further as the country develops women get access to education and start entering the workforce. People get married later, less disposable income, or focus on careers which plummets the birth rate. Death rate is even further lowered with further development. Population is not increasing but just enough to replace everyone. USA is basically here, population only increases because of immigration. Then as the country develops even further develops the birth rate falls below death rate that actually decreases population. Think of countries like Japan or Germany. The population pyramid shifts from a pyramid (tons of young people) to a rectangle (equal amount of all age groups)to an inverted pyramid (tons of old people). There still is a lot of room for population growth but it’s is finite and soon to switch. Looks up the demographic transition model for more info.", "score": 1, "replies": []}, {"body": "Are you sure that's true or is it just a model extrapolating past trends? Is there anyone counting it in real time?\nThe fact that Chinese population is likely collapsing for decades and yet stats still account for much more people based on keeping the trend going is pretty big error still running in global trends as well.", "score": 1, "replies": [{"body": "India for example is still growing rapidly. They are bound to take over the World, and they also have a great culture for producing offspring.", "score": 1, "replies": [{"body": ">s from a pyramid (tons of young people) to a rectangle (equal amount of all age groups)to an inverted pyramid (tons of old people). There still is a lot of room for population growt\n\nThe future will be brown lol.", "score": 1, "replies": []}]}]}, {"body": "In Africa.", "score": 1, "replies": []}]}, {"body": "keyword is \"slow motion\". This isn't some movie, governments create incentives to change demographic psychology all the time. There will be a brief trough, but doesn't mean, \"iTs CoLlApSe\". Watch less doomsday news lol.", "score": 2, "replies": [{"body": "Once all the europeans die off the swell of population of africa will take it over. Europe the new african kingdom.", "score": 0, "replies": []}]}]}, {"body": "More people just means more poor - not more investors.", "score": 17, "replies": []}, {"body": "Wtf", "score": 4, "replies": []}, {"body": "Population growth rates are slowing or going negative so not a great argument. What is an interesting argument is that now due to internet access in pretty much every country and the democratization of finance (fractional shares, no fees, tons of broker choices), more people than ever can invest", "score": 7, "replies": [{"body": "People are making fun of me, it’s Reddit, so to be expected. But you really get what I’m saying. In the future Warren Buffets and Michael Burry’s won’t dominate. Noobs will. It’s a huge wave and it’s coming. When poor people realize what a Roth IRA actually is, via the internet, they stop saving for Jordans and start saving for their retirement. There’s only a few rich guys, but there’s unlimited poor who are gaining access to investing information for the first time in history. Granted they may lose everything if there’s a massive downturn. But, just but, what if there’s enough of them to drive growth? A smart dude on CNBC today said something like “consumer spending has overcome all the highs and lows of the market over the last three years.” Just wait until all of these dumb poor people learn about investing", "score": -11, "replies": [{"body": "Please keep these really silly opinions to yourself until you are confident of them and they're backed on actual research. All you're doing right now is gazing into a crystal ball and just having a bit of a guess based on your limited experience.", "score": 1, "replies": []}, {"body": "Yeah overall agree, but it’s stocks and money so people are gunna bash on you for using “bro” language lol. Been there, good luck in your investing journey", "score": -2, "replies": []}]}]}, {"body": "Are you high?", "score": 3, "replies": []}, {"body": "I expect the planet to eventually be on its knees. We can’t keep with the waste and landfill.", "score": 6, "replies": []}, {"body": "Are you on speed or something lol?", "score": 2, "replies": []}, {"body": "Reading this made my IQ decrease by 50", "score": 4, "replies": []}, {"body": "Human overpopulation is mostly a myth. Population is increasing, but at a slower rate than in the past. This points to human population reaching a peak then either coalescing around a steady state or beginning a long decline. Most developed countries have already started declining in population. \n\n[https://en.wikipedia.org/wiki/Human\\_overpopulation](https://en.wikipedia.org/wiki/Human_overpopulation)\n\nEither way, the trend of human population is largely irrelevant to the choosing of stocks or investing. For long term investing you consider the expected returns of an investment against the cost of the investment (Price to earnings ratio). For short term you can look to technicals/momentum/etc.", "score": 3, "replies": [{"body": "It still impacts markets in industrial countries with poor immigration (asia, some European, many South American). The lifeblood of a country's GDP comes out of the 35-65 yr old generation and that age group in those countries is getting smaller and smaller every year, whose decrease just started in the 2020s. Thus, the GDP outlook for the next few decades for those particular countries would theoretically be downwards.\n\nThe US has poor birth rates too, but immigration keeps it afloat, assuming future immigration policies get better. But the US and every other country is still a participant in the global economy, and the theory is that the impending fall of the Asian economies will drag the rest of the world down with them.", "score": 1, "replies": []}]}, {"body": "Who's gonna tell em?", "score": 1, "replies": []}, {"body": "I'd personally argue the exact opposite.\n\nFirstly, it is important to remember that markets can grow not only when more participants enter the fold but also when more wealth concentrates at the top. One typically marks an upward trend (population growth) of an economic cycle while the other marks a downward trend (concentration of wealth) of an economic cycle.\n\nRight now we are actually experiencing what seems to be the beginning of world population decline rather than growth. Look at China, Japan, Italy.. Hell, even the US had a nominal population growth rate of .01% in the most recent population report (full year 2021), and that's with one of the largest influxes of immigration in the world. But if you look closely, you will see that outside of India and a few other instances, populations are getting older and less productive.\n\nI think in large part this has to do with technological advances replacing everyday jobs and monopolization. Think about it. Younger generations (some gen x, millennials and gen z) across the globe can't afford to have kids because there are not enough high paying jobs available to make it worthwhile. They have either been automated away or outsourced to a foreign country (which will later also be automated away) by corporations looking to increase income from decreasing expenses.\n\nUnless something changes in favor of small businesses or the middle class such as breaking up big corporations, I think we are at the top of the preverbal bell curve in terms of economic growth for a long time. Does that mean that the economy cannot grow anymore? No, of course it can. But I do not believe it can grow at the pace that it once did during the 1940's or 50's. This is apart of the inevitable trend of market cycles  over long periods of time that experience large ebbs and flows.\n\nMarx and Engles coined the term Late Stage Capitalism to describe era. Adam Smith wrote about the dangers of unregulated markets and monopolies in \"The Wealth of Nations\".\n\nThis is all to say that any more money that can be squeezed out of the US economy at this point is just diminishing returns and will likely be from consolidation of capital at the top with little at the bottom. Its like trying to squeeze toothpaste out of an almost empty tube. Any time you have this type of stratification between classes, it begins to resemble Feudalism or something akin to an oligopoly. That in itself is usually the canary in the coal mine for a nations downfall.\n\nEDIT: Spelling", "score": 1, "replies": [{"body": "But. What if enough poor dudes in underdeveloped countries, get some cash, and invest in our stocks over the next 50 years? Serious question.", "score": 1, "replies": [{"body": "The development and explosion of the US economy in the late 40's happened not because of one factor occurring such as a bunch of poor immigrants moving here in droves, but because we had just defeated a bunch of opposing world powers, created a free-trade market for all competitors and allies to participate in, forced the rest of the world to use our currency as the world currency, and had enough room to physically and economically grow without many restraints from government. \n\nEssentially, the last 100 or so years of the American paradigm has been the equivalent to lightning in a bottle. A lot more shit has to go right then wrong. Its not just a poor country becomes rich by offering a rich country cheap labor and goods story. Its that plus a whole lot more.\n\nYes, more people in growing nations investing in our countries stock market is generally good for that stock market as is any person investing in our stock market versus another. But as a whole, that does not compensate for the declining birthrates and economic growth around the world. \n\nThe analogy I was making about America is also important because for the most part, there was a galvanized union of like-minded, hard working individuals all playing the same rules to work hard and make it. China is a great example of a rapidly developing nation with a growing population and gdp. They were an incredible example of a nation that went from dirt poor to wealthy in a very very short amount of time. This one was of the most impressive feats of modern history, and it could only really be done by either submission (communism) or a chorus of individuals all freely working together for a similar outcome.\n\nIn short, that type of growth at such a speed is usually unstable for a reason because it is simply not sustainable. So rapid growth from developing nations tends to compound slower over time. Which means it will not outpace the current trajectory of economic and population decline around the world. Atleast not at this rate.\n\nJust to be clear, the stock market \\*\\*will\\*\\* continue to grow, but not for reasons that will in the long run be good. Instead, the accumulation of wealth at the top will most likely be the reason it grows and because of that, i'd say medium term, we will be facing slower growth in the markets and possibly explosive repercussions.", "score": 1, "replies": []}]}]}, {"body": "Bullish", "score": 1, "replies": []}, {"body": "Overpopulation you say. Well that can be fixed. Lots of people aren’t having kids and people die daily.\n\nThe fucked up truth about the human race is they’re exactly like bacteria in a petrie dish. They thrive and thrive, and party, fuck and produce, then one day the resources run out and extinction inevitably occurs.\n\nAs a newbie investor…you’ve never heard of yelling fire in a movie theater have you?  It’s all good and well if there is a fire and you’re the one to announce it and be the first one out the door.", "score": 1, "replies": []}, {"body": "Nice post, you forgot to factor in plummeting sperm counts. I’m bullish on artificial wombs", "score": 1, "replies": []}, {"body": "Overpopulation is a meme. You can look at China's demographics and see how few people of working age there will be in 30 years, the same thing will happen to India and eventually to Africa. The poorer the people the more kids they have.", "score": 1, "replies": []}, {"body": "You say you like to learn… \n\nYet you didn’t bother to see population, birth rate, mortality forecasts before writing this post. \n\nIn developed countries, growth will come from immigration.  Otherwise, population collapse is a far larger concern than overpopulation. \n\nLook at those metrics in various developed countries, especially the most powerful ones economically and militarily. \n\nOverpopulation is zero concern in most developed countries.", "score": 1, "replies": []}, {"body": "Dude population is going way down wtf are you talking about?", "score": 0, "replies": []}, {"body": "The reason why the west is allowing unabated immigration is for this reason.", "score": 0, "replies": [{"body": "Oh explain! Sounds interesting", "score": 1, "replies": [{"body": "This reasoning was made on TV by Tom Lee from Fundstrat on CNBC that virtually every country except some in the southern hemisphere has negative population growth, and that the US will remain on top of the financial markets because not only does the US have the head start, but we also have more immigration than anyone, that population contributed to GDP.", "score": 2, "replies": [{"body": "The U.S. has GDP growth from immigration because it has a massive, established economy that is able to integrate people.\n\nMany other countries cannot or are unwilling to do this.", "score": 1, "replies": [{"body": "Europe is doing it but they cannot integrate very well and are feeling a lot of pain for it in many places.", "score": 1, "replies": []}]}]}]}]}, {"body": "Need smart guys rather population to boom economy.", "score": 0, "replies": []}, {"body": "Weird take when most first world economies populations are collapsing. I thought this was going the other way.", "score": 0, "replies": []}, {"body": "OP:\nOverpopulation = stock market growth!\n\nOk OP. Haven’t you considered overpopulation could also mean more environmental damage, sociopolitical unrest, and even poverty? More mouths to feed.", "score": 0, "replies": []}, {"body": "I don't know what you are talking about Jesse but essentially the more tech is imparted onto humans the more productive they can become , the more valuable they are. It lessens the cost of goods and those techs make more and more money. \n\n\nMarkets, economy's and stocks grow on the back of innovation. And a poor populous today is a middle class tomorrow. \n\nEveryone is always doom and gloom about overpopulation and energy, but generally markets and products react very efficiently in ways it can make it money. Not enough food? A new company will figure out ways to make food.  Not enough housing? There is housing companies but also tech to allow people work remotely. \n\nThe earlier to leave the market is the one that is getting fleeced. Yep, adapt or die does happen, but often whoever can keep their money in the market the longest can sell at the highest prices.", "score": 0, "replies": []}, {"body": "That's what V2 is for", "score": 1, "replies": []}, {"body": "I really enjoyed this post, OP. I like your way of wording the results of your research into your opinion", "score": 1, "replies": []}, {"body": "Looks more like giving advice than asking for any.", "score": 1, "replies": []}, {"body": "Wait until you start experiencing food insecurity from climate change.   Not just hearing rumblings, but watching it play out.  India's rice ban was just the tip of a melting iceberg.  Let's talk growth then.", "score": 1, "replies": []}, {"body": "Sooo.. Venice sinks and then rises?", "score": 1, "replies": []}, {"body": "Well, you think a little more than the average person. It gets even better though. I have a Wall Street journal from 1970. Guess what extremely bearish. I have another one from 1982, guess what, extremely bearish. The media is gloomy most the time and oddly can let you know when you're around the top because they aren't. In 2000, 2007 and in 2021 they were relatively positive. \n\nThey are not however a timing device because they will get optimistic months and sometimes a year or more before the top. it just lets you know that one is potentially forming. They did the same thing in 2017 and the 2018 correction was really nothing that serious so it's also not a 100% indicator but it is better than 50%", "score": 1, "replies": []}, {"body": "snort some more coke and update us", "score": 1, "replies": []}, {"body": "You wrote so much on one word \"overpopulation\".\n\nYou seem to research quite a lot. Have you seen birth rates?\n\nWhy everyone ignores the projection we are likely to get below 6 billion in a few decades?", "score": 1, "replies": [{"body": "Can’t ignore something you’ve never heard of. Seriously where are you seeing 6 billion?", "score": 1, "replies": []}]}, {"body": "My nose started bleeding reading this", "score": 1, "replies": []}, {"body": "I’ve been DCAing into India ETF for that reason. Unless a massive World disaster, I think you are right. More people = more consumption too logically.", "score": 1, "replies": []}, {"body": "Look up the Demographic Transition Model", "score": 1, "replies": []}, {"body": "lol dude I don’t think you know what you’re talking about and you are just rambling", "score": 1, "replies": []}, {"body": "Thanks ChatGPT.", "score": 1, "replies": []}, {"body": "I would like to give you some educational advice:\nI recommend that you refrain from jumping to conclusions and building wild oversimplified narratives by yourself. The markets are complicated social constructs and most of the times, there is no simple single answer such as the one you are suggesting. I understand that it can be tempting to search for 'the' answer to a certain dynamic and it's satisfying to find ideas that seem plausible or to fit some narratives one believes. However, this is usually a waste of time because the risk of loosing money this way is just too high. Better stick to reading and learning and I recommend academic sources, those are usually the least biased ones. Some academics also have great literature for audiences such as yourself, where they break down a lot of info in a very digestable format.\n\nOverall, the best thing you can do is teach yourself some 'psychological hygiene' when it comes to digesting info over the internet or from whatever sources. Learn how to identify things that help you instantly rule out certain narratives and trading recommendations. In the long run, that's probably one of the most important skills you can aquire. \n\nOh and don't ever take any financial advice over the internet literally, lol. Better think about what you read or just read and take some time to think about it. If you feel slight uncertainty then try to debate it (but be polite of course), that's what the internet is for. Do that for a year or two and you will probably already have the ability not to buy into many money traps that a lot of people are unlucky to have fallen into. Does something sound tempting? Question it, be sceptic, try a scientific approach, and more importantly: question your own theories. Just my two cents, it might come in handy.", "score": 1, "replies": []}, {"body": "Sounds like a ponzi.", "score": 1, "replies": []}, {"body": "All current economic systems are based on more people consuming more stuff. I think it will only end when we get to the point of economic rationalization and “cheap” stuff goes away.", "score": 1, "replies": []}, {"body": "It's \"population growth\", not \"overpopulation\". The latter is a bad thing and causes the economy to go down.", "score": 1, "replies": []}, {"body": "this is on par with the post looking for a play based on future road maintenance budget glut because of a hypothetical road tax charged by electricity companies due to the rise of EVs and their heavy batteries fucking up the roads...", "score": 1, "replies": []}, {"body": "Overpopulation? Birth rates are near suicidal in many developed nations.  \n\nSure, Africa is growing but that growth necessarily slows as people become wealthy.  \n\n\nI agree with your premise. More wealth and more people is good. But we're not going to compound. People stopped worrying about that like 25 years ago.", "score": 1, "replies": []}, {"body": "What", "score": 1, "replies": [{"body": "Also, lol", "score": 1, "replies": []}]}, {"body": "Whether population continues to grow or not, the direction for financial markets will remain up over the long haul. \n\nWe’ve always measured GDP, which population growth helps. But technology gains offer so much in the way of efficiency that even if GDP leveled out due to zero population growth, Net Growth is still possible. \n\nThere is so much inefficiency in the way humans do everything, still in 2023. Improving that will be radically profitable, population growth or not. I wouldn’t be surprised if NDP is the more common metric in 100 years.", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Thread - September 25, 2023", "selftext": "&#x200B;\n\nhttps://preview.redd.it/sgow0gb5qcjb1.png?width=1024&format=png&auto=webp&s=66b946e6eb58829619e7609470913a0f2c785343", "id": "16rfnvu", "created_utc": 1695607809.0, "score": 35, "upvote_ratio": 0.93, "num_comments": 324, "comments": [{"body": "I've once again come to the conclusion that I need to make more monies at work", "score": 21, "replies": [{"body": "Ya same, had that realization when bird shit happened 🥹", "score": 8, "replies": []}, {"body": "![gif](giphy|l1KvQsIfNt9wRStWw)", "score": 5, "replies": []}]}, {"body": "Soooo I ordered a  model y with delivery for October 11-20. Couldn’t find any inventory in my area. \n\nHeres my contribution to q4. Q4 will save us", "score": 21, "replies": [{"body": "Thanks brother", "score": 11, "replies": []}]}, {"body": "Ford $F said today it has paused work on a $3.5 Billion battery plant in Michigan, citing concerns about its ability to competitively operate the plant - Reuters", "score": 22, "replies": [{"body": "https://www.reuters.com/business/autos-transportation/ford-pauses-work-35-billion-battery-plant-michigan-2023-09-25/?utm_source=reddit.com\n\nArticle says they're waiting to confirm if they will be eligible for the IRA.", "score": 5, "replies": []}, {"body": "Keep making those engines, UAW", "score": 5, "replies": []}, {"body": "Ouch", "score": 2, "replies": []}]}, {"body": "Cory Steuben starting at Lucid.   https://x.com/CorySteuben/status/1706384110216941734?s=20", "score": 17, "replies": [{"body": "🤡 brb posting unedited Munro video to include him ranting about China and how Xi is a brilliant leader", "score": 13, "replies": []}, {"body": "Must be down bad", "score": 10, "replies": [{"body": "Like when arcimoto hired Munro and gali. Trap for retail investors.", "score": 18, "replies": []}]}, {"body": "Yikes.\n\nGet that $", "score": 10, "replies": []}, {"body": "🤡🤡🤡", "score": 8, "replies": []}, {"body": "Ah yes, lucid.With a bullshit title to boot (not a knock on him but lucid, as they have some goofy ass titles). I hope he got a nice fat upfront payout though.\n\nI’m sure he’ll learn a lot but odds of one man turning around that ship gonna be tough.", "score": 9, "replies": []}, {"body": "💀☠️", "score": 7, "replies": []}, {"body": "Didn't see that one coming.", "score": 8, "replies": []}, {"body": "lmao", "score": 10, "replies": []}, {"body": "honestly though why would he take this position?  bankruptcy looming, saudi backed, high stress.  he's gonna regret this.", "score": 11, "replies": [{"body": "I’m going to assume he was given a very nice compensation package considering how fast he packed up and moved across the country. On top of that, add a challenge he wants to try to solve. \n\nHe said his job is “Assistant Chief Engineer, Midsize,” which sounds like a Model Y-like car. I bet a guy like Cory would love the challenge to help Lucid bring a car to market that actually… has a chance at being profitable.", "score": 13, "replies": [{"body": "here's 20,000 lcid shares of which we will soon dilute.", "score": 14, "replies": []}]}, {"body": "maybe they have nice dental insurance & 401k match", "score": 7, "replies": [{"body": "Sure, but their severance package can really tear people apart", "score": 6, "replies": [{"body": "nice", "score": 4, "replies": []}]}]}]}, {"body": "assistant chief 🤡, midsize", "score": 7, "replies": [{"body": "![gif](giphy|zDxDq6KN3CwGzAzpT6|downsized)", "score": 12, "replies": []}]}, {"body": "Saudi Shill", "score": 5, "replies": []}]}, {"body": "[https://www.reddit.com/r/electricvehicles/comments/16s27c9/convince\\_me\\_not\\_to\\_buy\\_a\\_tesla\\_model\\_y\\_or/](https://www.reddit.com/r/electricvehicles/comments/16s27c9/convince_me_not_to_buy_a_tesla_model_y_or/)\n\nlol", "score": 16, "replies": [{"body": "Doesn’t like how tesla treats it’s workers… considering Hyundai/Kia which treat their child laborers very well.", "score": 10, "replies": []}]}, {"body": "P and D in one week? 🙏", "score": 15, "replies": [{"body": "2nd is very likely.", "score": 5, "replies": [{"body": "It would be the first P&D release on a trading day since July 2, 2021. Should be exciting…", "score": 5, "replies": [{"body": "Has been a while, yeah.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "No, thats every week /s", "score": 4, "replies": []}, {"body": "![gif](giphy|3orieTfp1MeFLiBQR2)", "score": 3, "replies": []}]}, {"body": " [(112) UAW: Past Its Prime : GMemployees (reddit.com)](https://www.reddit.com/r/GMemployees/comments/16pn92w/uaw_past_its_prime/) \n\n![gif](giphy|NipFetnQOuKhW)", "score": 14, "replies": [{"body": "\"No way in hell I'm reading all that\" Lol, ok, just stick to putting nuts in bolts then? You just underscored the OP's argument.", "score": 10, "replies": []}, {"body": "\"condom knitters\" got me dead", "score": 9, "replies": []}, {"body": "Almost like I wrote this article myself.", "score": 5, "replies": []}]}, {"body": "https://twitter.com/julianibarz/status/1706173634505834605?t=n-A_c9_8HLSJ3g5wqa0zjA&s=19\n\nBullish", "score": 13, "replies": []}, {"body": "2024 - The robots are coming.\n\n2034 - The robots are cuming.", "score": 13, "replies": [{"body": "end to end ass to ass", "score": 8, "replies": []}, {"body": "What are they doing with my cumin", "score": 4, "replies": []}]}, {"body": "https://preview.redd.it/6ynoo6ttzeqb1.jpeg?width=4032&format=pjpg&auto=webp&s=6774a193108dd202fe3fff58629eca2f9571c27b\n\nAs noted by Greggertruck this CT looks ready for prime time.\n\nLabeling, refinements, and recovery hooks.\n\n[https://x.com/greggertruck/status/1706318528091918542?s=46&t=yWmMeP08cyApbkkhK1zkcw](https://x.com/greggertruck/status/1706318528091918542?s=46&t=yWmMeP08cyApbkkhK1zkcw)", "score": 12, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Needs 200 gwh of batteries or 4 to 5 x giga Nevada lmaoo", "score": 4, "replies": []}, {"body": "For the sake of my late order YES PLZ!!", "score": 3, "replies": []}]}, {"body": "Plastic on seats is a good sign", "score": 7, "replies": [{"body": "👌", "score": 3, "replies": []}]}, {"body": "https://preview.redd.it/2e852o620fqb1.jpeg?width=1284&format=pjpg&auto=webp&s=af92d35edb0a8ebebcfc18b10a8341fa0950ceae", "score": 8, "replies": []}, {"body": "is that the performance version with parachute deploy?", "score": 4, "replies": [{"body": "Deploys a wind turbine to regen", "score": 3, "replies": []}]}, {"body": "Are they sandbagging us, are we going to get a midgate? Inquiring minds want to know", "score": 1, "replies": []}]}, {"body": "Youtuber I watch mentioned if the government shutdown is prolonged, we may not get CPI datapoints.\n\nBest CPI is no CPI?", "score": 12, "replies": [{"body": "CPI is fine, best FED is no FED.", "score": 9, "replies": [{"body": "What Ron Paul has been saying all along", "score": 3, "replies": []}]}]}, {"body": "So the old man (with all due respect), famously said, \"The stock market is a device to transfer money from the 'impatient' to the 'patient'.” And many other clever analogies that drive home the same point. Pretty much universally heralded by Wall Street. But not followed since money managers don't get paid to be patient, they get paid to be impatient and be in perpetual movement (seeking alpha! they claim)\n\nBut we don't have to be impatient. We don't have to chase that 10 yr rate. Or whatever the cyclical play of the day is. So we can wait this thing out if we truly believe it has the most potential of any play out there.\n\nSome CNBC guy said, well the cost of people, money, energy have all gone up and those are the things every company needs and margins are getting squeezed. Makes sense. But if this Optimus bet works out, then Tesla will have enormous leverage in all those areas. And the car play alone is working out nicely so if that's plan B then I'll take it.\n\nI'm a money manager of 1, and I don't need mediocre/good returns every quarter or even year. I just need extraordinary results every couple years. And even better if it can come from the same source so I don't have to reallocate every few years. So I feel good about the now and the future.\n\nTL:DR, listen to the old man.", "score": 13, "replies": [{"body": "Well I'm certainly not selling while fed crushes margins and stock multiple", "score": 7, "replies": []}, {"body": "Yep. For those still accumulating, as long as Tesla continues to perform, shares are forever and should do well in the long term. Any short term (even possibly medium term) options are just lotto tickets with macro. \n\nI do the selling options thing because I’ve already made enough and now my main goal is to not lose money. Making more is a nice little side quest. Something I wish I figured out at the peak lol.", "score": 6, "replies": []}, {"body": "![gif](giphy|12m6YBQBVVPMK4)", "score": 5, "replies": []}, {"body": "You say listen to the old man but he doesn't invest in Tesla, so you mean take information that supports your narrative and listen to that right?", "score": 3, "replies": [{"body": "whatever makes you happy", "score": 3, "replies": []}, {"body": "Warren Buffett seems to value stability in the underlying business and business leadership.  Apple is a good example.  Snowflake is another (volatile stock, but steady leadership).  I've not heard of BYD's leadership going out of their way to rock the boat. \n\nElon Musk is mercurial, mentally unstable, and deliberately stirs up controversy when it suits him regardless of consequences.  He's declared that he will push profit margins to zero if necessary as part of a gamble to get the most and best data for FSD training.  He's promised FSD every year for 7 years, and we still don't have an idiot-proof FSD system.\n\nBuffett's advice is still applicable to Tesla IMO.  But his specific advice for patience, applies to companies that he deems are fundamentally undervalued.  Tesla is impossible for someone like him to value with a good degree of certainty, because of its lofty goals and Elon Musk's behavior.", "score": 2, "replies": []}]}]}, {"body": "lol these experts \n\nToday, the policies coming from Washington are heavily skewed toward two sectors: semiconductors and electric vehicles.\n\nLinicicome argues the government should not be playing favorites with industries. “Politicians and bureaucrats are ill-suited to pick winners in the market,” Lincicome said. “We are headfirst into electric vehicles today and we’re running the risk of pushing a technology that isn’t quite ready for prime time and in the process sidelining a technology that maybe turns out to be a better approach.”\n\nEVs not ready for prime time and hydrogen might be sidelined! clown clown clown", "score": 12, "replies": [{"body": "I agree, we should stop favoring industries, only maintain incentives for climate health and let the businesses prove themselves. Mainly, we should stop giving 9B loans to failing auto companies under the guise of an EV transition...", "score": 8, "replies": [{"body": "Hmm it's true legacy evs are not ready for prime time", "score": 4, "replies": [{"body": "Bingo Linicicome is a secret Tesla bull obvi.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "The barrier to commercialization seems way less than FSD.\n\nWe don't need bots to be able to do everything to be useful.  Can be very specific tasks in controlled settings.\n\nI guess the issue is they're competing with other robotics.  Robotics in factories / warehouses aren't new, but still there must be huge applications for bots that can be realized fairly quickly.", "score": 11, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "![gif](giphy|7xbUcQrTUSJHO)", "score": 4, "replies": []}]}]}, {"body": "Folding laundry will be the Chuck Cook Unprotected Left Turn for robot IMO. Nail that and it will be massively useful.", "score": 8, "replies": [{"body": "Turing test will be if it’s working at express and stuffs a dress shirt that’s too hard to fold deep between the folded clothes.", "score": 2, "replies": []}]}, {"body": "It comes down to how many complex goals the bot can perform for lazy humans. We'll be 10x if it can make me a cup of coffee and bring it to my office every morning. I think we're about a decade away from that.", "score": 6, "replies": [{"body": "Bringing it to your office might be challenging but a robo barista who just stands there and makes hundreds of cappuccinos an hour is a lot easier.\n\nReplacing minimum wage workers is the real 💰💰", "score": 7, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "This task does seem easy according to our biological brain.", "score": 4, "replies": []}]}, {"body": "A decade away from loading a pod into a Keurig, then bringing a spill proof mug to you? \n\n🐻", "score": 3, "replies": [{"body": "yeah, it has a ton of complex sub-steps that require fine-tuned and advanced hardware and software. My office is in the basement BTW.", "score": 3, "replies": [{"body": "Yes, fair. Less than ideal circumstances would make it harder to accomplish. However, the robot can use precision in it's fingers to press, place objects, and grasp. I think they could do a coffee making demo today. I think it could be done sooner in an office environment, for example, where things are a bit less convoluted.", "score": 3, "replies": []}]}]}]}, {"body": "Properly functioning can mean a lot of things. I'm sure there's a job around that deals with sorting that the bot could theoretically already replace. Give it another 6 months, and it could probably replace a few more job... with enough time, exponential things start to happen. Without any substantial knowledge, I think it will happen quicker than most think.", "score": 4, "replies": []}, {"body": "Your optimism about AI isn’t misplaced. Take MuZero for instance. It outperformed AlphaGo in just 12 hours of training. We’re talking about mastering complex games without even being told the rules. And that was on old TPU hardware; we’re now at version 5. This kind of exponential improvement isn’t just academic—it’s likely to have real-world applications, potentially accelerating Full Self-Driving for Tesla. So, whether it’s folding laundry or eventually performing complex tasks, we could be closer to those milestones than most people think.", "score": 2, "replies": []}, {"body": "Your optimism about AI isn’t misplaced. Take MuZero for instance. It outperformed AlphaGo in just 12 hours of training. We’re talking about mastering complex games without even being told the rules. And that was on old TPU hardware; we’re now at version 5. This kind of exponential improvement isn’t just academic—it’s likely to have real-world applications, potentially accelerating Full Self-Driving for Tesla. So, whether it’s folding laundry or eventually performing complex tasks, we could be closer to those milestones than most people think.", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/3go4t2wiyeqb1.jpeg?width=4032&format=pjpg&auto=webp&s=e8fa3158a63ce443e4195aa1d0ff314d23372a08\n\nProduction employees back at Giga Texas!\n\n[https://x.com/joetegtmeyer/status/1706317453985243158?s=46&t=yWmMeP08cyApbkkhK1zkcw](https://x.com/joetegtmeyer/status/1706317453985243158?s=46&t=yWmMeP08cyApbkkhK1zkcw)", "score": 13, "replies": [{"body": "Q4 will save us", "score": 8, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "![gif](giphy|4ZMsXG1uh6cZTo1F9Y)", "score": 3, "replies": []}, {"body": "Unless you are this guy.... neat rig!!\n\n&#x200B;\n\nhttps://preview.redd.it/95x3od4f8fqb1.png?width=508&format=png&auto=webp&s=f343282d379812a2f8d0cab4ca832496c44558e8", "score": 0, "replies": []}]}, {"body": "https://preview.redd.it/w9id9pjryeqb1.jpeg?width=3733&format=pjpg&auto=webp&s=b4e60111e441361d6fd8225b49ee5fa4c9d4fb62", "score": 3, "replies": [{"body": "I like to see it", "score": 2, "replies": []}]}, {"body": "Back to the mines slaves! And don't even think about unions!", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/13c5bzlw4gqb1.jpeg?width=2024&format=pjpg&auto=webp&s=ae2672bf82bc1eedf110905d2f853b13412029f0\n\nThis thing is a beast!", "score": 12, "replies": [{"body": "Sexy!", "score": 3, "replies": []}, {"body": "the upper part on the rear door looks huge", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "I concure.", "score": 4, "replies": []}]}, {"body": "me waiting for Cytruck delivery event details\n\n![gif](giphy|5wWf7H0qoWaNnkZBucU)", "score": 10, "replies": [{"body": "✅ username checks out", "score": 5, "replies": []}]}, {"body": "[https://twitter.com/DeItaone/status/1706305772630512035](https://twitter.com/DeItaone/status/1706305772630512035)\n\nNow you're getting it...", "score": 10, "replies": [{"body": "Chip permabull, drove by fremont saw lots of cars.  BUY", "score": 7, "replies": [{"body": "While he's being a bit silly, I do think Tesla beats the 20/80 market share vs market profit of apple. I don't really see any current player surviving the transition other than BYD. All other major OEMs (probably BYD included) will end up like government space programs, completely kept functioning by their respective governments, while Tesla is the only major private sector player like SpaceX.", "score": 4, "replies": []}]}, {"body": "https://i.redd.it/5olzi0gtqeqb1.gif", "score": 4, "replies": []}, {"body": "TSLA Lounge Research agrees", "score": 5, "replies": []}, {"body": "Been a while since we had a good Tripp looking through the Fremont fence report", "score": 4, "replies": []}, {"body": "They lost me at “demand for model S is off the charts”", "score": 4, "replies": [{"body": "Off the charts low💩", "score": 2, "replies": []}]}, {"body": "LFG", "score": 3, "replies": []}, {"body": "Until P/D", "score": 3, "replies": []}]}, {"body": "What do you think would happen to NVDA if they had released the exact same bot video instead?", "score": 9, "replies": [{"body": "Why it would be like tesla if it didn't overpromise and underdeliver on fsd since 2013", "score": 8, "replies": [{"body": "He's not been quite that bad.  Almost though.  Elon's first claim for coast-to-coast autonomy was actually October 2016, almost 7 years ago: [https://web.archive.org/web/20161204172353/https://www.wired.com/2016/10/teslas-self-driving-car-plan-seems-insane-just-might-work/](https://web.archive.org/web/20161204172353/https://www.wired.com/2016/10/teslas-self-driving-car-plan-seems-insane-just-might-work/)\n\nIn 2013, Autopilot 1.0 (Mobileye platform) wasn't yet available.  Tesla began installing Mobileye based driver assist hardware on Model S in late 2014.  Autopilot was formally announced at the Model S P85D launch event in October 2014 ([https://www.roadandtrack.com/new-cars/news/a6358/first-look-tesla-model-s-p85d-dual-motor/](https://www.roadandtrack.com/new-cars/news/a6358/first-look-tesla-model-s-p85d-dual-motor/))", "score": 10, "replies": []}, {"body": "I feel like we are the red headed step child at times with good reason.", "score": 9, "replies": [{"body": "Yes we deserve it", "score": 3, "replies": []}]}]}]}, {"body": "I’m still disturbed by this missing bike", "score": 9, "replies": [{"body": "Keeps me up at night.", "score": 2, "replies": []}]}, {"body": "https://twitter.com/SawyerMerritt/status/1706399133391605982?t=mIcRgY3RshG4p-17_2kGyw&s=19\n\nWorld leader tour", "score": 10, "replies": [{"body": "2 more kids inbound", "score": 11, "replies": [{"body": "it's best for humanity", "score": 5, "replies": []}, {"body": "She certainly looks hungry for something", "score": 2, "replies": []}]}, {"body": "that's our boy!", "score": 5, "replies": []}, {"body": "Is she right wing", "score": 1, "replies": [{"body": "Hungarian Civic Alliance (Hungarian pronunciation: [ˈfidɛs]; Hungarian: Fidesz – Magyar Polgári Szövetség) is a right-wing populist and national-conservative political party in Hungary, led by Viktor Orbán.", "score": 2, "replies": []}]}]}, {"body": "[https://youtu.be/u3PEsd3Pl0U?t=618](https://youtu.be/u3PEsd3Pl0U?t=618)\n\nomg is the entrance finally done?\n\ncyberberms + plaid arches + glass wall + marble walkway\n\n🔥🔥🔥", "score": 9, "replies": []}, {"body": "Currently working at 2 jobs while studying at the same time because I had to give my months notice (It's a calender month in the Netherlands) but had to start my internship early, haven't had a single free day for 1,5 weeks and won't have one until the 1st of October. Pray for me!", "score": 9, "replies": [{"body": "I bet they don’t give you a months notice when you get fired or laid off… not fair. Don’t burn any bridges though", "score": 4, "replies": [{"body": "It's quite annoying, I worked for Nestle so no way they are letting me go early lol, maximum value baby!", "score": 2, "replies": [{"body": "Can't you just quit the internship?\n\nIt's an internship, not a job.", "score": 1, "replies": [{"body": "Why would I quit an internship when I voluntarily went into contract to gain valuable experience? Not everything is about money...", "score": 1, "replies": []}]}]}]}, {"body": "Should be a good couple paycheques at least", "score": 3, "replies": [{"body": "For next month yeah, but I am taking a pay cut for the internship.", "score": 2, "replies": []}]}, {"body": "You'll make it!", "score": 2, "replies": []}]}, {"body": "I'm back from Eurotrip '23. It was amazing, tried to stay away from all interneting and stock market bullshit and just relax, enjoy, and be in the moment, so that was great for the mental state. First day back at work and I feel like a stranger in a strange land, definitely gonna take time to get back adjusted to \"normal\" life.\n\nAnyways, hope everyone is doing good, and now I will resume commenting on stocks going up and down for mysterious reasons,  and all the other usual lounge activities.", "score": 17, "replies": [{"body": "Hope u had a nice time w the frauleins", "score": 4, "replies": [{"body": "there was some eye popping dirndl action at Oktoberfest for sure!\n\nno frauleins for me though, as the gf was with. But I found out shes a great travel partner, she gets it, is chill and relaxed and was enjoyable to be around- unlike some other people in our group that were constant complainers or pains in the asses. I lost count of how many times I had to remind them that we were on vacation and were supposed to be relaxed and having fun- and not getting pissed off and cranky or in a frenzied rush to do shit.", "score": 4, "replies": [{"body": "Took my wife and I awhile to realize we didn't need to rush to get somewhere so we could relax lol\n\nWe're used to moving at a pretty quick pace and that's a bit silly when traveling on vacation", "score": 2, "replies": [{"body": "i'm fine with a quick pace.... its just at some point its like the other people in our group were just wanting to frantically rush to points a,b,and c just to say they saw it and take a few pictures, to me at that point you are missing the point of travel. Americans are very guilty of this I think, we do don't know how to slow down and relax and enjoy life like Euros know how to do.", "score": 3, "replies": []}]}]}]}, {"body": "Leaving for my Europe trip in a few weeks ! Looking forward to doing the same.", "score": 5, "replies": [{"body": "have fun!\n\nheres two tips i can say really help:\n\n1. Piss every time you go to a restaurant or bar, regardless if you have to go. Finding a toilet and/or one you want to use can be a struggle and you usually have to pay to use it unless you patronized the establishment.\n2. Buy the local pass or whatever its called if you are doing the common tourist sites and museums it really is worth while in terms of time and money to skip the lines and bs.", "score": 8, "replies": [{"body": "Paying a euro to shit somewhere clean is so much better than americas free shitholes", "score": 4, "replies": [{"body": "Yeah I'll co-sign that. Although sometimes even the paid ones were not clean. But as a rule yes they are cleaner than Americans free ones. But we do have more of them available usually.", "score": 4, "replies": []}, {"body": " Mexico usually requires paying to shit somewhere dirty", "score": 1, "replies": []}]}, {"body": "Gr8 tips", "score": 2, "replies": []}]}]}, {"body": "Can’t wait welcome back!", "score": 5, "replies": []}, {"body": "❤️❤️❤️❤️❤️", "score": 5, "replies": []}]}, {"body": "🤖🚀", "score": 8, "replies": []}, {"body": "![gif](giphy|WdOlyL35LPDFQ5UQLf|downsized)", "score": 8, "replies": [{"body": "Hi Denver, sorry for humiliating you.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I have a 114 and 113, both are showing tri motor w/ FSD still", "score": 2, "replies": []}, {"body": "When tesla enthusiasts try to predict the future like the Romans did with chicken guts.", "score": 1, "replies": []}, {"body": "Mine also no longer with specifications. Also a 112.", "score": 1, "replies": []}]}, {"body": "Can't wait for my 50% off everything trip to Japan...", "score": 8, "replies": [{"body": "Warren Redlich moment", "score": 6, "replies": [{"body": "I'm not looking for a new life lmao.", "score": 1, "replies": []}]}, {"body": "Explain? We wanted to go next year", "score": 2, "replies": []}, {"body": "50% off... so return ticket not included? Take care, and ride the green line to its end station in Tokyo.. .. hehehe..", "score": 2, "replies": []}, {"body": "Omg I’m going on that 1/2 off trip too over new years for 3 weeks!\n\nI took our 3k in Yen (I never ever do this normally) just to lock in 146 💴 to $\n\nEven if it’s up to 160+ (which I doubt) I’m happy to get that 50%", "score": 3, "replies": [{"body": "Where did you take it out at 146 without being physically in Japan? The rate of purchase at most places here gets me 136 at best. I was actually going to have friends in Japan buy the Yen for me lol.", "score": 3, "replies": [{"body": "Well yes technically I got it at 136 (it was 146 at the time on market price).\n\nRegardless though the conversion fee anywhere will be equivalent (even on credit card).\n\nAt this point if you are going in the next 2+ week - the question to ask is whether u want it at the 50% discount or risk a BOJ intervention (which still is in the cards).\n\nThe conversion fee your friends would get still would amount to similar amount.\n\nI already booked all our Airbnb’s, flights, etc.\n\nI’m SO EXCITED about the discount 😎", "score": -1, "replies": [{"body": "Right, that's what I thought. FYI the best option is a Schwab Checking account used with an ATM while actually IN Japan + no fee credit cards while in Japan. While out of Japan you're gonna eat that 10% unfortunately.", "score": 1, "replies": [{"body": "Agree. Fidelity the same. But you still have to pay conversion fees - no way to get around it.\n\nThis is to avoid a foreign transaction fee. Which most travel cards or account like u mentioned.\n\nThe banks have to make money from the money exchange somehow 🙈", "score": 0, "replies": []}]}]}]}]}]}, {"body": "we're gonna call that a win", "score": 7, "replies": [{"body": "yup nice curl up at the end", "score": 4, "replies": []}, {"body": "What happened last minute?", "score": 2, "replies": [{"body": "algo shake out", "score": 3, "replies": []}]}]}, {"body": "Been looking into AI, and found a cool thing about  MuZero. This algorithm trained for just 12 hours and outperformed AlphaGo, which represented years of iterative research and development. That’s like going from a tricycle to a rocket ship overnight. Tesla’s agility means they’re poised to capitalize on these types of lightning-fast advancements, particularly for FSD and their upcoming bot. Version 12 of FSD is a great example. Bullish!", "score": 8, "replies": []}, {"body": "I hate marketing departments but hurts more to think how dominant Tesla could be rn if they started growing brand value/advertising/educating a year or two ago. \n\nTeslas should be flying off the shelves at these prices, especially in some specific states. Instead they've displaced the camry and prius to become the choice of taxi operators because your avg person is so naive and misinformed on them", "score": 15, "replies": [{"body": "\"If they are not aware then they don't deserve the car\" - Elon (maybe)", "score": 11, "replies": []}, {"body": "Yah we know", "score": 10, "replies": []}, {"body": "> Teslas should be flying off the shelves at these prices, especially in some specific states.\n\nWhat is the inventory left in those states?", "score": 1, "replies": [{"body": "Prices are at the point where supply equals demand. Doesn't matter to me if Tesla sells their cars evenly across 50 states or all in one state", "score": 1, "replies": []}]}]}, {"body": "world leaders lining up to meet elon & discuss the future\n\nmeanwhile back in washington:\n\n![gif](giphy|Io4FqkTWHlAt091rye|downsized)", "score": 14, "replies": [{"body": "Hey boy, you’re just a dog faced pony soldier man", "score": 3, "replies": []}, {"body": "biden needs a nappy poo", "score": 3, "replies": []}, {"body": "Poor Donald", "score": 0, "replies": []}]}, {"body": "It's on baby!", "score": 6, "replies": []}, {"body": "🌚", "score": 8, "replies": []}, {"body": "Testing the $250 today, let’s go Monday pop", "score": 8, "replies": []}, {"body": "Elon coming up quite a few times at this bioengineering conference I'm at.", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Solar roofed", "score": 3, "replies": []}]}]}, {"body": "We're green.\n\nGood.", "score": 6, "replies": [{"body": "Tesla bot got access to bloomberg terminal", "score": 8, "replies": []}, {"body": "If only we could be as green as Rivian, a company who's future is still way less secure than Tesla's!", "score": 3, "replies": []}]}, {"body": "Q4 should save us, for reals this time", "score": 11, "replies": [{"body": "Berlin production line upgrades enter the chat", "score": 7, "replies": [{"body": "I think they already gave up on that", "score": 10, "replies": [{"body": "Q4 will save us it is.", "score": 9, "replies": []}]}]}, {"body": "q4 of which year? asking for a friend", "score": 4, "replies": [{"body": "2023 maybe 2024 definitely", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "And that’s with another jump in the 10yr to >4.5%", "score": 3, "replies": []}]}, {"body": "Added in pre", "score": 6, "replies": []}, {"body": " ☠️", "score": 6, "replies": [{"body": "Fooked", "score": 3, "replies": []}, {"body": "Cc’s gonna pan out", "score": 3, "replies": [{"body": "Need more CC talk to taunt the market into going up. Where's basement's CC at? Will he come back if they get out of jail?", "score": 4, "replies": []}]}]}, {"body": "Inventory near 0 for model Y in my area. Was over 200 few weeks back", "score": 5, "replies": [{"body": "Austin no longer producing still?", "score": 4, "replies": []}, {"body": "Damn!!!", "score": 3, "replies": []}, {"body": "Model Y around me inventory discount by $4k but also in transit lol. Discounting them before they hit the lots.", "score": 2, "replies": []}, {"body": "Only 6 MYs in GA. FL still has 44.", "score": 1, "replies": []}]}, {"body": "![gif](giphy|14ceV8wMLIGO6Q)", "score": 6, "replies": []}, {"body": "https://x.com/garyblack00/status/1706336242562936889?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nYeah, no.", "score": 6, "replies": [{"body": "Prolly a bear trying to set high expectations gojo style", "score": 6, "replies": []}, {"body": "None of these people know anything because nobody knows US numbers. US was the major wildcard in the Q2 blowout. China is a bit lower and EU is a bit higher this quarter. It all comes down to US again.", "score": 6, "replies": [{"body": "Will be interesting to see what the data out of China looks like tonight. My expectations aren’t super high but I believe it’s the first week with new Model 3 sales (might not be a full week and it’s my understanding they’ve also focused on exports because they make more money on exported vehicles)", "score": 3, "replies": [{"body": "Ah maybe that's the come and good news lol.", "score": 4, "replies": [{"body": "Will coming 🙏🙏🙏", "score": 1, "replies": []}]}]}]}]}, {"body": " .　　　　　　　　　　 ✦ 　　　　   　 　　　˚　　　　　　　　　　　　　　\\*　　　　　　   　　　　　　　　　　　　　　　.　　　　　　　　　　　　　　. 　　 　　　　　　　 ✦ 　　　　　　　　　　 　 ‍ ‍ ‍ ‍ 　　　　 　　　　　　　　　　　　,　　   　  .　　　　　　　　　　　　　.　　　ﾟ　  　　　.　　　　　　　　　　　　　.  　　　　　　　　　　　　.　　　　　　    　　　　 　　 🌑　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　    　      　　　　　　　        　　　　　　　　　　　　　. 　　 　　　　　　.　　　　　　　　　　　　　. 　　　　　　　　　　　　　　　　       　   　　　　 　　　　　　　　　　　　　　　　       　   　　　　　　　　　　　　　　　　       　    ✦ 　   　　　,　　　　　　　　TSLA,　　　    🚀 　　　　 　　,　　　 ‍ ‍ ‍ ‍ 　 　　　　　　　　　　　　.　　　　　 　　 　　　.　　　　　　　　　　　　　 　           　　　　　　　　　　　　　　　　　　　˚　　　 　   　　　　,　　　　　　　　　　　       　    　　　　　　　　　　　　　　　　.　　　  　　    　　　　　 　　　　　.　　　　　　　　　　　　　.　　　　　　　　　　　　　　　\\* 　　   　　　　　 ✦ 　　　　　　　         　        　　　　 　　 　　　　　　　 　　　　　.　　　　　　　　　　　　　　　　　　.　　　　　    　　. 　 　　　　　.　　　 　🌎　　   　　　　　.　　　　　　　　　　　.　　　　　　　　　　   　  　˚　　　　　　　　　　　　　　　　　　　　　ﾟ　　　　　.　　　　　　　　　　　　　　　. 　　 　 ‍ ‍ ‍ ‍ ‍ ‍ ‍ ‍ ‍ ‍ ,　 　　　　　　　　　　　　　　\\* .　　　　　 　　　　　　　　　　　　　　.　　　　　　　　　　 ✦ 　　　　   　", "score": 10, "replies": []}, {"body": "TIME FOR OPTIMUS PAMP 😤😤😤", "score": 10, "replies": []}, {"body": "When moon", "score": 5, "replies": [{"body": "yes", "score": 2, "replies": []}, {"body": "2034", "score": 2, "replies": []}]}, {"body": "Ten year rate got talked up by the fed just like they wanted. Now we gonna suffer more.", "score": 6, "replies": []}, {"body": "Not bad", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "You have a deal.", "score": 5, "replies": []}]}]}]}, {"body": "OpenAI now finally adding the feature to have a real conversation with ChatGPT, by audio in- and audio output.\n\nhttps://openai.com/blog/chatgpt-can-now-see-hear-and-speak", "score": 5, "replies": [{"body": "Ok but only if it can do scarjo voice", "score": 7, "replies": []}, {"body": "Yeah but when will siri turn off the light I want it to?", "score": 3, "replies": []}, {"body": "Been waiting for this para practicar mi español. Gracias amigo", "score": 2, "replies": []}]}, {"body": "[Ford, $F, halts work on $3.5 billion EV battery plant in Michigan](https://twitter.com/unusual_whales/status/1706425387394474023?t=SH-DGil5Bq0jVQj70xsbLw&s=19)", "score": 5, "replies": [{"body": "Competition is not coming", "score": 9, "replies": [{"body": "Competition came and went", "score": 3, "replies": [{"body": "Hey, PE happens to the best of us", "score": 2, "replies": [{"body": "Competition got horny but customers said they had a headache.", "score": 2, "replies": [{"body": "Manual car for the win.", "score": 1, "replies": []}]}]}]}, {"body": "Trip’s 90% EV market share (at least in US) doesn’t seem so crazy", "score": 1, "replies": []}]}]}, {"body": "Doesn’t sound like a deal is close - https://x.com/stockmktnewz/status/1706443049205706771?s=46&t=WyhsS8WzmgKtgEuHZzFOrA", "score": 5, "replies": [{"body": "Agreement talks failed again", "score": 3, "replies": []}, {"body": "Oof.", "score": 2, "replies": []}]}, {"body": "They need to have an AI day where the bot does the dance the costumed bot did", "score": 10, "replies": []}, {"body": "Multi-day hike in the Alps.\n\nCold German Weißbier in the mountain hut.\n\nLife is good.\n\nThe red will pass, TSLA is setting up for the long haul.", "score": 9, "replies": [{"body": "Sounds incredible!!!! Nicely done.\n\nAbout to go on 3 day arctic circle hike with family.\n\nLife is beautiful ⛰️🏔️", "score": 1, "replies": [{"body": "Good.\n\nHiking = Life.", "score": 4, "replies": []}]}]}, {"body": "Soon 300+\n\nI feel it", "score": 9, "replies": [{"body": "Faptradomus has spoken\n\nI mean it too, believe this guy", "score": 4, "replies": []}]}, {"body": "Monday moon why has u abandoned us", "score": 9, "replies": [{"body": "Monday moon could be the reason why we are not more dead lol", "score": 8, "replies": [{"body": "Yeah, everyone said wed be down bigly today", "score": 1, "replies": []}]}]}, {"body": "We need another silicon valley bank to sacrifice itself to stop the 10 year", "score": 11, "replies": [{"body": "150k good payin union jobs that need to go full SVB.", "score": 8, "replies": []}]}, {"body": "![gif](giphy|x47gj23jEvGxdWkQEC|downsized)", "score": 4, "replies": []}, {"body": "[Looks like some regarded attempt at a Lucid × Tesla M3 lmfaoo](https://twitter.com/SawyerMerritt/status/1706430507360158150?t=BgARpMfrvpWnF4BOWDOZMA&s=19)", "score": 5, "replies": []}, {"body": "Anyone remember that dude who let sandy buy his Texas model y? Someone have a link to his YouTube channel?", "score": 7, "replies": [{"body": "Good people", "score": 1, "replies": []}]}, {"body": "We gotta be getting due for another 5-10% round of layoffs", "score": 7, "replies": [{"body": "Standard op procedure", "score": 5, "replies": []}, {"body": "Trim the fat.", "score": 4, "replies": []}, {"body": "It's only been like 15 months since the last one...", "score": 3, "replies": []}, {"body": "Why?", "score": 2, "replies": [{"body": "Mostly kidding but we've never not had a round of big layoffs every 2ish years or so from what I remember", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They've always been expanding a lot", "score": 3, "replies": []}]}]}, {"body": "Feels bad", "score": 3, "replies": []}, {"body": "MMs getting what they want. Interesting.", "score": 3, "replies": [{"body": "They usually do.", "score": 1, "replies": []}]}, {"body": "CNBC Pro headline: Tesla third-quarter deliveries will likely miss consensus expectations, Barclays predicts", "score": 3, "replies": [{"body": "Production low but inventories high, could still be ok", "score": 3, "replies": []}]}, {"body": "rip to Li Auto, chinese EV darling of 2023", "score": 3, "replies": [{"body": "Vinfast tho", "score": 2, "replies": [{"body": "lol rip", "score": 3, "replies": []}]}]}, {"body": "[Korea price cuts canceled?](https://twitter.com/Tslachan/status/1706442518471315775?t=RYKsdzRcMFVmDfZtSygMOQ&s=19)", "score": 3, "replies": [{"body": "Model y flash crash", "score": 1, "replies": []}]}, {"body": "https://x.com/sawyermerritt/status/1706495808315539494?s=46&t=FJnwUzmO93DGxmO6Ihn37g", "score": 3, "replies": [{"body": "Tip your supercharger", "score": 2, "replies": []}]}, {"body": "Never heard of Chery Automotive; what’s everyone’s thoughts on this thread?\n\nhttps://x.com/teslaboomermama/status/1706499662860144754?s=46&t=V2zV6ZNNB9GB2wQcTUATpg", "score": 3, "replies": []}, {"body": "Drove \\~100 miles at 75mph and never came up on another car or had to pass one. Literally no cell signal and an entire swath of beautiful earth to myself\n\nWent w sox+crox. destination unknown but making way to Austin\n\ncharging at The Wagon Wheel Motel in Lusk WY and at a diner eating breakfast. Love love this\n\nhttps://preview.redd.it/x2kzdg3l9mqb1.jpeg?width=4032&format=pjpg&auto=webp&s=51c06286a283efc4085de502095c131f06e3505b", "score": 3, "replies": [{"body": "got there w 9% juice 😬", "score": 2, "replies": [{"body": "Devils Tower yesterday\n\nhttps://preview.redd.it/gp64crar9mqb1.jpeg?width=3024&format=pjpg&auto=webp&s=19bb3f84fbca1bda27f6c16db19f6183a9fd9331", "score": 3, "replies": [{"body": "and a dude cooked me a steak and corn on a 40 acre ranch and I could see for 100 miles\n\nhttps://preview.redd.it/ongpbu8w9mqb1.jpeg?width=4032&format=pjpg&auto=webp&s=241e05479e79d97ef53a15d9f9e3e1014e909871", "score": 2, "replies": []}]}]}]}, {"body": "🚀", "score": 4, "replies": [{"body": "🚀🚀", "score": 2, "replies": []}]}, {"body": "![gif](giphy|aWWveZUrOb5s0gznTx|downsized)", "score": 5, "replies": []}, {"body": "I do believe I'll buy another.", "score": 6, "replies": [{"body": "Would you like the price lower, perhaps much lower, so you can buy more?", "score": 1, "replies": [{"body": "Sure. I like discounts.", "score": 1, "replies": [{"body": "permanent  discount", "score": 2, "replies": []}]}]}]}, {"body": "Haven't seen china people taking delivery of highland so sorry tonight's numbers will suck", "score": 5, "replies": []}, {"body": "[https://twitter.com/strengthPlan/status/1706305018310148407](https://twitter.com/strengthPlan/status/1706305018310148407)\n\nbullish", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Optimus will save us", "score": 3, "replies": [{"body": "Optimus will *sort us by colour", "score": 7, "replies": [{"body": "![gif](giphy|1O1bHxv9ZzuRo4B0cs)", "score": 3, "replies": []}]}]}]}, {"body": "It’s bull alright", "score": 3, "replies": []}]}, {"body": "10y now as high as October 2007.", "score": 4, "replies": [{"body": "Bubble", "score": 7, "replies": [{"body": "What kind?", "score": 1, "replies": [{"body": "Financial", "score": 6, "replies": [{"body": "😭😭", "score": 2, "replies": []}]}]}]}]}, {"body": "Korea price cuts\n\nGotta fix that affordability\n\nDemand and desirability remain infinite.\nhttps://twitter.com/Tslachan/status/1706435377366773793?t=YcfvvWFQpfLbn7afrdQBHg&s=19", "score": 5, "replies": [{"body": "$36k for a model Y is day light robbery", "score": 3, "replies": []}, {"body": "Cancelled", "score": 2, "replies": []}]}, {"body": "Wen am I riding in dave lees cyber truck taxi", "score": 2, "replies": []}, {"body": "https://x.com/tslachan/status/1706442518471315775?s=46&t=FJnwUzmO93DGxmO6Ihn37g", "score": 2, "replies": [{"body": "Just getting ready for when affordability improves", "score": 0, "replies": []}]}, {"body": "Well Ogallala NE off my bucket list 🤣\n\ndid use McD app and got a Carmel coffee at McD next door for $1.49\n\n3 state and 659 mi day. WY NE KA. Heard there might be some rustlers so going to hang my hat in Dodge City tonite\n\nhttps://preview.redd.it/ii9w5wix9oqb1.jpeg?width=4032&format=pjpg&auto=webp&s=87842af30ff798276d7e96de6633dfc934fe2818", "score": 2, "replies": []}, {"body": "\nNot sure what % of that >3b in investment maturity profit was Tbills on the q2 ER, but it's gotta be the majority of it.\n\nEdit: deleted dumb first part.", "score": 3, "replies": [{"body": "my physician friend, the yields moon when people sell bonds. if big money cash was going into bonds, the rates would fall.", "score": 10, "replies": [{"body": "Well it's a good thing I'm not in surgery today holy moly...\n\nhttps://reddit.com/r/TSLALounge/s/sdB6jchJJS\n\nProof from 5 days ago that I'm not always that silly.", "score": 3, "replies": [{"body": "lol dont be the ortho stereotype", "score": 2, "replies": [{"body": "🪚 🔨 🐔", "score": 2, "replies": []}, {"body": "![gif](giphy|QU3YSdsm2dkLJ2bb0E|downsized)", "score": 1, "replies": []}]}]}]}, {"body": "Free government money for Tesla", "score": 3, "replies": []}]}, {"body": "-20% today?", "score": 6, "replies": [{"body": "Keep goin", "score": 3, "replies": []}]}, {"body": "its just premarket.. if we were green, you would cry rug pull! Now that premarket is red, we suck again! Lets just wait until market open and then jump into the abyss, ok?", "score": 3, "replies": [{"body": "yes it could be the friday doom manipulators spending a little extra to make it cheaper to cover at open. or it could be treasuries doooom", "score": 3, "replies": []}]}, {"body": "lol red in 30 mins", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Bum ticker", "score": 4, "replies": []}]}, {"body": "This is crazy… and its not fair… we should be at 300 level", "score": 5, "replies": [{"body": "![gif](giphy|gN9NBeFnPoo7u)", "score": 6, "replies": []}, {"body": "![gif](giphy|xUOwFZCvzzPNzEdQbe)", "score": 3, "replies": []}]}, {"body": "Big china cock numbers tonight? Highland", "score": 2, "replies": []}, {"body": "https://reddit.com/r/wallstreetbets/s/jLZNq2zGck\n\nGoing for 100 lol. These guys probably think I actually trade these bets", "score": 2, "replies": []}, {"body": "Is having a cyber truck gonna mean u have a small pp", "score": 3, "replies": [{"body": "just that you have an oddly shaped one", "score": 8, "replies": []}, {"body": "Hasn’t stopped Detroit from selling millions of projection mobiles to date", "score": 7, "replies": []}, {"body": "🙋‍♀️", "score": 2, "replies": []}, {"body": "*Not evaluated by FDA", "score": 2, "replies": []}]}, {"body": "lol market calling bullshit on the 🤖", "score": 3, "replies": [{"body": "[deleted]", "score": 8, "replies": []}, {"body": "Needs to show bot trading stocks on bloomberg computer", "score": 2, "replies": []}]}, {"body": "agi talks going well", "score": 1, "replies": [{"body": "agi talks failed again", "score": 1, "replies": []}]}, {"body": "https://x.com/elonmusk/status/1706178349268103182?s=46&t=Nh82GobrS9QQ42E2mCn-OA\n\nhttps://x.com/elonmusk/status/1706124467414385148?s=46&t=Nh82GobrS9QQ42E2mCn-OA\n\nMaking references to the falling Roman Empire can’t be good for TSLA. Anyone know the context or is he just blind firing the end of days?", "score": 1, "replies": [{"body": "It's a recent meme that men think about the Roman empire often.   \n[here is a post about it ](https://reddit.com/r/EnoughMuskSpam/s/JD3ZVLvi54)  \n\nThe haters will find any reason to complain. \n\"He stole the meme! \" as if half the internet isn't sharing memes lol", "score": 10, "replies": [{"body": "Ahh! Thanks! Much appreciated. Makes sense now.", "score": 4, "replies": []}]}, {"body": "Its a reference to the failing US as a society. I am not a shill or US enemy, but from the outside, its blindly obvious that the US society is rotting. It has uncanny parallels to the Roman Empire. At the end, his goal is not to predict the end of the world, but to make things change for the better. No idea if it works though.", "score": 13, "replies": []}, {"body": "He always been a doomer", "score": 3, "replies": []}]}, {"body": "hmm, from these drone pictures, the \"exosceleton\" doesnt look thick enough to carry much load. Interested what Sandy has to say on it when its finally dismantled.", "score": 1, "replies": [{"body": "Best exoskeleton is no exoskeleton", "score": 5, "replies": []}]}, {"body": "damn, missed thewolf's messages always post so early", "score": 1, "replies": []}, {"body": "Dude just forgot about the Aeneid?\n\nhttps://twitter.com/elonmusk/status/1706442470026867025?t=xL1w6p73-W7s9YecC3Byrw&s=19", "score": 1, "replies": []}, {"body": "-10% today?", "score": -2, "replies": []}]}
