{"title": "[deleted by user]", "selftext": "[removed]", "id": "169i9jr", "created_utc": 1693802502.0, "score": 122, "upvote_ratio": 0.84, "num_comments": 179, "comments": [{"body": "After the Great Depression of about 100 years ago laws were passed to prevent another.  They worked well for 50 or so years, but then people started to forget the virtues of those laws, and the Federal Government started to serve corporations rather than Americans (which at this point serving global corporations is all federal government does of significance), so many of those laws were overturned or weakened. As a prime example, after the Great Depression banks were broken up into three types: commercial, investment and retail. In the eighties the deregulation ball started rolling and by the 90s banks could once again be in all businesses.  Since then, economy has never been as stable as it was post the GD regulations and up to the point of the deregulation started in the 80s.\n\nThere are certainly other factors, but deregulation of the financial industries is a significant, maybe the most significant.  Many people well versed in the history have attempted to reverse the trends that got the US into this now forty yearlong boom and bust economy, but the large financial institutions spend a lot to thwart those facts from getting established as truth and propagate deceptions, such as it was the same boom and bust before the deregulation, etc.  Their large $ generally overshadows facts.\n\nAn example of relatively recent, very significant revisionist history (written by the financial industry) consider the facts around what is now called the 2009 mortgage crisis.  The facts are that exceptionally leveraged, trillions worth, speculative investments in derivatives of mortgage-backed bonds, in late Aug/Sept 2008 started vicious cycle of lack of trust between large financial institutions - basically they discovered many of them could not make good on these mindbogglingly large positions in MBB derivatives, so they started trying to redeem (redeeming before everyone else meant you might get at least some of your money). This led to a credit freeze up (a financial inst. can't loan if they owe $ to pay off huge positions in derivatives) including to corporations and companies that relied on credit to operate their businesses, which lead to those companies' reducing operations, which lead to layoffs, which led to mortgage defaults, and the \"2009 mortgage crisis\".  Had these highly leveraged, huge speculative positions not been created and therefore not led to the credit freeze, companies could continue to operate at capacity, layoffs avoided, and mortgages paid.\n\nIf you doubt this, just look at the timeline.  Lehman Brothers, the large financial institution that was a casualty of this crisis collapsed in mid-September of 2008.  At that time there was no mortgage crisis at all, employment was still high, and people were paying mortgages. When people started losing jobs due to the credit freeze due to financial institutions lack of trust in each other due to stupid speculation in MBB derivatives then people got hurt and had trouble paying mortgages.  Still not convinced? Consider the government bailout: the government lent enormous amounts of money to the banks so they could trust each other to make good on what they owed each other (largely the speculative positions in MBB derivatives).  If the crisis was actually a mortgage crisis the government could have just guaranteed mortgage payments for a year or so, but that would not have worked because that was not the problem.  I could go on, but you get the point. Oh, and don't feel back if knew it was all about average Joe being irresponsible and not paying mortgages, that is the revised history that suites global corporations and particularly the largest of banks.\n\nYou might be thinking, okay, I'll accept the facts, but why would the financial institutions weave this tail and blame average Joe who got laid off, for the crisis? Simple. Profits.  While mortgages are a very large business, they are also a very low profit margin business, the mortgage business does not make billionaires. On the other hand, while a smaller total amount of business, derivatives are hugely profitable and make bankers tons of dough.  So, the last thing the financial institutions wanted was government trying to further regulate derivatives, which have relatively very, very little regulation at all.  So put the target on the average Joe and his mortgages, which are already pretty heavily regulated and allow government to do more there.\n\nIt worked.  History is rewritten, the average Joe was bad in getting mortgages he couldn't pay, mortgages are more heavily regulated, derivatives are still hugely profitable, hugely risky and relatives unregulated. Pathetic, but true. Reality was quite different.\n\nSo why I am not brainwashed?  Three reasons:\n\n1. in the late 80s and early 90s I worked on Wall St with trading floors\n2. I continued to follow the industry, and very carefully followed it as the crisis unfolded in 2008\n3. due to the changes in mortgage requirements that rolled out in 2010, a successful small mortgage business I owned and operated, that served people who I deemed low risk, but did not meet the federal (Fannie Mae & Freddie Mac) requirements, was no longer viable and had to be shuttered. Fortunately for me, this was only a very small part of my income. Unfortunately for some of my clients, they could no longer find financing.\n\nHave a nice day.", "score": 53, "replies": [{"body": "Great post. What’s your take on the next few years? Do you see a recession around the corner? Appreciate your post.", "score": 3, "replies": [{"body": "No one can predict the future. \n\nIf working Americans continue, as they have the last few months, not lose jobs and earn more at a rate greater than inflation, we will not see a recession. Those working people making more money will spend more money, increasing demand and growing the economy and thus preventing a recession. Working people spending money has prevented the recession thus far.  Working people spending money is what drives the economy. When they/we stop spending, due to loss of jobs, or loss of confidence to keeping a job, or reduction of buying power, etc. we are more likely to see a recession. Additionally, if businesses continue to try to set record after record after record profits and decide to do that by cutting or not increasing worker compensation then prepare for recession. \n\nWhat is also unpredictable, and problematic is government intervention by subsidizing businesses, in the plethora of ways it does, that hurts the virtues of capitalism, and workers.  I could go over example after example of this. \n\nUntil the US starts focusing again on achieving the best in the world total compensation for working people, the US will never see the great economy of the 50s-70s.", "score": 12, "replies": []}]}, {"body": "I’m surprised nobody is downvoting you for telling it like it is. Well said.", "score": 5, "replies": [{"body": "Took me a little time to write it up, but I wish everyone knew the reality.   \nI am disgusted by how the whole thing was written up historically. \n\nThanks for taking the time to read it through.", "score": 12, "replies": [{"body": "Thanks for writing it.  Sure is funny how the historical narrative turned out.  I can’t believe they were able to blame this on the consumer.  Just wish we could have some clue where things are headed now in these unprecedented times.  Too many players and too much noise. Further complicated by “AI”.", "score": 3, "replies": []}]}]}, {"body": "Wonderful reply. Thanks for putting in the time.", "score": 2, "replies": []}, {"body": "> the Federal Government started to serve corporations rather than Americans (which at this point serving global corporations is all federal government does of significance), so many of those laws were overturned or weakened.\n\nI didn't read your wall of text, so maybe I could have found the answer to my question in your War and Peace novel (I'm just joking :) )\n\nBut, the comment I have to your above comment, is don't they kind of have to do this now? For example, imagine if the Government really had it in for Apple. Really went after them for all kinds of various things. Wouldn't this cause massive problems because the nations pensions have such a dependency on massive corporations like Apple continuing to do well?\n\nEurope seems to go after the megacorps with blatant disregard, but maybe they don't have the type of pension funds that we have? Our whole retirement system is basically based on whether the largest weighted players in the S&P 500 are doing well. If they all tanked, what would happen to the pensions of all the older people in this country?", "score": 3, "replies": [{"body": "Government should be serving citizens. This is done in many ways. One among many of these ways is to put in place the laws to allow business structures to foster businesses to be created in order to facilitate employment and investment/ownership as a means of serving citizens. But what we're witnessing is a transposition of a means and the end, ie the vice of people are resources to provide labor to companies, versus the virtue of companies are in place to help provide citizens best in world quality of life through good jobs and ownership opportunity. \n\nThe greatest economy the US ever had was one that resulted in the best quality of life in the world. This economy is one in which the vast majority of citizens earn high incomes, so high that their spending drives an even greater economy. The US had lost sight of that. \n\nPrior to the great American middle class, whose earning and thus spending created a virtuous cycle of ever growing economy, the best economy the world has ever seen, there were good economies driven by royalty, AKA super wealthy. The US is regressing back to that type of good, but not great economy. Corporations will do even better when people have more money to spend, solving your pension concern. \n\nBut corporations will have to compete in that environment, and much is being done to thwart competition, supporting large incumbent corporations, who donate and their industry organizations donate enormous amounts of money to Political Parties, campaigns, and PACs.", "score": 3, "replies": [{"body": "How do you resist the wave of misinformation?", "score": 1, "replies": [{"body": "I'm working to do the best I can, but I would like to read how others get the facts.\n\nFirstly, Know history from good sources and life experience. (I'm around 60)\n\nGovernment websites are still great sources of facts, research Universities as well. Don't believe the bullshit that says otherwise. Great minds don't take government jobs to make less and lie and deceive, they can make much much more in the private sector doing that. \n\nSpend very little time consuming any for of \"news\" or education that is really entertainment. All news has its bias, but some isn't really news at all, it's strictly designed to sell advertising by targeting a demographic. \n\nSome examples:\n\nFox News Channel is not even part of the Fox news organization. Fox, the company that includes a large  collection of local TV channels, cable channels, etc has a news organization that provides global and national news to all the channels (local, cable, etc). When Fox News started it had four weekday 1 hour long news shows, like many other networks/channels: morning, noon, evening and night. Those shows got their new from the Fox news organization. But like most other channels those shows had the lowest ratings, ie, made the least money. Subsequently they were eliminated. At this point there is literally no news on the Fox News Channel. The last bit of news on the Fox News Channel left with Chris Wallace, but it was going for many years before. \n\nCNN was first and started as a 24/7 news channel. Its ratings were generally not very exciting, but costs low and it worked. And during crisis or big news events: hurricanes, floods, wars, government shutdowns etc etc etc CNNs ratings went through the roof, as did profits. Which is why MSNBC and Fox News were formed, to capture and expand on those profits. MSNBC was mostly news, while Fox News had a few hours a day, but did mostly commentary / entertainment programming. In time it's ratings became the best, and that \"success\" lead the others to replace news programs with entertainment. I stopped watching.\n\nThese channels basically cater to people who want to think they're being informed and educated, but much prefer to be entertained, so they tune into the entertainment that provides them the rationalization they're becoming better people and citizens by being informed. Bullshit. \n\nConsider financial news channels Fox FB, CNBC, etc, they're mostly the same, but there are exceptions, all more boring...\n\nBloomberg Television still focuses mainly on financial news versus entertainment. Most people I suggest watch it don't, they find it more boring, less engaging. Well yes, it's designed to inform not entertain. So it does a better job informing and not as good entertaining. I think the reason they get away with presenting actual financial news is that their most important audience largely wants the facts and reality: financial people paying $24,000 per year for a Bloomberg Terminal, which among much much else presents Bloomberg Television. By the way, if you really want to seriously day trade, a Bloomberg [terminal] is entry stakes. Really. \n\nConsider who pays for the ads on these channels, mostly global corporations. Does anyone really think the channels are going to report much of anything negative about them? Hell no. So we hear all the time about poor, poor corporations not able to get enough [cheap] help, incumbered by regulations, paying too much in taxes, etc, etc, etc.  Including average Joes causing economic crisis due to not paying mortgages. Bullshit, we should be sympathetic to people losing homes, not corporations creating the terrible situation that caused it.  But then again, when we the last time an average Joe make a multi-million dollar add purchase? \n\nPBS News Hour is still decent news, just don't waste time watching the last bit which is always some light weight, feel good story. Fine when you want that, but it's not why I watch the show. \n\nThere are new (to this about 60 year old) kinds things you can do now to get the real news. When the BLM protests were going on I found local TV channels generally just presented what they witnessed rather than some spinned up story the national \"news\" channels seemed compelled to present. So when I heard that things were getting exciting in Portland or Seattle, Chicago, etc I searched for local channels I could stream and watched their news. It was usually very different and matched what friends in the area witnessed, rather than the bullshit on nationwide news channels. FYI, I used Roku for that. Same for war or other foreign news. It's surprising now often you can find an English speaking local news stream, but of course you have to check that is not state sponsored, etc. \n\nIf you can find one, some newspapers haven't yet gone to total shit. But they're almost extinct.", "score": 4, "replies": []}]}]}]}, {"body": "Found Michael Burry!", "score": 1, "replies": []}]}, {"body": "Well it’s an unprecedented scenario with inflation as high as it is so that’s a new one for me since I started trading after the Dot Com crash. That being said something bad is always lurking around the corner according to the Bears and everything is Awesome according to the Bulls. I’ve seen a lot of craziness but it’s all just short term volatility. Good companies with growing EPS will always be a good buy and when things have you nervous that’s what options are for. Fear is not a strategy but it’s always around.", "score": 115, "replies": [{"body": "I've heard it said that \"being bearish will always sound intelligent\" because being bullish is an optimistic view that people will probably keep going to work, businesses will probably do a little better each year, and employees will, by extension.\n\nThere is always something to be concerned about (although, I really do feel like the ath consumer debt, inflation, and unaffordable housing markets are concerning), but the market \"climbs a wall of worry\".", "score": 47, "replies": [{"body": "Yeah that is a good point of view which can help you in the market.\n\nWhen it come to investing and trading in such time I think you should be avoiding the excitement and the fomo.", "score": 7, "replies": []}, {"body": "Yeah bears usually sound way smarter but are wrong 90% of the time", "score": 21, "replies": [{"body": "I predict another crash tomorrow", "score": 5, "replies": [{"body": "Well I guess it is time for me to sell now because I do not want to be in another crash .\n\nIf that actually happens then I probably I am going to lose everything that I have got right now.", "score": 5, "replies": []}, {"body": "SELL.", "score": 3, "replies": [{"body": "I mean if you are confident and so afraid of what is going to happen in the market then you can always sell.\n\nI just hope that you are not in too much loss right now because that would be kind of painful.", "score": 3, "replies": [{"body": "No, no. I was making fun of Michael Burry.", "score": 1, "replies": []}]}]}]}, {"body": "My boss made us all come into work today on Labor Day, and I think half the reason he did was because he wanted to rant about the market going up the past week. He takes that really personally after ranting so much about how he thinks it is going to crash. Hearing people like him gets so tiresome.", "score": 5, "replies": [{"body": "Why the f*** does he have to make people come at office?\n\nI think it is just a simple thing which can be done over the phone as well he definitely does not have to ask to come on a holiday.", "score": 6, "replies": []}, {"body": "He sounds like an idiot. I had a boss like that in late 2009 after it was fairly clear we were recovering, albeit it slowly. I never listened to much the guy ever said after that.", "score": 2, "replies": [{"body": "It is the thing which is only going to work on the people who do not pay much attention to what is happening in the market.\n\nIf you are in the market and keeping an eye out then I think you will just be able to call his bluff easily.", "score": 2, "replies": []}]}]}, {"body": "But I think it is also true for the bulls as well you just cannot take everything on the face value that they are telling you.\n\nI mean all the takes with they are going to have were going to be very optimistic.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I definitely believe that scary statistics and being the “voice of reason” as the market climbs will always get views and clicks. Even bulls get drawn into it based on their mood.", "score": 3, "replies": [{"body": "It is always about the market moving in a certain way if it is going up then people will get excited and they will Pump It Up.\n\nAnd in that situation it is very easy to just get ready excited and make bad decisions.", "score": 2, "replies": []}]}]}, {"body": "Skepticism and criticism are easy low risk plays to make oneself feel smart versus putting oneself out there with some optimistic view, taking the chance that all the skeptics, critics, and bears are gonna jump all over you.", "score": 5, "replies": []}, {"body": "In fairness, I'm reading about Japan right now and they, too, felt that the market would continue to grow despite troubling signs with the fundamentals underneath.  We all know how that played out.  The US is not Japan, but sometimes shit does hit the fan, just as 2008 showed us.\n\nMaybe some people would consider this some \"enlightened centrist\" BS, but I don't think you can make any hard or fast rule about the markets.  Will EPS keep growing?  Almost certainly.  Unfortunately, stock market valuations do not only depend on EPS and business growth.  They also depend on people's perception of those things, and there's certainly been a lot of multiple expansion over the last few decades.  Therefore, it's not clear to me how all of this plays out.  I imagine stocks will keep going up, eventually, but it's not clear to me that we will have a clean path forward to 8-10% growth a year like before.\n\nI'm fully invested, just thought I'd throw in my 2 cents to the pile.", "score": 9, "replies": [{"body": "To be fair, the Japanese government was buying shares of their own companies with printed money. Say what you want about the fed, they stayed far away from equities because they saw what happened to Japan.\n\nWe’re in totally uncharted territory right now. Easy monetary policy cause asset price inflation. Now we’re at the highest interest rates in decades. Why aren’t asset prices crashing? How are companies able to keep these prices high while the consumer is paying through the nose and putting it all on credit? We know that inflation is mostly going into profits and not related to input costs.\n\nIs it really that easy that you can print to devalue the currency, then just hike interest rates to make it dear again?\n\nI also don’t know how this plays out. I’m mostly in equities, but I’ve got about 25% in stable return / bonds based because I think there could be a correction.", "score": 18, "replies": [{"body": "Doesn’t the BOJ currently own like 70% of their own bond market?", "score": 11, "replies": []}, {"body": "I was referring to the 1980s bubble period.  The Japanese government was not buying equities then, and the term quantitative easing did not even exist.", "score": 6, "replies": [{"body": "Window guidance did exist.  They did print lots of money.", "score": 2, "replies": [{"body": "Different objectives though, and totally different macro climate.", "score": 1, "replies": []}]}]}]}, {"body": "Japans population is aging/dying, not really comparable to the US", "score": 5, "replies": [{"body": "And they don’t have immigration as a growth driver", "score": 3, "replies": []}, {"body": "Japan is also a producing country versus a consumer economy.", "score": 2, "replies": []}, {"body": "That doesn't have much to do with the bubble bursting.  There's data that it doesn't even have much to do with the failed recovery.  The population didn't get old and die in a period of 10 years.\n\nAnd I said \"it's not the US\", lol.", "score": 1, "replies": []}, {"body": "Their GDP is still strong though, GDP per capita matters more than population growth in their case", "score": 1, "replies": []}]}, {"body": "You have China and many other nations sitting on some large bubbles. The question is when they pop", "score": 2, "replies": [{"body": "You have the US sitting on one", "score": 0, "replies": []}]}]}, {"body": "Yeah the markets rarely make sense. That’s why it’s Stairs up Elevator down. We always “ Worry “ about things but till they hit it’s just worry. The best part is when major things happen there is time to pivot to Bearish. Even during the Financial crisis and Covid drop there was a clear time to position Bearish. Trumps Trade War and other events were forecasted in advance and that’s why we have options.", "score": 2, "replies": []}, {"body": "Soros talks in \"alchemy of finance\" how bad he is at predicting in which state the economy is that he is mostly wrong about it. Pinpointing a recession is hard, even if you are good at it.", "score": 1, "replies": []}]}, {"body": "Inflation is only at 3.18%. It was 8.58% May 2022 and has been much higher in other years/decades.", "score": 3, "replies": []}, {"body": "Inflation was as high as 20% in the 1980s.", "score": 2, "replies": [{"body": "Yes like I said it was the highest I’ve seen in my years of trading since I started after the Dot Com bubble ( see above ) not to mention the world has changed alot since then so it’s a different scenario", "score": 2, "replies": []}]}, {"body": "Yeah I guess you never know what is going to happen in the economy but the recent times has been a little volatile.\n\nSo it is even more hard to understand what is happening in the economy now.", "score": 1, "replies": [{"body": "It’s been a crazy 5.5 years since Trumps Trade War started all this craziness. In times like these trading outperforms buy and hold. Just remember you can’t time it perfectly but you can make a lot of money in between tops and bottoms.", "score": 1, "replies": []}]}]}, {"body": "Economists try to boil a $20 trillion+ dollar economy made up of 320,000,000 million people, and is integrated into the worlds economy down into a few numbers. You're experience may vary greatly. \n\nIt's possible to get laid off in a booming economy. It's possible to get a new, better job in a bad one. Maybe your industry is doing great, but another isn't. Over the last 15 years some industries have done great (tech comes to mind) while retail has been completely transformed. Big cities with tech jobs boomed the last 15 years (why NY, SF, etc got do expensive) but rural areas got left behind. \n\nThe economy is always complex. No one knows what will happen, and your experience may differ.", "score": 40, "replies": [{"body": "Yeah but in the past, it was stable for the most part really.", "score": 9, "replies": [{"body": "Was it? Some people did great in the depression. The 50s is remembered as a great economy, but plenty of people were still poor farmers. 2008 saw a lot of people get laid off, but I actually got hired at a new, and better job. So macro always has exceptions. I'd argue the last 15 years has seen pretty divergent economies depending on where you live and what you do.", "score": 1, "replies": []}]}]}, {"body": "Guessing the entire economy is a fools errand.\n\nThe issues are pretty glaring right now, but MMF's and Bonds are giving a solid return as well.\n\nI don't think the risk premium is there unless the US defaults but again, the ramifications of that can't be intelligently fathomed either.", "score": 33, "replies": [{"body": "There is a so much to cover that I don't think you can understand it all in just by studying it overnight.\n\nI think if you should only be looking on the stuff which you are interested in.", "score": 5, "replies": []}, {"body": "Tbs bro bonds do not give good returns. They either cancel out the inflation or give a few percent return. Rly ass", "score": 1, "replies": [{"body": "According to CPI, UST's have a real yield over 2% right now.\n\nInflation taxes everything equally.", "score": 3, "replies": [{"body": "Well the thing is the CPI is the data which the government is calculating and they do have the different standards about that.\n\nI think it is very much debitable if the inflation that they are calculating is actually the real inflation.", "score": 3, "replies": []}, {"body": "Best I can explain this is when u have something like bonds where u increase the supply at the rate of the bond… it’s always 1:1. No money made. U said it accounts for inflation… which is partially true but not rly… see the appearance of inflation depends on what asset ur looking at. If ur talking eggs, eggs could just get more expensive cause of an increase in demand or a supply shortage, but that means eggs deflated  not that the usd inflated.\n\nEssentially what I’m getting at is if the bond yield is 2%. Then the supply of usd would increase by 2% when the bond closes. Meaning u started with 100$… put it in a 2% bond and received 102$. And now the supply is 102. 100/100 = 102/102. Nothing gained. In reality the good look of bonds is probably because items and other markets have somewhat stabilized in price or begun to become cheaper.  This gives the appearance of less inflation but in reality it’s just the inflation of the specific good. \n\nBasically over time most bonds should return 1:1 in value. Even tho ur going from 100-102. The 102 is worth what 100 was", "score": 0, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Agreed 100", "score": 1, "replies": []}]}]}]}, {"body": "Yes that people have always been calling a bunch of things and the market ha been volatile because of it. That's also why there is money to be made in the market to bet on the angle you want to put your money on.\n\nNo in the fact that we live in an era where information is so freely available if you want it. Decades ago good luck trying to get a fed report and economic report fast enough for it to even have any timely meaning to you. Now you can just bookmark and refresh the link in the morning of release and you can read it from the toilet to make sense of what will be discussed in real time.\n\nHowever it is more confusing now because there are so many more people speaking their opinions, whether grounded on data or not. You see them on TV, YouTube, and heck even here on Reddit. You need to choose how you filter through it and determine what has merit versus what are distractions.\n\n**TLDR:** Seems pretty clear to me that the market line will move right. Not sure what the confusion is.", "score": 10, "replies": [{"body": "Yeah the information is easily available and people are making trades on the basis of that. \n\nWhich is making the market a little more volatile than it used to be in the past. But I feel that is just how the market naturally moves.", "score": 10, "replies": []}, {"body": "The only thing that resonated with me was “read it on the toilet”….", "score": 1, "replies": [{"body": "Well that is actually true because a lot of people including me are always reading those report while we are sitting on the toilets.\n\nSo ya I think a lot of economic decisions are being made by the people who are sitting in the toilet.", "score": 1, "replies": []}]}, {"body": "There definitely is information overload. I sometimes think that if I lived in a cabin in the woods, didn't use the internet at all, and would get the Wall Street Journal every Sunday, and just read that, and nothing else, I'd probably do vastly better at investing. I wouldn't be pulled in so many directions on a daily basis. Wouldn't have nearly as much fomo or whatever the opposite of fomo is. Doom scrolling financial info will damn near drive you insane.", "score": 1, "replies": [{"body": "Yeah sometimes the information is not even correct so if anyone makes a trade on the basis of that may not be something what they were expecting.\n\nAnd I feel like that is going to surprise then big time.", "score": 1, "replies": []}]}]}, {"body": "Occasionally everything lines up, but usually it's a mess of confusion. Every industry and sector is different, and how each performs and then feeds into the rest and how feedback loops then propagate is hard to track and understand. \n\nYou then have to add in human behavior being inonsistent. One year high prices push customers away, the next it's buy no matter what. \n\nIt's a mess out there.", "score": 8, "replies": [{"body": "Yeah exactly just take the Crypto market and the stock markets the the things which you are going to hear in the crypto market are going to be very different which will be available in the stocks.", "score": 5, "replies": []}, {"body": "Conflicting media, most can't think past their own nose without someone else explaining something on a level they understand. No matter how factual the information is most will take it without question.", "score": 2, "replies": [{"body": "Well the confirmation bias has always been there and is going to always affect the decisions.\n\nBut I don't think that you should let that fool you are something because knowing the truth is actually hard.", "score": 1, "replies": []}]}, {"body": "A human brain can't understand it because it's too many variables simultaneously. What happens when there's really good AI that can understand it all? Won't there be trillionaires overnight?", "score": 1, "replies": [{"body": "AI doesnt have a way to \"understand it all.\" Moreover the stock market isn't the economy.", "score": 1, "replies": [{"body": "Yeah that stock market is not the whole economy it is a part of the economy it is going to react on the news which are spreading in the economy but it is not going to make or break the economy.", "score": 1, "replies": []}, {"body": "> AI doesnt have a way to \"understand it all.\"\n\nyet", "score": 1, "replies": [{"body": "Ever with how AI currently works. There's no training for this topic.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ever since the Glass-Steagall Act was repealed, it's been all downhill.", "score": 7, "replies": []}, {"body": "No, it was smooth sailing from 2010-2020. The volatility is due to the pandemic/war and trade war. \n\nWe're decoupling from china, moving from a Monopolar world to a multipolar world (and possibly a second cold war.)\n\nWe're now in a time that's. Very similar to the 1972 oil crisis and the subsequent inflation / stagflation crisis. It might be a while until were fully out of it.", "score": 29, "replies": [{"body": "Agree. Market propped up during pandemic and no one wins trade wars.", "score": 11, "replies": [{"body": "And the things that which we went through the pandemic are still the same.\n\nSo I don't really any reason why anything is going to be changing anytime soon so there is that.", "score": 5, "replies": [{"body": "Things will only get worse. That is life. Each day worse than the day before it no matter how hard you try. The only positive is one day closer to the grave.", "score": 1, "replies": []}]}]}, {"body": "The smooth sailing over that decade is a big reason the economy is so messed up now.  The smooth sailing came from an artificially propped up economy from massive QE.  The fed, government and big business collectively decided that no downturn was a good downturn. \n\nAnd so now here we sit, in a large bubble of sorts with an artificially inflated stock market unsure if it really is different this time or if it all will come crashing down.", "score": 11, "replies": [{"body": "Yeah they took everything for granted and kept on making mistakes and thought that there are going to be no consequences of them.\n\nAnd now we are going to face the coinsequences of those choices for a very long time.", "score": 6, "replies": []}, {"body": "This was a fair sentiment even in 2019 before the pandemic. A lot of economists thought we were due for a healthy correction. But I think it’s more what came after that got us into the current mess. The gov’s economic response to Covid was far too aggressive and basically speed ran a decade’s worth of irresponsible policy into just a couple years.", "score": 11, "replies": [{"body": "Pandemic response was definitely more of the same.  At least it somewhat made sense as the economy would have crashed massively without a response.  No doubt they went overboard though. \n\nWe used to have a rule to loosen up during bad times and tighten up during good times.  We became loosen loosen loosen all the time.", "score": 5, "replies": []}, {"body": "It was supposed to be a healthy correction if everything would have gone the way they imagined it all.\n\nI am definitely sure about it that they did not expect a pandemic to happen.", "score": 5, "replies": []}]}, {"body": ">The fed, government and big business collectively decided that no downturn was a good downturn.\n\nThat was Trump's call. He threatened the feds when they wanted to lower rates. \nhttps://www.reuters.com/article/us-usa-trump-fed/trump-says-he-can-fire-feds-powell-its-not-that-simple-idUSKCN1TR1SU", "score": 5, "replies": []}, {"body": "That QE was nessecary though and it worked. QE kept us from feeling the crisis of 2008 like the great depression. \n\nThe problem is, policies should probably have been reigned in slowly between 2014-2016. Which it wasn't. And when in 2020 covid hit, policy makers instantly went to QE again. Way to much QE.", "score": 2, "replies": []}, {"body": "They kept QE going beyond the early years of global financial crisis because inflation would simply not go up, that’s all. What that tells you is that economic output was matching the increase in money supply. In other words, you got the cause and effect wrong, economy wasn’t good because of continued QE, QE continued because of good economy. Now recently we did QE, but at a time when economic output in many sectors was down, and it stayed down thanks to China locking down and the war causing supply chain issues.\n\n\nI don’t understand why everyone think any and all growth that beat their expectations is a bubble. Stock market is artificially inflated apparently but P/E are sensible. yes it’s above average, but given the growth of technology, investors rightfully so have more confidence there’ll be future growth. It’s like every quarter companies destroy their projections and people just ignore it. \n\nIt’s really not that complicated. We temporarily printed more money than there was productivity growth. Productivity is now catching up and it’ll be back to normal in a year or two. These things take time.", "score": -1, "replies": [{"body": "PE’s are nowhere near sensible with the current interest rates. Nowhere near historical numbers.  If interest goes back down below 2% then they would make more sense.", "score": 1, "replies": [{"body": "Looks pretty sensible to me: https://www.gurufocus.com/economic_indicators/57/pe-ratio-ttm-for-the-sp-500\n\nAgain, growth and stability is much higher than the past, slightly above average is expected", "score": 1, "replies": []}]}]}]}, {"body": "And it has already been a while since we are in it has been like 2 years.\n\nAnd I don't really see anything coming down in the price which makes me believe that inflation is still the same.", "score": 4, "replies": [{"body": "Inflation has been steadily dropping. Prices won't come down. Price growth just needs to stop (being so high.) There's this funny site where you can track inflation real time. It's called http://www.truflation.com\nThere you can see inflation has been steady between 2-3% for a while already. The fed will hike 1, maybe 2 more times, then we're done!\n\nWhich is why you should never trust your feelings.", "score": 1, "replies": []}]}]}, {"body": "half the news is noise.  that's why it looks worse than it is.\n\non the other hand, higher interest rate is changing the economy.  this change takes several years and we are only year and a half into it.  so the economy right now is not stable, it is slowly adjusting to high rates.", "score": 19, "replies": []}, {"body": "It’s a great time to invest because it is a huge bull market and at least half of the people are expecting a recession.\n\nBig corrections and crashes happen when everyone is overhyped and no one in their right mind is talking about a recession", "score": 30, "replies": [{"body": "who's \"at least half the people who are expecting recession\"? NABE reported like 70% of economists who expect no recession in the next 12 months, and that was in July. The percentage is probably way higher now.\n\nSoft landing is the consensus. That's reflected in the bond market, stock market, VIX, economists. The only ones who think recession is consensus are average people who are typically late to the news.\n\nIn fact, the June monthly job number was heavily revised down (210k down to 100k), and everyone welcomed that.", "score": 13, "replies": [{"body": "It’s not just the people who are afraid of a recession, companies are freezing hires, reducing costs, deleveraging. You could argue it could be a self fulfilling recession but those actions will only drive profits and margins up", "score": 5, "replies": [{"body": "This is not because of recession anticipation. That's just because they don't have access to cheap money to expand, consumers have less cheap money so they spend less. We are not in an early stage of the economic cycle, so of course companies can't just spend like no tomorrow like in 2021. Ceos aren't talking about recessions anymore, unless asked by the listeners.", "score": 8, "replies": [{"body": "Your point is that they’re not laying people off because they fear a recession, but because they have less access to cheap money. Well, isn’t that literally what causes a recession? Higher interest rates leads to slower economic growth. Slowed economic growth leads to a recession.", "score": 1, "replies": [{"body": "the guy I responded to said companies are being cautious because companies fear an upcoming recession. I'm saying they're doing that because they no longer get cheap money, so they have to expand by actually being a profitable business (cutting cost, working more efficiently, not raising prices carelessly and assume consumers will pay for it). During COVID, growth at any cost was the name of the game, because money was cheap. Now profitability is the priority. Slower economic growth doesn't always lead to a recession. It could mean 2%, 1%, 0.5% real GDP instead of 4-6%. Whether or not we ultimately end up in a recession is yet to be determined. Before you enter a recession, you go into slow growth first, but you just don't stop there. Occasionally, you stop there, like in 1990 (basically the only true soft landing if I remember correctly).", "score": 1, "replies": []}]}]}]}, {"body": "Economists also said inflation was transitory forever ago…they are wrong.", "score": 2, "replies": [{"body": "Life is transitory.", "score": 2, "replies": [{"body": "Can’t wait for it to end.", "score": 1, "replies": []}]}, {"body": "never said who's right or wrong, only pointed out what's consensus and priced in.", "score": 1, "replies": []}]}]}, {"body": "The market has been bullish since the beginning of the year, but no one knows how much higher it's going to go and when it's going to pull back. My guestimate is since we're pretty much on the curve of long term average gains right now, there is room to go up while interest rates remain the same, but not by much I reckon.", "score": 6, "replies": []}, {"body": "Volatility kills.", "score": 1, "replies": []}, {"body": "Were you trading and working in 2007?", "score": 1, "replies": [{"body": "Yeah. I did not have much invested at the time thankfully. Definitely had a weaker portfolio with 15 years less experience", "score": 1, "replies": [{"body": "Starting to see some parallels to the back half of 2007.  Market kept rising in the face of bad news.  Meanwhile companies were quietly implementing hiring freezes and travel bans. \n\nI could definitely be wrong, and we are just gearing for the soft landing.", "score": 5, "replies": []}]}]}]}, {"body": "you'll be much happier if you stop following the news, in general. \n\nfinancial news in particular. nobody knows anything.", "score": 3, "replies": []}, {"body": "Volatile, no, confusing to read, yes.  Every month there would be mixed interpretations, it's just that now, there's a major potential bifurcation point and we all want an answer.", "score": 2, "replies": []}, {"body": "We’re doing an experiment right now to see how massive stimulus and then massive inflation affects the market.", "score": 2, "replies": []}, {"body": "We've never had inflation over 3% regularly since 1991. It is definitely one of the hardest times to read the economy in many of our lifetimes in many people's opinion. Things are simpler when inflation is chilling at 2% and the fed is buying all the US debt it can. Now... Not so much.", "score": 2, "replies": []}, {"body": "Have we always had a pandemic that shut down much of the economy, helicopter money, JIT failure, some modestly high inflation, transition from gas to electric transportation in fits and starts with an undersized electrical grid, rising tensions with China and Russia forcing emergency measures toward domestic production, a “shortage” of housing making housing unapproachable to new home buyers, widening worker strikes?\n\nAnd that’s just from the US perspective and I left half the shit out.", "score": 2, "replies": [{"body": "I was going to say, pretty narrow view there.", "score": 1, "replies": []}]}, {"body": "The economy was always like dating, the signals and red flags were all their all along, you just couldn't see them until 2 weeks/months later. \n\nRed flags when coming towards you only look like sticks. Only when they are at you and pass you do you see the flag.", "score": 2, "replies": []}, {"body": "I would say, no. Since the beginning of the pandemic, the macroeconomic landscape has become increasingly volatile and unpredictable.", "score": 2, "replies": []}, {"body": "No, Druckenmiller and others says these times are the hardest to predict the market or macro in general in their lifetime, anyone who says they know what will happen is full of shit.", "score": 2, "replies": []}, {"body": "The stock market is not about predicting the future; it is about surviving the casino, or maybe surviving the free-for-all hunger games…\n\nI don’t think that the economy is all that confusing to read at all. Just look outside. Prices are high, people who can get more money can get by, those who cannot, aren’t getting by. People who thought that their retirement saving had 10 years left on it, are suddenly finding out that it might have been cut to five.\n\nAre you trying to read the economy or the stock market? They’re not the same thing.", "score": 2, "replies": []}, {"body": "There are always the dooms dayers....the guy that called the last crash says blah blah blah. \n\nAverage in, and stay in. the 500 index funds will make money...it just depends on time. You have to stay in the market through all the BS.", "score": 3, "replies": []}, {"body": "1) Yes, some people are always predicting a recession is coming. The old saying is that doomsayers have predicted 36 of the last 5 recessions. \n\n2) The economy has not been particularly volatile this year. You need to separate opinion pieces and predictions from actual objective data. \n\n3) What is \"very evident\" is that you only recently started following financial news.", "score": 2, "replies": []}, {"body": "Ever since the dot com crash, there's been a concerted effort to push bullshit narratives onto the investing public. The system basically broke in 2000 and has been held together by increasing amounts of debt and creating bubbles in pretty much every sector. \n\nSo the titanic hit the iceburg 20 years ago... but until everyone is actually swimming in the ocean (ie. society is falling apart) a lot of people are happy to pretend nothing's wrong. And that willful blindness keeps the bubbles going.", "score": 2, "replies": [{"body": "Bro!  Your username and post fit perfectly.", "score": 4, "replies": []}]}, {"body": "The VIX is 13.09. Look at the charts. It’s low. \n\nThe RFR (risk free rate) is rising. You can get 5% doing nothing. \n\nStocks are flat to lower.", "score": 1, "replies": []}, {"body": "Anyone with at least three credits a business education knows the definition of cyclical", "score": 1, "replies": []}, {"body": "Since Bidenomics started", "score": 1, "replies": []}, {"body": "No. It wasn't. Check what Brent Johnson says about this market (timestamped): https://youtu.be/OQu7-5zK9YQ?si=u233A9MjxlLHS8ij&t=634", "score": 0, "replies": []}, {"body": "The Crash Is Coming\n\nBe Careful", "score": -2, "replies": [{"body": "Great arguments you've got there.", "score": 4, "replies": []}, {"body": "CNBC needs to hire this man.", "score": 3, "replies": []}]}, {"body": "They don’t hand out money for free. There’s someone on the other side of the trade.", "score": 1, "replies": []}, {"body": "Yes. Predicting the future economic conditions has always been this messy in the media. The only reason somebody says anything on this topic in the media is for somebodies benefit. Take it all with a grain of salt.\n\nThat being said (there is always something to worry about), there are of course some real reasons to potentially worry at this time, most notably high interest rates to combat inflation. But don't expect to be able to predict macroeconomic conditions better than others and make money if you just watch media, think and have an opinion. This stuff is difficult like building an f16 airplane, to compete at macroeconomic prediction you need all the best tools, training and a big professional team & still most fail.", "score": 1, "replies": []}, {"body": "By it's nature it's confusing, if confusing is meant to speak on the ambiguity. All chaotic systems are confusing in that sense.\n\nVolatility is also inherent to those systems.", "score": 1, "replies": []}, {"body": "Pretty much every time in history has been “unprecedented”\n Trying to divine the future from data drops is almost impossible because our predictive  models are laughably weak.", "score": 1, "replies": []}, {"body": "Yes. No one is ever certain what the market is going to do. Even Warren Buffett admits he has no idea what the market is going to do in the short term, and this is not how he made his money. It may seem more confusing because the public opinions are not just from mainstream media and government anymore. Now anyone can make their predictions publicly and very loudly, but that doesn't make them any more valid.", "score": 1, "replies": []}, {"body": "The talking heads are always predicting.  Either a bull market or a crash.  It’s all bullshit because they don’t know what’s coming. The thing is, nobody is gonna tune in to hear people say “we don’t know what’s gonna happen this year”.  Buy the S&P and don’t read or watch the bullshit, or at least don’t act on it.", "score": 1, "replies": []}, {"body": "It has always been this confusing to read.\n\nNot sure if it’s always been this volatile. The daily swings seem pretty huge.", "score": 1, "replies": []}, {"body": "Yes and no. There used to be less press as access to investing was more difficult until the last 15-20 years, with the rise of online brokerages. The confusion can really appear with the sheer volume of easily accessible information and opinions today.\n20+ years ago, most info was \"easily\" accessible from the newspaper and sources like WSJ, which meant you were receiving a limited view. At the macro level, there's still reasonable correlations between the economy and the markets, although a decade of QE measures pushed more speculative pricing. When you drill down, the waters get muddied by movement within sectors driven by various factors.\ne.g.: VFS surged to a market cap of more than $150B shortly after its IPO before settling at $68B, compared to Ford at ~$48B who produces 10x more vehicles and is profitable at the same time. Both are sound companies, but the prices are driven by different forces and amounts of speculation (I didn't compare TSLA in this case, because the valuation there is also a bit odd in that it looks and behaves more like tech than automotive).\n\nToday, you can find information easily through a Google search, social media (Reddit, FB, Twitter, etc.), and see opposing viewpoints more readily. Add in that some parts of the economy can oppose one another on a spectrum, and it looks like madness (you can get very different views on the automotive market depending on if you're on the TSLA sub vs here or another manufacturer subreddit). \n\nNo actual volatility has changed, but you are now sifting through a deluge of reports interpreting the same news in sometimes wildly different ways, seeking to create an authoritative truth from them all.\n\nTl; dr:", "score": 1, "replies": []}, {"body": "No, it’s a bit different, the big firms appear to be shorting the market. They are making comments that might motivate you to move your money. If you are going leave it alone, the market will storm back. No bonds til much older.", "score": 1, "replies": []}, {"body": "Yes, it always feels crazy. During COVID was especially intense. This might actually be on the calmer side of things now.", "score": 1, "replies": []}, {"body": "Tbh there’s no real turn around I see for the usd. So reading the economy for an upswing just doesn’t exist. Atm the usd is rly only afloat cause of oil purchases. And some countries r giving up on that. And BTC is, in general, a better asset than usd. So eventually ppl will realize it’s in their interest to use that instead of usd. When either of those things rly begin to play out the US is either gonna go to war with the countries not buying oil in usd. And basically be Germany in WW3. Or their gonna try to ban BTC… which honestly prolly won’t work since that will likely make ppl lose massive faith in the US. Or do both if both play out. Nthn good is rly gonna go for the US economy rn tho. Everything is bubbled and overvalued cause of debt companies use to stay afloat… so yeah it’s not gonna be good", "score": 1, "replies": []}, {"body": "Yes.  There's always a \"what happens next\" phase, and for the purposes of the market, WHEN it happens next, because the only way to really kill it is get the timing right.", "score": 1, "replies": []}, {"body": "chocolate beer moose gold hoop ` this message was mass deleted/edited with redact.dev `", "score": 1, "replies": []}, {"body": "Yes, there is always something going on", "score": 1, "replies": []}, {"body": "How can you deduce that our economy is going through a \"tumultuous and volatile phase\" if you just only started following the financial news.....? The reads like really hamfisted fearporn.", "score": 1, "replies": []}, {"body": "More or less.\n\nOn average I think there is a crisis every eight year.\n\nThe first few years after the crisis, everyone is careful, even if it is going well, people will still be in a bear mind state, and to some point also keeping the economy down / in a bad state.\n\nThen after it has gone well for some years, people will act the opposite because they have a bull mind state.", "score": 1, "replies": []}, {"body": "A lot of trading is based around historical events. The problem with this particular point in time is there is no historical correlation.\n\nIt has also been more or less impossible to get a future feel on where things are headed. In 2021 the projection for rates going higher was very small. Maybe a hike or two. Here we are at multi-decade highs. \n\nIn a nutshell has it always been this confusing? No, has it been this confusing before? Yes, regardless trying to trade off news events is a good way to lose money. Financial media exists for engagement, not necessarily to share the most accurate information", "score": 1, "replies": []}, {"body": "Volatility has happened before.  The amount of people retiring, in the market for retirement and basic living requirements to be used  is unprecedented as is the number of individuals, stakeholders and post nation-state entitities seeking to create or take advantage of churn or the chumming of the waters.  The techniques and communication tools for use and the speed at which they can be deployed is also unprecedented.  Old adage from pre 1923 till holds true, sometimes the bears win sometime the bulls win, pigs lose. Don’t be a pig.  That all these things can be found in Chicago is a coincidence.", "score": 1, "replies": []}, {"body": "There are aspects to it that are uncharted territory, that makes it a lot harder to read. We never had large sectors of the economy shut down before, and then we had the unprecedented solution to an unprecedented problem, which was to just pump in a lot of money as if the economy hadn't been largely shut down. Then we got inflation that no one could fully explain and as we were hoping to come out of it (with supply chains being restored) we got a boost of inflation that was easy to explain (an energy shock). Then on the side of labor we have workforce changes that are probably not even fully documented, much less fully understood, so that gives different signals to contrast with other parts of the economy that we don't understand.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Lol wtf it’s a bull market can’t you see. When it’s easy to read it’s about to crash. Rookies", "score": 1, "replies": []}, {"body": "Volatile? No.\n\nConfusing? Yes.", "score": 1, "replies": []}, {"body": "No. Its usually much worse.\n\nWe are in a very calm and relatively predictable period.", "score": 1, "replies": []}, {"body": "My take, we have been applying too much stimulus, too much borrowing crowding out productive investments. Now the inflation lion needs slaying. This induces more borrowing to maintain existing bonds with higher interest.\n\nIt’s going to be a tough decade ahead of us", "score": 1, "replies": []}, {"body": "Yes, it has been this volatile and hard to read, hence why we aren't all billionaires.", "score": 1, "replies": []}, {"body": "Listening to economists is a waste of time. Listening to anyone try to predict what the economy will do in the future is an even greater waste of time.", "score": 1, "replies": []}, {"body": "I would say yes. it's clear when we actually look backwards but as it is happening around us it's hard to read", "score": 1, "replies": []}, {"body": "Even recent times are much worse than today. 2020 and 2022 experienced bear markets. Right now the economics are much more clear than ever before. We will go up until a certain point, then market will go sideways (or down) until the Fed cuts interest rates. Then market will go up again.", "score": 1, "replies": []}, {"body": "I can only speak as someone who has been in the market since 2008. There was a 3 year period from 2012 to 2015 where things felt pretty stable. Consistent small gains with occasional corrections. 2008 was a historically bad year. 2009 through 2011 felt like walking on thin ice. 2016 through 2020 were the Trump years, and 2020 through today are the pandemic and economic impact of said pandemic. \n\nI know that in the mid 2000's that adults seemed to act how the realtor in arrested development describes the housing market. \"Since the market is only going up, you should probably buy that second swimup bar in your pool on your $47K/year salary because if you don't grow into it, you can always sell at a profit!\"", "score": 1, "replies": []}, {"body": "Ask Janet yellen and JP, they’ll tell you everything’s fine\n\n\nAnd transitory.", "score": 1, "replies": []}, {"body": "As they say, bull markets climb a wall of worry.", "score": 1, "replies": []}, {"body": "I think more than anything everyone else has been sketching me out. It's weird that that odd energy of negativity is in the air on any of my researches or posts on prospects. I don't think theres much basis for it other than the same old inflation reports. Next year may be a different animal but we'll see. Hope it fades, good observation OP.", "score": 1, "replies": []}, {"body": "It’s a market of stocks. —Not a stock market. Just remember that. There’s always a good buy or short somewhere.", "score": 1, "replies": []}, {"body": "In my opinion it is always hard to read. Booming -> will plunge, if crashes -> will crash more.", "score": 1, "replies": []}, {"body": "Yes.  I'm old.  Yes.", "score": 1, "replies": []}, {"body": "I don't think this has been like this, there has been too much inflation.", "score": 1, "replies": []}]}
{"title": "Intel claims on track to regain foundry leadership from TSMC in 2025, secures \"large customer\" for 18A node tech", "selftext": "https://www.notebookcheck.net/Intel-claims-on-track-to-regain-foundry-leadership-from-TSMC-in-2025-secures-large-customer-for-18A-node-tech.745986.0.html\n\n\"To achieve this, Gelsinger told the conference that Intel is on track with its manufacturing roadmap of 5 nodes in four years, regaining process leadership in 2025 with the 18A node, as reported by Creative Strategies analyst Ben Bajarin. Gelsinger added that following on from Meteor Lake (expected to be launched later this month), Intel will be ramping its Intel 3 process (5 nm) “soon”. Perhaps more excitingly – and tantalizingly – Gelsinger said that Intel has received a large customer pre-payment for its 18A node (1.8 nm) that has already been successfully taped out and is on track for 2025.\n\nOne can only speculate as to which company this “large customer” is. TSMC also claims it is on track for its own 2 nm process node in 2025 and already enjoys the patronage of major customers including Qualcomm, Nvidia, AMD, MediaTek along with Apple. Undoubtedly, Intel will be keen to secure at least one of these companies as it helps with its own economies of scale as investing in each of these new process nodes is a multi-billion-dollar endeavor. In the end, the competition in the foundry sector is great for customers as it is driving the delivery of faster, but also more efficient chips.\"", "id": "169x6lx", "created_utc": 1693846265.0, "score": 460, "upvote_ratio": 0.95, "num_comments": 169, "comments": [{"body": ">One can only speculate as to which company this “large customer” is. \n\nIt's Ericcson.\n\nIt was on a slide they shared that Ericsson SoC is their 18A customer.", "score": 167, "replies": [{"body": "While I’m sure Ericsson is a customer, I am sure that the large customer is someone else. It’s either nvidia or one of the hyperscalers.", "score": 21, "replies": [{"body": "[Here is the source.](https://twitter.com/realmemes6/status/1697307938086596997?s=46)\n\nIt’s definitively not NVDA.", "score": 30, "replies": [{"body": "Ericsson was announced a while ago though, like 2 months ago. If that's the large customer that Intel was talking about, why would they just not mention them by name?", "score": 14, "replies": [{"body": "My brother…\n\nIntel literally put out a slide with their name on it.\n\nTheir prior chatter around Ericcson wasn’t a confirmed down payment on 18A.  Now it is.\n\nThis is objectively a win for INTC.", "score": 24, "replies": [{"body": "The same guy that posted that slide, later commented \n\n>Yes, I'm having more doubts that it was Ericsson that prepaid.\n\nI'm not saying it can't be Ericsson, just saying I wouldn't be surprised if it wasn't.", "score": 3, "replies": []}, {"body": "It is a win for Intel. And Ericsson is a customer who has put a confirmed payment. But the recent expansion is probably another customer. Jensen publicly stated that the 18a test chips are looking good. And they need more volume. As do the hyperscalers. My bet is one of them. \n\nKudos to Intel.", "score": 1, "replies": []}, {"body": "Your brother?", "score": 1, "replies": []}]}, {"body": "Its definitely not Ericsson. They don’t have the volumes to drive anything meaningful - won’t even fill a line much less fund expansion. I still think it’s Nvidia, or one of the hyperscalers. Could also be IBM.", "score": 1, "replies": []}]}]}]}, {"body": "Which is hilarious because they are probably outside the top 20 semiconductor purchasing companies in the world. What a flex by intel. It’s also hilarious seeing people think nvidia is going to switch to intel when they have booked all of tsmcs capacity for the foreseeable future. What is Jensen supposed to say that they would never use intel? Lol", "score": 2, "replies": [{"body": ">It’s also hilarious seeing people think nvidia is going to switch to intel when they have booked all of tsmcs capacity for the foreseeable future.\n\nNo one thinks Nvidia is going all out in Intel, but it's not unreasonable to think that Nvidia would start fabbing some smaller, low or midrange GPUs at Intel in the future. They have tapped into Samsung in the past for low margin gaming GPUs. \n\n>What is Jensen supposed to say that they would never use intel? Lol\n\nHe could have just not commented, or said they were running some test chips with them.", "score": 8, "replies": [{"body": "Haven’t you enough shilling for intel? Dude, Have some class, now and then. lol", "score": -1, "replies": [{"body": "Haven't you had enough of coping about Intel doing something good? Or haven't you had enough of crying about \"shills\"? Have some class, now and then, and maybe don't try cyberstalking me across subs lmfao", "score": 2, "replies": [{"body": "lol. Finally caught the troll red-handed while it’s shilling. Intel will be loser forever. Look at its share price over the past 10 years. Stop giving bad investment advices to people in stock subs. You don’t care about tech. You only shill.", "score": -2, "replies": [{"body": "Cope harder lmao", "score": 3, "replies": [{"body": "Why don’t you buy Intel share since you believe in Intel so much?", "score": -2, "replies": []}]}]}]}]}]}, {"body": "Agreed.", "score": 0, "replies": []}]}, {"body": "Nokia when?", "score": 1, "replies": []}]}, {"body": "National security entered the chat", "score": 101, "replies": [{"body": "Obviously it’s not guaranteed, but once Intel’s fabs are up and running I wouldn’t be shocked if the US strongly encouraged all the American companies that can use Intel’s fabs, to use Intel’s fabs. \n\nNvidia already has expressed interest in being open to the idea.", "score": 50, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "But what are the most advanced TSMC nodes that will be built on American soil?", "score": 2, "replies": [{"body": "To protect the island they’re gonna only move their second best \n\nBut Intel is not going to even achieve  their 2nd best for several years", "score": 3, "replies": [{"body": "That’s about what I understood as well.  It’s a win-win for Americans and Taiwan, at least in the medium term.", "score": 1, "replies": []}]}, {"body": "TSMC always keeps their best stuff for Taiwan.", "score": 1, "replies": []}, {"body": "Apple pressed them into moving at least 3 nm over, I don't think they're building the 2nm in the US", "score": 1, "replies": []}]}]}]}, {"body": "*sorry to inform,  they've been listening in for most of the decade*", "score": 32, "replies": []}, {"body": "*Too big and too important to fail* has entered the chat.", "score": 17, "replies": [{"body": "Correct. China is accusing the US of withholding chips to set their military back. Tech is definitely one of the major needs for war of the future.", "score": 2, "replies": []}]}, {"body": "And why the government won't let the fail.", "score": 6, "replies": []}]}, {"body": "Intel does not have to “win” against TSMC. If they turn into a reliable 2nd in Foundry, It will be huge. No one wants to rely on any one company as their sole supplier now or in the future. New reports on Tom’s hardware also show that Intels latest CPU outperforms Nvidia’s current and next GPU in critical AI tasks. So Intel is diversifying revenue streams and improving it’s products and earnings. Foundry improving and gaining customers. Data center likely to improve and gain market share NTM. PC market likely bottomed 3 to 6 months ago. It’s entering a new powerful bull market. Easy double in two years", "score": 105, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "who the fucks made all that Core i7 chip you used in your notebook if not their own foundry?", "score": 2, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "i see, thank you for the correction", "score": 10, "replies": []}]}]}]}, {"body": "Given that INTC is now half of what it was in 2021, a double in 2 - 3 years is almost guaranteed (assuming no major recession). The main question is whether it can grow beyond that.", "score": 12, "replies": []}, {"body": "Is Broadcom building a foundry in the us?", "score": 1, "replies": []}]}, {"body": "There is video on youtube shows they are packaging Meteor Lake CPUs in Malaysia. Intel 4 node is a real deal. They struggled with the old 10nm, 7nm because they tried to get high yield on sub-7nm with just DUV. Since they have switched to EUV, everything seems to be smooth sailing for them.", "score": 20, "replies": [{"body": "Problem is volume tbh, but that isn't nearly as big of an issue as not getting the node to yield.", "score": 5, "replies": []}, {"body": "What does DUV and EUV mean?", "score": 1, "replies": [{"body": "Types of lithography used to make semiconductors. Each just refers to a specific implementation", "score": 3, "replies": []}]}]}, {"body": "I recently put a decent amount in Intel. I feel it has been beaten down enough. I hope this is true, but not holding my breath.", "score": 9, "replies": []}, {"body": "If it helps pump my stocks, I am onboard.", "score": 33, "replies": [{"body": "I have long calls through 2025, I think if it remotely delivers on the turnaround it's undervalued here", "score": 12, "replies": [{"body": "That’s why promoting it here haha", "score": 9, "replies": [{"body": "I'm just sharing valid news and am optimistic on the stock, isn't that what this is about :)", "score": 3, "replies": [{"body": "\"I like the stock\" - Sweatband Man", "score": 8, "replies": [{"body": "Miss him, made 2021 a bit more fun", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Lots of arguing about intel vs tsmc vs nvda vs amd. \nThis is why I have a lot of smh/soxx/xsd. I’ll just pay my .35% and not care who wins.", "score": 5, "replies": [{"body": "You could just buy all four and call it a day too.  None of them are going anywhere.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Imagine being a high dividend investor and having to do light research on top of rebalancing.  The sheer horror.", "score": 5, "replies": []}]}]}]}, {"body": "I only listen to a management team’s claims if they have a track record that supports it. \n\nIntel management has proven time and time again they are not to be trusted. \n\nI’ll believe it when it happens.", "score": 19, "replies": [{"body": "The problem is that by that time the price will be way higher", "score": 1, "replies": [{"body": "You don’t need to buy the bottom to have a multibagger.", "score": 4, "replies": [{"body": "Bottom was a few months ago around 25.", "score": 5, "replies": []}]}]}]}, {"body": "if I remember correctly, Intel is the only fab at this moment with orders at ASML for their new generation high NA (high numerical aperture) EUV photolithography system. this will give them an edge for sure, for getting to <2nm node. but can they manage the yield issues at the early stages if the process development, we will see…\n\nTSMC likely to prefer waiting some more years to switch to the high NA EUV systems, because they need to get the right ROI for the massive CAPEX of their existing EUV systems before they move up to the new systems…", "score": 11, "replies": [{"body": "You remember incorrectly, Intel, tsmc, and Samsung all have High NA orders.", "score": 21, "replies": [{"body": "you're right. the thing I remember was outdated information from the early period of the high NA. Intel got their hands on it as early as 2018 -not for manufacturing but it's a big advantage for process development for the >2nm node ([https://www.tomshardware.com/news/intel-orders-second-twinscan-exe-high-na-euv-tool](https://www.tomshardware.com/news/intel-orders-second-twinscan-exe-high-na-euv-tool)). With the new orders, they will have a head start for the high NA, and I think this is the reason why they are aiming for the 1.8nm node by 2025.\n\nTSMC expects to get one in 2024 ([https://www.reuters.com/technology/tsmc-says-it-will-have-advanced-asml-chipmaking-tool-2024-2022-06-16/](https://www.reuters.com/technology/tsmc-says-it-will-have-advanced-asml-chipmaking-tool-2024-2022-06-16/)) and they will use it for the 2nm node to begin with.\n\nI'm still not sure about the potential yield issues of 1.8nm vs. 2nm nodes, or how they may influence the margins but let's see... It's an interesting race for pushing Moore's Law to the limits!", "score": 2, "replies": []}]}, {"body": "That's true, because Intel has a habit of taking risks for every node, while TSMC likes to take the traditional Japanese style of continuous improvement manufacturing.\n\nEdit: I know TSMC's in Taiwan, not Japan.", "score": 8, "replies": [{"body": "For what its worth, I knew what you meant without your edit.", "score": 3, "replies": []}, {"body": "illegal cable apparatus one sulky station alive late jobless oil\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -7, "replies": [{"body": "Omg everyone knows that. I'm not saying TSMC's in Japan, but they merely adopted that framework of manufacturing.", "score": 23, "replies": []}, {"body": "Asian people amiright", "score": 11, "replies": [{"body": "All Asian n shit…", "score": 1, "replies": []}]}, {"body": "Poor comprehension skills", "score": 2, "replies": []}]}, {"body": "That sentence does not make sense.", "score": -4, "replies": [{"body": "Do tell what part you find hard to comprehend", "score": 3, "replies": []}]}]}, {"body": "This is false. Intel ordered the first one yes but the others already ordered aswell. For example \n\nhttps://wccftech.com/tsmc-says-2nm-production-will-start-in-2025-advanced-high-na-machines-will-be-acquired-in-2024/amp/", "score": 2, "replies": []}]}, {"body": "I went huge on Intel stock in my Roth IRA.  They aren’t going anywhere.", "score": 12, "replies": []}, {"body": "There's so many INTC bagholders that post this type of shit over and over again, that I can't really take any of it seriously. Look, I've been there. I've been a bagholder that clung to every piece of mildly positive news, so I get it...", "score": 13, "replies": [{"body": "Pretty sure every post on here is from those that own whatever company so they can see the value of their own stock increase.", "score": 6, "replies": []}, {"body": "Reevaluating a stock when new info comes out is the purpose of this sub", "score": 1, "replies": []}]}, {"body": "ya sure. Wait a few years and they’ll announce there’s been a set back.\n\nIntel is desperate for positive bullshit news . They don’t have to deliver on it. Just spam hopium to boomer investors so they don’t sell the stock\n\nThere’s is zero chance tsmc will ever lose to these fools at intel. They have intel lapped when it comes to fabricating chips.", "score": 47, "replies": [{"body": "Why are you so certain on it? AMD looked like hot garbage for years and managed to turn it around as a much smaller company. What prevents Intel from doing something similar? Your bias is shining through like a nuclear bomb through transparant glass.", "score": 96, "replies": [{"body": "People think their opinions are facts. Cheaper prices for me.", "score": 45, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "They finally put a decent engineer in charge instead of horrible sales execs at least.", "score": 5, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[removed]", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "TSMC makes those 7nm, 5nm chips for AMD..that's why AMD is beating Intel lol", "score": 34, "replies": [{"body": "Kinda wish some of my 401k options had a higher Intel holding…", "score": 4, "replies": []}, {"body": "TSMC is in a bad spot considering China's aggression, and doesn't have government funds.  People seem to just assume they will always be intact and competitive, but these things can shift in just a few years.  If TSMC flops out in a few years and Intel is suddenly making AMD and Nvidia chips, then what?\n\nThe current future of Intel looks mediocre to absolute amazing.\n\nNvidia and AMD are at the top, and must keep improving just to maintain their current high price, which will be hard for AMD, and possible for Nvidia.  Intel just has to stabilize to keep going up.", "score": 4, "replies": [{"body": "They have no product in AI chips..that's where the growth is in Semi. I don't see how they overtake AMD, NVDA any time soon. On the foundry (chip manufacturing) side, they are behind TSMC and Samsung who are both investing tons of capital. To me, Intel is a value trap.", "score": -2, "replies": [{"body": "You're right, they have products in down to earth chips.  This means less potential for hard swings up, but what do you think is going to happen if one or neither of these companies end up winning the AI war?  The hype is they are the next big thing, and if they aren't?  That's dotcom bubble burst danger there.  I have some faith in Nvidia from their past, but both AMD and Nvidia are in incredible danger to drop to old values if something doesn't go right, if AI ends up less useful than anticipated, or even if it is useful, but not as glamorous as it currently seems.", "score": 4, "replies": []}]}]}, {"body": ">TSMC makes those 7nm, 5nm chips for AMD..that's why AMD is beating Intel lol\n\nAMD's 7nm Milan chips are more power efficient than Sapphire Rapids, and more performant in some applications as well. It's not just the node, Intel is getting out engineered in the core development area as well.", "score": 6, "replies": []}]}, {"body": "Designing chips is not the same as fabricating them….\n\nIt’s a completely different ballgame. Amd had the talent to make up in the design field to catch up because intel was losing theirs left and right and they just rested on their laurels for so long. Intel got lazy. They cannot handle being experts in two different sectors (design and fab). \n\nTsmc on the other hand has been a 100 percent dedicated to being the best it can be in the fab world. And intel is not. They are playing catch up and you can’t catch up to a company like tsmc that has the best minds in the world working on chip fab. \n\nIt’s the same case as amd trying to catch up to nvda in gpu design/architecture. It’s not possible. Because nvda has insane talent and leadership that’s been solely 100 percent fixated on GPU, for decades. Just like tsmc has been fixated on chip fab for decades. They are leading experts for the foreseeable future. \n\nIntel isn’t beating them. They aren’t even going to match them.", "score": 11, "replies": [{"body": "Intel was already a bleeding edge internal chip foundry, except for the giant fumbles with moving on from 14nm onto 10nm and the delays since, so they're not unfamiliar with this difficult ballgame. People don't know or don't remember that a lot of the problem was that the original design for 10nm was actually far more ambitious than the competition, and that led to big delays and problems, but Intel's go big or go home strategy had usually won for all of time before. \n \nMeteor Lake may be launching later this month with Intel 4, and we're onto Intel's 5 nodes in 4 years plan where delays in one don't impact the other.   \n \nWe'll see. I personally think pat is doing all the right things and the world may be surprised at a monster turnaround.", "score": 24, "replies": [{"body": "Sure. But there’s a logical reason why their shares are at the price they currently are\n\nNo ones believes in them. They’ll double their stock price sure if they show a real turn around. I don’t have any faith in them to do it. Good luck with your thesis. I’d rather invest in the actual winners to continue growing and winning", "score": -1, "replies": [{"body": "Nothing says I can't have a foot in both either. The \"winners\" already command high PE, and some of which are subject to a significant China related risk. The fact that \"no one believes in\" Intel isn't necessarily a negative on my thesis, something about being greedy when others are fearful.", "score": 16, "replies": []}, {"body": "I’d rather invest in america, and I believe in them.\n\nYou don’t speak for everyone.", "score": 11, "replies": [{"body": "Go for it. I’d rather invest in stocks that actually go up. America or not.", "score": -6, "replies": [{"body": "Not sure why you’re being downvoted. Seems like a rational statement to me.", "score": 4, "replies": []}, {"body": "Hey 116 days later how you feeling about this comment now?  Just curious.", "score": 1, "replies": []}]}]}, {"body": "Not really, part of it has been issue they are dealing with, part of it is AMD and even Nvidia have been so hot lately.  Hype has a big factor as short term profits can be seen in them, whereas Intel is expected to improve, but in the future.\n\nTruth is, AMD and Nvidia are at least a little overpriced right now, so one fumble, and they drop hard.", "score": 2, "replies": []}]}]}, {"body": ">Intel isn’t beating them. They aren’t even going to match them.\n\nI pray you're not working at Intel right now. \n\n>the same case as amd trying to catch up to nvda in gpu design/architecture. It’s not possible\n\nI pray you're not working at AMD or Nvidia, either.", "score": 7, "replies": []}, {"body": ">Amd had the talent to make up in the design field to catch up because intel was losing theirs left and right and they just rested on their laurels for so long. Intel got lazy.\n\nJust blatantly false. Intel was too ambitious with their 10nm goals that led to several delays. It wasn't for a lack of trying that Intel fell behind. \n\n>They cannot handle being experts in two different sectors (design and fab).\n\nThe hopium is crazy lol. \n\n>It’s the same case as amd trying to catch up to nvda in gpu design/architecture. It’s not possible. Because nvda has insane talent and leadership that’s been solely 100 percent fixated on GPU, for decades.\n\nThe massively ironic part about this is that MI300 is an insanely impressive chip and piece of hardware that is rumored to come pretty close to H100 in TFLOPs as we (depending on the format). \n\nMi250x already had stronger FP16, FP32, FP64 Tflops than A100, and more memory to boot. A100 was more focused in AI. \n\nRDNA 2 was more efficient than Ampere in raster, and pretty much just as fast. \n\nAMD is able to compete hardware wise, it's the software bridge that is harder to overcome. \n\n>They are leading experts for the foreseeable future.\n\nGo back many, many, years ago, and the same thing would have been said about Intel.", "score": 6, "replies": []}]}, {"body": "The sheer amount of capital required to not only produce the necessary fabs, but also keep up with technology as you're developing said fabs is more than obscene even with the government funding they're recieving. It will take years and a lot of things to go right to get these foundries producing chips at a level TSM is at the moment, and that's not even factoring in the improvements they make while Intel is getting their shit together\n\nIt's a sisyphean task that people here are taking as given just because our incredibly inefficient and frankly out-of-touch government is shoveling money at them. This really isn't an industry you can just throw money at and see solid results in the immediate", "score": 1, "replies": []}, {"body": "Because from past experience, no one should have faith in Intel.\n\nCan they surprise us? Of course they can. But saying “if x stock can do it, why not y stock” is bad reasoning. \n\nLet’s see if they can keep the good news streak going.\n\nEdit: holy shit have the new intel bros forgot about the infamous Bob Swan??", "score": 0, "replies": [{"body": ">Because from past experience, no one should have faith in Intel.\n\nIncluding their total dominance through the Core era while AMD was making garbage CPUs?", "score": 8, "replies": [{"body": "I member them trash AMD phenom CPUs", "score": 3, "replies": []}, {"body": "It’s funny how the stock price doesn’t reflect that dominance. It’s almost like their is reason the price is so low compared to its competitors…", "score": 1, "replies": [{"body": "No shit, AMD are beating them now. You said 'past experience' as if CPUs have only been around for five years, forgetting that AMD almost went bankrupt from years of crap CPUs prior to their current architecture.", "score": 5, "replies": [{"body": "Then AMD brought in Lisa Su, stock went down to $1.80 range from $2.40 then slowly back up then up even higher to eventually $109. \n\nIntel went through Bob Swan’s idiot reign stagnant as hell, Pat took over and somehow went from $61 range to $36. \n\nAnd what, now that they have a streak of good news I’m supposed to believe them? Hahahaha.\n\nIt’s Intel, they will eventually fuck it up.", "score": 1, "replies": [{"body": "Maybe they will, but also maybe AMD will. Both companies have had periods of stagnation and periods of dominance. Su joined in 2012, Zen wasn't released until 2017. The exact things you're saying about Intel could have been said about AMD in, frankly, recent history. Why would you have believed AMD with a stock price of $1.80 and multiple recent crap CPU generations?", "score": 1, "replies": []}]}]}, {"body": "AMD was caught up in the meme stock craze for years, and tech was also in a craze during COVID.  Intel had bad news, so everyone jumped on AMD and Nvidia, which are cripplingly overpriced right now.  \n\nJust one bad year will trash AMD, whereas Intel has years of R&D potential to come back.", "score": 0, "replies": [{"body": "Intel nationalism here folks", "score": 1, "replies": [{"body": "Not sure if that is a quip or another conspiracy being spread by the dumb people, hard to tell nowadays.\n\nSince you missed the whole part about Covid-19 revealing how bad it was to fully rely on China for critical technology, this isn't \"Intel nationalism,\" it's the fact that we need internal production for safety reasons and Intel won that, so now they will be more stable than the company in a country being constantly threatened by China.  The same kind of people saying China will never invade seem similar to the same that said Russia would never invade Ukraine.", "score": 3, "replies": [{"body": "Lots of Intel's fabs are outside the US and significant parts of the manufacturing still occurs in China or Taiwan especially most if not all motherboards.", "score": 1, "replies": [{"body": "...so you're basically saying, bringing more of it home is a good thing?\n\nNot sure what the issue is here.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "What do you mean?  Before 2000, AMD was nothing and Intel dominated, their performance killed AMD.  They faltered from 2000-2010, then sent AMD to the cleaners for another decade.  For about 10 years, AMD was top tier trash, even when their \"performance\" was somewhat close, they were incredibly inconsistent.  In fact, the only place they dominate right now in is server CPUs, their PC CPUs range from slightly better to worse than Intel.", "score": 5, "replies": [{"body": "Bro look up Intel’s company news the last 5 years no way you’re this stupid \n\nIt’s this the rumored intel nationalism?", "score": -4, "replies": [{"body": "Oh dear lord, this really is some insane right-wing conspiracy, isn't it?\n\nAlso, no, AMD only recently matched Intel's PC performance, they have had shit for years, their quality is inconsistent.\n\nThis feels like fanboyism from you.", "score": 2, "replies": []}]}]}]}, {"body": "You realize AMD surpassed Intel because they source from TSMC, correct? Seems like your bias for intel is shining fairly bright", "score": 0, "replies": [{"body": "Im biased towards neither. I hold positions in both AMD ($50) and Intel ($28). But to say: \"There’s is zero chance tsmc will ever lose to these fools at intel.\". Sound extremely emotional and is just incorrect. A lot can change in a few years in the semiconductor world. AMD didn't just surpass Intel by sourcing from TSMC. They still needed a design in Ryzen and their data center chips to accomplish that.\n\nIntel was just too complacent with its profits and got their ass beat. Now that the financial executives are out and engineering is back. I certainly do not think that it is impossible for Intel to turn it around in a few years. Hate them or love them Intel still has a lot of talent. In fact, they are somehow still competing with AMD/TSMC with outdated nodes. Moreover, there is too much demand for TSMC to supply and that demand is only going to grow in the future. So, Intel only has to be close, as they are now, to eat away some market share with their fabs.", "score": 4, "replies": []}, {"body": "Lol this is completely false. AMD started gaining back market share back when Intel still had the better nodes vs TSMC. AMD isn't even using TSMC's cutting edge node that's better than Intel it's Apple. And all three of Nvidia, Intel, and AMD, have faster chips than what Apple is putting out. Apple's only advantage is in person die power efficiency, and even then it gets blown out by proper server CPU efficiency still on older nodes.There's A LOT more to chip design than what node they use. Just last GPU generation Nvidia proved AMD still couldn't catch up even using TSMC'S node compared to the shitty Samsung node the 3000 series used.", "score": 1, "replies": [{"body": ">AMD isn't even using TSMC's cutting edge node that's better than Intel it's Apple.\n\nNo, so is AMD lol. Even TSMC's 2nd best node is still better than Intel's. There is some overlap where Intel and AMD use the same node (Zen 3 vs ADL for example), for the most part AMD has released products on a better node earlier than Intel. \n\n>Apple's only advantage is in person die power efficiency, and even then it gets blown out by proper server CPU efficiency still on older nodes.\n\nApple develops stronger IPC cores than Amd, Intel, Nvidia. Spec2017 industry standard testing show this. They blow Intel and AMD out of the water, because they develop massively wide cores that don't clock high. \n\n>even then it gets blown out by proper server CPU efficiency still on older nodes\n\nBecause AMD and Intel both have a shit ton more cores in their server CPUs vs Apple's low power mobile chips? What? \n\n>There's A LOT more to chip design than what node they use.\n\nI completely agree\n\n>Just last GPU generation Nvidia proved AMD still couldn't catch up even using TSMC'S node compared to the shitty Samsung node the 3000 series used.\n\nEh. That's not the best example. Nvidia's die was like 20% larger and was less efficient than RDNA 2, and they were pretty similar in performance (high end vs high end).", "score": 0, "replies": []}]}]}, {"body": ">Why are you so certain on it?\n\nBecause Intel can get their hands on a whole lot of government money if they talk big. I become more skeptical of what a company says when that company is being heavily subsidized.", "score": 0, "replies": [{"body": "TSMC is building fab plants in the US, taking some of the cash from Biden's legislation to bring the semiconductor supply chain back to the US.", "score": 3, "replies": [{"body": "Yeah, some. Whereas Intel depends on it.", "score": 1, "replies": [{"body": "Not just the US, also in Europe. TSMC needs a corporate survival plan. I don't think Xi will attack. They pressure economically and politically and wait out their opponents.", "score": 2, "replies": []}]}]}]}]}, {"body": "I’m not an Intel doomer but I don’t see how they can compete with TSMC that has Taiwanese labor manufacturing chips 24hrs a day. Don’t know if we can compete with that work ethic.", "score": 6, "replies": [{"body": "You do realise that all of Intels fabs are 24hr, seven days a week.", "score": 15, "replies": [{"body": "He does not, obviously", "score": 6, "replies": []}]}, {"body": "Ya both South Korea and Taiwan have a complete different culture. \n\nIntel among many other old school American companies like ford GM GE etc has a lot of lazy as shit workers and executives who just don’t care that much because they are going to make money regardless of effort.", "score": -3, "replies": [{"body": "I don’t think American workers are lazy as shit.  Americans just have no concept of what manufacturing work in Asia is like.  \n\n12 hours a day, 7 days a week, maybe a few days off every couple of months.  Live at factory dorms.  Their life is dedicated completely to the factory.  Not wanting to do this doesn’t make Americans lazy.  They just have choice.", "score": 18, "replies": [{"body": "They are also not as skilled as Asian workers", "score": 2, "replies": [{"body": "This is also not true.  Less disciplined I would agree, but not less skilled.  Discipline is also a function of dedication to the job, which US workers are not, in part because they have better options.", "score": 5, "replies": []}]}]}]}, {"body": "AI and robots will change the game.  Human still needs to sleep, pee, and eat.", "score": 1, "replies": []}]}, {"body": "Oh young one.  Google 3dfx, and their former 800 lb gorilla lead over NVDA.  One product line -wide change flipped the tables and we never saw them again.", "score": 1, "replies": []}, {"body": "Yup. My feelings exactly.\n\nSet an unrealistic future goal and then suddenly \"set backs\".", "score": 1, "replies": []}, {"body": "Intel has been doing this for years. I don’t understand how they keep finding gullible investors to trick.", "score": 0, "replies": []}, {"body": "Nvidia, AMD, and Apple will be using them soon enough.  With a nice backdoor for the US government.", "score": -6, "replies": [{"body": "Apple completely abandoned Intel 5 years ago and is buying up all of TSMC’s leading edge supply….", "score": 4, "replies": [{"body": "At the moment.  Intel doesnt provide enough capacity yet.", "score": 3, "replies": [{"body": "Apple all but directly funds TSMC's next gen node development. TSMC's and Apples' relationship is many times stronger than AMD or Nvidia's relationship with TSMC. I find it highly, highly unlikely Apple returns to Intel, even for their fab services.", "score": 2, "replies": []}]}]}, {"body": "They are not going to use strictly inferior chip quality. That’s just bad business\n\nThe only way intel really moons is if China launches a full scale invasion on Taiwan and takes it over lol.", "score": 4, "replies": []}]}]}, {"body": "Intel calls to moon?", "score": 2, "replies": []}, {"body": "So buy more.", "score": 2, "replies": []}, {"body": "Ha! That is outright absurd.", "score": 2, "replies": []}, {"body": "so many INTC haters coping hard in here. I'm glad reddit still hates INTC must mean shit will be good.", "score": 2, "replies": []}, {"body": "well, dreams are free, no?\n\ngreat banter from gelsinger with his $200M a year comp.", "score": 2, "replies": []}, {"body": "News like „we reach equality in 20XX, or in X years from now“ are so desperate. It means they are shit  now for at least X years.\n\nThere is no huge Turnaround compared to other companies in one of the most competitive Industry.  They managed to lose contact for years, give me one reason why they should move faster than every competitior???\n\nThese news are the same since 2019. They are two years behind.\n\nGood luck with your calls. The amount of bagholders selling their green bags will slow down the movement for years, if intel is competitive again. \n\nPut your money in something else, you still have time to jump on the train. There won‘t be news which will lead to a doubler overnight.", "score": 3, "replies": [{"body": ">here is no huge Turnaround compared to other companies in one of the most competitive Industry. They managed to lose contact for years, give me one reason why they should move faster than every competitior???\n\nTSMC is insanely conservative, and Samsung is nearly as much of a meme as a foundry as Intel is, on top of facing internal corruption issues. \n\nPlus TSMC has delayed their 3nm program, giving even more time for Intel to catch up. N3B (the OG N3) is apparently so bad that only Apple is going to use it, and even they are slowly going to shift over to N3E (the 'working) 3nm, in 2024, when N3E is going to start being seen in products. \n\nThey are also the last major fab to switch over to GAAFET (N2), and won't be seeing BSPD until years after Intel planned to introduce it. N2 also is very conservative, and isn't even a \"real\" node jump in terms of density. \n\n>These news are the same since 2019. They are two years behind.\n\nExtra context:\n\nThe first \"real\" 10nm from Intel launched 2-3 after TSMC 7nm. \n\nIntel 4 is launching 2-3 years after TSMC 5nm first had its debut. \n\nIntel 3 and TSMC 3nm are planned to launch at around the same time", "score": -1, "replies": [{"body": "For extra context it should also be explicitly noted that Intel's nm and TSMC's nm are not the same so while you can compare, just comparing the numbers for the size of the node is wildly misleading.  The Intel 10nm was equivalent to the TSMC 7nm and their 7nm was equivalent to TSMC's 5nm until Intel renamed all their stuff going forward because TSMC were cleaning them out marketing wise (it's now called Intel 7, and what they called 7nm will now be Intel 4).\n\nThe launch of the 3nm is much less important than they yields - TSMC are not charging Apple by the wafer (as usual), but by the usable chip because their yield is reportedly 55-65%. No idea what Intel's is. Samsung's is apparently lower, but improving.", "score": 6, "replies": [{"body": ">The launch of the 3nm is much less important than they yields - TSMC are not charging Apple by the wafer (as usual), but by the usable chip because their yield is reportedly 55-65%. \n\nYe, apparently N3B (the base version of N3) is pretty broken in terms of yields. N3E is fine though, and looks to be what most customers are using. \n\nI am pretty interested in what version of N3 Intel is using though. N3E and N3B have different design rules, so if Intel switched from N3B to N3E, they would have had to reimplement their design (new stepping). I would wager a guess that ARL was originally designed for N3B as well since it was supposed to launch EOY 2023.", "score": 1, "replies": []}]}]}]}, {"body": "Tech moves too fast to consider what might or might not be in 2025. TSMC have their own plans to go even further by 2025 than intel for sure considering the trajectory and velocity both companies are at right now. \n\nWith that said, I do have some shares of INTC. I wouldn't could on them regaining any form of market dominance like they used to enjoy. However, I still think Intel would be able to hit 60 dollars. Hence why I'm still holding.", "score": 2, "replies": []}, {"body": "Keep pumping hopium Intel. Maybe one day you will be close to Samsung foundry.  \nNow you are just above GloFo level", "score": 1, "replies": []}, {"body": "I'm not a tech guy, can someone explain what the nodes they're talking about are?", "score": 1, "replies": [{"body": "A process node is a term how small the working components in a computer chip are. The smaller the node the more efficient the chip. So more performance per watt (the most important factor for data centers).\n\nThese nodes kind of lost their meaning so 2nm vs 1.8nm does not mean that 1.8nm is better. Mostly marketing but 10, 7 and 5nm nodes are improvements over each other.\n\nIntel got stuck on 14nm so they created 14+nm and 14++nm which could keep up with TSMCs 12nm process node.", "score": 7, "replies": []}]}, {"body": "Intel is more stable than AMD on many software.", "score": 1, "replies": []}, {"body": "These guys are charlatans and have been tricking gullible investors for years with this kind of language. They are all talk, no results.", "score": -1, "replies": [{"body": "I'm just surprised 7/10 of the top 10 semiconductor design companies, a total of 43 companies, and the US DoD have all been tricked by these mischievous Intel PR representatives as well.", "score": 5, "replies": []}]}, {"body": "Why is Intel targeting TSMC?  TSMC only makes chips for customers.", "score": -2, "replies": [{"body": "Intel is a combined design shop and foundry. their designs are limited since their foundry side is significantly behind what, say amd can have tsmc make for them.\n\nit's why Intel has no competitor to the amd ryzen architecture in terms of cores per watt.", "score": 2, "replies": []}]}, {"body": "Not touching this stock until they get a new CEO.", "score": 0, "replies": []}, {"body": "This is more of a battle ASML vs INTEL and not TSMC, since they only buy the machines. Maybe I am missing something? \n\nIf intel can prove their technology, then they definitly can overtake TSMC. Lets see.", "score": -11, "replies": [{"body": ">This is more of a battle ASML vs INTEL and not TSMC, since they only buy the machines.\n\nHuh? Both Intel and TSMC buys ASML machines.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": ">Intel cards can’t even run starfield, TSMC supremacy remains more relevan\n\nThe most ironic thing about this is that Intel's GPUs are made by TSMC \n\nAnd that Intel's own fabbed CPUs are destroying TSMC's fabbed AMD CPUs in starfield (likely due to the fact that RPL supports faster memory than Zen 4). \n\nBut in all seriousness, no one should be using one game to determine how good Intel's foundry is versus TSMC's lol.", "score": 3, "replies": []}]}, {"body": "Qualcomm's CEO Cristiano Amon believes that Apple will debut its own in-house 5G modem chip with the 2024 iPhone 16 series. Apple bought Intel modem division to replace Qualcomm modem. Connecting the dots, Apple maybe send it modem chip contract to Intel as part of deal.", "score": 1, "replies": []}, {"body": "I’m still wondering what happened to tower semi. China put a stop to that so easily.", "score": 1, "replies": []}, {"body": "Intel Predicted to Rely on TSMC for Increased Outsourcing in 2024 & 2025.  \nNot so leadership after all, Intel", "score": 1, "replies": []}]}
{"title": "Wouldn't it be much more logical to swing trade in Roth IRA's and long-term hold in regular accounts instead of the exact opposite?", "selftext": "Wait a second before you have a meltdown over this. Hear me out, then tell me that I'm a dumbass.\n\nIt's my belief that most people turn into the Boglehead types over time because of their experiences with paying taxes on short-term capital gains and long-term capital gains. Newer investors don't have the experience with dealing with their taxes as much, so they tend to swing for the fences with shorter-term positions.\n\nMore seasoned investors tend to buy and hold, but this is a learned behavior because they know that their absolute worst case tax scenario on a long-term gain is 20 percent (federally). Of course, you only pay the 20 percent on long-term cap gains if you're income is over like 492k or something. Most end up paying about 15 percent federal tax on their long-term cap gains. Short-term cap gains seem to be taxed almost double that amount, obviously it depends on your exact tax bracket situation, but you get the point.\n\nThus, it's been beaten into the heads of seasoned investors that it's just smarter in the long run to hold positions for at least a year, because your tax bill is often cut in half, or almost in half. You do this long enough, and it becomes ingrained in your investing personality.\n\nAll of this makes perfect sense to me.\n\nOk, now let's talk about Roth IRA's. With Roth IRA's, if you're doing things correctly, there's ZERO taxes on your earnings when you're taking your money out. Obviously you need to be 59 1/2 years old and you need to have passed the 5-year rule, etc., etc.\n\nBut if ultimately there's no tax implications whatsoever for investments that are under the Roth umbrella, why do most people tend to hold things for the long-term, and be ultraconservative?\n\n**WAIT!**\n\nI already know what you're going to say, but I'm going to argue that it's nonsensical. You're going to say because Roth IRA's are designed for retirement, and when you get up to that age you should be a lot more risk adverse, because you really need this money for your retirement and you can't be screwing around, taking penitentiary chances.\n\nHowever, here's my argument to that. Consider all of your investments, Roth and normal brokerages as this large bucket of water. Most ~~people~~ investors will have a Roth account and a regular brokerage account. Due the limitations on how much you can get into a Roth each year, it's likely that most people will have at least 5 to 6 times as much money in their regular brokerage accounts as their Roth accounts. For example.... Imagine somebody has 50k grand total in various Roth accounts. Maybe a standard issue Roth and a 401k Roth. But they have 250k in a \"normal\" brokerage account.\n\nIn this scenario, less than 17 percent of their overall investment money is in their Roth. So, the argument that they need to be ULTRA CAREFUL WITH THEIR ROTH MONEY is pretty illogical, because it's such a small percentage of their overall scenario.\n\n**Wouldn't it be tremendously more logical to actually trade that 17 percent of their account more aggressively, when it's the only 17 percent that isn't negatively affected by moving in and out of stocks?**\n\nThink about the guy that has Microsoft stock. Been holding MSFT for years. He knows the ups and downs. The peaks and valleys. He can probably tell you countless times he would have taken profits if only there wasn't a major tax consequence. So, he doesn't take profits when the stock gets ahead of itself, and then buy back in during a retracement. But his reasoning is tax implications. Inside a Roth, there's no tax implications. Thus, this same investor could sell out of MSFT when he thinks it's gotten ahead of itself, and then buy back in during a retracement and end up with more overall shares. All with no taxable implications whatsoever.\n\nNow obviously, nobody can predict the future and sometimes people are going to get it wrong. They'll sell MSFT when they think the stock has gotten way ahead of itself and then it continues to go on a tear and now he can't buy back in and still have the same number of shares.\n\nBut by the same token, just talk to any Amazon investor over the last three years. That shit has basically gone pretty much nowhere for a three-year period. So the whole buy and hold forever strategy hasn't worked out that great for AMZN holders. \n\nIt cuts both ways. Don't just cherry pick the example of it hurting.", "id": "16a1qom", "created_utc": 1693856402.0, "score": 100, "upvote_ratio": 0.81, "num_comments": 194, "comments": [{"body": "Yes it would be more logical.", "score": 87, "replies": []}, {"body": "I trade in my IRA and hold in my regular account", "score": 80, "replies": [{"body": "but is it Roth though? Cause seems like it would be much better in a Roth. Although I did inherit the standard IRA from my Mom, and there is an advantage in trading over there in a certain way, because basically it doesn't matter whether you hold long-term or short-term you're going to be taxed like short-term either way. So I get it.", "score": 10, "replies": [{"body": "Doesn’t matter if Roth or not", "score": 14, "replies": [{"body": "but traditional IRA you pay taxes on the gains. roth IRA you don’t pay any taxes on the gains. that was the whole point of the post…", "score": 6, "replies": [{"body": "The benefits of ROTH vs t-IRA are debatable and for the purposes of the OP, don't matter. The point is that if you're going to trade options or equities, there are advantages to doing this in your IRA regardless of type. At least that's how I read it - I mean, it's not really clear tbh.", "score": 2, "replies": []}, {"body": "You pay taxes on distributions from a traditional IRA. You do not pay taxes on “gains” in a traditional IRA.", "score": 2, "replies": []}]}]}, {"body": "If you inherited both, It'd definitely be better in a roth. However, It would still be beneficial in a traditional because taxes were never paid on the money you invested, so you could swing trade larger volumes.", "score": 2, "replies": []}]}]}, {"body": "Yep had this thinking myself.  Then proceeded to lose $40k from my Roth last year before I decided I wasn’t smarter than the market, yet again.  Made about $5k back the old fashion way but that $40k is gone, good money after bad and all.  Your thinking is correct if it goes your way.  If it doesn’t well…you can’t add more than the max every year.  Margin is a great idea too until it doesn’t work.", "score": 91, "replies": [{"body": "OP thinks he is so smart for figuring out his \"secret strategy\" and has nothing but condescension for everyone that disagrees with him here in the comments. He's about to learn the lesson that almost all day traders learn eventually: that day trading doesn't work long term. Nobody can efficiently time the market. Holding almost always results in higher profits than trying to swing trade.\n\nThere have been so many times that I considered selling a position at what seemed like a high point, only for it to go up another 10% the next week, and another 5% the week after that. When you try to swing trade it is so common to accidentally miss the greenest of the green days and be stuck confused whether or not to buy back in with the stock up 15%, all of which you didn't get to take advantage of because you weren't invested because you were trying to swing trade. Just to make an extra 2% profit by exiting your position at a seemingly high point. \n\nCan't wait for OP to come to this realization after experience situations like this over and over again", "score": 23, "replies": [{"body": "I don't day trade. I don't even \"swing trade\" really.\n\nHere's an example of my logic.\n\nJohnny gets lucky and buy's NVDA stock in October of 2022 for only $120 per share. The stock explodes in a matter of 8 months to like $480 something. He now believes the stock is wildly overvalued, but he's completely committed to avoiding short-term capital gains. He's a buy and hold guy. Even though he knows in his heart of hearts that the stock is wildly overvalued, the fact that he might have to pay a 30 percent tax instead of a 15 percent tax just bothers him on a subconscious psychological level.\n\nLarry also gets lucky and buy's NVDA stock in October of 2022 for only $120 per share. The stock explodes in a matter of 8 months to like $480 something. He now believes the stock is wildly overvalued.\n\nLuckily, he bought the stock in a Roth IRA account and isn't *forced* to hold it longer than he deems necessary to try to *save* some money on taxes. He sells out of the stock, because he's not letting the IRS *force* him to make decisions on when to enter and exit stocks. There's no subconscious psychological pressure forcing him to hold for at least 365+ days.\n\nThe stock drops dramatically and he buys again after the retracement.\n\nI suppose a scenario like this totally impossible?", "score": 11, "replies": [{"body": "Not totally impossible, no.  The question will always be if Johnny can continue to time extremely unusual valuation events without the benefit of hindsight.\n\nYou could go Cramer and \"trim\" your positions in wildly overvalued stocks in order to accumulate funds to buy into undervalued stocks.  I've been thinking more and more about this as I've held onto positions that then crash as we saw following November 2021.", "score": 9, "replies": []}, {"body": "A bit of luck mixed with that sense of overvaluation is why I did something similar in a Roth holding TSLA pre-5:1 split and S&P 500 inclusion.  Went up 4x+ in a Roth (which really is like hitting the lottery given the tax free future withdrawals, but the annual and income contribution limits).  I sold all my TSLA near peak to diversify.  One of my larger subsequent positions dropped 20% in the post COVID crash that I’m still holding and feel good about as a LTH in 5G/6G, and I started to buy back TSLA after it dropped significantly and have about 20% the position I formerly held, which is in the amount of my original ROTH balance when I first bought TSLA, but at a DCA about $40 lower than the price I sold, so diversified and got a significantly lower DCA on 20% of what I formerly held in TSLA.  All told, I gave some back in 2022 but in 3 years remain 3x+ up in the Roth with companies I like as LTHs, though always observing for fundamentals and valuation spikes and not unwilling to swing trade a bit, or pare off holdings for some profit taking and reinvestment.  TL;DR: Bottom line is TSLA set me up for success in my Roth but it’s up to me how I play it.", "score": 3, "replies": [{"body": "Makes sense.", "score": 1, "replies": []}]}, {"body": "NVDA is worth over $900 a share now. Ya.....$480 was overvalued....", "score": 1, "replies": [{"body": "Great, can you tell me who is going to win the NBA Finals this year and what the final score will be in the final game?\n\nOh, wait... you can't predict the future.\n\nNeither can I.\n\nI made this post like 8 or 9 months ago (if not longer), so how the fuck am I going to know that NVDA is going to absolutely smash their earnings for the last several quarters?\n\nI was just giving a hypothetical scenario. I'm honestly not sure that I even thought NVDA was overvalued when I posted this, because if I did, it's strange that I never sold any of my shares. \n\nI'm long NVDA right now, and fully expect them to smash their earnings in a few weeks and explode as high as $1150 per share.\n\nI do think that NVDA will come back to Earth eventually, once all the pent up demand has been satiated, but I think they might have another year to 18 months before this happens.\n\nI will try to exit NVDA one quarter early, rather than one quarter late, but that's about the only thing I can say about that", "score": 1, "replies": []}]}, {"body": "Hopefully Johnny didn’t sell because NVDA is more than 2x if he sold at $480😂", "score": 1, "replies": [{"body": "Johnny bought some NVDA about 5 weeks ago for $801.\n\n(the day it dipped to $758, I think it was a Friday)\n\nJohnny is holding for now... lol", "score": 1, "replies": [{"body": "Hahaha hopefully in a Roth😏", "score": 1, "replies": []}]}]}]}, {"body": "And if you can, you probably work for a large institution and have access to very sophisticated algos. \n\nMacroscopically, the market is +EV. On any random day, month, year, hour, second, etc. it is more likely to go up than to go down. So you should want as much time exposure as possible to that positive expectation.", "score": 2, "replies": []}]}, {"body": "Yup, I rolled an old 401K into a Roth IRA when I read about how Peter Thiel made billions tax-free through a Roth IRA. I promptly lost $20K.\n\nI've made back some but I really regret not leaving that 401K alone. OP is right in theory but you need some amazing luck and/or insider knowledge for it to really work out for you. At least if I'd lost that $20K in my brokerage I'd have a few years worth of tax offsets, but alas.", "score": 6, "replies": []}, {"body": "This", "score": 2, "replies": []}, {"body": "This!\n\nSometimes you have to just learn by experience.", "score": 0, "replies": []}]}, {"body": "> It's my belief that most people turn into the Boglehead types over time because of their experiences with paying taxes on short-term capital gains and long-term capital gains. \n\nThis is wrong. This assumes most people will make/made money with short term trades, and the taxes is what killed them. If it was only for those pesky taxes I would have made money!! Most change after they learn they cannot beat the market. Personally I thought I could... then I realized I was just lucky to start. \n\n> However, here's my argument to that. Consider all of your investments, Roth and normal brokerages as this large bucket of water. Most people will have a Roth account and a regular brokerage account. Due the limitations on how much you can get into a Roth each year, it's likely that most people will have at least 5 to 6 times as much money in their regular brokerage accounts as their Roth accounts. For example.... Imagine somebody has 50k grand total in various Roth accounts. Maybe a standard issue Roth and a 401k Roth. But they have 250k in a \"normal\" brokerage account.\n\nWrong. According to the SEC, 38% have no investment accounts, 29% have only retirement accounts, and  33% have a taxable brokerage account. Lets also be clear, your view on how much an average person has in a nonretirement account is also wrong. According to a personal capital study, at age 40 the average amount in an nonretirement account was 68,764. Gambling 20% can greatly harm your future at this level. \n\n> Now obviously, nobody can predict the future and sometimes people are going to get it wrong. They'll sell MSFT when they think the stock has gotten way ahead of itself and then it continues to go on a tear and now he can't buy back in and still have the same number of shares.\n\n> But by the same token, just talk to any Amazon investor over the last three years. That shit has basically gone pretty much nowhere for a three-year period. So the whole buy and hold forever strategy hasn't worked out that great for AMZN holders.\n\nIn the long term almost all get it wrong trading, and not by a little bit. Look at the average return of investors by year, that is sobering. \n\nA long time ago I bought AMZN at $500 a share. Then bought more at 350 a share after a massive drop. That \"hold forever strategy hasn't worked out that great for AMZN holders\" has worked out pretty damn good.", "score": 19, "replies": [{"body": "Yeah, let's cherry pick everything except the last 3 years. Why? Because it's extremely inconvenient for your argument.", "score": -19, "replies": [{"body": "Thank you for ignoring the massive amount of information, while misunderstanding the final point.   \n\n\nLets start again, please explain where my reasoning is incorrect.", "score": 15, "replies": [{"body": "Don't forget he inherited his mom's 401K.  He's playing with house money in a sense.", "score": 6, "replies": []}]}]}]}, {"body": "For mathematical tax efficiency, yes it makes more sense to trade in your Roth because that's where more of your realized capital gains will be (unless you underperform the market as 90% of active traders do but that's another conversation.) Also, if you start realizing any significant capital gains in a taxable account it turn into a huge PITA for tax planning since it's not predictable income over the course of the year.\n\nThe reason not to do is that Roth contributions are very limited and can't be replaced once you gamble it away, then you're left with no tax benefit. So that's why it's the default recommendation.\n\nI actively trade in both Roth and taxable brokerage accounts. I'm extremely conscious of realized gains in my taxable account because of the work it will cause me for taxes as well as the actual tax bill itself.", "score": 18, "replies": [{"body": "> Roth contributions are very limited and can't be replaced once you gamble it away,\n\nThis is only a factor if you have more than $67,500 that you can add to your investment accounts per year. If you have less than $67,500 that you can add per year, this would never factor into the equation.", "score": -9, "replies": [{"body": "...huh?", "score": 10, "replies": [{"body": "You can potentially put up to a maximum of $67,500.00 into Roth accounts per year. Look elsewhere in this thread, I've explained it several times in comments.\n\nI'm basically saying that unless you have more than $67,500.00 to pump into the market every single year, this would never become an issue. If you have a lot more than $67,500.00 that you can pump into the market each year, then congrats. I sure as hell don't. I'll be lucky if I can pump 40k each year into the market.", "score": -9, "replies": [{"body": "Whatchu talking about, Willis?", "score": 9, "replies": []}, {"body": "Roth accounts yes. Roth IRA is capped. If you’re thinking about a Roth 401k you would still need to go through the rollover process to move those funds from your 401k to IRA each year. Furthermore, your employer must provide the 401k account AND allow you to contribute after tax money up to the mentioned $67k. \n\n\nOnce this is all said and done, boom you’re up $100k, you have some large unforeseen expense. You can’t pull the money out without paying penalties for withdrawing under age 59.5. You’ll be retirement rich and cash poor for today. Live life in balance and save money for retirement but don’t let your younger years fly by because time is one thing money won’t buy. I’m not skydiving or heliskiing at 60, time is never guaranteed.", "score": 6, "replies": [{"body": "This is an oddly intelligent comment.  Thank you stranger!  I assume you learned this lesson the hard way.", "score": 2, "replies": [{"body": "Nope just a niners fan… We tend to come off as oddly intelligent to Seahawks fans ;)", "score": 1, "replies": [{"body": "That is far from true, based on the average intelligence of a Santa Clara fan 🤷‍♂️", "score": 1, "replies": []}]}]}, {"body": "I'm already in my early 50's, so it's no sweat off my back.\n\nMy employer does allow both 401(k) Roth and 457(b) Roth. I can contribute a max of 30k to each, per tax year.\n\nWhy would you rollover money each year? I'd only rollover the money when I've actually retired. Also, the 5-year-rule begins on the day that you have your first post-tax deduction taken out of your paycheck and put into the 457 Roth. \n\nEven if I retire early, say after 3 years, the 5-year-rule doesn't get reset to zero years. I would have to wait another 2 years to access earnings.", "score": 1, "replies": [{"body": "You need to rollover into an IRA in order to have access to all investment options. I'm not sure what your Roth 401k or Roth 457 offer, however it's more common than not that these types of accounts limit your investment options to a few mutual funds. if you've landed a job that's doesnt limit your options,  congrats to you, trade away. However, for the majority of people they don't know have a 457, much less one that doesn't limit your investment options.   \n\n\nRegardless, my prior comment was based off your post which claimed trading in a roth account, specifically an ***IRA***, which is limited to just under $10K in contributions per year, hence the need for rollovers. Given your situation, having the higher limits does allow you to use your retirement account as a trading account for the slight tax advantages. I will just throw caution to the wind that, trading is extremely volatile and for someone as close to retirement as you are, it takes a few seconds to lose a couple grand (depending on what kind of trades you're making) and miss out on years of tax free, compounded growth. For the average joe, that's a years worth of contributions on top of the annualized returns. For you, just another coin in the slot machine. Thanks for coming to my TedTalk", "score": 1, "replies": [{"body": "Yeah, there are certain limits. The first $2500 that you put into the account has to go into one of their available investment options. I picked basically the S&P500 fund with low fees. Once you have $2500 in there, then you can do a thing with Charles Schwab to actually trade in anything you want to. However, they have some weird clause where you have to make sure that the $2500 amount doesn't dip below $2500. So, the lady was telling me that most people that want to do the Schwab thing and manage everything themselves will actually wait until they have $3500 in the standard investment option before doing the Schwab thing, just in case they jump in right before a major downturn in the market. It's all a bit confusing.\n\nRegarding the trading part, I'm mostly a Megacap tech stock guy. I'm not trying to trade C3 AI or anything like that. Also, I really wouldn't be swing trading in the true sense of the phrase. It's more like I wouldn't feel like I had a gun held to my head where I absolutely had to hold something for 365+ days. \n\nAn example I give, is pretend I bought META this last January at like $125 per share, and it doubled in just 3.5 months to $250 per share. If I had that in the Roth, I'd probably just take profits. \n\nIn hindsight, maybe not the smartest move, cause META kept going up to $325 at one point, so I would have left $75 per share on the table, but if anything doubles in less than 4 months, I'd normally just cash out and be happy with the 100 percent gain in such a short period of time. I know the META example is a really rare case and that normally wouldn't happen with the type of Megacap tech that I would mess with.", "score": 1, "replies": [{"body": "Makes sense, you can only \"trade\" with Schwab if you have $2500 in the account and due to market movement you would be inelegible if you had 2499.99, thus the 3500 unofficial requirement.\n\nHonestly your post led most people astray because you mistook a Roth 401k/457 for an IRA and then further confused people when you quoted a contribution limit 10x what normal people have. I wouldnt even call what you do trading, rather opportunistic buy and hold. Not a terrible strategy given how well mega cap tech performs and where you're at in life. If you enjoy stockpicking, a Roth account is great to do it in as long as you never take a 5,6 figure loss. I've heard stories of people messing with options in their roth accounts and boy does it get messy", "score": 1, "replies": []}]}]}]}]}, {"body": "If you're talking about after tax contributions to a 401k, most people don't have access to that and it's a tax PITA if they do. Just casually saying \"you can do $67,500 into Roth\" is a little disingenuous. Good for you if your work plan supports it, although I'm not really sold on the after tax contribution concept even if it's offered. From what I understand after far too much googling, gains from after-tax contributions are classified as pre-tax (traditional) if you roll it over.", "score": 2, "replies": [{"body": "> gains from after-tax contributions are classified as pre-tax (traditional) if you roll it over.\n\nNot true. In fact, I asked this very question to a guy at Savings Plus (a California employees thing for 401k's and 457's) today. I was asking him if I were to retire in 3 years, instead of 5 or 6 years. What happens to the 5-year rule scenario? He said that I can transfer the money into a regular Roth IRA just fine, but I still need to satisfy the five-year rule aspect of it. (The 5-year-rule clock begins ticking upon the very first post-tax deduction from your paycheck) \n\nThe big key though, is that I don't have to start over at 0 years like a normal IRA (non-Roth) rollover. I'd still bank those 3 years, so it would only need to sit in my standard-issue Roth for two more years before I could access earnings. (of course also need to be 59.5 years old)", "score": 2, "replies": []}]}]}]}]}, {"body": "Yes, I agree that trading in a Roth is not only sensible, but necessary to make full use of its advantages.  It’s your goals and investment strategy coupled with your other assets and timeline that ultimately influence your investment decisions.  I also trade my taxable account for similar reasons, though with emphasis on income, liquidity and preservation of capital when making investment decisions in that account.", "score": 1, "replies": []}]}, {"body": "Over time a Roth IRA can grow to provide substantial income in retirement.\n\nMost people 'swing trading\" or whatever fad strategy they are trying underperform or worst lose money.\n\nIn a regular brokerage losses can be replaced, in a Roth IRA you potentially permanently gimp tax free income in retirement", "score": 10, "replies": [{"body": "Yeah, swing trading is definitely a fad. It was only invented like five years ago.", "score": -12, "replies": []}]}, {"body": "Yes if you like losing money in your retirement account lol", "score": 8, "replies": [{"body": "Because it's only possible to lose money if you're swing trading. There's no other way to lose money.\n\nAlso, nobody has ever sold Google, Apple or Microsoft stock when they believed that the stock has \"gotten ahead of itself\", and then added it back after a retracement. That's literally never happened in the history of the stock market. It's completely impossible.\n\nAlso, you ALWAYS do well when you buy and hold a stock. ALWAYS. Completely disregard the fact that AMZN holders over the last 3 years haven't made squat.\n\nAlso, remember, you can only swing highly speculative stocks and meme stocks. You can never swing Apple, TSM or Broadcom.", "score": -14, "replies": [{"body": "Good luck trying to time the market. We can ignore the mountain of data showing that's a losing proposition if you really want to.", "score": 3, "replies": [{"body": "Yes, I’ll just sell a stock when it goes up and buy when it goes down. I’ll do this in a Roth IRA and pay no taxes. How has no one thought of this?!?!?! This man is a FUCKING genius lol", "score": 2, "replies": []}, {"body": "Honestly, I normally hold for a longer period of time, but I don't like being psychologically forced to hold 365+ days.\n\nThe only time I'd really sell in less than a years time, is if I think the stock has wildly outperformed it's expectation. Sure, maybe it keeps blowing up and I could have had a 200% percent gain instead of a 50% percent gain, but I like taking obvious profits when they're staring me in the face.\n\nFor example... Let's say I bought META in late January of this year for $125 per share. Then, just a mere 3.5 months later the stock has doubled to $250. \n\nLong term holders would have a really hard time psychologically, selling a stock after only holding it a mere 3.5 months. It's just not in their mental psyche to do so. Reason being, they want to pay 15 percent capital gains not 30 percent. Also, maybe the stock doubles again.\n\nHowever, if all of this was happening inside your Roth IRA, a smart individual would have no hesitation jumping out with 100 percent gains in 3.5 months. It's a no-brainer.\n\nSure, the guy actually left quite a bit of money on the table, because if the guy waited till July 23rd or whatever when it was $325, he'd have another $75 for every single share. But, let's be real. Take extreme profits when they're staring you in the face.\n\nNobody ever got poor by taking extreme profits. Yes, could have had even more but cry me a river. I'd take the 100 percent pop in 3.5 months every day of the week. The stock could double again from that point and I honestly wouldn't feel that bad about it.", "score": -4, "replies": [{"body": "So you're time traveling?  Just bet on the fucking Patriots and Yankees back in the day and don't worry about your retirement account.", "score": 4, "replies": []}, {"body": "It always funny to see people on Reddit trying to \"school\" someone who:\n\n  \nChallenges group think.\n\n  \nHas done well and is sharing experiences from their journey. Yet the Redditors with nowhere near the success or account balance turn their noses up and say you will fail and it is impossible.", "score": 1, "replies": []}]}]}, {"body": "How rich are you? How many 0s in your bank account? Lol how much money have you made swing trading?", "score": -1, "replies": []}]}]}, {"body": "No, it doesn’t work because losses are not tax deductible.", "score": 29, "replies": [{"body": "You don't have losses if yo know how to trade. You can deduct losses, but they're still a loss.\n\nThe point of trading is to not have losses. If you can't do it, then you shouldn't be trading.\n\nThat's why buy and hold is always your best bet.\n\nThere's no reason to ever sell unless you need the money. Which you shouldn't need till you retire.", "score": -52, "replies": [{"body": "Bad years happen. No one gets into trading expecting losses", "score": 18, "replies": [{"body": "There's no need to \"trade\" if you're a long term investor.", "score": -29, "replies": [{"body": "The guy’s asking about swing trading", "score": 11, "replies": [{"body": "Swing traders also lose compared to just buy and hold in an index fund.", "score": -10, "replies": [{"body": "Yep. I don’t swing trade. I just hold different funds", "score": 1, "replies": [{"body": "Best way. Think long term and never sell", "score": 0, "replies": []}]}]}]}]}]}, {"body": ">You don't have losses if yo know how to trade.\n\nReally took the \"it's not a loss until you sell\" to heart, I see", "score": 5, "replies": [{"body": "You never have \"losses\" if you buy and hold and don't touch your investments for 20 to 30 years. A little QQQ and a little VTI and add, add, add, till you retire.\n\nBut if you want to trade in and out... be my guest.\n\nDon't forget taxes and always having to be right over and over for the next 20 years ....", "score": 1, "replies": [{"body": "How does this apply to using your roth to swing trade?", "score": 2, "replies": []}]}]}, {"body": "Is that you Warren?", "score": 1, "replies": [{"body": "No, it's me Bozo the clown", "score": 2, "replies": [{"body": "Hey hey Bozo was a good dude, nobody expected clowns to become evil scary villains.", "score": 1, "replies": [{"body": "Bozo always creeped me out", "score": 2, "replies": [{"body": "I mean you're not wrong to feel that way.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "From tax standpoint that is correct. Assume you are an excellent trader who does not lose in your retirement money.\n\n...", "score": 10, "replies": [{"body": "You can lose money anywhere.\n\nPeople are just so freaking short sided. Let's say I have 500k in my entire umbrella of investments, across every account. Some of these are Roth accounts, some are normal brokerage accounts.\n\nNow, let's say of this 500k total, about 50k is in my Roth. Ten percent of my entire umbrella. If I take a loss in the regular account or take a loss in the Roth, does it really matter at the end of the day? A loss is a loss and a gain is a gain.\n\nFor me, my retirement is the GRAND TOTAL of the entire umbrella. Just because 10 percent of it is in the Roth, doesn't make the Roth some magical thing that I have to be super duper risk adverse with. In fact, **my argument is that if you're going to be moving in and out of stocks with ANY percentage of your portfolio**, the most logical place to do it, would actually be your Roth, because it's the only place that isn't adversely affected by going in and out of stocks from a taxation perspective.\n\nNow, you might have somebody in this situation where they have 500k in brokerage accounts and 50k in a Roth, and they're hoping to buy a a nice 100k car with profits from their brokerage account, and maybe they will spend 20k on some nice vacation from profits in their brokerage account. In that case, I guess I could see that they wouldn't want to do those things with their Roth money, because in their mind the Roth money is reserved for retirement and not frivolous spending. \n\nHowever, I'd still argue that money is money. All this money is in one gigantic pot of money, and the only difference with the Roth part of it, is that you can't touch it until 59.5 (and some other qualifications/exemptions). Also, the Roth portion doesn't have any of the tax liabilities. But money is money. If I have 550k grand total in everything, then does it really matter which part of that 550k I'm swing trading with? Again, I still think it's way more logical to do it in the small sliver that avoids a massive tax disadvantage from that sort of in and out behavior.\n\nI think the problem that everybody is confronting with this, is that they have a really hard time of seeing the overall picture, and instead they're boxing in their different accounts as for being for different purposes, but again, money is money.\n\nsigh.....", "score": -5, "replies": [{"body": "One reason not to dump every last cent into a tax-free IRA (or HSA) is liquidity.  If I'm gonna be a big winner in a tax-free account, then I may as well be a big winner on margin instead.  But if I'm going to be using cheap margin, then I can increase my profits using borrowed money.  Right? That's IF I'm the big winner that I think I am.  And for that, I also need an extra cash cushion that isn't tied up in a tax-free account.  \nPersonally, I'll often times wait until the last day to add $$$ to my ROTH IRA for the *prior* year because I'm putting that cash to use elsewhere.  \nLong term, do I have the winningest strategy?  Well...  Do you?", "score": 3, "replies": [{"body": "I don't play with margin at all. I feel like I win way more than I lose, but I'm not going to fuck around with money that isn't even really mine. If I somehow lose, it'd be ten times as painful", "score": 1, "replies": [{"body": ">I feel like I win way more than I lose\n\nIf you're consistently beating the market, then you should be using *some* margin.  Brokerages typically don't charge any margin expense if you close out of your position before the end of the trading session.  I'm not saying to use a lot of margin.  Maybe an extra 5-10% or so.  \n\nBut you'd need to actually go back and see if you are actually winning more than losing -- or if it's just a feeling.", "score": 1, "replies": []}]}]}, {"body": "You are significantly more likely to lose your money swing trading than investing, that is why people keep bringing it up.", "score": 1, "replies": []}]}]}, {"body": "I love the way you think and I have been doing what you proposed/ listed out in exactly that fashion for last 3 years in my 401k and Roth IRA.", "score": 4, "replies": [{"body": "Nice!\n\nYeah, unfortunately, I just found out about 457 Roth's and 401k Roth's just this year. I wish I knew about this years ago. I always knew about the normal yearly limit for a regular Roth and never knew there was other ways to get money into a Roth.\n\nI think the people quickly dismissing this idea aren't really thinking about it rationally. Most people will use a small percentage of their overall portfolio to be a little less risk adverse with. Maybe the rest of their port is VOO or VTI or QQQ or something, but they take a certain percentage of their portfolio and buy individual stocks, maybe do some swing trades, etc.\n\nThis idea is the exact same thing. They just can't get past this idea that a Roth is meant for retirement, but they should forget about that aspect and just think about the bigger picture of your entire investment portfolio.", "score": 1, "replies": [{"body": "Roth 401k vs traditional 401k is a sticky conversation. Depends on your lifestyle in retirement (unknown) and income tax brackets in your retirement years (also unknown.) Tax rules can change at the whim of Congress at any time. For example Congress could decided that Roth withdrawals are subject to a tax for \"rich people who need to pay their fair share.\" Or implement a national sales tax to make up for the budgetary shortfall rather than raising income tax, so that even your \"tax-free\" Roth distributions end up getting taxed a second time.\n\nA traditional tax deferment is a huge benefit that you can realize today but Roth benefits are zero today and some time in the unknown future.\n\nIf you're in your peak earning years and you plan on a low-key retirement, then traditional is probably best.", "score": 1, "replies": [{"body": "If they changed the Roth rules that dramatically there'd be hell to pay if they didn't at least grandfather people in that had them previously. They can change the rules potentially for \"future\" contributions, in future tax years, but no way in hell could they change the game in the 9th inning and tell you that you're screwed. I'd riot like a mofo.", "score": 2, "replies": [{"body": "Look at France. Riot all you want. If the powers that be decide that it has to happen, it will happen.", "score": 1, "replies": []}]}]}, {"body": "The whole concept of compounding always works better when your starting capital is bigger. When you take your profits in roth and/or 401k, you add to that working capital. You can then start that compounding process on untaxed realized capital gains. Idk why people think that this opporunity isn't worth their time to do.", "score": 1, "replies": []}]}]}, {"body": "It would be but then it would be counter to the purpose of ROTH which is meant for retirement, meaning long term, stable, less risky. \n\nSwing trade has the sole purpose to maximize ROI, so that's counter to the purpose of Roth.", "score": 3, "replies": [{"body": "Money is money. Who gives a fu#k what it was originally designed for?\n\nAt the end of the day, you have one lump sum amount of money across all accounts. If there was ANY percentage of any of your accounts where you'd do short-term trades, it would be most logical to do them in the sliver of it that is a Roth. \n\nOh, but wait... The gubment says that it's supposed to be for retirement. \n\nWHO CARES?\n\nAre you an adult? Can't you ration it off in your own mind?\n\nDon't know about you bro, but I have a grand total amount of X. THE ENTIRE THING IS MY RETIRMENT. The whole enchilada. There just happens to be a sliver of it that isn't adversely affected by Uncle Sam if I do short term trades. For me, it would be 100 percent illogical to do short-term trades specifically in the one place where I don't have this tax advantage. (my regular brokerage account)\n\nI guess this is just too hard of a concept for most people to grasp.\n\nBy the way, I'm not trying to be an asshole to you specifically, I'm just frustrated that nobody can see the forest for the trees if you know what I'm sayin. Oh well. I tried. Hopefully the lightbulb went on for at least one person out there.", "score": 2, "replies": [{"body": "Thats why you are supposed to have different assets serving different purpose. It's is true, that thr government would not want people to use their Roth for active trading, because it's meant as an instrument of retirement and social benefit so its would be disastrous if people start trading them. Maybe you are good it, and certainly that would be wise to take the tax sheltering benefit, but to most of the general public, they would be wise to just leave it in a indexed fund. \n\nAlso, while the tax sheltering benefit is nice but to truly maximize ROI, you should apply for a trader account. Now the tax suckd but it opens up a lot of leveraging tools that if you have a sure bet, you can really leverage and win big. Of course you will be wiped out if you are wrong, but just like gambling, the only way to beat the house and is to bet big when you got a winning hand. \n\nTo an individual, you are absolutely right, but for the purpose of Roth, and it's function in our society, there is a very big difference. \n\nAlso, you seem to imply that you have quite a bit of asset, with an capital X . How is it all in Roth?", "score": 2, "replies": [{"body": "It's not all in a Roth. I'm saying that ALL of my investment money is basically retirement money as far as I'm concerned. I'm not going to use any of my money for a fancy car or a trip to Europe or something like that. I'm older than most here probably and closer to my retirement. I'm trying to do an early retirement. I've been lucky with my investments so far, so I'm in a somewhat privileged position. I've owned two homes in my lifetime and both have doubled in value.", "score": 1, "replies": [{"body": "I vote against fancy car ttoo.\n\nBut trip to Europe, defintiely!! In fact, not just Europe, go see the world especially if you are retiring early.", "score": 2, "replies": []}]}]}]}]}, {"body": "It depends if you can guarantee that you will win the swing trade. If you win then it is better to be in the Roth and if you lose it is worse.\n\nIn terms of long terms holds there is also a question if it is a dividend stock or not. If it pays dividends of course it is better to have it in the Roth, but with long term holds it doesn't matter either way.", "score": 3, "replies": []}, {"body": "I actually do this myself.\n\nTrade actively in Roth IRA and my individual is just long term holds. Haven’t lost any money in Roth, currently up considerably since starting at the end of 2020.\n\nI’ve been swing trading in it ever since (mostly with shares). Don’t see a problem if you know what you’re doing and have discipline.", "score": 3, "replies": []}, {"body": "I buy & hold in my brokerage account and swing trade part of my Roth IRA. \n\nMy wife and I are very well set up for retirement, and I don’t spend on hobbies. I enjoy the process of researching and tailoring positions to try to beat the market, so that’s what I’m doing. \n\nI respect and appreciate that we never know what tomorrow will bring, but I’m beating the S&P 500 and having fun right now.", "score": 3, "replies": []}, {"body": "I agree with you. My long term stocks are in regular brokerage and high growth/volatile stocks in ira brokerage especially  for the tax implications.", "score": 3, "replies": []}, {"body": "I sell options and cash secured puts in my Roth, along with swing for the fences position. My brokerage account is mostly VT.", "score": 3, "replies": []}, {"body": "Hey man you do you, no one is stopping you", "score": 2, "replies": [{"body": "I will absolutely do this. I tend to do very logical things.", "score": -1, "replies": []}]}, {"body": "In theory yes, but size of account could be much smaller for roth / trad ira compared to brokerage accounts.. Another problem is you can't do some trades like strangles /sell cas sec puts in IRAs. So, in theory yes, but in reality not so much.", "score": 2, "replies": [{"body": "You can indeed sell a cash secured put in an IRA. You jusy cant sell one on margin.", "score": 3, "replies": []}, {"body": "> In theory yes, but size of account could be much smaller for roth / trad ira compared to brokerage accounts.\n\nBut wouldn't this be a good thing?\n\nMost people try to be extremely safe with 85 percent of their overall portfolio, having it in stuff like VTI, VOO & QQQ. Then, with 15 percent of their overall portfolio, they might have individual stocks.\n\nSo, if your Roth accounts only make up 15 percent of your overall investment umbrella, wouldn't that make this strategy ideal to do this type of investing in an account that isn't punished from a tax standpoint for short-term movements?", "score": 1, "replies": []}]}, {"body": "Don’t know what’s best for you but at 5.25% no risk my IRA is all ladder’d T-bills.  Trade in taxable accounts so I can harvest losses and get long term cap gains I never have to sell.", "score": 2, "replies": [{"body": "Gotta love those losses right? So valuable to have losses.", "score": 1, "replies": [{"body": "Every December I sell everything that has a loss to offset as much of my gains as I can.  The gains I can't offset I let ride.  It's a pretty good system to 'cull the herd' so to speak.  Only the strongest survive.", "score": 2, "replies": [{"body": "I do the exact same thing. I tax loss harvest every December too.\n\nBut let's be honest with ourselves. Ideally, you'd like to be completely unable to tax loss harvest, because you wouldn't have any losses that you could tax loss harvest.\n\nIf you lose 10k on a stock, but you have a 10k win, then you can of course write off the 10k win, using the 10k loss. But does this actually completely negate the 10k loss? No, it doesn't. The only thing it does, is give you back whatever percentage you would have paid in taxes. If you're only paying say 20 percent tax on that, you're only saving 2k of that 10k loss. So, you still lost 8k, and nothing will ever make up for the 8k that was lost forever.\n\nWriting off losses is something that everybody should do, might as well, you get a little of it back, but it's not the silver lining that some people tend to make it out to be. (imo)", "score": 2, "replies": [{"body": "Tax loss harvesting gives me a 'safety net' so I can take risks I wouldn't ordinarily take.   Just this year for instance I'm sitting on Google shares I bought (foolishly) after their last split.  I have shares at $150, 130, 110, 90 and the last at 87.   With it back up to 135 today I am making a boat load of money.  In December I will gleefully sell the shares I bought at $150 and 130.  Those shares I have at 90 and 87 I will own till I drop dead and my son will inherit at a stepped up cost basis.\n\nI'll admit it was hard buying those last shares when I had a tree-f'ing-mundus tax loss on my hands but  now well worth it.\n\nI just now bought another lot of DIS at $82.98.   My lots on DIS are 92.14, 88.75 and 82.98.  Come December, if I need them those losses on the shares I bought at $92 and $88 are out of here.  I'm convinced DIS at $83 is not the highest it will ever be before I go 'toes up' I have all the time I need.  \n\nDon't buy DIS on my say so, Cramer on CNBC said it's going to $75 this morning.  I think he's trying to 'talk it down' so he can buy more from those he scares out of it.", "score": 2, "replies": [{"body": "On a side note, GOOG is my biggest play and I'm not sure why you'd sell any of it to be quite honest. It's going to hit $217 at some point in the year 2024. It might be December 2024, but it will happen. You can do one of those \"remind me\" things on this comment if you like.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I trade in my Roth IRA, and buy & hold everywhere else. Idk if it’s tax-optimal, but is “me doing the least paperwork”-optimal.", "score": 2, "replies": [{"body": "It's definitely tax optimal if you win more than you lose.", "score": 2, "replies": [{"body": "I win more than I lose…. But I win less than my Index funds.", "score": 2, "replies": []}]}]}, {"body": "The point is that once you contribute your cap for the year, you never get to put that money back in. A big loss in your IRA can set you back years in your tax sheltered accounts.\n\nThe loss + tax benefit you lose is immense", "score": 2, "replies": [{"body": "Money is money bro, you're not understanding.\n\nYes, you might be limited to $67,500.00 per year, but unless you have way more than that to put in each year, this is completely inconsequential.", "score": 0, "replies": [{"body": "I'm assuming that was a typo, because you're not even close to the number which is around $6500 per year. It actually doesn't even matter if you could even only contribute half that. If 3k is all the money you have to invest its even MORE important not to play games with it, in that example.\n\nMoney is not just money in this case. You're talking about thousands upon thousands of dollars that one mistake could obliterate in long term growth. Even if the loss \"today\" doesn't feel like much, throwing away whatever that would've been compounded for 30+ years does matter.", "score": 2, "replies": [{"body": "$6500 for 49 and under. $7500 for 50 and older.\n\n30k per year allowed for 401k Roth (assuming your employer has such a plan) 30k per year allowed for 457 Roth (again, assuming your employer has such a plan)\n\nGrand Total Maximum Amount = $67,500.00 (assuming you're 50 or older and also have both a 401k Roth and 457 Roth through your employer)", "score": 5, "replies": [{"body": "Who is downvoting this?\n\nLook it up. These are FACTS.", "score": 1, "replies": []}]}]}]}]}, {"body": "I am older, and I regularly trade options and stocks in my Roth IRA. I do less in a Sep IRA. You have to remember that you do not pay taxes on trades in a retirement account until the money is withdrawn. So you do not have to worry about short term or long term capital gains in a retirement account.", "score": 2, "replies": [{"body": "> So you do not have to worry about short term or long term capital gains in a retirement account.\n\nThis is kind of the whole point of this thread. \n\n\nI personally like Roth's way better than standard IRA's, because I plan on doubling and tripling my portfolios over time, and the savings would be exponentially greater on the back end than the front end, thus a Roth 401k or 457 is WAY more attractive to me personally.", "score": 1, "replies": []}]}, {"body": "I trade options in my Roth take the profit and buy dividend focused ETFs. Take the original back in and repeat.", "score": 2, "replies": []}, {"body": "Lol. Dude’s gonna blow his IRA and then blow his regular brokerage account trying to catch back up.", "score": 2, "replies": [{"body": "Maybe if I was regarded, investing in meme stocks and quick rich scheme stocks. I don't do that. I invest in megacap tech. Google is my single biggest holding.", "score": 1, "replies": []}]}, {"body": "Except that my time horizon on my Roth account isn’t nearly as long as a retirement account", "score": 2, "replies": [{"body": "You're still not understanding bro.\n\nMoney is Money. Doesn't matter where it's located.\n\nSome portion of your overall umbrella of money is dedicated towards your retirement right? What percent of it?\n\nUmbrella = every cent that is dedicated towards investing, whether it be retirement related or not.\n\nJust give me your percentage and I can break it down for you.", "score": 1, "replies": [{"body": "I put about 8% towards retirement. I swing trade to hopefully make larger gains that I can access in a short amount of time that I can then turn into other investments/purchases (eg real estate). If I were swing trading in my 401k, I couldn’t access the funds early (except contributions on the Roth portion)", "score": 2, "replies": [{"body": "> If I were swing trading in my 401k, I couldn’t access the funds early (except contributions on the Roth portion)\n\nYes, but consider this:\n\nImagine that the sum total of every single investment that you have across every single account is a large bucket of water. I'm talking like one of those really oversized Home Depot buckets of water. \n\nAt the very bottom of this bucket of water is your Roth *earnings*, that you can't touch until 59.5 (plus the 5 year rule). In the grand scheme of things, this water at the very bottom of the bucket will never be scooped out (hopefully). You can take a cup, even a Kool Aid sized pitcher, and scoop water out of the top of it, but the water at the very bottom is still there.\n\nThat's the way I view my Roth earnings that I can't touch till 59.5. \n\nIn other words, not a big deal at all. The problem is, people have a really hard time thinking like this. They tend to compartmentalize all these different accounts as being very specifically designed for very specific things.\n\nThis whole thread is about freeing your mind from the shackles that you're artificially placing on it.\n\nOf course, if you're 32 years old, and 59.5 years old is a whopping 27.5 years away, then I get it... You might need to scrape the very, very bottom of the bucket.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 2, "replies": []}, {"body": "Who the hell has $250k in a brokerage account and only $50k in an Roth IRA?", "score": 2, "replies": [{"body": "More people than you might expect. \n\nSome people are very late to the game on Roth IRA's. They see the benefit of a regular brokerage account, because they're trying to get rich. I have two young adult sons and I talk to them about Roth IRA's, but it's so hard for them to see the appeal when 59.5 years old is so far away from them. They're almost 40 years away from that. It seems like forever to them. I still have had them open up Roth's and I put $500 into each of their Roth's every single B-Day and Xmas. They don't think much of it now, but when they get close to 59.5 they'll realize they should have taken it way more seriously.\n\nAlso, I only learned very, very recently that there's ways to get $67,500 into a Roth. I had no idea you could do that. Didn't even know it was possible. I thought you were limited to $6500 or $7500 per year. If you're only putting in $6500 per year, after 10 years, that's $65,000, but you might have 400k in your brokerage account in that time. So it's very possible for it to be that sort of split.", "score": 1, "replies": []}]}, {"body": "I agree with you. I was buying and holding REITs in my Roth but sold them all to start trading. Not day trading or options trading but what I call weekly trading. For example, but AMD @ 158, sell two days later @ 176. Buy AMD again @ 162, hopefully sell next week @ 180. Even if it declines for three weeks straight, I’ll simply play the long game and hold.", "score": 2, "replies": [{"body": "Yeah, you're doing what I call a \"Swing trade Long-Term Hybrid\"\n\nBasically, you pick a company that you truly believe in, where if you had to hold their stock for 5 or 7 years, you could. So, you start off with a company you believe in. Then, you buy a dip, to try to swing it, but if it goes the other way, you convert to a long-term hold.\n\nNow, you might convert back to a swing, depending on how much time has passed since converting to a long term hold. If 7 months pass, I'd probably just stick with the long-term hold aspect, because You've already been holding for more than half a year. Might as well hold for a full year at this point.\n\nBut, if you start off with the intention of a swing, then the stock dumps, you convert to long-term hold, but it rallies back in a month or two and you can hit your swing target, then go ahead and roll with it.\n\nIt's basically a hybrid method and you can't really lose with this method, as long as you're picking stocks that you'd be ok with holding for a very long time if it went really bad.\n\nThe biggest downside with this strategy is that you might sell for your swing profit and then it just goes on an amazing run, leaving you in the dust. Like if you seel AMD at $180, but it runs to $205 and $215, etc, etc. Just keeps running and you feel like an ass.\n\nBut, that's basically the only real downside. Getting stuck in a long-term bag isn't a downside, because long-term holders have to deal with that possibility regardless.", "score": 1, "replies": []}]}, {"body": "lol at all the negative comments.  Yes it makes more sense to do this if your roth is much less capital than your brokerage", "score": 3, "replies": [{"body": "Normally it would be, because you're super limited in how much money you can legally get into a Roth on a yearly basis.", "score": 1, "replies": [{"body": "And a few bad trades kill the account.  Then you only have the tax able account to play in till the following year.  \n\nI get what you’re say, but with the limits of how much you can put into a Roth IRA, I’m guessing that this alone is what keeps people from actively trading in their Roth IRA accounts", "score": 6, "replies": [{"body": "> And a few bad trades kill the account.\n\nA few bad trades kill **any** account.\n\nIt's hilarious to me that if somebody is not holding something for 3 to 5 years, they're being a total idiot. Again, look at Amazon. If you held Amazon for the last 3 years, congrats. Basically went nowhere. Wow, you're so much smarter than everybody else for holding Amazon for three years.\n\nPeople think if you're \"trading\" your yolo'ing into meme stocks or something.\n\nDude, I buy stuff like GOOG, MSFT, ADBE, AMD, TSM, NVDA and ASML.\n\nJust because I don't necessarily hold them for 5 continuous years doesn't make me a dumbass.", "score": -1, "replies": []}, {"body": "I sell covered calls in my Roth. And dont in my brokerage. Most analysis indicates that post-tax selling covered calls is a net losing strategy. The tax advantaged nature of the Roth changes that calculation. A few bad covered calla could lower your returns for they year, but they wont kill the account.", "score": 1, "replies": []}]}, {"body": "I don't know. You can put in more than $70k+ an year.\n\nEdit: not sure why getting downvoted for stating facts.", "score": -4, "replies": [{"body": "Can you link a source on this statement?", "score": 5, "replies": [{"body": "I know for a fact that you can put upt to $67,500.00 per year into Roth accounts. I don't know how you get more than that in.\n\nYou can put up to 30k into a 401k Roth per year, as well as 30k into a 457 Roth per year. Of course, your employer has to offer this as an option. In my particular situation, we're allowed to have up to 85 percent of our post-tax paycheck deducted and routed to either of these accounts. Of course, you have to be making enough $$$ to actually get the full 60k into both of them, via an 85 percent maximum deduction (per paycheck). Obviously, depending on what your post tax earnings are each month, that percentage can be a lot lower and still get the 60k in per year.\n\nThen, if you're over 50, of course there's the standard $7,500 per year that you can put in a \"normal\" Roth. \n\nIf you combine all of it, it's $67,500.00\n\nI know of these, but don't know how to get it even higher than that.", "score": 4, "replies": []}, {"body": "66.5k is the limit for 401k, 6.5k is the limit for IRA. Combined is more than 70k. All of it can be transferred to Roth IRA. \n\nBut it is a better idea to do about 36k from Mega-backdoor and 6.5k from backdoor. So about 42.5k in Roth IRA, and the remaining in pre-tax 401k.", "score": 1, "replies": []}]}]}]}]}, {"body": "I don’t do this.   Because all loss in the IRA accounts are permanent.    Losses in the taxable accounts are not.", "score": 1, "replies": [{"body": "Losses are so magical right? Because you get to pay slightly less taxes. Whoopee! How amazing it is!\n\nSure, I lost 10k on that deal, but the upshot is I get to save 3k on taxes! Oh my goodness, with all this money I've saved, I'm going on a nice vacay to Europe!\n\n[by the way, all losses are freaking permanent. Just because you can write off some of your gains with it and hopefully save 30 percent of your tax liability doesn't mean you didn't lose 70 percent of that money and will never, ever, see it again.]", "score": -4, "replies": [{"body": "I think their point is more so that you can only put so much money in the tax advantaged vehicle. If you gimp that you would not be able to regain that advantage. One bad trade could ruin your ability to fund that account.", "score": 3, "replies": [{"body": "I've said this multiple times in this thread already, so don't want to beat a dead horse, but I know for a fact that you can get up to $66,500 or $67,500 into a Roth IRA yearly. Unfortunately, to do this, there are several caveats:\n\n1. Your employer needs to offer 401(k) Roths and 457(b) Roths\n2. To put money into a 401(k) or 457(b) ROTH (not a regular IRA, I'm talking about ROTH versions), you need to deduct whatever amount out of your **POST** tax paycheck. For example, let's say you make 8k before taxes but your actual paycheck is closer to 5k, after all the deductions. Well, if you're contributing to a 457 or 401k Roth, then you also have this as a deduction too. If you want to put 2k in per month, now instead of having a paycheck that's 5k, your paycheck is 3k. Because 2k of it was rerouted to the 401k or 457 Roth. A lot of people don't like doing this, because they need their money to pay bills. But... If you had enough money in savings to cover that 2k per month, you're essentially robbing Peter to pay Paul to get more $$$ into a Roth account yearly. In fact, this is exactly what I'm doing.\n3. You're allowed to put up to a maximum of 30k into each (both a 401k Roth and a 457 Roth), But in a 12 month period, that would mean that you'd be deducting 5k EACH MONTH FROM YOUR AFTER TAX PAYCHECK. If you're making 200k per year, probably not that hard. If you're making 70k per year, it's actually impossible. At least, where I work, the maximum they allow us to deduct from each paycheck is 85 percent.\n\nIf I was making enough $$$ at my job, I could technically put $67,500.00 each year into a Roth. (For example, let's say I was making 140k per year. I could still put $7500 into a \"normal\" Roth, and if I could stomach it, I could also put 5k per month into both the 401 Roth and the 457 Roth.\n\nSo, my argument against this fear of losses is that it's a non-issue unless you have more than 67k to invest in the market each year. Obviously, that grand total will change based on exactly how much you make. I don't make that much, so I'm going to be closer to investing like 42k into Roths each year.\n\nWill I have more than 42k that I can pump into the market each year? Doubtful. So, this fear of losses doesn't register for me, because it's the same as any other brokerage account to me. You don't fear losses in a regular brokerage account, because you know you can add unlimited amounts if you need to. But if you're in my situation, and you know that you're unlikely to ever be able to add 40k every single year to your investment accounts, then this \"gimping\" will never happen.", "score": 2, "replies": []}]}]}]}, {"body": "Roth is for investing not trading.", "score": -4, "replies": [{"body": "So you're telling me that 100 percent of your entire investing portfolio (across every single account) is in something like VTI or VOO?\n\n100 percent?\n\nBecause most people I know will take at least 10 percent of their overall umbrella and be a bit less risk adverse with it. In fact, some of them dare to actually buy individual stocks. Can you believe that?\n\nHow crazy of them? Some of them buy Apple, Google and Microsoft. Wow, they're so crazy. They're living so dangerously. How can they sleep at night?", "score": 2, "replies": [{"body": "No not even close. 100% of my Roth is invested. I don’t trade. I reposition my account accordingly. I trade in my other accounts. My roth is 100% individual stocks which happen to be apple google and microsft. But maybe I misunderstood you OP. Sorry if I did.", "score": 1, "replies": [{"body": "I'm talking about your **overall umbrella of ALL investments**. Roth accounts, regular brokerage accounts, whatever. Throw ALL of that money into one pot.\n\nFor example, let's say you had 20k in Roth accounts and 80k in normal brokerage accounts. Your entire investment umbrella would be 100k. If you were to \"trade\" in your Roth exclusively, and just buy and hold in your brokerage accounts, you'd be living dangerously (if you actually believe that), with just 20 percent of your overall umbrella of investments. Now, most people would say that doing this with 20 percent of your investment money is a bit high risk, and they'd tell you to do it with 5 or 10 percent max. Ok, but whatever way you do it, if you're going to actively trade ANYWHERE, it would be much more logical to do it in the one place that isn't negatively affected from a taxation standpoint (from trading). That one place is a Roth.\n\nSo, if you wanted to trade with just 5 percent of your overall investing umbrella in the above scenario, you'd use 5k of the 20k that's in Roth to trade with. You'd still have another 15k in that Roth that wasn't being used to \"trade\".\n\nIf you want to up your \"trading\" percentage to 10 percent, then 10k of your Roth would be used for trading. The other 10k would be buy and hold. All 80k in your normal brokerage would be buy and hold.\n\nThis is the point that I'm trying to make", "score": 2, "replies": [{"body": "I misunderstood sorry.", "score": 3, "replies": [{"body": "No worries. I probably did a terrible job of explaining my point.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "First you shouldn't be trading at all! You should be buying QQQ and not ever selling it until you're 65 and retired.\n\nIf you're asking questions like this, you're gonna LOSE money trading.\n\nMost people LOSE money trading. Like 95% of people don't even beat simply holding an sp500 index fund after 5 years.\n\nYour best bet is to further your career and add more money every single week to 50% VTI and 50% QQQ and NEVER  EVER EVER EVER sell it until you turn 65 and retire.\n\nMost people today though won't be able to retire by 65, so plan on investing till you're 75 or 80.", "score": -11, "replies": [{"body": "Yeah your way is the only way and everybody else is stupid..... Also I want to see the source on that 95%. It's not that hard to beat index.", "score": 3, "replies": [{"body": "Look it up in Google", "score": 0, "replies": [{"body": "I did and didn't find anything relevant.", "score": 3, "replies": [{"body": "Type in \"average trader doesn't beat the sp500\"", "score": 0, "replies": [{"body": "Nothing about retail investor, but whatever", "score": 2, "replies": [{"body": "Retail fare even worse than pros.", "score": 1, "replies": []}]}]}, {"body": "Even Warren Buffet hasn't beaten the sp500 over the last decade.", "score": 1, "replies": []}]}]}]}, {"body": "Says the guy that recently bought NVDA at $300 and $400", "score": 1, "replies": [{"body": "Yeah ??  I made money. Nvda is $480 last time I checked!", "score": 2, "replies": []}]}, {"body": "Small and midcap are undervalued and Big Tech is overvalued change my mind", "score": 1, "replies": [{"body": "It's a long game. Imo tech will always crush long term. Value long term imo is not a great investment.\n\nYour best bet is sp500 index fund and add and never touch.", "score": 1, "replies": []}]}]}, {"body": "Aren't IRAs subject to trading limits? I know I'm not permitted to sell options.", "score": 1, "replies": [{"body": "No limit on trading in an IRA.  I trade options all the time in my Roth and my Traditional IRAs.  The only limitation is I am not allowed to do naked calls.", "score": 4, "replies": [{"body": "Fidelity lets me sell options in a Roth. However, you cant use margin, so any puts must be cash secured.", "score": 2, "replies": []}, {"body": "Hhmmm, I'm on Fidelity. Td wouldn't let me either.", "score": 1, "replies": [{"body": "US?   I have one of my IRAs with TDA/Think or Swim and have traded options for 10+ years in that acct. Ya may want to call em!", "score": 2, "replies": [{"body": "Yeah, odd.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes . But take *big* risks in the Roth.. so potentially the *Big* reward would be untaxed.\n\nJust be sure to have stops on your losses", "score": 1, "replies": []}, {"body": "Agree with this, but trading in taxable account does have an advantage. In my taxable account, any cash sitting in the account earns 5% interest. So I might have 25% of my account sitting in cash until I find a good opportunity to buy a certain stock. In the meantime the cash is still doing something by earning interest. I can't do this with my retirement account.", "score": 1, "replies": [{"body": "You need a new broker. Any part of my Fidelity Roth IRA not invested defaults to SPAXX, which is paying around 5%.", "score": 3, "replies": []}, {"body": "> In my taxable account, any cash sitting in the account earns 5% interest. So I might have 25% of my account sitting in cash until I find a good opportunity to buy a certain stock.\n\nThere's Treasury Bills ETF's that you can hop in, in-between moves. So you can basically do the exact same thing in a Roth.", "score": 2, "replies": []}]}, {"body": "Obviously.", "score": 1, "replies": []}, {"body": "Yes! Not having to pay taxes, especially short term capital gains is super nice and makes good sense... but it also assumes you always make only good investments/investments that only go up.", "score": 1, "replies": [{"body": "Well, I can tell you that I'm not daytrading, and I'm not even really swing trading in the classical sense of the phrase.\n\nAlso, I'm not buying meme stocks. I stay in my lane. Megacap Tech stocks.\n\nWhat I'm really doing, is feeling like I'm not forced by some invisible hand of God to hold an investment longer than I deem necessary, just because I might pay 15 percent tax on the gains instead of 30 percent. \n\nBut millions of people do this. In fact, there's TONS of NVDA holders right now that would sell out of their NVDA position, if it only was for the fact that they don't want to pay the 30 percent tax on a short term gain, compared to potentially a 15 percent tax on a long term gain. So they hold it for at least 365+ days because psychologically, they just can't allow themselves to potentially pay these higher taxes. It's investing with a gun held to your head because of the IRS's tax structure.", "score": 1, "replies": []}]}, {"body": "Yea but the utility of money decays over time. Money won't be as useful when I retire and my body is old. I'd rather swing trade now and hope to get rich in 5 years. \n\nAlso just regular rebalancing of index funds in your retirement account will use up plenty of capital gains. There's no need to swing trade just to take advantage of that.", "score": 1, "replies": [{"body": "Depends on how old you are right now I suppose. But, remember, you can withdraw contributions at any time, without any penalties or tax. The only thing you can't withdraw are the earnings. So, imagine you could get $66,500.00 per year into a Roth via $6500 in a normal Roth, 30k in a 401k Roth (through your employer) and another 30k in a 457 Roth (again, through your employer). \n\nLet's say you invest this $66,500 into a certain stock and it doubles to 133k. You can withdraw the original $66,500 (**contributions** can be withdrawn at any time)\n\nNow, you would need to leave the other $66,500 in the account (**earnings** need to stay in the account with a few rare exceptions), but let me ask you this question... Do you plan on being alive when you're 59.5 years old? If you plan on being alive when you're 59.5 years old, your 60-year-old self is going to be incredibly thankful that you had the foresight to do this.\n\nBeing an extremely wealthy 60 year old, is way better than being a poor 60 year old. People can live very good lives all the way up to like 85 years old. That's 25 years of living the good life. Yes, you'll be a senior and you won't be young and all that, but you can still have a very good time traveling and doing shit like that.\n\nAlso, there's a handful of exceptions where you can potentially pull out some of the earnings before 59.5. For example, they let you take out 10k as a first-time homebuyer.", "score": 2, "replies": []}]}, {"body": "I have thought about doing this in my Roth IRA recently. It makes sense to only do it for certain things. You used the examples of Microsoft and Amazon. I think Tech stocks would be a great thing to have in a Roth over a brokerage account. If I got a chance to buy Apple, then that's where I would buy it. People in these subs have also suggested buying REITs in a Roth, and that  makes sense too because they are always treated as ordinary income.\n\nHowever, if I am taking a shot on a riskier stock to moonshot, then I'm still going to just put it in my brokerage. If I have to take a tax hit on it because it did exactly what I was hoping it would do, then that's literally the price I'm willing to pay.", "score": 1, "replies": [{"body": "Yeah, I probably wouldn't invest 10k in a moonshot type stock in a Roth. However, maybe I'd invest 1k in a moonshot. Let's say you were going to invest 10k in a moonshot in a normal brokerage account, you could invest 9k there, and 1k in the Roth. Wouldn't be the worst idea.", "score": 0, "replies": []}]}, {"body": "Maybe, just maybe the hesitation to sell because of taxes is what causes some folks to hold for the longer term - and that’s why they make money.", "score": 1, "replies": []}, {"body": "Wait, you pay taxes?", "score": 1, "replies": []}, {"body": "TLDR; but most of us are swing trading options and need a margin account to sell naked positions.  Cash accounts are slow and annoying with their requirements.", "score": 1, "replies": [{"body": "> Cash accounts are slow and annoying with their requirements.\n\nThis is actually very true. I have a small IRA that I inherited from my Dad. It's in a Fidelity account known as an IRA BDA. I can't sell out of a position and then immediately move into another position. I literally have to wait like two days or something. It really sucks. I don't actually use a margin account for anything other than being able to immediately jump from one position to another. I don't actually borrow money. Only for like 1 day or whatever and they don't charge you anything for it. But for whatever reason, I suppose it's impossible to do it in the IRA BDA account.", "score": 1, "replies": []}]}, {"body": "No it would not be", "score": 1, "replies": []}, {"body": "Our equivalent in Canada is a TFSA. No taxes, contribution limit. We have a rule that you aren't supposed to use your tfsa account for trading. If you make too many trades, they may force you to pay taxes. I dont know if that applies to a a roth IRA as well, but maybe look into it.", "score": 1, "replies": []}, {"body": "Your entire pov relies on the assumption that people will make much more money in their normal brokerage account than in their Roth accounts.\n\nThe vast majority of this country can't fill up the Roth contribution limit, let alone invest an additional 6k+ onto a non tax advantaged account", "score": 1, "replies": [{"body": "My assumption is that most \"investors\" have more money in their standard brokerage accounts than their Roth accounts.\n\nMaybe that's a terrible assumption on my part. The reason that I assume this, is because let's say somebody inherits 300k because their Dad died. All of a sudden, they have 300k in cash money, and they want to do something with it. You'll actually see threads asking these exact questions on r/personalfinance . \n\nThey have 300k to invest (potentially), and usually what they'll do is open up a brokerage account with Schwab or Fidelity or something like that. Now, they might also open up a Roth account as well, but you can't deposit 300k into a Roth. You're limited in how much you can contribute in a single year. For most people, it's either up to $6500 or $7500 depending on age. (yes, there are other ways to get even more into a Roth in a given year, but we don't need to get into that).\n\nSo, this is my assumption. It's a lot easier to get a lot of money into a brokerage account than a Roth.\n\nNow, are there some people out there that have heard about Roth IRA's, and they've dipped their toes into a Roth IRA, but they don't have a normal brokerage account? Sure, there's people like that. Since I'm posting on r/stocks, I'm not really talking to those people. I'm talking to the more active investor types.\n\nAlso, I know a lot of younger investors. Still in their 20's and 30's, that know all about Roth IRA's but they don't care about them at all. Their focus is on trying to get rich very soon, and so the idea that they can pull money out of a Roth tax free at 59.5 years old doesn't appeal to them at all. In fact, I know people that have 200k in a brokerage account and they don't have a Roth IRA period.\n\nSo, I'm talking about people that are actively investing, not just a Joe Blow off the street that doesn't know SPY from the blue sky above their head.", "score": 1, "replies": [{"body": "That's also assuming that this person's dad had $300,000 just sitting around. Even with life insurance that's a pretty bold inheritance for the vast majority of the country\n\nI do agree that at the very least, people who are subscribed to financial subreddits probably have more money in their non-tax advantaged accounts than otherwise though. That imo is a valid assumption", "score": 1, "replies": [{"body": "Most likely the Dad owned a house, and after probate was concluded (assuming he didn't have a living trust), the guy got a cool 300k.", "score": 1, "replies": []}]}]}]}, {"body": "> So the whole buy and hold forever strategy hasn't worked out that great for AMZN holders.\n\nIf you bought Amazon 10 years ago, you'd have dominated the yield of the S&P 500. Both yields would beat your return from swing trading. Time in market > timing the market.\n\n> More seasoned investors tend to buy and hold, but this is a learned behavior because they know that their absolute worst case tax scenario on a long-term gain is 20 percent\n\nNo. No it's because most have lost their ass trying to time the market.", "score": 1, "replies": []}, {"body": "Are you sure you know exactly how hedge funds work as you’re describing some of them pretty closely", "score": 1, "replies": []}, {"body": "This sounds similar to a strategy I'm looking to get into, but it would be more of a long-term \"swing trading\" where I look for opportunities where I'd have something 200% up and might buy some \"too-big-to-fail\" companies that are bottomed out. I'm relatively young though so I'm down to take risks.", "score": 1, "replies": []}]}
