{"title": "Missouri jury hits Realtors, real estate companies with $1.8 billion in damages", "selftext": "https://www.cnbc.com/2023/10/31/missouri-jury-hits-realtors-real-estate-companies-with-1point8-billion-in-damages.html\n\nA U.S. jury in Missouri on Tuesday said the National Association of Realtors and several real estate companies together owe more than $1.7 billion in class action damages, finding they conspired to artificially drive up the commission that home sellers pay to buyers’ brokers.\r  \n\r  \nThe verdict followed a two-week trial in federal court in Kansas City, where the case had drawn widespread attention for challenging widely used real estate industry practices.\r  \n\r  \nThe jury award will be automatically tripled under U.S. antitrust law to more than $5.3 billion, said Michael Ketchmark, the lead lawyer for the plaintiffs. “Today was a day of accountability,” Ketchmark said.\r  \n\r  \nThe defendants also included Keller Williams and Berkshire Hathaway\r  \n\\-owned HomeServices of America and two of its subsidiaries. The class members include sellers of more than 260,000 homes in Missouri and parts of Kansas and Illinois between 2015 and 2012.\r  \n\r  \nHomeServices said it was disappointed by the verdict and planned to appeal.\r  \n\r  \nKeller Williams spokesperson Darryl Frost said the company would consider options for an appeal. “This is not the end,” Frost said.\r  \n\r  \nA spokesperson for the National Association of Realtors, Mantill Williams, also said it would appeal and ask the court to reduce the damages amount.\r  \n\r  \nThe plaintiffs claimed the association and corporate defendants drove up the commission, upwards of 6%, that home sellers pay to brokers representing buyers.\r  \n\r  \nThe home sellers called the compensation rule “a market-shaping and distorting rule that has severe anticompetitive effects.”\r  \n\r  \nThe realtors association, Keller Williams and HomeServices have denied any wrongdoing.\r  \n\r  \nTwo other defendants, Re/Max and Anywhere Real Estate, agreed to settlements without admitting liability before the trial. Anywhere planned to pay $83.5 million, and Re/Max said it would pay $55 million, pending court approvals.", "id": "17kxh1s", "created_utc": 1698791931.0, "score": 1036, "upvote_ratio": 0.98, "num_comments": 83, "comments": [{"body": "If im reading this right - sure seems like REMAX and Anywhere Real Estate made the smart play and just agreed to settle. \n\nThey paid about 30X less than Keller Williams, Home Services, etc are now on the hook for...", "score": 200, "replies": [{"body": "And didn't have to admit guilt in any way shape or form closing the door to any future litigation that may arise.", "score": 91, "replies": [{"body": "States or federal government could also bring back future lawsuits for price collusion, but it is unlikely since these government agencies can't even go after drug manufacturers that jack up prices.", "score": 32, "replies": []}]}, {"body": "With the antitrust rule they actually paid almost 100x less", "score": 25, "replies": []}, {"body": "The ones that lost today will appeal and attempt to get the fine dropped. Those that settled are out the money no matter what. This was only three stats remember. They can all be sued in every state they operate as well as the DOJ is looking at suing them as well.", "score": 15, "replies": [{"body": "Good, hope each state goes after their share like they did the pharm companies. Real estate has the worst fucking people in it.", "score": 27, "replies": [{"body": "Yeah I agree.  My friend was misled by her realtor, saying she would walk away from the sale with over $20K.\n\nThen the realtor listed the property and took the first offer in less than a week, assuring my friend that she has to take the lower offer, it's the best she's gonna get.\n\nMy friend ended up homeless, living in her car for a few months before I found out what happened.\n\nSome realtors only care about getting their commission - quickly.  Her realtor was a crook.", "score": 14, "replies": []}, {"body": "I can confirm that, worked in mortgage. Scummiest people on the planet lol", "score": 12, "replies": []}]}, {"body": "> The ones that lost today will appeal and attempt to get the fine dropped. \n\nThere's still some maneuvering in the same court for getting the number reduced (or a new trial) before the court actually enters a judgment in that amount.\n\nBut once it gets to that point, appeals can be quite expensive. In order to appeal a money judgment, you have to post a bond for the full amount *plus interest*. The pricing on that kind of bond depends, but either you're putting up a shitload of collateral (losing out on interest and liquidity while the appeal is pending) or you're paying a higher fee (losing the money whether you win or lose the appeal).", "score": 4, "replies": []}]}]}, {"body": "It always amazes me how industry participants find ways to violate antitrust laws. If there's a market out there, then there's definitely some group of \"professionals\" conspiring to corner it and fuck it.", "score": 303, "replies": [{"body": "> People of the same trade seldom meet together, even for merriment and diversion, but the conversation ends in a conspiracy against the public, or in some contrivance to raise prices\n\n**Adam Smith, The Wealth of Nations, 1776**", "score": 97, "replies": [{"body": "Don't try interpreting Smith accurately, you're going to seriously offend the libratarian mythology", "score": 24, "replies": []}, {"body": "But, but free market is always right!", "score": 1, "replies": []}]}, {"body": "I was going to say, as a shareholder/retail investor this may not be great news, but as an American citizen I cant say im upset. \n\nIm so tired of this attitude of \" your absolved of all moral responsibility if whatever your doing is profitable\". Like we literally let health insurance companies deny Life-saving procedures and medications because it might cost them a few extra pennies for example. \n\nIts like we all just collectively shrugged and said \" yea that's capitalism..? whatcha going to do?! \" ........and yet up until about 20-30 years ago somehow most of society was able to function without non-stop deceit, bait-and-switch, planned obsolescence, etc. \n\nI would love to go back to taking pride in your work and products - and the business you do with others. When society felt (or at least seemed) much more honest and less cut-throat, profits or death!", "score": 118, "replies": [{"body": "And whenever realtors play ‘fiduciary card’ I feel cringe! \n\nMost if not all are - Fiduciary for themselves and not for clients!", "score": 13, "replies": [{"body": "If any of these people were serious about their fiduciary responsibility, not a single house would have sold from about late 2021 forward.", "score": 4, "replies": [{"body": "Mate their personal fiduciary is held up well.", "score": 2, "replies": []}]}]}, {"body": "> Its like we all just collectively shrugged and said \" yea that's capitalism..? whatcha going to do?!\n\nI mean it is capitalism? Unless you have billions to throw around and sway voters, or a way to organise people into a revolution, what are you going to do?\n\n>I would love to go back to taking pride in your work and products - and the business you do with others. When society felt (or at least seemed) much more honest and less cut-throat, profits or death!\n\nBack to when? The first or second world war? Right after it when everyone was profiting from the rebuilding as a result of the mass destruction and death that just happened. \n\nHow do you plan to make that happen? WWIII-lite so we can have another golden age of capitalism after it?\n\nLike this illusion that capitalism is taking pride in your work and products is laughable. This was also the time when companies were dumping chemical waste into nearby rivers and lakes. If you go back further, there's child labour, slave-like conditions, slavery, clearances and enclosures, and more.", "score": 4, "replies": [{"body": ">Its like we all just collectively shrugged and said \" yea that's capitalism..? whatcha going to do?! \" ........and yet up until about 20-30 years ago somehow most of society was able to function without non-stop deceit, bait-and-switch, planned obsolescence, etc.\n\n>I would love to go back to taking pride in your work and products - and the business you do with others. When society felt (or at least seemed) much more honest and less cut-throat, profits or death!\n\nOP literally just made a bunch of shit up about \"back in the day\" that I'm 99% positive they didn't live through. Ah yes, the glory of capitalism back when women were trapped in sweatshops, children worked in coal mines, and the Pinkertons and the National Guard murdered striking workers. Oh, how proud they were of their production and honest day's work! \n\nHow does that moralizing have over 100 upvotes in a stocks thread?", "score": 5, "replies": [{"body": "Your not wrong - that plenty of things were fucked then, and plenty of things are still fucked now yes......but you are not going to convince me that we were just as blind to profit then as we are now. \n\nA broken bone in the 1950's didn't mean bankruptcy for half the country...it does now.\n\nYou could have a janitorial/relatively unskilled position up until about 1980 and afford to own a home, have a spouse, potentially kid(s) , and even still save a little if you were careful. I know for a fact, as both my parents were brought up in that exact situation. \nToday that person would most likely not be able to afford a home - and that's without spouse or kids or anything else. \n\nThe fact that pensions no longer exist , and Unions are becoming a serious consideration again speaks to this increasing greed problem specifically.  \n\n>OP literally just made a bunch of shit up about \"back in the day\" that I'm 99% positive they didn't live through. \n\nYour correct I didn't live through it - but I find it hard to believe all my Aunts, Uncles, grandparents, etc are making it all up for fun. Sure they may be remembering a bit more pleasant than reality - but I tend to believe them when they say society and most peoples careers carried more pride and respect than today. \n\n> back when women were trapped in sweatshops, children worked in coal mines, and the Pinkertons and the National Guard murdered striking workers. Oh, how proud they were of their production and honest day's work! \n\nWe can find examples of all of those things - right now in 2023....whats your point? There were serious issues then, and serious issues now. Doesn't make my statement true or false either way \n\nI will fully admit I could do a better job of articulating what I'm trying to say - but yea I think there was more honesty in day to day business and life back then - regardless of other issues.", "score": 2, "replies": [{"body": ">I will fully admit I could do a better job of articulating what I'm trying to say - but yea I think there was more honesty in day to day business and life back then - regardless of other issues.\n\nWhat I really hate about this is the moralizing you're doing here while completely ignoring or being totally ignorant to history and to facts. First of all, you readily admit you weren't alive, so you have no idea outside of what people tell you. Second, you say you're only talking 20-30 years ago. So 1990-2000. Which was post Reagan and small town America was already dead, so let's wipe that. Really, I think you mean the Boomer's \"Golden Years\" of 1950-1980. \n\n>up until about 20-30 years ago somehow most of society was able to function without non-stop deceit, bait-and-switch, planned obsolescence, etc.  \n>I would love to go back to taking pride in your work and products - and the business you do with others. When society felt (or at least seemed) much more honest and less cut-throat, profits or death!\n\nWhat I'm telling you is this is just wrong. Nothing was morally better about that time. There was just as much deceit, bait-and-switch, dishonesty and honestly SO MUCH FUCKING PROFIT OR DEATH.  \n\nThe Nation had just pulled out of a great depression largely caused by profit or death (over farming in the Great Plains leading to the Dust Bowl, bait and switch / speculative stocks leading to the Great Depression) and was only rescued from it by pursuing profit over death by creating our economic dependance on war by selling war machines to Allied powers before ultimately joining in the war and then taking center stage in global politics. Afterwards, the US fought a continuing battle against Communism that led to the Red Scare of the 1950s in which thousands and thousands of people lost their jobs, were jailed, or killed for being \"communist sympathizers.\" None of this takes into account the total segregation of America and what you mention above, the \"deceit, bait-and-switch and dishonesty\" did not apply to non-white Americans. So I'm glad your family prospered but also ask them if during those golden years if they ever had a black neighbor...\n\nIf you're still reading this far. YOU ARE NOT WRONG. But you're misguided. The world was never a more moral place and doing the rose-tinted glasses thing of looking back being like \"man, remember when\" does a total disservice to how Americans got into this situation. America isn't in this place because things are less honest. It's because the people you perceive as being the most honest voted systematically to cut taxes and the social safety net over decades and decades until they were the only ones who benefit from the social safety net and who pay the least in taxes.", "score": 1, "replies": []}]}]}]}, {"body": "Even Marx saw the benefit of capitalism. This is late stage where we’re going to be paying just to breathe soon.", "score": 1, "replies": []}, {"body": "...\"Evil Capitalism\" allowed the development of the drugs, devices, diagnostics, and therapies that you currently enjoy...", "score": 1, "replies": []}]}, {"body": "The penalty is just the cost of doing business.\n\nIf the penalty was dissolution and prison, this wouldn’t happen so often", "score": 26, "replies": []}, {"body": "This is the point of labor unions and we applaud them.", "score": 21, "replies": []}, {"body": "Welcome to capitalism and why the original theorists spoke strongly for the need of regulations to ensure market capture doesnt happen. \n\nThe free market is not a good thing. It is a weapon used by the wealthy to control consumers.", "score": 6, "replies": []}, {"body": "I've been saying for years that the Realtor Organization with their standard 6% commission is the only legal, unregulated monopoly (unlike Utilities) in the US.  Finally, someone is doing something about it.", "score": 2, "replies": []}]}, {"body": "I’ve never understood how this industry gets away with blatant cartel and price fixing activities.  Even car dealerships don’t get to agree on fixed margins", "score": 122, "replies": [{"body": "They been paying off politicians forever is how they keep doing it. They spend 80+ million a year lobbying politicians at the federal, state, and local levels to allow them to keep screwing over people with their commission structure.", "score": 55, "replies": [{"body": "They're one of the most powerful lobbies, at both the state and federal level.", "score": 2, "replies": []}]}, {"body": "It’s more public ignorance than anything. Realtors can and do charge different commission rates. I can point you to several who charge 8% as a selling agent and only give 2.5% to the buyers agent (so they end up with 5.5%!). There are others who charge 5% total split evenly. Most will negotiate their commission. 6% is what most have settled around, but you absolutely aren’t stuck at that and if your house is expensive enough, you can list for a lot less of a percentage. \n\nThe problem is that most people don’t know this. They just think all realtors charge 6% split between agents and call it done.", "score": 2, "replies": []}]}, {"body": "This has been going on for like 60 years. What precipitated this lawsuit and decision at this time? I agree with the verdict but what about the millions of transactions and defrauded consumers over the past decades?", "score": 52, "replies": [{"body": ">Home sellers complained that this model suppressed competition by keeping commissions for buyer brokers in the 2-1/2 to 3% range despite the brokers’ diminishing role, with many buyers able to find homes independently online.\n\n>Sellers said the arrangement had “severe anticompetitive effects” and made “no economic sense, except for the buyer broker.”\n\nI think it precipitated because houses doubled in price over the last decade.  In 2005 when houses sold for 80k, the broker gets $2,400 for doing all the work without today's internet.  In 2022, that 80k house is now 300k and the commission is $9,000, and the broker doesn't really do anything that requires any skill.  Those prices seem to be where home prices are in Kansas City, MO.\n\nNow imagine it's one of those $850k houses.   That's $25,500 for a 3% commission. \n\nThey're doing less work and getting asinine amounts of cash, and it's protected by the realtor racket. That's why they got sued.", "score": 42, "replies": [{"body": "I have a real estate friend who floats they had to pay 40k in taxes each quarter and they hardly do anything.  They state that they are needed to review the documents, I contest that should be a fee and not a percentage. The amount of work doesn’t really change so why should they snatch up such a large percentage. If I sold my house today it would sell itself because of how much I’ve put into it, why the fuck should I hand over 60k for someone or two people to read the fucking documents", "score": 29, "replies": [{"body": "I guess that means they're claiming about $150k each quarter.\n\nThat's commission on 10 $500k houses.", "score": 8, "replies": [{"body": "It helps that their attractive and well connected when it comes to getting clients", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Ah, but where they'll get ya is most realtors won't even show their clients FSBO properties. I've seen them straight up refuse with all kinds of weird logic about how owner sales aren't legit or somehow a scam, Yeah, if you can snag someone who isn't represented by a realtor you might be in luck, but home buyers without realtors are few and far between outside of selling to an investment firm or something.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You lose a lot of potential buyers that way. In a hot market, it's not too big of an issue, but when it's slow you could be leaving more than the commission would take on the table.", "score": 3, "replies": []}, {"body": "When I tried to list my house FSBO the local realtors came to my house and told me they were steering all clients and other real estate agents away from my property until I hired an agent. Eventually I had to because no one would bring their clients to see my home.", "score": 1, "replies": [{"body": "that seems like evidence in a racketeering case to me. I'd have recorded those conversations.", "score": 1, "replies": [{"body": "No it’s a common tactic real estate agents use. You can Google it. Technically it’s totally legal for them to dissuade their clients from a property and also even avoid showing mine simply to force me to use an agent.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well, kind of the same argument applies to tipping, yet people go bananas when you suggest tipping shouldn't be % based.", "score": 1, "replies": []}]}, {"body": "I agree in part. My wife is a realtor (part-time) and if she is the listing agent she spends approx. $2-4k (or more) depending on the property to help it sell. This includes marketing materials (for visitors to take during open houses and showings), paying photographer (& sometimes drone operator), and even paying for additional staging, depending on her agreement with the homeowner.\n\nThat being said, with million dollar homes being the standard in a HCOL area, the commission fees are too high and buyer’s agents certainly don’t deserve half.", "score": 5, "replies": [{"body": "Oh ok and no one mentions that maybe the buyers agent has been on 65 visits over the course of the last year, spent hundreds or even thousand on gas, time, and other services towards their buying clients. Im not a realtor, i Used to be but its INSANE how everyone whos never been a realtor has NO IDEA the shit a realtor goes through to make a buck and even when do make a buck, a big percentage goes towards:license fees, office fees, marketing fees, expenses, cuts, income tax, retirement, savings, medical, insurance.\n\nWhen I was a realtor i literally made about 10¢ on the dollar and thats being generous.", "score": 4, "replies": [{"body": "I am aware of this because of my wife’s experience, but it is a bit easier to set boundaries with your buyer clients (e.g., send them to open houses without you until they know what they want).  It’s a tough industry because of the low barrier to entry and intense competition, the lack of benefits, and the fact the RE company takes a big cut of the commission despite providing little or no support (other than providing an “office”)", "score": 1, "replies": []}]}]}]}, {"body": "> This has been going on for like 60 years.\n\nBuyers' agents didn't become common until the past 20 years or so. And the percentage-based commission didn't become exorbitant until house prices grew way faster than inflation for a decade.", "score": 1, "replies": []}]}, {"body": "Not all real estate brokerages are the same. I own a small brokerage and I  represent sellers for a flat fee.  I agree I think agents are being overpaid for the amount of work they do. I started my career back in 2002 and felt we were overpaid. So when I opened my brokerage I decided to be different. I get a lot of flack from other agents and brokers for being a discount brokerage. But the amount of referrals I get without having to advertise shows the shift in real estate that needs to happen.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 41, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "After the lawyers get their cut", "score": 2, "replies": [{"body": "...so it's bad for the lawyers who go to school for several years and pass a VERY difficult Bar exam to get their cut, but Realtors who take 40-80hrs. of classes and a Mickey Mouse test deserve their 6%???", "score": 1, "replies": []}]}]}]}, {"body": "And this is just about commission rates.\n\nThey’re also professional liars, so there’s that.", "score": 29, "replies": []}, {"body": "Wild.  We bought our home in suburban KC in 2018 and our agent was with Keller Williams.  I didn’t feel she brought anything to the table during the process.  \n\nShe even screwed up paperwork on the deal and her agency had to eat the cost difference between her mistake and the value of the down payment.", "score": 5, "replies": []}, {"body": "Ok now let’s do the rest of the country", "score": 9, "replies": []}, {"body": "Alright someone please explain to me how does a brokerage conspire to artificially drive up commissions home sellers pay to buyers brokers.", "score": 18, "replies": [{"body": "Never noticed how somehow all agents charge a standard 5-6% rate to sell a house. They have agreements in place to keep commission higher by having the Broker also coordinate the buyer agent commission structure instead of letting buyers negotiate their own agents compensation. That would be like my lawer being paid by you to represent me.", "score": 52, "replies": [{"body": "It would also explain how we moved from 2% being standard to 6% so damn fast. I always wondered how that happened. Getting paid so much for doing so little, seems like these fees should just be government controlled.", "score": 54, "replies": [{"body": "I've never been a fan of the middle man.", "score": 35, "replies": [{"body": "God bless the middle man, no one else will", "score": 18, "replies": []}]}, {"body": "When was it 2%?", "score": 17, "replies": []}, {"body": "When was it ever 2%? \n\nMy mother was an agent in New York and Texas in the 70s and 80s and 6% was standard then. It was split 3% for buyer agent/broker (1.5% each) and 3% for seller's agent/broker (also 1.5% each). If the agent was the broker they would get 3%.", "score": 11, "replies": [{"body": "Don't say \"standard.\" There is no standard commission....Oh wait...right. \nThat tactic ran it's course. \nDarn it.", "score": 11, "replies": []}]}]}, {"body": "Oh that makes sense. My realtor tried that shit when I sold a house in 2022. She said oh  I'll do the sale for 3% commission and I hired her. Then towards closing they tried to say 5% commission and I was like, no we locked in 3% remember. I can always find another agent to represent me.", "score": 0, "replies": []}]}, {"body": "Easy, they select only the contracts with high commission paid (and they get paid for choosing those cons) even if they are not the best.", "score": 46, "replies": []}, {"body": "They force you into a contract whereby you sell your house and promise to allocate 5-6% to be split between the buyer's and seller's brokers.  They conspire together because no broker is willing to compete to undersell each other (hold the line), therefore you have to enter into that contract or they refuse to work with you.  Not only that, but they've now decided the broker's realtor fees even before a buyer's broker exists.  So a buyer's broker cannot compete on fees.  They have no choice but to charge half of the 5-6%.  The whole game is rigged so that there's no pricing competition.  The market cannot select realtors based on price because the price is rigged.  The market can only select brokers based on how much value you think that broker will try to provide for the fixed commission.\n\nEdited to state brokers instead of realtors.", "score": 7, "replies": []}]}, {"body": "Ok now do rent prices", "score": 13, "replies": []}, {"body": "Glad they’re being held accountable. Sad I bought a ton of RMAX two weeks ago. \n\n\nHonestly seems like they did alright here and I’ll probably double down. They’re super undervalued right now.", "score": 2, "replies": []}, {"body": "I formed a small real estate brokerage back in the early 2000s and I offered creative fees for full service that beat the pants off Remax, Keller etc.... And they were pissed. 😁", "score": 3, "replies": []}, {"body": "Honestly a bit confused here, don’t we (the sellers) pay the 6% to cover our portion and the buyers portion of fees which is usually 3% each?", "score": 1, "replies": [{"body": "Why does it matter who pays?\n\nYou buy a house, you’re immediately down 6%, probably 10% with sundry expenses, moving, necesssry new stuff.\n\n6% is outrageous vs rest of world.\n\nAs well vs many countries we are obsessed with home ownership. These crooks take advantage of it.its an emotional thing that gets in the way of reason.", "score": 3, "replies": [{"body": "Here in canada id say its more around 4", "score": 2, "replies": []}, {"body": "So the dilemma is the high realtor fees?", "score": 1, "replies": [{"body": "It’s part of it. They essentially control the market. It’s unusual for a house to change hands privately. When really all you need is a lawyer.\n\nIt’s essentially a cartel, and they even have a nonprofit organization that runs the cartel.\n\nThere was a time when there when private sales were common.\n\nPlus: they are professional liars. You hire a Realtor(tm) to either lie for you, so that you don’t feel guilty if you are the seller, or tell you what you want to hear, even though it isn’t true if you’re a buyer.\n\nPart of the cost, of course, is the slap-dash putting lipstick on a pig with crappy paint and low end, but not too low and appliances. “Staging” which means putting furniture over the stain on the floor, and bringing in fresh baked bread mmmm mmmmm, and flowers and candles.\n\nOnly some of that is included in the fee. Of course the seller is going to pay for those crappy appliances and the crappy paint job.", "score": 0, "replies": [{"body": "I think if we bought and sold properties through owners alone just like we do with cars. Sign the title get it to the county pay the fee and transfer. Would be simpler and better", "score": 2, "replies": []}]}]}]}, {"body": "Which is part of the problem. If you could compete with agents, both sellers and buyers, that 6% could easily be closer to 3% or even 2% (1% to each agent). \n\nYou as a seller lost out on 4% of your house (so like 1-2 years appreciation) because.... uh... they like money? \n\nWould you go with an agent if they advertised 2% when someone else is advertising 6%? Which agent would you go with?", "score": 1, "replies": []}, {"body": "Yes, but I'm sure you've consciously or unconsciously factored that into what you're willing to sell your house for and it creates upward pressure on prices.\n\nIn any case though the real problem is the conflict of interest. The buyer's agent is supposed to represent the best interests of the buyer but their commission is paid out by whatever the seller's agent is willing to share. You don't see the inherent problem there?", "score": 1, "replies": [{"body": "Right, the realtors are part of an agency that offers them services and credibility that is why they take a fee from their fee.", "score": 1, "replies": []}]}]}, {"body": "Blimy, that's a lot of money.  I guess the commissions have to go up to pay for this.", "score": 1, "replies": []}, {"body": " No shit we had homes at 120-150k shoot to 300-400k in 3 years without any work done to them. This doesn’t fly in the Midwest", "score": 1, "replies": []}, {"body": "Blood sucking realtors", "score": 1, "replies": []}]}
