{"title": "Why Bears Should Be Taking Profits at This Point: What to Expect Next", "selftext": "&#x200B;\n\nhttps://preview.redd.it/gtzbosbvt8sb1.jpg?width=1146&format=pjpg&auto=webp&s=9128f719f7035c311bed5b9162893448ba6f81f7\n\nThe S&P 500 finished Tuesday’s session sharply lower as the bond market’s outlook dims.\n\nThis isn’t the trade I’ve been waiting for. Luckily, my trading plan is keeping me on the right side of the market. As I wrote Monday evening:\n\n>*I am not a bear by any stretch of the imagination, but if this market is going to bounce, it needs to happen soon. I will buy back in if prices bounce on Tuesday, but I need to see constructive price action first. Until then, I’m sitting on my hands and watching this from the safety of the sidelines. (Aggressive traders can short another breakdown.)*\n\nAs readers know, I tried buying a couple of bounces over the last few weeks, and with hindsight being 20/20, obviously, those trades didn’t work as expected. Fortunately, those failed trades didn’t cost me any money because I bought the bounces early and was able to quickly move my stops up to my entry points. As I’ve written countless times, low-risk/high-reward trades are always worth trying, even when they don’t pay off.\n\nI suppose I could have been bearish and profited more from this decline, but optimists amass far more money than pessimists because the market spends significantly more time going up than going down. If I’m going to error, it will always be buying the bounce because those work far more often than betting on a bigger breakdown that only occurs once every couple of years. As much as the Bears are boasting right now, they’ve been wrong all year. When it comes to trading, I’d much rather be right for 11 months instead of just one.\n\nAll of that said, stocks are only down 8% from their 52-week highs, so this still qualifies as a pretty vanilla step-back and something that happens once every year or two. Of course, the alternative interpretation is stocks have “only” fallen 8%, meaning there is a lot more downside if we are truly falling into a bear market.\n\nAre we close to the bottom, or not even halfway? That’s the million-dollar question. But as nimble and savvy traders, it doesn’t matter. We get out of the way when prices fall, and we buy back in when prices bounce. In fact, the lower prices go now, the more money we make riding the next wave higher, so bring on more selling!\n\nThe S&P 500 is quickly approaching 4,200 support and the 200 dma. No matter what the future holds, we should expect at least a modest bounce at these widely followed technical levels. Maybe we violate these levels a few days later, but over the next day or two, the odds are good prices will bounce, making this the wrong place to be aggressively pressing shorts.\n\nWait for the bounce, then follow the market’s lead. Either the bounce will stick, or it won’t. Savvy traders will be basing their next trade on what happens after 4,200.\n\nCredits: [https://www.investing.com/analysis/why-bears-should-be-taking-profits-at-this-point-what-to-expect-next-200642364](https://www.investing.com/analysis/why-bears-should-be-taking-profits-at-this-point-what-to-expect-next-200642364)", "id": "16zxbi6", "created_utc": 1696450407.0, "score": 45, "upvote_ratio": 0.69, "num_comments": 80, "comments": [{"body": "What was the news today that pushed most of tech up?", "score": 21, "replies": [{"body": "Pretty much nothing. Meta laying off some employees, I guess.", "score": 39, "replies": []}, {"body": "Meta firing employees, Netflix raising prices...\n\nOh you want good news?", "score": 21, "replies": []}, {"body": "Because Tesla is up 5%", "score": 8, "replies": []}, {"body": "Too many puts", "score": 6, "replies": []}, {"body": "Only bad news", "score": 5, "replies": []}, {"body": "someone closed insane amounts of short treasuries causing a swap from treasuries into equities ... or so i heard", "score": 3, "replies": []}, {"body": "2 Main things, none of them being news.  \n\n\n1. We had overreaction to the downside on Monday due to yields ripping.  \nThere were fears of something actually breaking in the market ( banks going under or smth)\n2. Today the yields calmed down and we bounced.", "score": 2, "replies": []}, {"body": "Musk needs to sell some stocks so he can fund his X project", "score": 2, "replies": []}, {"body": "Jobs were low, smacked down rates", "score": 2, "replies": []}, {"body": "Nothing. Just the classic tech pump and Vix short to save someone’s shitty position", "score": 2, "replies": []}]}, {"body": "Are you telling me that spy 420 is not a meme, but an actual technical buying point? ![img](emote|t5_2th52|12787)", "score": 15, "replies": []}, {"body": "Thanks OP\n\nNow stfu ![img](emote|t5_2th52|4258)", "score": 41, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "It's actually happened very frequently in the past. Did you even bother to study history when making such a claim?\n\nMarket started tanking in late 2000 during Bush Gore election year. \n\nMarket tanked in 2008 during Obama Bush election year. \n\nMarket tanked in 2020 during Trump Biden election year.\n\nMarket tanked in 1987 the year before Bush Dukakis election year (was still recovering during election debates).\n\nMarket had a correction in 1984 during Reagan Mondale election year.", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "They weren't wrangling high inflation before. High inflation is even worse in an election year than the stock market tanking. Because your average voter doesn't own stocks or has very limited exposure. Inflation is a much more important issue to your average voter. So if you really want to get into conspiracies then its more likely the Fed continues its inflation battle at the detriment of the stock market.", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "#&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Learn to read the room. Inflation is the most important issue to Americans right now. Not the stock market. By your logic they wouldn’t have raised rates at all. They would have continued to juice the asset bubble with near zero rates.", "score": 1, "replies": []}]}]}, {"body": "Wrong. 1988. Sorry to burst your bubble.\n\n[https://en.wikipedia.org/wiki/Working\\_Group\\_on\\_Financial\\_Markets](https://en.wikipedia.org/wiki/Working_Group_on_Financial_Markets)", "score": 1, "replies": []}]}]}, {"body": "^ this guy loves conspiracies", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Are you trying to argue with a bot?? ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Show us where the bot hurt you.", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "🌈🐻", "score": 8, "replies": []}, {"body": "Looks like bounce will stick as long as oil keeps dropping.", "score": 9, "replies": []}, {"body": "Bunch of bullshit", "score": 23, "replies": []}, {"body": "A bounce may be in order but there is 0 macro economic reason to expect a significant bull run or any approaching ATH’s. \nMy guess is a dead cat bounce and the real beginning of a significant down trend", "score": 15, "replies": [{"body": "You shut your mouth when you’re talking to me", "score": 6, "replies": []}]}, {"body": "i was certain QQQ would drop this afternoon at 358.50. bought one 357.50 weekly, was down 50 and bought 10 more. turned a 50 dollar loss into a 300 dollar loss at close. wtf was that pump all about today???", "score": 5, "replies": [{"body": "Relax the pump was to trigger any last stop losses from yesterday and today before the move down into Friday; we will see violent selling Friday with the jobs report as a catalyst", "score": 6, "replies": [{"body": "todays job numbers were good what intel you got on friday’s report?", "score": 4, "replies": [{"body": "I am the oracle... this week I decided to share my wisdom and have  gone 3/3. The rally in Google I gave exact price targets; same thread 7 minutes before CAT meltdown and now we see the resumption of the downtrend which you replied to yesterday 😏 however the price action today stopped me out and indicates a strong reversal, so if the price doesn't agree then I admit when my forecast is wrong.", "score": 2, "replies": []}]}]}, {"body": "Thank you for your service my calls are safe now 😋", "score": 2, "replies": []}, {"body": "Market was crazy oversold and on big support.  Employment numbers came in cooler than expected. A large gasoline inventory pointing to a decrease in demand for oil.", "score": 2, "replies": []}, {"body": "Same, Tesla shot up and bought put at open 245now looking at couple grand loss, fuk what’s going on", "score": 2, "replies": [{"body": "yeah i had an RSI alert on tesla for >80 to buy a put and it dinged right in the middle of my QQQ debacle this afternoon. didnt have many pennies left to go in although it may have worked out as it went from 262 to 260 at close. i hope your trade works out if you are still in it!", "score": 2, "replies": [{"body": "yep I’m still in it, I still have one more week till exp before I need to get a job at Wendy, Hope the best for you as well", "score": 5, "replies": [{"body": "i've got a 280 CC expiring 10/20 and wasn't too worried about it...yesterday lol. i'll be happy if it goes down!", "score": 2, "replies": []}, {"body": "You're still in it? Ha, you must be really desperate. Wendy's is garbage compared to the places I've worked. You should try harder if you want to make something of yourself.", "score": 5, "replies": []}]}]}, {"body": "Buying Tesla puts is completely playing with fire. I commend your bravery\n\nAll Elon has to say is \"Cybertruck deliveries\" or \"FSD license\" and bears will get their faces ripped off", "score": 2, "replies": []}]}]}, {"body": "Everyone is so bearish that markets prolly do the opposite.", "score": 7, "replies": [{"body": "People in here will never learn this simple concept lol", "score": 2, "replies": [{"body": "Markets are forward thinking.", "score": 4, "replies": []}]}, {"body": "Market doesn't look very bearish to me. There actually looks like there's a ton of hopium. We just had a massive rally this year based on AI hype, despite negative earnings growth and a massive corporate debt wall approaching that will impact corporate hiring, investment and earnings even further as all these rate hikes are finally felt by both businesses and consumers. Most of these hikes haven't even hit the economy yet since people had debt locked in at low rates during pandemic. Trillions in debt maturing in 2024 through 2025.", "score": 2, "replies": []}, {"body": "I bought Apple calls yesterday on the notion that wsb was extremely bearish and will probably squeeze everyone out betting for the next leg lower only to get squeezed hard today 🤣🚀…", "score": 2, "replies": []}]}, {"body": "The move today docked me on my MU 66 dollar puts expiring Friday😂", "score": 2, "replies": [{"body": "Don't worry, you're still richer and smarter than everyone else.", "score": 6, "replies": [{"body": "Look at VM trying to keep me up", "score": 4, "replies": [{"body": "he's true thou.. and we all love you.. mostly sexual", "score": 1, "replies": []}]}]}]}, {"body": "curious as why people use DMA vs EMA - i learned to use EMAs so I don't know the difference. Looking at SPX it seems to have closed right below the 200 EMA it today.  seems like it rejected but not to the penny.", "score": 2, "replies": []}, {"body": "“Why bears should be taking profit”\n\n“I’m not a bear by any sense”\n\nWell yeah duh", "score": 2, "replies": []}, {"body": "This is a bunch of baloney...", "score": 2, "replies": []}, {"body": "You can pry my November puts out of my cold dead hands.", "score": 2, "replies": []}, {"body": "This is the exact post I needed to confirm my bearish sentiment.", "score": 2, "replies": []}, {"body": "I think we do go mini bullish to close out the week. I don’t want to be caught out of position so I’ll hold. Something big is going to happen later this month imo", "score": 1, "replies": [{"body": "Big up or down", "score": 1, "replies": [{"body": "Big down", "score": 2, "replies": []}]}]}, {"body": "[“aS rEaDeRs KnOw](https://tenor.com/VAlg.gif)….”", "score": 0, "replies": []}, {"body": "so if we cross 200 ma then what?", "score": 1, "replies": [{"body": "Flush and high chance for the recession", "score": 3, "replies": []}]}, {"body": "Either it will stick or it won’t 😂", "score": 1, "replies": []}, {"body": "Cool story bro. You do that.", "score": 1, "replies": []}, {"body": "Bears don’t have profits lol. They’ve been getting cucked all year", "score": 1, "replies": []}, {"body": "Annnnd it’s gone", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You're a fucking idiot, you'll never get rich if you think like that.", "score": 1, "replies": []}]}, {"body": "The recession will start with the fall of Twitter. You heard it here first.", "score": 1, "replies": []}]}
