{"title": "Timing of AAPL earnings", "selftext": "I’m sitting on some AAPL 390C 7/31.  Apple reports earnings after hours today 7/30.\n\nHypothetically, let’s say they crush earnings expectations and open at 400 on Friday 7/31. Would I be instantly assigned the contracts on Friday morning, or could I still sell them?\n\nI don’t want to buy the underlying shares, just want to sell the options at a profit if earnings are good. Willing to take the loss if they end up out of the money. Any advice on my timing here would be much appreciated.\n\nUpdate: Decided to take the gamble and hold on to my position overnight. Now I’m going to head over to wallstreetbets and rub it in their faces.", "id": "i0nhcs", "created_utc": 1596121049.0, "score": 18, "upvote_ratio": 0.77, "num_comments": 65, "comments": [{"body": "Please tell me you held", "score": 11, "replies": [{"body": "Yep, decided to take the gamble rather than sell to break even. Cashing in my chips tomorrow morning.", "score": 14, "replies": []}]}, {"body": "\"Will I instantly be assigned...\" - if you purchased the contracts, it's not possible for you to be assigned, it's up to you to exercise if you want to. If you don't want to own the stock, you would just sell it.\nThis is options 101, I feel like people should understand this before they are allowed to make trades.\nBut Theta gang thanks you for your business.", "score": 5, "replies": [{"body": "I do understand the basics on paper. But theory doesn’t always match reality. \n\nThis is my first foray into actually trading options, so I was unsure of the logistics on how things work on expiration day, and it seemed especially important given the earnings report the day before expiration.  Further compounding things, my broker sent me an email this morning warning me that I have near the money expiring options in my account and they may take action on them. So, I figured the best thing to do was panic and ask internet strangers how this whole thing works. Glad I did, because I’ve actually gotten some really insightful input and am learning with my feet to the fire now.", "score": 2, "replies": [{"body": "Okay, just be careful out there. Recommend if playing around earnings you stick with defined risk positions as small as possible, so you don't have to get burned too badly before you learn not to play around earnings.", "score": 2, "replies": []}, {"body": "The contracts could be exercised automatically. This may depend on specific broker practices, or instructions from the contract holder.\n\n>  Generally, OCC will automatically exercise any expiring equity call or put in a customer account that is $0.01 or more in-the-money, and an index option that is $0.01 or more in-the-money. However, a specific brokerage firm's threshold for such automatic exercise may or may not be the same as OCC's.\n\nhttps://www.cboe.com/education/getting-started/quick-facts/expiration-exercise-assignment", "score": 1, "replies": [{"body": "This is what concerned me, and the reason I asked the question. I definitely don’t have the cash to cover if they automatically exercise my options. Should be irrelevant though, as I plan to sell first thing tomorrow since I’ll be well ITM.", "score": 2, "replies": [{"body": "Well, if you let it go all the way to close without selling, and it was in the money, I think they would be right to assume that you wanted to exercise rather than just toss it in the trash. But it should never be executed automatically.\n\nAlthough now that I think of it, maybe I've heard of Robinhood selling a call for you before close if you don't have cash to buy the shares? Not the same as executing tho", "score": 1, "replies": []}, {"body": "In the case of automatic exercise, you might assume that it would happen at the time of expiration - but that would need to be confirmed.  I'm not sure how much each broker's practices affect that, and it may be different for weekly vs. standard options.\n\nIdeally, if auto-exercised, you'd be long the shares at the open the next day, with a margin call, and you could immediately sell them.  However, there could be a lot of movement in premkt, or at the open - the easier route is just to sell to close the options before expiration.", "score": 1, "replies": []}]}]}]}]}, {"body": "Eyyy left this tab open, glad it went well for you", "score": 4, "replies": []}, {"body": "How much did you pay for them? The break-even right now is $394, so you'd pretty much need an open above $390 to have any kind of value.   \n\n\nMake sure you post tomorrow when you find out what IV crush is :)", "score": 7, "replies": [{"body": "I paid 3.50 for them, and they’re sitting around 3.70 right now, so I could bail out today and pretty much break even.", "score": 5, "replies": [{"body": "Fair. If it were me, I'd go for break-even. But only because I can't comfortably justify Apple being at 25% above pre-covid levels. And the ad revenue + general numbers for all of the Big 4 reporting this afternoon will show us how healthy the rest of corporate America (and the world) really is.", "score": 5, "replies": [{"body": "this did not age well", "score": 6, "replies": [{"body": "No, but you also can't go broke taking profits. \n\nAnd 5 companies are carrying the S&P500. Not very sustainable IMO, but hey ride the wave while it's here I suppose.", "score": 1, "replies": []}]}, {"body": "May not be justifiable, but it's at 405 now (5:30 EST)", "score": 2, "replies": [{"body": "Yeah I saw they beat earnings. I wasn't invested so didn't matter. Made a killing on VXX calls this morning so didn't need to play earnings this afternoon. \n\nProbably should've, but there will be more opportunities to make money.", "score": 1, "replies": []}]}]}]}]}, {"body": "So you would have time to react on Friday morning. Most probably you wouldnt be able able to excercise the shares until closing session on Friday and only if you close in the money. However, if by Friday you do not have enough funds to buy the shares and they are in the money, then the broker most probably will sell your call options between noon and one hour before close at market prices.\nAlso as a side note, playing a stock through its earnings is a complete gamble. Its more reliable to play the runup to the event from a couple of weeks earlier. Especially considering that bigtech stocks are at all time highs and many have the beating expectations priced in, so even if they beat theres still a real possibility that they go down, as was the case with MSFT or NOW in the last days for example. \nAlso consider that there is a portion of the options premium, Implied Volatility (IV) that gets eroded quickly after catalyst events such as earnings.\nHope this helps", "score": 4, "replies": [{"body": "Good insight. Thank you.", "score": 3, "replies": []}]}, {"body": "You’ll get IV crushed", "score": 6, "replies": [{"body": "Kinda what I thought. So if I still want to play the earnings report, I’m thinking I sell the 7/31 options today while they still have value and roll the proceeds into something with a later expiration?", "score": 8, "replies": [{"body": "You won’t get assigned to buy calls. You have a right but no obligation to buy shares with call options (with puts is the opposite). You can sell them. IV crush is very likely. Good luck!", "score": 6, "replies": []}, {"body": "Don't listen to the guy above. If your position ends up ITM after earnings you'll be golden. Most people in your position opened that exposure purely for the gamble of going ITM and selling to an algo-bot immediately.", "score": 4, "replies": []}]}, {"body": "We don’t know when they purchased them. If it goes ITM then that’s intrinsic value and IV crush isn’t as applicable.", "score": 4, "replies": []}, {"body": "> You’ll get IV crushed\n\nsix hours never aged so bad.", "score": 3, "replies": [{"body": "Correct but could have easily gone the other way. Each ER is a binary event.", "score": 2, "replies": []}, {"body": "Inverse what I say 😂🤣", "score": 2, "replies": []}]}, {"body": "Not necessarily", "score": 2, "replies": []}]}, {"body": "You could sell a call above the price you paid to create a spread. This will protect you from some theta and IV crush tomorrow if it doesn’t go up. That way you don’t lose everything you put in.", "score": 2, "replies": []}, {"body": "El dudreaux gonna be rich! What is happening now?", "score": 2, "replies": [{"body": "I’m buying shots for everyone!", "score": 5, "replies": [{"body": "Good play - sell tomorrow AM!", "score": 3, "replies": [{"body": "TY. That’s the plan!", "score": 2, "replies": [{"body": "How much you upsies. At work and cant look into too much", "score": 2, "replies": [{"body": "It’s hanging around 405 after hours. I have 5 calls at 390, so I should be able to buy a nice lunch after I sell tomorrow.", "score": 2, "replies": [{"body": "Hell yeahhh. Supersize dose fries", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "You can exercise tomorrow morning if you want, but wait until the end of the day.\nIf they dip under $400, then exercising at $400 would have lost you money.\n\nEdit: I misread. Depends on your broker, they usually prefer if you sell before noon if you are not planning on possible assignment.", "score": 4, "replies": [{"body": "Ok this pretty much answers my question. It sounds like I’ll have time to react on Friday morning without having to worry about being assigned automatically. I have no interest (nor do I have the equity in my account) in ponying up for 500 shares of AAPL.", "score": 3, "replies": [{"body": "You cannot be assigned, you are long the contracts.", "score": 3, "replies": [{"body": "No, he can't be assigned, but his contracts may be exercised automatically.  This may depend on specific broker practices, as well.\n\n> the Options Clearing Corporation (OCC) automatically exercises options whose official close is one penny or more in-the-money. \n\nhttps://www.nasdaq.com/articles/automatic-exercise-after-hours-risk-and-other-options-expiration-issues-2010-11-18", "score": 1, "replies": []}]}, {"body": "If it shoots up, sell all but 1 if you want to go long Apple, then sell covered calls if you’re worried about a crash.", "score": 1, "replies": []}]}]}, {"body": "if you can sell them for a profit today I would just take my money.  I don't know if AAPL is going to crush earnings as much because their new phones have been delayed because of covid.", "score": 1, "replies": []}, {"body": "Most people buying calls. I bought these AAPL put debit spreads based on idea of the short-term dip and the supporting articles I have found.\n\nPositions:\n\n1 AAPL 390/387.5p exp 08/14\n\n2 AAPL $390/387.5 exp 08/21", "score": 1, "replies": [{"body": "What were the supporting articles?", "score": 1, "replies": [{"body": "You are welcome\n\n[https://www.forbes.com/sites/kramermichael/2020/07/26/apples-stock-may-drop-following-earnings-as-bearish-bets-rise/#188951b457c4](https://www.forbes.com/sites/kramermichael/2020/07/26/apples-stock-may-drop-following-earnings-as-bearish-bets-rise/#188951b457c4)", "score": 1, "replies": []}]}]}, {"body": "I’d say reduce your position and take the profits now (though small). The IV crush and poor economic data sets up a situation where even if they have strong earnings, it’s priced in. Anything less than a complete blowout/ big announcement would cause a drop in stock price given the headwinds.", "score": 1, "replies": []}, {"body": "Dude we need an update lol", "score": 1, "replies": [{"body": "Held on to them. Hoping to cash in tomorrow AM.", "score": 2, "replies": [{"body": "Congrats!!", "score": 1, "replies": []}]}]}, {"body": "It’s goin to rip up now more that the rest of FAANG on the stock split and solid er. I actually regretted taking my 25% profits last week and dove right back in AH", "score": 1, "replies": []}, {"body": "Thanks I really appreciate you taking the time to answer.", "score": 1, "replies": []}, {"body": "How much was the option for?", "score": 1, "replies": []}, {"body": "No way you are making money out of these. Apple gonna dip after earnings regardless and you’ll get IV crushed. I’d sell today when it goes up a bit.\n\nEdit: Looks good AH. OP you might have gotten lucky. Good job.", "score": 1, "replies": [{"body": "I agree on this one.", "score": 1, "replies": []}, {"body": "Maybe, but it's at 406 AH.  The crush will be severe, we'll see if it's enough.", "score": 1, "replies": [{"body": "Still trying to understand this crush thing..is it because his option is about to expire tomorrow? The stock is up $23...won’t his options be worth a good amount tomorrow at 9:30? Would it make a difference if he had that same option for a 8/20 expiry? Just trying to understand.", "score": 1, "replies": [{"body": "Well, it's up 23 now, but what matters is where it is when options trading opens tomorrow.  Pretty safe bet that OP will be happy if he held overnight though.\n\nThe crush relates to earnings release, not to expiration.  Options prices are set by demand, and that demand is expressed in IV - this typically gets bid up before an earnings release, and collapses after. This means long options bought near earnings are more expensive  than at \"normal\" times, so OP's gains will depend on when he bought (i.e., how much he paid up for the option, if IV was higher) and the amount of crush.  \n\nThe amount of option price movement would be different for an 8/20 option, because delta and gamma vary with respect to time to expiration.\n\nIf you want to understand more about this stuff, check out Natenberg's book, the bible on options.", "score": 3, "replies": []}]}]}, {"body": "Reasoning oh great insider", "score": 0, "replies": [{"body": "Pandemic means people aren’t buying expensive phones. You really need a reason?", "score": 1, "replies": [{"body": "This aged poorly. iPhone sales up 2%, revenue up 11%, EPS up 18% YoY.", "score": 4, "replies": []}, {"body": "The pandemic is hitting people disproportionately. The rich aren’t hurting as much as the poor. Something to consider about aapls outlook.", "score": 2, "replies": [{"body": "Don’t forget Apple Pay .... they get a cut and their servicing rev stream is solid", "score": 2, "replies": [{"body": "I use Apple Pay for everything really I just scan my watch with coronavirus I noticed more people trying this. Something to consider.", "score": 1, "replies": []}]}, {"body": "True but part of apple’s success is that everyone buys their expensive phones, not just the rich.", "score": 1, "replies": []}]}, {"body": "Oops.", "score": 2, "replies": []}]}]}]}]}
{"title": "AAPL split and options question", "selftext": "So with a 4-1 split, how does that affect options volume and profitability in the future?  For example, let's say you are making 3-4 momentum moves a day on Apple in 5 contract lots.  Would there now be 4 times the volume of options traded thereby increasing liquidity or would this actually make it more difficult because the price is less per contract or??? \n\nTheoretically you can time 5 lot moves now and make $50-500...but a 5 lot move with a quarter of the price is a lot more challenging to make as much cash...as where 20 contracts make this about the same.  Hopefully this isn't confusing...", "id": "i0tsb8", "created_utc": 1596141794.0, "score": 175, "upvote_ratio": 0.96, "num_comments": 61, "comments": [{"body": "Higher liquidity will eventually flow into post-split AAPL options, since a stock split is usually done to attract more retail activity. HOWEVER....\n\n... in the meantime current option contracts will be adjusted by the OCC (effective as of the day of the split) and the liquidity THERE will be horrible.\n\nKnowing this, it is better if you bail out of current option positions in AAPL because liquidity will dry up once new post-split options are available.", "score": 126, "replies": [{"body": "Options are auto adjusted. The holder of an option contract will have 4 times as many contracts at 1/4 the strike price.", "score": 63, "replies": [{"body": "Probably not. The options will have a new deliverable. The options themselves won’t split.", "score": 23, "replies": [{"body": "This is correct. I had a long position on USO. When USO went through a reverse split, I was assigned a new deliverable USO1.", "score": 20, "replies": [{"body": "You and me both....", "score": 6, "replies": [{"body": "You, you, and me 3", "score": 10, "replies": [{"body": "that makes FOUR of us. I still got mine, lol. I'd frame them if I could for novelty purposes - and to remind me what a bad play long term USO LEAPS were", "score": 6, "replies": [{"body": "Hey! I’m in the club too!", "score": 3, "replies": [{"body": "You and me six", "score": 1, "replies": []}]}]}]}]}, {"body": "Don’t remind me of that nightmare", "score": 1, "replies": [{"body": "I feel you bro", "score": 1, "replies": []}]}]}]}, {"body": "The only official source for information on option contract's specifications is the OCC.\n\nCheck back maybe tomorrow when they will have an information memo detailing what will happen to existing options. It might just be what you are describing.\n\n [https://infomemo.theocc.com/infomemo/search](https://infomemo.theocc.com/infomemo/search)", "score": 9, "replies": [{"body": "check also on [optionsonar.com](https://optionsonar.com).", "score": 1, "replies": []}]}, {"body": "Yes. If it is an even split, this is the case. An odd split (3:2 , 6:5) will entail a different multiplier for number of shares per option, and will modify the share price by the reciprocal of the split. For example, 1 call with a 60 strike price undergoing a 3:2 split  will deliver 150 shares per contract at a price of 40.", "score": 3, "replies": []}, {"body": "You sure it won’t be non standard options? That’s what happens in a reverse split. Never messed with options on a forward split before.", "score": 4, "replies": [{"body": "Reverse splits are treated differently. Take a look at Article VI Section 11A [here](https://www.theocc.com/getmedia/3309eceb-56cf-48fc-b3b3-498669a24572/occ_bylaws.pdf). \n\n> (iii) reverse stock splits, combinations of shares, or similar events, option contracts shall be\n> adjusted solely for purposes of determining the property deliverable upon exercise of the option,\n> by decreasing the unit of trading to reflect the number of shares eliminated. If an adjustment is\n> made in accordance with the preceding sentence, the unit of trading for all such adjusted series\n> of options shall remain unchanged for purposes of determining the aggregate exercise price of\n> the option and for purposes of determining the premium for any such option purchased and sold.\n\nA 1:4 split will always result in a number of shares that is still divisible by 100. A 4:1 reverse split will not. If I hold 6 contracts that's 600 shares. In a 1:4 split I'd now have 24 contracts or 2400 shares. A 4:1 reverse split however would leave me with 1.5 contracts or 150 shares. That's a problem since contracts have to be in multiples of 100.", "score": 2, "replies": [{"body": "Yeah since you have to multiply by 4 they could just do that for contracts right", "score": 2, "replies": []}]}]}, {"body": "Wait to see what the OCC says.", "score": 1, "replies": []}, {"body": "That’s correct!", "score": 1, "replies": []}, {"body": "I only wish that were true. It would make so much sense if the OCC would automatically adjust all those options. But I don't think they do.", "score": -1, "replies": [{"body": "It’s literally what they do", "score": 1, "replies": []}]}]}, {"body": "Tomorrow morning a good time to dump?", "score": 1, "replies": []}, {"body": ">Knowing this, it is better if you bail out of current option positions in AAPL because liquidity will dry up once new post-split options are available.\n\nIs this true? I am short AAPL put options expiring in 2020 and what happens? I thought it would be simply that contract quantity is multiplied by 4 and strike price is divided by 4?", "score": 1, "replies": [{"body": "The OCC might just do that in which case you don't need to do anything. Let's wait until they make it official in here:\n\nhttps://infomemo.theocc.com/infomemo/search", "score": 2, "replies": [{"body": "i just looked at the document for TSLA, and didnt even understand it, if you can break it down for me when it is released I'd be eternally grateful. Just spent a lot of money on one contract expiring Sept 20 and wondering what I should do. thanks", "score": 1, "replies": []}]}]}]}, {"body": "What you described will encourage people who could not afford before to be able to acquire more shares to rise the stock price. With fractional share ownership I suspect it will slow down the process.  As for option I think you need to increase contracts accordingly which I agree is harder with a lower price.", "score": 12, "replies": []}, {"body": "[deleted]", "score": 21, "replies": [{"body": ">Personally I think the split is a distraction from the challenges posed by the handset demand climate. \n\n\" Apple was the fastest-growing major smartphone brand last quarter in China \"\n\n [https://www.scmp.com/tech/gear/article/3095151/apples-china-iphone-sales-surge-amid-price-cuts-and-gradual-consumer](https://www.scmp.com/tech/gear/article/3095151/apples-china-iphone-sales-surge-amid-price-cuts-and-gradual-consumer) \n\nI expected car, home, and gadget prices to be in a deflationary spiral at this point in the pandemic.  I was wrong.", "score": 18, "replies": [{"body": "China has a real economy as in they make real things. Most of US is mom and pop shops taking a cut with no real contribution. Real economy never stops.", "score": -6, "replies": [{"body": "You mean real like this?:\n\n [https://www.youtube.com/watch?v=TyNdRfQohZA](https://www.youtube.com/watch?v=TyNdRfQohZA) \n\nor this?:\n\n [https://asia.nikkei.com/Spotlight/Caixin/Mystery-of-2bn-of-loans-backed-by-fake-gold-in-China](https://asia.nikkei.com/Spotlight/Caixin/Mystery-of-2bn-of-loans-backed-by-fake-gold-in-China) \n\nOr were suggesting that China doesn't use consumer debt to pump GDP like in the west?:\n\n [https://www.scmp.com/economy/article/3093132/china-raises-alarm-property-bubble-high-risk-shadow-banking-returns-amid](https://www.scmp.com/economy/article/3093132/china-raises-alarm-property-bubble-high-risk-shadow-banking-returns-amid) \n\nI wouldn't assume any countries is more real than any other.  \n\nApple saw huge domestic growth in iPads and Mac products this quarter.  When it comes to homes, cars, and gadget sales the US economy is soaring right now, so I am not sure what the point of your comment is?", "score": 5, "replies": [{"body": "Or people sitting around making youtube videos and \"documentaries\" instead of real physical things", "score": -3, "replies": []}]}, {"body": "Plus anyone laid off has been making 31k+ a year on unemployment which stops at the end of this month.  The government has been loaning to anyone who wants money.  People and companies are about to get the life support removed and see who's really economically viable and who's not.\n\nI work in Aviation and July 31st is 60 days out from Oct 1st for purposes of the WARN act.  The news just keeps getting worse and worse in the industry.  I just realized I fucked up and should have shorted the crap out of all the airlines for tomorrow...", "score": 3, "replies": []}, {"body": "Mom and pop shops provide a more vital service than most white collar jobs.", "score": 1, "replies": []}]}]}]}, {"body": "Take a look at Article VI Section 11A [here](https://www.theocc.com/getmedia/3309eceb-56cf-48fc-b3b3-498669a24572/occ_bylaws.pdf). \n\n> a stock dividend, stock distribution or stock split whereby a whole number of additional shares\n> of the underlying security is issued with respect to each outstanding share, each option contract\n> covering that underlying security shall be increased by the same number of additional option\n> contracts as the additional number of shares issued with respect to each share of the underlying\n> security, the exercise price per share in effect immediately prior to such event shall be\n> proportionately reduced, and the unit of trading shall remain the same\n\nBasically the number of contracts and strike price you have will be adjusted.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Your contract will control 400 shares at a strike price of $100.", "score": 19, "replies": [{"body": "Would that not be 4 contracts with a 100 shares each? So they remain standard.", "score": 2, "replies": [{"body": "It would be unfair to retroactively force the seller of the 1 contract to now be obligated to the terms of 4 separate contracts.\n\nI believe the numbers would be settled like this: a new order for 4 contracts each with a $100 strike could be matched to a sell order for a contract that controls 400 shares at a $100 strike.", "score": 2, "replies": [{"body": "Just FYI, since then there’s more clarity about this:  \nThe contracts _will_ remain standard, so from, say 1 contract of $500 strike to 4 contracts with $125 strike.", "score": 1, "replies": []}]}]}]}]}, {"body": "What's with the insane put skew? Just next week ATM is $2,250 premium ($22.50 per share) vs the call side of $220 ($2.20 per share).", "score": 5, "replies": []}, {"body": "Will the popularity of brokerages offering fractional shares reduce the benefits of splits in the future? Any thoughts?", "score": 3, "replies": []}, {"body": "Fwiw an article said shares would be distributed on the 24th and the new share system begins on the 31st of August.  I assume there's a reason for the week difference", "score": 3, "replies": []}, {"body": "Hey r/options currently I own three 10/16 380C and two 12/18 400C AAPL calls\n\nplanning to sell off  December ones and keep 380C calls for some more time.. may be in this Kangaroo market.. get rid of them fast?", "score": 4, "replies": []}, {"body": "Hi there I have an call option 410, 18/SEP/2020, what should I do?\n\nI should sell it or keep it?", "score": 2, "replies": []}, {"body": "What happens to the Option:\n\n“What Is a Stock Split?\n\"Being made whole\" means the options contract is modified so that the holder is neither negatively nor positively affected by the corporate action. While a stock split adjusts the price of an option's underlying security, the contract is adjusted so that any changes in price due to the split do not affect the value of the option. If your option is purchased post-split (that is, after the split is announced), it will not be adjusted because it already reflects the post-split price of the underlying security. The Options Clearing Corporation will automatically make these adjustments for the sake of orderly and smooth functioning markets”\n\nhttps://www.investopedia.com/ask/answers/what-happens-to-options-when-stock-splits/\n\nTDLR; Auto Adjusts, no direct benefit or loss for holder", "score": 2, "replies": [{"body": "aka hold, Apple is a more stable tech stock to hold these days..", "score": 1, "replies": []}]}, {"body": "So do you guys know what will happen to strike price ?? Let’s say the premium is 2.5 for 540$ strike price and have 2 contracts ... so after split , the strike price will become 135$ and I will have 8 contracts ... how much will be the premium for these contracts now ?", "score": 1, "replies": [{"body": "You have $540 strike calls ? Holy shit, that’s some deep OTM action.", "score": 3, "replies": [{"body": "Yes my friend.. most of the time I play deep OTM calls as the premiums are less expensive", "score": 2, "replies": [{"body": "What expirations. ?", "score": 1, "replies": [{"body": "December 2020", "score": 1, "replies": []}]}]}]}]}, {"body": "What you’re saying makes sense. Really I’m just trying to learn here - clearly, way to go haha", "score": 1, "replies": []}, {"body": "So if the split happens what will happen to the premium, at the end of the day if you buy and sell contracts that’s where you make your money. If everything will be split into 4 when it comes to the value of a CALL and multiply times 4 when it comes to contracts. Is the Premium going to be Split in 4, or stay the same ? Same question in regards to the Delta?", "score": 1, "replies": []}, {"body": "Today I bought one contract of 18 SEP 20 440 CALL.......I wasn't aware of the split and I am wondering how to proceed. Hold up until the split and dump before? Or hold through split and Sept Announcement? Or dump immediately", "score": 1, "replies": []}, {"body": "What will happen to my 8/21 440c AAPL?", "score": 1, "replies": [{"body": "read this thread. nothing. split isn't until aug 24th.", "score": 1, "replies": []}]}, {"body": "So, will options be impacted tomorrow? I have a few 8/16 405 calls.", "score": 0, "replies": [{"body": "No, the split isnt until end of august", "score": 4, "replies": []}]}, {"body": "Apple is splitting?", "score": -6, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "Will puts print because the stock price is going down or is it priced in?", "score": -8, "replies": [{"body": "Lol", "score": 1, "replies": []}, {"body": ">I only wish that were true. It would make so much sense if the OCC would automatically adjust all those options. But I don't think they do.\n\nhell no", "score": 1, "replies": []}]}]}
{"title": "Who's still betting on Walmart Plus?", "selftext": "All of the news said it was coming out in July so I loaded up on:\n\n* 2 7/31 $135 Call (-90%)\n* 5 8/28 $145 Call (-63%)\n* 2 10/16 $135 Call (- 25%)\n\nWho else is feeling kind of f\\*cked?", "id": "i0cp56", "created_utc": 1596070991.0, "score": 39, "upvote_ratio": 0.89, "num_comments": 60, "comments": [{"body": "Didn’t Kodak announce WMT+ today?", "score": 52, "replies": [{"body": "no they have the photo of the vaccine dumbass", "score": 36, "replies": []}]}, {"body": "Wmt is a fucking brick. I’m surprised it moved back to $130", "score": 16, "replies": []}, {"body": "So many people hyped it up, lol. I had some lost 700", "score": 12, "replies": [{"body": "sometimes i wonder if some people on here hyping up stocks actually selling calls", "score": 1, "replies": [{"body": "I feel the same bro. Fucking sucks", "score": 1, "replies": [{"body": "yeah i mean it's a real piece of shit move if it's true.", "score": 1, "replies": [{"body": "Join my discord get away from this piece of shit pump fest", "score": 1, "replies": []}]}]}, {"body": "*It's like a jungle sometimes. It makes me wonder how I keep from goin' under*", "score": 1, "replies": []}]}]}, {"body": "Diamond hands", "score": 13, "replies": []}, {"body": "I am holding more calls than you would believe. Played far OTM calls all month. Made bank, and anything I got caught in held for this lead up. It has been more stressfull than it should be. If I win, I will retire. If I lose, I am truly fucked.", "score": 9, "replies": [{"body": "may the force be with you", "score": 3, "replies": [{"body": "will report back.", "score": 3, "replies": [{"body": "Let’s get this bread.", "score": 3, "replies": []}]}]}, {"body": "Margin?", "score": 1, "replies": [{"body": "holding 100k cash account OTM Calls 140 150 160, 8/14-8/21. Been adding all month. Figure, Amazon misses earnings, gets hammered at senate, and Walmart Plus launches huge. Only need it to touch 140. Anything over, and we off.", "score": 2, "replies": [{"body": "I can see that happening if Amazon misses earnings. God speed", "score": 3, "replies": []}]}]}]}, {"body": "Walmart can post a 3728347% surprise on earnings and the stock would jump to $137 and stay there for 3 years.", "score": 7, "replies": []}, {"body": "I’ve got 8/21 130c that are about break even. I was thinking about moving on today", "score": 5, "replies": []}, {"body": "Lost and sold my late August 150c for like -70%. Still holding August 21 140c, down 70% I fully expect them to go to zero, so idk why I still have them. Honestly in awe how WMT can trade in the red as the rest of the market is green every time. Unreal", "score": 3, "replies": [{"body": "You don't thinks the news will come out before August 21? I lost faith in my 7/31s but if my august calls go to zero too fuck!!", "score": 5, "replies": []}]}, {"body": "620 calls deep...sept-jan...160-185...im holding till earnings", "score": 5, "replies": [{"body": "Same here for December. Walmart + or bust.", "score": 1, "replies": []}, {"body": "RemindMe! 2 weeks", "score": 1, "replies": []}, {"body": "When's earnings?", "score": -1, "replies": [{"body": "GIYF", "score": 2, "replies": []}]}]}, {"body": "Jan 2021 170c reporting for duty, sir!", "score": 3, "replies": []}, {"body": "buying before walmart plus was the play", "score": 3, "replies": []}, {"body": "Sell 10% OTM weeklies against your October position to hedge.", "score": 3, "replies": [{"body": "Shit why didn't I think of this just watching my long WMT positions bleed.\n\nWill implement from now on moving forward, thank you good sir.", "score": 2, "replies": [{"body": "I’m selling $142-145c weekly against my $125c & $130c. My exp is Sept. I think there’s some paper-handed selling going on right now. WMT is still positioned really well if you can hang on. \n\nAlso, a lot of people picked the August expiration right after earnings. I’d suggest rolling out a month to buy a couple weeks of theta decay.", "score": 1, "replies": [{"body": "I'm a bit unclear on the scenario of having them both go ITM, which I know would be crazy unlikely, but say someone tried to exercise the calls you sold, but you hadn't exercised the ones you bought, how would the brokerage handle that situation (auto exercise your bought calls to satisfy the ones you sold?) Maybe I should give my brokerage a call....", "score": 1, "replies": [{"body": "You need to watch it, which is why I set a weekly reminder on Wednesday to roll my weeklies out.", "score": 1, "replies": [{"body": "Makes sense. I'm waiting to talk to an E-trade representative now...would be nice if they just said \"Yes, if your weekly expires ITM (if I forgot to roll) we will auto-exercise your long dated call to satisfy the short\"", "score": 1, "replies": [{"body": "I don’t think they do. I haven’t had it happen, but a good friend of mine did (we both use E*Trade).\n\nHe has margin activated and I don’t, so maybe that’s part of it, too.", "score": 1, "replies": []}]}]}, {"body": "Also, I will sell much higher weeklies ($150c likely) the week of earnings.", "score": 1, "replies": []}]}]}]}]}, {"body": "You ever search for their products online? Fucken trash. Wannabe Amazon for boomers and meth heads.", "score": 4, "replies": [{"body": "All about the SEO and price nowadays. Most people google a product and look through to see which company sells it for the least", "score": 1, "replies": []}]}, {"body": "I have 1/15/21 $165 calls gotta play the long game might get more news in mid August", "score": 2, "replies": [{"body": "Wow. And I'm worried about my 1/25/21 $150 calls. Any idea like when this will launch?", "score": 1, "replies": [{"body": "no but im guessing after amazon earnings so many 2nd week of august im betting", "score": 2, "replies": []}, {"body": "Wow and I’m worried about my June 2021 145 calls lol", "score": 2, "replies": []}]}]}, {"body": "Made money on the last run up wmt had. I've decided to donate my money to theta gang on this one though unless all the planets align and mercury goes into retrograde", "score": 2, "replies": []}, {"body": "I’m gonna grab some 9/4 $135s tomorrow at open. It’ll pump at some point between now and then when the stimulus gets passed, or probably not but that’s what I’m going with regardless.", "score": 1, "replies": [{"body": "Hi gonna grab some 9/4 $135s tomorrow at open. it’ll pump at some point between now and then when the stimulus gets passed, or probably not but that’s what , I'm dad.", "score": 5, "replies": []}, {"body": "I hope you did!", "score": 2, "replies": [{"body": "Yes sir, balls deep in 130s and 135s. Let’s ride", "score": 1, "replies": []}]}]}, {"body": "12/18 $155c\n\nBled 25% the last week with no volume. Diamond hands until the market decides it's a tech stock, then it moons.", "score": 1, "replies": [{"body": "You’re making me chub.", "score": 1, "replies": []}]}, {"body": "I’m feeling effed for sure. But this will be my first time seeing if my hands can stay diamond. 66 calls for 180 dec.", "score": 1, "replies": []}, {"body": "Why did you actually believe it to begin with?", "score": 1, "replies": [{"body": "This", "score": 1, "replies": []}]}, {"body": "in the next 5 years maybe", "score": 1, "replies": []}, {"body": "An excellent example of how buying near-term expiries tend to fuck you over", "score": 1, "replies": []}, {"body": "2 $150 WMT 8/21c and I'm at -75%\n\nTold myself not to sell until they announce it but WMT has been flat for 4 weeks now", "score": 1, "replies": []}, {"body": "I went long, 06/18/21 calls reporting for duty!", "score": 1, "replies": []}, {"body": "Wait til the details come out.  Might be underwhelming.", "score": 1, "replies": []}, {"body": "Well tomorrow is July 31st... I'm holding my breathe but wouldn't be surprised if it was pushed back.\n\nThis was the dude that initially reported it:\n\n[https://twitter.com/DelRey](https://twitter.com/DelRey)\n\nWouldn't be surprised if it was pushed back, yet again.\n\n&#x200B;\n\nedit:  [https://www.vox.com/recode/2020/2/27/21154357/walmart-plus-walmart-grocery-delivery-unlimited-membership-amazon-prime](https://www.vox.com/recode/2020/2/27/21154357/walmart-plus-walmart-grocery-delivery-unlimited-membership-amazon-prime) \n\nSee, same dude that wrote about it back in February.   \n\n\nSomeone is probably leaking the news to him, but there is no concrete launch date on WMT's end so they don't have an obligation to launch it this month.", "score": 1, "replies": [{"body": "He’s cute tbh", "score": 1, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/FuckBush1 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}
{"title": "SQ Calls?🐂", "selftext": "I really like the 8/7 $129c for Square, with an earnings report soon I believe they will do as PayPal did today. I believe SQ will hit in the 140-145$ range. I compared charts of SQ and PayPal for their past 3 months. The charts look almost identical. I believe they will break their 133.34 resistance just as PayPal broke their 183.23 resistance today with their earnings call. I’m watching for a slight dip in square tomorrow (they sit at $131 now) to 129$ and then I will buy calls. What do you guys think? I like it", "id": "i0ebyl", "created_utc": 1596077529.0, "score": 7, "upvote_ratio": 0.69, "num_comments": 70, "comments": [{"body": "SQ depends a lot more on small business, farmers market types sales when compared to PayPal.", "score": 6, "replies": [{"body": "Square hit 151$ today", "score": 2, "replies": []}, {"body": "Quite right", "score": 1, "replies": []}]}, {"body": "I was wrong", "score": 7, "replies": [{"body": "Bingo bango 50% of all small buis is still closed with 65% projected to never open again. No way they beat earnings.", "score": 2, "replies": [{"body": "We shall see 🌈🐻", "score": 2, "replies": [{"body": "Son. Don’t. Unlike your fathers weak pull out game. Yo ass needs to pull out ASAP. Unless you got baby money in it then yolo.", "score": 2, "replies": []}, {"body": "I’ve been saying August 140calls for months. Loaded up on stock in the 40s as well. I have invested in it since it was 11. I think there is a very good chance.", "score": 2, "replies": []}]}, {"body": "I profited 🌈🐻", "score": 1, "replies": [{"body": "hey when did you sell to max profit? I dont think SQ is going anywhere. im fact it's at 152 rn and I could easily see it going up to 160 after a little dip and the volume is going way up because of its climb the last month or so. is now the right time to bet on it?", "score": 1, "replies": [{"body": "I had 129$c it’s way too late, sold at bout 151", "score": 1, "replies": [{"body": "Oh gotcha that was my exact question - to sell before or after. Did you miss out on profits? I think there's more to be made.", "score": 2, "replies": [{"body": "There’s a chance but I see a drop", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I profited", "score": 1, "replies": []}, {"body": "Square hit 151$ today, u are stupid", "score": 1, "replies": []}, {"body": "With some of the country reopened, their revenue will be up from last quarter.", "score": -4, "replies": []}]}, {"body": "Been holding $126c 8/21 since Monday last week trying to play the run up, I was under water until today lmao.", "score": 3, "replies": [{"body": "Facts, all these negative replies are making me want to buy it even more so u hold on to that shit I bet it makes a nice chunk of change come next Wednesday earnings", "score": 1, "replies": [{"body": "I’ll dip out before I’m not rolling the dice. Did it with PayPal today too ‘missed the extra move from earnings but took 0 risk into the ER.\n\nI’ll do the same with $SQ you’ll profit from me dipping out early I have the Midas touch. Any play I don’t take the risk on turns to gold.", "score": 2, "replies": [{"body": "Similarly, everything I buy tanks immediately and then moons 🚀 🚀 the moment I sell.", "score": 2, "replies": [{"body": "U must hold when market is down. Stonks only go up🐂🥇💡", "score": 1, "replies": [{"body": "Every morning, before I walk out of my parents basement to get picked up by the short bus, I stand in front of the mirror and yell “Bears are gay. Stonks go up.” Then for good measure I sit on my big green dildo while I look at pictures of JPOW.", "score": 2, "replies": []}]}]}, {"body": "That’s how it always works! Keep playin ur game partner. It’s up 📈", "score": 1, "replies": []}]}]}, {"body": "Square hit 151$ today", "score": 1, "replies": []}]}, {"body": "SQ had some wide intraday swings lately, good for scalping or accumulation. The option premiums are too high for an ER play tho imo", "score": 3, "replies": [{"body": "You are most likely right, I don’t expect earnings to push it over, I’m expecting there will be an bullish expectation for the stock", "score": 1, "replies": []}, {"body": "Tho I said earnings will break the resistance, I believe they still will, I don’t know if it will push enough to break even tho", "score": 1, "replies": []}, {"body": "Square hit 151$ today", "score": 1, "replies": [{"body": "I sold my stock before lunch and tried to get call spreads but those premiums were still too rich", "score": 2, "replies": []}]}]}, {"body": "Why do you like SQ?", "score": 2, "replies": [{"body": "They sell fractional shares?", "score": 1, "replies": []}, {"body": "Square hit 151$ today", "score": 1, "replies": []}, {"body": "They are here to stay in a world of electronic payments, and the earnings call will push the stock through their all time high. The earnings will not be as good as quarters from 2019 but will be better than the last quarter because of reopenings nationwide", "score": -3, "replies": [{"body": "Weak thesis", "score": 6, "replies": [{"body": "fuck a thesis watch", "score": 0, "replies": [{"body": "Never know I guess", "score": 3, "replies": [{"body": "Kodak", "score": 2, "replies": [{"body": "?", "score": 1, "replies": []}]}, {"body": "Sold for 500$ profit per contract today", "score": 1, "replies": [{"body": "Nice congrats. Guess I was wrong. Good job selling before earnings", "score": 2, "replies": [{"body": "I took yals advice fr fr good looks on making me cautious", "score": 1, "replies": [{"body": "Yah I’m not confident about the long term outlook of cash app and small business transaction on sq wouldn’t be much due to quarantine", "score": 2, "replies": [{"body": "I’m jus tryn make some quick flips. Don’t give a fuck how the company do to be honest", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "SQUARE owns CASH APP and CASH APP is on fire and is COVID free. DO you like my ALL CAPS?\nseriously no telling if it goes up or down but i am willing to bet my future lambo that it beats earnings, by a lot. \nGoing to buy a call tomorrow if not too expensive", "score": 2, "replies": [{"body": "Hi willing to bet my future lambo that it beats earnings, by a lot. \ngoing to buy a call tomorrow if not too expensive, I'm dad.", "score": 5, "replies": [{"body": "We so up lmao, I knew it was going to drop down today , now time to buy, I like the 128$ call", "score": 1, "replies": []}]}, {"body": "RIGHT!", "score": 1, "replies": []}]}, {"body": "I had an hour long phone call about buying 100c 3 months ago when SQ was at $63.... since then I've punched myself in the dick 400 times for not jumping on the train. At this point I'm going to wait for the pullback that will never happen before I get to miss more gains. Good luck friend.", "score": 2, "replies": [{"body": "Thank you 💯", "score": 1, "replies": []}, {"body": "Square hit 151$ today", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "A lot going on right now. I’ve been hearing the earnings probably will not push the stock through it’s 133 resistance, but I’m very very very fucking bullish with these guys, so something is going to make them pass 133. I just know it. I can feel it in my big bull balls no cap", "score": 2, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**SQ**|**$129**|**BUY CALL**|**2020-08-07**|**$6.03**|**$128.55**|**315**|**207**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckd87mrun5cka0728omebskjh) | [Track Record](https://www.pickmojo.com/user/rareexotic/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "They're also basically a bank now... and how are earnings for banks going?", "score": 1, "replies": [{"body": "let’s see then", "score": 1, "replies": []}, {"body": "Sold for profit 🌈🐻", "score": 1, "replies": []}, {"body": "Square hit 151$ today u fucking faggot", "score": 1, "replies": []}]}, {"body": "Only times I've used Square to pay is at very small businesses, pop-ups, farmermarket-style vendors, or otherwise paying for shit when at public events, which didn't happen for the past 3 months. I think it's a put for me dawg", "score": 1, "replies": [{"body": "Square hit 151$ today", "score": 1, "replies": []}, {"body": "Respect! But I see it otherwise 🔥", "score": 0, "replies": []}]}, {"body": "Great long term buy, but a good ER is already priced into the stock. So even if they have a good earnings report, the stock will barely go up. I would but long term calls or diagonal spreads", "score": 0, "replies": [{"body": "💯 thanks, do you have any ideas for a quick short term option?", "score": 1, "replies": [{"body": "I’m more of a 1-6 months range guy, but if ur looking for some quick plays I’d write Kodak puts/put spreads at around 7.5-10$. Done some research and it looks like the chances of Kodak falling back to single digits are basically impossible, and the IV on those puts are still pretty high.", "score": 2, "replies": [{"body": "I just got some news from Qanon that Kodak is working on Hydroxcloroquine , (supposed cure for virus) could be huge who knows. Thank you", "score": 1, "replies": []}]}]}, {"body": "Square hit 151$ today", "score": 1, "replies": [{"body": "Well u shouldn’t this to random retards online. It’s not a failure if u learned something", "score": 2, "replies": []}]}]}]}
{"title": "Good luck everyone with AMZN/GOOG/FB/AAPL options in 30min", "selftext": "", "id": "i0se7w", "created_utc": 1596137139.0, "score": 428, "upvote_ratio": 0.98, "num_comments": 62, "comments": [{"body": "[removed]", "score": 76, "replies": [{"body": "AMZN 3400/3500 8/28 gang just doesn't have the same ring, but it'll do", "score": 16, "replies": [{"body": "Those will print.", "score": 2, "replies": [{"body": "Praise Allah! \n\nMy actual position is long 3200/3300, short 3600/3700 8/28. I was too chicken to even go naked spread lol", "score": 1, "replies": [{"body": "That expired bro", "score": 2, "replies": [{"body": "Ah not 7, should have been 8/28. My mom says I'm special whatever that means", "score": 1, "replies": [{"body": "It might take some time for those to capture enough profit.", "score": 1, "replies": [{"body": "Yea, it'll take a long time for them to get that last 40% of max value, but the ratio of delta for the debit is still pretty nice since its OTM enough. If it gets at or in the money the next few days, it should get a little boost from the drop in IV", "score": 1, "replies": []}]}]}]}, {"body": "Looking like $2000 on those. Still a good day.   What was the cost basis? You picked them pretty damn good.\n\nEdit: maybe I’m not reading it right. +3200c -3300c, and -3600p, +3700p?", "score": 1, "replies": [{"body": "Close, I'm +3200c, -3300c, -3600c, +3700c, cost basis was a little over 2k.\n\nI thought they were reasonable strikes on their own, but I also tried to play the theta skew. Both the debit spread and the credit spread are theta positive, at least in the short term", "score": 1, "replies": [{"body": "So you need 3300 to get near max, i think it will get there.", "score": 1, "replies": [{"body": "Yup, I'm feeling pretty good about it rn. Net delta is around 10, so this jump will put it well into the green if it holds", "score": 1, "replies": []}]}]}]}]}]}, {"body": "3160/3200 7/31 did this morning and here we are", "score": 1, "replies": [{"body": "If we hold 3200 that's close to the perfect play. Idk where you got in, but that's gotta be a potential 10 bagger", "score": 1, "replies": []}]}]}, {"body": "Why did my spread tank right before close?", "score": 4, "replies": [{"body": "RH being RH", "score": 3, "replies": []}, {"body": "Spreads always go nuts at the close, people trying to \"sneak\" in a profit or loss. The bids and ask's are made up and dont matter.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Dune checks out.", "score": 1, "replies": []}]}]}, {"body": "Fuck what should I do", "score": 28, "replies": [{"body": "Get Champaign ready for either outcome 😎", "score": 12, "replies": [{"body": "Na, get some fucken white claws and shotgun them. White bitch style", "score": 10, "replies": [{"body": "White girl wasted", "score": 3, "replies": []}]}]}]}, {"body": "Too rich for my blood. NOK 8/7 $5c here. Earnings in the AM tomorrow", "score": 9, "replies": []}, {"body": "Y'all RH already does fractional shares, can we start a petition to make them offer fractional options? How fucking hilarious would it be to buy 15% of a single AMZN Call?", "score": 10, "replies": [{"body": "🥇 too broke to give award rn", "score": 3, "replies": []}]}, {"body": "I’m about to get fucked so hard and yet I hold on and don’t sell. Oooo weeeee.", "score": 6, "replies": [{"body": "Good on you ay", "score": 1, "replies": [{"body": "A stopped clock is right twice a day, I guess this was one of those moments lol", "score": 2, "replies": []}]}]}, {"body": "$FB 270c 8/21 boys", "score": 7, "replies": [{"body": "260 for me <3", "score": 1, "replies": [{"body": "We print together or we burn together", "score": 1, "replies": [{"body": "I have faith", "score": 1, "replies": []}]}]}]}, {"body": "Smokin that ew wee...", "score": 6, "replies": []}, {"body": "Buy VXX 8/7 29 or 30c and sell first thing in AM. Quick profit or cut your losses first 30 min after bell", "score": 3, "replies": []}, {"body": "This is me, only replace \"poor\" with \"pussy\"", "score": 3, "replies": []}, {"body": "This is one the GOAT meme formats. Nice un OP\n\nAlso - BALLER SHOT CALLERS ALL RICH AF NOW", "score": 3, "replies": []}, {"body": "Work 2K to drain my 401k for calls?", "score": 2, "replies": []}, {"body": "OPK too", "score": 2, "replies": []}, {"body": "Probably should have held on to my EBS calls. I sold for a small profit just before close thinking IV crush wasn't worth it, but it's up over 7% after earnings now and still rising.", "score": 2, "replies": []}, {"body": "#Long live 🌈🐻", "score": 3, "replies": []}, {"body": "Im gay cash gang sry", "score": 2, "replies": []}, {"body": "buy fractional shares with max leverage ?", "score": 1, "replies": [{"body": "Robinhood should give us fractional options so we can crash the world economy quicker.", "score": 17, "replies": [{"body": "Safety third!!", "score": 4, "replies": []}]}]}, {"body": "thank you aapl, i just got to watch my wifes bf fuck her 🤗", "score": 1, "replies": []}, {"body": "Dont options tank right after earnings because of loss of volatility?", "score": 1, "replies": []}, {"body": "FB puts will fucking print, bet on it.", "score": -1, "replies": [{"body": "Ouch", "score": 8, "replies": [{"body": "You can also bet that I'm a retard. But I also had some Expedia puts, so looks like it's gonna be a wash.", "score": 0, "replies": [{"body": "Hey man, thanks for making me feel like I won just by not playing earnings.", "score": 2, "replies": []}]}]}, {"body": "show us your position", "score": 5, "replies": []}, {"body": "Too many FB puts around these parts. It’s gonna sky rocket. \n\nHolding no position overnight but SPY", "score": 3, "replies": []}, {"body": "lol, up 6% so far.", "score": 3, "replies": [{"body": "How up u think is going to be? Just asking for ur opinion", "score": 1, "replies": []}, {"body": "How up u think is going to be? Just asking for ur opinion", "score": 1, "replies": []}]}, {"body": "FB is in a unique position where they're pissing off both Republicans and Democrats, both US and EU regulators. Antitrust is coming. FB 210P exp 1/21.", "score": 1, "replies": []}]}, {"body": "Bought 10k of SPY calls at 4:10PM. Shawarmas on me tomorrow", "score": 1, "replies": []}, {"body": "AMZN puts", "score": -5, "replies": [{"body": "AMZN calls", "score": 10, "replies": [{"body": "The only way is up!!", "score": 1, "replies": []}]}, {"body": "I don't think you will even have enough to invest in $ROPE tomorrow!", "score": 1, "replies": [{"body": "I spent $100 on 2 OTM put debit spreads", "score": 1, "replies": []}]}]}]}
{"title": "Do y’all think the market will crash tomorrow?", "selftext": "Yo, i’m not a gay bear but I bought a call credit spread on spy this morning. After the premarket dip is when i purchased the spread and fuck man spy climbed so much today i’m getting scared. But i think it won’t do that again tomorrow. Did I make a mistake? (I’m newer to trading btw)\n\nEdit: my call credit spread did not end up gettting fucked and spy closed ~$2 under my two legs. close one 😳", "id": "i0w43r", "created_utc": 1596149617.0, "score": 4, "upvote_ratio": 0.54, "num_comments": 67, "comments": [{"body": "Let me check\n\n\\*inserts finger into ass\\*\n\nhmm, ask again later.", "score": 178, "replies": [{"body": "This made me chuckle", "score": 38, "replies": [{"body": "Me too, hope OP asks me to do it again later.", "score": 19, "replies": []}]}, {"body": "actually laughed. thank u for my first laugh today as a SLV holder", "score": 9, "replies": [{"body": "Well maybe this will make you feel [better](https://imgur.com/a/1CA21bZ) \n\nWon't tell you about my UPS I paperhanded though.", "score": 3, "replies": []}]}, {"body": "Don’t forget to smell it afterwards", "score": 9, "replies": []}, {"body": "That sounds fun.", "score": 4, "replies": []}, {"body": "i laughed honestly", "score": 3, "replies": []}, {"body": "Would’ve given an award if I had reddit points or smth", "score": 3, "replies": []}, {"body": "I chuckled so hard that i woke up her and my wife’s boyfriend", "score": 2, "replies": []}, {"body": "Remindme24hrs", "score": 3, "replies": []}, {"body": "Does brown mean green or red? Need confirmation\n\nLick if you need to.", "score": 2, "replies": [{"body": "Brown is green, red is red. Try not to drill too deep, just the first knuckle.", "score": 6, "replies": [{"body": "📌", "score": 1, "replies": []}]}]}, {"body": "Forgot to smell it", "score": 1, "replies": [{"body": "Was kind of like [this.](https://www.youtube.com/watch?v=DKy5gI5P8ak)", "score": 2, "replies": []}]}]}, {"body": "No it won’t. I bought puts at close. You are safe", "score": 51, "replies": [{"body": "Same, and Amazon is up $154 after hours.", "score": 8, "replies": []}]}, {"body": "33% drop in quarterly GDP so Stonks go up\n\nBrrrrrr", "score": 30, "replies": []}, {"body": "Good earnings on tech today so unless the orange one gets the Rona we will probably see the green hulk dildo again tomorrow sponsored by Jpow with endorsements from Jeff and the boys", "score": 18, "replies": [{"body": "If that fat fuck gets the rona, everything will go up on the good news!", "score": 1, "replies": []}]}, {"body": "We can’t be sure you’re not a gay bear until you’ve had sex with another man, and confirmed that you did not in fact enjoy it.\n\nWait what was your question?", "score": 15, "replies": []}, {"body": "Green tomorrow. Blame FAAG", "score": 8, "replies": []}, {"body": "i love wsb and wiping a month’s worth of gains starting out. never gonna go bearish again. might paper hand it and take a less significant loss instead", "score": 6, "replies": [{"body": "You take your fucking medicine and hold like a man! I didn't raise no pussy paper handin weakling!", "score": 8, "replies": [{"body": "i’m seriously riding the fence on this one", "score": 2, "replies": []}]}]}, {"body": "I bought puts today so i could feel daddy Jerome give it to me rough again & we all know he loves to deliver a good fucking. With that being said, SPY $330 at open.", "score": 7, "replies": []}, {"body": "There’s a groundhog that comes out at 4:20pm every afternoon in our backyard and on the days he doesn’t the market is red the next morning. He’s out right now and doing somersaults. Markets to the moon tomorrow 🚀", "score": 5, "replies": []}, {"body": "Priced in, stock will jump", "score": 7, "replies": []}, {"body": "Out of all days, tomorrow is a day that won’t crash", "score": 12, "replies": []}, {"body": "I don’t have a crystal ball", "score": 7, "replies": []}, {"body": "Not after the sold earnings that were had today. \n\nAmazon and Apple are the economy now.", "score": 5, "replies": []}, {"body": "You're gonna get fucked, the same way writing call credit spreads fucked me hard. Sorry bro.", "score": 4, "replies": [{"body": "it’s all good at least we learned a valuable lesson", "score": 3, "replies": [{"body": "My Apple call credit spread is fucked too. From here on out, no 🌈🐻 business, okay?", "score": 2, "replies": [{"body": "That is indeed the lesson.", "score": 3, "replies": []}, {"body": "i agree. if you’re gonna be gay, you’re gonna get the shaft", "score": 2, "replies": []}]}]}]}, {"body": "Greeeeeeen bitches", "score": 3, "replies": []}, {"body": "Based on our boy u/smallchimpu morning TA SPY is still trading in a 320 - 328 channel. Todays momentum feels like its going to break 328 and settle into a new channel 324 - 332 maybe. I’ve been feeling wary of the market but FAAG changed my mind today. Up we go.", "score": 3, "replies": []}, {"body": "Everyone smoked earnings its gonna be at least 1% maybe 2 green", "score": 6, "replies": [{"body": "fuck should i try and paper hand it and close it out early because if i have another 2% it’ll go past both of my legs", "score": 0, "replies": [{"body": "Personally i think you are fucked, if your stuff expires soon\n\nIf not then you should be fine", "score": 3, "replies": [{"body": "ayy i love wiping out a months worth of gains", "score": 3, "replies": []}]}]}]}, {"body": "It’s going to go up prob to 327$ then start to drip back down unless it’ll hit 328 then crash again", "score": 2, "replies": [{"body": "literally $329 is my leg that i sold a call god damn this is gonna be a close one", "score": 1, "replies": []}]}, {"body": "i have the same at 327 326 if it doesnt go up too mich/gap up imma wait till 1200", "score": 2, "replies": []}, {"body": "Market will be red. But if your talking SPY it’s 20%+ weighted toward the FAAG that just reported. They all effing moon.", "score": 2, "replies": []}, {"body": "330 EOD", "score": 2, "replies": []}, {"body": "should i diamond hand this bitch? it’s just a robinhood small account and the most i can lose is $100", "score": 2, "replies": []}, {"body": "Yes, it might", "score": 2, "replies": []}, {"body": "100%. I bought some calls so it’s a lock to drop. Load up on puts, homie.", "score": 2, "replies": []}, {"body": "Ride it out homie. Downfall begins later", "score": 2, "replies": [{"body": "you’re right dawg", "score": 1, "replies": [{"body": "Stimulus bill won’t pass so you’ll be good", "score": 2, "replies": []}]}]}, {"body": "I actually bought puts and vix calls this morning. I made profit believe it or not by selling right at the bottom. This never happens to me and i had a small position. But if the market was going to go down i would have thought it was going to be today after the fed. Now i think with that close its just going to keep going more. Watch the US dollar charts. If the dollar collapses or has a major swing on the upside we could have downward volatility in markets. If it continues to make small incremental moves up along a trendline the markets stabilize and SPY continues up.", "score": 2, "replies": [{"body": "thank you for the insight homie", "score": 1, "replies": []}]}, {"body": "Big tech is saving this market again", "score": 2, "replies": []}, {"body": "Definitely!", "score": 2, "replies": []}, {"body": "No, green day tomorrow. They will announce another stimulus check and to the moon we go.", "score": 3, "replies": []}, {"body": "Definitely!", "score": 2, "replies": []}, {"body": "Market is as bullish as its been in a while after today, stonks going up tomorrow and pullback Monday", "score": 2, "replies": []}, {"body": "Its going to moon tomarrow", "score": 2, "replies": []}, {"body": "I got puts on qcom and amd , everything else can go up though please", "score": 1, "replies": []}, {"body": "This is fucking amazing.", "score": 1, "replies": []}, {"body": "👏🏼’d 🍑s tmr", "score": 1, "replies": []}]}
