{"title": "Is it possible institutions have already bought TSLA and that’s what lead the stock price to the high 1700s?", "selftext": "Think about it. Why would institutions buy high when they know TSLA might be included in the S&P500?", "id": "htl6jt", "created_utc": 1595095891.0, "score": 45, "upvote_ratio": 0.86, "num_comments": 67, "comments": [{"body": "Institutions have 1 month roughly on either side of the S&P 500 inclusion announcement to buy. But they would still wait to at least the confirmation that the conditions have been met that make it likely to be included. I.E. they would still want/have to see that Tesla made a GAAP profit this quarter.", "score": 25, "replies": [{"body": "Companies could buy the stock in anticipation and then sell to that company’s own index fund. Would they have bought all the stock they need? Unlikely but they could hold some to sell to themselves later for a profit for the company.", "score": 10, "replies": []}, {"body": "They may already know these details.  Unusual options trackers find insider traders, it definitely happens a lot.", "score": 3, "replies": []}]}, {"body": "Institutional investors aren't gamblers. They'll wait.", "score": 40, "replies": [{"body": "They can put the shares in several of their hundreds of different funds then merge them into their S&P 500 tracker when ready.", "score": 6, "replies": [{"body": "Not all of them do that and the ones that have different divisions, they need to agree to speculate on the stock. Some may have bought in but it is still risky for them. It’s a short term bet, not a long term strategy", "score": 3, "replies": [{"body": "I know they can - but the sheer volume that will need to be purchased will be like an elephant jumping into a swimming pool. \n\nWe'll notice it taking place. Some may be drawing up shares like you say - but there will certainly be an event", "score": 6, "replies": []}]}]}]}, {"body": "Look at all of us with various S&P ETFs and mutual funds sitting in our investment accounts and 401Ks. The minute it gets listed those vehicles will have to buy shares immediately increasing demand. Will it be a long term higher price because of it? No, probably not. But there might be a short pop. Makes no difference from me. I’m in for the long haul.", "score": 8, "replies": [{"body": "Hear hear", "score": 3, "replies": []}]}, {"body": "There was a surge in Robinhood buying that day. Then smart people took profits bringing it down to the generally accepted $1500 pre-earnings price. Won't really move again until Wednesday night barring leaks or news. After that ... 🚀 🚀🚀...", "score": 22, "replies": [{"body": "What do you think the chances are they post a profit?", "score": 2, "replies": [{"body": "I don't see any other possible outcome, the way Elon has been flaunting the short shorts, congratulatory email to team after another email saying they were close to break even and needed a big push for a \"good outcome.\" Almost everyone correlates 90K+ deliveries with profitability, especially with increased margins on early Y and China in general. They have also been selling FSD on used cars and offered a buy-up as a promotion in June. The only X factor would be a potential drop in credits from Fiat, but that would have been known before Elon's hints. Personally I think it will be significantly greater than just a $1 profit and will blow away expectations. But take that with a shaker of salt.", "score": 10, "replies": [{"body": "By $1 profit, do you mean $1 EPS or $1 profit for the whole quarter?", "score": 2, "replies": [{"body": "$1 profit for the quarter, just referring to the minimum they need for S&P inclusion and the \"break-even\" that Elon wrote in the company-wide email. Analyst expectations are averaging around -$0.65 to -$0.70 EPS.", "score": 2, "replies": []}]}, {"body": "I completely agree... I should prob buy some more shares.", "score": 2, "replies": []}, {"body": "What do you expect the price to rise to if they do blow away expectations?", "score": 1, "replies": [{"body": "It will be hard to decouple the market reaction to beating expectations and the mass infusion of buy side demand from the funds that will consequently need to add TSLA to their portfolios. It's hard for me to imagine anything less than $2000 over the course of the weeks it will take to formally include in S&P. And then you've got the short squeeze that will continue and possible margin calls. Perhaps a small pullback after the madness when early investors take some profits.", "score": 4, "replies": []}]}]}]}]}, {"body": "On the total conspiracy tip, could s&p deny Tesla inclusion this quarter so that stock drops, letting institutions buy in, then include them the following quarter?", "score": 5, "replies": [{"body": "On the contrary. There was talk today that even if they *don't* post a profit this quarter, they may get included anyway. With recognition that this quarter was devastating to the economy as a whole, coupled with the significance of Tesla in the sector.", "score": 4, "replies": [{"body": "I would say Tesla will sure make a profit. By just reducing their warranty reserve from $1510 to $$1000 per car, Tesla can show $46,92,000 as profit for this quarter . In comparison, Ford saves just ($591 per car) as warranty reserves. Other legacy makers save only around $300 per car as warranty reserves. And Tesla has very large amount as warranty reserve chest. I wonder what they do with that amount once cars crosses its 8 years warranty period.\n\nPS: Tesla never moved warranty reserves to net profit . I am just saying what Tesla can achieve by just moving some amount and still be top on saving warranty reserves.", "score": 1, "replies": []}]}, {"body": "Or just ramp up the index weights over multiple quarters", "score": 3, "replies": []}]}, {"body": "They literally can not all buy in yet. \nIt would be around 26 MIL shares expected to be bought. \n\nThis would be billions of many being gambled with because they expect a profit which is not even sure yet.\n\nI say impossible. Some might have bought partly.", "score": 8, "replies": [{"body": "$TSLA is the biggest by mkt cap to ever be listed, and to boot they haven’t been on a junior S&P exchange where some of the ETF exposure would have started loading up. Some funds buy before but most at least after a positive eps # announced July 22nd, which will be a big surprise vs the street, even with all the upgrades. \n\n$30B-$50B of passive buying not to mention all the index investors where TSLA will meet the criteria of many with 4 straight profitable quarters.  \n\nIt would be really weird to sell flaming shorts on their website, deliver far more cars than estimated (vs previous quarter where they made more cars than they sold).  Add in FSD rev rec, expanding margins of Y (last earnings call Elon said they were cash profitable first qtr of Y production). China is a runaway train for Tesla. \n\nEnjoy this week everyone.", "score": 12, "replies": []}, {"body": "I concur. It’s too big of a risk as speculation.\nRemember these funds track the index.\nOther divisions could have bought in and the transfer could happen but a) they going to take on that much risk and b) not all are set up that way.", "score": 1, "replies": [{"body": "yeah no way somone risks his job,and beeing held acountable.\n\n because he risks the money of People who said \"just copy the index!\"", "score": 1, "replies": []}]}]}, {"body": "Anyone who answers no, should seriously re-evaluate their investments. I studied finance and I work in a finance job. There is a phenomenon called \"priced in\". There's no way anybody can go out and buy a stock just before it gets added into the S&P, wait for everyone to buy it, then sell it a day later for a huge profit. There are hedge funds out there that are doing this 1000x better and more efficiently than any of us retail investors can do. If you don't believe the market is efficient then you shouldn't be investing in the market. Now I know people will reply \"but wall street doesn't understand the stock\" and Yes that might be true to a certain degree, but overall they are actually much smarter than any retail investor. They can be wrong but there's no information out there that someone on this subreddit knows, that the people of wall street don't.", "score": 8, "replies": [{"body": "this guy is absolutely correct", "score": 5, "replies": []}, {"body": "Dude lmao. Would you invest millions already with the risk of them actually not turning a profit? We are talking billions even here. \n\nYour finance degree might be wrong here mate. No offense.\n\nThey can’t start already tracking 0.9 % of their portfolio in Tesla if it’s not even added yet.\n\nBut hey we are all assuming at this point. Nobody on here probably knows shit..", "score": 2, "replies": [{"body": "Yeah I’m not saying vanguard index funds are buying them, but there’s other hedge funds that are buying the stock preemptively (hence part of the run up the last couple weeks/months) who will all sell it to the index funds when they need to buy them.", "score": 7, "replies": [{"body": "That I can agree to. Question is how much is already bought and how much is being held.", "score": 6, "replies": [{"body": "Yeah, based on the efficient market hypothesis, the amount of shares already bought is directly proportional to the probability of Tesla joining the S&P", "score": 3, "replies": [{"body": "No offence but you sound like you’re in first year finance and think you know everything. The whole phenomenon here is that it may be priced in, BUT these index funds can not buy until the point of inclusion. That is what is making this entire situation exacerbated", "score": 3, "replies": [{"body": "He just opened up his Roth in January so you may be right about first-year finance!", "score": 5, "replies": []}]}, {"body": "Agree with you to some extent. Market is efficient most of the time. Tesla is super hot stock with lots of  retail investors. I think the institution buying itself due to S&P500 may not boost the price significantly, it will definitely keep the daily volume in high level. While, a strong beat of earning and anticipation of S&P500 inclusion would boost retail investor sentiment. In short term, The euphoria sentiment may drive the share price to a level beyond efficient market can control!", "score": 1, "replies": [{"body": "Yeah I mean we're in sort of unprecedented territory here with a stock this big, with this much of a run up, joining the S&P, could definitely lead to some higher volatility but I just don't see a chance to buy the stock the day before inclusion, watch it run up 10% and then sell it for a profit the next day.", "score": 1, "replies": [{"body": "Yeah. Totally agree with you on this.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I agree.  Now, is battery day proceed in yet?  I suspect not.", "score": 1, "replies": [{"body": "I mean there are expectations for battery day that are already priced in, unless you somehow think that battery is a secret that no one knows about? Especially after Elon's tweet about going from cell to pack. Just like with an earnings report, if Tesla doesn't meet expectations and doesn't present any meaningful information then the stock will go down. For the stock to go up they will have to present something that is **unexpected**, such as a working VTOL jet, or cell prices way below the current prices (>80/KwH)", "score": 0, "replies": [{"body": "I just think that Mr Market is focused on Q2 and S&P inclusion right now, and therefore hasn't sufficiently considered the impact of what Elon says may be one of the most important days in the company's history.", "score": 1, "replies": [{"body": "Yeah I disagree, but who knows.", "score": 1, "replies": []}]}]}]}, {"body": "So you are saying there is no upside from sp500 inclusion if tesla posts a profit?", "score": 1, "replies": [{"body": "Not exactly. I'm saying the runup that has already happened is directly proportional to the chance that Tesla gets included. I'm not an analyst so I'm just spitballing here, but let's say there's a 90% chance that Tesla gets included, in which case, we've seen 90% of the runup already. (think about the runup that happened in the last 3 weeks). If Tesla gets included they climb another 10% (barring other news from earnings), and if they don't then the stock loses most of that runup it had in the last few weeks.", "score": 1, "replies": []}]}, {"body": "Wow! You may be the definition of pin head. Then it is impossible to believe that many people have outperformed the s&p index by 1000X on this sub alone. The EMH is a construct to simplify the market for people who cant comprehend ergodicity.", "score": 1, "replies": [{"body": "My Roth is up 250% since I opened it last january", "score": -1, "replies": [{"body": "So you profess that the market is rigged against retail but you still are trying to trade for beta? Interesting.", "score": 2, "replies": [{"body": "There's definitely opportunities out there. I wouldn't say its \"rigged\" just that large hedge funds are dumping a lot more money to analyze the effect of a stock joining the S&P500 and then trading on that information, at a scale millions of times higher than you or I could. It's not to say the stock can't go up, I just don't think you can buy in right before S&P inclusion, and then sell the next day for a profit.", "score": 2, "replies": [{"body": "I don’t think it is 100% guaranteed but it seems likely that the stock can run up further. I personally would not make any major bets on it. If you are familiar with the Incerto by Taleb, Fat Tony got rich because everyone knew that US would declare war on Iraq and historically oil prices go up with war but the war was planned and the run up in oil price collapsed. It is possible we see a similar dynamic here. Although I personally think it is too high of percent of float for funds to acquire and this dynamic has been known for some time with many companies and still leads to major rallies. I also think there is additional substance being realized by market regarding Tesla’s growth trajectory.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think monday is a good example of this. Retail fomo'd us to around $1500 and it almost felt like 1 giant order pushed us to $1794...then I believe the price seemed too good to be true and we sold off quickly.", "score": 1, "replies": []}, {"body": "OP has a point, and also TSLA has competition /s", "score": 1, "replies": []}, {"body": "Tesla daily on youtube has talked about this in a recent episode. they say index funds are already buying, but will concentrate their buying power around the SP 500 announcement. Think about a bell curve.", "score": 1, "replies": []}, {"body": "I have a feeling blackrock and the other investment firm had something to do with it.... I wrote a post about it a few days ago covering some points, sanity check me;\n\n+20% intraday movement on the 13th with one of the big firms releasing a guidance for ~2150 later that day, Musk responds on twitter.  Pretty much every fin news outlet is on fire talking about the ATH & wild moves trying to figure out who is reaching for the short ejector seat button.  Margin requirements also tightened but maybe a coincidence.\n\nCNBC has part of Blackrocks hedge fund division on the show, very sheepish & coy about things and look guilty as sin when asked why he sold the stock @1000 when he personally likes the company, owns the stock and drives a Tesla. \n\nCramer & David later on cnbc talk about a “serious issue”.  They also discuss ESG & not discussing it enough. \n\nThe next day, $2t fund to be setup from Biden & $750m from NYC announced.   Later in Thursday, blackrocks CEO make an appearance on CNBC.  He starts talking up their amazing ESG EFT & the great opportunities it has.  It was a pretty horrible interview in honesty. \n\nWhat I think happened?\nI think blackrock brought Tesla bonds and placed them and more in to the ETF, selling them off on loan to their hedge fund.  They were having a great time during covid shorting it until it ramped up to $1000 when they sold them back (had them ripped out of their hands?).  Now, what do I think happened? Well, somehow blackrock now have a sizeable hope in their ESG balance sheet from fobbing the bonds off expecting the earnings to come much much later.  Blackrock now need to figure out which leg to chop off to chuck on to the fire now. And if it were me? I would recalc a quicker demise of oil & gas to write that off the books. \n\nThere are now at my count 45m missing shares required for short + inclusion & blackrock probably thought it was smart to rent out what they thought was going to be a short term liability\n\nhttps://www.youtube.com/watch?v=6NJIX-sJjaw\n\nhttps://www.reddit.com/r/teslainvestorsclub/comments/hsrqqh/tsla_to_crash_the_stock_market_a_short_play_macro/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 1, "replies": []}, {"body": "Last Monday 30m shares bought and sold for a 240$ rise and fall so we can estimate 15m shares bought at once is equivalent to a 200$ sp rise.\nIndex fund needs to buy between 25-40 million Tesla shares. We can estimate another 3-5 million shares covering by short sellers,\nSo we get 373$ (28m bought) to 600$ (45m bought) rise in sp.\nThere will be also profit taking from funds and retail investors that we don't know but can go to 100$ minus in sp.", "score": 1, "replies": []}, {"body": "Come on guys, Netflix was supposed to have great earnings this Q2 right? But got lower instead... why in the world Tesla should get better Q this time?", "score": -6, "replies": [{"body": "If you’d like to hypothesize about how Tesla will do in Q2 performance by how Netflix did in Q2 performance idk what to tell you lol", "score": 22, "replies": [{"body": "It’s taking ‘TSLA is not a car company, it’s a tech company’ to a whole new level.", "score": 3, "replies": []}, {"body": "It was an analogy. Nothing assures anything at the end.", "score": 1, "replies": []}]}, {"body": "NFLX had super high expectations and missed. Also lowered guidance", "score": 3, "replies": [{"body": "NFLX went down based on Q3 guidance, not on Q2 performance.", "score": 4, "replies": []}, {"body": "Exactly, i meant this. Just because a stock go this incredible rally only with assumptions, doesn't assure anything about earning report seasons. The market is a business itself, don't forget. Last Q happened the same, stock rallied up in PM and then fell sharply. I was just making an analogy? about Netflix.\nAlthough i would bet in Netflix guidance than Tesla's for the rest of the year.", "score": 1, "replies": [{"body": "Do you really think Elon will go to a level of trolling by selling short shorts with out turning profit. Just give it a thought.", "score": 1, "replies": [{"body": "Nah, maybe the stock is too high imo...", "score": 1, "replies": [{"body": "I respect your opinion on stock price but I don’t think there is any one out there exactly can predict the correct valuation of this company.\nSome people say it’s just auto company for them stock price is too high.\nSome people say it’s a tech auto company for them stock price is still undervalued.\nI personally believe it’s a tech auto company, Many auto industry people thought developing a software for a car is not a big task. Now every legacy company failing to atleast achieve what Tesla actually did.\nMy friend works for L&T India, they are handling testing part of Mercedes Benz infotainment system . Benz is trying to develop a new infotainment system for past 3-4 years for their cars, it is still under progress only. He jokes about how Benz tries to test the car on road( in Benz test center) and it never moves the way they expected.", "score": 1, "replies": [{"body": "Idk how many people use auto pilot in reality... but i read somewhere that we are years away still to get a street infrastucture for level 5 full self auto driving. In February, Audi was the first car to get level 3 autonomy, Tesla is still in level 2. So be careful with your investment...", "score": 1, "replies": [{"body": "Most of the people who has Tesla uses auto pilot and Tesla has large number of data sets to feed A.I . Audi gave up plan to add their level 3 autonomy in their A8 model because its is very expensive to add. It’s just like fancy concept car these companies produce which costs million but never see any thing in actual production. Claiming we reached 3 rd level autonomy is a joke without actually releasing in their production cars. It shows Audi is not so confident about their technology . Read below article.\n\nhttps://electrek.co/2020/05/04/audi-gives-up-plan-for-hands-off-autonomy-for-next-a8/", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "because they sold more then the quarter before?  and even that one was profitable?", "score": 1, "replies": []}, {"body": "You have a lot to learn. The two aren’t correlated in the slightest, even if you want to think they’re may be a trend in stock quarterly reports, one stock can do bad but exceeds expectations, the other can do well but miss expectations.", "score": 1, "replies": []}, {"body": "Netflix didn’t perform worst. They gave very less guidance of adding new subscribers around 2.5 million vs expected 5million . That tanked the stock. According to many reports actually  China   Economy is recovering very quickly than expected. Tesla sold 92,000 cars and they sold around 15000 made in China cars which margins are higher than average Tesla sold outside china. So they will show profit for sure and I believe Elon won’t revise his 500000 sales this year. If he didn’t revise it, It clearly shows every one demand is not dead.", "score": 1, "replies": []}]}]}
{"title": "CHGG DD", "selftext": "**\\*NOTE\\***\n\nThe goal of this DD was to provide a cohesive and whole picture of Chegg as a company, taking into account the booming growth they’ve been experiencing during this past quarter. There’s been a lot of talk of Chegg on this subreddit lately but I want to explain why I think it’s about to be the last, best time to buy in before earnings. If you disagree then I urge you to tell me how I’m being autistic and which crucial elements I’m overlooking.\n\nIn my personal opinion, I believe that Chegg is a solid play in the short term based off both the technicals and the environment in which Chegg exists. As we lead up to Chegg’s earnings on 8/3/2020 and as more people realize Chegg’s continued demand throughout 2020, I believe there will be a substantial run up to play off of (or maybe even multiple as we’ve seen over the past month).\n\n**OVERVIEW:**\n\nChegg is the leading student-first interconnected learning platform, which is on-demand, adaptive, personalized, and backed up by a network of human help. They provide textbooks, 24/7 tutoring, and solutions for a multitude of subjects.\n\nKey notes:\n\n· Leading direct-to-student connected learning platform\n\n· Large addressable market with compelling market trends\n\n· High growth and high margin model\n\n· Competitive moat given brand, reach, data, and propriety content\n\nChegg is focused on an online, on-demand approach to providing education to students. This has become especially useful with COVID which is going to affect students through the rest of 2020. Chegg’s earnings report is supposed to be on 8/3/2020. I plan on playing off of this run up which I don’t believe is fully factored into the pricing of this stock. Let’s dive in!\n\n**RELEVANT NEWS:**\n\nMass Arbitration:\n\n[Source](https://www.reuters.com/article/legal-us-otc-massarb/chegg-tries-a-new-way-to-avert-mass-arbitration-cancel-users-contracts-idUSKBN24333W)\n\nIf you are/were a student like I was during these years, you may remember the huge Chegg data breach that occurred in 2018. The fallout of this data breach is still affecting Chegg. In April 2020, Z Law filed a class action lawsuit for more than 15,000 individuals asserting a claim of $25,000 for each Chegg customer. Reportedly in June, the American Arbitration Association (AAA) instructed Chegg to pay about $7.5M in fees to launch the arbitrations.\n\nRather than pay these fees, Chegg argued that the customers included in the lawsuit had ‘breached their user agreements by asserting frivolous or improper demands for arbitration.’ Now I don’t have a law degree but this just sounds like a Catch 22 that won’t necessarily hold up in court, and it doesn’t look like it will. It should be noted that all of this information is from a principal at Z Law since Chegg has not responded to requests for information on this issue as of yet. It is likely that this situation will come to a head soon with these latest updates being in the past couple of months.\n\n*Schools Closing:*\n\nWe are seeing a number of states, or at least counties, mandate that children not go back to school yet this Fall. I believe that this will be a catalyst for increased demand of Chegg’s services. Between their online classrooms, tutoring, and problem solutions, Chegg is in a perfect spot to take advantage of what’s happening for continued growth throughout 2020.\n\n**FINANCIALS:**\n\nMarket Cap growth vs. Revenue Growth\n\n[Source](https://www.macrotrends.net/stocks/charts/CHGG/chegg/financial-statements)\n\n· Chegg revenue growth for quarter ending 3/31/2020 was $0.132B, a 35.09% increase from 2019\n\n· Market cap during this period went from $4.4B to $4.19B, a -4% decrease from 2019\\*\n\n\\* It should be noted that while it’s a great sign that Chegg’s revenue growth is outpacing it’s market cap growth, since last quarter’s earnings were so good, market cap blew out to $8.69B as of this past week, which results in a **67%** increase from last year’s 7/15/2019 market cap of $5.20B\n\n· Chegg’s annual EPS has been slowly growing by around 30% per year, with the earnings in March 2020 representing a 25% increase since the previous year to $-0.05 EPS.\n\n· [Chegg’s current P/E ratio is 75.26](https://www.zacks.com/stock/chart/CHGG/fundamental/pe-ratio-ttm#:~:text=Chegg%20has%20a%20trailing%2Dtwelve,value%20relative%20to%20its%20earnings.)\n\n**TECHNICALS:**\n\n[Source](http://www.stockta.com/cgi-bin/analysis.pl?symb=CHGG&cobrand=&mode=stock)\n\nChegg currently has a resistance of $79.48 with its nearest two supports at $70.15 and $66.76. With the downward trend of the stock market this past week, we saw the share price kiss the first support Tuesday morning when the price dropped but then it slowing gained back throughout the rest of the week.\n\n*RSI Analysis:*\n\nCurrent RSI Level: 63.34\n\nWe’ve seen the RSI stay around this level ever since Chegg’s earnings report in March, only breaking out to overbought occasionally before coming back down to near neutral levels (as we saw this past week). In fact, the correction that occurred last week offers a perfect, and quite possibly the last, best set up as we head towards earnings a few weeks from now.\n\n\\*Note: Stochastic oscillator is closer to 50 currently but I’m choosing to evaluate Chegg based on RSI since this stock has been booming all year and strongly trending upwards.\n\n*MACD Analysis:*\n\nAs of market close this past week, the MACD is currently just barely below its signal line. This is inherently a bearish signal, but the signal line and MACD have been dancing on either side of each other since last earnings, providing lots of opportunities to play these short run ups. The only reason the MACD is below the signal line is because of the correction that occurred last week, meaning that we’re in a perfect spot to take advantage of the next run up.\n\nThe current signs that I’m seeing that tell me that the train is on its way to tendie town: 1) As of Friday, the stock is trading in an upwards direction above both the [EMA](https://www.profitspi.com/stock/view.aspx?v=stock-chart&uv=100594&p=CHGG) and [SMA](https://www.profitspi.com/stock/view.aspx?v=stock-chart&uv=100593&p=CHGG) lines indicating very solid price strength 2) The [MACD](https://www.profitspi.com/stock/view.aspx?v=stock-chart&uv=100562&p=CHGG) is on the verge of crossing back over its signal line which is a bullish sign to buy and 3) the [RSI](https://www.profitspi.com/stock/view.aspx?v=stock-chart&uv=100563&p=CHGG) doesn’t yet indicate that the stock is overbought (but it is heading in that direction). That being said, current resistance levels are set at $79.48. Over the past month, Chegg has been reaching its resistance, falling back, then shooting up past its resistance again – just look at the past month’s chart for Chegg. Past resistance was $75 so I feel confident that this’ll climb to at least $80 but likely higher once the earnings run up starts getting priced in. Once the MACD gives the signal, I will be looking to buy call options at $5 above its last peak of $75.02. This is purely based on my own risk tolerance, I’m sure that higher options would be profitable too though. I’m choosing $5 above since that’s the pattern I’ve been seeing with resistance lines since the last earnings report, but I won’t be selling until I see a downtrend. This could easily go $5-$10 past resistance in anticipation of earnings.\n\nIt’s also worth noting that the stock has already climbed $3-$4 in the past few days after dropping. That’s a few dollars of growth that we’re missing out on, but that’s the price we pay for confidence. The price strength is finally looking strong enough to buy in which is why I’m sending out this DD.\n\n*EMA:*\n\nThe current 20 day EMA is $69.06 which it fell below earlier this week but quickly rebounded back on top of it and has been growing steadily ever since.\n\n**tldr:**\n\n**Long term investors**: Hard to tell if the pump this year will continue as COVID inevitably dies down. Past this year I highly doubt that Chegg can continue this growth. But honestly what do I know.\n\n**Mid term investors**: Chegg looks to be strong and growing. The school year will offer a surge of revenue in Q3 but at the same time it’s hard to tell if this same level of growth will continue. You should also be on the lookout for negative catalysts such as this arbitration lawsuit.\n\n**Short term investors**: All systems are a go for some **8/21 $80c**. Once we’re locked in, I’m expecting slow and steady gains for the next couple of weeks. If you buy in then I urge you to monitor RSI levels and be on the lookout for a sell off, especially as it approaches $80. If anything, at least set a trailing stop loss. But on the likelihood that this puppy shoots past resistance, we’re looking at a share price of anywhere from $80-$90. Conservatively estimating 50-120% profit depending on how fast it climbs and when it starts to sell off, ideally hold till right before earnings though.", "id": "htnowt", "created_utc": 1595104589.0, "score": 63, "upvote_ratio": 0.9, "num_comments": 60, "comments": [{"body": "This all pretty much seems like \"technicals DD.\"\n\nDo you have any actual information on their operations?\n\nAny new contracts signed? Customer information?", "score": 20, "replies": [{"body": "Agreed.  The Due Diligence is when you go beyond technicals in your research and look at what is actually going on inside the company, potential for commercial success, risk analysis, auditing your DD, etc..  Only moving averages and signal lines?  I'm out.", "score": 14, "replies": [{"body": "Good feedback that I'll take into account for future DD's. The only real positive catalyst is earnings on 8/3/2020 which is supposed to be their best quarter yet. That's the main driving force behind this DD. The technicals are there to show and reinforce that, statistically speaking, this is a very solid time to buy. I get the stigma around following technicals but I'd rather be statistically sound with any plays that I make.", "score": 17, "replies": [{"body": "I appreciate this response, good on ya.  Last earnings expected $.02 and they beat it by 20 cents, not bad if you ask me.  Online learning is a hard industry to predict.  I might buy +8% calls and minus 4% puts on Monday just for fun.  Hell, I might even sell some +30%calls to try to snipe some moon-shooters.  GL!", "score": 9, "replies": [{"body": "I'm coming to terms with the fact that I'll always be overlooking something and criticizing myself with how I used to approach stocks. I'm trading CHGG but investing in my own knowledge, which means subjecting myself to the criticisms of the masses. I like the way you're thinking with those calls. Best of luck to you!", "score": 1, "replies": [{"body": "True that.  Losing $700 every few trades has been a reasonable price for my options education.  If the majority of the time you're right, don't sweat the losses.  Up all time gang represent!", "score": 3, "replies": []}]}]}]}, {"body": "Man this sub can't have nothing good. \n\nNot enough words: poor DD\n\nToo many words: poor DD \n\nWhat is this, r/investing?", "score": -1, "replies": []}]}, {"body": "This really is more of a technical DD. Chegg has been booming this whole past quarter during COVID so I was really just looking for a solid play running up to earnings based off of technical analysis and price strength rather than positive external catalysts.", "score": 2, "replies": [{"body": "Ok. Good luck.\n\nHopefully the trends will work out for you.", "score": 1, "replies": []}]}]}, {"body": "I have 80C for October. I approve this DD because it’s like my position.", "score": 9, "replies": [{"body": "I approve this comment!", "score": 3, "replies": []}]}, {"body": "Nice DD!", "score": 18, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "I personally have a Chegg subscription and have had one since last year. It helps a ton as an online student to help me grasp information that I'm pretty much having to teach myself. \n\nI've had shares since q1 2019 which has netted me 90% return so far. \n\n8/21 $80c as well 🚀🚀", "score": 5, "replies": [{"body": "I think the remainder of the year as COVID dies down will be very telling for Chegg in terms of long term growth. As for the calls, I’ll see you in tendie town 🚀", "score": 1, "replies": []}]}, {"body": "90c 8/24. The high strike price scares me a little but they should be more than profitable by earnings.", "score": 5, "replies": [{"body": "Same here, not worried abt high strike price, it’s gna double on earnings same as the last earnings", "score": 2, "replies": []}]}, {"body": "The website unique visitors literally doubled in 2q yoy. And since they only have one 15$ subscription that most ppl are subscribed to (Chegg Study), pretty easy to estimate net new subscribers and rev\n\nWhat happens when net new subs grow 100% yoy instead of 33% expected?\n\nAnd revenue increases in line with net new subs as seen from past quarters. So u might ask, am I expecting a 100% rev growth over 2q19? Yes, sue me.\n\nIn short, It’s gna beat expectations so hard.\n\n80c? More like 90c which I’m holding. I’m even thinking about rolling up to 95c", "score": 4, "replies": []}, {"body": "I'm 80% invested in Chegg at 68 average. I will hold until next summer.", "score": 3, "replies": [{"body": "Godspeed retard.  I agree with OP, it's a good medium time-frame play.", "score": 3, "replies": []}]}, {"body": "8/21 85c checking in for duty. Lets goo!!", "score": 3, "replies": []}, {"body": "Got $80 and $75 for 8/21", "score": 2, "replies": [{"body": "I bought 90 for 8/21 before the dip :( diamond hands to break even", "score": 1, "replies": [{"body": "This is why timing is everything. We’re in a perfect spot for another run up like that last one.", "score": 1, "replies": []}]}]}, {"body": "So what im hearing is 100c 8/21", "score": 2, "replies": [{"body": "Glad at least one of you can read between the lines.", "score": 1, "replies": []}]}, {"body": "Huge, I’m already in for 75c 8/21 since last week might buy another", "score": 2, "replies": []}, {"body": "Very good. This is not a stock to become rich. May I ask what the volatility of the stock is please compare to competing stocks? Thanks", "score": 2, "replies": []}, {"body": "Recent graduate. Wouldn’t recommend calls. All engineering professors despised, “chegg and other cheating websites.” They would send students to SJA in droves if they even thought you were using chegg. Some profs even posted false answer keys on chegg and course hero and if they saw that your work matched they did everything they could to get you in trouble with the university and kicked out of the major.... I only imagine the problem getting worse and chegg is happy to eat on students who pay them. They will drop eventually. They are already too dangerous to use.", "score": 5, "replies": [{"body": "I’m not sure where you went to school or how long ago that was but Chegg had a much different reputation in my experiences. I went to a top 20 US school and student of all majors would lean on chegg to get them through homework and studying. Given the current environment with COVID, I don’t think teachers will have much of a choice when it comes to how students grasp concepts from home, and students are going to use what’s the most accessible and helpful.", "score": 9, "replies": [{"body": "It was only 2 years ago and it was the highest ranked UC...", "score": -7, "replies": [{"body": "All the UCs are ass anyway", "score": 1, "replies": []}, {"body": "Huh, well to be fair I'm not saying that my way was the way it was nor yours, just saying that there are different experiences and perspectives. And to be fair I wasn't an engineering major so my teachers must've just been more forgiving (also top UC!). I see a lot of Chegg's use with the kids in middle school and high school, especially given the stay at home orders.", "score": 1, "replies": []}]}]}, {"body": "Recent-ish grad as well. this doesn't apply to most majors (non STEM). My Chegg subscription was payed back to me in true 100baggers", "score": 6, "replies": []}, {"body": "I just graduated from Michigan. A couple months ago a list was leaked of every single person who (idiodically) used their @umich.edu email to sign up for chegg. Chegg is used for cheating. You type in the question, and someone gives you the answer. Super sketchy moving forward due to online classes imo", "score": 2, "replies": []}, {"body": "Yeah I graduated from a UC this year in physics and had roommates in engineering. Also had friends at other UCs (tHe ToP RaNkEd OnE) and they all talked about rampant chegg use in all their engineering and non stem classes.", "score": 2, "replies": [{"body": "Didn’t intend to sound arrogant, just wanted to be vague lol. Yes of course that’s where chegg can be helpful, but it is becoming increasingly risky to use is all I said. That could hurt business long term depending on deceptive practices by professors and chefs willingness to rat out students who are demonstrably cheating.", "score": 2, "replies": [{"body": "Sorry I was in a fiery mood last night 😔 I do think that universities will have better and better methods of detecting cheating and that long term cheggs business probably isn’t feasible (or at least feasible to have quarter after quarter growth). I just think I’m the short term we should be bullish on it.", "score": 2, "replies": []}]}]}, {"body": "Exactly why I’m long. Chegg is literally a verb in universities just like zoom. And just like zoom it has a lot of haters. Security issues, academic fraud, whatever. And just like zoom it might just double guidance.\n\nwhen a software is a verb you know it’s gna moon.", "score": 2, "replies": [{"body": "You could very well be right. I just shared my perspective as well.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/dadwhovapes1 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "$CHGG 7/17 80C literally already went tits up.", "score": 1, "replies": [{"body": "Sorry I'm an autist - just updated to what I meant: 8/21 $80c", "score": 3, "replies": []}]}, {"body": "RemindMe! 3 weeks", "score": 1, "replies": [{"body": "RemindMe! 3 weeks", "score": 1, "replies": []}, {"body": "There is a 29 hour delay fetching comments.\n\nI will be messaging you in 21 days on [**2020-08-08 23:33:17 UTC**](http://www.wolframalpha.com/input/?i=2020-08-08%2023:33:17%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/htnowt/chgg_dd/fyickuq/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhtnowt%2Fchgg_dd%2Ffyickuq%2F%5D%0A%0ARemindMe%21%202020-08-08%2023%3A33%3A17%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20htnowt)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Chegg good in the short term when college is out on break. Hard pass unless you want to go long", "score": 1, "replies": [{"body": "I should’ve specified, by short term I mean the next 2.5 weeks leading up till earnings and playing off of the earnings hype. I agree that it’ll correct back towards neutral levels afterwards.", "score": 2, "replies": [{"body": "Going long still seems attractive. Get in a long position and wheel calls for the earnings IV", "score": 3, "replies": [{"body": "It definitely could pay off, I'm just overly cautious these days with the booming stay-at-home stocks, especially given how much it's grown already this year. If you have the money to wheel calls on this then that's probably the best play as we go into the school year.", "score": 1, "replies": [{"body": "if ppl are not cautious this stock would be at 90$ now so thank you for your caution", "score": 1, "replies": []}]}]}]}]}, {"body": "Chugg daddy dick? Dang op. This is for stonks", "score": 1, "replies": []}, {"body": "Would you say TWOU is a direct competitor?", "score": 1, "replies": [{"body": "same market but completely different products", "score": 2, "replies": []}]}, {"body": "How about LRN?", "score": 1, "replies": [{"body": "LRN is a good comparison and their earnings date looks to be 8/4/20. However, LRN has already ran up massively, gaining roughly $20 in the past month. It looks like it's already correcting back down which makes CHGG more desirable for a short term play, but it's a good indicator that CHGG will see more of that same growth.", "score": 2, "replies": []}]}, {"body": "be weary of Chegg right now. next earnings are gonna be rough. summer is hard for them, as many people unsub and don’t pay until fall again. they also have 900M in debt and are over leveraged right now lol", "score": 1, "replies": []}, {"body": "Are you still long CHGG going into Q3 earnings season?", "score": 1, "replies": []}, {"body": "yea only people use chegg are kids looking for problem solutions online.\n\nAug 21 Puts go brrrr", "score": 0, "replies": [{"body": "I agree that both will print depending on when you buy/sell. Once Chegg becomes overbought, and given the fact that it's summer, I can definitely see this stock tanking after earnings. I'm just playing the run up then it's all you.", "score": 1, "replies": []}]}]}
{"title": "Theta Gang Ignored Me / Quick Question", "selftext": "I was wondering if someone could point me in the right direction.\n\nIs there a name or strategy where you run an inverse iron conodor within a regular iron conodor?\n\nI'm expecting a big move on Tsla this week but not sure which way it will move after earnings. Was thinking about a call debit spread at 1510/1520 and a call credit spread around 2000/2010 exp this week. And something similar on put side.\n\nIf it moves 20 points in either direction but less than 500 i profit? Am i missing something?\n\nThx in advance\n\nEdit: Fuck you in advance", "id": "htp957", "created_utc": 1595110275.0, "score": 12, "upvote_ratio": 0.66, "num_comments": 66, "comments": [{"body": "8 options losing money on each of the bid ask spreads. Good luck with that.", "score": 42, "replies": [{"body": "Put a limit on it and wait patiently", "score": 3, "replies": []}]}, {"body": "First get your iron condor. Feed him. When he’s asleep    feed him to another iron condor while upside down. There you go", "score": 48, "replies": [{"body": "NO no no dude.  The first iron condor feeds the second iron condor iron butterflies until she's aroused enough for a long straddle and if they're into it after, then its time for married puts.", "score": 21, "replies": [{"body": "What if they smell bad and iron flies show up?", "score": 5, "replies": []}, {"body": "This is the way", "score": 2, "replies": []}]}]}, {"body": "Reverse cow girl", "score": 39, "replies": [{"body": "This", "score": 1, "replies": []}]}, {"body": "Nobody tell him.", "score": 47, "replies": [{"body": "As tradition.", "score": 9, "replies": []}]}, {"body": "Generally speaking when you're set up has more contracts than a condor the names arent really widely accepted, the closest thing I can think of is \" two iron condors\" or \"nested iron condors\" but there's no unique name.\n\nSecondly you would probably be better off with an iron butterfly. Or short straddle, which cost wise would be more, but less complicated and easier to exit; try to make a limit order on the strategy before open and see of the volatility Flux in the morning gets you filled.", "score": 13, "replies": [{"body": "Thx", "score": -1, "replies": []}]}, {"body": "*Didn’t read, what was the question?*", "score": 23, "replies": [{"body": "He was asking about the thing again.", "score": 16, "replies": [{"body": "Oh true, can’t forget about *the thing*", "score": 8, "replies": [{"body": "I got a guy for that thing", "score": 5, "replies": [{"body": "For thing 1 or thing 2?", "score": 3, "replies": []}]}]}]}]}, {"body": "The position you're looking for is a reverse cowgirl position", "score": 8, "replies": []}, {"body": "Wait wtf you are getting a call debit and call credit what the hell that doesn't make any sense", "score": 6, "replies": [{"body": "Yes, And i would do the same on the put side 1490/1480p debit 1100/1090p credit", "score": -3, "replies": [{"body": "It’s RH lingo...", "score": 1, "replies": []}]}]}, {"body": "You're thinking way too hard...", "score": 19, "replies": [{"body": "Too much autism.. going to burst a vessel in his head", "score": 1, "replies": []}]}, {"body": "Nice edit OP lol\n\nEdit: sure way to make friends", "score": 6, "replies": []}, {"body": "Sounds like you should look up the difference between a straddle and a strangle.", "score": 5, "replies": [{"body": "I cant afford the straddle thats why im doing the inverse condor.  Also this way it cancles theta?", "score": -6, "replies": [{"body": "I’m not sure you should say ‘cancels Theta’ like that...", "score": 10, "replies": [{"body": "Cankles", "score": 1, "replies": []}]}]}]}, {"body": "Try a box spread my guy ;) you won't be disappointed.", "score": 11, "replies": [{"body": "Cannot go tits up.  I literally can’t figure out why no one else does this.", "score": 8, "replies": [{"body": "position or GTFO", "score": -2, "replies": [{"body": "You gotta pay to play", "score": 3, "replies": []}]}]}, {"body": "Or play the box trifecta... same odds!", "score": 4, "replies": []}]}, {"body": "A call debit followed by a call credit at higher strike is basically a \"call condor\", which better known as \"Long condor spread with call\". Works the same as an Iron condor, but uses 4 calls at different strike prices. If you change the 1510/1520 spread into a put credit, you get an Iron Condor. You can google the Pros and Cons of each if you are interested.\n\nFor such a spread, IF Tesla stays within 1520 and 2000, you will profit.\n\n\\---\n\nNow, IF you have a put version (1490/1480) + (1000/1010) on the other side... things become complicated. This is pretty much like having 2 iron condors standing side by side.\n\nCondors are often known to be low risk, low yield (below 50%)... so having 2 of them side by side, one will definitely close with a loss. Meaning, this trade will end up negative. At some price points, you lose more, others, you lose less, but there will be no profit.\n\n\\---\n\nYou are better off just using a giant Iron Condor, covering the full range of 1000-2000. Maybe $1000 collateral for a 95% chance of $30 gain. Numbers are arbitrary, so don't ask me why TSLA option table shows different.", "score": 9, "replies": [{"body": "Thx. I appreciate this", "score": 1, "replies": []}]}, {"body": "If you are trying to literally call a share price, it’s a really dumb move. You will lose.\n\nLike doing an iron condor reverses when you place the condor at like 1200/1250 1300/1350 is such a dumb play", "score": 3, "replies": [{"body": "my thought process was that it will definitely move more than  $15 and probably less than $500. The iron condor is just to reduce cost basis of inverse condor", "score": -6, "replies": [{"body": "That’s not an inverse iron condor. Know the terms", "score": 9, "replies": []}]}]}, {"body": "Fuck you too, buddy.  Love, theta gang", "score": 3, "replies": []}, {"body": "The outer condor you are suggesting will get you very minimal premium, which would be negated by the amount of options you are buying/selling (bid/ask). I would look into a call only iron condor. On the other hand, if you just short an iron condor so close to the money, as you are suggesting, it would cost you around 900$. Meaning your max profit is less than 10%. If Tesla stays there, you just lost 900$.\n\nHere’s what I’m doing. I’m selling a 1620/1630 put credit spread. I’m looking to get filled for around 900$ (will go higher strikes for a 900$ fill). Basically, I believe the retard strength will blow the stock higher even if earnings are moderate. If not, I’ll buy it back for around 950 (in the event Tesla crashes). Thus, my loss is around 5%. If tesla spikes, I get to keep most of the premium, say 700$. That’s a x7 bagger", "score": 3, "replies": [{"body": "Your puts are already itm. If it gaps down arent u fucked.", "score": 3, "replies": [{"body": "No, he is collecting a premium he will keep unless it gaps all the way to 1630. Then he loses between 1630 and 1620. And he is canceled out below 1620. He is hoping to collect the premium and have his put expire worthless.", "score": 1, "replies": []}, {"body": "No. Because my max loss is 1k per spread. But I’m already paying 900 for each. Thus max loss is 100$ per spread when I buy them back", "score": 1, "replies": []}]}]}, {"body": "Not sure which is worse thetagang ignoring me or these replies", "score": 7, "replies": [{"body": "Third option; you not knowing what the fuck you’re talking about and then complaining about people laughing at you. That’s what’s worst.", "score": 26, "replies": [{"body": "Thx my guy. Never said i was a professional. Just looking for someone to point me in the right direction so i can research what this is called if it has a name.", "score": 1, "replies": [{"body": "I never assumed you were a professional, if you had, I would have laughed harder at your post.", "score": 11, "replies": []}]}]}, {"body": "It's like you went into a Wendy's expecting a Big Mac.\n\nWTF is wrong with you.\n\nr/options", "score": 12, "replies": [{"body": "Sir, this IS a Wendy’s.", "score": 6, "replies": []}, {"body": "*Went into a ford dealership looking for a tesla", "score": 3, "replies": []}]}]}, {"body": "But puts and calls at every strike. Can't go wrong", "score": 2, "replies": []}, {"body": "this strategy does NOT work when IV is incredibly high like on TSLA. You will need it to drop/go up 40% in a day to make any significant money", "score": 2, "replies": []}, {"body": "Stop wasting your time and buy some FDs", "score": 2, "replies": [{"body": "Probably this", "score": 3, "replies": []}]}, {"body": "Iron is too expensive to make condors out of now. I’ve been using spaghetti and wood glue.", "score": 4, "replies": []}, {"body": "broo where did you learn about buying an iron condor and then reversing it that shit is next level!!!!!\n\nMoney gonna go brrrrrr either way you win and profit.\n\nor you could just straddle like what your gfs boyfriend and his husband do when youre off at work\n\nfor taking this verbal assault here is your tendy: buy a put and a call same strike price kid...", "score": 1, "replies": []}, {"body": "You should take a giant green dildo and have a party", "score": 1, "replies": []}, {"body": "Red Panda Bear.", "score": 1, "replies": []}, {"body": "the strategy is called churning", "score": 1, "replies": []}, {"body": "First you stick that Iron Condor right up your ass. \n\nSecond:  take a picture on your old Obsolete Iphone and post here!", "score": 1, "replies": []}, {"body": "if you expect Vola go up buy a strangle, if you expect vola goes down sell a strangle. but just having that said IV on Tesla is insane! if you don't know what this means do nothing ;-)", "score": 1, "replies": []}, {"body": "Literally buy an ATM put and an ATM call.  That’s your play, if you’re right.  Don’t outsmart yourself.", "score": 1, "replies": []}, {"body": "yea it's called a strangle...", "score": 0, "replies": []}]}
