{"title": "Going all in on AMD calls", "selftext": "I'm new on here, but I did a solid 5 minutes of DD and decided I'm going to go all in on AMD calls because I personally think it's gonna hit $20+.", "id": "5l5t8k", "created_utc": 1483131927.0, "score": 28, "upvote_ratio": 0.8, "num_comments": 36, "comments": [{"body": "Hop on the train we have a few more seats available", "score": 55, "replies": [{"body": "Don't mind the blood stains on the seat either. Nothing bad happened to the guy who sat there before.  ", "score": 1, "replies": []}]}, {"body": "> solid 5 minutes of DD\n\nThat's enough DD for me. All in with you OP.", "score": 37, "replies": [{"body": "4 min more than most. let's get some gainz", "score": 8, "replies": []}]}, {"body": "Holding a bunch of Jan 13th $10 calls right now, I break even at $11.63, I'm probably fucked but we'll see.", "score": 8, "replies": [{"body": "That's a safe bet pussy, not a true YOLO.", "score": 7, "replies": [{"body": "My bet is that it lands at $12, higher strikes didn't make sense considering the premium. ", "score": 3, "replies": [{"body": "Why didn't you just sell 12 puts then? Still like 5x leverage and about 20x open interest of the 10 calls (plus like 50c improved break even). Yeah, you're short gamma, but 9 puts are pretty cheap (I got filled at a penny for 6 Jan at 9.5 strike). Not that buying calls is \"wrong\" or anything, but if I expected the stock to run to 12, I would have sold the 12 puts.", "score": 3, "replies": [{"body": "Because I don't know what the hell I'm doing. I should have went that route but I guess I'm holding the calls for now.", "score": 1, "replies": []}]}]}]}]}, {"body": "You're thinking too small. I've got a stop-limit at $40. ", "score": 13, "replies": [{"body": "*$40*?! I've got some skin in this too but is your hat on too tight? If it goes above $25 within a year I'll be shocked. If it hits 40 I'll eat a worm.", "score": 8, "replies": [{"body": "how about a turd sandwich?", "score": 2, "replies": [{"body": "I will put my penis in a mouse trap if it hits 30.", "score": 11, "replies": [{"body": "Going long, RemindMe! 10 years", "score": 5, "replies": [{"body": "Too late to put in a time frame now. I'm a man of my word.", "score": 3, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Kill yourself, I this my town, fucktardbot. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}]}]}]}]}]}]}, {"body": "AMEN brother, i'm around 40-60k % profit at the moment... hopping for 20 before earnings i expire in january.", "score": 3, "replies": []}, {"body": "I made a blog post on AMD. I put out some catalysts - What do you think about the timeframe to buy calls/puts?\n\nLink: https://aleatoriusresearch.wordpress.com/2016/12/31/an-honest-look-at-amd/", "score": 5, "replies": [{"body": "Nice article. I read a couple sentences and am convinced. ", "score": 5, "replies": [{"body": "Thank you!", "score": 2, "replies": []}]}]}, {"body": "Good for you. Have fun.", "score": 2, "replies": []}, {"body": "There's plenty of room on our rocket ship.  Check out the $20 Jan 2018 calls.  I'm holding 35 and buying more if the price goes lower.", "score": 2, "replies": []}, {"body": "Is inverse wsb no longer a thing? I mean the Canadian is back. That's an omen bruh", "score": 1, "replies": []}, {"body": "Been here since $4 my friend welcome.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Have to wait til Tuesday to buy because I didn't want to pull out of some other positions but I'm going with February 12 or 13 calls. ", "score": 2, "replies": []}]}, {"body": "hmm might go long in popcorn and get puts in AMD Feb if these OPK calls bear some fruit next month, this will be interesting :)", "score": 1, "replies": []}, {"body": "I wanted to get into this stuff but it seems like a huge commitment. I was looking around for places to buy options and probably so other shit I have zero idea about. Can seem to find anything I'm comfortable with. But this stuff seems fun. The sidebar confuses me too. I've never felt so dumb than when I decided to be interested in stuff like this. ", "score": 0, "replies": [{"body": "Most of the people on this sub already know what they're doing, and a lot of us do it for a day job. I would recommend r/investing and investopedia to learn more. Pretty much don't listen to anything these idiots tell you. Just a lot of retards with some disposable income to make crazy option contracts.", "score": 3, "replies": [{"body": "I fall into the last category entirely.", "score": 3, "replies": []}]}, {"body": "Sign up at dough.com amd take their free options course", "score": 1, "replies": []}]}, {"body": "this thread is full of cancer... broke ass cancer", "score": -2, "replies": [{"body": "Found the short seller", "score": 2, "replies": [{"body": "I'm actually holding AMD. I just don't think its going to go to $20 any time soon.", "score": 1, "replies": []}]}, {"body": "Your humanity is cost-effective. So is your suffering.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
