{"title": "$TSLA +$56,000 BECAUSE ELON WILLED IT", "selftext": "", "id": "dqwefp", "created_utc": 1572759380.0, "score": 659, "upvote_ratio": 0.97, "num_comments": 110, "comments": [{"body": "[deleted]", "score": 333, "replies": [{"body": "Almost. Maybe a 3. Def not an X.", "score": 97, "replies": [{"body": "[deleted]", "score": 82, "replies": [{"body": "Motherfuckers forgetting about taxes.", "score": 20, "replies": [{"body": "That's true. Whatever he earned will get taxed at his income tax rate. And it'll bump him up a rate most likely. Oof. Judging by this sub, that $56k will probably get taxed around 26%.\n\nSo he can buy a barebones model 3.", "score": 10, "replies": [{"body": "Lucky for me my losses can be counted as tax exemptions", "score": 28, "replies": []}]}, {"body": "tfw not American so I can trade but don't pay uncle sam a dime.\n\nFeels good to not finance carpet bombing yemen.", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Literally Venezuela", "score": 3, "replies": [{"body": "Feels good not to finance carpet bombing Venezuela", "score": 3, "replies": []}]}]}]}]}, {"body": "Good luck driving without autopilot.", "score": 34, "replies": [{"body": "[deleted]", "score": 46, "replies": [{"body": "You may be right. I can feel the humor draining out of my comment. I think it’s time for bed.", "score": 43, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Luckily, my Tesla, which I sleep in because I could I barely afford it, has heated seats...", "score": 27, "replies": [{"body": "Think how much you save not paying rent though. Maybe I should get a Tesla? 🤔", "score": 19, "replies": [{"body": "They got really nice mattresses you can roll out inside the trunk and over the back seats when folded down. That with climate control makes for a really nice car camping experience.", "score": 5, "replies": [{"body": "Have the tri fold mattress for my Model S, works a treat.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "It has enhanced autopilot automatically if it's the LR or the premium interior, which is under $56k with both. Almost exactly $56k I think.\n\nThe full self driving suite is what now costs $6k", "score": 3, "replies": [{"body": "Bought mine when it was $5k for the upgrade. It’s actually $7k now.", "score": 2, "replies": []}, {"body": "Minor thing but “enhanced autopilot” is no longer a thing.\n\nAll Tesla’s (except the off menu SR-) now include basic autopilot. This will keep you in your lane and control your speed. That's all it will do. If you want any of the cool features like auto lane change, Summon, Navigate on Autopilot then you have to buy FSD.", "score": 1, "replies": []}]}, {"body": "You’re right. Basic Autopilot is available for free. Navigate on Autopilot which will do lane changes and take you through offramps/interchanges requires the $6k upgrade. Well worth it, imo. Plus added bonus when they release the full self driving so I don’t have to do fuck all during my daily commute.", "score": 3, "replies": []}]}]}]}, {"body": "Models S, 3, and X are currently not shipping due to no nut november", "score": 14, "replies": [{"body": "Guh", "score": 9, "replies": [{"body": "That's the noise heard 'round the world on December 1st\n\nExcept it's more like GUH-UH-uh-uh", "score": 6, "replies": []}]}]}, {"body": "In norway there isnt taxes for electrical vehicles (they rape you on gas cars tho. Example; porsche 911 turbo s costs about 450k $ here). So you can get the base model of the model x for about 60k", "score": 4, "replies": [{"body": "They’re talking about the capital gains tax on the way out before he even sees the money. Any sales tax savings you guys get on EVs are way outweighed by your insane taxes elsewhere.", "score": 5, "replies": [{"body": "Not gonna argue there buddy", "score": 2, "replies": []}]}]}, {"body": "You can buy a nice 3 for $56k. Everything nice except the best wheels or the full AI.", "score": 2, "replies": [{"body": "For that you’ll still get the computer that’ll be used by the AI updates expected soon (hopefully).", "score": 3, "replies": [{"body": "Yep it's capable of running the AI and you can just buy it later, no installation needed.", "score": 2, "replies": []}]}]}]}, {"body": "Can upgrade to an iPhone with the money now as well.", "score": 4, "replies": []}, {"body": "Was one of my yearly goal until I saw videos of haters scratching the cars", "score": 1, "replies": [{"body": "The reason you see those for Teslas and not BMWs is because they are monitored like banks. Also every video I've came across on r/teslamotors ended up in the keyer turning him/herself in or getting caught", "score": 11, "replies": []}, {"body": "Haters scratch car doors of other cars just as much. We just don’t see video of it because none of them come with 360deg built in cameras that record that shit for you.", "score": 5, "replies": []}, {"body": "$5k paint repair job, 2 month wait if you get anything else but standard color, lel", "score": 2, "replies": [{"body": "Probably depends on where you live, but my friend had his door replaced and painted in two weeks here in LA.", "score": 2, "replies": []}]}]}]}, {"body": "Screenshot 1: +$48,780 (+125.82%) 01/20 Calls - **SOLD**\n\nScreenshot 2: +$6,635 (+87.25%) 01/21 Calls - **Still HOLDING for $420**\n\nScreenshot 3: +$989.50 (+49.97%) **Just some Tesla stock I'm gonna hold forever**\n\nSo like a lot of you guys, I was always back and forth on Tesla.\nSeemed like a great product and Musk seemed like a revolutionary, but he acted like a dumbass on Twitter and there were just so so so many analysts regularly taking dumps on anything and everything TESLA. \n\nBut one day I walked by a TESLA store in Osaka, and for the first time in my life I actually sat down in one of their cars.\n\nFucking. Amazing.\n\nThe atmosphere in the store wasn't even LIKE a regular car dealership. It was like... a SCIENCE FAIR or something. So many people oohing and awing and asking questions about the technology. The sales people were ultra chill and gave me free coffee.\n\nI've never been a big car guy, never gave a shit about sports cars or nice cars, but when I sat inside that Tesla and pulled up the onboard computer iPad-like thingy, HOLY SHIT. You can monitor almost everything in the car, and adjust everything in the car. It even told me the percentage of air in each tire.\n\nAnd you can plug the car into your wall outlet and CHARGE IT like you CHARGE YOUR CELLPHONE. \n\nIt was then that I knew, I had to YOLO TESLA.This was the company of the FUTURE.\n\nSo way back in March,I bought calls expiring in 01/20 and LEAPS for 1/21.Bought a little bit of $TSLA stock too, for my grandkids.\nNot gonna lie brothers, *it was not an easy road*. My faith was tested often over that long summer. I spent a lot of money averaging down my 01/20 calls, and at one point was down like 75%.\n\nBut in retrospect I should have YOLO'ed even MORE. I should've MAXED OUT MY ROBINHOO GOLD and went truly BALLS DEEP.\nBut I'll take my profit, and thank Papa Musk, and thank God for my blessing.\n\n$420 is on it's way, boys.\n\n**BECAUSE ELON WILLS IT.**", "score": 186, "replies": [{"body": "\n>But in retrospect I should have YOLO'ed even MORE. I should've MAXED OUT MY ROBINHOO GOLD and went truly BALLS DEEP.\n\nYou mean you should have maxed out margin at 25x initial capital? Yeah, you should have, you would be on a yacht by now. GUHlife", "score": 127, "replies": [{"body": "with $TSLA, you can leverage far more than that personal risk tolerance", "score": 29, "replies": [{"body": "Don’t you mean Personal Risk Tolerance?", "score": 11, "replies": [{"body": "purse sonal wrist  todler-rinse", "score": 4, "replies": []}]}]}, {"body": "#GUHlife", "score": 9, "replies": []}, {"body": "He's just saying he wasn't fully leveraged to his Personal Risk Tolerance yet.", "score": 2, "replies": []}]}, {"body": " \n\nSo like a lot of you guys, I was  always back and forth on the number 17. One day I walked by a CASINO in Osaka, and for the first time in my life I actually saw 17 on a signpost.\n\nFucking. Amazing.\n\nThe  atmosphere in the casino wasn't even LIKE a regular casino. It  was like... a CASINO or something. So many people oohing and awing  and asking questions about the casino. The waitress people were ultra  chill and gave me free vodka.\n\nIt was then that I knew, I had to YOLO 17.This was the the number of the FUTURE.\n\nSo  way back in March,I put all my money on 17. In retrospect I should have taken out a massive loan and YOLO'ed even MORE. I should've MAXED OUT MY  CREDIT CARDS and went truly BALLS DEEP. But I'll take my profit, and  thank 17, and thank God for my blessing.\n\n**BECAUSE GOD WILLS IT.**", "score": 48, "replies": [{"body": "LMAO. Good point. Maybe I should go to a casino and invest in casinos next", "score": 19, "replies": [{"body": "Just 17s", "score": 4, "replies": []}]}]}, {"body": "\"I don't know anything about cars, but man I love Teslas\"\nClassic", "score": 12, "replies": [{"body": "The fact people feel that way is one of the biggest selling points of the stock. \n\nTesla has an epic marketing team.", "score": 3, "replies": []}, {"body": "LMAO. You're right. I love this sub", "score": 3, "replies": []}]}, {"body": "A car dealer with free coffee!? Unbelievable!", "score": 29, "replies": [{"body": "Tyre pressure monitoring?! Inconceivable!", "score": 23, "replies": [{"body": "Truly revolutionary!", "score": 3, "replies": []}]}]}, {"body": "That’s crazy. Kinda sounds like an ad tho.", "score": 7, "replies": []}, {"body": "Amazing job", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thank you. Next big play is LEAPS on $AMZN", "score": 1, "replies": []}]}, {"body": ">~~WILLS~~ FIBS \n\nFTFY", "score": 2, "replies": []}, {"body": "Can you eli5 this", "score": 2, "replies": [{"body": "Just hang around this sub enough and soon you'll be raking in the tendies, too. All you need is Robinhood, Robinhood Gold, and some big, big balls.", "score": 3, "replies": [{"body": "Theoretically what if I’m too young for an account is it like pornhub where one can just lie and not worry", "score": 4, "replies": [{"body": "I love your enthusiasm. You will be one of us, soon enough. **Trading online really is kinda like pornhub in a way.**\n\nThey'll know you're under 18 though so for now I recommend you download an app that lets you papertrade (practice trade with fake money) and hang around here until you're old enough.", "score": 2, "replies": [{"body": "I’ll just use my dads info ez", "score": 3, "replies": []}, {"body": "I love you both", "score": 3, "replies": []}]}]}]}]}, {"body": "Just out of curiosity why did you choose $360 as strike price if you're thinking $420? Is it a matter of having a margin of safety?", "score": 2, "replies": [{"body": "Now I might choose $420 leaps but at the time  $420 seemed too aggressive, everyone was shitting on $TSLA, there was one analyst who even famously said it could be a $10 stock, so I exercised some caution and chose $360 for the LEAP calls", "score": 3, "replies": [{"body": "That makes sense, thanks", "score": 2, "replies": []}]}]}, {"body": "Where can I learn to invest like this? I don’t get the terms or what stocks are truly about", "score": 3, "replies": [{"body": "You're in the right place, bro. Just hang around this sub enough and you'll start catching on.", "score": 6, "replies": [{"body": "bro 😎💪", "score": 9, "replies": []}]}, {"body": "This isn’t investing, this is gambling.", "score": 2, "replies": [{"body": "I’d do it. Spend money to make money 😁", "score": 2, "replies": []}, {"body": "This is Wall Street Bets.", "score": 2, "replies": []}]}]}]}, {"body": "Congrats big balls of steel.", "score": 30, "replies": [{"body": "Next big play is LEAPS on $AMZN. Switching from Papa Musk to Papa BEZOS.", "score": 9, "replies": [{"body": "Reason?", "score": 2, "replies": [{"body": "$AMZN is has been flat and stuck in the $1700 -1800 range for some time now. It has to have a breakout sometime this year or next year back to it's 52 week highs or even higher. Just my feeling. I recommend 2021-01 $2500 calls or expiration date even further out", "score": 7, "replies": [{"body": "GL", "score": 3, "replies": []}, {"body": "I second this I agree completely...", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Thank you, may tendies be in your future, as well", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 56, "replies": [{"body": "Of course some people win at roulette when they bet it all on red / black. For every person like OP there's a CTN", "score": 27, "replies": []}, {"body": "You just have to *feel the market*", "score": 5, "replies": [{"body": "It needs to be consentual", "score": 3, "replies": []}]}, {"body": "> \"-/r/videos\n\nFukning lost it", "score": 3, "replies": []}]}, {"body": "Dude, respect with your calls. You actually gave yourself time to wait for that TSLA boom. Unlike the retards who buy SPY c/p who give themselves a few days until expiry, I'd rather buy otm calls with a really long expiry if I'm being a smart retard.", "score": 11, "replies": [{"body": "I almost never buy FDs. Always long-term calls, as long as possible usually. Yeah you don't get like 1000% profit but 200% is enough. You do have to spend a lot of time averaging down, though. I was down 75% on these Tesla calls at one point and it was pretty intense. Lots of staring out at the night sky or at a sunset and really wondering if I was doing the right thing.\n\nElon heard me, though.\n\nHe heard me, and tendies were delivered.", "score": 20, "replies": [{"body": "This is part of the story that most people miss, the courage it takes to not panic when things don't initially go your way. \n\nGranted, I've definitely doubled down on several losses and it dropped even further, so there's that. I have courage and stubbornness, fuckers, not brains.", "score": 9, "replies": []}, {"body": "This is the stupidest shit I've ever read. Typical retail trader psychology buying into a losing trade. You got lucky, congrats, but dont act like you know how to trade because of it. You're exposure is 100% long, you do absolutely nothing to hedge theta, your max drawdown was SEVENTY FIVE PERCENT, and now you're going around spewing your philosophy like you knew all along. Yea right.", "score": 0, "replies": [{"body": "Can you explain how you would have structured this differently?", "score": 3, "replies": []}, {"body": "*\"You're exposure is 100% long, you do absolutely nothing to hedge theta, your max drawdown was SEVENTY FIVE PERCENT... \"*\n\nNot gonna disagree with you. But this is WSB, bro. I think my post fits in **perfectly** here.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Honestly that's way more DD than most people in this sub would do. Maybe I should head to r/investing ??", "score": 2, "replies": []}]}]}]}]}, {"body": "damn nice, i got shaken out", "score": 5, "replies": []}, {"body": "Dear SEC, \n\nI have found your next year's revenue source.\n\nYours truly.", "score": 11, "replies": [{"body": "LOL. Next big play is $AMZN LEAPS. SEC may already have me on a list", "score": 2, "replies": []}]}, {"body": "So how much money did you spend for this return? Sorry I'm new to this", "score": 4, "replies": [{"body": "For his January 2020 calls,  he has 34 contracts. His avg price for each option is $11.42. Each contract has 100 options, so $11.42 x 100 = $1142 per contract.\n\n$1142 x 34 contracts = $38,828 (The money he invested for this specific kind of calls)\n\nYou could've simply just bought 1 contract, leave it and forget about it and just do the same thing.\n\nAnd he's up 100+%. Seeing that TSLA is undervalued at the time, he made a smart bet that TSLA should be up above $295 by next year. I say it was a very good and respectable bet. Though it wasn't guaranteed, his advantage was time. TSLA is very volatile, and if it goes up, it really pays off. Same way if it goes down. But if it goes down, as long as you gave yourself time for TSLA to bounce, then there's nothing to worry about.\n\nWhen I talk about time, there are many options where you can choose different \"expiration dates\". I don't want to get in detail with that, but the shorter the expiry, the more tears you're gonna shed (meaning you're more likely to lose  imo). You're gonna want longer expiry. \n\nStrike prices are also something you have to look up.\n\n\nWords of advice: Get out of here. With all due respect with all my fellow autists here, a lot of them make stupid trades. Sure some of them win those lottery tickets, but how about the rest?\n\nTheoretically, everyone can be a winner in the stock market. So if you lose because of making a stupid bet, then shame on you.\n\n\nIf you're still confused about what I said, then please remember these:\n\nBuy in-the-money calls/puts, with at least 3 weeks expiry if you want to have better chances of winning. Once you get the grasp of things, it's all up to you on the way you trade.\n\nGood luck and don't lose your $$$", "score": 11, "replies": [{"body": "Thanks", "score": 2, "replies": []}, {"body": "wait this brass balled motherfucker put down 39k for this?  Am I reading you right?", "score": 2, "replies": [{"body": "If I did the math right, yes", "score": 1, "replies": []}]}, {"body": "Thanks for explaining this to him bro! It seems like a good and respectable bet in hindsight because it worked, but at the time EVERYONE in this sub and beyond was shitting on Tesla. Even one analyst said (retardedly) that it could go down to $10 a share. Buy low sell high and \"be greedy when others are fearful\" are two of the trading principles I try to follow and it worked this time. My next big play is LEAPS on $AMZN, feel free to join me for tendies", "score": 2, "replies": [{"body": "bro 😎💪", "score": 3, "replies": []}]}, {"body": "Thanks for the clear explanation on this", "score": 1, "replies": []}]}]}, {"body": "*By Elon's claw it shall be done!*", "score": 3, "replies": []}, {"body": "Holy.... well done, man. That's insane!!!", "score": 3, "replies": [{"body": "Thank you, may tendies be in your future as well", "score": 3, "replies": []}]}, {"body": "Did you really listen to retarded analysts talk about Tesla?", "score": 4, "replies": [{"body": "I always try to listen to all sides of an argument. Every time $TSLA drops hard Papa Musk always eventually brings it back to the moon, though. The cycle continues, until it doesn't.", "score": 5, "replies": []}]}, {"body": "Remarkable. The balls to buy expensive premium plus the courage to go with Tesla. Compared to weekly or short term other than FDs, do Leaps have a higher chance of tendies?", "score": 2, "replies": [{"body": "I believe LEAPS and longer-date expiration dated options are a safer way to get tendies because of lower theta decay. Yeah you wont' get like 1000% returns likes FDs but 200% is enough for me. \n\nThe disadvantage of LEAPS is you have to spend a lot of capital averaging down over a long period of time. When I first bought those $TSLA calls back in March they were like $26 so I spent a lot of time averaging down. Being down 75% on something over the course of like 6 months can weigh on a man.", "score": 2, "replies": []}]}, {"body": "Good job kid, get yourself something nice", "score": 2, "replies": [{"body": "Taking my profits and investing in more YOLOs like a true option-addicted autist. My next big play is LEAPS on $AMZN, join me for tendies", "score": 3, "replies": [{"body": "I’m not in the game right now, I’m more of a spectator, but still congrats", "score": 2, "replies": []}]}]}, {"body": "*SEC- “You up?”", "score": 2, "replies": []}, {"body": "now thats inspiring. you deserve a tesla of your own dude. good shit holding through the roller coaster", "score": 1, "replies": [{"body": "Thanks man! Next big play is LEAPS on $AMZN. Let's see if tendies are delivered", "score": 1, "replies": []}]}, {"body": "Now let’s see your years performance .... am sure that is screenshotable too...", "score": -3, "replies": []}]}
{"title": "Full Disney due diligence report inside. What effects will Disney+ have on DIS revenues (with pictures yay)", "selftext": "### Here's another summary of DD (Due Diligence, not double D's) report that was just posted to the site.\n\n&#x200B;\n\nIf you want to check out the full article that contains charts and many more data points. You can view it here.\n\n[Source: Full Disney Due Diligence w/ Charts and Graphs (pictures yay)](https://www.swaggystocks.com/dashboard/stocks/due-diligence/research/2/2019-11-03/DIS)\n\nI'm going to continue releasing DD reports every 2 weeks or so. I've already taken down a list of \"requested\" tickers. Hope you guys enjoy the read.\n\n&#x200B;\n\n### Summary\n\nWe believe that Disney entering the DTC market was the right move for the following reasons. They have invested huge amounts into the tech platform (BAMTech) to enable this kind of service. They have one of the strongest brand names in media and entertainment as well that they are the leading content provider on the planet. Their studio productions will be able to serve two fold as blockbuster hits and then down the road adding to their streaming service. It only makes sense for them to dominate the growing DTC media/entertainment market.\n\nHowever, the DTC market is becoming saturated with strong competitors including: Amazon Prime Video, Roku, Netflix, and now the entrants of Disney+ and the recently announced AppleTV+. We see this competition as a double-edged sword in the sense that there is the potential to grab revenues and market-share with the willingness of big companies to take some of the pie (powerful companies want to enter this market because it makes sense to), but also that more elite entrants into this already cut-throat industry is no easy task. What will separate one company from the rest will be their ability to provide quality content, which Disney has positioned themselves to do.\n\nWe believe that Disney will be sensitive to outside economic pressures that might affect their cash flow. Revenues from the Media Networks segment (and largest portion of revenues) of their business has been on the decline over recent years, but has been off-set by higher revenues from Parks and Resorts and Studio Entertainment. Should any of their other segments come short of providing support, their cash flow will take a hit.\n\nThe introduction of Disney+ will barely make a dent in their net revenues over the next 4-5 years. Potential growth and valuation will be highly dependent on subscriber count, but with Disneys current state of the brand and franchises they have put themselves in a great position to compete with their largest competitor, Netflix. With quality content coming from each of their studios (Marvel, Pixar, StarWars, and National Geographic, to name a few) they will have a strong line-up going into this launch.\n\n### Final Thoughts\n\nDisney is entering a highly competitive market, but we believe they have the right tools to succeed.\n\n**1.** Theyve already successfully tested out the tech to launch DTC services (BAMTech - 4.9B in expenditures by FY 2020).  \n**2.** Their already successful content outlets will provide a great value to their service.  \n**3.** Competition, such as Netflix and AppleTV+, will be spending billions on content without a proven track-record. This is a risk for them and not so much for Disney since Disney already has a great pipeline of many quality IP.  \n**4.** In terms of pricing, we see many similarities between all DTC content providers and the key factor that will separate one company from the other will be in content, which we believe Disney will provide and excel at.  \n**5.** Disneys stock price has already jumped over 30% from the initial announcement of Disney+, but we think this new range will serve as a benchmark and good support.  \n**6.** Disney isnt expected to report blowout subscriber count on the launch of their service, but we foresee they have the possibility to do so.  \n\n\n**Positive Outlook Model:**  \n\\*Current revenue segments continue to grow at 18% Y.O.Y (quality studio releases, leveraging of brands to park themes, etc).  \n\\*Disney reports fantastic initial subscriber count for Disney+.  \n\\*Disney reports ESPN+ growing in-line with expectations.  \n\n\n**Neutral Outlook Model:**  \n\\*Current revenue segments continue to grow at 18% Y.O.Y.  \n\\*Disney reports mediocre numbers for initial subscriber count to Disney+ (as they are expected and will be viewed as a neutral event).  \n\n\n**Negative Outlook Model:**  \n\\*Market is affected by recession, Disney sensitivity to economic pressures.  \n\\*Growth slowing at media networks.  \n\\*Growth slowing at parks and resorts.  \n\\*Very low numbers for initial subscriber count to Disney+.", "id": "dr1hjm", "created_utc": 1572793175.0, "score": 217, "upvote_ratio": 0.98, "num_comments": 106, "comments": [{"body": "Frozen 2 gonna hit $1.5 billion at the box office\n\nLong $DIS", "score": 145, "replies": [{"body": "While I have plenty of DIS calls, DDs like these are missing key factors such as FOX fucking over ER again and depressing this even further.\n\nI mean its why they've been on a downward trend since last ER after all. It drilled 5%+ that day, if WSB didn't remember. It's a large component of their business, whether we like it or not (70 bil acquisition). I mean DIS was already expecting it to be bad (.35 off earnings but it ended up being .60).\n\nI think the bad news is somewhat priced in and they are stuck in this lower channel until funds thinks otherwise - I'm only breaking even right now cuz I've been adding to position every time it drills to $129s and dumping at $132~$133s - but really a debit spread would have been the way to go or any theta position given this thing has been flat/bleeding non stop since last quarter.\n\nMovies etc. doing well are priced in IMO. It's like ATVI releasing a big title in their franchise and it did well (MW pulling 600 million). That's one of their core businesses after all. Its what entertainment publishers do.\n\nThings that will move DIS are things that market hasn't priced in (Verizon channel adding in tons of existing customer base), pre-numbers from subs showing incredible growth, additional unannounced partnership, other streaming services mentioning DIS+ affecting their growth (e.g. NFLX ER lifting DIS the next day).", "score": 23, "replies": [{"body": "This was great, thank you for taking the time to write it.", "score": 6, "replies": []}]}, {"body": "We thought the same about toy story and especially lion king. Look how those worked out ....", "score": 4, "replies": [{"body": "Toy Story did 1.1 Billion and Lion King did 1.6 Billion. DVD release for both dropped last week...seems pretty solid.", "score": 21, "replies": [{"body": "Oh I know. They both did very well. I was talking specifically the stock reactions to the releases. It fell right after both weekends. Rose a little then week after lion king, then fell consistently for 2 months", "score": 10, "replies": [{"body": "Um... That's because Disney missed Q3 estimates due to extra Fox expenses. They reported like a week and a half after the Lion King opened. The stock had a dip after reaching a new high and was on it's way back up until they reported that miss.", "score": 1, "replies": []}]}]}, {"body": "The lion king hit 1.6 and toy story 4 was 1.06B\n\nI’d say they hit expectation", "score": 1, "replies": [{"body": "They did. I was talking specifically about the stock price reactions.", "score": 3, "replies": [{"body": "Right.  Got ya.  But those reactions were mixed with the merger write offs which hurt the bottom line.", "score": 2, "replies": []}]}]}]}, {"body": "Thing about disney is that they go down if they dont hit that number but stays flat if they earn that much", "score": 3, "replies": []}]}, {"body": "Boy have you lost your mind cause I’ll help you find it", "score": 50, "replies": [{"body": "Did I stutter?!", "score": 11, "replies": [{"body": "*\"Did I fucking stutter?!\"", "score": 3, "replies": []}, {"body": "RIP netflix", "score": 4, "replies": []}]}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 53, "replies": [{"body": "I'll take 2 mcdoubles no pickles with a side of cyanide", "score": 7, "replies": []}]}, {"body": "As a parent, I think people are underestimating the value of their kids content.  Every parent will have to sign up.  Their Disney Jr shit is like crack to 11 yr olds.", "score": 15, "replies": [{"body": "This is the exact reason I bought DIS stock a year ago. Every parent is going to need this service.", "score": 6, "replies": [{"body": "Many a grandparent as well.", "score": 2, "replies": []}]}]}, {"body": "Add ATT’s HBO Max and Comcast’s Peacock to the list of competitors.  I’m long DIS but I think shorting NFLX is an equally good trade.", "score": 20, "replies": [{"body": "Netflix is an acquisition target. Their valuation is going to drop dramatically as competition heats up and someone is going to buy them.\n\nI'm thinking Apple will. Apple TV+ is the weakest of the bunch.\n\nShorting Netflix is going to be tricky and buying Netflix before they get acquired is going to be even trickier.", "score": 9, "replies": [{"body": "Theyre too expensive unless their value drops massively...their market cap is enormous.", "score": 5, "replies": [{"body": "It'll drop dramatically over the next couple of years.", "score": 4, "replies": []}]}, {"body": "Totally irrelevant but I just signed up for appletv+ to watch the show \"See\" and that shit is good as hell", "score": 1, "replies": []}]}, {"body": "yeah would buying some netflix puts be dumb right now?", "score": 2, "replies": [{"body": "They're ridiculously expensive. I've got NFLX leaps (puts), because I'm bearish on the company, but I'm not playing this one short-term -- it's still got some major tailwinds. My play is that I'm predicting that those NFLX bull cases disappear as the competition matures (which will not happen overnight and a lot of the disruption is already priced in). One thing that could take the wind out of my sails would be NFLX continuing to post serious international numbers.", "score": 12, "replies": []}, {"body": "I think puts are fine.  Maybe look a bit longer term with them as this all shakes out.\n\nCost of acquiring rights is going to go up massively as you have 5+ legitimize streaming services negotiating.  Think about it, would you lie to be NetFlix negotiating against the deep pockets of Apple, Amazon, Disney, ATT and Comcast?  Some of the recent deals like Big Bang+Two and a Half Men are in the billions. South Park streaming rights were reportedly worth 500 million. \n\nA similar thing is happening with new original content.  NetFlix used to have some value add for content creators but that is eroding as others like Amazon and Apple also offer creators almost limitless control. Comedy specials are a dime a dozen now but NetFlix is paying top dollar for them as it trys to build its backlog. It is not sustainable. \n\nLastly while all of this is going on they are getting squeezed on pricing. Almost every other service is cheaper.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "NetFlix has to either acquire rights or produce their own content to compete, both of which are very expensive. Disney is coming into the market with an enormous backlog of highly valuable content that people want which will cost them very little to monetize. \n\nFor Disney, adding a streaming service means that they are getting massive recurring revenue for their backlog directly from the consumer.  I’m sure they have worked out the the extent to which it might impact Blue-Ray sales and their legacy cable business.  It has to be more profitable to do direct to consumer streaming even if they eat into those other businesses. \n\nLastly, to your point, I see the streaming business as highly complimentary with the Parks business. There is a lot of opportunity to cross advertise/promote now that they are direct to consumer on the media side.", "score": 6, "replies": []}, {"body": "With this, Disney will be in a position to better than make “relatively little” off their media.  It’s the necessary step.\n\nAs far as competing it’s Netflix.  Name me 5 iconic shows from each, and I’m sure they will compare quite well, ask to name 20, or 50 shows from each and you’ll see the depth of catalog that Disney already has far outweighs Netflix.  From a go forward spend point, if they both spend the same, Disney will still have 100 stronger brands throughout.", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Yes. From Kids to grandmas, we all love the Mickey ears.", "score": 2, "replies": []}, {"body": "No", "score": 2, "replies": []}, {"body": "Maybe", "score": 1, "replies": []}, {"body": "yes", "score": 1, "replies": []}]}, {"body": "I mean, I think it'll gap fill, but this is the hot take of the day. Literally everyone with kids will subscribe, possibly annually, and Netflix will become the one month twice a year service", "score": 17, "replies": [{"body": "Which gap lol", "score": 3, "replies": [{"body": "Up at earnings, down at close, up after + gets going and we get some rumors of usage.", "score": 2, "replies": []}, {"body": "$122", "score": 1, "replies": []}]}]}, {"body": "Who is 'we'\\_", "score": 3, "replies": [{"body": "All the autists contributing to SwaggyStonks", "score": 13, "replies": []}, {"body": "WeWork", "score": 1, "replies": []}]}, {"body": "Damn, someone took their adderall this morning", "score": 5, "replies": []}, {"body": "Is this a potential earning play?", "score": 5, "replies": [{"body": "Anything can be an earnings play if you're retarded enough", "score": 20, "replies": [{"body": "Why you callin me out like that8", "score": 5, "replies": []}]}, {"body": "Dunno too long to read", "score": 3, "replies": []}]}, {"body": "u/swaggymedia \n\n&#x200B;\n\nwhat is MC Ratio?", "score": 3, "replies": [{"body": "In the unusual block trades, its the size of the trade block value in relation to the stock/etfs to Market Cap. Normally a really small value so it’s multiplied by 1 million just to scale it.", "score": 4, "replies": [{"body": "Bigger numbers represent a percentage of higher market cap block trades then?", "score": 3, "replies": [{"body": "Yes, exactly. \n\nBUT to save on data costs my script doesn’t pick up small-cap ticker data. A lot of block trades do show these small/mid cap tickers so if you click on the ticker from that page it might not pull up the stock’s chart or key data. I’m working on a script that should be done this week that will pick up the data for any ticker that is searched or clicked.", "score": 3, "replies": []}]}]}]}, {"body": "Market saturation is going to kill all of these streaming services but out of them I think DIS has the best chance", "score": 3, "replies": [{"body": "Two.\n\nDisney (with Hulu and ESPN) will be top dog and Amazon will be in second place because it's included with prime and has a few good shows.", "score": 5, "replies": []}]}, {"body": "Ah, so do the opposite of this analysis because there are too many streaming services out there for customers to choose from, and boomers know and are familiar with the name 'Netflix'.\n\nLong NFLX", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Fuck Netflix.", "score": 3, "replies": []}, {"body": "I redact my statement and wager they keep the Netflix for their mature shows and movies, and sign up for Disney+ for their grandchildren.\n\nLong NFLX and DIS", "score": 2, "replies": []}]}]}, {"body": "Don't expect Disney+ to move the needle.  It might serve to get people excited about the stock.\n\nLook at Disney Revenue growth in the last ER.  30% growth BEFORE Disney+ had any subs.  The value increase is primarily from the Fox deal.  There is debt but that will go away.\n\nA lot of that is lost because of the heavy investment they are doing. Ad spend is going to be way up this quarter so don't expect anything from earnings this quarter either.\n\nWhat we can expect is forward guidance.  Disney expects 30 million by the end of 2024.  This could turn out to be incredibly conservative.  I think we see 30m by 2021.  And I think we see 100m by 2024.\n\nBut even without Disney+, we have a lot to look forward to in DTC.  Hotstar has over 300m monthly active users.  Hulu.  ESPN.  Marvel.  Avatar.  Disney is not just the new Netflix.  Disney is the new Comcast.\n\nThink about how valuable these DTC platforms are for analytics.\n\nLook at revenue.  Disney is going to 200 next year.", "score": 3, "replies": [{"body": "Hotstar is another big component beyond DIS+ that's not mentioned enough.", "score": 3, "replies": []}]}, {"body": "Who the fuck things Disney won't absolutely crush the streaming market?", "score": 3, "replies": []}, {"body": "I know it might take a while to get their streaming service going and to recover from their losses, but I see Frozen II, Star Wars crap, and the library with DIS+, I get long OTM calls.", "score": 3, "replies": []}, {"body": "I came here for the pictures! \n\nWhere are the pictures????", "score": 2, "replies": []}, {"body": "Long $DIS for now, but Iger is jumping ship next year so im calling shorts beyond that. By next year market should also be saturated by Disney+ and its affect on the streaming market share,  meaning we wont see the big number gains like we'll see early next year.", "score": 2, "replies": []}, {"body": "A big advantage for Disney is the classic movies they own.   All that Disney and Fox IP\n\nSame for HBO and ATT\n\nNo licenses need to be paid out to show this content.  \n\nNetflix has to put out license fees to have content.  If that content becomes exclusive to their owners own DTC products then Netflix is going to sink until it can produce on it’s own.   \n\nApple+ is in the same boat.", "score": 2, "replies": [{"body": "Also Disney is the only whose content people are queuing to movie theaters. Disney can any time announce: \"Watch new Marvel title 1 day before premier from Disney+\".That could right away make millions of subs. I would like to watch premiers at home cinema instead going to movies. Also they get all the money straight from customers. I could believe Disney will, in 5 years, publish some kind of headset which gives movie theater experience at home. With that they could strictly charge per person, like in movies. Disney, hire me, I have more cool ideas!!", "score": 2, "replies": []}]}, {"body": "Too long didn't read \n\n🍆", "score": 1, "replies": []}, {"body": "Good dd, negative growth in recession isn't affecting my kids wanting to watch every Disney movie or buy their toys.", "score": 1, "replies": []}, {"body": "this is a lot to read. should i buy puts or calls?", "score": 1, "replies": []}, {"body": "Sir this is a Wendy's.", "score": 1, "replies": []}, {"body": "OK SO PUTS OR CALLS FUCKER !!!", "score": 1, "replies": []}, {"body": "charts don't have any green = no gains. Automatically inversed at my Personal Risk Tolerance. GUH", "score": 1, "replies": []}, {"body": "I think Disney will get huge subscriber numbers. I don't think Disney+ is in direct competition with Netflix and AppleTV+. Hell I don't even think any of the 3 are in direct competition. People make decisions on content differently than say choosing to buy a car. A marginally worse product, say in terms of content, especially when content quality is good overall, basically means that an individual will watch that something better first.\n\nDisney+'s price point(and Apple TV+'s) turns it into a complementary product to that of Netflix.\n\nFor me, the main driver of Disney's success in the DTC market would the quality of its content. It has some good stuff there(Marvel/Star Wars), no doubt, but if its new projects isn't well received, then Disney+ can easily find itself being an afterthought when someone considers what to watch online.", "score": 1, "replies": []}, {"body": "If DIS beats on earnings/revenues & management tone is \"in alignment\" w/ street expectations, then, PWM heavies that have been on the sidelines are going in deep AH Expect some price target revisions/upgrades regardless.", "score": 1, "replies": []}, {"body": "Everything I read is saying we’re buying calls. What’re you autists sayin?", "score": 1, "replies": []}, {"body": "Tl;dr what’s the 2 week, end of year, and 52 week price target", "score": 1, "replies": []}, {"body": "My dd on disney is seeing the parks getting more and more packed while ticket prices go up and up and up.", "score": 1, "replies": []}, {"body": "Yew was²1", "score": 1, "replies": []}, {"body": "Why don't you have an actual evaluation for price per share?", "score": 1, "replies": []}, {"body": "Great DD", "score": 1, "replies": []}, {"body": "Just because someone spends money, especially on a large technical endeavor- doesn’t mean it’s going to go well.\n\nP&R is also super subjected to economic downturns and Marvels pipeline is whack now.\n\nHOLD at best.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "As someone with 2 toddlers their entire life is rewatching the same 12 movies. I will pay all the money in the world to stop rotating DVDs of Snow White, Tangled, Lion King, Peter Pan, Cinderella, Little Mermaid and Sleeping Beauty into my PS3. Go outside and play you little fucks", "score": 6, "replies": []}, {"body": "I agree with you. It’s similar to when Avengers earn an extra 1B off revenues. The margins on that billion bring net income down quite a bit and what’s left relative to their bottom line is negligible. It will take 50 million subscribers on Disney+ to make a 5% increase in overall revenues. 50 million won’t be achieved for years.\n\nHowever, the Disney+ platform has the quality to be top 1 or 2 content providers (might even overtake Netflix eventually). I think that will hold the Disney stock price up in the $130 range and set a good baseline.", "score": 2, "replies": [{"body": "Netflix has waaaay too big of a head start. \n\nIt baffles me how people aren’t even considering HBO. Take a look at their insane list of TV series they have that are all at least a 7/10 if not 9/10 or 10/10. And Netflix is still crushing them.", "score": 2, "replies": [{"body": "I agree. I‘m quite confident being long on Netflix. Happy for the cheap entry due to all the Disney and Apple noise. The streaming market has still insane growth potential and Netflix will remain a key player", "score": 1, "replies": []}, {"body": "Disney needs to put Frozen 2 premier \"exclusive Disney+\" and Netflix head start is gone. I mean not even in movie theaters.", "score": 1, "replies": [{"body": "And people will sign up for one month and cancel like all the Disney fanboys say people do with Netflix", "score": 2, "replies": []}]}]}, {"body": "Disney has so strong brands that its all that matters. Not long, and nobody goes to movie theaters. Instead people will use Disney's VR headsets at home and watches (experiences) Frozen 5 premier, streamed 8K 3D from Disney+ edge servers. Tha is future, Disney+ will be Disney and Netflix will be just a memory from the past.", "score": 2, "replies": []}, {"body": "Streaming in the short term will never move the needle for Disney. I don’t expect real impact until 2024. Streaming services will be the new media conglomerates in the future that’s when the real money will roll in.", "score": 1, "replies": []}]}, {"body": "unless government breaks disney up disney will get bigger", "score": 1, "replies": [{"body": "This is the top comment of the thread.", "score": 1, "replies": []}]}, {"body": "True but do you know today market moves on expectation? If Disney announces they believe their streaming service will beat NFLX for major market share then DIS will rocket and they can totally do that.", "score": 1, "replies": [{"body": "IT ALREADY HAPPENED\n\nFor fuck’s sake, people have amnesia. Disney was up 30% when they announced their pricing. 30%!!  That added like, I dunno, $60 BILLION to their market cap. Netflix has been around for a decade, has like 130M subs or something, and is worth $125B. Disney has 0 subscribers and just started. That 30% pop was waaaay ahead of itself. For some people, morons around here think it’s due for another 20% pop.\n\nPeople will downvote me bc they’re greedy, delusional, and they want to believe that their calls will print. They won’t.", "score": 7, "replies": [{"body": "0 subscribers? Not even close. We've already started signing up, I'm in for 3 years. Every family with young kids will sign up, easily 20-50 million subs almost immediately.", "score": 1, "replies": [{"body": "20-50 MILLION??  LOOOOL!  You do know Netflix has an entire kids section, right?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The competitive advantage is that Netflix, like Disney, owns a massive amount of its own content that can’t be seen anywhere else.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s official, you’re retarded. \n\nHBO has all original content for their shows. Like, a ton. Yet here we are, with like 5 other HBO-like services that have popped up. It’s not a barrier to entry, it’s a competitive advantage.", "score": 1, "replies": []}]}]}]}, {"body": "We'll see by end of year. Netflix kids section isn't Disney. I am a Netflix subscriber as well, not sure why people think they won't co-exist. Netflix doesn't lose a subscriber for each Dis+ subscriber  and vice-versa. You must not have kids if you think this is going to fail, LOL.\n\nYou're out of your mind if you think Dis+ doesn't hit 20 million subs.", "score": 1, "replies": []}, {"body": "Update: Disney announced they launched with 10M subscribers....my 20 - 50 million is right on track.", "score": 1, "replies": [{"body": "FREE TRIALS. Wait til a month from now.", "score": 1, "replies": [{"body": "LMAO, you are out of your mind.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "My worry about dis +\n\nStreaming services need constant content for their addicted add users\n\nYes dis makes quality, but have they shown they can make enough quality to fuel a streaming service ??", "score": 0, "replies": [{"body": "LMAO, is this a real question?", "score": 3, "replies": []}, {"body": "Depends on the target audience, but as someone mentioned, plenty of parents will be subscribing so their kids can watch cartoons. Kids will watch reruns of cartoons over and over until they outgrow said show. That alone holds strong intrinsic value.", "score": 2, "replies": []}, {"body": "Kids don't care about new content, just that the one they like is there. They can watch reruns til the end of fucking time.", "score": 1, "replies": []}]}]}
