{"title": "$TSLA Daily Investor Discussion - November 24, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "e0wa44", "created_utc": 1574586719.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 128, "comments": [{"body": "$TSLAQ went from\n\n> That thing looks hideous. Nobody’s gonna buy it\n\nto\n\n> 200k preorders mean nothing because the order deposit is so small", "score": 25, "replies": [{"body": "I showed it to my sister today and she said: \"omg it must cost a fortune.\" \n\nShe couldn't believe it was only 40k. These will sell like crazy.", "score": 5, "replies": []}, {"body": "I do think $100 is a factor. I am probably unlikely to buy the truck but I wasn't sure and took a flyer on $100, especially because the promise to keep FSD the same price which is actually worth far more than $100 (you might be able to flip the truck). I put a large discount factor on these numbers personally but I would \\*never\\* make the scale against the model 3. If anyone thinks TSLA is valued as if they can repeat the model 3 with the Y and with the pickup, they are nuts.\n\nAnd anyway, I am pretty sure everyone is stupider even listening to tslaq.", "score": 6, "replies": [{"body": "Is the FSD price lock just for the truck?", "score": 1, "replies": [{"body": "No but if you buy it on a S3X you will have to pay for it 2 years sooner, and for a Y, one year sooner.", "score": 1, "replies": []}, {"body": "I was wondering the same. Does this $100 deposit lock in FSD for $7k for S/3/X/Y, if I want to buy any of these cars 2 years later instead of the Cybertruck?", "score": 1, "replies": [{"body": "For the S/X/3, they made the $100 deposit non-refundable and you can't pre-order, so you make the order and they send the car to you.  For Model Y, it's a fully refundable $2500 deposit.", "score": 2, "replies": []}]}]}, {"body": "I think Telsa were committed to building the Pickup anyway, for internal and Space-X use.\n\nThis reservation process is just an attempt to gauge / generate demand.. \n\nIt is definitely going to start as lower capex and lower volume, as a result of the reservation hype they may now initially target 100K-200K per year.. If the demand seems real, they can scale up from there.\n\nSo probably smaller than Model Y for sometime and a much more gradual ramp, this is a slow burner, I'm not 100% sure where it will end up...\n\nThis is 2 things at once as promised by Elon, it is possible because the Pickup is not as capital intense as Model Y.", "score": 1, "replies": []}]}, {"body": "I see \"TSLAQ\" saying well so many will cancel it anyway since its 100 dollars. Here i am sitting actually valuing 100 dollars. If i wasn´t gonna buy the truck i sure as hell wont lock away 100 dollars for the next 2 years to then cancel the order just before it goes into production. So i really dont get that argument. Anything goes in order to try and rationalize being a shortface of Tesla", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "They do get the contact information of 200K potential customers, and even get payed for that. It's marketing gold.", "score": 4, "replies": [{"body": "Agree completely, and I do think this truck will be a wild success and hopefully spawn a line of cyber-products. I just think as investors we should stay grounded with our reactions to these refundable pre-order numbers and not start counting revenue.", "score": 1, "replies": [{"body": "But as of indicator of some organic demand and that it is appealing to people - that's something. If there were no official preorders number by the reactions on the Internet I would be concerned if there will be high demand for it. I guess preorders will be around 300k-350k within one week from reveal, no way that are only die-hard Tesla fans. I didn't put a deposit even though I love it and being Tesla fan / investor.", "score": 2, "replies": []}]}]}, {"body": "i Get that, but its still a loss of oppertunnity if we are talking in terms of microeconomics. Why lock away 100 dollars that is the part i dont get", "score": 1, "replies": [{"body": "Because it interests you and you want the the spot in line should you decide you ultimately want to buy one in the future -- and you have absolutely nothing to lose. If there was a big concert you were undecided on and $100 secured your VIP ticket should you decide to go, but a refund should you decide not to, a ton of people would buy that too. The tiny refundable deposit is people wanting to keep their option open, not remotely a commitment to buy. IMO anyway.", "score": 2, "replies": []}, {"body": "I think it is a smaller commitment and people will make the final decision  in 2 years time, or when they can order.\n\nNo one reserves with zero intention to buy...\n\nBut I think 10-20% of reservations are people that got carried away with the hype and will realise they don't need a truck and this vehicle doesn't suit them...\n\nOf the remaining 80% ... I think 50% of them will like to order .. but some percentage ultimately will not have the money or priorities will change...\n\nSo my guess is 30% of reservations will turn into orders at around 200,000 orders that is 60,000 solid orders. So if Tesla initially targets 100K per year, the risk is minimal. They can ramp that later, as they get a better handle on demand..", "score": 2, "replies": []}]}]}, {"body": "So lets say 50% think this way which i think is unlikely, it is regardless 4.5 billion dollars revenue secured in 39 hours. I defenitely wont call that a fiasco.", "score": 1, "replies": []}, {"body": "For a very conservative $20 cost in interests/opportunity cost you can place a bet that will payoff big time if Tesla achieves FSD by then. I don't think they will, but I'm still considering placing that bet.", "score": 1, "replies": []}]}, {"body": "Next step will be bankrupt in two quarters because they are only surviving by burning through people’s deposits.", "score": 1, "replies": []}]}, {"body": "[This guy cancelled his Rivian order and placed a cybertruck order. I wonder how many Rivian order holders did the same.](https://twitter.com/dealer_of_happy/status/1198426827460632577)", "score": 22, "replies": [{"body": "I'm sure Rivian noticed a substantial amount of cancellations. Base model Rivian is same price as top of the line Cybertruck, but has worse specs than base model Cybertruck.", "score": 10, "replies": []}, {"body": "Yeah, but how many people who were waiting for cybertruck saw it and immediately ordered a Rivian?\n\n... then we need to know how many cancelled that Rivian order Saturday and ordered a cybertruck after all?  :)", "score": 4, "replies": []}, {"body": "Yeah it's nuts, I'm sure they felt relieves Thursday evening, and discouraged Friday morning when they checked their reservation log. You'd have to *really* care about looks (and hate CT) to go for R1T now.", "score": 2, "replies": []}]}, {"body": "I'm so stoked bout this cyber truck, and I was never into cars. Ever.", "score": 20, "replies": [{"body": "Me too. Reserved, but I doubt they will ship to where I live 😣", "score": 3, "replies": []}]}, {"body": "Spread those cheeks shortie", "score": 20, "replies": [{"body": "that's what I'm talking about", "score": 1, "replies": [{"body": "😩 🍆 💦", "score": 1, "replies": []}]}]}, {"body": "200k", "score": 16, "replies": []}, {"body": "Even Belgian mainstream media keeps the Cybertruck articles coming.  The hype around this thing is so incredible.", "score": 13, "replies": [{"body": "I posted this a couple days ago, but check out the google traffic for Cybertruck vs Mustang Mach-E for the past week, during which both had major reveals. You can BARELY spot the Nov 18th bump in Mustang attention relative to Cybertruck. [https://trends.google.com/trends/explore?date=now%207-d&geo=US&q=Mustang%20Mach-E,Cybertruck](https://trends.google.com/trends/explore?date=now%207-d&geo=US&q=Mustang%20Mach-E,Cybertruck)", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Ha, Cybertruck is literally off the chart. I also find it super interesting that on the 7-day, the ATV holds the top 3 related searches for the truck.", "score": 1, "replies": []}]}, {"body": "Interest isn't always a good thing though.  Careful how you wield that metric.  People love to watch trainwrecks too.  A better one would be recent cancellations of Rivian orders.", "score": 2, "replies": []}]}]}, {"body": "187k orders of Cybertruck as of now: [https://twitter.com/elonmusk/status/1198693994194014208](https://twitter.com/elonmusk/status/1198693994194014208)", "score": 13, "replies": [{"body": "Damn", "score": 1, "replies": []}]}, {"body": "Would be funny if that 6% drop on Friday was a Bear-Trap lol", "score": 13, "replies": [{"body": "I mean in a logical world we would get the 6% and more back monday, but since it usually doesn´t make sense, it will probably take a bit of time to get the 6 % back even though the truck was a succes", "score": 8, "replies": [{"body": "Takes me way way longer to prepare to buy TSLA being a Non USA Shareholder, kinda sucks. :(", "score": 1, "replies": [{"body": "With ya bud. Bought a bunch on margin Friday once I got over the shock factor. Waiting for exchange of funds now... Happy to have the ability to purchase on margin for this reason.", "score": 2, "replies": [{"body": "Hmm I've never though of that, how much does borrowing to buy shares cost you for a few days ?", "score": 1, "replies": []}]}]}]}]}, {"body": "I think by the time the truck is out the price of the model 3 will be down 5k. Makes sense considering how much you get with the truck for 40k.\n\nHowever judging by how aggressive Tesla is with their market penetration I wouldn't be surprised if the base model 3 price drops to around 32k.", "score": 11, "replies": [{"body": "Depends on FSD progress IMO.\n\nIf reasonable FSD progress has been made by 2022, A $60k Model 3 would be in very high demand.", "score": 3, "replies": [{"body": "I don't expect FSD improvements to be reflected in the price of the car. More like the base Model 3 costs $30k and FSD costs $10kish", "score": 1, "replies": [{"body": "If they're really nice, they might do that. I guess it really depends on how many people will be willing to use the Tesla network.", "score": 1, "replies": [{"body": "Yea, for $10k i'm just talking about feature complete, non-revenue-generating software", "score": 1, "replies": []}]}]}]}, {"body": "With their order backlog the way it is - dropping the price wouldn’t get the 3 in the hands of any more people, since they’re production constrained.  It would only leave money on the table, which could have been used to accelerate the advance of sustainable transport.", "score": 2, "replies": []}, {"body": "I have to admit, if the SR+ dropped to 32k because their batteries had become absurdly cheap (only way I could imagine), I would cancel my Cybertruck deposit and grab the less expensive vehicle with FSD added.", "score": 1, "replies": [{"body": "Yeah but by then the price of FSD could be way up too (and you locked in 7K with the Cybertruck)", "score": 2, "replies": []}]}]}, {"body": "Andrew Yang tweeted about Cybertruck: [https://twitter.com/AndrewYang/status/1198473331810410502](https://twitter.com/AndrewYang/status/1198473331810410502)\n\nThe truck turns out to be a success, with reservations piling up.", "score": 9, "replies": [{"body": "Yang gang", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "A who?", "score": 4, "replies": []}, {"body": "« as a Kardashian at this point, in the sense that they can dictate to the US what is cool/desired »\n\nUS=\\ World so I fixed it for you. Your famous family are nobodies outside your borders. And we would like you to keep it this way: keep your trash for yourselves :D", "score": 1, "replies": [{"body": "So what you're saying is Tesla is actually more influential, since they truly have global influence.", "score": 4, "replies": []}, {"body": "Amen", "score": 2, "replies": []}, {"body": "No, please take our trash, we don't need them any more!", "score": 1, "replies": []}]}]}]}, {"body": "So will Tesla's entire lineup have performance refreshes by the time Cybertruck comes into production? You would have to be crazy to buy a SR+ model 3 when you can buy a cybertruck for just 2k extra.", "score": 8, "replies": [{"body": "If Cybertruck was out today, I would not buy it over the model 3. Mostly because its fucking huge and the UK's roads will be much easier to navigate with the model 3. That and i'm not really a truck guy.", "score": 7, "replies": [{"body": "Just driver over other cars. Problem solved.", "score": 2, "replies": []}]}, {"body": "Most definitely. Model 3 SR+ is a current product, while Cybertruck will ship in 2 years.", "score": 3, "replies": []}, {"body": "I guess Long Range will be available at around 40 000$ with Autopilot by that time. SR+ 35 000$, needs to be that way to make sense.", "score": 2, "replies": []}, {"body": "No.  People don’t just buy a car for specs / functionality.   Many model 3 owners wouldn’t be caught dead driving the cybertruck around their country club.", "score": 2, "replies": []}]}, {"body": "Ordered tri motor with FSD, 200,001. You're welcome Elon", "score": 10, "replies": []}, {"body": "ordered the tri motor. I'm bummed out that you can reserve FSD at this static price. I honestly wonder how many of these orders are done with that being a big motivator.....why would he allow people to reserve it at 7k? When FSD drops and we can pimp out our cars as taxis, shouldn't FSD be worth like 30k at that point? So why allow people to reserve? Makes no sense.", "score": 8, "replies": [{"body": ">Im sorry guys, I'm still long TSLA but I'm so fucking glad i waited till after this to buy in  \n>  \n>dude that thing is so fucking ugly\n\nI see you've also been through the [7 stages](https://twitter.com/phibetakitten/status/1198115872948146177) of Cybertruck.", "score": 12, "replies": [{"body": "Dude 100% accurate", "score": 7, "replies": []}]}, {"body": "I think it’s part of the marketing strategy.  While the $100 potentially could save early adopters thousands toward FSD, it also ensures these pro Tesla masses stay tuned to any Cybertruck updates between now and its delivery.  Think about all the other people that could be influenced by people who ordered.", "score": 2, "replies": []}, {"body": "Yep, the reservation itself could potentially be worth thousands with no downside since it's refundable.  I have a couple reservations myself for that reason.", "score": 1, "replies": []}]}, {"body": "Met with a friend yesterday who owns a Porsche and has always been very anti Tesla. Decided to muster up the stregth and get his opinion of the truck assuming it was going to be negative. Suprisngly he loved it and said it's the first Tesla he can't wait to see in the store and might actually test drive it. Also said he thought it was the best value for your money for any Tesla. More I think about it he's sort of right. I'm guessing this new folding process is a pretty genius move. Can't wait to hear what margins are.\n\nEven my wife who hated it on day one yesterday said she can see the appeal. Everyone loves to underestimate genius.", "score": 17, "replies": [{"body": "It looks like a backward delorean to me.  It'll be interesting seeing those on the street soon.", "score": 2, "replies": []}]}, {"body": "Gonna bounce at least halfway back tomorrow.", "score": 8, "replies": [{"body": "Honestly it wouldn't surprise me if we gain all of Friday back and then some\n\n\\-It was a huge drop, so some pullback is expected anyways\n\n\\-Friday is usually a Sell Day while People buy back in on Monday\n\n\\-Elon will gleefully twitter Numbers for the remainder of the Week, any weak hand Short who got in on Friday, will cover their position today\n\n\\-Selling was mostly because of the extremly polarising Design, now that we actually have numbers investors will do a 180\n\n&#x200B;\n\nIf we get China Model 3 Sales Permit today this could be the perfect Storm.", "score": 2, "replies": []}, {"body": "You gotta consider why it dropped. If its because no one on wall street believed it would sell, well we have our answer (sort of). \n\nHowever, that would make sense, and this shit never makes sense, so i'm saying we end at $335.", "score": 1, "replies": []}]}, {"body": "CleanTechnica gives their explanation of why windows broke up during the demo: [https://www.youtube.com/watch?v=PnPcMAwcJJ0](https://www.youtube.com/watch?v=PnPcMAwcJJ0)\n\nIn short - sledgehammer punches on the door caused the glass to go down a bit, losing its tight uniform connection on all sides. With the imbalance like that it breaks more easily.", "score": 13, "replies": []}, {"body": "Tesla needs 2 more vehicles in the roster.\n\n1) It need a delivery orientated vehicle that couriers/tradesmen can use. Makes for an amazing buisness case to drive electric. Will do wonders for combatting road pollution. \n\n2) A car that competes with the VW golf. If it can do 200 miles a day that is more than enough. 50Kwh battery will do. Reality is most people don't drive much in a day.  If they can get a £25,000-30,000 brand new price they would wipe the floor with arguably one of the most successful cars of all time.", "score": 5, "replies": [{"body": "Nah.  Model 3, Y, pickup, semi & roadster 2 is plenty sweet until 2023", "score": 7, "replies": []}, {"body": "Yes yes yes to the small car.  It will do very well in countries where space is at a premium: eg the UK and Japan.  My next car will be an EV, it needs to fit on my drive.", "score": 3, "replies": []}, {"body": "They need the city small delivery car (think Peugeot Partner or Ram Pro Master) and then a larger tradesman style van\n\nMake both of them with the 310 Steel exoskeleton to bring the price as low as possible. It's a tradesman product, durability is best.", "score": 2, "replies": [{"body": "I'd love to know how much cheaper and faster producing a car is with the new exoskeleton. This + falling battery prices means in 5 yrs new cars may surprise many.", "score": 1, "replies": []}]}, {"body": "They have said they currently had no plan to make a van since there are actually quite a few electric van models pouring unto the market. The mission is happening without them in that space. I can see them competing eventually, but not something they need to rush.", "score": 2, "replies": [{"body": "[https://cleantechnica.com/2019/02/08/tesla-mercedes-talking-about-electric-van-collaboration/](https://cleantechnica.com/2019/02/08/tesla-mercedes-talking-about-electric-van-collaboration/)", "score": 1, "replies": []}]}, {"body": "Government vehicles might be a good place to invest as well.  This country has a vast and aging fleet of mail trucks, police cruisers, etc etc.  And with belts tightening all the time, not having that fuel bill every month might be VERY attractive for USPS, and even other private carriers.  They might even leave stamp prices alone for a few years....", "score": 2, "replies": []}, {"body": "[https://cleantechnica.com/2019/02/08/tesla-mercedes-talking-about-electric-van-collaboration/](https://cleantechnica.com/2019/02/08/tesla-mercedes-talking-about-electric-van-collaboration/)", "score": 1, "replies": []}]}, {"body": " [https://trends.google.com/trends/explore?date=now%207-d&geo=US&q=tesla%20truck,cybertruck,ford%20mustang](https://trends.google.com/trends/explore?date=now%207-d&geo=US&q=tesla%20truck,cybertruck,ford%20mustang) \n\nGoogle interest remains pretty high imo. If you sort the states by who searches for the two terms more, 'cybertruck' is more the coastal elite states and 'tesla truck' is more the red states.", "score": 5, "replies": []}, {"body": "On IBIS, the stock is already trading at around 343. Full recovery this week :)", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The german exchange. Deutsche Börse Xetra", "score": 1, "replies": []}]}]}, {"body": "187K", "score": 11, "replies": [{"body": "Just put in a reservation a minute ago for tri motor.   Anyway to tell by my reservation number?", "score": 4, "replies": [{"body": "What's the number, in the form 112931xxx?   The theory was you subtract 112744000 from the reservation number.  Given the tweet just now, that looks wrong.", "score": 2, "replies": [{"body": "There's a post in the TIC earlier today noting that the order numbers aren't sequential and may be partly batched / trim-related.", "score": 2, "replies": [{"body": "While possible, as a software person myself the idea that the reservation numbers are sequential but also global across all types of vehicle orders makes a huge amount of sense.\n\nIncluding the cancellations, it's probably a reasonable way to get that number.", "score": 3, "replies": []}]}]}, {"body": "Ok, so the theory is his number represents the total number of reservations minus cancellations.  So, it could be a ratio we could use going forward if we knew a number very near his tweet.  (ie yours)  :)", "score": 2, "replies": []}, {"body": "Hey, don't be a tease.  What's the first 6 digits?  :)\n\nWhat, like some people don't just browse TIC hitting refresh all day?", "score": 1, "replies": []}]}, {"body": "I really don't get this.  My reservation last night implied that exact number.  Why is it 187k at this point 18 hours later?\n\nOur \"subtract X\" method must not be accurate.  There's gaps, there have to be.\n\nEdit: Unless... he's using social media to source that number... which is ridiculous... right?   Maybe he has to use numbers that are already out there somewhere to meet the restrictions of tweeting no new material information?  It's weird that it's the same number I posted.", "score": 3, "replies": [{"body": "My guess would be that their reservation system generates IDs using one sequence for all (or some subset) of their products. No matter what you reserve, the ID sequence gets incremented. That is why using simple subtraction results in an overblown number.", "score": 4, "replies": [{"body": "Ah, ok. This makes even more sense.  It's almost obvious in retrospect.", "score": 2, "replies": [{"body": "It could also be due to many people reporting issues with placing the reservation due to excess server traffic on Tesla's end vausing duplicate orders.", "score": 1, "replies": []}]}]}]}]}, {"body": "\"Update on Tesla CyberTruck orders. Given the apparent offset when [@elonmusk](https://twitter.com/elonmusk) announced 146k orders, current orders might be around 175k as of 9pm PDT.\"\n\n[https://twitter.com/AlterViggo/status/1198535014192955392](https://twitter.com/AlterViggo/status/1198535014192955392)\n\nAt this rate there will be over 200k by Monday 🚀", "score": 6, "replies": [{"body": "I've read comments here on Reddit of people saying their order was in the 300ks already.  Whatever the case really hope they do a 1 week update.", "score": 1, "replies": [{"body": "187k https://twitter.com/elonmusk/status/1198693994194014208?s=19", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": []}, {"body": "[https://twitter.com/elonmusk/status/1198723473708699648](https://twitter.com/elonmusk/status/1198723473708699648)\n\nAny guess of what this is?", "score": 2, "replies": [{"body": "Battery tech most like IMO.", "score": 12, "replies": [{"body": "Its an announcement , so does it have to be something we haven't heard of before ?", "score": 2, "replies": [{"body": "I think they will be talking about the battery technology they acquired through their acquisition of Maxwell Technologies. The specs for the plaid, roadster, and pickup don't seem to make much sense with the current battery technology.", "score": 2, "replies": []}, {"body": "I would bet it's something new due to it being technology related. Otherwise, I'm not sure why they would make an announcement on something they have already said.", "score": 1, "replies": []}]}]}, {"body": "Can we collectively take a respite from guessing Elon's motives for the rest of this year? I'm personally exhausted.", "score": 4, "replies": [{"body": "I bet his motives are to accelerate the advance of sustainable transportation.", "score": 2, "replies": []}, {"body": "Actually... a big Wheel-of-Fortune style wheel with what's-coming-next ideas for Tesla would be fun.\n\n... maybe another one for TSLAQ just for laughs.", "score": 1, "replies": []}]}, {"body": "Nest-competitor? Elon eluded to it on the Joe Rogan podcast.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yep. It does make sense as a solar roof accessory.", "score": 2, "replies": [{"body": "Considering it's a glorified relay, it's not hard.  I had Ethernet wired to all our thermostats when we built this house, thinking I'd get around to building my own.  11 years later... nope.   (It's always a good idea not to depend on wifi if you can help it)", "score": 0, "replies": []}]}]}, {"body": "The only missing link to full sustainability is a tesla heat pump. Nest competitor could be a good step in that direction. \n\nIf anyone can get people pumped about a trivial product like a heatpump, it is elon, most likely, next year for sure.", "score": 1, "replies": []}]}]}, {"body": "We have been talking about what is revolutionary about the Cybertruck, but I think one deserves more attention. Correct me if I’m wrong, but I think that the following is a mile stone for EVs: Purchase price parity with ICE vehicles.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "We’re just a peak Hype right now, people will start talking about the other cars again soon-ish", "score": 3, "replies": [{"body": "Yeah, main sub had almost zero non-Cybertruck content till today but it's slowly changing.", "score": 1, "replies": []}]}, {"body": "I think you are a “weak” investor and shouldn’t be investing in this company if you don’t believe in it with heart. Too much emotion.", "score": 5, "replies": []}, {"body": "I think the simplicity of all of Tesla's designs make them pretty timeless.  The brutalist simplicity of the pickup is starting to look pretty cool, but I don't see that translating to normal cars any time soon.  The idea of a crazy-tough truck is hugely appealing.  For a commuter car, or a touring car, sexy curves and stylish colors are still better, and get better efficiency.", "score": 1, "replies": []}, {"body": "It is too bad that stainless steel is apparently difficult to paint bc the matte black version of the car (that is floating around on the internet) looks a lot more traditional (if you can believe that) than the stainless steel version.  The reason for this, I think, is because the Cybertruck (due to production breakthroughs) has very sharp edges, as everyone has noted haha.  Edges as sharp as a knife, and the stainless steel only accentuates that.  Christ a knife literally is stainless steel.  But black, especially matte black, mutes this, mutes the edges, softens them.  It makes the whole appearance I believe more palatable for folks because it is not quite such a radical departure.  But obviously Musk was looking for a radical departure.  He wanted to shock.  I mean look at all the talk this thing is creating.  But yeah, I think if they had driven a matte black version onto the stage the reaction would have been different, probably more positive. (I for one plan on doling out the extra money for a black version :)\n\n[https://mspoweruser.com/tesla-cybertruck-in-black-and-white/](https://mspoweruser.com/tesla-cybertruck-in-black-and-white/)", "score": 1, "replies": [{"body": "Matt black is apparently some oxide treatment that can make black stainless steel, ticks like this will yield at most 2-3 colors, everything else is a wrap. Matt black can even be a wrap.", "score": 3, "replies": [{"body": "black stainless steel, sounds awesome to me", "score": 1, "replies": [{"body": "From memory they said it is used in architure and art installations etc, no idea what it costs.", "score": 1, "replies": [{"body": "Not sure if it's the same, but I have Ikea cutlery which is matte black. So can't be that expensive.", "score": 1, "replies": []}]}]}, {"body": "The industry might move away from paint if this becomes a problem.  You can powder coat stainless steel and have the same effect as paint, but the \"paint\" would be far stronger and resistant to scratching.  And you can have any color of the rainbow.", "score": 1, "replies": []}]}, {"body": "The sharp as a knife is only figure of speech, I think. 3 mm steel doesn’t bend forming a knife edge.", "score": 2, "replies": [{"body": "it would take a LOT of force to rip the steel skeleton of the truck to make it knife sharp from tearing.", "score": 1, "replies": []}]}]}, {"body": "After the hype dies down, only people who need a truck, or off road capability will get it.\nThe car I sold to get my Model 3 had some off road capability but I rarely used it.\nThe off road ability of Cybertruck and the hype nearly had me thinking it was worth $100 to join in the funvand keep my options open. But I was able to resist the temptation.\nI think that 50% of reservations might not proceed, it is still a great truck if you need a truck.\nDeparture from design language alwsys happens for a reason, in the end Tesla typically gets all products mostly right.", "score": 1, "replies": [{"body": "I don't need the Cybertuck, but as a work truck, promotional car, it is perfect. It will make a nice business write-off and a nice car in addition to a a Model 3 or Y as your main car.\n\nI didn't like it at first, but it's grown on me and it's perfect to haul an RV that I want to pull. The only problem is the 3 year wait for the tri-motor. I would like to see that happen earlier but I may upgrade with from the dual motor.", "score": 1, "replies": []}]}]}, {"body": "I'm especially impressed with the base price. Large car manufactures had a lot of experience in lowering production cost, but are already struggling with electric cars. If Tesla makes this design work, large manufacturers have just two years to re-think there production cost.", "score": 1, "replies": [{"body": "It is one of the reasons I have faith in the company from an investment standpoint. When Musk constantly says that you win against competitors through pace of innovation, I believe he has instilled that culture and the company will always be pushing hard. There might be failures (e.g. over-automating the model 3 lines), but I have faith that they will not suddenly become a complacent company in a couple years.", "score": 8, "replies": []}]}, {"body": "In the future I feel like they will make a flying boat. Since water provide more safety. Then cars. \nHovercraft 2.0\nPlatform with a dome in the middle that slides efficiently over the water. Using the ocean as a highway.", "score": -7, "replies": []}]}
{"title": "Buy $TSLA", "selftext": "", "id": "e0togh", "created_utc": 1574569227.0, "score": 27657, "upvote_ratio": 0.92, "num_comments": 620, "comments": [{"body": "Terrorist organizations have a great market potential.", "score": 2229, "replies": [{"body": "Like when Frank Reynolds sold Wolf Cola to the jews of Boca Ratan", "score": 845, "replies": [{"body": "Turned out it was Boko Haram.", "score": 372, "replies": [{"body": "Uh oh... this is going to affect all of Frank’s Fluids", "score": 165, "replies": [{"body": "Just let me do the talking", "score": 75, "replies": [{"body": "[deleted]", "score": 83, "replies": [{"body": "What is this guy doing with my name", "score": 70, "replies": [{"body": "Your OTHER porn account", "score": 1, "replies": []}, {"body": "So glad I read to the end", "score": 1, "replies": []}]}, {"body": "You hate dogs????", "score": 1, "replies": []}]}, {"body": "Best fucking comment in this thread!!!!!!!😂", "score": 4, "replies": []}]}, {"body": "affect*", "score": 2, "replies": []}]}, {"body": "Absolutely", "score": 3, "replies": []}]}, {"body": "It's become the official drink of Boca Raton!", "score": 52, "replies": [{"body": "The mouth of a rat?", "score": 19, "replies": [{"body": "mouse*", "score": 1, "replies": [{"body": "Big rat", "score": 1, "replies": []}]}, {"body": "Its where old americans go to die, or so the legends say.", "score": 1, "replies": []}, {"body": "Excelente.", "score": 0, "replies": []}]}]}]}, {"body": "“Buy the 2019 Toyota Tacoma! The following are not paid actors!”\n\n“When I was patrolling the desert in my Tacoma, we were struck by a drone. With the power of the 2019 Toyota Tacoma, we were able to fight those dirty Americans!”", "score": 99, "replies": [{"body": "\"Toyota reliability is so epic that we are able to take dozens of rounds of small arms fire, never change the oil or do any ridiculous recommended service, and yet as long as you kiss the steering wheel before turning the key she starts!\"", "score": 100, "replies": []}, {"body": "I think they' mostly use [Hiluxes](https://en.m.wikipedia.org/wiki/Toyota_Hilux) over there", "score": 37, "replies": [{"body": "I think they use the ISIS model [https://en.wikipedia.org/wiki/Toyota\\_Isis](https://en.wikipedia.org/wiki/Toyota_Isis)", "score": 24, "replies": [{"body": "That one has the airbags on the outside of the vehicle. They are utilized as reactive armor.", "score": 7, "replies": []}, {"body": "Which they of course bought using the (T-Mobile/Verizon/AT&T) ISIS Mobile Payments Network ([https://en.wikipedia.org/w/index.php?title=ISIS\\_(mobile\\_payment\\_system)&redirect=no](https://en.wikipedia.org/w/index.php?title=ISIS_(mobile_payment_system)&redirect=no))", "score": 2, "replies": []}]}, {"body": "The Landcruiser flatbed is the perfect vehicle for overlanding/mounting a 40mm AA gun", "score": 4, "replies": []}, {"body": "Isn't a Hilux just a Tacoma with different sheet metal?", "score": 3, "replies": []}]}, {"body": "The Tacoma is only sold in the US and Canada. Everywhere else gets the Hilux", "score": 16, "replies": []}]}, {"body": "“Can I interest you in some not flamethrowers?”", "score": 100, "replies": [{"body": "Just a shipment of ice-melters to the middle of the desert, nothing to see here.", "score": 16, "replies": []}]}, {"body": "It'll work great as long as the infidels don't throw small balls at them.", "score": 89, "replies": [{"body": "throw is even a strong word that dude gently tossed it.", "score": 2, "replies": []}]}, {"body": "Remember when ISIS suddenly had a bunch of new as fuck Toyota Tundras?", "score": 45, "replies": [{"body": "not many know but ISIS stands for I Stood In Shit.", "score": 13, "replies": [{"body": "I think it might actually reference the famed veil of isis", "score": 3, "replies": []}]}, {"body": "I missed that episode of Archer.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 69, "replies": [{"body": "You're welcome for my service", "score": 59, "replies": []}, {"body": "Toyota's use in paramilitary groups partially popularized in Africa. I might be wrong but ~~Ghanians~~ Chadians used it a lot against Libyans. While there is American influence in Africa, there is also a very strong French influence.\n\nEDIT: Chad, not Ghana. Thanks /u/shorty_shortpants", "score": 25, "replies": [{"body": "When I deployed to Niger in 2017 we exclusively used Toyotas (and the occasional Humvee). \n\nSome of these Toyotas were held together with Scotch tape (land cruisers) but we had some stick shift Hilux and holy fuck was that fun to rally around the Sahara in.", "score": 35, "replies": [{"body": "excuse me but you can't say Niger anymore its now \"African Country\" you biggot", "score": 45, "replies": []}, {"body": "What unit/branch were you in that deployed to Niger?", "score": 3, "replies": [{"body": "Air Force", "score": 3, "replies": []}]}]}, {"body": "Anywhere else in the world that's semi rugged, Toyotas are the thing to have due to high reliability and endurance.  They've been popular long before the paramilitaries used them.", "score": 7, "replies": [{"body": "Ok, but how do Al Qaeda and ISIS get a hold of THOUSANDS of identical white Toyotas and allegedly no one knows where they came from or who financed it? They've been doing this for decades.", "score": 1, "replies": [{"body": "May have something to do with wealthy businessmen who are totally our allies in Qatar and Saudi Arabia placing big orders of Hilux and Landcruisers, or it could be unrelated.", "score": 2, "replies": []}]}]}, {"body": "Chadians. Ghana is pretty far from Libya. I don't know why anyone would drive through 3 countries to wage war, unless they're Americans.", "score": 20, "replies": [{"body": "*Germany enters the chat*", "score": 25, "replies": [{"body": "*LOS*", "score": 1, "replies": []}]}, {"body": "My bad. I will correct.", "score": 3, "replies": []}, {"body": "*Chads", "score": 1, "replies": []}]}, {"body": "The CIA would like to talk to you", "score": 9, "replies": [{"body": "The CIA has a lot of explaining to do.", "score": 3, "replies": []}]}]}, {"body": "Fun fact, the precursor organization  was started by a Jordanian criminal wanted in Jordan for plotting against the king. \n\nHe was hanging out in Iran, Jordan asked Iran for him, and Iran refused to extradite him. \n\nMost Redditors never use quality sources for Middle East history, they only know \"Sykes-Picot oil America bad\"\n\nSo so much more complicated than that.", "score": 13, "replies": [{"body": "So what does that say to you? For me all it says is that Shia and Sunni’s respective relations go from mortal enemy to strategic competitor when Americans or the west are involved. Without the west there is a ton of evidence the two are mortal enemies.\n\nIran housed Zarqawi because he destabilized areas to their benefit. The news source I saw stated he was in Iran before he led a ton of sectarian violence in Iraq. It would be interesting learn if Iran hated that or felt it was worth it to foster Iraqi Shia relations with Iran’s government, which in turn increases their influence outside their borders.\n\nedited for clarity.", "score": 1, "replies": [{"body": "Mountains of history and evidence Iran plays differing  sides to their advantage when they can, you're right.", "score": 1, "replies": []}]}]}, {"body": "Cooobraaaaa", "score": 5, "replies": []}, {"body": "You can thank Trump... or maybe go directly to his handler.", "score": -3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "lmao... you know trump never pays", "score": 0, "replies": [{"body": "Orange Man Bad!", "score": 1, "replies": []}]}]}]}]}, {"body": "ALL CASH", "score": 8, "replies": []}, {"body": "911 was actually a marketing stunt to show how the planes and towers can sustain a collision. But they failed. *Insert sad elon noises*", "score": 14, "replies": [{"body": "Two towers, two planes, two rocks thrown by Elon...*wake up sheeple*", "score": 3, "replies": []}, {"body": "> Insert sad elon noises\n\nwhich consists mostly of silence as his already poor public speaking ability is confronted with the reality of the world forever seeing a product unveiling marred by doubling down on failure.", "score": 1, "replies": []}]}, {"body": "One man’s terrorist is another man’s freedom fighter.  \n\nGo Hong Kong! Boo isis!", "score": 4, "replies": [{"body": "The bigger terrorist is always the entrenched, incumbent power.", "score": 1, "replies": []}]}, {"body": "Funny how some phone companies designed a small/cheap/not-smart phone just to attend the prisioners market in Brazil", "score": 4, "replies": [{"body": "> not-smart phone\n\nDumbphone is the word you're looking for.", "score": 7, "replies": []}]}, {"body": "Why do you think 4 Runners are a hot sell.", "score": 4, "replies": [{"body": "psssh Land Cruiser you mean", "score": 3, "replies": [{"body": "Yes you’re right I mixed up the two, I should be beheaded for that.", "score": 2, "replies": []}]}]}, {"body": "That's the most American sentence I've heard today. Fuck yeh they do.", "score": 3, "replies": []}, {"body": "Tropic thunder?", "score": 1, "replies": []}, {"body": "Seems like a pretty closed market, since they almost exclusively roll around in Toyota hilux's and bongo trucks.", "score": 1, "replies": []}, {"body": "So you are saying Toyota is going to lose a big market share for their pickup trucks?", "score": 1, "replies": []}, {"body": "Toyota was worried about losing share so they released the specially branded [https://en.wikipedia.org/wiki/Toyota\\_Isis](https://en.wikipedia.org/wiki/Toyota_Isis)", "score": 1, "replies": []}, {"body": "Jajajajaja", "score": 1, "replies": []}, {"body": "It’s been great for Toyota", "score": 1, "replies": []}, {"body": "Toyota tough and isis approved", "score": 1, "replies": []}, {"body": "Tehran gigafactory confirmed", "score": 1, "replies": []}, {"body": "Can anyone say \"Mad Max 4: Worry Mode?\"", "score": 1, "replies": []}, {"body": ">Terrorist organizations have a great market potential.\n\nToyota has been the #1 truck dealer for terrorists since the 1980s. Terrorists love the Toyota Hilux in particular.", "score": 1, "replies": []}, {"body": "Like aramco", "score": 1, "replies": []}, {"body": "https://www.youtube.com/watch?v=RjNKHRJqKko\n\nI see you Elon", "score": 1, "replies": []}, {"body": "lots of sun in the desert... solar bb", "score": 1, "replies": []}]}, {"body": "Solar panels for infinite range in the desert. Gg oil refineries.", "score": 1443, "replies": [{"body": "there is going to be a trunk cover solar panel as an option", "score": 290, "replies": [{"body": "Possibly with \"wings\" that come out too to increase the solar panel area.", "score": 163, "replies": [{"body": "[deleted]", "score": 90, "replies": [{"body": "If the wings could push it up to 30k ft it would be a great option", "score": 104, "replies": [{"body": "Where we're going we don't need roads", "score": 42, "replies": [{"body": "But we *do* need buoyancy, did you bring the helium?", "score": 3, "replies": [{"body": "*\\*high pitched voice\\** Hell yeah!", "score": 1, "replies": []}]}]}]}, {"body": "Solar is nowhere near that good yet", "score": -1, "replies": []}]}, {"body": "And to decapitate pedestrians.", "score": 16, "replies": [{"body": "I like you.", "score": 2, "replies": []}]}]}, {"body": "You mean the retractable solar panel already covering the bed?", "score": 22, "replies": [{"body": "There's going to be it, but there already is it too.", "score": 7, "replies": []}]}, {"body": "Can solar panes be split like that though? The cover can retract because it's made of dozens of different parts", "score": 1, "replies": [{"body": "Yeah of course, thin film panels. They have a lower efficiency but they are cheap to build small cells.", "score": 1, "replies": []}, {"body": "Yeah, there'll just be a different module on each moving part and they'll be wired together. Solar modules already consist of multiple cells, each of which is capable of operating independantly anyway and has nothing setting a minimum cell size except practicality, and nothing setting a maximum cell size except for manufacturing ability. You can have solar panels anywhare from square centimetre order to square metre order.", "score": 1, "replies": [{"body": "Yeah but that means it will be rather expensive since nobody is mass producing panels that size. From my understanding, the main way to lower solar panel price is large mass producing and that's why panels usually come a standard size.", "score": 1, "replies": [{"body": "Yes, they are. Smaller solar panels are produced in large quantities for many applications such as mounting onto street lamps etc. But the panel size isn't really the important thing here anyway. You're right that mass production is really helping to lower solar energy price, but, specifically, it's the mass production of the cells, which are the hard and pricey part, not the modules. The cells are already pretty small, and they can be cut smaller. Manufacturing a module containing as many of those cells as needed in any size is relatively easy and inexpensive by comparison to making the cells themselves.\n\nObviously, for the consumer market, there is a further saving to mass producing the modules, but not so much that you can't easily justify and get similar savings on custom size for a reasonable number of modules, maybe tens of thousands, just like any manufacturing process.", "score": 2, "replies": []}, {"body": "But they would be mass producing the panels for the truck.", "score": 1, "replies": [{"body": "they'd mass-produce thousands and not millions. They have an advantage since they can manufacture them, but it still will be costly.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Could have some angle adjustment with the adjustible air suspension", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It's on a fucking truck, turn it around", "score": 3, "replies": []}]}]}, {"body": "Well, they give power relative to the cosine of the angle of incedence, which ranges from a 0 to a 1.0 multiplier.  A 5kW system aiming 45 degrees when the sun is at high noon still receives 70.7% of the sun's radiation.  That's about 3.5kW.\n\nYou can put those panels at 60 degrees to the horizon with the sun at high noon and you'd still get 2.5kW.\n\nWhat I'm trying to say here is that you are wrong.", "score": 8, "replies": [{"body": "This guy maths", "score": 1, "replies": []}]}, {"body": "even if it takes a week to charge to 200 miles, post-climate-apocolypse, having that in a truck + cargo will be quite the luxury", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "my vote is deregulate nuclear and let us have miniature power plants in the frunk.", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "not plausible, future boy!", "score": 2, "replies": []}]}, {"body": "lol tell that to the crew members of the ISS", "score": 1, "replies": []}, {"body": "If you are in the middle of the desert and not on an incline facing away from the sun. Enough sunlight will be hitting the panels to do something. We are talking about driving around in Maine or Scotland.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I mean it is. Will it always be getting enough sunlight to be working at full capacity? No. Will it always be getting enough sunlight to even generate electricity? No. Will it give the truck unlimited range? No. But we are in a desert. If we are assuming its a cloudless day from most angles there will be enough sunlight to generate a current which is more power than it would have and thus range than if there was no solar panel. Which its a desert we are speaking of unless im mixing my conversations up again so that will more often than not be the case.", "score": 1, "replies": []}]}]}, {"body": "In the us you just point south and angle it a little. If the angles are off a little you will lose a small amount of power, but it’s not typically enough to justify putting the panels on servos to follow the sun. Taking this truck to the middle of nowhere would be cool because 15miles/day isn’t bad and you could use it to power your other camping stuff.", "score": 1, "replies": []}]}]}, {"body": "Don't get high on your own supply", "score": 51, "replies": []}, {"body": "Wait for oil to plummet then buy", "score": 14, "replies": []}, {"body": "So Saudi Aramco puts on IPO?", "score": 9, "replies": []}, {"body": "Gonna need a cubic mile of solar panels to get anywhere within the week though\n\nI think a reasonable amount to have on the bed gives you 5 miles in a day, probably more if it's Sandy hellscape, but still", "score": 8, "replies": [{"body": "Pretty much this. Whilst solar powered cars are a thing, they have to be super light.\n\nA massive solar array might work, but any automatic unfurling system is gonna be expensive and prone to breakage. Probably more practical to have a bunch of lightweight panels stacked in the boot with a mechanism for offloading them onto / onloading them from the ground.", "score": 3, "replies": []}, {"body": "Musk said 15 miles", "score": 1, "replies": []}]}, {"body": "US military:\n\n“WHY AREN’T THEY OUT OF GAS YET?!?”", "score": 1, "replies": []}, {"body": "Night?", "score": 1, "replies": [{"body": "Fight til dawn", "score": 1, "replies": []}]}, {"body": "I remember seeing a bunch of anlysises on how solar panels where unfeasible when people suggested putting them on the model 3 roof.  Wounded what changed?", "score": 1, "replies": [{"body": "Nothing changed. Model 3, like most other cars, doesn't have enough surface area for solar panels so you would only get a couple of miles a day and sure to the added weight you would be losing efficiency so too much trouble for little gains.", "score": 4, "replies": []}]}, {"body": "There is still going to be oil involved in manufacturing these, delivering these, and reparing these for a very long time.", "score": -2, "replies": []}]}, {"body": "I see so Saudi Aramco calls", "score": 588, "replies": [{"body": "[deleted]", "score": 113, "replies": [{"body": "Saudi money gonna make $TSLA private at $420! GOING TO THE MARS ON MY PRESSURISED SOLAR-PANEL EQUIPPED CYBERTRUCK TECHNICAL!", "score": 71, "replies": [{"body": "Saudi takeover secured.", "score": 11, "replies": []}]}]}, {"body": "What you mean there are Aramcos that aren't saudis ???", "score": 51, "replies": [{"body": "The Saudi's are making more of it public as a way to raise revenue for their white elephant project of building a new economic capital near the red sea in the North West of the country.", "score": 8, "replies": []}]}, {"body": "Obviously\n\nWhat better way to hedge than own oil and EV together", "score": 1, "replies": []}, {"body": "puts", "score": 1, "replies": []}]}, {"body": "That part of the world has lots of Solar Roof potential too.", "score": 426, "replies": [{"body": "[deleted]", "score": 291, "replies": [{"body": "There is no ecosystem to destroy, beheaded all of the environmentalists, and human rights are more like temporary allowances. They just need more $TSLA in their lives, brah.", "score": 189, "replies": []}, {"body": "[deleted]", "score": 42, "replies": [{"body": "Can I get a freedom unit conversion pls?", "score": 21, "replies": [{"body": "Under 14 cents per gallon if the above user is correct.\n\ne: no it's not I'm dumb, look below.", "score": 41, "replies": [{"body": "THATS PRETTY GOOD!!", "score": 15, "replies": []}, {"body": "That's absolutely wrong. Check your calculation, its close USD0.65/litre", "score": 5, "replies": [{"body": "2 riyals is .53 usd according to google. so that's $0.53/liter. There are 3.85 liters in a gallon, so it's $0.1378 per gallon.", "score": 3, "replies": [{"body": "That's still wrong. You're dividing instead of multiplying.\nIf 0.53USD ~ 1l\nthen  2.04USD ~ 3.85L/1 gallon", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Oh snap you right\n\nalso you commented that 4 times, you may want to delete some of them. But yes it's actually $2.04/gallon (which is weird that people are saying that it's so low, that's what a lot of people pay for it in the states)", "score": 2, "replies": [{"body": "That's wierd af, I tried posting that comment multiple times till It first went thru.", "score": 1, "replies": []}]}]}]}, {"body": "Why TF would you convert to USD but then go and use litre? Were talking about gasoline, not soda", "score": 3, "replies": [{"body": "Yeah, it's cause idk the convo rate btw gallon and litre and was to lazy to find out. 😅", "score": 1, "replies": []}]}]}]}, {"body": "0,48 Euro pro Liter", "score": 9, "replies": [{"body": "Das wär wie Weihnachten", "score": 1, "replies": []}, {"body": "0.78 Nibnabs per Pollywogn", "score": -2, "replies": []}]}]}, {"body": "Yea, iirc water costs more than oil", "score": 11, "replies": [{"body": "Not quite. Premium fuel is like 2 riyal a litre and water 1 riyal a L. \n\nArguably in the UK if I buy evian it's gonna be more than (our expensive) fuel", "score": 6, "replies": [{"body": "Retail versus wholesale", "score": 1, "replies": []}]}]}, {"body": "When is that canal supposed to be finished? Any idea?", "score": 2, "replies": [{"body": "It's political posturing. Not gonna happen, that border is closed now anyway the canal would just be a waste of money", "score": 6, "replies": []}]}, {"body": "Quatar and the middle east (UAE/SA) have roads that go straight for miles cause there's nothing really in the way, at highway speeds you can see how not-fast a Tesla is especially against other 100k sports cars", "score": 1, "replies": []}]}, {"body": "Yeah one of my old maths teachers moved to a Middle Eastern country that produces so much oil no one needs to pay taxes", "score": 1, "replies": []}]}, {"body": "yes. They are called goats.", "score": 16, "replies": []}, {"body": "You need sun, but you also need less heat. The solar panels that are available now lose efficiency while going above a certain temperature.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I'm really curious about this too cause I live in Phoenix Arizona and even regular car batteries dont last 3-5 years. I knew one guy moved from Minnesota said his car batteries last 4-7 at least and he was replacing it like every 2 being here. So it really makes me wonder about the all electric cars especially somewhere like Dubai", "score": 1, "replies": []}, {"body": "There are Tesla dealerships in Dubai. Call them and ask, lazy bastards on this sub I swear", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bahaha. Ok fair enough. No their batteries don't do well in places like Phoenix even on hot summer days. There is plenty of information on range decrease of as much as 25-30% although they are thermally managed. I would guess the heat pump needs power to run. However  wether the actual life is affected is harder to find info on. My guess would be yes and significant, basically due to thermal and physical expansion cycling when shoving the Li into 8 carbon lattice over and over, but it's hard to find reliable confirmation on this since newer batteries are just now starting to shit out in numbers.\n\nEdit: they dont do well in cold either.", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 313, "replies": [{"body": "\"Me and the boys, just beheading some infidels #blessed\"", "score": 1, "replies": []}]}, {"body": "TSLA needs to sell to the American market too, and play both sides.", "score": 61, "replies": [{"body": "So that they always end up on top?", "score": 19, "replies": []}, {"body": "Americans have better vehicles than this. You go against America with this crap, you be DEAD in seconds. We spend more than the rest of the world combined in military. This “truck” is child’s play and would be blown to smithereens in seconds. 🤣 \n\nJust google USA military armored vehicles and you’ll realize how trivial this Tesla crap is.", "score": -27, "replies": [{"body": "No. Ten times more doesn’t mean quality. RAND Corp retraction, an intelligence think tank, ran simulations and the USA lost to Russia and China. In warfare with nukes and without. That’s russia and china separately. Ten times more than russia and China but no quality, no performance. \n\nThis stuff isn’t trivial. You need to have a more objective analytical mindset before randomly accusing something as better due to google images and cost. \n\nIt’s not nice to misinform people. I know you might have pride but pride and mental illness don’t go together. It’s critical thinking that builds pride. \n\nLithium technologies are not trivial. 1 million mile lifetime range, quiet, no pollution,  0-60 in 3, that’s called the next stage. It’s the next step in transportation. We went from horses to gasoline and now to this. A transportation tool that’s 10 times faster than a horse with 50,000 more endurance, eats sunlight, and can drive itself. It’s not nice to say that’s “crap.” What is crap is corruption. 690 billion a year and failing above 50 percent of the time against two opponents who spend ten times less when combined. \n\nYour giving glory to the bad and insulting the good.", "score": 7, "replies": [{"body": "steep grey sense versed support ring sloppy axiomatic offbeat cake", "score": 9, "replies": [{"body": "Hey. SOMEONE stays in power, and that means SOMEONE makes the right decisions. \n\nBritain spent 100x more than the USA on militaries using conventional tactics but guess what... critical thinking skills won. (Hiding behind trees and targeting officers with longer barreled muskets) \n\nOther nations just compensate by rewarding critical thinking skills. Where in the USA that means a demotion because efficiency means less taxes to request. \n\nThat’s how the (edit- DoD) spends 690 billion and yet when facing China in a total warfare scenario where one nation “annexes” another, with nukes and without nukes, the US lost more than 50% of the time in both types of scenarios. Same results against Russia. Over 90% loss rate when they were both together. \n\nMaybe it was a ploy for more taxes!???? Maybe. But actually, no. Play dumb long enough and soon enough you will realize you aren’t smart anymore. Thing is, the DOD wants expendable people. Talent means less taxes to request and that means less of a tax pool to request from. Talent he’s pushed out. \n\nEventually though, critical thinking skills become rare enough for the US to spend 690 billion a year and other countries laugh with confidence as they compensate with critical thinking skills.", "score": 2, "replies": [{"body": "lol", "score": -3, "replies": [{"body": "lol", "score": 2, "replies": []}]}]}]}, {"body": "What a silly premise. The US lost to Russia and China, with nuclear weapons? Such a war would never happen. The US has enough nuclear firepower to destroy every major city in world, even with missile defense systems. As in ~2,000 nuclear weapons currently deployed.", "score": 3, "replies": [{"body": "Other nations have that capability too. Also, warhead yield matters.", "score": 1, "replies": [{"body": "Further explaining why such a war would never happen.", "score": 0, "replies": [{"body": "World war 1 and 2 happening less than 100 years apart is also shocking. \n\nShocking things happen. Extreme illogical national reactions are less likely when there are critical thinking skills being utilized in influential positions. \n\nAnd THAT is actually important. \n\nThere reason millions don’t die in wars is because of the possibility of nuclear warfare. It is a deterrent. As soon as a method of removing the effects of radiation are found, civilians will have found a new possibility to avoid. \n\nA war like that doesn’t happen because it carries loss. But it’s important to measure how much loss. \n\nIn this, Russia and China lose less and land more hits. (Separately) \n\nAnd when technology gets far enough, that’s an advantage the USA should fix. $690 billion a year and a LOSS of long term strategic capabilities compared to nations that spend 10x less when combined.... that’s not a sign of talent... that’s corruption. \n\nThat’s... a lack of critical thinking skills. And that’s not something tax money should pay for.", "score": 1, "replies": [{"body": "Saying the US loses less is silly when every nation involved loses an amount so much larger than what would be considered acceptable losses.\n\nFinally, the idea that the US is somehow losing long-term capability is just not true. The US is the only nation with a remotely functioning missile defense system, the only nation with a blue-water navy, and the only nation with bases in every area of the globe. No nation has the ability to project power around the world in the way the US can. This will not change barring China building a multi-trillion dollar navy and somehow creating several military bases in the Western hemisphere, which I don't really see happening.\n\nIn addition, military spending, while excessive, does drive innovation in the private sector, so the money is not entirely wasted. I do agree that the US spend more than it needs to on the military, but I very much disagree that it is losing ground.", "score": 2, "replies": [{"body": "I would suspect that the US is actually currently loosing strategic long term capability. \n\nAircraft carriers are easy to hit with hypersonic missiles and it only takes one hit with modern warheads. That’s why other nations simply build cheaper counters. The US navy is about influencing nations without equal technological footing. No need to conquer an airport when you can carry an airport. The Navy adds nothing to the USAs world superpower position. It just makes poor countries less likely to refuse negotiation.  If World war 2 can be associated with heavily armored battleships and large cannons it’s like a boxing match. Modern Naval warfare is about team dodge ball. One hit kills. It’s all about range, speed of positioning, and numbers. Other nations build what can counter nations with equal technological prowess, but the US builds what can easily allow it to take poor people from its home land and scream at them to enhance obedience while rewarding people for doing marathon runs more than people who save lives in combat. Just focusing on being able to threaten dirt poor nations. “It’s my training that makes me better” aka because I’m obedient to people who see me as a resource. Training that any1 could devise better strategies to counter with limited application of analysis.  \n\nIt took the US almost 20 years to reach a confirmed 80,000 terrorist kills. RUSSIA, in two years, has confirmed 85,000 terrorist kills. The DoD spends but the results that are brought towards world stability are overshadowed by other nations efforts.\n\nProjecting power abroad is certainly an advantage. However, the problem still arises with the way the military is structured. Posing as a meritocracy but thinking that a federally accredited degree is Weaving and Knitting makes someone more worthy of leadership than a cognitive reasoning score that outperforms 99.999% of the population shows that the focus is on expendability. Why risk that which is a severe loss to lose when you can risk what’s already worthless and therefore gain? That’s the philosophical stance and it’s gone to the point of HURTING people who are actually worthwhile.  \n\nI agree though. The US isn’t on the losing ground despite spending so much. However, for the amount spent, equal footing is not acceptable. No one pays the price of ten cars for the performance specs of a typical civilian sudan. Military research does drive innovation. That’s true. \n\nWashing machines, dryers, elevators, refrigerators, touch screen devices, electronic communications, all innovations that aren’t top secret military projects due to American quality of life initiatives supported by government legislation. \n\nTook the world 10,000 years to go from sword type A to sword type B. Always using the atoms. In just 400 years, wagons are no more.  Horses as a transportation tool were removed. By placing rocks into certain shapes and configurations we have transportation tools that are 10x faster than horses with 50,000 more endurance and eat sunlight. Electric vehicles will soon be able to drive without a driver. \n\nThe US has... the victory in advancing humanity.  I’m just saying that it would seem like the US is now just an equal force with other nations. Nothing special anymore. Whatever it was, it’s now less than 1% of that. \n\nWhile it’s not loosing and while it’s not directly harmful... it isn’t... anything it should be. America today is less America than it was 100 years before 1776.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Nope, the simulations was for Russia and China combined. And that’s with a loss being where the US isn’t able to save the Baltics or Taiwan.", "score": 4, "replies": [{"body": "Nope. The were set for Russia and solely for China. \n\nDo not misinform. Check your facts. \n\nAnd it was for total all out warfare, not a particular region.", "score": -1, "replies": []}]}, {"body": "I looked and I couldn't find any Rand study that came to your conclusions. Mind helping me out? I'm very interested.", "score": 1, "replies": [{"body": "Https://arvix.org/abs/physics/0510071\n\nAre you familiar with a casabowa howitzer? \nIt’s basically stream of energy.  A nuclear directed energy weapon. \nConsidering Russia has made well publicized advancements in hypersonic missiles,,, claiming Mach 30.  The ultimate advantage lies with Russia. Remember when... The USA was the only one with a nuke? Well now there is another ultimate negotiating device and the US has missed out. If you can’t see the political power of one nation owning a nuclear capability at one time with your own rational thoughts then you won’t see the advantage here either. It’s quite obvious why Russia was so happy. \n\nAs for China. Well, they have a LOT of people and manufacturing prowess and are willing to use almost everything.  Something that the US has succeeded in matching to China is the vilification of critical thinking skills. That’s,... the US deserves better than matching China in the value of critical skills for warfare professionals. \n\nAs for the report. I can’t find it. But Rands “the next 100 years” book, (claimed to be top tier quality with maximum talent applied) while insightful in some ways, reveals issues in logic that no doubt point to a LACK in value towards critical thinking in the US intelligence community. Enough so that, rationally, since it is their pinnacle report, and to what it suggests, (mexico overcoming the US as a world superpower) one had all the info to judge “ 100k/year former intelligence analysts” effectively. \n\nIncompetence PAYS when there is corruption. And when expendability is valued and critical thought is demeaned, quality results are FAR AWAY.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well ok, I may have interlaced that report with some material in that silly “The next 100 years”’from that rand guy. (Which is said to be a reflection of their”highest” talent and skill.) lol \n\nStill, I wouldn’t be surprised if there was a comprehensive warfare simulation that supports that claim. It’s not tooooo implausible. \n\nAnd it doesn’t take away most of my points anyways.", "score": 0, "replies": []}]}, {"body": "Ummmmmm the simulation and real life is different. The USA is the most advanced military force in the WORLD. Remember that. \n\nIf you dare doubt us, have your army attack us and see what happens. I think we reminded the Japanese of our power. ;)\n\nI am become death; destroyer of worlds. ;)\n\nDid you not see captain Phillips the movie??? \n\nThree snipers sniped 3 guys in a fraction of a second, on the water, with waves , all at the same time to rescue a hostage. Do you know the level of difficulty to do that ? \n\nCome on buddy, you can’t simulate warfare. That’s DUMB. You’re dumb for thinking you can do that. That’s like trying to predict an opponents strategy in POKER.... you CANT. you can ONLY play the odds. You can’t know for certain. \n\nYou’re dumb. Very dumb for thinking you could simulate warfare which changes in certain situations. DUMB. I could change an entire strategy just because I see something unfavorable. Go ahead and predict that idiot.", "score": -6, "replies": [{"body": "This ain't it, chief.", "score": 1, "replies": []}, {"body": "My army? Your ducking retarded. The US Is my army. Dumb shit.", "score": 0, "replies": [{"body": "Then you’re dumber than I thought.", "score": 0, "replies": [{"body": "Read your comment again. I didn’t say “my army” I’m not picking sides. I’m staying analytical and objective. Truth is my goal. Not some finicky “pride.” \n\nRead you comment again and learn why assumptions on other motivations doesn’t make u right.", "score": 1, "replies": []}]}]}]}]}, {"body": "And y'all still lost in Vietnam against farmers.\n\nAnd the Soviets, with all their heavy equipment and weapons, still lost in Afghanistan against a force that only had manportable weapons.\n\n\nHow much you spend is the shittiest indicator there is. Because it doesn't include overpaying for shit or the fact that China and Russia have way cheaper equipment that is nearly as good as the stuff the US has.\n\nFurthermore even if you have the better equipment you still have to use it effectively and to better effect than the guy you are fighting is using his stuff.\n\nBecause a chopper can easily be shot down by some guy with a 500 buck light machine gun using 20 bucks worth of ammo.", "score": 1, "replies": []}, {"body": "Wow you mean military vehicles are better suited for combat than civilian vehicles? Shocking.", "score": 1, "replies": [{"body": "The guys argument was the military would buy this. Read the comments moron. \n\nObviously they WONT buy this trash.", "score": 1, "replies": []}]}]}]}, {"body": "....then we found ourselves in the desert, nothing but and endless ocean of sand dunes cresting with the wind, and a line of Tesla charging stations as far as the eye could see. That's when we all knew just how much trouble we were in....", "score": 127, "replies": [{"body": "Solar charging stations", "score": 18, "replies": [{"body": "How else are you going to keep the sun charged?", "score": 3, "replies": [{"body": "Just have an astronaut travel to the sun at night and replace the batteries. See, at night the sun's down so humans won't turn to dust once they get too close to, or land on the sun!!", "score": 1, "replies": []}]}, {"body": "Touche", "score": 1, "replies": []}]}, {"body": "500 miles on freshly paved first world highways; 50 on sand dunes.", "score": 1, "replies": []}]}, {"body": "Wolf Cola?", "score": 152, "replies": [{"body": "Proud sponsor", "score": 40, "replies": [{"body": "Of those old Jews in Boca Raton?", "score": 30, "replies": [{"body": "Old Jews in boko haram", "score": 17, "replies": []}, {"body": "They're slurping it up like candy!", "score": 9, "replies": []}]}]}, {"body": "Tired of jihad?\n\nTry the refreshing taste of Wolf Cola,\nthe official drink of Boko Haram.", "score": 9, "replies": []}]}, {"body": "Bullet proof,  but not metal-ball-proof. I’m sold.", "score": 245, "replies": [{"body": "Bullet proof but not Miley Cyrus proof", "score": 33, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "/r/YourJokeButWorse", "score": 3, "replies": []}]}]}, {"body": "Nobody said anything about bullet proof windows ever in that presentation. Y'all need to work on listening comprehension.", "score": 116, "replies": [{"body": "But they did say something about it being steel ball proof", "score": 38, "replies": [{"body": "Did the steel ball go through? No. Therefore steel ball proof.", "score": 92, "replies": [{"body": "Musk's reaction to the windows being smashed, shows that they weren't meant to be smashed.", "score": 15, "replies": [{"body": "Or he was impressed by how well it got smashed, way beyond all of his expectations.", "score": 0, "replies": [{"body": "Olympic level mental gymnastics there, chum.", "score": 7, "replies": [{"body": "forgotten /s", "score": 2, "replies": [{"body": "Musk fanboys will often surprise you.", "score": 3, "replies": []}]}]}]}, {"body": "Oh that's how you figured that out huh?", "score": -4, "replies": [{"body": "How about him saying \"oh my ~~going~~ fucking god, ummmm, let's try that again\"", "score": 6, "replies": [{"body": "You could be onto something here.", "score": 6, "replies": []}, {"body": "*fucking", "score": 1, "replies": [{"body": "How in the god dammed fuck did my phone autocorrect to that bullshit?", "score": 1, "replies": []}]}, {"body": "If you ever want to take down Musk's empire, just get him into a Martaingale doubling down scenario.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "You should write legal disclaimers!", "score": 12, "replies": []}, {"body": "We don’t know how heavy that ball is. If it’s solid steel then it has a lot of momentum and will require a very large force to stop that ball. This can only be achieved from another object that is high in mass itself or if the object is very strong. A regular car window would most definitely not stop a solid steel ball of that size.", "score": 1, "replies": [{"body": "Plus, Musk [posted a gif](https://twitter.com/elonmusk/status/1198090787520598016) of them doing it in rehearsal. It's the same vehicle and it's thought the test throws weakened it.", "score": 2, "replies": []}]}]}, {"body": "It was supposed to be shatter proof.  Did you not see the God damn demo where the guy dropped the ball from 10 feet high?", "score": 1, "replies": []}, {"body": "Retard\n\nEDIT: retard", "score": -8, "replies": [{"body": "Someone tweet Elon to ask if it’s retard proof", "score": 2, "replies": []}, {"body": "      ", "score": -3, "replies": [{"body": "Retard", "score": -2, "replies": []}]}]}]}, {"body": "Well, he *did* finish the presentation in front of a shattered window...that's gotta take some balls of steel.", "score": 3, "replies": [{"body": "Dont think he had much of a choice", "score": 10, "replies": []}, {"body": "What the hell was the alternative exactly?  Take his steel balls and go home?", "score": 2, "replies": [{"body": "Well he does that everyday doesnt he?", "score": 1, "replies": [{"body": "Elon is a Beta's idea of an Alpha male.", "score": 1, "replies": [{"body": "Get 1 billion and make a sucessfull business out of something everyone said would fail and then fuck Amber Heard, then tell me whats an alpha or not.", "score": -1, "replies": [{"body": "Get $1b? You mean be born into a wealthy South African mining family?", "score": 2, "replies": [{"body": "Rofl yeah thats why he had several shitty jobs, go read a biography you dense fuck.", "score": 1, "replies": [{"body": "I'm good. Thanks for the suggestion though.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Turn the truck around.", "score": 1, "replies": []}]}]}]}, {"body": "I have a feeling like half the people haven't actually watched it and just copying what they've heard. Elon cleary said the steel panels not the windows were bulletproof yet I see it all over reddit", "score": 28, "replies": [{"body": "You expect WSB to actually do their own DD?!", "score": 16, "replies": []}, {"body": "I love the desperate narrative spinning the musk rats are shilling all over Reddit.\n\nI don't care if you think it looks good in black matte that trucks going to be laughed off construction sites nationwide", "score": 3, "replies": []}, {"body": "Even then he said \"bulletproof *to a 9mm handgun*\", and behind him on the screen had the further specifics of \"full metal jacket, from 10 meters, 115 grain\".", "score": 1, "replies": [{"body": "Isn't full metal jacket the most likely to penetrate armor?", "score": 1, "replies": [{"body": "Disclaimer: I'm not much of a gun expert.\n\nIt's not bad, but it's not armor piercing either. Heavier rounds than 115 grain would also be somewhat more likely to penetrate.\n\nI don't think they intentionally made the test easy (past using a 9mm pistol instead of a rifle...), just that they weren't trying to claim \"it's bullet proof\" so much as \"we shot it with this, and it didn't penetrate\"", "score": 1, "replies": []}]}]}, {"body": "Well the window didn't break, just curved in...", "score": 1, "replies": []}, {"body": "It wouldn't be a thing if the glass didn't break when he through the ball at it.... Twice.\n\nWhy didn't they test that before hand?", "score": -2, "replies": [{"body": "They did test and it didn’t break in multiple tests. It’s believed the tests, plus the sledgehammer blow, weakened the windows.", "score": 2, "replies": [{"body": "Still, it was a bad example, I'm sure it will be better on their next showing, but that is why it's a meme", "score": 1, "replies": []}, {"body": "Press X to doubt", "score": 1, "replies": []}]}]}]}, {"body": "Nobody said anything about radar-proof stealth technology, but we all know where designers took inspiration.", "score": 3, "replies": [{"body": "[Brazilian 70's vehicles?](https://quatrorodas.abril.com.br/noticias/formigao-picape-brasileira-que-esta-43-anos-a-frente-da-tesla-cybertruck/)", "score": 1, "replies": [{"body": "I though F-117, but yeah. Brazillian truck could be too.", "score": 1, "replies": []}]}]}, {"body": "The body is 9mm proof, which they said. Everyone is window focused.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "shatter-proof is not the same as bulletproof. and anyway, bulletproof glass spider-webs when shot. \n\nsomething went wrong, clearly... i suspect maybe they had 'tested' the windows of that particular truck a few times already in the days prior, which may have weakened the glass. they mentioned that they'd thrown all kinds of stuff at it previously. the material itself in the ball-drop demo clearly demonstrated that it was quite strong. could be that in the process of cutting or otherwise shaping the pieces for the windows that it became compromised.  \n\nin any case, it's retarded that people keep mentioning bullet-proof windows because that's not any part of what they said or demonstrated.", "score": 1, "replies": []}]}]}, {"body": "Infidel proof?", "score": 3, "replies": []}, {"body": "Just don't fight any zeppelis and you'll be fine bro", "score": 1, "replies": []}, {"body": "I straight up wouldn’t put it past them to know it will fail but do it anyway in a presentation like that.", "score": 1, "replies": []}, {"body": "Looks like muskets are back on the menu boys!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 73, "replies": [{"body": "Yeah . Shitty technical 2.0", "score": 17, "replies": []}, {"body": "Good thing each Tesla forcibly joins a fleet of tracked vehicles you can never leave.", "score": 1, "replies": []}]}, {"body": "I honestly feel James Bond will end up killimg Elon Musk and blowing up thr Gigafactory.\n\nSo in other words, Puts.", "score": 93, "replies": [{"body": "Giving Tesla the perfect chance to roll out their self-driving executive. Calls.", "score": 24, "replies": [{"body": "Good day, Automatic_Llama. Happy Reddit Cake Day! 🍰🎈🎊\n\nYou've been a Redditor for 3 years!\n\n***\n\n^^^u/Automatic_Llama&#32;can&#32;[send&#32;this&#32;message](https://old.reddit.com/message/compose/?to=AnotherCakeDayBot&subject=Remove%20reply%20id:%20f8ht54b&message=For%20reference,%20this%20is%20the%20permalink%20to%20the%20parent%20comment:%20/r/wallstreetbets/comments/e0togh/buy_tsla/f8ht54b/)&#32;to&#32;delete&#32;this&#32;|&#32;View&#32;my&#32;profile&#32;for&#32;more&#32;info&#32;or&#32;PM&#32;to&#32;provide&#32;feedback", "score": -9, "replies": [{"body": "Fuck you piece of shit. You are God's cruelest mistake", "score": 7, "replies": []}, {"body": "Please fuck off.", "score": 1, "replies": []}]}]}]}, {"body": "TSLA the only halal automotive stock", "score": 26, "replies": []}, {"body": "Fighting globalist hegemony of USA while saving environment.", "score": 55, "replies": [{"body": "I might join them for this alone", "score": 1, "replies": []}]}, {"body": "False. Nothing will ever be more durable than the Toyota Hilux.", "score": 52, "replies": [{"body": "https://en.wikipedia.org/wiki/Toyota_War", "score": 18, "replies": [{"body": "**Toyota War**\n\nThe Toyota War (Arabic: حرب تويوتا‎ Ḥarb Tūyūtā, French: Guerre des Toyota) or Great Toyota War was the last phase of the Chadian–Libyan conflict, which took place in 1987 in Northern Chad and on the Libyan–Chadian border. It takes its name from the Toyota pickup trucks used, primarily the Toyota Hilux and the Toyota Land Cruiser, to provide mobility for the Chadian troops as they fought against the Libyans. The 1987 war resulted in a heavy defeat for Libya, which, according to American sources, lost one tenth of its army, with 7,500 men killed and US$1.5 billion worth of military equipment destroyed or captured. Chadian losses were 1,000 men killed.The war began with the Libyan occupation of northern Chad in 1983, when Libya's leader Muammar Gaddafi, refusing to recognize the legitimacy of the Chadian President Hissène Habré, militarily supported the attempt by the opposition Transitional Government of National Unity (GUNT) to overthrow Habré.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/wallstreetbets/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 20, "replies": []}, {"body": "So I've been reading this amazing book and it's talking about the chadian Libyan war, apparently the Libyans logistics were so good they could airlift an entire mechanised division ready to go on the other side. They did this quite frequently during the conflict. They still lost. Go figure.", "score": 2, "replies": []}]}, {"body": "True, but this thing can GTFO in a hurry, much faster that a Hilux. Will toast the other jihadists in the 1/4 mile.", "score": 4, "replies": []}]}, {"body": "no self respecting jihadist would be caught dead in that.", "score": 16, "replies": []}, {"body": "Awful lot of Tesla ™️ Superchargering stations in Afganiraqussianastan.", "score": 29, "replies": [{"body": "Awful lot of sun though", "score": 10, "replies": [{"body": "Praise the Sun", "score": 5, "replies": []}, {"body": "That solar panel on the roof gets you ~20 km per day, when it is not covered in sand and dust", "score": 4, "replies": [{"body": "They have technology for cleaning solar panels of dust", "score": 2, "replies": [{"body": "yeah... they don't have any water either.", "score": 1, "replies": [{"body": "[ok boomer ](https://www.greenbiz.com/article/robotics-startup-tests-water-free-approach-cleaning-solar-parks)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’m honestly beginning to wonder if this sub doesn’t control the market", "score": 23, "replies": []}, {"body": "This seriously could be used as a military vehicle. I think they will try for military contracts.", "score": 58, "replies": [{"body": "Not armoured enough. Shit would be shredded. We learned our lessons about light vehicles with negligible armor through the humvee. Shit gets shredded like no tomorrow and any IED is killing everyone inside. Oshkosh has the light segment on lock. This thing would only be feasible for logistical movements in completely protected areas. I see no reason why the military would order this for such a small use case.", "score": 20, "replies": [{"body": "So only usable for logistical movements in the US, Europe and pretty much every other non combat zone.", "score": 3, "replies": [{"body": "What logistical movements in the US do you think we would even use something this small for? We don’t use humvees to move shit either. We use LMTVs at the minimum for any real logistical operations. Humvees simply do not have the capacity to carry the sheer amount of bullshit the Army carries around.", "score": 4, "replies": [{"body": "Troops and all the stuff which currently gets pulled by humvees when going to aid after a natural disaster.", "score": 2, "replies": [{"body": "Lol @ thinking the National Guard can afford this. Fuck no they can’t lol they can hardly afford to pay out bonuses to their guys sometimes. Trust me buddy, the US military ain’t buying this truck.\n\nAlso, we would never use this to move guys and supplies in to natural disaster areas. We need operational readiness at all times and electrical vehicles take too long to charge.", "score": 3, "replies": []}]}]}, {"body": "What kind of \"logistics movements\" are you talking about?", "score": 2, "replies": [{"body": "You gotta get 4 people from point A to point B.\n\nCurrently that gets done a lot of the time with Humvees. This truck can do it just as well if not better because it's faster.", "score": -1, "replies": []}]}, {"body": "but why bother?", "score": 1, "replies": [{"body": "Cheaper than a new Humvee or any armored vehicle.\n\nBoth in purchasing and maintenance.", "score": 0, "replies": [{"body": "yeah,... no.", "score": 1, "replies": []}]}]}]}, {"body": "It's so quiet no one would hear it. Look at the shape, all angles it's already camouflaged against the terrain, And it has a ATV that's quiet as shit too. This could be a stealthy ass military vehicle I\nf they wanted it to be.", "score": -6, "replies": [{"body": "Maybe the odd shape was on purpose to make it invisible to radar", "score": 2, "replies": []}]}]}, {"body": "How do you charge it on a 5 week mission? Magic?", "score": 62, "replies": [{"body": "DD Batteries.", "score": 45, "replies": [{"body": "Duracell batteries *FTFY", "score": 1, "replies": []}]}, {"body": "How do you fill a gas vehicle in the middle of a desert? Expensive infrastructure.\n\nAnd also, did one vehicle solve all problems in all situations for the military? \n\nDon’t freakin but it for the “8week mission”\n\nBuy it for the other 90% of situations where it is cheaper to operate.", "score": 27, "replies": [{"body": "Not to mention the other potential plus sides like quiet operation and incredible acceleration.", "score": 3, "replies": []}]}, {"body": "Solar", "score": 29, "replies": [{"body": "Yeah just have a corps of Engineers following in tow for when a few rounds break the solar cells and it's charge efficiency drops by 90%.", "score": 37, "replies": [{"body": "Bulletproof glass yo", "score": 2, "replies": [{"body": "...cracks when shot at and creates areas of opaqueness that reduce sunlight transmission significantly. \n\nShould we add a convoy of MTRVs carrying replacement glass panels to the convoy?", "score": 3, "replies": [{"body": "Safelite Military Contacts secured.", "score": 4, "replies": []}, {"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What does reddit loves nucluar even mean... what angle are you even trying to play here lol.", "score": 3, "replies": []}, {"body": "Are you serious or do you actually think that a nuclear reactor could fit in the car?", "score": 2, "replies": [{"body": "You could make a nuclear battery like they use on sone spacecraft and rovers. But it would definitely be way to expensive and probably not powerful enough anyway. https://en.m.wikipedia.org/wiki/Atomic_battery", "score": 0, "replies": [{"body": "Desktop link: https://en.wikipedia.org/wiki/Atomic_battery\n***\n ^^/r/HelperBot_ ^^Downvote ^^to ^^remove. ^^Counter: ^^290466. [^^Found ^^a ^^bug?](https://reddit.com/message/compose/?to=swim1929&subject=Bug&message=https://reddit.com/r/wallstreetbets/comments/e0togh/buy_tsla/f8ix3tq/)", "score": 1, "replies": []}, {"body": "**Atomic battery**\n\nAn atomic battery, nuclear battery, tritium battery or radioisotope generator is a device which uses energy from the decay of a radioactive isotope to generate electricity.  Like nuclear reactors, they generate electricity from nuclear energy, but differ in that they do not use a chain reaction.  Compared to other batteries, they are very costly, but have an extremely long life and high energy density, and so they are mainly used as power sources for equipment that must operate unattended for long periods of time, such as spacecraft, pacemakers, underwater systems and automated scientific stations in remote parts of the world.Nuclear battery technology began in 1913, when Henry Moseley first demonstrated the beta cell. The field received considerable in-depth research attention for applications requiring long-life power sources for space needs during the 1950s and 1960s.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/wallstreetbets/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 1, "replies": []}, {"body": "That's not a nuclear reactor in the traditional sense but yes, they do exist and they are indeed extremely expensive and have very low power outputs.", "score": 1, "replies": []}, {"body": "Those nuclear batteries are literally powered by radiation.\n\nAnd they are completely unshielded. Which doesn't matter when you are on a different planet without any living thing close to your rover or probe.\n\nBut sitting a soldier right next to it for some time gets you a soldier with radiation poisoning.", "score": 1, "replies": [{"body": "On the flip side it could also get you a soldier with superpowers!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The military does their movements at night.", "score": 0, "replies": [{"body": "[deleted]", "score": 47, "replies": [{"body": "It gets 10-15 miles a day from solar, you can walk further per day", "score": 27, "replies": [{"body": "so why are cars not powered by people then", "score": 20, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Will there be a tea and crumpets ETF?", "score": 1, "replies": []}]}]}]}, {"body": "You think a solar powered vehicle can support 24 hour operations off-road? How do you conceal a solar panel? It’s not viable whatsoever at this time.", "score": 7, "replies": [{"body": "it's on the roof lmao", "score": -3, "replies": [{"body": "Yeah no shit.", "score": 6, "replies": [{"body": "You belong on this sub for sure lmao", "score": 5, "replies": []}, {"body": "you don't need to conceal it if it's part of the car you idiot", "score": -3, "replies": [{"body": "That's max 15mi/day charge. In order to \"fuel\" this bad boy you'd need a solar array AND a battery bank. You could use a genset, but then you'd still need fuel. Or you could just use what they already use and take advantage of current capabilities. \n\nThe military uses what is simplest. It's far simpler to provide fuel directly than to provide fuel to something that's going to charge that something.\n\nEdit: it would be fucking awesome if there was a use case for these, and maybe there is in a few situations. It is absolutely not going to replace current ground vehicles for a long damn time.", "score": 5, "replies": []}, {"body": "In what fucking world does the military not conceal their vehicles? You can’t expect to get a full charge with a camo net tossed over it. Especially not if they’re operating for weeks on end.", "score": 10, "replies": [{"body": "I agree with you", "score": 3, "replies": []}, {"body": "I assume you have never seen the Airforce? like every cargo plane has a massive generator (size of a shipping container) that keeps the plane running all day until it takes off again. They don't hide under Camo.\n\nThey could charge a fleet, nil issues.", "score": 3, "replies": []}, {"body": "Military order: 20k diesel powerplant swapped units, 5 standard, and 2 LS swapped units for the chief", "score": 2, "replies": []}, {"body": "Your argument is about as strong as a window against a metal ball", "score": 2, "replies": []}]}]}]}, {"body": "Do you think that there is enough power in a couple square meters of sunlight to power the truck for any significant amount of time? You might get enough to power the AC, lights, and radio, but that's about it.\n\nEdit: Just did the ballpark math. Being generous with a two square meter solar panel that is 25% efficient, it would take 100 hours to charge the smallest Model 3 battery. Not remotely feasible.", "score": 2, "replies": []}, {"body": "[removed]", "score": 2, "replies": []}, {"body": "And there's nowhere near enough solar cell area to give the battery any decent charge.", "score": 1, "replies": []}]}]}]}, {"body": "the military does not exclusively work at night", "score": 5, "replies": []}, {"body": "Always?", "score": 2, "replies": []}]}]}, {"body": "RTGs towed in trailers.  Have you seen the fuel logistics currently involved in the military?  You can have a single trailer that can supply fuel endlessly with no resupply, just at a slower rate.  It will be used in parallel and redefine tactical logistics\n\nedit: GE has a nuclear reactor able to fit on a lab desk and (from some napkin math I did when I read about it) able to fully recharge an EV in the magnitude of a couple days.  Imagine what can be engineered to fit in a box truck", "score": 8, "replies": [{"body": "The fuel logistics don’t require us to bring extra bvehicles and fragile gear out with us on multi-day/week movements.  If it’s solar panels it will be useless after a firefight when it’s inevitably shot or damaged somehow, if it’s carrying batteries now we have more gear to bring with us that in no way improves our mission capability and in fact detracts from it by having more gear to move and equipment to break down.  The military doesn’t care about the environment, it cares about being as lethal as it can be, using gas let’s it do that, being good for the environment is a bonus.\n\nA nuclear reactor might be far more efficient but I can almost guarantee it’s also far more fragile than bringing a few cans of fuel and far more dangerous to worry about in case you hit an IED or fire fight.\n\nWe don’t drive around paved roads with no worries like stateside.  You’re driving bumpy ass dirt “roads” worrying about an IED that will send a shockwave through your vehicle which could fuck up anything fragile.  There’s dust and sand flying everywhere eroding anything sensitive, occasional firefights where your vehicle can get peppered, and IEDs will also send shrapnel to any vehicle near the blast.\n\nSomeday we’ll probably use electric, but not for awhile.", "score": 12, "replies": []}, {"body": "You realise that RTGs give outputs of a few hundred Watts at most, right ? So basically nothing. They're also incredibly expensive as you have to harvest significant quantities of a single highly radioactive material.\n\nAnd that shit about GE, are you a bad troll or just clueless?", "score": 6, "replies": [{"body": "Ge is a good company and isn’t Enron- boomers", "score": 2, "replies": []}, {"body": "RTGs have been designed in scope for satellites and remote science expeditions(small and light). If we have electric vehicles suddenly there's a use case for a trailer sized unit.  \n\nI don't give a f about GE and it's viability as a company, the point is there's research being done into small portable nuclear power sources.", "score": 0, "replies": [{"body": "The idea of RTGs being released for public use is utterly ludicrous. As is the idea of personal, private nuclear reactors.\n\nDo you have no idea how dangerous it would be to release either a nuclear reactor or an RTG for public use? And no, I didn't say GE isn't viable as a company, I'm saying that your claim on them making a desktop reactor is hilariously wrong.", "score": 1, "replies": [{"body": "ah, you're right, I was mixing up the westinghouse evinci (which is about truck sized already) with something else.\n\nmy bad there.\n\nalso I'm not really talking about for public use, that was facetious, but I do think we'll see military use of the technology for ground support soon", "score": 1, "replies": [{"body": "The last place you want a nuclear reactor is in a war zone, especially a small, mobile one.", "score": 1, "replies": []}]}]}]}]}, {"body": "You're like the only sensible person on here. People talking about how hard it is to charge and EV.... have no supply chain logistics experience", "score": 3, "replies": [{"body": "What is an EV? \n\n\nExcuse me I am dumb.", "score": 5, "replies": [{"body": "EV stands for Effort Value and is the reason why your trained Pokemon are stronger than wild ones, cf.: https://bulbapedia.bulbagarden.net/wiki/Effort_values", "score": 19, "replies": []}, {"body": "Electric vehicle", "score": 1, "replies": []}]}]}, {"body": "If I learned anything from KSP, it’s that RTGs are friccin expensive.", "score": 1, "replies": [{"body": "They are also not radiation shielded.\n\nWhich doesn't matter when there is no human around to get poisoned by the radiation.\n\nBut that makes them a really bad idea to put on a vehicle that gets used on earth.\n\nAnd adding shielding to them makes them way to heavy.", "score": 1, "replies": [{"body": "you don't need much shielding, and you're going to be putting steel armor around it anyways", "score": 0, "replies": [{"body": "Uhm radiation shielding is directly correlated to weight. Heavier=better shielding.\n\nYou need a few metric tons of stuff for surround shielding. And 3mm of steel isn't nearly enough. Try 300mm.", "score": 1, "replies": []}]}]}]}, {"body": "Both that RTG and the GE reactor are completely unshielded. Which means that you can't use them around people, if you don't want them to get radiation poisoning that is, without adding a few metric tons of radiation shielding.", "score": 1, "replies": []}, {"body": "You have any idea how dangerous it is to tow an RTG around for kicks and giggles? Excluding the fact that it would take more than a week to charge a Tesla die to it's power output of a few hundred watts, a leaky RTG from a bullet would make Goiânia incident look like child's play. Let's not forget as well just how bad it would be if these things were stolen or \"accidentally misplaced\" as it so often happens with the US military. \n\nBad, bad idea.", "score": 1, "replies": [{"body": "Most RTGs have been small and light because they've been designed primarily for use in space.  There's a lot of possibility of scaling it up.\n\nNo, shooting one would not be a huge disaster.  It's a solid piece of fissile metal.  Blowing one up would cause a good amount of radioactive dust.  If they were stolen or misplaced it wouldn't be a big deal, they're not weapons grade material, they can't be turned into weapons grade material, they're just hot rocks.\n\nFor context most of the designs out there just have a couple kg of material, a chunk of hot metal the size of a grapefruit, surrounded by semiconductors", "score": 1, "replies": [{"body": "No RTGs are not made up of fissile materials. Most of the sources for RTGs fission byproducts but the vast majority are not good for fission themselves. RTGs power is very different from nuclear fission power. Nuclear fission splits atoms to create heat which is used to create steam for turbines to create power. RTGs use the heat given off by extraordinarily radioactive elements/materials for a direct conversion of heat to electricity.  It's extremely inefficient even with the newer tech out there. \n\nIn the past Sr90 and Pu238 were used by the Soviets and the US for their RTGs. Both are extremely toxic to humans. The several meters of top soil that were removed around Fukushima and Chernobyl powerplants were done because of elements such as Sr90. It gets into the food supply and is extremely difficult to get out. When you factor in the amount of radiation these units give off decades later it becomes even more of a concern. A few men in Georgia came across an old Soviet RTG powered by Sr90 and had no idea what it was. It took them awhile but they finally took it apart using screwdrivers and such. Even 40 years later they ended up with severe radiation sickness from the units.\n\nThe newer RTGs in the US use Po210 which have a idle temperature of 500C. Mind you there isn't as much need for shielding from radiation because so much of the decay is given off as heat but regardless this presents it's own challenges. Even the larger units that are about the size of say a home air conditioning unit in the US, only generate about 650 watts...when new! That's alot of real estate for not so much power benefit. You can barely run a gaming desktop on 650 watts let alone charge a Tesla.  Every year these units also degrade creating other challenges. \n\nSolar panels would be a better investment than an RTG for a desert environment...", "score": 2, "replies": []}]}]}]}, {"body": "The sun, obviously", "score": 3, "replies": []}, {"body": "Swappable batteries.", "score": 1, "replies": []}, {"body": "where do you get unlimited gasoline on a 5 week mission?", "score": 1, "replies": []}, {"body": "Just use a [portable charger.](https://www.toromontpowersystems.com/images/librariesprovider4/default-album/xq20-kw-generator-rental.jpg?sfvrsn=6e2291e3_0)", "score": 1, "replies": []}, {"body": "Ummm....you need to let your brain out of that concrete box.", "score": 1, "replies": []}, {"body": "What an odd question. It's like the supply logistics for something that's available anywhere on the earth is tougher than something that has to be pumped out of ground a million miles away and then tankered tdp where ever its needed...", "score": 0, "replies": [{"body": "Yes but fossil fuels are very energy dense, hence can be taken as reserve fuel very easily. A battery is actually about 100 less energy dense, (source below) so adding extra batteries isn’t feasible. Solar panels of moderate size along the truck will only generate 15 miles (source Elons Twitter) without even considering the extra weight of military gear.  \n\nHow do you propose you carry an extra 1000 miles of fuel? Take a generator and some oil? That kinda defeats the point \n\nhttps://www.aps.org/publications/apsnews/201208/backpage.cfm", "score": 5, "replies": [{"body": "So pack a fucking generator for emergency charging.  The truck will still have advantages like quiet operation and superior acceleration.", "score": 1, "replies": []}]}]}]}, {"body": "Military vehicle for what exactly?", "score": 7, "replies": [{"body": "Aesthetics.", "score": 9, "replies": []}, {"body": "To save his autistic 11/29 $420 calls", "score": 6, "replies": []}]}, {"body": "Seems appropriate for law enforcement also", "score": 10, "replies": [{"body": "Yeah, seems like a better use case for law enforcement than the army", "score": 1, "replies": []}]}, {"body": "As long as the enemy doesn't have any baseballs", "score": 6, "replies": [{"body": "10 lb baseballs made of steel", "score": 0, "replies": []}]}, {"body": "Mars.", "score": 1, "replies": []}, {"body": "Mmm non correlated terror bucks. Elon finally figured out how to get profitable: endless military boondoggle gravy.", "score": 1, "replies": []}]}, {"body": "Saudis? Or just PS", "score": 8, "replies": [{"body": "Yes.", "score": 4, "replies": []}]}, {"body": "You fucking animals rofl", "score": 7, "replies": []}, {"body": "It's rated for the weight, what's wrong with good sales for a company for a truck of peace bringers?", "score": 6, "replies": []}, {"body": "This aged well", "score": 8, "replies": []}, {"body": "Can i short ISIS ?", "score": 13, "replies": [{"body": "$ISIS", "score": 5, "replies": []}]}, {"body": "Wtf... I bet #KONY2012 got one too", "score": 11, "replies": [{"body": "whatever happened to Kony? Did he win the election?", "score": 6, "replies": [{"body": "I believe he bought $BYND calls during earnings and took his life...", "score": 6, "replies": [{"body": "$ROPE puts", "score": 1, "replies": []}]}]}]}, {"body": "Hope they aren’t depending on those bulletproof windows", "score": 18, "replies": [{"body": "Didn't go through...", "score": 37, "replies": [{"body": "But it did make it hard to see out of.", "score": 9, "replies": [{"body": "#BuT iT dIdN't Go ThRoUgH !1!!1", "score": 19, "replies": [{"body": "crowd bursts into applause", "score": 8, "replies": []}]}]}, {"body": "https://twitter.com/elonmusk/status/1198090787520598016?s=09", "score": 1, "replies": []}]}]}, {"body": "Cyber truck is a civilian APC. TSLA moving towards military contracting, gotta get ready to bet the house on the autistic Tony Stark.", "score": 15, "replies": [{"body": "He's giving the citizen run militia's a chance in a 1776 situation. Biohazard defense mode, bulletproofing, offroad capability, etc", "score": 1, "replies": []}, {"body": "I call bullshit. They only \"tested\" against a 9mm. Shits weak.", "score": 0, "replies": [{"body": "Well obviously they would scale up the armor for the military but it’s proof of concept. Fast, powerful, and self driving for convoys going 35mph for 10 hours", "score": 3, "replies": [{"body": "It's not self-driving.", "score": -1, "replies": []}]}]}]}, {"body": "I thought I was smart selling a strangle on TSLA but it's gonna moon on Monday when ISIS announces 1000 preorders on Twitter. Screenshot this.", "score": 11, "replies": []}, {"body": "Ugh the video games are gonna be so stupid when we have to shoot these types of cars", "score": 4, "replies": []}, {"body": "Calling in tactical EMP wave", "score": 3, "replies": [{"body": "...or, you know, just a good old fashioned Carrington Event.", "score": 1, "replies": []}]}, {"body": "Superchargers in Fallujah when?", "score": 3, "replies": []}, {"body": "Bro, Cybertruck technicals headass sound fabulous.", "score": 3, "replies": []}, {"body": "Using Electric Trucks to protect their oil... how ironic.", "score": 3, "replies": []}, {"body": "I saw this meme in Google search on Friday. Missed out on 20k karma🤦🏾‍♂️", "score": 3, "replies": []}, {"body": "How much were you able to buy?", "score": 3, "replies": []}, {"body": "The original was posted yesterday you reposting slut.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "What do you mean charging stations? Shit ton of gas + generator, they will never need charging stations.", "score": 12, "replies": [{"body": "why wouldn't they just get gas powered vehicles in that case", "score": 1, "replies": []}]}, {"body": "Hellooo? I guess you didn’t factor in that it’s solar powered?? In the desert??", "score": 24, "replies": [{"body": "Yeah an extra +15 miles a day is going to make a huge difference\n/s", "score": 9, "replies": [{"body": "that 15 miles a day is actually huge, what if a charging station is full? broken? what if your in the middle of a disaster and have no time to plan a route out that also has a charging station, suddenly your able to drive for FIFTEEN extra miles a day, this can help you alot, think about if phone got 10% extra charge slowly over the day.", "score": 1, "replies": [{"body": "No I’m totally for it for that aspect, alls I was sayin was that completely relying on solar power alone isn’t going to get you far. If it’s in addition to normal charging then heck yeah that’s sweet.", "score": 2, "replies": [{"body": "ah, alrighty then, the /s threw me off", "score": 1, "replies": [{"body": "Haha yeah my bad, the /s for sarcasm took me a bit to get used to as well", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": []}]}]}, {"body": "This one is nice", "score": 2, "replies": []}, {"body": "Fuck you retards at least now those kunts will be buying American! *Waves flag", "score": 2, "replies": []}, {"body": "fake and gay. hajis use hilux not this piece of shit.", "score": 2, "replies": []}, {"body": "Elon obviously protected the windows with a kinetic energy shield so it only works if the projectile is faster than 20 m/s.", "score": 2, "replies": []}, {"body": "The CIA on a road trip again...", "score": 2, "replies": []}, {"body": "I just don't get why the truck is so damn boxy. Like all they had to do was smooth the sharp corner at the top. Why the fuck is it a corner. Should be round.", "score": 2, "replies": [{"body": "They designed it around a manufacturing process. This is a giant piece of sheet metal with a battery, motors, and wheels", "score": 2, "replies": []}]}, {"body": "Impressed that the photoshop included the suspension", "score": 2, "replies": []}, {"body": "Well done OP...", "score": 2, "replies": []}, {"body": "Does it come with the Camel Tow package standard?", "score": 2, "replies": []}, {"body": "Like they have electricity", "score": 3, "replies": [{"body": "Sun: *exists*", "score": 2, "replies": [{"body": "Incidentally, they also sell panels.", "score": 1, "replies": []}]}]}, {"body": "I don’t think it will dethrone the Toyota Hilux", "score": 3, "replies": [{"body": "The Hilux has already been dethroned by ZX Auto in China. Their Grand Tiger truck actually has a *factory option* for installing a machine gun mount in the middle of the truck's bed.", "score": 5, "replies": [{"body": "Link please...\n\n...asking for a friend.", "score": 1, "replies": [{"body": "I don't have a link to buy one, [but there's an article with more info here](https://www.csmonitor.com/World/Global-News/2013/0426/Shanghai-auto-show-where-you-too-can-buy-a-machine-gun-ready-pickup)", "score": 1, "replies": []}]}]}, {"body": "This statement is Haram", "score": 2, "replies": []}]}, {"body": "YOLOQaeda", "score": 3, "replies": []}, {"body": "https://youtu.be/FnpQw9ZUdQU Drags the Ford like a toy.", "score": 3, "replies": [{"body": "Pretty heavy marketing ploy there, the Ford wasn't dragged like a toy, it just lost traction because they have tires on the CyberTruck specifically for this type of thing whereas the Ford likely has typical consumer wheels.", "score": 8, "replies": [{"body": "Don't even need special tires, any electric vehicle will always win this, because an electric motor gets the HP much faster on the street, which is all that matters", "score": 5, "replies": [{"body": "Sure, but a diesel might be able to catch up if it doesn't just immediately lose traction. Honestly it's a dumb way to compare the two anyway because you're never really going to actually pull a truck going in the opposite direction like this in a way that isn't just showing off an unrelated advantage, it's all marketing.", "score": 7, "replies": [{"body": "They towed that ford uphill bro", "score": -2, "replies": [{"body": "Yeah but what I'm trying to say is the physics of it isn't impressive because it highlights differences in the vehicle that don't matter and are unrelated in almost every facet. Also, I'd bet my account balance that the electric f150 would slaughter that triangle.", "score": 3, "replies": [{"body": "Tesla has battery superiority tho", "score": -2, "replies": []}]}]}]}]}]}, {"body": "Still has broken windows", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "A lot of people bought Hummer trucks and they sucked real bad.", "score": 10, "replies": [{"body": ">A lot of people\n\nso many that they went bankrupt in less than 10 years", "score": 1, "replies": [{"body": "Because the market changed. But at their peak they where huge.", "score": 1, "replies": [{"body": "at their peak they sold 34,000 units per year. that's nothing! and that's why they went bankrupt, not because something changed...\n\nas a comparison Tesla sold 250,000 units last year. and ford F150 alone sold almost a million units.", "score": 2, "replies": [{"body": "Alright bitch they weren't hug. I just remembered them being huge. But let's run the numbers because what you're saying is a little misleading. \n\nAccording to WSJ the H2 was selling 34000 and the market segment for luxury SUVs was smaller at 160000 units.\n\nAlso you're comparing the whole tesla line up to just one. If we go apples to apples, the model X sold 48000 and I can't find the numbers but presumably the industry is much larger. \n\nHummer went out of business because of rising gas prices and they took a hit in the recession.", "score": 2, "replies": []}]}]}]}]}, {"body": "I personally think the truck is decent, the glass needs work of course, im pretty sure they were testing it before the demo and that weakened it but it shouldnt be THAT weak, and im not a fan of the 3 people up front, but its a decent albeit weird design, There are only a few things wrong with it and i think people are just overreacting to it[like you], instead of calling people idiots you could also say whats wrong with the truck and what you would suggest to improve it.", "score": 6, "replies": [{"body": "https://twitter.com/elonmusk/status/1198090787520598016?s=09", "score": 1, "replies": [{"body": "One throw rarely shows you the strength, gotta do that at least 20 times before i call it good", "score": 1, "replies": []}]}]}, {"body": "Yeah reminds me of the grown ass men I know with kids and a wife that will still stand in line at 12AM for the latest iWatch/iPhone/iPad release---simply because it has an Apple logo on it. Obviously both Apple and Tesla make quality products but if they didn't, numbnuts will still buy it simply because of the logo at this point. This truck will still fail because its simply overwhelmingly atrocious.", "score": -1, "replies": []}, {"body": "They will sell less than 1000 globally.", "score": -5, "replies": [{"body": "Elon musk stated the have sold 147k preorders already", "score": 3, "replies": [{"body": "147k people have paid the fully refundable $100 preorder fee just for shits and giggles", "score": 2, "replies": [{"body": "*risk free stock manipulation", "score": 2, "replies": [{"body": "Interest free loan*", "score": 2, "replies": []}]}]}, {"body": "He obviously lied.", "score": 1, "replies": []}]}, {"body": "!RemindMe 2 years", "score": 2, "replies": [{"body": "I will be messaging you on [**2021-11-24 07:11:58 UTC**](http://www.wolframalpha.com/input/?i=2021-11-24%2007:11:58%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/e0togh/buy_tsla/f8hskx3/)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fe0togh%2Fbuy_tsla%2Ff8hskx3%2F%5D%0A%0ARemindMe%21%202021-11-24%2007%3A11%3A58%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20e0togh)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/c5l9ie/remindmebot_info_v20/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "This was pointless :( everyone else deleted their comments", "score": 1, "replies": []}]}]}]}, {"body": "Lol this post actually made me think of a significant point where electric could have a problem vs ICE trucks. Utility shit like a gun turret or more practically something run off hydraulics. Your average hydraulic PTO for crap like booms is around 30 HP. Battery life and running a 30 HP electric motor are not friends. That's 20 kW/hr for those keeping track.", "score": 1, "replies": [{"body": "I think you mean to say 20 kW, not kW/hr", "score": 3, "replies": [{"body": "Nah I did mean 20 kW/hr. Its more meaningful when talking batteries vs just saying 20kW since batteries are measured in watt hours. Its the same either way tho. 20kW operating for 1 hr = 20 kW/hr.", "score": 1, "replies": [{"body": "20kW operating for 1 hr is 20kWh, not kW/h. A watt hour is not watts per hour.", "score": 1, "replies": [{"body": "Indeed. Syntax error on my part. You sir are correct.", "score": 1, "replies": []}]}]}]}, {"body": "Thats why you run a diesel generator that takes up the entire backseat", "score": 3, "replies": [{"body": "Get those sweet cab fumes that EV lacks!", "score": 1, "replies": []}]}]}, {"body": "Pneumatic turret guns?", "score": 1, "replies": []}, {"body": "So this is what he meant by \"funding secured\"", "score": 1, "replies": []}, {"body": "less of a heat signature? They'd probably look way cooler war torn.", "score": 1, "replies": []}, {"body": "Mt 438xuk And u, 2 o9 99 98", "score": 1, "replies": []}, {"body": "Hol up terrorist already got the Tesla pick up?..this is rad more like madlad terrorist", "score": 1, "replies": []}, {"body": "All Elon needs to do is to sell these cars to them and tell the US military to chuck metal balls at it", "score": 1, "replies": []}, {"body": "Either TSLA will hit 50 or 500 judging by this pic alone. I'm buying calls.", "score": 1, "replies": []}, {"body": "/u/Hams36", "score": 1, "replies": []}, {"body": "It's always nice to see my two favorite autistic subs crosspost one another.", "score": 1, "replies": []}, {"body": "That's why it's bulletproof. Not the glass though.", "score": 1, "replies": []}, {"body": "My man Elon is out here raking it in because of all these memes. It’s only days until they’re getting brand awareness from ISIS beheading videos on LiveLeak.\n\nLet’s ride this wave boyz 🏄‍♂️", "score": 1, "replies": []}, {"body": "Imagine the footage of ISIS using a fleet of Cyber Trucks instead of shitty Toyotas? Shit would look like Metal Gear Solid 4", "score": 1, "replies": []}, {"body": "How did they get one before us?!", "score": 1, "replies": []}, {"body": "Oh $hit Syrian Turk outside the base used car lot.", "score": 1, "replies": []}, {"body": "Buy calls for 420. Also toss your money at a lawnmower turned over.", "score": 1, "replies": []}, {"body": "I approve.", "score": 1, "replies": []}, {"body": "Keep your bomb making High and your carbon footprint lower", "score": 1, "replies": []}, {"body": "Put $TM (Toyota Mobile) lol, tesla has the high ground", "score": 1, "replies": []}, {"body": "Cam someone start kidnapping elon next so he can be ironman", "score": 1, "replies": []}, {"body": "Until Toyota comes out with an electric truck, ain’t no terrorist gonna be ridding in one", "score": 1, "replies": []}, {"body": "Elon stole the design and will be sued. Short tesla everyone.. https://jacobjensendesign.com/logicar", "score": 1, "replies": [{"body": "Damn its like they 3D scanned that bastard.", "score": 1, "replies": []}]}, {"body": "Cries in Hummer", "score": 1, "replies": []}, {"body": "r/shittytechnicals", "score": 1, "replies": []}, {"body": "r/shittytechnicals", "score": 1, "replies": []}, {"body": "Chances are they won't purely due to the high cost and high electrical need. There are cars that are beefier than the Tesla and they don't get used at all.", "score": 1, "replies": []}, {"body": "The IS endorsement worked great for Toyota.", "score": 1, "replies": []}, {"body": "That truck's just too gimicky to be taken seriously.", "score": 1, "replies": []}, {"body": "Looks like CTF mode in Halo Reach multiplayer online.", "score": 1, "replies": []}, {"body": "oo a ZPU/KPV, a good choice", "score": 1, "replies": []}, {"body": "Funny thing is, they're never gonna get away from their hometown. Shit's gonna stop working in like 3 days.", "score": 1, "replies": []}, {"body": "Merica is why I’m right MERICA! We have democracy! NAVY TEAM 6!!!! Come on. We CREATED THE NUKE. WE CREATED THE IPHONE! We created the xbox all the best inventions come from MERICA!", "score": 1, "replies": []}, {"body": "TSLA is a brand of base layers. (Well, in Europe they advertise as Tesla, but on Amazon.com it's TSLA)", "score": 1, "replies": []}, {"body": "Ad sponsored by ford", "score": 1, "replies": []}, {"body": "*gets hit by a melee attack*\n\n\nDeath to those infidels in the west!!!", "score": 1, "replies": []}, {"body": "Congrats on being on the no-fly list", "score": 1, "replies": []}, {"body": "*Salil al-sawarim starts playing*", "score": 1, "replies": []}, {"body": "LMFAO XD", "score": 1, "replies": []}, {"body": "Isis going progressive to be carbon neutral", "score": 1, "replies": [{"body": "There is nothing carbon neutral about 100k shitboxes. The use of fossil fuels is critical to every single stage of this product's development and life cycle. You know, like their literal slave labor blood lithium in their batteries, which uses massive amounts of fossil fuel to mine and process.  And even Tesla's superchargers don't use renewable, lots of time you can see diesel generators running at supercharging stations.. Most of the rest are fueled by... coal.  Which makes the final product about <10% more efficient than a similarly priced ICE vehicle. \n\n\nAnd I'm sure Musk's daily commutes on his massive g650 private jet are very very green. He often has the jet fly from one airport to another within the same city just so it's closer drive for him. Very green.  So are the 5 mansions he owns all within walking distance of each other. The guy's daily carbon footprint is larger than some small countries.\n\nApartheid boy is the biggest fraud I have ever seen.", "score": -1, "replies": []}]}, {"body": "Yeah time is changing! Now we talking conscious terrorism!!!! 😁", "score": 1, "replies": []}, {"body": "Soon all our streets will be war zones. Buy $TSLA", "score": 1, "replies": []}, {"body": "Putting that armor glass to good use I see", "score": 1, "replies": []}, {"body": "When this baby hits 88mph you're gonna see some serious shit.", "score": 1, "replies": []}, {"body": "Isn't this mine ? 😂", "score": 1, "replies": []}, {"body": "Isn’t this how Ironman started?", "score": 1, "replies": []}, {"body": "I can already see Mexican cartels posting on Instagram with this car.", "score": 1, "replies": []}, {"body": "How the fuck do legit brokerages handle it?\n\n\nOhhhhhh! That’s why I’m sure that’s only 2 meters high. It’s not a dip\n\nYou're supposed to buy the dip. It's a BOGO sales. Buy the 1st dip & you'll get the 2nd one free.", "score": 1, "replies": []}, {"body": "The new Toyota Hilux? I'm looking forward to the shitty technicals", "score": 1, "replies": []}, {"body": "Buy it, use it for?\"", "score": 1, "replies": []}, {"body": "this is how iron man started", "score": 1, "replies": []}, {"body": "Toyota will be happy to be replaced!", "score": 1, "replies": []}, {"body": "Wait until OCP orders in bulk", "score": 1, "replies": []}, {"body": "Where would the terrorists plug it in though, when all they have is oil?", "score": 1, "replies": []}, {"body": "US backed death squads only like reliable cars. Hence all the Toyota trucks. Good luck with a half baked engineering lemon shitbox like that.", "score": 1, "replies": []}, {"body": "bullet proof", "score": 1, "replies": []}, {"body": "This was one of the first things I thought of sadly I don't have the guts to make an actual joke about it.", "score": 1, "replies": []}, {"body": "$TSLA is now on the arospace and defense index.", "score": 1, "replies": []}, {"body": "Ah a fellow r/shittytechnicals subscriber", "score": 1, "replies": []}, {"body": "The source actually [https://twitter.com/kremen\\_x/status/1197807959075622913](https://twitter.com/kremen_x/status/1197807959075622913)", "score": 1, "replies": []}, {"body": "Cybertechnical", "score": 1, "replies": []}, {"body": "Dont understand why it isn't painted black or white or any color...", "score": 1, "replies": []}, {"body": "I’m thinking of buying this truck just for the meme potential.", "score": 1, "replies": []}, {"body": "r/shittytechnicals", "score": 1, "replies": []}, {"body": "Also, this is going to be the most wrapped car in history.", "score": 1, "replies": []}, {"body": "This was the work of David Einhorn for sure.", "score": 1, "replies": []}, {"body": "Wonder if terrorists got their hands on a Tesla if Elon musk would be able to remotely disable it", "score": 1, "replies": []}, {"body": "Say what you will about the truck, but I feel like they will be everywhere in cities like Atlanta, Denver, Dallas, Houston, etc in a couple years. Rural areas and northern cities prolly not so much", "score": 1, "replies": []}, {"body": "Not at $333.", "score": 1, "replies": []}, {"body": "The slow ramp really gets their dicks hard.", "score": 1, "replies": []}, {"body": "The new isis ion cannon", "score": 1, "replies": []}, {"body": "Am I the only one who actually likes this truck orrrrr", "score": 1, "replies": [{"body": "Yeah I have no idea why people are complaining so much, like if they don't like the look of it, okay, don't buy or pay attention to them lol\n\nI'm right there with you, I think it looks rad as hell.", "score": 2, "replies": []}]}, {"body": "Windows aren’t broken? \n\n\n\nI’m wet daddy", "score": 1, "replies": []}, {"body": "You know.... in this light... it doesn't look that... ba... nah it still looks like shit. Elon you need to stop hitting those doobies", "score": 1, "replies": []}, {"body": "Allah-Truckla", "score": 1, "replies": []}, {"body": "Expand the TAM smart", "score": 1, "replies": []}, {"body": "Just because you are waging Jihad against the Western Imperialists doesn't mean you aren't concerned for the environment...", "score": 1, "replies": []}, {"body": "That thing squats a lot.", "score": 1, "replies": []}, {"body": "John Deere tractors are next", "score": 1, "replies": []}, {"body": "Goddamn, that is one ugly vehicle. \n\n\nI want a boomerang I can drive!", "score": 1, "replies": []}, {"body": "Terrorism Infraction; offense.\n\nDuring the play, Zero Carbon Emissions; offense.\n\nThis penalty is offset.", "score": 1, "replies": []}, {"body": "Sold, I will take 6", "score": 1, "replies": []}, {"body": "Also used to deploy swarms of lethal drones", "score": 1, "replies": []}, {"body": "The Toyota hilux has some competition?", "score": 1, "replies": []}, {"body": "That suspension is about to EXPLODE", "score": 1, "replies": []}, {"body": "What the french toast 👽👽👽", "score": 1, "replies": []}, {"body": "So what you’re saying is $TSLA will be the next $TM?", "score": 1, "replies": []}, {"body": "The quality is better with the Toyotas they’re using.", "score": 1, "replies": []}, {"body": "This does have an underlying meaning tho... like the hummer this would perform very well for military use", "score": 1, "replies": []}, {"body": "I didn’t realize this is the first step to the Halo Warthog", "score": 1, "replies": []}, {"body": "Ah the Frank's Fluids approach", "score": 1, "replies": []}, {"body": "I agree, a 30 mm tungsten core auto cannon would be a nice inclusion on the cybertruck, you know, for self defence.", "score": 1, "replies": []}, {"body": "Pull out Toyota Hilux TTM sales to project TESLA sales.", "score": 1, "replies": []}, {"body": "Wolf cola", "score": 1, "replies": []}, {"body": "Oh fuck this is funny!!! 😂😊", "score": 1, "replies": []}, {"body": "Future Toyota Pickup", "score": 1, "replies": []}, {"body": "Short $TM, terries are going green", "score": 1, "replies": []}, {"body": "It's cool, Musk is building a back door for the military. You can remote control them right into the bullseye.", "score": 1, "replies": []}, {"body": "r/shittytechnicals", "score": 1, "replies": []}, {"body": "I saw the same picture but with trump and his inbred supporters.", "score": 1, "replies": []}, {"body": "Has anyone asked the question if someone gets in a wreck and it catches fire, how in the world will Firefighters pull anyone out with Jaws of Life?", "score": 1, "replies": []}, {"body": "no", "score": 1, "replies": []}, {"body": "I cant wait to see this on facebook. 10/10", "score": 1, "replies": []}, {"body": "I love my Model S more than I've ever loved a car. I've been a big fan of Tesla since 2014. But I have no idea what Elon was thinking with this truck design. Holy shit.", "score": 1, "replies": []}, {"body": "Nooooow I get it...", "score": 1, "replies": []}, {"body": "Only non autistic thing I have seen here", "score": 1, "replies": []}, {"body": "Is this Tesla propaganda?", "score": 1, "replies": []}, {"body": "I knew Tesla would jump but I didn't have any reserve funds to get. Rip", "score": 1, "replies": []}, {"body": "Where are they going to hook up their Teslas in the desert?", "score": 1, "replies": []}, {"body": "Where they going to charge that in the middle of the desert, talk about range anxiety.", "score": 1, "replies": []}, {"body": "Diversifying their clientele. Smart.", "score": 1, "replies": []}, {"body": "How is ISIS going to charge their truck lol\n\nGood luck finding parts to do the repair", "score": 1, "replies": []}, {"body": "Look at all the autists buying TSLA at the ATH. TSLA puts are the galaxy brain play.", "score": 1, "replies": []}, {"body": "u/1RONYMAN", "score": 1, "replies": []}, {"body": "This is just sad. While our country is going to shit, investigating our President for crimes that FAR eclipse anything unethical that any President has done - y’all are making jokes about terrorists using our newest technology to slaughter innocents? No wonder the worst of our country won.", "score": 1, "replies": [{"body": "The worst of your country won when the British were defeated. Everything Americans are taught about that even is bullshit.", "score": 0, "replies": [{"body": "Thank you for bringing this up! Many revolutionary leaders in the colonies were upset with the British because they wanted to limit the slave trade. This made many wealthy aristocrats upset because they derived much of their income from slavery. Theres the famous painting of all the signers of the Declaration of Independence in 1 room, but someone in the present put red dots on everyone who was a slave owner - essentially 95% of the room. Another point that is misleading in american history is the tea policies British enacted on the American colonies. They forced colonists to purchase their tea instead of the black market tea that revolutionary leaders were profiting off of. The tea embargo left lower & middle class colonists much better off than purchasing smuggled tea from the Adams’.", "score": 1, "replies": []}]}]}, {"body": "Hello, yes? officer?   \n\n\nTHIS FUCKING POST RIGHT HERE.", "score": 1, "replies": []}, {"body": "r/shittytechnicals", "score": 1, "replies": []}, {"body": "I gave u silver give me upvotes", "score": 1, "replies": []}, {"body": "Why does this sub hate Tesla so much? Do you know how much fucking money I've made off of Elon? It's like bot investing in Edison. History will declare you all morons.", "score": 1, "replies": []}, {"body": "Considering that assault truck killing 80+ in France, and this one going from 0-60 so quickly...ironically, the pic doesn't seem far off either.", "score": 0, "replies": []}, {"body": "Chill bro wtf is this", "score": -3, "replies": [{"body": "I think you took a wrong turn homie, best go back the way you came in.", "score": 5, "replies": []}]}, {"body": "I laughed at this more than I should have", "score": 0, "replies": []}, {"body": "In all seriousness, the flat edges allow it to deflect radar, and considering its bulletproof, its actually a very good assault vehicle.", "score": 0, "replies": []}, {"body": "They fabricated a coup in Bolivia for this shit.", "score": 0, "replies": []}, {"body": "Please tell me this picture is real. The car looks exactly like the type of armored vehicle that would be carrying HVTs to the green zone in Iraq...", "score": 0, "replies": []}, {"body": "electricity is not reliable in war torn 3rd world country", "score": -1, "replies": [{"body": "The words:\n\nSolar panel roofs", "score": 3, "replies": [{"body": "And gas powered generators", "score": 1, "replies": []}]}]}, {"body": "No side mirrors. Fucking fail", "score": -1, "replies": []}]}
