{"title": "APPLE DD INSIDE", "selftext": "[deleted]", "id": "dqnsa9", "created_utc": 1572717450.0, "score": 433, "upvote_ratio": 0.96, "num_comments": 158, "comments": [{"body": "Also white girls do not go to sporting events to watch sports it seems.", "score": 264, "replies": [{"body": "[deleted]", "score": 153, "replies": [{"body": "My imaginary girlfriend does that too. So annoying but I love her.", "score": 114, "replies": [{"body": "You're just making up that imaginary girlfriend", "score": 50, "replies": [{"body": "I wish I had an imaginary girlfriend, I'm *so disappointed*. 😢", "score": 10, "replies": []}, {"body": "No she just goes to a different school. You haven't heard of it, it hasn't been made up yet.", "score": 3, "replies": [{"body": "SHE MOVED TO CANADA AT THE END OF THE SUMMER!", "score": 3, "replies": []}]}]}]}, {"body": "Those games aint gonna be $10 anymore lmao", "score": 17, "replies": []}, {"body": "Yeah she eats heaps of popcorn when I take her out too", "score": 10, "replies": []}, {"body": "Long popcorn", "score": 4, "replies": []}, {"body": "She could be taking you to target to do the same, so take the win... 😂😂😂", "score": 1, "replies": []}, {"body": "Popcorn at the movies here is a small fortune.", "score": 1, "replies": []}]}, {"body": "All about that insta\n\n\"Oh hey I'm having a blast at the <insert team here> game life is good :)\"\n\nMeanwhile they have no idea who the away team is or what the score is too busy on social to be social.\n\nOk boomer. There now you cant say it.", "score": 37, "replies": [{"body": "You forgot the part where they leave immediately after making the insta post", "score": 18, "replies": [{"body": "Step 1.) Spends 10 minutes snapping selfies for insta post  \nStep 2.) Stares at phone for next 20 minutes seeing who hearts her insta post  \nStep 3.) Asks for ::insert stupid-expensive ballgame snack that you don't enjoy::  \nStep 4.) Eats a couple bites of said snack and then tells you it's not good  \nStep 5.) Says \"This is boring, let's go\"", "score": 29, "replies": [{"body": "\\#livingmybestlife", "score": 14, "replies": [{"body": "Ain't going back and forth with you bitches!", "score": 0, "replies": []}]}]}, {"body": "I know so many people who just leave at the end of the first quarter, granted we are usually destroying but still its a fun event and you should stay for the whole time if you are posting about it on social media.", "score": 1, "replies": []}]}, {"body": "Haha Boomer just let corporations harvest data and develop crippling depression from fomo\n\nEdit: this guy didn't even post a Snapchat story drinking last night bet he didn't even go out and waste a paycheck on poison fucking BOOMER 😂😂😂😂", "score": 9, "replies": []}, {"body": "Very very true, sad really.", "score": 1, "replies": []}, {"body": "If a  Boomer say it, do it make it less troof?", "score": 1, "replies": []}]}, {"body": "...gamers rise up?", "score": 3, "replies": []}, {"body": "100% but this was already known", "score": 2, "replies": []}, {"body": "Most are there long enough for a cute selfie in their team hat, and maybe a few crowd shots. After that, uninterested and ready to go by the 4th inning. Of course there's exceptions...", "score": 1, "replies": []}, {"body": "Definitely not sec football", "score": -1, "replies": [{"body": "Poor sample, most of those people are Upper-Middle class", "score": 3, "replies": []}, {"body": "Hi, white girl that spends $1500/ every year on plane tickets, game Tix ect to go see SEC football here", "score": 3, "replies": [{"body": "When I was in the student sections back in my day, the girls would all leave at half time if they even made it in the stadium to begin with.\n\nOK well that was also true for a lot of the dudes as well.", "score": 3, "replies": [{"body": "To be fair, I couldn't stand sports when I was in college.", "score": 1, "replies": []}]}, {"body": "Correction: Whose dad spends $1500", "score": 5, "replies": [{"body": "My dad wouldn't know how football works even if he got hit in the head with the actual ball. I forget this is mostly little kids here used to their parents buying them stuff", "score": 1, "replies": []}]}, {"body": "As long as it's not to watch Bama, you can stay", "score": 1, "replies": [{"body": "Well,it was nice talking to y'all. ;)", "score": 2, "replies": [{"body": "War. Damn. Eagle.", "score": 1, "replies": [{"body": "Oh gawd.", "score": 2, "replies": [{"body": "I'm a Jets fan too, don't worry I'm used to disappointment.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "lol what?", "score": 1, "replies": []}, {"body": "What? White girls are the reason I wasted $40 dollars on an SEC football game just to leave before halftime.", "score": 1, "replies": []}]}]}, {"body": "What brand of stylish cases? We are leaving money on the table here", "score": 100, "replies": [{"body": "Most have been simple metallic colors like a metallic pink or beige color. And the other type seems to be frilly flower types made out of rubber/plastic", "score": 52, "replies": [{"body": "BRAND SON WE NEED DETAILS", "score": 85, "replies": [{"body": "IM NOT EQUIPPED FOR THIS LEVEL OF ESPIONAGE", "score": 129, "replies": [{"body": "Some of them also  get the kind where it has the glitters that move around in a strange liquid. Some get the \"gold\" case also metallic seems popular \n\nCan you imagine if they start getting faux-wood cases? I bet that could be the world's worst trend soon.\n\nOr nah more likely, they will get \"marble\" or \"granite\" cases I bet we'll see that next.", "score": 16, "replies": [{"body": "It never occurred to me they could start using high quality building materials for designer cases.\nThat’s one hell of an open market", "score": 13, "replies": [{"body": "Well also I mean the golden cases aren't made of gold.\n\nSo there could be actual marble cases, which would be dope, but other people might just get fake marble, like faux marble.\n\nlmao maybe a middle market with Quartz cases.\n\nIf I wasn't really lazy I could make a business of this", "score": 4, "replies": [{"body": "Haha yeah, I knew what you meant on the gold cases. \n\nI think it would be marketing that would be the key to get sales, interesting idea for where the accessories market could move", "score": 2, "replies": [{"body": "Woah what about a phone case that makes you look like you have the newest model of iphone?\n\nAnd you can fit it on an android phone...", "score": 7, "replies": []}]}]}]}, {"body": "I've got a leather phone case. Feels good man", "score": 2, "replies": []}, {"body": "They already selling the faux marble and granite cases at urban outfitters you old fuck.", "score": 2, "replies": [{"body": "lmao imagining going to urban outfitters what is that winners for young people?", "score": 1, "replies": [{"body": "Wtf is winners?", "score": 2, "replies": [{"body": "like urban outfitters for boomers", "score": 3, "replies": []}]}]}]}]}, {"body": "only upvoted for the word espionage", "score": 3, "replies": []}, {"body": "Just bump into them, spill your drink all over them and knock the phone out of their hand. Pick their phone up while they're distracted and see what type of case they have. Easy.", "score": 2, "replies": []}]}]}, {"body": "Kate Spade", "score": 1, "replies": []}]}, {"body": "I’m quite sure the kiosk in some failing mall doesn’t trade on the market.", "score": 6, "replies": []}]}, {"body": "I’m impressed you left the house. I just stay indoors and make bets based on what retards on the internet tell me.", "score": 41, "replies": [{"body": "So many retards - outnumber white girls with iPhones!", "score": 4, "replies": []}, {"body": "I wonder if Wallstreebets is wrong about something more than just random chance. Maybe if you consistently did the opposite bet you would get ahead, if only you had a bankroll big enough to weather the times Wallstreetbets was right about something.", "score": 1, "replies": []}]}, {"body": "Excellent DD, will get Apple puts Monday within range of my Personal Risk Tolerance", "score": 58, "replies": [{"body": "GUH", "score": 37, "replies": []}]}, {"body": "There are no white women that use android", "score": 20, "replies": [{"body": "Most women whether they be white or non white use men ! The iPhone's are used by them to tell other women how they are \"using\" their men to their best advantage !", "score": 9, "replies": [{"body": "Those women with androids are screaming for help. It's like an SOS.", "score": 2, "replies": []}, {"body": "Now this sounds like l2fmw", "score": 2, "replies": []}]}]}, {"body": "I mean, have you honestly ever seen a white woman ever be proud of having anything other than an iphone?", "score": 16, "replies": [{"body": "yes lululemons \n\nI bought a bit of that stock because my friend said the men's clothes were amazing and he regretted trying it on because it was so comfortable but a bit out of his budget", "score": 11, "replies": [{"body": "The men's clothes are amazing. They are also expensive.", "score": 7, "replies": [{"body": "And gay?", "score": -4, "replies": [{"body": "Does it matter if you look and feel fantastic?", "score": 8, "replies": [{"body": "Objectively?   No", "score": 1, "replies": []}]}, {"body": "Gays outnumber straights. Just look at this sub\n\nSo solid business choice", "score": 2, "replies": [{"body": "I wasn't judging, but the negative reaction on my comment was very telling.", "score": 2, "replies": [{"body": "Lol no kidding \n\nIf anything we're super progressive to be a part of the biggest gay community on the internet", "score": 2, "replies": []}]}]}]}]}, {"body": "Hell. Yes. There’s a lotta money in leggings.", "score": 3, "replies": []}, {"body": "Their ABC Tall pants are tailor made for me. I have four pairs in different colors and rotate through them on a daily basis as a sub in for slacks. I’ve replaced couple of them from the clearance racks at 2 years, after weekly washes. If they ever announce they are gonna stop making them or they go tits up, I’m gonna hoard a few.", "score": 1, "replies": [{"body": "Wow they look nice enough to substitute slacks? Could you wear them at a Keg restaurant for example? What about at an average office?\n\nSecond question, do they have a version for warm weather that will keep you cool?\n\nInstead of investing in a stock, I might invest in a couple pair of these pants lol", "score": 1, "replies": [{"body": "I wear them year round, slipping in a jeans on Friday. It does a good enough job to shifting the temps for a hairy guy like me, Works out even for casual hikes. It’s help me minimize my closet. All thanks to walking in with my then girlfriend during her yoga phase.", "score": 3, "replies": [{"body": "Thank you this is some great advice and I appreciate it.\n\nDo you ever do \"hanging leg raises\" for ab work? I was hoping the ABC technology could make these pants perfect for this exercise", "score": 1, "replies": [{"body": "I don’t think I’ve ever thought of wearing these to the gym as I’m more of a shorts guy plus these are my office slacks. They have different versions for ABC like jogger etc that use the same material but with a fit specific for that function.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "I seriously don't get the hype, I hated my iPhone from day one and couldn't wait to get a new phone, it's just such a piece of crap.", "score": 2, "replies": [{"body": "What did you hate about it?", "score": 3, "replies": [{"body": "I couldn’t  make an *animated* hentai lock screen.", "score": 15, "replies": []}, {"body": "Main thing was that it was very slow from the start. And it just kept getting slower. I can do a lot more on my cheaper pixel.", "score": 1, "replies": [{"body": "Odd, we’ve had the opposite experiences — my android phones (Samsung) kept getting slower and my iPhones have been fast.  Maybe pixel would have been a different experience", "score": 1, "replies": []}]}]}]}]}, {"body": "Recent college grad: majority of college kids have iPhones and other Tim Apple products. However I went to a prestigious (aka expensive) school and majority of these kids came from households  incomes above $200k. So my population sample is atypical for the US.", "score": 13, "replies": [{"body": "My school definitely isn't just rich kids and at least 80% of everyone (and that's a conservative guess) have a mac and iPhone.", "score": 6, "replies": [{"body": "Not surprising. And our generation will continue to buy them at least the next decade, as it has become an identity within our generation.", "score": 4, "replies": [{"body": "OTOH kids can drop brands as easily as they pick them up.", "score": 3, "replies": []}]}]}, {"body": "Exactly...shitty sample \n\nWorking class mainly use Android", "score": 2, "replies": [{"body": "The working class are also buying cheap phones and holding onto them for as long as possible.  Meanwhile I see people working at McDonald’s with Apple watches. Apple has perfected consumerism and many people are perpetually getting the newest iPhone through their leasing/financing programs. However, Apple and the iPhone have reached market saturation imo", "score": 11, "replies": [{"body": "True.....these financing programs that charge dumbasses 29.99 percent interest need outlawed, it would stop much of this. It is USERY.\n\nUSERY in my state is outlawed. In state banks can't charge over 10 percent interest. No Payday loans in Arkansas", "score": 1, "replies": [{"body": "Don’t you mean usu—\n\nWait, Arkansas. Never mind.", "score": 5, "replies": [{"body": "\"Never let an Arkansas tease go unspoken\"\n\n-Mark Twain \n🤓", "score": 2, "replies": []}]}]}, {"body": "True. I've seen Potbelly and McDonald's employees wearing AirPods. Most Americans want Tim Apple products, whether they can afford them or not.", "score": 1, "replies": []}]}]}]}, {"body": "But are they new iphones.", "score": 25, "replies": [{"body": "There are a lot of big phones in small hands, I’m starting to get delusional guessing which phone is which release. I think I’m seeing mostly iPhone 8’s like 30-40%", "score": 33, "replies": [{"body": "i cant even tell the difference anymore in samsungs or iphones at a glance.", "score": 11, "replies": [{"body": "Well I’m scalping tickets so they are walking right by me, I can see up close and personal", "score": 29, "replies": [{"body": "Small camera, 6/6S. large rear cam(s), metal back, iPhone 7. large single cam/Dual cam horizontal, glass back, iPhone 8. iPhone X Has verticle camera, and same antenna lines as 8 model, and symetrical grille at the bottom. XS has non symetrical grille, and extra antenna lines. Any Gold X is an XS. If in case, can't tell that well. If a 6/6S is in a case and you cannot tell the difference, look at the rear camera. The 6 has a grey circle around the cam lense under the glass, the 6S does not. Need more info?", "score": 1, "replies": []}]}]}, {"body": "Tell me more about these small hands.", "score": 1, "replies": []}]}]}, {"body": "Also almost everyone who owns an iPhone owns earpods and the watch", "score": 7, "replies": [{"body": "Listen to me. I have AirPods, and they don’t fit in my ear, I don’t even use them. I have a watch. I have an iPhone 11 as my personal phone, and an iPhone 8 as my work phone. I do 100% of my work on an iPad Air pro. I watch 100% of my media from my Apple TV. \n\nOnce you get one, You might as well dive in.", "score": 5, "replies": [{"body": "Kinda like once a girl does anal porn once, might as well shove 8 dicks up there", "score": 14, "replies": [{"body": "Can you stop saying that Mom", "score": 11, "replies": []}]}]}, {"body": "DD anecdotally...yes I do.", "score": 1, "replies": []}]}, {"body": "Go Gators.", "score": 8, "replies": [{"body": "I like how you put a period instead of an exclamation mark.", "score": 7, "replies": [{"body": "It was greatly misplaced confidence in my team, it would seem.", "score": 3, "replies": [{"body": "It was indeed a sad day.", "score": 1, "replies": []}]}]}]}, {"body": "The US Apple market share is publicly available data... The growth is gone in America. The real numbers we want are international numbers. IDGAF about the US iPhone numbers.", "score": 8, "replies": [{"body": "I’m college student in Korea.\nEvery girl in here has iPhone as well.\nI think Apple has something particular \nsensitivity to girls like pheromone or something lol.", "score": 11, "replies": [{"body": "I'd believe that. Korea is also heavily intertwined with the US though. For the cultural differences the US and Koreans are pretty similar.", "score": 3, "replies": [{"body": "Sweden here. I have one (1) iPhone and zero (0) Android phones in active use. Thus I conclude that the Apple marketshare in Sweden is 100%, based on sample-based statistics.", "score": 9, "replies": []}]}]}, {"body": "Very true.  Some of these other countries probably have 1000 to 1 android to iPhone ratios.  \n\nBut as an Apple shareholder it is reassuring to see that the people with money almost always choose the iPhone.   It seems to be the best product available.", "score": 6, "replies": [{"body": "The argument for Apple is services growth going forward. That's not evident from people just holding the device though.", "score": 3, "replies": []}, {"body": "It's more about the brand than the quality of the product. Smart phones are all pretty much the same.", "score": 2, "replies": []}]}]}, {"body": "so to continue off the counting, i've counted around 273 iphones vs 61 android phones in my stats class. think this is good grounds to say that LONG AAPL", "score": 4, "replies": []}, {"body": "They have 87% of the high school population", "score": 3, "replies": []}, {"body": "Go to any universities nearby. It's really hard to find anyone using an android phone.\n\nApple market share in the US is something like 55% but it really feels like 90%. Asians seem to love Samsung phones tho", "score": 3, "replies": []}, {"body": "There's been reports for years of like 85% of teens are using iPhones, and 90% of teens expect their next phone to be an iPhone. When a kid makes a big deal about getting an android instead of an iphone, you have to remember that 9/10 kids have iPhones, and are imessaging and facetiming each other, and they can all run Snapchat just the same and having an Android kinda makes you an outcast. you'd have to be crazy to bet against apple at the moment based on the western market alone.", "score": 3, "replies": []}, {"body": "Dude, all of them people have money, those tickets are expensive.....Working class have Android, and my cheap ass typing on this new Galaxy S9", "score": 6, "replies": [{"body": "Me too fam it's sad", "score": 2, "replies": [{"body": "I just think it really fucks up the DD.", "score": 1, "replies": [{"body": "It do", "score": 1, "replies": []}]}]}]}, {"body": "On my floor in office, I only saw two iPhone users.  This could only mean one thing: Long Motorola", "score": 5, "replies": []}, {"body": "Isnt Samsung still making 10-15% on each iPhone? I'm guessing most of the Androids you're seeing are Samsung? Too bad it's a headache to get Samsung stock, does KSC even have FDs available to US traders?", "score": 2, "replies": []}, {"body": "They probably have iphone because of the camera and or they see their friends with iphones and think they must have one too or they will be an outcast .", "score": 3, "replies": [{"body": "and they're all retarded if they make decisions on what phone to buy based on what their friends have", "score": 9, "replies": [{"body": "You will be surprise", "score": 2, "replies": []}, {"body": "Have you ever been a kid?", "score": 2, "replies": []}]}, {"body": "It's not a good sample, those tickets are so expensive that most are upper-middle class.\n\nWorking class and cheap fuckers like me who use Android would NEVER pay that much for a ticket.", "score": 6, "replies": [{"body": "Yeah everyone who's good with their money switches between Gator and Bulldog shirts to score free beer, gets wasted outside the stadium, and watches the game from the back of some guy's pickup. All free!", "score": 2, "replies": [{"body": "👍 And probably a better time", "score": 2, "replies": []}]}]}, {"body": "You literally are an outcast if you are a younger white girl and don't have an iphone, you could have a galaxy fold(most expensive smartphone I can think of off top of my head) with a gold and diamond studded case and your peer group would call you poor for using android and make fun of you.", "score": 1, "replies": [{"body": "I totally agree. And dont understand it. I've had one iphone in the past and I hated the experience.  I switched back to android.", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What Androids exactly? We might spot a new trend early on here. Who is the runner-up?", "score": 1, "replies": [{"body": "From what I can remember they are mostly Samsung Galaxy’s. I saw what I believe were a few pixels, and also some Motorola models. I’m really not perfectly sure and could be wrong though!", "score": 2, "replies": []}, {"body": "The kinds of people who buy android phones often don't even know what they have.\n\nThey are practical people. who can blame them?", "score": 2, "replies": []}, {"body": "I do not know, let me look up pictures of the exact models and see if I can give you accurate information", "score": 1, "replies": []}]}, {"body": "Long $BECKY", "score": 1, "replies": []}, {"body": "My DD: I think Apple is going to constanut out a giant profit on ip12 as the whole world wants it.", "score": 1, "replies": []}, {"body": "Long dual camera vs the triple camera, though I’m sure there will be more new iPhones after the holidays.\n\nAlso go Gators!", "score": 1, "replies": []}, {"body": "LONG $BB", "score": 1, "replies": []}, {"body": "Mods, petition to flair OP “All four in one” for this worthless information train they just pulled on us", "score": 1, "replies": []}, {"body": "oh i love white girls. great DD. next time take some pics ya fuck", "score": 1, "replies": []}, {"body": "Already priced in", "score": 1, "replies": []}, {"body": "World's Largest Outdoor Tendies Party", "score": 1, "replies": []}, {"body": "Here in Europe where I live I'd say that Android has a clear majority. About 60ish % of phones I see are android.", "score": 1, "replies": []}, {"body": "But how are the moose knuckles?", "score": 1, "replies": [{"body": "Right and tight", "score": 2, "replies": [{"body": "Ooh it’s in the mid 60s today so they ought to all be wearing leggings too", "score": 1, "replies": []}]}]}, {"body": "LONG $AAPL $500 TARGET PRICE", "score": 0, "replies": [{"body": "Any magic mushrooms left for us !", "score": 1, "replies": []}]}, {"body": "No news here. Sheeple will be sheeple.", "score": -1, "replies": []}, {"body": "The more important question how many DDs did you count?", "score": 0, "replies": []}, {"body": "If only Apple themselves released some sort of report last week that told you exactly how many phones they have sold 🤔.         \nIf you want a real DD go camp outside an Apple store and tell us how many people are leaving with NEW iPhones.", "score": -1, "replies": []}]}
