{"title": "TSLA up around 6% in 2 days. Inverse WSB law continues", "selftext": "How are you playing this?", "id": "6mmonq", "created_utc": 1499784646.0, "score": 52, "upvote_ratio": 0.87, "num_comments": 40, "comments": [{"body": "Inverse me you son of a bitch. ", "score": 46, "replies": [{"body": "<20% success. \n\n\n99% of this sub loves those odds.", "score": 3, "replies": []}]}, {"body": "Here's how tesla works. Gs tweets some stupid shit like a 10 pt cut. Tesla tanks and then Elon whips out his massive dick and boom tesla up", "score": 46, "replies": [{"body": "Riding Elon's dick to the moon.", "score": 13, "replies": [{"body": "Some fags are riding his dick all the way to Mars cause that is the only reasonable answer for TSLA's gainz.", "score": 12, "replies": []}]}, {"body": "GS tweets giant cut\n\nGS buys the dip*\n\n", "score": 9, "replies": []}]}, {"body": "Tesla follows no laws. ", "score": 42, "replies": [{"body": "The only law Tesla follows is Daddy Elon's dick.", "score": 24, "replies": []}]}, {"body": "Looking just at the charts and not holding for more than a day. This stock is a circus.", "score": 15, "replies": []}, {"body": "Sold at 320, bought back in at 305, let's do this! ", "score": 14, "replies": []}, {"body": "Bought 50 shares on my moms ira. Up a grand.", "score": 35, "replies": [{"body": "Wut", "score": 15, "replies": []}, {"body": "What did I just read... ", "score": 5, "replies": []}]}, {"body": "Bought at $258 and I put a stop loss at $300. Luckily It didnt sell. Riding it back up to the moon!", "score": 12, "replies": [{"body": "Lolz my grandma uses stop losses", "score": 28, "replies": []}]}, {"body": "Bought at ~375 and sold at ~382. Re-bought in at 316.", "score": 5, "replies": [{"body": "Bought at 383. Sold at 370. Bought again at 384 and 376. I'm truly embracing the tradition of WSB. Here I am in joy because I am not losing as much as last week. ", "score": 6, "replies": []}]}, {"body": "Inverse? I saw far more people saying to buy the dip recently ", "score": 9, "replies": []}, {"body": "Great time to short this ", "score": 7, "replies": [{"body": "I hope you're kidding because after a shakeout like what has already happened, it's a horrible time to short.", "score": 6, "replies": [{"body": "So short it? ", "score": 7, "replies": [{"body": "To trust, or not to trust WSB?", "score": 2, "replies": []}]}]}]}, {"body": "Went in yesterday at 316. But I pussied out this morning at 319. Fuck. ", "score": 3, "replies": []}, {"body": "Anybody who said to short it when it went below 310 is retarded. 300 is huge support. I dont think its starting another bull run but its definitely a bounce to maybe 335-340", "score": 7, "replies": [{"body": "> 300 is huge support.\n\nThat support is based on sales and dividends right, not just wishful thinking?  Short short short....", "score": 5, "replies": [{"body": "It's based on historical price action and taking 5 seconds to look at the fucking order book.", "score": 3, "replies": [{"body": ">  historical price action\n\nBy historical you mean ALLL the way back to April when it crossed 300 for the first time?  Boy that's some good history to study.  All the way back to a little while ago.  Or do you mean historical as the $70 tumble one week ago?  How did you magical order book look in the morning of the 4th leading up to that? ", "score": 3, "replies": [{"body": "Buuut if the support level held after a huge sell off(RSI even touched <30), aren't you kind of making an argument in favor of it? ", "score": 2, "replies": [{"body": "Shhh let him short it", "score": 1, "replies": []}]}]}]}]}, {"body": "The bull put spreads were premium-licious.", "score": 1, "replies": []}]}, {"body": "I've never fooled around with straddles but it seems like a straddle with a wide spread would be a good move here. Thoughts?", "score": 2, "replies": []}, {"body": "Up pretty good at close. It's about damn time. Now since some of those pussy retail traders are gone and now is a good price point for funds to buy in, let's get this shit show over $400.", "score": 2, "replies": []}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/6mh0pi/tsla_set_for_a_reversal_tomorrow/", "score": 1, "replies": []}, {"body": "And TSLA will make another good increase within next two days. You'll see it. ", "score": 1, "replies": []}, {"body": "TSLA is moon bound until Elon does another debt raise.  The next time it happens will probably make for a huge dent in the share price. Like 20% because of all the ambitious goals and the deadlines specified. I can see another short squeeze in the mean time. Think 350-360 then it happens. All speculation though, no one actually knows anything. No TA or fundamentals can truly guess where this goes in the short-term, but bears are tripling down on the negativity so that should be an indicator of some sort. ", "score": 1, "replies": []}, {"body": "Not touching TSLA with a ten foot pole. You should only be playing this stock if you know what you're doing.", "score": -7, "replies": [{"body": "So why are you even here? ðŸ˜", "score": 9, "replies": [{"body": "To shitpost", "score": 10, "replies": []}]}]}]}
