{"title": "I don't know why Elon Musk founded Spacex", "selftext": "Because we're riding $TSLA to the moon ", "id": "6qf76k", "created_utc": 1501384435.0, "score": 162, "upvote_ratio": 0.95, "num_comments": 45, "comments": [{"body": "because if spacex goes to Mars, they're going to need batteries. Who will make them? $TSLA baby.", "score": 59, "replies": [{"body": "Happy Birthday faggot. Hope you enjoy your tendie gainz from Elon daddy for many years to come. ", "score": 9, "replies": []}, {"body": "So how do they make money off going to Mars?", "score": 1, "replies": [{"body": "Government contracts (NASA)", "score": 2, "replies": []}, {"body": "Spacex is currently making money on government and private spaceflight contracts. They have the cheapest launch vehicle on the market and it's also the only reusable launch vehicle on the market", "score": 1, "replies": []}]}]}, {"body": "Yeah back when elon was just starting $TSLA he asked me how big he should build it. \n\nI took a bite out of my soup, looked him in the eyes and said\n\nTo the moon!", "score": 50, "replies": [{"body": "Bite of your soup??", "score": 21, "replies": [{"body": "That was the only bit you found odd about any of this?", "score": 25, "replies": []}, {"body": "Drink your bread??", "score": 3, "replies": []}]}]}, {"body": "Lunatic ", "score": 34, "replies": [{"body": "Deep meme when you look at the origins of the word", "score": 32, "replies": [{"body": "This guy got more upvotes for pointing out the clever word play than I got for thinking of it. It was not an accident, it was no fluke!!!!! \n\nI feel cheated. ", "score": 10, "replies": [{"body": "upvote this comment if u agree", "score": 22, "replies": [{"body": "karma parasite. ", "score": -5, "replies": [{"body": "upvote if true", "score": 21, "replies": [{"body": "My Mum warned me about people like you!", "score": -3, "replies": [{"body": " Upvote if you fucked his mum", "score": 13, "replies": [{"body": "upvoted", "score": 6, "replies": []}]}]}]}]}]}]}, {"body": "The moon", "score": 0, "replies": []}]}, {"body": "The difference between a lunatic and a genius is credibility.", "score": 1, "replies": []}]}, {"body": "It's cause he's an alien whose mission is to accelerate our technology and prep us for first contact.", "score": 12, "replies": []}, {"body": "Eyyyyy", "score": 8, "replies": [{"body": "Emmmmm", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Goodbye", "score": 5, "replies": []}]}]}]}, {"body": "You think earth will be habitable forever?", "score": 2, "replies": []}, {"body": "If an electric Honda Accord were marketable wouldn't somebody else have made it by now?", "score": 2, "replies": []}, {"body": "He got really depressed at a young age and from reading hitchhiker guide to the galaxies and is convinced he needs to save the world. I shit you not he says this in an interview. Also Elon didn't found tesla like many people believe. He actually became a big investor in the company early on and took over as the director of the board. Then when the economy was bad he took over as ceo in October of 2008. Weird thing is Tesla inc wiki considers him as a co founder but in reality he was just a first round investor in Series A and so on every round. The guy didnt found PayPal either surprise! He founded the company called zip2 that had a merger which he was against but then became the ceo because the board insisted on it then he was shortly replaced because they felt his vision of the company didnt match theirs. Funny how Elon was discarded by a board and then Elon does the same thing to Tesla. Yet people will worship him with out questioning. Reminds me of the Facebook scandal where they paid writers to try to sell stories of bad things of google. Elon is not a saint but yeah if he gets us to mars that be cool. But then what? SpaceX makes better money sending satellites to space oh but they exploded and took out Facebook's satellite with them. Hell tesla isnt even profitable! Everyone freaked out when it was worth more than Ford but at least Ford makes money. Ford pays investors but tesla pays with hope. Im ok with trading tesla but sure as hell not holding that tnt. If/when SpaceX goes public it will be a shit storm like how every article thought snap was going to do well. Musk isnt a gamble im willing to take. \n\nSorry for the rant but shit hate it when musk is mentioned. ", "score": 8, "replies": [{"body": "You write this after a long, lonely, and drunken bender -  feeling sorry for yourself for the countless time in your life?", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "r/iamverysmart", "score": 8, "replies": []}]}]}, {"body": "They mad. \n", "score": 4, "replies": []}, {"body": "he was a co-founder, one of 5 actually.......", "score": 7, "replies": [{"body": "He was the series A investor after the company been around for a couple years. (Tesla)\nAnd technically since zip2 is considered an independent entity the cofounders are the merging companies and the approval votes from the board which he was against. ", "score": 2, "replies": []}]}, {"body": "I think the Model 3 will be Tesla's \"swan song.\"\n\nThe dude clearly wants to save the world, and making a profit isn't his primary motivation. On Craigslist, there are already people offering to sell their Model 3s for $10,000 over sticker. Therefore, the car was priced way too low.\n\nTesla has always lost money on every single car they sell, and now they've kicked into overdrive.\n\nI give them 24 months before they're bankrupt.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tesla isn't profitable yet the valuation is wacked from investors jizzing over the idea of the future. Musk isnt the business guru people think he is. I dont think you read my reply to op post at all. Op says tesla going to the moon and I doubt it. ", "score": 2, "replies": []}]}, {"body": "My fav part was the Hitchhiker's Guide to the Galaxy mention. Great book(s).", "score": 1, "replies": []}, {"body": "I can't stand it either.  \"Hyperloop\"?  What a load of garbage.  Tunnels under DC/LA?  Who the fuck buys into that?\n\nGenius?  Lolz.", "score": 1, "replies": []}, {"body": "And this hyperloop nonesense wasn't his idea to begin with...just something he thought would be cool", "score": -1, "replies": [{"body": "Even his last/first name isn't his own creation. \n\nHe got it from his parents at birth, what a idiot. ", "score": 18, "replies": []}, {"body": "Dude, \"his idea\".  Lol.\n\nhttps://en.wikipedia.org/wiki/Swissmetro", "score": 1, "replies": [{"body": "**Swissmetro**\n\nSwissmetro was a futuristic Swiss national transportation project using vactrain technology. It was put forward by Marcel Jufer of the École Polytechnique Fédérale de Lausanne.\n\nThe trains would have significantly lowered the travel time between major cities in Switzerland. For example, the time between Bern and Zurich could be reduced from the present 60 minutes by intercity train to a mere 12 minutes.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/wallstreetbets/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.24", "score": 1, "replies": []}]}]}, {"body": "Don't worry Hoss. I also think that once they break the shadow of the earth, a bunch of 80's guys will see that the ride to the moon was on Icarus' dick. I hope I'm wrong because I've got friends that are betting the farm. \n\nI will give Space X credit for cool hiring practices. Met the guy that ran their inventory/ supply for Vandenburg AFB when SX was first setting up shop. He said he was one of those hobby model rocket types. They go out to the desert and launch little model....you get the idea. Well, he had a group that would meet up on whatever day out in the middle of Meth country. They were firing off their toys when one of the guys says, \"How would you like to do this for real?\" Turns out a couple of them were engineers still on the ground floor of SX. Basically found him something he was kind of qualified for knowing he would do his best because he gave a shit about the subject matter. ", "score": 0, "replies": []}]}, {"body": "Unbelievable how he is able to fool all of you idiots. ", "score": 2, "replies": []}, {"body": "With TDPs like that there's going to be no clocking room let alone overclocking room", "score": 1, "replies": []}, {"body": "He's just looking for the final boss since we are all living in a simulation.  END GAME BABY!", "score": 1, "replies": []}, {"body": "It's a slush fund which uses nice, steady, government funds to do things like buy SolarCity bonds and maybe even fund some Tesla stuff - who can tell?!", "score": 0, "replies": []}]}
