{"title": "If I want to sell a stock, is it better to sell it as option and hope it called? ", "selftext": "I need to rebalance my portfolio by selling some NVDA. It’s currently 20% of my portfolio. \n\nInstead of selling it right away, will that be better to sell it as calll option? \n\nIf so it’s better to sell as option, and My target price to sell NVDA is 130, should I sell covered call 130 with 6 days expire or should I sell way further out like 365 day out? \n\nWhich is better? ", "id": "1e2lwv6", "created_utc": 1720907758.0, "score": 44, "upvote_ratio": 0.85, "num_comments": 87, "comments": [{"body": "\nTo answer your question - if the primary objective is to sell NVDA to rebalance your portfolio, then selling covered call options are not an efficient way to do this.\n\nThe main reason being that if NVDA does not hit the strike price, it won’t be assigned… and you’ll still need to rebalance that portfolio. Worse off if NVDA undergoes a strong correction. \n\nI appreciate that you are looking at the opportunity to collect the premium and sell at a price point you are comfortable with exiting at, but you are forgetting the opportunity cost of not having a balanced portfolio coupled with the risk in a downturn in the NVDA stock while it is 20% of your portfolio.\n\nThat said, do what you want with your money.", "score": 52, "replies": [{"body": "Agree. My answer was simply do calls to lower cost basis on NVDA and use cash to diversify the portfolio", "score": 18, "replies": [{"body": "Seems ideal, you could even do a \"strangle\" options spread (I think that's the right term? With a +10% window?\n\nIe the window that the options expire worthless is 10%, but it is also +x% or +xx% from when OP sells them. Eg Nvidia is 129.90, so 130 for out math.\n\nAssuming target is 143 (130+10%) then our spread from there is +/-10%. 143 +/-10% is 157.3/128.7 on that window. So anything beyond that is okay, assuming the margins and trends are within the risk tolerance/the indicators for where the stick is going?", "score": 1, "replies": []}]}, {"body": "people losing their cool cause others sell covered calls or puts are confused. Sell to open an option is a short position but not a short sale. ‘Sell short’ is where you borrow shares to complete a put assignment that you didn’t buy to close before expiration. You can be short calls and puts without making a true short sale where borrowing stock is involved.", "score": 2, "replies": []}]}, {"body": "No.\n\n\nAlso you will lose long term tax status on any long term shares you sell via a call, u less you sell it otm and 30+ days out. Or a wash sale situation creates an issue. \n\n\nJust sell ", "score": 9, "replies": [{"body": "Wait? Thats not right, is it? If they have held the shares for a year, is that not that is still long term capital gains tax? \n\nThe premium on the writing the option is obviously a short term gain, which will be taxed as normal income.\n\nI don't see how a wash sale is part of this conversation. They are selling shares for a profit. Wash sale rules apply to buying back the same stock after a loss.", "score": 2, "replies": [{"body": "No, you are wrong. Google it  If you sell shares via call assignment, and the call you sold wasn't 30+ days out and otm, the shares will get treated as short term hildings\n\n\nhttps://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls", "score": 0, "replies": [{"body": "Got ya. It was the 30 days and OTM that I was missing.", "score": 1, "replies": []}]}]}, {"body": "How much is the tax difference between long term tax and short term?", "score": 2, "replies": [{"body": "Google is your friend\n\n\n15% vs your marginal tax rate.\n\n\nThere is no situation where taking a short term gain when you could have taken a long term makes you better off", "score": 9, "replies": []}, {"body": "ST, < 1yr hold, is typically taxed at your normal income tax rate.  Long term, less.  Your overall taxable income dictates you rate for both.", "score": 1, "replies": []}]}, {"body": "If the shares are already long term, selling a covered call won’t change that.  He will potentially have a short term tax impact from the sale of the calls but the shares won’t change from long to short term.", "score": 2, "replies": [{"body": "Wrong. Google it. The sold calls have to be qualified.\n\n\nEdit I'll do it for you since so many people are confidently incorrect \n.https://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls", "score": -1, "replies": [{"body": "Dude read it.  If he has the stock for a year already he is fine.  Selling the covered call won’t suddenly turn it into a short term gain.  He might have a short term gain on the option he sold but not on the underlying stock.", "score": 1, "replies": [{"body": "No. It has to be qualified", "score": 1, "replies": [{"body": "Yea qualified would be over a year.  Where he could get fucked is if he sells deep in the money, stock tanks then he’d have long term to the strike and short term on the call sale price", "score": 1, "replies": []}]}]}]}]}, {"body": "The \"just sell\" advice is sound.   You should more carefully read your own link though.  It states the covered call itself will always be a short term gain if assigned.  The actual asset depends on the amount of time it was held.  You need to be more careful about being so confidently incorrect.", "score": 1, "replies": []}, {"body": "You’d of course lose the shares, not their tax status.  Selling ccalls could turn short hold into long hold simply by not being assigned during the short hold period.", "score": 0, "replies": [{"body": "Wrong. Google it. You guys are in here confidently spreading wrong and easily verifiable advice. \n\n\nhttps://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls", "score": -3, "replies": [{"body": "I don’t need your link to god knows what.  When the shares leave due to assignment is when their hold period is determined.  While involved in the ccall, they’re simply what secures the contract in lieu of cash or margin, and remain assets of the account.\n\nFrom your <edited out> link:  “The resulting gain or loss depends upon the holding period and the basis of the underlying stock. If the stock delivered has a holding period greater than one year, the gain or loss would be long term.”", "score": 1, "replies": []}]}]}]}, {"body": "If you want to get rid of it sell a deep in the money call.", "score": 28, "replies": [{"body": "Note that this resets the holding period, so it can have a negative tax consequence by changing what would be a long term gain into a short term one.", "score": 21, "replies": [{"body": "What?", "score": 6, "replies": [{"body": "Assets you hold for a year or longer before selling are taxed at a lower rate. Using the strategy above resets how long you've been holding.", "score": 11, "replies": [{"body": "Where can I read about it as I don't get why? If I buy shares and sell 400 DTE call it will be a short term gain?\n\nOr is it about ITM calls specifically?", "score": 7, "replies": [{"body": "Not all covered calls have that effect on capital gain – only ITM covered calls.\n\nThere are other tax implications of covered calls. For details, read\n\n[https://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls](https://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls)", "score": 9, "replies": []}, {"body": "You'd be better off asking the guy who issued the original warning. I don't hold long term, as I tend to day trade.", "score": 1, "replies": []}]}]}]}, {"body": "I just like the stock", "score": 1, "replies": []}, {"body": "So a leap then?", "score": 1, "replies": []}, {"body": "Not resets, it suspends", "score": 1, "replies": []}, {"body": "This is incorrect. It does not “reset the period.” For example: OP owns 100 Shares of NVDA for 360 days and either 1) hedges it through buying protective puts or 2) Sells Calls against the shares. OP does not reset to 0 days. His tax holding period for purposes of long term or short term statues gets put on hold at day 360. If he were to close all options positions regarding NVDA the holding period would resume from day 360. He would not have to start over at 100 provided he was holding the same exact shares.", "score": 1, "replies": []}, {"body": "Interesting, didn’t know selling covered calls would have that effect", "score": 0, "replies": [{"body": "Not all covered calls have that effect on capital gain – only ITM covered calls.\n\nThere are other tax implications of covered calls. For details, read\n\n[https://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls](https://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls)", "score": 6, "replies": []}]}]}, {"body": "The extrinsic value of deep itm calls are usually non existent, meaning he wouldnt make any more money than if he just sold the shares", "score": 2, "replies": []}, {"body": "This is the answer. You'll probably be able to get a modest additional bit of value over the price of the stock when you sell the option.", "score": 3, "replies": []}, {"body": "By the way, this is horrible advice and you will lose your long-term tax status. \n\n\nI award this answer zero points", "score": 0, "replies": []}]}, {"body": "Sell a covered call IF you don’t need the cash right away and IF it won’t torture you to see the price blow past your strike.  And, as others have posted, 30-45 days gets you your optimal premium for the time you’re selling - beyond 60 stops making financial sense.   Fwiw, I’ve been selling CCs on BRKB for years, AAPL more recently and now NvDA since the split. Still have most of those shares as sometimes you just get lucky with a dip close to expiration", "score": 10, "replies": [{"body": "This. I've been selling covered calls on NVDA, MSFT, PANW and many others. Nice way to make extra money.", "score": 4, "replies": []}]}, {"body": "Depends if it goes down too much u could lose money and still be stuck owning the stock. Also better off just selling if you think you can get better returns elsewhere", "score": 3, "replies": []}, {"body": "Most of the answers provided here are nonsensical. Here is a scenario you have to actually consider:\n\nNvda is 100. You sell a 28 day cc at 100 strike for $5. Nvidia collapses to 85. You are now out 10%. \n\nThis is the actual risk of selling a cc, not the \"lol it went to 115 but you sold at 100\" crocodile tears scenario.\n\nYou can adjust things i.e sell deeper in the money like 90, but you will be getting less premium in compensation so you need to consider if its still worth tying up your capital", "score": 3, "replies": [{"body": "In your section, What about if I put trail stop loss at $95? This way if stock drop below $95 I get to sell at $95 and I still collect the premium.", "score": 1, "replies": [{"body": "So you'd have to sell the stock and buy to close the option. If it opens down, or spikes down afterhours, you're not getting a good fill - theres plenty of stories on this sub about that happening", "score": 1, "replies": []}]}]}, {"body": "But nvidia is AI leader and it doesn’t seem like it’s gonna change any time soon, I’d just HODL for a few more years then sell at double the price", "score": 3, "replies": [{"body": "Also the leader in: data center chips, a platform for trainng AI. And a platform for autonomous self driving cars - used by Mercedes Benz, Volvo, Hyundai and others,: https://www.nvidia.com/en-us/self-driving-cars/", "score": 3, "replies": []}, {"body": "If you are so certain that it will go up you should buy long calls on it. It could more than double your investment with leverage. I for one thing want to rebalance my portfolio so that I can preserve my wealth.", "score": 1, "replies": [{"body": "I’m waiting for a dip to buy more", "score": 2, "replies": [{"body": "You could just sell puts, that way you can collect premium while you wait.", "score": 1, "replies": [{"body": "Don’t have buying power, will probably buy leaps and weekly calls then sell puts with gains", "score": 1, "replies": []}]}]}]}]}, {"body": "It depends on just how many shares we're talking about. The main benefit of selling stocks through options is that you don't get slippage. All shares are sold for the exact amount set, which when selling large numbers of stocks, can be desirable. Likewise it's also a way to control your cost basis when buying if you do the reverse. But the drawback is that you don't control if and when it will happen. Selling ccs though is not a bad idea because even if the stock starts dropping there will still be high demand, and premiums, for calls on it, at least for a few months if not longer. If you sell 365DTE you'll get a nice lump sum for a premium for them and yo'll most likely be assigned sooner than you would be able to make the same amount on 6DTEs. But if NVDA cools down you will eventually make more out of those than you would with the 365DTE.", "score": 3, "replies": []}, {"body": "Yes, it makes no sense not to. It opens up the game of mental strength however. \n\nI made 24% on Disney earlier in the year, sold at $112, saw it go up and felt regret. I moved on however, and now it’s at $98.", "score": 4, "replies": []}, {"body": "IMO, your answer will depend on your current need.  Selling ATM ccalls will net you a bit more profit awaiting eventual assignment even in the most stable of underlying circumstances.  Selling slightly ITM ccalls allows you to mathematically lock in today’s underlying price and a chance at keeping the underlying in a downturn.  The OTM ccall is the least likely to be assigned but will not aid your rebalancing effort if in a hurry.", "score": 2, "replies": []}, {"body": "IMO sell an ATM or just ITM covered call for the coming Friday as it will collect a higher premium while giving about a 50% or slightly higher probability of the shares being sold.\n\nFor example, the 130 strike ATM 6 dte call collects around $3.10 in premium and 100 shares would be called away if the stock ends at $130.01 or higher when it expires.\n\nAn ITM 129 CC would increase the probabilities of being called away at that strike and bring in about $3.70 of premium, but be aware there could be tax question when selling an ITM call. Look up ‘covered call tax’ online for those details.", "score": 2, "replies": []}, {"body": "Just sell an atm call id imagine it'd get called", "score": 2, "replies": []}, {"body": "Sure, why not collect some free premium? If you want this to happen soon, choose a strike price that's not too far OTM and an expiration date of a week or two. You'll collect more premium going farther out, but that will also delay the sale. If you've got plenty of time, go farther OTM and farther out, like 30-45 days or so.", "score": 4, "replies": []}, {"body": "* Your stock is at $100\n* You sell a call at the $110 strike\n* At expiration, the stock is at $125, and your stock is called away for $110\n\nIs that an OK or not-OK scenario?", "score": 2, "replies": [{"body": "Yeah that’s okay since my goal is selling at $110..", "score": 6, "replies": [{"body": "My point was that there's the possibility that a covered call could end up causing you to miss out on a large chunk of an up-move; is that OK?\n\nIf there's no urgent need to reduce the position, another possibility is a trailing stop. The largest peak-to-valley-before-going-up-to-the-next-peak drop over the last year was just under 20%. If you set a 15%-or-so trailing stop on a chunk of the NVDA, it will eventually trigger and close you out. But it will follow the price up to as high as it gets, which a covered call won't do, while requiring zero babysitting. That may or may not be the best approach for you; I offer it as something to consider.", "score": 2, "replies": [{"body": "Yeah I’ll be okay with missing a large chunk of up move. \n\nTrailing stop is a good strategy. Thanks for the advice. Can I do both sell call and trailing stop? This way if it goes down my stock gets sold by trail loss. If it doesn’t go down that much I get to keep the premium.", "score": 1, "replies": [{"body": "Why are you ok with leaving so much cash on the table?", "score": 1, "replies": []}, {"body": "It probably depends on the broker and on your option approval level. Since a covered call and a trailing sell stop on the same underlying would cause the call to become naked if the trail triggered, you'll have to see how OK your broker is or isn't with that combination.", "score": 1, "replies": []}]}]}, {"body": "Did you post that your goal was selling @ &130.00? Have you changed your mind?", "score": 1, "replies": [{"body": "I still want to sell at $130. Above guy was just using 100 as example.", "score": 2, "replies": []}]}]}]}, {"body": "I'd sell at ATM straddle with the number of contracts equal to the number of stocks I'd like to part with and the expiration on the date I want them gone.\n\nIf you have no clue what I'm talking about then just sell the stock.", "score": 2, "replies": [{"body": "What’s an atm straddle going to do?  His goal is to dump stock.  ATM straddle he could end up with more stock of the price falls", "score": 1, "replies": [{"body": "Ideally they will make more then the stock drops so they can sell immediately after assignment. It seems like they want to make a little bit more before cashing out and doing this on a weekly gets it out almost as fast as actually selling. I don't play that specific options chain so I do not know if weeklies exist in it.", "score": 1, "replies": [{"body": "Sure but if the stock climbs and exceeds his premiums now he is out the net.  He’d also need options account for naked puts", "score": 1, "replies": [{"body": "Also true, but other end of the coin is if they sell and it keeps going they are also out of the cash. Give and take.", "score": 1, "replies": []}]}]}]}]}, {"body": "My opinion is to sell an option with a short duration, and be willing to ATM or ITM if you want to help ensure your stock gets called away before a major dip (the only real risk versus selling immediately at market imho). \n\n\nIf rebalancing for non urgent purposes, I don't see much harm in the covered call strategy. If juggled well, covered calls can even make a sharp drop far less painful since constantly rolling for premiums can be very profitable.", "score": 1, "replies": []}, {"body": "you can collect premium and get called, but you risk holding the stock longer if the price happens to drop.\n\nex:  the July 26 $129 put has an ask price of $6.15.  So in this case as long as NVDA remains at or above $29 by the end of day on July 26, you would end up with $12,900 + $615 premium.  So it's as if you are selling the stock for $35.15/share.  The deeper in the money you go, the more likely you will get called, but also the lower your net profit at the end of the trade.  \n\nIf, on the other hand you are not in a hurry and you don't get exercised, you can simply turn around and sell another call.  Rinse and repeat until the shares are sold.", "score": 1, "replies": [{"body": "About the risk of price happens to drop, what if I setup a trail stop loss ? Let’s say premium for 135 strike is $5 right now, and I put a trail stop loss at $130. Will I be good regardless?", "score": 0, "replies": [{"body": "Brokers don't allow this.", "score": 1, "replies": []}, {"body": "you can set up a trailing stop order to sell your shares and allow that to follow the price from where it is now, or you can sell a covered call against the shares.  \n\nyou cannot do both.  So you must choose.", "score": 1, "replies": []}]}]}, {"body": "sell a $100 call instead. better chance of getting assigned and have shares sold if it stays above $100, but if it drops below 100, you might have a change of mind and possibly keep it if you think its undervalued", "score": 1, "replies": []}, {"body": "yes it is ‘better’ but you put yourself at risk, so is it really better?  only you will know when the time comes", "score": 1, "replies": [{"body": "What risk am I looking at? Aside from if it goes down a lot then I’m stuck with the unrealized loss.. \n\nIf I sell option and set stop loss, will I be good?", "score": 0, "replies": [{"body": "well, what if you sell deep itm to cash premium bonus to your sell, but the stock completely shits the bed and you’re stuck with it for a week?", "score": 1, "replies": []}]}]}, {"body": "If you’re going to place a limit order at 130 idk why not just short 130c", "score": 1, "replies": []}, {"body": "Premiums are crazy high. Sell 15% above the price, 45 dte. But wait for a 3%+ pop", "score": 1, "replies": []}, {"body": "Do you like to gamble?  That’s the real question…", "score": 1, "replies": []}, {"body": "For tax implications it depends if it is a qualified or unqualified cover call. https://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls", "score": 1, "replies": []}, {"body": "if it does not go above the strike price it will not be called away and you keep the credit\n\n  \nImo, better to choose a strike price  below the current price, you are effectively locking in profits , if it gets called away and you get  extra income from the time decay and intrinsic value.\n\n  \nIt really depends on how risk averse you are. If you really think it could drop $10 then choose a strike that much  lower down", "score": 1, "replies": []}, {"body": "Whatever works for you I like to sell farther out deep itm calls especially around Aug and SEPT but they are usually my worst months and I buy puts as well if you strictly want to reduce your position you should not sell 365 days out options unless you think the price is gonna fall dramatically making your option worth much less so you can but it back but that does nothing for the loss of value in the stock or the size of the position in your portfolio.", "score": 1, "replies": []}, {"body": "If you were to sell shares, how many would you sell?  How does that compare to the delta of a call you might sell?  That's one way to \n\nHow much are you willing to lose if you're wrong?  Does the option pay enough for that?  (Don't forget that the call also has the time value for the interest rate in it, too, which you might want to remove from the premium calculation especially if you are good about keeping your cash capital allocated at least at the riskless rate.  Dividend is probably small enough to ignore).  Ie, do you think a rise in stock (times 100 shares) would be less than the premium (of the put if you're good about fully allocating your capital) or the call (otherwise)?\n\nSelling the option essentially means you don't expect so much volatility that you should either just sell now nor that you expect to miss out on massive upside moves (you're short vol and will take today's price for the possibility of selling your shares in the future)", "score": 1, "replies": []}, {"body": "I like how you think. I would sell calls to lower you cost basis on the long position and use cash to diversify", "score": 1, "replies": []}, {"body": "Your question tells me you are too inexperienced at trading to touch options. Stick to buying shares while you learn. Watch videos and paper trade until you understand the concept.", "score": 1, "replies": []}, {"body": "Just sell the stock and sell put at lower strike if you want to buy the stock at lower price", "score": 0, "replies": []}]}
{"title": "If on Monday, you had to sell your largest position and you immediately had to buy shares of another company what are you buying? ", "selftext": "[removed]", "id": "1e2ctvc", "created_utc": 1720883912.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 81, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "CNH (cocaine and hooker)", "score": 29, "replies": [{"body": "ASS. Maybe some TIT", "score": 1, "replies": []}]}, {"body": "HOO and KERs", "score": 7, "replies": []}, {"body": "TSM. \n\n$225 after earnings, guidance will be shock now that iPhone upgrade cycle goes into overdrive. Smartphones side has lagged AI but now it's firing on all cylinders and increasing their prices.", "score": 5, "replies": [{"body": "TSM fugt WSB last earnings so bad...", "score": 1, "replies": [{"body": "WSB jumped the ship too early, not wrong but just too early...", "score": 1, "replies": [{"body": "The play was call on earnings, not calls for 2 months further. They just expired.", "score": 1, "replies": []}]}]}]}, {"body": "Mine would be nasdaq calls and I would by Netflix puts", "score": 3, "replies": [{"body": "Thank you for the reminder to buy poots", "score": 3, "replies": [{"body": "Thank you for reminding me to buy calls", "score": 3, "replies": [{"body": "🤣🤣🤣 we're both losing money now", "score": 1, "replies": []}]}, {"body": "Ok I guess?", "score": -2, "replies": []}]}]}, {"body": "ASTS has grown in value as to be my largest position. If I had to sell it, I’d split it between MSTR LEAPS and…probably some more exposure to Nvidia and Tesla, in keeping with the speculative theme. Also, I would cry.", "score": 3, "replies": [{"body": "Imagine being this attached to a stock lol delusional", "score": -1, "replies": [{"body": "The goal is to make money, and I’d be sad not to do so as catalysts are in the near future. It’s already done well, I am excited to see it play out in the short term and hopefully in the long. Luckily there is no gun to my head to sell it.", "score": 1, "replies": []}]}]}, {"body": "Sell FLOT, buy SGOV\n\n\nWomp womp ", "score": 3, "replies": []}, {"body": "Amazon. It’s about time they had a major breakthrough in the market to keep them relevant", "score": 2, "replies": [{"body": "Disney store is cheaper than amazon. They’ve baked in free shipping into prices. The sooner the masses notice. The bigger the exit. I’m cancelling prime this year. I’m over it.", "score": 2, "replies": []}]}, {"body": "BABA", "score": 2, "replies": []}, {"body": "I wouldn't sell my largest positions. 🤷‍♂️", "score": 2, "replies": []}, {"body": " NANC", "score": 2, "replies": []}, {"body": "Sell Berkshire, but some boring safe etf", "score": 2, "replies": []}, {"body": "probably INTC", "score": 2, "replies": [{"body": "Why do you think so, I was thinking about that too bacause of the resent breakout to the upside", "score": 2, "replies": [{"body": "If I was forced to liquidate everything I had and put it into one place, I'd want a grower, not a shower.  I think INTC is early enough in their new AI strategy that we have no clue how large their upside can get, and unlike many others, they have all their own production resources.  The valuation is low enough today that there's tremendous room to climb, and it's affordable enough for retail traders to get in and drive up the price.", "score": 2, "replies": [{"body": "Word", "score": 3, "replies": []}, {"body": "Do you think its smart to buy options on Intel that expire in 1 year with a Strike of 60$ or is this to soon to high?", "score": 1, "replies": [{"body": "I can’t tell you what to do with your money. \n\nPersonally, myself, I don’t like the idea of options on a company whose stock is that cheap, and I definitely don’t like betting on a value almost doubling. And that far out. FOR ME, those risks are too great.", "score": 3, "replies": [{"body": "Thats a statement right there", "score": 1, "replies": [{"body": "How so?", "score": 2, "replies": []}]}]}, {"body": "I bought a few LEAPS two years out at $45.", "score": 3, "replies": [{"body": "Thats lower risk and probably smarter. I‘ve never bought options expiring over 3 Months later. I Like them shorten thats more predictable", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I would sell AMD and buy Procter & Gamble", "score": 2, "replies": [{"body": "I have actually sold most of my AMD (for NVDA exposure and some INTC LEAPS.) But I also have been buying PG shares with options profits (trying to build a grown up portfolio.)", "score": 2, "replies": [{"body": "Interesting. I just went balls deep on AMD two weeks ago. I think it is a solid long term hold.", "score": 3, "replies": [{"body": "I still have a bit, I actually switched most after good gains in January. Nvidia was my highest conviction idea at that time, and I wanted to try to concentrate. The AMD shares are up, too, just felt I needed to choose a bit. I’m really concentrated in tech and speculative plays, so am trying to commit capital more wisely. I wanted some exposure to Intel for the longer term, too, but think it’ll be a wait and don’t want to sell older holdings for it, hence LEAPS. Buying PG with options gains just feels smart in this context and I think it’s a good value. All that said, diversity is still lacking in my portfolio by a long shot.", "score": 2, "replies": [{"body": "Sounds like a fun and relatively good strategy mate! Good on you! I have most of my money in an interest fund, a global index fund and a consumer staples etf, but all my play money is in AMD", "score": 2, "replies": [{"body": "Ah, makes sense! (Working on the grownup portfolio, all individual companies, shares and options, for now.)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Looks like you're not fucking eating either\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 12 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Sell Tesla buy Apple", "score": 1, "replies": []}, {"body": "Im going to buy $CHPT because small caps are about to do really well and the growth potential is enough to buy me a brand new Maserati 🥴", "score": 1, "replies": []}, {"body": "My largest position is in MSFT, and my second largest is in IOT. If I had to liquidate my MSFT holdings I’d just buy more IOT. Among companies I know of, Samsara has the best chance of growing 10x in the next 10 years. Newest and largest player in industrial Internet of Things. Their network is so large that they have the industrial version of the Apple Air Tag, and yet their penetration in the US is less than 10% and their total addressable market is $100B, with international expansion potential. They have not even tapped into benchmarking and predictive analytics which should be the end game. I’ve been to their conference a couple of times. Their people are very talented and customer-focused. The company has a great culture with healthy remote work and maternity/paternity leave policies. \n\nPhysical operations has traditionally not been a hugely profitable industry, but if Caterpillar can reach $200B market cap and be part of DJIA, then Samsara can reach that valuation too.", "score": 1, "replies": [{"body": "Hmm. Have a bunch of cash sitting in the IRA. Might buy 100 shares to sit on", "score": 1, "replies": []}]}, {"body": "Smci", "score": 1, "replies": []}, {"body": "T E S L A", "score": 1, "replies": []}, {"body": "MSFT", "score": 1, "replies": []}, {"body": "PLUG is poised for a rebound", "score": 1, "replies": []}, {"body": "Selling my 100 apple shares and going into Costco 1000 Jan 2025 calls.", "score": 1, "replies": []}, {"body": "What is shares?", "score": 1, "replies": []}, {"body": "SOLD TSLA BOUGHT NVDA", "score": 1, "replies": []}, {"body": "AMAT", "score": 1, "replies": []}, {"body": "Sell Nvdia to buy another stock? Bad move leave it in Nvdia we’re in the beginning of a AI revolution.. you’ll make more in the upcoming years your sounding crazy", "score": 1, "replies": []}, {"body": "Smith and Wesson: to get rid of stupid questions", "score": 1, "replies": []}, {"body": "WBA dont sleep on it!", "score": 1, "replies": []}, {"body": "Im waiting for the market to take its biannual nosedive", "score": 1, "replies": []}, {"body": "Djt almost died. Idk if i wanna play on monday lol", "score": 1, "replies": []}, {"body": "Right now, the best companies I would invest in are Nvidia and Apple. They have a track record of revolutionizing the industry and making investors happy.", "score": 1, "replies": [{"body": "Nvidia? never heard of it", "score": 2, "replies": [{"body": "They make tortilla chips", "score": 6, "replies": [{"body": "https://youtu.be/Qm2k7L1AgXI?t=6", "score": 1, "replies": []}]}]}]}, {"body": "I'm almost all cash rn but I'll sell my few COST shares and buy some NNE for the moonshot. Energy is super in-demand and it's a funny stock.", "score": 1, "replies": [{"body": "Why all cash? When are you looking for re-entry?", "score": 3, "replies": []}, {"body": "They just did an offering, may start a position when it stops bleeding a bit and scale in for longterm moonshot, depending how my current moonshots progress.", "score": 1, "replies": []}]}, {"body": "I sold all TSLA and doubled my position in NVDA", "score": 0, "replies": []}, {"body": "Probably 0dte", "score": 0, "replies": []}]}
