{"title": "Is Tesla stocks a good buy?", "selftext": "Please give answers with reasons. ", "id": "6rpz5t", "created_utc": 1501909311.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 10, "comments": [{"body": "People expect great things from Tesla and that belief is already built into the share price. So far they have made good inroads in the US into the luxury market, for the last 6 months they have had revenue increases on the back of lower oil prices. So what is happening here people turning to Electric vehicles (EV's) not because of economics? I suggest it is brand strength, vehicle design and environmental concern. \nBrand\nTesla is now the top US car brand http://fortune.com/2017/03/01/tesla-consumer-reports-brand/ This article says that in terms of brand value Tesla ranks number 8 in the world https://www.driverless.id/news/and-suddenly-tesla-becomes-5-9-billion-car-brand-with-32-jump-value-0177903/ but it is the change in value that is staggering +32% in a year. A careful look at the previous rankings shows that Tesla pushed aside Land Rover and Porsche. Land Rovers is a 69 year old brand and Porsche 86 years. 91% of Tesla owners said they would buy another one http://uk.businessinsider.com/tesla-owners-are-insanely-happy-with-their-cars-2016-12 This suggests to me a Tesla cult is developing, these are not owners but cult members.\nVehicle Design I will do in part II \nDisclosure I have owned Tesla shares in the past but currently do not.\n[Edit] Adding this article quoting the VW Brand chairman who sees Tesla as their main competitor. \"Because they have abilities we do no possess\". Tesla produce 100 times less vehicles so to be rated as a competitor is quite exceptional https://electrek.co/2017/08/04/vw-brand-ceo-sees-tesla-as-vws-main-competitor/", "score": 4, "replies": [{"body": "Thanks for sharing your views! ", "score": 2, "replies": []}]}, {"body": "I am invested in them, I think they are a great buy. I don't know that I would be able to articulate it well though.  They have an apple like cult following.  They are more than just a car company so you cant just compare them to ford and gm and the likes.  They are building power stations all over the world. They are redesigning manufacturing automation.  They are at the point where they are taking multiple good ideas and combining them into great ideas all related to each other giving each of them even more momentum. Traditional car manufacturers have rested on their laurels doing everything to keep the status quo.  Tesla is turning everything about cars from beginning to end upside down and now the world is trying to play catchup.  I think they will be the next big technology company next to Apple , Amazon, and Google.   Just my personal opinion though. ", "score": 3, "replies": []}, {"body": "I'm not buying now since I see a head and shoulders pattern on the 1 year chart but do your own due diligence.\n\nNo position.", "score": 2, "replies": [{"body": "I'm not buying because the astral alignment says the stock will go down 50% in 4.24 months", "score": 3, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "Tesla design, engineering, delivery and infrastructure.\nThe Tesla model S was one of the first attempts a producing an inspiring and stylish  Electric Vehicle from the ground up. Instead of taking a body shell that once belonged to a car that was powered by internal combustion they designed one from a blank sheet of paper. http://uk.businessinsider.com/the-tesla-model-s-is-a-masterpiece-of-design-2015-11 One of the features to note is the battery pack which is located in the floor pan. This gives a very low centre of gravity and also centers the weight between the wheels giving better handling. This was not enough for Tesla they wanted the car to be lightweight safe and to produce it as cheaply as possible. https://www.scientificamerican.com/article/how-tesla-motors-builds-the-safest-car-video/ Tesla realised early on the batteries were going to be the key to their aspirations to mass produce EV's. Typically the processes for manufacturing lithium ion batteries had required the various components to be moved between manufacturing centers spread across the world. This adds to costs increases delays and creates inefficiencies like packing and unpacking. They started build a huge factory near Sparks in Nevada, the building is modular so as they complete a section it can have temporary internal walls install and can be fitted out and used. The aim was to reduce battery cost by 30%. https://www.vox.com/new-money/2017/4/17/15293892/tesla-batteries-gigafactory-bet Tesla had been using standard sized cells but research proved that by making a larger cell they could produce the same energy from fewer cell with less overall weight. It is thought the energy density is improved by 50%. http://insideevs.com/tesla-2170-battery-cells-greater-power-comparable-cost/. So far I have only mentioned physical things but there is a whole new side to Tesla. From the get go it is probable that Tesla wanted to tap into software talent, by locating in California it has software talent on tap. The Model S and all subsequent models have had over the air updates, fixes to improve things, new layouts on the screen etc.  https://www.wired.com/insights/2014/02/teslas-air-fix-best-example-yet-internet-things/ These communications are two way so Tesla gather vehicle metrics and can detect faults, there have been cases where Tesla have contacted owners and informed them of an issue which they need to fix. Additionally Tesla gathers data on how their cars react to the road when in autonomous mode, this has allowed them to gather billions of miles of data with which to improve their autonomous system. \nThe last two subjects I am going to cover in this section are Charging Infrastructure and Dealer Experience. From the early days of the Model S Tesla created their own charging stations called Super Chargers, charging was initially free but there are now charges for new vehicle owners. The Chargers are DC to DC and are considerably faster than other chargers giving typically 170 miles of range from half an hour of charging. This link points to superchargers in the USA https://www.tesla.com/supercharger there are currently 909 stations but if you zoom in and look at the grey dots showing coming soon you will see they are set to double. Competitors do not have this fast charging network so if they own a Bolt for instance once they actually locate a charger they will get 90 miles charge for 30 minutes charge. \nTesla do not deliver through the normal dealer network but through showrooms or galleries. The staff are not trained to hard sell but educate there is a design studio where you can watch your specific car take shape and see how it looks before you go ahead and finalise. https://www.tesla.com/blog/tesla-reinvents-car-buying-experience.\nSo those are the facts as they look backwards in time, but the market looks forwards so what of the future and what about the stock which is still heavily shorted? I will leave that to section 3.", "score": 2, "replies": []}, {"body": "I'm not a fan. Their profits are dependent on policy, especially with cheap oil. But the tech involved is inevitable and they're leading by a few margins. If they can produce them as planned.. we're going to see an explosion of them on the road. There's also been reports of a small number of cancelled Model 3 orders. We'll soon see how demand holds up.. \n\nI know their Model 3 is going for 35k.. which is a different price range but basic model Toyotas, which are still nice are going for half that price... pretty Hondas just trounce it.. I am just not sure it will be as big as its stock. It feels like an overheated Tech stock. It is a romantic company though. ", "score": 1, "replies": []}, {"body": "No review is complete without looking at the future plans.\nTesla plans to 2020.\nComplete Gigafactory - which will be the biggest building by footprint in the world.\nBring Model 3 into production predicting 10k units per week in 2018\nBring Model Y into production\nReveal Electric Semi Truck - production unknown\nProduce Electric Pickup truck\nIncrease the range of Tesla cars to 1000km per charge.\nMake Tesla cars fully autonomous\nProduce 1 million cars a year by 2020\nDouble the number of superchargers by 2018\nTurn Tesla into an Energy company.\nhttps://www.inc.com/business-insider/elon-musk-tesla-goals-plans-for-2020.html\n\nReservations:\nAugust, September and October have rarely been good months for this stock and there is a lot riding on production ramp up of the new model 3. Tesla is reported as looking to run its cash reserve to $1 billion and it's finances while stable have an Altman-Z score of 1.7 which is on the edge of stressed.\n\nShort interest:\nShort interest is around 23% and steadily decreasing. This decrease will support the stock price, but the stock will over react negatively to any slight bad news.\n\nTechnical:\nIf you just look at charts then this stock is strong buy in all time periods.\n\nSummary.\nIf economic indicators hold up and Tesla releases good news on the production ramp up of the Model 3 then the stock should be able to achieve $420 before the end of the year, bad news then $310. Long term Tesla is a disrupter that takes crazy risks which just might pay off. Tesla, with an expected growth rate of 50% year on year, can potentially be to vehicles what Apple is to smart phones, what Google is to search engines.", "score": 1, "replies": []}, {"body": "Steve jobs wanted to change daily life for the masses. Tesla is a rich guy trying to launch his Yacht into space in my opinion. Henry Ford wanted to help people get there groceries home tesla wants to help people get there golf clubs home.. So if your into yachts and golf clubs hold it.... ", "score": 1, "replies": []}]}
{"title": "Complete Stock Market Thread for the trading week of August 7th, 2017 (Earnings, News & more)", "selftext": "Here is everything you need to know to get you ready for the trading week of August 7th, 2017 here at r/stocks!\n\n# **WEEK AHEAD: August's dog days will be anything but for Wall Street with big earnings, economic data ahead** - *[(CNBC.com)](http://www.cnbc.com/2017/03/31/for-once-the-all-important-jobs-report-just-isnt-that-important.html)*\n\n*****\n\n> Retail and media company earnings, inflation data and Fed speakers will keep investors busy as markets head into the dog days of August.\n\n*\n\n> What has been a solid earnings season will begin to wind down in the week ahead, but first Disney and News Corp report, as do retailers Macy's, Nordstrom, Kohl's and JCPenney. Recent IPOs Snap and Blue Apron, both disappointing market performers, report their results on Thursday.\n\n*\n\n> Producer and consumer inflation is reported at the end of the week, but it is the consumer price index Friday that markets will be most focused on after the July jobs report showed another month of soft wage growth and other inflation measures continued to look weak.\n\n*\n\n> Core CPI is expected to rise 0.2 percent after moving up just 0.1 percent for June. Markets remain skeptical the Fed will raise rates in Decemberbut it is widely expected to start the process of reducing its balance sheet when it meets in August. The lack of inflation continues to make markets skeptical the Fed will meet its forecast for another interest rate hike by year end.\n\n*\n\n> Fed speakers are out in force, with the most important likely to be New York Fed President William Dudley. He will be speaking Thursday morning about wage inequality in his region. That will be important because Dudley could discuss the lack of wage acceleration and the Fed's view on whether low inflation appears to be transitory or a longer term problem.\n\n*\n\n> Focus will also remain on Washington, even as Congress slows down for August recess. In September, Congress is expected to tackle the budget and debt ceiling, which some strategist worry will not go smoothly.\n\n*\n\n> \"Now we're going into the earnings vacuum. What will take center stage will be discussion around the debt ceiling but I still think we have some time, and the obsession around the Republican agenda, tax reform, and if we have any movement on that,\" said Michael Arone, Chief Investment Strategist at State Street Global Advisors. \"D.C., monetary policy will be the main drivers in the absence of earnings.\"\n\n*\n\n> Earnings season has helped send stocks to new highs this summer. So far, about 85 percent of the S&P 500 companies have reported, and earnings growth is so far about 12 percent, according to Thomson Reuters.\n\n*\n\n> Arone said he is keeping an eye on tech stocks and Nasdaq, which has lagged the other indices this week.\n\n*\n\n> \"I think it's a natural source for profit-taking, given the fact that stocks have done so well. If there are folks that are kind of concerned or beginning to reduce equity exposure, technology is a natural area to take some profits given the fact it's done so well. It is something to keep an eye on here,\" he said. \"In a world, where you have very low interest rates, very low inflation and good but not great growth you need to invest in that part of the market that has very strong topline growth and tech tends to be that sector.\"\n\n*\n\n> Arone said investors are confusing FANG—the acronym for Facebook,Amazon, Netflix and Google parent Alphabet with the broader tech sector, but they should look beyond those popular names.\n\n*\n\n> In the past week, the Dow rose 1.2 percent, closing at its eighth straight record high Friday at 22,092. The S&P 500 was barely higher, up just 0.2 percent at 2476, eight points below its all time high. The Nasdaqwas lower for the week, down 0.4 percent at 6,351. The VIX, CBOE's volatility index, meanwhile, fell more than 3 percent.\n\n*\n\n> \"I expect we'll get bouts of volatility for the balance of the year,\" said Arone, noting he's been concerned about the lack of volatility and investor complacency. But he said it would make sense if volatility picks up in the typically choppy months of August and September.\n\n*\n\n> \"I wouldn't be surprised if volatility picks up particularly as earnings season winds down,\" he said.\n\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P HEAT MAP FOR THE PAST WEEK!](http://i.imgur.com/rzXZ3oZ.png))**\n\n# **Major Markets snapshot of this past week:**\n###### **([CLICK HERE FOR THE MAJOR MARKETS SNAPSHOT OF THIS PAST WEEK!](http://i.imgur.com/27u82Dn.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2017/08/04/20170804_EOD15.jpg))**\n\n# **Treasuries for this past week:**\n###### **([CLICK HERE FOR THE TREASURIES FOR THE PAST WEEK!](http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2017/08/04/20170804_EOD7.jpg))**\n\n# **Currencies for this past week:**\n###### **([CLICK HERE FOR THE CURRENCIES FOR THE PAST WEEK!](http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2017/08/04/20170804_EOD9.jpg))**\n\n# **Gold for this past week:**\n###### **([CLICK HERE FOR THE GOLD FOR THE PAST WEEK!](http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2017/08/04/20170804_EOD12.jpg))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](http://i.imgur.com/jCnZmag.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD:**\n###### **([CLICK HERE FOR THE CHART!](http://i.imgur.com/aoNAA3P.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](http://i.imgur.com/37qAhw0.png))**\n\n*****\n\n# **STOCK TRADER'S ALMANAC: Is Dow Theory Sell Signal Still In Play?**\n\n> Lack of confirmation or synergy between the two oldest U.S. market benchmarks triggered a Dow Theory Sell Signal July 26. When the backbone of our economy that transports goods across the nation does not perform well it is an indication that there is underlying economic woe. It is not always right and like everything else it is subject to interpretation, but it does have a solid track record and is worth heeding here as our other indicators are pointing to a summer selloff around the corner.\n\n> In the 7 trading days since the July 26 Dow Theory Sell Signal when DJIA hit another new high and the Dow Transports failed to stay in sync and began its recent decline DJIA is up 1.5%, while DJTA is down 3.6%. That’s not a big move up for DJIA, but it is still up. Since this Dow Theory Sell Signal, DJTA has fallen rather sharply, down 6.1% from July 14 to August 1. All this weakness in the Transports has occurred while the Dow Industrials continues to log multiple new highs.\n\n> These Dow Theory Sell signals take some time to pan out, but the recent historysuggests that usual selloff and low following a Dow Theory sell signal may be on its way shortly. After experiencing a typically strong post-election July VIX is still low but turning higher. Sentiment is high and stocks are higher, so the time seems nigh for the August-September slide.\n\n> Sentiment as measured by the trusty Investors Intelligence Bullish and Bearish Advisors % continues to move evermore bullish to over 60% bulls and down to under 17% bears with an expanding spread between bulls and bears to near-peak levels of 43.7%. These are the levels associated with market corrections. At the same time volatility remains super low, but ticking up from historic lows under 9 intraday. If volatility begins to pick up and sentiment retreats look for the market to turn lower.\n\n###### **([CLICK HERE FOR THE CHART!](http://68.media.tumblr.com/9e8317c23b646a6a84ae8677b7d7669d/tumblr_inline_ou6ebpKy1k1spdppr_500.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 8.6.17 - All coiled up and hissing.** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=xSiqH9m23t4))**\n\n# **STOCK MARKET VIDEO: Stock Market Analysis for Week Ending 8.4.17** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=afLK5dPOUYo))**\n\n*****\n\nHere are the most notable companies reporting earnings in this upcoming week ahead!\n\n*****\n\n> * **$NVDA** \n> * **$VRX** \n> * **$SNAP** \n> * **$DIS** \n> * **$JCP** \n> * **$WB** \n> * **$TWLO** \n> * **$PCLN** \n> * **$ON** \n> * **$CVS**\n> * **$SINA** \n> * **$PLUG** \n> * **$M** \n> * **$TSN** \n> * **$NTES** \n> * **$YY** \n> * **$CBI** \n> * **$LITE** \n> * **$MAR** \n> * **$FDC**\n\n###### **([CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](http://i.imgur.com/zTF6M7y.jpg))**\n\n*****\n\nBelow are some of the most notable companies coming out with earnings releases this upcoming week ahead which includes the time of release & estimates courtesy of Earnings Whispers.\n\n*****\n\n# **Monday 8.7.17 Before Market Open:** \n###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES](http://i.imgur.com/Z2xgWOz.png))\n\n# **Monday 8.7.17 After Market Close:** \n###### ([CLICK HERE FOR MONDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #1](http://i.imgur.com/GGS7lW1.png))\n###### ([CLICK HERE FOR MONDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #2](http://i.imgur.com/RS70qAI.png))\n###### ([CLICK HERE FOR MONDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #3](http://i.imgur.com/zAebGby.png))\n\n*****\n\n# **Tuesday 8.8.17 Before Market Open:** \n###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1](http://i.imgur.com/tO1S6bC.png))\n###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2](http://i.imgur.com/wTJLjwJ.png))\n###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #3](http://i.imgur.com/q9QEDFk.png))\n\n# **Tuesday 8.8.17 After Market Close:** \n###### ([CLICK HERE FOR TUESDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #1](http://i.imgur.com/NR8ae7p.png))\n###### ([CLICK HERE FOR TUESDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #2](http://i.imgur.com/oBPz4zg.png))\n###### ([CLICK HERE FOR TUESDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #3](http://i.imgur.com/DFQy2GM.png))\n###### ([CLICK HERE FOR TUESDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #4](http://i.imgur.com/At7lerm.png))\n\n*****\n\n# **Wednesday 8.9.17 Before Market Open:** \n###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1](http://i.imgur.com/k6OsoMN.png))\n###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2](http://i.imgur.com/gptwY2w.png))\n\n# **Wednesday 8.9.17 After Market Close:** \n###### ([CLICK HERE FOR WEDNESDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #1](http://i.imgur.com/Kz3p63q.png))\n###### ([CLICK HERE FOR WEDNESDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #2](http://i.imgur.com/Su6WLtu.png))\n\n*****\n\n# **Thursday 8.10.17 Before Market Open:** \n###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES](http://i.imgur.com/VIM4cHG.png))\n\n# **Thursday 8.10.17 After Market Close:** \n###### ([CLICK HERE FOR THURSDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #1](http://i.imgur.com/ytzr05o.png))\n###### ([CLICK HERE FOR THURSDAY'S AFTER-HOURS EARNINGS TIME & ESTIMATES LINK #2](http://i.imgur.com/cUndKRs.png))\n\n*****\n\n# **Friday 8.11.17 Before Market Open:** \n###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES](http://i.imgur.com/2ZU3Buk.png))\n\n*****\n\n# **Friday 8.11.17 After Market Close:**\nNONE.\n\n*****\n\n#NVIDIA Corp. $167.21 \n> **NVIDIA Corp. (NVDA)** is confirmed to report earnings at approximately 4:20 PM ET on Thursday, August 10, 2017. The consensus earnings estimate is $0.69 per share on revenue of $1.96 billion and the Earnings Whisper ® number is $0.76 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 56.82% with revenue increasing by 37.25%. Short interest has decreased by 39.5% since the company's last earnings release while the stock has drifted higher by 46.3% from its open following the earnings release to be 46.6% above its 200 day moving average of $114.07. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, July 31, 2017 there was some notable buying of 2,425 contracts of the $170.00 call and 2,166 contracts of the $165.00 put expiring on Friday, August 11, 2017. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 13.2% move in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NVDA&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#Valeant Pharmaceuticals International, Inc. $15.13 \n> **Valeant Pharmaceuticals International, Inc. (VRX)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, August 8, 2017. The consensus earnings estimate is $0.97 per share on revenue of $2.24 billion and the Earnings Whisper ® number is $1.01 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 30.71% with revenue decreasing by 7.45%. Short interest has decreased by 35.1% since the company's last earnings release while the stock has drifted higher by 33.9% from its open following the earnings release to be 1.5% above its 200 day moving average of $14.90. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, July 21, 2017 there was some notable buying of 11,198 contracts of the $18.00 call expiring on Friday, August 18, 2017. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 25.2% move in recent quarters.\n \n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=VRX&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#Snap Inc. $13.52 \n> **Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, August 10, 2017. The consensus estimate is for a loss of $0.14 per share on revenue of $187.17 million and the Earnings Whisper ® number is ($0.12) per share. Investor sentiment going into the company's earnings release has 13% expecting an earnings beat. Short interest has increased by 96.5% since the company's last earnings release while the stock has drifted lower by 24.7% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, August 2, 2017 there was some notable buying of 6,899 contracts of the $15.00 call expiring on Friday, September 15, 2017. The stock has averaged a 21.5% move on earnings in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#Walt Disney Co $107.69 \n> **Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, August 8, 2017. The consensus earnings estimate is $1.53 per share on revenue of $14.60 billion and the Earnings Whisper ® number is $1.56 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.56% with revenue increasing by 2.26%. Short interest has decreased by 11.2% since the company's last earnings release while the stock has drifted lower by 1.2% from its open following the earnings release to be 1.5% above its 200 day moving average of $106.09. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, July 18, 2017 there was some notable buying of 3,000 contracts of the $120.00 put expiring on Friday, January 19, 2018. The stock has averaged a 2.3% move on earnings in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#J.C. Penney Company Inc $5.44 \n> **J.C. Penney Company Inc (JCP)** is confirmed to report earnings at approximately 7:30 AM ET on Friday, August 11, 2017. The consensus estimate is for a loss of $0.07 per share on revenue of $2.86 billion and the Earnings Whisper ® number is ($0.03) per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 40.00% with revenue decreasing by 1.99%. Short interest has increased by 4.6% since the company's last earnings release while the stock has drifted higher by 9.9% from its open following the earnings release to be 21.7% below its 200 day moving average of $6.95. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, July 26, 2017 there was some notable buying of 6,551 contracts of the $4.00 put expiring on Friday, February 16, 2018. The stock has averaged a 7.9% move on earnings in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JCP&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#Weibo Corporation $78.77 \n> **Weibo Corporation (WB)** is confirmed to report earnings at approximately 5:00 AM ET on Wednesday, August 9, 2017. The consensus earnings estimate is $0.36 per share on revenue of $248.76 million and the Earnings Whisper ® number is $0.38 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $240.00 million to $250.00 million. Consensus estimates are for year-over-year earnings growth of 200.00% with revenue increasing by 69.36%. Short interest has decreased by 7.1% since the company's last earnings release while the stock has drifted higher by 12.2% from its open following the earnings release to be 39.8% above its 200 day moving average of $56.35. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, July 27, 2017 there was some notable buying of 3,200 contracts of the $100.00 call expiring on Friday, September 15, 2017. Option traders are pricing in a 9.8% move on earnings and the stock has averaged a 11.9% move in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WB&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#Twilio, Inc. $29.21 \n> **Twilio, Inc. (TWLO)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, August 7, 2017. The consensus estimate is for a loss of $0.11 per share on revenue of $86.23 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for a loss of $0.11 to $0.10 per share on revenue of $86.00 million to $88.00 million. Consensus estimates are for year-over-year earnings growth of 56.00% with revenue increasing by 33.67%. Short interest has increased by 16.8% since the company's last earnings release while the stock has drifted higher by 18.7% from its open following the earnings release to be 2.7% below its 200 day moving average of $30.02. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, July 21, 2017 there was some notable buying of 3,375 contracts of the $35.00 call and 3,000 contracts of the $35.00 put expiring on Friday, August 18, 2017. The stock has averaged a 8.1% move on earnings in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TWLO&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#Priceline Group Inc.\n> **Priceline Group Inc. (PCLN)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, August 8, 2017. The consensus earnings estimate is $14.27 per share on revenue of $3.00 billion and the Earnings Whisper ® number is $14.53 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat The company's guidance was for earnings of $13.30 to $14.00 per share. Consensus estimates are for year-over-year earnings growth of 1.64% with revenue increasing by 17.38%. Short interest has increased by 7.4% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 19.6% above its 200 day moving average of $1,699.26. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, August 3, 2017 there was some notable buying of 593 contracts of the $2,100.00 call expiring on Friday, August 18, 2017. The stock has averaged a 6.6% move on earnings in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PCLN&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#ON Semiconductor Corporation $15.10 \n> **ON Semiconductor Corporation (ON)** is confirmed to report earnings at approximately 3:00 PM ET on Monday, August 7, 2017. The consensus earnings estimate is $0.32 per share on revenue of $1.31 billion and the Earnings Whisper ® number is $0.32 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 52.38% with revenue increasing by 49.24%. Short interest has increased by 72.7% since the company's last earnings release while the stock has drifted higher by 0.7% from its open following the earnings release to be 7.9% above its 200 day moving average of $13.99. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 3.6% move on earnings in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ON&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n#CVS Health $77.97 \n> **CVS Health (CVS)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, August 8, 2017. The consensus earnings estimate is $1.31 per share on revenue of $45.36 billion and the Earnings Whisper ® number is $1.33 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat The company's guidance was for earnings of $1.29 to $1.33 per share. Consensus estimates are for earnings to decline year-over-year by 0.76% with revenue increasing by 3.74%. Short interest has decreased by 7.1% since the company's last earnings release while the stock has drifted lower by 5.1% from its open following the earnings release to be 1.2% below its 200 day moving average of $78.92. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, August 3, 2017 there was some notable buying of 4,125 contracts of the $75.00 put expiring on Friday, August 11, 2017. The stock has averaged a 4.0% move on earnings in recent quarters.\n\n#[CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVS&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching this weekend? And what is on everyone's radar as we head into this new trading week ahead? Good trading to everyone in here on this new trading week ahead!\n\n*****\n\nHave a fantastic weekend r/stocks! :)", "id": "6rsn3z", "created_utc": 1501950097.0, "score": 69, "upvote_ratio": 0.88, "num_comments": 12, "comments": [{"body": "Thanks for the overwhelmingly informative post.\nSo what does high Growth really mean in terms of soaring or crashing after earnings? I see some tickers with 300% or even \"infinity\" growth and it just seems too darn easy to buy a lot of stock pre-earnings and set a sensible upwards limit after a surge. ", "score": 7, "replies": []}, {"body": "Thanks so much for this!", "score": 3, "replies": []}, {"body": "How did you make the graph? Pretty cool. Thanks.", "score": 2, "replies": [{"body": "Hey thanks for your comment! :) Which chart are you speaking of exactly? There's quite a bit of links in my post. Let me know.", "score": 1, "replies": [{"body": "The \"S&P HEAT MAP FOR THE PAST WEEK\".\n\n", "score": 1, "replies": [{"body": "Oh that!\n\nThat heat map is courtesy of [Finviz.com](http://www.finviz.com/)\n\nYou can find that exact heat map by clicking [here!](http://finviz.com/map.ashx?t=sec_all) ;)", "score": 1, "replies": []}]}]}]}, {"body": "This is great.  Thank you so much for this, REALLY APPRECIATED!!!", "score": 2, "replies": [{"body": "You got it! And thank you so much for chiming in with that comment /u/applebologna! It's much appreciated. :)\n\nI hope my post wasn't too \"overwhelming\" for you folks as far as all the text and links, etc. If it was let me know! I'll try to downsize this in future threads.\n\nI really am just largely testing this out on here this week. Never done a weekend thread here at r/stocks quite to this extent lol.\n\nThese threads are even more extensive than my daily market movers & news posts...mostly because of the earnings data.\n\nAnyway, thank you again for your awesome comment. You rock! It's redditors like you who make this sub amazing IMHO. ;)", "score": 2, "replies": []}]}, {"body": "Great thread, OP. Thanks!", "score": 2, "replies": []}, {"body": "This should get more upvotes. ", "score": 2, "replies": []}, {"body": "I feel like at this point, we should sell when everyone else is buying.  ", "score": 1, "replies": []}, {"body": "Holding 30 shares of $NVDA from 163.15", "score": 1, "replies": []}]}
{"title": "[INSIDER INFORMATION] $BBBY", "selftext": "[deleted]", "id": "6rurc0", "created_utc": 1501972434.0, "score": 29, "upvote_ratio": 0.84, "num_comments": 13, "comments": [{"body": "all this to buy commons? How boring r u?", "score": 26, "replies": [{"body": "They have shrinking sales, because of online shopping, and most of their easily liquefiable value is in merchandise inventories. Their merchandise value to cash is 6:1. They aren't stacking cash to buy out manufacturers like Wamsutta anymore, they are just trying to sell stuff at their current stores. I don't foresee incredible growth in their future, but it should be a good step forward.", "score": 6, "replies": []}]}, {"body": "Dad, what are you doing on the internet?", "score": 7, "replies": []}, {"body": "Retail apocalypse be damned, management showing competence and making good profit focused decisions (fuck them employees) is a buy in my book. ", "score": 10, "replies": []}, {"body": "I mean, this sounds good, but doesn't downsizing mean they are conceding the retail fight to Amazon and now are just trying to stay afloat as long as they can?", "score": 3, "replies": [{"body": "Downsizing ... or a RAD merger?", "score": 7, "replies": []}, {"body": "yes", "score": 1, "replies": []}]}, {"body": "OP actually meant Best Buy, the extra B is for BYOBB.", "score": 2, "replies": []}, {"body": "Not really news. Every single industry is doing this. It sucks and will kill wage growth. You can count on the next jobs report being stellar YET AGAIN.... ", "score": 1, "replies": []}, {"body": "Word is it's being bought by a private equity firm in December. 880 Managers let go on 8/4. ", "score": 1, "replies": []}, {"body": "Buy retail stock at 5 year low. OK", "score": -4, "replies": [{"body": "maybe he should have bought at 5 year high. buying on low there is way more upside", "score": 10, "replies": []}, {"body": "Yeah, don't you know you're supposed to buy high and sell never?", "score": 5, "replies": []}]}]}
