{"title": "Bought my first contract", "selftext": "Apple 280 calls expiring 12/20, still learning here and dont really know what to expect so starting cheap\n\nEdit: didnt know I couldn't buy options afterwards so I cancel those and bought 285 calls.", "id": "ebfi3x", "created_utc": 1576504932.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 14, "comments": [{"body": "Apple calls are cheap lol?", "score": 5, "replies": [{"body": "$23 for $300 1/10 call, pretty cheap.", "score": 1, "replies": [{"body": "Fair enough, although they’re cheap for a reason. 7% gain in less than a month is stretching it a bit but I guess it’s not impossible. I suppose you could find a cheap option on any company if u choose a strike far out enough.", "score": 1, "replies": [{"body": "It was cheap because it was actually a calendar spread I sold 1/3 same strike. While I’m waiting for the position to materialize, or not, I’ve got someone else dangling with shorter time to get it done. I’ve made $2 on the position and it’s done nothing but trade flat since opening.", "score": 1, "replies": []}]}]}]}, {"body": "Keep us up to date", "score": 3, "replies": [{"body": "I bought the calls but they didnt go through yet?? Bought them before market open, apple prices are climbing too... I hope I dont miss out? I bought an additional contract. Really hoping to not get discouraged here", "score": 1, "replies": [{"body": "You cant buy options when the market isn't open, that is probably why it didnt go through", "score": 2, "replies": [{"body": "Well wtf do I do now. Shouldn't it have told me", "score": 2, "replies": [{"body": "The call prices probably jumped at open meaning nobody was willing to sell to you at your original price. I would just cancel the order and resubmit it if you want it to fill fast.", "score": 1, "replies": []}]}]}]}]}, {"body": "I popped my cherry last week too. $65 call on WWE, $60 on TSM expiring 12/20, Lol.  Not doing too hot so far", "score": 1, "replies": [{"body": "You gotta take some lumps in early days. WWE was at $100 not too long ago. I think that was exaggerated, but I do feel that they’re an $80. I don’t know a ton about TSM, but it’s been popular lately.", "score": 1, "replies": [{"body": "Yeah and I think they’re going to be back up to the $80 mark soon.  Their earnings reports are always a crap shoot though so I’ll be steering clear come late January...and I think I’m going to cut my losses on TSM tomorrow if they aren’t rebounding by mid day.", "score": 1, "replies": []}]}]}, {"body": "Looks like a good buy, imo. What price was the contract?", "score": 1, "replies": [{"body": "62 for each. Was up 71 now its dancing around. Currently at 20..", "score": 1, "replies": []}]}]}
{"title": "Was holding a TSLA 377.5, SPY 314, and an AAPL call, what a good day!", "selftext": "", "id": "ebh630", "created_utc": 1576513029.0, "score": 87, "upvote_ratio": 1.0, "num_comments": 20, "comments": [{"body": "Sell soon brotha. I don’t want your day to be ruined in a few hours. We’ve all done it", "score": 20, "replies": [{"body": "I did! Been through that far too many times to fall for it again hahah", "score": 10, "replies": []}]}, {"body": "Take the money n run", "score": 9, "replies": [{"body": "That’s what I did! It becomes wayy to stressful just trying to keep the gains going", "score": 5, "replies": [{"body": "Good job!  Don’t let the gains burn a hole in your pocket. Do your DD and flip it again. \n\nI started with $100. Got it to $600. Now I’m stuck around $300-$400 because I didn’t do any DD.", "score": 4, "replies": [{"body": "What’s DD?", "score": 2, "replies": [{"body": "Homework (due diligence)", "score": 3, "replies": []}]}]}]}]}, {"body": "had puts on all of those - showing the exact opposite day lol", "score": 5, "replies": [{"body": "Oh man, sorry to hear that. I wasn’t expecting such a change either", "score": 1, "replies": [{"body": "That's alright. I win some, I lose more. But I'm learning!", "score": 1, "replies": []}]}]}, {"body": "Wow I wish", "score": 2, "replies": []}, {"body": "Nice gains!", "score": 2, "replies": []}, {"body": "Good shit bro!", "score": 2, "replies": []}, {"body": "Naked calls?", "score": 2, "replies": []}, {"body": "Good shit!", "score": 2, "replies": []}, {"body": "fake and gay", "score": 2, "replies": [{"body": "Lmfaoo your real name is in your reddit username?? Ur wild", "score": 1, "replies": []}]}, {"body": "Hype", "score": 1, "replies": []}, {"body": "u/user9153 how much money did you make on TSLA since it’s sitting at 381 now? Nice job!", "score": 1, "replies": [{"body": "Sold out when it started to fall slightly at like 11:00am. Have made this much and lost it all before selling out and couldn’t do it again! Thank you!", "score": 1, "replies": []}]}]}
{"title": "Thoughts about Tesla", "selftext": "I’m definitely not an expert or anything, but originally I thought Tesla was a really good buy. But currently, I feel that it is overvalued. This is because of its crazy increase in value over the last few weeks. What are you guys’ thoughts. I’m asking because I’m currently debating if I should buy, but my gut is telling me it will fall and fall hard", "id": "ebh8ou", "created_utc": 1576513343.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 10, "comments": [{"body": "Just because the stock kept falling and rising doesn't mean that will keep happening forever ... (at the same levels)\n\nIf upcoming Q4-2019 and Q1-2020 Quarter's are profitable SNP500 inclusion is likely and this would force a lot of buying by funds", "score": 5, "replies": [{"body": "Oh wow it never occurred to me that tsla with such a huge market cap wouldnt be in the s&p500. What line does it have to cross to be included?", "score": 1, "replies": [{"body": "TTM Profitability is the key one.", "score": 2, "replies": []}]}]}, {"body": "If you are not comfortable with the price right now just don’t pay it. Just keep some money on the sideline that can be invested in Tesla if it drops. Or you could dollar cost average the position. You could start buying a little bit here and there then buy more over time.", "score": 3, "replies": []}, {"body": "It's a speculative play for me. 3% of my overall portfolio. I buy fractional shares, so 20$ here, 20$ there etc", "score": 4, "replies": []}, {"body": "STRANGLE THE BEARS", "score": 2, "replies": [{"body": "No. Let the bears breathe so we can get more tsla cheap.", "score": 1, "replies": []}]}, {"body": "Then do a short option", "score": 2, "replies": [{"body": "He shouldn’t short if he’s an amateur. I stay far away from that myself since i’m by no means a good enough investor to make shorting look like anything other than a noncalculated bet.", "score": 1, "replies": [{"body": "I have a theoretical background in finance as I took several finance classes and I'm aware of the huge risks of shorts as I can lose unlimited amounts of money...especially at the current rate Tesla has been increasing in value. Totally agree with you that it'd kind of be a bet now. But in terms of non-theoretical (real-life investing) I have no experience. I feel like a lot of things break down in the real world. For example, often, markets are not rational and sometimes not everything is priced in.", "score": 1, "replies": []}]}]}]}
{"title": "Predictions on how low Boeing will fall?", "selftext": "[deleted]", "id": "ebhha0", "created_utc": 1576514385.0, "score": 2, "upvote_ratio": 0.76, "num_comments": 8, "comments": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Haha love the risk.", "score": 1, "replies": []}]}, {"body": "Their share price since the 737 Max incidents hasn't gone below 320.  There was also bad press about boeing regarding their defense business in that time period.  I predict it wont go far below 320, if it goes to 320 I'm buying calls.", "score": 3, "replies": []}, {"body": "I got in last week because the idea is the max will be rolled out, so I wasn't worried about a dip and knew about 325 330 was likely the bottom and once max issues ironed out it would go up. I planned to gradially buy shares until about 100.\n\nI sold this morning though, because my thesis and the narrative is blown up now. The reason it's dipping again today is because there was news the max will never be rolled out. If that happens, the stock is going into the 200s because most of the current price was based on the max. \n\nI was fine with delays, but canceling is a whole different thing", "score": 2, "replies": [{"body": "Yea that’s a huge blow up. I’m hoping it dips into high/mid 200’s. If so I may grab some as long hold.", "score": 2, "replies": []}]}, {"body": "it will go as low as investors are willing to sell", "score": 2, "replies": []}, {"body": "Time to buy?", "score": 1, "replies": [{"body": "Nooootttt yetttt... but soon... very soon 😈", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Unfortunately, my hands are tied from acting on BA stock moves given personal work dealings. The stock def has room to move south from the ~325 point... to 295-315... it’s a buy now either way (IMO); it simply depends on how much “on the cheap” you would like to shoot for and/or the level of near-term losses you are willing to endure.", "score": 2, "replies": []}]}]}]}]}
{"title": "$msft", "selftext": "Ive been waiting for a dip before earnings to buy in. But the price keeps rising. Does anyone think it's going to fall and be re adjusted for earnings or dil before then? I mean how can it rise so much between earnings and not fall on earnings or fall because it is inflated?", "id": "ebhlly", "created_utc": 1576514903.0, "score": 7, "upvote_ratio": 0.65, "num_comments": 16, "comments": [{"body": ">Ive been waiting for a dip before earnings to buy in. But the price keeps rising\n\nAnd this, ladies and gentlemen, is what you get for trying to time the market.", "score": 56, "replies": [{"body": "I tried it once – missed out on 19% gains over 5 months because of it ($ENB). Never again. :-\\\\", "score": 7, "replies": []}, {"body": "Lol tru", "score": 1, "replies": []}]}, {"body": "Msft is a good company. Buy some regularly and youll catch it at all price points", "score": 12, "replies": []}, {"body": "sometimes it goes up, sometimes it goes down", "score": 6, "replies": []}, {"body": "If you plan to hold for longer then 5 years now is as good a time as any to start to average in if you believe in the company in the long term. Some of the best investors in the world have missed buying into stocks because it didn’t meet their own personal valuations waiting for a dip or big sell off. \n\nTom Gaynor from Markel made a good point about this. He could have bought BRK.A for 500$ and he thought “there’s no way that stock could possibly be worth this much”.....he waited and ended up finally buying in some number of years later when it was worth 5000$.", "score": 7, "replies": []}, {"body": "You inspired me to buy some of their stock right now.", "score": 3, "replies": []}, {"body": "I sold msft at 140 #regrets", "score": 2, "replies": []}, {"body": "Look at the most successful stocks out there and look at their climb over 5 years, now look at Microsoft. It's the same thing, the longer you wait the more expensive it will become. \n\nThat being said I'm in the same shoes you're in. Been watching this stock for years and never pulled the trigger. I'm going to once I have some more money saved up and I'm going to try and not think about how much money I missed out on.\n\nEdit: It's up $4.43 in the past week, probably gonna be up another $3-$4 in another week.", "score": 1, "replies": []}, {"body": "JEDI and future bolt ons to it should ensure that company overhead in services is covered for years to come.  It’s a winner.", "score": 1, "replies": []}, {"body": "More money is missed out on by waiting than is ever lost by investing now", "score": 1, "replies": []}, {"body": "Do like Google better.  But really owing the big 5 and you are set\n\nGoogle, Amazon, Facebook, Apple and Microsoft.", "score": 1, "replies": []}, {"body": "I bought a year long call for my birthday earlier this year to hit 175 by this coming June. The last few months were scary but the last few weeks have been pretty sweet. Here’s to hoping for above 180 by March", "score": 1, "replies": []}, {"body": "MSFT is going to keep rising unless the entire tech sector gets hit again for whatever reasons. They don't have a lot of competition in the Office products but competing with AWS on the cloud sector. Buy it now, it will be over $200 in 2020.", "score": 1, "replies": []}, {"body": "Read Nadella's book \"Hit Refresh\". You'll understand why you shouldn't wait for a dip - the company is rising.", "score": 1, "replies": []}]}
{"title": "Any thoughts on AMD in the following year?", "selftext": "[deleted]", "id": "ebjkru", "created_utc": 1576523465.0, "score": 5, "upvote_ratio": 0.74, "num_comments": 18, "comments": [{"body": "I dont see AMD going much higher near-mid term. Everything they got going on is already priced in. I love the product but even the consoles coming out a year from now are already in the price. Not much left to make it go up but theres alot that can make it fall. I'd put the money elsewhere till you can get it at a good price", "score": 6, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "Congrats on your massive gains though 💪", "score": 3, "replies": []}]}, {"body": "They’ve already been pushing all time highs for a while now, not sure how long it can continue. But I’d say you’d probably have decent returns if you wait a year from now. Keep in mind it also heavily depends on how the trade war goes.", "score": 7, "replies": [{"body": "Thanks!", "score": 1, "replies": [{"body": "Id say anytime before the new consoles come out personally cause they will be the supplying the components for the Xbox and the ps4", "score": 1, "replies": []}]}]}, {"body": "I personally am long AMD for a couple reasons. \n\n1) they’ve secured contracts with Microsoft and Sony for their processors to be in the next gen consoles. \n2) they make better processors than Intel at a fraction of the price\n\nKeep in mind that their future earnings are not priced in yet. The stock is in this weird limbo with an outrageous PE ratio because their stock price has lapped their earnings. Nonetheless, AMD offers a very valuable product on the cutting edge of future technology and for that reason I don’t believe they will slow down.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Only other recognizable chip maker? I like AMD as well but what universe are you living in", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "When that person puts thoughts out in public, yes? What the fuck is the point of posting opinions on the internet otherwise? You stated flatly it is the only other recognizable chip maker. By market cap alone there are a dozen bigger players. Even if you limit it to the PC community nvidia is massively larger.", "score": 3, "replies": []}]}]}]}, {"body": "I certainly wouldn't be looking to buy AMD at these levels. If I owned any stock I'd be selling now.\n\nThe current P/E ratio is over 200, compared to the industry average of 30-35. To be valued fairly against peers, earnings would need to jump at least 400% in the next year but expected to grow less than 100% per year over the next several years. This is supported by a PEG ratio of over 5 - very expensive.\n\nFurthermore, market cap is 50B today, which is greater than 7 times revenue. This represents poor value vs. other semi-conductors.\n\nNo doubt AMD is a great company with fantastic management in an expanding sector but that doesn't mean it's shares are great or fantastic.\n\nThat's not to say the share price won't appreciate further - investing due to FOMO is real and may push prices higher in the short-term but at these prices any bad news is likely to lead to a significant fall and lots of new investors will end up getting burned.\n\nI'd expect the share price to fall to around 50% of current levels within the next couple of years as earnings won't keep up with the valuation.\n\nHope my opinion helps your decision!", "score": 3, "replies": [{"body": "As a guy who went long $AMD three years ago at 14.51 and finally realized gains last week, I appreciate your analysis.\n\nNGL I was a bandwagon buy back when #suebae was a thing and I've been trying to learn to analyze like you do.", "score": 4, "replies": [{"body": "Congrats on the gains that's a very impressive annualised growth rate! IMO too many investors lately have been investing in high growth, hyped, high risk investments (UBER, BYND, BTC) without considering the value proposition. Ultimately such investments are unsustainable in the long run.\n\nIf you're interested in value analysis I'd recommend reading Intelligent Investor by Benjamin Graham. It's long and old-fashioned but nothing better has since been written.", "score": 2, "replies": [{"body": "Thanks! Like I said though it was basically luck but it did help inspire me to learn for myself. Most of my current picks are based on some simple analysis (and a couple bagholds from other advice I blindly followed ¯\\_(ツ)_/¯)\n\nI've got the book! I've been slowly working through it. I've found it's not beginner friendly so it takes time to absorb and research each little bit. I've found some pretty great tutorials through that process though. It's pretty easy to get inspired to learn when you're seeing green!", "score": 1, "replies": []}]}]}, {"body": "Intel's market cap is $251b and everything they make is obsolete to AMD's products.", "score": 1, "replies": []}]}, {"body": "Next generation will be on N7+ and will be another very strong generation. TSMC is leveraging EUV lithography and has been crushing it lately. \n\nIntel has been stuck on 14++++ for 6 years and the only new thing coming out for Intel is new security vulnerabilities. \n\nServer people are flipping and next gen consoles are also both running AMD. At this point everyone can see the writing on the wall, but it hasn't really happened yet. The market is usually pretty skeptic pricing in disruption, so if you believe AMD can execute, it's worth getting in.", "score": 2, "replies": []}, {"body": "Sort of. If you just want to hold them for a year I would honestly buy option calls that expire in a year, you'll make a lot more money.", "score": 1, "replies": []}]}
{"title": "Boeing", "selftext": "[removed]", "id": "ebmmzm", "created_utc": 1576536722.0, "score": 6, "upvote_ratio": 0.81, "num_comments": 18, "comments": [{"body": "Boeing has broken through its support level if I am reading the charts right, it’s still up 1.4 percent for the year.  With no support level in the charts I could see it breaking below 280, if it does that I see it finding support around 250.", "score": 3, "replies": [{"body": "$250 I’m buying that 🤑", "score": 3, "replies": []}]}, {"body": "I think itll fall below 300", "score": 3, "replies": [{"body": "It bounced off 320 range multiple times. Every time it did it shot up to 370-380. Its gonna do the same thing. Ba is just too big to fail. Orange man won't let that happen", "score": 1, "replies": []}]}, {"body": "I would buy more on the way down to lower my cost average", "score": 5, "replies": []}, {"body": "Bought some today. Will average down if it goes lower.", "score": 2, "replies": []}, {"body": "I was holding from the initial fuck up, hoping this would be a Chipotle, and sold today before the confirmation", "score": 2, "replies": []}, {"body": "The max was launched end of 2017 and their share price was around 260. Much of the runup over 300 has been from the max. And even though the plane has been grounded, there has been hope that it'll take off again. Now we know this is not the case. So in my opinion, it's definitely going down more. I think 260 is possible but unlikely. Chart looks like it'll be hard to break below 300, lots of support, but if it does it'll go to 260. I can't imagine any lower than that is possible. I might be a slow buyer starting at 300 then averaging down if necessary", "score": 1, "replies": []}, {"body": "I’ve been bearish on this since the 737M was grounded. I know it’s only a small part of their enormous business hence the resiliency of this stock but the fact they are “temporarily” halting production from Jan should be a deafening alarm call to any investor.\nThis aircraft is doomed and the public won’t trust it again even with global recertification.", "score": 0, "replies": [{"body": "Agreed, I’m gonna bet the 737 is completely dead from a branding aspect and the next class will be something like a 738. Too many people would associate it with the Max but what do I know?", "score": 0, "replies": [{"body": "Maybe in the first couple of months after they return to the air.  But their backlog is 100's of planes and 5+ years.\n\nPublic are fickle and I don't think it'll make any difference 2 years from now.", "score": 4, "replies": [{"body": "Let's say 4 years from now theres another crash it might be for a totally different reason but before the investigation even begins investors will be exiting like the company is burning to the ground because people dont forget", "score": 1, "replies": []}, {"body": "An order book means nothing if you can’t make the planes in time or at all. \nBuyers are fickle and impatient too. I have a feeling we’ll see a steady stream of 320NEO order’s next year and the next 5+", "score": 1, "replies": [{"body": "Errr the a320 has an 8 year back order.\nSo who do you buy from in the mean time?", "score": 1, "replies": []}]}]}, {"body": "Without looking it up, what vehicles from toyota were involved in the “unintended acceleration”?", "score": 2, "replies": [{"body": "The Camry was the one I remember the most from that dude on the news with the run away one but Toyota also has 10-15 different models. Boeing has like 4 then sub classes", "score": 1, "replies": []}, {"body": "There are ways to stop a car out of control but a plane not so much", "score": 1, "replies": []}]}]}]}]}
{"title": "Long post about teslas becoming a empire, but company/market killer in the short term.", "selftext": "  \n\nWhy tesla could be the cause of the next recession (unwillingly)\n\nTesla today is innovation on their electric cars like the devil is chasing them. They have been able to go from a tiny car producer to now a good-sized mass producer in the span of less than 10 years. That is very impressive considering the business it’s going into. \n\nHowever, I am writing this because I am seeing a huge disruption going on. In fact, it’s so large that I think it could damage the economy in a major way. Tesla is naturally is not trying to start a recession. But it so happens that it is disrupting a market where there are almost 90 million cars sold a year. It is not an easy business to get monopoly regardless of your amazing products. And taking majority market share even with unprecedented growth rates will still take many years. \n\nTesla is developing autonomy, and from an interested person on the sidelines it looks like the only winning strategy being used across all companies. And they are far ahead if it is that. They are so far ahead that Elon musk project robotaxies by the end of next year. I mean even for a bull like me I consider that quite aggressive. But looking at the competition it doesn´t really matter whether its 1-4 years. It seems tesla will still be ahead. Let’s say they make it in 3 years. So that in 2022 they will have their entire fleet wake up. By then competitors will all most likely have their first EV´s on the market however as we have learned they don’t sell as well as expected, people who want Electric vehicles, they want Tesla´s and they are willing to wait for them. (the fact that they are willing to wait for them is an important to keep in mind)\n\nWe have a company that currently has a production capability annually around 0.5% of the total world market. They are a rapidly growing company, but still relatively small in comparison to the size of the market. Which is great for tesla investors. The shoes are big and plenty of room to grow into. Elon musk is not slowing down the innovation. And the OEMS are trying to react to tesla did in 2012 with their model S. Not with great success so far.\n\nThe problem begins however and my thought behind this paper is when Tesla´s products are so advanced in comparison to the competition ICE/EV that people simply won’t want to buy them and rather wait for a tesla. I think tesla will sell around 1 million vehicles in 2021. Still around only 1 % of total market sales.\n\nThis takes me back to think about autonomy. Now we are close to 2022 the year I (conservatively) said that tesla gets approved to run full robocars. All their cars will sky rocket in value. Everybody will want an autonomous car, and they are willing to drive their current car for another few years if it gives them the chance to get an autonomous car. This is all great for tesla. But what about the competition. They all have debt close to the 100 billion, to be able to finance they need to sell cars. The thing is about giants, they tend to fall quite hard if you use their own weight against them. And this is what I see coming for companies such as ford and GM. They have so much outdated infrastructure. A lot of the assets turn into liabilities, because an ICE research and development plant has little value, if you are selling no Ice cars and only EVs. They will however still need to pay for all the debt they have taken on. That would be possible if everything stayed the same and nobody pressured to move quicker. But tesla is that somebody. Gm and ford will run into problems if they only sell about 70% of what they are currently selling. They won’t be able to pay dividends, which will make their investors flee, cutting severely into the valuation. In the end, they will go bankrupt, Together with many of the suppliers who also didn´t change fast enough,and this time I don’t think the government will help them out.\n\nThis takes me to dealerships. How are they going to survive, they will not sell nearly as many cars? Everything will just dwindle slowly. Eventually once the business isn´t sustainable the dealership will shut down, and this force even more old ICE owners to buy EV´s.\n\nLet’s take it to the last step, what will happen to oil companies/prices?\n\nWell this is probably the one that will take the longest since the global fleet won’t be replaced in a few years. But eventually it won’t be profitable half the oil companies and they will have to shut down. Simply because demand isn´t there for their oil\n\nAcross these several industries we are looking at millions of jobs being disrupted.\n\nThis is me going on a rant, but to me it seems like a house of cards. And tesla is the bulldozer who after knocking everything down will build the house with proper materials, that can last sustainably.\n\nI think in the short term this disruption in the short term could screw up the economy majorly. Because If I put myself in the place of the consumer. What do I want an” expensive gas car that needs service and I probably won’t be able to sell again, or buy an autonomous Electric car with total cost of owner ship half of the Gas car. I mean even for an EV hater those are some obvious options. \n\nThis was me thinking what could happen, I am not saying it will happen, because it is quite far stretched, but that’s the thing about far stretched things. They all seem that before they happen, and then you look back and say” Huh that was obvious”.\n\nDisruption curves they all look like S curves. In the recent years the S forms have been leaner(smartphone), (internet),(Facebook) , meaning that it takes fewer years to get complete adoption. Once the disruption tech reaches 10% market penetration, the demand for it explodes, and then slows down at 85-90% for the late adopters.\n\nThis however all comes down to how quickly the competition is at jumping on the EV bandwagon. I hope for everyone, they realize their mistakes before its too late. So, buying anything but a tesla will seem like a shopping cart.\n\nHope you enjoyed the read.", "id": "eb7nrn", "created_utc": 1576457792.0, "score": 15, "upvote_ratio": 0.73, "num_comments": 13, "comments": [{"body": "Every dollar people don't spend on transportation is a dollar they can spend somewhere else.  Electric autonomy making transportation cheaper will lead to a more productive society as we waste less money on extracting and then burning expensive fossils. The transition from horses to cars was hugely disruptive but it caused a boom, not a recession.  That's the way of most disruption.  Many jobs will be lost, but more wealth will be created than lost.", "score": 16, "replies": [{"body": "> Every dollar people don't spend on transportation is a dollar they can spend somewhere else.\n\nI think a fair argument can be made in favor of a huge economic boom due to EVs: 1,000,000,000 ICE vehicles have to be replaced in the next 10-20 years, in an accelerated transition driven by customers, where demand will be higher than supply for extended periods of time.\n\nThe Internet disrupted traditional phone monopolies - but the opportunities that were opened still resulted in an overall economic boom.\n\nElectrification of transportation might in a few decades be referred to as the 5th Industrial Revolution.", "score": 6, "replies": []}]}, {"body": "I think disruption in clean energy and transport is inevitable, and necessary, if we are to avoid the worst of Climate Change.\n\nI also think this video and Tony Seba are mostly right:- [https://www.youtube.com/watch?v=QX3M8Ka9vUA&feature=youtu.be](https://www.youtube.com/watch?v=QX3M8Ka9vUA&feature=youtu.be)\n\nIf a recession is going to happen it is inevitable, as the FF era is doomed...\n\nThe RE era promises  to lift productivity by lowering the cost of embedded energy in each product..\n\nIt also promises to spread wealth and prosperity more widely as developing countries are at less of a disadvantage, and legacy wealth invested in the wrong assets is doomed.\n\nI've seen predictions of a deflationary boom, and I also buy that theory, as products/services become cheaper,  people have more disposable income, and can buy more stuff. RE energy is not resource constrained, and does not cause Climate Change, .,... the limit on what we can consume is what the sun provides, which is more than we need..\n\nAt the same time CC itself will require a lot of work to be done in rebuilding stuff adapting and solving problems, as well it will cause large financial losses. But as a net effect it will probably stimulate economic activity...\n\nSo I think it is true to characterise the coming era as a massive wealth transfer that is long overdue, I don't know what jobs people will be doing. But the first and second industrial revolutions also obsoleted a lot of jobs, and caused a massive wealth transfer....\n\nMoney mostly has a way of changing horses fast enough to survive - especially smart money..\n\nIn terms of the success Tesla can and may have, it could be anything, I see EV market share as on the table, like a gold rush, or a land rush,  Tesla seems to be the only company being proactive enough...\n\nOverall in the long run if we avoid the worst of CC, the world will be a better place, if we have a recession, that is a small price to pay for genuine progress.", "score": 6, "replies": []}, {"body": "If you are in a job that is threatened hedge your life, buy a lot of tsla! My thesis next ten years: petroleum down, oil companies down. Lithium up - lightest metal, won't be easily replaced. co, nickle up - depends on if they can reduce need for these in future batteries. Copper up. Legacy automakers and dealerships down - too much useless equipment and union employees and pensions. Palladium down. Tesla up. Battery manufacturers up - Panasonic, lg, catl. Gas stations down - many bankrupt if cannot profitably transition to ev charging centers, this will also be a major tipping point for evs when it becomes inconvenient to find a gas station since they will have to be located on cheap land i.e. city outskirts. Ev charging equipment makers up. Ev charging station network operators up. Wind and solar up - cheap batteries will smooth out their delivery curves and political push to not power evs with co2 emitting sources. I'm not even getting into autonomy thats another level of disruption. This is going to happen, nothing can stop it now.", "score": 6, "replies": [{"body": "Nice job listing all the components of your Upvotemeok long-short EFT.", "score": 3, "replies": []}, {"body": "I think lithium doesn't really go up.  Its probably so plentiful that a higher demand actually reduces the cost due to economies of scale.", "score": 2, "replies": [{"body": "strange but true", "score": 1, "replies": []}]}, {"body": "SpaceX up, Boeing down, ISPs down with Starlink. \n\nElon's companies are looking to take over transportation, communication, energy generation all at on once.", "score": 2, "replies": []}]}, {"body": "First line will hit dealers, then oems, then oil.  Cracks begin showing in big way 2020.  \n\nAlso this is only talking about tech disruption.  What about millennials & younger who are angry about pollution?!  Not only are they lame old tech, but also ruining the earth.  When public opinion grows w climate change, that may be a larger unmentioned trend.", "score": 2, "replies": []}, {"body": "Far fetched not far stretched. Otherwise A*", "score": 2, "replies": []}, {"body": "Tesla will be not able cover all demand, and people will not wait for a Tesla 10 or more years when they need ride here and now.\nSo others will have market share no matter how Tesla will be superior. \nDealerships, gas stations, services, part manufacturing will not break too as total amount of vehicles on roads much much higher than EVs could replace in next ten years.", "score": 4, "replies": [{"body": "There’s another factor at play.  A 1M mile EV robo-taxi can displace 4-5 ICE vehicles.  So as Tesla scales to 2M-3M EV robo-taxis/ year, that can displace > 10% of the global fleet, and they would probably be doubling production every year in that scenario.  As Op noted, many traditional auto companies are in precarious positions, I believe Ford is effectively borrowing money to make their dividend payments for example.", "score": 1, "replies": []}]}, {"body": "Nah. For every legacy company that gets disrupted out of existence, a bunch of little startups are created whose business model wouldn't have worked if the market hadn't been disrupted.\n\nSelf driving, if it becomes a reality, will lead to cheaper home deliveries, for one.", "score": 1, "replies": []}]}
{"title": "VIX futures at 19% ?", "selftext": "[removed]", "id": "eb8puj", "created_utc": 1576463041.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 14, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I think the extended session is open now", "score": 1, "replies": []}, {"body": "What's this on FinViz?\n\n[VIX Futures](https://finviz.com/futures_charts.ashx?t=VX&p=m5)", "score": 1, "replies": [{"body": "these are VIX futures not VIX index those are largely made up", "score": 1, "replies": [{"body": "OP said VIX futures...", "score": 1, "replies": []}]}]}, {"body": "VIX futures are trading", "score": 1, "replies": [{"body": "vix futures are just a made up number tho", "score": 0, "replies": [{"body": "Haha that really did make me laugh", "score": 1, "replies": []}]}]}]}, {"body": "A rising tide lifts all ships?", "score": 1, "replies": []}, {"body": "wtf", "score": 1, "replies": []}, {"body": "Prolly some rouge algo or very low liquidity, but the $3 spikes in the course of 2 mins is crazy.", "score": 1, "replies": []}, {"body": "What in gods name", "score": 1, "replies": []}, {"body": "Futures are BLOOD GREEN. \n\nRIP in pepperoni my TQQQ puts 😖", "score": 1, "replies": []}, {"body": "VIX futures are currently down 0.5%.  from my experience if some huge move on investing.com doesn't seem right it's because it isn't.", "score": 1, "replies": []}, {"body": "Lookit VX https://www.investing.com/charts/futures-charts", "score": 1, "replies": []}]}
{"title": "I know it's not a lot but I just made a thousand bucks on Tesla calls in my first successful option trade.", "selftext": "[removed]", "id": "ebgtyd", "created_utc": 1576511480.0, "score": 42, "upvote_ratio": 0.94, "num_comments": 19, "comments": [{"body": "You guys are making money????", "score": 54, "replies": [{"body": "Yeah...... for somebody else, of course...", "score": 9, "replies": []}, {"body": "I got a free stock from Robinhood for signing up. IM ALREADY UP $4.16 !!!!!", "score": 7, "replies": []}]}, {"body": "“Low risk options” HA", "score": 38, "replies": [{"body": "The greatest lie ever told", "score": 3, "replies": []}, {"body": "ya’ll got any more of them low risk options?", "score": 2, "replies": []}]}, {"body": "The first one is always free.", "score": 15, "replies": []}, {"body": "You are not welcome here.  But congrats!", "score": 9, "replies": []}, {"body": "My first gambles printed money too, now I bitterly wish I just put everything in Ally or $SPY instead", "score": 6, "replies": [{"body": "That’s always the case. Longs win over longer periods of time. Day traders almost always lose money.", "score": 1, "replies": []}]}, {"body": "‘Low risk options’", "score": 5, "replies": []}, {"body": "I'm pretty new to options as well, good work! I like to take a few days/weeks off after big wins. Let your excitement settle and keep looking for the next big play. Find a good entry point and tackle it when it shows itself. Don't jump the gun too quick.", "score": 3, "replies": []}, {"body": "options aren’t for the low of risk", "score": 2, "replies": []}, {"body": "At WSB $1,000 leads to $1,000,000,000 so welcome to the Yacht club.", "score": 2, "replies": []}, {"body": "You’re gonna get a lot of people making jokes but congrats, your first grand always feels great. Now control your ego and don’t trade for a day or two", "score": 1, "replies": []}, {"body": "Tesla = low risk options ?", "score": 1, "replies": []}, {"body": "This made wiener not hard bro.  \n  \nNot cool", "score": 1, "replies": []}, {"body": "Then, you start increasing your risk to become the almighty analfarmer", "score": 1, "replies": []}]}
{"title": "Tesla to the Mars confirmed DD 🚀", "selftext": "I was laying in bed, looking up at the model solar system which hangs from my ceiling, and remembered that the moon isn't even important enough to be in my toy solar system. The moon (assuming we've been there) as we know it is just a big gray lump of coal that we can't get to fuck off out of our gravitational pull or whatever. Don't even get me started on the tides cause nobody gives a fuck, we aren't surfers. Anyways, everyone always talks about stocks going to the moon but think about it the moon sucks and isn't that far away. Tesla, on the other hand, is *actually* going to mars. Mars is badass. Elon is taking us loyal shareholders into fucking outer space. Also, mars is several galaxies further into space compared to the moon, so think about the relative tendies. Don't settle for the moon, go to mars!! Not convinced? Still a moon-er? (ew) At least mars is dignified enough to hang from my ceiling and have water. Don't care about space? Think people are satisfied with air travel? just look at BA, we're all shorting those shitty 7qwerty7s back down to earth. LONG Elon cause once we get out of this shitty atmosphere there's no gravity to bring our accounts back down.", "id": "ebmuto", "created_utc": 1576537679.0, "score": 73, "upvote_ratio": 0.86, "num_comments": 16, "comments": [{"body": "Who will get to Mars first, a bunch of diversity hires at NASA, or white supremacist and african american Elon Musk?", "score": 63, "replies": [{"body": "Don’t forget he’s kinda Canadian too", "score": 13, "replies": []}, {"body": "I feel like as an african american billionaire, Elon should be mentoring Diddy instead of Connecticut country club #hedgefundsowhite Ray Dalio.", "score": 6, "replies": []}]}, {"body": "You are gay bro", "score": 15, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "quality", "score": 2, "replies": []}, {"body": "If TSLA crosses Dec 20 $390 callls once it breaks over $386 is a good trade. 650k volume on a 10m chart.", "score": 2, "replies": []}, {"body": "This has been the single most motivating post here.", "score": 2, "replies": []}, {"body": "I’m gay for Elon too", "score": 2, "replies": []}, {"body": "good try", "score": 1, "replies": []}, {"body": "did ur mom change ur diaper before this thought, or after?", "score": 1, "replies": []}, {"body": "Mars is in the same galaxy though. How can I trust this DD now?", "score": 1, "replies": []}, {"body": "OP has a model solar system hanging over his bed. OP is an autistic 2 year old confirmed.", "score": 1, "replies": []}, {"body": "Stonks.", "score": 0, "replies": []}, {"body": "We did not go to the moon.", "score": -1, "replies": [{"body": "Prove it", "score": 2, "replies": []}]}]}
