{"title": "BABA | 12/12 Week in Review and forecasts for Monday / Tuesday", "selftext": "**BABA is up for 2 days straight.** The problem is the ups are very small compared to the recent downs. Friday would have been a better day except the DOW lost 315 points as the price of oil dropped, wiping out most of BABA’s daily gains. Despite that, it stayed strong. \n\nMonday can be a good day if oil concerns alleviate over the weekend and could be BABA’s 3rd straight day of increases in a row. Despite the gains, %R is -70 to-80 which might perfect set this up for a long TTC-A bullish trade template. BABA needs to close above $106.23 on Monday to set this up for a bullish run. \n\nIf it can again close up on Tuesday and any one of those closes (Monday or Tuesday) is a 1.2% increase over the previous day we’re going to have a good run through the end of the year / Jan, despite options expiration and the unlocking of 8 million shares. \n\nI believe the share unlocking is already built into the current price. Couple things can happen Monday with the markets relating to Oil.\n\n* Oil prices drop can ease helping the overall market and giving BABA the 1.2% needed boost. \n* Oil prices can stay the same, and BABA may see slight increases but rather minor, not likely 1.2%\n* Oil can tank further taking the market down with it and BABA, and my portfolio.\n\nMonday and Tuesday Industrial Production and Housing starts are being reported. Monday’s industrial production, if higher than thought can offset damage to the markets by Oil and Tuesdays housing starts have the ability to do the same. \n\nI try to be helpful and informative with my posts, if I can answer any questions for you let me know.", "id": "2p700m", "created_utc": 1418498622.0, "score": 1, "upvote_ratio": 0.66, "num_comments": 11, "comments": [{"body": "[deleted]", "score": 2, "replies": [{"body": ">Except that low oil helps Alibaba:\n\nNext quarter earnings report, yes, BABA will jump.\nNext week, no, like you said:\n\n>Only idiots are selling at this ridiculously low prices, and mostly because they need liquidity to cover their margin on energy.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'll go ahead and say it, you were right. Score me: 0, you 1. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> By 0.12%? This is unsignificant. Also, 2 days? Who cares about 2 days?\n\nI'd say you were right on this. It can't even pull 3 days straight of up days...", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well I've got 20 BABA Jan 120 Call options that aren't worth crap anymore. Lost about 90% on it not following my own rules (sell at 50% loss regardless, sell 30 days before expiration). Also bought on emotion rather than study after making some easy money. \n\nAnyways, not following my rules I've lost about 14k. Had I followed my rules I could have at least 50% and been building back up from the loss. \n\nI think I'll sell half for about $.90 to get what little capital in cash I can, and use it for an end of year write off, and maybe keep the other half to expiration in case of a christmas / new years miracle pop. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "BABA will not make $106 on Monday.\n\nBoth candles for Thursday/Friday are Gravestone Dojis. The demand for BABA is tapering off. I also see their fundamental value being in the range of $93 - $111. Their current price is in the high end of that range. While it is possible that BABA *could* rise, look forward to *falling* prices on Monday. That's my best guess. ", "score": 1, "replies": [{"body": "Welp you were right. I really thought this would end higher today as it stayed above water most of the day. Looks like i'll be dumping my options on these Wed, taking a loss and moving on.", "score": 2, "replies": []}]}, {"body": "What the fuck is this shit? Tea leaves reading?", "score": 1, "replies": [{"body": "Huh? ", "score": 1, "replies": []}]}, {"body": "downtrend officially broke this morning.. should start its grind  back up to 120 for next ER", "score": 1, "replies": [{"body": "I'm hoping. We'll see where this closes out today and tomorrow. We haven't seen 3-4 days of solid uptrend since about 3 weeks before the last earnings report. Currently we're about 65 days out...", "score": 1, "replies": [{"body": "should be fine, we tagged the 50% retracement a few days back and looks like we are building the bottom of the bowl atm. Needs to hold above that 103.80 level\nhttps://www.tradingview.com/e/gSD7d8NZ/", "score": 1, "replies": []}]}]}]}
