{"title": "Europeans are actually retarded", "selftext": "[removed]", "id": "8ooadu", "created_utc": 1528176470.0, "score": 71, "upvote_ratio": 0.72, "num_comments": 89, "comments": [{"body": "Italy has been Western Europe's economic asshole for as long as I can remember.\n\nGermany here and we're booming right now. Food is dirt cheap so I don't know what you're on about. Friends getting hired for new jobs within 2 weeks because the economy is on a tear.", "score": 88, "replies": [{"body": ">> Italy has been Western Europe's economic asshole for as long as I can remember.\n\nThe asshole of Europe. \n\n\nTop 10 world economy folks. \n\n", "score": 30, "replies": [{"body": ">Top 10 world economy folks. \n\nWe're working on that.\n\n-the world", "score": 6, "replies": [{"body": "No we’re not. \n\n-Venezuela ", "score": 2, "replies": []}]}]}, {"body": "Deutsche Bank tho", "score": 28, "replies": []}, {"body": "Germany is proof that if the rest of Europe wasn't so pessimistic and started actually taking responsibility for their terrible decisions... they'd have a future. Everyone in Italy just blames Germany.", "score": 9, "replies": [{"body": "Which part of Italy did you go to? Last I checked the north is supposed to do pretty good and gets dragged down by the south.", "score": 17, "replies": [{"body": "I am traveling throughout Italy right now but got a place in Messina and plan to stay there for awhile. The economy there is terrible but my job isn't really affected.", "score": 7, "replies": [{"body": "\\>Messina\n\nBeen the asshole of italy for 2500 years", "score": 16, "replies": []}]}]}, {"body": "I can see why you are here", "score": 0, "replies": []}]}, {"body": "[I have some bad news.](https://www.tradingview.com/chart/DAX/bu4JAtEw-DAX-Short-H-S-descending-triangle-Elliot-wave-count-BEARISH/)\n\nJust waiting patiently to short the shit out of the krauts.", "score": 1, "replies": []}, {"body": "How old are you? Because anyone over the age of 35 probably disagrees with you.  I lived in the shithole known as Europe for a little over 2 years and not once was Italy considered the economic asshole.  Spain & Greece have always been the laughing stock.  \n  \nShit, Italy still has some major manufacturing from industrial consumers in the US.    \n  \nGermany is only doing well for the same reason it has done well since 1945, the US presence.  \n  \nRammstein alone contributes over $1B annually to your consumer economy....... think about that for a second.  Once you add Kaiserslautern and the military/industrial complex into the equation, all it would take is someone like Trump to say \"fuck you fags, we're out of here\" and move to another country, it would absolutely wreck your shit.    \n  \nAdd some \"luxury\" car brand tariffs on that and let's see ole cuntbag ragface Merkel keep acting like she has any kind of real power.  \n  \nFuck the EU.", "score": -17, "replies": []}]}, {"body": "but dat pizza doe how it taste fam", "score": 24, "replies": [{"body": "I highly suggest anybody who gets into yacht territory, skip the boat and buy a vacation house in Naples. Holy shit. I made fun Italian pizza while in America after falling in love with deep dish but I forgot how great it was. I was young and naive when I grew up in Italy and didn't appreciate it. Its absolute heaven", "score": 9, "replies": [{"body": ">buy a vacation house in Naples\n\nWhy the fuck would you do that? That's like saying to Euros \"go buy a vacation home in Detroit\". \n\nThere are lots of places in Italy that are actually decent you know.", "score": 19, "replies": [{"body": "vacation home is a weird way to spell yacht", "score": 10, "replies": []}, {"body": "Pizza is the best in Naples. ", "score": 3, "replies": []}, {"body": "Too true", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Busted! ", "score": 4, "replies": []}]}]}, {"body": "I like capitalism/US because I'm dreaming of becoming rich, being an asshole with a yacht and still getting laid. ", "score": 16, "replies": []}, {"body": "I’d be retarded with healthcare and a livable wage", "score": 26, "replies": [{"body": "Jokes aside, you summed up my issue with people in Europe and what I kinda miss about the US. In the US, its filled with so many desperate, anxiety ridden but optimistic people. Nomatter how much shit you throw at them, they still feel they can be rich/successful one day even if they have stage 4 cancer with no insurance..\n\nEurope on the other hand is so complacent and  pessimistic  . Sure, no skill labor can kinda make a living vs. the US.... if they can find a job\\(unlikely, especially youth\\). But if you have any skills, you make a fraction of what you can in the US and nobody hopes for anything better. It feels like the major issues I have come accustomed to in the US have all but been given up on trying to be solved in Europe. But whatever, healthcare...fuck wealth and growth.", "score": 35, "replies": [{"body": ">  But if you have any skills, you make a fraction of what you can in the US and nobody hopes for anything better.\n\nBut why should I? Work my ass off until the end of times kissing my bosses ass in the hope for a raise and promotion? But never have the time to enjoy my wealth anyway?\n\nI'd rather enjoy my comfy 40 hour work week, make decent money, can have up to 60 paid days off, never have to worry about ending up on the streets if I lose my job or need some medical treatment. \n\nAnd even now I learn plenty of new skills, new exciting projects and responsibilities with matching pay increase. Sure I could probably make twice the money in the US, but it isn't worth it in my opinion. \n\n", "score": 9, "replies": [{"body": "bro, you are for sure in the wrong sub with that attitude. that was some serious anti\\-yacht speak. \n\nthis is the place where we'd gladly put our elderly parents out in the street if it meant we could afford a few more $MU faggies. ", "score": 52, "replies": [{"body": "You don't get rich by working a shitty office job for your boss. \n\nLeveraged options are the way to the yacht. The European welfare just takes away the risk of ending up on the streets after some bad luck. Worst case you end up in an apartment on welfare having all the time in the world to shitpost on the internet. ", "score": 21, "replies": [{"body": "European welfare also fucks you in the ass as punishment for succeeding. ", "score": 3, "replies": []}, {"body": "yeah because taking ridiculous risk with none of the consequences (basically putting your shitty decisions on other productive people) is totally cool and fair", "score": 7, "replies": [{"body": "Yeah but when the US bailed out all the banks it was ok? ", "score": 8, "replies": [{"body": "where are you going to get your money from if the banks dont have it... would have been total chaos and  i was not ok with the excessive risk taking", "score": 4, "replies": [{"body": "Well good that we agree on that. \n\nIf you want to gamble away your wealth be my guest, I don't mind our welfare keeping you off the streets, which causes more trouble. \n\nI'm just happy to not worry about ending up on the streets because of some bad luck or mistakes, and am currently happily paying lots of tax money for that, and hope never will need them for myself. \n\nBut this a way too serious discussion for wsb ", "score": 7, "replies": [{"body": "> If you want to gamble away your wealth be my guest\n\nYeah... that's kind of the point.", "score": 6, "replies": []}]}]}]}]}]}]}, {"body": "> I'd rather enjoy my comfy 40 hour work week, make decent money, can have up to 60 paid days off, never have to worry about ending up on the streets if I lose my job or need some medical treatment.\n\nThis is not sustainable for a long term workforce in the current global trade scheme.", "score": 16, "replies": [{"body": "Germany and France day whaaaaaat?", "score": -1, "replies": [{"body": ">long term  \n  \nEnglish mother fucker, do you speak it? ", "score": 2, "replies": []}]}]}]}, {"body": "JeffBezos_98km\n\n>Europe on the other hand is so complacent and pessimistic . Sure, no skill labor can kinda make a living vs. the US.... if they can find a job(unlikely, especially youth). But if you have any skills, you make a fraction of what you can in the US and nobody hopes for anything better. It feels like the major issues I have come accustomed to in the US have all but been given up on trying to be solved in Europe. But whatever, healthcare...fuck wealth and growth.\n\nI feel like you haven't hung out around the Rust Belt or a poor place in the US - it seems more like that you were in a rich part of the US and are now in a poorer place in Italy. I grew up in an inner city on the US East Coast - that sounds like 80% of my high school class right there.", "score": 1, "replies": []}]}]}, {"body": "Careful mate, you're expressing pro-America, non-Eurocentric views and this is Reddit", "score": 13, "replies": [{"body": "Where do you think you are? ", "score": 1, "replies": []}]}, {"body": "its weird because the bull market in US eventually has to rub off on Italy and it should pick up but its not happening.", "score": 5, "replies": [{"body": "bull market probably does have to end and maybe it already did but what if it stays lit for 10 years. imagine being a fag not buying because you think a crash was supposed to happen yesterday. \n\nid rather lose 40% like 2008 in a crash than look back and realize i lost cuz i was scared of a bear market. ", "score": 14, "replies": [{"body": " I remember reading something about timing the market over the past century. Even if you had the absolute worse luck and put money in the market at the worst possible time; at each market peak through the 20th century before major recession level pull backs... As long as you held through the pull back, you would of seen significant growth. \n\nThe fact that despite this, people don't invest just shows their is little hope and they deserve to retire with no wealth. ", "score": 10, "replies": [{"body": "Tell that to the people that bought TOPIX in 1989 and bagheld.", "score": 2, "replies": [{"body": "Usually the studies he’s quoting look traditionally at US only indices. \n\n\nGet out of here with your naysaying. I bet you hold Spy puts too!  ", "score": 3, "replies": []}]}]}]}, {"body": "Nothing rubs off on those idiots. There's a reason north/west en south Europa can't get along.", "score": 1, "replies": []}]}, {"body": "Parts of Europe are not doing well, similar to how parts of the United States aren’t doing well. If you look at others measures, you will see parts of the United States are doing very poorly compared to Italy, as well as the reverse. For instance you have in Puerto Rico people dying off every day no electricity, in Bama’ a UN report says that Bama’ has the worst poverty in the developed world some parts even have hookworm outbreaks. Regardless, you do have a point.\n\nBut your rant about Tariffs is border line retarded. You are on par with all the other jokers who pick sides based on a tweet or what team they are on, rather than actual issues. Please stfu and spew your rant in politics or something ", "score": 7, "replies": []}, {"body": "How can someone be so cancerous??", "score": 17, "replies": [{"body": "The rest of reddit literally licks eu ass all day. This is the one place where we can be blatantly patriotic muricans.", "score": 7, "replies": [{"body": ">  This is the one place where we can be blatantly patriotic muricans.\n\nExcept most everyone here hates a trade war.", "score": 1, "replies": [{"body": "Why? Trade wars are easy. ", "score": 4, "replies": []}]}, {"body": "K.", "score": -1, "replies": [{"body": "L.", "score": 0, "replies": []}]}]}, {"body": "Hey, Europeans are pretty complacent but I wouldn't go that far. ", "score": 16, "replies": [{"body": "No, literally you.", "score": 24, "replies": []}]}]}, {"body": "You say \"Europeans are actually retarded.\"\n\nYou say you are in Italy.\n\nTherefore, you are retarded.\n\nThat's syllogism.\n", "score": 2, "replies": []}, {"body": "I dunno man, poverty is higher in the US and at least we have some culture ", "score": 8, "replies": [{"body": "It's funny that Europeans think old ass buildings are peak culture. All that shows is you had culture 400 years ago. Not so much now.\n\nRemind me, what website are you on? What video games do you play? What movies do you watch? What social networks do you use? What music do you listen to? Do you wear Jeans and drink Coke?\n\nAmerican culture is everywhere. If this were a game of Civ the US would have won a culture victory. ", "score": 26, "replies": [{"body": "I mean culture in form of manners, food and the way of living. Surely American culture is everywhere, but in my personal opinion most of the American culture is pure consumption without any feel for quality. Naturally not always but in most cases.", "score": 3, "replies": [{"body": ">without any feel for quality.\n\n>website\n>video games\n>movies\n>social networks\n>music \n\nUse the European version of these things for a year, then report back on quality. \n\n", "score": 8, "replies": []}, {"body": "Different manners != Worse\n\nMany Americans would say Northern Europeans are uptight, stuffy, and socially awkward.\n\nAnd food wise America has tons of great food, both influenced from other countries, and food that was created here like Barbeque, Buffalo Wings, Tex Mex, Fried Chicken, Gumbo and so much more.", "score": 3, "replies": []}]}, {"body": "> What video games do you play? \n\nRight now? Witcher 3 and Yakuza 0.\n\n>What movies do you watch? \n\nIndependent movies from all over the world. Last one was the premiere of Modern Love by Takuya Fukushima. Next will probably be something from a local short film festival.\n\n>What social networks do you use? \n\nNone.\n\n>What music do you listen to? \n\nGoing through my 20 most played bands: \n\n - German - 5\n - Swedish - 4\n - Finnish - 2\n - Swiss - 1 \n - American - 2\n - UK - 2\n - Japanese - 2\n - Netherlands - 1\n\n>Do you wear Jeans and drink Coke?\n\nNo and only local brands. Can't stand Coke and Pepsi.\n\nIn my experience Muricans tend to vastly overestimate how popular their shit is.\n", "score": -4, "replies": [{"body": "LOL. You know we can see through this bullshit right?\n\nIt doesn't really matter what you want to claim. The proof is in the pudding. \n\nLook up the best selling video games, movies, and music in Europe. It's all American or British. All around Europe people are wearing Jeans and drinking Coke. \n\nIt's really pathetic how bad you want to prove you don't partake in American culture. \n\nHere's the current Top 40 in Europe. http://top40-charts.com/chart.php?cid=31 ", "score": 5, "replies": [{"body": ">It's really pathetic how bad you want to prove you don't partake in American culture. \n\nThere absolutely is American culture I enjoy, I'm writing this on Reddit after all. Vonnegut is one of my favourite authors, Kubrick and Scott some of my favourite directors.\n\nIt just happens not to be the majority of what I consume. \n\nEdit: Regarding your Top 40. I don't listen to radio or top x in general. Never heard a single song on that list. My favourite death metal band of all time is actually from the US though.\n", "score": 2, "replies": [{"body": "And that's fine.\n\nBut, I think you can see the issue with the common European claim that Americans have no culture. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Hollywood, Silicon Valley, Broadway, Jazz, Rock and Roll, Hip Hop. The personal computer, the internet, the smartphone. \n\nWe invented every major cultural thing of the 20th century.\n\nOh yeah, we invented Pizza too. \n\nEat a spaghetti dick. ", "score": 6, "replies": [{"body": "You joke but some idiots actually think this.", "score": -1, "replies": [{"body": "I'm not fucking joking. Europe being remotely relevant in modern culture is the only joke in this thread. ", "score": 4, "replies": [{"body": "Ok so you are saying you unironically typed that on a **website** using a **computer**.\n\nI enjoy this sub more when it's just pretending to be mentally disabled.", "score": -1, "replies": [{"body": "A website, lol US DARPA invented the internet and the world wide web. Personal Computers we're invented in the US. Although I'm using g a smartphone, also invented outside of dystopian Europe. \n\nThe only autistic fucktard here is you. ", "score": 4, "replies": []}, {"body": "LOL. You realize the internet was invented in the US right?\n\nEuropean propaganda at it's finest. \n\nPCs were also a US invention.\n\nI want you to understand that Europeans have done fuck all culturally since 1800. That's why you guys think Gothic architecture and classical music is \"real\" culture. Because you guys don't have a fucking clue what modern culture is since it's non-existent in Europe. ", "score": 5, "replies": [{"body": "Hey, damping, just a quick heads-up:  \n**propoganda** is actually spelled **propaganda**. You can remember it by **begins with propa-**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": []}, {"body": "Apparently your reading is as bad as your written English.", "score": -1, "replies": [{"body": "LOL. How's that?\n\nIt's so funny how insecure Europeans get about American cultural dominance. \n\nWith ignorance like yours, you must post in r/ShitAmericansSay right?\n\nOne big inferiority complex. \n\nThe first digital computer was American. No one cares about your mechanical computers. No one here is using a mechanical computer numb nuts. \n\nhttps://www.networkworld.com/article/2291664/data-center/eniac--world-s-first-digital-computer--turns-66.html ", "score": 2, "replies": [{"body": "Not sure if trolling or projecting.", "score": 1, "replies": [{"body": "Sure buddy. About the response I would expect from you. Not like you have any actual points. \n\nSimply put, you know we are right. American culture>>>>>>European Culture. \n\nYou hold onto those 200 year old paintings and music though. Americans will keep innovating while Europe keeps falling behind. Story of the last century. ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "North African culture? ", "score": 1, "replies": []}]}, {"body": ">Europeans are actually retarded\n\n>Trump\n\nPeople with stable geniuses in White Houses probably shouldn't throw stones.", "score": 9, "replies": [{"body": "Settle down, Muhammad. ", "score": 29, "replies": []}]}, {"body": ">Milk is like $10 a gallon folks, that shits cheaper than water in the US. \n\nThat's because it basically is. Just like the \"cheese\".", "score": 2, "replies": []}, {"body": ">Unemployment is higher than the US peak during the recession\n\nHow retarded can you be? Or do you think Europe=Southern Europe?\n\nUS peak during the recession was 9.9%, EU average is 7.1% compared to US 4.1% at the moment. \n\nhttps://www.google.se/search?q=eu+unemployment+rate&oq=eu+unem&aqs=chrome.1.69i57j0l3.2828j0j7&client=ms-android-samsung&sourceid=chrome-mobile&ie=UTF-8", "score": 1, "replies": [{"body": "The context of the paragraph what talking about Italy, dumb ass. US unemployment is now 3.8 btw and 7.1 is nothing to be proud of but keep proving my point of being complacent little fucks. ", "score": 1, "replies": [{"body": "I did not state anything about 7.1% being good or bad, I just refuted your false information. It's not like we're a federal state, the average is skewed by southern Europe. It's obviously bad down there.\n\n>The context of the paragraph what talking about Italy, dumb ass.\n\nThen you should've titled your post differently and refrained from addressing Europeans as delusional in literally the same paragraph followed by anecdotes which are solely based on Italy as to back up your statement. Way to generalise. \n\nHey! I had some first hand experience with an american this day, he thought Italy constituted Europe's economy, allow me to generalise: Americans are fucking retarded.", "score": 1, "replies": []}]}]}, {"body": "Trump", "score": 0, "replies": []}, {"body": "Yeah, because fuck free healthcare. Murica.", "score": -2, "replies": [{"body": "“Free”\n\n “healthcare”", "score": 3, "replies": []}]}, {"body": "I am a bot from /r/wallstreetbets. You submitted something with no flair. Please make sure you select a flair, your submission was removed.", "score": 1, "replies": []}]}
