{"title": "Really surprised by how well stocks are holding up amid trade tensions/rising interest rates", "selftext": "Haven't posted/commented here before, but I'm pretty heavily invested in the market. Just want to say that I'm surprised by the durability of the market at the moment. A few of my stocks took big hits yesterday (most prominently BA) but I still ended up yesterday. Of course I was boosted by that one analyst raising his target for NFLX and WWE has been out of control recently, but even without those two, I would have been alright. I was initially thinking, going into the weekend, that it was time to sell maybe 20&#37;, fearing a repeat of February, but now I'm not so sure. Thoughts?", "id": "8shfc3", "created_utc": 1529492817.0, "score": 157, "upvote_ratio": 0.93, "num_comments": 82, "comments": [{"body": "The economy is raging. That has a lot to do with it. I work for a diverse B2B manufacturing company (like a 3M/DuPont) and our top line is the best it's ever been - bottom line not too shabby either. My dad's in construction sales - same thing. He's already hit his sales quota for 2018. It's not uncommon to miss that quota some years. This year he hit it with 1/2 of the year to go.\n\nInterest rates, while rising, remain near historic lows.\n\nThe trade tensions at this point are mostly seen as sabre rattling. ", "score": 82, "replies": [{"body": "Not saying you're wrong about the economy, but trade tensions are definitely subdueng growth. They are not just sabre rattling, they will have consequences, it's just that we won't feel the effects until later down the line.", "score": 2, "replies": []}]}, {"body": "two ways to look at it. the market is strong enough to survive bad news which means that if things were to calm down it would shoot up.\n\nor it's being propped up for the wrong reasons and shouldnt be recovering. therefore leading to a hard fall if it does break down.\n\nknowing which is impossible.\n\nif you were willing to just save face in the event of a drop and not be hoping to strike rich you could do something like deep otm  spy puts. only putting a little bit of money into them.", "score": 89, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "you can look at M2/GDP, this is some measure of the amount of cash being held by the population.  It has been on the rise, which is the opposite of your guess.", "score": 4, "replies": [{"body": "Those millennials aren't buying as much materialistic garbage but they all want those RH gains", "score": 1, "replies": []}]}, {"body": "If the banks could know for sure what was going to happen with the economy they wouldn't have been completely blindsided in 08. ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "I don't think the boom is entirely fiction. I have a major trucking company in my holdings, so I follow the transport industry closely. I think freight and transport is an excellent bellwether for the rest of the economy, as 80 percent of goods we purchase arrive via truck. Right now, the trucking industry is at 100 percent capacity. There are orders sitting in shipping ports just waiting because there aren't enough trucks to meet the swelling demand. That, to me, means things are being built and purchased at robust levels. \n\nI realize it's just one data point, and there are other indicators of that the economy is actually living up to the hype. I'm just throwing this out there as a brief example to consider. ", "score": 28, "replies": [{"body": "It's a good point and I will consider it, so thanks. Anecdotally, I know a guy who owns a trucking company and they have a very hard time finding drivers, because they can't afford to pay them a decent wage and a lot of guys don't want to drive any more. It's a brutal way to make a living. So that might be part of the reason why orders are sitting. ", "score": 12, "replies": [{"body": "It's definitely a big part of it that I should have mentioned in the post too. There's a driver shortage, as well as freight demand blowing up. The biggest pain point is in \"last-mile deliveries\" given the growth in online purchases of big items like furniture. ", "score": 4, "replies": []}, {"body": "Recently there was a festival in my city, and trucking companies were there recruiting. Never seen that before. ", "score": 2, "replies": []}]}, {"body": "It's not entirely fiction but there is a lot of distortion and misallocated resources. Things that are booming that shouldn't be booming. Central bank QE and interest rate repression has caused likely the greatest misallocation of resources in history. Unfortunately it's hard to know whats being propped up by CB manipulations as they'll only be revealed completely when the next crisis hits.", "score": 3, "replies": [{"body": "This is how I see things. Trump just borrowed trillions of dollars to stimulate the economy. I am Jack's utter lack of surprise now that the economy is being stimulated. The issue is: what happens when those trillions need to be paid back and QE tightening starts to bite? Then we see just how well the economy is doing.", "score": 1, "replies": [{"body": "Exactly. The Fed's going to be selling $50B/month worth of treasuries by October plus over $100B/month of new issuance by the treasury to finance these massive deficits. I see no scenario where this doesn't cause yields to skyrocket, something massively over-leveraged corporations and households simply cannot afford. ", "score": 2, "replies": []}]}]}, {"body": "The new congressionally mandated ELD rule has played a big role in the freight shortage as well.\n\n[Electronic Logging Device Rule](https://www.fmcsa.dot.gov/hours-service/elds/electronic-logging-devices)\n\n", "score": 2, "replies": []}, {"body": "Transportation is one of the best leading indicators. It's confirming our Presidents success", "score": -3, "replies": []}]}, {"body": "issue is people have been saying that for years and a lot of people have lost in the process. and  the extreme majority of hits to the market have been just trumps antics. not really the economy causing dips. ", "score": 36, "replies": [{"body": "True. But I think his antics are about to get upgraded to serious fuckups. That's the way I'm playing it. Long Canadian weed, short DIA and SPY. ", "score": 9, "replies": [{"body": "I feel like the weed play is already way too crowded and overpriced. Here's how I see the math: Colorado has a population of 5.6 million people, and in 2017 the industry as a whole in the state generated $1.5 billion in sales. And, if you look at stats, sales look like they are slowing a bit. \n\nCanada has a population of just 36 million people, so maybe a potential $12-$17 billion in sales, if trends are comparable to consumption in Colorado. The top 10 marijuana companies in Canada have a combined $20 billion market cap, with Canopy Growth at like $8.9 billion. \n\nNo doubt, I think the marijuana industry will be profitable, I just don't know if the price is realistically reflects the total addressable market. I like the marijuana play, but right now it's just too popular and thus prices for these companies are a little high. ", "score": 19, "replies": [{"body": "Your numbers are not far off from other numbers I've seen. However, my take is that it's not just all about demand. It's also about how well run the company is. I think we are likely to see some big mergers in the next couple of years. Canopy will swallow some of the other fish. And there is also the hype component, which I think is going to be considerable. As an example, WEED hit a new all-time high today on the TSX after the firm legalization date was set. There was no reason for that other than excitement. I've made a decent chunk of money from weedstocks already as they rise and fall.\n\nAlso keep an eye on Constellation, who bought a sizeable piece of Canopy a while ago. They are the owners of Corona. There will be more interest from big alcohol and big tobacco as they start to worry about big weed stealing their lunch, or maybe they just want to go along for the ride. I'm sure cigarette companies in the US have entire marketing plans all ready to go, and although Canada is a tiny market compared to the US I don't see why they wouldn't want to get their toes wet.", "score": 1, "replies": [{"body": "It'll certainly be interesting moving forward. I invested in the MJX ETF well over a year ago when it launched and made a nice little profit in the run-up. \n\nI'm mostly waiting for an adverse news event, a temporary setback that sends weed stocks down 10-15% at least. That could be specific to the marijuana industry, or simply a macro event that drags everything down. I just think valuations are steep right now. \n\nMy other two concerns in the weed market: Are there so many businesses that the price of legal weed will drop due to so much product on the market? Other concern: It's not exactly difficult to grow marijuana. It's a commodity product really, and it's not difficult to grow various hybrids etc. Rather than buying an overpriced company, what's stopping a major tobacco company from just switching fields to ganja? \n\nIf it ever becomes legal, you know cash-strapped farmers will switch their fields in a heartbeat. I just don't think there's that wide of a moat for a product that literally grows like a weed! \n\nI'm being nitpicky, but to pay an elevated premium for the stocks now, I got to be! \n\nBest of luck and may your portfolio achieve alpha! ", "score": 1, "replies": []}]}, {"body": "Texas just passed a bill, other states are passing laws: the prohibition is over. The prison industrial complex will start paying dividends in the form of cannabis.  It's only a matter of time. Buy while you can. Because there will be one or 2 players in the current market that will get swallowed by a blue-chipper wanting to enter this highly profitable arena. I couldn't tell you which one, might be all of them\n..I've got an ~80% success rate, and that's at the penny stock level. I doubt that action will continue, but it seems like a good sector.", "score": 1, "replies": []}]}, {"body": "I agree. his antics are getting larger and larger. could only be a matter of time before it breaks the camels back.\n\nbut personally wouldn't put money on it. too unpredictable historically. I'll be looking to just catch it intraday with futures.", "score": 3, "replies": []}]}]}, {"body": "It's really not. We have matching gdp growth, fair inflation, the US have incredible unemployment numbers and income is high. It's one of the strongest economies in a long time. ", "score": 11, "replies": [{"body": "Gdp is grossly inaccurate and unemployment numbers/job growth doesn't mean people are getting good, well-paying jobs that warrant this much and even more economic growth.", "score": 3, "replies": [{"body": "And the raising valuation of equity is not a sign of a downturn ", "score": 1, "replies": []}]}, {"body": "All true, but I'm seeing some hedge funds (like Bridgewater) saying they're preparing for a massive downturn soonish, and these employment numbers are suspect. I'm not buying that the real unemployment rate is really that low. I haven't done any digging on it, but I haven't heard any explanations as to where these jobs are coming from, or even what these jobs are. It's like Thing #720 I want to look into but life, you know... ", "score": -2, "replies": [{"body": "> I'm not buying that the real unemployment rate is really that low. I haven't done any digging on it, but I haven't heard any explanations as to where these jobs are coming from, or even what these jobs are.\n\nSeriously? You have nothing to back it up, have done no research, but have decided the numbers are likely fake? How? Based on what? The economy is improving. That isn't a lie. Businesses make more money in a growth period, people who are employed buy more. Businesses expand, they have to hire, new jobs are created, it isn't that difficult to understand.", "score": 14, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "And yet nothing you provided me here shows any documentation to back up your statement about the jobs reports being faked.", "score": 10, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "> i said they are suspect.\n\nSo back it up", "score": 7, "replies": []}]}]}, {"body": "While it's unlikely to affect the short-term, we're already seeing changes for the US' future such as major manufacturers - like Toyota moving their new corolla factory site to Baja, Mexico and Ford's Michigan move - is affecting the market. Shares dropped to $105 each for Toyota following the announcement and they're back up to a higher average of $134 recently JUST because of their distance being made with the US.", "score": 4, "replies": []}, {"body": ">everyone is shrieking about AI stealing even more jobs\n\nwhen the unemploymnet  rate  gets so low, does  the stoks market tank?", "score": 1, "replies": []}]}]}, {"body": "Fair. As long as you have solid reasoning to believe so, so you don't get cold feet if it turns in the wrong direction for a time. Control is key. ", "score": 2, "replies": []}, {"body": "Out before year end because Bridewater tends to be right but we'll have a blowup between then and now. Especially if Our President reverses the normal post Presidential election mid term pattern. Actually, that could keep us in a Bull   ", "score": 1, "replies": []}]}, {"body": "Thanks to Our President", "score": -5, "replies": []}]}]}]}, {"body": "Am I the only one taking more risks because I want to make as much as possible before the bull run is over? I miss 2017. ", "score": 5, "replies": [{"body": "Nah /r/wallstreetbets\n\nEven if the market goes bearish you can try to make money shorting the market.", "score": 4, "replies": [{"body": "I learned about stocks there first, so it suprises me that anyone in the market on reddit could possibly not know about them.\n\nI read a post where a dude took out 22k loan and flipped it for a ton. Blew my mind, I mean I'm not going to do it but holy crap.", "score": 2, "replies": []}]}]}, {"body": "$SPY is going to $300. This is an up market.", "score": 6, "replies": [{"body": "I just placed my calls for this, hope I'm not too early!", "score": 2, "replies": [{"body": "Oh hey dude! Which ones/what price did you get in? It's strong. $276.05 is a good entry. \n", "score": 1, "replies": [{"body": "276 because I'm broke :) 7/27. Maybe I should buy the next one a month more out?", "score": 2, "replies": [{"body": "This is far enough. Should be good.", "score": 1, "replies": []}]}]}]}]}, {"body": "I believe their are many factors as to why this is the case.\n\n1. Market is getting used to Trump and is pricing it in (Atleast the $50 billion tariff)\n2. We have only seen USA's tariff imposes that were expected. 200 billion one hasn't taken affect yet. Thats the next dip. I am not sure if they announced to what they will put the tariffs on, so I cant comment on that. But once we know for sure those markets will trigger a sell off. And once the tariffs are in place another sell off will happen (but like this week, it wont be as bad since that was expected).\n3. Chinese government cooled off Asia last night by telling the market not to panic over there. Hence why you see a surge in Chinese stocks. Which also provided us good momentum for rebound here.\n4. The real hit I believe is when China gets involved and imposes back at US with its own 200 billion. Which we will find out in the next 2 weeks. And once we know the industires, then the sell offs in those industries will take affect which can have a crippling affect across indexes. Let's just hope the word \"tech\" isnt dropped because the tech rise has been beautiful and so too will the crash. So far we have its really just the dow jones has taken the big hit.\n\nIn other words, dont just relax and think its over yet. The tide hasn't even come in yet. My plan is to go semi liquid and prepare for the worst and possible ready myself with puts/shorts. EU/NA tariffs are also still to come.\n\nThese next few months are going to be a shitshow if they haven't already been. Great for swing traders who are semi liquid but worrisome for others.", "score": 9, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You said it's own $200b not a total. What you said is still incorrect which frankly makes me even doubt what you've just said. ", "score": 2, "replies": []}]}]}, {"body": "What I have been thinking is our investment education level has hit a strong point and when this market crashes back to adjustment level there will be a ton of people who predicted it and properly prepared for it by pulling back major portions of liquid finances.\n\nThe market will tumble but soon after all of that money will just go back in to catch the largest dip they might see in a lifetime and so I personally believe the market will go right back to surging, which would be pretty damned comical and pretty damned profitable for most of us.\n\nI think the sad thing is those people that will be paying for this change. Actual stock holders that get out late that panic sell. I would like to believe they know better and would just hold the stocks till the big money comes back in, but I'm new and don't understand how the stock market works yet.\n\nI would just like to assume there is a way for us all to financially win from the market.", "score": 1, "replies": []}]}, {"body": "I am surprises as well. Dow only dropped like 1%, S&P 0.5%. I thought we were going to see the 2% across the board.\n\nI guess the bull is still strong.", "score": 8, "replies": []}, {"body": "Bulls seems unstoppable ", "score": 4, "replies": []}, {"body": "I'm making over 1K a week the past months. Life is good.", "score": 5, "replies": []}, {"body": "This boom was fueled by low rates and until thats changed will continue to hold. Another 12 to 18months before this bull run is over", "score": 9, "replies": []}, {"body": "As long as consumers are spending and are confident the market will continue to go up.  I don't think it'll slow down until until people run out of options for more debt which is of course easy to get because of low rates and increasing housing prices. \n\nThings I'm watching for now is a leveling off of consumer debt levels, housing prices and consumer confidence.\n\nI think valuations are high but I don't think we've reached delusional levels yet which is where we usually have to be before a recession.", "score": 3, "replies": [{"body": "How do I track those 3 things\n\nConsumer Debt levels\n\nHousing prices\n\nConsumer confidence.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "This discussion has been going on for years. You just don't know.", "score": 17, "replies": [{"body": "I wonder how many discussions and how many years lol, that would be some fun numbers.", "score": 2, "replies": []}]}]}, {"body": "Im wondering how much has to do with the massive tax break these corporations just received and their ability to buy back their equity. Im also wondering when those propped up values are going to tank.", "score": 2, "replies": []}, {"body": "Depends on your personal portfolio. Obviously if you're heavy in BA (Like I am) you maybe sold calls against your long position. But also, even if China retaliates and we reach a whopping $250 BILLION in tariffs, that only represents a very very small percentage of world trade of $5 trillion.Also tech isn't as affected by trade as industrials. ", "score": 1, "replies": [{"body": "Semiconductors and tech gadgets are largely manufactured in China.", "score": 2, "replies": []}]}, {"body": "Trade tensions are tough to figure out what the impact is directly going to be and rates are still very low given historical standards and the pace of inflation isn't growing very fast if at all. I don't really see as much downside to stocks as some may be seeing give how strong the economy is right now.", "score": 1, "replies": []}, {"body": "Plunge protection team☆ is vigilant", "score": 1, "replies": []}, {"body": "market is heavily data driven, and the data's still good.  Trade wars play out slowly.  The algos will dump when earnings revise downwards.\n\n\n", "score": 1, "replies": []}, {"body": "Rates are only rising .25 basis points a quarter. LoL. Miniscule", "score": 1, "replies": []}, {"body": "The question we should ask ourselves is whether we should be worried.\n\nDoes this pricing consider systematic risk, is the market to optimistic? Though things look strong, I don't think moral hazard  is being priced in the markets very well (nor has it historically).", "score": 1, "replies": []}, {"body": "It's cause the market already had a fake out about trade wars in March. Did you forget all major indexes declined 10% with multiple financial outlets opining about a correction or bear market/recession within the span of a week?\n\nA month later and it was all forgotten it seems.", "score": 1, "replies": []}, {"body": "Plus Trump simply flip flops all over the place. I think the markets have learned to ignore him   ", "score": 1, "replies": []}, {"body": "Its holding up, but its looking toppy IMO. ", "score": 1, "replies": []}, {"body": "Aaaand they're going down now ", "score": 1, "replies": []}, {"body": "The calm before the storm perhaps. ", "score": 1, "replies": []}, {"body": "I think trade war is just a feint from Trump, and who holds the money knows about it. Nobody would win from trade war between China and US (maybe EU or Russia? but that's just a random guess). ", "score": 1, "replies": []}, {"body": "OP.. why you do this?", "score": 1, "replies": []}, {"body": "Ending China's trade barriers and IP theft is good for the world.\nThanks Trump", "score": -17, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I see that you have some reading comprehension issues", "score": -11, "replies": [{"body": "... What? ", "score": 5, "replies": []}]}]}, {"body": "except nothing has ended...", "score": 3, "replies": []}]}, {"body": "No trade war, only our businessman president getting better terms. Remember how they used to say you can't run the country like a business? They were wrong.", "score": -7, "replies": [{"body": "What better terms have we received thus far?\n\nEdit: Come on sweetie, try to at least come up with something... ", "score": 2, "replies": [{"body": "> only our businessman president getting better terms.\n\nCome on sweetie learn the tense of words. As for me I was working, something you may want to try one day. So yes Trump IS GETTING, as in, is currently in the process of procuring, better terms. As in, we are IN that process, the \"trade war\" itself is the process.\n\nLike remember when normies were convinced that Trump was \"STARTING A NUCLEAR WAR\" with North Korea? Yeah? And where are they now, again? Ooh, right, bending the knee at international denuclearization talks. \n\nIt's cool though, I'm glad not everyone is like me, otherwise I couldn't make money as easily!", "score": 0, "replies": [{"body": "Oh God your post was cringeworthy. Try getting a job where you're able to be on your phone, I'm sure there's some middle-manager making you restock shelves of some sort & looking over your shoulder constantly, for which I pity you little guy I really do. I've been in your spot, so I know how it feels, but if you have any sort of brain capacity (which unfortunately you haven't proven yet) you'll make it out someday like I did. But that's enough of that, deep down you know how miserable you are, I can hear it loudly and clearly, it's where your bitterness stems from. That minimum wage hurts sweetheart, it'll get better!\n\nJust a heads up, it was a dead giveaway that you clearly have no grasp on economics or basic financial concepts when you stated that Trump is negotiating trade through a war. That is such an absurdly idiodic statement you would be laughed out of my office for even implying that. You learn that in Macro101, pick up a fucking book before you act like you know what you're talking about. That was just fucking embarrassing holy shit.\n\nAnd I have no idea why you brought up North Korea, but a Trump got played like a little bitch by them too. They opened up their lines of economic communication with the world, and gave up NOTHING in return. Best dealmaker in history, nah Trump just got outsmarted by a short fat dictator from halfway across the world. \n\nThank you for this conversation though, all it showed me was how fucking dumb his supporters are. It'd actually worry me that he could do some LT damage to this country, but thankfully you've shown you have the intelligence of a 7-year old with down syndrome so you clearly will never hold a position of power. Thanks again for making my day cupcake, try to turn that pathetic life around someday. ", "score": 1, "replies": [{"body": "LMFAO I didn't just hit a nerve, I blew out your whole central nervous system XD \n\n>it was a dead giveaway that you clearly have no grasp on economics or basic financial concepts when you stated that Trump is negotiating trade through a war.\n\nReally because you not knowing what a \"trade war\" is seems pretty terminal to me.\n\n>That was just fucking embarrassing holy shit.\n\n\n\n", "score": 2, "replies": []}, {"body": "How many times do you have to say \"fuck\" to make your point. Insulting down syndrome and making fun of minimum wage? You seem uneducated and hypocritical at the least. I thought the reddit extreme liberals like you didn't like when President Trump mocked the disabled reporter. Perhaps you should get off of your computer and look outside.", "score": 0, "replies": []}]}]}]}]}, {"body": "tick tock", "score": -9, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Isn't that what people said like for years ago? ", "score": 1, "replies": []}, {"body": "The market can stay irrational longer then you can stay solvent.", "score": 1, "replies": []}]}]}]}
{"title": "in depth chinese stocks dd from a chinese fag", "selftext": "[deleted]", "id": "8seckk", "created_utc": 1529458255.0, "score": 197, "upvote_ratio": 0.97, "num_comments": 76, "comments": [{"body": "Finally some real investment advice", "score": 131, "replies": [{"body": "Still better than 90% of the DD posted here ", "score": 65, "replies": [{"body": "It genuinely is", "score": 32, "replies": []}]}, {"body": "Which means fuck all at the end of the day.  \n  \nLong, long ago, when dinosaurs roamed the /r/WSB plains, there was a stock called $VERI.  Everyone and their mother did some great deep dives on how much bullshit the stock run-up was when it doubled in a month or 2.  Then, 4 weeks later, it had increased ~800% and all the geniuses were sitting there scratching their heads.  \n  \nMeanwhile, those of us that embrace the reality of how much bullshit is in this market made some good money off it.  I sold well before the overall peak, but it was easy money.  \n  \nMoral of the story: DD don't mean shit in tech anymore. Hype is God.", "score": 11, "replies": [{"body": ">DD don’t mean shit in tech anymore \n\nDD don’t mean shit in any facet of the market. Momo / fomo and Hype are the gods that deliver tendies. ", "score": 2, "replies": [{"body": "Nah, DD still stands for blue chips.  The big jumps on blue chips are actually based on realistic expectations.  \n  \nEverything else though, yea, pretty much all feel no real.", "score": 5, "replies": []}]}, {"body": "DamNnNNN", "score": 1, "replies": []}]}, {"body": "Ya I was expecting a low effort shitpost or stale meme, but OP delivered.", "score": 2, "replies": []}]}, {"body": "how bout $UXIN with the IPO happening soon", "score": 30, "replies": [{"body": "[deleted]", "score": 43, "replies": [{"body": "**You have to understand**", "score": 61, "replies": [{"body": "**I AM A PROFITABLE COMPANY**", "score": 21, "replies": []}]}, {"body": "In general I don’t think Chinese people trust buying used cars as much as they do in America. I don’t really see much of a market for them there, especially in big cities like Shanghai where it costs about the equivalent of $10k USD to get your car license plate.", "score": 2, "replies": [{"body": "cue me asking my dad if chinese people use 2nd hand cars.", "score": 2, "replies": []}]}]}, {"body": "Here's my advice: All in, with maximum leverage.\n\n DD: None. ", "score": 14, "replies": []}]}, {"body": "I appreciate this. Thank you. Also: is the preferred nomenclature \"Asian-American\"?", "score": 19, "replies": [{"body": "[deleted]", "score": 115, "replies": [{"body": "[deleted]", "score": 33, "replies": [{"body": "[deleted]", "score": 26, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "[deleted]", "score": -2, "replies": []}]}]}, {"body": "Too far man... “un-nuked”... that’s low", "score": 4, "replies": []}]}]}]}, {"body": "Just wait till 斗鱼 go public, that's the Chinese version of twitch.tv. ty for clarifying.\n\nP.s. 我也是个中华赌鬼", "score": 18, "replies": [{"body": "Don’t tease us like that ", "score": 14, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "没事 需要解释尽管问 用reddit的messenger方便一点", "score": 3, "replies": []}]}, {"body": "Isn't Douyu going to be listed in Hong Kong from what I've heard? Anyway I think Huya's what, like one of the top 3 game streaming sites with Douyu and Panda?\n\n\n\n\n\n\n", "score": 2, "replies": []}, {"body": "didn't even hear of Huya but heard of Douyu, was surprised to see that Douyu isn't even public yet but huya is.", "score": 1, "replies": []}]}, {"body": "this is unfortunate considering i bought a bunch of SOGO calls today.  thank you for the dd regardless", "score": 15, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "are you invested in IQ? the way you talk about it makes it obvious you should be.  considering the speculation do you think holding stock is smarter than calls?", "score": 2, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "The thing with Netflix and IQ is that they are kind of becoming the default entertainment platform. It's not just about subscription growth, the platforms can still grow, monetization can still improve, and a bunch of things we haven't thought of yet.\n\nIt kind of reminds me of how Facebook was around younger people. \"Wait, you don't have Netflix? wtf u doing?\"", "score": 6, "replies": []}, {"body": "The heart wants what it wants. Which is usually to get brutally raped up the butt by FDs. Stupid heart.", "score": 3, "replies": []}, {"body": "I’m with you. Don’t clearly understand why NFLX has such high valuation. It just crossed citi in market capital.", "score": 1, "replies": []}]}]}]}, {"body": "Same, but I’m pulling out now that I’ve learned SOGO is for fags", "score": 4, "replies": [{"body": "i might do the same. SOGO is pretty fuckin gay apparently so that’s not gonna work", "score": 3, "replies": []}]}]}, {"body": "First of all, fuck you\n\nalso, on a scale of 1 to 10, how likely do you think that IQ might be committing accounting fraud or some shady shit like that? That's the real DD I need", "score": 28, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "SEC is sleeping behind the wheel. They let Longfin be listed and it took them months to notice the obvious fraud.", "score": 2, "replies": []}, {"body": "Would a company as big as IQ really commit fraud like that? I watched the China Hustle, I get it happens, but this is a legit big tech player, right? Involved with baidu, subscriptions seem high regardless of if it’s ~60M or less. Seems like that would be an unnecessary risk but I also have no fucking clue. I’m being biased and selfish though, I’m hoping to ride this thing for a while. ", "score": 2, "replies": [{"body": "one word: Enron", "score": 20, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "NASDAQ chairman you fag", "score": 6, "replies": []}]}, {"body": "Enron told everyone though. No one read the reports they released. Short reading", "score": 1, "replies": []}]}, {"body": "Who would have thoughts, people lies for monies...", "score": 2, "replies": []}, {"body": "umm worldcom... A.k.a. Verizon", "score": 1, "replies": []}]}]}]}, {"body": "What’s the possibility of $BABA or $IQ buying up $HUYA like Amazon did Twitch?", "score": 9, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "There's a lot of hype over the online shopping infrastructure. Are Chinese ecommerce sites notoriously shitty? ", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Instructions unclear, bought 50 contracts", "score": 7, "replies": []}, {"body": "So basically BABA really is the 800lb swinging dick gorilla of China? Please say yes b/c I'm tits deep in BABA calls that expire in Sept. ", "score": 2, "replies": []}, {"body": "Seems legit.\n\ntaobao = ebay, known for counterfeits\n\ntmall = amazon\n", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "I would like to know if people really use JD like we do amazon also?", "score": 9, "replies": [{"body": "I’ve heard JD is more like Amazon where they have warehouses and store merchandise to ship. Baba is more of a middle man that connects buyers to sellers. ", "score": 6, "replies": [{"body": "I find JD is more reliable, but more pricey. ", "score": 1, "replies": []}]}]}]}, {"body": "So it sounds like HUYA\nI mean I’d look at Snapchat and wonder why on earth anyone would ever even desire to use it and yet it’s worth a lot more than my collection of Harbor Freight mailers from the late 2000’s", "score": 7, "replies": []}, {"body": "Wat abt sogo being the main browser of wechat?", "score": 4, "replies": []}, {"body": "What about $MOMO", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Momo owns tantan", "score": 2, "replies": []}]}]}, {"body": "What about YY?", "score": 3, "replies": []}, {"body": "Just answer this one question please. What the Chinese version of Wallstreetbets subreddit? I want to read what our Chinese version is trading. ", "score": 3, "replies": []}, {"body": "Thank god I bought all in IQ", "score": 2, "replies": []}, {"body": "all in IQ", "score": 2, "replies": []}, {"body": "$yrd? ", "score": 1, "replies": []}, {"body": "Tencent.", "score": 1, "replies": []}, {"body": "真是胆子大的眯眼鬼，来当面侮辱洋鬼子。你娘才卖批\n\nI'll go long $IQ and steer clear of the rest", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "没想到有其他黄皮肤黑头发的autistic faggot在这里跟老子一起破产。", "score": 1, "replies": []}]}]}, {"body": "$QD? ", "score": 1, "replies": []}, {"body": "Thanks Ping.  This was actually decent. ", "score": 1, "replies": []}, {"body": "Gonna sell off my SOGO and pick up some IQ", "score": 1, "replies": []}, {"body": "To think someone is actually going to trade on this. Wow. ", "score": 1, "replies": []}, {"body": "Good idea to buy OTM calls on IQ? I'm thinking Jan 2020 $45 calls for $16.30. Could be a $500 stock by then.", "score": 1, "replies": []}, {"body": "Sogou is Chinese Altavista, its settled. Also check Google trends. Nobody is searching for Sogou, while everybody is searching for Baidu.", "score": 1, "replies": []}, {"body": "What about the Car thing China bro? UXIN", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Where are you getting 24% market share?  They seem to have less than 4% market share, which is nothing.  I even searched on Sogou itself, where the [first result](http://www.china-10.com/news/490503.html) shows they had 2.5% as of June 2017.  In the US, Bing has 7.8% and Yahoo 4.3%.  No one uses Yahoo.  Sogou's market share in China is even less then Yahoo in USA.", "score": 11, "replies": [{"body": "Retarded me thought I saw a graph. ", "score": -2, "replies": []}]}]}, {"body": "uxin? thoughts", "score": 0, "replies": []}, {"body": "fake news", "score": 0, "replies": []}]}
