{"title": "Are these stock picks stupid? Which 2 would you buy if you had to? Everyone is telling me to get these.", "selftext": "- Alibaba (P/E = 55) (will buy at first dip, Chinese new years coming up, the Chinese are getting more cash to spend)\n\n- Act Blizzard (P/E = 49) (esports, mobile games, Call of Duty sales, growth) \n\n- Disney (P/E 19) (they will be competing vs Netflix soon, lower price plus ESPN, tons of TV channels, Marvel, Start Wars, Fox) \n\n- Aphria (marajuna will be a game-changing retail opportunity, they have a contract with the walgreens of Canada) \n- Square \n- Paypall (P/E = 66.76)\n- LMT  (P/E = 27)  (defense spending coming up)", "id": "7tlocw", "created_utc": 1517161291.0, "score": 33, "upvote_ratio": 0.75, "num_comments": 78, "comments": [{"body": "Go through each company. Look at their balance sheet. Calculate the current ratios and book values. Are these companies highly leveraged? Look at the earnings per share for each company. Does the stock price seem overvalued or undervalued compared to this? Look at their long term roadmap. Look at their team and executives. Are these people you believe in? Are these people with good track records? Look at the momentum behind the company. Is it a company that has had high returns over the past year? \n\nHope some of these basic principles help you refine your search. Read The Intelligent Investor by Ben Graham.", "score": 43, "replies": [{"body": "Awesome reply. I’d add Common Stocks and Uncommon Profits as reading too. ", "score": 9, "replies": []}]}, {"body": "> Paypall (P/E = 66.76)\n\nNever invest in stocks you don't know how to spell.", "score": 54, "replies": [{"body": "Seriously. As soon as I started getting out of biotech with their crazy names I started making a shitload of money on Net Flicks.", "score": 27, "replies": [{"body": "FANG:\n\nFazebook\n\nApp L\n\nNet Flicks\n\nGoo Gull", "score": 10, "replies": [{"body": "doesn't FAANG include Amazon?", "score": 1, "replies": [{"body": "Usually. The terms are interchangeable really. Most people understand the companies you’re referring to ", "score": 0, "replies": []}]}]}]}]}, {"body": "Disney is in a mess right now. ESPN had been continually losing subscribers by the thousands and is being replaced by YouTube. They have long expensive contracts for the NFL that will continue to cost them money for years. As they pull their content off other platforms they lose out on licensing profits. The acquisition of fox will take a long time to sort out. I think Disney could be a good buy towards the end of this year for the potential for their streaming service launch. But I could see Netflix actually having a larger market cap than them by the time they launch it. ", "score": 6, "replies": [{"body": ">  They have long expensive contracts for the NFL that will continue to cost them money for years.\n\nwell they have like 1/10 of the P/E ratio of Netflix. And they'll be streaming ESPN on their service this year. ", "score": 1, "replies": [{"body": "ESPN should not be your reason at all. ESPN fucking sucks. Steven A is carrying their headlines and they turned Sports Center into an obnoxious clip show. ", "score": 11, "replies": [{"body": "You are discounting a corporation because you don't like a show?", "score": 1, "replies": [{"body": "They did that to all their programming. They viewership numbers keep dropping because of it, as far as I know, and they aren't changing it.  \n  \nhttps://www.forbes.com/forbes/welcome/?toURL=https://www.forbes.com/sites/maddieberg/2017/10/10/dont-blame-jemele-hill-for-espns-ratings-problem/&refURL=https://www.google.com/&referrer=https://www.google.com/", "score": 1, "replies": []}]}, {"body": "he cited ESPN as the reason. I'm saying it's not a huge deal. ", "score": 1, "replies": [{"body": "Okay, it just reads as ESPN will be streaming and making those contracts worth it. ESPN at this point is a money hole. ", "score": 2, "replies": [{"body": "> ESPN at this point is a money hole.\n\nI disagree. People watch sports and ESPN has exclusive contracts. What sucks about ESPN is that it's not streamable online in a decent way. That's changing. Am I wrong? ", "score": -1, "replies": [{"body": "You are wrong if you think that that is going to make it money. No one goes out of their way to get ESPN content anymore, outside of NFL games. When Disney bought it they underestimated the audience and made a joke of the programming.", "score": 3, "replies": []}, {"body": "Exclusive contracts is not enough when you can get game talk and highlights on YouTube. There’s no more need for sports center. Espn is going to continue to struggle in my opinion even when they launch their stand alone streaming service this year. Disney best bet is their own family centered streaming service launching next year. It’s just too far off for me to invest now. ", "score": 2, "replies": []}, {"body": "You're not wrong, Walter, you're just an asshole.", "score": 0, "replies": [{"body": "This bot is pretty neat.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Im not saying to not buy Disney. I just don’t expect a lot from this year. I think it will mostly trade sideways. I’m probably going to be getting a small holding the end of this year.\n\nI do not think espn streaming is big news or will change much.\n\nI think Disney’s unnamed streaming service is potentially huge news and I want a holding before it launches. But we have a lot of time and in the meantime other stocks are going nuts.\n\nThis is all my best guess. Take advice online with a grain of salt. ", "score": 1, "replies": []}, {"body": "Sometimes a low p/e is justified and not just indicative of a good deal. \n\nIt's an extreme example but look at something like GE. From a P/E point of view GE has looked like a bargain from the low 20's. Here we are  one less CEO, a few dismal earnings reports, a complete company restructuring, and an SEC investigation later. Where the current pricing of $16 feels like a blessing not a bargain.\n\nOn the other end sometimes higher P/E's are justified. 86% of companies have beat earnings in the past year. Fundamentals look strong and there is nothing on the horizon that would indicate a slow down (raising unemployment, higher interest rates, wage increases).", "score": 1, "replies": []}]}]}, {"body": "Why are you only citing P/E? What other DD have you done for these stocks?", "score": 6, "replies": [{"body": "> Why are you only citing P/E? What other DD have you done for these stocks?\n\nNot much. I'd love to know what aspects of these companies make them bad or good. ", "score": -1, "replies": [{"body": "The person who relies on others to do DD for them is the person who goes broke really, really fast.", "score": 4, "replies": [{"body": "How so? Why would my amateur DD be better than a professional analyst? I have no confidence in myself to correctly value a stock.", "score": 0, "replies": [{"body": "Because that professional analyst can be wrong. And no one says you need to do DD only on stocks. Don’t feel comfortable picking stocks but you want to own individual stocks? Don’t blindly listen to analysts. Do you DD on **them** and determine who is the best, most thorough, gets it right most often, etc. ", "score": 0, "replies": []}]}]}]}]}, {"body": "I own ATVI and want to purchase DIS and LMT", "score": 5, "replies": [{"body": "Buy BABA instead DIS is a serial letdown. Come back to them for 2019 when they perfect streaming.\n\n", "score": 1, "replies": []}]}, {"body": "Those are all stocks that already had insane growth. Maybe they'll continue the insane growth, maybe they won't.\n\nThe trick to making money investing is to buy stocks BEFORE they go up, not after. All of the factors you mentioned are basically priced in at this point.", "score": 22, "replies": [{"body": "That's an argument that always applies to every stock.\nThere are armies of analysts working for massive hedge funds, and whatever information there is, they Always get it before us individual punters and arbitrage the stock to a neutral value.\n\nIt would basically imply that there is no way to make money in the market.\n\nThat may well be, but to use the argument against individual stocks, as though there are other stocks to which it doesn't apply, seem inconsistent.", "score": 4, "replies": []}, {"body": "Based on what I've learned so far, because many stocks are at an all-time high, would it be better to invest in index funds and wait for dips to happen with all these other promising individual stocks? Assuming your DD shows the company's fundamentals and finance are still secure but is just having a pullback/setback for one reason or another.", "score": 2, "replies": [{"body": "I recently came into some cash and started investing. I tried for a bit with individual stocks and was actually losing money. A few weeks ago I moved almost everything into TQQQ and my 75k has turned into 81k.   I have no problem admiring I don’t really know what I am doing so might as well just ride the index. \n\nI know leveraged indexes are riskier but I have stop losses and the market is still going strong so I am being a bit aggressive. ", "score": 2, "replies": []}, {"body": "Disney isn't overpriced. Some of these P/E's are reasonable. ", "score": -3, "replies": [{"body": "Why is this getting downvoted? It has a P/E of 19 that isnt over priced. The reason against investing could very well be that it won't grow, but you can't say RIGHT NOW it's not overpriced. ", "score": 2, "replies": []}]}]}, {"body": "I heard the same things about Amazon a year ago. Or Nvidia a year ago.", "score": 1, "replies": []}, {"body": "Efficient Markets Theory paradigm confirmed. ;)", "score": -4, "replies": []}]}, {"body": "'Everyone is telling me' is not a valid 'buy' metric.", "score": 5, "replies": [{"body": "Yeah, he didn’t even account for the 243 and 17 day Moving Averages. How amateur? Do not skip this crucial step when conducting analysis!", "score": 2, "replies": []}]}, {"body": "Pe ratio on it's own means nothing, you need to compare against the sector/key competitors", "score": 3, "replies": [{"body": "> Pe ratio on it's own means nothing, you need to compare against the sector/key competitors\n\ncan you explain first?", "score": 1, "replies": [{"body": "He means you’re using an arbitrary metric without any reference to compare it to. \nI made a joke that you completely forgot to account for the 247 and 17 day moving averages, which are examples of completely arbitrary metrics. \nIn your case, you should compare the P/E to that of all other companies in the same sector. \nFor example if you wanted to analyze NVDA, you should also compare it’s metrics to those of MU and AMD. Otherwise P/E by itself means nothing. ", "score": 1, "replies": [{"body": "> arbitrary metric without any reference to compare it to. \n\nit's not arbitrary and it does have something to compare it to, namely the PE of other companies. also where did I say this was the only way I gauge a company?", "score": -2, "replies": [{"body": "Well it is arbitrary. You admit it isn’t when it’s compared to that of other companies. But do you know it would only apply within the same sector? It seems not. \nWhere did you say it wasn’t, because I certainly never said it was? I can tell you also like polling internet strangers on their advice. Which can be equally meaningless. It’s a remarkable set of analytical skills you display here. I’m jealous ;)", "score": 1, "replies": []}]}]}]}]}, {"body": "Personally, I would buy Alibaba and Disney.\n\nAlibaba may have a high multiple, but its growth rate is insane, so their PEG is actually only around 1,5. They're the Amazon of a home market with 4 times as many potential customers as Amazon, and in markets where neither Amazon nor Alibaba are present yet, Alibaba is the alternative the consumers actively seek out (this is purely anecdotal evidence though. I live in Scandinacia, I know plenty of people that have bought stuff from Alibaba, but none that have bought stuff from Amazon unless they've visited the US).\n\nDisney meanwhile is fairly attractively valued, have a 70 year proven record of great content production, and they've also proved that they are able to identify great business opportunities through acquisitions (Lucasfilm). I know some people were skeptical when they acquired 21st Century Fox, but I believe they'll turn it into a good deal just like they did with the Star Wars franchise.", "score": 2, "replies": []}, {"body": "PayPal, msft", "score": 2, "replies": []}, {"body": "BABA and SQ", "score": 2, "replies": [{"body": "This I hold both together with VISA and Master Card as part of my \"war on cash\" investment theme.", "score": 2, "replies": []}]}, {"body": "Seeing Nvidia and all, I often check on trending gaming scenes. Alongside WoW, Overwatch is continuing to grow. \n\nKeep a close eye on the esports scene, and the products used. That’s how I picked Nvidia. ", "score": 4, "replies": [{"body": "Any other products/stocks that will be used? Who covers the live video? What companys are big sponsors? Very good point!", "score": 1, "replies": []}]}, {"body": "why apharia when Weed is a better choice", "score": 3, "replies": [{"body": "Aphria is doing long term the right way. Canopy is a great company, I trust Aphria's management team and plan more. They are all about consistency and not overextending. The fact that are providing returns in amounts similar to Canopy and ACB without all the splashy moves says it all. Great fundamentals.", "score": 3, "replies": []}]}, {"body": "I like Disney and Lockheed Martin off of this list. I'm long on both.", "score": 1, "replies": []}, {"body": "Nothing wrong with trading the trend on most of these.  ATVI and BABA breaking out from nice consolidation.  Disney is technologically incompetent and morally bankrupt, stay away from last decade’s winning trade.  ", "score": 1, "replies": []}, {"body": "This isn't like trying out a burger joint or seeing a movie, buying something because other people tell you to is not a good enough reason. ", "score": 1, "replies": []}, {"body": "What does their PEG, Revenue growth, and debt say?", "score": 1, "replies": []}, {"body": "Of the list you listed, I’ve BABA. Disclaimer: I’m long in Alibaba (& Tencent).  Throw the fundamentals out of the windows for Chinese stocks... you buy because of the support.", "score": 1, "replies": []}, {"body": "Disney gonna lose that battle brother ! Proceed there with extreme caution ! ", "score": 1, "replies": []}, {"body": "Don't invest into anything until you feel confident in your decision. You should know why you are putting your money somewhere.\n\nWith that said the market just had its worse day since September. Given the current market climate it could be a good time to get in on some of the stocks you're talking about. \n\nI personally own BABA and ATVI.\n\nI think BABA is fantastic buy. The stock took a hit today and it may be a good time to get in before they crush earnings on Thursday. They are riding into those earning report with record sales numbers. BABA consistently surprises analysts with their growth and this earnings report won't be any different. \n\nATVI also took a hit today and a solid earnings report on 2/8 is baked in as far as I'm concerned. \n\nCOD WWII and Destiny 2 were the best revenue generating titles in North America. COD sales doubled from the last release. PC numbers of Destiny 2 will surprise imo. Destiny 2 microtransactions are down but I bet more titles got bought for PC than expected. The biggest Blizzcon in history in terms of content reveal bodes well. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Shoppers Drug Mart", "score": 1, "replies": []}]}, {"body": "My mind is blown that I actually own 3 of the listed stocks. Nice.", "score": -4, "replies": [{"body": "> My mind is blown that I actually own 3 of the listed stocks. Nice.\n\ncool wich ones? and why you buy them? ", "score": -1, "replies": [{"body": "boy this subreddit is toxic", "score": -1, "replies": [{"body": "Hah, it kind of is. You were just asking someone about their picks and you're getting downvoted, interesting. ", "score": 2, "replies": []}]}]}]}, {"body": "/r/wallstreetbets", "score": -1, "replies": []}, {"body": "Tesla ", "score": -1, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "Pretty sure Musk has nothing to do with PayPal anymore. ", "score": 3, "replies": []}, {"body": "Lol because Musk? (facepalm)", "score": 4, "replies": []}, {"body": "> Own $BABA\n\nis it too late to get into BABA?", "score": 1, "replies": [{"body": "This is a silly question :)\n\nEDIT: to appease u/scodd84, who seems *super hard* for a response to “is it to late to get into BABA,” the answer is no, it’s not too late, the ADR stocks are still publicly traded and there’s no news the company intends to go private.\n\nMoreover, Alibaba has a *huge* share of the *many* consumer markets in which it operates, it's constantly finding ways to expand into new geographic markets, and it benefits from all sorts of protection from the Chinese government. The company's average ROIC over the last five years is above 20%, the CAGR in revenue, earnings, and operating cash flow over the last five years are all above 40% (and higher over the last ten years), and the company's debt/equity ratio is 0.2. Alibaba has a mile-wide moat and today is as good as any day to get in. If you can’t figure this out you should stick to ETFs.", "score": -6, "replies": [{"body": "> This is a silly question :)\n\nhow so?", "score": 1, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "You are considering investing in a company because of a person who has nothing to do with said company. Stop pretending to know what you are talking about with 'if you have to ask, you'll never know' logic and go do some research.", "score": 4, "replies": [{"body": "> You are considering investing in a company because of a person who has nothing to do with said company. Stop pretending to know what you are talking about with 'if you have to ask, you'll never know' logic and go do some research.\n\nthe point of most of these threads I post is to hear what the contrarian opinion. it's helpful in my research project", "score": 1, "replies": [{"body": "That comment wasn't directed at you. It was directed at u/jaug1 who, based on their comments, is in no way qualified to give any advice to anyone. They aren't giving you a contrarian opinion. They're giving you baseless, useless words that form no coherent thoughts or direction. You'd do well to disregard everything they said.", "score": 1, "replies": []}, {"body": "You should start with posting your own opinion on stocks you are planing to buy. Don't just post P/E and say \"everyone told me to buy them\" and expect any thoughtful answers.\n\nIf your post includes any form of insight why you(!) think it's a good idea to buy a certain stock, we can give you a contrarian opinion. The problem is that there are tons of posts like this and as a member of this sub it feels like people asking the community to do DD for them without doing any by themselves.\n\nBasically: Tell me which stocks to buy, I want to get rich. \n\nCould work but also could go horribly wrong. ", "score": 1, "replies": []}]}]}, {"body": "You’re the one who is going to buy PayPal because of Musk. A guy who hasn’t been involved for a very long time. \n\nI suggest SPY for you ", "score": 1, "replies": []}, {"body": "> If you’re asking this question then you should be investing in index funds.\n\ncan you step up and provide an argument like an adult? why the attitude? ", "score": 1, "replies": []}]}]}, {"body": "You forgot to delete this silly comment, too. Or were you only deleting the comments that made you look uninformed?", "score": 1, "replies": []}, {"body": "You miss the point.\n\n> [deleted]\n\nCare to expand on that comment, which said you were considering investing in Paypal because of Elon Musk?\n", "score": 1, "replies": []}]}]}]}]}
