{"title": "[deleted by user]", "selftext": "[removed]", "id": "7qst5a", "created_utc": 1516114571.0, "score": 117, "upvote_ratio": 0.93, "num_comments": 79, "comments": [{"body": "Just a reminder that the S&P500 had a PE of 45 during the dotcom bubble and right now it's 25", "score": 119, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "You might be thinking of CAPE, and I'm pretty sure it was at 45ish", "score": 17, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "As long as the earnings are there, we should be fine", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Eh, I would stay in. It's a tiny bit overvalued on some metrics, but a lot of people are confident in our economy. The most I can say is to also go big into some undervalued foreign countries\n\nEdit: Replied to wrong comment", "score": 6, "replies": [{"body": "What do you see as an undervalued foreign country specifically?  trying to learn more on that as i'm thinking the same as dude above you - starting to feel like general S&P index stuff is due to drop over the next few weeks.\n\nI'd like to move stuff over but from what I understand there's an additional layer of risk due to currency fluctuation right?", "score": 3, "replies": [{"body": "Don't trust me on a foreign pick. But Star Capital has a pretty cool tool that shows the valuation metrics of the countries market cap index right here: https://www.starcapital DOT de/en/research/stock-market-valuation/\n\nI don't know much about currency risks, but from what I know most country indexes have ETFs that trade on the NYSE in USD. They still might have currency risks, I honestly don't know.", "score": 2, "replies": [{"body": "Thanks for the information.  I need to do some homework as kind of a buffer.  I'm in some international vanguard fund currently in my retirement account but I think it's like a 'whole world' thing.", "score": 2, "replies": [{"body": "I like Meb Faber, Tobias Carlisle, and the guys at Alpha Architect. They have a lot of stuff on value", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm going to cash out my market index early March I think", "score": 1, "replies": []}]}]}]}]}]}, {"body": "lucky MU got a PE of 6. lets lose some money MUUUU\n", "score": 11, "replies": [{"body": "This guy!", "score": 1, "replies": []}]}, {"body": "Those numbers are kinda meaningless because an index's PE ignores all the companies that are losing money.", "score": 7, "replies": []}, {"body": "Yeah, seriously. All the talk of bubbles was silly, as up until very recently the PE of most stocks were still in the regular 15-20 range. Despite the big run ups, the market has still been relatively sane. We are only just now started the bubble type run up. ", "score": 5, "replies": []}, {"body": "PE is only part of the recipe for a pop. And look at AMZN's PE. This is surface level dogma to encourage more people to long SPY to disproportionately high ambitions", "score": 2, "replies": []}, {"body": "where is the 120 PE during 2000? http://www.multpl.com/\n\nNasdaq PE might have been close to that, but the 500 certainly wasn't.", "score": 1, "replies": [{"body": "Oops, my bad. Yes it was the NASDAQ that traded at 100+. Edited", "score": 2, "replies": []}]}, {"body": "Sweet survivorship bias you've got there.", "score": 0, "replies": [{"body": "Explain", "score": 1, "replies": [{"body": "I'm gonna let you figure out why using a single metric, on an index with inherent survivorship bias to determine if the overall macro environment is healthy is a bad idea.", "score": -3, "replies": [{"body": "Where did I say you should use a single metric or that it accurately represents the macro-environment? I'm asking how the S&P 500 has a survivorship bias.", "score": 3, "replies": [{"body": "The constituent list drops poor performers. Are you not aware of how the S&P500 works?", "score": -1, "replies": [{"body": "Thanks", "score": 7, "replies": []}, {"body": "Wouldn't that make it an even better indicator of market condtions? Not of macro conditions, note, but just taking the temperature of the market. \n\nYou're basically saying \"At a given point in time, show me 500 of the best-quality publics and let's see what the average P/E multiple is\". I think it's definitely a useful data point. ", "score": 7, "replies": []}]}]}, {"body": "Explain with smaller words", "score": 0, "replies": [{"body": "Fuck I hate wsb sometimes.", "score": 1, "replies": []}]}, {"body": "Dude.  That's a heavy lift.", "score": 0, "replies": []}]}]}]}]}, {"body": "I was just looking at this the other day. Since 2000 the S&P has gained 85%. From 1980-2000 it gained 270%. The doctors might say I have autism but from my point of view this bull market isn't completely crazy\n\nIMPORTANT UPDATE**: \n1980-2000 was actually about 425% in gains from peak to peak. Strap your helmets on retards, we're clear for liftoff.", "score": 129, "replies": [{"body": "What? Only 85% since 2000? Lol let's make that 200% by 2020 ayy", "score": 47, "replies": [{"body": "AyyyMD*?", "score": 27, "replies": [{"body": "Doubled down when it dropped to 11.86 today. Time to head to the ***MOOOON!***", "score": 2, "replies": []}]}]}, {"body": "But we’ve gained nearly 300% since March 2009. It’s all about what you choose to use as a starting point.", "score": 28, "replies": [{"body": "True it's been a crazy decade, but maybe we're just making up from the lost ground from 2000-2009. ", "score": 15, "replies": []}, {"body": "lmao, yeah this completely voids the comment above... I read this and think oh shit its coming.", "score": 5, "replies": [{"body": "The only two things that you should be paying attention to are the flattening yield curve and the VIX. The yield curve is the most reliabe indicator of future economic outlook and the VIX is a less reliable indicator that looks at fear and volatility in the stock market itself.", "score": 2, "replies": [{"body": "But is the yield curve flattening? \n*raises eyebrows*", "score": 0, "replies": [{"body": "What if I told you that [we now have the flattest yield curve since October 2007?](https://www.ft.com/content/456d463e-b94f-39fa-af4f-bacffe59d6a0)\n\nI don't know why people aren't talking about shit like this. An inverted yield curve has predicted every single recession for the past 100 years but *surely this time is different right?*", "score": 6, "replies": [{"body": "So what do I do. Sell everything? ", "score": 2, "replies": [{"body": "No, just be wary of it.\n\nThe economy didn’t actually crash until the yield was completely inverted. Right now the spread is still around 50 basis points. It could reverse, but if it continues on this path we could see a crash around October of this year and a minor recession in 2019.", "score": 5, "replies": [{"body": "okee dokee, thanks", "score": 1, "replies": []}]}]}, {"body": "yeah, i honestly haven't been keeping tabs on the yield curve..\nthat's really interesting though - however, at least its not negative, lol\n\ncause like, i always thought the yield curve flattened when the financial markets expected short term interest rates to be lowered for a while (because of monetary stimulus to ward off an impending recession), so they buy longer term bonds, in order to lock in those higher interest rates. \n\nLike I always thought the predictive power of the yield curve wasn't as great as any other financial market indicator", "score": 1, "replies": [{"body": "NPR has a cool short podcast (9 minutes) on the topic. Like I said, there’s no reason to panic just yet, but it’s definitely something that we should be paying very close attention to.\n\nhttps://itunes.apple.com/us/podcast/the-indicator-from-planet-money/id1320118593?mt=2&i=1000399719821", "score": 1, "replies": [{"body": "okay cool, i'll be sure to check it out.", "score": 1, "replies": []}, {"body": "it also doesn't help that we're giving out this huge ass corporate tax cut in order to \"create jobs\" when we're already at very very low unemployment. \n\nits like, if you wanna overcook the economy, that's a great way to do it. Because now, when we have our next macroeconomic downturn - there won't be any dry powder left in our national treasury in order for fiscal stimulus, etc", "score": 1, "replies": [{"body": "Tell me about it.\n\nIn 1981, we desperately needed tax cuts to jump start the economy and we got them with the Reagan tax cuts that jump started the economy and allowed us to flourish in the 1990s and close the deficit with Bush Sr’s Tax increases.\n\nBut cutting taxes when the economy is red hot is literally the exact opposite of what you should be doing. Obama should have cut taxes in 2010 but he decided to increase spending instead and drove up the deficit to unthinkable levels (no thanks to Bush’s war in Iraq). Our fiscal policy has been laughably incompetent ever since the very successful and economically sound Clinton administration.", "score": 1, "replies": [{"body": "we literally don't need jobs. like if anything, we need a tax increase to cool off the economy, lolol. and we needed a tax break back in 08/09 to increase output (it'd be nice of tax rates automatically adjusted according to the output gap, but heyy).\n\n\nbut yeahhh, like I think Trump is gonna tie Nixon for worst handling of the economy, lololol", "score": 1, "replies": [{"body": "I’d never advocate for a tax increase but we should cut government spending across the board without a doubt. We needed corporate tax reform years ago to be competitive around the world so there are some good aspects to it but with horrific timing. All this tax reform will accomplish is prolonging an over-extended market rally and make the subsequent correction much more painful when the Fed finally has to crack down on inflation.\n\nIf anything I wish that all decisions of taxation were made by the Fed to coordinate with monetary policy but that would be a PR nightmare initially.\n\nIt’s easy to talk shit about things in hindsight but literally everyone with an ounce of knowledge about how macroeconomics works knows this will end badly.", "score": 1, "replies": [{"body": "OMG - the fed in charge of taxation, that'd be awesome. \n\nI'm literally rubbing my nipples at the idea of that. ", "score": 1, "replies": [{"body": "If it were up to me, Janet Yellen would be appointed dictator/czar and Ben Bernanke would be the Prime Minister. \n\nBut that’s just me hahahaha", "score": 1, "replies": [{"body": "i have such a raging boner right now", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Wait no that doesn't make any sense... unless the chart I'm reading is super off.\n\nSP500 Jan 4 1980 106.52.   \nSP500 Dec 17 1999 1421.05\n\nThat's ~1200% not 250\n", "score": 10, "replies": [{"body": "I was using this chart here which says it's adjusted for inflation: \nhttp://www.macrotrends.net/2324/sp-500-historical-chart-data\n\nI took the peak in 1980 which was around $400 and the peak in the dot.com bubble year 2000 around $1500. But I just double checked the graph and realize it has $2150 as the high in 2000, so I obviously mixed the numbers on the graph. So for $400 in 1980 and $2150 in 2000 that's roughly 425%", "score": 4, "replies": [{"body": "I figured that but I think it's probably best to not adjust for inflation since cash is an asset class and this shows relative performance to just holding cash which is what a lot of people are doing. Inflation is gonna happen and not adjusting for it gives a consistent metric for investment performance.", "score": 5, "replies": [{"body": "Also preferred tax rates make up for inflation for the equity owner. If someone smarter than me can decide if that helps in this calculation then cool. ", "score": 2, "replies": []}]}]}]}, {"body": "2000 was the peak of the dot com bubble lmao. Of course we're \"only\" 85% up since that peak. Since Jan 1998 (20 years ago), we're up over 190%. And Jan 1998 was also very much part of the bubble.", "score": 8, "replies": []}]}, {"body": "Good. Let’s make this peak 8x higher ", "score": 37, "replies": []}, {"body": "So are you telling me that we’re okay? ", "score": 19, "replies": []}, {"body": "What if everyone in the market just made an agreement to not sell until the S&P hits like 1000000. Then we all sell and be rich.", "score": 28, "replies": [{"body": "Sweet I'll just sell at 999998.", "score": 35, "replies": [{"body": "Sucker! I'm gonna sell at 999999.99", "score": 10, "replies": [{"body": "Fag - the right would be to buy at 999999.99", "score": 8, "replies": []}]}]}]}, {"body": "Just a reminder that the market is now valued at ~130% of Gross National Product, which is almost an all time high. ", "score": 13, "replies": [{"body": "At what's dat national debt at..?", "score": 5, "replies": [{"body": "about 3 or 4 blackrocks\n\nus national debt will be forgiven when trump gets rid of that other blackrock ", "score": 5, "replies": []}]}, {"body": "but muh P/E ratio.\n\nAlso, it's expected that this metric would be at an all time high due to the influx of cheap money over the last several years. Low interest, higher multiples for valuation. ", "score": 3, "replies": []}]}, {"body": "And $MU was at $98 in 2000.", "score": 10, "replies": [{"body": "u forgot inflation\n\nmu to $146", "score": 9, "replies": [{"body": "lol", "score": 2, "replies": []}, {"body": "So switch my TSLA to MU?", "score": 1, "replies": []}]}]}, {"body": "and 99% of this sub will lose money in this bull market", "score": 18, "replies": [{"body": "i was down from March17 til the end of last year. right at the start i went from down to up 10% in my account. v happy", "score": 2, "replies": []}]}, {"body": "To the moon boys", "score": 5, "replies": []}, {"body": "so my  SPT april 20 292 calls were probably a bad move... meh ill hold a little longer because why the fuck not\n", "score": 1, "replies": [{"body": "Just bought some this morning before the dip naturally. Things should turn around during/after Q4 earnings season.", "score": 1, "replies": []}]}, {"body": "and the federal funds rate was over 5%\n\nwhats your point?", "score": 1, "replies": []}, {"body": "Yeah I’m a little bummed it didn’t go insta green like the last 3 weeks but we will see 280 again.  I’m hoping sooner rather than later", "score": 1, "replies": [{"body": "I'm hoping very soon.  My calls are ticking like a bomb.", "score": 1, "replies": []}]}, {"body": "Not really\n\nhttp://www.multpl.com/shiller-pe/", "score": 1, "replies": []}]}
