{"title": "[deleted by user]", "selftext": "[removed]", "id": "7r1058", "created_utc": 1516196315.0, "score": 120, "upvote_ratio": 0.93, "num_comments": 80, "comments": [{"body": "Fuck, he's actually a decent analyst.\nhttps://www.tipranks.com/analysts/shawn-harrison\n\nThat said, since we are all speculating, I am bullish on iPhone X's China sales (firsthand DD).\n\n", "score": 81, "replies": [{"body": "Yeah no kidding lol most analyst downgrades on here have like 50% ratings.", "score": 20, "replies": [{"body": "Yeah but Merril lynch PT of $220, and Barclays upgrade > Shawn harrison who's average return barely matched the S&P500... \n\n", "score": 3, "replies": [{"body": "So you mean he’s a great Analyst because he’s consistently able to outperform the market? ", "score": 1, "replies": [{"body": "yeah. he knows what he's doing if he outperforms the market compared to other analysts that I'm surprised are able to keep their job when underperforming the market. ", "score": 1, "replies": [{"body": "You do realize it’s all a risk tolerance game right? ", "score": 1, "replies": [{"body": "no I had no idea. you've enlightened me. ", "score": 1, "replies": [{"body": "If your job is to provide stable income you don’t care about what the S&P500 does you’re looking for low beta and value. ", "score": 1, "replies": [{"body": "\"stable income\" when related to making investments should at least perform at an equivalent level to the national benchmark. otherwise your job is literally useless, and anyone following your recommendations is better off tossing their $ in SPY. ", "score": 1, "replies": [{"body": "If you’re 65+ you don’t give two shits about the  S&P500. Why is this so hard to understand? ", "score": 1, "replies": [{"body": "Do I look 65+ to you? ", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "It's fscomeau...", "score": 19, "replies": []}, {"body": "Which hand, your left or right?", "score": 16, "replies": [{"body": "The one with other dudes' cum residue ", "score": 26, "replies": [{"body": "So really, its both.", "score": 13, "replies": [{"body": "M A S S I V E", "score": 9, "replies": []}, {"body": "hot if true", "score": 2, "replies": []}]}]}]}, {"body": "However component suppliers in China have been reporting massive order cuts (~30%) which indicates AAPL overestimated the demand, which in turn affects the outlook.", "score": 7, "replies": [{"body": "I know the iPhone 8 sales are dismal; perhaps the order cuts are related to those ?\n\nDo you have any reading links regarding the order cuts ?  Reputable sources ?", "score": 2, "replies": [{"body": "It's reported in the usual trade rags like DigiTimes.  It's reputable enough that supplier stocks are getting pummeled.  You may think iPhone 8 sales are dismal but iPhone 8 component suppliers are not reporting cuts.  Only for iPhone X.", "score": 2, "replies": []}]}]}, {"body": "Assuming the Chinese ‘iPhone supercycle’  is more of an annual thing ", "score": 3, "replies": []}, {"body": "Why is there a website about TI calculator pranks", "score": 1, "replies": []}]}, {"body": "Fake news, long AAPL. Earnings are gonna be lit. The news of Apple's demise has been greatly exaggerated.", "score": 37, "replies": [{"body": "Iceberggggg!", "score": 2, "replies": []}]}, {"body": "Inversing this", "score": 37, "replies": []}, {"body": "Who cares... the ones who can't afford the X buys the 8. There's enough who bought the X with its 30% higher average selling price that this earnings release going to blow it out of the waters.\n\nAnalysts are dumb people.", "score": 27, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Margin is a percentage of sales price right? 7% margin on 1000 is still higher than 8% margin on 700. \n\nI'm pretty positive the net absolute profit on the X is much higher than the 8. Also, volume drives down the cost over time.", "score": 10, "replies": []}, {"body": "You have to remember that there is still tough competition from Samsung and plenty of patent lawsuits going on. Even if the margins aren’t great it’s worth being “first” and releasing your R&D. ", "score": 1, "replies": []}]}]}, {"body": "So... cutting to what matters - MU down right? ", "score": 21, "replies": [{"body": "MU always down ", "score": 10, "replies": []}]}, {"body": "That schmuck.. ", "score": 7, "replies": []}, {"body": "buddy of mine works at a large apple store here in Canada, says this fucking $2000 phone is sold out constantly, seriously doubt it has poor sales.\n\nEvery Chinese person has one along with their Canada Goose jackets", "score": 7, "replies": [{"body": "Exactly right ", "score": 2, "replies": []}]}, {"body": "the hell. I am a teacher in france, in one of the poorest regions, and I'm flabbergasted at how many students already have the iphone X. Seriously. I don't even own apple stock so idc but these analysts are such retards", "score": 26, "replies": [{"body": "Even my anecdote: In December I went to the mall 5 times! Each time the line up to get in an apple store was insane. That is all the DD I needed. ", "score": 8, "replies": [{"body": "Haha. This is the same DD I used to buy AAPL in 2009. ", "score": 3, "replies": []}, {"body": "Neither of your rationals actually make much sense. That being said, I'm betting on apple beating. \n\nExample: I was in some rural town and saw everyone had a ford pickup truck. They are gonna have a great year! Well, not necessarily, for a wide variety of reasons. ", "score": 1, "replies": [{"body": "Okkkkk, so I should buy $F!!! thanks for the great tip", "score": 2, "replies": [{"body": "They would be a very bad buy and hold right now imo but in all seriousness if you can time it right you can actually make quite a lot trading ford, it typically acts somewhat predictably. For instance once it establishes support after its massive dip today, you can expect a small pop followed by its support level being broken. That will repeat several times before it goes on an actual run. I might actually look for an entry with a small position. Probably more risky and less profitable then just riding the tech bull atm though, but at least it would be some sort of diversification. ", "score": 1, "replies": []}]}]}]}, {"body": "Anecdote to the contrary: i've never met another person with an iphone X, seen one in public, or even heard one of my friends mention knowing someone with one. ", "score": 6, "replies": [{"body": "cuz ur gay", "score": 6, "replies": []}, {"body": "Obviously not if you live in a ghetto.", "score": 2, "replies": []}]}, {"body": "For me personally, I was scared of having to wait multiple months to get the X because of the slow production so I just got the iPhone 8 Plus. Wish I would've waited because the wait after release day was only a few weeks.", "score": 2, "replies": []}, {"body": "I'm sure I'm not in the majority by any means, but I still haven't seen a single iphone X up close (I'm in the US).  I have quite a few friends and coworkers who use apple phones and so far none of them upgraded.  I know at least in my best friend's case, it was just because of the high price (and he makes good money)", "score": 1, "replies": [{"body": "I've seen plenty everywhere", "score": 3, "replies": []}, {"body": "My daughter reports her elementary school teachers and friends have all upgraded.\n\nWork in engineering in semiconductor firm.  Have yet to see one in person.  Most engineers in my department are using Android phones.  Though if I head over to HR, finance or accounting I may see one, because for some reason people with iPhones tend to set it out on the tables wherever they go.", "score": 2, "replies": []}]}]}, {"body": "What the fuck is longbow", "score": 9, "replies": [{"body": "Its a middle age weapon created by the Welsh to shoot other Welshmen fucking their sheep from a distance. The bow's height was larger than the Welshmen who carried it to compensate for their micro penises. The bows had a ridiculous pull pressure of 90 pounds allowing them to shoot arrows effectively from a very long distance. The force of the arrow shot from these bows was strong enough to pierce plate/chain armor.\n\nThe brits later adopted this weapon and used it to fuck some French niggas up during the 100 years war. The war that started feminism when some French bitch named Joan Of Arc (that nobody wanted to bang) thought she talked to Jesus (which later was discovered to be signs of schizophrenia).", "score": 74, "replies": [{"body": "im gay for you rn", "score": 8, "replies": []}, {"body": "...but that's not important right now.", "score": -5, "replies": [{"body": "nice try welshmen", "score": 21, "replies": []}]}]}]}, {"body": "So isn't there always an apple downgrade then earnings blows past it. ", "score": 3, "replies": []}, {"body": "Didn't it sell better than the 8 and 8 Plus? So add those sale on as well and they would've had a great year.", "score": 2, "replies": []}, {"body": "oh no it's down 0.30%, what a blow", "score": 2, "replies": [{"body": "Where the fuck is the class action from Grossman Gerwitz and Bronstein???", "score": 1, "replies": [{"body": "Bought my calls before it popped today, need something to cancel out my garbage FB calls", "score": 2, "replies": [{"body": "FB is garbage in general.", "score": 2, "replies": []}]}]}]}, {"body": "Anybody own an iPhone X in here? Should I buy an iPhone X?", "score": 2, "replies": [{"body": "I own one, and would recommend anyone looking for a new phone to consider the X. Prior to purchasing the X, the only other Apple product i have ever owned was an ipod Chromatic. ", "score": 2, "replies": []}, {"body": "Id consider it even just for the camera. That thing is pure sex. I can't believe how good portrait mode is. But...i think the note 8 has that as well. Not sure which is better. ", "score": 2, "replies": []}, {"body": "I went the note 8 route. Happiest I have ever been with a phone.", "score": 1, "replies": [{"body": "poorfag green texts", "score": -1, "replies": [{"body": "you are right... its $50 less than iphone X. Ima broke fuck :'(", "score": 1, "replies": []}]}]}, {"body": "Based on what criteria?  Utility?  Bling?", "score": 1, "replies": [{"body": "I'm coming from a one plus 3t! \n\nThe criteria is whether waiting for the next generation iPhone X is worth it vs getting the iPhone X now. I can wait.", "score": 1, "replies": [{"body": "Personally, if I have spare cash to throw around, I'd buy any phone that catches my fancy, provided it has enough bling even if it does things I never use.  If I'm on a budget I'd only upgrade a phone if it stops working or I need some essential function only available on the new phone.", "score": 1, "replies": []}]}]}]}, {"body": "Poor sales? Is this a fucking joke? It took me two months to get mine because they were on back order for so long. Not sure if lengthy production time for OLED screens was the culprit or not but I laugh in this fool's face any way", "score": 2, "replies": []}, {"body": "Let the poors get an 8. Middle Class 8+. Us men, X it is. Paid for by my gainz in BAC. ", "score": 2, "replies": []}, {"body": "Lol. These niggas.\n\nApple is gonna blow Q4 earnings the FUCK out. \n\nLast time Tim Cook got a raise around this time of year Apple set earnings records.\n\nGet ready for a repeat.\n\nDon't bet against Apple.", "score": 2, "replies": []}, {"body": "I always sell when these downgrades hit and regret it once earnings are out. Just staying long this time. ", "score": 1, "replies": [{"body": "So you are saying its better to hold long term???", "score": 1, "replies": [{"body": "Im saying dont be a dipshit like me and sell whenever rumors hit iphone sales are slow.  Its almost like AAPL plants this shit so the stock can fly higher once earnings are out. ", "score": 2, "replies": []}]}]}, {"body": "what a Gaylord ", "score": 1, "replies": []}, {"body": "this reminds me...I need a new phone.", "score": 1, "replies": []}, {"body": "Apple got fked by Alexa", "score": 1, "replies": []}, {"body": "What an idiot!", "score": 1, "replies": []}, {"body": "Apple sells more than iPhones lol", "score": 1, "replies": []}, {"body": "Nice. To the moon! ", "score": 0, "replies": []}]}
