{"title": "Musk Says ‘Funding Secured’ Claim Sparked by Saudi Meeting", "selftext": "[https://www.bloomberg.com/news/articles/2018-08-13/musk-says-saudi-interest-sparked-effort-to-take-tesla-private](https://www.bloomberg.com/news/articles/2018-08-13/musk-says-saudi-interest-sparked-effort-to-take-tesla-private)\n\n[Elon Musk](https://www.bloomberg.com/billionaires/id/1954518) revealed that Saudi Arabia has long been interested in taking [Tesla Inc.](https://www.bloomberg.com/quote/TSLA:US) private, which gave the him the confidence last week to drop the bombshell that he was considering the blockbuster potential deal.\n\nSaudi Arabia’s sovereign wealth fund first approached Musk in early 2017 about taking Tesla off the market, he wrote in a [blog post](https://www.tesla.com/blog/update-taking-tesla-private) Monday. He confirmed the Public Investment Fund recently bought an almost 5 percent stake and is [interested in helping ](https://www.bloomberg.com/news/articles/2018-08-12/saudi-fund-is-said-to-be-in-talks-to-invest-in-tesla-buyout-deal)take Tesla private, as Bloomberg News reported Sunday.\n\nMusk described a meeting late last month in which a managing director for the fund expressed regret that such a transaction hadn’t moved forward. “I left the July 31st meeting with no question that a deal with the Saudi sovereign fund could be closed, and that it was just a matter of getting the process moving,” Musk wrote, adding that this is why he [tweeted](https://www.bloomberg.com/news/terminal/PD3O0DAIBMDH) on Tuesday that he had “funding secured” to take Tesla private at $420 a share.\n\nThe blog post is the latest in what’s been a piecemeal approach by Musk, 47, to explaining how he intends to pull off taking his money-losing electric-car maker private at a more than $70 billion market capitalization. The billionaire chairman and chief executive officer made no public mention of the Saudi fund’s involvement until Monday. Tesla’s board released a three-sentence-long [statement](https://www.bloomberg.com/news/terminal/PD584M3RXUKG) last week that only vaguely addressed how the transaction would be funded and didn’t bring up the kingdom’s potential role.\n\n### Legal Scrutiny\n\nSeveral investors have since [sued](https://www.bloomberg.com/news/articles/2018-08-12/musk-tweet-draws-tesla-investor-lawsuits-over-share-price-jump) Musk and Tesla, claiming the company’s share price was manipulated. The Securities and Exchange Commission is said to be [intensifying its scrutiny](https://www.bloomberg.com/news/articles/2018-08-09/tesla-is-said-to-face-broader-sec-scrutiny-over-musk-statements) of the company and its chief executive officer after having started gathering general information about Tesla and Musk’s earlier public pronouncements about manufacturing goals and sales targets.\n\nOne of Tesla’s biggest critics, Vertical Group analyst Gordon Johnson, read Musk’s blog post as walking back his “funding secured” claim last week. Johnson cited Musk’s statement Monday that the Saudi fund’s support for taking Tesla private was “subject to financial and other due diligence and their internal review process for obtaining approvals.”\n\n“He is specifically stating that funding is not secured, and I think that’s a big deal,” Johnson, whose $93 price target for Tesla’s stock is the lowest among Wall Street analysts, said on Bloomberg Television. “The question then becomes, what does the SEC do here, and do the shareholders stick with him?”\n\n### Question Answered\n\nTesla bull Gene Munster of Loup Ventures said the blog post “slightly increases” the odds that the company will be taken private. He cited Musk’s commentary and Bloomberg’s report on how the Saudi fund was interested in getting involved as part of the kingdom’s efforts to hedge against the world becoming less reliant on oil.  \n“The question, ‘Where would the money come from?’ has been answered,” said Munster. He estimates a greater than 50 percent likelihood that Tesla will be private in a year, with Musk trying to limit investors like the Saudi fund to holding a stake of 20 percent or less, which would be in line with his holding in the company.\n\nTesla shares rose 0.7 percent to $358.03 as of 2:10 p.m. Monday in New York trading.\n\n### Best Guesses\n\nMusk wrote that he’s continued to communicate with the Saudi fund managing director, whom he didn’t identify by name. He said he’s reaching out to Tesla’s other [large shareholders](https://www.bloomberg.com/quote/TSLA:US) and that most of the capital required to take the company private will be funded by equity, rather than debt.\n\n“The $420 buyout price would only be used for Tesla shareholders who do not remain with our company if it is private,” he wrote, meaning that the actual capital needed to be raised would be “dramatically” less than $70 billion.\n\nMusk said that his “best estimate right now” is that roughly two-thirds of the shares that Tesla’s current investors own would stick with a private Tesla.\n\nAfter building that syndicate, Munster of Loup Ventures said that Tesla will need to create a vehicle for investors to “roll their public investment into a private one,” then obtain regulatory and shareholder approvals.\n\n“Our best guess is this will take 3-9 months,” Munster said.", "id": "971oxh", "created_utc": 1534190943.0, "score": 53, "upvote_ratio": 0.88, "num_comments": 10, "comments": [{"body": "I love the analysts trying to make a serious analysis of this, like there's some kind of precedent for any of this to go off of.\n\nTotally gonna happen in 3-9 months though. 50% chance.", "score": 25, "replies": [{"body": "Totally 50%", "score": 8, "replies": [{"body": "50% of the time it works.... every time.", "score": 8, "replies": []}]}, {"body": "3 months maybe. 6 months definetely", "score": 3, "replies": [{"body": "9 months never", "score": 1, "replies": []}]}]}, {"body": "Negative 30 p/e?  He's getting a hell of a deal from the Saudis.", "score": 7, "replies": []}, {"body": "This \"deal\" would never pass CFIUS muster even if it was real.", "score": 3, "replies": []}, {"body": "He can celebrate in jail.", "score": -4, "replies": [{"body": "Jesus i forget how absolutely retarded this sub is sometimes and then people like you show up to remind me.", "score": 12, "replies": [{"body": "Don't be so sensitive. ", "score": 1, "replies": []}]}]}]}
{"title": "$TSLA Bid Wars incoming", "selftext": "[deleted]", "id": "96yjs9", "created_utc": 1534168988.0, "score": 11, "upvote_ratio": 0.76, "num_comments": 20, "comments": [{"body": "look at this fag doing DD tsla puts @ 300 confirmed", "score": 9, "replies": []}, {"body": "this shit keeps falling wtf ", "score": 2, "replies": []}, {"body": "$355 bottom just fell out...", "score": 2, "replies": []}, {"body": "Why do it at $420? If you need to just pay a 15% premium to buy out a company why not do it at $335 which was a 15% premium before Musk got all \"funding secured\". ", "score": 1, "replies": []}, {"body": "Love the cars but nobody is going to pay up for a company you can buy now for less money ", "score": -6, "replies": [{"body": "You can’t buy the company for less money when 60% are owned by institutional holdings and 22% by Musk. 18% publicly traded (*being offered up in exchanges)\n\nAnd 30% short borrowed", "score": 6, "replies": [{"body": "Soooooo what would happen if someone bought the whole float? I've always been curious. ", "score": 3, "replies": [{"body": "You would drive prices up buying at the ASK price and then on the new level reached new offers for Bid and Asks would show up as time goes by", "score": 3, "replies": []}]}, {"body": "Dude it's 100% publicly traded. Of those shares inst own 60 and musk owns 22. What your talking about is the float and I am saying anyone can come in and buy all of the available shares at current price no need to overpay. I will gladly sell you my shares for 420", "score": 0, "replies": [{"body": "Yes but only 18% is available in the market, high demand and low supply. That’s what drives levels up. If the shares aren’t on the exchange waiting to be traded then they aren’t available. ", "score": 1, "replies": [{"body": "No dude your wrong if that was the case the price would be higher and it is going lower me thinks you need to review market basics \n\nFunding secured? \n\nDoesn't sound that way in his release this morning. \n\n", "score": 1, "replies": [{"body": "Market basics:\nLow float stock +\nHighly shorted +\nPositive news +\nTime = Short Squeeze", "score": 2, "replies": [{"body": "Yeah but where is the positive news, we went from funding secured to we're talking. That's bullshit and you know it. ", "score": 1, "replies": [{"body": "The rocket is pointed in any direction than the ground. $355 is the floor", "score": 1, "replies": [{"body": "Yeah until the board votes against it, if your going to succeed no need to be private. ", "score": 2, "replies": [{"body": "You also have to keep in mind before the tweet the price was already at the sub $350s. Production scaling and driving increase in sales is what makes companies grow. Tesla is spending dollar for the dollar as a start up would and investors are fine with it. This “publicly” traded company is backed by investors as if its still private. The price per share will only go up from here on out. Wait for tesla to be “really” publicly traded", "score": 1, "replies": [{"body": "Yes, because he said it would be profitable in q 3 and q 4  production does not equal profit, if your making things non efficiently then the gains are wiped out. ", "score": 2, "replies": [{"body": "I never said profitable. Do you even Silicon Valley?", "score": 0, "replies": [{"body": "Dude that's what musk said. His words about as reliable as funding Secured", "score": 3, "replies": []}]}]}]}]}, {"body": "> $355 is the floor\n\nWhy is it at 352 then?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "Anyone playing CRM earnings?", "selftext": "They literally have AI called Einstein.\n\nJokes aside, every cloud company has done well on earnings the past quarter. Bought 3 calls see where this goes!\n\nEDIT: CRM September 150's C", "id": "96zers", "created_utc": 1534175280.0, "score": 10, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "10/19s are nice because they cover the yearly convention 'Dreamforce' where they announce new features, products, etc. ", "score": 4, "replies": [{"body": "Holy shit people here do DD. Definitely getting some", "score": 1, "replies": []}]}, {"body": "CRM isnt a stock that swings wildly so not really wsb material.", "score": 1, "replies": [{"body": "Don’t worry I’m sure they’ll let you know how much money they make after the earnings beat.....", "score": 1, "replies": [{"body": "I would love to hear it. Im long CRM. I buy dips, 94 is my current ave.", "score": 3, "replies": []}]}]}, {"body": "I have 10/19 calls. ", "score": 1, "replies": []}, {"body": "I have 147 calls for 9/7. I'm going to add more tomorrow too. I think they're about to crush earnings. Steady growth, demand for crm's is increasing rapidly year over year, decent bottom line for how heavy their top line is. I'm betting they blow it out ", "score": 1, "replies": [{"body": "I'm with you man. Been sitting on some 10/19 155's. I think they're going to crush earnings next week, they're discussing a huge expansion of their Chicago office, and have Dreamforce coming up at the end of September.", "score": 1, "replies": [{"body": "Yeah the announcement for the expansion is coming at a great time. I'm suppper pumped about their earnings. Their PE worries me a bit but I'm very bullish ", "score": 1, "replies": []}]}]}, {"body": "Date?", "score": 0, "replies": []}]}
{"title": "Anybody playing $CRM ahead of earnings?", "selftext": "Just got one $150 call 11/16 during today's mini dip. earnings scheduled for 08/29.thoughts on $CRM?", "id": "96zozj", "created_utc": 1534177251.0, "score": 6, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "Safe play is to do a calendar spread with ITM puts if you are bullish. For example, buy the $150 put for 9/21 and sell the $150 put for 8/31. Unless CRM goes to $149 after earnings, your call will likely lose value from the IV crush. With this play you make money as long as the share price is about $144 and unlike writing the $144 put, you don't take on large losses if the share price tanks. The spread only costs about $100 so its super cheap to do multiple as well.\n\n", "score": 4, "replies": []}, {"body": "I've been holding 145C and 150C 10/19's for a few weeks now. ", "score": 3, "replies": []}, {"body": "04/29?", "score": 2, "replies": [{"body": "edited ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I always do a quick search before taking someone's advice on WSB ... I will hold my call for now lol\n\n[https://www.reddit.com/r/wallstreetbets/comments/935itl/too\\_late\\_to\\_panic/](https://www.reddit.com/r/wallstreetbets/comments/935itl/too_late_to_panic/)", "score": 2, "replies": []}]}, {"body": "182109 $150 C x3", "score": 1, "replies": [{"body": " 182109 ?", "score": 1, "replies": [{"body": "September 21st 2018 $150 Call", "score": 1, "replies": [{"body": "Nice. We're going through some pain rn but it should bounce back from $144. Looks like $144 is acting as support.", "score": 1, "replies": [{"body": "are you selling before earnings? or riding through", "score": 1, "replies": [{"body": "I have only one contract so I will probably sell before earnings if I get a decent return. What about you?", "score": 1, "replies": [{"body": "6 contracts, 3 on margin. probably clearing margin ones depending on where we are end of next week and holding the cash through. ", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "MSFT 8/17 calls", "selftext": "Who is gonna buy? This sell of isn't gonna last all week", "id": "96zpcv", "created_utc": 1534177326.0, "score": 11, "upvote_ratio": 0.8, "num_comments": 18, "comments": [{"body": "Copped some Jan 110s myself. We shall see how it goes ", "score": 11, "replies": [{"body": "Those long calls are so sweet. But anything can happen.", "score": 3, "replies": [{"body": "I am sitting in little over 50% cash rn so hopefully I can keep dip buying.", "score": 3, "replies": [{"body": "If your outlook is long term I'd say any dip is a good dip.", "score": 2, "replies": []}]}]}]}, {"body": "I'm probably going to keep an eye on it, but I'm currently going to wait before buying more options. For all we know this is only the beginning.", "score": 4, "replies": [{"body": "As always it can go either way. Other \"people\" have said things along the lines of ; could be CEO selling for a split or something Or preparing for government contract. But honestly I have money in there for 1 contract. If it does seem like there's gonna be a turn around maybe buy some more.", "score": 2, "replies": [{"body": "I think MSFT has a great outlook, but you're talking about an option that expires in 5 days. 90% of the price movement on that option will be determined by what kind of market it is, and this week is definitely not off to a good start.", "score": 10, "replies": [{"body": "Yeah, I see what you mean. Just gotta wait and see. Maybe there is a reason or maybe just a pull back. Time will tell.", "score": 1, "replies": []}]}]}]}, {"body": "MSFT already had its rally back up to ATH. Think it will climb later this month, don't think it will push past ATH with no catalyst this week. Could creep up just don't buy above 109c imo. ", "score": 4, "replies": [{"body": "The closest call I have ATM is 9/17 109c. This does seem like a good dip to buy some more long calls.", "score": 1, "replies": [{"body": "Certainly. The dip could easily get dippier this week or next week though. ", "score": 1, "replies": []}]}]}, {"body": "Buying Sept and Oct cause when they win Jedi contract (No way Amazon snags this) we’re all going to the moon", "score": 3, "replies": [{"body": "Any long term play is just smart.", "score": 1, "replies": []}]}, {"body": "MSFT is for the long games. I have 100 shares to sell weeklies against and as much money in leaps ", "score": 2, "replies": []}, {"body": "Why so much selling ahhhh", "score": 1, "replies": [{"body": "Test the waters for week hands.", "score": 2, "replies": []}]}, {"body": "Up 30% since this morning since I read this.", "score": 1, "replies": [{"body": "Fuck. I hadn't been looking. Man I knew it!", "score": 2, "replies": []}]}]}
{"title": "Grab yourself some $PM calls", "selftext": "Despite lackluster earnings this thing really took off. Price target was cut or maintained by just about everyone yet Philly boy sailed up to the high 80s only to be bogged down by the recent noise.   \n\n\nCheck out the volume on those September 85 calls. Then check out PM's stupidly large dividend. You know who likes dividends? Pussies during a trade war, aka every stonk investor since they're all 80 years old and scared of everything. \n\nYou're welcome for this infallible DD", "id": "96zuae", "created_utc": 1534178279.0, "score": 13, "upvote_ratio": 0.88, "num_comments": 10, "comments": [{"body": "Vape Nash bro", "score": 5, "replies": []}, {"body": "[I called this shit during earnings](https://www.reddit.com/r/wallstreetbets/comments/8zwxw3/betting_the_farm_against_pm_tomorrow_morning)\n\nThat fat dividend is the only thing keeping this stock afloat for now. Their business is shrinking everywhere but the \"3rd world\" and has been for several quarters. Also, they are having problems launching their IQOS in the US and they're so far behind the other smaller manufacturers like JUUL that it probably won't be as successful as they hope anyway.\n\nAt the moment it's a failing business with a gimmick (fat dividend) to keep long term 401k investors locked in. All tobacco stocks are garbage VS the S&P. \n\nIf they cut that dividend in October and/or IQOS gets denied by the FDA, they're fucked. ", "score": 5, "replies": [{"body": "> IQOS gets denied by the FDA\n\nThis would absolutely crater them. I'm talking 20% drop. Except them dropping 20% may mean a re-merger of $MO and $PM. \n\nI will say one thing to defend them- Phillip Morris sets the price in 99% of their markets internationally. The other players are price takers.", "score": 1, "replies": []}, {"body": "Isn't US a fairly small market compared to Asia for iQOS? They were talking about expanding to India which has a shit ton of smokers", "score": 1, "replies": []}]}, {"body": "Fuck yeah. Currently at a 5 year low, this thing has to go up from this point forward.", "score": 3, "replies": [{"body": "The stock has been trending downwards for a year straight VS the rest of the stock market being up ~17%. Lowered EPS guidence every earnings this FY. Sales slowing. Less people smoking. More and more smoking regulations and taxes. Wildly popular alternatives to traditional cigarettes. \n\nYeah this is definitely a buy signal, can't possibly go any lower. ", "score": 5, "replies": [{"body": "Most of their cig sales are abroad no? Trust me Asians are still smoking, the entire continent is basically engulfed in a smoke cloud. \n\nAnd after it bottomed out post apocalypse ER (quarter b4 this one) it's been steadily trending up, especially as trade war shit got it riled up. It's a \"defensive\" stock so as long as people are scared PM and its fatty div will have a home", "score": 1, "replies": [{"body": "I would NOT hold through earnings though. Too risky", "score": 1, "replies": []}]}]}]}, {"body": "This advice has been the only thing keeping me green the past two days. Thank you kindly! ", "score": 1, "replies": [{"body": "np! PM and the VIX were pretty much the only green on my watchlist today.", "score": 1, "replies": []}]}]}
{"title": "For those eyeing that BAC drop...", "selftext": "Don’t fucking do it! That piece of shit is the filthiest of whores. I bought the June dip, 60 days out, ATM, and that thing just slow bled out with a weekly tease to make you think it would come back.\n\nPlenty of better options out there (like MU).", "id": "971dij", "created_utc": 1534188754.0, "score": 12, "upvote_ratio": 0.93, "num_comments": 10, "comments": [{"body": "I bought bigly once, was down 40 per cent at one point, got out 5 per cent in the green after bag holding for a month. Never again ! ", "score": 9, "replies": []}, {"body": "I thought Roxy was the filthiest of hoors", "score": 5, "replies": []}, {"body": "The trick is to short both calls and puts, BAC usually doesn't move enough for long straddles to pay off.", "score": 6, "replies": []}, {"body": "this post came 30 minutes too late... i just doubled down on my 9/21 calls", "score": 1, "replies": [{"body": "Lol same doubled down on my 11/16 calls", "score": 1, "replies": []}]}, {"body": "Phew, glad WSB is against this one.  I was starting to doubt the 6/2019 $30c i just bought.  Cashed out on the same contract a few weeks ago for a nice 30% profit, bought back in on the dip.", "score": 1, "replies": []}, {"body": "BAC IS THE DEVILS WHORE \n\nIf you're buying it buy fucking leaps or something and never look at them\n\nI'm not touching that piece of shit unless it's at $27, and even then I'm buying leaps", "score": 1, "replies": [{"body": "I recommend looking at $C instead, it trades more stable since it's got a much better dividend and it's trading closer to its lows so sentiment is still \"undervalued\" although it doesn't matter much when you're a bank stock because banks don't make money anymore apparently. ", "score": 1, "replies": []}]}, {"body": "Sold calls last week. Fat fingered 23 instead of 3. I’m happy I did. ", "score": 1, "replies": []}, {"body": "I've seen molasses in January move faster than BAC. Lmk when it back below 29...", "score": 1, "replies": []}]}
{"title": "AAPL 8/31 $220 Calls", "selftext": "Just picked up a handful of 8/31 AAPL $220 calls... IMO this is a great play - Change my mind.", "id": "971h2r", "created_utc": 1534189426.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 29, "replies": [{"body": "The buy high and pray it goes higher strategy.", "score": 11, "replies": [{"body": "Hey that's my strategy too ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Stocks go up forever. Profit taking is a myth perpetuated by the jews.", "score": 10, "replies": []}, {"body": "That’s a special level of retardation. Welcome, you’re in the right place. ", "score": 10, "replies": []}, {"body": "We found him, the investor who will buy AAPL over a trillion!", "score": 9, "replies": []}, {"body": "You think Apple is going to go up more than 5% in three weeks? ", "score": 3, "replies": []}, {"body": "sell before the dividend payout", "score": 3, "replies": [{"body": "Why? Ex div was Friday so he’s already too late.  ", "score": 2, "replies": [{"body": "yeah you're right, didn't know which date it was ", "score": 3, "replies": []}]}]}, {"body": "Go for November $250 calls if you want autistic OTM to snag the supercycle run up post earnings", "score": 2, "replies": [{"body": "Damn, those are cheap! Thanks for the tip. ", "score": 2, "replies": [{"body": "Np I have $4k in Jan 19s and 1 November $225 but I might yolo another $300 in some November $250s.\n\nI think Apple buys back the max amount of shares (5% of volume?) they can everyday. \n\nApple has a lot behind it and if services hit big again in November then I can see P/E hitting 21 and EPS guiding to around $12 would put shares around $250", "score": 2, "replies": []}]}]}, {"body": "You were right, I was wrong. \n\nBut I got a nice scalp on it so thanks! Unreal how its parabolic on a bloody day.\n\n", "score": 1, "replies": []}]}
{"title": "Bumper Falls Off Brand New Tesla Model 3 After 30 Minutes and Some Rain (Updated)", "selftext": "", "id": "972bht", "created_utc": 1534195399.0, "score": 11, "upvote_ratio": 0.7, "num_comments": 16, "comments": [{"body": "[deleted]", "score": 39, "replies": [{"body": "so short $mu, got it.\n", "score": 16, "replies": [{"body": "If anything, it’s long MU. TSLA is going to install memory on these bumpers so they remember to stay attached.", "score": 3, "replies": []}]}, {"body": "Cutting edge quick-release bumpers designed to disengage the from car right before a crash so the bumper doesn't get damaged", "score": 9, "replies": []}, {"body": "Just part of the unlockable dune-buggy skin", "score": 4, "replies": []}, {"body": "I can't understand the garbled jibberish coming out of your mouth. Please take out Elons dick first, thanks", "score": -5, "replies": [{"body": "I know it's been a rough couple of days but this is pretty obvious sarcasm", "score": 8, "replies": [{"body": "So it's mine :(\n\nJust jumping in the bandwagon", "score": 1, "replies": []}]}]}]}, {"body": "This is good for tesla.  Less weight = longer battery life.  ", "score": 15, "replies": []}, {"body": "bumper secured ", "score": 12, "replies": [{"body": "Bumper NOT Secured. Bad Elon", "score": 2, "replies": []}]}, {"body": "That’s a feature. ", "score": 3, "replies": []}, {"body": "This cheap bastard decided not to pay the extra $500 for undercoating, that’s what you get.", "score": 4, "replies": []}, {"body": "Who are these pussies living in states that get rain? Can't drop your bumper in the rain if it never rains. ", "score": 2, "replies": []}, {"body": "If its new why does it already have plates on it?", "score": 1, "replies": [{"body": "You transfer plates from your old car.", "score": 2, "replies": []}]}]}
{"title": "AMD TO DA MUUN", "selftext": "", "id": "972twa", "created_utc": 1534199190.0, "score": 16, "upvote_ratio": 0.86, "num_comments": 15, "comments": [{"body": "RIP — Nvidia just announced Turing and new Quadro RTX GPUs ", "score": 5, "replies": [{"body": "Huge 700mm+ die. AMD to counter with MCM design. ", "score": 1, "replies": [{"body": "Not unexpected but still pretty significant since amd hitting 7nm before nvidia it looks like.  Perhaps they are waiting till next year,  haven't really been paying attention to nvidia roadmap since I've been investing in AMD solely on their ability to run over Intel all next year.  \n\nHave 1100 @ 11.51 avg with another 10k in calls expiring 2020 @ 20/25 strike.", "score": 1, "replies": []}]}]}, {"body": "When will you sell?\n\n  \n", "score": 4, "replies": [{"body": "The amd chart is stock porn. You hold until you cannot. ", "score": 10, "replies": []}]}, {"body": "AMD is very underrated. They are giving INTC a run for their money in the server + gaming market. If you have a I5-8600k/I7-8700k, thank AMD for pushing INTC to get their mainstream processors to 6 cores. Awesome job on the position! ", "score": 4, "replies": [{"body": "Their stock price sure isn't underrated", "score": 4, "replies": [{"body": "Their mkt cap is", "score": 2, "replies": [{"body": "If only market cap was related to stock price somehow. My bad.\n\nYou better by in before everyone realizes that Intel's 10nm is going to be late plus their 10nm server chips aren't coming till 2020.", "score": 3, "replies": []}]}]}]}, {"body": "Picked up 10k shares this morning PM at 19.19 and sold around 9:45 near 19.35. Made some quick money but kind of regretting my decision.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Primary reason to sell was to buy nvidia calls before earnings. The subsequent drop in NVDA share price lost me about 10k.", "score": 0, "replies": []}]}]}, {"body": "As a long holding shares I only enjoy seeing the posts where people lose money buying puts", "score": 1, "replies": []}, {"body": "I don't understand I thought AMD already went to the Moon. can't go to the moon and then go to the Moon again obviously.", "score": 1, "replies": [{"body": "Many moons to come", "score": 1, "replies": []}]}, {"body": "High noon ", "score": 1, "replies": []}]}
