{"title": "Investing another chunk of change", "selftext": "My current portfolio is as follows:\n\nAmazon\n\nApple\n\nGoogle\n\nVisa\n\nBerk B\n\nDisney\n\nBoeing\n\nMicrosoft\n\n*Should I add one or two more companies or just add money to my current positions? I know I am tech heavy.*\n\nThanks for your responses in advance!", "id": "9aln4n", "created_utc": 1535340367.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 11, "comments": [{"body": "MU 90 calls", "score": 7, "replies": []}, {"body": "Buy jd.com too", "score": 3, "replies": [{"body": "Haha, funny", "score": 1, "replies": []}]}, {"body": "So I’m brand new to trading. \nLike BRAND NEW as of two days ago. \nYour portfolio consist of Boeing. \nWithout getting to political, do you think they’re going to drastically increase in the next 5 years with all this “space force” talk. Or do you think Lockheed Martin is a better choice?", "score": 2, "replies": [{"body": "also consider how tariffs will effect company", "score": 1, "replies": []}, {"body": "I think it will increase a lot. Defense is a HUGE part of this country, and I don't see it going away anytime soon. Honestly, I think Lockheed will grow as well. So, either would be a good pick.", "score": 1, "replies": []}]}, {"body": "I would add to V, AAPL, MSFT AND GOOG. New would be a health care or financial.", "score": 2, "replies": []}, {"body": "Pick the clear winners. ", "score": 4, "replies": []}, {"body": "I wish I were in Ur position Amazon! ", "score": 1, "replies": []}, {"body": "I would sell Brk and buy a small cap index. ", "score": 1, "replies": []}]}
{"title": "PYPL and Phone Payments", "selftext": "When I look at Tencent or Alibaba and their mobile scan payment system that has basically taken over China, I wonder who will lead that charge stateside? Sure Apple has Apple Pay, but that hasn't caught on here really (not to say it won't). The one company I look at who I think could really revolutionize transactions in the western world is PayPal. They've already got Venmo and it's incredibly popular among millennials and even other generations now. \n\n&#x200B;\n\nIs PayPal going to be the one to really take mobile phone payment to the next level, or will it be Apple, someone else?", "id": "9aq260", "created_utc": 1535384844.0, "score": 34, "upvote_ratio": 0.84, "num_comments": 12, "comments": [{"body": "[deleted]", "score": 17, "replies": []}, {"body": "Adyen, Paypal, Square.\n\nApple Pay and mobile payments in general have not caught on in the US. Apple Pay is catching on more in Europe and elsewhere. Meanwhile, people are paying with facial recognition at KFC in China.\n\nAdditionally, I don't think this is a \"winner take all\" market, but I think people also have to think about the idea that Square in particular is trying to get a banking license, Square is offering all sorts of services to businesses, Square has Caviar, Square has the Cash App. If Square gets a banking license, I think there's a scenario down the road of Square evolving towards something of a hybrid tech bank.", "score": 13, "replies": [{"body": "More and more people are using mobile payment in the US. I think it'll just take a lot longer to get critical mass, however, since we always seem to be the last to adopt anything banking related.\n\nI also wouldn't be surprised if we ended up ultimately adopting something QR based (like Venmo's merchant pay mentioned elsewhere here). Merchants *really* don't like the card networks--more so than elsewhere--and thus could end up jumping on an credible alternative quickly.", "score": 4, "replies": []}]}, {"body": "FINX.", "score": 4, "replies": [{"body": "Well this is certainly a interesting ETF. A lot of companies I haven't heard of before. Although I'd be a little more interested if it also had V, MA and AMEX in it.\n", "score": 1, "replies": []}]}, {"body": "Venmo already has a \"merchant pay\" feature that's fairly new. Pretty sure it's done with QR code. ", "score": 3, "replies": []}, {"body": "If you aren't looking exclusively at US stocks, try giving Danske Bank a look. MobilePay is installed on >90% of consumer smartphones in Denmark. They didn't do a good job capturing the Norwegian market, but are expanding into Finland. You'll also get them at a pretty good discount due to the ravages of a recent laundering case in Estonia.", "score": 3, "replies": []}, {"body": "I know more people that use Apple Pay on a regular basis than Venmo/PayPal (Including myself). Seems like every store I go to Apple Pay is available as well (Trader Joes, Ace, Giant Eagle, Etc.). Just my two cents\n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well you've pointed out the biggest issues with the phone payment systems in the US, they are all proprietary. If there was a open standard of contactless payments and they were included every new reader installed it would probably take off much more than it has. ", "score": 1, "replies": []}, {"body": "> Why can you only use Apple Pay at participating stores?\n\nThis isn't the case. It's the same as the UK, in that any contactless reader works with Apple Pay, Google Pay, and contactless cards. The thing is is that there are a significant number of merchants either don't have contactless readers, or have the contactless capabilities turned off.\n\nThe other difference in the US is that contactless cards never became very popular, so contactless payments tend to be associated with mobile phones rather than cards.", "score": 1, "replies": []}, {"body": "Contactless cards were never (and still aren't) that common, so many stores are really only enabling it because of AP. And since a lot of stores also use custom software on their terminals/POS systems instead of whatever the bank provides, some aren't going to start a software development project to enable it unless there's enough demand.", "score": 1, "replies": [{"body": "Yes, this is basically the reason. For what it’s worth, a lot of stores accept Apple Pay & Google Pay, but a few big ones still don’t. Like Walmart & Target. ", "score": 1, "replies": []}]}]}]}, {"body": "WeChat is huge in China. ", "score": 0, "replies": []}]}
{"title": "AMD", "selftext": "AMD is growing like crazy right now and I want to invest but I’m not sure when to invest. Buy low- sell high is the motto but it’s been up almost 100% in the last 3 months and I’ve been waiting for a decent dip to buy. Is it worth waiting still now that it’s $26??", "id": "9aqj2s", "created_utc": 1535388083.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 19, "comments": [{"body": "FOMO", "score": 11, "replies": []}, {"body": "Be fearful when others are greedy - It's ran up quite a bit and AMD has been very volatile in the past (look up the max stock performance, not just last 5 years) \n\n&#x200B;\n\nHowever, they have A+ leadership so we'll see - Don't let Fomo guide your decision making. Are you wanting to invest because you think it's undervalued in the market, or are you mad you didn't get in previously and are trying to make up for it? ", "score": 8, "replies": [{"body": "I agree, but first off how can I even tell if a stock is undervalued, overvalued, or about where it should be???", "score": 1, "replies": [{"body": "Lots and lots of ways - you should check out some good investing books (Random walk down wallstreet, the intelligent investor, etc.) to learn how to value a stock fairly \n\n&#x200B;\n\nI mainly look at the normal stuff (p/e ratio, forward p/e, the beta, etc.) but also their balance sheets, cash flow statements, leadership, porter's 5 forces on their industry, do they have a moat, what's their future plan, etc. \n\n&#x200B;\n\nAlso, the million dollar question before investing is ask your self \"Will this company double or triple their current earnings in 5 years\" If the answer is yes, it's time to invest. Don't just invest because people on reddit are discussing it - don't be a sheep!", "score": 6, "replies": []}]}]}, {"body": "I can’t decide how long to hold ", "score": 3, "replies": [{"body": "I just bought in. You better not sell", "score": 2, "replies": [{"body": "I don’t plan on it ", "score": 3, "replies": []}]}]}, {"body": "Most analysts have it going $30+ in the short term", "score": 6, "replies": [{"body": "Source?\nI see only 11 out of 31 analysts giving AMD a buy or strong buy ratings (on yahoo finance).", "score": 1, "replies": []}, {"body": "I would be shocked, tbh", "score": 1, "replies": []}]}, {"body": "So did you buy in and lose money?", "score": 2, "replies": [{"body": "No lol I’m still waiting.....", "score": 1, "replies": [{"body": "Alright that's goods try not to FOMO and buy in when you don't believe in the stock then sell at a loss when it goes down.", "score": 1, "replies": []}]}]}, {"body": "I bought in strike at 22.50 contract expiring the 31st can’t decide if I’m going to roll it over or sell and get out now", "score": 2, "replies": [{"body": "So not for AMD but I’m interested in buying options. I know the fundamentals and learned in college about calculating them and all but I don’t know how I can do things irl. If I buy options on robinhood for instance and know I don’t have enough to buy the stocks at expiration, will there always be someone/someway to sell the options?", "score": 1, "replies": []}]}, {"body": "I bought some 2 weeks ago and I am up 30%", "score": 0, "replies": [{"body": "Yea I know lol... I’m taking about now ", "score": 6, "replies": [{"body": "It will eventually come down. Look at AMD and MU historical chart. Severe up and down spikes and neither have ever had 3 positive years in a row in their history. That will most likely change this year, but it's still treated like a penny stock. \n\nI still consider it a very long term hold, but I fully expect a 15-20% dip over a 2 week span later on this year.", "score": 1, "replies": []}]}]}, {"body": "Get in ASAP AMD is on fire", "score": -3, "replies": []}]}
{"title": "Is AMD the next MU", "selftext": "I did not open another position when it was around 10.00 when I was contemplating after it rose above what I initially wanted to enter at and the stock has finally broke out. Could we see AMD run up like MU did last year or will it pull back.  ", "id": "9at0pe", "created_utc": 1535405619.0, "score": 5, "upvote_ratio": 0.62, "num_comments": 17, "comments": [{"body": "lol AMD goes up 5% a day , MU goes down 2% a day, the answer is no. AMD TO THE MOOOON.", "score": 27, "replies": [{"body": "username checks out", "score": 23, "replies": []}, {"body": ">lol AMD goes up 5% a day , MU goes down 2% a day, the answer is no. AMD TO THE MOOOON.\n\nCan I  ask you why AMD  to the Moon  and  MU not?", "score": 1, "replies": [{"body": "Amd has a story: it's taking market share from Intel and nvda2, mu doesn't ", "score": 1, "replies": [{"body": "> Amd has a story: it's taking market share from Intel and nvda2, mu doesn't \n\nit may take  ashare in the future", "score": 1, "replies": [{"body": "Flash news , that's how the market works. Trade the future value not the present.hence mu is shitting the bed everyday  ( dram going down in future ) Amazon is up everyday  ( it's going to take over the world), amd double in 2 months  ( intc problems so amd is GOING TO take market share )", "score": 1, "replies": []}]}]}]}]}, {"body": "AMD was MU before MU was MU. MU will have to become the second coming and rebirth of AMD before AMD can be the next MU again. Otherwise AMD is MU no more. ", "score": 6, "replies": [{"body": ">AMD was MU before MU was MU. MU will have to become the second coming and rebirth of AMD before AMD can be the next MU again. Otherwise AMD is MU no more.\n\nWhat is the difference between the  two?", "score": 1, "replies": [{"body": "A, D, and U.\n&nbsp;\n\nAMD was a meme stock before MU was. MU has been running out of meme steam while AMD just picked up its second meme steam engine past $20. After it hit $10 it was rangebound between 10 and 14 for some time.\n&nbsp;\n\nFundamentally, they are entirely different with the only similarity being in semiconductor space. MU makes a commodity and is quite good and profitable at doing that, but the cyclicality of a tech commodity has suppressed the price when you look at a low P/E (as well as China trade spats suppressing due to Micron's exposure to China via sales and manufacturing.)\n&nbsp;\n\nAMD is recapturing market share in the CPU (and to some small extent GPU) space. Their surging has to do with their own innovations as well as Intel's continual shortcomings in innovation. AMD has a lot of growth projection and uncertainty in future profits while we already know MU checks cheddar like a food inspector (see their upcoming $10bn buyback initiating in September, as well as their earnings and cash flow). AMD is still trying to become profitable consistently, and just recently broke their ATH share price which was last reached in 1984 I think. ", "score": 1, "replies": []}]}]}, {"body": "Nice meme", "score": 3, "replies": []}, {"body": "Short term pull back. ", "score": 4, "replies": []}, {"body": "Wrong question\n\nShould be worded: \"Is MU the next AMD?\"", "score": 1, "replies": []}, {"body": "Intels shipments are still increasing, meaning x86 is a growth market.  I'd say Intel would be worth far more than it is if AMD wasnt eating their lunch, being worth only 10% of Intel means they have a ton of room to grow.", "score": 0, "replies": [{"body": "It’s eating shit. Brian was fired because he just couldn’t deliver.", "score": 1, "replies": []}, {"body": ">Intels shipments are still increasing, meaning x86 is a growth market.  I'd say Intel would be worth far more than it is if AMD wasnt eating their lunch, being worth only 10% of Intel means they have a ton of room to grow.\n\nIntel has still room to grown?  What is  Intel advantage over  AMD?", "score": 1, "replies": [{"body": "they are working on GPUs now, but that is at least 2 years away from seeing any product release", "score": 1, "replies": [{"body": "> they are working on GPUs now, but that is at least 2 years away from seeing any product release\n\nIntel  also has  GPUs...  tell me somenthing new", "score": 1, "replies": []}]}]}]}]}
{"title": "AMD short plays", "selftext": "[deleted]", "id": "9atwc0", "created_utc": 1535412591.0, "score": 3, "upvote_ratio": 0.62, "num_comments": 12, "comments": [{"body": "There's always a chance for a dip, but this squeeze in conjunction with Sunday's news on their new video card is going to push them higher. I wouldn't be surprised if they hit $30 by the end of the week.", "score": 6, "replies": [{"body": "I wouldn't be surprised, but I would think it is insane.", "score": 2, "replies": []}, {"body": "Now they dropped?", "score": 1, "replies": [{"body": "Like I said, there's always a chance for a dip. Can't expect a run up without room for corrections. ", "score": 1, "replies": []}]}]}, {"body": "I want to thank this sub for bringing my attention to AMD. I only have 30 shares but I bought at $9. ", "score": 3, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[removed]", "score": 17, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "[removed]", "score": 35, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[removed]", "score": 5, "replies": []}]}]}, {"body": "Oh my god what an enticing bet between two accounts both created a month ago...\n\n", "score": 10, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Tesla is on track for incredible production record this quarter albeit being behind on Model 3 goal", "selftext": "", "id": "9ar1pb", "created_utc": 1535391588.0, "score": 17, "upvote_ratio": 0.86, "num_comments": 19, "comments": [{"body": "If this  is true, this is not good news. To reach 7k-8k by the end of the year, 6k by August was important, not to mention reaching 5k comfortably.\n\nHowever, short term it might not be such a big deal. The numbers seem very close to guidance. Maybe they can speed that up a bit and reach targets. \n\nVolume is not everything. If the ramp is slower than planned but they are maximizing margins by efficiency improvements and  quality improvements, then Q3 being profitable is secured.\n\nI expected Q4 to be breakout quarter, but for that to happen production must increase significantly. If production reached a point were iterations hit diminishing returns too early, then paradigms must change and that implies heavy rework of the line, causing expenses and delays.\n\nTesla has enough cash to make some heavy modifications, but probably not enough to build another factory. If they want to make heavy modifications to the line they may need to raise some cash in Q4.\n\nThat leads to the question, what are the bottlenecks? I get the feeling that the problem is not Gigafactory.  Gigafactory was a major issue at the beginning, but it seems to me that after the Grohmann upgrade Gigafactory is no longer a bottleneck. Increasing production in Gigafactory is probably a matter of \"copy & paste\".\n\nThe problem is likely at Tesla factory. If they could \"copy & paste\" the current profitable configuration of Fremont, then Tesla will meet production targets but margins will take a hit. If Tesla keeps grinding at Fremont then production suffers but margins improve. \n ", "score": 3, "replies": [{"body": "Based on what Musk has said and from that Evercore report, the bottlenecks are now in the body shop. It is highly automated so making changes there takes time. They are working on it but software and robots aren't as adaptable as humans so they may be stuck at sub 5000 for a few months then see another big pick up in production.", "score": 2, "replies": [{"body": "Yeah, after reading more details on the Evercore report that's what it looks like. That's good. It means a very big jump soon.", "score": 1, "replies": []}]}]}, {"body": "Production numbers are old news. Unless numbers are low, I don't think it'll affect share price much.\n\n\nMarket is going to look for Tesla profitability next quarter.", "score": 3, "replies": [{"body": "If they don't hit the target, how are they going to be profitable?", "score": 2, "replies": [{"body": "There are more factors to their profitability than just how many cars they sell. \n\nAre you really sure you should be investing in this stock? There are a lot of very basic things you don't seem to understand based on previous discussions I've had with you. I don't intend any animosity, I don't want you getting burnt.", "score": 3, "replies": [{"body": "He is not an investor he is a short", "score": 2, "replies": []}, {"body": "What level of production do you believe is essential for profitability? Or, are production levels completely disconnected from profitability?", "score": 2, "replies": [{"body": "I haven't looked at the numbers myself. Some have said it's 4400 per week if I remember correctly. \n\nThe point is the sale of the cars themselves only brings in so much. You're looking at roughly $2.75b at their target for Model 3s based on their stated target production numbers for the quarter.   \n\nWhat also matters is spending. Reduction on labour hours to reach the target car numbers. Clean up of logistics to reduce rush freight costs. Continued reduction in cap ex. because the line is now built out. Numerous other things we've heard they've done over the last few months, as well as things we've heard nothing about.\n\nThings that have been discussed in the conference calls that the GP has clearly either not listened to or not paid enough attention to. ", "score": 2, "replies": [{"body": "Maybe I'm misunderstanding your point, but it seems you two are saying the same thing -\n\na. Reaching productions targets is essential to profitability\n\nb. Reaching production targets + other changes are essential to profitability.\n\nI guess that I don't understand your antagonism towards that comment. Sorry if I've misunderstand, I'm really curious about what I'm missing.", "score": 1, "replies": [{"body": "No antagonism intended in my comment. \n\nThe point i was trying to get at was production was one factor, but only one of many. There's scope, though it's obviously not the best case scenario, to miss those 55k Model 3 targets and still be profitable.", "score": 1, "replies": []}]}]}]}, {"body": ">There are more factors to their profitability than just how many cars they sell.\n\nI agree, but very few of them matter if Musk can't make enough cars to sell to keep the lights on. ZEV credits only go so far.", "score": 0, "replies": []}]}]}, {"body": "A lot of he shorts still say they're not producing as many as Bloomberg tracker says. If the quarter average is over 5k and closer to 6 it might have an effect still. \n\nI'd say profitability and if there's any indication that demand is increasing, or at least not waning. That's another short thesis lately. Still, I don't think we're in for the real short squeeze until Q4 or Q1/19. ", "score": 1, "replies": []}]}, {"body": "I fail to see how missing guidance is good news, especially since it is already teetering on another Moody's downgrade.\n\nMoody's wrote this in March:\n\n>Tesla produced only 2,425 Model 3s during the fourth quarter of 2017; it is currently targeting a weekly production rate of 2,500 by the end of March, and 5,000 per week by the end of June. This compares with the company's year-earlier production expectations of 5,000 per week by the end of 2017 and 10,000 by the end of 2018.\n\n>The negative outlook reflects the likelihood that Tesla will have to undertake a large, near-term capital raise in order to refund maturing obligations and avoid a liquidity short-fall. Prospects for addressing its liquidity requirements (whether equity, convertible notes or debt) will be supported if the company can establish credibility for reaching Model 3 production levels -- 2,500 per week by the end of March, and 5,000 per week by the end of June.\n\n>Tesla's rating could be lowered further if there are shortfalls from its updated Model 3 production targets. The rating will also be pressured if the company is unable to raise sufficient new capital to cover its late-2018 and early-2019 convertible maturities, and to cover the operating cash consumption that will likely continue into 2019.\n\nIn August, it wrote this:\n\n>Although the company's cash generation will improve during the second half of 2018 and over the coming year as Model 3 production improves, we continue to expect that Tesla will need to access the capital markets in order to fund its operating requirements and repay the maturing convertible debt obligations.\n\nTesla has $230MM of debt to repay in Q4 and another $920MM to repay in Q1 2019. \n\nThe stock would have to jump to $561/share to avoid paying off  the $230MM maturity in cash, and ~$360/share to avoid paying off the $920MM maturity in cash.", "score": 3, "replies": []}, {"body": "If the number drops below 5000/week, I wonder what Moody’s will do?", "score": 1, "replies": []}, {"body": "So, barring other news, this shouldn’t be a surprise to anyone come September. If that’s the case, I would guess the stock climbs higher before? Buy the rumour sell the news? What do you guys think the stock will do between now and  end of q3?", "score": 1, "replies": [{"body": "I'd bet on it being highly volatile between 300 and 370 with only a loose correlation to the news.\n\n", "score": 4, "replies": []}]}, {"body": "> During the current quarter, Model 3 production is still very volatile and it has been limited to about 3,500 to ~4,900 per week based on a 7 day moving total\n\nHonestly that would be a huge accomplishment. \n\nNo bullshit if they exit Q3 near 4.5k/week they have done very well.", "score": 1, "replies": [{"body": "The numbers given only come out to about 3800/week on average. ", "score": 1, "replies": []}]}]}
{"title": "I started options with $78 a month ago, I’m at $758 as of close on Friday. All of it has been reinvested into AMD calls and this is my third and final set of AMD calls this month. TO THE MOON", "selftext": "", "id": "9alpz4", "created_utc": 1535341114.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 15, "comments": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Lol up until options, I averaged 30-35% growth a year and I DIVERSIFIED like an idiot. I learned my lesson", "score": 1, "replies": []}]}, {"body": "Fuck it I’m in op", "score": 2, "replies": [{"body": "Lets ride this bitch to the sell together! Sure I almost have enough money in my acct to pay off my car, but thats not as fun ", "score": 1, "replies": [{"body": "Deal. My baby needs diapers ", "score": 2, "replies": [{"body": "In the next few weeks, you’ll be able to buy that baby more diapers than it can handle!", "score": 1, "replies": [{"body": "Has yours been placed? Mine is still pending. Thx", "score": 1, "replies": [{"body": "It seemed the second of open the price doubled to .30, I ended up buying 2 contracts at that and now its valued at .96", "score": 2, "replies": []}]}]}]}]}]}, {"body": "When did posting Queued orders made while the market is closed become a thing people do here?", "score": 1, "replies": [{"body": "Since I’ve been drunk and bored this beautiful Sunday night", "score": 1, "replies": []}]}, {"body": "Screenshot of queued orders = ban", "score": 1, "replies": [{"body": "Is that a rule? I’ll delete it if so", "score": 1, "replies": [{"body": "Lol, no, not a rule. Just that some people post queued orders but there's no knowing if they get filled, or if the OP just cancels the order after posting.", "score": 2, "replies": [{"body": "Lets be honest, its $75 and you can’t fake this kinda retardation. But if it doesn’t execute tomorrow by noon I’ll reset the price. ", "score": 2, "replies": []}]}]}]}, {"body": "Ballsy. I like it. ", "score": 1, "replies": [{"body": "L brands made me a shit ton, I just got into AMD last week. I’m just tryin to keep up my 250% a week ratio", "score": 1, "replies": []}]}]}
{"title": "Is “Long $TSLA” = “Long $ELON”? Does the market believe in the debt-laden company or it’s eccentric CEO/visionary’s ability to lead it? How would it react to a resignation/termination?", "selftext": "", "id": "9am4ln", "created_utc": 1535345311.0, "score": 1, "upvote_ratio": 0.55, "num_comments": 13, "comments": [{"body": "The supoort for them is 99% Elon worship. It's a foolish investment from a monetary perspective.\n\nHowever, I look at the investment in another way. Whose very likely to become an evil villain? Elon. And who's the evil villain going to target? Probably not his supporters. Therefore as I recomend  smoke detectors in your home, I recomend Tesla be in your portfolio", "score": 20, "replies": [{"body": "This is by far the most logical DD I’ve read on TSLA. \n\nFirst thing I do Monday morning is put on smoke detector, maybe even a carbon monoxide one too. ", "score": 10, "replies": []}, {"body": "I applaud your logic. 👍", "score": 3, "replies": []}]}, {"body": "I think it’s about 50% support for musky, 50% honest hope for the future of automobiles.  Tesla actually gave us an idea of what cars could look like going forward, of how to look good and be environmentally conscious (doesn’t have to look like a fuckin’ Prius) and did it with a haste no other new car manufacturer has been able to work at.  \n\nI hope he stays on (they sure need him at Tesla more than SpaceX ever did) but even if he doesn’t the company stands for something investors can and will get behind.", "score": 3, "replies": [{"body": "> environmentally conscious\n\nnothing about a tesla is environmentally conscious\n\nits a huge pile of toxic shit ", "score": -3, "replies": [{"body": "You're a fucking idiot. All that garbage about Tesla's not being clean is just that, garbage.", "score": 4, "replies": []}]}]}, {"body": "Old Bit is that you? your name looks funny", "score": 1, "replies": [{"body": "Who is that?", "score": -5, "replies": [{"body": "Bruh. Are you fucking new here or just retarded?", "score": 4, "replies": [{"body": " both. ", "score": -3, "replies": []}]}, {"body": "hes a dude that has long tsla puts (says he does at least) and posts negative articles 1-2 per day usually, he'll call you names too if you poke him", "score": 1, "replies": [{"body": "K well I’m not him. And this ain’t a negative article either", "score": 1, "replies": []}]}]}]}, {"body": "I hope that tesla will find their Lee Iacocca after they sack Musk. In ten years Musk will join the ranks of:\n\n-Geraldine Elizabeth Carmichael\n\n-John Delorean\n\n-Victor Muller", "score": 1, "replies": []}]}
{"title": "Tesla dd", "selftext": "anyone thought about maybe the investors who wanted Tesla to stay public agreed to buy up a chunk of the flowing shares to boost Tesla up, burn the shorts and keep Tesla stable at a higher price with less shorters available?", "id": "9aoavg", "created_utc": 1535371023.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 11, "comments": [{"body": "If it was a coordinated effort, pretty sure that counts as security manipulation.", "score": 18, "replies": [{"body": "doesn't have to be, if it official in Tesla and they do it as an investment in the company and not to earn money\n", "score": 1, "replies": [{"body": "That’s called “fundraising”, and Tesla already did this a number of times. Didn’t help much from volatility perspective. ", "score": 4, "replies": []}, {"body": "So, if a group of investors got together and pooled resources to influence a stock price, that would not be securities manipulation?\n\n Here's the definition from wikipedia, you tell me if it fits - \"Market manipulation is a deliberate attempt to interfere with the free and fair operation of the market and create artificial, false or misleading appearances with respect to the price of, or market for, a product, security, commodity or currency.\"", "score": 1, "replies": [{"body": "U have to understand", "score": 8, "replies": [{"body": "We are a profitable car manufacturer. ", "score": 7, "replies": []}]}, {"body": "Don't say you can't make a investment like that and it's not manipulation, you know it's possible bro, don't lie to yourself\n", "score": 1, "replies": []}]}]}]}, {"body": "What ever happened to the SEC and Tesla stuff?", "score": 2, "replies": [{"body": "He'll probably get a minor fine, they've got nothing on him. Its only FUD man", "score": 6, "replies": []}, {"body": "The sec is weak rn, Trump side effect. ", "score": 1, "replies": []}, {"body": "pretty sure it got tossed out the window.", "score": 1, "replies": []}]}]}
{"title": "AMD", "selftext": "Why is AMD still rising so much?", "id": "9aowro", "created_utc": 1535376383.0, "score": 7, "upvote_ratio": 0.65, "num_comments": 18, "comments": [{"body": "You have to understand. ", "score": 43, "replies": [{"body": "This is bad for MU.", "score": 6, "replies": []}]}, {"body": "Don't jinx it.", "score": 15, "replies": []}, {"body": "Fucking stop making new AMD posts there’s already 20 just comment in another or use the damn daily discussion ", "score": 10, "replies": []}, {"body": "Magic", "score": 7, "replies": []}, {"body": "Because I went all in on TSLA", "score": 8, "replies": []}, {"body": "40 mill shares shorted on friday, anyone can do the math for how much shorts have to cover? ", "score": 4, "replies": []}, {"body": "To the moon boys ", "score": 2, "replies": []}, {"body": "Noone tell him", "score": 2, "replies": []}, {"body": "Buy shares? Buu calls that end this week. 7% a day son.", "score": 1, "replies": []}, {"body": "y not", "score": 1, "replies": []}, {"body": "I shorted this shit out of this lmao", "score": 1, "replies": []}, {"body": "One word: Soob", "score": 1, "replies": []}, {"body": "Su Bae", "score": 1, "replies": []}, {"body": "short squeeze maybe. 20% of AMD stocks available for trade were shorted on 7/31.", "score": 1, "replies": []}, {"body": "Waiting on the dip like???! When the fuck is the train stopping!!!?", "score": 1, "replies": []}, {"body": "Lady Su Bae is crushing it. Praise the goddess. ", "score": 1, "replies": []}, {"body": "Panic sell it's going too high!!11!!! Xdddd lamooo", "score": 1, "replies": []}]}
{"title": "Whose going to do it? Who will take $400,000 out of $MU and yolo on $AMD Aug 31st $24 calls? I'm buying Volatility up while you all are watching AMD/Nafta crap.. Remember about Volatility fellas..", "selftext": "", "id": "9apd68", "created_utc": 1535379967.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 20, "comments": [{"body": "Hi GrapeJelly", "score": 15, "replies": [{"body": "Hello. Even though SPY is flying up, My 95 OTM  calls  aren't doing much. How lame is that.", "score": 4, "replies": [{"body": "thats the worst. what's happening with F?", "score": 1, "replies": [{"body": "Look at it, it's hitting $10 almost.. remember just a week or so ago it was $9.38..   5000 shares in that would have worked had I held. But everybody said Ford was dead and going lower.. now look at it.", "score": 3, "replies": [{"body": "I saw. It was bottoming out. should have listened to your instincts!", "score": 1, "replies": [{"body": "my next instincts are volatility.. I know it and this time I'm holding everything\n\nI'm going to buy more soon as well.  I know we will have some hilarious red days coming. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Do it! But please let me know before you pull out so I don’t lose my $120 😭😂", "score": 3, "replies": [{"body": "Bro mu finally on the run up and you want to sell for amd after the pump??", "score": 3, "replies": [{"body": "While that is correct, $AMD will run up faster and more than $MU..  \n\nalso the real point of my post was to watch Volatility during these high times.. Everybody is forgetting that the higher we go, the nicer pullback we will get and volatility spike.  So I'd say watch Volatility during all of this distraction for a good entry point.. (if you are into Volatility anyway)\n\nI got 700 shares right now on UVXY.. I'll be watching for lower entry points.", "score": 5, "replies": [{"body": "Your limit order to buy 65 contracts of MU $55.5 Call 08/31 executed", "score": 6, "replies": []}]}]}]}, {"body": "Glad I kept my 25 AMD calls over the weekend. ", "score": 3, "replies": [{"body": "Did you close it today though? ", "score": 1, "replies": [{"body": "Not yet see if I can hit 230% first. Probably goin to be my downfall", "score": 3, "replies": [{"body": "see.. just close and take profit.. open some otm cheap if you want to try to get some more..", "score": 6, "replies": [{"body": "This might be the most rational thing you've said in the sub", "score": 2, "replies": []}, {"body": "I closed this morning for 200% gain and thought I did good. \n\nThose were $27 calls that I thought it would never hit. \n\nIV also rockets lmao", "score": 1, "replies": []}]}]}]}]}, {"body": "How are those puts doing?", "score": 1, "replies": [{"body": "do you really not know? I'm holding some till the 21st of septmeber though to see what happens.", "score": 0, "replies": [{"body": "So you think this is all fomo, or a little bit of fomo and fuck loads of short squeeze layered on short squeeze?", "score": 1, "replies": [{"body": "this is short squeeze and pricing in everybody to force buy AMD now as a big boy stock. and not a sub $10 stock anymore.", "score": 2, "replies": []}]}]}]}]}
{"title": "Time for AMD puts?", "selftext": "[removed]", "id": "9aq8fj", "created_utc": 1535386028.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 17, "comments": [{"body": "30 or bust", "score": 9, "replies": []}, {"body": "Every time I average down on my puts the stock keeps going up. I sold my 500 shares thinking maybe that will catalyze a sell off but nooo it still went up ", "score": 3, "replies": [{"body": "134 million shares traded in 3 hours today and you thought 500 shares, or 0.000373% of total volume, was enough to not only move the needle but reverse a freight train of momentum.", "score": 3, "replies": [{"body": "Yea in chem catalysis happens on the last tiny tiny dropplet", "score": 3, "replies": [{"body": "Titration != stocks ", "score": 1, "replies": [{"body": "Oh 😔", "score": 2, "replies": []}]}]}]}]}, {"body": "My crystal ball says puts at 32.", "score": 2, "replies": []}, {"body": "It just went up 1% since I checked not long ago.  Surely it’ll pullback soon, until then I’m riding my FD calls until it doesn’t post a 3%+ gain pre market.  Already got 2x my initial cost out from the first calls I bought early last week, now I’m just letting it ride.\n\nI would’ve told you go for puts late Friday, glad I didn’t.", "score": 1, "replies": []}, {"body": "I think a lot of it is due to a short squeeze. Almost 25% of the float was short middle of last week. \n\nI’m not complaining though haha. ", "score": 1, "replies": []}, {"body": "Buy something like $30 call and $20 put to bet on AMD. Dont think it is gonna side way.", "score": 1, "replies": []}, {"body": "I’m going to cash out my calls soon. I’d agree, we are one bad day away from a mass selloff", "score": 1, "replies": [{"body": "Cash them out, but buy more OTM weeklies with like $500 of the profit. Keep it rolling. I just did that and my second round is up 88% already...", "score": 1, "replies": []}]}, {"body": "short squeeze", "score": 1, "replies": []}, {"body": "I tried to call the top 3 times, and I've lost 90%. Done trying", "score": 1, "replies": [{"body": "Same here", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "did you know that money can be made up, down, and side ways?", "score": 1, "replies": []}, {"body": "And more sign up each day. Make massive gains. Let them hold the bags.", "score": 1, "replies": []}]}]}
{"title": "I stopped buying FDs and stopped losing money.", "selftext": "Essentially, I stopped buying OTM FDs which lost me $3000 in 3 days, and bought ATM 9/14 NVDA calls that mooned. Took that money and bought higher strike 9/21 NVDA calls that mooned again. Let's see if I can not lose it all.\n\nhttps://preview.redd.it/y3d5obbryni11.png?width=1576&format=png&auto=webp&s=9260f56369e1c94b6d4f946bfb2ae28e407a0ba4", "id": "9aqhir", "created_utc": 1535387780.0, "score": 25, "upvote_ratio": 0.86, "num_comments": 10, "comments": [{"body": "Yeah, but a life not checking RH every 99 seconds is hardly a life at all. ", "score": 54, "replies": [{"body": "You mean 9.9 seconds ", "score": 14, "replies": [{"body": "0.99", "score": 6, "replies": []}]}, {"body": "Oh don't worry, I was still checking every 30 seconds. ", "score": 3, "replies": []}]}, {"body": "Congratulations! You passed level one of trading!", "score": 16, "replies": []}, {"body": "If u bought fd Nvidia u woulda quadruple ur profits...", "score": 15, "replies": [{"body": "Hindsight is 20/20.  I was a week too soon on my exp. with FB calls and my calls expired worthless which cost me a shit ton. I'll take my 40% for the week considering most of this account is not used for options trading and is long AAPL, AMZN, NVDA shares, etc. ", "score": 6, "replies": []}]}, {"body": "Nvidia doesn't have the best liquidity, stick with monthlies for your positions (9/21, 10/19, etc).", "score": 6, "replies": []}, {"body": "You learned good son. ", "score": 1, "replies": []}, {"body": "Money is cool and all but don’t you wanna be a fag? ", "score": 1, "replies": []}]}
{"title": "GGs in the chat for those who still haven’t played AMD or were waiting to", "selftext": "[removed]", "id": "9aqsg1", "created_utc": 1535389837.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 12, "comments": [{"body": "made 300% returns on my FD's this morning and sold at open, now they'd be up like 600% lol...\n\n\nwhat a ridiclous run up", "score": 7, "replies": [{"body": "I'm up 1650% on my 8/31 23.5 calls bought on thursday.  Luckiest shit I've ever done and i can't wait to hold too long and get bent over.", "score": 3, "replies": [{"body": "congrats ya lucky mofo", "score": 2, "replies": []}]}, {"body": "Never feel bad about taking profits, my dude.", "score": 1, "replies": []}]}, {"body": "F", "score": 2, "replies": [{"body": "F", "score": 0, "replies": [{"body": "F", "score": 1, "replies": []}]}]}, {"body": "I'm a AMD believer and I just exited my positions for a few 100% gains..Best of luck those still in", "score": 3, "replies": []}, {"body": "I made all the wrong plays with this stock, my $23 calls would be worth over 1600 percent today", "score": 2, "replies": [{"body": "Same 😒", "score": 2, "replies": [{"body": "I was selling weekly CCs on them at a 16.50 CB and lost them at $19/share...", "score": 1, "replies": []}]}]}, {"body": "Amd was giving away free tendies all morning and it tasted great", "score": 1, "replies": []}]}
{"title": "AMD PUT", "selftext": "[removed]", "id": "9aqu3s", "created_utc": 1535390150.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "Yes, as punishment. ", "score": 16, "replies": []}, {"body": "youre trying to pick up pennies in front of a steamroller", "score": 5, "replies": []}, {"body": "Yes you have over a month.  Check your theta", "score": 4, "replies": [{"body": "Hope he held out long enough", "score": 1, "replies": []}]}, {"body": "Never bet against su bae", "score": 3, "replies": []}, {"body": "Yea that earnings run up will be awesome...", "score": 1, "replies": []}, {"body": "Hold. Your theta is pretty high. Multiple +5% daily gains is not sustainable ", "score": 1, "replies": []}, {"body": "How much did you buy it for? There is a good chance you can sell higher strike puts with shorter expirations and completely pay for your position.", "score": 1, "replies": []}]}
{"title": "Long $MSFT DD Inside", "selftext": "[removed]", "id": "9aqy7x", "created_utc": 1535390934.0, "score": 19, "upvote_ratio": 0.8, "num_comments": 18, "comments": [{"body": "0% APR, well shit nigga. They practically paying you. ", "score": 27, "replies": []}, {"body": "thats pretty cool I did it with my iphone and just had the final payment go through. ", "score": 7, "replies": []}, {"body": "accounts receivable bout to sky rocket on that balance sheet\n\n ", "score": 8, "replies": [{"body": "I mean, their AR is already $26B...", "score": 3, "replies": []}]}, {"body": "Hey /u/FearTh3Lord your post is now on the [WSB DD list. Click here to read more DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nIt's important that anything marked DD is useful information for other traders. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD, mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "What happens when people just stop paying? MSFT going to try to ruin your credit on a $500 item lol ", "score": 3, "replies": [{"body": "It’s probably handled by a third party.  I wonder if they pay MS the full value and then another company actually collects monthly.  The other company makes money by buying them at a discount.  And I’m sure the third party has the ability to easily report to the credit agencies ", "score": 9, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "There is only so much damage missing a payment like that will do to your credit. Basically nothing. ", "score": 0, "replies": [{"body": "Can't wait for all these adults trying to get an affordable car loan, but can't get anything lower than 10% APR because they defaulted on a fucking Xbox.", "score": 7, "replies": []}]}]}]}, {"body": "Or is it with Dell also? \"Powered by Dell Preferred Account \" - Why can't they be public again. :(", "score": 1, "replies": []}, {"body": "GO PANTHERS", "score": 1, "replies": []}, {"body": "welcome to the world of subscription based gaming", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "huh", "score": 1, "replies": []}]}]}, {"body": "I disregard all advice coming from FIU...", "score": 0, "replies": [{"body": "Why’s that?", "score": 1, "replies": [{"body": "28% graduation rate after 4yrs. \n\nThe ultimate fallback school...", "score": 2, "replies": [{"body": "Bro, school is what u make of it. I’m learning a shit ton at this school in regards to finance because I’m applying myself. It doesn’t matter what school you goto it’s how you apply yourself. \nEducation vs schooling, there is a difference", "score": 7, "replies": [{"body": "Florida schools are like down syndrome overnight camps. ", "score": 1, "replies": []}]}]}]}]}]}
{"title": "AMD missed 10 bagger thread.", "selftext": "[removed]", "id": "9ar6l7", "created_utc": 1535392485.0, "score": 14, "upvote_ratio": 0.83, "num_comments": 12, "comments": [{"body": "Seems like right now is the best time to buy AMD calls", "score": 10, "replies": [{"body": "YES ALL TIME HIGH IN YEARS! BUY THE TIP", "score": 11, "replies": [{"body": "Honestly all conventional wisdom is out on AMD, I bought 28 calls today, it dropped just now \"of course\" I go.\n\nThen it just shoots back up. I don't get this meme stock.", "score": 6, "replies": [{"body": "Just wait til Jon Tesh announces on his radio show to buy AMD at $42.\n\n", "score": 3, "replies": []}, {"body": "As you can all see, this is proof I am cursed.", "score": 1, "replies": []}, {"body": "It aint a meme stock anymore.  ", "score": 1, "replies": [{"body": "I'm.. not sure you understand what a meme stock is.\n\nThis thing is Chief Meme Stock rn.. the DADDY.. look around you!", "score": 1, "replies": []}]}]}]}]}, {"body": "I sold 22 calls last Wednesday. Missed about bit but was already up 300%. Gains are gains.", "score": 2, "replies": []}, {"body": "Why even sell when the downside was so low? Hold that shit are you afraid of losing out on a couple hundred dollars when there’s 4 months to go? ", "score": 1, "replies": [{"body": "Scalp play. 80% gain in barely a week, I'll take it.\n\nMy mistake was just not buying further out strikes/expiration with the profits and holding that\n\nAnd the fear that it's AMD and it just goes sideways for a while like it has proven most of the past year.", "score": 5, "replies": [{"body": "You made a smart decision. ", "score": 3, "replies": []}, {"body": "Agreed. Smart.  Nothing wrong with taking profits. ", "score": 1, "replies": []}]}]}]}
{"title": "AMD to $100 before MU- DD inside", "selftext": "[removed]", "id": "9ar89h", "created_utc": 1535392794.0, "score": 4, "upvote_ratio": 0.61, "num_comments": 11, "comments": [{"body": "MU makes more than NVDA and AMD combined, though AMD market cap just might surpass MU in the next 2-3 years.  I think NVDA will buy MU before that happens, though.", "score": 10, "replies": [{"body": "Tesla , a 15 year old start up, loses more money than mu and worth more. Check mate rational market theorists ", "score": 12, "replies": [{"body": "I didn’t say I was rational, just putting my $0.02 who I think will buy MU first (if anyone).", "score": 6, "replies": [{"body": "I hope Apple buys mu. They could easily buy mu for 70 and it help their margins a lot since they consume a good amount of dram and nand ", "score": 2, "replies": [{"body": "Why would they buy MU? Gives them no edge. Memory is a commodity.", "score": 1, "replies": [{"body": "Vertical integration and less depence on their frienemry Samsung.  ", "score": 1, "replies": [{"body": "Apple integrates vertically only to provide value to their product. I just don't see them getting into the cutthroat memory business when they can be fucking over their suppliers anyway.\n\nThey will put up with Samsung for the right price. They do so anyway (ex. Qualcomm).\n\nWhy would APPL put up with a cyclical, low margin business?\n\nA couple years back I was talking to an Uber driver in the bay area. He worked for Broadcom. Said that Apple didn't buy Broadcom because Broadcom was happy being Apple's slave and doing whatever they wanted, and that this was cheaper. I take that as Apple's modus operandi (see GT Advanced Technologies).", "score": 1, "replies": []}]}]}]}]}]}, {"body": "But storm clouds", "score": 4, "replies": []}]}, {"body": "I’ll buy in whenever it dips or has a significant pullback for a discount ", "score": 1, "replies": [{"body": "Don’t hold your breathe", "score": 2, "replies": [{"body": "Held it not long actually ", "score": 3, "replies": []}]}]}]}
{"title": "I literally know nothing about stocks. I bought a $30 call on AMD that would expire in a month and a half for 3 dollars because I liked AMD and the worst that would happen was I lost 3 bucks", "selftext": "", "id": "9arbdh", "created_utc": 1535393364.0, "score": 22, "upvote_ratio": 0.75, "num_comments": 13, "comments": [{"body": "Jesus Christ", "score": 25, "replies": []}, {"body": "wait, amd is up?!?!  how did i miss this!", "score": 19, "replies": []}, {"body": "Missed a fine opportunity to risk $100.", "score": 14, "replies": []}, {"body": "this guy who cant even tell the difference between a 2 and a 3", "score": 13, "replies": [{"body": "apparently this is how you make money. op confirmed it. ", "score": 2, "replies": [{"body": "Honestly the less you know the better", "score": 3, "replies": []}]}]}, {"body": "4400% \nHoly \nMother\nOf\nFuck", "score": 9, "replies": [{"body": "Some times u win the lotto with scratch offs but also a good lesson in why selling naked calls is a terrible idea", "score": 2, "replies": []}]}, {"body": "wow look at all the gains you missed out on! Lesson learned: always go all-in.", "score": 3, "replies": []}, {"body": "Way to Jynx everything", "score": 2, "replies": []}, {"body": "EZ", "score": 1, "replies": []}, {"body": "Imagine if you weren't poor", "score": 1, "replies": []}, {"body": "When people like this start investing into what you invested into... it's time to leave.  Pack it up for awhile boys. ", "score": 1, "replies": []}]}
{"title": "Shorted AMD at its peak today and have already been handsomely rewarded. I suggest you do the same.", "selftext": "", "id": "9areb0", "created_utc": 1535393936.0, "score": 0, "upvote_ratio": 0.2, "num_comments": 17, "comments": [{"body": "In what world is $14 a handsome reward ", "score": 26, "replies": [{"body": "Giving toothless blowjobs in a dark alley in detroit.", "score": 8, "replies": []}, {"body": "lol", "score": 3, "replies": []}, {"body": "7% over an hour is pretty nice for any security", "score": 1, "replies": []}, {"body": "Imagine he got 7.82% a day, every single day...", "score": 1, "replies": []}, {"body": "It is now $63\nEdit: Closed out for a cool $$$126", "score": 0, "replies": [{"body": "You are choosing a dvd for tonight", "score": 4, "replies": []}, {"body": "Wow don't spend it all in one place ", "score": 5, "replies": []}, {"body": "You should have listened instead of throwing stones. Now you will be tendiless from your high horse. Let he who is without tenders throw the first stone.", "score": -6, "replies": [{"body": "I'm still up 1,500% since this AMD train started, so you can have your 63$", "score": 3, "replies": []}, {"body": "I'd just hate to be the one that thinks $63 is worthy of calling tendies ", "score": 0, "replies": [{"body": "Money is money. Get it where you can", "score": 1, "replies": []}]}]}]}]}, {"body": "You bum ", "score": 3, "replies": []}, {"body": "I bought a cheap otm put a few weeks out. It's been bizarre watching it act like a call all day", "score": 2, "replies": []}, {"body": "Too much handsome", "score": 1, "replies": []}, {"body": "Time to buy puts on AMD", "score": 1, "replies": []}, {"body": "That was a call buying opportunity not put, you neanderthal. ", "score": 1, "replies": []}]}
{"title": "AMD PUTS WHEN???", "selftext": "[removed]", "id": "9arfiv", "created_utc": 1535394174.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 11, "comments": [{"body": "You're already too late.", "score": 5, "replies": []}, {"body": "Now, you first.", "score": 1, "replies": []}, {"body": "About 20 minutes ago and selling now.", "score": 1, "replies": [{"body": "Don't know about selling now, everytime the rsi was this high, it was followed with a 10-20% correction. ", "score": 2, "replies": [{"body": "Still would have been a good flash crash trade. Maybe wait for the bounce and get in on more puts after. I'm just bagholding some 22.5 and 23.5 puts expiring early Sept. I hope we seem major pullback over the next week.", "score": 1, "replies": []}]}]}, {"body": "20 mins ago woulda been good.", "score": 1, "replies": []}, {"body": "Meant to sell 20 contracts, instead bought 20... fucking RIP", "score": 1, "replies": []}, {"body": "> what goes up must come down.\n\nLet me know when you mastered the timing. ", "score": 1, "replies": []}, {"body": "25 mins ago ", "score": 1, "replies": []}, {"body": "Buy puts on Amazon.", "score": -2, "replies": [{"body": "Exactly this.  Watch where the money flows are going.  It aint $AMZN right now.  ", "score": 1, "replies": []}]}]}
{"title": "AMD Puts anyone? This has gotta be my way to tendies", "selftext": "[removed]", "id": "9argge", "created_utc": 1535394350.0, "score": 0, "upvote_ratio": 0.2, "num_comments": 11, "comments": [{"body": "F", "score": 3, "replies": [{"body": "A", "score": 3, "replies": [{"body": "G", "score": 3, "replies": []}, {"body": "P", "score": -1, "replies": []}]}]}, {"body": "Suebae will smack your tendies to the floor.", "score": 2, "replies": [{"body": "She already did, a whole 11 dollars to the floor", "score": 2, "replies": []}]}, {"body": "No tendies for the unfaithful ", "score": 1, "replies": []}, {"body": "Have u not learned ", "score": 1, "replies": []}, {"body": "LOL good luck buddy", "score": 1, "replies": []}, {"body": "Wow a whole 1 put.\n\nFag", "score": 1, "replies": []}, {"body": "Right here with you bro https://imgur.com/a/LjAmqRf", "score": 1, "replies": []}]}
{"title": "20 y/o college AMD tendies", "selftext": "", "id": "9arjqk", "created_utc": 1535395056.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 10, "comments": [{"body": "Jinxed yourself", "score": 3, "replies": [{"body": "I sold before the drop", "score": -1, "replies": [{"body": "Sure you did.", "score": 12, "replies": []}, {"body": "Screenshot history", "score": 1, "replies": [{"body": "Screenshory.\n\n***\n\n^(Bleep-bloop, I'm a bot. This )^[portmanteau](https://en.wikipedia.org/wiki/Portmanteau) ^( was created from the phrase 'Screenshot history'. To learn more about me, check out this )^[FAQ](https://www.reddit.com/78ilq0).", "score": 2, "replies": []}]}]}]}, {"body": "Where is the updated photo?", "score": 2, "replies": []}, {"body": "Nice, you can pay for one class now!", "score": 2, "replies": []}, {"body": "Reads like a porn title.", "score": 1, "replies": []}, {"body": "...aaaand it's gone", "score": 1, "replies": []}, {"body": "No one cares how old you are. What would be more impressive is if you told us how much cocks you suck.", "score": 1, "replies": []}]}
{"title": "Its over. $AMD is the Hottest Stock on the Planet. Su Bae take us to the MOON!", "selftext": "", "id": "9arnct", "created_utc": 1535395772.0, "score": 50, "upvote_ratio": 0.92, "num_comments": 13, "comments": [{"body": "You just got a call discount take advantage of it.", "score": 16, "replies": [{"body": "Near 2000 week highs - says it's a discount... Hmm", "score": 12, "replies": []}]}, {"body": "But its going down.", "score": 9, "replies": [{"body": "Need I remind you of NVDA’s pull back. Went from 260 to 244 now it is at 277. This hog is going to the moon, just be patient. ", "score": 20, "replies": [{"body": "$PATIENCE 8/31 26.50 AMD call. And 8/31 52.50MU call. Someone get out and push it back up", "score": 5, "replies": []}, {"body": "You should probably compare the EPS of AMD vs. NVDA", "score": 1, "replies": []}]}, {"body": "Goes down every afternoon. Starts again in the morning. Rinse. Lather. Repeat. ", "score": 18, "replies": [{"body": "I hope your right I was up $1k before the dip now I’m only up $500. First world problems am I right ", "score": 18, "replies": [{"body": "Me too. Down 300 for the day so far cuz i didn’t cash out", "score": 1, "replies": [{"body": "I went from up 12k to flat in 30 minutes. ", "score": 8, "replies": []}]}]}, {"body": "It didn't Thursday or Friday ", "score": 1, "replies": [{"body": "Let’s hope that it repeats then", "score": 1, "replies": []}]}]}]}, {"body": "Full circle", "score": 0, "replies": []}]}
{"title": "1100 in 11 minutes from today's delicacy Aye M D", "selftext": "[deleted]", "id": "9arnig", "created_utc": 1535395803.0, "score": 24, "upvote_ratio": 0.9, "num_comments": 9, "comments": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Did you notice an IV crush with your puts?\n\nI bought some $27 puts when it hit $27... It dropped but the price for the puts didn't increase at first, IV started to drop....I sold today for profit, but was annoyed....\n\n\nThey didn't seem overpriced when I bought...\n\n(Ie: bought for $2 at $27, stock at $26.73, put at $2.03) Delta was 0.5... Sold at SP $25.5 for option price at $2.5.... Should have been $2.75ish", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": ":(", "score": 2, "replies": []}]}]}]}, {"body": "Wtf is that fucking drop lmao. ", "score": 9, "replies": []}, {"body": "WSB, making cash money, can't add or subtract (it was 9 minutes not 11) ", "score": 4, "replies": [{"body": "lolllll bro thats like 122 tendies a minute then. ", "score": 6, "replies": [{"body": "That's a great tendies per minute ratio. ", "score": 4, "replies": []}]}]}, {"body": "did similar with 60 contracts of Aug 31 $27P, made just over $2500 today on that drop...", "score": 2, "replies": []}, {"body": "I only bought like $600 in puts today. Gonna hold overnight for max degeneracy. ", "score": 2, "replies": []}, {"body": "This is ballsy a'f. ", "score": 1, "replies": []}]}
{"title": "When AMD is down 600 .01%s from it's day high", "selftext": "", "id": "9as130", "created_utc": 1535398471.0, "score": 105, "upvote_ratio": 0.87, "num_comments": 17, "comments": [{"body": "DONT FIRE UNTIL YOU SEE THE WHITES OF THEIR EYES. HOLD THE LINE BOIS", "score": 29, "replies": [{"body": "HOOOOOOOOOOOOOOOOLDDDDDDDDDDDDD", "score": 12, "replies": []}]}, {"body": "WE GOING TO THE MUUUUUN TOMORROW!\n\nI hope it does because instead of selling 30 contracts and taking my 300% I bought 30 and took an L. ", "score": 18, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "I did the same. I was sitting up nearly 60% of my portfolio, went to sell, couldn't because of day trade locks.\n\nIf it goes up tomorrow, great, if not, selling pretty damn fast.", "score": 2, "replies": []}, {"body": "My.exact case\nhttps://imgur.com/a/FRgrbcz\n", "score": 2, "replies": [{"body": "I wonder how many people are waiting until tomorrow to cash out because they burned all of their day trades? ", "score": 1, "replies": []}]}]}, {"body": "Lost 65 percent as soon as I got in im praying", "score": 3, "replies": [{"body": "I bought $27 puts at $27 and was passed that, somehow, IV crush fucked my gains. Down $0.25, my put only increased by $0.03...\n\nSold though for 25% gain, still annoyed", "score": -1, "replies": [{"body": ">  somehow, IV crush fucked my gains.\n\nBut IV isn't down ???", "score": 1, "replies": [{"body": "It was super high when I bought and dipped after, option iv", "score": 1, "replies": [{"body": "Swinging up and then down wildly does not cause IV crush.", "score": 0, "replies": [{"body": "No shit...\n\nI'm talking about what I saw at the time in terms of trading options... It didn't make any sense and I was looking for explanations", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I sold so I hope it tanks for a couple days so I can rebuy Jan calls then it moons.", "score": 1, "replies": []}]}, {"body": "Quick everybody here please buy puts", "score": 4, "replies": []}, {"body": "This is the end bois, it was an honor to rush into the battle with you", "score": 1, "replies": []}, {"body": "64 =/= 600, does not check out.", "score": -1, "replies": [{"body": "Look man I don't have all day to copy/paste. I have very important stonk trades to make.", "score": 3, "replies": []}]}]}
{"title": "AMD 25$ FDs and 9/21s tendies fully cooked", "selftext": "", "id": "9ase7w", "created_utc": 1535401046.0, "score": 85, "upvote_ratio": 0.93, "num_comments": 17, "comments": [{"body": "Very cool fag. Thank you!\n\nNow sacrifice it to the MU gods", "score": 40, "replies": [{"body": "MU demands a sacrifice.  MU red tomorrow.", "score": 5, "replies": []}]}, {"body": "I hope you didn't get caught up in $AMD $30, if so may god have mercy on your soul.\n\nbtw your hearts are super gay, I love them.\n\nand finally, charge your phone fag.", "score": 11, "replies": []}, {"body": "Sold 50 $25 FDs and 25 $25 9/21. Holding TWTR 35 calls and MSFT $110 calls both 10/19", "score": 12, "replies": [{"body": "Too late to get in on TWTR. ?", "score": 1, "replies": []}, {"body": "Proof or fag. I want to see that -60% drop.", "score": -5, "replies": [{"body": "https://imgur.com/a/mfiiezY", "score": 9, "replies": []}]}]}, {"body": "Why can’t I do this?? I bought puts ", "score": 5, "replies": [{"body": "Ride the wave or stay the fk away", "score": 3, "replies": []}]}, {"body": "Charge your phone nigga, damn ", "score": 9, "replies": [{"body": "Glad I'm not the only one who freaked out when they saw that.", "score": 1, "replies": []}]}, {"body": "Hey /u/NonspeakingAsteroid your post is now on the [YOLO list](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3AYOLO). \n\nIt's important that anything marked YOLO be a relatively large and already placed bet. If you misused the flair please change it, mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "wait is there a tweak from cydia that turns my robinhood green??", "score": 3, "replies": []}, {"body": "Don’t forget to leave $$ for Taxes. Because nobody here remembers to pay taxes...", "score": -3, "replies": [{"body": "Nobody here understands how taxes works. There's literally no reason to save this money for taxes unless you're a professional who files his taxes on these trades quarterly.", "score": 6, "replies": [{"body": "Yeah there’s plenty of time to lose this ", "score": 7, "replies": []}]}]}]}
{"title": "Need advice, bought 2 $1910 8/31 Puts on $AMZN, got destroyed today...", "selftext": "[removed]", "id": "9asi2v", "created_utc": 1535401833.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "Hold and pray for Donny to tweet “ww3” ", "score": 10, "replies": [{"body": "Old Crazy Thumbs", "score": 1, "replies": []}]}, {"body": "Why are you trying to fight Jeff Bezos?", "score": 9, "replies": []}, {"body": "sell dude don't ever bet against amazon", "score": 5, "replies": []}, {"body": "The McCain death rally isn’t done amzns going to 1950", "score": 2, "replies": []}, {"body": "How much did the option cost", "score": 1, "replies": []}, {"body": "maybe you can trade it for one of these\n\nhttps://i.imgur.com/uTDDZyC.jpg", "score": 1, "replies": []}, {"body": "I recommend not doing this. And if you're going to, then I recommend doing a call spread. If the price _does_ go down, then you can buy back the short leg of the spread for less than you sold it for, and hope for recovery on the long leg. Otherwise, if the stock goes up like it did today, then you can just take your profit and move on. ", "score": 1, "replies": []}, {"body": "never bet against uncle jeff", "score": 1, "replies": []}, {"body": "In what world is amazon dying", "score": 1, "replies": []}, {"body": "Yeah might wanna cut your losses", "score": 1, "replies": []}]}
{"title": "How do we feel about Salesforce $CRM earnings on Wednesday?", "selftext": "", "id": "9askuh", "created_utc": 1535402377.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 13, "comments": [{"body": "I sold the rest of my $150 calls today when it was stuck in that range", "score": 3, "replies": [{"body": "Nice.  Me too.\n\nI sold my Jan19s today too for a 50% gain.  I told myself I'd sell on first sign of weakness and I did.  I didn't want to even mess with earnings since I had a good run up profit.  Good chance, I'm an idiot, but oh well", "score": 3, "replies": [{"body": "It's hard to take small but decent profits when you see the returns of the AMD callboys", "score": 2, "replies": []}]}]}, {"body": "I bought a call because of the drop this morning. If it goes up tomorrow and I can get a 10% profit, I might bitch out and sell it.", "score": 3, "replies": [{"body": "If it's red tomorrow I'mma buy a contract or 2. We'll see. Nothing big tho", "score": 2, "replies": []}, {"body": "That’s not being a bitch. Being a bitch is not taking a position. (Like me.)\n\nTake pride in the fact you put in a position and have a plan.", "score": 1, "replies": []}]}, {"body": "Might just stick to msft that drop from open was odd trading near 156 and it goes to like low 151 all day ", "score": 2, "replies": [{"body": "156 was pre market. It closed 62 cents down, or .4%. ", "score": 2, "replies": []}]}, {"body": "No one cares about earnings this week cuz of AMD haha", "score": 1, "replies": []}, {"body": "It would beat and give good guidance but stock is  at ATH. Risk reward on this is not worth the play. ", "score": -1, "replies": [{"body": "CRM has basically always been at an ATH.\n\nThe market reaches a new ATH on average every 15 days. \n\nAmazon was at a $1200 ATH at the beginning of the year, now it's at a new ATH of 1920. ", "score": 6, "replies": [{"body": "That's actually a crazy stat haha", "score": 1, "replies": []}]}]}]}
{"title": "Pretty happy about my $50 AMD bet", "selftext": "[removed]", "id": "9at4si", "created_utc": 1535406495.0, "score": 12, "upvote_ratio": 0.75, "num_comments": 10, "comments": [{"body": "P O S I T I O N S  D A D D Y", "score": 9, "replies": [{"body": "Got it give me a second: https://imgur.com/a/7ceYs94", "score": 3, "replies": [{"body": "Only going 1/2 throttle on round #2 with Sue I see. Prob a smart move", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Thanks! Honestly I just got really lucky ", "score": 3, "replies": []}]}, {"body": "This requires an explanation.\n\nAlso well done asshole.", "score": 1, "replies": []}]}]}, {"body": "Thank Bae. She good girl.", "score": 3, "replies": []}, {"body": "Let's see the position", "score": 3, "replies": []}, {"body": "Dang yo", "score": 2, "replies": []}]}
{"title": "I'm bullish on AMD but come on man. I'm not going to give up an opportunity for a free $3, but I still fell slightly bad.", "selftext": "", "id": "9atyq2", "created_utc": 1535413165.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 17, "comments": [{"body": "You're not a bright one, are you?  That's alright, we welcome your type on this sub", "score": 9, "replies": [{"body": "The only thing I can imagine is that you believe I should have lowered the strike and collected more premium... But money is money and if this shoots up to $34.99 on Friday I'll still have my shares and the other guy's $3.", "score": 2, "replies": [{"body": "If you are happy selling your 💯 shares at 35. Then perfect fam.  ", "score": 2, "replies": [{"body": "58% return in just over 2 weeks? Yeah I'm happy with that.", "score": 4, "replies": []}]}]}]}, {"body": "You could've panhandled $3 in the time it took for that to fill", "score": 8, "replies": [{"body": "Took about a second. There were over 30 asks at $0.03. I'm just hoping it was people closing out their spreads.", "score": 0, "replies": [{"body": "How much time did it take you to make this decision, do the proper reading, etc?  If it's more than 3/min wage minutes, you're wasting your life force on this game.", "score": 2, "replies": [{"body": "I did this on the shitter at work. Took me less than a minute to make the decision. AMD is not reaching $35 by Friday. Selling way OTM FD covered calls won't make me rich but money is money. ", "score": 1, "replies": [{"body": "If you believe this statement, why not sell 100 of them and do it partially naked and make some actual money?", "score": 3, "replies": []}]}]}]}]}, {"body": "RemindMe! 4 days.  ", "score": 2, "replies": []}, {"body": "Covered?", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "RH allows selling naked options so long as you have the required equity should you get called.", "score": 1, "replies": []}]}]}, {"body": "9/14 - 35 calls here ", "score": 1, "replies": []}, {"body": "Funding secured?", "score": 1, "replies": []}, {"body": "I bought that for $.05 two hours early. Then sold it for $.10 45 minutes later. Should have bought more than 20. **SHRUG**", "score": 1, "replies": []}]}
{"title": "I've been a lurker for 2 years now and I gotta say, I never understood how the WSB community talked so much shit about MU and AMD fans when both have killed it the last 24 months", "selftext": "", "id": "9au2r0", "created_utc": 1535414151.0, "score": 18, "upvote_ratio": 0.78, "num_comments": 15, "comments": [{"body": "Because most are buying OTM calls expiring in a week, or they buy ATM or ITM expiring a few months out and the stocks go into a month long down trend.  Simply put making plays that are either degenerate or poorly timed and losing plenty of money in the process.", "score": 35, "replies": [{"body": "Shhhhhh...", "score": 6, "replies": []}, {"body": ">\t buy ATM or ITM expiring a few months out and the stocks go into a month long down trend.\n\nThis is exactly what’s happening to me. I bought 3 month call contracts figuring there would be a run up or ER bounce. Its Wall Street **Bets**. I’m here to take a position  I only mitigate risk with long calls.\n\nBut, I’m interested in hearing your strategy. Some type of safe but boring iron condor / iron butterfly?", "score": 1, "replies": [{"body": "Those aren't boring at all. You're not gonna get a 10 bagger, but max profit on neutral plays can still well over 50%+ in a short time frame if you set it up correctly. It's not like you're buying SPY, that shit has plenty of action to sate your gambling addiction ", "score": 2, "replies": []}]}]}, {"body": "Personally I find it inspiring how someone can believe in 7/20 90 MU calls,a testament to how strong their conviction on things are", "score": 10, "replies": [{"body": "Our indoctrination is so good that our n00bs love MU more than North Koreans pretend to love Kim Jung-un", "score": 9, "replies": [{"body": "Papa Sanjay has sniper rifle trained on all of us, just like the NKs", "score": 1, "replies": []}]}]}, {"body": "WSB has some great picks but usually horrible timing", "score": 14, "replies": [{"body": "My thoughts exactly. Every WSB pick seems to plummet on the hype but moon when everyone starts bitching", "score": 1, "replies": []}]}, {"body": "Shut the fuck up Donnie! You’re out of your element!", "score": 8, "replies": []}, {"body": "You know who else killed it in the last 24 months? The whole market. Also, even if people are right it’s still dumb to yolo ones life savings on FDs. That’s just my opinion. The smart one is that guy who made a fortune on chegg calls and then decided that enough is enough. The rest of us will go up up up and burn and crash. ", "score": 3, "replies": []}, {"body": "Autism only functions on smaller timeframes", "score": 1, "replies": []}, {"body": "How DARE you compare that Micron garbage to the glorious Su Bae. Micron went from 30 to 65 and is headed back to 30 now. AMD went from 2 to 25 and hasn't dropped at all. They are not comparable", "score": -5, "replies": [{"body": "AMD dropped to $9 before earnings, then launched to the moon. MU is about to take off!", "score": 4, "replies": []}, {"body": "Lol, they are both still great picks in my opinion yet most on here used to talk about them ironically. Like they were picks for the dumb noobs. ", "score": 1, "replies": []}]}]}
