{"title": "Apple, Amazon, Tesla top list of millennial stock holdings in new survey", "selftext": "https://finance.yahoo.com/news/apple-amazon-tesla-millennial-stock-holdings-200721963.html\n\nMillennials are betting big on Big Tech. Apex Clearing’s latest Millennial 100 stock pulse report found that Apple (AAPL), Amazon (AMZN), Tesla (TSLA), and Facebook (FB) were the stocks most held by millennial investors. Berkshire Hathaway (BRKB) rounded out the Top 5.\n\nMillennials, typically defined as the generation born between 1981 to 1996, are continuing to shift trends by “investing what they believe in,” Apex CEO Bill Capuzzi told YFI AM on Thursday. “They're investing what they know.”\n\nWhile many companies favored by millennials went public this year, including Uber (UBER), Lyft (LYFT), and Pinterest (PINS), Capuzzi said one has risen up the list more quickly than most: Beyond Meat (BYND).", "id": "dpx4ir", "created_utc": 1572570027.0, "score": 266, "upvote_ratio": 0.96, "num_comments": 69, "comments": [{"body": "$BECKY index ftw", "score": 68, "replies": [{"body": "$sbux better be on there too", "score": 7, "replies": []}]}, {"body": "No MSFT? weird", "score": 21, "replies": [{"body": "None of the millennials have jobs that use Excel yet", "score": 7, "replies": [{"body": "What? Millennials are in their 30s. Most people in my office of a large company are millennials. It’s the age group below millennials that us actual millennials have to help teach basic office software to.", "score": 30, "replies": [{"body": "Ah.. so it's the anger against $MSFT not the age", "score": 9, "replies": [{"body": "I think it’s just that millennials like to take higher risks for higher rewards. TSLA for instance is the highest risk high reward stock on the list. People think it will go bankrupt while others thing it’s will grow tenfold.", "score": 3, "replies": [{"body": ">People think it will go bankrupt while others thing it’s will grow tenfold.\n\nThink it's more about there are people that use logic based on decades of background and math versus people that get a funny little feeling in their stomach about it, so it must be worth it to go all in.", "score": 4, "replies": [{"body": "I think it’s more of a comparison of financial charts versus people who have a vision of where it can go technologically.\n\nEarly amazon days were quite similar. Everyone thought amazon was going to fail because looking at the finances alone made it seem like it would, while others had an understanding of the direction the world was headed.", "score": 3, "replies": []}]}]}, {"body": "Yes, because if it's not the inability to use Excel, it's anger at the company that distributes Excel.\n\nYou reason like a boomer", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 95, "replies": [{"body": "Wsb is a millennial heavy subreddit so it would make sense for their chicken tendies to match up with most millennial investors’", "score": 10, "replies": [{"body": "The entirety of Reddit is millennial heavy. Most users are probably under 30.", "score": 2, "replies": [{"body": "Half of millenials are over 30. Possibly half of reddit as well but I think it's been a while since their last census.", "score": 1, "replies": []}]}]}, {"body": "Bynd is a major millenial stock because people like to buy into ipos with no info on the companies besides their products and the fact they were \"rising in value\" aka buying on the high", "score": 3, "replies": [{"body": "I feel personally attacked.", "score": 2, "replies": []}]}, {"body": "Guh", "score": 3, "replies": []}]}, {"body": "If you're basing your buying off millennial holdings instead of hedge funds and institutions, you may need to reevaluate your strategy.", "score": 54, "replies": [{"body": "Your biggest assumption is that hedge funds and institutions know what they are doing.", "score": 65, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Hey, hey, whoa, heyyy, come on now. I'm making EDUCATED guesses, okay?", "score": 7, "replies": []}]}, {"body": "How many of these hedge fund bought above companies before they were worth $100B?  At the same time how many are buying tesla which is currently below $100B?", "score": -4, "replies": [{"body": "Is the answer: 4?", "score": 16, "replies": []}]}, {"body": "What makes you think millennials know what they are doing? Seems to me they aren't with Apple and Tesla being in their top stock picks.", "score": -6, "replies": [{"body": "What's the problem with Apple?", "score": 6, "replies": [{"body": ">What's the problem with Apple?\n\nI am reasonably sure right now its one of the best performing stocks in the SP500.", "score": 5, "replies": []}, {"body": "They reach bit of a celling in terms of creating any considerable amount of growth.  iPhones aren't gaining any more share to speak off.  Mac sales have largely remained the same.  iTune market share also remained the same.  There's a reason why they are turning to a subscription model for the iPhones.", "score": -7, "replies": [{"body": "Services", "score": 13, "replies": [{"body": "What about it?", "score": -4, "replies": [{"body": "$$$", "score": 10, "replies": [{"body": "Be a big boy and use your words.", "score": -4, "replies": [{"body": "He did an awful job here explaining himself but services are definitely where Apple sees their future growth coming from with growth from iPhones slowing down. It’s their fastest growing department and has incredible margins. They understand people are buying/upgrading their phones less and less, instead opting to hold onto models longer. They also realize they can only penetrate so much of the market and that if you don’t own an iPhone now, you’re probably not going to be a major focus for them.\n\nServices are things like apps, games, payments, money made from partnerships/companies using Apple’s platform, their music platform, iCloud, and eventually their video services. It makes up about 20% of their revenue stream and has roughly doubled from 6 billion a quarter to 12 billion this most recent quarter from where it was just 3 years ago. It’s a high margin field and I think Apple understands goods and manufacturing is a tricky and often volatile field to be in which is why they’re shifting focus towards services. They have the giant user base and Apple ecosystem, now they want to offer services to every Apple user.\n\nPeople knock Apple saying they’re no longer innovative, growth is slowing with phones, and that the new phone models don’t warrant the expensive price tags and don’t offer enough improvement. Yet quarter after quarter we see people buying phones, using their services, wearing their products, and paying a premium to own their products. Services offer 64% margins compared to about 32% for the phones and other hardware so the money and potential is definitely there. They can live with people buying phones less often as long as people stick within the ecosystem, which has been thus far. Even if you’re not buying or using apps, Apple still makes money off users from other companies paying them to be included in their ecosystem. Wearables are also doing decent as well. Things like their watches and AirPods have done solid. I think wearables made up around 10% of their revenue in the most recent quarter. While perhaps not as invasive as other tech companies, Apple also sits on loads and loads of consumer data and information as well.", "score": 10, "replies": [{"body": "The thing with their services is unless they get more people in their ecosystem they aren't going to increase their growth any noticeable amount least where it will really boost the stock.  Yes they have growth but I am talking big growth here, like when the iPhone took off sort of growth and people had to have it.  The thing now is everyone that has an iPhone has one.  Yes people buy the new iPhone but its to replace their 2+ year old iPhone.  Sure they get some people coming from Android but there hasn't been any real growth of people in their ecosystem.  Sure they can try to increase sales from their app store but that is largely dependent on devs and I believe there is a pending antitrust case against them even in how they are managing their app store.  If they lose that case its going to hurt their profits noticeably.", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "If you know what stocks people buy you can buy them and ride the hype wave.", "score": -1, "replies": [{"body": "If you want it to sound more sophisticated than that then call it \"Momentum Investing.\"", "score": 2, "replies": []}, {"body": "Because that's totally not a bad idea.  Unless a stock is truly hot in the stock market no hype train is going to push the stock up at all.", "score": -1, "replies": []}]}]}]}, {"body": "Wait until these hedge funds start buying Uber. It just a beginning of Uber with too many expectations.", "score": 2, "replies": []}, {"body": "Go woke, go broke.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hedge funds are like candy on halloween. They're everywhere until the market collapses. Buy now!", "score": 9, "replies": []}, {"body": "Unless you’re an [accredited investor](https://www.sec.gov/fast-answers/answers-accredhtm.html)  you can’t invest in a hedge fund. \n\nAlso most hedge funds don’t invest money for people, their large clients tend to be institutions.", "score": 3, "replies": []}, {"body": "Hedge fund is like one guy or a group of guys taking investor's money and investing in the stock market in a combination of stocks, bongs, option contracts, swaps, etc. They make money by taking a small cut off the investors money. Hedge funds are closed to regular shmoes like us. It's for the big guys.", "score": 2, "replies": [{"body": "> Hedge fund is like one guy or a group of guys taking investor's money and investing in the stock market in a combination of stocks, **bongs**, option contracts, swaps, etc.\n\nWhile some do, cocaine is much more rampant :)", "score": 9, "replies": []}, {"body": "Don’t forget the collusion.  You cant have hedge funds without collusion", "score": 0, "replies": []}]}, {"body": "Since no one gave you a serious answer, the only people allowed to invest in hedge funds are \"accredited investors\" with a lot of wealth or income. Because these people already have a ton of money, the SEC doesn't care about protecting them as much as you and me, so hedge funds are essentially unregulated. For that reason they're able to invest in virtually anything they want to. Stocks, bonds, commodities, real estate, private companies, derivatives, etc. Hedge funds often times use a ton of leverage to magnify gains/losses. If you want an incredible story about a hedge fund look up Long Term Capital Managrment in the 1990s.", "score": 1, "replies": []}]}, {"body": "How do you track what hedge funds and institutions are doing? I know how to track what they're saying pretty well, but not what they're buying or selling.", "score": 1, "replies": [{"body": "There is a great twitter account: @Hedgemind", "score": 1, "replies": [{"body": "This is great, thank you!", "score": 1, "replies": []}]}]}, {"body": "Yeah prolly time to short", "score": 1, "replies": []}, {"body": "if you're basing your buying solely off anyone else then you do need to reevaluate your strategy", "score": 1, "replies": []}]}, {"body": "Buy chainlink you fucking normies :^)))))", "score": 3, "replies": []}, {"body": "One of these is a trillion dollar company.  But only one other is a fee orders of magnitude below being a trillion dollar company.", "score": 5, "replies": [{"body": "Elon is shit posting on twitter, smoking weed, hanging with PewDiePie, and banging Grimes so he can suck on that sweet millennial nectar", "score": 1, "replies": [{"body": "Just today he said he’s getting off Twitter and he’s no longer banging Grimes! Puts on TSLA?", "score": 1, "replies": []}, {"body": "Being the CEO of two of the companies Millennials think are the coolest (Tesla & SpaceX) does wonders for making a lot of people love you, and makes them willing to ignore your flaws.", "score": 1, "replies": []}]}]}, {"body": "They are gonna learn what happens to growth stocks during any slowdown", "score": 2, "replies": [{"body": "I wouldn't really consider AAPL or BRK growth stocks.", "score": 2, "replies": [{"body": "Apple credit card, and Apple TV would say that they are focused on growing and expanding their business.\nI would say the reason it doesn’t feel like a growth stock is because they’ve had enormous amounts of cash that they haven’t blown thru like many other “growth” businesses might have.", "score": 1, "replies": []}]}, {"body": "Not all stocks are effected the same way in a recession.", "score": 1, "replies": []}]}, {"body": "Looks like I’m the typical millennial investor. I’ve held all these stocks at one point, and still own 2 of the 5. Solid stocks, smart generation!", "score": 2, "replies": [{"body": "Haha same. These are literally my top three holdings.", "score": 1, "replies": []}]}, {"body": "> Millennials are moving away from the S&P 500. While the tech sector is overweighted in millennial investments, other sectors like oil and gas show minimal investment, **and none of the accounts analyzed were invested in utilities.**\n\n... Yeah... I question the sample group they're using, it's almost certainly not big enough if **zero** Millennials  they looked at are investing in any utility companies. I can name several Millennial investment Youtubers who are invested in utility companies.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "quit bragging, richy rich!", "score": 6, "replies": []}, {"body": "Not amazing, we’re talking about AMAZON**", "score": 3, "replies": []}]}, {"body": "Most millennials are in their 30s.", "score": 5, "replies": []}, {"body": "Because they have more than $2,000 to invest.", "score": 2, "replies": []}, {"body": "Partial shares", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "If you can't afford a full one. If you think the company is going to do well and want to get in. If 1 share goes up 10%, and you own half a share, you'll still see a 5% increase. So the return on your investment is still worth it.", "score": -6, "replies": [{"body": "You'll see a 10% increase no matter how many shares or partial shares you own.\n\nIf the stock price is $10 and goes to $11 and you invested $5. That $5 will go to $5.50, which is still a 10% increase.", "score": 6, "replies": [{"body": "Damn you're right, percent stays the same, amount changes.", "score": 1, "replies": []}]}]}]}]}]}]}
