{"title": "Long PTON (BYND part deux)", "selftext": "Disclaimer: I am not making a recommendation to do anything. I am just writing about a potential short squeeze I see in the market and how I am currently positioned to take advantage IF that unlikely squeeze ever occurs. Do NOT follow me in this trade. I am not an analyst and I have no clue what I am doing. \n\nI recently bought Jan $35 calls in Peloton. To me, it has many of the same SHARE fundamentals that BYND had after this IPO. (Obviously not business similarities)\n\n1. Relatively low float compared to shares outstanding (40m share float vs 280m total shares locked up until March.\n\n2. Passionate user base that hypes the everloving shit out of the product and preaches how no other competitor is the same as them\n\n3. Due to point 2, a “dumb money” retail base of investors that buy the stock because they like the product, ignoring valuations\n\n4. On trend (subscription based, healthy, the “new” it product, etc)\n\n5. Insanely overvalued- this is actually a positive because it has led to point 6\n\n6. CRAZY high short interest as a percentage of the float. As of this morning it was 84%. Every “smart money” investor and trader is looking at this and saying “this POS is a fad and totally overvalued. I’m going to short it!” Just like BYND was at $80 when I first bought calls. It definitely WILL crash and burn and come back to earth at some point- but not before wiping out the shorts and causing a squeeze to a valuation deemed “ludicrous” \n\nI bought my calls on Monday for between $0.35-$1.00 I believe. \n\nI definitely might be wrong. In case there is someone out there that is willing to risk eating a box like last time, let me know soon!", "id": "dz4a13", "created_utc": 1574266839.0, "score": 38, "upvote_ratio": 0.91, "num_comments": 70, "comments": [{"body": "> I bought my calls on Monday for between $0.35-$1.00 I believe. \n\nI'm all in because you don't even know your entry price. My man's must be confident.", "score": 68, "replies": [{"body": "Or I bought enough calls that I have multiple prices paid 🌝 but you’re getting the right 💭\n\nEdit: some call writers were willing to take the risk at $0.35, others at $1.00. but all of them could turn out to be a bunch of 🤡", "score": 18, "replies": [{"body": "Clowns are part of theta gang?", "score": 9, "replies": []}]}]}, {"body": "The legend himself has spoken - all in on $PTON. Rent money, drug money, child support payment money. \n\nALL OF IT", "score": 23, "replies": [{"body": "Is that child support money or just child payment money? Like that old guy in Game of Thrones who hired a bunch of kids to spy on and eventually shiv his rivals?", "score": 4, "replies": [{"body": "Definitely just like the old guy in game of thrones that pays kids.....\n\nThat’s all I’m going to say.", "score": 4, "replies": [{"body": "Yeah shit worked out well for him right?\n\nAll.\n\nIn.", "score": 3, "replies": []}]}]}]}, {"body": "You’re missing the most important element- fomo.\n\nRetail investors are generally idiot sheep that just follow the crowd. My dad is my favorite gage for retail.\n\nI told him about how stupid BYND was and he said “well investors have made millions and it’s on a tare it obviously has some kind of mojo”.\n\nCompare that to “planteron” and he says it’s a disaster.\n\nIMO retail sees green chart they buy, retail sees red chart they don’t. Smart money doesn’t buy hardware pretending to be subscription services.", "score": 9, "replies": [{"body": "> it’s on a tare\n\nsounds like he carefully weighed his options", "score": 9, "replies": []}, {"body": "Even better! Wait until he starts to say that “plantation” has mojo and then we’ll know when to sell!! Please update us every few days with his opinions. I’m not joking. I think you are 100% right.", "score": 7, "replies": [{"body": "Lol that would be a decent trade if you followed it with BYND. I’ll keep you posted", "score": 4, "replies": []}]}]}, {"body": "There's a big fucking difference between eating a hamburger and dragging my ass onto a stationary Instagram bike.", "score": 9, "replies": [{"body": "A fake hamburger.", "score": 3, "replies": []}]}, {"body": "I've already lost 14% on the first trade I followed from WSB. haha, fucking awesome, you guys are good.", "score": 8, "replies": [{"body": "That’s beautiful", "score": 3, "replies": [{"body": "Wanted to update. Today the position was up 300%, so I sold 1/3 and will let the rest ride. Not sure why WSB gets a bad rep, I'm batting 100% on the recommendations from here. hahaha.", "score": 6, "replies": []}]}]}, {"body": "40 million share float is too high. BYND and TLRY had floats below 10 million and were trading half or more of it a day.", "score": 7, "replies": [{"body": "I feel like there is a lot of wisdom in this statement I don't understand.  Can you please explain it to me like I'm a 5 year old?", "score": 2, "replies": [{"body": "The float is the shares available to trade. Float =< Authorized shares.\n\nA smaller float is a more likely set up for a short squeeze.\n\nTake a look at historical charts for BYND and TLRY, both are the perfect examples of a low-float short squeeze. Both were correctly seen as overvalued, then too large a % of the float became held short, when massive hype hit and the price rose instead; the shorters had to chase it up to cover, pushing the price even higher, making it more overvalued, shorted harder, and pushed higher to cover again, rinse/repeat. They both rose from roughly $20/$40 to $200/$300 With the entire float being traded multiple times in one day. 40 million shares lacks the scarcity for this type of set-up to squeeze. I'm high as fuck, that's as good as I can do right now. Always tip your janitor.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Neither matters for a short squeeze without scarcity of shares (low float).", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> This is obviously relevant because price per BYND share was much higher than price per PTON share.\n\nYet TLRY IPO'd at roughly the same price as PTON and reached $300 per share at the top of the squeeze... so, irrelevant. \n\nThe price was led higher because scarcity of shares + massive hype made it continually more expensive to cover failing short positions. The likelihood of a bloated share structure leading to a short squeeze as seen in BYND and TLRY is dismally low, which is why we don't see them happen, which is why PTON is not going to be squeezed $200/$300 a share. **And that's what OP is talking about, ie; will PTON squeeze like BYND/TLRY? No, it won't. Does that mean a short squeeze can still happen and move the price a little? Yes, but that's not \"like BYND/TLRY\".** The tens of millions of extra shares in comparison ensure a lower price to cover if PTON moves against your short position because the float ain't getting swallowed multiple times a day by the street.\n\nWhatever your position, I hope you do well, and I'll be happy to be proven wrong if PTON hits $250.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "7. Despite the fact that their music has made the classes suck, and tanked their on demand content, the cult attacks anyone who points this out.  Also, Echelon is a competitor, and a 7 day free trial showed me somehow, despite Peloton's licensing issues, their classes still suck comparatively.", "score": 5, "replies": []}, {"body": "Wow... I might actually throw $$$ on this", "score": 5, "replies": [{"body": "Is the 1890 in your name the year you born? What was the Great Depression like?", "score": 8, "replies": [{"body": "You're about to find out as soon as your calls expire...", "score": 11, "replies": []}]}]}, {"body": "What the fuck is a PTON", "score": 5, "replies": [{"body": "A stationary bike. True fuckin story.", "score": 9, "replies": [{"body": "Revolutionary. Time to ride this cockrider to 420. Can't go. Tits up", "score": 5, "replies": [{"body": "Imagine if you took a norditrack from the 80’s and strapped an iPad on it and while you peddled you used Chatroulette to meet new trainers.", "score": 9, "replies": [{"body": "Don't forget the paid subscription for content to appear in the iPad 🤣", "score": 9, "replies": []}]}]}, {"body": "An extremely expensive one at that", "score": 3, "replies": []}, {"body": "They have treadmills and rowing machines on deck too for 2020. Stonks only go up", "score": 3, "replies": [{"body": "Are those officially announced yet?", "score": 1, "replies": [{"body": " [https://www.cnbc.com/2019/11/13/peloton-jumps-9percent-on-report-of-new-rowing-machine-and-cheaper-treadmill.html](https://www.cnbc.com/2019/11/13/peloton-jumps-9percent-on-report-of-new-rowing-machine-and-cheaper-treadmill.html) \n\nIt's in the works, don't think they have an official prototype that they're rolling out just yet though.", "score": 1, "replies": []}]}]}]}, {"body": "A ton of pee", "score": 5, "replies": []}]}, {"body": "Fuck it. Gotta lose this target money somehow", "score": 4, "replies": []}, {"body": "Thats because every 45 year old white woman with a rich husband is getting one for Christmas this year.  $8billion valuation with $25M in subscription probably doubling after Christmas is a business any dweeb with a brain is going to get a piece of.", "score": 5, "replies": []}, {"body": "I bought 2021 puts because I have never seen a single person in their little fucking caged mall kiosk. That's enough DD to make a $750 wager.", "score": 3, "replies": []}, {"body": "Where do you see a positive-enough bit of news or impulse that drives this up to the point that shorts start capitulating?", "score": 2, "replies": [{"body": "What do you think $BCKY will be buying for Xmas?", "score": 5, "replies": [{"body": "They could do a juicy Black Friday deal", "score": 2, "replies": []}]}, {"body": "It's the stock, the product is the stock, all you need to know. Tendie train choo choo.", "score": 5, "replies": []}]}, {"body": "Lets goooo", "score": 2, "replies": []}, {"body": "I'm also sitting on calls, but I'll have you know that the short rate has actually gone down (this is IBKR): [https://imgur.com/a/QBkQQkc](https://imgur.com/a/QBkQQkc)", "score": 2, "replies": []}, {"body": "this isnt the same market it was 6 months ago. lots of stocks have these low float high short share dynamics, but the unicorn bubble seems to have burst. with that said... IM ALL IN", "score": 2, "replies": []}, {"body": "Everyone said Fastly was the next beyond, they were wrong. They'll be wrong about peloton too", "score": 2, "replies": [{"body": "Didn’t Fastly go from 14 to 35? Seems to me that is satisfies the criteria of being a short squeeze play", "score": 2, "replies": [{"body": "It did, it didn't go nearly as crazy as the meat did and continue the run north of 100 or even\n200 though. It was fine, but not meat crazy", "score": 1, "replies": [{"body": "You also have to consider that beyond went from 40 to 240 in a time span of multiple months where FSLY basically made the move in under a month.", "score": 1, "replies": []}]}, {"body": "God what a wild move. I was in from 14->17 and just watched dumbfounded", "score": 1, "replies": []}]}, {"body": "What's wrong with Fastly? I like that play.", "score": 1, "replies": []}]}, {"body": "I just don't get how every single anal-ist is a fucking buy rating. Not that it matters, but shit is there something non trivial about the company? They manage money like shit, subscription is just a fucking app with only 25% revenue from it and a semi-shitty retention rate, competition all over the place, size of market estimate a fucking joke. The lockup expiration cant come soon enough. Bicycles are gay AF.\n\nDisclamer: I got fucked nice and proper shorting this piece of shit on the last bounce.", "score": 2, "replies": [{"body": "Analysts work for investment banks. Investment Banks make money by doing deals for publicly traded stocks and financing those companies (and wealth management services for the executives of those companies). Why would the analysts torpedo their own chance at a higher YE bonus by taking their own bank out of the running for a slice of the pie?", "score": 2, "replies": [{"body": "It happens, do see sell ratings occasionally. Plus if it's a bullshit job that pays a stupid ammount of money to draw squiggly lines from bottom left to top right, why even bother paying someone for that?", "score": 2, "replies": []}]}, {"body": "Their retention is in the upper 90% range l, did you even listen to the earnings call?", "score": 2, "replies": [{"body": "Yea a question came up during the earnings call wether those numbers included accounts which are \"paused\" in other words not paying anything.", "score": 1, "replies": [{"body": "And do you remember what the answer was because I know It was ultra low but can’t remember It off the top of my head.", "score": 1, "replies": [{"body": "Take a look at this article. https://secondmeasure.com/datapoints/peloton-subscriptions-doubled-over-past-year/\n\nThe answer on the call is a blanket statement with alot of fluff, no definition of how the metric is derived. Additionally, no differentiation of prepaid vs month to month subscribers is given. Huge difference, since after first year contract is up, numbers might not look so good. \n\nTheir equipment lasts for a while, but no return customer numbers are given for a repurchase which is 75% revenue. They assumed a 15 year customer life span... on average which is just not accurate.\n\nAnyway do your own research and double check the bullshit from an earnings call with a D- BBB company that's just waiting to get sued.", "score": 1, "replies": []}]}]}]}]}, {"body": "40M = to much available at the moment to see a squeeze.", "score": 2, "replies": []}, {"body": "Did you sell yet?", "score": 2, "replies": [{"body": "Jesus no. What is it with everyone here taking profits? We either buy a yacht or we go broke. There is no in between. Trust the process.", "score": 1, "replies": [{"body": "Right, so what's your process? I'm trying to understand when you sell?", "score": 1, "replies": [{"body": "I’d say my biggest rule for myself is sell when a position goes against you and the market tells me that I am wrong. No sense fighting against something and slamming my fists in the table saying “this should be $20/share!” Meanwhile it just keeps going down. The market doesn’t work like that. When something is out of favor, or some  insider knows the quarter will suck (someone ALWAYS knows more than us) than I sell and move on. \n\nThat’s why I love IPOs. there is no history there, no hangups. Either they’ll work or they won’t and if they start to work, go along for the ride. \n\nPrice targets are silly for how I trade. They are rough estimates of what something could be worth if things go a certain way- but they either always are too low or too high. It has more to do with sentiment breaking. I’ll never be the person to buy at the bottom, and I’ll never be the person to sell at the top, but if I can buy a stock that’s moving up that has momentum and a high short interest and could squeeze, and has the right Investors and analyst coverage, then I’ll do ok. \n\nIt’s like getting pulled out to sea by a riptide. If you fight it, you’ll drown because the ocean is a lot stronger and bigger than you are. But if you just kind of float there, and let the ocean carry you somewhere, you conserve your energy and eventually you’ll float out of the riptide and can swim back to shore.", "score": 2, "replies": [{"body": "Appreciate the reply. Love the analogies.", "score": 2, "replies": [{"body": "No problem man", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Meme stock incoming", "score": 1, "replies": []}, {"body": "What's your sell strategy?", "score": 1, "replies": []}, {"body": "WHOOPS", "score": 1, "replies": [{"body": "What’s the whoops for?", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}
{"title": "Tesla Truck unveiling tomorrow", "selftext": "Bought my calls for tomorrow’s unveiling. I’m super bullish, Wish me luck.\n\nThe event takes place [tomorrow]Thursday night. So prolly, the show will begin Friday morning.\n\nALSO, im doing $470 Calls 20 cents each Expiring 6 DEC.", "id": "dz88tx", "created_utc": 1574283904.0, "score": 55, "upvote_ratio": 0.86, "num_comments": 74, "comments": [{"body": "Fuck your calls -- I sold calls so I hope they don't go up too much.\n\nAlso sold puts so I hope they don't tank.", "score": 60, "replies": [{"body": "Almost did a short butterfly cause idk where it's going but it's going somewhere fam. No way it stays neutral, Tesla fans are fucking maniacs.\n\n\"The truck has WHEELS?! Fuck this shit i was promised the future, SELL SELL SELL.\"\n\n\"...wait but you mean to tell me i can play a shitty port of a video game on the center console?! THE FUTURE IS HERE, BUY BUY BUY.\"", "score": 36, "replies": [{"body": "Alright if tomorrow happens to be flat I'm gonna close some shit just in case some bullshit happens.", "score": 4, "replies": [{"body": "Hope your sold at a decent delta.", "score": 1, "replies": []}]}, {"body": "Its kinda obvious its going up tomorrow, when the news about the Event date dropped the stock went up significantly. I traded that day it was pretty good. Not to mention The Actual Fuxking event is tomorrow. Why would anyone buy puts. Lmao", "score": -7, "replies": [{"body": "Clearly you forgot what happened to Model Y unveil event", "score": 14, "replies": [{"body": "Exactly, buy the rumor and sell the news. TSLA will consolidate within the next week. It’s up $100 in the last few weeks. I think everyone is a little late to the party.", "score": 3, "replies": []}, {"body": "That was when Tesla was not profitable and the stock was trending down. It's been on its way up for months now and nothing but good news lately. There's no reason why it shouldn't hit an all time high", "score": -3, "replies": []}]}, {"body": "Oh my", "score": 1, "replies": []}, {"body": "Big yikes.", "score": 1, "replies": []}]}]}, {"body": "I’m pretty sure he likes his calls fucked", "score": 6, "replies": []}, {"body": "THETA GANG!", "score": 3, "replies": []}]}, {"body": "> $470 Calls 20 cents each Expiring 6 DEC.\n\nWhat's it like hating money, OP?", "score": 34, "replies": [{"body": "Picturing a 3-5% pop followed by a post from OP asking why his calls all say .01 even though the stock went up", "score": 16, "replies": []}, {"body": "lmfao! seriously, aint that a stretch even for Tesla, in that short period?", "score": 6, "replies": [{"body": "Lol just because I bought  470 calls doesn’t mean it should HIT 470 in order for me to make any money. The thing goes up 1%, my options go up 200%", "score": -17, "replies": [{"body": "Imagine actually believing this", "score": 27, "replies": []}, {"body": "bro", "score": 11, "replies": []}, {"body": "LMFAO ahhh I thought this way many dollars ago", "score": 7, "replies": []}, {"body": "I think it's gonna have to break $400 for your calls to break even.", "score": 6, "replies": []}, {"body": "This is why Theta Gang wins", "score": 4, "replies": []}, {"body": "GUH", "score": 5, "replies": []}]}]}]}, {"body": "Tesla 420 calls. Everyone thinks I'm in it for the memes...\n\n\nThey're right.", "score": 26, "replies": [{"body": "Whats the expiration on yours. I usually go with 2 weeks. Giving it enough time to come UP if anything goes wrong", "score": 5, "replies": [{"body": "I’m March 2020", "score": 7, "replies": []}, {"body": "Lmao you are slow.", "score": 5, "replies": []}]}]}, {"body": "Got 8 11/29 360 calls. I’m scared.", "score": 11, "replies": [{"body": "Theres no need to be scared. Tesla’s a really nice company. My Boy Elon GOT THIS", "score": 11, "replies": []}, {"body": "11/29 362.5 calls and 340 puts probably gunna my  poo pushed in", "score": 3, "replies": []}]}, {"body": "I didnt like any of the call prices i saw", "score": 8, "replies": [{"body": "Buy out of money, they double real quick", "score": 9, "replies": [{"body": "Traders HATE him.", "score": 1, "replies": []}]}]}, {"body": "I’ve got 10 $350 calls expiring 11/29. Makes me a little concerned to see other people on wsb making the same moves as me", "score": 8, "replies": [{"body": "Dont worry I have $347.5 puts so I'm sure you will see tsla moon tomorrow", "score": 3, "replies": [{"body": "Had to come back and say congrats man", "score": 1, "replies": [{"body": "Thanks I closed the position made about 80% gain so about 2k, wish I had put more into it haha", "score": 2, "replies": []}]}]}]}, {"body": "Loaded puts hope I get wrecked", "score": 5, "replies": [{"body": "Elon is gunna plow you raw and I won’t even feel sorry for you", "score": 7, "replies": [{"body": "Big daddy Elon dont play", "score": 5, "replies": []}]}]}, {"body": "...so calls on Ford?", "score": 5, "replies": [{"body": "i swear to fuck i just sold out of my F calls for a 800$ loss,--\n\nactually F will prolly moon tomorrow then so yeah you're good", "score": 1, "replies": []}, {"body": "sure", "score": 1, "replies": []}, {"body": "Why Ford calls may ask?", "score": 1, "replies": [{"body": "ever heard of Google, Boomer?", "score": 3, "replies": [{"body": "Lmao wtf.  So what google puts then?", "score": 3, "replies": [{"body": "🤔🤔🤔 I was telling you to Google information of Ford\n\nYou seem a little too autistic so: Ford just announced a Mustang branded electric vehicle, their company is already a pile of shit so maybe that will help them stay afloat for a couple months before going bankrupt and getting some more government bailouts next year.", "score": -8, "replies": [{"body": "Wouldn't you wanna buy puts on ford if teslas  reveal tomorrow is good. Competition?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I believe they can build a truck but the pricing needs to break through to more average consumers (who btw already throw money they don't have at 50k trucks). They would be stupid to put a 80-100k price tag on this thing.", "score": 3, "replies": []}, {"body": "you trippin if you think its going up 30% in a month", "score": 3, "replies": [{"body": "Like i said earlier, it doesn’t need to climb to 470 for me to make money. Stonk goes up 1% my options goes up 200%. Deep out of money Double real quick", "score": -5, "replies": []}]}, {"body": "TSLA dropped hard when Y was revealed. I hope it be different this time.", "score": 3, "replies": [{"body": "This is going to be a radically different product. Unlike Y which was just a poor mans Model X", "score": 1, "replies": []}]}, {"body": "whats ur calls?", "score": 2, "replies": [{"body": "I’m doing 20, 470 Calls for 20 cents/each. Call me MAD MAN", "score": 8, "replies": [{"body": "You could have just Venmo’d someone here $400.", "score": 7, "replies": [{"body": "Holy shit, in his previous post I thought he mistyped $370, this mans actually retarded.", "score": 7, "replies": []}]}]}]}, {"body": "If Elon is good at anything it's massively overhyping or outright lying about features and products. He will do anything to push the stock price", "score": 3, "replies": [{"body": "Just because you lost money on Tesla doesn’t mean that Elon musk is bad. Grow the fuxk up buddy, learn from your mistakes and never risk more than your tolerance level. No one knows where the stock’s going to go. Even if it goes down tomorrow, I’m totally fine wit it. But if it Rips up I’m going to Bank alot", "score": 0, "replies": []}]}, {"body": "Good luck my brothers so daddy Elon may take away are sins and save us from a recession.", "score": 1, "replies": []}, {"body": "Probably going for a straddle. I figure it might be a large movement but don’t know which direction. The premium doesn’t look too expensive.", "score": 1, "replies": []}, {"body": "Good luck", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": [{"body": "f", "score": 1, "replies": []}]}, {"body": "Why's this thread back", "score": 1, "replies": []}, {"body": "F       Ord.", "score": 1, "replies": []}, {"body": "How much will you lose if it doesn’t go up?", "score": 1, "replies": [{"body": "I never risk more than my tolerance level. $700 is the sweet price I’m OK risking. But it my options go up I’m going to bank a Ton. So i like to give it few weeks (2 usually) to reach its potential. It has worked for me every time.", "score": 0, "replies": [{"body": "Everytime lul", "score": 3, "replies": []}, {"body": "How much can you make?", "score": 0, "replies": []}]}]}, {"body": "How the hell does Calls work? 😫", "score": -1, "replies": [{"body": "You buy call options when you think stonks gonna go up. When it does, your call options price goes up Then you sell it.", "score": 0, "replies": [{"body": "what if it doesn't? you have to pay the difference at exp?", "score": 1, "replies": [{"body": "Then you loose everything. Generally you never hold options till expiration. You accept your mistake and sell it for loss.", "score": 1, "replies": []}]}]}]}, {"body": "$465 Calls at .16 Exp 6 DEC\n\nLead me fellow autist", "score": -3, "replies": []}]}
