{"title": "Stocks you expect to beat the market for the next 10 years?", "selftext": "Hey!\n\nA little thought experiment i am running right now is to think of ways I’d be able to make a million dollars in the stock market over the next ten years.\n\nNow I don’t have the capital to constantly feed into an index fund and so now I’m considering more riskier options. \n\nAny stocks out there you think will blast through the roof in the next ten years? A few months ago I would’ve said TSLA but that ship may have already sailed. UBER could turn it around but I’m not hopeful on that one...\n\nAny ideas?", "id": "dycrm4", "created_utc": 1574125007.0, "score": 74, "upvote_ratio": 0.84, "num_comments": 78, "comments": [{"body": "Companies that you haven’t heard of yet.", "score": 148, "replies": [{"body": "Most likely eh", "score": 29, "replies": [{"body": "I read an article about the top 10 stocks in 2008 right before the market crashed.\n\nI think Apple and XOM were the only two which have stayed in the top ten. \n\nMy point is: companies gain and lose value, and 10 years is a long time in the stock market. Recessions will happen, companies will go bankrupt, markets will shift. It's difficult to predict the future, so maybe just go with SPY.", "score": 57, "replies": [{"body": "Except you’re not taking into account the companies now that are transforming life as we know it. Google, Facebook, Amazon, Tesla, Apple etc. these companies aren’t going anywhere anytime soon. They are changing the world.", "score": 0, "replies": []}]}]}]}, {"body": "White girls index is pretty fool proof.", "score": 68, "replies": [{"body": "$LULU", "score": 20, "replies": []}, {"body": "$KAREN", "score": 17, "replies": []}, {"body": "BECKY", "score": 13, "replies": []}, {"body": "SBUX", "score": 10, "replies": []}, {"body": "$GOOS", "score": 3, "replies": []}, {"body": "White girl index is textbook survivorship bias and barely beats SPY.", "score": 1, "replies": [{"body": "Agreed. Blackberry would have been on that index back in 2007. It's fallen pretty far since white girls moved on to Apple.", "score": 7, "replies": [{"body": "Yes, also Abercrombie & Fitch.", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": 51, "replies": [{"body": "Dude are you saying that past performance is no guarantee of future results?", "score": 15, "replies": [{"body": "Surely not", "score": 0, "replies": [{"body": "Stop calling him Shirley", "score": 6, "replies": []}]}]}]}, {"body": "It like asking, \"where are the gold mine?\" and hoping people give u the answer.", "score": 20, "replies": [{"body": "Dont listen to him. \n\nThe gold is in my front pocket OP. You just have to look deep", "score": 19, "replies": []}]}, {"body": "Costco- What are the chances they open up hundreds/thousands of stores in China over the next decade and have millions of new members?", "score": 15, "replies": [{"body": "Apparently they had to close the store on the opening day due to too many people going there", "score": 3, "replies": [{"body": "Then what happened during the next few days?", "score": 1, "replies": []}]}, {"body": "Costco's business model won't do very well in China.", "score": -15, "replies": [{"body": "Why do you say that?", "score": 3, "replies": [{"body": "If you know how Chinese people save money, you'll understand Costco won't be very successful in China. It's just their business model more suitable for Americans.", "score": 0, "replies": [{"body": "I live in so cal. go to any of the cities with large chinese immigrant populations, city of industry alhambra, etc.. they are all packed with Chinese shoppers.", "score": 2, "replies": []}]}]}]}]}, {"body": "$DOCU, DocuSign.", "score": 6, "replies": [{"body": "Whats DocuSigns moat?\n\nEdit: thanks for downvoting an actual stock question guys", "score": 1, "replies": [{"body": "They have a big first-mover advantage.  They own 33 patents in the US and 48 in other countries.  In 2015 they collaborated with Visa to build the first public blockchain-based smart contract - they are positioning themself to be a leader if blockchain based legal docs become wifey accepted.\n\nIn addition it is not simple to create a digital representation of a signature.  An e-signature must be secure, encrypt the agreement, be able to authenticate the people signing the document, integrate with other software systems and conform to country/industry-specific laws.   Docusign already connects with more than 300 other applications like Google, Oracle, Salesforce, and SAP.   \n\nThey own 60% of the e-signature market with Adobe behind at 12%.  \n\nPeople are starting to use Docusign as a verb (Hello, Google).", "score": 7, "replies": []}]}]}, {"body": "Can’t go wrong with SHW, HD, MSFT, O, ABT, MCD, TXN, MA, WM, AWK. Would much rather own these than the S&P for the next decade+", "score": 37, "replies": [{"body": "Agree. \n\nMicrosoft has a strong vision and, with Nadella, good execution.\n\nSalesforce is another I would recommend. \n\nWaste management as people are dumping on and polluting this sweet planet of ours.\n\nDisclaimer: not financial advice - use your best judgment before purchasing.", "score": 16, "replies": [{"body": "Salesforce might get hit hard if there's a recession. It was definitely one of the best stocks for this decade, not sure about the next.", "score": 2, "replies": []}]}, {"body": "Thoughts on ABBV? their dividend yield seems too good to be true", "score": 2, "replies": [{"body": "Company is a no go. 74% of their revenue comes from Humira, which expires in less than 5 years and biosimilars are popping up all over Europe. The drug is losing sales in everywhere that isn’t the US. Futher, they paid an insane premium for Allergan, which derives more than half its revenue from Botox. Botox is a safe drug, but definitely not worth the premium management shelled out. Company is not a long term buy.", "score": 3, "replies": []}, {"body": "I’m bullish and invested in them.  They’re coming off FUD over allergen acquisition, strong earnings, and regular dividend increases.  They went down to a pretty low point and are recovering back to their highs in my opinion.  They also seem to gain mildly even during the red days as of late.  I’m expecting a pullback soon, though.  Healthcare is a bit risky with the election coming up, though; if Warren gets anywhere close to the primary candidate, I would probably sell ABBV, and pretty much anything else for that matter and just buy gold.", "score": 0, "replies": []}]}, {"body": "RemindMe! 10 years", "score": 1, "replies": [{"body": "I will be messaging you on [**2029-11-19 13:08:14 UTC**](http://www.wolframalpha.com/input/?i=2029-11-19%2013:08:14%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/dycrm4/stocks_you_expect_to_beat_the_market_for_the_next/f81iwq4/)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fdycrm4%2Fstocks_you_expect_to_beat_the_market_for_the_next%2Ff81iwq4%2F%5D%0A%0ARemindMe%21%202029-11-19%2013%3A08%3A14%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20dycrm4)\n\nThere is currently another bot called u/kzreminderbot that is duplicating the functionality of this bot. Since it replies to the same RemindMe! trigger phrase, you may receive a second message from it with the same reminder. If this is annoying to you, please click [this link](https://np.reddit.com/message/compose/?to=kzreminderbot&subject=Feedback%21%20KZ%20Reminder%20Bot) to send feedback to that bot author and ask him to use a different trigger.\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/c5l9ie/remindmebot_info_v20/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "MSFT. Yes. This. Also like the rest of your list : )", "score": 1, "replies": []}, {"body": "RemindMe! 10 years", "score": 0, "replies": []}]}, {"body": "McDonalds, Costco, Apple, WM", "score": 9, "replies": []}, {"body": "$NET aka Cloudflare", "score": 7, "replies": [{"body": "Why do you believe in that company ?", "score": 3, "replies": [{"body": "Because people use it without actually realizing it", "score": -1, "replies": []}]}]}, {"body": "Of all the companies listed in these comments, chances are none of them will explode as expected... do research and find what fields are going to be emerging in the near future and see which companies arise to lead the charge... that may be your best bet here", "score": 5, "replies": [{"body": "This is the best comment in the thread.\n\nWould like to hear your thoughts on macro trends, even if you don’t have the name of the companies.\n\nA couple of ideas from my side:\n1. Battery industry will be booming in the next 10 years (due to EVs and in general widespread use of electronics) —> cobalt, lithium and nickel prices will definitely go up significantly. Respective metals producer can benefit from this, e.g. Norilsk Nickel. Can also think of the large battery producers, but these companies are usually diversified (e.g., Panasonic), and as a result you can a lot of noise in this exposure. Also, you can imagine new producers entering the field\n\n2. AI is the next big thing in technology - you will see widespread use of these type of algorithms everywhere in the next 10 years —> the issue here is that we may not yet know the new players in the field. One can argue that Microsoft and Alphabet are the obvious candidates to win the game, but remember internet in 90s - none of the leaders from that time are relevant now, same can happen in AI. So would rather carefully watch for new emerging players here... especially if you look at the current multiples of Microsoft and Alphabet...\n\n3. A bit riskier bet would be China consumer market. Even though the GDP growth is slowing down it is still a very “poor” country in terms of GDP per capita. Thus, I would expect China to continue to grow. In this case you can think of Alibaba, Tencent and Baidu as the companies still with significant potential. \n\n4. Environment. CO2 emission and environment in general become a big problem getting more and more public attention. Don’t know if any specific company in this field, but guys offering CO2 offset programs for big corporations can benefit...", "score": 2, "replies": []}]}, {"body": "Tesla, Google, Qcom, Aapl, maybe Cisco, some semiconductor stocks as 5g rolls out and NVDA.", "score": 8, "replies": [{"body": "To be honest i dont think Tesla will beat the market in 10+ years (can be wrong ofc!) but i think Tesla will start to loose the \"battle\" that so far is winning when all the principal car manufactures starts to go full electric. I would add AMD as well", "score": 0, "replies": [{"body": "They have been saying the principal car companies will beat Tesla for a while. Doesn't seem to be happening. Even if they do I think Tesla will be the leader in self driving. Much more lucrative overall than making cars.", "score": 14, "replies": [{"body": "Mercedes said it will only do R&D in electrical motors from now on  \nVolkswagen said it will only produce electrical cars from 2025  \nVolvo said something similar  \nI like Tesla a lot , but paying 55K EUR for a car with plastic interior ? Tesla has to do this to make some profit but the real car builders will have a way bigger budget, skilled people, experience and finishing touch.. It is just a matter of time until they take over.", "score": 3, "replies": []}, {"body": "The biggest companies didnt enter the electric race yet. But yes, in self driving Tesla is quite ahead. But... New technologies will appear, let´s see how it will go", "score": 5, "replies": []}]}]}, {"body": "TSLA going to be 6000 in 5-10 years. Easiest money you will ever make if you can see past the misinformation campaign against them.", "score": 1, "replies": []}]}, {"body": "Companies that are able to sustain a competitive edge on their market, whose market will not significantly shrink and who can earn outsized returns on equity.", "score": 1, "replies": []}, {"body": "SHOP, MMX, SQR.CN (soon to be TAAL)", "score": 1, "replies": []}, {"body": "I individual stocks I'd rather not get into, but i see solar/ renewables, and anything having to do with cyber security getting big. They both address problems we need to solve, and have alot of room to grow. Just my .02$.", "score": 1, "replies": [{"body": "There's a lot of reason to believe energy transition will be the leading sector in the next decade. Hard to tell which company will win tho.", "score": 1, "replies": [{"body": "Exactly. I definately picked some winners, solaredge has gone up 150% in the last two years which I own, but even then, alot of oil companies like bp shell and Exxon are starting to transition to renewables.", "score": 1, "replies": []}]}]}, {"body": "$AMRN have a good feeling about this one but that’s about all I have lol.", "score": 1, "replies": []}, {"body": "AJG,SHW Feel like there are a lot of small-midsize companies that are run with good management who will jsut execute because they have a nice area they focus on and have operated for so long.  That being said, look for a trend that will grow at exponential type rates and find high quality management (e-sports), health care, education.", "score": 1, "replies": []}, {"body": "Apple\n\nMicrosoft \n\nBerkshire \n\nUnited States steel ( this is an all or nothing type stock, fairly risky)\n\nFord", "score": 1, "replies": []}, {"body": "Nlst penny now but within the next 2-5 years I think they will be at 10$ at least.", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "Agree that it’s at a higher risk than the others. However SF have been steadily diversifying into different areas such as marketing cloud where they are competing with adobe and other areas such as support cloud where they are competing with zendesk and others. The opportunity to SaaS-enable these areas is big.\n\nAlso worth noting that SAP and Oracle are getting left behind in lots of these areas. SAP is trying to get into the CRM space and oracle has an offer that, true to its name, is complex and expensive. \n\nThey just need to execute now :)", "score": 1, "replies": []}, {"body": "AMD", "score": 1, "replies": []}, {"body": "$V", "score": 1, "replies": []}, {"body": "Just look up the richest people in the world and buy the stock/company they’re associated with.", "score": 0, "replies": [{"body": "Alibaba?", "score": 0, "replies": []}]}, {"body": "ADSK and NEXCF", "score": 1, "replies": []}, {"body": "Apple, Boeing, honeywell, danaher, caterpillar, Amazon...  all huge companies that’ll live on", "score": -2, "replies": [{"body": "Live on sure; beat the market?", "score": 13, "replies": []}]}, {"body": "Apha n us mj names that aren't listed.", "score": -2, "replies": []}, {"body": "$NKE, $ROST", "score": 0, "replies": []}, {"body": "ADRNY, NXPI , WM", "score": 0, "replies": []}, {"body": "Buy qualcomm stock", "score": 0, "replies": []}, {"body": "Weed stocks", "score": -6, "replies": []}, {"body": "Uber Lyft and Grubhub", "score": -14, "replies": [{"body": "HMMY?", "score": 5, "replies": [{"body": "Definitely not going to 0 👍", "score": 1, "replies": []}]}]}]}
{"title": "AMD?", "selftext": "[deleted]", "id": "dynjpn", "created_utc": 1574184442.0, "score": 84, "upvote_ratio": 0.92, "num_comments": 68, "comments": [{"body": "Intel is gay, all their decent engineers went to other companies or got layed off due to jealousy.  The only people that stuck around were the weird looking fuckers that tried to use their company positions to date the helgas in R&D, even their CEO got fired for it.  Guy is the human equivalent of a citroen nemo\n\n&#x200B;\n\nIf you read Teamblind forums you can see intel is the place to rest and vest  and do no fucking work and AMD is the sort of place where su bae goes out at lunch and brings back wendys, laces them with cocaine so you are 100% more productive whilst at intel only blowjobs can advance your career", "score": 62, "replies": [{"body": "None of this sounds accurate but I choose to believe it", "score": 26, "replies": [{"body": "Their previous CEO did supposedly leave because he was dating a subordinate, though personally I think that was a convenient excuse for a firing for shitting the bed and falling behind a company (AMD) with a much smaller R&D budget.", "score": 3, "replies": []}, {"body": "doesn't sound accurate or insider info? the market says he's spot on", "score": 1, "replies": []}, {"body": "So basically religion right?\n\n&#x200B;\n\nSu Bae is our messiah", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 48, "replies": [{"body": "This but unironically - they sell GPUs as well.", "score": 21, "replies": [{"body": "They need to put out something to compete with the 3080/Ti this next year.", "score": 3, "replies": [{"body": "I think that now their CPU division has accomplished great things, they will move onto the GPU side.", "score": 2, "replies": []}]}]}]}, {"body": "Bargain processors that now are surpassing intel in quality. Best bang for your buck. Just like your mom.", "score": 71, "replies": [{"body": "Define quality, they have a motherboard chipset Athat needs firmware updates and the bios flashed before hardware reaches it's out of the box potential.\n\nIn fact, that's the same old shit. AMD developed a product, and then 70% oh the way there, they ship. Then you have popular OS issues and other horseshit.", "score": -2, "replies": [{"body": "Nobody cares about their motherboards.", "score": 5, "replies": [{"body": "Except you need their cjipsets to use their CPUs...", "score": 1, "replies": []}, {"body": "peasantry or satire, I can't really tell.", "score": -1, "replies": []}]}, {"body": "qual·i·ty\n/ˈkwälədē/\n\nnoun\n\n1. the standard of something as measured against other things of a similar kind; the degree of excellence of something.\n\"an improvement in product quality\"", "score": 3, "replies": []}]}]}, {"body": "They basically made a better processor than intels same model for almost half the price, next year they’re predicted to surpass intel.", "score": 69, "replies": [{"body": "okay i guess that makes sense, but does that processor justify 14 billion in such a short amount of time? and if it does, shouldnt it end right about here considering how heavily priced in 14 billion is for one new product? (i could sound like a complete dumbass again i don’t know chips, the valuation spike just didn’t make sense to me)", "score": 11, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "And what do you need to power all of that huge tech bubble???  Chips ... And lots of them!  They also entered the business ring with their EPYC lineup.  This shit is tasty.", "score": 6, "replies": []}]}, {"body": "Basically anyone building a server or data center today is using amd.\n\nLaptops are using amd again after nearly a decade of almost no brand using them.", "score": 9, "replies": []}, {"body": "Intel is worth 250billion, amd is worth 45billion\n\nAMD is a better company with better products then intel.\n\nDo the math", "score": 3, "replies": []}, {"body": "Well processors can be overclocked, basically supercharged. These new chips have a lot more room for improvement than intel’s, literally their only competition. Intels current top model is pretty much maxed out. So AMD is just as powerful, can be overclocked to be more powerful, is half the price, and the company can only grow from their, while intel is going to have to overcome a lot of problems on the molecular level that amds processors mostly overcome.", "score": 5, "replies": [{"body": "thank you! so by the sounds of it amd will basically kick their only competitors ass for the better amount of the at least short term future", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Thats true, but the customer normally has clauses that allow them to source other gear in the case of security flaws that are identified after entering a contract. Intels had a few of those lately", "score": 1, "replies": []}]}, {"body": "AMD is using a 7nm process (smaller transistors = less heat, power and more efficient).\n\nIntel is stuck on 10nm and has been failing to move to 7nm for some time now.\n\nThis is big for AMD. \n\nAdditionally, AMD is making 64 core server processors while Intel is at 28 cores, which is also big for AMD.\n\nSo AMD is making chips that are equally as powerful as Intels while using less power and costing way less, while also offering more performance for servers.\n\nBasically buy AMD.", "score": 2, "replies": []}]}, {"body": "this is wrong... amd processors are much worse as far as overclocking headroom...\n\n\nthey DO however have better core counts, tdp, cache, boosting time, price, etc.", "score": 3, "replies": []}]}, {"body": "I’m addition to whatever the other guy said, it represents a paradigm shift. AMD used to hang on because it was best bang for your buck. Now, it’s best bang for your buck and straight up better.", "score": 1, "replies": []}, {"body": "Intel is like 2-5 years behind amd in terms innovation. Unless they asspull some crazy tech next year it will take a while before they catch up again", "score": 1, "replies": []}]}, {"body": "not only this but Intel blew their load trying to go to extreme UV and spent too much money without being able to produce. AMD basically leaped 2 years ahead of Intel in a short period of time and the market is still catching up.", "score": 1, "replies": []}]}, {"body": "No one is willing to tell you, so short that shit", "score": 33, "replies": [{"body": "Look at the insiders at $amd. They can’t sell their shares fast enough over $30. This is gonna end badly for the retailers", "score": 5, "replies": [{"body": "so they were selling at the same rate all the way from $10... try again!", "score": 13, "replies": [{"body": "Ya what’s that tell you? They thought it’s been overvalued since $10", "score": 2, "replies": [{"body": "only a fucking novice uses insider sales (at a regular clip) to indicate direction of stock. fucking TA is more reliable... if you downvote me you are a troll or should not be trading stonks. fucking novices.", "score": 8, "replies": [{"body": "TA.., you mean a large cap stock going from $30 to $41 in less than a month is normal?", "score": 5, "replies": [{"body": "no it is not normal. cause amd is not a normal mid cap. its a growth mid cap. (its not a large cap. more like mid cap)", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "Endless price target raises by market makers, short squeezes, and FOMO retailers keep pumping this bubble. It will keep going up as long as this bull market is being propped up.", "score": 9, "replies": []}, {"body": "My best guhess is that investors saw the stock and went \"It's like NVDA, but more bang for your bucc? Buy\" And shit went up. Those 2 are overpriced AF imo. I'm personally trading NVDA options and been doing good, that said, I try to always stay on the put side of things.", "score": 6, "replies": [{"body": "Why would you essentially go short on data center growth?\n\nDeep learning is set to pave the way for automation of a whole heap of jobs, most people anticipate a jobs crisis to emerge from the coming automation. Deep learning requires lots of hardware, the growth in hardware requirements to train the models has been documented at 7x annualized, meaning hardware demand exceeds capacity. All this, and you're going short on it??\n\nThis is like seeing the combustion engine replacing horse and cart, and deciding to go short on combustion engine manufacturers as you reckon they're overpriced AF.", "score": 1, "replies": []}]}, {"body": "You can have more PornHub tabs open with AMD than the competitors.", "score": 4, "replies": []}, {"body": "Not built in yet", "score": 3, "replies": []}, {"body": "You must be new here, stonks only go up", "score": 3, "replies": []}, {"body": "They are doing something less than a handful of companies on the planet know how to do and they are starting to do it better and better.", "score": 3, "replies": []}, {"body": "Look around this sub. Do you really believe they cured autism? That’s a clown question bro.", "score": 5, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "i dont plan on investing in this, like i said in the post i just kept hearing about this and was pretty shocked to see a 14 billion market cap increase in such a short amount of time and wanted some tech people to translate it partly for explanation partly to entertain the possibility of such a rise in my head. if i don’t know the difference between two processors i’m not gonna invest in it, and i don’t lol\n\nedit: but thank you for the resources i’ll check them out when i have some time", "score": 2, "replies": [{"body": "Word I edited my post to answer your question,  I didnt realize i just rambled on", "score": 1, "replies": []}]}]}, {"body": "lol, remember cyrix? \n\n\"cyrix instead\" \n\ni am not implying anything, just asking!!", "score": 2, "replies": []}, {"body": "Look into r/Ayymd", "score": 2, "replies": [{"body": "I love it", "score": 2, "replies": []}]}, {"body": "Don’t ask. Don’t try to be a smart ass. Don’t try to predict anything about this market. Just buy and ride the market for free tendies.", "score": 2, "replies": [{"body": "LMAOO not going to short or buy it but isn’t this reply kinda... bubble- ish?", "score": 1, "replies": []}]}, {"body": "I’ve got 50 42 contracts and 50 43 contracts... for this week that I bought today. Normally that’s crazy,., but AMD is fucking crazy.", "score": 2, "replies": []}, {"body": "Amd went from trash cpus to top tier cpus in about 3 years.\n\nAmd vs Intel went like this\n\nPhenom 2 was competitive with Intel.\n\nThe fx line came next, it was significantly worse than Intel.\n\nAmd fucked around and Intel kept getting better. \n\nAfter a long time ryzen came out and while better it was still pretty competitive with Intel.\n\nRyzen 2 was almost as good as Intel in many ways, and offered budget options.\n\nRyzen 3 is basically the same as Intel but cost less and usually offers more cpu cores which certain tasks use well.\n\n\n\n\nIn terms of gpu, amd has kinds fallen flat the same time frame but the 5700xt Is a decent budget option\n\n\nOn top of that amd has made massive inroads for server cpus, Intel once was on top but amd is basically better for less money.\n\nAlso next year ps5 and nextbox will use amd cpu and gpu again, while not big profit it's damn near guaranteed sales as consoles ads bigger than ever and likely will continue to be big sellers.\n\n\nAmds only minor shortfalls are in gpu space. Nvidia basically wins in every price range.", "score": 6, "replies": [{"body": "almost every single one of your points is wrong, lmao", "score": 3, "replies": []}]}, {"body": "I'm an idiot for selling at $30 huh?", "score": 2, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Bummer. I bought at around $9 as well and sold half at $18 and the rest at $30.", "score": 7, "replies": []}, {"body": "Fucking ooof", "score": 2, "replies": []}, {"body": "guh", "score": 2, "replies": []}]}]}, {"body": "its because AMD popping off is the only thing that hasnt been priced in yet.", "score": 1, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": [{"body": "I will be messaging you on [**2020-11-19 21:43:51 UTC**](http://www.wolframalpha.com/input/?i=2020-11-19%2021:43:51%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/dynjpn/amd/f82wyzy/)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fdynjpn%2Famd%2Ff82wyzy%2F%5D%0A%0ARemindMe%21%202020-11-19%2021%3A43%3A51%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20dynjpn)\n\nThere is currently another bot called u/kzreminderbot that is duplicating the functionality of this bot. Since it replies to the same RemindMe! trigger phrase, you may receive a second message from it with the same reminder. If this is annoying to you, please click [this link](https://np.reddit.com/message/compose/?to=kzreminderbot&subject=Feedback%21%20KZ%20Reminder%20Bot) to send feedback to that bot author and ask him to use a different trigger.\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/c5l9ie/remindmebot_info_v20/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "not knowing about SU BAE  YOU NEW HERE OR SOMETHING?", "score": 1, "replies": []}, {"body": "bought at 29 Sold at 37 now im too afraid to get back in.. but FoMO is strong :( what2do. no other stock looks interesting to me atm", "score": 1, "replies": []}, {"body": "Pent up sexual frustration they’re in every discount computer", "score": 1, "replies": []}]}
