{"title": "Finding hidden gems like NFLX, SHOP, etc.", "selftext": "I'm just curious to as how people usually find stocks like these to invest into them early. Any early investors in stocks like the ones listed want to tell how they found \"X\" stock before they became mainstream? I'm really interested to see how you guys came to discover them to try and broaden my outlets to check out for potential winners!\n\n", "id": "874fna", "created_utc": 1522018328.0, "score": 21, "upvote_ratio": 0.92, "num_comments": 35, "comments": [{"body": "I suggest reading \"Common Stocks and Uncommon Profits\" by Phillip Fisher. The book is mostly about this and Warren Buffett recommends it all the time. ", "score": 23, "replies": [{"body": "I have almost finished its audiobook by listening to it while driving. It may seem dry, but that's because this book has nothing more than pure wisdom and decent knowledge. But I think you mean the book is mostly about growth stock, finding them is in the last part of the book,", "score": 1, "replies": []}]}, {"body": "wistful grandiose sip direction skirt sulky offer lush hat gold\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 9, "replies": [{"body": "And what is it exactly you look for in the SEC files? Financial performance which you build you ratios based on?", "score": 1, "replies": []}]}, {"body": "If you keep an eye on IPOs which happen and research them enough then you'll find some gems for sure.\nCheck out the Chinese stock \"IQ\", they're getting listed (IPO) this week, they are the Chinese 'Netflix meets YouTube' kinda company..\n\nSince this is the first time I'm recommending it on Reddit, so let me setup a reminder.\nRemindMe! EOY\n\nEdit: corrected the symbol - stupid iOS autocorrect did it", "score": 5, "replies": [{"body": "Youre looking for \n\n!Remindme 9 months", "score": 3, "replies": [{"body": "Thanks! & !RemindMe 6 months", "score": -3, "replies": []}]}, {"body": "!RemindMe \n9 months\n", "score": 1, "replies": []}, {"body": "!RemindMe 6 months", "score": 1, "replies": []}, {"body": "what is the name of this company?", "score": 1, "replies": [{"body": "found it. the company is called iqiyi and its ticker is IQ not QI", "score": 2, "replies": [{"body": "Apologies..I'll correct my original comment...it was autocorrected incorrectly..lol!", "score": 1, "replies": []}]}]}, {"body": "!remindme 6 months", "score": 1, "replies": []}, {"body": "!RemindMe 6 months", "score": 1, "replies": []}]}, {"body": "I know I'm late to this post but try and look for companies that provides a service that is considered **cheaper, faster, and better**.\n\nThese are called \"market disrupters\" as they pull the rug out from underneath behemoths (NFLX - Blockbuster) (SHOP - Malls, Macys , Sears etc).\n\nThey do this by providing a service that will aide you quicker, will be perceived cheaper per the value you receive, and overall, considered better quality.\n\nThat, a sign of great leadership, and the proof of YoY growth (Sales, EPS, etc) and I believe you got a decent barometer of future success. ", "score": 4, "replies": []}, {"body": "I had read a big indicator is an increase in sales YOY. That and anything that has the potential to disrupt the current way of doing anything. It's still hard though--I mean Amazon's tagline used to be \"Earth's biggest bookstore\". Who the hell would've thought they'd be what they are today? Netflix started with just DVDs, who would've thought my TV could connect to the internet to watch movies? Obviously some people did, but it's not easy.", "score": 2, "replies": [{"body": "the same thing with uber. their intent was to claim the market until driverless cars became common", "score": 2, "replies": [{"body": "This is why I’m waiting on the Uber IPO to be honest. I have a hunch they will be considered a Wall Street tech darling that investors will flock to. Rational or not. Won’t matter if the stock keeps rising after IPO", "score": 1, "replies": []}]}]}, {"body": "You guys think Disney stock is going up after their video streaming service launches? I would imagine that will make them ridiculous amounts of money?", "score": 2, "replies": [{"body": "the question is what about the subscriber losses from ESPN?  I like Disney as a safer investment to netflix in case of major downturn but I am not sure if I will get much more than the dividend (1.7%) out of them for a while.", "score": 1, "replies": [{"body": "What do you mean subscriber losses from Espn. Won’t people hop on to watch Espn?", "score": 1, "replies": [{"body": "Well right now espn is losing subscribers. ", "score": 1, "replies": [{"body": "Oh. I think I knew that. But those that watch for the reality talk shows will still have to pay Disney right? And whatever sports they may occasionally show?", "score": 1, "replies": []}]}]}]}]}, {"body": "I think spotify will do pretty well.   Maybe not in the first 6 months after IPO, but should be okay.  They have heavy competition but a large enough user base to benefit from network effects.  Spotify and apple are basically taking over the jobs of record labels and helping independent artists plan tours.  Pandora can't claim that large of a disruption which is maybe why they haven't done as well.", "score": 1, "replies": []}, {"body": "Don't act on it but maybe read up on IPOs and micro/smallcaps.", "score": 1, "replies": [{"body": "I'm fairly new to the market I only have the robin hood app what small caps can be found on there? I feel that it's very limited to what you can invest on there...\n", "score": 1, "replies": [{"body": "If you're new to investing, I would recommend not investing in small caps. They do have a greater chance of growth but you can't really guarantee which of the small cap companies will mature into medium/large caps. \n\nHow long is your investing horizon and are you planning on trading or buying and holding?", "score": 1, "replies": []}]}]}, {"body": "You think Netflix and Shopify are hidden gems? Bruh ", "score": -5, "replies": [{"body": "No I’m saying... finding them before they became where they are today. Lol, AMZN was a hidden gem at one point too...", "score": 18, "replies": [{"body": "Netflix is an amazing service that has been killing big movie theaters for years, people invest, people make money. Online stores are growing bigger and bigger every year, Shopify has no big competitors, and they grow ", "score": 0, "replies": [{"body": "It's trending pretty low too right now my gf went crazy on Robin hood buying stocks all last week..", "score": 1, "replies": [{"body": "What did she buy in at? ", "score": 1, "replies": [{"body": "Sorry comment got removed she bought Shopify and a bunch of penny biopharms ", "score": 1, "replies": [{"body": "Careful with those penny biopharms, many of them don't pan out and lose money.  I am in on ATBPF.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They were at one point", "score": 1, "replies": []}]}]}
