{"title": "DD (FUEL) Rocketfuel fueling our next moon mission!", "selftext": "This is my first DD, and damn apps crashed on me twice writing this f'ing Thing, so here it is quick and dirty. It's off the top of my head. Not bothering exiting out again to get the exact stats for this to crash again. Gotta get up in 2 hours for market open and work tomorrow. I'll send you the links once I edit. \n\nEDIT: got the links out, going to bed now, have a good yolo guys.\n\n\nRocketfuel is a company that provides predictive marketing to businesses such as Bridgestone, Toshiba, UFC and many more notable businesses. It was founded in 2008 by Yahoo! Alumni and is based in Redwood City, California. It has with 20 other locations totaling 850+ employees in NA, Europe and Japan. Now Imagine if you search for furry porn on Friday night when your friends are out partying. Sunday morning your mom wakes you up because she saw naked bipedal foxes on her sidebar when she was searching for fuzzy kittens. That's basically what this company does.\n\n\n\nFinancials \n\n1.) Revenue: $450+ million\nIt's beaten the past few earnings by a few cents. Market cap is $180 million.\n\n2.) It's share price has dropped significantly since its IPO in 2013, from $60 something down to $4.50 now. However, its share price has gone up 160% in the past 3 months and don't seem to be slowing anytime soon.\n\n3.) It's EPS have been shitty, but not as shitty as expected. Actual eps has been -.22 instead of an expected -.25. Shitty, but it beat it.\n\n4.) Came across a this thread on Reddit last night, The US Senate votes to let ISPs sell your search data to advertisers. Could prove very fucking valuable to these guys.\n\n\nTHREAD:\n\nhttp://www.reddit.com/r/news/comments/613c7f/senate_votes_to_let_isps_sell_your_web_browsing/\n\nSource: \nhttps://arstechnica.com/tech-policy/2017/03/senate-votes-to-let-isps-sell-your-web-browsing-history-to-advertisers/\n\nLINKS:\n\nhttps://rocketfuel.com\n\nVideo of how big data and AI made Rocketfuel:\nhttps://youtu.be/LqjdfiWQJBs\n\nFinmiz:\nhttp://finviz.com/quote.ashx?t=FUEL\n", "id": "618amj", "created_utc": 1490353824.0, "score": 68, "upvote_ratio": 0.85, "num_comments": 72, "comments": [{"body": "Its name is fucking Rocket Fuel. I don't know what else you guys need. ", "score": 67, "replies": []}, {"body": "Well split my dick and call me Caitlyn.\nAll in", "score": 25, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "U'd no qwerbo", "score": 18, "replies": []}]}]}, {"body": "[Looks like I sold too soon](http://i.imgur.com/JNK2CMt.jpg), but what the hell. I made 9.5%.\n\nThanks op.", "score": 6, "replies": []}, {"body": "Made money by blindly following random DD on $MU yesterday. So fuck it, all-in. To the mooooon  \n\nEdit: holy shit. I love this subreddit. \n\nEditedit: omg what do I do with all these gainz? It's gonna take forever for me to slowly lose this money on dgaz/jnug.", "score": 14, "replies": [{"body": "Been following this for a couple of weeks, it looks promising good choice.", "score": 0, "replies": [{"body": "Why you no post about it? You bogarting the good DD?\n\nI thought this was America. How am I supposed to upwardly mobilize?", "score": 8, "replies": [{"body": "Can u explain DD to me plz", "score": 3, "replies": [{"body": "Due diligence, doing your homework on a company you wanna invest in.", "score": 3, "replies": [{"body": "Thx", "score": 4, "replies": []}]}]}]}]}]}, {"body": "i'll share some anecdotal: i spent around $25k with them on an e-commerce product launch in the past year. i could count the number of buyers they acquired for us on one hand. i did not re-up on the contract.\n\nthey're a leader in the space and have a solid client list and i'm only one client that ran one campaign, but i couldn't tell you i felt good about the money i spent with them. my more direct ad buys in targeted communities all performed better.", "score": 15, "replies": [{"body": "Theyre under completely new control with a new goals for 2017.  Check out the article business insider did on them in January ", "score": 10, "replies": [{"body": "i'll give it a read, thanks.\n\nhere's my issue with these services. they claim they can deliver targeted ads based on a profile they build of you through your browsing habits. think about how many random websites you wind up on through the course of the day because you saw some link on reddit or had to look up something for work or because your friend texted you this crazy thing you had to see. none of those links represent anything about you in terms of your buying habits, but all of that data will be used to create your profile for ad serving. \n\ni applied to a director of e-commerce role for a make-up company, weeks later i'm getting served ads for make-up sites. i don't buy make-up, i never will, but i'll be served hundreds of banners that the make-up companies pay for because my browsing history has me flagged as someone interested in make-up.\n\nthese companies take all data as equal. they have no good way to discern browsing because of potential purchase interest and browsing because i'm checking out weird shit i saw shared on facebook. and at the end of the day they're serving banners. banners that nobody clicks.\n\nnot saying the stock doesn't have upside from these lows, and i'm not saying fuel can't make money. i'm just saying this tech is not some wonderful crystal ball of customer behavior that they claim.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "who do you prefer in the space? not for investing, but for actual placements.", "score": 1, "replies": []}, {"body": "Same industry. Feels like race to bottom since media is a commodity. How is FUEL different than all the other DSPs out there? Mediamath, Dataxu, TradeDesk ($TTD), etc, etc. I think it's really just marketing material and the sales people pimping out the agency buyers. ", "score": 1, "replies": [{"body": "So how good are their pimps?", "score": 1, "replies": [{"body": "I know a few of the senior sales folks there, they are industry veterans and they wouldn't have left their previous roles doing similiar work to go on a sinking ship.  Still they are probably pulling in 300K+/yr+ because they know how to sell, don't know how much of an impact they have overall on FUEL though. ", "score": 2, "replies": []}]}]}]}, {"body": "What attribution system were you using?", "score": 2, "replies": []}]}, {"body": "ALERT: Rocket on its way down for the day.. \n\nI imagine new money's probably cashing out for the weekend. Buy @ end of the day or Monday for the dip if you're doing weekly trades. Probably gonna hit back to 5 for now.", "score": 9, "replies": [{"body": "Cashed out for double digit gains, take that index funds!", "score": 5, "replies": []}, {"body": "Just refueling on the way to Mars.", "score": 2, "replies": []}]}, {"body": "Thanks fam I'm up 8% on this dank investment  http://i.imgur.com/iLJtX79.jpg ", "score": 4, "replies": [{"body": "Haha nice man! Up 25% from yesterday. We're getting some Olive Garden for dinner bro 💸🔥🚀🌙 http://i.imgur.com/ICRd7wF.jpg ", "score": 5, "replies": []}, {"body": "up 14% now.. too bad my dumbass only bought 2 shares", "score": 2, "replies": []}]}, {"body": "I work in the digital ad tech industry, and just like pretty much everyone else, these guys are full of shit.  The tech that they have is exactly the same that everyone else has.  If there is anything proprietary, it was built for marketing to new customers and not to actually improve the campaigns that are run for clients.  Be wary of any ad tech spouting claims of impressively low CPA.  (Just look at the mess of Criteo and Steelhouse) They tried to game the system and got caught.  It's all smoke and mirrors.  \n\nAfter the massive layoffs a couple months ago, FUEL certainly seems to be headed in a better direction. However, don't think this is going to the moon.  If anything it could be a good long term play, as long as the new CEO keeps working to unfuck the company. \n\n ", "score": 7, "replies": [{"body": "Get that lumascape chart showing all the players in the space. Media selling is a race to the bottom. Might be good time for Puts on $TTD as well. ", "score": 1, "replies": [{"body": "So the difference is that FUEL isn't a DSP.  FUEL is an ad tech who white labels other DSP tech.  I've heard, though I can't confirm, that in fact they use the Trade Desk with an algorithm on top of it.  This is a pretty common thing with larger companies that are also agencies.  \n\nMedia selling is, in some capacities, a race to the bottom.  But more and more brands know that dirt cheap RTB is only going to net them fraudulent traffic.  (Of course some brands don't give a shit.  Give em a good viewability number and they call that success.)  TTD is a true DSP, one that has unique offerings that other DSPs don't have.  Combine that with the increasing popularity of exclusive PMP deals, the rise of programmatic audio, native ads, and programmatic TV, there's plenty of room for a DSP to innovate and grow.  Now should it have run to $45? No way, but it'll settle down and then see nice slow growth over time. \n\nBut to your point, there are plenty of companies on the lumascape that are starting to sweat.  ", "score": 1, "replies": [{"body": "Bullshit. RF does not use TTD technology.", "score": 1, "replies": [{"body": "source?", "score": 1, "replies": []}]}]}]}]}, {"body": "OP HERE.\n\nFuck, woke Up late.. Missed most of the run. All in now though. $2k baby. http://i.imgur.com/u3EHaSo.jpg ", "score": 3, "replies": [{"body": "Got innit for 350 this am. Thanks for not being a fgt", "score": 3, "replies": []}, {"body": "Aaaand its gone", "score": 1, "replies": [{"body": "I'm blindly following OP. True autistic.", "score": 3, "replies": []}]}]}, {"body": "Today OP was legit. Thanks broski 👌", "score": 4, "replies": []}, {"body": "Holy fuck I think you might be onto something here. From what I read, the company is fine, but the old managment sucked. They've since brought on CRO Rick Song, and Dave Gosen who previously worked at Nielson and Microsoft. This gives them the connections they need to make a profitable business. They're building the important relationships in the industry that are going to make them succeed. \n\nEdit: Options are cheap as fuck this could be a goldmine", "score": 3, "replies": []}, {"body": "To the Hubble Deep Field.", "score": 2, "replies": []}, {"body": "All right you convinced me in at 5.10 let's literally go to the moon 🚀🚀", "score": 2, "replies": [{"body": "Same. Ouch.", "score": 2, "replies": [{"body": "Sold at $5 didn't like the price action after dropping from 5.30s :( didn't wanna get stuck bagholding should've yoloed HGTM this morning ", "score": 1, "replies": []}]}]}, {"body": "fuck, in at 4.65 earlier, out, then back in double at 5.14 on its way down... now im pissed lol. bag hold this shit?\n\nedit: i guess im holding...", "score": 2, "replies": []}, {"body": "Bought 200 shares @4.86 without even clicking the links. Am I doing this good guys?  \nEdit: another 100 @5.10  \nEdit: another 200 @5.25  \nhttp://imgur.com/a/kt68d", "score": 3, "replies": [{"body": "rip", "score": 4, "replies": [{"body": "buy high sell low 24/7", "score": 8, "replies": []}]}]}, {"body": "If you read the screenshots those are the recent headlines. Recent partnering with IBM, 2nd picture is 3 months stats. \n\n http://i.imgur.com/h7yU4le.jpg http://i.imgur.com/SHIxsA6.jpg ", "score": 2, "replies": [{"body": "Proof to mods that I actually do have money in this, albeit only $100. http://i.imgur.com/OOARaO0.jpg ", "score": 3, "replies": [{"body": "12% return for $12...\nOhh man that hurts hahaha\nSolid DD though ", "score": -1, "replies": [{"body": "Green is green breh", "score": 3, "replies": []}, {"body": "Got to start somewhere", "score": 1, "replies": []}]}]}]}, {"body": "What kind of time horizon are we looking at with these guys tho? Sure they have recovered nicely and they are making the connections but they are also at their 52 week high, what will drive them to the moon?", "score": 2, "replies": [{"body": "If they are able to deliver they could be a buyout target.", "score": 2, "replies": [{"body": "Its pretty much at its fair valuation done by morning star. I dont know much about the company besides the google search and whats been posted. \n\nDo you have potential to go well above the $5 threshhold?", "score": 2, "replies": []}]}]}, {"body": "Plot twist: op is running a pump n dump", "score": 2, "replies": [{"body": "Totes, on my own account with Nug and JDST.  http://i.imgur.com/QTYXwg6.jpg ", "score": 5, "replies": []}]}, {"body": "I'm already up 6%, thanks OP", "score": 1, "replies": []}, {"body": "TY op . Bought at +4% when I read this. Up 11% now. Wsb making good suggestions what's going on????", "score": 1, "replies": [{"body": "haha thanks man and congrats! Well, we're all retarded here.. Given enough balls and swings he'll hit a home run eventually. \nJust got lucky trying to find oil and gas stocks. I'm not actually good at this shit lol, beginners luck.", "score": 2, "replies": [{"body": "Unfortunately I'm a pattern day trader and a robonhood fag or I would take this quick 9.5% profit I have right now. But maybe it's a good thing and we'll be higher by Monday. Probably not tho with my luck I'll just watch it all disappear plus some as robinhood buttfucks me slowly ", "score": 1, "replies": []}]}]}, {"body": "Trending on stocktwats. Good work, OP. Made me 50 bucks.", "score": 1, "replies": []}, {"body": "Hesitated at 5.05 thinking it was at the peak.  Still climbed up to 5.15 and hesitated further.  Fuck it, in at 5.20 and out with half my shares at 5.30.  Will see where the rest goes next week.  ", "score": 1, "replies": []}, {"body": "Is it too late to get in on the fun?", "score": 1, "replies": [{"body": "No. It's been crawling up the $4-$4.10 mark all week before the jump. I'd wait for it to settle price a bit and buy Monday or Tuesday... Then hold a week see what happens.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "I am a bag-holder on this, in @ $15 not leaving any time soon.", "score": 1, "replies": []}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Fuck you.  I'm in.", "score": 1, "replies": []}, {"body": "In for $300.  Will this be enough for me to Neil Armstrong?", "score": 0, "replies": []}]}
