{"title": "AMD to $70 before MU?", "selftext": "What the actual fuck is going on. My and puts are garbage and my MU calls are in the hot seat. FML.", "id": "8s09u8", "created_utc": 1529334819.0, "score": 151, "upvote_ratio": 0.94, "num_comments": 43, "comments": [{"body": "I should have flipped my MUSQ ratio, and I'd be set by now", "score": 40, "replies": [{"body": "Elon Musq?", "score": 10, "replies": [{"body": "MU and SQ is the Musq index. I also like ELON Estee Lauder and ON semiconductor. Lol im autistic. ", "score": 5, "replies": []}]}]}, {"body": "If you're in for short term I would get out now ish. Long term you shouldn't dream about selling till 2021\n\nEdit*\nFor AMD that is. ", "score": 45, "replies": []}, {"body": "THANKS FOR FUCKING UP MY FAGGIES ON FRIDAY, AMD, YOU FUCKING PIECE OF SHIT. COULDN'T FUCKING MOON THEN, COULD YOU?\n\nFuck this company.", "score": 28, "replies": [{"body": "Ignore my reply on the other thread haha", "score": 3, "replies": [{"body": "Yeah, they expired Friday. Otherwise I'd have gone down with the ship and popped back up today.", "score": 2, "replies": [{"body": "Yeah that’s unfortunate. We need SOGO to go back down for a little bit", "score": 3, "replies": []}]}]}]}, {"body": "FU, I sold my AMD at $16.70. If it goes to $70 I'll cry myself to sleep...", "score": 8, "replies": [{"body": "I sold my 17 dollar 6/22 calls this morning when it dipped", "score": 3, "replies": []}, {"body": "never cry about gains.", "score": 1, "replies": [{"body": "I find gains that could have been so much harder to digest then even the loses. Case in point, I was staring at Nvidia when it was at $28, cheaping about and waiting for it to drop to $26 before jumping in. You know how long it took me to get over it? I'm still seeing a therapist...", "score": 2, "replies": []}]}]}, {"body": "Why do you keep putting AMD?", "score": 12, "replies": []}, {"body": "Grabbed some FD puts", "score": 7, "replies": [{"body": "same my dude gl on your yolo", "score": 2, "replies": [{"body": "Samesies", "score": 2, "replies": [{"body": "already sold all my puts except for one at a cool 10% profit... so if yall make it to the moon tomorrow ill be watching from earth :(", "score": 1, "replies": []}]}]}]}, {"body": "Just wait, AMD will drop, if they didn't take profits after that run up, they are literally all retarded.. it will slowly drop now and they will miss that profit those who didn't take it.", "score": 18, "replies": [{"body": "You sure about that? This whole sub has been saying puts for weeks and it’s been going parabolic ", "score": 72, "replies": [{"body": "I think most ppl arn't buying them far enough out. ", "score": 13, "replies": [{"body": "People need to realize its usually near earnings where the drop is. Buy your puts 7/6 and 8/17", "score": 5, "replies": [{"body": "I like the couple weeks after earnings, skip the IV and time decay doesnt fuck you. Octobers for me", "score": 6, "replies": []}]}, {"body": "I got 17Jan puts. No worries yet. ", "score": 8, "replies": [{"body": "This is retarded", "score": 4, "replies": []}, {"body": "I like those too", "score": 1, "replies": []}]}]}, {"body": "It will try to push back up some, but no way it hold up there. Watch the options grid. I want you to notice how many calls compared to puts and at what strikes. Especially on the 22nd june date.", "score": 1, "replies": [{"body": "People are speculating that Intel is gonna shit hard this year. Yet they forget they over pumped AMD. Watch AMD just beats inline or slightly above estimate. Shit is gonna get ugly.", "score": 4, "replies": [{"body": "I just think AMD will head back to $16's. that's all I'm saying. ", "score": 2, "replies": [{"body": "If u r long, it doesn’t really matter :/\nU can’t always time the market. The only thing you can do is to hedge. Sell calls and buy puts. Remove the collar when shit finally cools down. ", "score": 3, "replies": []}]}]}]}]}, {"body": "Personally I hope it drops cause I didn’t but enough shares last time.", "score": 1, "replies": [{"body": "Ditto. Set my stop fairly high and secretly hoping it goes back to $9 again so I can ride along with more in the wagon next time.", "score": 4, "replies": []}]}]}, {"body": "probably", "score": 2, "replies": []}, {"body": "maybe 70 cents", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "But it just did. So you're saying it definitely won't", "score": 2, "replies": []}]}]}, {"body": "Fucking closed my calls on Friday right before close thinking it was too risky to hold through the weekend...was fucking up 75%...would have been 250-300% today", "score": 1, "replies": []}, {"body": "This place is historically home to AYYYYYMD permabulls. Gotta let us get our hopes up.", "score": 1, "replies": []}, {"body": "this is a true fag", "score": 1, "replies": []}, {"body": "Jajajaja... You nailed it.. ", "score": 0, "replies": []}, {"body": "BIG IF TRUE", "score": -1, "replies": []}]}
