{"title": "Did a major shakeup to my Growth Portfolio. Thoughts?", "selftext": "[deleted]", "id": "n8ip85", "created_utc": 1620580525.0, "score": 8, "upvote_ratio": 0.8, "num_comments": 40, "comments": [{"body": "You’re dreaming if you think you’ll get 18 to 20% consistent returns over 10 years.  Especially with a lot of those picks.", "score": 13, "replies": [{"body": "What could I modify? Keep in mind I am buying a lot of dips by adding more consistently. Any other positions to add? Cathy Woods is now projecting 30% returns for ARK from now through 5 years based on CNBC yesterday.", "score": 2, "replies": [{"body": "My first bit of advice is to stop following Cathie Wood. She’s a huckster who picks stocks based on the Bible.  Her funds will end in blood and tears, for which I’m bound to be downvoted here.  \n\nVTI, VXUS, and maybe some sector allocations like VGT. Set and forget.  And forget ARK especially.", "score": 10, "replies": [{"body": "Yet her ark funds return double what vti does.", "score": -1, "replies": [{"body": "A rising tide lifts all boats. Let’s see how she does when the growth engine stops. At this rate, she’ll own all of Palantir at that point because she knows of nothing else to buy.", "score": 1, "replies": [{"body": "You really think in 5-10 years technology will not be better?", "score": 1, "replies": [{"body": "Technology will be better, but a broad based index like VGT is better. Not Cathie Wood’s overpriced bets on coinbase, palantir, and Tesla.  She’s indiscriminately throwing money at these stocks when the nasdaq in the long run will outperform her", "score": 2, "replies": [{"body": "Vgt is good but Ark has out performed since inception.\n\n10 minutes on ark's website should help you understand the strategy.\n\nArk Is forward looking and they use exponential trends to realize bigger gains.", "score": 1, "replies": [{"body": "More like exponential losses. But no matter how many times people explain that investing in a managed fund where 9/10 of the companies haven’t got positive net income isn’t a good idea. That’s a good point, like valuing Tesla with 0 competition and that they will own 100% of all robo taxi revenue by 2030 to justify their price targets. But hey if you wanna risk it with some chick that thinks it’s gods plan to pump up the micro stocks she invests in go ahead.", "score": 2, "replies": [{"body": "How can you say exponential losses? Arkk has greater returns than any passive index fund. \n\nI'll gladly pay .75% a year for some professional to do research for me.", "score": 1, "replies": [{"body": "Over what, 3 years? The market has highly favoured Tesla and the recent year or 2 these highly speculative companies that are so overpriced it makes my head hurt. Only time will tell but unfortunately I don’t think luck is on her side once we experience an actual large drawback in valuation.", "score": 2, "replies": [{"body": "The fund has been around for 6.5 years. The average return is 30% per year. Spy is 14% in the same time frame. \n\nArkk may underperform for a year or two but then they have a massive bullrun. \n\nLook at 2017 they ran up +80% that year.", "score": 1, "replies": [{"body": "Exactly. We have been in a bull run for the last 10 years. Not a good comparison. Just look at every other managed fund. They might outperform for a little bit but in the long run they simply cannot.", "score": 2, "replies": [{"body": "So I can't compare arks performance to spy but you can compare ark to other active funds?\n\nHow many of these active funds focus on disruptive innovation?", "score": 2, "replies": [{"body": "No that’s not what I said. I said you cannot compare the performance of a fund that’s only been out for 6 years and in the peak of the biggest bull run we have ever had. That’s why I said you have to look back at other managed funds.", "score": 1, "replies": [{"body": "Okay. Saying Ark will fail because other managed funds failed is not a good argument.", "score": 1, "replies": [{"body": "Not other just some. Every other one. And these are ones where the company actually turned a profit", "score": 1, "replies": [{"body": "Unless you provide examples I got nothin", "score": 1, "replies": [{"body": "This guy is obviously anti-Ark. the thing is - she’s a lot smarter than most random strangers on Reddit and so I’m going to trust her with my money. Ark is higher risk but that’s why a smaller percentage of my portfolio is invested in them.", "score": 1, "replies": [{"body": "I don't even know how this is a discussion point every freaking time - note I just read through the entire chain and just reply here.\n\nWhenever I read arguments, let it be pro or contra, the comparison to other things is so stupid in many cases. What she does is a more risky version of just investing into all top companies, but if you look at more risky ETFs they bounce harder but do better, and what actually happens there goes way beyond the understanding of what 99.99999% of the people here have. The capital and technology exceeds by far what we have available yet people talk about it as if they were the manager themselves. \n\nWhat she does is a good strategy but the \"issue\" is that it will always fall harder when the market doesn't favor growth stocks, but outperform heavily when it does. People will be salty when they bought at heights like in February and now sit on a negative, but if they are in for the long run that won't matter.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "You mean her bets that won and outperformed VGT?", "score": 1, "replies": []}]}]}]}]}, {"body": "RemindMe! 3 years", "score": 1, "replies": [{"body": "There is a 9 hour delay fetching comments.\n\nI will be messaging you in 3 years on [**2024-05-10 03:03:16 UTC**](http://www.wolframalpha.com/input/?i=2024-05-10%2003:03:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/n8ip85/did_a_major_shakeup_to_my_growth_portfolio/gxkg08k/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fn8ip85%2Fdid_a_major_shakeup_to_my_growth_portfolio%2Fgxkg08k%2F%5D%0A%0ARemindMe%21%202024-05-10%2003%3A03%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20n8ip85)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Add UWMC 6% dividend and price target about 80% higher than current level.", "score": 2, "replies": []}]}, {"body": "Lmao Yeap the shit you see. George Soros would hire you instead", "score": 1, "replies": []}]}, {"body": "I say add some green energy, or environmental stocks. Since covid I find that climate change and the environment has been put on the back burner IMO. That being said clean energy and environmental stocks are still the future and many front runner company’s have a lot of room to grow!", "score": 3, "replies": [{"body": "Can you recommend some names?", "score": 1, "replies": [{"body": "I like Xebec (XBC.TO), and Greenlane (GRN.TO). Both these I would say are medium risk, others might think different, so do your own DD. As you can see I’m from Canada lol.", "score": 3, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}]}, {"body": "Your MSFT is too concetrated. I suggest shipping etf or stocks.  In railroad industry they have no competition. I like retails, and oil stocks or funds as the economy opens up....", "score": 2, "replies": [{"body": "Thank you. Any specific recommendation on that? And should I consider CPSH or is it too speculative?", "score": 1, "replies": [{"body": "Speculative", "score": 1, "replies": []}]}]}, {"body": "Classifying individual stocks into low, medium, and high risk tells me you don’t understand risk.", "score": 0, "replies": [{"body": "I classify risks in two different ways: \n\n1) Across my different portfolios. I have a conservative low-risk portfolio and this growth higher-risk portfolio. With\n\n2) Within the portfolio, the individual stocks I selected are bucketed into high, medium, low based on how much downside risk I have in relation to the current portfolio. It is relative. \n\nWhat improvements would you suggest?", "score": 1, "replies": []}]}, {"body": "You jerk off to Cathie Wood? lmao… \n\n“trimmed my speculative positions […] and doubled down on some of my high conviction names” \n\nTake her pussy out of your mouth.", "score": 0, "replies": [{"body": "wtf man you sound like cathie killed your cousin or something haha", "score": 1, "replies": [{"body": "I’m just razzing OP since he’s quoted her word-for-word…. In HIS investment strategy, as if anyone actually would double down on speculation when trying to be risk averse.", "score": 1, "replies": []}]}]}, {"body": "I am bag holding IPOx never again listen to that snake oil man. If I break even on his and others I am greatful.", "score": 1, "replies": [{"body": "What exactly did he ever say to you to make you baghold exactly?", "score": 1, "replies": []}]}, {"body": "18-20% in a given year? Sure. But you're expecting18-20% over ten years? Bernie Madoff didn't promise people returns at that level.", "score": 1, "replies": []}]}
{"title": "Wall Street Week Ahead for the trading week beginning May 10th, 2021", "selftext": "Good Sunday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 10th, 2021.\n\n# **Inflation is the big challenge for markets and the Fed in the week ahead - [(Source)](https://www.cnbc.com/2021/05/07/inflation-is-the-big-challenge-for-markets-and-the-fed-in-the-week-ahead.html)**\n*****\n> After April’s disappointing jobs report, market focus will shift squarely to inflation in the week ahead.\n*****\n> The tug-of-war over tech stocks will also continue to be a dominant force in the stock market, after Friday’s bounce more than halved the week’s losses in the S&P technology sector.\n*****\n> The April employment report was extremely disappointing with just 266,000 jobs created, well below the 1 million expected. The Friday report cast doubt on the expectations of some investors that the Fed will move toward paring back its so-called quantitative easing bond purchases later this year.\n*****\n> The thinking is if the inflation data appears hot when the consumer price index is reported Wednesday, it could ignite the debate about whether the Fed will have to tighten policy sooner than it would like. For now, the market is viewing the April jobs data as a distorted one-off report.\n*****\n> “It’s all about the inflation numbers. It’s all about the transitory nature and to what extent we’ll see it,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group “It’s more relevant to the CPI month-over-month changes. If the month-over-month gains are starting to pick up steam, and we’re seeing 0.3% to 0.4%, that’s not transitory and that’s a problem for the Fed.”\n*****\n> Economists expect April CPI to rise 0.2% over March, after a gain of 0.6% the month earlier. But on a year-over-year basis, CPI is expected to look sizzling, jumping 3.6%, according to Dow Jones. That compares to 2.6% the month earlier. Excluding food and fuel, CPI is expected to rise by 0.3% on a month-over-month basis.\n*****\n> The central bank has maintained that the pop in inflation is expected to be transitory.\n*****\n> Multiple Fed speakers are on the calendar, including Vice Chairman Richard Clarida, who speaks a half-hour after the CPI print Wednesday. Other officials speaking include Federal Reserve Board Governor Lael Brainard, New York President John Williams and Dallas Fed President Rob Kaplan.\n*****\n> The producer price index is reported Thursday, and that should confirm a trend of higher prices that is showing up in corporate earnings releases. Another important data point, retail sales is released Friday.\n*****\n> Boockvar said the retail sales report is not as important since it has been artificially boosted by one-time stimulus checks.\n*****\n> “It’s like the steroid era of baseball,” he said. “Who knows how many home runs it would have hit without stimulus.”\n*****\n> # Tech battleground\n> The S&P 500 and Dow finished the past week with gains. The S&P rose 1.2% to 4,232, and 2.7% to 34,777. But the technology-laden Nasdaq fell about 1.5% to 13,752, even with Friday’s 0.9% gain.\n*****\n> In the commodities market, fears of inflation continued to build.\n*****\n> Copper futures hit a record high, as did lumber futures, rising 13% in the past week. Corn futures rose 8.6% in the past week, finishing at the highest level since 2013.\n*****\n> West Texas Intermediate crude futures gained 2% to $64.90 per barrel.\n*****\n> The 10-year note yield, which moves opposite price, was at 1.55%, down from 1.63% a week ago.\n*****\n> Commodities fueled gains in the stock market this week, with the S&P energy sector by far the best performer, up 8.9%. Materials rose 5.9%, followed by financials, which were up 4.2%. Industrials gained 3.4%. But the S&P technology sector slumped 0.5%, for the week even with a 0.8% gain Friday.\n*****\n> “I think one thing that people are overlooking is that the technology selling we’ve seen in the last few days...is not just the reaction to the adverse earnings price reactions that we saw from certain tech names,” said Julian Emanuel, chief equity and derivatives strategist at BTIG.\n*****\n> “But it’s also this idea in that in a world where we assume capital gains taxes could go up, that’s where the capital gains lie,” he added. “So they are likely to come under incrementally more pressure on that basis.”\n*****\n> President Joe Biden has proposed raising capital gains taxes to 39.6% for taxpayers making more than $1 million. That’s up from the current top rate of 20%.\n*****\n> Emanuel said the upcoming federal income tax return filing date of May 17 could also be adding pressure to technology, since investors may be selling winners to pay their taxes.\n*****\n> “With the tax bill coming due on May 17 for the 2020 calendar year, people are just going to use it as an excuse within the context of higher capital gains taxes to sell those stocks to pay for their tax bill,” Emanuel said. “I think people are overlooking this as part of the reason.”\n*****\n> Boockvar said tech names could also face further headwinds from higher interest rates, particularly if inflation data is hotter than expected.\n*****\n> “I think the last couple of weeks tells you froth is coming out of the most expensive part of tech and earnings for the big cap names are as good as it gets in terms of growth rates. The market is telling you that,” he said. “If you get a further move in rates, that’s a headwind.”\n*****\n> Earnings season continues in the week ahead though most of the rush is over for the quarter. Disney, Marriott, Wynn Resorts, Airbnb are among the companies reporting that should provide insight on the economic reopening.\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cUOD0tT.png))**\n\n# **S&P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/VKhtBNU.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HRLJN3b.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/hjmVj8H.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/S48iOLd.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qIgYv0k.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uOMQGUs.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OWLEQXc.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qiXLhQt.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t2D133W.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5R0emOO.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ZR1CoYl.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/XWzfbs8.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/yIN4N15.png))**\n\n*****\n\n> # ARKK Stocks Breakdowns and Bounces\n\n> After struggling for most of the past couple months, momentum and Tech stocks are broadly outperforming today as the Nasdaq is up 1.25% compared to a 0.78% gain in the S&P 500. The ARK Innovation ETF (ARKK) has been a poster child of the momentum theme over the past year. After a 383.9% gain from the March 2020 low to its high in mid-February, ARKK has fallen around 30% in the months since then. For most of that time, the ETF consolidated between its 50 and 200-DMA. After a failed attempt to break above its 50-DMA at the end of April, it has taken a leg lower, falling below its 200-DMA for the first time in a year in the process. While ARKK has yet to move back above its 200-DMA, it has found support around $105 which traces back to the lows earlier this spring and the highs from the fall. In other words, from a technical perspective ARKK, as well as some of its holdings, still have plenty of technical hurdles including moving back above its moving averages and breaking the past few months' downtrends. At least for the time being, the group has found some respite in the move higher today.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK.png))**\n\n> As for the individual holdings of the ARKK ETF, below we show the 25 largest which accounts for approximately three-quarters of net asset value. For the most part, these stocks continue to sit on huge gains from the past year (or since their market debut for those that have IPO'ed in the past year; bolded and bordered rows in the table below) with only a small handful in the red: Teladoc (TDOC), Coinbase (COIN), and Iovance Biotherapeutics (IOVA). Even though the 25 largest ARKK holdings are on average up 117% over the past year, they have certainly been a pain trade recently. Most of these names are deeply oversold at the moment, and relative to their 52-week highs, they are down 35% on average. In fact, of all 58 holdings, there are only four—Intercontinental Exchange (ICE), TuSimple (TSP), Trimble (TRMB), and PACCAR (PCAR)—that are less than 10% below their 52-week highs, and none of these break into the top 25 largest holdings (as such they are not pictured below).\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Table.png))**\n\n> While ARKK holdings have generally been weak over the past few months, in recent days there have been some notable developments in the charts of these names. Some of these like CRISPR Therapeutics (CRSP) and EXACT Sciences (EXAS) have fallen below the long-term 200-DMA. Other names in the ETF broke below their 200-DMA a while ago now, and their charts do not look much better. Stocks like Invitae (NVTA), Materialise (MTLS), and Teladoc (TDOC) collapsed below their long-term moving averages earlier this spring and this week's moves lower have resulted in breaks of critical support levels. For TDOC and MTLS, those levels have previously marked support at multiple points in the past year. One other interesting name in terms of performance today is Regeneron (REGN). Unlike many other ARKK stocks, REGN has actually been trending higher since March, albeit that is in the context of a much longer-term downtrend than many other ARKK holdings. Regardless, that recent rally has resulted in the stock to run right up to its long-term downtrend. In another move that is out of sync with its peers, today it has reversed lower, failing to break out from that downtrend.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Below1.png))**\n\n> While most names have pulled back sharply and continue to trend lower to sideways at best, that is not to say all ARKK stocks have entirely negative charts. Similar to the ETF's chart, there are several names that have found support in the past couple of days. For example, DocuSign (DOCU), Iovance Biotherapeutics (IOVA), Palantir (PLTR), and Spotify (SPOT) are all bouncing off critical support levels of the past year. For others like Fate Therapeutics (FATE), Iridium (IRDM), PagerDuty (PD), PACCAR (PCAR), and Synopsis (SNPS), those support levels have also coincided with their moving averages. PACCAR is also notable in that it is even breaking back above its 50-DMA today. Similarly, Novartis (NVS) is attempting to move back above its 200-DMA. Perhaps one of the most technically strong stocks of these has been Sea Ltd (SEE). Over the past year, the 50-DMA has consistently provided reliable support. After a brief dip back below in March, in April it moved back above its 50-DMA and has once again successfully retested in the past week.\n\n> In order to keep track of the ARK Innovation ETF's (ARKK) holdings, we created a custom portfolio that members can add here. Please note that this does not update real time and is only based on ARKK's holdings as of 5/6/21.\n\n> As always, investors should do their own research before buying or selling any securities, and this chart analysis is in no way meant to be a buy or sell recommendation.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Pos1.png))**\n\n*****\n\n> # Commodities Soar to Five Year Highs\n\n> As talk of inflation continues to heat up, one asset class fueling the fire has been the commodities complex. In our one-year review of the market low, we noted how commodities had been some of the biggest winners during the market recovery. Well that trend hasn’t stopped yet, and as shown in the chart below, on Wednesday, the Bloomberg Commodity Index closed at its highest level since August 2015.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/Blog-5.7.21-a.png?ssl=1))**\n\n> Whether this strength flows through to CPI or Core PCE (the Federal Reserve’s preferred measure of inflation) remains to be seen, but the technicals suggest this move could just be getting started. WTI crude oil is on the verge of breaking above a level of technical resistance that capped prices in 2019, while copper prices are less than 3% from their 2011 all-time highs. However, those who thought gold would benefit from inflation fears have been mistaken. In fact, of the 23 commodities tracked in the Bloomberg Commodity Index, gold is the worst performing year to date and one of the few that is actually negative over that time period.\n\n> To be clear, we are not calling for runaway inflation. In fact, breaking to five year highs shows that broadly commodities have gone nowhere over that time period. However, we do continue to have a bullish view of energy and industrial metals and wouldn’t be surprised to see this trend continue, albeit likely at a slower pace than the past year. If prices do continue to rise it may put more pressure on companies who are not able to pass those costs onto consumers. But if companies are broadly able to pass these increased input costs along, then expect price increases to begin showing up in traditional inflation measures, but any persistent impact is likely to be modest. Be sure to check out the LPL Research blog next Wednesday, as we examine the April CPI data release.\n\n*****\n\n> # April Jobs Data Disappoints Lofty Expectations\n\n> Investors betting on a continued acceleration in U.S. payrolls in April following March’s impressive numbers received an unwelcome reminder of just how choppy the data can be month-to-month.\n\n> The U.S. Bureau of Labor Statistics released its monthly employment report this morning, revealing that the domestic economy added only 266,000 jobs in April, well below Bloomberg-surveyed economists’ median forecast for a gain of 1,000,000. The prior two months also received net negative revisions of 78,000 jobs. The unemployment rate unexpectedly rose to 6.1% from 6%, though that was paired with an above-estimate gain in the labor force participation rate, which moved from 61.5% to 61.7%, equaling a recovery high. Average hourly earnings rose 0.7% month over month, signaling lower-wage workers did not rejoin the workforce to the degree expected.\n\n> Anecdotal commentary provided by companies in recent months detailing their difficulty finding qualified job candidates evidently worked its way into the data this month in a big way. There are a few explanations for why this might be. Enhanced unemployment benefits may reduce the urgency for some to return to work. Additionally, still-closed schools and lack of child-care may make it difficult for workers to return to the in-person segments of the labor markets. And finally, March’s big jump in payrolls may have represented a rehiring of workers with whom hiring managers already had relationships, such as furloughed employees. Hiring new workers requires a more rigorous, and time-consuming, vetting process.\n\n> As seen in the LPL Chart of the Day, April bucked the reacceleration trend seen off the December 2020 low. Total payrolls still sit about 8.2 million below the February 2020 peak of 152.5 million, but we are still very optimistic about our ability to recapture the lion’s share of those losses quickly despite today’s disappointing readout.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.7.21-Blog-CHart.png?ssl=1))**\n\n> “The job market got a bit of a reality check this morning,” explained LPL Financial Chief Market Strategist Ryan Detrick. “While we always caution against reading too far into one data release, we think most of the cited factors that suppressed April’s payroll number should wear off naturally with time. We believe that despite April’s speedbump the overall trend will be higher from here.”\n\n> Given the magnitude of the total loss that still needs to be recovered and the varying degrees to which parts of our economy are currently open, we believe jobs data will carry the potential for strong upside surprises for at least the next several months. Improving employment trends—though choppy—buoy consumer strength, and the economy overall, given consumers’ large weighting in the calculation of gross domestic product (GDP). As such, we continue to recommend positioning portfolios to take advantage of these trends, where appropriate, including an overweight allocation to equities relative to benchmarks, and a tilt toward sectors that may benefit more from a continued cyclical upturn\n\n*****\n\n> # Let’s Talk About Stocks And Higher Taxes\n\n> Our new Constitution is now established, everything seems to promise it will be durable; but, in this world, nothing is certain except death and taxes,” Benjamin Franklin\n\n> First off, we hope everyone has a happy and safe Cinco de Mayo!\n\n> One of the big discussions lately has been about how will higher taxes potentially impact the stock market. We’ve known since President Biden won the presidency and the Democrats secured control of the House and Senate that higher taxes were coming, likely in the form of higher corporate taxes and higher capital gains taxes on the wealthy—though probably not until 2022. It is worth noting though that stocks haven’t been fazed at all by all the higher taxes talk, as we just saw the best first 100 days for stocks under a new president since FDR.\n\n> With proposals for the $1.8 trillion American Families Plan (AFP) and $2 trillion plus infrastructure bill (known as the American Jobs Plan or AJP), higher taxes are needed to help finance the new spending. Let’s be clear though, with a 50/50 Senate (Vice President Kamala Harris breaks ties) and historically slim Democratic majority in the House, we think these final numbers will likely come in less than $3 trillion combined, as these initial numbers from the Democrats are starting points for negotiations.\n\n> Higher capital gains taxes on the wealthy are one way to pay for things, with the AFP proposing to increase the top tax rate on ordinary income to 39.6% from 37%, and capital gains and dividends taxes on those who earn more than $1 million to a maximum of 43.4% from the current 23.8%. Fun stat, only 0.32% of the population makes more than $1 million a year, so the truth is this won’t impact the other 99.68% of the population.\n\n> “We’ve known higher taxes were coming so this shouldn’t be a surprise to anyone at this point,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Now here’s the catch, looking back at the times that taxes increased amid a strong economy, stocks did just fine. Given the strong economic outlook this year, you’d have to think history could repeat once again.”\n\n> As shown in the LPL Chart of the Day, in 1986 and 2013, capital gains taxes increased, but the economy was on firm footing back then, compared with the 1970s hikes, which saw an economy marred by higher inflation and sluggish growth. Not surprisingly, the two more recent hikes saw solid stock market performance, while the 1970s hikes didn’t. Is it as simple as how the economy is doing? It very well could be.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-1.png?ssl=1))**\n\n> Corporate taxes are currently 21% and President Biden has discussed increasing the level to 28%. Although we think in the end the level will be more like 25%, the bottom line is higher corporate taxes are likely coming, which could knock a few percentage points off of future S&P 500 Index earnings growth.\n\n> So what happens after corporate taxes are raised? As the table below shows, muted returns a year out are normal, but interestingly stocks have consistently been in the green the three months before the official date of the tax increase, suggesting investors weren’t very worried about higher taxes on the horizon.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-2.png?ssl=1))**\n\n> It’s always possible that higher taxes slowly take a bite out stock market returns over a longer time period than just a year, but if the concern is what all the talk about higher taxes may mean for markets over the next year, there’s not much historical evidence pointing to the potential for a bad outcome. The picture is murkier, though, with corporate taxes, which isn’t surprising, since stock prices are ultimately tied to earnings growth. But is often happens, markets seem to be more attuned to larger economic forces.\n\n*****\n\n> # Individuals, Writers, and Managers All Still Bullish\n\n> The major indices are broadly lower in the past week with the exception of the Dow which has risen just over 1%. The Nasdaq on the other hand has been the worst performer falling almost 3%. Even though the major indices are split in terms of performance, sentiment has gone the way of the Dow as bullish sentiment as measured through the AAII weekly survey rose 1.7 percentage points to 44.3%. While not a particularly large increase, this week did mark the first time bullish sentiment has risen in a month.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull.png))**\n\n> With bullish sentiment higher, fewer respondents reported as bearish. Only 23.1% of investors reported pessimistic sentiment; down 2.6 percentage points versus last week's reading. Just like bullish sentiment, that was not a particularly large change, and it leaves the reading in the middle of the past several weeks' range.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bear.png))**\n\n> The inverse moves in bullish and bearish sentiment resulted in the bull-bear spread climbing 4.3 points to 21.2. While that is still at the high end of the past few years' range, it is 11 points below where it stood only two weeks ago. Looking at another sentiment survey from Investors Intelligence which targets equity newsletter writers, the bull-bear spread also rose slightly week over week leaving the spread well below levels from only a couple of weeks ago. In other words, sentiment has moderated recently, but it has not dramatically shaken a historically bullish tone.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull-Bear.png))**\n\n> Perhaps the most notable reading in this week's AAII survey was the reading on neutral sentiment. Up 0.7 percentage points from the prior week, it was not a particularly large gain especially compared to the 5 and 5.2 percentage point gains the previous two weeks. Regardless, moving higher once again neutral sentiment hit the highest level since the first week of March. Other than that week and the current one, there has only been one other week in the past year (second to last week of 2020) in which neutral sentiment was as high as it is now. Even though this week's reading is elevated relative to the past year, compared to the rest of the history of the survey, it is pretty unremarkable. On average over the life of the survey, neutral sentiment has averaged a reading just 0.9 percentage points lower than this week's reading.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Neutral.png))**\n\n> The NAAIM Exposure Index is yet one more sentiment reading that also has shown some moderation but remains at a generally bullish level. This index reflects the average exposure to US equities of members of the National Association of Active Investment Managers. Readings of 200 would indicate they are leveraged long on average, 100 would be fully invested, 0 would be market neutral, -100 would be fully short, and -200 would be leveraged short. Last week saw this index tip above 100 for the first time since mid-February which also ranked in the top 2% of all readings going back to 2006. This week it fell 15.93 points. That stands in the bottom decile of weekly moves and was the largest drop since late March, but at 87.79, the index still points to historically bullish positioning among active managers.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-NAAIM.png))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/t2D133W.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/7QFXqBx.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/0X9IBEt.jpg))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 5.10.21 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/alkYsz5.png))\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/HAh8p1I.png))\n\n> # ***Monday 5.10.21 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/DKZzmHm.png))\n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/WE62nHL.png))\n\n*****\n\n> # ***Tuesday  5.11.21 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/fQpT6Tw.png))\n\n> # ***Tuesday 5.11.21 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/MqT0VW2.png))\n\n*****\n\n> # ***Wednesday 5.12.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/jZpyD2A.png))\n\n> # ***Wednesday 5.12.21 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/ddl5bEp.png))\n\n*****\n\n> # ***Thursday 5.13.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/oVFXepP.png))\n\n> # ***Thursday 5.13.21 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/BZ8BaOn.png))\n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/mYeLJZb.png))\n\n*****\n\n> # ***Friday 5.14.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/v6lNwIt.png))\n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/1cL8gOj.png))\n\n*****\n\n> # ***Friday 5.14.21 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\n> # Palantir Technologies Inc. $19.75\n**Palantir Technologies Inc. (PLTR)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, May 11, 2021. The consensus earnings estimate is $0.04 per share on revenue of $332.23 million and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Short interest has decreased by 9.1% since the company's last earnings release while the stock has drifted lower by 34.2% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 13,293 contracts of the $25.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.6% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLTR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Alibaba Group Holding Ltd. $225.31\n**Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, May 13, 2021. The consensus earnings estimate is $1.78 per share on revenue of $27.53 billion and the Earnings Whisper ® number is $1.93 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 97.78% with revenue increasing by 70.53%. Short interest has increased by 15.8% since the company's last earnings release while the stock has drifted lower by 14.8% from its open following the earnings release to be 12.9% below its 200 day moving average of $258.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 18,186 contracts of the $245.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\nWorkhorse Group Inc. $9.64\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Workhorse Group Inc. $9.64\n**Workhorse Group Inc. (WKHS)** is confirmed to report earnings at approximately 9:00 AM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.19 per share on revenue of $2.61 million and the Earnings Whisper ® number is ($0.15) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 416.67% with revenue increasing by 3,007.14%. Short interest has increased by 103.2% since the company's last earnings release while the stock has drifted lower by 39.6% from its open following the earnings release to be 53.3% below its 200 day moving average of $20.64. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 8,546 contracts of the $9.50 put expiring on Friday, May 14, 2021. Option traders are pricing in a 16.8% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WKHS&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Walt Disney Co $184.84\n**Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus earnings estimate is $0.28 per share on revenue of $15.86 billion and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 53.33% with revenue decreasing by 11.93%. The stock has drifted lower by 4.2% from its open following the earnings release to be 17.9% above its 200 day moving average of $156.73. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 5,866 contracts of the $200.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.4% move on earnings and the stock has averaged a 3.1% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Trade Desk, Inc. $661.43\n**Trade Desk, Inc. (TTD)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $0.77 per share on revenue of $216.90 million and the Earnings Whisper ® number is $0.92 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for revenue of $214.00 million to $217.00 million. Consensus estimates are for earnings to decline year-over-year by 7.23% with revenue increasing by 35.01%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 2.4% below its 200 day moving average of $677.57. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 10.2% move on earnings and the stock has averaged a 9.1% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TTD&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # fuboTV Inc. $17.24\n**fuboTV Inc. (FUBO)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, May 11, 2021. The consensus estimate is for a loss of $0.44 per share on revenue of $103.79 million and the Earnings Whisper ® number is ($0.39) per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for revenue of $101.00 million to $103.00 million. Consensus estimates are for earnings to decline year-over-year by 193.33% with revenue increasing by 1,322.76%. The stock has drifted lower by 54.3% from its open following the earnings release to be 24.7% below its 200 day moving average of $22.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 4,094 contracts of the $40.00 put and 4,052 contracts of the $40.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 16.4% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # BioNTech SE $183.71\n**BioNTech SE (BNTX)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $4.31 per share on revenue of $2.60 billion and the Earnings Whisper ® number is $5.11 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,757.69% with revenue increasing by 8,420.68%. Short interest has increased by 25.0% since the company's last earnings release while the stock has drifted higher by 84.1% from its open following the earnings release to be 82.9% above its 200 day moving average of $100.44. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 1,517 contracts of the $155.00 put expiring on Friday, May 14, 2021. Option traders are pricing in a 10.8% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BNTX&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Virgin Galactic Holdings, Inc. $19.61\n**Virgin Galactic Holdings, Inc. (SPCE)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.31 per share. Investor sentiment going into the company's earnings release has 44% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.33% with revenue increasing by 419,647.90%. Short interest has increased by 27.5% since the company's last earnings release while the stock has drifted lower by 45.1% from its open following the earnings release to be 26.2% below its 200 day moving average of $26.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 8,668 contracts of the $17.00 put expiring on Friday, May 21, 2021. Option traders are pricing in a 11.9% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPCE&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Airbnb, Inc. $151.21\n**Airbnb, Inc. (ABNB)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus estimate is for a loss of $1.15 per share on revenue of $704.86 million and the Earnings Whisper ® number is ($1.20) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. The stock has drifted lower by 22.1% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 5,211 contracts of the $160.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABNB&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\nI hope you all have a wonderful Mother's Day weekend and a great week ahead r/stocks.", "id": "n8ddnn", "created_utc": 1620563758.0, "score": 186, "upvote_ratio": 0.96, "num_comments": 30, "comments": [{"body": "amazing work as always BigBear. Thanks buddy.", "score": 14, "replies": []}, {"body": "It is just me, but I feel like many will jump on the dirty economy train too late. I will just hold my positions, I am super long on them anyway.", "score": 17, "replies": [{"body": "Same. If anything waiting on standby with extra cash to buy the dip", "score": 3, "replies": [{"body": "> If anything waiting on standby with extra cash to buy the dip\n\nthis is me since the Apr. SPY Target was around 435 for the year and here I am at 422 in April", "score": 2, "replies": []}]}]}, {"body": "I still do not understand the inflation terror. The FED and numerous others have said multiple times they think elevated inflation is temporary and significantly related to supply problems from COVID rather than QE. We've had lower than expected inflation for a few years (<2%), and they're predicting an elevated level that might even some of that out (2.4-2.6%). I get interest rates will go up, but they've been so incredibly low for awhile and like Yellen said we've had them much higher before and it's not like the economy stopped.\n\nIt's just so so weird to me.", "score": 27, "replies": [{"body": "Me neither. I agree the supply chain was shut down for a couple months. I remember when farmers were dumping milk, eggs, and vegetables for months on end last year. Since there wasn't as much demand. Now the demand is back as things are reopening and they are probably not ready. Same with other industries.\n\nWill just use the FUD to load up on tech/growth. While they keep getting sold off.", "score": 10, "replies": []}, {"body": "Inflation is always something to be worried. I think the problem is nobody believe them and have lost the confidence. A few weeks ago, they denied any kind of problem with the inflation. Nowadays, they admit it. It is supposed to be controlled more or less but... Sincerely, I hope they can", "score": 7, "replies": [{"body": "Also prices are spiking because of supply chain issues, which looks the same to the consumer as inflation", "score": 1, "replies": [{"body": "If we speak about the prices... It is so clearly the inflation is increasing (more or less is something to discuss without doubt). Probably, what makes me angry is the fact these powers denied it like we were stupid and now admit it (WTF)", "score": 2, "replies": [{"body": "yea I do think 'supply chain' is a cop out to a certain extent. Labor, chips, sure. But now it's impacting meat and groceries? Where the fuck was that all last year when customers bought those items in record numbers?", "score": 4, "replies": [{"body": "It is impacting everything and it seems now it's impacting meat and groceries too unfortunately. At this level, a melon will cost $20 in just 1 year. But don't worry there's not to be worried...", "score": 1, "replies": []}]}]}]}]}, {"body": "Interest rates* are in a consistent downtrend since the 80s\n\nhttps://u.realgeeks.media/sacramentohomefinder/mortgage_interest_rates_over_time.png", "score": 2, "replies": []}, {"body": "Inflation is definitely here is just not in consumer goods so won't be picked up in CPI so no rate hikes. \n\nI do wonder though since all that QE fun money made it to assets like equities won't these companies start charging more to justify there valuations?  Either way I'm sure CPI will be adjusted to remember these price increases.", "score": 0, "replies": [{"body": "Not likely because there's always going to be someone who will try to undercut and fill that demand at a lower price. \n\nIt all gets back to supply constraints and trying to get the system running again after the world came to a screeching hault. Not only is there lack of supply but now you have suppressed demand being unleashed. \n\nI obviously don't always agree with what the Fed does and initially thought they mishandled this. After more time I now believe they actually pulled the right strings and we will eventually land safely after a bumpy year or so of supply and demand shocks wear off.", "score": 1, "replies": []}]}]}, {"body": "Half the country not getting gas might trigger a crash.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "These are the lord’s chips?", "score": 1, "replies": []}]}, {"body": "Thank you for this because it keeps me in the loop for earnings and for when IPOs go live. I check every Sunday hoping Impossible and Oatly finally go live.", "score": 2, "replies": [{"body": "Oatly is planning an IPO? Love their products", "score": 1, "replies": []}]}, {"body": "Buy BFARF", "score": 1, "replies": []}, {"body": "every other day will be looking for an excuse to squash the nasdaq.\n\nand i hope big money bumps up BABA so i can gtfo of that loser\n\n&#x200B;\n\nthis buy and hold strategy is really fucking me up", "score": 1, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "People have been saying the same as you have for months now. What will it take for you guys to stop entering every post with this thought. Everybody knows commodities are up, and yet the S&P broke new highs on Friday, and the DOW has been breaking highs all week. Rate increases have been a \"potentially\" for quite a while now, despite JPow having stepped his foot down on his initial statements.", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You haven't upset me, it's just annoying that there's still people that think the end is somehow near, when there's no strong evidence to support that, and even more to counter that. Maybe in 3 years time you'll be right, but a simple trailing stop loss and you would secure 2 years worth of gains. Time in the market beats timing the market.", "score": 0, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "You may not know this, but the Fed doesn't print money. They lower the federal funds rate. Fed funds are what banks are required to hold in reserve each night. When the Fed lowers the remate, Banks have more money to lend because they're paying less in interest. The same goes for buying treasury, they did it from 2008-2014, and they're doing it again, as it helps to spur the economy. You can read up more on it here:\n\nhttps://www.thebalance.com/is-the-federal-reserve-printing-money-3305842", "score": 1, "replies": [{"body": "They are buying bonds.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "There is a 9 hour delay fetching comments.\n\nI will be messaging you in 7 days on [**2021-05-16 13:11:53 UTC**](http://www.wolframalpha.com/input/?i=2021-05-16%2013:11:53%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/n8ddnn/wall_street_week_ahead_for_the_trading_week/gxhsrto/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fn8ddnn%2Fwall_street_week_ahead_for_the_trading_week%2Fgxhsrto%2F%5D%0A%0ARemindMe%21%202021-05-16%2013%3A11%3A53%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20n8ddnn)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}]}]}, {"body": "Hopefully the inflation data is way higher than expected, that will lead to manchin being way more commited on trimming the tax hike and spending bill to minimal level, plus encouraging states to end pandemic free money earlier, which will lead to quicker actions towards containing inflation longer term.", "score": -1, "replies": []}, {"body": "So gold trades because old people are scared?", "score": 0, "replies": []}, {"body": "Philips ($PHG). Ex dividend date tomorrow 5/10. Pays out full yearly dividend ($0.878) on 6/9.", "score": 1, "replies": []}]}
{"title": "Earnings for the week of 5/10/2021 with Options Implied Moves", "selftext": "&#x200B;\n\nhttps://preview.redd.it/71ddqrl965y61.jpg?width=950&format=pjpg&auto=webp&s=7e72bfd26cdffc65fc2e2c8a396cccf3a44a1d1d\n\n \n\nHere's some ideas for earnings related put and call selling\n\nGood Luck Theta Gang!\n\n$NLS\t17.60%\n\n$WISH\t17.50%\n\n$JMIA\t16.90%\n\n$FUBO\t16.00%\n\n$FTCH\t15.90%\n\n$WKHS\t15.80%\n\n$OPEN\t15.20%\n\n$SONO\t14.90%\n\n$NVAX\t14.80%\n\n$PRTS\t14.80%\n\n$BIGC\t13.00%\n\n$DDD\t12.90%\n\n$NNOX\t12.80%\n\n$XPEV\t12.10%\n\n$SPCE\t11.70%\n\n$GRWG\t11.70%\n\n$DASH\t11.50%\n\n$PLTR\t11.20%\n\n$HYLN\t11.20%\n\n$GOOS\t11.20%\n\n$LMND\t11.10%\n\n$COTY\t10.70%\n\n$U\t10.60%\n\n$ABNB\t9.60%\n\n$WIX\t9.30%\n\n$TSEM\t9.20%\n\n$TTD\t9.00%\n\n$BILI\t8.90%\n\n$ELY\t8.90%\n\n$YETI\t7.90%\n\n$PRGO\t7.70%\n\n$JACK\t7.20%\n\n$LITE\t6.50%\n\n$TDG\t5.90%\n\n$SPG\t5.70%\n\n$EA\t5.60%\n\n$WYNN\t5.50%\n\n$TSN\t4.90%\n\n$BABA\t4.40%\n\n$NUAN\t4.30%\n\n$DIS\t4.20%", "id": "n8kth1", "created_utc": 1620586557.0, "score": 48, "upvote_ratio": 0.92, "num_comments": 31, "comments": [{"body": "Pltr is pricing in only 11% move? Seems low. I suspect at least 15% up or down.", "score": 11, "replies": [{"body": "I agree.  I think the buyer has the edge this round.  But probably not FD worthy.", "score": 10, "replies": [{"body": "Agreed, could be a good non-thetagang buying play. Of course we’re not just gonna buy without selling some upside against it.", "score": 2, "replies": [{"body": "Yeah, I’m long PLTR, so the put is just some downside hedging for the short-term.  I sold deep calls on my shares and LEAPs.", "score": 2, "replies": [{"body": "I’m waiting till after earning or should I sell all 44 contracts at open?", "score": 1, "replies": [{"body": "Lmao fuck no dude.", "score": 2, "replies": [{"body": "No what? Don’t sell - wait?", "score": 1, "replies": [{"body": "Wait for it to dump in the AM. Blackrock announced that they dumped 71% of their shares on Friday. This will scare off most crowds and you can get it cheaper", "score": 0, "replies": []}]}]}, {"body": "My calls are for 6/18 and I sold them last week on an interday high.  I sold them to get a bit of IV crush after earnings and then let theta do its thing. If you wait until after earning, you won’t benefit from IV crush.  But you also don’t cap your upside if it spikes up after earnings.", "score": 1, "replies": [{"body": "I’m thinking at lunch Monday then - even if it spikes 15% it’s still below what I want to sell for. My worries is some freak $40 run", "score": 2, "replies": [{"body": "That would be a great problem to have", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "it will blow all the estimates and drop 5%. I don’t know what can move this up.", "score": 3, "replies": [{"body": "Nothing. The CEO sold tons of shares on top of his over laid salary. Blackrock announced ok friday that they sold 71M shares. \n\nCathy will dump soon too or risk getting murdered by her share holders", "score": -5, "replies": [{"body": "Good old FUD", "score": 1, "replies": [{"body": "Insiders and Blackrock did sell significant amounts of shares tho?", "score": 1, "replies": [{"body": "I would be surprised if they didn't.", "score": 0, "replies": []}, {"body": "Insiders selling isn't bearish as it is well known PLTR is big on stock based comp", "score": 1, "replies": []}]}]}, {"body": "No, Blackrock sold the shares in march, not friday.", "score": 1, "replies": []}]}]}]}, {"body": "SNDL Bag holder ASSEMBLE", "score": 5, "replies": []}, {"body": "put a strangle on pltr from 1 cent to 20 dollars, easy profit.", "score": 2, "replies": [{"body": "I am new to options, what can I do to with pltr ?", "score": 0, "replies": [{"body": "One option is to stay very far away from it.", "score": 8, "replies": []}]}, {"body": "A long strangle?", "score": 1, "replies": []}]}, {"body": "Jmia going to 17 for sure. Thankfully I have lots of puts at 28.", "score": 2, "replies": [{"body": "Jmia is trash. Which means it will shoot up after shit earnings", "score": 1, "replies": []}]}, {"body": "I’ll sell puts on SONO if OPEN has weeklies I’d sell a ton of puts, but they don’t.", "score": 1, "replies": []}, {"body": "What’s wish all about ? At historic low, tons of IV. How low can this thing go ?", "score": 1, "replies": [{"body": "0.00", "score": 2, "replies": []}]}, {"body": "Common Marriott...", "score": 1, "replies": []}, {"body": "Lol, how is nuance gonna jump?", "score": 1, "replies": []}, {"body": "Aren't SNDL earnings this week?", "score": 1, "replies": []}]}
{"title": "WELL Health Earnings Tuesday", "selftext": "Was reading this article from the Motley and saw the company has earnings Tuesday. After digging a little deeper I think they might blow them out of the water. \n\nIf all is accurate this is what I found. \n\n1. Earnings out earlier than scheduled which is very bullish \n2. They just did a $305M raise priced at a 25% premium to market which was led by Mr Li Ka Shing (29th richest man in the world) who put up $105M of his own money\n3. Completed the CRH Medical acquisition which analysts anticipate will bring the company to over $300M in revenue and $50M in free cash flow. \n4. JP Morgan the largest healthcare bank in the US extended the CRH credit line from $200M to $300M\n5. 0 debt on the balance sheet and $80M in the bank after the recent financing \n6. What looks like a partnership with Apple? They are now the first Canadian company to offer EMR records on Iphone. \n7. They have historically beat earnings guidance and I think could do the same here given how strong of a close they had on Friday. \n\n[https://www.fool.ca/2021/05/07/well-health-a-growth-stock-to-consider-for-your-portfolio/](https://www.fool.ca/2021/05/07/well-health-a-growth-stock-to-consider-for-your-portfolio/)", "id": "n82lod", "created_utc": 1620521009.0, "score": 106, "upvote_ratio": 0.82, "num_comments": 29, "comments": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Feels like it these days", "score": 12, "replies": []}, {"body": "Not roku baby", "score": 1, "replies": []}]}, {"body": "Canadian here - these guys are taking over from a business perspective I see them everywhere now. About time the stock follows hopefully this is what does it.", "score": 17, "replies": [{"body": "My theory is that clovs earnings are going to seriously disappoint and people will be looking for alternatives in the health tech space. Ones with actual business models... What part of Canada are you in or seeing them operate in?", "score": 6, "replies": [{"body": "its vancouver", "score": 3, "replies": []}, {"body": "Clov will absolutely destroy this Well. The population of Canada is less than the population of California. Fuck healthcare is free in Canada.\n\nWhat the fuck are we talking about", "score": 3, "replies": [{"body": "Healthcare is not free in Canada. It's paid for by the government. Health care providers still get paid.", "score": 5, "replies": [{"body": "in other words the people pay for it with taxes, and anything the government can do to get healthcare cheaper they will......that's what WELL is doing for government, this stock will be 100 bucks in 5 years", "score": 3, "replies": []}]}, {"body": "WELL is expanding into the US very very quickly and unlike clov is actually profitable... You can just say you don't understand the business model...", "score": 12, "replies": [{"body": "Yep you nailed it. CLOV is all fluff WELL is all business with none of the fluff... Sadly it's the fluff that gets investors interested these days.", "score": 9, "replies": [{"body": "CLOV has a growing US market and running business with revenue. They are currently in an expansion stage and have a partnership with Walmart. It is not some ghost company.\n\nWELL seems to have a similar set up. Id say this is healthy competition. I have to read up more on WELL.\n\nIm bullish on CLOV long term. However, there is a short term play before and after earnings. This is supported by a growing SI", "score": 5, "replies": [{"body": "If CLOV *actually* has an earnings spike I'm gonna be fuckin surprised.\n\nHappy, because I can dump another set of bags I'm holding. But surprised.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Actually I take that back. I have to read up on it more.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Well health has about 50 million revenue valued at 1.5 billion.\n\nClov has 800 mill valued at 3.5 billion\n\nClov is sacrificing bottom line because of aggressive expansion.\n\nI can guarantee you 2-3 years from now the disparity will be much bigger.\n\nWell does seem like a good growing company but clov is the fucking Amazon of healthcare.\n\nClov dec 75 calls $12.50 1.71 average LFG 🚀🚀🚀🚀🌕🌕🌕🌕", "score": 4, "replies": []}]}, {"body": "Healthcare isn't free in Canada, or would WELL be a viable business? They've made it this far in Canada and just expanded into New Zealand and US this year.\n\nWhat the fuck are we talking about", "score": 1, "replies": []}, {"body": "free? really?......check your taxes lately?", "score": 1, "replies": []}]}, {"body": "China town", "score": -2, "replies": []}]}]}, {"body": "Bought into this last week. Looks very promising.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Canadians are smarter than Americans on healthcare", "score": 2, "replies": [{"body": "I don't see how you'd think that. Our healthcare is far from flawless. there's tons of innovation happening in the States too", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "they already are, sit back and watch ,this stock will take off soon", "score": 1, "replies": []}]}, {"body": "I have no idea if it's the same company but if I see one more of those \"Well Health Safety Seal\" commercials packed full of shit celebrities I'm gonna blow my brains out.", "score": 1, "replies": [{"body": "Whoa, brotha. Robert Dinero is anything but a shit celebrity", "score": 1, "replies": []}]}, {"body": "Is this an insider writing about WELL after that short report to boost their stock![gif](emote|free_emotes_pack|facepalm)", "score": 1, "replies": [{"body": "I wish lol", "score": 2, "replies": []}]}]}
{"title": "Trading Oil Stock Options to Buy a Tesla", "selftext": "[deleted]", "id": "n8k4u2", "created_utc": 1620584624.0, "score": 21, "upvote_ratio": 0.79, "num_comments": 22, "comments": [{"body": "Y do u wanna buy a tsla?", "score": 5, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "This is a prodigiously underrated motive.", "score": 11, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "and use them to power an oil refinery.", "score": 9, "replies": []}]}]}]}]}, {"body": "$XOM after Memorial Day calls will fucking print a shit ton of people will be driving so they will print the money like brrrtttttt", "score": 5, "replies": [{"body": "$XOM is my only oil stock at the moment, and it's already made me $500 in a week. Planning on getting more July calls tomorrow.", "score": 1, "replies": []}]}, {"body": "I’m in with a combination of stocks and options in xom, bp and su. I plan on holding until mid July as I am sure there’s room to run.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "What your opinion on the oil pipeline hack? Thinking about buying some FD's on XOM, GUSH, CVX", "score": 2, "replies": []}]}]}, {"body": "I am in et too i think it will triple from here personaly", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I think by end of year", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It very well may its extremely undervalued", "score": 2, "replies": []}]}]}]}]}, {"body": "in case you didn't know, et isn't gonna be fun at tax time. it isn't a stock, though it trades like a stock. et is a master limited partnership, and your shares are units of partnership interest. taxes get extremely complicated", "score": 2, "replies": [{"body": "They have to get a profit to be an issue. That hasn’t been a concern for the last year or two. \n\nAlso complicated taxes meet accountant accountant meet money. \n\n\nJoint partnerships are only complicated when you owe multiple taxes in  states that comes out to like $20. \n\n\nAlso they don’t fucking mail the forms to you until mid April so have fun in that.", "score": 2, "replies": []}]}, {"body": "Love Tesla", "score": 3, "replies": []}, {"body": "Wouldn’t do that at all bro", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I mean it works, but maybe take something out and buy yourself something nice a house or whatever. \nI got a advice for you, but probably get banned for saying that.. there are 2 particularity stocks that get downvoted or closed because Mods don’t like them", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I mean you could just do you own research before adding those stocks to your portfolio. I just did my own research month ago and still in. Doesn’t mean it’s something you have to do.. Just take something out pay some tax and do yourself a favor. It could rise more but could fall to. You decide. (Your options)\n\nBut nice gainz!", "score": -1, "replies": []}, {"body": "If you really believe in them options, and you're up a lot at open, close the number of contracts equal to the price you opened at, and let the rest run. Worst that happens is you lose what you'd gained and you try another trade. Best case scenario, you're set for life.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Rolling up is definitely a smart idea. They beat their earnings by quite a bit, which I didn't realise. If the market goes up, theres a good chance ET follows suit, but definitely realise some of that profit and just fuck it into SPY/Deep ITM SPY calls if you want to be a bit riskier.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "What next?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "got it boss, which one should i buy", "score": 1, "replies": []}]}]}, {"body": "Just get a prius a book a cruise :)", "score": 1, "replies": []}]}
