{"title": "What should I do with my AMZN shares I brought before earnings?", "selftext": "[deleted]", "id": "5rrkd8", "created_utc": 1486091986.0, "score": 36, "upvote_ratio": 0.83, "num_comments": 39, "comments": [{"body": "write your brokerage and request paper certificates, roll them up real tight and wrap them in electrical tape, slide em up your ass.", "score": 64, "replies": [{"body": "lube or no lube? ", "score": 4, "replies": []}]}, {"body": "Dude its like $175, eat Little Caesars for a month and you'll be right.", "score": 24, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "everything besides a short earnings miss is on par. sure, aws is on low guidance but it's just starting up. you gotta give amzn more time,  op. i agree with mrpguy, it's definitely on track for 900 if you're a long holder.", "score": 1, "replies": []}, {"body": "This. In the meantime, take opportunities to average down if you can ", "score": 1, "replies": [{"body": "memetime? ", "score": 6, "replies": []}]}]}, {"body": "I'm just going to leave Robin Hood closed for a few days and hope things go back up. I suggest the same for anyone else holding a steaming bag of Amazon right now. Buy what do I know? All my shit is in the red. ", "score": 17, "replies": [{"body": "It's down 4%. This place is going to lose its mind if (when) there is a correction and stocks across the board drop 8-10%", "score": 10, "replies": [{"body": "Is this just some alarmist shit being spouted in this sub or do some of you actually have reason to believe there will be a correction. Im convinced we have half a decade before there is even reason for concern.", "score": 5, "replies": [{"body": "How long have you been trading? Market corrections and black swan events happen. Historically we're overdue. ", "score": 8, "replies": [{"body": "That's why you go all or nothing and invest all your net worth into FNMA with as much leverage as possible ", "score": 1, "replies": []}]}, {"body": "I'm not trying to be alarmist nor do I have a timeframe in mind. But it will happen at some point.\n\nMy point was more that 4% is negligible (unless you're trading options)", "score": 2, "replies": []}]}]}, {"body": "Average down. If you think Amazon will rise you should be trying to lower your cost basis. Otherwise sell and cut your losses if you think it will tank. Just bagholding means that you're continuing to expose your money to risk without trying to improve your position.", "score": 2, "replies": [{"body": "I think it will go back up, but I don't have another $800 to buy more Amazon to reduce my cost. I also don't regularly hold Amazon, I just bought it to ride the earning report so that was the gamble I took. I'll wait for it to go back up, so I'm taking my loss as time wasted instead of money loss I have to make back somewhere else. Thanks for the insight, sounds like you know what you're doing more than I do. ", "score": 3, "replies": []}]}]}, {"body": "[spoiler]\n>killyourself: 100%", "score": 26, "replies": []}, {"body": "Grab those shares by the pussy and hold them for a while", "score": 12, "replies": []}, {"body": "You'd want to wait and see what traders do tomorrow. After 4% drop, I'd expect more pullback. But every trade is different. From what I see *right now*, either wait and sell @ 815-825, or buy more at open in low 800s. You need to be able to interpret the data from tomorrow and make a decision. In the long run, charts look bullish and company has 7 consecutive profitable quarters.", "score": 9, "replies": []}, {"body": "I was back and forth all day yesterday on whether or not to jump in. I ended up buying 5 shares right at the close. Was considering 10 so I guess in that regard I lucked out. \n\nI plan on holding/watching for the next few weeks before making a decision. If it drops another %5 from AH I'll probably average down.", "score": 5, "replies": [{"body": "if you would have done it at open, there were various spikes throught the day to sell at. I did a paper trade since I knew I wasn't touching AMZN with my real money and saw green %s for awhile. I ended up keeping them because it's papertrade and now my papertrading account looks like I bought shares in red ink.", "score": 1, "replies": []}]}, {"body": "Hold for 1-2 months and you'll break even, easily\n\nAMZN just steadily climbs and climbs and climbs\n\nBought 4 shares back when this shit was 300, still climbin nigga", "score": 5, "replies": []}, {"body": "jam them up your ass", "score": 3, "replies": []}, {"body": "Amazon is going to come back. Might take a bit, but we all know it will. Not too long. One of best companies of all-time.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "tl;dw\n\nhttps://youtu.be/iDVuQi4gdtk?t=66\n\n", "score": 3, "replies": []}]}, {"body": "Hold em. Buy more if you can. ", "score": 1, "replies": []}, {"body": "I plan to sell covered calls on my 200 shares. Or I might just bail and write puts on NVDA at this point.", "score": 1, "replies": [{"body": "i second put NVDA", "score": 1, "replies": []}]}, {"body": "Duke?\n\n\"*[Blow it out your ass](https://www.youtube.com/watch?v=8U18EuNN2D0)*\"", "score": 1, "replies": []}, {"body": "BTFD", "score": 1, "replies": []}, {"body": "Sell covered calls on it every month to lower cost basis. If it ends up getting assigned at some point, at least you made money off the premium for however many months.", "score": 1, "replies": [{"body": "He has 5 shares not 500. Covered calls my ass.", "score": 15, "replies": [{"body": "Right. I'm very tired. Somehow assumed he had enough to cover a call lol. He's just shit out of luck. Hold till it breaks even then I guess.", "score": 3, "replies": [{"body": "you forget this is WSB. Holding anything for a day is considered going long and ain't nobody got time for that and if it doesn't instantly give you 20% you're a \"bag holder\". ", "score": 5, "replies": [{"body": "well, if it goes -20% instantly, you are a bag holder...", "score": 1, "replies": []}]}]}]}]}, {"body": "I say sell them in my opinion the technology industry is in another bubble", "score": 0, "replies": [{"body": "bruh", "score": 1, "replies": []}]}, {"body": "Sell and then buy in again when the stock moves up on Monday. Preferably on the top. Buy high sell low!", "score": 0, "replies": []}]}
