{"title": "I have half my portfolio in INTC", "selftext": "Tell me why I'm wrong 😆 \n\n1. Their 18A process is best in class\n2. Their x86 chips will be way more efficient on 18A\n3. The ARM chips on 18A will be more efficient than competitors\n4. Their GPUs are only a generation or two behind Nvidia.\n5. Their AI platform (gaudi)  is already more efficient that Nvidia and is only a generation or two behind in terms of raw horsepower.\n\nIf we think about compute in general let's say 33% cloud, 33% HPC/AI, 33% edge.  \n\nRight now Intel is a major player in all 3 markets.\n\nXeon isn't going anywhere and once 18A process starts moving volumes it will be such a huge jump in performance that all these cloud vendors that have been extending lifecycles will finally have a reason to upgrade.\n\nGaudi will become more competitive over time as companies start to realize that nuclear power stations for data centers are not really a good idea. The power density required for nvidias chips just isn't sustainable.\n\nARM is a big threat to Intels x86 market but it's also a big opportunity for Intel foundry. The efficiency of ARM chip design is largely the same given they're using the same core architectures. Where Apple really has been excelling is using the latest process technologies to build more efficient edge compute. Intel with their state of the art 18A coming online around the world will soon having companies lined up for ARM production that will handily outperform TSMCs latest offering.\n\nIntel GPUs are getting more and more competitive with Nvidia every generation. In terms of gaming I see them becoming a more and more of a thorn in nvidias side, but that's just GPUs...\n\nI just don't see why nvda can be possibly worth 20x Intel when Intel has so many more growth opportunities. If all goes well in the world then Intel will continue to play a major role in the global compute market. If all goes to hell in the world then Intel will be the single most critical company in the world as global chip supply becomes completely disrupted in Taiwan and Intel's new factories become the only way to keep our world moving forward.\n\nAlready Biden is escalating the trade war with China. Imagine if it gets to the point where the US decides to permanently dismantle TSMC's entire manufacturing capacity then imagine what that will do to global chip supply. All it would take is one wrong move by China to seize control over the strait and USA will undoubtedly destroy the manufacturing before letting it fall under Chinese control.\n\n\n ", "id": "1cs6ksa", "created_utc": 1715729599.0, "score": 40, "upvote_ratio": 0.66, "num_comments": 102, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "welcome to the club though I don't know how big your portfolio is\n\nI have six figures in it and been red for years now, cheers to next year lol!\n\nlmao yall reported me to redditcares, don't ever change WSB", "score": 112, "replies": [{"body": "bags heavy ? I exited few days ago after saw the post that in 1999 the stock was the same $29", "score": 37, "replies": [{"body": "lmao very heavy luckily I get a 15% discount \n\n\nYALL DONT NEED TO REPORT ME TO REDDITCARE LMAO", "score": 25, "replies": [{"body": "Employee shill? Y’all get anything done over there. 1-2 generations behind nvidia is ALOT", "score": 10, "replies": [{"body": "spouse not me lmao I work for the government as a terribly paid pilot (USAF at least)", "score": 11, "replies": [{"body": "Thank you for your service…\n\n\n… as someone’s exit liquidity  \n\nAnd the freedom, that too, but mostly the first thing", "score": 15, "replies": []}]}]}, {"body": "Some bear redditcare'd me when I told him semi bubble was just starting. ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "In 2000 it was ATH of 75$.", "score": 1, "replies": []}]}, {"body": "Worked at intel for 10 years from 2008, their issue is not technology, it is culture. They don’t have the right attitude for doing this. They need a leader who can inspire them to go the extra mile when they are building things.", "score": 17, "replies": [{"body": "pat is slowly righting the ship, but yes I agree", "score": 5, "replies": [{"body": "Old ass authority. The chance that they loose 50% (again)  is bigger than a significant gain. Ah, and I forgot, the wages are safe for eternity so nobody cares about it. Kinda railroad stock.", "score": 2, "replies": [{"body": "Correct! The inevitable result of collective bargaining; the decline of competent administration.", "score": 3, "replies": []}]}]}]}, {"body": "I feel like Intel is a sleeper too which is why I hold 10% of my portfolio in it. I figured it was a biden play, US needs to nearshore its chip fab and biden was handing out dollars like candy, Intel can pick that up and run with it.", "score": 6, "replies": []}]}, {"body": "Imagine we had one of the biggest bull runs and semiconductor cycles in history and Intel didn’t budge since 1999 without accounting for inflation", "score": 54, "replies": [{"body": "So vicious", "score": 5, "replies": []}, {"body": "intc stock peaked around 70 in '20 & again in '21.  re-check your imagination. 🤷‍♂️\n\nto be completely reliance on tsm & samsung for chips production is not an ideal position for the economy.", "score": 2, "replies": [{"body": "Remind the guy with the imagination… where’s INTC now?", "score": 8, "replies": [{"body": "need to check his imagination; nevertheless 🤷‍♂️", "score": 4, "replies": []}]}]}]}, {"body": "I hate this stock so much. I listened to my brother and decided DCA was the plan when it dipped. His portfolio is 100% fucking INTC. Now I sell covered calls to degens trying to break even. Which we're getting close to.\n\nhttps://preview.redd.it/72ffw1xcbh0d1.jpeg?width=1080&format=pjpg&auto=webp&s=2f5d6503f255832ddbfd536cb5f35f76ad4ff46a", "score": 27, "replies": [{"body": "I hate INTC stock so much i never once did any trades on it in my life and still just periodically look at its stock price in sheer disgust. I like the company. Intel inside. Good stuff. The stock sucks.", "score": 18, "replies": [{"body": "Buy because of the company not the stock.\n\nINTC is building foundry and MSFT and NVDA will be first customers.\n\nNow it's about the execution. INTEL is on right track. They will make it.", "score": 1, "replies": [{"body": "Thinking about it i like the nice move here", "score": 1, "replies": []}]}]}]}, {"body": "How is being 2 generations behind a competitor a good thing???", "score": 44, "replies": [{"body": "So I wouldn’t gamble on Intel stock.  But arguably they are ahead of AMD on graphics and AI.  Which is hilarious for only launching a serious GPU product in the last few years.\n\nLike Intel does hardware upscaling like nVidia where AMD does not.\n\nOn the downside, they just launched a 3rd round of desktop processors that were very similar (and 12-13-14 gens had a bad power consumption progression).\n\nThey do not have as bad as a track record since they spent 10 years doing nothing.  But technically have not made a CPU improvement that is substantial since Alder Lake.\n\nI wouldn’t have the guts to buy Intel.", "score": 10, "replies": []}, {"body": "It shows progress. Their pace is remarkable considering they only started on discrete graphics a couple generations ago.", "score": -6, "replies": [{"body": "> a couple generations ago.\n\ni mean, i think your premise is crazy (although, i do think intel is oversold/undervalued, anyway... but for sane reasons), but battlemage isn't even out.  they only really have 1 generation in dgpu.", "score": 1, "replies": []}, {"body": "How is 18A good when Apple is at 3A and TSM is working on 1A?", "score": -1, "replies": [{"body": "Apple (TSMC) is at 3N. You're confusing a lot of things.", "score": 9, "replies": [{"body": "Fair point. Meanwhile, 18A won’t be in production until 2026 at the earliest anyway. \n\nhttps://www.tomshardware.com/tech-industry/manufacturing/intel-18a-based-cpus-will-ramp-to-high-volume-in-2026", "score": -6, "replies": [{"body": "Read the article you linked. It is production ready this year, products will come out with 18A next year, and high volume will be reached in 2026.", "score": 8, "replies": [{"body": "Yes, high volume = production.", "score": -6, "replies": [{"body": "No.", "score": 5, "replies": [{"body": "Okay dot gif", "score": -3, "replies": []}]}]}]}]}]}, {"body": "OP so angry about my question, he sent me to Reddit cares. What a dick.", "score": 11, "replies": [{"body": "OP ![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)", "score": 7, "replies": []}, {"body": "tbf, your question was regarded.", "score": 2, "replies": []}]}, {"body": "i think op's premise is a bit wonky with 18a since intel's still loading up on tsmc wafers, but ffs.  18a is smaller than tsmc n3, which aapl is using.  also, i have no idea why you mentioned aapl, they have nothing to do with any of this.  \n\n...did you actually think apple had a fab?  because the above reads like it.", "score": 1, "replies": []}]}]}]}, {"body": "On paper Intel isn't like, an awful company or anything. Their revenue is still humongous and they've got their own fabs, a well-established brand name, etc. \n\nBut the market hates them. Whatever offerings they have in the major spaces right now are seen as either inferior, overly costly, or on the way out compared to what their competitors are promising in the near future. I think as soon as they started buying production time from TSM the writing was on the wall for popular opinion on the brand. Maybe that changes in the future, but it's not something I'd bet on at these prices. That being said, they should probably see an easy retrace to the mid-30s in concert with the overall market going up. Just there are better plays than that to be had.", "score": 12, "replies": []}, {"body": "Come back in late 2025", "score": 14, "replies": [{"body": "Dallas cowboys may even get a chip before Intel comes back", "score": 2, "replies": []}]}, {"body": "Of all the tech stock, imagine going with the one that's been in the same price range as 25yrs ago.", "score": 12, "replies": [{"body": "Don’t talk about $MSFT that way", "score": 4, "replies": [{"body": "Microsoft is up like 400,000% in that time", "score": 13, "replies": [{"body": "MSFT was flat until 2015", "score": 6, "replies": []}]}]}]}, {"body": "The only tense you use is the future: will. Only after they proved themselves then I will buy.", "score": 6, "replies": [{"body": "Classic WSB only being interested once they've had their turnaround and the stock price is 2-3x higher", "score": 10, "replies": []}]}, {"body": "Intel inside. Buy and hols", "score": 7, "replies": []}, {"body": "intel's biggest problem is just narrative.  morons believed kool-aid and thought it should be over $50.  now morons believe they only lose money and should be worth less than $30.\n\nthe market's always dumb and the narratives are usually bullshit (eg, imminent taiwan invasion, neon!, chip shortage, etc and etc).\n\nglobal foundries is basically a piece of shit.  they may as well be in the same position as when amd got rid of them, they're stuck in 2015 and with basically zero growth prospects.  and they're still valued at $30B.  if gfs is worth $30B and amd is worth ~$300B (and nvda's ludicrous 2B valuation), intc should be worth more than ~$125B just as a sum of parts.  ffs, mobileye is like $25B.\n\nthat said, op is delusional/his premise is whack\n\n>\n    Their 18A process is best in class\n\n\ndoubtful, but possible.  iirc, even they don't think this and think it'll just be at parity\n\n\n    Their x86 chips will be way more efficient on 18A\n\nthis means nothing, they had better be\n\n\n    The ARM chips on 18A will be more efficient than competitors\n\npulled from rectum\n\n    Their GPUs are only a generation or two behind Nvidia.\n\nlolwut?\n\n\n    Their AI platform (gaudi) is already more efficient that Nvidia and is only a generation or two behind in terms of raw horsepower.\n\numm...", "score": 5, "replies": []}, {"body": "Intel doesn't manufacture their Gaudi chip. TSM does that for them. And they only expect to sell $500 million this year with that chip, while NVDA will sell something like $100 billion. \n\nIntel doesn't expect their foundry business to break even till around 2027 and who knows, that could be pushed out further once again. \n\nAMD meanwhile is taking share in the consumer market for laptops and desktop CPUs and they are also taking revenue marketshare for servers. \n\nIntel's consumer GPUs have an uphill battle. Even AMD with some pretty good GPUs in recent generations has struggled to make much of a dent against NVDA. Intel won't be the performance leader in that segment anytime soon. If anything AMD and Intel will be fighting it out rather than taking much share, if any, from nvda. \n\nSo intel has its work cut out for it. I wouldn't be investing in them anytime soon personally.", "score": 7, "replies": [{"body": "amd is so eager to get customers that they're going to basically give their products away (again...)\n\ntheir mi300 will cost way more than the h100 to manufacture, but amd's going to sell them for (likely much) less.\n\nand intc has design, too.  while i think they're morons for outsourcing to tsmc while having their own fab, saying gaudi is fabbed at tsmc is hardly a counterpoint when you're posting about amd... which also uses tsmc.", "score": 3, "replies": [{"body": "It's a counterpoint because the OP is talking about Intel manufacturing being a plus. Well they apparently can't manufacture their ai chip and can't get the supply they need from tsmc to sell more. Even amd has said they will sell more than $4 billion ai chips and will have more supply in the second half if demand is there.", "score": 2, "replies": [{"body": "and?  neither is making shit off them.  and amd may be in trouble via their deal with samsung, their hbm yields are apparently godawful.", "score": 1, "replies": [{"body": "And I'm answering your question pal. It is a counterpoint. Who cares about amd in general. It's a point about Intel and their Gaudi chip.", "score": 1, "replies": [{"body": ">It is a counterpoint.\n\nyeah, not really.\n\n> Who cares about amd in general. \n\nyou, since you're the one who inexplicably brought them up?", "score": 1, "replies": [{"body": "Dude if you can't see it, I can't help you.", "score": 1, "replies": [{"body": "lolz, i don't need your help?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Tell me why I’m wrong?\n\nMy answer is just to look at the chart. Its been a real piece of shit for a long long time", "score": 4, "replies": []}, {"body": "im long on intc too ($60k worth) for your exact reasoning.", "score": 3, "replies": []}, {"body": "Because stocks don't grow based on logic. Their stock was the same price a quarter century ago as it is today.", "score": 8, "replies": [{"body": "intel underprices 100% but again the CEO and company direction is shit. How are they so fucking behind after being backed by the government! They have a silver spoon in their mouths and aren't taking hold of the opportunity.", "score": 5, "replies": [{"body": "they just got a new CEO that's an engineer that has been slowly righting the ship, unfortunately with chips it takes time. previous CEOs were finance types.\n\nif china ever invades Taiwan, Intel will be one of the only US chip manufacturers.....so we go that going for us lol\n\n*pokes china*\n\n**do something p00sy**", "score": 14, "replies": [{"body": "For the world in fact.", "score": 1, "replies": []}]}]}]}, {"body": "Betting on losers is a great way to be a winner. Innovation is built on failure.", "score": 7, "replies": []}, {"body": "I’m regarded", "score": 3, "replies": []}, {"body": "INTC is boring. Full stop \n\nNor worth your effort and time. Might as well put your money in Amazon\n\nIt’s like you know a girl, she is your dream girl, has the personality, the charisma, the charm you like etc but the girl just doesn’t like you back the way you like her\n\nWhat can you do?", "score": 5, "replies": [{"body": "Not excited for Arrow Lake?  ![img](emote|t5_2th52|8883)", "score": 3, "replies": []}]}, {"body": "😍", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "10:1 split?\n\nSeriously you sent me to redditcare too? lol", "score": 1, "replies": []}]}, {"body": "Dude what are you doing…", "score": 2, "replies": []}, {"body": "Not much upside, only catalyst for INTC To bump up is somehow China 'dismantles' TSMC / Taiwan. Which is unlikely for next 2-3 years at least. So, it will dip further. With that said - i own some INTEL in my inverse my logic strategy!", "score": 2, "replies": [{"body": "Well, TSMC is branching production to the US and Europe. If China takes out Taiwan, it will loose access to their chipmaking (Taiwan is not going to let that factory and most of that knowledge get captured) and to western chips. TSMC will then be a company, likely listed in New York and thus without any restrictions to supply the government. The split could be comparable to what Zeiss did, when the original headquarters was taken over by the communists in the GDR and they rebuild in the west.", "score": 3, "replies": []}, {"body": "The upside is that their revenues will likely go up as they add production capacity since the market demand for chips is likely to go up.   Even if competition has better chips is isn't going to be a huge performance margin so they need competitive pricing AND enough capacity to squash all of intels potential gains in revenue.   \n\nINTC is near a 30 p/e right now which is pretty low for the sector.   More earnings means price needs to go up.", "score": 1, "replies": []}]}, {"body": "Can’t wait for the next year post, “This time for sure guys! For Realsies!”", "score": 2, "replies": []}, {"body": "\"Only a generation or two behind...\" on everything.", "score": 2, "replies": []}, {"body": "Anemic sales growth, stock price hasn't moved since the Clinton administration, prior market leader outclassed by NVidia, AMD, and multiple other semis. It's a dinosaur and its best days are way behind it.", "score": 2, "replies": []}, {"body": "every day there's another idiot who writes an essay on the intel turnaround that will never happen.", "score": 1, "replies": [{"body": "It's like clockwork. If you open any investing textbook from the last 30 years and lookup the definition of *Value Trap*, all it is is just the word $INTC followed by white space.\n\nIt's been very bemusing watching everyone suddenly \"discover\" the secret potential of INTC every other month, as if somehow no one else has ever heard of this great value stock, only to get brutally annihlated by theta gang", "score": 1, "replies": []}]}, {"body": "I think their investment in manufacturing to produce in volume increasing their production  capabilities shows they may, never be the best but aim to produce in volume by expanding production  and improving automation.\n\nSaying that diversification is key.\n\nI split my portfolio over\n\nSpace   low earth orbit and aerospace \n\nRobotics\n\nChips\n\nConstruction machinary\n\nBitcoin mining\n\nCloud storage\n\nEV, solar and hydrogen\n\nI guess low earth orbit and aerospace companies also make weapons but not why I bought them. \n\nAlthough diversified ive positioned towards the future where I see massive growth.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/2y6h6q5m4o0d1.jpeg?width=828&format=pjpg&auto=webp&s=68000fa55a7cefccf7cdc8201fb3cdf67d2c7854", "score": 1, "replies": []}, {"body": "I have around 10%(10k) in intel and I'm bullish on them. It will take long time to see results but it will be worth it imo", "score": 1, "replies": []}, {"body": "Stop me if you've heard about this investment opportunity, but have you considered gourds?\n\n\nYou might make more profit than holding INTC.", "score": 1, "replies": []}, {"body": "You’re only missing one key metric… INTC is ass 💩", "score": 1, "replies": []}, {"body": "IF IF IF\n\n![img](emote|t5_2th52|27189)", "score": 1, "replies": []}, {"body": "so...I know a few who work there and just open their laptops in order to clock in...don't get me wrong but with that attitude that company isn't going anywhere.", "score": 1, "replies": []}, {"body": "I swear to god if another soyboy that never laid down a single inch of n well or p substract and couldn't tell a transistor from you girlfriends boyfriends dick talks about gate sizes as if they know anything about anything I'll take my van de graff generator and electrify my local lake", "score": 1, "replies": []}, {"body": "Sure priced in", "score": 0, "replies": []}, {"body": "🫡", "score": 0, "replies": []}, {"body": "You’re wrong simply for the fact I lost out buying calls on earnings reports and not selling before 👺", "score": 0, "replies": []}, {"body": "You are wrong.", "score": 0, "replies": []}, {"body": "The issue with Gaudi is that even if INTC is competitive performance or efficiency wise, CUDA will keep people stuck on NVDA", "score": 0, "replies": []}, {"body": "1. 18A was developed before the AI boom, which requires high die size and high yield. Intel has historically been known for high frequency, not high yield. \n\n  \n2. The industry is moving away from x86. If you've used cloud services like Oracle or Azure, you'd know ARM is superior for most modern applications.\n\n  \n3. This is a niche application that still needs to be proven.\n\n  \n4. Being \"only\" two generations behind is significant; the margin for progress gets much harder as you approach the leader.\n\n5. If Gaudi is so powerful, why aren't major players using it? Instead, they're developing their own chips.\n\n  \n**One more thing:** OpenAI released ChatGPT for Mac -------- even sugar daddy Microsoft is moving to more versatile and efficient platforms. Intel is doomed, put put put.", "score": 0, "replies": []}, {"body": "DELL", "score": 0, "replies": []}, {"body": "LoL good luck bro", "score": 0, "replies": []}]}
