{"title": "Weekly Chat Thread and Discussion", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1bc0iu2", "created_utc": 1710154844.0, "score": 12, "upvote_ratio": 0.94, "num_comments": 67, "comments": [{"body": "Down in premarket, how are you guys feeling?", "score": 4, "replies": [{"body": "Not as good as 2 hours ago", "score": 6, "replies": []}, {"body": "Same as every week", "score": 3, "replies": [{"body": "Yup, depressed AF, lol", "score": 2, "replies": []}, {"body": "Same as every day", "score": 2, "replies": []}]}, {"body": "I try not to feel but I understand your Q. I think it bounced off 900 looking forward to testing and breaking. It’s gonna be interesting and I think Friday was just profit take not a burst bubble.", "score": 1, "replies": [{"body": "They're being sued", "score": 1, "replies": [{"body": "Like every big cap companies.", "score": 2, "replies": []}, {"body": "Didn’t work out", "score": 1, "replies": []}, {"body": "I’m being sued so what", "score": 1, "replies": []}]}]}]}, {"body": "PSA: For those that are/were looking for me on \"That other Sub\" Just wanted to update you that I was Banned for liking NVDA too much last Friday 😄 I was told that I mentioned too often jokingly if you bought the dip... I was told it is \"Temporary\" pending further review in a month but we'll see. Not surprisingly there has been a major sentiment change since I was put on vacation status. \n\nFor those that are unaware my prediction for NVDA is $6k up from $4k. I look forward to contributing with my A.I. brethren.\n\nNVDA $6k", "score": 4, "replies": [{"body": "That other sub?", "score": 2, "replies": []}, {"body": "👀", "score": 2, "replies": [{"body": "Hi RG3 😔", "score": 2, "replies": [{"body": "Hi CWE 😔", "score": 2, "replies": []}, {"body": "🕵🏻‍♂️🕵🏻‍♂️🕵🏻‍♂️", "score": 2, "replies": [{"body": "🚶‍♂️🚶‍♂️🚶‍♂️", "score": 2, "replies": []}]}]}]}, {"body": "I found you finally", "score": 1, "replies": []}]}, {"body": "It’s now 867$\nI hope we hit 900$ today", "score": 6, "replies": [{"body": "I drew four lines and it looks like we’re going to the moon 🚀🚀🚀🚀🚀", "score": 2, "replies": [{"body": "They're being sued ?  Does that affect your guesses on gains . I genuinely would like to know", "score": 1, "replies": []}]}, {"body": "The opposite, 800$ soon", "score": 1, "replies": []}]}, {"body": "Between 860 and 900 all day. Futures tested support level and bounced back so overall market sentiment is strong. Need to break through 900. Gonna load up on more if we hit 860.", "score": 8, "replies": []}, {"body": "Nature is healing", "score": 3, "replies": []}, {"body": "My April 19 were so unhappy Friday. Made a few hundred dollars instead of like 20k when I sold this morning, bought March 28 $900c went green briefly. I hope the end of the week is better", "score": 3, "replies": []}, {"body": "AI remembers those that invested in it..", "score": 3, "replies": []}, {"body": "Looks like 900 is some resistance but testing it immediately in the week is a great sign. You’ll have sell orders but eventually it hopefully becomes new floor support. Just over 850 for AH Friday was great for me. This has clear psychological level support so being above is healthy. IMHO. It all becomes more clear this morning, do we continue to drop or was that a Friday sell off profit take and we are in buy in Monday again?  I’m on that thought plus a no brainer lead to conference where the real action is.", "score": 6, "replies": []}, {"body": "It wants to go up....", "score": 2, "replies": []}, {"body": "It will breach $1000 during GTC event", "score": 2, "replies": []}, {"body": "I bought a couple 3/22 $850 puts this morning to protect my longs given the possible downside risk next Wednesday.  I think I confused the algos.", "score": 2, "replies": [{"body": "Fed? \n\nA little insurance is not a bad idea.", "score": 2, "replies": [{"body": "Yep.  JPow’s speeches are all over the place, and the markets reactions to those speeches are even worse.  Good news - dump, bad news - moon and everything in between.  Nothing makes sense and I’d rather have a bit of downside protection.  That being said with my luck, the price will stay the same and theta will eat my ass.", "score": 2, "replies": [{"body": "Eh. Just don't buy a ton of coverage so to speak. State minimum is fine.", "score": 1, "replies": [{"body": "For sure.  Just a hedge against any black swan type of event next week not intended to make any significant return, but rather just to minimize any paper losses on my longs.  I'm bullish overall, just want to get past this period of volatility.  I suspect, we'll start trending back up after next week and into April.", "score": 2, "replies": [{"body": "You think we get all wibbly wobbly next week? The sub seems pretty bullish on next week", "score": 1, "replies": [{"body": "That’s precisely why.  I’ve seen too many big hyped up events fizzle out to nothing.  I always get spooked now.", "score": 3, "replies": [{"body": "I have March 28 $900C in my Roth IRA \n\nAnd April 900C in brokerage. \n\nMy Roth has NVDA shares in the high 600s, a 2026 $600C and September spreads Buy $900 sell $1000 and $1200. \n\nMy account isn't at ATH but it's gone vertical, and Im like 175,000 over my previous November 2021 ATH.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Comfy holding and waiting", "score": 2, "replies": []}, {"body": "Will it crash today or go up, any good chance it will go up?", "score": 1, "replies": []}, {"body": "The fact that we scratched 900 pre market is a good sign that bears are ghey and we're still gonna go green this week. I'm not sure why everyone is so doubtful of this stock, we literally have had nothing but good news and it has printed alot of us shit tons of money. Just don't be a fool like me and forget to set stop losses for Friday because every body wants to party with their winnings. Long term holders are big chillin rn anyways", "score": 1, "replies": []}, {"body": "Should we buy in again after a few mins after market opens ?", "score": 1, "replies": []}, {"body": "Will inflation hit the stock hard tmrw? Contemplating weather or not I should buy more not or wait", "score": 1, "replies": []}, {"body": "According to its Price History, perhaps a bad year starts when there are eight (8), \"red\" days.", "score": 1, "replies": []}, {"body": "Has everyone gone into hiding to hit the sell button? 3 comments in 24 hours....", "score": 1, "replies": [{"body": "Too hard to use this chat when it’s not sorted by new comments. Hard to scroll through every time", "score": 1, "replies": []}, {"body": "I'm about to buy more", "score": 1, "replies": []}]}, {"body": "Pre-market is already back to 900$", "score": -2, "replies": [{"body": "Will be an interesting day", "score": -1, "replies": [{"body": "It’s…not?", "score": 4, "replies": []}, {"body": "Didn't reach 900 and definitely not anymore lol", "score": -1, "replies": [{"body": "Look at the chart, reached 897$ for a moment", "score": 4, "replies": [{"body": "897 isn’t 900", "score": -1, "replies": []}]}, {"body": "It reached 904 at around 5:30am", "score": 2, "replies": [{"body": "What time is the bell and is anyone buying as soon as it opens or waiting?", "score": 1, "replies": []}]}]}]}]}]}
{"title": "This is going to climb to $1000", "selftext": "[removed]", "id": "1bc5epq", "created_utc": 1710169736.0, "score": 14, "upvote_ratio": 0.6, "num_comments": 37, "comments": [{"body": "This post is such a good example of this subreddit going to shit.\n\nLike what the fuck is this lol", "score": 45, "replies": []}, {"body": "You understand how market caps work right? NVDA and smci are not valued the same at $1000 a share. It's completely irrelevant. It's like saying Zimbabwe dollars buying power increased yesterday so US dollars should also increase", "score": 41, "replies": [{"body": "lol the logic isn’t strong with this one", "score": 12, "replies": []}, {"body": "The one benefit of NVDA is that the PE ratio isn’t nearly as high as SMCI. Your point is valid though", "score": 2, "replies": []}, {"body": "Why would Zimbabwe dollars change the price of NVDA?", "score": 4, "replies": [{"body": "Because that's where NVDA mines their vibranium to power their ai chips noob", "score": 8, "replies": []}]}, {"body": "Bad comparison yes but it’s still going to 1000 . Probably by the end of the month", "score": 1, "replies": []}, {"body": "This is everything you need that tells you it’s a bubble.", "score": 1, "replies": []}, {"body": "Just wait and watch", "score": -14, "replies": [{"body": "I'm not saying that won't happen bro, I believe in NVDA to 1k too. Just clarifying that $1000 is not $1000 when looking at companies with different market caps", "score": 14, "replies": []}, {"body": "yeah 1 needs significantly. more. Market. capitalization to reach 1k than the other", "score": 1, "replies": []}, {"body": "If you’re gonna make claims like in wallstreetbets fashion, then positions or ban", "score": 0, "replies": []}]}]}, {"body": "People think this is bearish because fans of the stock don’t know what market cap is, but it’s actually the opposite, people like round numbers and a large percentage of investors want to “get in” before it hits the round number, this drives the price up as regarded as it might be.", "score": 6, "replies": []}, {"body": "I wish 1k EOW but I don’t think that’s even possible lol (anything’s possible)… I hope we get to 900 end of week and then maybe…MAYBE 950-1k based on GTC. 1k plus EASY by the end of the year pending no disaster", "score": 4, "replies": []}, {"body": "Stabilizing at $1000 before the next earnings call would be fabulous.", "score": 3, "replies": [{"body": "will happen much earlier", "score": 2, "replies": []}]}, {"body": "Everyone can see it will be $1000+ during GTC. SMCI joins SP500 at the same time. It’s easy to predict that big gains are ahead. There could be some digestion after GTC imo, so buy ahead of GTC, not during imo", "score": 3, "replies": []}, {"body": "1000 by EOW", "score": 5, "replies": [{"body": "Would love that! Can you share why you think EOW", "score": 2, "replies": []}]}, {"body": "Just wait it’ll hit $3000 by next week", "score": 2, "replies": []}, {"body": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣I agree with $1000 but bro", "score": 1, "replies": []}, {"body": "Bro thinks chipotle is 3 times the size of nvda and doesnt fucking care.", "score": 0, "replies": [{"body": "Whoa, 2.6k a share?", "score": 2, "replies": []}]}]}
{"title": "Market this week? ", "selftext": "What’s the opinions this week after Friday sale and CPI coming Tuesday. Sitting on options that expire end of week thinking I should sell early Monday and sit week out. Thoughts  from my fellow regards? FYI  red crayons taste the best ", "id": "1bbrswp", "created_utc": 1710122515.0, "score": 10, "upvote_ratio": 0.78, "num_comments": 34, "comments": [{"body": "Nobody knows, and opinions don't count.", "score": 28, "replies": [{"body": "^  This is the only correct answer.\n\nSo many newbies post \"I think XYZ will go up this week....they've just signed a deal with....etc etc\".\n\nTrying to predict direction is really just based on hunches and opinions.\n\nOptions allow is to create non-directional trades. Newbies don't see that. Or use that. Instead they buy long calls.", "score": 9, "replies": [{"body": "Can you elaborate on the ability “to create non directional trades”?", "score": 2, "replies": [{"body": "If you buy a long call then you are predicting that the stock will go up. This is directional trading. Youre relying on the stock moving in a certain direction.\n\nIf you buy an ATM calendar, thats non-directional.", "score": 2, "replies": [{"body": "Is an ATM calendar non directional meaning you believe the stock would be trading sideways?", "score": 1, "replies": [{"body": "Its non-directional cos as a trader I am not trying to predict a move in any direction, nor its magnitude. I'm expecting the stock to stay largely where it is, and if it moves then ill adjust the trade or close it at a small loss.", "score": 1, "replies": [{"body": "Yes I understand. I have my eyes on a few stocks that will mostly be trading sideways. Curious with a calendar spread is there any risk of being assigned?", "score": 1, "replies": [{"body": "Only if the time value on the shorts is very low. This will happen if the stock moves a lot, and/or you hold close to the expiry of the short.", "score": 1, "replies": []}]}, {"body": "How is their profit to be had on an ATM calendar? If it just stays around same levels sideways, what causes the P/L? Appreciate your previous response, I’ll take a look into it.", "score": 1, "replies": [{"body": "The profit comes from the faster decay of the shorts vs the slower decay of the longs. Plus any IV rise in the longs.", "score": 2, "replies": []}, {"body": "Check out the plethora of options PnL caluvulators available online to see how you profit from different strategies, through time, and not just at expiration.", "score": 1, "replies": [{"body": "Understood. Preciate the help man", "score": 1, "replies": []}]}]}]}, {"body": "You should never buy an ATM calendar. If it goes up, you lose money. If it goes down, you lose money. ATM is where you sell a calendar, not where you buy it.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "well you're gambling, what do you think is going to happen?\n\nI'm hoping NVDA drops to post earnings level and I'll hop in for GTC hype", "score": 6, "replies": []}, {"body": "Oh I'm pretty sure it'll go up. \n\nExcept for the times when it goes down.\n\nBetween the ups and downs, there might be periods of sideways movement, as the market makes up its mind.", "score": 23, "replies": [{"body": "I can assure you the lines will move to the right.", "score": 2, "replies": []}, {"body": "This!", "score": 1, "replies": []}]}, {"body": "i really dont care which way the market moves, as long as it makes solid moves. sideways choppy trading sucks.", "score": 6, "replies": [{"body": "Buy strangles in one, sell them in the other.", "score": 2, "replies": []}]}, {"body": "You know that \"sitting on options\" doesn't tell us jack shit, right?\n\nCPI on Tues tells me there's likely to be a choppy Monday with no momentum in any particular direction, and after Tues depends on the CPI, so who the hell knows?", "score": 5, "replies": []}, {"body": "If I say that my assumption is it'll go down more, it will go up right away, and I prefer for that not to happen, so I'd rather say nothing at all.\n\nBesides that, I could sell you copium or hopium, if you need it, for the cheap rate of $10000 per message. No lowballing. I know what I've got.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Look again.", "score": 2, "replies": []}]}, {"body": "I ll keep my tesla put strike 150 until July for at least another week", "score": 1, "replies": []}, {"body": "Sideways counts as a direction bro lol", "score": 1, "replies": []}, {"body": "Well I’m hoping rocket Monday great cpi Tuesday for more gains probably red day Wednesday for people taking  profits green Thursday flat Friday", "score": 1, "replies": [{"body": "gas prices increased .70-$1 over here in Cali the past month wouldn't be a shocker if inflation is roaring", "score": 3, "replies": [{"body": "Standard spring raise to summer fuck us all pricing", "score": 2, "replies": []}, {"body": "Opec cut production", "score": 1, "replies": []}, {"body": "Gas prices can affect inflation by passing on transportation costs  but they aren’t necessarily a good indicator of inflation since there are many factors that play in oil prices.", "score": 1, "replies": [{"body": "Gas and wages and probably housing will have CPI print above estimates. YOY inflation to see uptick to 3.3% IMO. Market will sell the print, consolidate and then come slightly back up Tue.", "score": 1, "replies": []}, {"body": "Most believe CPI ex energy is more important than CPI..cpi", "score": 1, "replies": []}]}]}, {"body": "You expected a rocket Monday the day before a CPI report at a time when the market is hyper-sensitive to inflation and interest rates? So, I gather you're new to the stock market.", "score": 1, "replies": []}]}, {"body": "We know for a Fact it will move right", "score": -1, "replies": [{"body": "Is it ? Or we just rotating left???", "score": 2, "replies": []}]}]}
{"title": "Cheap Calls, Puts and Earnings Plays for this week", "selftext": "\n## Cheap Calls\n\nThese call options offer the lowest ratio of Call Pricing (IV) relative to historical volatility (HV). These options are priced expecting the underlying to move up significantly less than it has moved up in the past. Buy these calls.\n\n| Stock/C/P | % Change | Direction | Put $ | Call $ | Put Premium | Call Premium | E.R. | Beta | Efficiency |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| WMT/60.83/59.17 | 0.048% | -50.31 | $0.2 | $0.18 | 0.19 | 0.13 | 66 | 0.45 | 94.6 | \n| GDDY/115/112 | 0.092% | -4.43 | $1.1 | $0.92 | 0.39 | 0.36 | 53 | 1.06 | 63.8 | \n| CELH/87/84 | -3.51% | -14.05 | $1.25 | $2.23 | 0.5 | 0.48 | 60 | 2.34 | 62.1 | \n| ALGN/315/310 | -0.102% | 9.99 | $4.55 | $5.05 | 0.89 | 0.68 | 44 | 1.8 | 68.4 | \n| KMX/83/80 | -0.446% | 23.62 | $0.75 | $1.0 | 0.83 | 0.74 | 31 | 1.38 | 76.7 | \n| GNRC/120/117 | 1.286% | 49.33 | $1.92 | $1.2 | 0.94 | 0.8 | 52 | 1.89 | 63.3 | \n| DFS/123/119 | -0.299% | -12.53 | $0.78 | $0.8 | 0.86 | 0.81 | 43 | 1.09 | 58.9 | \n\n## Cheap Puts\n\nThese put options offer the lowest ratio of Put Pricing (IV) relative to historical volatility (HV). These options are priced expecting the underlying to move down significantly less than it has moved down in the past. Buy these puts.\n\n| Stock/C/P | % Change | Direction | Put $ | Call $ | Put Premium | Call Premium | E.R. | Beta | Efficiency |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| WMT/60.83/59.17 | 0.048% | -50.31 | $0.2 | $0.18 | 0.19 | 0.13 | 66 | 0.45 | 94.6 | \n| GDDY/115/112 | 0.092% | -4.43 | $1.1 | $0.92 | 0.39 | 0.36 | 53 | 1.06 | 63.8 | \n| CELH/87/84 | -3.51% | -14.05 | $1.25 | $2.23 | 0.5 | 0.48 | 60 | 2.34 | 62.1 | \n| ANET/270/265 | -1.96% | -16.25 | $2.8 | $4.45 | 0.76 | 1.37 | 52 | 1.39 | 64.0 | \n| DHR/255/250 | -0.508% | 21.03 | $1.32 | $2.42 | 0.82 | 1.03 | 45 | 0.97 | 53.8 | \n| KMX/83/80 | -0.446% | 23.62 | $0.75 | $1.0 | 0.83 | 0.74 | 31 | 1.38 | 76.7 | \n| TTD/83/80 | -0.203% | -16.07 | $1.09 | $0.74 | 0.84 | 0.86 | 59 | 2.42 | 75.4 | \n\n## Upcoming Earnings\n\nThese stocks have earnings comning up and their premiums are usuallly elevated as a result. These are high risk high reward option plays where you can buy (long options) or sell (short options) the expected move.\n\n| Stock/C/P | % Change | Direction | Put $ | Call $ | Put Premium | Call Premium | E.R. | Beta | Efficiency |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| ORCL/115/112 | 0.705% | 4.1 | $4.78 | $3.88 | 3.87 | 3.95 | 0.5 | 0.9 | 96.5 | \n| ADM/56/54 | -0.113% | 12.01 | $1.12 | $1.32 | 2.65 | 2.26 | 1.0 | 0.69 | 87.7 | \n| DLTR/149/145 | -0.535% | -12.76 | $4.9 | $6.0 | 3.77 | 3.81 | 2.0 | 0.82 | 93.6 | \n| WSM/240/230 | 0.479% | -5.46 | $6.6 | $8.35 | 1.65 | 1.88 | 2.0 | 1.44 | 72.3 | \n| LEN/165/160 | -0.621% | 24.7 | $2.95 | $3.8 | 2.23 | 2.45 | 2.0 | 1.27 | 83.6 | \n| ULTA/550/537.5 | 0.498% | -17.65 | $19.3 | $18.5 | 4.03 | 4.08 | 3.0 | 1.04 | 74.6 | \n| ADBE/565/555 | 1.46% | 9.14 | $24.15 | $18.17 | 3.84 | 3.76 | 3.0 | 1.44 | 86.9 | \n\n\n- **Historical Move v Implied Move:** We determine the historical volatility (log variance of daily gains) of the underlying asset and compare that to the current implied volatitlity (IV) of the option price. This is used to determine the Call or Put Premium associated with the pricing of options (implied volatility).\n    \n- **Directional Bias:** Ranges from negative (bearish) to positive (bullish) and accounts for RSI, price trend, moving averages, and put/call skew over the past 6 weeks.\n\n- **Priced Move:** given the current option prices, how much in dollar amounts will the underlying have to move to make the call/put break even. This is how much vol the option is pricing in. The expected move.\n\n- **Expiration:** 2024-03-15.\n\n- **Call/Put Premium:** How much extra you are paying for the implied move relative to the historic move. Low numbers mean options are \"cheaper.\" High numbers mean options are \"expensive.\"\n\n- **Efficiency:** This factor represents the bid/ask spreads and the depth of the order book relative to the price of the option. It represents how much traders will pay in slippage with a round trip trade. Lower numbers are less efficient than higher numbers.\n\n- **E.R.:** Days unitl the next Earnings Release. This feature is still in beta as we work on a more complete list of earnings dates.\n\n- **Why isn't my stock on this list?** It doesn't have \"weeklies\", the underlying is \"too cheap\", or the options markets are too illiquid (open interest) to qualify for this strategy. 480 underlyings are used in this report and only the top results end up passing the criteria for each filter.", "id": "1bc3z6c", "created_utc": 1710165910.0, "score": 123, "upvote_ratio": 0.98, "num_comments": 61, "comments": [{"body": "I’ve been following these list every time you post. I really feel like it’s going to end up helping me a lot. \n\nDo you post that report you mentioned above? \n\nAlso, when a ticker appears under both the puts and calls section. What does that mean", "score": 6, "replies": [{"body": "Good stuff. Yeah... I am trying to surface a \"menu\" and also educate along the way. Not trying to be a \"trade this with me in real time\" type of guru. Just hoping to expose a probablistic way of thinking to everyone in the options space.   \n\n\nIf a ticker is in both tables it doesn't mean anything besides it met the criteria of both.   \n\n\nnormally if puts are cheap then so are calls (not always tho).", "score": 13, "replies": [{"body": "I assume the cheap puts equivalence to cheap calls is governed by the put/call parity, but in what scenario would that not be the case?", "score": 1, "replies": [{"body": "Well a lot of times a stock gets irrational - say SMCI - and the calls are expensive and puts are cheap - or vice versa. \n\nOr say FOMC is coming up, people want to hold outs for protection until the event is over so puts look expensive and calls are cheap (relative to puts) \n\nPut call parody is theoretical, like black Scholes. In reality the market do what it does.", "score": 1, "replies": [{"body": "Which I assume is what leads to the view that they could be “mispriced” and hence profited against", "score": 1, "replies": [{"body": "Yes correct. No free lunch but this analysis should highlight the most bid up options and the most ignored. An attempt to capture human behavior measured against the historical move of the underlying. Are they overpaying?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I've been seeing these posts every week - wondering if you have done a historical analysis of how buying these cheap options has fared from past weeks.", "score": 5, "replies": [{"body": "I have it all documented and public, week over week, every trade and every table. I am not allowed to post/share it in this sub unfortunately but it’s out there. I update it each week as week since may of 2023", "score": 11, "replies": [{"body": "Where can we see it?", "score": 2, "replies": []}, {"body": "I'd like to see the table, please, if it's not to much trouble.", "score": 1, "replies": [{"body": "Google “best options report results” \n\nI can’t link it", "score": 1, "replies": []}]}, {"body": "You can inbox me since you can’t post! I’ll take any tips ( especially the one in your pants ) !", "score": 1, "replies": []}]}]}, {"body": "I understand the methodology, don't really understand the alpha. Unless there's a directional bias and impetus for non ER stocks, this just says the theta decay is low. \n\nI could run a screen that tells me the cheapest PE companies- doesn't tell me anything.\n\nAm I missing the point?", "score": 4, "replies": [{"body": "Not necessarily missing the point nor the supposed alpha. \n\nJust read the first bullet on HV and IV - that is the core of the concept. \n\nIf you had a screener that showed you lowest PE and then compared that to something like the fair value of its comps average PE you could say that company x is cheap or expensive relative to its peers or it’s discounted cash flow. \n\nWhat is the market pricing it at?\nWhat is it’s fair value?\n\nThe difference is the alpha.", "score": 1, "replies": [{"body": "Got it, I don't see that alpha but appreciate you sharing to the community.", "score": 2, "replies": [{"body": "No problem. Stay skeptical!", "score": 2, "replies": []}]}]}]}, {"body": "Thank you sir! Hopped on the WMT calls early this morning. Keep up the good work.", "score": 3, "replies": [{"body": "Same. Made a few bucks on it. Much appreciated, OP! Thank you. :)", "score": 1, "replies": []}]}, {"body": "Please state your methodology, with citations. \n Why should we believe you?", "score": 7, "replies": [{"body": "Hey I am a bit confused by this but I will do my best. Bottom line is I am happy to explain and clarify to Mods or anyone else. \n\nMethodology: It is articulated in the post itself towards the bottom. That is the written explanation. In short... I look at the HV of the underlying by finding the standard deviation of the average daily move during the trailing 45 days. This is how much the stock has actually moved in the past. This is used as an assumption of what the next 45 days might be in terms of a move up or down.   \nWe then compare that HV to the IV found in the options market.   \n\n\nOften times the market is bidding up (or down) the price of the future move over the next \\~45 days. \n\nThe relationship between HV and IV is what we use to determine if an option is \"expensive\" or \"cheap.\"\n\nI could provide further information, but it is against the rules of the sub to use links or direct anyone to more information - so I don't do that. I actually reached out to the mods a while back and it was made clear that it was fine to share the report I generate but NOT to promote anything - so I don't (and won't). I want to add valuable content for the sake of the community - and do so in a way that is both compliant and helpful. \n\nCitations: Not sure how to answer that. The data comes from Polygon, OPRA and IBKR. I I use real market prices to determine HV and I use current real time prices (at the time this is generated) to determine IV. \n\nWhy should we believe me? You absolutely shouldn't have any \"beliefs\" in financial gurus, personalities or their suggested strategies. You should do your own research and make your own informed decisions - and then believe in yourself and your convictions. \n\nI do track each and everyone of these reports AND their results as if every suggested trade was taken. I make that publicly available to anyone interested. \n\nI hope that helps clarify! Let me know what else I can do to improve.", "score": 28, "replies": [{"body": "Thank you.  \n\nThe request is for the forum generally, and desiring, for new to options people, description for how to think about  undertaking a similar analysis.", "score": 6, "replies": [{"body": "Awesome and understood. Hoping this explanation delivered on that.   \n\n\nAny other way to improve upon this further? I always do my best to try and answer questions in the comments but the ideal state is that the post itself is explanatory enough to not lead to any questions (working on that...)", "score": 8, "replies": [{"body": "You're welcome.  If I have suggestions, I will pass along.", "score": 1, "replies": []}]}]}, {"body": "So if I have a good forecast of volatility could you use that to enhance this whole thing? Instead of the 45 day average Hv or whatever standing in as a naive prediction ( naive does not mean bad obviously)", "score": 1, "replies": []}]}]}, {"body": "can you do a list of expensive puts going into earnings?", "score": 2, "replies": [{"body": "love it.   \nI post these in thetagang for the put sellers!", "score": 7, "replies": [{"body": "Why are the companies overlapping between the call recommendations and the puts recommendations?", "score": 2, "replies": [{"body": "The chart is weird at first. OP gives ticker then high/low. Calls the change in + or - and sows the price for the option. \n\nSo Walmart 60.83c or 59.17p.  -50 direction. Put cost .20 ($20) for 1 put contract. (If I’m reading this right).", "score": 1, "replies": []}]}]}]}, {"body": "Gonna try a couple out. Thank you! I Hope lol", "score": 2, "replies": [{"body": "Just keep the positions small sir! Chip and a chair. \n\n&#x200B;\n\nIf you are not familiar with Kelly Criterion check that out !", "score": 6, "replies": [{"body": "Going to look into that, thank you.\nI’m new to all this. I went with Walmarts play and so far it’s working out pretty well!", "score": 3, "replies": []}, {"body": "I took the short on your Walmart position last week, but forgot to place the long side and ended up losing a couple hundred bucks on my first trade, sucked for me but I appreciate the effort that you put out", "score": 0, "replies": []}]}, {"body": "Which you going with", "score": 3, "replies": [{"body": "Went with Walmart. Call. I only have $100 in my account so I did 1 contract. Kinda wish I had done more now but I’ll take small gains as I go. I’m not greedy", "score": 2, "replies": [{"body": "Put or call. I get lost when his report has it listed under both.", "score": 2, "replies": [{"body": "My bad I did a call", "score": 2, "replies": [{"body": "I got you. I bought his put option, but I got a exp for 3/22 for $7. See what it does.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Stocks/C/P? Does C and P stand for calls and puts here?", "score": 2, "replies": [{"body": "Yep, better explanation towards the bottom.   \nC/P is the call and put strike used in the analysis", "score": 5, "replies": []}]}, {"body": "Very new to options. Learning right now. What does the Stock/C/P mean? At first I thought it meant the tp and sl then assumed it meant the order limit. Would greatly appreciate if you could clarify. Thank you", "score": 2, "replies": [{"body": "No worries. A common question...   \n\n\nThe answer is found in the bullets towards the bottom.   \n\n\nShort answer: the C is the call used in the analysis and the P is the put used in the analysis. These are the strikes of the options used in the reports.", "score": 2, "replies": []}]}, {"body": "Thank you for sharing your research and valuable time with me. Much appreciated. Which brokerage do you use and can you share the reasons? Thank you for your time.", "score": 2, "replies": []}, {"body": "I am a little confused. In the section: cheap calls, why is there stock/call/put? Such as gddy/115/112? Why is put strike listed in the cheap call section?\n\nDo you mean call 115 is cheap and at the same time put 112 is cheap as well?\n\nAnd, the cheapness is based on the data on Monday? Do you update the list after Monday?", "score": 2, "replies": [{"body": "It’s all explained in the bullets at the end good sir. \n\nThe 115 and the 112 are the strikes used in the analyses. \n\nEach day the list is updated", "score": 1, "replies": [{"body": "Still do not get it. Help me please. Gddy / 115 /112 appear in both tables. So, these are the strikes used in analysis. Does it mean that both 115 call and 112 put are cheap. So, we should buy both? \n\nStill need more explanation.\n\nThanks for updating each day.", "score": 1, "replies": [{"body": "No “should” \n\nJust info sir. \n\nYour understanding is correct", "score": 1, "replies": []}]}]}]}, {"body": "u/intraalpha thank you. I did the Walmart call play. Bought the units at .12 and sold them for .31.\n\nWas my second ever contract and my bankroll is limited so I did 1 contract. Still came out ahead.\n\nNow need to figure out my next moves lol.\n\nGonna do some reading on the way you came to these conclusions based off your explanation but today looks like a bad day to buy calls", "score": 2, "replies": [{"body": "Nice win sir!", "score": 2, "replies": []}]}, {"body": "This is a great list.  thanks.", "score": 1, "replies": [{"body": "Gotchu", "score": 1, "replies": []}]}, {"body": "Thank you!", "score": 1, "replies": []}, {"body": "Almost all of the options from the first list, if bought a call, resulted in immediate profit. Lul.", "score": 1, "replies": [{"body": "🚀", "score": 2, "replies": []}]}, {"body": "wanted to say thank you!", "score": 1, "replies": [{"body": "No prob brother hope it helped", "score": 2, "replies": []}]}, {"body": "Iyo is it too late to get into this?", "score": 1, "replies": []}, {"body": "I jumped on the WMT call (3/15 expiration) this morning and doubled up quickly.", "score": 1, "replies": []}, {"body": "So these are plays \"for this week\"...but how long during this week are they most viable? I'd assume the earlier the better?\n\nObviously we still need to look at the charts before getting into any, to make sure the move hasn't already happened.", "score": 1, "replies": []}, {"body": "Reading this right after I've decided to pick up some CELH calls tomorrow. Even tho the stock jumped today I still have a good feeling bout it.", "score": 1, "replies": []}, {"body": "What's the time frame you're operating in? How many DTE for each of these?", "score": 1, "replies": [{"body": "Expiration March 16 - listed at the bottom. Also title says “this week” \n\nI post 45 dte in thetagang and post the weeklies here", "score": 2, "replies": []}]}]}
{"title": "Options Questions Safe Haven Thread | March 13 - 19 2024", "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions.**  &nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING,  PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)    \n[..](https://www.reddit.com/r/optionsmods/wiki/)   \n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling retrieves.**   \n**Simply sell your (long) options, to close the position, to harvest value, for a gain or loss.**  \n**Your break-even is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**    \n\n**Also, generally, do not take an option to expiration, for similar reasons as above.**\n\n---\n\n**Key informational links**  \n•&nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n•&nbsp;[Binary options and Fraud (Securities Exchange Commission)](https://www.sec.gov/files/ia_binary.pdf)   \n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)     \n•&nbsp;[Options Trading Introduction for Beginners (Investing Fuse)](https://investingfuse.com/options-trading-for-beginners/)    \n•&nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n•&nbsp;[Options Trading Concepts -- Mike & His White Board (TastyTrade)(about 120  10-minute episodes)](https://www.youtube.com/playlist?list=PLPVve34yolHY43YaBegHMzN9WjrTnQfFr)  \n•&nbsp;[Am I a Pattern Day Trader? Know the Day-Trading Margin Requirements (FINRA)](https://www.finra.org/investors/learn-to-invest/advanced-investing/day-trading-margin-requirements-know-rules)   \n•&nbsp;[How To Avoid Becoming a Pattern Day Trader  (Founders Guide)](https://foundersguide.com/pattern-day-trader/)    \n\n---\n\n**Introductory Trading Commentary**   \n&nbsp;&nbsp;&nbsp;•&nbsp;**[Monday School Introductory trade planning advice (PapaCharlie9)](https://www.reddit.com/r/options/wiki/faq/pages/mondayschool)**  \n&nbsp;&nbsp;**Strike Price**   \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&nbsp;&nbsp;**Breakeven**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&nbsp;&nbsp;**Expiration**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Expiration & Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&nbsp;&nbsp;**Greeks**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Pricing & The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&nbsp;&nbsp;**Trading and Strategy**    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Fishing for a price: price discovery and orders](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_minimizing_bid-ask_spreads_.28high-volume_options_are_best.29)     \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[The three best options strategies for earnings reports (Option Alpha)](https://optionalpha.com/blog/the-three-best-option-strategies-for-earnings)   \n\n---\n\n**Managing Trades**  \n•&nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&nbsp;[The diagonal call calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction, trade size, probability and luck**  \n•&nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/trade_planning)  \n•&nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&nbsp;[Applying Expected Value Concepts to Option Investing (Select Options)](http://www.selectoptions.com/Edu-Expected-Result)  \n•&nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)    \n•&nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)    \n•&nbsp;[Poker Wisdom for Option Traders: The Evils of Results-Oriented Thinking (PapaCharlie9)](https://www.reddit.com/r/options/comments/qfq82a/poker_wisdom_for_option_traders_the_evils_of/)   \n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/price_discovery)  \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)  \n\n\n**Closing out a trade**  \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position/)       \n•&nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/risk_reward_and_exits)   \n •&nbsp;[Guide: When to Exit Various Positions](\nhttps://www.reddit.com/r/options/wiki/faq/pages/whentoexit)   \n•&nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)   \n•&nbsp;[5 Tips For Exiting Trades (OptionStalker)](\nhttps://www.reddit.com/r/options/comments/qtwsm5/5_tips_for_exiting_trades/)   \n•&nbsp;[Why stop loss option orders are a bad idea](https://www.reddit.com/r/options/wiki/faq/pages/stop_loss)   \n\n---\n\n**Options exchange operations and processes**     \n•&nbsp;[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n•&nbsp;[Options that trade until 4:15 PM (US Eastern) / 3:15 PM (US Central) -- (Tastyworks)](https://support.tastyworks.com/support/solutions/articles/43000435335-options-that-trade-until-3-15-pm-central-)  \n\n---\n\n**Brokers**   \n•&nbsp;[USA Options Brokers (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/brokers)    \n•&nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)  \n\n---\n\n**Miscellaneous: Volatility, Options Option Chains & Data, Economic Calendars, Futures Options**   \n•&nbsp;[Graph of the VIX: S&P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&nbsp;[A selected list of option chain & option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021, 2022, 2023, 2024](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2024)\n---\n\n---", "id": "1bc52sn", "created_utc": 1710168873.0, "score": 11, "upvote_ratio": 0.92, "num_comments": 286, "comments": [{"body": "Can someone explain to me why occasionally the bid/ask price of an option rises/drops rapidly right before market close? Like literally last 15 seconds.", "score": 2, "replies": [{"body": "The \"price\" shown on broker platforms is an imaginary number, the mid-bid-ask.  \n\n\nIf a large market order near the close clears out the queued bids, or asks, the remaining bids and asks will  skew the platform calculation of mid-bid-ask  values. ", "score": 2, "replies": []}]}, {"body": "Hey guys, I’m new here and have been trading for the past 6 months. I got lucky on NVDA CRWD META and all those AI/Tech surges and was bringing in roughly 2k per month (mostly unrealized gains). Then Friday/Monday they crashed. \n\nI’m stuck in  some really bad positions but I don’t know enough to hedge. I have one expiring on the 15th… The others I have a month or two. I’m also stuck in some bad biotech positions. If anyone could please provide an opinion on how most traders would handle my ports situation PLEASE chime in.\n\nThe numbers are my total gains and losses on the stocks. OKTA is making me very nervous. I got overconfident and need help I’ve dipped down 2,100 since Friday 😵‍💫\n\nScreenshots of my bad positions: https://imgur.com/gallery/HpbdD9g", "score": 2, "replies": [{"body": "Good traders take gains to reduce capital and gains at risk. And Exit when their theory was invalidated.  .   Hedging involves paying, increasing risk by putting more capital in a trade.    Effective   traders establish before their trade starts:    \n\n\n- An Exit for an intended  gain.   \n- An Exit for maximum intended loss.  \n- An Exit for maximum I tended time in the position.    \n- An Exit for unexpected underlying movement.        \n\n\nOn mamaging long calls, from the links above:     https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls", "score": 2, "replies": [{"body": "Thanks I started to read through those", "score": 1, "replies": []}]}, {"body": "* we cant undo bad decisions after the fact.\n* hedging only works in advance, and hedging doesnt only keep you from making losses, it also keeps you from making gains.\n\nim suspecting your problem has more to do with risk management, position sizing, diversification, that sort of stuff.", "score": 1, "replies": [{"body": "Yep you’re spot on", "score": 2, "replies": []}]}]}, {"body": "Why does this sub so against getting assigned?\n\nI want to own 100 shares of SPY and I'm selling 1 dte puts everyday for the price I want. \n\nWhat's the downside of getting assigned vs buying the shares outright?", "score": 2, "replies": [{"body": "Selling puts to get assigned can make sense.\n\nMost here are newer traders who may not have the account size to get assigned, or it would over allocate the account and farther drops might force liquidation, so they fear being assigned.\n\nThe many who trade the wheel are fine with being assigned as they both have the cash in the account and have researched the stocks to trade those they don't mind holding.", "score": 3, "replies": []}, {"body": "Selling puts is a reasonable method for assignment, in which one is recieving shares at a discount  via the option premium.", "score": 2, "replies": []}, {"body": "It's not that the sub is against getting assigned *on purpose*. It's getting assigned on accident, because the trader didn't consider assignment risk, that's the problem.\n\nFWIW, a drawback of your scheme is that if SPY closes up every day, you never get to buy shares AND you miss out on the rally, versus just buying shares from day 1. Conversely, if SPY tanks 5% in a single day, you end up spending a lot more money to buy shares than if you had just bought the dip, or you lose money closing the put.", "score": 2, "replies": []}, {"body": "most options \"investors\" actually just seek to make lots of money speculating on price changes. they sell options, hoping they will expire worthless. they don't really want to hold the shares. they want to take the money and run. and if that is their goal, assignment is detrimental.\n\nbut if you use options as a strategic investment, and you either dont mind holding shares, or its even desirable. then theres no problem with getting assigned.", "score": 1, "replies": []}]}, {"body": "What is wrong with naked VXX Puts?\n\nNew to trading.  I typically just put everything in SPY but now have funds to take some higher upside positions.  I’m starting with ~10k and put half in $15 1/25 VXX puts @ $4.50 and half in $10 1/25 VXX puts @ $1.50.  My thoughts are to hold until about three months before expiration, then roll the position into other VXX puts that are a year out.  I’m reading here that makes puts are taking on more risk than you have to but don’t understand why..", "score": 2, "replies": [{"body": "If your question is why most may not buy put options, then it may be because the market and stocks tend to move up over time. Long puts will lose unless the stock drops by enough to offset the cost to buy along with the theta decay of the premium.\n\nWhy trade VXX? This is a S&P 500 VIX Short-Term Futures ETN which is more complex than a standard stock issue.\n\nSince you are posting this in the safe haven thread it would seem to be a higher risk than a simple stock or ETF for a new trader . . .", "score": 2, "replies": []}]}, {"body": "I'm new to options so please bear with me. I have a stock (CLOV) that I was going to sell so I wrote a covered call. I sold an option for .50 with a premium of .32. In my mind I would think that anything less then .82 would result in the option expiring worthless. Instead with the price at end of day at .79 it was assigned. Why would someone complete the option when they could have bought it for less money in the market? Is it because it was in the money?", "score": 2, "replies": [{"body": "If you sold to open a call at at .50 strike and it expired when the stock was as .79, then buying at .50 is better than .79. The call is in the money so it’s worth exercising.\n\nI think what is confusing you is you are assuming that the person who paid you the premium is the same person who exercised the call.  This isn’t necessarily the case.  You have no idea who is actually exercising your call.  Always assume if you are ITM at expiration that your short will be assigned.", "score": 3, "replies": []}, {"body": "If someone is holding a long 0.50 strike call, the stock is at 0.79 at expiration, and for whatever reason they haven't sold the option, their two remaining choices at that point are to exercise it or allow it to expire without exercising.\n\nIf they allow it to expire without exercising, they lose all the premium they paid.\n\nBut if they exercise, they can buy shares at 0.50 and sell them at 0.79, making back 0.29 per share.  Regardless of how much premium they paid, it's better to do that.  So they exercise.", "score": 3, "replies": []}]}, {"body": "Started trying to learn options. Bought 15 contracts of vld 0.5 with an average cost of .10. Expiration date 4/19. Bought on friday. Not sure if that was a good idea or dumb but worst case scenario I'm out only 150$", "score": 2, "replies": [{"body": "Why open this trade? What do you expect to happen? And what is your plan to close?", "score": 2, "replies": [{"body": "Cause I think VLD is gonna go up and I'm just trying to learn options with small amounts. Same as question 1. My plan is to preferably go up and sell the contracts.", "score": 2, "replies": [{"body": "OK, you bought a Call which gives more detail.\n\nThe stock is around .47 but your option is down to around .075 of value. With 15 contracts this is .025 loss x 1500 = -$37.50.\n\nHow much will you let the trade lose before closing? What is your profit target to close if it does go up?\n\nAre you aware there is an earnings report on 3/26? These can be unpredictable as no one can know how the stock may move once the report comes out. Many traders avoid having positions open over an ER because of this risk. \n\nThe learning here is to make a plan for why you are opening the trade, what you expect to happen, and how to handle the position if it goes to the plans profit or loss amounts . . .", "score": 2, "replies": [{"body": "They just recieved a contract with the navy. So I expect it to go up and the er to be good. Like I said the Max loss is 150$ which I did on purpose to just learn what I'm doing so I'm not really worried about losing all of the money. I have 1500$ invested in the stock itself. This was more for learning. I don't have a profit target. I'd just he happy to make any profit. When I made this contract I went in with the expectation to lose money while I learn what I'm doing.", "score": 1, "replies": [{"body": "You said you wanted to learn, and what I posted is what will help you learn how to trade options . . .", "score": 0, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Bought some GOOG Jul $145 calls last week and am already up 45%. yada yada yada no one ever went broke taking profits, im always one to lock in profits around 40% but in this case i feel like GOOG will recover further and expiry is still pretty far out. What would you do in this situation?", "score": 1, "replies": [{"body": "there are loads of things you can do:\n\n- close the position\n\n- close half of the position\n\n- write a call with a higher strike to turn the long call into a spread\n\n- hold on to the position as is.", "score": 2, "replies": []}, {"body": "You can exit, take gains, without risking the larger position.  And re-enter with less capital at risk. \n\nFrom the educational links above,  \n\n\"Managing long calls, a summary\"  \n\nhttps://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls", "score": 1, "replies": []}, {"body": "You don't have to give up on your 40% take-profit discipline. Just close, bank some of the proceeds, use the rest to buy back in at a much cheaper price and/or different expiration. A bankroll management scheme I like to use is to bank the original capital at risk plus half of the profit, then use the other half of the profit to buy back in with a cheap OTM call. For example, if I put $1000 at risk and close for a $400 profit, I put $1200 in the bank and spend $200 on a new OTM call. That way, even if the new call is a total loss, I still made a profit on the original trade.", "score": 1, "replies": [{"body": "Thank you dad ended up doing just this", "score": 1, "replies": []}]}]}, {"body": "Are there any good guides/videos on how to cover your calls with puts and which strikes to pick?", "score": 1, "replies": [{"body": "a put cannot cover a call, they're fundamentally different contracts.\n\na long call option is the right to buy  and a short call is the obligation to sell. a long call is the right to sell and a short put is the obligation to purchase.\n\nan obligation to sell cannot be covered with a right to sell. \n\na call can be covered in two ways: either by holding shares, or by a different call with a lower strike.", "score": 2, "replies": []}, {"body": "Hundreds.  None particularly great. \n\nWhat is your actual question?", "score": 2, "replies": []}, {"body": "\"Cover\"? Not sure what this means. Cover with stock shares? Covered with cash in case of being assigned? Cover by hedging with another option?\n\nStrikes to pick can be based on the Delta which will approximate the probability of the trade being profitable. Read this on how Delta works - [https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981](https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The top advisory of this weekly thread, above all of the other educational links, is to almost never exercise, and sell for a gain.", "score": 3, "replies": []}, {"body": "no, when you STC you simply sell the contract and you sell the right to purchase with it.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Normally in that case you would want to sell the option and buy the shares on the open market, because the option probably still has extrinsic value.\n\nIf you did want to exercise, it depends on your brokerage platform.  Some allow you to do it by clicking a button online, others require you to contact them.  But again, normally exercising is not the right thing to do.", "score": 1, "replies": []}, {"body": "If you want to buy IRBT at $11 (your strike price), I would just buy the stock at the market price of $10.66. You could just throw the $0.34 away.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Are you serious? \n\nIf you are ITM you sell in the afternoon on Friday. If you want the stock you just buy it. \n\nOr you let the option expire and you will be assigned. You buy the stock at the strike price. \n\nIs this a trick question?", "score": -2, "replies": [{"body": "Exercise by exception, or the automatic exercise of a long option that is ITM as of market farket close on the expiration date, is still exercise. It's not assignment.\n\nBut OP seems to be selectively ignoring comments and not engaging with the fact that it's better to sell than exercise even if you want the shares.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Note that it's the option, not the stock, that is \"in the money\" or \"out of the money,\" and you can sell to close your option at any time, regardless of whether it's ITM or OTM, or whether it's at a profit or a loss.  It's possible for your option to be profitable even if it's not ITM, and you may decided to close it at that time.", "score": 2, "replies": []}]}, {"body": "I am trying to set up a long iron condor and I am not doing something correctly.  All tutorials talk about it having a 1 risk to roughly a 2-3 reward ratio but every time I try to set one up, they are either a 1 risk to 1 reward or even less of an reward.  \n\nNot sure what I am doing incorrectly.", "score": 1, "replies": [{"body": "> I am trying to set up a long iron condor\n\nWhy? That's a very rare bird that usually doesn't have a good reason for being traded.\n\n> All tutorials talk about it having a 1 risk to roughly a 2-3 reward ratio but every time I try to set one up, they are either a 1 risk to 1 reward or even less of an reward.\n\nYou may not be doing anything incorrectly, apart from trading a long IC in the first place. The likely problem is that **the market is not required to provide you with your desired risk/reward ratio**, and usually doesn't, when it comes to vertical spreads and similar.\n\nFor example, I usually want $.34 per dollar of spread width for my vertical OTM credit spreads, but I rarely find spreads that offer that much credit. They might come close, like $.31 or $.32, but a lot of the time they aren't even that good. And the wider the spread width, the less likely to find my desired risk/reward.\n\nThe same applies to ICs, both long and short.", "score": 1, "replies": [{"body": "I appreciate the input.   I’m looking for a neutral strategy with a trade can profit both ways with a moderate price move.   Is a long iron condor not the best option strategy for this situation?\n\nWould a short butterfly be better?", "score": 1, "replies": [{"body": ">  I’m looking for a neutral strategy with a trade can profit both ways with a moderate price move.\n\nA long IC needs a *large* price move to profit, assuming you pick OTM strikes for the wings. And the profit is capped, which is usually the reason people avoid it.\n\nYou can compare with long straddles or long strangles. Long strangles have a similar neutral directionality to a long IC, but have uncapped profit. They tend to cost more than long ICs, all else equal, since you don't have short legs to discount the cost of the long legs.", "score": 1, "replies": [{"body": "From what I read, strangles and straddles have wider BE because of the initial upfront cost therefore a big move is needed to break even.\n\nI am looking for better break even points since I am looking for a move in either direction but not a massive move that’s often required for a strangle/straddle. \n\nFrom what I have read, a long IC or a short butterfly have have better BE points compared to the straddle/strangle.  While I would lose out on unlimited profit, I would like to increase my win rate with better BE points.", "score": 1, "replies": []}]}]}]}]}, {"body": "I had sold a March 8 512 put. SPY closed at 511.72 on March 8. Why did I not get assigned since my put went in the money? It just shows in my fidelity activity that put expired", "score": 1, "replies": [{"body": "On that date, SPY went back above 512 in after-hours trading, remaining there until 5:30, which is the deadline for choosing to exercise/canceling the exercise-by-exception.  Likely some long holders chose to cancel the exercise.", "score": 2, "replies": [{"body": "Great thanks", "score": 1, "replies": [{"body": "This is why traders exit before end of trading on expiration day, to have certainty.", "score": 3, "replies": []}]}]}]}, {"body": "Very new to options as a retail investor so please be gentle, just some research really to better my understanding. I know what I want to understand how to achieve but interested in how to go about it practically, happy to read one of the posts above if one could be recommended. Also UK based which may limit options (pun intended) in reality.\n\nI don't want to go anywhere near naked shorts so say there is a company which in the next say 3 months I think will go down. I am happy to pay a premium to be wrong but want to limit that risk to say £100 to make it simple with the maximum upside if the price goes down from where it is expected to be. How do I a) find out what the offered price is in 3 months so I can decide if it will be lower than that based on today's price and b) trade against that price with a maximum risk of £100\n\nSorry if I have not explained that and thank you", "score": 1, "replies": [{"body": "There is no way to know what the stock price will be in 3 months as no one can tell the future. \n\nYou need to make a prediction of how much the stock will drop and when. Then based on this prediction you can buy a put that should profit if in fact the stock drops.\n\nBuying puts ITM around a .80 to .90 delta would see the option move closely to the stock as it drops, but may cost more than the price you want to pay. You can buy a lower delta put which can still work if the stock drops as expected, but it will not profit as much.", "score": 2, "replies": []}]}, {"body": "How to calculate extrinsic value properly?  When buying OTM options, how can you tell how much of the price is determined by IV and how much of the price is time value? Is there a way to evaluate if it's a good time to buy?", "score": 1, "replies": [{"body": "Out of the money is defacto 100% extrinsic value. \n\nIV above zero means that some of the extrinsic value is about volatility, not time value (related to risk free interest rates).", "score": 2, "replies": [{"body": "Time value contains \"all the Greeks\" and it is a synonym for \"extrinsic value\" it's impossible to isolate value related to volatility and separate it from value related to time, rates, price etc.\n\n- IV is never below zero or anywhere near zero. Iv of zero would mean the market isn't expected to move at all. Which is rediculous. Infact there is a theoretical limit on how low iv can go. It's somewhere around 9%.\n\n- Time value is not related to the risk free rate. Although it is true the risk free rate is used to calculate the theoretical value of an option. Because a market Maker has to borrow money to hedge his risk.", "score": -1, "replies": [{"body": "> Time value is not related to the risk free rate.\n\nThat is not true. For one thing, put/call parity. For another, the market considers interest rates when pricing contracts, otherwise an arbitrage would be created. For example, you can contrive of a situation where shorting shares is synthetically the same as buying a long put, in terms of directional payoff, but the value of shorting shares is clearly sensitive to interest rates (because you can deposit the cash proceeds of the short in a risk-free interest-bearing asset, like a T-bill), so the long put must necessarily also be sensitive to interest rates, or else you'd be able to arb the difference.", "score": 1, "replies": [{"body": "Shorting stocks is sensitive for because it is in essence a loan. you need to borrow money to short stocks. But were here in options, and that's not really relevant. \n\nshorting stocks is not the same as buying a put. youre thinking of a short synthetic (i guess.) There is no arbitrage opportunity, because as i mentioned, the risk free rate is a factor because of dynamic delta hedging. and a factor in borrowing stock.", "score": -1, "replies": [{"body": "When you short a stock, you *receiv*e money and are *paid* interest (if it is not hard to borrow).  You are not borrowing money (you are borrowing the stock to sell).  You are receiving money.\n\nA professional trader, will typically receive slightly less than then his credit balance rate for short stock, commonly known as \"short stock rebate.\"", "score": 1, "replies": [{"body": "When you short a stock, you borrow stocks to sell, and then receive money. Borrowing stocks costs money just as borrowing money does.\n\nThat is why the risk free rate is involved.\n\nShorting stock is also only relevant to put side delta hedging. And is irrelevant for Call-Side delta hedging.", "score": 0, "replies": [{"body": "You are wrong here, shorting stock does not cost money (if it is not hard to borrow.)  You make money in interest as you sell the borrowed stock.  Here is the way it works for me with a PM account.  Say I have 1 million in the account.  I short 1 million worth of stock and buy 100,000 worth of puts.  I have a credit balance of 1.9 million (1 million in short stock, 1 million in cash, less the 100,000 debit for the puts).  Its broken up as 900,000 where I receive a credit balance rate of 4.95%  On the short 1 million of short stock I receive 4.60% which is labeled \"short stock rebate\" My short stock rebate rate is .35 below my credit balance rate.\n\nI was a MM for 25 years and trade upstairs for the last 10 years.  This is all I do.  I used this short stock rebate rate to figure out every reversal/conversion I put on.  I just filled my tax return with a large short stock rebate interest credit on it.\n\nYou have been posting a great deal, but don't seem to be willing to learn anything, just downvote.\n\nEdit to clarify, you may view the \"charge\" for borrowing stock for shorting  as a fee reducing the interest you get.  When I get a lower rate for short stock, its because there is a small fee involved, but the short stock generates interest, just slightly less than a credit balance rate.\n\nEdit again.  You seem to have deleted all posts you every made.  Thats too bad.  You provided a lot of good information to newer traders.  I was pointing out how short stock rebate works and apparently you were offended when I said you weren't willing to learn something new.  I learn new things all the time and I have certainly been wrong.  Reddit has taught me things in options that I didn't know.  This isn't a bad thing.\n\nActually, it looks like you didn't delete your posts, you just blocked me so I can no longer see them.  You are truly pathetic.", "score": 1, "replies": [{"body": "Look buddy, I am not here to learn. I'm here to help newbies. \n\nI have 25 years of experience in markets and securities, a masters in securities and derivative administration. and I design the systems market makers and banks use to trade.\n\nMaybe you should just stop trying to lecture me... If you think \"time value\" can be separated from \"volatility value \" you're gravely mistaken. \n\nAnd this whole debate you're trying to have about the influence of interest rates isn't even relevant to the question asked. \n\nYou can't separate the values related to volatility, time, price or risk free rate from each other in an options pricing and that's the end of it.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Think of it like this: \n\nThe future price of a stock is a function of random movement of the market. As a result the price of an stock can be seen as a nominal distribution at expiration. It can go up it can go down, the further up or down the lower the probability with the highest chance in the middle (a big bulge)\n\nThe extrinsic value of an option represents the value of that bulge at expiration. It is a function of both time, and expected volatility but also price, and interest rates.\n\nWhy? Implied Volatility is an estimate of how big a step the stock will take each day (annualized)  the more time is left, the more steps the stock could make in that time.\n\nThe distance travelled is time * steps. \n\nBut a more volatile stock has an even wider distribution. Because it can make bigger steps each day. The distribution gets wider.\n\nThe intrinsic value contains therefore both, You cannot separate the two because they are fundamentally linked.\n\nTo find the intrinsic value you can simply do stock price - strike for a call or strike - stockprice for put. (It cannot go negative) The extrinsic value is then the market price of the option - the intrinsic value. But it contains all Greeks within, and you cannot separate them from each other.  \n\nIf you wish to learn more about theoretical option pricing, i suggest starting with reading some on the Black and Scholes model or Monte Carlo simulations. (But it's heavy math)\n\nhttps://en.m.wikipedia.org/wiki/Black%E2%80%93Scholes_model\n\nhttps://en.m.wikipedia.org/wiki/Monte_Carlo_method", "score": 1, "replies": []}]}, {"body": "https://i.imgur.com/HuylBfU.jpeg          \n\nBought these earlier in the year when everyone was into Dwac. Assuming the price stays up(currently at $10) is the best case scenario to allow myself to get assigned and then sell the shares? Volume is none existent. Can't even trade this on shorter time frames. I figured I get my feet wet and try some leaps on something cheap.", "score": 1, "replies": [{"body": "Low volume typically is an indicator of wide bid ask spreads.  \n\nGenereally the advice is to sell the option to harvest extrinsic (time) value, rather than exercise, and to not go to expiration for the same reason.  If the bid ask spread eats up all of the extrinsic value, then that advice has less value. \n\nIntrinsic value: amount in the money   \nExtrinsic value: the bid (when selling) less the intrinsic value. Time value.", "score": 2, "replies": []}, {"body": "To save yourself the trouble of screenshotting nothing more than a position, you can write that position easily as follows:\n\n1 PHUN 2c 1/17/25 @ $X.XX (the per-share premium you paid, which isn't in the shot)\n\nSince you are long the calls, you can't, \"allow yourself to get assigned.\" That only applies to short calls. If the calls are worth more than $X.XX, sell to close for a profit.", "score": 1, "replies": []}, {"body": "These are adjusted options.  PHUN underwent a 1-for-50 reverse split.  The multiplier is still 100 but the deliverable is only 2 shares, not 100.  That is why there is no volume and no bid. They are far OTM. Exercising would mean paying $200 but receiving only 2 shares of PHUN, a $18.84 value right now.  PHUN would have to go above 100 for these to be ITM.", "score": 1, "replies": []}]}, {"body": "I'm looking to sell calls on a stock that I own that I do not want anymore. I have around 1000 shares and it's currently priced at $18 and my preferred exit point is $20. Can I just sell $20 call contracts every week until it hits $20? I'd just be collecting premium on that stock every week right until that $20 mark right? And if I get assigned, I'm assuming I'd just get $20,000 and my shares go to 0? \n\nThis is on Charles Schwab platform.", "score": 1, "replies": [{"body": "As long as you don't care *when* the assignment happens, or how much you give up when it happens, it's fine.\n\nWhat I mean is, a CC is not like a limit order to sell, so you could miss out on a short-term rally. Say you write the call on Monday and Tuesday the shares go to $23. Nothing will happen, your shares won't be assigned, plus since the shares are locked up in the CC, you can't sell them to capture the rally gains either. Then on Wednesday, the shares drop to $18 and stay there until expiration. Again, nothing happens. You completely missed out on the rally. \n\nConversely, if the shares stay $18 the whole week but then jump up to $23 on expiration day, you get assigned, but you miss out on the additional $3/share gain.\n\nIf all that is perfectly okay with you, go for it.", "score": 2, "replies": []}, {"body": "Yes, you are correct. That is how you would do that.\n\nKeep in mind that the risk is, that should the stock go to 10. You'll be stuck holding the shares. And pocket the full premium. But have a net loss.", "score": 1, "replies": [{"body": "Compared to just holding shares with a limit order to close at $20, there's no difference in risk. You lose on the shares either way. I think the more salient risk is missing out on a rally, with or without getting assigned.", "score": 1, "replies": [{"body": "Yes, No difference in risk, but there is risk.", "score": 1, "replies": []}]}]}]}, {"body": "Hi I have a question about options liquidity. I’m looking at options that are a little bit thin. My question is if I’m trading one option on a strike that has ten volume will I be able to get out of the trade? The spreads aren’t too bad. I assume there will be a market maker there to take my trade. Will I be ok?", "score": 1, "replies": [{"body": "that is the risk. \n\nyou'll mostlikely always be able to exit the position because market makers provide quotes at almost all times. but the question is at what price. spread can widen severely on options that are illiquid, especially when theyre far otm. the spread is basically the fee you pay the market maker to exit. \n\nsometimes quotes dry up for options that are below the 0.05 delta mark, and then youre stuck until expiration. That in itself is pretty riskless though. although it can suck if thats still weeks away, and margin is being locked up by the position.", "score": 2, "replies": []}, {"body": "The bid is your exit price for an immediate fill on a selling order.", "score": 2, "replies": [{"body": "Yeah I know that. It’s like how my far otm option says I’m up 275% but it’s actually worth zero but it’s alright though it wasn’t expensive and a lesson learned.", "score": 1, "replies": []}]}]}, {"body": "Sitting on NVDA April 5 long call of 950 and short at 1000.\nDebating about rolling down and out to June 21 for ER at a 920/960 spread?\nGood, bad idea?", "score": 1, "replies": [{"body": "Here is a guide to effective options trading posts:  \nhttps://www.reddit.com/r/options/wiki/faq/pages/trade_details", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Here is a guide to effective options posts:  \n\nhttps://www.reddit.com/r/options/wiki/faq/pages/trade_details", "score": 1, "replies": []}]}, {"body": "Exercising vs selling - beginner\n\nI’m trying my hand at learning a bit about options trading. For the sake of learning I picked up 1 contract for Walmart, expiring 3/15 with a strike price of $61.67. \n\nRight now on Robinhood this option shows +$11 at $61.55 market price. \n\nCouple of questions:\n\n• does the +$11 mean that I can sell that contract now and MAKE $11 over what I paid (~$12)?\n\n• if the market price surpasses the strike price is it better for me to exercise or sell and why?", "score": 1, "replies": [{"body": "I'm assuming by \"market price\" you're referring to the spot price of WMT.\n\nPut options exist too, you know.  If you're talking about a specific contract you have to say \"put\" or \"put option\" or \"call\" or \"call option,\" not just \"option.\"\n\nForget about options for a minute and just think about stocks.  What would you think if someone posed the following question:\n\n>I’m trying my hand at learning a bit about stock trading. For the sake of learning I picked up 1 share of XYZ.  \n>  \n>Right now on Robinhood this stock shows +$11.  \n>  \n>Couple of questions:  \n>  \n>• does the +$11 mean that I can sell that share now and MAKE $11 over what I paid (\\~$12)?\n\nWouldn't you think \"aren't we missing something?  Why isn't this person looking at the current stock price?\"\n\nAnd that's what matters here.  The current price (premium) of the option itself.  Not the spot price of WMT, and not the +$11 (which is presumably your P/L.)\n\nNow, probably, we would think \"well, the reason the brokerage platform is displaying a P/L of +$11 is that the current share price is $23.\"  But knowing that--that the current share price is $23, is what's most important.\n\nThat P/L is going to be based on the mid, or the halfway point between the bid and the ask.  And that's often much more relevant with options than it is with stocks, because options have relatively wider bid/ask spreads.  It's one thing to say \"the price is 23\" when that is the mid because the bid/ask is 22.99/23.01.  It's another to say \"the price is .23\" because the bid is 0.05 and the ask is 0.51.  If that is the case, you're not going to e able to sell at .23.\n\nThis often confuses Robinhood users and other beginners because they see that +$11 and think \"oh, I'm up by $11\" without a realistic concept of what they could actually sell for.\n\nThat said, this option closed today with a bid/ask of 0.17/0.18, so at market close, you could have sold at 0.17 and made a $5 profit.\n\n>if the market price surpasses the strike price is it better for me to exercise or sell and why?\n\nIt's almost always better to sell than exercise, but this has nothing to do with the other concept you're referring to, which is whether or not the option is in the money.\n\nThere's nothing magical about being in the money.  There's no rule that says that if you buy an OTM option and it goes ITM, that should trigger your closing your position.  It's possible for it to become profitable before becoming ITM, and it's even possible for it to go ITM but not be profitable.\n\nIf you exercise, you sacrifice all remaining extrinsic value.  So the only time you would want to do that is if you can't sell the option at a price that yields any extrinsic value.", "score": 1, "replies": []}, {"body": "The top advisory of this weekly thread, above, prior to all of the educational links above, is to almost never exercise, but sell for a gain.  \n\nExercising throws away extrinsic (time) value harvested by selling the option.", "score": 1, "replies": []}]}, {"body": "Okay, can I get some help evaluating TSM and MSFT?  \nThe biggest con is - Taiwan.  \nFor TSMC - I want to get April 19th calls. It has an earnings call on April 18th.  \nMy aim will actually be to sell before the earnings. I am hoping for a run up into the earnings.  \nI want to also do that with MSFT. Earnings call on 23rd April so get some call expiring on 26th?", "score": 1, "replies": [{"body": "My biggest issue here is that you are going to pay for a bunch of extrinsic value that will go away the closer you get to earnings since you are buying so soon after the event.  Your best scenario will be a run up a couple of weeks before earnings.  The sooner then better.  But any run up right before earnings will have to overcome your time decay. \n\nCould it work?  Sure.  But remember that your move will have to beat expectations to make any money.  The earnings dates are public information so you have to assume the risk of them is already priced in (including a run up before).  You are betting on a greater than expected move.", "score": 1, "replies": []}, {"body": "while this is in essence a good idea. youre missing something. youre basically making a long volatility trade here. use a strategy that fits that trade: I suggest taking a look at calender spreads and how to use them.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hi, i am a european, and i used to work in retail banking. But i am not sure this works the same for American Banks (probably not). ill give a go at explaining here.\n\nin Europe, some account types aren't alowed to go negative in cash, this is because of regulation by the AFM and is basically a measure to protect retail customers from themselves. Banks must therefore have measures in place to prevent clients from performing transactions that would cause a negative cash balance. its also illegal to change the order of transactions in europe. (im not sure if that is the case in the US, simply because i saw a john oliver episode on that)\n\nin your example it does seem like you momentarily went negative because of the order of the transactions. so my questions to you is:\n\n* Are you alowed to go negative in cash on your account?\n* in what order did you enter the orders?\n* in what order were the orders executed by the exchange?\n* were you charged interest?\n\nthe transactions have been made within the same day. so they are settled on the same day (T+2) so for the bank, and for the client, this should not be an issue.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ah that makes sense!", "score": 1, "replies": []}]}]}, {"body": "It takes two days to settle shares.   \nOptions are over night, one day.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The most complete answer is that it's impossible to know, because there is also time decay and volatility changes.\n\nThat said, this isn't really a place to get people to do your homework for you.", "score": 1, "replies": [{"body": "I mean its simply a sample interview question I might be asked. You can assume everything else constant. This also isn't a place to shoot down people looking for help either", "score": 1, "replies": [{"body": "Is the $10 the purchase value? Or the strike price?  \n\nQuestion is not complete.", "score": 1, "replies": []}, {"body": "I can't tell you the answer but will point you in the direction that may help you learn how it works.\n\nDelta - [https://www.investopedia.com/articles/optioninvestor/03/021403.asp](https://www.investopedia.com/articles/optioninvestor/03/021403.asp)\n\nGamma - [https://www.investopedia.com/terms/g/gamma.asp](https://www.investopedia.com/terms/g/gamma.asp)", "score": 1, "replies": []}]}]}]}, {"body": "Without going in to why I made these trades...\n\nCan someone explain how is this a wash sale when there hasn't been any realized losses?\n\nThe order of transactions  \n1. 03/08/2024 Sell open for 1899.67  \n2. 03/11/2024 Buy close for 117.08+1053.72 = 1170.8 (728.87 gain)  \n\\------------------------------------------------------------  \n3. 03/11/2024 Sell open for 4479.65  \n4. 03/12/2024 Buy close for 4310.31 (169.34 gain)  \n\\-------------------------------------------------------------  \n5. 03/12/2024 Sell open for 3969.65 <---- led to wash sale  \n6. Future Buy close  \n\nhttps://imgur.com/a/1QCOG9w\n\nIt's treating as if the orders are reversed.\n\n5, 03/12/2024 Sell open for 3969.65 \n\n4, 03/12/2024 Buy close for 4310.31 (340.66 realized loss)\n\n\\------------------------------------------------------\n\n3, 03/11/2024 Sell for 4479.65 \n\nCurrent cost basis 4138.99 (4479.65 - 340.66 wash)\n\nShouldn't it have finalized the gain from #3 & #4 Sell open->Buy close pair with 3969.65 current cost basis?", "score": 1, "replies": [{"body": "A wash sale can occur by any trade made 30 days before or after a losing trade.\n\nFrom what you are describing/showing it may be in the time the trades were logged by the broker which shows a loss when there should not be one.\n\nCall your broker to point this out and have them explain why this is listed as a WS . . .", "score": 1, "replies": []}]}, {"body": "I tried asking this to Chatgpt, but answer was not satisfactory.\n\nWhen you dont have enough money for a call option, does it make sense to buy shorter dated options for the same strike price, and then roll the call ?\n\nOr is it better to buy the shorter-dated option with a little lower price, though still OTM, then roll the call?\n\nThank you so much for your wisdom!", "score": 1, "replies": [{"body": "if you dont have enough money to buy and option its probably because youre looking at positions that arent sized right for your portfolio. a trade should never be a significant / large part of your porftolio. the chances of losing it all is simply too big.\n\nthat being said, there are ways to reduce your initial investment. a call debit spread is a great alternative to a long call when you're strapped for cash. the short leg of a call spread will \"finance\" a part of the long leg of the spread, creating a leveraged position. due to the reduced initial investment, you can make larger returns (in percentages)\n\na call debit spread involves buying a  call and then selling call with a higher strike on the same expiration. for example:\n\n* BTO GOOG may 2024 C 140 @ 7.20\n* STO GOOG may 2024 P 150 @ 3.50\n\nin this example, you have succesfully reduced your initial investment by 350, cutting it in half. while keeping upward exposure up to 150, and a possible max profit of 1000 for an investment of 3.70 (170% return) your break even is also lowered from 147.20 to 143.70.\n\nthe downside, is spreads are harder to close early with full profits should the share blow far past the strikes.\n\nthere are other strategies that reduce your initial investments in a similar manner. but spreads are a good start point for beginners because they are quite easy to understand. here are some other cost reducing strategies to read about (or ask chat gpt) if youre interested:\n\n* Synthetic Stock\n* Zebra\n* Jade Lizard\n* Butterfly\n* Iron Condors\n* Ratio Back Spread\n\nand many more.\n\nthis is also a great resource:\n\n[https://www.theocc.com/getmedia/f34f8a0d-806f-4f1a-adf7-d49d8d94b16e/option-strategies-quick-guide.pdf](https://www.theocc.com/getmedia/f34f8a0d-806f-4f1a-adf7-d49d8d94b16e/option-strategies-quick-guide.pdf);", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "there isnt really any, if you dont have the money to buy an option you cant buy it. taking a shorter dated option gives you more risk, and changes your entire thesis. trade smaller, cheaper stocks. that have cheaper options, until you're ready to buy the more expensive options.\n\nits best to start out small when you're learning anyhow. \n\nA stock like Ford (only $12) has options that are priced in the 0.10-0.30 range. (just a suggestion, there are many more)", "score": 1, "replies": []}]}]}, {"body": "Never rely on ChatGPT.  Garbage in is the source info, thus garbage out to queries. \n\nThere is a lot of garbage info that is on line.", "score": 1, "replies": []}]}, {"body": "Can someone help me understand my current Greeks and how i may potentilly strategize in this trade to mitigate my potential losses?  \n\n  \nDelta: 0.5009\n\nGamma: 0.0050\n\nTheta: -0.4301\n\nVega0.3297\n\nI picked up a COIN call option slightly OTM at the time at a 270 Strike price. Whether it was the announcement of the convertible bonds being issued, profits being taken at current highs or both, COIN is down about 6-7% since i picked up the call. I currently have 38 days to expiry and wondering if i should just cut my losses now or give it some more time, but I'm worried about the time decay. I know it will get more significant once it hits the 30 day mark, so wondering if i should give it at least until then.\n\n#", "score": 1, "replies": [{"body": "Delta is the important indicator to focus on IMO.\n\nA 0.50 will translate into an approximate 50% probability of being ITM or OTM at expiration, so this trade has around a 50/50 chance of being successful. It may be slightly lower if buying a long option as the breakeven at expiration would include the debit paid to open.\n\nUse Delta to calculate the probability of the trade being successful which can help guide how you manage it. See this for more on how this works - [https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981](https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981)", "score": 1, "replies": []}]}, {"body": "I was looking at the options chain, say the one for NVDA, and was a bit confused on the value of theta. If a call had a theta of -2.64, does this mean that I need to multiply this value by 100 to get 264? In other words, the option roughly decreases \\~264 on that day. Or would it instead only decrease by $2.64?", "score": 1, "replies": [{"body": "The greeks are normally quoted in per-share values, just like the premium itself.  So if the bid/ask is around, say, 40.00, you would actually pay/receive $4000 for trading the contract.  If theta were 2.64, that means the same time tomorrow, all other things being equal, the bid/ask would be around 37.36, meaning you would pay/receive $3736 for trading the contract.", "score": 1, "replies": [{"body": "As usual, u/Arcite1 is spot on with this explanation, but I'll add that Theta will ramp up as the option gets closer to the expiration date. The amount of Theta will also vary at strikes ITM or OTM vs ATM.\n\nWhat this means is that it is not a static number/amount so be aware of this as you perform your calculations . . .", "score": 1, "replies": []}]}]}, {"body": "This is a broker specific question. I am in one broker in Europe, which offers very limited strike prices on options, whereas other brokers offer much big of a range. can I request this broker to add more strike prices?", "score": 1, "replies": [{"body": "You could request, and see what they say. \n\n\n Assuming the Options are exchange traded, it is worthwhile asking why the broker does not allow trading all options the exchange has available.   \n\n\n Perhaps the platform does not display all strikes, and there is a method to display all strike that you did not see.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Interactive Brokers is often a suggestion for US exchange access from outside ofvthe US.", "score": 1, "replies": [{"body": "They said its not available. Im switching to IBKR now. Its hard to deposit to tasty from Europe", "score": 1, "replies": []}]}]}]}]}, {"body": "How can I improve my chances of being able to trade level 2 options? I am approved for cash secured puts and covered calls, but this feels more capital intensive. I would be in a way better position to have a long position and if I am wrong lose my principle, instead of having to buy 100 shares 🤷🏻‍♂️", "score": 1, "replies": [{"body": "Options approval levels vary by broker, but most will look at your trading experience as a factor.\n\nIf you can make many CSPs and CCs trades successfully, which should be relatively easy, for a time then you can go ask for a higher level pointing out the number of trades made. As always, trade of quality stocks you would not mind owning in case you get assigned is key to being successful.\n\nBe aware that buying options may seem to be better, but can have a lower win rate as it requires predicting the direction and amount of movement in the stock to profit, which can be much harder to do then selling.", "score": 1, "replies": [{"body": "I think I have more research to do because I mostly focused on long calls and puts strategies, but are the mechanics similar or do I have to write calls in order to gain any cash? It seems more time consuming and I was really hoping to get into some swing trading and have longer time horizons like 1-3 months", "score": 1, "replies": [{"body": "Buying requires predicting not only the direction of the stock, but also by how much the stock will move over a time. This is very hard to do and while swing and day trading sound sexy as a way to make money quickly, it is very hard to be successful with most losing part or all of an account.\n\nCheck out covered calls on some high quality stocks you don't mind owning and holding but would be fine if they were called away and sold for a profit. These can be opened 30-45 days out and will take advantage of the theta decay which helps them profit. Selling the calls above the stock cost can profit in 2 ways, from the call option premiums collected, and from the stock rising if called away.\n\nThe only way this can lose is if the stock drops, so that is why it is best to trade these on stocks you might hold anyway. This explains more - [https://www.investopedia.com/articles/optioninvestor/08/covered-call.asp](https://www.investopedia.com/articles/optioninvestor/08/covered-call.asp)", "score": 1, "replies": [{"body": "Thank you for the thoughtful response, I truly appreciate it. Will be continuing my research before taking a position", "score": 1, "replies": [{"body": "As you should. And consider paper trading to learn and practice while you develop a trading plan as well - [https://tickertape.tdameritrade.com/tools/papermoney-stock-market-simulator-16834](https://tickertape.tdameritrade.com/tools/papermoney-stock-market-simulator-16834)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I bought DLTR 4/19 calls and it tanked today cause bad ER. Do I hold for a bounce back or cut my losses asap?", "score": 1, "replies": [{"body": "What was your thesis? And what was the exit plan?", "score": 1, "replies": []}, {"body": "Here is a guide to effective options posts:  \nhttps://www.reddit.com/r/options/wiki/faq/pages/trade_details", "score": 1, "replies": []}]}, {"body": "so If there is an earnings call coming up and I know that the stock will either moon or drill to earth's core, what options strategies could I use to make some gains on that? Wasn't there something?", "score": 1, "replies": [{"body": "Many traders avoid earnings events because they are coin flips, and significant moves often are priced in several weeks ahead of the event.   You have to have a move bigger than the priced in move to have a gain, for a long position.", "score": 2, "replies": []}, {"body": "Straddles and strangles are for big moves. \n\nButterflies and iron condors are similar but have defined risk.", "score": 1, "replies": []}, {"body": "Long straddle or strangles can profit from a big move up or down, but will lose if the stock stays in the range . . .", "score": 1, "replies": []}]}, {"body": "I have an ORCL 3/15 call. I am hovering right around breakeven & wondering if I should just GTFO early and roll if I can for a longer exp? I see the potential here but this current sideways situation with a 3/15 expiration is no bueno.", "score": 1, "replies": [{"body": "You have no exit plan.  Close the trade. \n\nThe four big plans (derived from your analysis of the underlying, and a position aligned with that analysis):  \n\n- Exit for an intended gain  \n- Exit for a maximum intended loss  \n- Exit for a maximum time in the trade  \n- Exit for underlying behavior not predicted in your analysis.", "score": 3, "replies": []}, {"body": "when holding a long call time is against you. if you believe the market is going sideways, you shouldnt be holding a long call.", "score": 2, "replies": []}]}, {"body": "I'm still learning, so please bear with me if this is a stupid and long question. I'm using a simulator (Trade Station) for this trade.\r  \n\r  \nI bought to open a straddle 185 on BA a couple days ago, just to see how the process worked.\r I'm now trying to figure out how to place an order that will be filled once my P/L reaches $0 (not counting commission). Just for learning's sake.\r  \n\r  \nI \"bought\" the call at $3.20 and the put at $2.25. Just one contract.\r  \n\r  \nHere are my questions...\r  \n\r  \nWhen I attempt to sell to close, I can only place one limit price. Would that price be $3.20+$2.25=$5.45 in order to sell for no profit/loss? (assuming BA's price changes enough to reach that goal, I know the order won't be filled until then).\r  \n\r  \nI can't figure out if I need to place a limit price or a stop market price. They seem very similar to me. I thought I'd need to place an \"if touched\" price, but TradeStation isn't giving me that option, so I guess not.\r  \n\r  \nThe limit price can be entered as a positive or a negative. When I attempted to enter it as a positive, TradeStation prompted me to instead enter it as a negative (for credit instead of debit). What is the logic behind this? I don't understand why a limit price would be negative.\r  \n\r  \nThank you for any insights, lots to learn but slowly getting there...", "score": 1, "replies": [{"body": "You paid 5.45.  For a gain you desire to sell for more than 5.45 for both options.  That is a a limit order (no less than 5.45, a lower limit).\n\n  \nIn interactive brokers, apparently on an order, a credit (money received for selling) is a negative number.  \n\nMoney spent (to buy) is a positive number.", "score": 1, "replies": [{"body": "So placing a sell to close order with a limit of 5.45 is the correct move (to hit $0 P/L)? Thank you :)", "score": 1, "replies": [{"body": "Be aware you can cancel the order, and re-price, any time.  \n\n  \nOrders generally die at the end of the day, unless it is a \"good til cancelled order\" GTC.", "score": 1, "replies": [{"body": "Thank you! Happy to know I’m on the right track with applying what I’ve been learning.", "score": 1, "replies": []}]}]}]}, {"body": "> I can't figure out if I need to place a limit price or a stop market price.\n\nStops are different from limit closing orders. A stop triggers *only if the position is losing*. While a limit closing order triggers *only if the position is gaining*. The order types themselves are directional.\n\nSo if you are taking a profit, you want a limit order. If you are trying to put a backstop on your losses, but are not yet ready to dump the trade, you use a stop-limit order. Don't use market orders of either type, gains or losses.\n\nHowever, note that stops are not recommended for low-volume option contracts, as stops require frequent price discovery to be effective. Details here: https://www.reddit.com/r/options/wiki/faq/pages/stop_loss/\n\nExamples:\n\nYou bought to open trade A (doesn't matter what it is, could be a single call, a straddle, or a 6-legged monstrosity) for $5. The trade is now worth $6, so you have a gain. You can submit a limit order to close for $6 or better. If the position loses value below $6, nothing will happen. As it turns out, the order fills at $6.23, so you net a $1.23 gain.\n\nNow consider a similar trade B opened for $5. The trade starts losing money, but it hasn't yet lost enough for you to want to dump it. To set that dump limit, you create a stop-limit at $4/$1 ($4 is the stop trigger, $1 is the limit order). As long as the bid stays above $4, nothing will happen. However, if the price hits $4 or lower, a limit order to close for $1 or better will be submitted. Let's say the price drops to $3.95, which is less than $4. Since $3.95 is better than $1, the limit order fills and you cut your losses at the $3.95 price.", "score": 1, "replies": [{"body": "This is wildly helpful, thank you!", "score": 1, "replies": []}]}]}, {"body": "Still in the learning phase here...  \n\n\nAs I understand, options give the buyer the right (but not the obligation) to buy/sell stocks at a certain price. If I buy an option on the market, then sell it later, am I on the hook if the new buyer exercises the option? i.e., will I have to ensure I have enough money in my account to cover the possibility of me needing to buy shares after this person exercises the option?", "score": 1, "replies": [{"body": "> If I buy an option on the market, then sell it later, am I on the hook if the new buyer exercises the option?\n\nNo. To clear this up, don't think in terms of \"buy\" then \"sell.\" Think in terms of \"open\" then \"close.\" You buy to open a call. Later it gains in value, so you sell to close for a profit. Closing a trade ends all your obligations in the trade -- after all, you have 0 calls left open, right? How can someone with 0 calls be responsible for anything?\n\nWhat you are being confused by is the case of **selling to open**. Since you have an open contract, you are on the hook for any obligations of that contract.", "score": 1, "replies": [{"body": "Ohhhh ok that makes a lot more sense! Thank you!", "score": 1, "replies": []}]}]}, {"body": "I tried to attach an image of Fidelity’s Options P/L Calculator but it kept getting removed. Here is what it was telling me though (Price then P/L based on Fidelity’s Calculations):\n300 = -464.78\n400 = -464.28\n450 = -444.57\n500 = -318.17\n550 = -111.58\n596.8 = 0.00\n\nHi everybody, so I’m new to this but have what I believe is a decent understanding of how bull put spreads work. What I don’t understand is this: \nThe stock price is 580.4 or something similar in the picture that couldn’t be attached. Assume the “Evaluation Price” is accurate and the premiums for the contracts are 2.69 and 2.34, this means my Maximum P/L and Break Even are $35, $465, and $524.65. \n\nSo why is Fidelity’s P/L Calculator showing my Break Even Price as $596.8? Am I missing something?\n\nEdit: These expire on the 15th, so assuming the stock never hits the strike price by then, anything over $524.65 would be profit, no?", "score": 1, "replies": [{"body": "Strikes of puts?", "score": 1, "replies": [{"body": "Yes. Selling a 225 Put and buying a 220 Put", "score": 1, "replies": [{"body": "Net premium is apparently  2.69 less 2.34, for 0.35, correct?", "score": 1, "replies": [{"body": "Yes and I meant sell 525 and buy 520. My apologies. But ya the net credit should be .35 per spread", "score": 1, "replies": [{"body": "Thus, if at expiration, breakeven is 524.55.   525 less 0.35. \n\n Assuming you are assigned shares, and you can dispose of them without change in price.", "score": 1, "replies": [{"body": "Right, that’s what I was thinking. So is Fidelity’s calculator incorrect? Maybe it’s trying to price in the upwards movement in the contracts price before expiration even though it will expire worthless if the put expired and the stock was at 596.8?", "score": 1, "replies": [{"body": "I was able to view the images, thanks to the other moderator actions.  I cannot make sense of the fidelity calculator.\n\nYou could try refreshing it, to see if it behaves differently, and if not, this should be reported to Fidelity.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You can post images as a link in a text post, like by using imgur. In any case, I approved the original post, in case anyone wants to see the image in context:\n\nhttps://www.reddit.com/r/options/comments/1bdwoxs/bull_put_spread_question/", "score": 1, "replies": [{"body": "Thank you! Sorry I am losing my mind over the apparent lack of understanding or mistake in Fidelity’s calculator.", "score": 1, "replies": []}]}]}, {"body": "Short straddle margin requirement question - say, if I am long Microsoft straddle and want to short a correlated asset like Google straddle, will the broker still ask me to put up the entire notional as margin?", "score": 1, "replies": [{"body": "For starters if your options level is high enough, then you won't need to put up the entire notional anyway.\n\nIf you have portfolio margin (see /r/PMTraders), there are correlated asset margin reductions, but I don't know the answer to this specific example.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Both.  If otherwise you could make free money by opening a straddle and profiting from underlying price moves over that period.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The calculation is a prediction.  An estimate.      \n\n\n  Actual occurrence of theta as realized  will probably not follow the daily prediction.", "score": 1, "replies": []}]}]}]}, {"body": "How does brokerage calculate the greeks (delta, etc.)?\n\n\\- Does brokerage relay the data from CME group?\n\n\\- Also, what's the process to derive delta? I know BS formula is involved. But what's the detailed steps?", "score": 1, "replies": [{"body": "No, probably no one \"relays the data\" from somewhere else.\n\nBS formula probably isn't involved, actually. Not for real-time quotes, anyway. BS is too computationally expensive to update an entire chain of greeks every time the contract bids change. Each broker probably has their own custom setup, but they probably use some binomial variant, like CRR: https://www.macroption.com/cox-ross-rubinstein-formulas/\n\nThe advantage of CRR or similar is that you can control how much computation is done by choosing the number of binomial steps. Fewer steps means faster updates, but less accurate results.\n\nThere are fast PDE solvers that can take advantage of speedups like table lookups, so I wouldn't completely rule out BS as a possibility. We just don't know who uses what, or even if different platforms on the same broker use the same setup. It's possible to use a mix also, like BS for European style contracts and CRR for American, since American violates some of the preconditions of BS, although that can be adjusted for: https://www.investopedia.com/articles/active-trading/041015/how-circumvent-limitations-blackscholes-model.asp", "score": 2, "replies": []}, {"body": "Every provider is different, and has their own calculation.", "score": 1, "replies": []}, {"body": "heres the math involved:\n\n[https://quantpie.co.uk/bsm\\_formula/bs\\_delta.php](https://quantpie.co.uk/bsm_formula/bs_delta.php)", "score": 1, "replies": []}]}, {"body": "Say I want to buy a call option for AMZN with a strike price of $180 that expires 3/15.\n\nThe current ask is $0.35, so the options contract would cost me $35 in total.\n\nI do not have enough money to actually purchase 100 shares of AMZN. The plan is for AMZN to reach my strike price and then sell the call contract to someone who does have enough money to buy 100 shares.\n\nWhat is the maximum amount of money I would lose if AMZN doesn't reach my strike price by 3/15? Is it just the $35? Or do I risk the possibility of actually having to buy 100 shares of AMZN?", "score": 1, "replies": [{"body": "yes, a long option position can lose a maximum of 100%", "score": 1, "replies": []}, {"body": "Peopke can have a gain without the strike price being surpassed, and sell for a gain before expiration.\n\n\nThe bid is the offer to buy", "score": 0, "replies": []}]}, {"body": "Looking for a good BEGINNER friendly platform for options trading?\n\nI had originally been using my SoFi account but Im noticing some restrictions when it comes to options. Was hoping to find a good beginner friendly platform to start with a few hundred dollars to get my feet wet.\n\nI did toy around with TOS for a little bit but it ended up getting a little bit confusing - was just hoping for different suggestions.", "score": 1, "replies": [{"body": "In a sense, you need to figure out a platform. \n\n\nBeginner friendly RobinHood is not recommended here as a broker. \n\n\n Options are not easy.\n \nThink or Swim has tremendous amounts of tutorials. Don't Kaufnan of TheoTrade has dozens of hours of tutorial instruction on youtube.", "score": 2, "replies": []}, {"body": "Not being harsh, but if you have difficulty learning the trading platform how do you expect to learn the complex world of options trading?\n\nTOS is the best and there are many training videos. It will also take a number of weeks to learn. The EASY brokers will all lack many important features and capabilities that will likely result in losing trades. \n\nCall the TOS support line and ask for a free live orientation session with a rep who will walk you through setting it up and will answer all your questions. Between this live session and the videos you will pick up the and learn a capable platform able to help you move well beyond being a beginner . . .", "score": 1, "replies": []}]}, {"body": "Is it wise to sell NVDA $1400 strike calls expiring on Mar 22. In 7 days can NVDA reach 1400? I know naked calls result in unlimited loss but I feel the chance is too low. The call gives around $120. Planning to sell 10 and pocket 1200. Please advise what else can go wrong. TIA", "score": 1, "replies": [{"body": "Will your broker even allow you to sell naked calls at this price point?\n\nYou seem to know the risk, and should also know that the stock doesn’t have to go all the way to $1400 for the trade to have sizable losses. \n\nThere is also the matter of margin expansion where your BP requirements can grow significantly if the stock moves up and the broker may force closing the position for a loss.\n\nBest of luck if you pursue this.", "score": 1, "replies": [{"body": "They seem to. I am worried of what you said. I do have some 250 K cash in my brokerage.", "score": 1, "replies": [{"body": "If you are worried, then this means you do not know what may happen which could be a signal to go slowly. \n\nIf you decide to make the trade, be prepared to watch it closely and possibly close early to take the risk off and be happy with a partial profit. \n\nSetting a profit and loss target amount to close if either is hit would be how experienced traders might handle this.", "score": 1, "replies": [{"body": "Some where else people were saying that if a short squeeze happens, and NVDA momentarily jumps to 1600 there is a chance I get assigned. How likely is this? At NVDA s size is such an event possible? At 1400 they are already the most valuable company. I felt above 1400 in one week is impossible but now I am having second thoughts.", "score": 1, "replies": [{"body": "Early assignment is unlikely, but the margin expansion could increase, and your broker may close the position if they felt it was too risky and they would do so without consulting you or caring about your p&l.\n\nCan you paper trade this to see how it might play out?\n\nAt $1600 you would be on the hook to deliver 100 shares per contract at a cost of $1400 and losing $200 per share or $20,000 per contract. If you sold 10 contracts, then the loss could be $200K.\n\nIf this is your calculus, then you are taking this risk for whatever profit you are planning to get. It is unlikely to see NVDA move up sharply, but as you are noting there are other factors at play.\n\nThe 1400 call premium for next Friday is around $35, or $350 for 10 contracts, so it hardly seems worth even the small risk . . .\n\nWould you be OK owning NVDA shares? Have you thought about selling puts?", "score": 1, "replies": [{"body": "I was considering this on Tuesday when it was around 250 per contract , so $2500. Usually every week when the stock is up, if we see margins for 1400+ on next friday it is in 120-250 range. Even 1800 strike pays around 50. \n\nYa I think of cash secured puts too. But I feel at it size and run up, NVDA is more likely to crash to 700 or 800 in 5 days than to go to 1400+. \n\nDo you feel the 1800 call is worth it? would you do it if your broker allows", "score": 1, "replies": []}]}]}]}]}]}, {"body": "In a standard account your margin would be about $90K, likely less in a portfolio margin account.  But still you are looking to put up a crazy amount of cash to make a small in comparison return.  I think there are better returns out there for that amount of capital.", "score": 1, "replies": []}]}, {"body": "Can I get some help getting information on which platform provides the ability to plot time series chart of straddle prices? For a given symbol, say, QQQ that expires in 10 days I would like to be able to see where the atm put (and/or call) prices evolved over time.", "score": 1, "replies": [{"body": "I have not done so, but I believe one can program Think or Seim to do this.", "score": 0, "replies": [{"body": "Thank you. As a non-US person I don't believe I have access to TOS :(", "score": 1, "replies": [{"body": "Interactive brokers platform may also be capable of being programmed in this way.  \n There is a subreddit for the broker.\n\n\nOther platforms also may be capable. \nPossibly  TradeStation.\n\n\nPossibly others.", "score": 1, "replies": []}]}]}]}, {"body": "Why should I buy NVDIA calls if warrant calls are extremely cheap with the same risk?", "score": 1, "replies": [{"body": "Warrant may be cheap because they are for a single share.", "score": 1, "replies": [{"body": "Yes that’s right. However it gives you the opportunity to not risk 5k dollars at once if i want to buy an NVDA call option right?", "score": 1, "replies": [{"body": "Thus, not the same risk.", "score": 1, "replies": []}]}]}]}, {"body": "When I buy options then decide to sell to close am I actually waiting for a buyer? Or is the order to sell to close executed at or near the mark & some seller on the other end potentially being assigned & forced to sell?\n\nWhen I sell as part of a spread I always get with an early assignment because the buyer exercised their position early.\n\nSo what is actually going on here?  When are sell to close positions actually sold to other buyers and when are those buyers forced to buy to close?", "score": 1, "replies": [{"body": "Markets are an auction. \n\n\nFilling an order means a counterparty will accept your price for the security.  \n\n\nOn exercise, your counterparty is the entire pool of options, matched when a long owner exercised causing a match to occur with an existing short option.\n\n\n\n\n\nYou close a position when you have zero options held.  \n\n\nMarket makers can extinguish an open interest pair of a long and short pair by matching the two.", "score": 1, "replies": [{"body": "That was my confusion, I have bought & sold options but never exercised any of my positions.  I totally forgot that was a thing.  Thanks!", "score": 1, "replies": []}]}]}, {"body": "[https://imgbox.com/kuulnDyw](https://imgbox.com/kuulnDyw)\n\nThis is the timechart of an IronCondor on Russel 2000 ETF that expires tomorrow.\n\nDo you have an explanation why the candlesticks have no shadows? Is this graph at all reliable?,\n\nThe price may vary, e.g. From -130 to -190 within a few hours.\n\nThese high up/down jumps must be normal, but\n\nis it generally recommended to set a stop loss when the price fluctuates so much?", "score": 1, "replies": [{"body": "What do you mean by shadow?   \n\n\n Iron condors at volatile moments often do not work out well. \n\n\n Traders often  exit early for a gain of 50% to 75% of net premium and (the max gain) on these. \n\n\n Stop loss orders do not behave well for options.     https://www.reddit.com/r/options/wiki/faq/pages/stop_loss", "score": 1, "replies": [{"body": "Thanks for your reply. I think of the candle wicks, they are missing.", "score": 1, "replies": []}]}]}, {"body": "I'm fairly new to options trading and have a question about buying a put at a higher strike and writing a put at a lower strike:\n\n\\- Buy a put with X = 1660 and p = 355\n\n\\- Sell a put with X = 1600 and p = 315\n\n\\- Let's say price lands on 1700 at maturity\n\nCouple questions about the above:\n\n\\- Can I enter my 1660 put using the proceeds from selling the 1600 put (does that $ go into my account right after selling)?\n\n\\- Will my account automatically debit for the difference at maturity in this situation {I think  (355-315)\\*100 = $4000 loss}?  Or do I need to have enough funds in my account to buy the stock at 1600 and then I can choose to sell at 1660?", "score": 1, "replies": [{"body": "Most brokers immediately credit or debit the net cash to open the position from purchased or sold options. ", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": ">I'm fairly new to options trading and have a question about buying a put at a higher strike and writing a put at a lower strike:  \n>  \n>\\- Buy a put with X = 1660 and p = 355  \n>  \n>\\- Sell a put with X = 1600 and p = 315\n\nAssuming you're talking same expiration date, that's a put debit spread.  No need to be so elaborate.  Just say \"1600/1660 put debit spread.\"  Don't know what \"p\" means, though, as that would normally stand for put.  Do you mean the premium of each leg?  When talking about a spread, there's normally no reason to specify the separate premium of each leg, just the spread as a whole.  You would open this in one order for a 0.40 debit.  (Get used to specifying option premiums in per-share values, which is how they're quoted.)\n\n&#x200B;\n\n>Couple questions about the above:  \n>  \n>\\- Can I enter my 1660 put using the proceeds from selling the 1600 put (does that $ go into my account right after selling)?\n\nYou open the position in one order, a vertical spread order, which sells the short leg and buys the long at the same time.", "score": 2, "replies": [{"body": "Thank you for the tips. Would you also know if I need a margin account in order to trade a vertical spread? My current broker does not support it, so I am looking at moving to IBKR, but unsure if I need to open a cash account or margin account. I have some experience trading outright options but never spreads", "score": 1, "replies": [{"body": "Assuming you're in the USA, yes.  That's not a brokerage policy; it's a FINRA regulation that you must have a margin account in order to be approved to trade spreads.", "score": 2, "replies": [{"body": "Thanks, I'm in Canada but I think it's the same from a quick search. I'll do some research but appreciate the help!", "score": 1, "replies": []}]}]}]}]}, {"body": "Very new to options, but is there a way to insulate your position on a single stock option against overall macro market performance?  For example:\n\n\\- Lets say your bullish on Intel, but are worried about overall macroeconomic forces pushing the stock down.  You think Intel will rise 5% in the next month relative to current conditions, but also think the overall market (say QQQ Nasdaq 100) may go down which will drag the INTC rise to only 2% (instead of 5%).\n\nIs there a strategy to protect against this?", "score": 1, "replies": [{"body": "There are a number of moves one can make.  \n\n Consequences can be limiting gain, or cost of the protection. \n\n One method is to sell a call, at 45 day expiration, and buy a put, this is called a collar, and the short call pays for some or all of the put cost, depending on the stikes, and expirations.\n\n There are other methods. ", "score": 1, "replies": []}, {"body": "Bullish on Intel, so are you going to buy the stock shares? If so, then a married Put would limit a move down if it happened - [https://www.investopedia.com/terms/m/marriedput.asp](https://www.investopedia.com/terms/m/marriedput.asp)\n\nAs u/wittgensteins-boat notes, there are other ways, which will be based on how you want to trade the 5% expected rise.", "score": 1, "replies": []}]}, {"body": "I've been paper trading option spreads for a couple months now, so tomorrow is my first time experiencing the quadruple witching. I have a couple questions regarding that:\n\n1. When exactly does the quadruple witching (expirations) happen? Is it the beginning of the day or can you still trade on that day and it happens at the end of the day?\n2. If I have a trade open, but it's set to expire on 22 MAR 24, will it expire tomorrow too? I'm confused because every article I read generalize it and say \"simultaneous expiration of stock options, stock index futures, and stock index options contracts, all on the same trading day.\" So to me, it makes it sound like it'll expire regardless of the expiration date. I assume that's the wrong assumption, but I would appreciate some clarification. Thanks.", "score": 1, "replies": [{"body": "> When exactly does the quadruple witching (expirations) happen? Is it the beginning of the day or can you still trade on that day and it happens at the end of the day?\n\nBest to just treat the whole day as likely to be volatile due to all the different expirations lining up. In what exact minute each happens is only relevant for people trading the relevant assets right up to the last minute. That said, volatility usually ramps up towards the close of the session.\n\n> If I have a trade open, but it's set to expire on 22 MAR 24, will it expire tomorrow too?\n\nNo. If the expiration is any day other than tomorrow, like 22 MAR, it will not expire tomorrow. \n\nWhat you read means simultaneous expiration of stuff with 15 MAR as its expiration date. Stuff with different expiration dates are not being considered. It's just that a lot more things happen to have a 15 MAR expiration date than other dates in March, or any other month in the first calendar quarter, for that matter. Like if there are 20 million contracts with 15 MAR as expiration and only 420 contracts with 22 MAR, then 15 MAR would be a much bigger deal in comparison, right?", "score": 2, "replies": [{"body": "Oh wow, I see. You're so much more helpful than the articles I was reading! Thank you!", "score": 1, "replies": []}]}, {"body": "1. End of day.\n2. The concept is that *there exist* stock options, stock index futures, and stock index options contracts which all happen to expire on the third Friday of the month at the end of each quarter.  Contracts that expire at other times have nothing to do with that.", "score": 2, "replies": []}]}, {"body": "Dealers/Market makers may trade for their own account as principal traders.\n\nDoes this mean profiting off of the bid/ask spread, or does this mean buying and holding, then selling later?", "score": 1, "replies": [{"body": "They make their income from tens of thousands of trades a day.    \n\n\nAll inventory is hedged. They are not in the portfolio business.  \n\n\nThey work very hard to not be affected by share price moves.", "score": 2, "replies": [{"body": "1. Since they maintain an inventory, isn't that holding and maintaining a portfolio?\n\n2. Also, let's say they buy at the bid from somebody who sells to the MM. After the MM buys those shares, dies he hold them or immediately sell them at the ask price to another person who wants to buy them?", "score": 2, "replies": [{"body": "Yes a market Maker holds positions. They hedge these positions in a process called dynamic delta hedging. So they don't run any price risk on the option positions. You want to can that a portfolio fine. \n\nThey hold both options and shares in the exact ratio that the price movement cancels each other out so they don't run any risk. \n\nThey make their money on thousands of little trades, pocketing \"spread\" the difference between bid and ask every time.\n\nhttps://www.investopedia.com/terms/d/deltahedging.asp", "score": 2, "replies": [{"body": "Ok. I think it's coming together.\n\nWhen they hold these positions that are hedged,  is their intent to sell those shares in the future for a profit or do they hold those so they can immediately meet the demands of people who want to buy (providing liquidity)?", "score": 1, "replies": [{"body": "They hold those shares to hedge.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Nvidia put credit spreads seem enticing right now. \n$840 put with a delta of 0.31 and a $815 put come in around $800 max profit for $1680 risk. 72% POP.\nWorst case it moves against me and I open call credit spreads above it.  Am I missing something?\nComparatively to stocks like ULTA which are paying hardly anything for a similar credit spread for the same risk.", "score": 1, "replies": [{"body": "Implied volatility is high for a reason.\n\nHigh risk. High gain.  Two sides of the same coin.", "score": 3, "replies": []}, {"body": "What expiration? As long as the expiration is less than 60 days, looks like a winner to me. For 72% PoP the break-even expected value is around $700, so you would have a pretty fat profit margin, assuming you can fill for that credit.", "score": 1, "replies": [{"body": "I went for it. 3/22 expire. My bet is Nvidia is only going to go up during conference next week. \nDid 835/810.  Got $774 credit", "score": 1, "replies": [{"body": "Since the strikes are different did the PoP change? Those spreads aren't interchangeable if any of the critical factors changed, like the spread width or the PoP.", "score": 1, "replies": [{"body": "Tool I use anyway, optionsprofitcalc site, said 80% POP on it.  Maybe it's not the best though.", "score": 1, "replies": [{"body": "It's better than nothing. As long as the delta of the short was still equal to or less than 30, it should be fine.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "where can you find when a company will publish the earnings report?", "score": 1, "replies": [{"body": "I usually just type: next earnings report <stock ticker> into Google. 9/10 times you get it right away.", "score": 2, "replies": [{"body": "nice to know, but Google doesn't allow us to crawl it. I want to scan all the codes", "score": 1, "replies": [{"body": "scrape it off a site somewhere. yahoo perhaps?", "score": 1, "replies": [{"body": "Yahoo earnings dates aren't reliable.", "score": 1, "replies": []}, {"body": "thanks，yahoo IPO calender is the right place, I am now using it", "score": 1, "replies": []}]}]}]}, {"body": "Why not just subscribe to the many free and freemium services that do this for you? Like:\n\nhttps://www.earningswhispers.com/calendar/20240318", "score": 2, "replies": [{"body": "my man! Thanks!", "score": 1, "replies": []}]}, {"body": "Whatever your data source, I would always verify with their investor relations page.", "score": 1, "replies": []}]}, {"body": "Fidelity won't let me buy call options for IBIT or GBTC. It says \"Sorry, but options are unavailable for this security.\" Why is that?", "score": 1, "replies": [{"body": "It's not a matter of Fidelity not letting you.  Not every stock/ETP has options.  Those two don't.", "score": 2, "replies": []}]}, {"body": "If I exercise an option early, how quickly will it typically get assigned? Like if I exercise a call intraday will I have the shares moments later?", "score": 1, "replies": [{"body": "No, it's processed overnight. You'll have them the next morning.", "score": 2, "replies": []}, {"body": "If you specify it to be an irreversible decision, with some brokers, your broker will put shares in your account immediately, and you can sell them.  If it can't do that, maybe you could exercise and short shares.", "score": 2, "replies": []}, {"body": "Also note you don't get the price of the either the stock or the contract at the moment you exercise. So if you submit a request to exercise a long call at 10 am and by 2 pm the stock has tanked below your break-even, you are SOL.", "score": 1, "replies": []}, {"body": "Other posts are correct, but you can simply close to collect the extrinsic value and be out more quickly without the hassle of being assigned and dealing with the multi day process of handling shares.\n\nIf you want the stock, then close the option and use the proceeds to buy it outright as it will be quicker, and you are likely to have better pricing.\n\nThere are seldom good reasons to exercise, and many traders go years without having to do so.", "score": 1, "replies": [{"body": "Well I was thinking if I bought calls of a pump-and-dump stock, I might wanna exercise ITM and sell the shares before the dump if I sense it coming. But I suppose closing is about as good depending on the spread.", "score": 1, "replies": [{"body": "It's almost always *better*, unless it's a very illiquid option.", "score": 2, "replies": []}, {"body": "Closing is better in almost all situations . . .", "score": 2, "replies": []}]}]}]}, {"body": "How do I recover/manage a bull credit put credit spread where the stock price dropped below the lower strike price?\n\nI have an **ADBE** bull put credit spread with the following legs:\n\n**03/22 Put bought @ 57.5**\n\n**03/22 Put sold at @ 90.0**\n\nI opened this trade thinking the stock will continue to hold past the volatility around its earnings. However, after their earnings, the ADBE dropped significantly below my lower strike, and now I am looking at a 120% notional loss on the trade.\n\nI believe that ADBE is strong and has few competitors long-term, so this price drop should be temporary. But given that the expiry of the contracts I hold is a week away, I am unsure of the most reasonable way to manage this trade.\n\nConverting the bull put spread to an iron condor seems attractive but I would appreciate feedback/critique/suggestions.\n\nIs it better to open a bull call debit spread at strikes nearer to the current (fallen) price?", "score": 1, "replies": [{"body": "1) If your analysis still holds that the stock should rise, then see if you can roll out a week or two at the same strikes for a net credit. This will lower the max loss amount while giving the position more time to be right. Adding the other spread side to make an IC can also lower the max loss amount but be sure to leave a window for the stock to move into and close for a net profit. It is possible to 'invert' the trade so that it cannot be profitable.\n\n2) If your analysis has changed and you think it will not rise, then look to close for something less than the max loss amount and move on to another trade. All spreads should be opened for a max loss you and your account are willing to take.\n\n3) Since this is a defined risk with a max loss you are willing to accept, then holding until 3/21 or the morning of 3/22 to give it more time to come back into range for a smaller loss, or even a possible profit. \n\nTwo more things - \n\n\\- Trading over an ER is a gamble as you cannot know or predict what the stock will do. Most experienced traders take off positions before the ER and only open after the report if a trade is still indicated.\n\n\\- Avoid letting spreads expire as this presents a risk if the short leg gets assigned but the long leg expires.", "score": 2, "replies": [{"body": "Thank you! These are helpful. \n\nAfter fiddling around on [optionsprofitcalculator.com](https://optionsprofitcalculator.com) I don't think I have a good enough iron condor setup I could change my trade to with just a week of expiry.\n\nBased on what you just said, I will wait for the first couple of days next week to see how the price behaves. Depending on whether it moves up or down, I will close and re-open a put credit spread for the same strikes further out (for a net credit) or simply close to cut my losses.", "score": 2, "replies": []}]}, {"body": "I got assigned on the 3/22 585 Put that I had sold short to open. I ended up selling the ADBE shares I got for about $497 and then sold the long 550 Put I was holding for $52. Overall, a loss of around 2.5k.\n\nIs there a way to minimize the risk of early assignment when trading bull put credit spreads?", "score": 1, "replies": []}]}, {"body": "Hello everyone, I sold 10 FCX March 15 42 calls , then rolled them a couple of times for net credit due to the sudden and dramatic change in price of the underlying. Now I have May 17 45 strike. It's still OTM and for sake of simplicity let's assume that it will be OTM far enough at ex-div date that it wouldn't be profitable to exercise. My question is what happens with the extrinsic value if there is an early assignment? How would that amount manifest in my account? I understand that there would be no incentive for this to happen, but let's say someone makes a mistake.", "score": 1, "replies": [{"body": "You keep the premium from selling the calls and sell your shares for $45 per share, that is all . . .\n\nThe option buyer who exercises will lose whatever extrinsic value there was left.", "score": 1, "replies": [{"body": "I think I have a problem with keeping track of my premium then. I kept rolling up and out, re-buying my calls and selling for more some more. I sold the original calls for 300 then bought back for 700, sold the new ones for 800. The calls are now worth  1200 which shows as -1200 on my account and I received 400 cash. Am I correct that right now I have realized a 300 loss and I am down an other 400? Next, if the calls expire worthless, how much will my account be up? 700? And how much will it be up, if it is exercised early, still OTM? Same 700?Thanks for looking into this, I'm a bit confused to tell the truth.", "score": 1, "replies": [{"body": "Add up the net credits and subtract any debits to arrive at the total credits collected. If you rolled for a net credit then the total should have gone up, and you will have collected the total when assigned. Note that by rolling there were losses booked in the account, so you will have to look at your broker transaction statement to calculate.\n\nUsing your numbers, $300 + $800 credits = $1,100, minus $700 in debits would be a $400 net credit which is the total call profit when assigned. Ignore what the market value is of the calls as this would only be valid if they were closed, not if they expire.\n\nThe stock will sell for $45 per share minus whatever you paid for them to know the stock profit. As it takes a day or two for the stock and cash to settle in your account you may not see totals until Monday or Tuesday when assigned on a Friday.\n\nI do show a basic spreadsheet in my wheel post which you can easily duplicate to keep track of the total credits - [https://www.reddit.com/r/options/comments/a36k4j/the\\_wheel\\_aka\\_triple\\_income\\_strategy\\_explained/](https://www.reddit.com/r/options/comments/a36k4j/the_wheel_aka_triple_income_strategy_explained/)", "score": 2, "replies": [{"body": "Thanks a lot, it's the current value which confused me in a way that it shows a dent in my net liquidity. It's much clearer now, thanks!", "score": 2, "replies": []}]}]}]}, {"body": ">let's assume that it will be OTM far enough at ex-div date that it wouldn't be profitable to exercise.\n\nThere's no \"far *enough*;\" it's *never* profitable to exercise an OTM option.", "score": 1, "replies": [{"body": "Even if the dividend is higher than how much it is OTM plus premium paid?", "score": 1, "replies": [{"body": "Well, when comparing exercising vs. selling an option, premium paid is always irrelevant, because it's the same in both cases.\n\nBut if you exercise an OTM call, you are paying more money for the shares than you would if you simply bought them on the open market.  Can you construct an example, with specific numbers, in which it's worth doing that?", "score": 1, "replies": [{"body": "I was thinking, for example, XYZ share is trading at 100$, ex-div date is coming up paying 4$. Holder of calls paid 1$ premium for 102 call, so if they choose assignment before ex dividend, they are up 1$ aren't they?", "score": 1, "replies": [{"body": "No, why would they be up $1?\n\nScenario 1, what you're suggesting:\n\nStart with $10,300 cash.\n\nBuy the call at 1.00, paying $100.  Now you have $10,200 cash and the call.\n\nNow exercise the call before the ex-dividend date when the spot price of XYZ is 100, paying $10,200.  You get $400 in dividends.  Now you have 100 shares, and $400 cash.  The share price drops by the amount of the dividend on the ex-dividend date, so the 100 shares are worth $9600.  So you have a total of $10,000 in value, *less* than what you started with.  And notice what that $300 difference is: it's the $100 you paid for the call, plus the $200 extra you paid to exercise a call that was out of the money by 2.00.\n\nScenario 2: \n\nStart with $10,300 cash.  \nBuy the call at 1.00, paying $100.  Now you have $10,200 cash and the call.\n\nNow just buy 100 shares of XYZ before the ex-dividend date at the spot price of 100, paying $10,000.  You still have $200 cash.  You get $400 in dividends.  Now you have 100 shares, and $600 cash.  The shares are worth $9600, so you have a total of $10,200 cash.  That's less than what you started with in this scenario as well, but it's more than you have in Scenario 1.  The $100 difference is just the $100 you paid for the call.\n\nAnd note it doesn't matter how much you paid for the call.  It's irrelevant.  All you're really comparing is \"pay $10,200 in cash for 100 shares, and receive a $400 dividend\" vs. \"pay $10,000 in cash for 100 shares, and receive a $400 dividend.\"  It's as simple as that.  Why would you voluntarily choose to pay more money for something?\n\n(P.S.: when talking about long options, the term is \"exercise,\" not \"assignment.\" And in English, we put the dollar sign to the left of the numerals. If you're writing out the words, you write \"one hundred dollars,\" but if you're using the numerals you write $100, not 100$.", "score": 1, "replies": [{"body": "It's clearer now, thanks for the explanation, it took a while to get my head around it and probably will read it a couple of times more lol", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I suggest you paper trade a number of dozen earnings events, to obtain some experiece with the topic, without risking you money while learning.\n\nEarnings events have market-expected moves priced into them, and the earnings event must have a surprise greater than the priced in expected move,\n\nthis iscwhatb,any option traders completely avoud earnings events.  th probabilities arecoften worse thatn a 50-50 coin flip.\n\nExample::\n\nYou pay 1.50 for the $17 strike price call.\n\nShares are at 15, a week before earnings.\n\nEarnings are good and the shares go up to $ 18.00\n\nThe day after earnings the option is bid at  $1.25.\n\nYou sell to harvest value for $1.25.\n\nRESULT:\n\nLoss of $0.25. ---> $1.50 cost less $1.25 proceeds.   \n\n\n\n---  \n\n\\[Why did my options lose value when the stock price moved  favorably?  -- Options extrinsic and intrinsic value, an introduction\\](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic\\_value)  \n\n\n\n---", "score": 1, "replies": []}]}, {"body": "So I'm very new to trading options, and I noticed something that I haven't seen people talk about and I'm starting to think I'm not typing in the right type of search. Part of this comes from a Trader I've been following and his method. He says to buy a call option at a strike $10-15 above current share price then sell right after. Cool. In my Robinhood example (Workday share is currently $268, strike price $280 @ $0.81/contract, 5 contracts = $405), now... if I sell that call in the same timeframe, there's a strike of $275 @ 1.50/contract, 5 contracts = $750. Essentially the profit is from the difference in premiums which would be $475 no??? Am I understanding this wrong? It can't be that simple can it? If not, please tell me why because I can't find the answer anywhere.", "score": 1, "replies": [{"body": "Buy a 280 strike call and then sell a 275 strike call would result in a vertical spread.\n\nThe bought call costs premium of $0.81 in your example, with the sold call collecting $1.50 in premium. $1.50 credit collected - $0.81 debit paid would be a net credit of $0.69 or $69 x 5 contracts = $345. So far, so good.\n\nThis is a vertical call credit spread and your risk is the spread between the 280 and 275 strikes, or $5, then as all options are based on 100 shares, this would be $5 x 100 = $500 as the max risk per credit spread. $500 x 5 contracts would be $2,500. However, you collected $345 in credit which would reduce the max risk to $2,500 - $345 = $2,155.\n\nThe most you can gain from this trade if the stock stays below $275 through expiration would be $345, but the most you can lose if the stock goes higher would be $2,155, \n\nVertical credit spreads do have risks and profit from the stock moving in the direction predicted, in this case staying below $275, but you can see there is a risk if the stock moves up counter to the prediction.\n\nSee this page that explains how these spreads work - [https://www.investopedia.com/terms/v/verticalspread.asp](https://www.investopedia.com/terms/v/verticalspread.asp)", "score": 2, "replies": [{"body": "This makes complete sense! Thank you so much! (realized the max profit would be 345 not 405) I understand now why people wouldn't want to do this because the risk to reward isn't exactly favorable.\n\nWhat I also can't find is do all calls end at the expiration date? Like I know you can cancel/close, but if you buy a call and sell a call - people say that's selling to close the long buy, but it's still runs to the expiration date right?", "score": 1, "replies": [{"body": "Options cease to exist after they expire, typically on the day after the expiration date.\n\nOptions are \"opened\" and \"closed\". Once your option is either closed or expires it is done and over with . . . \n\nIf a seller and buyer both close, then the option is over and does not run to expiration as there is now 1 less option in the universe. \n\nThere is this strange misconception that options live on forever **(Zombie options??)** and can come back to bite you somehow, but this is not at all accurate. The vast majority of options are closed to take off any profit or loss as well as any risk.\n\nI strongly encourage you to learn the basics to avoid the many problems that come from now knowing - [https://www.investopedia.com/options-basics-tutorial-4583012](https://www.investopedia.com/options-basics-tutorial-4583012)", "score": 1, "replies": []}, {"body": ">What I also can't find is do all calls end at the expiration date? Like I know you can cancel/close, but if you buy a call and sell a call - people say that's selling to close the long buy, but it's still runs to the expiration date right?\n\nThink of a call option like a retail coupon.  \"1 large pizza at Domino's for $10.  Expires 3/31/24.\"  That's pretty much what it is, right?  \"100 shares of WDAY for $28,000.  Expires 3/28/24.\"\n\nNow imagine you had that Domino's coupon, and someone offered to buy it off you for $1.  So you sell it to him.  He gives you $1, and you give him the coupon.  Yes, it still doesn't expire until 3/31/24, but do you care?  No, you don't have the coupon anymore.  It's gone from your life.  You have nothing to do with that coupon anymore.", "score": 1, "replies": [{"body": "Ahh gotcha, that makes sense!", "score": 1, "replies": []}]}]}]}, {"body": "I think you must be misunderstanding something.  An option--whether it's a call or put, which stock it's on, its strike price, and its expiration date--is a thing that is traded on a free market, just like shares of stock themselves, and is different from an option that has any one of those traits (like strike price) that is different.\n\nIf you buy a thing, then immediately after you buy it, its price hasn't changed.  It's the same with a share of stock, right?  You can't buy a share of stock that's trading at 50 and immediately turn around and sell it at 60.  Rather, when you buy it at 50, you are hoping its price is going to go up at some point in the future, and you have to wait for that to happen in order to sell it for a profit.\n\nIt's the same with options.  If you buy this 280 strike call at 0.81, immediately afterward, it's still at 0.81.  The fact that the 275 strike call on the same expiration date is trading at a higher price doesn't allow you to sell your 280 strike call at a different price.  The 275 strike call is a different item from the 280 strike call.\n\n(Not to mention that 750 - 405 = 345, not 475.)", "score": 1, "replies": [{"body": "Oh yes, my bad on the math part. I think where I'm confused is everyone I watch says you can sell an option or \"sell to close\".\n\nNow with the trader I mentioned, he showed how to find a pattern, so I know the price will at least go up to $270-$271, so when that happens, could I then exercise that sell call option at $275 strike to essentially close out the initial buy call option?\n\nAm I mistaken, do you have to sell the same exact option you bought?", "score": 1, "replies": [{"body": "Upon further reflection, I think u/ScottishTrader's reply is probably more relevant, as I suspect the trader you are following is talking about selling call credit spreads.\n\nNote that this does not normally entail buying a call and then selling a call right after, in two different orders.  That is called \"legging into\" a spread.  Normally you would open the spread as a whole, in one order.\n\nWhat may be confusing you is that you may not be familiar with the concept of selling something short.  (And while you don't have to be some master stock trader, frankly, if you don't know enough about how the stock market works to be familiar with the concept of selling something short, you probably shouldn't be messing with options yet.)  When you open the spread you are talking about, you are buying the 280 strike call, and selling the 275 strike call short, meaning selling it without having one in the first place.  You are not buying the 280 strike call, opening a position, then selling the 275 strike call which somehow results in closing your position.\n\nThey're called \"long\" and \"short,\" not \"sell\" and \"buy.\"  You would be short the 275, so you can't exercise it.  The goal is to have the underlying remain below 275, while time passes so that the value of the spread decreases, and you can buy to close it for less than you sold it for, thus taking a profit.", "score": 2, "replies": []}, {"body": "\"so I know the price will at least go up to $270-$271\"\n\n\nUntil you realize this is a false statement, you need to stop all of your planning immediately. ", "score": 1, "replies": [{"body": "I understand nothing in the market is for certain, but you gotta know I’m following a pattern not the price when I say that. The pattern helps me predict the price during a certain timeframe but the price for sure changes.", "score": 1, "replies": []}]}]}]}]}, {"body": "Scenario: I've held the underlying stock for over a year. I sell a call that expires in less than 30 days. Expiration date comes and I'm assigned. I still make profit since I sold above my cost basis. Are my gains going to be taxed as short term cap gains or long term cap gains?\n\nI'm assuming the premium I collected will be taxed as short term cap gain but what about the profit I made selling the underlying stock? \n\nAnd is my new cost basis now [original cost/share + premiums collected + dividends]?", "score": 1, "replies": [{"body": "What happens is, the strike price plus the premium you received for the option is considered to be the price at which you sold the shares.  And as long as the call was OTM when you sold it, your profit will be a long-term capital gain.\n\nSo if your cost basis on the shares is 50, and you sell a 55 strike call for a premium of 2.00, and the stock is at 56 at expiration and you get assigned, your profit is (57 - 50) x 100 = $700 of long-term capital gains.\n\nCost basis on a given lot of shares does not change with collection of dividends or call premium.  It doesn't change once you buy the shares.  People who talk about \"selling covered calls to reduce my cost basis\" are using the term \"cost basis\" incorrectly.\n\nhttps://www.schwab.com/learn/story/how-are-options-taxed", "score": 3, "replies": [{"body": "That makes sense, thank you!", "score": 1, "replies": []}]}]}, {"body": "On Yahoo Finance when you look up a stock ticker thar trades on the NYSE, it says Equity followed by NYQ.\n\nFor a NASDAQ stock it says NMS.\n\nWhat is NYQ and NMS and what do they stand for?", "score": 1, "replies": [{"body": "Nyq is for consolidated instruments NYS is for normal NYSE notation NMS is for national market system. They're technically different exchanges (platforms)", "score": 1, "replies": []}]}, {"body": "I am considering doing long strangles for pre-earnings heading into the print . Any advice for a newbie to scalp OTM options using a cash-only account?\nIndicators, risk management strategies? I would also like to do intraday option scalping of high-volatility stocks using indicators such as RSI of both the option and underlying stock, as well as looking at Bollinger bands. (On NVDA, TSLA, SMCI, etc.) Any advice?", "score": 1, "replies": [{"body": "Pre earnings IV will rise. Strangles are therefore expensive.", "score": 1, "replies": []}, {"body": "Pre-earnings will have higher IV and pricing, which will drop once the report is out (IV crush), so these will be difficult to profit as both legs will drop by some amount. The stocks will have to move by a substantial amount for one leg to overcome the high cost of both legs to profit, and since it is impossible to know if or how much the stock will move this is more like a gamble.\n\nIMHO indicators don’t work well in general, but don’t work at all over an event like an ER . . .", "score": 1, "replies": []}, {"body": "Why did my options lose value when the stock price moved favorably?   \n\n\n • Options extrinsic and intrinsic value, an introduction (Redtexture)  \n\n\n https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value", "score": 1, "replies": []}]}, {"body": "What is the recommended options value for each trade to have prudent risk management?\nFor example, I have 5k in my cash account. How much should I risk in each options scalping or swing trade?", "score": 1, "replies": [{"body": "There's no hard rule. But especially as a beginner i would start small. 2-5%", "score": 2, "replies": [{"body": "I have been placing single $1 OTM contracts (approx 100 dollars sum at risk), is this too big or small?", "score": 1, "replies": [{"body": "Well, fees matter more for small transaction. You could go a bit higher. $15-20 for a single contract. But I wouldn't dabble in contract sizes near 1000 just yet.", "score": 1, "replies": []}]}]}, {"body": "IMO 5% max risk per trade or stock can suffer a full loss and not severely impact the account . . .", "score": 1, "replies": []}]}, {"body": "I am trying to get a better understand of:\n\n1. All stock market participants and how they tie in together\n2. The various trading scenarios\n   1. Market maker and a buyer/seller\n   2. Market maker and a buyer on one end and seller on other end\n   3. Brokers and all counterparties\n   4. Principal traders and counterparties\n   5. Proprietary traders and counterparties\n\nWebsite will explain these things, but I am often left with many questions about what kind of scenarios can occur when trading and who the participants are. What price (bid or ask) each party buys or sells at, etc.\n\nCan anybody recommend any books that explains these things in detail? Any websites?", "score": 1, "replies": [{"body": "> All stock market participants and how they tie in together\n\nOff-topic for this sub. Try r/investing.\n\n> Market maker and a buyer/seller\n\nMM provides liquidity to retail traders. They make a market for every contract. What more do you want to know?\n\n> Market maker and a buyer on one end and seller on other end\n\nThis doesn't make sense. The MM is either on one end or the other. So if you are the buyer, the MM is the seller. If you are the seller, the MM is the buyer. Or there is no MM involved at all and a buyer and seller are trading with each other.\n\n> Brokers and all counterparties\n\nThat would take an entire book to explain. The back-office stuff for options trading is quite complicated and is constantly changing. Whatever I wrote would be obsolete in a month or less.\n\nHere's a brief overview that gives you an idea of how complicated it is. It can serve as starting point for further reading: https://frontmonth.substack.com/p/options-market-structure-101-b18\n\nThis quote from that link is noteworthy: *I consistently have trouble finding accurate data & information that tells me how the options market works, how different participants are incentivized, and where we should be challenging the system’s design.*\n\nBut FWIW, it doesn't matter. All that matters is the bid/ask spread of the contract in question. How that bid/ask is updated in real-time and who is working behind the scenes is mostly irrelevant. It only becomes relevant if you are trying to super-optimize your overhead costs, in which case manually routing your orders might shave a few pennies off your overhead costs. But even then, your degrees of freedom are limited by what routing options your broker offers.\n\n> Principal traders and counterparties\n\nI don't know what that means and they are probably irrelevant to a retail trader anyway.\n\n> Proprietary traders and counterparties\n\nI don't know what that means and they are probably irrelevant to a retail trader anyway. It's like worrying about the fiscal policy of the government of Namibia. Even if you understood it, there is nothing actionable you can do about it.", "score": 2, "replies": [{"body": ">The MM is either on one end or the other. So if you are the buyer, the MM is the seller. If you are the seller, the MM is the buyer. Or there is no MM involved at all and a buyer and seller are trading with each other.\n\nJust to be sure, does this mean that the following setup can not happen:\n\nBuyer > MM > Seller\nor\nSeller < MM > Buyer\n\nAlso, I thought there always had to be a middle man like a broker or MM. So how can a buyer and seller trade directly with each other?\n\nYour answer was very helpful. I think I'm getting a better understanding of this.", "score": 1, "replies": [{"body": "You're not wrong about middlemen. If you read the link above, you can see that yes there are various types of middlemen in the structure of the options market. They generally **aren't** market makers, unless they are specifically Citadel, since Citadel plays three different roles in the game (MM, wholesaler, hedge fund).\n\nBut in the simple terms I was using to explain parties vs. counterparties, which ignores clearing houses, wholesalers, and exchanges -- the same way we would ignore those complications in a stock trade -- the only pairings worth noting are:\n\nTrader is party, MM is counterparty.\n\nTrader is party, a different Trader is counterparty.\n\nWhere Trader is any market participant trading their own account, like Retail or Institutional.", "score": 1, "replies": [{"body": "\nThank you for your reply. This was very helpful. I'm just curious to know all the different possible setups.\n\n\n>Trader is party, a different Trader is counterparty.\n\nIn this scenario, what price (bid or ask) would each party buy or sell at?\n\n\n>Where Trader is any market participant trading their own account, like Retail or Institutional.\n\nWhen you say trading their own account does that mean profiting from the bid/ask spread or buying and holding then selling later on? If so, how long might they hold their positions before selling?", "score": 1, "replies": [{"body": "> In this scenario, what price (bid or ask) would each party buy or sell at?\n\nWhatever they agreed to? The only practical difference is that MMs are *required* to post standing orders to establish a market, but aren't required to *fill* at only those prices. Apart from that, everything else is the same. An order is filled when the party and counterparty both agree on a price. The price they agree to is usually inside the spread. It doesn't have to be either the bid or the ask, although it often is for narrow spreads.\n\nEDIT: Sorry, I missed the second question /u/DutchAC. No, trading their own account means not trading on behalf of another person or entity. Brokers may trade on behalf of a client, as would money managers, portfolio managers, etc. I'm excluding all those. I meant people trading for their own benefit, not because they are paid by someone else to trade someone else's money.", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ll add to the wonderful reply from u/PapaCharlie9 that  none  of  this  really  matters.\n\nThis is like asking for a details of an electrical generator and the transmission of the electrical grid to know how your toaster makes toast. \n\nThe options markets and exchanges are very efficient as they process billions of option trades every year, so knowing these details is unlikely to help you make better toast, er. trades . . . ;-D", "score": 2, "replies": []}, {"body": "if you really want to learn about this stuff, i suggest trying to get your hands on a textbook for a certification for Professional Investors. i learned it from here: \n\n[https://www.dsi.nl/en/certificering/dsi-securities-trader/](https://www.dsi.nl/en/certificering/dsi-securities-trader/)\n\nwhich is my country's institute. the textbook was as thick as a phonebook though :) im not sure were you live, or what options are available in your country.", "score": 2, "replies": []}]}, {"body": "Sorry for the dumb question but how come people trade the QQQ instead of the Spy? Price movement is nearly identical. I believe there are others with the same price movement.", "score": 1, "replies": [{"body": "They represent a number of different stocks and markets.\n\nQQQ has a lot of tech stocks, SPY is the S&P 500 which also has some tech but also big industrials.\n\nWith more tech QQQ do often move more and faster, than SPY. Not sure of your timeframe you’ve looked at their price movement but it is not always the same. \n\nWhile there is some overlap they do represent different sectors of the market.", "score": 1, "replies": []}]}, {"body": "I have 2 questions\n\n1. the bid-ask as I write for NVEI 22.5 PUT expiring 6/21 is 0.15-1.45 . This is too big a gap. Now I know that the asker can ask any amount imaginable but there are 145 asks at 1.5 and just 2 bids at 0.15. What makes an asker go for such a high ask ? when the bids are so low ? I don't see the same happening with other options. Is it arbitrary and upon the whim of the asker or is there more to it\n2. I've seen that whenever a stock moves in either direction, the related option's ask-bid moves nearly instantaneously (I am using RH) . How can it be instantaneous ? The way I envision it is that there is a person looking at stock prices (or getting notified by alerts they have set up) . They see the movement, and they replace their ask/bids appropriately. This whole process should take at least 5 seconds IMO (best case). So how is it happening instantaneously ? Makes it seem like all trades are robo driven.", "score": 1, "replies": [{"body": "One.  Low volume options have wide spreads.   High volume makes for active auction activity and competition.         \n\n\nTwo.   Computer programs work at all major players' trading desks", "score": 1, "replies": []}]}, {"body": "Newbie questions. \n\nMy /ES short call option 5240 expired itm today. Settlement price at 4pm was 5241.75 so I am surely getting assigned -1 ES future right?\n\nI have not see the -1 ES future show up in my tastytrade account yet. Anyone have experience when will it show up?\n\nShould I just buy 1 ES future contract now to offset it?\n\nThanks in advance.", "score": 1, "replies": [{"body": "Oh boy.\n\n\nYou really really need to know how your options settle, and futures are wildly different even for the same ticker underlying, sometimes settling to cash, sometimes to the contact.  \n\n\nUntil you know how your options are settling with complete certainty, exit before trading ends on your futures options.  \n\n\nAccording to this, Tuesday ES futures options settle to the contract.  \n\n\nMake sure you were actually assigned before taking further action.  \n\n\nhttps://www.cmegroup.com/markets/equities/sp/e-mini-sandp500.contractSpecs.options.html#optionProductId=10132\n\n\n\n\n\nCall up Tasty for guidance.", "score": 2, "replies": [{"body": "Thanks!!\n\nYes this is such a rookies mistake.", "score": 1, "replies": []}]}]}, {"body": "I'm looking for recommendations to educate myself about Crypto. I know the very, very basics of what cryptocurrencies are and the concept of the blockchain, but that's about it. On a scale of 1 to 10, I'd like to get myself from level 1 to maybe level 3, or something like that.", "score": 0, "replies": [{"body": "wrong subreddit", "score": 2, "replies": []}, {"body": "Try r/cryptotrading", "score": 2, "replies": []}]}, {"body": "[removed]", "score": -1, "replies": []}]}
{"title": "Tesla enforces no resale clause on Cybertruck, cancels orders and blacklists owner.", "selftext": "", "id": "1bc9pru", "created_utc": 1710180249.0, "score": 153, "upvote_ratio": 0.94, "num_comments": 41, "comments": [{"body": ">NEWS: Tesla enforces no resale clause on Cybertruck, cancels orders and blacklists owner.\n>\n>“Moving forward, any future orders placed by you will be cancelled without a refund of the $100 reservation or $250 order fee as official notification has been provided to you regarding this matter,” Tesla said in their email.\n>\n>Source:https://driveteslacanada.ca/news/tesla-enforces-no-resale-clause-on-cybertruck-cancels-orders-and-blacklists-owner/", "score": 24, "replies": [{"body": ">Over the last few weeks we have seen the number of “Cybertruck for sale” listings grow, despite owners agreeing not to resell their Cybertruck within the first year of ownership. If you happen to be one of the few early Cybertruck owners, you may want to think twice about even attempting to list your electric pickup truck for sale, as the automaker appears to be following through and taking action on the no-resale clause in their purchase agreement.\n>\n>Even before the first Cybertruck deliveries began, Tesla added a no resale clause to their purchase agreement. This clause was specific to the Cybertruck, and stated that anyone purchasing one would not sell, or even attempt to resell it within the first year of ownership.\n>\n>According to the clause, if someone did try this without first getting written permission from Tesla to do so, the company would take action against you, going so far as to seek damages of $50,000 or the profit made from the sale, whichever is greater, and even ban you from purchasing other Tesla vehicles in the future.\n>\n>This clause hasn’t stopped numerous people from trying, with one Cybertruck AWD recently selling for $244,000 at auction. While we haven’t heard yet if that original owner is facing any legal action from Tesla, another early Cybertruck owner who simply listed their Cybertruck for sale has been blacklisted by the company.\n>\n>According to Cybertruck Owners Club forum member Dennis (malinecentral), they haven’t sold their Cybertruck, but simply listed it for sale “literally everywhere,” hoping for a big payout. Tesla apparently got wind of the listing, and the company’s Loss and Prevention team reached out to let them know their two other Cybertruck reservations had been cancelled and order fees refunded.\n>\n>Not only that, they have been blacklisted from ever ordering another Tesla.\n>\n>“Moving forward, any future orders placed by you will be cancelled without a refund of the $100 reservation or $250 order fee as official notification has been provided to you regarding this matter,” Tesla said in their email.\n>\n>So far there have been two sides in reaction to this story, with some applauding Tesla for taking action, while others say the company is overreaching. However, the terms and conditions of the purchase agreement the owner signed are clear.\n>\n>It is also not the first time an automaker has taken action against an owner for selling a car under a similar clause. Pro wrestler John Cena was sued by Ford for selling his Ford GT, and despite being able to afford some very good lawyers, Cena ended up settling the lawsuit out of court for an undisclosed amount of money.", "score": 30, "replies": [{"body": "“Masterful gambit, sir.”", "score": 3, "replies": [{"body": "\\*elon slams dick in car door", "score": 0, "replies": [{"body": "Was it a stainless steel door? I hear they are heavier and have some weight to them.  LOL", "score": 1, "replies": []}]}]}]}]}, {"body": "I understand blacklisting getting cars that are production constrained or early released but they literally ban you for buying any Tesla. Like you can't even buy Model 3 for example. Sounds a bit bad as a business decision.", "score": 18, "replies": [{"body": "I agree, hurt them in the pocketbook but don’t shut the door on future purchases. That said this will be such a small subset of owners that it won’t make a lick of difference.", "score": 24, "replies": [{"body": "It’s a door that can be reopened in 5 nanoseconds.", "score": 16, "replies": [{"body": "Please explain how the door can be opened after being closed.", "score": 0, "replies": [{"body": "“Hey everyone, we’ve decided that if you were blacklisted during the cybertuck intro, you are no longer blacklisted. But we’ve got our eye on you.” Followed by a simple SQL database update.\n\nOr they could change the blacklist to only apply to newly introduced models.", "score": 2, "replies": []}]}]}, {"body": "Those are scalpers. Also, I don't think there are many of them. Certainly not enough to hurt the sales.", "score": 10, "replies": []}]}, {"body": "\"it's about sending a message\"", "score": 8, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "the message is the contract you signed when you ordered is being enforced. folks knew this was a risk when they ordered, they got brave and felt Tesla wasn't going to enforce the no resell clause. they thought wrong.", "score": 1, "replies": []}]}]}, {"body": "Fuck around and find out. They knew the rules.", "score": 18, "replies": [{"body": "Fuck the customers buying your product.  Bold strategy.", "score": -7, "replies": [{"body": "Mmm if they blatantly disregard a no resale within 1 year clause, yes, fuck them up their stupid redneck asses.", "score": 6, "replies": []}, {"body": "The customer did the fucking first tho, and they were warned about it too lol", "score": 3, "replies": []}, {"body": "Fuck the scalpers you mean\n\nThey had no intention of actually being a customer, they just wanted to scalp", "score": 1, "replies": []}]}]}, {"body": "Nah, im all for companies working against scalpers. If you are unsure you really want the truck, just wait then. Plus with how god damn ugly those trucks are, if someone is purchasing one, I assume they are fully aware of what they are getting and want it.\n\nNoone would accidentally order something that ugly unless they were dead set on it.", "score": 6, "replies": [{"body": "There's one guy who posted about Tesla refusing to buy back his cybertruck but also refusing to let him sell it. He couldn't fit it in his complex and wanted to trade if for a model 3. I wonder how many people got boned on that end and just said \"fuck it, I'm selling it anyway.\"\n\nI doubt it's actually against scalpers, looks more like they just wanted to milk anyone that wanted out for another possible $50K and make them look like the bad guys.", "score": 1, "replies": []}]}, {"body": "You have to set the penalty high enough. Tesla doesn’t want to spend money on lawyers. Tesla can always unblacklist people in the future. I see no reason to not threaten to blacklist people.\n\nThat said, I think this whole endeavor is a waste. Tesla would get far better publicity by letting the cars get resold. It makes the cars more coveted and valuable in the minds of potential buyers. Apple ALWAYS “leaks” a news story about how they may not be able to satisfy demand of new iPhones while having the ability to work thousands of people 3 shifts a day along with a state if the art supply chain system. The false scarcity drives urgency for buyers.", "score": 1, "replies": [{"body": "Cars can be resold. Just not within the year. ", "score": 5, "replies": []}]}, {"body": "Well, the threat of that is supposed to prevent people from reselling. Wonder if the people who actually sold are sweating bullets rn.", "score": 1, "replies": []}, {"body": "Sounds like \"cancel culture\".\n\nAnd surely in a free society, you can't be restrained from selling something you own.", "score": -3, "replies": [{"body": "The point is to blacklist scalpers, who are just scooping up cars to flip them at rip-off prices. Tesla doesn’t want scalpers to buy their cars, this won’t hurt their actual sales at all, it’ll just mean they’re selling to people who want to own and drive their cars, not people who just want to rip off people who want to own and buy the cars. Many companies have anti-scalper policies, and they’ve held up in court.", "score": 1, "replies": [{"body": "What's so bad about scalpers in this case.  There is a market for cyber trucks which is constrained by supply.  Tesla constrains supply as well as decides who on the waitlist gets first access.  They already control a lot.\n\nI don't think this clause will stand up in court.", "score": 1, "replies": [{"body": "The same sorts of contract terms have been upheld by courts many times before. Ferrari, Porsche, GM, …", "score": 1, "replies": []}]}, {"body": "but I thought Musk was the freedom warrior....not very freedom of him", "score": 1, "replies": []}]}]}, {"body": "Just have your spouse or relative buy it. Loop hole ftw. ", "score": -5, "replies": []}]}, {"body": "f around and find out. When there is 2 million people waiting and you get on and resale it it?", "score": 7, "replies": []}, {"body": "Sounds like the Beanie Baby guy getting pissed that people were selling them on ebay. It drives up demand. The company shouldn't really care so much.", "score": 2, "replies": []}, {"body": "Good", "score": 2, "replies": []}, {"body": "Sell a banana with free cybertruck?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Some DMV will ignore your claimed value and use the fair market price instead.", "score": 1, "replies": []}]}]}, {"body": "Musk should disable the Cars for those who just bought them from these scalpers who did not agree. They can node lock and brick the vehicle and have it also display on the screen that the person who sold the vehicle has violated the agreement. \n\nThis would put an end to scalpers buying the Cybertrucks for resell within a year. Too bad for the suckers who bought them now they would have a nice Bricked non functional vehicle.", "score": 1, "replies": []}, {"body": "Who cares if people resell it, the damn trucks are going for twice they were supposed to sell for originally. If you can sell out, who cares who buys them. That’s like telling Elon he has to sell PayPal for the price he bought PayPal, wtf. Let others make business moves too!", "score": 1, "replies": []}, {"body": "People are brainwashed thinking Elon Musk supports freedom. He doesn't. He won't even allow you to sell your truck the first year of buying it or gave a $50,000 fine. Yeah that just screams freedom. 😂😂😂😂😂", "score": 1, "replies": []}, {"body": "I think Tesla should just build more trucks and forget about this BS.", "score": -5, "replies": []}, {"body": "\"Moving forward, any future orders placed by you will be cancelled without a refund\"    \n    Not sure that is legal", "score": -1, "replies": []}, {"body": "I’m still surprise that people buy this shit.", "score": -2, "replies": []}]}
