{"title": "Jeff Bezos, Elon Musk, and Ken Griffin are sounding the alarm on a US recession. Here are 12 dire economic warnings from BSDs. Do you agree?", "selftext": "**1.** **Jeff Bezos, Amazon's founder and executive chairman:**\n\n\"The economy does not look great right now. Things are slowing down, you're seeing layoffs in many, many sectors. The probabilities say if we're not in a recession right now, we're likely to be in one very soon. Take as much risk off the table as you can. Hope for the best, but prepare for the worst.\"\n\n\"The probabilities in this economy tell you to batten down the hatches.\"\n\n**2.** **Elon Musk, CEO of Tesla, SpaceX, and Twitter:**\n\n\"There's going to be probably a year or two of serious recession.\"\n\n\"Frankly, the economic picture ahead is dire, especially for a company like ours that is so dependent on advertising in a challenging economic climate.\"\n\n**3.** **Ken Griffin, CEO of Citadel:**\n\n\"For the Fed to truly conquer inflation here, we're going to put unemployment somewhere in the mid-4% range. I find it hard to believe we're not going to have a recession at that point in time, sometime in the middle to back half of 2023.\"\n\n**4.** **Charlie Munger, Warren Buffett's business partner and vice-chairman of Berkshire Hathaway:**\n\n\"I think the Fed is willing to have a little recession in order not to have out-of-control inflation. That's what they're supposed to do. They're supposed to be the one guy at the party that doesn't hang around the punch bowl getting drunk.\"\n\n**5.** **Carl Icahn, chairman of Icahn Enterprises:**\n\n\"Whenever you have higher interest rates that have moved as they have here, you have an inverted yield curve, Treasuries at close to a 5% yield — you are going to have a recession. And I think we do have a recession already. There's a lot of things that have to happen to turn this economy around, to get us out of a recession.\"\n\n**6.** **Jamie Dimon, CEO of JPMorgan:**\n\n\"There's a possibility of a mild recession. Consumers are in very good shape, companies are in very good shape. And there's a possibility of something worse, mostly because of the war in Ukraine and oil price and all things like that.\"\n\n**7.** **David Solomon (AKA DJ SOL), CEO of Goldman Sachs:**\n\n\"Generally, when you find yourself in an economic scenario like this, where inflation is embedded, it's very hard to get out of it without a real economic slowdown. The US is most likely going to have a recession.\"\n\n**8.** **Jeff Gundlach, DoubleLine Capital CEO:**\n\n\"Recession is easily 60% in the next six-to-eight months, and for the year 2023, I'd put it at more like 80%.\"\n\n**9.** **Leon Cooperman, CEO of Omega Advisors:**\n\n\"The combination of Fed tightening, quantitative tightening, a strong dollar, and the price of oil will create a recession in the second half of 2023. We've pulled forward demand because of very inappropriate fiscal and monetary policies, and ultimately a price is going to be paid.\"\n\n**10.** **Greg Jensen, co-CIO of Bridgewater Associates:**\n\n\"We are expecting a much bigger recession than the markets are expecting. 2023 will likely be the year of a very significant global recession.\"\n\n\"You probably won't see the bottom of the equity markets until they begin easing, six to seven months from now. You probably won't see the end of the bottom of the economy for another nine months or so after that.\"\n\n**11.** **Nouriel Roubini, NYU Stern economist known as \"Dr. Doom\":**\n\n\"History suggests it's going to be near mission impossible to avoid a hard landing. You're going to get not only inflation, not only a recession, but what I call the 'Great Stagflationary Debt Crisis.' So it's much worse than the '70s, and it's probably as bad as during the Global Financial Crisis.\"\n\n**12.** **Ken Rogoff, Harvard economist:**\n\n\"You really have to look at the world, which is in bad shape. It's very hard for the United States to resist that. I worry that not only are we going to get a mild recession, I think the chances that we get a significant recession are really pretty high.\"", "id": "z0enfb", "created_utc": 1668976838.0, "score": 54, "upvote_ratio": 0.64, "num_comments": 87, "comments": [{"body": "Every one of these comments is undated. When did they say these things? What was the context?", "score": 92, "replies": [{"body": "He left out dates and context on purpose.\n\nOP is a big FUD phony.", "score": 81, "replies": [{"body": "I don’t think so. I think the market got way ahead of itself, like it did coming out of COViD. The recession is coming and it’s not priced in yet. Next 6 months will be toughest and we won’t startingncomingkiutnod it for another 1-2 years. \n\nGet defensive. Play puts in the short medium term. It’s gonna be real tough out there and assets of all kinds will lose value.", "score": 9, "replies": [{"body": "Do you think domino effects will reflect by Q3 2023?", "score": 2, "replies": [{"body": "Most definitely. The announcement of legislation will be telling. Hopefully by this time the dust has settled and the path forward will be more clear. Crypto is gonna hurt longer than the broader market.", "score": 1, "replies": []}]}]}, {"body": "Huh? I dont think thats true. I think ops just lazy, specially since the recession signal started coming in late July and started hitting harder by August  with weekly testimonies. For ex.\n\nJaime/ jpm said it a few weeks ago if i recall correctly.\n\nElon had said it about 2 months ago. \n\nI can keep going down the list.", "score": 5, "replies": []}]}, {"body": "I'm with those 12 guys no rose colored glasses for me!", "score": 5, "replies": []}, {"body": "Most of these folks make money whether you buy or sell.", "score": 5, "replies": []}, {"body": "All these comments were made over the last quarter.", "score": 5, "replies": [{"body": "Most in here have no patience, and few have ever invested during a recession with significant capital. The smugness is astounding.", "score": 4, "replies": []}]}, {"body": "Half the comments mention a recession in 2023 so I’m sure they were made somewhat recently, but that’s just an educated guess.", "score": 1, "replies": [{"body": "https://youtu.be/t1QD0UMYy2U good thoughts", "score": 1, "replies": []}]}]}, {"body": "Ken Griffin? The corrupt head of Citadel who lied to congress and has a mayo obsession?", "score": 40, "replies": [{"body": "Yes, and Jeff bezos of Amazon who chose competitors for him to short into bankruptcy for Amazon to absorb. All the while him being long Amazon. Bunch of fucking crooks… who cares what these clowns have to say. They are the reason the economy is going to crumble, and are misdirecting the general public.", "score": 22, "replies": [{"body": "Amen!", "score": 1, "replies": []}]}, {"body": "Knew you were in the cult before I looked at your profile", "score": -3, "replies": [{"body": "Indeed! Power to the players!", "score": 2, "replies": []}]}]}, {"body": "A lot of people eat, shop and work from home now. This is deflationary. I don't expect inflation to last for years and years.  When inflation does fall many stocks will shoot upward.", "score": 20, "replies": [{"body": "Supply chain issues are mostly resolved as you can see from shipping container prices and households have depleted their record savings and started piling up debt.\n\nIf this all isn’t deflationary I don’t know what is", "score": 5, "replies": [{"body": "All those quotes seem like they’re from billionaires threatening layoffs if jpow keeps hiking his rates", "score": 5, "replies": [{"body": "Trueeee", "score": 1, "replies": []}]}, {"body": "The shipping container prices crisis has been way overstated. Shipping costs typically account for 1% of the price of goods. Despite the big boom, that clearly was not what caused inflation to spike.\n\nOn another note, how is piling up debt deflationary? Cutting spending and henceforth demand would be deflationary. Substituting savings with debt to purchase goods and services just exacerbates the issue.", "score": 2, "replies": [{"body": "When households go from high cash to high debt their spending power is reduced, which is deflationary", "score": 1, "replies": []}]}]}, {"body": ">A lot of people eat, shop and work from home now\n\nA lot less people than you'd think", "score": 2, "replies": []}, {"body": "In what way would that be deflationary?", "score": 1, "replies": [{"body": "Less people driving, shopping and eating out means less demand for many things.   Less demand causes prices to go down.", "score": 1, "replies": [{"body": "Leaving aside the fact that working from home as a phenomenon is very overstated these days. \n\nIt also means a boom in spending on other things, we've seen it. More time, more disposable income. MORE demand, not less.\n\nAre people really blind to what has been going on for the past couple of years?", "score": 1, "replies": [{"body": "We all have different experiences and see things differently.  Me sitting at home eating a sandwich and buying something way cheaper on AMZN then what' i'd pay for at Macys and not driving and paying gas and not stopping at SBUX is me spending a lot of less money than I used to.  Maybe that's not the case for other people.  We'll see.", "score": 1, "replies": []}]}]}]}]}, {"body": "God forbid any of them consider the 50-year high in corporate profit margins as being part of the issue...", "score": 56, "replies": [{"body": "Where are corporate profit margins documented? Is that something that is included in earnings call data?", "score": 4, "replies": [{"body": "[https://www.wral.com/fact-check-are-corporate-profits-at-record-highs-because-companies-are-overcharging/20068026/](https://www.wral.com/fact-check-are-corporate-profits-at-record-highs-because-companies-are-overcharging/20068026/)\n\n&#x200B;\n\n[https://tradingeconomics.com/united-states/corporate-profits](https://tradingeconomics.com/united-states/corporate-profits)\n\n&#x200B;\n\nAlso federal reserve is reporting this, and there are Bloomberg articles", "score": 3, "replies": [{"body": "I read the first article, in full, and it basically says at the end that the statement that corporate profit margins are up, is only a half-truth.\n\nIt makes sense to me, in the context of oil. You can look at the stock prices and P/E  ratios, which seem to back that claim up.\n\nWhat has been bothering me about this, is if you look at metrics for S&P 500, it shows that P/E has overall been dipping most of the year, which indicates to me that most companies are making less profit.\n\nIf companies really are making money hand over fist, how come it isn’t reflected in stock prices and P/E?", "score": 3, "replies": [{"body": "Relative to 20,30, 40 and more years ago, corporate profit margins are very much higher than before.  Also the share of GDP that is going to labor vs profits has been declining for years and years.  Middle and lower class pay has been stagnant for many years as well.  The wealthy are getting more, but not the middle and lower classes.  \n\nThere is lots of debate about why this is happening, but there is little debate that it is happening", "score": 5, "replies": []}]}]}]}, {"body": "None of those comments were speculating on what was driving the potential recession. They're just commenting that they're anticipating one.", "score": 6, "replies": []}, {"body": "Any actual evidence of this? Every company I track/own are getting killed and have decreased margins, freezing hiring, and are lowering their guidance for the next 6 months.", "score": 3, "replies": [{"body": "It's possible the last year of making massive profits has caught up.  They werent going to keep it up forever, because you cant have 8% inflation for very long before it becomes untenable.\n\n&#x200B;\n\nCheck the federal reserve and bloomberg.  Also multiple news articles over the last year", "score": 3, "replies": [{"body": "Yes. We have hit peak corporate profits for this cycle.", "score": 3, "replies": []}, {"body": "I saw a lot of news articles quoting Biden, but very little facts to support the argument tbh. There are like 3 or 4 irrelevant companies each article loves to point at like Hertz that went from negative margins to positive from 2019 to 2021 and show 5,000% margin increase, but Hertz is obviously not a strong company that anyone should invest in. At the same time though, considering the pain most sp500 companies are in right now, I kind of doubt most are seeing historically high margins (besides oil)… \n\nIt seems more like blatant proletariat misdirection where the government (trump, Biden, and fed) fucked up and created runaway inflation through irresponsible spending during Covid and are now trying to blame big bad business as a scapegoat.", "score": 0, "replies": [{"body": "I heard a rumour that the amount of oil and gas coming out of Russia hasn’t even decreased. All that energy is making it’s way into the western world thru back door countries like India and Argentina etc. western politicians are using high costs of energy as an excuse for inflation to hide the fact that they’ve eroded their fiat currencies to virtually zero with irresponsible lending and QE. Checks out to me", "score": -1, "replies": []}]}]}]}, {"body": "That is going away...fast.", "score": -2, "replies": [{"body": "It depends on whether people listen to their talk it into the ground stuff. Who are they to dictate whether the economy goes up or down and why would anyone ignore their own company needs to bow to these \"oligarchs\"?", "score": 4, "replies": []}]}, {"body": "I love how their suggestions of what to do are the things that cause a recession.", "score": 1, "replies": []}]}, {"body": "None of this people are wizards and can’t predict tomorrow let alone 6 month from now. \n\nMe.", "score": 6, "replies": []}, {"body": "People have been sounding the alarm for a recession all year long.", "score": 5, "replies": []}, {"body": "Scare tactics. It’s bs", "score": 11, "replies": []}, {"body": "The question is what are the end of the year sell offs going to look like or are they going to ride out another year because they didn’t make enough this year to sell for tax loss harvesting. It’ll be interesting to see come December.", "score": 4, "replies": []}, {"body": "…they helped start a fire then pull the alarm and blame Biden 😂.\nWhat was it? 54% of inflation is from inflated corporate profits?", "score": 12, "replies": []}, {"body": "As if they give one shit about anyone or anything.", "score": 3, "replies": []}, {"body": "Well I don't need a Tesla and I don't feel the need to fill  my house with cheap Chinese made goods. And I think the stock markets rigged.", "score": 3, "replies": []}, {"body": "Ken is a terrorist", "score": 3, "replies": []}, {"body": "Yes. Because recessions are often self fulfilling prophecies. If influential people like this say a recession is coming, and act like one is coming, then others follow and boom - recession.", "score": 7, "replies": [{"body": "Or, you know, the business/economic cycle.", "score": 6, "replies": [{"body": "Maybe it's just the \"pump & dump\" attitude hitting the biggest players. What if they've sold down and want others to follow, so they can pick up the scraps and make easy money? What if it's just another con job like so many others we've seen in recent years?", "score": 4, "replies": []}]}, {"body": "No they are not.  The fed has been slamming on the brakes HARD for many months now. The influential people are just looking at the economic stats and reflecting what they see.", "score": 1, "replies": []}, {"body": "Most logical redditor here.", "score": 1, "replies": []}]}, {"body": "I have been on a recession budget since last March.  I also knew I would need a new car (to me) and had a reasonable budget, had money set aside for the car since I wanted to remain debt free.  That said, I cut my discretionary spending down so I could save another $10k which I have done.  I plan to stay on the current budget through next year, then reassess.  Part of the budget cut was I chose not to travel this year.  I also deferred any home maintenance another year as the issues that need fixing are minor, not major.  I could live here another year like this if no more blinds break.  Anything functional gets fixed right away.  Cosmetic fixes are waiting for discounts.", "score": 2, "replies": [{"body": "Based", "score": 1, "replies": []}]}, {"body": "I think if oil prices continue to tumble, inflation can be corrected with more moderate rate action. Which would probably avoid recession", "score": 2, "replies": [{"body": "Lower oil prices are a sign that the market EXPECTS a recession and the resulting lower demand.", "score": 4, "replies": [{"body": "Yep, that’s the sentiment, but it’s a matter of speculation and timing.  Without the oil pricing issues in 2007-08, recession probably wouldn’t have happened. https://www.brookings.edu/wp-content/uploads/2016/07/2009a_bpea_hamilton-1.pdf\n\nNow transport costs have fallen and oil prices are coming down.  So I am not buying recession yet. But if the fed keeps driving rates higher it’s going To be unavoidable.", "score": 1, "replies": [{"body": "Peak earnings for this business cycle, and the resulting ATHs for stocks, have already occurred. Money has a price now, and the effects of lower earnings have not yet been priced into markets. In fact consensus SPX earnings for 2023 are for UP 5% at an 18x multiple. That's what is priced in, so if you believe that you should be buying.", "score": 1, "replies": []}]}]}]}, {"body": "Isn’t a recession pretty much guaranteed at this point? All the companies I own/track are guiding down for the next 6 months and many are freezing hiring and even laying people off. Home buying has fallen off a cliff. Average savings of people has dropped into negative numbers.", "score": 2, "replies": [{"body": "I sold all my tech stocks last Friday that I bought a few weeks ago during that big dip. I hope I don't regret it.", "score": 1, "replies": [{"body": "Tbh I’m holding and dollar cost averaging more over the next 6 months. It might be a bumpy ride, but I do think tech will come roaring back as soon as inflation seems like it’s under control. The stock market for sure will come roaring back well before we are pulling out of the recession as it always does.", "score": 1, "replies": [{"body": "Do you think tech will find new lows until that happens?", "score": 1, "replies": [{"body": "50/50 tbh. Personally, I think the bottom is already in considering the massive stock market rally we had the past few weeks due to lower inflation numbers even in the face of crappy earnings and forward guidance from every major tech company.", "score": 2, "replies": []}]}]}]}]}, {"body": "Serious question. Why would you take anything musk said seriously?", "score": 1, "replies": []}, {"body": "Labor market is still strong. Prediction of employment cuts outside of tech will start to occur after the holidays, say mid Q1‘23, which will start the dominos.", "score": 1, "replies": []}, {"body": "welp. time for 365 leaps on sqqq", "score": 1, "replies": []}, {"body": "We have been in a recession for over 5 months now\n\n[Inverse Cramer](https://mobile.twitter.com/jimcramer/status/1532816862182092800)", "score": 1, "replies": []}, {"body": "What is bsd? Os?", "score": 1, "replies": [{"body": "Big swinging dick", "score": 1, "replies": []}]}, {"body": "I agree if it tanks overvalued Tesla.\n\nPuts print", "score": 1, "replies": []}, {"body": "OP got put positions that he needs to cover", "score": 1, "replies": []}, {"body": "Worth noting that the economy is ‘correcting’, rather than a strictly ‘receding’.", "score": 1, "replies": []}, {"body": "But I'm doing me recycling.", "score": 1, "replies": []}, {"body": "Noooo", "score": 1, "replies": []}, {"body": "Check this out https://youtu.be/t1QD0UMYy2U", "score": 1, "replies": []}, {"body": "What does elon know about economics? zilch nada.. he is good at manipulation tho", "score": 1, "replies": []}, {"body": "People calling a possible recession bullish shall remember that this is a self fulfilling prophecy, people expecting a recession will prepare for it, and doing so they will cause it.", "score": 1, "replies": []}, {"body": "Billionaires ride on our backs.  They'll be ok.", "score": 1, "replies": []}, {"body": "Elon musk is not a smart man, society in general needs to realize ceos are not actually any sort of Superman genius in general. Bezo doesn’t know things.", "score": 1, "replies": []}, {"body": "i’m more afraid of change in interest cost that the country has built on.", "score": 1, "replies": []}, {"body": "Fuck those guys.", "score": 1, "replies": []}, {"body": "Fuck Musk. That’s all.", "score": 1, "replies": []}, {"body": "Look at the criminals", "score": 1, "replies": []}, {"body": "This has been the longest build up to a recession that still has not happened yet in my life. My business life started in 1990. Tech companies are in a recession already. Two qtrs of negative growth = recession. Big deal, if it happens, it happens....most individual stocks have already declined 30 to 90 percent from their 2021 peaks. If you are nervous just dont buy equities, buy treasury bonds that pay 4 to 5% and sleep like a baby not worrying about equity declines.", "score": 1, "replies": []}]}
