{"title": "Was selling options on RILY dumb?", "selftext": "[deleted]", "id": "1eqorh4", "created_utc": 1723495355.0, "score": 1, "upvote_ratio": 0.55, "num_comments": 28, "comments": [{"body": "Everyone is going to tell you: \"don't sell options on a stock you're not willing to own\".  You were willing to own a stock with that had a massive run-up in 2021 and has been tanking since the start of 2022? \n\n\"how could a financial company lose money...\"\n\nYou definitely should have done the research because this company has been losing a lot of money for the past 2 years. \n\nSome lessons hurt. I pissed away $120k in 2021. You take your loss and you move on. Looking at this company, would I have predicted today's drop? Absolutely not. I wouldn't have traded it but I wouldn't have expected that. Some times the market throws a curve ball. Sorry it dropped like that on you.", "score": 9, "replies": [{"body": "Awesome thanks for the honest input.", "score": 3, "replies": [{"body": "Looking like you made the right call yesterday by selling what you had.", "score": 2, "replies": []}]}]}, {"body": "never sell puts on stocks you don't want to own.", "score": 16, "replies": []}, {"body": ">Just sucks it tanks a few days before the dividend.\n\nThere is no dividend. The company OMITTED the dividend. [https://www.prnewswire.com/news-releases/b-riley-financial-releases-preliminary-second-quarter-2024-financial-results-302219669.html](https://www.prnewswire.com/news-releases/b-riley-financial-releases-preliminary-second-quarter-2024-financial-results-302219669.html)", "score": 5, "replies": [{"body": "Ya I meant sucks it tanks before the usually scheduled dividend", "score": 1, "replies": []}]}, {"body": "The smaller the account the harder it is to trade unless you really know what you're doing and are willing to risk the account going to 0~", "score": 5, "replies": [{"body": "Whats classified as small? And what's the benchmark needed to not be classified as small anymore?", "score": 1, "replies": [{"body": "Sub $25K is generally considered small. $25K - $100K is usually considered small to have selling options be a primary performance strategy. $250K+ gives you enough capital to start selling lower risk and decent income. $1M+ is preferable to have spread out risk across the blue chips.", "score": 5, "replies": [{"body": "This makes a lot more sense. Thank you", "score": 3, "replies": [{"body": "Sure thing! Just to clarify, the reason is because the capital requirements mean you have to have a lot of money in order to spread out risk / not be too concentrated. There’s a lot of people who would say “$25K is a lot of money!”, but you can only sell one TSLA contract ATM, and if it blows up, you’re screwed with little ability to roll out (especially if you are on a cash settled account).\n\nBigger accounts mean you can take more positions in more companies and companies that are more mature/stable and more net income (though lesser percentage) on less risk. The nature of a smaller account means you have to take more risk in company selection, delta, and/or concentration risk in order to make appreciable gains", "score": 3, "replies": []}]}]}, {"body": "That's gonna be very subjective, but to me that means: When you can add to a trade 4 times and not drawdown more than 2% of your total net liq.", "score": 1, "replies": []}, {"body": "<4 digits is small >4 digits is large", "score": -2, "replies": [{"body": "Not trying to be difficult, and I understand that big number makes more big number, but people still lose 10s of thousands by trading, so it wouldn't/shouldn't be as easy right? I would think it would be easier once you're in the $1 millions+. As a small 1% gain from $1 million+ would give you a gain that is considered to be a large account. I'm just trying to understand how something like $20k being considered a large account would make trading easier.", "score": 1, "replies": [{"body": "its logarithmic not linear", "score": 1, "replies": []}]}]}]}]}, {"body": "You were not the only one and I did not follow my normal rules of thoroughly checking the company. I got enticed by the option premium and late in the day and it popped up in one of my scanners. Stupid move on my part and should have known better. I took the loss and lesson learned. Back to trading bigger sustainable companies/ETFs.", "score": 2, "replies": [{"body": "Ya the only DD I did was checked the sub here and it seemed so so about 5 months ago. No one hated it so I figured whatever.\n\nJust hard to find stuff with a small account. I have cash but don't really wanna add to it til I really have a good plan/system down and learn more.\n\nHappy so far , I'm down 5% only in like 4 months wheeling and learning tons. It's fun to do.", "score": 2, "replies": []}]}, {"body": "“How can a Financial company lose money “\n \n  RIP 2007-2008\n lehman brothers\n Bear Stearns", "score": 2, "replies": [{"body": "Haha good point", "score": 2, "replies": [{"body": "Remember the saying ?\n  “To big to Fail “ LOL", "score": 1, "replies": []}]}, {"body": "Washington Mutual, Silicon Valley Bank, Worldcom....etc", "score": 2, "replies": [{"body": "Exactly , I was a Washington Mutual customer in 2008 when Chase took over .\n    My wife and I went to go shopping on a Saturday , within 24 hours they had the Chase sign up", "score": 1, "replies": []}]}]}, {"body": "Learned a lesson hopefully.", "score": 2, "replies": [{"body": "Yes, definitely. Gonna ask before I make a decision next time. Just started a few months ago and trying to learn.", "score": 1, "replies": []}]}, {"body": "I recall Lawrence McMillan was recommending aggressive put selling on RILY about a month ago.  I looked at it and ran in the other direction.  Way too sketchy to trade", "score": 1, "replies": []}, {"body": "You dont receive dividends off of stock options. You only receive dividends off of owning the stock.", "score": 1, "replies": [{"body": "I did own the stock. I was selling calls on it.", "score": 1, "replies": [{"body": "Got yu.", "score": 1, "replies": []}]}]}]}
{"title": "How are you guys playing the middle east news?", "selftext": "[removed]", "id": "1eq0h8g", "created_utc": 1723423849.0, "score": 0, "upvote_ratio": 0.28, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 20 | **Previous Best DD** | \n**Account Age** | 3 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Iran:  \"Hold me back Bro!\"\n\nThey've been saying this for over a week, don't mean shit.", "score": 25, "replies": [{"body": "Them boys just sent Russian missiles in\n(By them boys I mean on of the Muslim countries not Iran in particular)", "score": 3, "replies": [{"body": "Source?", "score": 2, "replies": [{"body": "https://x.com/jacksonhinklle/status/1822782139844239655?s=46&t=4dIHS_uVWABDbHlvJlZ3LQ\n\nIt’s twitter so take it with a grain of salt but it Hasn’t been community noted yet with 13k likes", "score": 1, "replies": []}]}, {"body": "How many times have they done that this year?  I guess I'm just numb to it, I don't see how this isn't just new normal over there.", "score": 1, "replies": [{"body": "Not sure tbh", "score": 2, "replies": []}]}]}]}, {"body": "Are you 5 years old because the disc is gonna repeat itself", "score": 14, "replies": []}, {"body": "Probably just a repeat of April", "score": 3, "replies": []}, {"body": "Calls on weapons. NFA.", "score": 3, "replies": []}, {"body": "4. The military industry complex market cap will increase as always", "score": 2, "replies": []}, {"body": "Sell the news", "score": 2, "replies": []}, {"body": "According to ChatGPT, airlines will be greatly affected. I bought some puts on Delta Airlines. Might have been an orangutan 🦧 for doing it but whatever, last Mondays plunge wiped all my losses and gave me huge profits.", "score": 2, "replies": []}, {"body": "I don’t care.", "score": 2, "replies": []}, {"body": "Didn’t they do this earlier this year? Just a bunch of missiles that got Iron Dome’d?", "score": 1, "replies": []}, {"body": "Maybe I’m dumb and belong here but I don’t think the Israel-Iran situation is that dangerous for the US economy,", "score": 1, "replies": []}, {"body": "It's like a chihuahua versus a dragon", "score": 1, "replies": [{"body": "Yeah but dragon is a myth", "score": 1, "replies": [{"body": "So you don't watch house of dragons", "score": 1, "replies": []}]}]}, {"body": "Iran's homies in Russia won't be saving them and they won't do a damn thing. Calls on LMT anyway.", "score": 0, "replies": []}, {"body": "I don't care", "score": -1, "replies": []}]}
{"title": "Team building event at Boeing", "selftext": "[removed]", "id": "1eq6g1r", "created_utc": 1723443345.0, "score": 71, "upvote_ratio": 0.9, "num_comments": 27, "comments": [{"body": "Thanks for your submission!\n\nWe love new and original content here on WSB.\n\nWe have no tolerance for basic templated memes, reposts from the front page, or boomer memes.\n\nYes, this can be a little subjective at times, but we want to show you the best WSB has to offer!\n\nIf you need some guidance, don't hesitate to reach out to modmail and we'll give you some pointers!\n\nA few tips though!\n\n• Don't just submit a chart of the current price. Come on. Google only costs $5 per search. (wait, you guys are searching for free?)\n\n• Reaction gifs are fucking lame. Put that shit in a comment, no one wants to look at your face in real life anyways so why are you making a thread about it.\n\n• Don't repost stuff. All of us are terminally online, how dare you try and make us laugh with an image posted somewhere else. Jokes aside, we don't want to beat a joke to death, so give us some fresh OC and we'll be a lot cheerier.", "score": 1, "replies": []}, {"body": "Hope people understand sarcasm!!", "score": 24, "replies": [{"body": "This is hilarious 😂", "score": 10, "replies": []}, {"body": "I honestly can’t tell if these are real Boeing employees or just joking", "score": 5, "replies": []}]}, {"body": "Lesson here is to do your best and invisible hand will do right for you?", "score": 9, "replies": []}, {"body": "Cameraman couldn’t even keep up. After a while it looks like people just got tired of waiting around and initiated their section.", "score": 8, "replies": []}, {"body": "OMG it just kept getting worse\n\nRube Goldberg would be rolling in his grave", "score": 5, "replies": [{"body": "Its he gonna knock over some domino's?", "score": 1, "replies": []}]}, {"body": "Omg... Their strategy in making that Domino effect thing is far worse than my investment strategy. I would at least win one or two trades... such a disastrous team, really.", "score": 4, "replies": [{"body": "Them pushing it along is equivalent to us depositing more money and pretending the losses never happened ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}, {"body": "lolz, what is this from?", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 492 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Haha this was posted somewhere else too but they’re actually Dutch teachers", "score": 1, "replies": []}, {"body": "It would suck for me if my company had these type of bullsh*t team building events. The laughs sound like a sitcom laugh track and they all look like noobs from The Office", "score": 1, "replies": []}, {"body": "Hitmen are better at taking out the weak link.", "score": 1, "replies": []}, {"body": "they're truly living up to their rep: if it's Boeing, it's not going", "score": 1, "replies": []}, {"body": "They’re all working hard to bring it down.", "score": 1, "replies": []}, {"body": "That’s how automation in software development works!!", "score": 1, "replies": []}, {"body": "No gun in sight. Definitely not at Boeing", "score": 1, "replies": []}, {"body": "I hope they are just clerks at Boeing and not build the planes", "score": 1, "replies": []}, {"body": "Damn, I really do believe all the engineers left cuz holy fuck was that a shit show", "score": 1, "replies": []}, {"body": "Those poor souls ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "hit man was waiting for someone to snitch about the dominos not falling", "score": 1, "replies": []}, {"body": "Nobody committed suicide at the end", "score": 1, "replies": []}]}
{"title": "If only, if only", "selftext": "NVDA 8/30 122/123 debit spreads were trading for around 0.20-0.25 all day. My average cost was 0.27, with 350 open positions. \n\nThen at exactly 1pm PST (market close), pricing inefficiencies sent it skyrocketing over 350% to 0.68\n\nReally wish I would’ve been able to close all my positions before it was too late. I know it’s just going to drop back down tomorrow. \n\nSee comments for unrealized and, frankly, unrealistic gains. ", "id": "1eqtdca", "created_utc": 1723506892.0, "score": 51, "upvote_ratio": 0.82, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 28 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/rmo6i02xmbid1.jpeg?width=1170&format=pjpg&auto=webp&s=c26c5a441b7ea88344c6d4066474c545868a9f7e\n\nAlmost made it out the gutter today.", "score": 25, "replies": [{"body": "may as well hold it until ER?", "score": 2, "replies": [{"body": "Oh yeah for sure; there’s still some upside potential. I just know that when I see -18,000 in the morning it’s going to hurt a little bit even though I know it’s coming.", "score": 5, "replies": [{"body": "YOLO!", "score": 2, "replies": []}, {"body": "Look like your position is gaining today as well. Congratulations :)", "score": 1, "replies": [{"body": "It’s not anywhere close to where it was in the screenshot, but I’m blessed to be a little bit ahead 🙏", "score": 1, "replies": []}]}]}]}, {"body": "Robinhood shows that when contracts close at the end of the day at 4. It will go back to normal tomorrow at open. Still think it can be above $123 by then so you could win this", "score": 1, "replies": []}, {"body": "is Robinhood a good trading app compared to others? also, can someone tell me about Nivida stock I saw on Yahoo Finance it's up 5% but this photo shows he's up 353%? O did he buy to a long time ago when it was lower? but I'm curious what the call means?", "score": -1, "replies": [{"body": "Your a filthy peasant stay away", "score": 3, "replies": []}, {"body": "In case you’re not trolling, the pic is referencing a call option, which is contract that essentially gives the holder the right to purchase the shares at an agreed upon price. The price of an option is influenced by the underlying asset. But numerous other factors influence the price of the option contract. Options are extremely risky though. And people on this sub literally just lose money on options all day.", "score": 1, "replies": []}]}]}, {"body": "if you wanna make things exciting invest into an adr stock (chinese) then you can watch your losses in real time morning and night. (god help me)", "score": 11, "replies": [{"body": "If I make it out of this alive and need some more excitement in my life, that sounds like the move. I miss 2020 when you could just buy any BABA calls and make money all the way from March to October.", "score": 2, "replies": [{"body": "My call stock in the Hong Kong exchange at this very moment is dropping faster than flys on shit. I’m stuck with my call option till late next week. Praying to god it bounces back when earnings come next week Tuesday.", "score": 2, "replies": [{"body": "Might as well invest into a fine gravestone for your resting place", "score": 1, "replies": []}]}]}]}, {"body": "It will retest 110 tomorrow you’re fine. People just dont want to hold overnight with Iran bs and ppi/cpi.\n\nAfter Wednesday I’m going in on calls if the report comes in good.\n\nIf we end the day above 110 it’s an extremely bullish sign that we’ll run up even more by eow.", "score": 4, "replies": [{"body": "lol I’d be shocked if we don’t open at 115", "score": 5, "replies": []}]}, {"body": "\"The bark on the tree was as soft as the skies.\"", "score": 2, "replies": [{"body": "As the bull waits below, hungry and lonely", "score": 1, "replies": []}]}, {"body": "Wait for Friday? Lol. You'll make some bank on that though. Good job. What was strike", "score": 2, "replies": []}]}
