{"title": "$SBUX CEO will travel via jet 3 times per week ", "selftext": "[removed]", "id": "1f185tx", "created_utc": 1724623292.0, "score": 17, "upvote_ratio": 0.84, "num_comments": 24, "comments": [{"body": "Sorry, we're removing this post because it's a duplicate, or extremely similar, to another that was already posted.\n\nWe appreciate the effort but we don't need multiple posts that cover the same topic.", "score": 1, "replies": []}, {"body": "Kinda mental  imo", "score": 13, "replies": [{"body": "Imagine Taylor Swift being CEO and you got this", "score": 1, "replies": []}]}, {"body": "Also sbux: \"sorry bro, can't give you that raise of $1/hour, we are trying to save on costs\"", "score": 5, "replies": []}, {"body": "Total waste of money, there’s no way he can generate that kind of value other than a temporary share price jump because of his name.\n\nHe can either cut costs or increase revenues through volume or innovating. I doubt he’ll innovate and he won’t bother to refresh the cafes and menu in the US.\n\nSo he will push for volume and when that doesn’t work, because of the high prices, he will move to slash costs. \n\nHe will fail miserably, because this company is already in the mature phase and needs fresh ideas, which he cannot bring. \n\nHe will then parachute out with millions in a few years.\n\nUnfortunately I’m a shareholder that will live with this because I don’t sell my stocks.\n\nPay me a million and I’ll do his job even better, and I’ll even move close to HQ to save on the jet.", "score": 3, "replies": []}, {"body": "The definition of having too much money and being wasteful", "score": 6, "replies": [{"body": "All in an effort to continue paying their employees shit with little or no benefits.  Capitalism has become truly awful.", "score": 2, "replies": [{"body": "I mean the pay was shit, but unless the benefits changed within the past 10 years, the health insurance and benefits were pretty nice when I was there.", "score": 1, "replies": []}]}]}, {"body": "Just short it", "score": 2, "replies": [{"body": "It's bad coffee anyways. Really bad.", "score": 0, "replies": []}]}, {"body": "guess Starbusters isn’t chasing ESG scores anymore lol.", "score": 4, "replies": []}, {"body": "We don’t deserve this world", "score": 3, "replies": []}, {"body": "Well that was his offer letter, why hate. If you get a job offer like that and accept it would you like people hating on you. He got recruited for the company so he had the ability to negotiate", "score": -5, "replies": [{"body": "At some point people need to put the betterment of other ahead of themselves.  To be in this position mean this person is some sort of sociopath.", "score": 9, "replies": []}, {"body": "Are you honestly asking “why hate” about up to 6000 miles in unnecessary private jets flights per week?", "score": 8, "replies": [{"body": "Hate Starbucks for making it possible.", "score": 7, "replies": [{"body": "I do 🤷🏻‍♂️", "score": 6, "replies": []}]}, {"body": "Its their money.  They can spend it how they want.", "score": 0, "replies": [{"body": "I didn’t mean to suggest they can’t, I’m saying they shouldn’t. If I use money I earn to start a forest fire or shoot up a crowd is it ok because it’s my money and I can spend it how I want?", "score": 2, "replies": []}]}]}]}, {"body": "For all the people who complain about low wages and point to the C Level salaries...\n\nIf you fired Brian Niccol and distributed his $100M salary and equity stake to all employees, each Starbucks employee would get a one time check for $220.\n\nIn the event you wanted to apply the $220 to your wage (assuming 40 hrs a week), it'd be a 10 cent per hour increase.\n\nAll of this assumes 450,000 Starbucks employees (public info)", "score": -1, "replies": []}, {"body": "Why are ppl hating lmao.", "score": -2, "replies": [{"body": "Think about the current state of global warming and how using jets would make it worse", "score": 3, "replies": []}, {"body": "Because he is not worth that type of perk and this amount of money. And it’s also not good for the planet.", "score": 2, "replies": []}]}]}
{"title": "How many of you \"chase\" a stock?", "selftext": "Been selling options for the past 4 years and still learning. Started with selling CCs on AMC (got lucky when I bought 300 shares AMC really cheap during Dec-2020) and it ended up as a 10x bagger for me over it's life time. I was selling weeklies for 4 months in 2021 (IV was insane and I was getting $500 average premiums per week) until meme stock frenzy died and AMC lost it's juice. Having tasted success accidentally on CCs, stupid me though it's the name of the game and acquired bags of other meme stocks in hopes of earning weekly income. I bought 100 shares of BB, CLOV, WISH, NOK, BBBY, GME, and some more meme stocks that I can find in Reddit (WSB). Well! Party is over very quickly and I am left holding these bags with 90% drop in price. Lesson #1: always bank on stocks that are reliable and have good fundamentals.\n\nI had a quiet time in 2022 when the markets went down. I felt itchy and desperate and sold a CC on my META stock with a 45 DTE close to the stock price. META had an insane run in Jan-2023 and it quickly went out of my grasp. I have been wheeling TSLA since then and it is a very good one for me so far. My cost basis is almost down by $100/share but I am no longer desperate. Because of the wild nature of the stock, I just hang in there without doing anything until it comes up. Just trying not to repeat the mistake I did with META. I did get assigned on TSLA a couple of times, but I basically sold CSPs and wheeled it.\n\nLesson #2: be patient and not to be overly desperate. Also, I sell CCs only 1 0r 2 weeks ahead and let the theta work on my favor. I stopped selling 45 DTE CCs.\n\nApart from selling CCs on the stocks I own, now a days I mostly sell CSPs. I pick puts about 45 DTE with and sell anywhere between 0.30 to 0.50 delta. I close the position once I get 50% return and repeat it. Due to this bull market run, I constantly find myself needing more money to sell a CSP because the underlying stock is growing. I have a bunch of examples over the past year  (AMZN, GOOG, CAVA, ARM). I funded my RH account with 50K and have been selling CSPs. CAVA for example went crazy, my first CSP was for $55 SP and now it is around $120. I just leave stocks like these after a while because I cannot keep pumping money and chase the stock. I realize that I cannot beat the market by selling options but I am in for the long haul and also want to generate passive income. I started withdrawing money that I earned from my premiums to cover taxes and also for extra cash. That weekend dinner with family in a nice restaurant, a small home improvement project etc are now being funded from my Options money and that brings smile to me :) \n\nLonger term though, I am thinking of splitting my account into 2 categories - one for long term investment on ETFs to help boost my retirement savings and another for just weekly Options trading. Because I see benefits in both approaches.\n\nI know I typed the subject of this post to ask a simple question but digressed and wrote a much lengthier one :) Coming to the actual question, what do you guys do when you sell puts and the underlying keeps rising? Do you add capital and chase it or move on to other tickers that are in your price range?", "id": "1f1474f", "created_utc": 1724612989.0, "score": 4, "upvote_ratio": 0.63, "num_comments": 20, "comments": [{"body": "You need to understand that while collecting theta is nice, you need to be aware of management costs (supportive puts, naked calls, short stock...). Selling puts in a bull market is the opposite of good risk management: you are buying both theta and risk, sometimes dramatically increasing management costs. Something, it is better to sell calls, buy a long-termed hedge, or to do nothing. Risk management is more important than potential gains, always.", "score": 9, "replies": [{"body": "if it goes down he gets ducked and has to buy shares. its good risk management. not MAXIMAZATION. but homie aint trying to be berk", "score": 2, "replies": []}, {"body": "Also, 45dte isn't a long-term option.", "score": 2, "replies": [{"body": "Agreed, fairly short compared to a LEAPS option", "score": 2, "replies": [{"body": "sold so many LEAPS lol 😓", "score": 1, "replies": []}]}]}, {"body": "Short puts are bullish strategies.", "score": 1, "replies": []}]}, {"body": "I love splitting up the accounts. I have 2 main brokerage accounts I use, 1 for retirement savings (opened 30 years ago) and 1 for non-registered savings (opened 5 years ago) and added a 3rd last year strictly to sell options. Helps me keep them separate and not to sell calls/puts on stocks that are meant for long term savings.\n\nI love selling puts when the underlying keeps rising, that's why I do it, collect the premium and move on. I have a NVDA put expiring Sep 20th and the stock just keeps rising, I am very happy (also own NVDA in my main portfolio and am very happy it keeps rising)", "score": 4, "replies": [{"body": "right its not maximum profit, but its profit without fear of having to sell shares (some people feel that i guess)", "score": 2, "replies": []}]}, {"body": "I chase degens who think moonshot every other day and overpay in premium. Currently FFIE is a gold mine and LPSN is next on my plays", "score": 2, "replies": [{"body": "100 shares of FFIE right now is so overvalued lol (perfect naked call)  its pump was so sad and seeing the REGARDS COPIUM themselves into those contracts. lol", "score": 1, "replies": [{"body": "Hey now, why you gotta diss my buyers 😂 covered puts are just as easy as covered calls.\n\nIf you can't make money with apes and \"Hedgies\" then you're doing something wrong.\n\nObserve: \"Next stop $13-$14\" the hopium is real", "score": 2, "replies": []}]}, {"body": "are you just selling puts or selling covered calls just in case the hope becomes the reality?", "score": 1, "replies": [{"body": "Personally I'm taking advantage of both with diagonal spreads, also using theta decay to sell the contracts and buy them back for cheaper.\n\nbut if you did want to do a direction you could just do protective puts (you buy shares as well as buy puts to protect your downside) or maybe a strangle", "score": 1, "replies": []}]}]}, {"body": "robinhood needs foldering of the portfolio your last point really reminds me of how hard it is to go through my list when i could have them all broken into differnt folders. i know i can do it for specific stocks but i would need to print a list and manually create stock type folders but i already have so many of those", "score": 1, "replies": []}, {"body": "I’m kind of in that boat right now with Tesla. I sold puts when it was too high, and now I can’t decide if I should hold and hope for $250 again or just cut my losses", "score": 1, "replies": [{"body": "You’re buying in at 250?", "score": 1, "replies": [{"body": "I did by being overly bold with selling puts while it was on a run up. So now my cost basis is something like $240 because I was able to sell some CC on the way down last month", "score": 1, "replies": [{"body": "All good. I got 1000 shares at 260 strike years ago haha", "score": 2, "replies": [{"body": "Oh man, that’s painful", "score": 1, "replies": [{"body": "It was at first but I’m planning on holding that for at least another decade. So no biggie.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Tesla Ramps Up Cybertruck Production: Drone Footage Reveals Rows Of Stainless Steel Behemoths At Giga Texas - Tesla (NASDAQ:TSLA)", "selftext": "", "id": "1f0yjm8", "created_utc": 1724598605.0, "score": 39, "upvote_ratio": 0.73, "num_comments": 33, "comments": [{"body": "Tesla started delivering the Cybertruck in November 2023 and is currently ramping up production with the aim of delivering 250,000 units starting in 2025. Tesla CEO Elon Musk has previously said that production, and not demand, is the biggest hurdle in ramping up Cybertruck deliveries.\n\nAccording to Kelley Blue Book estimates, Tesla sold 8,755 Cybertrucks in the second quarter in the U.S., and 2,803 in the first quarter. \n\nTesla has touched a weekly production rate of 1,300 Cybertrucks, Musk said at Tesla’s annual shareholder meeting in early June. The company is looking to increase it further this year to touch 2,500 units by year-end, he added.\n\nCybertruck production is on track to achieve profitability by the end of the year, Tesla said last month.", "score": 7, "replies": [{"body": "Aren't these things riddled with QA issues, like most Tesla vehicles?\n\nThis thing was supposed to be \"armageddon proof\" and cost $40K but instead is $100K and rusts during rainstorms. \n\nWho would buy this trash?", "score": 17, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Bad bot", "score": 1, "replies": []}]}]}, {"body": "They plan on selling 250,000 100,000 dollar Cybertrucks by 2025. Don’t forget Robotaxi will be unveiled this year and next year Optimus robots will be working the factory floors.", "score": 0, "replies": [{"body": "The robots will be slowly dancing around watering the plants and moving boxes from one pile to another lol", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Idk but they showed up in my area almost instantly after they were available and it rains here 10 out of 12 months non stop practically… it’s now a status symbol and to get people to look at you", "score": -2, "replies": [{"body": "I live in a wealthy part of Floirida and there are a few of them around. They certainly draw a lot of attention and laughs. \n\nAnyone who was dumb enough to buy one certainly gets plenty of attention, Negative attention, that is. \n\nTesla is a total shitshow these days, and the failed cybertruck is just the latest debacle.", "score": 0, "replies": [{"body": "I have already seen customized versions, the all black out one I saw really did look like a a tactical vehicle from a sci fi movie lol", "score": 1, "replies": [{"body": "And...?\n\nDoes that change the fact that they are poorly reviewed, have poor QA and do not cost the $40K that Elon promised?\n\nYou're a simpleton if you think that seeing \"customized versions\" means that Tesla is doing well. \n\nMeanwhile, in 2021 TSLA was worth twice what it is worth today, and the company's financials look abysmal. \n\nYou'd have to be pretty dense not to see the writing on the wall. Even at these prices, TSLA is way overvalued. A more reasonable share price would be closer to $20, not $200. \n\nBut don't try explaining that to Elon fanboys, who know absolutely nothing about finance or stock analysis. lol", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Rightfully so, it’s the most successful", "score": 5, "replies": []}, {"body": "I encourage everyone to check out the reviews of real rural farmers using the cyber truck. You can find them on the Tucker Carlson show page. It’s actually really great to get the broad perspective. (Spoiler: they love it)", "score": -5, "replies": [{"body": "I watched it, it was enjoyable, and the featured farmer was down to earth. I think it gave the truck fair treatment", "score": 7, "replies": [{"body": "Did you see there’s a new part two?", "score": 6, "replies": [{"body": "I watched it. A good watch. I don’t think Tucker Carlson and I are on the same side of the political spectrum, but his favorable impression of the truck lines up with my owner perspective", "score": 6, "replies": [{"body": "Ditto", "score": 5, "replies": []}]}, {"body": "Oh no. I’ll give it a watch, thanks for the heads up", "score": 2, "replies": []}]}]}, {"body": "Tucker Carlson... Broad perspective? Color me skeptical.", "score": 18, "replies": [{"body": "Broad perspective from the group analyzing the utility of the CT", "score": 5, "replies": []}]}, {"body": "Solely in the interest of being objective, but do you guys really believe that a) Tucker Carlson would ever care at all about the Cyber Truck if Musk hadn’t started publicly backing and endorsing Republicans (much less run an entire segment on it)? And b) do you really feel that he would have presented the truck as anything but favorable given his partisanship? I’m not asking that rhetorically. I’m honest just curious to hear what you think. Also, has he ever profiled any other vehicles on his site?", "score": 2, "replies": [{"body": "Great point. I’m not sure of their personal relationship, but I do think Elon has traditionally presented himself as a moderate. He’s def leaned way more right as of late. Regardless, I’m not a fan of him personally but thought the advertising through Tucker to some rural farmers was a cool avenue.", "score": 1, "replies": []}]}, {"body": "‘Farmers’ do not buy $100K pickups.", "score": 1, "replies": [{"body": "Rivians are very popular with the farmers in my area. Yet to see them touch the Cybertruck or the F150. Lots of eyeing the Chevy given it can out distance tow the Cybertruck by a pretty substantial amount and are running 80k on lots right now.", "score": 3, "replies": []}]}]}]}
{"title": "RKLB Deep-dive DD: ", "selftext": "[removed]", "id": "1f0sedv", "created_utc": 1724577740.0, "score": 29, "upvote_ratio": 0.87, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 10 months ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Ty chatgpt", "score": 20, "replies": [{"body": "Istg, not a word was chatgpt", "score": 1, "replies": []}]}, {"body": "Hell yeah space stocks!! 🚀⭐", "score": 6, "replies": []}, {"body": "It is OK. Meemaw guys will enter at 30USD per share, complaining that no one told them about this company and that it did not popped up on reddit. \nOn a side note, this has the makings of pulling a 10 bagger in no time, going parabolic even higher than ASTS. **", "score": 18, "replies": [{"body": "He said $30 at 2030 lol\nHow is that parabolic?\nHe said 25% CAGR.\nHe said 10B TAM for launch.\nThat's rookie numbers.\n\nASTS made 4x in three damn months. \nAnd I'm counting since $10 where it all started.\nASTS has a monster TAM.\nDon't compare these stocks ever again.\n\nEveryone wants to be ASTS these days.\nNoone is.", "score": -9, "replies": [{"body": "It doesn’t even make sense to compare the two. ASTS is not a rocket launching stock. The only reason you are hearing about RKLB so much atm(without taking anything away from the company, I’m sure they also have a strong bull case) is because people somehow believe that they have missed the boat on ASTS (you HAVEN’T, the company is still just getting started) and the next most popular space based early revenue company will hopefully take off the same way.\n\nDisclaimer: I’m in on ASTS, and currently investigating whether it’s worth putting some spare cash on rklb. So far, not convinced.", "score": -1, "replies": [{"body": "Also, it seems that apes here think RKLB has just the rocket launch business, when in fact that is just a small part of their whole operation. That should tell you enough about DD of so many... ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "what's asts tam", "score": 2, "replies": [{"body": "TAM? 2.5 billion people currently don’t have any way to access the internet around the globe. A lot more don’t have over 2g signal. I’ll let you do the math for the stock price at 15 PE and 30% margin(which is a very conservative estimate) if they get even 5% of that user base to pay 10 bucks per month.", "score": 3, "replies": [{"body": "You realize that the vast majority of those 2.5 survive on less than a dollar per day. They ain’t paying 10/month for internet and somehow more for the hardware.", "score": 2, "replies": [{"body": "Yes. And on the other hand, quite a lot of people who do live in places with wide internet access still have jobs that require them to not have it. Such as people on oil refineries.\n\nAs someone who has worked on an IT project that was meant to provide SMS services to rural places in Africa, I’d say you’re massively underestimating the potential for this.", "score": 3, "replies": [{"body": "I am not. I think mobile internet allows Africa to skip 2 industrial revolutions, and it’s very beneficial. But there’s a lot of companies building these, not in the least juggernauts like SpaceX and Amazon Kuiper.\n\nPlaces like South Africa run against legal issues, and we’re not even going to get into Russia jamming signals. \nThe technology is awesome, the legal hurdles are immense, authoritarian regimes aren’t exactly happy with an informed public using an internet they cannot control. \nCapital investment are huge as you can see from ASTS earnings. And then there are the legacy cell tower guys that get all the subsidies and successfully lobby against things like Starlink even in the USA. \n\nMy point is that this is great technology, but profitability is pretty far off with growing competition and legal hurdles.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "$RKLB wants to be $ASTS very badly, except they own the rockets and the satellite components, so $RKLB constellation will have higher terminal gross margins than ASTS unless there’s some fundamental difference in technology, I know they probably have direct to cell patented or something. Or maybe $RKLB goes for an imaging constellation, maybe they don’t need to compete whatsoever", "score": 0, "replies": [{"body": "RKLB does not and will not ever provide a D2D broadband service. Knowing how to build a sat does not in any way mean knowledge in the area of its application.\nThe only thing common between RKLB and ASTS is that RKLB may at some point, once Neutron is ready, launch some ASTS sats. Maybe.", "score": 2, "replies": [{"body": "> knowing how to build a sate does not in any way mean knowledge in the area of its application \n\n> Rocket Lab literally operates customer satellites on orbit as part of their services \n\n> they have $300mm in cash on the balance sheet strictly for acquiring some kind of payload like optics/imaging systems or communications systems, maybe not D2D but neither is Starlink who’s gonna make 6bn in top line this year and estimated to be FCF positive \n\nYeah sure, But Rocket Lab won’t need to pay 60mm to launch their satellites and they can make them entirely in house at lower cost than anyone else. They will have higher terminal gross margins on a constellation than ASTS", "score": 2, "replies": [{"body": "Operating a sat or being able to build a sat based on a given instruction does in no way mean understanding of the business domain and the technical solution itself.\n\nI know how to operate a car, I don't know how to build it, I don't know car business. Ffs stop being religious. RKLB has absolute zero know-how when it comes to D2D broadband.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Long on RKLB.", "score": 4, "replies": []}, {"body": "Price targets are way off because you’re trying to apply logic in a market that seems to follow none. Other than that, I love Rocket Lab which is why I own 6 figures worth and made a post a month ago.", "score": 2, "replies": []}, {"body": "Saved to read later with more attention, ty dude", "score": 3, "replies": []}, {"body": "like your DD", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "Long rklb.\nI wonder if they’d get bought out by another public company ? Lockheed is a 133B, Northrop 77B ish, and dare I even say BA at 106B. Unlikely, but a lot can happen in 5 yrs.", "score": 1, "replies": []}]}
{"title": "Intel Grandma and NASA Dad, dapping up in heaven", "selftext": "[removed]", "id": "1f0t0k4", "created_utc": 1724580517.0, "score": 156, "upvote_ratio": 0.96, "num_comments": 26, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 11 months ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Imagine if 10 years from now, Intel manages to correct its multiple number of mistakes and once again become the leading semiconductor company, the grandma kid will quit his job at Wendy’s and come back here and mock us for mocking him. I’m not saying it will happen, but there is a non-zero probability that it will.", "score": 42, "replies": [{"body": "Happened with Microsoft. People forget that they were a joke to the market for over a decade before Super Satya brought them back.", "score": 28, "replies": []}, {"body": "I'd even argue a pretty good chance considering that CPU manufacturing is among the technological most advanced industries in the world and while yeah Intel did fuck up good they still have quite a lot hard manufacturing know how up their sleeves. \n\nQuestion is how long it will take though. Hope Intel kid hasn't hanged himself until then", "score": 10, "replies": [{"body": "Intels working on a new advanced technological node called 18A, which would make it the most advanced node in the market. They have 2 chips coming by next year made with that technology. If it gets successful, you can probably see intel climbing back up within 3 years.", "score": 2, "replies": []}, {"body": "They have more competition now than ever before", "score": 1, "replies": [{"body": "And yet still had a profit margin of 7% despite being at their lowest point in the last quarterly financial releases and have very promising chip technologies in development which could shift the field completely again.\n\nBtw, this is thanks to competition, in the end the market itself is still highly profitable and will likely continue to be as the entry costs for new competitors is EXTREMELY high due to the required manufacturing know how.", "score": 2, "replies": [{"body": "https://preview.redd.it/2bc051sxqtkd1.png?width=2436&format=png&auto=webp&s=2acb3ca8fda591c7a09e02351ed822a004d40c9e\n\n7% profit margin? They are not even profitable 🤷🏽‍♂️ they spend most of their money trying to keep up with competition building out their fab facilities which caused them to fall behind and allows others to catch up.", "score": 2, "replies": [{"body": "Well damn be me you are right. my broker showed quarterly incomes and on that it was still positive on the latest financials but I checked directly the financial releases and under US GAAP they indeed are in the reds.\n\nHuh, weird tbh and maybe I just simply misremembered. Yeah you are right, quarterlies do not look great. Also not yet terrible given the relatively solid balance sheet and especially cash reserves but those won't last forever.\n\nThen again, YTD revenues fell only slightly and same is true for COGS. The main cost driver were nearly 1b restructuring costs. But last years Q2 reports had huge tax provision earnings of 2.2b which resulted in a positive income. So given that, it might be that intel didn't look great for over a year already. \n\nWell, I retract my earlier statement now I actually looked into it and not only talked out of my ass :D Pardon me xD", "score": 2, "replies": [{"body": "It’s all good mann, I know we wanna believe in what we invest invest in, I’m a share holder too but I’m looking at the track record of intel and all the costly delays of building out their fabs that might take till 2030 now to be complete and by then they will need to reevaluate because the competition will be on new micro chips.", "score": 1, "replies": []}, {"body": "https://youtu.be/tkI9xXl8ULw?si=cs1zxwczAd_6MPuV\n\nI watched this video and I was convinced.. I’m not even trying to be bearish on the company, like I said I hold 500 shares at 28 a shares so I’m down $3700 right now. But tell me what you think ..", "score": 1, "replies": []}]}]}, {"body": "https://stockanalysis.com/stocks/amd/financials/?p=quarterly\n\nAmd seems to be in a much better position", "score": 1, "replies": []}, {"body": "https://stockanalysis.com/stocks/tsm/financials/\nTsmc has taken over look at at their profit margin vs intel🤣", "score": 1, "replies": []}]}]}]}, {"body": "Tbh I could see it", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "He could have just waited a week and had like 25% more shares lol (I don't remember how much it actually dropped by but I think it was low 20s)", "score": 1, "replies": []}]}]}, {"body": "NASA dad is dead? did i miss something?", "score": 22, "replies": [{"body": "Boeing sent their hitman ", "score": 16, "replies": [{"body": "![img](emote|t5_2th52|4260)", "score": 2, "replies": []}]}]}, {"body": "LMFAO", "score": 9, "replies": []}, {"body": "What's up with the NASA Dad thing? i missed it and now i see it everywhere", "score": 5, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/s/Ks3bM1cya7", "score": 8, "replies": []}]}, {"body": "It's the only way", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Only puts", "score": 2, "replies": []}]}, {"body": "Red shirt, nice!", "score": 1, "replies": []}]}
{"title": "The deeper impact of Black Myth: Wukong on NVIDIA's stock price", "selftext": "[removed]", "id": "1f0voew", "created_utc": 1724590489.0, "score": 0, "upvote_ratio": 0.16, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 days ago\n**Total Comments** | 11 | **Previous Best DD** | \n**Account Age** | 1 week | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "My dude, it is already out, also, is it post made with GPT?", "score": 21, "replies": []}, {"body": "most delusional DD I've seen this week", "score": 15, "replies": []}, {"body": "Datacenter is driver for NVDA stock not gaming anymore", "score": 8, "replies": []}, {"body": "Pffft yeah right", "score": 3, "replies": []}, {"body": "Every gamer knows Nvdia is top dog,  it’s already priced in", "score": 3, "replies": []}, {"body": "Yea, I bet people who played Black Myth: Wukong will feel the need to buy a B100 for better gaming experience", "score": 3, "replies": []}, {"body": "Regardus maximus", "score": 3, "replies": []}, {"body": "Jesus. \n\n\nStand alone video game titles couldn't move this dock a cent anymore.\n\nHalf the people invested in nvdia have no idea what a gpu is.\n\nAnd the other half understand that nvidia makes their money elsewhere now. Gaming gpus are just a side effect of their gpu power now.\n\nAlso the game has been out a few days now, people love it, and I imagine there are like 50 people on earth who are going to spend 2k to get a better gpu for wukong. Anyone (like me) bought our 40 series cards within the first year like actual tryhards.", "score": 3, "replies": [{"body": "I'm a tryhard but I just got my 40 earlier this month. Rocked a 1070ti for about 7 years, shit still works too. Best part is I still have a 300 series mb so my CPU won't zap itself to death", "score": 3, "replies": [{"body": "Truth be told I got a 4090 about a month after it came out and have played NOTHING that I wasn't already running decently on my 3070.\n\nNot exactly a great spend, but I had money and wanted to get the best possible shit for the first time in NY 20 year gaming career.", "score": 1, "replies": []}]}]}, {"body": "“Here‘s why”… Im almost certain this is written by GPT", "score": 3, "replies": [{"body": "Yes, you can tell by the way that it is", "score": 1, "replies": []}]}, {"body": "So tired of these low effort chatgpt generated posts", "score": 3, "replies": []}, {"body": "![gif](emote|free_emotes_pack|poop)Sorry, but this absolutely doesnt give a shit to NVDA", "score": 2, "replies": []}, {"body": "Except for that, ray tracing and DLSS aren't new and have been around for quite awhile. The 2000/3000 series cards had these features.", "score": 2, "replies": []}, {"body": "China is always a day late and a dollar short.", "score": 2, "replies": []}, {"body": "Holy shit guys! Forget about AI and data centermathinghy...This game is gonna rattle your portfolio like an Intel call OTM!...(Dude....)", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271) my man thinks gamers cant run games without Nvidia! Let me introduce you to half the price AMD GPU with the same performance ![img](emote|t5_2th52|4267)", "score": 2, "replies": []}, {"body": "Wtf is this post? Did you just wake up from a coma?", "score": 2, "replies": []}, {"body": "This is the dumbest shit ever.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "Is game science public? What's their sales like? Can I see their financials?", "score": 2, "replies": []}]}
