{"title": "Which will be the first of FAANG plus Microsoft to be broken up?", "selftext": "Facebook, Amazon, Apple, Netflix, Google and Microsoft are dominating the tech industry and are getting to the point where they are too big to fail, with virtual monopolies in their respective specialities. Which will be the first of FAANG plus Microsoft to be broken up?", "id": "i9t52e", "created_utc": 1597435334.0, "score": 37, "upvote_ratio": 0.81, "num_comments": 64, "comments": [{"body": "[deleted]", "score": 17, "replies": [{"body": "How does Apple meet this criteria?  They have a massive competitor in Android.  IPhone has about 52% of US market share and Android has 48%.  Hardly dominating the sector", "score": 7, "replies": []}, {"body": "Windows is dominant because of office, without office windows would be irrelevant fast.", "score": -12, "replies": [{"body": "As if Apple computers didn't run Microsoft office.", "score": 7, "replies": []}]}]}, {"body": "Amazon, potentially. Cloud / online retail seem logically like they could become two distinct entities.\n\nMicrosoft / Apple won’t be broken up, although future M&A could be restricted heavily in some way.\n\nNot Netflix.\n\nI don’t think Facebook and Google have to worry about being broken up, but they could be hit with new rules in the future in terms of data privacy restrictions. Facebook will probably continue to pay to have its wrist slapped indefinitely, that’s just part of their business model at this point.\n\nApple may also face new restrictions or penalties for it’s behavior regarding developers and the App Store (see the Epic /Fortnite news on this). Those decisions would also have major implications for Google and to some extent Microsoft as well.\n\nDisclosure: Long AAPL, MSFT, AMZN\n\nEdit:  Alphabet’s “Long Bets” side businesses could be spun off or broken off, if they ever reached that level of success. Right now I don’t think they are significant enough for that to be a concern.", "score": 42, "replies": [{"body": "> Amazon, potentially. Cloud / online retail seem logically like they could become two distinct entities.\n\nWhile it's a clean way they could become two distinct entities, it isn't solving anything. It doesn't seem that Amazon is using retail tie into AWS or vice versa. The reason why MSFT got hit by anti trust around 2000 because it was proven that they used OS dominance to gain web browser dominance.\n\nFor AMZN, specifically, the more obvious anti-trust abuse is using retail sales data to come up with their own generics. A remedy would be then to force AMZN to divest their Amazon Basics brand and not allow them to have new generic brands in the future. Maybe there are other abuses, but this comes to my mind for AMZN.", "score": 21, "replies": [{"body": "Amazon offsets loses from retail operation and prime video from aws.  Amazon has openly violated antitrust law and nothing happened.  Look up what amazon did to diapers.com.  If the monopoly laws where being enforced Facebook wouldn’t have been aloud to buy Instagram and WhatsApp.  None of them should be aloud to make any more acquisitions right now because they are too big.  When is the last time google released a successful internal product? \n\nThe only large tech company right now that seems to be able to release new successful business lines is Microsoft which is quite ironic.  I guess Microsoft is more like Apple during the 2000s then the apple of today.", "score": 6, "replies": [{"body": "> Amazon offsets loses from retail operation and prime video from aws.\n\nNot factual", "score": 2, "replies": [{"body": "What do you mean? https://www.fool.com/investing/2019/02/19/how-amazon-actually-makes-money.aspx", "score": 1, "replies": [{"body": "The article claims AWS is more profitable, thats correct. Article does not claim retail prices are offset by AWS. These are two different things. AWS is more profitable than retail. But keep in mind retail revenue is way more. Have you looked at their 10K. Also keep in mind MFs those articles are clickbait and marketing purpose and not to educate or do analysis of a company.", "score": 1, "replies": [{"body": ">\tBut retail operations aren't a big moneymaker for Amazon. In fact, in some cases they cost the company cash.\n\nRetail has higher revenue, yes. But that doesn't mean that it's not being offset. \n\nAgree on the MF articles. You defn have to pick and choose depending on the article.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think that some of these companies may break themselves up if they are prevented from growing through acquisitions as they have done in the past. We’re already seeing this with Big Pharma. Pfizer, Merck etc are spinning off pieces of their companies left and right. In some cases this has unlocked tremendous growth potential as with Zoetis, or PayPal, in a tech example.", "score": 5, "replies": []}]}, {"body": "None. Fractional amazon shares are the reserve currency of the future.", "score": 11, "replies": []}, {"body": "None of Microsoft, Netflix or Apple. \n\nMaybe Facebook or Amazon", "score": 16, "replies": [{"body": "Facebook won't really be broken up, they'll just be subject to lots more regulations.\n\nAmazon seems like the safe bet.", "score": 6, "replies": [{"body": "They want regulations.", "score": 1, "replies": []}]}]}, {"body": "If any of them are, it's going to be Amazon. They can definitely split there consumer side (Amazon, Prime, Music, Audible, Alexa, Amazon Basics) from their cloud services.", "score": 14, "replies": [{"body": "Doesn't make much sense as the cloud services side doesn't make their consumer side a monopoly. It will most like be their Amazon site. Some regulations or fines will be used to stop them from using third-party data as advantage for their own products the put up.", "score": 12, "replies": [{"body": "I mean it let's them run razor thin margins (or negative margins) on the other side of their business. \n\nI work in the IoT space. Quite frustrating to see google lose money hand over fist year after year on their Nest suite of products. (Seriously in 2018 they lost over half a billion). If the company I worked for lost half a billion in a year we'd have been bankrupt 10 times over. They can literally just buy market share.", "score": 3, "replies": []}, {"body": "Good point, I Definitely agree that they'll put in regulations to stop amazon from collecting data", "score": 2, "replies": []}]}]}, {"body": "I think, it is none. App store and Google Play store may need to decrease the their cut percentage from apps; 30% is too much. I feel like it maybe reduced to between 10-20%.", "score": 9, "replies": [{"body": "> App store and Google Play store may need to decrease the their cut percentage from apps; 30% is too much.\n\nI agreed with you when I first heard about this issue, but what about game console makers? They take huge cuts of sales on their platforms. And there are only 3 console makers. Should they be prevented from doing the same thing? If so, they'll have to rework their business model away from the \"subsidize devices, make it back from game sales\".\n\nWhy can't Apple / Google be allowed to profit from their device/os using app sales? Neither of them are a monopoly either (especially Apple). As far as my basic google law non-degree says, duopolies are fine as long as there is no collusion/price-fixing between the companies, and there doesn't seem to be.", "score": 4, "replies": [{"body": "I think apple will have to do something/change the app store eventually. They don't allow apps to be downloaded from anywhere other than their app store.", "score": 1, "replies": [{"body": "You can't sideload apps on the xbox / ps4 / switch, either.\n\nWhy does Apple *have* to. Yeah, I wan't them to be able to, and so do a lot of people, but what justifies having the government force them to do it?", "score": 4, "replies": [{"body": "You used to be able to build games for Xbox. I forget the specifics of how to load them and I have no idea if they discontinued it after the 360.", "score": 1, "replies": [{"body": "You can build games for ios / android play as well.", "score": 1, "replies": [{"body": "Yeah, I've made apps for android. I hate the $100/year developer fee for the apple store so I never made anything for it.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "None", "score": 3, "replies": []}, {"body": "The one that lobbies the least", "score": 3, "replies": []}, {"body": "Nothing will get broken up. The government's hand will be soft and companies won't miscalculate that ire.", "score": 3, "replies": []}, {"body": "I don't think that any of them will be broken up.\n\nThe people with the power to break them up can have their votes bought. And nobody has more money to buy them off than the FAANG+M companies.", "score": 3, "replies": []}, {"body": "Between the companies you named, only Google and Microsoft can really be argued to be monopolies. Between the two of those, Google is definitely stepping on more toes lately. If any of them were going to be broken up in the next few years, I would guess Google. Of the others, Facebook might draw similar negative attention to itself from lawmakers as well, but I think that's more likely to be met with regulation.", "score": 6, "replies": [{"body": "What does Google have a monopoly on?", "score": 3, "replies": [{"body": "86% market share in search. Everything else they're involved in is at best a duopoly, as far as I can tell, but that's not far off from Windows' desktop domination.", "score": 2, "replies": [{"body": "And still there are companies with even larger market shares who are not considered monopolies, even tho they pretty much are. \n\nLooking at you, monsanto, with 90% of the soy bean market share.", "score": 2, "replies": []}, {"body": "And they are linked to their ads in a way that uses an anticompetitive algorithm. That seems to be the most clear-cut antitrust example I've seen lately.", "score": 1, "replies": []}]}]}]}, {"body": "Apples and Google's app store for sure", "score": 1, "replies": [{"body": "Not really. If anything that example is of two competing platforms with similar market share (in the US).", "score": 0, "replies": [{"body": "It’s called a duopoly and it’s still can be illegal if they abuse there market share.", "score": 1, "replies": [{"body": "Sure, if they collude on price fixing or other antitrust practices. I haven't seen any examples of that so far.", "score": 2, "replies": [{"body": "Google's and Apple both have a 30% commission.  There is also the whole silicon valley anti-poaching scheme they got in trouble for.  [https://money.cnn.com/2014/08/11/technology/silicon-valley-poaching-case/index.html](https://money.cnn.com/2014/08/11/technology/silicon-valley-poaching-case/index.html)", "score": 1, "replies": [{"body": "The anti-poaching is terrible. I'm glad they got caught. I'm sure many others don't.", "score": 1, "replies": []}]}]}]}, {"body": "They aren't competing for the same users. Android users can't use the app store while iPhone users can't use Google Play Store. Biggest Monopoly and now many companies are complaining about their Monopoly hold on sales cut.", "score": 1, "replies": [{"body": "But you have a choice between the platforms, not to mention that you can sideload apps. I believe there are even some third party sites that act as stores.", "score": 1, "replies": [{"body": "Only for Android. iPhone users are locked to app store I believe", "score": 1, "replies": [{"body": "Another reason for me to not buy an iPhone.", "score": 1, "replies": [{"body": "Yup", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Facebook but only because everyone hates them and breaking them up will score easy points with voters.", "score": 1, "replies": []}, {"body": "Amazon and Google, especially Google", "score": 1, "replies": []}, {"body": "Either all of them have will get broken up or none of them.  Has to be a policy shift from neoliberalism to something else.  Will not happen while Biden or trump are president.  Likely 2022 or 2024 will be the start of a massive policy shift just like the 1970s and 1930s.", "score": 1, "replies": []}, {"body": "Google", "score": 1, "replies": []}, {"body": "I think if any of these companies are broken up, itll be the end for them.\n\nBig tech is not like big oil.\n\nOil is a single commodity and the companies Standard was broken up into still held the dna of their larger parent.\n\nBig tech, such as amazon has various synergies at play that make them who they are today.\n\nYou break amazon into whole foods, cloudfront, amazon online etc, you have weaker businesses that are more exposed to market forces (ironic).\n\nI will say that as a stand alone company, cloudfront wont be able to compete in the cdn/edge space.", "score": 1, "replies": []}, {"body": "IMO, the only 2 that are at risk of not being around in 10 years is Facebook and Netflix.  \nFB could turn into the next MySpace if something else comes along.  \nNetflix is getting competition from every angle, YouTube, amazon, Hulu, Dis+,and all of the other content creators are creating their own streams.   Msft is getting into the \"netflix of video games\" market, its only a matter of time before they're in the \"netflix of netflix\" game.", "score": 1, "replies": []}, {"body": "Legend has it, that in days of old, there was a force for good known as the FTC.  No more. \n\nBanks too big to fail? JPMorgan has a leverage enterprise value of $2.8TRILLION with a T.  Morgan Stanley buyse eTrade.  Where is Elizabeth Warren?\n\nWorse in Industry. Exxon buys Mobil. Dell buys HP. ATT is put back together.  Sprint buys Tmobile.  Fiat buys Chrysler . . . . \n\nThe only conceivable way any of them get broken up is if EU somehow forces it and US govt goes along.  Or (and this is more likely), the boys at GOOG realize that spinning off Youtube and Android into seperate businesses at least doubles the market value of the separate companies - like happened with ATT was created and all the baby bells were spun off.  I don't see that happening with any of the others.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "While I agree with that some of the ones listed shouldn't be broken up, I disagree with you saying gov shouldn't meddle in things. If that were the case, standard oil would own the USA.", "score": 1, "replies": [{"body": "People need oil, they don't need facebook or apple. They offer laurels to society, but poor people won't die without it.", "score": -2, "replies": [{"body": "For sure they will riot without it", "score": 1, "replies": []}]}]}]}, {"body": "The weakest one. If any of them met resistance for 30 days or longer and fall. That is the stock. FAANNG", "score": -2, "replies": []}, {"body": "If a company can be considered a monopoly for 80-90% market share, then what about people with 99% of the wealth? Why are they not monopolies too?", "score": -1, "replies": [{"body": "I’m not sure you understand what ”monopoly” means", "score": 0, "replies": [{"body": "Thats why I'm asking.\n\nI'm not sure you know what a question is.", "score": -1, "replies": []}]}]}, {"body": "None! Won't give China everything they wanted in a silver platter.", "score": -5, "replies": []}]}
