{"title": "TQQQ is at it's highest it's ever been. Would it be stupid to sell my Apple stocks to buy TQQQ?", "selftext": "If I am holding a few Apple stocks with the idea that it will go up, wouldn't be better to hold TQQQ as it's 3x leveraged on tech stocks and apple's increase with thereby increase TQQQ?\n\nI would appreciate any advice. Thank you!", "id": "iddewq", "created_utc": 1597940490.0, "score": 26, "upvote_ratio": 0.84, "num_comments": 60, "comments": [{"body": "I put 20 grand into QQQ last week..doing decent right now. Wish I did TQQQ instead", "score": 10, "replies": []}, {"body": "All i ever see is people bashing on TQQQ but I don’t know why. I had a few before the big drop and sold on the drop. Then been buying since $35 and adding every chance I got. It’s all I buy now and have major gains. I really don’t see what is so bad about it. If the economy takes another dive I’ll just sell.", "score": 27, "replies": [{"body": "It went from $118 to $35 in one month (feb-march). \n\na 70% loss is more than most people can handle. If you're smart about it, great boost to profits, but if you have 7 figures in the market, losing 70% isn't really an option.", "score": 12, "replies": [{"body": "Why does that matter if it goes back up just as quickly?", "score": 2, "replies": [{"body": "Ok quick test: \n\nYou have $100,000. You lose 70% in TQQQ (which happened between Feb and March 2020). You now have $30,000. \n\nLets say you gain back 70%. Pretty good! Now you have $51,000. ($30,000 + 70% =$51,000)\n\nBUT YOU'VE STILL LOST almost 50%!!!\n\nYou would have to gain about 335% JUST GO GET BACK TO EVEN. \n\nTHAT's why it matters.", "score": 14, "replies": [{"body": "Why use a hypothetical? It was $108 in February, fell to $32, and is $138 today.", "score": 24, "replies": [{"body": "in the 2000 dot com bust, qqq lost 80% of its value. tqqq would lose 99.9%.", "score": 2, "replies": []}, {"body": "How many investors hold an investment that has gone from $108 to $32? I will tell you: Almost zero. And even if you did hold, you got a whopping 27% gain when it went from $108 to $138. Not great for that much risk. \n\nNow, one can gamble and hope that this 3x leveraged fund will go up dramatically. Just as you can play with options and get excellent leverage, though when you lose the decimation of capital is total. \n\nIf you're just having some fun, then great. If this is a long term investment strategy, then good luck, as you'll need it.", "score": 2, "replies": [{"body": "I dont know about you but I have rolling decreasing stop losses at 7-10-13-15% to stop total loss. Since something like the C19 selloff is unlikely to repeat, TQ3 remains a solid investment for long term.", "score": 1, "replies": []}, {"body": "It's not a stock, you don't sell an index fund when it drops substantially, obviously it will go back up.", "score": 1, "replies": [{"body": "TQQQ specifically is considered a short term investment instrument. This is widely known. However, if you want to invest in it long term, and don't care about decay, then be my guest, no one is stopping you.", "score": 3, "replies": [{"body": "it's what's widely said about it but the rationales for why it is just don't make any sense.", "score": 1, "replies": [{"body": "It’s often said that the wrong or someone is about a subject the more confident they are in that. You’re a young guy, and like most young guys you have to learn the hard way. The conventional wisdom is true for a reason. But hey, you do you. If you want to pour your money end of this, be my guest. No one is stopping you. But at the end of the day it’s pretty foolish", "score": 1, "replies": []}]}]}]}]}, {"body": "even if you use the hypothethical its true what he said. this is really risky. its not a stock, and i beleive you should read about it from their offering, so maybe you get an ideaof how it works. also...if finance law isn't your background, your mind would skip over conceptualizing what they they are trying to say, in how it works. Maybe if you know a friend who is a lawyer that can explain it to you, you will understand it. They were forced by the sec to reword their prospectus.", "score": 1, "replies": []}]}, {"body": "Don't sell and just hold for it to recover", "score": 1, "replies": []}, {"body": "but that goes for anything including regular funds and individual stocks.  leverage has nothing to do with it.   if apple goes up 10% and then down 10% you're down 1% over all.  \n\nand \n\n> You would have to gain about 335% JUST GO GET BACK TO EVEN. \n\nyou're right it didn't gain 335% so it didn't break even.  it's gained 442% so even just hloding is was a baller move!", "score": 1, "replies": []}]}, {"body": "Its very easy to think this until you actually have a 7 figure portfolio. Then most tend to play more conservative.", "score": 0, "replies": []}]}]}, {"body": "That makes sense, thanks. I have a gut feeling that with TSLA and APPLE stocks increasing, TQQQ will definitely continue to rise. \n\n>\nIf the economy takes another dive I’ll just sell.\n\nFair enough", "score": 2, "replies": []}, {"body": "sec forced them to reword their prospectus.", "score": 1, "replies": []}]}, {"body": "Leveraged ETFs weren't designed for long term holding. You should keep your Apple stock, especially with the split incoming.", "score": 17, "replies": [{"body": "People say this but I haven't seen any evidence why you wouldn't hold it long term\n\nTime | QQQ | TQQQ\n-|-|-\nSince 3/23|63%|282%\nYTD|28%|49%\n1-year|48%|125%\n5-year|171%|788%", "score": 18, "replies": [{"body": "The evidence would technically be the performance in early 2020.  Leveraged products take massive losses during drawdown periods and \"typically\" take a long time to recover.  I say typically because it's only the case when the FED doesn't shove trillions of dollars into the stock market to pretend a global recession doesn't decrease the value of US stocks.", "score": 1, "replies": []}]}, {"body": "Leveraged ETF's don't perform well in up and down markets, but there is absolutely no contest in a bull market.  Everyone wishes they were holding TQQQ since 5-10 years ago.", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Leveraged just mean's there's a product (QQQ) and there's a leveraged product (TQQQ).\n\nThis means, in a given day, if QQQ is up 1%, TQQQ will be up 3%.  TQQQ is 3x leverage on QQQ.\n\n\nJust the nature of math means, leveraged products will not perform well in flat markets/up and down markets.  In bull markets, leveraged products perform incredibly well.", "score": 1, "replies": []}, {"body": "No.", "score": 0, "replies": []}]}]}, {"body": "Thank you!", "score": 1, "replies": []}, {"body": "what split are you talking about?", "score": -1, "replies": [{"body": "https://tickertape.tdameritrade.com/trading/stock-split-options-apple-18237", "score": 1, "replies": []}]}]}, {"body": "The argument against it is that if we enter another bear market, you get triple fucked. You also practically forfeit your dividend if holding just $TQQQ stock.\n\nAside from that there’s really nothing wrong with the strategy. I would still hold $AAPL as well if I were you.", "score": 3, "replies": [{"body": "Ah ok, thank you!", "score": 1, "replies": []}]}, {"body": "I’ve been riding this bitch for 2 months now, up 10% but took a big hit early on. Takin err to the mooooon🚀", "score": 3, "replies": []}, {"body": "Wait for at least 10-15 percent correction before getting into $TQQQ. NASDAQ is overbought, but Apple is overbought even more.", "score": 3, "replies": []}, {"body": "I bought 3 shares on the 7th and I'm up 5%. When I see the leverage decay I'll sell I guess. Know the risk involved and only invest what you're willing to see get kicked around.", "score": 2, "replies": []}, {"body": "It would be incredibly stupid. TQQQ isn't like regular QQQ where it should bounce back from a bear market after enough time goes by. If the bear market is deep enough, your investment will never recover, even years after QQQ makes new all-time highs.", "score": 2, "replies": []}, {"body": "Very stupid.  A guy on here months ago lost $23k to it, we were here and witnessed him buying it, and saw it crash immediately next day.  Stay safe than sorry", "score": 3, "replies": [{"body": "To be fair, he only “lost” money because he sold. TQQQ is at an all time high right now, so had he held, he’d be up right now rather than out $23k.", "score": 11, "replies": []}, {"body": "Oh dayum, that sucks. Fair enough, thank you!", "score": 2, "replies": [{"body": "Or was it SQQQ? I think he may have lost to SQQQ.  Also be careful the markets are being manipulated and inflated artificially.  Nothing makes sense anymore.", "score": 3, "replies": [{"body": "It was most likely SQQQ", "score": 7, "replies": [{"body": "Bears get slaughtered", "score": 4, "replies": []}]}, {"body": "It's very easy to lose money on $SQQQ in the bull market. Lol", "score": 3, "replies": []}]}]}]}, {"body": "We can’t lose idiots", "score": 1, "replies": []}, {"body": "If you think cloud/tech still have momentum left then sure. Just be warned that it will turn ugly if there is a rotation out of tech", "score": 1, "replies": [{"body": "Techs here to stay.", "score": 1, "replies": []}]}, {"body": "I had it and then, i started using reddit and got scared and sold it....", "score": 1, "replies": []}, {"body": "you could buy it now but the risk reward is terrible right now. you should buy tqqq when the market crashes, not at the peak.", "score": 1, "replies": []}, {"body": "I’m making bank on tqqq. Goes down more than the index but up more as well. Treat it like a basic index fund and average down for rthe long term.", "score": 1, "replies": []}, {"body": "I wouldn't dabble in TQQQ for more than a couple of days. Remember 3x up but also 3x down...", "score": -1, "replies": [{"body": "But does QQQ ever go down? That’s the question", "score": 12, "replies": [{"body": "TQQQ declined 70% in one month back in Feb-March. \n\nSo, if you're ok with your $100,000 becoming $30,000 pretty much overnight, then yes, pile into TQQQ by all means.", "score": 6, "replies": []}, {"body": "It's slightly less risky in that you don't have to put as much into it.\n\nEssentially instead of putting $1200 in you can put $400 in and get similar returns unless we see another March like drop and use the $800 for something else.\n\nComparisons: \n\nTime | QQQ | TQQQ\n-|-|-\nSince 3/23|63%|282%\nYTD|28%|49%\n1-year|48%|125%\n5-year|171%|788%", "score": 4, "replies": [{"body": "Also, from Feb to March, QQQ was down 28%, while TQQQ was down 70%. So...massive swings.", "score": 2, "replies": [{"body": "If you held on you'd be thriving, only if you had \"short holds\" would you have been screwed.", "score": 3, "replies": []}, {"body": "Say it one more time", "score": 1, "replies": [{"body": "Also, from Feb to March, QQQ was down 28%, while TQQQ was down 70%. So...massive swings.", "score": 1, "replies": [{"body": "All of the evidence I see suggests that holding TQQQ for significant periods of time nets more successive gains in line with the (loooooong term) market uptrends.\n\nIf over the course of the next 10 years, the market continues to add more value since we have entered the era of the unaffiliated individual investor. Why would TQQQ be a bad idea for holding for 5-10 years?\n\nYou say $100k can become $30k fairly quick, but the numbers also say the exact opposite can happen, and TQQQ has gone up by a factor well over 100x since its inception in 2010.", "score": 1, "replies": []}]}]}]}]}, {"body": "If you’ve only been following the markets for 4-5 months then nope it never goes down. No further research needed.", "score": 4, "replies": []}]}, {"body": "> Remember 3x up but also 3x down... \n\nWorse. Leveraged products are designed to copy the % of change. If the underlying falls 50%, you need to gain 100% to be back at where you started. That is why  [this](https://www.boerse-stuttgart.de/de-de/produkte/etps/etcs/stuttgart/a2bdeb-etfs-2-x-daily-long-wti-crude-oil) (Scale chart to 6m+) often happens to leveraged products over time.", "score": 4, "replies": []}, {"body": "Fair enough, thank you!", "score": 1, "replies": []}]}]}
{"title": "Everyone just keeps talking about Tesla and doesn't explore similar opportunities (Volkswagen)", "selftext": "I have done some research and im holding onto Volkswagen Group.\n\nI have a few points and i'm curious how many of you are invested in it or have done any research.\n\nBy 2023 Volkswagen says it will invest over $30 billion in mass producing electric vehicles. They have released the ID.3 (a compact hatchback that is the similar size of the legendary Golf but more practical, hence there is no internal combustion engine). There was a leak yesterday that another model of the ID family will be produced from september until 2023, the ID.4. That's an SUV. Deliveries of the ID.3 are starting september, there are 37k orders for it (Volkswagen expected 30k orders). It is slightly cheaper than the Tesla model 3 but is also slower. They expect to produce 1.5 million EVs in 2025.\n\nI can go on and on for the future but i want to write about the past of the VW group. They had the huge dieselgate scandal in 2015 which cost them over $34 billion. The thing is that will be the past, as there can not be any more lies around the emissions of the vehicles (EVs). They have mass produced legendary cars like the Beetle and the Golf. This company survived World War 2 and I see no reason for it to not survive the pandemic. Also the quality of their vehicles has passed the test of time.\n\nThis group consists of Volkswagen passenger cars, Volkswagen Commercial vehicles, Audi, Porsche, Bentley, Lamborghini, Bugatti, Ducati, Man (trucks and buses, now developing electric buses), Scania (also trucks), Seat, Skoda.\n\nThere is no doubt that Volkwagen won't mass produce and sell electric vehicles in the future, and I am absolutely convinced this is a stock that is going to bring high returns. I feel terrible that i missed buying Tesla when it was at 330$, but that is the past, im now believing in Volkswagen Group.", "id": "idjn5x", "created_utc": 1597959986.0, "score": 12, "upvote_ratio": 0.69, "num_comments": 65, "comments": [{"body": "In 5 years you will be either a genius, somewhat right, somewhat wrong, or an idiot. No one knows", "score": 14, "replies": [{"body": "cant wait to see hehe", "score": 2, "replies": [{"body": "RemindMe! 5 years", "score": 3, "replies": [{"body": "I will be messaging you in 5 years on [**2025-08-21 01:40:35 UTC**](http://www.wolframalpha.com/input/?i=2025-08-21%2001:40:35%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/idjn5x/everyone_just_keeps_talking_about_tesla_and/g2a53f9/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fidjn5x%2Feveryone_just_keeps_talking_about_tesla_and%2Fg2a53f9%2F%5D%0A%0ARemindMe%21%202025-08-21%2001%3A40%3A35%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20idjn5x)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "Tee hee 😆", "score": 1, "replies": []}]}]}, {"body": "People aren't investing in Tesla because they think they'll sell even more cars in the future. No car manufacturer is worth the premium people are paying for Tesla. \n\nThat doesn't mean VW is a bad investment, but it's not going to skyrocket like Tesla has unless their business model fundamentally changes.", "score": 6, "replies": []}, {"body": "You're missing one point, Tesla is a cult and volkswagen isn't. The valuation is not based on anything the company does.", "score": 5, "replies": []}, {"body": "Of all the legacy carmakers, VW is the one devoting most resources to transition to EV. \n\nThey won't catch Tesla, but their EV transition will increase the odds that they survive and remain a viable company.", "score": 15, "replies": [{"body": "I do think they will catch Tesla. Electric engine is simple, no issue there.       \n\nManufacturing quality and Material choice with supply chain infrastructure, VW, Audi, Porsche are far ahead of Tesla.         \n\nTesla is ahead in battery. I think once the other battery producers manage to produce a capacity which is good, people will no longer choose between practical reach and impractical reach. People will then choose between practical reach and extra miles.", "score": 14, "replies": [{"body": "> Manufacturing quality and Material choice with supply chain infrastructure, VW, Audi, Porsche are far ahead of Tesla.\n\nA few years ago, sure. Now, definitely not. Model Y is one of, if not the most structurally sound manufactured vehicle ever. The time where Tesla was trying to figure out how to build quality cars is over.", "score": -5, "replies": []}]}, {"body": "“Legacy” good lord", "score": 4, "replies": [{"body": "Yes. Legacy, those other car manufacturers making 99% of all the vehicles.", "score": 4, "replies": [{"body": "Thats exactly what legacy isn’t", "score": 1, "replies": [{"body": "I know", "score": 2, "replies": []}]}]}]}]}, {"body": "It’s not about the car being electric. My buddy brings up the same points all the time. He has this disdain for Tesla that’s probably rooted in AOMO (anger over missing out). \n\nTesla is to EVs as Kleenex is to tissue paper. The Q-tip to  Cotton swabs. The Clorox to bleach. Young pros don’t want a BMW or a VW or a Chevy. They want a Tesla. \n\nIs it silly? Yes. It’s going to be that way for a while though. The other companies are playing catch up. \n\nI don’t own any Tesla anymore because I sold at $950 like the retard I am. I’m retarded for not being retarded. The world has become more irrational with each passing day and the market reflects it in some sectors. \n\nThese are the things I’ve come to terms with, personally.", "score": 6, "replies": []}, {"body": "Your wrong assumption is that it actually matters whether a company has a good electric car they are selling.\n\nTesla is not valued so highly because it is a company making a lot of money (they don't make any) selling a lot of good electric cars (they don't, their car sales are small compared to ICE). \n\nNo, tesla is a meme-stock. Tesla's valuation is based off the idea that they will be a world-dominating brand 15 years from now and a Tesla will be sitting in everyone's garage while 80% of the current major car companies go bankrupt.\n\nVolkswagen can produce whatever quality and quantity of electric cars they want, but as long as people don't have a similar vision for volkswagen as they do for Tesla, 15 years from now, it doesn't really matter.", "score": 3, "replies": []}, {"body": "I don’t think VW Group stock or GM (also very advanced and invested in ev’s) are going to be great performers, but I think both of them and all the other big auto makers are going to take Tesla down in the coming few years.  \n\nI love Tesla. I love Elon. I fully support most of what he’s doing in all the industries he’s involved in. I just think it’s absurd that Tesla is currently worth more than Walmart. They are still enjoying a near monopoly on the ev car business, at least here in America. That will be ending soon, lead by VW Group.", "score": 9, "replies": [{"body": "Tesla is worth more than Walmart? Holy fuck I did not see that coming and it shows me I have no business trying to value a company 😂", "score": 8, "replies": [{"body": "Walmart does half a trillion dollars in revenue annually and is growing and can’t even break $400B.\n\nSure their net income is “only” $15B, but it’s in retail.", "score": 0, "replies": [{"body": ">Sure their net income is “only” $15B, but it’s in retail.\n\nStill beats Teslas net income by a country mile.", "score": 6, "replies": [{"body": "Every company in the top 50 market caps has proven itself with billions in profits. Yet TSLA still needs to prove itself and is worth more than all of them except the top 8", "score": 3, "replies": []}]}, {"body": "Costco does 1/4 the revenue and has half the margin and look at their stock lol.", "score": 1, "replies": []}]}]}, {"body": "Of course GM and VW are going to smash Tesla.\n\nTesla hires engineers fresh out of grad school.\n\nGM and VW have engineers with 40 years of experience.", "score": 0, "replies": [{"body": "Hmm, engineers that are completely stuck in their ways and have never been involved in or interested in EVs and batteries, or the top graduates of universities that will go on to become the top engineers in the world within 10 years, grew up in the current environment and are free to look at EVs with a completely fresh look. Which should you pick...?", "score": -1, "replies": []}, {"body": "Ok Boomer", "score": -2, "replies": []}]}]}, {"body": "VW group has the potential, but they have deep financial and administrative problems that will and has long term consequenses. Their other companies sush as Audi and porsche have good EV’s/Hybrids, but their product portfolio is inconsistent and only attracts a small group of people. \n\nTheir ID-cars have failed a part of the testing-phase which made the timeline for expected release longer as the main headunit in the ID-cars had big problems with programming and that stuff\n\nThey also have a huge problem with the gearboxes (DSG) that they produce for many of their cars including audi, porsche, skoda etc. Which have given them bad rep. Gearboxes isn’t the only mechanical thing that has been a problem and this will continue to stay with them for a time as petrol/diesel engines is here to stay for at least 50 years", "score": 4, "replies": []}, {"body": "VW isn't also entering the energy industry.", "score": 2, "replies": []}, {"body": "Probably not the best timing to get into VW. I think they're one of the few legacy automakers that might still be around in 10-15 years, but the stock will probably go down a lot before it goes up again if they do. Transitioning to electric is incredibly expensive for legacy automakers. They're going to have huge losses in the future and whether they make it through remains to be seen. There will probably be better entry points.\n\nAlso, VW will never become an energy, cargo, ride-sharing and software company (to name a few). They just build cars, nothing more, so it's unlikely they'll ever reach the valuations Tesla is reaching.", "score": 1, "replies": []}, {"body": "Anyone buying Tesla at 2000 is the biggest moron I’ve ever seen they would have to surpass Wal-Mart Visa Disney in earnings to prove they even belong in this bracket of stocks shorting the hell out this", "score": 1, "replies": []}, {"body": "VW has 192B in debt, \\~90b market cap = 280B effective market cap isn't that mcuh cheaper than Tesla. Bay Area Talent Volume and Work Ethic >> Munich.", "score": -3, "replies": [{"body": "Did you just compare the work ethic of the Bay Area to Germany?  \n\nThat may be the dumbest thing I’ve heard yet. Incoming top for Tesla...", "score": 11, "replies": []}, {"body": "Wow, you've clearly never been to Munich, or even Bavaria.", "score": 4, "replies": []}, {"body": "Naaah, German car manufacturing and working ethic is world known for a good reason. The built quality of german and japanese cars blow Tesla quality out of the water. The germans had manufacturing tech for decades. The hard tech about EV isn't the electric engine, it is extremely simple. The difference is the battery and here the german government and all car manufacturers are partnering up with all type of battery makes to produce a comparable capacity. Tesla might have 10% more battery capacity but do people care that much if all of those batteries reaches traditional car reach? The general public doesn't pick the highest horse power, they won't always choose the highest capacity", "score": 8, "replies": [{"body": "German engineers work 20 times harder than the engineers in the Bay Area.", "score": 5, "replies": []}, {"body": "> German car manufacturing and working ethic is world known for a good reason\n\nYe germans are known for their efficiency 0-o", "score": -4, "replies": []}, {"body": "This a funny one since I work for Argo AI, VW/Ford AV joint venture. Our Palo Alto/Pittsburg teams output like ~80% of our work. VW funding helps us get nice salaries however.\n\nAt the end of the day, our German counterparts take their 5 weeks off for the alps/Oktoberfest and work normal 40 hour weeks and have a life ;)", "score": -3, "replies": [{"body": "Productivity isn't related to hours worked.\n\nJust because your Bavarian colleagues work less hours, doesn't mean they are less productive.\n\nSource: https://www.weforum.org/agenda/2016/03/does-working-fewer-hours-make-you-more-productive/", "score": 9, "replies": []}]}]}, {"body": "I currently work with several former Tesla engineers and I've worked with German engineers in non-automotive sectors in the past. I've found both to be very good at what they do, but I don't think the >> is justified in either direction. On a side note, one thing I've always been impressed by when working with any foreign company is the fact that every engineer I speak with has had to learn a second language to the level where they can have deep technical conversations. I can't imagine doing that myself and I've met very few native english speaking engineers who can claim the same.", "score": 4, "replies": []}, {"body": "If the Germans dont have Work Ethic idk who has. And VW has huge amounts of assets. I havent seen how much debt Tesla has though.", "score": 6, "replies": [{"body": "Tesla has about 14billon in debt. But with interest rates so low most companies are not trying to pay it down. Mind you tesla can't afford to pay its debt so the low interest rates allow it to carry it without worry at this time.", "score": 1, "replies": []}]}, {"body": "“Bay Area Talent”, LMAO, 90% of the people purchasing cars who are middle/lower class could give a fuck about your bay area talent and will buy a $20,000 EGolf before they even set foot in a tesla dealership", "score": 6, "replies": []}]}, {"body": "Teslas technology is years beyond everyone else's. Teslas brand is more beloved then everyone else's. Competing against Tesla isn't as easy as hey we make gas cars now were going to make electric.", "score": -4, "replies": [{"body": "I am pretty sure plenty of people still prefer a BMW or a Mercedes if given the choice. Tesla is like the fancy one, while the others are the shiny ones.     \n\nOr how about a Porsche. Most people will likely choose a Porsche over a Model S", "score": 6, "replies": []}]}, {"body": "VW will figure out ways to complicate \"over engineer\" and make cost of ownership expensive. Instead of a million mile battery, they will purposefully engineer batteries that fail at around 200,000 so you have to replace it.", "score": 0, "replies": []}, {"body": "Did VW ever fix their quality issues ? There was a period of time in the ‘00s when consumers were complaining of maintenance issues of VW. I kind of doubt VW will ever be able to catch Tesla they have always had the rep of being a sorority girl car or one of those preppy nerd mobiles..golf.\n\nTesla has performance and a certain “it” factor to it along with cutting edge updates to automation.", "score": 0, "replies": [{"body": "Do you think they fixed quality issues in 20 years?", "score": 2, "replies": [{"body": "You tell me? I don’t see VW on the road anywhere I live. Maybe less snark and more facts because I certainly don’t see a resurgence of the brand.. puss.", "score": 1, "replies": [{"body": "That would be because you are from US i guess, EU is full of them. Just look at their sales.", "score": 1, "replies": [{"body": "It is a EU brand in the EU where equities underperform and nations with sky high debt levels with insane social policies concerning immigration and “progressive” politics. Not exactly the cutting edge these days.", "score": 0, "replies": [{"body": "So you saw their sales. They were largest car company based on revenue in the world last year. I think they fixed their shitty cars in 20 years.", "score": 1, "replies": [{"body": "A huge titan of industry in which I don’t see any cars on the road in major cities I’ve lived in or been to in Asia, Latin America, or North America. Ok I’ll take your word for it. You invest your life savings in VW I won’t. We’ll see who comes out on top in the end.", "score": 0, "replies": [{"body": " [https://www.worldatlas.com/articles/which-are-the-world-s-biggest-automobile-companies.html](https://www.worldatlas.com/articles/which-are-the-world-s-biggest-automobile-companies.html)", "score": 1, "replies": [{"body": "Its largest margins are from the luxury market sector. Without the consumer market it won’t grow unless you think Lamborghini is going to market a family sedan soon. VW basically increased its corporate profile through European mergers sort of like airbus. VW has little market presence in high growth emerging markets.", "score": 0, "replies": [{"body": "So do you think they still make shit cars after 20 years? that was my only question before you went full defensive.", "score": 2, "replies": [{"body": "I think they make cars that other people around the world outside the EU think are shit and thus the reason why there isn’t global penetration aside from fake EU mergers to boost corporate profile. If I thought it was a good company I’d be trading it.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "German car manufacturers are extremely cyclical and have performed very poorly this year, they're first and foremost car manufacturers and not tech companies, their very conservative management doesn't help.", "score": 0, "replies": []}, {"body": "Tesla doesn’t only create Vehicles. VW won’t compete.", "score": -3, "replies": []}, {"body": "I was driving 120 miles minimum a week pre-covid. Today, I’m lucky if I catch a glance at my car. Not required to go in the office or drive kids to school.This is the future sort-of. Car is used to go to get my Fast food fix or groceries, but now other services can fulfill that need, but I’m as cheap ass. \n\nMy theory is that cars will become a luxury item, not a necessity.", "score": -1, "replies": [{"body": "In most European cities it's been like that forever. Working public transportation and high pop density sure helps.", "score": 2, "replies": []}, {"body": "120 miles is 193.12 km", "score": 1, "replies": []}]}, {"body": "Tesla is richer than VW in terms of the revenues it gained from stock sales.  I think Tesla kinda reached critical mass in that all the investors have invested in it for the upcoming vehicle revolution.  Do not underestimate investment money, it can make or break a company.  i.e pay for the best engineers, equipment ect.", "score": -1, "replies": []}, {"body": "Clown. VW is nowhere near the same thing as Tesla.", "score": -12, "replies": [{"body": "Sorry i forgot that Tesla manufactures EVs and VW produces salami..", "score": 11, "replies": [{"body": "If that’s the case, I need to pull up to VW so I can indulge on a hot toasted Salami sandwich.", "score": 5, "replies": []}]}]}]}
{"title": "Watch: Jim Cramer & Rob Maurer Discuss TSLA Stock, Elon Musk, and Battery Day", "selftext": "", "id": "id0fma", "created_utc": 1597884875.0, "score": 214, "upvote_ratio": 0.97, "num_comments": 66, "comments": [{"body": "So cool to see talented and knowledgeable YouTubers get acknowledged like this by main street media!\n\nKudos Rob!", "score": 80, "replies": [{"body": "Yes I second, congrats!", "score": 13, "replies": []}, {"body": "Rob works for Jim Cramer now! He writes for The Street", "score": 11, "replies": [{"body": "Works with\\*, I still have complete control over my content which is very important to me :)", "score": 83, "replies": [{"body": "I really liked this interview. There are always 100 points that you can make on any topic, but I like how Rob manages to get the most salient of them across so clearly. I think all those YouTube videos really refined his speaking ability.\n\nIf I were doing this interview, it would be full of ums, you knows and mumbling. And I would probably decay into an angry rant like Solving The Money Problem, or go into hyperdrive like Gali to try and get all the points across... not that I don't like STMP or Gali, but Rob's collaborative approach is much more impactful in the broader public.\n\nAnd it is important to reach the broader market, not for the sake of the stock, but for the sake of transitioning the world off fossil fuels. The world is going to be a much better place once everything is green and electric.", "score": 21, "replies": [{"body": "Rob is the best Tesla analyst out there.", "score": 3, "replies": []}, {"body": "Well said!!!", "score": 2, "replies": []}]}, {"body": "Touché. Great interview Rob! Very enjoyable and insightful.", "score": 11, "replies": []}]}]}, {"body": "I completely agree. They deserve it!", "score": 1, "replies": []}]}, {"body": "Robs voice is so soothing!", "score": 19, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I’m down", "score": 15, "replies": [{"body": "can you please record it?!?! \" Hey Everybody I'm Rob Mauer, and <Name> is not available right now, in Today's news Tesla is still amazing.\"", "score": 8, "replies": []}]}, {"body": "Isn’t there a website where celebrity can register and for fee record messages for people?", "score": 1, "replies": []}]}, {"body": "There was one point in this interview when Cramer is getting totally hyped and animated, then its Rob's turn to respond, and he's completely calm and neutral. It really stood out to me.", "score": 3, "replies": []}]}, {"body": "I watch both of them everyday. This was so Dope.", "score": 16, "replies": []}, {"body": "Cramer's reaction to the cybertruck reservation numbers LOL 17:55", "score": 46, "replies": [{"body": "Exactly. I made same comment on duplicate post. He is going to screaming that on mad money for years. Greatest mind with greatest pumper. This will help get this to $2500 eoy.", "score": 25, "replies": [{"body": "$2,500 post split.", "score": 8, "replies": [{"body": "Post *this* split. ;)", "score": 2, "replies": []}]}]}, {"body": "And again with the CT base price.", "score": 8, "replies": []}, {"body": "All of the skeptical questions from Cramer seemed totally planted to me, as well as that reaction. It didn't seem genuine to me and I think he was just playing a bit of a role to help convert skeptics.", "score": 1, "replies": []}]}, {"body": "Love to see Tesla's value reach the mainstream.  Very good conversation.  Thanks for posting.", "score": 15, "replies": []}, {"body": "Great interview. Only nitpick is I wish Rob had brought up the non-auto Tesla businesses like energy, solar, insurance. I feel like they will make as much in those fields as they do in the Autos", "score": 13, "replies": [{"body": "All in good time :)", "score": 24, "replies": [{"body": "Do I sense a haymaker being wound up amidst the solid jabs?\n\nGreat interview, Rob. I really enjoyed it and think it's the best of yours I've seen to date. Moreover, I was genuinely left with the impression that it was a conversation vs the series of short prepared questions and succinct scripted prepared talking point responses that we've all been conditioned to expect in broadcast media.\n\nWith the greatest of respect, my only suggestion would be to find an authentic way to acknowledge the other party's comments a bit more before continuing on to your next comments.", "score": 2, "replies": [{"body": "For sure. \"Yeah\" is not the best response. Thanks for the feedback, always appreciated.", "score": 7, "replies": [{"body": "Tbf, I would have giggled like a school girl. Well done!", "score": 1, "replies": []}]}]}]}]}, {"body": "🚀", "score": 8, "replies": []}, {"body": "Shows you how all these analysts who bashed Tesla couldn’t even be bothered to test drive. So what exactly were they “analyzing”?", "score": 8, "replies": [{"body": "They're valuing Tesla based on other car manufacturers, same recipe. They also were manipulating the market for profit, at the expense of Tesla. The auto industry is very unforgiving, most companies do not make it. So it's a pretty solid way to score by betting against them, especially when contributing to their downfall.\n\nTesla won, at least to this point, by simply making thrilling products. More than one friend of mine got in skeptical and got out drooling, saying they're a believer.", "score": 6, "replies": []}]}, {"body": "What blew my mind was Cramer asking about the “million mile battery” and describing others as having competing versions because their batteries could “last 8-9” hours powering a car.\n\nThe comment demonstrated complete cluelessness concerning EVs, both coming and going. It means that even older wall street experts who have started looking deeper into Tesla for many months are still going to be asking questions like “won’t the battery spark and ignite the gasoline in the tank? Is that why all the fires happen?”", "score": 8, "replies": [{"body": "Indeed. It would sound equally preposterous to a gearhead to talk about a 'five hour gas tank' (*at what speed?*, *what kind of vehicle?*, *what kind of road?*, *what kind of load?*, *what season?*, *just what the hell are you talking about?!*). \n\nThat, or to fixate on the number of litres a fuel system can handle before likelihood of failure or corrosion will render it useless. \"Your F150 can only handle 20,000 litres? Bro, my Miata can double that. You bought the wrong van.\"", "score": 3, "replies": []}, {"body": "So Rob Mauer straightened him out gently. Clarified the issue with Cramer's dignity intact. Excellent emotional intelligence. Im betting he gets invited back. Good job Rob.", "score": 3, "replies": [{"body": "Rob is a paid contributor to Cramer’s website, so seems likely. At least, that is my understanding. Never been to it.", "score": 1, "replies": []}]}, {"body": "I was insanely confused for that portion of the video, ain't gonna lie. Wanted to roll back a bit just to try understanding a bit but..you know..I got tired of bullshit and at some point I'm like..yea man whatever. Ok", "score": 1, "replies": []}, {"body": "I think what a lot of people are missing in the interview is that Cramer phrased a lot of his questions and statements from a skeptic's position and didn't have those concerns himself. A lot of leads to let Rob provide information.", "score": 1, "replies": []}]}, {"body": "Is it me or Cramer was thinking 1 million mile battery is about million miles without recharge? (8:50)\n\nIf yes then we are doomed - nobody can meet that level of expectations :-)", "score": 6, "replies": [{"body": "Had the same feeling, also he kept going on about a 10 hour battery, what kind of metric is that haha", "score": 4, "replies": []}, {"body": "I literally listened to that part and came here to make that same comment. I think this is a great microcosm of the problem with all the tv talking heads that scoff at Tesla and call it obviously crazy overvalued. Jim isn’t personally part of that problem but he’s representative of all these “stock guys” that know a little about a lot of companies and don’t know what they don’t know - the fact that Jim even considers for a split-second that 1) people are suggesting that a single charge could last a million miles and 2) has so little idea of ANYTHING related to battery tech that his metric is “can it drive for ten hours straight without recharging?” shows that they barely understand how an EV works. That type of “stock guy on tv” really shouldn’t voice their opinion until they understand the tech because you can’t understand the competitive moat until you understand the tech.", "score": 5, "replies": []}]}, {"body": "Great video! Thank you for posting it here.", "score": 5, "replies": []}, {"body": "Thanks for sharing!", "score": 6, "replies": []}, {"body": "Great video.  Rob seemed a little nervous talking to Cramer and sometimes I felt like they weren't connecting.  They would say something and then answer differently.  To be fair, A LOT to cover.  A deep dive convo like this could have easily been 3 hours long.  Would love to see more of this.", "score": 10, "replies": [{"body": "Rob came across as very careful and calculating in what he said. With comfort, he would let it all out a bit more, but for now his tempered and factual approach is probably appropriate for The Street's audience, even if it sacrifices some of the entertainment factor, or interplay between Jim and Rob.", "score": 6, "replies": []}, {"body": "Maybe, as this was Rob’s video with Cramer. \n\nI agree on disconnect part as well, with more interactions, they will get better.", "score": 5, "replies": []}]}, {"body": "I can't get over how hard it is to listen to Cramer. I find it truly amazing that this guy gets paid to talk on TV. Also painful to see that he doesn't get battery basics at all.\n\nVery strong performance by Rob though, as usual.", "score": 6, "replies": []}, {"body": "Wow this was such a smart discussion. Loved it.", "score": 3, "replies": []}, {"body": "Great video, enjoyed how this video discusses vehicle sales and a portion of software as the primary basis of 350B valuation.\n\nThey could spend another hour talking about taxi revenue, insurance revenue, solar battery and networks, and ad revenue. Valuation on those is far beyond 350B.\n\nSoftware sales also under appreciated. Competing car companies who don’t want to create their own software can just lease the software from Tesla. Far cheaper and easier than developing an AI from scratch.", "score": 3, "replies": [{"body": "Has Tesla offered to distribute their software?", "score": 2, "replies": [{"body": "Offered ? Unknown. Should they? My magic ball says yes.\n\nLots of money to distribute their platform. Enterprise software leasing is a hugely profitable business with high margins, scalability, and volume.", "score": 2, "replies": [{"body": "Then all the \"competitors\" would be dependent on Tesla. Not an easy pill to swallow so they will fight it as long as they can. Might have to capitulate in the end, though...", "score": 3, "replies": [{"body": "Yes. Join or die could become a real choice for these companies.", "score": 3, "replies": []}]}]}]}]}, {"body": "What an awesome interview. Thanks for the insights Rob, keep it up!", "score": 3, "replies": []}, {"body": "This was the first time I ever saw Jim Cramer so Calm!", "score": 2, "replies": []}, {"body": "Jim reaction to the base model CT price is golden", "score": 2, "replies": [{"body": "Jim's mind is doing some serious Beautiful Mind-confused math lady meme shit: https://i.kym-cdn.com/entries/icons/facebook/000/021/464/14608107_1180665285312703_1558693314_n.jpg\n\nHe's realizing, in that moment, that a truck that's far cheaper to buy, operate, and offers at least as good, if not far better, utility than a F150/Silverado/Ram is coming to market and the better part of a million people are interested enough to put some money on the table to reserve one. \n\nMoreover, it's wild looks are polarizing and will get a lot of attention, and *a lot* of truck drivers like the feeling of shocking people with their lifted, modded, coal rolling, flag-waving trucks and thrive on the attention and one-upsmanship with their buddies.\n\nCramer: well shit. This thing is going to be huge.", "score": 3, "replies": []}]}, {"body": "Cramer gets it!  Let him in the club!", "score": 1, "replies": []}, {"body": "Manipulator Jim? Stock will probably tank soon..", "score": 1, "replies": [{"body": "He is redeemed to a certain degree—you have to allow a man to change, as he clearly has based on his wife/daughter and now Rob's guiding influence.", "score": 3, "replies": [{"body": "Did you see his 2006 clip on YouTube? \"It's illegal but the SEC don't know what their doing\". This guy fucks the market so hard he has tendies for breakfast.", "score": 3, "replies": [{"body": "I've seen it... and I've seen all Jim's coverage of Tesla.\n\nUp until about 1-2 years ago I would have agreed with you, that Jim was trying to manipulate the stock downwards. Some would argue that now he is simply doing the reverse, trying to manipulate the stock upwards.\n\nThe way I see it now, is that as a hedge fund manager Jim was knee deep in stock manipulation. When he became a TV personality, he is more concerned with ratings and entertainment. And now on the Tesla story he is more concerned with being right as he approaches retirement. Jim is surrounded by finance people who struggle to understand tech... Jim is a manifestation of the people he is surrounded by. Slow to understand Tesla, but not impervious to getting there. Morality will probably never be his strong suit, but his redeeming quality is that he adjusted his position based on facts. Also, considering he covers all stocks, he is not really an expert in any of them, so he is more prone to misinformation himself.\n\nWhen you are judging someone, it is better to weight the latest information over the past information.", "score": 3, "replies": []}]}]}]}, {"body": "the concern with a covid recrudescence and its economical impact expressed by Cramer seems to have been invalidated by Tesla Q2 deliveries, as Fremont has been shut down for long weeks.\n\nit's the ICE  car industry which would be affected again. In Europe the governments have provided massive support and credits to help VW,Daimler, BMW and Renault. In France the consumer incentives to buy new cars are also targeting larger SUVs, just because they might be less emitting as older ICE.\n\nBut nether the less, if the supply and demand concerns are to stay for 12 more months, Tesla will be best positioned to deliver contact free cars at list price to the working  at home class", "score": 1, "replies": []}, {"body": "What is Rob's long term price target on Tesla?", "score": 1, "replies": [{"body": "He has never said. I was going to ask him that question on Patreon sometime, but I suspect it's not something he really wants to get tied down to. \n\nHe's also never said how many shares he has. I hope you're sitting on a stack Rob.", "score": 2, "replies": []}, {"body": ">  I think very directionally rather than specific price targets. I still see a ton of upside [...] so for me it is a very easy decision to continue to be invested without worrying about whether it will 5x or 20x. I think we are so far away from TSLA reaching peak value that price isn't important to me at all right now", "score": 1, "replies": []}]}, {"body": "Love Cramer talking about his religious conversion 👌", "score": 1, "replies": []}, {"body": "This was somewhat of a novelty treat - what a contrast in tone. And funny to consider that I felt strongly obliged to platinum support Tesla Daily patreon, but never consider any subscription of TheStreet. I may have to take closer look at what they’re doing there.", "score": 1, "replies": []}]}
{"title": "TastyWorks (Pros & Cons)", "selftext": "Since TD Ameritrade's ToS has been down or intermittently failing for 4 trading sessions now, I went ahead and opened a TastyWorks IBA on Monday afternoon. I have held an IBA with TD for about 3 years and was an avid supporter of ToS. However, as an active trader, I find the main platform (ToS) being down and being reduced to limited web & mobile trades to be completely unacceptable. I closed all of my positions on ToS this morning and did a balance transfer to my bank to load up TW (Hopefully by Monday).\n\nI know a lot of users here use TW as their main brokerage, so as I'm waiting to load up funds and resume my normal trading schedule. I was interested in seeing if some of you wouldn't mind sharing some of the pros and cons of the platform.\n\nThe desktop platform seems pretty comparable to ToS which is no surprise. I'm a little disappointed already that I can't delete the pre-loaded watch lists that I couldn't care less about. (Sorry Mark, no one cares about what you're watching.) Other than that, it seems like it will be more than suitable for my needs. I think the layout is a little cleaner than ToS too. More intuitive at least. I'm more concerned about the fills and real-time data reporting. I had that issue with ToS when I only had cash options years ago, there was a real-time reporting delay which skewed the fills, asks/bids on stock equities. I have \"The Works\" on TW so I'm hoping this won't be an issue.\n\nAlso, has anyone actually received any of the rewards from the referral program? If so, what? Has anyone has gotten that shiny new Tesla or the Apple product bundle? The latter seems like a feasible goal, the former not so much.\n\nIf the referral program is legit and the platform is good, I'm going to be spamming the living daylights out of everyone in my social network lol.\n\n&#x200B;\n\nNote: I am not looking for brokerage recommendations. Just some feedback from people who actively trade on TW so I can gauge my expectations. ", "id": "ideeku", "created_utc": 1597943602.0, "score": 18, "upvote_ratio": 0.89, "num_comments": 59, "comments": [{"body": "Tasty is by far my favorite for UI/UX (besides how pretty Robinhood looks) but also has great fills.\n\nWhat it really lacks is in research. So it's my favorite platform to use but requires me to use other means to do research. Also, contracts are a little more expensive than other brokers.\n\nWell worth it for me, so it's what I use.", "score": 9, "replies": [{"body": "> Also, contracts are a little more expensive than other brokers.\n\nCan you elaborate a little bit on that. TD charges me 0.65 to open and close an options contract, totaling $1.30 per every trade closed. So if I sell 5 covered calls, when it's all said and done I pay out $6.50\n\nTW says they charge $1 open equity options and no closing fee. Which isn't significantly cheaper but 0.30 is still 0.30. \n\nThe futures don't seem too pricey with options being $2.25, contracts $1.25, 0.85 for micros and 0.25 for smalls (minis). No closing costs or exchange fees on the regular contract sizes.\n\nTD's fee is $2.25 to open/close plus exchange and regulatory fees no matter what.\n\nSo my assumption was TW was actually a little cheaper given how I trade.", "score": 2, "replies": [{"body": "I thought TD doesn't have a closing fee on contracts? Just the $.65 round trip. Plus people negotiate that down to $.55 or $.50 a lot\n\nThey also don't have an assignment fee so that adds up for a lot of people.\n\nI don't know futures unfortunately.", "score": 2, "replies": [{"body": "> I thought TD doesn't have a closing fee on contracts? Just the $.65 round trip. Plus people negotiate that down to $.55 or $.50 a lot\n\nThey do. It's $0.65 fee per contract. So 0.65 on the opening and 0.65 when closing because they count them as separate contracts. I wish they did it individually as a round trip. There is no assignment fee which is nice. Granted I've only been assigned twice in the last 12 months. I try to avoid it at all costs unless it's CC's on something I want to get rid of. \n\nTD's futures are $2.25 fee per contract (plus exchange & regulatory fees) which sucks. So I think TW might have TD beat there with no closing cost. I guess we'll see.", "score": 1, "replies": [{"body": "Well if cost isn't an issue then I would definitely choose TW", "score": 2, "replies": [{"body": "Thanks. This seems like it's going to work out just fine. I'm always nervous about trying about a new broker. I've had a lot of them over the last 10 years or so. Thanks for the heads up!", "score": 2, "replies": [{"body": "No problem, make sure you sign up for one of the bonuses (100 free shares or whatever)", "score": 2, "replies": [{"body": "I had to call to get it fixed. Luckily I haven't funded my account yet. Like a dummy, I used a referral code (THETAGANG) so they had to input the STOCK_AWARD_20 and it will kick in once I fund the account. I already selected my reward, but prob wont get it until next week. I feel stupid lol.", "score": 2, "replies": [{"body": "Missing out on something free isn't too bad. At least you got your one mistake out of the way and it's all profit from here on out!", "score": 2, "replies": [{"body": "Oh ill get that free reward lol. Just not for a week or so. I'm excited about TW now. I've only made like $800 bucks since I started trading these strategies at the beginning of the month. My account is small af too. Only 7k. so that $800 is a little over 10% and the month isn't even over. So now I'm stoked to keep earnin and turnin (shitty wheel joke)", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I think TDA includes all the regulatory fees in their price, whereas TW adds them on later.  So it's probably close to a wash.", "score": 2, "replies": [{"body": "Got ya, that makes more sense to me.", "score": 1, "replies": []}]}]}, {"body": "Can you elaborate on research? Do you mean the charts are not informative enough?", "score": 2, "replies": [{"body": "It's lacking in fundamentals (P/E, etc).", "score": 1, "replies": []}]}]}, {"body": "Other than their shitty charts and annoying viewing of closed positions/history, I really have no complaints. Desktop software runs smooth with clean interface, real time data, opening closing getting filled is easy.", "score": 8, "replies": [{"body": "The fills and data were my biggest concern. So thank you for that. It's always nerve-racking trying out a new brokerage. I've had many over the past 10 years.", "score": 2, "replies": [{"body": "Just be sure you have decent volume and open interest on whatever contracts you're trading. I'm sure you know this, but just a friendly reminder. Cheers", "score": 4, "replies": [{"body": "I had to change the settings on the desktop app for that just now lol. It was just delta and %ITM. I def don't want to be trading illiquid options lol. Thanks broski!", "score": 1, "replies": []}]}]}]}, {"body": "I switched from TOS to tasty about 3 weeks ago. \n\nTasty is IMO, much better when it comes to making orders, filling them, or adjusting them. \n\nTasty is far better when it comes to managing current spreads, and open positions. \n\nTOS is much better for charting, research, and monitoring current stocks. \n\nI usually watch the market in tos still because I like their multiple charts page. Then do everything else in tasty. \n\nAs for rewards, I didn’t take a referral, I used the new customer code. It gives you the options to get 10 option contracts or 10 shares of a stock. I took the 10 options. He gave me $200 in calls for MO that ended up shooting up about a week into it and I sold for $430.", "score": 6, "replies": [{"body": "> As for rewards, I didn’t take a referral, I used the new customer code. It gives you the options to get 10 option contracts or 10 shares of a stock. I took the 10 options.\n\nI was talking about their referral program. If you refer people and they open an account with 2k or more, you get reward points redeemable for some pretty cool prizes. \n\nI used the THETAGANG referral code when I opened my account to support the podcast and get flair on the website lol. I wonder if it's too late to get the new customer benefits. The site said if I upload more than $2,000 on my new account within 90 days, I get to pick from the rewards you mentioned. May have to give them a call to figure that one out lol.\n\n\n> Tasty is IMO, much better when it comes to making orders, filling them, or adjusting them.\n\n> Tasty is far better when it comes to managing current spreads, and open positions.\n\n\nDude now I'm stoked on this. I considered going back to Interactive Brokers, but fuck that. I've heard very little about TW aside from the few comments I've seen in the sub.", "score": 1, "replies": []}]}, {"body": "Things missing from TW that could be a deal breaker for some: depth of market, pop out charts, t&s.", "score": 4, "replies": [{"body": "> depth of market, pop out charts, t&s.\n\nDang, the t&s part kind of bums me out a little, but I can always use ToS for it, provided it actually works sometime in the near future lol.", "score": 2, "replies": [{"body": "If you only trade thetagang strats I'm sure TW will probably work just fine. I personally couldn't use them to daytrade or scalp.", "score": 2, "replies": [{"body": "I made the switch to only using thetagang strats at the beginning of this month and am up $889 which is a little over 10%. My account only has 7k, and I've been executing some risky plays, but all and all I'm not going back to buying options unless it's puts if/when the market starts to correct, which could be never lol. Even then I probably will never buy an option again in my life. This is a sure fire way to consistenly make returns.  \n\nI do occasionally scalp indexes, but I use futures so I haven't ran into any problems with PDT since the rule doesn't appy there. \n\nHave you had any problems with that on TW?", "score": 2, "replies": [{"body": "My experience with TW has been good. I can't really think of anything negative that has happened at all. I primarily just sell ICs there so it's not too labor intensive.", "score": 2, "replies": [{"body": "I like your style. I'm a more of a spread guy myself, unless it's trading flat then I'll whip out an IC or two.", "score": 2, "replies": []}]}]}]}, {"body": "what does t&s mean? currently in search of a futures broker.. 1st one.. so many lingos", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Short & sweet. Very appreciated.", "score": 2, "replies": []}]}, {"body": "$1 per contract at TastyWorks with no closing commission equates to .50 to open and .50 to close which is about as low cost as you will find anywhere.", "score": 4, "replies": [{"body": "I agree. It's 0.30 cheaper than TD.", "score": 1, "replies": []}, {"body": "I agree. It's 0.30 cheaper than TD.", "score": 1, "replies": []}, {"body": "Cheaper than IB except in a variety of esoteric scenarios.", "score": 1, "replies": []}]}, {"body": "No to be the one point it out. But don’t you have to pay taxes when you sell all your positions and transfer it to your bank?  \nBy transferring your positions from ToS to TW directly, you could avoid paying taxes.", "score": 3, "replies": [{"body": "> Not to be the one point it out. But don’t you have to pay taxes when you sell all your positions and transfer it to your bank?\n\nNo, At least not immediately. I'll get a 1099 come tax time for 2021 and have to pay whatever is owed to Uncle Sam. Standard stuff. This year I'll have (2) 1099's (1) from TD and (1) TW. Tax consequences on capital gains (short/long) are due only once a year, unless you decide to pay them quarterly to the IRS. \n\nIf you transfer your brokerage balance to your checking account, you don't pay taxes on the full distribution, just the capital gains. Unless it's a qualified IRA or 401(k), then you would just have taxes (fed/state) deducted out before the transfer. That TD account was 7.8k. I've only made $884 in short term capital gains since opening that account to trade thetagang strategies. \n\nI'm not taxed again on the initial 7k I used to fund that account. Being, all of that money came from my income and was already taxed out of my paychecks. I will however have to pay taxes in 2021 on the $884 in short term capital gains included in the distribution. If that makes more sense. 7k already was taxed when I got my checks and saved it up, the $884 is my capital gain and will get taxed acccordingly at the end of the year. \n\n> By transferring your positions from ToS to TW directly, you could avoid paying taxes.\n\nYou can not avoid paying taxes by sheltering capital gains funds in your brokerage account. Whoever told you that was misinformed. There is always a tax liability on your gains whether you transfer the funds to another broker or to your bank account. Your yearly 1099 will give you the breakdown. By transfering to my bank and closing my TD account I avoided the $95 trade-in-kind fee from TD to TastyWorks. The tax implications are the same whether you hold your gains in a brokerage sweep or deposit them to your checking account. It will all be on your 1099(s). And you can always do a wash sale to up to 3k to lower your tax liability.", "score": 4, "replies": [{"body": "Oh. I get what you’re saying.\n\nBut if you held a stock for less than a year, it makes sense to transfer the stock to your new broker and sell it after a year so that you’re only taxed at the long term capital gains rate and not the short term. Totally depends on what you want to do.", "score": 2, "replies": [{"body": "Exactly my dude. You got it. Sorry if my last response was long-winded. I have difficulty explaining things short-and-sweet.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "> How about scripting or custom indicators?\n\nThe scripting and U/I seems fine on the desktop app imo. I have yet to fully try out web or mobile. Mobile app seems a little lack luster tbch, at least as far as lay out and appearance. I don't know enough to comment on U/I or usablity. I probably will only use mobile occasionally for passive monitoring. \n\nThe custom indicators seem fine, I was able to customize my whole U/I and program watchlists in about 20 minutes. Mine are pretty simple anyway so it's not my most pressing concern with trading options. I do not own any stock and only trade options and futures, so I don't see anything that would indicate any glaring issues at this time. The platform seems very intuitive and straight forward.  \n\nBiggest ones for me are order fills, data tracking, and charts. Seems like charts is the only real drawback as far as I can tell.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I assume it does because it's made by the inventors of ToS. Just a little different.", "score": 1, "replies": []}]}]}, {"body": "I think for options it does not matter much I barley look at indicators, now it’s a feel thing", "score": 1, "replies": []}, {"body": "Buahaha, indicators? Real men use naked charts and trade naked options.", "score": 1, "replies": [{"body": "Vegas, baby. Vegas.", "score": 1, "replies": [{"body": "Coke and hookers, coke and hookers!", "score": 2, "replies": []}]}]}]}, {"body": "Tracking credits accumulated from rolls in TastyWorks is the easiest that I have seen anywhere.  They are working on a feature to chain options and track roll credits automatically but in the meantime, all you have to do is go to the history page and filter by symbol and then click highlight the trades and it will do the math for the total credits, commissions, and fees.", "score": 3, "replies": [{"body": "That is actually the coolest feature I've heard about. I think that could constitute as a possible future leg up over other platforms if they can get automated rolls and track all the credit and fee tallies in one section. Thanks for that bro, I'm hyped af to start trading next week when my munny clears.", "score": 2, "replies": []}]}, {"body": "For selling naked I’ve found that TDA generally has equal or better BP reductions.  I’ve never seen an instance where TW has a better BP calc than TDA.", "score": 3, "replies": [{"body": "TW let's you trade naked with $2k, so I imagine TW buying power calc is more sensitive. I bet they have a much higher percentage of users trading naked than other brokers.", "score": 2, "replies": []}, {"body": "I noticed this last night when I was playing around on the desktop app with orders. TW does have much higher BP reductions than TD for sure. Granted I rarely trade naked as a general rule of thumb but this is very important for strangles for me in particular. As my short call is usually naked, being I do not own stocks lol. So I may need to change that up.", "score": 1, "replies": []}]}, {"body": "I found fills faster and they seem better priced (subjective) on TOS.\n\nTW charges fees for assignment ($5 I think) where TOS is no cost.\n\nIf you have a decent sized account and/or trade a lot TOS will lower the option fee down to .50 and even .35 for larger more active traders, and closing short legs <.05 is free, so TOS has a slight edge on TW unless you are trading 10+ contracts at a crack.", "score": 3, "replies": [{"body": "That seems to be the consensus. Which is very good to know. It seems like TW is relatively more expensive depending on your activity and account size. I suppose it's the literal price I'll pay to not have to deal with outages.\n\nWhat's sad is that I absolutely loved TD & ToS. I've had it for 3 years and have grown a little attached, but I can't wait around for them to get their service together. It's caused me to miss out on a lot of money.  \n\nAn outage for an hour or so is understandable, or even updates/maintenance over night. But 4 trading sessions now? I just can't. Especially because currency & index futures are my main bread and butter and can only be done on the desktop ToS.", "score": 2, "replies": [{"body": "To each their own.  I was barely affected by this recent event but trade far different than you do.", "score": 2, "replies": [{"body": "I feel ya. All and all TD is a great platform. It's that lack of ToS desktop that kinda stung a little. Hopefully they get it resolved sooner than later.", "score": 1, "replies": []}]}]}]}, {"body": "IBA?", "score": 1, "replies": [{"body": "Individual brokerage account", "score": 2, "replies": []}]}, {"body": "Tasty is my far the worst[https://picbun.com/p/Jtqyh34K](https://picbun.com/p/Jtqyh34K) scammed me of 700$ on a scalp will do nothing to fix steer clear their fills and data are always way off", "score": 0, "replies": []}, {"body": "I use TW, i like it. Hell, its from the same guys who originally build TOS. Yes, and those refs are legit. Here, use my ref if you haven't yet registered, we both will benefits **894M8RSG7V**  [https://start.tastyworks.com/#/login?referralCode=894M8RSG7V](https://start.tastyworks.com/#/login?referralCode=894M8RSG7V)\n\nMore info about the benefits: [https://tastyworks.com/referral/](https://tastyworks.com/referral/)", "score": -2, "replies": [{"body": "Sorry bro, I already used the THETAGANG referral from www.thetagang.com to support the podcast of the original dude who made thetagang. \n\nDude, I want that Apple Package just so I can re-sell it. 50 referrals does not seem hard at all. I have over 700 friends on FB who are always asking me about investing since I got licensed. 750 for a Tesla, If anyone accomplishes that shit, TW should just give them the car and a six figure job in marketing lol.", "score": 4, "replies": [{"body": "Remember, for the ref to count the registrant has to deposit at least 2000 inside 60 days. Good luck 😎", "score": 2, "replies": [{"body": "Ah the fine print bs. Is this the same for robbinhood?", "score": 5, "replies": []}, {"body": "Thanks broski.", "score": 3, "replies": []}]}]}]}]}
