{"title": "i’m looking for advice", "selftext": "i’m 15 and have about $125 to invest... what companies would you recommend i invest in? i’m a car enthusiast and i’ve been following tesla’s ups and downs in the stock market.... is tesla still a smart decision?", "id": "b8m99v", "created_utc": 1554226278.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 17, "comments": [{"body": "Save for college or trade school.", "score": 11, "replies": [{"body": "don’t worry, i’m doing that as well haha. i don’t expect the stock market to pay for my schooling. ", "score": 1, "replies": []}]}, {"body": "TSLA is an exciting company, but there will be a lot of ups and downs with the stock.\n\n&#x200B;\n\nIts great that you want to get involved with the market so early!\n\n&#x200B;\n\nBe aware that you are not going to be doubling your money any time soon, but by investing now, you are going to learn a lot about how to invest. Grab a few shares, start investing and build you experience! ", "score": 7, "replies": [{"body": "thanks for the advice! i’ll probably but into tesla and a few other car companies and go from there. facebook looks like a wise decision too...", "score": 0, "replies": []}]}, {"body": "Capital gains won’t be too much, but F has an attractive dividend. If you keep adding to it and reinvesting through college that could work out well for you", "score": 3, "replies": [{"body": "I was going to say the same thing. F has a decent dividend and you will be able to pick up a couple shares at their price. ", "score": 3, "replies": []}, {"body": "i appreciate it! F shares are cheap so i’ll definitely look into it. ", "score": 2, "replies": []}, {"body": "Beginner here, F just means Ford right?", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "Focus on your education and learning skills.\n\n125$ is not an investable amount of money. Put it aside and save it for now. Don’t even think about investing until you get your first job and have a steady stream of income.", "score": 1, "replies": []}, {"body": "$125 is nothing. Put it in Bitcoin, maybe you'll get lucky.", "score": -3, "replies": [{"body": "is .024($125) of a bitcoin a substantial amount? i feel like it’s already reached its peak and will slowly decrease in value from this point forward. what would you recommend me do? ", "score": 2, "replies": [{"body": "Even in bitcoin it's not much but with luck you can sell it in a few years for enough to be worth putting into stocks. I don't think it has reached its peak yet. It has only barely begun to be taken seriously by finance media and institutional money aren't yet including it in their portfolios.\n\nI would recommend buying now and seeing what happens in the next 5-10 years. If it goes up a lot, sell some of it but never all. If it crashes, just consider it a piece of internet history that you can show to your grandkids when you get old.", "score": 1, "replies": [{"body": "i appreciate the advice! how does one purchase bitcoin...?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/Bitcoin/search?q=how+to+buy+bitcoin&restrict_sr=on", "score": 2, "replies": []}]}]}]}]}, {"body": "[removed]", "score": -5, "replies": [{"body": "^ what a generous guy haha", "score": 3, "replies": []}]}]}
{"title": "Buy Low, Sell High (Tesla Edition)", "selftext": "So I was thinking, now that Q1 has ended and all the Shorts have made their quotas, they’re going to want the stock to shoot back up to 340-360. \n\nPlan A: Buy when 310>; Sell 340-360. Rinse and repeat every quarter.\n\nNow I was wondering, what made Tsla break the last upper limit from 260 to 360 over the past 5 years.  Wondering what will push the next upper level from 360 to day 460, as I don’t see any stellar developments happening until 2020 with the semi, pickup, model y, increased international sales, and further development of the giga factories.\n\nBut I guess even if it hits a new upper limit, it’ll still fluctuate 20-30% anyway, so you could still make the same amount of gains.\n\nI wanted to run this idea by you all and see what your thoughts are.\n", "id": "b8elk2", "created_utc": 1554180625.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 16, "comments": [{"body": "Wallstreetbets is the sub you’re looking for.", "score": 23, "replies": [{"body": "Yolo 4/5 $320 calls", "score": 3, "replies": []}, {"body": "lol poor OP", "score": 3, "replies": []}, {"body": "Come on over to r/wallstreetbets ", "score": 3, "replies": []}, {"body": "Ahhh thanks!", "score": 2, "replies": []}]}, {"body": "Go to wsb. Folks there have many creative bet styles. ", "score": 7, "replies": [{"body": "That's where I learned to yolo my hodls.", "score": 2, "replies": []}]}, {"body": "Wait... Buy low sell high? Game changer. ", "score": 6, "replies": []}, {"body": "Here's a better idea: Go to Vegas and at least get some free drinks while you gamble.", "score": 3, "replies": [{"body": "See, this is why I ask questions ", "score": 2, "replies": []}]}, {"body": "For that kind of strategy, I'd just buy calls that expire after known price catalysts, e.g. earnings releases, shareholder meetings, etc. If you're going to play fast and loose, you might as well play for keeps.", "score": 1, "replies": [{"body": "Thanks for the suggestion, maybe I’m just overthinking it and should just hold.", "score": 2, "replies": [{"body": "Don’t get into options if your not 100% confident in what you’re doing... And Do the opposite of WSB recommendations 75% of the time.", "score": 3, "replies": [{"body": "Thanks for looking out for my well-being. It’s a scary world out there.", "score": 1, "replies": [{"body": "When I started investing I got excited and made a few mistakes (nothing dramatic). Just wanted to make sure you knew what you're getting into. Took me a year just to get back to where I started.", "score": 1, "replies": [{"body": "I appreciate you sharing those lessons. Tesla is my first and only stock. It’s been a huge experience ", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "How can I capitalize on the Streaming Service Boom?", "selftext": "This week the Disney-Fox merger is going through. Due to this Disney's highly anticipated streaming service is anticipated to disrupt the entire streaming market. Not only is Disney launching their own, but Apple is slated to launch one as well. What I'm asking is how do I capitalize on this in the markets?\n\n&#x200B;\n\nI looked into the biggest CDN's (Content Distribution Networks) and found Century Link and Akamai to be the most dominant in their respective markets. Is there any other companies I should look at?", "id": "b8cslv", "created_utc": 1554169655.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 19, "comments": [{"body": "1: Century Link is fucked as a company, they still have not merged Level3 or TimeWarnerTelecom. Their books are shit for a reason.\n\n2: from carrier perspective CDN does not drive that much revenue. It is just a handful of circuits to and from major pops. \n\n3. Akamai - they have circuits from carriers around the world and the sell off small pieces of it and layer on some extra services. Major content providers like Disney, Netflix, HBO, etc is going to buy circuits from carriers and build their own. Smaller content providers use Akamai. Think of it as office space, small guys are going to short term lease in a building from a property management company, big guys like IBM Google Coke, etc are going to lease the whole fucking thing and operate it as their own skipping the middle man. Same with CDN.\n\n4. If you want to capitalize on the “boom” it is either the content company or the end point which is datacenter REITS or Cloud provider’s like AWS, AZURE, Google Cloud, Rackspace, etc.", "score": 15, "replies": [{"body": "Go deeper. MU $90C FDs, obviously. ", "score": 10, "replies": [{"body": "Mod this guy.  MU to moon. ", "score": 2, "replies": []}]}, {"body": "This person gets it. ", "score": 1, "replies": []}, {"body": "Netflix, Disney streaming, and amazon prime video all run on AWS.  I assume Apple will build out their own infrastructure.\n\nSo Amazon all the way baby!", "score": 1, "replies": [{"body": "All is a big word. I work in the space, and can say they have most in AWS but there is still some on their servers, and other providers. Putting 100% on one service provider is asking for a problem. Example: when AWS shit the bed for 8 hours in the South East you could still watch Netflix, it was running on another platform. ", "score": 2, "replies": []}]}]}, {"body": "Get a time machine.", "score": 7, "replies": [{"body": "What do I short so I can afford a time machine? ", "score": 3, "replies": []}]}, {"body": "NFLX puts... eventually. Their growth story is total BS imo. India is a market dominated by flipkart and cheap cheap prices; NFLX growth narrative is next 100M users from India but not only are yearly subscription prices the cost of ~1 month of NFLX in USA but it's a fairly saturated, competitive market. If NFLX growth starts slowing domestically bc DIS AAPL streaming then NFLX will sell off. Not to mention their debt. \n\nQuestion is both if & if so when will this be reflected?", "score": 3, "replies": [{"body": "Wrong on all accounts. Flip kart is India amazon, not Netflix. \n\nNetflix is India’s highest priced streaming services amongst over 5 incumbents AND amazon. And they are not dropping prices. Pricing power game is A mofo + (fwiw, when converted, India prices is about $7)\n\nTheir debt - if they stop spending today, they can pay off all the debt in 2 years if subs stay stagnant alas if today.\n\nYou’re right that growth has slowed domestically. Which I can’t quite place actually - which demographic is Netflix missing at this point? Is everyone else pirating? Too many account sharers? Where the hell are the rest of the 250 mil people in America?? \n\n", "score": 2, "replies": [{"body": "Wait, you said “Wrong on all accounts” and then said “you’re right...”", "score": 2, "replies": []}, {"body": "Uhh... I agree with you bud. Read my post again. I was saying exactly what you're saying. \n\nE: should have specified that nflx was most expensive of streaming in India. I was pointing out it's not only not economically feasible to produce original content in India but that flipkart dominates market at lower rates. Bit tired & dumb over here", "score": 1, "replies": []}, {"body": "Think about all of the multi person families that share one account", "score": 1, "replies": []}]}]}, {"body": "ROKU", "score": 3, "replies": []}, {"body": "All puts in Disney ", "score": 2, "replies": [{"body": "Seriously. This and Lyft are the meme stocks", "score": 2, "replies": []}]}, {"body": "Tim Apple \nAAPL. \nBuy calls", "score": 1, "replies": []}, {"body": "Data centers", "score": 1, "replies": []}]}
{"title": "Motely Fool: $TSLA $450", "selftext": "[deleted]", "id": "b8e4rd", "created_utc": 1554177504.0, "score": 9, "upvote_ratio": 0.85, "num_comments": 11, "comments": [{"body": "Acording to TSLA email 30k deliveries in 15 days was necessary. That means 2k deliveries per day every day. Assuming 5 deliveries per day needing 2 people per delivery (separate cars) you need 800 people. 8 deliveries per day = 500 people. Etc.\n\nWould the SEC investigate if we aspies overcame social incompetence all together and \"volunteered\" for Musk? Asking for a friend. ", "score": 10, "replies": [{"body": "I have calls for the 4/20 420$ I think we should reach there by then if the car deliveries are on track to beat the production , which it is so far from what I have seen.  They will probably deliver more than that but I don’t think it will move price much higher. ", "score": 10, "replies": [{"body": "$420?? I wish you the best you autistic bastard", "score": 11, "replies": []}, {"body": "Oh god you're red pilled too. We're fucked", "score": 8, "replies": []}, {"body": "I’m buying these just for the sake of 4/20\nAlso it would be cool if we could leave markets open a couple extra minutes (maybe just like 20) \nDoes anyone here have the nefarious capability to do that? ", "score": 2, "replies": []}]}]}, {"body": "OP on to something. Half of us apply for jobs at Tesla plants and the other half over hears information through the grapevine (reddit)\n\nThen we’ll switch after a year or two and everyone is a kazillionaire \n\nEdit: factories are automated so we could just trade all day ", "score": 7, "replies": [{"body": "I mean... this would work because i'm pretty sure there's 650+ fucking sperg losers on reddit in various locations (my *friend* included) willing to deliver cars for a couple weeks so they feel more assured in their yolo calls...? \n\nThe SEC would surely fuck us, no? My friend is very curious about this. ", "score": 2, "replies": [{"body": "The official law is it cannot be directly from a source. So if you heard it from a source, and told another friend, and they bought, that would not be insider trading. \n\nSo really the optimal schedule is groups of 1/4 WSBers that rotate quarter to quarter for a year ", "score": 1, "replies": [{"body": "What's all this about sources? My friend wants to volunteer to help save the planet with Model 3s. Is that a crime!? Does the SEC want us to burn a hole in the ozone?? ", "score": 5, "replies": []}]}]}]}, {"body": "It’s about not hearing information directly from the person with the insider knowledge\n\nGoing green is a valid humanitarian way of doing it lol", "score": 2, "replies": []}]}
{"title": "Enough DD for YOLO. Expecting a massive subscriber beat for Netflix. Want to see if there is a consenting group to play games with this", "selftext": "Netflix’s current subscriber count is ~139 million active paid subscribers. Last they reported, they had a healthy buffer of about 7 million subs signed to the 30-day trial. They’ll retain some percent of this. Honestly, I haven’t found a a number for how much they retain each quarter but 7 million sounds like a cushy cushion to me. \n\nNetflix reports Q1 earnings mid-April. Revised estimates expect to Netflix to come in at ~148 million PAID subscribers. I myself thought this was a stretch, but Netflix and the street feels fairly comfortable that they’ll do it. \n\nI looked deeper into at what Netflix was doing in India. Turns out only 500,000 of NFLXs mammoth subscriber count comes from India. They’ve been in India for 2 years now. And it’s not because streaming didn’t take off. The leading streamer, Hotstar (DIS owned) has >50 million subscribers. \n\nThe reasons for why this is and how Netflix is addressing it are not important now. \n\nOver the last ~4 months they started to run a pan-India promo which closes around this Q1 earning cycle. ‘Airtel’, India’s largest telecom provider by subs (330 million active subs) partnered with Netflix to give 3 months of free Netflix for having (not new sign-ups, HAVING) a post-paid connection with Airtel. Gave all of them instructions on how to sign up and picked up the check. My dad said, ‘just remembered I need to sign up cos the promo is ending’ \n\nMy theory is that Netflix comes out with blockbuster sub numbers. Not trying to say they signed 50 million people, but I think they are going to effing unexpectedly blow past the proverbial 150 million number and that’s going to looks sexy af. \n\nAnd Reed is smart. He likes money. He sees the opportunity and I think they timed this on purpose. Take care of himself and the shareholders. \n\nAbout me: Netflix shareholder. Blind faith in its long term success which directly correlates to mine. \n\nEdit: oops. So the point of all that. Anyone want to do calls with me? Pour water over my theory? Try to help me back it up? ", "id": "b8mqvd", "created_utc": 1554228572.0, "score": 39, "upvote_ratio": 0.93, "num_comments": 14, "comments": [{"body": "I think you underestimate the cheapness of us indians", "score": 32, "replies": [{"body": "I was shocked when I found that there were only 500k users over 2 years. ", "score": 2, "replies": []}, {"body": "And us Asians", "score": 1, "replies": []}]}, {"body": "Puts it is", "score": 13, "replies": [{"body": "If you were primed at the 139 number wouldn’t you have been sending notes to employees saying ‘I/We want to breakthrough this this time. All efforts go to this’? Feels right but could be ass", "score": 2, "replies": []}]}, {"body": "After leeching off my parents account for a few years, I finally started paying for my own account. I guess others my age will start doing the same. All in NFLX fo hunned Calls ", "score": 18, "replies": [{"body": "When did Netflix begin to throttle down the number of devices streaming at one time? I was on their website last night and saw the premium $15.99 gives you four screens, $12.99 gives you two. I remember. ..maybe not too long ago, my wife paying $9.99 and we had five family members streaming. I know as of now none of them have a subscription yet.", "score": 5, "replies": []}, {"body": "Agreed. There’ seems to always be a percent of users who convert to their own accounts as they grow older. I think this will continue for the foreseeable future at a small but steady pace. ", "score": 3, "replies": []}]}, {"body": "Back when I was a poor(er) man, I used to make netflix trial accounts using prepaid cards. Free netflix forever pretty much. Bet many of those 7 mil are like that.", "score": 3, "replies": [{"body": "In India? How old are you? What the the usage of Netflix like amongst your peer group? ", "score": 1, "replies": []}]}, {"body": "You mention that the estimates are for 148 million paid subscribers, wouldn't these new sign-ups be part of the free trial and therefore not counted as paid subscribers?  Maybe 3 months from now a percentage of them will convert and there will be a corresponding revenue boost.", "score": 1, "replies": [{"body": "The 3 month promo is ending just before the Q1 cycle for most participants based on my gauge. The converts should get booked in Q1 as paid subscribers against the 139 mil number at the end of Q4", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "You’re right. I turn up and turn down that percentage to fit my theory as needed. :) thanks ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "🤷🏽‍♂️ you tell me?", "score": 3, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "b8ocob", "created_utc": 1554236366.0, "score": 23, "upvote_ratio": 0.88, "num_comments": 11, "comments": [{"body": "\"Nuerodiverse\" that's one way to put it.", "score": 23, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Feminazis ", "score": 6, "replies": []}]}]}, {"body": "\"in its engineering, operations and compliance divisions\"\n\nSounds like they just want to exploit autistic people to do the job that no one wants to do at Goldman.", "score": 12, "replies": [{"body": "I know plenty of people who consider operations \"investment banking\" and have never even networked with an actual investment banker to learn the sad truth.", "score": 3, "replies": []}]}, {"body": "Lul I didn’t get the joke at first till I exited the article ", "score": 8, "replies": []}, {"body": "Mike Burry and Bill Gross are both autistic. This is Goldman’s PR spin on them trying to get genius autists to work for them", "score": 4, "replies": []}, {"body": "But not our kind of autism, the kind of autism that thinks.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "WSB checks one of those at least ", "score": 2, "replies": [{"body": "Yeah, we've got no arms. ", "score": 1, "replies": [{"body": "But do you have ONE arm?\n\nCheckmate atheist ", "score": 1, "replies": []}]}]}]}, {"body": "Imagine not getting the job and finding out some guy with autism got it...", "score": 2, "replies": []}]}
{"title": "So, lets see who bought AMD, it's hitting over $27.10 after hours. You guys know earnings is coming this month very soon right?", "selftext": "", "id": "b8oelc", "created_utc": 1554236632.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 17, "comments": [{"body": "it might even be worth it to buy shares now after-market. Oh the sweet puts I sold at $23/24,  and tomorrow I will be selling more puts at $25 and probably $26 as it goes higher.", "score": 3, "replies": []}, {"body": "My shares are gonna be called away REEEEEEE", "score": 1, "replies": [{"body": "what was your position again? I was mentioning to buy $27 strike calls.. and sell puts!", "score": 1, "replies": [{"body": "just a a few covered calls $27 expiring in 10 days. Probably buy back in tho", "score": 1, "replies": []}]}]}, {"body": "bro i've been long AMD since may 2016", "score": 1, "replies": [{"body": "Ok you are good!", "score": 1, "replies": []}]}, {"body": "I bought puts right at close. Fits right in with my style of trading ", "score": 1, "replies": [{"body": "Why? why short AMD when earnings are coming up 24th? for what?", "score": 1, "replies": [{"body": "I just like to lose money I suppose. The real answer is I was going to short them tomorrow morning because I thought there'd be a dip", "score": 1, "replies": [{"body": "Don't short, just sell puts or buy shares and wait for the 24th!\n\nIt's pretty obvious.", "score": 1, "replies": []}]}]}]}, {"body": "I hope this pumps to 28 so I can go all in puts again", "score": 1, "replies": [{"body": "You do that, and it will pump to $30. You do know this is AMD the meme stock of the century and 2 million bets on Robinhood stock right?", "score": 2, "replies": [{"body": "Well when those kids learn what eps means maybe it'll finally go back below 20", "score": 1, "replies": [{"body": "yeah, because bots and algos and hedgefunds and more care about eps.. AMD will go to 20 if the big boys saw a huge opportunity to take money from the 'kids', but so far, as you can see, that isn't happening.", "score": 1, "replies": []}, {"body": "So gosh, I guess AMD just is gonna pump up.. what a coincidence. You switching to calls yet??", "score": 1, "replies": [{"body": "Gonna go all in May 17 $26 puts kiddo", "score": 1, "replies": [{"body": "Go ahead and tie up capital and for nothing.. and wait..\n\nOr you can buy calls and shares now, and make money for the earnings.. You choose.\n", "score": 1, "replies": []}]}]}]}]}]}]}
