{"title": "Thoughts on Disney Eventually Buying-out Netflix?", "selftext": "[deleted]", "id": "bfrd0b", "created_utc": 1555868255.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 14, "comments": [{"body": "Never will happen. Disney already has HULU. Do you think they need to spend $150+ billion for Netflix’s subscribers and then pour billions a year to continue creating content? \n\nOr, spend 50 billion to create the best damn content possible for Hulu and offer it for $6.99/month and surpass Netflix sub numbers in 5 years?", "score": 9, "replies": [{"body": "Hulu is a way better streaming service compared to Netflix imo. I will OCCASIONALLY check Netflix to see if they have anything good, but all my favorite shows are on Hulu and it’s the exact same for all of my friends. No way Disney will ever buy Netflix, and even if they were to try, I guarantee it wouldn’t be allowed by anti-trust regulation as they are already such a major player in media.", "score": 2, "replies": [{"body": "The UI for Hulu ducks compare to Netflix. But again, DIS can pay top dollar to hire engineers and UI designers to revamp their interface. Much cheaper than $150 Billion.", "score": 2, "replies": []}]}]}, {"body": "Netflixs worth is only because of its subscriber base. I don't see any other value in it. They make content, but so does Disney. Netflix doesn't offer Disney anything in that regard.\n\nIf Netflix subscriber base goes down in the future, the more important question will be why. If it's Apple or someone else, Disney may consider buying Netflix, but Netflix will be struggling at that point so again, Disney may not buy.\n\nI only see a buyout as a favor to a struggling Netflix.", "score": 5, "replies": [{"body": "I see value in Netflix.  My smart tv even dedicates a button specifically to Netflix on the remote.  \n\nA lot of people see it as Netflix vs Disney, but I see it as streaming vs cable.  Both are cheap enough that you can get both and still come out ahead if you're a cable cutter.\n\nI plan to get both.", "score": 2, "replies": [{"body": "This is what I was coming in here to say", "score": 1, "replies": []}, {"body": "Netflix is cheap at 137 PE? It’s burning billions of dollars a year with many competitors on the way later this year and 2020. I like Netflix but I think the upside is limited compared to other options, Disney being one.", "score": 1, "replies": [{"body": "He meant that the service is cheap.", "score": 1, "replies": []}]}]}, {"body": "Netflix produces series and movies themselves that are permanently viewable on their service. Some are really great and will always be available to stream on Netflix while not on other services", "score": 1, "replies": [{"body": "So? There’s a moat or barrier to entry to create a good movie or series ? HBO on the other line for you.", "score": 1, "replies": []}]}]}, {"body": "Apple buys Netflix or Disney before your scenario happens.", "score": 3, "replies": [{"body": "really doubt Apple would spend 300B + on Disney.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "He said 3-5 years. I'm assuming the idea is that Netflix loses subscribers to Disney and therefore lowers Netflix's value. OP must be bullish on Disney taking a large market share from Netflix.", "score": 1, "replies": []}]}, {"body": "Why would they? Netflix needs Disney, Disney doesn’t need Netflix lol.\n\nNetflix is ded, old news.", "score": 1, "replies": []}]}
{"title": "Elon is posting anime girls. This has huge market potential. Weebs have the computer science money. Long $TSLA", "selftext": "", "id": "bfiz33", "created_utc": 1555805901.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 12, "comments": [{"body": "Wtf is this? Take this somewhere else. I cant understand why people who’re not interested in investing post here. Are the upvotes that important to you?", "score": 4, "replies": [{"body": "It's solid DD. I'm a rich weeb, and $TSLA is all us computer engineers can talk about", "score": -5, "replies": [{"body": "Fucking weeb stfu", "score": 3, "replies": [{"body": "Bruhhhhh it's 4/20.", "score": 1, "replies": []}]}]}, {"body": "Duuuude I'm 20k into $TSLA. Give me a break, I've gotten over 6k upvotes from WSB in the past 3 months", "score": -8, "replies": [{"body": "So, What does being 20k into Tesla have to do with it? It’s your money, choices you made...the rest of don’t want to see real posts crowded out by these low effort, generic, and bs posts. If you’ve got something funny or actually worth reading post it. If not you’re just being annoying, and your posts will probably keep getting removed. \n\nAnd what in the hell is a weeb\n\nEdit: nvm don’t tell me/don’t care", "score": 4, "replies": [{"body": "It’s a nerdy American who’s into anime and Japanese culture", "score": 2, "replies": []}]}]}]}, {"body": "OwO what's this?", "score": 2, "replies": []}, {"body": "He is ruining the magic with this web shit.", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Diss ain't no DD fam", "score": 4, "replies": [{"body": "I'm doing the MarketWatch thing. If tsla goes up I delete the short, if it goes down I delete this one. #GENIUS", "score": -2, "replies": []}]}]}]}
{"title": "The Pfizer call volume tells a different story ;)", "selftext": "", "id": "bfjqqi", "created_utc": 1555810931.0, "score": 29, "upvote_ratio": 0.85, "num_comments": 12, "comments": [{"body": "UNH gang ⚕️", "score": 13, "replies": [{"body": "Did you buy some? I want to this week", "score": 2, "replies": [{"body": "yep 230 sept calls I picked them up during the dips under 220", "score": 4, "replies": [{"body": "Nice buy", "score": 2, "replies": [{"body": ":) up 25% as of Thursday close but I am expecting this to keep moving back up now that Bernie's comments are out of the news cycle.", "score": 2, "replies": [{"body": "Yeah I knew that was noise, just didn't jump on it soon enough, I may get some shares :)", "score": 3, "replies": [{"body": "I may grab some Monday am. Mama mia those financials. Anything other than medicare for all and we're going thru the moon again.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I’ve been eyeballing some xlv calls", "score": 2, "replies": []}, {"body": "might being some REGN soon", "score": 1, "replies": []}, {"body": "wow WSB finally being logical", "score": 1, "replies": []}, {"body": "W", "score": 1, "replies": []}, {"body": "Noise. Time to start buying.", "score": 1, "replies": []}]}
{"title": "Potential trouble ahead for Boeing", "selftext": "[deleted]", "id": "bfkik4", "created_utc": 1555816144.0, "score": 22, "upvote_ratio": 0.88, "num_comments": 17, "comments": [{"body": ">\tthe factory, which makes the 787 Dreamliner, has been plagued by shoddy production and weak oversight that have threatened to compromise safety.\n\n____\n>\tSafety lapses at the North Charleston plant have drawn the scrutiny of airlines and regulators. Qatar Airways stopped accepting planes from the factory after manufacturing mishaps damaged jets and delayed deliveries.\n\n____\n>\tWorkers have filed nearly a dozen whistle-blower claims and safety complaints with federal regulators, describing issues like defective manufacturing, debris left on planes and pressure to not report violations. \n\n____\n>\tMr. Barnett, who filed a whistle-blower complaint with regulators, said he had repeatedly urged his bosses to remove the shavings. But they refused and moved him to another part of the plant.\n\n____\n>\tA spokesman for the Federal Aviation Administration, Lynn Lunsford, said the agency had inspected several planes certified by Boeing as free of such debris and found those same metal slivers.\n\nNot saying there will be problems due to their inattention to detail but a front page story is going to bring unwanted attention to Boeing. And the media reports haven’t been kind to Boeing’s stock recently.\n\n>\t“As a quality manager at Boeing, you’re the last line of defense before a defect makes it out to the flying public,” Mr. Barnett said. “And I haven’t seen a plane out of Charleston yet that I’d put my name on saying it’s safe and airworthy.”", "score": 8, "replies": []}, {"body": "Check my comment history.  My very first post on WSB was linking the local news story on this lawsuit in a daily discussion thread.  That was March 22nd and I wasn't sure if it would've been a n00b shitpost or not.  I guess I'm saying it's probably priced in but I'm really just trying to brag.", "score": 3, "replies": [{"body": "Oh, and I worked for several airlines at CHS airport beginning before Boeing first opened.  You'd be amazed at some of the fuckoffery  among the ground crew and baggage handlers.  I mean pilfering bags is expected but one mofo was stupid enough to pry open a checked gun case and steal a firearm... ATF was there on the next flight.  Stealing mini bottles from the plane, operating the jet bridge drunk, smoking weed in the parking lot while the airplane is taxiing to the gate... THESE PEOPLE COULDN'T WAIT TO GET JOBS AT BOEING WHEN THEY FIRST OPENED!\n\nedit: pilfering bags, not pillaging lol", "score": 4, "replies": []}]}, {"body": "I’m a mod", "score": 2, "replies": []}, {"body": "*Flagged as DD..\n*link to NY Times.. \n“Shouldn’t this be shitpost?”", "score": 5, "replies": [{"body": "...", "score": 2, "replies": [{"body": "That's like saying Jim Kramer is great at picking stocks.", "score": 8, "replies": []}, {"body": "No lol", "score": 1, "replies": []}, {"body": "NYT is MSM and shouldn’t be trusted.", "score": -7, "replies": [{"body": "But you trust them enough to try for a copy paste repost lmao\n\nhttps://www.reddit.com/r/wallstreetbets/comments/bfl6oa/ba_massive_coverup_horrifying/\n\nEdit: Wait a second your comment in that post was an Apple News link that redirects to NYT - maybe you really are just a weapons grade retard who didn't even realize where the article was from", "score": 12, "replies": [{"body": "R/rareinsults", "score": 2, "replies": []}]}]}]}, {"body": "Yes.", "score": -1, "replies": []}]}, {"body": "Relax bucko, I feel like you’re defending NYT from criticism no ones made on this thread. I’m just simply noting that saying reading a NYT clickbait article is about as much due diligence as saying “buy gold” because Ben Shapiro said so", "score": 3, "replies": []}, {"body": "I'm gonna call schwab money to bitch about all the money I would've made if they had let me sell naked BA calls like I asked 5 times already", "score": 1, "replies": []}, {"body": "Two planes drop, months of analysis everywhere and NOW there is trouble ahead?", "score": 1, "replies": [{"body": "....", "score": 1, "replies": []}]}]}
{"title": "One of Tesla's most impressive refreshes to-date.", "selftext": "", "id": "bfp4y1", "created_utc": 1555855544.0, "score": 163, "upvote_ratio": 0.96, "num_comments": 12, "comments": [{"body": "Being near Elon Musk for long periods of time makes you absorb plastic surgery and botox through osmosis", "score": 36, "replies": []}, {"body": "He took the Mazda logo into the Tesla logo", "score": 29, "replies": [{"body": "Well, now I can't unsee that", "score": 12, "replies": []}, {"body": "I don't think he had anything to do with either logo. \n\nMazda is some sort of ancient guy with wings who flew in the slow lane, and the Tesla logo was taken from a [cross-section of an electric motor.](https://electrek.co/2017/01/24/tesla-logo-cross-section-electric-motor/tesla-logo-1/)", "score": 8, "replies": []}]}, {"body": "Wow", "score": 1, "replies": []}, {"body": "I'd like for him to put a deposit on me if chu know what I mean.", "score": 1, "replies": [{"body": "Flair checks out", "score": 4, "replies": []}]}, {"body": "Elon ought to forget all these businesses. Plastic surgery, hair restoration, styling consultant could be his real trillion dollar business.", "score": 1, "replies": [{"body": "He doesn't really care about anything other than dying of autoerotic asphyxiation on Mars.", "score": 2, "replies": []}]}, {"body": "CMV model 3 is just Mazda 3 if he stayed with Mazda", "score": 1, "replies": []}, {"body": "Holy shit thats him", "score": 1, "replies": []}, {"body": "Who was he before Mazda?...nobody\nAfter Mazda? ...a has been... Very rarely do these guys have a second wind.\n\nThere was a good branding on giving all Mazdas the same recognizable curves and knock off the look of bmw", "score": 0, "replies": []}]}
{"title": "Trading the run up to earnings!", "selftext": "Hey, long time autist, first time posting. I just wanted to know my fellow August’s opinion on trading a stock the day they release earnings but not holding it through to the next day. What I’ve realised is that a lot of stock will go higher on the day of earnings mainly because of buzz. I recently tried this with NFLX by holding it 2 days prior earnings. As you may know, it rallied up to the earnings call but was flat the next day due to weak guidance. I’ve also done some backtesting and have seen many big tech names go through this pattern, what do you guys think of this and is it a more viable method than trading the earnings themselves?", "id": "bfthpy", "created_utc": 1555879997.0, "score": 17, "upvote_ratio": 0.9, "num_comments": 10, "comments": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Yeah Ive decided that I’ll use a 1k account to try this method", "score": 5, "replies": []}]}, {"body": "I generally agree with your observations, but the premiums on options are so high that the run ups don't really translate into significant gains. \n\nIn a related observation, after the little run ups, during the last hour or so before close is when profit taking/sidelining happens, and the bid/ask spreads widen.", "score": 7, "replies": [{"body": "Thanks for the input, but I don’t do options, so it still checks out", "score": -7, "replies": [{"body": "Maybe try buying calls a bit further out but that expire close to earnings. So the volatility isn’t crazy high yet, and it’s not too expensive. Would have to find the sweet spot between time to expiration and IV though. But it could be more profitable than just shares", "score": 0, "replies": []}]}]}, {"body": "The proper way to do this is called a \"Delta neutral\" strategy where you benefit from IV run up around earnings without taking an actual position on the movement of the underlying. \n\nOr you gamble.", "score": 7, "replies": [{"body": "Agree. Straddles 3 weeks out is a good one. Or ICs with wide short strikes", "score": 3, "replies": []}]}, {"body": "Yes, personal experience has taught me that trading the run up is beneficial, but I will typically close my position prior to the actual ER. \n\nI’ve also found that day trading the big movers can be profitable, after earnings are released. I mainly deal in options, so it gives me the opportunity to profit on beats and misses. \n\nAn example of the above - XYZ beats estimates and rockets out of the gate. If the trade meets my criteria, I’ll buy calls and sell when I see a reverse (typically within the first hour of open). At the same time I’ll look to enter a short position that I’ll hang on to capitalize on the pull back.", "score": 2, "replies": []}, {"body": "It's a viable strategy that works when it happens but like all things a run up is never guaranteed. The whole market is in a nice euphoric uptrend right now making run ups much more likely so just be mindful of the macro market when executing this.", "score": 2, "replies": [{"body": "BB last mouth, shorts lowered the stock almost 10% over 2 weeks leading into earnings.", "score": 1, "replies": []}]}, {"body": "Nflx my fd calls went from 1.38 to 3.02 and sold before the bell.", "score": 1, "replies": []}]}
