{"title": "Netflix adds 8.7 million subscribers in Q4, crushing estimates; net income more than quadruples from the year-ago period; revenues surge 30%", "selftext": "", "id": "esh3dh", "created_utc": 1579722599.0, "score": 392, "upvote_ratio": 0.97, "num_comments": 65, "comments": [{"body": "Annnd they're still red today.", "score": 92, "replies": [{"body": "Quote from xpost:\n\nHere are the real highlights:\n\n•\t⁠Proceeds from issuance of debt: 2.23 billion\n\n•\t⁠Cash flows from operating activities: -1.46 billion\n\n\n\n\"net income more than quadruples\" is because of a one time tax credit", "score": 50, "replies": []}, {"body": "Since when have stock prices been tied to fundamentals?", "score": 32, "replies": [{"body": "80 PE is sound fundamental.", "score": 26, "replies": [{"body": "Actually maddening they are that high to me, obviously people most know more about something than me", "score": 6, "replies": []}, {"body": "Fundamental? More like fun for the mental, amirite?", "score": 5, "replies": []}, {"body": "About 3x higher than Apple which just ramped up its own streaming service.", "score": 4, "replies": [{"body": "Yeah but it sucks", "score": 2, "replies": []}]}]}, {"body": "Right before /r/wallstreetbets was created.", "score": 8, "replies": []}]}, {"body": "They need another stranger things type of success", "score": 2, "replies": []}, {"body": "I’m honestly really confused about this, was there something else in the ER that caused this sell off? Could just be algos doing wacky shit but what do I know lol.", "score": 3, "replies": [{"body": "Market already priced in the earnings beat, but expected NFLX to report even better than they did. #hypetrain", "score": 6, "replies": [{"body": "Oh ok, makes sense I guess. Didn’t they also have lower sub growth or smthg too? I heard that as well but don’t know the deats.", "score": 0, "replies": [{"body": "Yes their domestic sub growth took a hit while international rose. However investors are concerned because the streaming war fears have been confirmed.\n\nIt seems like Disney and Apple can take away from Netflix’s market share.\n\nBright side if you are a Netflix investor, look at all the movies that won awards or got nominated. Netflix has a lot of them lol they have become a full fledged movie studio with the accolades from Hollywood to show for it.\n\nDisney and Apple have the means, but can they also perform like Netflix? Investors say: probably", "score": 5, "replies": []}]}]}, {"body": "if good or beat of numbers would mean stock would go up, everybody would be rich and we would only be trading this.", "score": 1, "replies": []}, {"body": "Growth driven by international markets, not mature markets so it doesn't really mean much", "score": 1, "replies": []}]}, {"body": "And then what happened?", "score": 1, "replies": []}, {"body": "Guessing new subs are through partnerships with companies like T-Mobile. I get a free sub with my plan. Netflix is still shit and will continue to be shit.", "score": -4, "replies": []}]}, {"body": "Still in massive debt and losing a ton of content this year from major studios.", "score": 21, "replies": [{"body": "They are but the competition still cant touch them. I have every streaming service know to man I think so can confirm...always go back to Netflix.", "score": 11, "replies": [{"body": "this is the truth here.  No other streamer is close to what netflx fas even without others content, including dis plus.", "score": 8, "replies": []}, {"body": "Disney just stole the entire kids and family market from them though. NBC is launching their service and taking The Office back, which was Netflix’s #1 streamed piece of content by far. Netflix can survive if they have a couple huge original hits, but so far they’ve struggled on originals. We’ll see. I personally think Netflix is going to fall this year and Apple might buy them when the price is right.", "score": -11, "replies": [{"body": "How do we know that The Office wasn't as popular as it was because of how convenient Netflix made it? It certainly wasn't this popular when it was airing.", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I mean I know if was. But not to the hype it is now imo. This is coming from someone watching it from season 1 airing.", "score": 2, "replies": [{"body": "You’re out of your frame of reference. The office has always been incredibly popular. It’s just amplified to you bc you see office memes on Instagram it’s like you’re surrounded by people that always watch the office. \nIt’s like saying Star Wars wasn’t popular until baby yoda. Fair observation bc that baby yoda is literally everywhere. But it’s not a true observation. Out of your frame of reference.", "score": -1, "replies": [{"body": "I wonder how much of your thinking is off hard numbers versus how popular it seemed. Was The Office popular? Yes. Was it as popular as the top spot in Netflix suggests? I don't think so.\n\nFor reference, here's the viewership of The Office. The Office during it's prime was between 8-10 million a season not even breaking 10 after the first season based off of Wikipedia figures. Then you go to a show like The Big Bang Theory and you see that after season 2 they are doing at least 13 million a season go up to 18/19. Then you have Friends that did over 20 million every season. Both these shows are before and after The Office with better numbers. \n\nI routinely went to Wikipedia when I was watching shows and would see these figures while reading summaries. So like I said, The Office's viewership did not suggest its popularity as close as a show like Friends.", "score": 1, "replies": [{"body": "Breaking Bad is a better example of a show that’s popularity increases directly as a result of Netflix streaming availability.", "score": 1, "replies": [{"body": "I don't know if you can stay that without a real study.\n\nFor example, Netflix increased people's accessibility to Breaking Bad since AMC isn't a public network.\n\nThat and you didn't address any of my viewership numbers. There's obviously more to it than that but it's something.", "score": 1, "replies": []}]}]}, {"body": "Yeah you must not have kids in middle and high school. They are obsessed with The Office to the point where my son and his friends have watched all 8 seasons three times through... Where were they when Office aired originally? Yeah, they werent born yet so absolutely Netflix has made it even more popular than it was.", "score": 1, "replies": [{"body": "Just bc your kids watch the office all day doesn’t mean Netflix has made it more popular. There are other variables in play. Instagram and Twitter is flooded with memes. Memes about the office where practically heiroglyphs to your kids. Then they became old enough to watch the office, and they gained a frame of reference for all the office content they saw online as young kids but never understood.\nThere’s way more to the offices popularity than Netflix.", "score": 0, "replies": [{"body": "You seem like one of those guys who always has to be right no matter how much he's losing.", "score": 1, "replies": [{"body": "What am I losing lol it’s a convo on reddit. \nYou seem like one of those guys that’s just a loser.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Netflix has tons of kids shows, my kids watch netflix more than D+, we have both.", "score": 2, "replies": [{"body": "But watch this year as they start to fall off the platform, I work in the industry. Netflix is going to have a tough 2020 and 2021. They do have a lot of kids content but the well known brands are going to move off Netflix this year as licenses expire.", "score": 1, "replies": []}]}, {"body": "My kids and their friends in middle and high school all got Disney+ on goading their parents. They've all kinda run their course on it and are back on YoutubeTV and Netflix, pretty much after Mandalorian finished. Sure the toddler demographic parents will keep it for all the animated classics to babysit their kids with but the preteen through teen demo are moving back.\n\nNetflix has some VERY huge hits, where you been? The Irishman, Stranger Things, Ozark? Theyre dumping BILLIONS into original programming, far more than any other service so there's a lot more coming.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 31, "replies": [{"body": "Isn't that what Facebook was accused of shortly after their IPO? Also remember they were counting accounts that had been deleted and accounts known to be fake and even \"anticipated\" accounts in countries they were about to open markets in.", "score": 11, "replies": [{"body": "A better known example IMO is Wells Fargo opening up new accounts without peoples permission.", "score": 1, "replies": [{"body": "I worked for Wells in the '90s and was there as a business and personal banker/loan officer. I always asked permission but I can see how that happened. Wells had a reputation for very aggressive sales goals and had very high turnover rates for their officers. You didn't meet your goals you were replaced by someone younger and hungrier fresh out of college. Also being California in the '90s, there was an inordinate amount of grads pumping out like an oil gusher to replace us at any moment. It was some of the most stressful times of my life.\n\nWells was a glorified car dealership sales dept.", "score": 1, "replies": [{"body": "Thanks for the insight... funny how cultures of companies can completely undermine what should be a healthy, growing business.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "the concern has always been the debt. eventually they will have to deal with that and cant keep financing everything with debt. which is a shame because i dont give a fuck about disney", "score": 12, "replies": [{"body": "Jerome Powell wants to make sure dealing with that debt takes place as far as possible in the future as possible though.", "score": 2, "replies": []}]}, {"body": "Less sub growth. It’s not exaggerated at all. They’re like AOL. Looks like they’re never going to die but eventually they’ll be everything people look back to laugh at.", "score": -2, "replies": [{"body": "AOL had no content.  Netflix is now a content creator.  I can't see them going away- but maybe a pivot in strategy?", "score": 6, "replies": [{"body": "They're a content creator but their stock isn't being priced like a content creator. Netflix the company may be doing great. But the stock is over priced right now.", "score": 1, "replies": [{"body": "I agree, I just don't see where their growth is going to come from.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Mid 30's. They have properties like Engadget and Huffington Post.  But in the context of the post, they didn't offer a service that people widely wanted to continually pay for, hence a decrease in subs.  So relative to netflix... No content", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So you were one of the suckers that actually payed for their shit...AOL time Warner owned once they bought Time Warner and other media companies, but I get your point, they have content vaulted away.  Thanks for your rude response though, that was cool.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Damn you got me, I'm just an idiot that knows nothing.  You happy that you now have a victory on Reddit?  You just be ecstatic.  You are now a man.  Go forth and do something with your new found glory, way to go... Jeez kid.", "score": 1, "replies": []}, {"body": "Oh and Happy New year to you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tbh I feel like the quality of their original content is worsening. I don’t even use Netflix anymore, I personally find Hulu has better shows.", "score": 1, "replies": [{"body": "They literally just produced the Irishman lol. Scorsese and DeNiro in a Godamn netflix produced movie. Think about that for a second.\n\nI think they’ll be fine becoming a full fledged movie studio, but their growth is definitely going to take a hit.", "score": 5, "replies": [{"body": "I didn’t say they stopped making good movies just that there’s a lot of shitty ones on there now. Netflix will pretty much green light anything, but yea I agree they’ll be fine for the time being.", "score": 1, "replies": [{"body": "Here’s my thoughts whenever someone says “why do they pump out so much content, it’s like they’ll make anything these days.” \n\nIf they greenlight everything then maybe they’ll be able to have content for every demographic, so whoever you are. Netflix has the content for you, and as you keep watching the algorithm perfects exactly the type of stuff you want to see.\n\nWhile companies like Disney (kids) and Apple (HBO-esque) go for niche viewership maybe Netflix wants to be a “one size fits all”\n\nJust a thought, 100% an assumption based on zero facts.\n\nEdit: doesn’t want to -> wants to", "score": 2, "replies": [{"body": "That’s true but in the end you kind of have to sift through a lot of different shows and movies that aren’t appealing to you until you find what you like, although their recommendations algorithm might solve that problem. Regardless, personally I just havnt liked using Netflix in a while since I’m a pretty big adult animation fan and Hulu pretty much has all of the best ones (Bojack Horseman being a notable exception).", "score": 2, "replies": []}]}]}]}]}, {"body": "Oh boy, there's actually someone out there that thinks netflix has or is gaining content", "score": -3, "replies": [{"body": "Are they not making content with all that debt?  The quality is a different story.  That being said, I have actually enjoyed a lot of their documentaries.", "score": 4, "replies": [{"body": "Yes, they obviously made some things with their truckloads of debt, and some of them are enjoyed by some people. Meantime, they lost so many good shows and movies that I can hardly find anything worthy of a watch on the platform, and I'm of the easy to placate occasional viewer kind. Every time I login it's just worse and worse and worse.", "score": 0, "replies": []}]}]}, {"body": "Their content is 3rd rate unfortunately", "score": -2, "replies": []}]}]}]}, {"body": "Debt and cash-flow still the issue. Tesla has shown signs of being CF positive. With Netflix, that's still an issue, with straight debt rising.   \n\n\nNot just that. Their accounting practice and depreciation policy regarding new content spending have changed in recent quarters. Depreciation costs are lower as a result and earnings are being pushed up. The distance between reported earnings and burned cash is on the rise tho. Something gotta give. Analysts hope still lies mostly in subscribers' growth. We'll see if by the time that slows they will actually be able to be a cash machine rather than a cash-burning machine.", "score": 5, "replies": []}, {"body": "how's the taste of koolaid, OP?", "score": 2, "replies": []}, {"body": "They raising rates again? \nMy magic 8 ball keeps showing 'Yes'", "score": 1, "replies": []}, {"body": "why does this headline sound familiar to me?\n\nOh, I know, because I wrote it and posted it in r/stocks.\n\nImitation is the sincerest form of flattery.  Thanks for spreading the word.", "score": 1, "replies": []}, {"body": "This is the opposite of what I heard happened.", "score": 1, "replies": []}, {"body": "That's nuts. I wonder if Disney will ever get to $300+ a share. I also sent you a message EducationUmbrella", "score": 1, "replies": []}, {"body": "Just my luck/stupidity that I went short (and levered) before earnings and made a nice loss the next day :/", "score": 1, "replies": []}]}
{"title": "Tesla reversal is coming very soon.", "selftext": "Crossed 100B today, more than VW market cap who sells 12m cars a year compared to tesla 367K.\n\nTesla will need to grow 50% for the next 10 years to even get close to any numbers as VW. \n\nWe will go back below 450 in the next 3-6 weeks. It was 510 1.5 days ago and 402 at the end of last year. \n\nI am loading leap puts for Jan 2021 400 strike.", "id": "esdfks", "created_utc": 1579706416.0, "score": 5, "upvote_ratio": 0.56, "num_comments": 62, "comments": [{"body": "https://www.usa.gov/food-help\n\nYou’ll need it", "score": 49, "replies": []}, {"body": "I would agree with this, but Tesla does not abide by normal laws of valuation.   Good luck OP your balls are bigger than mine", "score": 39, "replies": [{"body": "> Tesla does not abide by normal laws of valuation.\n\nAgreed, the Tesla aluation isn't really based on current financials/numbers but rather a vision for the future.", "score": 4, "replies": []}, {"body": "Did you just call OP balls?", "score": 1, "replies": []}]}, {"body": "Lol post back here when your puts fail.", "score": 58, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It only took a global pandemic. Tesla will rally stronger than ever when this is over", "score": 1, "replies": []}]}, {"body": "I know. I’m thinking Screenshot your short position or STFU", "score": -7, "replies": [{"body": "You don't have to take a position to comment on valuation/overvaluation.", "score": 6, "replies": [{"body": "Talk is cheap.", "score": 4, "replies": [{"body": "And yet Reddit is all talk...", "score": 4, "replies": []}]}, {"body": "Oh ok. Cool let’s talk about nothing important than. \n\nWhat does everyone think is the funnest ticker symbol ?", "score": -2, "replies": [{"body": "YOLO - Some weed thing", "score": 3, "replies": [{"body": "I do not know a thing about this company, but I hate it with every fiber in my body because or it’s ticker.", "score": 1, "replies": [{"body": "What of theyre using it ironically?", "score": 2, "replies": [{"body": "I don’t care, I was happy when I thought the saying died out.", "score": 2, "replies": [{"body": "You old? You want to kill slang fast? Be old and use the slang. Kids'll drop it faster than when it is hot. (That's a Snoppy Dog reference)", "score": 2, "replies": [{"body": "I don’t think I’m old (34)... but I do think I need to do this. I adopted one of my nephews haircuts once and the next time I saw him it was magically different.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I think the Cheesecake Factory's symbol of CAKE is pretty good.", "score": 2, "replies": [{"body": "Hahaha. CAKE!\n\nThis is now a party.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not buying puts. But I feel bad for the people that’s buying now. The stock is up 3-4-5-6% every day for no reason. That is a massive red flag where the stock is completely decoupled from the fundamentals of that business., and is trading solely on sentiment.", "score": 10, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Good thing I trade businesses and not stocks. Helps me sleep at night.", "score": 1, "replies": []}]}, {"body": "$TSLA is still one of the most shorted stocks there is. And shorts keep buying back in whenever the price goes up.\n\nAnd then it goes up even more... I wonder how long this cycle can continue? Shorts are fodder feed for the bulls.", "score": 4, "replies": []}, {"body": "Maybe so but I still think this is a great long term hold that people will look back on in ten years the same way we look back on Amazon & Apple now. I believe Musk can deliver on everything he is saying. One day soon most taxis and logistics vehicles will be self driving and electric and I believe that Musk will be the one of the greatest innovators of this century. Tesla is only just getting started. By 2030 this stock will be $4-6k so now is still a great time to buy", "score": 2, "replies": []}, {"body": "Is the same thing happening to Virgin Galactic?", "score": 1, "replies": []}, {"body": "The decoupling was from idiotic short sellers who are now covering at massive losses.", "score": 1, "replies": [{"body": "Ok what happened between yesterday and today to make it go up 7%?", "score": 3, "replies": [{"body": "Short covering is still occurring. It is the second most shorted stock in the US market.", "score": 2, "replies": []}, {"body": "Daimler profits 50% down\nhttps://www.wsj.com/articles/daimler-faces-further-emissions-hit-as-earnings-sink-11579685176", "score": 2, "replies": []}]}]}]}, {"body": "It’ll be worth a trillion in 10 years.", "score": 18, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "I will be messaging you in 9 years on [**2030-01-22 15:38:39 UTC**](http://www.wolframalpha.com/input/?i=2030-01-22%2015:38:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/esdfks/tesla_reversal_is_coming_very_soon/ff98usi/?context=3)\n\n[**14 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fesdfks%2Ftesla_reversal_is_coming_very_soon%2Fff98usi%2F%5D%0A%0ARemindMe%21%202030-01-22%2015%3A38%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20esdfks)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Let us pray.", "score": 2, "replies": []}, {"body": " !RemindMe 10 years", "score": 1, "replies": []}]}, {"body": "People were shorting Tesla back at $200/share\n\nSome people actually see the long term vision though", "score": 13, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol who woulda thought this pandemic crash would happen, esp so quickly", "score": 2, "replies": []}]}]}, {"body": "In the next 3-6 weeks, chances are it'll be over $700 or even $800.", "score": 14, "replies": []}, {"body": "I can't believe this stock just continues to rise. When do we see the reversal haha. I totally wish I bought when it was sitting at 268.", "score": 2, "replies": []}, {"body": "I completely agree with you. Tesla may deserve this valuation in 10 years if everything pans out perfectly. But now? With so many uncertainties and risks?", "score": 2, "replies": []}, {"body": "Yet again people need to remember Tesla isn't a car company", "score": 3, "replies": []}, {"body": "I'm bullish on Tesla long term but this run up is not healthy. I bought a $420 strike put for June.", "score": 1, "replies": []}, {"body": "$1000 per share inc", "score": 1, "replies": []}, {"body": "!RemindMe in 2 months", "score": 1, "replies": []}, {"body": "You're forgetting about the power business. That could be as big as Tesla is today on its own.", "score": 1, "replies": []}, {"body": "When will shopify reversal start?", "score": 1, "replies": []}, {"body": "Gluck buddy", "score": 1, "replies": []}, {"body": "Tesla is a not only an automaker, it acts on following businesses:\n\n\\- electrified computer over wheels (include here they have their own appstore)\n\n\\- power generation (solar city)\n\n\\- power storage (non auto batteries)\n\n\\- power charging (super chargers networks)\n\nTesla has following advantages against \"competition\": \n\n\\- many years ahead in battery technology\n\n\\- strongest branding\n\n\\- leading innovation in design and technology\n\n\\- FSD (over 1000 times more data than others)\n\n\\- does not have legacy on combustion \n\n\\- best car safety grades in the world\n\n\\- a well established EV in EVERY segment\n\n\\- does not spend on marketing (biggest fan base in the world)\n\n\\- list goes on...", "score": 1, "replies": [{"body": "Remind me! in 2 years", "score": 1, "replies": [{"body": "**nycbay** 📈, your reminder arrives in **2 years** on [**2022-01-23 15:22:30Z**](https://www.reminddit.com/time?dt=2022-01-23 15:22:30Z&reminder_id=d86c2573af76485b8c2babe82f8d7367&subreddit=stocks). Next time, remember to use my default callsign **kminder**.\n\n> [**r/stocks: Tesla_reversal_is_coming_very_soon**](/r/stocks/comments/esdfks/tesla_reversal_is_coming_very_soon/ffc6xj6/?context=3)\n\n> kminder in 2 years\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=kzreminderbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202022-01-23T15%3A22%3A30%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fstocks%2Fcomments%2Fesdfks%2Ftesla_reversal_is_coming_very_soon%2Fffc6xj6%2F) to also be reminded. Thread has 6 reminders and 1/3 confirmation comments.\n\n^(OP can )[^(**Delete Comment**)](https://reddit.com/message/compose/?to=kzreminderbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%20d86c2573af76485b8c2babe82f8d7367) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=kzreminderbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%20d86c2573af76485b8c2babe82f8d7367) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/d86c2573af76485b8c2babe82f8d7367) ^(·) [^(Update Time)](https://reddit.com/message/compose/?to=kzreminderbot&subject=Update%20Reminder%20Time&message=updateReminderTime%21%20d86c2573af76485b8c2babe82f8d7367%0Ain%202%20years%0A%0A%2AReplace%20reminder%20time%20above%20with%20new%20time%20or%20time%20from%20created%20date%2A) ^(·) [^(Update Message)](https://reddit.com/message/compose/?to=kzreminderbot&subject=Update%20Reminder%20Message&message=updateReminderMessage%21%20d86c2573af76485b8c2babe82f8d7367%20%0Akminder%20in%202%20years%0A%0A%2AMessage%20is%20on%20second%20line.%20Message%20should%20be%20one%20line%2A) ^(·) [^(**Add Timezone**)](https://www.reminddit.com/user/setTimezone?source=reddit&username=nycbay) ^(·) [^(**Add Email**)](https://reddit.com/message/compose/?to=kzreminderbot&subject=Add%20Email&message=addEmail%21%20d86c2573af76485b8c2babe82f8d7367%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A)\n\n**Protip!** You can customize `kminder` with suffixes such as `.a` to hide name from confirmation comment. More details are on website. e.g. `kminder.a 1000 years`\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=kzreminderbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=kzreminderbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=kzreminderbot&subject=Feedback%21%20KZReminderBot%20from%20nycbay)", "score": 1, "replies": []}, {"body": "- electrified computer over wheels (include here they have their own appstore)\n\nHow much do you anticipate people spending on AppStore ? \n\n- power generation (solar city)\n\nthee one company which was about to default 3 years agi and elon saved his cousin. Solar city is dead biz, just try to get quotes for solar city vs other solar companies for your home system. \n\n- power storage (non auto batteries)\n\nTesla does not even make even cells, they just assemeble.  Very niche market with no edge.\n\n- power charging (super chargers networks)\nthe one that lose money. how would they ever make money ?", "score": 1, "replies": []}]}]}, {"body": "Tesla sells a lot of other stuff besides cars..", "score": 1, "replies": []}, {"body": "I agree, it's in a huge bubble right now.  Eventually they are going to have to come down to Earth at some point.  There's no justification for 100B market cap.  \n\nI'll give credit where credit is due.  \n\n\\-They made cars (this is incredibly hard to do)\n\n\\-They seem to have made it in the clear where they aren't going bankrupt\n\n\\-They are dominant in their space (the Leaf has sold pretty well at 400k units but that's about the only other electric worth mentioning)\n\nBut to put them up past VW & BMW just seems insane, especially given the investments that VW & Ford are making, with new models on the horizon which will be the first time Tesla sees actual competition.", "score": 1, "replies": [{"body": "I feel that Tesla is not really competing against the German or Japanese carmakers in Asia... it will be competing for the Chinese market against Chinese EV makers.. now the American market I am not so sure about though.", "score": 1, "replies": []}]}, {"body": "Tesla doesn't sell \"vehicles\". They sell EVs. VW sells dog shit. GM, Ford....all of them sell garbage. Make a post when the competition actually sells EVs, then compare the numbers.", "score": -1, "replies": [{"body": "EVs require less engineering and are easier to get into? Chinese and other Asian EV makers moving fast will outsell Tesla a bit like Samsung and Xiaomi in phones?", "score": 2, "replies": [{"body": ">EVs require less engineering and are easier to get into? \n\nNot when you have a legacy business.\n\n> Chinese and other Asian EV makers moving fast will outsell Tesla \n\nThis will be true in Asia but not NA or EU", "score": 1, "replies": [{"body": "But are they competing for replacement car market or new car market.? I M O the American car market will move very slowly to electric .. too slowly to justify this valuation and will allow competition to catch up... There is certainly no central authority mandating electric cars by 2030 which there is in China. I think this surge in Tesla is premised entirely on the Chinese market.", "score": 1, "replies": []}]}]}]}, {"body": "Post position or BAN", "score": 0, "replies": []}, {"body": "grow 50 % in 10 years, doesn't sound difficult for Tesla. They just created a new gigafactory and are creating another one already...", "score": -1, "replies": [{"body": "The post meant 50% per year for the next 10 years", "score": 9, "replies": [{"body": "The post also ignores that trash tier combustion sales at VW will fall every year as EVs become their new product. Their volumes will not be replaced 1:1 overnight. They will have to prove to the market that their EVs are worth it.", "score": 2, "replies": []}]}]}]}
{"title": "Earnings and IV Crush", "selftext": "A lot of new faces here so I thought I’d let you gays know what the fuck is up. \n\nOkay, imagine a stock is that hot dick you matched with on Grindr.  For this example, you’re trying to get that McDonald’s dick (MCD).  You’re chatting and he says he wants to meet to give you that MCD on 1/28.  You’re fucking pumped, I mean this dude has everything and his pics are amazing.  1/28 is the day it happens and what a glorious dick-down you’ll receive on that day.  This is the (earnings) date.  \n\nFor the next couple weeks, your dick is pumpin harder every minute with anticipation of a pink sock from your fuck boi.  Your tiny pp growing is also known as implied volatility (IV).  It grows substantially before the MCD (earnings) date. \n\nFast forward to 1/28. You’re so god damn excited, you’re walking around with rager like a kid that just saw his parents fucking.  And then it happens, you finally see your Grindr date at 4:15 pm.  Now, something terrible happens to your libido; it drops. Why? Well, as my father used to say - “behind every hot guy, is a guy tired of fucking him.”  Your little pen cap is crushed (IV) and flaccid.  \n\nApproximately 2 weeks before ER, the IV starts climbing and will immediately crush after the report.  This is inevitable.  If you don’t understand why, try looking up the definition of IMPLIED.  \n\nSo how do you use protection with your soy boy to ensure you get as much MCD as possible?\n\nBuy 2 weeks before and hope it goes in your direction, sell right before earnings. And not a day or two, minutes before.  Straddles work well too. \n\nSay you forgot about the MCD and you want to get in day of?  The safest play would be iron condors or flys to collect some premium.  The next best play is selling contracts but those could end horribly.  And finally, you could straddle.  With this play, you’re hoping the intrinsic value offsets your FOMO autistic ass.\n\nWhat happens the day after you get that delicious clown dick?  The IV is minimal so you could hop in with very cheap premium and ride any post ER wave, guilt free. \n\nStop asking why your yolo FDs are worthless the next day.  They’re worthless because you’re worthless and you got dicked down by a big red Grindr Penis.\n\nEDIT: I omitted buying longer dated options bc we’re all men here but if you did find yourself with a labia, you could offset higher IV by buying longer dated options.  It works to a certain extent but you’ll still experience IV crush, just not as bad.", "id": "es4ebf", "created_utc": 1579655261.0, "score": 255, "upvote_ratio": 0.97, "num_comments": 59, "comments": [{"body": "Hell I thought this was a pretty good explanation", "score": 101, "replies": [{"body": "You’re alright in my book.", "score": 37, "replies": [{"body": "And so it begins...", "score": 12, "replies": []}, {"body": "Made a video about IV crush on earnings y’day. Timely my man!\n\nShould You Buy Options? https://youtu.be/2wF3dT1Slys\n\nEdit: also, don’t come find me and burn down my house for shilling my video. Just thought you might enjoy (lol)", "score": 4, "replies": []}]}, {"body": "You sat here and read all of those words?? \n\nLet the noobs learn about IV crush the hard way like the rest of us", "score": 9, "replies": [{"body": ">You sat here and read all of those words?? \n\nYes I'm a loser.\n\n>Let the noobs learn about IV crush the hard way like the rest of us\n\nThat's a good point", "score": 10, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It means to die. The mods gave me it a long time ago, supposedly it's written wrong.\n\nI'm a failure.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Nice I have a boner now", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Fuck that's me today with COST rofl.", "score": 1, "replies": []}]}, {"body": "Except you need to know about iv crush before just to understand the analogy.", "score": 1, "replies": []}]}, {"body": "wtf did i just read", "score": 23, "replies": [{"body": "ER fan fiction", "score": 40, "replies": [{"body": "Wait, where is the step when I do coke and fuck hookers again?", "score": 4, "replies": []}]}]}, {"body": "Huh, so that’s why it went up $10 and my calls were worthless.", "score": 17, "replies": [{"body": "Avoid ERs", "score": 8, "replies": []}]}, {"body": "It sounds like options usually become more valuable based on IV increasing (as ER nears), even if the stock price stays the same? Which makes perfect sense, I just haven’t traded them enough to have witnessed that!", "score": 13, "replies": [{"body": "IV will fluctuate all the time but for binary events, it will always increase and crush after.  ERs are just a certain event for IV but it can happen for product releases, news, testing, etc..\n\nYou should always be paying attention to the IV of the underlying when trading.  If you’re buying when it’s higher/lower than average, you better have a reason why or you’ll see your money go away.", "score": 10, "replies": []}, {"body": "The option doesn’t become more valuable as IV increases approaching earnings. IV goes up (since a greater portion of the options lifetime is the earnings event), time to expiration goes down, but time value (IV * time to expiration) goes down. \n\nOf course the option could independently become more valuable without a stock price move if IV gets bid up, but that’s not what you are seeing in 99% of cases.", "score": 5, "replies": [{"body": "Well, yes but not always.  It depends on Vega.", "score": 0, "replies": []}]}]}, {"body": "Finally, someone speaks my language", "score": 8, "replies": []}, {"body": "Zero sarcasm- you should monetize this shit. You would make an amazing fucking teacher.", "score": 9, "replies": [{"body": "Ha, thanks man", "score": 2, "replies": []}]}, {"body": "What % is considered high IV? At what point should you stay away", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Theoretically.  Usually it’s a great time to buy directionally, assuming the move/volume wasn’t substantial. \n\nTake NFLX for example; decent earnings but slightly green.  Great time for calls tomorrow am.", "score": 5, "replies": [{"body": "I bought NFLX 1/24 calls for $12.70 and it went to almost $16.00 for premium by EOD. If it opens where it’s at, up about $7.30/(+2%) am I going to lose all my tendies?", "score": 1, "replies": []}]}, {"body": "Watch the first 10-30 minutes of price action. If it goes red to green (with decent volume and holds above VWAP) that's a good signal to buy calls and not get screwed. It doesn't work every time but it works enough of the time.\n\nThere are other indicators and trading strategies on plays like this, I encourage you to check them out.", "score": 2, "replies": [{"body": "on which chart timeframe with VWAP?", "score": 1, "replies": [{"body": "5 minute is fine, 15 to filter out excess noise. VWAP doesn't change based on timeframe like moving averages do.", "score": 1, "replies": []}]}]}]}, {"body": "Perfect explanation. Any Autist can do this 🤯", "score": 3, "replies": []}, {"body": "he said clown dick", "score": 3, "replies": []}, {"body": "Look at the market makers moves for Amazon. (The far right number in parentheses)\n\n  \n\n\n100+ points possible moves. You better start trading Amazon.\n\n  \n\n\nhttps://ibb.co/Fstjw8v", "score": 5, "replies": []}, {"body": "Explain what happened when your autistic FD somehow doesn’t get IV crushed, and you made money", "score": 2, "replies": [{"body": "Intrinsic value overcame your extrinsic losses.", "score": 13, "replies": []}, {"body": "Stonk went waasy up/down. It can def happen.", "score": 3, "replies": []}, {"body": "The stock went further than the market had priced in.", "score": 3, "replies": []}]}, {"body": "I'm sure this helped a few people.", "score": 2, "replies": []}, {"body": "Where's the fucking tldr", "score": 4, "replies": [{"body": "Bitch, it’s all important.", "score": 33, "replies": [{"body": "gay", "score": 4, "replies": []}]}, {"body": "Up your ass fuck boi", "score": 5, "replies": [{"body": "My ass is plugged up by the red dildo today.", "score": 3, "replies": [{"body": "That's about what I would expect from someone complaining about an TL:DR", "score": 3, "replies": []}]}]}]}, {"body": "Show me an example a screen shot of before and after earnings the IV. I want to see how much it changes %. So far every time I bought before earnings if I got it right I still would gain money even if the IV was high.", "score": 1, "replies": [{"body": "Depends on when you bought, if the move was higher than the implied move, and whether or not you know the difference between extrinsic/intrinsic.  It’s possible to make money with directional plays, it’s just retardedly risky. \n\nThis is about IV crush, and it ALWAYS occurs after ER.", "score": 1, "replies": []}]}, {"body": " if I sell a put the day before earnings for 3 weeks from that day, will I still capture the high premium due to high IV?\n\nThen I could buy out of my contract at a lower price because of low IV after the ER, is that right?", "score": 1, "replies": [{"body": "You’ll capture some IV but it won’t be as much if it were that week.  In exchange for the lower IV, you get some time in case it’s a slow bleed or doesn’t go your way.\n\nThe risk is that if it drops and you now have to pay the balance of the put or buy the shares. \n\nA lot of people do this for ERs.", "score": 2, "replies": []}]}, {"body": "And then you get assigned", "score": 1, "replies": []}, {"body": "Most times the expected move is bigger than the actual move cuz theta gang so not only do you need to know direction, you need to be within strike of the move.  You could be right 2-4 weeks out but week of, you might be doomed\n\nIn cases where the stock actual move was big last quarter, it is possible that the expected range narrows this time but there's still going to be IV", "score": 1, "replies": []}, {"body": "When I first started trading options, the market had no concept of how IVs should be priced due to earnings.  Was the easiest trade out there.", "score": 1, "replies": []}, {"body": "IV CRUSSSSSH", "score": 1, "replies": []}, {"body": "So what's the problem with selling the calls on a company releasing after hours at 930-935? they do good for earnings, start high, you capitalize. more than selling before.", "score": 1, "replies": []}, {"body": "How do we get tendies off these upcoming earnings?\n\nNamely AAPL and AMD\n(ER:1/29/20 after market close)", "score": 1, "replies": []}, {"body": "I stopped reading at “matched with on Grindr.” There is no matching on Grindr. You clearly don’t belong here", "score": 1, "replies": []}, {"body": "The only problem I have is when ever I tried to buy straddles on RH they have three predetermint  options. their no option like the calls and puts that u can chose different expiration date or different strike price", "score": 1, "replies": []}, {"body": "This post has helped me (a virgin noob) \n\nAll in calls for stonks that have earnings in slightly over two weeks what could go wrong", "score": 1, "replies": []}, {"body": "Looks like damn good testicl...I mean technicals to me.", "score": 1, "replies": []}, {"body": "The IV is gonna be the same as after earnings if you buy 2 weeks prior. So what’s the point selling day prior before earnings?", "score": 0, "replies": [{"body": "No, it won’t be.  IV climbs in anticipation for earnings.  Usually this happens 2 weeks out but it’s subject to the individual security.  Could be 3/4ish weeks.  IV is always highest before binary events, especially ERs.", "score": 6, "replies": []}]}]}
{"title": "Similar to r/wallstreetbets", "selftext": "Reddit keeps on suggesting r/finance and r/investing because they are ‘similar to r/wallstreetbets.’ \nwho the fuck thinks a bunch of autists YOLOing on $NIO/$TSLA/$BYND calls has anything to do with finance or investing? Don’t lump me in with those people.", "id": "es8dlg", "created_utc": 1579676389.0, "score": 234, "upvote_ratio": 0.97, "num_comments": 57, "comments": [{"body": "Related Communities:\n\n>r/pennystocks\n\ngtfo reddtard dont send me to that shit", "score": 140, "replies": [{"body": "I went there once. It's like crawling down a sewer for the first time. You're excited to see the unknown, but once you're down there you realize you're just standing in shit.", "score": 91, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "I like how they attempt to use TA (if they're even real people) on OTC stocks with $0.00345 pps", "score": 23, "replies": []}]}, {"body": "Fuuuck this made me laugh.", "score": 2, "replies": []}]}, {"body": "Not even WSB is THAT retarded.", "score": 37, "replies": [{"body": "LMAO so true", "score": 12, "replies": []}, {"body": "I see you and raise you infinite leverage", "score": 9, "replies": [{"body": "But you see the difference is people on here are aware of how retarded they are. The people over on r/pennystocks believe they are geniuses.", "score": 17, "replies": [{"body": "As someone new to both, what’s the deal? I don’t see either sub as self-labeled geniuses. Just because WSB makes memes about “retards” doesn’t mean the other thinks their geniuses. \n\nIt seems that pennystocks is just catered to people who want to trade with stocks <$5 for small account purposes, right?\n\nEdit: Or is it the type of stocks that each sub recommends? As in mainstream companies vs smaller ones.", "score": 3, "replies": [{"body": "WSB is not self labeled geniuses no. Which was the point of my comment. We know we are retarded. I did not mean to drag everyone under one comb, but a lot of people who trade penny stocks are young, naive and easy to influence so they come from various social media people selling courses and telling them how easy it is to get rich.", "score": 9, "replies": [{"body": "I see, understandable.\n\nI’m a newbie, what would you recommend for someone learning the ropes with a small account if I *don’t* do pennystocks?", "score": 3, "replies": [{"body": "Read, read, read. The intelligent investor is an obvious starting place. But honestly if you have a small account and NO ambition of getting into day trading or whatever I would just put my money in an index fund. r/investing has a lot of insight there and can probably help you with any specifics.", "score": 4, "replies": [{"body": "Or, you know, you can buy experience by buying into options directly. If you win, easy yacht and stop trading because the first one is free, if you lose, well, think of it as a learning experience.\n\nAlso, don't be gay bears, stonks only go up!", "score": 4, "replies": [{"body": "How fucking dumb do you have to be to lose on your first trade? Its free after all.", "score": 2, "replies": []}]}]}, {"body": "Also, this sub is fun if you have a small account of play money.  Keep some money for \"serious\" investing (i.e. what the normal people do) and take a small portion of that money for doing WSB-style YOLOs and dumb shit for fun.  It's what I do.  It's not as crazy as actually doing true YOLOs and dumb stuff, but you still get to follow the market the way this sub does and see your money go 10 different ways to Sunday.", "score": 2, "replies": []}]}]}]}, {"body": "just went to pennystocks...there is literally nothing of value there. just articles", "score": 1, "replies": []}]}]}, {"body": "Made the mistake of entertaining penny stocks when I first started for my first losses. Ever since I found here, things have been much better for me betting on mainstream stocks.", "score": 5, "replies": [{"body": "Are you sure you are doing things right? Pretty sure you are supposed to lose money here.", "score": 10, "replies": []}]}]}, {"body": "Agreed.", "score": 10, "replies": []}, {"body": "Jesus Christ I just went there and dudes are bragging about buying $4.05 worth of stocks. \n\nWhat? Am I missing something?", "score": 2, "replies": [{"body": "They cannot even buy sugar for their koolaid with those gains.", "score": 2, "replies": []}]}]}, {"body": "should be suggesting r/GamblingAddiction and r/dankmemes instead", "score": 74, "replies": [{"body": "The memes on WSB are truly underrated. You don’t get that on r/investing", "score": 29, "replies": []}, {"body": "/r/formuladank\n\nIt's the closest relevant sub - yacht buyers throwing money at memes.", "score": 2, "replies": [{"body": "And I found a new sub. Stonks", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 69, "replies": [{"body": "Yea, much more similar to r/wallstreetbets than finance", "score": 31, "replies": []}, {"body": "Yo WTF", "score": 9, "replies": []}, {"body": "Bruh... Am I a mod now?", "score": 14, "replies": []}, {"body": "/r/selffuck", "score": 4, "replies": []}, {"body": "what the fuck is that first sub, I clicked back faster than wsb buying tsla calls", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "NIO is crazy, man. I remember it taking at 1.35 and now it's skyrocketing to 6.\n\nEdit: nvm, now it's at 4.8", "score": 9, "replies": [{"body": "Bought some $6.00 1/31 calls yesterday. Hopefully it takes off.", "score": 4, "replies": [{"body": "Sooo, how you doin now?", "score": 2, "replies": [{"body": "I hate myself for not selling those calls at the beginning of the day. Still in the green and making tendies with SPCE tho.", "score": 1, "replies": [{"body": "penny stocks are the devils stocks", "score": 2, "replies": []}]}]}, {"body": "What the hell is a 1/31 call", "score": 0, "replies": [{"body": "I'm new to options and I'm a retard, but they expire on the 31st so I assume that's what they're called?", "score": 9, "replies": [{"body": "Thanks retard\n\nEdit: haha got mine cheaper than yours", "score": 0, "replies": [{"body": "I would hope so boi, considering I bought near the high yesterday.", "score": 2, "replies": [{"body": "Buy high, sell low pussy", "score": 4, "replies": [{"body": "🔥🔥🔥", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "want the same shitty returns as wsb  ,but with people who \\*think they actually know what they are talking about?    \n\n\n/r/finance and r/investing   \n\n\nat least here at wsb people arn't delusional. plus we actually have some people who make real money", "score": 17, "replies": [{"body": "At least here people realise their losses within a few months at most. Over there it takes up to 40 years to realise you didn't make any money.", "score": 12, "replies": [{"body": "I can't tell if this is the smartest or dumbest thing I've ever heard.", "score": 6, "replies": []}]}]}, {"body": "Still better than seeing all the time /r/economy in recommended filled with whiny millennial commies with gender studies degrees and mountains of student debt yapping about “inequality”, “injustice”’and “eating the rich”.", "score": 36, "replies": [{"body": "They’re the worst", "score": 17, "replies": []}]}, {"body": "Damn straight I guess", "score": 4, "replies": []}, {"body": "Yea and I’ve been banned from all those other communities anyways", "score": 4, "replies": []}, {"body": "The bears have r/gaybears   \nWhere's the bull sub?  \nOh, right. It's r/wallstreetbets.", "score": 4, "replies": []}, {"body": "Lol /r/sportsbook is full of autists", "score": 5, "replies": []}, {"body": "We are a gang of gambling degenerates", "score": 3, "replies": [{"body": "R/sportsbook for when 4:30 Friday afternoon hits 😎", "score": 5, "replies": []}]}, {"body": "I suggest r/drama for like minded autists", "score": 3, "replies": []}, {"body": "This is the quality post im here for", "score": 2, "replies": []}, {"body": "[https://twitter.com/TheRoaringKitty/status/1790789242513433071/video/1](https://twitter.com/TheRoaringKitty/status/1790789242513433071/video/1)", "score": 1, "replies": []}]}
{"title": "FIRST 2K DAY!! --TSLA, SPCE, SPY", "selftext": "Holy shit this was my best day yet, had to take profts, couldn't resist\n\n[2K GAINS](https://ibb.co/LvyfDHT)\n\nHUGE Shoutout to Lord Elon for bringing me over $1k in tendies today. SPCE and SPY did the rest\n\nLets goooo bois\n\nEDIT:: fuck my excitement, missed out on another $1.5-2k gains from Tesla", "id": "esd0qa", "created_utc": 1579704696.0, "score": 113, "upvote_ratio": 0.9, "num_comments": 64, "comments": [{"body": "I haven't sold my SPCE calls but I'm absolutely ecstatic! Bought yesterday and already up 50 percent.\n\n$22 Jan, 15th 2021 expiration. It's practically free money for me.", "score": 40, "replies": [{"body": "Don't sell those. Those are literally your lambo if you sit on them.", "score": 46, "replies": [{"body": "lmao no", "score": -4, "replies": [{"body": "You’re retarded. Not an autist. You’re full on retarded.", "score": 8, "replies": [{"body": "He doesn’t understand yet that stonks only go up, give him time", "score": 3, "replies": []}]}]}]}, {"body": "Lol I have 2022 $20 calls up a similar amount. Let that shit ride man we are gonna have lambos soon", "score": 17, "replies": [{"body": "How many $SPCE calls did you guys buy?", "score": 2, "replies": [{"body": "As many as I could 😎", "score": 1, "replies": []}, {"body": "Same as zeta haha. Basically, not enough", "score": 1, "replies": []}]}]}, {"body": "I’m in the same boat. I’m up 15k today alone on SPCE calls, can’t wait to see how far this goes on my 100 2/21 18c’s. \n\nCongrats on your gains!", "score": 3, "replies": []}]}, {"body": "This thread reads like a bunch of autists down 100k finally got their first win", "score": 20, "replies": [{"body": "I'm only down 1k all time!! Up 4k on the year though", "score": 15, "replies": []}]}, {"body": "I just sold my SPCE $14 calls for a big gain today too:D", "score": 14, "replies": [{"body": "Sold my 2/21 $20s for 200%!!", "score": 12, "replies": [{"body": "fuck, I think I bought them", "score": 18, "replies": [{"body": "Thank you kind sir!!", "score": 9, "replies": []}]}]}]}, {"body": "Gooo UK ELON MUSK (Richard Branson)", "score": 26, "replies": [{"body": "ELON MUKS", "score": 2, "replies": []}]}, {"body": "First comment here, fairly new, just bought my first call on SPCE. \n\nEMBRACING THE AUTISM. SCREW SAVINGS ACCOUNTS, STOCKS ONLY GO UP.", "score": 12, "replies": [{"body": "Facts.", "score": 2, "replies": []}, {"body": "*stonks", "score": 3, "replies": [{"body": "Elon daddy punished me with an overdraft fee. Probably because I forgot to call them “stonks” lesson learned. Won’t happen again", "score": 2, "replies": [{"body": "Elon daddy knows all, listen when he whispers in your ear", "score": 2, "replies": []}]}]}]}, {"body": "Congratz, babe.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I bought it late thursday, finished that day down 20%. By friday I was down to 80%. Then yesterday I was damn near breakeven bc it went up 300%. Then today profited about 100%", "score": 8, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "There's some open interest on march 1000 calls, might have to snag some of those", "score": 6, "replies": [{"body": "I love this sub", "score": 8, "replies": [{"body": "Only 300 for a 10x bagger potential...... fuck it!", "score": 3, "replies": []}]}]}]}]}]}, {"body": "lol you’ll look back on this post in a few months (if you have some talent at this) and 2k will feel like pocket change. I made 15k today on SPCE and TSLA and honestly, as you go, your account just begins to exponentially grow. \n\nI started this round of investing at 5k on January 3rd. I’m at 51k today. Hopefully you have similar success in this incredible bull market.", "score": 7, "replies": [{"body": "Yeah I was at 1k in mid December, up 385% since then. Been going well recently. \n\nBut damn yea I hope I can keep it going and get up go 50k.. or 100k... or 500k...\n\nHow risky do you play, OTM weeklies? What's your strategy? \n\nTesla, msft, and apple have been carrying me", "score": 2, "replies": [{"body": "I stick to ITM calls, and always 14-21 days out. Because my account is over 25k I don’t need to worry about day trades which helps a LOT. But yeah, by my staying ITM, i don’t need to worry about the stock reaching a certain point as it rises. It’s already ITM and just keeps growing with a high Delta throughout.", "score": 1, "replies": []}]}]}, {"body": "anyone wanna explain why spce like quadrupled in a few weeks", "score": 5, "replies": [{"body": "Hype.. just like bynd, tlry, etc.... lotta fomo", "score": 4, "replies": [{"body": "how do you find these hype stonks before it's too late? luck?", "score": 2, "replies": [{"body": "Yup, when only 10% of wsb is mentioning it, it's green. When 40-50% start mentioning it, gtfo!!", "score": 7, "replies": [{"body": "What % is it at rn? Still time to buy more?", "score": 1, "replies": [{"body": "Tbh the whole sub is talking about tsla and spce nonstop recently so it's probably coming to an end soon... but fomo is real and lotta regular ass people are buying it up too", "score": 6, "replies": [{"body": "Fomo?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "LMAOOO SAME", "score": 3, "replies": [{"body": "LETS GOOO", "score": 2, "replies": []}]}, {"body": "In SPCE underlying bc I'm a pussy. $19.40 cost basis. SPCE $20.20 here we go!!!!", "score": 3, "replies": []}, {"body": "$SPCE to the moon, woke up to a notification saying it was up 10% and took my profits", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Think it's got more room to run? Been watching it a lot, feel like it just pumps with tsla", "score": 2, "replies": []}]}, {"body": " [https://imgur.com/a/jXtARwY](https://imgur.com/a/jXtARwY)  same brotheer, fuck BA, go TSLA!", "score": 2, "replies": [{"body": "Only thing I can figure out here is margin 93%, what's the gains lmaoo", "score": 1, "replies": [{"body": "2205 on TSLA alone💪💪", "score": 2, "replies": [{"body": "Gooooood shit, next time use robinhood!", "score": 2, "replies": []}]}]}]}, {"body": "If it makes you feel any better about you losing out on another $1.5-2K gains, I lost out on $10K from Tesla bc I sold to early.  From that day forward I have taken the short bus to work...", "score": 2, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "Ohhhhhh 5g I see", "score": 5, "replies": [{"body": "5Ge ain't 5g", "score": 13, "replies": []}]}, {"body": "Get en fam", "score": 1, "replies": []}, {"body": "Congratulations!!", "score": 1, "replies": []}, {"body": "Congrats man, happy for you", "score": 1, "replies": []}, {"body": "Wish Canada had RH.", "score": 1, "replies": []}, {"body": "you can lose it all the next day", "score": 1, "replies": []}, {"body": "Today is also my first 2k day in a while. Enjoying the tendies at a nice sushi place right now", "score": 1, "replies": [{"body": "Funny you say that, I work part time at a sushi place rn while in college and I'm at work currently haha\n\nAre you here.....", "score": 2, "replies": [{"body": "Haha what a coincidence. Not unless you live in PA", "score": 1, "replies": [{"body": "Nah TX", "score": 2, "replies": []}]}]}]}, {"body": "Bear gang in this bih", "score": 1, "replies": [{"body": "Sorry for your extra chromosomes", "score": 1, "replies": []}]}, {"body": "2K? Noob", "score": 0, "replies": []}]}
{"title": "FLEX YOUR 2020 GAINS", "selftext": "Gain porn only, need some pretty gains to look at during this lunch break and 2020 has started off hot hot hot\n\nSpecial s/o to tesla and apple\n\n[2020 Gains](https://ibb.co/8g3Q2f6)\n\nLets keep the tendie train rolling, love you autistic fuckers", "id": "esf97y", "created_utc": 1579714442.0, "score": 34, "upvote_ratio": 0.96, "num_comments": 62, "comments": [{"body": "I’ve never seen a color like tht", "score": 21, "replies": [{"body": "You unlock it later in the game", "score": 7, "replies": [{"body": "Is that before or after I lose everything?", "score": 9, "replies": []}]}]}, {"body": "https://imgur.com/a/RZ80nEw\n\ntook a $2K loss on FB calls back around March/April and stopped investing for a minute while I was moving cities for a new job. started back up around thanksgiving and have made a little over $10K since then, mostly on tsla, spy and visa.\n\ni withdrew $5.1k a couple weeks ago to pay off expenses which is why my account is around $9k. my all-time chart is sitting at around +$8K\n\nedit: my charts on robinhood have been acting weird since i withdrew the $5.1k but my initial investment was $5K, so I’m getting close to 100% ROI on my all time chart", "score": 14, "replies": [{"body": "Robinhood is not made for withdrawing money", "score": 9, "replies": []}, {"body": "Damn good shit", "score": 5, "replies": [{"body": "appreciate it man, good shit on your gains too. hope it continues for you 🙏🏻🤙🏻", "score": 3, "replies": [{"body": "I'm not options, but long visa. It's a money making machine.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": ":-(", "score": 2, "replies": []}, {"body": "I will be messaging you in 11 months on [**2020-12-31 09:00:00 UTC**](http://www.wolframalpha.com/input/?i=2020-12-31%2009:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/esf97y/flex_your_2020_gains/ff9kl7y/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fesf97y%2Fflex_your_2020_gains%2Fff9kl7y%2F%5D%0A%0ARemindMe%21%202020-12-31%2009%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20esf97y)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "I’m too poor to gamble so I have no gains :(", "score": 7, "replies": [{"body": "Always gonna be poor with that mindset", "score": 21, "replies": []}, {"body": "Just pretend you have extra 0's next to whatever money you spend.  The Federal Reserve and government does that all the time anyway.", "score": 1, "replies": []}]}, {"body": "[2020 gainz thank meme stonks](https://m.imgur.com/a/owZNF8z) \n\nDoubled my portfolio this month!", "score": 7, "replies": [{"body": "We almost match lol \n\nhttps://imgur.com/a/XirwBsa", "score": 4, "replies": [{"body": "lol we must have found WSB and SSB around the same time. We both got that dip then learned our lessons. To the moon brother", "score": 2, "replies": []}]}]}, {"body": "Not much gains because of Theta Gang Strat but a gain is a gain nonetheless.\n\n[Theta Gang](http://imgur.com/a/awxvUB2)", "score": 5, "replies": [{"body": "Just keep selling me the good calls !", "score": 3, "replies": []}]}, {"body": "https://i.imgur.com/AGYMwUB.jpg\n\nTesla to Mars! 🚀", "score": 5, "replies": [{"body": "Love to see it!!", "score": 1, "replies": []}]}, {"body": "[2020](https://imgur.com/gallery/jFcZgZh)", "score": 6, "replies": [{"body": "Jeez what you trading?? SPCE", "score": 7, "replies": []}]}, {"body": "I’ll pos my tendies when my LEG puts start printing next month.", "score": 4, "replies": []}, {"body": "Ya’ll should post all time too", "score": 3, "replies": [{"body": "[1 yr chart](https://ibb.co/9tdwywN) \n\n[all time](https://ibb.co/FqKj8sJ) \n\nWorking on quite the comeback rn, was down to about 1k (started around 7.5k)\n\nAll I did was stop buying puts interchangeably with calls.... now it's calls only!", "score": 3, "replies": []}]}, {"body": "Grew a pair last Wednesday. Bought Spy calls expiring Friday. Then bought 20 SPCE $20 calls @ $50 now $200 expiring 2/21 and 20 $V $260 calls @ $47 now $97 expiring 9/18. Have AAPL 3/20 calls as well. Needless to say I am addicted. Going to set aside some of this after this week. I am afraid I know what I am doing but really am tarted. :/\n\n\nhttps://imgur.com/gallery/5sD2P23", "score": 3, "replies": [{"body": "Sheeesh well played my guy, congrats on the tendies", "score": 2, "replies": [{"body": "I’m just waiting for reality to strike and lose it all", "score": 1, "replies": []}]}]}, {"body": "Wait, you all are marking money?", "score": 3, "replies": []}, {"body": "https://imgur.com/gallery/Nh6ctfL\n\nThis morning", "score": 3, "replies": []}, {"body": "https://imgur.com/a/GcQ0ecE\n\nI have learned pain.\n\nPlus you can see the learning curve of me\nA. Trying stocks.\nB. Trying options with absolutely no idea.\nC. Making my money back from the house and a bit more.", "score": 4, "replies": [{"body": "All that in the same week? Wow took me a year to progress thru all that", "score": 3, "replies": []}]}, {"body": "[gainz](https://imgur.com/a/XrooOgR)", "score": 2, "replies": [{"body": "Yeerrr just starting options?", "score": 1, "replies": [{"body": "Yes, just bought first call over the weekend. Started investing a couple of months ago. Bought ITCI before it blew up.", "score": 1, "replies": []}]}]}, {"body": "https://imgur.com/a/gTMV2w7\n\nStarted on Thanksgiving break 2019. Portfolio getting pumped by tsla, aapl, and spy", "score": 2, "replies": []}, {"body": "https://ibb.co/KGhGpbT\n\nI had started with 7500, once i got to 10k i withdrew the 7500, gonna put that in another broker.\nHalf of my capital is usually collecting theta, the other half on \"safe\" calls", "score": 2, "replies": [{"body": "Damn what theta plays nets 1000%", "score": 1, "replies": [{"body": "Lol i withdrew 7500, my biggest day gain was like 25% tho", "score": 1, "replies": [{"body": "Ohh gotcha. What kind of strategies do you use", "score": 1, "replies": [{"body": "I started with options on jan 2nd, so this is all luck. My best theta plays were on aapl, doing a $5 wide put credit spread with the short leg atm, and ive been buying spy and qqq atm calls for 3 weeks out and holding overnight", "score": 1, "replies": []}]}]}]}]}, {"body": "[https://imgur.com/VasjopK](https://imgur.com/VasjopK)", "score": 2, "replies": []}, {"body": "I have a question about holding a call overnight. I stupidly placed a call for feb I believe on spce for 17. This morning I work up for a second and it was -121. Then randomly it jumped up another 300 and I sold it for a gain luckily, is it only the price of the stock that affects the daily loss other than the theta? I’m pretty sure I hadn’t gotten fucked by the theta that hard but Jesus Christ it’s so volatile.", "score": 1, "replies": [{"body": "could be vega or theta or possibly shitty rh charts", "score": 1, "replies": []}]}, {"body": "[slowly becoming less poor](https://imgur.com/a/XirwBsa)", "score": 1, "replies": [{"body": "Facts.", "score": 1, "replies": []}]}, {"body": "It's not a lot so far. I only let myself day trade with $5-10K. Everything else is in Fidelity money market, index funds, and MBS.\n\n [https://imgur.com/OLwdue5](https://imgur.com/OLwdue5)", "score": 1, "replies": []}, {"body": "I can't show a SS because I have no idea how to show my gain on Vanguard (their UI sucks) but I exited my AMD position after holding it for just over one year\n\n200 shares @ $18.5, sold for $50 for a gain of about +$6300\n\nHowever, my shares of MDR (500 @$4.75 for -$2375) are going to shit because of their bankruptcy filing so I'm guessing I'm:\n\n+$3925 overall", "score": 1, "replies": [{"body": "Held shares for a year... think about if you put that capital into AMD LEAPS. Not bad though", "score": 1, "replies": [{"body": "I've only been trading with a personal brokerage account for about 14 months, AMD was one of my top 5 purchases.", "score": 1, "replies": []}]}]}, {"body": "[2020 gainz ](https://imgur.com/gallery/NWg63ud)", "score": 1, "replies": []}, {"body": "Oh these sweet summer children.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Looks good to me, gains are gains brother", "score": 2, "replies": [{"body": "Indeed, at least that shit ain't red. Yet.\n\nEdit: love the flair. Just left my job at WeWork last Friday. Feels good", "score": 1, "replies": []}]}]}, {"body": "I just watched YouTube videos for 3 days straight and fixed my course. Learned by losing.", "score": 1, "replies": [{"body": "I learned by a lot of losing, like a lot. Like for a year of L's almost hahah fml", "score": 3, "replies": [{"body": "I have a question about holding a call overnight. I stupidly placed a call for feb I believe on spce for 17. This morning I work up for a second and it was -121. Then randomly it jumped up another 300 and I sold it for a gain luckily, is it only the price of the stock that affects the daily loss other than the theta? I’m pretty sure I hadn’t gotten fucked by the theta that hard but Jesus Christ it’s so volatile.", "score": 1, "replies": [{"body": "If you're using robinhood, if's super glitchy in the mornings. For 15mins or so, shit always jumping around or mispricing.\n\nYeah stock price, theta, IV are the main factors", "score": 4, "replies": []}]}]}]}]}
{"title": "100% PROFITABLE ALGORITHM", "selftext": "As the 6'8\", 37\" vertical leap, two-time quant championship winner @ goldman sachs, here is my go to algorithm (made in python) that i use to fund my coke addiction.\n\n    import random\n    from Robinhood import Robinhood\n    \n    def purches(ticker):\n        Robinhood.order(ticker)\n        print (\"This literally cannot go tits up.\")\n    \n    tendie_list = []\n    \n    amd = Robinhood.Quote.get(\"amd\")\n    tsla = Robinhood.Quote.get(\"tsla\")\n    spy = Robinhood.Quote.get(\"spy\")\n    \n    if amd < 90:\n        tendie_list.append(\"amd\")\n    if tsla < 690:\n        tendie_list.append(\"tsla\")\n    if spy < 420:\n        tendie_list.append(\"spy\")\n    \n    buy_order = random.choices(population=tendie_list, weights=[0.3, 0.3, 0.3])\n    purches(buy_order)\n\n**Tendies 100% guaranteed** (*but dont sue me if it doesn't go as expected*).", "id": "esfqcb", "created_utc": 1579716443.0, "score": 255, "upvote_ratio": 0.95, "num_comments": 57, "comments": [{"body": "if you > gay\nur gay \nhah", "score": 100, "replies": [{"body": "penis = \"TSLATSLATSLATSLATSLATSLATSLATSLATSLATSLATSLATSLATSLATSLATSLATSLATSLA.\"\n\nyou = len(penis)\n\ngay = 69\n\nif you == gay:\n\nprint(\"ur gay hah\")", "score": 27, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Getting real basic with it..", "score": 2, "replies": []}]}]}]}, {"body": "That is some MIT post doctorate software engineering shit!", "score": 47, "replies": [{"body": "More like Harvard.", "score": -10, "replies": [{"body": "Harvard Engineering Comp Sci Gay", "score": 4, "replies": [{"body": "I was implying MIT wasn't gay.", "score": -1, "replies": []}]}]}]}, {"body": "I assume you set 3 weights of .3 to allow for 10% of purchases to be completely random (thereby generating the actual profit)?", "score": 36, "replies": [{"body": "he probably just meant to type 30x leverage but fat fingered it", "score": 6, "replies": []}]}, {"body": "Consider wrapping this module with a function that runs in the background and executes at the desired interval, for example every 69 seconds. Then it's probably more like 1000% guaranteed (but really don't sue me either)", "score": 43, "replies": [{"body": "Care to explain why you chose every 69 seconds rather than 420 seconds?", "score": 5, "replies": [{"body": "More profits, obviously. Alternate package could implement a second algorithm to increase the bet amount every 420 seconds. That way you can continue to roll your tendies into even more autistic bets every 69 seconds", "score": 14, "replies": []}]}, {"body": "69% returns \nNice", "score": 1, "replies": []}]}, {"body": "if stock high = buy  \nif stock low = sell", "score": 14, "replies": []}, {"body": "Brilliant. Give this man a medal.", "score": 12, "replies": []}, {"body": "assert(isUserGay(\"calculateq\"), true)", "score": 6, "replies": []}, {"body": "Stealing The Doc's line?  SAD!", "score": 6, "replies": [{"body": "PATHETIC. ITS A SNOOZE FEST OUT HERE!!", "score": 3, "replies": []}]}, {"body": "Sir this is Dildo factory", "score": 6, "replies": []}, {"body": "Couldn't you make this more efficient with leverage?", "score": 4, "replies": []}, {"body": "WHILE (need\\_the\\_money)\n\n  PRINT('Offer to suck cock for $10')\n\n  SUCK\\_COCK(your\\_mouth, your\\_dignity)\n\n  GET\\_PAID(your\\_wallet, $10)", "score": 3, "replies": []}, {"body": "Hot damn, this is 🔥🔥🔥", "score": 2, "replies": []}, {"body": "I'm copy/pasting this into my algo.", "score": 2, "replies": []}, {"body": "MFW this beats the market", "score": 2, "replies": []}, {"body": "Clearly doesn't work at Google:\n\n* Unnecessary use of interpreted double quote strings.\n* Unnecessary variable assignments.\n* Repeated code. Could have fewer conditionals with an iterator and function, or better yet a lambda list comprehension.\n* 4 space indents.", "score": 2, "replies": [{"body": "Not to mention he hasn’t even leaked any user information, obviously some joe blow.", "score": 2, "replies": []}]}, {"body": "So your saying is all I have to do is hit money.exe and I’ll be shitting bricks in my new yacht?", "score": 2, "replies": []}, {"body": "All I had to read was the first line to know this was it 👌", "score": 1, "replies": []}, {"body": "I don't speak robot. Going all in on Tesla $690 calls and selling $420 puts", "score": 1, "replies": []}, {"body": "> purches", "score": 1, "replies": []}, {"body": "it's `robin_stocks` not `Robinhood` \\- you can't even import the right library, sperg\n\ntry this\n\n    import random\n    import robin_stocks\n    \n    robin_stocks.login('king_autist', 'Hunter2')\n    \n    robin_stocks.order_buy_market('TSLA', 10)", "score": 1, "replies": [{"body": "Thx for giving me ur password", "score": 1, "replies": [{"body": "in the name of science", "score": 1, "replies": [{"body": "Scients", "score": 2, "replies": [{"body": "nd stonks", "score": 1, "replies": [{"body": "Ltrly cnt g0 ttsp", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I ran this through IDLE and the programming checks out.", "score": 1, "replies": []}, {"body": "Won’t the weights list be incorrectly sized if any of those stocks go above their target price", "score": 1, "replies": []}, {"body": "lets open a algorithmic hodge fund", "score": 1, "replies": []}, {"body": "This has to be the worst algo in the history of algos.\n\nIs this what quant funds write?", "score": 1, "replies": []}, {"body": "THE TWO TIMER IS HERE", "score": 1, "replies": []}, {"body": "How to algo trade options?", "score": 1, "replies": []}, {"body": "buy_power = Robinhood.buyingpower\n\nif aapl.intraday >= 0:\n     tendie_list.append(“aapl”)\n\nif buy_power += 500:\n     buy_order.tendie_list", "score": 1, "replies": []}, {"body": "I wish I knew if you intentionally stole the doc’s line in an attempt to be creative.", "score": 1, "replies": []}, {"body": "Can you jump out of a pool?", "score": 1, "replies": []}, {"body": "> weights=[0.3, 0.3, 0.3]\n\nautism confirmed", "score": 1, "replies": []}, {"body": "You are ready to work for RenTec.", "score": 1, "replies": []}, {"body": "01111001011011110111010100100111011100100110010100100000011001110110000101111001\n\nand your weights don't equal 1.0. Where's that extra 0.1 going? Skimming margined pennies into an offshore account? Someone fix this glitch so this autist stops getting paid.", "score": 1, "replies": []}, {"body": "Jesus Christ why didn’t I think of this", "score": 1, "replies": []}, {"body": "Imagine not being able to spell purchase", "score": 1, "replies": [{"body": "Imagine not understanding an intentional joke. Oh wait you must be autistic. Carry on", "score": 0, "replies": [{"body": "Oh, so he spelled everything else right but misspelled that on purpose. I bet when you fuck everything in your life up on a day to day basis you call it an “intentional joke” as well. Guess what pal, it’s real and you’re a failure and even if you did have a wife (which there’s no way you do cuz you’re a fucking retard), she would be sleeping with someone else.", "score": 2, "replies": [{"body": "Hmmm. You spelled everything right except “because.” Or maybe you meant “cousin?” And don’t give me that “it was intentional” crap.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "tensorflow always complains about cudnn .. im waiting for vulkan so i can get off of Nvidia's crappy hardware.", "score": 1, "replies": []}]}]}
{"title": "Morgan Stanley confirms $SPCE is the new $TSLA", "selftext": " [https://www.bloomberg.com/news/articles/2020-01-22/virgin-galactic-soars-as-investor-interest-rivals-tesla](https://www.bloomberg.com/news/articles/2020-01-22/virgin-galactic-soars-as-investor-interest-rivals-tesla) \n\n&#x200B;\n\nWhich lambo you guys gonna buy? \n\n [https://www.lamborghini.com/en-en/models](https://www.lamborghini.com/en-en/models) \n\nI'm partial to the Huracan myself. The Aventador is too overdesigned.", "id": "eshmz3", "created_utc": 1579724835.0, "score": 77, "upvote_ratio": 0.95, "num_comments": 69, "comments": [{"body": "Honda Civic 2017 with 85,440 miles on it. One owner, air bags deployed.", "score": 72, "replies": [{"body": "Dope bro, make sure have some spy calls so you could have full coverage insurance tho.", "score": 9, "replies": []}]}, {"body": "Fuck a lambo ima get a buggatti----> 50 contracts here 🤑😎🖕", "score": 33, "replies": [{"body": "So how many bags did $SPCE print yaaa 💰💰💰", "score": 2, "replies": [{"body": "10k so far but in the future it'll be 500k", "score": 3, "replies": [{"body": "🤑🤑🤑🤑👍🏼", "score": 2, "replies": []}]}]}]}, {"body": "god damn my SPCE $20 1/2021 looking real good.", "score": 23, "replies": [{"body": "Bought these calls this morning", "score": 3, "replies": [{"body": "Same! And $22 same date", "score": 1, "replies": []}, {"body": "Bought mine in November?", "score": 1, "replies": []}]}]}, {"body": "I'll be getting the Cyber Truck, courtesy of God Branson.", "score": 21, "replies": []}, {"body": "RICHARD BRANSON FOR ME BOYS", "score": 12, "replies": []}, {"body": "when should I sell my $25 2/21 calls?", "score": 10, "replies": [{"body": "On 2/21 when the stock is at $35.", "score": 32, "replies": [{"body": "And then on 04/17 the stock price is at $65", "score": 8, "replies": [{"body": "Or wait till 2021 when it’ll be $100", "score": 9, "replies": []}]}, {"body": "will it get there? I could sell now and make an easy $30", "score": 2, "replies": []}]}]}, {"body": "Liquidating all my assets and going all in on Feb $25 Calls", "score": 10, "replies": [{"body": "Same. See you on the other side 👋", "score": 5, "replies": []}]}, {"body": "This stock has legs to keep running but long term i don’t believe in the business plan i havent read yet", "score": 10, "replies": [{"body": "Yes you know your stuff fella", "score": 2, "replies": []}]}, {"body": "Going to buy more calls if there’s a dip tomorrow..hop on the train while you can bois", "score": 9, "replies": [{"body": "Same, I'm already in for a grand, killed it today. Might re-up even if if doesn't dip.", "score": 4, "replies": [{"body": "Thinking the same thing", "score": 3, "replies": []}, {"body": " it can definitely hit big numbers with the current momentum it has. See you in space my friend", "score": 1, "replies": []}, {"body": "$1000 or 1,000 contracts or ten", "score": 1, "replies": [{"body": "Bought $1000 worth, half yesterday and half this morning when it was up 7%", "score": 2, "replies": []}]}]}]}, {"body": "Chef Branson serving up fat juicy tENdieS", "score": 7, "replies": []}, {"body": "I read a book Branson wrote once, so I think is a pretty safe bet. Bought some 1/21 calls 🤪", "score": 7, "replies": []}, {"body": "I have 20 2/21 $20 calls I think I’m going to hold up until earnings. I just don’t see how there isn’t a pull back when earnings likely disappoint? I’m bullish overall obviously. Like the idea of holding some 2021 calls. I’d expect there to be some pullback but maybe not.", "score": 6, "replies": [{"body": "Earnings will be negative. They don't make money.", "score": 5, "replies": [{"body": "And everyone knows that. So how will this play out?", "score": 3, "replies": [{"body": "Meme pump until the first flights. Then either moon, or straight to zero depending on if people die or have a good time.", "score": 13, "replies": [{"body": "But in both cases, bears are still gay", "score": 3, "replies": []}]}]}]}]}, {"body": "Just bought, hopefully it saves me", "score": 5, "replies": [{"body": "Bought yesterday. Up 50 percent today on $22 1/15/2021 calls", "score": 3, "replies": []}]}, {"body": "What expriry are we going for lads", "score": 3, "replies": [{"body": "Of course the Jan 2021’s. No need to chad this one", "score": 13, "replies": []}, {"body": "As long as you can afford. These calls are retarded cheap and the stock is gonna be over $100 EOY. \"Analysts\" are already targetting $60 and analysts are gay bears who always underpredict.", "score": 16, "replies": [{"body": "Gay bears 😂", "score": 6, "replies": []}]}]}, {"body": "I thought we inverse whatever institutions put out", "score": 3, "replies": []}, {"body": "Morgan Stanley. So price target $0 - $6900?", "score": 2, "replies": []}, {"body": "Analysts average target is $19 at year end lol? How can they put a target on a company not making profits??\n\nNext week: analysts raise year end target to $40 because the stonk went up really fast!", "score": 2, "replies": []}, {"body": "$30C 01/21 and $20C 03/20 for me", "score": 1, "replies": []}, {"body": "Buying puts", "score": 1, "replies": [{"body": "Really?", "score": 1, "replies": []}]}, {"body": "Tesla will outlast this SPCE.  Tesla has already outlasted AMD and Beyond.", "score": 1, "replies": []}, {"body": "get the Urus.", "score": 1, "replies": []}, {"body": "🤑🤑🤑👍🏼", "score": 1, "replies": []}, {"body": "It’s going to look like the closing scene of Mr.Deeds but swap out corvettes for lambos. We all hitting trees!", "score": 1, "replies": []}, {"body": "Short the fuck out of this garbage. Branson is not Musk.", "score": -4, "replies": []}, {"body": "What a joke, yet another losing $150m per year scam", "score": -9, "replies": [{"body": "Show me on the doll where Branson touched you.", "score": 15, "replies": [{"body": "i hope it goes to 25 then i'm selling", "score": -2, "replies": []}]}, {"body": "The only joke here is you lmaoooo hating on something you don't even own 🖕🤑", "score": 5, "replies": [{"body": "own 50 shares dumb fuck", "score": -4, "replies": [{"body": "So why u hating!?", "score": 7, "replies": [{"body": "cause it's another joke of a company spending investor money that will eventually give nothing back... kind of like uber", "score": 1, "replies": [{"body": "This isn't anything like Uber.... I'm guessing you are new to investing", "score": 2, "replies": [{"body": "i'm guessing you're new to thinking", "score": 3, "replies": [{"body": "I like how hypocritical you are... you say this company will waste investor money, but you're invested in it 🤣 I'm done replying to a dumbass like you", "score": 2, "replies": [{"body": "I invest because there is money to be made, not because I believe in it", "score": 2, "replies": []}]}]}]}]}]}, {"body": "^ this dude owns share lolol. shouldn't you be in r/investing?", "score": 6, "replies": [{"body": "I'm not OP nor posting position threads, simply comments on what's going on, the only reason I said what I own is because he said I didn't own any. I had an options order in but it didn't fill.", "score": 1, "replies": []}]}]}]}]}, {"body": "Bought my puts right at the top of the close around market close.. tendies will rain on me from space!", "score": -8, "replies": [{"body": "Have fun waiting in line at the food shelter before heading back to your cardboard box 🎊🍻💯", "score": 18, "replies": []}, {"body": "If you wanted to throw away your money, you could have just given it to me instead...", "score": 2, "replies": []}]}, {"body": "Oh yeah, another pump and dump.", "score": -4, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Ok boomer", "score": 4, "replies": []}]}]}
