{"title": "Whats your max % of portfolio you'd let TSLA hit before selling?", "selftext": "When the stock hit 170s, TSLA was close to half of my portfolio and I didn't want more risk so I held off on buying more.   \n\nNow it's 80% of my portfolio.   \n\nAny of you take this into account? ARK sells off to keep TSLA at 10% of portfolio. I wonder if any of you do something similar.   \n\nWhat's your target % , if any, over which you will sell?\n\n*Edit*: for some $$ context, it's over $200k for me now, with over $100k in unrealized gains. What would you do if your TSLA has $100k in unrealized gains and is 80% of your portfolio.  \nA lot of the commenters are talking about much smaller absolute quantities.", "id": "em6wja", "created_utc": 1578558657.0, "score": 14, "upvote_ratio": 0.95, "num_comments": 62, "comments": [{"body": "No max. Full yolo for the memes", "score": 26, "replies": [{"body": "r/wallstreetbets", "score": 3, "replies": []}]}, {"body": "96.69%", "score": 24, "replies": []}, {"body": "I believe in Tesla. For me to have anything but %100 portfolio in Tesla is to say I doubt my belief. Which I don't. All in bitches.", "score": 14, "replies": [{"body": "This is a terrible investment idea. Diversification is good. It’s the only free lunch in investing. It decreases volatility without decreasing returns. Reconsider your financial thesis", "score": 2, "replies": [{"body": "We can compare numbers in 5 years if you like.", "score": 2, "replies": [{"body": "Sure, but you should realize there are reasons like Sharpe ratios exist.", "score": 1, "replies": [{"body": " In 5 years you tell me how you feel about your decision to diversify, and I’ll tell you how I feel about my decision to invest 100% in TSLA.", "score": 2, "replies": []}]}]}]}, {"body": "Ditto", "score": 1, "replies": []}]}, {"body": "40% of my current liquid investments are Tesla. I expect it to grow to  70% within 2 years. I won’t touch it even by then. \n\nMost investment company like ARK has rules to govern their investment. I bet Cathy and her employees has much more than 10% of their investment in Tesla privately.", "score": 7, "replies": [{"body": "Having 40% of your wealth in one company is irresponsible. Despite what you might feel about future prospects, consider lowering this to 10%. Diversification reduces volatility and is a good thing.", "score": 1, "replies": [{"body": "40% of my liquid investment, not wealth.  \n\nI agree about diversification, and it’s a good metric for most people.  \n\nWhen I bought TSLA, it was a small percentage. It ended up growing to be 40% of my liquid portfolio.  TSLA is a stock that I am willing to consider it a loss, but at the same time hope that it will skyrocket my portfolio into orbit in the next 5-10 years.", "score": 2, "replies": []}]}]}, {"body": "ARK is doing it wrong. For long term investment you want to pick the best one, stick with it as long as it still makes sense. Tesla has the potential to grow into the largest company in the world. Now the sign is even more clear, I'm not selling just because it turned into a large portion of my net. From share price point of view, $8000 is the time I might sell 1%.", "score": 8, "replies": [{"body": "One, no great investor would ever tell you to pick a single investment.\n\nTwo, Tesla hasn’t done anything to demonstrate it might grow into the largest company in the world? What are you see that I’m not? Car companies aren’t in the largest companies for reasons.", "score": 1, "replies": [{"body": "Warren Buffett suggested that many times. \"For those who know what they are doing, diversification doesn't make any sense\" - Warren Buffett. \nLet me explain one more time, Tesla is not a car company. Eventually you will know Apple is not a phone company, Amazon is not an online retailer.\n\nI don't know for sure Tesla will become one of the largest companies. I think maybe 50/50.", "score": 3, "replies": [{"body": "Number one, you are not Warren Buffett: you don’t know what you’re doing. And if you look at Warren Buffett’s actions, he personally has significant diversification, which is one of the greatest reasons he succeeds. \n\nNumber two, Apple is a phone company, absolutely. 70% of their revenue comes from phones. The Amazon case is more complicated, because so much of their value is derived from cloud services, but they would be close to a $500 billion business without AWS as just an online retailer.", "score": 0, "replies": [{"body": "Don't know what you are trying to say. Are you long or short TSLA?", "score": 1, "replies": [{"body": "What I’m saying is that having more than 10% of your portfolio in any given stock is irresponsible.", "score": 1, "replies": [{"body": "Up millions.", "score": 1, "replies": [{"body": "Being purely results oriented is a terrible thing to be in investing", "score": 1, "replies": [{"body": "Not result oriented. I used to say a right move or a wrong move should not be judged by the outcome. When I bought TSLA, I knew it was a low risk high return situation. Buying now is risky.\n\nYou didn't say, so you are shorting TSLA.", "score": 1, "replies": [{"body": "I am short Tesla, and it’s less than 10% of my portfolio, which I would encourage of everyone, short and long.", "score": 1, "replies": [{"body": "Why did you short Tesla? I'm trying to help you out.", "score": 1, "replies": [{"body": "Because it is currently worth about $90 billion more than it should be. There is not another company that has posted 10 straight years of GAAP losses like Tesla. It’s truly unique in the fact that despite never making money it still is valued above companies in its category making profits close to its revenue.", "score": 2, "replies": [{"body": "Tesla is not a car company. It's a tech company. It's a real rule breaker. It didn't make money, but it's going to make a lot in the next 20 years.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "https://www.beckerspayer.com/payer/apple-reportedly-launching-health-insurance-in-2024.html#:\\~:text=Apple%20will%20reportedly%20enter%20the,18.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "21 at 30K... all in baby!", "score": 3, "replies": [{"body": "Damn you’re off to a blistering start...\n\n-25 with 65k, all in", "score": 2, "replies": [{"body": "Thanks! Sound like we'll both find huge success :)\n\nIt's crazy reading how many shares many people have on here, isn't it? I almost feel bad I didn't invest earlier, I just didn't know better at the time lol.\n\n65k is an amazing position, our future is bright! I'm continuing to try and add every week, wbu?", "score": 2, "replies": [{"body": "Not really sure if I should be saying this here but fuckit. I’m an employee and we have a stock purchasing plan where we can put up to 15% of our paycheck into it, and at the end of the 6 month period they buy us stocks at a 15% discount, at the price of the beginning or end of the period, whichever is lower. It’s an insanely good deal, and how I’ve gotten around 90% of my current holdings.", "score": 3, "replies": [{"body": "That's amazing!! Also shouldn't say this, but I work with you guys also. I don't work directly for Tesla, so I'm not sure if I would qualify for the program... lol. We provide the metal for the powerwall units, among other things. I've actually been advocating that Tesla buy our company out. We could ramp production for much cheaper if we didn't have to focus on other clients, which we would prefer. It's really fun so far, I've been working there for about 1 year now.", "score": 1, "replies": [{"body": "That’s sick. Yeah I’m pretty sure the program is full time employee only. What’s extra crazy is how few people take advantage of the program. My roommate worked there also until recently and for the two years we were there I was completely unable to convince him it was a good idea. Like even if you sell right away it’s a 17% ROI over 6 months for crying out loud!", "score": 2, "replies": [{"body": "I would absolutely kill for the deal - he's insane, lol! Maybe he had extensive bills?\n\nEven of he starts buying now, without the deal, it's still a great opportunity! It's great to talk to someone who works for the vision of Tesla, in addition to believing. I can't wait to see where things take us in 6 months, let alone multiple years!", "score": 1, "replies": [{"body": "Me too man. And he just doesn’t really trust most money related things, thought it was too good to be true. \n\nFunny story about being long tesla, when I was a senior in high school I convinced my dad to invest a bit of money in TSLA. He pulled out after he doubled his money and I was like “wtf” and he told me “oh come on. It’s never going to go over $70/share”", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You’re forgetting money appreciates a lot with time. Having 80% in TSLA at 25 is still a ridiculous proposition. $100K is a significant chunk of retirement if invested responsibly", "score": 2, "replies": []}]}, {"body": "I've got it on margin so 196% or so", "score": 4, "replies": [{"body": "Using margin like that is looking for trouble. Many people got burned in the past because of margin. But, if the stock runs to $1k, you would triple your account instead of double.", "score": 2, "replies": []}, {"body": "This is a terrible investment that will bankrupt you relatively quickly", "score": 1, "replies": []}]}, {"body": "I'm at 100%. 50 years old. No one depending on my income/wealth except me.\n\nLive in a country with free health care and okayish pensions from work.\n\nHad no private savings but as a side hustle I play lowstakes poker and pretty stable at $10/hour winnings. Had saved up around $20k from three years of winnings. Yes, that's a lot of hours.\n\n$20k will make very little difference to my lifestyle after retiring.\n\nSo I put it all on Tesla at round $240 average.\n\nWon't sell or diversify until I hit $200k. Then it'll make a difference.\n\nI have to say I'm playing less poker now though. Making $10/hour doesn't compare well to making $100/hour watching the stock ticker.", "score": 5, "replies": [{"body": "What if you've hit over 200k, it's 80% of your portfolio, and half of that is unrealized profit.   \nWhat would you do then.", "score": 1, "replies": []}]}, {"body": "You should let it grow untill it is clearly overvalued. Riding a bull is not easy, rebalancing early a cause to miss out for a big part on a great opportunity u saw, hold your gun powder dry so that u can sell off strong when it goes above say 1k/2k this year and everybody is talking about 10k, bullish as fuck, that is the time to lock in profits and cut back your exposure dramatically, check my youtube:  [https://www.youtube.com/watch?v=REEx2qdKMNw&t](https://www.youtube.com/watch?v=REEx2qdKMNw&t=163s)", "score": 3, "replies": []}, {"body": "Rebalancing can really help gains as you take profit on winners and use it to buy more of other assets.", "score": 2, "replies": [{"body": "+1 rebalancing is great", "score": 2, "replies": []}]}, {"body": "30-40%, it was about 10%, but now closer to 20%.  Most of my portfolio is in index funds etc.  TSLA/AMZN are my big stock owns.", "score": 2, "replies": [{"body": "Don’t own stocks that large a portion of your portfolio. Especially not stocks in the same category (tech) as Tesla and Amazon", "score": 1, "replies": [{"body": "Why", "score": 1, "replies": [{"body": "Because diversification is good? Volatility will kill you, and the most important thing to an investor is to survive to the next day.", "score": 1, "replies": []}]}]}]}, {"body": "50%", "score": 2, "replies": [{"body": "So 50% is your max %? When it hits that you'd sell? This is what I was looking for...", "score": 1, "replies": []}]}, {"body": "Not a bad idea to atleast sell your principal investment.   I’m completely sold now though", "score": 2, "replies": []}, {"body": "I trimmed 20% today. So now down to about 20% of all investments. $AMZN at about 10%.", "score": 2, "replies": []}, {"body": "Its currently at 20% Thats already a lot but i expect this number to grow even higer as the year progresses. If my read on Tesla is correct then they will absolutely kill it in the second half of 2020, Of course its a Gamble, but one with such a high chance of success that the risk is absolutely worth it.", "score": 2, "replies": []}, {"body": "I am comfortable with up to 50%. \n\nI had less than 50% in Tesla stock last summer. Then it rose to $420/share and Tesla was 2/3 of my portfolio. So I sold half of my Tesla stock at 420. Now it’s only about 1/3 of my portfolio. I have 40% in cash. My other investments like enphase are up as well, so it’s relative to other investments, I want to trim it back to below 50% of it gets too high.  Super year for investing across the board and Tesla in particular.", "score": 2, "replies": []}, {"body": "Haha I cringe to say it out loud but tesla is not only close to 100% of my portfolio, it’s close to 100% of my non-retirement savings. \n\nI know it’s risky but I really believe in the company and the product and I’m 25 with a pretty good income so fuckit", "score": 2, "replies": []}, {"body": "25%", "score": 1, "replies": []}, {"body": "Tesla has grown to 45% of my portfolio.  \nI expect it to keep growing and I will only sell other stocks when I need money.", "score": 1, "replies": [{"body": "Cool, what will you do if it reaches 80%. Will you trim?  Most folks here who are saying \"100% , no max\" haven't had such a large stake drop significantly.\n\nLong term I'm a bull, but it's risky to put all your eggs in one basket.  \nEven if TSLA stays successful, the valuation given is by the market.", "score": 2, "replies": [{"body": "I don't expect to trim at all.  \nI use to say \"I will retire on my Tesla shares\" to people and I intend to save them as long as I can.  \nMy plan is to sell from my other shares when I need money and in 10 years I might start sell from my Tesla shares.  \nIn the end it will approach 80-90% of my portfolio I am sure.", "score": 1, "replies": []}]}]}, {"body": "100%. Sell when it will pay for my renovations + new car.", "score": 1, "replies": []}, {"body": "420%", "score": 1, "replies": []}, {"body": " As long as Tesla doesn't go bankrupt, let it drop to the floor so I can mop it up.", "score": 1, "replies": []}, {"body": "90%. Same as I did with bitcoin.", "score": 1, "replies": []}]}
{"title": "Never Forget: Morgan Stanley set a $10 bear price target for TSLA 6 months ago, citing lack of Chinese Demand for Tesla Products", "selftext": "&#x200B;\n\nhttps://preview.redd.it/90v48ua7tr941.jpg?width=960&format=pjpg&auto=webp&s=90255eb302ff87770acf2604a08c33968fc99073", "id": "emb276", "created_utc": 1578583349.0, "score": 318, "upvote_ratio": 0.97, "num_comments": 67, "comments": [{"body": "My friends in China just told me that there’s a 6 month wait for a new MIC Tesla.  As in, planned production for the next 6 months at GF3 is already sold out...", "score": 67, "replies": [{"body": "Tesla's China website still says delivery in Q1 2020 for new orders of SR+. The social media hype doesn't match the official Tesla website for some reason.", "score": 18, "replies": [{"body": "Tesla's website is frequently wrong about the wait time.", "score": 19, "replies": [{"body": "Yeah true but I’m more likely to go with Tesla’s website over some random dude from Reddit’s Chinese mate...", "score": 8, "replies": []}, {"body": "Why do you think that is?", "score": 1, "replies": [{"body": "Many reasons. 1. the wait time is complicated, 2. it's unnecessary to change it back and forth everyday. Sometimes people order a car thinking it will to take 4 weeks, then the car shows up the next day. Sometimes they order it, suppose to get it the next week, but it takes 5 weeks.\n\nI think the 6 months wait time is about right. By March they probably will announce the full year production has been claimed. That news will lead to more demand. \n\nSome analysts think demand for GF3 Model 3 will be low, those analysts have no clue what they are talking about. Tesla can sell at least half million Model 3 in China per year.", "score": 12, "replies": [{"body": "Thanks! While I disagree on most conjunctures you make it good to see thought out analysis", "score": 1, "replies": []}]}]}]}]}, {"body": "ItS jUSt peNt uP DEmaNd", "score": 0, "replies": []}]}, {"body": "Following any analysis from any large firm will get you burned majority of the time since it’s just a way of trying to time the market just a professional version. Any future price on stock is silly since it’s price is based on trade volume and willing buyers/sellers. The only thing to take from those analysts is their reasoning behind the bear and bull case and then fact checking those cases yourself. These guys can be just as lazy at work as any other person and they tend to drastically change their price targets as time goes anyway.", "score": 27, "replies": [{"body": "As an index fund investor, I'm smiling as I remember Vanguard's projection that the next two years will have slower than usual global growth.  This was their position going into 2019.\n\nDomestic stocks made about 25%.  International stocks made about 13%.\n\nThe experts are wrong 3/4 of the time.  That's worse than a coin-flip.", "score": 13, "replies": [{"body": "So, as an /r/wallstreetbets guy, you’re telling me if I always bet against the analysts I’ll be up 75%?", "score": 7, "replies": [{"body": "No, because then you're an expert and experts are wrong 3/4 of the time.", "score": 13, "replies": [{"body": "I probably shouldn’t have just yolod Tesla puts then. Guh\n\nEdit l: fwiw, if you’re a broke ass anyway, and you blow your paycheck on partying every week anyway, you might as well throw a few of them at long shot shorts and puts, sure you may lose a grand a bunch of times, but if you get that big one once, you’re in the cake for life. It’s kind of like lotto with better odds and at least a potentially somewhat predictable strategy.\n\nI guess sports gambling could pay off too if you just go for long shots, but reasonable ones, like boxing or mma where one lucky shot can get you the money.", "score": 2, "replies": []}]}, {"body": "guuuuuh", "score": 3, "replies": []}, {"body": "I believe the actual statistic that I butchered was \"people on average time the market wrong, 75% of the time, and on average, experts are no better\".", "score": 1, "replies": []}]}]}]}, {"body": "Morgan Stanley are grossly incompetent or corrupt", "score": 23, "replies": [{"body": "Corrupt. I suspected a long time ago, so I started following them and tracking their analysis. My takeaway is corruption.", "score": 11, "replies": [{"body": "Paid by big oil and auto clients to release this “analysis” \n\nCorruption for sure", "score": 6, "replies": [{"body": "Another explanation is \"auto analyst echo chamber\" - most of them follow manufacturing sectors and know very little about high-tech firms.\n\nAdam Jonas never ~~rated GM lower than \"Buy\",~~ never had a \"bearish\" price target for them - despite GM having gone bankrupt just 10 years ago ...", "score": 5, "replies": [{"body": "What are you talking about? Jonas has had numerous sell ratings on GM. He was very bearish on them from 2015-2016.", "score": 3, "replies": [{"body": "I only checked the last 3 years, and you are right about that, I've corrected my comment.", "score": 1, "replies": [{"body": "You corrected it to something that is also incorrect. He puts bull and bear cases in most of his reports. Have you ever read one of his analyst reports or just the press reporting of it? \n\nHere’s one recent example.\n\nhttps://www.corvetteblogger.com/docs/GMcorvette_by_MS_11-19-19.pdf", "score": 0, "replies": []}]}]}]}, {"body": "Since Tesla is t paying for ads, the smear campaign has extended to criticizing the company.  The new technologies shown in automobile ads are nowhere near as cool as what a Tesla can do.  And there are troops of people whose job it is to keep the capabilities of Tesla cars out of the public’s sight.", "score": 1, "replies": []}]}, {"body": "It's interesting, Adam Jonas seems to be a big fan of Elon based on his questions during earnings calls. I used to intern at Morgan Stanley in 2016-2017 and his price target reports were pretty positive IIRC.", "score": 2, "replies": [{"body": "He’s been very bullish on Tesla. One of the first big Tesla bulls. There’s a few people on here who dislike him because the $10 bear case scared them into selling stock last year and they blame him for losing $$", "score": 1, "replies": []}]}]}, {"body": "Why can't it be both?", "score": 3, "replies": []}, {"body": "Corrupt. They were complicit in the BYND lockup expiration engineering, putting out an absurd upgrade (when BYND was near 200) mid-market in response to falling price.", "score": 2, "replies": []}, {"body": "What is incompetent or corrupt about speculating about a worst case scenario? You do know that the $10 weren't his price target right?", "score": 1, "replies": []}]}, {"body": "These guys have no idea. The last 4 years of watching Tesla has taught me that I make a better financial analyst than the majority of these professionals.", "score": 21, "replies": [{"body": "They try to take emotion out of everything and so they miss the big ones. You should take emotion out of trades, but not evaluations.\n\nApple selling the iPod and the iPhone and many other things is partially having a good product and good marketing. A larger part is they make their products speak to people on an emotional level. The market people looked over specs, they reviewed cost, they looked at everything but could not understand what they were missing. It is an intangible human element. Tesla does the same thing. The product just delights people. I have yet to sit someone in the car, have them drive it even around the parking lot, play with the screen and not go \"wow... just wow\". They want more. They can't always say why but they do.\n\nThat is what they miss.", "score": 7, "replies": []}]}, {"body": "Idiots, or malicious?", "score": 4, "replies": [{"body": "It was textbook manipulation. Scare mongering to force the price down. Buy the stock on the cheap and offload for a large profit. Rinse and repeat. And when they fail? Bailouts! What an industry.", "score": 13, "replies": [{"body": "It's a f'ing scam and they get away with it.", "score": 2, "replies": []}]}]}, {"body": "Adam Jonas’ bull case was $500 - the outcome was binary at the time. He defined this concept quite well.", "score": 3, "replies": []}, {"body": "It's their bear case. In a DCF (discounted cash flow) valuation, you usually have several different \"cases\" over which you forecast performance. Normally you have a bull, bear, and base case. The bear case is your worst-case scenario and/or low volume and low or negative margins. The base is exactly what it sounds like, the status quo is maintained. The bull is your best-case scenario, where the company outperforms forecasted volume and/or enjoys high margins. You either look at the range of resulting prices or assign probabilities to each case and then calculate the expected value across all cases.   \n\n\nStill an insane forecast, but also not the whole picture.", "score": 3, "replies": []}, {"body": "After reading a lot of blatantly incorrect comments in this thread I realize most of you (including OP) have probably never read Morgan Stanley’s reports on any other auto manufacturer. They usually have target,base,bull, and bear case. It’s not some grand conspiracy where only Tesla gets a bear case.\n\nHere’s a GM example \nhttps://www.corvetteblogger.com/docs/GMcorvette_by_MS_11-19-19.pdf\n\nAnd here’s ford\nhttps://www.autonews.com/assets/PDF/CA114643314.PDF", "score": 2, "replies": []}, {"body": "These guys are brain dead", "score": 1, "replies": []}, {"body": "And a $391 bull case at the same time. Way to leave that part out.", "score": -32, "replies": [{"body": "You mean like how [CNBC left that part out of their headline, too?](https://www.cnbc.com/2019/05/21/morgan-stanley-tesla-shares-could-drop-to-10-in-worst-case-scenario.html)\n\n... or [business insider](https://markets.businessinsider.com/news/stocks/tesla-stock-price-morgan-stanley-bear-price-target-lowered-10-2019-5-1028217695)... or dozens of other major media platforms...", "score": 38, "replies": [{"body": "Not MS fault", "score": -27, "replies": [{"body": "Ok then, show me any example of Morgan Stanley publishing a \"bear price target\" for Tesla's competition.", "score": 12, "replies": [{"body": "[Here you go](https://www.autonews.com/assets/PDF/CA114643314.PDF)\n\nFor Ford See pg 7.  Target $15, Base $12, Bull $25, Bear, $6.  Thats the way all these MS research papers are.  They provide their clients a detailed picture and where they expect the stock will go and can go under bull and bear scenarios.", "score": 3, "replies": []}, {"body": "So your mad they had multiple price targets?", "score": -23, "replies": [{"body": "I'm just here to point out how stupid and inconsistent institutional and mainstream media coverage of TSLA is.\n\nI'm calling out Morgan Stanley for crappy analysis, and mainstream media for inconsistent coverage. Not only were the concerns ridiculous, the bear price target was ridiculous and the range between targets was meaningless (\"it's worth somewhere between $10 to $391\"). \n\n\nI'm also calling out mainstream media's flagrant inconsistency when covering these targets. Because [suddenly today CNBC chooses to focus on the $500 bull case target.](https://www.cnbc.com/2019/12/05/morgan-stanleys-adam-jonas-tesla-stock-bull-case-raised-to-500.html)", "score": 19, "replies": []}, {"body": "More that they have no idea what they are talking about.\n\nIt might rain today.  Or it might not.", "score": 9, "replies": [{"body": "Idk Jonas for all his problems has been one of the more accurate in terms of production and scaling. No one has a crystal ball but Jonas has been decent on this one.", "score": -1, "replies": [{"body": "Of the worst he is toward the top.", "score": 9, "replies": [{"body": "Tallest kid in kindergarten.", "score": 4, "replies": []}]}]}]}, {"body": "I feel like this sub is becoming as irrational as r/weedstocks it's a bit annoying. Not that PTs are worth paying attention to, but bear and bull case make a lot more sense than a single random number, and $10 isn't outrageous if the bear case is bankruptcy (not that I think it'll be the case, but it's not unfathomable).", "score": -3, "replies": []}]}]}, {"body": "That target price was clearly and attempt at pounding the stock while it was vulnerable, don't kid yourself. Also remember that \"leaked\" conference where he pretends Tesla would deliver below 70k cars?", "score": 3, "replies": [{"body": "MS holds 959,827 shares, it’s like the 15th largest share holder.\n\nSo what’s your conspiracy theory?", "score": 1, "replies": [{"body": "Why are the holding if they're advising \"sell\"?", "score": 1, "replies": [{"body": "They didn’t have a sell rating it’s been Equal-Weight for a while.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "At that time, Jonas was like this: bear case $10, the bear case is highly likely to happen. Apple and Amazon etc will not buy Tesla. Nobody wants to own a business that it's cars can burn down buildings. The bull case is 390, but zero chance to happen. He made 4 lies in three sentences.\n\nMeanwhile, MS added TSLA shares.\n\nAre you not familiar with the details or you just want to argue for Jonas? You know why you got so many down votes? Many people lived through that time. We know what MS/AJ did.", "score": 4, "replies": [{"body": "98 percent of North America's grizzly bear population lives in Alaska.", "score": 3, "replies": []}, {"body": "MS had an Equal-Weight raring at like $250, and issued a bull and bear case. And yes they are the 15th or so largest shareholder of Tesla.", "score": 1, "replies": [{"body": "Yea - very common MS research report. I remember Katie Huberty would write reports about Apple years ago and garner similar headlines. She'd have a bear case of 50, bull of 200, super bull of 250 or something in an easy to read chart, but the media would only pick up on the bear side. She is now seen as one of the top Apple analysts. \n\nI'm NO fan of analysts - but this isn't their fault. It is poor media and journalist practices looking for clickbait headlines.", "score": 2, "replies": []}]}]}, {"body": "Not sure why you’re getting downvoted for adding the full story.", "score": 3, "replies": [{"body": "Thus is the life of a flufferbot", "score": 6, "replies": []}]}, {"body": "Bold of you to venture over to this sub lmfao", "score": -1, "replies": [{"body": "Bro I live here, I’ve been here from the beginning.", "score": 4, "replies": [{"body": "I’ve only been here a year and I feel like an old timer.", "score": 2, "replies": [{"body": "It’s a good place, nice people.", "score": 2, "replies": []}]}]}]}]}, {"body": "Crowd thinking beats 1 expert every time.\n\nMorgan Stanley probably has 1 poor Joe (or Jane) trying to figure Tesla out, all while trying to figure out 50 other companies he (or she) has no idea abut.", "score": 0, "replies": []}, {"body": "Adam Jonas is a complete nincompoop. I can’t believe that people trust a joker like that with their money.", "score": 0, "replies": []}]}
{"title": "Banned from r/Robinhood for Speaking Out", "selftext": "[deleted]", "id": "emalg0", "created_utc": 1578581236.0, "score": 54, "upvote_ratio": 0.84, "num_comments": 59, "comments": [{"body": "[deleted]", "score": 87, "replies": [{"body": "You just described half of the subs on reddit.", "score": 21, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Again that’s half the mods on here.", "score": 5, "replies": [{"body": "Robinhood is the only sub I know of that has a mod who gives literally every single submission some passive aggressive flair and pins his (often wrong) comments to the top of every post then bans anyone who corrects him. Robinhood's mod is uniquely pathetic.", "score": 11, "replies": []}]}]}]}]}, {"body": "Banned a week after telling a mod he was wasting space by insulting people instead of offering constructive advice and answering questions.  Fuck that jerk off sub.", "score": 44, "replies": [{"body": "You’d think if they hired someone to run a PR sub for themselves, they’d have the presence of mind to hire a moderator who isn’t gonna go off on users and call them names, etc. like imagine if Fidelity’s Twitter account or whatever was run that way lolol", "score": 14, "replies": [{"body": "Exactly the reason I predict RH won't be around in 5 years.  They aren't in it for the long haul.", "score": 2, "replies": []}]}]}, {"body": "Margin maintenance depends on the assets you're holding. If you're holding volatile assets it could be as high as 100%. Typically, it's 25%.", "score": 12, "replies": [{"body": "But the issue is that I’ve never *bought* anything on margin", "score": 4, "replies": [{"body": "Yes you do. Robinhood uses margin accounts. Otherwise you wouldn't have instant access to you deposits and after selling a stock you would need to wait 3 days to get the cash back to continue trading on that account. Lookup margin account vs cash account.\n\nTDA shows my margin requirement as matching my account balance too and I don't borrow money.", "score": 14, "replies": [{"body": "T+2 days now for settlement (I.e. I sell on Tuesday I can access the cash on Thursday if no margin)", "score": 2, "replies": []}, {"body": "Gotcha. Still shady imo. Like they never explain that. And you gotta explain that. It makes it appear as though I bought something completely on margin.", "score": -4, "replies": [{"body": "Oh boy sounds like you went off the rails when you didn’t understand funds don’t deposit immediately and trades don’t actually settle immediately. If you ever sold stock with a real broker you know that it takes a few days. Anything you buy in the meantime is “on margin” until everything clears.", "score": 14, "replies": []}, {"body": "I had the same issue. Nothing on margin and I had a margin call if I drop below a line. I sold everything for a day trading ban. The reasoning is the instant access to money feature. Once the money hits your rh account from ur bank account and it is verified (usually takes multiple days or a week) then it will go away. In the mean time you’re using instant access aka hidden margin in the eyes of RH. I’m switching over to Merrill soon", "score": 2, "replies": [{"body": "Its not \"hidden margin\". You have a margin account.", "score": 2, "replies": []}]}, {"body": "RH is cancer, but it’s not their job to explain it. You have to accept terms when you register.", "score": 1, "replies": []}]}]}, {"body": "So what? Margin requirements exists whether you've used margin or not. It's completely irrelevant.", "score": 6, "replies": []}]}]}, {"body": "Honestly weird stuff like that is why I do not touch Robinhood Gold.", "score": 19, "replies": [{"body": "They activate it for you if they fuck up and double credit you dividends and you withdraw or spend those dividends. \n\nHappened to me.", "score": 6, "replies": [{"body": "Holy crap that is fishy.", "score": 2, "replies": [{"body": "And then they wanted $75 or whatever to transfer my account. So i told them fuck you, sold everything i had, and withdrew it all in cash.\n\nI tried RH because it was a new thing, but seriously fuck that shitty company.", "score": 5, "replies": [{"body": "Yeah I am thinking of opening up a TD account myself. You know, so I can actually learn more about trading than just yeeting $200 into some calls.", "score": 2, "replies": [{"body": "Buying alone calls is horrible, just reading posts here i learned real quick to not do that if i wanted to make money.\n\nThen again its WSB so YOLOBLAST", "score": 2, "replies": [{"body": "But that is why I love it.", "score": 1, "replies": []}, {"body": "I'm fairly new and still learning options. If I shouldn't be just buying calls what's the correct way to do it?", "score": -1, "replies": [{"body": "There are strategies you can use that use a mix of buying/selling calls/puts. You can sell (to earn premium) and then buy to cap off max losses. [The Wheel](https://www.reddit.com/r/options/comments/a36k4j/the_wheel_aka_triple_income_strategy_explained/?st=k58kuq2n&sh=adb40280) has been beaten to death as a topic and its one i use. \n\nhttps://www.investopedia.com/trading/options-strategies/", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Same here. I’m so tempted but stories like this keep me straight.", "score": 2, "replies": []}]}, {"body": "They hid my post complaining about their shitty options not loading for 5 minutes at open untill it would be pushed way down like a week later.", "score": 7, "replies": [{"body": "Dude. Something is going on. I’m not kidding like my account just shot up to $9k, bam, margin maintenance raised. And again, I’ve never bought anything on margin.\n\nThey’re gonna end up in jail ALLEGEDLY I swear to God", "score": 4, "replies": [{"body": "Report to the sec", "score": 3, "replies": [{"body": "I think it would be FINRA. However looks like they’ve already been reported so no need to worry lol", "score": 1, "replies": []}]}, {"body": "We’re you all in on options?", "score": 1, "replies": []}]}]}, {"body": "Only reason i stay in /r/Robinhood is to tell people I don't use robinhood", "score": 6, "replies": [{"body": "Yes! I can’t believe they’re expanding to the U.K. but I guess any Ponzi scheme needs to expand or collapse ALLEGEDLY! PARODY!", "score": 1, "replies": []}]}, {"body": "What the fuk you’re talking about? We all uses RH and don’t have that issue", "score": 4, "replies": [{"body": "This guy was removed from r/robinhood for cursing at the moderators.", "score": 2, "replies": [{"body": "The moderator literally also cursed at me, look it up. They can’t even keep their trolls in line\n\nAlthough guessing there’s a nonzero chance you’re also a troll", "score": 2, "replies": [{"body": "Welp, I came from the original post on robinhood. I did not see anyone use profanity towards you. You can think whatever you would like of me.\n\nEdit: here’s a link for anyone interested\n\n\nhttps://www.reddit.com/r/RobinHood/comments/ema90h/robinhood_increasing_my_margin_maintenance_daily/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 4, "replies": []}]}]}]}, {"body": "Probably run by the RH social media team", "score": 4, "replies": [{"body": "Oh for sure, was naïve to think otherwise", "score": 1, "replies": []}]}, {"body": "I got banned a long time ago when I thought I was commenting on wsb and I said something along the words of “stfu autist”", "score": 4, "replies": []}, {"body": "I didnt know there was a robinhood sub. I hate robinhood, I make the most assinine calls there hoping my shit gets shut down, but I still win somehow. One of my new years resolutions was to never touch it again.\n\nEdit: decided I should learn more from the sourcehttps://www.reddit.com/r/RobinHood/comments/emb70n/robinhood_its_proof_right/", "score": 5, "replies": [{"body": "This is the golden comment", "score": 3, "replies": []}, {"body": "It’s sad bc a version of their concept that did work *would* be fantastic, but it just hasn’t panned out that way", "score": 1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "That’s a good point", "score": 1, "replies": []}]}]}]}, {"body": "Weird. You've never sold any options or anything?", "score": 3, "replies": [{"body": "Absolutely not. I’ve only ever been long options, never long shares or short options or anything that could have allowed me to use margin", "score": 2, "replies": [{"body": "Instead of creating a meme I'm going to describe it here. Picture this: photo of somalian pirate from that movie pointing to his eyes wearing a robinhood nametag saying: \"it's my money now\"\n\nBut seriously that fucking blows. You cant sell your positions?", "score": 1, "replies": [{"body": "I’m afraid they’re gonna claim it all against a fictitious margin loan\n\nShit is RI-diculous", "score": 1, "replies": [{"body": "Do you have gold? Did you recently do a deposit? Maybe they gave you your max instant deposit of $10k but then your bank denied the withdrawal.", "score": 3, "replies": []}]}]}]}]}, {"body": "Yeah that mod group is fucking retarded AF. Like they ban you for insulting them, or making a logical point. They make every single person in this group sound like Elon musk himself. That’s how retarded they are.", "score": 3, "replies": []}, {"body": "I don't understand why you wouldn't be able to sell your calls. Those are volatile assets so they don't really want to loan against them, but that in no way affects your ability to sell those contracts. I'm not sure what you are on about.", "score": 3, "replies": [{"body": "I didn’t loan against them. The issue is that I never bought them on margin in the first place. In fact, YOU CAN’T buy options on margin in Robinhood. But now they are *saying* I have a margin maintenance requirement that is “erroneous” but that they are “unable to fix,” so if I liquidate I could lose a bunch of money against the non-existent margin loan I took out\n\nI know, I know. But yes, their platform really is that shitty and it shouldn’t be surprising", "score": 1, "replies": [{"body": "I have a feeling you don't understand the definition of margin maintenance. I suggest reading it a few times until it starts to make sense. \n\nhttps://robinhood.com/support/articles/360026463791/margin-maintenance/", "score": 2, "replies": []}]}]}, {"body": "Yeah, it is the only sub I'm banned from in over 10 years on reddit.  The mod is a toxic power tripping pussball and one of the reasons I uninstalled the RH app and moved to TD.", "score": 2, "replies": []}, {"body": "If even a solid company with a long track record like Robinhood could do this then where are we supposed to gamble??? Market is RIGGED", "score": 2, "replies": [{"body": "Agreed. Terrible. For real I should’ve taken the 3 years of online complaints from users about errors that would never come close to happening at other brokerages as a huge red flag\n\nI can’t wait till they ALLEGEDLY! PARODY! find out how much those guys have been skimming from client accounts, I’d PARODY ALLEGEDLY say it’s conservatively in the $10m range", "score": 3, "replies": []}]}, {"body": "They need some new mods, I got banned as well for posting about the cash management Robinhood has. The mods are horrible and don't give any advice and just shame people instead of giving actual advice.", "score": 1, "replies": []}]}
{"title": "Pigs get fat, hogs get slaughtered", "selftext": "[deleted]", "id": "emcgqc", "created_utc": 1578589278.0, "score": 151, "upvote_ratio": 0.95, "num_comments": 58, "comments": [{"body": "YOU MEAN STOCKS CANT GO UP 10% A WEEK FOREVER?", "score": 154, "replies": [{"body": "Stocks can't but stonks do.", "score": 62, "replies": []}]}, {"body": "two of the best pieces of advice i’ve received on this sub are:\n\n1. pigs get slaughtered \n\n2. holding onto unrealized gains is missing out on more ammo (money) to make new plays\n\ni’m glad i sold my calls yesterday, even if i missed out on a small gain since i sold in the middle of the day. like you said, pigs get slaughtered.\n\ni’m still bleeding a decent amount today because i dropped my strategy and fomo’d into one $500 call, but i could lose 100% of it and still be up 20% on the year so far because of my gains yesterday so whatever happens, happens. but like you said, pigs gets slaughtered; and have a strategy and stick to it.", "score": 63, "replies": [{"body": "Cool. I was worried I’d get shit on but I love you guys so I wanted to try to remind people to take the Ws and move onto the next play if you’re worried about losing those gains.", "score": 29, "replies": [{"body": "Lmao I can’t guarantee you won’t get shit on by other folks, but the advice you gave is valuable. Most of the time there’s not a lot of sense in holding onto unrealized gains unless you’re restricted by PDT or trying to show off a ten-bagger for internet points. Even if you’re still bullish, take the profits and re-roll into farther out calls.", "score": 12, "replies": []}]}]}, {"body": "Elon just read this and sold a fuckton to trigger your limit and snatch your shares. You just played yourself.", "score": 19, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "I’m actually long on AMD. Not much, only 4-5k. But my strategy for them is 4-5 years. I think they’re going to keep the top spot with some of their recent tech. If they can break through in GPUs it’d be amazing to see them dominate two separate sectors. \n\nI switch away from AMD myself years ago but they’ve got some awesome tech the last few years and I think they’re positioned well to keep going up.\n\nIt’s hard to imagine the ryzen being a one-off win. It seems AMD and intel have gone back and forth over the decades and I don’t think they’re done releasing good tech.\n\nIt’s insane how cheap and effective and $$/power some of their new ryzen -1600 series is.", "score": 4, "replies": [{"body": "I don't think they have much of a future myself. I think laptops are going to move to RISC-V and/or ARM within the next 5 years and take much of the consumer market with them. x86 based CPUs will be relegated to hobbyist status, and lose their economy of scale. The price will skyrocket, NVIDIA will make specialized video cards to go with popular RISC architectures, and that'll be the end of Intel and AMD.", "score": 0, "replies": [{"body": "How many windows/mac OS/Linux programs/applications that run on x86 do you expect to be ported to ARM in the next 5 years?  This is a ridiculous take.", "score": 4, "replies": [{"body": "It might take 10 years, but it's coming. The switch will have started in 5. Necessary x86 shit will be emulated or run offsite. Software will be developed and maintained in one place - no more splitting resources between PC and mobile. Expect an ARM macbook in the next 2-3 years and as soon as it's announced, everybody else will see the writing on the wall. AMD and Intel will both tank and be bought by IBM. Trust me. I'm from the future.", "score": 0, "replies": []}]}, {"body": "Your equation forgets high performance. They're will always be a need for high performance.\n\nARM will end up in pieces of shit for the time being, no one wants anything with arm in it when they're trying to do work.", "score": 2, "replies": [{"body": "Okay? So intel and AMD will be relegated to making cpus exclusively for servers used by AWS and Azure. The computer I use at work has a fucking i5. All our computation is done halfway across town on a giant ass server, or on a distributed cluster that we rent. Most people don't need that level of performance and they won't pay for it.", "score": 0, "replies": []}]}]}]}, {"body": "Did you just compare Tesla to a Barnes and Nobles? Bruh this is a Wendy’s.", "score": 5, "replies": []}]}, {"body": "Looking at the one month chart of TSLA, you literally could of said “okay, runs gotta be over, no fucking way” and then the market opened the next day.", "score": 22, "replies": [{"body": "Totally. And that’s absolutely your decision to make and Im not saying that won’t happen.\n\nFor me and my risk profile and what I have going on in life, putting 5k and walking away with 6k IB a tiny amount of time is what I wanted to do. \n\nI believe in TSLA long term and now I’ll wait for a longer term dip to get in again, but this is where I personally drew the line, and I absolutely could miss out. \n\nI just wanted to share that having a strategy for you is important, and if you’re worried about your gains going away like I was, then just take them and high five and move on. Sometimes you gotta take the win and call it good.\n\nI exited NIO at 4.15 and felt I missed out but now I don’t. \n\nFor me, pigs get fat and hogs get slaughtered. That’s just what I’m sharing.", "score": 17, "replies": [{"body": "Not disagreeing with you, I guess I’m asking how the fuck did 485 become your mark? lmao.", "score": 6, "replies": [{"body": "485 just to protect my profits from 490+ when overall they’ve been on huge streaks without much news or launches or anything.\n\nEventually your stock growth has to be backed by data and cash flows. It’s not a car company, and that means people are speculating on the tech, and it’s a very volatile stock with a leader that can say something and dump it or run it....I love the company but I didn’t feel very comfortable above $450/share holding for 2-3 years. \n\nWho knows maybe I’m wrong and this is where they turn apple and they’re not “just a car company” but at the end of the day, they might be a tech company, but there’s tons of “battery companies” out there - motorized scooter tech, etc. they’re all in the same tech development field despite having somewhat shit financials. \n\nHow does someone land at $530? Or $220? Somewhere between their financials and their speculation on the tech for future uses and exit lies the truth, and for me, I was happy to take 20% and go play in areas I’m more knowledgeable (not cars and battery tech).", "score": 1, "replies": [{"body": ">Who knows maybe I’m wrong and this is where they turn apple\n\nThat's why the saying \"If I only bought Apple in 1980 and held for my entire life I'd be rich\" is retarded, even with Tesla you can't be sure but they definitely look like perfect match for hipster fanboy kids like Apple, epecially back then when probably broker ripped you off with fees just for having an account. Although nowadays you only need to wait a decade or less to make mad money just from holding in the age of the Internet everything sped up.", "score": 3, "replies": []}]}]}, {"body": "in at 250, out at 478, will reload back lower, bull thesis intact long term", "score": 2, "replies": []}]}]}, {"body": "This sounds like the opposite of a yolo.", "score": 14, "replies": [{"body": "yOlO", "score": 1, "replies": []}]}, {"body": "When do I sell my TSLA $600 1/17 calls?", "score": 5, "replies": [{"body": "Whats the point of buying calls if you don't intend to hold them?", "score": 5, "replies": [{"body": "So not now is what you’re saying", "score": 13, "replies": []}]}]}, {"body": "That’s why I sell on the way up. Buy on the way down. Buy the dip sell the rip", "score": 5, "replies": []}, {"body": "You're gonna pay to get your dogs teeth cleaned?  Jesus Christ let me have your fucking profits, I can spend it better then that!", "score": 6, "replies": [{"body": "She needs a tooth extraction if I don’t :(\n\nPuppers problems", "score": 3, "replies": [{"body": "So why don't you just go to CVS and get a toothbrush?", "score": 4, "replies": []}]}]}, {"body": "Stonks only go up", "score": 8, "replies": []}, {"body": "As much as we joke I think most people aren't completely retarded and just pretend like they're gonna hold forever to look cool", "score": 5, "replies": [{"body": "Haven’t sold. Speak for yourselves. Still cool as fuck.", "score": 2, "replies": []}]}, {"body": "BS! TSLA $600!", "score": 3, "replies": []}, {"body": "Enjoy the guitar!", "score": 3, "replies": []}, {"body": "It's hard to stop when you have 20%+ gains and you just want to watch it but I sold some Coca Cola, Blackstone shares yesterday after a huge dick spike. The biggest problem is what to do with the money, I don't need anything IRL besides paying my mom for the basement and everything is at ATH so feels shitty to buy now anything so basically you become a gay bear that wants stonks to go down although not entirely since I'm still holding my biggest long termholdings. So yeah, when you're taking profits but still want to invest then you're just waiting if youre not a margin player because after selling your top choice wouldn't make a sense to switch the money to secondary choice.", "score": 3, "replies": []}, {"body": "Aren’t pigs hogs?", "score": 2, "replies": [{"body": "Hogs are fat pigs, you can be a pig but not a hog, but you can't be a hog without ever being a pig. Dig?", "score": 2, "replies": []}]}, {"body": "Lol 40%", "score": 2, "replies": []}, {"body": "I know this is wsb, so I'm not expecting much of a serious reply.  I've been riding amd since it was ~15/share.  Currently up +192% and no idea if i should sell some just to cover my investment.", "score": 2, "replies": [{"body": "Amd seems to be positioned to keep going up. I don't know much about the stock market but I know alot about tech and amd looks like they will dominate the server side within a few years.", "score": 2, "replies": []}, {"body": "So if you would have kept and held AMD you would have been up over 300 percent?", "score": 1, "replies": [{"body": "I still have all my shares but since I bought more around $33 it brought the percentage down. Amd has been good to me and it might be time to cash some in.\n\nKeep in mind I’m not throwing investing huge like most the guys around here lol.", "score": 1, "replies": [{"body": "Sometimes when I double I will sell half to do something else and figure the others are free.  It’s bullshit but it feels right.", "score": 1, "replies": []}]}]}]}, {"body": "I am very new to trading (~4 months) and I get the point of locking in gains, especially on securities the growth rate of which will decelerate at some point in the (probably) near future. However, if a better position hasn’t presented itself, would you consider using a trailing stop instead of dumping your position?", "score": 2, "replies": []}, {"body": "Sir this is a Wendys", "score": 5, "replies": []}, {"body": "Please delete this. \n\nI enjoy watching this sub have a meltdown when there's a 1.5% correction in the Indecies", "score": 1, "replies": []}, {"body": "so all in on weekly puts?", "score": 1, "replies": []}, {"body": "imagine only being up 10% on TSLA", "score": 1, "replies": []}, {"body": "Is this call options of Tesla or straight stock purchase of Tesla? If its stock purchase of Tesla, you do realize that selling before holding for 1 year triggers short-term capital gain tax, right? If its options, then its short-term capital gains tax regardless.", "score": 1, "replies": []}, {"body": "I don't think your boyfriend will appreciate you telling all these degens that you sold out early so you could clean his nasty teeth.", "score": 0, "replies": []}, {"body": "Bulls make money; bears get slaughtered; pigs make money.  Got it.", "score": 0, "replies": []}, {"body": "Honestly $TSLA is a long term growth stock with a huge history of out performing the DJIA since inception in 2010. Tesla rose 2,446.03%\tversus the Dow’s paltry 62.03% meaning that we do not have a hog, but a fucking unicorn. \n\nThe Vanguard Group, Inc. owns a 4.32%\tstake in Tesla with 7,779,368 shares in total. They purchased an additional 41,839 shares of Tesla this year alone. Do you think Vanguard wants Tesla to fail? Vanguard holds stocks for the long term.", "score": -1, "replies": [{"body": "Euh, Vanguard has index funds. They literally have to buy Tesla as they buy the entire market.", "score": 1, "replies": []}]}]}
