{"title": "Forever Hold Stocks?", "selftext": "What are your forever hold stocks? (Stocks that seem to always go up) I currently hold $MA and $MSFT as my forever holds. Just curious what everyone else is holding on to.", "id": "ev7mnv", "created_utc": 1580228674.0, "score": 17, "upvote_ratio": 0.79, "num_comments": 59, "comments": [{"body": "$SPY", "score": 11, "replies": []}, {"body": "tsla msft aapl visa", "score": 22, "replies": []}, {"body": "I've held AAPL since 1985. Recently bought some TSLA, which I expect to hold on to for quite some time.", "score": 24, "replies": [{"body": "What is the ROI you have on Apple?", "score": 8, "replies": [{"body": "Over 35 years, about 100,000%. That's not compound interest, its how much the stock went up. I didn't reinvest the dividends.\n\nI simply bought a few hundred buck's worth because I was a fanboy for the company. It wasn't spectacular for a long time, until the iphone came out. Most of the growth is since then.", "score": 31, "replies": [{"body": "Nice!!\n\nThis is why you don’t sell half when your stock doubles, people!", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Many TSLA shareholders think that Tesla's superior products & tech will ultimately win out, despite any short term problems they have.\n\nIn a way it's a similar bet to Apple in the Smartphone market. Apple was a nobody in the phone market when they came in and disrupted it with the smartphone. Despite their advantage in market share at the time, Nokia just couldn't compete with Apple. Many think history will repeat, and the legacy automakers won't be able to compete against Tesla despite their much greater market share in the auto market today.", "score": 3, "replies": [{"body": "I feel late to the party with TSLA", "score": 1, "replies": []}]}, {"body": "Their debt to capital ratio isn't much higher than other car makers. The hope of course, is that they will grow their way out of debt being a concern, and it looks possible.\n\nI invested only $7k, and can afford to lose it all. Earning call is tomorrow, and we'll see if I'm just another idiot. It a definite possibility.", "score": 2, "replies": []}]}, {"body": "Why Tesla? I don't understand the valuation.", "score": -1, "replies": [{"body": "Tesla is valued like a tech stock, not like a car stock.\n\nAgain, its partly because I'm a fanboy. I drive a Tesla, and its hands down the best car I've ever owned.\n\nThere's a frequent phenomenon of people taking a test drive, then immediately putting down a deposit, even if they hadn't really planned to; the cars are that good. I was very pleasantly surprised when after ours, my very-much-not-a-motorhead wife was an instant convert and proposed we do so before we even got back into the salesroom. This is reportedly a frequent event.\n\nBut there also seems to be a lot of good news in the offing, in terms of sales, production capacity, execution, cost reduction software, battery tech advances, and increasing mandates on carbon emissions in many places. Tesla is years ahead of the competition in many fields.\n\nMy biggest worry isn't other car makers; its scaling the supply of raw materials (lithium and cobalt) for the batteries.\n\nThe earnings call is tomorrow, and we'll see if I've been a starry-eyed idiot. I only invested $7k, and can afford to lose it all. My \nhope is it  goes up 10x in the next couple of years, and I can buy a Cybertruck :-)", "score": 7, "replies": [{"body": "Interesting. What makes the car so good? I understand the added value is transferring from the hardware to software, but why Tesla. Is it the superior software they have? Mercedes (MBUX), BMW (iDrive7) and the others are also developing their infotainment systems. Volvo will use Android Automotive which is Android OS for cars.\n\nIf it is a tech stock, it means just that the ROE is bigger and thus the accepted P/E is higher. Tesla has the P, but not the E and not the ROE. How large the E will be and do we have visibility to that? \n\nNot related to Teslas valuation but some thoughts about the cilmate stuff:\n\nWhat comes to the environmental things, electric cars and also their batteries are not that sustainable. It requires loads of energy to mine the minerals for the batteries, and we clearly do not have capacity to produce minerals for millions of electric cars, not even talking about the capacity of the raw materials like u said. It would take 20 years with maximum automotive industrial factory capacity to build electric cars to completely replace the ICE cars. At the current cost levels electric cars are ridiculously expensive way to save the climate. We would be better of to put that money into R&D to produce industrial scale Power to X solutions so that we can take the Co2 from the air and transfer it into methane that can be then transferred into for example flying petrol or gasoline for ICE cars. Or create hydrogen from water that could be used in powercell cars. The infrastructure is there. Infra for electric cars isn't. Electric cars are great for cities to clean the air, and cheap to run for users, but globally they won't reduce any CO2 emissions. Even the produced electricity has bigger lifecycle emissions than some of the renewable diesel produced currently. They will be just good business for automakers and good for GDP growth. \n\nGDP growth and population growth are problematic for the climate. The reality is that we cannot stop emissions to grow (no matter what Greta says, or politics agree with each other), we are too dependent on fossil fuels. If people use planes (currently growing massively), flying petrol is needed and when flying petrol is produced from crude oil we will get diesel and gasoline plus couple others as by products which then will be either dumped on the ground or sold to people. \n\nTesla can be fantastic for single person, but solution for global climate problem, not. We need industrial scale power to x solutions and action to clear co2 out of the atmosphere by either planting trees, billions and billions or creating CO2 eating solutions.", "score": 1, "replies": [{"body": "Tried to do some research, if the case really is that Tesla could disrupt the market, sell 15m electric cars, be a monopoly in autonomous vehichles and taxis, plus other services etc. You sure will 10x your money based on the discounted cash flows. \n\nDid some research what auto medias think about model 3 and they seem to love it. So much that they have announced it literally the best car of 2020. Next, I must try it myself....", "score": 1, "replies": []}, {"body": "So never driven a Tesla?", "score": 1, "replies": [{"body": "No I have not. One family friend bought Model S but returned it because it had some problems and Tesla didn't either fix it or had horrible service. Hybrids sell well here. Maybe 1 or 2 Teslas in my city. \n\nWhat are you comparing Tesla to and why is it so good?\n\nIf it drives well, like every BMWs, Mercs, it still does not make the company ridiculously more valuable. It is the discounted cash flows that matter", "score": 2, "replies": []}]}]}]}]}]}, {"body": "JNJ is my biggest buy & hold forever stock.\n\nThey're such a huge & well diversified giant in the healthcare industry, they aren't going anywhere, no matter what might happen to the US healthcare industry.\n\nAnd they're a dividend king, they've been paying and raising their dividend for the last 57 years.", "score": 7, "replies": []}, {"body": "No stock. But GOOGL is strong with the force", "score": 4, "replies": []}, {"body": "I like to chase the dragon that is BABA.\n\nBut I wish I'd have sunk some of that into AAPL or MSFT instead.  \n\nI don't think TSLA is a forever stock, but I do think FB is here to stay.  Golden Age of Data Collection and all of that.", "score": 7, "replies": []}, {"body": "SPCE and LK", "score": 3, "replies": []}, {"body": "Johnson & Johnson. Maybe a boring stock Yes. But they sure know how to make business.", "score": 4, "replies": []}, {"body": "Tsmc, close to a monopoly.\nNo other competition in this scale of producing cutting edge chips.", "score": 5, "replies": [{"body": "Good recommendation. My Financial guru friend in Taiwan also recommended when I asked the best picks from him. It was 2 years ago", "score": 5, "replies": []}, {"body": "Close to monopoly how so? They have a ton of competitors.", "score": 3, "replies": [{"body": "They have a monopoly on the high end chips, as nobody else can manage 7 nm.", "score": 1, "replies": [{"body": "By now, let me say. I mean... It is not impossible to reach that, as it is to dukc Goog or Msft", "score": 1, "replies": []}]}]}]}, {"body": "MO, PMI, MSFT, GOOGL, AAPL, AMZN are the ones I don’t see selling.", "score": 3, "replies": []}, {"body": "FB\n\nPeople think they’re just a social media company but they’re a lot more then that", "score": 7, "replies": [{"body": "Maybe provide the reasons!", "score": 21, "replies": [{"body": "Huge data company, massive moat, growing cash pile. DYOR if you want more reasons", "score": 10, "replies": [{"body": "Lol, I know the reasons. You forgot VR", "score": 3, "replies": []}, {"body": ">\tHuge data company, growing cash pile.\n\nThis basically is because they are a huge social media company.\n\n\nAlso why is a growing cash pile a good thing?\nDo you want to invest in a operating company or a cash pile?\n\nIf you want a cash pile, you might just want to put it in your own account instead of on Zuckerberg’s account\n\n\n>\tmassive moat\n\nMySpace also had a massive moat at some point...", "score": -4, "replies": [{"body": "They really didn't. I hate when people act like people used Myspace like they use FB and Instagram today. They did not.", "score": 3, "replies": [{"body": "What’s different?", "score": 1, "replies": [{"body": "Almost everything. Just look at the demographic compared to Myspace at its prime.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Maybe provide the reasons!", "score": 1, "replies": []}, {"body": "Maybe provide the reasons!", "score": 3, "replies": []}, {"body": "Maybe provide the reasons!", "score": 1, "replies": []}, {"body": "Maybe provide the reasons!", "score": 1, "replies": []}, {"body": "maybe provide the reasons", "score": 0, "replies": []}, {"body": "Maybe provide the reasons!", "score": -2, "replies": []}, {"body": "Maybe provide the reasons!", "score": -1, "replies": []}, {"body": "Maybe provide the reasons!", "score": -2, "replies": []}]}, {"body": "$SPCE", "score": 2, "replies": [{"body": "Really? I’ve been thinking hard about this one.", "score": 3, "replies": []}, {"body": "Lol", "score": 0, "replies": []}]}, {"body": "Home Depot or Lowe’s", "score": 1, "replies": []}, {"body": "MSFT, AAPL, JNJ, EADSY, JPM, KO, ALB.", "score": 1, "replies": []}, {"body": "WM in addition to many others listed here", "score": 1, "replies": []}, {"body": "Fnv", "score": 1, "replies": []}, {"body": "AZUL, SNE, SE, OTEX, STM", "score": 1, "replies": []}, {"body": "MSFT, T, JNJ", "score": 1, "replies": []}, {"body": "Goog", "score": 1, "replies": []}, {"body": "Brookfield infrastructure partners is my forever stock. The world needs and will need infrastructure and they are even investing in technological infrastructure. In several countries. If you want a safer one, go with its parent: Brookfield asset management. More diversified, but less dividend. And might not grow as fast.", "score": 1, "replies": []}, {"body": "FB\n\nPeople think they’re just a social media company but they’re a lot more then that", "score": -8, "replies": [{"body": "Maybe provide the reasons!", "score": -2, "replies": []}, {"body": "Maybe provide the reasons!", "score": -1, "replies": []}, {"body": "Maybe provide the reasons!", "score": -1, "replies": []}, {"body": "aybe provide the reasons!", "score": -7, "replies": []}, {"body": "Maybe provide the reasons!", "score": -3, "replies": []}]}]}
{"title": "Are any of your family members basic white hoes 💁‍♀️💁‍♀️? If so report their behavior pls", "selftext": "Have those hoes been going to SBUX lately? \n\nHow about TGT? I bought calls during the dip and it’s been making me some tendies, when more tender than your sisters tiddies \n\nApple AirPods? Watches? Or just generally Apple shit? \n\nIf she’s a nerd did she go Intel or AMD for her last build? \n\nspit or swallow? \n\nIf you have any noods of them please PM \n\nThanks in advance", "id": "ev8tgj", "created_utc": 1580233927.0, "score": 123, "upvote_ratio": 0.93, "num_comments": 57, "comments": [{"body": "basic hoes buy AMD. milfs buy INTC.", "score": 48, "replies": [{"body": "This guy fucks", "score": 10, "replies": []}]}, {"body": "I am a thot advocate. Can confirm Starbucks and ulta always full. I have spoken.", "score": 47, "replies": [{"body": "Problem is\n\nULTA = WMT\n\nSephora = TGT", "score": 8, "replies": []}]}, {"body": "I’m in software sales and still not sure how I got into this job. The department is overwhelmingly basic white hoes who line up at the Starbucks outside fo work every morning.its not even just the white ones, every single girl lining up to buy their lattes.\n\n\nLONG SBUX for eternity.\n\nI’m also LONG AAPL because our company has a partnership with them to give us all the newest iPhones and AirPods for free.", "score": 23, "replies": [{"body": "I grabbed a Becky’s double extra soy stevia latte once by mistake and drank it before realizing what I did.  Almost shit my pants like 15 mins later.\n\nThat’s when it dawned on me.  Beckys are drinking this trash to stay regular.  They line up at SBUX and then it’s off to the restroom where they drop their Lulu yoga pants and expel their silky smooth shits into the porcelain bowls of marketing and SaaS startups all over the country.", "score": 33, "replies": [{"body": "Really painted a picture there bud", "score": 12, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Not as nasty as the slime and grime in Becky’s yoga pants", "score": 8, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "And smell it\n\nHnnnnnnngggggg Becky's Shrew Sludge", "score": 5, "replies": [{"body": "Can we bring back \" Y'all mfers need Jesus!\"?\n\nBecause holy hell", "score": 5, "replies": [{"body": "You haven't fucked a lot of Beckys.  Most Beckys are hygienic, but some Beckys don't shower or change their panties for a week.", "score": 3, "replies": [{"body": "My favorite Beckys", "score": 1, "replies": [{"body": "Weird to think that Beckys just walk around the office all day with slimy slits lmao", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "how's the money in software sales?", "score": 6, "replies": [{"body": "The money is pretty nice.\nI’m 28 years old, make 100k base without commission.\nWith commission, I can make up to 175k at my current role.\n\nOnly downside is that the commission is paid out in a quarterly basis and 100k base doesn’t go very far in Seattle. Any delusion that I’m living well can be removed ASAP. I live a very mundane life when not traveling to clients and save every penny I can to put into long term hold stonks. \n\nI’m currently renting a basement of a three bedroom house that looks like a crack house for $800/mo\n\nDon’t have the balls to play FDs like you fuckers but holding stocks forever is not a bad way to go.", "score": 14, "replies": [{"body": "Bruh, I was making about $190k in Seattle, saving more than half, and lived pretty large.\n\nBallard rent for a nice place was $2k, another $500 for lyft, eating out a couple times a week, and some very decent trips to Hawaii, Portland, SF, Vancouver, and more, and still had plenty of dosh left over at the end of the month to save and invest.\n\nWhat sort of degenerate lifestyle are you living that $100k doesn’t cover?", "score": 10, "replies": [{"body": "He spends most of his paycheck on FDs", "score": 7, "replies": []}, {"body": "So here’s the breakdown.\n\n20% into 401k, 10% into company stocks.\n800/mo on rent, 500/mo on car payments\n\nMy monthly take home pay is 2800/mo - 1300 = 1500/mo - 500/mo on food/Uber = 1000/mo\n\nIt ain’t much.\n\nYou’re making 190k/year and 2k/mo rent is peanuts. 2k a month is pretty much 70% of my monthly take home.", "score": 2, "replies": [{"body": "Sure, but I saved ~ $100k/yr for nearly 3 years, and that’s after tax, so I had the same or less than you to pay for stuff.\n\nAlso, wtf are you doing paying for a car and Uber? Your car is probably >$800/mo once you include insurance and all the rest.\n\nAnd saying “not much leftover” after you’re already saving 30% is intellectually dishonest.", "score": 6, "replies": [{"body": "Car is on the east coast because I didn’t know whether I’d need it here. Parents car insurance plan is legit and I plan on staying on that and paying my share.\n\nI’ll be taking it with me when I move outta here.\n\nI have enough for the bare essentials: food, steroids, roof over head.\n\nThat’s it.", "score": 3, "replies": [{"body": "Poort african child here", "score": 3, "replies": []}]}]}]}]}, {"body": "Wow that's crazy I only make like $75k at this point down in Portland and I live pretty comfortably with $800/month rent. \n\nBeen getting a lot of interest from recruiters in the software sales space. Been thinking about getting into it but I really like the place im at now even though the pay is average. \n\nYeah options are wild. This corona virus just burnt most of my profits from the last month or so. oh well lol", "score": 8, "replies": [{"body": "I stayed at home until 26 and fucking loved it.\nMinimal expenses, help mom and dad with the mortgage at like $500/month, and everything else goes into stonks + company stock program. Also having no student loans due to scholarships helped. I would be shocked if I had anything less than 150k liquid assets.\n\nBut I need to learn more skills because this current income just isn’t enough and I’d like to be making somewhere around 130k base.", "score": 4, "replies": [{"body": "You could always sell some covered calls on stocks you own, or just YOLO it into some meme stock. Gotta get those Boats N Thots somehow lol", "score": 3, "replies": []}]}]}, {"body": "This is too wholesome for this sub. I thought I was in personalfinance for a second", "score": 3, "replies": []}, {"body": "Dude move South of Seattle", "score": 3, "replies": []}, {"body": "I got a shit house in Northgate I'm renting for 2900 since I just moved here.  220k doesn't fucking go far.  Most of the people in my neighborhood are filthy rich or bougth up the houses in 2008.", "score": 3, "replies": [{"body": "Dude I’m in Northgate and frequent the lake city LA fitness almost daily. \n\nmy lease ends in April Anyway I could get in on a short term month to month?", "score": 2, "replies": [{"body": "I'm not the landlord at the Northgate location. The houses I have I'm selling and only keeping one in Virginia.  \n\nBut I so have an extra room... A guest room fully furnished.", "score": 3, "replies": [{"body": "Do you mind if I cook? DMing you rn", "score": 1, "replies": []}]}]}]}]}]}, {"body": "priced in.", "score": 2, "replies": []}]}, {"body": "My sister spends 3 hours per day at SBUX even though she hates coffee. Her habits closely track the BECKY index. ADDYY is her latest brand of choice. I would also look at what is being advertised on TikTok because she’s very susceptible to celebrity promotions.", "score": 9, "replies": [{"body": "What’s her @", "score": 9, "replies": [{"body": "u/nunya", "score": 7, "replies": [{"body": "Goddamit whyd I fall for that, fucking scotch", "score": 3, "replies": []}]}]}, {"body": "ADDYY doesn't have an options. Da fuck am I supposed to do with that?", "score": 1, "replies": []}]}, {"body": "Starbucks all the time.", "score": 6, "replies": [{"body": "until evenings   where its TRULYS  ($SAM)", "score": 3, "replies": []}]}, {"body": "Hi, basic bitch here. I saw the dentist today cause I chipped a tooth. Most likely caused by Vyvanse ($TAK) induced teeth grinding. Doc recommended a small filling and I asked if it could wait because I really wanted Starbucks this morning.", "score": 10, "replies": []}, {"body": "My dad just bought an extra Apple watch because he thought he needed a separate watch for daylight savings time.\n\n My mom just bought a 2nd iPhone Xs Max because she thought she needed a 2nd phone to take pics of the screen instead of just taking a screenshot.  \n\n\nI'm disappointed in how retarded my family is.  \nMost autists only get 1 extra chromosome.  \nI got the bundle package.", "score": 8, "replies": [{"body": "Wtf 🥴", "score": 2, "replies": []}]}, {"body": "I am a deeply closeted FD buyer who goes to SBUX daily and wears LULU\n\nAlso bought INTC mini PC\n\nRinse then spit", "score": 9, "replies": [{"body": "Bruh we don’t care, we literally all gay here\n\nDisappointed you rejected Su Bae tho", "score": 9, "replies": [{"body": "Spent my student refund on SPCE calls. Will upgrade as soon as my $30 January 2021 calls hit", "score": 2, "replies": []}]}]}, {"body": "Starbucks be popping.", "score": 3, "replies": []}, {"body": "Yes,   drinking a shit ton of TRULY seltzers  \n\n\nSAM  CALLS  $420.00", "score": 3, "replies": []}, {"body": "Yes, but she was retarded enough to marry me - so a little different from the other white hoes?", "score": 4, "replies": []}, {"body": "Becky representing here. SBUX is trash. We love NKE, JWN, TGT, GPS, LVMUY, PPRUY, AAPL. Also NAIL because we want a better crib.", "score": 2, "replies": []}, {"body": "While you're reporting try not to accidentally fuck your sister or aunt especially if you're in Alabama", "score": 2, "replies": []}, {"body": "Can't you just see what your mom does everyday she comes home from work?", "score": 2, "replies": [{"body": "I have 2 dads they’re gey just like me", "score": 11, "replies": [{"body": "Well find the corner your mother is on, and report her behavior, surely she will be on the corner if you have 2 dads then.", "score": 6, "replies": []}]}]}, {"body": "Their rewards program has been boomin like the old AB", "score": 2, "replies": []}, {"body": "AMD baby", "score": 2, "replies": []}, {"body": "i have some noods of my step sis from 15 years ago if you want those.", "score": 1, "replies": []}, {"body": "No white ppl in my family", "score": 1, "replies": [{"body": "Its the red sedan, make it quick", "score": 2, "replies": []}]}]}
