{"title": "The concept of bag holding doesn’t make sense to me", "selftext": "I completely don’t get the idea of bag holding the stock that dropped a lot and hoping it recovers one day.\n\nWhy don’t people just move on?\n\nI mean, yes, if you really believe the drop is an overreaction that can be fixed quickly by the market, then of course you should hold it. But otherwise why not just dump and seek another big opportunity?\n\nTaking me for example, my profile was down 10% by the bad earning reports of ANET and VRT. I accepted the fact and immediately switched to other stocks that can give me better return in the foreseeable future like NVDA, instead of waiting there for recovery. The time cost and opportunity cost is very important to me. I cannot imagine how much gain I would have lost if I decided to stick to these stocks.\n\nWhen I determine whether I should be bagheld for a while, I just ask myself a question, “Imagine you are not holding it, would you buy it now?” If the answer is no (generally it is no), then I know there is no reason to stay here and should move on.\n\nSo I really don’t understand why bag holds, except the impact of the short-term trading tax — which is not a matter to me as a swing trader.\n\nEdit: sorry ANET and VRT are bad examples (and I believe they are good companies!) and I am not against long-term investment. But from the trading perspective, I was asking more about why people would stuck in the hole probably forever, instead move on fast.", "id": "1ba0g5y", "created_utc": 1709934781.0, "score": 0, "upvote_ratio": 0.32, "num_comments": 78, "comments": [{"body": "A 10% drop isn't bagholding imo. I've got a few stocks that are down 90-95%. Sure, I should sell them. But they lost so much value that they make up less than 0.01% of my portfolio. It's kind of nice keeping them as a reminder of past mistakes.", "score": 62, "replies": [{"body": "Which ones?", "score": 1, "replies": [{"body": "bmr", "score": 1, "replies": [{"body": "You got me. I actually looked that one up.", "score": 1, "replies": [{"body": "i bought at the top, back when i was much worse at trading. GUH", "score": 1, "replies": [{"body": "That was ... almost impossible to do. Congratulations? I mean, that sucks, but it is still impressive.", "score": 3, "replies": []}]}]}]}, {"body": "Target did that for me since I bought it last summer. Budweiser as well. Sometimes, I just catch the falling knife before bottom because as we all know, timing is hard.", "score": 1, "replies": []}]}, {"body": "This is psychotic lol", "score": -9, "replies": [{"body": "Welcome to human behaviour.", "score": 13, "replies": []}, {"body": "Don't think you know what that word means lol", "score": 5, "replies": []}, {"body": "Depends on which ones. There are a TON of stocks that got killed in the last couple of years, particularly mid cap growth, where the underlying company is doing quite well. The market just revalued the multiples on a whole crapload of stocks during that time. That makes them cheap now, so holding those is probably smart.", "score": 2, "replies": [{"body": "Exhibit A: draftkings", "score": 2, "replies": [{"body": "I got a dozen bags, same story", "score": 1, "replies": [{"body": "Where you traveling to? lol", "score": 1, "replies": [{"body": "For as much as they cost I could have traveled all over the world. It's really depressing when I put it like that.", "score": 1, "replies": [{"body": "Damn rip dude", "score": 1, "replies": []}]}]}]}, {"body": "A gambling mobile app that isn't profitable is \"doing quite well\"?", "score": 1, "replies": []}]}]}]}]}, {"body": "No one stays with a stock thinking they are going bag hold at the end.  Whether an investor stays with a stock through period of losses probably depends on their investment strategy.  If someone is investing in a company based on their opinion of the company's long term prospects, a period of rough patches probably don't bother them much as long as the positive underlying fundamentals that brought them in remains true.  If an investor is a swing trader like yourself, then yeah, probably a very low tolerance for extended downturn.", "score": 38, "replies": []}, {"body": "Sunk cost fallacy, mostly.\n\nThat said, I have keep a few shares of my big mistakes as reminders of the costly lessons they taught me.", "score": 54, "replies": [{"body": "OP has a trading mindset. Some have an investing mindset. \n\nIf you think that a company is a well run business, why bother selling if they have one bad quarter? Or if sentiment turns against them?\n\nSome sell because  their investment thesis changes. Not because Mr. Market forgot his antidepressants and tells them to sell.", "score": 20, "replies": []}, {"body": "Yep. Right before the 2008 crash I read Peter Lynch's book \"One Up On Wall Street\". It convinced me to load up on Fannie Mae stock because it was basically a money printing machine backed by the federal government. It was a can't-lose investment. I did a bunch of further research and it made total sense.\n\nSo when the housing crisis started happening and their shares started dropping in price, I loaded up. I think my highest price shares were around $60 and my cost basis was about $30 by the time it dropped to 25 cents a share. I kept it in my brokerage account to remind me that I'm an idiot.\n\nThen one day I got drunk and bought enough shares at 10 cents or so to bring my cost basis down to $3. It eventually recovered to that and I sold and broke even. \n\nI am a horrible example to follow because even the stock I consider my biggest failure ended up breaking even. And I've invested in plenty of stocks that went to $0, but they were straight up gambles. The reason FNM is my biggest failure is because I was convinced it was a sure thing.", "score": 12, "replies": [{"body": "Pick some up on the pink sheets they're bringing it back now.. Give it 5 year it'll be back on the market to leech more money for tax payers..could make some money on the come up👍🏾", "score": 1, "replies": []}]}, {"body": "It'S nOt A lOsS iF yOu DoN't SeLl", "score": 18, "replies": [{"body": "I never sold my bbby, yet somehow it is still a loss", "score": 2, "replies": []}]}, {"body": "This and not viewing the portfolio in totality.  What’s a 10% loss on one stock if the portfolio is performing well overall.  Take the loss and funnel the money to winners.  Conversely capturing gains is never bad either.  Better to have missed some growth than to watch the market take your gains away.", "score": 3, "replies": []}, {"body": "This is exactly it.\nI hold on to my mistakes so I remember them next time I am about to gamble on a random stock I found on Reddit.\n\nAYRO I'm talking about you. 99% down on that stock.", "score": 1, "replies": []}]}, {"body": "Most people don’t understand the concept of opportunity cost. Also, most people get emotionally attached to their stocks. It’s like the ego can’t accept you made a mistake…", "score": 14, "replies": [{"body": "Mistakes are god's way of letting you get out without paying capital gains", "score": 10, "replies": []}]}, {"body": "Sure fire way to sell low and buy higher", "score": 10, "replies": []}, {"body": "If you had sold nvda because it fell 70%, you wouldn't have had peace now.", "score": 10, "replies": [{"body": "I recently bought Mongo DB at 493. Great company, revenue increasing like gangbusters. I followed my rule and sold when it dropped, for an 8% loss. Now it's down more than 20% from my original buy point, at 383. I still think it's a great company, and I like it much better at this price, so I bought it again. If it continues to sink, I'll sell it again at an 8% loss and move on. This is how  you avoid 80-99% losses.", "score": 3, "replies": []}]}, {"body": "This might’ve worked this time but if you’re selling your stock because of any bad news you ain’t ever gonna make money long term lol", "score": 16, "replies": [{"body": "Well I am not saying I just take the profit in short time. And I am sure ANET and VRT will grow a lot in the end. But if there is a very convincing target with greater profit in a shorter time, e.g. NVDA, why don’t I optimize the profile based on this fact? If not thing to chase in a short term, I would stick to the targets in a  longer term, though.", "score": -1, "replies": [{"body": "Again ain’t gonna make money short term trading over a long period of time unless you’re a phd mathematician and those get okay returns lol", "score": 3, "replies": []}]}]}, {"body": "Sunk cost fallacy", "score": 6, "replies": []}, {"body": "Investment of this kind goes with fundamental analysis. If the company still getting all the right financials quarter after quarter and doing the right things to circumvent headwinds the stock price will move up. The decision to hold depends on how you read the fundamentals and decide on when to cut your losses. Irrational bag holders will get hurt eventually. Always need to remember that stock prices are slaves to the fundamentals.", "score": 3, "replies": []}, {"body": "PLTR has entered the chat.", "score": 3, "replies": []}, {"body": "well if it’s in you’re retirement account and you’re young? There’s only really potential gain to be lost if you sold it and moved that money elsewhere which then just reintroduces risk that the new pick could crash.\n\nBut if you buy a stock at 20$ when you’re 20 but then it crashes to a 1$ and stays there until you’re 35 but then starts gaining 5$ value every year until you can start legally withdrawing from your Roth IRA that stock would now be worth 151$ instead of the 20$ you spent on it, and if you didn’t hold that bag when it stayed 1$ for 15 years, you wouldn’t ever have gotten the profits from it.\n\nSo essentially bag holding should be utilized for like retirements accounts.. just set it and forget it and DCA down when it dips, but unless it’s like actively hemorrhaging money it’s not worth it to sell.\n\nAnd my indicator for the company is actively hemorrhaging money is reverse stock splits.\n\nAny company that does one while I hold their shares? I sell it", "score": 3, "replies": []}, {"body": "I remember when I was a bag holder. Then I bought more bags. I thought the bags would get lighter if I bought more. Then, I bought more bags, one last time because they were so much cheaper. I thought that would help my cost basis …but in the end …the bags got too heavy. So I sold them and learned…don’t buy more bags.", "score": 7, "replies": []}, {"body": "You're talking about bag holding and then give two examples that don't look anything like bags.   Unless I'm mistaken about the tickers you referenced.\n\nANET is up 83% past 12 mo. and 18% YTD;  it's down 5% in the past 5 days *from an all-time high*.\n\nVRT is up 351% past 12 mo. and 52% YTD; it's also down about 5% in the past 5 days from an all-time high it reached for a few hours.\n\nBoth of them have positive year over year revenue and profits, both are cash flow positive and both have more assests than liabilities.\n\nThose aren't \"bags\".     A paper loss of 5% or 10% or 20% or even 50% isn't bag holding per se.   Except for the extreme and obvious examples of companies that have no foreseeable path to return to former success, whether a company is a bag or not depends on a mix of things like risk tolerance, time horizon, company leadership and history, and so on.\n\nFurther, jumping from stock to stock to avoid paper losses as small as 5% or 10%  is basically gambling.  If you can pick stocks that way then time is the only thing standing in your way from billions of dollars.\n\nI do agree that one thing a person should consider is whether they would buy more of a stock if they had the funds to do so, and why are they still holding if they wouldn't buy more.  But, that's more of a starting point to making a decision and not the final answer.  There are reasons to hold off selling a stock even if you wouldn't buy more.   For example, tax management, diversification, or shares bought at a high dividend yield.\n\nAnyway, now I'm curious , how did those two stocks reduce your portfolio by 10%?   I'm curious to see your trade details on those two stocks.", "score": 2, "replies": []}, {"body": "I don't agree with the question you ask yourself: “Imagine you are not holding it, would you buy it now?”...\n\nBecause you can ask that same question about a stock you hold that is up, and the answer would also often be no. For example, if you bought NVDA at 100 and asked yourself when it was at 400 if you would still buy. If your answer was no, then you should immediately sell, right? And if the answer was yes, you should prove it by buying more. But in reality, you'd probably just hold.", "score": 2, "replies": [{"body": "This question, as you stated, should be asked anywhere. And yes — if my answer is “wouldn’t buy” when NVDA hits 400, I will out. I think the slight difference is that to change the status quo, we need a stronger motivation. So if the answer is “I don’t know whether I would buy”, I will probably hold there and trim some positions, unless I have a better target to chase.", "score": 2, "replies": []}]}, {"body": "I’m having same feeling with TSLA. I’m down considerably since I fomo’ed at the top and brought a bunch instead of DCA’aing. In fact, even after DCAing for most of 2023, I’m still down and it is continuing the spiral downwards. I’m not too worried since for me TSLA is a long term play but seeing those reds month after month isn’t helping, especially when it is the largest holding in my portfolio.", "score": 2, "replies": []}, {"body": "2 years ago I was a bag-holder of NVDA.  It worked out so far.", "score": 2, "replies": []}, {"body": "Because you are wiser than most.\n\nPsychologically it is difficult to admit we were wrong. It is easier to \"hope\" that we will be proven right someday.\n\nThe more prudent financial strategy is to take that capital and allocate it to stocks that are going up, but that requires we keep our ego out of our decision making.", "score": 2, "replies": []}, {"body": "Didn’t know VRT could be bad.", "score": 1, "replies": []}, {"body": "Well the taxes are much lower if you hold for a year, then consider most day traders underperformed against the s and p 500. \n\nIndividual stocks in general have huge risk.", "score": 1, "replies": []}, {"body": "If you aren't gambling as loosely as some in this site and buy a stock because you understand the business", "score": 1, "replies": []}, {"body": "It's still possible to average down though, especially if it's a security that can come back in time.\n\nLoss???\n\nVRT is up 50% YTD and ANET is up 20+% YTD\n\n10% drops are making you sell? Let me guess.....uhh...Hennessy on the rocks??? I knew it! 🤪", "score": 1, "replies": [{"body": "VRT and ANET are great. But if some stocks grow quicker than them, why shouldn’t I change? I don’t mind hold these two in a long term, though.", "score": 1, "replies": [{"body": "Because then you end up catct falling knives, stick to what you favor and commit, just keep the core something like VOO and you're always good as long as you DCA", "score": 1, "replies": []}, {"body": "If you are not satisfied with ANET you'll just end up switching constantly and trying to catch all trends at once. You'll be always late to the party.", "score": 1, "replies": []}]}]}, {"body": "Depends on what your thesis is. You call it bagholding, I call it conviction. \n\nI started buying PLTR at $28 and kept buying as it dropped to $6. My cost basis is $10.44 now. I went from being down 50% to up 150% because I had a thesis and had conviction in it", "score": 1, "replies": []}, {"body": "It's true. My current bag hold experience as a 2/8 success and 2 ongoing. Although the 2 success outweighs the losses of the 8, I wouldn't recommend this strategy. Oh BTW, all of my bagholding has its value down by more than 50% from ATH.", "score": 1, "replies": []}, {"body": "In general there's zero guarantee that you won't stack losses by picking another shitter after you sell for a loss on the first.\n\nI've bag held when I shouldn't have, and also done it when it eventually worked very much in my favor (*and for the duration the stocks were below my average, I made some nice coin on CC's anyhow*).\n\nIt comes down to whether you actually believe in the company based on data, or are simply in denial about the reality of things because of how invested you already are.  I don't think there's a ton of overlap in these 2 mindsets really.", "score": 1, "replies": []}, {"body": "This is just hypotheticals playing out in your head.  For example, I could say “only buy stocks that will go up” but it’s obviously more complicated than that.  You could easily swap your bags for more bags and find yourself with bigger loses.", "score": 1, "replies": []}, {"body": "Accepting volatility is a must for any sort of long term success in investing. As someone else said, selling stock in a business you believe in just because of a little volatility is a trading mindset, not an investing one", "score": 1, "replies": []}, {"body": "Bag holding a fundamentally strong stock is not all bad", "score": 1, "replies": []}, {"body": "Bought PLTR a couple of years ago at $23...guess I should have sold it when it went to $7 then? \n\nDumb post.", "score": 1, "replies": []}, {"body": "If you keep money in a stock that’s performing poorly, there’s greater probability it goes up, if you take your loss and switch whatever is left to another company that you (maybe) haven’t researched as analytically and start over in X cycle of their growth or decline, you open yourself up to a higher probability of losing more money. I bought doge, doge plummeted, everyone laughed that I bought doge, so I bought more doge. I’ve now recouped all the money I had put into doge and still have extra waiting to see what happens. If I end up making a bonus off of it cool, if I don’t well at this point that doge is already paid for. I moved maybe too much in Warner Brothers because they are 1) 100 years old 2) have been a very big name for a very long time 3) have freed up cash by not reinvesting into projects in order to pay off debts incurred during a merger. That leads me to believe not only are they huge and likely able to get back to being a giant name, but that they are responsible with their debts as well. They’ve been around for 100 years so they have plenty of data and likely senior officials who have seen a lot and know a lot. I HOPE they come back roaring, but I believe, I’ll at least make some money back.", "score": 1, "replies": []}, {"body": "If you knew what you were holding you wouldn't have sold ANET. Just saying.", "score": 1, "replies": []}, {"body": "Selling at a loss means you were wrong and some people can not let go of a loss! As a trader, you should always know where to exit!", "score": 1, "replies": []}, {"body": "People get emotionally invested in stocks and experience the sunk cost fallacy. Just take a look at all the people still holding meme stocks.", "score": 1, "replies": [{"body": "Blows my mind r/superstonk is still a thing", "score": 4, "replies": [{"body": "But dude, the GIGA MOASS! its totally going to happen bro! A multi hundred billion industry of short sellers and hedge funds are totally going to let us win again!!", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "How do you bag hold stuff that’s at ATH", "score": 7, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "It’s a great point. Cost basis really doesn’t matter as much as your belief as to where the stock is going moving forward", "score": 1, "replies": []}, {"body": "Bag holders are bag holders for a reason. If they understood the math behind markets they wouldn't be bag holders. The best quote I heard from a long term investor sums it up perfectly:  \n\n\"I love this stock so much that I sold it on a downturn, bought options on an upward stock so I could make more money, then traded back in while it was still cheap.\"", "score": 1, "replies": []}, {"body": "\"We think just the opposite. When it goes down we love it, because we'll buy more. And if it goes up, it kills us to buy more.\"", "score": 1, "replies": [{"body": "Heavy bags detected", "score": 1, "replies": [{"body": "You do realize who said that quote right..... Lmfao", "score": 0, "replies": [{"body": "Doesn't work well for meme stocks though, does it?", "score": 1, "replies": [{"body": "Lol what?", "score": 0, "replies": []}]}]}]}]}, {"body": "same here.\n\nbag holders are the simps of the stock world.\n\nif ur price drops 20% what i paid for u i am dropping u i dont care who u are", "score": 0, "replies": []}]}
