{"title": "Tesla (TSLA) DCF Analysis", "selftext": "***NOTE: NOT FINANCIAL ADVICE***\n\n# Introduction:\n\nTSLA is the world's most renowned Electric Vehicle(EV) automaker, catalyzing the world's acceleration towards Internal Combustion Engine (ICE) Vehicles. TSLA has become the gold standard for what a high-quality EV stands for, all thanks in part to their founder's vision and belief in renewable energy especially during the tumultuous early years of TSLA. TSLA no longer just stands for EV but renewable energy, having branched out into Energy Storage, and Solar Panels.  TSLA hopes to create an ecosystem for renewable energy from charging to energy storage to the vehicle used, all this tied together by dedicated software created by TSLA at every point of contact in the ecosystem. This ecosystem business model has seen massive success as evident from businesses like GOOG, AAPL, and MSFT. I believe the next frontier of growth for TSLA comes from energy storage rather than automotive, however automotive will still account for the largest chunk of revenue for TSLA.\n\n# Market:\n\nTSLA's closest EV competitor is BYD. TSLA has won BYD on almost every front. A country where BYD has managed to wrest control from TSLA is Thailand. So I'll analyze this market specifically to rationalize why I believe this victory will be shortlived.\n\nIn Thailand, the top 3 most popular car models are BYD Atto 3, Netta V, and BYD Dolphin ([SOURCE](https://carnewschina.com/2024/01/09/byd-is-bestselling-ev-brand-in-thailand-in-2023-neta-is-runner-up/)).   \n\n|Model|Price|Range|\n|:-|:-|:-|\n|BYD Atto 3|1.1M Baht|521 km/charge|\n|Neta V|0.55M Baht|380 km/charge|\n|BYD Dolphin|0.75M Baht|427 km/charge|\n|Tesla Model 3|1.59M Baht|513 km/charge|\n\nIn Thailand, 60.17% of the population owns a car ([SOURCE](https://www.statista.com/statistics/1027960/thailand-car-ownership-among-consumers/)) with the average car price being about 0.78M Baht. This means that a Tesla Model 3, TSLA's cheapest model is double the average price of a normal car in Thailand. \n\n[SOURCE](https://www.statista.com/statistics/1030220/thailand-average-monthly-income-per-household-by-region/)) which means that the Tesla Model 3 is a luxury good rather than an affordable commodity for the average household. The difference in price between BYD and Tesla is a full year's worth of income for the average household which leads the price-conscious consumers in Thailand to naturally gravitate towards BYD, hence the popularity of BYD over Tesla in Thailand. \r  \n\r  \nUltimately, I do believe that if TSLA continues competing on quality and finds ways to cut costs such as directly setting up factories in Thailand ([SOURCE](https://edition.cnn.com/2024/03/05/business/thailand-tesla-factory-talks-intl-hnk/index.html)), it will be able to close the price gap with BYD. As \"people are really stretching their wallets to be able to afford a Tesla. It’s quite a difficult thing for them to do, and remarkable that it’s the best-selling car in unit volume, despite being much more expensive than other high-volume cars.” - 2023 Q4 Earnings Conference\r\n\n# Revenue:\n\nTSLA has 5 revenue channels, namely “Automotive Sales”, “Services and Others”, “Automotive Lease”, “Automotive Regulatory Credit” and “Energy Generation and Storage sales”. \n\n***Automotive Sales***\n\nAutomotive sales refers to the direct sale of TSLA’s vehicles fully paid upfront.\n\nElon Musk believes that manufacturing capabilities will be the most important C.A. for TSLA. “perhaps the most important competitive characteristic of Tesla in the future will be manufacturing technology” -  2023 Q4 Earnings Conference. \r\n\nWhen forecasting the Number of Vehicles each Gigafactory can produce, I took into account that Elon Musk recently unveiled in the 2023 Q4 Earnings conference that there is a new revolutionary manufacturing technology that is expected to drastically improve production. He hopes to pilot test this technology at the Texas Gigafactory to produce their low-cost EV before proceeding to replicate the technology in every Gigafactory. “the sensible way to go about things is kind of figure out the core technology of the manufacturing line and then replicate it with improvements throughout the world.” -  2023 Q4 Earnings Conference.\r So, in my first 3 years, I assume that the growth rate is below historical averages as TSLA tests out new technology in preparation for the launch of the low-cost EV. I assumed that TSLA’s manufacturing technology was successful.\r  \n\r\r\r  \nWhen forecasting %Vehicles delivered, opting for less granularity I forecasted it as a % of historical averages\r  \n\r  \nWhen forecasting Avg Price/Vehicles Delivered, Elon Musk doesn’t believe in price increases to increase the topline. As evident in 2021 and 2022 where Elon Musk only increased prices due to supply chain constraints before bringing prices back down in 2023. In China, Elon Musk ended up cutting prices due to being able to source significantly cheaper batteries there. I assumed that over time as TSLA enjoys sufficient economies of scale, they will only increase prices in line with perpetual inflation.\r  \n\n\n***Services and Others***\n\nTSLA provides a few services such as home servicing in certain regions or customers pay to access TSLA’s network of SuperChargers.\r  \n\r  \nLifetime number of TSLA automobile (Ex roadster) delivered ([SOURCE](https://backlinko.com/tesla-stats))\n\nAssuming that TSLA is properly maintained they can last \\~20 years ([SOURCE](https://caredge.com/blog/how-long-tesla-batteries-last)). Opting for less granularity, in my forecast I assumed the total lifetime number of tesla cars remained constant without any churn.\r\n\nWhen forecasting Services and Others, Opting for less granularity I assumed that the servicing’s pricing grew following the price of the vehicle in line with historic averages. \n\n\r  \n***Automotive Lease***\n\nTSLA has 2 types of lease, “Direct Vehicle Operations Lease” which leases out vehicles to customers for up to 48 months afterwards the vehicle is returned to TSLA. “Direct Sales Lease” either granting the customer title of the vehicle once full payment has been made or the customer has the option of refusing the vehicle.\r  \n\r  \nWhen forecasting Automotive leasing, as prices for TSLA fell in 2023, Automotive leasing as a percentage of Automotive Sales dropped as it is now cheaper for customers to purchase their tesla in 1 lump sum payment. I assumed that following this trend, as TSLA’s affordability increases over time the %Automotive Sales decreases as well before remaining constant in perpetuity.\n\n\r  \n***Automotive Regulatory Credit***\n\nTSLA has excess carbon credit which it sells to competitors.\n\n“It will continue for some period of time, but eventually this stream of regulatory credits will reduce.” ([SOURCE](https://www.businessinsider.com/tesla-9-billion-revenue-selling-regulatory-credits-to-other-carmakers-2024-2)).\r  \n\r\n\nWhen forecasting Automotive Regulatory Credit, given that TSLA does not intend to depend on these credits for revenue, I assume that as a %of Automotive sales, credit will contribute to a significantly lesser amount in perpetuity. This is further exacerbated by other automobile companies accelerating their push towards EVs as countries begin phasing out ICE vehicles. So, more companies begin having excess regulatory credits as well. Ultimately, I believe that leading up to 2030 the amount of revenue contributed by Regulatory credits decreases to a significant level. \n\n\r  \n***Energy Generation and Storage Sales***\n\nTSLA produces Energy Storage systems e.g. Megapack and Solar Energy related products e.g. Solar Panels which it directly sells to customers.\r  \n\r  \nFor energy storage more specifically megapacks, as the world phases out ICE vehicles and begins embracing renewable energy, it leads to a surge in demand for electricity. However, the issue with renewable energy is that “The most common renewable energy sources like the sun and wind are intermittent or have lower baseload capabilities than coal, natural gas, or nuclear sources. This makes it necessary to have a way to conserve excess energy produced during peak hours. This extra energy can then be supplied through the grid or otherwise when the sun is down, or wind speed reduces.” ([SOURCE](https://www.batterycycle.io/why-is-tesla-focusing-on-the-battery-energy-storage-market/)). As an example to elaborate on how much importance is placed on energy storage, China mandates that all renewable energy facilities must store at least 20% of their total output ([SOURCE](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwiYquPrkuaEAxXuSGwGHffzBkgQFnoECA0QAw&url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Ferikkobayashisolomon%2F2023%2F12%2F20%2Fenergy-vault-wins-big-with-gravity-storage-in-china%2F%23%3A~%3Atext%3DChina%2520has%2520mandated%2520that%2520all%2Cgeneration%2520capacity%27s%2520worth%2520of%2520storage.&usg=AOvVaw3WMq0w9-2ka0Cz2kAGbCWX&opi=89978449)).\r  \n\r  \nThe closest competitor to TSLA in energy pack is BYD. The TSLA’s megapack is smaller in dimensions compared to BYD and on top of that TSLA has built its own software to be compatible with the megapack hardware with features such as Autobidder (Software to optimize energy trading) and Powerhub.\r  \n\r  \nRight now what's stopping revenue for energy storage is production capacity, TSLA opened its megapack factory in Lathrop to curb this. TSLA has also announced its plans to build a megapack factory in China to assist with production capacity ([SOURCE](https://www.bloomberg.com/news/articles/2023-12-22/tesla-acquires-land-for-shanghai-megapack-battery-factory)). As an overarching goal for my forecast, I took into account the TSLA master plan 3.\r  \n\r  \nWhen forecasting number of dedicated megapack factories opened, I assumed that TSLA would open 1 additional plant every 3 years for the next 10 years, to meet the large surge in demand as countries accelerate their push towards renewable energy.\r  \n\r  \nWhen forecasting Max Output/Factory, taking into account this article on expected output. ([SOURCE](https://www.nextbigfuture.com/2023/11/tesla-megapack-factory-production-limit-solved-and-capacity-will-be-doubled-to-80-gwh.html)). TSLA’s Lathrop Megapack factory can produce 80GWh/Year in part due to them doubling their existing lines and resolving certain issues. Over time I believe that TSLA can massively increase the Max Output/Factory, as TSLA consistently touts their innovations as having an S curve of progression, where progress is slower at the earlier stages before exponentially increasing. \r  \nAs a sanity check, in my base case assuming that all Mega packs are still at 4 MWh. TSLA has to produce 406,200 Mega Packs or 81,240 Mega Pack per factory a year by 2038. As of November 2023, the Lathrop factory can produce 20,000 megapack. So, in 15 years I believe it is a reasonable amount of time necessary for TSLA to ramp up their production 4x.\r  \n\r  \nWhen forecasting %GWh Deployed, I had to assume total output which is a function of max output and the number of gigafatories. I assumed that over the years as more countries begin phasing out ICE vehicles in favor of EVs, there is a larger need to deploy more energy storage so this % increases to a large extent.\r  \n\r  \nWhen forecasting Avg Sales/GWh Deployed, Elon Musk does not like to increase sales through increasing pricing which was why when TSLA enjoyed economies of scale from increasing output in their Lathrop factory the Avg Sales/GWh Deployed decreased. So, applying this principle of TSLA slashing prices when costs decrease due to economies of scale, I assumed that TSLA continued slashing prices before increasing by the perpetual inflation rate.\n\n# Cost:\n\n\r“predicting auto gross margins is extremely challenging since there are many moving parts to this equation, some of which are out of our control like the change in tariffs or local incentives to name a few. While the teams are focused on cost reductions, we are approaching the limits within our current platforms.” - 2023 Q4 Earnings Conference. \n\n  \nWhen forecasting Automotive and Non-Automtoive COGS, COGS as a %revenue for 2021 and 2022 are likely to be lower due to TSLA pre-emptively increasing sales price to deal with inflation. However, in 2023 COGS as a %revenue increased as TSLA cut back on sales price. Going forward, I’ll assume that TSLA tends towards historic pre-covid average. However, in the long run, as TSLA successfully implements their manufacturing technology this % will decrease even further.  \nWhen forecasting R&D, SG&A, and Others, opting for less granularity I forecasted it as a % of historic averages.\n\n# WACC:\n\nUS 10Y T-Bond (1M Avg) = 4.12%\r  \nBeta ([SOURCE](https://finance.yahoo.com/quote/TSLA/)) = 2.41\r  \nStable Market ERP ([SOURCE](https://pages.stern.nyu.edu/~adamodar/New_Home_Page/datafile/ctryprem.html)) = 4.60%\r  \nCOE = 15.21%\r  \n \r  \nTSLA is rated at BAA3 ([SOURCE](https://fred.stlouisfed.org/series/DBAA))\r  \nCOD (1M Avg) = 5.72%\r  \nMarginal Tax Rate = 21.00%\r  \nAT-COD = 4.52%\r  \n\r  \nMarket Price (5D Avg) = $178.50\r  \nShares O/S = 3184.79M\r  \nMarket Value of Equity = 568485.02M\r  \n\r  \nWeighted Average Maturity = 2 Years\r  \nFY23 Interest Expense = 156M\r  \nMarket Value of Debt = 4578.78M\r  \n%Debt = 0.80%\r  \n%Equity = 99.20%\r  \nWACC = 15.12%\r  \n\r  \nCurrently, TSLA has a very large beta as its stock has increased in volatility in the past few years. However, I believe that this volatility will not persist for very long as most big tech stocks enter a stable stage where their beta tends downwards. So, as a proxy for how low TSLA’s beta will tend to, I looked at other big tech stocks.\n\n\r\n\n|Name|Beta|\n|:-|:-|\n|Google (GOOG)|1.04|\n|Microsoft (MSFT)|0.89|\n|Meta (META)|1.21|\n\nTaking the average beta, we arrive at a beta of 1.05. Assuming similar D/E composition and bond rating. I assumed that it took another 10 years for TSLA to reach the stable state.\r  \n\r  \nStable State COE = 8.95%\r  \nStable State AT-COD = 4.52%\r  \n\rTSLA’s stable stage WACC = 8.90%\r  \n\n\n# Conclusion:\n\nUltimately in my base case, I value TSLA at $186.88 per share. I believe that there is still room for TSLA to grow, having such a strong first movers advantage in the renewable energy market means that TSLA is heads and shoulders above its competitors. I believe that the market is undervaluing the Energy Storage arm of TSLA's business, and less emphasis is placed on this potentially disruptive segment of business. \n\nBase Case: \\[[INSERT](https://imgur.com/a/nZjoZRs)\\]  \nWorst Case: \\[[INSERT](https://imgur.com/a/aMYlmm3)\\]  \nBest Case: \\[[INSERT](https://imgur.com/a/2VOKzoU)\\]  \nSanity Check: \\[[INSERT](https://imgur.com/a/rVQr2uF)\\]  \nRevenue Model (AUTOMOTIVE): \\[[INSERT](https://imgur.com/a/ucXnT5K)\\]  \nRevenue Model (ENERGY STORAGE): \\[[INSERT](https://imgur.com/a/xiRJYhN)\\]  \nCost Model: \\[[INSERT](https://imgur.com/a/KVByje0)\\]  \nChange in NWC: \\[[INSERT](https://imgur.com/a/3rDs1Be)\\]", "id": "1bekj4k", "created_utc": 1710421012.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 72, "comments": [{"body": "I am not sure how anything you wrote supports your \"$186\" price.", "score": 21, "replies": [{"body": "In the TSLAverse, random numbers based on wild assumptions is a way of life. \n\nIt all starts with ‘it’s not just a car company!’\n\nThis thing is headed straight for double digits where it will reside permanently. The con is up, the emperor has non clothes…", "score": 15, "replies": [{"body": "Agreed. I've been scaling in to TSLQ the last few weeks and will be all in by late March or April depending on how the chart works. \n\n\nI'm currently 25% TSLQ, and 75% cash.", "score": -3, "replies": [{"body": "It is my absolute focus for 2024, shorting TSLA and strategic puts around earnings. Fully expect it to earn me more than even being in NVDA. ", "score": 0, "replies": [{"body": "Same. Investing in the TSLA inverse has been my most reliable investment for a while now.", "score": 1, "replies": [{"body": "If you did the inverse Tesla you would've gone bankrupt since it was $20 not too long ago.\n\nThen again you're a time traveler...", "score": 3, "replies": [{"body": "No, just since the earnings flattened. And it's worked amazingly well.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Tesla does not have a first mover advantage in renewable energy lol. Competitors are already getting billions in contracts. The biggest BESS project in the world was just announced and they’re using BYD, Samsung and LG batteries.\n\nhttps://www.energy-storage.news/edwards-sanborn-california-solar-storage-project-world-largest-bess-battery-system-fully-online/\n\nThe reality is the players who actually make and control the battery cell supply have the first mover advantage and a massive advantage over Tesla. This is BYD, CATL, LG, Panasonic, Samsung, SK.", "score": 6, "replies": []}, {"body": "How do you come to the conclusion that Tesla won BYD in every front ? They sell more BEV than Tesla at a similar gross margin", "score": 8, "replies": [{"body": "A better gross margin actually.", "score": 2, "replies": []}]}, {"body": "Revenue is stagnating at best decelerating at worst\n\nProfits too\n\nNot sound positive stock price news", "score": 2, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Been shorting since 280. It went up to almost 300 from there but I stood strong. This still has a ton more to drop. The cult of Elon is breaking, this thing won’t have the wild illogical swings to the upside anymore. It likely won’t go down as quickly as it should, but that fan base is dwindling by the day. ", "score": 3, "replies": []}]}, {"body": "As someone who was just shopping EVs, I disagree that Tesla is “the gold standard for high quality EVs.”  Based on current offerings they are pretty-good at best but competitors like Hyundai are offering better quality EVs at lower price points, so your competitive analysis is waaaay oversimplified. Fit and finish, visibility when driving, safety / kid-friendly features, and other fundamentals tended to lean away from Tesla in my test drives. \n\nYou’re free to disagree with my test drives, but either way looking at EVs as a two player space makes it really difficult to take the rest of your analysis seriously. \n\nTesla does not compete on quality. Tesla completes on being the “tech brand” for people who want to feel cutting edge. Today the feature that might make someone prefer Tesla as a buyer would be the superior charging network, but that’s going to continue to erode over time as other networks expand. Autopilot is a thing but it’s very expensive and I don’t think the auto market at large is ready to pay a premium to be an early adopter. The other reason I could see would be if you just want to say you drive a Tesla. \n\nOne of the reason I’m a long-term bear on Tesla at its current valuation is that I don’t think the company or many of its investors have fully grasped that it’s not 10 years ago and they have real competition now. For as much credit as Tesla deserves for being a first mover, that’s not enough to secure long term profit in the auto industry.", "score": 5, "replies": [{"body": "I thought Ioniq5 from Hyundai is at similar price of Tesla", "score": 6, "replies": []}, {"body": "Hey man, not disagreeing that there are other points of comparison that could be done against TSLA with way more competitors. I believe that everyone will get a pie of the EV market, the difference is who gets the most.\n\nI genuinely do believe that a long laundry list of points of comparison would not really add much value because this is a DCF rather than a “list of reasons to buy one EV brand over the other”. We could split hairs over why certain build or certain minor quirks make a BYD or a Volkswagen better than a TSLA, but these are really subjective.\n\nSo as the best objective measure, I looked at existing customers and what is the rate they are likely to convert to another brand and TSLA is the lowest.", "score": 2, "replies": []}, {"body": "anything negative about Tesla will get downvote lolz", "score": 1, "replies": [{"body": "Any nonsense posts will get downvoted. simple", "score": 2, "replies": [{"body": "There’s no nonsense as he’s stating facts and even “nonsense “ is a subjective adj lolz", "score": 1, "replies": [{"body": "Lolz ![gif](emote|free_emotes_pack|joy)", "score": 0, "replies": []}]}]}]}, {"body": "I was a valet for a long time while in school. When Teslas came out everyone hyped them as the cool tech car. I drove SO many and they are still fun as it gets to drive fast. The car is worse as an EV than many on the market and that list increases as Tesla build quality continues to show its weakness. \n\nTesla will keep dropping but because of its meme nature means you never really know. It won’t rise because it’s a good car at the right price point. Competition in the space is far to high", "score": 0, "replies": []}, {"body": "There is no other network that’s going to expand when it comes to charging. None. All the big autos are going to pay a premium to use teslas charging network but those big autos are too late and can’t even afford to build out a network. They are already saddled with debt unlike Tesla. They can barely afford to produce EVs at scale lol…\n\nThere’s another network you are forgetting - that’s the repairing network. Hyundai is absolutely fucking CLUELESS when it comes to fixing EV related issues. Because they have ZERO experienced workers in their shops with EVs. They will continue to have problems. Tesla won’t since all they do is eat sleep and breathe EV. Tesla has a mobile servicing network that’s expanding. I don’t need to even go to a shop. \n\nYou seem to be ignoring the fact other OEMs will never ever tool and build EVs at as good of a profit margin as Tesla is. \n\nYes there’s better physical quality EVs out there. That’s always an opinion/subjective based thing though. Hyundai OBJECTIVELY has many inferior technologies to Tesla though. Their battery management is trash they aren’t as efficient. Their software suite has reports of major bugging outs and crashing during the drive. \n\nYa there’s better car builders out there. But there’s very few who are completely and utterly only fixated on EV like Tesla is. That is why Tesla will continue to smoke most others in the EV market outside the cheap subsidized Chinese crap like BYD. \n\nIt’s just the most logical purchase if you are in the market for an EV because they know wtf they are doing with EVs. They have the better talented engineers and it’s all they know, EVs.. Meanwhile you got nothing but mechanical engineers trying to figure out a circuit at GM or they outsource and subcontract out a 3rd world software team to build software stack like ford and fail hilariously.", "score": -4, "replies": [{"body": "My point is still that straight-up ignoring other offerings on the market to focus on one competitor makes for a weak analysis. \n\nAlso lol that no one but Tesla can build a charging network. I guess I’ll call up the 3-4 non-Tesla charging networks I can use and tell them you said that. They’ll be devastated.", "score": 4, "replies": [{"body": "Ofc other CAN. But they aren’t. Why not? It’s not feasible. They can’t afford it.", "score": -2, "replies": [{"body": "There is more than one competitor on the market whether you like it or not. This analysis and price target are dog shit. \n\nBye.", "score": 1, "replies": []}]}]}, {"body": "Thoughts on Semi and Truck? What will the numbers be next quarter?", "score": 0, "replies": [{"body": "CT is dead on arrival and it will be a cancelled product line in under a decade. It serves no real practical purpose.", "score": 2, "replies": []}]}, {"body": "You have no idea what will happen in the future.", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "Essential tech item 🤡", "score": 5, "replies": []}, {"body": "You proved my point that they’re competing on tech branding and not vehicle quality, so again the OP is a weak analysis. Most people who buy cars are not tech insiders looking to brag online about having the coolest tech. \n\nI also named at least one competitor in my post that built a better car for me. I wasn’t trying to get the new cool tech item. I was trying to get the best value for the dollar on an EV. That ain’t Tesla.", "score": 3, "replies": [{"body": "You are right and i agree dor the tech insider brand play. But i disagree on everything you said about the competition and thr quality of the drive. I always come back to Tesla after driving other cars around because of its convinience", "score": 0, "replies": [{"body": "It’s actual nonsense to claim Tesla has no competitors. Enjoy the kool aid.\n\nAnd again my larger point that this analysis is on shaky ground because it’s ignoring competitors and misunderstands how Tesla competes is still standing.", "score": 2, "replies": [{"body": "Ofc it has competition just not at the level yet. Enjoy ur day", "score": 1, "replies": [{"body": "Ok but again, that was a cornerstone of this analysis. The analysis makes no sense.", "score": 2, "replies": []}]}]}]}]}, {"body": "But you see how what you just right here is nonsense but you were giving out to the other guy saying \"nonsense posts get downvoted\". How is it more of an essential tech item than a car? Its a very with tech features and even then the tech features don't matter because you use a car to get to point B from point A quickly, you're not supposed to spend extended periods of time in it after the fact. If you wanted to get tech that you could spend a lot of time with then you'd get something other than a car. The tech features in a tesla are a bonus on top of the car and the quality of teslas aren't that great so the bonus isn't as enticing as it should be. Tesla isn't better than a phone at being a tech item so I don't even know why you're saying its the best at that. There's plenty of companies that make better EVs than Tesla, I think some have even been mentioned on this thread so like I said you're not making a huge amount of sense here", "score": 1, "replies": [{"body": "Can a phone drive you around?", "score": 0, "replies": [{"body": "Oh so now it's car and not an essential tech item 😭😂", "score": 3, "replies": [{"body": "It’s tech that can drive you around. What is so hard about that? 🤷", "score": 1, "replies": [{"body": "So it's a car with technology in it.....\"a phone is just a watch that you can make calls on\"", "score": 2, "replies": [{"body": "And so why buy iphone? If its just a watch you can make calls in. Just buy a watch and a phone. Samething with tesla", "score": 2, "replies": [{"body": "No, you buy a phone due to its capabilites, why buy a WATCH when you can get a phone witb so much more. Again, your wording is backwards. Tesla vars are just cars with fancy tech, you get a tesla because you want a green method of transport not because you want to play around with its little tech pieces, if you wanted to watch a movie then you could easily whip out your phone and stream something on it. Hardly makes any sense for tesla to waste money and raise the price of a vehicle to do these weird things", "score": 3, "replies": [{"body": "Uhh i wanted the tech so I bought tesla. Tech was the only reason I went with and Im sure most people who bought tesla are like me. If I wanted a car ad a main thing, I couldve went with hundreds of other brands", "score": 1, "replies": [{"body": "Any brands can do what a car does, but no brands can match tesla tech as of now. Simple", "score": 1, "replies": []}, {"body": "Bro...that's the worst financial decision I have EVER read on this sub. You paid tens of thousands of dollars for some lame ass tech features....yeah no I'm done with you 😂😂", "score": 1, "replies": [{"body": "Just know ANY brands do what a car does, No brands do what tesla does. \nHope this helps you to understand and see things in a different perspective", "score": 1, "replies": [{"body": "OK name your favourite tech features, the reasons you bought the car in the first place", "score": 1, "replies": [{"body": "My favorite part is the user experience as a whole. The tesla app and screen feels so much smoother very easy and can actually do useful things in there. \nHaving the software centric approach allows the driver to think less and focus on my only job, which is to drive. You can’t just look at feature by feature, you have to experience it. It’s like iphone. Many years ago ppl say things like, oh android can do this, performance blah, camera blah, but apple took the market because it cared about the user experience. And currentl Tesla has the best UX of all companies", "score": 1, "replies": [{"body": "That's not a justifiable reason to buy a whole car , spend tens of thousands just for something that you're making to sound like an app....you spent tens of thousands of dollars for an app.  What you did is the equivalent of buying an iPhone just to check the time, if all you're going to do with it is check the time then you should have bought a watch and saved your money.  I'm 99% sure that you're trolling, I figured it out when you said you bought a car just for jts tech features and then proceeded to justify it by describing your favourite piece of tech  like an app..... I won't lie though, you definitely are an entertaining troll, like genuinely good job, your way kf describing yoir troll is smooth and...beautiful. 10/10 job man", "score": 1, "replies": [{"body": "That was enough for me however you frame it. I spend a lot of time in my car daily and I wanna have the best experience while at it. \nIdk why u r mad, probably because deep inside you u know I’m right lolz. But plz go on with ur day i’ll be chillin in my tesla enjoying", "score": 0, "replies": [{"body": "Nah I'm not mad, I really like your trolling 😂it is very entertaining", "score": 1, "replies": [{"body": "😹 I also enjoyed your perspective in what any car can do.", "score": 0, "replies": [{"body": "Whats the worst reaction you've ever gotten from one of your trolls?", "score": 1, "replies": [{"body": "Lolz plz stop commenting and go cry in ur average car. This is my last comment byebue", "score": 0, "replies": [{"body": "Pffft OK then guy who spent 10s of thousands for a glorified app 😂😂 I havent got as much to cry about other than your wallet right now but see ya later", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Hah sure 😹 it seems like you would never understand gg", "score": 0, "replies": []}]}, {"body": "Ice vehicles have all the same driving technology there's nothing special about it.", "score": 1, "replies": []}]}]}]}, {"body": "It’s a tech that has car ability yes. No other company does this better", "score": 1, "replies": [{"body": "It's primary goal is to drive you around, it's biggest marketing all has to do with its ability to drive you around....it's a car with tech just like a fridge with a TV isn't a TV with food storage abilities. You're getting your description backwards. It's a car....", "score": 4, "replies": []}]}]}]}]}, {"body": "This is the high iq response I expect from Tesla/musk simps", "score": 0, "replies": []}]}]}, {"body": "Hahahahhaha", "score": 0, "replies": []}]}]}, {"body": "What do you think the bottom is for TSLA?", "score": 2, "replies": [{"body": "Elon is the bottom", "score": 8, "replies": []}, {"body": "Double digits. It’s a car company, full stop. Get it to a forward PE in line with other car companies its size. Not sure what the exact number would be but I’d guess somewhere in the vicinity of 50 bucks?", "score": -4, "replies": []}]}, {"body": "TSLA fundamental analysis has been useless since 2012", "score": 3, "replies": []}, {"body": "The copium is fun to read. When will you all admit you got suckered into holding billionaire bags. The growth story is dead.", "score": 0, "replies": []}, {"body": "Mine says 176$\n\nthe problem with both values is that they depend on 2026 earnings. that can drop a lot and are still dropping (estimates)", "score": 1, "replies": [{"body": "I ran a dcf a while ago and I got a valuation at ~$100. Will need to rerun based on consensus estimates (which I believe have fallen)…", "score": 2, "replies": []}]}, {"body": "I got a few questions since it seems like you’ve done a fair amount of research. Do the batteries in the Tesla lose maximum capacity the longer it’s used? For example an Iphone will drop its overall charging capacity after a few years. How long do these Tesla batteries last in general? Lastly how do you dispose of these batteries and who is responsible for disposal. These are all the questions I’ve been wondering about the EV auto market would appreciate any feedback.", "score": 0, "replies": [{"body": "all bateries lose capacity the longer they are used", "score": 2, "replies": []}]}, {"body": "Need to stop Elon from tweeting. Profit.", "score": 0, "replies": []}]}
{"title": "Elon Musk told Giga Berlin employees yesterday that the Tesla Semi will likely be produced at their factory.", "selftext": "", "id": "1beh0e2", "created_utc": 1710407783.0, "score": 123, "upvote_ratio": 0.89, "num_comments": 79, "comments": [{"body": "Semi makes a lot of sense in Europe. There's mandatory breaks for drivers in the EU which mesh well with the Semi's range and charging time.\n\nThough this will probably mean that Tesla will have to invest in building up a MCS capable charging network as none of that exists right now (and if they wait for something backed by the EU or individual nations to be set up we could be here all century - much longer if it's supposed to be something that actually works reliably)", "score": 42, "replies": [{"body": "There are a lot of trucks with very defined routes which transport goods to a small set of company owned locations or just a few 3rd party distributors.  The drivers start and end their days at the same locations and it’s possible to locate chargers at one or two sites.\n\nTesla can likely spend a few years filling orders for these customers.", "score": 8, "replies": [{"body": "Agreed, but it takes a few years to build up an MCS charging network. They better start with that right away so that they are ready when the \"long distance customers\" start showing up.", "score": 1, "replies": [{"body": "True.  Although I’m guessing the same customers they sold trucks to in the first could years would be customers for those chargers and then you have a great idea where to place them to get the most use.\n\nUnless they can do a deal with a few truck stops.  It just seems like a waste to overbuild .  Maybe they’ll collect deposits and request routes early.", "score": 3, "replies": []}]}]}, {"body": "The charging network likely gets built along with each batch of semi's sold to individual companies. Theses semi trucks invariably run the same route again and again and again. This is the most likely way the charging infrastructure gets built for semi truck.", "score": 2, "replies": []}, {"body": "I would also suggest that the Semi is likely too large for Europe. Unlike the US market the EU, EEA and UK long ago stipulated a maximum trailer + tractor unit length of 16.5 metres and the width no more than 2.55 metres, with reefers getting 2.6 metres. This leads to the rather boxy design you see on European trucks and ones that are based on European trucks like the Nikola Tre.\n\nAlso the central driving position will play havoc with European border crossings and freight yards which are usually designed for trucks with seats on both sides of the cab.", "score": 2, "replies": [{"body": "They've already added [exceptions to the weight and length limits](https://www.fleetnews.co.uk/news/truck-news/2023/07/12/new-eu-weight-limits-to-help-accelerate-electric-truck-adoption) for electric trucks. Semi should be ready for action.", "score": 10, "replies": [{"body": "Did you read the first sentence?", "score": 1, "replies": []}, {"body": "That's a draft proposal and not law, it also doesn't specify the composition of the increased length. One would imagine it's not for standard tractor unit and trailer as 25 metres with a single articulation point would simply not fit in an average European city.", "score": 1, "replies": [{"body": "Didn't realise it was only a draft, thanks for pointing it out.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Trucks (of a large size) don’t go into cities in Europe. They certainly don’t in my country. \n\nI have this idea that it’s even forbidden to do so in my country but I’m not sure.\n\nAnyway every city has a warehouse center where things are delivered outside the city center, generally speaking.", "score": 1, "replies": []}]}]}]}]}, {"body": "they have to build up charging for Tesla Semi projects even in the US\n\nThe system has megapacks, megawatt chargers, and possibly solar panels at both ends of the trip.\n\nIf they don't install specialized megawatt chargers (1500kw charging) the semi takes hours to charge.\n\nAutobidder on the megapacks buys/sells electricity depending on the price/time of day.", "score": 1, "replies": []}, {"body": "It doesn't matter. Elon's words have very little to do with reality.", "score": -3, "replies": [{"body": "Not true. His time estimates don't, but his predictions of future products while far from perfect, is not terrible.", "score": 6, "replies": [{"body": "Sure the Tesla will launch in 2030 great", "score": 0, "replies": []}]}]}]}, {"body": "I think the more newsworthy part is that Musk said they hope the first European Semis will be finished in 2024, which implies that they will be finished before 2026. Pretty soon!", "score": 13, "replies": []}, {"body": ">NEWS: Elon Musk told Giga Berlin employees yesterday that the Tesla Semi will likely be produced at their factory.\n>\n>\"I think it makes sense to produce the semi-truck in Europe in Giga Berlin.\" - @elonmusk\n\nhttps://www.handelsblatt.com/unternehmen/industrie/elektromobilitaet-tesla-lkw-soll-in-gruenheide-gebaut-werden/100023711.html", "score": 7, "replies": [{"body": "Google translated from German to English (the part that is not paywalled)\n\n>**Tesla trucks to be built in green heath**  \n>  \n>Elon Musk announced the production of the electric semi-trail truck before the workforce before the workforce. Behind the arson attack a few days ago, the Tesla CEO suspects “greater forces”.  \n>  \n>**Düsseldorf.** Elon Musk stayed in Germany for only four hours. On Wednesday morning, the Tesla CEO spoke to his staff at the Grünheide plant. After an arson attack on the power supply, the so-called Gigafactory had recently resulted in a production downtime of several days.  \n>  \n>At his presentation, Musk was also asked about the so-called Tesla Semi, the truck model of the electric car manufacturer. “I think it makes sense to produce the semi-load car in Europe in the Giga Berlin as well,” said Musk, according to a video recording that is available to the Handelsblatt.  \n>  \n>Musk presented the Tesla Semi in 2017. The electric truck is currently being developed in Nevada and built in small numbers. According to the 52-year-old, the goal should be to manufacture the semi-trailers “for about the same price” as a diesel truck. To achieve this, Tesla would currently optimize the design and production. According to his own statement, Musk is working on a large number of productions for the end of 2024.  \n>  \n>**Tesla Semi is still in development phase**  \n>  \n> Matthias Schmidt, founder of the industry service Schmidt Automotive, sees the Tesla truck “definitely a market” in Europe. “Forwarding tickets have to make do with very low margins,” explains Schmidt, “those must be convinced.”\n\npaywall begins at this point", "score": 8, "replies": [{"body": "deepl.com translation of the partial page (it does a better translation job than google in my opinion) archive.ph couldn't remove the paywall which is unusual\n\n\nTesla electric truck to be built in Grünheide\n\nElon Musk announced the production of the electric Semi Truck during his lightning visit to Berlin in front of the workforce. The Tesla boss suspects \"larger forces\" behind the arson attack a few days ago.\n\nDüsseldorf. Elon Musk was only in Germany for four hours. On Wednesday morning, the Tesla boss spoke to his workforce at the plant in Grünheide. Following an arson attack on the power supply, production at the so-called Gigafactory was recently interrupted for several days.\n\n\nDuring his appearance, Musk was also asked about the Tesla Semi, the electric car manufacturer's truck model. \"I think it makes sense to also produce the Semi truck in Europe at Giga Berlin,\" said Musk according to a video recording obtained by Handelsblatt.\n\n\nMusk presented the Tesla Semi back in 2017. The electric truck is currently being developed in Nevada and built in small numbers. According to the 52-year-old, the aim is to produce the semi-trailer truck \"at roughly the same price\" as a diesel truck. To achieve this, Tesla is currently optimizing the design and production. According to Musk, he is aiming for high-volume production by the end of 2024.\n\nTesla Semi is still in the development phase\n\nMatthias Schmidt, founder of the industry service Schmidt Automotive, sees \"definitely a market\" for the Tesla truck in Europe. \"Haulage companies have to make do with very low margins\", explains Schmidt, \"so they have to be convinced\".", "score": 3, "replies": []}]}]}, {"body": "From Elon \"I think it makes sense\" to Sawyer \"will likely\". Sums up this tweet and this guy,", "score": 2, "replies": [{"body": "You have to interpret corporate speak differently. As CEO Musk can't just say definite things, because it will influence the share price. There is an \"official\" way of getting information of this nature out there. This was not it. But, Musk wouldn't hint at something like this, unless the decision was already made and preparations (even if only on paper) were already under way.", "score": 5, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": 0, "replies": []}]}]}]}]}, {"body": "How many semis have been produced so far after one year? 100?", "score": 1, "replies": []}, {"body": "Did we ever get any specs on the semi like range, cost, or load capacity? I believe its never hauled anything other than potato chips, correct?", "score": 1, "replies": [{"body": "maybe some soft drink", "score": 1, "replies": []}]}, {"body": "It makes sense but it needs a redesign, with a blunted nose and probably one less driving axle, or it will be too long for Europeans standard.  It will then have either a single Kotor or a dual Kotor design (400-800hp). Or you can get the double powered axis but the battery will either need to be a double stack or smaller.\n\nIt's basically a new product.", "score": -1, "replies": [{"body": "EU semi + trailer can be 16.5m total and the trailer from the 5th wheel to the back can be 12m.\n\nThe semi is 4m from nose to the 5th wheel. So no reason to redesign.", "score": 15, "replies": [{"body": "https://www.dimensions.com/element/tesla-semi#:~:text=The%20Tesla%20Semi%20has%20an,25000%20lb%20(11340%20kg).\n\n30 CMs too long, but it's close.", "score": 0, "replies": [{"body": "30cm where? I think you might have added the trailer length to the semi nose to 5th wheel dimension. And you forgot that part of the trailer is in front of the 5th wheel.", "score": 6, "replies": []}]}]}, {"body": "Blunted nose? Have you seen the semi? I’m not sure it’s possible to blunt the nose any further…", "score": 2, "replies": [{"body": "Uh... In Europe, trucks look like this:\n\n[https://www.scania.com/content/dam/scanianoe/market/uk/experience-scania/newsevents/News/2017/2/1-1-cng-waitrose.jpg](https://www.scania.com/content/dam/scanianoe/market/uk/experience-scania/newsevents/News/2017/2/1-1-cng-waitrose.jpg)", "score": 1, "replies": []}]}, {"body": "Yes, but after you have a working Semi in the US form factor, I don't think it would be that time consuming to engineer one for the european market.\n\nA bit like model 3 vs model y, same platform.", "score": 3, "replies": [{"body": "Im having a hard time understanding why any European trucking company would pick the Tesla over the already available and established European brands. You can buy an electric Scania/Mercedes/Volvo today. Also atleast where i am a lot of trucking companies are very brand loyal.", "score": -7, "replies": [{"body": "Price and features need to be competitive of course, but if they are then why would trucking companies pay more for a worse product?", "score": 8, "replies": [{"body": "They'll be choosing the manufacturers they have good relationships with. Price is less of a concern than reliability. If the truck doesn't work, then they're losing tons of money. Spare parts have to be available within hours so repairs can be performed. \n\nIf Volvo has been a reliable partner for them the last 20 years, then they'll go with Volvo, even if pricier. ", "score": 0, "replies": []}, {"body": "The USP of the Semi should be full autonomy - without that how is it a better product?", "score": -2, "replies": [{"body": "Cheaper, more range, quicker to charge etc. Obviously we don't know if it is a better product yet because it doesn't exist", "score": 2, "replies": [{"body": "It launched in the US in October 2022, with the first deliveries in December. The claimed specs are cheaper, further, faster, etc.\n\nThe issue at the moment - at least in the US - seems to be production, although Musk has said [he thinks 50,000 will be produced this year](https://jalopnik.com/musk-says-tesla-will-be-no-2-semi-seller-in-us-by-2024-1849854049)", "score": 1, "replies": []}]}]}]}, {"body": "In the end it will be decided on price. If Tesla sets up a megawatt (MCS) charging network - and there's no reason to believe they won't - then going Tesla will become a no-brainer. Low charging cost (which Tesla can offer since they can afford to run their charging network at cost - unlike others who need to make a buck) will easily tilt any kind of financial calculation in Tesla's favor.\n\nTrucking companies aren't 'loyal'. Trucking is a cut-throat business where every tenth of a cent per mile counts.", "score": 8, "replies": [{"body": "There are definitely brand loyalty among trucking companies here, a Volvo salesman told an owner of a trucking company that i know \"i could give you these trucks for free and you would still choose Mercedes, you might as well have a Mercedes star tattooed on your forehead\". Also i think Tesla would need to rework the entire interior of their trucks, it looks like they never spoke with any truckers before designing it. Definitely not any European truckers atleast. Although time will tell i could of course be way of, although the fact tesla wont even release the specs while every other manufacturer does is a bit worrying.", "score": 0, "replies": []}]}]}]}]}, {"body": "Almost no one in europe drives trucks. So the selling point for cybertruck is just to showboat. Think it also is against EU safety regulations", "score": -5, "replies": [{"body": "which EU safety regulations is the electric semi against", "score": 5, "replies": []}, {"body": "This headline is about the semi not the cybertruck…", "score": 3, "replies": [{"body": "Im sorry, i cant read apparently", "score": 1, "replies": []}]}]}, {"body": "If the stock keeps sliding, nothing will be produced at this factory unless it's bought by another auto maker.", "score": -5, "replies": [{"body": "what? explain your thought process please?", "score": 5, "replies": [{"body": "Tesla has crashed in valuation over the last (3) years and only ever had a meteoric rise during COVID-mania when meme stock trading became a sensation & Elon attempted to capitalize on it. Nothing about this company is worthwhile in his hands, and the underlying technology is nothing special nor necessary in this or any other world. The trajectory it is currently on has been on a downward spiral with no hope of recovery in sight at this time. Doesn't mean it will happen, but it looks like eventually Musk will be forced to sell it to another manufacturer of automobiles who knows what they're doing.", "score": -1, "replies": [{"body": "but they sold 40% more cars year over year for 10 years straight and they have 30 billion dollars in cash and their energy storage business grew 125% and insurance is growing and the repair business is growing and their financials are great and they are about to make a 25,000$ car\n\nWhat does the stock price have to do with whether the semi will get made in Germany?\n\nThe stock price could drop to 0$ and Tesla would still have 30 billion dollars in cash and factories all over the world and low debt and sell 2 million+ cars a year and have a growing battery and energy business.", "score": 4, "replies": [{"body": "If the stock price drops to $0 Tesla is finished. I look forward to that day and hope that you check back in with me when it happens.", "score": -1, "replies": [{"body": "What about the stock price being 0$ would cause Tesla to be finished?\n\nI think you have some kind of wire crossed somewhere - do you think the stock price of a company is actually how much money the company has?\n\nIt isn't.", "score": 6, "replies": [{"body": "If Tesla stock goes to $0 it would completely and totally break confidence in Elon Musk as a business leader while also demonstrating the market does not care about the survival of the company. You think incorrectly about my understanding about stock price and how much cash a company has, and your own understanding of the stock market appears woefully inept for this discussion.\n\nFew companies can survive their stock going to $0 in their current formation, which is why I'm saying that the likelihood is that if it were to continue crashing as it is right now, that another company would scoop up the remaining assets they have and cut down on any unnecessary expenses such as production facilities that aren't integrated with the larger parent company.\n\nA company's stock price & valuation has a lot to do with their money borrowing abilities, as well as debt repayment options, and if it goes to $0 that all disappears. It would be catastrophic for the company and their current decline is evidence it's a sinking ship.", "score": -1, "replies": [{"body": "It sounds like you think the SP is really important?\n\nI don't - I think Teslas millions of cars being sold, its growth, its cash, and its technology are the company - not the stock price.\n\nBut to entertain your idea that the SP is important...\n\nTesla is worth 1.5x Toyota despite selling 1/6 as many cars.\n\nSO Tesla has 900% as much \"Stock price per car sold\" as Toyota!!! Amazing! Superlative!\n\nTesla's stock is doing very very very well. Teslas stock price is very high.\n\nSo Tesla is super super healthy then by YOUR measure, right?", "score": 4, "replies": [{"body": "Tesla's stock is NOT doing very well. It is crashing hard and has been nothing but a turbulent decline for 3-ish years. During the same time, Toyota's stock has been increasing in value steadily though perhaps it is now rising too quickly. But regardless, it's up ~60% over the same time frame that Tesla is on pace to go out of business. It doesn't even take much to look at these charts. Your lack of comprehension of these things should concern you, and the number of vehicles produced by Tesla is not enough to save it now.\n\nTesla's stock price is not very high, compared to where it was at. I'm not really sure what you think your arguments are here. Either you believe this company can survive despite its stock price crashing, which will be very difficult to explain to shareholders and customers eventually. Or you think the stock price is irrelevant even if it eventually gets delisted from the exchange for being worthless which it is now on pace to do by end of year.", "score": 0, "replies": [{"body": "Is the only thing that matters how the stock changed recently?\n\nSo lets say a Trillionaire existed who buys 500,000,000,000$ worth of Microsft\n\nThen the next day that Trillionaire sells all of his shares.\n\nSo on the following day, Microsoft's stock went down a lot.\n\nYou don't seem to care much about the business? About the manufacturing? About the piles of cash on hand? About the future business?\n\nThe fact that the stock price dropped means Microsoft is a terrible company?\n\nSo the same Microsoft with the same buildings and employees and managers and balance sheet is \"Terrible\"  vs \"great\" depending on the whims of the stock market at that time?\n\nTesla is up 1000% as of 5 years ago\n\nTesla is worth more than Toyota\n\nSo it sounds like a world where Tesla's stock slowly crept up to where it is now linearly, you'd say Tesla was a good company then?\n\nImagine that story \"Tesla between 2018 and 2024 grew 1000%, became the largest Auto stock in the world with 1.5x the valuation of Toyota!!!!!!!!\" And that would be at the same valuation it is today, 160$ or whatever.\n\nBUT but but... the stock jumped too high in the interim? So Tesla the company sucks because of that?", "score": 3, "replies": [{"body": "If the sell-off continues, that cash Elon has will go to pay shareholders who are exiting, which will begin to reveal all the underlying fraud, lies, and other instability at the company. Net profit margin of GM is less than 5% for example, Toyota is about 11%, Mercedes is around 9%, Volkswagen is at about 5%, etc. Tesla reports their profit margin is over 31%? I don't buy it, and neither will anybody else when he runs out of money from a collection of investors who keep pulling out.\n\nYour entire series of fantasy arguments are not relevant to this discussion, because the real life horrors at Tesla have been unveiled and will continue to show their ugly face. If a buyer of Tesla (after bankruptcy) believes that the factory in question is an asset they will keep it in use for their own facilities or if they keep the Tesla name they could keep it in use. More likely as these things go the brand name will be used in name only while a buyer eventually strips Musk's company for parts and then consolidates manufacturing in their own facilities.\n\nIf a company's stock drops -75% like Tesla did at its lowest point between the peak of 2021, then yes, it is a signal from the market that the company is terrible and therefore the business is bad, or at a minimum, run badly with bad management. Tesla is a terrible company, an atrocious stock, the CEO is vapid, and the market is speaking loudly on these points beyond my own personal take on the situation.\n\nFor the record, if a trillionaire bought $500B of any stock including Microsoft, they may be able to do that only if the company issues shares to them. In the fictional case that this happened, that trillionaire would need to find buyers of their stock if they chose to sell it the next day and if they try to sell it that quickly it would signal to the market that something undesirable was going on at said company because it would be unlikely the trillionaire would have made any money and their lack of prudence or fear of holding the stock would raise many eyebrows.\n\nUsing this ridiculous example, the collective group of people who pumped up Tesla into a Trillion Dollar company all quickly found out that some things were clearly wrong at the company which is why the stock is being punished the way it is. Your complete, and total lack of business sense or stock market comprehension is understandable because these issues are complex, but your insistence on arguing is fruitless because you know so little about the topics at hand.", "score": 0, "replies": [{"body": "The cash Elon has will go to pay shareholders? what?\n\nI don't think either of us knows what you're trying to say.\n\nTesla has 30 billion cash. That has nothing to do with the stock value.\n\nThe stock could go to 0 and Tesla still has 30 billion in cash and no debt.\n\nThe company is probably the healthiest of all the EV companies on planet earth.\n\nWhat does the stock dropping have to do with causing fraud to become known? What fraud?\n\nTesla is a healthy company with low debt lots of cash selling tons of products growing quickly with new products in the pipeline.\n\nYou're coming off as pretty unhinged.", "score": 2, "replies": [{"body": "Tesla is not a healthy company. Their stock is tanking.\n\nShareholders are selling off like wildfire. When those shareholders sell, their broker may be responsible for providing them the market value but they do so from the issuer. That eventually must be paid out in terms of cash from the company and without enough cash to pay they need it from investors. If there are no investors to buy back in because they realize it's a sinking ship, that becomes a Ponzi scheme anyhow, but proves my ultimate point which is that $30B can't cover the losses which this company is poised to suffer and you do not understand enough market fundamentals to argue here.", "score": 0, "replies": [{"body": "\"Tesla is not a healthy company. Their stock is tanking.\"\n\nStock price is not directly tied to the health of a company.\n\nEven if it was, Tesla's stock price puts it at \"1.5 Toyotas\"\n\nYour thesis isn't getting 1 inch off the ground.", "score": 2, "replies": [{"body": "Stock price is exactly tied to the health of the company and your insistence that it isn't is extremely off base.", "score": 1, "replies": [{"body": "\"Stock price is exactly tied to the health of the company\"\n\nOh, you're a satire account.", "score": 1, "replies": [{"body": "No. You're just too ignorant to understand anything about the stock market and how it demonstrates or impacts the health of a company. The idea that the price of a stock, and its market capitalization are divorced from the health of the company writ large is why people such as yourself end up being convinced to hold onto burning shares of a trash heap like Tesla until its too late.\n\nI wish you the best of luck in your future endeavors.", "score": 1, "replies": [{"body": "\"Checks the stock price\" Woah, Tesla is the most valuable car company on planet earth? More valuable than GM, Toyota, VW?\n\nThey're so healthy! I'm glad I checked the stock price to see if the company was healthy. Thanks for the tip!", "score": 1, "replies": [{"body": "The stock price is an indicator, and it fluctuates over time. Things like a stock's chart of price changes throughout time, and an analysis of how it is likely to continue or change in the future, and things which will detail the health of a company in total. How a company became valued at what the market says its worth matters also. Tesla's run-up was synthetic, and absolutely nothing about it has lasted very long.\n\nGM has been around for over (100) years and has been part of the backbone of the real American economy since then. GM also pays a dividend, which Tesla doesn't.\n\nYour sarcasm is sad, because it indicates you have no interest in learning anything or understanding the situation. But it makes sense as you're probably in your early 20's with somebody else's money owning shares of Tesla and AI companies which you think makes you some kind of big shot. But your ignorance is dense.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "So you admit you’re not an investor?\n\nAre you here to smear the company or because of a pathological need to troll?", "score": 4, "replies": [{"body": "I think my comments speak for themselves. Your addiction to Tesla (based on comment history) shows a clear case of somebody who has lost a lot of money on this company, and for that I am sorry to see. But in the future you should consider putting your money on companies that are built on more than Elon Musk.", "score": 0, "replies": [{"body": "Yes your comments speak to a pathological need to troll.  If you think you’re doing otherwise, you’re fooling yourself.", "score": 2, "replies": [{"body": "It's not trolling when everything I said is accurate. There is no pathology here, either. My comments speak to the lacking underlying value in Tesla and how their current financials are synthetically presented, given how mismanaged things are by their CEO and how inexperienced or immature the shareholders were.", "score": 1, "replies": [{"body": "Where in the world did you get the idea a troll has to be inaccurate ?  Accuracy has nothing to do with it.\n\nPro Tip: Learn what words mean before attempting use.  ESPECIALLY when they describe yourself:-)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You seem to be confusing stock price for operational financials. The sliding stock price has quite literally no bearing on this, or if anything the company is incentivized to push the semi EU project sooner to show more growth.", "score": 3, "replies": [{"body": "I am not confused about stock price of how it impacts operational finances. You have no concept of just how bad the stock's price collapse is for the company and what would occur if or when it goes to $0. But by all means, if it happens please do revisit this thread and tell me how Tesla's stock going to $0 was good for the company's EU project.", "score": 0, "replies": [{"body": "Lol, your comment literally just makes no sense. Sure , if the stock price goes to 0 then clearly there will be problems, but outside of that you’re talking nonsense…", "score": 2, "replies": [{"body": "My comment makes perfect sense. Stocks that got to $0 indicate a failure of the underlying business. If a stock goes to $0, it is evidence that clearly there WERE problems which were ignored for far too long.\n\nI'm not talking nonsense. You just don't comprehend it.", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "BTC Only Has One Leg Left in its Lifespan", "selftext": "&#x200B;\n\n[This is a logarithmic BTC chart. I have mapped out every bull and every bear cycle.](https://preview.redd.it/k0ttmde1v8oc1.png?width=1280&format=png&auto=webp&s=c5ba310ae7300c1d7e67cb8007a95e9837b705fe)\n\n&#x200B;\n\nhttps://preview.redd.it/bv0ggi23v8oc1.png?width=601&format=png&auto=webp&s=8df19ff87d440baac8a251e9bdc80b2c64824d12\n\nI've also charted them all here in Google Sheets. It just so happened that both bull cycle 2 and 3 were nearly identical lengths.\n\nAs we can see each bull cycle brings less lucrative profits. Starting with 30,0098.56%, then 9257.17% and then the most recent one 1949.89%.\n\n&#x200B;\n\nhttps://preview.redd.it/mpmetrn6v8oc1.png?width=179&format=png&auto=webp&s=7644e6061884c6663f61e8813b08c08a15bb3a0d\n\nAfter that I calculated the dropoff factor for each bull run. The first dropoff factor was 30.7% approx. Which means that the second bull run was only 30.7% as profitable as bull run 1.\n\nThe third bull run was only 21% as profitable as bull run 2. This is a 68% dropoff in profitability which I used to get our dropoff factor for the bull run we're currently in. I applied 68% to 21% and got an anticipated dropoff factor of 14.4%.\n\n&#x200B;\n\nhttps://preview.redd.it/4f9i5xb9v8oc1.png?width=176&format=png&auto=webp&s=433270044204eaf853daa8f2c0535094beeaec34\n\n14.4% of the previous bull runs profitability (1949.89) leaves us with 281.28%.\n\n&#x200B;\n\nhttps://preview.redd.it/gbvzss4av8oc1.png?width=176&format=png&auto=webp&s=7d1e699be733ac6947c59e2b3c3a7b43047df083\n\nWith a previous true market top (weekly close) of 65,145 to predict the next bull market top all we would do is multiple this number by 2.8128\n\n&#x200B;\n\nhttps://preview.redd.it/7vgzxoobv8oc1.png?width=150&format=png&auto=webp&s=22142a34aa46518d72c93d26dcb1de531950ba76\n\nOur next ATH prediction is approx 183K USD.\n\n&#x200B;\n\nhttps://preview.redd.it/22kkioddv8oc1.png?width=148&format=png&auto=webp&s=c1d4ccb23db41e3076fc69551bdc20920e3dc647\n\nSince this current bull run started on Nov 21, 2022 (Our first week with a green candle since a bear market) we can anticipate an average of 963.66 days until next top. Giving us a projected new ATH date of July 11/2025.\n\n&#x200B;\n\nhttps://preview.redd.it/ul1ez8sev8oc1.png?width=245&format=png&auto=webp&s=e0652203b9769e9184a7245424d9e4600bd4e869\n\nThe average bear drawdown is 79.64% which means we can predict a bear market low of 37.3K. The average bear market takes approximately 382.66 days leaving us with a projected bear low occurring on July 28, 2026.\n\nAlso worth noting that if we continue to see the downtrend of profitability in bull cycles that is projected this will literally be the last bull market.\n\n&#x200B;\n\nhttps://preview.redd.it/0jr6mkfjv8oc1.png?width=176&format=png&auto=webp&s=419b16e4ebb7e2ab580bc8af24160c34ad9c45ed\n\nAlarmingly for BTC the 5th bull cycle will have a dropoff of 9% profitability when compared to previous cycle. Since the previous cycle will only be 281% profitable bull 5 will only be 27% increase in price.\n\n&#x200B;\n\nhttps://preview.redd.it/4umblhemv8oc1.png?width=180&format=png&auto=webp&s=59c5482eeeacefc46c847972b45019f51ba74667\n\nThe projected bull 4 cycle market top will be 183,240.90 and 27% of that would be 50,920.70\n\nIn summary, BTC only has one leg left in it's lifespan.", "id": "1beeseg", "created_utc": 1710398097.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 80, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Damn wouldn't data science be so much easier if you could extrapolate from 3 data points", "score": 101, "replies": [{"body": "Even if you extrapolate from a million data points you would not know anything about future price movements", "score": 22, "replies": []}, {"body": "Id be out of a cushy job… shhhh", "score": 6, "replies": []}]}, {"body": "TLDR; Try to buy low and sell high, but just buy high and sell low anyways.", "score": 35, "replies": []}, {"body": "Not enough lines. Please draw some more.", "score": 14, "replies": []}, {"body": "RemindMe! 17 Months \"Only one way to find out\"", "score": 5, "replies": [{"body": "I will be messaging you in 1 year on [**2025-08-14 11:23:57 UTC**](http://www.wolframalpha.com/input/?i=2025-08-14%2011:23:57%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1beeseg/btc_only_has_one_leg_left_in_its_lifespan/kutieyz/?context=3)\n\n[**14 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1beeseg%2Fbtc_only_has_one_leg_left_in_its_lifespan%2Fkutieyz%2F%5D%0A%0ARemindMe%21%202025-08-14%2011%3A23%3A57%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201beeseg)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "Well, at least the bears aren't calling it fake money any more.", "score": 3, "replies": [{"body": "It's fake money. I got 4k in it, and still think it's fake money.", "score": 0, "replies": [{"body": "“I paid 4000.00 real dollars for 0.01 fake money”", "score": 1, "replies": [{"body": "This is not the gotcha you think it is. Dude is just self aware about speculation. Regard.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "Sounds like you’re sidelined and coping.\n\nFeels sad for you guys.", "score": 3, "replies": [{"body": "He literally told you.", "score": 2, "replies": [{"body": "did you just assume their gender?", "score": -8, "replies": [{"body": "Yawn", "score": 5, "replies": [{"body": "Micro aggression. Typical white male", "score": -5, "replies": [{"body": "Ohhh you are a bitcoin simp I get it now", "score": 5, "replies": [{"body": "Have fun staying poor", "score": -2, "replies": [{"body": "I am having fun, then again I dont have to gamble to build wealth.", "score": 1, "replies": [{"body": "Saving in the hardest money ever created isn’t gambling.\n\nSaving in worthless fiat currency being debased exponentially is gambling.\n\nWake up and drop the ego.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Yup. Every investor in the world has done exactly your analysis, so they'll all converge on the  answer that there's no money to be made here.\n\nJK. What kind of casino do you think this is!?!?", "score": 3, "replies": []}, {"body": "You are forgetting the colossal passive income from the Bitcoin ETFs. Net inflow just from the ETFs is 3900 Bitcoin EVERY DAY! In April, new supply halves to 450 BTC per day. The bitcoin chart is an S curve and we’re at the very start of a bend upwards. The next 10 years will be Bitcoin’s gold rush. More companies will start holding it on their balance sheets. It will flip gold’s market cap. More nation states will start stacking.", "score": 2, "replies": [{"body": "Exactly this bitcoin has mainly been pumped overnight at 2 am that’s not retail lol", "score": 4, "replies": []}]}, {"body": "180k top this summer?!? Thats pretty good. Deal accepted.", "score": 2, "replies": [{"body": "What’s it like living in 2025?", "score": 12, "replies": [{"body": "Today august 3rd,2024, I have just closed on another lake house. One for every btc cycle so far. Feel good. On monday, I’ll be reducing my role in the office, if push comes to shove, take some leave and think about things. The altcoin boom is in full swing, if my eth,sol and dot keeps climbing, might retire by the end of the year if my tiered exits all hit. \n\nEdit: summer 2025, on the ted talk circuit and pushing my “finance “ book called, “smoothbrain success”, already a best seller. Ai wrote the whole thing. ", "score": 4, "replies": [{"body": "Ah yes, me too, I also closed on another lakehouse just this morning. That's how you can tell I'm correct. Because I closed on yet another lakehouse.", "score": 2, "replies": []}]}]}]}, {"body": "!remindme July 11, 2025", "score": 1, "replies": []}, {"body": "RemindMe! 17 Months \"Only one way to find out\"", "score": 1, "replies": []}, {"body": "It’s almost like it’s harder to afford BTC when it’s $70k apiece instead of $100, damn.", "score": 1, "replies": []}, {"body": "Real life example of a mid curver.\n\n500-1b daily etf inflows which will accelerate as more companies, hedge funds, banks, nations etc start accumulating the hardest money ever created. Throw all your models in the bin.\n\nIt’s going higher forever.", "score": 1, "replies": [{"body": "Yes everyone is always going to never take profits especially the people that are in from the beginning 👍", "score": 6, "replies": [{"body": "What does that have to do with anything? Jeets sell their coins to smart money for worthless fiat. Bitcoin still goes up forever.", "score": -3, "replies": [{"body": "LOL your first cycle?\nEnjoy the ride though.\n\nThe only single nation to put Bitcoin on their balance sheet had a horrible time doing so.", "score": 2, "replies": []}, {"body": "Do you feel what I mean? \n\nSee you at 52.000$", "score": 1, "replies": []}]}]}, {"body": "Lmao Tether has to print exponentially more to pump BTC every new cycle", "score": 3, "replies": [{"body": "That's what happens when new liquidity enters the market. They don't just print them for the craic lmao", "score": 1, "replies": [{"body": "ETFs are buying with real money, not Tether.", "score": 1, "replies": []}]}]}]}, {"body": "I agree with you. On one hand it's not getting any more popular than it did 3 years ago. Back then even the guy who mows your land knew about it. But chances are he won't invest on it again. My prediction for it this bull run will last and be played among the crypto audience mostly. Very little newcomers. Those who held will sell off most likely. In any case my prediction is the audience will decrease in size. One better crypto might take its place. It will eventuslly die off and be remembered as the ponzi scheme of the decade if it does though", "score": -1, "replies": []}, {"body": "Imagine it become the stardard of finance in 10 years after the US collapses the USD and along, all the other currencies\n\nThere are only 21M BTC in the world\n\nAround 5M are lost and can't be given back\n\nSo There's around 20-5 circulating, 15M\n\nThe world has 8 billion people\n\nOwning 1 out of 21M coins will mean a lot\n\nI'm diamond handing my 1.1 BTC till the end of times, money isn't real but a controlled inflationary currency that can't be copied or multiplied just because the government feels like it to fuck low and middle class seems good to me", "score": -6, "replies": []}, {"body": "You clearly don’t understand the purpose of bitcoin.\n\nGo back to wallstreet!", "score": -2, "replies": [{"body": "What's the purpose of bitcoin? I thought it was just another table at the casino", "score": 2, "replies": [{"body": "And you are right.", "score": 3, "replies": []}]}]}, {"body": "Well until it doesn't.\nShit is nothing worth and just polluting earth.\n\nMoney would be better invested in actually fixing the fiat system.", "score": -16, "replies": [{"body": "Fixing it how? Maybe coming up with a digital currency that will replace it?", "score": 5, "replies": [{"body": "Yes a currency which needs a lot of energy in order to make trades is the solution for current problems.\n\nI would even say, this stuff enables criminal activity.\nThere is no need for a honest person do hide behind a btc address.", "score": -1, "replies": [{"body": "It doesn’t require hardly any energy.\nWhat you mistake is people wasting energy to fight over mining it faster so they get the rewards. Now luckily this isn’t all bad, the more miners there are, more secure it is. In fact it’s the most secure thing on the planet, the irony being the more it’s worth the more people will support it by mining it making it even more secure. Genius, but yes uses energy. Could easily set energy restrictions tho. Companies running 100 acre farms shouldn’t be legal anymore than 1 person owning 20+ rentals.", "score": 2, "replies": [{"body": "Indeed 131 TWh a year is hardly any energy......\nThis number comes from BTC energy consumption index.\n\nSo yes, it's safe if it's actually decentralised. \nStill it can be centralised taking all benefits over fiat currency.", "score": -1, "replies": [{"body": "Your problem is you’re easily baited by propaganda. Energy consumption isn’t bad lmao.\n\nEndless printing of fiat is a ponzi waiting to collapse. Bitcoin is the lifeboat.", "score": 0, "replies": [{"body": "Energy consumption isn't bad? Do you want to tell me next energy used for this useless process is green? As if it would improve any of the problems outlined?\n\nWho is baited by propaganda?\n\nThe guy just being anti because of the fanatics or the  fanatic trying to find any reason to justify the BTC bullshitery?\n\nI get it, you earned a lot of money from that and you believe in this but just be cautious. \n\nI prefer to have a stable ponzi scheme, steered by competent and visible humans rather than unknown criminals running the bank house.\n\nIts a lifeboat? Jeah it's the messias. It's the fucking salvation. It supports us reaching the overall end much faster, that's for sure.", "score": 3, "replies": [{"body": "\"I prefer to have a stable ponzi scheme, steered by competent and visible humans rather than unknown criminals running the bank house.\"\n\n0 iq", "score": 0, "replies": [{"body": "Well the lowest iq is always the first one pointing at others.\nSorry you are clueless and caught in your conviction.\n\nContinue to repeat others without understanding the fundamental differences and problems.", "score": 3, "replies": [{"body": "sure buddy", "score": 1, "replies": [{"body": "Good we agree on that!", "score": 1, "replies": [{"body": "Stay poor", "score": 1, "replies": [{"body": "That's a very limited assumption from you!\n\nWould there be anything wrong about not beeing \"financially\" rich?\n\nDo you think I can become monetary rich by procuring bitcoin?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "How dense are you? You said it “needs” the energy. I just explained why it doesn’t. The amount of transactions has stayed the same since 2014, but energy spent mining it has gone up almost 80x. \n\nThe network is even more efficient now than before. We could literally reduce the energy spent by 99% and it would still would function flawlessly. \n\nNot sure you even know what centralized means at this point and I’ve run out of autism for tonight", "score": 0, "replies": [{"body": "I have a quick proposal on how to reduce energy spent for btc by 99%.\n\n\nJust don't do btc. If it would be worth money, no greed would support the mining trash.\n\nI don't believe the amount of transactions is the same since 2014. \nIt's like playing the lottery.\nThe more people play the faster the jackpot will be hit. If you wouldn't split the work and therefore the earnings, no efficiency increase.", "score": 2, "replies": []}]}]}]}, {"body": "It doesn't need energy to make trades. At least not more that regular bank transfers.\n\nIt needs energy to create it. Same as everything else. But there will come a point when all the bitcoins are mined out and then the energy consumption will drop drastically", "score": 0, "replies": [{"body": "So... if all btc is mined, which incentive does anyone have to secure the transactions?\n\nWhy would someone keep a mining rig running to find the correct hash if there is nothing coming from that.\n\nIt needs much more energy than a bank transaction as banks to not block chain the transactions.....", "score": 1, "replies": []}]}]}]}, {"body": "What u mean, money printers exist so no problem right", "score": 1, "replies": []}, {"body": "TF? Money? Don't build houses out of rotting wood.", "score": 1, "replies": [{"body": "So satoshi used bricks? [X] doubt.\n\nIt's not even physical ....", "score": 1, "replies": [{"body": "Neither is \"money.\"", "score": 1, "replies": []}]}]}, {"body": "Lol how do you \"fix\" a fiat system? :DD it is inflationary by definition. Bitcoin has a maximum amount of coins ever to be created.", "score": 0, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Your turds have no demand, your point is invalid", "score": 2, "replies": []}]}, {"body": "Whatever you do, having everything in the cloud is not a solution.\n\nTaking digital access as granted can backfire very quickly.\n\nWell, why is the value of a bitcoin not stable compared to other commodities then?", "score": 1, "replies": [{"body": "Bitcoin is not in a cloud... please learn how proof of work blockchain works.\n\nBitcoin's value is based on supply and demand. The more money people put into the pot, the higher the value and vice versa.", "score": 2, "replies": [{"body": "If its not a cloud,\nWhy is my trade then saved on a chain on other people's computers?\n\nThere you already have the issues with bitcoin.\nSupply is poised by people speculating on its value.\nHolding it in their wallets.\nDemand? I don't know who really needs this other than criminals or hedge funds.\n\nSupply is limited, by coin cap and by dead wallets, until they awaken.", "score": 2, "replies": [{"body": "Bitcoin can be mined in a cloud: in rented servers. The whole blockchain does not run in a cloud, it is a decentralized network.\n\nWho needs bitcoin? Anyone who realizes that as the fiat inflates, people tend to invest into assets with limited supply. In gold you have to trust a government. With bitcoin, the whole system is based on lack of trust.", "score": 1, "replies": [{"body": "For me, that's exactly what a cloud is. My trades are saved on servers somewhere else. My transaction is saved by whoever solves the equation and finds the hash first.\n\nIf I don't have Internet I can't access my wallet or handover bitcoin.\nIf no ones trying to find the correct hash, no transaction for me.\n\n\nWhere do I have to trust government regarding gold? \nI can exchange gold for goods in time of chaos. Do you think  some one accepts bitcoin then?", "score": -1, "replies": [{"body": "Dude. No. That is not a cloud. There is not a single entity controlling the blockchain. It is completely and utterly decentralized.\n\nYour trades saved on some random server somewhere? That is an accurate description of a bank..\n\nNo internet? Oh... please then do not use any banks. Do not use cards. Only use cash.\n\nSomeone might fail to solve hash? Bitcoin creates a new block every 10 minutes and adjusts difficulty accordingly. Every. Ten. Minutes. Ever. Someone failing to solve is simply discarded.\n\nYou trust government on the value of gold. You trust them to have X amount of it in weigh in their vaults etc.\n\nYes bitcoin is highly volatile. The market cap is tiny compared to gold. There are whales that have power to manipulate the value. Bitcoin is still in it's baby steps. There will be massive bearmarkets and following bullmarkets.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "If money was spent on green energy infrastructure, like it should be, then it wouldn’t pollute.", "score": 0, "replies": [{"body": "And there is no single thought, that less consumption could drive the greenification faster?\n\nIf so, why are you preferring to put money into btc rather than investment into clean energy generation?", "score": 1, "replies": [{"body": "I do invest in green energy", "score": 1, "replies": [{"body": "That is honorable.\nGood you do!", "score": 1, "replies": []}]}]}]}]}]}
