{"title": "Forgot I was on my margin account and took assignment……. of $18,000 AMZN.", "selftext": "143% of my account……. Sorry fellas, with my luck the market collapse happens this weekend. My bad.", "id": "1bau2e7", "created_utc": 1710023154.0, "score": 503, "upvote_ratio": 0.93, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 544 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Call Amazon and ask if you can return options since you’re a prime member.", "score": 765, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 134, "replies": [{"body": "I called kohls and they told me to go fuck myself", "score": 161, "replies": [{"body": "You tried your best, and that's what counts.", "score": 15, "replies": []}, {"body": "Bozeman's Kohl's is that rough, eh? 🤣 been there", "score": 2, "replies": []}]}]}, {"body": "If he is not a prime member, he needs to cross state to do the drop off. ", "score": 8, "replies": []}]}, {"body": "Either you go to school to learn about finance or learn by doing it.  Doing it it so much better.  I’ll write cover calls at 180 first thing 😀", "score": 266, "replies": [{"body": "I was gonna say the same thing. Start writing covered calls and use the wheel strategy.", "score": 55, "replies": []}, {"body": "For real. Check out r/thetagang", "score": 12, "replies": []}]}, {"body": "Get a separate loan Add another 6k to the account, sell weekly covered calls until it gets assigned.   Use premiums to cover interest payments.", "score": 96, "replies": []}, {"body": "\"Forgot I was on my margin account\" is such a wsb thing. You belong here.", "score": 41, "replies": [{"body": "I just realized I had $14k on margin too… and I had overbought a treasury etf with it so little return….", "score": 4, "replies": []}]}, {"body": "Sorry but what was his position here?", "score": 62, "replies": [{"body": "Best I can tell he’s bent over and grabbing his ankles", "score": 342, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 38, "replies": []}]}, {"body": "It was a 175c that expired slightly itm and got assigned because I didn’t think it would exercise.\n\nRight now it’s like schrodingers loss, but if market trends and my track record are indicative of anything it’s gonna be a dead cat when we open the box Monday morning.\n\nBasically a $40 lotto ticket turned into an $18,000 obligation because I’m an idiot.", "score": 131, "replies": [{"body": "You should probably learn the basics of options before you trade more of them.", "score": 77, "replies": [{"body": "I thought i was a genius when i found credit spreads and iron condors years ago and started printing money. Never been fucked more violently when an iron condor position blew my entire account up going all in on apple.", "score": 45, "replies": []}, {"body": "It sounds like OP was pretty well aware of what he was doing.", "score": 2, "replies": []}, {"body": "Is this required? I don't know the basics and no disaster so far (no gains either)", "score": 1, "replies": []}]}, {"body": "Still don’t completely understand. Were you writing and forgot to buy to close or did you buy a call and let it expire with a margin account.", "score": 21, "replies": [{"body": "Sounds like he let the call expire and forgot he was using an account with margin, so it exercised.", "score": 44, "replies": [{"body": "So correct me if I’m wrong but brokers exercise it if it’s in the money so it got exercised at expiration and then stock tanks after hours? Am regard", "score": 18, "replies": [{"body": "Pin risk, I believe it’s called", "score": 14, "replies": []}, {"body": "Basically", "score": 3, "replies": []}]}]}]}, {"body": "Insert sad tik tok song", "score": 6, "replies": []}, {"body": "Your broker automatically exercised your calls because they were in the money at expiration. All brokers will do this. You only get \"assigned\" when you are short an option.\n\n\nYou need to sell these shares asap. If AMZN gaps up Monday you will make a ton of money because you are in essence extremely leveraged right now. And of course the opposite could occur...", "score": 9, "replies": []}, {"body": "So as a new regard, how do I prevent this? Switch to a cash account instead of margin?", "score": 3, "replies": [{"body": "Don't hold your options to expiration, especially if they are in the money.", "score": 6, "replies": [{"body": "Should I always sell my options before it expired?", "score": 2, "replies": []}, {"body": "So that means selling on day of expiration? Or buying longer time frame options and selling much earlier than last day? Or no real difference?", "score": 2, "replies": [{"body": "Technically, options expire on Saturday. Just sell them before 4pm EST on Friday", "score": 4, "replies": []}, {"body": "Yes", "score": 2, "replies": []}]}]}, {"body": "You can disable margin in margin accounts", "score": 3, "replies": [{"body": "Thanks, it was the next setting down lol. Its disabled.", "score": 3, "replies": []}]}, {"body": "And don't let your options expire in the money, even if it's by 1 penny... well unless you want the stock.", "score": 2, "replies": []}]}, {"body": "You’ll turn it around. Keep head up!", "score": 2, "replies": []}, {"body": "But will the dead cat bounce?", "score": 1, "replies": []}]}]}, {"body": "Somebody pls explain me like child why this gentleman account with negative cash balance. ![img](emote|t5_2th52|4275)", "score": 16, "replies": [{"body": "I'll try. He paid for the right to buy 100 shares at $175 and didn't have enough money in his account to pay. So the broker loaned him the money using his other stocks as collateral. \nIf none of this makes sense to you, then this sub is useless to you.", "score": 44, "replies": [{"body": "No pretty sure the broker gave him the shares. All they have to do is sell back the shares or deposit money to make even. This isn't a real loss.\n\nEdit: Shows they have 120 shares so likely they had 20 to begin with. They just need to sell the 100 back on open market Monday and account will be even minus any change in stock price or daily interest fees", "score": 6, "replies": []}, {"body": "You’re genius!", "score": 5, "replies": []}]}]}, {"body": "Proud of you! You belong here", "score": 15, "replies": []}, {"body": "Sell calls on it Monday and make a little cash while you're waiting for it to go up. You should be able to dump it in a few weeks. As long as the bottom doesn't fall out, you'll be fine.", "score": 9, "replies": [{"body": "He could just sell the stock instead of collecting a few hundred bucks premium on a 143% portfolio position…he didn’t lose money yet.", "score": 4, "replies": []}]}, {"body": "At least it's AMZN. It's not going anywhere. Solid company, better intermediate-term outlook than GOOG or AAPL IMO.", "score": 6, "replies": []}, {"body": "This exact thing happened to me a while back and I ended up with a basis well under 100, just hold onto them if you can", "score": 18, "replies": []}, {"body": "Classic WSB shïț 🦧", "score": 8, "replies": []}, {"body": "Tuesday is going to be bloody. Hedge your new found shares with SPY PUTS", "score": 9, "replies": [{"body": "Why Tuesday?", "score": 1, "replies": [{"body": "CPI report\n\nhttps://www.marketwatch.com/economy-politics/calendar", "score": 10, "replies": [{"body": "Thanks and you think it’s coming in low/bearish? I don’t know anything about any of this.", "score": 3, "replies": [{"body": "I know if it's not within anticipated constraints is probably going to be really bad for the street, which is looking for any excuse to sell off this explosive rally. If it's really good, it will be unbelievable. If it's not really good, it will be terrible.", "score": 6, "replies": [{"body": "I mean you say that but we have had a lot of hot data recently and continue to break highs. The market is not rational at all", "score": 2, "replies": [{"body": "I'm basing my thoughts from of how the market reacted at the last CPI report (past behavior indicative of future behavior), the ideal that we're approaching the season of year selling occurs, the all time highs in tech, and that I don't think Fridays little sell-off was the healthy correction the market needed to continue upwards \"yet.\" My gut feeling is either Tuesday or Thursday is going to be a big pullback due to less positive than anticipated CPI or PPI report. I think the street is looking for any excuse to take profits until they can buy back lower. \n\nMy strategy is going to be a $505 SPY 3/15 put. I may hedge it with a 0dte Tuesday call, too (I've been wrong before).\n\nMy question:   are we in a bubble or simply irrational exuberance/ FOMO?", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Yikes... well that pretty much why I absolutely dont fuck with writing them. If I'll write them one day that would be when I've them in hands and be upset being called but that's it", "score": 3, "replies": []}, {"body": "What app is this please?", "score": 3, "replies": [{"body": "Looks like interactive broker (ibkr)", "score": 3, "replies": []}]}, {"body": "Notice this Canadian with numbers in Canadian dollars.  I am proud of you for using Interactive Broker instead of shit like wealth Simple.  You may luck out with CPI number this week.", "score": 3, "replies": [{"body": "lol nope, just an American that wanted in on the big helium news. Ticker is too low market cap to mention here but it ain’t hard to find", "score": 2, "replies": []}]}, {"body": "Someone somewhere rn “lol a regard actually took this shit”", "score": 2, "replies": []}, {"body": "You will pay only+-5$ a day of interest on it. I say you can afford to keep it and sell CC. Even if it drops you are only 1.4X leveraged. Ibkr allows me to go 7X so this will almost never go into margin call especially since it's Amazon. \nKeep calm, sell CC and you are good to go. Even 1$ move will cover most of you margin expenses. I doubt Amazon will drop significantly anyway", "score": 2, "replies": []}, {"body": "Tbh this isn’t horrible, just pray CPI isn’t too hot", "score": 2, "replies": []}, {"body": "Well did you keep the shares because you should be up $400 if you did right now.", "score": 2, "replies": [{"body": "I did! Made about 400 and closed out a 175c that went all over the place for another hundred too. \n\nHolding through CPI on the absolute brink of my margin (IBKR doesn’t call you they just liquidate) was pretty tense but it worked out good.", "score": 1, "replies": []}]}, {"body": "Just sell them pm and your good", "score": 1, "replies": []}, {"body": "Best regards.", "score": 1, "replies": []}, {"body": "All trades are final 🥳", "score": 1, "replies": []}, {"body": "What app is this, if u don’t mind sharing?", "score": 1, "replies": []}, {"body": "Wym forgot ?", "score": 1, "replies": []}, {"body": "Write covered calls on it.", "score": 1, "replies": []}, {"body": "![img](avatar_exp|166207036|clown)", "score": 1, "replies": []}, {"body": "So sell the shares?", "score": 1, "replies": []}, {"body": "What app is this??", "score": 1, "replies": []}, {"body": "M mm mmm l mmm", "score": 1, "replies": []}]}
