{"title": "Just an observation here ... SPX vs. VIX over the past year", "selftext": "", "id": "2wd3g5", "created_utc": 1424298907.0, "score": 25, "upvote_ratio": 0.94, "num_comments": 20, "comments": [{"body": "I'm not sure if you can conclude much from such a short time period which encompasses the end of QE.", "score": 3, "replies": [{"body": "looks the same since 1990", "score": 2, "replies": []}]}, {"body": "what's up redditors of the stock market subreddit! it has been long a while ... hope you all have been doing well!\n\njust getting back in the saddle here after about a week off vacationing down in sunny warm south florida\n\ni have not been paying much attention to the markets over the past few weeks, but just now getting myself back into the action here\n\nnow before i begin here, let me make clear that i'm not one to make a big deal about divergences and what not, but this was just something that was glaring at me as i was checking up on the charts for the first time in a few weeks today and thought to point it out on here\n\nanyone notice while the spx is setting fresh record highs here, the vix is not anywhere near the recent lows (or at least the lows from last summer anyway...)\n\nthe last couple of trips the spx has set a new high the vix has settled at a higher low ... kind of a divergence there, no?\n\nalso- while i'm at it with pointing out divergences ... anyone else notice that while the spx has proceeded to take out the 2014 highs, the transportation average which i like to monitor a lot to gauge the strength of the rally is nowhere near the 2014 high, and the djia is just now coming into the 2014 high\n\n* chart --> http://i.imgur.com/gWskv3z.png\n\ni guess if there is one thing that the bulls can certainly hang their hat on in this particular run back to new highs is that the small caps (russell 2000) has finally joined in on these new highs, and looks to be leading the charge as well as the nasdaq which is very much encouraging to see\n\nagain, these are just a few observations i'm noticing here, and just thought it was worth sharing on here, it may something worth keeping an eye on, or nothing at all, and the markets go on to proceed to the next leg higher\n\nwe shall see\n\nthere's no denying that this has once again been another very impressive run for the markets off of those lows ... right back into uncharted territory ... yowza!\n", "score": 6, "replies": [{"body": "This is a well known correlation. \n\nThere is no easy way to profit from this.", "score": 1, "replies": []}, {"body": "Just a heads up, the word \"it's\" is not used to show possession.", "score": -2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "A contraction **is** a word.  Go back to school.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Feel a little better now that you got that off your chest big guy?", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Ha ha I've afforded a lot of it so far, and you deleting your comments shows just how stupid you realize you sounded making them :-)", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Feel better?", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Obviously the VIX spikes in quick, down markets. Investors don't know whether the rout will continue or stocks will return to their stable levels. Therefore IV increases on options-- some people trying to hedge against further losses and some trying to speculate and make a quick buck when the upward trend returns. SPX reaching highs will not result in VIX reaching new lows.\n\nIMO the VIX from more than 6 months ago is a useless metric. Quick trivia question: what is the unit of the vix index?", "score": 3, "replies": [{"body": "> IMO the VIX from more than 6 months ago is a useless metric. Quick trivia question: what is the unit of the vix index?\n\nIt's an expectation of volatility, which is expressed in standard deviation or percentage terms. Why is it useless to look at past VIX values?", "score": 3, "replies": [{"body": "Actually it is unitless. It's not % or %/day. A VIX of 10 vs a VIX of 25 tells us nothing about the heath of the market, it only matters in comparison to recent values. ", "score": -1, "replies": [{"body": "> A VIX of 10 vs a VIX of 25 tells us nothing about the heath of the market, it only matters in comparison to recent values.\n\nmmmmm I don't think so. VIX ÷ 100 is the pct (annualized) volatility the market expects over the next 30 days on SPX. The VIX spot we see every day is a time weighted average (of 30 days) of the expected variances of near term and next term options. So VIX÷100 is the sqrt(variance) expected over 30 days. It's not a coincidence that the VIX number is also the fair strike for a variance swap on SPX.\n\n\nSo, yes, a market where the VIX is 25 is a market where people expect more volatility than a market with VIX at 10. They are comparable over the whole life of post-2003 VIX.", "score": 2, "replies": [{"body": "Cocksmack that fuck", "score": 1, "replies": []}]}]}]}]}, {"body": "This time period is much too short. Please look since VIX was introduced and let us know what you find.", "score": 1, "replies": [{"body": "r-squared of about 44% since 1990", "score": 3, "replies": []}]}, {"body": " Hey man. Great post. What program are you using?", "score": 1, "replies": [{"body": "TOS", "score": 1, "replies": []}]}, {"body": "It's no secret that volatility rises as prices fall; this is generally attributed to the reality that prices fall much faster than they rise.  Prices almost always grind higher while occasionally \"plunging,\" \"plummeting,\" or \"crashing\" lower.  There's not much to be garnered from this observation other than to confirm this behavior.", "score": 1, "replies": []}, {"body": "my take right now is if the VIX breaks back below 14, the market rally can/will continue -- last blip down on VIX and market rally, it stopped right around there and things reversed", "score": 1, "replies": []}]}
