{"title": "Apple is making its first Android app", "selftext": "", "id": "2uv2ln", "created_utc": 1423136552.0, "score": 28, "upvote_ratio": 0.91, "num_comments": 26, "comments": [{"body": "This is actually big news, IMO. Not so much this app but that Apple would ever consider developing software for a non-Apple platform.\n\nThe next few years of technology is going to be interesting.", "score": 8, "replies": [{"body": "iTunes, Safari, iCloud software, Airport Control Software are all available on windows...\nOne major reason that the iPod was successful was windows compatibility and Apple knows that.", "score": 7, "replies": [{"body": "Don't forget QuickTime!\n\nAnd people forget that Apple open sourced the browser engine they developed for Safari, aka WebKit, and it now runs Chrome.", "score": 2, "replies": [{"body": "\nWebKit was mainly WebCore and JavaScriptCore. The two were forks of the LGPL KHTML and KJS.\nOpen sourcing WebKit was mainly respecting the licence of the projects they forked from.", "score": 3, "replies": []}, {"body": "I wish I could forget QuickTime. as a long time windows user, quicktime on windows ( and itunes) turned me off apple products. I installed them when I got my first iPod. It was my last. Not because of the hardware ( which was very nice), but because of quicktime and itune.  ", "score": 2, "replies": [{"body": "QuickTime was a weird situation where it worked pretty darn well on Macs and was absolutely horrific on Windows.\n\niTunes for Windows is pretty bad too :/  Apple didn't respect normal Windows UI convention and performance was pretty bad.", "score": 2, "replies": []}]}]}, {"body": "This is true. They did t even have Intel chips going for them at that time. Without windows the iPod would have died before the second gen. ", "score": 1, "replies": []}, {"body": "Apple Pay needs to come to Android. ", "score": 0, "replies": [{"body": "why? we have google wallet, which is literally the same thing", "score": 3, "replies": [{"body": "Well, except that banks agree to allow Apple Pay usage without showing ID.  But that can't come to Android without additional hardware.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "the front end UI's are different, ok. you dont select a picture of a card, but you can still select between multiple cards for payment. wallet also uses a PIN configured to be asked everytime, or every x minutes versus apple which uses a fingerprint. both are inherently insecure. i will treat this for comparison's sake as the same. \n\nthe back end's are similar. they both use a form of tokens to actually pay so your credit card information isnt passed to the retailer. the only difference is that google's tokens exist in the cloud instead of being generated on the device. something that google changed to avoid being blocked out by carriers implementing ISIS/Softcard. i will treat this as different, but they are almost the same.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "youre right. there is definitely a difference in UX but thats there for security purposes. if you wanted, you can enable NFC while the screen is off and turn off the PIN required for google wallet. you would simply then tap and pay wherever you go. unfortunately, as you know, android, outside of the upcoming galaxy S6 has no fingerprint sensor like an iphone so it has to be a more obtrusive.\n\nas for the back end. you're wrong. they do know, they just choose not to store it at the moment. apple pay has a hand in processing the actual payments at time of purchase, therefore they know exactly what time, where, and what location you made purchases at. same goes for google, albeit, google is more inclined to use this data for marketing as it is their bread and butter business. both services will never know what you bought as its not possible to transmit itemized information for in-store purchases", "score": 3, "replies": [{"body": "I think a lot of it is that Google Wallet came out too early and just seems to not have caught on here in the US.  I can't speak for more interesting markets though, like Africa and Asia, where tech leapfrogging would be most likely to occur. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It's impossible for Apple Pay to come to Android because of the lack of Touch ID.  Apple actually has specialized hardware to store your fingerprint token/security in a way that is not accessible by the OS.\n\nThe arrangement Apple has with the payment providers is that they will insure Apple Pay purchases without needing ID because of that additional layer of security.  Technically, Google Wallet requires you to show ID, it's just that a lot of stores don't enforce that.", "score": 0, "replies": [{"body": "Wow. If that's the case, then I'd say it's quite short-sided of them.  For payment systems to catch on, you need volume. Overlooking huge markets where Android is king, like Asia and Africa, seems like a mistake to me. ", "score": 1, "replies": [{"body": "Apple Pay is going to be iOS only.\n\nHowever, I don't think it's particularly short-sighted; it uses the same *receiving* hardware as Google Wallet, so I should be able to make purchases at any station that supports NFC payments.  All that matters is that I have an iPhone and my sending bank supports Apple Pay.  The receiver doesn't matter.\n\nSo yes, Apple Pay will be limited to iPhone users only, but iPhone users shouldn't be excluded from anything in other countries.", "score": 1, "replies": [{"body": "But doesn't Apple make some money on each transaction?", "score": 1, "replies": [{"body": "Like 0.15%.  A fifteen of one percent.  You have to spend $7 before Apple makes one cent on the transaction.\n\nApple Pay isn't nearly as lucrative as the actual phones it pushes and Apple ecosystem improvement.  It's probably barely covering it's own infrastructure.", "score": 2, "replies": [{"body": "Ok. But if you have a lot of volume, that's a decent chunk of change. Like Kenya with its money texting service. Why wouldn't Apple not want to have Apple Pay there, or in places where there are more cell phones than people? \n\nI also think eventually, Apple Pay would want to do its own thing without a middleman (Visa and MC in this case). You would want as many phones using the service. ", "score": 1, "replies": [{"body": "Because then the product would just be another Google Wallet.\n\nAnd further, because this wouldn't fall in to the general Apple design pattern.\n\nApple has never gone for market share.  They've gone for product value.  And it's saved the company a half dozen times over.\n\nApple became the only profitable PC company when PC margins dropped to zero, because they focused on making their computers do what they do best and maintaining their margins instead of slashing margins to attract the lowest common denominator.  Apple is almost the only profitable phone hardware company now as phone margins are dropping to zero, for the same reason.\n\nApple builds things to build their ecosystem to make it more appealing, not to capture a marketshare.  Lots of Apple products may have done well on their own, but as a whole, the ecosystem is what has turned Apple in to the most valuable company in the world.\n\n\nYou're thinking too much like a PC company.", "score": 2, "replies": [{"body": "Why would it be another Google Wallet? I think Wallet's issue was that it came out too early in the game - when Samsung phones and Android generally wasn't as big, and when iPhones didn't have NFC. \nAs for the Marketshare comment, the ipod wouldve been nothing without being Windows compatible. I see this as a similar issue. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "ib4 they to a better job than Google and actually follow ALL guidelines ", "score": 2, "replies": []}, {"body": "Give us Facetime for Android!", "score": 1, "replies": []}, {"body": "Thought I was on /r/nottheonion", "score": 1, "replies": []}, {"body": "Android for the win!!!!", "score": 1, "replies": []}, {"body": "In other news, Apple develops iTunes for Windows.", "score": 1, "replies": []}]}
{"title": "Ahh yeaaa AMD up up and away!!", "selftext": "[deleted]", "id": "2uvres", "created_utc": 1423152584.0, "score": 3, "upvote_ratio": 0.55, "num_comments": 21, "comments": [{"body": "lol nice man thats awesome ", "score": 4, "replies": []}, {"body": "Good on you for guessing \"black\" on this spin.\n", "score": 7, "replies": [{"body": "likely his first win, give him a break lol", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Anyone can say \"I have done so well on a stock\" even if they completely guessed. Reminds me of this game:\nhttp://casino4you.com/cart/images/R32.jpg", "score": 0, "replies": []}]}]}]}, {"body": "I'm in at $2.65.  Will it last? I hope so, but I've got a 5% trailing stop. But really, this one was a flyer, just a big kind of educated guess. What really set it off was an article in Barrons. \n\nThere is quite a bit of short interest. However, with a 11 day to short period... It'll be interesting to see what happens. Hopefully a giant short squeeze. ", "score": 2, "replies": [{"body": "like i said in a previous post.. with the addition of the nvida scandal and the new apu/cpu/gpu coming out soon amd will be 4 dollars by march other then that i have no idea ", "score": 1, "replies": [{"body": "I think it's still headed up for a while, but not as quickly as the last few days. They're hedging on making from desktop to mobile products. ", "score": 1, "replies": []}]}]}, {"body": "4K at 4.01. Holding for over a year. Should woulda coulda on buying at sub 2.50, oh well.\n\nBut, it's nice to feel some goodness from AMD this week!", "score": 2, "replies": []}, {"body": "In at 4.04 since last April... Maybe I should get out now and limit the damage.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I'm afraid it'll go back to the $2.40 range.", "score": 1, "replies": []}]}, {"body": "4.01 here and holding since around the same time last year. Hell, wish I had gotten some 2.50 stuff, but oh well.", "score": 1, "replies": [{"body": "It's been a scary ride...", "score": 2, "replies": [{"body": "Yessir.", "score": 1, "replies": []}]}]}, {"body": "amd is making serious changes this year with the firing of the ceo and what not i predict 4 dollars a share by march so we still got a long timee\n\nfor all we know this could be the year they go back to 8-10 a share", "score": 0, "replies": [{"body": "8-10 would be nice but I'm highly doubtful. We'd be lucky to break 4 IMO.\n\nI've been in AMD for a while now. ", "score": 2, "replies": []}, {"body": "My fear is that they fall back down to the $2.40 range. I do think that the CEO replacement worried many, but it seems as though Lisa Su is competent at the least.", "score": 2, "replies": []}]}]}, {"body": "Was in for a while @ 2.70. Here's hoping for 4.00.", "score": 1, "replies": []}, {"body": "I did the same bossman.  Good luck to you!", "score": 1, "replies": []}, {"body": "AMD CPU business isn't going anywhere but down. APU business isn't either until they have access to better processing nodes. Semi custom is doing good, but mainly because of the next gen consoles.  Once I see substantial semi custom business elsewhere, I'll be convinced. Graphics isn't doing too great. They are behind technologically as of now. I can see them coming out with a better series than their current one, and even nVidia, but then the price cuts come in and where does that leave AMD? ", "score": 0, "replies": [{"body": "The thing I always found interesting on the narrative for AMD was that, in the past, they were \"too important to fail.\"  There was a time where their bankruptcy would have left Intel in a position that would get every government watchdog on Earth knocking down their doors.\n\nI'm not sure if that's the case any more.  The mentality seems to be \"ARM is Intel's real challenge, not AMD\".  However, I suspect this is just trend-of-the-week fetishizing.  As much as people may fawn over mobile devices, Wintel computing is almost an omnipresent utility.  Intel is famously selling their Atom parts at a loss just to get them into phones/tablets/$99-computer-on-a-HDMI-stick devices which would otherwise run ARM chips on Android, but they're still selling a lot of unsexy desktops.\n\nAlthough Intel's mindshare in the high end is undeniable, AMD's products offer better value propositions for a lot of low-mid range products.  I'd rather have an A6 than a \"Pentium Dual-Core or Celeron\" in a $300 laptop.  Of course, again, unsexy to mention.\n\nDisclosure:  Own AMD and ARMH.", "score": 1, "replies": []}]}]}
