{"title": "How much money is needed for selling calls to be worth it?", "selftext": "Title. For instance, I bought 2 $MSFT LEAPS. I could technically sell 2 PMCC's against it. To be safe, I'd go about 30-45 days out and pick a strike that's about 10% over the current price. Price is currently 310, there are earnings in a week or so, and the call I'd sell is the 340 (9.5% above current). But it just doesn't seem... worth it? That's about 500 bucks in profit which sounds awesome until you realize it's just 4% of the 12,000 I paid for on those 2 calls. I'm certainly not \"too good\" for money no matter how small it may be, but it just doesn't seem like the risks outweigh the benefits. I'm kinda new to selling calls so I don't mean my question to sound stupid, but am I missing something obvious here? \n\nWhat's the better/safer way to go about this? Do I go even further OTM and pick up smaller amounts of premiums to have a higher chance of not getting my call sold? Any advice is welcome.", "id": "s6gua8", "created_utc": 1642458387.0, "score": 27, "upvote_ratio": 0.82, "num_comments": 72, "comments": [{"body": "It's 4% that you'll be able to repeat 8-12x a year, for ~48% profit if all goes well", "score": 44, "replies": [{"body": "Taxes people. Taxes", "score": -53, "replies": [{"body": "[deleted]", "score": 33, "replies": [{"body": "Most people get to deduct $3500 a year in losses lol", "score": 13, "replies": [{"body": "Most people here* 😔", "score": 11, "replies": []}]}, {"body": "I’ve never heard anyone talk about how their risk profile changes knowing they’re going to pay 30-40% of their profit out.  Yes of course you need to consider taxes, they eat a shitload of your profit.", "score": -2, "replies": [{"body": "So, what’s the answer?  NOT to trade and make money??", "score": 14, "replies": [{"body": "Clearly the answer is to LOSE money and write off the losses!", "score": 7, "replies": [{"body": "Oh!  I’ve been doing it all wrong!   I make good money and pay my taxes but do whatever I want with the rest . . .", "score": 5, "replies": []}, {"body": "That turned out to be my plan last year. Got like 5 years of taxes write offs ready", "score": 1, "replies": []}]}, {"body": "Quit your job to avoid income taxes!!", "score": 3, "replies": [{"body": "That is one way!", "score": 1, "replies": []}]}]}]}, {"body": "It’s not implied at all. People think getting 12% a year with theta strategies is beating the market. But it’s obviously not after tax. Not even close", "score": -1, "replies": []}]}, {"body": "Taxes never bothered me because that means I made a profit. Would you rather not have gains to pay taxes on?", "score": 9, "replies": [{"body": "Again, they simply exist to adjust your risk profile. That was the point of the original comment.  They can potentially dissuade you from making a trade that would otherwise appear appealing.  You’re not investing correctly until you factor the governments cut.", "score": -9, "replies": [{"body": "well this is the dumbest thing I ever read", "score": 4, "replies": []}, {"body": "Everyone here is downvoting, but I love to nerd out about personal finance. \n\nTaxes should always be taken into consideration when evaluating your risk profile. \n\nTaking a particular risk may be worth $50 to you, but not worth $30. \n\nKeep on speaking up. Even if 10 people don’t agree with you, your advice may strike a chord with the eleventh.", "score": 2, "replies": []}]}]}, {"body": "\"Good news, Johnson. You're finally getting that raise you deserve.\"\n\"No thanks boss. That means more taxes.\"", "score": 7, "replies": [{"body": "1000% this. If you are paying more in taxes it means you are making more money. Why would that be considered a bad thing?", "score": 3, "replies": []}]}, {"body": "Avoid wins and avoid taxes. Totally!!!", "score": 3, "replies": []}]}]}, {"body": "You don't do a PMCC for the premium.  The premium is an added bonus and hedges against a pull back so you don't lose your ass on the leap.  The goal of a PMCC is for the stock to go up AND collect the premium.\n\nFor example, you are going to be in a great spot if Microsoft goes to 350+ over the next year and you collect $500/mo.  It will be absolutely ridiculous if it pushes 400.\n\nOn the other side, if Microsoft pulls back to 250 (and doesn't recover) your leap will take a massive hit.  The $500/mo (it would be less as the stock pulls back) will go a long ways to cancel out loss of the leap.  You could even pull out a profit in this case.\n\nPMCC do not come without risk.  It allows you to use stocks that you don't have the capital to buy shares and gives you the potential for a massive return.  It still revolves are picking a solid company that you think you will go up.  \n\nPersonally, I think you are in a great spot if you bought your leap when it pulled back to approximately $305.", "score": 17, "replies": []}, {"body": "FYI that’s 4% on top of the 10% appreciation that would be needed to have your covered call go ITM. So really you’d have to see a 14% increase in the underlying stock before you’d be “missing out” on gain. \n\nAlso as others have said, annualized that can add up to some pretty hefty premium if they don’t get called away and also if they do get called away it’s icing on the cake. Your thesis should be “I’m selling a covered call at this strike price because that would exceed my expectations on the underlying stock’s performance during that shortened time period and would want to take profits anyways”. Eg if a company like MSFT goes up 14% in a month you think it probably won’t be sustainable or would pull back so you sell the covered call for premium and for giving your trade a well defined exit point in the given time frame", "score": 12, "replies": []}, {"body": "4% during the relatively short life of the sold options contracts is nothing to sneeze at. If you annualize the rate, I'm sure it's 35%+.", "score": 6, "replies": []}, {"body": "Selling covered calls is a trade off for current profit vs potential later profit. By selling a call you get 4% now with up to 10% upside. By not selling a call, you get all the upside, but you get nothing if MSFT trades flat or down and just money to theta decay.\n\nIf your goal is to actively grow your NLV, you want to sell as many calls as you can so that you have a consistent growth which you can rely on. The alternative is to just leave the LEAPS and have MSFT do its thing. MSFT could go +20%, -5% or trade flat for a month. The question is, do you want to generate active growth, or passive growth.\n\nMy personal approach is to sell 3x weekly, weekly, and monthly calls on all my positions. I can manage my growth without 100% reliance on the stock movement to build my portfolio. If SPY chooses to whipsaw between 460-470 for a month, I'll make a bunch of money as I aggressively sell calls. If SPY runs away to 490, I still make money, and if crashes to 440, I lose less money.", "score": 3, "replies": []}, {"body": "That's up to you what is worth it. I do 30-45 DTEs at around 25 to 30 delta for around 5 to 10% profit on the pmcc. This goes by waiting at least 2 or 3 days to do a good green day on each sell. If I have to a still sell on day 3.", "score": 3, "replies": []}, {"body": "I have two MSFT LEAPS (2023 and 2024) and am selling ATM for the shorts, weeklies but currently on the 1/28 expiry $310 and $320. will roll up and out as necessary… generally just trying to maintain the same positive delta I started the PMCC with. I want the short on all the time as some downside protection.   \n\nI prefer weeklies/near dated for CCs as it gives the flexibility of being able to roll up and out in the style similar to u/raiddinn1 however for my short puts I prefer to go 45+ DTE.", "score": 3, "replies": [{"body": "Does u/raiddinn1 summarize their style on any of their posts? Just curious to compare what others are doing with what I’m working through.", "score": 1, "replies": [{"body": "u/Wide-Stop4391 did a pretty good job.\n\nI write CC/PMCC on stuff I expect will move upwards.  I usually write at 12 DTEs, and roll back to 12 once DTEs get down to 5.\n\nI like to try to keep my strikes as close to ATM as I can, for the most negative delta.  Helps stabilize my account values.", "score": 4, "replies": []}]}]}, {"body": "No position should use more than 4% of your total net liquidation. So take the buying power needed for 1 call and multiply it by 25 to get the account size appropriate for trading said call.  \n  \n4% allocation per a position is one of the best rules for not blowing up your account.", "score": 4, "replies": []}, {"body": "The fact that you're even asking this question suggests you're probably in over your head. Regardless, to recap the previous answers, assuming you set the trade correctly in terms of delta, i.e., long 80, short 30, you collect the premium from the CCs as well as the rise in the value of the LEAPs overtime. MSFT is actually a very solid choice given it's current P/E ratio and buyback program. Just don't get greedy with the short call premium.", "score": 3, "replies": [{"body": "U/sorengard123 do you focus on 30-45 DTE or weekly or does it depend on the underlying?", "score": 1, "replies": [{"body": "Currently writing weekly naked puts at the 10 delta on MSFT and GOOG. I know that's school girl level of risk for most on this forum but those are two great names that are getting close to fair value on a P/E basis and I have no intention of posting loss porn.", "score": 3, "replies": []}]}]}, {"body": "Sell weeklies. Do the math, it's way more profitable", "score": 1, "replies": [{"body": "I just did the math and it's way less profitable. The premiums for weeklies are way smaller than 30-45 DTE calls. $500 premium on 30 DTE calls vs $50 for weekly call x 4 weeks = $200. It's about 40% of the profit I would make with the longer expiration calls. Am I missing something? Please fill me in If I am.", "score": 10, "replies": [{"body": "Normally when people pick the 30-45dte they are cashing in at half DTE left and don't let it ride out the whole time. I just assumed you were doing that too.\n\nIn that case you don't get  the bigger theta burn of the last two weeks so you end up with less than 60% of what you could have had.\n\nAlso, by doing weeklies, you have way less commitment on time at that strike, so you get to adjust strikes every week and dial it in rather than waiting it out long term or worse rolling.", "score": 3, "replies": []}, {"body": "You are using too high a strike on the weeklies. The strike will be closer to atm knowing it is only for a week or so. Weeklies will be higher that 30 dte but gamma is a bigger risk.\n\nAlso going into earning with MSFT 9.5% is pretty far otm I doubt it jumps more than 3 to 5% max.", "score": 3, "replies": []}, {"body": "[removed]", "score": 4, "replies": [{"body": "Weeklies is a trap.. looks good on paper, but drastically increase the risk that your call will be ITM, and risk exercise. The only answer is the 30-45 DTE, immediate set a buy at 50% and hope that it triggers at the half way mark. That's what I do with QQQ, SPY and XLF. Also, I do not advice to sell covered calls on all stocks, some are volatile and best left for vertical spreads.", "score": 5, "replies": [{"body": "Yeah getting 100 bucks a week selling weeklies is sweet until the underlying tanks 5%. That 100 bucks is not nearly enough to cover losses on the leap. Then you’re just playing catch up", "score": 3, "replies": [{"body": "Cries in NEGG", "score": 2, "replies": []}]}]}]}, {"body": "Microsoft was 342 a couple weeks back FYI, if you sell your strike at 340 you may find it gets breached in the next few days seeing as how we’re heading into earnings and Microsoft is expected to have a very strong quarter. If Microsoft continues to rip from there, which although slightly improbable is far from impossible, it’s going to be very painful for you to have to buy back your short once it gets breached. Just something to keep in mind. If I were you I would sit on the leap for the moment and see where Microsoft is a couple weeks from now before selling any calls on it.", "score": 1, "replies": []}, {"body": "OP you might want to check earnings date on the underlying----  I think that 30 DTE runs past an earnings call  so the IV will be inflated. the premium seems a little high", "score": 1, "replies": []}]}]}, {"body": "Frankly I think this is always the riskiest way to sell PMCC. IMO, If you’re going to do it, sell at the same expiration as your ITM call. Then find the strike that you’re comfortable to cap your profits at in the event of a run. By doing this you also create substantial downside protection in the event of a drawdown/crash. There’s also far less management of your PMCC. \n\nMy 2 cents anyway", "score": -1, "replies": [{"body": "you are not describing a PMCC...this is a vertical LEAP spread. A PMCC is by definition a diagonal call where your short leg has a closer expiration than your long leg.", "score": 6, "replies": [{"body": "Disagree. A PMCC is defined by the writing of a call without the requirement of owning the underlying stock. How you write those calls is yours to debate.", "score": -6, "replies": [{"body": "You can disagree but you are not using the proper terminology. A PMCC is a diagonal spread. If you open a vertical spread it is not, by nature, a PMCC. Definitions of a PMCC:\n\n[https://www.tastytrade.com/concepts-strategies/poor-man-covered-call](https://www.tastytrade.com/concepts-strategies/poor-man-covered-call)\n\n\"A \"Poor Man’s Covered Call\" is a Long Call Diagonal Debit Spread that is used to replicate a Covered Call position.\"\n\nEDIT: Also, a 1 year DTE vertical spread is a pretty bad idea from a capital management point of view. You have huge exposure, and much less theta profit, resulting in a net risk gain and loss in returns.", "score": 3, "replies": []}, {"body": "You are completely wrong here. A \"spread\" is defined by the writing of a call without the requirement of owning the underlying stock. You are describing a spread not a PMCC. There are tons of types of spreads, and you are describing a long dated vertical spread.", "score": 1, "replies": [{"body": "Lol. Right ok. So what you’re describing isn’t a diagonal call spread at all right? This sub is so far up it’s own ass it’s amazing.", "score": -5, "replies": [{"body": "Vertical spreads are not diagonal spreads no. Both may be spreads, but they are different in that vertical spreads have the same expiration date but different strikes, and diagonal spreads have both different expiration dates and different strikes. \n\nA PMCC is a diagonal spread. Like all PMCCs are diagonal spreads the same way all sourdough bread is bread. It is a specific type of diagonal spread. \n\nIf your expiration date is the same on your short leg and long leg then that is a vertical spread and thus can not be a diagonal spread and thus can not be a PMCC. \n\nIf you prefer vertical spreads awesome, do your vertical spreads. But don't call it a PMCC. It is like calling a traffic cone a polar bear just because you want to.", "score": 2, "replies": []}]}]}]}]}, {"body": "That’s just a long-dated vertical call spread", "score": 4, "replies": [{"body": "And the other a diagonal. I mean what are you arguing? The point is what is the best way to sell a PMCC. Imo it is as I described - if you’re going to do it at all.", "score": 0, "replies": [{"body": "A PMCC is by definition a diagonal call. Your expiration dates are by definition different. They have to be different for it to be a PMCC. If you have the same expiration dates then it is not a PMCC.", "score": 2, "replies": []}, {"body": "What wolfhound said. It doesn’t mean it isn’t a good strategy though.", "score": 1, "replies": []}, {"body": "PMCC by definition is a diagonal call debit spread not long dated vertical spread. So i think what he is trying to say is that if someone were to sell PMCC as you have described then it wouldnt be PMCC anymore.", "score": 1, "replies": []}]}]}, {"body": "Sorry, a little slow here (and new to PMCCs). You suggest buying and selling a LEAP and the downside protection is the premium from the  LEAP you sold?", "score": 1, "replies": [{"body": "Yep.", "score": 2, "replies": []}]}, {"body": "This. Vertical call spread leaps are better than PMCC. Good for V-shaped play too.", "score": 1, "replies": []}]}, {"body": "There is always a chance the call will get sold, you ready to take that plunge and buy 305X200:around 600k if you need to cover? Then dont sell calls not looking to get assigned, premium wont really be worth it anyway", "score": 0, "replies": []}, {"body": "10% 30-45 days out for Microsoft doesn't work well. Look at the chart from the last 3-4 months. You run a high chance of getting your shares (or LEAPS) called away", "score": 1, "replies": [{"body": "I agree 100%, which is why I said the risk doesn't seem to be worth it. What DTE and % above a stock should I be looking for typically? You can use $MSFT for this example.", "score": 3, "replies": [{"body": "Well, Microsoft seems to want to climb up every time the market conditions get positive, so I would either switch to shorter calls for easier management or sell your calls farther above. LEAPS can be tricky because you don’t want them assigned so early in the process", "score": 1, "replies": []}]}]}, {"body": "4%\\*12 = 48% that is pretty darn awesome on an annualized basis. even if you only sell 8 calls a year that is still 36%. When average returns are 7-12%? Also don't forget that you have the capital appreciation in there. \n\nOnly edit I would suggest is using delta not % OTM. 340 for 02/18/2022 has a delta of 15.32 which is pretty good for a stock with an IV of 27.\n\nFinally, don't think about it as a higher chance of not getting your calls sold, but instead as a max profit event on your trade. You are getting paid the equivalent of 48% APY to put a cap on your max profit. If you start getting worried about your calls getting sold you'll make bad decisions and turn a profit into a loss. Just sell the calls and the short call together and buy new LEAPS.", "score": 1, "replies": []}, {"body": "Easy, sell ATM for one of them. If MSFT surges back to $350, you still have the upside. If neutral or drop, you will be doing better.", "score": 1, "replies": []}, {"body": "Still learning about pmcc. So what happens the cc becomes itm and gets called but you only have the option contract and not physical shares?", "score": 1, "replies": [{"body": "Then you get the money from the CC and use it to exercise your LEAP. You end up losing the extrinsic value of your LEAP. \n\nCrunch the numbers. It is worth it to buy back the CC and sell your LEAP.", "score": 1, "replies": []}]}, {"body": "If your assumption MSFT is going to go straight up, yes selling calls would be dumb.  Selling calls on the leaps is a good idea if you want to hedge theta, reduce basis, don't have a crystal ball.  Ask yourself why is someone paying you a premium for a call and why would you sell it.  buying an OTM call is a directional bet that is low POP but large return on capital if you get the move, so selling a call you are trading the away the large unexpected move for an increase in your POP.", "score": 1, "replies": []}, {"body": "$5,000", "score": 1, "replies": []}, {"body": "Something to consider is the spike in IV right before earnings. Maybe see what happens to your call in the next week. Very often calls spike in IV right before the earnings release. Selling calls a week from earnings is pretty risky.", "score": 1, "replies": []}, {"body": "Do the diagonal on something that isn’t one directional like telecom for example.", "score": 1, "replies": []}, {"body": "Not sure what kind of profit you expect to make.  Diagonal call spreads can make 10-15% in one month, sometimes more with volatile ones.  MSFT is not volatile though.   \n\nYou have to do the math to determine if the “risk” is worth the “reward”.  For some it is, for others it isn’t.", "score": 1, "replies": []}, {"body": "That's 4% gain...plus the profit of what you make on the underlying moving up 10% in 30-45 days...", "score": 1, "replies": []}, {"body": "I have a question about selling CC while owning LEAPs - since you don’t actually own the shares, if your CC gets exercised, are you then forced to exercise your LEAP? Even if your LEAP was priced lower than the CC and you make a profit exercising the LEAP to cover the call, don’t you lose all that money you spent buying the LEAP?\n\nOr would you be short the shares and have the option to either buy to close or exercise the LEAP to close?\n\nI’m using Robinhood and don’t have short selling enabled.", "score": 1, "replies": []}]}
