{"title": "Be prepared for a bigger drop: CPI data release is next week", "selftext": "The coming week will include a very hot inflation report, the banks kicking off earnings season, US-Russia talks, and a bunch of Fed speak. Inflation is not letting up and will continue to make the Fed uneasy. On Wednesday, the headline year-over-year inflation reading is expected to rise from 6.8% to 7.1%, which is nearly a four-decade high. The last trading day of the week is filled with economic releases that should show a deceleration with retail sales, import price index, industrial production, and consumer sentiment.", "id": "rylp2u", "created_utc": 1641599444.0, "score": 120, "upvote_ratio": 0.9, "num_comments": 70, "comments": [{"body": "Got it that means buying more big tech stocks next week.", "score": 69, "replies": [{"body": "just don't get burnt timing it.", "score": 2, "replies": [{"body": "Can't get burned if your portfolio is already toast", "score": 8, "replies": []}]}, {"body": "I think you mean bank stocks like BAC, tech will keep selling off with all this rate rise talk and banks will thrive for the next month.", "score": 1, "replies": [{"body": "I think if you're looking at banks's right now, might be best to wait for a pullback. They already pumped before everyone started freaking out. Everything is still due for a dip", "score": 1, "replies": []}]}]}, {"body": "so time to buy? got it.", "score": 73, "replies": [{"body": "but when?", "score": 3, "replies": [{"body": "monday morning of course!\n\non cue it will be....\n\n\"i don't get it guys. \\[inflation\\] is \\[rising\\] but somehow we are hitting all time highs? this market is so irrational and propped up by mega cap tech. im done. i'm going to cash for a while.\"", "score": 22, "replies": []}, {"body": "Monday at 9:30 AM", "score": 3, "replies": []}]}]}, {"body": "Inflation will come back at 7% instead and spy will rip 3% up", "score": 33, "replies": [{"body": "more like 7.09% and SPY +5.1% in 2 days.", "score": 14, "replies": []}]}, {"body": "Priced in?", "score": 31, "replies": [{"body": "If things were always \"priced in\" the history of the stock market would be a lot less bumpy.", "score": 59, "replies": []}, {"body": "I mean OP posted a list of expected news, so I reckon if it's worse than that there'd be a bigger drop. Unless OP has secret information that no analyst out there can reach!", "score": 3, "replies": []}, {"body": "Depends if the inflation is higher then expected.", "score": 5, "replies": [{"body": "Jpow already said rates were going up sooner than expected right? Even if CPI is high shouldn't rate hikes already be priced in? \nI tried puts last FOMC meeting and got burned when it rallied right after. I'm scared to try the same play lol.", "score": 1, "replies": [{"body": "Nothing is certain atm that’s for sure. Lets watch how next week folds out.", "score": 5, "replies": []}, {"body": "No because until interes rates are not raised the price of previous bonds doesn't change", "score": 2, "replies": []}]}]}]}, {"body": "Highly doubt it will cause any meaningful dip.", "score": 25, "replies": [{"body": "RemindMe! 7 days", "score": 10, "replies": [{"body": "coke stock", "score": 4, "replies": []}, {"body": "I will be messaging you in 7 days on [**2022-01-15 02:55:26 UTC**](http://www.wolframalpha.com/input/?i=2022-01-15%2002:55:26%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/rylp2u/be_prepared_for_a_bigger_drop_cpi_data_release_is/hrq93xs/?context=3)\n\n[**22 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Frylp2u%2Fbe_prepared_for_a_bigger_drop_cpi_data_release_is%2Fhrq93xs%2F%5D%0A%0ARemindMe%21%202022-01-15%2002%3A55%3A26%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20rylp2u)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "lmao alright. Come back in 5/6 days.", "score": 1, "replies": [{"body": "Curious to see how next week unfolds. Don’t see. Much upside at the moment.", "score": 6, "replies": []}, {"body": "?", "score": 1, "replies": []}]}]}, {"body": "Let me get my crystal ball out of my ass….hold my toilet paper….", "score": 19, "replies": [{"body": "Al of these thing I’m stating are facts lol. I’m sure in your world everything goes up and is perfect and it stays forever there. I guess you proved yourself right, keep that crystal ball in your ass.", "score": -3, "replies": [{"body": "If they're all facts, why would they change anything? I thought unexpected things cause volatility, not guaranteed expected facts.", "score": 6, "replies": [{"body": "No I meant with facts as in these are things that are coming/ happening.", "score": 4, "replies": [{"body": "Doesn't change my question.", "score": 0, "replies": []}]}]}]}]}, {"body": "Jesus.....", "score": 11, "replies": []}, {"body": "Buy the dip! Not a financial advice.", "score": 12, "replies": [{"body": "What a fucking useless comment dude\n\n\nnOt a fInAnCiAl advIcE", "score": 3, "replies": [{"body": "Buy the dip bitch", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Damn right it's better than yours\nI can teach you, but I have to charge", "score": -2, "replies": []}]}]}]}, {"body": "The equity market is on the edge with the current developments. And with the TNX (10 year treasury yield) continuing climbing, the volatility should continue.\n\nOne scenario is where the equity market continues to pull back but without rapid movements downwards. The other scenario is where a catalyst hits that can cause panic selling and rapid equity markets movement downwards.\n\nThe FED may flip flop as they did before in 2013 and 2019. That approach may result in the first scenario. Depending on how much the FED flops, the pullback magnitude will be accordingly.\n\nNonetheless, if a catalyst hits at any point in the next month or two, the second scenario has a high chance of materializing.", "score": 7, "replies": [{"body": "Omnicron gives them a scapegoat to flip flop, and they'll take every scapegoat no matter what.\n\nIts almost as if they are working for the 1%, and they get called into their bosses office to get yelled at every time stocks drop a few percent, yet they still have to pretend like they are doing their job.", "score": 1, "replies": [{"body": "„˙ʇɐɥʍ ɹǝʇʇɐɯ ou ʇɐoƃǝdɐɔs ʎɹǝʌǝ ǝʞɐʇ ll,ʎǝɥʇ puɐ 'dolɟ dılɟ oʇ ʇɐoƃǝdɐɔs ɐ ɯǝɥʇ sǝʌıƃ uoɹɔıuɯO„", "score": 1, "replies": []}]}]}, {"body": "Chevron\n\nTarget \n\nFree-Mac\n\nTreating this clown right !!", "score": 6, "replies": []}, {"body": "Sweet as more bargains.", "score": 2, "replies": []}, {"body": "Any dip I will buy QQQ with joy", "score": 2, "replies": []}, {"body": "Buying the dip everyday with my DCA", "score": 2, "replies": []}, {"body": "Nothing is for certain right now. Let's see how things pan out next week..", "score": 2, "replies": []}, {"body": "I am preparing now. Thanks.", "score": 2, "replies": []}, {"body": "Let me set alerts. What's everyone's price targets?\n\nAaple 160? Msft 280? Fb 310? Nvda 225?", "score": 2, "replies": [{"body": "FB already down, but people don't like it. Probably somewhat safe. MSFT down but could go lower. Little less safe. NVDA who knows could drop 10% more", "score": 1, "replies": []}]}, {"body": "Mostly up then! Gotta reverse the sentiment here. Thank you!", "score": 2, "replies": []}, {"body": "This is true, would say give precious metals a shot. However that’s manipulated beyond comprehension.", "score": 7, "replies": []}, {"body": "Puts", "score": 4, "replies": []}, {"body": "I heard this tautology 30 years ago and thought it callow but it actually works:  buy after all the sellers have sold.  When there are no sellers left the volume of buyers will increase.  It is safe to buy again.  \n\nThis time period is the accepted end of a bull market and possibly the beginning of a bear market due to future fed actions.  The Nasdaq stocks have been correcting, that is, becoming rationally priced.  The major 11sectors of the market are rotating their dominance.  It usually causes a crescendo of selling, a wash out.  Buy back in to what you believe in that has profitability after the washout if you have sold to take profits or to limit losses.  Sometimes stocks recover quickly, sometimes they don’t.  At the end of a bull market short sellers are known to make a lot of money, then get killed when everyone is buying.", "score": 3, "replies": [{"body": "Buy low.... Sell high. Hold on let me get a pen...", "score": 8, "replies": [{"body": "Ironically a lot of people do the opposite", "score": 3, "replies": []}]}]}, {"body": "So my 200c aapl for the 22 is trash. Thanks Obama", "score": 2, "replies": []}, {"body": "Puts it is", "score": 1, "replies": []}, {"body": "Awesome work fed! Lets tank all the stocks, bankrupt any business not named Amazon, Apple, Google or Microsoft and just fucking be done with it. What's transitory will be the move from the market to the welfare line.", "score": -1, "replies": []}, {"body": "Lmao no such thing as dips any more stocks always go back up", "score": 1, "replies": []}, {"body": "I guarantee you inflation numbers will be lower for the month of December than they were for November. Inflations is lowering.", "score": 1, "replies": []}, {"body": "Be cool if that’s the case. Already short US Indicies. Be cool to add germany and EU to that list", "score": 1, "replies": []}, {"body": "I don't care what inflation is going to be, I want to know what the market is pricing....", "score": 1, "replies": []}]}
