{"title": "Microsoft beat on Revenue and Profits. On the other hand, Satya Nadella sold more than 815.000 Microsoft shares in a couple of days. 🤷‍♂️", "selftext": "", "id": "sd0imu", "created_utc": 1643182942.0, "score": 302, "upvote_ratio": 0.76, "num_comments": 79, "comments": [{"body": "Breaking news people take gains", "score": 169, "replies": [{"body": "He probably needed money to buy the dip", "score": 45, "replies": [{"body": "Maybe hair implants to look more human?", "score": 1, "replies": [{"body": "stay mad kid", "score": 2, "replies": []}]}]}]}, {"body": "lol the vp of Treasury at my company sold some stock and it actually spawned a news article on some investing website.\n\nHe bought a car.\n\nPeople sell shares.", "score": 124, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "One with wheels, I think.", "score": 7, "replies": [{"body": "It prolly has an engine too", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "At least 1", "score": 1, "replies": []}]}]}]}]}, {"body": "There are a 1000 reasons why CEOs sell stocks, but only one reason to buy", "score": 69, "replies": [{"body": "Because your ESPP plan is reoccurring?", "score": 9, "replies": []}]}, {"body": "Hmm.. Did you even look at the transaction date?", "score": 97, "replies": [{"body": "11/22/21 looks like the literal top", "score": 28, "replies": []}, {"body": "lmao first thing I said, outloud, to nobody in particular: \"yeah dipshit, he did that two months ago......likely for tax purposes.....\"", "score": 31, "replies": [{"body": "It is for tax reasons, to avoid paying the new 7% capital gains tax (on capital gains in excess of $250K). That tax is new in WA state & goes into effect this year.", "score": 15, "replies": [{"body": "Ah, so it's appears that the selling pressure from late November 2021 is **completely unrelated** to the **AFTER-HOURS** market reaction to MSFT's Q4 earnings (which is obviously going to be skewed due to limited trading volume)\n\nBut great attempt at the fearporn OP", "score": 14, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "You make that much and more a year? Maybe you need to stay. If you don't make over 200K then why worry?", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "\"I'll likely be making less money this year than I owe in taxes\"\n\nCan you clarify? This seems unlikely.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Okay so you mean, your taxes in your total income for last year (which was over 2M) are greater than your income this year.\n\nThat just means you had a good year. You reserved your taxes, right?", "score": 3, "replies": [{"body": "Yeah, I don't understand people like this. You getting so much money, what the hell are you doing with it? We all want to be multi-millionaires but it seems like people are never happy. I just don't let my lifestyle overlap my income. My goal is to make 3x more than I need.", "score": 2, "replies": [{"body": "I guess I get the desire in theory, and it's not like this is r/socialism. But like they say, nothing sure in life but death and taxes so why let it take you by surprise?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Washington state has less progressive income tax than Texas", "score": 1, "replies": []}]}]}, {"body": "… or to get money to buy turkeys for the homeless.", "score": 1, "replies": []}]}, {"body": "😂", "score": 3, "replies": []}]}, {"body": "Don't get it??? Says last year?", "score": 50, "replies": [{"body": "OPs attention to detail leaves a lot to be desired tbf", "score": 18, "replies": []}]}, {"body": "He sold half of his position because WA state (where he lives) is initiating a 7% capital gains tax on capital gains in excess of $250,000. He obviously sold to avoid this tax which would have been quite substantial for him. No other reason. A lot of old time MSFT, AMZN employees sitting on ton of capital gains & living in WA state took profits last year to avoid the additional state tax. No other reason. He continues to hold the other half. https://www.geekwire.com/2021/satya-nadella-sells-half-his-microsoft-stock-weeks-before-state-implements-new-capital-gains-tax/", "score": 18, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Haven’t seen any. In fact, FB, GOOGL, SpaceX, AMZN are expanding here big time & hiring.", "score": 9, "replies": []}, {"body": "None. More are coming here. Do you not read the news?", "score": 7, "replies": [{"body": "I’m sure he does. There’s quite a bit of news daily. Tech companies moving to WA isn’t necessity breaking news. Are you surprised someone missed that.", "score": 1, "replies": []}]}]}, {"body": "Can he just move to another state with no capital gains tax and sell it then ?", "score": 1, "replies": [{"body": "He can. But he already sold half last year before the tax kicked in. He will hold the other half pbly for a long time to come. May be the rest is his forever stock. Who knows.", "score": 1, "replies": []}]}]}, {"body": "Sell high, buy low?", "score": 35, "replies": [{"body": "guys, I think he broke the code", "score": 5, "replies": []}]}, {"body": "Washington State (where MSFT is based) instituted a 7% capital gains tax (on gains over 250k) that went into effect Jan 1 2022.", "score": 12, "replies": []}, {"body": "Thats holiday shopping", "score": 9, "replies": []}, {"body": "bro people have expenses to cover...selling by execs is not any sign..buying is tho", "score": 17, "replies": []}, {"body": "seriously the amount of stupid posts here is becoming unbearable", "score": 14, "replies": []}, {"body": "Insiders buying tells more than insiders selling. People have expenses.", "score": 6, "replies": []}, {"body": "you know the C level executives just can’t sell their shares, right? They need to be planned months in advance", "score": 5, "replies": [{"body": "the amount of compliance he had to go through is crazy. people think satya chillin on his couch with his e*trade app picked the top to sell a sliver 😝", "score": 5, "replies": []}]}, {"body": "So you bought puts and trying your best lmfao", "score": 15, "replies": []}, {"body": "that was last year though right?", "score": 5, "replies": []}, {"body": "If there was one CEO in this world that deserves to sell at the top it’s probably him.", "score": 5, "replies": [{"body": "Vladimir Tenev?", "score": 2, "replies": []}]}, {"body": "This was in November why r u posting it today?", "score": 8, "replies": []}, {"body": "Should we have gotten a twitter poll first?", "score": 5, "replies": []}, {"body": "So what man? OP are you really this dumb? People who work and own stock in a company usually sell a little here and there to offset taxes and whatnot. It's not weird for a CEO to sell some stock every year.", "score": 4, "replies": []}, {"body": "good for him!", "score": 3, "replies": []}, {"body": "“At the top”, huh? Nice to know that Microsoft share price will never go higher.\n\nI’ll go offload my shares now; thanks for the heads up.", "score": 3, "replies": []}, {"body": "Old news! This is from November.\n\nHe was in the same boat as Elon Musk and probably needed to sell a bunch of stock to pay for large tax obligations before the end of the year.", "score": 3, "replies": []}, {"body": "Op dont get there will be new tops.", "score": 2, "replies": []}, {"body": "This is pre-scheduled no?", "score": 2, "replies": []}, {"body": "Smart guy !", "score": 2, "replies": []}, {"body": "Or, share prices dropped because he sold", "score": 1, "replies": []}, {"body": "And?", "score": 1, "replies": []}, {"body": "Wow but when Adam Aron CEO of the popcorn stock sells and the world comes running with pitch forks.", "score": -1, "replies": [{"body": "Its different when they sell all of their shares, especially after promising not to. Anyone with a brain could tell amc execs were playing the dipshits that owned its stock though. Dumbass version of gme", "score": 1, "replies": []}]}, {"body": "As did the fuckers at Peloton.", "score": 0, "replies": []}, {"body": "i assume this is rly not very good", "score": 0, "replies": []}, {"body": "I dont know about you all but I always buy high and sell low so this looks super suspicious.\n\n/s", "score": 1, "replies": []}, {"body": "more like datautistic", "score": 1, "replies": []}, {"body": "Did he sell at the top, or was it the top because he sold? 🤔", "score": 1, "replies": []}, {"body": "Ha! He'll never make it on this sub  \nGotta do like me, and paper hand panic at the bottom", "score": 1, "replies": []}, {"body": "All criminals. This type of shit should not be allowed. What a corrupt world we live in!", "score": 1, "replies": []}, {"body": "I rdirdprpikdi", "score": 1, "replies": []}, {"body": "Not only him Bezos,Musk, Google ex heads sold in Q4 last yr\nSource:dataroma", "score": 1, "replies": []}, {"body": "This can’t be the latest news if he sold it last year, can it?", "score": 1, "replies": []}, {"body": "Needed money for groceries", "score": 1, "replies": []}]}
{"title": "Naked puts gone horribly wrong", "selftext": "I sold a bunch of naked puts right before the market crash. I thought I was playing safe bets but never saw such a hard crash coming. Sold SQ 145p 2/4, SQ 145p 2/18 (when SQ was still above 200). Now all my naked puts are deep ITM and am fucked. NVDA 275p is another one.\n\nHow do I get out of deep ITM naked puts? BTC (premium is crazy since the market dip) or wait and try to roll out?\n\nPlease help. I'm getting desperate.", "id": "sd1mzb", "created_utc": 1643187587.0, "score": 14, "upvote_ratio": 0.67, "num_comments": 77, "comments": [{"body": "How many kidneys you got left?", "score": 78, "replies": [{"body": "He's going to have negative kidneys.\n\nI hold SQ, and I'm sick about that. I couldn't imagine holding puts on it. At least it's up about 3% so far today so that will help OP.", "score": 5, "replies": []}]}, {"body": "“Naked puts on $SQ”\n\n“Safe bet”", "score": 40, "replies": [{"body": "\"I made this degenerate gambling play that I didn't hedge for, which I felt was a safe bet\"\n\nAs politely as I can ask this: How do some of these people have any money to start with? \n\nThere was a person asking how a call worked on this sub AFTER they had already purchased the call in question - some people seem desperate to lose money, I don't get it", "score": 27, "replies": [{"body": "This is why I am still trawling these subs to find out more about how these investment options function. I do not want to be \"that guy\".  \n\n\nSure, I might figure out quite a bit and STILL lose money, but I might stand a mildly better chance at earning some money.", "score": 6, "replies": [{"body": "The most basic advice that produces slow but steady winners : put your money in VOO or VTI or whatever broad fund you like until you're ready to move some of it to individual stocks or options. \n\nIf you never get to the point that you want to move it to individual stocks or options then you end up happy anyways.\n\nI'm currently at the part where I dabble lightly with selling covered calls because I don't feel like being too risky. Others like to buy calls that expire same day or sell naked puts like the OP. The important part is to identify where it can go wrong, and do what you can to avoid that or accept the outcome if you don't.\n\nNow watch me buy some PLTR calls. Just kidding. Maybe.", "score": 4, "replies": [{"body": "Given pltr current price,  leaps aren't crazy. I wouldn't buy them way out of the money, but I'd be surprised if it didn't get back up to 20 or higher this year.", "score": 1, "replies": []}]}]}]}, {"body": "I know naked options are never safe. But by safe I meant the stock price was around $200 after a dip, I thought to myself, it would not as low as $145. But I was gullible.", "score": 1, "replies": [{"body": "Hahahhahahahahahhahahahahahah\n\n::takes deep breath:: \n\nAhhhhhh hahahahahahahahabab", "score": 3, "replies": []}]}]}, {"body": "Start trying to roll now since they will be hard to fill. They may end up being several months out vs 2023 if you try to roll down as well. Know that they can be exercised early, but that is rare fortunately. How many of these did you sell? Start saving and allocating cash to cover your loss when it does. If you truly can't pay to be exercised, you need to start buying them back.\n\nSQ isn't the worst one to get stuck with; you picked low enough that you might get saved when it bounces back in a year. But yeah don't sell naked options.", "score": 22, "replies": []}, {"body": "You made your bed, now sleep in it.\n\nDon't come crying to us for help when you'd be all over WSB bragging about what a savant you were if it paid off.", "score": 33, "replies": [{"body": "The duality of man:\n\nA winning trade and bragging posted to WSB\n\nA losing trade and begging made to r/stocks", "score": 31, "replies": [{"body": "I'm not picking on the OP (he's in a bad place rn) but man, you nailed it with that comment.", "score": 2, "replies": []}]}, {"body": "Yup", "score": 0, "replies": []}]}, {"body": "Here are some questions to help decide the best choices for you:\n\n1. When do they each expire\n2. How many expire the SOONEST and at what cost-premium you rec’d. \n3. Net cost\n4. Do you have enough margin or SMA to buy the shares and if not how much $$ will you need to cover the margin call?\n5. If you rolled out the same strikes or a few $$ less TODAY not waiting for exp. what would your cost be?\n\nOnce I have that info I can try to give you actual dollars to do each choice.  Post here or DM me if u prefer, I’ve done this for over 25 years and have seen almost all situations", "score": 6, "replies": []}, {"body": "You are fucked. Realize the reality bro. You are getting sweaty, nervous that you might lost everything. Yes, that's what's going to happen. Nobody is responsible for your action except yourself. Face it.", "score": 32, "replies": [{"body": "Thanks for the useful advice.", "score": 13, "replies": [{"body": "I would stop messing with naked options honestly.", "score": 13, "replies": []}, {"body": "Are you near a margin call? I got caught selling naked puts on NVDA, but you just sell calls to cover the margin rate until they get called away. Might have to hold for awhile, but I’ll still make money on the premium. It’s the wheel strategy", "score": 2, "replies": []}, {"body": "Time to double down, take out loans and use max margin and buy in or sell more puts", "score": 4, "replies": [{"body": "Goldman, is that you?", "score": 1, "replies": []}]}]}, {"body": "Sounds like an Eminem song", "score": 2, "replies": []}, {"body": "JPowell is also responsible. He will decide the fate of the entire stock market for the next couple of weeks", "score": -21, "replies": []}]}, {"body": "My advice: Don't sell naked puts.\n\nYou're welcome.", "score": 21, "replies": [{"body": "I know that now. If you have an advice on how to safely exit my positions that would be great.", "score": -18, "replies": [{"body": "I don't think you can safely exit without taking losses.", "score": 14, "replies": [{"body": "Just trying to minimize losses.", "score": -1, "replies": []}]}, {"body": "1. Exit the position and take the losses. \n\n2. Wait and hope the position improves which obviously could make your situation worse. If you are determined to do this maybe consider buying OTM puts so you have some level of loss protection.", "score": 6, "replies": []}]}]}, {"body": "If you're confident that the stocks can recover you could roll them, maybe lower your strike price slightly as you move them further out. Or keep the same strike if you're confident as you may be able to get more premium.", "score": 6, "replies": []}, {"body": "You’re already naked, next step here is bend over.", "score": 4, "replies": []}, {"body": "Roll forward and down (if possible) for zero debit or small credit.\n\nSQ positions are not that bad. In premarket, it is trading at ~120, you need about 20% rise to be ATM. If stock goes uptrend, you might be able to exit in few months. If stock stays volatile or in downtrend, focus on bringing down your strike slowly with roll forwards to narrow the gap between stock price and strike price when assigned. In the mean time raise money to pay for stock when assigned.\n\nYour biggest risk is early assignment so monitor the intrinsic value and if gets 85-90% of premium, roll forward.", "score": 4, "replies": []}, {"body": "When you go naked you expose yourself", "score": 5, "replies": []}, {"body": "Diego puts all his money on black. -\n\nIt stops ——- behold! Red! -\n\nDiego cries ! “Help me, I’m desperate” -", "score": 5, "replies": [{"body": "“I had done ton of research! Red had hit 5 times in a row! I thought it was a safe bet”", "score": 1, "replies": []}]}, {"body": "Buck up, or roll out... \nBest of luck!", "score": 2, "replies": []}, {"body": "Sometimes i play theta but its rare.  A lot of noobs in thetagang and they dont realize what they are doing is so much more dangerous than wsb.  Opinions change fast when the stock you sold otm csp puts on dips another 50%.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "This has been an expensive hard lesson. Will never touch naked options.", "score": 2, "replies": [{"body": "How much u down?", "score": 2, "replies": []}, {"body": "How much did you lose?", "score": 1, "replies": [{"body": "About 100k or so", "score": 1, "replies": []}]}]}]}, {"body": "One of the great things about sold puts is that you can just keep rolling them out when the underlying moves against you. You can even try to roll out and down. \n\nBut yeah, next time, don’t sell them naked.", "score": 2, "replies": []}, {"body": "Keep rollin’ rollin’ rollin’", "score": 2, "replies": []}, {"body": "If you sell a put you need to buy a call of a nearby strike price. Whatta you, a kindergartener?", "score": 2, "replies": []}, {"body": "You could have set a stop loss or covered 7 days ago", "score": 2, "replies": [{"body": "I could have. I could have done nothng instead of selling some unfortunate puts too.", "score": 1, "replies": []}]}, {"body": "OP . Please post this on /u/wallstrteetbets", "score": 2, "replies": []}, {"body": "You will have to eat the losses unfortunately. Only thing I guess you can do is ride it out and hope theta pays you back some while the market goes sideways", "score": 2, "replies": []}, {"body": "Sell puts on stuff you believe in over a longer-term in case the short term doesn't work out so well. Early on in the dip I sold some cash-secured TQQQ puts and got assigned deep ITM. It's been a terrible month, but I believe I'll make it back over the coming months and reach the point where I can sell my CCs and hopefully roll out of the position. It delays the timeline, but it doesn't destroy me since I'm good w/ holding the shares. \n\nI hope you have similar faith and patience w/ SQ.", "score": 2, "replies": [{"body": "I do believe in SQ, PYPL, NVDA, U, COIN, NET long term. I just sold too many.", "score": 0, "replies": []}]}, {"body": "Press the ‘escape’ key", "score": 2, "replies": [{"body": "I think this is more of a CNTL ALT DELETE situation.", "score": 2, "replies": [{"body": "Definitely a Format C:", "score": 2, "replies": []}]}]}, {"body": "Maybe stop trading options and be patient", "score": 1, "replies": []}, {"body": "Honest question to learn something myself.\n\nI understood options rarely get exercised and are just sold on. Does this mean people will have the contract exchange hands until someone, potentially, ends up holding the bag because IV crush (less volatile as end date approaches) or it's no longer ITM because, for instance, a rally occurs after the Fed's decision?\n\nIn short; can OP count on others to gamble and hold until it's no longer ITM? About 90% of buyers of options are said to lose money.", "score": 0, "replies": []}, {"body": "Ask r/thetagang", "score": 0, "replies": []}, {"body": "i don‘t get it. can‘t you sell your options for a huge profit?\n\nedit: nevermind i‘m an idiot. if it‘s just a significant loss but doesn‘t make you broke then sell\nit before it gets worse. if you‘re already completely\nfucked then you just power through and declare bankruptcy if the market doesn‘t safe you", "score": -7, "replies": [{"body": "He’s the one that sold the puts to the guy who made a huge profit. Now he’s fucked", "score": 10, "replies": [{"body": "What he said", "score": 1, "replies": []}]}, {"body": "Naked puts and puts are not the same . The former is when you feel the stock has bottomed and will moderately increase over a month and the ladder is when you want the underlying price to carrying on dropping Past your strike price . A dangerous dance none the less", "score": 5, "replies": [{"body": "yeah i just could not believe that OP sold naket puts. there‘s a reason this is usually reserved for big market makers.", "score": 2, "replies": [{"body": "Retail should be limited to certain financial services, this is one of them.", "score": 4, "replies": [{"body": "absolutely", "score": 1, "replies": []}]}]}]}]}, {"body": "Me too, but in the other direction. If the market doesn't crash today... IBKR will flush my account", "score": -2, "replies": [{"body": "Say bye bye", "score": 2, "replies": [{"body": "Manages to save something here. Hedged myself with a SPY call.", "score": -1, "replies": []}]}]}, {"body": "Attempt to roll out your expiry and down your strike price. It will need to be several months out since you're so deep ITM.\n\n\nIf you can't roll for a credit you have two option. You can (1) wait and see what the Fed announces and hope tech recovers before you have an early assignment or margin call. Depending on your account size and how many puts \"a bunch\" is this could be a disaster. Or (2) simply buy back your puts at a loss. The loss will be painful, but it will be defined and will all be over.", "score": 1, "replies": []}, {"body": "Rolling doesn’t work when you’re using so much BP", "score": 1, "replies": [{"body": "What's BP?", "score": -1, "replies": []}]}, {"body": "This post belongs on double-u ess bee.", "score": 1, "replies": []}, {"body": "You though it was a safe bet, but you did think of fat tail risk\n\n... Sorry just watched a Nicholas tallab lecture yesterday", "score": 1, "replies": []}, {"body": "Naked meaning you can’t afford it, you’re likely to experience something called a margin call. Your broker will sell other assets in your holdings to make up for the losses, and then you’ll talk to them and negotiate a payment plan / settlement for the debt you owe them.", "score": 1, "replies": []}, {"body": "Wait for VIX to subside (if you can) to remove any extrinsic value, and/or buy puts as a hedge to protect yourself from further downside. You could also sell calls at around the same strike to create a short straddle to lower your cost basis. There’s no easy button for this however. I recommend you sell cash secured from now on, I’m surprised your broker would allow you to sell naked puts.", "score": 1, "replies": []}]}
{"title": "any oversold companies that you´re picking up or adding to at a discount?", "selftext": "[removed]", "id": "sdjfje", "created_utc": 1643239078.0, "score": 15, "upvote_ratio": 0.71, "num_comments": 73, "comments": [{"body": "JPM for right now. Tech is still to high.", "score": 20, "replies": []}, {"body": "Amd is my dca pick", "score": 10, "replies": []}, {"body": "T seems crazy low. As well as disck", "score": 15, "replies": [{"body": "Agreed! I also like that you picked DISCK over DISCA.", "score": 1, "replies": []}]}, {"body": "AMZN, SOFI and INTC. They are the only ones I am increasing.", "score": 10, "replies": []}, {"body": "I bought some HD today", "score": 5, "replies": []}, {"body": "DIS will drop more. When it’s under the 120$ I’ll buy some.", "score": 5, "replies": []}, {"body": "GFS. U. SoFi.", "score": 9, "replies": [{"body": "$U 😂", "score": -4, "replies": [{"body": "Why what’s up?", "score": 1, "replies": [{"body": "They don’t make the one thing every stock needs. Money", "score": -1, "replies": [{"body": "Oh shit, do they have growth at least?!", "score": 1, "replies": [{"body": "Yeah but they are losing a ton of money. And you as a shareholder are paying way too much", "score": 1, "replies": [{"body": "Damn, if they’re at least growing then when do you expect them to be profitable?!", "score": 1, "replies": [{"body": "Look at companies from the tech bubble that aren’t around today. Growing revenue but growing losses. It’s not a good company to be in", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Avg in on AMD, you’ll be fine", "score": 8, "replies": [{"body": "Ahhh You said it’s your largest position so you may not be able to add more", "score": 3, "replies": []}]}, {"body": "3 Beaten down stocks with high growth, 100% institutions holding, trading less than 2X the revenue, 200% upside analysts price targets \n\nREAL- SEAT - FTCH", "score": 3, "replies": [{"body": "Real has worked out well for me so far since I bought it at $22 after reading a motley fool article.", "score": 1, "replies": []}]}, {"body": "PTLO is the next CMG and you can get in below ground level right now!", "score": 3, "replies": []}, {"body": "FB DIS definitely at very good prices compared to the rest of the market at these levels. will be averaging  more into SHOP and NVDA if we keep dropping", "score": 3, "replies": []}, {"body": "PLTR", "score": 8, "replies": [{"body": "I need to buy just to get my cost basis down. Lol", "score": 8, "replies": [{"body": "Yeah that wrecked me", "score": 5, "replies": []}]}, {"body": "Why? Its own tech couldnt predict its performance.", "score": 1, "replies": []}]}, {"body": "disney expensive? guess i shouldnt have been buying at 137..", "score": 4, "replies": []}, {"body": "EXTR, MSFT, WMT, MU. After the crash I bought up as much stock as I could from these companies. They all make good money and they all have positive outlook on the coming quarters.", "score": 6, "replies": [{"body": "Crash? There’s been a crash?", "score": 19, "replies": [{"body": "Probably they meant the 2020 one", "score": 1, "replies": []}]}]}, {"body": "LICY for sure, almost to a thousand shares\n\nSOFI, RKLB, BJRI", "score": 2, "replies": []}, {"body": "I think quality, profitable companies will be the best market performers over the next couple of years. I think the explosive growth high P/S stocks will have their day again but it might not be for several years. The ones that mature into highly profitable companies will of course do well but time will tell.\n\nI like AMD a lot. DIS is solid, but would prob just put that money into VOO, don’t see a ton of upside with DIS and certainly more risk than an index. NET I’m staying away from.", "score": 2, "replies": [{"body": "I completely agree. I think that speculative stocks are going to suffer when there are reasonable interest rates. But it will come back around, it always has. Maybe another 10 years minimum.\n\nSaying that, if this crash continues, I have my eyes on some innovative biotech companies.", "score": 1, "replies": []}]}, {"body": "SAVA", "score": 2, "replies": []}, {"body": "SOFI with great conviction. \nUWMC\nCLOV. \n\nWould not touch AMD & NVDA, they have to fall more for me.", "score": 2, "replies": []}, {"body": "NVDA", "score": 5, "replies": []}, {"body": "ill buy net at 50..\n\nunity at 75\n\ncrm at 180-200\n\nSE at 100", "score": 3, "replies": []}, {"body": "Looking to add to DOCU and PYPL.\n\nOn my shopping list: NCNO, STEM, NVDA, RBLX (these haven't dropped enough yet)", "score": 4, "replies": []}, {"body": "Tbh, no. I'm still waiting for a larger correction to buy my fav stocks. My largest position will probably be Visa if it ever gets down to like 140ish.", "score": 3, "replies": []}, {"body": "MTTR is under $10 I got more today", "score": 3, "replies": [{"body": "Why would you invest in this? Have you been watching YouTube videos. Stay away from garbage.", "score": 1, "replies": []}]}, {"body": "I’m thinking Amazon, as of now it’s down like 10% over the last year and you know they’ve been making crazy money and good investments", "score": 2, "replies": []}, {"body": "I like SOFI but I'm all in on HIMX.  Better play then AMD as far as valuation goes.", "score": 1, "replies": [{"body": "Yeah HIMX is it for me as well. Increasing position. There and in AMD", "score": 1, "replies": []}]}, {"body": "AMZN", "score": 0, "replies": []}, {"body": "NET trading more than 40X revenue", "score": -1, "replies": []}, {"body": "Arrival (ARVL) - $3.24 down from $17.81 in November.\n\nAvePoint (AVPT) - $5.39 down from $9.08 in November (didn't hit a recent peak when the market did).\n\nAST Spacemobile (ASTS) - $5.22 down from $13.86 in November.\n\n\nAll either pre-revenue or unprofitable, so they aren't viewed well at all currently.\n\nHowever, given the potential of all three companies in the coming year, and the fact that the November prices shown above were already cut in half from their 2021 highs, the risk/reward profiles at the current prices appeal to me.\n\nFor transparency I am absolutely a bag holder on all three, and I'm sure there are plenty of other small-caps currently undervalued to the same or greater extent.", "score": 1, "replies": [{"body": "It’s not 2020 anymore mate now is not the time for this kind of shit", "score": 16, "replies": [{"body": "OP asked for oversold companies, I believe these to be oversold. Sure they're risky, and the market might not like them for a long time, but at their current valuations I believe the risk to be worth it as a small part of the portfolio.\n\nI don't just buy whatever is popular in a given year. I didn't buy them 2020, or even for most of 2021, but I'm buying them at these prices.\n\nMaybe I'm wrong though, so if you disagree that's perfectly fine.", "score": 0, "replies": []}]}]}, {"body": "Buying JD,BABA,HIMX,GRVY \n\nShorting rivian, Tesla, nvidia, amd  Way to overvalued…", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well its a very small Company with very low volume, plus most Americans rarely look outside of America?\n\nTheir growth is insane, balance is wonderful, valuation is dirt cheap, I don’t have that much in them compared to other investment(only like 20k have an avg price if ~70$, but if it stays below 60$ I might double down)", "score": 1, "replies": []}]}]}, {"body": "I'll pick up some TSLA once it gets to around 85.", "score": -2, "replies": [{"body": "I agree lol", "score": 2, "replies": []}]}, {"body": "Buying VZ, Amazon, Google, and meta", "score": 1, "replies": []}, {"body": "I'm tempted to get a little more Amazon down here. I've been adding to apps and sofi", "score": 1, "replies": []}, {"body": "CTS.TO", "score": 1, "replies": []}, {"body": "BROS the minute it went below 40.. too late now", "score": 1, "replies": []}, {"body": "Verizon", "score": 1, "replies": []}, {"body": "$UMG", "score": 1, "replies": []}, {"body": "Nflx", "score": 1, "replies": []}, {"body": "PlayWay", "score": 1, "replies": []}, {"body": "Biontech", "score": 1, "replies": []}, {"body": "It is too soon. Most of tech is still overvalued.", "score": 1, "replies": []}, {"body": "GrowGeneration and Intel", "score": 1, "replies": []}, {"body": "Why is it always the same thing with these posts... The idea is a very good one - sharing good beaten down stocks with the community, so everyone can check the company out and decide for themselves if it's a good investment or not. However in 99,9% of the cases the companies being shared either are the still massively overvalued tech giants that have dropped like 10% and are somehow 'a good deal' despite selling for outrageous multiples (MSFT, META etc. ) or the still unprofitable, highly speculative, highly pumped up companies (PLTR, SOFI etc. ). Either way a conservative investor (which is the only real way to invest and expect returns in the long term) can't find any value in there.\n\nThis would be the point where I give you guys a stock tip that meets my requirements, which would be Prosus.", "score": 1, "replies": []}, {"body": "AMZN META FB", "score": 1, "replies": []}, {"body": "NVDA", "score": 1, "replies": []}, {"body": "STEM", "score": 1, "replies": []}, {"body": "SQ is incredibly oversold right now", "score": 1, "replies": []}, {"body": "intel!!!!! Also Waste Managament", "score": 1, "replies": []}]}
{"title": "SPY crash incoming", "selftext": "What's up WSB.\n\n&#x200B;\n\nSo, the SPY has been irrational and no one truly knows what direction it's going to take except for maybe Nancy Pelosi. I present to you my very amateur technical analysis. Am I wrong? Probably. Are you reading this anyway? Yes.\n\n&#x200B;\n\nNow, some of you are gonna call me crazy.  And you're probably right! Why do I think it's going to crash? Stay tuned and I'll tell you why.\n\n&#x200B;\n\nMy thesis here is based on the price action the last few days. The last time the price dipped below the 260 day moving average on the daily chart was during the crash of 2020 in March. You may be asking yourself \"But Harryp0thead, why the 260 Day MA?\". The answer to that is simple. There are 260 Business days in a year, therefore, it is the yearly moving average.\n\n&#x200B;\n\nBack to my thesis.  [My first chart](https://imgur.com/dR5B4wa) shows the daily chart action. I traced over the 5 day MA of the 2020 crash and placed it over the current price action. Fits like a glove. Also shown are the 260 and 26 day moving averages. [My second chart](https://imgur.com/iz9rQxk) shows the 30 minute price action. Once again, the indicators fit like a glove. The March crash was bailed out by the fed printing money and we may finally be seeing the crash as it was meant to be.\n\n&#x200B;\n\nIf you look closely and we are to believe that the chart can/will behave the same way, we will be trading sideways to the end of January. Is it possible that we dip or rise before that? Of course it is! I believe this sideways trading is a bull trap before the market de-leverages and corrects from the fed going brrrrr for far too long.\n\n&#x200B;\n\nTherefore, I am of the belief that the price movement is going to depend on what the fed does in the coming days/weeks. Does the fed decide to continue printing money? SPY goes brrrrrrrrr. Does the fed decide to taper off and raise interest rates? Spy goes 🌈🐻.\n\n&#x200B;\n\nHow far down will the SPY go if it crashes? Like I said, no one knows except for maybe Nancy Pelosi.\n\n&#x200B;\n\nTL;DR\n\nSPY Goes 🌈🐻 if the fed raises interest rates and turns the printer off.\n\n&#x200B;\n\nTHIS IS NOT FINANCIAL ADVICE", "id": "scxz7g", "created_utc": 1643173603.0, "score": 70, "upvote_ratio": 0.77, "num_comments": 75, "comments": [{"body": "[deleted]", "score": 61, "replies": [{"body": "[One](https://i.imgur.com/c17xAeM.jpg) of [Two](https://i.imgur.com/3D4WisV.jpg). This is a speculative bet for me.", "score": 13, "replies": [{"body": "Good on you. those Febs are gonna get crushed today. But you can buy some more cheaply after the obligatory Powell Pump.", "score": 2, "replies": []}]}, {"body": "This show your position or ban", "score": 12, "replies": []}]}, {"body": "So what your saying is the price could go up or it could go down? Seems legit.", "score": 43, "replies": [{"body": "But only up down until end of January where we will then see it go either up or down", "score": 12, "replies": []}, {"body": "But did you know it could go side to side ![img](emote|t5_2th52|4275)", "score": 8, "replies": []}]}, {"body": "Counterpoint: spy’s are hard to detect how would we even know?", "score": 26, "replies": [{"body": "Source:\n\nHe told me. He’s a good guy.", "score": 8, "replies": []}, {"body": "I mean I’m not even a radar specialist 🤷🏻‍♂️", "score": 3, "replies": [{"body": "It's easy.\n\nIf a hot chick approaches you at a bar...and still seems interested after you finish talking about your nerdy job - she's likely a spy.", "score": 10, "replies": [{"body": "You could’ve stopped at “if a hot chick approaches you”", "score": 11, "replies": [{"body": "Trueeeeeee ;(", "score": 3, "replies": []}]}, {"body": "Damn. So I wasn’t suppose to give her top secret information, my social, blood type, kidney and access information on all our nukes? I really messed this one up didn’t I?", "score": 3, "replies": [{"body": "Well... that all depends.  Did you also give her your semen?", "score": 5, "replies": [{"body": "She actually stole that one. Shouldn’t have been swayed by that Russian accent. But damn was it sexy.", "score": 3, "replies": [{"body": "Spoiler shes actually Israeli they all are.", "score": 3, "replies": [{"body": "Sweet baby Jesus now that’s a plot twist", "score": 3, "replies": []}]}]}]}]}, {"body": "or a dude.", "score": 2, "replies": [{"body": "Nah - I automatically assume that every dude at.a bar that talks to me is just ghey. Other countries that condone spying don’t condone gheying…so your safe.", "score": 2, "replies": [{"body": "\"gheying\" . made me laugh, didnt hear before.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I trust Nancy Pelosi", "score": 11, "replies": [{"body": "I don’t think over heard that before", "score": 3, "replies": []}]}, {"body": "Nancy Pelosi bought a shit ton of stock so either she is clueless or she knows its going back up.", "score": 12, "replies": [{"body": "Sauce??", "score": 5, "replies": []}, {"body": "She bought leap deep itm calls not stock", "score": 2, "replies": [{"body": "Same difference kinda unless her sole purpose is to exercise at the bottom but even then she'd loose a ton of money on wasted premium paid.", "score": 1, "replies": []}]}]}, {"body": "*If* the Fed raises rates and starts unwinding assets? Bro have you been living under a rock? JPow has basically been saying this for a year now. This isn't a crash, this is literally just upcoming policy getting priced in at this point. If you haven't been buying puts, you may have missed the move.", "score": 8, "replies": [{"body": "I didn’t move quick enough", "score": 2, "replies": []}, {"body": "I missed the move", "score": 2, "replies": [{"body": "You can still move. It’s just more expensive.", "score": 1, "replies": [{"body": "I’ve actually never fully grasped the concept I think of options I’ve been reading about them a lot but just somewhere I’m lost in translation", "score": 1, "replies": [{"body": "YouTube: In The Money. He does a good job of explaining them.", "score": 1, "replies": [{"body": "I think one of my buddies actually suggested him a while ago and I may have watched a video or it may have slipped my mind but I’ll look into it more again", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Positions or ban", "score": 3, "replies": []}, {"body": "Post your YOLO SPY PUT position. or you can stfu.", "score": 8, "replies": []}, {"body": "Bullish till March", "score": 5, "replies": []}, {"body": "Where's Fuzzyblanket when you need him?", "score": 2, "replies": []}, {"body": "Feb 4 puts.", "score": 2, "replies": []}, {"body": "No position no care", "score": 2, "replies": []}, {"body": "What would Cramer do?", "score": 2, "replies": []}, {"body": "Calls it is, gents", "score": 3, "replies": []}, {"body": ">So, the SPY has been irrational and no one truly knows what direction it's going to take\n\n...and you are just realizing this now?", "score": 3, "replies": [{"body": "Give him time. He noticed it's has been trending downwards after 5 red sessions", "score": 2, "replies": []}]}, {"body": "Usually when WSB has oodles of “crash” posts, the correction is over. Damn it gotta close out my puts/shorts.  Sheesh. If you want the market to crash keep it to yourself.", "score": 4, "replies": []}, {"body": "OP: Spy is lower than it’s moving average \n\nAnalysis: it could go even lower. Or not. \n\nBig brain time over here", "score": 2, "replies": []}, {"body": "Wait a second… so you’re telling me that if the fed raises rates and stops printing money, stonks go down? What the fuck?!", "score": 2, "replies": []}, {"body": "The SPY will either be up or it will be down tomorrow.", "score": 1, "replies": [{"body": "not necessarily", "score": 4, "replies": []}]}, {"body": "You:\n\n>So, the SPY has been irrational and no one truly knows what direction it's going to take  \n>  \n>SPY ... irrational ... no one truly knows ... direction  \n>  \n>no one truly knows  \n>  \n>no one knows\n\nAlso you:\n\n>I think it's going to crash\n\nYou're not wrong on this one:\n\n>Now, some of you are gonna call me crazy.", "score": 1, "replies": []}, {"body": "The next person that jerks off to that  MA thing should get hanged, drawn, and quartered", "score": 1, "replies": []}, {"body": "Does inversing WSB still work these days?", "score": 0, "replies": []}, {"body": "Puts popping on 1/28/2022.  https://spotgamma.com/the-deep-january-opex/\n\nThose puts will print no matter what.  So OP used a thesis with a lot of dialog and all you need is the first graph on the link.", "score": 0, "replies": []}, {"body": "So 420.00 SPY calls, 69 days out. Got it.", "score": 0, "replies": [{"body": "Nice!", "score": 2, "replies": [{"body": "Thank you, you're a good bot", "score": 1, "replies": []}]}]}, {"body": "The fed interest rate hike has been priced in already… now you just need to wait till 2pm ET to trade the reaction to the fed\n\nIt just sucks that IV for for spx / spy and qqq calls and puts are jacked to the tits.", "score": 0, "replies": []}, {"body": "I know is hard to believe, but usa can't afford another crash. They need to fake the strong  economy on the rest of the world.\nHow they do that? High taxation, higher inflation,  taxing crypto and going all in on IRS Audit.\n\nBut hey! At least we got some iPhone stimulus.\n\nSo some bond tech corrections game, but spy will only point higher and higher", "score": -1, "replies": [{"body": "US can afford another crash just like they’ve been able to afford every other one.  A strong economy is bigger than the stock market. What we can’t afford is $20 chicken nuggets, which is what we get if we keep printing money.", "score": 6, "replies": [{"body": "No you need to eat less. Shitfood", "score": -3, "replies": [{"body": "So what you’re saying is buy less 20$ chicken nuggets and more 20$ chicken tenders? Interesting financial advice.", "score": 1, "replies": []}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|10 months ago\n**Total Comments**|5|**Previous DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=scxz7g)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=scxz7g)", "score": 1, "replies": []}, {"body": "I mean.... Market problems, global powers butting heads... this has ground invasion written all over it.", "score": 1, "replies": []}, {"body": "I don’t see how the fed can continue to go brrr.", "score": 1, "replies": []}, {"body": "if it does not go up will go down and vice versa.... your positions or ban", "score": 1, "replies": []}, {"body": "SPY and NASDAQ 100 are really only 6 companies. No need to dig deeper. If those big techs fall, the indices get hammered. If not, they stay high.", "score": 1, "replies": []}, {"body": "Fun fact: if you bought the 50/200 death cross in the covid crash of 2020 you would have literally bought the bottom. Crazy, I know.\n\nAlso OP, you really need to use a better crayon program", "score": 1, "replies": []}, {"body": "This was the least confident DD I’ve ever read, good job.", "score": 1, "replies": []}, {"body": "This just in: Man says crash is coming after market down 10%", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "Betting against the FANG?? GL", "score": 1, "replies": []}]}
{"title": "When does inflation actually start to matter?", "selftext": "First of all, I’m not an economist. I’m a retard.\n\nThat being said, back to the title of this post: when does inflation actually start to matter?\n\nSure, right now it matters for the poor people, but we never care about them anyway. They’re always fucked by our economy. \n\nFor us fine middle/upper middle class folks, all we’re doing is reading a bunch of articles about devastating inflation, coming on Reddit to bitch about it, having a good disaster porn/financial collapse/apocalypse circle jerk……and then going out to lunch and paying for our $18 sub. And lots of our kind-hearted employers are even giving us inflation adjustments for being good boys and girls. \n\nWhy should I be certain of our impending financial doom when none of our spending habits are going to change anytime soon? Why are we all so sure that our society is going to collapse into one gigantic dumpster out back of Wendy’s?", "id": "scyjo6", "created_utc": 1643175557.0, "score": 33, "upvote_ratio": 0.78, "num_comments": 72, "comments": [{"body": "The moment you decide to finally start paying on that credit card bill you’ve been racking up the last few months", "score": 35, "replies": [{"body": "Lmao this guy lives in a bubble \"I haven't noticed any price increases,\" so OP either rich or a dependent", "score": 3, "replies": []}]}, {"body": "Try buying a house on a middle class income… with 2 working adults", "score": 28, "replies": []}, {"body": "Lol even my upper middle class ass feels inflation!  From my $5 gallon gas to Groceries up over 20% to my Daym electric Bill over $650.\n\nThis is being felt by everyone dont kid yourself", "score": 17, "replies": [{"body": "Is this significantly changing your discretionary spending habits? Next time your buddy wants to go out somewhere are you saying “nah I’m sorry I don’t have any more money to put into the economy my groceries have just been too high lately”", "score": 3, "replies": [{"body": "Yes I definitely have but back on excess spending, I have a mortgage 2 kids a wife that stays at home plus all the other car payments, insurances etc.  I blow through 12k a month on bills so anything on top of that really hits the wallet at this point.\n\nEspecially being a business owner and Covid fucking shit Up out here in CA.  This is the most expensive state to live in.", "score": 7, "replies": []}, {"body": "You either don't pay for your own groceries or your rich enough not to look at the bill lol come back to reality man", "score": 1, "replies": [{"body": "Where did I say I don’t look at it? I’m talking about looking at it, being annoyed, and then continuing to spend it anyway, like we’re all doing", "score": 0, "replies": [{"body": "\\*\\*\\*\\*\\*\\*if you can continue to spend it anyway\\*\\*\\*\\*\\*\\*\\*\\* but everyone else has been adjusting to the price increases", "score": 1, "replies": []}]}]}]}, {"body": "You live in Hawaii or something? 5 dollar a gallon gas?", "score": 1, "replies": [{"body": "Southern Cali.  \n\n91 octane is $4.87 this morning when I filled up.", "score": 4, "replies": [{"body": "Jesus.  I'm in upstate NY right on the canada border and we are still only 3.69", "score": 2, "replies": [{"body": "Can you save $ driving across the border to fill up? Legitimately curious.", "score": 1, "replies": [{"body": "Oh no it's much higher over there. Alot of canadians drive over here to get gas.", "score": 3, "replies": []}]}, {"body": "Yea it sucks California is horrible", "score": 1, "replies": []}]}]}]}, {"body": "Electric Bill 650 what the fuck. That's on you man mine is like $45", "score": 1, "replies": [{"body": "Nothing I can do it’s so cal Edison I have a 2200sf house and a pool.  All Led lights. Summer $650 winter $350", "score": 2, "replies": []}]}]}, {"body": "Inflation has to be high enough that people are reluctant to sit on cash and instead want to invest in thing that hopefully create sustainable value. Building a more efficient car factory is a good example of creating sustainable value. If inflation is too high than your costs become unpredictable and planning, negotiating, and getting paid get very complicated. Say you sell a car during runaway inflation, normally you would use the proceeds to build another car or invest in an improvement but while the car was sitting on the lot the parts for it doubled in price so you can't continue to invest your revenues in creating one value.  You want inflation to between those two points. \n\n\nModern US economists believe that is a between 2 and 7% in the current Era. Innovation and new markets can change these numbers over time for example computers have made some types of innovation very low cost but high value as you can write software to replace expensive people and machines. 3d printers are some manufacturer ingredients much easier so it's easier to get a return and that is why in modern time the low end of inflation has gotten lower as it takes less incentive for people to risk on big returns. \n\nBasically you want inflation high enough to encourage investment to beat it but not so high that invest doesn't work. The greatest fear is an inflation spiral which is a rare event and takes some special circumstances to happen. It's when trust in getting paid enough for your goods to be able to spend it on what you need either due to shortages or price hikes turns into viscous cycle of escalation. This is actually pretty hard to have happen in a modern economy because we have so many options on how to spend our money and if one thing gets to be too expensive there are alternatives.", "score": 11, "replies": [{"body": "This. I sold my car for $16k in august. I downgraded to be debt free. Unfortunately the engine exploded and the same car I sold in July is now selling for $22k. Inflation totally fucked me.", "score": 12, "replies": []}, {"body": "Explained in a way that even I could understand, thank you", "score": 6, "replies": []}]}, {"body": "When the fedboiz 8 trillion dollar mortgage backed securities flop and the housing market, commercial anyways, comes crashing down 5x harder than 08", "score": 7, "replies": [{"body": "tHis TiMe iS diFfeReNT", "score": 4, "replies": []}]}, {"body": "I’m not sure that society will collapse, merely hoping that it will. But to answer your original question: only when it affects the billionaire class (so like 100 people).", "score": 5, "replies": [{"body": "It's up to 724 people - in the US alone. 725 when my Raytheon calls print 😆 There are 2755 in the world.\n\nSince the system continues to work for them, I don't expect them to be affected by this level of inflation (vs. the early 80s). This is not hyperinflation, despite the term being bandied about lately.", "score": 2, "replies": []}]}, {"body": "This gotta be some type of troll or the man is just super rich to never give two shits about paying 30 bucks for a 8 oz steak at the grocery store", "score": 5, "replies": []}, {"body": "Bruh if you're paying fot a 18$ sub you ballin", "score": 2, "replies": [{"body": "Don’t worry that includes chips", "score": 8, "replies": [{"body": "Make it a meal with a drink too.", "score": 2, "replies": [{"body": "Only if it is blue Powerade", "score": 3, "replies": []}]}]}]}, {"body": "See first sentence for clarification…", "score": 2, "replies": []}, {"body": "When your mom starts selling herself to feed the family...", "score": 2, "replies": []}, {"body": "My Ramen went up 10 cents and I noticed.", "score": 2, "replies": []}, {"body": "When your annual income is less than the price of an iPhone or Pixel.", "score": 4, "replies": []}, {"body": "Cuz the same people who collapsed the global economy were given trillions on a promise not 2 do it again. Cuz policy is more loop hole than policy & b cuz the same debts & crimes were kicked down the decade ++++ they should’ve changed shit but instead we got covid & boom more trillions out of thin air for the same people who have longer rap sheets than most in jails. Look at JPM 5 felonies - google bank cartel & boom they r caught in some scandal often. \n\nThe lending & borrowing of what doesn’t exist our options mrkt - 2 much 2 list", "score": 2, "replies": [{"body": "You seem to have misread “when does it matter” for “why did it happen”", "score": 1, "replies": []}]}, {"body": "I don’t know…grocery store, gas station, when you’re buying booze….practically anything that involves paying for something.\n\nYou sound really dumb op…", "score": 2, "replies": [{"body": "Please attempt to re-read the post with a small amount of reading comprehension. Not talking about price changes, talking about spending habits", "score": 1, "replies": [{"body": "Ummm this is the Wild West…A casino if you will.\n\nGo to r/investing if you need reading comprehension and that gey shit…I can only imagine the colossal cuck you must be in real life…everyone hates you", "score": 1, "replies": []}]}]}, {"body": " *never*", "score": 1, "replies": []}, {"body": ">when does inflation actually start to matter?\n\nInflation causes the dollar to weaken against other currencies.  Poor people in other countries can suddenly afford to buy your house.", "score": 0, "replies": []}, {"body": "\"The poor people\" are the only class that's seeing wage increases higher than inflation right now (Food Service and Trucking for example). Economists would tell you that your clichés are retarded. 😉", "score": -2, "replies": [{"body": "While there is a tiny bit of truth to what you said, it is very misleading. White collar workers are getting wage increases right now. While it is true that some low paging industries have had higher wage increases the last two quarters, economists look at the economy long term. Over the last 50 years, higher wage earners are up hundreds of percent versus inflation, while low wage workers are down vs inflation.", "score": 4, "replies": [{"body": "Talking about this specific bout of inflation, which is the highest since the 80s and thereby worth talking about as a separate event. \n\nYou are right that blue collar workers had real wages drop over last 20-30 years but that was not a period of high inflation. It was lowflation/deflation. Essentially blue collar wages stood still while prices rose ever so slightly YoY, eroding their buying power (exponentials!). \n\nI think the prolonged high inflation period in the seventies also had blue collar wages rise in real terms BTW.", "score": 1, "replies": []}]}, {"body": "Unsurprising, given I qualified this post with “I’m a retard”", "score": 4, "replies": [{"body": "I think they mean literally a retard as opposed to the psuedo compliment it is here.....", "score": 5, "replies": [{"body": "No I didn't mean it as an attack on OP, just to underline that \"inflation hurts the poor\" is a retarded cliché and trying to tie into OP's tone. 😋", "score": -1, "replies": [{"body": "Oh ok.\n\nIn which case, allow me :)\n\nOP - you are an actual, literal, retard.", "score": 3, "replies": [{"body": "🤣🤣🤣", "score": 1, "replies": []}]}]}]}, {"body": "Yeah I know I am just trying to help you see what parts of your post were retarded 😅\n\nInflation won't matter if doesn't continue at this level for over 12 more months. That's when expectations may become unanchored and we could get a persistent spiral.", "score": 1, "replies": []}]}, {"body": "Poor people are also the only class not adding avocado and bacon to their subs.", "score": 1, "replies": []}]}, {"body": "What a troll", "score": -1, "replies": []}, {"body": "Maybe you will wonder with the chicken prices of 400 bucks pound. More than inflation, i believe almost 100% US will turn into 3rd world country, default on their own debt. Worst part? Citizens already struggling, now imagine with 3rd world style, those people never face that.", "score": -3, "replies": [{"body": "3rd world citizens that eat steak and lobster dinners every night", "score": 1, "replies": [{"body": "US its simply that guy who drives nice car, everyone thinks he is super rich, but in reality he lives pay check by pay check, sleep in the car and are still paying for the car..", "score": -1, "replies": [{"body": "Lmaoo and in other countries people are eating a bowl of rice for breakfast lunch and dinner barely surviving. I think I’ll take the American lifestyle", "score": 0, "replies": [{"body": "Why are you getting so emotional and misunderstanding what i am saying? I never said other countries are better than US, i never said other countries are eating better than US (fast food home) etc. I just said the reality: US have debt and mostly likely will default on their own debt, you know who is holding the biggest part of this debt? China, now, use your imagination. \n\nIf you check Forex, History, Economy, etc, you can see we are probably (not 100%, probably, ok? Government can keep kicking this BIG can for some more time) to a very big mess. US dollar its losing value daily on the last months, you know when this same thing happen? 2008 and 2018, other currencies, especially from 3rd world countries taking place on Dollar/other currency charts. In bad economys, emergent countries normally take small punch.\n\nYou can say all day internet citizens make more money than mostly of other countries, but also ALOT of people live by pay check by pay check, use food stamps always, cannot afford health care, cannot pay student debt etc. The fact of US its First world countries dont change all those FACTS.\n\nDont get so emotional, we are just commenting something in a online plataform.", "score": 0, "replies": [{"body": " 🤣🤣🤣", "score": 1, "replies": []}]}]}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|11 months ago\n**Total Comments**|44|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=scyjo6)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=scyjo6)", "score": 1, "replies": []}, {"body": "When I can no longer inflate balloons for a party that I will never go to...", "score": 1, "replies": []}, {"body": "when your condoms become 20 dollars a pack", "score": 1, "replies": []}, {"body": "Fear of societal unrest", "score": 1, "replies": []}, {"body": "well actually poor people dont suffer as much. they have 0 money in their hand so that is not going to lose any value. low middle class people who have cash stored on bank but no property or other non liquid assets will suffer most. since 100k cash does not do much when big mac meal costs 100$ \n\nOther hand if someone happen to have huge loan for house they might get into short term trouble doing payments but might be able pay whole loan in just few years if salary increase along with inflation.\n\nRight now common people have plenty of options where to store value: stocks, real estate, crypto, gold, tendies. some time ago it was just cash, gold and oldest daughter.", "score": 1, "replies": []}, {"body": "Right before the climax usually", "score": 1, "replies": []}, {"body": "Inflation matters when your spending habits change, go to grocery store and buy generic brand because labeled brand has doubled in price.  Stay home and cook because eating out has gotten too expensive.  Driving less because gas costs too much.  Declining golf trip to Vegas with buddies because you don’t want to / feel like you should spend that money.  All this means less profits for corps.", "score": 1, "replies": []}, {"body": "It matters when people think it matters. If prices went up, and buying slowed we would still need people to believe inflation is not that bad. And vice versa", "score": 1, "replies": []}, {"body": "If it “doesn’t matter” already, it’s because you have  a high paying job and/or have already established significant wealth. A vast majority of Americans are already feeling it in a significant way.", "score": 1, "replies": []}, {"body": "The moment Taco Bell dollar menu goes up to $1.25", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "sdjzqm", "created_utc": 1643240627.0, "score": 39, "upvote_ratio": 0.77, "num_comments": 75, "comments": [{"body": "The news just said that Germany is getting 85% of its natural gas from Russia. The Nordstream deal was really mindblowing. Merkel had been working with Putin in total secret to have two underwater natural gas pipelines, straight from Russia to Germany, bypassing Ukraine and Poland, where the land pipelines run now to Germany. After the public announcement, France suddenly looked at Nordstream meaning the Germans control the valve to the interior of Europe. Starting to sound like WWII all over again. There are still a lot of people that have oil furnaces and the light oil is $150 per barrel, one barrel lasting about a month during brutal cold.\n  \nThat is all it is, natural gas in the winter, maybe getting shut off, either by valves or bombs.", "score": 16, "replies": [{"body": "We still have trees to chop down n burn oh no wait that would cause pollution and melt the polar bears, in it. Least the fires from bomb blasts and rockets will keep the streets lit and warm.", "score": -2, "replies": [{"body": "Just a quick fun science fact:\n\nBurning wood is actually green energy…it’s net carbon neutral, the carbon that the wood is made of was taken from atmosphere and soil….also a rotting amount of plant/animal matter produces the same carbon as from burning (micro organisms decompose and release co2 as a waste biproduct of decomposition) \n\nThis is why biofuel was the number one carbon neutral fuel alternatives and one that had the least impact on our infrastructure and environment", "score": 3, "replies": []}]}]}, {"body": "One thing to add is the Russians may avoid attacking Ukraine during the Beijing Olympics (Feb 4-18th); as the Chinese and Russians are allies of convenience and completely overshadowing China's projection of glory would probably irk the Chinese.", "score": 26, "replies": [{"body": "So you would say an attack on Valentines Day would signal a break up instead of a love gesture?", "score": 17, "replies": [{"body": "What if they present China with gas as a Valentine’s Day present?", "score": 4, "replies": [{"body": "And some how rig China to win 4 gold medals 🏅 that day…", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I agree it would be easier but this video I just watched by a Russian military expert said that while it would be easier during winter; the Ukranian 'mud season' is not a 100% no-go for the Russians https://www.youtube.com/watch?v=gwrzophpNJA&t=3885&ab\\_channel=CISACStanford", "score": 6, "replies": []}]}, {"body": "Yeah they are suppose to be best buds. Taking away the spotlight from china would indeed sonic their hedgehog and russia might find themselves getting a nasty gift from them to celebrate new year.......", "score": 1, "replies": []}]}, {"body": "Strangehold, is that related to using your non-dominant hand?", "score": 10, "replies": [{"body": "Lmao honest accident but in hindsight the typo was probably beneficial: boosted engagement on the post.", "score": 1, "replies": []}, {"body": "Also known as The Stranger - sitting on one’s hand until it goes numb, then furiously beating off with said hand so it feels like someone else is stroking you. It’s top notch.", "score": 1, "replies": []}]}, {"body": "Half correct.  Putin must be appearing to attack Ukraine to keep oil prices from dropping while glut is creeping up.  Just needs to scare Europe into compliance a little longer and artificially inflate the price until Demand picks back up as Omicron wanes.  \n\nI don’t think he will attack, just wants to string along high prices a bit longer until he can close his oil futures contracts.  Then boom reversal.", "score": 5, "replies": []}, {"body": "positions or ban\n\nedit: thx :)", "score": 3, "replies": [{"body": "Thanks for the reminder! Added", "score": 6, "replies": []}]}, {"body": "Yea, Ukraine is sitting on huge gas reserves and is buying gas from Russia for the last 20 years. EU is trying to find alternatives for russian gas for the last 20 years, but somehow forgot about Ukraine. Yep. Put all your savings on it.", "score": 1, "replies": [{"body": "Lol it's not about \"forgot\". The Ukrainian natural gas is not super developed so it would be a costly investment to increase production there. The point is that Russia is incentivized to take the competing natural gas reserves out of the equation. If for example Ukraine were to join NATO and then develop the Black Sea gas reserves this could be severe for Russia. Also see the hesitation surrounding nordstream 2.\n\nRussia-Ukraine gas disputes is a very real issue! The wiki page has 159 SOURCES which you can read through yourself if you want to escape your bullish coping. [https://en.wikipedia.org/wiki/Russia%E2%80%93Ukraine\\_gas\\_disputes](https://en.wikipedia.org/wiki/Russia%E2%80%93Ukraine_gas_disputes)", "score": 1, "replies": [{"body": "It's a total bs. Ukraine pays billions a year for russian gas, Europe pays billions more for transit costs, EU wasted billions trying to get alternatives and get more independence, building LNG terminals and pipelines from the middle east and asia (like Nabucco or Trans-Caspian Gas Pipeline). But somehow nobody tried to develope ukranian gas reserves.\n\nThis article has nothing to do with ukranian gas reserves, its about Ukraine not paying bills and stealing european gas. And about politics.\n\nIf it were possible to develope huge gas reserves in Ukraine, it would be alredy done. ВР Statistical Review of World Energy says Ukraine has 1100 billions m3 of natural gas, Ukraine says only 450 billions can be extracted. Russian Gasprom exports 200 billions a single year. Good luck trying to replace it.\n\nA side note: ukranian president, ukranian prime minister, ukranian MoD and ukranian MoFA said there is no threat of invasion. Stop watching CNN and reading Daily News.", "score": 3, "replies": [{"body": "RemindMe! 1 month", "score": 1, "replies": [{"body": "They promised the invasion late december, then early january, then mid january, then late january, now it is february.\n\nThe whole thing is simply a stage for US-Russia and NATO-Russia negotiations, not a real thing. Even US military experts say there are not enough troops and no necessary preparations for an invasion.\n\nThere are also no reasons for Russia to invade, except they want to destroy their economy and cut all relations with the west. They will attack only if Ukraine attacks first, it was said loud and clear many times. Like it was in Georgia.\n\nWe will see.", "score": 7, "replies": [{"body": "Yeah but now the US and UK are withdrawing diplomats' families from Kyiv and Russia continues to enlarge its forces on Ukraine's border. If this is a bluff it's becoming a truly massive one. Additionally if Putin walks away from this confrontation with nothing he will look like he was bluffing/was deterred which will certainly hurt his strongman image internationally and domestically which is basically his entire image.", "score": 1, "replies": [{"body": "They estimate Russia has 100'000 soldiers on the ukranian border. They define ukranian border as an area about 300 km deep in russian territory. The majority of this troops were always deployed there. There is no massive force concentration. In comparison, Ukraine has 120'000 troops in the area around Donetsk and Luhansk. That's why all actual experts (e.g there is an article in Times) and ukranian goverment say there is no real threat. Russia said it has no intentions to invade many times, so there is no bluffing. There is no invasion force ready, there are no verbal threats to invade, so there is no image that can be hurt. It's all made up desinformation to have an excuse to sent more troops and weapons to new NATO members and Ukraine and to have a stronger position in negotiations with Russia. If Ukraine doesn't attack first, there will be no war.", "score": 3, "replies": [{"body": "this was fun to read lol", "score": 1, "replies": [{"body": "Yep. It was correct, until the president of Ukraine said they want to have nuclear weapons. Ukraine actually has all the technology and resources to create warheads and ballistic missiles, and the fact Zelensky said it means they were already working on it. The russian operation doesn't look well prepared for me.", "score": 1, "replies": [{"body": "how convenient lol", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No, they have the most ukranian coal.", "score": 1, "replies": []}]}]}]}, {"body": "CVX & XOM", "score": 1, "replies": [{"body": "I sold my XOM a month ago… freaking killing me to watch it now…", "score": 2, "replies": [{"body": "Why else would it be up?", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}]}]}, {"body": "All in drip", "score": 1, "replies": []}, {"body": "Negotiate with Iran, re-sign the JCPOA with assurances from both sides. Voila Russia loses its stranglehold on natural gas for EU.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Tell me you know ZERO about WWII without telling me you know zero about WWII", "score": 1, "replies": []}]}, {"body": "The reason Putin annexed Crimea was because there was a referendum. Crimea was Russian territory throughout most of history. Sevastopol is like embedded in history.", "score": -4, "replies": [{"body": "Russia moved troops in first, then had a bullshit \"referendum\" to post-hoc justify it. Then, to prevent any response sent more troops into the Donbass to get \"separatist groups\" that they had prepared to start a civil war, equipped them with heavy weaponry and supported them with artillery.\n\nIts no wonder that Ukraine wants to join NATO - with neighbours like that, who needs enemies.", "score": 7, "replies": [{"body": "There were a lot of polls and surveys done by western media and organisations, there are no doubts the majority voted for Russia.\n\nIt's not a political subreddit, we discuss whether you can make money or nor betting on invasion.", "score": 2, "replies": [{"body": "> It's not a political subreddit, we discuss whether you can make money or nor betting on invasion.\n\nCorrect, the whole response thread should be removed", "score": 2, "replies": []}]}, {"body": "Why do you have to mention a curse word? I was speaking historically. That is all, nothing to make someone curse about", "score": -1, "replies": []}, {"body": ">Its no wonder that Ukraine wants to join NATO - with neighbours like that, who needs enemies.\n\n\"Boris, you would betray your friends?\"\n\n\"I have to, Natasha.  My enemies won't trust me!\"\n\nj/k", "score": 1, "replies": []}]}, {"body": "That's true but it's also true that crimea is very important for controlling the resources of the Black Sea and Sea of Azov", "score": 4, "replies": []}, {"body": "Putin seized Crimea because of the Black Sea naval access it provides to Russia. They did already have some bases there. But he’s stacked it with fights jets and missiles ever since. You can see the proof for yourself right on Google maps. There’s migs at damn near every mid to large airport on the peninsula. \n\nThe fake as fuck vote was after the seizure of Crimea. Fact.", "score": 2, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 month ago\n**Total Comments**|86|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/s75ud8/small_cap_growth_stocks_are_slipping_iwo_puts/) \n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sdjzqm)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sdjzqm)\n    \nHey /u/Theodamusei, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 0, "replies": [{"body": "Not sure if still needed but: https://ibb.co/KjkfHjh\nAlso I started with 27k so my IWO gains (reinvested from August high strikes to May lower strikes) are 19k😁", "score": 1, "replies": []}]}, {"body": "How far out on IWO puts? They are kinda  expensive now.", "score": 0, "replies": [{"body": "Yeah lol because people are now recognizing they are a valuable position! I would say August expiry is unnecessarily expensive and Feb 18th expiry are too risky. So I'm like 30% in March Expiries and 60% in May 20th expiries.", "score": 3, "replies": [{"body": "Well, it’s very expensive, too much risk for my paper hands…", "score": 0, "replies": [{"body": "I'd consider calls on or just holding one of the inverse ETF's then (TZA, SQQQ, SPXU, etc.)", "score": 2, "replies": [{"body": "I am actually not so convinced the invasion will actually happen and it sounds like it was already priced when everything dropped recently. Too chickenshit to get into puts right now…", "score": 1, "replies": []}]}]}]}]}, {"body": "Last time i checked these american soldiers are busy with their tiktok 😂😂😂 before sending them to war.", "score": 0, "replies": [{"body": "Where did I say anything about American soldiers?", "score": 1, "replies": []}]}, {"body": "Ukraine vs west Ukraine is getting pretty tense", "score": -3, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "My favorite Ted nugent song   Strangehold", "score": 1, "replies": []}, {"body": "Good points, thanks for sharing. Do you think it’s really worth it to Putin knowing this might start WW3? At the very least, there would be tons of sanctions against Russia.  I think at first he thought he could get away with it with minimum collateral damage. Now that many countries (including the US) have called him out and threatened repercussions, is it still with it? They are doing just fine with natural gas exports without Ukraine.", "score": 1, "replies": [{"body": "Absolutely not gonna start WW3. The elite in both the US and Russia know a direct war between them could go nuclear and that would ruin everyone's lives. \n\nThe natural gas is admittedly only part of the story I recommend reading's Kofman's piece I linked above. \n\nEssentially, Putin has committed too many troops to pull out now; he'll look like he was bluffing or look like he was deterred and this would seriously harm his international and domestic image as a 'militaristic strongman'. Also the Russian's attempts at diplomacy in this case look intentionally uncompromising and are just trying to illicit a formal refusal from the U.S. so Putin can say \"oh we tried to do this diplomatically blah blah\".\n\nI'm not saying the war is a good idea just that as the number of Russian soldiers on the border increases the likelihood of war also increases.", "score": 3, "replies": [{"body": "I will have to keep an eye on soldier count. More troops, more puts.", "score": 1, "replies": []}]}]}, {"body": "Putin is a big pussy, all talk and blustery, he won’t do shit.", "score": 1, "replies": []}, {"body": "Retarded DD bruv.\n\nInvading Ukraine pours some oil on the fire, but it is not necessary to flow the gas as there are plenty extra pipe capacities between the Belarus-Poland pipeline, NordStream 1 and the brand new NordStream2.\n\n€9.5bln were spent on NordStream2 to go around Ukraine and move the gas straight to Germany through the Baltic sea. Gazprom paid 50% and a consortium of EU utilities of all nationalities paid the other 50%. When it’s about money you can always shake hands with the Ruskovs. Natural gas must flow, it’s our spice.\n\nThe Ukraine invasion is politically motivated. The current tightness of the gas market adds pressure on the EU, but it is not the cause nor the consequence.\n\nWinter is already here it’s already priced in, but if you want go long nat gas TTF or JKM, Gazprom, utilities, nukes. I like the palladium play from another wsb dude too.", "score": 1, "replies": [{"body": "RemindMe! 1 month", "score": 2, "replies": [{"body": "This comment aged well😔", "score": 1, "replies": []}]}]}, {"body": "OGZPY to the moon", "score": 1, "replies": []}, {"body": "Isn’t notdstream and nord2 go through the north side? \n\n\nAnd didn’t Germany / USA just say if there is an invasion, nord2 s done?", "score": 1, "replies": [{"body": "The US explicitly said that nord2 would be cancelled whereas the Germans were more ambiguous they said cancelling it was on the table but that's not a 100% commitment on their part to cancel it if Russia attacks Ukraine.\n\nThe country's foreign minister, Annalena Baerbock, told parliament that Western allies were \"working on a strong package of sanctions\" covering aspects \"including Nord Stream 2.\" But she added that she would prefer to \"continue the dialogue\" with Moscow.  \n\r \\-https://www.bbc.com/news/world-europe-60151839\n\nCancelling Nordstream2 is also not necessarily a complete game over for Russia if they end up encircling Kyiv and just decide on installing a puppet government that allows them to continue operating nordstream 1 - perhaps without fees in such  a case.", "score": 1, "replies": [{"body": "They’ve tried the latter before. Didn’t hold.", "score": 1, "replies": []}]}]}, {"body": "And then they do not attack", "score": 1, "replies": [{"body": "LMFAO bro they're actively escalating. Even since I've posted this things have gotten much worse.\n\nDeployment of logistics and medical units (neither would be used during routine military exercises only during an attack)\n\nRussian mercenaries (wagner group) have moved from central Africa to Ukraine's border:\n\n[https://www.thedailybeast.com/wagner-group-mercenaries-pull-out-of-africa-ready-for-ukraine](https://www.thedailybeast.com/wagner-group-mercenaries-pull-out-of-africa-ready-for-ukraine?ref=scroll)\n\nChechen paramilitaries loyal to Russia headed towards Ukraine:\n\n[https://twitter.com/NeilPHauer/status/1488869360429150214](https://twitter.com/NeilPHauer/status/1488869360429150214)\n\nRussia is sending troops and ships from the PACIFIC all the way to Ukraine. As it stands I'd say there's a 70% chance of invasion\n\nPutin literally wrote an op-ed in the NY TIMES saying \"Russia and Ukraine are one country\" does that sound like a guy indifferent to Ukraine joining NATO? (they absolutely will join NATO if Putin doesn't invade).", "score": 1, "replies": [{"body": "So again what did you buy ? Still not sure I’m 100 percent certain . This would start ww3", "score": 1, "replies": [{"body": "It's not going to start WW3 the point is that if Russia invades (I estimate 75% chance it does) then NATO absolutely will sanction it and Russia (and likely China as well) will retaliate with majorly disruptive cyberattacks on NATO. There was a cyberattack this week that hit Holland and German and disable a dozen fuel terminals. \n\n**Stay tuned, tonight I'm going to do a new post about why WSB should worry about Russia-Ukraine: with way more sources, angles, and details.**", "score": 2, "replies": [{"body": "Nice but why wouldn’t it start ww3 if Estonia and Lithuania are involved it’s a defense case or some shit like that", "score": 1, "replies": []}]}]}]}]}, {"body": "the defense stocks already went up quite a bit. seems like things are being priced in by now. What are your thoughts?", "score": 1, "replies": [{"body": "Lmao yeah ideally you'd have taken my advice back when the DD was posted while everyone else was still in denial. It is a bit late now to buy defense stocks. Puts on just about anything not defense/oil should still work though.", "score": 1, "replies": [{"body": "Lol. Not everyone is going through reddit daily though. Anyhow. Let’s see what boil will do the next weeks.", "score": 1, "replies": []}]}]}]}
