{"title": "Tesla Close to Surpassing BMW for Top U.S. Luxury Car Sales", "selftext": "", "id": "ryoq39", "created_utc": 1641607986.0, "score": 269, "upvote_ratio": 0.99, "num_comments": 76, "comments": [{"body": "The new BMWs look horrible....they should really go back to the last gen or maybe 2000s gen. The old 2005 M3 looked so good. The more i see Teslas the better they look imo. I just wished they had more colors for exterior and interior.", "score": 58, "replies": [{"body": "Agreed on the BMW styling.  A refresh of the E46 generation, or similar, would be awesome", "score": 13, "replies": [{"body": "Yeah that 2000s line up will never be beat. Cept 2013 X5M.", "score": 5, "replies": [{"body": "Agree", "score": 2, "replies": []}]}]}, {"body": "I was looking at getting a new car from BMW but those new m3 look aweful", "score": 4, "replies": [{"body": "Go Tesla!", "score": 4, "replies": [{"body": "That’s the plan! I want a model s, so going to take me another 1-2 years to save up for it since I don’t want to cash some my Tesla shares just yet :)", "score": 5, "replies": [{"body": "I think the model 3 Performance is a better car personally.  Have you driven one?", "score": 3, "replies": []}, {"body": "🖐💎🤚", "score": 1, "replies": []}]}]}]}, {"body": "German cars are bad and I will never again buy over engineered  german product", "score": 9, "replies": [{"body": "That is true as a previous german car owner. I think they engineer mistakes on purpose. Im looking at you audi glove box.", "score": 10, "replies": [{"body": "My Mercedes’s from the 1980s were tanks. I bought my 190E with 100,000 miles on it and sold it after it passed 300,000. I could’ve probably driven that car over half a million miles.", "score": 8, "replies": [{"body": "They dont make em like they used too old timer. Pull up a chair and lets jibberjabber.", "score": 13, "replies": [{"body": "Yes they do the 220 engines on E220 or c220 still does hundreds of thousands of miles, just check mobile.de and sort by miles, there is no one pulling Mercedes numbers of driven miles, you can find Mercedes from 2019 with 400k km", "score": 3, "replies": [{"body": "Well they did invent the car after all. I actually like Mercedes. I just like Tesla better. If i had to critique Benz tho id say their design has fallen off a bit. Some models look good but some have really awkward lines. They have also lost that dictator styling.", "score": 2, "replies": []}]}, {"body": "Ya they do but it's called toyota. A Toyota tundra did 1 million miles so Toyota purchased it off the owner to test and gave him a brand new tundra.", "score": 1, "replies": []}]}]}]}, {"body": "Long ago I learned that lesson with a Mercedes that could not even climb a mo punts in in snow with chains on! Never again.", "score": 3, "replies": []}]}, {"body": "> more colors for exterior \n\nshould happen, though it's more about quality than new colors since they'll do a new multcoat blue and a new multicoat red.\n\nBut they might squeeze out a new color in addition to the new \"colors\".\n\nNew colors coming from Austin, TX and Berlin, Germany paint shops this year.", "score": 2, "replies": [{"body": "I actually dont care about paint quality to be honest. I have no idea how to even judge paint quality. Yeah i hope we get some crazier colors tho. I hate these boring colors. Im probably in the minority tho...", "score": 1, "replies": [{"body": "I'm not just talking quality as in free from defects I'm talking quality as in 7 layers with varying types giving a deeper visual effect with some minor color shifting vs the simpler 3 layer paint currently in place.\n\nThey call it multi-coat blue and multi-coat red  and while it is higher quality it's also a totally different appearance vs the old blue and red.\n\nNot going to be easy to see online, going to have to see it in person after they become more common.", "score": 1, "replies": [{"body": "All i care about is that people see the Tesla badge so they know im ballin out. Everyone knows Teslas arent cheap these days.", "score": 1, "replies": []}]}]}]}, {"body": "But it almost does not matter how they look. If it’s not EV who cares, it’s a dead product, even if some people don’t know it yet.", "score": 2, "replies": [{"body": "Yeah but eventually looks matter. I mean im getting a cybertruck because i think it looks way better than a normal truck.", "score": 1, "replies": []}]}, {"body": "I think that’s the issue with Fremont, trying to cram high volume (and 4 models) thru an old paint shop… \n\nGet a wrap!", "score": 1, "replies": [{"body": "Wraps are very popular for Tesla’s. They protected the base paint as well.", "score": 3, "replies": []}]}, {"body": "ooo another opinion disguised as fact.", "score": -2, "replies": [{"body": "No its a fact. New BMWs look like trash.", "score": 8, "replies": [{"body": "Still wouldn't own a BMW, and still think the model 3 looks like a pair of safety scissor teslas. \n\nStill think people who don't understand the difference between subjective opinion and facts are about 30 IQ points lower than they pretend to be.", "score": -1, "replies": []}]}]}]}, {"body": "The Tesla isn’t luxury argument is irrelevant. Luxury BMW and Mercedes owners are leaving Legacy luxury German cars in droves for Tesla.  So one of two things.. A) Teslas are indeed perceived luxury b) Buyer no longer give a shit about “old school luxury”.  Either way doesn’t matter as sales talk.  What will we see?  Germans cars will start looking and trying to be more Tesla like every year… eliminating the luxury discussion all together", "score": 10, "replies": [{"body": "There’s definitely a generational gap. Old school luxury watches were a thing, but now the Apple Watch is the luxury status symbol.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Good question.  I imagine there is a large portion of those that want the BMW image but can’t afford the actual high tier true luxury cars.", "score": 2, "replies": []}]}]}, {"body": "When will Tesla no longer be “luxury”?", "score": 21, "replies": [{"body": "Once they remove the huge screens, heated seats, internet connectivity, gaming, remote mobile access, and automatic lift gate from their cars.  Also they’ll likely need to stop selling the Model S, X, and soon Roadster for over $100k.  Just a guess.", "score": 21, "replies": [{"body": "Some of those features are standard in a Toyota or a Honda, and those aren’t considered luxury.", "score": 1, "replies": [{"body": "My brand new Honda didn’t even have electric seats and they head unit seemed was from the 90s", "score": 10, "replies": []}, {"body": "Although Lexus and Acura are luxury brands.  Although In Japan Lexus and Acura are just Toyota and Honda.  A big part of the equation is price.  If you sell $90k cars you are a luxury brand.", "score": 3, "replies": []}, {"body": "Ever used the infotainment system on a Toyota? It's from 2007.", "score": 2, "replies": [{"body": "Toyota and software shouldn’t be used in the same sentence.  Toyota cannot make it any clearer that they don’t care about the quality (or lack thereof) of their work.", "score": 1, "replies": []}]}]}, {"body": "Huge screens is in lui of a hundred different buttons.\n\nHeating seats is like sleeping with an electric blanket and the houses heater off.\n\nExcessive internet connectivity is a $10/month option.\n\nSmartphone key is simpler than a real key.\n\nI agree on the automatic lift gate and autofolding seats.", "score": 1, "replies": [{"body": "You can say the same thing about any car.  You win no car brand belongs in the luxury car segment.", "score": 1, "replies": []}]}, {"body": "False, it's once they introduce ads on the screens to make the cars cheaper for the poors", "score": 0, "replies": []}, {"body": "Were these features supposed to be luxury? Lol\nEven run of the mill chevys have it\nGo look at the new Hyundai Ioniq…is that luxury too?", "score": -9, "replies": [{"body": "Those cost 44-55k, so yes?", "score": 9, "replies": [{"body": "Look..Tesla started in the luxury car pricing segment but the pricing for 3/Y (the majority of cars they sell) is the same as your average car now. The features you mentioned are not unique to luxury cars. And 40-45 is not all that much money these days for cars..", "score": 1, "replies": []}]}, {"body": "Clearly the Ioniq isn’t luxury.\n\nTouch screen is too small, it’s too slow, they don’t sell $100k plus cars.  Their app sucks, no gaming, etc.  it isn’t a clear list you can check off but if you sell a car for $150k or more your’re in.  Hyundai is the Southwest of automakers, it’s fine and it offers a number of upgrades, but it’s not and will never be Virgin Atlantic.", "score": 6, "replies": []}]}]}, {"body": "I think the market needs to narrate them as “Luxury” because otherwise people might find out that the *cost*, not the *price*, of buying+keeping one for some years is the same as that of an ICE vehicle that costs something like 20k less. And that would accelerate even more the death of ICE, so the death of non tesla brands basically. For example I live in Italy and I got a Tesla because we were looking for a 25k€ family car, but I did the math and found that it would cost us pretty much the same as a 50k€ M3 with ecoincentives and all things considered in the years to come. Now if everyone new about this…. Let’s Just say a LOT of people I know would definitely buy a Tesla instead of a regular car.", "score": 6, "replies": [{"body": "I ran some numbers. It's true for the short range. But the 10k plus you pay for long range no longer makes that the case. Basically they're being sold at pure luxury prices even accounting for maintenance.", "score": 4, "replies": [{"body": "It depends where are looking this from. I'm Italian too, and i can tell you that with gas prices that are the equivalent of 10$/ gallon, even the long range makes sense, even if it cost 70k$ (55/60k euros)", "score": 3, "replies": [{"body": "Yeah I'm American. Our fuel is 3+ times cheaper.", "score": 1, "replies": []}]}, {"body": "Yes that’s why we got the SR+ model and not LR, but as someone else pointed out with the increasing gas prices and the option to charge at home with solar panels (other state incentives) the LR is pretty much equivalent to a 30k€. Plus, last year the incentives almost doubled as opposed to when we bought it, so even the LR is around 25-30k€ equivalent, with the SR+ almost at 20k€ equivalent.", "score": 1, "replies": []}]}]}, {"body": "When the price goes under $30K.", "score": 2, "replies": []}, {"body": "Lol true. Most cars they sell are 3 or Y. Are these considered luxury cars? I guess the way Lexus RX350 is…haha", "score": -1, "replies": [{"body": "Lexus is literally the luxury vehicle division for Toyota...", "score": 6, "replies": []}]}, {"body": "When they're \"too popular\"", "score": 0, "replies": []}, {"body": "When they release the $25,000 model that they announced at battery day?\n\nThe better question may be when will Tesla become a luxury vehicle?  My answer is when they stop including blinker fluid like BMW — nobody that drives a BMW can afford the blinker fluid, and that’s when you know that you’ve hit luxury.", "score": -1, "replies": []}, {"body": "I give it 14 months in China (e.g. the less expensive EV that is rumored in China) to start deliveries", "score": 1, "replies": [{"body": "Who is making that ev, you talking nio or xpeng", "score": 1, "replies": [{"body": "I am talking about the  \"25k\" Tesla.\n\nhttps://insideevs.com/news/524282/25k-tesla-prototype-built-rumor/", "score": 2, "replies": [{"body": "Even better", "score": 1, "replies": []}, {"body": "My timeline is something like this\n\n2022-2024 Tesla lowers costs, gigacastings, 4680 batteries, in situ lithium extraction, etc.\n\n2022-2023 Cybertruck ramp, expensive models shipping first\n\n2023-2025 time frame, based on competition Tesla starts lowering prices on Model 3, Model Y\n\n2023 Tesla starts shipping the small less expensive model, e.g. model Z, first in China\n\n2024 Full ramp of small Model Z complete in Shanghai in 2024\n\n2025 Production of Model Z in the EU starts\n\n2024-2026 Based on competition, Tesla starts lowering prices on Cybertruck\n\nIn 2026 Tesla will be making 7 million vehicles per year, roughly the mix being 1.6 million Model Ys, 1.9 million Model 3s, 2.7 million Model Zs, 800,000 CyberTrucks\n\nBetween 2026 and 2030 Tesla will add two new very large factories, adding new models, and ramping to 16 million per year, hopefully they hit 20 million per year run rate at the end of 2030", "score": 1, "replies": []}]}]}]}]}, {"body": "In this thread: arguments over whether it’s the price or features that defines luxury. \n\nI submit to the comments: \n\nluxury\nlŭg′zhə-rē, lŭk′shə-\nnoun\nSumptuous or extremely comfortable living or surroundings.\n\nhttps://www.merriam-webster.com/dictionary/luxury\n\nMeaning of luxury\n\n1 : a condition or situation of great comfort, ease, and wealth\n\nliving in luxury\na symbol of luxury\nthe height of luxury\n\n2 : something that is expensive and not necessary\n\nHe spent a fortune on expensive wines and other luxuries.\nRight now a new car is a luxury that I can't afford.\nOn my salary, I can afford few luxuries.\n\n\n3 : something that is helpful or welcome and that is not usually or always available\n\n\nThe first definition is completely subjective, in that “comfort” is highly dependent on the perceiver: does that mean having beach buggy and Disney+ or a soft suspension? Does that mean rear cross traffic avoidance or touch screen angle adjustment of airflow ?   Does that mean a space shuttle like dash with a million buttons or one touchscreen with everything on auto? Does it mean the most cutting edge engineering and performance in a car or heated and cooled cup holders? We’re never gonna settle this argument so just drop it. Excess can be luxury and so can minimalism. \n\nDefinitions 2 and 3 clearly are tesla up until this point: they’re hard to get and not necessary. Once that changes and they can meet the demand and drop the price so it’s commonplace and affordable (sub 34k USD - and no the elusive off menu 3SR with localized California discounts does not count) then they’ll no longer be luxury imho. Until then, like it not, they’re hard to come by and comparatively unnecessarily vs other options in the market so ppl will refer to it as a luxury brand.  Until the market or tesla changes they’ll fit the luxury definition", "score": 3, "replies": []}, {"body": "The news that should be reported is that Tesla is only ~18 months away from outselling BMW *worldwide*. BMW sold 2.2 million cars worldwide in 2021. Tesla will be almost working at that pace by Q4 this year, and will be outright beating it in 2023. When stalwarts like BMW and Daimler start getting beaten, it's going to be a huge wake up call for everyone who doesn't follow this as closely as we do.", "score": 2, "replies": []}, {"body": "BMWs are fun, great driving experience available, nice tech, and a consistent idrive user interface, but their cars really unravel once the warranty is over. Their styling decisions lost me.", "score": 3, "replies": []}, {"body": "The sales are excellent, and anything that knocks BMW off its perch is a good thing IMO. Having dutifully said that; the Model 3 isn't a luxury car by any stretch of the imagination. I say that as a P3D owner with all the trimmings,", "score": -1, "replies": [{"body": "After owning several generations of BMW 3 series and M3s, the Model 3 feels pretty damn luxury to me.", "score": 5, "replies": [{"body": "The BMW 3 series isn’t a luxury car either.", "score": -1, "replies": [{"body": "> [The 2022 BMW 3 Series brings power and innovation together in a luxury sports sedan](https://www.bmwusa.com/vehicles/3-series/sedan/overview.html)", "score": 2, "replies": [{"body": "Sounds wonderful. The ultimate driving machine eh?", "score": 1, "replies": []}]}]}]}, {"body": "You spent $60k on a car and don't consider it a luxury car? That is well into the luxury car territory for a luxury family sedan. It may not have anything on the interior of other luxury cars, but it's competing in their price range.\n\nThere are also plenty of examples of minimalist being luxury, just look at modern multi million dollar houses on some of those travel shows, a lot of them go for the minimalist and open, but also luxury style like Tesla.", "score": 7, "replies": [{"body": ">It may not have anything on the interior of other luxury cars, but it's competing in their price range.\n\nYou said it all here. So if you consider price to be the only factor, sure you're right. For the record I paid north of $70k because I got the P3D with the Performance Pack and back then that was an extra $5k (although I did at least get free supercharging for (the) life (of my ownership of this car).\n\nRegardless, I don't consider a luxury car to be based on price, otherwise there are plenty of stripped down supercars which are very expensive that would then be \"luxury\" and they're clearly not. Luxury is about the features, build quality and to an extent brand.\n\nLike you said, the interior is barely in line with (then) a $25k Toyota - it is certainly more basic than the GTI I sold when I bought it. Not having ahead steering wheel (standard in your Audis, BMWs, Lexus, Mercedes etc. of the time) was pretty unforgivable. I still lament it this time of year as it seems to be literally the last thing to warm up I'm the car. And every time I close the trunk and it sounds like I'm closing the lid on a tin can rather than the satisfactory THUNK you get from German cars, I'm reminded that build quality wasn't the reason I bought it.\n\nDon't get me wrong, I am not complaining about the car. I love the car. I know folks here get triggered when there's constructive criticism about the Almighty. So I wouldn't go back, and at the tender age of 49, I've owned a lot of cars (some better than others) and this is the best I've owned.\n\nBut luxury? Really? Come on...\n\nThe point of the response is that the article about Tesla outselling \"other luxury cars\" is that EVs will always outsell ICE cars at a given price range. The really exciting news will be when EVs can sell for $25k - $35 and outsell the Corollas and Civics of the world.", "score": 2, "replies": [{"body": "It's not just price, but an expensive car normally is either luxury, high performance, or both. The Tesla has a minimalistic but otherwise nice interior. It has a premium sound system, infotainment system, materials, driver assist systems, etc. It's a step above a basic sedan with cheap plastic interior, crappy speakers, and minimal infotainment.\n\n\nThe model 3 probably closer to entry level luxury in terms of what you get, but something like the S and X are clearly in the mid to high level luxury competing directly with other luxury brands.", "score": 1, "replies": []}]}]}, {"body": "The luxury of the Tesla for me is the comfy seats and lots of automation and convenience through technology. I know people with Mercedes and the million buttons, led lights, and vibrating seats just don’t do that much for me personally.", "score": 1, "replies": [{"body": "Agreed, seems like a great definition. Also maybe true about the Merc, but take a look at cars that had luxury things first (they are the luxury cars):\n\n\\- Antilock Brakes\n\n\\- Airbags\n\n\\- Air Conditioning\n\n\\- Crumple Zones\n\n\\- Heated Seats\n\n\\- Cooled Seats\n\n\\- Heating Steering Wheel\n\n\\- Automatic Trunk\n\n\\- GPS\n\n\\- All Wheel Drive\n\n\\- Cruise Control\n\n\\- Cruise Control with auto braking (object detection)\n\n\\- Cruise Control with Lane Assist  (no it wasn't Tesla)\n\n\\- Independent Suspension\n\n\\- Electronic Stability Program\n\n\\- Electric Car (in 1906)\n\nMercedes invented or introduced almost all of those in their cars before anyone else, including the first Electric Car. I don't own a Merc, never have and likely never will, but the company does deserve some credit.", "score": 2, "replies": []}]}]}, {"body": "Tesla sells luxury cars now?", "score": -5, "replies": [{"body": "That's all they have ever sold, except the roadster.", "score": 2, "replies": []}]}, {"body": "Gotta love when 100% EV car co passes an old car co. Anyone have a list that compares Tesla with others?", "score": 1, "replies": []}]}
{"title": "Inflation Numbers Due Next Week 01/12/2022 8:30 AM", "selftext": "[deleted]", "id": "ryx07q", "created_utc": 1641637976.0, "score": 180, "upvote_ratio": 0.93, "num_comments": 76, "comments": [{"body": "Orange is moderately market moving news.\n\nRed Critical market moving news\n\nTimes are in ET\n\nPrevious Inflation Rate was 6.8%\n\nConsensus Inflation Rate for Dec YoY is 7.0\n\nPrevious Core Inflation Rate 4.9%\n\nConsensus Core Inflation for Dec YoY is 5.4%\n\nAnything above 7.0% will likely result in a red market. 6.9-7.0% likely normal trading conditions. 6.8% or less will likely result in a green day.\n\nSignificantly above 7.0% will likely mean the Fed will push up their tapering & interest rate timeline & get more aggressive.\n\nExpect markets to posture heavily prior to the 12th.", "score": 53, "replies": [{"body": "So load up for Wednesday!", "score": 9, "replies": []}, {"body": "This is awesome. Thanks for putting this together", "score": 6, "replies": []}, {"body": "What the hell does posture heavily mean", "score": 4, "replies": [{"body": "Hedge, take profits, general volatility. \n\nI think there are risks to the downside on this print because energy took such a hit in December.", "score": 11, "replies": []}, {"body": "If you have all calls, get shorter dated put insurance or VIX calls.\n\nNot investment advice.", "score": 4, "replies": [{"body": "I will wait for the next bull trap and buy a put", "score": 5, "replies": []}]}, {"body": "Bend over and grab them cheeks", "score": 2, "replies": []}, {"body": "Get the chair out, strip clothes, and bend over the chair in preparation for the 🌈🐻?  just my guess...", "score": 1, "replies": []}]}, {"body": "Do you have a twitter?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This post sounds like a mad scientist. December was a rally because the earnings season was great, energy is coming down and inflation slowed MoM. If inflation starts to go up we can worry but other than that no need to speculate with politics or a 0.5% difference. Just wait for the upcoming earnings season (spoiler alert it will be great).", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Which company profitability report? Of course the market is moving towards value and dividends we all saw it for the last 6 months that’s neither new nor a prediction. Chinese market will never be bullish with US being bearish forget about that.", "score": 0, "replies": [{"body": "Tell that to Chinese when ccp will force banks to buy assets to prop up the economy ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}]}, {"body": "Lol that’s why people care about core cpi. It’s not some secret thing", "score": 1, "replies": []}]}, {"body": ">Anything above 7.0% will likely result in a red market\n\nDoesn't higher inflation usually mean higher asset prices?", "score": 1, "replies": [{"body": "That’s the issue. People will react to inflation by economizing on their needs and cutting back in their wants. But if you’re talking about property, gold, silver, etc, yes the increase in inflation may incentivize production & investment in assets. But for how long until demand drops because everyone is getting priced out of the market?", "score": 1, "replies": []}]}]}, {"body": "Why red with black letters? Why not red with white letters? I can't see that crap. 😆🧐", "score": 16, "replies": [{"body": "Puts on your eyesight", "score": 28, "replies": [{"body": "They told me last year I should think about getting readers.", "score": 2, "replies": []}]}, {"body": "It’s a good point", "score": 7, "replies": [{"body": "A very good point ![img](emote|t5_2th52|4886)", "score": 3, "replies": []}]}, {"body": "Calls On Grandpas Glasses Over Here", "score": 5, "replies": []}]}, {"body": "6.9%", "score": 16, "replies": [{"body": "7.4%\n\nPlace your bets folks", "score": 15, "replies": [{"body": "8,3%", "score": 7, "replies": [{"body": "In the spirit of it most likely going up but knowing they won’t show us any real numbers, I’ll pick something random just like them. \n\n7.1%", "score": 6, "replies": [{"body": "There is no way they let 8% print", "score": 3, "replies": []}]}]}]}, {"body": "6.9420%", "score": 7, "replies": []}]}, {"body": "Classic \"sell the hype, sell the news\"...", "score": 12, "replies": []}, {"body": "Yikes! That looks like more dips…Any thoughts from anyone on what sector is going to get hit the hardest? I need to buy some puts to recoup losses from this volatile week. Anything I made, I lost the next day. Tech seems to be taking a beating. Particularly, chips stocks. Not sure if I have the balls to buy puts on a company like NVDA or Roblox, but they seem to be sliding harder!", "score": 8, "replies": [{"body": "Anything that is trading many many years beyond its earnings, doesn’t have pricing power, and isn’t a necessity will get hit the hardest. Growth tech companies that have yet to realize profitability will also get smashed. Of course … assuming numbers come in higher than expected. I believe November’s number were expected to be 5.6 but turned out to be 6.1 🤣", "score": 10, "replies": [{"body": "I found a potential target. ALGN appears to be extremely  overpriced! It doesn’t even have a projected future of catching up. Thanks for the DD. 😉", "score": 4, "replies": []}]}]}, {"body": "Inflation numbers ? \nMinus Food and Energy ?", "score": 8, "replies": []}, {"body": "Market will go back to normal next week.", "score": 6, "replies": [{"body": "I have a feeling it will bounce too. All fed minutes, rate increases and tapering got priced in with last weeks sell off.", "score": 6, "replies": []}, {"body": "When everyone is expecting a shitshow, everything less will move markets into the green", "score": 5, "replies": []}]}, {"body": "Bought SPY puts at the top yesterday, didn't realize I made a phenomenal decision until now.", "score": 6, "replies": []}, {"body": "Puts puts puts!!!", "score": 12, "replies": []}, {"body": "They're going to play 'kick the can' and say inflation stayed the same at 6.8%.", "score": 5, "replies": [{"body": "Maybe pedal some bullshit about Biden talking to farmers to reduce cost of meat and totally fix inflation lol", "score": 8, "replies": []}]}, {"body": "Highest inflation in 50 years…. Market probably gonna rocket", "score": 4, "replies": []}, {"body": "That's a nice collection of data. I would love to see that weekly.", "score": 6, "replies": []}, {"body": "Where do you find this info? Is there any easy spot to look or a doc to share lol?", "score": 5, "replies": [{"body": "[Here ya go big dog](https://stocktipstips.substack.com/p/the-daily-stocktips-newsletter-01072022)", "score": 8, "replies": []}, {"body": "Yeah.. how do you find this?", "score": 3, "replies": []}]}, {"body": "Thanks for putting this together, gives us retards a few things to mull over headed into next week", "score": 5, "replies": [{"body": "Yeah I build these every week. Expectation management is important", "score": 5, "replies": []}]}, {"body": "Where’d you get this listing? You make it? Looks like google sheets. Link pls.", "score": 5, "replies": [{"body": "Yeah I have a link but I’m not going to self promote in WSB. I think some one has already found and posted it below anyway. I just wanted to see everyone’s reaction to the news next week. I’ll post more.", "score": 3, "replies": [{"body": "Pm?\n\n\nThese events usually impact spy so trading around then can be beneficial", "score": 2, "replies": []}]}]}, {"body": "SPY puts", "score": 2, "replies": []}, {"body": "Those red days. They make me want to sell.", "score": 7, "replies": []}, {"body": "I wouldn't want jpows job right now. He's messed up bad", "score": 3, "replies": [{"body": "Indeed he’s being reactive, not proactive when it comes to inflation. He needs to raise rates which means pain. If he doesn’t raise rates it would likely mean continence of inflation and probable stagflation. Which simply means even more pain now and even more pain later as the Fed eventually takes action.", "score": 2, "replies": [{"body": "To his credit he is pretty much damned if he does or doesn't. Like the Volker days.", "score": 1, "replies": [{"body": "Well Volker to his credit had balls. Powell’s going to have to find them. The more he drags his feet the more peoples lives will be destroyed.", "score": 2, "replies": [{"body": "Both will be remembered for being late. I don't think either really know what they're doing . Powell is an attorney not an economist.", "score": 1, "replies": []}]}]}]}]}, {"body": "Inflation numbers that reflect what actually matters? Nah but them TVs tho", "score": 2, "replies": []}, {"body": "Think it will be above 7%.", "score": 1, "replies": []}, {"body": "Inflation priced in now", "score": 0, "replies": []}, {"body": "spicy", "score": 1, "replies": [{"body": "Lol I just noticed Powell is testifying on Tuesday 🤣. Retail sales will be interesting too. They’re expected to rise 0% MoM.", "score": 3, "replies": [{"body": "now im thinking of opening a put and a call on SPY for tuesday.", "score": 3, "replies": []}]}]}, {"body": "So all in VIX calls this week.", "score": 1, "replies": []}, {"body": "Are these times in EST?", "score": 1, "replies": []}, {"body": "1/14 puts to print massively", "score": 1, "replies": [{"body": "Same", "score": 1, "replies": []}]}, {"body": "7.2%", "score": 1, "replies": []}, {"body": "What site has this schedule ?", "score": 1, "replies": []}, {"body": "What's day's", "score": 1, "replies": []}, {"body": "Just one thing to add. No matter if inflation is 7.1% or 6.9%, JPOW will not crash the economy. He is a person with a job and a printer. He doesn't want to be remembered as the one who destroyed the market. We'l seel SPY 500 sometime no later than the Fall maybe sooner. Earnings are good,  economy is doing well. In the next few weeks, focus will shift from Fed to economy which is generally doing well. If there is a big dip next week which I doubt,  I'm gonna buy some calls no question. But again, remember the vast majority of stocks are way way down from recent ATH. Everyone is predicting a 10% correction not realizing the S&P 500 is just the S&P 5 and Nasdaq 100 is Nasdaq 10.", "score": 1, "replies": []}]}
