{"title": "Alaska airlines vs Boeing puts", "selftext": "Everyone is focused on Boeing puts, but no one here mentioned anything about Alaska airlines. Do you think the price will go up or down? I have a feeling that Alaska puts will be more profitable since no one is highlighting anything about it. This is just a personal opinion, I'm not a financial advisor, this is to discuss the news about the airlines and its stock price, trade at your own risks. ", "id": "191b8i2", "created_utc": 1704684278.0, "score": 51, "upvote_ratio": 0.76, "num_comments": 98, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 year ago\n**Total Comments**|2|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "BA calls at open", "score": 49, "replies": [{"body": "Depends on the time frame. BA and the market in general likely is in a down trend. You can squeeze a few bucks out of them if you sold them today especially with IV and theoretical values being so ridiculously high.", "score": 3, "replies": []}, {"body": "This is bullish news. People haven't learned the way the stock market works after all these years.", "score": 6, "replies": []}, {"body": "Short puts at open", "score": 2, "replies": []}]}, {"body": "Boeing Puts is crazy. There is no way this one incident had a sustained impact. There will be panic selling tomorrow and I will be buying Calls. I also don’t see how this affects Alaska Airlines at all.", "score": 36, "replies": [{"body": "Alaska airlines just cancelled 170 flights", "score": 9, "replies": []}, {"body": "If there's panic selling, why are you buying calls? Just curious, shouldn't the price go down?", "score": 1, "replies": [{"body": "Pretty sure he means buying calls after the panic selling.", "score": 13, "replies": [{"body": "Yes because determining when the panic selling has stopped is really easy. A stock usually tells yous when the selling has stopped and when it will go up again lmao. Good luck catching the falling knife.", "score": 14, "replies": [{"body": "Don't reply to me.  Reply to the guy who suggested this strategy.", "score": 8, "replies": []}]}, {"body": "That's pretty smart actually, I bought puts for tomorrow and I will see how much profit I make, then after this week, I will probably be buying calls too", "score": -5, "replies": [{"body": "When did you buy puts for tomorrow?", "score": 1, "replies": [{"body": "I bought it at like 4 PM today", "score": -8, "replies": [{"body": "OP you are regarded.", "score": 14, "replies": []}, {"body": "It's still an order, but will be fulfilled tomorrow when market opens, I bought 235.7 puts", "score": -11, "replies": [{"body": "That’s silly.  How can you possibly know what the premium will be?  It either won’t be filled or you’ll overpay.", "score": 17, "replies": [{"body": "[deleted]", "score": -15, "replies": [{"body": "I cant figure out if this is a joke or if this guy really belongs here", "score": 40, "replies": []}, {"body": "I don’t understand what you mean by that.  How would the order time be taken into account?", "score": 4, "replies": [{"body": "Like if the orders are fulfilled in a sequence by their time. Like if someone ordered puts now and I ordered it in the morning, mine will be processed first. Please correct me if I'm wrong, this is the first time I buy options during a holiday", "score": -2, "replies": [{"body": "Dude. Jesus Christ.", "score": 5, "replies": [{"body": "Just correct me if I'm wrong lol", "score": -3, "replies": [{"body": "You are wrong", "score": 8, "replies": [{"body": "Thank you for your input.", "score": 2, "replies": [{"body": "the short answer is no they're not gonna save your spot and fill your order for the price you bought puts at this morning. the prices will reflect this come market open and your order won't get filled at the price you wanted", "score": 3, "replies": [{"body": "Thank you so much for the explanation. That makes sense. I'm still learning", "score": 1, "replies": [{"body": "Yeah, all you did is queue an order to open up at 9:30AM tmr, which will instantly be competing with all other orders at the same time. The system doesn’t care if you put it in at Friday at 7PM or Monday at 9:29AM, it’s all the same. \n\nI am unsure of the mechanisms behind what orders get filled, but I suspect it has something to do with your brokerage.", "score": 1, "replies": [{"body": "The timing is mostly irrelevant here anyway.  It’s the fact that these options will open at a vastly different price than he ordered them for.", "score": 3, "replies": []}]}, {"body": "Think about it.  It would be insane if they had an obligation to fulfill your option orders on Monday for whatever price they were last Friday.  It would be like going back in time to buy stocks after you already knew where they were going.  BA is already down 7% premarket.  We would all sell everything we own and buy last Friday priced puts and be billionaires.", "score": 1, "replies": []}]}]}]}]}, {"body": "Without going into a lot of detail, things are more complicated than that. You really shouldn’t be messing around with options given that you clearly don’t understand how orders are filled.", "score": 2, "replies": []}]}]}, {"body": "Don't buy if you don't understand orders/premiums/Greeks. If you feel the need to gamble go to a casino.", "score": 3, "replies": []}]}]}, {"body": "Please post the loss porn when your strike price gets set after the dip and Monday after noon it jumps back up.", "score": 4, "replies": [{"body": "Sure, I will have to go to Wendy's and use their wifi after becoming homeless, but I will make sure to post it before I also sell my phone to have something to eat.", "score": 1, "replies": [{"body": "Checking in, did you go through with your order?", "score": 1, "replies": [{"body": "It didn't go through, it was pending, I canceled it already because the option was up 2200% and the current price was 7$ per contract and I was asking 0.38$ price limit. Lesson learned, but I didn't lose any money whatsoever.", "score": 1, "replies": [{"body": "Good to hear", "score": 1, "replies": []}, {"body": "What I did was wait for the dip this morning.  Bought 100 shares to ride for a few months. Then for a few $220 calls for this week at $8.95 and some $240 calls for next week at $2.51.   With the FAA putting out guidelines for inspection this morning, this hopefully becomes a minor issue and we are back in the $250s in a few weeks. \n\nThis is the way…", "score": 1, "replies": []}]}]}]}]}, {"body": "You definitely belong here", "score": 2, "replies": []}, {"body": "Should probably filter it by volume. Wouldn’t the brokerages make more with processing fees?", "score": 1, "replies": [{"body": "Should I cancel the order to buy these puts? Am I already late to the party?", "score": 1, "replies": [{"body": "You’re not even invited to the party. Cancel.", "score": 2, "replies": [{"body": "Well, I learned something new today lol, canceled some of the puts that I bought, kept some for the end of the week to see, I'm still learning:)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You’re an idiot", "score": 1, "replies": [{"body": "At least I haven't lost any of my money lol", "score": 1, "replies": []}]}]}]}]}, {"body": "How's your puts looking? May get 230 calls today", "score": 1, "replies": []}]}]}, {"body": "lol", "score": 2, "replies": []}, {"body": "No, I mean after it takes a big dip, I would buy calls. Of course you have to guess when it’s mostly stopped falling but I’m betting it’s all nothing and bounces back to the original price in a week or two at most. \n\nI just think that it’s too late to buy puts. Pre-market trading has already dropped the price most of the way it’s going to go.", "score": 2, "replies": []}, {"body": "Everyone is bearish. Smart contrarian folks will bid this to oblivion.", "score": 2, "replies": []}]}, {"body": "172 people died bro. Wymmmmm", "score": 1, "replies": [{"body": "Who died? As far as I know no one died", "score": 1, "replies": []}]}]}, {"body": "Definitely BA calls at open, Boeing stock price is already at $230 from $249 on Friday after market. I think the price will keep tanking pre-market maybe stabilize EOD then buy calls.", "score": 14, "replies": []}, {"body": "Just saw a story that they cancelled 179 flights. Alaska is probably the better play", "score": 35, "replies": [{"body": "Boeing is going to owe airlines compensation or face a lawsuit.", "score": 23, "replies": [{"body": "They just buy out a few people at all the executive agencies, then lobby key lawmakers to fuck off.\n\n\nWorks everytime.", "score": 13, "replies": []}, {"body": "No they will sell more airplanes. No refunds or exchanges. You can only buy newer better planes.", "score": 5, "replies": [{"body": "Please run me through your logic.\n\nYou buy plane type A from a company X. The plane ends up destroying your margins. \n\nSo you would buy plane type A+ from company X for more money, instead of buying a different type of plane from company Y?", "score": 1, "replies": [{"body": "If I remember correctly airbus has a backlog of orders…so if you want a plane today you buy from who will get you one today…Boeing.", "score": 3, "replies": [{"body": "Boeing has a backlog of 5,866 planes as of November 2023.  78% of the backlog, 4,590 planes, are 737 NG/MAX planes. \n\nAirbus has a backlog of 8,014 planes as of November 2023.", "score": 2, "replies": []}, {"body": "Or buy a used Airbus?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "the time to buy puts was last Friday", "score": 24, "replies": [{"body": "What if I bought puts today's morning? I know that the order is not fulfilled yet because the market is closed, but will I ever profit?", "score": -18, "replies": [{"body": "50/50, lose money or theta crash", "score": 12, "replies": [{"body": "Theta gang will gape OP like the new guy in the prison shower either way", "score": 3, "replies": []}]}]}]}, {"body": "Boeing is actually a SaaS play now. If airlines don’t reup their subs then planes fall out of the sky. Planes not on the latest version? Fall out of the sky. Didn’t read the patch notes? Fall out of the sky", "score": 7, "replies": []}, {"body": "Next Boeing opens up manufacturing in China, stock price goes up, and the jet you fly in is made in the same factory as half of the wish.com crap.", "score": 3, "replies": []}, {"body": "Depends on what Boeing is contractually obligated to payout contract wise to airlines for these inspections/reduced usage. Anyone read the fine print?", "score": 2, "replies": []}, {"body": "Just posted this", "score": 2, "replies": []}, {"body": "Spirit Aeorsystems is down. 20% pre-market lol", "score": 2, "replies": []}, {"body": "# Wait, you’re not a financial advisor?", "score": 2, "replies": []}, {"body": "Boeing its taking a motherfucking beating on premarket.", "score": 2, "replies": []}, {"body": "Also buy the dip on BA because we have seen this exact thing in the past (and nobody died this time) with a plane accident, their stock plummeted, but then time goes on everyone forgets and the price goes back to normal and lots of people get rich", "score": 2, "replies": [{"body": "How long did it take for it to go back up though?", "score": 1, "replies": [{"body": "It varies after each incident but it is a longer play. I could see this one lasting a month or two.", "score": 3, "replies": []}, {"body": "This broski is full of it.  Before the first 737 Max crashed in 2019 $BA was trading above $400/share.\n\n**It's literally never recovered.**", "score": 2, "replies": []}, {"body": "Imo 5-6 months for it to fully recover, but I could be wrong", "score": 1, "replies": []}]}]}, {"body": "UA and LUV the plays.", "score": 1, "replies": []}, {"body": "It should go down a minimum of 5%... just a opinion", "score": -3, "replies": [{"body": "Already down 7 in pre", "score": 2, "replies": []}]}, {"body": "Max 9 is brand new so it’s certainly not a big part of their fleet. Pull back but no cliff", "score": -1, "replies": [{"body": "Except the MAX is the future of their narrow body fleet…which is the largest portion of the commercial aviation market", "score": 5, "replies": [{"body": "Yea that’s true but it will take 6 years to get there. Now this will probably make it 7 years. It takes a long time to swap out planes is my point so income generation wasn’t based on this plane this year. I fly all the time was on two max 9 this year. 10 max8 and a lot 757’s.", "score": 1, "replies": []}]}]}, {"body": "How does one make a put?", "score": -5, "replies": [{"body": "Buy a put if you expect it to go down. Sell a put if you think it won't.", "score": 5, "replies": [{"body": "Or sell a call if you think it will go down. Buy a call if you think it will go up\n\nSame thing (except if you are selling, puts have natural downside skew over calls so it would be more expensive and hopefully overpriced). \n\nSo if you sell a naked put or a ratio spread or a butterfly, statistically you have a higher probability of profit if BA doesn't move as *much* as everyone *thinks* it will.", "score": 3, "replies": []}]}]}, {"body": "When that first 737 max 8 crash in 2018 Boeing dropped 24$ the next trading day.  The price before the drop was $346.  So around a 5% drop.  I don’t know how bad tomorrow’s drop will be.", "score": 1, "replies": []}, {"body": "Save with the A320 airbuses and merger inbound is the play", "score": 1, "replies": []}, {"body": "Puts on $SPR...they're the ones who caused the problem.", "score": 1, "replies": []}, {"body": "BA is just back to last month price. It'll easily come back up.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sir, this is a short term play", "score": 1, "replies": []}]}, {"body": "Hands up!! You are going to jail for providing illegal financial advice!", "score": 1, "replies": []}, {"body": "Can’t wait to see what OP pays for puts at open ![img](emote|t5_2th52|33495)", "score": 1, "replies": [{"body": "The order didn't get fulfilled, I canceled the order and I didn't lose any money", "score": 1, "replies": []}]}, {"body": "SPR puts y'all. They the ones who forgot to tighten the bolts or whatever.", "score": 1, "replies": []}, {"body": "Spirit makes the part that fails. SPR would be my trade", "score": 1, "replies": []}, {"body": "Remember, AA has a bad maintenance reputation.\n\nThe biggest was that jerkoff A&P who pencil whipped greasing the acme nut and killing everyone on a flight a few years back.", "score": 1, "replies": []}, {"body": "Them Boeing puts gonna make ppl rich on god", "score": 1, "replies": []}, {"body": "The plane crash", "score": 1, "replies": []}]}
