{"title": "What’s your favorite ARK fund and why?", "selftext": "I’m looking at adding one of the ARK funds to my portfolio because they look promising, I like the tech focus, and the returns seem to be solid. I’d just like to hear others opinions on why they chose one over the other, and their thoughts over the funds in general? I have looked at each funds top 10 holdings but to be honest I’m not entirely familiar with each company listed. The three funds I think I’m most interested in are ARKQ, ARKG, and ARKK. My current holdings are:\nVOO: 35%\nQQQ: 3.6%\nBABA: 21%\nMSFT: 19%\nV: 12.5%\nPLUG: 7.5%\nSPHD: 2.5%\n\nI’m looking to steadily increase my position in VOO/QQQ and then add in one of the ARK funds. I plan on holding long term (5-10+ years) and am willing to take on a moderate level of risk. Thanks in advance!", "id": "i8n3wd", "created_utc": 1597269136.0, "score": 47, "upvote_ratio": 0.92, "num_comments": 46, "comments": [{"body": "I bought about 10% of my Roth in ARK. Of that it's 50% ARKK, 25% ARKW, 25% ARKF. There's overlap with ARKK and ARKW but I wanted both. If I had to pick one it's ARKK but you can't go wrong with 2", "score": 13, "replies": [{"body": "Is the last letter representative of a different sector?", "score": 2, "replies": [{"body": "Yea and K is more of their all around ETF and the most diversified. If you're only going with one ARKK is the one to pick", "score": 17, "replies": [{"body": "I typically don’t do ETF’s but ARK has been looking promising.", "score": 7, "replies": [{"body": "I recently went with them and QQQ", "score": 6, "replies": []}]}]}]}, {"body": "i usually always try to keep aside $4000 for VGT and VCR, since i love tech and blue chip quality \n\nbut if i had 2k remaining in my roth IRA, should i do 50% ARKK and 50%ARKF? \n\nI really do like the conception of ARKW, i feel that next generation internet is very promising.", "score": 1, "replies": []}]}, {"body": "ARKW- its got a good mix of blue chips and speculative high growth stocks.", "score": 13, "replies": [{"body": "I like ARKW as well - it holds a lot of smaller cap spec plays that I wanted to own, but I don’t  have the capital to really fund them all individually in any kind of sensible way - it’s just so much simpler contributing to arkw instead.", "score": 7, "replies": []}, {"body": "IMHO, the high expense ratio is not worth it for this one. You can get SP500 exposure for dirt cheap.", "score": 0, "replies": [{"body": "And dirt cheap SPY gains", "score": 4, "replies": []}, {"body": "Which ticker?", "score": 2, "replies": [{"body": "VOO. It has a low expense ratio, check it out.", "score": 1, "replies": [{"body": "Dope, thank you!", "score": 2, "replies": []}]}]}]}]}, {"body": "I think ARKF will give you the most bang for your buck. The world is going cashless so I think this one has a lot of room for growth. The default best one is ARKK.", "score": 11, "replies": []}, {"body": "ARKK if you want one. I like ARKF as well and ARKW is great but I do not hold it. Look at their current holdings and sector before purchasing. They are all a little different", "score": 5, "replies": []}, {"body": "FWIW, ARK funds is 10.6% of my portfolio. ARKK 6.7% and ARKF 3.9%.   I like fintech and liked the diversity of ARKK over ARKW. ARKW I'm pretty much covered doing individual picks of my choice but I really like having some diversity with ARKK and a buffet of fintech with ARKF, with Paypal sprinkled on it.  Even if SQ overlaps in ARKK and ARKF. It gave me peace of mind when I sold my SQ a few days ago.  I also sold my TSLA and it's nice to have some exposure to them via an actively managed ETF.", "score": 4, "replies": []}, {"body": "If only one it’s K. If you want 2 add G.", "score": 8, "replies": []}, {"body": "I like ARKK more than ARKW because it is more diversified, so more safe and stable.", "score": 3, "replies": []}, {"body": "PRNT slowly moving, gonna try getting in before it hits 25", "score": 3, "replies": []}, {"body": "Just buy tsla.", "score": 5, "replies": [{"body": "I don’t get why people say this. Tesla is 9.6% of ARKK. AAPL is 13.6% of QQQ and 6.6% of VOO. Would you tell people interested in buying those ETFs to “just buy AAPL” instead?", "score": 4, "replies": [{"body": "Ark is more of a sector specific etf where people are trying to beat the index. At least the qqq or voo crowd are just seeking to match the index. Most ark investors buy it for Tesla but are scared at it's fluctuations. In reality, if you are going to try to beat the index, then go for it and don't pay an unnecessary expense ratio. Once tsla splits I think even less people will buy ark since now they can afford tsla shares.  Short ark.", "score": 1, "replies": []}]}]}, {"body": "Reduce baba, get more qqq\n\n\nPersonally i dont trust some of the ark, especially if they have tsla. Otherwise i suggest arkf", "score": 2, "replies": []}, {"body": "I was recently holding ARKW, ARKG, and ARKF, but decided to consolidate to just ARKK and ARKF. ARKK is pretty much a combination of the top holdings in W & G. K+F provides great diversity in investments 👍🏼", "score": 2, "replies": []}, {"body": "Ark funds are super sweet but they are actively managed with high fee of 9 bases points. Basically 1% fee which nowadays is ridiculously high compared to qqqs which is 2 bases points. Arkk has done extremely well the past two years but before then, it was pretty dismal. So I’m not sure if a new manager took over the fund or what. But if that manager leaves or there is a change in fund management, that’s a risk as well. Qqqs are outstanding for long term.", "score": 2, "replies": []}, {"body": "What are ARK alternatives available in EU?", "score": 2, "replies": [{"body": "Maybe SMT 🤔", "score": 1, "replies": []}]}, {"body": "ARKF.\n\nThe others are too entangled with Tesla.", "score": 2, "replies": [{"body": "You don't think Tesla will be successful long-term?", "score": 2, "replies": [{"body": "Not the guy you are asking but I think Tesla will be successful but whether it will be successful enough to warrant the share price is a big question mark here.\n\nImo Square and PayPal are both off to a huge market with a lot of potential, both are safer play than Tesla.", "score": 5, "replies": [{"body": "They rebalance portfolio.  So it doesn't matter that much if tesla crash later.  Only thing matter is if it can spike as high as possible before it crash.", "score": 1, "replies": []}]}, {"body": "I think it's way to overpriced right now.", "score": 1, "replies": []}]}]}, {"body": "I like their funds for the most part. I just wish they would reduce their Tesla exposure a tad.", "score": 2, "replies": []}, {"body": "Even split in my portfolio. ARKF looks super promising though.", "score": 1, "replies": []}, {"body": "ARKW has been performing better than ARKK, but I prefer ARKK coupled with ARKF personally.", "score": 1, "replies": []}, {"body": "I'm in ARKK.", "score": 1, "replies": []}, {"body": "What about ARKQ (robotics)?  That interests me most.", "score": 1, "replies": []}, {"body": "We can't buy it in EU sadly, just buying what's on their purchase list.", "score": 1, "replies": []}, {"body": "ARKK feels like a sampler platter, but I want to have a little bit of all of them.", "score": 1, "replies": []}, {"body": "Does anyone know why ARK funds are loading up on Lending Club (LC)?", "score": 1, "replies": []}, {"body": "I’m in ARKW I love it, great ETF for future innovation in the Internet and (IoT). Managed by Catherine Woods she is great at what she does! ARK Invest is a amazing place to invest for the future.", "score": 1, "replies": []}, {"body": "I went with arkw.  I'm not sure how genomics is being moneterize and I'm not sure about the future of 3d printing.\n\nAll of those ark etf have around half overlap.  So I don't think it matter that much.", "score": 1, "replies": []}, {"body": "ARKF", "score": 1, "replies": []}, {"body": "None.\n\nLook at the holdings and see if the companies' valuations make sense and you believe in them fundamentally, don't just look at the stock price performance.", "score": 0, "replies": [{"body": "Do you have any alternative suggestions? I looked at the funds and there is a lot of overlap between them. One of the funds at one point had a small holding in the now bankrupt Wyre-card. I like the idea of what they are doing, but feel like chasing them now will end in disappointment.", "score": 1, "replies": [{"body": "I'd choose more boring suggestions right now, since I think it's reasonable to expect a correction.  They've had a great run, but everything they have in most of their portfolio has seen it's valuations really stretched, and I don't see this as sustainable long term.  We don't know when a rotation into other sectors is coming, or a correction, but all of the ARKs are really exposed to one due to their valuations.  Basically you're buying into the most overpriced stocks in a market that had it's best quarter since the 1930's.", "score": 0, "replies": []}]}]}]}
{"title": "College loan money for Tesla calls !", "selftext": "[removed]", "id": "i8449l", "created_utc": 1597193888.0, "score": 37, "upvote_ratio": 0.8, "num_comments": 45, "comments": [{"body": "[deleted]", "score": 61, "replies": [{"body": "Pics of him at his McDonald's job in a year when these don't print.", "score": 4, "replies": []}, {"body": "What he said!", "score": 1, "replies": []}]}, {"body": "Your post has been removed because it's retarded", "score": 30, "replies": [{"body": "This entire sub is fucked.", "score": 7, "replies": []}]}, {"body": "These posts aren’t real right?  No one is this fucking dumb", "score": 24, "replies": [{"body": "I'm sure at least 60% are real", "score": 12, "replies": [{"body": "I’ll up you to 75% real", "score": 6, "replies": []}]}, {"body": "The allure of \"free\" money is a hell of a drug.", "score": 6, "replies": [{"body": "I mean. If the split happens before his semester starts he’ll probably double his money, Robinhooders are fuckin morons, think they’re buying the dip.", "score": 2, "replies": [{"body": "Wait I’m not?", "score": 1, "replies": [{"body": "You sure are little Timmy. You sure are. (Pats on the head)", "score": 2, "replies": [{"body": "Proceeds to leverage house as collateral", "score": 3, "replies": []}]}]}]}]}]}, {"body": "The retard goes to NJIT based on his post history.  It is not a particularly prestigious or difficult school to get into.  I think he may actually be autistic.", "score": 24, "replies": [{"body": "gah damn", "score": 7, "replies": []}, {"body": "Omg. NJIT. Blast from the past. I went to rutgers", "score": 4, "replies": []}, {"body": "Jersey Gang Gang! None of us clearly majored in finance", "score": 2, "replies": []}, {"body": "It’s a top 50-60 institution for in state ROI, kindly go fuck yourself", "score": -3, "replies": [{"body": "Wait you get returns from school? I thought only stonks make you money", "score": 1, "replies": [{"body": "Yeah you get a piece of paper with your name on it which can use as a napkin or a thin plate", "score": 1, "replies": []}]}]}]}, {"body": "Bull fucking shit", "score": 8, "replies": []}, {"body": "If there was ever an argument for student loan forgiveness...", "score": 9, "replies": []}, {"body": "Pics or ban", "score": 7, "replies": []}, {"body": "I believe u", "score": 5, "replies": []}, {"body": "If it is a Federal loan, technically you committed fraud. Good luck with that.", "score": 6, "replies": [{"body": "Eh... fuck the feds!", "score": 2, "replies": []}]}, {"body": "I’m just saying if I would’ve done the same with Amazon when I was in college I would be a millionaire now so 🤷🏻‍♂️", "score": 3, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/jdawg252 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I've seen this happen before.", "score": 2, "replies": []}, {"body": "Really hope you bought them yesterday...", "score": 1, "replies": []}, {"body": "In contrast, when I was in college, I felt like a hopeless sinner after spending the few morsels worth of a loan refund on a vacay at punta cana. \n\nTimes have changed... The evolution to galaxy brain is complete.", "score": 1, "replies": []}, {"body": "You can’t ride the short bus anyways cause of Corona", "score": 1, "replies": []}, {"body": "This is the WAY", "score": 1, "replies": []}, {"body": "Post evidence in the form of an image or fuck off to CHAZ you Ukrainian gypsy", "score": 1, "replies": []}, {"body": "Bet on tesla? Sugar daddy musk will support u.", "score": 1, "replies": []}, {"body": "Good news is no more college either way. Either you lose it all and get kicked out or make enough to retire. Absolute win win", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "Ban", "score": 1, "replies": []}, {"body": "This post is so flaired correctly.", "score": 1, "replies": []}, {"body": "Ban?", "score": 1, "replies": []}, {"body": "If I would of done this when in college and bought AMD at $3 I’d be driving hookers and banging lambos, instead I am suffering the wrath of The KGB vaccine today.", "score": 1, "replies": []}, {"body": "Ban no pics", "score": 0, "replies": []}, {"body": "that's a better investment than the weed i spent my student loan money on.", "score": 0, "replies": []}, {"body": "Can you at least say your strike/date?  I have 8/14 $1600 and $1700's", "score": -2, "replies": []}]}
{"title": "JPM and Silver", "selftext": "So I've watched a few videos trying to explain the relationship that JPM has with silver, and their naked shorting of it while growing a massive stock pile. I don't understand, though, how this actually works and where it eventually leads to. Could someone explain this in simple but detailed terms?", "id": "i88cyy", "created_utc": 1597211878.0, "score": 30, "upvote_ratio": 0.92, "num_comments": 40, "comments": [{"body": "Several banks have been shorting silver because it was a reliable way to make a shit ton of money every quarter and no one ever got delivery because it was all wink wink nod nod bullshit. Bear Stearns was one but they were a gay bear and died. JPM bought their shit metals desk which had a giant naked short position. They had to buy a bunch of silver to maintain that short position and not be naked because that was the rule, and they even had to get an exception to do it while they built it up, so they bought 150 million ounces over the next 8 years after 2011. Then oil went negative and broke lots of shit, so the futures markets actually have to deliver. Then the fed started indicating that they were going to cap yields on bonds and let inflation run. This caused an increase in people actually taking delivery of silver and gold which are hedges against that shit. They had to deliver 30 million ounces in july bringing their stack to 120 mm ounces. Now that they have less, they cant short as much.\n\n&#x200B;\n\nThey either have to unwind their shorts (line goes up) or lose the stack to deliveries in which case they lose the shorts anyways (and line goes up again) and lose a bunch of money either way.\n\nIn the meantime there will be VOLATILITY with a capital everything until september, when there is an astronomical amount of silver standing for delivery. Then line might stop working but actual price of actual metal (of which there is very little compared to how much they say there is) will go up.\n\n&#x200B;\n\nAlso the entire market is fucked and we have the largest GDP to debt ratio since world war 2 and shit is about to go crazy. If they do implement YCC all the lines will go up like hella, but many up lines will be worth less than one regular line now.\n\n&#x200B;\n\nIf they dont do it.... All lines go down.. for a long time\n\n&#x200B;\n\ntldr inflation, supply issues, market manipulation, were fucked, buy silvers.", "score": 50, "replies": [{"body": "> Bear Stearns was one but they were a gay bear and died.\n\nAll I understood but it was enough.", "score": 23, "replies": []}, {"body": "This was impressive, great explanation in WSB autist terms", "score": 8, "replies": [{"body": "Thanks I blacked out and when I woke up it was posted! The Lord works in mysterious ways!", "score": 4, "replies": []}]}, {"body": "Soo silver will go up :D ???", "score": 4, "replies": [{"body": "Yes. It might wiggle and squirm a little bit first though.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Agreed, wouldn't a lack of enough actual deliveries in September undermine the main thesis", "score": 3, "replies": [{"body": "Do you happen to know the exact date these deliveries take place? Wasn't this the main argument against investing in a SLV etf in the first place? We were never sure if there was enough physical supply in the event that everyone wanted deliveries", "score": 3, "replies": []}]}, {"body": "Paas calls, or buy it outright.", "score": 2, "replies": []}, {"body": "I think line might break if it happens, but I am mostly physical and in miners. Miner calls printed me a few gs before friday but got nuked along with all the other shit after. partial recovery today, I locked in my basis and some profit.", "score": 1, "replies": []}]}, {"body": "- Why was 'banks shorting silver a reliable way to make a shit ton of money'? \n\n\n- Also, was it something only banks coukd do... if it's so reliable, wouldn't everyone do it?", "score": 3, "replies": [{"body": ">if it's so reliable, wouldn't everyone do it?\n\nDo you have a dozen tons of silver lying around per chance?", "score": 3, "replies": [{"body": "Obviously he means on a smaller scale.", "score": 2, "replies": [{"body": "But you need a massive amount to bring the price down just by yourself. On the smaller scale I guess your best bet would be to predict the right moment and short it yourself.\n\nOr just use my retarded day-trade strategy: watch the line all day and when it starts going down faster than normal do a short position and pussy out with small profit once you see a green candle.", "score": 4, "replies": []}]}]}]}, {"body": "This is the best explanation I've read so far.", "score": 2, "replies": [{"body": "Thank you I have been autistically deep diving this shit since at least March. I was thinking about starting a jewelry biz after buying an engagement ring last year and that led me to find out how the entire PM market works. I still know relatively very little but this part is fundamentally obligated to happen unless magical magical things happen.", "score": 3, "replies": []}]}, {"body": "if entire market is fucked. y its still going uppies ?", "score": 1, "replies": [{"body": "In one way, PM is an inverse to the market. The oddity is that the USD is still “rising” when we all know it’s falling or moreover should be falling based on the ol munnyprinter2000 going brrrackakaka every few weeks...", "score": 1, "replies": []}, {"body": "Inflation from trillions of brr being forced into the market makes lines go up. The alternative is all lines go down all the way. When they announce YCC on the 16-18 sept, they are committing to trillions more. The markets will either crash in nominal terms or real terms. Lines go up is just more politically sexy.", "score": 1, "replies": []}]}, {"body": "All I took from this post was “longer lines”, \n\nfuck it, I’m in!", "score": 1, "replies": [{"body": "Longer lines = Boners", "score": 2, "replies": []}]}]}, {"body": "They short their own ETF my dude. So they make money while Silver pumps with their long positions and once they are ready to dump they hedge with massive short positions against silver and their own fukin ETF. \nThey dump the stock and massively underbid their huge silver stockpile to cause panic selling. \n\nIts fuckin glorious tbh", "score": 33, "replies": [{"body": "How is that not textbook market manipulation?", "score": 14, "replies": [{"body": "They've been under investigation for a few years for it. I think some people may have gotten in trouble but Trump's administration has been super hands off about investigating/taking legal action against financial institutions, at least compared to Obama's administration.", "score": 7, "replies": [{"body": "Tbh I don't think Obama was hard on JPM for this either", "score": 6, "replies": []}, {"body": "You mean your boy Obama who took over right after the GFC and made sure nobody went to jail? Suck his a dick a little more why don't ya?  \n\n\nNone of the politicians care about you.", "score": -2, "replies": [{"body": "Jesus Christ dude. I mean literally, if you look at the data, Trump's admin has prosecuted far fewer financial crimes among big banks than Obama had at the same point in his administration. I didn't even mean it as positive or negative statement. Why don't you get off my dick and focus on making money you fucking pussy. Keep that r/politics r/thedonald shit out of here.", "score": 5, "replies": [{"body": "I don't support either one of your clown parties, neither the Republicans nor the Republicans Lite.   \n\n\n ~~Trump's admin has prosecuted far fewer financial crimes among big banks than Obama had at the same point in his administration.~~   \nThe USA does not prosecute serious financial crimes. Nobody is actually in jail from the GFC or the great silver fiasco from 2011.", "score": 1, "replies": [{"body": "Just shut the fuck up I'm done here", "score": 0, "replies": [{"body": ">~~Just shut the fuck up I'm done here~~\n\n*REEEEEEEEEEEEEEEEEE*\n\n\\- u/ForRolls", "score": -3, "replies": []}]}]}]}]}]}]}, {"body": "Ah finally we have identified the philosophers stone play", "score": 4, "replies": []}, {"body": "That’s fucked they just bankrupted half the sub", "score": 5, "replies": []}]}, {"body": "Didn't they even get charged for silver manipulation in 2019? Never got the details, probably should.", "score": 10, "replies": []}, {"body": "1. Do a massive short position on the COMEX\n\n2. Prices collapse because the biggest holder is shorting. \n\n3. Buy the dip. Close short position for profit. \n\n4. Hold with even more silver available than before.", "score": 9, "replies": [{"body": "Why dont we all organize and do this? Legit cant not go tits upside down", "score": 3, "replies": []}]}, {"body": "Listened to a great podcast over the weekend, Quoth the Raven, \"Andy Schectman, Blows the Lid off Metals Manipulation, says $200 silver possible\"... explains the situation in great detail.. all butthole clasping can be released, metals going to the moon!\n\n&#x200B;\n\nJP Morgan was rico'ed, they went from the largest net short position to a long position in March of this year.  Metal experts call this the most defining moment of their career.", "score": 2, "replies": []}, {"body": "Simple and detailed.\n\nGot it.", "score": 2, "replies": [{"body": "Thank you", "score": 2, "replies": []}]}, {"body": "> U.S. prosecutors took an unusually aggressive turn in their investigation of price fixing at JPMorgan Chase & Co., describing its precious metals trading desk as a criminal enterprise operating inside the bank for nearly a decade.\n\nhttps://www.bloomberg.com/news/articles/2019-09-16/jpmorgan-s-metals-desk-was-a-criminal-enterprise-u-s-says", "score": 1, "replies": []}, {"body": "they have shorts, longs, they own vaults full of physical silver", "score": 1, "replies": []}]}
{"title": "DO NOT FUCKING SELL", "selftext": "Honestly, I’m fucking done thinking rationally. Statistically speaking there was a rotation to smaller cap stocks or lagging ones from tech AKA “profit taking”. BUT I really don’t think people are done dumping into tech, it’s the fucking number 1 gainer during the fucking pandemic. Basically I think we shall gap up, test under $320 SPY and then fucking moonshot as everyone unloads their fucking calls for 90% losses and we see $345 EOW. This is logically, the most illogical logic I could logically come up with. Please the only thing that will certify this theory is if we go under $320 tomorrow and I come on here and all I see everyone screaming to sell. I hope to god this comes true.\n\nAAPL $485, TSLA $1700, AMZN $3280, NVDA $520, FB $300 all EOW...\n\nEDIT: fuck I meant under $330 on SPY, but you get the point I fucking missed a digit over... It’s hard to type with the diamond hands babyyyy", "id": "i895n5", "created_utc": 1597215947.0, "score": 91, "upvote_ratio": 0.9, "num_comments": 47, "comments": [{"body": "So was it 3 Monster energy drinks or 4 Monster energy drinks you had tonight?", "score": 109, "replies": [{"body": "Red Bull’s bcs always bullish", "score": 155, "replies": [{"body": "This is the way", "score": 18, "replies": []}, {"body": "This guy fucks...with his wife’s boyfriend", "score": 26, "replies": [{"body": "...'s permission.", "score": 6, "replies": []}]}, {"body": "I was thinking more like Bull brand Coke", "score": 2, "replies": []}]}, {"body": "Bro it's all about those Hemp energy drinks now instead. Monster is old news.", "score": 5, "replies": []}, {"body": "Tonight or this morning? Where do we draw the line?", "score": 2, "replies": []}]}, {"body": "Lot of words for saying $CORN", "score": 37, "replies": []}, {"body": "No joke, there was a post like this exactly on February 20 2020. Just got done making EWU PUT purchases. I got calls, but I also can feel my balls being twisted by the boomers.", "score": 13, "replies": []}, {"body": "hold them bags", "score": 14, "replies": []}, {"body": "So were going to keep doing the same thing we've done for the past 20 years. Got it.", "score": 21, "replies": [{"body": "The goal is that 90% of WSB gets to 97% loss and we cover the 3% and ride it back up, we only have to better then the 90% that loses at this... All stats", "score": 7, "replies": [{"body": "Retards together strong", "score": 4, "replies": []}]}]}, {"body": "FUCKING SELL TO INVERSE WSB", "score": 8, "replies": []}, {"body": "Fucking digits mess with your brain you gotta keep the rhythm under your belt.\n\nYou didn’t jack off before writing this post didn’t you?", "score": 5, "replies": [{"body": "My post nut clarity was at an ATH last night", "score": 2, "replies": []}]}, {"body": "calls on $ROPE", "score": 8, "replies": [{"body": "atta boy", "score": 2, "replies": []}]}, {"body": "bro just hedge you bets", "score": 5, "replies": [{"body": "That would only be *rational", "score": 5, "replies": []}, {"body": "Teach me hedge", "score": 6, "replies": [{"body": "Its like the dougie but even more autistic", "score": 3, "replies": [{"body": "It's where you get yourself to the edge, but stop full nut.", "score": 2, "replies": []}]}, {"body": "Vxx?", "score": 1, "replies": []}]}]}, {"body": "My breakeven on my 450$ 8/19 NVDA calls is 468$ 🥴\n\nHoping it picks up soonnnn", "score": 3, "replies": [{"body": "RIP this won't age well", "score": 1, "replies": [{"body": "Time will tell 😅", "score": 1, "replies": [{"body": "Sending my condolences ahead of time, seems like you'll lose more to theta than you'll make holding but not like you'll blow up your account.", "score": 3, "replies": [{"body": "🥴", "score": 1, "replies": [{"body": "Saw it this morning, now hedge after the run up 😉", "score": 1, "replies": [{"body": "Sold it all, not worth the risk lol. \n\nBut anyone that holds is either going to lose half or make another 50%. The runup has been wild", "score": 1, "replies": [{"body": "Nice call either way! Good luck", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Why is no one buying ZM anymore? Everyone I've spoken to that works from home is still using Zoom.", "score": 2, "replies": [{"body": "Zoom sucks compared to Skype tbh, can’t even share multiple screens at once. They’re mainstream for sure but their technology isn’t anything special", "score": 3, "replies": []}, {"body": "Bc it's been months since the zoom hype started. What the fuck do you think this is? Tesla? You think a P/E ratio of 1400 is still undervalued? 🤔😂", "score": 1, "replies": []}]}, {"body": "What are you dates for nvidia?", "score": 1, "replies": [{"body": "I just have a $455 weekly and two far OTM 8/21 $600 in case of some amazing beat which prob won’t happen but they were cheap. Obviously my price targets are for shits and giggles but NVDA can run on a good report.", "score": 1, "replies": []}]}, {"body": "You lost me at Nvda 520", "score": 1, "replies": [{"body": "shhh NVDA is just a hopeful moonshot if there’s a good report, realistically if it can get a 10% boost going into earnings then $520 isn’t nuts", "score": 2, "replies": [{"body": "A 10% boost going into earnings is already nuts.", "score": 3, "replies": [{"body": "Yeah but look at AMD and INTC, NVDA should move fast", "score": 2, "replies": []}]}]}]}, {"body": "QQQ 350 by Jan 21?", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/bravander don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Cry", "score": 1, "replies": []}]}, {"body": "If everyone else is selling, its already too late to sell.", "score": 0, "replies": []}]}
{"title": "Y2k..2k Bug and It's Impackts on Markets", "selftext": "**Assumption:**  Markets are Efficient, Code is Bug-Free\n\n&#x200B;\n\nAs you guys can see from my post history, I'm slightly retarded and have been going down the rabbit hole of Machine Learning and AI.\n\nWe all know that bots run the market\n\nBots are not what you think they are.  They are not some all-knowing AI that knows you better than your Wife's BF.  There are hundreds of thousands of them... each programmed for a specific task.  To watch a specific security, trend, twitter feed.  Some are smart, using ML to make decisions based on sets of streaming data.  Some are dumb, if price is X when VWAP is Y, SELL.\n\n&#x200B;\n\nThe problem with all of this is that an **OVERWHELMING** majority of these bots.  Especially the bots that are of the more recent generation, are trained using a technique called reinforcement learning.  Reinforcement learning is a technique where you let the bot run free in a playground of data.  You give it 100k, tell it what it can do.. Buy sell. blah blah... and let it take actions.  Over and over and over again.  Like your wife's BF when you're out for the afternoon working on the boat.  Except.. it's in a gat damn computer with 16 GPUs that costs $238,000 so it can fumble around on replays of the market for millions of life-years while it slowly gets smarter every time it gets its virtual asshole burned by buying FDs on OTM SLV calls.\n\n&#x200B;\n\n**What does this mean?:**\n\nWe are about to cross into the unknown.  I've researched the Bellamn equation [link](https://en.wikipedia.org/wiki/Bellman_equation), which is the underlying equation for RL.  Its what dictates how these bots learn, how they replay time, and how they update themselves.  I've also read ML papers published by JPM [link](https://faculty.sites.uci.edu/pjorion/files/2018/05/JPM-2017-MachineLearningInvestments.pdf). What I've noticed is that most, if not all of JPMs \"Bots\" are modifying this equation so it can be efficiently replayed for these agents to learn on based on historical data.\n\nI've found several cases where THE EQUATION WILL DIVIDE BY 0 once we cross over into ATHs.  This will occur exactly at 3397.6.  Effectively crashing every single \"agent\" that has been trained in the last few years using this method.\n\nI'm calling this the Y2k2k bug.\n\n&#x200B;\n\nMeyn, Sean (2008). [*Control Techniques for Complex Networks*](https://books.google.com/books?id=0OdSX2BZ4WIC). Cambridge University Press.\n\nMiranda, Mario J.; Fackler, Paul L. (2004). [*Applied Computational Economics and Finance*](https://archive.org/details/appliedcomputati0000mira). MIT Press.\n\nMarko Kolanovic, PhD, JP Morgan (2017) [Machine Learning and Alternative Data Approach to Investing](https://faculty.sites.uci.edu/pjorion/files/2018/05/JPM-2017-MachineLearningInvestments.pdf),  JP Morgan Quantitative and Derivatives Strategy\n\n&#x200B;\n\n&#x200B;\n\nTL:DR - SPY 220..... or SPY 5000", "id": "i8g1bl", "created_utc": 1597247010.0, "score": 22, "upvote_ratio": 0.79, "num_comments": 40, "comments": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Shit, your right.  Let me update my TL;DR.  \n\n\nYou think I can pick up those calls on RH for free?", "score": 3, "replies": []}, {"body": "Calls it is", "score": 1, "replies": []}]}, {"body": "what?... so you are saying these bots should have constantly crashed pretty much all of last year and beginning of this year?", "score": 7, "replies": [{"body": "They are constantly being trained on historical data.  At exaclty 3397.6 that historical data runs out.", "score": 2, "replies": [{"body": "what have you been smoking because I want some", "score": 12, "replies": []}, {"body": "Lol, this is a bit much even for this sub", "score": 3, "replies": [{"body": "Shhhhh!... They can detect elevated levels of empathy.   [🤣](https://emojipedia.org/rolling-on-the-floor-laughing/)", "score": 2, "replies": []}]}]}]}, {"body": "Expect a call from wall street. They're gonna be pissed their rocket/JPL nerds missed this!", "score": 6, "replies": [{"body": "Rockets only go up!", "score": 1, "replies": []}]}, {"body": "How many pots have you smokened?", "score": 5, "replies": [{"body": "Yes", "score": 8, "replies": []}, {"body": "All of them?", "score": 2, "replies": []}]}, {"body": "Imagine thinking comp sci doctorates getting paid upwards of 8 figures by the biggest, richest, and most powerful entities in the entire world are going to allow bots that are making literally trillions of dollars to fail because they forgot a divide by zero error...", "score": 5, "replies": [{"body": "How many rockets have you blown up? huh?!", "score": 0, "replies": []}]}, {"body": "Also, from my very, very brief look into the bellamn equation I have concluded that you are indeed sir, a retard", "score": 9, "replies": [{"body": "Why thank you!", "score": 1, "replies": [{"body": "that was not supposed to be a term of endearment", "score": 6, "replies": []}]}]}, {"body": "I can’t tell if this is the most retarded or the most genius thing I’ve ever heard. Probably both.", "score": 3, "replies": [{"body": "Its either going to go up... or down.", "score": 1, "replies": []}]}, {"body": "Is this what happened to Direxion's Inverse NatGas fund today?\n\n&#x200B;\n\n[https://www.zerohedge.com/markets/triple-inverse-nat-gas-etn-goes-berserk-explodes-10000-minutes](https://www.zerohedge.com/markets/triple-inverse-nat-gas-etn-goes-berserk-explodes-10000-minutes)", "score": 5, "replies": []}, {"body": "The people that work on this stuff aren’t that dumb, it’s a one liner to handle division by 0", "score": 3, "replies": [{"body": "OP thinks he's a genius for fooling Ivy league grads lmao. One of the first things you learn in Comp Sci is to handle things like a divide by 0. Just another dumbass thinking he's smart.", "score": 3, "replies": [{"body": "Check out the JPM paper, there's a division error in the section talking about the models they use.", "score": 0, "replies": [{"body": "shut up retard", "score": 2, "replies": []}]}]}, {"body": "oh yeah?  how are you gonan handle a 1 liner in hundreds of agents that all feed into a cental decision making algo?", "score": 2, "replies": [{"body": "If you’re talking about distributed machine learning the algorithm is the same in each instance lmao it’s just run on multiple machines at the same time.  It’s a one liner and thats assuming they didn’t handle it in the first place.  Replacing / ignoring NaN in python for example is common practice when working w ML libraries", "score": 7, "replies": [{"body": "The core of each ML agent is trained based on an algo that can potentially divide by 0 once historical data runs out.  It will effectively shut down the agent.... All of them.", "score": -2, "replies": [{"body": "You're literally retarded, and I don't mean the WSB kind of retarded that the rest of us are, I mean legitimately, clinically retarded. No ML algo is going to be doing any division of variables without doing a zero check on the denominator. The devs who write this code get paid more to write that one line check than you shit out in a whole year working at Goodwill, they're not going to miss this kind of thing.", "score": 5, "replies": [{"body": "Dude, I'm just sayin, there is a divide by 0 error when they talk about the models and how they are used to identify data and ingest data for trends.  This is what's used for most of their HFT trading..", "score": 0, "replies": [{"body": "And I'm just sayin' that people whose pay is multiple orders of magnitude greater than yours aren't going to just sit by and say \"whelp there's nothing we can do about a potential division by zero.\" You are convincingly braindead if you think there's any way they let a fucking divide by zero error slip through into production code in a place that will kill their algos and lose them billions of dollars. I work on less important software for far less pay and even *I* get castrated for not doing zero-denominator checks (hell, we have an automated code checker that rams me before my coworkers do if I forget).\n\nYour entire DD is built on the retarded premise that fucking CS PhDs pulled a rookie mistake that automatic tools can check for and help prevent. It's not happening.", "score": 1, "replies": [{"body": "Let's see who's right when we cross pass the event horizon!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "🤯", "score": 2, "replies": []}]}]}]}, {"body": "Had me at the first half, not going to lie.", "score": 3, "replies": [{"body": "The first half of the y2k?", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/deltamoney don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Most of wsb was under 5 or was still in their daddy's nutsack during y2k.", "score": 2, "replies": [{"body": "That's why we are steaming towards another one!!", "score": 1, "replies": []}]}, {"body": "You know how we say \"priced in\"? This is just the same, but for algorithms. \n\nIf there is a fucking division anywhere and you are not checking the denominator, you are an imbecile that needs to be fired. \n\nIf the ML models crap out, don't you think they have a fallback mechanism? No firm worth their salt will be doing the actual trade executions with \"AI\". They may be used to derive indicators and fed to the algorithms that perform executions, as just another data point.  If one data point is missing or unreliable, continue as usual. \n\nWe've had automated trading long before \"machine learning\" became such a fad. Most algorithms are pretty simplistic. You are overestimating the usage of \"AI\" - which is difficult to understand and do QA against - versus simpler, rule and math-based algorithms. \n\nTL;DR nothing is going to crash. An algorithm that can't work past the all time high is completely useless. And you bet your ass this has been tested.", "score": 1, "replies": [{"body": "Sir. This is a Wendy's", "score": 1, "replies": []}]}, {"body": "the bellman curve is a racist hoax", "score": 1, "replies": []}]}
