{"title": "Tesla Model Y production will create a battery shortage, says Panasonic", "selftext": "", "id": "bo4tsu", "created_utc": 1557760896.0, "score": 49, "upvote_ratio": 0.89, "num_comments": 68, "comments": [{"body": "If Tesla has a battery shortage, where are the “Tesla killers” getting their batteries?", "score": 15, "replies": [{"body": "LG Chem is supplying a bunch of prismatic batteries to others. So is Samsung and a number of Chinese companies.  BYD does their own batteries, they are both a battery manufacturer and a car manufacturer.", "score": 5, "replies": [{"body": "LG (and don't forget SKI) make pouch rather than prismatic cells", "score": 2, "replies": [{"body": "Eww", "score": 3, "replies": []}]}]}, {"body": "Panasonic, Samsung, and others.\n\nTesla is the only one locked to Giga1.", "score": 0, "replies": [{"body": "Locked to giga1?\nS and x use (Panasonic) cells not made in giga1. Tesla also buy in cells from elsewhere for power products.\nNothing is stopping them sourcing cells elsewhere", "score": 2, "replies": [{"body": "True the 18650s are from Panasonic’s Japan factory.\n\nhttps://youtu.be/BtqqLMI-olw", "score": 1, "replies": []}]}, {"body": ">Tesla is the only one locked to Giga1.\n\nYou say that like it's a bad thing.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Never seen that, I’ve only seen Musk a couple years back say all future Gigafactories would. \n\nLast I saw they were looking for other contractors to build batteries for them in China.", "score": 5, "replies": [{"body": "You're mixing up batteries and cells. Tesla only uses suppliers for the cells.", "score": 3, "replies": [{"body": "Cells are the batters, packs are the modules.\n\nYes they may do pack assembly there.", "score": 2, "replies": [{"body": "Alright..... cells are cells, there are hundreds of cells in a module, there are 14 to 16 modules in a S/X pack depending on the variant and 4 modules on all M3 packs.  Tesla manufactures both packs and modules", "score": 2, "replies": [{"body": "There are 2 variants of model 3 packs.\n\n4 modules in each pack, and around 4,416 cells in the car.", "score": 2, "replies": [{"body": "many more M3 variants", "score": 1, "replies": [{"body": "2 packs in production.", "score": 4, "replies": [{"body": "cant be", "score": 1, "replies": [{"body": "LR and SR+\n\nSR is a software limited SR+ pack, and the MR pack is out of production.\n\nOh and the Canadian car is a SR+ pack super software limited.", "score": 1, "replies": [{"body": "True, then you need the 1-phase and 3-phase variants of those as well as the awd and rwd, they are all different packs that cant be swapped by one another", "score": 1, "replies": [{"body": "Same packs for the LR and AWD.\n\nAll AWD use the original LR pack.", "score": 1, "replies": [{"body": "So that will put tesla m3 pack status at:\n2 discontinued variants (LR rwd & MR rwd)\n5 currently in production\n2 to be launched later this year? (SR AWD)", "score": 1, "replies": [{"body": "Can’t speak for the variants that aren’t released yet.\n\nBut the LR RWD and LR AWD are the same pack, and battery arrangement on the 3.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "A battery, by definition, is multiple cells.", "score": 2, "replies": [{"body": "Yes, definitely lead acid. But an individual 18650 or 2170 is a battery.", "score": 1, "replies": [{"body": "No, an 18650 is one cell, with nothing in series or parallel.  It takes multiple 18650's to make a battery.\n\nNote that while we're being pedantic, nothing we call batteries are batteries (AA, AAA, C, D, etc, cells are not).  At least using the historic meaning.", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "Your comment makes no sense lol\n\nWhy is this a bad thing?\n\nWhere are cells for S/X coming from?", "score": 1, "replies": [{"body": "Why is being tied to a costly project that underperforms bad?\n\nTesla is not seeing the efficiency they  were counting on. Nor were they able to get the partners they originally planned on.\n\nHaving to write down those costs to move to another manufacturer would be terrible for Tesla. \n\nAt this point they are locked into Giga, and will have to invest considerably more capital into finishing the project. Hence why they need Panasonic to help, which looks less and less likely.\n\n(But yes the X and S cells come from Japan. They also cost considerably more, and the S and X were never able to generate cash flow like Tesla projected)", "score": -1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 27, "replies": [{"body": "I agree. After they posted losses related to selling batteries to Tesla, and they had to float Tesla a 6 month loan, I'm guessing Panasonic wants a sweeter deal this time.  Who can blame them?  Especially since Tesla isn't planning to use them for China manufacturing.", "score": 15, "replies": [{"body": "Yup. Business is business!", "score": 4, "replies": []}]}]}, {"body": "That's a good problem to have.", "score": 15, "replies": [{"body": "No it isn't. Wait till the Y hits 1k a week then becomes production constrained and causes tesla to lose money because they are in a fixed cost business.", "score": 14, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "And the powerwalls will be delayed even further.", "score": 3, "replies": []}, {"body": "Roadster wouldn’t be a problem because they’ll sell so few of them.  SEMI would be a problem of 18-wheeler proportions.", "score": 1, "replies": []}]}, {"body": "the model 3 and model y share the same battery packs... they could reduce the number of model 3's they produce if margins and demand are higher on model y (which i would hope they'd be)", "score": 1, "replies": []}, {"body": "By the time the Model Y reaches 1k production per week they can install new battery production lines or just get batteries from elsewhere.  \nhttps://qz.com/1529999/teslas-battery-monogamy-with-panasonic-is-about-to-end/  \nhttps://electrek.co/2019/01/22/tesla-approve-new-battery-supplier-vehicles-panasonic-report/", "score": 1, "replies": [{"body": "Exactly. They can make a plan with contingencies and milestones. Like a big-boy business. There too little business experience commenting on Tesla.", "score": 1, "replies": []}]}]}]}, {"body": "I think there is a decent chance at a scenario where Tesla converts production capacity from the model 3 to the model Y, reusing space, batteries, labor and production equipment, and drops the cheaper configurations. This is mostly a cash preserving exercise. It basically all has to do with where demand goes though.", "score": 3, "replies": [{"body": "This is my belief, but it’s not a good one. It basically kills the growth narrative. \n\nI can see Tesla using one of the GA lines at Fremont  for the 3 to build the Y is demand drops.  But that could cap both cars to 5,000-7,000 a week even if they get more efficient.", "score": 7, "replies": [{"body": "This is a bearish narrative relative to a 10k+/week model 3 demand story, but it's not bearish relative to where the stock is trading right now which already assumes most of the hopeful stories are dead.\n\n'kills the growth narrative' is nonsense. We're in the early phases of a secular trend toward EVs and towards autonomy that takes 20+ years to complete. Growth has not been a problem at Tesla, profitability has. They sold 100k cars 2 years ago.", "score": 2, "replies": [{"body": "@ 5000/week and low ASP is the model 3 isn’t even profitable. It’s a problem for sure.\n\nI mean look at Q1, and think about how much of that was incentives and regulatory credits.\n\nThis would be terribly bearish, even I am not expecting this. It’d be a huge miss, it wouldn’t even cover supplier contracts.\n\nThis really is a worst case scenario in my mind.", "score": 2, "replies": [{"body": "A lot of it was regulatory credits and will continue to be. You don't really know the details of the supplier contracts.", "score": 1, "replies": []}]}]}, {"body": "I don't think so, there are strategies Tesla can use to all of GF1 cell output for Model 3 and Model Y.\n\nOnce Panasonic gets that up and running,  that is 10K combined for  Model 3 and model Y.\n\nThen there is China, and eventually Europe...\n\nWhat we will see from there is slower expansion....\n\nThey have had to walk back from making a lot more cells at GF1 and probably making Model Y at GF1, this is simply a less aggressive growth strategy..", "score": 1, "replies": []}]}, {"body": "There is an unchecked narrative about demand. They have battery constraints. They are working on the delivery constraints. There’s no real evidence of a demand issue.", "score": 1, "replies": [{"body": "The evidence is overwhelming for the S/X (which was most of the damage in Q1). The model 3 is a little more open to debate on where demand is going.  The main argument that it was more than batteries are the pricing changes. You don't drop prices 6k$ per vehicle and below target gross margins into a 700M$ loss for no reason, right?", "score": 0, "replies": [{"body": "There’s no advertising. That means no customer education and no competitive positioning. This is not the tactic of a company that wants to drum up demand for super-luxury vehicles.", "score": 0, "replies": [{"body": "Who says they want super luxury vehicles?  I think Elon's been very clear he wants everyone to be able to afford a Tesla.  He said this in response to a question about the price changes.", "score": 1, "replies": [{"body": "My point isn’t clear, apparently. There’s an unchecked narrative that demand is falling. I’m pointing out that they don’t care about demand in the way Wall Street expects. If Tesla did care about demand, they’d be advertising. Anyway, Reddit sucks for having a discussion.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hey, we agree.  \n\nI'm going a step further and seeing the Model 3 getting cut about a year after Y launches.  \n\nSay the 3 stabilizes at 6,000/week.  Once the Model Y comes out, how many people will look at the 3 and decide they absolutely need the sedan form factor?  Most will go with greater flexibility. So there'll be a small bump to overall volume, but mostly it'll be Y cannibalizing 3, to the point it's not worth the continued support costs, and they stop making the 3.", "score": -1, "replies": [{"body": "Both are extremely high volume vehicles, even with disappointing numbers, so there's little reason to believe in an all or nothing situation.", "score": 2, "replies": []}, {"body": "Plenty scope to sell both.\nSuv/cuv market is larger sure but the sedan market can easily stand 10k a week on its own", "score": 1, "replies": [{"body": "Why would they sell 10k in the future when they sell 5k now?", "score": 0, "replies": [{"body": "They barely make more than that!\nRhd opens up a 300 million person market\nSr+ opens up more too.", "score": 3, "replies": []}]}]}, {"body": "Yeah the Model 3 won’t be getting cut anytime soon.", "score": 1, "replies": [{"body": "2022-2023 isn't really soon...", "score": 1, "replies": []}]}]}]}, {"body": "no shit. everything tesla has done so far has caused battery shortages. as long as production can ramp up still.", "score": 2, "replies": []}, {"body": "I feel like something is missing, like \"...if current production remains unchanged\". Clearly there are plans to ramp up production of existing lines and build more lines and get more suppliers. Implementing Maxwell tech in the next 18 months could help too. Maxwell based lines would be more compact, less complicated, and cheaper.", "score": 1, "replies": []}, {"body": "Otherway around. Tesla has Gig 1+ others if needed.", "score": 1, "replies": []}, {"body": "Unless they significantly modify the Y, I don't see it selling in large numbers. The evidence that the reveal and pre-orders were not successful is in the multitude of new reveals and pumps since. As is, the Y is a dud.", "score": -9, "replies": [{"body": "Where did you find out how many preorder/reservations there were?   They have not announced anything.  So your statement is just a guess and based on no real info.    The US market loves the small SUV/CUV config.   So they should have a much easier time selling the Model Y then the 3.", "score": 5, "replies": [{"body": "I am making an educated guess based on the poor reception to the reveal as well as their other promotional activities. If you are going to criticize me for not having the actual numbers, do you have them? Otherwise your guess is no better.\n\nMaking a Crossover or SUV doesn't equal free money.  There was a lot of anticipation around the Model Y and it fell utterly flat.", "score": -8, "replies": [{"body": "The 3 is already a perfect car.  Model Y can tow, and has a hatch, and possibly carry 7.  Shit I prefer the Y over the 3.   Might switch when it’s available.\n\nY is not much more compared to the 3, but it’s still better and will sell pretty well, probably more than the 3 in the US.", "score": 1, "replies": []}, {"body": "You were the one making claims on the popularity of the Y. \n\nIf someone wants a 3 they can buy one. If they want a Y there's not reason to put the money down now.", "score": 1, "replies": [{"body": "Sure there is. To get one first. If Pana is right and it will be supply-constrained, then one would want to be at the front of the line. As I said, the reveal was a dud (I don't even know why this is being debated), so I don't see anyone clamoring to be at the front of the line.", "score": 1, "replies": [{"body": "I personally know three people who are eagerly awaiting the ability to test drive one and seriously considering buying it.  I think the Model 3 and the tax credit shook out all the early adopters with the gotta have it first gotta stand in line gotta reserve mentality, but I don't think that means anything for Y demand.  Demand and hype are two independent things.", "score": 1, "replies": [{"body": "I suspect they'll be waiting awhile. \n\nTrying to sell the Y as-is is suicide. It's a Model 3 that got stung by a bee. By the time it's actually for sale, the look of the car will be 4 - 5 years old and it will be competing with used Model X pricewise.  This is from the company who made EVs sexy and desirable. That same customer demographic will not want to \"see and be seen\" in a vehicle design that old.  Not a chance.  And if they don't care, there's already the Kona, Leaf, Bolt, etc.\n\nTesla has to redesign it to have any chance of selling it successfully. A redesign means a more significant exterior departure and internal sqft and headroom from TM3, which means supply chain, tooling and CAPEX impact. \n\nSo if they go back to the drawing board, it means a significant delay. If they don't, it won't sell.", "score": 1, "replies": [{"body": "2013 called, it wants its Model X bear argument back.", "score": 1, "replies": []}, {"body": "I'm not impressed by your market analysis.  If you think the people who want to be seen in a cool-looking car are the target market for Tesla as it scales, you're simply wrong.  A lot of people want an everyday driver that doesn't draw a lot of attention on the road but is practical and pleasing.  Those people aren't the early adopters that Tesla has traditionally milked, but early adopters are a small portion of the population.  The real money is in selling to people who just want a better car than what they have and will be blown away by the amazing awesomeness that a Tesla offers.\n\n\"And if they don't care, there's already the Kona, Leaf, Bolt, etc.\"\n\nNone of which have superchargers, self-driving, or the connected and always improving software ecosystem the Tesla has.  Not to mention they're all less efficient, less safe, less powerful and less roomy.\n\nThere are a ton of practical reasons to get a Tesla over other cars, they don't need to be flashy to sell.", "score": 1, "replies": [{"body": ">A lot of people want an everyday driver that doesn't draw a lot of attention on the road but is practical and pleasing.\n\nIs 27k, 3 months in the shop and car insurance more than tripling [practical and pleasing](https://www.reddit.com/r/RealTesla/comments/bo6a45/model_3_accident_update/)? \n\n>None of which have superchargers, self-driving, or the connected and always improving software ecosystem the Tesla has. Not to mention they're all less efficient, less safe, less powerful and less roomy.\n\nSuperchargers: as an investor you should be concerned about the capex and running costs with that, particularly as other networks are growing rapidly.\n\nSelf-Driving: Teslas have fairly impressive driver assist systems, but they are not self-driving. If Tesla's are self-driving, so is GM Supercruise.\n\nSoftware: Could be a nice advantage but each release is notoriously buggy. Meanwhile, everyone has android auto and apple carplay, far diminishing the value of OTA updates while simultaneously lowering the pressure on those mfgs to produce amazing software, which is outside of their strengths. You know why my car doesn't have a fart app? Because novel internet sound generators on your smart phone are circa 2007 funny/ironic. For performance tweaks and so on, I give Tesla a small advantage.  \n\nFor EAP/FSD improvements, I agree that is a great advantage. However, to date I've not seeing anything delivered on top of the base product that is a value for the money.", "score": 1, "replies": [{"body": "\\> Is 27k, 3 months in the shop and car insurance more than tripling [practical and pleasing](https://www.reddit.com/r/RealTesla/comments/bo6a45/model_3_accident_update/)?\n\nFor every story like this one, you can find ten going the other way.\n\n\\> Self-Driving: Teslas have fairly impressive driver assist systems, but they are not self-driving. If Tesla's are self-driving, so is GM Supercruise.\n\nI haven't tried Supercruise but my Tesla drives itself kind-of a lot.  And I thought we were talking about EVs?  Is Supercruise available on any EVs?\n\n\\> Software: Could be a nice advantage but each release is notoriously buggy. Meanwhile, everyone has android auto and apple carplay, far diminishing the value of OTA updates while simultaneously lowering the pressure on those mfgs to produce amazing software, which is outside of their strengths. \n\nUm no.  You hear about the bugs because people like to bitch about bugs on the internet.  You can find the same thing for literally any software product.  And Android Auto and Apple Carplay won't manage my windshield wipers, my headlights, my tire pressure monitoring system, my security system, my garage door opener, my climate control or my cars power or efficiency.  They are not comparable products at all.  Tesla's software controls everything in the car so literally every control or sensor in the car can be improved by Tesla's software team over time.  No other car company can say that.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}
