{"title": "Why does no one believe in this bear market?", "selftext": "Bought puts right at the peak of the market at then end of April.   I got the timing right but the severity of the downside has been so weak.  Every time there is any decent move to the downside its immediately followed by frenzied buying in the afternoon.    \n\n\nTheta is eating me alive because the market is moving down like a high koala failing off a branch in slow motion.    \n\n\nWhy is everyone constantly buying the dip?", "id": "bsbi7q", "created_utc": 1558664752.0, "score": 38, "upvote_ratio": 0.8, "num_comments": 75, "comments": [{"body": "Because if it really is a bear market, I want to see everyone go down, including the bears.", "score": 94, "replies": [{"body": "That’s deep", "score": 2, "replies": []}]}, {"body": "Were you expecting a 400 dollar red candle on SPX?", "score": 33, "replies": [{"body": "No Supports! Only Down!", "score": 13, "replies": []}]}, {"body": "Because economy is still fairly strong, tariffs aren't THAT big of a deal (won't push us into a recession) and anyways people are still holding out hope of a deal. The level of fear isn't even close to 2008 yet", "score": 54, "replies": [{"body": "And money is still cheap,  Fed Put still in place,  inflation is nonexistent, no where else in the world has the potential of the US market,  etc.", "score": 30, "replies": [{"body": "This. Millions of people aren't saddled with hundreds of thousands in debt, bagholding a house worth half the value they bought it at, like 2008. Yes, Millennials have massive student debt, but they also aren't as actively involved in moving the market because of this (though, their net worth overall is gradually improving). Most aren't trading stocks, they're just buying goods... the money in the market belongs primarily to Baby Boomers and Gen X. Both are overly skeptical because we have seen a crunch roughly every 10 year, 89, 00, 07, and are waiting for another. People are looking for a reason for the market to collapse, not focusing on the growth metrics. The \"Trade War\" has made people overlook low unemployment, rising wages, low inflation, and positive ERs... we're not in a boom, but this definitely isn't economic meltdown conditions.", "score": 26, "replies": []}, {"body": "Level of fear doesn’t rise in the general public until a recession hit the in the face - a recession is inbound no doubt in my mind. Republican administration will likely do whatever it takes to extend the inevitable until after the 2020 election.", "score": 4, "replies": [{"body": "I think this is it right here - I plan to YOLO puts in October 2020", "score": 1, "replies": []}]}]}, {"body": "Some info out there suggests the Canadian housing market is a fucking dumpster fire ready to blow. Do you think a housing crisis in Canada could cause a recession here?", "score": 3, "replies": [{"body": "lol no. Canada is a tiny punesy, gay ass country that won't affect MURICA at all. and Canadian housing market isn't as bad as you claim it to be", "score": 3, "replies": []}]}]}, {"body": "You really should sell your options in the morning when volitility is high. I'm sure you have woken up to your puts being up 20-40% a few times this past month. Gotta cash those out at open and make more in-and-out plays. You are holding options, not shares, there's theta. There have been plenty of profit taking opportunities for bears you need to take profits and roll out more short dated puts with a small percentage of your portfolio, the rest being in cash.\n\nStop holding your volitile options for so long and sell them when they are green. Keep attacking in short bursts while building up cash for the next bull run, not trying to win it all on a crash. EEM and FXI puts have been my only bear plays aside from holding cash.", "score": 18, "replies": [{"body": "You don't have to sell them. Just sell a vertical spreads against your option on any high volatility days. Then buy back it back if Cheeto man puts out some positive tweet. Sure it limit maximum gains but it will protect you from theta and will let you lock in gains.", "score": 4, "replies": [{"body": ">  sell a vertical spreads against your option\n\nwhat's that mean bro?", "score": 5, "replies": []}, {"body": "Btw you can still incur max loss on this spread and end up having to baghold until expiration because you can’t afford to close the short side of the trade (RH users since you can’t close a spread as one action)", "score": 2, "replies": [{"body": "Yes, but you should be mitigating max loss with that short side. The general common sense rules to options still applies, this shouldnt be done with low volume options, don't over extend where you can't exit the trade and never with FDs (this technique). Short side should only be opened up for significant max loss mitigation. The OP is talk about expecting a large move down but up and down volatility was allowing theta to eat him alive. I'm assuming he's at least 30 days out. In this case a vert P spread would likely help mitigate.", "score": 1, "replies": []}]}]}]}, {"body": "Because there is so much money on the sidelines and there are no alternatives other than the stock market to invest with interest rates so low.", "score": 11, "replies": []}, {"body": "Because people have money and theres no where else to get returns from other than the US market. No one wants to invest in shitty europe, or shitty india, or shitty china, or shitty south america right now. All the money is flowing into the marjet, theres no where else for it to go. Are stocks inflated? yes. Does it matter? No. This shit is going up forever until something crazy happens like trump loses election.", "score": 8, "replies": [{"body": "What about shitty wok?", "score": 6, "replies": [{"body": "Stay away from my shitty wall", "score": 1, "replies": []}]}, {"body": "Trump losing is already priced in, I think. He cannot possibly win. And duncha think him losing would actually help the market?", "score": -3, "replies": [{"body": "I'm willing to bet as the election nears, Wall Street will converge on the prediction Trump wins. Biden is going to get dragged into the madness on the far left and we will have a repeat of 2016. Moderates vote Biden, Biden doesn't energize the lazy far left base, Trump wins by default", "score": 1, "replies": [{"body": "You think Biden will win? I think Beto will. Biden is just too old. Beto will be able to energize the base. Boot-edge-ij will fade away since the press and he himself will make it more about him being gay than actual policies. That'll get the millennial vote, but older people would want actual policies, and not just vote cuz he ghey.", "score": -1, "replies": [{"body": "Yea, I think Biden will win. And what policies? Beto doesn't have any proposals that I know of", "score": 1, "replies": []}]}]}]}]}, {"body": "The market is just training dumb money to buy the dip so that when the time comes the market can entirely clean them out after they confidently pour all their money into a dip that doesn’t reverse.", "score": 17, "replies": [{"body": "i hope youre not right..", "score": 6, "replies": [{"body": "He’s right \nSource : my ass", "score": 4, "replies": []}]}]}, {"body": "Because the fed will cut rates if things aren’t good", "score": 11, "replies": [{"body": "This is my thought process as well.  Their mission isnt to prop up the stock market and its annoying that Trump has made it their mission.\n\nI do like the Trumps actions for the most part though. And i fully support the china trade war", "score": 3, "replies": [{"body": "Trump does look at market, but interest rates effect the rest of world more then our banks.  Europe and Japan are both at ZIRP.  They are borrowing from us to be able to lend out credit.  If the FED keeps raising rates we have no edge in trade talks.  China is a different story though - have to play hardball with them.", "score": 2, "replies": []}, {"body": "What are the expirations of your puts? It took a pretty sizeable shit past few weeks. If you bought puts at top how can theta really be killing you that badly?", "score": 1, "replies": [{"body": "5/31, sold today for 60% loss just to preserve something", "score": 1, "replies": [{"body": "Oh damn.  Yea, I still think we see some dumping in the months ahead. China, nor Trump are likely to back down", "score": 1, "replies": []}]}]}]}, {"body": "Is a rate cut even remotely on the horizon, though? Rates are ridiculously low and the fed should be trying to bumo them up while the eco omy is still doing well so they have downside when SHTF.", "score": 1, "replies": []}]}, {"body": "The news isn't really that bad. The headlines might have pumped 'Trade deal progress' for 120 days straight but it's all just noise in the big picture.", "score": 3, "replies": []}, {"body": "Many true bear markets aren't a straight down affair.  \n\n\nLook at a Dow or SPX chart of the 2000-2002 bear.  -43% but it took over two years.  Just a long, slow grind down.", "score": 4, "replies": []}, {"body": "Because <5% pullback (S&P) from all time high does not make this a bear market. \n\nBecause December 26, 2018 is fresh in everyone's mind.", "score": 8, "replies": [{"body": "I'm gonna go full autistic and say that was the inverse head.", "score": 2, "replies": []}]}, {"body": "If we break 2800 on the SPX then look out below.", "score": 2, "replies": [{"body": "Thats what ive been wating on but damn its taking so long", "score": 2, "replies": [{"body": "Well, luckily its still a volatile market so a 1% down move is pretty likely - but as always ya never know. I’m all cash now so just waiting for an extremely over sold or over bought scenario before I take the opposite side.", "score": 1, "replies": []}]}]}, {"body": "f u n d a m e n t a l s", "score": 2, "replies": []}, {"body": "buying shares of SQQQ would've gotten you 20% without decay", "score": 2, "replies": []}, {"body": "Because even the most vile Trump hater secretly loves the baboon. Even if they won’t admit it to themselves.", "score": 4, "replies": [{"body": "Can’t stand the guy. But to be fair, the trade reps and the fact that he was one of the fiercest hawks around (Bolton), foreign policy has been spot on. And I’m not political.", "score": 8, "replies": [{"body": "Pretty much. Trade and immigration are thumbs up.  Religious stuff thumbs down. But trade and immigration are all I really care about compared to other stuff.", "score": 1, "replies": [{"body": "What has he done about immigration", "score": 4, "replies": [{"body": "wall good. me like wall. wall work", "score": 10, "replies": []}, {"body": "He’s tried immigration reform, but has been blocked. And he’s slowly getting border security. He once talked about going after the cartels. He’s done good considering the rest of the Washington establishment being either indifferent or dead set against reform.  If the Bernie bros ever figure out illegal immigration increases housing costs and lowers wages especially for unskilled labor, he might have support across the aisle.", "score": -3, "replies": [{"body": "So nothing?", "score": 15, "replies": [{"body": "Try reading it again", "score": -6, "replies": [{"body": "Aww he tried his bestest at immigration reform but didnt do shit", "score": 12, "replies": [{"body": "He managed to get courts to rule in his favor for both the travel ban and the \"wait in mexico\" policy for central Americans. This is important because in the past, central Americans would just get knocked up and give birth in the US resulting in winning asylum regardless. Now they will give birth in Mexico.", "score": 2, "replies": []}, {"body": "It’s a work in progress. You must not follow politics.", "score": -3, "replies": [{"body": "Oh I do, heavily. But anyways i only asked what he did not what he has in the works or what hes trying.", "score": 1, "replies": [{"body": "He’s moved the conversation to actually be about immigration. Before it was always swept under the rug. He’s having the wall repaired and built. He’s blocked illegal immigrants from coming in by the courts. A+ for 2 years.", "score": 2, "replies": [{"body": "Solid response I accept", "score": 1, "replies": []}, {"body": "This was more of what I was looking for", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I don't like him but I find him fun to watch at times.", "score": 1, "replies": [{"body": "https://youtu.be/RbM2F-cfN0A", "score": 2, "replies": []}]}]}, {"body": "When people say the us economy is doing well those gets a piece of the pie remain bullish. Those who don't even see pie can't help but remain bearish. \n\nThe wealth is also doesnt just disappear when it exits the market with every dip. There are millions of people out there who experience fomo every day.", "score": 1, "replies": []}, {"body": "No recession is no bear market.", "score": 1, "replies": []}, {"body": "That’s why you buy FD’s only", "score": 1, "replies": []}, {"body": "Corporate Blackout has ended is one reason.  The second is that more people lose money if the market chops.", "score": 1, "replies": []}, {"body": "There are algos that prevent frenzied selling. And pump jobs done by the president. They are doing everything they can to pull the market back up. I totally feel your pain on this one.", "score": 1, "replies": []}, {"body": "Its the federal reserve put. Also ecb.\n\nThey print new money and buy stocks always, didnt you know this?", "score": 1, "replies": []}, {"body": "So prior to April, i was a full on bear, but after that, i became neutral/slightly bullish. The reason for that was statistically, in a bear market rally, it wont exceed 120 days. We have well exceeded that point and then some. You can conclude that if there hasnt been a large downward movement in that timeframe, its likely we just arent going to have one. The other thing to note is that when the market stays flat for a period of time, the index as a whole starts to  get more enticing for value investors as the forward pe/s are now becoming pe in a growing earnings growth environment. The final nail was probably Jpow himself, he single handedly caused the crash, followed by its violent whiplash. The Fed put is on full display now.", "score": 1, "replies": []}, {"body": "Maybe I didn't phrase it properly. Example, You own 5/31 105P on SMH. Stock drops  to 103.5, sell a 5/31 100P for the original buy in price of your underlying option. Now if the day turns on you or theta decay, your overall portfolio is unaffected", "score": 1, "replies": []}, {"body": "If you look at it, we are probably headed lower by June 2018 with breakdown similar to Oct 2018.  This is a bear setup given there isn't the momentum pushing it higher.  Trade can save it though.", "score": 1, "replies": [{"body": "Exsctly, thats the kind of pullback i was looking for", "score": 1, "replies": []}]}, {"body": "It's all about the interest rate expectations. 10Y Notes started to decline since late 2018 and FED keeps it's policy steady for now.", "score": 1, "replies": []}, {"body": "Because the national media doesn’t announce a trade war a week before a massive decline.\n\nReal recessions slap you on the face and start in a matter of 12 hours.", "score": 1, "replies": []}, {"body": "As far as I've been reading EVERYONE believes it's a bear market and rescission is imminent. SPX is SELL SELL SELL on tradingview and the twitterheads bears are all acting smug as fuck showing off trend lines and shit saying it's a recission.\n\nWhere have you heard differently?\n\nNow here's my issue. We're suppose to buy when others are fearful right? And since I'm reading everywhere that RESCISSION IS IMMINENT doesn't that mean its time to buy? Except it's not because recession is imminent, right? fuck.", "score": 1, "replies": []}, {"body": "hope springs eternal.", "score": 1, "replies": []}]}
