{"title": "All inventory Model S and Model X cars now come with unlimited free Supercharging (until June 30)", "selftext": "[https://twitter.com/Tesla/status/1134479110716006400](https://twitter.com/Tesla/status/1134479110716006400)\n\n&#x200B;\n\nJust tweeted by Tesla:\n\n>Important Announcement (unless you like paying for gas): All inventory Model S and Model X cars now come with unlimited free Supercharging. This ends on June 30.", "id": "bv94b3", "created_utc": 1559317451.0, "score": 351, "upvote_ratio": 0.94, "num_comments": 68, "comments": [{"body": "On September Elon Musk said this was not sustainable at volume production and that offering this doesn't incentive optimal behaviour. I don't think the business model could have changed that much in this time. But I think this is the right move for Tesla: Model S and Model X are amazing cars, but expensive. Giving customers this kind of promotion can make all the difference. Instead of paying more for a Tesla, customers can perceive it as paying more upfront and saving money later.", "score": 70, "replies": [{"body": "Wondering how much people could truly save. The cars depreciate pretty fast like any other car, and I’m not sure how often people use Tesla charges, let alone how much they’d end up using in “free charging” by the end of the life of the car", "score": 28, "replies": [{"body": "That'll all depend on how much you travel I guess. I'm a low milage driver, so I visit SuCs exceptionally infrequently and often just for novelty factor - 90% of my charging is done at home.\n\nUnlimited SuC is a nice cherry, but wouldn't be a deciding factor for me to buy another car (assuming I didn't already own).\n\nThere's also the issue of the m3 displacing the MS/MX demand as it's just a better electric car at this current time of writing. Unless you need the space for kids, I wouldn't recommend an MS/MX at this price point - the MS is a fantastic looking car, yet it must be overdue for a facelift/tech update.", "score": 22, "replies": [{"body": "Wow. Well thank you for your insight! Was really wondering how many people use super chargers I mean it’s kinda gimmicky I’d feel like for MOST people so interesting to see that this wouldn’t be a deciding factor/most charging is done at home.", "score": 7, "replies": [{"body": "np\n\nI will say they are invaluable on long journeys, waiting for traditional chargers is the 21st century equivalent of watching paint dry - so they are important, and would make me choose to buy a Tesla over a competing electric vehicle.", "score": 8, "replies": []}]}]}, {"body": "Teslas actually depreciate pretty slow.", "score": 10, "replies": [{"body": "Really? I was seeing some Model S’s from 2014 for 32,000 in California with about 50-60k miles or so. I mean that’s like 50% off the original price for about 5 years. I mean it’s a $40,000 hit off the value already that seemed like a decent amount still", "score": 5, "replies": [{"body": "[\"While different cars depreciate at different rates, it's a good rule of thumb to assume that a new car will lose approximately 20 percent of its value in the first year and 15 percent each year after that until, after 10 years, it's worth around 10 percent of what it originally cost.\"](https://smallbusiness.chron.com/average-depreciation-rate-vehicle-64934.html)\n\nSo if we take your example of the Tesla Model S original cost of $32k + $40k = $72k. Then we apply the depreciation amounts as per the link: $72k \\* 0.8 \\* 0.85 \\* 0.85 \\* 0.85 \\* 0.85 = $30k by Year 5; 2k less than the real world selling price.\n\nTherefore, using these assumptions, the Model S depreciates slightly slower than average. \n\nNote: this could vary depending on what depreciation rates you use; I just used the first answer that Google showed so I'm not saying this is the final definitive answer. I also haven't researched what the Model S sold for in 2014 etc etc.", "score": 13, "replies": [{"body": "I never knew that. Thanks for your insight and research that’s real good info! Slow a bit less but for some reason i thought it would hold its value way longer for some reason like significantly", "score": 4, "replies": [{"body": "No worries. Depreciation can be affected by many things of course. In this case, because supply isn't exactly as high as other car manufacturers, it may mean there's less stock available which therefore supports the resale price and therefore slows depreciation.", "score": 2, "replies": []}]}]}, {"body": "50% of its value after 5 years is inline with non EV cars.", "score": 2, "replies": []}, {"body": "With unlimited super charging? \n\nShit, I'd probably buy that. That car will last another 200k miles with almost no maintenance and super low TCO", "score": 1, "replies": [{"body": "No maintenance, but plenty of things that can break on early cars and poor service support outside warranty.\n\nhttps://www.youtube.com/watch?v=iR4CFiuR3tQ\n\nhttps://www.youtube.com/watch?v=9gMM5cJtmMg", "score": 5, "replies": [{"body": "I've been saying for years that it's gonna be a nightmare to maintain all the fancy bells and whistles and literal moving parts on Teslas after 5+ years. What happens when your retracting door handles don't pop out?\n\nJust look at how expensive BMWs and Mercedes are to own.", "score": 4, "replies": []}, {"body": "I had no idea there was that many issues good videos to share", "score": 1, "replies": []}]}, {"body": "I mean they’re used so i don’t think it comes with unlimited charging. I’m imaging you’d need to buy a new one direct from Tesla for the 70k price tag. I just go to any auto seller website and see them for like 30-35k listed. Idk what a normal car depreciates like but i thought for sure they’d hold their value more like you said but i guess not. I mean 40k gone like that doesn’t scream holding value as much as i expected", "score": 1, "replies": []}]}]}]}, {"body": "It doesnt matter how much they actually use the free charging - it matters more how much they THINK they will use it /save money with it.", "score": 3, "replies": [{"body": "True i was just going for the practicality aspect and just curious on people’s opinion because like you said, this is a good gimmicky promo for people not thinking but i was just thinking in the actual world how good is this promo really? I think it’s a great gimmick on Tesla’s part to boost sales a bit", "score": 2, "replies": []}]}, {"body": "Do they depreciate as fast as normal car? I had heard they hold value longer but I really don’t know.", "score": 1, "replies": [{"body": "It’s still pretty early to tell IMO, I’m really curious to see how they hold value and what their CPO situation (assuming they have something like that) looks like.", "score": 1, "replies": []}, {"body": "They  depreciate way faster way faster. Old  technology fast. Also 64th worse in dependability out of 64 manufacturers.  Try getting a Tesla serviced in 2 years after they go bankrupt. It's bad enough now.", "score": 0, "replies": []}]}, {"body": "while this might sound shitposty, its also kind of a serious question:\n\ndo you think the tesla eventually collect ford model t or late 60s muscle car antiquity/rarity/collectible status?", "score": 1, "replies": [{"body": "I feel like not because there’s so many on the market unless they suddenly got discontinued or something like right now out of no where or Tesla went out of business within the next couple years. But if they keep pumping out cars i doubt it", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Maybe they could, but why sell low production models at all if they are losing money on them?", "score": 1, "replies": []}]}, {"body": "Sales are lagging - That's why this is being offered.", "score": 4, "replies": [{"body": "Sales and they need good old cash. Tesla had lost half its value to borrow against.  Their bonds are junk.", "score": 1, "replies": []}]}, {"body": "there is no savings in the purchase of one..without oil you cant build it..or charge it in most places.  even the batteries are not recycled here in the us.  it is a proper scam,  trading pollution of co2 for other types.", "score": 1, "replies": []}, {"body": "If I had money for a Tesla, I certainly would buy one that has lifetime supercharging.    \nWithout that incentive, I would look at other, cheaper, electric vehicles.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 55, "replies": [{"body": "They said they’re rejiggering the plant for new model. Q zero sales for old model.", "score": 18, "replies": []}, {"body": "Demand is down with S/X models yes. Model 3 demand, I don’t think so. Model 3 is $50,000+ cheaper, comparable range, more modern interior, and is only a little bit slower. It is cannabilizing the demand of the older models, and there are also rumors of a refresh soon of the S and X.\n\nAlso, it’s not like other auto manufacturers never run promotions.\n\nHere’s and email from a few days ago:\n**Full Email:**\n\n[https://pbs.twimg.com/media/D7wbqWGXYAEYLKw?format=jpg&name=medium](https://pbs.twimg.com/media/D7wbqWGXYAEYLKw?format=jpg&name=medium)", "score": 24, "replies": []}, {"body": "I'm long Tesla and my portfolio has been hurting.", "score": 5, "replies": []}, {"body": "Lol this is the second time I see this statement.  IDK how this gets to the top.\n\n&#x200B;\n\nCar companies offer sales all the time.", "score": 10, "replies": [{"body": "I wouldn’t categorize this as desperate but it’s certainly different. Free charging or whatever sounds like a lot more than your typical rule of 10 lease specials.", "score": 3, "replies": [{"body": "You realize June 30th is 4 weeks away, right? It's really not that big of a giveaway.", "score": 4, "replies": []}]}]}, {"body": "Most companies have promotions all the time. I guess they're all desperated?", "score": 19, "replies": [{"body": "It's about context though. Nobody would be saying this if they had a healthy balance sheet.", "score": 15, "replies": []}, {"body": "This is for sure a desperate move. I know we’re in a Tesla page but try not to be biased.", "score": -5, "replies": []}, {"body": "Could be because they said it would NEVER COME BACK? But who knows...", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Tesla needs another cash infusion, and getting cash now is probably worth the long term cost to Tesla for providing charging for most of these people, especially considering many will probably still opt to charge at home anyway.", "score": 9, "replies": [{"body": "Didnt they just raise like 1.6b a month or so ago", "score": 3, "replies": [{"body": "I think it was closer to $3b.", "score": 15, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Im inclined to support your view, although TSLA does get cash immediately without any dealers in between, right?", "score": 1, "replies": []}]}]}, {"body": "So they've already used all the letters in their models? Where do you go from here in model names?", "score": 4, "replies": [{"body": "Greek", "score": 3, "replies": [{"body": "The new Model T(heta)\n\n.....\n\n.....\n\nGet it while it lasts.", "score": 3, "replies": []}]}, {"body": "α β γ ε λ µ σ τ φ ω Δ ∇ ∂ Å Ω δ ζ η κ ν ξ ρ υ χ ψ Γ Θ Λ Ξ Π Υ Φ Ψ", "score": 1, "replies": []}]}, {"body": "It seems like every quarter they are absolutely scrambling to hit their numbers. Production, deliveries, and now sales. For someone who  acts like he doesn't care about investors, Musk sure likes to over promise.", "score": 3, "replies": []}, {"body": "No on the 3??? I feel disenfranchised", "score": 1, "replies": []}, {"body": "Supercharging isn't sustainable. It costs $22 to fully charge once. I pay $20 for a week of driving my low MPG Ioniq hybrid. About 300 miles a week.\n\nEither they need better batteries or lower charging costs, because hybrids are becoming better every year.", "score": -2, "replies": [{"body": "I traveled 800 miles on a road trip spending 2 hours (4 stops) at superchargers costing me $17. TX to GA in my model 3. Super sustainable if you don’t sit there until your 100% full. Electric cars don’t work the same way gas cars do. Charge from 10% to 75% and it’ll save you lots of money.", "score": 22, "replies": []}, {"body": "Er I think the math is off somewhere. Do you have a source?", "score": 4, "replies": []}, {"body": "300 miles is 482.8 km", "score": 14, "replies": [{"body": "Good bot.", "score": 14, "replies": []}]}]}, {"body": "Pushing out the old models to get the refreshed versions rolling into customer driveways in Q3 and Q4.\n\n&#x200B;\n\nGood move.\n\n&#x200B;\n\nIt'll be a challenge for Tesla to grow sales on S & X since the Model 3 Performance is GODMODE value vs an S, and the Y will be the same vs the X. \n\n&#x200B;\n\nSecond refresh will help.", "score": 1, "replies": []}, {"body": "Doesn't it take a month to get a Tesla? The window is too short to incentivize sales this only benefits existing owners.", "score": -10, "replies": [{"body": "Pretty sure it means all cars bought before June 30 get free supercharging for life, not all Model S's & X's get free supercharging until June 30.", "score": 21, "replies": [{"body": "Oh shit that makes a lot more sense. Good short term move but I wonder how this will affect them long term.", "score": 7, "replies": [{"body": "Capacity is certainly a concern, giving away free SuC puts a load on the network and they are not expanding at the same rate as selling the cars. \n\nThat could be mitigated by pushing the SuC network as a \"splash and dash\" facility rather than sitting at a bay for 40 minutes to charge to 90% from 10%. The recent in car nav does an excellent job of giving you just enough charge to get to where you're going without charging unnecessarily\n\n[edit]\nFrom a stock perspective, the network can't be cheap to run and further expansion is also not cheap. Would this have a measurable impact on P&L? Hard to say, with more third party networks coming online that burden has been relaxed somewhat.", "score": 3, "replies": []}]}]}, {"body": "If they're doing this they must have inventory that they really want to sell before the end of Q2.", "score": 5, "replies": [{"body": "My guess is they want to get rid of the 'old' inventory cars running the old tech as they know they are not a desirable compared to the M3.\n\nIn a way Tesla are their own competition, when they bring out the latest tech which is measurably better than the previous new buyers aren't going to pay full sticker.", "score": 10, "replies": []}]}]}, {"body": "The shorts will say that it is a lack of demand... The bulls will say that Elon and Tesla are confident in their business model. What's the right take?", "score": 0, "replies": [{"body": "A 45% drop in share vale tells you who is right.  Hint...it's not the con man or his groupies.", "score": 3, "replies": [{"body": "Well for some months ago, this advantage was removed bc it was \"too costly\"... Now all of a sudden it isn't... I would call this more a sign of confidence than anything else... If its a bluff, it's an expensive and dumb one.", "score": 0, "replies": [{"body": "their CEO is the man that dropped his stock prices by 10% over an april fools joke... expensive and dumb is his middle name", "score": 1, "replies": []}]}]}]}, {"body": "Desperation move.", "score": -4, "replies": []}, {"body": "Why not scrap super charging all together?\n\nThey need to focus on infrastructure and having battery swap out stations (like a gas station, but automated), that people subscribe monthly to. This will help lower initial costs of buying a Tesla (selling it without a battery) and will probably open the market of electric cars to people who couldn’t usually afford them - But will also completely cut out any wait time to charge which to some is still a deterrent.", "score": -3, "replies": []}, {"body": "Tesla has lost half its value.  Is basically insovent its value. Bonds are junk status.  Now 'giving away' freebies. \n\nTo the Musk groupies: 'The end is nigh'.", "score": -7, "replies": []}]}
{"title": "Congratulations on tanking the Dow with stupid trade war with Mexico! They said Dow 25,000 would become a thing and now we’re wondering if Dow 24,000 is next. Good luck, everybody!", "selftext": "", "id": "bv7pqv", "created_utc": 1559310367.0, "score": 78, "upvote_ratio": 0.85, "num_comments": 63, "comments": [{"body": "I'm all in bonds :)", "score": 24, "replies": [{"body": "Interesting answer considering WSB... Not puts huh?", "score": 13, "replies": [{"body": "No, I'm autistic so I was told I could join. But I'm not a degenerate so I don't do options.", "score": 24, "replies": [{"body": "My futures son, you are Blessed, for Blessed is he who doesn't sin with options.", "score": 7, "replies": []}]}, {"body": "Apparently options on bonds exist. I don't know which brokers actually let you trade them though", "score": 3, "replies": [{"body": "Like a CDS?", "score": -1, "replies": []}]}]}, {"body": "Nerd alert", "score": 2, "replies": []}, {"body": "Only options I have are Jan 2020 expiration, the rest are in shares so I can at least baghold forever.", "score": 1, "replies": []}, {"body": "Why are you not all in Puts?", "score": 1, "replies": [{"body": "I don't understand options too well. Plus I don't want to be looking at the stock market 24/7, it gives me anxiety and then I can't get productive shit done", "score": 1, "replies": [{"body": "This should be a bannable offense.", "score": 2, "replies": []}]}]}, {"body": "Not brave enough for Inverse ETF?", "score": 1, "replies": [{"body": "Heres what I think is going to happen. Since trump can't get shit done via Congress he's going to use his executive powers such as tariffs to try and get his policies done. Ex.) Tariff China until they give us a fairer trade deal. Ex.) Tariff Mexico until they stop illegal immigration because we can't do it because of democrats. \n\nSo since there's still time before the 2020 campaign he's pulling all the stops and trying whatever he can, even if it might fk up the economy in the short term. But as we get closer to Nov of 2020, he's going to magically get a trade deal with China, and some sort of immigration deal with Mexico. \n\nAnd then the market will be pumped right in time for the 2020 campaign, and then trump can say, look at what I got done by pressuring other countries and now everything is better for us.", "score": -3, "replies": [{"body": "the mango family will be so rich by trading on dads' tweets  he doesnt need to get reelected to own the country.", "score": 8, "replies": [{"body": "We just need to crack his code and we'll have access to that sweet insider intel.  Is someone autistic enough to sit down and make a chart correlating the market to everytime he tweets TARIFFS vs MAGA/JOBS?", "score": 1, "replies": []}]}]}]}, {"body": "Fuck bonds, get real estate.", "score": 0, "replies": [{"body": "I have a house", "score": 6, "replies": []}]}]}, {"body": "Jnug", "score": 9, "replies": [{"body": "Bought $6c 9/20 exp. a week ago, startin to shape up nicely", "score": 1, "replies": []}, {"body": "I'm having a great day with NUGT today", "score": 1, "replies": [{"body": "I'm just trying to get back to even", "score": 2, "replies": [{"body": "haha same. I've been in it for well over a month at $19.44.", "score": 1, "replies": []}]}]}]}, {"body": "RIP everyone’s portfolios, except the bears. Long live the bears.", "score": 7, "replies": []}, {"body": "You elected a stable genius who bankrupted every business he was involved in, what did you expect?", "score": 37, "replies": [{"body": "Bro, he is deflating the economy and saving us from the recession. ^/s", "score": 7, "replies": []}, {"body": "[removed]", "score": -10, "replies": [{"body": "A business is just a name on a piece of paper d00d.  Gotta cap weight these things.", "score": 5, "replies": []}, {"body": "Why are you downvoted for stating a fact that adds to the discussion?", "score": 5, "replies": [{"body": "Orange man bad", "score": 1, "replies": []}, {"body": "OMB.", "score": 0, "replies": []}]}, {"body": "Care to discuss his rate of return?", "score": 1, "replies": []}]}, {"body": "Dang, a random guy on the internet who's never even filed to create an LLC (let alone actually done anything of substance LOL) hating on a guy who's brand is worth hundreds of millions. \n\nNot a great look!", "score": -14, "replies": []}]}, {"body": "It’s almost like Retardamerica should have believed their lying eyes and ears, as they watched the rise of Chump.  Reap what you fucking sow, America.  Fucking morons deserve Trump.", "score": 2, "replies": []}, {"body": "And trumptards will still try to have you believe it's for the good of the country.", "score": 5, "replies": []}, {"body": "Bounce back imminent, no tariffs were put on drugs or tacos.", "score": 4, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Woosh", "score": 1, "replies": []}]}, {"body": "What choice does the president have when congress and activist judges are blocking every other attempt at securing our borders?\n\nWe are getting hundreds of thousands of border crossers a month....\n\nhttps://youtu.be/OnC1gs6nEow\n\nAn existential threat to the country vs you losing money on dumb trades.... which should Trumps priority be?", "score": -22, "replies": [{"body": "you really think some hopeless illegal immigrants crossing the border is an \"existential threat\", when it has been steadily decreasing over the last decade? yikes.", "score": 7, "replies": [{"body": "AMERICA IS THE WORLD'S GREATEST AND MOST POWERFUL COUNTRY. IF YOU DONT WORSHIP AMERICAN GREATNESS THEN GTFO.\n\nalso, poor migrants will literally destroy us so stop them for us mexico. pls pls pls", "score": -1, "replies": []}, {"body": "We are getting hundreds of thousands of border crossers a month.... these are low skilled, low educated, low IQ impoverished people coming to a country that is in the midst of a tech revolution that is automating away the only jobs these people ever have a chance at landing.... meanwhile the left which is pushing for the importation of these masses is trying to buy their votes with expanded social spending when the country already can’t pay for the current poor and homeless.\n\nRapid demographic changes will fragment the country.... the exploding debt will fragment the country.... the tens of millions of third worlders who will be unable to find gainful employment and will be turning to crime or government handouts to survive will provide the finishing blow.\n\n\nBtw.... obvious brigading is obvious.", "score": -5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You do realize washing machines and brick laying machines already exist right....?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "https://www.foxnews.com/us/over-1000-illegal-immigrants-apprehended-on-us-mexico-border-largest-group-ever-apprehended-at-single-time-sources-say\n\nYou know how retarded leftists are when they look at this and think it’s a good thing....\n\nSure, bring millions of low skilled low educated impoverished workers for companies to exploit until there is no use for them once their jobs get automated away... sounds great for the country.\n\nMeanwhile we have half a million homeless people already in the country shitting on the streets, failing infrastructure, and a national debt that will explode as the same leftists push for expanded social spending on the millions of impoverished people they are importing for votes.", "score": -5, "replies": [{"body": "Half million people homeless is the reason why social spending should be expanded. Why is the exact opposite happening including budget cuts to social services and planned parenthood?", "score": 5, "replies": [{"body": "So let’s open the border and flood the country with millions more low skilled, low educated, low IQ and impoverished people during a time the country is experience a tech revolution that is automated the only jobs they ever have a chance at getting, thereby making them entirely dependent on social spending..... so we can justify raising taxes on the middle class, exploding our debt, and eventually collapsing our economy paying for the millions of people.... all while ignoring the fact we can’t even take care of the native poor.\n\nYup. That sums up the lefts worldview.\n\nBTW. Obvious brigading is obvious.", "score": 0, "replies": []}]}]}]}, {"body": "Lol, is this sarcasm?", "score": 11, "replies": [{"body": "Look at their post history.  Mental defects come in all shapes and sizes.  I prefer the autistic options traders to whatever the fuck that person has...", "score": 9, "replies": [{"body": "Yeah... I'm just gonna ignore him.", "score": 2, "replies": []}, {"body": "Awwwww!!!! The guy posting gifs of urinating on trumps face is talking about mental defects because someone doesn’t agree with his blind hate of trump!\n\n\nLolololol....... that’s rich", "score": 0, "replies": []}]}, {"body": "https://www.foxnews.com/us/over-1000-illegal-immigrants-apprehended-on-us-mexico-border-largest-group-ever-apprehended-at-single-time-sources-say\n\nThe question is are you ignorant of what’s occurring or just apathetic?\n\nTrumps tariffs on Mexico is about getting another country to stop intentionally aiding an invasion as much as it is about economics.", "score": -10, "replies": [{"body": "Only retards think that we should have open borders, but also only retards think that the current \"crisis\" is a top-10 problem in the US right now.  Yeah, the numbers are ticking up, but that's after dropping for decades.", "score": 4, "replies": [{"body": "https://www.foxnews.com/us/over-1000-illegal-immigrants-apprehended-on-us-mexico-border-largest-group-ever-apprehended-at-single-time-sources-say\n\n“THIS IS FINE”\n\n- leftist retard\n\n\nObvious brigading is obvious.", "score": -4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Hit too close to home...?\n\nToo many retarded members in your family tree?", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Stop trying to make “retarded” taboo..... the harder you try the more I’m going to use it retard.\n\nAlso I’d suggest not butting into comment chains where you don’t add value.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No one.... my parents actually loved me. That’s why I’m not a brain dead, self hating leftist who is so insecure with myself I need to constantly virtue signal to be able to sleep at night.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Why are you still replying when you have nothing to say?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "*yawn*", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "You'll have to do better than spamming an article about a single incident written by the propaganda arm of the White House.", "score": 1, "replies": []}]}]}]}]}, {"body": "  You know why people from Mexico used to come to the US in droves? Because the economy was bad, and they thought they could find better paying jobs in the US, which they could use to send money back home to support their families.\n\n    In the last decade or so, Mexico has become much more stable, and their economy has been doing well, so we have fewer and fewer Mexican immigrants. Most migrants now come from places like El Salvador, Guatemala, and other Mesoamerican countries, because they're fleeing violence from cartels, gangs, and rebel groups. And, additionally, there's a very good reason we don't arrest all of those migrants: they're seeking asylum, and the US has a policy of *not turning away innocent people who are facing violent, bloody death*. \n\n   Additionally, many aspects of the US economy rely on the labour migrants provide. We don't have many native born people who are willing to work hard, low wage jobs in the fields, and our population is aging at an increasing rate. We need new people to overcome the gap in labour we'll be experiencing as more and more Boomers hit retirement age. Immigrants especially have proven to be a good source of new labour. They're good citizens: they pay their taxes, first gen migrants are less likely to commit crimes, etc. Think about it: these people have gone through hell *just to be in America*. They've crossed through dangerous territory (both politically and environmentally dangerous) just so that they can seek a better life in our country. They exemplify the American Dream, they make us a better nation, and we should be welcoming them with open arms, not putting them in cages.\n\n    Long story short, using tariffs to wreck the Mexican economy won't slow immigration; it'll destabilize Mexico, cause unnecessary human suffering, increase the number of people seeking a better wage in the US, all while worsening the US economy.", "score": 3, "replies": [{"body": "https://www.foxnews.com/us/over-1000-illegal-immigrants-apprehended-on-us-mexico-border-largest-group-ever-apprehended-at-single-time-sources-say\n\nOnly the leftists who are pushing for open borders in order to import votes would not call this an invasion.\n\nImporting tens of millions of low skill, low Is, low educated, impoverished people into a country during a time of technological revolution that is seeing the jobs that low skilled, low IQ, and low educated people being replaced, while at the same time pushing to expand social entitlement spending on this mass of people is the epitome of retarded.\n\n“But but but they pay taxes....!!”\n\nMost illegals either commit identity theft and steal a social security number to pay federal income taxes, or they commit felony tax evasion and don’t pay it at all.\n\nMeanwhile the 20 to thirty million illegals already here cost the taxpayers over a hundred BILLION dollars each year.\n\nBTW.... obvious brigading is obvious.", "score": 0, "replies": []}]}]}]}
