{"title": "It’s going tits up - Global Megathread.", "selftext": "Global because it feels right and self important 🇺🇸 \n\nWant to get a thread of what you think your portfolio is going to look like at exactly mid-day tomorrow instead of running around screaming all over the place. Might be ‘fun’ to look again tomorrow evening. \n\nHere’s mine -\n\nExpecting to make some change on AAPL and SBUX puts. Have some calls but expecting to lay evened out. That’s the best possible outcome for tomorrow for me. \n\nFWIW I think market continues to climb by later this week. Trump will ‘recall’ this tariff because of some agreement they come to by mid week. Got to play by some premise 🤷🏽‍♂️ \n\nI’ll edit my post again tomorrow with an update. Let’s hear it ladies\n\nEdit: called it.", "id": "bl4ige", "created_utc": 1557098431.0, "score": 62, "upvote_ratio": 0.87, "num_comments": 64, "comments": [{"body": "I really dont know of im autistic or pure retard. i bought $DIS calls for this week", "score": 18, "replies": [{"body": "$142 05/10 calls reporting for autism.", "score": 7, "replies": []}, {"body": "I really like your username, and being from a French speaking land, the pronunciation makes it even better!", "score": 2, "replies": [{"body": "thank you! i thought it was clever lol", "score": 1, "replies": []}]}, {"body": "In the same boat as you man. Fuckin eh", "score": 1, "replies": []}, {"body": "That shit is long over. Move on", "score": 1, "replies": []}]}, {"body": "I have my whole portfolio riding on SPY $293.50/$293 put credit spreads — So I’m completely fucked.", "score": 38, "replies": [{"body": "Thou shall be assigned bigly.....F", "score": 39, "replies": [{"body": "I’m thinking I’ll either try to close as soon as the market opens or ride it out and see what happens. No in between", "score": 2, "replies": [{"body": "Markets will detract until there is any positive news. This week is looking pretty grim my friend. You can try to buy some 290 puts at open to limit your losses.", "score": 5, "replies": [{"body": "Damn, and right after a really good month (Im up $3000 or 2250%), Maybe I’ll close at morning and minimize losses", "score": 2, "replies": []}]}, {"body": "People are more likely to exercise a put. May want to close.", "score": 2, "replies": [{"body": "Yeah I’ve been watching futures all night, not looking too good.", "score": 1, "replies": []}]}]}]}, {"body": "You've gone Super Autist.", "score": 5, "replies": [{"body": "Seemed like a good idea on Friday, I had no idea orange man was gonna become the tariff boy this weekend", "score": 5, "replies": [{"body": "Are we talking about 5/17 expiration? For how much credit, like $0.10? While that close to the money and near all time highs? I must be missing something.", "score": 2, "replies": [{"body": "5/6 Expiration, $0.13/contract, 82 contracts", "score": 5, "replies": [{"body": "I guess $3k's not too bad of a loss depending on your account size.", "score": 5, "replies": [{"body": "My account is $3k 🤷‍♂️", "score": 18, "replies": [{"body": "[Orange Man Say](https://res.cloudinary.com/teepublic/image/private/s--h62ju3au--/t_Preview/b_rgb:191919,c_limit,f_jpg,h_630,q_90,w_630/v1545075141/production/designs/3761194_0.jpg)", "score": 3, "replies": [{"body": "Yanno it’s fine, I made most of it off a loan anyway so I’ll just get take out another loan and make it back", "score": 7, "replies": [{"body": "Keeping joco alive in spirit :)", "score": 1, "replies": []}]}]}, {"body": "That’s a year write off depending on how much you’ve already lost", "score": 1, "replies": []}, {"body": "[Oof](https://youtu.be/p13yZAjhU0M)", "score": 1, "replies": []}]}]}]}]}, {"body": ">whole portfolio\n\nand \n\n>good idea\n\nliterally do not belong in the same sentence.", "score": 2, "replies": []}]}]}, {"body": "I bet half of my remaining nut that trade talks resolve on the 15th at 3:02 eastern time.", "score": 1, "replies": [{"body": "That won’t help my position at all since it expires today", "score": 1, "replies": []}]}]}, {"body": "I got a bunch of $GOOG. My break even is about $1200. I’m thinking I will cut my loses and will sell everything at the open and seat on cash for a bit.\n\nBut then, maybe Alphabet is not impacted by the Tariff Man’s tweets. Don’t really know. One thing is for sure, I will keep buying $VOO on every dip.", "score": 10, "replies": [{"body": "Everyone will be weighed down because of the Tariff news, I'm also hoping to buy some VOO and QQQ on the cheap.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Absolutely! AAPL, AMD, NVDA, and QCOM will be among the most impacted as a significant portion of their revenue comes from China.", "score": 2, "replies": []}]}]}, {"body": "I am holding 10k of 5/10 294P.\n\nAssuming current price holds and this opens up at 289, I should be up about 30k tomorrow morning.\n\nI also have 8k of Jnug 5/10 7/7.5C. based on current gold price I think jnug should hit close to $8 which should be another +15k.\n\nOof. Prices please hold", "score": 11, "replies": [{"body": "Damn. That was risky as fuck. Good luck.", "score": 2, "replies": [{"body": "It is? I've gotten too used to this lol. My position in FDs was 38k at some point.\n\nIf this turns out nicely I'm going to cash out for a while so I can stop waking up at 6:30 every morning", "score": 1, "replies": []}]}]}, {"body": "Trump wants lower interest rates and if Powpow man is not going to give them he will get it through trade war. US bond yields are significantly lower in future markets right now.", "score": 10, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "If you were expecting \"this exact scenario\" why you didn't just buy SPY puts?", "score": 4, "replies": []}]}]}, {"body": "I started options gambling last week. Calls on four companies, two expiring next Friday. Puts on one, also expiring next Friday. I’m down on all. Tomorrow I’m expecting everything to become close to worthless and I’ll ride it until Wed/Thurs hoping to regain as much as possible while I pray for the Orangeman to fulfill another bullshit walk as the Chinese got the money talk.", "score": 5, "replies": []}, {"body": "Dumped all my options because theta was rapping me, looks like I got away just before theta got some lube", "score": 3, "replies": [{"body": "Theta was rapping you?  A tube of lube bear trapping you?", "score": 3, "replies": []}]}, {"body": "Got a lot of $AMC going into earnings. I'm gonna go see Endgame again to get my mind off this mess, I suggest you all do too.", "score": 3, "replies": []}, {"body": "#CASH GANG, WHERE MY BITCHESSES AT?", "score": 3, "replies": []}, {"body": "Everything is going to tank... Australian share market just opened and it’s tanking. I’m long SPY call spreads but small enough position thankfully", "score": 2, "replies": []}, {"body": "Calls FB 5/17, NVDA 6/21, MSFT 6/21, DIS 1/2020, VXX 5/17\n\n** so basically tits up except for (only 2) VXX contacts.", "score": 2, "replies": []}, {"body": "Let's remember -- this is classic \"Art of the Deal\". The CHICOMs (Chinese Communists) didn't know Trump wanted to drop this one them, so they are startled by the news. Let's also not forget -- the CHICOMs NEED this deal badly. That manufacturing index report at 50.1 is no bueno for the Chinese, and the tariffs are starting to have an affect on their industrial base. The Chinese may make some \"reassurances\" to Trump Monday, maybe Tuesday, and Trump follows up his threat with a \"clarification\".", "score": 4, "replies": [{"body": "That’s my theory as well, Trump just said the other week that his re-election campaign is going to centre around the economy, the Chinese need this deal right now with their slowing growth. Trump gets his point across and his buddies make a few hundred mil in the ensuing volatility. Unless of course the Chinese say fuck this shit, we’re sick of oil sanctions on Iran and we’d like to be paid back all of this US debt we took on...", "score": 2, "replies": []}, {"body": "At this point, Trump should be deep throating the Chicoms, not the other way round.", "score": 1, "replies": []}]}, {"body": "If S&P500 futures are down 2.16% how far down  do you think SPY will be at open?", "score": 1, "replies": [{"body": "Now they're down about 1.9%, I'm thinking SPY will open about 1.75% down and then work its way back up to about 1% down overall tomorrow.", "score": 2, "replies": []}, {"body": "Big funds are going to say “Fuck this shit.” and pull money out before the opening bell even goes off. Retail bull is fucked.", "score": 1, "replies": []}]}, {"body": "I've got 5 put debit spreads on spy 294-293 so I expect to close them all asap and wait for things to settle down.  One of those situations that I'd probably be better off naked for a few minutes but my max close is about 162%, and I think I'm getting most of that.", "score": 1, "replies": []}, {"body": "Healthcare calls... I’m praying this one works out.", "score": 1, "replies": []}, {"body": "Got SPY 290 Puts for 06/07... will probably ride them a bit longer and see how low she goes.", "score": 1, "replies": []}, {"body": "$220 AAPL calls for Jun21. $95 EA call for Jun21. $75 SQ calls for Jun21. Will probably sell it all at open and regroup.", "score": 1, "replies": []}, {"body": "SBUX puts. So you are the one keeping it above -1%. My May $80 Calls thank you", "score": 1, "replies": []}, {"body": "So fucking green", "score": 1, "replies": []}, {"body": "I shorted SPY end of last week and sold calls (thanks to a model I completed after a year, just last month), been collecting data based on strictly rule trading my model, hoping it pays off tomorrow. Not going to lie I was hesitant to short SPY and sell calls, but I told myself I'd trade strictly on rules and not emotion. We'll see how it goes.", "score": -5, "replies": [{"body": "Thread about unpredictable news from Orangeman. You respond by talking about how good your rules-based model is... true autist.", "score": 23, "replies": [{"body": "I mean I know this is /r/wallstreetbets but I'd rather not dump 100% of my account in options contracts that expire at the end of the week. Also I didn't say anything about it being good, I just said it existed and that I'm hoping things pan out well for me.", "score": -5, "replies": []}]}, {"body": "Please do tell us how much retarded the orange moron will be by the end of this month so that we can adjust our ‘models’", "score": 1, "replies": [{"body": "I'm not sure I understand what you're asking. I think everyone knows you can't eliminate systematic risk, you can only hedge against it.", "score": 0, "replies": []}]}]}, {"body": "I have nothing but technology /software calls. I feel like I'm not that fucked... Am I fucked?", "score": -1, "replies": [{"body": "Not as fucked as me bud", "score": 3, "replies": []}, {"body": "You're mega fucked", "score": 2, "replies": []}]}, {"body": "This is the most retarded thing I’ve ever read", "score": 0, "replies": []}]}
