{"title": "what’s your most profitable option strategy in 2022?", "selftext": "for me, it was naked calls / spread.  i almost blew my account from selling IC on TSLA.", "id": "zvf7x9", "created_utc": 1672029777.0, "score": 16, "upvote_ratio": 0.94, "num_comments": 80, "comments": [{"body": "So far the most profitable for me has been when I enter limit orders that don’t fill and get cancelled.\n\nEverything else is doing worse than that.", "score": 90, "replies": [{"body": "Lol, true", "score": 4, "replies": []}, {"body": "Aight mate, I'll try that one too", "score": 3, "replies": []}, {"body": "Lol for real some days I don’t lose money then it’s a good day", "score": 1, "replies": []}]}, {"body": "Puts on Tesla. I made more money in the last 2 weeks than  all year combined.", "score": 32, "replies": [{"body": "I keep seeing folks talk about puts on Tesla but I’m trying to understand this and I think I’m close but have a question or two. I hope you don’t mind answering. Thanks!\n\nCan you give an example of a bought put that is like shorting a stock?\nI mean if I could buy a put for $80 strike when the share price is at $100 then if the share price drops to $60 - that obviously becomes a profitable Option. \n\nBut I thought you could only buy puts as a way to insure the shares you already own. \nIs there a “type” of put that acts like a bought call?\nThanks!", "score": 1, "replies": [{"body": "You can buy puts on any stocks without owing the underlying stocks .\n\nSay you have Robinhood and want to short  Tesla with naked put .\n\nOpen TSLA, click Trade option, click Buy Put, say you choose Feb 3 @ 60 strike, pay $88. You’re done.\nMaximum loss : $88 \n\nIf Tesla keeps going down, even if it never gets into $60, the value of your option is going up so you can sell the option back anytime before Feb 3 to lock profits.", "score": 6, "replies": [{"body": "Thank you! I appreciate your reply!", "score": 2, "replies": [{"body": "Basically what juicy said. Also keep in mind that even at your strike price, your break even will be slightly less than a your strike price because you pay the premium up front so from the gate , you’re already “down” from the premium You paid.\nSay you buy a contract of a $50 strike price and you paid $500 for that contract. The price needs to drop to $45 for you to break even , even though your strike price is $50. Anything below $45 is pure profit. Super simplified but general gist. Not financial advice", "score": 2, "replies": [{"body": "That makes sense on the break even! \nThe lower the share price falls below that break even is profit but can the other side exercise that option or is it my choice up and until the exp date?", "score": 1, "replies": [{"body": "It’s your choice up to the expiration date. You can wait until that date or buy the contract and turn around and exercise it immediately.. that would be in the realm of scalping options, which I’ve done with spy but I hold the contract for about 5-10 minutes , not exercise immediately.. that was just to explain that you can do it at any time you want.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Sit on cash was pretty good.\n\nEverything else sucked.", "score": 22, "replies": []}, {"body": "Selling calls and call spreads", "score": 7, "replies": []}, {"body": "Butthole spreads", "score": 14, "replies": [{"body": "Sphincter Straddles", "score": 1, "replies": []}]}, {"body": "csps on sqqq and gme", "score": 6, "replies": [{"body": "Are you me? 😁\nI only sell options on those tickers.", "score": 3, "replies": []}, {"body": "GME didn’t work out for me so far but SQQQ has been great amongst the sea of reds", "score": 1, "replies": []}]}, {"body": "Gold future strangles", "score": 5, "replies": []}, {"body": "Naked puts on SARK", "score": 4, "replies": []}, {"body": "Made mid-6 figures selling covered calls on gee em eee", "score": 4, "replies": []}, {"body": "Been selling covered calls on my holdings most of the year. Was doing mainly 45 DTE 0.24 delta, moved to weekly ATM in October/November. Also opened some long puts on S&P in December finally (missed my 410 entry I wanted).\n\nBooked enough theta gains to keep my losses to -8% YTD at the moment.\n\nFeel pretty okay compared to SPY @ -19.84%.", "score": 4, "replies": []}, {"body": "puts on meta in the past few months especially when it runs up to it's resistance levels", "score": 3, "replies": [{"body": "What is meta’s resistance levels?", "score": 2, "replies": []}]}, {"body": "CSP on GME.", "score": 3, "replies": []}, {"body": "credit spreads, butterflies, calendar spreads, buying calls/puts", "score": 3, "replies": [{"body": "Anything you forgot to write?", "score": 6, "replies": [{"body": "i mean i’ve been trading options now over 10 years, i hold several securities licenses. i could easily write a book, lol. but i don’t give out trading advice, it’s too difficult to explain the nuances you need to win effectively and consistently.\n\njust stick to those strategies and master them and you will do great, it’s more about learning when to apply each of them, most people use the wrong strategies at the wrong times.", "score": 4, "replies": [{"body": "Not bad that it took my offensive comment to bring out the ‘right’ answer to OP’s question lol", "score": 5, "replies": [{"body": "lol there’s no right answer my friend, anyone can beat the markets but it takes hard work and serious discipline, as well as a solid foundation.\n\ni was very lucky to find a mentor who had been an institutional trader for 20 years who took me under his wing.\n\ni traded options for a long time before i found this guy and after he showed me how the business side worked for professional traders in funds i never looked back.", "score": 1, "replies": []}]}]}]}, {"body": "How do you use butterflies? Short/long, iron or call/put? Dte? Curious how an experienced trader uses them or how to enter/exit.", "score": 2, "replies": [{"body": "you can use them for directional plays using calls or puts, but also for sideways markets. it depends on the market sentiment and what market makers are pricing in. like the disparity between calls and puts, what the spreads look like. i tend to like iron butterflies/iron condors because i like taking in the net credit. but sometimes the prices can be better for debit butterflies. butterflies work great under a falling market cause they respond positively to vega or an increase in volatility.\n\nto be really great with options you need to know when volatility is about to change and markets go from trending to choppy or periods of consolidation.", "score": 2, "replies": [{"body": "Yes I agree, it's better to just trade on time & volatility rather than direction. Was curious how you used flies specifically, so thanks. It makes sense.", "score": 2, "replies": [{"body": "you got it, may all your trades be winners and run forever 🤣🎁🎄🎅🏽", "score": 2, "replies": []}]}]}]}]}, {"body": "Cash", "score": 5, "replies": []}, {"body": "Iron condors", "score": 2, "replies": []}, {"body": "I put most of my money into CDs, savings, and bonds. Interest rates are good.\n\nOther than that, UUUU was a long term favorite that did okay. Just a few bucks. Better than some of the other meme stocks that I played with.", "score": 2, "replies": []}, {"body": "The market is either trending up or down. When it’s trending down, like in 2022, selling cash-secured puts on SQQQ has been profitable. I prefer to sell options on leveraged broad market ETFs to get higher premiums rather than on individual stocks, which can drop 40% on a single day.", "score": 2, "replies": []}, {"body": "Not doing them if I’m being honest here", "score": 2, "replies": []}, {"body": "Tbh, I’m moved away from selling options and have been doing much better with buying options in 2022. Straight puts/calls and debit spreads. When the market is giving us some more reliable trends, I will move back to selling more credit spreads.", "score": 2, "replies": []}, {"body": "Behind Wendy's and only fans. I am up for the year vs - 20% on SPX", "score": 2, "replies": []}, {"body": "CSPs were my best strategy despite the downtrending market. all credit/debit spread trades finished the year negative. condors we’re net positive by like $50 so basically even. diagonals killed me, down big on those. covered calls also looked terrible as the never compensated for the falling underlying. i watch performance by strategy throughout the year and that convinced me to switch to mostly selling puts with portfolio hedges on spy. gonna stick with that as well for the first two quarters of 2023 and see where the market goes", "score": 1, "replies": [{"body": "What stocks you are selling puts on? And, what is portfolio hedge on spy?", "score": 1, "replies": [{"body": "F / CHPT / GME / TDOC / AAPL / AMZN / TSLA / GOOGL / SOXL / HOOD / XLE / COIN / SHOP / KO. im pretty product indifferent. mostly just look for support lines and sell puts when they have dropped and hope for a little bounce. i’m wrong at least 30% of the time but i find im able to get out for scratch usually with some rolling and patience. my hedge right now is diagonals on SPY, im short the 370s in january and long the 380s for february, placed that when spy was up at like 405 so it’s working for now. idk i feel like this comment makes me sounds smart. i’m not. i make mistakes too but i’m learning as much as i can from the smarter people here as well as around me IRL.", "score": 2, "replies": []}]}]}, {"body": "Damn this site pleb af", "score": 0, "replies": []}, {"body": "What is profit", "score": 0, "replies": []}, {"body": "STACK VTSAX and chill", "score": -1, "replies": []}, {"body": "Naked calls on shit stocks", "score": 1, "replies": []}, {"body": "Selling naked calls on Friday close, that expires at monday", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Which stocks did you wheel on?", "score": 1, "replies": []}, {"body": "Lots of tickers or just a few that worked over and over? This is exactly my goal and plan. But use many tickers to diversify, and I have been assigned.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I am just a few months into seriously employing the same strategy. With the same 2%/mon. goal.  So far, so good, but I am holding a few bags. Weeklies?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Free balance cash adjustment", "score": 1, "replies": []}, {"body": "I did well selling naked strangles and maintaining a delta-neutral portfolio by rolling up/down or selling more naked calls or puts on my strangles after big moves.", "score": 1, "replies": []}, {"body": "CS Puts, some credit spreads, put ratio spreads and jade lizards (which are almost the same thing). Nothing awesome but I managed beat the S&P 500 by a small amount (started trading option around May) even with some stupid mistakes in the beggining. \n\nIn Brazil, where I live, I make most of my profits from long collars (3-6 months), Puts are kinda cheap here, thankfully. I try not to trade without protection here, it's not a reliable country.\n\nSome LEAPS worked out fine but I'm red on most of them now. But some are still a year from expiring so it's ok.", "score": 1, "replies": []}, {"body": "Volatility calendar deta neutral gamma positive spread", "score": 1, "replies": []}, {"body": "Wheeling", "score": 1, "replies": []}, {"body": "Buyouts.\n\nFirst was on ZNGA/TTWO. (50% gains on position)\n\n2nd was TWTR/Musk (100% gains on position)\n\nNow I'm staring down the barrel of ATVI/MS buyout for June 2023 while holding Jan2024 $75 calls I paid $8 for and $85 calls (same date) I paid $4.50 this time around for(I flipped the $85 call 3 times now, usually at 25% gains, the last buy/sell pairing was $4.00/6.00 to pull 50% gains on that position and I didn't expect my buy for 4.50 to get back in to hit so soon after...but here I am...)", "score": 1, "replies": [{"body": "Anything else are you playing/planning with buyouts? I also made decent return with TWTR and  in ATVI with few thousand shares. I am also in arbitrage of TGNA and BKI.", "score": 1, "replies": [{"body": "Not specifically with buyouts in terms of investing in the company being absorbed. I do have a bunch of ATAI $2.5 May'23 calls though,(ATAI life science, I'm not typo-ing ATVI) less about a buyout, more about the relaxing laws around Psychedelics in North American countries.\n\nWill put a disclaimer though that the ARKG Fund (Kathy Woods) has been buying a ton of ATAI this year so if you think she just makes terrible picks, maybe stay away, while if you think this is just \"the investment winds swaying\" through the hedge funds and they'll \"probably recover later\" and you think psychedelics will follow the (now easier thanks to weed) path to legalization....in my mind, chances are the companies that massive hedge funds are picking tend to be the ones that survive and have an easier time not being bought out but rather getting private placement monies to do the buyout of others.\n\nFor ATAI and general psychedelics info/starting point check the \"shroomstocks\" sub...I don't want to direct link incase this sub doesn't allow it...\n\nThanks for the tip on TGNA/BKI, I'm going to go take a look at them now", "score": 2, "replies": []}, {"body": "Sorry for double comment, I didn't want an edit to be missed if you already read my comment;\n\nDo you have an expected timeline to closure for the acquisitions should they go through?\n\n...I'd rather buy 50x $20 options for $2 for a later date than the expected close(for wiggle room due to bureaucracy) that will \"double on closure\"($10k to $20k) than pay $20/share and buy 500shares each making $4, or just $2000...", "score": 1, "replies": [{"body": "Based on recent filing I think that tgna will clear government watchdog soon so they might close in Q1. BKI will probably take longer but it trades at ~60 with merger price to be 70.", "score": 1, "replies": [{"body": ">with merger price to be 70\n\nAre you accounting for cash in the deal only?  Or are you doing quick math on your position based on the amount of ICE shares you'll get and their current value?\n\nhttps://ir.theice.com/press/news-details/2022/Intercontinental-Exchange-Enters-into-Definitive-Agreement-to-Acquire-Black-Knight/default.aspx\n\nThis notes an $85 price, and a value of $13.1B, and other much more recent articles, such as:\n\nhttps://investing.com/news/stock-market-news/intercontinental-exchange-upgraded-on-planned-black-knight-acquisition-432SI-2947057\n\nReference the same $13.1B value of the total deal.", "score": 1, "replies": [{"body": "Sorry  $70 was a typo. Yes with cash portion of the offer is 80% which makes it $68. ICE shares dropped from $118 to \\~$100. so at present the value is 97% of original or $82.", "score": 1, "replies": [{"body": "Sometimes those kind deals fall through but in this case r/R is substantial, the same as with ATVI.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Selling Covered calls and swing trading long puts when stocks are overbought", "score": 1, "replies": []}, {"body": "wheel CRSR", "score": 1, "replies": []}, {"body": "Selling naked uvxy calls 👹", "score": 1, "replies": []}, {"body": "Strangle", "score": 1, "replies": []}, {"body": " 1 x 2 put spreads; selling the closer to the ATM leg once and buying 2 wingy puts when skew is “cheap”.  Good hedge against long stock portfolios.  \n\nSome limited success with same strategy on the call side as well after volatile moves down.", "score": 1, "replies": []}, {"body": "Ratio put spreads as hedges against my portfolio.\n\nI put them on against ARKK too", "score": 1, "replies": []}, {"body": "Wide iron condors on ETFs; spy, qqq, dia, iwm, gld, Xbi, and some tlt when IV high. 10 deltas from 7 DTE to 30 DTE. When I hit 50% profit I close and move on to the next week.", "score": 1, "replies": []}, {"body": "SPY Covered calls", "score": 1, "replies": []}, {"body": "1-1-x on MES, ES, NQ and GC.", "score": 1, "replies": []}, {"body": "Laddering 3 month t-bills and iron butterflies", "score": 1, "replies": []}, {"body": "Long calls on BBBY during the run-up, and then long put debit spreads on a bunch of things for a while", "score": 1, "replies": []}, {"body": "Calls on BBBY and YANG were by far my biggest winners. \n\nSelling CCs and CSPs on CCL have done quite well.", "score": 1, "replies": [{"body": "Interesting.  What’s dte and delta for ccl?", "score": 1, "replies": []}]}]}
