{"title": "Low Theta Put Sales for Monthly income", "selftext": "I have been selling Puts on higher priced stocks for about a year with 100% success rate. I target 60-70 days to expiration and strike prices 30-40% below the current stock prices.\n\nExample - \nAMZN Mar 2400p. Sold for 19.50 with 74 DTE with a Delta of -.07. \nTSLA Mar 450p. Sold for 5.95 with 66 DTE with a Delta of  -.04.\n\nI usually close them when they have decayed 80-90%. Then start looking for the next down day to repeat. \n\nI have a reasonably big account and most is invested in buy and hold. I’ve been using this method to generate my monthly living expenses while the paycheck goes into savings. \n\nWhat am I not seeing here. Obviously the exposure to complete collapses is pretty high but being protected from a 30% drop feels pretty safe. I have no intention of taking shares and if something very bad were to happen I would close these (not be assigned). \n\nAnd of course free money is great until it isn’t.", "id": "lg9iyp", "created_utc": 1612894481.0, "score": 29, "upvote_ratio": 0.91, "num_comments": 73, "comments": [{"body": "Rock on. Wish I could do this and have thought of it many times. Unfortunately to sell those two puts alone I’d need $285,000 to cover it.", "score": 29, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Wait a minute... you’re saying I only need like 30k to sell monthly puts on AMZN for literally thousands in premium?? I have a margin account on ToS but I wasn’t aware I could leverage up this much. Can you explain further how to do this and how it would work?", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Question about that last paragraph... So, I too like to suss out my trades with the same Risk Profile lines and compare different strikes to understand the margin. But are you saying that you run a separate account with a simulated trade bumped to a higher strike? Or by simulated trade, do you mean the analysis from the Risk Profile tab?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks. This whole time I've been right-clicking trades in `Trade/All-Products ` and sending them to the `Analyze`. This speeds things up!", "score": 1, "replies": []}]}]}, {"body": "Followed your instructions and got to a chart with 4 different colored lines. The x-axis must be strike price. Y-axis is usually Profit/Loss, but I'm guessing the y-axis is the amount of extra margin you need? But then these lines start above 0 (start around 500) and then go downward so that might mean the premium is also taken into account?\n\nI haven't really ventured into the \"Analyze\" tab of the ToS app before.", "score": 1, "replies": []}, {"body": "Does this apply to spreads too? If the max loss for a spread is ~$38k, would the margin requirement for that only be about $4k?", "score": 1, "replies": []}]}, {"body": "You need to be approved for naked options (Level 3). \n\nObviously this is quite risky because if there is a massive correction (very possible with this market) you can lose tons of money.\n\nThe meta would be hold you margin requirements in stocks (pref. safe ETFs) so you get returns on that on top of your theta/delta gains.", "score": 1, "replies": []}]}, {"body": "So correct me if I’m wrong, but on TDA, if I need to use some of my margin as collateral for a CSP, I won't be charged margin fees?", "score": 3, "replies": [{"body": "Correct", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks guys, I don't plan to go overboard on margin but this does open up some opportunities for me", "score": 1, "replies": []}]}]}, {"body": "Exactly this", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I mean, it makes sense. The reduction in both collateral and premium are proportional to each other", "score": 2, "replies": []}]}]}, {"body": "What kind of annualized returns are you seeing? Only issue I see with this is it's seriously capital intensive and one bad trade could ruin the party. However, The odds of TSLA or AMZN dropping 30% are extremely low as shown by the delta. The DTE is long so if AMZN or TSLA don't go up fast then you'll have to wait longer to collect more of the premium.", "score": 5, "replies": [{"body": "I have 2 sets so one is expiring every month. I closed the Feb expires on 2/1 with 95% decay already. Generally i am focused on a $ amount return (my monthly expenses) rather than a annualized return, but it looks like 1.5- 2% return per month", "score": 5, "replies": [{"body": "Your account sounds pretty big. Assuming you have well over $500k, I think if I were you I would sell way OTM SPY put spreads and rake in $5-10k a month\n\nWhat are your thoughts on that? Is it as easy as it sounds?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Just to be clear, these are NOT CSP. I’m using my margin side too. I target $9k/month pretaxes", "score": 3, "replies": [{"body": "It’s a naked put", "score": 3, "replies": [{"body": "Literally can't go tits up.", "score": 3, "replies": []}, {"body": "Definitely not Naked Put. Not sure any brokerage account allows that. Margin Secured Put", "score": -5, "replies": [{"body": "A put can either be cash secured or not. While you can sell a put on margin, it is considered naked if it’s not cash secured.\n\nEDIT: there nothing wrong with using leverage or selling naked where appropriate, but it’s important to note that there high risk to selling puts on margin.", "score": 5, "replies": [{"body": "Yes. I think of Naked as even past Margin. I don’t think that is even possible.", "score": -6, "replies": []}, {"body": "> there nothing wrong with using leverage or selling naked where appropriate, but it’s important to note that there high risk to selling puts on margin\n\nTrue, but the times I've been at risk of assignment and have run the numbers, I find that the margin required for the naked put is only slightly less than the one needed to hold the shares. So as long as I don't overleverage, the assignment bp is already mostly staked out.  I'm on Fidelity, but it might be diff with other brokers (Fidelity has their formula up on their website for the curious).", "score": 1, "replies": []}]}]}]}, {"body": "This is key. I'm a buy-and-hold investor and sell CSPs on the side in order to take advantage of the margin on my account (without paying interest).", "score": 1, "replies": [{"body": "I missed a key word. These are NOT cash secured.", "score": 0, "replies": [{"body": "Margin Secured Puts?", "score": 2, "replies": [{"body": "Yes", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I’m not sure but I have Level 4 Options approval. I didn’t do anything super special to get that. You apply and answer a few questions. FYI. I made my first option trade in 2009. Sold 1 contract of HAS and made $35.", "score": 2, "replies": []}, {"body": "Fidelity requires level 4 options trading to sell margin covered puts.\n\n[Fidelity margin FAQ, first item under \"options trading.\"](https://www.fidelity.com/trading/faqs-margin)", "score": 2, "replies": []}]}]}]}]}, {"body": "how are you not paying interest ?", "score": 1, "replies": [{"body": "Because I'm selling puts, which adds money to my account.", "score": 3, "replies": [{"body": "i’m totally new to margin and have never used it. if you are selling puts, margin interest won’t kick in until assigned?", "score": 3, "replies": [{"body": "Correct! So it's a great way to add a \"free\" income stream without touching my core buy-and-hold portfolio. If assigned, I'll sell an aggressive CC with low DTE to get the stocks called away. Or just sell the stock if it makes sense.", "score": 4, "replies": [{"body": "Yes. This.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "your approach is perfectly fine. you're getting low reward for taking low risk.\n\nI would suggest staying within 45 to 60 DTE to really capitalize on the acceleration of theta decay per day starting from 45DTE.\n\nFor tsla, a 5 delta is very reasonable and safe since tsla is very volatile and perhaps overvalued.\n\nFor AMZN, I would suggest selling closer to 15 delta at least since its currently still undervalued, getting assigned sub 3000 wouldn't be a problem at all\n\nBasically, the more stock is undervalued the higher delta you can go with, the more overvalued a stock more you with a smaller delta so that you dont have to baghold at a higher  price\n\nand yes selling on a red day is a good start for people that are not savvy with technical analysis to better time the market", "score": 3, "replies": [{"body": "Thanks for the feedback. I pick the lower Delta because I want to reduce the risk of assignment. Like U/NoobsniperWill above, I am selling about 2x of my total portfolio value. I’m making my monthly cash flow target at 1.5% monthly return so anything more is gravy, but I agree with your point on AMZN.", "score": 1, "replies": [{"body": "Can you explain how you're going so deep into margin? What's your portfolio makeup?", "score": 2, "replies": [{"body": "You can check the margin requirements on your broker. For E*TRADE, both AMZN and TSLA have a 15% margin requirement. So a single 2400 AMZN put requires 36k purchasing power.   Meanwhile something like CRSR has a 100% margin requirement. These can be changed at any time (GME was changed to 100% during the madness). So you don’t want to use everything. But if I have both sets running (one at 60 DTE and the other at 30DTE) I get pretty close to full margin use (~90%)", "score": 1, "replies": [{"body": "Ah I was wondering why it looked cheaper to sell amzn puts. Because the broker is only calculating exact cash you need to make the trade. Isn't it risky to push way into margin if you get assigned and have to hold?", "score": 1, "replies": [{"body": "The point is not to get assigned. It would take a 30% haircut on AMZN to get assigned. Very likely this kind of drop would not happen over night nor exactly on expiration. Even if it did happen overnight (let’s say tonight) I would roll or otherwise close rather than be assigned.", "score": 1, "replies": [{"body": "I have 600k account. Can you prescribe growth methods? How do I utilize margin effectively", "score": 1, "replies": [{"body": "With that much money, I would make your own post asking for advice. You'll get a lot more help that way.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I use E*TRADE", "score": 1, "replies": []}]}]}]}, {"body": "I am so tempted to sell all holdings of mine and just write CSPs on TSLA. I want to own the stock and the premiums are so nice but I cannot afford a lot unless I put a big percentage of my holdings towards it. My thesis, however, is similar to you. Write CSPs (I know you use margin but the idea is the same) on TSLA at a strike price of about 15% lower than the underlying. Collect the juicy premiums on monthlies (weeklies is too much stress for TSLA in my mind) in the meantime.\n\nWhat do you all think?", "score": 3, "replies": []}, {"body": "I do this strategy as well with margin short puts on AMZN, I prefer to do 30 to 45 DTE for higher theta decay. \nI try to sell puts  at support and buy back at resistance either next day or same day if the profits are good enough. \n\nIf you combine this with strategy with good technical analysis you can get better returns swinging instead of holding the contract for the entire time. Try to take advantage of the IV👍", "score": 3, "replies": []}, {"body": "Same", "score": 2, "replies": []}, {"body": "I do some of the same. I allocate most of margin to puts on stocks like AMZN, TSLA, AAPL.  I use about 10-25% for lower cap value and growth stocks.  The last 5-10% on high IV speculative plays.\n\nThe latter has been pulling in the most profit recently...\n\nEdit:  this is also why I don’t believe folks who say “well you can’t beat the market!”", "score": 2, "replies": [{"body": "You beat the market because you goes in on margin and take on more risk. If you do purely csp zero leverage after accounting for the losses and not having enough capital to do multiple small lot you will see that the market beat you.", "score": 1, "replies": [{"body": "I put all my money in spy.\n\nI sell one SPY put at -0.05 delta \n\nI make zero additional trades the rest of the year.\n\nI’m pretty sure I’m going to beat the market even if by some chance I get assigned.", "score": 1, "replies": [{"body": "You will not beat the market selling 5 delta csp.", "score": 1, "replies": [{"body": "I will if I sell on margin", "score": 0, "replies": [{"body": "Then you take on additional risk. It’s leverage how is that beating the spy? The 5 delta regardless of time frame or frequency could not beat spy. Try to randomize it once a year since inception pick your time frame you will have negative yields.", "score": 1, "replies": [{"body": "I am holding 100% long SPY etf\n\nI have a margin account.\n\nI write one SPY way OTM put on margin. I don’t get assigned.  I collect premium.  I don’t pay any interest on margin since I was not assigned. \n\nI don’t make any additional trades\n\nI will beat the market (albeit by a minuscule amount) 95% of the time", "score": -1, "replies": [{"body": "No you won’t lol.", "score": 1, "replies": []}]}]}]}]}, {"body": "Didn't you just say you play margin with amzn", "score": 1, "replies": [{"body": "Yup. I sell puts on AMZN. I think it’s undervalued and sold a near atm put when it dipped down to 3000 at 45 dte.  I would be fine getting assigned 100 shares at under 3k.", "score": 1, "replies": []}]}]}]}, {"body": "What exactly does \"you can't beat the market\" mean in this context, just that trading won't consistently beat buy-and-hold on your choice of index? If so that's ridiculous.", "score": 1, "replies": []}]}, {"body": "Fyi for anyone curious I'm on PM with TW and I can sell AMZN 2300P 66 DTE for $4.85/contract using $5,053 in BP. So 53% annualized for the risk of getting assigned at 69% (😏) of the current price.", "score": 2, "replies": [{"body": "Exactly. Not bad right", "score": 1, "replies": [{"body": "When did you sell this AMZN put? It nets 4 times the premium I see now. \n\nThis is a fine strategy if people are really fine with owning the underlying at 30% discount (AMZN maybe, but not TSLA imo). The only problems I see with this are sharp downturn and / or volatility spike leading to margin calls even if it's nowhere near your strike. The other is a dotcom bubble type of crash where the entire tech sector went down and didn't recover for a decade. Unlikely as they may, worth some thoughts.", "score": 1, "replies": [{"body": "This one was sold on 1/4 so 74 DTE. It was earlier than planned but the premium had spiked so I jumped a little early. However, in this range of Delta for AMZN is not usual to bring ~$20. I sold Dec 2200p for $20, and Nov 2000p for $21.75.", "score": 1, "replies": []}]}]}]}, {"body": "I am doing the exactly same. With a relatively large portfolio size, it is more important to have consistent returns as cashflow than to take high risk/reward trades. I have 60-70% of my portfolio in stocks/ETFs I am holding and the rest in selling puts. I am selling notional values about 2x of my total portfolio value. For returns, I am targeting 3% to 5% per month, but even 2% is sufficient for me to not be a corporate slave.\n\nLooking back at March crash, having long DTE 30% to 40% OTM puts is still pretty safe IMO. First of all the market didn't drop 30% in one single day, and it usually bounced up and down so we have plenty of time to adjust, roll over, close or hedge.", "score": 2, "replies": []}, {"body": "Sound like you have a big account. You can just buy the index and get 100k a year doing nothing.", "score": 1, "replies": [{"body": "SPY historic average is about 7% annual and it varies from year to quite a bit. 7% is about half the return I am seeking.", "score": 2, "replies": [{"body": "Where you get 7% ? Every source cite 10% since inception excluding dividend.", "score": 1, "replies": [{"body": "Yeah. 10% is probably a better number. This is where the majority of my account is. In order to get 9k a month you need 900k. I don’t have that much. Also, general market returns are very lumpy. I am using this method to extract cash for my monthly living expenses. I appreciate the regularity.", "score": 2, "replies": []}]}]}]}, {"body": "Is there a reason why you chose 74 DTE?", "score": 1, "replies": [{"body": "In this case I had already closed the previous month round so I was watch for the next entry. AMZN went down with the rest of the market for 3 or 4 days and this spiked the premium. I got it at 19.50 and it was back to 13.50 in 2 days. Then the slow decay. So it was opportunity based.", "score": 2, "replies": []}]}, {"body": "I think for a big account selling theta on AAPL, AMZN and SPY would be worth it for extra income.\n\nProbably 10% OTM CSPs.", "score": 1, "replies": []}, {"body": "Good stuff man. Have you thought about going closer to the money but closing wins at a lower % of theoretical max? I'm still trying to find the right balance on those two myself and I always hear 'more premium + earlier close'. Looking to hear from the other side too.", "score": 1, "replies": [{"body": "Yes. I have looked at that almost every time I roll to the next month. The premiums are SO much bigger. But then I tell myself to stick to the plan. Avoid assignment or even stress of getting too close. I’m pretty sure on AMZN it could be closer and close earlier", "score": 2, "replies": []}]}, {"body": "\"About a year\" I've heard enough", "score": 1, "replies": []}, {"body": "I see that some people described this strategy as \"low risk\" or \"safe\". If you're talking about the probability of the stock price dropping past the strike, yes, the probability is low. But I won't say this is \"safe\" or \"low risk\", especially if you don't plan to take assignment or the short put option is not cash secured. This is simply a type of high winning probability but low option premium type of trades. You may win 95-99% of the time. But when you lose, you will have to give back perhaps a few months of profits you've made.", "score": 1, "replies": []}, {"body": "You’re risking hundreds of thousands of dollars to pick up less then 1% a month? \n\nEither of these companies could implode leaving you tens of thousands of dollars down and undoing decades of work. Especially Tesla, that’s just playing with a live hand grenade for pennies.", "score": 1, "replies": []}]}
{"title": "Where the next year takes us..", "selftext": "Hope everyone is doing well this fine day. Here are some good and interesting stocks to add to your research list. Not everything has to be A GME AMC bagholder debacle. Where are they now?\n\nAnyways, There are many good plays to watch out for: OPEN,  offers to property sellers through an online process, improves and repairs the properties it purchases, and relists them for sale. Markets are changing folks. People want instant demand. OPEN had a nice runup today but within the next 6 months will be wayyyy better. This is a strong hoousing market play that will shake up the industry. Like uber to taxis. Q4 earning on 4-March-2021. Don't sleep on these guys. Holding long with stocks on this one.\n\n&#x200B;\n\nPLTR. Ive been mentioning this one time and time again. I firmly believe in this company. They have a strong leadership team. They are pulling in big contracts and their financials are looking promising. They havent mooned just yet and I am personally invested in this company. However, I am only mentioning this stock for the potential it has. It is a massive analytic software company that can do amazing things. Their software program combines massive data queries into a seamless almost gamelike visual representation easy for the user to comprehend. Yes they had a nice runup recently do to an IBM partnership. I am holding long with stock since it was $18 and i have LEAPS for Jan 2022.\n\n&#x200B;\n\nA more risky stock with the potential for a large runup is CLOV. If you dont know who Chamath is, he is a legend now and someone i highly respect in the financial world given his background, knowledge, and calling out those hedge funds during the GME debacle. CLOV is a healthcare provider play. Now why is this a risky play? Well with Biden as president of the USA, he plans to decrease medicare eligible age from 65 to 60, I know thats huge. Currently, each week, there are 10,000 new people eligible for medicare. those are some massive numbers, numbering billions added in revenue for the industry. Chamath is on of the major reason behind this stock. He is a person focused on growth. He assisted Facebook back in the early 2000s and look where they are now. His backing of CLOV will put them in the spotlight especially if there are positive changes to medicare (especially since offfering medicare plans is their specialty). Chamath walks the walk and talks the talk. But as always do your own research. I personally invested stock in this company. and i look forward to see where this goes.\n\n&#x200B;\n\nLook at the big picture everyone! Stay positive and ask lots of questions.\n\n&#x200B;\n\nSo now what should you do with this information??\n\nTLDR: OPEN, PLTR, CLOV good stocks. DO YOUR OWN DD\n\n&#x200B;\n\nEDIT: Thank you everyone for getting me to 1.0K Karma. Glad i can help this community. And thank you all for the awards. We all deserve something positive in our lives :)", "id": "lgfgvt", "created_utc": 1612910356.0, "score": 140, "upvote_ratio": 0.8, "num_comments": 69, "comments": [{"body": "PLTR gang checking in! 294 shares! This week's going to🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 62, "replies": [{"body": "Im not married to the stock, i have about 150 shares, but i thoroughly believe in what they do. Lets see where this rocket takes us", "score": 12, "replies": [{"body": "I'm in it for at least one year. If they keep the momentum going with new contracts being signed left and right while keeping their costs down, I'll happily hold for multiple years. It's not a 10-bagger in 10 days, but I'd be happy with a 10 bagger in 3 years", "score": 11, "replies": [{"body": "damn ill be happy with a 10 bagger in 10 years too.", "score": 3, "replies": [{"body": "but would you prefer a 10 bagger in 3 weeks?", "score": 7, "replies": [{"body": "not at the expense of my entire portfolio. If it was guranteed then yes but all it takes is one bad play and its all gone.", "score": 3, "replies": []}]}]}]}]}, {"body": "Any price target for this week or next week??", "score": 2, "replies": [{"body": "I think it can hit $40, then it'll either flirt with $40+ after earnings, or dip back down to low $30s for a while, consolidating, and then moving back to $40+. I'm weirdly bullish on earnings since they're releasing pre market-open rather than after-hours.", "score": 4, "replies": [{"body": "It did go to $45 a couple weeks ago so hopefully at least $45 on earnings day. And yeah it seems odd that they are releasing earnings before market open and their headquarters is Denver so thats really early for them lol", "score": 1, "replies": []}]}]}, {"body": "Bought a ton of shares today. Earnings i had a feeling would dip a lot. Luckily i realized some gains when it was at 37.", "score": 1, "replies": [{"body": "I sold at a 1% loss, already bought partially back in. Going to load up over the next few days. I'll end up with more shares then I had for the same amount of money, so doing well :)", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "People just dont want the hassle of realtor companies totally get it. Im going to buy my first home soon and wish it was simpler. But markets are being uprooted, things dont always stay the same. thanks for your personal input", "score": 1, "replies": []}]}, {"body": "Regarding CLOV (credit to u/Dunduin I didn’t write it)\n\nBuy CLOV, the Hindenburg report was ignorant garbage\n\nThe new $CLOV research released by Hindenburg Research is severely flawed. I honestly do not think they understand how the healthcare payment system works. This seems like an obvious attack on Chamath for his criticism of short sellers recently and support of us retards\n\n1. The DOJ investigation is doomed from the start. Kickbacks are hard to prove and can be structured in many legal forms\n\n2. Operating at a loss is the norm for disruptive companies and the fact they plan to be profitable by 2023 is impressive.\n\n3. Criticizing Clover for sales tactics that mislead the elderly is just laughable. Having a company you own help patients with insurance choices is the least deceptive thing insurance companies do. You may as well dissolve the AARP (please do) for screwing seniors for decades\n\n4. Clover was fined by CMS for misleading tactics, but CMS fines companies CONSTANTLY. CVS/Caremark/Aetna is caught defrauding the government every year but they just get a slap on the wrist.\n\n5. The assertion that Clover mislead patients about services shows just how little Hindenburg understands our healthcare payment system. Insurance companies promise coverage to patients in regards to tier based copays and networks that they CONSTANTLY change\n\n6. Seek Medicare, as I mentioned before, is no different than Geico giving you quotes from multiple insurance companies. This is nothing compared to CVS/Caremark/Aetna sharing patient data to steer them toward conglomerate owned services.\n\n7. Going after Clover for marketing their software as a driver of sales because they use a marketing and sales team is just lazy.\n\n8. Removing your name and ownership of companies for compliance reasons is incredibly common. So your company uses a company you know and trust? Big deal. No one will care about this when they let conglomerates go with a pinky promise that they won't share data\n\n9. You are allowed to give out gifts to offices. A certain amount is allowed per year.\n\n10. They are seriously attacking insurance for upcoding like it is something new. They all do it, intentionally or unintentionally. It is easily passed off on a mistake when they are audited. This is not groundbreaking information\n\n11. If the software is easy for people to use, it is improving patient care. And guess what, ALL HEALTHCARE SOFTWARE IS DESIGNED FOR CODING PURPOSES\n\n12. You want it to be difficult to do things like remove diagnoses in your software. It is intentional to prevent you from making a mistake. All software has tedious crap to make sure we don't unintentionally delete something important\n\n13. Paying physicians more is always going to delight them. Using a criminally underpaying system like medicare as a baseline just shows how little Hindenburg understands\n\n14. Getting physicians to adopt new software is HARD. They seriously retire or quit over stuff like that. Adoption rate will be slow, so the fact that those who have adopted are using the software 98% of the time is a big deal\n\n15. If you were to call 100 doctors offices, 99 would complain about the software. Providers HATE software. Insurance companies require more and more paperwork every year and the software that helps with that is always criticized.\n\n16. Hindenburg is calling member growth lump and sporadic while failing to understand that signing up for Medicare only happens at certain times in the year. There is a reason there is a spike every year and slow down.\n\n17. The rest is just a personal attack on Garipalli\n\nThis was by far the laziest and ignorant short report I have ever read. Hindenburg research needs to understand the industry it is talking about before publishing this kind of crap. This was so bad, it encouraged me to grab $CLOV calls for the obvious rebound\n\nI'm not a financial advisor, I'm a pharmacist who deals with this crap all day", "score": 13, "replies": [{"body": "This I already know, but did not want to make this a CLOV post. and I couldnt agree more. But i also didnt want to show confirmation bias or emotional attatchment to a stock. But the facts remains there is an open investigation on the company so the price might dip a little more again. Either way buy or dont buy. Im already in and ill add more if my options do well this month", "score": 4, "replies": [{"body": "I think this is a buy shares and forget you have them for a year or more. Huge potential", "score": 3, "replies": [{"body": "same here. Will be adding more into this and OPEN.", "score": 3, "replies": [{"body": "It could be an insurance giant like Humana one day", "score": 2, "replies": []}]}]}]}]}, {"body": "Airlines, malls, and cruises...2022, 2023 leaps far OTM", "score": 6, "replies": [{"body": "I have Norweigan cruise line bought in at 21. cant wait for people to start going on vacations. Smart man", "score": 8, "replies": [{"body": "Amen", "score": 2, "replies": []}]}, {"body": "Those are all middle class, which is dying. Luxury & poverty goods is where its at", "score": 4, "replies": []}]}, {"body": "I'm in CLOV from $11, the hindenberg stuff making my hands weak but I have a small position anyway, I'll keep it for a bit as long as I'm still green and see if it can recover from the FUD", "score": 5, "replies": [{"body": "Totally feel you but ive sold so many things early when i didnt need to. SOLD MVIS at 7, FCEL at 16...Sad lol", "score": 2, "replies": [{"body": "I also sold PTON at 30, and I had a LOT of it\n\nfelt real great when I saw the price 6 months later", "score": 3, "replies": [{"body": "I feel your pain. thats why nowadays i only use options to rake in big bucks on smart plays and use the profit to buy stocks. then i just transfer the stock to my other trading platform and dont even bother looking at it. Unless its a short term stock like SNDL i just flip it and sell.", "score": 1, "replies": []}]}]}]}, {"body": "Wasn’t OPEN founded by Chamath?", "score": 5, "replies": [{"body": "Opendoor merged with Chamath's SPAC but it was founded by Eric Wu back in 2014. Cool product, top-middle tier unicorn (not anymore i guess)", "score": 2, "replies": []}, {"body": "Unno it was founded last year.", "score": 1, "replies": []}]}, {"body": "Lol might want to edit your post because you say you have Jan 2021 leaps", "score": 3, "replies": [{"body": "wow thanks lol changing it now", "score": 3, "replies": []}]}, {"body": "I dunno about Clover...they're under investigation by the DOJ, and there's a class action lawsuit filed against them. I would wait to see how all that shakes out before buying in.\n\n[https://finance.yahoo.com/news/clover-health-alert-bragar-eagel-020000694.html](https://finance.yahoo.com/news/clover-health-alert-bragar-eagel-020000694.html)", "score": 11, "replies": [{"body": "BofA set a 20 dollar price target AFTER the Hindenburg report and the lawsuit (which only happened as a result of the report). Clover argued the DOJ investigation is routine and BofA seems to agree. Clover is a Medicare provider, if it was a serious investigation would the feds continue to pump Medicare dollars into it? Not likely.", "score": 6, "replies": []}, {"body": "Not only that, they failed to disclose the investigation until called out, all while Chamath was pumping the stock to the retail investor.  But you know... respect or whatever...", "score": 4, "replies": [{"body": "I still think in terms of medicare, the lawsuit wont hinder their performance. The price has fluctuated between 10-13. I dont hear many people mention this anywhere. This is just something i picked up since im from New Jersey. But thats why its labeled as risky lol", "score": 4, "replies": []}]}, {"body": "Yes i Know. But i honestly see this as a temporary setback and why i have it as a risky play. I bought in at $11 for 100 shares. So its not a large amount and I still would like to see where it goes. Im not advising anyone to buy anything. Youd be foolish to listen to a stranger. This is honestly just awareness of potential plays.", "score": 2, "replies": []}]}, {"body": "PLTR gang here (69 shares). I see that they offer a similar product like Splunk (SPLK) in that they can ingest raw data and spew it out to a readable format. I use Splunk daily, and if it's any indication that it's like that, well I can assure you that at the current price for PLTR, and the additional software they offer, it's a total steal. It will be at or above the same levels as SPLK for sure soon enough.", "score": 5, "replies": [{"body": "It goes above and beyond in my opinion. I have no experience with SPLK. but if youre right.....thats a nice price to be at!", "score": 2, "replies": []}, {"body": "PLTR is currently double the price of SPLK", "score": 1, "replies": [{"body": "Splunk is 170's per share. What do you mean?", "score": 0, "replies": [{"body": "market cap is what matters", "score": 4, "replies": []}]}]}]}, {"body": "In OPEN with 300 shares @ 27.30 and I’m already happy. Going to do more DD. If they can hit feasibly Zillow numbers eventually I’m definitely adding.\n\nFingers crossed the housing market stays hot.", "score": 2, "replies": []}, {"body": "I’m with CLOV 12.50c 12/17 exp. I have about 7 contracts at $5.80 price. I’m really bullish and I hope investors look past the short seller report. I barely went in today and I feel I could’ve have a better entry but I’m still feeling good about it.", "score": 2, "replies": []}, {"body": "As far as the Medicare set... 15 years experience in HC here, and those Medicare Advantage plans make LOTS of $$ for the administrators right now. Like - nearly cover the cost for traditional Medicare - big... and younger people are more likely to enroll in that type of plan. So expanding Medicare as it is in any way easily resaturates the market with Medicare Advantage members.", "score": 2, "replies": [{"body": "My family member worked in healthcare and has extensive knowledge. said the same thing...excellent input!", "score": 2, "replies": []}]}, {"body": "I’m in 20k in clov. Dec calls and shares. This thing will see a 60% gain by EOY I’m guessing, and that’s just hitting the price target.", "score": 2, "replies": [{"body": "SO you have lots of conviction. Everytime i go all in on something it goes to shit lol i did a similar play last year, albeit not as disciplined or informed, and lost half my portfolio. But i managed to triple it in the past 3 months. Best of luck!", "score": 1, "replies": [{"body": "Conviction yes, let’s hope not foolish conviction!", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Good luck with it!", "score": 2, "replies": []}]}, {"body": "4490 shares of PLTR $18", "score": 1, "replies": []}]}
