{"title": "Week #15 SPX & PVI Spreadsheet INITIAL Preview-- NOT TRADING ADVICE!!!", "selftext": "\n\n# **SPX Ranges for 4/12/24:  SPX-  5019 - 5378**\n\n\n\nTheata Gang-  Here are the initial steps behind the ranges...about 80% of the process.  This is more data than many institutions compute for SPX each week.  Traders can use this to make an educated guess for SPX Weekly Theta plays...but do your own due diligence!!\n\n**SPX Model Range Profile**\n\n[SPX Model Range Profile 4\\/12\\/24](https://preview.redd.it/bp7fclt2y1tc1.png?width=630&format=png&auto=webp&s=4be69b2b0d1011dcc7c7f5451ec360ee05cc7e9d)\n\n**SPX / VIX Scatterplot Diagrams (less PVI)**\n\n* I have not completed the clustering, multi-regressions, or optimized the slope gradients\n* These are where SPX & VIX intersect next week along 26 different data points\n* Blue dots are labeled PWG (for my brain) and Orange are labeled PVI (final Algo run w/ Volatility)\n* PVI dots will be added when it's finalized\n\n[Scattershot 4\\/12\\/24](https://preview.redd.it/tp9f7qqkz1tc1.png?width=614&format=png&auto=webp&s=aadc4347d3cf28f9f8242631ebddf708f745d51c)\n\nFinalizing the PVI Column is the last step in the process, and cannot be automated  It's all manual and time-consuming.  \n**PVI Spreadsheet Template**\n\n[PVI Spreadsheet 4\\/12](https://preview.redd.it/hzacgupxz1tc1.png?width=1782&format=png&auto=webp&s=3109b8948d4ab8af4da4cfe45981b243917e0b1a)\n\nI will send a PSA Notice if the Final PVI numbers are way outside these ranges.  There are NO GUARANTEES these ranges will hold next week!!  Good luck to all & have a great week!  Feel free to ask questions,  \n-Vet  \n**#TradersHelpingTraders**", "id": "1by3v89", "created_utc": 1712494629.0, "score": 37, "upvote_ratio": 0.91, "num_comments": 44, "comments": [{"body": "**SPX Ranges for 4/12/24:  SPX-  5019 - 5378**", "score": 7, "replies": []}, {"body": "I will look deeper into your posts as I try to learn.  You are greatly appreciated by many, newer traders like myself and more experienced as well, I can be certain!\n\nI recently started playing around with SPX strangles.  21 DTE, I go with LOW delta, leaving money on the table for sure, but starting safe.\n\nNot looking for \"advice\" so much as an \"opinion.\"\n\nDo you find IC would be safer for a newbie to this strategy?  I've never sold an IC, I've sold CSP, CC, naked C and strangles.  Trying to expand my knowledge.\n\nAnd I'm willing to accept less premium, but just wondering a more favorable delta (over .03 where I started).\n\nEDIT:  I notice some are \"am settled,\"  What is the relevance of this from an investor perspective?", "score": 4, "replies": [{"body": "I don't trade ICs. Each credit spread is independent of the other.  Neither are tied to a Delta, but derived from the weekend process.  I think a 3 Delta is a great spot when selling Call side, but is often too low of premium", "score": 5, "replies": [{"body": "Agree with your assessment of 3 delta.  Was my first trade as such so was going super safe to get the 'feel' of the trade over a few weeks.\n\nI'll push it a little going forward.  Thanks!", "score": 2, "replies": [{"body": "Not suggesting you \"PUSH\" anything...the PVI CALL side is only a 2-Delta this week (but PUT side is closer to 7-Delta)", "score": 3, "replies": [{"body": "Yes, I noticed the SKU. I have two strangles open for the week, I sold couple of weeks back, all green. was going to do one weekly, but I didn’t. I have 20 minutes to decide! I got busy with the eclipse…", "score": 1, "replies": []}]}]}]}, {"body": "it's not advisable to sell premium on AM expirations...the position is LOCKED from all brokerages at the COB on the previous day (meaning you cannot close the position) but are still susceptible to Futures overnight", "score": 4, "replies": [{"body": "Thanks for the info.  I wasn't watching that detail too closely, but will keep it in mind.  I have 2 strangles that expiry, sold delta around 5, now down to 2, so if all goes well, I'll close worthless and ensure my next sold strangles are NOT \"am\"", "score": 2, "replies": []}]}]}, {"body": "If i were to do this strategy but on an individual stock, say NVDA instead of SPX. How would I determine the equivalent of the 100 wide strike? Does it even work on individual stocks?", "score": 5, "replies": [{"body": "My takeaway is that it does but you'll need to make your own judgement. For example I don't see much in the way of news that would jump NVDA to above the H section in this list. And given that this week is mostly inflation news I'm thinking the downside chances will be higher than upside so I'll use this set of numbers as a baseline to sell call credit spreads.\n\nMy original spread was above 1000 at 10 width for NVDA.", "score": 2, "replies": [{"body": "Inflation news could be bullish or bearish though, I’m assuming you believe inflation is coming in hot or at expectations again? However vet does 100 wide spx strikes, im just curious as to what he’d do on NVDA. Something like 780/805 and 955/980? Certainly not 705/805 and 955/1055", "score": 2, "replies": [{"body": "I trade individual stocks via the Options Pricing Model, but I still need to know where PVI forecasts NVDA", "score": 2, "replies": []}, {"body": "If I'm going to do it I'm thinking 800/790 put spread. 1k BP for 2% return in 1 week isn't terrible. This means NVDA has to fall over 10% this week and that's probably not happening unless there was panic", "score": 1, "replies": []}]}]}, {"body": "You'd get ~80% win rate on stonks vs 95%+ indexes with same methodology. At the R values involved, it would be close to negative EV.", "score": 1, "replies": []}]}, {"body": "Thank you sir! Can you provide a typical trade you normally do as an example? Say TLT range you show is $88 to $95 (rough numbers/rounded).", "score": 3, "replies": [{"body": "Can't post tables or pics in response...but If I was trading TLT next week, I would go thru all 20 models on it before looking at a chart or volume profile", "score": 5, "replies": []}]}, {"body": "can someone please explain how OP calculates the results plotted in the chart? also, what is PWG and how do you use the info here?", "score": 3, "replies": [{"body": "the data that is in the scatterplot diagram?", "score": 5, "replies": []}, {"body": "PWG is just an acronym (Private Wealth Group) from my professional days.  Most of the proprietary indicators & algos are under PWG.  AUTO / PWG / BASELINE are the 3 Major Algos that factor into PVI (they have the heaviest weighting)", "score": 3, "replies": []}]}, {"body": "How would you create an Iron condor around this data?", "score": 3, "replies": [{"body": "1) Trade on the extreme edges of the SPX Model Range Profile  \n2) Use the 3 Major Models (Auto / PWG / Baseline) and either play the most conservative or average all 3 out  \n- compare that data w/ #1 (Model Range Profile)  \n3) Give yourself extra room if the Extreme Boxes (far right) show VOLATILITY as the Wider Extreme  \n4) Compare all the above data to what you normally do...you should be light years ahead of where you were just a few months ago.", "score": 5, "replies": []}]}, {"body": "The Fed events on wednesday (inflation, CPI, FOMC) makes this week too riksy i.m.o.\n\nDo you take that into account or treat it as a normal week?\nI'm tempted to IC SPX 5000/5050-5300/5350 and close it tuesday night or wednesday morning.\n\nThx for your great info every week.", "score": 3, "replies": [{"body": "I trade it every week, so there's a 4 year track record  on the weekly SPX portfolio.  But a lot of the mid-week breaches happen on Fed event weeks.  Stay small, have cheap longs on for the event by way of Back Ratios or taking profits.  Also sell some 0DTE against your cheap longs.", "score": 4, "replies": []}]}, {"body": "What does PVI mean? \n\nThis is fascinating, I've been selling CSPs and CCs since January and doing ok, except for a couple of assignments that shit the bed, looking at you SNOW and TSLA.  This looks like trying to read hieroglyphics to me right now, but fascinated to learn how to work with SPX instead of stonks.", "score": 3, "replies": [{"body": "PVI is just an acronym Pure Value Index & we used it with our Options-based HF back in the 2006-2013 timeframe.  I agree on individual stocks, it's the main reason I decided to optimize all the Range Models for SPX and just trade indie stocks from the Options Pricing Model tool.", "score": 5, "replies": []}]}, {"body": "u/VeteranWallSt - from reading your past posts. It looks like you leg into each spread/side on Monday morning? Is that correct? General idea of say it both legs are complete by 11am?", "score": 3, "replies": [{"body": "I try to secure opposite side longs on Sunday night, but with Fed Event this week...there's no rush in selling full credit spreads on both sides", "score": 4, "replies": []}, {"body": "Thank you for sharing this info and analysis, apologies but this is a little bit “black box” for me, can you point me in the right direction so that I can understand what this is about? Methodology? Track record? Again apologies if I missed something and thank you in advance.", "score": 1, "replies": [{"body": "The \"black box\" feel is likely the proprietary coding behind the models & algorithms to determine what I call a True Range (PVI- Pure Value Index).  I sell 100 wide weekly Credit Spreads at these ranges on SPX.  I personally hedge rather than roll the positions or use stop losses, which is a bit different technique than Tasty Trades or others utilize.  I posted the performance returns for 2022, 2023, and 2024 Editions in other threads (you could search for \"2023 Edition\").  The system has a greater efficiency in Bear Markets as higher volatility drives premium, returns, and sharpe ratio.", "score": 3, "replies": [{"body": "Thank you. Is this your own code? Python?", "score": 2, "replies": [{"body": "Most were originally drafted in Excel back in the early 2000s, but we run most of them in python currently (although I still run the old script for QC)", "score": 3, "replies": []}]}, {"body": "One final question if I may ask, what is your typical delta on the short legs? I appreciate that you trade on the basis of your proprietary models but I was wondering around what delta range you enter your positions. Thanks in advance.", "score": 1, "replies": [{"body": "This week SPX Ranges for 4/12/24:  (5019 - 5378)\nPuts were 7-Delta \nCalls were only 2-Delta\nI sold both sides of the ES strangle (independently) last night and it was up 39% today.\n\nBut I don’t really track the Deltas, but a lot of the people I trade with do.", "score": 3, "replies": []}]}]}]}]}, {"body": "Thank you for sharing all your knowledge. Question: I am a beginner in front of your trading experience. I was thinking if it would be safe to sell Put at your lowest end say 5019 on 0DTE. I have not looked at premium right now in this side but was wondering if it would be too conservative to pick lowest range or say .12 delta on Put side.", "score": 3, "replies": [{"body": "I would not know how to advise you on your specific trade.  I run completely different Models for 0DTE stuff, but their win ratio is only around 91%.  The Options Pricing Model that I just posted for tomorrow has SPY/QQQ/IWM and indie stocks set as close to 15-Delta as possible", "score": 4, "replies": [{"body": "I see thanks for clarifying.", "score": 2, "replies": []}]}]}, {"body": "Thanks Vet. My plan is 5x IC 5400/5430, 5020/4990. About 650 premium. My DD seems to come in a bit more aggressive than yours. Yesterday I was thinking my short legs would be 5050 and 5375. But I will definitely defer to your 14-0 record. Thanks for doing what you do.", "score": 4, "replies": [{"body": "You trade your own port, but going a little wider at further OTM could generate a bit more premium", "score": 8, "replies": []}, {"body": "What is your expiration date? Just curious.", "score": 3, "replies": [{"body": "4-12-24", "score": 3, "replies": []}]}]}, {"body": "Very interesting. Could you explain the SPX model range profile? Is it made from financial models from other firms? Is this what they’re predicting and so the taller ones mean SPX has a higher chance of hitting that level or not going past that level? Thanks!", "score": 2, "replies": [{"body": "It's not models from other firms, but rather models that are often used in the HF industry.  \nFor this week, SPX High has 6x of the 26 Models suggesting 5295 as their high target, but 5x more Models are pointing towards 5300.  If you were to sell calls under 5290, you would be inside the range prediction from 25/26 Models (not a smart place to sell premium).    \nThe SPX Low has 8x Models that are pointing to 5060 as their low target for the week", "score": 5, "replies": []}]}, {"body": "Can we get a link for this spreadsheet?", "score": 2, "replies": []}]}
