{"title": "Investor's Guide to Gold in 2024", "selftext": "Here is a brief article I wrote about gold ( No link, as my intention is not to promote the site). Mainly just looking to start a discussion about the current state of the market. I still think it has some more room upward, but I wouldn't be surprised by a retracement first obv. Feel free to add any critiscms or feedback as well!\n\n&#x200B;\n\nIn 2024, gold has continued to steal the spotlight on the financial stage, peaking impressively at $2,430 per ounce on Friday, before retracting and hovering around the $2,350 level. This significant ascent, representing a 14% growth since the beginning of the year, challenges traditional market expectations amidst evolving economic policies and ongoing global tensions.\r  \n\r  \n**What's Fueling the Rally?**\r  \n\r  \nMonetary Policy\r  \n\r  \nThe influence of the Federal Reserve's monetary policy, especially its control over interest rates, is a strong factor in the pricing of gold. Typically, lower interest rates reduce the opportunity cost of holding gold, which does not yield interest. This makes gold more appealing compared to interest-bearing assets, as the previous interest income becomes less significant. In 2024, even as expectations for June rate cuts have faded, gold prices have paradoxically continued to rise. This trend can be linked to a broader search among investors for safe, reliable investments in case of a future situation where inflation continues to diminish the real returns of traditional fixed-income assets.\r  \n\r  \nGeopolitical Factors\r  \n\r  \n\r  \nGold’s role as a safe-haven asset is magnified during periods of geopolitical instability. In 2024, conflicts and political uncertainties have escalated in regions like the Middle East and Eastern Europe, prompting investors to turn to gold for security. The metal’s price increase is closely aligned with these developments, serving as a testament to its status as a refuge amid uncertainty. As tensions continue, the demand for gold is likely to remain robust, further driving its price upward.\r  \n\r  \n\r  \nInflation Hedge\r  \n\r  \n\r  \nGold is widely recognized as an effective hedge against inflation, preserving purchasing power when currency values erode. As economic indicators continue to point to sustained inflation, particularly in major economies, investors increasingly rely on gold to protect their wealth. This year’s persistent high inflation rates have reinforced gold's appeal, pushing more investors to add the precious metal to their portfolios as a defensive strategy against diminishing currency value.\r  \n\r  \nDiversification by Central Banks\r  \n\r  \nCentral banks play a significant role in the gold market, particularly through their efforts to diversify reserves away from traditional fiat currencies like the US dollar. Notably, countries like China have been increasing their gold reserves, viewing the metal as a more stable alternative amidst global financial volatility. This strategic diversification has contributed to the upward pressure on gold prices, as it not only shows the demand from central banks but also boosts investor confidence in gold’s long-term value.\r  \n\r  \n\r  \n**Ways To Benefit From The Rise**\r  \n\r  \nBuying Physical Gold\r  \n\r  \nPurchasing physical gold in forms such as coins, bars, or jewelry is obviously the most direct and secure method to gain exposure to the rising price of gold. However, this option requires secure storage and insurance, which increases costs. Additionally, physical gold has lower liquidity, making it time-consuming to sell and potentially involves higher transaction fees.\r  \n\r  \n\r  \nBroader Precious Metals Market\r  \n\r  \nExploring other precious metals like silver, platinum, and palladium can provide diversified investment opportunities while still capitalizing on the sector's momentum. These metals often follow similar market trends as gold but can offer additional benefits due to their industrial applications. Diversifying investments across various precious metals can help mitigate risks associated with any single market.\r  \n\r  \n\r  \nGold-Linked Financial Instruments\r  \n\r  \nFor investors seeking exposure to gold prices without the complexities of handling physical gold, gold-linked financial instruments such as ETFs and mutual funds are ideal. Gold ETFs allow investors to trade shares tied directly to the market price of gold, offering high liquidity and lower transaction costs than physical gold.\r  \n\r  \n\r  \nJunior Mining Companies ( $DC,$JAGGF,$WISE.CN)\r  \n\r  \nInvesting in junior mining companies offers a high-risk but potentially high-reward strategy, as their stock prices may leverage gold price movements. These companies, often in the exploration or early development stages, can benefit significantly from rising gold prices. However, their success also hinges on their operational efficiency and the ability to navigate regulatory environments, making them a volatile investment choice.\r  \n", "id": "1c34jph", "created_utc": 1713022058.0, "score": 35, "upvote_ratio": 0.68, "num_comments": 47, "comments": [{"body": "I like and own gold, but I wouldn’t consider it an investment. More a store of value.", "score": 30, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yep, I think stocks are a better investment, dollar for dollar. Only reason I have gold too is diversification, and it’s fun to own gold.", "score": 1, "replies": []}]}, {"body": "Gold is a store of value, unlike crapto or NFTs or beanie babies or whatever it fulfills all criteria. It's durable, it's highly liquid even in bad times (no Internet etc), it's hard to falsify efficiently and it is always in demand.\n\n\n\nGold is, however, also a commodity. It's a cyclical commodity, a metal with unique industrial properties and a big demand in vanity projects like jewellery. Gold doesn't pay a dividend (nor does many top companies) but it still increases in value over time and can be traded. Short-mid term commodity/trade asset, long term store of value", "score": 1, "replies": []}]}, {"body": "Gold is still the old man. I wouldn’t look at it as in investment to make money off of though. It’s the ultimate disaster fund. And I mean disaster, like civilization falling apart sorta deal. \n\nI personally don’t understand why people would buy gold ETFs instead of physical gold. Sorta defeats the purpose of gold in the first place, IMHO.", "score": 21, "replies": [{"body": ">  And I mean disaster, like civilization falling apart sorta deal.\n\nIf you're investing for civilization falling apart, you better be all in on bullets, guns and canned food. Gold won't do much without legal institutions to hold society together, and if you have those, the markets will still exist (IMO).\n\nNot to mention, who would you sell it to? Why would they buy it from you instead of just using force to take it?", "score": 23, "replies": [{"body": "SWBI and POWW perhaps?", "score": 2, "replies": []}, {"body": "This take is so ridiculously bad and far from reality it should only be said by a *redneck American from a flyover state who's never left his home town*. The whole comment gets laughable to anyone with some sort of real life experience, especially of modern conflicts...\n\n\n\nEver heard of World War 2? How about the invasion of Iraq? The war in Gaza? Or Ukraine? Ever heard of Venezuela?\n\n\n\nStart googling those and prepare to learn quickly. Even when shit hits the fan, even during a plauge like *the black death* gold had value. In *every conflict thought history* gold has had both value and liquidity. Now you may not realise it, sitting in your basement, but those of us in the real world do. Guns and ammo couldn't help you or your family escape war, while gold could pay for safe passage (and still does to this day).\n\n\n\nDon't fall victim to *small thinking*. With money you can pay your way and hire protection. Most people are happier to get paid to serve then to become murderers. Most people like to do buisness if they can and *everyone* knows gold is valuable both in and after a conflict.\n\n\n\nLet's dumb it down further. Your favourite American action movie, what does the bad guy have that make people work for him? *Money*. What works as money, fully offline, fireproof and easy to hide? Gold.\n\n\n\nNow I don't forsee the end of civilization but I do know *every time shit has hit the fan, since the days of Jesus Christ, gold has been the best asset to own*. A gun and ammo can, at best, *give you an easy ticket out* but it can't buy a boat or travel or protection. In fact, statistically, it's more likely your gun kill you or your family members then any kind of bad guy ever... All while gold seems extremely safe, even in the hands of a toddler.", "score": 5, "replies": [{"body": "an apocalypse is a little different than a war", "score": 3, "replies": []}, {"body": "Maybe shave up on your reading comprehension before writing half an essay lmao.", "score": 1, "replies": []}]}, {"body": "Because Gold is one of the 4 Gs you need in the apocalypse: Gold, Guns, Gear & God.", "score": 3, "replies": [{"body": "Replace gold with drugs. People want uppers to stay vigilant, downers for a restful sleep, and painkillers for injuries. Not go mention all the mental trauma. Ain't no functioning hospitals or therapist offices in an apocalypse.", "score": 4, "replies": []}, {"body": "So lead.... the more lead, the better.", "score": 1, "replies": []}]}]}]}, {"body": "Is this some world gold lobby propaganda again or unbiased analysis?", "score": 39, "replies": [{"body": "Gold member is back from space to tell everyone he loves GOOOOLLLLDDDDD", "score": 10, "replies": []}, {"body": "I am sure stock analysis is unbiased and we have good reasons to believe  buy VOO and chill is the best unbiased analysis.", "score": 5, "replies": [{"body": "Arguably we do. Buying a low cost index which invests in 500 companies with minimal fees, and a long established history, presents a minor financial incentive on behalf of the people profiting to manipulate investors. It's more financially viable to continue the operation rather than pump and dump for a quick gain.\n\nSomething like a gold ETF or shitcoin is the exact opposite. The profits are falling to a smaller group which has a pressing incentive to manipulate consumers before the pump and dump fizzles out.\n\nYou see it with shitcoins all the time. I'm not saying gold ETFs are the equivalent of shitcoins but the interest in gold is sparked by inflation, which won't last forever. Who knows how long it will last (the pump phase) but once it falls, there will be the dump phase.\n\nGood for a market play but not really a buy and hold, IMO.", "score": 2, "replies": []}]}]}, {"body": "I’ve been playing this game for many decades now and been fooled into buying gold ETFs so many times that I’m not getting involved with them anymore.", "score": 22, "replies": [{"body": "Teach me...I'm wondering about them and need to learn why or why not to get one.  I honestly cannot form a clear opinion on them.  \n\nTo use a metaphor, there is so much \"candy\" in the store that I keep having decision fatigue trying to get the best piece.  I have an S&P ETF (SPLG).  I have small cap value (AVUV).  I have internationals (IDEV).  I have loads of individual picks that seemed good after some digging.  Am I misguided in thinking gold may be something else to diversify into?   I'm genuinely curious and would love to learn from someone who has experience without paying an advisor to \"sell\" me on their ideas.  Thanks in advance for any advice you're willing to share. 🙏", "score": 3, "replies": [{"body": "Buy VOO.  That’s it. On your way.", "score": 2, "replies": [{"body": "VOO?  Well, SPLG it is for me in that case.  I did get some NEM a few weeks back.  But we'll see.  Thanks", "score": 1, "replies": []}]}]}, {"body": "Good, stay away. Let others get to it first and then FOMO it.", "score": 1, "replies": []}]}, {"body": "I’d prefer to wait till an even higher ATH", "score": 5, "replies": [{"body": "Wait for higher ath to invest in gold? Or sell ?", "score": 0, "replies": [{"body": "Just keep waiting indefinitely. Guaranteed way to do better things with your money", "score": 3, "replies": []}]}]}, {"body": "I’d argue the biggest reason is that any nation not closely aligned with the US has lost faith in the usd as a reserve currency. Part of this is freezing and likely eventually seizing $300 million in Russian currency reserves. Since then BRICS central banks have been buying gold hand over fist and are proposing a gold backed global reserve currency to supplant the usd.", "score": 2, "replies": []}, {"body": "Buy some gold if you are financially secure.", "score": 2, "replies": []}, {"body": "Since the Ukraine/Russia conflict, in which the US/EU froze Russian assets, there seems to be a dramatic uptick in governments across the world buying up as much physical gold as they can get their hands on as a reserve that isn’t tied to the US financial system", "score": 2, "replies": [{"body": "That said, gold doesn’t generate cash flows, so you lose that fundamental driver of returns beyond supply/demand dynamics", "score": 1, "replies": []}]}, {"body": "Have fun trying to sell your physical gold when the time comes.", "score": 5, "replies": [{"body": "Not that hard outside America", "score": 1, "replies": []}]}, {"body": "Gold is like fire insurance. You should have it just in case the place burns down.", "score": 4, "replies": []}, {"body": "Gold Gold Gold", "score": 1, "replies": []}, {"body": "What about the dissapearence of the petro-dollar, surely that puts GOLD back in the drivers seat in the future for what the standards going to be worldwide?", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Yea def jump in at ath. Good luck", "score": 2, "replies": [{"body": "I mean the markets are up way more.", "score": 1, "replies": []}]}, {"body": "I like functional metals at current prices, like copper, zinc and aluminium. I see value in those but not gold.", "score": 1, "replies": []}, {"body": "Now is the time to sell, the fear is more than priced in.", "score": 1, "replies": []}, {"body": "Buy bitcoin instead thank me later", "score": -3, "replies": []}]}
{"title": "The Journey to 100% Annual Returns...2024 Edition, Week #15 Results ($3200 this week)", "selftext": "**$SPX Model Portfolio- still perfect for 2024 & already up 33.19% year to date!!**  Averaging 5.26% Return on Capital per week, the system is designed to generate $1500-2500 in weekly income with minimal drawdown. \n\n[2024 SPX Model Performance](https://preview.redd.it/g5c5aq4k79uc1.png?width=2130&format=png&auto=webp&s=b4ad1c63e21b066a86d668f4837512f83fd522fd)\n\n* **15-0 on the year**\n* **Averaging over $2,200 per week**\n* Returns calculated from a $100k Port\n* Using less than 50% of available buying power\n* **Sharpe Ratio 5.31 ytd**\n\n**The breakdown of our main model ranges from 4/8-4/12...PVI went 35/36 (97.22% Win Rate)!!**   \n\n[PVI Spreadsheet 4\\/12\\/24](https://preview.redd.it/gdpmwxkh89uc1.png?width=1782&format=png&auto=webp&s=4c8ab56c895a65a26de203f3ed2cab16bd7288cd)\n\n&#x200B;\n\n[SPX Model Range Profile 4\\/12](https://preview.redd.it/57qie1ajf9uc1.png?width=631&format=png&auto=webp&s=eea9124ef57aad8269fa9fabe34bc7b0a35cc2a6)\n\nThe system **consists of 26 different models**. Each model forecasts a specific LOW & HIGH for SPX each week.  The above grave is the Range Profile from each of the 26 Models.  You are looking to SELL Credit Spreads or Premium outside the Models (and long Debit Spreads inside the Models).  \nEach model focuses on various components, variances, or coefficients of **PRICE, VOLUME, & TIME**. Other models focus on **volatility, premium pricing, open interest, sector strength, & trend following**.  There are 3 Major Algos (Auto / PWG / Baseline), each providing essential data that feeds into the Final PVI Levels.    \n\n\n[SPX Weekly Range 4\\/12\\/24](https://preview.redd.it/0g74p6h299uc1.png?width=1811&format=png&auto=webp&s=10c2f2f1d1e745d59c5efe06316440734908069d)\n\n Here are the PVI, Baseline, Auto, and PWG Model Ranges for Week #15 against a 1-hour SPX chart.  I've included the WEEKLY SUPPLY/DEMAND box which indicates which side of Theta we want to play aggressively, and the Red Line is the 50 SMA for SPX (anchored to Daily).\n\n&#x200B;\n\n[PVI Weekly Ranges for 2024](https://preview.redd.it/msac9iqob9uc1.png?width=1815&format=png&auto=webp&s=f785ecede71aacc0e7f136e944229718821a0a17)\n\nThe $VIX failed to breach the PVI High (19.25), ES tapping 5150, and SPX hitting the PWG Low & 50 DMA created a long signal at 3:15 pm EST.  (I sent that callout on X & posted on Reddit as well).  I expect a bounce early in the week, provided there is no further escalation in the Middle East over the weekend.    \nFeel free to ask questions.  Please review some of my previous posts for answers to general questions.  I'll answer some topics below.  Have a great weekend,  \n\\-Vet  \n**#TradersHelpingTraders**  \n\n\n* I'm working to create a basic post that can answer all the general questions that creep in over the weekend.  I know it's a pain for members to go back through my posts searching for answers, but it's also cumbersome for me to keep answering the same questions over & over.  Thanks for your patience & positive feedback thus far.  \n* PLEASE DO NOT SCALE UP on this system (or any Theta system).  I have a significant (7-figure portfolio) and still only deploy about $200k notional in this system each week.  \n* The Model Portfolio is $100k and deploys no more than $50k notional in this system.  \n* The premise is not a simple Iron Condor, but each side, Put & Call Credit Spreads are stand-alone trades, 100 wide, and I do not use Stops or Roll the positions out to the following week. \n* Link to my general Hedging process-[https://www.reddit.com/r/thetagang/comments/1c27fho/weekly\\_levels\\_for\\_nq\\_es/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/thetagang/comments/1c27fho/weekly_levels_for_nq_es/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "id": "1c33uq4", "created_utc": 1713020190.0, "score": 111, "upvote_ratio": 0.9, "num_comments": 49, "comments": [{"body": "Yes your posts are like gold. I keep studying them and am slowly deploying a trade here or there.\nTraders helping traders, right?\n🙏 thank you for all you do for the Theta community", "score": 24, "replies": [{"body": "Yes, I coined that phrase **\"Traders Helping Traders\"** back in 1997 and \"WOODIE\" (**Ken Wood-RIP**) was in my trading group as a partner...he started using it for his CCI club.  Miss my old friend dearly & he greatly impacted my early TA & trading results.  I still use a lot of what we discovered back in the early days.", "score": 16, "replies": [{"body": "It’s a great phrase. I’ve been looking for a community that wants to test & share ideas, and get smarter as time goes on. I truly believe there’s a holy grail out there that allows for substantial returns beating the S&P index funds, while maintaining fairly low risk.\nNo need to expect 100% wins of course, but consistent steady gains with minimal drawdown is far more exciting in my opinion!\n\nYou may have discovered it! Let me know if you ever need help. I’m not a market guru like you, but I’m pretty handy in Excel 😀", "score": 8, "replies": [{"body": "Thanks, I've been blessed with some unique opportunities in trading over the past 3 decades.  Managing money for a Billionaire, trading with one of Citadel's HFT PMs, and partnered with some absolute genius quants.  My original algo was 12 tabs in excel (definitely not coded by myself), one brilliant individual added some volatility coefficients to a couple models (including Black Scholes), and it's been gravy since.  Definitely not a holy grail, as the clench gets REAL at times!  Some of my trading partners have helped me peel the onion back and we've scripted 26 of the models into python for much faster processing.  The increase in efficiency has helped tremendously, but especially when I can point to & know exactly which outliers are where & then seek to find out why.  That process creates a phenomenal edge for me personally.", "score": 12, "replies": [{"body": "Wow, those are great opportunities!\nI was a Finance major in college, but couldn’t land a decent quant gig after graduating, so I went into analytics, marketing, & data science. \n\nI don’t get to crunch the numbers much anymore, mainly managing teams & doing the dog and pony show presenting to senior clients.\n\nBut it’s still in my blood lol", "score": 5, "replies": []}]}]}]}, {"body": "Can you please dumb it down for me what is going on in the post?", "score": 1, "replies": []}]}, {"body": "Thanks for posting. I only recently started following, but you are helping me incorporate risk management. Much appreciated and look forward to seeing the week 16 analysis.", "score": 13, "replies": [{"body": "Thanks for the kind words, and more importantly how it's helping you mature as a trader.  Incorporating discipline & risk management can be LIFE-CHANGING in trading, especially while WSB and associates all chase the money.  True Wealth typically follows discipline & consistency, but there will always be Lottery Winners too!", "score": 14, "replies": []}]}, {"body": "Do you post your trades as you make them or just after you close?", "score": 7, "replies": [{"body": "I can't post screenshots or tables in these replies, so here's a link from another sub...   \n**\\*\\*MODS- please remove if not allowed**, I don't know of another way to display this\\*\\*  \n  \n[https://www.reddit.com/r/IndieTradersGuild/comments/1c33wan/comment/kzef0qd/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/IndieTradersGuild/comments/1c33wan/comment/kzef0qd/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "score": 5, "replies": []}]}, {"body": "Thank you so much for this. Really looking forward to seeing your analysis for next week. I was in an all day meeting Friday so I missed out on the long call, there's always next time.", "score": 5, "replies": [{"body": "I took some profits before the close...there's always Sunday night Futures to open another door.  Friday's close was BEARISH & BULLISH, and large RED candles typically continue.  Just don't rush it!", "score": 4, "replies": []}]}, {"body": "what’s the duration of the credit and debit spreads ?", "score": 4, "replies": [{"body": "Friday expirations (PM only)...so no more than 5 days, but sometimes I'll wait to enter 1 side.  That's why it's not simply and Iron Condor as each side has it's own merits.  With Iran/Israel issue right now, only a fool would sell premium when Globex first opens tomorrow...but I can dang sure start buying CALLS inside the PVI range (once I finish the data) and have the levels.  VIX could/should spike, so if selling does start to waterfall & continues through TUES/WED we'll get some JUICY PCS sold when others are bleeding out", "score": 10, "replies": [{"body": "Judging by the crypto meltdown currently taking place, the Sunday open is going to be deep RED!!\n\nI'll be following along with you to see how the system handles the increased volatility. Fun times indeed!", "score": 4, "replies": [{"body": "I have a conservative algo that can shift/widen the PVI calculations from Friday's cloase...I always run it to see how far an expected breach could run.  It's win rate is stupid (but there is rarely premium in a regular week).\nI may wait for Globex to deploy them...stay tuned", "score": 5, "replies": []}]}, {"body": "Thank you! There’s so many terms that I’m learning from your thread. Thanks for sharing", "score": 3, "replies": []}]}]}, {"body": "I don't understand majority of this post, but I want to understand it. What should I do lol? I know its stupid question but I really want to learn, and I have read the guide already. What else can I do?", "score": 6, "replies": [{"body": "It might take a few weeks, just follow along and ask questions.", "score": 4, "replies": []}]}, {"body": "So this is really interesting and you've got me wanting to play. The only thing I don't get is how are you managing risk if the market moves hard against you and avoiding taking a max loss since I saw you mention you don't have a stop and you don't roll. Max loss is half of your \"$100k portfolio\".", "score": 3, "replies": [{"body": "read the very bottom bullet \"Link to my general Hedging process\"", "score": 6, "replies": [{"body": "I read it, but I'll be honest I don't really understand it 😂 \n\nI don't get what you're doing based on certain price movements. Do you have any examples of getting pushed and having to hedge?", "score": 2, "replies": [{"body": "We've been pushed twice in 2024 (only 1x breach), and I've only hedged 3x weeks YTD.  I've taken profits on all hedges before Friday (but don't include profitable hedges in the Performance returns).  Many times it's reading the market to know what to expect...that's the Art of trading that cannot be duplicated overnight. Understanding when to sell premium, when to create back ratios or take risk off is why I don't post my individual trades on this as it's not realistic for most to follow or duplicate them...but the returns are double the current 2024 PVI Performance.", "score": 7, "replies": []}]}]}]}, {"body": "Is it possible to get a high level summary of what your strategy *is* in about 4-5 sentences?", "score": 5, "replies": [{"body": "- I use a ton of formulas (options, volatility, O/I, momentum, expected moves, etc…) to determine SPX range for this week.\n- I sell100 wide PCS and 100 wide CCS at those levels (if the premium is worth it)\n- I sell up to 50% of BP each week.  On a $100k Model Port, that’s 5x contracts at each side.\n- I use a hedging system instead of taking a loss vis stops, or rolling out to next week.\n- I target $1500-$2500 in income per week", "score": 6, "replies": [{"body": "Thanks! So do you share the ranges your models predicted somewhere?", "score": 3, "replies": []}]}]}, {"body": "I see you say 5 contracts in your sheets. This seems like in theory and IC play, but I am not sure what the final contract is? Also seriously thanks a ton for sharing you have quite an amazing strategy here and I want to start on it Monday with some test IC's.", "score": 3, "replies": [{"body": "I don't sell ICs, each Credit Spread is independent of the other.  On event weeks or something like Iran/Israel, time is on your side so wait to get in or buy distant LONG CALLS & PUTS for cheap ($0.25) and just sell 0DTE against them on Mon/Tues until the global situation settles.  Never jump into a trade with both feet, bc the market doesn't give a hoot about these ranges or data", "score": 5, "replies": [{"body": "Could you comment on my simplified understanding of this?\n- an “event week” leads to major volatility so ranges are less reliable\n- you say “time is on our side” because events create opportunities and there will be chances to take advantage of these opportunities if we’re patient watching the market’s response\n- you buy LONG PUT/CALLs based on the cost (ie, $.25) and not any specific ranges since the volatility throws models out the door\n- then you sell 0DTE options based on the day’s movements. You’re not rushing to sell these for premium if the risk doesnt make sense", "score": 3, "replies": [{"body": "- The Ranges are ranges, outside circumstances that occur after Friday's close does make a difference  \n- Time is on our side bc we're selling Theta...the Cone of Decay is powerful!  \n- This is not definitive.  If We gap down on Sunday night Futs, and never get back to/above Friday's close, I will often purchase the lowest strike with a $0.05 or .10 cost & sell 0DTE against them on Tues/Wed/Thurs/Friday.  My target is 2x what I paid for the long, each day.    \nSay I grab Friday long calls for $0.10, I'll look to sell .20 calls against them each day.  I would likely clear .70 CR on this strat)  \n- Correct, never sell premium if the risk is against you...the longer you trade the more comfortable this becomes", "score": 7, "replies": [{"body": "Can you give examples on long lowest strike and selling 0dte against it strategy? Thank you.", "score": 1, "replies": []}, {"body": "Thank you as always!", "score": 1, "replies": []}]}, {"body": "I'll reply in the morning...past my bedtime & I've maxed out my hours today", "score": 5, "replies": []}]}]}]}, {"body": "new to your posts. Looking at your performance, it seems your shorts are usually close to the PVI, but sometimes both legs of your spreads are in PVI range, like week 15 call spread. Did you open your put spread and call spread on different days? How do you know to make that move?", "score": 3, "replies": [{"body": "Well, I try to stay outside PVI as much as possible, but there was no CALL Side premium at PVI the past 2 weeks. Hidden Alpha, this usually means it is going to be a RED week or we would bounce late in the week.  If we hit Weekly S3 on Monday, there is almost ALWAYS a bounce so we play LONGS back to the Weekly S/D Box (I know this is Theta, but c'mon folks)!  Actually, this is usually when we print $3-$5k weeks solely on the PCS side.  If we're under the Weekly Demand on both Monday & Tuesday, then I roll down the CCS side but still stay above the Wk S/D Box\n\nHere is how last week started (Trading Confirms)  \n[https://www.reddit.com/r/IndieTradersGuild/comments/1c33wan/comment/kzef0qd/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/IndieTradersGuild/comments/1c33wan/comment/kzef0qd/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "score": 5, "replies": []}]}, {"body": "This was posted before all the news about Iran and Israel it seems. Does that impact the models now? And how so? Does it mean that the low end might be broken through?", "score": 3, "replies": [{"body": "All the Models are generated from Friday's close.  I do have some conservative vol coefficients that I'll run tomorrow morning just to be on the safe side if Futures tank tomorrow night", "score": 7, "replies": []}]}, {"body": "How can we small-brains begin to learn more detail about our strategy so we can decide if it fits our trading profile?", "score": 4, "replies": [{"body": "Just follow along and ask questions...its a lot to digest your first time through", "score": 5, "replies": [{"body": "Ok, thank you. I’ve been trading options and futures for 2 years (including selling spreads), so all the terminology is familiar, but the IQ is much higher. I’d love to understand more of your level!", "score": 5, "replies": []}]}]}, {"body": "What is pvi", "score": 2, "replies": [{"body": "Pure Value Index?", "score": 3, "replies": [{"body": "Question mark?\nPositive volume index according to Google.\n\n\nQuestion mark", "score": 1, "replies": [{"body": "Gotcha, I wasn’t sure", "score": 1, "replies": []}]}]}]}, {"body": "Following", "score": 2, "replies": []}, {"body": "Thank you, looking forward to the basics post to answer questions.\n\nI'm super new and inexperienced with this, hopefully I can slowly learn and gain some understanding of this system/method. Some extra income would greatly help cover the bills at home and maybe even savings. :)", "score": 2, "replies": []}, {"body": "Love the spreadsheet.  I have microsoft 365/excel and am looking for a template to track my weekly positions and gains (or losses.). Any recommendation on a template out there (365 or otherwise) would be appreciated!  Otherwise I'll learn how via youtube!", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "I've explained a great deal of the process behind all the spreadsheet data, and there's plenty of \"real info.\"  I posted the data each weekend to provide folks a quantitative roadmap from my own research.  The way I trade the data is my way of avoiding the steamroller, but I've done this personally and professionally for decades.  \n\nSystem- 100 wide Credit Spreads outside the \"bullshit\" ranges.  They are independent of each other, so it's not an Iron Condor.\n\nScaling up meaning selling more than 50% of your Buying Power.  Go read the other posts before you jump on a post & run your mouth.  If you have a complaint, take it up with the Mods, not me...they haven't reached out to me with any concerns, and 95% of the feedback since Feb has been positive", "score": 8, "replies": []}]}]}
{"title": "Week 15 $756 in premium", "selftext": "I will post a separate comment with the detail behind each option sold this week.\n\nAfter week 15 the average premium is $710 with a projected annual premium of $36,903.\n\nThe portfolio is comprised of 87 unique tickers with a value of $146k. I sold NKLA this week, which was the difference in the number of total unique tickers. I have 101 open options with a value of $59k. The total of the two is $205k. \n\nI’m currently utilizing $29,700 in cash secured put collateral.\n\nI sell options on a weekly basis. I prefer cash secured puts and covered calls. Sometimes I’m ahead of the indexes and sometimes I’m behind. My goal is to keep generating a solid income. \n\nLast year I sold 964 options and I’m at 381 year to date.\n\nTotal premium by year:\n2022 $8,551 in premium.\n2023 $22,908 in premium.\n2024 $10,645 YTD.\n\nI am over $50k in total options premium, since 2021. I average about $22 per option sold. I have sold over 2,200 options.\n\nPremium by month\nJanuary $1,858\nFebruary $3,670\nMarch $3,727\nApril $1,390 MTD\n\nTop 3 premium gainers for the year:\n\nHOOD $1,030\nGOOGL $696\nAFRM $617\n\nPremium in the month of April by year:\nApril 2022 $115\nApril 2023 $1,221\nApril 2024 $1,390 (through week 2)\n\nThe premiums have increased as my experience has developed. \n\nHope you all had a productive and successful week. Make sure to post your wins. I look forward to reading about them!", "id": "1c3a1fo", "created_utc": 1713036721.0, "score": 61, "upvote_ratio": 0.87, "num_comments": 56, "comments": [{"body": "Are you selling 1 contract per ticker? \n\nWhen and how do you decide to roll? \n\nWhat do you use as indicators for strike price? \n\nAre these strikes ITM or OTM on sell date? \n\nThanks for posting this. Really helpful for me as I’m learning this. \n\nI’m not yet sure how far out to sell because if I got longer out I get more premium but the collateral is tied up. I have about 23k liquid in my 2 accounts. \n\nAny advice would be lovely. \n\nThanks again. Been following your posts. I’ll post my work next Friday.", "score": 8, "replies": [{"body": "Hi BuyInHigh, \n\nI am usually selling 1 contract at a time. I believe rolling is more of an art than a science, but I do follow some self-imposed rules. 1. I am looking to roll when my strike is being tested within a dollar. 2. I am actively trying to roll when the current value is within $0.50 of the strike. 3. I am mostly trying to roll for a credit, with few exceptions. \n\nThe strikes are usually out of the money when I sell. Unless, I'm being super aggressive with a CSP on a ticker I want to own, I am selling OTM.\n\nI really appreciate the comments, questions, and kind words. \n\nAdvice for someone with $23k liquid that appears to be passionate about learning options. I would recommend doing just that. I learning options by doing. After I got some experience, I supplemented that knowledge with articles about options on Investopedia.com. Some people use the greeks. They are great when you are developing your risk tolerance and setting constraints on managing your positions. It reduces the emotional investing, which for some people is a significant added risk. Also, this sub is a great place place to gain some additional knowledge, that you should definitely fact check. Also, some present opinions as facts. When you are new, it is hard to tell the difference. Lastly, if you think of something that might work, just use paper trading or a watchlist and test it out. \n\nThanks again, and best of luck developing your strategy. I look forward to hearing from you down the road.", "score": 7, "replies": [{"body": "Thansk! I am fairly new. I really appreciate the insight. I started buying stocks in 2020 like so many then met a nasty bear market. I DCA'd on the wrong stuff and got stuck bag holding. Then I started selling calls, usually tight 7-14 DTE and I đid really well in those bear market rallies. Learned a lot of this and that.\n\nI see DTE in spreadsheet. I'm gonna study!\n\nThis year I have decided to start selling puts and finding the learning curve a bit steep.\n\n\b Spend lots of time on psychology and some one the more technical side. My hope is to adopt and master the wheel.\n\nThis post is great help", "score": 5, "replies": [{"body": "Best of Luck, lots of helpful people out here", "score": 4, "replies": []}]}]}]}, {"body": "[link to detailed spreadsheet displaying each option sold this week.](https://imgur.com/a/p6FhXKW)", "score": 4, "replies": []}, {"body": "Great Job again (we all took a bit of a hit yesterday, see what Monday brings) Those HOOD premiums are impressive, not bad at all for a cheap stock.\n\nI collected $83.65 this week ($189.30 so far in April)\n\nMy vacation fund did hit $60,325 (with another $775 deposit this week) and still looks like a decent shot to hit $300,000 by July 2028\n\nI have $11,323 in covered calls and using $22,578 in cash/sgov as collateral for puts. I am looking for 1% income for the month on the $33,901 used.\n\nThis is a side portfolio, so not looking for long term growth here, my main portfolio is for growth.", "score": 3, "replies": [{"body": "Nice stats Mr. Cup. $60K! Awesome, I knew you were close. I love the milestones. Thanks for checking in, I like reading your about progress on the weekly.", "score": 3, "replies": [{"body": "Thank you and Yes for sure posting weekly for you and I and others is a great way to track your progress and keep motivated and accountable.\n\nWe can all grow together, I either profited this week or I learned something this week, sometimes, both.", "score": 5, "replies": []}]}]}, {"body": "Congrats on another solid week, Expired! I went backward this week dealing with a Monday morning assignment of an ULTA put, plus I had to deal with a half dozen rolls for debit when some of my shorts went ITM. I’m going to try to go more conservative (10-15 delta) to avoid going ITM so much. I enjoy reading your weekly posts!", "score": 3, "replies": [{"body": "Thank you, Lintsowner. I like the pivot on your strategy. You got to keep adjusting to a spot that works for you. I agree with the 10-15 delta, the premium is not as attractive, but it will reduce the issues that you are currently dealing with. Thanks again and I look forward to seeing how the change in delta works for you.", "score": 1, "replies": []}]}, {"body": "Great work as usual Op!!\n\nThis week I had $1247 in realized premiums. YTD $10832\n\n Twlo - 4/12 60p - 10 cons - $910\n Roku - 4/19 59p - 10 cons - $347\n\nHolding \n\n Twlo - 4/26 60p - 10 cons\n Roku - 4/19 59p - 10 cons \n\n With markets dumping from war news, I hope I don't have to take Roku assignment.\n\nGood luck for next week!!", "score": 3, "replies": [{"body": "Hey abicit, $1,247 and over $10k YTD is killing it! Great work. Ya, we will see how the markets react to the war next week.", "score": 1, "replies": []}]}, {"body": "'lol, that graph looks like they fell off a cliff.'\n\n*zooms in*\n\nwhew, only down 3%.  Good for you OP.", "score": 3, "replies": [{"body": "Hey FiremanHandles. Your descriptions is spot on and made me chuckle.", "score": 2, "replies": []}]}, {"body": "Good to see your update again!\n\nI'm running an experiment and maybe I should post my learnings as well.", "score": 3, "replies": [{"body": "Hey foresttrader. Thanks for the post. If you don't post, I would highly recommend tracking it. Posting it helps me ensure that all the numbers are correct. Even if they are not, it helps me double and triple check, which reduces the errors significantly. And while I'm doing that, sometimes I'm able to drill down into things and uncover trends that I would not have seen otherwise. \n\nI look forward to seeing your post and experiment details!", "score": 2, "replies": [{"body": "Thanks for your support. The trading method I apply is against many well established financial theories so I'm sure my posts will receive many critics lol. That said, maybe they will provide some entertainment values :D", "score": 2, "replies": []}]}]}, {"body": "This is such a great thread .. Thank you for sharing!  I’ve been paper trading for only a week now after studying and learning about options .. been a rough week but it’s all good learning.  \n\nWhen you enter a position initially, how do you determine your entry point?  Do you use any technical indicators?", "score": 3, "replies": [{"body": "Hi LisaLisaLove. Thank you for the kind words. Options seem overwhelming at first, at least that is how I felt. Then as I began understanding the mechanics, they were much less intimidating. Honestly, the mechanics are the easy part. It is choosing the right ticker and managing the positions that takes research, discipline, and patience. \n\nI will start by saying that I have 87 individual positions. It has stayed in an 80-90 range for a while. That is because I sell a LOT of covered calls on a relatively large portfolio. When I first started, I used the greeks to be relatively consistent with my positions. Although the greeks are important to understand, I put more emphasis on the company and market sentiment than the technicals. This is because short term technicals may not agree with the guidance, leadership changes, new products, company pivots and so-fourth. \n\nJust to better answer your question, my entries for covered calls usually fall in the Delta range of -0.1 to -0.2. Gamma between -0.01 to -0.08. Vega around -0.01 to -0.05. Those are rough guidelines. My CSPs are more aggressive than covered calls because I am usually trying to get into the position.\n\nHope that answers your questions. Best of luck learning and studying!", "score": 1, "replies": [{"body": "Thank you for sharing .. I have been looking at Bollinger Bands and RSI trying to determine if the entry point is good for a CC or a CSP.  I too am trying to start up the wheel strategy on a few stocks so since I’m ok to be assigned the shares right now I was being a little more aggressive with my delta being at 30% .. we will see!  I did weekly trades as my trades and they expire on Monday .. I might be practicing my rolling on a few of them.  Glad it’s all paper trading for me right now with all is the turmoil in the world right now.  😵‍💫", "score": 2, "replies": []}]}]}, {"body": "I dig your style dude. I just got into selling options how often are you rolling out to avoid assignments or losses?", "score": 2, "replies": [{"body": "Hey Speedybob69. I appreciate it. I roll more than anyone I have encountered that sells options. I am able to do this because Robinhood does not charge fees. When I roll, there is a .03 regulatory fee that is charged on the closed position as well as the newly opened position for a total of .06 per roll. That being said, I roll forward, backward, up, and down. I look for opportunities to roll on all my positions on a daily basis. For example, if I have rolled a covered call out several weeks and the ticker starts to decline, I will look at reducing the DTEs and the strike price, I refer to this as rolling backward. Hopefully that gives you an idea on how often, its a lot! \n\nCongrats on getting into selling options. Hope to see you in the comments in future weeks.", "score": 2, "replies": [{"body": "Yeah I roll mine quite a bit. Everytime nvda and smci spike up I roll profits on my put and lower my strike. But I'm thinking I'm gonna close for profits and try to walk away because it usually comes back down and I can get more premium on the lower strike because it's closer to the money. I just got assigned for $100k between jpm and blk. I'm only $2000 in the red hopefully Monday is green brings me even and I can sell cc and get $1500 premium maybe a little bit of capital appreciation too. It needs to happen soon because now I'm using 18k in margin. Will probably sell a box spread on spx as a loan on Monday", "score": 2, "replies": [{"body": "I view rolling as a \"do over\". You open a position with set parameters and as the position starts to go in an unfavorable situation, you simply revise the original position. It is actually kinda funny to me that you can do that. Regardless, I am also hoping for a green Monday. Good luck with the box spread on SPX!", "score": 3, "replies": [{"body": "Iran just attacked so we might see more red", "score": 1, "replies": []}]}]}, {"body": "Hi Expired Options, Im trying to learn from your wonderful sharings and still would like to enquire on your rolling strategies for a cash secured put that has say 3 weeks to expiration, but is barely in the money. \n\nWould your strategies differ from say a safer underlying say SPY or a more volatile ticker please? Eg. With 3 weeks to go, you may prefer to wait it out a little longer for SPY but for a more volatile ticker, you will roll out once it touches the strike price.", "score": 1, "replies": [{"body": "Hi Mean\\_Office\\_6966. Thank you for your question about my strategy for rolling. I prefer to roll before my options go into the money. In your case, I would try to roll, even if it was 3 weeks out. The volatility of the stock would not be a factor in my decision to roll, if the strike was tested. In other words, I am looking at a roll as soon as the underlying is within $1 of the strike regardless of the ticker.\n\nThanks for the question. Hopefully it was answered to your satisfaction. Best of luck!", "score": 2, "replies": [{"body": "Thank you! Your explanation is clear. Just wondering then your considerations on the dte extension and stoke lowering for CSP? Eg a week out and one strike below the original option so long it's a net credit. Would the thinking be the same for CC and CSP? (sorry if you have explained this to others before)\n\nThanks!", "score": 1, "replies": [{"body": "In theory, yes, I would want to roll for a credit. In doing so, I would look for an increase in DTEs and reduced strike price for a CSP and and increase in strike for a CC. You may have to toggle the strike/DTEs to find that happy medium where you are good with the premium/new strike/new expiration. \n\nSince you are working with a CSP and SPY has been increasing this week. You stated above that you are barely in the money. You should not have to roll due to the increase, but I don't know what your strike is. \n\nHope this helps!", "score": 2, "replies": [{"body": "Sorry, I should have been upfront to say mine was a CSP on QQQ 427 with 18 days to expiration.\n\nIndeed, with this week's run, it's slightly in the money, but I am unsure if I should roll (of course pending today's market)\n\nI tried to compare the net credit that I would have gotten if I were to roll out two more weeks:\n\n(i) Rolling out earlier last week when QQQ first hit 427 versus (ii) Rolling out yesterday when QQQ recovered to. around 424/425\n\nBoth scenarios seem to be netting roughly the same amount net credit. It doesn't seem intuitive as I would have thought (ii) would give me a little more premium as the theta decay faster for an option that is expiring earlier than the other option I'm rolling out to. \n\nAm I analyzing this correctly?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Yr DTE is so wide from a few days to a few hundred days. The latter is due to rolling? Or you want to get a bigger premium.\n\nWhat is the criteria to determine yr strike price ?", "score": 2, "replies": [{"body": "Hey 2to20million, thanks for the comment. I usually only enter positions with 1 to 2 weeks until expiration. The longer DTEs, as you had suspected, are due to rolls. I am not rolling to 2026 for a bigger premium. I am rolling because the original position kept rising, in the case of covered calls. On the flip-side with CSPs, I have a few out to 2026 because they kept decreasing. \n\nUsually on the rolls, I am looking to roll when the strike is tested within about $1.00. When it gets to within 50 cents, I am actively rolling. With few exceptions, I am looking to get a modest credit. I rarely roll when I have to pay a debit. \n\nRight now, all the calls that I had pushed out several months and some that were rolled out to 2026 are doing pretty well. Of course, this means that the underlying is not doing well, but it also means that I may be in a position to close out the long term roll or roll it backwards. Similar with the PUTs, as those tickers begin to rise, I can close out or roll back the 2026 positions I have. \n\nSince the options I sell are simply supplementing my overall buy and hold strategy, I am ok with waiting out positions that I have rolled into the future and just ride out the Theta.", "score": 3, "replies": [{"body": "Thanks for clarification . So far, I have also used Long DTE but more to capture higher premium rather than rolling. \nI just sold CSP on NVDA with a strike of $660 with DTE Dec 2026. \nI am prepared to be assigned. Meanwhile, I get the interest from premium.", "score": 2, "replies": []}]}]}, {"body": "Hi there, I really enjoy reading your posts. I too have a lot of cash and at times sell CSPs or Covered Calls, working the wheel on stocks I wouldn’t mind owning long term. \n\nFor the selling options / premium side of your portfolio, how are you baselining your return vs capital allocated? Do you compare your return in premium vs if you had allocated the amount dedicated entirely in SPY / VOO or a MMF?\n\nI see you utilize Robinhood, have you considered switching to another broker that allows you to collect interest (currently ~5%) on idle cash used for CSPs?", "score": 2, "replies": [{"body": "Hi ShootsnLadders. Although I am aware of the performance of SPY/VOO, I do not compare my returns on this account on a regular basis. I have a Roth and a retirement account through my company that are more in line with index funds. For this account, I am actively managing options positions, which is generating revenue. I don't see much value in going through the hypothetical of how much I could have made in a different strategy, because I can't go back and change it. Also, I don't have any plans of changing this strategy unless it went significantly sideways.   \n  \nSince I have around $30k in CSP collateral, I have considered other brokerages that provide interest on that collateral. However, I like Robinhoods app and free options. I am also on the waiting list for their 3% credit card, regardless of the category of expense. I guess, I'm comfortable with Robinhood and the perks that they provide are enough to keep me with them, for now.   \n  \nThanks for the questions. Hopefully, I was able to answer them thoroughly. I appreciate the kind words and hope you continue to enjoy the posts. Best of luck to you!", "score": 1, "replies": []}]}, {"body": "Hey Expired, thanks so much for sharing! This is super helpful :) For clarification— is your total options portfolio currently $59k with about $30k in CSP collateral? And then $146k in long term investments (not options)? I’m curious because I started doing options about a couple months ago (only CCs and CSPs) utilizing around $20k. My goal is to make around $2k per month in premium so I’m just trying to get an idea of how cash / how big of a portfolio I’d need to do that. Appreciate you sharing your work!", "score": 2, "replies": [{"body": "Hey fightforchange2. Yes, you have it correct. $146k is long term investments, but also includes potential covered calls that are not deployed at the moment. Most of my positions are in 100 position blocks, but some do not have the volume to sell options against them. Hope that answers your question. Thank you for the comments and questions. Best of luck with the CCs and CSPs. Check in with your results, I'm sure there are others that can benefit from your comments.", "score": 1, "replies": []}]}, {"body": "Great thread! I have a question ... on the spreadsheet if it says ROLL in the far right column, does that mean the position you are listing is itself a roll right now? For instance, you list W sold on 4/8 and expiring 5/3. Is this a NEW position or are you rolling it from a prior week?  And if you are rolling it from prior week does the amount of premium include what you paid to close it in order to sell it again? I hope that makes sense! Very interesting.", "score": 2, "replies": [{"body": "Hey skillfulsolutions. Yes, your question makes perfect sense. The roll column is indeed how you described, it is a position from a prior sell that was closed and a new position was opened at the same time. When this happens, the amount of the premium is the net of the close and opening of the new position. When rolling, I am mostly looking for a net credit rather than a debit. I use Robinhood and the options are free with the exception of the .03 regulatory fee. This allows me to roll as much as I need to for a negligible amount. Let me know if this does not answers your question. Thanks again and best of luck to you going forward.", "score": 2, "replies": [{"body": "Thank you . Yes, that makes sense that it is the net! I have been doing OTM selling of puts but try to avoid assignment so really don't make much on most of the ones I sell as I am afraid of getting assigned! I think you wrote that you sell puts on stocks that you would be fine owning so maybe that is a different approach. Or maybe you are doing some selling of puts just for premium. I will study your past posts to follow this better but I am impressed with the amount of premium you are collecting each week!", "score": 2, "replies": [{"body": "I rarely sell CSPs for the premium. The premium is part of it, but I am trying to increase my inventory in the majority of cases. The two that I can think of in recent memory that were mostly playing on the volatility and premium are SAVE and CLSK.", "score": 2, "replies": []}]}]}]}, {"body": "Couple of questions from someone who is learning:\n\n1) I noticed you have a pretty high average DTE of 191 days. Do you typically let your options expire, or do you buy them back at a certain point?\n\n2) If I don’t have enough funds to own 100 shares of a stock of which I want to sell options, are there any strategies in particular you recommend? I’ve tried iron condors a few times but always got ‘unlucky’ with them..\n\nThanks for your guidance!", "score": 2, "replies": [{"body": "Hey there ChestnutDelta2107,\n\nThanks for the questions. I can't say that I never buy back as I actually bought back AMZN today; however, I don't have a plan to buy back on a regular basis. The decision to buy back the AMZN covered call was based on my ability to make more in weekly covered calls than the amount of the buy back. For example, my buy back was $17 with an expiration of next Friday. I may be able to sell in the morning for at least $10 and I think I will make between $10 and $20 next week. This is more than my $17 buy back. It also reduces my risk of having to roll out and up if AMZN begins rising significantly between now and next Thursday. Bottom line is that I think I will make more than $17 by next Friday. We shall see.\n\nIf you want to sell options but don't have the funds for that particular stock, I would look at LEAPS. This will allow you to lock in a price for the underlying for a premium that is usually about a third to half as expensive as buying all 100 shares. Since I used AMZN above, Ill use it again. If I am buying a LEAPS, I am looking as far out as possible. In the case of AMZN, the furthest out right now is December 18, 2026. If you were looking at a $170 strike with that expiration, the price would be about $5,400. This will give you the rights to buy AMZN at $170, whenever you want up until that expiration. It can also be used as collateral to sell covered calls against. Now $5,400 is much less than buying 100 AMZN shares as they currently go for $176 which would be $17,600. So, it is even less than a 3rd to purchase a LEAPS.\n\nLet me know if you need clarification on anything above. If not, best of luck to you. If you go to r/ExpiredOptions, you can see my 2025 and 2026 LEAPS and their performance.\n\nEDIT: added a link to [Investopedia.com](http://Investopedia.com) talking about using LEAPS and covered calls. \n\n[https://www.investopedia.com/articles/optioninvestor/04/021104.asp](https://www.investopedia.com/articles/optioninvestor/04/021104.asp)", "score": 1, "replies": [{"body": "I will definitely look into LEAPS, thank you so much for your clarification", "score": 2, "replies": []}, {"body": "Here's a sneak peek of /r/ExpiredOptions using the [top posts](https://np.reddit.com/r/ExpiredOptions/top/?sort=top&t=all) of all time!\n\n\\#1: [Week 14 $634 in premium](https://www.reddit.com/gallery/1bxsvdc) | [0 comments](https://np.reddit.com/r/ExpiredOptions/comments/1bxsvdc/week_14_634_in_premium/)  \n\\#2: [Key events this week](https://i.redd.it/9ma2tx4q84pc1.jpeg) | [0 comments](https://np.reddit.com/r/ExpiredOptions/comments/1bhubw3/key_events_this_week/)  \n\\#3: [Week 51 $513 in premium](https://www.reddit.com/gallery/18orct3) | [7 comments](https://np.reddit.com/r/ExpiredOptions/comments/18orct3/week_51_513_in_premium/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)", "score": 1, "replies": []}]}]}, {"body": "I left ccl Friday if it doesn't hold that 14 support it's a long way down", "score": 1, "replies": []}, {"body": "What’s your logic in selling puts multiple years out?  I assume your cash is in a MMF and you don’t mind it sitting there?", "score": 1, "replies": []}, {"body": "“I sell options, cash secured puts and covered calls, on a weekly basis” so far it may work for you because we’re in a bull market, but if the tide turns, be prepared to alter the strategy", "score": 0, "replies": [{"body": "Hey geekfinity. Thanks for the comment. I plan to continue to sell CSPs and covered calls regardless of the market conditions. I understand that it may slow down, but both options will work under both bear and bull markets. I was refining my process during the January 2022 thru October 2022, 10 month bear market, where the S&P 500 was down 25%, so I have an idea of how it would play out. Other than the slow down in volume and premium, do you have any suggestions on altering the strategy? Thanks again and best of luck to you.", "score": 1, "replies": [{"body": "I'm new to the thread, but I took notice of your rolling strategy...Monitoring daily and taking advantage of opportunities to roll in various directions is a very interesting concept...I usually exit and re-enter a trade for similar reasons, but rolling out is nothing more than selling a calendar. So with a CSP, in theory if you sold the calendar (rolled out) when vol was high and bought it back when vol normalized that would lower your cost basis and (possibly) allow you to roll backwards. Since a calendar is just a special case of a diagonal which allows you to roll along both the price and time axes; if you were able to optimize these terms then I could definitely see building a strategy around it...\n\nI actually used to run a sub on option trading...So, I have a few suggestions that may help your strategy.\n\n1. Someone mentioned that robinhood doesn't pay interest on your cash. Short duration treasury etfs like BIL can be used to approximate daily interest due to the way they are arbitraged. I personally just use a bond ladder with 3m t-bills but, I do use BIL for some things. Just remember that etfs settle t+2, so you need to be a bit more diligent about any early assignments.\n2. \"I rarely sell CSPs for the premium. The premium is part of it, but I am trying to increase my inventory in the majority of cases.\" - For others reading...That is exactly right. We think in terms of lowering our cost basis, not in terms of premium.\n3. I believe that robinhood only offers Reg-T margin? If that's true then I would consider throwing a super cheap long put under your CSP to make it a short vertical. When selling premium on single company options you are exposed to idiosyncratic risks that can hit hard and fast. Having that long put can save your life when it comes to margin requirements. As you know, the margin requirements on naked options are dynamic and can blow out exponentially if the trade really goes against you... And besides if you really wanted the stock at that price and the market falls right through that price level, such that the long put is in the money, then you can always sell it to lower your cost basis.\n4. If acquiring the stock at the cheapest price is the goal for a particular name, then consider selling a ratio backspread instead of a CSP.  it has similar characteristics, but you can oftentimes get more premium for the same breakeven price. and it helps, mentally, having that long put in front of the shorts...\n\nAs I mentioned, I'm new to the thread and don't know your skill level, so if my suggestions are remedial then I apologize, but I saw many here who are new to selling options, so I figured that they might benefit...\n\nThe previous commenter was not wrong... Selling options is very risky. You always have negative gamma...There is no panacea for making money in the markets... My advice to all readers is to fully understand the risks and learn how to manage them. Read your margin handbook. Understand the Greeks. Fully understand the relationship between volatility and option pricing and you will be fine...Failure to understand margin requirements or your obligations as an option seller can easily destroy your life...", "score": 1, "replies": [{"body": "Hi chyde13. Thank you for the insightful and thorough comment. I do want to reply but want to make sure I cover everything. I will take a look later this evening. Thanks again, there is a lot of great information in your response.", "score": 1, "replies": []}, {"body": "Hi again. First, I'll just say thanks again because I appreciate you taking the time. \n\n1. Robinhood does pay 5% on uninvested cash. They do not pay on CSP collateral, so, it would be tied up. I like your ladder approach on t-bills. \n\n2. Agree!\n\n3. In a bull market with less volatility, I don't see the need for vertical spreads. However, with the last several weeks, I think it would be wise to start using them to lower the risk. I also stay away from margin.\n\n4. The ratio backspread might be a good play when after this volatility goes away. I'm very apprehensive of getting into new positions with the current market turbulence. \n\nI do agree that selling options is very risky if you don't know what you are doing. I would add that they can enhance your gains when you understand the risk and use that knowledge responsibly. \n\nThanks again and look forward to your comments in the future if you decide to drop in again. Best of luck to you.", "score": 1, "replies": [{"body": "I took the time because I was impressed with how you took the time to respond to every comment here in a constructive manner...\n\n>I do agree that selling options is very risky if you don't know what you are doing. I would add that they can enhance your gains when you understand the risk and use that knowledge responsibly.\n\nI couldn't agree more...I sell options all the time. Buffet purportedly uses CSPs to acquire assets at a lower cost basis and I do the same. Seems like that's a cornerstone in your strategy as well.\n\n>Robinhood does pay 5% on uninvested cash. They do not pay on CSP collateral, so, it would be tied up. I like your ladder approach on t-bills.\n\nCool, I've never used the platform. but I didn't realize that it had zero option commissions. That really adds up. What collateral do you use? I use t-bills because of their settlement, but that advantage is gone in May when equities switch to t+1 as well...\n\nAll in all, you have a good group here...Everyone is encouraged, and in their own phase of the learning process. I personally love options...\n\nI started my sub with a passion to help all the new pandemic traders back in '21... I had about 20 people who really put in the effort to learn the rules to the game and they really got it, but most didn't put in the effort. Ultimately, I ended up quitting because I got tired of all the PM's asking for help out of a hopeless situation. --I rolled down and out twice and am going to get assigned on 10 tesla contracts. Can they really liquidate my long portfolio? Yes, and they will close your account and send you a bill for the rest.--  It was hard to watch because I got to know them. I basically preached position sizing and risk management because I blew up my own account in 2004, way after the tech crash recovered lol, because I got too cocky and stretched for that yield...\n\n>Thanks again and look forward to your comments in the future if you decide to drop in again.\n\nI will likely poke my head in every once in a while, as I'm interested in some of your concepts, especially rolling backwards. Usually if I have to roll more than 6m then I will accept defeat and take assignment. I was skeptical of rolling backwards, but when I modeled it out and thought about it in terms of calendar spreads, I could see how that could be used advantageously if the conditions were right.\n\nI wish you and your readers all the best!\n\nBe safe,\n\n-Chris", "score": 2, "replies": []}]}]}, {"body": "Would you mind to list your trades for last week and this week. We will discuss further", "score": 1, "replies": [{"body": "I list my trades every week. \n[last weeks trades.](https://imgur.com/a/p6FhXKW)\n\nI will post this week’s trades on Friday.", "score": 1, "replies": []}]}]}]}]}
