{"title": "[deleted by user]", "selftext": "[removed]", "id": "5761w7", "created_utc": 1476301127.0, "score": 14, "upvote_ratio": 0.82, "num_comments": 92, "comments": [{"body": "Amazon had their best sales day ever 3Q2016:\nhttp://fortune.com/2016/07/13/prime-day-sales/\n\nAmazon Web Services is also continuing to grow.\n\nIndia data center opened this summer:\nhttp://venturebeat.com/2016/06/28/amazons-first-indian-aws-data-centers-launch-in-mumbai/\n\nAWS Data Center Global Map:\nhttps://aws.amazon.com/about-aws/global-infrastructure/\n\nAWS is generating plenty of revenue:\nhttp://www.recode.net/2016/4/28/11586526/aws-cloud-revenue-growth\n\nFifth straight quarter of profit (2Q2016):\nhttp://money.cnn.com/2016/07/28/technology/amazon-earnings-streak/\n\nBeen talking about $1,000 shares since at least this summer when I joined the market:\nhttp://www.cnbc.com/2016/10/12/another-analyst-came-out-with-a-1000-price-target-on-amazoncom.html\n\nAnd just another shit article/site to summarize:\nhttps://www.earningswhispers.com/stocks/amzn\n\n\nAmazon is going to the moon, but is taking the space escalator to get there.", "score": 9, "replies": [{"body": "This shit is taking off. In from $300 and want to leverage the fuckers with some loong-schlooongg high delta calls. ", "score": 1, "replies": []}, {"body": "Enjoy, Azure is quickly encroaching on AWS's space, as corporations enter the cloud space AWS will meet resistance from MSFT", "score": 1, "replies": []}]}, {"body": "Cool story. Now post proof.\n\n\nMight want to mention strike too. ", "score": 8, "replies": [{"body": "[Proof!](https://m.imgur.com/a/9HKi7)\t", "score": 12, "replies": [{"body": "my opposite yolo. good luck brother\n\nhttp://i.imgur.com/NCLjghQ.png\n\n\n", "score": 7, "replies": [{"body": "Ha. Excellent. Might want to pull some off the table guy... Unless it's a paper account, in that case you're ok. ", "score": 4, "replies": []}, {"body": "Those are some nice gainz. Good shit, man. ", "score": 1, "replies": []}]}, {"body": "That's actually not a bad gamble, GL. ", "score": 5, "replies": [{"body": "Thanks boss! Hopefully it pans out.", "score": 3, "replies": [{"body": "You and /u/outofsync42 are going to make beautiful children. ", "score": 1, "replies": [{"body": " /u/outofsync42 has the same puts or has the same outlook?\n", "score": 1, "replies": [{"body": "oh, you must be new.  Maybe he'll post a link to his previous theory.  Technically he's supposed to be banned right now because he lost. ", "score": 1, "replies": [{"body": "Ah okay. Gotcha!", "score": 2, "replies": [{"body": "I believe it was \n\n\"Amzn below 450 by July\"\n\nClearly you're not quite that autistic ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Fuck man, good luck", "score": 2, "replies": [{"body": "Many thanks, boss. ", "score": 2, "replies": []}]}, {"body": "Damn my raging hard on go remove post got blue balled.", "score": 1, "replies": []}, {"body": "Please do yourself a favor and take your money off the table while you still can. Q2 earnings proved to investors that Amazon is no longer a hyped up tech stock.  It's now a profitable growth company with nothing but upside.", "score": 1, "replies": [{"body": "Fuck dude. It's AMZN stock not fucking Aerotyne. If you're a permabull on this I respek that, but I made this trade because I think I'm right. If I'm wrong Reddit Gold is on me partna!", "score": 2, "replies": [{"body": "Congrats bro, I'm an idiot.", "score": 1, "replies": [{"body": "Thanks, man. We are all idiots. :)", "score": 2, "replies": [{"body": "Reading my comment now makes me cringe. Of course AMZN is hyped up af. Fuck it yo. Have yourself a good weekend.", "score": 1, "replies": []}]}]}]}]}, {"body": "65k on a binary. so are you rich or dumb?", "score": 1, "replies": [{"body": "On a binary? Are you fucking retarded? I bought Nov expiration so that I give it sometime after a shitty price hike. After earnings, if it does not \"go my way\" I will have time to find an exit point where I wouldn't lose 100% of my investment. As a trader, you just have to live to trade another day. Another possibility is that this takes a shit before earnings and I take some profits off the table and roll into earnings with half my position. :)", "score": 3, "replies": [{"body": "Have fun with iv", "score": 2, "replies": [{"body": "WTF. No shit. ER is right around the corner. ", "score": 1, "replies": [{"body": "Why not grab a spread?", "score": 1, "replies": [{"body": "Spreads are the limp wrists of options. ", "score": 2, "replies": [{"body": "Also saves you a bit from getting double penetrated from iv crush and theta...", "score": 2, "replies": [{"body": "Which is ironic considering being limp wristed increases your chances of double penetration. ", "score": 1, "replies": []}]}, {"body": "Yeah, they only lower your cost, your risk, and your breakevens.  Fuck that shit, YOLO.", "score": 1, "replies": [{"body": "Zero interest in any of those things. It's like fucking with a limp dick and not blowing your load.  Just a real fucking waste of time. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Amazon is crazy undervalued currently. This is going to end badly for you. :(", "score": 1, "replies": [{"body": "Undervalued? Based on what? Fundamentals or just gut feeling? If it this trade goes against me it will not be the last time I'm wrong. ", "score": 2, "replies": [{"body": "By the P/E ratio for one...", "score": 1, "replies": [{"body": "You have to be fucking kidding me. You understand that as I am typing this the PE ratio on AMZN is 205.11. Do you have any fucking idea what that means? Let me break this shit down Barney-style for you. If the PE ratio is 205.11 that means that investors are willing to pay 205.11 for $1 of earnings per share. That sounds fucking retarded and does not sound like an \"undervalued\" company to me. If you did not know what PE Ratio was now you have an idea. Not to mention as AMZN stock price has fallen today, I am up $10,708.00 in unrealized gains. ", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "I swear this isn't my alt account.. lol", "score": 3, "replies": [{"body": "I was going to tag you, but then I didn't. ", "score": 1, "replies": []}]}]}, {"body": "AMZN missing earnings.  Thats funny.", "score": 7, "replies": [{"body": "Yeah and you're probably that faggot that posts \"Congrats to all longs \" on Stocktwats. Lulz", "score": 6, "replies": [{"body": "Someones a salty dog.", "score": 6, "replies": [{"body": "Still waiting for that screenshot boo boo. ", "score": 1, "replies": [{"body": "oh hey honey let me get right on that", "score": 1, "replies": []}]}]}]}, {"body": "They miss earnings from time to time but they do nkt have a record of missing consecutively in the last two years.\nA 3rd 1/4 put is a fair gamble tho. 4th /14 should demonstrate a chance at $1000.", "score": 1, "replies": [{"body": "That's the thing though. This is not me saying that AMZN is a shitty company. I like AMZN overall. I just think that these price targets, the expectations, and the growth opportunity is not there. If I get fucked in the ass in this play, I am prepared to take it like a champ, but I just don't think that i'll be wrong. ", "score": 2, "replies": [{"body": "Ya i feel you. Gl", "score": 1, "replies": []}, {"body": "You are wrong. You aren't thinking big picture. :/", "score": 1, "replies": [{"body": "That's the point of getting options that expire in less than 60 days. IDGAF about the big picture or long term effect. This is a bet in the short term that I hope pays off. Nothing else. ", "score": 3, "replies": []}]}]}]}]}, {"body": "RemindMe! 9 Days \"Did AMZN miss earnings\"", "score": 3, "replies": [{"body": "lol it's been nine days now. Somebody not very good at math.", "score": 3, "replies": [{"body": "That's why I'm on r/wsb\n\nBut, really, TDA told me it was this week. But, they also told me a bunch of other dates that were wrong.", "score": 1, "replies": [{"body": "It's alright boss. Looks like this went my way this time. I'll probably blow my gains on a dumb ass trade. :)", "score": 2, "replies": []}]}]}, {"body": "My brokerage account will also remind me when I'm down like $60k as well, boss. :)", "score": 5, "replies": [{"body": "Yes margin calls are tough ", "score": 1, "replies": [{"body": "Why would I get a margin call for buying puts? Do you know how options work?", "score": 3, "replies": []}]}]}, {"body": "I will be messaging you on [**2016-10-21 20:17:12 UTC**](http://www.wolframalpha.com/input/?i=2016-10-21 20:17:12 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/5761w7/amzn_earnings_play/d8pa83w)\n\n[**13 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/5761w7/amzn_earnings_play/d8pa83w]%0A%0ARemindMe!  9 Days ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d8pa8q7)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}, {"body": "RemindMe! Next Thursday at 4pm \"4 hours to go for OP to yacht/die\"", "score": 1, "replies": []}]}, {"body": "Lol hats off you were prolly better off putting it on blackjack tho.... Atleast you wouldn't have to squeeze ass till November ", "score": 6, "replies": [{"body": "If the game does not make me squeeze ass till November, I don't have a reason to play the game, bro. Blackjack is for pussies. :)", "score": 3, "replies": []}]}, {"body": "Here are the price changes for the next day after earnings for the last 8 quarters. Earnings are always announced after close. \"OPEN\" is the price change from close on earnings day to open the next day following earnings release; \"CLOSE\" is the price change from close on earnings day to close the next day following earnings release.\n\n    DATE          OPEN      CLOSE\n    ============  =======   =======\n    2016-07-28    1.65%     0.82%\n    2016-04-28    10.63%    9.57%\n    2016-01-28    -9.97%    -7.61%\n    2015-10-22    9.54%     6.23%\n    2015-07-23    20.08%    9.80%\n    2015-04-23    12.57%    14.13%\n    2015-01-29    11.08%    13.71%\n    2014-10-23    -9.19%    -8.34%\n\nAs you can see, AMZN almost always goes up following earnings.", "score": 2, "replies": [{"body": "Yeah this is good info. Because of these reasons I considered it a 'YOLO' play for myself. I think that this time I can cash on the 830 puts even if I have to pull some profits off (half position maybe) and roll the rest into earnings. \nI have been playing ULTA as well, and missed a nasty upside bet today. It happens though. ", "score": 2, "replies": [{"body": "Yeah I thought about playing ULTA last earnings season. Glad I didn't because it plunged. Here's how it looked prior to last quarter's earnings -- amazing:\n\n    DATE          OPEN      CLOSE\n    ============  =======   =======\n    2016-05-26    7.98      9.11\n    2016-03-10    14.21     17.28\n    2015-12-03    6.93      12.80\n    2015-08-27    2.83      -0.77\n    2015-05-28    1.92      -2.34\n    2015-03-12    7.09      3.65\n    2014-12-04    5.61      3.19\n\nIt was very tempting.\n\nI'm a software developer, so I actually wrote a script to generate these tables. In fact I ran that script for all stocks in the NASDAQ and NYSE and found many that increased 80% or 90% of the time post-earnings for the last couple years. I played a few and did pretty well, but Wayfair screwed me hard last quarter and I lost everything I gained in one shot (lost 12%!).\n\nNo matter how well a company has done in past quarters, it doesn't mean the company will do well this quarter.\n\nBut, I've been watching Amazon carefully, and I have a lot of confidence in it long term and for this upcoming earnings release. It's growing a LOT, it's just now becoming profitable it seems. And, once it finishes spending so much on growth it will be generating a ton of income in the future because of its market reach.", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Oh cool. I used to work at Charles Schwab and was rapid prototyping a new web-based version of ActiveTrader. Unfortunately it was only a prototype, but it was amazingly fun. I wish I could do that again or do some quant algorithm work somewhere, but I don't have the right contacts.\n\nIf you want anymore information on particular stocks let me know.\n\nCheck out LendingTree. It's volatile, and it's been going down down down for a while. But when it goes up it really goes up.", "score": 1, "replies": [{"body": "Let me see if I can screenshot one of the monitors so you have an idea of what I am watching. The quant algo guys are normally with AI divisions, hedge funds, or institutional trading. When you were with CS, did they let you take your S7?", "score": 1, "replies": [{"body": "I never took the Series 7 exam. Strictly did the CS route (well, CIS actually), only undergrad. I use my CS skills for analyzing trading ideas. My friend got me into this...he's on the financial side. I've tried auto trading binary options too. Been using genetic algorithms to optimize trading parameters. Tried lots of indicators, but I can't consistently get a > 55% win rate with any strategies. Some months it's 75%, some 45%, others 55%, etc.\n\nI currently have a bot running, trading AMZN. It uses no indicators. It buys both when the stock increases and when it decreases. It splits my investment into multiple chunks and uses a limit function to calculate how much to buy based on the absolute value of the day change %. It buys more with larger changes. Buys close to day close. It then sells when the account value increases x% over the average cost OR sells when the account value decreases y% under average cost (like a stop loss). Just started running this a month ago and have already made over 2% return.\n\nWow, that's a lot of numbers to stare at. Do you have more info from that screen than the typical trader does?", "score": 1, "replies": [{"body": "Yes. I have information with largest investors in a stock and how many shares they own, I have Morgan Stanley internal research notes and price targets, and a lot of other cool things. This is also not limited to the NYSE, I can see global markets as well and commodities. I trade differently in the joint brokerage account with my wife than I do with our IRAs, but the system that I have uses a couple of things. Basically, I am using EMA 8, and SMA 20 with EMA 50 and EMA 200 serving as support/resistance indicators. Very seldom do I use fibonnaci numbers (I do find them to be very helpful), and the other tool that I use is MACD with 8,16,5 settings. I use daily and weekly charts and normally trade options that are as close to a year out as possible. ", "score": 2, "replies": []}]}]}, {"body": "[My Thompson One WL](https://imgur.com/hlmQDqR)", "score": 1, "replies": []}]}, {"body": "Someone on StockTwits pointed me to this site which provides the same info as my script: http://www.busystock.com/.", "score": 1, "replies": [{"body": "That site looks awesome. Have you by any chance backtested your strategy? Do you have the ability to build a scanner that gives you results real-time based on real-time market data?", "score": 1, "replies": [{"body": "Which strategy? The bot that uses no indicators? Yep, I've backtested, and it seems to be working so far.\n\nIt buys and sells at the end of the day, so no need for real-time data.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Proof and reasoning? ", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "# \\- Epic™\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "# \\- Epic™\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "I posted the proof link above. Reasoning? I am not betting against AMZN long term, but I'm banking on weak forward guidance and the overall markets to take this into at least 791 PT before I sell my puts for a nice gain. Ultimately, whether I have good DD or shitty DD earnings will be earnings and AMZN will do whatever the fuck it wants to do. I am just not playing this shit to the upside when all the fucking retards are giving this a $1,000 PT. Last year my firm had a PT on TSLA for like $450. That was the most retarded shit I had ever seen. I had puts in TSLA and boom! ", "score": 0, "replies": [{"body": "Ya but tsla doesnt make money yet.", "score": 2, "replies": []}, {"body": "# \\- Epic™\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 9 days \"Did amzn miss earnings?\"", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "# \\- Epic™\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "I will pray you are right.", "score": 1, "replies": []}, {"body": "You were right. Congrats and FML.", "score": 1, "replies": [{"body": "Thank you, boss. ", "score": 1, "replies": [{"body": "How much you going to make?", "score": 1, "replies": [{"body": "I have no idea. I am about 60 dollars ITM with about 3 weeks until expiration. I am selling right at market open tomorrow though. ", "score": 2, "replies": [{"body": "How'd it go?", "score": 1, "replies": [{"body": "You already know boss. When everyone in WSB tells me that I am a fucking retard, you know that I'm going to win the trade. I was able to clear ~$28k on that trade. Not bad. ", "score": 1, "replies": [{"body": "$28k?! tech me senpai. Ive just recently got in a really shitty car accident and gotten hands on some money and would like to put it to good use. ", "score": 1, "replies": []}]}]}]}]}]}]}]}
