{"title": "DOW 19,000 Bro!", "selftext": "Dow Jones just eclipsed 19,000 for the first time in History. And is going to go higher. Maybe not in the short term because the CNBC pundits are going to talk about 19,000 ALL DAY today, but expecting a YE Rally\n\nhttps://wordpress.com/stats/insights/snufflestrading.wordpress.com", "id": "5eb2jb", "created_utc": 1479826184.0, "score": 24, "upvote_ratio": 0.79, "num_comments": 10, "comments": [{"body": "Thanks, Obama", "score": 14, "replies": [{"body": "Haha yeah no kidding. ", "score": 3, "replies": []}]}, {"body": "http://i.imgur.com/ksm5NgM.jpg", "score": 12, "replies": []}, {"body": "i still don't get why retail cares about the Dow", "score": 5, "replies": []}, {"body": "It's over 19,000!!!!!!\n\nWhat 19,000?!  ", "score": 2, "replies": []}, {"body": "What goes up must come down . N I'd expect it to be soon ", "score": 2, "replies": []}, {"body": "Well, if this whole Hillary recount hallens, its dropping back under in a hurry.  Markets hate uncertainty.", "score": 0, "replies": [{"body": "There's no uncertainty.  Hillary will not be president.", "score": 3, "replies": [{"body": "http://www.cnn.com/2016/11/26/politics/clinton-campaign-recount/index.html", "score": 1, "replies": []}]}, {"body": "No way it happens. He will probably give her a job lol", "score": 2, "replies": []}]}]}
{"title": "People often say that one regret is not buying Apple/Google stock early. However wouldn't buying stock for these companies now have similar returns in the same timeframe in the future?", "selftext": "Considering that they are positioned to increase market cap.", "id": "5ea6us", "created_utc": 1479813190.0, "score": 3, "upvote_ratio": 0.57, "num_comments": 18, "comments": [{"body": "That's not how a growth stock works. Apple and Google has grown so much that they don't have room for 1000% growth anymore. ", "score": 26, "replies": []}, {"body": "[removed]", "score": 14, "replies": [{"body": "Removed for not contributing to the discussion. If you're only going to insult someone, don't comment at all. First warning.", "score": 1, "replies": []}]}, {"body": "Let's say Apple get a 100% over the next five years. That'd make Apple a trillion dolllar company and considering there are none of those laying around I don't think it's likely. Possible but not likely. So to see a similar growth of Apple from pre-iPhone to now is way less likely. You're better off looking for the next Apple/google if you're looking for over 100% returns.", "score": 3, "replies": [{"body": "Predictions on the next stocks to look for 100% returns in 10 years?", "score": 1, "replies": [{"body": "MSTX and SPHS. Maybe CRBP.", "score": 1, "replies": []}]}]}, {"body": "Traders price in the growth in their valuations. So, if they see slower growth, they'll adjust valuations accordingly. ", "score": 2, "replies": []}, {"body": "The phrase every investment vehicle uses is, \"Past earnings are no guarantee of future profits.\"\n\nThat's EXACTLY what this means: Apple/Google are not likely to produce similar returns to their initial growth periods - or any time period. EVERY time period is unique. A company that grew and grew and grew - like Theranos, or Enron - can suddenly and unpredictably nosedive. Or they might stagnate, as many bluechip companies do, rewarding investors mostly with dividends. \n\nThe future is unknowable.", "score": 1, "replies": []}, {"body": "Unfortunately human psychology rarely sees early buyers hold such stocks. Hard to not hit the sell button when you are up multiples of your original investment.", "score": 1, "replies": []}, {"body": "But the growth is not exponential, so whilst they *should* continue to increase their market caps, they are doing so at a much slower rate. In the case of Apple, many people seem to be losing confidence in their ethos and ability to innovate. I do find it difficult to believe that the gains you would have seen investing pre-iPhone to now will ever be mirrored by them again. ", "score": 1, "replies": [{"body": "Technically the growth is still exponential :), I understand what you're saying though\n\nEdit: uh why am i being downvoted? I am correct ", "score": 3, "replies": [{"body": "Ha, fair point :)", "score": 1, "replies": []}]}]}, {"body": "Bro how did you read my mind???😜\n\nI was thinking the same thing however we never know what the future holds for Apple or oranges or whatever. Lol\n\nBtw can someone answer\nWhat if we buy a Apple stock and later on Apple changes it name and company do you lose the stock? \n\n", "score": -9, "replies": [{"body": "No it gets transferred.\n\nCmon some common sense would've been nice. imagine if you lost the stock, how is that legal? Can you imagine all the law suits they'll be facing. They're technically still the same entity but just under a different name", "score": 4, "replies": [{"body": "Ok how about when a company goes bankrupt? ?? \n\nyou lose the money!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "score": -1, "replies": [{"body": "What point are you trying to make?...", "score": 1, "replies": [{"body": "My point was .... You made it sound like in stock people are guaranteed a profit or their money back.... That's what it sound like", "score": 0, "replies": [{"body": "How did I make it sound like that?\n\nIf the stock goes bankrupt you lose everything. But if it changes its name the stock is still there. I in no way inferred you'll never lose money in the stock market", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "The bubble has burst! Abandon ship!", "selftext": "Down 80% on shipping, now weed is imploding! Save your portfolios!", "id": "5eazla", "created_utc": 1479825155.0, "score": 4, "upvote_ratio": 0.64, "num_comments": 10, "comments": [{"body": "buy high, sell low, good advice OP", "score": 13, "replies": []}, {"body": "BDI slowly pulling back.  Keep watching it.  It's likely to spike more.", "score": 2, "replies": [{"body": "Why would BDI go up? Global growth slowing", "score": 1, "replies": [{"body": "Huh?  It's shot up like 100% in less than a month.", "score": 4, "replies": [{"body": "...so another 100% spike is likely?", "score": 0, "replies": [{"body": "So sentiment is up and could result in further uptrend?", "score": 3, "replies": [{"body": "Fair enough man. Gl with the shipping. ", "score": 1, "replies": [{"body": "lol I'm not in", "score": 2, "replies": [{"body": "Just fast enough. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yet SPY hit 220 and DOW is at 19,000. KYS", "score": 1, "replies": []}]}
