{"title": "Will 2020 be the decade of the Pharma Bubble?", "selftext": "I've been reading a lot of books/articles these past few months to learn to be a better trader, and I've noticed the \"trending\" stocks a lot more lately. There are a lot of Pharma companies who go from anywhere of .75 cents to $15 a share, and then over night they're shooting up $30+.\n\n&#x200B;\n\nI am not a professional by any means, but I wanted to ask if anyone else see's this trend as well? Thoughts and discussions are all welcome!", "id": "e6zh7o", "created_utc": 1575642697.0, "score": 86, "upvote_ratio": 0.83, "num_comments": 57, "comments": [{"body": "[deleted]", "score": 156, "replies": [{"body": "You gave me a new perspective. Thank you, kind Walden", "score": 47, "replies": [{"body": "To elaborate a bit on *why* this is, Tech companies are engineering companies where as Pharma companies are more science-y. \n\nTech companies will fail because they don’t do well enough delivering a product or service people will spend money on.\n\nScience is more like prodding, poking, zapping, mixing and burning things to see what happens.\n\nPharma companies could spend years on a drug thinking it might help with xyz problem, but at any point it could fail testing because of some random bad reaction. You could get all the way to human trials after 5 or 10 years only to find out nope, it can’t be made to work. On the other hand you could discover you’ve just cured aids, a type of cancer or Wallstreetbets.", "score": 6, "replies": [{"body": "But can wsb truly be cured?", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "If you’re waiting for results on a Phase III trial, you can read the results of the Phase II and get an idea of whether or not it will be successful.  Generally if a Phase II trial has REALLY good efficacy in its treatment and the toxicity/number of adverse effects are really low, then you can be pretty sure the Phase III will pass.  \nIf you read early data and it’s mediocre then take caution.", "score": 12, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "I regularly make 400-1200% yield on individual positions, depending on how I structure my stocks and options) based on reading preclinical studies, phase 1/2 studies, and estimating when phase 3 data will be released. \n\nPro traders (banks and hedge funds) give stocks a value which is determined by future revenue, discounted by costs and chance of failure. When phase 3 data is released, their model updates their price target upwards by ~50% (because they probability of clinical success coefficient in their model changes to 100%) \n\nThe chances of failure are shaped by historical industry average (individual analysts will be conservative because they don’t wanna lose their jobs, so they always are clear to emphasize the risk in their reports for their bosses). If as an individual believe the drug will work, you can buy in before value estimates are raised and make cash. \n\nBut, to be fair, I work in pharma and have a PhD, and I only invest in disease areas / technologies I know. It takes me 20-100 hrs spread over weeks or months before I open positions, and there are limited opportunities in a year for my strategy. \n\nWe may see a biotech bubble pop soon, but pharma needs new products and it’s hard to develop those internally, so the acquisitions will continue and the market caps of the winners will continue to be considerable. \n\nI’m typically 30-50% mid cap longer term bets (1-3 years) and 30-50% short term (3-9 month) plays. I’m not afraid to hold large cash positions so I can move quickly on new clinical data (stocks regularly take 4 hrs to fully adjust to pre market data drops; I’ve made easy 10%+ in a day by pulling the trigger even after the stock has shot up 30-50%. This happens less now that I’m on west coast (I wake up after markets have been open for an hour or two).", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Definitely not random; either a drug will work or it won’t, and if you have the relevant info and expertise, you can be right more often than you’re wrong. \n\nBut your assessment on the knowledge domain is fair. Feel free to DM me if you ever see an interesting stock. If I’m interested I’ll take a look and share my thoughts, but don’t be surprised if it’s a “meh, pass.” I only invest when I feel that tingly sensation that tells me it’ll work. \n\nI primarily invest in clinical stage small caps (<$3 Bn market cap) with relatively shallow portfolios and preferably large molecules, and generally I stay away from oncology because the space is fckn cutthroat.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Let’s be clear, I’m making this offer selfishly and will have already opened a position before I tell you I think it’s a good idea. (Unless it doesn’t fit my strategy or my liquidity is tapped out)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It might be illegal for me to accept that, I believe, as I don’t have investment advisory licensure. And if I did put a price on my DD, it would be ~75-150/hr haha. \n\nIf that was the pricing you had in mind, I can reconsider. Otherwise, send me a ticker and what you like about it, and I’ll tell you what I think and what I plan to do with it. Whether you copy my actions is up to you. 😊", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Please share your knowledge with me oh great one!", "score": 1, "replies": [{"body": "Step 1: spend six years getting a PhD \n\nStep 2: ????\n\nStep 3: profit", "score": 1, "replies": [{"body": "Ahh yes, step 2 is the big mystery lol", "score": 1, "replies": []}]}]}]}, {"body": "\"the market\" is other people/companies/AI. So yes if they also read the same information then yes they will. If you're the first person to read this and somehow get ahead of everyone, then you will be the first person with this information, and thus can make a much larger profit.", "score": 3, "replies": []}, {"body": "I don’t know that honestly, perhaps because there is still a small chance that Phase III doesn’t pass.  \nAlso I would assume that most of Wall Street doesn’t know how to read a published clinical trial paper so they wouldn’t know the degree of how successful a treatment could be.", "score": 2, "replies": [{"body": "There is no way most of the big Wall Street investment firms don't have people on staff who have enough experience in pharma to read a clinical trial paper and make an informed investment decision based on it. They would be insane not to.", "score": 3, "replies": []}]}, {"body": "How many people know how to read and get FDA results? Especially have skillset in clinical trials?\n\nHell I knew AMD had a good product going and that was 4 months ago and market was bearish on it until quarterly summary. And I feel the information on AMD product and benchmark was very easy to understand and get.\n\nCompare to FDA clinical trials.", "score": 1, "replies": []}]}]}]}, {"body": "So would putting on a long straddle just before a clinical study pay off given the ability to put on options for a pharma company? I've always been much too afraid to trade them as they are so volatile and the majority of them do not do well after some point in time and sometimes dwindle down to almost nothing or go belly up.", "score": 1, "replies": []}]}, {"body": "No.  It will be the decade of the debt and securities bubble.  Pharma will be one of the places to still make money.", "score": 35, "replies": [{"body": "Agreed. Pharma is under cyclical pressure due to the fact next year is an election year. A lot of big pharma cos were bargain buys over the summer and have appreciated a bit. They Are frequent targets of campaign promises", "score": 5, "replies": [{"body": "There's also a lot of lawsuit trouble for some of the pharmacies, such as over the opioid epidemic. It's possible that all of the opioid lawsuits will be settled soon in a nationwide deal (the details of which are still being worked out). This is part of why some of the healthcare stocks, like JNJ, have jumped up a lot lately.", "score": 1, "replies": []}]}, {"body": "Not if patents get reworked and usefull again", "score": 2, "replies": [{"body": "That will definitely happen! /s", "score": 1, "replies": []}]}, {"body": "What are you defining as a security? Also, do you think it’s all debt, or just student loan, mortgage, credit card, corporate, or something else? Or a mixture of a few", "score": 2, "replies": [{"body": "More specifically ETFs, mutual funds, index funds, etc and to a lesser extent even common stocks et al.  All of them are overpriced/valued because all the printed money had no where else to go that made sense.\n\nAnd mostly government and corporate debt, but it's all connected - or will be when the economy contracts.", "score": 2, "replies": [{"body": "If all those collapse, I pray for our 401k’s", "score": 3, "replies": [{"body": "And you quite wisely drilled down to the biggest issue.   Unfortunately your 401ks won't be considered \"too big to fail\".", "score": 4, "replies": []}, {"body": "But probably not a \"collapse\" but a serious 25-50% correction would be in play.  But of course this is just my speculation.  Hopefully this bullrun lasts another decade.", "score": 2, "replies": []}]}]}]}, {"body": "Pharma is always a safe bet to make money.", "score": 1, "replies": []}, {"body": "how do we capitalize on debt and securities bubble", "score": 1, "replies": [{"body": "I'm not knowledgeable enough to really answer that.  And that assumption could be incorrect to begin with.\n\nBut having cash ready to buy when the market drops by 1/2 or having cash/credit ready to pick up rental property after recession starts are probably good directions to consider.\n\nPersonally, I wouldn't consider attempting to \"short\" anything with options but that is probably a good way if your comfortable doing so.  That is outside my risk tolerance.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "To be clear, they are risky even if you do really know what you’re doing. \n\nThere’s money to be made in pharma/biotech if you’re smarter than the market or more brash, but fools and followers will quickly be parted with their money.\n\nAnd unless you’re already being paid millions by a hedge fund, you probably aren’t smarter than the market.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lol I’ve made successful stock trades based on how happy an exec sounded on an earnings call before.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s a terrible strategy and I’ll be the first to admit it, but the timing was such that I knew he had to know the results, and he had been uncharacteristically giddy in several appearances. \n\nIt’s a crime to disclose clinical trial results, but it ain’t a crime to be happy.\n\nHowever... if your due diligence is deep enough that you can tell an exec is uncharacteristically chipper... you’re doing it right.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Can you give examples? Are these companies doing trials? If so then the results are based on the success of the trials, then they get bought up, which isn’t new.", "score": 2, "replies": []}, {"body": "\"Pharma\" in the professional asset management business generally refers to the big guys like Merck and Pfizer. There is no bubble in those stocks. \n\nNext there are the large biotechs like BIIB and GILD that dominate the XBI ETF.   They had a huge run from 2010-2015 then sold off by almost 50% into 2016, doubled into 2018 and have been flat. This is not really bubble behavior. \n\nThere are plenty of huge winners in small biotech land like Kite and Juno (both acquired) but much smaller than that and the spikes and valleys are driven by the success or failure of molecules.", "score": 2, "replies": []}, {"body": "Unless they develop the sides to cure cancer I'm not interested", "score": 2, "replies": []}, {"body": "2020s would be the decade of the carbon credit bubble", "score": 2, "replies": []}, {"body": "Pharma lobby, their rights on drug formula, and ability to hike the price at any cost essentially means that they guarantee income in the long run. However, there could be small sell offs if Canada (and other countries) manage to pull through with pharma care and the right to collectively (by the government) to negotiate drug prices. \n\nOther than that, the US pharma market is here to stay.", "score": 1, "replies": []}, {"body": "2020 will be the decade of oil scarcity. We are entering a period much like 03-04", "score": 1, "replies": [{"body": "How so? Genuinely curious", "score": 1, "replies": [{"body": "The shale oil in the us is going to stop growing, non opec oil output will stop going up. Opec is likely to cut production. Demand is going to continue to grow. Right now most oil names are focused on free cash flow and trading at 3 times ebitda, not going to be shocking to see $75 oil at which point oil names will be closer to 2 times ebitda. In times of scarcity oil names have traded 5-9 times ebitda. In 2010 oil was weighted 14% of the s&p now its like 4%. Iran is looking to blow up supplies to put the world into a recession in response of our sanctions. \n\nI could go on for about an hour. But energy is going to be the play. I wouldn’t be shocked to see XOP go to $50-$60 in 1-2 years.", "score": 3, "replies": [{"body": "I appreciate the insightful reply, thanks!", "score": 1, "replies": [{"body": "It’s all held up because people think the trade war is going to destroy demand and people don’t realize outputs aren’t going to go up any more. Trade war being over or not the market is going to freak out at the lack of supply, we haven’t had a scarcity period for some time and the market has gotten use to a glut for too long. These supply issues are 6 months out. \n\nThere is the thought by many that the oil companies will just drill more but it takes a long time to bring on more wells, and by the time they bring them on hopefully the global economy is switching off oil, so rather than drill they are likely going to just mint free cash flow and buy the shit out of their own stock. \n\nI’d highly recommend looking into things, while I think the economy could take a pause in q2-3 of next year and it makes sense to slowly build into a position it’s going to be the decade of oil. Just like it was after 03-04", "score": 2, "replies": []}]}]}]}]}, {"body": "Given that we are moving into a campaign year, and that one of the only bipartisan policies that both the Republicans and Democrats agree on is that drug prices need to come down, I cant see this being the right time for investors to feel euphoric for that sector at all. And for a bubble to develop, euphoria would be required.", "score": 1, "replies": []}, {"body": "No, not at all. These microcaps pop and drop all the time. There is no sustained overvaluation on all these. It is seems like about 1 in 1000 will get some good news, blow up, then gradually fade away. Even less will actually be successful or be acquired. The vast majority just continue to decay and then eventually go bankrupt.", "score": 1, "replies": []}, {"body": "Chemist here, and from my education the long term outlook for a lot of pharma companies is not as rosy as what it once was. Lots of old blockbuster drugs now out of patent, and a much tougher regulatory environment than previous decades. Add inherent distrust of many chemical / pharma companies (some justified admittedly) and it's getting harder and harder to bring out safe profitable drugs and that doesn't preclude legal action decades down the road. We are seeing this in substantially more attention being focused on research for medications for lifestyle related illnesses (let's get a return on someone's entire life) rather than, say, antibiotics or one-off treatments for disease. Yes there will still be blockbuster drugs, but not at the rate they once were.\n\nOnly a newbie investor, but what this probably translates to in markets is periods where big pharma companies (e.g. pfizer right now) struggle and have a bit of a mid-life crisis. Small pharma labs might have a lucky hit early on in trials but they will either be dead ends or get bought out by big pharma groups...and probably still end up dead ends. $BMY looks like it's doing well now though.", "score": 1, "replies": []}, {"body": "Exactly the opposite.What has pharma been hiding from us? Look up the video \"Joe Tippens Cures Terminal Cancer with Pet Medicine.\"", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "based on what?", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Ok ty :)", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That's really great but I got in during the .30s", "score": 2, "replies": []}]}, {"body": "!remindme 30 days", "score": 1, "replies": [{"body": "I will be messaging you in 30 days on [**2020-01-05 18:41:22 UTC**](http://www.wolframalpha.com/input/?i=2020-01-05%2018:41:22%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/e6zh7o/will_2020_be_the_decade_of_the_pharma_bubble/f9uu0gm/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fe6zh7o%2Fwill_2020_be_the_decade_of_the_pharma_bubble%2Ff9uu0gm%2F%5D%0A%0ARemindMe%21%202020-01-05%2018%3A41%3A22%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20e6zh7o)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Well played.", "score": 1, "replies": []}, {"body": "Ok I'm sold. ADXS and ONTX to the Moon and I can cover my weedstock losses for the year", "score": 0, "replies": [{"body": "ADXS used to be 400 back in 2015 😮😮😮", "score": 4, "replies": [{"body": "The stock split 15/1 earlier this year (and it had already split 125:1 in 2013).", "score": 1, "replies": []}]}]}]}, {"body": "I think globalization and black markets will steal consumers. \n\nNot much stopping India or China from making the same pharma drugs for 1/5th the cost of American manufacturers and selling them overseas via the internet. I'd buy Chinese or Indian Adderall if I could and I bet many others would too.", "score": 0, "replies": []}]}
{"title": "So, Morgan Stanley has a TSLA bear PT of $10 and a bull PT of $500 now. How don't these people feel useless?", "selftext": "", "id": "e6vrdq", "created_utc": 1575619267.0, "score": 202, "upvote_ratio": 0.96, "num_comments": 60, "comments": [{"body": "Well you see, the stock can go up or it can go down.", "score": 203, "replies": [{"body": "[deleted]", "score": 38, "replies": [{"body": "don’t even try to explain that shit, you can’t", "score": 23, "replies": [{"body": "Yes you can. Soo... Buying is buying super simple and you can even borrow money to buy!\n\nSelling is also simple! You borrow the stocks from a friend and sell them! How that works no ducking clue.", "score": 1, "replies": []}]}, {"body": "A little advanced for me", "score": 11, "replies": []}, {"body": "Should we buy puts or sell calls?", "score": 2, "replies": [{"body": "Both. Then you always win.", "score": 4, "replies": []}]}]}, {"body": "That's too complicated for me, fuck it I'm out", "score": 2, "replies": []}, {"body": "Stocks only go up", "score": 4, "replies": []}, {"body": "are you sure?", "score": 3, "replies": []}, {"body": "What about sideways?", "score": 2, "replies": []}, {"body": "Umm no it can’t go to $10, they’d be bought out way before then. $10 is going full retard.", "score": 1, "replies": []}]}, {"body": "> “We continue to believe Tesla is fundamentally overvalued, but potentially strategically undervalued,” Jonas said in a June note. \n\nDude.", "score": 130, "replies": [{"body": "Sounds like they wanna pump it up and then short it to hell", "score": 28, "replies": []}, {"body": "This is the way they cover their bases. They admit they have no fucking clue.", "score": 19, "replies": []}, {"body": "They have a great future as meteorologists.", "score": 7, "replies": []}, {"body": "That’s some inclusiveor shit", "score": 1, "replies": []}]}, {"body": "Thank God they’re not doctors:\nIt could be cancer OR ...the flu.", "score": 48, "replies": [{"body": "Doctor: i am sorry but you may only have two months left \n\nPatient: OMG noooo!\n\nDoctor: .......or you have another 50 years left to live. I don't know for sure.", "score": 17, "replies": []}]}, {"body": "Tbh tesla is what we envision apple to be when steve jobs is alive but semi autistic.", "score": 14, "replies": [{"body": "So.... a better Steve job?", "score": 3, "replies": [{"body": "alive is better than dead no?", "score": 1, "replies": []}]}]}, {"body": "Can't short a cult.", "score": 16, "replies": [{"body": "This guy gets it.", "score": 3, "replies": []}]}, {"body": "Why not? Government subsidizes all your losses if you are a bank.", "score": 13, "replies": []}, {"body": "How I read this: \"We think Tesla is about to tap the capital markets again, and award it a $500/sh target if Morgan Stanley is part of that process. If we are not, then it is worth $10/sh.\"", "score": 14, "replies": []}, {"body": "I’m so bearish and bullish on Tesla I don’t know what to play. I think one day the media will jump on the bear bandwagon and headline the financial engineering/ fraud that many ppl are highlighting and the stock could crash 50% in a week. But I’m bullish the open minded innovation that is strong in Elon musk.  I’m holding put spreads with time.  It’s hard see a super bull move short term. But these $680 calls ain’t gonna put themselves in the money.", "score": 17, "replies": [{"body": "The next market crash, Tesla will drop 80%. I always follow Tesla waiting for the peak to buy long-term puts. A perfect storm if I buy the puts and there is a big market correction, the stock will drop 50%.", "score": 1, "replies": [{"body": "If I buy the puts the stock will go up 50%", "score": 2, "replies": []}]}, {"body": "He only thing innovativeavout tesla is its ways it deceives", "score": -12, "replies": [{"body": "I found your wedding ring on my dick when I pulled it out of your moms ass, your sister must have been furious when you told her you lost it.", "score": 5, "replies": []}]}]}, {"body": "sT0Nks gO Up, StOnKs G0 DoWn", "score": 6, "replies": []}, {"body": "The whole game is fucking rigged. Basically these people are retards just like us but they always make money and that is why it is so insane.", "score": 5, "replies": []}, {"body": "It’s a house of cards built and supported by cult-like behavior.\n\nThere’s rumors of accounting shenanigans \n\nBut it’s also led by a visionary.\n\nIf someone told me that 5 years from now TSLA filed for BK I wouldnt be surprised, and if someone told me TSLA becomes a massive company bringing electric cars to the masses.... I also wouldn’t be surprised.\n\nWell just have to see what plays out", "score": 11, "replies": [{"body": "Then\n\nAnalysts should just admit they're useless, which is extremely true", "score": 3, "replies": [{"body": "Well, it’s not like they are saying this about every company. \n\nTesla just happens to have very extreme possible outcomes \n\nI bet their Bull and Bear targets for Coca Cola are much tighter", "score": 4, "replies": [{"body": "A five year old could give an outlook for Coca Cola though", "score": 3, "replies": [{"body": "Ya, true haha", "score": 1, "replies": []}]}]}]}, {"body": "I love Elon Musk, but Tesla is doomed.", "score": 2, "replies": [{"body": "I would definitely not go long on Tesla but at the same time I definitely wouldn’t bet against them either", "score": 2, "replies": []}]}, {"body": "I think Tesla would find it really hard to survive if a recessions comes in", "score": 2, "replies": [{"body": "a recession will certainly come, and its very likely to be within 2 years\n\nmost recessions are *not* super severe though, so i'd doubt that it would be enough to take Tesla out", "score": 1, "replies": []}]}]}, {"body": "Take the average of the 2...BAM $255 price target!", "score": 3, "replies": []}, {"body": "So their position is it could be $10, $250, or $500\n\nThat’s fucking insightful man", "score": 3, "replies": []}, {"body": "straight outta r/wsb", "score": 2, "replies": []}, {"body": "Jonas was the name in Tesla for years. Eventually Gordawg was like “chill son”\n\nNow Jonas is back with a vengeance, let’s get this bread bois", "score": 2, "replies": []}, {"body": "Cause a PT of $337 doesn't get clicks or investors\n\nPeople wanna see some crazy stuff", "score": 2, "replies": []}, {"body": "Of course they want to insight fear :), so they can buy more and shake out the weak hands", "score": 2, "replies": []}, {"body": "strangles it is then", "score": 1, "replies": []}, {"body": "https://twitter.com/eddiemac3356/status/1202991112522289163", "score": 1, "replies": []}, {"body": "So yeah, China approved manufacture and sale of the model 3 today.  Not so sure I'd bet against them if they've been cranking out cars the last few weeks waiting for the green light from the government there.  That's another 30-50k potential cars sold for this quarter...", "score": 1, "replies": []}, {"body": "Its because no one can analyze a meme stock.", "score": 1, "replies": []}, {"body": "So, what does their weatherman has for $MU?", "score": 1, "replies": []}, {"body": "You guys don’t understand price targets. These are case scenarios\n\nMorons", "score": 1, "replies": [{"body": "Price target is smack in the middle 275$. So they got all the bases covered 👍", "score": 1, "replies": []}]}, {"body": "They don't feel useless because they're part of the cartel that prints dollars", "score": 1, "replies": []}, {"body": "The day is coming when Tesla peaks, I buy long-term puts, and then watch the stock drop $400 per share.", "score": 1, "replies": []}, {"body": "Musk is a corporate governance disaster waiting to happen. Short this retarded company!", "score": -12, "replies": [{"body": "You must be a moron to short the most innovative leader of a brand new industry. \n\nHis methods are unorthodox, but his results are real.\n\nAre you a beancounter or something?", "score": 12, "replies": [{"body": "He's just a guy who likes to lose money, that's all", "score": 7, "replies": []}]}]}]}
{"title": "Your mom’s BJs are overvalued and so is BYND", "selftext": "So I’m at Costco today jackin it all over the meat section because it’s the best meat in town, it’s the cheapest meat in town, and all I eat is fucking steak because I’m a god damn American. Out of nowhere I hear one of these butcher retards talking about the BEYND meat dildos doing a deal with Costco, this news just dropped today (https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/beyond-meat-strikes-costco-deal-221210865.html) . Apparently the market’s dick is super hard for fake meat success news and the price is $tonks. My dogs eat kibble that’s higher in nutritional value than the rat poison these progressive vegans are trying to push on lower and middle income Americans who can’t afford my all steak diet. Substitution of animal products for pea protein and baby calf fetuses (animal scaffolding) sounds great if your an animal loving, activist nut job, but it’s going to be a dumpster fire that James Cameron and all his Hollywood hippie friends aren’t going to be able to climb out of no matter what Netflix’s latest vegan propaganda film says. \n\nCOW long at $44.75\n\nBYND puts 70 strike 2/01/20 exp.\n\n5.37/ per options share\n\nCurrent price $76.22", "id": "e75a71", "created_utc": 1575669642.0, "score": 75, "upvote_ratio": 0.8, "num_comments": 64, "comments": [{"body": "So calls? Got it.", "score": 24, "replies": [{"body": "Totally calls the op is a total loser literally fudding the lows as bynd goes back to a key76 support too", "score": 13, "replies": [{"body": "Your gonna cry when I take your girl on my yacht this spring after I cash these tendies.", "score": 10, "replies": [{"body": "Keep bashing idiot tons of stocks out there and y fools doing same shit that helped tesla soar\n\nAlso u keep giving the movement free advertising\nWith the overt simpleton hate", "score": 5, "replies": [{"body": "Your comparing the most genius company in a century to a misguided attempt to use science on food. I don’t care how much hype this co. gets, the product is garbage imo and that’s what I’m making my play on.", "score": 1, "replies": [{"body": "Lol they attack tesla the same\nWay u r attacking\n\nIdiot\n\nFoot\nIn\nMouth\n\n\nU could have shorted at 150 tard", "score": 4, "replies": []}]}]}]}]}, {"body": "It’s your pea protein induced cancer of a funeral my friend, but you burn you bucks however you like.", "score": 3, "replies": [{"body": "Dumb sob your short is about cost you 100000000000", "score": 6, "replies": [{"body": "YOLO", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Erased a couple words to fix it, thanks.", "score": 8, "replies": []}]}, {"body": "Inversing this for mad tendies", "score": 25, "replies": [{"body": "Me too", "score": 7, "replies": []}, {"body": "*sad cattle noises*", "score": -8, "replies": [{"body": "Moo hoo.", "score": 18, "replies": []}]}]}, {"body": "Thanks for the DD. Long $BYND.", "score": 7, "replies": [{"body": "This", "score": 3, "replies": []}]}, {"body": "It bounced off $71.88, went all the way through $75. Nice big candles. Bullish crossing on PPO on hourly chart. Your PP is going to hurt for way too long before BYND turns around.", "score": 7, "replies": [{"body": "Have huge PP, will be fine. At least until Jan 30, assuming to hasnt turned by then", "score": 3, "replies": []}]}, {"body": "I don’t know man. The will of the vegans is pretty fucking strong", "score": 15, "replies": [{"body": "Deer lord. May his antlers bring me a bountiful amount of tendies for investing the heathen heretic", "score": 8, "replies": []}, {"body": "Their will is strong, alas their body is weak.", "score": 6, "replies": []}, {"body": "Veganism is mental retardation", "score": 7, "replies": [{"body": "Damn libatard vegans how DARE they eat differently than I do!", "score": 11, "replies": [{"body": "I just don’t like seeing my fellow humans suffering. Vegans are hurting their body’s. They get to do what they want, America, so I’m short $VEG long $COW. The market will decide who is right.", "score": 2, "replies": [{"body": "You're forgetting about $BECKY. New years is coming up and that means new years resolutions. Veganism, gym memberships, no $SBUX for a week, etc.", "score": 7, "replies": [{"body": "Fuck, well I hope they give up on those empty promises before 2/01/20", "score": 7, "replies": []}]}]}]}, {"body": "eating dead animals for nutrients when live plants will do much better is definition of a clown world\n\nOur ancestors ate meat for calories when they starved and when plant material was scarce pre ag days\n\nOur teeth prove meat was never a big evolutionary need", "score": 2, "replies": [{"body": "That’s actually a couple of loads of bullshit, wrong on every count. Go long BYND and put your $ were your lying vegan mouth is you plant loving hippie.", "score": 7, "replies": [{"body": "Terrible comeback", "score": 3, "replies": [{"body": "Sorry I’m doing my best here.", "score": 3, "replies": []}]}]}]}, {"body": "So in their eyes, if it's not quite born just yet, it's A-OK to be brutally slaughtered like the same animals they protest to protect?  Wow, just...wow.", "score": -1, "replies": [{"body": "Yea, I think the assumption adds up to them thinking that being an agricultural cattle is such a terrible existence that the lives of the fetuses they harvest are better off ending there instead of getting to grow up and live the cow life.", "score": 2, "replies": [{"body": "So vegans think animals should have a right to live, except when it's not convenient for their own diet.  Mmk.", "score": 0, "replies": [{"body": "Not to get into human reproductive rights, but these are the same people that are short $LIFE for unborn babies in the US, so yes, there are a lot of contradiction on the political left.", "score": 7, "replies": []}]}]}]}]}]}, {"body": "Trying so hard to be funny it’s just painful", "score": 23, "replies": [{"body": "Oh shit, I forgot this sub was serious. Next time I’ll just submit my trade in daily trades pinned thread like the normy garbage I am", "score": 14, "replies": [{"body": "The difference is when other people do it, it's actually funny and not serious. When you do it, you sound like a self-centered jackass who's so uptight.", "score": 2, "replies": [{"body": "My first post on here, torch me a little harder as if i didn’t see the other guy’s message.", "score": 2, "replies": []}]}]}]}, {"body": "What I can’t shake about BYND is how every time someone here tries the fucking thing they say it’s ok, but it’s more expensive and doesn’t taste as good as the what-ever-the-fuck-the-other-fake-meat-company is called fake meat. \n\nTesla has THE BEST electric car. Shit on em all you want they’re the market leader and have the best product.\n\nBut this sack of fake shit market leading company doesn’t even have the best product? Their best ratings I’ve heard so far is “not bad” and “more than edible”, while the other companies product is being called “good” and “actually decent”, *for a lower price*. BYND seem to be relying on brand name recognition and being first to market.", "score": 6, "replies": [{"body": "They think because they are Hollywood elites that they can market a product as a luxury good even if it’s just pea mush. Id love to prove them wrong, you can’t make pea’s sexy.", "score": 3, "replies": [{"body": "So their backbone *is* brand recognition not best product on the market, that’s all the DD I need.", "score": 2, "replies": [{"body": "On top of that, veganism as a health option is a leftist lie in the form of environmental propaganda. Pea protein is not a healthy option for humans or for the environment, the truth will come out eventually, and when it does, it’s Tesla time baby", "score": 4, "replies": [{"body": "The thing I find funny too, is that in 10 or 20 years being vegan or vego won’t matter so much because the fake meat will be good enough and cost efficient that being vegan will just mean you’re consuming the same taste/cost/nutrient product but it’s just made from different materials. Future vegan diets could be all steak and fast food with a lot of people leaving the healthy factors of the diet behind", "score": 6, "replies": []}]}]}]}, {"body": "Beyond is the best thats why they have costco today and ten other world class\nCompanies who Say your dd is shit and so is op", "score": 4, "replies": [{"body": "Let’s see how this Costco deal and the DNKN deal from earlier this winter turn out. They have market access, now let’s see if the customers want to choke on it, or swallow.", "score": 4, "replies": [{"body": "Go to a dunkin sometime fool they are massively promoting it including employees wearing shirts", "score": 3, "replies": [{"body": "I’m not saying they don’t have an amazing marketing team and a bunch of talented people behind the scenes. I’m saying the product itself is not an alternative nutrition source for humans and that I don’t think customers will return purchase this product after they have tried it.", "score": 2, "replies": [{"body": "But it is\n\nIts a total alternative to masssssss physchosis\nOf fast\nFood burgers\n\n\nTrillions of ads a day brainwashing u to go to mcdonalds or outback", "score": 2, "replies": []}]}]}]}, {"body": "If you think my comments are DD then you belong here lol.\n\nDon’t get me wrong I’m not saying they don’t have strong aspects as a business, they clearly do with where they are at, plus they’re scoring deals and opportunities all over the place, fuck they even have a South Park episode.\n\nIt’s just that when it comes to food people shop with their taste buds and wallets. If/When it gets to the point that there is more than just the one option of fake meat, will brand recognition be enough if you’re smaller competitors are cheaper and tastier? If there were several options available and beyond was out of stock on the shelf for a week would the fake meat eaters care? Or just glance over it and buy the other brand. It’s food, not air pods.\n\nEdit: I will ad though that since they are the biggest, they have a good opportunity to get to work on other meats before their competition. I hardly eat beef anyway, if they get around to chicken lamb and pork efficiently then they’ll be the one to long.", "score": 2, "replies": [{"body": "There *are* several options. There are classic veggie burgers as well as brands like Impossible and Lightlife that are making similar products. The reason Beyond sells more and is more recognized is because they have more partnerships with restaurants and retailers. Beyond is given so much more shelf space at Whole Foods and it often sells out. \n\nThey’re focused mainly on the burger right now. They used to make chicken and discontinued it.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah we've got beef chief, we're knocking out teeth chief\nAnd if you don't believe us you should question your belief Keith\n\nI'm like Sam the butcher bringing Alice the meat\nLike Fred Flintstone driving around with bald feet\n\nShould I have another sip? No skip it\nIn the back of the ride and bust with the whippet\n\nRope a dope dookies all around the neck\nWoo-ha got them all in check", "score": 2, "replies": []}, {"body": "Its going to be at 76.80 Monday and looking at the 15minute chart looks like a bullish breakout pattern. I would wait until it hits the 76.80 mark before saying if its about to go higher or lower. Everyone seen this go from $240 to now 76.22. Stock prices move from people’s surprise. Everyone thinks itll keep going down and its holding the 70s level pretty hard. I think its going to move extremely up before it goes down which means if you buy PUTs now time decay will eat away any profits you will make later on.", "score": 2, "replies": [{"body": "Right, so double my position when it gets to 76.80, got it.", "score": 2, "replies": [{"body": "*face to palm*", "score": 2, "replies": []}]}]}, {"body": "Good to know real people still exist! Most people in my city seem to be drinking the kool aid with a soy milk chaser. I just finished eating a huge ass steak burrito bowl!", "score": 2, "replies": [{"body": "Just had a beyond burger\nBurrito bowl no need to kill cows", "score": 1, "replies": [{"body": "No no, that’s not true, in a few years your gonna have cancer like all the other vegans eating cattle fetuses with pea mash, which by the way is more fucked up than butchering mature cattle, and at that time BYND will be in chapter 11 and I’ll be doing donuts in my Tesla on the heli pad of my yacht. Enjoy", "score": 1, "replies": [{"body": "Zerohedge permabears are afraid of peas now? Sad day", "score": 2, "replies": [{"body": "Not fear, it’s hate my friend.", "score": 0, "replies": []}]}]}]}]}, {"body": "I was about to do puts of BYND a month ago for 75, it met its target recently, but is now going back up. Bulls rejoice.", "score": 1, "replies": [{"body": "It shouldn’t be a surprise that this company makes news and is doing good business deals, but the problem is the product is garbage and they aren’t going to be able to fix that. Long term growth after a market presence is established is unlikely imo.", "score": 3, "replies": []}]}, {"body": "Good call huh? It went to 77.50 before falling. Which mean you wait for the move up and buy puts at the top this morning to make bank$$$", "score": 1, "replies": [{"body": "So far so good. Planning on holding till Jan", "score": 2, "replies": []}]}]}
