{"title": "TSLA retardedly high", "selftext": "So how can Tesla's (TSLA) Market Cap be more than 50% of what Ford's (F) Narket cap is but only gross 2% of what Ford grosses.. If tesla was congruent with ford in terms of Market Cap Gross ratio, TSLA would be below $10. obviously that's really low and I'd say a reasonable price for TSLA at the time being would be about $40-$50. Elon Musk even indicated TSLA's stock was grossly over priced when the stock was at $160. TSLA won't fill its market cap until at least 5 years from now. Its like GOOG being $30,000 a share. Pretty insame if you ask me. Don't get me wrong... I fucking adore Tesla, but the stock is steep as shit!!", "id": "1zi2qj", "created_utc": 1393907615.0, "score": 3, "upvote_ratio": 0.57, "num_comments": 10, "comments": [{"body": "Buyers of hopes and dreams.", "score": 7, "replies": []}, {"body": "Short this sucker at $300.\n\nREALLY short this sucker at $350.\n\nNext time we are in a bear market, TSLA jumping off a cliff", "score": 6, "replies": []}, {"body": "People are paying for growth.  They see Tesla being the size of Ford in 10 years and everyone wants to get in early on before they actually get that big.  It's the same reason that Amazon and Netflix have tremendous P/E ratios.", "score": 4, "replies": [{"body": "It's a ridiculous risk at $250 ", "score": 1, "replies": [{"body": "Morgan Stanley setting a PT at 350 didn't help that either. With the inhouse battery factory and the company poised for growth, it will probably be a household name by 2020. ", "score": 5, "replies": []}, {"body": "The entire stock market is a risk.  Some stocks are riskier than others and have higher gains when those risks pay off.  I bought my first shares of Tesla after the IPO at $16 and people thought it was too risky and the company was doomed to fail.  I however had done my homework on the company, driven the roadster, and seen the incredible engineering that went into the car and all of the possibilities for electric vehicles when designed like Tesla intended.  I am now sitting at 1500% gain and see the company continuing to do well over the next several years, potentially hitting $700 a share in 4 years when the Model E is released.  Is the potential of another 250% in gains in 4 years worth the risk?  That's a question each person has to answer for themselves.", "score": -4, "replies": [{"body": "Ex-Tesla share holder here, sold just after earnings at $220, was a stressful to own for me. I don't know if this will be possible but I will buy some back cheaper if they get to a lower that level. \n\nI am surprised to hear your comments on the Roadster, I own a Model S and didn't think the Roadster was that good especially in comparison to the S. It was just an electric Lotus and very small and cramped. \n\nThe Model S is in a new league however, great car.\n\nI liked your comment, especially how some share holders always see the best future possible, it could work out but a lot can happen in 4 years, however I'd buy the stock again when it's more of a serious price, I lived and worked through the dot.com, I've seen all this before.\n\n\n", "score": 2, "replies": []}]}]}]}, {"body": "I think you guys are close but are missing the boat.. \n\nTesla isn't viewed as a motor company, its being driven (share price) on a technological mindset.  It trades like a tech, not auto.  I think most believe Musk is going to figure out what Ford originally did in the manufacturing process and basically 'rebuild' the way things are done on an electric scale, which means all these new creations will have patents that will be owned by Tesla/Musk... when that happens, pretty much anything that falls under the electric category will have to pay some type of royalty for that knowledge, this is where your getting your gap of worth perception.", "score": 1, "replies": [{"body": "Let's be honest: the valuation is even ludicrous for being considered a tech company.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It is good and bad depending on how you want to frame the question.  Will this help the electric auto? Yes, will it help Tesla share price? No.  Now that proprietary knowledge is for public use this will help the speed of increasing the electric infrastructure which in turn would bring on more competition and make the purchase of one of the vehicles more practically to the every day joe (can expect recharge stations to actually be in locations instead of small communities but whom is going to pay for this?).  However, without having anything proprietary other than \"we did it first\" isn't going to make you better.  I know ill probably get laughed at by the Tesla tree huggers but doing some chart work.. I would short this with a stoploss to cover at a close over $220, technically i believe it will go back to $40 eventually.  $200 seems to be the battleground right now, and if it can't hold that.. then it will drop and drop fast.", "score": 1, "replies": []}]}]}]}
