{"title": "Is it dumb it expect a crash?", "selftext": "I know everyone says not to predict a market, but I won’t be retiring for the next 40+ years. The chances there won’t be a crash in that time is slim to none, especially with the tensions within the USA/the world. \n\nHow dumb would it be to stick EVERYTHING in a HYSA and then buy when the inevitable crash happens? I was watching a 2008 documentary and it mentioned how a lot of people got very rich from the crash if they had the capital available. \n\nI feel like a crash is coming sooner than later. The boggle head way is to wait it out but …. why not sell high buy low?", "id": "18q8yer", "created_utc": 1703469177.0, "score": 173, "upvote_ratio": 0.77, "num_comments": 341, "comments": [{"body": "Easy to say, much harder to do. How do you know when it’s a good time to buy? 10% decline? 20%? 50%?\n\nWhat if the market goes up 30% from here and then crashes 20%. Is that a good time to buy?\n\nYou should read about Bob. \n\nhttps://awealthofcommonsense.com/2014/02/worlds-worst-market-timer/", "score": 360, "replies": [{"body": "The last example (2022) had *plenty* of people saying it'll get worse when we were at the bottom. It's impossible to tell.", "score": 96, "replies": [{"body": "Yep. Reporting in, I completely missed the dip", "score": 55, "replies": [{"body": "🫡", "score": 4, "replies": []}]}, {"body": "You dont have to even predict when we are at the bottom. Just dollar cost average as you ride the camel hump down", "score": 11, "replies": [{"body": "Yeah, that's a strategy that would work reasonably well, but people weren't even doing that.", "score": 4, "replies": []}, {"body": "DCA… if you think that’s smart get out of stocks. dca in hedge funds is the biggest joke. i decline every person that says DCA in an interview. I HIRE people that make fun of it. shows where your mindset is. if your okay buying stocks as they drop your a fool. if you had a billion would you DCA and waste capital? just buy at the bottom. if you don’t know when the bottom is get out of the market. you are clueless. macro and micro analysis will tell you when we are at a top or bottom. did anyone expect stocks to drop 50% and go lower? who in their right mind would expect stocks to go up when businesses were closed. i pitched to my boss why stocks would drop as everything was sky rocketing up. it’s obvious when the market is under or over valued. go ahead and buy nvidia at 500. does this seem smart? whats the upside, 2x? silly. laughable even. everyone saying it’s hard to tell. is it? maybe for you idiot retail traders. no institution teaches traders to DCA. it’s a joke. learn to think like a bank. treat your 1,000 like a trillion and invest it properly. do deep market analysis in multiple asset classes and sectors and you will know. if you don’t know how to use spreadsheets ahahaha fuck out of the market. actually stay so i can take your money. WHO TOLD YOU ABOUT DCA?  crypto losers posting videos because they bought an asset class THE MOST speculative asset on the planet. and you take advice from these fools? what use case do you see for any crypto in the next 10 years. will your grandma be using btc? ok then prob not a wise investment. i made more money than you in crypto and jumped ship as soon as possible. talk to portfolio managers about crypto and they will laugh on the inside. you are the people that give us millions. ride the camel hump? your a fucking idiot. don’t take advice from idiots posting on youtube or reddit. they are all fools. specialize and expand your current career and throw money into long term stocks with decent upside. apple sony nvidia coca-cola microsoft walt disney. get out of here with dca fucking idiots. or get played by the big banks. i’m a genius and rich. your poor and stupid making stupid decisions with your money. and you wonder why your broke…. smh.", "score": -8, "replies": [{"body": "I refuse to read this blob of unformatted garbage", "score": 10, "replies": []}, {"body": "lol at your take on nvidea", "score": 1, "replies": []}, {"body": "Bro did you make your account to say this 😭 \n\nI felt a u we’re trying to be serious but u may have broken character lol", "score": 1, "replies": []}, {"body": "Someone let Donald on the interwebs again", "score": 1, "replies": [{"body": "good one…. retard…. stay broke ❤️", "score": 1, "replies": [{"body": "😘", "score": 1, "replies": []}]}]}, {"body": "There is a 0% chance you are a PM at a hedge fund", "score": 1, "replies": []}]}]}]}, {"body": "What if the Market goes 600% in a few years and the crash is only 40%", "score": 33, "replies": [{"body": "The thing is that the numbers already don't support current valuations. The stock market has doubled in just 4-6 years (edited, my original timeline of 4 years only holds true for the Nasdaq, which is what im usually looking at), but the actual growth is just a fraction of that outside of a few specific companies. I really don't see how there isn't a big correction coming because stock prices have the next 3-5 years of earnings priced in already. \n\nI'm still in, but I have it set up so I can move everything out of stocks if a crash happens.", "score": 1, "replies": [{"body": "Why sell after a crash??", "score": 22, "replies": [{"body": "Right? If you're afraid of a crash, don't invest in an ETF. That's a long-term investment, you're in for 10 at least, but possibly 20-30 years.", "score": 1, "replies": []}, {"body": "Who said anything about selling after the crash?", "score": -5, "replies": [{"body": "\n>I'm still in, but I have it set up so I can move everything out of stocks if a crash happens.\n\nYou?", "score": 2, "replies": [{"body": "I said move it in case a crash happens. As in, I'd sell BEFORE it tumbled *all* the way down. If it tumbles 10%, and there's still significant downward pressure, why wouldn't you sell before it goes down another 30-40%? Sell *close* to the top, buy *close* to the bottom when you can see the bottom is formed and the recovery is coming, and you can significantly improve your position. I made a lot of money doing that during Covid. There's corrections every 2 years on average, it's really not hard to tell when a downward trend is happening, especially if there's a recession involved. \n\nAsk any rich person, they make their fortunes on market downturns. Warren Buffet has been selling stocks like crazy because he's not dumb enough to think that a market correction is never coming.", "score": -1, "replies": []}]}]}]}, {"body": "Not everything has to make sense and to even pretend we know what the market will do is hubris.", "score": 8, "replies": [{"body": "Well, you're right that it doesn't have to make sense. Looking at the market today, even adjusting for inflation, it doesn't make sense.... Yet here we are.\n\nIt's also not hard to come to the conclusion that a correction is coming. It's inevitable, it IS coming. There's never been a point in the history of the stock market that this hasn't held true. The only question is *WHEN*.", "score": 2, "replies": []}]}, {"body": "Don't worry the money printer is gonna come back online and pump our bags to 7-9 years earnings", "score": 2, "replies": []}, {"body": "The stock market has not doubled in just 4 years.\n\nThe average stock market return for the last 5 years was 11.33% (7.28% when adjusted for inflation), for the last 10 years it was 12.39% (9.48% when adjusted for inflation), for the last 20 years it was 9.75% (7.03% when adjusted for inflation), and for the last 30 years it was 9.90% (7.22% when adjusted for inflation) ..\n\nhttps://www.sofi.com/learn/content/average-stock-market-return/#:~:text=The%20average%20stock%20market%20return%20for%20the%20last%205%20years,7.22%25%20when%20adjusted%20for%20inflation)", "score": 4, "replies": [{"body": "11% compounded over that 5 year period would come out pretty close I think. Napkin math, maybe I'm wrong?", "score": 2, "replies": []}, {"body": "4 years ago, the Nasdaq was at 8k, today it sits at 15k. That was the one I was talking about, but I admittedly said market*s*, as in plural. The DJIA in 2016 was around 18k, today it sits at 37.4k. The S&P 500 in 2017 sat at 2.4k, today it sits at 4.8k. So in the last 4-7 years, every major market index has nearly or actually doubled. Has the inflation adjusted economy gone up 100% in that time frame? Hell no, not even close.\n\nLol nice, downvote accurate verifiable data. Peak Reddit right there.", "score": 2, "replies": [{"body": "For whatever it is worth, you are correct. Look at yield curve, fed funds rate, sahm rule, cme fed watch tool, unemployment rate, M2, currentmarketvaluation dot com and past behavior when these signals start flashing. Euphoria is here. People are going to tell you that youre crazy. There is no telling where this all goes but if you have wealth to protect, it's not a crazy idea to do so. A lot of wealthy individuals sold this year and that seems to always happen before a downturn. Preserving wealth matters much more than potential gains. I know plenty of individuals that lost everything in 2000 and 2009 and never recovered. Be careful, trust yourself, and worst case is if youre wrong you haven't lost anything but potential gains, which no one can promise either. I have found that if you sell in the middle of a FOMC pause and go back to equities after the fed is finished lowering rates, that you will be protecting yourself as much as possible. Increasing your risk can bring increased rewards but that is a personal choice. Right now, personally, I believe we are looking at a pretty steep regression towards the mean but the feds actions will indicate things as it progresses. Seems right now that the start will be somewhere after June 2024. Good luck and only trust your instincts and common sense. Dont operate from fear or reddit comments, use data and make informed decisions. Good luck!  TLDR dont fight the fed (read the FOMC minutes, they are telling you where things are going)", "score": 1, "replies": []}]}]}, {"body": "What do you mean you have it “set up” so you can move out of stocks..? After the price drops? Yikes", "score": 2, "replies": [{"body": "There's plenty of room in between a small drop and the bottom of a recession bottom. It's not hard to see when a recession is coming lol. I did it during Covid and made a lot of money that I otherwise wouldn't have made.\n\nIf you're willing to put in the effort of managing your own finances instead of just passive investing, there are a lot of opportunities to get ahead.", "score": 2, "replies": [{"body": "Good luck with that. You lost me at saying it’s easy to see a recession coming. Have fun trying to time and predict the market, hope it works out for you.\n\nEdit: and I just saw your comment about having less than $10k invested.. speaks for itself.", "score": 2, "replies": [{"body": "Never once did I say I only have 10k invested total lmao. Show me where I've ever said that, because I call bullshit. I have that much between just 2 individual stock holdings, not including all the other stocks I hold. I have multiple times that even in my smallest account, and I have 5 accounts. 🤦‍♂️\n\n\nLmao, real mature Lumpytits, talk shit and then block the person so you don't have to deal with the response? Snowflake. And yes, between my two largest individual stock holdings I have over 10k, where the dumbass that deleted his post claimed I didn't have 10k period.", "score": 1, "replies": [{"body": "In 2 stock holdings?  Who is this Arnold, to be able to carry such heavy bags..........", "score": 0, "replies": []}]}]}]}]}, {"body": "You must be using non inflation numbers.  Apple, Microsoft, everyone will be reporting profits in the trillions soon.", "score": 1, "replies": [{"body": "Is that so? *Trillions* in profit? Wouldn't that make their forward PE around 3 instead of 30 where it actually sits?\n\nI think youre *slightly* overestimating things 😆", "score": 4, "replies": []}]}, {"body": "What do you think about market prices now 💀", "score": 1, "replies": []}, {"body": "There are more people and more money buying stocks than ever before, + inflation. Valuations aren't going to stay the same. Now that it's so easy to buy stocks and everyone does it, they're going to be worth less. If you think you can get a better return somewhere else you should. But I think it's silly to think you're going to get the same value out of a share as you did 20 years ago when you had to call your broker etc. If more people are buying prices are going to be higher. Plus money is worth less than ever before. That's my 2 cents", "score": 0, "replies": [{"body": "When everyone is buying stocks, they are worth less? Today I learned lol!", "score": 6, "replies": [{"body": "The cost per share goes up, the value you get per share goes down. Glad I could help", "score": 1, "replies": []}]}, {"body": "Bruh...two thirds of Americans living paycheck to paycheck....htf \"everyone\" buying stock??", "score": 1, "replies": []}]}, {"body": "\"numbers already don't support current valuations.\"   \n\n\nHow can you possibly decide what a practically infinite world of investors is willing to pay for a huge asset base?", "score": 0, "replies": [{"body": "Because the valuations that most of these stocks are selling at are insane for where the business actually sits. They're pricing in the next 3-5 years of expected growth into TODAY'S stock prices. Nobody knows if any of these stocks will be able to grow at that accelerated of a rate. The expectations are extremely unrealistic for the overall market. It's all speculation that's driving these rapidly increasing stock prices.\n\nThe inflation adjusted economy has grown by a couple percent. To say that the entire stock market grew 100% over the last 4-6 years is normal is just idiotic.", "score": 1, "replies": []}]}, {"body": "Your last sentence just shows how much you still have to learn. If the market crashes, you should be buying. Not selling. lol", "score": 1, "replies": [{"body": "Do you make a habit out of catching falling knives? You wait until a bottom is formed before you start buying, genius.", "score": 1, "replies": [{"body": "And of course, I would love to know how you happened to have figured out when a market has bottomed. Surely you know how silly that sounds. Nobody can consistently make that call. There is no science to it.\n\nThink about how many people throughout history have said “I’m not buying now, I don’t want to catch a falling knife” only to then miss out on crazy gains. You sound like the kind of guy who got scared in September, sold in October, then missed out on the Nov-Dec madness.", "score": 3, "replies": [{"body": "March 26th, 2021. I successfully timed the Covid rebound down to the day because the bottom had formed and all the indicators showed recovery. I dropped everything I had on stocks starting on March 27th and made *substantial* returns. \n\nDid I get lucky? Maybe. But most of it was reading the market, knowing that it was so far down that I'd never lose that money in the long run, and pouncing at the first sign of upward movement. If I had listened to all the advice on these forums, I would have lost out on a significant amount of profit and placement in long term holdings.", "score": 2, "replies": [{"body": "You timed the market and absolutely got lucky. “The first sign of upward movement” you know how many times we’ve had signs of upward movement only to plummet another 10%? Reading charts is about the same as reading palms", "score": 3, "replies": [{"body": "Just because not everyone knows what to look for doesn't mean reading charts isn't useful. There were clear indicators right before the rebound. I'm not the only one who noticed them, because the next day kicked off a buying spree and sharp recovery.\n\nOnce the trade line breaks past the descending channel, a clear bottom has been formed where each microdip is a little higher than the last few, then all of the sudden you have upward movement that breaks above the last dips high, you've got a pretty damn good chance that things are going up from there. Even more so after a crash like what happened during Covid. Even if my timing was off, the market was *so* far down at that point that I couldn't lose. \n\nhttps://www.investopedia.com/terms/c/cupandhandle.asp#:~:text=A%20cup%20and%20handle%20is,spot%20opportunities%20to%20go%20long.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Market never goes straight up or down.  How do you know when to get out?  When the market drops 1%, 2%, 3% in a day or a week?\n\nNumbers don't support current valuations on which stock? Rotate money out of the high flyers to the laggards.  There is always something doing well.", "score": 1, "replies": []}]}, {"body": "What if China and America start a war over Xmas? I can play that game too", "score": -7, "replies": [{"body": "What if I don't have a second Krispy Kreme at lunch?", "score": 3, "replies": [{"body": "This guy gets it", "score": 2, "replies": []}]}, {"body": "Then i don’t think the market will worry you", "score": 8, "replies": [{"body": "You win that game", "score": 1, "replies": []}]}, {"body": "Rational strategy is normally to go all in. Either everyone's dead or the fear is overblown.", "score": 1, "replies": []}]}, {"body": "I know right 😒", "score": 1, "replies": []}]}, {"body": "Ben Carlson is very smart. There are no good market timers. \n\nStay in the market and be patient.", "score": 68, "replies": [{"body": "I don't time the Market but I do cash out when I make 10% in a short amount of time. So far its worked out very well", "score": 1, "replies": [{"body": "I also tend to cut the flowers in my garden when they're growing too well. \n\nWhat does that last sentence mean, how long have you been invested and how does your performance compare to the market?", "score": 20, "replies": [{"body": "Imagine auto capping growth at 10%…….", "score": 16, "replies": [{"body": "Imagine thinking you will go broke taking a profit", "score": 8, "replies": [{"body": "No one’s saying you’d go broke. You’re just making less money than a person who doesn’t do this.", "score": 14, "replies": [{"body": "That's fair, but I also put half of my savings into my home, I'm well diversified long-term with a small monthly mortgage payment. I do want to invest long term but ever since I received my inheritance, the market has been wacko\n\nBut yes, I sure wish I kept my Starbucks shares that I bought at $64 during the pandemic.  I like to take profits and then re direct that money elsewhere. Sometimes, it works really well. Sometimes Google crashes when I bought them last August at 118. And that's fine as well. I waited till it got back to 130 recently and took my 10%. I have massively outperformed the market over the past few years doing this. I do have GICs (guaranteed investment certificates) in Canada and a lot of money in my home in Calgary which if you do a quick internet search you will see house prices have done nothing but go up MOM. I'm doing just fine", "score": 2, "replies": []}]}, {"body": "Part of the reason to invest is long term capital gains if living in the US.", "score": 1, "replies": []}]}, {"body": "Probably to reinvest into lower risk options to maintain the already gained value", "score": 1, "replies": []}]}, {"body": "You actually don't want to know how I performed against the Market the past 2 years.....between my RRSP and TFSA I am up close to 20% \nA lot of buying and selling the big tech. Of course you won't believe me (because you don't want to) but you asked \nI've also bought a investment home in Toronto in 2019 and Sold when it doubled in 2022. From there I was able to buy a home in Calgary in Sept 2022 which has gone up 25% lol\n\nI probably shouldn't have sold my Toronto home at the top of the market either. Someone else whose not named Warren Buffet please keep giving me investment advice", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": ">No need to act like a pretentious buffoon\n\nYou literally asked how I did against the Market. You don't like my answer so I'm a pretentious bufoot lol", "score": 1, "replies": []}, {"body": ">And I wonder why you're only talking about the past 2 years ;-)\n\nMy mom died in 2018 left me 330k\nI'm now at a net worth of 500K and have barely worked in 5 years....\nDid you miss the story where I bought a home and sold it in 2022 at the top of the market? \n\nNot just 2 years", "score": 0, "replies": [{"body": "You sound like an Uber driver that needs to prove they are not just an Uber driver while driving to the airport.", "score": 3, "replies": [{"body": "Lol 😆  \n\nI love that you combed my profile. Life's not that deep bro. \n\nMerry Christmas and all the health and happiness in 2024 🙂", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Sounds more like gambling than investing to me.\n\nWhat’s your return after you pay taxes on the short term gains? 4-6%? For now you may as well just stick it in a HYSA lmao", "score": 1, "replies": [{"body": "HYSA are taxed at INCOME tax, which, for many, is HIGHER than CGT.", "score": 1, "replies": []}, {"body": "No taxes bro\nAll in tax sheltered accounts in Canada.  RRSP and TFSA.......", "score": 1, "replies": [{"body": "What’s the logic behind cashing out when you make 10%..? Also hilarious to say “I don’t time the market but actually I do”", "score": 2, "replies": [{"body": "My logic is if I can make 10% in one month on a stock then it is significantly more profitable than a GIC at 5.5% which takes an entire year to mature. Explain to me why people make safe investments with their money which can yield minimal gains than what is wrong with making 10% in a month and then cashing that out? I never cash out when I am down and I don't buy risky or volatile stocks. This year I have bought and sold, Apple, Google, Microsoft, Costco, Mcdonalds and a bunch of Canadian bank stocks. I am not out here investing in penny stocks. Also when my Cad bank stocks arent getting returns I am still earning dividends so when the market comes back like it has recently I am making even more. You guys do you but telling people on reddit that you know better is actually the hilarious part. I don't believe looking at the current economic outlook (almost guaranteed recession in Canada) and evaluate how you want to invest your money. Having a bit of money on the sidelines is certainly not the worst thing as we enter the new year.  Remember 2021 ended just like this with a massive rally and 2022 was a disaster", "score": 1, "replies": [{"body": "Because the market doesn't move up smoothly, there are large jumps, and you will miss them with that strategy.  You are giving away the upside from the very infrequent but big upward moves that happen in the market, without adequate compensation.  When you are betting against infrequent events, in the short run it looks like you are beating the market.  In the long run, you underperform.  Read Buffet's letters to shareholders, he explains it better than a Reddit poster.  \n\n\nGood luck.", "score": 1, "replies": []}]}]}]}]}, {"body": "Thought - read up on technical analysis. You will learn about entry and exit points if you are a trader. \n\nAn investor owns the security unless your underlying thesis changes. \n\nBest of luck to you in the new year", "score": 1, "replies": []}]}, {"body": "He’s so wrong on that", "score": -18, "replies": []}, {"body": "I'm a great market timer. read stocks for the long run by Jeremy seagull. You can greatly reduce portfolio volatility while only sacrificing a small amount of gains by using the 200 day moving average (technical indicator)", "score": -28, "replies": [{"body": "Siegel not Seagull. :)", "score": 9, "replies": [{"body": "*Seagal", "score": 0, "replies": []}, {"body": "Can’t spell the author name correctly on the book he’s recommending. Bet he barely skimmed through the back cover page. Not even the 1st chapter, or an entire back covered. Just first sentence", "score": -4, "replies": [{"body": " you could assume his phone has something called auto correct.", "score": 9, "replies": [{"body": "I could also assume Reddit has edit function", "score": -3, "replies": []}]}]}]}]}]}, {"body": "Exactly. And another thing. If you buy for instance Apple or some Index fund. The chances are these are up 50% or more when the time comes for a crash. So you will take a hit that does not even get you in to negative numbers. This is the case for most long term investors. Sure the market might take a hit now and then, and it sucks to see your saving plummet 30%. But overall, you will still be up on your investments.\n\nThis is what happened to me with covid. I lost perhaps 25%. Had some anxiety when day after day you see 5000 dollars per day lost. However, I was never down to negative looking at my total gains from investment. I sold far from bottom, brought it back a bit too late, and I think I did better than most even if it was not great. Its difficult to \"time\" given that the market moves up and down all the time, and the media sentiment is often way off.", "score": 6, "replies": []}, {"body": ">https://awealthofcommonsense.com/2014/02/worlds-worst-market-timer/\n\nThis is awesome - it's so counterintuitive to buy low and sell high because it feels scary to buy low, but that's exactly what you're supposed to do.", "score": 6, "replies": [{"body": "I like the phrasing: Sell on confidence, buy on fear.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -1, "replies": []}]}, {"body": "50% decline is a good time to buy", "score": 2, "replies": []}, {"body": "Take a look at the last few crash and use the minimum as your target. And check how much time the market spends at the bottom. Research the crashes and recoveries.", "score": -1, "replies": []}, {"body": "Great article. I'll share in [next week's newsletter](https://sundaymoney.com/subscribe)", "score": 1, "replies": []}, {"body": "it's a bit strange example in 1972 (just afterr his first 3 years) he put in 6000 dollar, which is nearly a quarter of the average house price  (27000 dollar) at the time\n\nso i am totally not suprised that he ended up as a millionaire more than 40 years later", "score": 1, "replies": []}, {"body": "Ben is a good twitter follow", "score": 1, "replies": []}]}, {"body": "Crashes always happen. The problem is it's impossible to time either the top or the bottom. Did you buy the \\~25% crash last year or the \\~35% crash 3 years ago? It sounds like not. Just stay invested in the market and continue contributing though the ups and downs is the foolproof way to win.", "score": 52, "replies": []}, {"body": "Just heard a story of a guy who has been holding cash since 2010, waiting for the next crash. When 2020 came along and the market crashed 30% in 5 weeks he was too scared to get back in. I guess he’s still in cash.  Think of all the gains he missed out on.", "score": 65, "replies": [{"body": "Amazed he didn't become more scared of missing out on the upside than risking the downside at some point", "score": 4, "replies": []}]}, {"body": "They say people over estimate what they can do in a year and under estimate what they can do in 10 years. Stick to the basics and you will win considering you have time on your side.", "score": 22, "replies": []}, {"body": "I'd say that arbitrarily calling for a crash after breaking ATHs might be a dangerous game.", "score": 44, "replies": [{"body": "Crashes usually happen right after a new ATH or close to it.", "score": 4, "replies": [{"body": "Don't confuse crash with pullback. Do markets pullback, ebb and flow? Yes! Is a all time high an indicator of a crash? Not likely. The market is up 70% of the time.", "score": 13, "replies": []}, {"body": "New aths also usually happen right after a new ath.", "score": 10, "replies": []}, {"body": "No way.", "score": 1, "replies": []}]}]}, {"body": "Let me tell you my story. We bought our home in 2005 in San Diego when the market was hot. I got a 50k bonus from a deal I closed and went all in on AAPL after the iPhone released @ $5 a share at an ATH in 2007. Everything crashed 50% in 2008, my house was upside down and I thought we were going bankrupt. Did I walk away? Sell everything? Go broke? No. I held all the way through today. Went through GFC, COVID, 25% crash in 2022 and still retiring next year at age 50. \n\nMoral of the story. You don’t time the market. Invest wisely and hold it. You will be rewarded.", "score": 70, "replies": [{"body": "This is a silly comparison because IPO’s were used as growth tools back then. Today, they are used as liquidity events at max value. The game has changed and trading swings is really the only way to get ahead now.", "score": -15, "replies": [{"body": "The moral of the story is to hold through ups abd downs.", "score": 12, "replies": [{"body": "I do think there’s a case to be made that this will eventually not be true. We’re used to average annual returns that have plenty of reasons to flatten out on longer timescales, but at worst you’ll be in the same boat as everyone else.", "score": 1, "replies": []}]}, {"body": "Yeah silly comparison.", "score": -2, "replies": []}]}]}, {"body": "The question is when is the high, when is the low. That's the problem.", "score": 23, "replies": [{"body": "Time in the market beats timing the market", "score": 11, "replies": [{"body": "If my grandmother had wheels, she would have been a bike", "score": 15, "replies": [{"body": "I'd ride that bike.", "score": 11, "replies": [{"body": "community bicycle.  everyone gets a ride.", "score": 1, "replies": [{"body": "Old person community? Or is this ride open to the general public? Do I require a wrist band for multiple rides? 🤣", "score": 2, "replies": []}]}]}, {"body": "If your grandmother had balls, she'd be a man.", "score": 1, "replies": [{"body": "If my grandmother had balls, we wouldn't be having this conversation.", "score": 1, "replies": [{"body": "If your grandmother was a bike, you would be a Huffy.", "score": 1, "replies": [{"body": "I'd be a Redline 550 with pegs and a baseball card in the spokes.", "score": 1, "replies": [{"body": "You would be a Toys R Us entry-level Huffy, next to the Nash skateboards.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "It’s the election year. Keep that in mind.\n\n25% upside in the run up to the election, and that’s the best time to do one of the following:\n\n1. Buy\n2. Sell\n3. Do nothing", "score": 29, "replies": [{"body": "and the election ends one of three ways:\n\ntrump wins, biden wins, or both of them croak before the election\n\neither way, the market goes to the right", "score": 16, "replies": [{"body": "Are you sure the market will go right?", "score": -2, "replies": [{"body": "Never seen a chart that didnt", "score": 7, "replies": [{"body": "Good Argument", "score": 4, "replies": [{"body": "I mean I guess the alternative is the cessation of the linear passage of time, but it's not an option I would bet on.", "score": 4, "replies": [{"body": "Non-linear, still going to the right........", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Remember, over 40+ years if you just invest on a regular schedule no matter what the market looks like, any crash in the market isn’t going to be much more than a small blip in the portfolio. Jumping in and out of markets or waiting on the sidelines is not a good strategy. That being said, if you’re contributing regularly and there’s a dip in the market while you have some extra disposable income, you can always make an extra contribution. I happened to luck out with mine in March 2020 when I decided to contribute the rest of my Roth IRA. But that was luck, not skill.", "score": 32, "replies": [{"body": "40+ years? How old are you? I'm in my 30s and no way I want to wait 40 years (or even 20 years) to capitalize on my investments.", "score": 1, "replies": []}, {"body": "Bro learn how to read economic data and u can time the market anyone telling u can't is fucking lying, they just want everyone to be apart of the party. Full time trading is a real thing not a myth, just become that good.", "score": -16, "replies": [{"body": "lol", "score": 6, "replies": []}]}]}, {"body": "It’s your money, do what you want? Or are you waiting for Reddit to bust out the Time Machine and tell you what’s gonna happen next?", "score": 7, "replies": []}, {"body": "Fed forecasting rate cuts starting in March 2024. Historically, markets peak just before or after a rate cut then its downhill from there. Not saying it’s going to happen. However, fed have never achieved a soft landing in these conditions with the inversion of 10 year and 2 month yields.", "score": 8, "replies": [{"body": "How often does that happen not because the rate cut caused the crash, but the other way around?\n\nBecause this time around they will start cutting during a time when the economy is actually not doing that badly.", "score": 1, "replies": [{"body": "Nearly every time it happens. Also, the 2 year and 10minth bonds inverted. Unemployment is beginning to increase actually. Europe is almost in a recession and often stocks rally into a recession.", "score": 1, "replies": []}]}]}, {"body": "I know people who always expect a crash, and so moved in and out of the market- they are the ones still working after I and others retired.", "score": 30, "replies": [{"body": "Good one loser", "score": -27, "replies": [{"body": "You can keep killing orcs in Diablo and stay away from investing! Lets see how it goes then LOSER", "score": 1, "replies": []}]}]}, {"body": ">I feel like a crash is coming sooner than later\n\nBro we just had a crash in 2022. You expecting a crash every 2 years?", "score": 34, "replies": [{"body": "Actually we kinda had two.", "score": 21, "replies": [{"body": "We definitely had 2 since 2020", "score": 5, "replies": [{"body": "One was a mini crash. OP would definitely have stayed on the side hoping for a deeper bottom that never came.\n\nPoint is, you can't time the crash, and even if you do it's hard to tell when you'll reach bottom. Especially a guy who does not seem like a top investor (I assume that top investors don't post on reddit).", "score": 1, "replies": []}]}]}, {"body": "Exactly", "score": 7, "replies": [{"body": "Also in March 2022", "score": 2, "replies": [{"body": "You mean 2020? Indeed in 2022 it crashed like the comment said", "score": 3, "replies": [{"body": "In all fairness, the 2020 was a Black swan and I am no pro but the market has returned to pre covid/black swan  levels so do what you will with that", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s a very bad idea and there’s no clear reason to expect a crash right now, not even legit storm clouds There’s a general rule to always be in the mkt if we’re above the 200dma and when we’re below you’re allowed to consider otherwise. When backtested it was the only consistent way to not go on the rides down. \n\nYou want to know the worst part? Even when you can see the crash coming you can still mess it up by not putting all your money back in fast enough. During covid I had a plan to dca based on a 50% drop and we went from down 36% to only down 20% really, really fast. Put your money in the mkt and buy some long term bond funds as dry powder for a calamity, tickers blv & tlt. \n\nPay attention to China and Taiwan. I think that one could take us for a whirl later this decade.", "score": 11, "replies": []}, {"body": "If really concerned about a crash…..keep your current investments and start contributing to a separate account that is invested in t-bills, etc with the idea that WHEN a crash happens, you deploy the new account funds and have DCA’d your portfolio to lower cost basis! If market continues going up, you win with your current acct…..and if market goes down, you win by being able to buy more at cheaper prices!", "score": 8, "replies": [{"body": " Geisha’s night in Harlem l.", "score": 0, "replies": []}]}, {"body": "Short answer: no. We won’t know when a crash will happen. If you have capital now, who knows if the market goes up 70%, then a 20% crash. Unless you have a proven record of timing markets, I would stick and wait it out.", "score": 3, "replies": [{"body": "does a 70% market upswing seem possible whatsoever? I’m brand new to all this but isn’t that basically creating 70% capital over what we have now?", "score": 0, "replies": [{"body": "Not only is it possible, it's routine. The market is currently up 70% since Sept 2020. The market doubles [roughly every 7 years on average](https://www.investopedia.com/financial-edge/0711/how-to-double-your-money-every-6-years.aspx), that's a 100% return every 7 years. \n\nThe increase in capital you're taking about is actually an increase in the market cap (I.e. the total value) of all publicly traded companies. Companies are generally considered valuable because of their ability to turn a profit. It isn't a zero sum game; our economy is growing and so is the value of our companies.", "score": 7, "replies": []}, {"body": "Peter Lynch has said that the market will double every 8 years on average, so just stay invested and wait for it.", "score": 3, "replies": []}, {"body": "If I knew if that could happen, I wouldn’t be on Reddit lol. It can happen, but I don’t expect anywhere near 70%. I like to move money around, but I still wouldn’t gamble on a market downturn, against a market upturn. I think we will have a continued bullish market next year, but again, we don’t know. It all comes down to rates and earnings.", "score": 3, "replies": []}, {"body": "The US market is up by 254% in the past 10 years and by 82% in the last 5.", "score": 1, "replies": []}]}]}, {"body": "They won't let the crash happen before November....", "score": 10, "replies": [{"body": "Printers gonna print - brrrr Merry Christmas 🎁", "score": 5, "replies": []}, {"body": "Bingo", "score": 4, "replies": []}, {"body": "2008 and 2000 dotcom crash ring any bells?", "score": 3, "replies": [{"body": "As non political as I can keep this, they want this president to stay in place even though he's mostly absent.", "score": 1, "replies": [{"body": "Yeah but doesn’t mean they can avoid a recession it’s definitely possible", "score": 2, "replies": []}]}]}, {"body": "God, you crybabies are always making up some new excuse for losing elections. Commenting to return to this comment next November", "score": 1, "replies": []}, {"body": "It’s funny how “they” are always somehow grossly inept but also able to manipulate the entire global economy.", "score": 1, "replies": []}]}, {"body": "The crash happened last year.", "score": 12, "replies": [{"body": "What about secondsies?", "score": 3, "replies": [{"body": "There will be dips. I’ll be buying the dip if everyone starts saying the end is near.", "score": 2, "replies": [{"body": "Yes, buying low selling high is a solid strategy IMO.", "score": 2, "replies": [{"body": "My strat is to buy low and not sell for multiple years.", "score": 2, "replies": []}]}]}, {"body": "Markets are cyclical. \n\nGo ahead, time it.", "score": 1, "replies": [{"body": "Easy, I have a patek.", "score": 1, "replies": []}]}]}]}, {"body": "problem is, how will you know when the bottom is? when to deploy? you might think it will go lower.\n\nor how long will it take to recover after?\n\nalso, the market can remain irrational longer than you can remain solvent", "score": 3, "replies": []}, {"body": "Everything should be \"expected\". The stock market is essentially gambling. Any outcome always \"could\" happen, some more likely than others at any given time. Think of it like counting cards in Blackjack. If all the ACES have been played, you can expect no more Blackjacks from the shoe...however you can still win and beat the dealer if you stick to basic strategy. When the dealer shuffles the shoe you start over. Time and probability are always going to be factored into the outcome, or what cards you are likely going to be dealt. So...when the market is going up, contribute. If the market is going down, try to contribute a little more. There will always be crashes and recoveries that you can't really time. The S&P 500 is pretty much controlled by Vanguard, Black Rock, and State Street, they are the dealers... so when they decide to pull their money out and make it bleed, or dump money in and make it grow, they will. We are just riding their coattails trying to catch an occasional good hand and walk away with more money than we started with.", "score": 3, "replies": []}, {"body": "Just use common sense when buying. The last two months most charts went up in a straight line. Only morons and hedge funds that are forced to buy are buying right here. Don’t try to buy the dip, you buy the recovery. If it goes down 10% and then works back to 8% in a non violent fashion, buy some shares. If it keeps holding steady buy some more. If you’re worried about a crash after buying, buy some put protection.", "score": 3, "replies": []}, {"body": "Yes, a crash is coming. Eventually. You can hide your money and wait for it and lose out on the upside so you feel smug when it happens, while everyone else will collect the upside in the meantime.", "score": 5, "replies": []}, {"body": "You’d miss out on a lot of gains. What if the crash comes in 15 years? What if the crash comes and you buy the dip… but everything keeps going down? What if the crash only lasts a couple months and you think it’s going to last longer and you don’t buy? Tricky. If you’re expecting a crash, you better diversify, bonds, stocks, internationally, etc.", "score": 4, "replies": []}, {"body": "Here's some truths that are often repeated for a reason:\n\nHistorically, the market has gone up more than it's gone down.\n\nNo one can time it, there are too many factors. \n\nTime in the market > timing the market.\n\nEven if it seems like an obvious bubble, the market can stay \"irrational\" longer than you can stay solvent. \n\nBe comfortable with the risk you're taking. If the loss of your investment will devastate you, don't be highly regarded.", "score": 4, "replies": []}, {"body": "You could take more of a gradual option. Take some profits now and gradually get back in if the market drops. If it drops. \n\nI took maybe 10% NAV off the market recently. But I was already 95% in so this just brings me back to my normal 80/20 split.", "score": 5, "replies": []}, {"body": "what IF I know exactly when it will crash, what exactly should I buy?", "score": 2, "replies": [{"body": "Rein car nation — you’re coming back to earth my friend", "score": 1, "replies": []}, {"body": ">what IF I know exactly when it will crash, what exactly should I buy?\n\n\nA patent for your crystal ball.", "score": 1, "replies": []}]}, {"body": "The way to be a 2008 style disaster capitalist playa is to take profit regularly just like you DCA regularly.\n\nThis should mean you always have a % of your portfolio in cash at a given time.\n\nThis cash is your dip buying war chest.\n\nThis cash is not your fomo ape in more at the top fund.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’m no expert, so you’ll need to find your system.\n\nRoughly though:\n\n1. Take some profit regularly after major moves (major = subjective)\n\n2. Dont worry about the literal bottom, you could even use profits to slightly increase your DCA amounts in future and change nothing else\n\n3. This is personal. If 2008 or March 2020 just happened then it’s probably time to put your chips in… but again don’t worry about the absolute bottom, just get in there if you think there is upside coming", "score": 1, "replies": []}]}]}, {"body": "Go google “The business Cycle” and read up on that. \n\nThere’s a predictable pattern.", "score": 2, "replies": []}, {"body": "People keep hyping the market and making loose arguments about money being printed. The truth is obvious, but people want to ignore it...credit cards.", "score": 2, "replies": []}, {"body": "Go ahead ... sell it all based on a \"feeling\" 😆", "score": 5, "replies": [{"body": "Lol i’m not actually considering the idea, just had a bit of wine and wanted to entertain the idea", "score": 3, "replies": [{"body": "Good thing markets are closed Lol\nWhen JPow starts lowering interest rates in 2024 market is going to moon ... stay invested 😊", "score": 8, "replies": []}, {"body": "Don’t try timing the market. It’s all about time in the market. \n\nAsk those people who could have bought a home in 2019/2020 and didn’t because “prices are way too high and I’m waiting for housing to crash”. Then they end up buying a house +50% above those 2019/2020 prices at interest rates 3x higher…", "score": 2, "replies": []}, {"body": "Time to switch to whiskey 🤪", "score": 2, "replies": []}]}]}, {"body": "Is it dumb to expect a crash, yes. Is it dumb to anticipate a drawdown in the near future, no. There's plenty of historical reasons to think a significant drawdown is on the horizon but few reasons to expect one. \n\nThe difference being exiting the market and parking the proceeds in cash management vehicles vs staying invested and using your available cash to invest in assets that are going up now *and* that will go up more when stocks experience a significant drawdown. That way you'll have more money to put back into the market during and after the drawdown.", "score": 4, "replies": [{"body": "Well said!", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "This. You can add uncorrelated assets to your portfolio that will most likely do better during a downturn.", "score": 1, "replies": []}]}, {"body": "ATH during high interest rates. I expect a correction to happen. 10% correction.", "score": 7, "replies": [{"body": "Look at this fucking guy saying he can time the market. Why didn’t you buy QQQ hand over fist in January and enjoy the 50% return this year? Oh that’s right because you don’t know shit.", "score": 21, "replies": [{"body": "Didn’t say when…", "score": 3, "replies": [{"body": "And that matters because…", "score": 2, "replies": [{"body": "Kind of a requirement for “timing” something", "score": 4, "replies": []}]}]}]}, {"body": "Interest rates aren't even high though", "score": 4, "replies": [{"body": "Compared to the 90s? Sure. Compared to the last 20 years? Yes they definitely are", "score": 2, "replies": []}]}]}, {"body": "Until the fed actually cuts rates, yes it is", "score": 2, "replies": []}, {"body": "At this point, yeah", "score": 2, "replies": []}, {"body": "You need to correctly predict the top and bottom. Can you do that? If you somehow manage to do that, can you do it again? Bc you will definitely try to time it again and again.", "score": 2, "replies": []}, {"body": "It's dumb to 'expect' anything, you have no idea, 99.999% of people have no idea. You can make educated guesses at best.", "score": 2, "replies": []}, {"body": "There is a difference between a correction and a crash. Outside of a black swan, there’s nothing we don’t already know to price in. Yes we will have a couple 5-10% corrections between now and 2025. Those corrections could take a month or more of slow unwinding, sector by sector. It’s healthy after the market has ran this fast in such a short time, and the fact that we haven’t seen the effect of higher for longer. But the rates we will see after a few cuts over the next 18 months will become normalized and we’ll get the losses back and stabilize. Our economy is our foundation, US companies will always find ways to innovate and grow sales/profits under any condition.", "score": 2, "replies": []}, {"body": "Time in the market beats timing the market. That is investing 101. If you are an emotional investor then DCA. Otherwise lump sum as much as you can as often as you can.", "score": 3, "replies": [{"body": "This is a fair statement.", "score": 1, "replies": []}]}, {"body": "I always start to buy at 10% corrections. Which lead to more buying at 15% declines which undoubtedly lead to 20% declines as I white knuckle it and double down again. It’s very stressful but I have outperformed the market over the past  25 years. The Fed is pivoting  to dovish so stocks should do well until they pivot back to tightening. Too soon to expect next crash. Give it 6 to 9 months and see how the data plays out .", "score": 1, "replies": []}, {"body": "I believe this disinflation will rapidly spin into deflation, freaking everybody out, causing a crash by 2025. If it happens it’ll be soon. And it’ll be a big buying opportunity. But I’m just a guy on Reddit. Why listen to me? Dca into an index if you’re young", "score": 1, "replies": []}, {"body": "The crash from 2008 had more hysteria I think than the 2019 one. Not all crashes are equal. I have started to hold some cash in money market to prep for the bear market tho.", "score": 1, "replies": []}, {"body": "Crash test dummy. Say’s nah", "score": 1, "replies": []}, {"body": "March 2020 and June 2022 - Crash dates.   It’s clear skies ahead.", "score": 1, "replies": []}, {"body": "Up swings are shorter and faster than down swings. Dollar cost average and quit trying to be cute.", "score": 1, "replies": [{"body": "my grandma calls me cute everytime I see her. \n\nJust entertaining discussion :)", "score": 1, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "There will never be a crash again, they’ve tethered the printer. They’ll just “temporarily” take it out of the value of the dollar.", "score": 1, "replies": []}, {"body": "Yes, if you are expecting some huge crash it’s not coming, we might get a slowdown or a weak recession but the “big one” is always a year away until it’s not then it’s next year.", "score": 1, "replies": []}, {"body": "So I was thinking about the stripper index when I was talking to a cashier at the liquor store that does the club store picks and he was talking about the owner swapping to another club because the number of active members in the club has dropped from about 90 people to about 50 people and they are being courted by this other club that claims to have 400 people but when I looked them up they had 110 in the group compared to the 1500 Facebook people in the smaller group. Bunch of meaningless club drama and blah blah blah but…\n\nTL/DR: it appears locally at least people who normally are buying fancy bourbon once or twice a month have been cutting back. It might mean something, it might not", "score": 1, "replies": [{"body": "I love anecdotal data like this.", "score": 1, "replies": []}]}, {"body": "This is more of a 1970s and 1990s grind. High inflation and the stock market does a crab.\n\nWe on housepricecrash.co.uk (I don't visit there now) saw the big crash of 2008 coming as early as 2004. But we were way too early by about 3 years. We always felt it was going to be soon, but it never materialised next month or whatever. We all soon learned about how \"the market can remain irrational longer than you can remain solvent!\"\n\nSome took positions in bank stocks because they felt the crash in real estate would be profitable for the banks due to the repossessions. This proved to be utterly wrong as Bank stocks crashed 90% and some 100%. Even with careful reasoning, some strategies can be wrong.\n\nSome became STRs. Sell to renters, which meant cashing out their properties and renting to live. Some timed it poorly as the market kept roaring on upwards. The government kept pumping the market with \"Help to buy schemes\". The BBC and ITV mainstream media also flooded our TV screens with bullish property programmes. \n\nWhen the crash came, we didn't know that the UK government would continue to support the market by flooding the market with cheap cash. Bank lines formed, and quantitative easing was brought in to print as much money as needed to satisfy the worried savers. They managed to flatten the curve. We bought our house in 2011....lucky timing as that was the very low. \n\nPersonally, I saw the 2020 crash coming, as we saw how China was shutting down the economy and how it was spreading to become the Lockdowns that we all know and hate. I sold all my short to medium-term investments. The crash came within months. The situation was fluid and out of the blue. BUT it was as forseen. Whilst everything was falling, I did weekly stock scans to see what was rising...what was making new one year highs. It was the covid testing and treatment stocks. They were the handful of bullish stocks in a sea of red of the dark days. A huge buy. My spine shivers as I write this even now.\n\nIn the end, we didn't see how the FED and Trumps stimulus cheques managed to make a V recovery and then some! What a bull market! Anyway, at the lows of 2020, it was a good time to look for Covid stocks, and that did well for another 12-24 months.\n\n2024 will be election year I believe. I think most people are fed up and broke now. Personally, I think with this Santa rally, 2024 may turn out to be quite bullish. Gold, Bitcoin, and the Nasdaq appear to be at bases ready for lift off. \n\nGood luck in all your positions, bullish or bearish.", "score": 1, "replies": [{"body": "\"If these 7 days are higher, it typically bodes well for the full year. In fact, since 1950, when we have a positive SCR, the S&P 500 gains an average of 10.2% the following year and is higher 72.4% of the time. When Santa doesn’t come to town, those numbers fall to just 5% and 66.7%, respectively.\"\n\nhttps://finance.yahoo.com/news/famed-santa-claus-rally-begins-153300780.html#:~:text=If%20these%207%20days%20are,%25%20and%2066.7%25%2C%20respectively.\n\nDon't bother asking chatgpt... it has been trained not to give financial advice now. It's pretty useless.", "score": 1, "replies": []}]}, {"body": "When there's a market crash, take all your money out and then when the market improves, put it back in.", "score": 0, "replies": []}, {"body": "I expect some turbulence in the market as soon as the “house” comes back from vacation and the brinksmanship over funding limits resumes with full intensity", "score": 0, "replies": []}, {"body": "Your feelings don’t matter in the market. You will be wasting time waiting for a crash. At best you will get slight corrections. Get educated, do research and take action.", "score": 0, "replies": []}, {"body": "Nah the government has precautions now. Won't happen. Nothing like 2008 anyways.", "score": -3, "replies": [{"body": "Lol please explain these precautions?", "score": 3, "replies": []}]}, {"body": "You’re right though.", "score": 1, "replies": []}, {"body": "Crashes are outliers meaning they don’t happen very often and are extremely hard to predict beforehand…", "score": 1, "replies": []}, {"body": "Whatcha talkin about Willis!?", "score": 1, "replies": []}, {"body": "Very dumb. Take emotion out of investing. Keep DCAing. I know many others who tried to time the market and dumped their equity into cash. They missed all the gains and now afraid to get back into the market.", "score": 1, "replies": []}, {"body": "Not as a dumb as not spell checking your title.", "score": 1, "replies": []}, {"body": "I'm sure there will be some sort of market correction, probably soon, but what would the catalyst be for a major crash?", "score": 1, "replies": []}, {"body": "The start of the covid crash was a great opportunity. Huge dip, you could leverage up with low interest rates", "score": 1, "replies": []}, {"body": "Too hard to time IMO. Time in the market > timing the market. I'd rather be in the market and continously add to it during declining or crash periods. How much you allocate being in the market and keep in cash will ultimately be up to you.", "score": 1, "replies": []}, {"body": "There was just two, where were on those? Where will you be on the next?", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Tell me how stupid my strategy is:\n\n$500/month into a ROTH IRA. \n\n$62.50/week auto invested into SPY and $62.50/week auto invested into QQQ\n\nAround 50% is currently liquid. Would like to buy dips in a big way with that part of the portfolio. Was able to scoop up a lot when spy hit 410", "score": 1, "replies": [{"body": "I have no fucking idea i’m brand new to all this. just entertaining discussion as I learn", "score": 2, "replies": [{"body": "well that's what i do if you're interested. i've tried waiting for a crash and so far the best i got was about two months ago when spy hit 410\n\nit was a great zone and im glad i bought as much as i did but i kept a lot cash, hoping it would fall lower. all it did was rally though so you're going to want some exposure \n\nthat's why i started auto buying spy / qqq", "score": 1, "replies": []}]}]}, {"body": "Ever played Monopoly? This is a longggggg  game !!!", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Sell some puts and find out", "score": 1, "replies": []}, {"body": "If there is anything dumb Reddit might know.", "score": 1, "replies": []}, {"body": "So you’re saying it would be best to buy stocks when they are at their lowest and make profit as they rise??? \n\nHmmm this is a very intriguing idea…", "score": 1, "replies": []}, {"body": "It could go down, but it could also go up", "score": 1, "replies": []}, {"body": "You're better off sticking it out. I rode 08 to the bottom and lost 60% of my portfolio. I kept investing all the way down. My only regret is I stopped investing. I didn't sell but I stopped putting in.\n\nYou'll never time the market. Stay disciplined and keep investing.", "score": 1, "replies": []}, {"body": "More money is lost from missing out on upside than all stock crashes", "score": 1, "replies": []}, {"body": "It’s dumb to “expect” anything", "score": 1, "replies": []}, {"body": "Yes. Market is up 78% of the time.", "score": 1, "replies": []}, {"body": "We've had two crashes in the last 4 years. You missed them.", "score": 1, "replies": []}, {"body": "Buy low and sell high is the first rule of making money. Should you wait for a crash? No. But should you buy every stock at its 52-week high, in this environment? Nope. I've cashed out a bit, bought a small sum of Tbills, and am awaiting what January brings.", "score": 1, "replies": []}, {"body": "I sold most of my stocks that were doing really well this week. I am Canadian and I fully expect hard times ahead", "score": 1, "replies": []}, {"body": "there are way more dips than crashes so it's easy to time buying on dips than buying on crashes", "score": 1, "replies": []}, {"body": "A lot of the small cap stocks are still in bear market", "score": 1, "replies": []}, {"body": "This rally seems incredibly suspect to me. The Russell is still on its ass. And Bitcoin isn’t close to its ATH. \n\nHow many of the SPX stocks are above their 200 week average? And the same for the Nasdaq?", "score": 1, "replies": [{"body": "Both BTC and small caps traditionally lag the DJI, SPY, and QQQ", "score": 1, "replies": []}]}, {"body": "If you don't have the balls to buy on the way up, you won't have the balls to buy on the way down.", "score": 1, "replies": []}, {"body": "If you won't be retiring for 40 years you don't need to worry at all. Look into compounding interest. The longer you're in the more it moves. Once you get like 25 years in it's just parabolic from there.\n\nIf you put in $100/month at 8%\n\nAfter 10 years: invested $12,000, have $17,383 ~44% increase \n\nAfter 20 years: invested $24,000, have $54,914\n\nAfter 30 years: invested $36,000, have $135,939\n\nAfter 40 years: invested $48,000, have $310,867", "score": 1, "replies": []}, {"body": "Invest the way you feel confortable, if you believe there is going to be a crash, invest less periodic quantity and when it happens, increase the amount, if you are not in the market you are paying the cost of opportunity. All has a price.", "score": 1, "replies": []}, {"body": "Keep some portion of your portfolio \\~10-20% in cash so you can buy the dip, but don't build your entire strategy around a crash.", "score": 1, "replies": []}, {"body": "It crashed last year, where were you? Worst decline since 2008 and it’s already rebounded to almost all time highs. IMO yes, i think its dumb to expect a crash anytime soon.", "score": 1, "replies": []}, {"body": "I thought if you expect a downturn you go for stuff like Walmart or ultra luxury, the two extremes. Was I misinformed?", "score": 1, "replies": []}, {"body": "Nobody knows when a crash would happen. People have predicted it over the last number of years.\n\nIt is possible and should happen fundamentally IMO because the drivers of the market have stretched valuations. That being said as long as there is more buy demand than sell demand prices will go up. \n\nThe only thing investors can do is look for good prices on good companies.", "score": 1, "replies": []}, {"body": "How about DCA", "score": 1, "replies": []}, {"body": "To be honest, best to sit on your hands and see what happens.", "score": 1, "replies": []}, {"body": "Pretty dumb.", "score": 1, "replies": []}, {"body": "The market is overvalued 40 percent right now and it always reverts to mean at some point. Just a matter of when.", "score": 1, "replies": []}, {"body": "You could also play it safer and DCA in every month. This way you will buy when the market is down and when when it is up you can always keep an eye out for some undervalued stock and buy that. I am doing it like that. Always looking for a bargain.", "score": 1, "replies": []}, {"body": "This is what am doing. I wasn’t invested the first 28 years of my life, waiting 2 more hours with my money parked in High saving accounts + maybe gold won’t hurt my life perspective", "score": 1, "replies": []}, {"body": "If you feel like a crash is coming soon then keep a bit of cash free, but not investing at all right now would be really dumb.\n\nEven in November people were saying that a crash was coming soon and look at where we are now, everything is up 10%+", "score": 1, "replies": []}, {"body": "We all say you can predict the market. In most part, it’s true. But, the fact is that the market has cycles. Thus, it will go down at some point, and there will be a little to big crash. No one will know the degree of the crash. Then, when do you get in is the question.", "score": 1, "replies": []}, {"body": "The problem is that the current government won't let a crash happen", "score": 1, "replies": []}, {"body": "LOL. You are not smarter than all the investors. If it was so easy there would be million of millionaires. Think about it", "score": 1, "replies": [{"body": "according to google there are 59.4 million millionaires out there", "score": 0, "replies": [{"body": "How many of them were from investing?", "score": 2, "replies": []}]}]}, {"body": "Howard  mark's book mastering market cycles.  You're never ti.e the market perfectly if you do it was luck . Put reading his book and his memo. Learning where you are is quite important.  But it's different for everyone.  Age time  speare cash", "score": 1, "replies": []}, {"body": "I tried this in 2013.  Didn't work out.  Stay invested, keep some cash for crashes.", "score": 1, "replies": []}, {"body": "Simple strategy is to save money in bills and when market go down 10٪ buy an index fund with 25% of your money if go down with another 10% buy with another 25% and if go another 10٪ buy with another 25%. Continue saving money in bills and on every 10% drop buy with 25% of your power. And never sell.", "score": 1, "replies": []}, {"body": "It really comes down to gambling, you will get no certainty from any advice, strategy, person… place your bets like everyone else and live with the results.\n\nBuffett and Bogle were both gamblers, they just had very effective strategies and skill at their systems.  Your grandma with 100% in a savings account is also a gambler, she just doesn’t realize it.", "score": 1, "replies": []}, {"body": "Then profit from being right. Buy SQQQ SPXS until your inevitable outcome happens.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "With all going on in almost every sector,  is it investing or gambling?", "score": 1, "replies": []}, {"body": "The majority of the gains happen during just a few trading days per year. If you are out of the market during those days, you will miss them. This is even more true if you're picking more volatile, high risk individual stocks. \n\nhttps://www.cnbc.com/2023/11/08/market-timing-doesnt-work-sp-500-14percent-rally-explained-by-just-8-days.html", "score": 1, "replies": []}, {"body": "Lot of people also lost a bunch of money in 2008. They sold and were afraid to get back in.", "score": 1, "replies": []}, {"body": "there is way too much talk of a crash happening for one to happen.", "score": 1, "replies": []}, {"body": "big bada boom incoming", "score": 1, "replies": []}, {"body": "First stop for my investment dollars is a cash/core account. I buy shares first thing each payday. The only time I have varied from this was the covid crash when I left the cash in the core account. When it looked like things were bottomed I bought back in all at once. I know that my timing wasn’t perfect but I don’t care. I made out better than if I’d continued buying into a free fall. The only times I have ever sold were for rebalances and when I moved to all-ETF’s. I’ve had a SDB 401k for the last decade or so.", "score": 1, "replies": []}, {"body": "There's should be a pullback/correction at some point as usual, and if you have some cash on the side you can jump in on the sales.  China invading Taiwan will initially drop the market but the market doesn't seem to give a shit about wars.  \n\nIt's China's market that will take the big hit should it go ahead with an invasion as they can kiss a lot of that Western manufacturing and investment goodbye.", "score": 1, "replies": []}, {"body": "Market is going to crash in the next 2 years, most likely 2024.", "score": 1, "replies": []}, {"body": "Yes, very dumb, don’t fight the easing Fed", "score": 1, "replies": []}, {"body": "Is it dumb to expect a crash/pullback/correction recession in the next 40+ years? No undoubtedly those things will happen multiple times \n\nNext year? I don’t know maybe. You don’t either keep calm and DCA on the high yield savings thing is dumb you can’t time the market. How do you know that when it crashes the bottom is current values or higher because it’s that much higher by then this is low? You don’t \n\nI think trying to invest extra in down years is great but not investing waiting for it isn’t. \n\nMy long term goal is to get to a point where I try to invest 1% more if market is down 10% YTD, 2% if 20% , 3% if 30%(and immediately max Roth for the year instead of over each month) 5% if 50%+ down. These are aspirations for me but something like that is a better idea take emotions out of it.", "score": 1, "replies": []}, {"body": "No one knows.", "score": 1, "replies": []}, {"body": "Yes, it is dumb.\n\nJust because you “feel” like a crash is coming “sooner than later” doesn’t mean anything. Your opinion has no influence on the stock market.\n\nThe fact is, the action in the market since the beginning of 2023 has been as far away from “impending crash” behavior as you can get, and that just accelerated in November.\n\nLike it or not, agree with it or not, this is a bull market. So, park your money in 5% like so many others have done, and will start to pull out and put into the stock market in 2024 as it continues to rise.\n\nI would suggest you do a careful analysis of the 2008 crash so you can understand how these things do not come out of nowhere. See if you can identify what led to the 2007 high, and how the market behaved after that high. Compare it to November 2021. Compare it to now. Which is more similar?", "score": 1, "replies": []}, {"body": "You'll learn of the high and the low after they're gone. \n\nThink about the \"big\" crashes in Mar'20 (COVID shutdown) or 9/11.  Now in hindsight we see that things came back and they were good points to get in. But WHEN THEYRE HAPPENING....there's lots of speculation as to if they're going to go down more. \"Man it's tanking!  I bet it's going to drop more!  I'm gonna wait.\"\n\nSame happens on the run up:  \"Market is doing great!  I'm holding.  It just went down a little. It'll come back.\"\n\nThis \"crash is about to happen\" market has gone up 24% this year. \n\nIf you've got money to invest invest it. If timing the market was easy there'd be more people beating index funds. They're not....even professional money managers aren't.", "score": 1, "replies": []}, {"body": "Unless you are one of the famed 10 professionals who have been able to beat the market consistently on the long term, just DCA in a mix of indexes and quality bonds.", "score": 1, "replies": []}, {"body": "I did this in 2016 when it looked like Trump might win the election. Moved it all to cash because of course he’s gonna tank the economy like it said in the Simpsons, right? If this was a good strategy wouldn’t JP Morgan be doing it?", "score": 1, "replies": []}, {"body": "Crashes are an inevitable feature of the markets.  Problem is, you'll never time them.  Plus there is a good possibility that whenever the next crash does happen, it will be to a higher amount than the current valuations.  Time in the market beats timing the market.  Just keep buying and you'll do very well.", "score": 1, "replies": []}, {"body": "I have been through 3 crashes so far. You never really know when it hits rock bottom and you are likely going to miss the major rebound.", "score": 1, "replies": []}, {"body": "crash needs bubble I don't see a bubble now.. if anyone disagree show me the bubble indicators", "score": 1, "replies": []}, {"body": "Happens a few times a year brah. Even a broken watch is accurate twice a day.", "score": 1, "replies": []}, {"body": "I think it’s a bad idea. \n\nIf you’re active in the markets, the goal should be to make money not to try and pick tops & bottoms.", "score": 1, "replies": []}, {"body": "They say you can't predict it because you can't. Also you can expect at least 4 recessions between now and 40 years from now.\n\nInvest now and let it grow.", "score": 1, "replies": []}, {"body": "Can you share the documentary? 🤔", "score": 1, "replies": []}, {"body": "Just put 75% of your weekly intended to invest dollars into the market and keep 25 fiat or in an hysa, no sense missing tomorrows gains waiting for an undetermined amount of time to get rich, fill multiple buckets getting rich isn’t black or white", "score": 1, "replies": []}, {"body": "The best way to do this is buy whenever the market PE is below the historic or avg PE. You will be waiting for a very long time. Meanwhile, you can buy individual stocks that are discounted or dividend investing also works. Another way to do it is using the buffet indicator  \n\n\nTotal US Stock Market Value = $48.41T and Annualized GDP = $27.70T\r  \nBuffett Indicator =  $48.41T/$27.70T\r  \n = 175%\n\nThis ratio fluctuates over time since the value of the stock market can be very volatile, but GDP tends to grow much more predictably. The current ratio of 175% is approximately 44.17% (or about 1.4 standard deviations) above the historical trend line, suggesting that the stock market is Overvalued relative to GDP.\n\nThe Buffett Indicator expresses the value of the US stock market in terms of the size of the US economy. If the stock market value is growing much faster than the actual economy, then it may be in a bubble.", "score": 1, "replies": []}, {"body": "The conclusion would be to do exactly opposite of what majority of comments would say.", "score": 1, "replies": []}, {"body": "There will be a crash or adjustment in your 40 years of 20% or more.   Probably 3-5 of them.  The problem is  it might not happen till the market is up 100% from here.    Timing the market is a fools game.   4 months ago the best prognosticators were expecting a 10% pull back.   We are up 12 % since then.", "score": 1, "replies": []}, {"body": "When the crash happens, everyone will say it’s going lower and fear will fill your guts when volitility is spiking. \nHow much will it dip? 15%, 25%, 50%??\nHow much downside are you willing to endure before a bounce occurs? \nNo one knows, so “just buy the dip” sounds a lot easier than it really is. \nScale in if there’s a significant correction. Never dump your whole load in all at once", "score": 1, "replies": []}, {"body": "Predicting the market is dumb. Maybe Burry did but are you him? I think not if you ask these questions.\n\nTime in the market > timing the market.", "score": 1, "replies": []}, {"body": "One big problem trying to time the market is that you need to buy when prices are falling and sell when prices are rising. \n\nNobody ever wants to do either of those things.\n\nThe other big problem, of course, is that you need to guess the time... which is nearly impossible.\n\nA portfolio properly balanced for your risk tolerance and dollar cost averaging is a far more reliable and less stressful strategy for long term gains.", "score": 1, "replies": []}, {"body": "As Warren Buffett once said, “The only value of stock forecasters is to make fortune-tellers look good.” The short-term direction of stock prices is close to random. But why? It all comes down to human psychology and the relationship between markets and volatility. Time in the market beats market timing every time. Buy the dip, and DCA on the stocks you believe in.", "score": 1, "replies": []}, {"body": "Look back the last 5+ years. So many \"experts\" said \"A crash is coming this year\" and it hasn't.... Meanwhile the stock market keeps hitting higher highs. \nDon't try to time the market, it's basically impossible, so you pretty much have to be lucky....twice! Once when you \"sell high\" and then again when you \"buy low\".    \n\nYou're better off just investing the same amount every week, months, whatever you can, and keep buying. If the market goes down, great! Stocks are on sale, so when you buy, you'll get more shares.", "score": 1, "replies": []}, {"body": "Have you guys already seen this project? it looks like a very good way to the moon! peppipig.top\nPepa To the moon guys !!!!!!", "score": 1, "replies": []}, {"body": "Or just always have 10-20% of your portfolio in CASH", "score": 1, "replies": []}, {"body": "Wait a few years and buy when it crashes to today's levels", "score": 1, "replies": []}, {"body": "If you have 40 years, just invest consistently. I would just buy indexes. \nThe so-called experts said there was going to be a crash or soft landing. All wrong, the market is at its highest level ever. Taking some money off the table. Using stop losses all can make sense.", "score": 1, "replies": []}, {"body": "Most are giving the typical response of a low probability of timing the bottom. The way I see it, it's less about being able to time a top or bottom. That's obvious. The theory behind investing through a crash is about buying stocks when they're more likely to be valued less than future projections. So, buying at the bottom matters less than buying at a price that is less than it will be in the future. For example, if the price of XYZ goes from 90 to 50, you buy at 50, it continues to fall to 20 before climbing back to 70, that's still better than buying at 90. However, the bigger problem IMO is not knowing when the crash will happen. I get 40+ years to retirement is a long time, but there is no guarantee the crash you're looking for won't take 39 years to realize. In that time you could've taken advantage of time in the market versus timing the market, learning how to hedge and making money along the way so you have more to invest with when the inevitable crash comes around. Even if you lose money before the crash comes, you have the lessons from the experience versus sitting on the sidelines waiting for \"perfect\" (rare) market conditions.", "score": 1, "replies": []}, {"body": "It sounds easy but declaring the bottom is incredibly hard to do. What is the \"bottom\" anyway? A 20% decline, 50% or more?\n\nSeeing as your investment horizon is 40 yrs the chances are that any crash along the way would have recovered by the time you look to sell.\n\nA strategy you can employ is to DCA into a declining market to ride the wave down, but again it's pretty hard to tell what is a significant move downwards.", "score": 1, "replies": []}, {"body": "You can't time the markets, there's a reason why peer review academic research just says to dollar cost average. Everyone thinks they can make bank at a casino...Some people do, most won't...", "score": 1, "replies": []}, {"body": "1st yes there will be a recession between now and when you retire\n\nShould you hold it in an HYSA? Not nessecarilly because you dont know or have a time frame on when you think the crash will come if you think the crash will come this year hold it in cash, if you think this year will be fine hold it in the market and cash out next year or start dollar cost averaging out of the market\n\nAn alternative you could do is GIC laddering for a bit if you can maybe do 1 every month for a year\n\nOf course we want to buy low sell high however it's hard to know where the top is that's why they say just stay in the market", "score": 1, "replies": []}, {"body": "When the fed is jacking around in the market nothing will ever make sense.  We should have had a massive crash and long recovery because of covid.  Nope, start the money printing and away we goooo.....", "score": 1, "replies": []}, {"body": "you can't expect anything, including the idea of countinued out perfornace by US equities over the longer term.", "score": 1, "replies": []}, {"body": "I think there’s better ways of getting a return on your investment than waiting for a 2008 style crash. \n\nWasn’t the S&P down 20% in 2022. I bet there were plenty of ppl holding out for it to go lower and lower and never end up buying and just miss out on the eventual gains", "score": 1, "replies": []}, {"body": "But you’ll need patience", "score": 1, "replies": []}, {"body": "People have been fearing a crash since the first day of the stock market. Sometimes they will be right, most of the time... not. \n\nIf you are worried about a crash and losing your money, I'd stay away from stocks", "score": 1, "replies": []}, {"body": "Yea", "score": 1, "replies": []}, {"body": "I inadvertently did this during Covid. I had rolled over a 401k and IRA back in 2015 and completely forgotten about it. It was roughly $50k, it sat there in the account not doing anything, my return graph was a flatline for 5years. When the Covid crash happened, I immediately went in and started DCAing the cash into what I thought were quality stocks (SPY GOOGL AAPL TSLA META AMZN and then had a few growth names in there also AMD NVDA TSMC). \n\nEven though my returns were flat from 2015 to 2020 because I was all cash, my net total returns are now beating the S&P over a 15 year period (so beating it since 2012ish - this includes dividend repayments).  So I actually came out ahead but Covid and the market that followed were such weird times I don’t know that you could repeat that during another crash.", "score": 1, "replies": []}, {"body": "Mix it up. Cash in a 5.3% cd short term, cash in a high interest savings acct 4-5% with full liquidity and cash invested in the market in great companies that over perform", "score": 1, "replies": []}, {"body": "A better way to approach is DCA and when a crash happens deploy more money to invest.", "score": 1, "replies": []}, {"body": "I made 13% this year. While you're making 0% - inflation, I'll be making money while I sleep with my investments in SPY, DIA, QQQ, etc. I'm also a long way from retirement, but now's the time to start the compounding machine. If you're going to not invest, at least put it in treasuries or something that will get you more than inflation.", "score": 1, "replies": []}, {"body": "Start shorting with the first rate cuts.", "score": 1, "replies": []}, {"body": "Things could go up another 20%, making it 40%. Then crash 30%. You’d still be down.\n\nStop timing the marking. DCA til you die.", "score": 1, "replies": []}, {"body": "Extremely dumb, you will miss out on dividends that whole time and probably not time the bottom right\n\nIf timing the market was easy the majority of people wouldn't be terrible at it.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "A broken clock is right twice a day .\n\nStatistically, it’s bound to happen so if you can wait . Wait", "score": 1, "replies": [{"body": "What does it mean a broken clock is right twice a day?    meaning regardless of the time it can only go up or down? xD", "score": 1, "replies": []}]}, {"body": "Buffett can't do it, but you think you can?    \n\n\nJust think that one through, it will answer all your questions on this subject.", "score": 1, "replies": []}, {"body": "Just throw it all on TQQQ or SQQQ depending if you think it’s going to go up or down", "score": 1, "replies": []}]}
{"title": "Motley Fool predictions for 2023", "selftext": "1. We'll still be in a bear market by year's end\n2. The U.S. will fall into a recession in 2023\n3. The interest rate yield curve will reverse its inversion during the second-half of the year\n4. The U.S. inflation rate ends the year far below expectations\n5. Healthcare will be the top-performing sector in 2023\n6. Gold-mining stocks will be among the best-performing industries\n7. Energy stocks will struggle following a strong year\n8. Apple will fall below $100\n9. Toyota will close out 2023 as the world's largest automaker by market cap\n10. China stocks will vastly outperform U.S. stocks\n\nhttps://www.fool.com/investing/2023/01/08/12-stock-market-predictions-for-2023/", "id": "18q8ifm", "created_utc": 1703467482.0, "score": 667, "upvote_ratio": 0.88, "num_comments": 239, "comments": [{"body": "the only fool is the one who follows their predictions.", "score": 555, "replies": [{"body": "can anyone please post their 2024 predictions so that we know what will not happen? Thanks.", "score": 33, "replies": [{"body": "The same guy who wrote in the link given by the OP has just published it for 2024\n\nhttps://www.fool.com/investing/2024/01/01/10-stock-market-predictions-for-2024/", "score": 5, "replies": [{"body": "Great, thanks :)", "score": 2, "replies": []}]}]}, {"body": "Don’t get fooled by the fool!!!", "score": 60, "replies": [{"body": "[removed]", "score": 91, "replies": [{"body": "I didn't vote for Bush and until quite recently I was always a Democrat and voted primarily Democrat, and was not a Bush fan. Now I honestly would vote for him if he was running. Funny how you think things cannot get worse politically and then we get Trump and Biden. I'm so disgusted with American politics I changed my party affiliation to independent. This country needs an enema.", "score": 3, "replies": []}, {"body": "[removed]", "score": 9, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "I would wager there are tens and tens of millions of people out there that are intelligent but not would not be good at being president of the US.\n\nThose are not mutually exclusive things.", "score": 11, "replies": []}, {"body": "> He fucked the economy and managed to engage the US in an endless war\n\n...this was Biden printing $13 TRILLION in handouts while triggering the Ukraine and Israel conflicts...", "score": -4, "replies": [{"body": "What handouts were those, exactly?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "Obviously paid troll account is obvious. Go home to India and beg your Russian Lords for TP money..", "score": 2, "replies": []}]}, {"body": "I think Dickhead Cheney was the one who sparked the idea of invading Iraq and Dubya just rolled with it.", "score": 1, "replies": []}]}]}, {"body": "He suddenly remembered in the middle of the story to not make soundbites that are embarrassing. He was avoiding the phrase \"shame on me\" because he didn't want it used out of context.", "score": 1, "replies": []}]}]}]}, {"body": "As someone who bought their yearly subscription, then followed their tips and is now deep in red, I concur. Lesson learned.", "score": 18, "replies": [{"body": "Fool is in the name", "score": 3, "replies": []}, {"body": "Is it that bad?", "score": 2, "replies": [{"body": "Yes.\n\nI can’t check my portfolio for exact numbers now, but LMND is something like 90 % down, PAYC is about 60 % down, APPN, UPST and FVRR are about 80 % down, OKTA is down too. There are few more examples that I can’t recall. There are also few picks that are performing well but not enough to outweight the losses.\n\nI genuinely regret following their advice and paying for it.", "score": 4, "replies": [{"body": "Wow, did you find a better service, subscription or you do on your own?", "score": 2, "replies": [{"body": "I do it on my own. I just buy stocks of companies that I like, or ETFs. And my own picks do quite well.", "score": 1, "replies": []}]}]}]}]}, {"body": "Fool me once..", "score": 7, "replies": []}, {"body": "Correction:\n\nThe only fool is the one who follows predictions.", "score": 10, "replies": [{"body": "If you've seen their predictions, say 10 years ago, and where there at now, you would be saying something completely different. Most of their recommendations actually do quite well.", "score": 1, "replies": []}]}, {"body": "Would be curious to see how their 2023 predictions stacked up to /r/stocks consensus picks in December 2022", "score": 7, "replies": []}, {"body": "And paying for it", "score": 3, "replies": []}, {"body": "its in the name 🤣", "score": 6, "replies": []}, {"body": "I mean yeah, we all can make up stuff too.", "score": 2, "replies": []}, {"body": "OTOH, TMFC trounced VOO this year...", "score": 2, "replies": []}, {"body": "I bet they have also predicted the exact opposite.", "score": 2, "replies": []}, {"body": "So very simple. They have picks going back to 2005. If you see where these picks are today, you'll see they actually do pretty well. Most of their recommendations would have made you quite wealthy bud.", "score": 0, "replies": []}, {"body": "$20k loss later.", "score": 1, "replies": []}]}, {"body": "0 of 10?  I’m not even mad. I’m impressed.", "score": 440, "replies": [{"body": "They can only go up from here", "score": 56, "replies": []}, {"body": "1. Wrong.\n\n2. Wrong.\n\n3. Wrong.\n\n4. Kinda. U.S. inflation is below expectations but not *\"far below\".*\n\n5. Wrong. Health care sector returned around 1% in 2023, among the worst of all sectors.\n\n6. Kinda. Idk about *\"best performing\"* but an average return of 7% for the industry ETF is not awful.\n\n7. Correct! The energy sector remained stagnant this year.\n\n8. Wrong. Almost hit $200 lol.\n\n9. Wrong but close. Toyota is the 2nd largest automaker by market cap.\n\n10. Wrong. Very wrong.\n\nI'll give them a 2/10 just because some of those were truly horrible.", "score": 84, "replies": [{"body": "9 was implicitly between Tesla and Toyota. Toyota being 2nd but having a huge gap in market cap between them and Tesla makes it not close imo.", "score": 26, "replies": []}, {"body": "> Wrong. Almost hit $200 lol.\n\nThere is still a few trading days left, Apple could still fall below $100! /s because I know someone is going to take me seriously.", "score": 14, "replies": [{"body": "Jim Cramer needs to predict Apple at 300 before year end…that will drive the price below 100", "score": 3, "replies": []}]}, {"body": "> I'll give them a 2/10\n\nIf they can improve their results by just 250%, they'll be 50% correct!", "score": 10, "replies": []}, {"body": "1, 3, 4, 6, 7, 8 are varying degrees of true", "score": -5, "replies": [{"body": "How is 8 to any degree true?", "score": 3, "replies": [{"body": "It fell from $150 to $124 first.", "score": -2, "replies": [{"body": "Agreed but that’s still a long way from 100", "score": 2, "replies": [{"body": "If only my wording was clear.  Oh wait it was.", "score": -2, "replies": [{"body": "Not true in any sense. 0 degrees. Go read a dictionary", "score": 1, "replies": []}, {"body": "So they started the year at about 130 ended at 190 ish .    But They predict going from 130 to 100 or lower .  Or was it 150 to 100.  Regardless they couldn’t even get the direction right little lone the price .", "score": 1, "replies": []}]}]}]}]}, {"body": "When did Apple dip below $100?", "score": 1, "replies": [{"body": "Pretending you're not trolling and simply never learned what \"varying degrees of\" means, when those bearish calls were being made, AAPL was falling from around 150 to its 52 week low of $124.  It did not cross below $100 that time, but the direction and momentum were decidedly downward.", "score": 1, "replies": []}]}]}]}, {"body": "Time for a reverse Motley Fool Mutual Fund?", "score": 16, "replies": [{"body": "If you need more predictions in it you could also add Cramer .  The reverse Cramer- Fool etf.", "score": 1, "replies": []}]}, {"body": "They were close on inflation rate number 4", "score": 23, "replies": []}, {"body": "Yeah exactly! Even if they made up some of those they would still get at least 50% correct. Because if you flipped a coin 100 times, 50 times would be heads and the other 50 would be close to tails.\n\nThe only way to be 100% wrong is to know which answers are right. The funny thing about the Motley Fool is that they have both bearish and bullish journalists, yet they still got it 100% wrong. Inverse the fake news and you win", "score": 39, "replies": [{"body": "We should look at their 2022 and 2021 records.", "score": 7, "replies": []}, {"body": "If you make claims that are very unlikely you will get less than 50% correct though.\n\nTheir claims were less than 50% odds of happening however you can't really inverse it either.\n\nE.g. someone might make a claim that Microsoft goes bankrupt next year. How would you exactly inverse the claim? Sell massive amount of puts?", "score": 2, "replies": []}]}, {"body": "Were they wrong about inflation or energy stocks? I'd put them at 2/10", "score": 20, "replies": []}, {"body": "Haha prediction for 2024.\n\nMotely Fool want to get rid of their Bags as Bag holders.", "score": 3, "replies": []}, {"body": "Eh, they kinda got the inflation one correct.", "score": 1, "replies": []}]}, {"body": "My dad has a subscription - I look at their Rule Breakers and Stock Advisor and most of the time I already have positions. My favorite is when they predicted the new insurance AI Lemonade in their portfolio when it was like 140 a share three years ago. I’m an insurance broker but I thought that was way overpriced. My dad said I should maybe take a position …I passed on it.  Currently it is $17 a share and has done nothing and I’m still passing on it", "score": 244, "replies": [{"body": "I had stock advisor when they recommended Lemonade. Thought about it but passed. Thank God", "score": 57, "replies": []}, {"body": "I am an actuary and I stopped considering any of their recommendations when they advised to buy Lemonade stock, which was/is fueled only on hype.", "score": 20, "replies": []}, {"body": "MF is such a scam.  I remember them pumping Lemonade back then, bunch of crap.  Their three locks for that year were Fiverr (then at $235), Upstart ($100 or so I think) and OpenDoor (then at  50(?)… anyway under their 3-5 year buy and hold theory you would now have about 1/10 of your original investment that year and they probably made bank shorting and long puts.  F ing scammers, I wish the SEC would investigate them.", "score": 47, "replies": [{"body": "How do we get an Inverse MF ETF going like Inverse Cramer?", "score": 8, "replies": [{"body": "Seriously, that would be worth the 260 or whatever MF costs.  I bet you could get 1000 / $50 per year subscribers without much troublr", "score": 2, "replies": []}]}]}, {"body": "A while back stock advisor had Vroom on there as a top pick when it was close to $50.  It's now 73 cents 😂.", "score": 26, "replies": [{"body": "Oh my….", "score": 6, "replies": []}, {"body": "Could it be that Vroom could be an opportunity for at least a 10x at the current price?", "score": -5, "replies": [{"body": "There's like a 99% chance it goes to zero, and like a 1% chance it goes to 10x. I really hope there's no one seriously considering owning this stock.", "score": 5, "replies": []}]}]}, {"body": "Short it", "score": 12, "replies": []}, {"body": "I had SA and bought lemonade. I am no a motley fool subscriber. (They recommended many other dogshit brands - they really loved DocuSign for example).", "score": 7, "replies": []}, {"body": "Lemonade is known as very bad insurance that rejects a lot of claims. There’s no going back from that reputation .", "score": 1, "replies": []}, {"body": "I know right? They suggested I buy Amazon in 2001, Netflix in 2003 and Nvidia in 2017.  What morons.", "score": -7, "replies": [{"body": "A broken clock is right twice a day", "score": 8, "replies": [{"body": "I bought a ski house on one of their picks and still hold a few ten baggers. Also several that have done better than the S&P 500 over 5 years. But sure. Tell me how shitty they are. It will get you lots of upvotes.", "score": -3, "replies": [{"body": "Which?", "score": 3, "replies": []}]}]}]}, {"body": "I remember.", "score": 1, "replies": []}, {"body": "you can find 200 if not more stocks that are 10x down from their ATHs, good companies. I'm not defending Montley Fool at all, nor am i a Lemonade holder, but this one random example is silly.", "score": 1, "replies": []}]}, {"body": "I like their podcasts but their clickbait article-mill is pretty cringe.", "score": 409, "replies": [{"body": "Same here. I listen to their podcast every day but I feel their “stock advisor” is kinda trashy, in fact, every other “stock advisors” are like the same.", "score": 41, "replies": [{"body": "Just short what they recommend", "score": 26, "replies": [{"body": "This one gets it!!", "score": 1, "replies": []}, {"body": "This guy shorts...", "score": 1, "replies": []}, {"body": "I mean, they did recommend Nivida in 05, and I made 600k off that lol so I'm kinda biased. I can give several recommendations that have made me money. I have lost money too, but I've made way way more than I've lost. I mostly put in 1-2k on their picks. I also make sure to do my own research.", "score": 1, "replies": []}]}]}, {"body": "I asked an employee I met of theirs if their stories were written by AI a few years ago. She laughed and said no but she could see how I thought that as the clickbait incentive pretty much forced people to write a certain way.", "score": 17, "replies": []}, {"body": "I miss their Industry Focus podcast. Everyday of the week covered a different sector. Felt like they covered topics better with that, their \"new\" set up is okay, but it just feels broad and that they cover the same few stocks every time.", "score": 8, "replies": []}, {"body": "This is a pretty common sentiment on reddit but I don't get it, the podcasts are trash they barely talk about investing and often talk about random stuff like movies and always just end up mentioning the same stocks. Also the podcasts are just as dumb as the articles they were shilling Luckin' Coffee for years saying how it was the next Starbucks then when it went to shit they acted like they were always cautious about Chinese stocks.", "score": 24, "replies": []}, {"body": "whats the podcast called? any other investing podcasts you'd recommend?", "score": 1, "replies": [{"body": "I like investtalk a lot. Those guys are less story oriented than the fool, and more into technicals. They rarely give straight up recommendations, but they take lots of caller questions, and so certain stocks they lightly endorse based on valuation/ Technical Analysis", "score": 4, "replies": [{"body": "You don't have an edge in the market without insider information.", "score": 4, "replies": []}]}, {"body": "I like the Motley Fool Money podcast. yes they talk about stocks they like that don't always pan out but at least in the podcast \"discussion\" format you get a little more perspective than the endless articles designed to get in front of you depending on the stocks in your search history", "score": 3, "replies": []}, {"body": "Following", "score": 0, "replies": []}]}, {"body": "Ok, so who will lose your money faster… Fool or Cramer?", "score": 1, "replies": []}]}, {"body": "When you have to sell your stock advice to make money you're not very good at picking stocks.", "score": 111, "replies": []}, {"body": "Did they intentionally try to outdo Cramer?", "score": 47, "replies": []}, {"body": "I had a MF subscription about 15 years ago. I have to give them a lot of credit for being able to retire early. I used their Stock Advisor (SA)service as a starting point for recs. I still did my own due diligence but SA got me into Netflix at $34, Goog, MA, etc. Cintas is up 2500% since I bought it in 2009. They had lots of big winners back then. \n\nBecause I really didn't have a ton of free money to buy stocks after my initial foray into SA I just put my money into mutual funds and quit the SA subscription.  Fast forward 10 years or so to 2019 and I was bored during the covid shutdown and got a $49 offer for SA and thought why not, it'll be something to do. Well I still didn't have a lot of free money as I was happy with what I had but I bought very small positions in a few of their new recs with the idea of holding 5 years as they say. Whew! What a shitshow. I lost my whole stake on SVB bankruptcy, I'm down 70% on Fiver and Zoom. Only CRWD has made a profit so far. \n\nNow I know I bought many of these at a high point and am going to wait the 5 years to see what happens, but talk about a bad start. Anyway, that's my Motley Fool story. I owe them a lot, but wouldn't subscribe again.", "score": 19, "replies": [{"body": "Paycom, Axon, PayPal, crowdstrike, worked really well for me. These services are just a starting point for interesting stocks. They are not a replacement for your own due diligence and research.", "score": 5, "replies": [{"body": "I bought CRWD on their recommendation last March, and now thinking it might be a \"sell in May\" (or March) deal.  They recommended TTD but I passed until it took a big dip about a month ago on some bad news.  Most of the rest of it was either a business I couldn't believe in (e.g. ZOOM, Roblox) or too pricey for the likely gains.  When it's already at an all-time high, and there's no net profits, then you gotta figure the hype is a trick.\n\nThe Barron's 10 stocks for 2024 has some good names on it for growth ... but it might be time to take those CRWD gains and put them in an electric utility?  What do you think?", "score": 1, "replies": [{"body": "I like CRWD for the longer term but I’m long term kinda guy. MF used to have interesting ideas about 10 years ago. I bought my positions around 25 to 30 bucks a share and have held on for a long time. More recently they just seem to recycle the same stocks over and over. I no longer have a subscription. I follow Barron’s as well and recently picked up AZN, Shopify, Uber on recent dips. I like your idea of Electric utilities.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 42, "replies": [{"body": "honestly bro, i just really like your name.", "score": 6, "replies": []}, {"body": "Matthew McConuaghey’s character in Wolf Of Wall Street said it best: “Nobody knows what the fuck a stock is gonna do. Least of all stockbrokers.”", "score": 3, "replies": []}, {"body": "“Don’t know shit about fuck” incredible", "score": 2, "replies": []}]}, {"body": "How this outfit survived the dot-com crash and made it this far is beyond me...", "score": 55, "replies": [{"body": "They are always funded by mayo.", "score": 3, "replies": []}]}, {"body": "Basically, they thought 2023 would just be like 2022.", "score": 28, "replies": []}, {"body": "I will buy apple jan 1 and every month until its 100 and every month after its 100", "score": 33, "replies": []}, {"body": "Is tech the best performing sector for the year? Who would've guessed?", "score": 10, "replies": []}, {"body": "This isn’t the motley fool leadership, or either Gardner brother. This is some guy named Sean Williams. It’s just one guys ideas.", "score": 23, "replies": [{"body": "Motley isn't fool enough to make validatable time bound prediction.", "score": 0, "replies": []}, {"body": "The Gardners already made it in life. Idk if they care about the Motley Fool’s reputation now", "score": 1, "replies": []}]}, {"body": "Ha china", "score": 8, "replies": []}, {"body": "Worked there many moons ago. The free side has an incentive to make bold predictions for clicks as they get paid for conversions. To be fair to TMF, this is one author’s opinion and (worked with him): Sean was widely considered the most click-baity writer (can’t call him an analyst if you look at his formulaic articles). \n\nBut there are good free-side writers like Jason Hall, Tyler Crowe, Brian Feroldi, etc. that try to inform and analyze stocks. Sadly, these writers often don’t get the same traffic as Sean because they write about “getting rich slowly” and in “less sexy” (Jason and Tyler are top-notch in infrastructure/yieldcos) areas where Sean just pumps out “THIS STOCK IS UNDERVALUED BY 1000%.” \n\nThe pay-for side used to be really good but has really had a rough go after the pandemic skewed high-beta tech names and David Gardner transitioned away from picking stocks. They got a lot of new subs during the pandemic and were recommending every WFH stock and, rightfully, are now dealing with that fall-out. \n\nThe service is trying to adjust from a world when they predicted/rode FAANG/M7 stocks before they caught on broadly to a world where everybody is like, “duh.” Many of the good free-side analysts are trying to branch out and do their own thing by analyzing on YouTube. I still read for trend-spotting purposes, but the delta between when they find a name and when the world discovers it has went from years to often days now and/or they’re often with the masses trying to find the next big thing.", "score": 6, "replies": [{"body": "Thanks for the insight. What REALLY bothers me is that these types of articles cost people their livelihoods. Think of how many people sold their Apple stock based on this article.\n\nI have always had strong feelings about articles that call out a particular stock. There needs to be more regulation around that practice, again because it can cost naive investors a lot of money. \n\nI talk from experience as someone who started investing in 1998, let these articles influence me in my younger years and lost everything. Yes, I’ve since recovered, but I try to help others avoid my mistakes.", "score": 1, "replies": [{"body": ">>>Thanks for the insight. What REALLY bothers me is that these types of articles cost people their livelihoods. Think of how many people sold their Apple stock based on this article.\n\nI have mixed feelings here. On one hand, I feel the SEC has been too lenient on “financial advice” as bad advice has proliferated online, especially on social media. I also think most rational people should know these are essentially bloggers and vloggers. Even people on TV are wrong – it’s the clients that should be educated rather than limiting who can speak imo. \n\n>>>I have always had strong feelings about articles that call out a particular stock. There needs to be more regulation around that practice, again because it can cost naive investors a lot of money.\n\nI get this and, as noted above, kind of agree. At TMF there used to me “mea culpa” articles for calls authors didn’t get right – bet you can tell how they performed. I do like people like I noted above that actually own the stocks they write about and cover new developments. The particular author that wrote OP’s piece doesn’t do that and tends to be rewarded handsomely. \n\n>>>I talk from experience as someone who started investing in 1998, let these articles influence me in my younger years and lost everything. Yes, I’ve since recovered, but I try to help others avoid my mistakes.\n\nGlad to hear it! Sorry you lost everything, but even if you got wrecked in tech and had a diversified portfolio (even within tech) and kept investing, you’re likely 2x better than the person that never invested. Not saying you’re wrong re: online stock “advice,” just that it’s a complex topic.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "🤝", "score": 1, "replies": []}]}]}]}]}, {"body": "I used to read them 15-20 years ago. Ended up buying Netflix, NXP, AMT, SHOP before they blew up thanks to their advice. Recently the quality has gone way down and I think the last thing I saw them pitch was Lemonade.", "score": 28, "replies": [{"body": "They also pitched UPST when it was $400 , and Farfetch (FTCH) and stitchfix (SFIX) at their peak. The list of losers is very very long.", "score": 12, "replies": [{"body": "Not denying that. They really used to be good is my point.", "score": 12, "replies": [{"body": "Or they happened to be lucky.", "score": 3, "replies": []}]}, {"body": "Now they are pumping Palantir", "score": 3, "replies": []}, {"body": "survivor bias.\n\nMore people on this site should be aware of it.", "score": 1, "replies": []}]}, {"body": "When you’re right you look like a genius, when you’re wrong you look like a fool 🤷‍♂️", "score": 2, "replies": []}, {"body": "I’m pretty sure that is correct", "score": 1, "replies": []}]}, {"body": "Don't forget there are 4 trading days left. Aren't we getting ahead of ourselves? \n\nMotley Fool is beyond trash.", "score": 6, "replies": []}, {"body": "I'm suprised there can even be a list since they seem to put out numerous articles that directly contradict each other", "score": 6, "replies": [{"body": "That’s basically by design. They previously specified that anyone who is not an internal employee (not a contributor submitting content) is essentially submitting their own opinions. \n\nI haven’t looked in a long time so it may have changed, but they used to say in their TOS that only certain staff (founders or something) should be considered actually speaking on behalf of the company. It’s been since the 00s that I even went to their site but I remember reading something to that effect like 20 years ago.", "score": 3, "replies": []}]}, {"body": "They r worst. My portofilo was in red for 6 years due to their services. Whtever they say, it happens opposite. \n\nThey r cramer of providing news.", "score": 3, "replies": []}, {"body": "I have had really bad luck following Mötley fools recommendations", "score": 4, "replies": []}, {"body": "Literally used some motley fool stock picks when I first started investing and they’re the only stocks I have done poorly on….", "score": 6, "replies": []}, {"body": "Apple below $100? Hahahahaha", "score": 10, "replies": [{"body": "There was some non-crazy analysis back when AAPL was bouncing along $125-130 which noted their continuing string of quarters with no growth, lack of innovation since Jobs' death, no compelling reason for people to rebuy their current phones, supply constraints possibly capping off their sales, their market in China drying up while their manufacturing costs there were rising, the lengthening of refresh cycles, etc.\n\nAt the time, when some pundits were saying it could move from $125 towards $100 instead of $125 to $200, it did have some basis and wasn't entirely crazy.", "score": 2, "replies": []}]}, {"body": "They recommended NVDA three years ago along with ASML in a package I bought. NVDA blew up big time!", "score": 13, "replies": [{"body": "They recommend 500 stocks in a year. Something is bound to blow up", "score": 39, "replies": [{"body": "This .....This is their way !", "score": 3, "replies": []}, {"body": "Exactly. You could have thrown darts at a dart board of the tech industry and landed on a bunch of winners.", "score": 1, "replies": []}]}, {"body": "Even a broken clock is right twice a day", "score": 1, "replies": []}]}, {"body": "Didn’t they predict that 2023 would end with a lower fed rate than when it started?", "score": 3, "replies": []}, {"body": "2/10 (they were right about energy stocks and inflation)\n\nNot bad, not bad at all /s", "score": 3, "replies": [{"body": "Even a broken clock is right twice a day", "score": 1, "replies": []}]}, {"body": "Tbh the Toyota bet might be legit", "score": 3, "replies": []}, {"body": "Predicting is speculating. Maybe some will happen maybe some won't. All we can do is invest in good companies at good prices.", "score": 3, "replies": []}, {"body": "Years ago MF recommended and I bought Apple, Amazon, Costco, Starbucks, United Healthcare, Microsoft, Facebook, Berkshire Hathaway, Nvidia and others…. my portfolio is in damn fine shape. Yes there were a few dogs like 3 D Systems but overall I have made a ton of $. Do your own research and don’t just buy because someone said so.", "score": 3, "replies": []}, {"body": "Lost a boatload on Docusign recommendation as well.  They hit on a few stock (Amazon, Netflix, Shopify) years ago and still tout them.  Buy their hit rate really sucks.", "score": 3, "replies": []}, {"body": "I would be very surprised if China stocks vatly outperform U.S stocks. In my opinion with Xi Jinping, it will be at best flat ...", "score": 5, "replies": [{"body": "Read it again, these were the predictions in December 2022 for what 2023 would look like. The only thing they got right was energy stocks and inflation.", "score": 6, "replies": [{"body": "Oh sorry, I really miss read. Thx for telling me, it's more pathetic in this way ! 🤦‍♂️", "score": 2, "replies": []}]}, {"body": "Go long on yinn then.  It has really tanked.  Just look at last fri.... Hugh upside potential ??", "score": 1, "replies": []}]}, {"body": "They kind of nailed #4 that inflation would be tamed", "score": 2, "replies": [{"body": "Sort of. It really was a recession tames inflation as opposed to a soft landing takes inflation. Two vastly different scenarios.", "score": 0, "replies": []}]}, {"body": "Lol they are pumping palantir stock.", "score": 2, "replies": []}, {"body": "Wow 0/10 nice", "score": 2, "replies": []}, {"body": "One thing I've learnt is to ignore what the motley fool crew say. Thinking of all their pandemic recommendations which turned out bad. A very painful lesson.", "score": 2, "replies": []}, {"body": "The motley fool is no better or worse than this sub for stock advice. Read into that what you will", "score": 2, "replies": []}, {"body": "Number 10 really made me laugh, paid by fools more like.", "score": 2, "replies": []}, {"body": "Thank you for posting this. This is an excellent lesson for anybody who thinks predictions about the future have any value.", "score": 2, "replies": []}, {"body": "Sounds like all the predictions of r/stocks in 2023", "score": 2, "replies": []}, {"body": "Throw a dart…", "score": 2, "replies": []}, {"body": "So…. Whatever MF recommends do the opposite…?", "score": 2, "replies": []}, {"body": "Well good thing it’s about to be 2024 and they were completely wrong.", "score": 2, "replies": []}, {"body": "To be honest that name should have given it away.", "score": 2, "replies": []}, {"body": "MF is for idiots. They named it that way for a reason.", "score": 2, "replies": []}, {"body": "Apple will fall below $100 😂", "score": 2, "replies": []}, {"body": "“china stocks will vastly outperform U.S stocks”\n\nthis is almost funny", "score": 2, "replies": []}, {"body": "All these predictions that were made last year are pretty cringe worth and interesting", "score": 3, "replies": []}, {"body": "Montley’s masters are short Apple 🤣🤣", "score": 2, "replies": []}, {"body": "Apple under $100… are they dumb? wtf", "score": 2, "replies": []}, {"body": "Step 1: wait for their 2024 prediction\n\nStep 2: invest except opposite of their prediction. \n\nStep 3: profit!", "score": 2, "replies": []}, {"body": "> Apple will fall below $100\n\nI do not believe it. Well as long as there is not a split.\n\nI expect 2024 to be a HUGE year for the big guys.  With Alphabet leading the way.", "score": 2, "replies": []}, {"body": "These guys are fools.", "score": 3, "replies": []}, {"body": "Motley Fool is a flood of horrid shit.", "score": 1, "replies": []}, {"body": "To be fair, they weren’t unique to these predictions. Every major bank and analyst was expecting a recession in 2023.", "score": 1, "replies": []}, {"body": "I pity “The Fool”!!!", "score": 1, "replies": []}, {"body": "Although they make it sound as if they have a great and large team of analysts, their marketing/clickbait newsletters and ads stayed the same! ChatGPT will do better using historical information. I doubt that their team is more than one person using cheap freelancers.", "score": 0, "replies": []}, {"body": "They are a fool", "score": 0, "replies": []}, {"body": "Those guys are good on selling your email and data. Not this", "score": 0, "replies": []}, {"body": "How is this even a post?", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I too despise MF.  But in fairness, AAPL also went from $185 to $129", "score": 1, "replies": []}]}]}, {"body": "I'm not a great investor, but somehow after reading two of their articles, I knew they were complete garbage.", "score": -1, "replies": []}, {"body": "Motley fool is owned by Citadel Securities. You’re a sucker if you follow their advice", "score": -1, "replies": []}, {"body": "LMAO @ MF", "score": -5, "replies": []}, {"body": "Keep this in mind when listening to 2024 predictions from anyone", "score": 1, "replies": []}, {"body": "They are click bait, and have been for some time, but to be fair many legitimate organizations agreed with a handful of these.", "score": 1, "replies": []}, {"body": "It's wild to me that people pay for Motley Fool.", "score": 1, "replies": []}, {"body": "It's just like sports. The people that know the most still always get it wrong and there are no consequences", "score": 1, "replies": []}, {"body": "I didn't hear no bell\n\nThe year isn't over", "score": 1, "replies": []}, {"body": "With QE its really hard to predict anything. I listen to alot of proff Hanke. He has some solid justified views granted he has been through this situation many times over", "score": 1, "replies": []}, {"body": "Bear market????", "score": 1, "replies": []}, {"body": "Lenovo up 59% YTD...", "score": 1, "replies": []}, {"body": "Are we not aware that Citadel owns Motley Fools and uses it to pump and dump stocks??", "score": 1, "replies": []}, {"body": "0/10 on their prediction and still in business...unbelievable.", "score": 1, "replies": []}, {"body": "Well they were completely wrong on the recession…. And that throws almost all their other predictions out the window doesn’t it?", "score": 1, "replies": []}, {"body": "Inverse Motley Fool, got it.", "score": 1, "replies": []}, {"body": "Mootley is nothing but rich dad poor dads know it all gurus", "score": 1, "replies": []}, {"body": "“Still be in a bear market” implies we are in one now… and we aren’t", "score": 1, "replies": []}, {"body": "Fool me once, shame on you. Call yourself a fool, behave like one and fool me, shame on me for being so dumb", "score": 1, "replies": []}, {"body": "Hahaha. Came here to say all the things that everyone is saying ready. \nMotley fool. Fuckwits fool", "score": 1, "replies": []}, {"body": "To paraphrase a legend: If you want to lose your money, be a fool and listen to the Motley Fool.\n\nDid they even get one right?", "score": 1, "replies": []}, {"body": "#7 was right, but that’s about it", "score": 1, "replies": []}, {"body": "Anyone tested for an inverse Motley Fool?", "score": 1, "replies": []}, {"body": "Kramer: pick these\n\nUs: these are the WORST!\n\nFool: hold my beer", "score": 1, "replies": []}, {"body": "Even a broken clock is right twice a day.", "score": 1, "replies": []}, {"body": "Shorting aapl lmao", "score": 1, "replies": []}, {"body": "Inverse ETF in the makings", "score": 1, "replies": []}, {"body": "Seeking Apha generates all the alpha. \n\nMotley Fool makes all of us fools.", "score": 1, "replies": []}, {"body": "I refuse to give them credit for 4 because it is too vague. The rate went from 9.1% to 3.14%. Fed said they would be aggressive to get the number down and the target was 2%, not 3.1%. If anything, the rate is higher than I expected after 12 months.\n\nIt would be need <2% for me to give them that one.", "score": 1, "replies": []}, {"body": "“Apple will fall below $100” meanwhile its approaching $200 a share🤣 never sell", "score": 1, "replies": []}, {"body": "Also it seams like for every pick they are trying to sell you on another service", "score": 1, "replies": []}, {"body": "If Apple falls under $100, I'm loading up...", "score": 1, "replies": []}, {"body": "So basically inverse MF for gains?", "score": 1, "replies": []}, {"body": "As usual MF is as reliable as a coin toss. Toyota seems to be the only good bet even if they arent number one in market cap. I think the trick with MF is to do the exact opposite.", "score": 1, "replies": []}, {"body": "Motley fool is garbage, always has been a lover and always will be.  You are better off betting against their positions.", "score": 1, "replies": []}, {"body": "All this will be correct for 2024 except Apple below $100 imo", "score": 1, "replies": []}, {"body": "There's a reason they have \"Fool\" in their name.", "score": 1, "replies": []}, {"body": "Love/hate relationship with the fool. I made a killing on SHOP TTD NFLX but also lost a ton on other picks. \n\nMy gut > fool", "score": 1, "replies": []}]}
{"title": "Which Current Giants Will Stay on Top in 2052?", "selftext": "I hear a lot talk about how great google, apple, microsoft, amazon etc are at this subreddit but how many of these do you actually think will hold their top 10 title in 30 years time?\n\nAnd why do you think that?", "id": "18qji0r", "created_utc": 1703513864.0, "score": 13, "upvote_ratio": 0.55, "num_comments": 107, "comments": [{"body": "We really have no idea.\n\nWill they still be around? Highly likely.\n\nWill they be the top? Maybe 1–2 of them, but probably not.\n\nIt's possible that some of the largest companies in 2052 have not even been founded yet. Tesla is only 20 years, Amazon is 29 years, NVIDIA is 30 years, Meta is 19 years, and Alphabet (as Google) is 25 years.\n\nYou're asking what the largest companies in 30 years will be and most of today's largest companies weren't even around 30 years ago.\n\nThe only things that have a good chance at still being near the top are the big banks, pharmaceuticals, and certain brand name companies like McDonald's and Coca-Cola.", "score": 76, "replies": [{"body": "It feels like most people here belive they will still stay at top.\n\nBut 1993 top companies only 2 have retained their top 10 position.", "score": 14, "replies": [{"body": "The truth is, we don't know.\n\nIt's possible that because MSFT/AMZN/AAPL/META are in the software business (at least, in part), there are fewer limits on their ability to grow into the future.\n\nIt might be that the industry is actually different to the past top companies and that there are less limits on their ability to make new products.", "score": 16, "replies": [{"body": "It's also interesting because they \"won\" the new technology boon just like Ford \"won\" its technology boon in the 30s. Ford is no longer a top 10, but it's not like it's been completely replaced either", "score": 12, "replies": [{"body": "Yeah, even if all of the Mag-7 don't grow in its market cap for another 30 years, they'd still be considered very large companies – maybe the equivalent of a 300B company today.", "score": 6, "replies": []}]}]}]}]}, {"body": "I’d bet Microsoft over all others, due to their sheer dominance in the pc  market and business, with cloud integration.", "score": 119, "replies": [{"body": "I love Microsoft being brought up because I will never forget the 00s period where Microsoft was considered a failing giant that was loosing its dominance everywhere. 10 years can be  game changing in any company and predicting to 2050 is a crap shoot.", "score": 20, "replies": [{"body": "This. Literally impossible to guess what will even be around by then.", "score": 8, "replies": []}, {"body": "I was looking at their stock history and couldn't believe how low they were", "score": 2, "replies": []}, {"body": "Windows and the office suite is enough to keep them a top 10 forever. There is too much adoption, too much tech, too much code, too much everything that runs on windows even more so now than ever before.", "score": 3, "replies": []}]}, {"body": "And regardless of AI or other better tools that come out, people will still use outlook, excel, and PowerPoint for everything", "score": 22, "replies": [{"body": "Well.. maybe.", "score": 6, "replies": []}, {"body": "I agree with Microsoft still being a thing but I doubt any of us will use those office tools. You're thinking too small for 30 years imo. I think in 2052 the world will be almost unrecognizable with the scale technology is moving.", "score": 4, "replies": [{"body": "Bro people were using the office suite 30+ years ago and they’re going to be using it 30 years from now. There’s literally nothing that has come close to the dominance of Microsoft in that field.", "score": 0, "replies": []}]}, {"body": "That’s a 90s perspective. The only things of significance they lead in today were created 35 years ago.  They’re more likely to be the next GE, ATT, or IBM.", "score": -9, "replies": [{"body": ">The only things of significance they lead in today were created 35 years ago.\n\nMicrosoft is much more than a operating system and office apps.", "score": 11, "replies": []}, {"body": "Hot take: This guy does not know what he is talking about.", "score": 14, "replies": [{"body": "30 years in the IT business. What’s your background genius?", "score": -13, "replies": [{"body": "Argument from authority fallacy. If you tell me 2+2 is 5 because you are a mathimatician I still aint buying it....", "score": 10, "replies": [{"body": "Stick to your basement playing video games and buying crypto little boy.", "score": -25, "replies": [{"body": "Lol! Angry and ignorant. You must be swimming in bitches lol", "score": 7, "replies": []}]}]}, {"body": "Dang y’all, we got a bona fide dinosaur on our hands", "score": 4, "replies": []}]}]}, {"body": "They own OpenAI. \n\nAfter dropping the ball on social and mobile, they’re finally  well poised to be highly relevant in the next tech battle.\n\nAlthough I think OAI is going to become obsolete soon. Open source is catching up and DeepMind is a real contender for SOTA.  \n\nIf OpenAI does not maintain SOTA and open source is good enough, they’re dead", "score": 1, "replies": [{"body": "Open AI is not even open.  Musk funded a large piece of it.  I paraphrase but he referred to it as now being something like “Closed AI and at very high profit”.  Like everything else, Microsoft was not first.  They bought and paid for it.  No one else will adopt it long term with them in control.", "score": 0, "replies": [{"body": "Yeah. Of course it’s not open. It’s a Microsoft company 😂 \n\nThey created the closed version of it for the sole purpose of getting billions from Microsoft", "score": 2, "replies": []}]}]}, {"body": "RemindMe! 28 years", "score": 1, "replies": [{"body": "I will be messaging you in 28 years on [**2051-12-25 19:28:45 UTC**](http://www.wolframalpha.com/input/?i=2051-12-25%2019:28:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/18qji0r/which_current_giants_will_stay_on_top_in_2052/kew8dio/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F18qji0r%2Fwhich_current_giants_will_stay_on_top_in_2052%2Fkew8dio%2F%5D%0A%0ARemindMe%21%202051-12-25%2019%3A28%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2018qji0r)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}]}]}, {"body": "Windows os\n\nOffice\n\nOutlook\n\nXbox\n\nGames\n\nCloud\n\nServer\n\nAi\n\nHardware\n\nHuge investments in new tech\n\n\nThey are only going up the next 30 years. I don't see any company that has so much going on in every tech field. And when something new comes along, they have the money to step on the train.", "score": 9, "replies": []}, {"body": "Amazon too. Even if it fractures they have aws and a powerful logistics company", "score": 3, "replies": []}, {"body": "I second this. People have come at King Microsoft multiple times but he still reigns supreme.", "score": 3, "replies": []}]}, {"body": "your mom is a current giant who will definitely stay on top", "score": 176, "replies": [{"body": "Lmao no chill even on Christmas 💀", "score": 28, "replies": []}, {"body": "Millions of crushed pelvises everywhere OP's mom goes", "score": 19, "replies": []}, {"body": "Good stuff", "score": 2, "replies": []}, {"body": "You are completly incorrect and your facts are completely garbage.\n\nMy mom is 150cm and 45kg. And has MS so she can't literally stay on top of anything.\n\nShe's more likely a midget who will defintely stay on bottom.", "score": -38, "replies": [{"body": "Calling your mother a definite bottom is only the 4th weirdest thing I've heard this Christmas morning", "score": 23, "replies": [{"body": "Bro, you are weird if you don't know your mom's weight and measurements", "score": 4, "replies": []}]}, {"body": "Just take the L, bro.", "score": 38, "replies": []}]}]}, {"body": "Title asks which, text how many.\n\nJust One. Probably Microsoft.\n\n30 years ago there was a different top 10, only one was the same. It was Microsoft.", "score": 20, "replies": [{"body": "Yea completely agree, also think BRK.B will probably maintain its position in the top 10 by market cap because it's more a mutual fund/etf than anything, and people trust it like they trust SPY.", "score": 9, "replies": [{"body": "Yeah, interesting that BRK has joined the top 10 over the last 30 years. One could assume it would keep outpacing and rise up the ranks even without Buffett.\n\nOr it could fall.", "score": 2, "replies": []}]}, {"body": "1993 vs 2023 wasn't it just Exxon Mobil & Chevron that stayed in the top 10?\n\nAnd Exxon Mobil has been in the top 10 since atleast 1963 or even earlier.", "score": 1, "replies": [{"body": "Exxon isn't top 10 any more.", "score": 1, "replies": []}]}]}, {"body": "Its more likely none of them than all of them", "score": 54, "replies": []}, {"body": "I think Google cloud will overtake aws one day. It’s so much more pleasant to use but they need to get it a bit cheaper", "score": 16, "replies": []}, {"body": "likely none of them.  \n\nYou should get on Youtube look for\" ***Top 10 Largest Companies by Market Cap (1979-2021)***\".\n\nSurprise, surprise.", "score": 5, "replies": []}, {"body": "Just a sentiment...booze. techs are sexy but no one ever stops drinking", "score": 6, "replies": []}, {"body": "I’d say best chance is someone like nvda or amd", "score": 4, "replies": []}, {"body": "IBM... been there through 2 wars. Stil the 7th largest tech company, although no one knows what they really produce. 49th largest company, part of DOW, 300k employees.\n\nIt will be around long after all the other companies are dead.", "score": 6, "replies": []}, {"body": "Texas Instruments", "score": 9, "replies": [{"body": "Lol", "score": 4, "replies": []}]}, {"body": "Google and Apple for sure.  They have 99% of mobile.  The reason Google will do well over the next 10+ years.\n\nThe most popular website ever with search\n\nThe second most popular website ever with YouTube\n\nThe most popular operating system ever with Android. Over 3 billion active devices\n\nThe most popular navigation with Google Maps\n\nThe most popular photo storage with Google Photos\n\nThe most popular email with Gmail.\n\nThe most popular browser with Chrome\n\nThe most popular OTT in the US with YouTube TV.\n\nGoogle owns K12. Now with 87% market share.\n\nGoogle now has 16 different services with over half a billion DAU. They have nine with over a billion.\n\nIn terms of AI they have led in AI research for over a decade now with a pretty huge lead. They have made more of the major breakthroughs in the last decade than any other company. They have lead in papers accepted at NeurIPS for over 10 straight years now. In 2023 they had almost three times the papers accepted as next best.\n\nBut one of their biggest advantages is having started the TPUs over a decade ago. Now on the fifth generation. Where their competitors are stuck paying the Nvidia tax. Microsoft is the head scratcher. They are only now starting to try to copy Google and do their own TPUs. I have no idea how they could be so blind to what was coming.", "score": 4, "replies": [{"body": "This post makes me hard, and hopeful.", "score": 1, "replies": []}]}, {"body": "I think Microsoft and apple. I think Facebook is going to die first because social media is the fastest to die. There's always a new competitor in this scape, and younger generations probably won't use Facebook products at all.", "score": 9, "replies": [{"body": "People will always communicate. Weather it's via social media, games, vr, video, chat. Meta is on top of that and is always developing the next big thing. They will not be the first to go. However, in 30 years? Not sure if they are still around the way they are now.", "score": 4, "replies": [{"body": "Ways people communicate change over time though, and no guarantee that Meta will own the next one. There isn’t any ‘sticky’ reason to stay with one forever, unlike say an iPhone where there’s a lot of reason to get another next time.\n\nHistorically I’ve used Bebo, then MSN, then Messenger, then WhatsApp to keep in touch with people just in the space of 15-ish years. In many parts of the world WhatsApp doesn’t even seem to be that common and it’s Viber or something else. Communication will remain, but I doubt Meta will remain always on top of it. Look how fast Facebook has slid already", "score": 2, "replies": []}]}, {"body": "I believe Facebook will acquire all of them gradually", "score": 0, "replies": []}]}, {"body": "RIO will still dominate mining.", "score": 3, "replies": []}, {"body": "I am pretty sure MSFT will be around by then.", "score": 3, "replies": []}, {"body": "Apple will become a 10 pe company. Amazon will own countries.", "score": 8, "replies": [{"body": "Pretty precise Anonymous.  I believe our 2052 overlords will look down on your giving away our secrets to the 2023 hordes", "score": 3, "replies": []}, {"body": "Lets sell france, no one will miss them", "score": 1, "replies": []}]}, {"body": "KO, PEP", "score": 2, "replies": []}, {"body": "I just returned from there!   \n\nJohn Prine was right: \n\nWe're all driving rocket ships\nAnd talking with our minds\nAnd wearing turquoise jewelry\nAnd standing in soup lines", "score": 2, "replies": []}, {"body": "100% sure google and apple will be crashed by that time.", "score": 2, "replies": []}, {"body": "MSFT, AMZN, APPL, GOOGL \nThey are so big that they will just buy in to whatever the next big thing is.  That keeps them going.  McDonalds isn’t going anywhere soon either. They will somehow morph into a plant based fast food giant if meat goes away.", "score": 2, "replies": []}, {"body": "Just the inflation alone will drive these stocks to unfathomable heights but the indexes will be in the billions. QQQ just hit 17 billion today: February 2057AD", "score": 2, "replies": []}, {"body": "Amazon. Too much physical infrastructure.", "score": 2, "replies": []}, {"body": "Of those 4 companies? Probably all of them.", "score": 3, "replies": [{"body": "Why do you think that?\n\nOf any of todays [top 10 companies](https://companiesmarketcap.com/).", "score": 0, "replies": [{"body": "Ok saudi aramco might not be there in 30 years but the other ones that provide constant innovation probably will be.", "score": -1, "replies": []}]}]}, {"body": "All of them. Computers continue to evolve in ways we can’t imagine and these companies stand to gain the most from tech integration.", "score": 2, "replies": []}, {"body": "Berkshire, Microsoft and intel. There is a good chance India and china have the big companies by then aswell.", "score": 1, "replies": [{"body": "Intel is definitely not a top 10 company by market cap today.", "score": 6, "replies": [{"body": "That’s a great point. I guess at 200b cap they’re still pretty much there though", "score": 1, "replies": []}]}]}, {"body": "No one knows, questions like this are goofy, do your own due diligence.", "score": 1, "replies": []}, {"body": "The US might have collapsed by the. For all we know", "score": 1, "replies": []}, {"body": "Amazon Microsoft Google Facebook Apple\n\nThe time for new players to appear are during a technological shift to a new wave. Google Amazon in dotcom era, Facebook in Web 2.0, Apple (revitalized) in mobile computing era\n\nThe problem is, the new wave is AI. And it costs so much money and requires so much compute / data / talent that startups can’t disrupt. \n\nThe battle for the future is freaking  Microsoft vs Google   😂 so lame. \n\nAny real startup is just runoff from those big labs, and also aggressively funded by faang in some sort of proxy battle. Look at Anthropic - 3-5B from Google and Amazon funding, and founded by ex Microsoft talent.   \n\nMistral started in April from ex Google talent and has over 500M in funding.  Although, no faang led funding yet.  This will definitely change once they start going for a GPT4 level model though.", "score": 1, "replies": []}, {"body": "Apple.  \n\nThough it will be interesting to see where things go when Cook, Maestri, Williams, Srouji and others retire.  \n\nWill the Cook Doctrine continue, or will there be a return to the Jobseian Dictate on product releases?", "score": 0, "replies": []}, {"body": "I think spaceX will grow due to the new fuelling stations they launched on Mars.", "score": -2, "replies": [{"body": "Sorry I’m also posting from the future.", "score": 1, "replies": []}]}, {"body": "TSLA\n\nSay what you will about Musk, Tesla is a strong company with or without him.  They will continue to be the top dog in the EV market for many decades to come.  I’m thinking we will see another 10-20x from the current price on Tesla with steady growth in that 30 year time frame, but probably no more meteoric rises.  The company is maturing and has made the right moves to stay dominant in the market they created for many years to come.", "score": -2, "replies": []}, {"body": "I probably won't be alive.", "score": 1, "replies": []}, {"body": "What about Spgi and Ma, they bolth have very dominant positions.", "score": 1, "replies": []}, {"body": "MSFT is in beast mode.", "score": 1, "replies": []}, {"body": "🔮", "score": 1, "replies": []}, {"body": "2052 Jesus who even knows what the world will be like by then.", "score": 1, "replies": []}, {"body": "lol you be dead before then.", "score": 1, "replies": []}, {"body": "BYD on one side, and AAPL on the other.", "score": 1, "replies": []}, {"body": "lol! You are trolling. right?\n\nIn any case I bet Coca Cola will still be here  /s", "score": 1, "replies": []}, {"body": "TSLA and MSTR will dominate the market.", "score": 1, "replies": []}, {"body": "Microsoft for sure, but then we got Tesla with its EV cars that is most known and popular. Costco isn’t going anywhere but up lol.", "score": 1, "replies": []}, {"body": "Certainly some of them and not others.", "score": 1, "replies": []}, {"body": "Oh also there will be water wars and oil shortage by then... economies will be in havoc", "score": 1, "replies": []}, {"body": "That far out is literally impossible to tell. Nvidia could go out of business by that time for all we know.\n\nI think you should revise your question to a 5 year time frame. Maybe 10 at the most. Beyond that it's just throwing darts at a dart board.", "score": 1, "replies": []}, {"body": "None of them.", "score": 1, "replies": []}, {"body": "idk about mag7 big, but I'd almost guarantee that Texas Instruments will endure", "score": 1, "replies": []}, {"body": "MSFT may be like IBM is to us now.  Plenty of patents, not growing fast at all, and paying out solid dividends.\n\nGoogle will (hopefully) be replaced.\n\nAmazon will be broken up into smaller companies.\n\nAnd I'm just guessing here.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "18qjsd8", "created_utc": 1703514897.0, "score": 0, "upvote_ratio": 0.24, "num_comments": 256, "comments": [{"body": "It’s Christmas. Go enjoy some time with the family. You can choose to be ultra pessimistic tomorrow.", "score": 874, "replies": [{"body": "OP is just salty because they are down 50% on their SQQQ position", "score": 138, "replies": []}, {"body": "Yep, Merry Christmas and tomorrow (u/Versace\\_\\_01) post positions according to your guess with timestamp and pic of shoe on head and then I'll believe you, otherwise this is just another doompost for entertainment and that's my New Years Resolution: less scrolling over doomposts.", "score": 33, "replies": []}, {"body": "This. Everyone knows stocks only go up.", "score": 44, "replies": [{"body": "Nah bro, only STONKS go up ;)", "score": 10, "replies": []}]}, {"body": "Amen.", "score": 3, "replies": []}, {"body": "💀", "score": -44, "replies": [{"body": "What a “weird sad attitude” it is to go on a mini rant because someone said “its christmas”", "score": 20, "replies": []}, {"body": "I think when most say something along the lines of “have a Merry Christmas”, it’s another way of saying “have a blessed day”.\n\nIt’s a weird attitude to take someone saying Christmas personal like it’s an attack on your personal beliefs…it’s not.", "score": 8, "replies": [{"body": "Not to mention on actual Christmas and a day when the stock market is closed", "score": 8, "replies": []}, {"body": "REEEEEEEEEEE REEEEEEEEEEE!!! -Some clown who gets butthurt over Christmas, yet we all have to adjust to them/their’s pronouns.", "score": 3, "replies": []}]}, {"body": "Do you get your panties in a bunch when someone says, “Merry Christmas”?", "score": 4, "replies": []}, {"body": "either way stock market isn’t open for christmas.", "score": 2, "replies": []}, {"body": "Americans tend to forget there's a world outside of the USA.", "score": -28, "replies": [{"body": "Because Christmas is an American invention right?", "score": 14, "replies": []}, {"body": "Ahhh, yes, the holiday that people have celebrated LONG before the USA was ever a thing is only celebrated in the USA! You got it!", "score": 16, "replies": []}, {"body": "I don’t forget there’s a world outside the USA, but I always remember that the USA is the only one that matters. 🤷🏻‍♂️", "score": 13, "replies": []}, {"body": "And your country must be full of dumb asses, yeah?", "score": 1, "replies": []}]}]}, {"body": "I was thinking this too. He’s trying to manifest an awful year. Go be awful alone 😂", "score": 1, "replies": []}]}, {"body": "Didn’t I read the EXACT same post in 2023, 2022, 2021, 2020, 2019, 2018, 2017, and every year for decades?", "score": 205, "replies": [{"body": "I mean in some years they are right. You read it on those years and have the same doubt you have now. Nothings changed.", "score": 12, "replies": [{"body": "Predict a crash every year and in some years you'll be correct. Remarkable, a fuckin goldfish could do that.", "score": 24, "replies": [{"body": "And then write a book...", "score": 5, "replies": [{"body": "Fine, ill do it, but only hecayse you told me to.", "score": 1, "replies": []}]}, {"body": "I think you missed the point. Extreme optimism and pessimism aren't warranted. One party is going to look foolish either way.\n\nRedditors have no way of knowing if OP has been crying wolf for said years or not. It doesn't matter. Everybody on extremes are acting out irrationally.", "score": 3, "replies": []}, {"body": "The Michael Burry method", "score": 1, "replies": []}, {"body": "Even a blind cat will eventually catch a mouse", "score": 1, "replies": []}]}]}, {"body": "I wish I could automatically block any post predicting a recession", "score": 1, "replies": [{"body": "The sub would be empty", "score": 1, "replies": []}, {"body": "lol they’ll tell you you’re in recession after recession is done! So your wish is very stupid because people are trying to save you before you make a fool of yourself. But you are a fool to believe otherwise", "score": 1, "replies": []}]}, {"body": "In all fairness I think 2021 was pretty bullish all around.  So there was one year.  But if you had every reason to be bearish it would have been 2022/2023 but look at the result.  Not sure why 2024 is “the year”.  I mean it could be, but whatever. I’ll keep buying otm puts here and there with the low vol,", "score": 1, "replies": []}]}, {"body": "> 2024 is for many reasons going to be bad\n\nSource: trust me bro", "score": 192, "replies": [{"body": "OP even put it in bold letters, it's now a fact.", "score": 69, "replies": [{"body": "Nah. He didn't commit to it by putting it in bold and all caps, so we're good.", "score": 4, "replies": [{"body": "#HE SHOULD HAVE YELLED TO MAKE A STATEMENT!", "score": 1, "replies": []}]}, {"body": "\n\n**2024 IS FOR MANY REASONS GOING TO BE BAD**", "score": 1, "replies": []}]}, {"body": "Any sign of a recession interest rates will drop and get things moving again.  OP probably thought the market was going to crash this year too.", "score": 5, "replies": [{"body": "Then inflation begins again though.", "score": 0, "replies": [{"body": "A little inflation is better than a recession.  And Powell seems to have pulled it off. The economy is stronger than people think too.", "score": 2, "replies": [{"body": "This is a decent point. I suppose I have this hyperinflation fear in the back of my mind.", "score": 2, "replies": []}, {"body": "“The economy is stronger than people think too” . You do realize that it looks this way because consumers are driving the economy mainly on debt. I can almost warranty  you that if you ask 10 people, at least 7 don’t have any savings and are living pay check to pay check and maxing out their credit cards. 2024 will reflect this.", "score": 3, "replies": [{"body": "It's always been that way.", "score": 1, "replies": [{"body": "Disagree", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "Why are you worrying about all of us when you can just buy puts?", "score": 122, "replies": [{"body": "He’s still trying to convince himself that being all cash was a good idea.", "score": 64, "replies": [{"body": "So true", "score": 8, "replies": []}, {"body": "I mean Warren buffet is heavily in cash. I hardly see anyone being a critic about it.", "score": 1, "replies": [{"body": "I keep about 20% of my portfolio cash for buying opportunities... But comparing a retail investor to buffet is apples and oranges. Due to the size of berkshire his buying opportunities are significantly more limited than you or I... I wouldnt try to copy him", "score": 6, "replies": []}, {"body": "That’s because he’s taking a large stake in a company. Found out a few months too late?", "score": 1, "replies": [{"body": "I had no idea, but being in cash is a completely rational thing. It's irrelevant if you missed the rally or not. It's irrelevant what direction you miss. There is always an opportunity in the market.", "score": 1, "replies": [{"body": "There are opportunities but being able to see them is important.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Someone didn’t get anything fun in his stocking.", "score": 45, "replies": []}, {"body": "Everyone is still calling for a recession  and a crash which means the market will do just fine. See 2023.", "score": 84, "replies": [{"body": "Also historically election years are up.", "score": 16, "replies": []}, {"body": "People are calling for a crash because they don’t realize we already had a recession…we had rolling recessions in different sectors similar to mid 1980s and early 1990s with two negative gdp quarters in 2022. The early 1990s recession occured between july 1990 and march 1991.. the nber didn’t declare it as a recession untill december 1992(almost over 1.5 years later)(https://www.nber.org/news/business-cycle-dating-committee-announcement-december-22-1992 ) … there were layoffs in tech sector, trucking and few other sectors  last year…services and consumer spending is doing fine because of retiring boomers..real wages has also been going up since 2013 after staying stagnant for 2 decades…there was credit event in march with regional banks but fed rescued them…Talking about equities, most large cap stocks went down like 40-50% or even more in 2022, many junk stocks were down 80-90%….there are many other factors that point to the fact that we already had a downturn and if fed cuts rates next year, it will be a tailwind for equities..I fully expect nber to declare recession in 2022 but probably after elections are over.", "score": 16, "replies": [{"body": "Agreed. We’ve had rolling recessions in tech, mortgage, housing, regional banks, etc. I can see other industries being impacted but this is a lot better than the entire country falling at the same time.", "score": 7, "replies": []}]}, {"body": "If everyone calls for it   it won't happen", "score": 1, "replies": []}]}, {"body": "Damn thanks for spreading Christmas joy.", "score": 18, "replies": []}, {"body": "This post on Christmas hahaha \n\nHave some fun man. 🥳", "score": 50, "replies": []}, {"body": "And 2023 was the worst year ever right? Lol", "score": 27, "replies": [{"body": "Because Trump told us it was", "score": 6, "replies": [{"body": "And he's the trustworthiest person who ever existed. Lots of people are saying that. A marine came up to him with tears in his eyes saying \"Sir o7, you're the trustiest most truthtellingest person since Jesus, maybe even moreso and despite all the evidence to the contrary I believe everything you say and when it's not the truth you're totally just rustling liberal jimmies I love you Dr. Zaius!\"", "score": 2, "replies": []}]}]}, {"body": "Fuck sake, I’ll just go kill myself now. Happy Christmas everyone.", "score": 10, "replies": []}, {"body": "Jfc, shut up.", "score": 27, "replies": []}, {"body": "I mean. Last two years were pretty bad In the stock market. We just recovered to 2021. Feels like we had the recession already ...", "score": 26, "replies": [{"body": "I think you're on to something", "score": 1, "replies": []}]}, {"body": "Don't trust redditors with about anything", "score": 20, "replies": [{"body": "A lesson everyone needs to learn here.  Redditors, by and large, are much less intelligent than they think.", "score": 8, "replies": [{"body": "It is not intelligence but critical thinking. Humans tend to react quickly to things and rarely take the time to digest information. \n\nWith social media we have an abundance of information which is good but also bad. Often people will just parrot whatever was posted or sounds good to them without thinking, resulting in these knee jerk reactions.", "score": 5, "replies": []}]}, {"body": "Weed through the personal opinions and look at what people \"say\" based on facts not emotion.  \n\nThere is lots of good information here, but what is it 1 post out of 30?  100?", "score": 1, "replies": []}, {"body": "You are a redditor, so I wont trust you, which means I will be trusting redditors.", "score": 1, "replies": []}, {"body": "You are a redditor, so I wont trust you, which means I will be trusting redditors.", "score": 1, "replies": []}, {"body": "You are a redditor, so I wont trust you, which means I will be trusting redditors.", "score": 1, "replies": []}]}, {"body": "I expect stocks to go up ~10%, like usual. I have not considered any evidence and I certainly don’t need to.", "score": 22, "replies": []}, {"body": "\"I say look at history. The last time we had an even remote high number of inflation years in a row we had a recession (which is tied to interest rates btw).\"\n\nWith all do respect you don't seem qualified to make any type of prediction. Inflation has fallen from 9 to 3 percent. The fed has stated they expect to lower rates next year. Lower interest rates are very positive for the stock market. \n\nAlso we just had 5% GDP growth last quarter. \n\nI am just saying next year doesn't seem like it going to be a bad year at this point.", "score": 14, "replies": [{"body": "Can you show me where Jpow has said they will be lowering interest rates i’m thinking it may be on the table, but he hasn’t said they are gonna lower interest rates that’s not true please show me where I’m wrong", "score": -3, "replies": [{"body": "It's in the dot plot.", "score": 6, "replies": [{"body": "Yeah, my guess right now would be that they'll cut in May unless inflation stabilizes/rebounds.\n\nIf they didn't want folks thinking about the possibility of cuts, then they shouldn't be using dot plots.\n\nFTR if we're going to talk about high inflation, then to be more accurate, it was probably a year and a half, maybe a little more if you actually count back into 2020 looking at CPI MoM numbers but IDK for sure.\n\nThe problem, and it's probably why we have a bit of a vibescession to me, is that you'd have to have been born in the 1960s or earlier to have last experienced as bad of inflation as we did.", "score": 1, "replies": []}]}, {"body": "https://www.bankrate.com/banking/federal-reserve/when-will-fed-cut-rates/#:~:text=The%20Federal%20Reserve%20is%20currently,percentage%20point%20beginning%20in%20March.", "score": 1, "replies": []}]}, {"body": "Due respect", "score": 1, "replies": []}]}, {"body": ">**2024 is for many reasons going to be bad**\n\nNo it's not. For many reasons.", "score": 20, "replies": []}, {"body": "We already had the recession from covid in 2022 Nd part of 23. Other than doomer forecasting, what specific macroeconomic factors do you impacting the market? Cause it looks like potential rate cuts which would juice the market.", "score": 14, "replies": [{"body": "His source: trust me bro", "score": 20, "replies": [{"body": "Wont even post puts lol", "score": 7, "replies": []}]}, {"body": "This is the recovery from the crash, if you're buying now it's too late to profit significantly, it's on the high side right now so we might see a slight pull back before a return to the status quo.\n\nAll that assuming the middle east and Ukraine situations don't suddenly change, or other dramatic world event that disrupts business.\n\nAmerican based semiconductor companies building new fabs in the US will continue to benefit from the chips act as well.", "score": 2, "replies": []}]}, {"body": "Source: trust me bro", "score": 6, "replies": []}, {"body": "I love all the evidence you provided to support your hypothesis.", "score": 5, "replies": []}, {"body": "You’re fearful so time for me to be greedy", "score": 5, "replies": []}, {"body": "Hey remember a year ago when this sub posted shit like this 50 times a day, every. single. day.\n\nAnd then the stock market went up 25% in 2023.\n\nPepperidge Farm remembers.", "score": 8, "replies": []}, {"body": "EVERYBODY is seeing there will be a recession in 2024.   \n   \nWhere do you get your news?", "score": 8, "replies": []}, {"body": "If you truly follow the fearful/greedy edict, you’ll never win because you’ll sell every time the market goes up because it means people are greedy. The point is to buy more when it’s low, not to never have any gains. Yes, the market is going up. It better eventually, or why invest at all? That’s not a sign of catastrophe.\n\nThe market dropped like 20% last year and had another 20% inflated away. Where is this idea that the market didn’t already collapse?", "score": 3, "replies": []}, {"body": "Short it then and be happy.  \n\nMerry Christmas!", "score": 3, "replies": []}, {"body": "It won’t be. Stop with all this sky is falling BS", "score": 3, "replies": []}, {"body": "I swear these posts need to come with a screenshot of SPY puts. Put your money where your mouth is.", "score": 3, "replies": []}, {"body": "Hopefully it is so I can buy the dip", "score": 4, "replies": []}, {"body": "It's almost certainly going to be worse than 2023, that's just regression to the mean. Will it be \"awful\"? Maybe, I don't know.\n\nI would expect where from –5% to +15%.", "score": 2, "replies": []}, {"body": "Merry Christmas", "score": 2, "replies": []}, {"body": "![gif](emote|free_emotes_pack|poop)", "score": 2, "replies": []}, {"body": "shut the fuck up and stop speculating", "score": 2, "replies": []}, {"body": "How do you know? Do you have a crystal ball? Idc what the market does in 2024 I’ll continue to dollar cost average", "score": 2, "replies": []}, {"body": "Enjoy Christmas you grinch.", "score": 2, "replies": []}, {"body": "Some people say the stock market will go up. Some say the stock market will go down.\n\nI guarantee the stock market will go to the right.\n\n💹", "score": 2, "replies": [{"body": "Time travel bro I’m going left", "score": 1, "replies": []}]}, {"body": "Negative Nancy much", "score": 2, "replies": []}, {"body": "\"people think this time around is different\"\n\n\"The last time we had an even remote high number of inflation years in a row we had a recession\"\n\nPast performance is not indicative of future returns. You are free to short the market and get rich af. lol tho", "score": 2, "replies": []}, {"body": "You are correct. 2024 gonna be a rough year. Start of with all the conflict in europe, then midle east and soon will be china. We also have election in usa, russia which will have big impact on  what each country behavior. Third will be the damage from high interest kick in. So there are many thing uncertnt and  we need to prepare", "score": 2, "replies": []}, {"body": "Disaster only happens when you sell.  I held through a shitty August and September and was rewarded for it.  During and after 2020 there were lots of gains and there was a lot of erosion in 2022 which is when I rebalanced into tech.  Also decided to not panic sell, hold during huge dips and DCA or find more value opportunities.  \n\nYou will never loose everything, the number of shares generally will not change in a down turn and lastly the market never stays down!", "score": 2, "replies": []}, {"body": "***This comment is going to age like fine wine in a few months***.... Mag 7 are basically ahead of the curve when is comes to the economy and the way I see it they are out of their industry's recession bubble. Every other industry is going to now follow..", "score": 2, "replies": [{"body": "Who’s mag 7?", "score": 2, "replies": [{"body": ">Mag 7\n\nAmazon, Apple, Meta Platforms, Microsoft, NVIDIA, and Tesla", "score": 1, "replies": [{"body": "Ah. There’s an aluminum smelting company in Missouri called magnitude 7 so I thought I was missing something.", "score": 1, "replies": []}]}]}]}, {"body": "This guy must not have heard about inflation falling  every month for like a year. The economy is strong. GDP growth and jobs reports continue to beat expectations. Rate cuts are coming. There’s a lot of reason to believe next year will be a great year for business.", "score": 2, "replies": []}, {"body": "Enjoy your day.", "score": 3, "replies": []}, {"body": "As much as I think a lot of stuff is overpriced, a recession doesn't equal the stock market tanking.", "score": 1, "replies": []}, {"body": "Americans shortsighted? No fucking way!", "score": -1, "replies": []}, {"body": "I think it’s a trap for people who are in wealth generation stages (as opposed to prioritizing existing wealth preservation) to think in terms of being in or out of the market based on directional thesis. I like to stay in broad market index funds in my brokerage account and 401(k), but use my IRA to reposition without tax drag. That allows me to stay fully invested, but move funds in a lump when I see a great opportunity. \n\nI think there will be rotation back to the comfort of the mag 7 at earnings, since multiples expanded well ahead of earnings growth. I’m planning to shop for opportunities when that happens. If I’m wrong, my consolation prize is market returns.", "score": -1, "replies": []}, {"body": "Before the dot com bust doormen were telling random people about how they made a killing on a stock they bought.\n\nBefore the 2008 crash people working at random jobs were telling how they are flipping homes.\n\nBefore the meme/crypto crash college kids were telling people how to make money on meme stocks or crypto.", "score": -1, "replies": []}, {"body": "I agree that it is a time to be aware of the risks. \n\nI in the past felt the market was overvalued as far back as 2016 and hedged 50% of my portfolio (cash, fixed, small short) and I ended up getting half the returns that were probably available to me in those years.\n\nThe Covid market drop and the 2022 drop allowed me to fill some of the hedged part of the equities so now I have 75% in equities and the returns are much better. \n\nAfter going through the dotcom and subprime crashes I am wary of how bad a crash can be. Covid and 2022 were quick and minimal in comparison.\n\nI think the best we can do is look for good companies that sell at fair or good prices to their intrinsic value. \n\nPredicting is so tough. I will always have some percentage hedged to reduce my drawdown and have some funds for deals that come from drops. 2020 and 2022 were wonderful opportunities but I know from history there can be bigger opportunities as well.  When is the only question.", "score": -1, "replies": []}, {"body": "I know right?  Imagine the market armageddon that will ensue when interest rates start to be lowered.", "score": 0, "replies": []}, {"body": "Burn Wallstreet", "score": 0, "replies": []}, {"body": "Merry Christmas", "score": 1, "replies": []}, {"body": "Didn’t everyone say this last year about 2023?", "score": 1, "replies": []}, {"body": "And you’re the expert?", "score": 1, "replies": []}, {"body": "I kept my riskier stocks and set up covered calls. Made my new adds more reserved with more dividend focused stocks and bonds ladders.\n\nPlan accordingly to your expectations and your predictions, what is out of your control is out of your concern. \n\nAlmost all of Econ is psychology", "score": 1, "replies": []}, {"body": "Sell all your stocks then", "score": 1, "replies": []}, {"body": "I’m guessing you were saying this year would be bad also? ![gif](emote|free_emotes_pack|trollface)", "score": 1, "replies": []}, {"body": "Bro. Go enjoy Christmas", "score": 1, "replies": []}, {"body": "Merry Christmas, ya filthy animal.", "score": 1, "replies": []}, {"body": "The bear thesis is over.  The bull market is broadening to the small and mid caps.  Rotate out of large caps and into small caps for 2024. Win.", "score": 1, "replies": []}, {"body": "!remindme 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2024-12-25 15:29:34 UTC**](http://www.wolframalpha.com/input/?i=2024-12-25%2015:29:34%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/18qjsd8/is_nobody_seeing_that_2024_is_going_to_be_awful/kevcshd/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F18qjsd8%2Fis_nobody_seeing_that_2024_is_going_to_be_awful%2Fkevcshd%2F%5D%0A%0ARemindMe%21%202024-12-25%2015%3A29%3A34%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2018qjsd8)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "First question to ask—do you have faith in the US economy? \n\nNext question—aren’t you just a doomer/zoomer? The rest of the young generation are typically pessimistic about everything, so you’re not special. The only difference is that you’re willing to put money on that sentiment bet against the market", "score": 1, "replies": []}, {"body": "Sounds like I’ll be buying the dip, stay smooth my friends", "score": 1, "replies": []}, {"body": "The market is closed today for a reason - spending some time with your family or touch some grass", "score": 1, "replies": []}, {"body": "I can just tell you bro, I've been pessimistic about the market 2016-2018. I lost so much money with Puts and other ways to short the market - but I was simply convinced that prices are way to high and out of line with economic fundamentals  - e.g it's all (wrong) sentiment. At some point I understood it's really no longer about the prices you see, it's about REAL inflation. So if you take your portfolio and value it in USD, you're up. But if you value it in say sq ft of rental property or in #casual dinners out you're, like most people, most likely in the red.", "score": 1, "replies": []}, {"body": "Bro, at this rate, we can all quit our jobs and just get rich by stocks.  \n\nGDP is stocks go up.   Every penny go to stock = get rich", "score": 1, "replies": []}, {"body": "Isn't this the fifth year in a row the doomsdayers have called a crash.", "score": 1, "replies": []}, {"body": "I’m with you, but you can’t buy puts today nor can I sell them to you so", "score": 1, "replies": []}, {"body": "Perfect time to buy. Back the truck up", "score": 1, "replies": []}, {"body": "Many stocks are in value territory, if there is a fall it will be a great buying opportunity.\n\nOver the next 20 years there will be several recessions. If next year is one, it won't be a big one or matter much for the valuation of stocks.\n\nSo if any or all fall the over priced will be correcting and the already cheap will become a bargain.\n\nWhat's to fear?", "score": 1, "replies": []}, {"body": "oh man, if you say it then it must be true! I'll liquidate everything now", "score": 1, "replies": []}, {"body": "i heard this in 2022, then in 2023.", "score": 1, "replies": []}, {"body": "I don't need 40, I need the 8-10 average.", "score": 1, "replies": []}, {"body": "Removal of a demented fool is gonna be awesome.", "score": 1, "replies": []}, {"body": "How bout besides the big 7 to be up 20 percent so I can catch up abit", "score": 1, "replies": []}, {"body": "Many people are and I agree with you. Main Street is struggling. Once people stop doom spending we'll see that recession.", "score": 1, "replies": []}, {"body": "You buy puts and I’ll buy calls", "score": 1, "replies": []}, {"body": "2024 is going to be great barring any worldwide disruptions. I’m excited.", "score": 1, "replies": []}, {"body": "I think the market will be interesting when the Q4 retail earnings reports come out in late Jan/early Feb. There is so much to digest about spending trends - any hint that holiday sales indicate a weaker consumer and we are in for a rotation as investors skim profits off all this froth.", "score": 1, "replies": []}, {"body": "The correct theme for 2022 was don’t fight the fed.\n2023 was be greedy when others are fearful they matched perfectly.\nYour saying 2024 is “enter with caution”. We will see", "score": 1, "replies": []}, {"body": "Historically, when has there been a time with high employment and strong economic growth while inflation falls back to normal levels?  We are in fairly uncharted waters here.  I don't see much reason to be certain of anything.", "score": 1, "replies": []}, {"body": ">**I say look at history. The last time** we had an even remote high number of inflation years in a row we had a recession (which is tied to interest rates btw).\n\n(emphasis mine)\n\nFor someone giving investment advice on the internet, you should try googling \"EMH\"", "score": 1, "replies": []}, {"body": "You’re going to try to fight JPow huh? Rate cuts next year and you want to go up against the money printer? RIP bears", "score": 1, "replies": []}, {"body": "When I've thoughts like you I always try to think about if the markets will be lower or upper than now in the next 3-5 years. What do you think?", "score": 1, "replies": []}, {"body": "I love this, OP is the pessimistic and bulls come in the droves saying \"everybody's bearish\" to clown on him. You sure that \"everybody's bearish\"? Maybe OP is the minority here.", "score": 1, "replies": []}, {"body": "Will the market go down next year? At some point in time it will absolutely go down, there is always a drawdown every single year. Will it be a major move lower or short lived consolidation, who knows. You don’t know. I don’t know. Nobody knows. Best bet, keep dollar cost averaging, and if stocks pull down 10% or more, add a bit more cash if you can. I’ve been doing that for years. I got a house in the Bay Area and a $300k equity portfolio out of it. \n\nYou can of course take the opposite side, hide in cash with a near constant bear view, waiting for the perfect opportunity. Good luck with that.", "score": 1, "replies": []}, {"body": "Who cares? Buy and hold", "score": 1, "replies": []}, {"body": "You want us all to panic sell so you can get out of your pessimistic portfolio choices? It’s fucking Christmas…", "score": 1, "replies": []}, {"body": "Why would I want to sell for losses instead of buy a boatload when the market is down?\n\nyou have that buy high sell low thing going on....I have been down 10-20-even 40% from initial investments in the past and bought more..ended up with 100%-300% returns more often than I've lost any money.\n\nYou invest in solid companies and keep your gambling at a low % and when you see the market go red you get excited.", "score": 1, "replies": []}, {"body": "Do you really think you’re the only one walking the streets with your secret knowledge and highest IQ among all the people? “NOBODY” else having any clue about stocks? You’re THE CHOSEN ONE?", "score": 1, "replies": []}, {"body": "ok lil bro", "score": 1, "replies": []}, {"body": "Well my reasons say it's going to be better, we are in the age of speed, periods are going to be shorter, untill we evolve.", "score": 1, "replies": []}, {"body": "Bears just never learn.", "score": 1, "replies": []}, {"body": "Remindme! 1 year", "score": 1, "replies": []}, {"body": "!remindme 1 year", "score": 1, "replies": []}, {"body": "There’s a lot of doom posts still happening but ultimate the market *is* in greed right now. Hitting ATH and Crypto heading up again. People are absolutely pumping into the markets, online sentiment be damned.\n\nThing is, it could continue like this for longer regardless of how much people worry online. When it does go really bad I imagine it’ll be quick but you could be missing out on lots of gains in that meantime.", "score": 1, "replies": []}, {"body": "Merry Christmas!", "score": 1, "replies": []}, {"body": "You’re right but what’s that have to do with stocks?", "score": 1, "replies": []}, {"body": "I think any incumbant presidential administration will spend as much debt as they can to float the feeling of a good economy until election day. \nCyclically, we should have had a recession after the CVD $10T money dump. But it’s being delayed.", "score": 1, "replies": []}, {"body": "Doomers are so exhausting.", "score": 1, "replies": []}, {"body": "You made your sentence bold.  100% true in that case.   Pack up shop boys and girls the oracle has spoken.   Get off here and go drink some eggnog and enjoy the family.   Lighten up man it’s not your money anyone else here is investing.", "score": 1, "replies": []}, {"body": "How do you know that greed is driving the market? What’s the evidence. I’m not saying you’re wrong and generally agree with your point but would just like to know how it’s being greedy to better inform myslef", "score": 1, "replies": []}, {"body": "You’re really on Reddit acting this way on Christmas with your shit DD and no proof?\nLook at history, lmao.", "score": 1, "replies": []}, {"body": "The one thing you can be sure of? That no one KNOWS what will happen in 2024. Or 25. Or 26.", "score": 1, "replies": []}, {"body": "Facts", "score": 1, "replies": []}, {"body": "Maybe stock market is not for you", "score": 1, "replies": []}, {"body": "What if I told you we had a recession in 2022", "score": 1, "replies": []}, {"body": "Go back 1 year. Same comment about 2023. \nGo back 2 year, same comment abiut 2022\nGo back 3 year... i hope you see the Pattern. \nNo one ever know when it's going to crash", "score": 1, "replies": []}, {"body": "After reading your last sentence I think you have very little real world trading experience. No stop loss will protect you from disaster. If price gaps down well below your SL, you still expect to be filled at your SL level?", "score": 1, "replies": []}, {"body": "I disagree for 2 reasons. One, it’s an election year. Two deflation will occur which will seem great at first until people start losing their jobs. 2025 probably going to be worse than 2024.", "score": 1, "replies": [{"body": "The thing with continually talking election year is that election year has meant a lot of drama lately.\n\nI do find it hard to buy the idea that we'd repeat 2020 though, so I'm saying 10-12% correction. \n\nIf we do turn out to be late cycle, then we'll probably peak in 2025-2026.", "score": 1, "replies": []}]}, {"body": "RemindMe! December 25th 2024 “Did OP get it right?”", "score": 1, "replies": []}, {"body": "The trend is your friend.  No good indication to sell at this moment.  Agreed that 7 weeks up on the S and P is extended.   Agreed to be careful.  Use your indicators and sell when appropriate.", "score": 1, "replies": []}, {"body": "What if we have a soft landing? With talks of cutting interest rates already taking place, there is reason to be optimistic. Plus, not EVERYTHING does poorly even in a recession.", "score": 1, "replies": []}, {"body": "Calls it is", "score": 1, "replies": []}, {"body": "I didn't forget the \"the economy doesn't feel the effects until about a year after they pause hikes\"...or some shit like that. Whatever it is, I did trim a shitload if positions a couple weeks ago. Because I feel 2024 will be bad for the market but economy will be fine.", "score": 1, "replies": []}, {"body": "Fuck outta here. You can't predict the market any differently than the same people that you're judging.", "score": 1, "replies": []}, {"body": "Stop watching Fox News my guy its making you miserable", "score": 1, "replies": []}, {"body": "Saying 2024 is going to be a great year is no more or less reasonable than saying 2024 will be an awful year.  \n\nThere were a lot of doom and gloomers December of 2022 saying the exact same thing.  Nobody knows nothing.", "score": 1, "replies": []}, {"body": "If the market goes up or down I still make money. Adapt, don't complain", "score": 1, "replies": []}, {"body": "It’s not in the industry interests to advertise upcoming bad years. It wont attract new money clients and scares away old clients.\n\nIt’s in industry interests to paint as rosy a picture as possible using vagary and in-specifics as much as possible, so your occasional drop of fear into the marketing pitch purple kool-aid signs them on the bottom line of control over your monies with as little fiduciary or liability as legally possible.\n\nThis is how established financial interests like to do business.", "score": 1, "replies": []}, {"body": "To everyone making these posts- please include a screenshot of your market short positions. Otherwise, I will take you less seriously than Robert Kiyosaki.", "score": 1, "replies": []}, {"body": "Whether it goes good or bad it is a win win either way", "score": 1, "replies": []}, {"body": "1/2 hate Biden because he’s off his rocker and the other 1/2 hates Trump because he’s their boogeyman so we all lose.", "score": 1, "replies": []}, {"body": "Speak for yourself loser - 2024 gonna be $$$$$$$$", "score": 1, "replies": []}, {"body": "Disaster? Settle down. \n\nThe markets go up AND down, prepare for both cases and there won't be any disaster to worry about.", "score": 1, "replies": []}, {"body": "Bruh they're cutting rates and it's an election year. Is this your first year in stocks?", "score": 1, "replies": []}, {"body": "More money has been lost waiting for market correction than has been lost in market correction.  Or yada yada yada something something whatever.  Either way.\n\nGoes up. Goes down. Goes up a lot. Goes down a lot.", "score": 1, "replies": []}, {"body": "Put your money where your mouth is and short everything big bro", "score": 1, "replies": []}, {"body": "That’s cool.. that’s your fucking opinion", "score": 1, "replies": []}, {"body": "To add something, if you look at history EVERY time that the fed cuts rate, it follow by a recession. Also we will see high defaults credit cards currently is at an all time time and consumers keep spending, and it’s not their money it’s majority is credit cards. We will also see an increase in repossessions of vehicles. I’m seen so many people driving new cars it’s outrageous. Looks like people are doing the opposite when it comes to when to finance a car, why would you do it now with such a high interest rate. It does not make sense at all. I am expecting 2024 to be a horrible year in the stock market. If your smart you can make money also as the stock goes down. Best of luck to all. Position your portfolio accordingly. Remind me in December 2024 to see how things went.", "score": 1, "replies": []}, {"body": "I think a flat decade which we are 2 years into is more likely than a sudden catastrophic crash. Something like that needs an obvious cause. Inflation is down I don’t really see a cause for a crash. That said I doubt the entire market goes to the moon this year.", "score": 1, "replies": []}, {"body": "2022 and 2023 were awful.", "score": 1, "replies": []}, {"body": "Shut the hell up", "score": 1, "replies": []}, {"body": "> 2024 is for many reasons going to be bad. \n\nOk, I'll bite. What are those reasons? Be specific.", "score": 1, "replies": []}, {"body": "I definitely think a recession is on the way, but I thought it would be here before now if I’m honest.", "score": 1, "replies": []}, {"body": "I’m not fearful.", "score": 1, "replies": []}, {"body": "Thanks for fukin ruining my Christmas you son of a bitch!", "score": 1, "replies": []}, {"body": "Buy jumia guys", "score": 1, "replies": []}, {"body": "That might be true, just stay away from overvalued garbage and you should do fine.", "score": 1, "replies": []}, {"body": "Then I’ll buy the dip, I’m holding for decades, not one or two years. Look at a 20 year chart and tell me which way a total market etf goes", "score": 1, "replies": []}, {"body": "It will be terrible but not for me because I am only buying game, stop. Hehe", "score": 1, "replies": []}, {"body": "I’m a Minnesota Vikings fan. Every year it’s a doomsday prediction that actually comes true.", "score": 1, "replies": []}, {"body": "I do. Prepare yourselves. \n\nLong PHYS, PSLV, WEAT, UNG", "score": 1, "replies": []}, {"body": "As every year it can go up, down or stay flat. Yeah lots of people are pessimistic but most of the world doesn’t act pessimistic. Inflation seems to be easing, rates have room to fall, in US it’s election year. \n\nI’m not too worried", "score": 1, "replies": []}, {"body": "I clearly see how all the reliable economic indicators are pointing towards a recession by the end of 2024, and I have positioned my portfolio accordingly. \n\nIt's just that Reddit is full of permabulls, and they are more vocal than others.", "score": 1, "replies": []}, {"body": "Let’s see those short positions", "score": 1, "replies": []}, {"body": "Post history is fun", "score": 1, "replies": []}, {"body": "Hey buddy. I’m in the same camp as you. Be grateful though. Who do you think you are selling high to and buying low from?", "score": 1, "replies": []}, {"body": "Reshape life sciences (rsls)", "score": 1, "replies": []}, {"body": "Im seeing a lot of hopium and greed, but lacking enough shills and ponzis to justify a top imo", "score": 1, "replies": []}, {"body": "You obviously know, like we all do, that 2024 is going to be good. Only one out of every nine years is a down year and we actually had a down year for the first time in decades in 2022.", "score": 1, "replies": []}, {"body": "We will correct in the beginning of the year all the people on the sidelines will buy the dip a bull market will reemerge then we crash after rate cuts. TLDR BUY CALLS", "score": 1, "replies": []}, {"body": "You can’t be sure either way but I think the same. I’m up 63 percent year to date. When everyone was scared last year I bought. Now everyone is buying buying buying and being greedy to the point where stocks seem over valued again. Luckily I still have a good amount of cash and if there are drops I will just buy more.", "score": 1, "replies": []}, {"body": "Like you know", "score": 1, "replies": []}, {"body": "Fuck you; you don’t know shit. I will buy your miserable apartment building with the dividends I collect from my long positions just to evict you", "score": 1, "replies": []}, {"body": "You should sell everything if you believe it’s going to be bad", "score": 1, "replies": []}, {"body": "Bro if you were fearful every time people were greedy you would be sitting out every bull market in history.", "score": 1, "replies": []}, {"body": "Crash? We just came out of a pandemic. it will roar until 2027-28. Sell on January 28th. Rebuy March 3rd. Sell in May. Wash rinse repeat.", "score": 1, "replies": []}, {"body": "that thread aged well", "score": 1, "replies": []}]}
{"title": "Do you ever buy stocks outside of the indexes and Mag 7 near all time highs?", "selftext": "As the title says. Have you ever bought into companies that are at all time high prices outside of the Mag 7 and SPY/VOO/VTI type of baskets.\n\nThere were many stocks outside of those I was afraid of buying earlier this year to name four CRWD, LULU, BKNG, and DHI. All for different reasons. CRWD because there was competition with MSFT and media saying companies would spend less on cybersecurity. LULU due to retail theft fears. BKNG due to travel spending ending and their listings being banned in major cities. DHI due to the housing crash that was meant to come. So now all are near ATH and I feel I missed the boat is it too late to buy.\n\nWould you wait for a dip to occur or would you invest no matter what the price is for those type of companies outside the mega cap tech or the basket type of stocks/ETF. I named specific companies but there are many stocks in the market in this type of situation.", "id": "18qkxi8", "created_utc": 1703518848.0, "score": 175, "upvote_ratio": 0.89, "num_comments": 131, "comments": [{"body": "Just realise that the best stocks are at ATH more often than not. If you worry about what a stock has been worth in the past instead of what you expect it to be worth in the future compared to now, you're just gonna miss out.", "score": 233, "replies": [{"body": "Yep. Almost every analyst and pundit is predicting that the rest of the market will catch up while Mag 7 flattens out in 24. Which means Mag 7 will continue to go up.", "score": 75, "replies": [{"body": "This is such a true advice, I forever thought AAPL was at all time high and overvalued. Missed out on 5x returns in last 10 years.", "score": 38, "replies": [{"body": "That’s the quiet part that no one will admit. I bought AAPL after the iPhone released in 2007 @ $5 a share. Do you know how often I heard it was overvalued? This includes some really smart and successful people. Everyone who listened to those experts and pundits never bought AAPL and continue to believe they are overvalued. I just keep holding and reinvesting the dividends. \n\nI bought 1 share for each of our nieces and nephews around 2012. It split twice since and now worth over $5000 for each of them. Will be gifting them when they finish school and show them what happened.", "score": 33, "replies": [{"body": "ghost whole gray grandfather upbeat sugar rainstorm special nose fearless\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": [{"body": "I think there's something wrong with the math there. Finviz shows prices accounting for splits. From 15ish to current 200ish. 10x", "score": 5, "replies": []}]}, {"body": "I'm decently invested into apple so i have nothing against the stock but an alternative perspective to that maybe that it *was* overvalued but eventually 'grew' into that pricing. \n\nSomething being overvalued in the moment doesn't mean it can't be valued at that amount eventually. It's not like AAPL hit $5 and only went up from there... it corrected a good amount going down to under $3 at times in 2009.  Obviously it bounced back since we're still talking about it today but you get the point. People didn't have to necessarily be wrong on it being overvalued for it to grow and for your stock choice to still be valid and a good hold (eventually).", "score": 2, "replies": []}, {"body": "I try to say this as often as possible.\n\nIf you didn't buy apple until the iPhone 4, you weren't at all late. \n\nSometimes it can be that easy.", "score": 2, "replies": []}, {"body": "Bought apple when the iPHone came out as well and sold it all when SJ died. was walking around the office and noticed everyone witha blackberry was over 50, all the interns had iPhones.\n\nI can't complain though, did OK. and probably still own it in some ETF somewhere.\n\nI'm actually debating dumping Alphabet right now and getting back into AAPL. Or at least just getting back.", "score": 1, "replies": []}]}, {"body": "Turns out, that's just how compound interest works ¯\\\\_(ツ)_/¯", "score": 1, "replies": []}]}]}, {"body": "If the only bad thing you hear about a company or its stock is that it's overvalued, it's a damn good sign of a good possible buy and hold", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "That's underperforming the market.  VOO would have done better than buying Starbucks.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's the way to do it for sure.  I'm not going with any individual stocks unless I am fairly certain I can beat a market return.", "score": 1, "replies": []}]}]}]}]}, {"body": "Novo Nordisk has been at ATH at almost every point in the last 5 years and it would've been a fantastic buy in 2018. You should do your best not to invest based on emotions.", "score": 54, "replies": [{"body": "If you refuse to buy things at ATH...\n\nMost of the best stocks will never have an entry point unless there's some random crisis that only happens every 10-15 years.\n\nIt's a big cognitive bias to only buy things after they've \"gone on sale\".  If something sells off severely vs. the market there's often a good reason.", "score": 9, "replies": []}, {"body": "Same with LLY. There should be an acronym for big pharma one day. Like tech has had the last 5 years.", "score": 3, "replies": []}]}, {"body": "Man there are so many people who are actually afraid of buying outside of the large indexes and the \"mag 7\" for really silly reasons lmao", "score": 53, "replies": [{"body": "My favorite dips to buy is when there are rumors of Mag 7 entering a different sector. Like when TMUS tanked on rumors AMZN might enter telecom business. Or when health insurance stocks tanked because APPL might enter the healthcare insurance business.\n\nMag 7 are great companies but it is interesting blue chips in other sectors get thrown away if there is even a rumor Mag 7 might enter their sector.", "score": 21, "replies": []}, {"body": "It makes all the sense in the world.\n\nIt's called \"Flight to Safety\". Also, they will fall less, comparatively than other stocks. Although I'm talking more about AAPL, MSFT, GOOG, AMZN than NVDA and TSLA", "score": 2, "replies": []}, {"body": "price payment pathetic grandfather hobbies uppity late amusing apparatus direful\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 2, "replies": []}]}, {"body": "“Retail theft fears” have been proven to be massively exaggerated by retailers that just shat the bed on their operations. \n\nYour bigger concern with LULU should be the unrealistic future growth that’s priced in.", "score": 16, "replies": [{"body": "A target closed near me. They cited theft, but it was a “city layout” store with next to no inventory and massively limited selection. I tried shopping there once and it sucked not because theft, but because it has nothing you want. Never went back cuz why would I.", "score": 2, "replies": [{"body": "Nailed it. Target is the biggest liar in this regard. Failed in Canada, failing in US, and blaming everyone but themselves.", "score": 2, "replies": [{"body": "Curious, do you even listen to their earnings call or read their income statements?", "score": 1, "replies": []}]}]}]}, {"body": "You really think\n\n1. UNH/CI\n2. CAT/DE\n3. CTAS/COST\n4. PFE/TMO\n\nThose 3 categories will go away unless US economy collapse?\n\nThey also have similar or slightly underperforming return of rate if you compares to AAPL/AMZN/META/GOOG since 2008\n\nI get that folks are crazy about the moat and fancy stuffs but there are still so many good value stocks if you look at stable business models\n\nLook at CTAS\n\nIt outperform all FAANG. It outperforms all magnificent seven except TSLA/NVDA/AAPL since 2008 when in reality the stable business gives much less risk but reward is the same and henceforth ultimate winner comparing risk/reward ratios", "score": 13, "replies": []}, {"body": "I bought Nintendo recently.\n\nI like if it’s not at all time highs.\nBut, I don’t wait for a dip.\n\nIf you’re in the market long term… you’ll do fine.", "score": 19, "replies": []}, {"body": "Many stocks during 2023 are at 52 week highs. Did not see any slow down in acqusition.", "score": 8, "replies": []}, {"body": "That’s how I got all my bags!", "score": 5, "replies": []}, {"body": "Yes. I been adding to BLDR near all time highs. I think stock is still undervalued. It was going against tough comps all 2023. Comps will be easier in 2024. Especially if fed starts cutting rates. And even if stock tanks company loves buying back shares so they would have opportunity to buy back more of the pie in the event it tanks.", "score": 5, "replies": []}, {"body": "Today’s all time highs are usually next years 52 week lows.", "score": 9, "replies": [{"body": "Someone typed this exact sentence in November 2021.", "score": 0, "replies": [{"body": "teeny roll simplistic swim slimy boat chop absorbed voiceless like\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": [{"body": "No, I'm just sayin", "score": 2, "replies": []}]}]}]}, {"body": "overpriced and all time high are not the same thing", "score": 3, "replies": [{"body": "Got a good example of a stock currently at it's ATH that is wildly overpriced?", "score": 2, "replies": [{"body": "nopes.\n\nLook up lists of stocks at or near all time highs. Check their fcf yields and earnings yields to see if they are at all time lows. Then ask yourself if this business is going to outperform every other business you can think of for the next decade. ATH in and of itself is not the same as overpriced or underpriced.", "score": 2, "replies": []}, {"body": "Starting from the top, we can safely say that Apple is wildly overpriced. \n\nNow, it might well stay overpriced because of how massive passive money flows have become. But there is no fundamental reason for the jump in valuation. PE of 30+ is historically high, and comes at a time it doesn't really make sense. Apples growth has slown down. Geopolitical risks regarding China have only gotten bigger. Interest rates have risen to a point in which you're basically taking on \"return free risk\" in Apple.", "score": 1, "replies": []}]}]}, {"body": "Costco has been and will continue to kill it.", "score": 6, "replies": [{"body": "reach sort impossible melodic long prick crown compare violet outgoing\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": []}]}, {"body": "I don't really pay any attention to ATH. I focus more on momentum and ichimoku cloud structure on D and W. If I like the stock and it has good cloud structure, I'll usually just set an RSI alert or drill down into 4H 2H, etc.. to find a good entry. The RSI alerts usually go off in the next few weeks or even days and if I still have my fundamental belief about the stock, I'll usually take a position at that point.", "score": 3, "replies": []}, {"body": "I've tried my best to not try to time the market, and try to buy when the operations and business is right and not the price", "score": 3, "replies": []}, {"body": "If I bought the Mag7 we would top out and the trend would reverse. I am not of this world.", "score": 3, "replies": []}, {"body": "No. Buy low sell high. I focus on getting a good price.\n\n&#x200B;\n\nIt seems like 9/10 companies near ATH are overvalued.", "score": 3, "replies": [{"body": "Agreed. I am trying to find sustainable deals. The valuations for many companies right now are just ridiculous and I don't see how it can be sustained long term.", "score": 3, "replies": []}]}, {"body": "No. But if you check the graph n see where it consolidates n finds balance. Those are the areas you wanna buy. Never when it’s steeply moving without building solid support.", "score": 4, "replies": []}, {"body": "I do all the time.", "score": 2, "replies": []}, {"body": "Do you think these companies will grow their business in the future? Are you a long term investor? Then there should no problem buying. Worst case you buy more shares if the stock drops.", "score": 2, "replies": []}, {"body": "All the time.\nMy portfolio contains MANY micro cap from technology to energy.\n\nI even have plenty of ADR and OTC stuff.\n\nAs long as you're conscious of the risk, that is a high risk, high reward world.", "score": 2, "replies": []}, {"body": "Buy stocks for companies that you think are good companies. \n\nBuy the company, not the price.", "score": 2, "replies": []}, {"body": "What’s wrong with buying at all time highs when there are more ATHs in the future?", "score": 2, "replies": []}, {"body": "Just buy a small cap index like ijr", "score": 4, "replies": []}, {"body": "I've been keeping my eye on $AXON for awhile and I keep hoping for more than a 10% dip and it has just been up only. Real hidden gem there I don't see people talk about it much.\n\nTo this day I still dont have the balls to buy in.", "score": 3, "replies": []}, {"body": "Having a little cash, selling some covered calls, buying companies like PEP that are down 13% yet have a nice 3% dividend yield but the world thinks will disappear because there are weight loss drugs…  not a bad thing to be tactically cautious at highs after this 2 month run and wait for dips to shift back in to the VOOs and Mag7’s of the world that you mention.", "score": 3, "replies": [{"body": "It’s more so due to consumers shift away from soft drinks. Sales are stagnating younger generation would much rather drink Starbucks or something similar", "score": 2, "replies": [{"body": "Yeah, but you gotta realize that those bags of syrup that pepsi makes that go into fountain soda machines cost them literally pennies to make. Then they sell them for a +1000% markup. Starbucks actually has to deal with coffee which is not cheap at all. The profits that Pepsi and Coke make on their products is absolutely outrageous. They will never take a loss. It’s near impossible. There’s a reason they have been around forever and continue to be strong. Starbucks on the other hand is much riskier. Also consider that Pepsi and Coke have moved into other beverage areas than just soda and will continue to do so.", "score": 5, "replies": [{"body": "They may stick around forever but that doesn’t mean it will be a good investment. Even based off of what you are saying if the company is not growing, expanding, innovating, or providing more value to shareholders - the stock will decline and have poor performance. Based on the “caffeine bubble” we are in- I think all beverage companies will have a very tough next decade or so.", "score": 2, "replies": [{"body": "Maybe. But I also don’t see any Pepsi employees walking off the job and protesting outside stores like the Starbucks ones have. Maybe you were just using starbucks as an example, but they are definitely a company I have never wanted to invest in. I personally never liked their coffee, and I love coffee. Their products are way overpriced and all I see is more and more coffee competition popping up all over my city in the form of little drive thrus. It’s crazy hoe many there are now. I would never invest in Starbucks. Their time is up.", "score": 3, "replies": [{"body": "Yes SBUX is getting in trouble for union busting as well.", "score": 1, "replies": []}]}]}]}]}, {"body": "People so overhyping the weight loss drug. I’m betting on zero impact.  America going to be just as fat.", "score": 3, "replies": [{"body": "Studies showing the fact that Glp-1 inhibitors do actually cause weight loss have been around since we’ve used Glp-1 inhibitors. They’re not a new thing it’s just the shift to marketing it towards weight loss rather then a niche diabetes drug. \n\nAmerica will likely be just as fat but that’s because losing weight for free doesn’t fix your bad habits. \n\nSource: med student with a pharmacist gf who has published some glp-1 research", "score": 3, "replies": [{"body": "Ya, I didn’t mean it didn’t work, just that it will work for the people who care and want to lose weight, and they could have lost that weight without the drug if they actually cared.", "score": 3, "replies": []}]}, {"body": "Anecdotally speaking, it’s not a silver bullet, but it greatly reduces your appetite and for some reason, you don’t crave junk food as much. I lost weight on it. Dieting down is painful, and this eliminates that pain. \n\nI know somebody that went from pre-diabetic to normal on Ozempic. \n\nAmericans spend billions on weight loss supplements that don’t work every year. I don’t think that it’s a fad.", "score": 1, "replies": [{"body": "I'm not saying the science isn't sound, just saying that it won't have this stock value changing effect people seem to be pricing in to food. I think most people just wouldn't do it for the injectible nature of Ozempic, and the pain of the dose schedule for effective use of Rybelsus. Will it help those that are really set on losing weight? Probably, at least temporarily.", "score": 2, "replies": []}]}]}, {"body": "I like PEP. I haven't looked too much into the financials yet, but Pepsi isn't going anywhere and they own lots of diverse business in the food business. KDP worth looking at too.", "score": 3, "replies": []}]}, {"body": "I try to never buy any individual stocks at ATH", "score": 2, "replies": []}, {"body": "The mag 7 carries the indexes. Yes once I figured that out I decided to put into those stocks and eliminate the others and it’s worked well for me . As far as ATH you can just DCA in like you would with an index sp500 fund", "score": 2, "replies": []}, {"body": "Yes the fear is where you make money", "score": 1, "replies": []}, {"body": "Average people only buy indexes and don’t buy anything else. It’s really not hard to look at companies in the indexes or out of them and research if they are good. Average person watches tv all weekend. Are you them? If not then take a risk or research it", "score": 1, "replies": []}, {"body": "If you plan on holding them for years, buy them. And definitely don’t let the media and short-term headline-driven worries keep you from investing in well-run companies.  The retail theft stories are an example - 3 years from now, we will think, “was than even real?  Or just more click-bait-ey smoke that lazy editors jumped on?”", "score": 1, "replies": []}, {"body": "I bought ARKG at $100 :(\n\nBut I bought RYCEY at $1.20 :)", "score": 1, "replies": []}, {"body": "Dollar cost average", "score": 0, "replies": []}, {"body": "Orly", "score": 0, "replies": []}, {"body": "Regardless of what is going on today, it will not be relevant 20 years from now. We buy low cost index funds on an almost weekly basis.", "score": 0, "replies": []}, {"body": "Use the macroeconomic rules to determine that", "score": 0, "replies": [{"body": "Which macroeconomic rules help you predict stock prices?\n\nWhy are they not already priced in?", "score": 1, "replies": [{"body": "I can answer that for 50 bucks, they work", "score": 1, "replies": [{"body": "They don’t work", "score": 1, "replies": [{"body": "Yes they do, is a fast way, and is quite simple", "score": 1, "replies": [{"body": "No. You don’t know anything", "score": 1, "replies": [{"body": "I know a lot", "score": 1, "replies": [{"body": "Ok", "score": 1, "replies": [{"body": "No, really, the way i analize it with the macroeconomic rules allows you to see where the firm really is, and where it is really going, so you can always be prepared about price fluctuations. Is really cool", "score": 1, "replies": []}, {"body": "I just wont say it freely because people wont value it then. But lots of people already listened and are happy, specially day traders", "score": 1, "replies": [{"body": "It’s common sense that anybody who tries to charge for stuff like this doesn’t know anything\n\nOtherwise you could just be a billionaire from your own trading\n\n\nLook at your bank account. If a small amount is in there, that should be a clue to you that you’re not smart", "score": 1, "replies": [{"body": "?? Do you know the investment required to reach that conclusion? 50 bucks is like saying invite me a tea. You just want free stuff.", "score": 1, "replies": [{"body": "Ok. You are probably an investing genius who charges people $50 a month for secret info", "score": 1, "replies": [{"body": "I had insider info on oil. No trading that. You are just weird. You want people to give you free stuff withou offering something, we are not family", "score": 1, "replies": [{"body": "I don’t want free info from you. My original question was rhetorical because you have no macroeconomic info that has value", "score": 1, "replies": [{"body": "You dont know that, you are just projecting yourself.", "score": 1, "replies": [{"body": "Ok. So you are an investing genius who charges $50 to people on Reddit. It makes sense", "score": 1, "replies": [{"body": "So i have to explain it freely just cuz u are cheao? U arent even charming", "score": 1, "replies": [{"body": "I don’t want any info from you, I only asked the original question to point out that you are dumb and know nothing\n\n\nIf you are somehow an extremely smart person that charges people $50 for investment info, then good, keep doing that", "score": 1, "replies": [{"body": "You dont know that, you are only projecting urself.", "score": 1, "replies": [{"body": "True. Like I said before, you are a genius that sells his secret info for $50", "score": 1, "replies": [{"body": "Cool, you already went nuts, freeloader", "score": 1, "replies": [{"body": "I’m not a freeloader because I don’t want anything from you", "score": 1, "replies": [{"body": "You insisted a lot. You didnt propose a talk, you only projected urself.", "score": 1, "replies": [{"body": "My opinion is that macroeconomic indicators are worthless, I asked the question because I expected to not get a smart answer", "score": 1, "replies": [{"body": "I said rules, no indicators, they are rules because are universal laws, like gravity. You only need to understand it", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "With your level of research, I would not recommend buying individual stocks. Let’s not confuse Microsoft and Crowdstrike for doing anything remotely similar. Microsoft Defender and crowdstrike’s endpoint offerings are universes different.", "score": -1, "replies": []}, {"body": "I bought Salesforce by the way AI will boost it. Okta because it’s a solid company and security is something difficult to get out from.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It's also nowhere near its ATH, which occurred before the GFC (where it got absolutely crushed). Citigroup should serve as a cautionary tale for all investors, when it comes to investing in banks during times of financial uncertainty.", "score": 2, "replies": []}, {"body": "That wasn't ATH for CITI. I think the title is asking would you buy JPM right now. Not like wait for a crash to buy. Buy at the current ATH.\n\nThe funny thing about so many avoiding the title is people sometimes max out their Roth in first week of the year so this is kinda relevant about buying into stocks at ATH.", "score": 1, "replies": []}]}, {"body": "I'll be buying probably 50k of one of the Max 7 in after Christmas or early January.  You can wait for a dip like the one they had a year or two ago but that's rare.", "score": 1, "replies": []}, {"body": "Going with the grain isn’t really my style. On the same token, I don’t sell necessarily when it rallies hard and gets back to making all time highs.", "score": 1, "replies": []}, {"body": "I prefer the XM1014 over the MAG-7", "score": 1, "replies": []}, {"body": "If you have enough cash, sell puts. You either get exercised and buy at the price you want and keep the premium. Or just keep the premium.", "score": 1, "replies": []}, {"body": "Personally been very invested in to O and HE. I don’t think enough people have done the research on these companies but after some deep investigation man, they honestly seem like some of the best stocks prepped for the next few years. Not tech big but definitely high potential for growth.", "score": 1, "replies": [{"body": "Why are you bullish on HE? That company has so much risk right now... if they are found guilty it could be catastrophic to it. If it is not though, then it will bounce back significantly no question.", "score": 2, "replies": [{"body": "Because even if they lose the lawsuit they still have the funds to cover expenses and are already extremely integrated in to the Hawaiian 100% renewable energy plan that they would still bounce back to some degree no matter what. Best case scenario though, if they outright win the lawsuit the stock will absolutely soar beyond anyones expectation I’m sure. Still, there’s a chance that the lawsuit neither ends in a total victory or total loss because they are shifting blame to the careless fire departments as well. I’m leaning towards a partial loss but nothing that will sink the company.", "score": 1, "replies": [{"body": "Gotcha. Makes sense. I think I'll throw like $50k into it and see what happens", "score": 2, "replies": [{"body": "Hell yea! Hopefully we have some good luck. It closed out really well today so if you bought early enough you should have a really nice gain :)", "score": 1, "replies": [{"body": "Ya haven't bought yet. Any clue if or when they will start the dividend again?", "score": 2, "replies": [{"body": "Personally, I would just buy in now for the growth and hold for when the dividend is resumed. If you’re main interest is dividends I personally went super hard in to O cause they pay a dividend every month :)", "score": 1, "replies": [{"body": "Makes sense. Thanks! They have to resume it at some point I would think", "score": 2, "replies": [{"body": "Exactly my thought :) did you end up buying in??", "score": 1, "replies": [{"body": "Haven't yet. Waiting on a play on MARA and COIN to pan out first.", "score": 2, "replies": [{"body": "Nice, good luck!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I bought COIN, CRH, DE, MLM, IWM, APLE, and CAT. I don’t believe any of them were exactly at ATH when I bought but very near it.", "score": 1, "replies": []}, {"body": "Litterally every form of investing has people telling you not to do it because of some kind of risk or better way(401kvspension,real estate renting,Divendeds vs growth),I say stick to one thing and see how it plays out, I plan on buying McDonald’s lol idc I see it as the apple of fast food,  I can see it reaching $500", "score": 1, "replies": []}, {"body": "I hate to be Mr. Obvious. But buying stocks based on CPI... isn't that the same as following trends? As in consumers are buying more electric cars so let me invest in electric car companies?? No? I feel like following an index in the stock exchange. Is like following consumer based buying. More or less equates to what's selling now isn't always the same as what explodes on the stock market.. I might be wrong though please correct me if I am...", "score": 1, "replies": []}, {"body": "Nope. The 7 have an incredible moat. They're expensive and dramatic but they perform every fucking time....", "score": 1, "replies": []}, {"body": "Yeah? If I love a company I'll buy it at whatever price as long as I calculated it's worth more.", "score": 1, "replies": []}, {"body": "You know that everything will be near ATH all the time unless there is a recession", "score": 1, "replies": []}, {"body": "I don’t even understand that mentality.  Do you only buy houses and cars that are on sale, or do you find the best deal you can find?", "score": 1, "replies": []}]}
