{"title": "Thoughts on good additions to my infant portfolio", "selftext": "Howdy, I'm starting to get back into trading after a hiatus a few years ago.  I'm not much of a seller, and I tend to pick relatively stable options that don't have a ton of mobility, as I use my account as a form of savings account.  I have a separate growth/ fun account where I take the riskier plays.  So far, this is what my portfolio looks like:\n\n$3,700 total\n\nLMT – 2.25 Shares – 30% of portfolio - $1084 MV - $474 PPS\n\nAXON – 3 Shares – 19% of portfolio - $665 MV - $217 PPS\n\nRTX – 4 Shares – 11.6% of portfolio - $409 MV - $98 PPS\n\nAAPL – 2 Shares – 9.3% of portfolio - $328 MV - $156 PPS\n\nBAESY – 5 Shares – 7.33% of portfolio - $258 MV - $49 PPS\n\nNOC – 0.5 Shares – 7.22% of portfolio - $254 MV - $470 PPS\n\nBWXT – 3.6 Shares – 6.5% of portfolio - $229 MV - $62 PPS\n\nBAH – 2 Shares – 5.5% of portfolio - $194 MV - $99 PPS\n\nRNMBY – 1 Share – 1.7% of portfolio - $60 MV - $58 PPS\n\nBA – 0.20 Shares - 1.0 % of portfolio - $40 MV - $212 PPS\n\n&#x200B;\n\nAs you can see, I'm fairly heavily invested in the defense/ aerospace sector as I feel that Uncle Sam is constantly pumping tax dollars into companies like Raytheon, NG, Lockheed, etc and they also supply foreign military with equipment sales.  They stay relatively stable for me, and dont tend to have massive swings, but I'd like to branch out a little bit into other sectors/ fields.\n\nDo any of y'all have recommendations?  I put in between $600-800 every two weeks when I get my paycheck, and my next immediate move is to get all my partial shares up to whole numbers and then I'll start picking up others.", "id": "12xlx34", "created_utc": 1682350701.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 13, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Qqq should be at least 10% imo", "score": 2, "replies": []}, {"body": "I like Rocket Lab", "score": 2, "replies": [{"body": "Who doesn't 😀!!!", "score": 1, "replies": []}]}, {"body": "Obligatory VOO/VTI recommendation here. Aside from that though it depends on what you’re looking for. Growth? Stability?", "score": 5, "replies": []}, {"body": "I like John Deere", "score": 2, "replies": []}, {"body": "BOWL\n\nIt is currently at $15 but will go much higher in the future.  A long term play IMO. Not pump and dump. Has earning next month so wait and do your DD. The average price target is $21 now. \n\nCEO said Bowling is recession proof. People will pay for themselves and family as cheaper than  parks. Plus people are addicted to it. It is the recreational sport with the most participation in the country. CEO founded company on 1995. \n\nBOWL owns the Professional League, too.", "score": 0, "replies": []}, {"body": "The market is due for a pull back. I'm shorting QQQ right now. So AAPL is due to for a pull back.", "score": -1, "replies": []}, {"body": "The big defense contractor ETF.... ITA... is due for a pull back. Currently trading at 115, but will drop to 107.", "score": -2, "replies": []}, {"body": "Dollar general", "score": 1, "replies": []}, {"body": "More AAPL and then something like QQQ SPY/VOO, NVDA.", "score": 1, "replies": []}, {"body": "This is why doing research before you buy is important. \n\nEverything you bought is either overvalued or could never justify the premium. \n\nYou are essentially betting on the same thing 9 times, why? Pick one\n\nAlso, you missed the pumping. LMT, NOC and RTX already got a massive boost at the start of Ukraine, when they awarded a ton of these contracts.  BA is an utterly shit company . AXON is at a 80 + P/E , yes it's probably the  second\\* \"best\" company you have here but you are begging for a massive drop.\n\nGo re learn fundamentals and evaluation skills. Especially if this is supposed to be long term/savings.\n\n\\*First technically being Apple", "score": 1, "replies": []}]}
{"title": "EU Chips act passed - who will win?", "selftext": "[https://commission.europa.eu/strategy-and-policy/priorities-2019-2024/europe-fit-digital-age/european-chips-act\\_en](https://commission.europa.eu/strategy-and-policy/priorities-2019-2024/europe-fit-digital-age/european-chips-act_en)\n\nASML is a possibility, but I'm worried this is already priced in to the stock\n\nNXP - maybe?\n\nWill NVidia / Microsoft / AWS / Intel / AMD / ARM manage to find a way to be stamped 'made in Europe'?\n\nWho will pull in those contracts do you think?", "id": "12xuudf", "created_utc": 1682367345.0, "score": 36, "upvote_ratio": 0.85, "num_comments": 19, "comments": [{"body": "I don’t know who the winner will be, but I know the loser will be the UK.\n\nStill haven’t developed their own chip plan, falling behind their allies and adversaries", "score": 45, "replies": [{"body": "They benefit from cheaper semiconductor prices long term since their allies are subsidizing supply massively? Maybe every country doesn't need to subsidize things they lack the comparative advantage for.", "score": 10, "replies": [{"body": "At the cost of their domestic semiconductor industry with high skill, high pay jobs. Companies are already threatening to leave for American CHIPS funding and EU equivalent, so they will have to make concessions to keep this industry", "score": 3, "replies": [{"body": "I heard that for the IRA. Didn't realize UK semiconductor industry was that big tbh", "score": 2, "replies": [{"body": "They’re a fairly large player on the chip design side. Similar to the US model where tech companies design the chips and outsource the manufacturing to companies like TSMC. A lot of them are based in Cambridge in an area called Silicon Fen or the Cambridge Cluster\n\nFor example, Arm’s (a UK-based company now owned by a Japanese company today) designs 95% of smartphones’ chips (Android phones).", "score": 6, "replies": []}]}]}]}, {"body": "Nah. They’ll use US chips.", "score": 2, "replies": [{"body": "At the cost of their domestic industry? I’m sure those companies and their thousands of employees will love to hear that", "score": 1, "replies": [{"body": "As chips become more and more advanced, they won’t be able to keep up. Time to import from the big dogs", "score": 3, "replies": [{"body": "Some of these British companies *are* big dogs. Arm designs the chips in 95% of smartphones worldwide. They make chips for basically every phone besides the iPhone", "score": 1, "replies": [{"body": "Fair point, ARM is. But look at all the money the federal government is throwing at US companies. Once you've established that these companies are vital for national security in a tech war against China, you're set. \n\nIt's like buying a weapons manufacturer before a war.", "score": 2, "replies": []}]}]}]}]}, {"body": "Well deserved for their lack of foresight and manners.", "score": 3, "replies": []}]}, {"body": "Infineon Technologies, but they are already way up over the last 6 months since it was obvious who was going to get the initial benefit.\n\nLonger term maybe GlobalFoundries since they are more committed to the EU than most with a large upgraded fab in Dresden already.", "score": 5, "replies": []}, {"body": "SKYT cuz they make chips for fighter jets, medical implants (think of pace makers) & things that go in space/LEO. \n\nThe companies that make chips mostly for gaming systems & computers, idk how likely they are to get funds from this legislation but regardless I’m surprised it took the EU this long to pass this considering the US jumped on it quickly & we’re (our politicians at least) notorious for making issues out of non-issues.", "score": 3, "replies": [{"body": "Nvidia / Amazon / MS are making chips for AI / ML clusters which is why I think they're interesting. Thanks for SKYT, I will look into them!", "score": 1, "replies": []}]}, {"body": "I want ASML price to go down, so hopefully not.", "score": 3, "replies": [{"body": "What is your prediction based on? (I have some ASML stock and am sitting on it for mid to long term)", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 3, "replies": []}, {"body": ">Put in place a framework to increase production capacity to 20% of the global market by 2030\n\nLOL. As a European, if that happens, i'll be surprised.\n\nAt this point, If EU is not willing to bankroll a TSMC/Micron/Samsung/Texas Instruments plant somewhere in EU territory, i'd be surprised if it's gonna happen.\n\n&#x200B;\n\nEdit: maybe Global foundries, and a few smaller ones that are not bleeding edge, but needed. But lets be honest. Bleeding edge is needed.", "score": -1, "replies": []}]}
{"title": "Are we setting ourselves up for a big drop? Everything seems priced to perfection", "selftext": "Warning: don’t let this discourage you from having a productive conversation, but I’m bear who is very upset he didn’t get the chance to deploy his money in fall (lmao)\n\nI cannot help but think everything is priced to perfection and will fall in the next month. I think earnings will be huge, beating expectations, but will still cause stocks to fall whether it’s immediately or delayed. In my view, things are priced for massive beats, far more than is reasonable. That, coupled with the AI bubble, which is pulling up the market, just makes for a dirty combination that I don’t think is sustainable. Only amplified by a looming recession. Historically high PEs for a lot of big tech and healthcare, as well as some financials, staples, and others. \n\nThoughts?", "id": "12xwbv4", "created_utc": 1682370085.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 20, "comments": [{"body": "Are we priced for massive earnings beats? I think the current consensus earnings show no growth from last year.\n\nThe bear case from a permabull — Are valuations a bit stretched if rates aren’t cut? I think so. If rates do go down, are earnings likely to drag down the market? Quite possibly. \n\nI don’t think AI is bubbling yet — NVIDIA is wild but not the entire index.", "score": 7, "replies": [{"body": "Yeah, in the case of Google as an example, for now we’ve probably moved on to where do you think it should be priced on P/E.\n\nIf you think it should be priced lower than it is there because you think it’s done on major growth, then it likely shouldn’t be here, but I know at least one firm is still trying to peg it at a 20 P/E.", "score": 1, "replies": [{"body": "Google’s at 24 or sth? I still think that’s fair enough as someone who hasn’t studied the company in depth — YouTube is still massive, Google is still massive, they got the cash flow to at least copy rivals that they can’t buy. It’s not at truly wild 50-100 valuations which is what I’d consider a full blown bubble.", "score": 1, "replies": []}]}]}, {"body": "Overall I agree with you.  Index and sector p/e’s are relatively high considering the slowing economy, rates, etc.  additionally consumer spending. Has been strong as savings (fueled by government pandemic practices and policies) has been slowly depleting and will deplete sometime this quarter.  You are already seeing borrowing increase rather significantly.\n\nAdditionally:\n1. Oil will remain high now that OPEC+ is no longer a friend of the US.\n2. Core inflation (not total inflation) remains much higher than what FED is trying to achieve.  Expect .25 to .50 increase at least.  Hurts liquidity and increases costs for companies to borrow and invest and therefore hurts earnings for many industries.\n3. Rates aren’t coming down this year, maybe later 2024.  Maybe I’m old for Reddit but 5-6% fed rate isn’t historically high, just recently high.  \n4. AI as mentioned although he careful here, most companies still have a lot of “machine” power from pandemic spending not being used.  I think AI is a late 2024 - 2026 benefit albeit its exciting to talk about.  Additionally a lot of companies are working on their own chip architect so as much as I love nvda and amd, be careful with current valuations.\n\nYou can always look at insurance through options or buy the leveraged inverse ETFs like sqqq, tza, etc", "score": 3, "replies": [{"body": "AI is getting to a point where it's unpredictable now. Gpt wasn't supposed to get this good in few years", "score": 2, "replies": [{"body": "I don’t agree.  It’s more sensationalized but we have been developing it for years", "score": 3, "replies": []}]}]}, {"body": "\n\nMarket has been range bound for one year SP500 3600-4200, weekly chart. We are at the top of that range now. Powell says one more rate hike (0.25) then we stay at this level till 2024. \n\nDoomsday predictions are wrong IMO.", "score": 5, "replies": [{"body": ">Powell says one more rate hike (0.25) then we stay at this level till 2024\n\nNo he didn't. He just hinted at the possibility of no more hikes for now, nothing set in stone at all.", "score": 3, "replies": []}, {"body": "When did Powell say that?  I must have missed it somehow.", "score": 3, "replies": []}]}, {"body": "chatter on twitter is lots of funds and traders are very short. Pain trade could be higher. We’ll see who blinks first", "score": 2, "replies": [{"body": "I bought up some 135p for AAPL in July today. That’s my insurance policy in the near term.", "score": 1, "replies": []}]}, {"body": "I think regardless of bull or bear bias, you need some catalyst to break the current long term range on the market. Commercial real estate? Car loans? Consumer credit? If one of those breaks in a meaningful way we may see a 6 sigma event. Otherwise I’d predict uneventful churn.", "score": 2, "replies": [{"body": "Budget clown fiesta might do it I think.", "score": 1, "replies": []}]}, {"body": "We have had a nice little rally from Christmas, and it will probably be \"sell in May\" this year. I tend to look at Bitcoin as a barometer. It came up from 20,000, and it got to 30,000. Failed that level, and now down to 27,000.", "score": -2, "replies": [{"body": "Some of the comments in this subreddit makes me laugh! Use bitcoin as a barometer for stocks, here's ny recipe for success lol", "score": 7, "replies": [{"body": "I used to use the NASDAQ, but Bitcoin is now the leader, and it has worked for me over the last few years. Every major asset class is linked to each other. It is very probable we are at a crossroads now.\n\nYesterday the NASDAQ closed at 12,037 and the SP500 at 4,137.", "score": 1, "replies": [{"body": "The NASDAQ is down 1.8% today. It is probable we'll retest the 10K point lows. Is there any good news on the horizon?", "score": 1, "replies": []}]}]}]}, {"body": "What fall didn't you deploy your money into? The entire market is up massively since the late 1800's. Key words: \"You're a bear that is very upset.\" LoL🤣. The longer you play this game, the more you will realize that stocks always go up, long term.", "score": -6, "replies": [{"body": "I didn’t have funds ready in autumn, so I couldn’t buy even though I wanted to when the market was way down.", "score": 1, "replies": []}]}, {"body": "Yup. Entered short QQQ last Friday at 316.45. There might be one more push up, but it will be a fake out.", "score": 1, "replies": []}]}
{"title": "Tesla Set To Ship China-Made Model Y To Canada; TSLA Stock Keeps Falling", "selftext": "", "id": "12xgxwf", "created_utc": 1682345168.0, "score": 21, "upvote_ratio": 0.86, "num_comments": 19, "comments": [{"body": "The global EV giant is set to sell a cheaper China-made version of the Model Y in Canada, Reuters reported Monday. The Model Y is Tesla's best-selling vehicle worldwide, and now the company is offering a rear-wheel drive trim in Canada that is more than $7,000 cheaper than the current long-range version in the market.", "score": 8, "replies": [{"body": "Teslas without dual motor written on the back are kind of like the Mercedes CLA. People who drive them are judged harshly.", "score": -2, "replies": [{"body": "Acknowledging some hyperbole, I just want to say, this comment is the most insane,   lunatic drivel I have ever heard in my life.", "score": 4, "replies": [{"body": "Yeah, I have a Model Y LR and I am often envious of my brothers Model 3 SR.", "score": 3, "replies": []}]}, {"body": "Perfect example of stupid gatekeeping.", "score": 1, "replies": []}, {"body": "Nobody cares what vehicle you drive.", "score": 1, "replies": []}]}]}, {"body": "Just keep buying the turn is coming soon and we will all see our gains in a few years and think back when it was under 200 why didn’t I buy more", "score": 6, "replies": [{"body": "Yea you are correct!", "score": 3, "replies": []}]}, {"body": "I guess they don’t want to buy the teslas in China and make it sound like a strategic move in bringing it to Canada, I wonder how the frame will fare in Canada with the rust it will accumulate.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Any stock you're supposed to hold for years.", "score": 1, "replies": []}]}, {"body": "Chinese made cars suuuuuuuck", "score": -4, "replies": [{"body": "Apple iPhone made in 🇨🇳", "score": 9, "replies": [{"body": "Cars are different . I used to live in China … the upper middle class and rich avoid Chinese made cars if they can. They will literally import cars from Europe because of the build quality and control in China", "score": -7, "replies": [{"body": "This logic is not applied to the China Giga Factory. It’s a new facility built by a foreign company. The quality index of vehicles is the same/better than US-made Teslas (older production facility)", "score": 3, "replies": []}, {"body": "That isn't even true anymore, the only ones who import cars from EU now are Porsche everyone else builds them in China as a joint venture. Also lately you will find the Chinese made Teslas have a better build rating than the US built ones. There have been even many Europeans who have compared them. Traditionally you are correct Chinese OEMS suck, as far as Chinese EVs many people seem to prefer them.", "score": 6, "replies": []}]}]}]}, {"body": "More like they can't move them in China so they're going to deeply discount them AND pay to ship them to Canada.", "score": 1, "replies": []}, {"body": "I doubt this is true. Elon has often said he wants the cars built close to where they were made.", "score": 1, "replies": []}]}
{"title": "HODL BEARS", "selftext": "I have being a complete bear since SPY reach almost 420 on Feb. I was trading shorts and puts in overvalue stock like NVDA, LULU, SQ  SPY and playing some longs on AMZN  and GOOGL. Thank god I was able to make some money trading , doubling short possitiong and recovery on the little falls. But I defetenly speacted more from all this fucking stress at least to compensate all the money I have spend on ecitalopram and clonazepan . At this point red futures means shit to me, market probably os going to green by open and NVDA and LULU may be up 2% tomorrow even if RSI is above 80. This market is so fucking stupid that make me a rock with no feeling,  im like a fucking robot now. Night before sleep I register my buy and selling ordes my short and calls for next day. Being a bear has been painfull but logic, math and hardwork at some point pays and biggly.", "id": "12x6man", "created_utc": 1682319467.0, "score": 15, "upvote_ratio": 0.69, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|721|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Hope you're feeling better after unloading all this emotional baggage.", "score": 23, "replies": [{"body": "He doesn’t feel anything.", "score": 6, "replies": [{"body": "The tears are just excess water leaving his body ![img](emote|t5_2th52|30641)", "score": 3, "replies": []}]}, {"body": "The bagged is far more than emotional lmao", "score": 3, "replies": []}]}, {"body": "i started reading but then i stopped and i feel good about my decision", "score": 18, "replies": [{"body": "Story of OP’s life.", "score": 1, "replies": []}, {"body": "I got as far as \"defetenly speacted\" before saving myself the trouble of going any further.", "score": 1, "replies": []}]}, {"body": "Mans can't even spell right and thinks he can outsmart the market", "score": 5, "replies": []}, {"body": "This is called brain-washing 101.\n\nMarkets got retail hooked on bull vs bear crap.\n\nThey \"predict\" months and years in advance.\n\nAnd market whips them 99.99% of the time.\n\nTry trading the hour / day / week in front of you ... might be less painful.\n\nAnd no, predicting markets and buying options ain't hardwork ... that puts you in the same line as the market analysts ... and you should know how wsb feels about them.  \n\n\n**Edit:** OP's posting history is quite comical, sad, and tragic.  It shows the foolishness of predicting.   \n\n\nTake a few minutes to read if you made it this far. Learn. Don't do this: [https://www.reddit.com/user/debian-root/](https://www.reddit.com/user/debian-root/)  \n\n\n&#x200B;\n\nhttps://preview.redd.it/lvbxt1z77vva1.png?width=597&format=png&auto=webp&s=2c39f87a3cddf71786b8562279a4b7b4dcab474b", "score": 6, "replies": []}, {"body": "What most likely will happen is that ER reports are going to be a mix bag, but media will lean it to bullish. Then after JPOW says about pause is on the table, markets moon! Then on 5/10 CPI data comes out hotter, SPY tanks back to 400 to retest lvls. It'll sideways until debt ceiling and tank again initially, then jump up after an agreement is made. Cause USD be dying, then rate hikes come later in the year tanking the whole market. Honestly, just let the market tank and clear out the system once and for all.", "score": 7, "replies": []}, {"body": ">I agree that the market is stupid and that being a bear has been painful, but I think it's important to remember that logic, math, and hard work always pay off in the end.", "score": 6, "replies": [{"body": "Robot, you forgot \"biggly\". That's important.", "score": 6, "replies": []}]}, {"body": "I just sold all my short positions for roughly 30-50% losses because I was sick of looking at them.", "score": 3, "replies": [{"body": "Paper hands boy", "score": 3, "replies": []}, {"body": "Hell yeah always let your losses get well into double digits", "score": 1, "replies": []}]}, {"body": "Instead of day trading and getting your nerves and stress on your heart and mind. Might be best to buy a 2024 mid year put and let it ride", "score": 2, "replies": []}, {"body": "Math & hard work 😂 stfu crazy bear 🐻 the time for bear operations was last year", "score": 1, "replies": []}, {"body": "Markets can stay irrational longer than you can stay solvent as the saying goes. I think risk appetite is a new normal given recent changes in how convenient it is to trade stocks and zero commissions. Maybe last decade’s PE of 10 is today’s 20 given that money is now more disconnected from labor than ever before. Is it a new normal? Fundamentals still important but not as much.", "score": 1, "replies": []}]}
{"title": "Cboe Plans to Launch One-Day VIX After 0DTE Options Trading Boom", "selftext": "", "id": "12xdtxk", "created_utc": 1682338880.0, "score": 53, "upvote_ratio": 0.95, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|2 years ago\n**Total Comments**|726|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "CBOE fucking love money. These people would be handing out black tar heroin to kids in front of their Chicago offices if they could get away with it.", "score": 43, "replies": [{"body": "\n\nWe don't call it black tar heroin no more. We call it caucasionaly challenged tar heroin now. Get with the times, bro.", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4258)", "score": 19, "replies": []}, {"body": "I look forward to having this ability to set my money on fire", "score": 17, "replies": [{"body": "Unfortunately for you degens it isn’t directly tradable.   But it should help those of you who traade zero dte SPX see whether or not the contracts are historically expensive compared to the last week", "score": 6, "replies": []}]}, {"body": "We did it WSB. We fucking did it.", "score": 9, "replies": []}, {"body": "Looks like the targets are retail traders", "score": 3, "replies": [{"body": "Nope. Institutions will make up majority of volume like they do with SPX 0dte", "score": 7, "replies": [{"body": "...like...they....do....always everywhere?", "score": 1, "replies": [{"body": "Nope you think traders were buying up shares of bed bath and bagholders or other ape stock.", "score": 1, "replies": []}]}, {"body": "While liquidity is scarce and volume is thin many arbitrage opportunities will exist. Capitalize for you will tell the tale before the big boys got in.", "score": 1, "replies": []}]}]}, {"body": "One day vix 0dte ? Damn this boi is going to have soo much IV 🤑", "score": 3, "replies": [{"body": "This product needs a derivative for its derivative", "score": 1, "replies": []}]}, {"body": "can't go tits up. ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "can't read very good but i'm in!", "score": 2, "replies": []}, {"body": "My assumption has been the market is being overly driven by options now from a historical point of view.", "score": 2, "replies": []}, {"body": "Vix to 9 confirmed", "score": 1, "replies": []}, {"body": "Oh nice.. die tomorrow instead of die today...", "score": 1, "replies": []}]}
{"title": " How will $META close on Thursday 4/27, after earnings report on Wednesday? ", "selftext": " \n\n&#x200B;\n\nhttps://preview.redd.it/7di0niho2uva1.png?width=760&format=png&auto=webp&s=781d5641803a5259e0c5e89a5458d866a9cbd607\n\nhttps://preview.redd.it/bfuuf1vr2uva1.png?width=960&format=png&auto=webp&s=b2470e260071512ab1c32442377e48e159c28d05\n\n[View Poll](https://www.reddit.com/poll/12xfo8g)", "id": "12xfo8g", "created_utc": 1682342617.0, "score": 2635, "upvote_ratio": 1.0, "num_comments": 18, "comments": [{"body": "This prediction is a go! Get to it, redditors. If you’re not first, you’re last. ", "score": 7, "replies": []}, {"body": "I’m riding SQQQ until we get a tech crash. It’s all fake but these companies are so bloated. I just need a little burp", "score": 4, "replies": []}, {"body": "resolve|22715442", "score": 3, "replies": []}, {"body": "Ugh now we know it'll be a non mover since most are bearish....", "score": 5, "replies": [{"body": "Likely", "score": 2, "replies": [{"body": "Seems it was bullish instead. Well well it was at least not bearish like most thought lol..... Inverse ftw", "score": 2, "replies": [{"body": "Yes definetly would’ve been a good buy. Definetly impressive jump in price. Didn’t play it bc it’s the only stock I just don’t like personally", "score": 2, "replies": []}]}]}]}, {"body": "Meta has solid incomes and should be less affected by poor market guidances. Stilll, no stocks are clear bull in this environment", "score": 2, "replies": []}, {"body": "First republic is Tuesday isn’t it?", "score": 1, "replies": [{"body": "What?", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|12787)", "score": 2, "replies": []}, {"body": "https://preview.redd.it/srbx5ovmczva1.jpeg?width=1080&format=pjpg&auto=webp&s=15b9fe8cfa0e6e09aeea0b2c7ecc52fe60f3b4f3\n\nNope it was Monday After-hours. You are too late my friend.", "score": 2, "replies": []}]}, {"body": "fuck", "score": 1, "replies": [{"body": "Yep", "score": 1, "replies": []}]}, {"body": "Buy WeWork!!!!!", "score": 1, "replies": []}, {"body": "putting 100 tokens on Theta Gang.", "score": 1, "replies": []}]}
{"title": "Tesla raises 2023 spending forecast as it races to ramp up output", "selftext": "", "id": "12xltvp", "created_utc": 1682350618.0, "score": 17, "upvote_ratio": 0.77, "num_comments": 10, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 month ago\n**Total Comments**|165|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Just sharing the article, relax bud.", "score": 2, "replies": []}]}, {"body": "Moving to mass market means new factories, new models and massive spare parts inventory. Suddenly costs balloon and margins plummet. Then you're just another, barely profitable, $50B legacy car manufacturer with $100B debt,  a p/e of 5,  and a   price/book  of 0.7.", "score": 3, "replies": [{"body": "They can't sell existing inventory, and have to lower the price 😂", "score": 1, "replies": []}]}, {"body": "Need it to crash so I can load up", "score": -2, "replies": [{"body": "It dropped 10% over the past week…", "score": 0, "replies": [{"body": "No thanks. Need it gone below $100", "score": 3, "replies": [{"body": "$20", "score": 0, "replies": [{"body": "3×10 pe=30 is right price.", "score": 1, "replies": []}]}]}, {"body": "Probably another 10% this week.", "score": 1, "replies": []}]}]}]}
{"title": "3 ways the $800 billion AI explosion will boost Tesla's stock in the future", "selftext": "", "id": "12xsovq", "created_utc": 1682362915.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|11 months ago\n**Total Comments**|108|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Bullshit", "score": 15, "replies": []}, {"body": "Copium", "score": 16, "replies": []}, {"body": "Tesla stock will rise and fall, as always, not with artificial intelligence, but rather with the very real stupidity of Elon stans.", "score": 23, "replies": []}, {"body": "First robotaxis now this", "score": 8, "replies": []}, {"body": "~~TSLA is a renewable energy company!~~\n\n~~TSLA is a technology company!~~\n\nTSLA is a AI company! <---- you are here\n\n&#x200B;\n\n&#x200B;\n\nTSLA is a car company. Elon keeps promising FSD, Cybertruck, robo-taxis while his cars remain stagnant and competitors continue to gain ground in the EV market.", "score": 8, "replies": [{"body": "Auto market. Tesla is eating it.", "score": 1, "replies": []}]}, {"body": "I don’t care if it owns the world, I need it to hit 180 by June so I can cash out and gtfo of corporate America", "score": 7, "replies": []}, {"body": "Speaking of explosions, a Tesla just exploded while sitting in the dealership (south Florida) parking lot - just sitting there!!!!", "score": 6, "replies": [{"body": "this one? https://www.freep.com/story/money/cars/ford/2023/04/20/ford-f-150-lightning-battery-fire-dearborn-police-video/70134293007/", "score": 2, "replies": []}]}, {"body": "Im not convinced by the article. It seems Tesla will reap from the same ai benefits his competitors will. If anything maybe ai will help the competition more overall, bringing tesla stock down closer to value?", "score": 2, "replies": []}, {"body": "Stfu", "score": 1, "replies": []}]}
{"title": "4-24-23 SPY/ ES Futures, VIX1D and VIX Daily Markets Analysis", "selftext": "NOTE- I will be gone from trading tomorrow on my kids field trip… should still have a nightly TA up though. \n\nLets start off with VIX1D and with today and its first days launch… \n\nSomeone in the group posted this and I found it to be hilarious… The fact that a VIX1D with a pretty clear in my opinion measurement and it “baffled” them just makes me laugh. \n\n&#x200B;\n\nhttps://preview.redd.it/mcnlu1mzkwva1.png?width=975&format=png&auto=webp&s=b7524e817c661513bad252951a0d239b7e858942\n\nHonestly I found the VIX1D to be extremely helpful paired with my already current scalping and level to level strategy. I am actually really looking forward to using the VIX1D more as we go forward. \n\n**SPY DAILY SUPPLY AND DEMAND** \n\n&#x200B;\n\nhttps://preview.redd.it/ldens070lwva1.png?width=975&format=png&auto=webp&s=b1a91baf52dd2dfecd770433434eef103aa7d501\n\nI mentioned last week that I felt that SPY supply and demand was showing an imbalance and well today we actually partially fixed that imbalance. We actually did an extreme bullish thing and turned daily supply at 412 into daily demand (support). With that and a recovery back over the daily 8ema our upside target now moves to 414.22. \n\nHowever, the trend lately seems to be putting in quick supply and demands back to back… Looking at physical price action (especially futures) its very indecisive. \n\n**SPY DAILY PRICE ACTION**\n\n&#x200B;\n\nhttps://preview.redd.it/cq07f2r0lwva1.png?width=975&format=png&auto=webp&s=ec454d985f3cad236c11dd0f9b6c165d418aaa7d\n\nIt is hard to tell in this image but the red lines actually form another rising wedge inside of the black longer time frame rising wedge. \n\nSomething that is very interesting when we look at price action over the last 15 trading days is that on SPY 6 of those have been doji candles, the last 15 trading days has all closed within a $9 range and the last 8 trading days has closed within a $4.3 range with half of those candles closing as dojis…\n\nWhile we did retake the daily 8ema here I think I would be neutral to bullish here and even if there is upside to be expected tomorrow based on the last 3 weeks of trading the upside is very limited. \n\nThis $9 range has a support at 406.5 and resistance at 415.5 inside of that range is just chop.. Also have a 8 day long support at 411.1 to keep an eye on too. \n\nHonestly the last 3 weeks of SPY feels like the 1130am to 230pm trading slot during the day where SPY keeps showing its going to breakout or breakdown but in the end it just ends up being yet again another fake out. \n\nSPY Daily Levels  \n Supply- 415.4 -> 417  \n Demand- 412 -> 414.2  \n Support- 411.9 -> 409.6  \n Resistance- 412.6 -> 414.1 -> 415.5.\n\n**FUTURES DAILY SUPPLY AND DEMAND** \n\n&#x200B;\n\nhttps://preview.redd.it/nsej0291lwva1.png?width=975&format=png&auto=webp&s=43a11fe30792126500d894b7bcdefa9ccd21e223\n\nFutures with that yet again EOD run up managed to put in a new demand… this seems to be a strong theme here on SPY and futures where the last minute of trading defines the day… \n\nBut with a new demand (support) put in at 4153 our upside target should be a retest of supply (resistance) at 4178. \n\nI love my supply and demand but I also recognize that not every market is perfect for it… with this choppy indecisiveness going on S/D is not playing out nearly as nicely as before… however, I will say looking at Futures right now we have defined the 15 day range period perfectly… \n\nWe have a supply (resistance) at 4198 and 4178 and we have demand (support) at 4116 and 4153. We have a pretty clear cut defined area here. \n\n**FUTURES DAILY PRICE ACTION** \n\n&#x200B;\n\nhttps://preview.redd.it/o7k361q1lwva1.png?width=916&format=png&auto=webp&s=7bbbb0176a33921da61390fdfa6d0b8d990a9b0a\n\nNow on futures we have actually closed 12 of the last 15 trading days as some form of a doji all within a 67 point range… and over the last 8 trading days we have closed 6 dojis within a 31 point range. This is extremely tight and I would imagine whenever we finally pick a direction and move it will be pretty explosive… \n\nI do wonder now with FOMC next Wednesday already if we just continue to chop in this same pattern. We also have big tech earnings over the next three days which also could define the market. \n\nFutures did retake the daily 8ema today but we have often times seen a pattern like this turn immediately back into a failed breakout/ double top… there is a potential to turn 4160 into a double top and attempt to push back to 4130-4140 tomorrow. However, if bulls can keep up the momentum then our upside target would be 4178. \n\n**VIX1D/ VIX**\n\n&#x200B;\n\nhttps://preview.redd.it/7q35jod2lwva1.png?width=667&format=png&auto=webp&s=74fd44abe4ba1f59174b2ad47b233b8a85572117\n\nOne thing that intrigues me for tomorrow about VIX1D is that EOD we had a massive pump to HOD on the VIX1D… however, we also had a huge EOD 5min candle. My thoughts are now that we have this VIX1D tool is can we predict the next days movement or not… so with EOD pump will we see overnight downside or will we be left once again with upside? \n\nI do play to do some daily charting on VIX1D much like on VIX but we need at least a few weeks of candles before we can start making any sort of educated analysis… \n\nAlso for those of you having trouble finding the VIX… on TOS its live data and free… but you have to type it into the ticker symbol search “VIX1D” and hit enter… it will not populate on search… on TV I noticed the data is about 20 minutes behind… I do pay for live data on TV but they grouped the VIX1D under the “CBOE Global Indices Feed” which is not apart of the standard live data most will have. \n\n&#x200B;\n\nhttps://preview.redd.it/j3hqt0z2lwva1.png?width=975&format=png&auto=webp&s=0ce793b03896a825c51bba8ae93327359ed0835b\n\nThe VIX one again saw a massive drop. One thing that was interesting to me and a big of a change of pace from the normal is that the VIX opened nearly 4%+ and had began to sell off only to see a midday reversal back up. For a while it did appear that we were going to see the VIX clos over the daily 8ema, however, by EOD once again the VIX sold off as SPY rose. \n\nWe still are holding the bear channel and the potential V bottom/ breakout triangle support will sit at 16.76 tomorrow and resistance will be at 18.24. \n\n**DAILY TRADING LOG**\n\n&#x200B;\n\nhttps://preview.redd.it/huc7qud3lwva1.png?width=677&format=png&auto=webp&s=c7730938270463837cf4fdb4019a4bd7fb603cc4\n\nToday was a really solid day of trading. I struggled a little bit at open getting caught in both puts and calls stop losses. But was able to make it up on the morning sell off… I told myself after the last 2 weeks of getting absolutely ate up during the middle of the day that I was not going to let that happen today. I did give back a little bit of profits but nothing too bad.\n\nAll in all covered about 60% of my weekly goal profit wise today which is super nice considering I wont be trading tomorrow. \n\nI remain in my 88dte 405p on SPY and remain increasingly frustrated by them… SPY was only up 0.1% today yet my put lost nearly 4%.... I do see some potential upside but I will not be averaging down on this for a while at least. I would need to see 420 to average down and at this point I still don’t think anyone can convince me that by middle of July SPY wont have retested 390-400 area which with the expect VIX rise would put me nicely into profits.", "id": "12xxsy7", "created_utc": 1682372978.0, "score": 19, "upvote_ratio": 0.75, "num_comments": 15, "comments": [{"body": "Man I made a real killing from 3/20 to 4/20 when the $spy was actually moving outside of the previous day’s range on a daily basis. I recognize we just range trading and that’s my weakness, so I’m actually sitting on the sidelines for now until we break one way or the other.\n\nProp to all the range traders making money right now. This is not my style to trade, can’t let winners run in this environment right now. But eventually we will break one way or the other.", "score": 3, "replies": [{"body": "I like to think i make money in any market and im always getting better but i know range days like these i make a killing... extreme momentum days when we just ride 5ema from open to close is when i severly struggle", "score": 1, "replies": [{"body": "That’s very true! I will use my demo account to create a tradebook for this type of environment so that i have a strategy for every single environment and make money!", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Read as much as you can about options first so you dont waste $500 for no reason", "score": 4, "replies": []}]}, {"body": "Do you know what caused the drop in the morning?", "score": 2, "replies": [{"body": "I saw someone retweet something from russia about escalation but thats it", "score": 2, "replies": [{"body": "Today's Economic Calendar\n\n8:30 Chicago Fed National Activity Index\n10:30 Dallas Fed Manufacturing Survey\n\nFrom Seeking Alpha... I believe the manufacturing numbers disappointed.", "score": 4, "replies": [{"body": "That explains it. Thank you", "score": 1, "replies": []}]}]}]}, {"body": "Was watching a show today where someone pointed out that IV is projecting a 50/50 chance futures stay between 4100 and 4200 thru the day before FOMC. And then on Fed day it changes to a 60% chance we’re either below 4100 or above 4200.\n\nSo yeah, I bet all we get is more chop until then.", "score": 2, "replies": [{"body": "I believe there last friday was only about a $6 total intraweek move expected on SPY", "score": 1, "replies": [{"body": "So hard to trust these small implied moves after living thru last year lol\n\nLooking forward to your TA on VIX1D once we get more data", "score": 2, "replies": [{"body": "Im still waiting for the rogue $10 day \n\nMe too. Today it was very helpful intraday", "score": 2, "replies": []}]}]}]}, {"body": "Thanks for the work. Enjoy the field trip!\n\nI caught the bad data dump with a TSLA Put from .36 to .96. I usually just do SPY but it has been tough lately so switched it up today. MaggieP", "score": 2, "replies": []}, {"body": "Lol.", "score": 1, "replies": []}]}
{"title": "Market recap - 4/24/23 - Everyone is FOMO but also worried AF", "selftext": "**The Fed**\n\nTLDR, consumes are financially strong and spending, no reason for rate cut this year, yet.\n\nBlackout week for the Fed, but my thesis remains the same. There is a 100% probability of a May hike, and the rate will stay higher for longer.\n\nAccording to GS' data, credit card spending barely changed from last year, and personal financial stress is stabilizing.\n\nhttps://preview.redd.it/uuzi8jrsmwva1.png?width=936&format=png&auto=webp&s=e9db7dedc5c0ae818ecc1444ee852038f9be316d\n\nThe credit card delinquency rate is a little higher than before COVID in the young age group, but overall, it is still fine.\n\nhttps://preview.redd.it/m7fraantmwva1.png?width=936&format=png&auto=webp&s=176dbf5ebe8d4ad98db28e530f40ba78ddfa98a2\n\nConsumers are financially in great shape, except that nobody believes they are!\n\nhttps://preview.redd.it/hjecqm1vmwva1.png?width=936&format=png&auto=webp&s=a7cb0921d1ce0a499f68555517188e878a172bd5\n\nWith China loosening its monetary policy to stimulate growth, industrial metals are poised to rally this year, adding pressure to inflation.\n\nhttps://preview.redd.it/wcpdxdfwmwva1.png?width=936&format=png&auto=webp&s=f79e0db88d0bf889a16bb71dea8b541b0506af21\n\n&#x200B;\n\n**The Economy**\n\nTLDR, more negative economic data today, but the trend is similar to last week. Economic activity is weak but showing some signs of bottoming. It's still too early to talk about recovery.\n\nThe Chicago Fed National Activity Index (CFNAI) was unchanged at –0.19 in March.\n\nhttps://preview.redd.it/kujzquixmwva1.png?width=936&format=png&auto=webp&s=4309ee37e4b6443cfa815e67eae4d9e7d5f5502e\n\nManufacturing production deteriorated in March. Sales, orders, and inventories were still declining, but they were better than last month. Employment was up, and the unemployment rate ticked down to 3.5 percent. Personal consumption and housing NAI deteriorated further.\n\nThis year's tax receipts are tracking weaker than last year, contradicting the wage growth trend. However, this may have to do with the income range change in each tax basket.\n\nhttps://preview.redd.it/2e0mbsbzmwva1.png?width=936&format=png&auto=webp&s=3675dd7e9175a3eceed2f799d18d50104339aff1\n\nThe Dallas Fed reported today, and it was added to the chart posted over the weekend. Basically, the same story; things are still bad, but we might have reached the bottom or will be there soon. That being said, the business outlook from survey respondents is either neutral or bearish, indicating that a recovery might not have come yet or may not come anytime soon.\n\nhttps://preview.redd.it/yakyfyo0nwva1.png?width=936&format=png&auto=webp&s=f956983a4dd72249077ea89fc35e032a5b5d0c79\n\n&#x200B;\n\n**The Business**\n\nTLDR, everyone is FOMO but also worried AF.\n\nTraders are extremely bearish on stocks and Treasury bonds. These are probably all hedges, so they are all fully loaded with stocks and ETFs from FOMO, but everyone is worried that something bad is going to happen soon.\n\nhttps://preview.redd.it/eofe62n1nwva1.png?width=936&format=png&auto=webp&s=4de369b02d09b7f03eabae0afcfa62f6efab1d85\n\nhttps://preview.redd.it/xfjuu5a2nwva1.png?width=936&format=png&auto=webp&s=c1177e182cf3ff005293ef27a8124679d69ca583\n\nGS has a buy rating and $200 price target on AAPL, citing strong iPhone demand that will offset Mac losses.\n\nhttps://preview.redd.it/h23e3b83nwva1.png?width=936&format=png&auto=webp&s=a6a8bb0c4f7143757d8554ff11b56cba8260f2fb\n\nGS portfolio strategy recommendations by sector:\n\nhttps://preview.redd.it/kclvc8f4nwva1.png?width=936&format=png&auto=webp&s=9f7ef228d433814d41b6dd88502e61e563786df5\n\nGS also expects PE multiple contraction down the road, and their year-end price target is 4000.\n\nhttps://preview.redd.it/tuyvern5nwva1.png?width=936&format=png&auto=webp&s=e77c5d4e977fc74e8538e84514ac7fc66d0c1fa7\n\nMy positions have not changed. These daily grinds are killing me.", "id": "12xy5oj", "created_utc": 1682373683.0, "score": 19, "upvote_ratio": 0.79, "num_comments": 12, "comments": [{"body": "AAPL to $200. SPX to $5000 EOY. LFG - This message was sponsored by GS. We know what we are doing to you, the economy and our money.\n\nAnother great post. Keep up the good work.", "score": 8, "replies": [{"body": "Thank you. Not much going on today. The market is geared up for something big to happen.", "score": 3, "replies": [{"body": "As long as I am on the money making site, it is all good. Looking how the market has changed with 0DTEs and now we have 1D VIX, having long term bets makes no sense. Dig daily, drink or drown, that is what I feel is the way.", "score": 5, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}]}]}, {"body": "“Everyone is FOMO but also worried AF”\n\nThis is a good summary of the stock market every day every year", "score": 7, "replies": []}, {"body": "I am a bot. You submitted a picture of a banned ticker, DMA.                                The market cap of DMA is **62,294,511**                                This check will fire if you included unnecessary pictures that have bad keywords/phrases. Repost with the useless pictures omitted if you did that.", "score": 2, "replies": []}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "[https://www.dallasfed.org/research/surveys/tmos/2023/2304](https://www.dallasfed.org/research/surveys/tmos/2023/2304)", "score": 1, "replies": []}]}, {"body": "Rate cut*", "score": 1, "replies": [{"body": "no cut", "score": 1, "replies": [{"body": "You have a typo in one of the first couple paragraphs", "score": 2, "replies": [{"body": "ah found it. Thank you!", "score": 2, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "12y0j9h", "created_utc": 1682378800.0, "score": 18, "upvote_ratio": 0.8, "num_comments": 12, "comments": [{"body": "We’ll get our volatility spike well before December. Question is how long does it take to question your decision? 😂", "score": 8, "replies": []}, {"body": "It’s going to reverse split by then and you might be stuck with poor liquidity non-standard options. \n\nSomething to watch so you avoid it.", "score": 4, "replies": [{"body": "I can just exercise early though, right? Ideally, I want to wait for the reverse split, but I don’t want to miss buying low.", "score": 2, "replies": []}]}, {"body": "Lol this is the most bullish indicator I’ve seen. JP Morgan about to create a bunch of bear bag holders.", "score": -2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|2 years ago\n**Total Comments**|305|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "paywall bypass does not work", "score": 1, "replies": [{"body": "Works for me, I just tested it again. Here’s copy-paste:\n\n>The abnormal sense of calm signaled by Wall Street’s favorite volatility gauge could spell trouble for investors who see the market lull as an all-clear to buy stocks, according to JPMorgan Chase & Co.’s Marko Kolanovic. The bank’s top equity strategist said Monday in a note to clients that the drop in the Cboe Volatility Index, or VIX, is technical in nature, rather than an accurate reflection of the risks facing the stock market. The VIX held near 17 on Monday after falling to 16 last week, a level not seen since late 2021. No Fear | The VIX has been subdued over the past year relative to prior bear markets\n\nhttps://preview.redd.it/aps7zofzwyva1.jpeg?width=1200&format=pjpg&auto=webp&s=4353048b97e6368866235d2574cfee01c9b4fdf3\n\n>Kolanovic attributed the decline in the measure to a market currently dominated by options sellers forcing intraday reversion and leaving market prices virtually unchanged most days. “This is unusually low given the increase of interest rates, tightening of financial conditions, level of macro risks, and elevated geopolitical tensions,” he said. “This market dynamic artificially suppresses perceptions of macro fundamental risk.” Some investors have questioned the reliability of the gauge, which barely budged last month even as turmoil in the banking sector wreaked havoc on US stocks. >Analysts have attributed it to a jump in zero-days-to-expiry — or ODTE — options. The rise in short-term trading even inspired Chicago-based exchange operator Cboe Global Markets Inc. to create a one-day version of its popular measure, which launched Monday. Kolanovic echoed doubts around the VIX as a dependable indicator for stock investors, calling it “dislocated” relative to other options markets, short-term rates and the macroeconomic backdrop. “This is an anomaly, and the current low VIX levels are unlikely to be sustained for long,” he said. The strategist advised investors to use any market strength spurred by upcoming earnings reports as an opportunity to reduce equity exposure. One of Wall Streets biggest optimists during much of last year’s market selloff, Kolanovic has since shifted his view, cutting the equity allocation in his bank’s model portfolio in mid-December, January and March due to concern about the economic outlook.", "score": 4, "replies": [{"body": "This is great news. Maybe the options traders will keep the market going sideways long enough for inflation to come down and the Fed to cut rates. Then it’s straight back up. Bullish!", "score": 1, "replies": [{"body": "Not impossible. Even though I have mostly bearish trades, I would much prefer rate cuts and a bull market, my day job benefits greatly from it.", "score": 3, "replies": []}]}, {"body": "Thanks for reproducing the contents. He is partially right, i.e, skeptical view of market sidelines, but I clearly sense the calmness before the Strom kind of silence and sold all my holdings to cash mode. In some cases, holding SQQQ and even Jan & Jun 2024 QQQ strike=320 puts.\n\nRegarding VIX, going down low to low may be another 7 days, and then spikes at FOMC meeting.\n\nIn addition, Yield curve is going too negative which is scary bearish.", "score": 1, "replies": []}]}]}, {"body": "I see you like losing money slow.", "score": 1, "replies": [{"body": "I have shorter term calls that have lost money quickly, so I guess losing slowly would be an improvement", "score": 2, "replies": []}]}]}
