{"title": "Is Kroger (KR) a good buy right now?", "selftext": "I was hoping to get some insight on what people thought about Kroger currently. Especially after the Amazon/Whole Foods purchase and their lowered quarter returns. I actually wrote an article stating my opinion if anyone is interested in reading it, but mainly wanted to see what other people's thoughts are.\n\nedit: Here is the article I wrote if anyone is interested in reading it.\n\nhttp://thriveculturemedia.com/investing/kroger-is-selling-at-wholesale-prices/", "id": "6k854c", "created_utc": 1498740881.0, "score": 27, "upvote_ratio": 0.87, "num_comments": 25, "comments": [{"body": "I bought a lot of it after the dip. Even if it only recovers half of the dip, it's still a great purchase imo. ", "score": 13, "replies": [{"body": "Same here. it's already up about 10% for me. ", "score": 2, "replies": []}, {"body": "Couldn't agree more. I think the market reacted harshly and there's easy money to be made.", "score": 1, "replies": [{"body": "Totally. The company lost ~20% of its value over night. It's a huge over reaction. And Kroger has already started to recover. I bet within a year we'll see 50%+ of the losses recovered. ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I'm gonna hold onto it. Seems like a pretty good company. Solid financials. ", "score": 1, "replies": []}]}]}, {"body": "I will continue to grocery shop at King Soopers, Kroger's Colorado brand, regardless of whatever witchcraft Amazon & Whole Foods perform. My opinion is that grocery shopping is a thing people like to go do at the store. I like to inspect my apples before I buy them, pick out a steak, etc. I think the drop was an overreaction and that Kroger will be fine. \n\nI could be completely wrong though.", "score": 10, "replies": [{"body": "Keep in mind people used to think the same thing about clothes, banking, mail, etc. I'm not saying it's an exact relationship, but KR over the next year is very different from KR over the next 10.\n\nThat said, I think Kroger is a quick buck right now :)", "score": 5, "replies": [{"body": "Oh for sure. Totally agree", "score": 1, "replies": []}]}, {"body": "That was my thought process also. Completely unsure of what Amazon is going to do with Whole Foods but one thing's for sure is that it won't be an overnight process to get Whole Food's logistics up to par.", "score": 3, "replies": []}]}, {"body": "this is purely anectodal but it is by far my favorite grocery store to shop at.\n\nStores are well managed/clean, lines are short, good selection etc.\n\nNot sure from a stock/business perspective how they are doing but they will continue to get my business.", "score": 2, "replies": []}, {"body": "Grocery and retail are undergoing a sector rotation.  If you think Kroger will survive that rotation, then by all means, buy. ", "score": 2, "replies": [{"body": "I definitely think they will survive any rotation, the only thing I'm worried about is how hard it will hit them in the short term.", "score": 1, "replies": [{"body": "Then in your opinion it's a buy. Be prepared to average down, as this sector rotation is still happening, and more corrections could come. If you think it's a pony you want to ride, then ride it.", "score": 1, "replies": []}]}]}, {"body": "Kroger has a great valuation and are investing into some serious technology. Plus This is one stock that actually went up in 2008. ", "score": 1, "replies": [{"body": "Haven't really read too much about the technology they are investing in but WSJ has a great article on how they plan on using cameras and infrared sensors to monitor foot traffic and decrease wait times. Thanks for the input!", "score": 2, "replies": []}]}, {"body": "KR looks a good buy at such range. I'd buy and wait for the market stabilization. ", "score": 1, "replies": []}, {"body": "it might be a hold,but its not a buy", "score": 1, "replies": [{"body": "What's your reasoning for giving it a hold rating?", "score": 1, "replies": [{"body": "if you are holding that stock then you might as well hope for something good and continue to hold. That is what he means. Cuz that shit is sinking.", "score": -2, "replies": []}]}]}, {"body": "Buy like crazy", "score": 1, "replies": []}, {"body": "For long term no, but short term it could be a good idea.", "score": 1, "replies": [{"body": "why", "score": 1, "replies": []}]}, {"body": "Don't like their long-term prospects. Increasing competition from Aldi and Lidl. As well as Target, Walmart, Amazon. ", "score": 1, "replies": [{"body": "I see Aldi being a bigger competition especially with their low priced organic produce, but Lidl is just starting in the US. I think it will take Lidl a while to create a good customer base to compete on Kroger's level.", "score": 1, "replies": []}]}, {"body": "Here is the article I wrote if anyone is interested in reading it!\n\nhttp://thriveculturemedia.com/investing/kroger-is-selling-at-wholesale-prices/", "score": 1, "replies": []}]}
{"title": "Daily BAC thread", "selftext": "[deleted]", "id": "6k867g", "created_utc": 1498741219.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 22, "comments": [{"body": "24Cs are going to be 3 baggers overnight", "score": 6, "replies": [{"body": "Ayyy I have 24 calls that will hopefully cover my RADical losses", "score": 1, "replies": [{"body": "my 1000% gains can't cover my losses ripppppppppp", "score": 1, "replies": []}]}, {"body": "You think?  I have July 28th, 24calls.  Hold them bitches tight?  ", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "Do you have a price target for these? We haven't seen what they do when BAC goes over $25, but I thought the main mover on this was the tax cuts that Congress hopefully gets to in the next year", "score": 1, "replies": [{"body": "Hard to say caz they r super otm. They have a strike of 31 which could happen or not ", "score": 1, "replies": []}, {"body": "Back in early March, BAC was trading low $25. BAC+Bs were around the $1.50 range.  I'm curious as to what their value would be if it makes it that high again.", "score": 1, "replies": []}]}]}, {"body": "Anyone think BAC is a good long term hold?", "score": 3, "replies": [{"body": "sure", "score": 1, "replies": []}]}, {"body": "$C is also in blast off!", "score": 2, "replies": []}, {"body": "Aw yiss. Hold.", "score": 2, "replies": []}, {"body": "So since the banks are going to have a rally today, what sectors are gonna dip?  It looks like the drug stores are taking a hit today because of the RAD deal, but where else would value investors pull their money from to cash in on dividend earnings?", "score": 2, "replies": [{"body": "Tech. Probably fill the gap from Wednesday morning. 1.5% drop?", "score": 2, "replies": [{"body": "Looks like it.  Most companies seem to be taking a 0.75% - 2.5% drop at the moment.  Even Micron seems to be taking a hit pre-earnings release.", "score": 1, "replies": []}]}]}, {"body": "I wonder how much this [worth 24.5 fd](https://imgur.com/gallery/UgvEr) ", "score": 1, "replies": [{"body": "its 0.13 in the money right now, so that's gotta be some nice gainz!", "score": 1, "replies": [{"body": "Yup selling 5 mins after the bell. I wonder if I break even from my rad fail", "score": 2, "replies": [{"body": "Sell now, $0.28 for the suckers!  And it just keeps going up!", "score": 1, "replies": [{"body": "Dumped for .24 I need cash to close my rad leaps. ", "score": 1, "replies": [{"body": "Puts or calls?\n\nBtw, for this math, I'm surprised the stock is hurting as bad...\n\n5.4 B in cash\n\n5.1B in stores\n\n-7.3B in debts\n\n2B in pharmacy (EnvisionRx (seen it valuable up to 5B))\n\nPutting this together $RAD should be much higher than it is....", "score": 1, "replies": [{"body": "I sold a bunch of rad leap 4 and used the cash to buy July 4 calls. Closing the 4 calls for a lot less than I got them but my July calls r worthless. ", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "Just switched from VZ to TMO", "selftext": "[deleted]", "id": "6kahab", "created_utc": 1498762509.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 21, "comments": [{"body": "Plebs have T-Mobile. \nWhat issue could you have with Verizon. \nSeriously. Best service I had after back in the day Nextel (before Sprint)\n\nI pay $100 for two lines. ", "score": 5, "replies": [{"body": "Paying $95/month for unlimited Data on a single person cell-phone plan. Verizon offered to cut the plan down to $88/month.\n\nT-mobile is $70/month for unlimited data and I can use it when I go to Germany with the GF just like I would here in the states.", "score": 2, "replies": [{"body": "Same here. Never had a problem with t mo coverage. And I got them because it was cheaper, they've had better customer service, and that text and international data is fucking awesome. Used in across Europe and Asia, as well as the Caribbean with no issues. Data in Japan was 10x better than US  though. Fuckers. ", "score": 2, "replies": []}, {"body": "This exactly with T now, one line $95 unlimited everything. \n\nNow that I have a wife, we will be switching to TMUS very shortly.", "score": 2, "replies": [{"body": "$100 for unlimited data for 2 lines w/TMO. Make sure to switch before July 27th when they report earnings and decreased customer numbers and my put makes some money", "score": 1, "replies": []}]}]}, {"body": "T-Mo service is getting better for coverage, and I find their international service indispensable. Same service in Canada and Mexico, free text and 2G-speed data elsewhere. Truly the phone plan of the global financial elite.", "score": 1, "replies": []}, {"body": "$100 for two lines? What do you have, like 2 gigs of Data? ", "score": 1, "replies": [{"body": "20 a month shared but I don't live in bum fuck so wifi everywhere", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Try taking a call in downtown elevator on t mobile. Good luck. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "My Nextel and Verizon services have yet to do that. \n\n-_-", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I switched my business from VZ to T-MOBILE a few months ago, after being a Verizon customer for 10-15 years. \n\nService in the metro areas is better than VZ. Unfortunately, once you get out of the city and/or inside buildings, the service is significantly worse. The price is soooo good though. $30/line with unlimited data. \n", "score": 2, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I'm at $130 including taxes & fees for 4 people -TMO", "score": 1, "replies": [{"body": "That can't be the unlimited plan? Unlimited is about $160 for 4 people. ", "score": 1, "replies": [{"body": "Unlimited talk and text. 2GB 4G LTE. Use wifi mostly. ", "score": 2, "replies": [{"body": "Ah I see, I used to be on that Plan but had to upgrade to the Unlimited Everything deal to do the free upgrade to Iphone 7. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "30GB used before throttling for TMO\n\n22GB used before throttling for T\n\n", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Only ding is its not stellar in my office building, but I have wireless so thats not an issue.\n\nTheir coverage is decent if you're in or around a major MSA. There's some random dead spots in the country on the way to the river I float but thats fine with me.", "score": 1, "replies": []}]}]}]}, {"body": "I had Verizon and swapped to T-Mobile due to price only. I swapped back after 2 years.  T-mobile had horrible customer service.  9 out of 10 times you can hardly understand the rep if you're not talking to someone in sales.  Most calls are routed overseas.\n\nIn the city the service is great, out of the city it is horrid.  You can drive state to state and never lose service.  You detour more than 15 miles off the interstate you'll have no service!  ", "score": 1, "replies": []}, {"body": "If you're a data hog, T Mobiles Wal-Mart exclusive plan. For everyone who actually knows how to connect to a WiFi signal at work, there's Project Fi, which is far cheaper than the competition with data usage on a metered scale.", "score": 0, "replies": [{"body": "But mah Iphone....", "score": 1, "replies": []}]}]}
{"title": "Nike tops Wall Street expectations; confirms deal with Amazon", "selftext": "", "id": "6kbo0g", "created_utc": 1498773251.0, "score": 38, "upvote_ratio": 0.91, "num_comments": 19, "comments": [{"body": "oh shit nike earnings were today?  why was everyone playing MU", "score": 17, "replies": [{"body": "Someone on here talked about it yesterday and someone told him to fuck off lol ", "score": 42, "replies": [{"body": "[That guy IRL](http://imgur.com/egauTvK)", "score": 10, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "lol if you think MU isn't making gains in the next week you shouldn't be in the market", "score": -7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lmao. PE is gonna be under 6 in a booming sector, youre drunk man", "score": 6, "replies": [{"body": "Guys please shut the fuck up about MU and RAD, we're talking about NKE here\n\nPussy, you are probably right but keep in mind that a long weekend is coming up.  I'm guessing that a lot of people will be taking profits tomorrow.\n\nPersonally, I hope semiconductors keep bleeding because I'm looking to buy", "score": 12, "replies": [{"body": "Everyone is looking to buy semis, just been a rough couple days for tech as a whole, MU will be up 10% + come Wednesday if anyone here can manage holding something more than 15 minutes without panicking", "score": 8, "replies": [{"body": "I'm with you there.  Barring major incident, I think that next week we will see a nice rip.", "score": 3, "replies": []}]}, {"body": "Looking for that SOXL discount after reversal", "score": 0, "replies": []}]}]}, {"body": "Retard.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yeah Nike goes up 7%...\n\nMU just goes up enough for me to buy a 5 dollar foot long \n\nEdit: up 10% and then more I'm sure ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Except MU, ...probably. ", "score": 1, "replies": []}]}, {"body": "Time to short footlocker ", "score": 5, "replies": [{"body": "No, time to buy footlocker. They're going up with nike. They are sitting around 52 week lows right now. Their stock price dropped 30% since their earnings when they met eps and missed rev by 2%. I've been watching the stock since then, waiting for the right time. I think it's a good time right now, they move with nike.", "score": 0, "replies": [{"body": "Interesting. Will keep a watch on this, so thanks for the potential tip.", "score": 2, "replies": [{"body": "I wouldn't yolo it, but it should be a decent time to buy.", "score": 1, "replies": [{"body": "Interesting, I saw the new deal with amazon as a test run for their full line in the future potentially but I like what you're saying here. ", "score": 2, "replies": []}]}]}, {"body": "It's time for AMZN to buy Footlocker.      \n      \nOr mimic Zappos and send Footlocker to their graves. RIP.", "score": 0, "replies": []}]}]}, {"body": "Just so everyone knows, the deal with Amazon is just for \"select\" items, so it's not like this completely groundbreaking. Might be a good long term hold if they do fully allow shopping via Amazon.", "score": 2, "replies": []}]}
