{"title": "Is anyone buying Meta's stock?", "selftext": "Warren Buffett once said that it is wise for investors to be “***fearful when others are greedy, and greedy when others are fearful.***” Is this the right time to buy Meta's stock for pure profit? Should I wait? Are you waiting?\n\nWhat's your opinion on this?", "id": "yizj6b", "created_utc": 1667279558.0, "score": 12, "upvote_ratio": 0.54, "num_comments": 226, "comments": [{"body": "Someone must be buying if someone is selling", "score": 142, "replies": [{"body": "can I sell to myself?", "score": 2, "replies": [{"body": "Sure create accounts at 2 brokerages and put buy and sell orders", "score": 0, "replies": []}]}, {"body": "Look at its chart.\n\nWay more selling than buying thank god. I'm personally enjoying seeing the stock getting run to the ground.", "score": -12, "replies": [{"body": "Can't have more selling than buying. It's a transaction takes two to tango", "score": 77, "replies": [{"body": "What if people keep closing buy orders while the sell orders keep going lower and lower?\n\nYou can have stock fall without any buyers", "score": 4, "replies": [{"body": "A stock is priced based on its last trade. The direction of movement of a stock depends on who \"takes the liquidity\". I.e. Who jumps over the bid ask spread. So if more sellers are selling at bid rather than buyers buying at ask, the stock price will fall", "score": 1, "replies": []}]}, {"body": "Are we doing this pedantic thing? Way more people want to sell than people wanting to buy.", "score": 15, "replies": [{"body": "That makes no sense the market is very liquid buyers and sellers both put their orders in the morning and they're executed. \n\nThere are no sellers out there that can't sell.", "score": 17, "replies": [{"body": "Sellers are more anxious to sell than buyers. More sellers are selling at the market, and buyers are being patient or buying with limit orders. Size makes a difference, too. If an institution wants out, but only small guys are buying, it will either take a very long time, or the price will be lower.", "score": -6, "replies": []}, {"body": "I tried buying GME and robinhood stopped me.", "score": 0, "replies": []}, {"body": "It’s well on its way.", "score": -4, "replies": []}]}, {"body": "If u want to sell and no one is buying price should be 0", "score": 24, "replies": [{"body": " orders just dont get filled. Just cause theres no buyers doesn't mean theres no holder's. Bag holders in this case.", "score": 7, "replies": []}]}, {"body": "To who are selling it if there is not buyer?", "score": 8, "replies": [{"body": "\n you can see the orders, not the actual transactions", "score": 0, "replies": []}, {"body": "Buyers can come from the short sellers wanting to cover", "score": -11, "replies": [{"body": "why would they cover shorts on a falling stock?", "score": 7, "replies": [{"body": "To take profits maybe? Market psychology indicates that people prefer to cut winners and let losers run.", "score": -7, "replies": [{"body": "You belong on r/wallstreetbets. That's degen behavior.", "score": 3, "replies": []}]}]}, {"body": "But shorting and covering is just selling and buying like any other", "score": 4, "replies": []}]}]}, {"body": "Can we be accurate? There is more aggregate volume of market sell orders into limit buys, than market buys into limit sells.", "score": 2, "replies": []}, {"body": "It’s not pedantic. It’s the way things work. Watch what happens to a stock price when a company gets acquired. The price quickly jumps to the acquisition price. Not because there are more buyers than sellers but because everyone collectively believes in the new valuation. \n\nIn a liquid market that market provides a service of price discovery. We can see what the collective believes a company is worth. In an illiquid market people have to sell at a discount in order to get rid of their shares. There’s never a buyer without a seller and vise versa but in an illiquid market we may see prices that do not reflect what the collective believes is a true valuation. That is what you’re referring to. So the question is, are we seeing issues with liquidity with meta trades? No. So this is what people believe it is worth. \n\nWe are at a PE if 8 so meta seems like a steal but what we will likely see over the next few quarters is earnings continuing to decline until the trailing PE catches up. If we only look at the latest earnings the PE is actually 13 which is still cheap. So the market appears to be predicting further declines in earnings. The market could be wrong but this is not an issue with liquidity.", "score": 1, "replies": []}]}, {"body": "You can’t have more sales than purchases.  However, there absolutely can be more “sellers”, meaning people trying to ditch the stock at the current price, as compared to “buyers” at the current price.  That’s what causes the price to move.", "score": 1, "replies": []}]}, {"body": "That's funny it's going up today....", "score": 2, "replies": []}, {"body": "FAANG is about to be just AANG", "score": 0, "replies": [{"body": "For real lol\n\nfuck facebook", "score": 1, "replies": []}]}]}, {"body": "would you apply that logic to enron? upstart? affirm?", "score": -1, "replies": [{"body": "Yes because you can’t sell unless there is a buyer.", "score": 6, "replies": []}, {"body": "Let me know when they’re shredding files and people are jumping out windows at Meta. Slightly different situation.", "score": 5, "replies": []}, {"body": "Yes.", "score": 5, "replies": []}]}, {"body": "Im confused by this… if I sell and there is no one to buy… who pays me? Who determines if the price drops? I don’t get to make offers on my purchase, I only get the market rate. Illuminati?", "score": 1, "replies": [{"body": "If there is no one to buy you have to lower the price till you find a buyer.", "score": 9, "replies": []}, {"body": "Stocks are sold on a massive auction. If no one presses the buy button, the price lowers until someone does", "score": 2, "replies": [{"body": "It really amazes me on how uneducated people are on here no offence intended to anyone, it's not your fault.\n\nThe market maker buys and sells, not the individual.  In return for service they get the spread, plus as a requirement they must provide liquidity or they are not allowed to act as a market maker.\n\n&#x200B;\n\nIt doesn't mean you get a good price,  if no else is selling the Market Maker will rip you off hard.  But you will get filled.", "score": 7, "replies": []}, {"body": "Ahh, so stocks are always going down unless someone presses the buy button. So if too many people are pressing the buy button it goes up so others can sell their stake. So if no one sells it will continually go up until someone is selling", "score": 1, "replies": []}]}]}, {"body": "Manito not the cleverest thing today I read considering it went from 384 to 90 in a bit more than one year", "score": -3, "replies": []}, {"body": "Wise indeed", "score": 1, "replies": []}]}, {"body": "When facebook first IPO’d in 2012 wall street wondered how a free website would ever generate a profit", "score": 85, "replies": [{"body": "Ha ha I remember that too.  How is Google ever going to monetize YouTube?!  \n\nBtw I’m not waiting on Meta I would avoid it altogether", "score": 30, "replies": [{"body": "Fear I see", "score": 9, "replies": [{"body": "Leads to anger", "score": 3, "replies": [{"body": "Anger leads to hate", "score": 2, "replies": [{"body": "Hate leads to the Darkside", "score": 3, "replies": [{"body": "The dark side leads to never going back", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I just added 😎", "score": 2, "replies": []}]}]}, {"body": "Darkside leads to deep egg breakfast.", "score": 3, "replies": [{"body": "Smelly farts does deep egg breakfast lead to [hur hur hur](https://youtu.be/R4dyRTAfsKc)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Yeah it was weird to think that it was thought an impossible problem how a free website can make money.\n\nBut I guess no one ever thought that advertisers would move their advertising from TV and radio to the internet. \n\nThat was a monumental huge shift if you think about it, and totally not obvious.", "score": 12, "replies": []}, {"body": "Now it's back to 2015 prices, it's actually a joke to see it so oversold.", "score": 11, "replies": [{"body": "Oversold? Hardly.", "score": -11, "replies": []}]}, {"body": "Why would they wonder that? Hadn’t they seen google by then?", "score": 1, "replies": []}, {"body": "Facebook was profitable for at least each of the 3 full years leading up to their IPO.\n\nIt wasn’t making tens of billions of profit yet, but they had already demonstrated an ability to monetize the product pre-IPO.", "score": 1, "replies": []}]}, {"body": "If a Warren Buffet quote taken out of context is your due diligence then good luck on your investing journey", "score": 126, "replies": [{"body": "I’ve seen good companies go nowhere and bad companies go to the moon.\n\nStock prices seem to be based more on emotions than fundamentals. If you can recognize when fear (or greed) is irrational, the intrinsic value of those companies becomes irrelevant. At least short term.", "score": 11, "replies": []}, {"body": "Someone needed to say this.", "score": 18, "replies": []}, {"body": "Stock down? Stock must go up! \n\nWarren said so….. probably.\n\nBuy!", "score": 2, "replies": []}, {"body": "This. This right here. He also said “I only invest in things I know” he never touched tech because he didn’t know shit about it. Lol", "score": 1, "replies": [{"body": "I think most of us know tech nowadays though", "score": 1, "replies": [{"body": "That’s just an example dude. Lol", "score": 1, "replies": []}]}]}]}, {"body": "Warren Buffet also said \"It's far better to buy a wonderful company at a fair price than a fair company at a wonderful price.\"", "score": 16, "replies": []}, {"body": "99% of Redditors here don’t know what a 10k is let alone those bashing Facebook. \n\nBalance sheet is superb regardless of metaverse investments. DAUs are still growing (even in just the Facebook segment) and still plenty of monetisation levers to pull. \n\nI’m not a buyer at the moment (no spare cash) but very favourable risk/reward at this price.", "score": 15, "replies": []}, {"body": "Many posts on meta asking if it’s worth buying. It means people want to buy but just want to hear those comforting words from others lol", "score": 43, "replies": [{"body": "Or want to sell", "score": 3, "replies": []}]}, {"body": ">Warren Buffett once said that it is wise for investors to be “fearful when others are greedy, and greedy when others are fearful.” Is this the right time to buy Meta's stock for pure profit? \n\nBut you must also understand the company and trust its product. Its not that every stock must grow again.", "score": 17, "replies": []}, {"body": "Even shit is worth something to the farmer who needs fertilisers", "score": 26, "replies": [{"body": "Everything always comes back to FarmVille", "score": 32, "replies": []}]}, {"body": "I'm buying, but I'm also an idiot.", "score": 16, "replies": [{"body": "Same", "score": 3, "replies": []}, {"body": "Correct", "score": 2, "replies": []}]}, {"body": "I’ve seen ppl quoting 3 billion users, 10% user growth. My question is how many of these are actual end users and how many are advertiser accounts, bots?", "score": 19, "replies": [{"body": "Even if there are not tons of advertiser accounts or bots, the prime demographic for marketers are people that are 18 – 30 years old and have disposable income. There's a limit to how much Facebook can grow in 1st world countries, many of which are going to be facing some major economic problems for at least a year. If stagflation becomes a thing, advertisers are going to cut back on ad spending everywhere. Look at the data - imports, household debt, savings accounts, inflation, high USD compared to other currencies... It all affects a broad swath of sectors, especially tech and consumer discretionary.", "score": 7, "replies": []}]}, {"body": "I’ve been investing in FB now META for a long time so for me it’s been a frustrating stock to own. And after all this I’m essentially below square one! Which is just so hard to believe and unexpected, downright depressing! \n\nBut to look at the numbers they put up and revenue it simply shouldn’t be trading this low. They were making 20% of current revenue and trading at this share price. Even if not growing exponentially anymore I think it’s fairly clear it’s a buy. I will likely only add about 20% more to current portfolio and sit on it though. Def not expecting it to go up to where I want it before 2024.", "score": 14, "replies": [{"body": "Same boat different story. Always hated Zuckerberg and still don’t have facebook. But the stock sure looked dam good because it’s so cheap. Thought that when it was 130 and still think so now. So like you, I will be adding. Just like OP said, Mr. Depressed market wants people to sell and people were more than willing to see the company burn. But I just look at how much the sentiment can change in less than a year.", "score": 9, "replies": []}, {"body": "the thing is, zuck can throw the company into the ground following his beliefs and nobody can do a thing about it.", "score": 3, "replies": []}, {"body": "Darn , shitty", "score": 1, "replies": []}]}, {"body": "I didn’t like it when it was Facebook and I don’t like it now.", "score": 11, "replies": []}, {"body": "It will be time to buy when you stop seeing posts like these on these subreddits. -40%? \"It's time to buy!\". -20% more? \"Discount like you wouldn't believe!\". Down another 20%? \"Buy buy buy, it's META!\". \n\nWhen will people learn not to \"buy the dip\" on a falling knife?", "score": 3, "replies": []}, {"body": "I am", "score": 3, "replies": []}, {"body": "This is such a steal and I keep seeing so many comments from people being so blind and stupid. Regurgitators of information really. It’s shallow minded people like you guys that push the stock to low prices give me opportunity for scooping up more shares at a steep discount. \n\nLet me give you only one example that nobody talks about that is a game changer. AR/VR is superior to traditional learning for high stakes hands-on skills. Full stop. Not might be better. It is better. You can have a guided learning environment that is low stakes and repeated to learn whatever hands on skill it may be. I’m in healthcare so I know first hand this is extremely applicable to my field. \n\nHave you ever wondered how a doctor learns how to perform surgery on someone? They practice every individual step under guidance from an experienced surgeon… ON A REAL PERSON. That’s not an ideal learning environment. That is high stakes because you are dealing with patient safety. Many many procedures and surgeries can be taught initially with AR/VR and in a superior way simply based of this safety aspect alone. It won’t replace learning in real life obviously, but if it were up to me I would want a doctor who is training to learn and practice first in an artificial environment. \n\nAnother application with surgery.. Did you know that surgeons can not touch anything once they are scrubbed in? What if the surgeon is operating in the sinuses and is using CT imaging findings to guide the surgery? They can’t go on the computer and search things up.. That would break sterility for the operation. They tell someone to look it up or it is already pre-loaded on a monitor in a room. Add AR, and now they can use gestures without touching anything to load up image findings, manipulate, and optimize for their surgery. \n\nThink about how many professions this involves.. A lot. That is a big fucking TAM just for one aspect of AR/VR that none of you parrots think about because nobody is actually critically thinking about this situation. This is a multi-trillion dollar opportunity. Will Meta take the whole market? No. But will they take a substantial portion of the market? UHHH YEAHHH. Even if it is only 10% of the AR/VR market in 10 years, I would confidently say that is way more than the $250 billion market cap it is trading at now. Give me more shares. Keep selling.", "score": 10, "replies": [{"body": "No one doubts ar/vr is valuable. What people doubt is that meta will be the one to break it to the masses. And it’s not a mystery why. All their properties are just a feeding tube for ad revenue and a privacy nightmare.", "score": 5, "replies": []}, {"body": "So why can't Zuckerberg articulate this?", "score": 3, "replies": [{"body": "He has. No?", "score": 4, "replies": []}]}, {"body": "100% yes on the learning. Seeing apps on meta to learn organic chemistry molecular models and figurations would've made class so much easier.. Agreed on high-stakes learning as well. I specifically have worked as a surgeon in orthopaedics; I think your ideas are there but using VR/AR in surgery is probably far off. We would in fact pull up CT images, xrays, etc during surgery but I don't think having them available in AR/VR would be of much help- also keep in mind the massive mountain to climb to get them approved in there safely anyways. I would lean more towards robotics if you're looking for innovation in surgery. I have worked w/ Davinci bots as well as TKA bots and they do provide more precise jobs for those willing to learn the systems.", "score": 1, "replies": []}, {"body": "Many other industries can benefit from this as well.  I am speaking from experience on boating- in particular container ships, cruise ships, etc.  not enough boats and scheduled routes to train everyone - VR is way better than just handwritten tests.", "score": 1, "replies": []}]}, {"body": "My opinion is warren buffet is smart enough to avoid this shit ticker and so am I", "score": 4, "replies": [{"body": "He also avoided Apple for years while others bought in the single and double digits, pre-split. Unfortunately there's really not many good companies left besides the normal ones everyone shouts about.", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Amen", "score": 0, "replies": []}]}, {"body": "Tech is just getting started. There will be plenty of others or growth in existing ones.", "score": 0, "replies": []}]}]}, {"body": "I bought shares for $10000 the day it dropped over 20%. I'm in the long-term, I think that AR/VR glasses will be the new smartphones in 10-15 years, and if META can be a top 3 player in the space they could be a multi-trillion dollar company. They have the revenue and net income to put into R&D, and they are doing it. Sure, most investors hate them for not piling it up instead, but I completely disagree and I think that they are on the right track.", "score": 4, "replies": [{"body": "The issue with the 10-15 year timeline, there’s no telling who will succeed in 10-15 years. Before the iPhone, anyone would have bet that Nokia, Ericsson or blackberry would be dominating that market. All ded.", "score": 3, "replies": [{"body": "I agree, this is a very long term gamble, but I like the risk-reward ratio, so I'm in.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Metaverse, tiktok, Mark Zuckerberg no good. Me no like Meta, sell Meta! Buy Google!", "score": 0, "replies": []}]}, {"body": "Idk about super long term but they’ve been beat to hell and will bounce back to $150 at least", "score": 2, "replies": [{"body": "I am an idiot and this is also my logic", "score": 2, "replies": []}]}, {"body": "That saying goes for companies that have strong fundamentals. Have you seen the metaverse? Do you have eyes?", "score": 3, "replies": [{"body": "My eyes tell me that Meta's core biz is still going strong. Slowing growth, but still growing.\n\nAnd at this price, I will still get a decent return even if all metaverse investments turn to 0.", "score": 3, "replies": [{"body": "Problem is they pivoted to VR so much so that they changed their name. Unless they completely change what they are doing with VR or just drop it they’re not going to last.", "score": -1, "replies": [{"body": ">Unless they completely change what they are doing with VR or just drop it they’re not going to last\n\nbased on your opinion? or based on the numbers?\n\nbecause based on the numbers, they could keep up this lvl of spending even if their annual income is reduced by 50%.", "score": 1, "replies": []}]}]}, {"body": "No one has really seen \"the Metaverse.\" It's totally in it's infancy. It would be like seeing the first plane ever made and the engineer tells you about the concept of an airport, that doesn't even exist yet... And everyone is going \"have you seen the plane? Do you have eyes?\" (It only stayed aloft for a laughable 12 seconds).", "score": 2, "replies": []}]}, {"body": "Very few retailers buying after Cramer even came to Jesus. We will find out end of quarter with 13-Fs which smart money funds are sucking up all these shares. Not far above book value which is hard to believe.", "score": 2, "replies": [{"body": "Bottom is in on META with this news and inevitability: https://www.axios.com/2022/11/01/interview-fcc-commissioner-says-government-should-ban-tiktok", "score": 2, "replies": []}]}, {"body": "He also said to not fight the market and just invest in SPY as only a very small % of individuals can beat SPY.", "score": 2, "replies": []}, {"body": "You can’t deny it has an amazing balance sheet, yes it’s spent heavy on the meta verse but the market doubted zuckerburg acquiring Instagram and he turned out to be the winner I think with the explosion in AI and meta verse that will inevitably take place this stock is a great buy right now at low prices no seen for over 7 years", "score": 2, "replies": []}, {"body": "I am. The market, MSM, and Reddit losers are too busy parroting dumb narratives to see what's happening at this company.\n\nAnd no, I'm not talking about the metaverse. Almost nobody understands what this company is gonna do over the next 10 years.\n\nLast tranche at 100. Next tranche at 80 if it gets there. Keep crashing baby!", "score": 2, "replies": []}, {"body": "I hate Meta's stock I wouldn't touch it for anything.  It going to become obsolete eventually like MySpace I don't want to own it", "score": 2, "replies": [{"body": "I've been hearing Facebook is the next MySpace since they ipo'd in 2012. When is it going to happen?", "score": 14, "replies": [{"body": "Apparently now", "score": 3, "replies": [{"body": "They literally have more users than ever...", "score": 2, "replies": [{"body": "And yet they’ve burned through most of their cash and the only thing to show for it is a game with ps1 graphics.", "score": -8, "replies": [{"body": "Might wanna recheck their 10k and 10q", "score": 5, "replies": [{"body": "They went from billions in cash to 100 million.", "score": -11, "replies": [{"body": "Now you're just making shit up. They went from 64 billion cash and no debt to 42 billion cash and 10 billion in debt. They still have one of the best balance sheets in the world.", "score": 10, "replies": [{"body": "Keep bag holding the stock if you want to. I would have sold everything once they showed the laughing stock that is their metaverse.", "score": -4, "replies": [{"body": "I dont even own the stock, I'm considering building out a position right now though. The stock price is totally disconnected from reality. It's priced as if they are going out of business. I don't believe they are.", "score": 5, "replies": []}]}]}]}]}]}]}]}, {"body": "No idea but I probably haven't used it since 2012 and more and more people only ise it to store old pictures but Instagram does the same thing so I don't see any kind of up trend that makes me want to own stock in it", "score": -11, "replies": [{"body": "You do realize Instagram is owned by Facebook, right?", "score": 12, "replies": [{"body": "That's a good point I did know that I guess that was a bad example thanks for calling me out.  Still don't like the stock though", "score": -10, "replies": []}]}]}, {"body": "I mean TikTok is eating their lunch now", "score": 1, "replies": []}]}, {"body": "I stay away from it as well\n\nBut there is a clear bull thesis on Meta.\n\nYou just have to swallow a lot of assumptions and trust that META comes out on top of all of them", "score": 3, "replies": [{"body": "Yeah maybe not saying it is going to zero or anything just to many other options and I don't really like the direction they are going so I will take a hard pass and if I miss out I miss out but I doubt it", "score": 1, "replies": [{"body": "I missed on TSLA years ago\n\nBut I’ve also missed alot of absolute dogshit stocks\n\nSomething in my gut says no so I say no", "score": 4, "replies": [{"body": "I recall first looking at Tesla in the mid 100s pre split, smh. I didn't quite analyze it.", "score": 0, "replies": []}]}]}]}, {"body": "I think with tiktok and young people moving away from facebook / instagram meta is already losing against its competition in terms of growth. \n\nThis whole meta thing is just facebook’s misguided attempt to remain relevant.\n\nIt might remain a big, even the biggest player, but I don’t expect it to grow much.\n\nConclusion? Not buying.", "score": 3, "replies": [{"body": "Same I have zero interest in Meta.  Do t like the company, don't like the meta crap, don't see future growth I will avoid it like the plague", "score": 2, "replies": []}]}]}, {"body": "When all the boomers are retired and in old folks homes what are they gonna do all day? Facebook! Buy buy buy", "score": 2, "replies": [{"body": "Yep sit on FB acquiring the last few things they never bought and eeking out every last bit of their kids inheritance.", "score": 1, "replies": []}]}, {"body": "Way oversold. Time to buy!", "score": 3, "replies": []}, {"body": "No brainer buy <$100", "score": 3, "replies": []}, {"body": "In reference to this post. not for Meta, but in regard to the entire stock market I would just like to drop this here:\n\n[The Biggest Investing Opportunity of Your Life](https://www.youtube.com/watch?v=wIVCc1Vn2Pw)", "score": 1, "replies": []}, {"body": "Buying", "score": 1, "replies": []}, {"body": "No I like money too much to throw it away at ineptitude.", "score": 1, "replies": []}, {"body": "The price is better now than ever. At the same time they generate more revenue than ever. Its a future winner I believe.", "score": 1, "replies": [{"body": "Do you think it will drop more within the next month or so?", "score": 1, "replies": [{"body": "Yeah, I think so. But it is impossible to predict short-term moves.", "score": 1, "replies": [{"body": "I see. Thank you. Also, which outside events are happening right now to make it drop more? Other than people not spending as much and people not having faith in the Metaverse?", "score": 1, "replies": [{"body": "There are 3 main drivers for the downtrend in Meta: 1. They do not generate cash, because they spend so much on their development team of the metaverse. 2. Reduction in ad revenue due to lower demand. 3. People does not understand the possibilities that the metaverse may have, and will make memes like 'Would you rather live irl or in the metaverse?'", "score": 1, "replies": [{"body": "I see. Thank you for explaining!\n\nAnd yeah the metaverse might just become the next big thing", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yup need to bring my entry price down , will decrease position in a rally.", "score": 1, "replies": []}, {"body": "If I have learnt anything from this sub is buy what people fear here and sell what ppl love", "score": 1, "replies": []}, {"body": "Im one of few people that believe in the Metaverse and its future because of how fast it's growing among young people.\n\n In 2021 they *profited* $39b which is ~1/6 of their net worth right now. This year they made less because of the heavy investment into RnD and slowing ad revenue due to the recession, but a growth company trading at a 6x multiple is an easy buy to me. Especially when you look at the fact that they have 160b in assets and 40b debt.", "score": 1, "replies": []}, {"body": "The same people telling you to buy right now would have told you 6 months ago it wasn’t never going pre Covid level. Take that for what it is worth.", "score": 1, "replies": []}, {"body": "I am buying. Way oversold. They still made 4.4B in income last q which was higher than Amazon and everyone is horny over Amazon.", "score": 1, "replies": []}, {"body": "I bought BBBY, Meta & Netflix.  Meta will recover just dont know how long this will take due to economic conditions etc.  I actually bought Meta with 5x leverage thats how confident or stupid I am", "score": 1, "replies": []}, {"body": "Meta is desperate now. Don't buy it.\n\n* Their advertising model is ruined because of the tracking restrictions on Apple devices.\n* TikTok is syphoning users away from Instagram\n* Younger folks mostly do not use Facebook at all\n* They spent 10B on the Metaverse, a product that looks like it's from 2001 and nobody wants to buy their VR equipment.\n\n&#x200B;\n\nLet's face it, Meta is bleeding badly and I don't think it has prosperous future.", "score": -2, "replies": []}, {"body": "Warren Buffett also likes very good, sensible managers. I think Zuckerberg’s fear of being left behind competitors like TikTok and the weakness of the business model that surfaced after changes Apple made to its policies has got him acting rash. On top he felt the need to rebrand because FB became a toxic brand in the US with all the politics, leaks etc. \n\nPerhaps he has a very long term, 10 year-plus vision. But he has to know that the market can stay irrational longer than he can stay solvent. And on top I don’t think the market is being irrational in this case. VR is just not going to be mainstream unless the goggles are the size of regular glasses or better yet contact lenses. Meta isn’t pushing computer science forward at the rate of Companies like Nvidia, Intel and AMD. Unless you have a groundbreaking product, you don’t bet the company on it. \n\nI doubt Berkshire would come anywhere near Meta because of the above.", "score": 0, "replies": []}, {"body": "I believe they are working on some really cool stuff they have you yet to share, but the chart needs to develop a base on weekly chart.", "score": 0, "replies": []}, {"body": "Buffett would never touch META lol. Being low isn't a reason to buy", "score": 0, "replies": []}, {"body": "and is Warren Buffet loading up on META shares? No he is buying energy companies.", "score": 0, "replies": []}, {"body": "It's dead, fuck how many times do we have to go over this. Instagram is a cesspool of perverts and fitness flogs. Boomers and racists populate Facebook. And the amount of adds, fuck me the adds. No one above 20 is signing up. It.is.ded!", "score": -11, "replies": [{"body": "3 billion users on Facebook, 1.5 billion on IG and growing, 2 billion on whatsapp that is just beginning to be monetized=dead", "score": 2, "replies": [{"body": "Come on bud, you honestly think it has more to run? Sure the numbers are there, but will they grow?", "score": -1, "replies": [{"body": "Meta doesn't need to grow. A zero growth equity still demands a PE of around 8-10x. A stock with a P/E ratio of 10 (or an earnings yield of 10%), that doesn’t grow at all, can pay out a 10% yield to shareholders every year if it wanted. So, Meta could have stagnant income for eternity and still return 10-11% a year to investors with a current PE ratio of 9-10x.", "score": 4, "replies": [{"body": "Here's hoping it gets worse for them lol", "score": 0, "replies": []}, {"body": "They can pay 10% yield if they maintain their profits.\n\nLast quarter year over year: \n\nRevenues down -$1.3B.  \nCosts up +$600M excluding R&D.  \nRevenues per ad print -18%\n\nIncluding R&D : profits were down -52% y/o/y \n\nThey artificially maintained revenues by increasing number of ads by 17% while users were up +2%. Meaning users are now being bombarded by ads.\n\nI would also add that advertising pie may shrink with a recession and that NFLX and DIS will now want their share of that smaller pie.\n\nI agree 8-10 p/e is ok for a blue chip generating stable profit, but hard to say with META.\nThey just posted $1.64 EPS which annualized would mean a $56-$64 share price at 8-10 p/e\n\nIt’s not just an emotional selloff at this point", "score": 1, "replies": []}]}]}, {"body": "I deleted my real fb years ago. I still have several fake accounts I don’t even have the passwords for. Do these count towards the 3 billion? 😝", "score": -4, "replies": [{"body": "No. I was referring to monthly active users. Daily active users on FB is around 2 billion.", "score": 6, "replies": []}]}]}, {"body": "It's freaking awesome seeing its price go down. Even better seeing the bagholders freak out lol\n\nReminds of the golden age of WSB haha.", "score": 0, "replies": []}]}, {"body": "Fearful? I'm downright horrified.", "score": 0, "replies": []}, {"body": "The cheap can always get cheaper", "score": 0, "replies": []}, {"body": "***\"But some times you have to nibble at the tibble\"***  *Warren Buffet*", "score": 0, "replies": []}, {"body": "Obviously", "score": 0, "replies": []}, {"body": "I bought 3 shares at $99", "score": 0, "replies": []}, {"body": "Meta's entire business model was serving up ads to it's users.  With iOS 14, Apple severely limits what user info Meta can access for said ads. Android has similar plans. Plus, just this month Apple announced they are taking a 30% cut of Meta's in-app revenue from Meta's ad purchasers. \n\nMeta'a main revenue source has effectively been cut off at the knees. It still has brand recognition but that's about it unless we all start wearing their headsets. Yikes.\n\nMeta could seriously and quickly go the way of MySpace IMHO.", "score": 0, "replies": []}, {"body": "Just go all in and report back in a couple years. If you are right, you'll make bank", "score": 0, "replies": []}, {"body": "I’m fearful of Meta’s greed.", "score": 0, "replies": []}, {"body": "Zucchini fucked up....plain and simple.", "score": 0, "replies": []}, {"body": "I think it’s time for people to stop quoting Buffett.", "score": 0, "replies": []}, {"body": "I think these kinds of deals are a risk/reward that you don't see that often. \n\nUnless you bought at +200. Then it's just fucked.", "score": 0, "replies": []}, {"body": "I’m buying some but not loading the boat. Financials are still good and user interaction still looks ok. Just the overspend on R&D is scary but they could be generating the future and we don’t know it yet. It’s worth some play money for me.", "score": 0, "replies": []}, {"body": "Ah the old Oracle of Obesity. Got all your sugar and junk food needs with sub par insurance to keep you coming back to the doctor. Great dude. Really helped the banks rebound after 2008 to continue what they were doing so he could profit even more. Lovely old chap.", "score": 0, "replies": []}, {"body": "I bought 100 shares yesterday", "score": 0, "replies": []}, {"body": "I don’t care what WB has to say. I’m buying cause its really oversold and I’m fine if I become a bag holder. I like trades like this where I can keep it as a investment if my trade ideas don’t work out. I personally dont like meta or their leadership, but they are a tech giant and you can bring all negatives but I’m here for a trade and if not, long term investment that can turn into good profits at these prices imo.\n\nYep, I’m aware there is more room to go down since wall street has their sights on it, but I think there is more room to go up far as prices go. It’ll just take some time. I am buying meta in two accounts; my reg account and my IRA. Yep this recent ER sucked but there will be more bad ones or even slight better ones going forward. The market conditions needs to be accounted for due to the times we are living now.\n\nThis was way too long then I intended. This is coming from a person who does not like meta as a company but not as a quick trade or long term. I guess I can separate money opportunity vs how I feel about a company.", "score": 0, "replies": []}, {"body": "I bought a little at 99 recently. Kinda regret it bc it’s just gonna go lower. But I do believe in Instagram, WhatsApp, 10Y play on Metaverse, and Zuck’s ability to feature copy to keep up with social media trends (Snap, TikTok). We’re at 2016 levels or so now", "score": 0, "replies": []}, {"body": "You are betting on a company that lives of ad revenue to make the most difficult hardware/software product a success. \n\nIt’s like asking your insurance company to pivot into performing actual surgery. \n\nNo thanks. \n\nps. As a short term play though, probs money to be made.", "score": 0, "replies": []}, {"body": "This is probably going to fall below $50 and if we have a recession all the way to $20. Please research the Dot Com bubble in the year 1999. There is a bubble in tech right now and it already burst.", "score": 0, "replies": [{"body": "Drop to $20.... so 50-60b market cap for a company that generates at least 20b of free cash flow and has 0 debt? 😂\n\nOne can only dream but please let that happen, I know what I'm gonna do. 🤑🤑", "score": 2, "replies": []}]}, {"body": "I wouldn’t trust Zuckerberg with a kid in a closet, why would I buy his stock?", "score": 0, "replies": []}, {"body": "I invest in things I want to grow. Meta is not on my list.", "score": -1, "replies": []}, {"body": "I am so sick to see precisely this quote from Warren Buffett.", "score": -1, "replies": [{"body": "The most overdone overcooked now overrated quote in the history of the stock market. Was actually applicable in the 1980s or 90s when he (Buffett) made it  but  might be counter intuitive today.", "score": 1, "replies": []}]}, {"body": "No. Metaverse looks like a massive gamble, possible legal problems, FB and Insta probably need overhaul. Need to see some positive signs before buying I think but who knows just buy it if you like it.", "score": -1, "replies": []}, {"body": "I am planning to wait UNTIL they start making money out of this metaverse thing , for now the revenue declined by 50% YoY , which is not the sign I want to see, I know I will lose the first big candle , but if this metaverse takes off , the runway is very long , so from a risk pov , I’m better off getting in when the promise is fulfilled then betting it will.", "score": -1, "replies": []}, {"body": "Do people not realize this company is losing an absurd amount of money??? Business model is being restructured??? Advertising is decreasing? The meta verse won’t work? I don’t understand how there is any motive for a person to want to put their hard-working money into a company that is more of a BET than an actual investment.", "score": -1, "replies": []}, {"body": "There’s more to fall with Zuckstick saying they will continue to put funding towards the Metaverse. Issa gon go down more.", "score": -2, "replies": []}, {"body": "Nope. Nobody is buying it.", "score": -4, "replies": []}, {"body": "No.", "score": 1, "replies": []}, {"body": "I bought a ton yesterday for a short term bounce. We’ll see if it works out", "score": 1, "replies": []}, {"body": "No way.  This Mutaverse is a crackhead’s venture.  Too many others to pick up instead", "score": 1, "replies": []}, {"body": "look at the volume per day. those arr sellers and buyers.", "score": 1, "replies": []}, {"body": "No one's buying it. It was already a declining companywhich is why Zucks so desperate to switch to Metaverse. Now instead of slowly fading away, this company is going out with a flashbang by wasting all their cash on an idea someone else will ultimately do better.", "score": 1, "replies": []}, {"body": "https://www.thestreet.com/investing/buffett-likes-facebook-not-so-much-stock", "score": 1, "replies": [{"body": "[This one](https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-facebook-meta-stock-charlie-munger-privacy-2022-2) is better.", "score": 1, "replies": []}]}, {"body": "Warrent Buffet is also a value investor. He has ruled out buying Meta because he does not know how to value it. \n\n[see this article](https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-facebook-meta-stock-charlie-munger-privacy-2022-2?op=1)", "score": 1, "replies": []}, {"body": "Yeah thinking about buying more (cost basis 100 right now)", "score": 1, "replies": []}, {"body": "Is Zuck fearful yet?", "score": 1, "replies": []}, {"body": "I'm buying in VOO", "score": 1, "replies": []}, {"body": "Scooped some up at 94.", "score": 1, "replies": []}, {"body": "Yes, in small amounts.", "score": 1, "replies": []}, {"body": "I think Meta has 1-2 more earnings reports before prices stabilize. Not because the financials are bad, but for people to ease complaining about where Meta is heading. There’s too much spotlight on Meta to open a position, but once the spotlight dims, it’s definitely a long term buy for me. When AR/VR tech gains a foothold, Meta will be one of the hottest growth opportunities.", "score": 1, "replies": []}, {"body": "My average cost per share is 96.40. If it goes to 85$ I’ll double down, if it goes to 70$ I cry", "score": 1, "replies": []}, {"body": "$META is obviously a value play, as I've written elsewhere. But the question is what is the catalyst?\n\nBack in 2013, $AAPL was at a P/E of 9. The negativity was astounding. Then Carl Icahn got involved, and Tim Cook began returning Apple's huge cash pile to shareholders via buybacks and a new dividend. Buffett started buying a few years later. In the end, Apple's sales and earnings continued growing strongly, despite fears to the contrary.\n\nI think you can wait for something similar to happen here. Like Cook, Zuck won't give the market everything it wants, but he'll likely cede at least *some* ground on the capital allocation issue. We'll probably also see a prominent investor get involved within the next year or two. Icahn, David Einhorn, hell maybe even Buffett. As we emerge from the recession, Meta's core ad tech business will resume its upward trajectory, despite fears of a slowdown.\n\nPersonally, I'm not in a hurry to buy shares. That may be a mistake...or it may not be. I have other irons in the fire (deep value plays). A lot comes down to your personal opportunity cost, IMO.", "score": 1, "replies": []}, {"body": "First stop quoting investopedia, 2nd if you are not sure, then leave it alone.", "score": 1, "replies": []}, {"body": "Baron’s suggests waiting a bit longer.\n\nhttps://stocks.apple.com/AtwSyMHMSR6myrrduIZlVAg", "score": 1, "replies": []}, {"body": "I'm hoping to buy a little this week, but depends on the rest of the economic news. It's possible Meta could still slide a bit more.\n\nBut I'm not betting on Facebook or Instagram...\n\nI'm betting on the Metaverse. It has huge potential for life improving application outside of Horizon Worlds that many seem to only think about.", "score": 1, "replies": []}, {"body": "Worst case scenario it be drug up with all the other big companies because it has to bought by etfs. You will get some beta but not alpha.", "score": 1, "replies": []}, {"body": "Hard pass", "score": 1, "replies": []}, {"body": "If/when the institutional investors start jumping ship, this one will be ugly.\n\nDo not try to catch a falling knife.", "score": 1, "replies": []}, {"body": "Read Snow Crash then decide", "score": 1, "replies": []}, {"body": "I wouldn’t go anywhere near META.", "score": 1, "replies": []}, {"body": ".", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "yj6pbg", "created_utc": 1667303634.0, "score": 1992, "upvote_ratio": 0.96, "num_comments": 523, "comments": [{"body": "[deleted]", "score": 1071, "replies": [{"body": "It can be both.\n\nAt the highest level I don't think meta verse is a wrong vision but his execution of it is completely down the wrong path.\n\nIf you had proposed today's Internet with all the micro transactions, invasive ads, trools/bots and how corparate and money lead it is and also how dependent we must become on it to live offline it would of never taken off.", "score": 481, "replies": [{"body": "Has Zuck shown he is a visionary genius outside of founding facebook and it's first 4 or 5 years?\n\nHe bought Whatsapp, Instagram.\n\nThey haven't developed any new features, only copied from others. They copied stories from snapchat. Reels from TikTok. Circles and group chats from Google.", "score": 323, "replies": [{"body": "Purchasing those companies was a very smart move. $1 billion for Instagram was seen as laughable as a time, but it’s gotten at least 100x in value and ensured that meta has a place on a younger person’s phone. Those purchases show that Zuckerberg can identify opportunities like that. Now, his implementation of a VR world is probably going to fall flat on its face, but the idea of a VR world might be valid. I just think it’d be more viable in a purely gaming context, since all the non gaming aspects can be replicated on a phone or laptop.", "score": 116, "replies": [{"body": "> all the non gaming aspects can be replicated on a phone or laptop\n\nEverything a smartphone does can be replicated on a different device too.", "score": 12, "replies": [{"body": "Sure you can read a tweet or watch a video on a desktop computer, but can you do that while waiting in line with a desktop? On the bus? Laying on your bed? No, the phone’s advantage is that it’s ultra convenient. \n\nA VR headset’s advantage is that it’s immersive. This doesn’t make sense for office meetings or reading emails. Those can be either in person meetings, on a desktop computer, or on a phone. In this sense, Zuckerberg is misguided. But for games, this makes sense. Video games are intrinsically immersive experiences, and VR games are more immersive than any other type. For example, why watch a movie at a movie theater when you could watch it on your phone?", "score": 15, "replies": [{"body": "AR headsets are basically sun glasses. If done properly, imagine either contact lenses or sun glasses that do everything your phone does or more. A lot of people want to work from home, others want to work in the office. AR glasses, blue toothed to a PC/phone offers both. My children own Oculus head sets and my wife owns a higher end model, they love them. But honestly I think Zuckerberg watched ready player one and said hold my beer.", "score": 1, "replies": [{"body": "We’re where automobiles were in the early 1900s. The cars were inefficient and expensive, and eventually they were redesigned and now everyone has a car. The same thing will happen with the AR headsets. Look at how many people buy 1-2K iPhones… you’d be tapping into the same market once the applications are on par with iPhone/iPad apps. Perhaps we see a partnership with Apple at some point? He’s already partnering with Microsoft, so you know he’s working the “business” angle as well.", "score": 2, "replies": [{"body": "Transportation is a pretty universal need. Not so much hanging out in digital realities. These 2 things are not similar", "score": -1, "replies": [{"body": "I think internet connectivity and better modes of WFH/Teleconferencing are 100% becoming universal needs. Like.. wake up bruh, its 2022.", "score": 1, "replies": [{"body": "Really bro… almost every human alive has a need for travel. On a percent of population base, how many have a need for video conferencing? Internet connectivity is important, but like I said, these 2 things are not similar. Not even a little", "score": 1, "replies": [{"body": "Ever heard of public transit? Yes, in some places cars have historically been necessities. All I'm saying is that in the future there may be things more important for communicating with people and getting information.", "score": 1, "replies": [{"body": "Yes, I have heard of this and it backs up my point of importance. Ever heard of public Teleconferencing? Yeah, me neither. \nIm just having fun with you friend, obviously it’s a growing landscape. I think Metaverse will probably be huge eventually, but it still won’t appeal to everybody. It will always have a user base and nonusers, unlike transportation(public or private). Have a good one!", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "But i can’t take my desktop with me to work or the store or my buddies house. I could bring my laptop? But then I run into the issue of needing wifi. And it’s just inconvenient. Sure I could do everything my phone does on my much more powerful PC, but why/how would I if I’m laying in bed or outside walking my dog?", "score": 1, "replies": []}]}, {"body": "The cost alone for a VR headset makes it difficult. No one will spend over 1k for one especially when you have to have a FB account to sign in", "score": 8, "replies": [{"body": "20 years ago the thought of paying $1K for a phone was crazy too", "score": 45, "replies": []}, {"body": "Oculus 2 is $400 and you don’t need a Facebook account anymore.", "score": 16, "replies": [{"body": "My main issue with oculus is that we have a lack of privacy", "score": 0, "replies": [{"body": "The NSA got exposed for archiving virtually all of this country’s communications. Their response was to tell the public to fuck off and charge the whistleblower as a terrorist. Privacy has been imaginary for a very long time. Troll accounts aren’t actually private.", "score": 8, "replies": [{"body": "Agree on that forsure", "score": 1, "replies": []}]}, {"body": "Oh, that’s certainly true. Zuck’s still got your data.", "score": 4, "replies": []}, {"body": "No less than with what Apple or Google do.\nMeta don't record raw sensor data, but they are going to track your app usage.\n\nIf you think a VR.headset made by Apple would have less user tracking you are woefully naive.", "score": 2, "replies": [{"body": "Total agree - my main fear is the mapping of rooms and wonder how hackable they are", "score": 1, "replies": []}]}, {"body": "That is an issue with all apps these days.  Without legislation to protect privacy as a right, pretty much all apps are data harvesting.", "score": 2, "replies": []}]}]}, {"body": "Lol its time for bed grandpa, wheel of fortune ended 3 hours ago", "score": 6, "replies": []}, {"body": "Lmao yes I will. It provides a big productivity boost for remote workers.", "score": 1, "replies": [{"body": "Only way it is viable is for companies I agree\n\nAn average consumer in today's times can barely afford things as it is but something over 1k is equal to if not more than a lot of people's bi weekly incomes\n\nIt's like \"do I save for a trip this year or buy a VR headset\" for regular consumers but for business I see its practicality", "score": 1, "replies": []}]}]}, {"body": "I clearly remember the Instagram purchase, but I think the meta verse thing is quite different.", "score": 1, "replies": []}, {"body": "You’ve framed it accurately: there isn’t a single person capable of batting at 100%. He did well with Facebook, Instagram and WhatsApp. I think he did pretty alright with the Oculus as well (though admittedly I’m not at all knowledgeable about it). But the Metaverse is lining up to be his first miss. Everyone misses eventually. Not everyone misses with 100s of billions at stake though.", "score": 1, "replies": []}, {"body": "Gaming and corporate/business setting. If he can tap into both of those markets successfully, we’re talking billions in revenue", "score": 1, "replies": []}, {"body": "He also did it very late in my perception I was already 2-3 years ln WhatsApp using it daily. Insta buy was also a few years late. It was also so late because I think Facebook back then tried to develop their own versions of successful social media which always failed.\n\nThe problem to be viable in gaming is that vr currently is perceived as an overly expensive uncomfortable screen that produce headaches for only single persons and you have to move a lot. As long as there is no bigger benefit it won't get much more traction, that's the reason why the promised new vr success never came. Imo the biggest thing that will be a benefit to the everyday use is AR while vr will be the equivalent of a gaming pc or console. Not everyone wants one or can effort one.", "score": 1, "replies": []}]}, {"body": "I would hardly call the meta verse a unique vision, its just an adaptation of an idea that's been around for decades at least and has 100s of Sci fi books exploring it\n\nIts just the Internet but more real with a visor instead of a fixed or handheld screen....", "score": 122, "replies": [{"body": "ideas are cheap...its the execution that makes someone a genius", "score": 40, "replies": []}, {"body": "Yupp, people only signed up for facebook in my school because the hot girls were on it posting pictures and sending out invites. Let's not pretend it's anything else. It just trickled down from there once you had the rich harvard kids using it. The hot girls get on, and all of a sudden average joes wanted to be on too. \n\nHe was in the right place at the right time. Now he's using this money to try and prove to others that he is in fact a visionary and NOT just in the right place at the right time.", "score": 94, "replies": [{"body": "This is an over simplification of what people want digital experiences for though. Sure \"hot people I know\" is a use case. But \"triggered dopamine release\" \"adrenaline release\" \"sense of accomplishment\" and \"total escape / destruction of reality I live in for X hours\" are all valid use cases. Will mark be the one to deliver them? maybe not, but look at Digital Slot and Video game addicts (or heavy users) to see that there's a wide array of users beyond \"damn she's looking good in that pic\"", "score": 20, "replies": []}, {"body": "you could say any \"visionary\" was at the right place at the right time. And who cares if Zuck isnt a real \"visionary\" he is for sure a business genius. Bill Gates just copied everything too and didnt invent shit.", "score": -14, "replies": []}, {"body": "He was at least a coding prodigy, was he not?", "score": 1, "replies": []}]}, {"body": "Google Second Life, they literally stole their idea and it’s better graphics.", "score": 4, "replies": []}, {"body": "Metaverse already exists though, second life came out decades ago and roblox as well", "score": 0, "replies": []}]}, {"body": "I mean, you could say the same about almost any other large company and I'd say it's just meeting demand.\n\n\nGoogle tried to get into social media 10ish years ago to replicate FB, which replicated MySpace (Google+).\n\n\nGoogle, Apple, and Microsoft's group text equivalents all came out after Skype's group chat functionality.\n\n\nApple with the group FaceTime that only came out a couple of years ago years after other platforms supported it; Apple with the FT Group for watching videos concurrently with friends, which came after Netflix did it, which came after a 3rd party extension did it.\n\n\nApple tried to make its own version of Snapchat: https://www.theverge.com/2016/8/25/12638212/apple-iphone-snapchat-app-rumor\n\n\n\nThe major banks came together to make Zelle after seeing how popular Venmo became.\n\n\nThey take small startup ideas, figure out future profitability, and weigh the costs for either acquiring it or developing it internally and making it popular, and I'm sure Mark has the final decision at the end of the day.\n\n\nSiri was a startup acquired by Apple as was their technology for FaceID, which I think Samsung phones had first but is now pretty much ubiquitous on any phone manufacturer.\n\n\nSame goes for TouchID, NFC for payments & digital wallets, Tiles & AirTags.\n\n\n\nIt's not about the idea, it's about the execution and the cost/benefit analysis - all those companies continued or dropped the features based on their success.", "score": 27, "replies": []}, {"body": "Well even Facebook was ripped off from other ideas 😂", "score": 16, "replies": []}, {"body": "He actually stole Facebook from friends that developed it in college according to a documentary. \n\nhttps://www.quora.com/Did-Mark-Zuckerberg-steal-the-idea-for-Facebook-from-the-Winklevoss-twins-considering-they-did-get-65-million-from-a-settlement-last-year-How-legitimate-is-their-claim\n\nThen, he stole the name Meta from this company. \n\nhttps://www.cnbc.com/2022/07/25/company-called-meta-claims-facebook-stole-its-name-and-is-suing.html\n\nI’m not surprised his idea for Metaverse is failing miserably. None of his projects have been his innovation.", "score": 51, "replies": [{"body": "Let’s not forget about Project Life Log…. A copy CIA spying platform that was discontinued the day FB went live", "score": 6, "replies": []}, {"body": "Not necessarily stole, but overwhelmed the market with the advertising for \"Meta\" by FB, which broke the search algorithms for \"META\" (another company).\n\n\nFrom the filing:\n\n\"Meta has been crushed by Facebook’s flagrant, unlawful conduct. Meta can no longer provide goods and services under the META mark because consumers are likely to mistakenly believe that Meta’s goods and services emanate from Facebook and that Meta is associated with the toxicity that is inextricably linked with Facebook.\n\n10. Federal and state law clearly prohibit Facebook’s conduct. This is textbook, unlawful reverse confusion, which has caused, and is continuing to cause, irreparable harm to Meta.\"\n\n\n\nThere are plenty of other companies and stock tickers that result in the same name confusion (whether exact spelling, something similar which would make sense, capitalization, etc.)\n\n\nhttps://capital.com/confusion-over-stock-tickers-leads-even-professional-investors-to-buy-the-wrong-shares\n\n\n\nhttps://news.camden.rutgers.edu/2019/08/investors-often-buy-the-wrong-stock-because-of-a-similar-name-or-ticker-symbol-says-new-research-at-rutgers-university-camden/", "score": 10, "replies": [{"body": "META was a non-existent business. They bought the rights to Meta from everyone who mattered legally. This other company just wanted a payout and they got one for making people like you think this other company existed.", "score": 17, "replies": [{"body": "From the WayBackTime Machine (web.archive.org), \\`meta.is\\`: \n\n\\- was registered in 2009 ([https://web.archive.org/web/20090503033015/http://www.meta.is/](https://web.archive.org/web/20090503033015/http://www.meta.is/))\n\n&#x200B;\n\n\\- prominently shows \\`META\\` on the website header in 2016, which includes: \"The Art of Being There\" with a video\n\n[https://web.archive.org/web/20160312164511/http://meta.is/](https://web.archive.org/web/20160312164511/http://meta.is/)\n\n&#x200B;\n\nand has a Products page [https://web.archive.org/web/20160321090930/http://meta.is/products](https://web.archive.org/web/20160321090930/http://meta.is/products)\n\n&#x200B;\n\n[https://web.archive.org/web/20160319095418/http://meta.is/products/teleporter/](https://web.archive.org/web/20160319095418/http://meta.is/products/teleporter/)\n\n&#x200B;\n\n&#x200B;\n\nNo idea about sales, but \\`META\\` seems to be a legit company from at least 2009", "score": 5, "replies": [{"body": "Yes I agree it existed, and still exists today. The point is that Meta was a registered trademark and Meta bought that and had the paperwork to prove it. This other company was using something they didn't own and just never got called out for their actions. Of course they are upset at Facebook but it's not like they legally owned the trademark. If they did someone is willing to sue Meta on their behalf and reap tons of cash from Facebook. Instead they do a mock lawsuit that settles before it sees the court room.", "score": 6, "replies": []}]}, {"body": "There’s a whole,documentary on this. They interviewed the owner and people that worked there. It’s a registered business and was in operation for a decade.", "score": 1, "replies": [{"body": "It is one of many companies using Meta but they didn't own the trademark. Someone else did and Meta bought the trademark from the legitimate company. Meta doesn't really need to find all the companies squatting on other established trademarks.", "score": 3, "replies": []}]}]}, {"body": "Yeah right, like that kind of publicity is bad for a company nobody knew about before.", "score": 0, "replies": []}]}]}, {"body": "This is in hindsight. Both purchases at the time were considered overpriced and not worth it. \n\nInsta was a non-threat. Snap was the threat. Fb bought insta and then copied snap’s features; that wasn’t part of insta’s original product.  There’s an argument to be made that the insta stories feature wasn’t original and therefore zuck doesn’t get credit for that. I disagree with that, as buying insta and developing those features was still an expensive bet - one that he took despite criticism. \n\nWhatsapp was also puzzling at the time.  E2e encrypted chat was thought to basically be unmonetizeable, so what would be the point of buying it?", "score": 10, "replies": [{"body": "Whatsapp was already used by the majority of people in Europe, or at least a lot of it.\n\nThey tried to introduce an annual charge for whatsapp but that ended quickly. \n\nDoes whatsapp even make money for facebook?", "score": 5, "replies": [{"body": "Dont think whatsapp makes money for them right now.  I think they’re adding payment integration or something like that. They mentioned it in their earnings call but i forget the details.", "score": 1, "replies": []}]}]}, {"body": "Don’t forget failing at many of these copies. And also sucking at hardware.", "score": 4, "replies": []}, {"body": "The move from FB as a desktop product to being mobile first should not be under estimated.", "score": 3, "replies": []}, {"body": "totally agree, Zuck is no business person or visionary guy...he has been on the facebook gravy train for long time.", "score": 7, "replies": []}, {"body": "Lol, you sound jealous.\n\nAlso, please, do yourself a favor and read the articles about investors feelings when they did bought Instagram - it wasn't received well at all, and look at it now.\n\nMark could be hated by many people, but he has two great qualities of a CEO:\n\n1. He is a visionary whether you agree with his vision or not\n2. He's got the balls. It's easy to make spending decisions during bull run, and it takes the balls to continue aggressive spending despite investors perceptions.", "score": 11, "replies": [{"body": "???\n\nHe's a billionaire whether he's a visionary or not. That's not the line where I am jealous or not.", "score": 0, "replies": [{"body": "He was a visionary when buying Instagram as well, when everyone else were laughing at his 1b investment.", "score": 4, "replies": []}]}, {"body": "It’s not a question of ease, it’s a question of discounting cash flows. There can be a great case for aggressive far off expansion with rates at near zero but that case is much harder to make with rates where they are.", "score": 1, "replies": []}]}, {"body": "I miss old Facebook", "score": 2, "replies": []}, {"body": "It's completely normal for big tech companies to acquire smaller ones. Happens all the time with Apple, Microsoft, and Google – most of them don't become something hugely important and are just incorporated into present apps.\n\nIn general, people only notice the acquisitions that are kept as is, like YouTube, Instagram, WhatsApp and Fitbit. It's easy to forget that Google AdSense was DoubleClick (and a few others).", "score": 2, "replies": []}, {"body": "Good artists copy.  Great artists steal", "score": 0, "replies": []}, {"body": "And hasn’t he been accused of steeling the idea of fb from a roommate or something?", "score": 1, "replies": []}, {"body": "The most successful acquisition in the history of mankind is visionary genius in itself", "score": 1, "replies": []}, {"body": "He’s trying to copy the meta verse from Roblox and falling flat. Roblox has the next generation of consumers and students on lock already.", "score": 1, "replies": []}, {"body": "I would have to disagree. He’s been severely limited by regulations. He was forced to can his latest venture Lira, which actually sounded fairly interesting when you consider how it could fit with what he’s building in Metaland.  People forget that there are a number of “metaverses” already up and running, but the quality / graphics and gameplay (IMO) are sub par and need to get better. This is a MASSIVE opportunity", "score": 1, "replies": []}]}, {"body": "He was probably thinking ahead, afraid that competitors could create their own metaverses and take control of the social media market, is what I may be guessing. He's too young to be this desperate. \n\nBut maybe he has a huge ego and he can't take the failure of the Metaverse. Visionary people like Mark tend to be stubborn like that. Whatever vision of the future they have HAS to happen, no matter what, and that could make ambitious people clash with other ambitious people. I dunno, just rambling I guess. Ultimately Mark knows what he's doing.", "score": 6, "replies": [{"body": "He’s not visionary.  He needs to be fed ideas, and then feel like he’s picking the successful ones.  He wants to be Steve Jobs, but he isn’t even close to that.   \n\nThe man fell into a pile of money because MySpace was clunky for users.", "score": 1, "replies": [{"body": "Well, he may have *bad* visions, but he is still a visionary because those types of people are driven by their vision, not other peoples' opinion.\n\nThese types may be selfish and stubborn but ultimately they are decisive and have a sense of direction. Whether Zuck's vision works out or not remains to be seen but I'm not holding my breath.", "score": 1, "replies": []}]}, {"body": "Yes I think you’re partially correct. What is it thats made these mega tech’s so successful over the years? They are always staying at least 2 years ahead of the competition.", "score": 1, "replies": []}]}, {"body": "They jumped the experimental, free and fun part.\n\nCan't get people hooked on a pocket.\n\nLike here, have some Heroin. This heroin can only work with our patented scummy spoon and our long life syringe which starts at $20 per month with insurance.\n\nLike who the hell would ever get hooked on that Heroin?", "score": 8, "replies": []}, {"body": "[deleted]", "score": 27, "replies": [{"body": "I to watched the big short.", "score": 19, "replies": [{"body": "ITS THE SAME THING.", "score": 0, "replies": []}]}, {"body": "But having boatloads of money buys you a lot larger window in which you can potentially get the timing right.", "score": 3, "replies": []}, {"body": "*too* early.", "score": 2, "replies": []}, {"body": "Good point. He could still be right and still get rekt - it’s certainly a very big bet he is doing", "score": 1, "replies": []}]}, {"body": "if you look at the meta-users demographic, it appears similar to the demographic zuck & his peers are from - tech-savy/tech-obsessed, wealthy, young professionals who live in cities/high pop density areas. \n\nbasically the yuppies of NYC/SV.\n\nthe current economic system can only produce so many of these people.", "score": 4, "replies": []}, {"body": "Oh he's wrong. He's built his life around advertising and let user experience take a backseat to how they innovate.   Meta's Metaverse is going to be a dystopian advertising land and not have anything for the public to enjoy.     \n\nUser experience should be the number 1 priority. Haven't we learned that since the internet became a thing?   Sad that wallstreet can't understand this.  Microsoft will probably win this race, and only because they bought activision.", "score": 4, "replies": []}, {"body": "It’s like how he came up with Friendster", "score": 2, "replies": []}, {"body": "People keep using that term \"metaverse\" or \"metaverse is the future\" and I still dont even know what the hell it is supposed to be. Any of the most sensical ideas just sound like the internet with more hassle.", "score": 2, "replies": []}, {"body": "But isn’t that exactly the business model that google founders said in their pitch deck? That their search engine will become the greatest ad database ever to precisely target based on search and that’s what makes their academic tech exhibition idea into an actual business venture? Some Stanford professor was even an early investor because he believed it was a viable business while mainstream investors and average joes questioned how you’d make a business off of doing what they saw as a glorified yellow pages at the time.", "score": 1, "replies": []}, {"body": "How is his execution wrong? Because he’s keeping people in the dark?\n\nIf I was building something that could be a game changer and had to compete with the likes of Apple and Google I would say as little as possible until its live.", "score": 1, "replies": []}]}, {"body": "One of the things that gives me promise is the fact they realize current VR headsets are too bulky and not reasonable to use in its current state.\n\nOnce its down to eye glass level it will take off. BUT it may not be possible, and they're giving themselves 5-10 years to do it. Investors won't stick around waiting.", "score": 13, "replies": []}, {"body": "The latter.\n\nWhat has he done to demonstrate that he's a visionary genius? Pretty much everything he's done he's copied from someone else, bought out, or has failed.\n\nIf 15 years ago he laid out a vision for a metaverse and explained how Facebook is the first step towards that vision, then I would be more willing to accept the visionary genius label. That's why guys like Musk (as much as I hate him), Jobs, and Bezos have earned that label, because you could clearly see the steps in the process towards the vision even if the world wasn't ready for that vision yet.\n\nThe Meta situation looks a lot more like, \"The business that got us here is facing major threats so we better come up with something else.\"", "score": 40, "replies": [{"body": "In the early days Jobs copied everything off of Xerox, the mouse the graphics interface. He just presented it in a more marketable package. Didn't Musk buy Tesla? Didn't Gates buy DOS? \n\nThe true Visionaries that create stuff have no interest in starting a company. It's much too boring to them.\n\nBringing something to Market is a totally different talent that Jobs and Zuckerberg and Gates and Musk have. You have to be able to hire people, fire people, yell at people (have to be an asshole), deal with suppliers, deal with deadlines, deal with contract wording, deal with advertisers, make technological trade-offs, make public speeches, go in front of Congress etc", "score": 58, "replies": [{"body": "There's a difference between taking something and vastly improving it to where it's a fairly incredible success, and taking something and making an equivalent or worse version of it.", "score": 8, "replies": []}, {"body": "There's a sorting algorithm that gates had credit for that was for w while, the best in its class. Whatever else he has going on gates is an intelligent person", "score": 7, "replies": [{"body": "Sorting algorithms are not Visionary though. Figuring out why you don't need one to begin with would be. Visionary are more about creativity versus pure intelligence. I believe Gates and Zuckerberg both have perfect SATs, no dispute that their intelligent", "score": 5, "replies": []}]}, {"body": "Okay, but compare what Apple offers now to what they put out back when they copied everything from Xerox. That was the first step that got him started but his visionary genius evolved way, way beyond that. What has Zuck done with Whatsapp since he bought it? How about Instagram? His big innovation for Instagram has been to make it more like TikTok.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Sure but he's made a shit ton of money off (1) a website he developed 15 years ago that he didn't even develop himself and (2) another website/app he bought because he recognized it as a competitive threat to (1).\n\nWhat else has he done? He tried his own coin, which failed. He tried Facebook dating, which failed. He bought Whatsapp and still hasn't figured out how to monetize it. He's been working for years on a VR headset that is still just an overpriced niche product.", "score": 1, "replies": []}]}]}, {"body": "I think it becomes hard when you launch a product, make billions out of it and try to repeat the success. He wants to do that to prove he’s a visionary but it could also lead to the demise of the first project and all will fail", "score": 4, "replies": []}, {"body": "I never believed Mark Zuckerberg as a legit genius in the space. If you saw the talk he gave at Harvard early in FB’s days, it’s not like they were doing anything extraordinary innovative from the technology side. He talks about how FB is built off a LAMP stack. FB then blows up off of well built features that associate users with their local communities rather than being a pure randomized mess like MySpace. The fact that FB was able to put a bunch of familiar faces in front of it’s users led to people staying on the app. The biggest draw to FB (and I’m sure many others can attest to this) was seeing the photos of people you knew. Then Instagram comes out and FB makes a good acquisition. Smart acquisitions have been carrying FB the last few years moreso. I can’t count off the top of my head the amount of absolutely awful features used to exist in FB that got retired. The era of FB pokes and built in games, random FB pages that people liked. Today FB gets by through mimicking it’s competitors (dating, stories, etc.) and the one legit piece of functionality that was even worth advertising which is FB groups.\n\nMaybe Zuckerberg has a vision for socialization in digital space..oh wait people have been doing that for years in video games", "score": 13, "replies": [{"body": "Man I remember those days when FB came out. I had poke wars that lasted for years lol.", "score": 6, "replies": []}, {"body": "This is what all of the mega techs do to stay ahead of competitors.. if you can’t build it, you buy it via small bolt-on acquisitions that add some special capability that makes their product or service unique", "score": 1, "replies": []}]}, {"body": "Nobody is saying metaverse and vr/ar arent going to be huge.  But most ppl think thats 10-15 years from now.  Meanwhile meta is spending like any year there will be a breakthrough at any moment despite decelerating revenue growth from their metaverse", "score": 14, "replies": [{"body": "> Nobody is saying metaverse and vr/ar arent going to be huge\n\nexcept for almost everyone.", "score": 28, "replies": [{"body": "AR is almost certainly going to be huge. VR has some uses but is primarily a stepping stone as the tech issues for getting usable AR out are being worked out. Metaverse is a loaded term but you can think of it as the operating environment in AR / VR.", "score": 14, "replies": []}, {"body": "Who?  big tech (is investing in it and nobody is angry.  Its a common trope in sci fi when vr becomes indistinguishable from reality.  \n\nPpl r angry specifically at meta for how they are going about this.\n\nEdit: Oh sorry yeah i meant vr/ar.  A lot of ppl r saying metaverse is gonna fail i get what u r saying", "score": 7, "replies": []}, {"body": "Pretty sure \"everyone\" said the Internet wasn't going to take off in the 1980s.\n\n\n\nSame for the upcoming market crash predicted for the last 10+ years.\n\n\n\nI have friends in med school and other grad schools who use VR for their remote lessons and practicals.\n\n(A bit of an overkill for just lessons, but to each their own).\n\n\nI think the infra and tech capabilities are lagging a bit, but if I could use VR instead of 2-3 monitors (almost have a 360 of monitors), that'd be amazing.\n\n\nIt'll be overkill at first and super confusing, but also very, very helpful - I'd have personal stuff, work stuff, todo lists, calendars, etc. all in like a different quadrant", "score": -1, "replies": []}]}, {"body": "Will it? Most everyone I know who has a VR headset got sick of it within a few weeks. Maybe for some jobs or uses it'll be around, but I don't think people want to sit around with headsets on. The novelty wears off fast and for most things VR just adds extra steps to existing solutions without much benefit.", "score": 9, "replies": [{"body": "IMO part of why there's so much AR/VR hype is because the costs of the tech have come down enough for it to be viable to sell VR sets to consumers. Prior to recent years about the only places you saw them was in a theme park, or in certain industries with the money to spend where VR can be helpful at training (from what I understand surgeons and pilots in training sometimes use VR to practice before the real thing).\n\nBut like with the 3D TV, just because it's technically viable doesn't mean it'll stick around. I think 2D and 3D gaming is just fine for a lot of people. There's many who refused to switch over to 3D games because it just makes them dizzy, the same will no doubt be true about VR for some.", "score": 8, "replies": []}, {"body": "I want to know what jobs can benfit from being in a more VR setting while working? When, due to the pandemics many compaines have already adopted systems for at-home or long-distance working. Also, I want to know how many companies would invest in thses headsets? Not every company is big enough to give all there employees a head set, nor would they want to invest in it if they didn't see a postive change for them. Maybe equipting a few smaller metting rooms with the head sets is a more realistic buy. But I still feel like it's pointless if workers already can video call long-distance team members at there desk/cubical.\n\nI cannot doubt, some people may enjoy/work better when being in a VR setting, but that isn't going to be every worker.", "score": 1, "replies": [{"body": "I would think things like engineering or design where you could interact with 3D environments. Or for training in things like surgeries. \n\nIt sounds awful for meetings though.", "score": 3, "replies": [{"body": "I forgot about jobs like that. I do agrees jobs/companies in those areas may really benefit for VR/AR.\n\nThe reason why I brought up meetings, is I thought the metaverse was being advertised to _every_ type of job in any industry.", "score": 1, "replies": []}]}]}]}]}, {"body": "I saw a reflection about how when apple developed the iphone they made each generation fund the following generation.  They started generating revenue first and proof of concept.  3b initial investment where meta is looking at 10x already.  Projections look closer to 200b in first decade.   \n\nI don't understand why they can't just dial it back a bit.  I think metaverse will be a thing but who is to say they don't make the tech then it just gets poached in the first year.  That's a big investment down the drain.", "score": 2, "replies": [{"body": "Maybe because they know their current business has peaked already, Zuck knows that if he doesnt pivot into something else the company is just going to fade away", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "You know who is hiding progress on their AR/VR Gadgets? Apple. They might eat Zucks lunch one day all of a sudden.", "score": 7, "replies": [{"body": "No doubt, Apple is slapping an m1 chip into a headset and it might be incredible. And then VR/AR will become commonplace, through the power of apple.", "score": 2, "replies": [{"body": "Also you know all those influencers are going to wear the future ultra fashionable gold apple glasses because it gives clout", "score": 3, "replies": []}]}]}]}, {"body": "It's stupid, imo. The market for VR applications, today, is 170m people worldwide. That's the number of VR users worldwide. \n\nhttps://www.zippia.com/advice/virtual-reality-statistics/\n\nAnd a number of those VR users are using things like Labo, and Google Cardboard. Yes it may grow by some percent y/y, but that is still an incredibly small market for years to come. Meta needs to survive *today*. Because it is *burning capital today*.\n\nAnd given the fickleness of the general public towards social media companies, they really don't have the ability to sit and wait for the market to grow to an appreciable size to make this foolish spending worthwhile.\n\nAlso, VR has practical barriers to market penetration, like latency and bandwidth requirements on connectivity, and people getting VR sickness.\n\nPlus you have the general scarlet letter that Zuckerberg carries in the eyes of a lot of people.", "score": -1, "replies": [{"body": "One correction: you make it sound like they’re spending all their money on the metaverse and having trouble surviving. We’re still talking about a company that makes over 100 billion a year, and as pointed out only 18% of their total spending (not revenue) went to the metaverse. The rest of their business has almost 40% profit margin. They’re not exactly struggling to survive.", "score": 40, "replies": [{"body": "It’s no use. Reddit now believes META does not make money and they are negative due to spending all of their money on metaverse.\n\nHonestly, let the FUD continue…this is an easy DCA target for me.", "score": 46, "replies": [{"body": "Ya this is like when bill ackman went to CNBC and cried about how COVID was destroying the economy and everything would end in disaster, caused a huge sell off and then proceeded to put literally every last cent he had into the market that night. I feel the Fud and it could easily be the same guy pushing it.", "score": 8, "replies": []}]}]}, {"body": "They're trying to be the first true VR platform and create their own monopoly on that market. It's all about getting into devices so they can force how users see ads which = more ad revenue. \n\nThey're also aware that current state VR headsets aren't ideal and won't be used in its current state. IF they can get them down to a lightweight more discrete model then it will take off.", "score": 5, "replies": [{"body": "That is key to VR working on a larger scale. Right now the best headsets are wired to a computer. If you are going to have mass adoption it has to be a standalone device. That is the direction Meta is going. \n\nFeel like all of the push back Meta is getting is the reason apple keeps their R&D projects so secret.", "score": 5, "replies": [{"body": "It essentially needs to be a micro computer fit into eye glasses. Which is a massive undertaking, and a technological breakthrough for our world.\n\nIts such a large ask that I understand when Mark says they're 5-10 years away. Its also such a large requirement for success which has risks. As an investor, I'll be waiting awhile to buy Meta stock even though I'm high on it.", "score": 2, "replies": []}]}]}, {"body": "> It's stupid, imo. The market for VR applications, today, is 170m people worldwide. That's the number of VR users worldwide.\n\n\nYou can grow that market if you offer a good product. Google Cardboard was trash", "score": 5, "replies": []}, {"body": ">And given the fickleness of the general public towards social media companies, they really don't have the ability to sit and wait for the market to grow to an appreciable size to make this foolish spending worthwhile.\n\nI think you're wrong there. Given the fickleness of the general public towards social media, it would be foolish for Meta to ***not*** put money into other projects so they're not reliant on being the trendy place to be. Being the biggest fish in that market simply isn't enough anymore.", "score": 2, "replies": []}, {"body": "AR is a big part too not just vr.", "score": 1, "replies": []}, {"body": ">Plus you have the general scarlet letter that Zuckerberg carries in the eyes of a lot of people.\n\nAnd the current users of VR(early tech adapters) are the ones most likely to shun him. \n\nIt's like kanye starting a yarmulke clothing line.", "score": 1, "replies": []}]}, {"body": "He's not a visionary.\n\nFacebook was just another social media platform when it launched, just happened to get lucky with popularity and become dominant among social media users.\n\nThe metaverse, whenever it launches, will just be another VR chat game that relies on getting lucky to take a significant market share.\n\nBut, the group of people using VR chat is incredibly small in comparison to the group of people using social media. Even if they achieve complete 100% dominance, it's going to be damn near impossible to recoup investments on such a small block of users.", "score": 1, "replies": []}, {"body": "Agree.  Note that it's not the first time that Zuck has seen around a corner, invested, and overcome an existential threat.\n\nHe has a good track record of success, but is this time a miss?", "score": 1, "replies": []}, {"body": "Or not take your bets. You do not have to be early on this one. You can wait out the spending thrift of billions and billions of losses in the Reality Labs and park your money in other investments untill the time comes for Meta to be on your watchlist again.\n\nOwning a stock is not a binary move in that you either own it now or will never in the future again. You can opt in and out of the same stock for multiple times if you like. \n\n''The stock doesnt know you own it'' - Peter Lynch", "score": 1, "replies": []}, {"body": "I am going to bet he Runs the company into the ground, then we get the Traditional (CEO Steps down Amid.....) Grabs his cash hoard at credit Suisse and wakeboards his way to one of his many islands. never to be seen again", "score": 1, "replies": []}, {"body": "AR will be a better investment than VR", "score": 1, "replies": [{"body": "Meta is investing in both", "score": 1, "replies": []}]}, {"body": "> Mark is a visionary genius\n\nWe know it's not this.", "score": -1, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "> the guy saw a path to make billions\n\nSteal an idea and have no moral limitations on what you are willing to do to make it.", "score": 3, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "[removed]", "score": -4, "replies": [{"body": "Because you don’t have the vision for it", "score": 5, "replies": []}]}]}]}, {"body": "Making billions can be done with simple good business sense and/or luck.\n\nBeing a visionary demands seeing something noone else does or atleast noone else believes can be executed on.\n\nMusk, Gates, Khan, Wales, etc. These men are visionaries, AFAICT Zuck was just in the right place at the right time with some maybe low-tier visionaries to help get Facebook going. The rest of it he bought, i.e Insta, WhatsApp.\n\nSo in his case yeah, probably some good business sense but mostly a hell of a lot of luck.", "score": 2, "replies": [{"body": "So funny you lead with Musk, the ultimate guy-who-poses-as-visionary-founder", "score": 0, "replies": [{"body": "Musk gets into Tesla (not even technically a founder), declares the mission statement of the company is to accelerate the adoption of EVs and renewable energy. Spends ~20 years making that happen even when other autos abandoned EVs as technically infeasible or economically unviable. Not to mention reimagined vechicle construction techniques and revolutionized the role of software in automotive industry.\n\nYeah I would say that counts as visionary by itself.\n\nSpaceX though is where it really happens. Dude wanted to send a rocket to Mars. Tries to buy rocket from Russians who essentially make fun of him. Says ok, fuck you guys. I will build my own fucking rockets that will not only go to Mars one day but will make yours irrelevant in the process. If only out of spite, invests pretty much every dollar he has into making a new launch vehicle reality (which is usually just how you lose all your money) and a) somehow does it and b) entirely changes the launch market forever.\n\nGoes on to create the first proper reusable space launch vehicle, returns domestic human rated space flight to the USA, launches the worlds first mega constellation, etc.\n\nSay what you want about Musk, that he is an asshole/tyrant, full of shit occasionally (well most of the time), or whatever (I would probably agree with all of that btw).\n\nBut there is no doubt that the man has vision.", "score": 16, "replies": [{"body": "> But there is no doubt that the man has vision.\n\nAnd, crucially, lots of money.\n\nI think part of the reason the “Musk, grand visionary” narrative rubs people the wrong way is that he’s clearly very, very driven and single-minded. That in itself is a talent. But he can also use his giant chequebook to hire the best people and tech to make his vision a reality…which is not the same thing as him being a genius inventor or the next Tesla. \n\nIt’s the same reason the Steve Jobs mythologizing was so annoying. The true person who turned Apple round was the designer who invented the iPod and the coloured iMacs.", "score": 1, "replies": [{"body": "He didn't have a giant checkbook through the roughest days of SpaceX or Tesla, that bit is often forgotten.\n\nPeople only remember the recent history where he is the \"worlds richest man\". Not the parts where he sold every liquid asset he owned to get Falcon 1 off the pad or essentially begged the other members of the Paypal Mafia for a few extra dollars to keep going.", "score": 1, "replies": []}]}, {"body": "Literally the only reason OEMs are switching to EVs now is because Tesla was stealing their lunch, and was about to take dinner too. It's amazing how much the majority of reddit will refuse to admit this and hide behind 'err he just bought tesla he didn't found it' while completely ignoring that.\n\nAnd yea, SpaceX is even more impressive, but the hate boner must rage. Dude brings a lot of it on himself, but fuck are people ignorant to the truly impressive feats he has managed to accomplish.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "He's right and wrong. Facebook is absolutely doomed, but he's found himself in a sunk cost fallacy, and I can not see how it relates to the metaverse. The metaverse by definition is web3. What has he done to integrate into the crypto sphere of web3 and the future of the internet?\n\nBy comparison, gamestop has already built an nft marketplace, launched it, integrated it on immutable x. There has been billions dollars invested in nft gaming already, and this is happened in under 2 years by a micro cap company. Launching into a potential trillion dollar matket. Facebook is more than likely done, they just have this one thing they are working on, that they hope might pan out, and maybe be integrated somewhere? But hey, it has legs? Whatever that means?\n\nI personally think virtual reality is still years away from its potential. It's like original Nintendo compared to Playstation 5. To me personally, that says years of investment, time, research, and development. That Facebook may or may not have. It's investors may or may not tolerate.", "score": -1, "replies": []}, {"body": "It's both. He's visionary AND will run company in the ground", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I actually think his vision is good,  just bad timing", "score": 2, "replies": []}]}]}, {"body": "You mean either it is going to succeed or fail. He could be a reasonably intelligent man who is in a difficult position and may as well bet his company on inventing its way out of being doomed. Doing nothing guarantees failure. This gives some slim chance of success.", "score": 1, "replies": []}, {"body": "I don't think it's either.  Regardless of what history calls him, I think he's let his ego take control at this point.", "score": 1, "replies": []}, {"body": "Meta needs a way for you to do VR and drink a beer.", "score": 1, "replies": []}, {"body": "Very much this. I have a feeling he is 3 moves ahead of the mainstream right now. I  don't do speculative plays typically but I have a feeling that buying leaps might be a great play for Meta.", "score": 1, "replies": []}, {"body": "Somewhere in the middle \n\nI do definitely think a ready player 1 future is in play in 50-100 years. I don’t see massive adoption for awhile though. I think the online group hangout events are kind of lame. Wearing an Occulas all day sounds boring", "score": 1, "replies": []}, {"body": "I just think he’s a VR Chat Fan and wanted his own version which is supposed to be more…’Mature’.", "score": 1, "replies": []}, {"body": "Remind! me in 10 years", "score": 1, "replies": []}, {"body": "He can’t see around corners unless there’s a dupe on the other side dumb enough to tell him what’s around there so he can steal their idea.", "score": 1, "replies": []}, {"body": "Place a bumble bee bet on the high speed dirt kiss...", "score": 1, "replies": []}, {"body": "Both I hope.  It'll be a warning for others.", "score": 1, "replies": []}, {"body": "Hate me if you want.\n\nI'm with zuck here.\n\nFriends and family have a ton of kids and more and more kids play, want to play or get a VR headset.\n\nI feel like: old men yelling at the sky..\n\n\nWhats most surprising: young women are very interested in it.. consoles: mostly boys, vr? Seems to be even . With a slight more interest from girls.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Girls : all of them, from 8 to 14, after that i age i think they are more interested in meeting boys and or are not open enough anymore. \n\nBut bellow that age. All of them are interested in vr.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't know. \n\nLet's see if they stay growing up with :)", "score": 1, "replies": []}]}]}]}]}, {"body": "Mark was never a visionary to my knowledge Facebook was a team effort and somehow his team \"left\" him. Sucks own achievement was a sexist women rating platform.\n\nThat's all he did. Everythingelse meta got was either copy cat or bought companies that were more popular then Facebook.\n\nMetaverse also isn't marks idea. The idea is around since 2011 all over silicon valley as I heard. Was kinda surprised that mark anounced his plans and not having an almost final product in fact it feels like they just started developing as soon as he went to the public.\n\nGiven it's a famous concept since 2011 and noone else tried to show similar stuff to the public i think it's a very difficult topic.", "score": 1, "replies": []}]}, {"body": "Trying to build a disruptive emerging technology can either be the best idea or the worse idea.", "score": 153, "replies": [{"body": "U2 used to be super creative and make great albums but they got super wealthy, out of touch, and aged poorly and now put out dogshit. Zuck is the U2 of the tech world.", "score": 47, "replies": [{"body": "And then one of their albums got put on your devices without your permission for like a week.", "score": 25, "replies": [{"body": "Dude how the hell do I get rid of this album?!", "score": 3, "replies": [{"body": "I’d google it. It’s been a long time since I had to do it. I think there’s something online you have to do.", "score": 3, "replies": []}]}, {"body": "It’s still on mine. Followed me for years. Never listened to it once", "score": 1, "replies": []}]}]}, {"body": "Or even the worst idea", "score": 2, "replies": []}, {"body": "But first there needs to be an idea. Metaverse sounds more like zuck promising us an idea he hasnt come up with yet.", "score": 1, "replies": []}, {"body": "Yeah obviously he's trying to build a new revolutionary tech in a big company which doesn't really happen.  And the stockholders now know this.  So either gtfo out stop complaining.  If you want a say, go buy some other company's stock.", "score": 1, "replies": []}, {"body": "The problem is that the tech is not there so betting the whole company on this makes no sense. I've tried the Quest 2 and it is not something even I wanted to keep and I buy most of the interesting gaming things. The games on those things are not that great and while I saw a few cool 3D things on Youtube it really didn't feel all that different from like watching Avatar in 3D. It was cool to do once but it's definitely not the iPhone.\n\nNow once it's lighter and higher resolution and better lenses and some interesting experiences, I'll give it another chance. So in like 3-5 years.", "score": 1, "replies": []}]}, {"body": ">\"Meta executives tried to head off the unrest by pointing out that 82 per cent of the company’s spending in the latest quarter was on its existing services, rather than the metaverse.\"\n\nThis point is very important but seems to always get ignored", "score": 562, "replies": [{"body": "Doesn’t Meta have hundreds of billions in cash? I remember before all this meta verse story started they had a ridiculous amount of cash on hand with not much to spend it on.", "score": 148, "replies": [{"body": "They have a cool 60bn cash", "score": 138, "replies": [{"body": "And how much have they “wasted” so far on futuristic tech that they bet everyone will use?", "score": 39, "replies": [{"body": "Again they spend so far 18 billion on metaverse however reality lab has revenues of around 2-3bn per year so only 14bn. Companies need to adapt and that's what the smarter than you people at meta realized. Their apps are at full profitability to they are using those cashflows for investment in what they expect to be the next big things. Otherwise they will just stop innovating and die as a company", "score": 91, "replies": [{"body": "That’s revenue(sales), not income (profit)", "score": -8, "replies": [{"body": "And the 18bn isn't a loss, it's an expense", "score": 38, "replies": [{"body": "When expenses exceed revenues what’s left is a loss", "score": -6, "replies": [{"body": "This comment has been removed in protest of Reddit and their CEO Steve Huffman for destroying the Reddit community by abusing his power to edit comments, their years of lying to and about users, promises never fulfilled, and outrageous pricing that is killing third party apps and destroying accessibility tools for mods and the handicapped. \n\n\nCurrently I am moving to the [Fediverse](https://www.youtube.com/watch?v=pX_agVMr2r0) for a decentralized experience where no one person or company can control our social media experience. I promise its not as complicated as it sounds :-)\n\n\nLemmy offers the closest to Reddit like experience. Check out some different [servers](https://join-lemmy.org/instances).\n\n\nOther Fediverse [projects](https://joinfediverse.wiki/What_are_Fediverse_projects%3F).", "score": 14, "replies": []}, {"body": "Meta made over 10 Billion dollars in profit last quarter. After expenses. Their users have increased 33% in the last 3 years.", "score": 7, "replies": []}, {"body": "Yes so I was subtracting the revenues from expenses to get a loss. What's wrong there?", "score": 0, "replies": []}]}]}, {"body": "Yes exactly but you subtract revenues from expense to get the loses. What did I say wrong?", "score": 2, "replies": []}]}, {"body": "Holy shit, revenue of $2-3B already for Reality Labs? That’s what failing looks like for a huge company!", "score": -2, "replies": [{"body": "Oculus was a thing long before Zuckerberg started hyping this metaverse thing. It’s not huge market but some people do buy VR headsets", "score": 1, "replies": []}]}]}, {"body": "20 and 40 next year", "score": 17, "replies": [{"body": "Source for 40b next year?", "score": 3, "replies": [{"body": "Total expense not just vr", "score": 0, "replies": []}]}]}, {"body": "but its to early to say its \"wasted\". Not saying its going to be worth it but you cant say its a waste just yet.", "score": 1, "replies": [{"body": "That’s why I put it in quotes", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": -16, "replies": [{"body": "What’s the complaint here, that they earn too much money? Meta stock is down huge.", "score": 18, "replies": [{"body": "I personally think that Zuckerberg is being rational. Facebook was always really just an app & social trend. It's easily able to be disrupted as it basically has no moat except the games its leadership can play with its war chest. For a long time, Facebook has avoided becoming as obsolete as MySpace by buying its competition. What it's doing currently is on the same track -- it's facing obsolescence and is trying to buy its way out, this time by inventing Metaverse, so it can be a first mover in the next place it wants social media to move to. \n\nBut IMO there's a limit to how long Zuckerberg can continue to buy Facebook out of obsolescence, and whether or not it succeeds with META, it's only a matter of time before it fails to compete.", "score": 7, "replies": [{"body": "Correct. Social moves fast, you can play catch up your whole life or you can take a stab at innovating.", "score": 2, "replies": []}]}]}, {"body": "Tech companies aren’t gouging the middle class. That’s the difference", "score": 5, "replies": [{"body": "Tech is being propped up by government, just in different ways. Why do you think we have the shortages and high prices that we have -- it's not high oil prices driving inflation, but vice versa. \n\nOur tech sector can't compete with China's. We started and have been prosecuting an escalating trade war with our biggest trade partner on whom we are dependent for manufacturing, for years. The trade war started when Huawei suddenly jumped ahead and began to threaten Apple's dominance in cell phone technology and communication services, and it's been escalating ever since, beginning with the tariffs that amount to more than 1% of inflation we experience today to the high prices of things caused by chip shortages due to our chip war (a tech warfront that we just escalated dramatically). \n\nMost of the inflation we are experiencing today is due to this trade war and trade protectionism to protect US tech companies against Chinese tech companies' remarkable competitiveness by blocking their advances, and that's why the Federal Reserve has to raise rates high enough to start a recession in order to halt an inflationary spiral. \n\nAll of this inflation is an invisible tax on consumers, on savings and it mostly hurts low wage earners the worst, and it's mostly to protect the massive global dominance of US tech companies that have been failing to compete against the technological advance of Chinese tech companies. Some people can't put food on the table, because Apple, Nvidia and US chipmakers have to be #1, and the US would rather get into a trade war than fix our public educational system's problems to enable us to be more competitive.", "score": -5, "replies": [{"body": "Thank you for this message.  \n\nIt means that no matter how bad or dumb I feel about my rationale for making a pick is.  There will always be someone with a hilariously worse take.", "score": 4, "replies": [{"body": "Right? There a whole bunch to try and unpack here but trying to pin all or most of inflation on apple is just a different class", "score": 1, "replies": []}, {"body": "If you actually listen to stock coverage on market news channels, you might hear people like federal trade policy officials from the Commerce Department, literally openly talk about how successful the trade war has been at hobbling Huawei and protecting US tech companies' global lead. \n\nBut then, you'd have to get out of the bubble you're in and expose yourself to material on foreign trade, foreign policy and foreign diplomacy, [like this article, that briefly reviews the US government's war against Huawei.](https://thediplomat.com/2022/05/where-is-china-us-technology-competition-going/) The trade protectionism isn't about Uighur Muslims or Taiwan. It's about pumping up US tech mega caps and market dominance. It's about keeping Apple on top. \n\nThe astounding market cap of Apple & some other US tech companies that have defied gravity and blown past records, and the windfalls many investors have been enjoying is, in part, funded by the inflation that low wage earners have to struggle with due to this trade war that is entirely for and about keeping these companies on top of the global tech advance leaders.\n\nEdit: This is one reason why I don't invest in tech. I feel all these government market manipulations to pump them are predatory and immoral, and it goes beyond just everyone in government being invested in these stocks as they do everything in their power to inflate them. The ultimate cost of government-led market manipulations fall on the poor.", "score": 0, "replies": [{"body": "Lol", "score": 0, "replies": []}]}]}]}]}, {"body": "Makes sense. The fossil fuel industry received [almost $6 trillion of subsidies in 2020](https://e360.yale.edu/digest/fossil-fuels-received-5-9-trillion-in-subsidies-in-2020-report-finds) and has been receiving unneeded subsidies for decades. Time to start paying some of that back.", "score": 3, "replies": [{"body": "What a bullshit article. 8% we're direct subsidies and 92% we're implicit? Horseshit", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 8, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules\n\nPersonal insults, personal attacks, demeaning speech, partisan political shit-stirring. This commenter received a second flag from the toxicity automoderator.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "As a mod, you should know to keep political rhetoric / commentary out of /r/stocks.", "score": 2, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Imagine complaining about partisan trolls after trolling from a purely partisan position", "score": 0, "replies": [{"body": "Biden's broad attack on the energy complex is literally all over mainstream and financial news today as a partisan political stunt. \n\nBiden has made tax threats against an entire industry, using slurs and hostile language, based on the companies' earnings reports and that makes it an actual current news topic of financial outlets. Even top liberal economists like Larry Summers are calling it out. \n\n* [Biden paints oil firms as war profiteers, talks windfall tax](https://apnews.com/article/biden-business-prices-government-and-politics-ba71f46a47c2be5a2ffd58a258796260) (AP News)\n\n* [Biden calls on oil, gas companies to stop 'war profiteering,' threatens windfall tax](https://www.reuters.com/business/energy/biden-address-oil-company-profits-430-pm-remarks-2022-10-31/) (Reuters)\n\n* [Biden’s oil windfall tax would backfire, warns Larry Summers](https://www.cnn.com/2022/11/01/economy/larry-summers-oil-profits-windfall-tax) (CNN)\n\nAnd that's not even financial news journals, which are far more explicit in calling it a hack political stunt. \n\nSo is everyone supposed to not be allowed to discuss it, because discussing a hack political stunt to manipulate markets is by definition political? When a president goes there, people should be allowed to admit what's happening.", "score": 0, "replies": [{"body": "u/stocks-ModTeam, okay so what does and doesn’t count as political shit stirring. Am I allowed to respond or will I get banned? Am I allowed to point out the flaws in this political grandstanding or will I then be accused of political grandstanding", "score": 1, "replies": [{"body": "Firstly, I don't ban people who aren't spam bots or obvious trolls. Secondly, my comments are based on what is literally headline news across mainstream media today that happens to ALSO be a matter of financial debate, which is rare. \n\nLarry Summers (Obama Administration economist) himself raised this argument when he compared Exxon's profits with that of other companies (i.e. tech companies & S&P majors that experienced a pandemic bubble):\n\n> “If it is a fairness argument, I don’t quite follow the logic since even with the windfalls Exxon has underperformed the overall market over the last 5 years,” said Summers.\n\nhttps://www.cnn.com/2022/11/01/economy/larry-summers-oil-profits-windfall-tax\n\nIf people don't want to respond on point to arguments that it's unreasonable to threaten windfall taxes on an industrial sector while pandemic-inflated tech companies like META are free to recklessly burn through cash they piled up during the lockdowns, they don't have to. But it's headline news and it's relevant to investors. It's not empty \"political shit-stirring\"", "score": 0, "replies": [{"body": " I literally tried arguing on point, and all that came of it was your accusation that I’m a troll. Then you deleted your own off topic rants, and now you’re trying to claim that you’re the one being censored and nobody wants to argue your points. So no, I think we’re done here. And I apologize to the rest of the mod team, I’m sure stunts like this get tiring.", "score": 1, "replies": [{"body": "I didn't delete anything I said. Another mod did, which is their right based on their opinion. I'm not going to undelete something an /r/stocks moderator chose to remove because they were uncomfortable with it, even if the comment they removed was mine.\n\nI think you're projecting a lot of hostility and agree that it's best to stop.\n\nEdit: The comment that *I* removed was actually flagged by the toxicity automod and contained a string of insults and accused me of being a political operative:\n\n> Firstly bud, if you don’t want to talk politics, don’t bring them up in the first place, nobody is forcing you to run interference for Republicans. And if you’re not voting, extra stfu. You and you alone have decided that your political opinions and views are worthless.\n\nThat's not an on-point response to the content of someone's post. It's aggression. I don't see how removing that comment could be trampling on your feelings. I don't think /r/stocks tends to ban people, but just remove uncivil content, which is a mild way to manage a forum.\n\nAnd I'm not a political operative, I'm a commodities investor who can get triggered by an attack on an entire industry because it disrupts my markets. \n\nI think it's best to move on so I'm disabling inbox replies.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You should move to Russia if you don't like a free market and capitalism. See how you feel one year after living there. All thos companies provided a valuable service hence their profits are the rewards.", "score": -8, "replies": [{"body": "There's no need for personal attacks in a topic that is entirely rational. This is a stock forum, not some political facebook group that welcomes drama that arises from us-vs-them conflict. Please remember civility.\n\nI'm not the only one calling out the hypocrisy of Biden suddenly after years of pandemic profit bubbles for companies in tech reaping huge windfalls, wanting to impose a \"windfall\" tax falling only on an industry that tends to donate to Republicans. Similar commentary is on the major investment news channels this morning.", "score": -7, "replies": [{"body": "You started the argument so you should look yourself in the mirror before you speak again. I am discussing the free market and capitalism which is the foundation of all stock trading and valuation and you're introducing politics into the discussion via talks about the windfall tax. No part of your comment was about a stock it was very political and then you get offended ha take a hike buddy. You also specifically refer to the companies as 'left-leaning techies ' which again is political discussion rather than company or stock fundamentals.", "score": 5, "replies": [{"body": "Specifically-targeted windfall profits taxes aren't free market capitalism. They are the opposite of that. \n\nAnd in this case, a profits tax for energy companies isn't legitimately a \"windfall\" profits tax because it wasn't an act of God or unexpected circumstances that has caused gas prices to rise. The supply shortages and price increases started back in 2021, due to too many constraints and limits on oil production and ESG investing activism starving the industry of capital for investment. The high prices are the result of leaders' environmental policies and activism to reduce oil production, while the same leadership and activists have been doing nothing to reduce energy consumption, which is legitimately self-defeating policy and can only lead to price shocks. \n\nIf he were consistent, Biden should allow the high prices to exist, as that's the only way to reduce energy consumption down to levels that match lower oil production. By trying to manipulate the price of oil down by dumping strategic petroleum reserves, to keep prices down and demand up, Biden is reversing the years of work and activism that it took to get to this point. And he's chosen to do that instead of allow high prices to drive down demand, for no better reason than avoiding losing a few more seats in this election cycle to voters who care more about the price of gas than climate change. \n\nI think you're the one who maybe needs to go live in a socialist manipulated economy and figure out whether a \"windfall\" profits tax on an industry that primarily donates to Republicans, over an energy shortage caused by Democrats' energy policies and ESG investing activism, is something that reflects free markets in action.", "score": 0, "replies": [{"body": "Bro I'm against the windfall tax.... How did you not get that? You don't need to convince me it's a bad thing . I thought that you were alluding that social media companies should also have a windfall tax like the one planned on oil companies which would both be completely wrong.", "score": 2, "replies": [{"body": "I'm not saying they should have a windfall profits tax. But I do that if any industries were to be hit by one, it should be the companies that made history with spectacular gains that were due to people being trapped for years by a pandemic. High oil prices that are mainly due to restrictive energy policies of government? not so much.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Well investors really are short sighted. They are upset meta doesn't pay a dividend and let's their apps either and die. If meta introduced a dividend then FB would probabaly be above 1TN still and definitely dead in 5 years", "score": 2, "replies": []}]}]}, {"body": "follow jellyfish nippy deserted gaping fragile scary sense bake reach\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 21, "replies": [{"body": "They do double digit billions in buybacks every year still and cant acquire any companies anymore", "score": 26, "replies": [{"body": "dull vast vase sleep hobbies smoggy sense gullible repeat deranged\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -8, "replies": [{"body": "And how would that expand their future revenues? At least most of their capex increases went into AI infrastructure and data centers to expand the core business", "score": 19, "replies": [{"body": ">And how would that expand their future revenues\n\nIf you're a top shareholder for Meta, watching the company piss away money that traditionally might've been forwarded to you is a much more pressing concern than any prospective technology ten years down the line lol\n\nThis sub always talks about how the market always knee-jerks and accentuates the short-term, so idk why it's so surprising to people that some shareholders aren't happy FB isn't feeding them the piece of the pie they feel they're due\n\nI'm loading the fuck up on FB, I'll take a bit of tinfoil out and say this whole thing is a farce towards fundamentals and reeks of big players trying to strong-arm the company into capitulation. They're worth double their current valuation even if they burn their Meta R&D to cinders and fully revert to their old business", "score": 6, "replies": [{"body": "For sure. I think its strange people are demanding a dividened when Meta has never given one out in its history", "score": 6, "replies": []}]}]}]}]}, {"body": "The entire company was built on a \"high-risk, pet project\".  Why is it so shocking that the person who built it wants to do something similar again?", "score": 2, "replies": [{"body": "practice long desert tease run mourn badge cover carpenter rinse\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -1, "replies": [{"body": "Because they invested in a company with a leader who's entire life success is based off of risk-taking and innovation.  They are mad that they can't change him and force him to heel for them.  But at the end of the day he has always been in charge and they chose to invest in his company, not the other way around.  If you want nice, safe, and consistent, don't invest in FAANG.", "score": 11, "replies": [{"body": "ink encourage adjoining childlike strong snatch quarrelsome ripe sugar languid\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": []}]}]}]}]}, {"body": "Spent a lot on stock buybacks to prop the price while Zuck sold out.", "score": 0, "replies": []}]}, {"body": "I for one am for the first time considering investing in meta.\n\nI don’t like Zuck or facebook but I do respect the chutzpah. I think it is a gamble. Whether they can make it a reality or not. But it’s strategically the right move given how fragile their ad revenue can become. Facebook still gas a lot of top engineers(and posts from their engineers wpuld seem to indicate they believe in this project), and the other places with similar talent are sitting on their haunches waiting to see how this pans out so meta will get the first to market advantage.\n\nZucks controlling stakes means that the company can actually make real long term plays where everyone else is forced into short term plays by impatient investors that are only interested in the next quarter or two\n\nSo yeah, I’m an indexing kind of guy but I might throw my little bit of play money into meta(edit: I actually put in a $5k stake in yesterday. Small fry for some I'm sure, but it still represents more than 1% of my overall portfolio which is generally extremely passive)", "score": 55, "replies": [{"body": "wow that is an amazing point in regards to their strategic advantage. Visionaries arent concerned about short term results, they are in it for the long haul.", "score": 15, "replies": [{"body": "I like to view this in the context of the internet.  I'm not sure if you were around at the time, but I remember Prodigy, Compuserve and AOL and their slow deaths as the internet eventually won.  The internet won because it wasn't controlled by an individual company, and you can see similar behavior in the crypto markets, which facebook floundered at as well.\n\nEven if I thought the idea was good, which I don't, one company controlling whatever the metaverse will be isn't going to last.  Their best case scenario would be the AOL of the metaverse, IMO.  Now if this was something masses were clambering at the bit for being the AOL of it wouldn't be that bad, but they're not, I don't know a single person interested in this (that doesn't work there or have some money in it).  Everyone keeps assuming there is going to be a market for this, but it's never for them or anyone they know... there's gotta be some psychological studies on this phenomenon.\n\nI don't want to confuse this with VR as a whole.  I imagine the rise of gaming and other fun activities in VR will continue to be a thing, and probably naturally spawn some open internet-equivalent final result that catches on.  VR for work is about the dumbest and most niche thing I can think of to sink cash into.\n\nThat said, I still might play with the stock here... but not for long.", "score": 9, "replies": []}, {"body": "That's fine and all but what the market is saying is that they have no idea how to price whatever that is. I don't either. Almost certainly Meta is still way way overpriced if their long term value is all in Oculus.", "score": 1, "replies": []}]}, {"body": "I tend to agree with you. I've never owned Meta in my life, but I bought in this week after the free fall. \n\nIt might pay off, it might not, but I think there are 4 potential outcomes:\n\n1) MV is a disaster, Meta craters\n\n2) MV is a disaster but Meta pivots with some success\n\n3) MV is underwhelming, but the tech involved has niche uses that Meta successfully monetizes\n\n4) MV surprises us all and becomes genuinely successful\n\nZuckerberg might be an out-of-touch oddball, but he's been right before.", "score": 11, "replies": [{"body": "People don’t seem to understand that meta investments aren’t only about VR. It’s also about AI Algorithms", "score": 8, "replies": []}]}, {"body": "Similar deal here, I've traded Meta's stock previously, but after this crater post earnings, I've now bought with a very long term view.", "score": 5, "replies": []}, {"body": "I wouldn't be surprised if Facebook is quite a good buy right now. \n\nMost of my money is managed by Terry Smith - he got quite a bit of backlash from his investors after buying into Facebook a couple of years ago, but he's a numbers guy and his response was simply that \"we're going to remain invested in Facebook because it's profitable\". Smith is a numbers guy, and his metrics are profitability / return on capital, debt, gross margins and growth - he characterises Facebook as a company that sells ads, and all the content it sells ads against is created for it for free by its users. \n\nSmith acknowledged recently (at the last AGM in the spring, I think) that Facebook was spending a lot on R&D for the metaverse, and IMO he doesn't really get it - anyone who's in tech considers the metaverse a waste of time because we've seen VR failing since the 90's; current tech makes VR useful for videogames and specialist niches like architecture, but nobody wants to live in VR. I would argue that the current tech of phones and laptops allow you to pick up and enjoy the internet, but they're a good balance precisely because they don't isolate you from the real world - you can turn away from them and have a r/l conversation. I think Smith & Julian have got it wrong when they compare Zuck's metaverse with the internet of the 90's - they say that nobody back then appreciated how the internet would integrate into everybody's lives; back in the 90's you told your mum \"soon you'll be doing all your shopping and banking online, and you can talk to your granddaughter by video chat\" and she would have chuckled indulgently at such a silly notion. As a member of the terminally online, none of us are cheerleading for VR the way we cheerled for the information superhighway back in the 90's - it's just not interesting and useful in the same way.\n\nBut Smith wouldn't have bought Facebook if it wasn't profitable, and shareholder sentiment is at all-time lows for it right now. \n\n[Over 300 million people in the developing world get basically all their internet access from Facebook](https://www.theverge.com/2022/1/25/22900924/facebooks-free-internet-less-developed-costing-users-wsj) - I believe there are countries in the developing world where companies basically never have their own websites, but just a Facebook page (because the free service doesn't allow access to other sites). Facebook is laying a [23,000 mile fiberoptic cable around Africa](https://www.cnbc.com/2020/05/14/facebook-building-undersea-cable-in-africa-to-boost-internet-access.html) to facilitate access to these markets. Facebook is massive in markets with a growing middle class.\n\nYou can see Smith discuss Facebook in his AGMs, which are on [his Fundsmith YouTube channel](https://www.youtube.com/user/Fundsmith/videos).", "score": 0, "replies": []}, {"body": "Everyone wants fb to be a blue chip, that's why they're acting this way.  If he can flip all the investors to people who want big growth stocks, then everyone is on board for him taking big risks for big rewards.  Its the opposite of what happened with Netflix holders.  All the people looking to 10x left. .and everyone who just want 7% a year hopped in.", "score": 1, "replies": []}]}, {"body": "I'm starting to think what we keep reading are paid-for / supported hit-pieces to attempt to prevent Meta from initially being a controlling factor in VR.  There is simply TOO MUCH NEWS about such a simple secondary play by this profitable company.", "score": 34, "replies": [{"body": "It could be but I think it’s just the last few showcases of the metaverse being so childish in graphics and so bad that even all techies saying it sucks gave a lot of big investors a lot of unease that meta just doesn’t know how to do this at all and mark is in some sort of spell.\n\nIf the metaverse had like call of duty or cyberpunk level graphics and there was some initial interest then maybe. But so far showing horizon worlds, that looks like a bad Nintendo game and saying it’s costing like $10billion and maybe $10b more to add some legs to the characters or something that gives this impression then many out there just loosing trust in mark.", "score": 14, "replies": [{"body": "For an investment sub people really do poor research and meta also poorly advertises their research. This is what they are working on\n\nhttps://m.youtube.com/watch?v=8zRQYEvcuDQ\n\nhttps://m.youtube.com/watch?v=2mnonWbzOiQ\n\nhttps://m.youtube.com/watch?v=x6AOwDttBsc\n\nhttps://m.youtube.com/watch?v=uTFTH43AoiQ\n\nhttps://m.youtube.com/watch?v=v9bbbYcgMqQ", "score": 12, "replies": []}, {"body": "I think they are trying for friendly, peaceful emoji-like graphics.  They are betting on the people using VR to be raised on such muted graphics from the friendly worlds that really young kids grow up on (through TV, games, etc.).  \n\nI mean, look at some VR games (I guess?   I haven't used them, but did watch a couple videos last year) where the characters were better looking.  It's certainly not that they can't do hard-core avatars (or whatever we call the images of ourselves), but they have made an active choice to use those muted characters.  \n\nI don't know exactly what Meta is planning on, but they are aiming for a generation where VR will be even more popular, and that generation is almost certainly no old-timer (meaning anyone over the age of 18) who is posting here.\n\nWhat if... What if... the primary VR market they will be aiming for would be kids under the age of ten?  Establish a generation of being babysat by VR, instead of watching the boob tube (television) or whatever, and with that generation the technology and graphics will grow.  If that's the case, the graphics they have now are absolutely fine for kids to start that addiction / regular use.", "score": 2, "replies": [{"body": "Those graphics might also require less computing power than better looking ones, which will lower barrier to entry", "score": 3, "replies": []}, {"body": "Maybe they should look at what kids of those ages actually are into to market the visuals then?   The building mechanics should look at least as complex as Minecraft and the graphics/colors should look as good as Fortnite, considering these are some of the biggest and most influential games that kids in that age range plays.\n\nEverything Meta has shown off so far reminds me of IOI from Ready Player One.  They want to own the VR world and market/advertise the shit out of it, but don't actually understand why people play it or what caused it to be so popular.", "score": 2, "replies": []}, {"body": "There is a fundamental problem to this idea that VR and Meta is the next big thing. \nAnd it's that no one wants to wear a headset for more than an hour at a time. \n\nEspecially not for work. And definitely don't want to spend their leisure time in VR the way Zuck is pushing. \n\nFor example, I have no interest in Meta VR. But I will buy PSVR2 because there is a legitimate use for it. Which is gaming, and because it will have better games on it. \n\nAnd I will play those games for maybe an hour a week, and I will be happy.\n\nMy friends are all not gonna buy VR just to hang out with me, when we could just talk on the phone, which is easier to use, and will always be easier to use than a VR set.", "score": 0, "replies": [{"body": "At the same time, the real-time apps that people use to be with/chat with friends are being directly cited as why Facebook (and then Meta) stock will fall off.  If today's oldies - like you - still spend time on the phones with each other, and the younger crowd is using real-time apps such as Twitch to hang out (instead of using phones?), then VR would be a logical next step.\n\nI know seme gamers will spend hours, sometimes mega hours, with headsets on just for sounds and voice comms.  It's not like the better ones of those aren't heavier and bulky.  VR will be some part of human life - I guess the question is if it's too soon for that to start now with the technology we have.  \n\nWe may still be in the Commodore 64 days of VR.  I don't know - but I'm willing to be OK with Meta spending some of their earnings on chasing that next step.", "score": 2, "replies": [{"body": "Lol I also use Twitch and YouTube Live. But no one is watching Twitch with hundred percent of their attention. Usually you are on your phone, you know, the same way you also stream Netflix shows.\n\nThere is fatigue involved with VR that isn't involved in other mediums. \n\nFor one, phones are something you use for more than just entertainment. It's a communication tool, and it's easy to carry around, and it has many functions. Hence why it's so ubiquitous.\n\nVR headsets, will not be ubiquitous, because ppl won't be carrying them in their pockets.\n\nI can't browse Twitter while also watching twitch as easily as I can while having twitch on my TV and Twitter on my phone. \n\nI do hangout with my friends in games, but we are playing quality games, like Bloodborne or Elden Ring (or heck Fortnite).\n\nIf Meta had a Fortnite, then I'd see the value. \n\nBut to have a Fortnite level of success you already need a populated platform. To make the populated platform, you need more than one thing.\n\nIf they had focused on making high production value games first, I'd make that bet with you. Because games would bring people to the platform.", "score": 3, "replies": []}]}]}]}]}, {"body": "For real, it’s pretty insane. Meta is going to hold monopoly in terms of algorithms and etc when it comes to the future of VR", "score": 1, "replies": []}, {"body": "It's hard to view it as a simple secondary play when you change the name of the company and stock ticker symbol to focus on it. The way they rolled things out they want people to know this is the future of the company, and want people to talk about it.", "score": 1, "replies": []}]}, {"body": "Ppl would still be angry with meta cost spend but not as angry.  Spending all your cash to stay relevant on top of decreasing revenues is a sign of a declining business.   Meanwhile new incumbents are showing ad revenue growth (bytedance. Amzn, aapl).  On top of a looming recession and higher rates, doubling down on more spending, guiding for even greater losses and insignificant fcf for 2024….\n\nMeta would be a easy buy for me if i had faith in management.", "score": 11, "replies": [{"body": "Apple is making money from ad revenue?", "score": 1, "replies": [{"body": "https://www.statista.com/statistics/1330127/apple-ad-revenue-worldwide/\n\nApple going after meta because they’re cut throat - privacy rights is a smoke screen.  Google pays apple 15 billion a year to not compete.  Hindsight meta should have done the same thing.  \n\nhttps://9to5mac.com/2021/08/25/analysts-google-to-pay-apple-15-billion-to-remain-default-safari-search-engine-in-2021/amp/", "score": 7, "replies": [{"body": "Where are the ads being placed?", "score": 1, "replies": [{"body": "https://9to5mac.com/2022/08/14/apple-more-ads-money/\n\nApple ads revenue currently comes from a handful of sources; App Store Search Ads, ads in Apple News and Apple Stocks (the news sections), and a share of commercials during MLB Friday Night Baseball streams.”\n\nThe article mentions they want to expand in other areas and make ads a double digit billion business.", "score": 2, "replies": [{"body": "Thanks for the info!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "They are sitting on $50 B in cash so they are \"shored up\". And Meta has had multiple times in its past where people doubted their decisions, only for them to be right all along and the stock price surged after. A year is not enough time to call their efforts a failure", "score": 29, "replies": [{"body": "50 billion sounds like a lot but what is it in proportion to their operating costs? What is it in proportion to profits? For a company that large, you need some sense of scale.", "score": 3, "replies": [{"body": "Well for one its probably one of the highest cash piles to operating income in the market right now.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "… but they are still profitable", "score": 18, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "You’re a genius. If profits keep going down, they could eventually be not profitable? Wow.", "score": 5, "replies": []}, {"body": "They have already taken an incredible beating from the shareholders.  As long as they are turning a profit and also investing in their future, there will be people who believe in the vision and buy in.  Maybe not the big hedge funds and the institutional investors, but I don't think that Mark really cares all that much what they think anyway.  He is working now for legacy.  He'll never be hurting for money no matter what happens to meta, this is all about what he leaves behind.  So I wouldn't imagine he is going to spend the rest of his days paying off investors with buybacks instead of R&D", "score": 2, "replies": []}]}]}]}]}, {"body": ">Revenue from \"Family of Apps\" amounted to 27 billion while reality labs totaled 285 million. Seems pretty disproportionate. \n\nIf you're comparing revenues betewen R&D/new innovations for the future against mature products you shouldn't be in tech/growth stocks.\n\nI'm not saying Zuckerberg is right, but the argument you're using here is flawed.", "score": 11, "replies": []}]}, {"body": "This META hate is totally unfounded and is soo off the wall that it seems like the product of a smear campaign. I hate facebook. But Zuck’s right on this one.\n\nIt’s like all of these random internet folks think they know better than Facebook, Apple, Microsoft, and Google, who are all pouring money into R&D into secretive VR/AR development.", "score": 46, "replies": [{"body": "> It’s like all of these random internet folks think they know \n\nit's not just \"random internet folks\" who have been critical of the metaverse lmao", "score": 22, "replies": [{"body": "Yeah it's also a ton of short-sighted investors upset that the company they invested in that was built by a person who took incredible risks and invested everything into his ideas is doing the exact same thing again to try and stay ahead.  They want Meta to act like a nice quiet financial stock and roll all their profits into buybacks and don't spend anything in R&D and just keep doing the same thing until the wheels fall off and then they can sell.  That's not how these innovators think or operate.\n\nRemember how pissed off all the investors got at Bezos for years when he kept rolling all of his profit into infrastructure growth?  I'm hearing a lot of the same noises here.", "score": 15, "replies": []}, {"body": "You're right, only 99% of the critics are random internet folks. Like this entire thread. \n\nFFS half the critics don't even grasp that Meta owns Instagram. But happy to share their thoughts on developing a new consumer electronics platform", "score": 12, "replies": [{"body": "agreed, it blows my mind how people are saying the meta verse looks bad. Its literally in the infant stage.", "score": 8, "replies": [{"body": "And they are only talking about horizon world.", "score": 6, "replies": []}]}]}, {"body": "Most people are very ignorant about VR and the metaverse. I think the main thing is that they are out of touch with new tech and only read clickbait rage articles instead of actual tech sources.", "score": 3, "replies": []}, {"body": "The critics can't seem to distinguish between the \"Metaverse\" (capital M) that Zuck wants as a new social media platform and the \"metaverse\" (lower case m) that is inevitable with the rise of XR/AR/VR.", "score": 2, "replies": []}]}, {"body": "You're right, that 9 billion in R&D is coming along nicely. [Look at those cutting edge graphics.](https://compote.slate.com/images/760b74a3-7156-4dbe-90bd-b021327b6c49.jpeg)\n\nAlso, how's Google Glass doing these days? What about Snap's AR glasses? How's the new Microsoft Kinect?", "score": -10, "replies": [{"body": "Did you go out of your way to find the lowest quality image available to demonstrate your point? \n\n[Meta can now generate photorealistic avatars with full facial control.](https://youtu.be/2mnonWbzOiQ)", "score": 19, "replies": [{"body": "In what way does this improve communication. For virtually every application of meetings, video and sound suffices. What’s the advantage of this stuff?", "score": 6, "replies": [{"body": "To be honest, I felt the same way until I actually tried it and realized that so much non-verbal, subtle communication was lost. Humans aren’t like computers that work in binary. We utilize nuanced body language to communicate.", "score": 2, "replies": []}, {"body": "In pretty much every single sci-fi movie set in the future there aren't tv's, it's always these 3d projectors for everything from entertainment to communication.  I feel like this is the first steps in that direction.  If you can't see the way that this technology can improve communication in the future, I'm not sure anybody could really explain it to you enough to make it make sense.", "score": 2, "replies": []}]}, {"body": ">Meta can now generate photorealistic avatars with full facial control.\n\nI can't wait to be a black woman in the metaverse", "score": 9, "replies": [{"body": "The usefulness of something like this is that photorealism is the highest bar. If you can tie facial expressions to a photorealistic face then you can tie them to any 3D model and still get a diversity of expressions that you would expect from face-to-face interactions.", "score": 1, "replies": []}]}, {"body": "This is nuts", "score": 2, "replies": []}, {"body": "I typed in \"metaverse zuckerberg\" in google. I think you just one upped me with that image, that looks terrible. I thought you were trolling me.", "score": 2, "replies": []}]}, {"body": "Meta Horizons is frankly an afterthought for Meta, and is in no way where they are throwing their money. \n\nThe fact people think they are wasting billions on it is baffling.  They likely are spending practically nothing on it at all, and it's not the focus of their R&D at all.", "score": 20, "replies": [{"body": "Explain to me what happens if everything goes to plan.\n\nI walk around with a headset on doing what? What is their plan to monetize and keep users engaged with VR/AR for years. Sure it's cool to put on for 30 minutes. What's the longterm strategy?", "score": 4, "replies": [{"body": "- high fidelity virtual meeting\n- virtual workspace (higher fidelity interface would yield new UX possibilities)\n- virtual social gathering\n- 360 cinema\n- modeling and sculpture \n- telepresence (you can tour a house you want to buy)\n- gaming\n\nAnd that's just off the top of my head.", "score": 6, "replies": [{"body": "\"High fidelity\"\n\n[https://api.time.com/wp-content/uploads/2021/08/Horizon-Workrooms-Key-Art.png?w=1600](https://api.time.com/wp-content/uploads/2021/08/Horizon-Workrooms-Key-Art.png?w=1600)\n\nhttps://time.com/6091395/facebook-workrooms-vr-metaverse/", "score": 3, "replies": [{"body": "Imagine thinking those aren't basically just placeholders.\n\nImagine picking the work examples to represent a whole tech (conveniently leaving out the photorealistic facetracking demo they released).\nNot to mention fidelity refers to more than just graphics.\n\nI dunno, maybe you shorted the stock or something.", "score": 6, "replies": [{"body": "Imagine spending 9 billion dollars and having to still use \"placeholders\" that looks like The Sims.\n\nStrange that the entire horizons world seems to be cartoonish avatars and spaces but somehow it's going to look completely different from the final product.\n\nMaybe you're bagholding lots of shares, I dunno ¯\\\\\\_(ツ)\\_/¯", "score": 1, "replies": []}]}, {"body": "I point you again to the falacynin assuming Horizons is where their money is going. It's not.  It's probably barely a blip.", "score": 1, "replies": []}]}]}, {"body": "They want to bring the office to your home, and increase productivity through VR.", "score": 1, "replies": [{"body": "LOL so Zoom with everyone wearing headsets over their faces for 8 hours a day?", "score": 6, "replies": []}]}, {"body": "Long-term strategy is innovations that allow integration without the headsets.  Virtual or 3d projectors replacing tv's and becoming the centerpieces of the home or office.  Completely immersive gaming experiences similar to what you see in movies like ready player one or strange days.", "score": 1, "replies": []}]}]}, {"body": "If you think graphics are what make money don't look up the highest selling game of all time....", "score": 4, "replies": [{"body": "There's a difference between a $50 game you play on a screen and asking people to buy and strap on a $1,500 headset to enter and interact (i.e. pay real money) in a virtual world that looks worse than the sims which came out 20 years ago.", "score": 3, "replies": [{"body": "Do you think Horizons is the only app on the Quest?\n\nDo you think the Quest pro is the only headset?\n\nI don't know if you're right or wrong about the future but I do know you're picking just completely inaccurate data to try to make a point", "score": 6, "replies": [{"body": "What else are they spending money on? I'm genuinely curious. I thought the whole stupid secondlife world was their main play. What else is supposed to drive their business for the next decade? What app? Is there stuff outside of headsets?", "score": 1, "replies": [{"body": "Idk for sure but it's not like they don't have a website about it.... https://about.meta.com/realitylabs/", "score": 1, "replies": [{"body": "The only thing listed under apps is Meta Horizon. My point stands. There's nothing else they've showed beyond that shitty second life clone.", "score": 3, "replies": []}]}]}]}, {"body": "I'm not sure how you can be even slightly technologically literate and then make an argument like this.  First adopters always take it on the chin, and technology moves along at an incredible pace.  The cell phones we used to have in the mid-90's cost thousands of dollars and were the size of a shoebox.  Should they have stopped working on that technology too??", "score": 2, "replies": [{"body": "VR and AR have been around for years before Meta bought oculus. The difference is cell phones were novel communication devices, nothing like them existed prior. Meta is entering a world where everyone already has access to virtual worlds, conference calls, meetings etc. It’s not like people are dying to put on a headset and use their cartoon avatar to have a team or business meeting.", "score": 2, "replies": []}]}]}]}, {"body": "This picture alone has cost them billions, and luckily for you that's where your opportunity lies. Look past horizon worlds, it's a damn beta. The big money is going into hardware. Horizon worlds is a great decoy to get paper hands to dump", "score": 2, "replies": []}]}]}, {"body": "Well... It makes things worst. Facebook, even Instagram, are not as competitive as they were. Maintaining them and keeping them up to date is really expensive. Meta's core business is also ailing a good bit.", "score": 2, "replies": [{"body": "My point was that its not money wasted", "score": -1, "replies": [{"body": "It isn't, but it's not a good sign. Slowing growth means they should start paying a dividend, but they won't of course.", "score": 1, "replies": [{"body": "Dividends dont help the company itself, only the shareholders in the short term. Instead they are spending tons of money on AI infrastructure and data centers", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "Tell that to Wall Street Bets and my wife's boyfriend.", "score": 1, "replies": []}]}, {"body": "Which is even more. Fucked up though right!?", "score": -2, "replies": []}, {"body": "How do they spend on other services? they just copy others ideas!!", "score": -3, "replies": []}, {"body": "18% of your companies spending on an unproven project seems excessive, especially when considering the size of the company.", "score": -2, "replies": [{"body": "The man spent 100% of his company's spending on an unproven project at it's inception.  Do you really think he's as timid as these short-term investors when it comes to building the next big thing?", "score": 2, "replies": []}, {"body": "That’s literally every tech start up in the valley, but VC is happy to make it rain with money", "score": 1, "replies": []}]}, {"body": "18% spending on just metaverse is insane", "score": 1, "replies": [{"body": "We will see in a few years if it was worth it or not", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 56, "replies": [{"body": "Can I interest you in MetaCoin?", "score": 13, "replies": []}, {"body": "But now that the stock price went from three digits to two, it must be a good time to buy, right? RIGHT??", "score": 5, "replies": []}]}, {"body": "Listening to the latest earnings call, META senior management seemed very deferential towards Mark. There is no real threat to his standing in the company.", "score": 106, "replies": [{"body": "He’s the controlling shareholder. It doesn’t matter what anyone else thinks lol", "score": 161, "replies": [{"body": "I actually kinda respect him for giving the middle finger to everyone and doing VR/AR, I like the pivot and hope it pays off in the end. Of course I just started buying in so I can only guess how long term shareholders feel.\n\nOf course I also hope they don't focus on selling peoples data as the main product.", "score": 74, "replies": [{"body": "Regardless the outcome of Meta, They're pioneering the way and creating interesting tech along the way. Its not just going to be lost.\n\nEye tracking coupled with real photo accurate avatars (as they demoed with real people) looks insanely interesting, its the closet we've ever seen to showing real virtual people.", "score": 20, "replies": []}, {"body": "I don’t respect zuck at all and actively celebrate everytime the stock goes down. I hope the metaverse ends up being cool and benefits society but doesn’t make a material amount of money so that society wins while zuck loses", "score": -7, "replies": [{"body": "So weird the heavy personal grudge that drives so many Meta bears", "score": 26, "replies": [{"body": "the bears arguments are all emotional based.", "score": 12, "replies": []}, {"body": "I don’t have a position in the stock and won’t ever take one. \n\nZuck personally made decisions that drove polarization in our country for the sake of increasing engagement. He’s a huge piece of shit.\n\nHis shitty algorithms are responsible for why my mom believes insane content like Barack Obama smoking crack in the bathroom with strangers when she never cared about politics before. So… yeah it’s personal", "score": 4, "replies": [{"body": "He didn't create identity politics... that's been around forever, and had been weaponized in the US for decades before Facebook... talk radio, Fox News, etc.\n\nZuck created a new form of mass communication and inevitably identity politics crept in. He didn't make all the best decisions back around 2016 but blaming him for your mom's beliefs is missing the forest for the trees. She would have found her way to that stuff without Meta's help... people don't get tricked into believing fake news, they actively seek it and WANT to believe it because it validates their political identity.", "score": 11, "replies": [{"body": "Could it be that micro-targeting users with fake news influences political beliefs? No, can’t be - advertising products doesn’t work and advertising fake news doesn’t work either.", "score": -8, "replies": [{"body": "If your mom bites into a story that Obama smokes crack, she was never going to vote for him anyway... the story didn't influence her beliefs, it was what she wanted to hear. \n\nMeta tried to stay neutral on the fake news but when that proved to be a mistake, it adjusted its strategy. In the end it's just the medium... the people exploiting it are the real problem", "score": 11, "replies": [{"body": "Yep. Advertising doesn’t work. Echo chambers don’t amplify extremism. Our brains are hardwired to fact check everything we see.", "score": -1, "replies": [{"body": "Meta does do fact checking now, even though it's tricky and controversial. But something tells me it could never do enough to please you. Oh well", "score": 4, "replies": [{"body": "Keep stumping for zuck as he lights your money on fire lol", "score": -1, "replies": [{"body": "Ok", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "You shouldn’t blame your mom being an npc on Facebook", "score": 0, "replies": [{"body": "Honestly have a hard time understanding why you’d waste both of our time with a comment like that", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't respect him. Nobody else has a choice.\n\nDual share structures are absolutely brutal and Mark could go out in front of the media and take a dump in front of the nation and nobody could do a thing.", "score": -1, "replies": []}]}]}]}, {"body": "> Zuckerberg was tone-deaf\n\nYeah, that's pretty on-brand.", "score": 30, "replies": []}, {"body": "If shareholders don't like the direction the company is going, there is an easy solution.  Sell your shares, and invest somewhere else.", "score": 40, "replies": [{"body": "There’s a reason the company is down 71% YTD", "score": 30, "replies": [{"body": "shareholders don't like the direction the company is going?", "score": 2, "replies": []}, {"body": "Almost SHOP levels 🥴", "score": 1, "replies": []}]}]}, {"body": "fanatical relieved treatment vegetable possessive wrong squalid marble whole reminiscent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 25, "replies": []}, {"body": "Zucc should tell them to fuck off, crash share price even more, buy back all the shares, ease up on his meta shit and let the shortage of shares send fb stock to the moon when that advertising money isn't being used on meta shit.", "score": 32, "replies": []}, {"body": "I love VR and all, but I can't see headsets getting to the point where I put them on to do anything besides half an hour of video games in the next 5 years. They need to be as comfortable as sunglasses for me to want to do VR meetings with them. Will technology ever get to that point? Can they do it before they run out of money? Will a competitor be able to do it before then?", "score": 63, "replies": [{"body": "> They need to be as comfortable as sunglasses for me\n\nMeta is working on the tech for rayban glasses for AR", "score": 29, "replies": [{"body": "As a near lifelong glasses wearer I'm deeply skeptical anyone will ever be able to make a good pair of smart glasses that are comfortable to wear.\n\nGlasses usually need to be adjusted in order to be comfortable for long term use. And if the glasses are too heavy then they'll make your nose and ears get sore before long, and given the average weight of a smartphone today I see the weight being a real issue. \n\nOn top of that a ton of people wear glasses, so how are they supposed to use an AR pair of glasses? Wear two pairs of glasses at once and look ridiculous? Use their AR glasses without their prescription glasses, making the whole experience much worse due to their lack of perfect vision? Custom order a pair of AR glasses with the right lenses that match their eye prescription?", "score": 7, "replies": [{"body": "I mean you can’t compare the weight of a smartphone to the weight of a pair of AR glasses. The components of a phone allow it to basically be a handheld computer with a battery life that lasts all day. A pair of AR glasses would not need the processing power that phones are capable of. Just look at Apple Watches/Fitbits. Useful and advanced technology that sits on your wrist all day and you don’t even notice.\n\nI’m not saying we’re close to having AR glasses/if possible at all, but definitely seems very realistic.", "score": 3, "replies": []}, {"body": "Another issue smart glasses manufactures will have to deal with is the direct contribution of users staring at a screen less than an inch from their face to the development or worsening of myopia.", "score": 1, "replies": [{"body": "VR headsets use lenses to focus the image far away, usually at infinity. Manufacturers of smart glasses can adjust the focus point in the same way.", "score": 6, "replies": [{"body": "Good to know, thank!", "score": 1, "replies": []}]}]}, {"body": "You are just talking about the problems meta is trying to solve. \n\nThat is the point of the R&D", "score": 1, "replies": []}]}]}, {"body": "They make more money than they spend and they also have 60bn in cash. Don't worry they are not running out of money anytime soon", "score": 33, "replies": []}, {"body": "And even if they reach that point - is it going to be so much better than Teams or Zoom that it is going to be worth it to upgrade? I have so many meetings online and I don’t see it being a hurdle.", "score": 2, "replies": []}, {"body": "https://m.youtube.com/watch?v=0De4urRohDI&t\n\nhttps://m.youtube.com/watch?v=e1kQ3YEtnxY\n\nDon’t think meta’s metaverse is it.", "score": -3, "replies": [{"body": "What are you even talking about\n\nThese are PC powered single-player games", "score": 8, "replies": [{"body": "Metaverse will only work with pc powered or equivalent. This is way closer to what the metaverse should be. Meta sank 10 billion. Imagine if these devs had that kind of funding what they could create. The tech is there but just needs to be developed.", "score": -4, "replies": [{"body": "The most popular game in the western world is Roblox, a game notorious for its blocky graphics.", "score": 3, "replies": [{"body": "Do you want to play it? I don’t.", "score": 1, "replies": [{"body": "Does it matter? Gen Z / Gen Alpha are all over Roblox. Same with Minecraft.", "score": 2, "replies": []}]}]}, {"body": "They are singleplayer specifically because of the hurdles to make physics-based games multiplayer. This has nothing to do with funding.\n\nIt's okay to not know things.", "score": 5, "replies": [{"body": "Pavlov vr has multiplayer and physics. Pretty sure they haven’t  spent 10 billion.", "score": 3, "replies": [{"body": "The metaverse isn't really about gaming.", "score": 5, "replies": [{"body": "That’s the problem. To get people into the metaverse there needs to be fun, excitement and unique experiences.", "score": 1, "replies": [{"body": "Sure, but that doesn't need to be gaming. Meta wants an iphone sort of moment with this, not a playstation. Going after the gaming market is off by an order of magnitude.", "score": 6, "replies": [{"body": "I think that would be about the only way to interest me in the metaverse. What I’m seeing so far seems bland and uninteresting.", "score": 2, "replies": [{"body": "Yep. I'm not saying it isn't a ridiculous concept.", "score": 2, "replies": []}]}]}]}]}, {"body": "Watch someone throw their gun in Pavlov. To them it looks pretty good. (although unrealistic how guns bounce around 100 times before settling)\n\nBut you will see an entirely different behavior than they do. Often the gun will drastically reposition itself when the game syncs up the location of the fallen object on the ground to an item that you can interact with.\n\nThis isn't a big deal for the purposes of dropping an item. It's pretty inconsequential if there is a big desync between your perception and the other player.\n\nBut in games like bonelab or H3VR or Blades and Sorcery, if two people are trying to interact with the same object (like fighting the same npc) then you can't correct enemy positions seamlessly when physics calculation results (which are processed locally) differ from what another player sees.\n\nPavlov struggles with a single item dropping on the ground. Try having dozens of ragdoll animations on a single enemy character.\n\nThere is no example of a multi-player game that attempts this because it's not currently possible.", "score": 2, "replies": [{"body": "Then what is meta going to do? The graphics aren’t even on par with old games.  \n\nI’m pretty sure Valve is working on this. They are releasing Counter Strike and Left 4 Dead VR.", "score": 1, "replies": [{"body": "They will almost certainly not use intensive physics.\n\nSimple graphics can be convincing and immersive to a degree. They have to work with what's possible.\n\nBut the main thing is that we don't know what's possible. We will have to wait until we see what they come up with.\n\nThe amount of difficulty they are facing is real and our skepticism is perfectly valid. Utilizing their limited hardware to the maximum with perfectly efficient software might surprise us if they can pull it off.", "score": 1, "replies": [{"body": "I’d rather they just use a PC and have higher quality graphics. Maybe the only way to have a convincing metaverse with physics is with quantum computers.", "score": 1, "replies": [{"body": "PC users are a smaller group than people who can afford a standalone headset. I would prefer to game on PCVR as well but we need more users so it's a sacrifice we have to make right now.", "score": 1, "replies": [{"body": "I would think of it like this. Would you rather have something everyone wanted but not everyone has access to or something everyone has access to but not many people want. Facebook was founded on exclusivity. People buy iPhones.", "score": 1, "replies": [{"body": "If I were a company? I would want a lot of customers to sell to.\n\nThe inconvenience and required knowledge/enthusiasm is a major barrier to adoption.", "score": 1, "replies": [{"body": "Then meta is doomed to fail unless they can have PC quality graphics. Only other thing would be if they made a console.", "score": 1, "replies": [{"body": "Your expectation and use-case might be different than the general target audience.\n\nI think I would trust a tech company to know the risks of their investments. The amount of knowledge and experience you would have to have to make such claims is ridiculous. It's fun speculating though right?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Lmao, it's not like the games can be 100x more complicated & have amazing graphics because they're single player....There are mods for HL Alyx where you can play online with a friend and the graphics/performance doesn't get any worst because of it.\n\n&#x200B;\n\nYou can't take an existing MP game in VR and then suddenly be able to upscale it by 10x and make the graphics run 10x better simply by taking away the online feature.\n\n&#x200B;\n\nThe reason there isn't some big AAA Multiplayer VR game like HL Alyx is because there isn't a userbase that can sustain a AAA VR multiplayer game and there is practically no money to be made by producing a AAA VR MP game when you can sell 10,000 times more units on a regular PC/console.", "score": 1, "replies": [{"body": "I would be interested to hear more about the mods you mentioned because I could only find a multi-player mod with significant limitations such as this: https://vrscout.com/news/half-life-alyx-multiplayer-mod/\n\n\"Unfortunately, the mod comes with several major limitations. According to the development team, player two is unable to interact with the host players’ world; the interactions aren’t synched. Put simply, each player is playing through their own version of the game, only now they can see each other in real-time. It’s a little bit like the ghost system featured in Dark Souls.\"\n\nI'm guessing consumer reaction to a metaverse where you cant see object interaction of other players wouldn't be well-received.\n\nAnything that can be processed locally on your computer without affecting other players experience is of course not limited to singleplayer. Things like texture quality. I specifically mentioned physics-based games in my comment because that's what his videos showed.\n\nWhen you have a ton of information that needs to go through a communal server is where you run into problems. Physics can be simulated locally without issue but you can't send that much data quickly enough to have it work convincingly server-side.", "score": 1, "replies": [{"body": "Yeah I just picked the best looking VR game I could and quickly looked up if CO OP is possible, but I still think this is fundamentally wrong. It's only not possible in HL Alyx because it's not like modders have the source code form Valve, nor are they paid.\n\n&#x200B;\n\nWhy would this only be a factor in VR games and not in regular video games? Because there are a number of multiplayer games with a heavy emphasis on physics. Halo 3 had entire custom games based on physics 13 years ago and those lobbies had 16 players in them and good graphics at the time. Garys mod is also a MP game that had a heavy emphasis on physics, and it came out 13+ years ago. Portal 2 is entirely based on physics and has an entire co op mode and is also 10+ years old. Even a game like PUBG has soccer balls that you can kick that sync up perfectly between 100 players, and then you include all the vehicle physics going on at the same time with 100 players. And that game was made by an extremely small dev team. Fall Guys is practically built around physics & being able to interact with shit.\n\n&#x200B;\n\nPhysics are not the issue when it comes to MP games, devs have figured this shit out years ago.", "score": 1, "replies": [{"body": "Yeah I think you have a point that games can be built better to accommodate multi-player physics in this early stage of vr games.\n\nI'm not a game developer so I'm just regurgitating statements from devs about why they don't offer multi-player and I'm sure some of it has to do with how their game was designed. It's hard for me to talk about the games you mentioned that I haven't played and how convincing they were.\n\nBut in fairness the amount of physics interactions displayed in the videos above are well beyond the interactions of a ball being kicked around. The objects in the game's he showed were very complex like human bodies made up of many individual objects that all interact with each other.\n\nPhysics interactions in Garys mod weren't that spectacular to look at when you were watching another player. I think there is definitely a lot more scrutiny to be had when you are immersed in the environment at higher frame rates and instead of watching destruction or watching your character interact with an object you are instead moving your hand real time and expecting the physics you see in the real world.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": ">Can they do it before they run out of money? \n\nAs someone who has seen this one happen before, this is the most important question. How many years until they brutally run out of money.\n\nSo the signal people should be looking for is when they don't spend as much money as they used to and are not as enthusiastic as they used to be, or on opposite side complete success, Mark Zuckerberg swimming in money and little kids on some Epsteins island.", "score": -5, "replies": [{"body": "Such a bad take. Lol", "score": 3, "replies": [{"body": "What is your take on business spending and betting on new ventures ?", "score": 0, "replies": []}]}]}, {"body": "The end game has to be projection without headsets.  We have proven time and time again that we won't wear shit no matter how cool it looks - see 3D tv's, google glass, etc.  This is for proof of concept and building out the technology that we have until we eventually can break through to projection technology.", "score": 1, "replies": []}, {"body": "Guess this is where the billions are going. As a non-shareholder I'm curious to see what tech pops out the other side.", "score": 1, "replies": []}]}, {"body": "Unpopular opinion but the metaverse has value and it’s it’s infancy stage. A company like Meta that has the resources may be able to pull it off while a smaller growth company will eventually go bankrupt.\n\nThe reality is you have to give this 5 years minimum to see how it progresses.", "score": 18, "replies": [{"body": "Yeah the problem is that it's basically like investing in a (massive) startup. I don't really want to do that because I'm not a VC. If you like the risk then I think it's a fine bet.", "score": 1, "replies": []}]}, {"body": "My opinion: The whole meta shitstorm is a massive overreaction. I get it that in stock market you have to be forward looking, but its still very soon to say meta is in danger of anything. They core bussines still holds, their \"problems\" within it are the same that all tech are facing which are competition, fx, recession etc. The whole shitstorm still goes around his metaverse spending. While it is really uncertain what will happen. Not all RnD and Capex is spend on metaverse and there are number of decent and practical things they spend money on that will most likely workout. While burning crash on metaverse seems really bad now, it still has big margin of safety and time to actually reasses everything. META at this valuation is a bargain even if they burn cash for a long time. Plus looking at hate against Zuck, He gets a lot of hate for things he does, but meanwhile most of the stuff is done by other companies. And there are some really bad stuff that for example loved Apple does but people seems to ignore it. So same as stock its just overreaction.", "score": 8, "replies": []}, {"body": "This is starting to seem more like hit pieces created by competitors to stop Meta from being a factor in VR.\n\nAt this point, screw it - as a stock holder, let him try it.  You know if Meta bows out, there WILL be competitors vying for VR standings.", "score": 37, "replies": [{"body": "It's Meta this week, before that it was Amazon, Intel, Nvidia, etc... next week who knows who will be in the negative spotlight. Just remember that a high percentage of this sub is both new(er) and clueless when it comes to not just investing, but understanding what a company truly does and where it's headed. \n\nIf someone cannot articulate where VR is headed in the future, don't let that derail your investment decision. There is so much negativity here about everything it's a miracle anybody holds any stocks.", "score": 22, "replies": [{"body": "I agree.", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "That would be the greatest redemption arc in the history.", "score": 7, "replies": []}]}, {"body": "Where's my popcorn?", "score": 5, "replies": []}, {"body": "Things are simple and I dont understand why so many discussions lose the main focus point. \nWhen Facebook started before it was commercialised, it was a social network for Harvard students to communicate.\nWas it useful? Absolutely.\nCould be replicated at different universities?\nVery easily.\nCould be adopted by other except non students? Definitely.\n\nSo Facebook become worlds leading social network.\n\nThe key here is that before launched to their real works it was being used by insiders itself.\n\nNow we have Metaverse. We all saw how it looks like and how can transform the office working environment. You wear your headsets, sit in your couch and work from your home while everyone can see you are there, and instruct you about work to be done.\n\nThis could save huge costs. A large corporation which rents 20 floors in a tall skyscraper in NY or Singapore could scale down and rent only 5 while all the employees work in the Metaverse. If prodictivity is the same or even higher, it will make sense to cut costs of rental and pay META a hefty fee for using their platform. \n\nSo my question is: Does META company itself use it? Did they say to their employees, stay home, wear your headsets and from now we work on the Metaverse. If yes and proved successful, then every major company will follow.\n\nIf hiwever after spending 9.4 billion dollars for development, META is still not using it internally  (because ia not ready, does not increase the productivity, etc) and they prefer to have zoom meetings, then something is wrong.\n\nMETA should go back to their roots.\nIf the initial version of Facebook was not good and no one at Harvard was using it, then it would never succeed in the real world.\n\nIf META employees do not use Metaverse because it is not good, then it will never succeed in the real world.", "score": 4, "replies": []}, {"body": ">Some tech investors said Zuckerberg might be justified in pushing aggressively, given the scale of the risk his company is facing. Apple’s move to limit the data that its apps can collect on its devices severely dented Meta’s advertising revenue and appeared to have convinced the Meta chief that he had no choice but to go all-in on trying to build the next important computing platform, said Kevin Landis.\n\nKevin gets it. Meta is fucked if they do nothing. Fucked. Every investor wishing they wouldn't invest in new tech is hoping that the gravy train just keeps rolling. The truth is it won't.\n\nThose investors should have sold out already because the metaverse is a hail mary but nothing else will do. Meta needs to dominate the next platform and for it to be widely adopted soon. This is unlikely to work but doing nothing guarantees failure.", "score": 8, "replies": []}, {"body": "What about just selling their stock instead of complaining? Nobody forced them to buy into the corporate equivalent of a dictatorship.", "score": 9, "replies": []}, {"body": "Stock holders when they realize the dividends they could have got with that 10 bill he spent on second life 2.0", "score": 7, "replies": []}, {"body": "That's why I don't invest in companies with an individual majority share. It's just bad corporate governance.\n\nThey do what they want, and if it's negative, there's nothing anyone can do about it.\n\nIt's like the Asian companies with a family controlling everything - they don't care about your returns.", "score": 13, "replies": [{"body": "Not even sure why these investors are complaining. Zuck has demonstrated since the very beginning that he does what he wants and doesn't care about what anyone else thinks. Why would you invest in a company that is majority owned by Zuck and then complain he's doing what he wants. Make no damn sense", "score": 13, "replies": []}]}, {"body": "its in the best interest of society META falls and dies. TikTok needs to die off as this is just a CCP info/intelligence gathering tool.", "score": 9, "replies": []}, {"body": "I mean, yeah, it really sucks to see an investment I began making in 2013 back to 2015 levels. The things Meta is doing are actually pretty cool if you look at the presentations, but whether they become profitable is another story.", "score": 5, "replies": []}, {"body": "Robot needs oil.", "score": 2, "replies": []}, {"body": "He has no choice. Avatars need legs in the Metaverse!", "score": 2, "replies": []}, {"body": "I was expecting the metaverse to be finalized by the time Mark turns like 70 years old. Didn't realize their revolutionary vision had a deadline of next month", "score": 2, "replies": []}, {"body": "Who cares, fuck share holders", "score": 2, "replies": []}, {"body": "I found that the best way to vent anger was to put in some sale orders and reallocated that funding to RBLX because they’re actually communicating with shareholders on the plan to monetize a virtual world space.", "score": 2, "replies": []}, {"body": "Ready player Zuckerberg", "score": 2, "replies": []}, {"body": "Personally, I don’t want to live in a world where the meta verse is popular. How far removed do we have to be from reality?", "score": 2, "replies": []}, {"body": "Gigachad Zuck\n\nYou can hate him, but you gotta admit that dude has balls", "score": 9, "replies": [{"body": "What's  hilarious is all the big shot pro investors who bought huge stakes knowing Zuck had majority control, and are now crying about it and demanding he lets them run the company", "score": 12, "replies": []}, {"body": "Dont bet against the zuc or prepared to get the fuc", "score": 1, "replies": []}]}, {"body": "If the metaverse cannot trick you into thinking it's reality then I'm not using it. It has to be believable. Not a bunch of blow up dolls in a farmville simulator.", "score": 3, "replies": []}, {"body": "*bagholders - call them what they are.", "score": 2, "replies": []}, {"body": "The absolute mismanagement and waste of funds is what gets me the most. Imagine if a VR or AR startup had tens of billions of dollars a year to spend on developing these new technologies. I bet we'd be seeing completely different types of products that would be more exciting than what Meta has offered so far.", "score": 6, "replies": [{"body": "What like [this?](https://tech.fb.com/ar-vr/2019/03/codec-avatars-facebook-reality-labs/)", "score": 7, "replies": []}]}, {"body": "No one bought the Facebook phone or the currency mostly because they don’t trust Facebook/meta/Zuckerberg. But for some reason let’s trust it with metaverse because it’s the future. \n\nTo me it’s cool not to trust meta will be able to pull this off.  And this metaverse bet of meta willl fail.\n\nAt the same time, why bother… just pull out your investments and move on. It’s not like we are missing companies that cannot do the social media thing or something. If marks control majority and is trying to make cartoon land then sell and buy TikTok or snap or whatever.", "score": 4, "replies": []}, {"body": "He thinks that the resistance means that he's just a misunderstood genius. Let's remember that this guy's original vision was a hot-or-not blog. He's not Steve Jobs.", "score": 2, "replies": []}, {"body": ">It's my company and I'll burn it down for a passion project.\n\n- Zucc probably.", "score": 2, "replies": []}, {"body": "The meta verse will never be a thing. As a general rule for activities, if people look stupid doing it, they ain’t gunna do it!!  And no amount of tech will make the meta verse work without you wearing a stupid looking helmet screen contraption. \n\nHeck, 3D tv failed because people wouldn’t wear the stupid glasses in their own home. That didn’t even require a friggin’ helmet!!\n\nVR is cool. But it’s just entertainment and always will be.", "score": 3, "replies": [{"body": "Forgot about 3D tv for a minute there", "score": 3, "replies": [{"body": "Yeah… everyone did, as it turns out….", "score": 3, "replies": []}]}, {"body": "Obviously helmets will evolve into sunglasses. That's pretty obvious, no?", "score": 0, "replies": [{"body": "Not really. The current headsets don’t need to block light from the sides - they do this because it’s SUPER disorienting to have your peripheral vision competing with your primary vision.  Everyone will just get seasick!!  \n\nMany (most?) people already have trouble with seasickness with VR goggles after anything more than 30 minutes or so (though one could argue this is a result of lagginess that will improve.)\n\nOn top of that, 3D tv only required people to wear “sunglasses” and that too was too much for it to become ubiquitous. \n\nThe sunglasses concept only really works for “AR” where information is being overlaid over your actual view outside. \n\nSo, then I suppose it would overlay your remote coworker into your real world space - but that’s not what they’re building.", "score": 3, "replies": []}]}, {"body": "It’s just entertainment? And what do you think the metaverse is? Lol", "score": 1, "replies": []}]}, {"body": "interesting", "score": 1, "replies": []}, {"body": "\"I don’t think you’re going to know if it is the right move for five or 10 years.\"\n\nWe know it isn't now. \n\nWe also know they spend a few $ here on reddit, so here come the down votes and all the comments about how smart Zuke is, and how everyone has a bias toward meta.", "score": 0, "replies": [{"body": "How much hubris do you have to say you know what will and won’t be popular in 5-10 years? Enjoy being a billionaire given you own a crystal ball", "score": 1, "replies": []}]}, {"body": "How many (ex) Boston Consulting employees work there?", "score": 1, "replies": []}, {"body": "Has there been any push to spin “The Metaverse Silo” off to an investor pool with more opportunistic capital? Let the original FB retain a large % and provide an attractive debt facility. \nAs it is Zuckerberg is forcing his investors to assume the role of venture capitalists, with a VC portfolio of 1 company…..his metaverse vision.", "score": 1, "replies": []}, {"body": "zuck is schmuck he is fucked he just don't know how to say it", "score": 1, "replies": []}, {"body": "What product has Zuckerberg created that he didn’t steal the idea for or buy?", "score": 1, "replies": []}, {"body": "people who are into spending lots of time in VR worlds don't have much actual money, and that's basically the end of it. VR and second life type games work on a limited level in isolated markets because disaffected 16-22 year olds will buy games and other assorted junk while playing those games. outside of them, no one really likes wearing VR headsets or spending precious time looking at ads. \n\nFacebook was a free cash machine because they were first to massively monetize social media and an entire generation grew up with it. tons of now wealthy middle to upper class homes used it. perfect eyes for advertisers. \n\nthat's finished. the young moved on first, as expected. the older folks are now moving on. Meta does not actually make a product that anyone needs. anything they offer can be had somewhere else with less ads or better implementation. they aren't Google, they aren't Microsoft, they aren't Nvidia. \n\nthey're AOL 2.0.\n\nby the time they've completed their reskin, everyone will have moved on.", "score": 1, "replies": []}, {"body": "How is the meta-vr thing actually, substantively different from an elaborate Sims game? Video games don't cost billions to make, afaik.", "score": 0, "replies": []}, {"body": "there is a conspiracy theory that zuck wants to upload his consciousness to the internet and live in some kind of warped paradise. Only problem (lol) is that you would still need physical human (slaves?) to maintain the hardware if all the upper class went to said digital world.", "score": 0, "replies": []}, {"body": "1. Censorship killing his platform\n2. Election Campaign Fraud a huge risk… just got fined $25 mil in Wash state for 800 counts of election campaign fraud… MANY MORE STATES TO GO! Zuckerbucks will destroy this company. Hope it was worth the 2020 steal!", "score": 0, "replies": []}, {"body": "CIA says jump.... Mark asks \"How high?\"", "score": 0, "replies": []}, {"body": "HAHAHAHAH BOYS HE WILL OWN THIS SHIT! GET READY FOR VACCIDENSE ON ALL SIDES AND ME/CFS BROADSIDES FOR THE SHEEPLES!! :D THEY WILL LIVE FOREVER ON THE METAVERSE BECAUSE THEY CAN\\`T FUCKING MOVE :D THIS GONNA BE THE NASTIEST BIG TIME MONEY PLAY EVER :D MAIM YOUR CUSTOMERS AND SHOW THEM THE SOLUTION :D THIS WILL BE SO EPIC :D", "score": 0, "replies": []}, {"body": "Reporter: “Wait, the shareholders just trusted you with their money? Why?”\n\nZuckerberg: “dumb fucks”", "score": 0, "replies": []}, {"body": "If you have nothing to show for it now what does 40.billion help?", "score": 1, "replies": []}, {"body": "I suspect he had a number of teams engaged to speed up the development often found taking years.  The premise is the product developed will be well received.  That is a lot of ifs.  He may even have teams competing to pick a winner as plan B to spend $1B a month.\n\nA better way is annouce some cutbacks while curtail some projects.", "score": 1, "replies": []}, {"body": "If they don't like it, then always double down by spending twice as much!", "score": 1, "replies": []}, {"body": "Musk probably can’t tell if he was in metaverse or reality..", "score": 1, "replies": []}, {"body": "If he put out a VR headset that the poors could afford the metaverse would be poppin.", "score": 1, "replies": []}, {"body": "He's already cashed out a ton of money from the stock while it did buybacks to prop up the price so he could get maximum dollar for his stock. Now it's a vanity project for him. The original idea for FB came from the Winklevoss clones so he wants to prove he's actually a great innovator too. It's all about the legitimacy, shareholders be damned.", "score": 1, "replies": []}, {"body": "Zuck has always been saying since the start of 2022 to all the shareholders to brace themselves for the Metaverse investment. Investors held on to the shares thinking Zuck will pivot (just like interest rates pivot, amirite?). Now that Zuck has started executing on it full-fledged, investors are making a surprised Pikachu face and now vent their anger?\n\nAlso, pretty sure the $15B a year on Metaverse is not just Horizon Worlds app. Meta could clarify how much is it on Hardware / Software because the Quests are pretty good and I am saving to buy myself the Pro.", "score": 1, "replies": []}, {"body": "I mean, we have other companies looking at equally crazy stuff like driverless cars and automated drone delivery etc. VR is a real and tangible thing so I'm wondering why all the heat. I think maybe just because the bet is a bit TOO big ?", "score": 1, "replies": []}, {"body": "I just don't see widespread adoption of vr head sets. Its going to be a niche.", "score": 1, "replies": []}, {"body": "...but they must be thrilled! by the recent uptick in technology 'influencer' videos going over the $1500 Meta headset like its sliced bread. ...bunch of technology YouTube channels now all mirroring each other like Mark Zuckerberg personally wrote their scripts. All of them easily pushed over and washed out by a bad company for meaningless likes and subscription clicks that boost nothing more than ego and mental health issues. Prominent minds all reducing themselves for something no one really wants that we all know isn't that great and will most likely be problematic in the extreme.\n\nMetaverse is a concept Mark can't own no matter how much money he tries to pay for it. It's a losing strategy. He's become a speculative technology start-up at best - and one that spends to spend to spend, and so on. A fragile and unnecessary business to be invested in.", "score": 1, "replies": []}, {"body": "He wants to be the Platform for VR and not depend on Apples ecosystem.And rules and regulations on harvesting data.", "score": 1, "replies": []}, {"body": "It's not like Mark lied about his intention. Investors could  invest somewhere else if they don't like it. This sounds like demanding that Ford sell a model T in red color.", "score": 1, "replies": []}, {"body": "Meta now feels very much like Microsoft in the 2000s. \n\nPeople are hating on it now, acting as if the core business isn’t a FCF generating machine, but give it ten years and most likely people will be wondering why they didn’t invest in it when it was down.", "score": 1, "replies": []}, {"body": "Zuck is a complete looser without Thiels guidance and he’s building Rumble now,so I’m trying to sell out of this Enron show and get deeper into where users are going, Rumble", "score": 1, "replies": []}, {"body": "Meta, the fusion energy of social media.", "score": 1, "replies": []}, {"body": "He, along with all the other so called metaverses, aren't offering anything innovative or convenient and it all comes with the cost of very obvious monetization of the consumer to some extent. So there isn't anywhere for this to go but down if he keeps splurging on it. Gaming in general is far ahead of everything these metaverses are trying to offer and phone apps are more convenient for the other aspects the metaverse claims to be their benefit to the consumer.", "score": 1, "replies": []}, {"body": "This is a complete win-win (if you don’t own meta stock)\n\nEither we get better VR or meta tanks, or both.", "score": 1, "replies": []}, {"body": "Zuck will bring the Johnny quest world", "score": 1, "replies": []}, {"body": "Zuck don’t give a fuck 🤣", "score": 1, "replies": []}, {"body": "Now FB shareholders know how the entire Country feels", "score": 1, "replies": []}, {"body": "Zuck doesn't care.  \nAs long as Meta makes enough revenue to support the capex, he'll do it. He has the voting rights. In some twisted way, it's almost admirable. Everyone can own shares, but it's still his company.", "score": 1, "replies": []}, {"body": "Why does anyone think that Second Life 2 is going to do gangbusters in the first place?", "score": 1, "replies": []}, {"body": "Zuck has this vision of everyone strapping on the Oculus equipment and going into the metaverse (in app purchases will play a big role). While on the top level this seems possible but are people going to buy into it? AI and AS are just now starting to create short experiences. I can see his vision but I just don't see a lot of people joining in it.", "score": 1, "replies": []}, {"body": "TLDR: Meta verse (horizons) is just one small part of the bigger picture. \n\nOne thing I feel most people are missing is the meta VERSE is just one product out of the huge range of advancements they are making. Yes the metaverse looks like crap but I really feel that in 5 years Meta is going to be so far ahead of the game when it comes to headset technology. Lenses, displays, motion tracking, computer vision, haptics I wouldn't be surprised if they soon start to make custom silicon for the headsets so they are ultra-efficient and powerful. Their marketing was a miss with the whole cartoon head metaverse jargon but the real value is in the headset technology and ecosystem. I would start to consider buying back into meta for this reason. It's a looong play but its a valuable young market.", "score": 1, "replies": []}, {"body": "!remindme 10 years", "score": 1, "replies": [{"body": "I will be messaging you in 10 years on [**2032-11-01 20:28:05 UTC**](http://www.wolframalpha.com/input/?i=2032-11-01%2020:28:05%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/yj6pbg/meta_shareholders_vent_anger_at_zuckerbergs/iuo7i8a/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fyj6pbg%2Fmeta_shareholders_vent_anger_at_zuckerbergs%2Fiuo7i8a%2F%5D%0A%0ARemindMe%21%202032-11-01%2020%3A28%3A05%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20yj6pbg)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Facebook puts metaverse ads up, but no product. Just finish a working small demo already.", "score": 1, "replies": []}, {"body": "As much as I hate Facebook and Zuck I do think someday something like the meta verse could exist if we aren’t all dead by this time next year.  \n\nI just think he really jumped the gun, VR is better better-ish. But it’s still not amazing and it’s expensive. It would have probably worked better just releasing some meta verse things along the way for the next few years until cheaper, more reliable VR tech is able to be developed. Or even announcing it as a long term project and not trying to force it down everyone’s throats when the world is coming apart at the seams because of him.", "score": 1, "replies": []}, {"body": "I’ll go with latter. I can’t phantom the idea of people buying and wearing pricey headsets to experience VR 1.0 in work or entertainment environments.", "score": 1, "replies": []}, {"body": "Great artists steal.", "score": 1, "replies": []}, {"body": "Dude's just a nerd who wants to play videogames and spy on everyone else, leave him alone lmao", "score": 1, "replies": []}, {"body": "Lela’s guys, it will pay off on day … IN THE METAVERSE!!", "score": 1, "replies": []}, {"body": "They need to get porn in their meta verse. Boom. Solved. I’ll send a bill.", "score": 1, "replies": []}, {"body": "I respect Zuck even more now. Having the conviction to double down even after all those huge shareholders are telling you to stop the nonsense definitely takes balls. I think Zuck will be proven right in the long term, but the short term will not be kind to him.", "score": 1, "replies": []}, {"body": "They knew what they signed up for. Zuckerberg didn’t become majority owner yesterday.", "score": 1, "replies": []}, {"body": "Honestly sounds like a decent 5-10 year bet IF the stock price gets low enough to help account for the absolutely astonishing risk", "score": 1, "replies": []}, {"body": "Lol. I guess that’s why he’s the owner/founder 🤷🏼‍♂️. When you invested you knew that was the case.", "score": 1, "replies": []}, {"body": "Isn't all this money going into r&d for developing VR tech? And I'm assuming the accosiated parents as well. \n\nIf they really are pioneering VR tech, they will get this money back in spades eventually.", "score": 1, "replies": []}, {"body": "Facebook = Lifelog , dont think this guy can come up with anything on his own. Metaverse is going to work out, just not Fuck Zucks version of it", "score": 1, "replies": []}, {"body": "There is a lot of technology built into the Quest 2. I think there are a lot of markets they can enter and a number of use cases where the technology can work. Getting there first, building a dev community, and establishing a position is worth it. I heard someone else say they have multiple teams working on hardware and software solutions. They will have a library of patents to show for it.", "score": 1, "replies": []}, {"body": "How does it cost $15B per year to build a \"Metaverse?\"  I  feel like a startup could make it happen for 10M in seed funding.", "score": 1, "replies": []}, {"body": "I’m thinking Mark watched SAO and decided he’s gonna be the one to do it", "score": 1, "replies": []}, {"body": "He is running forward headed to nowhere, and investors are scared to stop him because it's their last hope. But both know that's the end. He wants that investors stop the stupid metaverse idea so it can be somebody else's fault for not letting him do his magic. Either way Meta is pretty much done. The only way to save part of it is to divest the entire metaverse thing, downsize the rest of the company, leverage a couple of years of revenue and go purchase something significant.", "score": 1, "replies": []}, {"body": "Who cares about investors :)", "score": 1, "replies": []}, {"body": "Everybody has to understand that it is not just an app that they are building, it is a whole new realm. It is a long term game. MSFT has been working on mixed reality for ages (hololens) and still a lot behind. \"IF\" META achieves what they are aiming for, they'll be king.", "score": 1, "replies": []}, {"body": "Mark wants his consciousness to be downloaded somewhere cool before he dies", "score": 1, "replies": []}, {"body": "MySpace coming soon", "score": 1, "replies": []}, {"body": "Guy really likes his VR headset.  I bought one.  It's cool.  I used it a couple times.  Took a tour of Italy and the Savanna.  Watched a 3D movie in a virtual movie house.  Meh.  Real life is better.  Haven't touched it in months.  Zuck clearly has a different take.  One of us is missing something.", "score": 1, "replies": []}, {"body": ">CEO seems intent on using majority control to push ahead with big bet on metaverse despite Wall St scepticism\n\nWall street doesn't know anything about VR so why should he care about them?", "score": 1, "replies": []}, {"body": "if the stock price was going up everyone would say the pivot is good", "score": 1, "replies": []}, {"body": "So, I was actually starting to think that \"hey, maybe Zuck is on to something, maybe we're just being dicks because it's Zuck. We're too bearish.\" \n\nThen I actually saw what he's spending $15B a year on.\n\nhttps://youtu.be/UdqrFa6pWLA\n\nHoly shit lol.", "score": 1, "replies": []}, {"body": "Idk what they spent $9 billion on but it ain’t the metaverse 😂. That shit looks like a wish.com version of VR chat", "score": 1, "replies": []}, {"body": "If this was 2020/21 no one could care how much ZM is spending on Metaverse.  The problem is that liquidity is tight right now and investors want to feel that the stocks that they own have a secure future and has plenty of cushion for next 2 years.  Yes Meta doesnt have much debt, but they are spending at a very high clip into something totally new.  This company has no experience launching hardware.  Moreover the whole virtual reality has a high barrier of acceptance.  So investors feel like this is a ship that is taking water..", "score": 1, "replies": []}, {"body": "My neighbor has a test model since he works there and says it's amazing 4k real but gets a lil heavy wearing it for a while. I have no doubt it will be fun but good luck playing or wearing it for 8 hours traight like sitting at your PC.", "score": 1, "replies": []}, {"body": "bruh the VR isn't that good. I would just get Steam VR omegalul", "score": 1, "replies": []}, {"body": "I never liked Zuckerberg but I do respect him for this. Yes, it's super bad timing with the economy the way it is. What a lot of people fail to realize, as evidenced with the Apple IOS situation, is that Facebook has no control. Facebook HAS to look towards the future or it will become a stagnant growth company, which ultimately can be it's downfall as well. There's so many competitors in ad space, and although Facebook has a lot of social media strength, more and more users are starting to spend more time on videos, which Facebook is far from being superior at with Tiktok, Youtube, Netflix, Hulu, and a plethora of other media companies are getting better at.\n\nIf Facebook doesn't do this or doesn't succeed, they can get phased out in IMO a decade. I give credit to Zuckerberg for doing this and taking a beating for the survival of his company, regardless if it works or not.", "score": 1, "replies": []}, {"body": "Metaverse is good but he’s over invested on the idea that it is the future. I mean it is the future but it would take at least a decade for it to catch up to the masses because the required hardware specifications are too expensive for the common people, the people who can afford it are people who do not have enough time for the metaverse and are busy earning that dough.", "score": 1, "replies": []}, {"body": "How it's legal for him to sell shares with no authority in the first place is baffling.", "score": 1, "replies": []}, {"body": "Here's a theory...he's tanking the company on purpose to drive down the value and take it private. This would eliminate much of the scrutiny.", "score": 1, "replies": []}, {"body": "The tech to make a meta verse mainstream is perhaps 50-100 years or more away imo. You need better tech than today that can fit inside a normal pair of glasses. Then you need a battery that can run this thing for at least 8 hours and the battery can’t increase the size at all of the glasses or increase it’s weight. All this while it has to cost like $100. \n\nPeople will never wear a big ass headset all day.", "score": 1, "replies": []}, {"body": "Did he steal this idea too?", "score": 1, "replies": []}, {"body": "How much did the Marshall plan cost, adjusted to today's dollars?", "score": 1, "replies": []}, {"body": "People are saying he’ll fail so hard makes me think this will be successful", "score": 1, "replies": []}, {"body": "Zuck has such terrible execution for VR. The tech is prohibitively expensive. Young people hate Facebook. Old people wont adapt to the new technology. Like who is their target audience? Why the hell would i spend $1500 for VR goggles just to access some shit VR metaverse with terrible graphics. After billions of dollars invested, it still cannot hold a candle to VRchat. He shoulda just bought their IP and built on top of it. I cannot see VR being widely adopted for the next 50-100 years.  \n\nIf anything, he should have focused on AR first. That would have been so much more feasible and profitable. But he is an out of touch with reality billionaire.", "score": 1, "replies": []}, {"body": "I have no idea what the meta verse is supposed to be. Way out of the loop on Facebook these days. Don’t use it myself.", "score": 1, "replies": []}, {"body": "It is often better to be second to a new market.   There has been buckets of research on this.  First movers while capturing revenues will make costly mistakes and competitors can move in learning from the first mover. Look at what FB did to MySpace.   I think META is on a road to doom.  They need luck to survive from here long term.", "score": 1, "replies": []}, {"body": "I have said this before. With any new technology such as Meta. Mark needs to introduce it someone’s lifestyle. I think back to how computers were introduced in the early 90s, when bill gates gave them out for free to schools. It made the students dependent on them for homework, and entertainment. That move made having a computer extremely important till this day. If Mark wants to be successful he’s going to have to lose a lot of money before he can earn more. Lucky for him, he’s made a fortune with Facebook.", "score": 1, "replies": []}, {"body": "no body cares about 99% of shareholders, y'all can think you matter, but if you don't...sorry", "score": 1, "replies": []}, {"body": "The \"Metaverse\" concept so old, you can party like it's 1999!\n\nhttps://web.archive.org/web/19990117070109/http://stockclub.com/traveler.html\n\nWeb archive capture of OnLive Traveler, as implemented on my own former website, StockClub, on January 17, 1999. (Not putting full URL, I sold that domain many years ago).\n\n(And, to add insult to injury - the first Wayback Machine capture of that OnLive entry page was on January 20, 1998.)\n\nNote that in 1999, virtual conference room people didn't have legs (sound familiar?) and didn't look like you, or even people. (Who really cares?)\n\nWhy, how far we have come! (Not).\n\nIMO, all Meta has done is created some branding using a generic term, and dusted off some pretty old technology has become smoother/more realistic (as realistic as an Avatar of Zuck could be) and that's being implement by dozens to hundreds of competitors in multiple practical applications.", "score": 1, "replies": []}, {"body": "If meta can execute on the hardware making it less bulkier and feel more natural to wear they may have something there. There is still a lot of room for improvement and the hardware alone can be a huge cash generator if successful.", "score": 1, "replies": []}]}
{"title": "Tesla Full Self-Driving Beta 10.69.3 release notes", "selftext": "", "id": "yj1iwj", "created_utc": 1667286049.0, "score": 193, "upvote_ratio": 0.97, "num_comments": 113, "comments": [{"body": "(Photo to text)\n\nFSD Beta 10.69.3\n\n-\tUpgraded the Object Detection network to photon count video streams and retrained all parameters with the latest autolabeled datasets (with a special emphasis on low visibility scenarios). Improved the architecture for better accuracy and latency, higher recall of far away vehicles, lower velocity error of crossing vehicles by 20%, and improved VRU precision by 20%.\n-\tConverted the VRU Velocity network to a two-stage network, which reduced latency and improved crossing pedestrian velocity error by 6%.\n-\tConverted the NonVRU Attributes network to a two-stage network, which reduced latency, reduced incorrect lane assignment of crossing vehicles by 45%, and reduced incorrect parked predictions by 15%.\n-\tReformulated the autoregressive Vector Lanes grammar to improve precision of lanes by 9.2%, recall of lanes by 18.7%, and recall of forks by 51.1%. Includes a full network update where all components were re-trained with 3.8x the amount of data.\n-\tAdded a new “road markings” module to the Vector Lanes neural network which improves lane topology error at intersections by 38.9%.\n-\tUpgraded the Occupancy Network to align with road surface instead of ego for improved detection stability and improved recall at hill crest.\n-\tReduced runtime of candidate trajectory generation by approximately 80% and improved smoothness by distilling an expensive trajectory optimization procedure into a lightweight planner neural network.\n-\tImproved decision making for short deadline lane changes around gores by richer modeling of the trade-off between going off-route vs trajectory required to drive through the gore region\n-\tReduced false slowdowns for pedestrians near crosswalk by using a better model for the kinematics of the pedestrian\n-\tAdded control for more precise object geometry as detected by general occupancy network.\n-\tImproved control for vehicles cutting out of our desired path by better modeling of their turning / lateral maneuvers thus avoiding unnatural slowdowns\n-\tImproved longitudinal control while offsetting around static obstacles by searching over feasible vehicle motion profiles\n-\tImproved longitudinal control smoothness for in-lane vehicles during high relative velocity scenarios by also considering relative acceleration in the trajectory optimization\n-\tReduced best case object photon-to-control system latency by 26% through adaptive planner scheduling, restructuring of trajectory selection, and parallelizing perception compute. This allows us to make quicker decisions and improves reaction time.", "score": 72, "replies": [{"body": "There are some huge reductions in error rates mentioned here. And an incredible list of improvements. I can’t wait to try it. \n\nAnyone know what is meant by a “two-stage network”?", "score": 31, "replies": [{"body": "Afaik it means there are two connected neural networks with different architectures (probably doing different things) that are trained holistically.  So for the VRU Velocity network they might have stage 1 be focused on orientation and stage 2 focused on speed.", "score": 13, "replies": []}, {"body": ">The proposed method contains a proposal network and a classification network that are trained separately.\n\nhttps://ieeexplore.ieee.org/document/8168106 \n \nThe short of it seems to be instead of trying to do this all as a single trained model, you just break it down into two separate steps trained separately, classification separate from proposal in this example", "score": 6, "replies": []}, {"body": "Previous AI day presentations have shown that they build separate networks for specific tasks and combine them into one or more stages in a stack.\n\n1. This lets them SEE what the AI is doing\n2. This lets them train parts of the system without having to retrain all of it.\n\nIE the occupancy network can define all the drivable space, the lanes network can figure out where all the lanes are, then the pathing network looks at those outputs and decides where to go. The pathing network may not need to be changed that often but the other two might need lots of improvement. \n\nComa AI however is known to be trying to be more focused on ONE network to act as a driver, the down side is they have no idea what it is thinking, only what it does.", "score": 4, "replies": []}, {"body": "Two steps probably. Some kind of producer/consumer separation likely.", "score": -1, "replies": []}, {"body": ">Anyone know what is meant by a “two-stage network”?\n\nWould also like to know the details on that.  Specifically, I wonder what is stage 1 doing and what is stage 2 doing.", "score": 1, "replies": []}]}, {"body": "I dislike the term photon count because it's misleading, not industry standard and metrologically wrong.\n\nThe raw data needs calibration, it can't be just photon count, as the cameras are color cameras, and each pixel color on the color filter array had different sensitivities.\nThis is needed even if you're not processing color.\n\nTbh it sounds amateurish. I suspect they didn't know shit about raw processing until a year ago. They probably just got an RGB image out of the camera until recently.", "score": -20, "replies": [{"body": "Why is it misleading? The photodiodes used in CMOS sensors are are photodetectors that convert the number of photons hitting the sensor into current.\n\nMost commercial colour CMOS sensors use Bayer filters with demosaicing algorithms varying in complexity to produce a desirable RGB image.\n\nTesla uses a RCCB filter for their camera (minus the rear fish eye camera). I don’t see why they couldn’t simply skip the demosaicing part of the ISP on the camera module and therefore providing an additional clear sub pixel to their neural network instead of compressing it down to RGB.\n\nIn fact they specifically mention this in the 2022 AI day talk: https://youtu.be/ODSJsviD_SU @ 1:14:00.\n\nI only have a very limited knowledge on the cameras, image sensors, and image processing. But I do think the Tesla engineering team knows what they are doing.\n\nedit: RCCB not RCCG", "score": 35, "replies": [{"body": "First, I'm a CCD and CMOS camera expert, having collaborated in custom CMOS development with one of the 2 leading CMOS manufacturers in the world, and having directly developed end user CCD cameras. So this type of release notes looks very amateur.\n\n1) It's not photon count. Each detector (pixel) converts a photon to an electron, but it has a certain efficiency. For most cases and wavelengths this is below 70% efficiency. So it's not photo count. It's electron count, and only a fraction of the photons. Not only that, each pixel has a color filter on top, so it's electron count  for that wavelength\n\n2) To simplify further discussion, Bayer patterns or RCCG or any others are called CFA, Color Filter Array.\n\n3) They don't need to demosaic. But at least have an algorithm which is CFA-sensitive! We do that often for defective pixel detection. We don't need to demosaic, but we need to be aware of the CFA\n\n4) If you don't demosaic, a green pixel targeting a green car will have lots of signal, while the nearby red pixel will have almost none. How can you combine them? The image would look like a car full of holes! That's not good for the NN!\n\nAnd when the car moves relative to the camera, those \"holes\" move around!\n\n5) Demosaic is still needed for color-aware NN, like traffic lights\n\n6) They know what they are doing, but my criticism is that they probably didn't, a year ago, until Elon started talking about \"photon count\"\n\n7) imaging and NN scientists work with the images from datasets. Never met one that directly calibrates raw images. Therefore it's quite possible most of them just accepted the 10bit RGB images from the camera and never questioned it. Until latency became an issue and they tried to tackle the bottleneck. We actually did this with a camera manufacturer many years ago, we had our own custom calibration on camera, to skip the demosaic, to increase FPS for a very specific use case.\n\nRAW bandwidth @ 10bit = 10 bit per pixel\n\nRGB bandwidth @ 10bit = 30 bit per pixel\n\nSo you can save on bandwidth, increase the FPS, at the expense of more processing power.", "score": 12, "replies": [{"body": "Join the Tesla team. They needs experts like you to solve FSD.", "score": 3, "replies": [{"body": "No Tesla R&D center within 10.000km and in this field i think there are more interesting jobs out there.\nI'm working now a lot in infrared, VCSEL, uLED, AR/VR, much more interesting than car cameras.", "score": 2, "replies": [{"body": "That’s sad. Clearly they could use someone like you with your input and expertise. And maybe you’re the key we’ve all been waiting for. Have a nice day.", "score": 7, "replies": []}, {"body": "You seemed interested in joining Tesla when they were hiring for Dojo in your city, what's changed!?  If you have a skillset they need wouldn't it be worth seeing if they'll allow you to work out of the local office?", "score": 2, "replies": [{"body": "I think they will create a small team here in Munich, but no further news... \nI would love to work at Tesla for their goal-driven approach, but from a pure technical perspective, my field has more interesting options, also paying better.\n\nAnd I get to interact with American, Korean, Japanese and Chinese top tech companies on a daily basis.", "score": 2, "replies": []}]}]}]}, {"body": "Thanks for your thoughtful reply!\n\nIn this case wouldn't the Clear in RCCB be a photon counter as there is no colour filter on top? I think your point is regarding the accuracy and efficiency of the sensor rather than if they technically can measure the photon count? (Albeit not very precisely) \n\nI agree that specifying it as photon count is marketing lingo and they are essentially feeding raw output to the NN.", "score": 3, "replies": [{"body": "Agree, that would be a valid approach, but for that you need CFA knowledge on the algorithm, not just \"raw\" data.\nStill, throwing away the green pixel information is not good, the green pixel is the most important and it's very sensitive. You can get more resolution at the expense of a bit more noise in dark conditions.", "score": 1, "replies": [{"body": "Why are you assuming they are throwing data away rather than simply having shifted the processing/weighting/interpretation of the information into the NN? \\[a task which it's purportedly well suited\\]", "score": 1, "replies": [{"body": "I can't claim I know all their process, I don't.\nBut their release notes language, plus Elon talking about it, doesn't sound good.\nPerhaps they found a good way of doing it, or they just don't articulate it will on the release notes. Or there is still room for improvement. But my point is the release notes was written by someone which is not an expert on this field.", "score": 2, "replies": []}]}]}]}, {"body": "I dont know if I agree with you that it sounds amateurish, it's a \"simple\" way to describe the process you just explained(which is correct based on my limited knowledge in semiconductors and cameras). \n\nOnly point I'd like to comment on, I'm not sure what is true, but my initial thought would be that your point #4 might not result in it being bad for the NN. Why wouldn't it be able to learn how handle this kind of information just as good as it learned how to handle images the way humans like to see them? \nIt's just one processing step less and holes are just as much information as non-holes, right? I'm curious to see how it develops, but I wouldn't rule this out as a bad choice because of it being \"holes\". Might suck for a human to look at but not an AI.", "score": 6, "replies": [{"body": "Depends. I can imagine a case where holes are bad. On a car far away, let's say 10 pixel across, half the pixels would be holes. That's a common problem of undersampling.", "score": 1, "replies": [{"body": "Sure, that and probably other things could be a problem. But, holes or not holes, it will get the information which is there, electrons \"converted\" from photons. Making it to RGB will not create any more information, right? The RGB will be created from the pixels hole's and non-holes, same information. The NN will probably do something synonymous of that conversion but just directly and skipping a step, hopefully creating same or better quality of output while resulting in a lower latency. \n\nTldr; 0 is as much information as 1.", "score": 4, "replies": [{"body": "I didn't say you need to create RGB image. You can either extract the clear pixels into a smaller image, or create a intensity image using information from all pixels.\nThe RGB is only needed for stuff like traffic lights", "score": 1, "replies": [{"body": "Sure, but I also fail to see the thing with traffic light. Can't one know that a group of pixels show what would be the traffic light and read light intensity or just colors coming from it, knowing which CMOS os green, red or blue? I lack the details here, but I think it's possible to do just in a slightly altered way?", "score": 2, "replies": [{"body": "Yellow? You need to demosaic to get all range of colors.", "score": 2, "replies": [{"body": "If I understand demosaic correctly I think it's something a NN would do quite easily. It's like taking bit-data(latin), translating it directly to 64-bit bytes(English) instead of stopping by 8-bit bytes(French) in between. The AI can just directly learn to understand it in latin", "score": 2, "replies": [{"body": "Demosaic is a simple algorithm which unfortunately needs non sequential memory access, which means it can be slow, if not parallelized (or written on a pipeline of incoming buffet). That's why you usually do it on camera, to not stress the CPU.\nYou don't need NN for it.", "score": 2, "replies": [{"body": "Okey, thanks for explaining. \nThat's what I mean, while NN is not needed for it but NN can replace it, or do it \"built in\", so the same size of NN just reroutes the nodes differently and then it gets the same output. And thus just skipping the whole demosaic step to get the same output faster.", "score": 1, "replies": [{"body": "I suspect the hardcoded version would be faster.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Do those holes impact the NN's ability to recognize an object, especially if it's not using a static image but video streams \\[multiple frames\\] so those \"holes\" (the screendoor?) is constantly shifting so missing information is filled in.", "score": 1, "replies": [{"body": "Unsure about their time dimension impact on it. But in general undersampling generates lots of artifacts or noise.\nSure, if they focus only on cars close to them, it's probably fine, but chuck's unprotected left turn would definitely benefit from it.\nAt the same time they are upgrading the cameras to 5MP, which significantly reduces the undersampling problem. Maybe they are just brute force solving it.\nBear in mind there are many drawbacks in increased resolution, especially because it is usually done by reducing pixel size", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Could be. Just some ideas stuck in the backlog.", "score": 2, "replies": []}]}, {"body": "I believe that all the “photon” business really means is that the nets directly take the raw 10 bit output from hardware, when previously it was 8 bit RGB (as intended for human perception) after a standard image processing step.  This was previously alluded to.\n\nOf course the net representations will need to be aware of the mask.  Probably one channel in the convnet per filter type. So instead of 3 for RGB it’s 3 or 4 for the RCCG or whatever.\n\nThe machine learning learns the appropriate transformation steps and how to combine the channels for best performance on its learning task.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "See my comment above. If they don't take in consideration the CFA, their images will show cars full of tiny holes, and those holes will move over time.\n\nSure, it's easy to solve, just aggregate the corresponding CFA pixels. Or create a pseudo intensity map by a simplified demosaic algorithm. But don't come with the bullshit this is raw photon count. It's an oversimplification and dumb down explanation.\n\nI've worked with dozens of computer vision and ML engineers and indeed most of them don't know and don't care about raw calibration. They get either monochrome or RGB images and don't ask how they were produced.\n\nThe ones who do are old timers, who had to do this by themselves 20+ years ago. Or electrotechnics engineers who actually know how this is done, including the analogue part.", "score": 3, "replies": [{"body": "> See my comment above. If they don't take in consideration the CFA, their images will show cars full of tiny holes, and those holes will move over time.\n\nWhy do you think that is a problem? The human eye also produces electrical signals in the way that you described and the brain handles it just fine.\n\nThe CFA is surely helpful when you want to produce an output that gets perceived with a human eye (or another camera for that matter), but I'm not convinced that it is helpful when the camera is the \"eye\" in front of a neural network.", "score": 3, "replies": [{"body": "CFA is mandatory for colour representation, human or machine.\nSee my other comment about undersampling. That's one of many potential issues.", "score": 1, "replies": []}]}]}]}, {"body": "The person who writes these updates is rarely an expert in every single aspect of what each part of the team is doing. I wouldn’t read too much into the verbiage.", "score": 5, "replies": []}, {"body": "> amateurish. I suspect they didn't know shit\n\nThey gotta work with who is available, when all the top shots left to work for Stellantis.", "score": 3, "replies": []}, {"body": "Sounds like a great example of an [expert not understanding how to write for a general audience](https://xkcd.com/2501/)", "score": 3, "replies": [{"body": "Try writing technical posts between chess matches on the bathroom, when having the flu. 😁", "score": 1, "replies": []}]}]}]}, {"body": "https://en.wikipedia.org/wiki/Gore_(road)", "score": 21, "replies": [{"body": "Thank you. I was reading it as a bloody kill zone.", "score": 7, "replies": [{"body": "Gore is based on the word for \"Spear\" and it means the pointy triangle you're faced with when your lane forks into two.\n\nThe fact that it is called a 'spear' is probably in reference to the fact that they were probably pointy hard V shapes facing your car that were very dangerous.\n\nNowadays they have plastic water bins/collapsible barriers to absorb your momentum, but I think the word 'gore' is actually in reference to the possible violence of driving into a pointy hard spear shaped divider, so you weren't completely wrong.", "score": 3, "replies": []}]}, {"body": "Increased the gore (blood splatter from running over VRUs) by over 90%. \n\nToday I learned it was not that.", "score": 5, "replies": []}]}, {"body": "It always reads to me like Elon himself wrote the notes lol. It's probably someone hardcore into the engineering side and not bothering to make it fluffy, which I actually like this way.", "score": 10, "replies": [{"body": "Engineers have to write notes in very literal language, and may talk in a similar way.", "score": 2, "replies": []}, {"body": "Elon talks the way he does most likely because people under him talk like that, not the other way around.", "score": 3, "replies": [{"body": "Wasn't suggesting it was the other way around, but Elon is also an engineer and they all talk like engineers. The notes don't read like they were written by a marketing person, so it seems likely an engineer directly.", "score": 2, "replies": []}]}, {"body": "I had a friend that worked at Tesla in marketing and Elon would personally review & approve the copy for EVERY email that went out during their 5+ year tenure. If he didn’t write it himself then he definitely reviewed it.", "score": 2, "replies": []}]}, {"body": "So still no single stack, but the improvements seems significant", "score": 6, "replies": []}, {"body": "What is the base software it’s using ? Based on the updates in Tesla fi. I am assuming 2022.36.6 , but it would be great to validate with the notes to the left of the pics.", "score": 4, "replies": [{"body": "2022.36.15 according to this link https://teslanorth.com/2022/10/31/2022-36-15-tesla-update-debuts-fsd-beta-10-69-3-for-employees/", "score": 2, "replies": []}]}, {"body": "I want this 🤤", "score": 3, "replies": []}, {"body": "What is a \"gore region\"?", "score": 2, "replies": [{"body": "[Gore region of road.](https://en.m.wikipedia.org/wiki/Gore_(road))", "score": 3, "replies": [{"body": "Got it. Thanks!", "score": 2, "replies": []}]}]}, {"body": "These are the only FSD release notes I've ever read, but subjectively it reads like a large leap forward. Would someone with more experience reading these update notes give their impressions on whether or not my impressions are right?", "score": 2, "replies": [{"body": "This seems pretty on par for non-point based updates. Maybe a bit bigger percentages than normal but not by a huge margin. \n\nThat’s actually a good thing though. Steady progress is what will get them to lvl 5 autonomy. If they can keep this up, I’m starting to believe EoY predictions for more or less being ready for wide release. The big caveat there is winter driving which it didn’t handle particularly well last year.", "score": 7, "replies": []}, {"body": "Subjectively this appears to be an impressive improvement in a few areas of the FSD’s functionality. \n\nThe proof of the improvement however will be in the real-world usage and reviews by Dirty Tesla, Chuck Cook and others.", "score": 3, "replies": []}, {"body": "The way I would interpret it is that its a fairly mild set of updates.\n\nMy guess is that they are focusing on merging everything into a single stack.", "score": -1, "replies": [{"body": "How do you arrive at that conclusions? Making double digit improvements to the accuracy of many different NNs isn’t “mild” in my opinion.", "score": 2, "replies": [{"body": "The percentages are not really what I'm looking at as I suspect that is mostly luck.  The descriptions all sound like modifications to existing things.\n\nBut its a wild guess.  I wouldn't take any commentary on stuff like this too seriously.", "score": 2, "replies": [{"body": "Ok, but like… the percentages are the most important aspect here. They already have all the architecture in place, now they’re just fine tuning to improve the behavior that architecture allows. \n\nLike we all know it can do a left turn, right? And these percentages are saying “next time it executes that maneuver it will be X% less likely to do the wrong thing” \n\nThat’s *exactly* the type of improvement we want to see and is not at all “mild”", "score": 5, "replies": [{"body": "You make a good point.\n\nMaybe a better description would be maintenance focused", "score": 2, "replies": [{"body": "Personally I wouldn’t agree that it’s “maintenance focused” but certainly you can call it that. \n\nThe main point for me is that if they were drastically modifying the core architecture on every release that would be a sign of massive problems not massive progress. And you seem to think if they’re not dramatically changing the core architecture then they’re not making progress. I just don’t agree… a stable architecture that is continuously getting incremental improvements is exactly where you want to be.", "score": 0, "replies": [{"body": "My assumption is more about testing than modifying.\n\nI'd guess that they need to prove that FSD is better in every aspect before it can replace the previous stuff.  So if the development seems light then they are likely focused on testing.\n\nAnd to be clear it's mostly a wild guess", "score": 1, "replies": [{"body": "Yeah, I think you just don’t really understand how NNs work. \n\nYou setup the basic architecture of the net… how many will there be, how many nodes in each net, what nets feed each other etc. then you identify cases that don’t work well, find more data to help the system understand that scenario better then retrain the NN with specific data intended to improve the incorrect behavior. That’s the core of what these updates are. In addition there are some minor structural changes here and there like the references to splitting a couple of NNs into a 2 step process\n\nBut that’s why what you view as “mild” updates are actually really exciting. They’ve already decided their basic architecture is close to what they think is required, now they’re just refining that with more/better data to handle more edge cases and improve overall behavior.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Does any of this mean teslas will stop registering motorcycles as trashcans?", "score": 1, "replies": []}, {"body": "I've been so disappointed in FSD lately, I've smashed the camera icon to send a report to the mothership repeatedly,aybe 20 times within a couple of seconds out of anger for it doing things it shouldn't be doing, like changing lanes into the passing lane with no traffic around me among other bogus issues. Hopefully it starts getting better, because for me, it's been getting worse.", "score": 1, "replies": []}, {"body": "[removed]", "score": -2, "replies": [{"body": "You sure its this one and not the point update everyone just got yesterday? This one in the OP appears to be Employee only right now.", "score": 5, "replies": [{"body": "Sorry you’re right. It’s the point update I got", "score": 3, "replies": []}]}, {"body": "I’ve not gotten update and I’ve had 2 instances of not slowing dow for stop signs in last 30 days. \n\nI assume the right thing to do is save the clip , but hope it is sending the data in anyways.", "score": 2, "replies": []}, {"body": "You claim to work for Tesla and are posting this here?", "score": 0, "replies": [{"body": "I don't work for tesla.", "score": 1, "replies": [{"body": "Then how are you claiming to have a FSD Beta version that has only released internally to employees?", "score": 1, "replies": [{"body": "posted in the wrong thread by mistake", "score": 1, "replies": []}]}]}]}]}, {"body": "But does it not Phantom Break and stay in the lane? Does it Auto Wiper like a fucking Pro? Good God - that Techno Babble is ridiculous. \n\nAnd I say that as a Model S Owner!", "score": -1, "replies": []}, {"body": "Still a decade away atleast.", "score": -20, "replies": [{"body": "Classic case of disruption happening faster than most expect.", "score": 13, "replies": []}, {"body": "I'd take that bet every single time.\n\nPeople just don't understand how long 10 years is.  Absurdly strong \"I've never built anything\" vibes in this comment.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sorry, I don't take your point, it seems like you agree with me on the absurdity of the \"Still a decade away atleast\" comment", "score": 1, "replies": []}]}]}, {"body": "Thank you, Nostradamus.", "score": 1, "replies": []}]}, {"body": "Getting real sick of Elon's shit. This was supposed to be \"a pretty major overhaul\"", "score": -75, "replies": [{"body": "You gleaned this from the release notes?", "score": 18, "replies": []}, {"body": "Who are you to know that it is not « a pretty major overhaul » ? Serious question", "score": 32, "replies": [{"body": "Someone who's been reading Elon's tweets. This still does not include 'actually smart' summon, single stack for highway and city, or anything else that indicates that level 5 will actually be reached end of this year like he promised in 2020, 2021 and this year.", "score": -37, "replies": [{"body": "I’d like to chime in that I would suggest most people anticipating a “major overhaul” at this point we’re expecting single stack highway & city.", "score": 7, "replies": [{"body": "Based on? I wasn’t expecting that at all, and I follow this project like a hawk.", "score": 2, "replies": [{"body": "People not following this project like a hawk.", "score": 2, "replies": [{"body": "So, based on hopes and dreams, then?\n\nFor those reading: single stack won’t come until we have a rockstar FSD build. 10.69.2.3 has been good, but not “wide release, this is the one” kind of good. And judging by the significant improvements in these release notes, there’s a lot more juice to squeeze from FSD. \n\nI wouldn’t expect single stack until Christmas at least, but that’s based on my wishful thinking. Might as well have pulled it from my ass. If I start to see people saying “single stack by Xmas” I’m just going to stop posting here lol.", "score": 1, "replies": [{"body": "> I wouldn’t expect single stack until Christmas at least, but that’s based on my wishful thinking. Might as well have pulled it from my ass. If I start to see people saying “single stack by Xmas” I’m just going to stop posting here lol.\n\nElon has repeatedly guided that FSD should be ready for wide release this year, including as recently as the Q3 call. I can see why people think that we should have your \"rockstar\" \"this is the one\" FSD build that's suitable to make single-stack by end of December...\n\nYeah, everyone here knows about Elon time. But when it's reiterated at every opportunity for 9 months straight it would be understandable for people to put some weight on it.", "score": 2, "replies": [{"body": "You seem to be confusing wide release with single stack. Those can easily be two different things.", "score": 3, "replies": [{"body": "Yes, they can be, but following the OP's logic (which I agree with) when FSD is good enough for wide release, it will probably also be good enough for single stack. Therefore it's reasonable to conclude that these two steps will occur fairly closely in time, although I concede that \"closely\" could be several months.", "score": 1, "replies": []}]}, {"body": ">Elon has repeatedly guided that FSD should be ready for wide release this year\n\nYeah, we should expect a \"rockstar, this is the one\" FSD beta release by end of year.  \n\n\nThat's not the same thing as \"Single stack + reverse summon\", though. They can wide-release FSD Beta without merging the stacks, as far as I know.", "score": 1, "replies": [{"body": "I agree they can wide-release without merging the stacks, I'm just saying that logically the arrival of a \"ready for wide release\" version will probably be followed pretty shortly by merging the stacks.", "score": 1, "replies": [{"body": ">will probably be followed pretty shortly by merging the stacks.\n\nOr \"not so shortly\" depending on how smoothly it goes lol", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Exactly. So why do you get three upvotes and not 32 downvotes?", "score": 1, "replies": []}]}, {"body": "lmao.  Show me a tweet where he promised level 5 will be reached by end of the year.   You're an idiot of the highest order.", "score": 2, "replies": [{"body": "First hit on Google\nhttps://www.google.com/amp/s/futurism.com/elon-musk-tesla-close-level-5-autonomy%3famp", "score": 2, "replies": [{"body": "Clickbait article that takes everything out of context. Good christ man, go check out what he actually says in AI day 2 and on the earnings call.", "score": 1, "replies": [{"body": "Also, he has not said anything about level 5 this year.  He has consistently said FSD Beta will be released to all subscribers by end of the year.  \n\nGranted, I admit Elon has been crazy wrong in predicting when full self driving will be available, I will admit to that, but there is already so much FUD and hate directed at him, I'm gonna call out wrong things like this on this subreddit.", "score": 3, "replies": []}, {"body": "Still waiting on you to show your work Tesla shill.", "score": 1, "replies": [{"body": "Sorry I have so many stupid fans.... Who are you again?", "score": 1, "replies": []}]}]}]}, {"body": "Chill on the personal attack, even against trolling.", "score": 2, "replies": []}]}, {"body": ">or anything else that indicates that level 5 will actually be reached end of this year like he promised in 2020, 2021 and this year\n\nAlso, never promised that, just feature complete self driving.\n\n&#x200B;\n\nThat's always been separate from level 5 and he's always been clear.\n\n&#x200B;\n\nIt's dopes like yourself assuming it means level 5 and getting pissy that make you look so bad.", "score": 1, "replies": [{"body": "Please chill on anything resembling a personal attack, no matter how trolling a comment appears to be.", "score": 4, "replies": []}]}, {"body": "He's been promising that ever year since 2017, lemme find the compilation, hol' up\n\nedit:  2014*.  https://www.reddit.com/r/videos/comments/s7dx0i/supercut_of_elon_musk_promising_selfdriving_cars/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": -7, "replies": []}]}]}, {"body": "Hey now!   This team is off and busy reviewing Twitter's code.\n\nTwitter is a successful/working software stack, and FSD is 5 years late, so maybe they can take what they learn from the Twitter code base and deliver FSD just 10 years late.  We just aren't smart enough to understand Elon's genius.  Fucking lol that is a /s", "score": 2, "replies": []}]}, {"body": "I’m excited to test this but I’m even more excited for the Christmas update. I’m hoping for actually smart smart summon. If they could make it work well enough that I don’t need to watch it like a hawk, that’d be pretty dope.", "score": 1, "replies": []}, {"body": "Can FSD read lane markings, such as “bus lane” or see turn arrows in a road?  A video recently seemed to think it couldn’t read these. Thoughts?", "score": 1, "replies": []}, {"body": "It’s getting so good, that I’m the most impatient for this version update than any before it", "score": 1, "replies": []}]}
{"title": "Well boys, looks like we’re about to have a bull market!", "selftext": "", "id": "yj73jj", "created_utc": 1667304798.0, "score": 1302, "upvote_ratio": 0.96, "num_comments": 142, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|4 days ago\n**Total Comments**|18|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=yj73jj)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=yj73jj)", "score": 1, "replies": []}, {"body": ">It is indeed possible that the market may experience a slight pullback in the near future. However, I believe that overall it will continue to trend upwards over time. Therefore, while it may be wise to trim some positions, I would not recommend selling everything off.", "score": 114, "replies": [{"body": "so basically useless middle of the road advice", "score": 60, "replies": [{"body": "Reads like a horoscope for stocks", "score": 24, "replies": [{"body": "Maybe by leaving his predictions vague and uh… generalized there’s less of a chance of someone finding out he’s a phony…", "score": 6, "replies": [{"body": "Dude should just sell used cars.", "score": 5, "replies": []}, {"body": "Whateva…. College boy…", "score": 2, "replies": []}]}, {"body": "That's what it is, yes. You gotta problem with that?", "score": 0, "replies": []}]}, {"body": "It's what Turing Test Proctor **DOES**!", "score": 1, "replies": []}]}]}, {"body": "My shit is so far in the hole I need a crane and mile of chain to lift it back to level, so there's no reason to sell. If it goes any lower it'll strike oil... so I've got that going for me.", "score": 152, "replies": [{"body": "[deleted]", "score": 76, "replies": [{"body": "Lmfaoooooo!!!!", "score": 11, "replies": []}]}, {"body": "Literally can't go tits up", "score": 4, "replies": [{"body": "I'm buying calls", "score": 5, "replies": []}]}]}, {"body": "Is Cramer running on internet explorer?", "score": 31, "replies": []}, {"body": "I like this guys. Attention POSSIBLE bear market! Tomorrow, attention we MIGHT have a bull run! I just discovered I could be a analyst, I'm kinda good at not knowing what to do.", "score": 61, "replies": [{"body": "Like a weatherman 🤔", "score": 13, "replies": [{"body": "A shitty weatherman who always predicts tomorrow will be like today.", "score": 3, "replies": []}]}, {"body": "Right? What about the last 12 months?", "score": 5, "replies": []}, {"body": "there is a fed meeting tomorrow so whatever happens it will be a busy day.", "score": 2, "replies": []}]}, {"body": "The oscillator? He’s talking about RSI. A standard indicator.\n\n🤡\n\nAnd guess what? SPY’s RSI is below 50 on every timeframe but Daily, indicating nearing Oversold.\n\nHe wants you to sell to give his bois their shares back.", "score": 48, "replies": []}, {"body": "I swear to God, I think he's shorting stuff based on what he says.", "score": 16, "replies": [{"body": "![img](emote|t5_2th52|4270)", "score": 3, "replies": []}]}, {"body": "Gonna be very interesting. Planning to buy meta stocks cuz they are so low now. Need some opinions on it.", "score": 52, "replies": [{"body": "Cramer is finally bearish on META, so it sounds like a really good trade.", "score": 94, "replies": [{"body": "fuck my puts.", "score": 6, "replies": []}]}, {"body": "Once zuck gives up on the pivot to meta, the biggest buying frenzy will occur. All the profits will be preserved in their original family of apps and not pushed towards an abysmal vr pivot", "score": 5, "replies": []}, {"body": "I’ve been DCA’ing into meta but WSB might consider that lacking balls", "score": 17, "replies": [{"body": "Not me. It takes balls to catch a falling knife.\n\nI think it's lacking sense.", "score": 30, "replies": [{"body": "It takes falling knives to catch balls.", "score": 6, "replies": [{"body": "If you can catch a knife you can catch deez nuts", "score": 2, "replies": []}]}, {"body": "It takes balls to ride it down from the top. (Which I have)", "score": 5, "replies": []}]}]}, {"body": "„No“. There, have my opinion", "score": 2, "replies": []}, {"body": "Meta is dogshit, I wouldn't touch it if I were you", "score": 2, "replies": []}, {"body": "Meta is dust in the wind bro", "score": 2, "replies": []}, {"body": "All the biggest crushed tech stocks. BABA, META, INTC, AMZN. Gonna be a long painful couple years but even if just one of them recovers it makes up for the rest", "score": 1, "replies": []}, {"body": "Dude they are so expensive what you mean", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Tomorrow, Powell will announce that bear market is transitory and printer is forever, SPY hits 500 in 4 hours as all countries unite and surrender control to America.", "score": 32, "replies": [{"body": "24 hours later the dollar becomes worthless and a bartering economy emerges based on chicken nuggets.\n\nGet your mom to pick up some chicken teddies now.", "score": 14, "replies": [{"body": "Nuggets becoming official currency would mean all the gbp my mom gave me is finally going to be useful!!! ![img](emote|t5_2th52|8883)", "score": 3, "replies": []}, {"body": "At this point I need both events to happen to win. Fml", "score": 1, "replies": []}]}]}, {"body": "What you smoking??? They are raising it to 100bps", "score": 7, "replies": [{"body": "It's definitely 75 points. At least that's what I put for tournament", "score": 4, "replies": []}]}]}, {"body": "I have something really unpopular to say about this. Guys like Cramer do get it wrong a lot of time, but Cramer did get the final fall of 2008 right....can he repeat his performance again in 2022, we will have to wait and watch.", "score": 26, "replies": [{"body": "Bear Stearns is fine!", "score": 29, "replies": [{"body": "Ah yes that was so wrong but he said that because he truly believed Bear would be bailed out, he said it explicitly then. I could be completely wrong on my call on Cramer though.", "score": 7, "replies": [{"body": "Bear Stearns did get bailed out though.  The problem is that they had junk securities that nobody wanted to pay $170 a share for.  Instead, they were really only worth $2 a share (which is what Chase bought them at).", "score": 6, "replies": []}]}, {"body": "Exactly we are still in bear market... Tomorrow will confirm it", "score": 2, "replies": []}]}, {"body": "I also got the fall of 2008 correct. I knew it was happening any minute when I saw every house in subdivisions in the middle Florida swamps being bought up before the ink dried on the land deal in 2004. \n\n\n\n\n\nI just missed the 1400 previous days when the world didn’t collapse.", "score": 9, "replies": []}, {"body": "Found Jimbo's other login guys.  He's right here.", "score": 1, "replies": []}]}, {"body": "We will hit Jupiter!!!!!!!!!!!", "score": 5, "replies": []}, {"body": "He’s a week late.", "score": 6, "replies": []}, {"body": "The selling will cause the pullback", "score": 5, "replies": []}, {"body": "GME\n\ninverse Cramer\n\nCathy wood sucks\n\nWendy’s\n\n———\n\n\nThis sub in a nutshell", "score": 9, "replies": []}, {"body": "I mean, I usually inverse WSB but inversing Jim Cramer seems to be working too now so I'm conflicted. \n\nEveryone seems to be hating on Airbnb lately so I went long yesterday. Up so far lol.", "score": 8, "replies": [{"body": "Except those of us who were smart closed our Airbnb positions yesterday when the stock was down 8%. 95 puts were up 200%, so not sure WSB was wrong on that one", "score": 2, "replies": [{"body": "We'll see. August and September were the busiest months in their history in terms of bookings. Earnings tomorrow, along with what might be a more tepid fed rate increase could pump the stock. If they miss or the Fed goes 0.75 or more, they'll probably tank.\n\nI took a $5k long position looking for a quick bump. Small chips, but enough to feel like your playing lol.", "score": 1, "replies": []}]}]}, {"body": "They’re so pissed off that so much of retail is just hodling it drives them insane. The stupid games they’ve been playing for years aren’t working anymore.", "score": 6, "replies": []}, {"body": "Buy signal confirmed", "score": 3, "replies": [{"body": "Can you msg your loss porn incoming days bcz we are in bear market", "score": 2, "replies": [{"body": "True. What kind of moron would consider buying stocks in a bear market.", "score": 7, "replies": [{"body": "Warren buffet 😭😂 - (sarcasm) \nStocks are on discount of course now is the best time to buy.", "score": 3, "replies": [{"body": "What are stocks? Only trade options here sir", "score": 2, "replies": [{"body": "You’re right! I forgot which sub I was under 😂 my apologizes kind sir", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I thought we were in a bull market", "score": 3, "replies": []}, {"body": "Anybody else think we going down after midterms?", "score": 3, "replies": [{"body": "Depends on the results", "score": 3, "replies": []}]}, {"body": "Lol! I saw that headline and came here to see if anyone else had used it to call a market bottom. Kudos to you for getting there first.", "score": 3, "replies": []}, {"body": "The real indicator is WSB sentiment. Inversing WSB sentiment pays off way more than inversing Cramer", "score": 2, "replies": []}, {"body": "Calls on this post😂", "score": 2, "replies": []}, {"body": "The hedge fund shills in the “financial media” have been telling retail to hold all year.\n\nNow that they’re saying “sell” it tells me the bottom is in.", "score": 2, "replies": []}, {"body": "How come Cramer didn’t warn us before the current down turn and kept telling us to buy the dip?", "score": 2, "replies": []}, {"body": "Bull market confirmed", "score": 2, "replies": []}, {"body": "He literally made another post, that we will be rallying throughout December.....", "score": 2, "replies": [{"body": "So buy now and sell December!!! Got it", "score": 1, "replies": [{"body": "Should have sold", "score": 1, "replies": []}]}]}, {"body": "What’s the ticker for the inverse Cramer ETF?", "score": 2, "replies": []}, {"body": "I should open my ass and buy, got it.", "score": 2, "replies": [{"body": "Maybe just buy and not open your ass 😂😂 but whatever works for you bro!", "score": 1, "replies": []}]}, {"body": "\"FOODSTAMPS OR LAMBOS\"", "score": 2, "replies": []}, {"body": "The bulls are back in town!", "score": 2, "replies": []}, {"body": ">According to the S&P oscillator I've followed for ages\n\nMacDaddy?\n\nI watch the MacDaddy. Tells you something different depending on time period and bar duration.\n\nZoom out very long term monthly bars, there's a bull-market a-comin'. In a couple of years.\n\nZoom in to daily bars, and we're ready to roll (over).", "score": 2, "replies": []}, {"body": "You can't make this up ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Uh.Oh.. i know what to do now!\n\nAll i gotta do is inverse what JC claims and print money!\n\nThis has to be the way right? :)", "score": 1, "replies": [{"body": "If Cramer says it's going down and WSB says it's going up, join theta gang.", "score": 4, "replies": []}]}, {"body": "BUY BUY BUY", "score": 1, "replies": [{"body": "No don't do that, red sea started yesterday", "score": 1, "replies": []}]}, {"body": "My puts are forked. Damnit Cramer!", "score": 1, "replies": []}, {"body": "My ocelot says we’re good to go.", "score": 1, "replies": [{"body": "Your ocelot is a tard.", "score": 1, "replies": [{"body": "What did the fish say?", "score": 1, "replies": []}]}]}, {"body": "Fed not pivoting already priced in?", "score": 1, "replies": []}, {"body": "LFG", "score": 1, "replies": []}, {"body": "\nCramer had his come to Jesus moment and is now arcing hard in the other direction. I think he has capitulated and said basically buy AAPL and flush the rest of tech and semis down the toilet. Wecome to reality Jim👀", "score": 1, "replies": []}, {"body": "It’s all green RN! Even my China stocks!", "score": 1, "replies": []}, {"body": "up, up&away", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "I saw this [article](https://www.cnbc.com/2022/10/31/charts-suggest-the-market-has-more-upside-through-the-end-of-the-year-jim-cramer-says.html) which is titled \"Charts suggest the market has more upside through the end of the year, Jim Cramer says\"\n\n\nSo wtf", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4886)", "score": 1, "replies": []}, {"body": "As a bear, I’m buying calls. TIHI", "score": 1, "replies": []}, {"body": "Rip my puts then", "score": 1, "replies": []}, {"body": "Sweat baby Jesus!", "score": 1, "replies": []}, {"body": "all in spy 420 calls for december", "score": 1, "replies": []}, {"body": "Oscillator hahahahaha", "score": 1, "replies": []}, {"body": "Ahh. no, THIS IS THE SECOND TIME, the 2008 Cramer SELL SELL SELL, desperate moment.", "score": 1, "replies": []}, {"body": "I'm calling a bottom sometime before feb, depending on how the Senate goes.", "score": 1, "replies": []}, {"body": "Bullish", "score": 1, "replies": []}, {"body": "I mean if you go based off one month we are running up so...", "score": 1, "replies": []}, {"body": "There's gonna be a midterm pump. Just mho.", "score": 1, "replies": []}, {"body": "Stopped clock, this time he’s right.", "score": 1, "replies": []}, {"body": "Adding to everything", "score": 1, "replies": []}, {"body": "Tbh like a clock even booger sugar Jim is right 2x day", "score": 1, "replies": []}, {"body": "Holy f this guy", "score": 1, "replies": []}, {"body": "Fuk u buy buy buy 😂", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "imagine he is right just this one time ?", "score": 1, "replies": [{"body": "He might be right but I’m not selling this low. I prefer go long and wait it out. I think everybody can agree that everything will be okay in the long wrong, these are some solid companies we’re talking about here.", "score": 1, "replies": []}]}, {"body": "You're giving Cramer too much credit.  He's not even reliable enough to be contrarian.", "score": 1, "replies": []}, {"body": "Boutta yolo on SPY calls", "score": 1, "replies": []}, {"body": "squeeze deserve ink tidy insurance trees scale roll simplistic friendly", "score": 1, "replies": []}, {"body": "wow I am so glad he called it after we are 20% down already", "score": 1, "replies": []}, {"body": "We will enter in recession mode soon you will see…", "score": 1, "replies": []}, {"body": "Spy 10% meme is not a meme 🚀", "score": 1, "replies": []}, {"body": "Is it possible that he is just so incredibly regarded that he confuses hindsight as foresight? \n\nKind of like that orange sapphire from Steven universe that can predict the future but only as it happens? (I have a 6yr daughter)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4886)", "score": 1, "replies": []}, {"body": "These people just want the market to crash again is all, if everyone sells everything then yeah, you will see a major downturn.", "score": 1, "replies": []}, {"body": "That seals it...going long on tech and cannabis", "score": 1, "replies": []}, {"body": "God dammit cramer", "score": 1, "replies": []}, {"body": "Jim predicted #cine would close 😆", "score": 1, "replies": []}, {"body": "Haha. What buffoon.  Cramer is always the last to know. Looks like we'll be getting bullish", "score": 1, "replies": []}, {"body": "Idk at this pointed Cramer literally just pointed out the obvious.", "score": 1, "replies": []}, {"body": "Thank you Cramer", "score": 1, "replies": []}, {"body": "Buy high, sell low, ride the red dildo", "score": 1, "replies": []}, {"body": "Thank God I bought calls 😩👌", "score": 1, "replies": []}, {"body": "Fuck jim", "score": 1, "replies": []}, {"body": "What’s more disturbing is he’s been more right then wrong recently", "score": 1, "replies": []}, {"body": "#BOTTOM IS IN!", "score": 1, "replies": []}]}
{"title": "330,000 META CALLS | UPDATE: -114,000 LOSS", "selftext": "", "id": "yjag4h", "created_utc": 1667313660.0, "score": 782, "upvote_ratio": 0.97, "num_comments": 133, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|58|**First Seen In WSB**|4 weeks ago\n**Total Comments**|91|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/xu0hl6/why_i_so_far_invested_75k_in_spy_calls_not/) \n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=yjag4h)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=yjag4h)", "score": 1, "replies": []}, {"body": "In todays most regarded of member WSB, you get the trophy.", "score": 102, "replies": [{"body": "So far….the day is still young", "score": 24, "replies": [{"body": "Right.. I’m waiting for people that bought puts on PBR", "score": 4, "replies": [{"body": "Why would someone bet against Professional Bull Riding? Theres a lot of idiots that are willing to ride a bull", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}]}, {"body": "F", "score": 1, "replies": []}, {"body": "Watch META just explode out of nowhere and OP retires rich. OP REMEMBER ME WHEN THAT HAPPENS. I BELIEVE IN YOU\n\nBut if this becomes a loss porn…. AY LMAO fap material", "score": 1, "replies": []}]}, {"body": "Well, I'll probably sell now. Still have a good amount to trade with. Not going to lose everything.", "score": 153, "replies": [{"body": "**UPDATE: JUST SOLD**", "score": 164, "replies": [{"body": "Meta is now pumping 4% just after you sold, lmao\n\nTruly regarded", "score": 197, "replies": [{"body": "For real. “They sold, pump it” within an hour.", "score": 78, "replies": [{"body": "We definitely live in a simulation", "score": 17, "replies": []}, {"body": "Not even death can stop the bogdanoff brothers", "score": 11, "replies": [{"body": "RIP", "score": 4, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 28, "replies": []}, {"body": "So he was holding META back", "score": 9, "replies": []}, {"body": "When the Fed raised the interest rates by only 0.25 % instead of 0.75% the entire stock  market will pump for at least the next week or two.", "score": 3, "replies": [{"body": "They're reporting that it will mostly likely be a .75 hike again...", "score": 7, "replies": []}]}, {"body": "Bogged", "score": 1, "replies": []}]}, {"body": "Holy shit the FCC commissioner is ur Bogdanov", "score": 18, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 38, "replies": []}, {"body": "lol..bruh.... you gonna be alright?![img](emote|t5_2th52|4270)", "score": 11, "replies": [{"body": "Poured 200K in AMC GME", "score": 48, "replies": [{"body": "Terrible timing, and terrible reinvestment. Have you thought about just buying/holding SPY instead.", "score": 29, "replies": [{"body": "Have you seen OPs history? he's all about striking it big. Taking the L with no emotion and diving back in head first into the deep end.", "score": 11, "replies": [{"body": "This sounds an awful lot like fucking my 1st wife.", "score": 3, "replies": []}]}, {"body": "Gay", "score": 23, "replies": [{"body": "NO BALLS", "score": 3, "replies": []}]}, {"body": "yo can you fuck off. Im here for the lossporn", "score": 6, "replies": []}]}, {"body": "Anyone buying AMC after seeing Adam Aron fuck shareholders repeatedly 💀💀💀", "score": 3, "replies": []}, {"body": "We learned nothing", "score": 2, "replies": [{"body": "Where the hell do you think you are?", "score": 3, "replies": []}]}, {"body": "Smart I did mostly amc but some gme! Both r primed", "score": -4, "replies": []}, {"body": "No you didn't. ! ?", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4263)![img](emote|t5_2th52|4260)", "score": 8, "replies": []}, {"body": "Broooo , you should have slept", "score": 7, "replies": []}, {"body": "OMG LOL.  I'm literally laughing and crying at the same time.  Holy hell.", "score": 5, "replies": []}, {"body": "You could have been a millionaire ![img](emote|t5_2th52|4260)", "score": 3, "replies": []}, {"body": "Ooof", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4886)", "score": 3, "replies": []}, {"body": "….now how will you make it back?", "score": 2, "replies": []}, {"body": "Good job, for real.", "score": 1, "replies": []}, {"body": "Owch", "score": 1, "replies": []}]}, {"body": "Just don’t go on tilt trying to make it back", "score": 7, "replies": [{"body": "He went in on AMC and GME, tooooo late lmao", "score": 6, "replies": [{"body": "?", "score": 1, "replies": []}]}]}, {"body": "the GOAT lol", "score": 2, "replies": []}, {"body": "Good call", "score": 1, "replies": []}]}, {"body": "did you see the tiktok news? your sell timing was impeccable lmaooo", "score": 48, "replies": [{"body": "no?", "score": 10, "replies": [{"body": "oh, go look it up", "score": 8, "replies": [{"body": "Send the link?", "score": 12, "replies": [{"body": "Lmao you got fucked", "score": 26, "replies": [{"body": "I was here 🤓", "score": 9, "replies": []}, {"body": "Only short term. If he held while that news went out and sold at the height, it would've been not so bad. It went back down after people realized it's just hot air. Probably Zuck had the article printed indirectly. I know I would do whatever I could to make people believe my company wasn't failing.", "score": -1, "replies": []}]}, {"body": "[https://www.reuters.com/technology/us-fcc-commissioner-urges-govt-action-tiktok-axios-2022-11-01/](https://www.reuters.com/technology/us-fcc-commissioner-urges-govt-action-tiktok-axios-2022-11-01/)", "score": 8, "replies": []}, {"body": "google “tiktok ban” lol", "score": 1, "replies": []}]}]}, {"body": "OOF![img](emote|t5_2th52|8883)", "score": 1, "replies": []}]}, {"body": "Loooool", "score": 1, "replies": []}]}, {"body": "It’s up 3,5% now, right after you sold , LoL", "score": 45, "replies": [{"body": "🤦‍♂️", "score": 30, "replies": [{"body": "next time b4 u buy any call or puts, let us know , so i can inverse u lol", "score": 8, "replies": []}]}, {"body": "Probably would have b\\e", "score": 13, "replies": []}]}, {"body": "holy shit, how did you sell the exact bottom???", "score": 43, "replies": []}, {"body": "You got zucked", "score": 17, "replies": []}, {"body": "3 day rule before you buy after nasty drop. Even if it goes up the iv crush will be insane", "score": 12, "replies": []}, {"body": "I hear MySpace calls is your next play?", "score": 8, "replies": []}, {"body": "Bro are you good? 😭", "score": 7, "replies": []}, {"body": "Bruh", "score": 5, "replies": []}, {"body": "I’m gonna be honest. Why did you get a call on meta ?, I have to know the reasoning. This isn’t even close to a good company to invest in currently. Honestly way better chance of not existing in 5-10 years\n\nWant somewhere to put your money pay attention to amazon tomorrow, if it gets in the low $90’s/ high $80’s load the boat for a couple months out ITM obviously", "score": 3, "replies": []}, {"body": ">As you can see, I have made a profit of $20,975.00 on my positions in META-94.96 and CS 4.25. My total net liquidation value is $369,530.46", "score": 10, "replies": []}, {"body": "I just bought 100 shares for 94.49", "score": 3, "replies": []}, {"body": "More than my losses after DCA-ing during past 8 months! \n\nYou ok? ![img](emote|t5_2th52|4270)", "score": 3, "replies": []}, {"body": "not so intelligent choice", "score": 3, "replies": []}, {"body": "Flair this regard, he's peak wsb user right there.", "score": 3, "replies": []}, {"body": "You must really believe in the Meta verse", "score": 3, "replies": []}, {"body": "Shoulda just bought shares man.  META’s just going yo be like netflix and bump up 60% in the next 8 months", "score": 4, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "It's still early to buy meta calls", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "2019", "score": 15, "replies": []}, {"body": "I don't know shit man, I thought it was a good stock at 130. After this Zuck's fuckup Meta can go down to 0 like yahoo, Blackberry and people like us will keep averaging it down to 0. There are enough opportunities in the market so retailers should stay away from Meta until Zuck personally tells them he has a new business plan. And now that I have made a logical statement Meta may gapup 20% tomorrow.", "score": 3, "replies": []}]}]}, {"body": "What expiration date? lmao", "score": 2, "replies": [{"body": "18 nov , it literally say it right there but bro sold", "score": 4, "replies": [{"body": "Thanks i am a dumbass", "score": 3, "replies": []}]}]}, {"body": "Bro with all that money you could've just bought the stock and sold covered calls..", "score": 2, "replies": []}, {"body": "No 🖐️💎🤚![img](emote|t5_2th52|4263)", "score": 2, "replies": [{"body": "No 🖐️💎🤚????\n\n![img](emote|t5_2th52|4263)", "score": 2, "replies": []}]}, {"body": "Damn that sucks. Good decision to cut even though it mooned. All about risk management. \n Next time brother. 💰💰💰", "score": 2, "replies": []}, {"body": "oof calls on a stock thats lost over 60% ytd isnt always the play for sure", "score": 2, "replies": []}, {"body": "You’re the dumbest mofo I’ve ever seen", "score": 2, "replies": []}, {"body": "We appreciate the honesty", "score": 2, "replies": []}, {"body": "Meta CALLS!?!", "score": 2, "replies": []}, {"body": "This guy got screwed really bad 🤣", "score": 2, "replies": []}, {"body": "Lmao literally pumped after you sold", "score": 2, "replies": []}, {"body": "You still holding these???", "score": 2, "replies": [{"body": "he sold them for -110k loss... whoevers holding them is happy!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "Can’t win ‘em all, you’re still running laps around most of these other regards here at least.", "score": 2, "replies": []}, {"body": "Only an absolute moron would ever think about buying calls of Meta", "score": 2, "replies": []}, {"body": "Looks like this guy was getting insider info from zuckerburg.", "score": 2, "replies": []}, {"body": "Fuck. Some people just want to watch the world burn (money).", "score": 1, "replies": []}, {"body": "Fuk", "score": 1, "replies": []}, {"body": "Ya got some balls there kid", "score": 1, "replies": []}, {"body": "Now it will only go up. Lmaoo. Get rekt.", "score": 1, "replies": []}, {"body": "The bounce could be near or not, but its a good gamble i think. But hey i only got a few calls", "score": 1, "replies": []}, {"body": "If there are no more posts from the OP...they are dangling...", "score": 1, "replies": []}, {"body": "At least I'm not alone", "score": 1, "replies": []}, {"body": "10,000 times less than what Zuck lost though", "score": 1, "replies": []}, {"body": "Pocket change for OP right there.", "score": 1, "replies": []}, {"body": "this is so sad to watch", "score": 1, "replies": []}, {"body": "Ouch bet on the wrong company this time. Should have brought puts!", "score": 1, "replies": []}, {"body": "Double negative.  You’re winning.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4886)", "score": 1, "replies": []}, {"body": "Username does not check out.", "score": 1, "replies": []}, {"body": "Lmao", "score": 1, "replies": []}, {"body": "Hang in there regard!", "score": 1, "replies": []}, {"body": "Wtf was the thought process here?", "score": 1, "replies": []}, {"body": "If you would’ve sold 330k worth of cash secured puts you would be up over 10k easily.", "score": 1, "replies": []}, {"body": "Jimmy boy![img](emote|t5_2th52|4886), is that you?", "score": 1, "replies": []}, {"body": "Did you dump your remaining money in yo amc and GME bro?", "score": 1, "replies": []}, {"body": "I expected a larger loss", "score": 1, "replies": []}, {"body": "Aouch! Good Luck 🤞", "score": 1, "replies": []}, {"body": "Go short you moron", "score": 1, "replies": []}, {"body": "Not bad it’s not $0 yet, you’re still winning!", "score": 1, "replies": []}, {"body": "What a regard", "score": 1, "replies": []}, {"body": "Yer a wizard ‘Arry", "score": 1, "replies": []}, {"body": "this is the loss porn i was looking for, keep up the good work 👍\n\nanyone know if that guy who YOLO’d on SoFi calls the other day posted his yet?  🤡😂", "score": 1, "replies": []}]}
