{"title": "What are your thoughts about Alibaba (BABA) stock?", "selftext": "[deleted]", "id": "6ujeoe", "created_utc": 1503077712.0, "score": 24, "upvote_ratio": 0.88, "num_comments": 22, "comments": [{"body": "I'm pretty surprised you hadn't heard of the 8th most valuable company until yesterday.", "score": 44, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "> I'm new to the game\n\nAhhh, got ya. Yeah, I've been holding since IPO (averaged down a bit when they dipped below IPO price, too). Your assessment is pretty spot-on, but quite general in regards to the retail part of it. They're diversifying into many other segments a la Amazon. Their cloud service is rapidly growing in revenue plus they have a hand in entertainment, sports, and payments. [Read this](https://www.fool.com/investing/2017/08/17/another-stellar-earnings-report-takes-alibaba-grou.aspx) for a brief overview. I recommend DCA'ing in if you think they'd fit well within your portfolio.\n\nEdit: Typos", "score": 6, "replies": []}]}]}, {"body": "$BABA is a solid company. Strong fundamentals, strong earnings consistently, and tons of future potential. I've been in it since about $124... never looked back.", "score": 12, "replies": [{"body": "Well said. The only risk relates to the Chinese economy. Their focus is to expand to other big markets to mitigate that risk. As long as things keep stable back home, an excellent long term prospect.", "score": 6, "replies": [{"body": "I'm honestly a bit skeptical. Chinese businesses do not have property rights nor IP rights.\n\nThere is nothing solid preventing China from turning Alibaba into a government entity.\n\nBut the stock market is more based on perception than reality, so I don't think anyone is going to have an issue with BABA for the foreseeable future.", "score": 1, "replies": [{"body": "True, but even that risk is slim. Alibaba as a private company helps promote China to the world.", "score": 2, "replies": [{"body": "But there is no reason a US company can't create a competing website with the exact same software.", "score": 1, "replies": [{"body": "The competitive advantage isn't software. It's brand, operational excellence and logistics. It's like amazon. Many have tried, but it's just not that easy.", "score": 7, "replies": []}]}]}]}]}]}, {"body": "It is a go between for bulk sales between mostly Asia and anywhere else. So if you want to start a kiosk in the mall selling adult toys you can purchase a large inventory for pennies on the dollar. They have been around for much longer than 3 years but may have only been publicly traded for that amount of time.  Go to the Alibaba website and there are also a few subs here dedicated to using Ali or a few of its competitors. \n\nIf you like the numbers then I think they are a future bank roll. I'm waiting for Trump to pass some import legislation in hopes that it drops in price myself. ", "score": 5, "replies": []}, {"body": "Bought in at $86 And $100 and enjoyed the ride to $120... Then stayed in the ride for the tumble to $60 And now loving the climb to $167.50 that it hit today. ", "score": 4, "replies": []}, {"body": "There owner is Jack ma I believe in him as a person so I bought 9 shares at $155", "score": 3, "replies": []}, {"body": "Your assessment sounds about right", "score": 2, "replies": []}, {"body": "I still think of this company as the sketchy version of Amazon that sells cheap knockoffs from people that may or may not actually send it to you ", "score": 2, "replies": []}, {"body": "Hey there. I made a small summary of alibaba group. Most of the information is from Wikipedia, so you can read it all there, and get further elaboration. \nAnd as always, remember Wikipedia isn't guaranteed to be the truth. \n\n\nAs one person mentioned, they are spreading to other areas, such as Amazon is. \n\nI know that they are big in mobilepayments in China (Alipay), they have a consumer and a wholesale business (alibaba/aliexpress). They are expanding into cloud computing, Alipay is a product under ant financial. It's the biggest finte company in the world, and also has credit rating, money market etc. \n\nThere are rumors that they are about to start collaboration with ripple (cryptocurrency), but it has been denied that they have made an agreement (not that they are working on one). \n\nIt is the largest retailer in the world. Surpassed wallmart in 2016.\n\n\nThe amount of goods grossed is larger than eBay and Amazon combined. \n\nIt has expanded into media and entertainment where it has 3 digit growth. I believe they have funded some movies etc. \nThey also have ownership in football. \n\nThey have more than 80% of all internet sales in china\n\nThey also own parts of groupon. \n\nThey have designed a car, and have startet taking pre-orders. \n\nThey make maps\n\nThey have an instant messaging service\n\nOwn a newspaper. \n\nA medical supplier\n\nOwn browser. \n\n\nThey havde had ownership in yahoo. (might still have, unsure). \n\nLargest ipo ever at the time. (might still be). \n\n\n\nOne of the differences (as far as I know) is that Amazon sells goods alongside their sellers. Ali doesn't sell anything by themselves. ", "score": 2, "replies": []}, {"body": "👍", "score": 1, "replies": []}, {"body": "Yeah, it's strange you didn't know about them. Are you new? You should familiarize with [Rating foreign broker](http://trade-leader.com/forex/category/foreign-forex-brokers). It must help", "score": 1, "replies": [{"body": "OK, I'll take your word for it.  Sometimes I feel very old.  I'll bear that in mind.           What are you talking about? Please explain.", "score": 1, "replies": []}]}, {"body": "There owner is Jack ma I believe in him as a person so I bought 9 shares at $155", "score": 0, "replies": []}, {"body": "OP lived under a rock for the past 10 years. Prolly still thinks China is still closed off from the rest of the world.", "score": -10, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "O look at that I was the same exact age 10 yrs ago, but I knew shit. Huh, wonder if some of us are just less retarded.", "score": -18, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Hit or miss depending on whether or not they're normal or stupid", "score": -7, "replies": [{"body": "Me so funny. Me so edgy. ", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "An interesting trend with AMD, question about capitalizing on it", "selftext": "I noticed that AMD tends to fluctuate in price between $12.15 and roughly $13.00 and I was wondering if it's wise or common to attempt to profit from this?  \n\nIf I keep a purchase order of about a grand of AMD when it's in the low 12's, and keep a limit sell going at all times for $13.00, what are the disadvantages?  \n\nSorry if the question is dumb, only started investing in July of this year. ", "id": "6uk0gq", "created_utc": 1503082978.0, "score": 15, "upvote_ratio": 0.76, "num_comments": 21, "comments": [{"body": "While I've made a good deal doing exactly this, it's admittedly gambling and not wise.", "score": 23, "replies": [{"body": "I made a good 30% over the last few months doing something *similar*. I wasn't as ridged on my prices. \n\nAdmittedly it's completely gambling and very unwise.", "score": 1, "replies": []}]}, {"body": "If you plan on holding for long AMD has potential at this point, finally right....  if you're in short game try a different stock, I just made 250 on Delcath Systems today, dump it right back into your long.  AMD is not the right stock to be shorting, there is money there but not what you would think there would be.\n\nAnd poster is right, Robin Hood is life right now.", "score": 7, "replies": [{"body": "AMD's less risky than DCTH, and AMD is pretty risky. (I have a bunch right now though.)", "score": 2, "replies": [{"body": "You're right there, I only did dcth because of their meeting on fda approval today might have sent the stock pretty high, small gamble if you are in early enough.  They will plummet like normal this next week until they get that patent approved.  And yeah, AMD is risky but I like the strides they made this year and it could be pretty profitable on long in a few years, then again they could tank but I'm favoring they make a decent run on nvda by the end of next year (hopes)", "score": 2, "replies": [{"body": "Same here! I like AMD short and long term. I don't see it going under 10, and it's easy to imagine it at 13.50 or 14 within the next month.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": " If you don't feel like assuming all the risk of selling them naked, then hit up an iron condor at those strikes. ", "score": 1, "replies": []}]}, {"body": "It's not a dumb question at all. Swing trading works for a lot of people but I would usually advise against buying if the only reason is to sell. Consider the dirty work involved in speculating ", "score": 2, "replies": []}, {"body": "It all depends if that's the way you roll. You have to take into consideration commissions and all that jazz. But it doesn't sound like that bad of an idea. Just keep your emotions out of it and you should be fine...", "score": 1, "replies": [{"body": "The commission is $6.95 per trade, coming to a total of $13.90 to buy and then sell a batch. I currently have 125 shares that I purchased at $12.44 (stupid buy, I know) and think that would be an optimal number to do this rotation with. It cost a total of $1,562.94 to purchase. Selling 125 shares of AMD at $13.00 even comes to a total of $1,618.05 a profit of $55.11 after commission is deducted.  \n\nI'd prefer to buy the next batch at $12.20 which leads to a total of $1,518.05 after commission. Selling that at $13.00 even leads to a profit of $100.00 exactly when all is said and done ($75.00 after government takes their tax?).  \n\nIn order to keep emotion out, these will be set in stone. I won't buy at $12.21 and I won't sell at $12.99 no matter what.  \n\nWhat do you think? ", "score": 0, "replies": [{"body": "At that point do you think it is worth your time and effort for $55? or $100? I believe that AMD is a $15-$16 stock and it will reach that around December to February. Why do I think this? they're finally able to compete with Nvidia as well as Intel all at the same time. Just think about it for a second. Do you really think AMD is that bad that you need to get out at $13.00?", "score": 3, "replies": [{"body": "What makes you say this? My IT friends are in the glorious PC master race. None of them used AMD to build their gaming PCs. ", "score": 2, "replies": [{"body": "They just released a new processor in partnership with intel so they are revenue splitting there, and they are also releasing a new graphics card with the same capabilities at the GTX 1070 and GTX 1080.", "score": 1, "replies": []}]}, {"body": "I believe you're right, AMD is underrated, but just because it should be a $15 or higher stock doesn't change the fact that it isn't (for the time being), so it makes some sense to capitalize on the volatility.  \n\nThat said, to answer the question of 'is it worth your time?', I'm not sure to be honest. It takes a week or more sometimes for the stock to hit $13.00 before it drops a bit once more. That said, setting some limit purchase and limit sell orders shouldn't be too time consuming.  \n\nEither way, thank you for the input. If you come up with anything more to add, please do. I'm open to all advice/tips. ", "score": 1, "replies": []}]}, {"body": "Use Robin Hood trading app. No commissions and no fees. ", "score": 2, "replies": [{"body": "Good call. I'll download it and transfer some money in on my next payday. I won't start this trading cycle until then. That nets me an extra 14 bucks per cycle. ", "score": 2, "replies": [{"body": "I've bought AMD at $4.96, 5.12, 8.92, 10.50, 11.31, and 12.23. I love it.\n\nI generally try to do the same thing you are. My best results over the last year have been buying BLPH in the mid $1.20s and selling in the high 1.40s. It went pretty low over the last week or so, but I think it will get back up to the $1.40s.", "score": 2, "replies": []}]}]}]}]}, {"body": "Honestly, that seems like such a tight range to get any meaningful coin off of such a complicated plan.  Besides, if you sell at $13, and it continues going up, you've Nancy Kerrigan'd your gains.  Lastly, I think the next decent entry into $AMD is around $11.  Since Dec. 7, it's been trading in a consolidating range.  But to answer your question, I do not agree that the plan, as presented, will be very profitable.", "score": 1, "replies": []}, {"body": "Unless you have data on what drives these swings and how much you can expect the swing to be, then this would fall into speculation, or gambling.", "score": 1, "replies": []}, {"body": "That's what I'm doing with it. Buy in about 12, sell about 12.40. Basically does it every day. I'm doing this with a couple stocks in between earnings. ", "score": 1, "replies": []}, {"body": " we might visit that high $11 soon but ER will be exciting", "score": 1, "replies": []}]}
