{"title": "Bullish BAC. Any reason to do both long call and vertical spread?", "selftext": "[deleted]", "id": "7f3mfs", "created_utc": 1511482247.0, "score": 14, "upvote_ratio": 0.89, "num_comments": 14, "comments": [{"body": "What are your hopes and dreams here? I’ll give you that the stock has moved up almost 20% in the last 6 months, but when that 20% is 4 bucks, I think you’ll be eating premium instead of profits on this one.\n\nIf it was me, I would not buy a bull call spread. Why not sell a bull put spread instead?", "score": 8, "replies": [{"body": "Uhh, won't the put spread and call spread have identical profit graphs", "score": 6, "replies": [{"body": "Maybe same payoff, but very different risk profile.", "score": 6, "replies": [{"body": "Can you elaborate?", "score": 4, "replies": [{"body": "Different max loss.\nDifferent probability of profit.\nBull Call spread makes money if stock goes up beyond breakeven.\nBull Put spread makes money primarily from decay while stock price stays below breakeven.", "score": 5, "replies": [{"body": "You're assuming you're different strikes and/or expirations when a bull put spread and bull call spread. Given the same expirations and strikes the positions are equivlent. ", "score": 1, "replies": []}]}]}]}, {"body": "Given the same strikes and expiration they are exactly the same due to put call parity. /u/foresttrader is implicitly assuming that you would enter the bull put spread with lower strikes than the call spread. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I personally love the bull put and bear call strategy. Stock can go up, sideways, or even down and you can still make money on the trade ", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good deal. I was enthusiastic as fuck going into Dec for BAC but this big boy has all but stalled out and run out of steam the last 3 weeks along with most other banks. Sold my Dec long calls for a big loss and am thinking about entering a short strangle until Q4 earnings.", "score": 1, "replies": []}]}]}, {"body": "Definitely bull put spread, that way theta works in your favor and you can still make decent profits while having limited downside if something unexpected happens.", "score": 3, "replies": []}, {"body": "The risk is just soooo much less. You can do a bill put spread with an 85% POP, while buying that same call spread is only 15%. Yes, it’s less money, but more successful so you can do it more.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Ever been directionally correct and not make money? ", "score": 2, "replies": [{"body": "Yup, been right same day, naked put and 4% below breakeven(Became ITM after buying) and somehow still lost on P/L.... Expect the worst", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "heh..", "score": 2, "replies": []}]}]}]}]}
{"title": "AMD guidance", "selftext": "[deleted]", "id": "7f85z5", "created_utc": 1511537592.0, "score": 34, "upvote_ratio": 0.78, "num_comments": 27, "comments": [{"body": "Gotta do your research...Most of AMDs catalysts are expected to drop in the 1st half of 2018, and share price will either rocket or tank based off of ERs. No major catalysts between now and Dec. 15th. There might be some PR here or there, slight bump if console sales are good, bump if there are good selections of AMD powered laptop out there, etc etc. \n\n", "score": 14, "replies": []}, {"body": "I say hold. ", "score": 17, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Or MU", "score": 6, "replies": [{"body": "Micron, should of held that.", "score": 1, "replies": []}]}, {"body": "Look at $MARA and $DWP.\nThe entry barrier is incredibly low and with Blockchain tech being the big thing investors are pouring the money in. You must be careful though because many of these hot stocks haven’t really proven they’re actually worth the share price.\n\nThat being said I made $1200 off of 1000$ this week alone by tracking $RIOT and $MARA\n\nI bought 260 shares of MARA at 2.5 and it’s now $7/share. Check their volume compared to their average volume and their market cap. You will see why these stocks make money.", "score": 2, "replies": []}]}, {"body": "ROKU might be worth looking into. Also GM has had a very good past couple months ", "score": 3, "replies": []}, {"body": "If the outlook is that short then personally I'd choose the best companies from the best sectors in the best indices.\n\nOdds are that in the short term the companies doing well will continue to do well.\n\nMy outlook for AMD would be a lot longer than a month. I don't see them competing with Intel and Nvidia in 2017.", "score": 2, "replies": []}, {"body": "replace it with mu", "score": 2, "replies": []}, {"body": "MARA baby!", "score": 1, "replies": [{"body": "Just looked this one up.  Seems like a random patent company? What's intriguing about it? ", "score": 1, "replies": [{"body": "Dude it's a pump and dump. If this guy wants to win his school game he has to pump his numbers up big league.", "score": 1, "replies": []}]}]}, {"body": "Look at stocks that have high volatility with high volume compared to their average volume. This means people think the stock is hot and price typically will fluctuate heavily but in a modest upward trend.\n\nAre you limited to only buying certain stocks?", "score": 1, "replies": []}, {"body": "Chinese tech stocks took a dip today. Would highly suggest take a look at Tencent, Alibaba, Weibo, etc. if you want solid growth. \n\nTencent surpassed Facebook in valuation a few days ago, and it is consistently one of the most active stocks in the HKSE\n\nDitch AMD. ", "score": 1, "replies": []}, {"body": "hey played the same game growing up. unfortunately i recommend selling tht AMD. it's tempting at this price but with their next earnings call so far away (when u consider how short ur game is). best stocks out there are PYPL. BABA. MU. WMT\n\nnot the biggest fan of verizon but did buy some cuz of this ridiculous reversal of Net Neutrality. the FCC will vote on it on December 14th. so i'm expecting an uptick in their stock in anticipation of the vote. \n\nrisky but maybe worth it at this price is BZUN or YRD. chinese like baba but much more volitile. \n\nGood Luck", "score": 1, "replies": []}, {"body": "I didn't know deca had this awesome I'm gonna do it next year", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I almost won the nippissing stock challenge myself ", "score": 1, "replies": []}, {"body": "If you can just short searsbinto the ground based on the valuation", "score": 1, "replies": []}]}]}, {"body": "Drop that shit.\n\n\nDo they have earnings coming in that span?\nMy last fair value for AMD put them $10.50 to $12.00, but that was a while ago.  I don't think they've beat expectations ", "score": 1, "replies": []}, {"body": "you need high beta, non large cap.  pick a name in the top 10 of the IBD 50.  ", "score": 1, "replies": []}, {"body": "Hold, please.\n\nDo not sell AMD. I'm on the fence on whether to invest or not. My gut says to hold. If you've already bought, do not dump that stock my friend. Keep that. Figure how the company has operated. Look at the stock value graph over the past 5 years. The reason it sunk is because the I-series Intel chips came out and AMD just couldn't keep up after ~2005. \n\nAMD is now coming back with their cheap gaming optimized CPU (/r/pcmasterrace will show you how popular it is). They have also released a cheap enterprise compute  CPU (Can you say AWS & Azure Cloud commodity compute?). They've also teamed up with Intel on an imbedded chipset for laptops w/ GPU & CPU combined.\n\nIt's a solid investment. Not a gainer, but definitely a two year slow growth.", "score": 1, "replies": []}, {"body": "Sell AMD and buy $MU. More Momentum and still at solid valuation.", "score": 1, "replies": []}, {"body": "Should've picked $MU ", "score": 1, "replies": []}, {"body": "Do you have any idea where you stand relative to your competition?  Are you in a position where you'd be wise to take risks over the next few weeks, or are you looking to coast with what you've got?", "score": 1, "replies": []}, {"body": "Buy deep OTM puts on NVDA.", "score": 1, "replies": []}, {"body": "Maybe sell half of your position, hold the rest? Gives you liquidity to buy something else, and if a deal happens you're good. If I am you though, I would sell most if not all. I don't think AMD is the best choice if you only have until 12/15. Good luck in your game though, ", "score": 0, "replies": []}, {"body": ".", "score": -4, "replies": []}, {"body": "all in aphria. there's a good chance it goes up a lot by for legalization in canada, and it's almost broken 10$ a share, meaning who knows where the party will stop", "score": -4, "replies": []}]}
