{"title": "Gene Munster: Tesla Deliveries: Underlying Demand Is All That Matters", "selftext": "", "id": "b9df45", "created_utc": 1554388144.0, "score": 16, "upvote_ratio": 0.75, "num_comments": 43, "comments": [{"body": "Is Gene Munster really this dumb?  He attributes the drop in S/X sales to manufacturing?  There are unsold Model S/X everywhere.  When was the last time you heard about someone ordering a model S/X and not receiving it fairly quickly?  There is one reason Model S/X didn't sell well this quarter. Lack of demand.  ", "score": 16, "replies": [{"body": "They did cut a shift off the production line tho.", "score": 15, "replies": []}, {"body": "I ordered my X and it took two months to receive it. I don’t think it’s necessarily a lack of demand, could be an option issue for some of the models sitting in inventory.", "score": 9, "replies": [{"body": "That is interesting.  When did you order, and where are you located?  Does your X have any features that you think makes it unusual? ", "score": 4, "replies": [{"body": "I ordered a blue X with black interior. 7 seat version. I had gone with what was the “base model” and they upgraded me to the Long Range version for free. I guess there were supply chain changes made that affected production, or a business decision. From what I recall, I was not the only one waiting on their Model X to be produced either. I posted in a daily discussion thread and there was someone in the Midwest who had been waiting a similar amount of time.\n\nI’m in Florida, ordered mid January or so and received mid March.", "score": 2, "replies": [{"body": "My gut feeling is S/X sales (particularly X) probably held up much better in the US.  The real substantial price cuts were in international markets, and the numbers seemed to really collapse in Europe in particular.  My guess is there is a decent chunk of inventory, mostly Model S, abroad, while in the US things are tighter.\n\n> I’m in Florida\n\nSorry, I probably should have gotten that without asking.", "score": 3, "replies": [{"body": "I didn’t wanna call you out like that, so no worries 😉 \n\nMy guess is they have a problem with supply in the US and are trying to force a glut of inventory abroad, while not having the demand/infrastructure setup.\n\nI will say that looking at used Tesla’s a tough process since they keep upgrading features and forcing obsolescence of older models.", "score": 2, "replies": [{"body": "> I will say that looking at used Tesla’s a tough process since they keep upgrading features and forcing obsolescence of older models.\n\nThey're doing a test run with CarMax right now. I suspect that headache will get outsourced soon, though it doesn't necessarily change the headache for consumers, just Tesla.", "score": 1, "replies": []}]}]}]}, {"body": "Do you want a 100+k car that’s sitting in inventory?   When I was first offered that, I assumed those were rejected models and declined the offer.    I later ended up with one and have no regrets, but at the time, I was set against it.", "score": 2, "replies": []}]}]}]}, {"body": "the underlying demand is clearly low though, at least in the US. We'll have to wait another quarter to truly know demand levels in the eu and china", "score": 8, "replies": [{"body": "Yeah, that has sort of been the bear thesis all along....", "score": 9, "replies": []}, {"body": "No it isn’t, they were not producing cars for the North American market for most of the quarter. There are many people waiting for delivery of ordered cars.", "score": -4, "replies": [{"body": "Remember that story that came out where someone had parsed all of the inventory from Tesla's online database and showed that they actually had a bunch of inventory sitting in delivery centers all quarter?  That is something you should pay attention to.  Also, remember how they lowered prices?  Tesla didn't have enough demand for their vehicles in Q1.  They have the manufacturing capacity, they now don't have the buyers.  ", "score": 10, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Meta: Can we please ban the word \"TSLAQ\" from this sub?\n\nIt's like calling every long argument a \"fanboy\" argument, and adds nothing to the discussion.", "score": 7, "replies": [{"body": "That's silly. There's a lot of silly stuff that could be banned before that (memes, like xzy secured and anything 420 related, etc.)\n\nThe likes of Spiegel use it as a rallying cry. If they stop using it then it stops being used on this sub.", "score": 3, "replies": [{"body": "Hey. I like my username. ", "score": 3, "replies": [{"body": "To be expected. You mainly post to /r/wallstreetbets and /r/realtesla from what I can see with a quick look. ", "score": 1, "replies": [{"body": "Hey, but that thinkpad though. ", "score": 1, "replies": [{"body": "1 post in about a year, but ok.", "score": 1, "replies": [{"body": "Sorry, I don’t gloss over people’s post history. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Yeah. Keep TSLAQ, but maybe not \"TSLAQ dums dums\"", "score": 1, "replies": []}]}, {"body": "Agreed.", "score": 2, "replies": []}]}]}]}, {"body": "so why did s+x deliveries plummet?", "score": 6, "replies": [{"body": "There is only one legitimate reason why sales of S/X plummeted.  It was because Model 3 cannibalized sales of both vehicles. They had plenty of vehicles available, buyers just didn't want them.  What vehicle did those buyers choose?  Well, Model3 is the best selling EV on the planet by a large margin, and many Model3 buyers came over from other Teslas.  The data paint a clear picture.  Whether people want to believe them...", "score": 8, "replies": []}, {"body": "Because they didn’t produce as many. Quarter over quarter is ugly, but not exactly relevant. Year over year looks pretty nice. ", "score": -9, "replies": [{"body": "> Year over year looks pretty nice. \n\nS/X deliveries:\n\nQ1 2018: 21,800\n\nQ1 2019: 12,100", "score": 7, "replies": [{"body": "Unless Tesla can introduce some type of MAJOR improvements to S/X this trend is going to continue. ", "score": 6, "replies": []}, {"body": "Don't you see how nice that looks?  All the 1's and 2's and 0's all over the place?  An 8 thrown in to add some flair?  Its goddamn majestic.", "score": 7, "replies": [{"body": "The feng shui in the numbers is breathtaking, there's even an 8, that's very auspicious!", "score": 3, "replies": [{"body": "I think we've discovered why Tesla cut their S/X production.", "score": 5, "replies": []}]}]}, {"body": "Yeah that part is ugly but easily explained in half a dozen ways.\n\nHw3 around the corner, interior refresh long overdue, focus on 3, pull forward due to tax credit halving, in transit, macro economic / China bullshit.", "score": -1, "replies": [{"body": "> Hw3 around the corner,\n\nBut Tesla is upgrading that for free if you have the old hardware, no?\n\n> interior refresh long overdue\n\nNo argument there, but Tesla hasn't indicated when a refresh is coming.\n\n> focus on 3\n\nThat problem isn't going away.\n\n> pull forward due to tax credit halving\n\nLess than 90 days to the next halving.\n\n> in transit\n\nS/X have been sold internationally for years, they would have the same issue last year.\n\n> macro economic / China bullshit\n\nInterest rates at all time lows making financing great, unemployment at record lows, markets rallying record amounts, its really an awful environment out there!", "score": 3, "replies": [{"body": ">But Tesla is upgrading that for free if you have the old hardware, no?\n\nOnly if you paid for FSD, but all new cars will start coming with it soon regardless of if you pay for FSD.\n\n>No argument there, but Tesla hasn't indicated when a refresh is coming.\n\nTrue, closest we have is this old article, and lots of other indicators saying it ain't gonna happen - I still think it is. https://electrek.co/2018/07/30/tesla-model-s-x-interior-refresh-exclusive-first-look/\n\n>Less than 90 days to the next halving.\n\nWhich means Q2 should be as excellent as Q4. Probably even more so.\n\n>S/X have been sold internationally for years, they would have the same issue last year.\n\nSure, but they're not shipping s/x like they used to, they've basically created a whole new system for 3 and thrown s/x in there.\n\n>Interest rates at all time lows making financing great, unemployment at record lows, markets rallying record amounts, its really an awful environment out there!\n\nThings weren't so rosey for most of the quarter.\n", "score": 1, "replies": [{"body": ">True, closest we have is this old article, and lots of other indicators saying it ain't gonna happen - I still think it is. https://electrek.co/2018/07/30/tesla-model-s-x-interior-refresh-exclusive-first-look/\n\nWould be pretty interesting if they revealed a refreshed autonomy focused S and/or X on the 18th.", "score": 1, "replies": [{"body": "0% chance. They won't do it until they are already in production. Tesla cannot afford to give up S/X sales in real time. Those are the cash cows. Tesla needs the money and can't have buyers waiting on a new S/X. ", "score": 1, "replies": [{"body": "I was implying that it would be entering production. would help explain the low numbers in Q1, they sold off what they had and are tooling for the refresh. Just a theory obviously, but definitely more than a 0% chance.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I see.  I read that they kept laying off ppl and needed volunteers to deliver the cars I didn’t understand.  Thanks", "score": 1, "replies": []}, {"body": "I don’t understand why they have to “deliver” to customers instead of having the customers come to a Tesla car parking lot to pick them up. Can someone explain to me? ", "score": -4, "replies": [{"body": "That is a delivery. Not all (almost none) are are delivered to door.", "score": 7, "replies": []}, {"body": "Deliver just means the car moves from Tesla's hands to the customer. Doesn't matter whether the customer picks it up, Tesla drops it off, or UPS leaves it on their doorstep.", "score": 4, "replies": []}, {"body": "Because not everyone lives in California.", "score": 3, "replies": []}, {"body": "Delivery means ship the car from tesla factory to the tesla parking lot where the customer can come get it.", "score": 2, "replies": []}]}]}
