{"title": "The true reason for DIS dropping this morning", "selftext": "", "id": "bir8pu", "created_utc": 1556554069.0, "score": 588, "upvote_ratio": 0.96, "num_comments": 46, "comments": [{"body": "Magnificent technical analysis", "score": 175, "replies": [{"body": "This is the DD I sub for", "score": 55, "replies": [{"body": "Sorry for being ignorant, new  to the sub , what does DD mean ?", "score": 1, "replies": [{"body": "Double D. Your man tits size", "score": 31, "replies": []}, {"body": "Nobody tell him", "score": 37, "replies": [{"body": "Dysfunctional Dautism\n\nHad to tell him sorry", "score": 7, "replies": []}]}, {"body": "DD comes right before FDs in the wsb dictionary", "score": 16, "replies": []}, {"body": "Disney Derivatives.  This sub loves playing options on Disney.  We also have FD for Facebook.", "score": 13, "replies": []}, {"body": "DD means $90 MU calls", "score": 10, "replies": []}, {"body": "No worries. It took me an embarrassingly long time to find out also.\n\nApparently its short for “Dee Dee”. The daughter of this subreddit’s founder Ligma D. Bawls. She was one of the more popular moderators on this sub so you see her referenced endearingly all over the place.", "score": 9, "replies": []}, {"body": "You don't want DDs, kid, you want FDs.", "score": 7, "replies": []}, {"body": "Dastardly deeds", "score": 6, "replies": [{"body": "Done at a respectable rate\n\nPART 7 WHEN", "score": 1, "replies": []}]}, {"body": "Double Dickin'", "score": 3, "replies": []}, {"body": "Dunkin’ Donuts", "score": 1, "replies": []}, {"body": "[Ding Dong, man](https://youtu.be/goiVNxeX624)", "score": 1, "replies": []}, {"body": "Dunkin’ Donuts but now it’s just D-dunkin", "score": 1, "replies": []}, {"body": "Its just information about a stock or a trade.", "score": -1, "replies": []}, {"body": "Oh for god's sake don't expect anybody on this sub to be helpful. You've fallen into a cesspool of snark, ironic posturing and financial self-sabotage. This is not the place to rely on the goodwill of your fellow humans. Not even a teeny little bit.", "score": -1, "replies": [{"body": "Ouch. I guess you got butthurt asking this question too?", "score": 1, "replies": [{"body": "Spectacularly unoriginal retort. Go back to troll school.", "score": 1, "replies": [{"body": "not trolling, just autist-ing. smh my head", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -8, "replies": []}]}]}]}, {"body": "i like fire trucks and moster trucks", "score": 15, "replies": [{"body": "Walter", "score": 4, "replies": []}]}, {"body": "THEY HAVE MY SON\n\nWAAAAAAALLLLLTT", "score": 13, "replies": []}, {"body": "A wide variety of stocks dropped sharply about 20 minutes after the open.  Not sure what caused it...some headline might of triggered the bots to sell", "score": 41, "replies": [{"body": "We're all bots", "score": 32, "replies": [{"body": "***^(\\*BEEP\\* \\*BOOP\\*)*** **SHORT $DIS**", "score": 17, "replies": [{"body": "Hello fellow Humanoid", "score": 9, "replies": []}]}]}, {"body": "Inflation ticked up a bit,  consumer are making less and spending less.  But that only month to month data I think", "score": 2, "replies": []}]}, {"body": "This should be flaired as `Technicals` imo", "score": 9, "replies": []}, {"body": "RED RUM ... RED RUM ...", "score": 8, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Yea man go for it. Always good to share laughs", "score": 5, "replies": []}]}, {"body": "WAIT", "score": 4, "replies": []}, {"body": "you forgot to moon that T. (or drill it, whatever you prefer)", "score": 6, "replies": []}, {"body": "This is the moment Walt became Heisenberg.", "score": 3, "replies": [{"body": "ayyy the comment i was looking for!\n\nMickey is the one who knocks!", "score": 3, "replies": []}]}, {"body": "It drops after big box release weekends like 9/10 times", "score": 2, "replies": []}, {"body": "makes more sense now, thanks for this", "score": 2, "replies": []}, {"body": "Gap down incoming...all in on puts.", "score": 2, "replies": []}, {"body": "[Obscure meme] (https://upload.wikimedia.org/wikipedia/en/4/4f/Michaellost.PNG)", "score": 2, "replies": []}, {"body": "people think Micky gonna bust a nutz with endgame. that shit already price in. everyone knew endgame is coming. wallstreet algor already price that shit in.", "score": 1, "replies": []}, {"body": "So you're saying that It will go down, then sharp spike up and down simultaneously, tread sideways at that loss, then sharp spike up, then go sideways?\n\nIt's going tits up-down-sideways-up-sideways?", "score": 1, "replies": []}, {"body": "/Sets gap scanner to sideways", "score": 1, "replies": []}, {"body": "Is that a 10 period simple moving average or a 20?", "score": 0, "replies": []}, {"body": "I don't understand this subreddit I just got invited to it", "score": -2, "replies": []}]}
{"title": "I was right. I redeemed myself! Every single stock on my watch list is up minus AMD", "selftext": "[removed]", "id": "bitl8m", "created_utc": 1556566047.0, "score": 12, "upvote_ratio": 0.62, "num_comments": 43, "comments": [{"body": "Bro seriously you need to calm lmao. You're a full-time student? So am I. \n\nListen and stop fucking with options. Start with stocks. Not even penny stocks just normal stocks. Get off your gambler's high and start making some fuckin money. Stabilize yourself and start mitigating risk on your portfolio.\n\nSeriously dude the worst thing you could do is double down on dumbassery", "score": 118, "replies": [{"body": "he’s a full time preschool student probably", "score": 43, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "> I will be rich one day mark my words\n\nFam you're going to be homeless at this rate. This is a downward trend line and you're only accelerating it. Stop studying political theory; I'd suggest something that teaches critical thinking.", "score": 42, "replies": []}, {"body": "It's not a question of idiocy bruh, just calm the fuck down and stop trading. It's already bad as is, don't make it worse.\n\nI haven't ever been in a position where I've lost something insane like some of the other dudes on this sub, but seriously listen to them and don't do retarded shit.\n\nAlso get off your phone and stop daytrading for a bit bruh, go enjoy the weather or some gay shit", "score": 23, "replies": [{"body": "Im sorry but I already took the cash advance I can’t stop", "score": 9, "replies": []}, {"body": "BP PFE MRK and GE all beat earnings. So far 100% of my picks have gone well. \n\nI was in BP PFE and GE, 1 contract each since I don’t have money. Do you still think I’m such a bad trader when all my picks are doing well?\n\nThose weren’t just blind picks either. I took the time to research the possibility of an ER beat. There were multiple stocks that I took off my watch list because I didn’t like the DD I found. I really put in the work for this watch list", "score": 6, "replies": [{"body": "> I took the time to research the possibility of an ER beat. \n\n*\"Googles possibility of an ER beat\"*", "score": 5, "replies": []}]}]}, {"body": "I just got a 97% on my western political theory final.\n\nMaybe stick with that field of study then?", "score": 8, "replies": [{"body": "Any idiot can make an A in political theory courses. That is one of the reasons we have so many politicians with BA's in government and politics. \n\nWhat u/joco645 needs is to take a full load of science and math courses (along with a few courses on risk management). Getting his ass handed to him by courses that actually require critical reasoning, logic, and understanding should humble him or put him on academic probation. Plus, it would keep him busy enough that he wouldn't be making stupid plays in the market.", "score": 19, "replies": [{"body": "You think politicians are stupid? Politicians are some of the smartest people society has to offer. Most have advanced degrees from Ivy League universities. Politics history and law require an immense amount of critical thinking", "score": -37, "replies": [{"body": "Hhahahahha, you really are retarded and I must of have struck a nerve. I am going to guess that you are doing a BA too? Most politicians are puppets with fist up their asses. And I can easily assure that the highest rates of grade inflation are in these fields.", "score": 26, "replies": [{"body": "As one who made ‘D’s as a Software Engineer major & made ‘A’s after switching to a Political Science major, I can confirm the accusations of grade inflation are true.", "score": 15, "replies": [{"body": "ECE and Math grad here. We used to call Economic and Political Science our drop out option.", "score": 7, "replies": []}]}]}, {"body": "I’m not buying it...Joco this is some next level trolling...I hope", "score": 10, "replies": [{"body": "BP PFE MRK and GE all beat earnings. So far 100% of my picks have gone well. \n\nI was in BP PFE and GE, 1 contract each since I don’t have money. Do you still think I’m such a bad trader when all my picks are doing well?\n\nThose weren’t just blind picks either. I took the time to research the possibility of an ER beat. There were multiple stocks that I took off my watch list because I didn’t like the DD I found. I really put in the work for this watch list", "score": -1, "replies": []}]}, {"body": "That's why he keeps taking cash advances!\n\nHe's following the politicians debt advice!", "score": 5, "replies": []}, {"body": "The smartest among them: \nhttps://youtu.be/cesSRfXqS1Q", "score": 1, "replies": []}]}]}]}]}]}, {"body": "How much did you make", "score": 21, "replies": [{"body": "Shh, that doesn’t matter :)", "score": 17, "replies": []}, {"body": "Make? You're going the wrong direction", "score": 13, "replies": []}]}, {"body": "Stop, this isn't gonna end well ok.", "score": 19, "replies": [{"body": "I think your autistic", "score": -11, "replies": [{"body": "[deleted]", "score": 42, "replies": [{"body": "Wdym “You’re”? You’re what? Finish your thought.... autist", "score": -24, "replies": [{"body": "[deleted]", "score": 32, "replies": [{"body": "How am I a troll?", "score": -12, "replies": [{"body": "Dude, please eventually let people know you’re a troll. We’ve all had our laughs, it would be great to know this was part of an act. Otherwise, your actions and attitude are just saddening.", "score": 28, "replies": []}, {"body": "All this talk about your 'picks'. Your picks suck.. They suck like a babe still suckling the teet. This lifestyle is not for you.", "score": 5, "replies": []}]}]}, {"body": "Holy shit, new levels of autism have been reached in this fucking debacle.", "score": 14, "replies": [{"body": "Why though? Look at amd, it was on my list and it’s up too. 100% accuracy no luck involved. That Visa swing yielded 50% gains also", "score": -2, "replies": [{"body": "I'm simply speaking to the fact you don't know the difference or correct usage of \"your\" and \"you're\" yet you're taking cash advances and student loan money to \"accidentally\" buy options.  u/abaddon2025 pointed out your incorrect use and you're too dense to realize it.  \n\nGeorge Dubya's No Child Left Behind was a terrible policy.\n\nEdit: my autism with linking u/abaddon2025", "score": 16, "replies": []}]}]}]}]}]}]}, {"body": "He’s so up on his picks he’s now asking me to Venmo him cash. \n\n...after I offered to help GUIDE him out of debt by not being retarded, I.e., help him manage his finances responsibly.  He’s either a loser troll or a complete dipshit.\n\nEither way his life is shitty so enjoy moms basement, kid.", "score": 20, "replies": [{"body": "I said to buy CVS and AMD, they both beat earnings too. Not a single stock I’ve said has gone badly. Why do you think I’m dumb if I all of my picks went well?", "score": -7, "replies": [{"body": "I can't handle this anymore.\n\n\"Why do you think I’m dumb if I all of my picks went well?\"\n\nBecause they went well just a handful, if that, of times. Actual professional traders that have wayyy more edge then this retarded sub have a hard time to keep a consistent gain for multiple years. Warren buffet isn't famous cause he got lucky on some picks for a couple of years. He is able to manage this for a LONG time. \n\nYou are egotistical and arrogant up the ass. You think because you won some that you are some divine intervention. That is why people here call you a dumbass. They all have experienced this and know how shitty things can turn around. \n\nJust because you win on a small time scale doesn't make you genius. The fact you mistaken luck with skill, are a student at a young age, and taking out a cash advance to dig your way out is sincerely sad. \n\nBut have fun. Cause 100% traders like you get burnt sooner or later.", "score": 23, "replies": [{"body": "7 out of 8 of my watch list went well. How could that possibly just be luck?", "score": -21, "replies": [{"body": "Post. Your. Gains.", "score": 28, "replies": []}, {"body": "Thank you for bringing this bit of joy to my otherewise bleak life. Good luck you autistic bastard.", "score": 17, "replies": [{"body": "Why do you still think I’m autistic though. I proved myself", "score": -9, "replies": [{"body": "Did you make money? If not, then you haven't proven shit. Paper trading means nothing. It's perfectly fine to do, but winning at paper trading is meaningless.", "score": 11, "replies": []}, {"body": "I mean, in the first place you are trying to prove yourself to WSB. Like... why would you ever need to PROVE something to WSB unless you were a full autist. Actually that’s all the evidence I need I think. \n\nIn case it isn't though I would like to present your trade history and lack of proof of profits.", "score": 7, "replies": []}]}]}, {"body": "Read and comprehend the post before you reply.\n\nI'll be watching on the sideline for this massive blimp  of yours to go down", "score": 6, "replies": []}, {"body": "Unless you're making good profit you're nothing shrimp man. Seriously you are 20% dumber than a wet piece of cardboard aren't ya?", "score": 2, "replies": []}]}]}]}]}, {"body": "Does not matter unless you have skin in the game. You know what we do to paper traders in this sub...", "score": 17, "replies": []}, {"body": "Tell me you sold your DIS puts for a profit. DIS’s been tanking all day.", "score": 7, "replies": []}]}
