{"title": "I am investing for the first time with $2,250. I have a couple stocks I am going long with. Please let me know what you all think", "selftext": "[deleted]", "id": "czpnou", "created_utc": 1567625738.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 29, "comments": [{"body": "3 of your 4 are technically considered recession go to stocks. Meaning in a recession they should still do well because people will still use their product/services. You shouldn’t need JNUG for that reason. I’d go with another growth stock on top of Disney or a S&P fund or just across the other 4 stocks", "score": 6, "replies": [{"body": "Thank you! I’ll look into some other options", "score": 1, "replies": []}]}, {"body": "I like McD and Disney but would also throw in some more interesting plays in with them.", "score": 3, "replies": [{"body": "Ok thanks!", "score": 1, "replies": []}]}, {"body": "1.  You gotta eat crap.\n2.  You gotta buy crappy shit from Jina.\n3.  You gotta watch crappy entertainment.\n4.  You gotta have someone haul your crap away.\n5.  You're just trying to fuck yourself with this one.\n\nThese are all good.", "score": 4, "replies": [{"body": "Lmao", "score": 2, "replies": []}, {"body": "It’s basically warren buffets technique with the “share of mind” investing strategy. When you think of Soft Drink Company’s you instantly think of Coca-Cola (KO), when you think of kids movies you think Disney (DIS), and when you think of quick food, you always think fast food, and mcdonald’s is one of the major fast food chains. \n\nIt’s definitely smart idea for investing long term", "score": 0, "replies": []}]}, {"body": "There are better plays right now.  If you want to go long.... I have a few in mind that I'm not in yet... Will be once I sell on Friday and move the money.", "score": 2, "replies": [{"body": "Alright!", "score": 1, "replies": [{"body": "Well, depends on what your risk tolerance is...", "score": 2, "replies": [{"body": "I am fine with some risk. A lot of my stocks are safe bets so drop some names", "score": 1, "replies": [{"body": "Ok... I'll let you know on Friday after I get in ! :)", "score": 1, "replies": []}]}]}]}]}, {"body": "I would just go all in on 1 or 2 companies. Teslas a good pick. Tesla is down almost 40 percent from its highs right now and has stabilized so I think it's worth the shot if you really want to make money.\n\nBut all your picks are solid- that would be a pretty defensive portfolio.", "score": 2, "replies": []}, {"body": "With that zmount of capital, and just starting out, i would go with an index fund.", "score": 2, "replies": [{"body": "I’m trying to make investing interesting. I could just have it sitting in a bank. I think this will be a good learning curve", "score": 8, "replies": [{"body": "Have you read any books ln investing or trading?\n\nThose are all extremely mainstream picks aside from the gold ETF/Fund.", "score": 3, "replies": []}]}]}, {"body": "Maybe wait a few weeks and see where the market is headed.", "score": 1, "replies": []}, {"body": "WM and MSFT have been fantastic since I bought them 10 months ago. I just wish I’d bought more. They’re kinda boring but reliable. If you want exciting then buy Tesla.", "score": 1, "replies": []}, {"body": "I'm not a professional. Gona buy Activision on the low then sell when new modernwarfare comes out", "score": 1, "replies": [{"body": "Lmao cheesy move but it works", "score": 1, "replies": []}]}, {"body": "How about JNJ instead of JNUG?", "score": 1, "replies": []}, {"body": "All of those are great and rock-solid companies. But they have been up 25+% each for the last year. Don’t think such a huge price increase is justified for those companies and feel like they are going to come down at some point sooner or later.\n\nStill there is nothing wrong with starting positions in those companies, just make sure you don’t panic if they pull back a little bit at some point. Otherwise all of them are going to do well in the long run.", "score": 1, "replies": []}, {"body": "All your picks are in the USMV fund.  0.15% fee, great fund", "score": 1, "replies": []}, {"body": "I’d look into some of the 5g company’s. Qcom is a good bet as they will make the chips for most handsets. \n\nSomething like MGI first company to utilise blockchain technology and is doing well last few months.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Might swap JNUG with Apple but waste management is a deal breaker for me. Too valuable to be replaced", "score": 1, "replies": []}]}, {"body": "My main concern for the stocks is their current valuation.  The companies are good enough, but if you pay too much for them, their ability to operate well doesn't matter so much anymore because your yield will not be enough to warrant the risk.\n\nI don't see Mcd or WM growing much, meaning that I would expect future earnings to be the same as current earnings.  This means that the potential upside is maybe a 3% return (current pe is around 30).  And the potential downside is a lot bigger than that.  Not worth the risk imo.\n\nDisney and Walmart are more likely to grow, so those future hopefully higher earnings have to be considered.  My opinion on Disney is that it feels like they're at a cycle peak, but I would also do more research to understand that as well.  In general I like these two picks better than the other two, but I still feel like there's better returns that could be made elsewhere.\n\nAt the same time, when investing as little as $2k, you will need to watch fees very closely.  If you are using a broker that charges $5 per trade and buy 5 stocks/ETFs, that would be $50 in costs, or 2.5%.  This is huge and would eat away a lot of your gains -- it would be better to just buy a single more diversified instrument and by default be ahead.  Even if it's some sort of holding company like BRK or KKR or something.", "score": 1, "replies": [{"body": "I am using Webull- the free brokerage. I see your analysis as there is little rapid growth potential for waste management. For McDonald’s, however, their new kiosk will indirectly lead to more sales by faster lines and more self conscious people. There is a direct correlation growth of 5-6% just with kiosks. So it’s all speculate but I’d stick with them. during a recession, more people will choose fast and cheap fast food.", "score": 1, "replies": []}]}, {"body": "With $2250 you have enough to buy one of those.  Pick one.", "score": 0, "replies": []}, {"body": "Put it in bitcoin", "score": 0, "replies": []}]}
{"title": "Closer Look at Tesla's latest Smart Summon update: speed, map details", "selftext": "", "id": "czdntc", "created_utc": 1567558385.0, "score": 31, "upvote_ratio": 0.84, "num_comments": 25, "comments": [{"body": "Old news, I’ve had this for over a month", "score": 9, "replies": [{"body": "Odd. Mine still say enhanced summon and not smart summon.", "score": 3, "replies": [{"body": "Mine still says enhanced summon but everything else is the same as what was mentioned in the article.", "score": 4, "replies": []}]}, {"body": "Thanks, thought it was a new update", "score": 3, "replies": [{"body": "I hadn't seen it yet, thanks for the share :)", "score": 1, "replies": []}]}, {"body": "Inquiry: How did you get in the Early Access Program?", "score": 1, "replies": [{"body": "Got an email almost a year ago “hey wanna join the early access program?”", "score": 1, "replies": [{"body": "Dang.  I’d love to get that email.", "score": 1, "replies": [{"body": "Yeah I can’t imagine they plan on allowing more people in any time soon but I can tell you my driving style is probably one they want since I literally use autopilot every waking second on the highway, and on city streets I’m constantly turning it off and on every 10 seconds or so, so I’m sure they like getting more data from me.", "score": 2, "replies": [{"body": "So, other than Enhanced/Smart Summon - are there any other sweet goodies we can look forward to?  Do u have V10 yet?", "score": 1, "replies": [{"body": "Nope, still waiting on that. I had new UI months before wide release but didn’t realize it was in wide release. Other than that I think the only other feature was scheduling service from the app but I never used it. I have a couple smart summon videos I can send though", "score": 1, "replies": [{"body": "Man that’d be awesome", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "So you guys in America have enhanced summon?\n\nProbably some problems with EU regulations thats holding us back then...", "score": 2, "replies": [{"body": "It is only available to people in the Early Access Program. They will officially release it as part of v10 later this fall. I am also curious about EU users, it is likely regulations will get in the way, as they have with navigate on autopilot features.", "score": 3, "replies": [{"body": "Oh, what features? \n\nDo I want to know what I am missing?", "score": 2, "replies": [{"body": "Noa and Autopilot are more restricted in Europe. From what I know Autopilot is limited in the amount of sharp turns it can make in Europe (makes no sense). And for auto lane change the car has to make the change in 5 seconds or cancel it.", "score": 1, "replies": [{"body": "Wow, what weird restrictions. Thanks for the info!", "score": 2, "replies": []}]}]}]}]}, {"body": "What % if users currently have access to this? Keep seeing posts pop up from time to time.", "score": 2, "replies": []}, {"body": "Do u need FSD for this type of summon or does it work with autopilot 2.5", "score": 1, "replies": [{"body": "It should also be in included if you purchased Enhanced Autopilot back when it was available", "score": 2, "replies": []}, {"body": "FSD", "score": 1, "replies": [{"body": "That's an extra $3,000 right.", "score": 1, "replies": [{"body": "I believe the current price is $6,000 at the time of purchase and $8,000 if added on after purchase", "score": 1, "replies": [{"body": "They send me emails that it's $3,000 every few months. It's like buy it now for cheaper and the capability will be there when it's available later whenever that will be.", "score": 1, "replies": []}]}]}]}]}, {"body": "I thought everybody was supposed to be getting the update by August? :-) Right when I heard about that, I knew there is no way that was going to happen. It’s still definitely in development mode. Probably not even “beta“. Less than beta actually.", "score": -2, "replies": []}]}
{"title": "Calls on $ATVI (Tracer Waifu Edition)", "selftext": "Listen here, $ATVI is blowing the fuck up right now, but is about to have some more bomb ass news after markets close today.  A Nintendo direct is happening at 6:00 pm ET, which will [reportedly be announcing a release of Overwatch for the switch next month](https://kotaku.com/overwatch-comes-to-switch-next-month-1837868458). When Diablo 3 hit the Switch, it sold over 100k units in two days.  Overwatch is a slightly better game than D3, and more importantly it has way better porn than Diablo. Also there are many more switches on the market now than there were a year ago (\\~35k switch units sold), so this is gonna bode well for $ATVI.  \n\n\nBest of all, this is happening right when World of Warcraft classic is blowing a giant nostalgia load all over the faces of 04' teens.  They started with 6 servers, and now have way the fuck more.  [With Classic killing everyone's expectations, the stock has already taken a nice jump](https://www.barrons.com/articles/activision-blizzard-stock-buy-world-of-warfare-videogame-remaster-51567609509). WoW is the top game on Twitch right now and we still don't know exactly what the new WoW Subscriber count is, but once they release that I expect another nice little bump.  \n\n\nTL;DR  \nTauren Gang loves $ATVI", "id": "czoudz", "created_utc": 1567622071.0, "score": 31, "upvote_ratio": 0.9, "num_comments": 21, "comments": [{"body": "The urge to end it all has never been higher than the moment I finished reading this post.", "score": 29, "replies": [{"body": "Soon brother", "score": 10, "replies": []}]}, {"body": "Sold my position today... made a decent 70%.", "score": 19, "replies": [{"body": "Wow I only made 50% but I had close to the money calls", "score": 2, "replies": []}]}, {"body": "Just bought more - fuck I'm retarded", "score": 11, "replies": []}, {"body": "WoW is wayyyy bigger than this and the stock only went up a measly 2%, an explosion here is an exaggeration", "score": 13, "replies": [{"body": "I think a smart move would be buying calls for November since they have Q3 in the beginning week of Nov", "score": 9, "replies": [{"body": "Blizzcon shit the bed last year. And they will be busting their ass to not let that happen again next year. Nov 15 calls are a good bet", "score": 5, "replies": []}, {"body": "Remember everyone sells the news. I’m planning on getting out just before BlizzCon", "score": 3, "replies": []}]}]}, {"body": "honestly... im longing $ROPE rn so fucking hard. I knew that wow classic was gonna be a huge hit as pretty much everyone was talking about it so I didn't bother buying longs because I thought it was all priced in. but this fucking piece of shit of an incompetent market never fails to surprise me so Im just gonna assume nobody knows what the fuck they are doing and am just gonna buy whenever because this market doesn't price shit in for shitttt", "score": 4, "replies": []}, {"body": "bought 48 calls for nov 15 after earnings around $2.64, only holding 15 calls after today, easiest 100% ever, been eyeing this catalyst for months", "score": 5, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Do you have an expected time line on this? Any chance that all of this news just flops? What other DD have you done?", "score": 1, "replies": []}, {"body": "It won't be a huge seller imo. Nintendo has a strong q4 line up though.", "score": 1, "replies": []}, {"body": "I'm in cause fomo", "score": 1, "replies": []}, {"body": "Just barely bought more", "score": 1, "replies": []}, {"body": "My guess is that Overwatch on Switch is already priced in from the leaks. Wow Classic impact has already happened. \n  \nThis fucker always reverts down after having a nice day too. I'm optimistic for the next 6-12 months, but hesitant on YOLO'ing weeklies for tonight's announcement.", "score": 1, "replies": []}, {"body": "Ex-wow player here, I knew something was up I could feel it in the air without even looking at the company", "score": 1, "replies": []}, {"body": "Has call of duty been priced into this as well?", "score": 1, "replies": []}, {"body": "Bought 3 puts on ATVI. Overbought.", "score": -4, "replies": []}]}
{"title": "Short everything", "selftext": "So I found this index a while ago, what are your thoughts about this?  I guess if Trump is not reelected this will probably happen.\n\nhttps://econbrowser.com/archives/2019/09/estimated-probability-of-recession-in-august-2020-49", "id": "czpibu", "created_utc": 1567624991.0, "score": 4, "upvote_ratio": 0.59, "num_comments": 20, "comments": [{"body": "Even people who have literally zero interest in the economy are talking about a recession now. At some point its gonna become a self fulfilling prophecy", "score": 31, "replies": [{"body": "I believe a recession will come when ppl stop spending / investing and rather safe for a bad time. Like right now, like you said everyone's like \"it's a bad time to invest\"", "score": 6, "replies": [{"body": "There is usually a 1-2 year delay from the time people stop spending until the “oh shit” moment.", "score": 3, "replies": []}, {"body": "Most common definition of a recession is literally the state of affairs when people are spending less (GDP shrinks). For two consecutive quarters.", "score": 1, "replies": []}]}, {"body": "They never bop you over the head when you’re expecting them to bop you over the head.\n\nThey wait until you’re not worried about it anymore, THEN they bop you over the head.\n\nMarkets ride the “wall of worry” higher.   They die on good news.", "score": 4, "replies": []}, {"body": "If you have 10 people talking constantly about spaghetti monsters in a room of 100, eventually the other 90 will start wanting to know about this spaghetti monster. \n\nProblem is fear mongering is a common political tactic to get people back on the government tit for reliance.", "score": 0, "replies": []}]}, {"body": "Here's what I know. \n\nA recession is coming. Who the fuck knows when. But buying short term puts is definitely the answer. Because the market is just going to go ahead and price it in now, and spy will go to $150. So lemme know how many puts you wanna buy k.", "score": 26, "replies": [{"body": "Soooo.  You’re saying we should all buy calls then.  Got it.", "score": 17, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Duh. What do you think people do when buying any other equities?", "score": 1, "replies": []}]}]}, {"body": "We all know when. 2020. For elections. To motivate people and blame parties.", "score": 1, "replies": []}, {"body": "Well, aren't long-term options usually liquidated by short up spikes?", "score": -1, "replies": [{"body": "Wat", "score": 6, "replies": [{"body": "Like the margin calls? Isn't that a thing?", "score": -6, "replies": [{"body": "Fuck me. Let know what plays you are currently doing. I'm inversing everything you do.", "score": 13, "replies": [{"body": "I have absolutely no fking clue, thought this was normal here. Sorry mate", "score": -5, "replies": []}]}]}]}]}]}, {"body": "Long Gold.", "score": 5, "replies": []}, {"body": "Probably that a recession can suck my dick 90%", "score": 2, "replies": []}, {"body": "Let's see your short position 👀", "score": 1, "replies": []}, {"body": "Deal with that later when it gets closer to the election.. for now, right now, make money by selling put spreads on the indices..\n\nEspecially after any dips.. look at us rally up from the last dip.\n\nThe key is making sure the put spreads expire this Friday and from here on out the earliest expiry every week.. \n\nDont sell puts it calls long term.. only sell put spreads after drops for the shortest expiry \n\n\nSo, I got my spreads expiring this Friday already", "score": -1, "replies": []}]}
{"title": "Goldman Sachs $GS is trading at 91% of book value. Someone talk me out of why this isnt litterally a risk free investment.", "selftext": "[deleted]", "id": "czqwoj", "created_utc": 1567631678.0, "score": 16, "upvote_ratio": 0.94, "num_comments": 21, "comments": [{"body": "[deleted]", "score": 38, "replies": [{"body": "If you want free money, then sell put spreads expiring this Friday on QQQ or SPY or If you think this is going to go up from here, sell put spreads on GS expiring as soon as possible.", "score": 12, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I'm not telling you how to live your life, I'm telling you how to make money by this friday.. \n\nIt's quite different.", "score": 12, "replies": [{"body": "Today is Friday. Did your prediction come true?", "score": 1, "replies": [{"body": "Happy Cake Day slickromeo! Don't be pushed around by the fears in your mind. Be led by the dreams in your heart.", "score": 1, "replies": []}, {"body": "Yes, have you seen QQQ and SPY? Look at them since the time of my post above when I said to sell put spreads on them! They have absolutely gone up and that means you would have kept all the money and let your put spreads expire and not even close them out. A.k.a. free money that we all speak about here.\n\n  \n\n\nSo yes, it did come true.\n\n  \n\n\nYou can look at a 5 day chart of QQQ t see the truth for yourself too.", "score": 1, "replies": [{"body": "Ok.  I'm new here but I'm curious, do you consider your prediction lucky or was it a calculated prediction which you were nearly sure of? And if so, how could you be so sure?", "score": 1, "replies": [{"body": "I was only sure because we just had bad news ast week and then good news came out with the China talks are trying to happen again..\n\n  \n\n\nSo, based on the old boring same old thing that happend everytime, I knew we would not go down because they just started in the news with \" trade talks resume...\"\n\n  \n\n\nNow you see why this was a \"sure thing\"", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Don’t you think a 1:1 book value is pretty decipherable?", "score": -6, "replies": []}]}, {"body": "if their book value goes down then they won't be under book value", "score": 25, "replies": [{"body": "Very solid point I feel retarded for not thinking this", "score": 10, "replies": [{"body": "happy to inform you, you are in fact retarded.", "score": 4, "replies": []}]}]}, {"body": "The Fed cuts on the 18th will directly affect the finance sectors bottom line by making it harder for them to profit off their fundamental business. Even though regulations have been turned down a notch, investors are worried with all the negative global economic sentiment and how it'll pan out 3 months from now.\n\nIn regard to GS specifically, check out that article in the WSJ today. Apparently they are having a little issue retaining their Partners, the most coveted position in their firm. Issues at the, C-Level, where lifelong soldiers suddenly bail with a generalized disdain toward the CEO and management strategy show red flags. Its not a sure shot investment, but that low price may be worth the risk.\n\nE - Spelling", "score": 9, "replies": [{"body": "I saw that WSJ alert about 20 minutes after I posted this haha. I’m Deffinitly waiting a few weeks atleast now to see how it plays out but $GS has certainly been added to my watch list. I think they are positioned very well for the coming rate cuts and volatile economy.", "score": 3, "replies": []}]}, {"body": "The P/B for Deutsche Bank is at 0.22. Literally a risk-free 5x-er right there.\n\n[https://www.gurufocus.com/term/pb/NYSE:DB/PB-Ratio/Deutsche-Bank-AG](https://www.gurufocus.com/term/pb/NYSE:DB/PB-Ratio/Deutsche-Bank-AG)", "score": 7, "replies": []}, {"body": "Somebody is bagholding for the Orange Wonder. Won’t resolve until the 2020 election is decided.", "score": 5, "replies": []}, {"body": "lesson here as $GS is up 3%. whether you have a good reason to be bullish or bearish, its wrong", "score": 1, "replies": []}, {"body": "I think it’s because investors are scared that the feds will cut the interest rates soon, and when interest rates are cut bank stocks go down. \n\nAlso the financial statements are not continuously updated, so maybe the values of GS’s assets have decreased within this time?", "score": 0, "replies": [{"body": "Banks have already sold off", "score": 1, "replies": []}]}, {"body": "Because trading is hard and your strategy is too easy", "score": -1, "replies": []}]}
{"title": "Economic news for your radar (Sept 4-5) -- THE REAL ONE!", "selftext": "Sorry team, been traveling for work in the Colorado mountains and lack of cell service was an issue as well as shitty WiFi. Anyways, on with the show ….\n\nWeekly ... we don't do weeklies here .. we do FD DAILYS!\n\nThe Economic News Tracker is a daily product. It tracks economic items from 5 PM to 5 PM the next day as we have international economic news to track the night before.\n\nThings are moving so fast and furious, I thought it might be best to see this at the top of your Reddit thread daily for directly-impactful information the next day.\n\n[Last Economic News Tracker Here](https://www.reddit.com/r/wallstreetbets/comments/czrpkx/economic_news_for_your_radar_sept_45/)\n\n*Note - all times are in Eastern Standard Time*\n\n**Wednesday, September 4**\n\n|**Time (EDT)**|**Item**|**Previous**|**Consensus**|**Forecast**|**ACTUAL**|\n|:-|:-|:-|:-|:-|:-|\n|9 PM|\\[CHINA\\] Yuan Valuation|7.1809 *a/o 11:35 pm 9/3*|\\---|**---**|UNK|\n|9:30 PM|\\[AUSTRALIA\\] Balance of Trade|A$8.036B|A$7.4B|A$7.7B|**A$7.268B \\[MISS\\]**|\n\n**Thursday, September 5**\n\n|**Time (EDT)**|**Item**|**Previous**|**Consensus**|**Forecast**|**ACTUAL**|\n|:-|:-|:-|:-|:-|:-|\n|2 AM|\\[GERMANY\\] Factory Orders|2.5%|\\-1.5%|\\-1.2%|**-2.7% \\[MISS\\]**|\n|3:30 AM|\\[GERMANY\\] Construction PMI|49.5|\\---|49.9|**46.3 \\[MISS\\]**|\n|8:30 AM|\\[USA\\] Initial Jobless Claims|215K|215K|219K|**217K \\[BEAT\\]**|\n|8:30 AM|\\[USA\\] Continuing Jobless Claims|1.698M|1.685M|1.691M|**1.662 \\[BEAT\\]**|\n|9:45 AM|\\[USA\\] Services PMI|53|50.9|50.9|**50.7 \\[MISS\\]**|\n|9:45 AM|\\[USA\\] Composite PMI|52.6|50.9|50.9|**50.7 \\[MISS\\]**|\n|10 AM|\\[USA\\] ISM Services PMI|53.7|54|53.4|**56.4 \\[BEAT\\]**|\n|10 AM|\\[USA\\] Factory Orders MoM|0.6%|1%|0.9%|**1.4% \\[BEAT\\]**|", "id": "czrwbe", "created_utc": 1567636213.0, "score": 28, "upvote_ratio": 0.97, "num_comments": 22, "comments": [{"body": "> traveling for work in the Colorado mountains\n\nYeah DEA, this guy here", "score": 11, "replies": [{"body": "Hahaha", "score": 2, "replies": []}]}, {"body": "Anything that could tank the markets tomorrow? All looks pretty tame and uneventful", "score": 3, "replies": [{"body": "Market will pump up more tomorrow,\n\n  \n\n\nI'm selling more put spreads on QQQ expiring this friday.", "score": 3, "replies": [{"body": "I’ll buy those from you for a dollar.", "score": 1, "replies": [{"body": "My good fellow gambler, my short put spreads i sold on QQQ and my short call spreads i sold on UVXY both expire Friday and I will collect all the premium, I dont even need to buy them back.", "score": 2, "replies": []}]}]}, {"body": "If PMI misses", "score": 1, "replies": [{"body": "If PMI misses is that enough to turn this trade talks date from major Green Day were about to have to neutral. Asking for a friend", "score": 1, "replies": [{"body": "Doubt it — because a missed PMI report could be blamed on trade war.", "score": 2, "replies": []}]}]}, {"body": "Just download tradays from metatrader4.\n\nTomorrow is Eurozone unemployment and gdp.\n\nRecently Germany just reported -4.2% industrial production.\n\nSept 7 USA reports nonfarm payrolls", "score": 1, "replies": []}]}, {"body": "Holy shit yuan might get pegged to 7.2 by EOW", "score": 5, "replies": [{"body": "Very possible ... and I missed its valuation last night because of shitty cell and WiFi service. It's 2019 -- is shitty WiFi still a thing?", "score": 3, "replies": [{"body": "Man in first world countries I'd only expect shitty wifi on transit vehicles and super rural areas", "score": 3, "replies": [{"body": "Sigh... the mountains COULD be considered the latter. I digress...", "score": 1, "replies": []}]}, {"body": "Visiting my cousins in canada and the internet here is straight garbage, costs more too. Fuckin shit dropped to 3 mb/s download speed for a few minutes today.\n\nCanadian telecoms are ass raping these people, i should buy stock.", "score": 0, "replies": []}]}, {"body": "Good for 🐻 gang?", "score": 2, "replies": [{"body": "Most consistently good for precious metals gang, sometimes good sometimes meh for bear gang", "score": 3, "replies": []}]}, {"body": "That would be....bad?", "score": 1, "replies": []}]}, {"body": "Thanks friendo.", "score": 2, "replies": []}, {"body": "Composite PMI fell to 50.7", "score": 2, "replies": [{"body": "Just updated … building out tonight/tomorrow's Economic News Tracker now. Interestingly … the ISM Services Index beat pretty handedly and I'm not sure why the Markit and ISM are so off of one another...", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
