{"title": "$1000", "selftext": "**The Road to $1000: Tesla's Multifaceted Rise Fueled by Cars, Energy, AI, and a Devoted Community**\r  \n\r  \nIn the ever-evolving landscape of the stock market, few companies have captured the imagination of investors and enthusiasts alike as Tesla has. The electric vehicle (EV) pioneer led by Elon Musk has become a symbol of innovation, sustainability, and resilience. Despite facing media scrutiny and market volatility, there are compelling reasons to believe that Tesla's stock price could reach $1000 within the next 12 months, driven by factors ranging from their groundbreaking cars and energy solutions to their advancements in artificial intelligence (AI) and a steadfast community support in the face of mainstream media challenges.\r  \n\r  \nDominance in the Electric Vehicle Market:\r  \nTesla's electric vehicles have revolutionized the automotive industry. With a strong focus on design, performance, and sustainability, Tesla has captured a significant share of the growing EV market. The company's commitment to innovation, exemplified by the Model S, Model 3, Model X, and Model Y, positions Tesla as a leader in the transition from traditional combustion engines to electric power.\r  \n\r  \nEnergy Solutions and Sustainability:\r  \nBeyond electric vehicles, Tesla has been at the forefront of renewable energy solutions. The acquisition of SolarCity and the development of solar panels and energy storage solutions showcase Tesla's commitment to a sustainable energy future. As the world shifts towards cleaner and greener alternatives, Tesla's comprehensive approach to energy, from generation to storage, gives it a strategic advantage in a rapidly changing market.\r  \n\r  \nArtificial Intelligence Integration:\r  \nTesla's commitment to AI is not confined to self-driving capabilities; it extends to the overall user experience. The Full Self-Driving (FSD) technology, despite facing regulatory hurdles, remains a cutting-edge feature that positions Tesla as a pioneer in AI integration within the automotive industry. As AI technology continues to mature, Tesla is well-positioned to leverage its expertise for further advancements, providing a competitive edge.\r  \n\r  \nElon Musk's Vision and Media Backlash:\r  \nElon Musk, the enigmatic CEO of Tesla, has been the driving force behind the company's success. Despite facing criticism from mainstream media, Musk's vision and leadership have resonated with a growing community of supporters. Tesla's stock has shown resilience in the face of media challenges, with a dedicated user base that sees beyond the noise, focusing on the long-term potential of the company.\r  \n\r  \nCommunity Support and Grassroots Movement:\r  \nTesla has cultivated a passionate community of supporters, often referred to as \"Tesla fans\" or \"Elon stans.\" This grassroots movement has not only contributed to Tesla's brand loyalty but has also served as a counterforce against negative media narratives. As more users advocate for Tesla, share positive experiences, and engage in social media campaigns, the company benefits from organic, word-of-mouth marketing that transcends traditional advertising.\r  \n\r  \nConclusion:\r  \n\r  \nTesla's journey to a $1000 stock price within the next 12 months appears to be grounded in the company's multifaceted approach to innovation, sustainability, and community support. The electric vehicle market's continued expansion, Tesla's leadership in energy solutions and AI, coupled with the unwavering support of a devoted community, collectively contribute to a compelling case for Tesla's continued success in the stock market. As the world embraces a more sustainable and technology-driven future, Tesla stands at the forefront, ready to drive change and redefine the automotive and energy industries.", "id": "17z49nm", "created_utc": 1700420710.0, "score": 9, "upvote_ratio": 0.56, "num_comments": 63, "comments": [{"body": "\"FUD Filters | We need standards to crack down on spam.\n    If you have any suggestions, please reply here, and we can make sure others can view/agree/disagree and we do this right, together.\n\n  Creating post saying you sold shares\n  - If you're creating a post stating you sold shares at a loss, a screenshot of your sold position will be required, else it will be removed as spam.\n\n  Creating a post regarding a tweet\n  - If you're creating a post regarding a tweet, the original TWTR url must be linked on the post as well, else it will be removed as spam.\n  - Flair used must be TWTR\n\n  Creating a self-harm post\n  Creating a Poop Post or Low Effort Post\n  - Yes, these will automatically be removed.\"\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Hey chatgpt, give me a list of reasons Tsla will reach $1000 in 12 months", "score": 10, "replies": [{"body": "Predicting stock prices, especially for a specific company like Tesla (TSLA), involves considering various factors and is inherently uncertain. However, I can provide you with a list of potential reasons that investors and analysts might believe could drive Tesla's stock price to reach $1000 in the next 12 months. It's important to note that these are hypothetical scenarios and not guarantees:\n\n&#x200B;\n\n1. \\*\\*Strong Financial Performance\\*\\*: Continued growth in revenue and profitability, driven by increased sales, efficient production, and strong margins, could boost investor confidence.\n\n&#x200B;\n\n2. \\*\\*Expansion of Production Capacity\\*\\*: The opening and ramping up of new Gigafactories, leading to increased production capacity, could meet rising demand for electric vehicles (EVs).\n\n&#x200B;\n\n3. \\*\\*Innovation in Battery Technology\\*\\*: Breakthroughs in battery technology, leading to longer range, shorter charging times, and lower costs, could enhance Tesla's competitive edge.\n\n&#x200B;\n\n4. \\*\\*Growth in Energy Business\\*\\*: Significant advancements or revenue growth in Tesla’s solar and energy storage businesses might contribute to overall company valuation.\n\n&#x200B;\n\n5. \\*\\*Autonomous Driving Technology\\*\\*: Progress or breakthroughs in full self-driving (FSD) technology could be a major catalyst, as it has the potential to unlock new revenue streams.\n\n&#x200B;\n\n6. \\*\\*Regulatory Support\\*\\*: Increased government incentives and support for EVs in key markets like the U.S., Europe, and China could boost sales.\n\n&#x200B;\n\n7. \\*\\*Wider Product Lineup\\*\\*: Introduction of new vehicle models, such as the Cybertruck, or entry into new segments like commercial vehicles, could open up additional markets.\n\n&#x200B;\n\n8. \\*\\*Global EV Demand\\*\\*: Continued growth in global EV demand, driven by environmental concerns and government policies, could benefit market leaders like Tesla.\n\n&#x200B;\n\n9. \\*\\*Strategic Partnerships or Acquisitions\\*\\*: Strategic partnerships or acquisitions that enhance Tesla's technology, supply chain, or market access could be positive for the stock.\n\n&#x200B;\n\n10. \\*\\*Brand Strength and Market Leadership\\*\\*: Tesla’s brand strength and position as a market leader in the EV sector could continue to attract investors.\n\n&#x200B;\n\n11. \\*\\*Positive Macro-economic Conditions\\*\\*: A favorable macroeconomic environment, including stable interest rates and strong consumer spending, could support higher stock valuations.\n\n&#x200B;\n\n12. \\*\\*Technical Breakthroughs in Other Ventures\\*\\*: Success or significant progress in other ventures like SpaceX's Starlink (if leveraged in collaboration with Tesla) could indirectly boost investor sentiment.\n\n&#x200B;\n\nIt's crucial to conduct thorough research and consider the risks involved in stock market investments. The stock market is influenced by a multitude of factors, including economic conditions, company performance, industry trends, and investor sentiment, making it challenging to predict future prices accurately.", "score": 3, "replies": [{"body": "12 was more or less my anwser in my other reply.", "score": 2, "replies": []}]}]}, {"body": "Meet Kevin agrees with you… but who knows, just buy and hold.  Musk isn’t perfect but I can’t think of anyone that has had a greater impact on humanity in my lifetime.  Just don’t turn on MSM, they hate him.", "score": 9, "replies": [{"body": "You can’t think of anyone that has a a greater impact on humanity in your lifetime? Are you serious?! I didn’t know he had won the Pulitzer Peace prize and ended world hunger…", "score": -6, "replies": [{"body": "-Electric cars -Solar energy generation -Home battery storage -Humanoid robots -Making humanity multi planetary -Global internet access -Freedom of speech advocate -Tunnels to decongest traffic -human/computer connection to help the disabled -AI to solve real world problems -Comedian\n\nWho do you think can top this?  I’m not saying you’re wrong… i just can’t think of anyone.", "score": 6, "replies": [{"body": "I honestly don’t have the energy to respond item by item. But the majority of those are still figments of imagination and the rest are a result of Musk buying others ideas. \nMusk creates nothing. He’s a market manipulator and snake oil salesman. There are infinite ways that he could contribute to the world, but all of his “ideas” have only proven to inflate his TSLA value. \nThe CT will be the mail in his coffin after Twitter. I foresee him resigning his role with Tesla and remaining a stakeholder. \nThat will be the true test of the value of TSLA, which is a CAR company and not Stark Enterprises. \nIronically, Nikola Tesla was a vastly greater inventor than Musk, which in itself is so ironic in that He had to use the name of a real pioneer and genius.\nIn comparison, everything else that Musk has created has been a mundane variation of “X”, which has to be the most generic unimaginative name one could conceive since it’s often used in place of a named signature. \n\nJust look at any of the innovators in space, genetics, medicine, science, languages, astronomy, etc and they have tangible invaluable contributions that can’t be matched by ALL of the efforts of Musk. \n\nIf Musk wasn’t bolstering his image as an oligarch, he could easily finance real contributions to public transit-which is the heart of our problems other carbon emissions. Silly tunnels with Tesla cars is not a solution, but another money grab from government funding to pump his TSLA value. \nIf you are a true fan of Musk, you HAVE to actually follow the news and see just how many failures he has produced, outside of driving EV adoption; which again- only works with limited success for large scale adoption and infrastructure AND PROVIDING A PRODUCT THAT CAN NOT ONLY REDUCE CARBON EMISSIONS, but will ALSO not be a proprietarily guarded brand that gatekeeps aftermarket repair and service- which is instrumental in expediting repairs, service, and cost conscious life extensions for vehicles. We want vehicles that should easily reach 20 years of operation and don’t require several months to repair at a fixed cost that TSLA controls. \nOur world needs improved transit, drinking water/sanitation, trustworthy leadership, and humanitarianism- something that MUSK is completely devoid of. \nI believe in Free Speech in principle, but we are also facing a dilemma where those controlling the message have decided that truth is irrelevant as long as it continues to enrich- Musk thinks he’s a lexicon because no one is able to give him feedback without facing consequence. It’s classic narcissism that you see from the likes of Trump, Kanye, Alex Jones, and Rogan. \nIf you want to invest in TSLA because it will make you money- good for you. That’s capitalism. But, don’t try to dress Musk up as some kind hero when really he is just another rich demagogue that’s lost value in his wealth and depends on worship and acknowledgement as his greatest currency.", "score": -4, "replies": [{"body": "\"I don't have the energy to respond item by item\" \n\ndedicates entire night to response", "score": 3, "replies": [{"body": "Because it would require siting all of EMs false claims and lawsuits. \nIt’s much easier to respond in broad strokes.", "score": 0, "replies": []}]}, {"body": "Here is my respective debate. No one successful made it anywhere without failure and to sustain a single successful business from startup statisticallically is very hard let alone a multi billion dollar one, and further more multiple revolutionary businesses. No business is perfect and no business ever will be. No business's is ever fully clean and every business and person will do things that piss off someone.\n\nThat being said i, like the other commentor, don't know anyone that could sustain those businesses, still have a vision to propel humanity to heights never reached before and well beyond the completion, while also being so far into the public eye.\n\nSo sure the dude and his companies have flaws and this isn't to say other people haven't contributed alot to humanity but imo the dude deserves alot of credit for what he has done so far and will probably do atleast in the near future.", "score": 4, "replies": []}, {"body": "Hey thanks for the long response.  I appreciate that you took the time to explain where you are coming from.", "score": 1, "replies": [{"body": "I am probably in a bad mood, so thanks for being polite. \nHave a great holiday", "score": 2, "replies": []}]}, {"body": "You didn’t really argue against any point the original comment made. All you really pointed out is that you don’t like Musk and therefore his accomplishments are moot. “He should focus on xyz instead“ isnt a real argument at all.   \n\n\nthe copium is crazy", "score": 1, "replies": [{"body": "It’s not a point of disliking Musk: the majority of his “accomplishments” have not even come to fruition. Which just reinforces the point that everything outside of his car company, is serving to finance/inflate the value of his car company. \nTo make my “copium” easier for you to digest, here is simply a list of the lawsuits against your boy\n\nhttps://en.wikipedia.org/wiki/List_of_lawsuits_involving_Tesla,_Inc.\n\nThese in themselves are enough to question hisintegrity. You don’t amass 1,750 against Tesla, Inc alone as normal business operations. \n\nhttps://www.reuters.com/legal/elon-musks-growing-legal-challenges-2023-10-06/\n\nAgain, you can pretend he’s not a POS, but he has deliberately bought an internet social media platform to express himself. The sad irony that he LOST his battle with Twitter by thinking he could game the system and pump his TSLA value by leaking his interest in acquiring Twitter, thus committing himself to a company that AGAIN he overvalued. \n\nWhen Elon is driving EVS through tunnels on Mars while broadcasting free internet for his new population of Musk offspring, you can full well sing his praises.", "score": 1, "replies": [{"body": "“Until Elon is on mars, I dont Think he’s accomplished anything” \n\nyou’re a child", "score": 1, "replies": [{"body": "You’re a sycophant that refuses to address my responses.", "score": 1, "replies": [{"body": "You havent made a single solid point outside of “I dint Like him” there’s nothing to respond to", "score": 1, "replies": [{"body": "I made several with citations but you choose to ignore those. Would you prefer I draw examples so you can relate on a more rudimentary level. Are you a graphs and charts person that can’t process words? How many examples would it take for you to climb down off your pedestal and admit Musk is a corrupt POS that’s taking consumers and his investors for a ride.  \nI’m not sure what this condition is that forces so many people to live in denial and just ignore facts, but it seems like you either lack the capability to concede or you like low effort arguments for the attention. \n\nYou can easily sub to r/RealTesla, r/enoughelousk, or other relative subs if you want to read daily reports of his bullshit. \n\nIt’s weird, because I don’t hold any of these tycoons in admiration, and it’s beyond me that most people don’t realize that rich oligarchs that “suffer”from affluenza and are surrounded by yes men aren’t good people that represent any interest beyond wealth. Maybe, you feel important latching yourself on to them or feeling important belonging to some group that makes you smarter. Im guessing it’s just greed and narcissism.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Image/Link submissions are manually reviewed due to spam control. -1B\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "> The CT will be the mail in his coffin after Twitter.\n\nWhat is CT ?", "score": 1, "replies": [{"body": "CyberTruck, I think it’s going to be a historic failure and will never meet production (nor demand) expectations. Pair that with disappointing earnings calls, bad optics with his commentary through Twitter, and a brand that is already over valued-  he can’t hype himself out of the larger and larger holes he digs for himself in public. \n\nA lot of CEOs leave when they negatively impact their earnings.", "score": 2, "replies": [{"body": "CT will just be a forgotten meme, like hyperloop flamethrower", "score": 1, "replies": []}]}]}]}, {"body": "He’s talked about all these things but most of them have been absolute failures. \n\nElectric cars, check.\n\nSolar city was a complete failure.\n\nHumanoid robots aren’t real. He’s talked and shown things. But their impact to date has been 0.\n\nHasn’t made humanity multi planetary.\n\nGlobal internet access, that he also is controlling. \n\nFreedom of speech advocate, as long as you aren’t talking about Tesla lol or talking about public plane information. \n\nThe tunnels have been a complete failure and done nothing to decongest traffic.\n\nHuman computer connection has done nothing but kill some chimps quite horrifically. \n\nComedian…..that got booed off stage the only time he’s been on a comedy stage in his life. \n\nBased on that, he’s made electric cars MUCH more popular. That’s about it. Also lied for 9 years straight about the state of FSD and that a Tesla is an appreciating asset while he voluntarily depreciates them. Doesn’t even remotely fall into the humanitarian category.", "score": 1, "replies": []}]}, {"body": "The Pulitzer Prize is about writers, what the fuck is a Pulitzer peace prize?", "score": 2, "replies": [{"body": "Late night error- I meant Nobel but the same message applies .", "score": 1, "replies": []}]}]}]}, {"body": "No way it hits $1,000 in 12 months.  I will take bets from anyone here on that.\n\n$1,000 per share would represent a $3.17 trillion dollar market cap, [making them larger than Google and Amazon ***combined***.](https://companiesmarketcap.com/)  How does it get from around a \\~$700-800 billion market cap today to $3.1 trillion in a mere 12 months??\n\nCybertruck?  No.  They've admitted it's going to take a while to ramp production, and CT is already \"baked in\" to the current prices.\n\nEnergy markets?  Encouraging, but IMO it's going to be a slow 5-10 year horizon before that one is meaningfully contributing to top-line revenue.\n\nFSD?  IMO it sure as shit ain't going to be FSD that does it in only 12 months.  v11 FSD is a bust in terms of future development, and v12 \"all neural nets\" remains to be seen how that plays out.  If v12 doesn't dramatically leapfrog v11's capabilities in short order once it starts rolling out late this year / early next year ... then Tesla will have a real problem on their hands and even getting into the $1tn club will be a challenge.\n\nIf v12 does ok, I could see Tesla working their way back into a $1tn market cap valuation in 2024 (which would translate into a roughly $315/share price).  $2tn ($630/share) is going to be very very hard to crack just on FSD, IMO.  \n\nWall Street views price targets based on market cap + total addressable market opportunities, not share price.\n\n(ME: Long on shares since 2017)", "score": 16, "replies": [{"body": "Lol imagine someone bets you, and then elon does a r/s.", "score": 4, "replies": [{"body": "That wouldn't win the bet.", "score": 2, "replies": []}]}, {"body": "Net income per vehicle is dropping and real competition is hitting in two of their three biggest markets, and it's becoming more and more obvious that they won't be the worldwide dominant force that people thought they were going to be.  $1,000 is delusional.", "score": -3, "replies": [{"body": "Not delusional if Tesla can capture the autonomous robotaxi market majority, and deliver 20M cars a year at 2022 margins.\n\nBut yeah that's not happening in 12 months", "score": 5, "replies": [{"body": "Or in any of our lifetimes. More than 20% share of the global car market? Not going to happen. Level 5 autonomy? Not going to happen.", "score": 3, "replies": []}]}]}, {"body": "V11 is essential for V12. You cannot have one without the other. I do not think the stock will hit 1000 in a year but if they prove out FSD in any meaningful way in the next year then the stock will rise well before actual revenue is gained from FSD being finessed. My prediction is the stock will be upper 300’s or lower 400’s with some real genuine progress on FSD but somehow there will be some uncertainty introduced either through government or some other roadblock, perhaps a well funded disinformation campaigns that will make investors split on going all in on the stock. RemindMe! 1 year", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Image/Link submissions are manually reviewed due to spam control. -1B\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "The perception network is the only thing of v11 that will survive into v12, at least as far as I have understood it.  All the decision making / control layer code (hundreds of thousands of lines) is getting dumped.\n\nI think if v12 drops and it's decent and advances quickly, then back up to $300 will be on the horizon pretty quickly.  \"The Street\" will be willing to see Tesla back in the $1tn market cap club if they can see both a way for Tesla to monetize additional revenue out of all the existing drivers who didn't buy FSD, plus licensing.  Could even push $400.\n\n$500 I think would require a bit more.  FSD Licensing deals.  Big jumps in energy.  Or maybe v12 FSD starting to power Optimus in meaningful, useful ways.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "5-10 years", "score": 5, "replies": []}, {"body": "Maybe if Elon stops talking so much.", "score": 2, "replies": []}, {"body": "Not in 1 year for that kind of valuation, but maybe 5-6 years.  So definitely a long hold.  1. Keep developing autonomous driving capabilities and AI features, and related robotaxi initiatives.  2. Continue and accelerate work on a $25k entry level vehicle.  3. Enter into more strategic partnerships and acquisitions to develop and grow first tier supplier revenue, which I believe is substantially understated. 4. Would definitely continue development of Optimus as a warehouse and everyday use robotic assistant and start to deploy within 5 years. 5. Energy storage and microgrid packages combining solar will be a very large opportunity, and is happening now. 6. Continue to prioritize manufacturing innovation and process improvements that put Tesla where it is today.\n\nI’m holding long.", "score": 2, "replies": []}, {"body": "It’s probably going to be around $750 per share late 2024, early 2025. And somewhere between $5k and $8k 2030/2032.", "score": 2, "replies": []}, {"body": "It could happen because of Starship/Space X and the fact that the closest you can get to investing in any of that is TSLA. \n\nElon said \"Tesla is for all of earths problems Space X is for everywhere else\" \n\nAt the end of the day people are investing in Elon more than they are Tesla when they buy TSLA.", "score": 6, "replies": [{"body": "? You don’t own spaceX with Tesla stock lol", "score": 1, "replies": []}]}, {"body": "You’re insane if you think it’s going to $1000 in the next 12 months. I’m a massive Tesla bull but that’s ridiculous.", "score": 1, "replies": [{"body": "People said the same thing in 2020… no one knows when the next big leg up will be, but it’s going to be a fun ride.", "score": 2, "replies": [{"body": "Fundamentally, the market is built on liquidity. That’s it. Free money, low rates means money flowing into risky assets to chase returns and that’s why so many garbage stocks had fantastic year in 2020 and first half of 2021. We are not going to see another major bull run in the short term", "score": 0, "replies": []}]}]}, {"body": "If any of these thing actually worked as advertised I would agree with this post. FSD is garbage and the cats are cheaply made. After owning one I have little faith they will survive the fight against Toyota and the rest of the real car makers", "score": 0, "replies": [{"body": "I’m surprised people actually believe FSD is garbage. I have A 40 minute commute to work and I drive Maybe 5 minutes of the total drive. It does exactly what it says it’s suppose to do. Does it still need to improve? Yes absolutely. But saying it’s trash is imo a trash opinion", "score": 3, "replies": [{"body": "I’m just upset about the pretend auto wipers on my y. Haven’t used FSD, but have heard some pretty alarming things. Appreciate your jab at my opinion though. Have a nice day", "score": 1, "replies": []}]}]}, {"body": "I was an early shareholder but can no longer justify supporting musk or his businesses. He’ll probably be fine-people like him never face consequences-but I’m no longer interested in financially supporting his ignorant and hateful worldview. I’m out. Get boned Elon.", "score": -5, "replies": [{"body": "-Electric cars\n-Solar energy generation \n-Home battery storage\n-Humanoid robots\n-Making humanity multi planetary \n-Global internet access\n-Freedom of speech advocate\n-Tunnels to decongest traffic\n-human/computer connection to help the disabled \n-AI to solve real world problems\n-Comedian\n\nElon is a real f***ing a**hole", "score": 5, "replies": [{"body": "Thank you. These people who get on the trendy bandwagon of “I hate Elon” are so insufferable.", "score": 4, "replies": []}]}]}, {"body": "Never gonna happen. At least, not in your lifetime.", "score": -2, "replies": [{"body": "Downvoted all you want. OP is full of shit and so are the 2 fuckboys that downvoted me.", "score": 1, "replies": []}]}, {"body": "I bet that Tesla stocks will go down in the long run, unless Musk leaves, in which case sky is the limit.", "score": -9, "replies": []}, {"body": "Yeah it's 5 to 7 years out. But it will get there eventually.", "score": 1, "replies": []}, {"body": "🤣🤣🤣🤣🤣", "score": 1, "replies": []}, {"body": "... This was supposed to have happened already...it's getting harder to stay long on these shares...", "score": 1, "replies": []}, {"body": "Yes TSLA will and can achieve 1000 dollars per stock . It has happened , and it could happen again.  But until then we are speculating on it . TSLA has to make breakthrough moves by reaching 420 first . Could 2024 be the year to do it or cyber truck could be the catalyst or25k car will do it ? We just don’t have any evidence.", "score": 1, "replies": []}, {"body": "I’d be good with a 1000 target", "score": 1, "replies": []}, {"body": "I would say more like $170/shr in one year…", "score": 1, "replies": []}]}
