{"title": "LEAPs vs Shares", "selftext": "I have been evaluating strategy to possibly sell all my shares and buy leaps as replacement. I would either buy leaps at the money or ITM based on the IV for the leaps and delta (thinking of 0.6 to 0.7). \n\nI can sell CC against them, I am buying for January 2023. Mostly quality names such as AAPL, GM, F, ORCL, PLTR, NIO and a few more. I realize couple are kind of meme stocks but I believe in them. \n\nAm I thinking this right? I should be able to get more appreciation over the period of time as opposed to holding shares (except for dividend) and I am bullish on these names and think I will be deep ITM by DTE.", "id": "m8z7lq", "created_utc": 1616213508.0, "score": 24, "upvote_ratio": 0.93, "num_comments": 80, "comments": [{"body": "As I understand it, you can better utilize your capital if you plan on holding long-term with LEAPS instead of 100 shares, plus you still have the advantage of being able to sell CC's against them. General interweb snooping tells me that a 75-80 delta is preferred for LEAPS and I've noticed that buying deep ITM calls seem to make the most sense when buying in (generally around that delta, by coincidence or not).  \n\nGranted I have no idea what I'm talking about, but I seem to be shifting my strategy to doing something similar to this.", "score": 8, "replies": [{"body": "I tried the P&L calculator for AAPL 2023 leaps. At that time $70 leaps was costing around $50 and $120 leap was $20. So when I did analysis, I ran for 2 $120 leaps and 1 $70 leaps (almost same capital required) If AAPL is at $200 in January 2023, I would end up making more money with $120 leap as opposed to $70 one. That’s when I started to pivot to at the money leap.", "score": 6, "replies": [{"body": ">I would end up making more money with $120 leap as opposed to $70 one. \n\nLook at the difference in breakevens, delta, theta, and vega on those 2 calls. A LEAP isn't really comparable to a long call that is barely in the money. It's most often compared to owning shares and holding. Even your 70c might not be deep enough in the money, it has been recommend to go with a delta of 95 or higher, then compare that to buying the same 100 shares and holding until 2023, including but not limited to the cash that is locked up in both scenarios.\n\nhttps://optionstrat.com/build/long-call/AAPL", "score": 5, "replies": []}, {"body": "Makes sense. I suppose I'm looking at a potential early exit vs a 2-year commitment (I have commitment issues, shocking).  If you're very bullish and are in it for the long haul, you're absolute right by picking up 2 vs 1. If you want to be able to pivot on a whim though, the deeper ITM calls present a more immediate upside (assuming stocks only go up) versus their less expensive counterparts. \n\nWhich P/L calculator are you using out of curiosity?", "score": 3, "replies": [{"body": "Yeah. I thought so but asking the experts here to see if there is a hole in my strategy. I mean, I know it will go down and go up for the long term, I expect it to be up so with leaps, I could actually get more gains as opposed to holding shares using the same capital. \n\nI have acct with Fidelity and use their P&L calculator from Active Trader Pro. It lets me add simulated position and evaluate P&L at various price points and dates.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yes. But with the same capital, you can get 2 $120 leaps ($24 premium) as opposed to 1 $70 leap ($50 premium). So you are making $160 as opposed to $130 with same capital", "score": 1, "replies": []}]}]}, {"body": "Can you do this in a Roth? I don't think I can do this in mine and I have Fidelity.", "score": 2, "replies": [{"body": "Selling calls against LEAPs means you are technically selling naked calls, since if you are assigned a call you must deliver shares, not LEAPs. Naked calls require margin. Margin is prohibited for Roth IRAs.", "score": 4, "replies": [{"body": "You execute the LEAPS to get the shares", "score": 2, "replies": [{"body": "Sure, if you have strike price X 100 in dollars. But until you do, any calls you write are not covered.", "score": 1, "replies": []}]}, {"body": "Pretty sure most brokers (including fidelity) call this a debit spread.\n\nThat's how it's labeled in my fidelity so they recognize it and don't require you to keep naked call collateral", "score": 1, "replies": [{"body": "You're right actually. But it usually does require a higher options privilege level than covered calls.", "score": 1, "replies": []}]}]}, {"body": "You need L2-plus authorization with fidelity in order to do this, but you can trade options in a Roth with fidelity. It's a pain to get authorized with them though.", "score": 1, "replies": [{"body": "Ok, that's what I thought. I have L2 auth on my Roth, but I don't think I'm allowed to sell against LEAPS on my Roth there. I have a 2023 SABR LEAP they won't let me sell against.", "score": 1, "replies": [{"body": "Hello fellow SABR LEAP holder. I am in a similar situation but I am also holding shares that I'm writing CCs against.\n\nWhat's your strike on the LEAPs?", "score": 1, "replies": [{"body": "$3! I went DEEP in the money. Maybe I should exercise early and sell CCs.", "score": 1, "replies": [{"body": "Exercising early means forfeiting extrinsic value. Just sell them and buy shares.", "score": 2, "replies": []}]}]}]}]}, {"body": "I think I am doing this in my Fid Roth. I buy 2022 call and sell shorter calls against that with no underlying stock. Requires margin though. I think it is L2 plus spreads with margin activated.\n\nin one case the short call was executed well before expiration and both sides unwound.", "score": 1, "replies": []}, {"body": "I can do this in my regular IRA and my Roth IRA with TDA.", "score": 1, "replies": []}]}, {"body": ">As I understand it, you can better utilize your capital if you plan on holding long-term with LEAPS instead of 100 shares, plus you still have the advantage of being able to sell CC's against them.\n\nThey're technically naked.", "score": 1, "replies": []}]}, {"body": "LEAPs are the way to go my friend. Highly recommended. Just don’t exercise early. Hold through the turbulence and you’ll be rewarded. With LEAPs a upward price movement captures more upside but the same goes for a significant downward move. A tech correction could demolish your LEAPs in a matter of days, but hold. That’s the power of 2023 expiration.", "score": 6, "replies": []}, {"body": "i am a huge fan of leaps but i'd never think selling out of everything in some forced time frame to completely switch your long term strategy is an advisable idea. 🤷‍♀️\n\ndon't use calculators. look up the black scholes model. all those numbers change based on various underlying mechanics in large part with current events. those calculators aren't good planning, they're a snapshot in time. look at everything around the company. think it'll be wildly better in a year or two? willing to take some risk on it? buy leaps. buy various strikes. nothing wrong with otm leaps.", "score": 9, "replies": [{"body": "Any reason for that? Mathematically, if I sell AAPL today and buy at the money leaps for 2023, if the price dips or appreciates, I feel the effect and will have more capital to buy more leaps to accelerate my gains if I am bullish on AAPL. Reason for my post was to see if there is a hole in my strategy so please let me know what you think. TIA.", "score": 2, "replies": [{"body": "reason for what exactly? it's just leverage. \n\nback out a bit in how you're framing this. stop thinking about the numbers *right now*. \n\n*in 2023* every input for the black scholes model will have changed. \n\noptions are inherently risky, they can go to zero while the company is still doing fine. look at apple. that is the risk. it's substantially greater than owning shares. if you're ok with that risk, then it's available. \n\nit's available because someone else thinks you're stupid and/or impatient. call their bluff, by all means, but be prepared to lose. 🤷‍♀️", "score": 7, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Exactllly. Especially for someone who is new to trading but wants to be in heavy.", "score": 2, "replies": []}, {"body": "Leaps are more risky. Options are more risky than stocks.\n\nIn your example, with stocks if you don't sell you don't lose.  With options if you don't sell you STILL lose, every day.  No matter how small.", "score": 1, "replies": [{"body": "You can only lose extrinsic value. If an option is deep ITM there is almost no extrinsic value left so there will be very little decay.  \n  \nWith regards to 'if you don't sell you don't lose' it's mental gymnastics - let's say the stock collapsed and your LEAP expired worthless - yes you now have a realized loss (vs unrealized loss with the stock) but if you buy in another LEAP it has the exact same effect as holding the stock.", "score": 2, "replies": [{"body": "There's no mental gymnastics about it.  You might not like that thought but that's just fact.\n\nIn a downturn I prefer holding stock to options bc we all know your stock can/will recover but your option is toast\n\nYeah you can buy another leap but that doesn't help the leap you lost or losing in.", "score": 1, "replies": [{"body": "Please understand that there is zero difference mathematically between realized and unrealized losses. A stock going down and you being -1k and then going back up to bring you to breakeven is the exact same thing as a stock going down and your 1k option expiring worthless, buying another and making 1k when it goes back up. No difference.", "score": 3, "replies": [{"body": "It doesn't work like that.  Wash sake will put those losses right back on their\n\nAnd there is a difference. You don't record losses on a down stock to the IRS.  Your options expires worthless, that gets reported as such", "score": 1, "replies": [{"body": "Touché there may be a tax difference - otherwise no", "score": 1, "replies": [{"body": "Well...in a down turn I'd rather own the stock than an expiring option.  If it wasn't for my apple stock my account would have been wiped out.  \n\nNearly all my options expired or are expiring worthless.  At least with my stock apples should be back to profitablity by earnings", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Thanks for the paradigm shift. When entering an option position always ask what does the person selling this sees that I don't", "score": 1, "replies": [{"body": "Bid/ask spreads. That's what they see.", "score": 8, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "What if my short call is a month out but leap is 18 months out?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "You want to be at least .7 delta in, and keep a .4 delta difference. If playing it safe, keep a .5 delta difference.", "score": 2, "replies": []}]}]}, {"body": "Thanks for that added data dimension.", "score": 1, "replies": []}]}, {"body": "IV won’t remain the same, and a lot of factors impact the value of your options. I buy leaps, but never plan on holding long term like I would shares. There are a lot of benefits to both shares, and options, but there are many layers to this onion.", "score": 3, "replies": []}, {"body": "You would be better off getting leaps on SPY and similar ETFs.  They move much better and don't stay down as long", "score": 3, "replies": []}, {"body": "Why does everyone think leaps are the way to go I don't get it", "score": 2, "replies": [{"body": "They give you leverage without having to pay margin interest. You can get similar leverage by buying the underlying on margin, but then you'll have to pay interest. Plus not all accounts can have margin- so LEAPs let you leverage accounts that are otherwise not leverageable. Of course, *all* options give you leverage, so there's another reason.\n\nThey decay much, much lower. Short term options require rapid price movements to overcome the time decay. LEAPs are for when you are not (necessarily) expecting a rapid price movement, but something more long term.", "score": 7, "replies": []}]}, {"body": "Doing something similar though I have no idea whether it makes sense though I clearly believe it does. Moved from 30% to 70% cash with ability to buy back shares sold at price lower than exit price.\n\nHave been a “buy and hold“ investor but concerned about downside risk. So, I sold my positions in tax sheltered accounts and bought 20% ITM calls for 2022 and have been selling and rolling shorter duration calls. On the first round it’s as if I sold shares at $100 with potential of buying back at about $98. This has so far improved at every iteration. My amateur thinking is, if stock goes down a doomsday 40%, my calls may be worthless but I have cash from the sale to buy a bunch more of the shares back. If I had held the shares I would be down 40%, but since I hold calls, max loss has been capped to 20% less premiums received. In contrast, if shares inflate, that’s good too. I am sure there is some fallacy in my logic.\n\nHave low confidence in calculators given volatility of inputs over time, so do not use them now for anything beyond 3 months.", "score": 2, "replies": [{"body": "That was my thought process as well but not to buy back shares but buy more leaps if price falls. I am thinking by 2023, some of the overall economic risk catalysts will play out and we should be in clear of this upcoming doom.", "score": 2, "replies": [{"body": "Interesting someone else thinks similarly. My concern is the 40% drop followed by stagflation. Willing to give up some upside for next few years while things shake out. If it does tank, I would hold till it hits bottom and moves up say 5% before buying new leaps.\n\nGood luck to both of us on this approach.", "score": 2, "replies": []}]}]}, {"body": "I’m new to trading, but I feel like options are much more American than only being allowed to buy and sell shares of a company that I don’t know what is doing behind closed doors.       🪨 🇺🇸 🦅 = 🦍 🚀 🌝 🍌 = Charlie Work Trying to Explain Myself Clearly", "score": 2, "replies": []}, {"body": "I have LEAPS on F, NIO, PLTR, TGT, and ACB", "score": 2, "replies": []}, {"body": "Look up the kelly criterion. Leverage yourself to not get wiped out.\n\nLeaps give you leverage, but just keep in the back of your mind regarding assignment risk.\n\nYou are basically leveraging yourself for a premium. If your thesis holds your leaps will reap more rewards.\n\nWhat if your CC goes very far ITM cause you were right? How will you manage that?\n\nOptions are leverage.", "score": 1, "replies": [{"body": "His LEAPS would gain more than his CC, having a higher delta. He could sell his LEAPS, and use the proceeds to cover the short and buy new LEAPS at a higher strike.", "score": 5, "replies": [{"body": "Your leaps dont always gain more value then the CC you sold, because delta of the CC is 1 or near 0 close to expiry while ur leap stays at 0.7", "score": 1, "replies": [{"body": "At the expiry or if I do get assigned, delta won’t matter though right? For example if I sold 5/21 $150 call against my $120 call for 2023, if price goes at $150 and I get assigned, I still made $10 ((150-120)-$20 (premium for my $120 call)).", "score": 2, "replies": []}, {"body": "1. That's a good reason to choose LEAPS deep ITM (delta above 0.7), and not to sell too risky CCs (delta above 0.3).\n2. You are looking at the deltas only at the end. During the way up, the delta for the CC is lower, so he's gaining on the LEAPS more than he's losing on the CC. At the same time, the CC is losing theta much faster than the LEAPS.\n3. At the very worst, if he gets assigned he could exercise the LEAPS to cover the short. But there's no reason to do that. Instead he should sell the LEAPS to regain the premium while already have received the premium of the CC.\n4. My naive estimation is that at the end he should be left with enough to buy new LEAPS (for the same expiration) with a strike price that is higher by (spot at the CC expiry date - CC strike) . It would still be ITM, and its delta should be similar to the LEAPS' delta as it was when he sold the CC. I'm not accounting for differences in IV/gamma, so if this is wrong I'll be happy to know how to make a better estimate. I'm fairly new to options, and I'd appreciate a better understanding of PMCC.", "score": 1, "replies": []}]}]}, {"body": "I plan on selling short term CC and not long term. For example, I can sell $150 call for 5/21/21 on my AAPL leap of $120 for 2023. Less premium, yes but risk of assignment is also that low. I have almost 2 years to keep selling monthly CC to regain as much capital as I can and I keep changing the strike as price goes up or down. I also make sure the CC I am selling I’d always at higher strike than my leap strike.", "score": 2, "replies": [{"body": "Selling a $150 call on AAPL with a year and 2 months till DTE would be an extremely stupid call to sell. There’s a high probability that they will hit $150 by EOY. Besides that it’s just silly to sell your CCs out that far, you want to find a juicy spot where theta decay helps you get in and out faster and collect more premiums as well as selling during elevated levels of IV.", "score": 1, "replies": [{"body": "Sorry my bad. I meant to say 5/21/21.", "score": 1, "replies": []}]}]}]}, {"body": "Sell OTM puts and buy OTM call leaps. Decay will offset", "score": 1, "replies": [{"body": "Same expiry or shorter dated puts?", "score": 1, "replies": []}]}, {"body": "Why not keep your shares and sell weekly calls to rake premium? If you get bought out, then consider replacing with LEAPS. But make some $ off your shares in the mean time.", "score": 1, "replies": [{"body": "I can’t sell weeklies because of my work. Have do sell 30 day out minimum.", "score": 5, "replies": []}]}, {"body": "What a good stock to play option on with 1000", "score": 1, "replies": [{"body": "SOS / EBON. Cash secured puts (CSP) until assignment at a price you feel comfortable owning the underlying (UL) with. Once you’re assigned, write covered calls (CC) above your break even (BE) price. Use Theta to your benefit. Once your CC is in the money (ITM) someone may exercise and take it away from you. If they do, rinse and repeat. Do CSP’s when the price is declining. Write CC’s when price is increasing. Keep in mind, I chose two stocks as an example but it is ultimately up to you to choose your risk tolerance. If you play it smart, and don’t get greedy, you will have a hard time losing money. Even if your UL drops way below your BE, you still write your CC’s above your BE. Might take a bit to dig out of, but you’re ensuring your entries and exits. Good luck.\n\nEdit: YouTube Kamikaze Cash if you’re unfamiliar with any of these concepts. Don’t rush into any trade. Cash is a position.", "score": 1, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}, {"body": "I've been considering this as well, but pondering If it's worth it for some stocks particularly for itm leaps which can be close to 1/2 the underlying depending. In which case I'm thinking I might be better off margin trading with 2x leverage that way.", "score": 1, "replies": [{"body": "From how and what I understand, I felt the IV plays a role. I am going for ATM leaps for low IV (AAPL, F, GM) and ITM leaps with 0.9 delta for high IV stocks such as PLTR, TLRY.", "score": 1, "replies": [{"body": "I primarily look for high IV as i like to sell the IV so maybe that's a significant difference.", "score": 1, "replies": []}]}]}, {"body": "So what happens when market drops 20-30% Could happen with higher corporate tax rate and inflation. I would personally hold the shares which pay dividends so if market drops, you reinvest dividends for more shares. Buying LEAPS tends to work better at market bottoms, not tops.", "score": 1, "replies": [{"body": "Can you lmk when we are at bottom and top like 2 days in advance? Thanks", "score": 3, "replies": [{"body": "No problem", "score": 2, "replies": []}]}, {"body": "No way to know when tank is coming and if it tanks, shares will tank too. Dividend for the stocks I am looking at won’t be enough to keep me afloat anyway. At least that’s what I am thinking right now", "score": 1, "replies": []}]}, {"body": "Leaps are less liquid and a bit more risky but can work if you’re sure it’s going to go up", "score": 1, "replies": []}, {"body": "I wouldn't do it.  \n\n1. You always want to diversify in case of a market downturn.  Your stocks are always safe no matter how bad the market gets\n\n2. Selling covered calls on leaps is risky.  Stock takes off it will cost you a ton to buy your short position back.  Cost you even more if you get assigned.  There's no real discussion on the cons of the PMCC\n\n3. If the stocks tanks(apple from 144 to 119) you're not selling any concerned calls.\n\n*IMO.  Buy the calls when the stock is in the can(apple), go deep in the money .80 delta or better.", "score": 1, "replies": []}, {"body": "I didn’t think you could sell CC’s on LEAPS?", "score": 1, "replies": [{"body": "Yes you can.", "score": 1, "replies": [{"body": "Thank you. I just looked it up. Seems like a solid strategy. Something I would like to try out myself if I’m ever lucky enough to get assigned on all my AAPL cc’s \nLike pulling teeth.", "score": 1, "replies": []}]}, {"body": "It's PMCC statergy", "score": 1, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}, {"body": "I’d make sure your underlying doesn’t have a relatively large dividend you’ll lose out on those buying leaps.", "score": 1, "replies": []}, {"body": "How far out are you looking for expirations on your CC’s? I was looking at the same type setup with WRAP, but I’m thinking about buying 2 LEAPs for Jan.23 and writing 3 CC’s (May, July, October) against them, all in one trade.", "score": 1, "replies": [{"body": "Won’t one of the call be naked then? If you are buying 2 and selling 3?\n\nI have done something similar with TLRY. Bought Jan 22 and sold March 26 in the same trade. \n\nI would like to do this 30-40 day out instead of long term so I can manage the trade better. I don’t intend to get assigned.", "score": 1, "replies": [{"body": "One will be naked, but it’s a cheap stock and I own about 50 shares anyway.", "score": 2, "replies": []}, {"body": "I owned just under 200 shares of WRAP outright, so they were all covered. I closed most of my WRAP positions for a loss...", "score": 1, "replies": []}]}]}]}
