{"title": "The Wolf of Wall Street Says You're Getting Fleeced By The Brokers and Market Makers", "selftext": "As more retail investors become interested in investing in the financial markets, the more information available to the general public, the better.\n\nRecently, there have been some [Congressional hearings in the US](https://www.nytimes.com/2021/03/17/business/gamestop-hearing.html) in the wake of the ongoing Gamestop saga in which questions have been  raised over the practice of Payment for Order Flow (PFOF) which has become more common and a core part of the business model for no commission trading pioneered by Robinhood.\n\nWhile  PFOF is not a new practice, it is seemingly becoming more common as  more brokerages follow Robinhood's model in order to compete for the burgeoning retail trading business.  At least in the US, it appears fewer brokerages are now offering the traditional commission based trading structure:  Fidelity, Merrill Edge, Interactive Brokers (but not their newer \"IBKR Lite\" platform) are some examples (are there more?).\n\nPFOF is banned in at least two other jurisdictions: the UK and Canada.\n\nRightly maligned for his prior fradulent behaviour in his pump and dump \"boiler-room\" schemes where he took up to $200 million from investors, the infamous \"Wolf of Wall Street\" recently gave an interview in which  he discussed the topic at hand, shedding a bit more light on the practice:\n\n[Fortune interview with Jordan Belfort, the \"Wolf of Wall Street\"](https://fortune.com/2021/03/21/bitcoin-stock-market-jordan-belfort-small-investors-wolf-of-wall-street-interview/)\n\n>\"It's the most expensive 'free trade' you can have,\" says Belfort. \"I saw a marketing demo from one of the big 'free trades' players advertising  how they were 'helping the little guy,' and they're hand in hand with the big guys. It was like a betrayal of trust.\" He says that market makers pay so much for order flow because it gives them an exclusive  window into where the market is moving. When firms see tons of orders coming in for Tesla, they can purchase shares for their own account, pushing up the EV-maker's prices for their clients when the next flood of orders arrives. \"Order flow is everything,\" he says. \"It tells you where the market is going next. It gives the high-frequency market makers a crystal ball and puts the small investor at a big information    disadvantage. Seeing all that order flow gives a market maker information that the public doesn't have.\"  \n>  \n>..  \n>  \n>In his example, if the market maker buys XYZ at $50.01 and sells at $50.09, it makes a fat, 8¢ spread. But if the firm \"worked the order\" by seeking buyers willing to pay a bit more, it could purchase for on behalf of its client at $50.05, and sell at $50.06. The seller gets 4¢ more, the buyer gets 3¢ off, and the trade costs the little guy just 1¢ instead of 8¢. \"Traders' compensation depends on marking up trades and  keeping wide spreads,\" he says. \"You'd have to be Mother Teresa not to fall for that temptation.\"\n\n[How Robinhood (and the other brokerages that have followed them) Make Money on Trades Despite Taking No Commissions](https://www.cnbc.com/2020/08/13/how-robinhood-makes-money-on-customer-trades-despite-making-it-free.html)\n\n[Bloomberg Opinion Article on Payment for Order Flow](https://www.bloomberg.com/opinion/articles/2021-02-05/robinhood-gamestop-saga-pressures-payment-for-order-flow)\n\n[Investopedia Article: What is Payment for Order Flow?](https://www.investopedia.com/terms/p/paymentoforderflow.asp)\n\n>..payment for order flow is a practice pioneered by [Bernard Madoff](https://www.investopedia.com/terms/b/bernard-madoff.asp)—the same Madoff of Ponzi scheme notoriety.  \n>  \n>The Securities and Exchange Commission (SEC) said, in a [special study](https://www.sec.gov/news/studies/ordpay.htm) on PFOF published in December 2000, “Payment for order flow is a method of transferring some of the trading profits from market making to the brokers that route customer orders to specialists for execution.” \n\n[Payment for Order Flow is banned in the UK](https://www.cfainstitute.org/en/advocacy/policy-positions/payment-for-order-flow-in-the-united-kingdom)\n\n[Payment for Order Flow is also prohibited in Canada](https://www.gbm.scotiabank.com/content/dam/gbm/market-insights/etf/october/2019-10-02-Free-Trading.pdf)\n\nThe SEC ultimately decided against banning the practice in the US, citing the potential benefit to investors in encouraging competition that would presumably increase execution quality.\n\nOne last link: [the SEC charged Robinhood in 2020 for misleading customers about revenue sources and failing to satisfy the duty of best execution (fining them $65 million).](https://www.sec.gov/news/press-release/2020-321)\n\nWhat are your thoughts on PFOF?  Does knowing about it affect your choice of brokerage?  Should it be banned in more jurisdictions?", "id": "mb14ej", "created_utc": 1616456207.0, "score": 439, "upvote_ratio": 0.88, "num_comments": 82, "comments": [{"body": "Well duh lol. It was even worse in the 80s and 90s, the fees you had to pay to trade and the amount of insight you had into what was going on behind the scenes was lame. \n\nThis is why I do limit orders on my broker, not market orders.", "score": 193, "replies": [{"body": "I'm annoyed that I traded for 7 years before using limit orders for this reason.", "score": 63, "replies": [{"body": "Wait what’s so bad about market orders?", "score": 6, "replies": [{"body": "[removed]", "score": 55, "replies": [{"body": "Schwab frequently completes trades at better than the visible quote, and announces in the order status that they improved the price.", "score": 4, "replies": [{"body": ">Schwab frequently completes trades at better than the visible quote, and announces in the order status that they improved the price.\n\nI just switched to schwab. process was superchill and they gave me level 3.", "score": 2, "replies": []}]}, {"body": "\n>its much harder for them to do that when you set your purchase at X.05\n\nWhy?  Does the app/website not announce your limit buy order to anyone until after the stock hits the right price?", "score": 5, "replies": [{"body": "If you use a limit buy order, you're never going to be paying above what you want to pay for the stock, by definition. Your order either gets filled at (or below) what you wanted to pay, or it doesn't get filled.\n\nMarket orders are basically always a terrible idea, never use them.", "score": 57, "replies": [{"body": "They can do the same with limit orders. You set a buy order for $40, but they don’t actually buy it until it hits $39.95, and then sell it to you at $40. If it doesn’t hit $39.95, the order just doesn’t get executed, and it’s not like you can sue them or anything.", "score": 24, "replies": [{"body": "You clearly have never seen level 2 market data, because that's not how this works. And yes, you would be able to sue them. This is the stock market, there are records of every hair on every trader's foreskin, let alone every trade, transaction, offer, and execution.", "score": 9, "replies": [{"body": "Some zero commission brokers make their money on CFDs with this method. The buy/sell spread is always in their favour and they collect their fee from your trade with the discrepancy regardless of a limit order or not.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[https://www.investopedia.com/terms/s/stockrecord.asp#:\\~:text=Every%20brokerage%20is%20required%20to,accurate%20record%2Dkeeping%20is%20essential](https://www.investopedia.com/terms/s/stockrecord.asp#:~:text=Every%20brokerage%20is%20required%20to,accurate%20record%2Dkeeping%20is%20essential).\n\n&#x200B;\n\nThere's a difference between not knowing which things happened or why certain trades were made, which led to certain price actions, and not having records of transactions at all. Records of every trade are kept. How else do you think you're able to view all your past trades on your online brokerage account? Every trade is stored.", "score": 1, "replies": []}]}, {"body": "you can't sue wallstreet lmao, they'll bury you in lawyer fees.", "score": 2, "replies": [{"body": "I mean, there's a such thing as an open-and-shut case.  If you have to build up some conspiracy case against them, you'll lose but You can definitely sue wall street and win if you have grounds and an airtight case.", "score": 1, "replies": []}]}, {"body": "I’ve personally had\n- Buy Limit orders fulfilled, with Google and Yahoo showing the day low above my price.\n- Buy Limit orders unfulfilled, with Google and Yahoo showing the day low under my price.", "score": 1, "replies": [{"body": "Yeah that's really not how anything works. You might not have been the lowest buy order, so someone lower than you got matched before you did. Learn about NBBO and look at *level 2 market data, not just a Google daily chart*.", "score": 6, "replies": [{"body": "That makes no sense. I offered to buy a stock for $100, but a seller decided to sell to someone who offered him $90???", "score": 1, "replies": [{"body": "Highest/lowest (depends on which side of buy/sell you're on). Exchanges have to match up lots of different orders for buying and selling at specific prices (that's what level 2 data shows you...), you don't always get the lowest price *that exists* if you're buying because someone else might have placed their buy order in ahead of you, or might have a lower price than you.\n\nFor instance if you have a buy order for $50, someone else has a buy for $45, and there are *sell* orders for $45 and $47, you might get matched with the 47 and he might get matched with the 45, so that you both get filled. Your order therefore fills at 47 but the lowest fill for the day is at 45. Or you might buy at $50 but then *later in the day* the price drops and someone sells some shares for $42 or something.\n\n&#x200B;\n\nThere are so many legitimate ways you can purchase an asset at a price higher than the lowest price for that day.", "score": 1, "replies": [{"body": "Dude, you’re either not reading what I wrote, or have a severe reading comprehension problem.", "score": 0, "replies": [{"body": "You expressed confusion about limit orders because you haven't understood how they work at all in this discussion, I clarified how people with limit orders can be matched up.\n\n&#x200B;\n\nYou seem to have the IQ of a radish. Good luck trading. I'm sure you'll be the next Michael Burry.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I use a free to trade app so to speak. They only offer zero commission on limit orders not market orders. So that would suggest in fact they do profit off limit orders likely more so than market orders. Gives them more time to get in front of you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Limit orders by their very nature set the price-per-share that you will pay per share,whereas market orders buy off of the order chain which can move while you’re putting the order in, giving you an unexpected price change, or be subject to the order flow spread that Belfort outlines above. Limit orders are not immune to the order flow spread problem either, but at least you know what’s coming out of your pocket when it goes through.", "score": 2, "replies": []}, {"body": "They call it the spread because you’re getting fucked.", "score": 2, "replies": []}]}]}, {"body": "It's funny. I benefited from a market order once. The stock showed it was trading at 11.20, decided to do a market order(sell) for experimenting and it got filled at 11.78 while the ticker dropped to 11.15.", "score": 6, "replies": [{"body": "Limit orders would do the same on a decent brokerage.\n\nLimit orders should get you 'at least that price' or higher especially in brokerages that don't participate PFOF on stocks like Fidelity.", "score": 9, "replies": [{"body": "I have fidelity and I've never had a limit sale even a 1/10th of a cent of price improvement over my limit. On limit buys, however, they like to show you a cent here or half-cent there probably because they already have the stock in their dark pool. Could be luck but my gut says otherwise. Like if i sell at 5.00 limit, they could sell it at 5.05 but only give me 5.00. They still executed my limit but scalped .05 per share. It wouldn't surprise me.", "score": 4, "replies": [{"body": "It literally states in the 606 Form that Fidelity doesn't scalp your order.\n\n[https://clearingcustody.fidelity.com/app/literature/item/9901330.html](https://clearingcustody.fidelity.com/app/literature/item/9901330.html)\n\n$0.00 to negative.", "score": 9, "replies": [{"body": "Okay, and you don't think a company has ever made a form just to CTOA while doing what they're not supposed to? I know they SAY they don't, but how would anyone ever know?", "score": 3, "replies": [{"body": "It's one of the very few brokerages that don't for buy/sell stocks.\n\nFidelity is proud enough to even have a page about it: [https://www.fidelity.com/trading/execution-quality/overview](https://www.fidelity.com/trading/execution-quality/overview)\n\nIt's honestly the most transparent too to its users from my experience.\n\nI wrote the list of brokerages that don't do PFOF for stocks in: \"Brokerages List by Payment For Order Flow\" in WSB (or you can go through my post history)\n\n&#x200B;\n\nTL;DR: Only Chase, Vanguard, Fidelity, Merrill Lynch, IBKR Pro, Public\n\nEvery other major brokerages do scalp off your order for buy/sell stocks.", "score": 14, "replies": [{"body": "Still don't understand why this is supposedly as bad as op is making it out to be. If I'm spending $1000 on lets say 50 shares of something @ $20 a share, and I pay 1 penny over market per share, thats 50 cents, which is still a hell of a lot better than it used to be at $7 flat per TRADE. That shit basically made investing for poorer people impossible. If they wanted to invest $100, $7 in AND out means they have to net more than 14% just to BREAK EVEN.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "yeah hate to break this to you but a limit order would've done the same. limit sell at x basically guarantees x **or better**.", "score": 1, "replies": []}]}, {"body": "why anyone would do market orders is beyond me. I'm open to arguments for it though", "score": 12, "replies": [{"body": "If you want to be sure it executes right away and the bid/ask spread is very narrow I don't think it's a big deal. On less liquid investments you can definitely get taken to the cleaners though.", "score": 64, "replies": [{"body": "This \n\nSpy I can enter or exit at market for day trades when I'm seeing swing activity. \n\nI made 6%and it looks like it's about to tank? Market sale my position.\n\nDon't care if I make 4% instead of 5%. Setting too high of limit means losing money on some of those swings.", "score": 28, "replies": []}]}, {"body": "If it’s a one cent wide market, there’s no reason to use limit orders unless paying that extra cent is for some reason a deal breaker to you \n\nIn most cases, you’d rather have the trade execute instantaneously rather than chancing missing the purchase because of a fucking penny", "score": 39, "replies": []}, {"body": "Market orders are totally fine for anything with a low spread (buying any large cap stock). Trying to save 2 cents on an order and ending up chasing the price as it goes up will be way worse. \n\nOf course you need to use limit when spread is huge, such as when buying volatile options.", "score": 10, "replies": []}, {"body": "Idk - if you're buying AAPL and MSFT to hold for years/decades seems like it wouldn't make a difference", "score": 3, "replies": []}, {"body": "I only use them for shares, I never use them for options, I figured the share price fluctuation didn't make it worth it? Or am I missing something here? Options sometimes have wide bid-ask spreads so I get that.", "score": 2, "replies": []}, {"body": "To make sure you get filled, especially when selling", "score": 2, "replies": []}]}]}, {"body": "yeah but I've always wondered,\n\nyears ago when we were paying a commission, **weren't they still fleecing us?**", "score": 24, "replies": [{"body": "The best thing would be to leave PFOF but make that level 2 data available to the public.  Your brokerage still has an obligation to try to get you the best price possible so I assume having that data become public would lead to more accountability/lawsuits.", "score": 3, "replies": []}]}, {"body": "I wouldn’t have a problem with it if retail investors had PFOF access via API of the orders. Actually, if a company allowed, I’d pay a monthly fee to have access", "score": 17, "replies": [{"body": "How much would you be willing to pay for this?", "score": 7, "replies": [{"body": "Tree fiddy", "score": 23, "replies": [{"body": "*percent*\n\nMwahahaha", "score": 1, "replies": []}]}, {"body": "Since this is all hypothetical, I would pay upwards of $250 a year? If I created a business around an exclusive API that taps into the market makers, I would make a freemium business model. The $250 would be for full access of the order flows without any market latency. The tricky part is convincing the market makers to approve said API.", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I'm not sure selling to one excludes you from being able to sell to the other in this scenario.", "score": 1, "replies": [{"body": "But then why would citadel still buy it for that much", "score": 2, "replies": [{"body": "They probably won't, but if the increased revenue from selling it to the public is more than the decreased revenue that Citadel and others are willing to pay, then it becomes an opportunity to explore.  This is still a business, after all.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Stop spamming this shit. And fuck Jordan Belfort, he's in it to get attention on himself, not because he gives a shit about anyone else.\n\nPFOF was already big back in Jan before Belfort had any input.", "score": 56, "replies": [{"body": "This guy is such a shameless prick. I wouldnt buy water from him even if I was stuck in a desert.", "score": 4, "replies": []}]}, {"body": "Interesting.  I didn't know this practice was banned in Canada.  That would explain why all the brokers up here have so many fees attached to them instead of being \"free\" like you see so often in the US now.", "score": 8, "replies": []}, {"body": "Jordan Belfort is a scammer and a scumbag human being, he is just riding the celebrity after the movie, I wouldn't listen to anything that comes out of his mouth", "score": 13, "replies": []}, {"body": "[Video Feed for 1st US Congressional Hearing: Game Stopped? Who Wins and Loses When Short Sellers, Social Media, and Retail Investors Collide](https://www.youtube.com/watch?v=RfEuNHVPc_k)\n\n[Video Feed for 2nd US Congressional Hearing: Game Stopped? Who Wins and Loses When Short Sellers, Social Media, and Retail Investors Collide](https://www.youtube.com/watch?v=imRzHXRq80I)", "score": 4, "replies": [{"body": "might also want to look at the 10min and something before your timestamp in the 2nd hearing. That part was cut out of the CNBC video of that hearing. For whatever reason.", "score": 1, "replies": []}]}, {"body": "I think too much is made of this.  PFOF just spreads the market-making profits to different players.  In the old days, when prices were quoted in 1/8 of a dollar (12.5 cents), the market makers (largely NYSE members) made huge profits from the retail trader, as well as the broker who charged [high commissions](https://www.businessinsider.com/historical-trading-commissions-2014-3) to execute the trade.  \n\nNow with 1 cent price increments and cut-throat competition among market makers, that easy money has been given largely back to the retail investor.  I'm fine with that.\n\nPFOF doesn't guarantee profits to the market-maker because he can't see the whole market stairstep.  Much of the information has shifted to control of the dark pools, where each sponsor has different rules for trade-matching and price setting.  That's where they see the big volume coming from the mutual funds and pensions.\n\nBut information is information, and that's why the brokerages get a fraction of a penny to route trades to certain market makers, and in general, this is a much better market for retail traders than the old specialist-firm days.", "score": 20, "replies": [{"body": "I’d been thinking people had made to big of a deal about it, or automatically attach some insidious plot with it.", "score": 4, "replies": []}]}, {"body": "There Ain’t No Such Thing As A Free Lunch!", "score": 10, "replies": []}, {"body": "So after today I'm convinced Madoff was a pioneer. The gov threw him in jail and took his idea, payment for order flow..", "score": 8, "replies": [{"body": "His reward for PFOF was chairmanship of the NASDAQ. The government threw him in jail after his “firm” was revealed as literally nothing more than a Chase bank account.", "score": 18, "replies": [{"body": "Isn’t that the shit?!?! My man was like “yeah I got the investment strategies! Guaranteed 1% monthly returns.” HAHAHAHAHAHAHAHAHA. Then when the shit hit the fan HE TURNED HIMSELF IN SO THE PEOPLE HE FUCKED WOULDNT KILL HIM!!!! HAHAHAHAHAHAHAHAHA!!!!! holy shit that’s waaaaaaayyyyy too much.", "score": 5, "replies": []}]}]}, {"body": "There is an old saying “if something is free, then YOU are the product.” If you’re too naive to believe “free” trades are actually “free”. Then the joke’s probably always on you.", "score": 6, "replies": [{"body": "If u ain’t the hitter u just might be the lick.", "score": 3, "replies": []}]}, {"body": "So in the movie \"Wolf of Wall Street\" the fictional character \"Jordan Belfort\" was allegedly earning 50% commissions pushing penny stocks on random strangers...", "score": 2, "replies": []}, {"body": "It's worse than simple pfof. Robinhood (let's just say it) only sells order flow to the market makers that give it a percentage of the spread (over a flat fee) which malaligns their interest with the MM over their own customers as traders want smaller spreads while MM want larger spreads. (This was all covered in the last hearing)\n\nIt was found that when RH trading went down, the spread decreased.  I vote no confidence the SEC.", "score": 2, "replies": []}, {"body": "Hasn’t this always been the case? Every market, whether a stock market, housing market, or banana market, brokers are going to take their cut in whichever way they can. Nothing is free.", "score": 2, "replies": []}, {"body": "If anyone doesn’t know this they should just buy mutual funds", "score": 2, "replies": []}, {"body": "I actually just always assumed for this to be the case, I try to keep away from most of the popular stocks for this reason. So if we buy the stocks without merket buy/sell order does this still apply? I use the app \"freetrade\" and the order always goes through instantly.", "score": 2, "replies": []}, {"body": "The wolf know because he did it. Now he’s an ape just like us.", "score": 1, "replies": []}, {"body": "Duh. Why would they ever stop? Worst case they have to pay a fee or find a scapegoat.", "score": 1, "replies": []}, {"body": "Wow - I thought I had exactly the same chances and set up as everyone else in the market, including Hedge Funds, Market Makers and institutional clients - you want to tell me my order of 500$ GME wont be treated the same as a 50million order from a hedge fund? But that would mean that life isnt fair? I mean in real life everyone is exactly the same, everyone is a millionaire and nobody has any edge over anything, why isnt that in the market?", "score": 1, "replies": []}, {"body": "I think taxing PFOF at a vanishingly small rate, could eliminate the national debt and provide a UBI for all U.S. citizens.", "score": 1, "replies": []}, {"body": "BIG surprise, ??  So what your saying is the democrats want to keep you relying on the government and not making a lot of money? \nWow big surprise.. WAKE THE FUCK UP!!!!", "score": -18, "replies": []}, {"body": "Where are the customers yachts? There are none because of Order Flow and other tactics employed by Wall St (from skimming market makers to pump and dump funds, quant front running algos and many other deliciously devious strategies) designed to keep Wall St rich. \n\nAnd if you were in their position you’d be doing the same. \n\nWolves will be wolves and the sheep will always get slaughtered. Baaa!", "score": 1, "replies": []}, {"body": "As opposed to the $7 commissions...I’m fine with it, really. I set my limits and pay what I am willing to pay.", "score": 1, "replies": []}, {"body": "Best Execution means that PFOF isn't allowed to adversely affect the prices of orders. \n\nThe amount of profit made by the broker or the intermediary by having knowledge of order flow is smaller than the commissions that would have been paid without it. Brokers only go along with it because 0 commissions is the competitive price. And the information is imperfect, because competition for order flow fractionates the data, so the aggregate effect on market prices and order-tracking profits is not as big as it could be if there was a monopoly in the flow.", "score": 1, "replies": []}, {"body": "https://www.cameo.com/wolfofwallst\n\nYou can pay him to say whatever you want lol", "score": 1, "replies": []}, {"body": "I guess everyone badly wants $4, $6.95 & $10 commission trades back again. Limit order, folks .\n\nAlmost every brokerage now gives commision free trades...I use fidelity, TD, chase, Merrell....all commision free.  what exactly is complaint here? Front running?", "score": 1, "replies": []}]}
{"title": "DD Boomer Edition:Canadian Pacific to Merge with Kansas City Railroad. 🚂 I am autistic so I like the trains.", "selftext": "https://www.wsj.com/articles/railroads-strike-a-25-billion-merger-11616330332\n\nCanadian Pacific has been trying to make a major purchase of a US railroad for years that would allow them a clean path between Mexico and Canada.  They want badly to be the USMCA railroad and have been put down by regulators multiple times despite raising cash for huge companies like Norfolk Southern.\n\nUS regulators have been blocking it because their buyouts would have arguably reduced market options and railroads are the one piece of semi-public assets the US still seems to be on board with protecting.  This small $25 billion dollar deal resolves the problem because instead of picking up a major rail network Canadian Pacific brokered a deal with a short line  🩳➖railroad service.  \n\nIn this case the Kansas City Southern is a very limited route with half of it's rail in mexico and it's US rail being simple long isolated stretches rather than the web a company like Norfolk provides.  So the primary regulatory concern is gone and from an international trade standpoint this would actually be a win.\n\nOther Factors: \n\nRailroads are good recovery stocks.  Supply lines and distribution are a mess with back logs right now.  Ports are backed up, raw materials are missing and Texas getting shutdown by the storm hit a number of industries in that area hard.  Rail lines provide the ability to move large amounts of freight at lower prices than any other method on the globe.  \n\nRailways are also increasingly green technology.  They were already the most efficient transportation method on the market but the technology keeps improving and railways has lots of incentive to adapt as energy costs are one of the major factors in their profits.  This means the industry likely doesn't see any pain coming out of the Biden administration and can likely get a piece of an alleged infrastructure bill.\n\nBoomer Points:\n\nRailways give dividends!  Thats extra money in your pocket.  Great secure industry that isn't going anywhere.  Millennials may be afraid of 🚂 but they need trains to move 🥑🍞 and the less millennials talk about an industry the less likely they are to try to cancel it.   Rail is secure and GROWING.  \n\nRailways are simple and easy to understand.  People need to move things and 🚂 are 💪 alone.  \n\nThis would literally be a new transcontinental railroad just in the other direction!  It is 🚂 history in the making!\n\nWarnings : The last two merger attempts by CP failed.  This is their third shot at an end goal of getting direct access lines tied together between the USMCA counties.  Probably the most likely to succeed but no guarantee.\n\nRail is slow and that makes it vulnerable to other developments in the transit market (see self driving electric trucks).  The market is strong and showing promise but needs to push it's own technology forward to remain competitive long term.  Not to say they aren't trying but the auto industry has way more Engineers.\n\nPositions;. Currently none.  Merger was announced today.  Calls are pricey but I'm going to try to buy in early Monday.  Rail is actually beating the market anyway.", "id": "mabg4o", "created_utc": 1616376266.0, "score": 295, "upvote_ratio": 0.88, "num_comments": 86, "comments": [{"body": "Invest in Choo choo, go wohoo! \nCrayons for all!", "score": 73, "replies": [{"body": "CHOO CHOO lookin like white lines and hookers", "score": 2, "replies": [{"body": "White rails and couplers", "score": 1, "replies": []}]}]}, {"body": "I don’t think this will happen CP’s been trying to buy KCS for a decade if they haven’t done it by now I doubt they’ll do it now", "score": 19, "replies": [{"body": "I looked up some old posts on railroad forums about this and a decade ago they were just discussing a corporate agreement the merger thing is new.   It is definitely going to shareholder vote at a minimum.  I don't know shareholder attitudes so you may be right but personally as a future share holder who won't have a vote I would vote for it since it seems like a clear competitive advantage.", "score": 22, "replies": [{"body": "This has to pass the surface transit board and that’s extremely tough after all of the mergers in the late 80’s and early 90’s when rail traffic came to a halt. I’m torn on this because I think BNSF and UP push very very hard against this, as this would be fucking up their Mexico business.", "score": 6, "replies": [{"body": "True, but I read that KSU has a decades old exemption of some sort that would make passing the STB a lot easier.", "score": 1, "replies": []}]}]}]}, {"body": "It's refreshing to see DD related to other tickets besides GME AMC for a change", "score": 19, "replies": []}, {"body": "!wsbgold", "score": 20, "replies": [{"body": "Added /u/PatrickSebast as an approved submitter. Hey OP, mention any crypto, SPACs, or stocks under the market cap lower bound (1 billion) and this will be revoked.", "score": 22, "replies": []}]}, {"body": "Been pondering this all day. Not really sure what the play here is yet - familiar with RR's and the industry but no positions currently. Not sure if I like calls or whether to buy shares of either CP or KCS.... and this could easily blow up in regulatory, but hopefully third time is the charm for CP.\n\n(KCS ticker is KSU. Always annoys me when the SCAC doesn't match the stock ticker)", "score": 10, "replies": [{"body": "CP is good anyways if you just buy shares and hold worst case what you lose no money and collect the dividend. I mean it could go down but I doubt it will.", "score": 3, "replies": []}]}, {"body": "Another thing to add. With Biden shutting down the pipeline a lot more natural gas is going to be loved via rail. CP is hiring a lot of folks right now (me included). As gas goes up, it'll hopefully help play a role in this.", "score": 10, "replies": [{"body": "Best of luck. They have a high turnover for a reason. If you can stick with the schedule the pension and stock options are worth while.", "score": 3, "replies": []}, {"body": "Id love to work for CP they are a great company from what I have heard.", "score": 1, "replies": [{"body": "It's a pretty rough gig to be honest. Very union and the schedule is pretty hard if you're gonna do the running trade thing. Maybe maintenance would be better but they are a pretty old school company.", "score": 5, "replies": [{"body": "Agreed, Carman here who works 2nd shift with Mon/Tue as my off days. Maintenance is even worse as you basically hold no seniority and are forced to travel. But........ you get payed very handsomely and after 30 years of service I’ll retire with $7500/month", "score": 8, "replies": []}]}, {"body": "All of the railroads are pretty shitty to work for. If your going into a trade- TE&Y, track, and/or car/locomotive it’s tough because you can be furloughed at any given time. If you work in management, particularly operations/track prepare to have no life at all. I’m glad I got out when I did, my friends who weren’t so lucky are currently working 12 on and 2 off. They even had to forgo a weeks pay earlier this year. The railroads don’t seem to get that yes cutting costs are great, but you have to modernize their yard and facilities (some of these facilities were built in the 1900’s) and take care of your employees.", "score": 5, "replies": []}]}, {"body": "Be ready to get furloughed during the winter.", "score": 1, "replies": []}]}, {"body": "I LIKE THE CHOO-CHOO", "score": 7, "replies": [{"body": "But which stock to choo choo choose?", "score": 4, "replies": []}]}, {"body": "Hey OP. That's some nice DD you've got there, but there's one point you hhave there that I think might be wrong:\n\n>Millennials may be afraid of 🚂 but they need trains to move 🥑🍞 and the less millennials talk about an industry the less likely they are to try to cancel it.\n\nAm millennial, fucking love trains. I'd go as far as to say that rail is actually quite popular with my generation because you can electrify the whole network, and even in the case of big, ugly diesel trains, they're still good because there's only a couple of hundred of them, doing the job of hundreds of thousands of trucks. If anything, I'd say millennials WANT rail to expand and improve so that public transport can improve, more freight can be taken off the roads, and the amount of planes in the air can be reduced.", "score": 7, "replies": [{"body": "I wish there was a nation wide fast rail service with a lot of terminals. Id rather take a train than a plane.\n\nFrom my place to atlanta its a 10.5 hour drive. A plane is fast but when you factor in luggage, screenings, travel to airport etc.. you start to hit 7-8 hours all said and done.\n\nHigh speed rail could make the trip in about 5 hours plus overhead time, so like a 6.5 trip. Plus rail travel is much more comfortable than plane travel. Stretch those legs. Maybe 7.5 with multiple stops.", "score": 3, "replies": []}]}, {"body": "How the fk are they a good recovery stock if they have already recovered", "score": 6, "replies": [{"body": "Price go up when macro economy heals", "score": 7, "replies": []}, {"body": "Railroads benefit from economic recovery.  They have recovered with the market (and more so) but economic recoveries love 🚂.  Most economic recoveries mean there is a backlog of demand for products people couldn't access before.   The backlogs are extremely visible this time so it is clear and consistent revenue stream for the foreseeable future.  Picking the right railroad stock now means figuring out who has an advantage that earns more market share.", "score": 5, "replies": [{"body": "Recovery stocks are referred to stocks that have yet to recover to pre crash prices. That's why it's called recovery play because they present a better opportunity for big gains.", "score": 4, "replies": [{"body": "Okay then I guess I should word it more along the lines of *stocks that stand to benefit from the recovery*", "score": 5, "replies": [{"body": "Ya economy precovery, did CN rev even take a hit?", "score": 0, "replies": []}]}]}, {"body": "Well, they gotta move all that shit piling up at the ports somehow....", "score": 1, "replies": []}]}, {"body": "Biden infrastructure bill coming in summer?", "score": 1, "replies": [{"body": "Recovery plays are stock price related.  It's recovery to pre crash prices. Because it present an opportunity for a big gain in a short time.\n\nA $100 pre covid stock trading at 50 is a recovery play \n\nA $100 pre covid stock trading at 150 isn't a recovery  play", "score": 0, "replies": []}]}]}, {"body": "What's the ticker", "score": 8, "replies": [{"body": "Canadian Pacific - CP\nKansas City Southern - KSU", "score": 19, "replies": [{"body": "Which one might moon? CP or KSU?", "score": 0, "replies": [{"body": "Even if it fails and Cp doesn't moon I've held it for a year and a half ish for a 50% gain not including dividends. It's a good stock I see their trains all the time so I bought some lol.", "score": 6, "replies": [{"body": "I used to think 50% gain in a year and a half is like WB level good. GME ruined me.", "score": 7, "replies": []}]}]}]}]}, {"body": "Now THIS is fucking DD", "score": 5, "replies": []}, {"body": "When god was passing out Brains I thought he said trains I told him to Give me a slow one so i can sit and watch the world go by", "score": 4, "replies": []}, {"body": "Even has boomer points 🥰", "score": 3, "replies": []}, {"body": "Thanks OP, made my own post about this, it got taken down because well, I’m a retard. I’m looking at the $230c for 3/26 and 4/1. My hesitation is that KSU hit an ATH Friday, and was up 3.67% for the week. Wondering if we are at the cliche “ sell the news” point.", "score": 3, "replies": []}, {"body": "KSU is going to gap up at open, doubt we will be anywhere under 250 by the end of the day. (Deal, if it goes, puts KSU at 275 - but that won’t go through for a year or so)\nI put in a limit order for some next month calls but I kinda doubt I’m gonna get them filled ahead of all the bots. \nI would not go market on those, nor on long stock. You might well end up overpaying.", "score": 3, "replies": []}, {"body": "I like trains just different trains.", "score": 3, "replies": []}, {"body": "What is the valuation of the deal? Above par ? \n\n\nWhy does this help CP in terms of profit.", "score": 2, "replies": [{"body": "Deal adds 23% to current share price for KSU holders right  now.  It is 90$ + about half a share of CP\n\nIt potentially helps CP on terms of profit because they would provide a unique single shot service from Canada to Mexico.  Of course they could just keep profit margins relatively similar and seek to aggressively grow revenue if they wanted to be more like the millennial stocks and drop boomer status.", "score": 1, "replies": [{"body": "> It potentially helps CP on terms of profit because they would provide a unique single shot service from Canada to Mexico.\n\nAlberta Premier (who is a douchebag) is promoting this as a way to transport Alberta oil to gulf refineries in an unobstructed manner.", "score": 1, "replies": [{"body": "Based kenny (not a douche) what a brilliant way to get around the horrible blockading of our pipelines.", "score": -1, "replies": [{"body": "Nah it’s super expensive. Pipelines are a fraction of the cost. Also ties up rail capacity. Means goods like grain doesn’t move.", "score": 4, "replies": [{"body": "Yes but its a good work around until we get our pipeline", "score": 2, "replies": [{"body": "Negative. Gov cancelled their crude by rail lease. \n\n\nhttps://www.bnnbloomberg.ca/alberta-unloads-crude-by-rail-contracts-signed-under-former-ndp-government-1.1388782", "score": 4, "replies": [{"body": "Oof", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "but.. but.. trains move side way not up", "score": 2, "replies": []}, {"body": "CP rail is kind of fucked. They take loans out to use for share buybacks to inflate the price of share. I used to own it and if it was cheaper I would consider buying it again.", "score": 2, "replies": []}, {"body": "Not if Uncle Warren has anything to do with it", "score": 2, "replies": []}, {"body": "!wsbgold", "score": 2, "replies": []}, {"body": "ChooChoo go woohoo!!!   \nSeriously though, I've always wanted to just catch a freight train to somewhere and just hobo it for a while. Obviously it super illegal and I don't recommend anyone actually does it (of course nobody here actually gives a rip what I recommend anyways), that looks like a heck of a lot of fun! Super relaxing, great scenery, and effectively free travel.", "score": 2, "replies": [{"body": "Hope you one day get to live your hobo dream!", "score": 1, "replies": []}]}, {"body": "> see self driving electric trucks  \n  \nNot in our lifetime.", "score": 4, "replies": [{"body": "Eh highway transit is the simplest thing to program and trucking is the industry that benefits most from it.  They will put guidance sensors on the roads of they need too.  10 years sounds reasonable for the start of elimating drivers but regardless of who is right trains are safe for quite a while.", "score": 3, "replies": [{"body": "Its the battery and infrastructure. Trucks can't sit 8 hours to charge a 500kWh battery every 500 miles which means exchange pack is the only option. That means industry-wide compulsive standardization of pack size, connectors, capacities and swap methods (which means limited mounting options).  \n  \nSo who is going to be liable for that $50,000 battery pack if it is found defective on exchange? The truck owner? The Service station? The Line company? Insurance? \"Hey, you know that pack you just swapped last week in just outside Oklahoma City? Well I know you're in New York but you have to either come give us a good pack or pay us $50,000 core fee. Thanks\"\n  \nWho is going to cover the $2m+ inventory of swap batteries every highway service station will have to stock?  \n  \nHow are we going to get the thousands of kWh to each station every day needed to recharge those packs? Where is that energy going to come from?  \n  \nFor OTR trucking to go full-electric will require complete cooperation between ALL vehicle companies, complete cooperation between ALL service stations, complete overhaul of the power grid and billions of dollars investment.  \n  \nNot going to happen. Diesel is going to be around for many decades more.", "score": 8, "replies": [{"body": "I agree, while it will occur overtime, anyone who think fossil fuels will go away is silly. There are simply too many reasons that makes them effective in transportation, and that is before you recognize all the manufacturing that occurs with fossil fuels being an input.", "score": 3, "replies": []}, {"body": "What about self driving Diesel trucks?", "score": 1, "replies": [{"body": "Decades away before they have the computational power and reliability to navigate freely safely without a minder in the vehicle.", "score": 1, "replies": []}]}]}]}, {"body": "Hydrogen seems more likely.", "score": 3, "replies": [{"body": "No, thats not going to happen, ever. Unless you can change physics so it takes less energy to get than can be produced from it outside of a fusion reactor.", "score": 0, "replies": []}]}]}, {"body": "Directions unclear, parked my car on the tracks.", "score": 2, "replies": []}, {"body": "Well, up to $265 in pre market", "score": 1, "replies": []}, {"body": "Solid post thank you.", "score": 1, "replies": []}, {"body": "Sebastian Bach:\n\n“YOU GUYS LIKE TRAAAINS?!”", "score": 1, "replies": []}, {"body": "I see emojii DD i buy !", "score": 1, "replies": []}, {"body": "Oh hey, both of these companies buy systems from the company I work for. That's neat.\n\nI know absolutely nothing about their business other than that they give us a lot of money, so they must be good enough at making it.", "score": 1, "replies": []}]}
{"title": "WSB / GME is changing life :)", "selftext": "Before WSB, 1 month back: Portfolio of mine was well diversified like an ETF.\n\nAfter buying  50 shares @ 46 for GME and then getting hooked to GME Frenzy, I am with 450 shares (with covered calls with are ITM and few option rollouts ) and an average buying price of 65 $. Even though they are in ITM not a single call is assigned due to high IV :).  (In between: done similar for AMC and am a bag holder of it too with an even larger number of shares) ....Holding 25K cash if it drops tomorrow after earning to buy some more shares!!! I Cant wait for 23rd march 4 PM.\n\nNot financial advice.\n\nhttps://preview.redd.it/iroj3clc7no61.png?width=758&format=png&auto=webp&s=545f0d9ba99504365cc22097ccd2ec461086b94b", "id": "maxqra", "created_utc": 1616446529.0, "score": 545, "upvote_ratio": 0.9, "num_comments": 87, "comments": [{"body": "You have covered calls that are ITM?  You lose out any upside.", "score": 85, "replies": [{"body": "I agree, but I am in my 40s... I can't afford to lose (yet want to be part of the game. Not selling my naked shares unless it hits the moon). \n\nI am having downside protection. I may not get infinite gains, but I will keep on rolling ITM options to further dates and make some gains... and will keep on adding shares on dips...or on big dips cover the short calls....", "score": 70, "replies": [{"body": "Having covered calls isn't exactly downside protection. You're gonna keep rolling them out until at one point you can't anymore and you'll be forced to cover or get assigned. You WILL get assigned on those, and unless you cover subtract your average from the strike + premiums and that's the max profit you'll get. If you have ITM calls, you should hope it tanks.\n\nHonestly if I were you I'd hope it tanks in the short term so I can cover. No use in diamond handing if you're not gonna see any of the profits.", "score": 51, "replies": [{"body": "How is it not downside protection? His cost average is effectively reduce by whatever premium he collects which absolutely reduces any losses should the trade turn against him.\n\nIn the situation you described, yes it would be ideal if it tanks below his strike, the options expire worthless, then it rally’s again back to where it was but that’s not typically how stocks work lol. If the stock price goes down, the value of your shares held goes down, so that’s a loss. Just because your calls are assigned on a CC doesn’t mean it’s bad.", "score": 17, "replies": [{"body": "My point as a whole was that it would be a good idea to cover those calls as soon as possible, preferably on a dip so that he won't get assigned. And yeah no shit if it goes down your value of shares held goes down lol, but my point is that that's far better than potentially missing out the gains of a second run up, which, is likely the whole reason why he even bought GME in the first place. Why would you bet against and essentially cap the potentially massive gains in a squeeze situation if that's the whole reason you bought it in the first place? It doesn't make any sense to me. People buy GME right now because they are looking for massive gains in a potential squeeze situation, and I don't understand the point of capping your gains. If you are willing to do that, why the hell would you even buy GME in the first place? Isn't it in his best interest to maximize his gains for a massive squeeze to not happen? At least, not until they expire which is going to keep increasing if he keeps rolling out his calls? If so, why bother with such a stupidly volatile stock that is frankly, at 200 dollars overvalued by a factor of 4 or 5, instead of a better, more sound alternative? You aren't buying GME for the fundamentals, at least not right now, you buy it hoping it will run up. Why would you bet against that? \n\nAnd yes, I suppose it could technically be called downside protection, but if you are selling CC's because you are afraid of the downside with GME, a stock that went from 350 to 172 in a matter of days, then you're probably buying the wrong stock. No amount of selling CC's is gonna protect you from the downsides with that volatile of a stock. If you're concerned buy puts as a hedge.", "score": 9, "replies": [{"body": "This post makes a lot more sense to me than your previous one. Yeah I agree it’s not the strategy I would choose, but you make the most money on CCs in stocks with high IV. Go try to sell CCs on T or something and you are wasting your time. \n\nBut yeah this is certainly not in the spirit of the GME crowd on here, I am curious what strike he sold and at what price GME was at when he sold it. His position might be basically locked if delta on the calls is near 1 in which case he might as well close both sides and just buy more shares..\n\nEdit: never mind forgot he laid out all his purchases.. yeah he’s way ITM on those", "score": 3, "replies": [{"body": "Yeah I agree apologize for not being clear in my original post. I've also rode the IV train with GME but it was with put spreads not calls and I got really, really lucky with the fill price and managed to get like 70% returns on my collateral that week.\n\nI agree, if his delta was close enough to 1, unless I'm missing something, isn't that the same as having almost no exposure to GME? In that case I don't see why there's an incentive to keep the position open\n\nAnd uhh, not sure when he opened with those calls but those 70 calls aint looking so hot.", "score": 3, "replies": [{"body": "Same. I’ve made money buying and selling debit spreads intraday just by setting a really low limit price to buy then setting a higher limit to sell. It fills just because the options jump around so sporadically.\n\nYea that’s what I’m thinking, like on his list he buys GME at $105 then sells the $105 4/9 call, I don’t understand the point of that at all", "score": 6, "replies": [{"body": "That's essentially a neutral to bearish play, but he's long on GME? And he still sort of loses money or profits very little if it goes down or up so it's not a true bear play. Very interesting. Seems like a very convoluted way to do an iron butterfly.", "score": 3, "replies": [{"body": "He's about 18 hours away from IV crush though.  Could either go very well or very badly, but premium on GME calls has been pretty fucking nice lately.  Those $800 calls are basically free money as long as there's some retard willing to buy them, and there are plenty of those retards here.", "score": 3, "replies": []}]}]}]}]}, {"body": "You could roll the CC out to prevent assignment", "score": 2, "replies": [{"body": "Yeah in theory you could but at some point you're gonna run out of dates to roll it out to and your losses are gonna add up. Perhaps if GME drops below the strike. That's why I said he should pray it tanks.", "score": 1, "replies": [{"body": "Gotcha. I didn't see the strike on the itm option.", "score": 1, "replies": []}]}]}]}]}, {"body": "Idk gme could drop below $100 pretty easily lol. Its a bad company", "score": -53, "replies": [{"body": "Oh sure but no one gives a shit about the fundamentals of GME lol. I'll bet you a bj from my wife it goes past its old highs before dropping to 100 again ;)", "score": 28, "replies": [{"body": "You better have a real wife.", "score": 6, "replies": [{"body": "Her BF lets me see her on wednesdays.\n\nProof or ban", "score": 9, "replies": [{"body": "This is what I’m here for 😂", "score": 2, "replies": []}]}]}]}, {"body": "Imagine going to WSB on a GME specific threat and commenting this. What type of crazy narcissist are you?", "score": 8, "replies": [{"body": "Theres a reason it had such high short interest, and that would be the fact that it has been a failing company for years. Who knows maybe cohen will change it but right now they aren’t doing good", "score": -9, "replies": [{"body": "Agree, but I still want to see 100k/share", "score": 2, "replies": [{"body": "Same", "score": 1, "replies": []}]}]}]}]}, {"body": "tf you talk about\n\nrolling at further expiry for the same strike for more $ or a few dollars up for the same premium, helps gets some theta gains in (even though deep ITM is less susceptible to decay, but it's still WAY better than buying back those calls for a massive loss)\n\nand if he sells everrything (stock + short calls) instead of getting assigned, he stills racks in profits (as shares gives more profit than short calls would lose)", "score": 1, "replies": []}]}, {"body": "Great personalized strategy", "score": 1, "replies": []}]}, {"body": "he wins on the Downside then?", "score": 0, "replies": [{"body": "Sort of. He wins if it tanks to below his strike but still above his average. It's like an iron condor.", "score": 10, "replies": [{"body": "he'll have less profit under his short calls strikes, but he'll keep his shares\n\nmax profit is at or above short calls at expiration  \nbut before expiration, he still have positive delta", "score": 1, "replies": []}, {"body": "i have never used an iron condon", "score": 1, "replies": []}]}]}]}, {"body": "What broker/platform is this? Looks like an excel spreadsheet", "score": 12, "replies": [{"body": "I use E*TRADE and RH. RH sucks for writing covered calls in single transaction.", "score": 9, "replies": [{"body": "Yeah I wouldn't buy underlying/write cc in a single transaction regardless. Is this an etrade screenshot? I used etrade for a while a few years ago but transferred out so havent seen the recent UI. Desktop or mobile?", "score": 1, "replies": [{"body": "It’s excel sheet after downloading past transaction in csv format for GME to think on tomorrow’s game plan.. :)", "score": 4, "replies": []}, {"body": "Looks like your last reply where you said the screenshot is an excel sheet got deleted. People used to post actual screenshots of positions for yolo posts. But... the excel sheet is interesting. Sophisticated, complex big brain moves there. It might even be good enough for automatic entry in the next wsb paper trade contest. You should ask u/opinion_is_unpopular if it qualifies. Good luck!", "score": 3, "replies": [{"body": "I'll let it slide since this would be a bitch to screenshot each position. \n\nAlso because OP posted their body just to get enough upvotes to post on WSB. I respect the hustle.", "score": 9, "replies": []}]}]}]}]}, {"body": "Love u", "score": 30, "replies": []}, {"body": "Muah", "score": 21, "replies": []}, {"body": "I'd like to update my exit strategy, first it was: \n\n33% @10,000, 66% @100,000, 1% @1,000,000. \n\nNow I've added a zero.", "score": 11, "replies": [{"body": "Even the first one is unrealistic", "score": -2, "replies": []}, {"body": "Thank you for your service, I was afraid no one was going to hold my bags", "score": -4, "replies": []}]}, {"body": "I am taking 15k in profits from previous paper handing (sorry) and buying 100 more shares if it drops to $150 in price per share.", "score": 12, "replies": [{"body": "I'd say I hope you get to fill that but...I'd be lying.", "score": 35, "replies": [{"body": "Right. The volatility is just all over the place. Don't want to hit the reset button after getting gains for the first time.", "score": 5, "replies": [{"body": "In the meantime there's $1000+ a week in covered puts you could be getting, see a dip, sell 150 put, let it expire or buy it back (or next one closer to itm of same day to avoid day trade.) Not financial advice lol", "score": 6, "replies": [{"body": "I've been selling 150p weekly. Easy money. I'd be happy to get assigned at that price", "score": 2, "replies": []}]}]}, {"body": "Bro if the price drops to 150, 100, 50 that would benefit us bc people would double their positions and the squeeze would accelerate. Let the price drop, I’m still going to buy.", "score": 1, "replies": [{"body": "I'm still going to buy too but there is a trade off, we do want to hold onto some paper hands and not have them all scared off", "score": 3, "replies": [{"body": "I agree, but I really want to average down on this and 40-50$ a share would help a ton with that. Also I’m not worried about the squeeze- gme will shine with the new direction it’s going.", "score": 1, "replies": [{"body": "Oh definitely, I'm not worried about the dips for myself, I know where it's going.", "score": 1, "replies": []}]}]}]}]}, {"body": "But your 100 shares will be the sole single reason why it doesn’t squeeze!!! In all seriousness, good for you, make some money my dude", "score": 5, "replies": []}, {"body": "Holding you to this lol", "score": 2, "replies": [{"body": "I did a foolish thing and thought it wasn't going to fall down to $150. So I bought 100 shares at $184.29. So RIP. Cost more for the same thing. Doubted myself.", "score": 1, "replies": [{"body": "It's ok buddy, it won't matter at the end", "score": 2, "replies": []}]}]}]}, {"body": "I have no idea how to read this lol.", "score": 6, "replies": []}, {"body": "Earnings is after close....", "score": 2, "replies": []}, {"body": "5pm", "score": 2, "replies": []}, {"body": "Have you ever seen the mugshots of a meth addict over years?", "score": 2, "replies": []}, {"body": "Wait there's a chance my itm covered calls won't be assigned? Please tell me I read that right", "score": 0, "replies": [{"body": "ITM will be assigned automatically. My life long strategy was and will be to roll them out for few weeks to get some more premium. Though it may not work for deep ITM due to bid ask spreads!! But I have sold options for AAPL for 40 dollar strike which I am rolling for 2/3 years!! Never got them assigned  before expiry and always rolled out to get some premium.", "score": 2, "replies": [{"body": "Ah gotcha I figured that's what you meant I just wanted to be sure.\n\nMy options strategy has been to sell puts and buying them back when they become profitable from theta decay or the share price rising. Then i either use the capital from the premium to sell it again with a higher s/p or sell the same put with a new expy. Any extra premiums I've been using to aquire shares with the goal to sell OTM covered calls on them for the premiums. If my puts get assigned I sell calls at the s/p of the puts until they get assigned. Rinse repeat.\n\nSo your saying with your strategy you write ITM calls, buy them back for a profit, then write them again with a further out expy? Is that what people mean when they say they roll out options?", "score": 3, "replies": [{"body": "This is literally the wheel strategy lol. It's nothing new. However it is riskier to do it on GME because volatility is crazy high.", "score": 3, "replies": [{"body": "Ah good I've been meaning to learn what a wheel strategy is haha. I figured I wasn't the first person to think of it but everything seems like a genius play when your only experience with options was yoloing OTM calls haha", "score": 1, "replies": [{"body": "Wheel strategy is selling cash secured puts on a stock you wouldn't mind owning. Do that until you get assigned. Then sell covered calls until assigned. Repeat forever", "score": 1, "replies": [{"body": "Word that's literally what I've been doing. Good to know ty", "score": 1, "replies": []}]}]}]}, {"body": "That’s a good strategy ... for which stocks do u do this ??\nI generally roll them in the week of expiry. I close the ITM position and sell at same or higher strike price for farther time ensuring net premium. Though it doesn’t work infinitely if stock goes up significantly. It works well for good dividend paying stocks!!", "score": 1, "replies": [{"body": "Gotcha that makes sense. For the last month or so I've been utilizing this strategy on GME. The volatility of the stock and the ridiculous theta decay makes it so I have a lot of different ways I can move throughout the week to secure a profit. There have been days when I have sold a put on a dip, bought it back 20 minutes later for a 45+% return on the option, then sold it again an hour later when it dips again for the same premium I initially sold it for. Now that has calmed down more o simply write puts at more conservative strike prices and let theta decay kick in. Theta on most weeklies starts out around -2 to -4 and I've seen it go to as much as -25 by Thursdays.", "score": 3, "replies": []}, {"body": "I've noticed my strategy does not work on less volatile stocks and have been wanting to set my portfolio up for sustained reliable growth so thank you for sharing", "score": 1, "replies": []}]}]}]}]}, {"body": "Wonder if you’ll hold when the price gets back down to 65$", "score": -12, "replies": [{"body": ">... looking at momentum , sentiment, and DD I think GME has potential...\n\nYES, wil double down.", "score": 16, "replies": []}]}, {"body": "Changing life for the worse.", "score": -14, "replies": [{"body": "trust me it's changing for good if you play it right my friend... looking at momentum , sentiment, and DD I think GME has potential...", "score": 11, "replies": []}]}, {"body": "What do you mean by “not a single call is assigned due to high IV”? Thanks", "score": 1, "replies": [{"body": "I mean u r always at a risk of assignment before expiry when u have ITM calls (sold), but in this case, deep ITM calls also have so much of time value (due to IV) that no one is really exercising them. I wish I get early assignment of them so that I can sell more covered calls!", "score": -2, "replies": [{"body": "I can't tell what's going on here because of boomer spreadsheet but what is your total exposure here are you net short or long? I assume these are rolls and not open positions? \n\nTime decay is faster for high IV so I'm not sure what you mean about them having so much time value due to high IV? do you mean extrinsic value?", "score": 1, "replies": [{"body": "I think he means he doesn't have to worry about assignment because the options were so expensive due to the IV, so the extrinsic value is bloated and no one would exercise?\n\nOnly meaning I could parse that makes sense", "score": 1, "replies": [{"body": "Not sure what cost has to do with assignment in this guys mind, it really shows that you can wheel without really understanding options that well.", "score": 1, "replies": []}]}]}]}]}, {"body": "What is your price target?", "score": 1, "replies": [{"body": "To the moon I guess... I am churning effective 14/16% gains (annualized) but that doesn’t even change my tax bracket.... I m holding AMC / GME to the moon or grave !!", "score": 6, "replies": []}]}, {"body": "I bought at $290 so it can never go above that now.  Sorry.", "score": 1, "replies": []}, {"body": "Like jekyll and hyde", "score": 1, "replies": []}, {"body": "I thought about this and one of the reason why I sort of regret selling shares. I am imagining DFV selling 1000 of OTM CC. Even if he did like 265 3/26 years xpiration today he would make a million. Per week", "score": 1, "replies": []}, {"body": "Ah, I remember when I lost faith in diversity and decided to go all GME", "score": 1, "replies": []}]}
{"title": "The Chinese Amazon $JD", "selftext": "\nYou’d be forgiven for having never heard of JD.com outside of Asia. JD is an online e-commerce company that is largest direct retailer in China.\n\nWhy am I bullish?\n\nWell. Let’s do some comparisons against the boomer bae that is Amazon:\n\nAmazon market cap: $1.52T\n\nAmazon revenue 2020: $386bn\n\nAmazon net profit: $21.33bn\n\nJD market cap $130bn\n\nJD revenue 2020: $114bn\n\nJD net profit:$7.59bn\n\nSo, in comparison JD is valued x12 less than Amazon but is already generating 1/3 of the revenue and net profits in an online market that is set to expand rapidly over the next decade as more of China gains internet usage. \n\nInternet usage stats by population:\nChina: 63%\nUSA: 96%\n\nAbsolute no brainer.\n\nPositions: 78 shares @ $85.31\n\nI know Arkk is becoming a bit of a meme at this point but they also have 1.9 million shares worth approx $164m all purchased in the last 3/4 months.", "id": "mb0co0", "created_utc": 1616453923.0, "score": 3, "upvote_ratio": 0.51, "num_comments": 83, "comments": [{"body": "(Chinese father) Series B? Why no Series A?", "score": 24, "replies": []}, {"body": "But there are 3 Chinese Amazons now. Alibaba, Puduoduo, and JD. Also their market already has higher e-commerce penetration so less room form growth. Alibaba value play with $50bil in cash. Government hates them tho and will breakup anyone of them before they hit the value of Amazon.", "score": 25, "replies": [{"body": "Do they have an AWS, twitch, media, music etc? E-com is only a portion of Amazon's value", "score": 8, "replies": [{"body": "Yes, they have all been more or less involved in buying up all sort of businesses in health care, finance, payment, cloud, logistic, food and grocery delivery and have grown into a monstrous nature. The anti- trust campaign now is trying to reign them in so none of them will abuse the market with their ubiquitous presence.", "score": 5, "replies": []}]}]}, {"body": "But what you don’t understand is that the CCP can pull the plug on any company in a split second", "score": 57, "replies": [{"body": "Also these numbers could be easily inflated. Numbers out of China should be taken with a grain of salt.", "score": 42, "replies": [{"body": "Perhaps, although they are independently audited by Deloitte who I fundamentally trust as an audit standard", "score": -12, "replies": [{"body": " 'who I fundamentally trust as an audit standard'\n\nWho do you think pays the auditors?  Yet they call themselves independent.  It's all smoke and mirrors.", "score": 15, "replies": []}, {"body": "Deloitte China though. I’ve worked at a Big4 accounting firm and they’re all technically separate entities by country/region so the risk is limited to that area. Just proceed with caution", "score": 14, "replies": []}]}]}, {"body": "this. I stay away from Chinese companies.", "score": 4, "replies": []}, {"body": "Would it pull the plug on a company competing with an American one and bringing in billions in revenue and Chinese jobs? Be realistic this country is trying to surpass America it is relying on companies like JD.", "score": 12, "replies": [{"body": "If it becomes too powerful. Absolutely. They’re all about govt power. As soon as it’s threatened (I.e. ant) they pull the trigger", "score": 7, "replies": [{"body": "Maybe they see the devastating consequence of how one government become the servant of big corp as in America if one put the interest of commerce before the well being of it's own country and it's people. Governments have the duty and responsibilities to create a competitive and healthy environment for businesses of different sizes to thrive which is of the interest of the people and society.", "score": 0, "replies": [{"body": "Yes, it's all very noble in nature.", "score": 1, "replies": []}]}]}]}, {"body": "This.", "score": 2, "replies": []}]}, {"body": "Fuck China.", "score": 78, "replies": [{"body": "Here here, fuck China.", "score": 42, "replies": [{"body": "Fuck China chain", "score": 7, "replies": [{"body": "“Chinese, Japanese, dirty knees, look at these” - Peter Griffin.", "score": 2, "replies": [{"body": "“China ain’t shit”\n- Bill Cosby", "score": 3, "replies": [{"body": "When reading your reaction, depth of thought and ability to explain your reasoning when discussing a Chinese company, I can only wonder if you guys are old enough to be trading. \n\nPlease note, that  no one here is benefiting from your display of brilliance (or lack of)  nor you discursive exuberance.", "score": 1, "replies": []}]}, {"body": "When reading your reaction, depth of thought and ability to explain your reasoning when discussing a Chinese company, I can only wonder if you guys are old enough to be trading. \n\nPlease note, that  no one here is benefiting from your display of brilliance (or lack of)  nor you discursive exuberance.", "score": 0, "replies": [{"body": "Lol k retard", "score": 1, "replies": [{"body": "The Hypothesis has been confirmed.", "score": 0, "replies": []}]}]}]}, {"body": "When reading your reaction, depth of thought and ability to explain your reasoning when discussing a Chinese company, I can only wonder if you guys are old enough to be trading. \n\nPlease note, that  no one here is benefiting from your display of brilliance (or lack of)  nor you discursive exuberance.", "score": 1, "replies": []}]}]}, {"body": "I read Chinese stock and I'm out. No trust to give", "score": 4, "replies": [{"body": "When reading your reaction, depth of thought and ability to explain your reasoning when discussing a Chinese company, I can only wonder if you guys are old enough to be trading. \n\nPlease note, that  no one here is benefiting from your display of brilliance (or lack of)  nor you discursive exuberance.", "score": -2, "replies": []}]}, {"body": "When reading your reaction, depth of thought and ability to explain your reasoning when discussing a Chinese company, I can only wonder if you guys are old enough to be trading. \n\nPlease note, that here no one's benefiting from your display of brilliance (or lack of)  nor you discursive exuberance.", "score": 0, "replies": [{"body": "How many times you gonna post this bot? \n\nAlso, while we’re talking about people’s “ability to trade”, I find your post history of “when do I sell” quite hilarious lmao", "score": 2, "replies": [{"body": "When did I present myself as an experienced trader?\nYou are right, when it comes to trading, all that I have to post is questions? \n\nI wish that I could ask you questions too. Unfortunately, it is impossible if all that you can articulate is 'f**k China '...", "score": -1, "replies": []}]}, {"body": "Fuck off China. This is the internet.", "score": 1, "replies": [{"body": "ExeJDT,      your shollow comment proves my case.", "score": 1, "replies": []}]}]}]}, {"body": "Chinese stocks? Aw hell no. \n\nAin't touching that.", "score": 32, "replies": []}, {"body": "When are you fucknuts gonna learn to stay away from ANY AND EVERY Chinese stock? Do you want to get fucked??", "score": 14, "replies": [{"body": "I guess that’s why they just got down graded by market consensus and another said to avoid it altogether", "score": 3, "replies": []}]}, {"body": "Fuck China. They're Gov't screws growth. Look at Jack Ma. China is a red herring that pretends to dance on the world stage but they've got concentration camps, shit working conditions, and an oppressive Gov't.\n\nI wouldn't invest in a Chinese stock if someone paid me. Rather invest in boomer div stocks.", "score": 26, "replies": [{"body": "Isn't Jack Ma is crazy though.", "score": 0, "replies": [{"body": "Some say the same about Elon Musk", "score": 11, "replies": []}]}, {"body": "When reading your reaction, depth of thought and ability to explain your reasoning when discussing a Chinese company, I can only wonder if you guys are old enough to be trading. \n\nPlease note, that  no one here is benefiting from your display of brilliance (or lack of)  nor you discursive exuberance.", "score": 0, "replies": [{"body": "Apologizes for not spending the requisite time required to pontificate in a manner suitable to your desired taste, but I write what I write in the manner I write it because last I checked I am not financially compensated for anything I produce here. It's free advice and any person who stumbles across my post can choose to do what they want. About 25 people seem to like it.  You did not, and decided to engage me with some snarky remark so here's my response:\n\nFrom my vantage point it seems that you have not actually provided any criticism for what I said just the manner in which I said it. But like I said, I would avoid Chinese companies because of their heavy handed government, appalling work conditions, and concentration camps. These are not the staples of a free society, and even of a society we should consider our equal or approaching the US with regard to economic fire power. The fact that we're so entwined with them economically is a concern, but we have done more to raise their standing on the world stage then vice versa. Regarding their ability to grow beyond their current position is one I have serious doubts because of the aforementioned issues. I think they are a bubble, a gigantic bubble, and it'll pop. So again, fuck China.\n\nWith that said how about you hop off your high horse and swivel your head to readjust your consciousness to the /r/wallstreetbets surrounding you find yourself in. If you need a conversation or insight that stimulates your prefrontal cortex I suggest wandering to your local university and engaging in debate regarding economic stability through a more agrarian society achieved via microloans. \n\nHere, in WSB, look at a few meme and support the local retard. Other than that fuck off douche.", "score": 5, "replies": [{"body": "Holy shit you killed him", "score": 2, "replies": []}, {"body": "I accept your apology Dasky34,\nThanks so much for sharing with me your reasoning. It helps me to understand the larger picture.", "score": 2, "replies": []}, {"body": "Slow calculated murder by way of word 😂🤣😂⚰", "score": 2, "replies": []}]}]}]}, {"body": "I have JD, but I don’t like that they create a new stock for each subsidiary instead of keeping it under the JD ticker.  Seems they water down the value to me", "score": 6, "replies": []}, {"body": "Ali baba is the real Chinese amazon \nJD is secondary", "score": 7, "replies": [{"body": "Baba for me isn’t as good value, 6x higher market cap but fairly similar revenue for 2020 as JD although admittedly net is far better in Baba currently", "score": 3, "replies": []}]}, {"body": "You misspelled BABA", "score": 5, "replies": []}, {"body": "China? You mean false income reports and fraud? They can't even think for themselves and copy legit everything. No thanks.", "score": 10, "replies": []}, {"body": "Can't trust China.", "score": 5, "replies": []}, {"body": "This is good stuff. I’m in BABA but JD is a good bet at current price for easy tendies.", "score": 3, "replies": []}, {"body": "I have heard of this company and am very interested. Will by shares after I TP some other ventures.", "score": 2, "replies": []}, {"body": "Alibaba is much closer to Chinese Amazon with their cloud business, plus the valuation is looking real nice right now with Jack Ma and Co being in the news for pissing off President Winnie the Pooh (seriously, if you haven’t already, go look up pictures of Xi side by side with Winnie the Pooh). JD is interesting, but Alibaba is a much better play, and once Ant Financial goes public, that will be a tailwind for BABA because they own 1/3 of Ant.", "score": 2, "replies": []}, {"body": "Jack Ma wants to talk to you after his golf retreat.", "score": 2, "replies": []}, {"body": "Chinese amazon is ali baba, even I know that and I'm retarded.", "score": 2, "replies": []}, {"body": "I think I'ma pass on more Chinese stocks. :/ Can't trust the Chinese govt not to play favourites and fuck over a random company, so it's best not to have your fingers in too many pies here.", "score": 2, "replies": []}, {"body": "BABA for me.  In @ 160.", "score": 4, "replies": []}, {"body": "I'm from Turkish origin, but living in the Netherlands. China beats Uygur Turks build a lot of camps where they torture people. I meet a refugee in Netherland he told me a lot about it. I dont wanna talk about it but they have iron chairs in these camps where you sit naked and get tortured. His parents both where died in these camps. They rib your nails give the chair electricity and if you are unlucky your dad is watching you or you are watching your dad. Totally naked getting tortured when you parents watch you. Womens get raped when there husband is watching.   I went to China years ago and visit this region got arrested close to a camp. They made waypoints everywhere you see police officers or undercover agents following you on the street. When you wanna talk with someone these undercover agents come out of knowhere to listen what you are talking. In ranking they are lower then animals. We all know how they beat animals to death. Torturing animals or burn alive is very normal for them. Barbaric people. How can you burn a dog alive when it's screaming. God is watching. Fuck China and there companies. And fuck everyone who is supporting China. They have no morals. God punished us all for the brutal cruel of these Chinese people. They are full of sins. US companies needs to stop working with China. Today China is silent they are still in power gaining mode. Tomorrow they will open there mouth and beat the shit out of all nations if nobody is stopping them. China will show his real face to the world one day and humanity will cry why they didn't stopped china in the past.", "score": 2, "replies": [{"body": "Bla bla bla Bla bla bla Bla bla bla Bla bla bla ... this is such a ridiculous comment.", "score": 5, "replies": []}]}, {"body": "Not a fan of the Chinese government", "score": 3, "replies": []}, {"body": "Hmmm you’ve got me interested", "score": 2, "replies": []}, {"body": "Remember when Jack Ma got too big and backtalked lord Xi?\n\nHes now an air conditioner repair man. \n\nTrue story*\n\n*based on fictional story*", "score": 2, "replies": []}, {"body": "Lived in China for more than a decade... you cannot trust any Chinese company’s financials. At all. Ever. It doesn’t matter who checks their books as is well documented. JinDong while good, is for the most part overpriced versus Taobao (Alibaba) and I can’t remember wife or I ordering from JD ever. \n\nAlso CCP is moving in and taking over companies with shadow CEOs. Be aware the CCP can take over any company operating in China, at any moment without reason officially or unofficially.", "score": 2, "replies": []}, {"body": "SHORT", "score": 0, "replies": []}, {"body": "I always lose money on this goddamn thing.", "score": 1, "replies": [{"body": "Same here. \n\nI lost 20k, on $95 03/19/21 calls I bought in 11/20. Even though when I bought the calls JD was at $88 and had two quarterly earnings to come and both the times they \"beat\" the estimates to go down by 10-15%. \n\nSeriously Fuck this Shit!", "score": 2, "replies": [{"body": "I am sorry that you loosed. \nHowever, You need to put the blame where it belongs. Notice how emotional and irrational people get here by the mare mention of a country's name. People's collective minds in the US have been poison. \nWhat is surprising to me, is that for investors here, it seems like fundamentals don't matter. If you want proof, compare the value of $BABA to any other company in the sector.", "score": 2, "replies": [{"body": "Nobody mentioned anything along those lines.  There are other stocks/options I won’t touch.  Like Tesla.  Or GME.  RIOT on the buying side.\n\nQuit race-bating.", "score": 5, "replies": []}]}]}]}, {"body": "They are Chinese fool", "score": 1, "replies": []}, {"body": ".", "score": 1, "replies": []}, {"body": "Jump on RLX too since it got beat down today ready for reverse", "score": 0, "replies": []}, {"body": "Bro, go read up on Amazon's BM and profit model. While retail is the majority when it comes to revenue, the profits from retail only account for a relatively small portion. I know we are all apes and don't know how to read, but you're THE fucking moron king of all apes.", "score": -1, "replies": []}, {"body": "Isn't US discretionary spending level a lot higher than China?", "score": 1, "replies": []}, {"body": "Im very careful with emerging markets because fiscal earnings reports have not always been 100% valid.", "score": 1, "replies": []}, {"body": "Not investing in China stocks. Doesn't matter what the story is. Not a free market.", "score": 1, "replies": []}, {"body": "I shocked to read what your are accusation for I am doing the opposite. Obviously you didn't read all hateful, stupid comments on this tread.", "score": 1, "replies": [{"body": "Ok China man", "score": 1, "replies": []}]}]}
