{"title": "General consensus on spy tomorrow?", "selftext": "I was thinking of buying some puts for spy, I’ve pulled my invested shares just incase the bear market continues. There’s very slight upward movement AH is this indicative of tomorrow what so ever?\n\nApologies if this is a stupid question I’m relatively new to investing.", "id": "wv7qpw", "created_utc": 1661208529.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 35, "comments": [{"body": "\"Thinking about buying puts\" \"New to Investing\" \nCareful", "score": 25, "replies": []}, {"body": "If you buy puts it's gonna rebound, if you don't it's gonna crash.", "score": 23, "replies": []}, {"body": "It will go from left to right", "score": 17, "replies": []}, {"body": "The only true answer is that no one knows.\n\nThe only thing we can know for almost absolute certain is that the market will open at 0930 Eastern time for general trading, and even that's not guaranteed.\n\nI've seen after hours markets go up and open in the red, i've seen them WAY down and open green.\n\nYour guess is as good as anyone else's, if anyone could predict, they would be the richest person it the world very quickly.", "score": 11, "replies": [{"body": "Brooo literally nobody asked you to say \"idk\" we get it boomers don't like trying to guess direction.", "score": -10, "replies": [{"body": "I don't like to guess anything when it comes to investing.  \nIf I wanted to bet on the opening direction of the stock market I'd just go to Vegas and play that higher or lower card game.", "score": 1, "replies": [{"body": "But ultimately you are betting and predicting that it will ultimately go up since you are investing and hoping to earn a profit", "score": 0, "replies": [{"body": "Of course. \n\nBut I don't bet on if the market will open red or black. I bet that a company I trust will continue to grow, that the USA will continue to grow. What happens tomorrow doesn't matter because my bets are over the next decade.", "score": 5, "replies": [{"body": "But you're still guessing the future direction lol", "score": -2, "replies": []}]}]}, {"body": "Cool then keep buying voo and spy and keep your opinions to yourself", "score": -5, "replies": [{"body": "This is a forum to ask for people's opinions. If you don't want one, prob best to stop posting stuff.\n\nIronically, it was you who directed your opinion to me.", "score": 2, "replies": [{"body": "If you shared an opinion relevant to the topic at hand I wouldn't have said anything. You might as well talked about your favorite ice cream flavor cause then someone would've at least learned something.", "score": -1, "replies": []}, {"body": "Your opinion was that you had no opinion. Adds nothing", "score": 0, "replies": [{"body": "And yours does what?", "score": 1, "replies": []}]}]}]}, {"body": "Log Out then", "score": -6, "replies": []}]}, {"body": "He didn't say he didn't know. He said no one knows. Stop embarrassing yourself.", "score": 1, "replies": []}]}]}, {"body": "I bought calls for Friday so it’ll probably tank", "score": 4, "replies": []}, {"body": "After Hours right now show that it is up.\n\n&#x200B;\n\nIt might be a green day tomorrow but ultimately the sellers will overpower the buyers.\n\n&#x200B;\n\nYou could also have Inverse ETFS as an option to short SPX, QQQ, and DIA.\n\nHere are the tickers if you're interested: SPXU, SQQQ, SDOW", "score": 6, "replies": []}, {"body": "Suggest you get up early before opening to get a better idea. Asia market or some after closing corp news tonight often sheds some hint.", "score": 2, "replies": []}, {"body": "Turnaround Tuesday relief bounce", "score": 1, "replies": []}, {"body": "There is no such thing as a general consensus on which way the stock market is moving tomorrow!  Come on.  If there were, we'd all be rich.\n\nIf you're new to investing, stop playing with options.  I don't know why this has become such a common thing.  You have no clue what you're doing, so why are you trying to amplify the consequences of every decision?", "score": 2, "replies": [{"body": "Of course there is, and it wouldn't make us rich. If there's a consensus, it's priced in. You'd need the out of nowhere, predicted by almost no one move to become rich.", "score": 1, "replies": [{"body": "The direction of stocks tomorrow ***can't*** already be priced in.", "score": 1, "replies": []}]}]}, {"body": "Straddles are the only way", "score": 1, "replies": []}, {"body": "Do you have a girlfriend? Can you predict what she’s going to do tomorrow? \nThe market has had a big run since June 25th. \nThe wave has run its course... wait for another wave (it could be up or down)... September is a bad month for SPY (based on last 10 years). \nI only trade options... but I have been trading for 40 years, so my advice to you is don’t trade options until get a mentor to teach you. And don’t trade with real money until you’ve made 1,000 paper trades.", "score": 1, "replies": []}, {"body": "Red probably. \n\nBuy far out in expiration puts. \n\nGot some for ZM,RBLX,ARKK,ROKU,CVNA\n\nSelling OTM calls against a bunch too", "score": 0, "replies": []}, {"body": "Don’t do it !!!", "score": 1, "replies": []}, {"body": "380", "score": 1, "replies": []}, {"body": "350", "score": 1, "replies": []}, {"body": "Well if you think that 32 reddit comments can predict the stock market tomorrow... seems solid", "score": 1, "replies": []}, {"body": "I don't think it will be as red as people think, but probably the overall trend will be down.", "score": 1, "replies": []}, {"body": "Options trading only takes place during normal trading hours. So even if you found some secret formula for predicting which puts will be more valuable, it wouldn't matter, because you couldn't do anything until the market officially opens tomorrow, and by then the move will have already happened.", "score": 1, "replies": []}]}
{"title": "Ukraine nuclear reactor = black swan event?", "selftext": "/Tinfoil time\n\nThe more i read about the nuclear plant, the more it feels that something is going to happen at \"zaporizhzhia nuclear plant\" in Ukraine. \n\nOn top of that were in a massive irrational bear market relief rally past month and everyone knows crash is due, but what will cause the crash? \n\nCant help, but to get a feeling this meltdown in reactor will be the black swan event, which causes massive overdue crash.\n\n[This is black swan in case people dont know!](https://preview.redd.it/gog11pi9bbj91.jpg?width=474&format=pjpg&auto=webp&s=36e37b0749c55a1490970deef915fe2cc0606aac)\n\n&#x200B;\n\n[Markets worldwide go Boom!](https://preview.redd.it/k48swxujbbj91.jpg?width=474&format=pjpg&auto=webp&s=fb19b3f16ca4c5b09a943a4d3a0b36cd5b13f393)\n\n/Tinfoil time off", "id": "wv23wb", "created_utc": 1661194966.0, "score": 12, "upvote_ratio": 0.72, "num_comments": 36, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|18|**First Seen In WSB**|4 months ago\n**Total Comments**|453|**Previous DD**|\n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wv23wb)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wv23wb)", "score": 1, "replies": []}, {"body": "All Soviet Union nuclear plants were build with nuclear war protection and walls can handle mass aircraft bombing.\nSource: Wikipedia", "score": 18, "replies": [{"body": "Also nuclear can fuck up the land everywhere around the catastrophe. Russia would fuck themself.  \nIt's probably hard to understand for americans since they only bombed across the globe ![img](emote|t5_2th52|4271)  \nBut would you think america would launch a nuclear strike on canada ? With a chance to poison their own people? surely not", "score": 4, "replies": [{"body": "I wonder if the state of Nevada has anything to say about this comment", "score": 1, "replies": []}]}, {"body": "In this case it would be irrelevant, as the most likely scenario would be dirty bomb from within the power plant.", "score": 2, "replies": [{"body": "using spent nuclear fuel to build a dirty bomb would be pretty much the least efficient way to do that, most of the isotopes produced have long enough halflives to not be well-suited for it. if what you mean is a nuclear meltdown, that goes against both parties' goals because control over electrical production is way more valuable. plus unlike Chernobyl, Zaporizhzhiya has an actual containment building and a less explodey design. be cautious about narratives that catastrophise about that plant, they're strategic propaganda.", "score": 2, "replies": [{"body": "That would be true if putin didn't know the orcs are going to lose the ground they took. Wouldn't be surprised for him to pull scorched earth and blame ukrainian bombs or somenother bullshit.", "score": 0, "replies": []}]}]}, {"body": "Is that a page written by the Russian disinformation department.", "score": 0, "replies": [{"body": "Никак нет", "score": 1, "replies": []}]}]}, {"body": "Listen, we have a fucking Black Swan event here once a week.", "score": 5, "replies": []}, {"body": "Red Herring, you're really bad at fishy birdie", "score": 3, "replies": []}, {"body": "I think its more of a radioactive, glowing, green swan event.  These are even more rare than black swans.", "score": 2, "replies": []}, {"body": "Yep... they will make a bbq to celebrate the beginig of Autome", "score": 2, "replies": []}, {"body": "[Allegedly some transistors where hit due to Russian shelling](https://twitter.com/financialjuice/status/1561777399351726080)", "score": 0, "replies": [{"body": "[removed]", "score": -6, "replies": [{"body": "Orc sympathizer?\n\nDisgusting boy", "score": 0, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "You don't have to give in to blatant racist/xenophobic comments (orcs) if you can already use your brains. It is obviously a lie just like the ghost of kiev, the snake island heroes or the alleged bucha massacre.", "score": -1, "replies": [{"body": "This is where people like Hitler and Pol Pot come from.\n\nThe vast overwhelming majority of people are drooling from the mouth morons that will believe and follow anything the media tells them to believe and will eagerly attack anyone who thinks for themselves.\n\nPeople who can't point out Ukraine on the map will argue with you if your opinion or thoughts are different than what the media told them to think.", "score": 0, "replies": []}]}]}]}, {"body": "It's the Russians, stupid, that repeatedly said the Ukrainians shelled their own towns. And my friend: the Russians were dumb enough to dig trenches around Tchernobyl... so forgive me but before you call it a Ukrainian lie, better prepare some proof. So far I consider Nato, all Western countries and Ukraine to be more truthful regarding that topic.\nAnd let me give you some travel hint: going to Russia is cheap at the moment 😉", "score": -1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I'm from Germany my friend. We have very reliable media. You know why? We learned from the Nazi regime - they started by discrediting the media. To then make people believe in the bullshit they were telling.\n\nGo and hear what Russian media tells you. They were honest all the time 😅", "score": 0, "replies": []}, {"body": "Or even better: why don't you go to Moscow and get yourself some reliable information out of the free, uncensored Internet? Oh... wait... 🤭", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "German media doesn't say the shelling took place. As they cannot validate it, they say \"both sides claim the other side shelled the plant. This cannot be validated independently\". Which is... true.\n\nBut hey, you can do what you want. If you say independent media cannot report as credible as you can think (=make things up in your head) - feel free. I'm sure you will definitely avoid a lot of cognitive dissonance by going through life like that 😅\n\nRegarding the nuclear plant: time will show what really happened... and in most of the times it turned out, Russia lied (MH17, poisoning of Skripal, troops on Ukraine boarder that \"were just there for training\", atrocities in Bucha, \"un-identifiable\" soldiers on the Crimean 2014, sinking of the Kursk, poisoning of Nawalny,...)", "score": 0, "replies": []}]}]}]}, {"body": "life in Russia is cheap", "score": 1, "replies": []}]}]}]}, {"body": "Honestly almost looks like a massive head and shoulders forming in SPY right now. If we get some losses back in the next few days the right shoulder will be complete.", "score": 1, "replies": [{"body": "Then all the stars align and the coming of planet x and nibiru will signal spy's rally to 4k eow right?", "score": 2, "replies": [{"body": "Maybe, or we drill towards the center of the earth for the next 1-2 months before the next bull trap.", "score": 1, "replies": []}]}]}, {"body": "It's just a nothing burger. Your better off jerking it to fantasies of china invading Taiwan if you need your daily dose of black swan events.", "score": 1, "replies": []}, {"body": "Russia will try to shut it down to further squeeze energy shortage in EU. Reactors are least safe during startup and shutdown", "score": 1, "replies": []}, {"body": "if the ruskies bomb it intentionally and that shit spreads to NATO countries and it kills their citizens. Article 5. Boom!", "score": 1, "replies": []}, {"body": "Bit late but it is more likely a white swan event bc the vulnerability of nuclear plants is a open secret?", "score": 1, "replies": [{"body": "At this point yes, but was different 2 months ago.", "score": 1, "replies": []}]}, {"body": "Not really, every plant has its Haccp-Concepts where such events are played through (: (Doesn't mean that sth like a strike wouldn't be devasting)", "score": 1, "replies": []}]}
{"title": "Baby baby baayyy ba ooooohhhhh", "selftext": "[deleted]", "id": "wv24fw", "created_utc": 1661195005.0, "score": 30, "upvote_ratio": 0.71, "num_comments": 31, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|37|**First Seen In WSB**|1 year ago\n**Total Comments**|538|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wv24fw)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wv24fw)", "score": 1, "replies": []}, {"body": "The fuck am I looking at. Sincerely a fellow regarded diamond hand", "score": 30, "replies": []}, {"body": "![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4641)![gif](emote|free_emotes_pack|facepalm)", "score": 11, "replies": []}, {"body": "Shapes and colors, Picasso", "score": 9, "replies": [{"body": "Actually it’s everlong, the colour and the shape", "score": 1, "replies": []}]}, {"body": "                  Rrrrrreeeeeeee \n\nSHILLZ KILLLLLZ ![gif](emote|free_emotes_pack|table_flip)", "score": 3, "replies": []}, {"body": "He did the math, I'm in", "score": 5, "replies": []}, {"body": "I can’t understand the post or any response op makes.", "score": 3, "replies": []}, {"body": "HEY, WHO LET THIS KINDERGARTEN KID DRAW ON MY CHART?", "score": 2, "replies": [{"body": "The u/names r so god damn telling! \n\nUse a better name generator or grow a brain, balls in ur court", "score": -2, "replies": []}]}, {"body": "Baggies baggies baggies ooooooo", "score": 4, "replies": [{"body": "Ur gonna eat those words just as ur ass eats fat pork salami an leaves pancakes behind after u get up from a seat\n\n![img](emote|t5_2th52|4263)gaping asshole", "score": 3, "replies": [{"body": "Alright bud lol. Did you change your app to show negatives in green so you don't feel as bad about being stupid?", "score": 2, "replies": [{"body": "Does the salt from the cured meat burn when it drags against ur flesh or r u use to it already?", "score": 2, "replies": [{"body": "Have fun drawing lines on your fancy little graph thinking youre stockstradamus.", "score": 5, "replies": [{"body": "Usually let the indicators do the drawing for me kinda like how u let th salami take care of ur organism 🤣\n\nAll in all this was fun. Thanks for participating", "score": 2, "replies": [{"body": "My organism? You really are dumb.", "score": 3, "replies": []}]}]}, {"body": "Idk where the insult is about eating salami? Shits pretty good. Better than that Ramen and canned corn diet you're about to be on.", "score": 3, "replies": [{"body": "That was definitely not an insult an im soooo sorry if u took it as one, either way we both can see when we’re shitting out salamis or corn.", "score": 2, "replies": [{"body": "I'll be back at the end of the week.", "score": 2, "replies": [{"body": "No doubt! Looking forward to it 👋", "score": 3, "replies": [{"body": "Sell yet?", "score": 1, "replies": []}, {"body": "You doin alright?", "score": 1, "replies": [{"body": "Yea I’m chillin, yesterday was good for short term gains. Waiting on settin up the next position on the baby. Lookin like an expanding flat for next week \n\nAppreciate ur concern, hyd?", "score": 1, "replies": [{"body": "Fine, cash gang. At least tell me you have shares and not options?", "score": 1, "replies": [{"body": "Both, shares get held an options roll in an out of w the once in a blue exercise if it’s tasty enough\n\nNot my only position tho", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "It must be back to school-time.  I see new TA charts with the new crayons everyone bought.", "score": 1, "replies": []}, {"body": "Ohhh....pretty lines. I like!", "score": 1, "replies": []}]}
