{"title": "[deleted by user]", "selftext": "[removed]", "id": "wpiimi", "created_utc": 1660617524.0, "score": 26, "upvote_ratio": 0.81, "num_comments": 29, "comments": [{"body": "Profits are profits. I've lost so much money not selling.", "score": 55, "replies": []}, {"body": "Imo the whole \"timing the market\" meme is overused. All traders/investors are placing bets on the future.  This applies to all timeframes, asset classes, and strategies. Every day/week/month that you hold a position, you are implicily saying 'now is a good time to buy,' or 'now is not a good time to sell.'  There's no way around that.\n\nAll stock investments are speculative. You only profit if the future plays out in a way that's consistent with your expectations.", "score": 47, "replies": []}, {"body": "Since amazon pays no dividend, reducing the size of the position by selling some and taking some profit is a good idea, especially if you believe that it will go down in the shorter term, locking in some of your gains. \n\nIt differs from trying to time the market in the sense that your not absolutely certain its the top or bottom, its not what you're looking for. You simply think the current gains in one of your positions are good enough to cash some out. That is separate from how you feel about the direction of the market.", "score": 30, "replies": [{"body": "What if you sell and it doesnt go down?", "score": 0, "replies": []}, {"body": "I think it also depends on what you do with the proceeds when you sell. \n\nIf you keep it in cash, it could be argued that you’re timing the market. If you use it to buy another stock, it really depends on your reasoning - are you more confident in another company, or are you rotating to a lower risk stock due to your macro views?", "score": 1, "replies": []}]}, {"body": "Taking profits is just rebalancing. If you own the sp500 then you are doing it every time.", "score": 10, "replies": [{"body": "For me this is the right answer. Set a percentage for every stock in your portfolio then rebalance when the percents get out of whack. This way you’re always buying low and selling high.", "score": 1, "replies": [{"body": "Ah, the good old \"cut the flowers to water the weeds\".", "score": 10, "replies": []}]}]}, {"body": "My rule is. I sell if I need cash to buy something new. Then, I look at each company in my portfolio and it's fundamentals and sell the worst.", "score": 7, "replies": []}, {"body": "I sold Amazon today up 27% the last couple months. That’s an amazing ROI even with the capital gains tax and I’m expecting more market volatility the next few years. Quitting while you’re ahead is not the same thing as quitting.", "score": 5, "replies": []}, {"body": "40% in that short a time period is a win, nothing wrong with taking profits. For some stocks that can take years to get a 40% profit. Anyone saying that “you’re timing the market” can go chase ATHs.", "score": 6, "replies": []}, {"body": "You can always take profits then simultaneously sell a losing position you no longer want to be in (if you have any) to offset taxes a little bit. I always have a healthy position of $VTI, so I will always funnel my losing funds / profits into that.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Don't forget wash sale rules if you get FOMO down the line if it pops though! \n\nYou'll find something that works for you. This is what I've been doing for a few years and it works for me.\nGood luck!", "score": 1, "replies": []}]}]}, {"body": "Taking profits eliminates risk. It's not the same as taking on risk", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There are something like 45,000 different things that you can put your money into using your computer. You're missing out on all but one of those no matter what you do.\n\nThe chances of making money will still be there in the future. You don't have to take the risk now if you don't understand what the risk really is.", "score": 5, "replies": [{"body": "This is good advice.\n\nThere are new opportunities every day. You will miss more by staying in an investment that's run its course.\n\nYour decision to take profits should be based by the performance of the Stock alone.", "score": 3, "replies": []}]}]}, {"body": "It‘s not that easy. Reducing risk adds opportunity costs in terms of lost potential gains.", "score": 1, "replies": [{"body": "Lost potential loss, too.", "score": 1, "replies": [{"body": "Yes, but in a bull market the net potential profit/loss on average is positive, hence a gain.", "score": 1, "replies": [{"body": "VOO  and chill.", "score": 1, "replies": []}]}]}]}]}, {"body": "It depends on if you buy that this is a rally or a fake-out and if you think a real recession is coming next year…\n\nShort term - protect your profit…long term…hold onto those deep low positions because we can’t guarantee that we’ll ever see those prices again.", "score": 2, "replies": []}, {"body": "OP- if you're worried about short term capital gains and you made a good return, but you're worried about the market dipping- my advice for covering for this scenario is to sell deep in the money calls (the strike price is the LOWEST you think the stock would go) and make the expiration date right after the point it would put you into long term gains.  If the stock doesn't drop below the strike it will exercise, likely at expiration and you'll have made some theta money and effectively as much off the sale if you had done it at market- and at the same time sold it at long term capital gains.", "score": 2, "replies": []}, {"body": "Yes BBBY is great rn", "score": -6, "replies": []}, {"body": "Think of it this way as an example, say you invested $100 a month ago and its blown up to $140. If you had $140 cash today would you choose to invest it into Amazon at its current price? If you would then you should keep it, if you wouldn't then you should consider taking profits", "score": 1, "replies": []}, {"body": "I’ve sold a number of stocks at a price which was not at the ATH (or even close) and then bought those stocks back for cheaper. I kinda consider trying to time the market as setting limit sells or buys at what you technically divine to be current all time highs or all time lows", "score": 1, "replies": []}, {"body": "Just ignore everybody talking about timing the market. You shouldn't try to time the market with your retirement fund. If that's 20, or 40 years away, just keep contributing to that 401k into index ETF's every pay check and don't think about it.\n\nAs a wealth investment strategy, though, you should have portions of your wealth allocated to different things. So your 401k and your home should be like your bedrock assets. You shouldn't try to trade those, and just hold for the long term. When you get closer to retirement, you should think about having more stable returns, like bonds and cash equiv, instead of stocks.\n\nIf you're setting money aside to invest, though, you should be seeking higher returns and some more risk. With that money, you should be thinking about buying low and selling high. If you get in to a stock, and it unexpectedly pops 20% the next week, you can take profits. You don't have to sit in it for a year to see if it keeps going. You can sell it, and look for the next investment opportunity. \n\nThat goes for trading options and high risk assets too. Within the money you set aside for investing, you should have a small (like less than 10%, probably only 1%) where you swing for the fences and buy those crazy lottery ticket plays. As long as you're still in control of the risk profile of the portfolio, there's nothing wrong with having some highly speculative positions.", "score": 1, "replies": []}, {"body": "Something I've learnt is that it's never a good idea to hold onto stocks you don't like fundamentally just because you don't want to create a taxable event. Unfortunately it's just one of the cons that comes along with investing in individual stocks. If you don't like it perhaps just buy and hold an ETF, but in my experience if you hold a decent number of stocks almost every year you'll have a couple become very stretched from a valuation perspective and the best thing to do generally is just sell, even if that means paying taxes.\n\nIf you're just selling because it's gone up though that's silly. If you still think it's fairly valued and like the company I'd hold.", "score": 1, "replies": []}, {"body": "Not timing the market would be considered taking profit when you need to use that money (retirement/emergency/large purchase). Taking profit arbritraryly because you think it's as high as it'll go, would mean you're timing the market.", "score": 1, "replies": []}]}
{"title": "It’s still not late for $BNGO Party", "selftext": "$Bionano Genomics Inc  ( $BNGO) Too many catalyst coming up in the coming month. Their product is one of the best in the industry. It has all Patents for their tech ,  designs and products. Genome is the next industry in line after EV. It’s still a new bee with 90% year on year revenue growth and  still investing in their R&D, in Worst case I see this is a golden merger with illumina (ILMN) which is I am seeing easy  $30+.\n\nIt is steadily moving up and keeping the momentum… Shorties playing on it so don’t get trapped and sell… Just hold tight. \n\n$BNGO 15 mil shares traded today.. and shorts managed to hold it perfectly flat for the day.\n\nIt has major catalyst coming in 2023, Once it gets medical codes approved   and FDA approved, imagine if Medicare and medicaid, hospitals and clinical RD adopted this, this will fly to double digits. This is Tesla in Genome industry with latest technology in OGM. \n\nI am not selling a single share because I know I have to buy it higher later on.\n\nApes should HOLD strong and New Bees can still Jump on it and Ride along.", "id": "wpluxc", "created_utc": 1660627808.0, "score": 30, "upvote_ratio": 0.74, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|5 days ago\n**Total Comments**|7|**Previous DD**|\n**Account Age**|5 days|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wpluxc)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wpluxc)", "score": 1, "replies": []}, {"body": "I have 100 shares bought at $3.10, Im holding", "score": 11, "replies": [{"body": "Didn’t know we had a whale", "score": 3, "replies": [{"body": "hahahahaha now that made me laugh!", "score": 1, "replies": []}]}]}, {"body": "What does this have to do with $bbby?", "score": 29, "replies": [{"body": "Nothing to do with bbby but it’s great Info for a real investment and not a squeeze on a dead going nowhere company like bbby", "score": 4, "replies": []}, {"body": "xD", "score": 4, "replies": []}, {"body": "It's a distraction and likely a waste of time. I don't need to look into it to know that bbby is literally the best play on the market. I've seen like five pnds being pushed pretty hard over the last week.", "score": 0, "replies": []}]}, {"body": "7000 shares here if BNGO", "score": 7, "replies": [{"body": "Me too. Haha", "score": 1, "replies": []}]}, {"body": "I’m in", "score": 7, "replies": []}, {"body": "Super pumped for the upcoming weeks! Nothing beats investing in a company with the potential to do some serious good while making some serious money along the way!! 🚀🚀🚀", "score": 7, "replies": []}, {"body": "7200 shares of BNGO\n\n50 Contracts 8/19\n\n40 Contracts 9/16\n\n🚀🚀🚀💎🙌", "score": 6, "replies": [{"body": "BNGO is still under control of shorts… all contracts will decay since apes are not strong enough… so be careful with your contracts…", "score": 2, "replies": []}]}, {"body": "It’s emerging tech with latest tools like Tesla in EV it’s BNGO in OGM which is patented… so no one can copy their tech and world hospitals applauded on its tech starting from new born to recognize cancer…this is delivering and this is something mankind need.", "score": 11, "replies": []}, {"body": "interesting paper, i am in.", "score": 4, "replies": []}, {"body": "I am in 🚀", "score": 5, "replies": []}, {"body": "BNGO is the Tesla of the Genomics, I am in fort short and long term, a lot of great things about to come 🚀🔥", "score": 4, "replies": []}, {"body": "6000 shares here", "score": 3, "replies": []}, {"body": "Common thing with $BBBY is shorts are hunting …and Apes are set with the trap…😜", "score": 3, "replies": []}, {"body": "This bagholder joins 5 days back and its not talking about BBBY, wtf", "score": 8, "replies": [{"body": "![gif](emote|free_emotes_pack|facepalm)![img](emote|t5_2th52|4267)", "score": -2, "replies": [{"body": "You're a true autist, go get clinical help!!", "score": 1, "replies": []}]}]}, {"body": "2100 share bngo", "score": 2, "replies": []}, {"body": "Holding 10k shares of BNGO 💪🚀", "score": 2, "replies": []}, {"body": "Hodl BBBY, sye aye. Oh captain my captain", "score": 3, "replies": [{"body": "Aye holding with diamond hands both", "score": 5, "replies": []}]}, {"body": "This post is not about BBBY", "score": 2, "replies": []}, {"body": "1 year later, are you still loading up??? Naaah man All time low again and again....", "score": 1, "replies": []}, {"body": "This is the load zone. It’s on rising support with the short squeeze and gamma squeeze score pushing 90 again. Let’s blast this play on all social medias. Great Long and Short term play.", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "wq1yl4", "created_utc": 1660675081.0, "score": 44, "upvote_ratio": 0.78, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|51 seconds ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wq1yl4)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wq1yl4)\n    \nHey /u/Iam8798, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 10, "replies": []}, {"body": "Fuk it i want in", "score": 11, "replies": []}, {"body": "Well, I just jumped in", "score": 10, "replies": []}, {"body": "It will pop soon", "score": 9, "replies": []}, {"body": "I’m down 10k since 11/21!! 🤦🏻‍♂️ I need a POP📈🚀💸🐋🐂🤑☝️🙏🚀💪🏻💎👍🏻🤞💵 Im GOING ALL IN💯 $39,000 at $4.14 LETS GO💪🏻🤞☝️🤝", "score": 9, "replies": [{"body": "You still buying?", "score": 2, "replies": []}]}, {"body": "I’ve been averaging in from profits from other plays, can’t wait for the 🥚🚀", "score": 7, "replies": []}, {"body": "Got a pair of 7.5$ leaps yesterday. The chart looks good to my eyes, though I am just a novice.\n\nEdit: Did not work out in the end for me.", "score": 6, "replies": []}, {"body": "I like the stock, I like shopping there as well.", "score": 5, "replies": []}, {"body": "ortex data currently is more than 30% shorted, all time lows, low free float.  Its been squeezed before so we know its possible.  i think all this needs is a push", "score": 6, "replies": [{"body": "Definitely needs a push. CTB is near 65% and 2.2M shares are short. Public float is only 12.4M. LFG", "score": 3, "replies": []}]}, {"body": "I’m in today at 1,261 shares. I like what you wrote and I agree.", "score": 3, "replies": []}, {"body": "Damn you have 50-60k in shares!", "score": 3, "replies": [{"body": "I have 120,000 shares.  Everything is blood red today, NEGG is up 1.5%.", "score": 7, "replies": [{"body": "Wow!!!! Insane amount, and you love to see it! Imagine on a Green Day!!! NEGG soon!", "score": 3, "replies": []}]}]}, {"body": "We buy from newegg at our school. Picked up 1,200 shares just now, thanks", "score": 4, "replies": []}, {"body": "GME > NEGG", "score": 6, "replies": [{"body": "In a sea of red, GME is down 7.5%, and NEGG is up 1.5%.", "score": 6, "replies": [{"body": "The reason you’ll stay poor forever is because you look to be momentarily correct, rather than observing basic data to remove you from the denial that you’re a complete idiot that should not be handling money in the stock market.", "score": -2, "replies": [{"body": "I bought GME at $4.14 4/2020.  That's the pre-split price.  So, in today's prices, that's $1.035.  I sold the last of those shares at $271.\n\nBut, GME was over 18 months ago.\n\nI've been investing for over 35 years.\n\nI am far from poor.  Close to 8 figures.\n\nNEGG up over 3% today from being down nearly 5%.  8% move up from the lows.\n\nBut, you do you, notbrokemexican.", "score": 11, "replies": [{"body": "Oh great we have him larping now", "score": -4, "replies": [{"body": "You're welcome to check my post history from that period.", "score": 7, "replies": []}]}]}]}]}, {"body": "Why  not both?", "score": 1, "replies": []}]}, {"body": "Hope some smart bro today sold BBBY and bought NEGG", "score": 7, "replies": [{"body": "Sold 100 shares of BBBY and bought 300 shares of NEGG \nWaiting for opening prices tomorrow and want back into BBBY MAY DO 300\nNot many shares,but just a little guy !\nLittle guys need to make money too\nThink I will !", "score": 3, "replies": []}]}, {"body": "Buy more BBBY", "score": -1, "replies": [{"body": "It's a losing money company short squeezed so ok if u bought at 5 but now you are a crazy if u buy some bbby at 25 $. NEGG is a profitable company now with strong financials with 2.4 B revenues trading at 1.5 B cap mrkt.. Bbby has 1.5 B revenues trading at 1.5 B cap. mrkt and it's losing a lot of money", "score": 6, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}
{"title": "DFV", "selftext": "We all know DFV is a legend. When bbby dropped from +70% to +18%, I wanted to sell and lock some gains. I'll admit it. What a paper handed bitch thought. I think back on those amazing days with DFV diamond hands holding through all the ups and downs of GME and it beers me strength. \n\nDFV, if you're out there, thank you.", "id": "wq7nyl", "created_utc": 1660688934.0, "score": 268, "upvote_ratio": 0.95, "num_comments": 32, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|15|**First Seen In WSB**|1 year ago\n**Total Comments**|44|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wq7nyl)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wq7nyl)", "score": 1, "replies": []}, {"body": "I can't imagine how many times DFV had to reinforce his chair and floor in order to support the sheer weight of his massive and exceptionally dense nutsack.", "score": 96, "replies": [{"body": "Made us retail investors look as if we weren't all regarded. Big feat.", "score": 10, "replies": [{"body": "Average feet. Disproportionately large testes.", "score": 3, "replies": []}]}, {"body": "Contractor buddy of mine said, they installed one of the biggest industrial railed craned in existence so he can carry his balls.\n\nSpace Xs,new loading crane in the factory was modelled after it. Well they just downsized it. Elon said, it's be unnecessarily big", "score": 3, "replies": []}]}, {"body": "\"It beers me strength\" is my new favorite phrase.", "score": 29, "replies": [{"body": "Same here fucking love it", "score": 6, "replies": []}]}, {"body": "I’m not here to pay off my car. I’m here to buy a house.", "score": 23, "replies": [{"body": "I'm here to see that guy fuck Melon Kunis. 🍉 🍉 🍉", "score": 6, "replies": []}, {"body": "I mean that’s pretty much the same thing as a lambo 😂", "score": 1, "replies": []}]}, {"body": "Upwards of 15-25k until I think about selling. Wont change my life forever and I don’t have enough in for that to truly happen realistically, but it’ll definitely put me back on top financially", "score": 17, "replies": [{"body": "Until you lose it again ![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "Nah can’t lose what’s already spent! goals of immediately paying off all credit card debt, modding my car and paying it off some.", "score": 2, "replies": []}]}]}, {"body": "GME had DFV, and BBBY has u/hgyyyyyyyyyii\n\nThat guy was up to $5 million today and didn’t sell, even when it dropped down by $1.5 million. DIAMOND FUCKING HANDS.", "score": 14, "replies": [{"body": "Anyone can be him. First you start with two million dollars…", "score": 3, "replies": []}]}, {"body": "HODL TO THE MOON 🚀🚀🚀", "score": 8, "replies": []}, {"body": "Apes never paper hand. Hodl for 100 EOW 🚀", "score": 17, "replies": [{"body": "remindme! In 69420 days", "score": 2, "replies": []}]}, {"body": "Lmao", "score": 4, "replies": []}, {"body": "I have a quick update to share. I have received the all seeing eye award from an anonymous user. Do you know what this means!? WE RIDE AT DAWN!", "score": 14, "replies": [{"body": "That’s DFV telling him he noticed and this thanks.\nThat’s at least what my wife’s 3 boyfriend has told me.", "score": 9, "replies": []}]}, {"body": "🚀", "score": 7, "replies": []}, {"body": "That dip made me think and go ok, check the technicals. Lowest RSI dip since the push down from $11 to $8.75 on the 10th of this month… and I grabbed a 5x leveraged buy to say fuck you to shorts. Now up 100%", "score": 6, "replies": []}, {"body": "The fucking legend", "score": 3, "replies": []}, {"body": "DFV is here with BBBY🍉🚀🚀🚀", "score": 1, "replies": []}, {"body": "He was not a cat", "score": 1, "replies": []}]}
