{"title": "[deleted by user]", "selftext": "[removed]", "id": "kcwwq9", "created_utc": 1607949601.0, "score": 497, "upvote_ratio": 0.97, "num_comments": 77, "comments": [{"body": "I feel a disruption within the force.\n\n*buys Palantir & Disney for longterm*", "score": 113, "replies": [{"body": "I’ve been gaining off Palantir since it was at $14 and then I bought a ton more at $29 thinking it would jump to $40, but I bought at the peak. Just holding long term now, I’m not a day trader but I was hoping that it wouldn’t drop like this right after I bought it that high.", "score": 37, "replies": [{"body": "\n\nThis is the way!", "score": 24, "replies": []}, {"body": "You shouldve avged down.", "score": 4, "replies": [{"body": "I’m aware there’s a few things I should’ve done differently at this point lmao", "score": 8, "replies": []}]}, {"body": "You belong in WSB", "score": 8, "replies": [{"body": "Everyone here is in WSB they just know better than to act natural on the r/stocks sub.", "score": 36, "replies": [{"body": "~~🚀🚀🚀~~ 🤫", "score": 19, "replies": []}, {"body": "To be honest, I stay away from WSB. I broke my own rule and was groggy waking up extra early and made a quick decision when I saw it skyrocketing at open. I’m usually the guy that over analyzes before making a move.", "score": 2, "replies": []}]}]}, {"body": "Also got in at $14 and been wanting to add to it, been writing weekly cash secured puts at strikes of $20-22 and just collecting the premium if it ever wants to go that low lol.  This week I was a little ballsy and wrote a strike of $25 we'll see what happens.", "score": 1, "replies": []}, {"body": "should pay attention if break down $25 it will be ugly . put stop loses and be wise bro", "score": 1, "replies": [{"body": "I don’t understand what you’re saying, but I don’t do options trading.", "score": 1, "replies": [{"body": "thats not options . what i mean price action on PLTR . if the price breakdown $25 it could be dive more dips . just put your stop loses.", "score": 0, "replies": [{"body": "I’m sorry, I’m just not familiar with the phrasing. You’re saying to just sell if it drops to $25?", "score": 1, "replies": [{"body": "yes thats i mean just put stop loses. and also that my trading plan to short PLTR if breakdown 25.50 ill add position short with target 20 .", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Im a big disney guy and i dont know if it would be the right move. As they announced legit everything for disney plus yesterday i dont see them going up for a couple years when they announced new stuff again. Im gonna be honest they will never have growth like this again. They announced years of content which is basically the start of the platforms originals and will.only announce a couple at once from now on. \n\nDisney parks are a different story epcot is being upgraded but they had to cut major plans because of the pandemic and the effects on it. And disney world has its 50th anniversary this year (2021) but nothing has happened. Because of Covid a lot has been pushed back the only new thing that is confirmed coming is their new roller coaster but i highly doubt it will boost sales even during and after the pandemic. \n\nOverall they dont have a draw for the parks and disney plus wont have anyting new announced for probably a year and a half. So i dont see any major growth happening.", "score": 15, "replies": [{"body": "Big Disney guy too. I kind of agree and I think the current growth is fueled by vaccine talks + Disney+ content.   \n\n\nI think Disney will hold still and decline for a while for the reasons you mentioned. But I think we will see some major growth again when things actually open up and slowly go back to normal I think the parks will get more sales and attendance than expected, since people have starved from going to the parks for too long, coupled with massive Disney+ growth again.", "score": 12, "replies": [{"body": "I dont thimk the theme parks will be enough though because lots of people are scared of travel and will be for atleadt another year from now i see potential sure but i dont see a lpt", "score": 5, "replies": []}]}, {"body": "mighty plucky support squeeze ludicrous elderly label decide bedroom rinse\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 2, "replies": []}]}, {"body": "I love Disney long term.", "score": 3, "replies": []}]}, {"body": "I’m newer to stocks so sorry if this is a stupid question: Is the Santa Claus effect actually real? Do stock prices usually go up near Christmas time every year?", "score": 36, "replies": [{"body": "[deleted]", "score": 40, "replies": [{"body": "Oh yeah I don’t plan on trading or anything. I would have thought if it is real wouldn’t that mean the rally would occur at the beginning of December in anticipation for this effect? And then because of that there would be anticipation for the anticipation and so on to the point where it has to be priced in and ineffective. At least that’s what I would have thought so I’m confused on how it actually is a thing. I mean if it’s real and as obvious as it seems everyone would be rich right?", "score": 10, "replies": []}]}, {"body": "1. Traders take losses early in the month, so stocks go down in early December.\n2. Funds buy the hot stocks at the end of month, in order to try to look good. It's called window dressing. Which drives winning stocks higher.", "score": 18, "replies": [{"body": "Yes, that is a good point. They take losses to avoid taxes and funds want to look good when advertising for next year", "score": 1, "replies": [{"body": "But why do they take their losses in early Dec and not late?", "score": 3, "replies": [{"body": "Would you leave business for the last day? I think they usually want to be ahead of the market. Retail investors also do this. If everyone would sell at the same moment losing stocks woull collapse i think", "score": 1, "replies": [{"body": "Yes!  If one expects year end selling, then you would want to be days, if not weeks, ahead of this selling activity, that will drive the price of the stock down.\n\nAlso if really still like the stock, but want to harvest your tax losses, you can not buy the stock back for 30 days. So if you expect heavy selling in mid to late December, THEN you have to do your tax selling starting around mid to late November.\n\nPlanning ahead of expectations and the other traders' moves, is very key.", "score": 2, "replies": [{"body": "Yes. Only positve returning stocks can be bought back in the in the first 30 days.", "score": 1, "replies": []}, {"body": "Good points! Thanks. I swear, I need to hear this every year..\n\nQuestion about wash sales: If you did a lot of dollar cost averaging into a position you intend to keep long, can you sell (and claim when filing taxes) individutal lots that have losses if you bought other shares within 30 days, but do NOT buy any further shares for at least 30+ days going forward?\n\nOr can you only sell the losing lots if you haven't bought other shares in the past 30 days?", "score": 1, "replies": []}]}, {"body": "Yeah, I sold off real losers two or so weeks ago. I didn't want to wait until everyone else was selling off their losers.", "score": 2, "replies": []}]}]}]}, {"body": "Thats really interesting. I was subconsciously doing that didnt even realize.\n\n\nI know that a lot of investors rebalance their portfolios this time of year, so I guess the window dressing goes hand in hand.", "score": 1, "replies": []}]}, {"body": "Christmas Eve 2018 has joined the chat", "score": 5, "replies": [{"body": "Fed raised rates. Current noise is around January 5th election results and what they mean for policy going forward.", "score": 1, "replies": [{"body": "Can you please elaborate for a newb like me please?", "score": 1, "replies": [{"body": "I'm being careful not to throw some speculation in my answer, but the results of a the fed decision to raise rates in December 2018 caused the market to drop 20%. Since the market through a tantrum, the fed took back the rate hike and also said they wouldn't be raising rates for the remainder of 2019. After which, 2019 had a hell of a run. There were a lot of storylines about 2018 that didn't get a chance to get fleshed out due to the instant fed resersal.\n\nThe noise I'm referring to is the potential policy impact of a majority controlled prez, senate, congress vs a senate that can't get anything of the new administration proposals passed if GOP doesn't hold GA Senate race. My point was that 2018 was an anomaly of a fed acting like our underlying economy was stronger than it actually was since fed rate increase impacted corporate costs to borrow money.", "score": 1, "replies": []}]}]}]}]}, {"body": "It only goes up if we all keep buying the dip. That’s the DD", "score": 27, "replies": []}, {"body": "Will BABA ever really turn up?  I averaged in at the high 200s and this stock is pissing me off haha.  I know I need to be patient and plan to hold for 3-5 years.", "score": 11, "replies": [{"body": "Yes. With hindsight it's unfortunate that you bought in at the price you did, but it's not like BABA is a meme stock and you missed out on all the gains. It's still up roughly 30% since the beginning of summer, even with the big pull back starting at the end of October. It's still among the world's true monster companies, and maybe the monster with the most room to grow relative to it's current size.", "score": 3, "replies": []}, {"body": "I've looked at the option flow and there is some money on 270+ in January. 290+ by march.", "score": 2, "replies": [{"body": "Beautiful news!  I know the failed Ant IPO effed it up a little.", "score": 1, "replies": []}]}]}, {"body": "What's with Pfizer dipping?!", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "The vaccine has guaranteed Pfizer a revenue stream for 3+ years out but in the 9 months it’s taken to produce the vaccine, they’ve also fallen behind on other research projects and the production of other drugs.", "score": 6, "replies": [{"body": "You both make sense but I don't like it", "score": 1, "replies": []}]}]}]}, {"body": "Where's the \"next week economic data\" statistic coming from? Been looking for a condensed source for all this data", "score": 6, "replies": []}, {"body": "Is RKT a sell rn? I’m new but have several shares of RKT currently and have got a little return. Should I hold it sell?", "score": 3, "replies": [{"body": "They seem a really company for the long run. Just my opinion. I would keep the stock at this price point", "score": 1, "replies": [{"body": "Okay thanks !", "score": 2, "replies": []}]}]}, {"body": "Is it just my or do you guys thing Disney is worth less than it is", "score": 8, "replies": [{"body": "Disney is worth much more once the parks open which is why your seeing the current price", "score": 16, "replies": [{"body": "When will they open that’s the real question", "score": 5, "replies": [{"body": "When governments let them.", "score": 3, "replies": []}]}]}, {"body": "I know fuck. but the word on the street seems to be that Disney will compete with Amazon and Netflix when it comes to streaming movies and TV. So perhaps not crazy overvalued.", "score": 7, "replies": [{"body": "They're releasing about a billion new Marvel/Star Wars series and a ton of movies on a subscription service. They're a powerhouse even without the parks", "score": 8, "replies": []}]}, {"body": "It's probably fair value at this price, but i think it has room to go up after a small correction, keep in mind they were a dividend company before, with the dividend suspended they can see growth at a faster rate, check my previous post about Disney info", "score": 5, "replies": []}, {"body": "Just posted this under another guys comment im a big disney person so im hoping this is pretty insightful\n\nIm a big disney guy and i dont know if it would be the right move. As they announced legit everything for disney plus yesterday i dont see them going up for a couple years when they announced new stuff again. Im gonna be honest they will never have growth like this again. They announced years of content which is basically the start of the platforms originals and will.only announce a couple at once from now on.\n\nDisney parks are a different story epcot is being upgraded but they had to cut major plans because of the pandemic and the effects on it. And disney world has its 50th anniversary this year (2021) but nothing has happened. Because of Covid a lot has been pushed back the only new thing that is confirmed coming is their new roller coaster but i highly doubt it will boost sales even during and after the pandemic.\n\nOverall they dont have a draw for the parks and disney plus wont have anyting new announced for probably a year and a half. So i dont see any major growth happening.", "score": 4, "replies": [{"body": "True. I would not add to my position on Disney (avg. 110$ entry). until it goes at least to the 160$ levels. But they will have higher growth than before the pandemic. The dividend cut will be a big reason why alongisde DIsney+", "score": 1, "replies": []}]}]}, {"body": "Maybe a stupid question but when would the santa clause effect end and is there an idea or a chart for the first couple weeks of january? Im new to stocks and haven't experienced the holidays yet.", "score": 2, "replies": [{"body": "probably some volatility around the 5-6th in January with the Georgia run-off, but after that all is green i think, with the pandemic starting to get under control by then at least somewhat", "score": 2, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}, {"body": "I think the sales from the holiday season will drive up the sales, which will increase the performance of certain organizations in the stock market.", "score": 2, "replies": []}, {"body": "You think nows a good time to go into Disney ?", "score": 3, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Like how low?", "score": 3, "replies": [{"body": "160 would be nice... but don’t know if it goes that low", "score": 2, "replies": [{"body": "Feels bad man I bought at 172, should I sell\nI thought it was a good time since it dropped a lot", "score": 2, "replies": []}]}]}]}]}, {"body": "The market is bad.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "just curious, what are youre top 5 holdings?", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Looks solid, ty sir", "score": 3, "replies": []}]}]}, {"body": "Is there any particular reason why you hold so many companies instead of a more concentrated portfolio?", "score": 2, "replies": [{"body": "Not looking for fast & big returns, i chose the companies that i really like the most and think give me great growth and value in my portfolio... This also  significantly reduces my portfolio risk. And i didn't want to buy into ETFs to start, as i like the flexibility of making my own stock picks. It basically acts like an index fund at this point... But i have outperformed the big 3 indexes since starting this new portfolio", "score": 1, "replies": []}]}]}]}, {"body": "I stopped reading after ”~Very long post~”", "score": 0, "replies": []}, {"body": "So OP lets say i have some money lets say$5000 to spend on stocks. You think just to make a quick buck i could buy some right now and then next week sell them for the santa clause effect and the earnings call? If so what eould you reccommend (and if its not obvious im newish to stocks)", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Okay thanks a lot for the insight", "score": 1, "replies": []}]}]}, {"body": "Does anyone know if Disney/ESPN secured Monday night football? I read that they were trying to secure a deal. That would be huge for ABC/ESPN", "score": 1, "replies": []}, {"body": "I have calls on Walmart to get to 150 by Jan 15, you think its gonna happen?", "score": 1, "replies": [{"body": "I've looked at the options flow and its looking pretty good.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That’s such a SPEC play... shit is over 5-10 years away. Don’t think the stock will jump until then", "score": 1, "replies": []}]}]}
{"title": "Desktop Metal (DM) gonna moon ?", "selftext": "At first I like the name of this company. Then I did some DD. Here it is. Thank me later\n\n1.Desktop Metal is the only company that provide 100x rapid and mass production - 3D metal and carbin fiber printed product (called the production system P50) which going to replace traditional CNC machine \n\n2.Desktop Metal's product has highest resolution : 1200x1200 dpi with highest tensile modulus 140GPa and 2500MPa tensile strength (2000x stronger than traditional FFF material)\n\n3.Not only Ford, BMW, Toyota but also Google partnership with them\n\n4. Current cumulative gross margin is >48%. Management team said projected to be >54% in 4 yrs (to give you perspective Tesla c gross margin is around 5%)\n\n5. 625m Cash sitting on their balance sheet after merger with TRNE spac. However, currently DM’s valuation is only 700m ish. So way undervalued.\n\n6. The AM industrial grew at a 20 percent annual compound rate between 2006 and 2016 before accelerating to 25 percent compound annual growth over the last three years\n\n7. Bunch of MIT profs sit on the board (those are the people who first invented metal 3D printing)\n\n8. Named the world's top 50 smartest company by MIT Technology Review\n\n\n\n\n\n\n\n\n***TLDR; I believe they can produce Terminators to save humanity one day***", "id": "kcphn7", "created_utc": 1607916166.0, "score": 44, "upvote_ratio": 0.86, "num_comments": 100, "comments": [{"body": "Tryna slide into DM", "score": 17, "replies": [{"body": "Smoking OXY while sliding the DMs", "score": 5, "replies": []}]}, {"body": "This will be $20 - $25 by end of the year. $30 - $40 next year. Over $100 in next 5 years.No competition in this space with their tech, and backed by Google and Tesla's co-founder.\n\nAlso.. they have fucking 625m Cash sitting around. Compare that to the valuation.", "score": 11, "replies": [{"body": "What is it they specifically do where they have no competitor", "score": 2, "replies": [{"body": "&#x200B;\n\nFastest tech, cheapest, Patents, huge backers", "score": 2, "replies": [{"body": "hahaha you mean LOTS of patents", "score": 1, "replies": []}]}]}, {"body": "Its already peaked close to $35 and that was towards the end of January. Right now Its sitting close to $30 but I can see its on a dip now. So definetly the price will be going up to $40 by end of February for sure. We could see it hit $100 by the end of 2021. Desktop Metal is a company with a lot of potential. It should be only as a long term investment. Swing trading wont work with this stock.", "score": 1, "replies": [{"body": "What do you still think of DM", "score": 2, "replies": []}]}, {"body": "Aged like milk", "score": 1, "replies": []}]}, {"body": "[https://twitter.com/chamath/status/1300463875402407937](https://twitter.com/chamath/status/1300463875402407937)\n\nPersonally, I feel the stock has been flooded with Chamath's cult millennial following on Twitter and will take a while to flush out the noise on this one. Great long-term play in my opinion.", "score": 8, "replies": []}, {"body": "Thanks. Got in when it stopped crashing", "score": 7, "replies": [{"body": "Look at the goood run today lol", "score": 3, "replies": []}]}, {"body": "I am from the future. Buying DM was the best decision this year", "score": 7, "replies": []}, {"body": "Going go to 50 next 2 months!  ARKK pick", "score": 5, "replies": []}, {"body": "3d printing isn't where it needs to be for this to blow up, yet. We're still a good time period away from anything great happening in 3d printing.\n\nUntil 3d printing can break the hurdle of mass production and by mass production I mean tens of thousands of parts being made in a day with great accuracy, it will still be a developing technology.", "score": 12, "replies": [{"body": "DM is the only 3D printing company that can do mass production. Take a look at their SEC filing and their investment presentations", "score": 5, "replies": [{"body": "What mass production? Can their machine produce 200k parts per day? They are doing 17-4ph printing I believe but I can hardly believe it will reach metal injection modeling level of capacity.", "score": 5, "replies": []}, {"body": "Not true - look at markforged", "score": 3, "replies": [{"body": "Correction: mass 3D printing production of metal and carbon fiber complex", "score": 8, "replies": []}]}]}]}, {"body": "This was a buy under $15, when it traded as TRNE. Unless you plan on holding for 5+ years. No moons, no rockets in the short term.", "score": 9, "replies": [{"body": "Lets see loool", "score": 5, "replies": [{"body": "remindme! 3 months", "score": 4, "replies": [{"body": "I will be messaging you in 3 months on [**2021-03-14 04:18:28 UTC**](http://www.wolframalpha.com/input/?i=2021-03-14%2004:18:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/kcphn7/desktop_metal_dm_gonna_moon/gfs37xk/?context=3)\n\n[**8 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fkcphn7%2Fdesktop_metal_dm_gonna_moon%2Fgfs37xk%2F%5D%0A%0ARemindMe%21%202021-03-14%2004%3A18%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kcphn7)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Please sell me shares at 15, please", "score": 1, "replies": [{"body": "Now's your opportunity if you still want to do that... full disclosure, I bought in heavily today at a number of prices, but my most recent purchases were around $15.60", "score": 2, "replies": [{"body": "Update: it mooned lol", "score": 1, "replies": []}]}]}]}]}]}, {"body": "There's money in people's pockets getting stale and this is a pretty good looking breadbox. 1/15/21 & 12/17/21 30C", "score": 2, "replies": []}]}]}, {"body": "Ark has moved up their position in Desktop Metals. On January 15th, right after DM bought out EnvisionTEC for $300 million, ARK started buying shares. In less than 6 days Desktop Metal is number #13 on their 3D portfolio. ARK purchased their shares at an average of $24.00 a share. At the time of this post 1/21 - ARK owns 469,083 share worth $11,267,373.", "score": 4, "replies": [{"body": "Thanks for sharing man.  Very bullish signal🚀", "score": 1, "replies": []}]}, {"body": "I think it's an interesting stock but hard to tell where the post-merger bottom is going to be at this point. May be finding it in the 16s, may not be close yet...", "score": 9, "replies": [{"body": "I think around 16.5 is a good price", "score": 2, "replies": []}]}, {"body": "What happened, they sold off hard on Friday.", "score": 3, "replies": [{"body": "Some ppl took profit. I think it is normal", "score": 7, "replies": []}, {"body": "Merger completed = sell off", "score": 6, "replies": []}, {"body": "Yup, just a SPAC merge selloff. Happens. Nothing to be concerned about. Buying opportunity for folks who missed it.", "score": 1, "replies": []}]}, {"body": "14.52 looks like support. A bounce off of that could mean business.", "score": 3, "replies": [{"body": "16.5 imo", "score": 2, "replies": [{"body": "Mines not an opinion. Just based off sloping support line. Support may be 16.5 tomorrow.", "score": 3, "replies": [{"body": "Hm  It never dip below 15.98", "score": 1, "replies": [{"body": "Still lower then 16.50$. I know math is hard for some but looks like we were both wrong", "score": 1, "replies": [{"body": "Yea. Good that it's going up", "score": 1, "replies": [{"body": "Agreed. I bought some January calls strike of 17.5 so I’m not mad.", "score": 2, "replies": []}]}]}]}]}, {"body": "well, there it went!", "score": 2, "replies": [{"body": "Strong support line. It can bounce up soon", "score": 1, "replies": []}]}]}]}, {"body": "Webull has ceased trading under DM. Think or Swim has allowed me to submit an order prior to premarket open. Do I need to buys shares under DM or TRNE?", "score": 3, "replies": [{"body": "It is DM now", "score": 1, "replies": []}]}, {"body": "$DM will moon soon 🚀🚀🚀🚀", "score": 3, "replies": [{"body": "Yep. Lol the next meme stock", "score": 2, "replies": []}]}, {"body": "Chamath saying price action is not fundamentally driven \n\n[https://twitter.com/chamath/status/1338506346212118528](https://twitter.com/chamath/status/1338506346212118528)", "score": 2, "replies": [{"body": "Apparently trading app problems after merger combined with post-merger selloff caused it to go down", "score": 2, "replies": [{"body": "Was just a small drop. Will rocket soooooon", "score": 1, "replies": []}]}]}, {"body": "Make his fight on the hill in the early day\n\nConstant chill deep inside", "score": 2, "replies": []}, {"body": "3D printing sector has one of the best performance (up 20%-300%) in the past 2 weeks. They probably gonna have a bullish year. Been waiting for this for so long", "score": 2, "replies": []}, {"body": "A little jump today 🚀🚀", "score": 2, "replies": [{"body": "It is ! It will prob dip a little bit before running up again", "score": 2, "replies": [{"body": "I’m waiting for the day wsb picks $DM. Unfortunately this may be too smart of a play lmao", "score": 2, "replies": [{"body": "It def has the potential to be a meme stock one day", "score": 3, "replies": []}]}]}]}, {"body": "3D printing has been pumped for what 10 years now.  The tech is still gay... look at DDD.\n\nIt was a SPAC pump and dump pure and simple", "score": 7, "replies": [{"body": "Can't compare these new companies to those old dogs. There were VR companies in the 1980's. Every tech has its time. Solar started to really run a few years back. 3D printing is starting to have its moment. Get on board or get out of the way.\n\nAlso the fact that ARK has a dedicated 3D printing ETF (PRINT) should clue you in to something going on here ...", "score": 8, "replies": [{"body": "What makes this company so special ?  Does it have unique IP or just fancy printing machines / no moat ?", "score": 2, "replies": [{"body": "Industries (such as automotive, but many others) are moving toward new designs with drastically smaller part counts. Like, thousands fewer parts. You need 3D printing to do that. Metal 3D printing at a sufficient quality level is not easy. The barrier to entry is high. DM has already done the hard work. Now it's time to reap the rewards of the next industrial revolution.", "score": 6, "replies": []}, {"body": "From what I know they have around 300m valued IPs", "score": 3, "replies": [{"body": "That doesn’t mean anything . What makes the company unique ?  What gives them a moat over the competition?\n\nLet’s be honest most people pumped this thing because Chamath P did the PIPE / was involved ... guarantee not many people actually know anything about this company", "score": 1, "replies": [{"body": "Read DD read company's SEC filings", "score": 3, "replies": []}]}]}]}]}, {"body": "DDD is old tech tho and they dont do metal printing. Agree short term will have pump and dump. But I am in for long term", "score": 4, "replies": [{"body": "Fair I just think there’s probably 10+ better SPACs out there to speculate on.  Just seems blah", "score": 1, "replies": [{"body": "For example ?", "score": 1, "replies": [{"body": "Pay Safe....  but I like DM for long hold as well. \n\nAlso the Redsox may go public with RBAC.", "score": 5, "replies": []}, {"body": "Paysafe (BFT), Skillz (FEAC), Genius Sports (DYMD) to name a few.", "score": 1, "replies": [{"body": "I would get in FEAC and RBLX", "score": 2, "replies": []}]}]}]}, {"body": "https://www.3dsystems.com/3d-printers/metal\n\nWrong. Not only do they do metal printing, but they do it much better than DM. I've worked in metal 3D for nearly a decade. DM is a joke to anyone doing actual high-quality metal AM. Their parts are not fully dense and not suitable for anything high paying (medical or aerospace)", "score": -2, "replies": [{"body": "Again DDD is old tech. I don’t know whether you work at metal allergy. Only “draw back” of Desktop metal is its build volume is 2 times smaller than DDD: 300 x 200 x 200 mm vs 500 x 500 x 500. \nHowever. The reason why DM can mass produce is because they use metal-polymer-matrix to deposit layers of powder metal in a process it calls bound metal Deposition which not only increase speed but also cut cost.", "score": 2, "replies": [{"body": "Just to point out bound metal deposition is just the studio system. All the other systems are metal binder jetting. Also I'm fairly certain digital metal has a slightly higher DPI and there's not much info out but the closest competition is HP's metal jet which uses thermal inkjet heads as opposed to piezo electric inkjets. The former is less prone to clogs. Source, went to formnext and interviewed the product manger for metal jet. DDD is old but I wouldn't count them out. I'm speculating they'll merge/buy out the ex-CEOs new company in the future. And while DM is cool I'm honestly more stoked about Velo3d or even Arris composites. DM will probably buy some company to add lbf to their portfolio at some point", "score": 2, "replies": [{"body": "^informative", "score": 2, "replies": []}, {"body": "I keep hearing people talk up Velo3d, but everything I've heard about people actually using it is the system is a pain in the butt to actually operate, and their \"supportless\" system is very, very particular about what sorts of geometries it works with.", "score": 1, "replies": []}]}]}, {"body": "Said from a guy who work at metal 3D. Plz define high quality. What matrix? What injector? What tensile strength? Whether it binds carbon fiber? DDD cannot print metal and carbon fiber at the same time. While DM can", "score": 2, "replies": [{"body": "DDD doesn't need to print with carbon fiber because they use powder bed laser melting to create fully dense metal parts out of highly desirable materials. No binder, no filler. Just pure aerospace and medical grade titanium. That mixed shit will never be FAA or FDA approved. And that's where the AM money is right now.\n\nBut I'm just a guy in the industry that's worked on and installed a large variety of metal printers. You're some guy that read Dam's marketing materials and bought the hype. What do I know?", "score": 1, "replies": [{"body": "LOOL. You made so much assumptions. I didn’t even know this Dam guy you are referring to. \n\nAgain, provide me the numbers, tensile strength comparisons using the same materials by two different machines. \n\nI work in aerospace. Fiber composite is almost 1/3 the density of Ti and provide similar strength, the reason why use carbon fiber because it is light. Most of time we use metal and carbon fiber composite rather than pure titanium. Ps: rocket body and complicated airframe fins are made from carbon fiber and metal complex", "score": 5, "replies": [{"body": "That's great, you work in aerospace. I work in 3D printing. Carbon fiber may be used for body parts and fins but those are simple shapes that are easily manufactured in the traditional way. Why would anyone try to print those? Especially with DM's tiny build volume. Metal AM is used primarily for engine and fuel delivery parts which need to be fully dense and able to withstand heat. \n\nI've been in the industry for awhile. I've seen DM at many a show and convention. They're all flash and no substance. Anyone that knows anything about AM knows that DM is a joke and a black hole that VC funds pour into never to be seen again. If you want to feed that hole, be my guest. I wouldn't touch it.", "score": 0, "replies": [{"body": "The reason why carbon fiber havent not been used for complex shape much it is because of the difficulty of formation lol. And DM solved that. Not only high DPI amd high strength. A good company is not just good tech but also good business execution. \n\nBasically you are saying Ford, BMW, and Google Venture are bunch of idiots. Yea you are smarter than them lol", "score": 2, "replies": [{"body": "Ford created the Edsel, BMW made the i3, and Google came up with Google+. Big companies are capable of investing in losers. It happens all the time. Their backing doesn't ensure DM is going anywhere. Didn't GM invest in NKLA?", "score": 1, "replies": [{"body": "It is hindsight 2020. Nothing is ensure. \n\nBut we place money on the one that has high probability of success. Like growth companies with >30% YoY revenue, advance tech, and good branding", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Thanks for weighing in .  I honestly think people just gambled on this garbage SOLELY due to Chamath P being involved in the SPAC.", "score": 0, "replies": [{"body": "I wouldn't say it couldn't gain meme status. Hype is DM's speciality. But their tech is trash and the entire AM community knows it. Big guys buy laser bed melting machines that print fully dense parts without additives or binders.", "score": -1, "replies": [{"body": "Big talk coming from someone on 3Dsystems payroll 😜\n\nThey are taking chances and frankly I'm more impressed by DM then 3DS.  At least we're seeing inroads from the big subtractive players with hybrid processes.  Also don't be so certain of your hearsay.  I've been hearing good things about the shop and production systems.\n\nThe real truth? Probably somewhere in the middle.  But there is more to metal printing than DMLS or EBM.  Just because it didn't work before, doesn't mean the tech can't be refined in the future.  And after watching Papa Elon's stainless dildo fly, I'm willing to give DM the chance to prove metal jet has a future.  Doubly so as HP is pouring millions into pushing their own metal jet printing solution.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "I’m extremely bullish on DM. I first bought in at like $25 and have been averaging down since. Now, I think the entire market has so much uncertainty, it’s hard to say any sort of price prediction even until the end of the year. But with news that they can now 3D print wood with Forust, this is bound to be a major disruptor. Is this company perfect? No. Have I lost a ton of money so far? Yep. But, DM and all 3D printing companies will drive the next industrial revolution. The space is big enough that it doesn’t matter the competition. Because I think any 3D printing company is a good choice. I just like this stock.", "score": 1, "replies": []}]}
{"title": "The Vin Diesel trade: step by step", "selftext": "“‘Ask any racer, any real racer. It doesn't matter if you win by an inch or a mile; winning’s winning’\n- Dom Toretto”\n               - twtregg \n\nWith that quote as a guiding principal, here is how to win by an inch 3x a week for $75k+ a year in gains.  Just remember as you read this post; Winning’s winning.  \n\n\nThe Vin Diesel Trade:\n\n1. Monday - sell 8-12 delta $50 wide call or put spread on SPX exp Wednesday (or both - doesn’t really matter if you pick calls or puts, do what makes you happy). This will usually get you $175-$200 credit for $5,000 in buying power per contract. I been doing 4 contracts for years now. \n\n\n2. Tuesday - Drink, watch Vin, smoke, etc. doesn’t really matter. Point is, don’t do anything to the Monday positions.  Do nothing. Maybe you use this time to do something productive, like read some shit self improvement book. \n\n3. Wednesday - 99.9% of the time you simply close Monday’s position for between $25 and $10 then put the $175 per contract profit in your pocket, thank Vin and move on.  That’s 3.5% in 2’ish days.  At 4 contacts I usually make $500-800 bucks. \n\nFor that 0.01% of the time you are in the money... well use your judgement and either close for the loss or grow some balls and wait the day out.  Personally, I am pretty aggressive to close when I find myself ITM on exp day, but honestly, more times that not it would have been better if I just waited until near the close to exit... but I don’t read any of those shit self improvement books, so little self control.  Also FYI, at $50 wide spread it’s almost impossible to hit max loss. \n\n4. Wednesday after you have closed Mondays position - Open a new position with the same deltas as Monday to expire Friday. Ie. sell 8-12 delta $50 dollar wide call or put spread exp Friday. \n\n5. Thursday - Do literally anything but fuck around with your Wednesday position.  Seriously, just don’t. \n\n6.  Friday - close Wednesday’s position for $175 profit per contact.  Thank Vin.  Then open the same 8-12 delta $50 wide put or call spread exp Monday. \n\nThat’s pretty much it.  I know this is not ‘new’ and I know there are 100 different ways to manage all this. But honestly, this is simple and it works.  Is it as sexy as a TSLA $20k yolo... yes. Yes it is. \n\nNow go off and make some money for once in your shit lives.  You’re welcome.", "id": "kd67wv", "created_utc": 1607978967.0, "score": 72, "upvote_ratio": 0.93, "num_comments": 104, "comments": [{"body": "Ask any trader. Any real trader. It doesn’t matter if you gain by a penny or a mil. Tendies are tendies", "score": 34, "replies": []}, {"body": "TLDR: sell 2DTE spreads and watch Vin Diesel movies", "score": 17, "replies": [{"body": "This is correct.", "score": 9, "replies": []}]}, {"body": "Delta? Like the airline? Don't follow.", "score": 18, "replies": [{"body": "Yes.  Seems like you follow just fine.", "score": 19, "replies": [{"body": "The lower delta on the spread is to avoid getting raped by premium increase in the event there is a decent move upward in the price of the underlying, right?", "score": 5, "replies": []}, {"body": "LMAO oh dear...like the airline", "score": 3, "replies": []}]}, {"body": "SIGMA DELTA THETA. are the greeks for advanced trading. Very complex material but to truly understand Advanced trading you need to know this stuff. Also very commonly used in statistical analysis for just about everything. Has nothing to do with airlines. Hope that helps", "score": 2, "replies": [{"body": "you mean gamma alpha rho", "score": 8, "replies": [{"body": "Gamma like Hulk?", "score": 5, "replies": []}, {"body": "Noooo. Do Re Mi Fa SO La Ti Do", "score": 2, "replies": [{"body": "fus ro dah?", "score": 1, "replies": [{"body": "Geez you must have a PHd", "score": 3, "replies": []}]}]}]}]}]}, {"body": "And what if we have 03/20? How much inches of loss did I take? Serious question because I usually don’t fuck around with options.", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Then you probably lose $5k per spread, but unless a black swan comes every month you’ll be fine.", "score": 7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Once when the market bounced hard the end of March. But even then I don’t think it was a full loss.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "\\>  Cool. Just to run the numbers here. If you’re getting $200 a week and  putting up 5k collateral, lets say you’re profitable 90% of the time and  take profit at 50%. So 100x 40 weeks a year for eg= 4000 profit on 5k  collateral.  \n\nExcept that's exactly NOT what OP wrote, at all.\n\nAssume you profit $175 (on $5k risk), 3x/week, 50 weeks/year. That's $26,250/yr, if 100% win rate across 150 trades.\n\nNow let's say 90% win rate - that's $23,625 in 135 profitable trades. But what about the 15 losing trades?  Well - 2020 has had [14 single-day losses](https://en.wikipedia.org/wiki/List_of_largest_daily_changes_in_the_S%26P_500_Index) \\> 88 pts, so it's conceivable that all 15 of those trades MIGHT have been max loss, if you didn't use a stop loss. That'd be $5k x 15 = $75k loss, which would be a total net loss on the year of \\~$22k.\n\nOr let's say you stop out at $1000 loss - now you're down to $15k loss, which nets you out to a \\~$8k net gain for the year.\n\nIt's not a good or bad strategy - it's just a strategy. If you like the small-but-frequent wins, and you add a strategy to manage the losses, it could be good for you.  \n\nBut if you like swinging for the fences with OTM FDs - then yeah, this probably isn't a satisfying strategy for you.", "score": 6, "replies": [{"body": "Yes mostly this.  If you use any sort of directional bias vs a neural strategy then you do much better. Also I tend to sell more calls than puts... far less upside ‘black swans’", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Same delta.  But you definitely get less of a ‘buffer’ since puts are typically more over priced due to big investors buying downside protection. It’s a trade off.  Honestly, for how I pick call/put I just look at an RSI. No idea if there is any actually science behind it but it’s helped me be on the right side more often.", "score": 1, "replies": []}]}, {"body": "There was another poster who shared this strategy a few months ago, but sold SPX puts exclusively, due to the logic that the market is generally bullish & moving up.  But your philosophy makes sense, too - market moves up, but doesn't generally JUMP up hugely & quickly.\n\nAlthough, I sayu that & then I looked at the wiki link I posted - and SPX had 14 days in 2020 with an intraday jump of >75, so....  Looking more closely, 11 of the 14 very-down 2020 days and 8 of the very-up 2020 days were in late Feb/Mar - so this strategy would probably have worked just fine if you took a break for 6 weeks when the market started tanking...", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I assume almost no one will see this. BUT This strategy is still working as designed though all this nonsense.", "score": 7, "replies": [{"body": "Can you give me exactly what you have for tomorrow's exp?", "score": 1, "replies": [{"body": "I had 5 short call verticals 3950/4000.  I closed them during the morning sell off for .10. Made 2.1 per spread. Opened these yesterday.", "score": 1, "replies": [{"body": "Thank you very much. I used to do $10 wide spreads then $5 wide Iron condors. I was hitting the max loss once every month and wiped out my profits. Might try these.", "score": 1, "replies": [{"body": "When you go that narrow at the lower deltas there just isn’t enough juice there.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "This guy fucking gets it.", "score": 8, "replies": []}, {"body": "I think Robinhood said that.", "score": 1, "replies": []}]}, {"body": "what the hell kind of gibberish is this", "score": 5, "replies": [{"body": "Some real voodoo shit bro. You don’t want any part of it. Trust me.... or do you?", "score": 8, "replies": []}]}, {"body": "thanks, gonna try this out and see how it works for me I've been thetagang with CSP but have wanted to dip into PCS over the past couple weeks just more weary of the total loss of collateral in PCS vs CSP.", "score": 5, "replies": []}, {"body": "How far otm do you usually go?", "score": 4, "replies": [{"body": "Whatever the 8-12 delta strikes are. Which usually equates to a 1.5-1.75% move on calls or 2-2.5% on puts based on IV.", "score": 1, "replies": [{"body": "Ok I just took a look at 12/18 contracts for puts on SPY. Delta is around 12 for a 356/351 put spread. Premium received would be around 60$ for a 500$ risk. There’s no way I’m thinking about this correctly. Can you point out my error?", "score": 2, "replies": [{"body": "The way my retarded math works it out, that’s a 12% return vs the 3.5% of the example...?   I think that’s pretty good, I’ve been looking at this strategy for a while now, and then seeing OPs post really laid it out nicely for me, but I’m also wondering if there’s something I’m missing?   This seems too easy and I’m looking for the catch...", "score": 3, "replies": [{"body": "Potential loss of 500 of it moves against you,", "score": 1, "replies": [{"body": "Yes true, but the odds of it becoming a 500$ loss is low. Spy would need to drop from 365 to 351 for a max loss, and I would only start losing money if it dropped to 356$ by 12/18. Is that right? I just thought that theta gang usually looks at a return of 2-3% a week on capital risked", "score": 2, "replies": [{"body": "Yah selling options is profitable that’s why institutions do it, but for a small account yoloing all in and getting a ten bagger is what a lot of people here want to do", "score": 1, "replies": []}]}]}]}, {"body": "I don’t use SPY so maybe the return could be different. But it’s may also be because you are a day further out in the DTE and on the high-end of delta.", "score": 3, "replies": [{"body": "I see. How often do you see yourself losing in this type of trade though?", "score": 1, "replies": [{"body": "By virtue of the delta statistics I *should* be ITM (not max loss just ITM) 8% of the time, but it’s not even close to that in reality.  In the last few years I have only had a hand full of losers and only 1 close to max loss.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Wdym by 8-12 delta?", "score": 8, "replies": [{"body": "Try Google.", "score": -1, "replies": [{"body": "Im not understanding how delta can be greater than 1", "score": 10, "replies": [{"body": "K", "score": 1, "replies": [{"body": "Posts a self help guide for the autists and doesnt provide autist support. Ban.", "score": 38, "replies": []}, {"body": "LMAO", "score": 2, "replies": []}]}, {"body": "8-12 / 100", "score": 1, "replies": []}]}, {"body": ">sell 8-12 delta $50 wide call or put spread\n\nYou may seem rude but this is actually good advice. We need to learn for ourselves people thats how you make it. Thanks OP", "score": 5, "replies": [{"body": "Tough love works. I was beat as a child and look at me now.", "score": 10, "replies": [{"body": "harder daddy", "score": 8, "replies": []}, {"body": "I checked out today’s spy. Could you should me the buy/sell for puts? I’m not seeing the right profit on my screen.", "score": 1, "replies": [{"body": "I don’t use SPY. But on the SPX I sold 3 call spreads 3735/3785 for $2.15 and 1 put spread 3570-3520 for $2.  All exp wed. Short options were about the 9 delta at the time. No idea if that helps you but there you go.", "score": 5, "replies": [{"body": "hmm SPX ticker is not coming up?", "score": 2, "replies": [{"body": "I think he's playing the weeklies anyway, those are SPXW.", "score": 2, "replies": [{"body": "ahh gotcha ty", "score": 1, "replies": []}, {"body": "no SPXW either lol", "score": 1, "replies": []}]}, {"body": "No index options on Robinhood", "score": 1, "replies": []}]}, {"body": "Helps a ton! Thank you 🙏", "score": 1, "replies": []}]}]}]}]}, {"body": "but yea an 8-12 delta doesnt make sense unless you mean 8-12%?", "score": 6, "replies": [{"body": "Ok ok ok. You win.... Yes the actual delta range to sell is 0.08 to 0.12 for puts or -0.08 to -0.12 for calls.  I hope you are happy with yourself you delta nerd", "score": 18, "replies": [{"body": "i like how noobs are giving you a hard time over the symantics of the delta because you wrote whole numbers smh", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Probably, but I have not tried it. The key is selling the 8-12 delta put or call.  How wide you go isn’t that big of deal but the tighter you make the spread the less credit you’ll get.", "score": 2, "replies": []}]}, {"body": "The only question I have is why haven't you scaled this up op?  Why only 4 contracts when it seems like you could be doing closer to 20 contracts after a year of doing 4?\n\nAlso you're not wrong,  that math is as sexy as 20k yolo on tsla", "score": 3, "replies": [{"body": "I like having a few max losses on hand just incase.... I also like buying fancy things sooo...", "score": 4, "replies": [{"body": "Fair enough.   Thanks for the response.   I'm sold", "score": 3, "replies": []}, {"body": "How much fancy shit can you buy with only $75K? That barely covers my annual mortgage.", "score": -7, "replies": [{"body": "You sir will not do well this next decade.", "score": 4, "replies": []}]}]}]}, {"body": "You know 2020 all fuk when Theta 🧛‍♂️ bravely show their fangs out in the sunlight.\n\nNOT TODAY, SATAN! NOT TODAY!", "score": 3, "replies": []}, {"body": "Get this Theta Gang shit out of here! We buying 0dtes up in this bitch only!", "score": 6, "replies": []}, {"body": "I was just reading about this strat.. Or similar.. On wealthyoption-dot-com. I would love to try this but SPY's 12 delta premium is like .70 and even adding a 10 wide spread it comes out to be like .28 a contract.", "score": 2, "replies": []}, {"body": "This trade is substantially the same as this one: https://old.reddit.com/r/options/comments/jm2tgy/my_spx_weekly_premium_selling_that_dominates_the/", "score": 2, "replies": []}, {"body": "This write up talks about trading spreads but your website and your recent trades are naked puts. What did you see in your back testing that lead you to naked puts over the credit spreads?", "score": 2, "replies": []}, {"body": "Sorry cant find SPX on Robinhood. There is SPXS and SPXL\n\nWhich one?", "score": 3, "replies": [{"body": "Uhhh better off to do SPY than leveraged ETFs if you can’t trade the index", "score": 3, "replies": [{"body": "What kind of spread would you do on spy? 5$ I'm guessing?", "score": 1, "replies": [{"body": "Wider the better. Usually it lands ~$10.. what ever makes the most sense risk/reward wise", "score": 1, "replies": []}]}]}]}, {"body": "So are you basically selling a 3700 (for example, assuming an 8-12 delta) and buying the 3750 as collateral and banking on that not landing in the money? And if it does just close the short call?", "score": 1, "replies": [{"body": "Yep Pretty much that’s it.", "score": 2, "replies": [{"body": "Can’t wait to fuck this up and lose money", "score": 15, "replies": [{"body": "It’s possible. But hard to do. Good luck", "score": 3, "replies": []}, {"body": "thats the spirit", "score": 2, "replies": []}, {"body": "Try to paper trade it weekly for 6 weeks. You'll get it.", "score": 1, "replies": []}, {"body": "So how did it go?", "score": 1, "replies": []}]}, {"body": "your example doesnt make any sense....", "score": 2, "replies": []}]}, {"body": "there is no SPX ticker tho....", "score": 2, "replies": []}]}, {"body": "5/5 stars. How long have you been doing this and how much have you made?", "score": 1, "replies": []}, {"body": "Ok, can anyone here post a video on how to set this up for a complete retard ? If you show me this vid I’ll quit my fucking job ( unemployed) and start working like you !", "score": 1, "replies": []}, {"body": "This guy gets it. Constant predictable losses are not the way", "score": 1, "replies": []}, {"body": "What time do you usually open or close positions? Do you set closing limit orders right after it's filled?", "score": 1, "replies": []}, {"body": "What's your risk/reward ratio on these spreads? I mean if it's 20/80, 2 losing trades out of 10 will wipe out all your gains. In the long run, u will barely break even / profitable.", "score": 1, "replies": [{"body": "The mathematical win rate at a 10 delta is 90% but in reality it much higher mine is probably 98+.  Also you are assuming max loss in your mental math. I have never come close to max loss since the short strike is already at the .10 delta it’s incredibly improbable - basically 3 SD almost. \n\nI totally get this strategy does not work for everyone.  It’s a little scary haha.", "score": 2, "replies": []}]}, {"body": "still going strong?", "score": 1, "replies": [{"body": "Sure is. I took a $5k loss last week on the massive up move, but that’s going to happen from time to time. Overall still up over $20k 2021 so far.", "score": 1, "replies": [{"body": "I saw another post saying you’re selling debit spreads depending on RSI.  Much respect.  Is this all you do for income or do you have a job? Not really necessary of a question but just props to you for it.  I’ve been doing it for a while, it’s great.  Got fucked on the AM options though one week.  Didn’t know that was even a thing...", "score": 1, "replies": [{"body": "Funny enough I got caught with AM options too when I was starting this and had no clue what was happening... turned out ok in my case but a learning experience.  I have a job as well, so I do this mostly in my Roth to mitigate taxes.  The thought has cross my mind to just do this and not work anymore, so maybe one day.", "score": 1, "replies": [{"body": "You go hard brother 🤙 thanks for the idea :)", "score": 1, "replies": []}]}]}]}]}, {"body": "When you say 8-12 delta, is that only for the short option or is it the delta for the whole spread?\n\nI know this post is old af but I just started trying this strategy this past week. I’ve had success so far, but don’t want to blow my account up for misunderstanding something.", "score": 1, "replies": [{"body": "Short option. You can buy which ever long option makes you sleep a little better. I do $50 so risking $5000 per contract.  No magic with that really just something that’s cheap enough to buy and provide some buying power relief", "score": 2, "replies": [{"body": "hell yeah man thanks", "score": 1, "replies": []}]}]}, {"body": "I'm curious, does OP still do the Vin Diesel trade? If so, is it getting tougher now? Also do you completely not do Stop Loss on Tues and Thurs? Lol", "score": 1, "replies": [{"body": "Still at it. Still raking it in.  Taken some losing trades as usual but overall on track for another banner year.  I don’t use a stop loss.  I have tried before but I don’t think it helps.", "score": 1, "replies": [{"body": "OP, I'm paper trading your Vin Diesel trades. Thanks for your prompt reply! My question is, it takes balls to do 50 wide. If I'm looking at just 5 to 15 wide, should I even consider? Also, what time on Mons, Weds and Fris do you get in? When market opens? Last question, how do you decide whether to go Put or to go Call Spreads? I note on the no stop loss technique. Very ballsy!", "score": 1, "replies": []}]}]}]}
