{"title": "GME - Last chance to load up under $14.", "selftext": "I know there have been a million posts about GME. The ER did us all a favor and created an entry point under $14 - Merry Christmas present from GME. Load up now on Calls and Shares. The last time we saw it under $14 was before Thanksgiving.\n\nHave patience. The Short Squeeze may or may not happen but GME will be over $20 by January to April timeframe so lots of upside.\n\nIn for 5k shares and a ton of April calls.\n\nUpdate 1 - 10:02am - Over $14.\n\nUpdate 2 - 10:06am - Dipped down to 13.91, trading a tiny bit under $14.\n\nUpdate 3 - 2:48pm On the move up to $14.37, I hope you didn't sell CC at $14 or $14.5 for tomorrow or next week.\n\nUpdate 4 - 12/15 1:14pm - High was back over $14. I give it another week before it hits and stays over $14. A bunch of you have short attention spans.\n\nUpdate 5 - 12/21 over $16 again.  Cohen ups stake from under 10% to 12.5%\n\nhttps://preview.redd.it/pb3bq72ljd461.png?width=429&format=png&auto=webp&s=a3347a17d17ef448d6fd7da633ef5b87a5583ae8", "id": "kagr30", "created_utc": 1607612456.0, "score": 100, "upvote_ratio": 0.88, "num_comments": 97, "comments": [{"body": "I wish I had more money to buy gme but I dont have buying power to get more anymore lol bought some jan calls and shares yesterday", "score": 33, "replies": [{"body": "I can't put in more until I see something positive. Sitting on 313 shares @$18 avg cost 🥴", "score": 26, "replies": [{"body": "I think once they say anything about how their holiday sales went it will moon", "score": 9, "replies": [{"body": "They said on Earnings Call they would announce Holiday sales numbers in Jan.", "score": 15, "replies": [{"body": "11MA just crossed 21MA on 10D chart on 15 min increments. On 2hr increments when that happens you will know it has reversed the down run. Hopefully later today.", "score": 4, "replies": []}, {"body": "Yeah that's why I got jan calls yesterday", "score": 2, "replies": []}]}, {"body": "Isn't sales data released by NPD tomorrow?", "score": 1, "replies": [{"body": "That's general consumer consensus we need a release from gamestop's management which they said would do", "score": 2, "replies": []}]}]}, {"body": "But if you sell them now and buy back, they’re only 13.XX average cost!", "score": 9, "replies": [{"body": "Shhh", "score": 3, "replies": []}]}, {"body": "My condolences. I did the same on PLTR Calls and many other things. Underwater now waiting for it to go back to $30+\n\nJust be patient. If you have any dry powder DCA or look at some calls in Mar/April because they won't be this cheap again.", "score": 5, "replies": []}, {"body": "You need to average down.", "score": 2, "replies": []}]}, {"body": "Take out a loan", "score": 3, "replies": [{"body": "WSB does a leveraged buyout of GME using nothing but credit cards", "score": 10, "replies": []}]}]}, {"body": "https://ibb.co/JjvM4wW\nGet on board u retard astronauts 🚀🚀", "score": 20, "replies": [{"body": "Oh man, thank you for that chart. I'm mere 11ish% in red with GME and absolutely not thinking of selling low, but this really makes the wait easier.", "score": 5, "replies": []}, {"body": "the trend is downwards if you compare each spike. I suspect this is attributable to the increase percentage of purchases being made direct by the consumer through MS and Sony. Couple this with the supply chain issues artificially created by organized groups buying up the units and reselling them at 3x the price, which I believe will have as big or bigger negative impact on GME sales as the direct-to-consumer sales. So while there should still be a spike, we shouldn't expect it to be as high as either of the previous two.", "score": 3, "replies": [{"body": "but still, even just holding at 15-20 will make so many of the shorts go underwater, borrow fee right now is 80, which is about $24+ to open a new short position. Something has to give at some point, a new deal or takeover or even as late as the next earnings will be the next catalyst.", "score": 4, "replies": []}]}, {"body": "This chart might look impressive at first glance but it's not once you take about 5 seconds to mull it over.  Essentially nothing happened during the release of the PS3, the big run up didn't happen until over a YEAR+ later.  Expecting this to shoot up and print tendies on Jan/Feb calls is wishful thinking.  \n\nDigital sales of games have already surpassed the sales of physical copies.  Nothing is going to reverse that.  GME is dead and these console releases are not going to fix that.", "score": 1, "replies": []}, {"body": "more like autistnauts", "score": 1, "replies": []}]}, {"body": "As this continues to find new supports, there will be shorts who had hoped it would go lower tapping out, and that will add to the upward momentum. This was their last chance for it to tank before holidays/new console cycle.", "score": 30, "replies": [{"body": "\"Hold my beer\" - George Sherman (probably)", "score": 6, "replies": []}, {"body": "You don't consider a stock going from 20 to 13 in a day \"tanking\"??", "score": 3, "replies": [{"body": "Sure, it tanked, even though your numbers for a single day are off. But there are plenty of shorts who had anticipated it dropping further. High short interest will cause many to unload their positions as the bottom continues to rise. That will accelerate upward momentum, even if there aren't a ton of retail investors buying the dip. The \"short squeeze\" is kind of a red herring in the sense that it's what's been driving the stock price up all along. The stakes are still plenty high for shorts even after the most recent drop, and they're going to keep tapping out unless they anticipate an additional negative catalyst. All of this is just common sense, but people prefer to think in terms of \"GME dropped 20% in a day, it's trash\" or \"It's going to squeeze like VW and go above 200.\" Both of those are outliers.", "score": 7, "replies": [{"body": "Yeah, I personally don't see gme going anywhere. People will always want a brick and mortar to go to. Hell I just went into one today. But I just don't see it mooning.", "score": 2, "replies": []}]}]}]}, {"body": "you son of a bitch, im in.\n\n2k shares at 13.79", "score": 13, "replies": []}, {"body": "I just bought the fucking dip. My investment journey this year went from buying ETFs -> Blue Chips -> to now fucking distressed brick and mortar stocks. Hahaha", "score": 13, "replies": [{"body": "GME isn't distressed, undervalued.\n\nManagement is making the right calls, just need to accelerate things. Cohen will continue to crack the whip and they speed up or move out.", "score": 3, "replies": [{"body": "Tha's what I'm betting on. Distressed due to loss making and declining at the same time", "score": 1, "replies": []}]}]}, {"body": "80% short fee atm\n\nBears\\_R\\_FCK", "score": 13, "replies": []}, {"body": "13.84 now lol", "score": 23, "replies": [{"body": "Going to fluctuate up and down. I will be very happy if it closes over $14 today, $14.5-15 would be fantastic. I have watched a lot of stocks that have gone down at ER and it sometimes takes a week or two for significant movement to upside. GME could be faster as it is being manipulated by shorts and when they cover it will help it move up.", "score": 24, "replies": [{"body": "They won’t cover, that’s why they’re shorting. They don’t care how long it takes, they are betting GameStop hits zero. The only reason why they would cover is GameStop looks like it’s no longer a “bankrupt” company. If Q4 earnings are good we may start to see short interest go down, and eventually lead to a squeeze", "score": 1, "replies": []}]}, {"body": "[https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME)\n\nBorrowing fees @ 80%. this looks crazy", "score": 4, "replies": [{"body": "At some point, the borrowing fees alone will make shorting unprofitable, you can only wait to cover so long before the fees eat away all your gains.", "score": 3, "replies": []}]}]}, {"body": "I literally bought $10,000 worth of shares on margin today how retarded am I", "score": 8, "replies": [{"body": "I have like 2000 Shares on margin.", "score": 6, "replies": [{"body": "This is the way", "score": 6, "replies": [{"body": "1k shares and 40 contracts on margin reporting in", "score": 4, "replies": [{"body": "What is your profit target guys?", "score": 1, "replies": [{"body": "Yes", "score": 5, "replies": []}, {"body": "Depends on how the chart looks.  I am holding till a steady $20-30 price and then re-evaluating.", "score": 2, "replies": []}, {"body": "🌝", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Just spent the 1k I had to buy 69 shares. Lets goooo.", "score": 5, "replies": []}, {"body": "Let my 12/18 20c print please", "score": 8, "replies": [{"body": "\"buy shares not options\" buys options lmao", "score": 5, "replies": []}, {"body": "Small chance on $20c, $16 could be alright (Sell on a pump a week or two before). Hope for spike and sell, probably Mon-Wed next week. $20C was very ambitious. Most my calls are $15, I do have a couple $20 and $22 in April '22.\n\nI held one $12 Dec Call just to see how IV and ER would affect it.", "score": 5, "replies": [{"body": "https://www.optionsprofitcalculator.com", "score": 1, "replies": [{"body": "Haha yeah. Spend enough time here and you learn to stay away from weeklies.\n\nUsually 30 days out at a minimum for me and if I am playing something as short as 30 days, I'm almost always unloading after a week.", "score": 1, "replies": []}]}]}, {"body": "Your cracked out no way that happens", "score": 4, "replies": []}, {"body": "12/31 16c checking in. I approve", "score": 3, "replies": []}, {"body": "Yoooooo i sold you that on the low low. Exercise that bihh", "score": 2, "replies": []}, {"body": "Buy the other 2 lol", "score": 2, "replies": []}, {"body": "Max pain for 12/18 is $16 so unless shorts start covering, you might want to roll forward. (not advice just opinion)", "score": 1, "replies": [{"body": "I got autist buying 12/18 $20Cs from me lol", "score": 3, "replies": [{"body": "LOL had these before earnings", "score": 2, "replies": []}]}]}, {"body": "Also got 12/18 110c on FSLY. Hoping this shit rebounds back up. Got more money into these then GME.", "score": 1, "replies": []}, {"body": "4 $20C 1/15/21 this is the way!", "score": 1, "replies": []}]}, {"body": "im buying puts 🙄", "score": 3, "replies": [{"body": "Please contribute to the GME Christmas Fund and buy Puts.  All the autists on WSB appreciate your contribution. \n\nThose Puts are probably sold by someone on here.", "score": 9, "replies": [{"body": "up 33%, and out :) thanks to the fund for their contribution", "score": 2, "replies": [{"body": "Good call covering.  I have been making money on cc so more power to you.", "score": 1, "replies": [{"body": "I like making a little money here and there. I know WSB is all about the home runs, but I'm okay hitting singles consistently!", "score": 1, "replies": []}]}]}]}, {"body": "This aged like a fine wine.", "score": 3, "replies": [{"body": "wym? i made my $", "score": 1, "replies": [{"body": "I mean it aged well.. like it was good.", "score": 3, "replies": [{"body": "Oh lol yeah!", "score": 1, "replies": []}]}]}]}]}, {"body": "Or last chance to FOMO in over $13 before another drop. Two sides to every coin", "score": 6, "replies": [{"body": "Yes.  Too much effort focusing on what we want to see happen versus what could actually happen in this sub.  A proper view of risk involves looking at the potential negatives too and not just the positives we want to see.    \n\nI don't think this one moves fast upwards until closer to next earnings report, but would be happy to be surprised.", "score": 2, "replies": [{"body": "Go back and look at Oct. Up 40% in a day on MSFT Partnership news. This has regularly moved 5 to 15% in regular days.\n\nIf you don't think there will be surprise news in the new couple months please short or buy puts....", "score": 2, "replies": [{"body": "In the next couple of months is the next earnings report.. so of course by then it will more likely have jumped.    I already bought shares awhile back so I'm watching from the sidelines now.", "score": 2, "replies": []}]}]}]}, {"body": "Apparently this wasn’t the last chance", "score": 2, "replies": [{"body": "Hasn't gone and stayed back over $14.  Shorts are starting to struggle.  Gme has been on Threshold Security List 4 days last week.  I expect today also. Google it.", "score": 0, "replies": [{"body": "Is today now the last day to buy under $14 or will that be tomorrow when it’s trading at $11 a share?", "score": 2, "replies": [{"body": "Touched $14.02 today, trading at $13.81 right now. It is creeping up. I think you may have another couple days while it still fluctuates. I think it will end under $14 this week as Theta gang and MM want your $14C to expire worthless this Friday.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Ain't going down to $10.", "score": 0, "replies": [{"body": "Hmmmm", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Trading below liquidation value, also trading below expected Q4 cash. Little to no debt, short store leases, entering a console supercycle when everyone is forced to stay at home, and people are getting stimulus checks that can cover the purchase of a console.\n\nOh yeah and short interest is 165% of the float, it's the most shorted stock on the market.\n\nSo huge upside, not much downside assuming management doesn't go full retard, and start burning cash for no reason (overpriced acquisitions).", "score": 20, "replies": []}, {"body": "Honestly not much. The one thing that does seem to be good news is the percent of shorts. Its simply too high even for a company I'm a gay bear on. Other than that though... I'm still trying to figure out why this sub loves gme so much. I've seen them do nothing to deserve this level of hype. \n\nI'm genuinely starting to think a couple of people started this pump when it was less than 10 and those same people dumped when it topped out at 20 leaving a bunch of retards with nothing. It's like people don't understand what a pump and dump is. You are supposed to dump at some point...", "score": 2, "replies": [{"body": "It hasn't hit $20 in the last 52 weeks. High is $19.42. This is an undervalued stock play with short squeeze only being extra. \n\nThey will profitable next quarter, have tons of cash on hand, reducing expenses, improving online experience, new console cycle, etc. What don't they have going for them right now?", "score": 3, "replies": [{"body": "I have no doubt in my mind that gme will be around a long time. But I just don't see this moon shit everyone is talking about. They are attempting to do what Microsoft and Sony already do with their online shops. And they make the hardware. \n\nWhy do you think they will be back profitable next quarter? They havent had a profitable quarter since q4 of 19.\n\nAlso just look at their management. They are clearly garbage.", "score": 1, "replies": [{"body": "Moon shit comes from short squeeze, not from the company itself.", "score": 1, "replies": []}]}]}]}]}, {"body": "That shit company ain't going nowhere lmao", "score": -9, "replies": [{"body": "Lmao Cohen thinks otherwise", "score": 18, "replies": [{"body": "If you saw Cohen suck a fat one, would you do the same?", "score": -5, "replies": [{"body": "I'm sucking on that massive green dildo after buying the dip at opening", "score": 22, "replies": []}, {"body": "p-probably", "score": 7, "replies": []}, {"body": "I’m doing it right now.", "score": 7, "replies": []}]}]}]}, {"body": "Y’all a joke right now. Inverse this crap. PLTR AND RKT proves this won’t even hit it. BAN IF DO BY January", "score": -14, "replies": [{"body": "Put your money where your mouth is. Please short it or buy puts. We appreciate all contributions to the GME Holiday Fund.\n\nPLTR is back to $27.58, up 3.64% today. I see $30-35 by EOM min.", "score": 16, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/neothedreamer the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "You r autistic", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/neothedreamer the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/neothedreamer the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "Raise your hand if you’ve loaded up on some Spicy 🌶 PFE calls 🚀🌚", "selftext": "", "id": "kaqkfd", "created_utc": 1607643477.0, "score": 187, "upvote_ratio": 0.93, "num_comments": 95, "comments": [{"body": "If PFE goes to 50$ by dec 18, I’m buying all the homeless people I see dinner (it’s not as much as some other generous people on here but still)", "score": 42, "replies": [{"body": "Good luck and I hope you don’t live in San Francisco!", "score": 45, "replies": [{"body": "Oooof", "score": 7, "replies": []}]}, {"body": "Not much but I’ll donate 200 to nearest food shelter!", "score": 5, "replies": []}, {"body": "They look at you, \"but I wanted money.\"", "score": 5, "replies": []}, {"body": "u/empqrer is visually impaired.", "score": 3, "replies": []}]}, {"body": "For once in my life I managed to sell at the top ~$43. I should’ve prob just held. Now I’m probably gonna buy back in and get fucked. Should just be happy with my profits but that’s not how my brain works", "score": 20, "replies": [{"body": "U are a retard, ONE OF US ONE OF US!", "score": 6, "replies": [{"body": "I bought a few shares of Tesla in 2015, sold the same year when it started to rise. Bought myself a car and kicked my self ever since.", "score": 2, "replies": [{"body": "I had 40 shares of Tesla at $28 in late 2012... sold for $40 profit...", "score": 3, "replies": [{"body": "you made money on TSLA. You beat out most investors.", "score": 2, "replies": []}]}]}]}, {"body": "I’ve been selling at the top and buying in on the dip and have made 2k+ in the last two weeks. Do it.", "score": 3, "replies": []}, {"body": "I did too, even so I don't think the price will move much taking into consideration the market cap", "score": 2, "replies": []}, {"body": "Dw about it, look at pfizer's 20 year history. If Viagra couldn't save them then this won't do it either", "score": 0, "replies": []}, {"body": "I’m in the same exact boat actually lol. Sigh", "score": 1, "replies": []}]}, {"body": "Up 2.5% ah, I’m gonna need a little more than that PFE", "score": 26, "replies": [{"body": "Ya I’m 12/11 exp", "score": 13, "replies": [{"body": "Oh, dude why not 18? This wasn’t even real FDA", "score": 13, "replies": [{"body": "I blew it", "score": 11, "replies": [{"body": "I don’t think you “blew it” might go up to 44$-45$, still not a bad play, I’m wishing you all the luck mate!", "score": 9, "replies": []}]}]}]}, {"body": "It’s after hours but I know what you mean", "score": 3, "replies": []}, {"body": "Wait till approval from FDA, this was pre-approval!", "score": 6, "replies": [{"body": "Any idea when they’re expected to approve?", "score": 5, "replies": [{"body": "Saturday", "score": 3, "replies": []}]}]}]}, {"body": "🙋‍♀️", "score": 7, "replies": [{"body": "Wishing you luck !!!", "score": 5, "replies": [{"body": "Wow thanks 😊 ☺ 🙏 🙂", "score": 4, "replies": []}]}]}, {"body": "Just remember this stonk doesn’t move much. Even with good news it’s hard to move with it’s market cap", "score": 15, "replies": [{"body": "I know its fucking annoying !!!", "score": 3, "replies": []}, {"body": "I didnt know this was a known thing? What do I do then it just stays where it is", "score": 1, "replies": []}]}, {"body": "I don't even remember buying but I've got a cheeky little  40/45 debit spread for 12/18. 🚀🚀🐥🥓", "score": 5, "replies": [{"body": "Yo for debit spreads to be max gain do I need to hold until expiration or sell when it reaches my strike price. I have a 41.5/42.5 debit spread on my small account and don’t know wether to hold or sell. I’m new to spreads", "score": 2, "replies": [{"body": "\"The best case scenario happens when the security expires at or above the strike of the option sold. This give the trader the maximum amount of profit possible while limiting risk.\"- investopedia. \n\nTBH, I usually buy my spreads at a fucking peak and they tank hard, so i buy to close the sell side at a deep discount and hope the buy side recovers past my cost basis for something,  anything.  Just depends if i had my benzos.", "score": 3, "replies": [{"body": "So I should let it expire. It won’t be worthless? Cause a regular call would just expire worthless, so I’m thinking so would a debit spread ?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Cheeks getting clapped", "score": 2, "replies": []}]}]}, {"body": "50c 1/15. Can I dream of tendies ?", "score": 5, "replies": [{"body": "I’m dreaming got some 50c for March", "score": 4, "replies": [{"body": "50c for march will probs make money, 50c jan, I FUCKING HOPE SO CUZ I WANNA SNORT COKE OFF A STRIPPERS BOOTY SON!", "score": 9, "replies": []}]}]}, {"body": "BNTX 🚀", "score": 4, "replies": []}, {"body": "Why PFE and not BNTX? Way lower float, splits 50% the same vaccine, single product company basically.", "score": 4, "replies": []}, {"body": "Fuck me.", "score": 4, "replies": [{"body": "Me too mate! Me too! Lost half my money!", "score": 6, "replies": [{"body": "I’m done with this stock. If a world saving vaccine makes the stock go DOWN then this is really a POS", "score": 5, "replies": [{"body": "Sold my calls at literally half price! Fuck this. Also sold my shares at a small profit. But overall, literally lost half of my fkn money!!!", "score": 2, "replies": [{"body": "You sold this morning? Why not hold and wait for a squeeze", "score": 2, "replies": [{"body": "My calls were expiring this friday, and if I held, there’s a huge possibility that Moderna might be approved Thursday, which means, pfizer = garbage! Also like you said, even fda UEA wasn’t enough to boom the stock, I dont see what could be except maybe next earnings. I’m gonna wait for stock price to go back to 36$, buy, hold for next earnings", "score": 3, "replies": [{"body": "Solid plan. I’m done with Pfizer forever. For. EVER.", "score": 3, "replies": [{"body": "That’s also a very solid plan!!! I bought some WBA calls expiring January 08, hopefully I can recoup my money, I’m starting to doubt that as well. Pfizer has made a cynic of me mate XD", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I thought I was the only one lol. Kinda nervous tho cuz of how big the market cap is.. but fuck it Covid cure", "score": 3, "replies": [{"body": "Together apes strong! Hold till 50$!!! Might dip tomorrow, but next week, we are off!!!", "score": 3, "replies": []}]}, {"body": "It’s only up 2.5%, that’s not that much", "score": 4, "replies": [{"body": "True that, SO FAR. This was only pre-approval though. Once FDA approves it for real, I’m hoping for 50 by next week!", "score": 4, "replies": [{"body": "What about BioNtech ?", "score": 1, "replies": []}, {"body": "Not gonna fucking happen, only because I’ve got calls on it.", "score": 1, "replies": []}]}]}, {"body": "I've got a 3/21 40c  that up a nice amount. Trying to think if I should cash out or ride it till next year.  💎✋", "score": 2, "replies": [{"body": "I've got the same position.  I'm gonna hold.", "score": 2, "replies": []}, {"body": "Hold brother!", "score": 1, "replies": []}]}, {"body": "1/15 40c looking nice", "score": 2, "replies": []}, {"body": "Nice iv crush ya got there", "score": 2, "replies": []}, {"body": "This is my favorite movie!!!!", "score": 2, "replies": []}, {"body": "I've held 3/19/21 $39c since early November. Through the spinoff and settlement. About best thing I have going right now.", "score": 2, "replies": [{"body": "Wow if it goes to 50$ u a rich man ma dude! Congrats and good luck !!!", "score": 4, "replies": []}]}, {"body": "BNTX is going to 🚀🚀🚀🚀", "score": 2, "replies": []}, {"body": "Walking the tightrope with 42.50 calls for 12/24.", "score": 2, "replies": [{"body": "My butthole clenched af too. BUT HOLD 💎👋", "score": 2, "replies": [{"body": "Bless you, soldier. 💎 ✋", "score": 1, "replies": []}]}, {"body": "Admittedly, I got slightly paper hands and already sold my 36 calls for 12/18. Might miss out on some money but +350% ain't nothin.", "score": 1, "replies": []}]}, {"body": "$48.5C 1/22", "score": 2, "replies": [{"body": "How do you feel about your call? I was really optimistic but on Friday my hopes were crushed, the price went down after pre-approval. Thoughts?", "score": 1, "replies": [{"body": "I’m curious to see what happens Monday morning. The stock should break $50 but it’s so heavily manipulated so who knows", "score": 2, "replies": [{"body": "I dont think its manipulation but more the huge market cap, everybody needs to purchase it on monday, which i hope, i break even if it goes to 45$ this week, so i rly hope it goes to 50$", "score": 2, "replies": [{"body": "I think it’s very likely this stock hits $48.5 by January 22 so I think I’ll make some profit on the initial investment but I’m not expecting much. I bought each contract for .99", "score": 1, "replies": []}]}]}]}, {"body": "If this stock doesn’t moon on Monday I’m selling my positions and never looking back", "score": 1, "replies": []}]}, {"body": "Priced in bros!! It’s a sell the news move.", "score": 4, "replies": [{"body": "I fucking hope not !", "score": 3, "replies": []}]}, {"body": "I figured that by the end of this week or next that the vaccine would be emergency approved, so I managed to snag 3 $PFE 12/24 calls on Friday at strike price of 42. I’m waiting for my steak dinner on Monday lmao", "score": 0, "replies": [{"body": "Im really hoping it booms by tmr, but I’m also scared now, people keep saying its priced in", "score": 1, "replies": []}, {"body": "Yea.... fuck this stock", "score": 1, "replies": [{"body": "Fuck this stock dude what the hell, all the vaccines are down. I’m crossing my fingers it’ll go back up I’ve lost too much", "score": 0, "replies": [{"body": "I’m not selling either. This is ridiculous.", "score": 1, "replies": [{"body": "There’s talk of a gov emergency fund going towards pfizer vaccine distribution which should hopefully pump it more", "score": 2, "replies": []}]}]}]}]}, {"body": "Puts all day", "score": -2, "replies": []}, {"body": "Surely it’s all priced in already.", "score": -2, "replies": []}, {"body": "Option novice here, I bought 12/18 $42 calls(28 contracts). Do I have to sell tomorrow or do I have to wait until real FDA approval? I’ve never held options over nights so I don’t know how bad it will be from the time decay. “IF” the price goes up on Monday too, would you hold it until Monday?", "score": 1, "replies": [{"body": "I would recommend holding until 45$, IMO (as a novice/retard) this stock will easily hit 45$ between here and the 18th of december. I’m hoping it’ll hit 50$ from here until the 18th because I got the same calls as you! Good luck", "score": 3, "replies": [{"body": "Thank you. Good luck to you.", "score": 2, "replies": [{"body": "Also look up “options profit calculator” ! Pretty easy to use, and calculates everything. That’s what I always use before buying options, and before selling options mate!", "score": 3, "replies": [{"body": "Thanks for the info, I googled and tried to use option calculator but it’s still difficult for me. I have to study.", "score": 1, "replies": []}]}]}]}, {"body": "If u hold just be ready for market opening\nDon't sleep on that\nEdit: typo", "score": 2, "replies": [{"body": "I always wake up before market opening but why   do you think it’s important?", "score": 1, "replies": [{"body": "Just in case you see lots of profits Friday and you're worried for Monday you can be ready to sell", "score": 2, "replies": []}]}]}]}, {"body": "Keep it up you thought it was going to the moon?😂😂", "score": 1, "replies": []}, {"body": "Like if they're both ITM at expiration you'll recieve the difference between strike price,  minus the debit you paid.  So if my 40/45 @1.73 per contract expires ITM on 12/18 I'll get 500-173 or 327 per. I'll probably close before expiration though.  Hopefully take 275-300.", "score": 1, "replies": []}, {"body": "$65 coming", "score": 1, "replies": []}, {"body": "At 550% rn.. riding to the 🚀🚀🌙", "score": 1, "replies": []}]}
