{"title": "I draw with crayons so you don't have to. 4 out of 5 wins on my plays last week. Tickers on the watchlist this week: ARCT, BABA, CRSR, PLTR, SPCE, CRM", "selftext": "[deleted]", "id": "klb63p", "created_utc": 1609102124.0, "score": 400, "upvote_ratio": 0.94, "num_comments": 95, "comments": [{"body": "I notice you start off each week saying how much you are up (when you do well).  When you lose you don't post that as well?  I think its important for people to know an accurate track record even if its not good for you.", "score": 80, "replies": [{"body": "I post every single trade. Even my losses, I just havent lost in the last 8 weeks.\n\nThe only time I was assigned was CRM 2 weeks ago. I sold a CC on it and the shares got called away last weekend. Even though that was technically a \"loss\" I still closed up 3% on the position .", "score": 25, "replies": [{"body": "Would you mind sharing some good resources to learn option trading(for a newbie)? Books or blog are more than welcome.", "score": 2, "replies": []}, {"body": "Good pick on $CRM.  Feels like dead money until after their next earnings.  Moved out of them into $NOW which has more growth going into 2021.", "score": 0, "replies": []}]}, {"body": "Hasn't he consistently posted every week? Sounds like he has been consistently up every week.", "score": 22, "replies": []}, {"body": "If you look at his positions from last week, they pretty much match what he still has open this week and some are still open from 2 weeks ago. Looks like some others he didn't pull the trigger on.", "score": 8, "replies": []}]}, {"body": "ARCT has a super super low float but has got to be the biggest scam in this list. They have yet to put out a clinical product. They are all talk. Been following them from their inception because I know the guy that was voted off their board when they had a huge legal battle and spent millions for it (look up Craig Willett). The CEO is a complete fraud and the company is going absolutely no where. They are 10-20 years away from anything. They are only seeing a pop because they jumped on the COVID vaccine bandwagon. Buyer beware.", "score": 25, "replies": [{"body": "You could be right, but you also have Cathie Wood purchasing billions worth of shares. Who's more right?", "score": 9, "replies": [{"body": "Cathie is a gambler, too", "score": 10, "replies": [{"body": "That's good enough for me", "score": 4, "replies": []}, {"body": "One of us ;)", "score": 1, "replies": []}]}, {"body": "Looks like this aged like fine wine. Huge drop yesterday. Hope you weren’t buying.", "score": 1, "replies": [{"body": "Yes I sold two puts with cost basis of $88 per share. I've posted an update to my profile on how I will dig my way out of it.", "score": 1, "replies": []}]}]}]}, {"body": "My only question is why do these weekly posts have that bit about the crayons in the title? I don’t follow.", "score": 12, "replies": [{"body": "came to ask the same thing. for some reason it really grinds my gears 😂", "score": 5, "replies": []}, {"body": "click on the charts....", "score": 3, "replies": [{"body": "There is definitely nothing drawn with crayon here lol just standard candlestick charts", "score": -1, "replies": [{"body": "we got a quick one here fellas", "score": 25, "replies": [{"body": "Still trying to find crayons.", "score": -9, "replies": [{"body": "Some people refer to technical analysis as drawing with crayons", "score": 13, "replies": []}, {"body": "r/woosh", "score": 4, "replies": []}, {"body": "I bet you are", "score": -1, "replies": [{"body": "I know you are but what am I?", "score": -4, "replies": []}]}]}]}]}]}, {"body": "it started off with me emphasizing support levels that I sell at. It still kind of is.", "score": 2, "replies": []}, {"body": "WSB jargon I guess", "score": 1, "replies": []}]}, {"body": "So... buy BABA monday?", "score": 44, "replies": [{"body": "I’d be wary of buying before the results of the investigation come out.", "score": 14, "replies": []}, {"body": "IMO, great chance to own it at a much cheaper price than normal.  And they will have a stellar earnings report.", "score": 15, "replies": [{"body": "Agreed on stellar earnings report. But also an opp for weak hands to sell\n\nIf it doesn't go up on earnings, there isn't a lot of positive events for it to up = more selling", "score": 3, "replies": [{"body": "Chinese New year and potentially rescheduled ant IPO,", "score": -1, "replies": []}]}]}, {"body": "Catch the falling knife💪.", "score": 17, "replies": []}, {"body": "It kept falling the whole day in Hong Kong market today. And I can tell you CPP is willing to do anything punish this \"unbehaving brat\", even if it means to delist it\n\nI am not sure about the others, but I am not touching BABA anytime soon. At least not this week", "score": 3, "replies": [{"body": "So You did not read the news that the CCP concluded the probe already?", "score": 2, "replies": [{"body": "If there's one thing I learnt here in 30 years, is CCP is not to be trusted.\n\nThey are more than willing to torture Ma (not literally) and finally kill him(figuratively) to set a sample for all others not to mock the supreme leader and system.", "score": 3, "replies": [{"body": "And they may still do that. They might also just disappear him and seize his assets.\n\nBut he is only a minority investor in Baba these days. 5 percent and no operative role... CCP just wants to horse around with Ma. Baba will be fine!", "score": 2, "replies": [{"body": "Unless they break Baba up. Then that stock value is basically worthless. \n\nAuthoritarian governments are adverse to any one company or group gaining too much power as it delegitimizes their control. And if there’s one thing the CCP cares about more than money, it’s control. My two cents: avoid Baba (and any Chinese company) like the plague.", "score": 0, "replies": [{"body": "Good point. Why be invested in the soon to be biggest economy of the world. Why invest in one of the fastest growing markets out there? Why invest in innovation and progress?", "score": 2, "replies": []}]}]}]}]}, {"body": "I was checking it all day. Hoped it will fall but in premarket now on US it seems kinda fine.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Same clown bear posting his gains in every baba thread lol.", "score": 6, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Nah comical that you feel the need to flex to a bunch of strangers on Every. Single. Baba. Post. No one gives a shit.", "score": 4, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "“Read my bio” nah I’m good. Been PDT just don’t feel the need to get reassurance and stroked by strangers. All I’m saying is no one gives a fuck about your positions.", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Is your translator here? What the fuck are you trying to say? I’ll grab my little sister to help me figure out.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Still not sure what your dumbass is trying to say. Hope you saw the 10bil buyback news clown.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Anybody have the deleted comment bot? This looks like an interesting convo lol", "score": 1, "replies": [{"body": "Some guy posting on every baba thread his short gains from the 24th. Saying he has 500k to short baba lol. I informed him he was an idiot and I think he said something about banging my sister but I couldn’t really decipher.", "score": 2, "replies": []}]}]}]}, {"body": "Not touching Baba (or any Chinese companies for that matter) with a 10 foot pole. When an authoritarian government can at any point destroy your company for freedom of speech, it’s should make every investor wary, regardless of earnings reports. That and the very real possibility of delisting makes me disinterested in every investing in Chinese companies ever again.", "score": 1, "replies": []}]}, {"body": "Thanks man. Great post.", "score": 5, "replies": []}, {"body": "Thanks mate, great post!", "score": 2, "replies": [{"body": "No problem, lets get it!", "score": 3, "replies": []}]}, {"body": "Really good job man !", "score": 2, "replies": []}, {"body": "Would you be willing to do a follow up post that details the tools you use and the method illustrated with your lines? \n\nYou’ve built a reputation and I’m sure the community would be appreciate of you sharing your knowledge.", "score": 2, "replies": []}, {"body": "Selling pltr puts is literally free money", "score": 2, "replies": [{"body": "Today especially", "score": 1, "replies": []}]}, {"body": "a word of caution to all: \n\n it's easy to win when the market is going up most every day like it has since November.\n\nthe market is a cruel teacher. be careful. don't assume these crazy-expensive stocks will stay that way.\n\nit's great to see many new people getting involved and learning. you WILL lose money. just don't let it be ALL your money.", "score": 2, "replies": []}, {"body": "After hours ARCT...ouch", "score": 1, "replies": [{"body": "Yes, this one is going to be my first true loss in several months. Will be assigned by 200 shares most likely. I still have 3 weeks until expiration, but what I will end up doing is hold the shares and try to sell the February covered calls once I am assigned.\n\nMy break-even price will be around $88 per share, so if the ticker gets a bounce in the coming days and I can sell the $80 strike covered call after assignment I might be happy with that. I read about the trial and the data doesn't seem to be that bad from what I've read, but I'm no expert.\n\nRight now it's sinking on extremely light volume. 100 lots are bringing it down 3-4% at a time, pretty crazy. Potential dip buyers might come in tomorrow on bigger volume and provide some cushion. Let's see. I'll be monitoring this at the open and post an update to a thread on my profile.", "score": 2, "replies": [{"body": "This stock reminds me why I stay away from pharmaceuticals.", "score": 1, "replies": []}]}]}, {"body": "thank you for this, very useful to a beginner. q.. do you do this full time? and do you beat spy?", "score": 1, "replies": [{"body": "I don't do it full time. I've about doubled SPY since April which isn't really realistic enough of a timeframe to go by. Im aware of that.", "score": 4, "replies": [{"body": "right on man. trying to figure out if learning how to do all this stuff is worth it for me", "score": 1, "replies": []}]}]}, {"body": "Yo, CRM support has a major support at 215, if it dips below there and cant hold its fucked and I'm exiting all my positions.\nBut I'm really bullish on it. I got heavy resistance at 234, then 235, then 240, and then the 50sma. The 50 is going to be a tough hurdle after we break those levels of resistance, I'm expecting to reject before moving upwards there.", "score": 1, "replies": [{"body": "We'll see. Its been in the same range for so long now. I'm feeling a breakout", "score": 1, "replies": [{"body": "I cut some febuary positions today, CRM needs refain the 61.8 Fib support at 225 again soon if you want to see that breakout before january. I'm not sure if you're new but stocks trading under the 50sma usually need to get above that to break out", "score": 1, "replies": []}]}]}, {"body": "Take a look at $viac", "score": 1, "replies": []}, {"body": "Can you help me understand what support/resistance means in this context or recommend some reading on it?\n\nThanks.", "score": 1, "replies": [{"body": "Support generally means a price that a stock usually bounces off of. So if you look at CRM’s 1 month chart, you’ll see that when it hit $220 or close to it, it bounced up. Resistance is the opposite and it’s a price that a stock is unable to break to the upside.", "score": 9, "replies": [{"body": "Got it, thank you", "score": 3, "replies": [{"body": "Np!", "score": 3, "replies": []}]}]}, {"body": "It's my theoretical levels where I think we would find buyers of a stock. Like if Apple dipped to $110 again it would be a dip buying opportunity", "score": 5, "replies": []}]}, {"body": "LOL", "score": -13, "replies": [{"body": "Upvoted for justice", "score": 2, "replies": []}]}, {"body": "Ostk is flaccid", "score": 1, "replies": [{"body": "Indeed. My puts are ITM but still above my break-even share price. It would need to drop mid-40s for me to really lose a lot on the position.\n\nMy break-even share price is around $52.\nIf it drops to $48 I can sell the $52 CC until assigned which would still have me come out profitable.\n\nIf it drops to low or mid $40s I need to lower my CC strike which would then put me at risk for closing negative. However, the stock would need to drop 25-30% for me to come out negative that is pretty good risk management IMO.\n\nHolding calls and stock drops 30% = you are fucked\nHolding shares and stock drops 30% = you are fucked\nSelling puts and stock drops 30% = you are *less* fucked", "score": 2, "replies": [{"body": "It just amazes me how shit this stock moves. I’ve been in it since oct 30 and never seen more than 10% up. Rolled my put out today for more premium. Sold 1/8/21 $54.5p for like $300, bought at $400 ish. Sold a 1/15/21 $55p for $600 ish today. I’m banking for a trend reversal because it’s hitting 3m lows if it breaks $50. Broke through support levels at this point so I hope to see a rapid recovery but this stock just seems to love eating shit. I’m way happier holding a sub-$50 break even than above with the way it’s headed rn", "score": 1, "replies": []}]}]}, {"body": "Crsr is also on sirjacksalot's radar. I think he is bullish tho?", "score": 1, "replies": [{"body": "I am bullish on CRSR. By selling puts I am bullish on the stock.\n\nSirJackALot is a legend. I saw his post last week haha", "score": 2, "replies": []}]}, {"body": "is there anyway you could dumb this post down? I'm fairly new to investing still and barely understood what I just read sadly", "score": 1, "replies": [{"body": "Is there anything specific you don't understand?", "score": 2, "replies": [{"body": "Well, I understood Blue lines but what does the Pink lines mean exactly? What is theta? And what do you mean by selling multiple spreads? What else do you prefer to look at specifically when researching stocks when trying to decide whether you'll buy the stock?", "score": 1, "replies": []}]}]}, {"body": "I really like the PLTR play. I was going to look for a dip and purchase more shares. Looks like I’ll selling some puts instead. Thanks!", "score": 1, "replies": [{"body": "Sellings puts at a discount today too. Not a bad entry.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What if you roll down and out until February? Might be able to cushion the blow a little. It's a little late though since expiration is this week for you.\n\nI opened $210 put this morning.", "score": 1, "replies": [{"body": "Thanks.  Going to take that approach to have a break even or a smaller loss .  Tempted to open a $210 this morning but was trying to figure out the best one to handle the $250 exp this week .  Good luck to you . Thanks for sharing all the plays .", "score": 1, "replies": [{"body": "No prob my man", "score": 1, "replies": []}]}]}, {"body": "I wouldn't take the loss.  Either assign it or roll it to a future week.  Or take a partial loss and sell more puts at a lower strike at a future expiration to make up the difference.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I like shorter rolls but that's just me....lots can happen by summer. I would wait until Thursday (remember markets close at 1pm) and then make your move.  If you roll further out, yes you'll get a credit.  Or if you are willing to take on more risk, roll shorter and sell some new puts at a lower strike.  Of course this is risky if the stock does go lower as you're out even more.  If you aren't willing to take on additional risk, I would roll it far enough out to break even on it.  You can also take a partial loss (while selling some puts) and then buy some shares in hopes it goes back up for a profit.", "score": 1, "replies": []}]}]}]}, {"body": "You are awesome. Did some pltr put and day trade it for 45%.... i got paper hands. I think it will go down a bit more but didnt want to risk it", "score": 1, "replies": []}, {"body": "Are you still holding Overstock (OSTK)? The puts have gone done significantly since you (we) bought? Are you planning to get assigned?", "score": 1, "replies": [{"body": "Still holding these. Currently have 4 puts sold which will bring me to an average cost-basis of around $52 if assigned. I will continue to hold since they have a few more weeks until expiration.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, this one is going to be my first true loss in several months. Will be assigned by 200 shares most likely. I still have 3 weeks until expiration, but what I will end up doing is hold the shares and try to sell the February covered calls once I am assigned.\n\nMy break-even price will be around $88 per share, so if the ticker gets a bounce in the coming days and I can sell the $80 strike covered call after assignment I might be happy with that. I read about the trial and the data doesn't seem to be that bad from what I've read, but I'm no expert.\n\nRight now it's sinking on extremely light volume. 100 lots are bringing it down 3-4% at a time, pretty crazy. Potential dip buyers might come in tomorrow on bigger volume and provide some cushion. Let's see. I'll be monitoring this at the open and post an update to a thread on my profile.", "score": 1, "replies": []}]}, {"body": "Just reading through and check ARCT and it's tanking, what happens in this situation with CSP?", "score": 1, "replies": [{"body": "Yes, this one is going to be my first true loss in several months. Will be assigned by 200 shares most likely. I still have 3 weeks until expiration, but what I will end up doing is hold the shares and try to sell the February covered calls once I am assigned.\n\nMy break-even price will be around $88 per share, so if the ticker gets a bounce in the coming days and I can sell the $80 strike covered call after assignment I might be happy with that. I read about the trial and the data doesn't seem to be that bad from what I've read, but I'm no expert.\n\nRight now it's sinking on extremely light volume. 100 lots are bringing it down 3-4% at a time, pretty crazy. Potential dip buyers might come in tomorrow on bigger volume and provide some cushion. Let's see. I'll be monitoring this at the open and post an update to a thread on my profile.", "score": 1, "replies": [{"body": "Well, I've been following you for a bit and will be using your strategies. This one is hard to imagine since it came out of not terrible news. Do you think you'll get assigned before the expiration date? I have gotten burned on pharmaceutical stocks before so options of pharmaceutical stocks scare the shit out of me. Best fortunes to you.", "score": 1, "replies": [{"body": "At this point it is quite possible I am assigned before expiration, but they would still be doing me a favor if the did execute early assignment. My options will still have some extrinsic value to make it worthwhile for them not to execute the contract. Either way I will monitor what Cathie Wood does with ARKG and if they purchase more shares tomorrow. That will be the best indicator for myself.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Stung me right in my right cheek. Will manage this position and post updates to my profile.", "score": 1, "replies": []}]}]}
{"title": "Elon in 2014: “I feel confident that we will be able to achieve at least half a million cars a year by 2020” ; Tesla in 2020: [on track to achieve 500k deliveries]", "selftext": "", "id": "kl7s8g", "created_utc": 1609091116.0, "score": 484, "upvote_ratio": 0.99, "num_comments": 99, "comments": [{"body": "i’m starting to think this guy’s even smarter than we give him credit for", "score": 69, "replies": []}, {"body": "One million in 2021, 1.8 million in 2022.... 20 million in 2030.\n\nThis is the S curve Elon keeps talking about. Even if Tesla doesn't achieve half million in 2020, when they hit 1 million in 2021, then the 2020 miss doesn't mean anything. Always pay attention to the big picture.\n\nThis is one of the reasons why shorts failed miserably, not because they are wrong with quarterly predictions.", "score": 73, "replies": [{"body": "Yup. the super insane bull case has tesla growing at 30-50% per year, when in reality it may be more like 70-100.", "score": 9, "replies": [{"body": "What's really insane is that the math is simple, it's all written on the wall. I have no idea why Wall ST analysts can't understand it.\n\nTesla is preparing huge growth in the next few years with super high margin. Why? because 30% margin is the last bullet on the incentive package. They can achieve it.", "score": 7, "replies": [{"body": "I am starting to think that warren redlich's insane bull case might be less insane than we think.", "score": 5, "replies": [{"body": "Every stock has it's own risks, but Tesla's most likely case is 20 million autonomous EV per year. Elon said each FSD worth north of $100k. I agree with him.", "score": 3, "replies": []}]}, {"body": "It's good to sandbag it a bit so we overdeliver imo. The execution risk is still there but will be dope to blow past forecasts. We all know the actual numbers which is what matters.", "score": 2, "replies": []}]}]}, {"body": "This is porn for a growth investor, as you can watch the value guys complain about trailing #s while revenue is about to go VERTICAL, lol. Silly 🐑 baaaaa.", "score": 3, "replies": []}, {"body": "How do you expect 1million next year with giga berlin and texas starting production at the end of the year? Ok china is adding a 3rd shift and starting with Y buy you can’t expect doubling sales next year without two new gigafactories running full speed...", "score": 13, "replies": [{"body": "don't forget that covid took a big chunk of the deliveries for this year. Without covid and everything else being equal its would be more like 600k, but everything else isn't going to be equal.", "score": 17, "replies": []}, {"body": "How long did it take Giga Shanghai to start production? One year. \n\nMy estimate does not include Berlin and Texas. \nGiga Berlin and Texas suppose to set new speed record. First time is usually the hardest, subsequent productions lines easier and faster.\n\nGiga Shanghai alone is expected to produce 0.5m in 2021, half 3 half Y.\n\n2021 and 22 will see huge #vehicle jump.", "score": 11, "replies": [{"body": "Fremont \"capacity\" is about 500k. So between Fremont, Shanghai and Berlin and Texas in the 4th quarter 1m doesn't look that absurd.", "score": 20, "replies": []}]}, {"body": "Model Y is both cheaper and faster to build, thanks to giga casting. Shanghai will be the clutch to 1M production.", "score": 9, "replies": [{"body": "Compared to the 3?", "score": 2, "replies": [{"body": "Model Y with the big die casts is easier to build than 3, S, or X. Literally the easiest vehicle Tesla will make until Model 3 goes big die later, then it'll be a virtual tie between future 3 and future Y.\n\nBut for now model Y will be pumped out faster than 3.", "score": 5, "replies": [{"body": "I also think the 2 piece casting makes a huge difference in speed. \nI think I read somewhere that the model 3 in comparison has over 70 pieces", "score": 1, "replies": []}]}]}]}, {"body": "Yeah I can believe we will grow more than 50% next year but not 100%. Hope I'm wrong tho", "score": 17, "replies": [{"body": "\\~800k in 2021. +/- 5%. \n\n20M rate hit between 2030-2032.", "score": 9, "replies": []}, {"body": "Q4 2020 run rate is 180k to be able to hit 500k for the 2020 full year. So 4*180k is 720k, that's the 2021 base. They only need to increase 39% next year to hit 1m in 2021.", "score": 4, "replies": [{"body": "RemindMe! 1 year", "score": 2, "replies": [{"body": "I will be messaging you in 1 year on [**2021-12-28 00:12:03 UTC**](http://www.wolframalpha.com/input/?i=2021-12-28%2000:12:03%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/teslainvestorsclub/comments/kl7s8g/elon_in_2014_i_feel_confident_that_we_will_be/gh8ju4w/?context=3)\n\n[**5 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fkl7s8g%2Felon_in_2014_i_feel_confident_that_we_will_be%2Fgh8ju4w%2F%5D%0A%0ARemindMe%21%202021-12-28%2000%3A12%3A03%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kl7s8g)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "RemindeMe! 1 year", "score": 1, "replies": [{"body": "**neurophysiologyGuy** , kminder on [**28-Dec-2021 02:19Z**](https://www.reminddit.com/time?dt=2021-12-28 02:19:54&reminder_id=233f4bd3adc94863982f1dca0a138bde&subreddit=teslainvestorsclub) (1 year)\n\n> [**teslainvestorsclub/Elon_in_2014_i_feel_confident_that_we_will_be**](/r/teslainvestorsclub/comments/kl7s8g/elon_in_2014_i_feel_confident_that_we_will_be/gh8y6qq/?context=3)\n\n[**1 OTHER CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202021-12-28T02%3A19%3A54%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fteslainvestorsclub%2Fcomments%2Fkl7s8g%2Felon_in_2014_i_feel_confident_that_we_will_be%2Fgh8y6qq%2F) to also be reminded. Thread has 2 reminders.\n\n^(OP can )[^(**Delete comment, Set timezone, and more options here**)](https://www.reminddit.com/time?dt=2021-12-28 02:19:54&reminder_id=233f4bd3adc94863982f1dca0a138bde&subreddit=teslainvestorsclub)\n\n**Protip!** My boss is unpleasant, arrogant, and ignorant. I'm BURNING on fumes. [Fuel ME](https://paypal.me/reminddit)\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Fuel Me](https://paypal.me/reminddit)", "score": 1, "replies": []}]}, {"body": "Exactly. Model Y on Shanghai is set for 250k/year, it just depends how long they need to get to that. Plus some number of vehicles from Berlin and Austin this year and it could definitely break 1M. A lot of things have to go right, notably cell production, but it's possible for sure", "score": 1, "replies": []}, {"body": "So, how we going?", "score": 1, "replies": []}]}, {"body": "That's where I'm at too", "score": 3, "replies": []}]}, {"body": "Even if it is 850 thousand, it would still be mindblowing growth, especially combined with 1.6-1.8 million in 2022. The PE ratio will keep being forced to smaller numbers and the stock will have no way but up.", "score": 4, "replies": [{"body": "My initial thesis in 2017 was that if Tesla grew revenue at 50% for a long time, the stock would also grow at that rate on average.  I even did a “conservative “ spreadsheet assuming 30% annual growth of my investment and was beyond excited at what that would mean!  Needless to say the actual stock rise has put me way ahead of that pace:-)", "score": 1, "replies": []}]}, {"body": "run rates of 500k in CA, 2-3 month ramp-up for the MIC Y to a run rate of 500k, and the first few units from germany and maybe texas. possibly some vehicle production from nevada. 1 M is not certain, but is within the range of possibility.", "score": 1, "replies": []}, {"body": "Tesla is already at a 750k annual production rate.", "score": 1, "replies": [{"body": "Is the rest of the supply chain ready? And the delivery centers? And the SC for repairing all the crap that goes out from a plant that is definitely struggling already?\nHaving the machines to do 750k is different than  being able to do it...", "score": 2, "replies": [{"body": "What are you talking about?  Of course all that’s in place.  Tesla has already produced and delivered 180k+ vehicles this quarter.  185k*4 = 740k / year rate.", "score": 1, "replies": [{"body": "Can they sustain this in the long run? And are they scaling up after services in order to maintain this exponential growth? If you have to wait 2 months for repairs due to crappy assembly I don’t know if they will still have the same high demand as now...\nDon’t get me wrong I’m in love with these cars and patiently waiting to order one, when my bank account will allow me but also when they will figure quality as well...", "score": 1, "replies": [{"body": "Tesla has grown on average 50% / year.  Obviously they’ve figured out how to do it since the brand is #1 in Customer Satisfaction which is the overarching metric that measures everything including the categories you named.", "score": 1, "replies": []}]}]}]}]}, {"body": "Model 3 CN is now at full run rate so will massively increase numbers. Y will be easier to ramp because there is much similarity with the 3. Fremont has actually done a higher run rate at the end of the year which will lead to higher production through the next year. 520k units out of Fremont, about 250k Model 3 out of Shanghai plus probably around 130k Y already gives us 900k. It won't be easy but 1M is possible if Berlin and Texas ramp up early enough.\n\nThey'll guide for at least 800k I think.", "score": 1, "replies": []}]}]}, {"body": "Amid a global pandemic.", "score": 30, "replies": []}, {"body": "When Berlin and Texas come online I wonder if we can break 1 million in 2021", "score": 13, "replies": []}, {"body": "yeah, about that.... he later “accelerated it by two years”, but was late two years, which cancelled it out, but almost bankrupted the company. Well, glad they made it.", "score": 12, "replies": []}, {"body": "Lazer focused bullseye. 🎯", "score": 6, "replies": []}, {"body": "Imagine if Elon didn't tell us at all about FSD. One day he is like bammm every Tesla now drives itself.", "score": 4, "replies": [{"body": "I think it would fall apart then.\n\nIt take some time for the AI to learn. And he needs our data to teach that AI.", "score": 3, "replies": []}]}, {"body": "Reposting b/c I don’t think the OP was tactful in his presentation, but brings up a valid point.\n\nhttps://www.reddit.com/r/teslainvestorsclub/comments/kl7s8g/comment/gh7dsje\n\nHow does everyone here weight Elon’s comments, especially wrt timing, since he is often “optimistic”. Some TSLA investors I respect the most do not assign much weight at all unless it is in an official company filing, and these people have almost all their wealth invested in TSLA\n\nI like conservative Elon, and I would hope the community would reinforce conservative estimates. To be clear, Elon can still clue us in to cool developments, but I want to trust what he says for the time being I have to be very careful in doing so.\n\nThoughts?", "score": 3, "replies": [{"body": "Predicting the accuracy of Elon’s future statements is very tough indeed.  As an investor you just have to hold on because even his misses still end up with him far outpacing the rest of the industry.", "score": 1, "replies": []}]}, {"body": "Was at 420 upvotes - sorry I upvoted to make it 421", "score": 3, "replies": []}, {"body": "this is very cool to watch in hindsight.", "score": 2, "replies": []}, {"body": "Under promise, over deliver, vertically integrate when vendors can preform, attract all the best talent.  Well done.", "score": 1, "replies": [{"body": "Except when it comes to FSD timelines lol", "score": 3, "replies": []}]}, {"body": "Not sure why you would chose a quote from 2014 instead of the more recent one from 2017\n\n>\tWhat people should absolutely have zero concern about, and I mean zero, is that Tesla will achieve a 10,000 unit production week by the end of next year.\n\nAnd that was just for the 3 with one factory.\n\n2014 is irrelevant since they reset expectations, spent more money, raised more money based on the new goal.\n\n\nhttps://futurism.com/elon-musk-has-zero-doubt-tesla-can-achieve-10000-units-per-week-by-2018", "score": -18, "replies": [{"body": "🤡", "score": 10, "replies": []}, {"body": "I think the idea is that even from 2014 Elon had a roadmap which they've managed to stick to really well.", "score": 6, "replies": [{"body": "Sure.  But if they didn't re-set the roadmap, and raise money and spend money, and build an additional factory, to hit the new roadmap, hitting the original plan seems irrelevant.", "score": -4, "replies": [{"body": "I read your comments and feel really sad for your life. Honestly.", "score": 0, "replies": [{"body": "Maybe you should direct your comments against idea rather than against people.  That would be more productive and civil.\n\nJudging someone’s life based on anonymous comments in one or two subs is odd to say the least.  You haven’t even seen my comments in other subs under a different name.", "score": 0, "replies": [{"body": "Maybe you should stop trolling in a sub where no one wants you; maybe that would be more civil?", "score": 1, "replies": [{"body": ">\ttrolling here\n\npointing out the last prediction for hitting 500k in a thread about a much older prediction is considered trolling?  Funny\n\n>\tno one wants you\n\nConsidering all the upvotes I have gotten here, your assertion is incorrect.", "score": -1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "There you go again attacking the person rather than the ideas put forth\n\nThat is a sure sign that you can’t refute the ideas", "score": 2, "replies": []}]}]}]}]}]}, {"body": "How so? \nTesla's growth rate is increasing .. and that's the bottom line. \n\nI said rate % and not production number x", "score": 1, "replies": [{"body": ">\tI said rate % \n\nWhere did you say rate % ?\n\nWhether or not a company is growing in absolute or percentage terms, doesn’t mean that a prediction made 6 years ago is relevant when there was an updated prediction, and the spending, new factory, money raising , etc just 3 years ago.", "score": 0, "replies": [{"body": ">Where did you say rate % ?\n\nIn my own comment. I said \" Tesla's growth rate has been increasing\" \n\n\n\nI do see your point though. I just don't think it matters when your company is growing to the rates you originally blindly predicted without an actual game plan. \n\nBut i agree with what you said from your point of view. \n\nHe may also make wild predictions now, without an actual plan, even if he delivers eventually, this doesn't validate his prediction. I think I get you now, right?", "score": 1, "replies": [{"body": ">\tin my own comment\n\nOk, I thought I missed an earlier comment \n\n>\ti get you know, right?\n\nYeah, close enough. \n\nThe other part of it is not just the time delay, but the level of effort and funding that is required. \n\nAlthough that is water under the bridge, it should be instructive when the next prediction rolls around and people assess the capital, expense and time required \n\n(Winking at you 2017 FSD coast-to-coast trip )", "score": 1, "replies": [{"body": "I agree .. \n\nOn a personal level though, i don't personally invest in Tesla because of those promises. I ignore them. I only look at what we have at hand and, as a customer also, i get to see where this is heading first hand. Judging all this growth after ignoring everything Elon said, I'd still put my money on it.", "score": 1, "replies": [{"body": ">\tjudging all this growth after ignoring everything Elon said, still put my money on it \n\nThat is a good approach, but confusing.  I can’t see how one can invest at these levels based on their growth and performance - one would seem to need to believe in a heck of a lot more (robot axis, fsd, trucks, many new models, lack of competition, etc) to hold the stock and not bail out long ago. \n\nI am just the opposite.  I have invested in Tesla not because of the growth or the product, but because of the hype. I remember the JDSU and CSCO days and how trading options in INTC was like printing money...until it wasn’t.", "score": 1, "replies": [{"body": ">(robot axis, fsd, trucks, many new models, lack of competition, etc)\n\nI don't think robo taxi will become a thing.. not in the next 10 years. Or FSD for the next 5. \nBut i don't think these are reasons to bail on the stock/company. \n\nTesla truly has a potential of changing the world, and how we look at energy and transportation. I think those changes are happening with seeing every industry competing to make an EV. Solar panels become more and more a normal thing .. these are all Tesla's doing. I think this simply continue to make more sense over the alternative. Tesla is building the infrastructure and the product at the same time.", "score": 1, "replies": [{"body": ">\tpotential for changing the world. \n\nThey have certainly popularized the expensive EV, but I believe the world is changing due to government penalties.  \n\n>\tevery industry competing to make an ev\n\nSince Tesla’s market cap is about the same as all other major OEMS combined, one would have to believe they will all fail. \n\nSolar has long been a commodity, long before solar city, and it doesn’t appear that Tesla has any cost or tech advantage. \n\n>\tbail on the stock\n\nThe average SP return is around 10 percent a year, so you would have to believe not only that the company will grow into its current valuation - greater than all other OEMs combined,, but also growing another 10 percent a year, in order to break even vs an index fund.", "score": 2, "replies": [{"body": ">you would have to believe not only that the company will grow into its current valuation - greater than all other OEMs combined,, but also growing another 10 percent a year, in order to break even vs an index fund.\n\nWhich I do believe it will", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "You realize your profile is public and that we can see that your activity is spent mostly on r/RealTesla...\n\nNothing you say means anything, true or false... Your main agenda by posting comments here is not to help investors. That's why you are getting downvoted.", "score": 13, "replies": [{"body": "It seems exceptionally close minded for people in an investor sub to downvote based on where a person has posted, rather than on the content of a comment which is a direct counterpoint to the post.  \n\nSome people like echo chambers I guess.", "score": -8, "replies": [{"body": "If it wasn't for the fact that r/RealTesla is a circlejerk of Tesla haters just promoting and upvoting negativity of Tesla, I would agree with you.", "score": 12, "replies": [{"body": ">\tis a circlejerk\n\nSays the guy who posts on Teslamotors.  Lol", "score": -5, "replies": [{"body": "This isn't r/teslamotors\n\nAlso my r/teslamotors history is around 1/25(4%) of my profile history. (46 comments) out of a total of around a 1000.\n\nWhile 2/3 (67%) of your profile history consists of r/RealTesla (662 comments and 10 submissions) out of a total of around a 1000 aswell", "score": 8, "replies": [{"body": "> This isn't r/teslamotors\n\nit isn't /r/realtesla either.\n\nYou post a lot on /r/teslamotors, so clearly \"your main agenda by posting comments here is not to help investors.\"\n\n> your profile history\n\nSo cute that you bothered to do a count without realizing that people can, and do, periodically delete posts and comments.", "score": 0, "replies": [{"body": "> So cute that you bothered to do a count without realizing that people can, and do, periodically delete posts and comments. \n\nYes, they do it when they have something to hide... which speaks to your person.\n\nBut I have grown tired of defending myself against... whatever it is you think you are attacking.\n\nSo I am just going to block you and end this for both our sake.", "score": 4, "replies": [{"body": ">\thave something to hide\n\nOr when someone tries to dox you based on your other posts in the gaming sub. \n\n>\tyou think your are attacking. \n\nNot attacking anything unless you think pointing out hypocrisy is attacking.  \n\n>\tgoing to block you\n\nOh no, what ever will I do...except keep posting that is?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I have never shorted TSLA.\nI have made a lot being long, however.  Will be selling in January when I can get the long term cap gain treatment.\n\n>\tmaybe I can help you out.\n\nI doubt you can, but thanks for the offer!", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Avoid personal comments", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "So this is why you post in Realtesla ? for the echo chamber ?", "score": 6, "replies": [{"body": "No, I post there since I am paid by BigOil and BigHydrogen to do so.", "score": -3, "replies": []}]}]}]}, {"body": "true thanks for mentioning this. I just crossposted it from r/elonmusk", "score": 0, "replies": []}, {"body": "so what are you trying to say exactly?", "score": 0, "replies": [{"body": "He prefers looking at missed 2018 predictions rather than likely met 2020 predictions. Not sure why.", "score": 1, "replies": []}]}, {"body": "The relevance is that he was able to accurately predict and follow through on the 2020 target while still a whopping 6 years out. That is impressive.", "score": 0, "replies": []}, {"body": "Tesla wisely pivoted from the initial plan to produce 10k / week at Fremont by pulling forward Giga Shanghai plans.  So we ended up in an even better situation than his goal.\n\nSo thanks for bringing up an example of an audacious goal that Tesla actually pivoted from to provide a superior plan.\n\nGenius PLUS flexibility provides AMAZING results.", "score": 1, "replies": [{"body": "How is it superior to wait two years, and spend more money on a new factory to hit the same 500k target?  \n\nIsn’t spending less money to get more money in the door earlier a better plan?", "score": 2, "replies": [{"body": "Which part confused you?\n1) They always planned a Chinese factory.  It wasn’t added because Fremont was unable.  It was accelerated.\n2) No spending more money earlier was not smarter.  China sales are exploding and the CapEx / unit is 1/3 per unit that of Fremont+Reno.\n\nHave you been talking to the bears who only focus on the present quarter and past quarters and don’t realize it’s the years ahead that matter?  I almost feel sorry for them. Poor idiots of lost a fortune. All from not knowing how to look forward.", "score": 1, "replies": [{"body": ">\tthey always planned to have a Chinese factory\n\nIt was not planned to be in production to have them hit the 10k/week rate in 2018.\n\n>\thow to look forward\n\nPeople should apply that idea to the entire industry, not just Tesla.  Everyone will have ev offerings.", "score": 1, "replies": [{"body": "I know the China giga factory was not planned to be in production by 2018. If it were planned by 2018 initially then that would not be pulled forward as I described.  That’s exactly what pulled forward means. Have you never heard the term pulled forward? Did you somehow not understand my basic sentence construction?\n\nOr is it that you don’t know what the word “pivot” means?  As in they changed plans after Elon’s initial 10k/week Fremont goal.\n\nDo you have some weird idea that companies should never pivot or change direction?", "score": 0, "replies": [{"body": "I understand that they changed direction.\n\nTheir direction was to produce 10k/week of the model 3 by 2018 with one factory, they changed that to deliver fewer cars in 2018 and 2019 and maybe hit that goal in 2020.\n\nPivoting to produce inferior performance is not something to be proud of.", "score": 1, "replies": [{"body": "Wow.  Math much?  Tesla will hit 15k / week in 2020.", "score": 0, "replies": [{"body": "Wow,   Reading comprehension much?  They were supposed to do 10k/week of just the model 3 in 2018 with one factory. \n\nYou believe they will do 15k/week of just the model 3 in 2020??", "score": 1, "replies": [{"body": "Good point.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Why is this even a news??? Toyota sold 10 million cars last year. That’s is 9.5 million more cars sold than Tesla in 2020.", "score": -16, "replies": [{"body": "This isn't a serious comment, right?", "score": 11, "replies": [{"body": "Troll user", "score": 8, "replies": []}]}, {"body": "How many EVs did Toyota sell? Oh right, 0....", "score": 9, "replies": []}, {"body": "How many cars will Toyota sell in 2030 vs Tesla's sales? Factor in the banning / disincentives for ICE. From where they are today, dou you want to own a stonk that's going up or one that's going down?", "score": 5, "replies": []}, {"body": "It’s an investor’s forum and wise investors know to look forwards and not backwards.\n\nWe’re you unaware that investing by looking backwards is foolish in the extreme?", "score": 1, "replies": []}]}]}
