{"title": "[deleted by user]", "selftext": "[removed]", "id": "kbi3qo", "created_utc": 1607744797.0, "score": 158, "upvote_ratio": 0.94, "num_comments": 92, "comments": [{"body": "Picked up my Model 3 yesterday. This thing is a spaceship... now my car and my calls are ready for the mars mission", "score": 82, "replies": [{"body": "I am stuck in a weird spot where I really want a Tesla, but I know how much money I will miss out on by not stuffing that money into stocks and leaps.  I did pre-order a Cyber Truck to lock in FSD at 8K. I figured that was a middle ground, but still.", "score": 9, "replies": [{"body": "Sometimes you don’t know when you’re gonna die.\n\nI’m glad I’m enjoying my Tesla these past couple years... what a waste it would have been to keep driving the Prius I had before.\n\nWith interest rates this low... just do it and the happiness will keep compounding as your investments do as well. You can have moderation both ways.", "score": 7, "replies": [{"body": "Yeah I sold some tesla to grab a m3. Stock has gone up a lil but haven’t felt one ounce of fomo. Its such a fun car to have, every-time I close the door and walkaway I take a peek at it and smile.", "score": 6, "replies": []}, {"body": "This. Always do something with gains. Because if you keep waiting until you have enough. You will never have enough. Once I made 20k in a day and had a 10k debt. I thought what about just waiting till I get 50k then taking out 10k. Lol that 20k was gone so fast. Lol I still paid it off eventually but that can be you.", "score": 1, "replies": []}]}]}, {"body": "money bags over here. Im still trying to build my first stacks.", "score": 1, "replies": []}]}, {"body": "That's between 25 and 50bn worth of car sales. \n\nWhich is nice that that's less than 1/10th of their market cap.", "score": 98, "replies": [{"body": "Are you saying it’s over valued?", "score": 63, "replies": [{"body": "[deleted]", "score": 77, "replies": [{"body": "That’s the correct answer!", "score": 35, "replies": [{"body": "Unpopular opinion, investors who have made a few mints of this stonk need to be buying a new tsla twice a year and selling at a slight discount twice a year. It's not good that they're so greedy, most probably don't even own a tes.\n\nThose apple vestors buy every gen iphone, macbook, etc. etc. and I guess they donate the year old model.", "score": 17, "replies": [{"body": "I'm bullish on aapl because I think their business practices are bullshit price gouging and gaslighting. Of course they make money because if it.", "score": 22, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Fight for isn't exactly right. They've chosen it as an avenue to differentiate and also bake it into the price.\n\nYou'll continue to pay for that premium", "score": 17, "replies": [{"body": "Well, it’s why I’ll continue to buy iPhones.", "score": 2, "replies": [{"body": "Oh yah I'll pay as well.\n\nIt'll be a new extra premium for all sorts of things.\n\nIt's Samsung versus Apple\n\nYou'll pay for the premium, I will.", "score": 2, "replies": []}]}]}, {"body": "Except Apple is a part of NSA’s PRISM program, and they also got caught letting humans listen to your Siri recordings without consent, and the latest macOS Big Sur update bypasses VPN for apple’s own apps.", "score": 13, "replies": []}, {"body": "Apple don't make money from stealing peoples data.  \n\nGoogle,  Facebook,  amazon all make a lot of money streaming people's data.  \n\nIf apple can cut off those revenue streams for their competitors they can dominate the tech industry even more.  \n\nThey will fight for data privacy because it helps them.", "score": 4, "replies": [{"body": "Trackers for advertisers wasnt what I had in mind \n\n\nhttps://en.m.wikipedia.org/wiki/FBI–Apple_encryption_dispute", "score": 2, "replies": []}]}]}]}, {"body": "Im holding out for a cybertruck. Just hoping my X5 survives until then", "score": 2, "replies": [{"body": "I'm currently shopping around for a luxury suv, for something in the meantime before the next car will be electric. Going for the least depreciation and lowest apr financing. \n\n2 years from now, there should be 10 electric suv/truck options.", "score": 1, "replies": [{"body": "I just picked up a jaguar f pace to get me by til I get my cybertruck.", "score": 0, "replies": [{"body": "Girls sure as hell like the outside appearance of an f pace obviously, which is good if you're a single guy.\n\nPrice, year, miles, s?\n\nUsed they seem high in price considering the stigma of jaguar. They should be CPOing everything to get them out there on the road. Plus it doesn't look good that most are sitting on carguru for MANY months at a time. The fact they aren't selling on there and you won't find one with more than 80k makes makes me a bit reluctant.\n\nSurprisingly the volvo xc90 there's a few on there with well over 100k miles which is a good sign but also they aren't moving.\n\nThe one that doesn't seem to last long online is the 450h.. all the good deals are gone quick on em.", "score": 2, "replies": [{"body": "2017 35t prestige. 21k miles. I did a lot of shopping around and decided on the jag over audi or Mercedes mostly because they aren't as common and I like the interiorof the jaguar. \n If you're buying pre owned you should check out carvana they had a better selection of low miles vehicles often for about 20k less than local dealers.  Paid 36 with the extended warranty", "score": 1, "replies": []}]}]}, {"body": "Ah. In my experience, the luxury suvs lose value pretty quick..\n\nYou could get a 4runner, they're pretty sweet and cool looking, but def not luxury. I dunno how much you wanna spend, but a new Navigator is around 100k and they're fucking awesome. Or maybe something like a decked out Tahoe or Denali\n\nIf you're wanting something smaller, the new BMWs are pretty cool, but won't hold value.. same with the Audi SUVs..\n\n*** I just looked and this is the second time we've had a back and forth in the last 12 hours.. haha, weird coincidence\n\nAlso, Im sure someone here would have a lot better input on a new SUV than I would. I havent shopped around for a bit", "score": 1, "replies": [{"body": "I couldn't find it. Was it along the lines of P L T R to $50?\n\nReally want to try something luxury after it's already lost of it's devaluation.\n\nLeaning towards a 15 cayanne turbo, 50k miles, 2 years cpo, for $50k - originally 120k. I'd go this route if it's not going to be $30k in two years.\n\nOr something for half of that that's more of a throw away\n\n17 xc90 fully loaded for $25k\n\nLooked at the f pace but it's seems a bit junky.", "score": 1, "replies": [{"body": "Ah, I gotcha. Yea I bought my X5 used.. I saw an 18 model at a local dealer with 30k miles for 32k. It was super nice,  but itll maybe only be worth 20k in 2 years if you don't stack a shitload of miles on it.\n\nCarGurus is a great site to use.. as well as just checking out local dealerships to see what they've gotten for trade ins\n\nAlso, my experience with BMW service and support has been top notch. They gave me a brand new one to drive around when my last car had a recall. They picked up my car at work and left a new one sitting in the parking lot\n\nI know I'm really shilling for BMW, but after owning one, Ill always have one. Drives unlike any other car I've driven, and I've driven a lot of sports cars", "score": 1, "replies": [{"body": "Probably biased comments but many say that bmw doesn't hold a candle to porsche in terms of quality interior and in general...", "score": 1, "replies": []}]}]}]}, {"body": "land cruiser", "score": 1, "replies": [{"body": "I honestly have no idea how or why these things cost as much as they do", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Majority of investors are in for 20 year time frame imho", "score": 4, "replies": [{"body": "The average TSLA investor has the attention span of Biden.  As soon as the next big thing comes out, TSLA will shrink.", "score": 4, "replies": []}]}]}, {"body": "The fucking P/E ratio has to be written in scientific notation just to read it but this stock refuses to give a fuck", "score": 33, "replies": [{"body": "P/E ratio is the stupidest indicator ever, it only works for shit that doesn’t grow. Basically the boomer ratio. The Lower P/E the more boomer bagholders.", "score": 26, "replies": [{"body": "Lol. Never heard that expression before.\nIts great!", "score": 8, "replies": []}, {"body": "Yeah it really is kind of out dated. The printers are running full speed ahead and people talim’bow P/E", "score": 5, "replies": []}, {"body": "You are using the price to empty promises ratio?", "score": 2, "replies": []}]}, {"body": "How retarded do you have to be to talk about P/E for a company that just broke profitability. A P/E of 1.23e45 is still better than a P/E of -10, in fact a P/E of -1.23e45 is miles better than than a P/E of -10. \n\nJust say that TSLA's P/S is 21.68, that's enough.\n\nNvidia has the second highest P/S in the entire SP500 and they're at 22.01, and you know Nvidia has 62% gross margin and 27% operational margin. Meanwhile Tesla sits at 9.2% operational margin. \n\nAverage P/S in the SP500 is 2.6, yeah no shit Tesla is overvalued at 21.68", "score": 2, "replies": [{"body": "I mean, your wife has a P/E ratio of -50 and I buy calls on that every night and let me tell you...they fucking PRINT", "score": -2, "replies": []}]}]}, {"body": "Time travel is already priced in", "score": 8, "replies": [{"body": "Both ways though?", "score": 1, "replies": []}]}, {"body": "My Feb 19 $600 c says otherwise.", "score": 7, "replies": []}, {"body": "Perceived value. Everyone's fucking loving it because Elon Musk was in an Iron Man movie once.\n\nTwo paintings if relatively equal skill have a price entirely dependent upon the fame and career of the artist, and sometimes, but not always, scarcity.\n\nTesla has more than double the market cap of Toyota, roughly *twenty times* that of Ford, roughly seven times that of Daimler, and I sure you get where I'm going with this.\n\nNoticeably, all of those companies *actually make money*, which is shocking I know, but they do.", "score": 3, "replies": [{"body": "https://en.wikipedia.org/wiki/Keynesian_beauty_contest", "score": 1, "replies": [{"body": "**[Keynesian beauty contest](https://en.wikipedia.org/wiki/Keynesian beauty contest)**\n\nA Keynesian beauty contest is a concept developed by John Maynard Keynes and introduced in Chapter 12 of his work, The General Theory of Employment, Interest and Money (1936), to explain price fluctuations in equity markets. It describes a beauty contest where judges are rewarded for selecting the most popular faces among all judges, rather than those they may personally find the most attractive.  \n\n[About Me](https://np.reddit.com/user/wikipedia_text_bot/comments/jrn2mj/about_me/) - [Opt out](https://np.reddit.com/user/wikipedia_text_bot/comments/jrti43/opt_out_here/) - OP can reply !delete to delete - [Article of the day](https://np.reddit.com/comments/k9hx22)\n\n**This bot will soon be transitioning to an opt-in system. Click [here](https://np.reddit.com/user/wikipedia_text_bot/comments/ka4icp/opt_in_for_the_new_system/) to learn more and opt in.**", "score": 3, "replies": []}, {"body": "Now I am waiting for someone to say:\n\n\"You fuels, I have reached the *seventh level* of Keynesian prediction.\"\n\nAnd then dump all their cash yOlo style on something really fucking dumb, because they think everyone else is that dumb, then it fails horribly.\n\nUntil someone reaches the *ninth level*....\n\nWhich is avoiding the stock market completely.", "score": 2, "replies": []}]}, {"body": "I am not going to touch on the assumption anyone who believes in Tesla is an idiot and is influenced by Iron Man and such. \n\nSince comparisons between Tesla and other car companies comes up a lot, let’s get into the perceived value. \n\nI am personally not concerned about the car part of Tesla. There are plenty of EVs and it’s really nothing new. From that perspective, the comparisons with other car makers changes, but it’s still in play. \n\nMy point of interest is how the cars are manufactured and how they are viewed and will be in the future. With the conversion with newer tech suck as IoT, BigData and AI a new approach is adopted to make products. With data extracted from products during and even after deployment, it is possible to run extensive simulation. AI is used to come with optimized designs and enhancements. Anyone handling design manually will always be at a disadvantage. \n\nWhen we start viewing cars as smart moving nodes that generate and use data, a whole new world of possibilities (lookup VW CEO’s definition of what his company should be). \n\nWhen you put the whole thing together, you can see that designing cars requires retooling and rethinking everything. You can’t just fit sensors and an electric motor any car to have a Tesla which was built from the ground up in the new way. \n\nIt’s been said Tesla was not car company. I think it is embodiment of the new way to manufacture products. Anyone can lookup: Fourth Industrial Revolution. Maybe Tesla will share its platform and become the AWS of manufacturing. Somebody making a smart fridge could use it. Why build from scratch?", "score": 1, "replies": [{"body": "Considering the amount of memes and propaganda relating those two, you'd be remiss to discount it entirely either. \n\nWhile you raise some very good points, manual design still takes into account aesthetics and the human factor which an AI might miss entirely.\n\nHaving driven the model S myself, it's a nice ride but ergonomically no that great and doesn't *really* compete with other cars in that price range.\n\nTesla has solve many problems and continues to solve many problems, but glaring weird spots like the glove box oddly tiny continue to arise, and that's something AI will continue to miss until it develops further.\n\nThe nebulous concept of feel which a computer currently just can't understand.\n\nStill, a lot of salient and relevant points in your post, thank you for posting them.", "score": 1, "replies": [{"body": "You're welcome.\nI am afraid AI is not to blame for aesthetic and ergonomic decisions. This is something that humans are very much involved in.\nI was referring to AI in the context of assisting in designing optimal a layout or shapes of components: https://en.wikipedia.org/wiki/Generative_design\nIn essence, you manufacturer could pass high-level design options and the AI will run a number of simulations that will optimize any number of factors: aerodynamics, wheelbase dimensions, braking distance, head room, etc.\n\nEverything can be tested within high accuracy using modern CAD software. The key thing here is to have data collected from actual cars driven on roads (in the case of a car company). This additional data can really augment the design to be the most optimum. If a product is not instrumented (cars not having sensors) the manufacturer is losing out on a lot. This is especially true when your competitor is capturing terabytes of data every day.\n\nOf course, add-on features can be developed such as self-driving, etc. For this, again, you need to be receiving data from the products.", "score": 1, "replies": [{"body": "**[Generative design](https://en.wikipedia.org/wiki/Generative design)**\n\nGenerative design is an iterative design process that involves a program that will generate a certain number of outputs that meet certain constraints, and a designer that will fine tune the feasible region by selecting specific output or changing input values, ranges and distribution. The designer doesn't need to be a human, it can be a test program in a testing environment or an artificial intelligence, for example a generative adversarial network. The designer learns to refine the program (usually involving algorithms) with each iteration as their design goals become better defined over time.The output could be images, sounds, architectural models, animation, and much more. It is therefore a fast method of exploring design possibilities that is used in various design fields such as art, architecture, communication design, and product design.The process combined with the power of digital computers that can explore a very large number of possible permutations of a solution enables designers to generate and test brand new options, beyond what a human alone could accomplish, to arrive at a most effective and optimized design.\n\n[About Me](https://np.reddit.com/user/wikipedia_text_bot/comments/jrn2mj/about_me/) - [Opt out](https://np.reddit.com/user/wikipedia_text_bot/comments/jrti43/opt_out_here/) - OP can reply !delete to delete - [Article of the day](https://np.reddit.com/comments/k9hx22)\n\n**This bot will soon be transitioning to an opt-in system. Click [here](https://np.reddit.com/user/wikipedia_text_bot/comments/ka4icp/opt_in_for_the_new_system/) to learn more and opt in.**", "score": 1, "replies": []}, {"body": "That leads to quite a few concerning issues. While I've driven a Model S, I don't own one. From what you're saying I gather there's a clause where Tesla says \"All your data is belong to us.\" and that real time data is gathered via BTB IOT or something.\n\nIs the data gathered by Tesla worth more than or equivalent to the cars they're selling?", "score": 1, "replies": [{"body": "Good question. I don't own a Tesla either. With any modern product, there is always a checkbox 'Can we use the data to improve your experience, etc?'\nI guess in the end, it's the data and the technology used to process it (usually some sort of AI) that makes a difference. If the product is improving then the desired outcome is achieved. As to the value of the data, only the manufacturer would know as they are the ones using it.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You guys are truly stupid. No shit TSLA is gonna be a 1.5T company by 2022 EOY", "score": 19, "replies": []}]}, {"body": "If only every car comes with a bottle of tequila, the demand would go through the roof.", "score": 38, "replies": []}, {"body": " \"Leak\" emails lol", "score": 29, "replies": [{"body": "If he blows up another rocket we can hit 750 eoy", "score": 11, "replies": [{"body": "Its gonna be a trillion dollar company in no time and Elon is gonna be the richest man alive (for a brief time)\n\nBezos was an idiot to divorce his hot wife in order to fuck a hooker, real expensive mistake too.", "score": 9, "replies": [{"body": "We don't always choose all our bad choices.\n\nI honestly believe that.", "score": 3, "replies": []}, {"body": "your reality is not jeff's reality. once you're worth a billion dollars, money ceases to be real. it's just numbers on paper. \n\nhe could literally burn 99% of his money to heat his house and the remaining 1% would still be 1.27 billion dollars.", "score": 1, "replies": []}]}]}, {"body": "Yeah fake leak in an attempt to fix their \"crushed like a souffle\" leaked email about their low profitability. \n\nElon was so scared of the Lucid Air eating their lunch that he had to undercut their price. Tesla wouldn't have to drop their price by $5,500 (8%) if they had a huge backlog of orders knocking down their door.", "score": 1, "replies": []}]}, {"body": "Tesla demand too high imo.", "score": 41, "replies": [{"body": "imagine lmao", "score": 16, "replies": []}]}, {"body": "Two Teslas in every garage", "score": 10, "replies": [{"body": "And beyond meat in every pot.", "score": 4, "replies": [{"body": "And my axe!", "score": 4, "replies": []}]}]}, {"body": "Damn, so many rich people around the world can buy them.  Imagine if all the wealthy lake of world own 2 or 3 Tesla’s.", "score": 21, "replies": [{"body": "[deleted]", "score": 40, "replies": [{"body": "75-80k for the model 3 in Australia. Base model without extras.", "score": 12, "replies": [{"body": "Damn that sucks. Can probably get a coal powered car for way less there.", "score": 5, "replies": []}, {"body": "I’ll ship you one from US. $50k + shipping", "score": 3, "replies": [{"body": "When I use the self driving option, it’s going to kill me when it starts driving on the other side of the road 😂", "score": 3, "replies": []}]}, {"body": "If it’s any consolation... electric bikes are super cheap and freaking amazingly fun.", "score": 1, "replies": []}]}, {"body": "Lmao who the fuck is downvoting this, srsly guys get a job", "score": 4, "replies": []}, {"body": "Cant buy a Tesla for 35k. Nice try.", "score": -1, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I’m not the dumbass lying about the cost of a car to make a company look better.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "You seem to not know that 35k is the base model with no special features. Even the self driving option cost 10k alone. Then you can only upgrade the interior. That’s how they get yo $$$$", "score": 2, "replies": []}]}]}, {"body": "Unzips", "score": 6, "replies": []}, {"body": "[removed]", "score": 5, "replies": [{"body": "Robotaxis?", "score": 2, "replies": []}]}, {"body": "Q4 cars will be from a Lemon factory", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "That's false.  Can't have bad QC if you don't have QC!", "score": 3, "replies": []}]}]}, {"body": "Anyone wanna bet 3k that it’s not gonna hit 775 by end of the week?", "score": 3, "replies": [{"body": "It better fucking hit $775", "score": 2, "replies": [{"body": "9% chance it will 😂", "score": 1, "replies": []}]}, {"body": "it has to or i am done. 700 would be enough already", "score": 1, "replies": []}]}, {"body": "While you can easily argue its a good problem to have, it's a problem. \n\nTesla is hyping up EVs to a level greater than they can support. This means inevitably they're hyping up the competition. If they were priced like a very promising up and commer, this would be great. Good growth, potential acquisition target, segment leader with fantastic potential. \n\nThey're being priced as the largest car company in the history of the world. Remember that if you're paying for potential it's assumed you're paying a discount so if Tesla the same as companies that have a combined market share of 40% the bet would be that they ultimately have 50 to 60% of the market. \n\nThis does not happen if next year there's demand for 5 or 10 million EVs and they can't even deliver 1 million. If ANY of the big carmakers has a breakout hit, even if Tesla has more demand, it doesn't do them much good to be the first choice if the second choice is actually a product you can buy today instead of a year from today.\n\nThey're doing marketing for the competition until they can meet demand and if they lose the crown even for a little bit, the magic is gone. They're just a fox valued like a tiger.\n\nMind you, I put my money in Tesla because while I in no way believe in the company (in its ability to actually ever grow in to its current evaluation) I do believe in the hype. But I'm in the privileged position of being able to be wrong, lose everything I own in Tesla and be nothing more than upset that I followed my gut instead of my brain. \n\nI believe people believe that the stock is worth more and so far, I've been correct. I can afford to push my luck. If you can too, all aboard. But I cannot stress this enough, Tesla is currently more Vegas strip than Wallstreet. Everyone invested in Tesla is trying to figure out if everyone else is bluffing or if a majority genuinely wants to go all in pre flop.\n\nTLDR\nFor the love of Christ do not go into debt to buy Tesla. Buy if you can afford to lose what you invest.", "score": 8, "replies": [{"body": "Is this what they call “critical thinking”? I’m not sure it’s allowed around here.", "score": 2, "replies": []}]}, {"body": "Classic elon short bait...", "score": 5, "replies": []}, {"body": "Of course right after I sell my calls for a loss of course", "score": 1, "replies": [{"body": "dude last week i bled from 5k profit to 2k loss but will hold through monday and tuesday and if there is no green i will also sell them at a loss. this hurts big (ง’̀-‘́)ง", "score": 2, "replies": []}]}, {"body": "500k easy, they will likely exceed that number.", "score": 1, "replies": []}, {"body": "I’m still waiting on my model 3 performance", "score": 1, "replies": []}, {"body": "\"Leaked\"", "score": 1, "replies": []}]}
{"title": "Pershing Square Holdings Ltd View on PSTH (Pershing Square Tontine Holdings) - World's Largest SPAC", "selftext": "[🤔](https://emojipedia.org/thinking-face/#:~:text=May%20be%20paired%20with%20%F0%9F%92%AD,to%20Emoji%201.0%20in%202015.)**Back to basics with Ackman's PSTH play**[🤔](https://emojipedia.org/thinking-face/#:~:text=May%20be%20paired%20with%20%F0%9F%92%AD,to%20Emoji%201.0%20in%202015.)\n\nIt's always good to just go back to the basics. There are a lot of rumors floating regarding PSTH. Speculation without an LOI announced as of yet. Some moves seem much more likely than others ***but we are still in the dark.***\n\nIn August, PSCM CEO Bill Ackman wrote a letters to investors. In it he has a section dedicated to PSTH. You can find some of that below. I have bolded what I think are the most important parts highlighting the biggest clues. People like Ackman are careful with these letters, they are legacy, like with Buffet's letters.\n\n**Top Contenders**\n\n1. Stripe\n2. Fidelity\n3. Enterprise \n4. Subway\n\n***---------------------------*****Discussion Points below but check out the letter*****---------------------------***\n\n***Pershing Square Tontine Holdings, Ltd. - Letter to Shareholders***\n\nOn July 22nd, Pershing Square Tontine Holdings, Ltd. (“PSTH”) completed a $4 billion IPO on the New York Stock Exchange. We designed PSTH to be the most investor- and merger-friendly SPAC in the world. Apparently investors agreed, as we had more than $12 billion of demand for the offering when we stopped marketing the IPO on the second day of the road show. We capped the IPO at $4 billion, which, when added to the Pershing Square funds’ minimum $1 billion commitment, created the largest blank check company in the world. \n\nWe capped the size of the public offering so that we would not materially limit the potential universe of merger candidates in which our shareholders would, via a merger, become a minority owner of the newly public company. We are seeking to own a minority interest in the newly merged company because we believe our willingness to be a minority owner will differentiate PSTH from the substantial majority of other private equity and strategic buyers who require control, and are therefore prepared to pay a substantial control premium. \n\n**Sellers are much more price sensitive when selling 100% or even a controlling interest in their business for obvious reasons. A seller’s price sensitivity declines, however, when they are selling a smaller interest that allows them to achieve other important strategic objectives. We therefore expect that a potential PSTH merger partner will be much less price-sensitive in a transaction in which it, in effect, sells a minority interest in a merger with PSTH, which also allows it to raise $5 billion of equity capital and retain control of a newly public New York Stock Exchange listed company. In fact, the smaller the interest they are selling, the lesser the price sensitivity, which makes mergers with larger companies more likely to come on more advantaged terms than with smaller companies. PSTH’s targeting of companies that are multiples of its size is designed to enable it to acquire a minority interest in the newly merged company at an attractive valuation.** \n\nWe have always believed that SPACs are interesting investment constructs. We have had an excellent experience and strong investment results from the first SPAC we co-sponsored in 2011 that merged with Burger King, the predecessor company to Restaurant Brands, which remains a core holding more than eight years after the merger. In principle, a properly structured SPAC with a strong sponsor should offer a much more attractive alternative to going public than through an initial public offering. This fact has begun to be appreciated more widely, including by members of the venture capital community. Recently, Bill Gurley, one of the world’s leading venture capitalists, wrote a detailed blog post comparing SPACs and direct listings with initial public offerings. Bill makes a powerful case for SPACs. We encourage you to read his post: https:// [abovethecrowd.com/2020/08/23/going-public-circa-2020-door-3-the-spac/](https://abovethecrowd.com/2020/08/23/going-public-circa-2020-door-3-the-spac/) \n\nIn order to address these alignment issues, with PSTH we eliminated all forms of compensation, advisory fees, and founder shares. We further improved alignment issues by the Pershing Square funds committing to purchase a minimum of $1 billion of common stock and shareholder warrants on the same terms as PSTH’s public shareholders. In addition, the Pershing Square funds purchased so-called Sponsor Warrants for $65 million – their estimated fair market value at the time of the IPO – that will become 10-year warrants on 5.95% of the newly merged company shares, only if we successfully complete a transaction. \n\nWe also negotiated and capped the underwriting fees payable at 1.8% of the SPAC’s minimum equity capital, further reducing frictional costs. We paid two-thirds of these fees with the purchase of the Sponsor Warrants, which reduces the total frictional costs of PSTH in a merger borne by shareholders and our merger partner to a *de minimis* amount. \n\n**We used the excess demand for the PSTH IPO to curate a shareholder list that would be the envy of any public company. We selected investors for their reputation as long-term, value-added owners. We expect our shareholder registry will contribute to PSTH’s appeal as a merger partner for a high-quality company.** \n\nWe also made a number of changes to the typical shareholder warrant structure of SPACs that minimizes the risk of shareholder redemptions. These structural changes, when coupled with our large amount of committed capital to the entity and our curated long-term shareholder base, reduce and likely eliminate the need to raise expensive so-called PIPE capital at the time a transaction is identified, a de facto requirement in nearly every other SPAC transaction. \n\n**The result of all of the above is that we now control a publicly traded, NYSE-listed company with $5 billion of equity capital that is seeking to merge and take public a large capitalization private company that meets our investment criteria for business quality, growth, and an attractive valuation. PSTH is the largest SPAC in the world with the least amount of frictional costs in a merger, making it a highly attractive alternative to an IPO. As such, we expect that PSTH will give Pershing Square’s investors and PSTH’s public shareholders unique access to an untapped universe of bespoke, large-capitalization investment opportunities.** \n\n**To give you a better understanding of the unique, large scale of PSTH, there have been only three U.S. IPOs in the last decade of $5 billion or more – Alibaba, Uber, and Facebook – and the degree of difficulty for completing an IPO increases materially with its size.** This makes PSTH an extremely attractive alternative for a company that would like to raise $5 billion or more of capital and go public, particularly during a period in the capital markets which is likely to be highly volatile and uncertain because of the economic impact of the virus, the upcoming presidential election, and the challenging political, social, and economic environment. Uncertainty is the enemy of the IPO and the friend of a $5 billion SPAC with the largest amount of committed capital.\n\n**We are in discussions with a number of potential companies that are owned and/or controlled by private equity firms, families, start-up company founders, as well as other private companies, and are encouraged by the initial interest that we have received.** \n\n\\-\n\n**William A. Ackman**\n\n**August 2020**\n\n&#x200B;\n\n\\-----------------------------\n\n**Discussion Points**\n\n* How seriously are people taking the  Collison's Tweets. They seem very benign to a potential deal. They have never said never. Couldn't this just be the mating dance Ackman talks about. 3D Chess?\n* Fintech is still most likely? Think Klarman, Guggenheim, Ackman already being deep in food service industry\n* Subway wouldn't be that bad. Am I wrong? Ackman would get it at a steal of a price. It could be a fixer upper like Chipotle?\n* Agree with my contender list?", "id": "kbova1", "created_utc": 1607778671.0, "score": 62, "upvote_ratio": 0.94, "num_comments": 88, "comments": [{"body": "Crazy Ideas:\n\n1 - PSTH buys enough FNMA to dislodge it from the treasury and does a secondary offering to dismiss most of the FannieGate compalints.\n\n2 - PSTH buys several rust belt state pension systems and turns them into actual *Tontines* (and in doing so gains control of the equity holdings of these pension systems and, more importantly, the debt owed by the equity holdings, which they currently have short positions against).", "score": 27, "replies": [{"body": "That comment just blew my mind. Will ponder. Especially option #1...", "score": 12, "replies": []}, {"body": "can someone ELI5 this comment for me, my ape brain cannot process these words", "score": 6, "replies": [{"body": "FNMA is a stock that Ackman is long on. It trades $2.90 on OTC now. If gov releases it and it goes back to NYSE, Ackman and others believe it automatically jumps to $10. Others say $40. Traded in $60 range before gov takeover. One of the most imp companies in real estate - the entire housing system's liquidity is provided by FNMA and FMCC.", "score": 5, "replies": [{"body": "FNMA is a very interesting theory. Going private would unlock tons of value", "score": 3, "replies": []}, {"body": "How probable is this with a Biden/Democratic administration? Although that would be amazing, I seriously doubt it will happen.", "score": 1, "replies": [{"body": "Not very.  But, hey, Trump had four years to do it and didn't (the telltale that shows which way the wind is blowing).\n\nThe one thing people consistently fail to understand about Treasury sweeping the mortgage money machine every quarter for a decade plus is that it's an easy revenue source.  \n\nCoViD has brought treasury revenue to its knees.  In theory, this revenue base is what allows the FedResInk+Treasury to mint debt.  FNMA conservatorship, vis-a-vis treasury sweeps, could be one of a handful of things still managing to keep the wheels on their cart.  But, at the end of the day, it's a Faustian bargain; keep it in conservatorship to maintain debt minting integrity and/or face the prospect of being on the hook for a second housing crisis when the economy doesn't recover in a timely manner (particularly if it takes five plus years to claw back fewer jobs than were lost, as mortgages start to default en mass in another six months to a year).\n\nThere's a lot of people clamoring for the re-privitization of FNMA.  Most of these people are of the class that benefited the most from half a century of Fannie/Freddie lobbying efforts (FNMA was previously the single largest lobbyist to ever grace the steps of Capital Hill), which were put in a deep freeze when the Treasury did a half-assed nationalization of FNMA circa 2010/2011.  Everyone likes to talk about \"getting money out of politics\".  The incompetent nationalization of FNMA *actually* did this.  It's probably one of the only significant examples that has ever happened.", "score": 5, "replies": [{"body": "damn we got some smart ppl at WSB.", "score": 2, "replies": [{"body": "He didn’t leave any 🚀🚀🚀🚀🚀 so he must be one of the smart ones.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Holding a bunch of shares. If it’s subway, I’m out", "score": 47, "replies": [{"body": "How did the subway hear say get started, because I agree, Subway is a bust", "score": 25, "replies": [{"body": "Ackman bought chipotle. So people are saying he will buy subway. Same with retail stores.", "score": 7, "replies": [{"body": "In other words, people pulled Subway out of thin air. It’s not happening. Ignore the noise.", "score": 5, "replies": [{"body": "Yeah, not exactly a unicorn.", "score": 1, "replies": []}]}]}]}, {"body": "So do you really fear Subway? I know a lot of people are saying this, the stock will tank, etc. It has resisted the \"Stripe News\". \n\nI don't think you can say Subway would be bad without knowing the specifics of the deal, which in all likelihood would be great.", "score": 3, "replies": [{"body": "Subway is a damaged brand that is beyond repair.  The entire world knows it's cheap crap that peaked a decade ago with a promotion that is no longer financially viable. They close more stores than any other restaurant.", "score": 22, "replies": [{"body": "Jared Fogle anally gaped it", "score": 9, "replies": []}, {"body": "Chipotle was in much worse shape and was turned around for a 100% profit in like 2 years. They had a food safety scandal with a way less well known brand.\n\nThe nay sayers can nay say. Its understandable that the expectation is a fintech and while I still think it goes that way, something like subway at a wild valuation is attractive. There is just no doubt about it. Especially considering PSCM expertise in the industry.\n\nFor many reasons I don't think it will end of being subway. But not because its a dying brand that can't be revitalized.", "score": 4, "replies": [{"body": "Chipotle tastes good and had some execution issues. Everything about Subway is bad", "score": 5, "replies": [{"body": "I’d say the E. coli in their lettuce was a bigger disruptor than anything managerial, but they came out of that fine", "score": 2, "replies": []}]}, {"body": "Chipotle was cool when ackman bought in . Subway is where all the hobos go to", "score": 11, "replies": []}, {"body": "I honestly don’t see Guggenheim forking over $500m to make subway their 2nd largest holding ahead of apple.", "score": 3, "replies": []}, {"body": "As someone who ate at Subway for years (because it was either that or Jack’s in small town Alabama), I don’t see how you can ever make that place more than what it is...cheap food that’s slightly healthier than a burger joint, but leaves you smelling like their bread if you eat inside.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Subway is in a worse place than Domino's ever was, IMO. I also don't think Ackman is Patrick Doyle.  That was a historic turnaround that will be in textbooks.", "score": 1, "replies": []}]}]}, {"body": "You can’t chipotle a subway. Subway is just what it is, junk.  I want in on this but don’t really know at the moment.", "score": 3, "replies": []}, {"body": "Look, their bread is not legally bread because it was found to have too much sugar.  It follows that their subs are not legally subs.  This is a rolling the train downhill situation, it's a scam.  Is it any wonder Jared Fogle looks like Trevor Milton?  I will probably buy if they change their name to monorail.", "score": 2, "replies": [{"body": "Well, when you put it like that. Calm down Boomer, damn", "score": 1, "replies": []}]}, {"body": "We have a greater chance at stripe than subway", "score": 2, "replies": [{"body": "Yeah for sure", "score": 1, "replies": []}]}]}, {"body": "*JARED FOGLE HAS ENTERED THE CHAT*", "score": 2, "replies": []}, {"body": "face book, uber, alibaba.. and subway? no way", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "You're comparing apples to oranges bruv. PSTH is targeting a mid-large cap company.", "score": 3, "replies": []}]}, {"body": "G H I V has better risk/reward with the 17.50 1/21 calls. $0 risk and 60%ish upside. If they don’t announce a merger date until after January or if it stays below 17.50 until after the merger it’s just additional income.", "score": 1, "replies": []}]}, {"body": "It's most likely to be fintech. Look: https://mobile.twitter.com/Abovewingkeem/status/1337492376705785860\n\nand check who liked that tweet. One of the board members of psth from square.\n\nThis is just teasing at this point, but stripe likely one of the strongest contenders still", "score": 15, "replies": [{"body": "There is a theory that Jackie has an auto-liker for tweets that mention her", "score": 7, "replies": [{"body": "She literally likes almost all tweets she’s tagged in.. unless it’s ridiculously dumb", "score": 4, "replies": []}]}]}, {"body": "I am sure\nBill knows best. But from my perspective and to answer your question I would think subway is tough turn around story while some\nOf other contenders seem easier stories to buy into. Looking into the board members I feel as though they lean more towards fintech than food retail. It could be coincidental or maybe yolo got to me but Jackie Reece being at square and resigning now serving on the PSTH maybe a coincidence but a highly striking one nonetheless. Micheal ovitz with his extensive background not least his Horowitz founding experience coincides rather nicely with backers in a certain fintech firm who may find exiting on these terms rather tempting. Ie andreesen Horowitz are backers of stripe. I know JC said no such deal but that maybe then and maybe just deny deny deny until deal is done and announced to world. So it really is all just speculation until deal\nIs announced. Fingers crossed. Good luck to all. 🤞🏽", "score": 7, "replies": []}, {"body": "A non meme post in Wendy’s? Here’s something you don’t see everyday.", "score": 4, "replies": []}, {"body": "Please let it be subway LOL", "score": 11, "replies": [{"body": "I would DIE @subway. Literally backed the truck up to drop off my savings into PSTH. Imagine doing that for bread with yoga mat particles in it.", "score": 22, "replies": [{"body": "They removed all that crap over five years ago but I get your point. Fuck Subway.", "score": 2, "replies": [{"body": "I know but you get it. Thinking of converting these over to max my BFT positions. The pace this one is going I’ll be able to exit BFT with tendies and still catch this.", "score": 3, "replies": [{"body": "Ah, yes. BFT. The next NKLA.", "score": 3, "replies": [{"body": "Made 100% on NKLA 🤷🏻‍♂️ and Paysafe has a product that is already being widely utilized with success lol.", "score": 0, "replies": [{"body": "I made 105% on NKLA. \n\nIt still was a risky flaming dumpster fire dive. Much like this one. Have Fun trying to do something that equates to \"catching a falling knife\" as famed investor and water balloon businessman F.  Gorgol Helpouyi said before the financial crisis. Godspeed.", "score": 1, "replies": [{"body": "Ooooooo", "score": 2, "replies": []}]}]}]}, {"body": "been thinking the same thing, I still feel like BFT has a LOT of room to run", "score": 1, "replies": []}]}]}, {"body": "Subway has a decent product. Come on.", "score": -5, "replies": [{"body": "I don't mind eating at Subway but I'd he disappointed in PSTH going that route. Just sayin.", "score": 2, "replies": []}, {"body": "It did when I was a degenerate struggling through college. I ate so much of that crap since it was on campus that I now detest it and the smell of those ovens..", "score": 1, "replies": []}]}]}, {"body": "Sir this is a Wendy’s", "score": 7, "replies": [{"body": "ha", "score": 3, "replies": []}]}]}, {"body": "Here’s a crazy idea. \n\n$SEARS had delayed IPO due to pricing. Basically institutions are paying a hefty $40 for IPOs in dark pool and flipping it to retail for $160 \n\nThe problem is that they don’t get to keep the $160. Which means banks are actually pocketing the $160 diff while the $40 goes to IPO company. \n\nSPACs levels the playing field and forces everyone to pay the same price. \n\nThis allows the full amount pre merge to go to the company. \n\n$PSTH and $SEARS", "score": 5, "replies": [{"body": "> Basically institutions are paying a hefty $40 for IPOs in dark pool and flipping it to retail for $160 \n\nI should probably get out of ABCL then.", "score": 2, "replies": []}]}, {"body": "Why do you idiots keep putting up Stripe. The CEO of the company has already said more than once they aren't using a SPAC to go public.", "score": 5, "replies": [{"body": "Can you provide the source? I’d like", "score": 3, "replies": [{"body": "https://twitter.com/patrickc/status/1336043630079868930?lang=en", "score": 0, "replies": [{"body": "Damn you are stupid. Need to work on that reading comprehension. A three word knee jerk reaction to a troll doesn’t mean they aren’t using a SPAC", "score": 2, "replies": [{"body": "Ah yes reading comprehension means inferring the exact opposite of what he said for no reason at all. Absolutely brilliant", "score": 0, "replies": []}]}, {"body": "Quite a big difference between the contents of that tweet and “aren’t using a SPAC to go public”", "score": 2, "replies": [{"body": "Bro he literally says no deal with PSTH you absolute tard", "score": -1, "replies": [{"body": "There is literally no deal until there is a deal, at which point they announce a deal.  Until then, no such deal.", "score": 7, "replies": []}, {"body": "Context mother fucker, he was replying to a troll.\n\nReread it again, slowly", "score": 3, "replies": []}, {"body": "Yeah and that’s not the point of my sentence genius", "score": 4, "replies": [{"body": "I'm not the one who said it wasn't going public with a SPAC at all. I'm showing you that it's not going public with your SPAC that you're so adamant about", "score": 0, "replies": [{"body": "The fact that Stripe is proven to be going public because of their recent job listings, along with the fact that the Collisson bros said no IPO recently leaves a SPAC as one of the only remaining options.", "score": 3, "replies": []}]}]}]}]}, {"body": "Do you know how to read in context tard.. he was replying to the guy who just said congrats on a deal with PSTH as if Patrick had just announced a deal. He didn’t announce a deal in his tweet so he replied to the guy saying no such deal.. as in I didn’t just announce a deal \n\nContext broheim, context", "score": 1, "replies": [{"body": "You’re actually retarded in every meaning of the word", "score": 0, "replies": [{"body": "You sound like someone with $500 and a Robinhood account", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I have a small position in this just because of the curiosity. Stripe would be amazing and Id wish I had more but I think it’ll be something else. Some have mentioned Bloomberg and Coinbase as other targets. Not sure what other finance/tech unicorns are out there. Stripe seems too big for this still.", "score": 2, "replies": [{"body": "I dont understand why people keep saying its bloomberg when they have denied it.   \n\n\n[https://finance.yahoo.com/news/bloomberg-denies-report-minority-stake-082848503.html](https://finance.yahoo.com/news/bloomberg-denies-report-minority-stake-082848503.html)  \n\n\nAnd if people still feel comfortable saying it could be bloomberg after that, then how can we also not say it can still be Stripe?", "score": 2, "replies": [{"body": "Sorry, I hadn’t seen that haha. I knew stripe denied but I haven’t followed that closely. I only have like 75 shares, just a curiosity to see what happens but not really a risk.", "score": 1, "replies": []}]}]}, {"body": "It literally was confirmed by Stripe CEO that it isn't Stripe WTF Bad DD", "score": 0, "replies": [{"body": "He's just playing hard to get bby 🥰", "score": 15, "replies": []}, {"body": "Yeah, I mean come on, folks. You have to ask yourself if its possible that if a company ended up merging, is it possible that the CEO trolled on twitter in the middle of negotiations. The tech saver young CEO made a tweet for fun. Like this is just negotiating. And the losses IPOs like SNOW and ABNB have suffered, that isn't going anywhere in 2 years when they go public. A 20% stake to Ackman here would be the smartest thing they've ever done. Access to capital via investors like Klarman, Guggenheim and ONT who just don't leave positions easily.\n\nBut it might not be stripe, you're right.", "score": 3, "replies": [{"body": "It's not. It would be taken as misleading the private shareholders of the future which can have legal consequences.", "score": 2, "replies": [{"body": "Misleading is when you know for sure. A spac is speculation- hows it misleading when you of your own accord are blindly putting in money. Also they could be negotiating which means no letter of intent", "score": 0, "replies": [{"body": "Misleading the private shareholders of the future. Stripe currently has private shareholders. Him saying this would be misleading them. That is illegal.", "score": 2, "replies": [{"body": "Don’t know ..Probably not stripe but his wording wasn’t definitive like Bloomberg. They haven’t outright denied so far.. saying no such deal could be construed as no such deal at the present time which is accurate and still not misleading", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I thought the where going to build actual subways.\n\nI'm out.", "score": 1, "replies": [{"body": "skwolf22, You're Fired!!!!! (Vincent McMahon not DJT)", "score": 1, "replies": []}]}, {"body": "PSTH is in more trouble than you’d think. The structure is fantastic and I’m a fan of Bill but he fucked up raising too much money.  There are so few potential targets out that he may never find a company to take public.", "score": 1, "replies": [{"body": "unlikely in 24 month period. standards can change but it wont be necessary", "score": 1, "replies": []}, {"body": "Technically, there's nothing that says he has to spend it all buying just one company.", "score": 1, "replies": []}]}, {"body": "Stripe CEO says there's no deal with PSTH. Actual retards on this sub, \"It's for sure Stripe.\"", "score": 0, "replies": [{"body": "It is Stripe prob", "score": 5, "replies": []}]}, {"body": "Watch it being a subway. Lol", "score": -4, "replies": []}]}
