{"title": "JPMorgan is acquiring a major credit card rewards business in a bet that travel will rebound next year", "selftext": "https://www.cnbc.com/2020/12/28/jpmorgan-is-acquiring-a-major-credit-card-rewards-business-in-a-bet-on-travel.html\n\nJPMorgan Chase has agreed to purchase one of the biggest third-party credit-card loyalty operators in a bet that pleasure travel will rebound sharply after the coronavirus pandemic subsides, CNBC has learned.\n\n“People across the globe want to vacation and travel again, and hopefully that will become a reality for many in the near future,” Lake said in a statement. “Acquiring the travel and rewards businesses of cxLoyalty will provide enhanced experiences to our millions of Chase customers once they are ready, comfortable and confident to travel.”\n\nTime to buy more jpm for 2021 recovery play. JPM have strong trading revenue and it will be rebound sharply next year. This is a good non-tech stock to own for long term.", "id": "klv30r", "created_utc": 1609177566.0, "score": 708, "upvote_ratio": 0.99, "num_comments": 94, "comments": [{"body": "Jpmorgan is the only Bank to buy\n\nGreat management well run,  solid investment reasonable price and a shitload of silver I'm in", "score": 181, "replies": [{"body": "Buffet didn’t seem to think it would, but then again he got out before they got monies from the government", "score": 52, "replies": [{"body": "What does he know compared to me lol", "score": 126, "replies": [{"body": "Well for the last decade his performance has been very average. You said this as a joke, but it's the correct move to begin questioning mediocrity.", "score": 39, "replies": [{"body": "Yes it's been average, not that he needs me to back him up but I would guess  it's not easy to safely manage $500b and turn an above average profit.  \n\nIf I had to give all my money to one company to look after for the next 30 years just set it and forget it Berkshire Hathaway would be at the top of my list", "score": 16, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Completely missed the tech train? Dude got in big on the two biggest run ups in tech — AMZN and AAPL. He’s also big on biotechnology which has performed really well. I think you might just be saying things to say them, Buffett’s strategy of value investing is most definitely not dead.", "score": 4, "replies": [{"body": "Get in there my son you tell him", "score": 4, "replies": []}]}, {"body": "Seems to have done all right with snowflake", "score": 3, "replies": []}]}]}, {"body": "You forget he doesn’t think in decades his vision has gone now beyond him now . The new crop of his managers are gonna inherit and he’s focusing on them than making better percentage points because they have their own float from the insurance . They don’t have investors knocking every quarter", "score": 6, "replies": []}, {"body": "He is a value and fundamental investor, maybe for the last decade everything has been becoming overvalued and he doesn’t buy into the hype but for the long term.", "score": 6, "replies": []}, {"body": "That’s a lie. Buffett’s portfolio is essentially a more risk averse version of the S&P 500. His performance from the ‘70s up to 2020 has an 11% CAGR. I wouldn’t call that mediocrity.", "score": 0, "replies": [{"body": "I really don't care about the 70s, that was 50 years ago. The world has changed significantly since then. His philosophies are sound but becoming outdated.\n\nSince 2010 compared to SPY\n\n1. He has a worse CAGR\n2. He has a worse largest drawdown\n3. He has a worse drawdown for a year\n\n\nI'm not here to bash Buffet - he's clearly had an amazing career. What I am saying is if you are looking to even do marginally better than the S&P 500 it's best not to follow Buffets philosophies and look elsewhere for inspiration.", "score": 33, "replies": [{"body": "Warren Buffett’s philosophy is value investing. I wouldn’t call value investing an “outdated” philosophy. Regardless of whether folks want to follow his principles or not, the fact stands that most people don’t understand the market or individual companies enough to beat or actually even come close to his 11% CAGR. 11% average gains annually for 50 straight years is impressive no matter how you slice it.", "score": 20, "replies": [{"body": "I mean, like I said he's had an amazing career. He's worth about 100,000x more than I am lol. I'm just saying I don't think a lot people following his approach today will look back and be happy with their results. You can do what you want though.", "score": 8, "replies": [{"body": "That’s fair, everyone has their individual investing philosophies. To each their own.", "score": 4, "replies": []}, {"body": "You're not going to be happy with any investment result when your investment timeframe is a tunnel vision of 5 years", "score": 3, "replies": []}, {"body": "I dont think any one on this post is invested heavy in Berkshire pal   its more of a place to send your money ie ($1,000,000+) when you retire if you have no ideas how to invest it yourself imo", "score": 1, "replies": [{"body": "I kind of exactly agree - he invests for parking money now. If you have a billion dollars and want a 10% CAGR, this is great. If you're not a billionaire (or even a millionaire) I don't think we should be looking into it very much if Buffet sold JPMorgan or not.", "score": 2, "replies": []}]}]}, {"body": "Bravo", "score": 2, "replies": []}]}, {"body": "So all in on TSLA calls. Got it!", "score": 4, "replies": []}, {"body": "One thing you are really missing here is the government has largely been propping the economy up with QE... and that can’t last forever.", "score": 1, "replies": []}]}, {"body": "A bit slow recently, but past performance...\n\nStill better than indices.. even if they trade out mediocre performers to juice their looks.  BTW, doesn't that explode the purpose of an index...let's compare varieties of apples... No, let's compare most apples and 3 watermelons. Huh?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Low  interest rate will of help his decision as well.\n\n I don't think a lot of people consider just how important jpmorgan silver stack will be in the next  recession or dollar collapse ever", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "They're holding silver because the gold to silver ratio is favorable toward silver at 72 oz to 1 oz of gold 35 to 1 is a more normal amount  also with solar panels, Dentistry, Electronics, jewelry and medication \n\nsilver has many uses it's extremely rare running out and there's not so many Mine's on top of that if there's a dollar collapse silver will likely 4X where gold is likely to 2x \n\nJp Morgan own 20% of all the silver in the world\nNow that's not only a world record it's also absolutely incredible\n I didn't buy jp Morgan stock for there lone side of the business I bought the silver that happens to come with a well-run bank attached", "score": 4, "replies": []}]}]}, {"body": "But he brought bank of America I think it's cuz he prefers them and they are also cheaper", "score": 6, "replies": [{"body": "He first bought in about 9 years ago for a very favorable price as bank of America was going down", "score": 5, "replies": []}]}]}, {"body": "Buffet took at least 2 billion out of jp Morgan I think", "score": 6, "replies": [{"body": "And sold nearly all of his airline stuffs", "score": 6, "replies": [{"body": "Which lost him money.", "score": 6, "replies": [{"body": "Yes he sold at a pretty big loss actually, but it was a bet on whether it would go down or up in the future post pandemic. Buffet knows how to wait patiently.", "score": 1, "replies": []}, {"body": "Yet you find that his  selling and  buying over the last year must of gone well as Berkshire Hathaway is all-time highs", "score": -1, "replies": [{"body": "have", "score": 7, "replies": [{"body": "Thanks buddy my mom would be proud of you", "score": -1, "replies": []}]}, {"body": "Berkshire is only up 1% for the year which is embarrassing.", "score": 1, "replies": [{"body": "Yes even I'm up more than that but his portfolio is undamaged by the covid which is the main thing I am not a Berkshire Hathaway share holder but I do keep an eye on it", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Buffet's positions are bottom fishing, or some other special situation.  Chase is too high to attract him.  They're not a misunderstood niche with opportunity, they're fairly priced. \n\n(But I don't understand why WF).", "score": 1, "replies": []}]}, {"body": "Morgan Stanley is a great buy too imo, but yeah, JPMC is brilliant on every level", "score": 3, "replies": []}, {"body": "Definitely not the only bank to buy.", "score": 2, "replies": [{"body": "Yes you are right Lloyds is not a bad gamble at today's price", "score": 1, "replies": []}]}, {"body": "Goldman?", "score": 1, "replies": [{"body": "What about Goldman pal", "score": 9, "replies": [{"body": "Goldman messed up with 1MDB corruption case.", "score": 2, "replies": []}]}]}, {"body": "Ever heard of FRC? Lmao JPM not the “only bank to buy”", "score": -5, "replies": [{"body": "Yeah I've heard of it it's a small crap bank with 91% debt to assets and no profit  the is 32,000 banks out there in the crazy world you live in and FRC IS ONE OF THEM am I right lmfao \n\nDo yourself a favor and don't post things like that also don't buy that stock as that stock sucks\n\nGood luck with picking a good stock pal", "score": 3, "replies": [{"body": "Lmao this is just flat wrong - FRC has been killing it, very profitable bank - stealing all JPMs private client", "score": 2, "replies": [{"body": "Go on enlighten me as to what I am missing", "score": 1, "replies": [{"body": "FRC has been profitable for 33 years - one of the fasting growing banks in America, all on client referrals, no acquisitions - 140 billion AUM (small bank to you I guess) , no risky debt- no auto loans, dumb credit cards, etc. 85% of clientele have graduate degrees, best quarter in history was during covid - Bank has only grown in down times (covid and 2008 the bank only grew in reputation and assets) because of the security/low risk, idk how bout you read some financial reports/earring reports etc - that Bank is blowing up. Named best private bank by Private Asset Management Magazine. First Republic has arguably the best customer service in the banking industry, and they have used that to leverage great growth in both deposits and loans, also their PWM has been consistently ranked as one of the best in private banking and their AUM is only getting bigger as they steal away from Goldman and JPM - Shall I go on? Oh I will - take a look at their books, they’re great. Also best business bank for alternative investment entity’s (JPM takes 2-3 weeks to open and account, FRC it takes 6 days). The service is just on another level, and clients appreciate that, and they tell their friends. Proof is in the pudding.\n\nNot saying JPM isn’t a good buy, but the “only bank to buy” idk about that", "score": 2, "replies": [{"body": "Thanks I will have a look the thing that worries me with that bank is they have over $100B in debt end only $3.5b in revenues that sucks in a zero interest rates world good luck with it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Amex too", "score": 1, "replies": []}]}, {"body": "Interested to see if this will give me more benefits on Sapphire Reserve.  As the scheduled price increase for yearly fees was postponed, and will go up this year. \n\nBut yeah, Lyft Pink and Dashpass were nice, but Door Dash sucks, only since acquiring Caviar was it any good", "score": 43, "replies": [{"body": "It fuckin better, are you listening jamie", "score": 8, "replies": []}, {"body": "Call the number in the back of your reserve card and ask for a retention offer. Depending on how much you bank with JPM, you'll receive a $150-250 statement credit. I was able to get $250 back myself, making my reserve card free for all of next year! It doesn't hurt to at least try - it took less than 5 minutes.", "score": 7, "replies": [{"body": "Wait your reserve fee is 250? Its 499", "score": 4, "replies": [{"body": "($550 annual fee)-($250 statement credit)= $300; however that $300 fee is offset by the $300 travel credit.", "score": 2, "replies": [{"body": "Lol. ‘Travel’ got it. I sill try don’t bank with them at all minus the card which I have had a while. \n\nI dont uber lyft or anything but good god what i would give to get on a plane and spend money somewhere that was not the US", "score": -4, "replies": []}]}]}, {"body": "When was your annual fee gonna hit ?", "score": 1, "replies": []}]}]}, {"body": "I have a friend who works at the company they acquired. It’s a crapshoot with very poor execution and a failing management team. Not the jpm will be impacted because they are too big. But cxnloyalty sucks", "score": 14, "replies": [{"body": "Work at one of the subsidiaries of cXloyalty. Can confirm, management has no spine and no product vision. With this, hopefully JP has a clear vision and roadmap for us.", "score": 4, "replies": []}]}, {"body": "Their sapphires and rewards programs are already top notch. As is their app.\n\n&#x200B;\n\nLove this move!", "score": 30, "replies": []}, {"body": "I agree, airlines hotels and disney are gonna be packed", "score": 22, "replies": [{"body": "No hotels will still suck , business / convention travel is dead and most big hotels are very dependent on that", "score": 13, "replies": [{"body": "pent up demand, even people who hate conferences are itching to go to one", "score": 5, "replies": [{"body": "Not how that works. Travel pricing hinges on supply and demand. \n\nLeisure demand is coming back, not as fast as you think or in the same way. Business travel is unnecessary, expensive in a time where budgets are still tight and large conventions are off the table — that’s a huge chunk of travel. \n\nOverall demand isn’t there but the supply is, and that means cheaper prices and less revenue.", "score": 8, "replies": [{"body": "That's priced in.", "score": -5, "replies": [{"body": "Full recovery in travel is priced in right now.", "score": 2, "replies": [{"body": "i disagree, LMK when boeing is 300's then its priced in", "score": 0, "replies": [{"body": "*Hospitality not airplanes", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Lol no way. It’s tax free pleasure for companies. Massive perks for top talent and millennials will ask for it. It’s not dead", "score": 2, "replies": [{"body": "Odd business trips will be around but the MICE sector will be beaten down until 2023.", "score": 5, "replies": []}, {"body": "Not sure where you are at, but Big4 consulting isn’t going back to the old model of traveling", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Big4 generate more revenue than MBB. And has a bigger workforce, when you mention travel and frequent reward point not sure how MBB has a bigger impact than Big4 consulting combined.", "score": 1, "replies": []}]}, {"body": ">Big4 consulting \n\nLmao. Sounds like you bombed your MBB case interviews.", "score": 0, "replies": [{"body": "You already know!!", "score": 1, "replies": []}]}]}]}]}, {"body": "Does that mean the Airbnb will finally be able to justify there ridiculous price ?", "score": 7, "replies": [{"body": "Nope.... still doesn’t mean that", "score": 24, "replies": []}]}]}, {"body": "How will this affect stock prices for either company?", "score": 5, "replies": [{"body": "Without looking, I’d be shocked if cxLoyalty is a publicly traded company and I would be even more shocked if this deal had any impact on JPMs share price.", "score": 12, "replies": []}]}, {"body": "Pure travel ETF’s?", "score": 9, "replies": [{"body": "JETS", "score": 3, "replies": [{"body": "Thanks. I’m not fond of airline stocks, but this lead me to $AWAY.", "score": 2, "replies": []}]}]}, {"body": "As someone that traveled Xmas and thanksgiving... airports are still packed yo", "score": 3, "replies": [{"body": "Airports are not nearly as packed as they usually are around xmas. There were a ton of empty seats on the flight.", "score": 1, "replies": []}]}, {"body": "Sure but the people that generally would travel don’t have jobs anymore, a lot of jobs are gone, gone, gone.", "score": 2, "replies": []}, {"body": "Or maybe it was just on sale right now", "score": 2, "replies": []}, {"body": "Glad I'm already in a bit with JPM. I'll definitely dive in more now. Thanks for the Share!", "score": 2, "replies": []}, {"body": "I wanted to buy long calls on JPM but didn’t have enough capital to buy ITM LEAPS. Bought the calls in XLF instead because they have most of their holdings in JPM and BRKH which are great. Seeing Green 🎄", "score": 1, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Stop using price action to value companies, JPM is in the top 10 most profitable companies in the world and still managed to print money even during the pandemic. They’re an extremely well run organization with the best CEO in the business currently trading barely above book value and with a 15 PE, and a $30b buyback program for 2021 that will continue to increase shareholder value. Just because the share price is [insert arbitrary amount higher or lower] than it was [insert arbitrary amount of time ago] doesn’t mean shit for valuation.\n\nAlso the fact that it managed to recover its share price should be a bullish sign. Way more confident buying something that managed to recover over something still in the shitter like Intel or airlines.", "score": 15, "replies": []}]}, {"body": "Indirectly responsible for variant 3 circling the globe in fall!", "score": 1, "replies": []}, {"body": "This is good news. I have 700k chase UR points ready to use.", "score": 1, "replies": []}]}
{"title": "What's up with $NET and $SHOP today", "selftext": "Cloudflare is down currently over 8% today. Shopify is down over 5%. Meanwhile Amazon is up 3.5%. Did I miss any important news? Or is it just market randomness.\n\nShould I buy the dip, if so which one?", "id": "klyhuf", "created_utc": 1609187975.0, "score": 140, "upvote_ratio": 0.86, "num_comments": 92, "comments": [{"body": "End of year profit taking on richly priced stocks. I’m considering adding some $NET if it drops lower.", "score": 184, "replies": [{"body": "I bought some now. I think it's a buy. Hope I'm right though :)", "score": 36, "replies": [{"body": "I bought some more today to bringing might average cost basis up a bit since I bought and held in the low $30’s. On days like today with no news and simply profit taking, it’s a no brained to buy more even if it means your cost averaging up.", "score": 2, "replies": []}, {"body": "I‘m interested around $70. if we don’t get there, I’ll just sit this one out.", "score": -4, "replies": []}]}, {"body": "I entered NET today", "score": 23, "replies": [{"body": "Did she like it?", "score": 46, "replies": []}, {"body": "And then, I got in.  (Queue daft punk music)", "score": 8, "replies": []}]}, {"body": "I bought £2500 worth of NET and last week it was up 110%, so I sold and today rebought with all my proceeds........ win!", "score": 35, "replies": [{"body": "So it was YOU!", "score": 16, "replies": [{"body": "Mwah ha ha ha 😈 😂", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Nope. As long as they don't sell again until the previous trade is settled.", "score": 0, "replies": []}]}]}, {"body": "Makes sense. Probably same thing going on with PLTR.", "score": 5, "replies": [{"body": "So happy to don't have a too big % of my portfolio in it, this stock have been side trading between 26 and 29 for way too long.", "score": -2, "replies": []}]}, {"body": "Me too. Hope it drops into the sixties", "score": 2, "replies": [{"body": "I bought back when it was in the 30's. That would huge if it got back 60's, I cant imagine it would crash that hard though.", "score": 13, "replies": []}, {"body": "No way. I'd be shocked if it actually hit 70. Get in this week or you'll be kicking yourself.", "score": 2, "replies": []}]}, {"body": "Why do people take end of year profits? You'd save on taxes if you waited one more month for January", "score": -6, "replies": [{"body": "Not necessarily. Depends on your situation", "score": 8, "replies": []}, {"body": "Lots of people are anticipating their taxes are going to go up next year with the new administration. It may be advantageous from a tax standpoint to take the profits this year.", "score": 1, "replies": [{"body": "I’m pretty sure those changes wouldn’t kick in until the following tax year.", "score": 2, "replies": [{"body": "It's possible they could make them take effect immediately. It's happened in the past and this administration has said clearly they will raise taxes.", "score": 1, "replies": []}]}]}]}, {"body": "I felt like there was a shift from stocks that ran up a lot from COVID to value stocks today.", "score": 1, "replies": []}]}, {"body": "Profit taking", "score": 59, "replies": []}, {"body": "Late Christmas present from Santa, giving you the chance to buy the dip.", "score": 42, "replies": []}, {"body": "I added more NET", "score": 23, "replies": [{"body": "K", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 47, "replies": [{"body": "Damn good for you man. Thats a nice ROI on those original shares 👍", "score": 12, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "I interviewed for pton this year and choked. They told me they had ridiculous traffic. Should have bought shares but their stock was already up 100% at the time", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Lol word. I went on a date with a girl once who casually mentioned she was a millionaire from Instacart stock options. They are like 50b company now. Need to work hard and get a job at a Faang company or a growing startup", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I’m at a freshly minted unicorn  so I’ll be sure to remember you as all 1k of my shares become worth... 4 - 5 dollars. \n\n*doctor evil pinky*", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "- J. P. Morgan said this first right.?", "score": 1, "replies": []}]}, {"body": "Lot of WFH stocks are down quite a bit. Chewy, Etsy, Teladoc, Docusign, Sea Limited, Pinterest, TradeDesk are all down a lot.", "score": 48, "replies": [{"body": "It’s not “wfh” stocks. It’s SaaS. SaaS industry usually all move together.  \nThat’s why if one of the bigger SaaS report weak earnings they take the entire sector down with it.", "score": 5, "replies": []}, {"body": "ZM as well, but I think that might be because of the whole DoJ debacle.", "score": 3, "replies": []}, {"body": "What is WFH?", "score": 3, "replies": [{"body": "Wank from home", "score": 93, "replies": [{"body": "Just for the record, I was doing it waaaaaayyyy before the pandemic", "score": 3, "replies": []}, {"body": "Where else would you wank? For research purposes.", "score": 8, "replies": [{"body": "An office stall. Wanking and getting paid at the same time is awesome.\nYou come back with post wank clarity also.\n\nI eh, heard from a friend.", "score": 9, "replies": [{"body": "So the fellow in the stall next to mine wasn’t using a shake weight?", "score": 3, "replies": []}, {"body": "Jerk at work this is the way", "score": 1, "replies": []}]}]}]}, {"body": "Work From Home", "score": 10, "replies": []}, {"body": "work from home", "score": 3, "replies": []}, {"body": "work from house", "score": 2, "replies": []}, {"body": "It's WTF ... jumbled and misspelled!", "score": 0, "replies": []}]}, {"body": "My dumb ass queued up a limit buy for a call for SE and thought it wouldn't hit for a day or two... nope, blew through my stop limit and kept dipping. Was at $21, put in for $19, it dove straight to $13 before I even woke up lmao. Only lost $600 then recouped slightly to -$500 by EOD, so I'm hoping its headed back up obviously, but I got it at 45 dte, so I should have time", "score": 1, "replies": []}]}, {"body": "My net, square, and SE portfolio got blasted today lol. I'm still up and planning to hold but it was not pretty.", "score": 16, "replies": [{"body": "If you sell calls when the shares are up, then it won’t be that bad when the shares go down. It’s a perfect opportunity to buy your call, and sell the call again when the shares go back up.", "score": 3, "replies": [{"body": "Ok but what if you do that and the stocks keep going up?", "score": 1, "replies": [{"body": "You make less money than if you didn’t sell calls, which is why I don’t do that. It’s basically having insurance on the stock.", "score": 1, "replies": []}, {"body": "Then if you want to keep the stock you roll the call out. There will always be an opportunity to buy the call when the stock has gone down. So you make more money if you sell calls with your shares. I sell very otm weekly calls and let it expire every week. I had to roll the call out on NET about twice since i purchased it at $33. I made more money with the calls, because I take the opportunity of the dips.", "score": 1, "replies": []}]}]}, {"body": "Same. A 4.5% drop rattled me today.  I can afford the losses, but nobody likes seeing a red portfolio.", "score": 1, "replies": []}]}, {"body": "Stocks go down sometimes, other times they go up", "score": 81, "replies": [{"body": "Whoa whoa whoa nobody told me they can go down", "score": 59, "replies": [{"body": "It is not a story ~~the jedi~~ r/stocks would tell you", "score": 7, "replies": [{"body": "I see thru the lies of r/stocks", "score": 1, "replies": []}]}, {"body": "Stocks can go down,but \"Stonks\" only go up", "score": 2, "replies": []}]}, {"body": "Someone give this man some phds", "score": 4, "replies": [{"body": "He obviously already have at least one.", "score": 1, "replies": []}]}, {"body": "Ya but which one should OP buy and when?", "score": 1, "replies": [{"body": "probably neither, never", "score": -2, "replies": []}]}, {"body": "Funny how they always have an excuse to go up.\n\nThere is always a reason you're just too dumb to understand it,", "score": 1, "replies": []}, {"body": "Solid explanation!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 49, "replies": []}, {"body": "I added more $NET today, will add a bit more if it drops further.", "score": 6, "replies": []}, {"body": "NET and CHWY had a rough day for me. Luckily MMEDF saved it.", "score": 6, "replies": [{"body": "Mmedf has been good to me too", "score": 3, "replies": []}]}, {"body": "Maybe institutional investors are rebalancing their portfolios/taking profits since NET and SHOP are up significantly this year", "score": 6, "replies": [{"body": "Sector rotation", "score": -3, "replies": []}]}, {"body": "Last day to sell and have the transaction settle this year. It's not uncommon after the Santa rally to have profit taking for tax season.", "score": 13, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Ah didn't know the US was different. In Canada it's settlement date", "score": 5, "replies": []}]}]}, {"body": "Could be tax gain harvesting from people who expect to have higher income in 2021 (probably not likely, but one reason people might sell before the end of the year).", "score": 4, "replies": []}, {"body": "I've been selling both for a while, but I still hold fairly large positions in my portfolio. I've been expecting some selling for a while now as people rotating out of the COVID names and into reopening stocks, but I'm quite surprised by the intensity of the selling today.\n\nI sold 175 shares of NET at $86.25 last week and after seeing NET down so much today I decide to buy back around 90 shares ~$80. I'll probably continue to buy if it falls more.\n\nI'll be waiting for a little more downside before I buy back into SHOP. I think it's very likely to fall below $1,000 at some point next year and I'll be looking to buy back in at around $900.\n\nBoth are very risky trades at the moment. Given the year they've had I wouldn't be at all surprised if they fall 20% over the next 3-4 months, but I think long-term if you DCA into either you should do well.", "score": 7, "replies": []}, {"body": "Sector rotation. Money going from momentum names into FAANGs.", "score": 4, "replies": []}, {"body": "Probably a sector rotation out of cloud ,stay at home software stocks . Nasdaq , s and p and dow were all up a bit .", "score": 2, "replies": []}, {"body": "Just added some $NET!", "score": 2, "replies": []}, {"body": "All the BABA owners are running back to amazon. Can’t blame them. That and amazon has been building a bullish wedge pattern over last few months.", "score": 3, "replies": [{"body": "Baba is trash", "score": -1, "replies": []}]}, {"body": "I am buying 2022 leap call if it keeps going down.", "score": 2, "replies": []}, {"body": "Except Amzn due to holidays, I do not see others will move up.  May be year end close out accounts.", "score": 1, "replies": []}, {"body": "Just perusing my own portfolio and watch list I see a lot of midcaps that already grew a lot this year down.  Not too worried but I always make sure I'm not doing something stupid when my portfolio goes down and the big indexes go up.", "score": 1, "replies": []}, {"body": "I bought at $84 and hope it drops even more so I can buy lol.", "score": 1, "replies": []}, {"body": "NET has huge fluctuations. No stress. Up 3%+ tomorrow", "score": 1, "replies": []}, {"body": "If you don’t understand these companies, do not buy them.", "score": -1, "replies": [{"body": "If you dont how computer works, dont buy it and use it", "score": 5, "replies": []}]}, {"body": "Nothings up with them. Come on man, you really rely on your buying by asking Reddit? Ridiculous post", "score": -1, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "\"Most stocks\"?", "score": 5, "replies": [{"body": "Most stocks that he holds 😉", "score": 11, "replies": []}]}, {"body": "Lol QQQ Voo and Dia all up nicely. Amzn ,FB , GOOG and apple did great.", "score": 3, "replies": []}]}, {"body": "Interesting, SE is down 6% today too.", "score": 1, "replies": []}]}
{"title": "SGMO DD- Crispr Patents, valuation, and ARKG", "selftext": "* **WTF is SGMO?** Still the most drastically undervalued gene therapy company on the market. Launch sequence already started, and it’s still wicked undervalued.\n\n&#x200B;\n\n* **How undervalued is SGMO?** I’m copying an *updated* valuation table from my first article, published last Sunday 12/20/20. Here’s that article in case you want more fundamental explanation of SGMO: [First SGMO DD Article](https://www.reddit.com/r/wallstreetbets/comments/kh7x4x/sgmo_investment_thesis_full_dd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf__;!!Cjnu1T6GFXg!8oz9onn85pCSDC3gf9hR6p84b7kPdrharEB6YcEeW8boxiiLh2kl6c0qrTf0VV_U52QYiQ2x0A$)\n\nThen, the stock price was 14.32. This week, it touched $18.48 and closed at $17.81 on Friday. A month ago it was $9.44…\n\n&#x200B;\n\n|Ticker|Market Cap|\n|:-|:-|\n|BMRN|16 B|\n|CRSP|12 B|\n|EDIT|5.21 B|\n|ONCE|Acquired for 4B for 1 approved therapy|\n|NTLA|3.67 B|\n|SGMO|2.52 B|\n\n&#x200B;\n\nAt these prices it should go up another 31% to be fairly valued with the next company on the list that would basically be a hairy guy in an inner tube compared to the SGMO yacht. \n\n&#x200B;\n\n* **Want a real SGMO vs EDIT valuation by an actual professional?** Here ya go: [SGMO vs EDIT valuation thread](https://twitter.com/mchilberg/status/1343189009095217152?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet)\n\nAlso, SGMO's lead candidate for hemophilia (currently Phase 3 trial partnered with Pfizer) has better data than BMRN’s, so imho it should be worth AT LEAST 6x where it is at right now, and that’s excluding the fact that SGMO has partnerships with Pfizer, Takeda, Biogen, Kite, Sanofi and Novartis, in addition to 7 wholly-owned programs. That gives us a grand total of 18 lottery tickets at the moment: [https://www.sangamo.com/pipeline](https://www.sangamo.com/pipeline)\n\n&#x200B;\n\n* **Why the hell are you comparing SGMO with CRSP?** You’ve probably heard of CRSPR but never heard of SGMO. Doesn’t fucking matter, because… PATENTS. CRSPR tech got a lot of attention and press in its early days, mostly from a Radiolab episode and then lots of follow-up news stories. It’s used a lot of places for research because it's cheap and widely available... and that’s the whole problem. So many institutions use CRSPR and publish improvements and modifications to the technique/process that the legal landscape is a goddamn patent quagmire (giggity).\n\n&#x200B;\n\n* **Don’t believe me that CRSP’s patent game is weaksauce?** Check out this link: [Crispr patents by institution.](https://www.investorvillage.com/smbd.asp?mb=1933&mn=153484&pt=msg&mid=21490140) It has a 2019 table put out by IPlytics showing the # of crispr patents owned by different companies/institutions.\n\nThe first two companies are big agra.\n\nThe next 4 are UCSF, Harvard, MIT, and UPenn.\n\nRight after that is SGMO.\n\nCRSP isn’t even on the goddamn map.\n\n&#x200B;\n\n* **So SGMO owns the patents covering some of the IP CRSP is trying to use?** YES FUCKING YES \\*bangs table\\*. At least they sure AF do for this one covering BCL11A promotor genes: [https://www.investorvillage.com/smbd.asp?mb=1933&mn=153565&pt=msg&mid=21490140](https://www.investorvillage.com/smbd.asp?mb=1933&mn=153565&pt=msg&mid=21490140)\n\n&#x200B;\n\n* **What’s a BCL11A promotor gene?** I highly doubt at anyone really gives a shit, but it is a nucleotide strand that causes increased expression of genetic material following its locus in a DNA strand. If you can target insertion of it “in front of” the gene you want to express (maybe genetic material encoding clotting factor in hemophilia) it ramps up expression of the subsequent gene. It doesn’t really matter. What does matter is that SGMO has a shiny new patent on it and CRSP is going to get taken to town (and not to have a lovely date at Olive Garden) by all the other IP departments of universities and SGMO if they ever manage to get a therapy approved.\n\n&#x200B;\n\n* **Rake, no big pharma company would be so stupid that they marketed a therapy covered by another company’s patent, right????** Well, Merck had to pay Bristol-Myers Squibb a one-time settlement of 625 million and subsequent sales royalties of 6.5 percent the first 5 years to market, and 2.5 percent the next 2 years on market for Keytruda (pembrolizumab) because BMS had IP protection on the use of anti-PD-1 antibodies.\n\n&#x200B;\n\n* **That must’ve been a one-off screw up, right?** Unfortunately not. Kite had to pay Memorial Sloan Kettering Cancer Center 752 million for IP infringement surrounding Yescarta. That was after Gilead paid 11.9 billion to acquire Kite.\n\nBoth patent disasters are detailed in this IV article: [https://www.investorvillage.com/smbd.asp?mb=1933&mn=153598&pt=msg&mid=21490140](https://www.investorvillage.com/smbd.asp?mb=1933&mn=153598&pt=msg&mid=21490140)\n\n&#x200B;\n\n* **Of note, SGMO’s proprietary gene-editing technology, Zinc-finger-nucleases, are wholly owned proprietary tech.** And it has [better precision and specificity than CRSPR](https://t.co/uKtI6vrAeb__;!!Cjnu1T6GFXg!6oZ04-OqlWutwVsIdNAOAKQ-IlWoIkV_CL4WnJbLO1Q-WZ02b883DiQUGphgBOdnxRvphNk3Wg$).\n\n&#x200B;\n\n* **Why are they letting CRSP develop the tech and bring it to market?** You make more money that way? Patent trolling is pretty reprehensible, but if you can just let someone else put in all the money for development and clinical trials and marketing and FDA approval, then just sue them for royalties, you’re going to make a shit ton more than if you did the upfront work yourself.\n\n&#x200B;\n\n* **You mentioned ARKG?** Yeah, because SGMO isn’t included in it yet. But Takeda and Novartis (both partnered with SGMO) are. There is suspicion SGMO might make an appearance on the list soon because it’s massively undervalued, and it would only make sense to shift profits from all the other gene-therapy hockey-stick runups this year to diversify and invest in something with room to run. Don’t take it from me, [this analyst](https://www.linkedin.com/in/jo-mama-7774ba1bb) believes SGMO is a prime choice for inclusion in ARKG. If you reviewed his linked in profile you might be interested to know he also is overweight on DEEZ with an upside target of $69.\n\nGot eem aside, if SGMO is included in ARKG it will experience a wicked bump in price just the like ARKG holding that has a low market cap and banned ticker that farms genetically modified salmon. They were at about $3-$4 a share for a loooooong time before ARKG inclusion and have since rocketed to a new normal of $9-$10 a share. The ticker starts with an “A” and ends with a “B” and theres a “Q” in the middle if you want to peep some hot price action.\n\nHonestly, from what I can tell, it's mostly rumors at this point, but I highly doubt Our Lady of Gains Cathie Wood would not dip her toes in the SGMO pool.\n\n&#x200B;\n\n* **Shouldn’t funds like ARKG already know about SGMO?** I suspect they do, but way more importantly all the big pharma partners I mentioned earlier do. I said it before and I’ll say it again- those guys know a hell of a lot more than I do about what works, and it’s probably the main crux of my thesis.\n\nUnless SGMO’s CEO Sandy Macrae is Elizabeth Holmes 2.0 and this is a hilarious Sangameranos situation where I lose most of my retirement, things are looking pretty goddamn rosy.\n\nAnd trust me, Sandy Macrae is nowhere near the level of charismatic as Elizabeth Holmes is. Excellent CEO, strong clinician focused on safety first, able to turn this company into a powerhouse through acquisitions (TxCell) and partnerships- yes. Charismatic, kinda hot with crazy eyes and deep Venture Brothers [Dr. Girlfriend](https://youtu.be/2rs7VVjz5A8__;!!Cjnu1T6GFXg!__RIcIDFTSmG7OdGlGLgvdEQh3gV5d43LeHXCqDyyIjUP28_p4pbc2G9jmchEUBAjRHnzHT4LA$) dominatrix voice like Mrs. Holmes- nope, not even close. Listening to this guy talk is like watching paint dry while you’re stuck in an elevator someone farted in, so I’m assuming he must actually be peddling something good. Macrae is selling the STEAK, not the SIZZLE.\n\n&#x200B;\n\n* **You seem to link a lot of IV articles, what’s up with that?** I’m just trying to distill down the important points for my fellow autists riding the short bus with me. PS, if my boy bct1192 from IV is reading this- much love, and know that “undiagnosed autist” is a strong compliment in the parlance of this forum.\n\n&#x200B;\n\n* **Legit stacks? For real-real? Lunar Tendies?** Trust, WSB fam. I posted a YOLO screenshot in my first article before the pop this week, it was more than 51% of my IRA, and that’s just one of my 5 investment accounts.\n\n**TL;DR summary**\\- SGMO undervalued, owns the patents to CRSP. SGMO stock price should go up 4x to be equivalent market cap.\n\n**TL;DR Investment moves**\\- **Buy SGMO shares** since they are still relatively cheap, otherwise LEAP calls like **Jan ’22 $25 strike**. I say leaps because it's going to take off, but I'm not miss Cleo, you can't call me now, and I don't know when share price will go up. I don't want my bros losing out on a short-dated disaster. My conservative target price is $25 by EOY ’21. Long term target price $45 by EOY ’23 (following hemophilia A approval with Pfizer).", "id": "klfpgo", "created_utc": 1609117174.0, "score": 83, "upvote_ratio": 0.95, "num_comments": 93, "comments": [{"body": "Don’t worry BCL11A promoter gene, I give a shit 🧬", "score": 23, "replies": [{"body": "Glad to hear shits are given! 🤌💩", "score": 1, "replies": []}]}, {"body": "I love it when I read a convincing dd, decide to put some money in it, only to discover I've already got 100 shares in my account.", "score": 16, "replies": [{"body": "Getting shitfaced and day trading until you blackout works out sometimes.", "score": 4, "replies": [{"body": "Trading and alcohol is like playing pool. There's a level about 2 or 3 drinks in where you can't miss. Unfortunately, I always blow right past that into the sloppy game stage", "score": 4, "replies": []}]}]}, {"body": "Don’t understand shit. Chart looks good. In it for the eventual ✈️🚀", "score": 14, "replies": [{"body": "Buckle up, buttercup.", "score": 3, "replies": []}]}, {"body": "$100 in", "score": 11, "replies": []}, {"body": "sitting on $50k in calls and 1900 shares. see you all at $40.\n\nsee my post history for more validation of OPs thoughts.", "score": 10, "replies": [{"body": "😳🤜🤛 youre the man.", "score": 4, "replies": [{"body": "if Cathie takes a position, see you at $40 7 trading days after", "score": 2, "replies": [{"body": "Your DD is really good- is $40 your PT?", "score": 1, "replies": [{"body": "yes, momentum is all that matters in this market. $40 is possible, by Feb, if they provide some details with Novartis around ZFN 2.0.", "score": 3, "replies": [{"body": "I’m considering cashing out half shares at $25- my cost basis is in the 9’s, so that would pay back original investment.\n\nIf we make it to $40 land I’m going to be selling calls against those lots for income.", "score": 1, "replies": [{"body": "I’ll cash out nearly all my options at $25.", "score": 1, "replies": [{"body": "I’ve converted a few ITM $8 and $10 strike Jan ‘22 calls to a larger quantity of $20, $22, $25 strike Jan ‘22 calls to increase my overall delta", "score": 1, "replies": [{"body": "i like it. i have a LOT ITM $11 1/15/21’s and $12 2/19/21’s. i’m looking to make a move wednesday or thursday. we will see.", "score": 1, "replies": [{"body": "Yeah, since I expect SGMO to keep rising, my delta is maxed at 1 per those ITM calls, I want more delta (more OTM calls) paying me as SGMO rises. \n\nI don’t intend to hold them to expiry since I have a short term PT of $25. If I can get a good % return as those new calls approach ITM at some point this year I will cash out most of them", "score": 1, "replies": [{"body": "I think we need another SGMO thread that is a short analysis. PM if you want to collab.", "score": 1, "replies": [{"body": "100%", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Since I work in scientific research I have a tendency to look at biotech/pharmaceutical companies. Your analysis has me interested so I just jumped in on this.\n\nWhat do you think about VRTX? They seem a bit undervalued right now and with room to grow as well.\n\nI just missed the Myovant Pharmaceuticals rocket so I am kicking myself over it.", "score": 8, "replies": [{"body": "I’m in MYOV for a good stake, I’d say it’s going to $55 LT. \n\nNo opinion on VRTX.", "score": 5, "replies": []}]}, {"body": "Thanks for bringing this up. Def trying to find undervalued genome stocks rn", "score": 8, "replies": [{"body": "This is your best bet, hands down.", "score": 2, "replies": []}]}, {"body": "Good DD mans, thanks. Don't know much about this space. How does this compare to EDITAS, would it have that sort of potential to spike up like $EDIT has done recently?", "score": 6, "replies": [{"body": "See the linked post to Twitter comparing to EDIT underneath the table.\n\nAnd yes, I think it’s going to *at least* reach EDITs market cap", "score": 2, "replies": [{"body": "read through it. Looks like they have better financials and future potential then EDIT even. More things in the pipeline and at a later stage. Solid partnerships/agreements in place. Very enticing/seems undervalued for sure", "score": 6, "replies": [{"body": "RIGHT? Seems glaringly obvious. I think actual Wall Street missed this one for a long time and is starting to load in. The valuation discrepancy is stark.", "score": 3, "replies": [{"body": "especially with more eyes and buzz around genomics and how those other companies have been popping off..opening up a position on this today. Hope you're not pumping man :((", "score": 4, "replies": [{"body": "No dude see my orig post- it’s more than half my tradeable retirement. I included a screenshot. Just trying to pay off my 6-figure student loans before I’m retired", "score": 2, "replies": []}]}]}]}]}]}, {"body": "You had me at giggity", "score": 7, "replies": [{"body": "You know it 😎", "score": 3, "replies": []}]}, {"body": "I have had this for almost two weeks, it has made me a lot of tendies. I'm long on this one.", "score": 5, "replies": [{"body": "Glad to hear it! Make sure to cash gains along the way, buy dips etc etc. Almost everything has pullbacks, and this stock’s price history is very wonky.", "score": 3, "replies": [{"body": "With cashing gains, would you recommend closing long positions like your 2022 $25 strike on good days and reentering a similar strike on a dip? Or would you just try to buy in more on a dip? I am very new to this sector and have little to no experience on how to play these stocks successfully. Great DD though, best I've seen on here for a while. Much appreciated and I hope you make some extravegent tendies from this play in the long term🚀", "score": 2, "replies": [{"body": "Oh man that’s like a major trading philosophy question that is so situation-specific I don’t think I could give a comprehensive answer I’d be confident in. Kind of of one those things you learn through experience.\n\nIf you make 100% gain you could always cash out half your position and let the rest ride? But 100% don’t always happen.\n\nMaybe someone else reading this has better advice?\n\nI don’t know everything. Just DD on SGMO 🤓", "score": 3, "replies": [{"body": "Fair enough, brother! Let's ride this bad boy all the way to Tendie Town🚀", "score": 3, "replies": [{"body": "Giddy up!!!!’ 🤠🤑", "score": 2, "replies": []}]}]}, {"body": "Profits are profits. How is your position sizing? Whats your target or goal when you entered? If you cash out, where to next? \n\nLetting profits ride is risky but it’s how you get 5-10x’s too.", "score": 1, "replies": []}]}]}]}, {"body": "Any idea when the next follow catalyst will be? I just put my last $3k (shares) in it. Think it can blow up like edita?", "score": 4, "replies": [{"body": "I linked to a list of catalysts in my first article. There is a gene therapy summit with Sanofi in March, but the absolutely most solid major catalyst is PFE hemophilia approval, I think it will be late ‘22 early ‘23\n\nHere’s first DD I did: https://www.reddit.com/r/wallstreetbets/comments/kh7x4x/sgmo_investment_thesis_full_dd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf[sgmo did](https://www.reddit.com/r/wallstreetbets/comments/kh7x4x/sgmo_investment_thesis_full_dd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nDon’t be discouraged by pullbacks. Looking at the price history this was beaten down for a long time but there’s a new floor in. And if you check out the pipeline if even ONE of the programs is a success this thing is still undervalued. And the dose response curve for hemophilia and gene therapy PFE presented at ASH is such a strong correlation I consider it 95% POA", "score": 2, "replies": []}]}, {"body": "is this a long term hold? looking at AT history it much resembles the sunspots time series lol.", "score": 4, "replies": [{"body": "Yeah super long term. More price appreciation soon though.\n\nMy first article mentions the prior jump to $25 was hype around an unpartnered in-viv0 gene editing for MPS called CHAMPIONS 1/2 trial. It worked via integrase assay of liver biopsy, but not a a level that had any clinical outcomes. Turns out it’s not easy to edit genes in live patients. \n\nSince then, lots of improvements and partnerships. My thesis has nothing to do with that program, which seems to be functionally on hold at the moment.\n\nIn-viv0 editing is the holy grail of gene editing, but luckily it’s only one of the modalities SGMO is pursuing. That’s the end-all be all goal, but they are going to cure hemophilia and some other diseases in the meantime to raise more cash for that.\n\nI appreciate the reference to a sunspots time series- I did a LOL IRL, thank you. Deep nerd shit there.", "score": 3, "replies": []}]}, {"body": "in for 2023 leaps at $20... solid DD! Much appreciated bro!", "score": 3, "replies": [{"body": "I published my first DD last Sunday 12/20, but it’s still a good time to buy imho. And yes, I own some 2022 $20 LEAPS myself, got more this AM. Going to roll out to ‘23 if necessary", "score": 3, "replies": []}]}, {"body": "thanks. i bought four 8jan21 35C", "score": 3, "replies": [{"body": "I bet those OTMs were cheap as shit- more room to run.", "score": 1, "replies": []}]}, {"body": "This is great DD and I’m actually interested but am I the only one who at first glance clicked because I thought I saw $GME not SGMO", "score": 3, "replies": [{"body": "I should, just to be a dick, put “not GME” in the title as clickbait", "score": 1, "replies": []}, {"body": "Whatever it takes to make tendies. GME SGMO, can’t lose.", "score": 1, "replies": []}]}, {"body": "Another thought to add to OP, ONCE acquisition date of 2/2019 at $4B then at a 122% premium to the closing price.", "score": 3, "replies": [{"body": "122% gains sounds noice. I’d take that", "score": 1, "replies": []}]}, {"body": "Holding 20C 5/19/21.", "score": 3, "replies": [{"body": "A wise decision 🍷", "score": 1, "replies": []}]}, {"body": "I pulled a nice 18k on December 10th.  It had the most beautiful 15-minute chart you've ever seen on a stock and took a small gamble.  Wish I rushed more than 2k, but a 9-bagger is still good.", "score": 2, "replies": [{"body": "That’s killer!\n\nHow’s chart looking now? I am too dumb to understand TA haha", "score": 1, "replies": [{"body": "There is a lot of strength in the chart.  Use the other gene stocks as a correlation to it's movement, so if everyone is down in the sector is not the stock which is likely what's happening for the last 30 minutes.", "score": 3, "replies": [{"body": "Thanks much appreciated 🙏", "score": 1, "replies": []}]}]}]}, {"body": "Dear OP, what is your opinion on a boyout of Gilead?  Some ppl are comparing it to Celegene. [Link](https://www.reddit.com/r/investing/comments/kiurga/buyoutmerger_conspiracy_the_exact_same_users_on/)", "score": 2, "replies": [{"body": "GILD buyout is possible, and $CELG is a nice comp, but my take is BPs are looking at smaller targets with more potential.", "score": 3, "replies": [{"body": "Yes, I agree completely!!! I think a lot of larger firms are stagnating when it comes to innovation but have the capital to acquire. It happens in tech all the time, has been happening this year in biotech as well...", "score": 2, "replies": []}]}, {"body": "No opinion, I’m not educated on it.", "score": 1, "replies": []}]}, {"body": "Once the pharma Chads realize they have been scammed, edit ntla and CRSP will get ugly and will file into SGMO.  You also forgot the CEO being open to buyout and the JPM conference where their hemophilia therapy will be on display.  I was about to do a DD but you beat me to it.   I'm already all in but I will be selling weed to middle schoolers to buy m0re 30c's.  SGMO to the fucking moon", "score": 2, "replies": [{"body": "Oh I mentioned the buyout thing in first DD article: [SGMO First DD Article](https://www.reddit.com/r/wallstreetbets/comments/kh7x4x/sgmo_investment_thesis_full_dd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nSGMO is the patent Chad, about to steal CRSP’s BCL11A goth gf.", "score": 5, "replies": [{"body": "I can't read so I apologize if you said this in your ppst. But I remember seeing a few days ago that CRISPR is dangerous and could give you cancer and a micropenis", "score": 2, "replies": [{"body": "It’s ok! Have your handler read this to you: [CRISPR off target effects](https://twitter.com/mchilberg/status/1343660735721689089?s=21)\n\nIt’s not as sensitive or specific. So when they try to give you crispr-edited “huge dong” sometimes it messes up and gives you “*not* huge dong”. Or turns your eyeballs into dongs, whatever.", "score": 3, "replies": [{"body": "The iDong, Apple should get on that shit", "score": 2, "replies": [{"body": "Dude, I’d go for a Tesla-Dong over iDong any day. \n\nDongX FTW.\n\n🦾🍆", "score": 3, "replies": []}]}]}]}]}, {"body": "totally agree on Sandys comments and JPM timing. the only CATCH here is no buy out and market reaction.\n\nwe need some rocket ships in this thread \n\n🚀 🚀 🚀", "score": 3, "replies": [{"body": "🚀🚀🚀🚀🚀\n\nHonestly all we needed was possibility of buyout. I’d rather SGMO share price increase from the possibility and have them go to infinity and beyond and become the next Genentech.", "score": 3, "replies": []}]}]}, {"body": "I don't care if this is a pump post, it makes me feel warm inside and that's what counts.", "score": 2, "replies": [{"body": "Check original post. 51% of IRA, baby!", "score": 1, "replies": []}, {"body": "We need more pumps after today’s XBI reckoning!", "score": 1, "replies": []}]}, {"body": "BCT1192 what’s your Twitter handle???", "score": 1, "replies": []}, {"body": "If cathie didn’t buy it, it ain’t shit", "score": 0, "replies": [{"body": "Methinks She will. Better to have some when she does 😎", "score": 3, "replies": [{"body": "anybody else get the feeling Cathy is playing games now", "score": 1, "replies": [{"body": "I think it’s within the realm of possibility that not including SGMO was initially an oversight (I’m sure they are fully aware of it at this juncture, especially with recent price moves). The initial investor presentation for ARKG specifically called out CRISPR, so maybe someone chose intentionally to not include ZFN, but they have TALEN tech in there so who knows?\n\nI’ve also read multiple articles from professional analysts on gene therapy/editing companies that don’t even reference SGMO. It’s been in some weird investment industry blind spot until recently.\n\nIn all seriousness Cathie has had a stellar run with her funds, but it’s a short track record, fueled mostly by emerging technologies. So I’m not quick to deify anyone to the point they are infallible (aka maybe she or her team that does the gene research overlooked SGMO to some degree, at some point in time). \n\nIf it does get included in ARKG I’m going to publish another DD article that just a pic of me diving into tendies Scrooge McDuck style.", "score": 5, "replies": [{"body": "Those dumb pigs and their catchy \"crispr creme\" name", "score": 2, "replies": [{"body": "Oh crispr is “Hot Now” for sure. Steaming, in fact 💩", "score": 2, "replies": []}]}]}]}]}, {"body": "Oh yeah don’t forget ARKG owns some NVS and TAK...both of which are partnered with...wait for...SGMO  💥and boom goes the dynamite", "score": 3, "replies": []}, {"body": "lol she can’t catch em all", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They def are not responding to tweets like that. Too much risk imo.\n\nAs far as yesterday goes, XBI got thrashed and the entire sector did too. You think SGMO was bad? Look at NTLA.", "score": 1, "replies": []}]}]}]}, {"body": "I'm only 7% down on this dd so far, ill wait tho I believe,  I did zero research outside this post lol", "score": 1, "replies": [{"body": "It’s cool bro. It went up 50% after the first one I published. Just hold. Expecting a few INDs early 2021. I own 77 calls if that makes you feel better", "score": 1, "replies": [{"body": "77 calls is pretty ballsy, I might double down on the cheaper side here, no biggy my entry is small regardless", "score": 1, "replies": []}]}]}, {"body": "Well this aged poorly…", "score": 1, "replies": [{"body": "I know!\n\nIve been buying down here though. Its the only individual stock i own anymore in any meaningful way. The rest is indexes. Have a lot of shares right now. Cost basis $2.47", "score": 1, "replies": [{"body": "Biotech investing is tough.  The company has had lots of promise, but they have consistently proved unable to translate science into commercial success. Diabetic neuropathy, HIV, etc were all sold as cash cows to investors.  The next 12 months are Sangamo’s last chance we will see if she can secure funding, or head to the auction block.", "score": 1, "replies": [{"body": "The Fabry data is the reason i havent sold it all. Just waiting on how much durability with that.", "score": 1, "replies": []}]}]}]}]}
{"title": "Veteran Members: How has WSB changed over time?", "selftext": "What is different now than when you joined? How long ago did you join?\n\nHow is the sub better and how is it less gooder in your opinion?\n\nFinally, would love some open discussion about what people want to see more/less of in the future. \n\nI think a bit of meta is welcome here at this time.", "id": "klmvqo", "created_utc": 1609145517.0, "score": 75, "upvote_ratio": 0.89, "num_comments": 93, "comments": [{"body": "There used to be more variety in posts. Nowadays its stale cuck jokes and PLTR/GME rocket posts.", "score": 107, "replies": [{"body": "Also intelligent DDs and less people posting their $100 positions. There’s richer people on small street bets lol\n\nEdit: due to mods becoming outrageously gay and circle jerking each other all day", "score": 31, "replies": []}, {"body": "Yeah it was all \"go fuck yourself\" and.. well, mostly that.", "score": 7, "replies": []}, {"body": "Bullshit you must have missed the amd Lisa Su days she was plastered on this bitch", "score": 3, "replies": []}, {"body": "Gonna cuck ya wife with a 🚀", "score": -21, "replies": []}]}, {"body": "[deleted]", "score": 100, "replies": [{"body": "Agreed.. the community was definitely lost in the rapid expansion.\n\nWhen I joined in 2017ish we had about 200k members", "score": 27, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Lol it was all about the FDs", "score": 3, "replies": []}]}, {"body": "September never ends.", "score": 8, "replies": []}]}, {"body": "Nibbawithabrain wrote good DD but fuck were his calls so shit, that’s why he’s not posting still lmao", "score": 8, "replies": []}, {"body": "This 100%. It’s amazing how much more animosity people seem to have for people on the other ends of trades now.", "score": 10, "replies": []}, {"body": ">Back then it really felt like a genuine wholesome community that pretended to be toxic.\n\nAn asshole who surrounds himself with ironic assholes believes themselves to be in good company.   \nIf I had a dollar for every time I've seen this happen, I'd probably match my floundering returns.", "score": -1, "replies": []}, {"body": "Your account is 1 year old.", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Getting doxxed for browsing subs? Pretty peculiar.", "score": 2, "replies": []}]}]}]}, {"body": "Then: AMD, JNUG, MU\n\nNow: PLTR, GME, 🚀🚀🚀", "score": 91, "replies": [{"body": "Man back before all I commented was rocket emojis and GME I remember MU and AMD days good old lurker days 🚀🚀🚀🚀🚀", "score": 20, "replies": [{"body": "I am still in AMD since 35 dollarS", "score": 1, "replies": []}]}, {"body": "$MU... rip u/MartyMoho :(", "score": 10, "replies": [{"body": "There's plenty of MU 90c bagholders too", "score": 11, "replies": []}, {"body": "Damn, last post 2 years ago.\n\nHis confidence in papa Sanjay was so infectious, almost ended up following him to Valhalla.", "score": 7, "replies": []}]}, {"body": "Oh the memories of getting fcked by $60c MU FDs. Let alone 90c.", "score": 7, "replies": []}, {"body": "Bought AMD at 10, even before WSB hype. Sold at 15 to buy Pennystocks.\n\nYou can guess how much money I have", "score": 5, "replies": []}, {"body": "tbt to when i held jnug thru its deleveraging", "score": 3, "replies": []}, {"body": "don't forget SQ!", "score": 2, "replies": []}, {"body": "ARRY and M-N-K-D were being pumped as well. Actually all the 3x funds were hot back then too. Everyone was in love with binary events in biotech as well hah", "score": 2, "replies": []}, {"body": "MU 90c forever.", "score": 1, "replies": []}]}, {"body": "Like a mental institution for investors. Aged like a milk.", "score": 36, "replies": [{"body": "MILK! MILK! MILK! 🥛", "score": 6, "replies": []}, {"body": "MOTHERS MILK 🍼🍼🍼🤤🤤🤤", "score": 1, "replies": []}]}, {"body": "There was a great time some year(s) ago when SQ, Netflix ipo, swkws where the DDs were great and detailed.. that was before the „book/modchange/fakegains time“\n\nThey still are sometimes but you gotta know now. Between 4 sucking tickers there is now one great opportunity.", "score": 31, "replies": [{"body": "I've noticed a serious decline in quality since the last mod jumped ship. I used to have a lot more faith in the DDs, but now a lot more garbage is slipping through the cracks. Thankfully the roast comments are usually a good source to check the validity of the DD.", "score": 30, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "I can’t even read the post and you want me to read the comments?", "score": 7, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "That’s pretty sound logic. I approve.", "score": 10, "replies": []}]}, {"body": "What do you do then, stare blankly at the screen listening to white noise?", "score": 1, "replies": []}]}]}, {"body": "I gotta admit I've roasted TF out of some shitty DDs and gone back and checked a few months later and the stock actually did moon. Its rare but it happens lol", "score": 7, "replies": [{"body": "Not saying all roast comments are smart. We're all retarded together. But bad DD doesn't hold up against them.", "score": 1, "replies": []}]}, {"body": "I started back investing back in 2015 and this place had the best dds. Do you recommend anywhere else to find them or good quality posts?", "score": 2, "replies": []}]}]}, {"body": "DDs used to be on tickers we’ve heard of, now its a 2 line DD on some random four letters", "score": 27, "replies": [{"body": "MSFT gonna moon.", "score": 10, "replies": []}]}, {"body": "I've been here since the start of 2017 (mostly lurking). There was a lot of highlights over the years like the paper trading competition and the first \"cant go tits up\" guy (it went tits up lol). I think the community has gotten a lot more active this year", "score": 23, "replies": [{"body": "This is the kind of dd I look for here", "score": 5, "replies": []}]}, {"body": "It was a quieter party. Maybe felt like 9-10pm. There were a few wall flowers, some bros chugging beers, a small convo in the corner. I met u/findmyshark that was showing everyone in the party his magic trick.  Now it feels like it’s 2am, music is blaring, and everyone is coked out and wasted.\n\nI ended up learning how to do the magic trick, but the party started getting too crazy so I dipped out and went for a cruise to smoke a blunt and get Wendy’s.", "score": 35, "replies": [{"body": "get metaphor buddy", "score": 1, "replies": []}]}, {"body": "It was better before robinhood. Yep, I said it!\n\nDD has gone down majorly.\n\nBut meme quality has gone up!", "score": 17, "replies": []}, {"body": "There used to be actual DDs and serious conversations and also jokes ofc.\nBut now it's all about meme stocks and more memes. (The memes are good though)", "score": 19, "replies": []}, {"body": "DONT U FUCKS FORGET MANGIS TRADE WAR \n\nONE TWEET TANKED THE WHOLE MARKET 10 times a week", "score": 9, "replies": []}, {"body": "I remember Lumber Liquidators.", "score": 8, "replies": [{"body": "Fuck yeah bro that was one of the last good quality DD posts.", "score": 3, "replies": [{"body": "Lumber Liquidators 6X'd since March....who called that one?", "score": 3, "replies": [{"body": "This was long ago it rocketed then had a huge scandal.", "score": 1, "replies": []}]}]}]}, {"body": "Lots more dick references and rocket emojis now", "score": 15, "replies": [{"body": "More dick references less big dick positions", "score": 3, "replies": []}]}, {"body": "BRO we went from\nMU 90$ calls to \n\nTesla 1,000$ calls 😈😈😈", "score": 5, "replies": []}, {"body": "Been in here since 2018. Way better meme gifs back then. DD was either really detailed or some of the most austic word spewing ever. AMD and MU. The Chinese Netflix stock.", "score": 5, "replies": []}, {"body": "Back in 2015-2016 I remember three things distinctly:\n1) there was a lot of speculation on cheap drug companies with upcoming phase II or III or whatever clinical trial results.\n\n2) There were daily JNUG/DUST speculation posts.\n\n3) SUNE was the first stock I remember WSB hype train riding until the company cratered. After that it was random pharma companies and AMD. AMD really cemented the idolization as a meme loop this sub does.\n\nCutting through all the edgelord meme-ness I like how the discussions in this sub make me think about specific companies within broader sectors. I think that’ll always be here underneath all the shitposts.", "score": 6, "replies": [{"body": "Yup, that's the time when I joined.\n\nA lot of 3x leverage tickers, AMD and Bio/Pharma stocks.\n\nI remember a guy who made a million on a pharma play.", "score": 5, "replies": []}, {"body": "3x was all the rage. ARRY and M-N-K-D were hot. ARRY actually ended up doing amazingly well, you'd see daily posts like \"yer a wizard ARRY\". I also remember losing a ton on MSTX. It was a meme to link people the biotech calendar[https://www.biopharmcatalyst.com/calendars/fda-calendar](https://www.biopharmcatalyst.com/calendars/fda-calendar)", "score": 2, "replies": [{"body": "MSTX were made", "score": 1, "replies": [{"body": "I remember one day MSTX popped, I wouldn't all in at the top, then it started to fall during mid day and I lost a decent percent of my portfolio after selling low.", "score": 1, "replies": [{"body": "I remember being up 100%, then I got the news after hours and sold at a 90% loss", "score": 1, "replies": []}]}]}]}]}, {"body": "I've been around awhile, I remember the guy who would yolo on TQQQ and then buy a $80,000 cadillac with picture proof etc..\n\nI remember when biotech stocks were the yolo's\n\nMY most fond memory were the cut-downs were 5000% better and more funny than the garbage today.\n\nPeople would really drop you down and it was actually good and funny.\n\nToday we just pump chinese stocks and silver... purple etc.. lame.\n\nIt used to be TQQQ/SPY/biotech/MU and ofcourse more.\n\nBut yeah it's a huge difference the garbage today compared to years ago. I have so many stories and great memories that these kid's today on WSB don't/won't ever get to experience now that it's \"policed\" or \"held back/held down\" with new rules and garbage..\n\nI remember when we used to have fights with /robinhood and the mods would even ban anyone from WSB or Robinhood from coming over to each other's reddits'..\n\nThere was public floggins or bashings of users with mods even putting flairs on them telling everyone why and how they were gay or retarded..\n\nThere was much more fun and a great sense of community where as now it's just everyone is trying to be cool and on their own..\n\nI could go on forever.. \n\nThere were characters and personalities like no other before.. now you have just no thought out threads and people with no experience just dreaming and hoping with nobody posting any really fun or funny or even good options bets..", "score": 6, "replies": []}, {"body": "Memes have gotten better, DD and community has gotten way worse. The sub went to shit when the barstool crowd got turned on to it.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Oh shit I forgot about wolf face guy, and he's do interviews with people.", "score": 3, "replies": [{"body": "Didn’t he fake it? I heard that it was an act", "score": 3, "replies": [{"body": "Idk he was retarded so probably", "score": 1, "replies": []}]}]}, {"body": "wait you can talk?  the robot was talking.  i'm not crazy.  I KNOW WHAT I SAW!", "score": 1, "replies": []}]}, {"body": "Been here 3 years but drop and join this sub all the time because of some of the retarded advice I've taken. Of course I always come back, but even though it blew up after the big dip, the more retarded it gets the more I like it.", "score": 3, "replies": []}, {"body": "I was around (under a diff username in 2016-17). I like it better now actually, back then it was all 3x leveraged oil & gold ETFs. Agree that the repetitive pump posts on PLTR get old but there's always a few like that floating around at any given time.", "score": 3, "replies": []}, {"body": "SPY puts anyone?", "score": 7, "replies": []}, {"body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=klmvqo&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=klmvqo&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=klmvqo)\n___\n ^comment ^will ^disappear ^--- ^2 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 6, "replies": [{"body": "I've never been so happy to see you.", "score": 14, "replies": []}, {"body": "Welcome back fucker!", "score": 3, "replies": []}]}, {"body": "Not sure what the requirements are for /r/wsb, but maybe we could start one that requires verified video evidence of accounts >$100k?", "score": 6, "replies": []}, {"body": "Then: Good ideas based on fundamentals and hidden gems. \nNow: Anyone's best guess based on Facebook posts and other social media. Pump and pump and pump. No dumping, only losses.", "score": 3, "replies": []}, {"body": "People used to try to be smart. Now they try to be actively stupid.", "score": 3, "replies": []}, {"body": "I'm just a newbie in this sub but it seems like people here are babies who are missing chromosome and parents have dropped to floor. Not once or twice...\n\n\nOh and they have lots of money.", "score": 8, "replies": [{"body": "I have an extra chromosome, does that count?", "score": 3, "replies": []}, {"body": "I think you're overestimating how much money the average poster has...", "score": 1, "replies": []}]}, {"body": "Lets not forget the BYND and TLRY Moon days...", "score": 2, "replies": []}, {"body": "Started lurking like 2-3 years back. Ppl used to call each other the f-word more (will get banned now).  MU was the meme gawd stonk. Was good times.", "score": 2, "replies": []}, {"body": "Let’s not forget the rainbow colored dildo from way back in the OG days.", "score": 2, "replies": []}, {"body": "Used to post with another account here, mostly jerking it to Lisa su and TSLA. I genuinely think that PLTR retards are unbearable and pretty much ruined a large part of wsb. GME gang is much more bearable. \n\nGains from TSLA and AMD etc were much more impressive, better memes, corn gang etc meanwhile PLTR retards can’t meme for fuck and post the same few rocket emojis thinking it’s funny.", "score": 5, "replies": [{"body": "GME gang at least has a thesis behind their trade. The PLTR crew can’t offer up an explanation for why the stock should double other than “stocks only go up.”\n\nOn the bright side, the PLTR gamblers seem to be diamond handing and will likely leave the sub once they are absolutely wiped out.", "score": 6, "replies": [{"body": "What is GME gang's thesis? I haven't been on here in a while, but it seems like all the posts I see are just GME with a bunch of rocket ship emojis", "score": 2, "replies": [{"body": "The short % of float is through the roof, suggesting there could be a massive short squeeze. Rumors of a hostile takeover could lead to more buying pressure. And the company at least still has some capital and isn't facing imminent bankruptcy.\n\nIt's definitely a timing play and people will have to be smart and take profits before it comes crashing down. But at least GME holders don't think this is some stock to put into their retirement account and hold for 5 years.", "score": 2, "replies": []}]}]}, {"body": "I've only been here for around a year, but yes, PLTR has been the most annoying thing to happen to this sub, tendies or not.", "score": 2, "replies": []}]}, {"body": "There is a large amount of newfaggots here", "score": 1, "replies": []}, {"body": "Back in the day it was a pretty wholesome community of smart people who liked to gamble and pretended to be toxic idiots. Now it feels more like a pretty toxic community full of degenerate gamblers blindly jumping on the hype train.\n \nI’ve been around since like ‘13? Whenever FSComeau was doing his thing.", "score": 1, "replies": []}, {"body": "Me n my friend would always lurk on this shit back in 2017-18 when Lisa su was the shit and Tesla earnings was like two cavemen finding fire for the first time. \n\nWhen that retard pulled off the first successful pump and dump with Lumber Liquidators and every single one of you idiots fell for that shitty ass company that went bankrupt the week after he posted that shit.\n\nAlso the funniest thing to ever happen on this sub was the paper trading competition and u/chainsaw_ vasectomy hired that old ass dude on fiver.\n\nTimes were simple back then", "score": 1, "replies": []}, {"body": "SPY weeklies everywhere, no one cared about Chinese EV plays.", "score": 1, "replies": []}]}
