{"title": "IV crush?", "selftext": "I got tsla 145 puts for 4/26..earnings are on tuesday 4/23. If all goes right I expect tsla to dump after earnings but can I be a victim of IV crush?", "id": "1c9t9nn", "created_utc": 1713734948.0, "score": 20, "upvote_ratio": 0.7, "num_comments": 73, "comments": [{"body": "Hard to find anyone who isn't short tsla or holding puts for this earnings. It is the \"obvious play\" which worries me. There is an incredible amount of money to be made on the back end if this thing pops or goes sideways. I think if I grab puts it's going to be with an extra week or more til expiration.", "score": 43, "replies": [{"body": "I did this, bought 20 5/17 90p at 29$ a contract just incase it doesn’t do anything on earnings. I still think it’s gonna sink hard here over the next few weeks though", "score": 8, "replies": [{"body": "how would theta work with that?", "score": 2, "replies": [{"body": "With it being 3 and a half weeks out for expiration I believe it wouldn’t be affected too much, given Tesla is already a fairly volatile stock, if earnings stay flat.", "score": 3, "replies": [{"body": "not to pry to much but what’s your plan with your position. what percentage gain are you looking to sell at or do you plan on holding till exp", "score": 3, "replies": []}]}]}, {"body": "$29 per contract? That’s pretty expensive tho.", "score": 2, "replies": [{"body": "It ended the day at $47 a contract, started at 63 a contract this morning but I feel strongly about Tesla falling further.", "score": 3, "replies": [{"body": "I agree it will fall further but I think it will fall til 120 or smth. I don’t think it will drop more than that so be careful with the strike price.", "score": 1, "replies": [{"body": "If it hits 120 this week Im estimating id make a decent amount, given it still has time with the expiration", "score": 3, "replies": [{"body": "I don’t think it will hit 120 this week. At the most, it will hit 130 but that’s about it. Over time it might hit 120 but that’s probably the lowest I am predicting", "score": 2, "replies": [{"body": "In all respect, I hope you’re wrong for the sake of my puts lmao but that does seem reasonable", "score": 2, "replies": [{"body": "The funny thing is that even if it hits 130, it may not make money for 4/26 130 strike given how weird Greek plays or behaves.", "score": 2, "replies": []}]}]}]}, {"body": "My plan was to sell after earnings and before the end of the week.", "score": 1, "replies": [{"body": "I am eyeing on either 135 or 130 4/26 but we will see. Gotta decide which one to go after like BA or TSLA", "score": 1, "replies": [{"body": "Good luck with your choice.", "score": 1, "replies": [{"body": "U2 buddy! Hope you hit the jackpot :)", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "They’ll pop for earnings so all our puts will expire worthless then will continue back down into next week. Your concerns are warranted but I think it’s to the point where we need to inverse the retail hivemind.", "score": 4, "replies": []}, {"body": "Nailed my prediction", "score": 4, "replies": []}, {"body": "Remind me not to hold my shorts across earnings", "score": 3, "replies": []}, {"body": "I bought calls", "score": 1, "replies": []}]}, {"body": "since you have such a close expiration your trade is pretty much the implied move vs the realized move. You need to see a move larger than implied in the direction you bet on. That will determine your PnL. Nothing else is really too siginificant.", "score": 26, "replies": []}, {"body": "Based on what happened to tsm, I say put your entire life savings into calls", "score": 9, "replies": [{"body": "You were right", "score": 1, "replies": [{"body": "As the one who guards, but can never touch the treasure, I decided to throw my money into puts after I said that", "score": 4, "replies": [{"body": "Damn... didn't we all.", "score": 1, "replies": []}]}]}]}, {"body": "I would avoid trading $TSLA this week, whether it's PUTS or CALLS. Lately, $TSLA has taken quite a beating (rightfully so) however, while other stocks were plummeting last Friday, one would have expected $TSLA to follow suit and plummet as well, yet it remained relatively stable. The 52-week low hit $146 on Friday, and personally, I find it difficult to believe that it will decline any further. Just be careful and avoid the headlines.", "score": 18, "replies": [{"body": "Appreciate your opinion. I dont really have a choice now, im hoping for a dip after earnings and take some profit", "score": 4, "replies": [{"body": "You might get an opportunity to make some profit but im with Takeoff on this… tsla has been beaten down pretty bad and im personally not expecting it go lower than $140 this week…. I think earnings is relatively priced in. Trade with caution", "score": 5, "replies": []}, {"body": "Are you at profit or at loss now? If you are at some profit or even at break even, I honestly would think twice before earnings to holding $TSLA.   \n  \n$TSLA and $META are two stocks I would never trust, they are always in headlines and there is always something with them - good or bad.", "score": 3, "replies": [{"body": "20% profit as of friday", "score": 0, "replies": [{"body": "Get out.  Everyone here will probably say the same thing where it’s so volatile that up 20% is good enough.  We all probably guessed right and been burned during earnings.  If it was as simple as good earnings, people would be all over it every earnings.  It comes down to so many little things on calls that people pick up on.", "score": 7, "replies": []}, {"body": "come on, 20% profit is more than ideal, I mean what are you expecting - what's your exit plan? Are you expecting 100% profit or something?", "score": 7, "replies": [{"body": "Lol I was waiting til earnings but the more im reading and hearing opinions I may sell tomorrow depending on whats going on in the morning", "score": 1, "replies": [{"body": "Lmao that 20% will turn into -20% on Wednesday morning even if it goes down. It has to go significantly down your strike price to make some return. Get out tomorrow morning if ya re not sure about what ya re doing.", "score": 6, "replies": []}, {"body": "roll them over to at least 5/10 if you're going to hold this through earnings, anything can happen and you don't want to get screwed", "score": 2, "replies": []}]}]}]}]}]}, {"body": "This stock is going sub 100.  Mark my words. I hope not, as I just rolled my position, but the fundamentals are really bad for this company right now, not even taking into consideration the fundamentals of the economy overall.", "score": 4, "replies": [{"body": "You are correct, unfortunately with TSLA or any other Nasdaq stock recently, no one is looking at fundamentals. Look at what happened to NFLX and SMCI. Unfortunately, its \"other news\" not company related chatter that is impacting the stock movements. One moment there is a war about to breakout with Iran and the price of oil skyrockets and the markets plumment, and the next hour...all is fine, it was just a misunderstanding and auto-correct on the iPhone made a typo and now the oil is at all time low and stock markets skyrocket - it's not easy being a trader :)", "score": 10, "replies": [{"body": "No one is looking at fundamentals?  Since when do traders look at fundamentals?", "score": 3, "replies": []}]}]}]}, {"body": "Not only a victim of IV Crush but of IV Tush.  That'll get you in the butt every time.", "score": 4, "replies": []}, {"body": "Most definitely.A spread would have been wiser.Mean IV for TSLA is around %60,that expiration is around %110 right now.Not sure what it was when you purchased them but I would guess you are going to see about a 20-30% drop immediately.With a Vega exposure of .067 I’d estimate a $2.00 loss due to IV crush alone.With a delta of .40 or so you would need to see ~140 to beak even,sub 140 for actual profit.Good luck.", "score": 9, "replies": [{"body": "Appreciate the info. I went into this play with hopes that it would go below 140🤞Been slowly learning about IV and theta so any profit at this point is cool. IV was at 80 when I purchased, its sitting at 104.", "score": 5, "replies": []}, {"body": "You sure don’t want to beak even said the bird!", "score": 2, "replies": []}]}, {"body": "Holding short-dated options into an earnings call is one of the biggest rookie mistakes you can make. Might as well go to the casino.", "score": 3, "replies": []}, {"body": "just make sure you have made enough preparations before buying options so that in case reduce the risks of losing money.", "score": 2, "replies": []}, {"body": "i got 125p you fine", "score": 2, "replies": []}, {"body": "My model is forecasting an IV drop of about 30 points after earnings. \n\nMultiply 30 * -vega to estimate your loss due to IV crush. Looks to be about $1.80 per contract (or $180 in absolute terms) using a vega of .06\n\nSo you’d have to be at least another $1.80 in the money below your breakeven to survive the IV crush if the model is correct. \n\nNot financial advice. No guarantee the model is right. I’m just a random dude on the internet.", "score": 2, "replies": [{"body": "also if your plan is to hold to expiry, then it doesn’t really matter. they’re either in the money or they’re not. IV crush doesn’t change intrinsic value of the contract. \n\nand extrinsic will go to near 0 at expiry anyway regardless of vol", "score": 2, "replies": []}, {"body": "But yeah this is the obvious drawback of buying options into earnings. Short calls or short shares might be a better play if you’re mainly worried about IV crush. \n\nBut obviously short calls have limited upside / undefined risk. And short stock is more capital intensive (and also has undefined risk). \n\nBuying a put spread might be a better move since your short put would give you some positive vega to help cushion you. But you’d be capping your upside and you’re still net short vega", "score": 1, "replies": []}]}, {"body": "Most of these comments have aged very well.", "score": 2, "replies": []}, {"body": "Your puts are worth zero dollars.  Pro tip: IV isn't relevant when you didn't even get direction correct.  Worry about that first.", "score": 2, "replies": []}, {"body": "You got crushed…forget the IV, you need a something for the pain.", "score": 2, "replies": []}, {"body": "Yes. The stock will have to drop favorably in beyond the implied move in order for you to make a profit. It also has to offset any theta decay, etc. Basically, you're going to need it to drop below $145 at the very least.", "score": 3, "replies": [{"body": "It's already there in the 24 hour market", "score": 3, "replies": []}]}, {"body": "Itll hit at least 137 this week", "score": 2, "replies": [{"body": "Agreed.", "score": 1, "replies": []}, {"body": "130", "score": 1, "replies": []}]}, {"body": "Hey man I'm in the same exact boat as you, loaded up on puts Wednesday, Thursday and Friday to hold through earnings\n\nNo fear baby", "score": 3, "replies": [{"body": "Im ready! This weekend has gone on long enough lol", "score": 3, "replies": [{"body": "If you're into crypto check out Aerodrome and Alienbase!\n\nShould help make weekends more fun", "score": 1, "replies": []}]}]}, {"body": "You need to estimate the pre-earning implied move… if the move after earning is less than the implied move that is priced in the premium, then you need to run fast💯", "score": 1, "replies": []}, {"body": "How far OTM are you guys buying your puts for tsla?", "score": 1, "replies": [{"body": "130, 125, 100 MAY31\n\n150MAY24\n\n150JUN24", "score": 2, "replies": []}, {"body": "Jan 2026 $100 Puts", "score": 2, "replies": []}, {"body": "End of march, bought $170 puts to expire 4/26.  They are more than offsetting my NVDA calls that I have refused to sell (like a dumbass)", "score": 1, "replies": [{"body": "Oof gl with those", "score": 1, "replies": []}]}]}, {"body": "Yes, just watched a YouTube video from tech conversations, if you check the options calculator. You'll need a good move to make profit. Too small and you'll lose money", "score": 1, "replies": []}, {"body": "All this talk of everyone wanting to buy puts makes me want to sell some puts and enjoy the IV crush that everyone else is concerned about.", "score": 1, "replies": []}, {"body": "Of course implied vol will contract after earnings.  The big stock movement will or will not happen and then the vol will get sucked out.  That's the way it's supposed to work.", "score": 1, "replies": []}, {"body": "definately can, iv fades hard after earnings. if ur iv is like 150/200 id expect it to be like 110 max at 9am and keep falling from there. not saying you cant play but the crush will be real", "score": 1, "replies": []}, {"body": "You gotta learn the greeks before buying options..", "score": 1, "replies": [{"body": "Definitely in the process. Best way for me to learn is being in the game", "score": 2, "replies": []}, {"body": "you have to understand and respect them, and understand how to tame them.  With $TSLA you have an implied move around 10%.", "score": 2, "replies": []}]}, {"body": "yes", "score": 0, "replies": []}]}
{"title": "XLK and AAPL? Long term ", "selftext": "What are people’s thoughts on apple? Is it a good long term investment if I was to start now for the next 20 years? \n\nI have about 8% of my portfolio going into XLK (tech sector ETF) and want to start accumulating apple stock with another 5% allocation. Is this stupid? Is it too much apple ?", "id": "1c97oam", "created_utc": 1713668203.0, "score": 40, "upvote_ratio": 0.79, "num_comments": 66, "comments": [{"body": "My 2 cents:\n\n- it’s impossible to say if AAPL will continue growing the way it has for over a decade but it won’t stagnate for sure\n- They’re extremely good at innovating for customer centric technology and devices\n- No harm holding at all", "score": 38, "replies": [{"body": "[deleted]", "score": -29, "replies": [{"body": "Do you even know what innovate means? Lol. It’s literally to take something existing and make it better. Which is exactly what you said Apple does.", "score": 17, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Cambridge: To introduce changes and new ideas. \n\nWebsters: make changes in something established, especially by introducing new methods, ideas, or products.\n\nDictionary.com: to introduce something new; make changes in anything established.\n\nThey all say the same thing. To make new or change something that exists. You literally said the exact same thing. “They simply made existing things way better”\n\nI’m not trying to be a dick, but the definition could not be more clear.", "score": 2, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Not gonna argue with you. If you wanna define a word differently, feel free. Downvotes are there for a reason tho.. Hope you have a great day!", "score": 4, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "lol ok dude. Facts don’t matter. So long as someone reads it. Again. Have a great day", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Good luck in life man. I’ll get someone to pray for you.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not religious. Wouldn’t know who to pray to. ¯\\_(ツ)_/¯", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Take a look at what was available before the IPhone 1 and tell me again how they didn’t invent the smartphone.\nThe stuff we had before wasn’t smart at all.", "score": 8, "replies": []}, {"body": "Man they literally INVENTED smartphones from 0 nothing close to that existed before other than in sci-fi movies if thats what you mean.", "score": 5, "replies": [{"body": "Apple did not invent the smartphone....", "score": 5, "replies": [{"body": "Anyone else made smartphone as we know today before Apple? Are you counting phones with keyboard occupying half of its surface area with a tiny screen as smartphone? The smartphones as we know them today was invented by Apple. Nobody even dared to consider a multitouch all screen surface with dynamic UI elements beforehand.", "score": 8, "replies": [{"body": "Blackberry, Palm, and honestly can’t remember if droids existed before iPhone or after", "score": 0, "replies": []}]}, {"body": "Anyone else made smartphone as we know today before Apple? Are you counting phones with keyboard occupying half of its surface area with a tiny screen as smartphone? The smartphones as we know them today was invented by Apple. Nobody even dared to consider a multitouch all screen surface with dynamic UI elements beforehand.", "score": 1, "replies": [{"body": "\"As we know today\" completely moves the goalposts of your initial statement. They advanced upon technology. \n\nFirst Touchscreen Phone (1992)\nThe IBM Simon was the first of its kind when it came out in 1992. This phone was the 1992 version of today's I-Phone. It was touch screen, portable, had a calculator, email, and could work on networks.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Not just this sub. Reddit has gone to shit over the years with misinformation.", "score": -6, "replies": []}]}]}]}]}]}, {"body": "For me too much Apple. Since you have 20+ years might not be a bad idea. I would recommend to just stick with XLK though. Another Tech etf I would look at is IYW. Higher expense ratio but higher returns and includes meta and google.", "score": 21, "replies": [{"body": "No he is wrong invest in Apple", "score": 5, "replies": [{"body": "Why?", "score": -1, "replies": [{"body": "Apple has consistently out performed the market the last 25 years. Look at YTDReturn.com.  Their growth might slow down because of competition but they have the market capitalization to diversify and continue to put money in R and D. Their I Phone will continue to be a market leader.", "score": 3, "replies": []}, {"body": "They are ahead on hardware for ML. Can’t speak to 20 years, but the next 5? Yes", "score": 2, "replies": []}]}]}, {"body": "Have you looked at IGM?", "score": 1, "replies": [{"body": "Yes but can’t remember the reason I went with IYM over it.", "score": 2, "replies": []}]}]}, {"body": "I was 90% apple and sold all my leaps and stock last week before the big drop. My reasoning is based off the news that they are investing in manufacturing in Vietnam and other Asian countries and, reading between the lines, it says to me that China is not a viable long term solution for manufacturing and it may even not be a viable market for Apple products for too much longer. \n\nI have friends in China who blames the US for random problems they’re experiencing, and I see nationalism on the rise, meaning they’ll be buying made in China for the foreseeable future. India might be a future market for Apple but I doubt it’ll be as impactful as China.", "score": 20, "replies": [{"body": "Greedflation is causing consumers to be cautious of what they need and choose to spend their money on. My enthusiasm for IPhones is wanning. I want a quality product that will last especially if I’m shelling out about $1000 for a phone. I don’t want to replace it every few years.", "score": 3, "replies": []}, {"body": "Valid negative points. \n\nPositives I see is that apple is very well positioned to benefit from AI and this hasn't been 'priced in' yet since apple is a bit slow to innovate and AI is still early. \n\nAI requires tons of capital, the best talent, huge amounts of cutting edge hardware, enormous amounts of data and preferably an existing audience. Very few companies have all this. \n\nSo my theory is over the next 5 years as AI actually becomes useful and integrated the companies that benefit like apple will outperform the sp 500.", "score": 2, "replies": [{"body": "I’ve thought of this and the best case for Apple is to walk back their stance on privacy and allow their AI to use data from iPhones, iPads, etc. Recently they bought an AI company with plans to do computer learning on an individual level. Not sure what the game plan is but I imagine this won’t catch up to other big companies like Microsoft and Google. \n\nA shower thought I had the other day was the partnership with Google to provide AI is a way to go around their privacy stance by using a third party as a data aggregator.", "score": 1, "replies": []}]}, {"body": "Thanks for good insight. Seems to make sense. But for the long term 20+ years does that matter?", "score": 1, "replies": [{"body": "I just don’t see what product or service they have to keep their current valuation or even some growth in 20 years. Services? That needs a product. And without China to buy Apple products, there’s only India that can provide some growth. Perhaps the Vision Pro will catch on but it’s too expensive at the moment.\n\nI do have a prediction though. Apple will develop a smaller chip and insert it into their watch, which means the watch will replace the iphone at some point. This coupled with the Vision Pro can bring some life back into the company.", "score": -7, "replies": [{"body": "NPUs. I view Apple aligning with Nvidia for keeping ahead of the curve for hardware that can train LLMs and all ML tasks moving forward.\n\nIf you think Nvidia is good long term, so is Apple imo", "score": 2, "replies": [{"body": "What is Apple’s NPU? And what is apple’s hardware to train LLM? I’m unfamiliar with Nvidia so I never invested in that stock, but I do hear about it constantly.", "score": 0, "replies": [{"body": "Have you heard of AI? \n\n“AI” is a predictive machine learning model that predicts the next word (in the subset of ML that is language processing). \n\nIt requires a lot of hardware resources to run and train/build/test these, and in general ML and Deep Learning type computing is exploding in popularity. \n\nRight now, everyone is racing to get the hardware to power this stuff, but none of the hardware out there was specifically designed for this. Nvidia has a dominant lead on the hardware design and they can’t keep up with demand for production.\n\nBut GPUs were designed to process graphics. In fact, ML/LLM computations are handled better on the CPU, but those are not specifically designed to leverage neural computing either. That’s what Neural Processing Units (NPUs) are for. And it just so happens that the new M chips have a 16 core NPU directly embedded with the RAM (which happens to be another major constraint for loading LLMs). \n\nInitially, it was unclear what these NPUs were going to be used for. Google also has its tensor neural chip (though it’s currently hampered by being on the backs of Samsung). And these companies put this stuff in place back in 2018-2019 to handle some niche ML closed projects like Google Lens, Translate, Face Unlock, Siri, Speech dictation, etc etc.\n\nBut everything has changed now in the last year in regards to the demand for ML computing. Apple just announced the new M4 chip will have more cores in their NPU (the first ever increase of cores on the NPU) along with new “AI enhancements”. \n\nNvidia is also rumored to be releasing an AI specific chip in 2025 (either some kind of NPU or possibly even an LPU like Grok’s commercial chip design which stands for Language Processing unit being designed for an even more specific ML computation). \n\nI’m not saying Nvidia and Apple are in the same boat. Nvidia is a leading company in this field for many other reasons.\n\nHowever, the way I see it, Apple has sort of accidentally lucked into a big heard start with their chip design. At least in the B2C arena. Because all they need to do is open up more access to those embedded NPUs for everyone to leverage their models on and many developers can get a lot of work done with simply their MacBooks instead of having to build a server with an expensive Nvdia GPU that wasn’t even designed to do neural processing. \n\nBut currently MacBooks aren’t quite enough to do big big models. So here now we have an exploding demand and a clear path for Apple to meet that demand, and it sounds like that’s exactly what they plan on doing based on recent announcements. \n\nNvidia has a similar setup. \n\nGoogle? Idk. They’ve been in the ML game a while now so software wise they are ahead (although their LLMs are not inspiring anyone lately). Hardware wise they are very behind, despite having experience with their Tensor chip design. Idk, maybe they will take advantage with all of the data they have? Their path is less clear to me.\n\nEdit: aaaaaand today Apple just announced they will be expanding a commercial cloud AI server chip. So now they’ll be able to play in B2B more. This is now even further aligning them with Nvidia. Wow", "score": 2, "replies": []}]}]}]}]}, {"body": "You are correct, China had become a post-manufacturing country and wages are too expensive now. Couple that with China having been shut down for COVID. I think no one wants a repeat of supply chain being shut down so they’re diversifying countries of manufacture.\n\nI think it was just about 3 years ago that some firm (guessing it was PwC?) identified new low cost regions including LATAM and now we see a wave of shifting manufacturing from China to SE and Mexico, plus offshoring full time employees to LATAM and East Europe.", "score": 0, "replies": []}]}, {"body": "XLK already has a big weighting towards AAPL.", "score": 8, "replies": [{"body": "I am aware of this. That’s why I made the post.", "score": 5, "replies": []}]}, {"body": "Buddy ignore apple haters. Same people shitted on google not too long ago. Apple will invest in AI soon . 1 good news and it rockets to 200$. I’m adding more as it goes down from here", "score": 13, "replies": []}, {"body": "I think you should develop and explore the possibilities of this industry. \n\nFor me, I have a strong belief in the tech industry as it embodies the exponential growth factor of having its value pegged to constant innovation. \n\nWhat I then look for are the companies who's positioned to capture the key points of consumers. \n\nAAPL imo is one of the strongest players to compete, or dare I say, dominate the space of personal devices. I have my own thoughts about what this means and I encourage you to ponder more about the potential of Apple in the next 20 years. \n\nTheir strategies have brought forth the attention of the DOJ and multiple lawsuits against their practices. They will live but Apple is still a bit overvalued in some eyes. It was holding support for the longest at 160-170, now we will see where it breaks or pops.", "score": 2, "replies": [{"body": "Thanks for the reply. After reading, I am generally confused on your stance. You say they are in your opinion they are the strongest competitor, and then you finish with they will live but overvalued and talk about lawsuits. lol", "score": 1, "replies": [{"body": "They still face uphill challenges as the king of US mobile devices. Multifaceted upsides and downsides to investing into Apple. \n\nTheir P/E is a bit high and in the case of a market pullback/correction, companies like Apple who is valued higher will therefore compress further until it consolidates at the preferred price. \n\nProbably a bit lower given the FED", "score": 1, "replies": []}]}]}, {"body": "MSFT has a better system now.", "score": 2, "replies": []}, {"body": "Before I start, I want to be clear, my family and I own Apple products. We were Android users for years. But with family members getting older, iPhones are less complicated to use and things seem to function better.\n\nWith that being said,  I wouldn’t buy stocks of it now. Releasing the same product over and over again with minor tweaks, isn’t innovated. Introducing “new” features that another OS has had for “x” years, isn’t anything special either. I just always feel like they’re years behind Android. \n\nHowever, on a positive note, they keep things simple, smooth and clean. They also have better privacy protections than Google.", "score": 2, "replies": []}, {"body": "Microsoft 365 eco system is using Open Ai Chatgpt which has a combined 500 million subscribers.\nAnd the new phone will be embedded in that base along with a watch.\nComplete ecosystem. \nIPHONE 15 is also losing it's China base.", "score": 1, "replies": []}, {"body": "Back to original question. \nI think 5% in AAPL is too much.\nMSFT would be a better 5% weight", "score": 1, "replies": []}, {"body": "salt encouraging desert jellyfish disagreeable mighty badge snobbish dam soft\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}, {"body": "Apple is struggling in the short term but to me there’s no question that they will remain a dominate brand. They have been riding on the momentum of their previous breakthrough products, sure, but all it takes is another product like that for them to start leading the market again. \n\nThey have competitive/golden standard products in just too many categories to not be considered.", "score": 1, "replies": []}, {"body": "I question Apples outlook for the foreseeable future. They’re mostly held up by momentum/protectionism/monopoly and haven’t developed much of worth in awhile.\n\nI don’t think they’re crashing, but if there are far better stable growth options.", "score": 0, "replies": [{"body": "Care to say what those better stable growth options are?", "score": 1, "replies": [{"body": "Basically every ETF and index fund.\n\nA lot still have Apple inside of them, but you’re less focused.\n\nOnly reason to buy individual stock most of the time is if you personally feel a specific company is going to be worth it. The vast majority will not beat the market consistently though.\n\nYou may get the next NVDA or AMZN, but if it was that easy to know the future, money would have no meaning. You’ll likely lose or at best get slightly better results.", "score": 3, "replies": []}]}]}, {"body": "I am bearish on Apple for a few reasons.\n\n1. The limitations we are hitting with silicon chips are going to hit hardware oriented companies the most. Apple is the most hardware skewed big tech company. We are already seeing it in the latest generation of iPhone, where the main selling point was the Titanium case. The marketing department is grasping at straws. Their new ARM based desktop/laptop CPU's benefited heavily by buying up all of TSMC 5nm capacity, and milking the last drops of fabrication process advantage. That strategy is already over. Hardware is at the precipice, and everyone seems to be completely sleeping on this ENORMOUS elephant in the room.\n\n*Sidenote: I have seen so many people argue that there are lots of other ways to get performance improvements out of CPU's without just shrinking transistor. If there were, they would be used already. There is no reason to save them for a rainy day. If Intel could stack chips and make 3D chips, or any other sort of strategy....they would have used it when they got stuck on 14nm 3 years ago.*\n\n2. They are just the iPhone company. That is it. Look at the revenue breakdowns of big tech, Apple's is on of the worst for having all their egg's in a single basket. Their iPhone fort is also being attacked on all side by regulators.\n\n3. Lastly, they are no longer an innovator but a follower. When they cancelled the Apple Car project, and reallocated those resources to AI, it was a shocking signal. What they essentially implied was \"We had this one strategy....it sucked. Now other tech companies have shown which way we should have gone, now lets pivot and chase the innovators\". When AAPL cancelled the car and pivoted to AI, they jumped the shark.\n\nApple is mediocre. Can their wads of cash be used to gain their former form...maybe.\n\nOld habits die hard, and everyone is going to yell at me because AAPL has printed money for so long....but nothing lasts forever.\n\nPS. I was saying this exact thing about AAPL in December when they topped out.", "score": -7, "replies": [{"body": "humor pathetic paltry concerned secretive familiar north whole lunchroom many\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 16, "replies": [{"body": "I could definitely be wrong. But for me there are better options.", "score": -4, "replies": []}]}, {"body": "You are long term bearish?", "score": 7, "replies": []}, {"body": "There is no way chip technology stagnates in the next decade. iPhone is still geat. They never were the first to bring a technology to market. Apple just always has the roundest, best product with those new technologies well implemented a few years after the tech is first seen.", "score": 5, "replies": [{"body": "It is not going to stagnate, it is going hit a brick wall and we are moments from impact. We have been riding one single trick this entire time....shrinking transistors on silicon chips. We need a whole new breakthrough. What makes you think that is coming any time soon???", "score": -5, "replies": []}]}, {"body": "A big point you missed is high resistance to increase prices by much, as Apple has famously done before, and their sales had only gone up.\n\nPurchasing power has reduced and is reducing ever since the pandemic, and they would find it hard to increase prices of their product and services without seriously harming sales numbers.", "score": 1, "replies": []}, {"body": "Your take on Silicon chips is hilariously uneducated tbh. I hope you meet an electrical engineer some day who can talk to about this.", "score": -1, "replies": [{"body": "If you are not an electrical engineer....why are you confident in saying this? What is your take on this?", "score": 2, "replies": [{"body": "I am an electrical engineer. Just not one who has the time to spend to talk to you about this. 😊\nHope you find one some day though", "score": -4, "replies": [{"body": "Tell me you don't actually have something insightful to say without telling me you don't actually have anything insightful to say.", "score": 2, "replies": []}]}]}]}]}, {"body": "Their biggest market (iphone) is starting to peak. They lost sales recently in China. They are also WAY behind on the AI race. Microsoft, Google, and Meta are already years ahead and billions of dollars. They own a large majority of the H100s out there. \n\nI personally think Apple should have dumped their augmented reality project and finished that car of theirs.", "score": -1, "replies": []}, {"body": "\nOpen Ai is developing an Ai phone to capture the smart phone market.\nI appreciate AAPL as a great company, but I'm not a buyer even at 168", "score": -3, "replies": [{"body": "Apple already has all of this data and a phone ecosystem. Silly reason to invest in open ai", "score": 1, "replies": [{"body": "And The Lead IPhone engineer now works for Sam.", "score": 1, "replies": [{"body": "And? Microsoft tried to develop a phone too", "score": 1, "replies": [{"body": "Technology has come a long way in 18 months...", "score": 1, "replies": []}]}]}]}]}]}
