{"title": "$TSLA Daily Investor Discussion - December 20, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "ed7si7", "created_utc": 1576833155.0, "score": 25, "upvote_ratio": 0.95, "num_comments": 324, "comments": [{"body": "Well, we’ve had worse weeks haven’t we", "score": 34, "replies": []}, {"body": "Hell of a week, boys and girls.", "score": 30, "replies": []}, {"body": "Staying flat after that bull run is already pretty good.", "score": 24, "replies": [{"body": "Man i’m good with anything above 400.\n\n\n...\n\n\nGoddamn even that sounds way too greedy. Ok anything above 350 really.  Though I sure am getting _really_ fond of seeing the price start with a 4.  Kinda would like to hold on to that until it turns into a 5.", "score": 3, "replies": [{"body": "Just wait until it starts with a 1 again ;)", "score": 1, "replies": []}]}]}, {"body": "Just got back from my test drive - Holy Shit! That was insane \n\nI wanted a Model 3, all they had available was Model S", "score": 23, "replies": [{"body": "Had a 3 for a little over a year now and every day still feels like that first test drive. Pure fun.", "score": 11, "replies": [{"body": "best post purchase experience I've ever had with a product.  I had the highest of expectations and it just keeps betting them in ways I never imagined.", "score": 7, "replies": [{"body": "If this is a cult, then where do I give my blood sacrifice 😜\n\nLook forward to join the club.", "score": 3, "replies": []}]}]}, {"body": "Honestly anyone in here invested that hasn’t test driven. Go do it! And bring a friend or spouse!\n\nSo much  fun. I did a stealth performance model. \n\nGuts in my throat acceleration.", "score": 12, "replies": [{"body": "No. Just no. I don't want to buy a Tesla. Not for now, at least. I cant test drive one because I know what will happen.", "score": 7, "replies": [{"body": "Soooo, My performance model 3 is cheaper than a bottom of the line civic or corolla in total cost of ownership considering it will last a million miles / 40 years with only  $300 annual services, $15k in battery refurbishing, and tires.  Tesla are currently an example of how it can be expensive to be poor :( due to the large up front cost.  But if you can afford it... I say get every bell and whistle.  It's the last car you will ever have to purchase situation.", "score": 3, "replies": [{"body": "While what you say is true, I drive a fucked up 2000 Toyota yaris. It doesn't need anything to drive other than gas. And 60k€ of gas is a lot.\n\nEither way, I prefer (again, for now) to put my money on stocks because the return will be better than to dump a ton of money on a new car.", "score": 5, "replies": [{"body": "Wow really? No insurance, road tax, tyres, maintenance? Oil? What a great car!\n\nAlso its 20 years old. Stop comparing apples to oranges.", "score": 1, "replies": [{"body": "Insurance is cheaper than a tesla.\n\nAnnual tax is 30€ and something.\n\nTyres are much cheaper than for a tesla.\n\nMaintenance and oil, ofc it needs cheap stuff every now and then.\n\nWhat I'm saying is that it doesnt make financial sense. While this beaten up car keeps working and fairly maintenance free, I wont trade it. Also for context, my Annual salary is not sufficient for a basic model 3, so simply put it is extremely expensive for my wallet.", "score": 1, "replies": []}]}]}, {"body": "It's a great car, but I think 40 years is way over the top. That'd be like still owning your daily driver from 1980 today.\n\nSure, the drivetrain in an EV might last the 1M miles. But you won't want the rest of the car for that long. Maybe 20 years, but I'd suspect shorter for right now as Tesla is still new at this.", "score": 2, "replies": [{"body": "But it also won’t depreciate as quickly. So he can sell it in 10 to someone who would hold for the next 10. And so on.", "score": 2, "replies": [{"body": "Eh...I don't know.\n\nWhat do you think a 20 year old Model 3 (original battery) will go for? $5-7K? Maybe an comparable ICE is worth a little less, $4-5K? So sure, slower depreciation, but not different enough to really matter.\n\nLots of shit gets beat up on older cars. Windshield goes to hell, headlight plastic fogs, seals leak/tear/dry rot, seats get beat up and get flat spots, rims go to shit, paint to shit, rust spots, creaks and rattles, electrical glitches, steering and suspension gets loose, etc. etc.\n\nUnless you stay on top of it, of course. But then you're spending a lot more along the way, making the Civic comparison invalid.\n\nMy feeling is that the depreciation curve will be more straight for Teslas, vs. more hockey-stick like for an ICE, but that at some point the two meet up and then it's basically hooptie car vs. hooptie car that has better 20-year-old tech.\n\nFSD Robotaxi will change this up, but we can't really speculate on that too much today.", "score": 2, "replies": [{"body": "20 yr old ice is 1000 max.", "score": 2, "replies": [{"body": "Just ran KBB for a 2000 3-series, based on \"good\" condition (cosmetic defects, no major mechanical) and got fair private price of $2.8K, dealer $3.6K.", "score": 1, "replies": [{"body": "Touché. Bring actual facts to a knife fight you scoundrel. \n\nWell Touché to you! I’ve never owned a BMW. Try again for a Mitsubishi Mirage. Manual transmission mind you!", "score": 1, "replies": [{"body": "Ha, sorry about that, but we do need to compare like-to-like.\n\nI do miss manual transmissions, zero shame there.", "score": 1, "replies": []}]}]}]}, {"body": "At 20 years, replace battery for more range than it had new. And cheaper. Replace MCU for faster unit and its good for another 20.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I loved it so much. Planning on doing just a little Uber/Lyft for fun. Plus there's a free charger close to my office and I can deduct the miles. If Trump gave me that $6,000 tax credit...oh boy", "score": 3, "replies": [{"body": "I’m hoping to be a 2020 owner myself.", "score": 4, "replies": []}]}, {"body": "Guy at work let me take his performance 3 for a spin.  Holy crap was it fun.  Made me want one more than I already did.  Also gave me confidence that the shares I had accumulated over the summer was a wise choice", "score": 1, "replies": []}]}, {"body": ">I wanted a Model 3, all they had available was Model S\n\nNo demand\n\n/s", "score": 8, "replies": []}, {"body": "amazing!", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Haha I always like to make this exact correction; if you don't force people to use their brakes because you're fast and have an ounce of driving ability, then you're just maneuvering not cutting people off.", "score": 2, "replies": []}, {"body": "woah!!! that's crazy haha be careful once you get you own it ;)", "score": 1, "replies": []}]}]}, {"body": "Model S team assemble!\n\nNow on my second Model S. My previous with 101k miles went to a new home today. They are just incredible. The ultimate highway cruiser, excellent handling.", "score": 2, "replies": [{"body": "And for vacations, you can pack an insane amount of luggage in that car.", "score": 2, "replies": []}]}]}, {"body": "400 resistance is now the support, bears should run for the hills", "score": 22, "replies": [{"body": "Technically, $390 is the support. That's the new high.", "score": 1, "replies": [{"body": "technically technically, 396.40 is support.  The support zone is 396.40 - 195.18.  That is the gap up window and every gap up window become support unless it is broken by a down turn.", "score": 1, "replies": []}]}]}, {"body": "Funding is about to be secured at this rate", "score": 21, "replies": [{"body": "Measly 2% away!", "score": 3, "replies": []}]}, {"body": "Bought 40 more shares, fuck you bears!", "score": 41, "replies": [{"body": "I met a Tesla bear in real life once. Was a pretty tense moment having to listen to him tell me Tesla was going bankrupt and that I should invest in tobacco companies instead because when there is a recession people smoke more...\n\nNeedless to say I just changed the subject.", "score": 17, "replies": [{"body": "I find most tesla bears have never driven a Tesla", "score": 10, "replies": []}, {"body": "I'm invested in both. He's not wrong about tobacco sales in a recession.", "score": 1, "replies": []}]}, {"body": "Congrats!", "score": 10, "replies": []}, {"body": "I bought 40 over the course of the week!\n\nI am mega long though.", "score": 6, "replies": [{"body": "Yup 3000 train", "score": 3, "replies": []}]}, {"body": "I mean generally we as mods discourage such language but also... fuck you bears!", "score": 14, "replies": [{"body": "Anyone who doesn’t want an electric car company to succeed doesn’t give a fuck about our future, so yeah fuck the bears.", "score": 5, "replies": []}, {"body": "u/ajdude101 you rock!", "score": 2, "replies": []}]}, {"body": "In the three yesterday titled 400!!!! On r/teslamotors they were talking about tesla having almost yearly dips. \n\nBut I think if you’re long, then you should be able to ride out any downs in the market.", "score": 6, "replies": [{"body": "Yup I suspect any large scale economic problem will bankrupt the legacy automakers leaving Tesla all the chips", "score": 5, "replies": [{"body": "Yeah. They got the momentum now. \n\nMy favourite sentence: “the model 3 was the last bet the company project”", "score": 1, "replies": []}]}]}]}, {"body": "Perhaps the Netherlands tax incentives will be revised to stay aggressive going forward:  [https://earther.gizmodo.com/courts-grant-a-landmark-climate-victory-that-could-resh-1840553657](https://earther.gizmodo.com/courts-grant-a-landmark-climate-victory-that-could-resh-1840553657) \n\n\" On Friday, the Dutch Supreme Court ruled the Netherlands is obligated to reduce carbon pollution because it’s violating its citizens’ human rights. \"", "score": 19, "replies": [{"body": "That’d be nice. I’ll take 10k NL deliveries a quarter", "score": 3, "replies": []}, {"body": "They are already lowering the max speed to 100km/h in March.\nTheres also a new tax insensitive already planned. In the form of a straight up cash subsidy for all EV purchases. Instead of the current one only for company lease cars.\nThey might introduce it sooner.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Scary if you own an oil well.", "score": 6, "replies": []}, {"body": "How is it a scary precedent?", "score": 5, "replies": [{"body": "Means you can justify just about anything as long as it's \"for the greater good.\"", "score": 1, "replies": [{"body": "That's ***exactly*** what courts are supposed to do: they try to maximize the greater good as defined by laws - also called \"enforcing laws\" and \"justice\".\n\nVW and Exxon doesn't have the right to fucking kill us and our children, one software cheat and one new oil well at a time. Pollution injures and kills and courts routinely stop killers.", "score": 3, "replies": []}, {"body": "\"The greater good\"", "score": 1, "replies": []}]}]}, {"body": "I agree entirely.", "score": 3, "replies": []}]}]}, {"body": "New ATH $413. \n\nDon’t freak out if the stock starts moving down. It’s completely OK for people to take profits. However, long term, I (as many of you) believe that it will be higher than it is now.", "score": 16, "replies": [{"body": "Boy did you call that.", "score": 8, "replies": [{"body": "Doesn't really take a crystal ball to predict some profit taking on Friday open with the run we've had.", "score": 8, "replies": []}]}]}, {"body": "$420 today", "score": 17, "replies": [{"body": "Crazy how last Friday I would have called you an idiot for posting this, and today I think you may be right (or very, very close).", "score": 20, "replies": []}]}, {"body": "feels good to end this great week on another green day.", "score": 16, "replies": []}, {"body": "i was expecting at least a 5 dollar drop because 10% we gained this past week, but this preview tweet of FSD. amazing.\n\nChristmas is good to us boys.\n\nyou all deserve this for your belief", "score": 15, "replies": [{"body": "You need to buy some shares with those gains to keep us floating.", "score": 6, "replies": [{"body": "i'm exercising my contract today to buy 100 shares at 360. do not worry and i'm planning on buying 200 more", "score": 3, "replies": [{"body": "Nice 😎.", "score": 2, "replies": [{"body": "this is the moment everyone is going to refer to when they start saying here's how much an investment could've returned etc", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Is that based on just volume? Could it be (I am not saying equal likelihood) 1% of float trading hands 50 times?", "score": 3, "replies": [{"body": "It definitely could be.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": []}]}, {"body": "No way", "score": 1, "replies": [{"body": "70M / 134M = 52%", "score": 2, "replies": [{"body": "But som shares has traded more than once...", "score": 3, "replies": []}, {"body": "I mean, no way 50% of shares changed hands.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla model 3 has only 222 deliveries to go in the Netherlands to reach the 25000 deliveries milestone.\n\nThis month, Audi etron is second with 512 versus model 3 6875.\n\nTotal number of cars delivered in December is 19762 of which 10106 are electric. (Don’t expect that next January because of tax reasons).", "score": 14, "replies": [{"body": "Holy shit. They were mocked by some for aiming to deliver 10k cars to NL this year lol. If they keep going at this pace, they will come close to breaking 30k!", "score": 2, "replies": [{"body": "I’m wondering whether deliveries continue Monday, Tuesday and Friday next.", "score": 1, "replies": [{"body": "And they still have Sat/Mon/Tues (28/30/31), right?", "score": 1, "replies": []}, {"body": "the 26th is a legal holiday in NL but I wouldn't be surprised if they do deliveries then", "score": 1, "replies": []}, {"body": "I am sure that both Tesla, wanting to meet their quarterly targets, and their customers, wanting a 2019 delivery for that sweet tax reduction, will bend over backwards to make sure as many people as possible get their car before the year is out.", "score": 1, "replies": []}]}]}]}, {"body": "oops, another ship arrived in Amsterdam during the night... looks like NL is gonna keep up the delivery pace for a few more days.\n\nhttps://twitter.com/FMossotto/status/1207945348200751104?s=20", "score": 14, "replies": [{"body": "That photo looks like the ship is sitting pretty high in the water. It's obvious they dumped all the cars in the Atlantic before arriving in Amsterdam.", "score": 12, "replies": [{"body": "What's interesting about this one is that it went straight to Amsterdam and _might_ make a stop in Zeebrugge afterwards which is quite unusual (Zeebrugge port is on the way to Amsterdam port). They are clearly dumping as many cars in NL as they possibly can.", "score": 3, "replies": [{"body": "That's to try to deliver as many in the NL ahead of the upcoming 2020 NL EV incentive reduction, correct?", "score": 2, "replies": [{"body": "yup", "score": 1, "replies": []}]}]}]}, {"body": "Amsterdam streets are flooded with model 3's. This morning on my bike I counted 4 in one short street.", "score": 3, "replies": [{"body": "From what I remember of being in Amsterdam (admittedly, those memories are bit... umm... hazy) I wouldn't want to have to park any Tesla in Amsterdam's narrow parking spots on a frequent basis.", "score": 2, "replies": [{"body": "We are used to it and have become expert drivers.", "score": 1, "replies": []}]}]}, {"body": "TSLAQ reddit has been claiming that inventory in NL has already been piling up.", "score": 1, "replies": [{"body": "according to https://teslainventory.teslastats.no/ (be sure to select Model 3 specifically in the dropdown), there's a whopping 152 inventory Model 3's available in NL right now.\n\nI'm sure that constitutes \"piling up\" in the TSLAQ-way-of-thinking 🤷‍♂️", "score": 3, "replies": [{"body": "Well since they're not even sure if Teslas are actually being produced, I guess 152 seems like a lot!", "score": 2, "replies": []}, {"body": "CLEARLY not a big enough pile. A real automaker like VW has 10,000 piled up, with more coming soon.", "score": 1, "replies": [{"body": "this is so true\n\nyou're just a toy-company if you don't have WW2-airstrips FULL OF CARS YOU CANT SELL\n\nEDIT: I'm not gonna say what you'd think i'd say in this line, but i do think it was Daimler btw :p", "score": 1, "replies": [{"body": "> but i do think it was Daimler\n\nSorry? I was referring to the 10K, soon to be 20K, VW ID.3's in storage, waiting for software to be fixed.", "score": 1, "replies": [{"body": "ah i thought you where talking about this:\n\nhttps://europe.autonews.com/automakers/mercedes-vehicles-pile-german-airport-supplier-triggers-bottleneck", "score": 1, "replies": [{"body": "I forgot about that! I guess that's a new strategy the legacy OEMs created that Tesla will need to improve on.", "score": 1, "replies": [{"body": "it'll be easy... Tesla will just directly launch them into space.  \n\nLegacy auto => dump cars you can't sell in abandoned airfields\n\nTesla => dump cars you can't sell _in space_\n\nwhat did you think the whole \"let's launch my Roadster in space\" thing was for?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "It was for a while presumably due to changes that needed to be done on the cars. But the cars always pile up before the end of the quarter blitz. So it’s hard to draw much from swelling inventory at quarters end.", "score": 1, "replies": []}]}]}, {"body": "I'm off to bed soon, but if I wake up in the morning to SP > $420, I'll put in 2 limit orders. One for $420, and one for $420.69 to celebrate this mark.", "score": 14, "replies": []}, {"body": "CNBC just went to commercial. Jim Cramer's lead to the commercial , \"Tesla!\" Let's see what he's got to say. On in 2 minutes.", "score": 14, "replies": [{"body": "And they’re poking fun at Boeing’s space travel. Saying “Jensen does these simulations in his sleep”. Hello? SpaceX? It’s like they get fired for talking about Elon because he won’t advertise on their farce of a show. \n\nMedia manipulation at an all-time high.", "score": 14, "replies": [{"body": "I DVRed the shows yesterday and 4x-ed through them. Did not see one segment on Tesla despite a record day. I might have missed a small mention, but I didn't see anything like they usually cover when Tesla is in crisis.", "score": 7, "replies": []}]}, {"body": "Well they just did 5 minutes, no Tesla. But it should be coming up next lol", "score": 5, "replies": []}]}, {"body": "Friday profit taking/options seller pressure. I'm going to buy a block of weekly 420's at 3:55. The last few Mondays have been nutty.", "score": 14, "replies": [{"body": "I'm gonna join you", "score": 5, "replies": [{"body": "Just got 5, small gamble for a big potential payoff, good luck!", "score": 1, "replies": [{"body": "I ended up buying 2 1/3/20 410s. Good luck to u too!", "score": 1, "replies": []}, {"body": "Selling at open or no? Mine expire jan 3rd so I'm tempted to hold for a day or two but probably won't.", "score": 1, "replies": [{"body": "I sold them @ 7$ a pop. Bought some jan 24 500's for funsies with it.", "score": 1, "replies": [{"body": "You're a braver man than I. I sold at open, left a lot on the table. Also bought puts to offset 20% of my position a couple hours ago. Just gonna sit on ~10% cash until the end of the year and do a lot rolling forward after new years. Probably some 2021 calls and a few September 2020. Congrats!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not fully related to Tesla - but Boeing is currently failing their Starliner flight to the ISS. On live.", "score": 12, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Everyday Astronaut approved terminology.", "score": 6, "replies": []}]}, {"body": "Dayum. Boeing not catching a break. Not undeserved, but still sucks for them.", "score": 5, "replies": []}]}, {"body": "Dat premarket tho... 😀", "score": 12, "replies": []}, {"body": "Unfortunate that we aren't pulling a Tilray, but some consolidation is in order! We could finish red and it will remain one fantastic week run.", "score": 13, "replies": []}, {"body": "So FSD is just days away from early access... OMG I’m gitty! https://twitter.com/elonmusk/status/1207916492265680897?s=21", "score": 13, "replies": [{"body": "This could mean the overall winter update, not necessarily FSD", "score": 6, "replies": [{"body": "So is there early access even for reg updates like ones with video games? I was under the assumption early access meant FSD stuff.", "score": 2, "replies": [{"body": "Yes, there is early access for every update", "score": 1, "replies": []}]}]}]}, {"body": "Business Insider can't stop shitting its pants over Tesla rise lmao\n\n [https://www.youtube.com/watch?v=DbojSLdgs50](https://www.youtube.com/watch?v=DbojSLdgs50)", "score": 12, "replies": [{"body": "I feel wrong for laughing at emerging tech, but i think the ability to charge your Car at Home will be too big of an advantage to overcome. Convenience has always been king when it comes to technological advancement.", "score": 12, "replies": [{"body": "Between that and the amount of energy required to create hydrogen in the first place, it took me about 15 minutes to decide electric would be the winner between the two of them. When batteries dropped from 600$/kWh to 120$/kWh it was basically like uh huh. And now that batteries are proving to retain charge for 1,000+ cycles that means even semi trailer use makes sense. The game is over. Maybe hydrogen is good for shipping or planes?", "score": 6, "replies": []}]}, {"body": "It’s best to not give them any attention.", "score": 11, "replies": []}, {"body": "Wow, that is one misleading video!", "score": 9, "replies": []}, {"body": "The battle is over or I'm missing something important. Why are they still trying?", "score": 7, "replies": []}, {"body": "Lol YouTube suggested me this video last night, it's quite desperate.", "score": 8, "replies": []}, {"body": "It's got 4.8K likes and 1.3K dislikes. It has to be some paid clickfarm, that's upvoting this crap, right?", "score": 8, "replies": []}, {"body": "They are back pushing hydrogen?   I can tell you as a BEV owner I would never give up the ability to charge at home.    It saves me far more time then any fast charging I would need to do on long trips.   Hydrogen is dead for small persona vehicles.   Might have it's place for larger ones though or other applications.", "score": 3, "replies": []}, {"body": "Blah ha ha ha ha, what a bunch of shit! Who are they trying to fool?", "score": 2, "replies": []}]}, {"body": "Another great day. Any predictions on what happens? I'm expecting more than $5. These options are giving me fear of heights but I told myself \"$500 by 1/31\". Only taking small profits right now.\n\nOh and I got my Model 3 test drive today, thanks Elon!", "score": 11, "replies": [{"body": "> Oh and I got my Model 3 test drive today, thanks Elon!\n\nGet a red P3D with FSD, white interior and get some winter tires as well while you're at it.  Don't forget to browse the web shop for some nice accessories.", "score": 3, "replies": [{"body": "Haha well I've never seen snow so I should be fine. Definitely want the white interior, FSD, and the $2,000 acceleration boost.", "score": 2, "replies": [{"body": "> Haha well I've never seen snow so I should be fine.\n\nit'd help the stock...\n\n> Definitely want the white interior, FSD, and the $2,000 acceleration boost.\n\nacceleration boost is only applicable for the AWD version. If you get the P3D, you don't need the boost ;)", "score": 0, "replies": []}]}]}, {"body": "I love that “giving me fear of heights”, I feel ya on that with these options!", "score": 2, "replies": []}, {"body": "$500 by January 31, 2020?!?   \n\n\nIs your strike price a lot lower than $500?  \n\n\nI think that after FSD \"sneak preview\" makes feature-complete FSD easier for the market to see and Q4 deliveries are announced, we could get to $450-$500. More than $500 next month seems unlikely to me. $500 by January **2021**, no problem!  \n\n\nBut a few weeks ago, at $335, I couldn't imagine us going above $370 this year without any major news.", "score": 2, "replies": []}]}, {"body": "To the dude who keeps buying my Tesla puts, I love you", "score": 10, "replies": [{"body": "ha, same. locked in 50% today at 1:59p.", "score": 2, "replies": []}, {"body": "So you're the one who sold them to me yesterday! Thanks for the love.", "score": 2, "replies": []}]}, {"body": "amazing week guys. Sending love to all of you.\n\ni really never got reddit, it's because I didn't know you guys were here.\n\nrest of 2019 and 2020 is looking amazing", "score": 19, "replies": [{"body": "i too love this sub! as i said: 10 of you beer on me (and steakes) if tesla reaches 800 by 2022 (so very likley, no /s )", "score": 7, "replies": [{"body": "Mark me down for steaks and beer on you if TSLA hits 800 before 2022 :)", "score": 6, "replies": [{"body": "done berlin 2022 it is.", "score": 3, "replies": []}]}, {"body": "I want bear and stakes", "score": 3, "replies": []}, {"body": "I think you broke the remindme bot", "score": 3, "replies": [{"body": "that bot is crazy good! i set a riminder too AND?\nhe send me an dm, saying he will not make it piblicly so the sub does not get spammed, but he will reminde me too! :D", "score": 2, "replies": []}]}, {"body": "First in line. Beer is gud.", "score": 3, "replies": []}, {"body": "we're gonna hold you to it! haha", "score": 2, "replies": [{"body": "Second !Remindme in 2 years", "score": 2, "replies": [{"body": "!Remindme in 2 years", "score": 2, "replies": [{"body": "nice! let me set a reminder too.\ni hope ya all are not to busy buying new homes and rolexes by then thanks to tesla", "score": 2, "replies": [{"body": "not yet! hopefully next year!\ni'm a frugal person so no rolex. as long as i got a small apartment and my tesla. i'll be the happiest man in the world.", "score": 3, "replies": []}]}, {"body": "!Remindme in 2 years", "score": 1, "replies": [{"body": "Wait he told me first!!", "score": 2, "replies": [{"body": "your in, dont worry", "score": 1, "replies": []}]}]}]}, {"body": "I will be messaging you in 2 years on [**2021-12-20 21:08:54 UTC**](http://www.wolframalpha.com/input/?i=2021-12-20%2021:08:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/teslainvestorsclub/comments/ed7si7/tsla_daily_investor_discussion_december_20_2019/fbhky6y/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fed7si7%2Ftsla_daily_investor_discussion_december_20_2019%2Ffbhky6y%2F%5D%0A%0ARemindMe%21%202021-12-20%2021%3A08%3A54%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ed7si7)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Count me in. I will fly from europe to the other side of the pond.", "score": 2, "replies": [{"body": "i'm in berlin buddy, dont worry!", "score": 2, "replies": [{"body": "Will be there in  14 hours! Can't wait for that beer!", "score": 2, "replies": []}, {"body": "Remindme! 1 year", "score": 1, "replies": []}]}]}]}]}, {"body": "PM just broke $410 (I know we don't like constant dollar updates, especially PM, but felt this is significant enough to post).", "score": 8, "replies": [{"body": "that's all good as long as it stays in these daily threads", "score": 10, "replies": [{"body": "Twitter going nuts with questions on FSD sneak peek. That’ll provide some good media to watch today. $420+ close 🇯🇲", "score": 4, "replies": []}, {"body": "Queue up that 420 sticky for its Grand debut! Today is the day!", "score": 2, "replies": [{"body": "hopefully but remember what I said: we'll create that thread when the stock _closes_ at or over 420.", "score": 5, "replies": [{"body": "Cool. Hoping for /u/is_joke_comrade  to publish another classic take of lotr final battle scene after we breach 420!", "score": 1, "replies": []}]}]}]}]}, {"body": "[Lol @ these shit puts.](https://imgur.com/a/QvZDHFZ)", "score": 8, "replies": [{"body": ">Lol @ these shit puts.\n\nCan you give me quick rundown of what that means? Still learning my puts, calls etc", "score": 4, "replies": [{"body": "It means there's 13.k contracts that will expire worthless today. Those who purchased these put contracts paid a premium to have the option to sell TSLA @ $50. Since it's way out the money, this option is now priced near zero. Way, way less the price when they initially bought it.", "score": 5, "replies": [{"body": "Thanks for the explanation", "score": 3, "replies": []}]}, {"body": "“PUTS” are just the first four letters of the word “stupid” rearranged.", "score": 3, "replies": []}]}]}, {"body": "What part of 420 or bust don’t you pansies understand?", "score": 24, "replies": [{"body": "420.69", "score": 1, "replies": []}, {"body": "i know right...who sold!? Set a limit people!!!", "score": 1, "replies": []}]}, {"body": "What does everyone think the FSD sneak preview is?", "score": 7, "replies": [{"body": "I think it will add more visualisations (traffic lights, stop signs) and maybe add some city driving suggestions. It probably won't do significantly more stuff autonomously, I think.", "score": 11, "replies": []}, {"body": "Stop light and sign visualization, maybe curbs. Greentheonly saw the visual assets for lights and signs a few weeks ago, so this is a pretty safe bet.\n\nSmall chance of also seeing a coast-to-coast video.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "VW tripled it's value in a single day.  I think that's still the winner.", "score": 10, "replies": [{"body": "Mate that was in a **historic** short squeeze in a **very** particular situation there were basically no shares left to be sold for shorts to cover. It's a bad reference to speculate on what could happen here.\n\nEdit: Misread the comment.", "score": 0, "replies": [{"body": "I was answering the question \"Is this the biggest short squeeze ever?\"", "score": 6, "replies": [{"body": "Oh right I misread your comment! Yeah that'll keep the cake for quite some time.", "score": 1, "replies": []}]}]}]}, {"body": "Still a lot of shorts haven´t covered we are still at 24 million shares sold short.", "score": 5, "replies": [{"body": "Those estimates are super unreliable and often way off, lets wait for real numbers", "score": 2, "replies": []}]}, {"body": "I wonder how big of a wall 420 will be given the number of people talking about it.\n\nEdit: oops, meant that to be a top level comment.  I'm not used to mobile.  :)\n\nEdit.2: so, who is going to buy at 420 vs sell?  I guess if it's mostly buying there's no problem.", "score": 2, "replies": [{"body": "My plan is selling 25% at $440 if we keep running up there without significant consolidation.", "score": 2, "replies": []}, {"body": "When will you sell shares out of interest and how many?", "score": 1, "replies": [{"body": "Maybe sell 1337 at $1337?  :).    Not really.  Honestly not sure.  I think the main thing won't be share price but level of progress.  If TSLA gets to where it looks like all the big things are done, and the growth levels off (which is very far away)..  or if Tesla's Samsung analog to Apple comes along...(Rivian is highly unlikely to be that, actually it's pretty hard to imagine). At some lesser level of progress we may take out half.\n\nIf I can pull out a good bit and still have half my shares, maybe.  With options, that should be .. wow .. $4200.  That's kind of amusing.", "score": 2, "replies": []}]}, {"body": "420 has no meaning to anyone -it was just the price elon and co would have offered us to go private when the shares where much lower, so now the new \"420\" would be about 600 to go private.\n\n420 was only relevant when it was under 300 and they where offering that as a premium", "score": 1, "replies": []}]}, {"body": "If you want to hedge, why don't you sell some calls? That way time is on your side, and you still make money if TSLA trades sideways or just goes up slowly.  \n\n\nJust make sure to sell a call spread (sell an expensive call & buy a cheaper one), because it's scary how fast you can lose money selling calls whenever TSLA skyrockets (and crazy how fast your available margin can fall into the negative). I sold a few way out-of-the-money naked calls right before Q3 earnings as a hedge. The few calls wiped out the $10k I would have made if I hadn't hedged (or if I had only hedged with a call spread).", "score": 2, "replies": [{"body": "Yea thought about it but that's a bit out of my risk tolerance, with these two calls I could still lose a bunch if TSLA goes up but not up that much right?\nAlso do people generally only sell an amount of calls they can cover with stocks? i.e lets say you own 100 TSLA shares you would only sell 1 call contract so that in case it has to get executed you don't get wiped out?", "score": 2, "replies": [{"body": "If you sell a call & buy a call for the same expiry date, yes, your risk is capped. For example, if you sell a call with a $500 strike price & buy a call with a $550 strike, if TSLA goes to $501 you lose $100, at $502 you lose $200, but no matter how high TSLA goes, you can't lose more than $5000: ($550 - 500) x 100.\n\nIf you own 100 shares, sure, you could sell a call, and you'd be completely covered. For example, you could sell a call with a $600 strike price. Then as TSLA goes from $400 to $600, you make $20 000 from your 100 shares. If TSLA goes above $600, you won't lose any money, but you won't be able to make more than $20 000.\n\nAnother way to hedge could be to sell a call that is less likely  than one that you already own. For example, if you already own a call with a $400 strike expiring June 2020, you could sell a call with a $600 strike also expiring June 2020. As long as you own the $400 call, you can't lose money if TSLA goes to Mars. But with owning a $400 call and selling a $600 call, just like with owning 100 shares, your gains are capped out at $20 000.\n\nIt can be nice to make a few extra bucks from hedging. And you can even put the money back into TSLA shares or towards TSLA calls that you believe in! Honestly though, for all of the effort it's been for me to try to make a few extra bucks from hedging, I think I'd rather just keep my strategy simpler, be a pure Tesla bull and not limit my gains. When surprisingly great moments like these past couple months come around, sending TSLA from $250 to $400, there's no limit for me, and I can purely cheer for $420 and beyond. FSD, China, battery investor day, shorts finally starting to STFU because even they're starting to expect 360k+ deliveries in 2019 and profitability in 2020... who knows how fast the stock can climb :)", "score": 3, "replies": []}]}]}, {"body": "It's updated like once a month so it would be speculation to call it a short squeeze I believe, regardless of its likelihood", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "It’s twice a month and next update is Dec 24th.", "score": 3, "replies": []}]}]}]}, {"body": "we're going to finish how we started boys , don't worry. steady.", "score": 7, "replies": []}, {"body": "Daamn, I hope nobody is still short Tesla...", "score": 7, "replies": [{"body": "we know for a fact that almost 15% of the stock is still shorted. so yeah i do not feel bad whatsoever, the longer it stays 15% the more i believe in the oil  short scheme theory.", "score": 8, "replies": [{"body": "That doesn’t make sense. The stock value is reaching new heights, in which case it is completely logical for their to be short interest and even increasing short interest.", "score": 3, "replies": []}]}]}, {"body": "Screw the moon, we coming for you mars!", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I made a quick comment about this yesterday. It's nuts how there doesn't seem to be one honest short talking about their loss or course correction. Plenty of longs seem to do that, although it's been suggested some of those may have been fake.\n\nI try to stay away from this rabbit hole, it goes deep.", "score": 6, "replies": []}, {"body": "I think most shorts are non-technical hardcore traders", "score": 6, "replies": []}, {"body": "Gone long and short over different times. Like now I’m buying puts. Just depends, I’ll buy shares from time to time or puts if I think it’ll pull back. I never directly short TSLA.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That happens with a stock tied to so many emotions. Never seen this before.", "score": 1, "replies": []}]}]}, {"body": "It’s already $410. Is there some other news that we lemmings don’t know, or this is pent up energy driving it??", "score": 5, "replies": [{"body": "People who played the $250-$389 trading range are completely out. All that’s left are really stubborn shorts and very stubborn longs (with price targets of $600+). There is no point of reference to call resistance. There is no place where people can say “oh wow maybe I’ll take some profits”, maybe at $100b market cap some longs will leave and shorts will enter, on the basis of valuation", "score": 14, "replies": [{"body": "Yeah, so the first Fibonacci extension level of the old ATH of $389.61 at 123.6% is **$481.55**, so we are not *entirely* without resistance levels. 🤠", "score": 6, "replies": [{"body": "What about Elonacci’s extendo blunt? $389.61 at 420.69% is $1639.05. I’m okay with this 😎", "score": 16, "replies": []}, {"body": "Spiral out my friend", "score": 6, "replies": []}]}]}, {"body": "[Big investors are beginning to believe. ](https://youtu.be/7GSgWzmR_-c)  Turning a corner boys.", "score": 14, "replies": []}, {"body": "Elon tweeted about full self-driving last night. A holiday preview of FSD.", "score": 2, "replies": []}, {"body": "i quess some insider knows about fsd related news , somone bought 150.000 shares yesterday IN ONE ORDER -while it was at an all time high.\n\nwho would do that for no reason?\ni dont care, love it", "score": 2, "replies": [{"body": "That is a shit ton of $$$", "score": 2, "replies": [{"body": "60 million", "score": 1, "replies": []}]}]}]}, {"body": "500 +. Netherlands and should be 100+ Norway again. Keeping the gas on.", "score": 6, "replies": []}, {"body": "I have 1 Jan 20 370 call I should probably sell soon..\n\nEdit: Naw...", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "But Y? Hold out for cyberstonks.\n\nEdit: grats btw!", "score": 7, "replies": []}, {"body": "You don't have to pay it all upfront...", "score": 6, "replies": []}, {"body": "Nope. More stonks.", "score": 6, "replies": []}, {"body": "Hold for 10 and get a yacht", "score": 5, "replies": []}, {"body": "I've lost count of the many catalysts we'll have in 2020, and I can't count a single (legit) bear concern. No way I'm selling until I see what happens.\n\nCongrats!", "score": 4, "replies": [{"body": "Biggest concern for me would be a total China economic blow up.", "score": 2, "replies": []}]}, {"body": "I'm holding out for the Tesla plane!", "score": 1, "replies": []}]}, {"body": "Anyone getting the early access FSD release? If so can you comment on the experience when you try it?", "score": 6, "replies": []}, {"body": "After we already received all the gifts we could ask for from our lord and savior ELON MUSK, i wish you all happy holidays and \"en guätä rutsch is neue Johr\" as we say in Switzerland.", "score": 10, "replies": [{"body": "IDK, but what about collectively writing an xmas card to the shorts and thank for all the money?\n\nO schöni Feschttäg!", "score": 2, "replies": []}]}, {"body": "It's going to 420 may take a few days don't worry", "score": 8, "replies": []}, {"body": "My workhorse the last 10 years was Netflix, but the last 3 years I have been transitioning to Tesla which I hope to be my workhorse for the 2020s. It's almost like a second marriage but I'm feeling polygamous.\n\nI expect max upside from NFLX to be about 4x by 2030. She just doesn't have the same verve she used to, but I know all her rhythyms and I think I can continue to trade off the 30%+ panic selloffs that it is prone to, like I have done profitably many times. \n\nI expect max upside on TSLA to be closer to 20x by 2030. But this is a wild and younger beast. Not that young, but still ready to produce a nice giant brood of profitable products and services. Fortunately I hit my target core position a few weeks ago so captured the recent gains. From here I don't anticipate going lower until after 2030, and I only anticipate buying if we see a drop 30% off ATH or more. I have been absolutely horrible at short term trading this one, unlike Netflix, so I'm just going to ride the alpha.", "score": 6, "replies": [{"body": "I got sad when you sold :( y u gotta make me sad", "score": 5, "replies": []}, {"body": "It’s going to be way faster than that. Snaps up to $1,500 inside 18 months.", "score": 2, "replies": [{"body": "What's your valuation model?", "score": 3, "replies": [{"body": "I have access to Refinitiv with all research + models, but no one is properly looking at everything combined. I believe this biz is going to see 50%+ per year growth for at least 4 years to come including licensing deals, battery & storage, etc. But I genuinely believe the stock deserves a 6x EV/Rev on NTM revenue and that we are due for a short term revaluation on account of breakout performance across all segments. \n\nJust taking ~$50K for next year, which is what I think NTM revenues look like. That’s $300M. Add debt which is insignificant In relation. And it’s still over 4x our $400 price, or ~$1,600. \n\nYou can’t model up the important factors like robotaxis with partial autonomy (Tesloop, etc), new timing updates on battery cost decline + new tech for improved infrastructure-use batteries, what a VW licensing deals and others to call looks like, solar (total wild card for 2020 revenue), etc. All to say I don’t need one.", "score": 2, "replies": [{"body": "Very similar thought process to mine. I think my long-term EV/sales is ballpark 2x when net margin is 10% and forward growth is market average (S&P current p/e is 24 but that's higher than usual). Figuring out how to account exactly for a long running ramp of growth is hard to do but I feel fairly certain that Tesla can tally up a consistent 100B+$ in revenue before saturating its product lines (current, planned, and obvious), while still running a 10% net margin, so we are looking at a minimum of 200B$, discounted back 2% a year for risk-free rate, etc. so 180B$ or 1000/share.\n\nOf course, differentiating between two enormously far off price targets isn't particularly important since a lot will happen before those actually arrive (theoretically). Which is also helpful for the more speculative components like robotaxi which I think are hard to assign large values to yet (I'm not going to give that more than 20B$ right now I'd say). \n\nI'd say enthusiasm has clearly turned a corner. We'll see if China lives up to the hopes for it and whatever planetary economic conditions hold.", "score": 2, "replies": []}]}]}]}, {"body": "I never saw the upside of Netflix with current penetration other than raising cost or reducing content production expense.", "score": 1, "replies": []}]}, {"body": "Three days in a row, new ATH.", "score": 3, "replies": []}, {"body": "Today taught me I shouldn't be placing option orders on the toilet pre-market. Then selling later thinking I am in the green without checking the buy-price (╯°□°）╯︵ ┻━┻. Lost ~$1k today (wiping out yesterday's options gains) and I didn't realize it until a few hours after selling.", "score": 3, "replies": [{"body": "I, for one, rather enjoy the subtle wsb undertone the daily thread has taken recently. Entertaining, without going full retard.", "score": 12, "replies": []}]}, {"body": "Figures the second I buy a big block of calls", "score": 5, "replies": [{"body": "Same here.", "score": 2, "replies": []}]}, {"body": "It it me or it sounds like a lot of people are coming from crypto subs , talking about TA and stuff like that", "score": 4, "replies": [{"body": "It's not a crypto thing.", "score": 4, "replies": [{"body": "No of course not, but its especially strong over there", "score": 1, "replies": [{"body": "Tbf they have nothing else to look at lol. While it's not a panacea there are rational grounds for TA. The idea behind support and resistance, from what I gather at least, is that any trader who's entered a position long above support, or short below resistance, will be underwater once it breaks either way making them cover, trigger stop losses and push the share price farther in that direction. And Zeus knows volatile stocks like Tesla are heavily traded. I've definitely seen relatively often some stocks ping-ponging between both of them, and it's sometimes really obvious that bulls or bears are defending their support or resistance in those instances when the second it goes a cent above or below them you see the contrarian volume drastically increase and keep it in range. Notwithstanding it's also kind of a self fulfilling prophecy where a bunch of traders follow the same \"rules\". I have a hard time buying all the chart pattern stuff (cup and handles, head and shoulders and such), but support and resistance at least makes sense to me, I'll prefer waiting for a stock to break through either to enter a position if it's trading in a range, you pay a bit more but at least you avoid the risk of breaking in the wrong direction. Thanks for coming to my layman's TED talk.", "score": 3, "replies": []}]}]}]}, {"body": "SUPER BULL COMMENT", "score": 7, "replies": []}, {"body": "Shaping up to be another good day. Up to $408 already after just 90 minutes of pre-market trading.\n\nKeep in mind that today is a large option expiration day. A **very** large number of $400 call options is expiring today, so various entities have a large incentive to make TSLA stock price close as close to $400 as possible today, or below it..", "score": 4, "replies": [{"body": "Pardon my ignorance but how are in-the-money calls settled on expiration date? I’ve bought and sold them in my Ameritrade account but have never held all the way thru expiration. I’m currently holding 30 Jan 2021 calls with $390 strike. \n\nFWIW, I bought these calls in September 2018 after the media shit all over Elon for his podcast with Joe Rogan. I couldn’t believe that podcast drove the stock down - total bullshit on the one hand but also a great opportunity to invest and make $ off Wall Street’s ignorance. \n\nAnyways I’m curious what happens at settlement if held to maturity. Do u know ?", "score": 5, "replies": [{"body": "In-the-money calls are exercised automatically. You better have the money to buy at the strike price.", "score": 1, "replies": [{"body": "mine are paid out cash, thats what it says in the describtion", "score": 1, "replies": [{"body": "I guess an individual option can do something different, but a typical US call option that you bought and is in-the-money is automatically exercised at expiration.", "score": 1, "replies": [{"body": "strange it says \"execution style: amercian\" payout: cash..", "score": 1, "replies": []}]}]}]}, {"body": "Must've been one hell of a ride this year holding those call options!\n\nI've never held ITM options to expiration myself, but I believe you'd have to manually exercise them. How to do this I think differs from broker to broker, and contacting their support is probably the simplest way to find out how to do this.\n\nIf you don't manually exercise them, I believe they will simply expire. They are options to buy shares after all, so if you don't exercise that option, nothing will happen.\n\nEDIT: Seems like my assumptions were incorrect. Check out some of the other replies.", "score": 1, "replies": [{"body": "That's wrong, in the money contracts auto-excercise on expiry: if they were calls you get shares at the strike price.\n\nNote: if you don't have the free cash for those 100x TSLA shares you'll suffer an immediate margin call and your broker will emergency liquidate whatever holdings you have - including selling your freshly acquired shares in pre-market trading with poor execution.\n\nThey might also disable options trading on your account, because your lack of cash forced them to loan you cash over the weekend beyond margin capacity. They don't like this.\n\nA few retail platforms like Robinhood will close your options in the last hour before Friday close, but this is not typical.\n\nAnyway, you need to know what happens on expiry with your broker.", "score": 5, "replies": [{"body": "Thanks for the info! As I said, I've never held ITM options through expiration.\n\nI updated my post to reflect it's incorrect.", "score": 2, "replies": []}]}, {"body": "Thanks for the insight. It’s been a roller coaster year for sure. Fuck the shorts and all the other haters out there. Tesla rocks.", "score": 3, "replies": [{"body": "> Fuck the shorts\n\nHate to be that guy, but we prefer saying \"fuck the bear asshoe\" around here.", "score": 5, "replies": [{"body": "Shouldn't we use more respectful language for people who currently are turning out to be true altruists?", "score": 3, "replies": [{"body": "No. L2FBA is our savior and helped the stock break out of its cursed trading range", "score": 3, "replies": [{"body": "Wait, that wasn't you who started it?", "score": 2, "replies": [{"body": "Noo, I’m not L2FBA. I once stated “wow Premarket ripping bear asshoe” when it blew past $350 pre-Cybertruck. Not sure if he used that as inspiration for his wonderful username", "score": 3, "replies": [{"body": "Right, I remember the first time you made that genius post! I just assumed L2FBA used your comment for his username.\n\nLooks like he created his account Oct 25, not sure if that was pre or post your comment.\n\nI just want to make sure I'm not misplacing valor - this is important stuff we're talking about here.", "score": 1, "replies": [{"body": "I thought he came over here from wallstreetbets\n\n/u/love2fuckbearasshoe can you clear up the origin of your username? :)", "score": 2, "replies": [{"body": "It was from my orginal account lovestofuckmarriedwoman", "score": 1, "replies": []}]}, {"body": "Na I am L2FMW and from wallstreetbets \n\n\nHe prob seen me there as that is one of my phrases", "score": 1, "replies": []}]}]}, {"body": "/u/ajdude101 had a particular timespan where he could contra-jinx the stock into going the direction we wanted it to go in... that glorious period in time only lasted about 4 or 5 consecutive days I think.  His services were very much appreciated though :)", "score": 2, "replies": [{"body": "Lols", "score": 1, "replies": [{"body": "good times though 😂\n\nit was even funnier because a lot of people would downvote you and report you as a troll... i was like \"umm, dude has more shares than any of us\"", "score": 2, "replies": []}]}]}, {"body": "To the contrary, he is the adam jonas dude.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I feel like all the machine learning trading algorithms have learned that whenever Elon Tweets anything even remotely Tesla related its a bad sign and they immediately start selling.", "score": 4, "replies": []}, {"body": "Lotta news selling?", "score": 2, "replies": []}, {"body": "i need advice guys and perhaps feedback on this idea I have.\n\ni'm sitting on 20 contracts worth 98k.\n\none of them is expiring today at 355 per share. \n\nI have another 2k + 10k i can use to to exercise that contract , so I would have to sell at least 4 or 5 of those juicy contracts that are about 48.4 and potentially more next week and so on, but this options game is crazy.\n\nI want to have 100 shares at least of tesla and possibly 200 more, but want to sell the contract at a higher price than what it is now (it was 55 at beginning of trading day 🙁)\n\nagain, i'm just trying to leverage these contracts to have more shares and be like you guys that have 400 shares of tesla and so on.\n\n&#x200B;\n\n my contracts are as follows : \n\n12/20/19 at 355    1\n\n1/3/20 at 357.5     1\n\n1/24/20 at 360   18", "score": 2, "replies": [{"body": "Why not just sell a chunk after year end (for tax reasons), put ~10-20% aside for buying opportunities and put the rest in LEAPs\n\nI don't want to use the \"luck\" word but the stock has run up 20% on basically no news since the Cybertruck unveil. Those contracts could've easily expired worthless and I wouldn't advise putting more than 10-20% of your gains into similar contracts. Basically, take the money and run (into LEAPs)", "score": 1, "replies": [{"body": "i'm definitely doing that beginning of the year or after, but the thing is exercising this contract today. 360 for a stock is looking CHEAP, but without the capital to exercise i have to get the best value for those 1/24 contracts and i would be losing 22% of them, which have huge upside to be worth more\n\n&#x200B;\n\nyou can say luck for sure (i've bought tesla contracts in the past that have expired worthless), but we're both aware that the stock is moving this much for various reasons. I'm definitely looking at various ways in which i can be more solidified in my positions one is having shares which i used to have. I had 100 shares at 358 and sold to buy all of these contracts. paid off.\n\n&#x200B;\n\nalso 1 could've expired worthless i have 19 other's that still would've had some time to make a return on", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "that's what i plan on doing, was just seeing if this is the right move.\ngiven that 1. the contracts can raise much more and 2. 1 expire's today and 3. i don't have enough capital so i would be given up 22% of them", "score": 1, "replies": [{"body": "Yea, I agree with the other guy. You pretty much never want to get assigned. I'd sell the contract and do whatever you want with the proceeds", "score": 3, "replies": [{"body": "I’m not an expert, but I concur with the above.", "score": 2, "replies": []}, {"body": "right right", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "why would i do that when i can buy them at a discount and immediately be up 4k ?", "score": 1, "replies": [{"body": "By today's close, the value of the option will be identical to the potential profit of buying at 355 and selling at the market price", "score": 3, "replies": [{"body": "yup", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That's how I see it, the thing is just squeezing more value from other contracts and buy 36k which is what i'll be doing", "score": 1, "replies": []}]}, {"body": "Can get the gain without outlaying the capital. 100 shares at a go is pricey.", "score": 1, "replies": [{"body": "but it's not as high risk as a options contract and as we all know can only go up this year with 2020 being amazing that it will be for all of us that believe in tesla", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I'd like it to hold 400 but I'd also like a good buying opportunity to load up on shares!", "score": 4, "replies": [{"body": "Me too, I have half the position I want to build.", "score": 2, "replies": [{"body": "Simple answer: time machine.", "score": 3, "replies": []}, {"body": "I only have a quarter :/", "score": 1, "replies": [{"body": "Your position is already much bigger than mine, going for 75 to 100 shares.", "score": 2, "replies": [{"body": "Nice, I just hope it doesn't go astronomical before we can get more shares", "score": 2, "replies": [{"body": "Im debating of adding another 40 shares to my 175 (at 220). I'm a little nervous.", "score": 1, "replies": [{"body": "It won't matter the stock is going to 1000 2 years", "score": 1, "replies": [{"body": "I think it's going 800 mid next year.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Did you add close to 60 shares this week?", "score": 1, "replies": [{"body": "Yes!", "score": 1, "replies": []}]}]}, {"body": "Tesla is down .5%!  Bankwupt!!!!!", "score": 1, "replies": [{"body": "I don’t really understand why if a stock is down .5% it is the bankrupt? Can someone please explain this to me? I’m new to stocks", "score": 4, "replies": [{"body": "Because /s", "score": 3, "replies": [{"body": "Sorry I’m new to coding? What’s /s", "score": 3, "replies": [{"body": "Hi New to Coding, I'm Fred. I'm new too.", "score": 4, "replies": []}, {"body": "Sorry , im new to english. Whats sorry?", "score": 3, "replies": []}, {"body": "poopoo", "score": 2, "replies": []}, {"body": "Sarcasm", "score": 1, "replies": [{"body": "What's that? New to humor.", "score": 2, "replies": [{"body": "The use of irony to mock or convey contempt", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Well that was underwhelming", "score": 1, "replies": [{"body": "Could be priced in.", "score": 5, "replies": [{"body": "Mm. Someone getting the FSD news before us?", "score": 5, "replies": [{"body": "Seems like a few did.", "score": 5, "replies": []}]}]}, {"body": "Nasdaq looking similar.", "score": 1, "replies": []}]}, {"body": "That's it. sky is falling.", "score": -8, "replies": [{"body": "Damn, we aren’t up 3% today. TSLAQ imminent.", "score": 12, "replies": [{"body": "Competition is coming? Sell! Sell!", "score": 1, "replies": []}]}]}, {"body": "1 is any ICE car manufacturer 2 is an economics professor\n\n1: What are the options when you have an inferior product in an aggressive marketplace?\n\n2: well if you have a large share of the market you buy out the competition.\n\n1: And, if this isn't possible?\n\n2: Then, Reduce prices to increase market share\n\n1: This assumes low overhead\n\n2: Of course, otherwise you operate at a loss, and worse as your prices drop, your products start to lose consumer credibility\n\n<Inspired by Stringer Bell>", "score": -5, "replies": [{"body": "fuel bewildered complete rob memorize cake fretful mindless shelter physical\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": []}]}, {"body": "Apparently Elon Musk donated 5.5 million shares any idea to who. That's 15% of his Tesla shares significant amount.", "score": -22, "replies": [{"body": "https://ir.tesla.com/static-files/5e5bbbf6-da25-4adb-ab50-a8a1fda21b6d\n\n17,000 shares worth about $5.5 million.\nYhugeeee difference from 5.5 million shares.", "score": 14, "replies": []}, {"body": "Nevermind that's 5.5 million worth of shares, almost had a heart attack.", "score": 9, "replies": [{"body": "Ya bro I was like oh hell no that’s going to cause a dump!", "score": 5, "replies": []}]}, {"body": "Probably to his trust or to his nonprofit foundation both of which already held a substantial amount of his stock.", "score": 1, "replies": []}, {"body": "Like just now he donated them??? Source please.", "score": -1, "replies": [{"body": "I'm on my phone so I can't copy paste, came from a verified Twitter account who showed the SEC listing from.", "score": 1, "replies": []}, {"body": "I saw this the other day. You can find it on SEC filing (don't feel like digging for it). It didn't give any information other than the number of shares.", "score": 1, "replies": []}]}]}]}
{"title": "TSLA $420 today", "selftext": "Boys, hold on to your tendies, daddy Musk is gonna send us to the moon today. Wait and watch 🥰", "id": "ed9lkc", "created_utc": 1576845123.0, "score": 2408, "upvote_ratio": 0.97, "num_comments": 259, "comments": [{"body": "Awesome I asked my mom and we bought a share yesterday am I gonna be able to retire???", "score": 1146, "replies": [{"body": "Only if your mom says you can", "score": 475, "replies": [{"body": "[deleted]", "score": 178, "replies": [{"body": "username checks out", "score": 70, "replies": [{"body": "Username checked OP’s mom out", "score": -2, "replies": []}]}, {"body": "Actually she does", "score": 12, "replies": [{"body": "Username also checks out", "score": 13, "replies": []}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "It’s beetlejuicing people cool your jets", "score": 3, "replies": []}]}]}, {"body": "I like their mom", "score": 6, "replies": []}, {"body": "She can't talk with her mouth full.", "score": 3, "replies": []}]}, {"body": "Retirement implies you already have a job", "score": 158, "replies": [{"body": "I gotta clean my room and do dishes and shit", "score": 225, "replies": [{"body": "Shiiiet tough life, son", "score": 57, "replies": []}, {"body": "buy a robovac and dishwasher with that TSLA stock bro!", "score": 25, "replies": []}, {"body": "Good boy points, get them tendies!\n\n [https://www.youtube.com/watch?v=ADvJ8p8yY-c](https://www.youtube.com/watch?v=ADvJ8p8yY-c)", "score": 5, "replies": []}, {"body": "Sounds like socialism..", "score": 4, "replies": []}]}, {"body": "since when?", "score": 2, "replies": []}, {"body": "Or had a job. I was an Electrician who worked class (A) - explosion proof boxes. I always thought that sounded cooler than, I built gas stations. Now I am retired side jobs for people in my community.\n\nI am a professional don't try this at home.", "score": 2, "replies": [{"body": "I tried building a gas station at home but it didn't work out to well.", "score": 9, "replies": [{"body": "Wait. \nYou guys are using explosion proof boxes?", "score": 6, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "That's true but it did sound cool. 😂", "score": 4, "replies": []}]}]}, {"body": "Dumb. I sell gas door to door with my associates who don’t take kindly to “no”", "score": 1, "replies": []}]}, {"body": "Thank you for your service", "score": 3, "replies": [{"body": "Thank you. 😁 It was fun and in Washington State worked in the rain more often than not. 😊", "score": 1, "replies": []}]}, {"body": "Instructions unclear, accidentally built gas station at home, plz halp.", "score": 2, "replies": [{"body": "Ok where did it all go wrong, did you remember the explosion proof boxes, connected with PVC Coated Rigid Conduit, don't forget to vapor seal your conduit. Otherwise your cashier may take a nap. Ok look at the picture easy as1,2,3. \n\nhttp://imgur.com/gallery/DHN28K3", "score": 2, "replies": [{"body": "The fire is inside the tank, the whole thing, is that bad?", "score": 2, "replies": [{"body": "Its ok calm down we can fix it. Did you purchase NAKD stock? If so it's worse than I thought. RUN!!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I actually told my dad to buy a few shares at around 220$\n\nThis guy at the bank said Tesla’s to unsafe and he didn’t do it\n\nCuck", "score": 105, "replies": [{"body": "Dumbfuck banker, bet he’s never heard of box spreads.", "score": 42, "replies": []}, {"body": "hah! My dad's a moron in the other direction, he put 40k down at that same drop, and is enjoying some gourmet tendies rn. Fuck, he should be the one on wsb, gambling his savings on papa Musk.", "score": 13, "replies": []}, {"body": "As in the bank teller?", "score": 3, "replies": []}, {"body": "You should email that bank and tell them what the bank said along with the current stock price. Also follow it up with withdrawing all our money now.", "score": 1, "replies": []}]}, {"body": "My uncle told me to sell when it was like $140 lol I wanna respond to that email from like 5 years ago.", "score": 43, "replies": [{"body": "your uncle is a red neck idiot use gasolin, no disrespect", "score": 42, "replies": []}]}, {"body": "Retirement is priced in dickhead", "score": 27, "replies": [{"body": "So what your saying is, I need more dickheads to retire....Got it!", "score": 10, "replies": [{"body": "Only within your personal risk tolerance. You dont want to many dick heads and en up GUHing", "score": 7, "replies": []}]}]}, {"body": "A whole share?! Aren’t you able to trade fractional shares on RH, yet? $10 seems like a reasonable $TSLA investment, I’m not sure about this $420 nonsense; way above my personal risk tolerance...", "score": 4, "replies": [{"body": "On the wait list with the other half a million people last time I checked.", "score": 1, "replies": []}]}, {"body": "No", "score": 9, "replies": [{"body": "Why the fuck not? That cybertruck is built to be on Mars.", "score": 23, "replies": [{"body": "Easy on the windows..", "score": 15, "replies": []}]}]}]}, {"body": "Holding these Jan 2021 $200C until Jan 2069. \n\nPicked em up for $65 when wsb cucks were talking and betting like bankruptcy was imminent. \n\nAnyone remember /u/Old_Bit before he seppuku'd his account all over the place? That guy was basically Mark Spiegel except missing even more chromosomes.", "score": 283, "replies": [{"body": "fuck that's a good deal, how much are they today? $300?", "score": 87, "replies": [{"body": "The fucked up thing is that they're only around $215.00\n\nYou mathed that right; it's allowing for 1-2% growth.", "score": 88, "replies": [{"body": "yeah bruh you ain’t gonna get no premium on ITMs", "score": 33, "replies": []}, {"body": "That’s what happens to deep ITM options. IMO you are better off selling and either buying stock or re-rolling the calls", "score": 60, "replies": [{"body": "I bought 110 2021 calls so I could take some cash and still have similar exposure.", "score": 2, "replies": []}]}, {"body": "Do you seriously not understand how premium works?\n\nJesus christ.", "score": 23, "replies": [{"body": "Daddy whip me with that option chain", "score": 16, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Did you not read his comment? Has to be Warren Buffet’s alt account with how much he knows", "score": 1, "replies": []}]}, {"body": "Guess not, you gonna come teach me? I'll give you a ride in the model S my ignorance bought me and call you Elon while giving you a reach-around.", "score": 6, "replies": [{"body": "Ah the classic \"I guessed right and got lucky so therefore it's ok that I'm an idiot\" defense.", "score": 20, "replies": [{"body": "Where do you think you are right now?", "score": 0, "replies": []}, {"body": "Tech platforms are my jam, hombre. I was buying AMZN when it was \"a bookstore wtf say bye to your money\"\n\nNFLX when it was a DVD mailing service, \n\nFB when it was Myspace2.0,\n\nTSLA when they had one car, etc. etc. \n\n\nHindsight is 20/20 but I was called all sorts of names for every one of my early-stage investments. Exactly zero of them have gone downhill. \n\nThe only one I really missed the boat on was AAPL because I thought their closed-ecosystem would fall victim to fickle consumer tastes and global competition would erode margins & market-share. TSLA would suffer the same fate if I didn't believe their future was providing energy storage to all markets. \n\nSpotting a platform vs. a product is either a real thing or I got lucky...a bunch of times. With zero misses. \n\nOr ya know, just read Zero to One by Peter Thiel to get started on a topic you've demonstrated to know nothing about. But this school of thought is very real, and reading it would've made you buy all the shit you wish you did in 2012.", "score": -7, "replies": [{"body": "i was still being breastfed in 2012", "score": 5, "replies": [{"body": "my man, read Zero to One and you'll be breastfeeding until the day you die. \n\nPlus, lactating milfs are *into things*.", "score": 4, "replies": [{"body": "breastfeeding off of the supple breasts of the NASDAQ is my dream", "score": 2, "replies": []}]}]}, {"body": "My dad did everything you did and doesn't know shit about shit.  Doesn't make you a genius.  He also bought GOOG and is a Boomer.", "score": 2, "replies": []}]}]}]}]}, {"body": "Sell", "score": 12, "replies": []}, {"body": "You dumbass cash out your principal and roll the rest forward to a later expiry.", "score": 3, "replies": []}, {"body": "Bro", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 45, "replies": [{"body": "Retire is a moving goalpost of a term hehe. It's human nature to focus on *what could've been* but I learned that ain't good for any investor's mental health. A win is a win lmao. \n\nFWIW I've been buying TSLA since ~$30 and am around 600 shares plus the 2021 $200C contracts.\n\nTSLA is just too volatile for me to stick with anything other than LEAP calls.... but as dalio says: \"in order to make money in the markets, you need to bet against the consensus and be right, as consensus is baked into the share price.\"\n\nAs long as the consensus is valuing TSLA as an automotive company vs. an energy conglomerate, I'll be buying all day long.", "score": 50, "replies": [{"body": ">As long as the consensus is valuing TSLA as an automotive company vs. an energy conglomerate,\n\nPretty sure the share price reflects the latter view at this point. If you disagree, then I'll smoke the same shit you got.", "score": 28, "replies": [{"body": "Today it does, but 8 months ago it didn't. When it's down down everyone talks about it being only a car company.", "score": 9, "replies": []}]}, {"body": "> As long as the consensus is valuing TSLA as an automotive company vs. an energy conglomerate, I'll be buying all day long.\n\nDude, its worth more than FCA and Ford combined. The fuck are you talking about? Clearly it is not being valued as an auto company", "score": 9, "replies": [{"body": "Energy conglomerates also trade at fairly low P/E multiples, what is this dude smoking?", "score": 10, "replies": [{"body": "lmao wait....you're comparing growth multiples of a *new era of the future of energy* with *centuries-old incumbents* ?? \n\nhahah. fuck. What next, chief, gonna reference Yellow Pages stock to get an idea of where Google should've been in 2010?", "score": -1, "replies": []}]}, {"body": "> $70BN \n\n> Energy Conglomerate\n\nlmfao. It's trading at a high-growth automotive company.\n\nYou really think monopolizing a new era of energy caps off at a $100BN endeavour? lololol. fucking golden. Everyone and their fucking uncle in silicon valley knows you build the platform, not the product. Elong -- or any of the PayPal mafia -- never would've gotten into manufacturing a physical commodity when you know globalization is going to decimate margins over time. \n\nThis is so fucking amateur if people just spent a year or two studying it they might stop going BUT P/E SAID NOT TO BUY AMAZON AT $500", "score": 0, "replies": []}]}, {"body": "But Tesla Energy makes up like less than 2% of their P&L? \nThey're a car company with a failed solar install company that they only acquired to keep the world from figuring out Elon doesnt have a clue how to run a business. \n\nYou can't believe the shit that's coming out of your mouth, but judging from the stock price there's plenty more of you out there.", "score": 2, "replies": [{"body": "“This company is worthless and only successful because everyone keeps buying their products and investing”\n\nI’ll have what he’s having.", "score": 1, "replies": []}, {"body": "Tech investors bet on the future. The hard part is seeing what's not in front of you. \n\nRead Zero to One by Peter Thiel (PayPal Mafia) to get an idea of where to begin on *platform investing*. I'm not talking out of my ass here, lol. \n\nI'm gonna blow some minds and say Tesla energy is 100% of the P&L because their cars run on the platform they're building. It's the batteries. Why TF a smart guy like Elon and his friends go \"I'm gonna build something that the rest of the world will come and drive my mkt share and margins to zero!\" \n\nFuck no....The guy's literally creating demand for his own entire industry using a proof-of-concept (cars CAN run on batteries!) and aiming to monopolize that industry (energy storage / cell production)", "score": 1, "replies": []}]}]}]}, {"body": "I remember that old coot", "score": 2, "replies": []}]}, {"body": "Mars*", "score": 106, "replies": [{"body": "Uranus", "score": 46, "replies": [{"body": "hell yea baby !", "score": 14, "replies": []}, {"body": " ( ͡° ͜ʖ ͡°)", "score": 8, "replies": []}]}]}, {"body": "[deleted]", "score": 177, "replies": [{"body": "Worth it.", "score": 70, "replies": []}, {"body": "Stock reach 420 >>> Elon Tweets \"haha suck it SEC\" >>> stock goes to 690 >>> autopilot teslas take over the planet >>> elon colonizes mars and moon >>> stock reaches 42069", "score": 48, "replies": []}, {"body": "TESLA > 420 >> Elon takes TESLA private >>> SEC chucked", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 201, "replies": [{"body": "Plot twist: That was your plans for tonight either way.", "score": 234, "replies": [{"body": "[deleted]", "score": 143, "replies": [{"body": "Wait, you were going to do a line of nothing off a dick? Kind of like smelling a fine cigar before using it?", "score": 77, "replies": [{"body": "[deleted]", "score": 59, "replies": [{"body": "Baby let me smell yo dick", "score": 8, "replies": []}]}, {"body": "Perfect analogy", "score": 7, "replies": []}]}, {"body": "The dick was already priced in.", "score": 11, "replies": []}]}, {"body": "Second plot twist : its his dads dick", "score": 3, "replies": [{"body": "Third plot twist: his mom's. And then he got spitroasted by both.", "score": 4, "replies": []}]}]}, {"body": "Can we get a youtube vid of that please?\n\nCmon daddy!", "score": 6, "replies": []}, {"body": "Proof or ban", "score": 1, "replies": []}, {"body": "You're safe don't worry", "score": 1, "replies": []}]}, {"body": "Weed number", "score": 167, "replies": [{"body": "[removed]", "score": 43, "replies": [{"body": "[nice](https://youtu.be/zYt0WbDjJ4E)", "score": 15, "replies": [{"body": "[nice](https://youtu.be/UBX8MWYel3s)", "score": 14, "replies": [{"body": "Nice", "score": 6, "replies": [{"body": "Nice", "score": 4, "replies": [{"body": "Nice.", "score": 5, "replies": [{"body": "Noice", "score": -7, "replies": [{"body": "[dude...](https://youtu.be/KBltMTAD4eM)", "score": 1, "replies": [{"body": "Fml", "score": -1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "fuck", "score": 2, "replies": []}]}, {"body": "I sold my $350 calls on Monday I wanna kms", "score": 105, "replies": [{"body": "Sold my 355 call that cost me $200 last week... Was worth $4850 yesterday. I'll join you on that bridge, bud.", "score": 38, "replies": [{"body": "It's alright man, theres more trades for you to take advantage of, dont get hung up and start thinking stupid.", "score": 10, "replies": [{"body": "Think stupid.", "score": 0, "replies": []}]}]}, {"body": "I wanna miles", "score": 43, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Bought at $6.6 sold at $20.9 so almost $1500 but they’re trading at $45 now..\n\nEdit: realized they were $360C", "score": 22, "replies": [{"body": "A win is a win, take it and keep moving", "score": 8, "replies": []}]}]}, {"body": "I almost bought $420 meme calls last week for March, I wanna kms", "score": 4, "replies": []}]}, {"body": "Is funding even secured?", "score": 42, "replies": [{"body": "Bigly", "score": 37, "replies": [{"body": "Thanks  00110001liar, very cool!", "score": 10, "replies": [{"body": "He's a Real Nigga", "score": 3, "replies": []}]}]}]}, {"body": "This aged about as well as any other option i've ever bought", "score": 15, "replies": []}, {"body": "It’s gonna hold at 419 guaranteed", "score": 31, "replies": [{"body": "either that or the algos gonna fucking yeet it to 430", "score": 35, "replies": [{"body": "My magnum bull dong thanks you", "score": 8, "replies": []}]}, {"body": "Or it goes down back to 400 or below", "score": 3, "replies": [{"body": "no, tsla only goes up", "score": 3, "replies": [{"body": "I was pointing out the possibility. As long as we are all observing it. It should hit 420 next Tuesday. Right before Christmas for Elon.", "score": 1, "replies": []}]}]}]}, {"body": "Stock should be $4,000 today. Oh well Wall Street starting to wake up on this name. Maybe a matter of days/weeks", "score": 36, "replies": [{"body": "That would literally ruin my life permanently lol.", "score": 16, "replies": [{"body": "maaan, can’t ever short Tesla .. the swings are so random, and it get real bad real fast for either end .. just my opinion tho", "score": 8, "replies": [{"body": "I think it's just not worth 70 billion. Cannot make positive cash flow, cannot explain the account receivables when asked about it, exceptionally huge turnover in executives, flat sales, million robotaxis next year is a fucking joke...\n\nStock may be headed to $420 just for the memes but my asshole is braced", "score": -4, "replies": [{"body": "Doesn't really matter if you think it shouldn't be worth $70 billion. The only thing that matters for your investment choices is if you think it **will** be worth $70 billion.", "score": 16, "replies": [{"body": "Aka pie in the sky investing vs fundamental investing.", "score": 3, "replies": [{"body": "Just being conservative about everything is not “fundamental investing” lol.", "score": 1, "replies": [{"body": "Unless you believe that Tesla will eventually make 5 Billion dollars in annual profit (adjusted for inflation compared to today) they aren't worth 75B (using P/E of 15 for automotive).", "score": 2, "replies": [{"body": "Google the profit of other car makers... And realize that when Tesla makes the same profit as Ford the P/E will be at least double, because the rest of the US automotive sector has almost no growth potential.", "score": 2, "replies": []}]}]}]}]}, {"body": "I get what ur saying but I think ur applying traditional valuation to a non traditional stock", "score": 4, "replies": []}, {"body": "Fuckin LOL. Dude here thinks metrics still determine stock value. Recreational stonk buyer hype has won the day son.", "score": 2, "replies": []}, {"body": "Tesla could be profitable today if they just give up on future investments but that would be stupid.", "score": 2, "replies": []}]}]}, {"body": "Heavy leveraged short position?", "score": 9, "replies": [{"body": "Worse, my ego would be hurt", "score": 83, "replies": []}]}]}]}, {"body": "Well I need to decide. I’ve been holding since 100. In my mind I’ve been thinking 10 year hold but I’m thinking of selling some to buy back on a dip. Problem is if I do that it will probably climb it’s way to 600 and if I don’t it’ll sink to 280 I have an amazing effect on the market", "score": 12, "replies": [{"body": "Why are you in this sub", "score": 4, "replies": [{"body": "Why you ask", "score": 1, "replies": [{"body": "You've been holding since 100...", "score": 1, "replies": [{"body": "Oh yeah huh. I forgot I’m in wsb I do r/stocks to so these things just pop up and I comment without looking enough I guess. I’m a full wsb member anyway I’ve made plenty of money losing errors in the past plus after all these years I’m getting into options so I value the info here. No offense meant, I come in peace", "score": 0, "replies": []}]}]}]}, {"body": "you should totally sell so I can cash in on $600.", "score": 3, "replies": []}]}, {"body": "Right now 404 not found", "score": 10, "replies": []}, {"body": "Ummm guys...", "score": 9, "replies": []}, {"body": "Tesla is going private for $694.20 a share", "score": 15, "replies": [{"body": "funding secured", "score": 8, "replies": []}, {"body": "*$420.69", "score": 0, "replies": []}]}, {"body": "I bought 440 shares at $250. Sold at $300. Gonna kms", "score": 8, "replies": [{"body": "Made good sense when you did it. You made decent money so don’t beat yourself up.", "score": 1, "replies": []}]}, {"body": "fucking tesla shorters borrowing as many shares as they can to sell to prevent it from hitting 420. fucking cocksuckers", "score": 22, "replies": [{"body": "413 was pretty close...", "score": 6, "replies": []}]}, {"body": "Bought 420 calls at the open yesterday and pussied out after the midday dip.  Still, got out even and I've got shares of this bitch.  So not reaching for the $ROPE just yet.", "score": 6, "replies": []}, {"body": "Su Bae mommy and Elon Tusk daddy please give us the monies 💸", "score": 5, "replies": []}, {"body": "Late to the party guys.   Sold it today.   %33 gains +70k", "score": 7, "replies": [{"body": "Ain't nothin wrong with that. Run Forest, run.", "score": 1, "replies": []}]}, {"body": "I can’t believe that in May some of you autists kept peddling tsla 420 in 2020.\n\nI’m glad I listened to you retards! \n\n💛", "score": 5, "replies": []}, {"body": "420 meme, 425 pump, anything above that its time for puts", "score": 6, "replies": []}, {"body": "if not today next week FOR SURE.", "score": 5, "replies": []}, {"body": "Nice.", "score": 3, "replies": []}, {"body": "Nice", "score": 3, "replies": []}, {"body": "seems like in the last few days, every day around lunchtime (EST) tesla falls into a trough, and digs its way back out again...", "score": 3, "replies": []}, {"body": "Well, my Jan 2020 Puts at $175 strike are not looking good right now. Down 99.7%. Bought them in November 2018 and should've cashed out during the summer drop, but got greedy.", "score": 3, "replies": [{"body": "Wow. You should make a thorough Reddit post so people can learn from this.", "score": 2, "replies": []}]}, {"body": "$404.20. \n\nFuck it. Close enough.", "score": 3, "replies": []}, {"body": "Confirmed!", "score": 2, "replies": []}, {"body": "SPY calls are free money today for the squeeze up today! Don't forget that.", "score": 2, "replies": []}, {"body": "So high", "score": 2, "replies": []}, {"body": "5th set of calls, bought the 420’s for Christmas. Now what am I gonna get for Christmas? Dammit Elon, put down the meth pipe, STOP hitting the buy button and take a break man.", "score": 2, "replies": []}, {"body": "So you are saying Musky may take it private as he has funding secured for some time now.", "score": 2, "replies": []}, {"body": "It better fucking go I’ve got 417.5 calls", "score": 2, "replies": [{"body": "lollll i think you’re gonna rip. when’s the expiration?", "score": 4, "replies": [{"body": "Almost certainly today", "score": 4, "replies": []}]}]}, {"body": "This was the perfect inverse. Thanks", "score": 2, "replies": []}, {"body": "not lol", "score": 2, "replies": []}, {"body": "Inside source said it’ll close at $420.69", "score": 2, "replies": []}, {"body": "Too think that I had 10 thousand to my name when it was trading at 21 a share... should have listened to my mother.", "score": 2, "replies": []}, {"body": "this aged well", "score": 2, "replies": []}, {"body": "I have a $TSLA short seller econ teacher. Make him suffer.", "score": 2, "replies": [{"body": "What a fucking idiot, he should be fired.", "score": 2, "replies": []}]}, {"body": "This did not age well.", "score": 2, "replies": []}, {"body": "Well this hasn't aged well", "score": 2, "replies": []}, {"body": "Age this well did not.", "score": 2, "replies": []}, {"body": "My play is to sell 410 puts (and buy some 390 puts for protection) expiring today, FDs at their finest", "score": 5, "replies": [{"body": "Don’t be fking dumb. Atleast buy narrower spread width but more number of contracts instead of your momma ass wide spread with fewer contracts. Same profit loss profile but way less risk if going for fds", "score": 13, "replies": [{"body": "agreed, and the premium you'd collect on 4 spreads is close enough to the total premium you'd collect on a spread that's 4x as wide, plus your risk is much smaller.", "score": 2, "replies": []}]}, {"body": "Literary can’t go tits up", "score": 5, "replies": []}, {"body": "you probably made bank today with them puts eh?", "score": 1, "replies": [{"body": "He said he was SELLING 410 puts. Which to my knowledge would mean he was bullish on Tesla going up.", "score": 4, "replies": [{"body": "ah, yes. You're correct.\n\nI was reading that wrong hastily LOL. \n\nI guess you read what you want to read (would have been great \"scalp\" for today from open with puts)...", "score": 1, "replies": [{"body": "Didn't enter the position based on the weak open, thankfully 🥰", "score": 1, "replies": []}]}]}]}]}, {"body": "oof", "score": 2, "replies": []}, {"body": "Promise to buy one share at $420 just for the hell of it.", "score": 2, "replies": []}, {"body": "https://twitter.com/meckimac/status/1208028150011170816?s=21", "score": 1, "replies": []}, {"body": "LOL!", "score": 1, "replies": []}, {"body": "i have a trailing stop set for $390", "score": 1, "replies": [{"body": "should be there shortly.", "score": 1, "replies": [{"body": "i think the EOD change will be around 0", "score": 1, "replies": []}]}]}, {"body": "In this case its pronounced \"send us to mars\"", "score": 1, "replies": []}, {"body": "Fucking really?", "score": 1, "replies": []}, {"body": "Hope you all sold your calls at open on that spike 😎", "score": 1, "replies": []}, {"body": "Over real valued", "score": 1, "replies": []}, {"body": "It’s not free riding if you don’t inhale", "score": 1, "replies": []}, {"body": "fuck i kept averaging in... gonna be some hard core scat shit eating 2 girls and a cup kind of loss porn... but im poor so no 10k losses", "score": 1, "replies": []}, {"body": "it’s just -0.5% guys chill", "score": 1, "replies": []}, {"body": "Noice", "score": 1, "replies": []}, {"body": "Still thinking that?", "score": 1, "replies": []}, {"body": "Not today muskRATZ", "score": 1, "replies": []}, {"body": "Could happen with Boeing falling to get that unmanned ship to the ISS. Looks good for Elon’s team.", "score": 1, "replies": []}, {"body": "Daddy Musk always gets the last laugh!", "score": 1, "replies": []}, {"body": "[He's looking at you Muskyboi](https://youtu.be/Cil7tOPh4qM)", "score": 1, "replies": []}, {"body": "So are we going for $6969 on the stock price next?", "score": 1, "replies": []}, {"body": "What’s causing the upwards movement? Future sales of the Cybertruck?", "score": 1, "replies": [{"body": "surprise profit in Q3 for the first time ever and a bunch of good news regarding the upcoming production in China\n\n\nPlus a lot of hype. People like the company", "score": 1, "replies": [{"body": "There's been a positive EPS quarter last year but there's definitely been a whole lot of goon news since.", "score": 2, "replies": []}, {"body": "This use to be a meme stock", "score": 1, "replies": []}, {"body": "And new EV credits in the US", "score": 1, "replies": []}]}]}, {"body": "But did it hit $420.69??", "score": 1, "replies": []}, {"body": "Wtf is happening?", "score": 1, "replies": []}, {"body": "Shit my car is about sprout it's wings https://imgur.com/RLuMpFb.jpg", "score": 1, "replies": []}, {"body": "Memed in", "score": 1, "replies": []}, {"body": "Papa is that you?", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Nope. Gonna plateau and AMZN is gonna skyrocket next week.", "score": 1, "replies": [{"body": "Exactly, so buy credit spreads on Tesla.", "score": 1, "replies": [{"body": "Told you. You probably didn’t listen.", "score": 1, "replies": []}]}]}, {"body": "Funding secured", "score": 1, "replies": []}, {"body": "holy shit i think we will get there the meme will be realized", "score": 1, "replies": []}, {"body": "Boeing down, SpaceX up.   Does Tesla go along for the ride?", "score": 1, "replies": []}, {"body": "📷\n\nI made 200% on todays $TSLA puts. AMA", "score": 1, "replies": [{"body": "Nice Im holding mine over the weekend", "score": 1, "replies": [{"body": "I like it. A break of $400 is a given imo", "score": 1, "replies": []}]}]}, {"body": "Fuuuck— was funding secured?!?", "score": 1, "replies": []}, {"body": "Nice.", "score": 1, "replies": []}, {"body": "So close.", "score": 1, "replies": []}, {"body": "I buy a share every time it has like a $10 drop.  I missed the $400 price today but I got it at $404.", "score": 1, "replies": []}, {"body": "I told my mommy and she bought 3 shares", "score": 1, "replies": []}, {"body": "buy buy buy", "score": 1, "replies": []}, {"body": "I’m waiting for $420.69", "score": 1, "replies": []}, {"body": "Time for 420 puts?? Exp. 1 month?", "score": 1, "replies": []}, {"body": "**funding secured**", "score": 1, "replies": []}, {"body": "Holding on to my 3 shares for dear life. 🙆‍♂️", "score": 1, "replies": []}, {"body": "I bought a model 3 last week so that has to be good for a nickel. Onward and upward.", "score": 1, "replies": []}, {"body": "Tesla didn't plateau at all. So idk wtf you mean lol", "score": 1, "replies": []}, {"body": "It will hit 420, stay there for 10 seconds and then drop back to 400. Then recover after christmas and go for 550 before droping back to 450.", "score": 1, "replies": [{"body": "Voices in your head pal?", "score": 14, "replies": [{"body": "They’re whispering “priced in”", "score": 8, "replies": []}, {"body": "indeed", "score": 1, "replies": []}]}]}, {"body": "Only if I can have my hand in your pants while we ride to the moon together", "score": 1, "replies": []}, {"body": "You mean 320 right? Lmao", "score": 1, "replies": []}, {"body": "Sooo.... Time for puts?", "score": 0, "replies": [{"body": "Momma rang your dinnerbell son, time to go.", "score": 1, "replies": []}]}, {"body": "Tesla got dragged to court by a human rights orginasation for child labour in cobalt mines in the Congo, maybe next decade bro.", "score": -8, "replies": [{"body": "Only a few days to go, then!", "score": 3, "replies": [{"body": "Market doesnt give af, lets go earlier", "score": 1, "replies": []}]}, {"body": "Might as well list all the other tech firm that are also being sued. They aren't going to win. They are hoping these big tech companies will pressure their client into having better safety.", "score": 3, "replies": []}, {"body": "***p r i c e d  i n***", "score": 2, "replies": []}]}]}
{"title": "Introducing the Official $TONKS and $BECKY Trackers, with real time updates and graphs (beta)", "selftext": "STAR AND BOOKMARK THIS GOOGLE SHEET, you should be checking this everyday the way you check Robinhood every minute. Everyone always talks about the $BECKY index and how it outperforms the S&P, without any data to back it up. And now there is a new $TONKS added in the mix. It’s time that r/WSB officially decides on what makes these indexes and starts tracking them religiously.\n\nI made an application that tracks $TONKS and $BECKY in real time, and as of 9:30am this morning it is operational. The index and the individual stock prices are updated every 60 seconds, and the graph is updated too. I’ll maintain this and add weekly, monthly, and yearly graphs as time goes by.\n\nTo calculate the index price of $TONKS, I took the list that /u/TheGlennDavid put together. I multiplied each stock’s market value by the percentage weight, and added them all together. I then divided that number by an arbitrary number to get the price down to $404.04 (The price $TSLA closed at yesterday). For $BECKY, I took 14 $BECKY stocks that people mentioned a lot and added their market caps together. I divided that by an arbitrary number to get the price of $69.00.\n\nPlease let me know if you have any feedback or if I should add/remove any stocks from the indexes or if I should calculate the indexes differents. I’m autistic so idk anything about index funds other then they’re boring. I can also add a $CHAD index, so lemme know what stonks belong there.\n\nThis is only the beta version. I want to officially start tracking this on January 2nd, and start the decade off right with the two hottest indexes. This gives us time to decide which stonks we want to make up the index, and how we should calculate them. Also in the future I wanna use Black-Scholes to develop options pricing for these indexes ;)\n\nPlease roast this idea and my choices of stonks, and I’ll make this better. The 2020s will be the decade of WSB.\n\nhttps://docs.google.com/spreadsheets/d/1ZgG5JNffElQK_UICs9V4xwd1L4N7Yumfb_Pzj-GaVF0/edit?usp=sharing\n\nEDIT: I'll replace ULTA with LVMUY in $BECKY, and replace Twitter with Pintrest (I agree twitter isn't used that much)\nHow do I not have MTCH?? (Tinder, Hinge) That needs to be there\n\nHere are my thoughts for $CHAD: \n\nAltria (Juul),\nYETI,\nAnheuser Busch (Beer),\nGNC,\nVF Corporation (Timbs) ,\nRalph Lauren, \nTAP (Beer)", "id": "edazey", "created_utc": 1576852608.0, "score": 848, "upvote_ratio": 0.99, "num_comments": 121, "comments": [{"body": "Just a heads up:\nYou have “Starbucks (SBX)” under $BECKY.\n\nTicker symbol is actually SBUX\n\n\nSBX = \n[SeaBird Exploration PLC](https://www.marketwatch.com/investing/stock/sbx?countrycode=no)", "score": 278, "replies": [{"body": "Women love marine oil exploration equipment", "score": 486, "replies": [{"body": "That's a funny way to describe a dildo", "score": 157, "replies": [{"body": "Oil => lube => dildo", "score": 43, "replies": [{"body": "That’s why women love Saudi’s princes.", "score": 30, "replies": [{"body": "I thought it was because they'd be beheaded if they didn't...", "score": 12, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}, {"body": "Someone give this man some gold", "score": 6, "replies": [{"body": "I wish i can use that gold to recover from my bad calls... Broken windows and expiration dates fml should have bought further out dates", "score": 2, "replies": []}]}]}, {"body": "So basic", "score": 7, "replies": []}, {"body": "Data doesn't lie.  Moving my free capital towards what the women love - oil equipment.", "score": 3, "replies": []}, {"body": "We goin' deep V diving.", "score": 2, "replies": []}]}]}, {"body": "$becky at 69? Buying calls with every dollar I have", "score": 208, "replies": [{"body": "So you're buying fractional shares? You really want to put both dollars?", "score": 80, "replies": [{"body": "Whats a fractional share?", "score": 3, "replies": [{"body": "Like when your mother charges $50 a night for sex but I only want to throw down $25 and I still get a handy", "score": 29, "replies": [{"body": "Nice.", "score": 3, "replies": [{"body": "The weird part is, I thought consciously to myself: ‘This is an old post and I’m typing this for no reason.. Not only will no one see this, no one will find it funny’\n\nand here we are 22 upvotes later", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I never trust an ETF padded with banks/credit cards.  Screw $TONKS.  Buying $BECKY.    \n    \nReal talk.  Quality stuff, you did some great work.  Would love to see Dividend calculations.", "score": 101, "replies": [{"body": "[deleted]", "score": 38, "replies": [{"body": "Also I’d leave Ulta in $BECKY", "score": 25, "replies": []}]}]}, {"body": "how did you get google sheets to update ticker for you automatically?", "score": 63, "replies": [{"body": "[deleted]", "score": 118, "replies": [{"body": "You know that Google Sheets has a formula built in to pull info from Google Finace right?\n\n=GOOGLEFINANCE(...)", "score": 87, "replies": [{"body": "[deleted]", "score": 119, "replies": []}, {"body": "Holy fuck. Thank you", "score": 15, "replies": []}]}, {"body": "what api are you using?", "score": 19, "replies": [{"body": "The first one.", "score": 41, "replies": []}]}, {"body": "I’m too autistic to understand anything of what you said. I only trust what daddy musk says.", "score": 17, "replies": []}, {"body": "Why not just make this a website..? I can throw one together in an hour if you'd like. Maybe just DM me some of the shit you used and I'll make it go.", "score": 14, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "Yeah, do it up. I took a look at the API and it only let's you make like 250 requests per day which is pretty not great if i want to actually use this as an app. Did you pay for the API?", "score": 11, "replies": []}]}]}, {"body": "U use IEX Cloud?", "score": 2, "replies": []}, {"body": "How long you give it until Google fucks with the API and you have to go back and fix your script?", "score": 2, "replies": []}, {"body": "Is Factset available as an option. I’m optimistic as fuck about their excel import function", "score": 1, "replies": []}, {"body": "This is fucking quality autism put to good use", "score": 1, "replies": []}, {"body": "Oh shit this works so much better than the built in formula", "score": 1, "replies": []}]}, {"body": "If you are too lazy to do that:\n\n`=GOOGLEFINANCE(\"SPY\", \"price\")`\n\nIts on a 15 min delay, but otherwise works well.", "score": 14, "replies": [{"body": "I stumbled on this and am trying to create my own tracker in Sheets. Works awesome for price but can't seem to get it to pull in P/E ratio, Div yield, etc.", "score": 5, "replies": []}]}]}, {"body": "So many people have tried this and bailed after a few months. Hopefully you can keep it up.\n\n[How the WSB Autism index's have changed over time](https://i.redd.it/udxd88gqgrp21.jpg)\n\n[Since y'all gonna sort by most popular anyway. Let this change your life](https://collective2.com/details/126434247)", "score": 57, "replies": [{"body": "hahaha this is the greatest thing i've ever seen", "score": 13, "replies": []}]}, {"body": "[deleted]", "score": 53, "replies": [{"body": "$BUD - Bud Lite  \n$GNC - Whey Protein", "score": 67, "replies": [{"body": "Tobacco. \nWeed. \nTrucks.... ford I guess? \n\nThe problem with ford is that while Chad drives a ford, it's a very boomer stock.", "score": 34, "replies": [{"body": "$GM. Chads drive Chevys.", "score": 32, "replies": [{"body": "Correct, Bretts drive $F", "score": 15, "replies": []}, {"body": "Tylers drive DODGE. Which is gay ass $FCAU.  \n\n\nFuck Tyler.", "score": 13, "replies": []}]}, {"body": "If only Patagonia would IPO. Grey Sweater Vests to the MOON", "score": 10, "replies": [{"body": "Could add $VFC to get North Face, Vans, and Timberland", "score": 3, "replies": [{"body": "None of those are chad", "score": 5, "replies": []}]}]}]}]}, {"body": "$WWE since you can’t buy shares of the Buffalo Bills.", "score": 26, "replies": [{"body": "Wwe is oddly fucking strong with all the competition that has established itself inn the last year. I'm probably going to get more soon tbh", "score": 7, "replies": [{"body": "They got a ton of Saudi money and nobody but wrestling nerds knows about the other federations whereas everyone knows WWE.", "score": 11, "replies": [{"body": "True one competing federations is owned by the son of the Jax jaguars owner and the other by Smashing pumpkins lead Billy corgan that is betting the whole model on you tube views.\n\nWrestling is weird man.", "score": 6, "replies": []}]}]}]}, {"body": "$DLA - Delta Apparel, parent company of Salt Life\n\nChad's totally got a Salt Life sticker on his lifted Chevy Sivarado\n\nIs there a stock for the company that makes truck nuts?", "score": 10, "replies": [{"body": ">Is there a stock for the company that makes truck nuts?\n\nYou wouldn't believe the weird history of the plastic balls that hang off of vehicles\n\nFrom El Wikipedia:\n\n> A number of people claim to have invented the truck nuts industry (i.e. plastic store-bought truck nuts). David Ham,[\\[3\\]](https://en.wikipedia.org/wiki/Truck_nuts#cite_note-vice-3) owner of YourNutz.com, said he saw a pair of custom truck nuts at a rally in the 1980s, then in 1996 began manufacturing and selling plastic truck nuts commercially. John D. Sallers, owner of BullsBalls.com, says he was out driving his 4x4 off-road when someone yelled: \"Go Ernie, show'em you got balls!\", which inspired the idea and he began selling them in 2002. The two men sold Truck Nuts through the late 1990s and 2000s, competing both in the market and in private, exchanging angry phone calls and emails. This conflict escalated into public relations wars, social media conflicts, posts on review sites, blog attack posts, and finally leading to legal [cease and desist](https://en.wikipedia.org/wiki/Cease_and_desist) orders.[\\[3\\]](https://en.wikipedia.org/wiki/Truck_nuts#cite_note-vice-3) [*Vice News*](https://en.wikipedia.org/wiki/Vice_News) wrote a story about the feud called \"Balls Out: The Weird Story of the Great Truck Nuts War\".[\\[3\\]](https://en.wikipedia.org/wiki/Truck_nuts#cite_note-vice-3)", "score": 15, "replies": [{"body": "God bless America.", "score": 12, "replies": []}, {"body": "Lol wtf, beautiful", "score": 3, "replies": []}, {"body": "The Dollop did a podcast about it... It's pretty fantastic", "score": 1, "replies": []}]}, {"body": "What about a stock for yeti coolers?", "score": 2, "replies": [{"body": "$YETI", "score": 1, "replies": [{"body": "Either in the frat or rich redneck etf.", "score": 1, "replies": []}]}]}]}, {"body": "$MNST - Monster", "score": 8, "replies": []}, {"body": "Also add $COLM - Columbia, Mountain Hardware, Sorel, Prana", "score": 3, "replies": []}, {"body": "After $CHAD we've got to have a the KYLE$", "score": 2, "replies": []}, {"body": "STZ, ronas and joints covered", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Using mod gayness as a benchmark, what is OP’s beta?", "score": 3, "replies": []}]}, {"body": "LVMUY needs to be in Becky. Sephora baby :)", "score": 16, "replies": [{"body": "LVMH just bought out Tiffany as well.", "score": 4, "replies": [{"body": "Oh I know. Saw my wife watching all the fashion YouTubes and bought it a few months back. :)", "score": 5, "replies": []}]}]}, {"body": "$TONKS near 420 and $BECKY at 69.  Nice.", "score": 28, "replies": []}, {"body": "First of all, great work OP. You are harnessing your autism well. But I don’t think google sheets is the right tool for this. This is the perfect application for a Python-based platform like Quantopian. IDK if you have any experience with it, but it is an incredibly powerful cross-sectional backtesting engine. In Quantopian, you create a “pipeline” where you define your universe of stocks to trade on. You can also add entry/exit rules rather than buying and holding - the $BECKY index seems quite resilient, so perhaps a rule that buys when any stocks  in it drop more than X% would be profitable. Lastly, Quantopian allows you to backtest the performance of your strategy, and it gives you metrics like the Sharpe ratio, max drawdown, etc. With these tools, we could scientifically test if white bitches outperform the market.", "score": 9, "replies": [{"body": "I messed with quantopian but couldn’t find out how to trade specific days, only weekly/daily and times of day. Can’t buy dips without scheduling it right. Definitely best to assign your stocks to list and trade using that though", "score": 5, "replies": [{"body": "I’ve got some experience making algos, I’ll have a go", "score": 2, "replies": [{"body": "I just need to find whatever parameter it is in quantopian that can specify the exact day. Schedule_function(), one parameter is trading frequency- didn’t find a parameter where I might input a list of dates. All in Python obviously", "score": 1, "replies": [{"body": "That stuff is done on the IDE side of things. That's where you input your start/end date", "score": 1, "replies": [{"body": "No I know that part, I’m referring to specific buys on specific days in that period. Like over a year, choose 5 specific dates - oct 5, nov 6, etc.", "score": 2, "replies": [{"body": "Oh okay gotcha. One solution I’m thinking of off the top of my head (definitely not the most efficient way to do it, but it will work for now lol) would be  to schedule your trade function with a for loop. Set i = to days and then calculate the day out of 365 for Oct 5, Nov 6, etc. Then have a nested if function that you only run when i == that number. I use this combo of a for loop/nested if to run my code at custom intervals (e.g. every hour instead of every min) so I can confirm it works", "score": 2, "replies": [{"body": "I’ll certainly test that out. Hadn’t found anything on YouTube or github thus far so thanks", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Doesn’t LVMUY:US belong in $BECKY??", "score": 9, "replies": []}, {"body": "You people are fucking retarded there have only ever been 5 FIVE true Becky stocks that will forever live in infamy they are as followed:\nLULU\nSBUX\nTGT \nETSY \nULTA\nanything else is sheer fads that fade and die don’t listen to anyone else I am right and you are all wrong don’t @ me", "score": 22, "replies": [{"body": "Etsy over peloton? Yikes", "score": 3, "replies": []}]}, {"body": "Someone get that ETF provider guy in here", "score": 3, "replies": []}, {"body": "Beyond Meet sounds like a dating site", "score": 10, "replies": []}, {"body": "Tome for somebody to make these into ETF’s like $SPY", "score": 9, "replies": [{"body": "This mf said \"Tome\"", "score": 16, "replies": [{"body": "Typos are so funny hahaahah.", "score": 9, "replies": []}]}]}, {"body": "u/elons_cybertruck you need to ad LVMH to the list (for those that can buy non US stocks no $becky is complete without it.", "score": 3, "replies": []}, {"body": "I feel like Ulta is a Karen stock not a Becky", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I vehemently disagree. Ulta should NOT be taken out.", "score": 2, "replies": []}]}]}]}, {"body": "There is no CHAD index.  \n\nCHAD puts his money in stonks.  \n\nThen he takes the earnings and splits it between his wife, his girlfriend, and sex tourism.\n\nHe buys shiny shit because women like that stuff.  But a real CHAD doesn't even need to show off because he knows that empty promises are cheaper and risk free", "score": 3, "replies": []}, {"body": "Could you put the S&P 500 in the doc so we could compare our $TONKS and $Beckys to it? I mean I could just google the  s&p myself but I feel like this doc should be the only thing I would ever need to look at to get rich.", "score": 2, "replies": []}, {"body": "This is cool man, I'm going to have to check out this API. Did you time your stock requests to reach the max # for a free account with worldtradingdata?", "score": 2, "replies": []}, {"body": "Where is $BECKY ETF??? Get on this!", "score": 4, "replies": []}, {"body": "whats the stonks index for? is it just some geniuses pick for up goes?", "score": 2, "replies": []}, {"body": "Peleton? They're going to tank after the holidays.", "score": 2, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "Show us your shares or calls or shut the fuck up", "score": -8, "replies": []}]}]}, {"body": "When's the first share being offered?", "score": 1, "replies": []}, {"body": "Using $69 to figure out the stock weighting. Nice.", "score": 1, "replies": []}, {"body": "This is excellent work", "score": 1, "replies": []}, {"body": "I'm selling puts, who wants some?", "score": 1, "replies": []}, {"body": "$Becky should possibly also track TenCent the owner of TikTok (which is now the largest social media app) it's also owns several big Chinese becky apps like wechat, and recently partnered with Burberry to push retail in these apps.", "score": 1, "replies": []}, {"body": "What about $ETSY, $LB and $ELF.", "score": 1, "replies": []}, {"body": "It might be a cool idea to write a script that auto balances your portfolio every day/week/month to get the correct allotment. Probably possible with the Robinhood Typescript API one of the users wrote up and posted here a few weeks back. I might try and do that.", "score": 1, "replies": []}, {"body": "$LB needs to be in $BECKY", "score": 1, "replies": []}, {"body": "That $TONKs basket is fire", "score": 1, "replies": []}, {"body": "Can you overlay the S&P500 to see how they compare to its movements?", "score": 1, "replies": []}, {"body": "I’m surprised at never seeing Steve Madden (SHOO) added to $BECKY ETF.", "score": 1, "replies": []}, {"body": "PTON is in both btw", "score": 1, "replies": []}, {"body": "Someone tell me why we refer to these as Becky and stinks, and don’t say to look at the holdings.", "score": 1, "replies": []}, {"body": "That AMD weighting tho", "score": 1, "replies": []}, {"body": "$TONER plz", "score": 1, "replies": []}, {"body": "blessed BECKY", "score": 1, "replies": []}, {"body": "lmao what", "score": 1, "replies": []}, {"body": "Is broken plz fix", "score": 1, "replies": []}, {"body": "Perfect! I will wait for RH's fractional trading to be available and then its only $TONKS and $BECKY every paycheck.", "score": 1, "replies": []}, {"body": "Boy I have no clue how to use Excel beyond basic operations, can you possibly add 3/6mo anf 1 year returns in the history tab?", "score": 1, "replies": []}, {"body": "Idk bro Matt McConaughey is telling $Becky to stay inside and $Becky listens to screens with ads.", "score": 1, "replies": []}, {"body": "Is there any way doing something like this in excel or does it have to be done through google spreadsheets?", "score": 1, "replies": [{"body": "They're computers. They do what you tell them to do.", "score": 16, "replies": []}, {"body": "Easier to do in excel, google sheets is trash.", "score": 0, "replies": []}]}, {"body": "All Beckys use amazon. Might want to add that.", "score": 1, "replies": []}]}
{"title": "Boeing Starliner Fails, Can't reach ISS.", "selftext": "", "id": "edbhjq", "created_utc": 1576855089.0, "score": 145, "upvote_ratio": 0.98, "num_comments": 99, "comments": [{"body": "And Boeing gets paid 50% more than SpaceX for the same flights why?", "score": 196, "replies": [{"body": "Better lobbyists", "score": 146, "replies": [{"body": "Pay a few senators and congressmen in government 100k... gets multi billion dollar contract. Sounds like Risk free money for Boeing.", "score": 51, "replies": []}]}, {"body": "Boeing has basically been a federally propped up boomer retirement program for a while.", "score": 198, "replies": [{"body": "And like their boomer shareholders it's no surprise that Boeing has trouble getting it up", "score": 44, "replies": []}, {"body": "You are now banned from /r/investing.", "score": 80, "replies": [{"body": "You are now a mod of r/wallstreetbets", "score": 62, "replies": [{"body": "You are now a gay virgin", "score": 4, "replies": [{"body": "But the good news is, you can fix that problem within 1 hour on grindr", "score": 8, "replies": []}]}]}, {"body": "LOL, don't joke I just got banned from there for saying...\n\n\"Shush with your logic\"\n\nAs a reply to a comment.", "score": 3, "replies": []}]}]}, {"body": "Because the system is corrupt.", "score": 31, "replies": [{"body": "👆", "score": 9, "replies": []}]}, {"body": "All the senators own Boeing stock", "score": 26, "replies": [{"body": "And Boeing owns the senators.", "score": 24, "replies": [{"body": "And Boeing employs voters who live in the Senator's districts", "score": 1, "replies": []}]}]}, {"body": "MiC. They are “making more jobs”", "score": 4, "replies": []}, {"body": "There’s something to be said for having multiple contractors doing space related work. I don’t know that it’s worth a 50% premium, but it’s worth something.", "score": 4, "replies": []}, {"body": "Because they hired Boeing to ensure they maintained schedule. Think about that.", "score": 1, "replies": []}, {"body": "Boeing identities as male.", "score": 1, "replies": []}]}, {"body": "Well, at least this Boeing failure hasn't killed anyone.", "score": 80, "replies": [{"body": "...yet", "score": 66, "replies": []}, {"body": "I like the report that said if it had people inside they would have fixed it.", "score": 28, "replies": [{"body": "This particular problem most likely would’ve been addressable by passengers.", "score": 5, "replies": [{"body": "Also this particular problem isn't deadly to passengers. It's just that the capsule can't reach the ISS and is going to have to deorbit early. But that just means mission failure, all people involved would be fine", "score": 5, "replies": []}]}, {"body": "Especially since the 737 Max demonstrated the opposite, twice.", "score": 4, "replies": []}]}, {"body": "They stated that had a crew been on the ship, they could have been able to change the orbit to get the Starliner to the station. To me this seems like its actually more successful so far than SpaceX's test of their manned Dragon2, which exploded during a static engine test fire. At least with the Boeing test, the general hardware seems to be operational with just some software bugs to work out.", "score": -5, "replies": [{"body": "> its actually more successful so far than SpaceX's test of their manned Dragon2, which exploded during a static engine test fire.\n\nThat was a stress test ya dummy.  They blow all kinds of shit up to find the limits of their products.  Now if Boeing cared half as much about safety as SpaceX their stupid-as-fuck MCAS system wouldn't have killed 350+ people.", "score": 27, "replies": [{"body": "It’s a good thing Boeing space and commercial aviation are separate.", "score": -9, "replies": []}]}]}]}, {"body": "Lol what a bunch of chodes, can’t believe the fed keeps this POS company propped up. Fire all the leadership team and put Sue Bae in charge.", "score": 37, "replies": [{"body": "Put Su Bae in charge of everything", "score": 19, "replies": [{"body": "Not even a joke, she would restructure and simplify just like AMD, Sue BAe would have BA at $420 by 2021", "score": 12, "replies": [{"body": "Sue would have no idea how to run a government contractor lmao. It’s totally different from a traditional business.", "score": 6, "replies": [{"body": "How so?", "score": 2, "replies": [{"body": "The way they generate revenue is totally different.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "More like sucking from the government teat.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "She's not eligible for President :(", "score": 2, "replies": [{"body": "No, we need Sue Bae to keep focusing on killing Intel", "score": 4, "replies": []}]}]}]}, {"body": "Happens to every guy once in awhile", "score": 55, "replies": [{"body": "Long $PFE?", "score": 8, "replies": [{"body": "I don’t think medicine for making it bigger exists yet", "score": 8, "replies": []}]}]}, {"body": "All hail Elon!", "score": 17, "replies": []}, {"body": "wrong orbit..... That is terrible. Actually orbits are very complicated matter.", "score": 32, "replies": [{"body": "They're just circles. How hard can that really be?", "score": 45, "replies": [{"body": "It worked in Kerbal Space Program.", "score": 46, "replies": []}, {"body": "Orbits are all sorts of conic sections, not just circles. 🙂", "score": 7, "replies": [{"body": "Lol gravity is an 1/r^2 potential. You can't have an orbit this looks like a cone 😕", "score": -6, "replies": [{"body": "Conic sections do not look like cones...", "score": 9, "replies": [{"body": "Kind of a bit of a misnomer then if what your saying is true", "score": -2, "replies": [{"body": "Not in the slightest. Go look up conic sections and you'll see why they are so called.", "score": 5, "replies": []}]}]}]}]}, {"body": "Orbit mechanics is very mathematical. Wrong entry point or angle louses up. No GPS in outer space.", "score": 12, "replies": [{"body": "GPS does in fact work quite well in low Earth orbit.", "score": 6, "replies": [{"body": "Ya idk what this guy is going on about. GPS is used in all small and cube sats at least. Otherwise you're generating TLEs from cspoc", "score": 5, "replies": []}]}, {"body": "Or just use visual sensors based from the stars - worked pretty good before...", "score": 1, "replies": []}, {"body": "? The GPS satellites are already in space. If anything they should have a stronger signal = better navigation", "score": 1, "replies": [{"body": "I mean if you're on the moon, using GPS is pretty useless. It's a system designed for navigating on the earth's surface, not in space.", "score": 2, "replies": [{"body": "We don't even have color photographs of the moon , of course GPS isn't going to work there.", "score": 0, "replies": [{"body": "bruh, of course we have color photographs of the moon. Take your smartphone, go outside at night, and point it at the sky.", "score": 5, "replies": [{"body": "I can't. It's daytime", "score": 4, "replies": [{"body": "you can 100% see the moon during the day. What are you, a flat-earther?", "score": 2, "replies": [{"body": "You're probably thinking of the sun which is awake during the day", "score": 5, "replies": []}]}]}]}]}]}]}]}]}, {"body": "We did that shit 60 years ago with garbage computers. Feel like we could do that math today", "score": 23, "replies": [{"body": "It wasn't even bad math - they forgot to sync up the clock on the capsule with the booster (seriously)", "score": 30, "replies": [{"body": "20 years ago, a Mars probe crashed cause they forgot to convert to metric. Dumb fuckups and space happen somewhat frequently.  \n\n\n [https://www.latimes.com/archives/la-xpm-1999-oct-01-mn-17288-story.html](https://www.latimes.com/archives/la-xpm-1999-oct-01-mn-17288-story.html)", "score": 16, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "You're about 18 years too late on the \"being the first space tourist bit\" but yeah, there's really no way to test spacecraft except by sending it. At least they always start with unmanned flights. Or dogs/chimpanzees if we're in the 1950s.", "score": 9, "replies": [{"body": "yeah, the russians were selling flights for awhile, right?", "score": 1, "replies": [{"body": "Yup. In the late-90s, broke-ass Russia launched a venture to try to get some private money to support its Soviet-era space station. NASA got really butthurt about the whole thing cause that was during/after the whole Serbia/Kosovo thing.\n\n[https://en.wikipedia.org/wiki/MirCorp](https://en.wikipedia.org/wiki/MirCorp)", "score": 5, "replies": []}]}]}, {"body": "This was a test under real conditions.", "score": 1, "replies": []}]}, {"body": "Ah shit that was 20 years ago? Feels like yesterday", "score": 1, "replies": []}]}, {"body": "> Just use NTP, wcgw\n\nThese people, probably", "score": 8, "replies": []}]}, {"body": "That was a team lead by the best and brightest not moron managers from GE and McDonnell Douglas", "score": 9, "replies": [{"body": "lead led read red", "score": 1, "replies": []}]}]}]}, {"body": "\"Scotty, we need more power.\"", "score": 14, "replies": []}, {"body": "BA has one job, that's putting things at the right altitude. They have twice, through systematic means, failed to maintain altitude.\n\nLook for BA stock to follow suit.", "score": 37, "replies": [{"body": "No long Boeing. Failure means more money for “ research” is need. Time to go over budget like the f35", "score": 8, "replies": []}, {"body": "BA is like Ford GM and all those other boomer companies who are backed by the governement and so their stocks never dips as it should", "score": 9, "replies": [{"body": "I actually wasn't familiar with their valuation before today. Looks expensive! I need to figure out how much they're losing from nobody buying 737 Maxs anymore, I'd be surprised if government contracts can paper over that hole.", "score": 1, "replies": []}]}]}, {"body": "I thought they'd fired the MCAS programmers.", "score": 9, "replies": []}, {"body": "They got rid of the Space Shuttle for this failure?", "score": 12, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "... You have to be fucking kidding me. My dumb ass cousins know to sync their watches before they try some fly by night robbery. A billion dollar company couldn't manage that?", "score": 4, "replies": []}]}]}, {"body": "Dumb question: why is boeing still trading so high? I figured the max production halt would tank them but still $328 as of today...", "score": 4, "replies": [{"body": "Bro the stock rose when they announced their plans at postponing max production, no one knows what's going on", "score": 3, "replies": [{"body": "We were joking today that after watching the first half of the week, we were going to start a company that crashes planes then quits making them.  After today, we added ships to our portfolio of hardware to bang together (yes, I know the crash was slight and Carnival nailed earnings...it’s a joke).  Great to find a business plan that cannot go tits up finally!", "score": 2, "replies": [{"body": "ROI to PRT?", "score": 1, "replies": [{"body": "Honestly, the business plan right now is just a crudely drawn picture of a plane hitting a boat with “bang lines” and dollar signs coming out...", "score": 1, "replies": []}]}]}]}]}, {"body": "more BA to order haha", "score": 2, "replies": []}, {"body": "The only thing Boeing failed at today, was parking that in Airbus' ass.", "score": 2, "replies": []}, {"body": "\"if its a boeing, i ain't going\"", "score": 2, "replies": []}, {"body": "pRiCeD In", "score": 2, "replies": []}, {"body": "Oof", "score": 1, "replies": []}, {"body": "It went tits up?", "score": 1, "replies": []}, {"body": "Incompetence.", "score": 1, "replies": [{"body": "Or is it a deep play to down the stock for a few months then maybe like a successful flight and boom money, who knows I don't know but I know where I'm putting my money. Space thats where.", "score": 2, "replies": [{"body": "Yeah. The Space industry provides likely solutions for many issues involving either scarcity of resources or just limitations on maximum performance.", "score": 3, "replies": []}]}]}, {"body": "Boeing's just falling apart... Like their planes", "score": 1, "replies": []}, {"body": "Fat bitch couldn't even jump high enough", "score": 1, "replies": []}, {"body": "This is the best tl;dr I could make, [original](https://www.cnbc.com/2019/12/20/boeings-starliner-flies-into-wrong-orbit-jeopardizing-trip-to-the-international-space-station.html) reduced by 75%. (I'm a bot)\n*****\n> &quot;The Boeing Starliner space vehicle experienced an off nominal insertion. The spacecraft currently is in safe and stable configuration. Flight controllers have completed a successful initial burn and are assessing next steps. Boeing and NASA are working together to review options for the test and mission opportunities available while the Starliner remains in orbit,&quot; a Boeing spokesperson said.\n\n> In 2014, NASA awarded development contracts for the Commercial Crew program to SpaceX for up to $2.6 billion and Boeing for up to $4.2 billion.\n\n> Future Commercial Crew contracts would be up for grabs, as NASA would look to buy seats on Boeing&#039;s Starliner capsule and SpaceX&#039;s Crew Dragon.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/edllj7/boeings_starliner_spacecraft_fails_key_nasa/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~451145 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Boeing**^#1 **NASA**^#2 **Starliner**^#3 **Space**^#4 **spacecraft**^#5", "score": 1, "replies": []}, {"body": "Short this stock\n\n\nStinker", "score": 1, "replies": []}]}
{"title": "Can we fight a recession by pretending it doesn't exist?", "selftext": "Posting from an alt because this might be a nuclear tier stupid question but if we just invest like normal then how can there be a recession? And if we don't invest like normal, aren't we helping to create the recession?\n\nThanks", "id": "edds29", "created_utc": 1576865680.0, "score": 295, "upvote_ratio": 0.96, "num_comments": 92, "comments": [{"body": "[deleted]", "score": 334, "replies": [{"body": "Can someone make this man a hedge fund manager?", "score": 126, "replies": [{"body": "I've seen hedge funds bloom from equally as retarded theses.", "score": 15, "replies": [{"body": "can you give some examples", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "that's the opposite, but yeah rip lol", "score": 1, "replies": []}]}]}]}, {"body": "I say Chairman of the Fed!", "score": 3, "replies": []}]}, {"body": "The true recession has been the friends we made along the way", "score": 86, "replies": [{"body": "The true friend has been the recessions we made along the way", "score": 24, "replies": []}, {"body": "God damnit, I literally came here to say this, fuck you man.", "score": 10, "replies": []}]}, {"body": "( ͡° ͜ʖ ͡°)\n\nI've been hiding it in my ass all this time!", "score": 26, "replies": []}, {"body": "If it was inside me, it's in the toilet now", "score": 7, "replies": []}, {"body": "Cant have a recession without a depression!", "score": 7, "replies": []}, {"body": "That's pretty gay... bear gang gay confirmed", "score": 4, "replies": []}, {"body": "The real recession was the people you made rich along the way.", "score": 2, "replies": []}, {"body": "This sub is just a pile of recessive genes.", "score": 2, "replies": []}]}, {"body": "Yes, the Fed can print enough money to keep the stock markets at ATH until the dollar is worthless and your salary needs to doubled every day to keep up with the cost of living.", "score": 133, "replies": [{"body": "\"Saving money is for pussies.\"  \n\n- The last 5 Fed Chairpeople", "score": 92, "replies": [{"body": "It's a little less about saving money since you can just print more, rather maintaining it's value.", "score": 0, "replies": [{"body": "That's kind of the point, by printing more money you devalue currency and fuck over savers", "score": 15, "replies": [{"body": "Fuck savers. Keep money moving", "score": 19, "replies": []}, {"body": "... But deflation helps the savers at a certain point and seriously fucks everyone else, eventually the savers too. Velocity of money ftw", "score": 0, "replies": [{"body": "Can’t wait for Tesla Roadster 2.0 velocity of money", "score": 1, "replies": []}]}]}]}]}, {"body": "So you're saying it's possible? New Fed chair right here guys", "score": 4, "replies": [{"body": "\"It's not QE\" as inflation reaches 1000%", "score": 5, "replies": []}]}]}, {"body": "Recession is priced in.", "score": 189, "replies": [{"body": "Recovery from the recession is priced in", "score": 57, "replies": []}, {"body": "The only responsible answer.", "score": 14, "replies": []}]}, {"body": "Who is we? The trillions of dollars of managed money or the Robinhood autists?", "score": 53, "replies": [{"body": "We are the economy!!!", "score": 24, "replies": [{"body": "By the power bestowed on us by Robinhood, we can print our own money!", "score": 7, "replies": []}]}]}, {"body": "Yes. Deplete your savings to buy more shares to create demand to prop up the stonks you already own.", "score": 41, "replies": [{"body": "The stocks I already own are my savings. I have confidence in the economy", "score": 48, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Chart moving right to left? Well fuck we found the next einstein", "score": 8, "replies": []}]}, {"body": "Every is confident guys this literally can't go tits up. PermaBull for life.", "score": 2, "replies": [{"body": "does not compute", "score": 2, "replies": []}]}]}]}, {"body": "\"Recession\" does not mean \"Market dropping\"\n\nThe market can go up and we can still have massive inflation and sections of the economy crumbling. The market tanking is just a side-effect after the economy fails. Your intent to keep investing wouldn't have stopped the subprime mortgage crisis from happening.", "score": 29, "replies": [{"body": "So you're saying I should dump all my money into mortgaged backed securities?? Lightning can't strike the same place twice!", "score": 21, "replies": [{"body": "Not true. Have you ever heard of a lightning rod?\n\nIn either case, you can keep investing however you want. If you want more security, then go for low volatility. If you want to gamble, then go for high volatility. There's no wrong answer unless you lose.\n\nIf you do want to exit the market because it's insane, but you don't know what to do with the pile of cash you've been playing with, you might as well buy property and get an actual mortgage while interest rates are low.", "score": 7, "replies": [{"body": "If I want more security, then go for low volatility? Miss me with that gay shit.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "Virtues cycle as long as Becky keeps buying on dadys credit card and dad keeps working an industry propped up by this consumption thus keeps paying the minuim on the card then the economy keeps going. The fincail Times ran a article pointing out that the difference between the high consumer confidence and the low purchasing managers index and low ceo confidence. \n\n08 was the bigest correction ever to fix the fucked market from the 1980s the medicine didn't taste nice so instead us EU and Japan decided to freebase our savings and let us keep parting like it's still the regan years", "score": 9, "replies": [{"body": "So what you are saying is that the bull market is guaranteed until \\~2048?", "score": 3, "replies": []}]}, {"body": "It happens because people leverage to the tits and can’t pay back. In life and market", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "But it’s because they can’t spend, not because they won’t. No leverage and assets fucked by margin calls", "score": 5, "replies": []}]}]}]}, {"body": "There was a recession in 1990 and the stock market didn’t crash. In fact, from the time the yield curve inverted in 89, the stock market actually increased as the recession hit. \n\nCould happen again.", "score": 10, "replies": []}, {"body": "We poor retail traders really don't have any significant impact on the markets. \n\nThe 2008 recession should've been worse but the Fed stepped in and forced it to go up. They're doing the same thing right now. They have **unlimited** money. Even if everyone on this sub and /investing dump everything they have, it wouldn't make a dent in the market because again, they have unlimited money.", "score": 18, "replies": [{"body": "They have unlimited money? Must have a RH gold account.", "score": 36, "replies": [{"body": "When you can create money out of thin air, yeah, it's unlimited.", "score": 6, "replies": []}]}, {"body": ">We poor retail traders really don't have any significant impact on the markets. \n>\n>The 2008 recession should've been worse but the Fed stepped in and forced it to go up. They're doing the same thing right now. They have **unlimited** money. Even if everyone on this sub and /investing dump everything they have, it wouldn't make a dent in the market because again, they have unlimited money.\n\nThe Fed does not have unlimited money ffs. Do you not know how to read M statements?", "score": 2, "replies": [{"body": "Right, and what's to stop them from just creating more money again?", "score": 2, "replies": [{"body": "... They don't make money? They control the rate and cost of possible money creation between banks. It's up to the market how each institution what it wants to grant to that limit.", "score": 2, "replies": [{"body": "As if the banks aren't going to sell however much securities the Fed wants to buy. Banks aren't going to say no to money. Do you think they haven't been \"creating\" money all this time or something?", "score": 3, "replies": []}, {"body": "People literally don’t understand how money is created, it’s tied to credit, fed made credit cheap at the cost of future growth, that is literally all they did, they don’t “print” money or there would be hyperinflation in Japan instead of 0% inflation for 30 years. It’s insane how dumb people are", "score": 1, "replies": []}]}]}]}]}, {"body": "I heard a thing on the radio that said we don't have much inflation because people don't believe it's happening, so I'm pretty sure the same effect applies to recessions", "score": 7, "replies": []}, {"body": "What recession, dummy? You've all been cheering one on since April and it has yet to materialize. Stop getting your financial advice from Nancy Pelosi.", "score": 13, "replies": []}, {"body": "There is a recession when you have 2 straight quarters of negative GDP growth. GDP and stonk prices are not the same thing.", "score": 3, "replies": []}, {"body": "Go search for one of [the 2008 crash threads](https://www.bogleheads.org/forum/viewtopic.php?t=25126) on Bogleheads. These are some of the most level headed investors out there and you can watch as they crack under the pressure of week after week of losses. Their motto is stay the course, no one knows nothin and they couldn’t even pretend.", "score": 3, "replies": [{"body": "Just imagine all the weak hands in personal finance and investing. They’ll all panic sell once shit starts to look bad. Luckily they’re all poors so they don’t have much to sell.", "score": 1, "replies": []}]}, {"body": "Theoretically, yes. You could argue that’s what has been happening now. Spending needs to happen to stimulate the economy. The first part of the decade was driven by innovation, the latter part has been by financial engineering and manipulation such as keeping the interest rates at an all time low. Unfortunately, this isn’t sustainable and I believe within the next 2-3 years we’re going to have a massive meltdown known as the corporate and consumer debt bubble.", "score": 3, "replies": []}, {"body": "I mean if all the bitch ass investors all in every time a dip happens there wouldn't be a recession no?", "score": 2, "replies": []}, {"body": "Why not act like there is a recession and buy puts?", "score": 2, "replies": []}, {"body": "Recessions priced in", "score": 2, "replies": []}, {"body": "Its not about the recession, but the stocks you short along the way", "score": 2, "replies": []}, {"body": "A recession is defined in the US as many months of economic contraction across multiple sectors for an extended period of time. \n\nThere have been 12 recessionary periods since 1945. Average stock market return during those 12 periods: +3.8%. \n\nEconomic recession necessary mean a recession level drop in the stock markets (defined as 20% or more from the high). When most people think recession they think crash. A recession could simply be GDP shrinking by .01% for several quarters in a row. \n\nRemember, recessions are healthy and bring balance. They are not the same as crashes.", "score": 2, "replies": []}, {"body": "Yes but you can't be leveraged or hold calls", "score": 1, "replies": []}, {"body": "what do you think trump has been doing by cutting rates?", "score": 1, "replies": [{"body": "The President doesn’t cut rates. The Fed does.", "score": 5, "replies": [{"body": "How do I government?", "score": 2, "replies": []}, {"body": "oh you sweet, summer child.", "score": -1, "replies": []}]}]}, {"body": "A recession is essentially just super freaked out investors so they pull out of everything", "score": 1, "replies": [{"body": "I think you are conflating a recession with a market crash.", "score": 1, "replies": [{"body": "There pretty similiar events that are made much worse by people over reacting", "score": 1, "replies": []}]}]}, {"body": "I pretend like I have unlimited money and spend it ... unfortunately my banks do not want to play along with me", "score": 1, "replies": [{"body": "If you owe the bank $1M, you have a problem.\n\nIf you owe the bank $1T, the bank has a problem.", "score": 6, "replies": []}]}, {"body": "What is a recession?  I thought Stonks only go up?", "score": 1, "replies": []}, {"body": "Shhh, you're waking up the bears.", "score": 1, "replies": []}, {"body": "Market makers hate him !", "score": 1, "replies": []}, {"body": "Your question goes back to the question of why boom-bust cycles actually exist (mismatch between production and demand due to information lag), and if they are even real anymore (probably not).", "score": 1, "replies": []}, {"body": "If we know there’s a recession does that mean it’s already priced in?", "score": 1, "replies": []}, {"body": "Recessions are kind of like the boogyman if I can't see them then they aren't there", "score": 1, "replies": []}, {"body": "GUH.", "score": 1, "replies": []}, {"body": "Yeah man\nWhat ever the mind can conceive the mind can achieve", "score": 1, "replies": []}, {"body": "Gonna inverse this and pretend we are in a recession right now.", "score": 1, "replies": []}, {"body": "It's been working fine for the past decade.", "score": 1, "replies": []}, {"body": "Nah dude, you just delete the app.\n\nRookie question SMH....", "score": 1, "replies": []}, {"body": "The recession has already been priced in", "score": 1, "replies": []}, {"body": "Carfeful OP, the next time you drive your car the brakes might just all of a sudden stop working.", "score": 1, "replies": []}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "There’s a quote by Benjamin Graham that’s like,\nIn the short term the market is a voting machine, tallying which stocks are popular, and in the long term the market is a weighing machine, weighing profits of the company.\n\nIf there’s a recession there’s less profit. If there’s less profit, the asset has less real value. Eventually (decades) most companies will fold and they’ll lose all of their value. You extract the profit through dividends or selling stocks. The only way that this idea could work is that everyone in the market agrees to ignore the risk that their stocks are all making them less money and will potentially lose them all of their money and continue to invest as if that weren’t happening. \n\nAlso it’ll be hard for people to keep investing the same if they’re losing their jobs or are over leveraged when credit starts tightening.", "score": 1, "replies": []}, {"body": "what do you think we just did? Solved the good easy trade war", "score": 1, "replies": []}, {"body": "If people just throw money at companies, theres no way a recession can happen.", "score": 1, "replies": []}, {"body": "I thought recessions were caused by people not paying back loans and the banks jacking up interest rates as a result?", "score": 0, "replies": []}, {"body": "that is the case now\n\nAnd people don’t even notice that", "score": 0, "replies": []}, {"body": "It is exactly what we does", "score": 0, "replies": []}]}
{"title": "🐌 living that theta life, one week at a time", "selftext": "Another $4k this week of EZ money.\n\nSold weekly puts on $PTON @29, $MSFT @155.\n\nToday was a bit of a clencher watching $PTON drop so fast and hard, but I’m glad I didn’t bail on the last $500 of premium (damn $0.05 bid increments! Else I would have bought back at $0.01 and found another play this morning).\n\nYou’re all winners to me, especially you losers.\n\nhttps://i.imgur.com/CbtdOP3.jpg\n\nLet me hear you say *theta! Theta! THETA!*", "id": "edgfmp", "created_utc": 1576877657.0, "score": 88, "upvote_ratio": 0.89, "num_comments": 114, "comments": [{"body": "You're going to get fucked. But not for reasons you think.\n\nTheta gang is 100% viable. I am exclusively theta gang. \n\nYou sold naked positions on underlyings that both have an implied volatility rank of zero, with the VIX hovering at 12.\n\nYou sold weeklies.\n\nYou held to expiration. \n\nMathematically, you will get fucked. I strongly suggest you continue learning before selling more premium. These trades are going to wreck you. \n\nThe overall strategy does work, but not like this.", "score": 184, "replies": [{"body": "Don't listen to Debbie Downer cumflakes. As long as the price doesn't violate your shorts, you are winner winner chicken dinner, but yea sell stuff with higher IV is a better way to go... I sell weeklys and let go to exp every week and have been doing it for a long time. exp is the goal whenever possible. You just need to be able to stay on top of your trades to be successful... Make sure you know when and how to roll..", "score": 57, "replies": [{"body": "cumflakes are my fav, my daddy makes me his own special kind every day", "score": 4, "replies": []}, {"body": "How much % per year can you reliably make selling options? Unlike buying options, I know its capped because theres limited upside and theres a lot more waiting (hold til expiration).", "score": 2, "replies": [{"body": "Going of my account -30%", "score": 13, "replies": []}, {"body": "Past performance has no indication of future performance, of course, but I’m up almost 60% since Sept. in the account I use to exclusively sell options ($40k to $63k), and that’s after commissions)\n\nSome of that was only achieved because of using another account as collateral, but over the same period that account went from $35k to 70k.\n\nSo **¯\\_(ツ)_/¯ **\n\n(The real kicker is that if I’d just left shit alone in that other account it would be at nearly $180k, letting my otm AAPL calls go further ITM, but when you’re looking at 50-100% gains in a few weeks you often take what you can get.)", "score": 5, "replies": [{"body": "Hell yeah man, and you exclusively sell OTM weeklies?", "score": 2, "replies": [{"body": "In this account, yes.\n\nI’ve bought a spread once which ended in a small loss, but otherwise OTM puts (except for a duck up last week where I sold ATM calls but held too long and ended up buying back at a big loss).", "score": 2, "replies": []}]}]}, {"body": "Varies. Each trader has different levels of experience, trading styles and objectives. I personally think shooting to beat the S&P is a good and achievable goal. My portfolio is beating the S&P by a wide margin. Not sure what you mean by hold times. I sell 0DTE spreads on the SPX, NDX and RUT all the time. That is holding until market close. Weelkys can be traded every week. Selling makes time/theta your bitch unlike buying where it is your worst enemy. Plus when selling, you profit from 3 directions if selling OTM and 2 directions if selling ATM. Buying, you only profit from one direction. Many other factors as well that IMHO makes selling my preferred method of trading. BUT, there is a time to buy too.", "score": 3, "replies": [{"body": "Why sell 3 different tickers that are so highly correlated?  Just stick to SPX.  Better liquidity any way.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I can't answer your question because I don't know the details. I've never seen SPX with a 0 open interest.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nothing wrong with it if these are cash secured. Otherwise he might need to look into Chapter 7 if it goes south.", "score": 14, "replies": []}, {"body": "Listen to u/1sildurr he made very good points. This sub thinks just being theta gang is smart. Without proper risk management we are all just playing even if it means theta gang.", "score": 8, "replies": [{"body": "Just sell several hundred naked puts per week.", "score": 1, "replies": []}]}, {"body": ">You sold weeklies.  \n>  \n>You held to expiration.  \n>  \n>Mathematically, you will get fucked.\n\nPardon my retardation, isn't this when theta is highest? Isn't that why buying FDs is considered a trash strat?", "score": 12, "replies": [{"body": "For the seller in this situation I believe the phrase is \"picking up pennies in front of a steam roller\"", "score": 46, "replies": []}, {"body": "Think of it like the force, yeah? It's in balance. The light side and the dark side.\n\nSure, the theta decay is steepest during the last week. The gamma risk is also the highest. Everything in balance. The research shows that the risk in selling weeklies outweighs the premium, even with high IVR underlyings.", "score": 10, "replies": [{"body": "Well then the inverse must be true.  \n\nFDs are the mathematically superior strategy.  Funding confirmed", "score": 22, "replies": [{"body": "Hey CNBC, fuck you we got some thinkers in here 👆🏼", "score": 6, "replies": []}, {"body": "This explains why everyone here buys zero days or weekly FDs!!", "score": 3, "replies": []}]}, {"body": "\n\nwhere is the science for this i'm interest", "score": 3, "replies": [{"body": "Tastytrade", "score": 2, "replies": []}]}, {"body": ">The research shows that the risk in selling weeklies outweighs the premium\n\nCitation needed", "score": 3, "replies": [{"body": "Google ''weekly options'' and ''tastytrade.''", "score": 3, "replies": []}]}]}, {"body": "Inverse yourself, my little autist. Or say theta decay, instead.", "score": 1, "replies": []}]}, {"body": "I mean it seems like he was watching closely but yeah.  JUST KEEP YOUR BUTTHOLE TIGHT BUDDY GET THAT 100%!", "score": 5, "replies": []}, {"body": "Mfw OP eventually gets assigned over a million dollars in Microsoft because he keeps scaling the position out because it's \"free money\"\n\nBuT aTLeAsT I mAdE $1000 🤷‍♂️", "score": 3, "replies": [{"body": "He was only controlling 10,000 shares here. MSFT isn't going to zero in a week. Even on a $10 pullback, OP didn't mind owning the shares, would only be down $10,000 and already said he'd run the wheel (which means he would immediately sell calls against his shares to start decreasing the cost basis and lowering his initial loss).\n\nSo OP wasn't doing anything as crazy as I thought because he had the cash to cover.\n\nSure, if MSFT released an article that they were involved in some massive accounting scandal and lost $50 overnight, it wouldn't be a fun morning for OP, but he understood that risk.", "score": 6, "replies": [{"body": "Well he'd still have to buy thousands shares at $155 each, which is what I was referring to. It's cool if you have the collateral, but if he's running naked on not cash secured puts then he's gonna get fucked. It won't be as bad for like MSFT because he can sell at open to close his outstanding margin, but doing it for a shittier meme stock (PTON) he might run into some more issues should the stock go further negative at open.", "score": 5, "replies": []}]}]}, {"body": "the IV rank is 0 because theyve expired.  retard\n\nhow can buying weeklies be bad advice and also selling weeklies be bad advice.\n\nhow can holding short term options to expiration be bad and also selling short term options to expiration also be bad.\n\nmathematically the comment is retarded as shit.", "score": 7, "replies": [{"body": "Selling weeklies is fine if you accept the gamma risk. Most premium sellers don't want the exponentially increasing gamma risk as expiration draws near. It's a good way to get fucked and take a huge chunk out of your profits (if not take you out of the game entirely)\n\nI don't know what to tell you about MSFT. The implied volatility is currently 16.7 and the implied volatility rank is 0.2.", "score": 3, "replies": [{"body": "Iv rank measures the difference between current vol and average vol.  An iv rank of 0 on pton doesn't mean that its got low iv or evening lowering iv.  It means it has average iv you sentient brick.  Just look at the chart of pton and tell me if thats a low vol stock?  Just look at the breakeven moves on the options for 1 second.\n\nVix being high or low doesn't mean anything for pton because its not in spx you mongoloid.\n\nVix and msft vol are gonna have strict correlation but because of dealer hedging you arent taking a bigger or lower risk.  Spx is basically unable to rip 100 points when vix is at 12 because of the hedging that must happen as it moves.  Your risk with a huge part of spx like msft is basically perfectly modelled by vix because one cant move without the other.\n\nAnd unless it goes ex div the assignment risk is basically 0 because options, especially weeklies always have extrinsic value.  He can just roll.", "score": 0, "replies": [{"body": "Listen you muppet, your first paragraph: that is not how IVR is calculated, and I did not say or imply that an IVR of zero means the underlying's volatility is low. Great job on the strawman.\n\nI also didn't say the VIX had anything to do with PTON. At all. My VIX statement was its own standalone paragraph and referred to low market volatility. Additionally, PTON has an IVR of zero because there isn't a year of data for it yet (this relates to your misunderstanding of how IVR is calculated.)\n\nYour point about the correlation between VIX and MSFT is correct, but it's not a perfect correlation. Additionally, this is why selling naked puts on low IVR products can bite people in the ass. Vol rises as the underlying's price falls. So an .80c put at 30 delta on a $155 underlying with an IVR of zero goes parabolically negative when the the price of the underlying drops because price change (gamma) and volatility change (vomma). Size kills when shorting options, and it is especially problematic on low IVR underlyings.\n\nAgree re: your final paragraph, with the caveat that he may not be able to roll for a credit. Additionally, someone who considers strangles an advanced strategy, as he said he did later in the thread, may not understand rolling.", "score": 2, "replies": []}]}]}]}, {"body": "Are credit spreads or covered calls more viable?", "score": 2, "replies": []}, {"body": "How does it work then", "score": 1, "replies": []}, {"body": "What if you're trying to get your cost basis on a stock you wouldn't mind owning long (msft very clearly in this trade) to as low as possible?", "score": 1, "replies": [{"body": "This would be ideal - to date I have not found a reason to buy stock outright vs sell puts IF you want to own the shares. \n\nOP has the cash to cover so he's not doing anything crazy as you'll see in the conversation below.", "score": 1, "replies": []}]}, {"body": "Serious question: How does the underlying IV rank 0 and VIX at 12 affect this trade? What can I google to find this?\n\nThanks 🙏", "score": 1, "replies": [{"body": "Good man with asking how to answer your own question with google.\n\nSearch ''implied volatility rank'' and ''tastytrade'' and watch segments that come from the show ''market measures.'' That will take you through the fundamentals of why selling in products with high IVR can be profitable, and selling low IVR is bad news.", "score": 3, "replies": [{"body": "Thank you!!!", "score": 1, "replies": []}]}]}, {"body": "You’re wrong.  Stocks only go up now.", "score": 1, "replies": []}, {"body": "Explain, normie.", "score": 1, "replies": []}, {"body": "If I don’t keep selling how will someone like you be able to fly in and shit on folks like me?\n\n\nYou’ve said I’m wrong, and referred to a few indicators, but haven’t said why or how those matter. For those of us in the back of the room, ELI5.", "score": -2, "replies": [{"body": "Lol the dude is confused.\n\nNothing wrong with weeklies and nothing wrong with holding to expiration (as long as you roll them out.) If you sell options on FAANG stocks or reliable stocks, mathematically you absolutely won't get fucked, as long as you keep a reservoir of cash in your account for times of margin requirement expansion. Although, I wouldn't sell puts on peloton because IPOs are very unpredictable, there nothing wrong with it, if you think Peloton will is a good stock for the future", "score": 8, "replies": []}, {"body": "Fly in and shit on you? You don't understand the risk you took.\n\nNo one can do the work for you. Go to tastytrade and start putting in the hours of study.\n\nDo it right, and you'll be back in three months with an entirely new perspective about the trades above. You'll also be profitable and know why the trades above will lead to failure.", "score": 5, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Nothing \"fine\" about owning 100x more cash than your premium + some in stock you never intended to buy on the wrong end of a bull/bear run.\n\nask the tesla 250 assignment boys right now", "score": 6, "replies": []}, {"body": "True. I assumed.", "score": 3, "replies": []}]}, {"body": "> hours of study\n\nYou know this is a wsb post not /r/investing right?", "score": 7, "replies": []}, {"body": "Get fucked. I’m not some asshole asking *what are FDs?*\n\nThis self-righteous know it all “my sweet summer child” shit is boring. You’ve never even posted in the sub. (Mean Girls quote: “*she doesn’t even go here!*”)\n\nSo yeah, get fucked, and post some plays with your **big theta energy**.", "score": 7, "replies": [{"body": "Dude, he's just trying to tell you your 4-5 weeks of \"4K EASY MONEY\" theta weekly sells on MEME stocks is going to eventually be brought to a statistical halt by one bad week of your ass getting overnight drilled for 50k+ of losses/assignments.\n\nThere is a balance and you are on the wrong side of it right now.", "score": 24, "replies": [{"body": "I hear what you’re saying about PTON, but a cursory glance at my history shows there’s been one week of trading shit like PTON this way, and ~15 weeks of solid profits from MSFT.\n10s of thousands in profit over that time. I get assigned on MSFT bfd, I spin the wheel or I grow my already sizeable position in MSFT.\n\nWhat’s with everyone trying to provide *investing advice* all of a sudden?", "score": 7, "replies": [{"body": "i think this is more gambling advice with a bit of vague warnings about the stats inevitably ass-fucking you than *investment advice*.\n\ngood luck!", "score": 9, "replies": []}, {"body": "I think they're assuming that these puts aren't cash covered. Are they? Nothing at all wrong with selling puts if you have cash to buy the stock. Do brokers even allow you to sell puts that aren't cash covered? I don't think so. These people mentioned naked puts, but a naked put is not a cash uncovered put. A naked put is simply selling a put while not shorting the stock, just like a naked call is selling calls without owning shares. Selling cash covered puts is a very good strategy imo. \n\nNow if you're somehow selling puts without having the cash to buy the stock then yeah this strategy is dangerous. If you're assigned I guess you'll be negative and owe.", "score": 3, "replies": [{"body": "Yes, brokers allow you to sell options without the cash to buy the underlying.", "score": 2, "replies": [{"body": "Which ones? I'm at td ameritrade and at the highest options trading level and can only trade cash secured puts", "score": 3, "replies": [{"body": "All of them. Look up options levels. You're describing level two. You can write anything you want at level four.", "score": 3, "replies": [{"body": "Well td ameritrade doesn't. It says I'm at the highest options tier available", "score": 1, "replies": [{"body": "No shit? Don't know what to tell you. Level 4 with $25k+ and you should have no limitations on the amount of tard trades you can make.", "score": 1, "replies": [{"body": "Aww I want to do tard trades", "score": 1, "replies": [{"body": "You might need a new broker. Autism runs wild on Tastyworks.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Been there", "score": 1, "replies": []}]}, {"body": "No, but you are a guy who says strangles are an ''advanced move'' in a post below. \n\nLook, I'm glad shit worked out for you, and glad you have the cash to run a wheel if this goes poorly. In that case, your ''risk'' is very low. That's awesome. Too many people start trying this shit without understanding the risk profile and without the cash to back inevitable pops in volatility and drops in price. You're clearly not that guy. So nice gains. Enjoy your weekend.", "score": 2, "replies": [{"body": "dude, this is wsb, why are you reading everything at face value?\n\nClearly “EZ MONEY” is hyperbole. And “advanced moves” aren’t fucking strangles or straddles.\n\n\nThe problem I have with you today is that you gave both “you’re so fucked” and “I know why you’re fucked but I’m so much smarter than you and I won’t tell you why” responses.\n\nThe former is fun, like all the “nobody tell him” posts.\nThe latter is obnoxious.\nCombined in the same comment is self-serving of you. You want some points for being anonymously smug? What’s the point of that?\n\nIf you are going to act like some learned elder, then drop some science on us.\n\nAnd post a position sometime, you coward.", "score": 5, "replies": [{"body": "Lol, sure man. Here are some of my bigger positions at the moment ...\n\nX: short strangles at $11/$13 and $12/$14, all Jan expiration. \n\nUNG: short $16 and $17 puts, Jan expiration. \n\nROKU: lots of strangles with puts as low as $95 and calls as high as $180, all Jan expiration. \n\nRUT: long Jan/Feb calendar put spread, which is a long volatility position. \n\nDIA: long Jan/Feb calendar put spread, which is a long volatility position.\n\n/NG: short 1.95 puts in the Jan expiration.\n\nVIX is low, so there isn't a ton of opportunity and I keep about 80% of my capital liquid.\n\nAnd with response to ''being so smart but not telling you why'' you're fucked, everyone wants to understand how all of this works to be consistently profitable without doing any of the work. Maybe not in your case, but this is difficult to get your head around because it's difficult to get your head around. And everything is context dependent, and relies on personal risk tolerances (guh). E.g., sure 24-30 delta strangles have the highest return on capital, but most people work and can't watch that shit all day, so maybe 15-20 works better for them. But people always ask questions that only lead to 30 more questions. And what it really takes is sitting down and doing the work to learn. \n\nBut what the fuck, man, I don't know anything either. I'm just a smug fuck looking for internet points.", "score": 12, "replies": [{"body": ">I'm just a smug fuck looking for internet points.\n\nI gave you an internet point.", "score": 3, "replies": [{"body": "Lol. I just dont want people to get fucked because they make mistakes. OP is fine because he has cash to cover, but it's very easy to sell a bunch of naked options and then get horrifically fucked when Elon tweets ''considering taking TSLA private at $1500/share. Funding secured.'' I dont want that to happen to anyone.\n\nYoloing with selling options can end in financial ruin.", "score": 4, "replies": []}]}]}, {"body": "> And “advanced moves” aren’t fucking strangles or straddles.\n\numm... you just said they were.\n\nhttps://old.reddit.com/r/wallstreetbets/comments/edgfmp/living_that_theta_life_one_week_at_a_time/fbhnqty/\n\nyou clearly don't know what you're talking about.", "score": 2, "replies": [{"body": "You’re one of those “well, actually” type people, huh? You got me so good!\n\nQuote the entire paragraph, with the other sentence that mentions other words used as hyperbole, as those two ideas are linked.\n\nReading comprehension isn’t your strong suit, which makes things difficult, as that’s all we get here.\nI could draw you a picture, if you like.", "score": -1, "replies": [{"body": "> Quote the entire paragraph, \n\nthat WAS the entire paragraph, you pompous retard.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Pics or it didn’t happen.\n\nI want to see that shit, not read about it.", "score": 1, "replies": [{"body": "Okay, it didn't happen.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "fuck your sigh", "score": 2, "replies": []}, {"body": ":)", "score": 1, "replies": []}]}]}, {"body": "> /u/i-only-buy-leaps\n\n> sold weekly puts\n\n🤔🤔🤔", "score": 18, "replies": [{"body": "Didn’t buy", "score": 2, "replies": []}]}, {"body": "You risked assignment of a $290,000 position of a meme stock to make $3,000?\n\n🤔", "score": 18, "replies": [{"body": "Did it work? Yes therefore he is god", "score": 8, "replies": []}, {"body": "I sold a strike ~10% otm on a volatile ticker. Even with that volatility, assignment risk was pretty low.\n\nAnd yeah, it’s $290k to get assigned, but there’s virtually no chance of me being out of pocket that entire amount. I had a stop loss set up so if the underlying hit $29.25 I closed out my position.", "score": 5, "replies": [{"body": ">\tI had a stop less set up so if the underlying hit 29.25 I closed out my position.\n\nYou should be assigned just for saying this.", "score": 6, "replies": []}, {"body": "It’s a stock dumbo. Overnight move and you’re toast. Options don’t trade like futures", "score": 3, "replies": []}, {"body": "Lol stop loss on options...that's cute", "score": 2, "replies": []}]}, {"body": "Well, in OP's defense, he has the cash to cover this, which would be 50% of the position value.\n\nHe could also just sell the shares and take whatever loss it was.\n\nHe also said he'd run the wheel anyway if assigned. So I think OP was much more thoughtful about this position than I originally thought.\n\nIt's not a play I would make given the notional value and IVR, but if a guy is swinging a few mil in the market, than $300k notional in MSFT isn't outrageous.", "score": 3, "replies": [{"body": "> 50% of the position value\n\nIt's only 50% of position value? Does this vary from broker to broker?", "score": 1, "replies": [{"body": "Not sure. I thought this was an industry thing. But I dont actually know.\n\nFor stock positions, it costs half the notional value to hold the stock.", "score": 1, "replies": []}]}]}]}, {"body": "going to double down on what u/1sildurr said. youre going to get fucked holding onto these. especially a stock that can move +-10% in a day. think about what you had to risk to get the extra 500. you could have rolled out the date for more premium and less risk. the instant gratification of getting the last 500 is addicting but trust me a possible black swan event is going to completely eat away your account. but what do i know if its within your risk tolerance go for it", "score": 21, "replies": [{"body": "I've gotten fucked by holding till expiration before when it seemed like it wasn't worth paying the commission to close it out.\n\nYeah nope. Mostly close or roll now when at 60~80% gain. Considering I'm generally selling because IV is high and premiums are decent, these types of underlying can usually have wack ass days that can blow the entire trade up.\n\nI mean it's one thing on MSFT it's another on meme stock like PTON that you never intend to hold.\n\nAt the end of the day it depends on the underlying tho.", "score": 11, "replies": [{"body": "Agreed all depends on underlying.", "score": 2, "replies": []}, {"body": "Yeah, this is why someone above mentioned rolling the positions or closing before expiration. You're exactly right. But, like everything, it depends on someone's individual risk tolerance (guh) and if they don't care about assignment and want to run the wheel or something.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "That’s an advanced move I haven’t tried yet.\n\nI was contemplating a 30.5/32.5 on $PTON earlier on the week which would have paid off in the end, or at least looked good enough at open to take profit today.\n\nI went a bit too hard on $PTON this week and I’ll dial it back and spread out some more. No need to have one meme stock be my downfall.", "score": 3, "replies": [{"body": "Right there with you. Opened 12/27 31/32’s on Monday and some 1/3 29/30’s today", "score": 1, "replies": []}, {"body": "I sell 20 Delta strangles and condors on /ES, /NQ, /RTY and brings in the 5k quite predictably every week.", "score": 1, "replies": [{"body": ">I sell 20 Delta strangles and condors on /ES, /NQ, /RTY and brings in the 5k quite predictably every week.\n\nHi, do you mind expanding on this? Sounds interesting.", "score": 1, "replies": []}]}]}]}, {"body": "As long as you’re down to own the underlying I guess this ok. But definitely wouldn’t want to get caught owning PTON stock especially with the amount of contracts you’d sold. Congrats on getting out alive tho.", "score": 7, "replies": []}, {"body": "Fuck man 100 pton puts that's fucking some insane PRT (Personal Risk Tolerance)", "score": 5, "replies": []}, {"body": "First off, good job and congrats on your weekly tendies.\n\nIt's currently not difficult to make money, whether you sell premium or buy premium. One's gotta be really autistic to not understand that trend is very bullish right now and has been for the past couple months. You can thank JD's & Orange crew for that.\n\nAs with any style of trading (the wheel strategy, theta gang (on weeklies or monthlies or 45-Days out), degenerates strictly buying FDs on RH, EVERYONE can make money. 5 days in a row? Sure. 20 days in a row? Sure. 60 days in a row? I know that we have people out there that are consistently trading green DAYS (read: losing trades intraday, but end trading day still in the green). BUT there will be that one incident, that will completely go against you. Not because you traded/gambled the wrong direction, not because your EGO told you to stick to it because it has worked all this time, not because you went in full-blown with your whole account, but because of your RISK/TIME MANAGEMENT.\n\nAs long as you're not in it (daily) with your entire account and understand that you will have losing DAYS, carry on. What matters is to stay in the game, live to trade another day, losses can be regained with discipline, determination, perseverance as long as you've still got the capital to do so. Account at $0: Game over.\n\nWith all that said, I am strictly on the buy side and make good money for the time I spend at this game.\n\nDon't be shy to post more gains. Theta gang (always) can use confirmation that this can continue.", "score": 6, "replies": [{"body": "What was this? To try to get people to be afraid of something??", "score": 1, "replies": []}]}, {"body": "Cash covered puts or naked ?\nAsking for a friend, whom looks identical to me in the mirror.", "score": 4, "replies": [{"body": "Cash covered. You know of any brokerages giving you 1000x leverage? Send the deets, if so.", "score": 4, "replies": [{"body": ":) \n\nThanks for the clarification. \nI think I was asking the same questions to you indirectly: How to sell naked puts? And I would not f myself in doing so.\n\nI am looking at cash covered Dec 27 AMD puts for theta decay/ bleed. Would be willing to own shares in worst case. Fishing for chipotle dinner money 🥑. Wishing us good luck 🍀", "score": 2, "replies": []}]}]}, {"body": "What is a theta?", "score": 6, "replies": [{"body": "Theta represents time decay in the options pricing model.\n\n\nTHETA GANG!!!! 🐌", "score": 19, "replies": []}, {"body": "Those who don’t know the BSM should be removed", "score": 1, "replies": []}]}, {"body": "How\nDid you get the excess margin to sell that many puts on questrade", "score": 2, "replies": [{"body": "I think it’s called “margin power”.\n\nUsing your TFSA account as collateral for your margin account. Between the two I’ve got about US$180k so I can do potentially unwise stuff like this - though usually I only fuck with MSFT and AAPL.", "score": 2, "replies": [{"body": "So you keep 180k of cash?", "score": 1, "replies": [{"body": "Margin account has been 100% cash while selling, TFSA has been variously in cash or calls.\n\nI’m not sure what the formula is, but you can’t borrow against unrealized gains in the TFSA, of course, but it seems like the principal amount is still able to be used for margin.\n\nAt this moment in time I am holding $180k of cash between the two accounts. I haven’t decided on a longer term move for the TFSA, waiting for the new year and a signal from AAPL earnings whether I go back in or not.\n\nI’ve got a lot of tech exposure in my rrsp ($150k of Amazon, $20k Facebook, $30k MSFT, and $10k in Slack) so I’m cautious about loading up any more elsewhere, but Etfs are so boring to me now, thanks to this stupid sub.", "score": 1, "replies": [{"body": "How do they calculate the margin? 3x cash?", "score": 1, "replies": []}]}]}]}]}, {"body": "Absolutely retarded risk reward with possibility of being on the hook for 290k just to make 2.9k on PTON. Lol", "score": 2, "replies": []}, {"body": "Good job, Selling puts has always been the answer. \n\nAwesome. You are doing the right thing.", "score": 4, "replies": []}, {"body": "Can we skip to the part of rogue wave?", "score": 1, "replies": [{"body": "There is no rogue wave on Microsoft because it's not oil and everybody would jump in on Microsoft if it was cheap.", "score": 1, "replies": []}]}, {"body": "How much buying power do you need to do this ?", "score": 1, "replies": [{"body": "For a put, whatever the exercise price is times the number of shares.\n\nIn this case that is 12 x 100 x 155 for MSFT, and 100 x 100 x 29 for PTON.", "score": 1, "replies": []}]}, {"body": "Theta gang are terrorists", "score": 0, "replies": []}]}
