{"title": "$TSLA Daily Investor Discussion - February 13, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q419 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/alewpn/tesla_q4_2018_financial_results_and_qa_webcast/).\n", "id": "aq4ods", "created_utc": 1550048676.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 54, "comments": [{"body": "Form SC 13G/A\nFiling Date Feb 13, 2019\n\nhttp://ir.tesla.com/node/19466/html\n\nSo nothing changes with Fidelity’s holdings", "score": 6, "replies": []}, {"body": "Which direction do you think the stock price will go leading up to first quarter deliver announcement (approximately first or second)?", "score": 4, "replies": [{"body": "It’s going to be at around $300 before ER, just like every quarter. ", "score": 4, "replies": []}, {"body": "Idk, Q1 isn’t going to be great. I don’t expect much movement.\n\nAt best it’s a tiny profit, and has a real chance of loss.\n\nAverage street estimate is around 0.61 eps \n\nThat’s quite a bit lower 2.9 in Q3 and 1.93 in Q4.", "score": 2, "replies": [{"body": "True, but those low expectations have already been set.", "score": 1, "replies": [{"body": "With analysts yes.\n\nHow does that translate to retail? Seems like retail investors haven’t processed this, and don’t plan on a potential Q1 loss.", "score": 0, "replies": [{"body": "Retail investors make up a tiny, almost negligible portion of the shares traded each day in general. Less than 10% for most companies. For Tesla, you'd imagine it's maybe a bit higher, but maybe not enough to still matter significantly. (I could potentially be wrong here since Tesla is so popular, but I think it's still probably the case)\n\nInstitutional investors still primarily determine where a stock goes; hedge funds like Point72 control a huge amount of assets under management and make trades in the millions on a regular basis. They will analyze management guidance and talk to street analysts on a regular basis and should be well aware that 1Q will likely be negative. Tesla has done a good job of communicating this and managing expectations to investors.", "score": 2, "replies": [{"body": "10% can still have a huge effect on price as the institutional investors are going to want retail to buy high and sell low.", "score": 1, "replies": []}]}]}]}, {"body": "Depends on the source you're using, but I believe you're citing the non-GAAP EPS consensus, which is a bit different from Tesla's GAAP guidance. GAAP consensus estimates have EPS at -$0.52. 3Q and 4Q GAAP EPS was $1.75 and $0.78, respectively", "score": 1, "replies": [{"body": "You’re right, I worded that terrible.\n\n2.9 and 1.93 were the actual esp valued form those quarters not the analysts projections.", "score": 2, "replies": [{"body": "Yup, the 3Q and 4Q citations you mentioned were for the previous year.\n\nBut just to be super duper clear, there's a bit of a difference between GAAP and non-GAAP as well (you may be aware of this but just highlighting for anyone else that's curious). GAAP is the numbers that follow the accounting standards and that all companies are required to follow. Tesla's guidance is on a GAAP basis.\n\nAnalysts, especially tech ones, like to strip out stock-based compensation (SBC) as an expense b/c it is a non-cash expense. The number excluding SBC is considered non-GAAP EPS. Honestly the logic of stripping it out is questionable to me, and people are gradually shifting away from it (Facebook for example used to disclose more about their non-GAAP EPS which excludes SBC, but have stopped doing that).\n\nThis is why the numbers you cite here for 1Q (which are non-GAAP) are higher than the consensus number I cite for 1Q (the GAAP number, and the tiny profit/potentially negative number that Tesla alluded to).  The non-GAAP ones strip out SBC and are therefore higher, but to compare expectations on an apples to apples basis with Tesla's guidance, we have to look at GAAP consensus that does not strip it out.\n\nSorry, long rant, but I think it's important so that we all know where the expectations bar is currently.", "score": 3, "replies": [{"body": "Thanks\n\nEdit:\n\nAnd yes it’s hard to keep track of all of it. Slips me up every time.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Bunches of low-volume selling today, pushing TSLA below the NASDAQ. Not sure what's driving that.", "score": 3, "replies": [{"body": "Perhaps the Rivian investment news?", "score": 2, "replies": [{"body": "Or 'The Drive' article, or the GF2 scrutiny from NY lawmakers, or a butterfly farted.\n\nWould love to see a PM rally to 318.", "score": 4, "replies": [{"body": "Aren't The Drive and GF2 articles bullish, showing impressive ability to strongarm various government entities?", "score": 1, "replies": []}]}]}, {"body": "ikr. I've never seen so many low volume shares sold.", "score": 2, "replies": [{"body": "Like, they are really really quiet.  I don't know how they all manage that, being that there are so many of them.", "score": 2, "replies": [{"body": "Just not sure if this will continue tomorrow or if I should buy some today. The FOMO is strong...", "score": 1, "replies": []}]}]}, {"body": "Don't worry, it will close green today.", "score": 1, "replies": [{"body": "Betcha a dollar", "score": 4, "replies": []}, {"body": "//sad trombone noise", "score": 3, "replies": []}, {"body": "I hear sad violins.", "score": 4, "replies": []}]}]}, {"body": "I think the model Y announcement and S&P listing are the two biggest items for the first half of 2019.  My understanding is that most of the boxes for S&P listing are checked for TSLA but they will need to make a profit in Q1.  Is there a tipping point in that Q1 profit figure?  Please discuss.", "score": 3, "replies": [{"body": "Per Macquarie research (an investment bank), Tesla fulfills all S&P 500 inclusion requirements except for the profitability requirement -- trailing four quarter GAAP EPS has to be positive. Right now, that stands at -$5.89, but if they are able to hit consensus estimates going forward, they should turn positive after 2Q19 ([see financial model here](https://thenonconsensus.com/tsla)). It's extremely unlikely they will hit it after 1Q19.\n\nOnce they hit the requirements, S&P's index board must then determine if TSLA will be included, and they would have to remove another company. Timing on this is uncertain.\n\nGenerally when a company is included in the S&P 500, it will see a decent size pop in share price on the day of.", "score": 6, "replies": []}, {"body": "First it would need to post a Q1 profit.\n\nTwo what kind of boost do you think the stock would see? Going from memory didn’t Twitter see about a 5% jump when it was included? I think it rallied line 15% over the next few days.\n\nSo you’re talking about a rang up to about $350? Hell Tesla can trade to that on far less news than inclusion in the S&P500.\n\nInclusion in the S&P500 won’t drastically change Tesla’s position. \n\nEdit: \nIt’s certainly not going to stop/silence the companies critics.", "score": 6, "replies": [{"body": "Think it needs 4 straight positive quarters? So it couldn't be included until after a positive q2. Assuming q1 is positive. Is that right?\n", "score": 2, "replies": [{"body": "Have to average profit over the last 4Q I believe. I could be wrong tho.", "score": 1, "replies": []}]}]}]}, {"body": "I think the (hopeful) March 15th Model Y presser will be the catalyst to get the stock up over 350$ again.", "score": 3, "replies": [{"body": "It won’t be shown in March because it would cannibalize sales. Unlike the Model 3, the Model Y will be shown when it is already very close to production. Maybe November.", "score": 7, "replies": [{"body": "Would it? March seems like a good time to me. They won't have problems filling production as they're still trying to roll model 3 out to the rest of the world. Also the publicity from the event might cancel out whatever sales which gets cannibalized. Q2 is going to be a huge huge quarter regardless. End of quarter deliveries from Q1 and Q2  of high high ASP cars but this time made with really low cost. Crazy profit margins.", "score": 2, "replies": [{"body": "If Elon cares about TSLA breaking out of its trading range, he will show the car when it’s close to production (which he said he will do). It would give Wall Street quite the anal fisting. Until then, it’s wise to keep some core shares and swing trade the rest. That’s the sad reality of TSLA. Profits don’t matter for the SP, only surprise.", "score": 3, "replies": [{"body": "In the short run it doesn't matter, but in the longer run it will. Q2 earnings latest IMO.", "score": 1, "replies": []}]}]}, {"body": "If you look at the Model 3 reveal in comparison, they announced a March 2016 reveal date in February 2016. Production didn't begin until summer 2017.", "score": 2, "replies": []}]}, {"body": "Is that even still happening on that date? We have received no confirmation since the first one almost a year ago that it’s happening on the 15th. No invites have been sent out, etc.\n\nIt’s now a month away and I just find it odd that there’s been little to no talk about it, from what I’ve read.\n\nI don’t deny that it’s going to be made, definitely is, question is still: when are we gonna see it?", "score": 3, "replies": [{"body": "Musk is unpredictable, so could end up being a suprise reveal. But I think it happens soon, has been a while since we've had one, and the company could use the momentum.", "score": 1, "replies": [{"body": "I hope that’s the case. I wanna see the damn thing already!", "score": 1, "replies": []}, {"body": "Hey, WhiteLightning416, just a quick heads-up:  \n**suprise** is actually spelled **surprise**. You can remember it by **begins with sur-**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": -2, "replies": [{"body": "Good bot.", "score": 2, "replies": []}, {"body": "Go to hell bot.", "score": 2, "replies": []}, {"body": "Ok bot.", "score": 1, "replies": []}, {"body": "You are one useless bot.", "score": 1, "replies": []}]}]}]}, {"body": "A car reveal isnt gonna move the stock $40 north", "score": 1, "replies": [{"body": "It can be the catalyst for positive momentum though. ", "score": 1, "replies": []}, {"body": "One million reservations can push easily to 400$\n\nBut now I'm not sure, possible that people now understands that reservation didn't give much of advantage for Model3.", "score": 0, "replies": []}]}, {"body": "Fun fact, the ides of March thing is probably a reference to a Harry Potter fanfic (/r/hpmor).", "score": 1, "replies": [{"body": "\n\n[?](https://en.m.wikipedia.org/wiki/Ides_of_March)", "score": 7, "replies": [{"body": "Oh did not know that, probably wrong then.", "score": 2, "replies": []}]}, {"body": "Wow. Just wow. ", "score": 7, "replies": []}, {"body": "I.. you... what?", "score": 6, "replies": []}]}]}, {"body": "[removed]", "score": -3, "replies": [{"body": "Is this like a superstition to make the stock go up?\n\nIs this just to mock the other users who post here with bad news? Perhaps a critique of the average fudster.\n\nOr Have you finally changed you’re opinion on the stock?\n\nAre you banksy? Is this your new piece?", "score": 3, "replies": [{"body": "e) all of the above", "score": 1, "replies": []}, {"body": "The more one watches a stock, the more dumber one gets!", "score": 1, "replies": []}]}]}]}
{"title": "Upcoming NVDA Earnings, what we think", "selftext": "We got the NVIDIA earnings coming up on the 14th. Do we think we'll see NVDA drop accordingly? And then build back up the following days? What do we think? Let's all lose money together.", "id": "aq2wk0", "created_utc": 1550034013.0, "score": 28, "upvote_ratio": 0.98, "num_comments": 59, "comments": [{"body": "[deleted]", "score": 13, "replies": [{"body": "AMD will take their lunch in data center. Nvidia does have a large gain in cars so that might be a push for them. ", "score": 4, "replies": [{"body": "Ok now this is Epyc", "score": 10, "replies": []}]}, {"body": "I've been reading decent things about their AI too, but data center is looking hot", "score": 2, "replies": []}]}, {"body": "My puts hope the awful guidance they’re gonna give isn’t already priced in, so there’s that I guess", "score": 10, "replies": [{"body": "I was thinking of selling all mine off tomorrow and hoping for a drop so I get some cap gains. Probably not the best way to go about it.", "score": 3, "replies": []}, {"body": "This is eerily similar to aapl. Aapl gets out ahead and cuts their 4Q numbers, reports meh earnings with meh guidance and bounces for days. Aapl also dropped and traded where it was before that 4Q cut right before earnings. NVDA is also at its 50dma so if it pops it’s gonna make a run for it til 170 ", "score": 2, "replies": []}, {"body": "They were for atvi lol. ", "score": 1, "replies": []}]}, {"body": "I'm pretty fucked if it doesn't drop. 50k account all in on puts right now. Bagholding them since my account was 80k. I just can't see it being valued this high short term. 18% guidance cut, partly due to low demand for their new GPUs. Which means guidance should be lowered in future quarters as well. NVDA has kept pace with the market rally too well for me to think this isn't going down.\n\nI'm also bearish on the trade war, since I can't see Xi giving in. If Trump isn't meeting with him personally there's no chance. If we could stop the fake trade optimism pumps that would be great.\n\nBut honestly, the real reason I'm bagholding these puts is AMD. How the fuck can NVDA pump when they see AMD met earnings? Doesn't that just mean their competitor is taking market share? AMD mentioned no weakness in China. So isn't NVDA just spouting bullshit excuses for their poor GPU launch and mismanagement of the channel?\n\nChrist I get why everyone loves NVDA, I'm bullish long term too but there's just way too much short term for it to not take another dump soon.", "score": 21, "replies": [{"body": "\"How the fuck can\" --- Man I've seen this so many times on here. Your logic is solid - but often the stock market does not follow logic. ", "score": 24, "replies": [{"body": "\"The market can remain irrational longer than you can remain solvent\"", "score": 7, "replies": []}, {"body": "Not that you are wrong but stock market might be following alternative logic, very much like alternative truth", "score": 5, "replies": [{"body": "Much like **FAKE NEWS**!!!!!!", "score": 1, "replies": []}]}, {"body": "Sounds more like denial and desperately trying to convince himself it will go his way... I do this with MU", "score": 4, "replies": [{"body": "We all do this here. On WSB. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "I bagheld NVDA puts lmao", "score": 5, "replies": []}]}, {"body": "My man, that 50k you have left is still 50k.  If NVDA doesn’t go your way, you could lose more. The chances of getting back to 80k on this play are slim.  Why not exit the position, baghold your 50k, and look for a reentry or a new play?", "score": 9, "replies": [{"body": "That which NVDA puts giveth, NVDA puts may taketh away\n\nBut really, this isn't FD shit so realistically, unless it truly moons I shouldn't lose more than 60% from here, and even then I'd be right back where I started. NVDA having a larger than expected run-up to earnings hasn't changed my reasoning for making the play in the first place. Unlike most of wsb, I stick to my gameplan. The plan itself is pretty high-risk, but I mean that's what this place is for ya?", "score": 5, "replies": []}]}, {"body": "Good luck bro", "score": 1, "replies": []}, {"body": "Stock goes up, stock goes down. You can't explain that.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you on [**2018-02-14 16:15:00 UTC**](http://www.wolframalpha.com/input/?i=2018-02-14 16:15:00 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/aq2wk0/upcoming_nvda_earnings_what_we_think/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/aq2wk0/upcoming_nvda_earnings_what_we_think/]%0A%0ARemindMe!  2/14/2018 4:15 PM) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! ege0ocv)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "RemindMe! 2/14/2018 4:15 PM EST", "score": 1, "replies": []}, {"body": "RemindMe! 2/14/2018 9:15 PM EST", "score": 1, "replies": []}, {"body": "This settles it, I’m going all in on calls", "score": 1, "replies": [{"body": "Best of luck fellow autist", "score": 1, "replies": []}, {"body": "Hope u did that shit", "score": 1, "replies": [{"body": "Nope I wish", "score": 1, "replies": []}]}]}, {"body": "Thinking with your head I see. Maybe your head can explain how the fuck PCG pops up 20% on a bankruptcy note. Markets don’t behave rationally. ", "score": 1, "replies": [{"body": "CNBC and a bunch of other outlets pumped out how undervalued it was. And every news article failed to mention that it was in bankruptcy court.", "score": 1, "replies": [{"body": "I don’t think that mom&pop investors like us make any significant dent in any stock price. It’s all about algo traders and big hedge funds. ", "score": 2, "replies": []}]}]}, {"body": "I'm 100% sure you will be fu.cked :)\n\nBad news is already priced in buddy. Just like how $AAPL was.\n\nAny good news will make this pop 10% ", "score": 0, "replies": [{"body": "Priced in is such a meme here no one even knows what it means anymore", "score": 2, "replies": [{"body": "not a meme, its a trend doofus if you haven't realized this past earning season.\n\n$AAPL $AMD etc", "score": 1, "replies": []}]}]}]}, {"body": "I’m thinking calls so that means probably puts. ", "score": 6, "replies": [{"body": "Did you see web vs market plot for a week?", "score": 3, "replies": [{"body": "No, where did you see that?", "score": 1, "replies": []}]}]}, {"body": "Nvda 200s boi ", "score": 2, "replies": [{"body": "Lol yea, I wish. Maybe In a year again.", "score": 2, "replies": []}]}, {"body": "I'm thinking calls", "score": 3, "replies": []}, {"body": "STRADDLE! NVDA will make a big move but I'm not autistic enough to pretend to know which way.", "score": 3, "replies": [{"body": "Feeling this.", "score": 2, "replies": []}, {"body": "The Straddle pricing is shit, IV is relatively low on the 30D percentile, don't touch that shit", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 3, "replies": [{"body": "yep, I would switch puts to calls if NVDA was $135 today.", "score": 1, "replies": []}]}, {"body": "Calls", "score": 2, "replies": []}, {"body": "Im selling my shares before earnings and will re-evaluate. I bought in at$136", "score": 2, "replies": []}, {"body": "Bought stock and calls earlier this week.\n\nLong on the stock and calls expire @ 2/15. Up on both -- calls up 120% last time I checked...", "score": 2, "replies": []}, {"body": "49.40% calls 50.60% Puts. Comparing volume of options.\n\nIt's a tossup.", "score": 2, "replies": []}, {"body": "See AAPL. Also, consensus is puts...", "score": 1, "replies": [{"body": "This... this... and more... this", "score": 1, "replies": []}]}, {"body": "Anyone thinking selling premium on these earnings? Worked well on ATVI this morning ... too bad I blew the gains on calls. My thinking is that it seems the big moves have already been made.", "score": 1, "replies": []}, {"body": "I've got about 10000 shares of NVDA I've held for over 10 years ($10 a share). I'd like to keep it but scared about ER. Anyone got any ideas to protect this from dropping? Any option strategies? I'm willing to sell it all if needed as well. Any ideas are welcome. Won't hold you to it.", "score": 1, "replies": [{"body": "Just wanted to say wow man congrats on holding for so long\n\nPuts are already too high IV now so I don't even know if you could do anything besides selling a couple but not all shares?? ", "score": 1, "replies": [{"body": "I might do a collar, so sell calls to pay for puts, +/- 5% . I'm ok selling if it gets ITM on those calls. In this setup the most I can lose is that 5%.", "score": 1, "replies": []}]}]}, {"body": "It’s all about Beta. If this market continues ticking up, regardless of fundamentals, individual stocks will go up  or at least hold their value.  ", "score": 0, "replies": [{"body": "No", "score": 1, "replies": [{"body": "OK", "score": 1, "replies": []}]}]}, {"body": "Probably beat their lowered guidance by not much. \nBut I don't think it will go up unless they pull up a way better guidance. \nNeither down though. \n\nSo I would put my fingers away from this one. Especially if someone looks at playing the straddle", "score": 0, "replies": []}]}
