{"title": "Tesla made 0 cars in 2011, but will make around 500k in 2019 [Elon]", "selftext": "", "id": "ashr8q", "created_utc": 1550623736.0, "score": 36, "upvote_ratio": 0.97, "num_comments": 57, "comments": [{"body": "He's also wrong about 0 cars in 2011. Burn the heretic!", "score": 5, "replies": [{"body": "Actually it is funny that he got both halves of a 2 part statement wrong.\n", "score": 5, "replies": [{"body": "Weren't they calles \"Tesla Motors\" back then? So... One half could be right if you are picky with the words 🤐", "score": 1, "replies": []}]}, {"body": "This ~~stock~~ tweet is crap!", "score": 2, "replies": []}]}, {"body": "Have an honest question for you? Musk just announced on Twitter new guidance for half a million car in 2019. \n\nThat’s roughly 10,000 cars per week, when they stated they don’t have the factory capacity for this. \n\nThis also goes against guidance Tesla has previously issued.\n\nWhat do you make of this? How does this jive with the pervious guidance?\n\nEdit:\n\nFrom the Q4 investor presentation\n\n> Model 3 production volumes in Fremont should gradually continue to grow throughout 2019 and reach a sustained rate of 7,000 units per week by the end of the year. We are planning to continue to produce Model 3 vehicles at maximum production rates throughout 2019. Inclusive of Gigafactory Shanghai, where we are initially aiming for 3,000 Model 3 vehicles per week, our goal is to be able to produce 10,000 vehicles per week on a sustained basis. Barring unexpected challenges with Gigafactory Shanghai, we are targeting annualized Model 3 output in excess of 500,000 units sometime between Q4 of 2019 and Q2 of 2020.\n\nEdit 2:\n(I mean on the podcast today he told Cathy Wood that Freemont can only build 5,000/week sustain. That that is 85% of its max capacity. So how do they get to 10,000?)", "score": 6, "replies": [{"body": "I forget the details of what they're expecting for Chinese gigafactory production or when it would come online. Might that account for it?\n\nAlso expecting Model 3 production at Fremont to increase a bit more aren't we?", "score": 3, "replies": [{"body": "They will be targeting 3,000/week in addition to the 7000/week at freemont. This will lead to about 10,000/week it roughly .5M a year. The number he stated for 2019.\n\nThe Shanghai factory is set to come online in Q4, and ramp up from there.\n\nSo according to Tesla’s own guidance .5M should be doable in 2020, not 2019.", "score": 2, "replies": [{"body": "That 7,000 per week is Model 3 only. Not including S/X. Tesla produced 86,555 in Q4. That would equal 346,220 for the whole year if they continued that production rate. This represents a 153,780 'deficit' of cars that need to be made up.\n\nI think S/X decreases to about 80k for 2019 with S/X 75 sales going to high-end Model 3's. I think they will hit about \\~420k cars in Fremont in 2019 and 50k cars in China.\n\nFremont estimation: Q1: 95k, Q2: 103k, Q3: 106k, Q4: 110k. This equals 414k.\n\nIt's possible that Tesla will invest some more capex during this year to raise production of Model 3 above 7k per week. Elon has reduced the aggressiveness of his forward projects (360-400k guidance in the letter), so expect that they will be attempting to exceed them this year.  \n\n\nAlso 2020 is likely closer to 800k units than 500k units. ", "score": 14, "replies": [{"body": "Agree with your numbers.\n\nI’m not sure 7000/week is achievable tho over the full year. Definitely peak tho. According to Musk on the Ark Podcast sustain limit for freemont was in the 5,000 range at 80% of max\n\nEdit:\n\nOriginally I had 5,500", "score": 3, "replies": [{"body": "I think he was referring to the 5k burst at the end of Q2 vs sustained rate of 80-85% during the next quarter. Tesla didn't go super hard bursting at end of Q4, they had more cars than they could sell at that price point and without sales into Europe. ", "score": 2, "replies": [{"body": "See we’re still bending numbers, but we’re still short.\n\nThis is just a personal peeve of mine. He goes out and says stuff like this, and no one knows what to believe. And he always seems to do this when he’s under pressure.\n\nI just don’t think it’s how a CEO should behave, but I know others here will disagree.\n\nI just don’t think it’s fair to the retail investors that don’t follow closely enough to know this is bull. And to their credit, they would be doing some amount of due diligence. Why wouldn’t you believe it, unless you knew the numbers. ", "score": 3, "replies": [{"body": "Maybe, maybe not. I'll be very curious to see how production comes out in Q1 and Q2. If they can hit 7k sustained in Q2 that would be very positive for a 500k total production in 2019.   \n\n\nIf they can get to 8k Model 3's at Fremont by end of 2019 + 20k S/X per quarter I will be happy. That would be 124k cars in Q4.   \n\n\nWhether they made 400k this year or 500k this year it doesn't matter in 5 years. Next year they will hit 800k quite easily with the 450k from Fremont and 350 from Giga 1 and China. Tesla's production has always moved in big step jumps which make the revenue growth rather lumpy. ", "score": 2, "replies": [{"body": "+-12 hours ago on page 16 of the 10k they expected to have a production rate of 7000 per week by end of 2019\n\n> Our future business depends in large part on our ability to execute on our plans to manufacture, market and sell the Model 3 vehicle, which we are offering at a lower price point and which we are producing at significantly higher volumes than the Model S or Model X vehicles. We commenced production and initial customer deliveries of Model 3 in July 2017, and since then have achieved a stabilized production rate. At the Tesla Factory, we expect to continue to increase our Model 3 production rate to approximately 7,000 units per week on a sustained basis by the end of 2019. Moreover, in China, we expect to commence production of certain trims of Model 3 for the local market in China in the initial phase of our Gigafactory Shanghai by the end of 2019, and then progressively increase levels of localization through local sourcing and manufacturing. Inclusive of Gigafactory Shanghai, our goal is to be able to produce 10,000 Model 3 vehicles per week on a sustained basis, and an annualized output rate in excess of 500,000 Model 3 vehicles sometime between the fourth quarter of 2019 and the second quarter of 2020. However, the timeframe for commencing Model 3 production at Gigafactory Shanghai is subject to a number of uncertainties, including regulatory approval, supply chain constraints, and the pace of installing production equipment and bringing the factory online.\n", "score": 1, "replies": [{"body": "Yes, but since all of the Model 3 production numbers fiasco I think Elon is being more conservative with his timelines/projections. A whole year to increase production from 5k to 7k seems quite slow all things considered.   \n\n\nAlso the 7k is not really the only important metric, cost per unit is important. If they hit 7k units with gross margin of 25% that in their minds might be better than 8k units with gross margin of 20%.   \n\n\nAlso, if S/X declines 5-7k per Q we need 400 to 550 more Model 3's per week to offset this decline. ", "score": 1, "replies": [{"body": "Sure concede the point, but the issue at hand is production totals not profits.", "score": 2, "replies": []}]}]}]}, {"body": "> I just don’t think it’s how a CEO should behave, but I know others here will disagree.\n\nI agree with you. People will just hold it to him later and be negative about it, overshadowing the fact that it's a pretty astonishing achievement even if he's short of it.\n\nThen again maybe it's Elon setting a stretch goal, like he has done far too many times in the past. Time will tell I guess.", "score": 1, "replies": [{"body": "Just so odd... always interesting tho", "score": 2, "replies": []}]}]}]}]}]}, {"body": "One aspect of Elon time is making a claim about the rate of production of a period by extrapolating what's possible at the very last moment of the period. To interpret, Elon believes 10,000/wk steady is achievable by the end of Q4 and he's confident Shanghai will be ready. He's always projected twitter guidance this way.\n\nIt makes sense to set expectations for the end of the year in order to bully Tesla's valuation to a position somewhere between that and quarterly results to smooth out your valuation towards a longer term strategy.", "score": 1, "replies": []}]}, {"body": "Chinese giga is 3k a week.", "score": 1, "replies": []}]}, {"body": "> What do you make of this? How does this jive with the pervious guidance?\n> \n> \n\nI think it's pretty obvious - he used the qualifier \"around\" in order to be able to aggressively round up without getting in legal hot water.  There's nothing particularly interesting or abnormal about this - he's been doing that with his predictions for years without any major negative consequences, and I think at this point even a casual retail investor following this stock knows that the ballpark figures he throws out on twitter are a load of baloney.  \n\nAnd he's right, anyway - for some definition of \"around\", they will almost certainly sell around 500k cars in 2019.   His defenders would say that's perfectly fine, it was just an off the cuff remark meant to illustrate how far they've come, not an exact prediction.  His detractors will say that he's irresponsibly throwing out inaccurate numbers while avoiding accountability through the casual presentation.  The TeslaQ crowd will say he's violating every securities law and will be arrested by black helicopter tomorrow.  I personally think the first two are both right and the third is ridiculous.", "score": 3, "replies": []}, {"body": "This is my problem with Musk. He just went and shot his mouth off on Twitter, with nothing to gain. \n\nThis flys in the face of the guidance Tesla has issued. Now what is an investor supposed to believe.\n\nI really believe he is reckless with that in terms of a CEOs roll to shareholders.\n\nIf you’ve been around a while, you’ll know this kind of shit always bothers me. He does this at the expense of shareholders.\n\nEnd of rant: bring on the down votes!", "score": 10, "replies": [{"body": ">This is my problem with Musk. He just went and shot his mouth off on Twitter, with nothing to gain.  This flys in the face of the guidance Tesla has issued.   \n>  \n>If you’ve been around a while, you’ll know this kind of shit always bothers me. He does this at the expense of shareholders.\n\nMusk has been doing this for years.  Any long-term investor, or any investor who has done even a minimal amount of research on the company and the man, will know that he has a history of making bold and sometimes inconsistent promises.  \n\n> Now what is an investor supposed to believe.\n\nThe key to understanding Musk is that his timelines are almost always wrong, but that he will eventually accomplish what he said he would accomplish.  The pattern is so very clear, that I am astonished that the TSLAQ crowd generally seems unable to recognize it.  \n\nFalcon 1 was supposed to reach orbit in 2003.  It didn't reach orbit in 2003, but it did reach orbit in 2008.  Tesla Model S was supposed to be delivered in 2010, supposedly from a factory site in New Mexico.  Tesla actually began Model S deliveries in 2012, out of the Fremont California factory.  Over and over again.  Model X was supposed to be a late 2013 product.  It was delivered in 2015 and mass production only started in 2016.  Model 3 was supposed to be produced at 5,000 units/week at the end of 2017.  That didn't happen until 6 months later: Summer 2018.  \n\nThis is the fundamental flaw in TSLAQ thinking.  The general thought pattern of \"Musk did not accomplish goal X at stated time T = company must be fraud/fail\".  This is inevitably followed by rage and disbelief from many, when Musk eventually makes good on goal X. \n\nI have zero sympathy for people who refuse to learn from the past.  In 2012 or even 2015, I could sort of understand why the skepticism persisted.  In 2019, it looks idiotic. ", "score": 10, "replies": [{"body": "> Model 3 was supposed to be produced at 5,000 units/week at the end of 2017.  That didn't happen until 6 months later: Summer 2018.\n\nThat put them within “single digit” weeks of dying. ", "score": 6, "replies": [{"body": "Again, nothing new.\n\nTesla was at the brink of bankruptcy on Christmas Eve 2008, due to the floundering Roadster programme.  Musk himself was near personal bankruptcy after having wired his last 5M $US into Tesla just to make payroll.  Tesla survived by winning a supply contract with Daimler.\n\nNearly the same scenario played out in early 2013 as Tesla struggled to both ramp Model S production and simultaneously convince reservation holders to finalize their orders.  The financial situation was so dire that Musk had employees pulled from divisions all over the company, and had them calling reservation holders to lock in sales.  Somehow, that worked too.\n\nI get that most investors don't want or can't psychologically cope with this high level of risk and uncertainty.  It's the uncertainty that seems to cause TSLAQ to incessantly waste energy bitching and crying.  They'd probably be better served in the long run to buy Index funds at Vanguard, instead of buying things like YOLO puts in an attempt to impress r/wallstreetbets with their Robinhood screenshots, and Tweeting increasingly ridiculous conspiracy theories.\n\nPerhaps that is harsh, but it needs to be said.", "score": 3, "replies": [{"body": "Here's a sneak peek of /r/wallstreetbets using the [top posts](https://np.reddit.com/r/wallstreetbets/top/?sort=top&t=year) of the year!\n\n\\#1: [This guy knows about long term investments.](https://i.redd.it/mnrhc5o8egp11.jpg) | [1061 comments](https://np.reddit.com/r/wallstreetbets/comments/9kaqeh/this_guy_knows_about_long_term_investments/)  \n\\#2: [Made fake tinder of 22 yr old hot girl to solicit financial advice from old men looking for sugar babies](https://i.redd.it/rboh9joiu7411.png) | [883 comments](https://np.reddit.com/r/wallstreetbets/comments/8rdnnk/made_fake_tinder_of_22_yr_old_hot_girl_to_solicit/)  \n\\#3: [Elon Musk and the SEC in a nutshell](https://i.redd.it/p3ck5db1hzo11.jpg) | [743 comments](https://np.reddit.com/r/wallstreetbets/comments/9jn2wu/elon_musk_and_the_sec_in_a_nutshell/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/afd0dd/blacklist/)", "score": 2, "replies": []}]}, {"body": "Again single digit weeks of dying is probably wrong. He makes positive and negative statements that are wrong.\nJust more positive posts on twitter and some of them not a good idea, or posted at the wrong time.", "score": 1, "replies": [{"body": "Sounds more like a Rorschach test.", "score": 1, "replies": []}]}, {"body": "> That put them within “single digit” weeks of dying.\n\nI believe the quote was running out of money, not dying. Your TSLAQ masters tried very hard to blur the two.", "score": 1, "replies": [{"body": "> Musk said the company was \"bleeding money like crazy\" as it worked through the Model 3 production ramp in the spring and summer. He said the company \"came within single-digit\" weeks of death before it was able to meet its Model 3 production goals.\n\nhttps://www.cnbc.com/2018/11/25/elon-musk-tesla-had-single-digit-weeks-before-it-would-die.html", "score": 5, "replies": [{"body": "oh ffs. he is such an idiot. He must have spent too much time reading TSLAQ tweets.", "score": 3, "replies": []}]}]}]}]}, {"body": "It matches what was discussed on the earnings call. In no way is repeating the same guidance reckless. Seems to me like they're becoming more and more confident as they go through the year. Which is good news for longs because that means Tesla is going to make a lot of money. ", "score": 6, "replies": [{"body": "Correct I’ll give you that. Musk said 350,000 to 500,000 on the call. And even then it didn’t align with the shareholder letter. But he gave a large range.\n\nNow it’s just 500,000, that’s a big difference ", "score": 2, "replies": [{"body": "Well not exactly. He said *around* 500k. I read it as him becoming more confident it will be on the higher end of the 350-500k estimate. ", "score": 3, "replies": [{"body": "Turns out he was lying.  Or wrong.  Or whatever you want to call it when the CEO of a major corporation makes false statements to the public.", "score": 1, "replies": [{"body": "Nope it's literally exactly what I said it was. Matched his original guidance exactly of 350-500k. He said around 500k.", "score": 3, "replies": [{"body": "Got it, he was right but retracted his statement just for the lulz.  ", "score": -2, "replies": [{"body": "**clarified** . At no point did he say anything that was outside of the guidance given on the earnings call. ", "score": 3, "replies": [{"body": "Maybe he misspoke on the earnings call?  Seems a little odd that his statement on the earnings call wasn't in line with the numbers in their official investor newsletter, released hours before.  And now he has had to __clarify__ that they won't actually hit that 500k production number.", "score": -1, "replies": [{"body": "What you're saying makes no sense at all. Both his clarification and original tweet are NOT in line with the newsletter. They ARE in line with what he said on the call. ", "score": 1, "replies": [{"body": "His __clarification__ said: \n\n> Deliveries for year __still__ estimated to be about 400k.\n\nThe update letter said:\n\n> In total, we are expecting to deliver 360,000 to 400,000 vehicles in 2019\n\nSo exactly the same, and both in contradiction to the 500k number he gave on the conference call.", "score": 0, "replies": [{"body": "And the earnings call said 350-500k\n\nThe 400k target is in both estimates and the \"around 500k\" remark is only in the later given earnings call estimate. \n\n", "score": 1, "replies": [{"body": "Ok, so we agree the 400k number was given in the update letter and his clarification tweet.  He gave the 500k figure in a tweet that he later needed to clarify he meant 400k.  And he gave the 350k-500k figure on the earnings call.  Right?  \n\nSo I am saying, maybe he misspoke on the earnings call, since that is out of line with the update letter and his clarification tweet, and only aligns with the tweet that he later had to clarify was not what he intended to say.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Man I think your  problem with Musk is that you are a perma tesla bear masquerading as a concerned investor. Your posting history at this sub points to almost a full time job effort.  ", "score": 0, "replies": [{"body": "Of all times to call me out? In the span of 4 hours.\n\nMusk just raised, and then walked back guidance by 20%. \n\nNot to mention he followed up the other tweets, so he was aware this was going on. Probably someone eventually convinced him to go and clarify. I’m sure investor relations was freaking out.\n\nThis was not in the shareholders best interest.....", "score": 1, "replies": [{"body": "I agree that he should not be posting anything like this when the market is open.\nAny savy trader should not be buying and selling purely on the basis of these tweets.\nBut do it after trading, plenty of time to clarify before the market opens.\nI think that the problem is he knows what he means but doesn't think about how others might interpret things.", "score": 1, "replies": []}, {"body": "So he committed a great sin. Definitely securities fraud. Jesus, companies \"miss\" guidance all the time. \nAgain your posting history is extremely parallel to Mark Spiegel's tweeting history. this is a concern for this sub. ", "score": 0, "replies": [{"body": "Not as much as you adding no value", "score": -3, "replies": []}]}]}]}]}, {"body": "That is model 3. The twitter statement is all cars.", "score": 3, "replies": [{"body": "100,000 S & X would mean they’d need 400,000 3.\n\nWhich is 7693/week assuming a 52 week year.\n\nThe 10k 12 hours ago said they are hoping to get to 7000/week at freemont by end of 2019.", "score": 4, "replies": [{"body": "I'd assume that the sustained rate is the minimum rate.  So peak and average would be higher.", "score": 1, "replies": []}]}]}, {"body": ">\tThat’s roughly 10,000 cars per week, when they stated they don’t have the factory capacity for this.\n\n2,000 per week of S and X and 8,000 per week of Model 3 isn’t possible?", "score": 1, "replies": [{"body": "Not according to the 10k.", "score": 5, "replies": [{"body": "What did the 10k say?\n\nEdit for context: that’s 100,000 S and X and 400,000 Model 3", "score": 1, "replies": [{"body": "I but the direct quote below in the thread here.", "score": 3, "replies": [{"body": "But Musk is talking about total cars created right? He’s comparing to when they made zero cars to where this year they expect to make 500,000 cars. This isn’t about Model 3 at all just that Model 3 will make up most of that number", "score": 1, "replies": [{"body": "Could be, even that math doesn’t add up. I did it further down in the thread assuming 100,000 S&X it’s over 7500/week sustained for 52 weeks", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Even with S and X at 100,000 units in 2019 that’s over 7,500/week for the 3 to hit 400,000. That’s more than what their 10k guidance said for 2019 at least from Fremont. \n\nSo even if Shanghai comes on line in Q4 that wouldn’t be enough. ", "score": 1, "replies": []}]}]}]}
{"title": "Long $AMZN. ad revenue reaching 100s of millions of people a day, genius.", "selftext": "", "id": "ashk3d", "created_utc": 1550622526.0, "score": 246, "upvote_ratio": 0.96, "num_comments": 54, "comments": [{"body": "It's really quite genius print advertising. Millions of packages with ads forcing you to interact physically with them as you pick up and open your package.", "score": 77, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "And as long as Amazon keeps it subtle like this, no one will even think to complain. ", "score": 6, "replies": [{"body": "[People eat up the not so subtle versions as well...](https://imgur.com/a/d1YOX2X)", "score": 6, "replies": [{"body": "That movie did really well at the box office too. ", "score": 3, "replies": []}]}]}]}, {"body": "But it’s not tho... You can put ads on toilet paper too but I’m still going to use it to wipe the shit off my asshole. At the end of the day people cut open the box, grab their shit from inside it, then throw the box away without a second thought. Idk who the fuck would pay to advertise on literal trash.", "score": -3, "replies": [{"body": "this is the retardation I come to this sub for", "score": 12, "replies": []}, {"body": "Most people are idiots prone to ads, I bet Reddit ads don’t get nearly as much traffic because mostly people here aren’t morons. I’m not sure specific printing tech would pay off in this case with boxes though so I’m inclined to agree with you ", "score": 1, "replies": []}]}]}, {"body": "Whole new meaning to box spread. It's practically free money. ", "score": 39, "replies": [{"body": "Literally cannot go tits up.", "score": 8, "replies": [{"body": "I like when tits are up tho", "score": 1, "replies": []}]}]}, {"body": "Fuck yeah, daddy bezos is gonna take that ad money from Google and fb.", "score": 67, "replies": [{"body": "and give it to his soon to be exwife, she the real mvp.", "score": 46, "replies": [{"body": "Wonder if she swallows. I should holler", "score": 6, "replies": [{"body": "For 65bln she better had swallowed", "score": 7, "replies": [{"body": "She did. All the gains ", "score": 7, "replies": []}]}, {"body": "For 65bln I'd swallow her and then daddy bezos's seeds bruh", "score": 2, "replies": [{"body": "I could definitely wash the taste out for only $1B. ", "score": 5, "replies": []}]}]}]}]}, {"body": "Holy shit. This is brilliant. How have I never seen this?\nAmazon boxes... that’s literally unlimited ad space. ", "score": 24, "replies": [{"body": "I reckon they didn't do this earlier because having the Amazon boxes just be ads for Amazon was better value. Now they've got their stupidly unassailable market position, advertising themselves is a bit less important and selling the space to third parties makes more sense.", "score": 17, "replies": []}, {"body": "They did it for minions movie years ago", "score": 5, "replies": [{"body": "I’ve clearly been living under a rock. 😂", "score": 1, "replies": []}]}, {"body": "No shit. Just imagine when you save that box and use it to move for the next 10 years...and then ship some junk you sold on eBay.", "score": 7, "replies": [{"body": "The mind boggles", "score": 7, "replies": []}, {"body": "\"Oh neat, The Grinch movie is coming out in 3 months, 10 years ago.\"", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I got ublock origin for my amazon packages. They basically slap a huge red shield sticker on it", "score": 7, "replies": []}]}, {"body": "Except this has been out forever already ", "score": 31, "replies": [{"body": "I live in rural North Dakota. This is the first ad I've seen in weeks. ", "score": 50, "replies": [{"body": "I live in Chicago and I’ve never seen this ", "score": 30, "replies": [{"body": "[deleted]", "score": 13, "replies": []}]}, {"body": "I live in North North Dakota, aka Canada, and have never seen this or any ads and I order at least 1 useless box of shit from Amazon every week because of legal cannabis + Prime next day delivery. ", "score": 17, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I’m pretty sure he’s buying stuff while stoned.", "score": 17, "replies": []}, {"body": "I just checked and I can't find any weed on amazon. ", "score": 6, "replies": [{"body": "Me neither. Short Amazon.", "score": 2, "replies": []}]}]}]}, {"body": "I never saw this is Grand Forks ND", "score": 1, "replies": []}]}, {"body": ">says its been out forever already\n\n>literally fucking  everyone here is seeing it for the first time", "score": 9, "replies": [{"body": "High turnover. This is posted all the time on WSB. While I have never seen it on my packages I have seen it on WSB about 1 dozen times. Again, turnover. The autists here have a higher mortality rate than red eyed fruit flies.", "score": 2, "replies": []}, {"body": "They did the same thing for minions movie years ago", "score": 1, "replies": []}]}]}, {"body": "Wonder Park looks amazing I saw the trailer during Ralph Breaka the Internet ", "score": 3, "replies": []}, {"body": "I have been wondering for long why they are not doing it on every package yet.", "score": 3, "replies": []}, {"body": "I am in the advertising industry and the idea to sell package spaces has been around for a few years. There are even marketplaces to buy these ad placements. Amazon entering the game was expected", "score": 3, "replies": []}, {"body": "They’ve been doing this since 2013..", "score": 2, "replies": []}, {"body": "LOL “hundreds of millions of people every day”\n\nNot quite ", "score": 2, "replies": []}, {"body": "I remember someone on LinkedIn predicting that Amazon will do exactly this. Here we are", "score": 2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "This was honestly my first time seeing it and I've been ordering for years. ", "score": 0, "replies": []}]}, {"body": "Someone on wsb said it too", "score": 2, "replies": [{"body": "Yep I remember that from a few months ago", "score": 3, "replies": []}]}]}, {"body": "Long Amzn, I work there. We don’t even pay for the boxes anymore, whoever is sponsoring the ad pays for the boxes. We always have a sponsor ", "score": 2, "replies": []}, {"body": "This and counterfeit books. I think I have to buy this for my first trade.", "score": 1, "replies": []}, {"body": "I've gotten a bunch of packages from them advertising the new Silverado. Not like this. The entire box was covered in an ad. At first I didnt know it was from Amazon because it didnt have the amazon binding.", "score": 1, "replies": []}, {"body": "My license plate is specialized, my donation to my state cost only $50:  AMZN.   You think I'm joking?  I'm not joking.  ", "score": 1, "replies": []}, {"body": "man they have a monopoly ", "score": 0, "replies": [{"body": "I think that is the real risk for amzn. Sure they stuck it to nyc because of politics, but give it time.. politicians will make a monopoly claim. In the meantime I think they moon.\n\nCurrently not holding position but may take one in next 48 hours. Putas", "score": 0, "replies": []}]}, {"body": "Literally cannot go tits up!", "score": 0, "replies": []}, {"body": "I read reaching all the gay. This packaging is also reaching the gays.\nPrice action zero", "score": 0, "replies": []}]}
