{"title": "$TSLA & $AMZN", "selftext": "[removed]", "id": "howwrt", "created_utc": 1594414169.0, "score": 66, "upvote_ratio": 0.81, "num_comments": 76, "comments": [{"body": "Everyone is a genius in a bull market", "score": 58, "replies": [{"body": "That’s Bull", "score": 9, "replies": [{"body": "Ha, I see what you did there", "score": 2, "replies": [{"body": "Bulloney", "score": 3, "replies": []}]}]}, {"body": "Apparently, not Buffet. Too soon?", "score": 2, "replies": []}]}, {"body": "That soon shall pass", "score": 62, "replies": [{"body": "Yep I finally bought in so market def crashing Monday", "score": 68, "replies": [{"body": "Thanks for the heads up. I’ll tell all my buddies to pull out on open or PM.", "score": 2, "replies": [{"body": "See what’d I tell you", "score": 1, "replies": []}]}, {"body": "Thank you I have VXX calls.", "score": 2, "replies": []}]}]}, {"body": "I decided that I was going to hold AMZN forever, so I don't really care if it drops and takes 5 years for me to make a profit", "score": 21, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "good luck man, another crash is inevitable, stay afloat", "score": 3, "replies": [{"body": "Stop losses keep you in the green", "score": 1, "replies": []}]}]}]}, {"body": "People are just looking for safe places to put their money and make some returns.  Large cap tech and growth companies benefit in a low interest high liquidity environment.  If you want to know when to pull out of these stocks just watch the actions (and signals) from the federal reserve.  Once they take their foot off the gas it's time to pull out.  That has been the lesson of the past decade in my opinion.", "score": 10, "replies": []}, {"body": "I bought at $250 and sold at $290 I feel bad about it pretty frequently", "score": 6, "replies": [{"body": "I feel bad about not buying more in the 200s when I strongly believed in Tesla going to the moon a year ago.", "score": 2, "replies": [{"body": "Autsch... Probierst mal mit nikola 😂", "score": 0, "replies": [{"body": "Eher nicht", "score": 1, "replies": []}]}]}, {"body": "Oof", "score": 0, "replies": []}]}, {"body": "I sold my Tesla at $1380 today. I’m sad", "score": 20, "replies": [{"body": "That's ok, you can buy it back next Tuesday at 1350 and ride it back up to 1500+ on Friday. Rinse and repeat", "score": 10, "replies": [{"body": "That’s exactly what I’ve been doing all week- buying and selling between $1370 and $1400 several times instead of just holding and seeing it go from +$150 to -$50 30 times in a week", "score": 8, "replies": []}, {"body": "You're close enough, now let's see how is it gonna be on Friday!", "score": 2, "replies": []}, {"body": "How likely is that?", "score": 1, "replies": [{"body": "Just my opinion considering how volatile the stock is.", "score": 1, "replies": [{"body": "true", "score": 1, "replies": []}, {"body": "Remindme! 3 days", "score": 1, "replies": [{"body": "Remindme! 3 days", "score": 1, "replies": []}]}]}]}]}, {"body": "One thing I learned in my short time : NEVER SELL", "score": 19, "replies": [{"body": "You might learn that's wrong too at some point. Sometimes when a valuation becomes highly irrational the risk of holding it because far great than the slim chance of further upside.\n\nGiven how fast it's rocked up TSLA could quite easily fall 30% next month. I suppose it could go up 30% too, but it has absolutely no reason to.\n\nI personally don't like holding stocks that are significantly above my highest price target.\n\nBut the kind of FOMO happening in TSLA right now is something I've seen far too many times. We saw this with weed stocks last year and $SPCE and $NKLA are another two more recent examples. Perhaps they'll all be higher at some point, but in the short-term the kind of moves $TSLA is making are never sustainable.", "score": 12, "replies": [{"body": "comparing SPCE and weed stocks to TSLA *smh*", "score": 3, "replies": []}, {"body": "im thinking its exactly like weed stocks, how many people have been burned and bag holding since I can't even imagine", "score": 1, "replies": []}]}, {"body": "No no. *Never forget to set a stop loss", "score": 3, "replies": [{"body": "Robinhood has glitches with order types. It executed my transaction even when the stock didn’t fall to my stop loss price.", "score": 6, "replies": [{"body": "Ahh gotcha. A lot of my friends have had issues with Robinhood as well. Many have of them have dropped the platform in favor of Ameritrade, Webull, etc.", "score": 1, "replies": [{"body": "Those platforms are commission-free?", "score": 1, "replies": [{"body": "I'm not too sure but I believe so. I'm on Fidelity myself and that is commission free.", "score": 1, "replies": []}, {"body": "As somebody who has dabbled with a lot of different platforms I can say they are both commission free.  TD gives you access to think or swim plus OTC which is huge but webull is great too for its powerful app and crazy long after hours plus stock bonus for signing up.  I currently use both.", "score": 1, "replies": []}]}]}]}]}, {"body": "Not so — cash in the bank is the goal not playing the odds - learn to separate emotions from nice wins in crazy momentum stocks - if the pros knew it was going to race to $1400 they would have been screaming BUY - but no one can overestimate ELon,s fan club and he makes them $$ The masses are genetically wired to seek out heroes — play their game but jump out early and YOU win with a nice cash prize for your efforts - GLT", "score": 1, "replies": []}, {"body": "[https://i.ytimg.com/vi/pS28VgKwNVg/maxresdefault.jpg](https://i.ytimg.com/vi/pS28VgKwNVg/maxresdefault.jpg)", "score": 1, "replies": []}, {"body": "Buffett said the same thing.", "score": 1, "replies": []}, {"body": "Well this is a stupid idea...", "score": 0, "replies": []}]}, {"body": "I sold at 1085 thinking it's coming down :(\n\nIt still might come down a few hundreds.", "score": 2, "replies": []}]}, {"body": "Give it a little time.", "score": 4, "replies": []}, {"body": "remindme! in 1 year", "score": 3, "replies": [{"body": "I will be messaging you in 1 year on [**2021-07-11 02:11:10 UTC**](http://www.wolframalpha.com/input/?i=2021-07-11%2002:11:10%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/howwrt/tsla_amzn/fxlg3vo/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fhowwrt%2Ftsla_amzn%2Ffxlg3vo%2F%5D%0A%0ARemindMe%21%202021-07-11%2002%3A11%3A10%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20howwrt)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "I sold my Tesla like $500 during the virus , everyone was selling on here so I did too", "score": 4, "replies": []}, {"body": "same with MSFT", "score": 5, "replies": [{"body": "After watching MSFT passively for a few years and working in their engineering department, I think it can hit 250+ by January. Long holding.", "score": 6, "replies": []}]}, {"body": "Just buy them and don’t look at them for the next few years. You definitely won’t regret it", "score": 4, "replies": [{"body": "I wouldn't buy Tesla even if it dipped to $5 tomorrow. I understand it has a lot of 'potential' and has some great technology behind it, but without any realised earnings so far I can't hold faith.", "score": -16, "replies": [{"body": "Yeah, you’re full of shit...", "score": 14, "replies": [{"body": "Well we'll see how their stock is faring in 2 years.", "score": -5, "replies": [{"body": "I've been watching this stock from the very beginning. I've lost track of how many people have said this exact same thing over the last 10 years.", "score": 0, "replies": []}]}]}, {"body": "I’m assuming you’re the one who bought my puts", "score": 5, "replies": [{"body": "I don't touch options. And even if I did, I would stay well away from tesla/amazon right now.", "score": -2, "replies": []}]}, {"body": "Everyone ignore this dumbass", "score": 1, "replies": []}, {"body": "Lol I bet you invest in WM and T", "score": 0, "replies": []}]}]}, {"body": "FDIS", "score": 2, "replies": []}, {"body": "Bad luck in just a week TSLA just increased from 1,300-1,500", "score": 2, "replies": []}, {"body": "I remember 2 years ago, thinking both stocks were out if my price range....", "score": 2, "replies": []}, {"body": "Don't ever bet against Elon Musk & Jeff Bezos.", "score": 2, "replies": []}, {"body": "Just buy QQQ", "score": 2, "replies": [{"body": "QQQ is the new SPY\n\nhttps://imgur.com/gallery/hAaUZRa", "score": 1, "replies": []}]}, {"body": "If you believe in the companies and want to invest, why not dollar cost average into a position. Takes away the risk of timing the market.\n\nHere's a great article:  [http://thinkingforward.site/dollar-cost-average-investment-strategy/](http://thinkingforward.site/dollar-cost-average-investment-strategy/)", "score": 2, "replies": [{"body": "Timing the market never worked for me but It feels very high to buy atm", "score": 2, "replies": [{"body": "I agree!", "score": 1, "replies": []}]}]}, {"body": "I feel bad buying this high, I’m just hoping to sell because other than short shorts there’s a little dot com bubble vibe", "score": 2, "replies": []}, {"body": "The more people enter short positions, the more it rises", "score": 1, "replies": []}, {"body": "I've simply been getting paid on reverse iron condors. It has felt like the safest trades I've ever made.", "score": 1, "replies": []}, {"body": "Puts galore on amzn. Short term that is", "score": 1, "replies": [{"body": "Seems like a good way to lose money. I keep thinking it can’t go up anymore but it always does. It hardly ever has a red day.", "score": 2, "replies": [{"body": "Greed has a limit. Irrational exuberance", "score": 1, "replies": [{"body": "Yes, but you never know when that will be. Bubbles can continue for months or even years", "score": 1, "replies": [{"body": "Presidential election soon. 🤑🤑🤑🤑", "score": 1, "replies": [{"body": "If you’re expecting Biden to win, and stocks to go down as a result, you should buy puts closer to the election. Otherwise you’re paying more than you need for the added time value", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Robinhood option sellout process sold my contract at a loss.", "selftext": "Bought a TSLA $1500c 7/10 for $27.45 at top like an idiot. Diamond hands and watched it lose up to -90%.\n\nWatched it mooned today and broke even. Robinhood proceeds to auto sell it for $5.15. ->https://i.imgur.com/XWTiNgK.png\n\nhttps://i.imgur.com/zf8OALE.png\n\nHere a screenshot of what could've been. https://i.imgur.com/YgBRyoR.png\n\nYeah I am retarded.", "id": "hozw3t", "created_utc": 1594424712.0, "score": 22, "upvote_ratio": 0.79, "num_comments": 86, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|12 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=hozw3t)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=hozw3t)", "score": 1, "replies": []}, {"body": "Contact support and threaten to sue", "score": 24, "replies": [{"body": "I'm sure they will believe he can afford it given his balance. Lol", "score": 13, "replies": []}, {"body": "Doubt I have any leg on this. \n\nWill someone confirm this is be true by calling me a retard? \n\nThanks.", "score": 5, "replies": [{"body": "If u have lawyer friends it’s even better if they send the email. they shouldn’t have sold ur call considering it wasn’t on margin. If u held till close/expiry then it would have executed itm. What I can see happened here is Robinhood bought your call themselves at a price they set aka that -90% loss on your end then they went and sold it for the actual price on the free market.  So yea you have a solid case. The call was $44 ITM so you should have gotton at least $4000 for it if it executed. You shouldn’t be using Robinhood if u have lots of money because they do steal a lot. Very shady company hence why only autists use it. But do contact them and use these arguments especially the execution one. Don’t settle for pennies, rather if they offer a proposal ask for ur money back and a lifetime of Robinhood gold to compensate or some additional money because they wasted ur precious time. U can even start a class action lawsuit and have the entire wsb back u up.", "score": 18, "replies": [{"body": "I did not have enough funds to exercise it and have no intention to exercising it. \n\nWhat you says seem to be eerily true when Robinhood sold my contract.\n \nBut what can I say when their inevitable response of their \"Risk Check\" working as intended?\n\nAppreciate the response.", "score": 3, "replies": [{"body": "The way contract excercise is the broker does the buying and selling if u don’t have the funds so you receive the profit. In this case you receive $4000\nAs for what to say I’m not too familiar with what that system says but this is what you say “as far as I’m concerned my contract exercising would have yielded me at least 400% more money than what it was sold for, the system has to be at some error because execution profit is the minimum and option contract is worth and that worth increases when you include variables such as implied volatility which is mega high on tsla” then you proceed to say shit like Robinhood stole the contract and sold it. And how what they did is blatant theft and is illegal. But only get to this far if they refuse to accept that their system made a mistake and that they owe u the contract value. You can say that your contract was at no risk at all because it could have simply expired worthless. I personally have had several contracts expire worthless and never seen this happen so u can also say like “ so the system only sees it as a risk when I’m making money” and shit like that.\n\nU wanna start passive and be like “I think the system is broken” then explain what happened. If they deny then throw some shade and ask for legal documents like “who do I contact” or “whose in charge” and shit like that while also asking “ I would like a copy of the risk management and user agreements for review because I got robbed and this is very serious because other can also be getting robbed like me” then if they provide such stuff and they still don’t budge then send the first long thing I told u to say. If they never budge then do contact a lawyer and see what they have to say. Filing a class action is usually free as well but it might cost u a few hundred bucks but it’s always worth to ask. Some lawyers give advice for free. But tbh I see no reason why they scuffed ur contact when it was deep ITM\n\nI’m no lawyer btw but I’m simply using common sense here and I’d personally contact a lawyer if they don’t refund me. If it’s legit fraud this could destroy the company. In some cases contracts show inflated prices due to glitches and Robinhood being shitty. So idk if ur call was worth the 20k but since it’s ITM it was def worth at least 4K and not $500.\n\nEDIT: I check time and when they sold tsla was under $1500 so ur contract was technically worthless. U can still try and claim shit like “ I did TA and it should have closed ITM” but idk lol seems ur outta luck but it’s always worth shooting ur shot. U were ATM though so $500 is a bit too little imo they def scuffed u and stole ur money on purpose aka sold contract on side for more but I’m not sure if u can do much without having an actual lawyer interfere.", "score": 6, "replies": [{"body": "‘The way contract excercise is the broker does the buying and selling if u don’t have the funds so you receive the profit’ \n\nNo that is not accurate. The broker has the right to sell your options if there are In the Money or At the Money, if you don’t have funds to cover it. \n\nImagine the consequences if brokers start exercising options for people who have no funds to cover the trade and the stock crashes ?\n\nBroker has no obligation to keep your option trade open if you don’t have funds to take assignment of shares.", "score": 3, "replies": []}, {"body": "Yeah feels like I'm fucked. \n\nWhat I don't really understand is WHY they sold it when it was OTM or potentially being ITM. And why can't they let it expire worthless even when ITM. \n \nAgain appreciate the response and help.", "score": 2, "replies": [{"body": "An option can’t expire if it’s ITM. You have to sell it or take delivery of shares. But you’re right they should’ve not sold it unless it was ATM or ITM. Most of these processes are automated so not sure if the bot saw it ATM and sold it. TSLA was moving wild today so bot probably had a wide range when monitoring calls owned by individuals who don’t have funds to take assignment.\n\nAlso unless you had $147,000 available cash/on margin they have right to sell the call if ITM ~ 1 hour before close.", "score": 2, "replies": [{"body": "You can expire an option worthless ITM if you wanted.  Long option holders have the ‘option’ to exercise.  Short option holders are at the mercy of the long option holder.  Just FWIW", "score": 1, "replies": [{"body": "As far as I understand, an option has a deliverable of 100x shares if ITM. The only way you not take delivery is by selling the option.", "score": 1, "replies": [{"body": "Not true.  If a stock is only 1c ITM I’ve on multiple occasions elected to expire worthless (professional trader)", "score": 1, "replies": [{"body": "What if it’s deep ITM though ?", "score": 2, "replies": [{"body": "Then of course I’ll elect and not give up the premium.  If for some fucked up reason you didn’t want to you could still in theory expire then worthless.  (I’m sure the prime broker would take the position in majority of cases). \n\nBut say for example you’re $1 ITM and calls expire on a Friday.  Friday 4:01 PM hits and there’s news about fraud in the stock- stocks trading down in after mkt $5.  call up the broker and tell them to not exercise the position.  Rare occurrence but you can do it", "score": 1, "replies": [{"body": "Right I’m sure in certain rare cases it might be possible but 95% of the times you’ll be liable to take delivery of the contract. Also for people using RH I’m pretty sure they’ll just screw you over and in most cases (atleast on WSB) people don’t have enough funds to cover the assignment so the broker just reduces risk by selling the contract.", "score": 1, "replies": [{"body": "A call holder has the right, but not the obligation, to buy the shares. In other words, it's optional. Of course, if it is ITM, it makes sense to buy the shares at the strike price, then sell at current price for profit. In this case, there was no risk to Robinhood and they should not have done a risk assignment trade.", "score": 2, "replies": [{"body": "Right but again you have to sell the ITM call option if you don’t want to exercise. RH didn’t do an early assignment. RH say the user has an open call option which might be ITM and since the user didn’t have funds to cover the assignment, sold the call", "score": 1, "replies": [{"body": "Does this conclude that I am shit out of luck? And that there's no hope that I would receive a noble response from RH.", "score": 1, "replies": []}, {"body": "In most brokerages, and I think Robinhood included, exercise is not the default action and you must explicitly tell your brokerage you want to exercise the option. In this case, if the user holds the ITM contract to expiration, but decides not to exercise the option, then it expires worthless to the user. The brokerage might on their own exercise it, sell the shares, and keep the profit.\n\nIn any case, because there was no risk to Robinhood, they should not decide when to sell the call. If the option \"might be ITM\", even if the user does not have the funds, the call would have intrinsic value that the user could sell back if it does go ITM. The decision to sell should have been on the user's, not Robinhood's.", "score": 1, "replies": []}, {"body": "I looked into it, and some brokerages do exercise automatically ITM calls at the end of the day, unless you call them, at which point it would expire worthless to you. I still haven't heard of brokerages selling an OTM call early.", "score": 1, "replies": []}, {"body": "You are correct in Robinhood's policy:\n\nhttps://robinhood.com/us/en/support/articles/expiration-exercise-and-assignment/\n\nIf you have a long call about to expire:\n\nIf the contract is in the money or at risk of being in the money, we’ll assess your account to see if you have enough cash to buy the shares.\n\nIf you don’t have enough cash to buy the shares, we’ll attempt to sell the option. For example, if you have 10 contracts, but enough cash to only buy 500 shares, we’ll attempt to sell 5 contracts and allow 5 contracts to be exercised for a total of 500 shares.", "score": 1, "replies": []}]}]}, {"body": "Yeah my point is the only person liable is the person short the option.  Long option holders have 0% liability-  it’s their option to elect or expire worthless", "score": 1, "replies": []}]}]}]}]}, {"body": "Quick question. Robinhood executed the sale of 2 different contracts for $1 each that I was planning to let expire worthless. They then hit me with a restricted account for PDT violation for exceeding 4 trades in 5 business days. Since I was not the one who executed the sales should those two be counted against me?", "score": 1, "replies": [{"body": "Yes. Even though you didn’t physically execute the trade, if you have an option that was exercised that counts against your trades since RH executed those on your behalf.", "score": 1, "replies": [{"body": "Thank you, they also just now executed a 0dte contract when I was ITM, literally as soon as they sold it on me the contract price more than doubled :( why do they do that?", "score": 1, "replies": [{"body": "Usually they will sell contracts ITM if you don’t have sufficient funds to exercise it roughly an hour before closing. Can’t really do much there except either putting more cash into your account or moving to a better broker where you can call and ask them not to sell and that you’re keeping an eye on it and will sell before market close.", "score": 1, "replies": []}]}]}, {"body": "What in this scenario? I had option put buy in the money but robinhood sold out my option automatically . There is no chance in option buying to get assigned in any way intead of selling an option but this is worst", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "never seen rh sell before expiry unless its part of a spread. were u margin called or something?", "score": 7, "replies": [{"body": "RH will auto sell options that may expire in the money when the account  holder doesn't have enough buying power to cover. In this case, OP doesn't have the funds to buy 100 shares of Tesla, so RH autosells the option an hour before close (expiry).", "score": 10, "replies": []}, {"body": "He doesn’t have funds to cover, so can’t really be assigned without major risk to the broker. TOS will do this too.", "score": 4, "replies": [{"body": "Aren’t brokers supposed to exercise the contract and then automatically sell it? I was under the impression that they handled the transaction if it’s exercised ITM", "score": 5, "replies": [{"body": "Yes and no, it depends on their risk exposure. If you have more funds, but not all, then they might let you be exposed to market risk. If you have a small account, they know they’ll get nothing if you get pinned, so they force the account to sell.", "score": 1, "replies": [{"body": "What if it’s something like a debit spread?", "score": 1, "replies": [{"body": "Not 100% here, but depends on how deep ITM you are. I know I had ToS sell a debit spread on me on the last day before. If you only have your long leg ITM, then you’re exposed to pre market since the short would never be exercised. \n\nIf you’ve never heard of pin risk, it’s definitely something to look into and be aware of. A lot of people don’t know about it, but it could fuck your life up if you get pinned on a bunch of contracts. With spreads, max risk is only max risk in theory. A spread that expires between legs throws your max risk out the window and exposes you to afterhours on Friday, and premarket on Monday. Assignment takes place on Saturday when you can’t actually buy/sell anything.", "score": 1, "replies": [{"body": "So I’m on Fidelity, say I do a debit spread but I don’t have the cash to exercise the call I bought. Is there a chance that they auto sell that call leaving me on hook for the 100 shares if the one I sold gets exercised?", "score": 1, "replies": [{"body": "They should sell any leg on the spread alone, it should always be both. Since you use a real broker, it’s best to call them and confirm it. I know TD helped me out with a bad credit spread and told me to call them anytime. \n\nThe example you’re giving is what would actually happen if they didn’t sell your spread and the market closed between legs. This is also where pin risk comes from, and the reason they close it early. Example: say WSB is trading at $1000 at close, right on your long strike. You get assigned 100 shares and you’re now -$100,000. Since your short expired worthless you would sell these at market. The issue is, assignment happens on Saturday, and the market isn’t open. So, say WSB announces bankruptcy (for the sake of severity here), you come in Monday and the price immediately tanks to $10 a share. You now have to sell at market and collect $1000. However, you owe the broker $99,000 in margin. That’s pin risk, and the reason why they close it.", "score": 2, "replies": [{"body": "Wait but I don’t sell at market, I’m selling the shares I got assigned when my call at strike A was exercised to the person who bought a call from me at strike B. Since the calls expire Friday and thus in this scenario are ITM wouldn’t the person who owns it 100% exercise it?", "score": 1, "replies": [{"body": "This only works if both legs expire itm. Since you obviously do not sell a short with the same strike as your long, there absolutely is the chance that 1 leg expires OTM, while the other leg expires ITM. If 1 leg expires OTM, then that leg would never be exercised, and the other half of the spread gets exposed to market values. \n\nAlso, 4pm is not the only time someone can exercise. It goes up until 530p et. If your leg goes ITM at 5:25, but was OTM at 4:00, then you can exercise. \n\n\nThis article can probably explain these scenarios the best. \n\nnasdaq.com/articles/automatic-exercise-after-hours-risk-and-other-options-expiration-issues-2010-11-18", "score": 1, "replies": [{"body": "Oh I see, so the risk is that if for whatever reason the other person doesn’t exercise and the price drops after hours, I have now payed for 100 shares at a price far over what it currently is.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I think every broker does this.", "score": 1, "replies": []}]}, {"body": "Not enough buying power to cover the exercise.", "score": 2, "replies": []}, {"body": "Does TDA do this as well?", "score": 1, "replies": []}]}, {"body": "When will people understand??? Post like these proves me right everyday", "score": 20, "replies": [{"body": "I’ve posted so many times kids under 25 should not be allowed to fuck with options. They are still retarded children", "score": 13, "replies": [{"body": "I’m over 25 and still retarded with options.\n\nWhat does that make me?", "score": 21, "replies": [{"body": "Similar to me but hope you have a good job to support the autism", "score": 2, "replies": []}, {"body": "A bitch", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I mean it’s expiring today u gotta be a dumb child not to go hey maybe I should call and ask when they close shit out\n\nI did that when I started options with tda. How can u not verify that shit 🤦🏻‍♂️", "score": 3, "replies": []}]}, {"body": "im 14", "score": 1, "replies": []}]}]}, {"body": "Next time put an order in way above ask. They won’t auto sell while you have pending order. You have to watch though since they will cancel that order and try to auto sell, but it gives you chance to put in order when you get cancel notice", "score": 7, "replies": [{"body": "So if he does that then that basically buys him time to sell at the going rate?", "score": 1, "replies": [{"body": "Typos above. I meant to say when he gets notice that his pending way above ask order is canceled it gives him chance to put another one in way above ask and buy more time. If you are not quick they will cancel and auto sell at market price.", "score": 1, "replies": []}]}, {"body": "Wish I have known this earlier before watching it torture me by going up.", "score": 1, "replies": []}]}, {"body": "They say in the terms that options will be sold about an hour before “at their discretion”. I would definitely lose your shit on them. It’s enough money that it’s worth making a big deal over. But for next time you gotta know to sell before 2pm if you’re option expires that day because I think legally they can sell it for whatever they want but that’s clearly an egregious difference given the market and the open interest. Not like it’s a random stock with no takers.", "score": 6, "replies": [{"body": "I would've had sold for a loss before 2pm. It started going up after it was auto sold.", "score": 2, "replies": [{"body": "Ah gotcha. Damn that’s tough man sorry to hear that. I’d still try to do something bc that clearly was nowhere near the best price. You’ll be able to make it up on another trade though", "score": 1, "replies": []}]}]}, {"body": "Well you learned your lesson and the tuition was expensive, time to move away from the Mickey Mouse brokerage huh..", "score": 4, "replies": []}, {"body": "Why's everyone always so furious when this happens? They clearly state \"if you don't have enough money to exercise we sell the option an hour before expiration\". If you want to keep your options that extra hour, use another broker.", "score": 3, "replies": []}, {"body": "All brokers do this to people who can't afford to be exercised on.\n\nThey sell usually 1 hour before close.\n\nThis has been posted multiple times from RH users.", "score": 2, "replies": []}, {"body": "stop doing credit spread on robinhood it's terrible", "score": 2, "replies": []}, {"body": "How much time did you have left before they auto sold?", "score": 1, "replies": [{"body": "They sold it at 2:49 pm.", "score": 3, "replies": [{"body": "My Nio also auto sold at 2:49 PM today.", "score": 4, "replies": []}]}]}, {"body": "Yea I was in a mad dash to clear some capital today as My 7/10 Netflix calls had bent me over I did manage to scalp one however [tsla](https://imgur.com/gallery/uT3qNvW)", "score": 1, "replies": []}, {"body": "Margin called", "score": 1, "replies": []}, {"body": "Yep thats why I sold at 1:59 on RH even though it was going up. My call was for $1470, I had two that I bought yesterday for 7.68,  they were 24.50 when I sold. I checked the price through webull later and they were up to 68.00 at 3:50PM but I didn't know what would happen if I held onto them and didn'twant to risk it. So would they have sold for whatever the price was? I tried to find the info but couldn't find anything", "score": 1, "replies": []}, {"body": "Yur d0nation to actblue has been received.", "score": 1, "replies": []}, {"body": "What was your purchasing power at the time your option was sold? I had a similar experience with sold covered puts been automatically bought back with ~$57k in purchasing power. (Trying to guess the minimum purchasing power needed to avoid auto Robinhood selling / buying info request.)", "score": 1, "replies": [{"body": "Around 2.5K", "score": 1, "replies": []}]}, {"body": "Didnt your mommy ever teach you its dangerous to pick up pennies infront of a steamroller", "score": 1, "replies": [{"body": "No, I was taught to hold until expire worthless.", "score": 1, "replies": []}]}, {"body": "A call holder has the right, but not the obligation, to buy the shares. In other words, it's optional. Of course, if it is ITM, it makes sense to buy the shares at the strike price, then sell at current price for profit. In this case, there was no risk to Robinhood and they should not have done a risk assignment trade.", "score": 1, "replies": [{"body": ">A call holder has the right, but not the obligation, to buy the shares. \n\nThis is what I believe. But everyone says the RH would take the risk if I don't have enough funds to cover. \n\nWhy can't it simply expire then or because it doesn't work that way.", "score": 1, "replies": [{"body": "Was this a straight up call, and not part of a spread?", "score": 1, "replies": [{"body": "Correct, this was one call only, bought on 7/7.", "score": 1, "replies": [{"body": "I looked into it, because I disagree with Robinhood. But unfortunately, this is a Robinhood policy and not an option-trading rule:\n\nhttps://robinhood.com/us/en/support/articles/expiration-exercise-and-assignment/\n\nIf you have a long call about to expire:\n\nIf the contract is in the money or at risk of being in the money, we’ll assess your account to see if you have enough cash to buy the shares.\n\nIf you don’t have enough cash to buy the shares, we’ll attempt to sell the option. For example, if you have 10 contracts, but enough cash to only buy 500 shares, we’ll attempt to sell 5 contracts and allow 5 contracts to be exercised for a total of 500 shares.", "score": 1, "replies": [{"body": "RIP me.\n\nThanks for confirming. I still will contact them out of self-hate.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "why did Robinhood autosell it, did you set a stop loss", "score": 1, "replies": []}, {"body": "Pay or owe, correct. “Max loss” really only works when the entire spread works.  A lot of people don’t actually know this, and it’s extremely dangerous, so I try to warn as many people as possible. Best thing to do is just take your wins/cut losses before the last day.", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "F for respect bro", "score": 1, "replies": []}, {"body": "You're retarded for trading on robinhood.", "score": 1, "replies": []}, {"body": "Shutup dude this story makes no sense", "score": -6, "replies": [{"body": "I'm suppose to be the retard here, you douche waffle.", "score": 6, "replies": []}]}]}
