{"title": "Bezos life story and Amazon seed capital a fairy tale?", "selftext": "Do you retarded autists actually believe Bezos founded Amazon with a $300,000 investment from his parents? He worked 5 years at a hedge fund as a key exec. He didn’t meet any wealthy people who backed him? The hedge fund didn’t invest? He didn’t make major dough at the hedge fund that he invested? He also graduated summa cum laude at Fuckin Princeton. People at a hedge fund would be falling over themselves to invest w a guy w that background. Bezos story is BS. If you believe it I have a miracle cure for the beer virus for you to invest in.", "id": "i006h2", "created_utc": 1596027184.0, "score": 101, "upvote_ratio": 0.72, "num_comments": 79, "comments": [{"body": "[deleted]", "score": 219, "replies": [{"body": "dear wsb\n\ntoday i cry because life not fair\n\npls congress pls rip bezos a new one\n\ni run out of money on puts\n\nsigned,\n\n/u/HTleo", "score": 114, "replies": [{"body": "Lol. You bottoms get nasty when your gay lovers don’t use lube.", "score": -53, "replies": [{"body": "dear wsb\n\ntoday bad man make fun of me on your website\n\ni told him he is gay man, likes butt sex!\n\nhahah! i am funny!\n\npls congress give me more money for puts. \n\ni will be a good boy.\n\nsigned,\n\n/u/HTleo", "score": 77, "replies": []}]}]}, {"body": "my question is who the fuck came all the way over here from r/business to upvote this", "score": 13, "replies": []}]}, {"body": "I dont give a shit how bezos made Amazon", "score": 138, "replies": [{"body": "this right here", "score": 30, "replies": []}]}, {"body": "[deleted]", "score": 42, "replies": [{"body": "Never said that. All I said is that I don’t believe his backstory and where he got the money. You incels really lap up the kool-aid.", "score": -18, "replies": [{"body": "chilly room temp iq", "score": 14, "replies": [{"body": "Lol", "score": 2, "replies": []}]}]}]}, {"body": "As an amazon driver, you can suck my soft dick", "score": 22, "replies": [{"body": "Had you bought AMZN calls it would be hard", "score": 8, "replies": []}, {"body": "cuck", "score": 1, "replies": []}, {"body": "Sucks to be you.", "score": -10, "replies": []}]}, {"body": "Lol what do you think the average pedigree of a DE Shaw employee is? People there & Rentek are scary smart", "score": 6, "replies": []}, {"body": "300k\n\nThe 3...important symbolism", "score": 6, "replies": [{"body": "33", "score": 1, "replies": []}]}, {"body": "Bezos was by FAR the best testimony thus far. He knocked it out the park.  \n\n\nPraying Zucks start drowning rapidly. I think my prays fell upon deaf ears.", "score": 5, "replies": []}, {"body": "Look into his family history and you’ll see he’s ‘self made’ the same way bill bates is.. aka being born into an elite family. Any billionaire that claims to rise from nothing is in reality being handled to maintain the illusion of capitalism.\n\nAlso his name isn’t Jeff Bezos it’s Jeffery Jorgensen", "score": 42, "replies": [{"body": "All of them are privileged. You can only drop out if your family is rich", "score": 20, "replies": [{"body": "He didn't drop out tho, homie went to Princeton for computer science.", "score": 1, "replies": []}]}, {"body": "Dr.Dre comes from a family of elites who happened to live in the Compton ghettos?", "score": 10, "replies": [{"body": "Black people of a certain disposition don't count into this statement.", "score": 10, "replies": []}, {"body": "How else would he have paid for medical school? He didn’t want the burden of student loans.", "score": 2, "replies": []}]}, {"body": "Success never counts unless you are a filthy street urchin with an amputated leg, a speech impediment, autism and a lazy eye.\n\n&#x200B;\n\nOh wait...it does...which is why I have all this cash from AMZN.", "score": 10, "replies": []}, {"body": "What about mark zuckerberg?", "score": 6, "replies": [{"body": "Well he didn’t ‘create’ Facebook if that’s what you mean & the movie “The Social Network” is essentially what propaganda looks like. \n\nDARPA/Pentagon was working on a project called LifeLog which was designed to collect and track data on the populace. Important side note the LifeLog program ended the exact same day as Facebook was originally launched, February 4th, 2004.  \n\nSo yes there’s no doubt in my mind that Facebook is a military project posing as a civilian one, a true Trojan horse.", "score": 17, "replies": [{"body": "This is some truly higher dimensional autist.", "score": 12, "replies": []}, {"body": "Wtf", "score": 12, "replies": []}, {"body": "Oh boy. That escalated", "score": 4, "replies": [{"body": "Am I wrong though", "score": 1, "replies": [{"body": "Could be a possibility, but I cannot easily believe that a quite simple Harvard student would be implicated in a DARPA/Pentagon project", "score": 5, "replies": [{"body": "Fair enough but military & the intelligence community often recruit from Ivy League schools. For example, the CIA are often Yale skull & bones members. Along with numerous MKultra studies happening on campuses(Unabomber for example)", "score": 2, "replies": [{"body": "Every elite major organization recruits from ivy leagues", "score": 2, "replies": []}]}]}]}]}, {"body": "Damn, my third eye (and asshole) is now open. Sounds interesting man, I’m gonna try and change the world anyway. if I fail I will just scream favoritism", "score": 3, "replies": []}, {"body": "Saw this in a documentary that was a bit more largely scoped about military & DARPA involvement in Silicon Valley in general. Scary and eye-opening stuff, but it does make a lot of sense. DoD pockets run DEEP.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Pretty simple explanation, make the illusion believable. Most CEOs are only put in those positions because they’re complicate with the global agenda.", "score": 1, "replies": []}]}, {"body": "This is true\n\nThe day the CIA project was closed was the exact date of Facebook’s LLC filling in Delaware", "score": 1, "replies": [{"body": "What you think I made that up or something", "score": 4, "replies": []}]}, {"body": "Is LifeAlert also DARPA? Asking for nana", "score": 1, "replies": []}]}]}, {"body": "Or “dropout” Zuck", "score": 1, "replies": []}, {"body": "SMH Bill Bates' parents knew what they were doing when they got together. All they wanted was an elite athlete for a child and it worked.", "score": 1, "replies": []}, {"body": "Mark Cuban\n\nNow shut your dumbass up", "score": 1, "replies": [{"body": "Huh", "score": 1, "replies": [{"body": "Mark Cuban is a billionaire that claims to have risen from nothing\n\nParents were far from rich\n\nMade it big off of Broadcast.com, and minted 300 of the 330 employees in his company into millionaires", "score": 1, "replies": []}]}]}, {"body": "I'm so confused by this, are we making this decision off his grand pop?  Assuming his life story is legit it sounds like his parents were white trash.  Mom knocked up in high school, dad some dead beat who owned a bike shop in Arizona and didn't even know Bezos?  \n\n\nThey're the shittiest elite family ever", "score": 1, "replies": [{"body": "https://m.youtube.com/watch?v=zOm4JJUy9No", "score": 1, "replies": [{"body": "Dude I'm not watching some retarded conspiracy youtube video for more than a few minutes.  Lisp girl didn't even come close to explaining it...  So you can either give a synopsis of her point or just admit you're a retard.", "score": 1, "replies": [{"body": "Bezos grandfather was involved with the pentagons space program, the DoD, and worked for DARPA within his career. His stepdad was a successful oil tycoon of some sort at exon. His cousin is George straight.", "score": 1, "replies": [{"body": "Do you seriously think every person that works for an oil company is an oil tycoon?  He was a fucking Engineer lol.  The world is full of connected elite families, but trying to stretch nerds like Bezos into elite families is laughable.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "Hey everyone, get a load of this faggot", "score": -7, "replies": [{"body": "Get the dildo out brah", "score": 4, "replies": [{"body": "Great story. Did it come with that tinfoil hat of yours or did you pay extra?", "score": -4, "replies": [{"body": "You know society is peaking when documented history becomes tinfoil talk.", "score": 9, "replies": [{"body": "Documented history says his parents loaned him $300k as well. Are you insinuating that you have also peaked? Lol. And of course he had funding from other people you dicktard, angel investors often put caveats into their funding agreement such as parents putting up an assload of cash so the owner doesn’t fuck them out of lots of money.\n\nAs far as the tinfoil talk goes, I took a brief walk down your post history and about kicked my own ass for reading such faggotry.", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Bezos is now a POC which makes him immune.", "score": 15, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Black and Indigenous POC", "score": 4, "replies": []}]}, {"body": "Nah pretty sure he's all white, his step dad was Cuban tho.", "score": 0, "replies": []}]}, {"body": "Will calls print? If so, I believe whatever he wants me to", "score": 8, "replies": [{"body": "I agree but he’s testifying in congress today and he’s going to tell his self made man story which I’m calling out as BS.", "score": -6, "replies": [{"body": "And idgaf and will believe and back whatever story he wants. Fuck congress. Long live bezos and my calls", "score": 6, "replies": []}, {"body": "Fuck don't tell me you in Congress. It doesn't matter what his story is. He made something profitable for everyone.", "score": 2, "replies": []}]}]}, {"body": "They all have these fairy tales to tell about their startup. It’s part of the whole charade.", "score": 8, "replies": []}, {"body": "He didn’t want to give up control to outsiders", "score": 2, "replies": []}, {"body": "So what? American Anti-Trust is a joke.", "score": 2, "replies": []}, {"body": "I'm more concerned w Senators, like Kelly Loeffler, getting away w insider trading, than I am w Bezos potentially lying about how Amazon was founded.", "score": 2, "replies": []}, {"body": "His grandfather was one of the largest landholders in Texas.", "score": 2, "replies": []}, {"body": "He worked for Stan Drukenhiemler the leading quant hedge fund managing 10’s of billions", "score": 3, "replies": [{"body": "No he worked for DE Shaw", "score": 3, "replies": []}]}, {"body": "Who cares.. if he or someone else tried to divinize Bezos.. he is a living money god right now..", "score": 1, "replies": [{"body": "I wonder if in 300 years after the nuclear holocaust, Bezos, Zuckerberg and Musk will be sacrificed to and worshipped as gods of a cult called capitalism...", "score": 2, "replies": []}]}, {"body": "No if everyone on earth was handed 100 million dollars I guarantee only a handful would turn it into half of his wealth.", "score": 1, "replies": []}, {"body": "Bezos was always a gawd. He was the youngest partner in history at DE Shaw before he left. Everybody thought it was just a phase and he’d come back eventually. He was making daddy bucks even before AMZN.", "score": 1, "replies": []}, {"body": "I agree, I also think for all those ultra wealthy CEOs: WE DON'T CARE WHERE YOU CAME FROM OR HOW YOU DID IT, now that you're the lords of our world stop the antitrust business practices, you're already shit rich you pr!ck$", "score": 1, "replies": []}, {"body": "The problem is everyone thought the internet was fucking stupid at that point, and an online bookstore was even dumber of an idea.  Everyone thought Barnes and Noble would crush the online dorks and life would go on.", "score": 1, "replies": []}, {"body": "Calls on MRNA confirmed!!", "score": -1, "replies": [{"body": "Yolo all your money on calls...can’t miss for a smart guy like you.", "score": -2, "replies": []}]}, {"body": "Conveniently ignores anything to do with how his company operates today", "score": -4, "replies": [{"body": "This is the entire point, he is just filling time with an American dream story to get some brownie points with congress and whatever psychos watch c-span", "score": 5, "replies": []}]}]}
