{"title": "Lots of people buying stocks = Bubble?", "selftext": "I know this might sound a little bit crazy, but please consider my macroeconomics knowledge as \"low-standard\". \n\nIs there any change that a massive entrance of little investors on the stockmarket (everybody is now using RH, Degiro, IB...) causes some kind of stock bubble? Does It have any sense? (Maybe this os something por r/ELI5)\n\nLike millions of people around the world (now everybody is able to buy stocks) pumping the prices... Maybe is just my imagination but I feel like EVERYBODY is a trader or a investor right now (even me, LOL I dont know why I am making money so easy)", "id": "hk6poc", "created_utc": 1593728047.0, "score": 39, "upvote_ratio": 0.82, "num_comments": 76, "comments": [{"body": "RH and other retail investors mean absolutely nothing to the market.\n\nHere's a proof: [https://themarketear.com/posts/cZlQKoURkk](https://themarketear.com/posts/cZlQKoURkk)", "score": 16, "replies": [{"body": "I agree. When the stock price falls the way it did in hertz, it is easy to get volumes. I dont think this qualifies as \"OMG there is a bubble waiting to break\". As long as we are creating enough economic value and catch up to the price, the stock market should be healthy", "score": 1, "replies": []}, {"body": "If there were only two traders, both on RH, they could make the price skyrocket. So this is no proof.", "score": 0, "replies": [{"body": "That's exactly my point. Retail traders don't matter.", "score": 3, "replies": []}, {"body": "Yeah assets held =/= trading done\nIf all the account holders on schwab don't do any trading the few people on roobinhood will determine the market price.\n\nI don't think robinhood is a big influence.\nJust wanted to point out that the volume of trading matters most.", "score": 2, "replies": []}]}]}, {"body": "Everyone got their stimulus checks and either bought big screen TVs or tried to make a quick buck in the stock market. Many stocks that have no rational reason to rise are rising.  I agree the stock market is held up by hot air right now.\n\nExample: Hertz went bankrupt and their stock went up and will most likely be worthless very soon.", "score": 34, "replies": [{"body": "That's just people playing hot potato, most investors of Hertz *know* that, they're just playing chicken with each other until the bubble bursts.", "score": 20, "replies": [{"body": "Think so?", "score": 3, "replies": [{"body": "Of course, even Robinhood has the fucking news headlines which mention when a company goes bankrupt right in the stock's page lol.  It's just a trend that happens, people willingly trade on get themselves and play chicken basically.  Some cash out, some join late and hold the bag, some wait too long trying to be Mr. Max Gains and get left behind feeling like they were the recipient of a 100 man bukkake fest.", "score": 20, "replies": [{"body": "Bukkake fest", "score": 3, "replies": []}]}]}]}, {"body": "RH traders are trying to time the market. They want that pump and then dump real quick before other people dump.\n\nIt's like trying to catch a falling knife.", "score": 6, "replies": []}, {"body": "So we shorting hertz?", "score": 2, "replies": [{"body": "Haven't you been paying attention? We goin' all in.", "score": 4, "replies": []}, {"body": "By the way here is the story about hertz https://www.npr.org/2020/06/24/883047437/owner-of-a-broken-hertz", "score": 1, "replies": []}]}]}, {"body": "You’re not crazy at all. We saw pretty much the same thing in the dotcom bubble—media frenzy, influx of retail, etc—and we know what happened then.", "score": 25, "replies": [{"body": "P/E ratios were all in the hundreds in the dot com bubble.", "score": 7, "replies": [{"body": "Amzn is 117", "score": 4, "replies": [{"body": "And Etsy is 160. But that doesn’t mean all companies are in the same boat. High p/e may reflect projected high earnings which will correct to a lower P/E. Etsy is a great example of that. They’re expecting a huge earnings report which will lower their p/e. Amazon is speculative", "score": 5, "replies": [{"body": "Zoom P/E is like 1000+", "score": 7, "replies": [{"body": "Shopify is 1600. Fastly has a P/S of 38. Some seriously ridiculous valuations in the market right now.", "score": 8, "replies": [{"body": "Shop doesn't have pe", "score": 2, "replies": [{"body": "Forward PE", "score": 2, "replies": []}]}, {"body": "NFLX is 90.\n\nBut yea except for ALL THE NAMES WE KNOW they are pretty reasonably priced.", "score": 1, "replies": []}]}, {"body": "I don’t hold a single stock with a p/E over 60.", "score": 1, "replies": []}]}]}]}]}, {"body": " the two best investors in our short stock market history are not buying and rather selling and sitting on cash.  They are warning us. If we dont listen, it is only our fault.", "score": 20, "replies": [{"body": "Buffett is sitting on cash so he can buy out companies that dont make it through this, not because the stock market is going to crash and never go back up.\n\nHe has big money, so he can make big plays. Its a different game.\n\nThe market still might be just a tiny bit overvalued though.", "score": 43, "replies": [{"body": "Thank you for this. Half the people in this sub act like they know everything and frankly it’s just bad information for newcomers to read and assume it’s true.", "score": 9, "replies": []}, {"body": "He's also in the insurance business and he doesn't know how costly this pandemic will be and how much he'll have to pay out.", "score": 5, "replies": [{"body": "^ yep", "score": 1, "replies": []}]}]}, {"body": "Managing a portfolio of hundreds of billions is different to managing a portfolio of 5 figures; he may be sitting on a ton of cash but that does not mean someone with a smaller portfolio should follow his actions.", "score": 6, "replies": []}, {"body": "whos the other one beside buffett?", "score": 2, "replies": [{"body": "Prob talking about Munger", "score": 2, "replies": []}]}, {"body": "The dinosaur Buffett? He's made terrible moves over the past few years. I don't give a shit what he thinks.", "score": -19, "replies": [{"body": "Ah classic redditors. Made some bucks during corona dip and thinks they are genius and Buffett is trash.", "score": 29, "replies": [{"body": "Buffet has consistently underperformed the market for the last 10 years. You'd have been better off with SPY than BRK since 2008, and wayyyyy better off with QQQ.", "score": -9, "replies": [{"body": "Lol that isn't how it works. BRK isn't a true measure of Buffet's success - his net worth is.", "score": 5, "replies": [{"body": ">BRK isn't a true measure of Buffet's success\n\nwhat even is fiduciary duty anyways, right", "score": -5, "replies": [{"body": "I mean that it isn't a true measure of Buffett's success as an individual in the financial landscape. Not to mention that he did so much stuff before BRK (hedge fund) that his company right now isn't indicative of Buffett's success.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Dotcom was before QE", "score": 3, "replies": [{"body": "Or Druckenmiller, or Jeremy Grantham or Ray Dalio", "score": 1, "replies": []}]}, {"body": "The question is how long will it last? I keep buying puts anticipating a crash and they keep going down.", "score": 1, "replies": []}, {"body": "Yeah, a bunch of rich dumbass boomers were scared and pulled their money.", "score": 1, "replies": []}]}, {"body": "The mom and pop investor lol", "score": 5, "replies": []}, {"body": "lots of people buying stocks = bull market\n\nOne could argue all bull markets are bubbles though.  Months of upward movement at the end of a recession is not a bull market.  The bull market usually starts after the first dip post recovery, so the bull market should start back up any week now.", "score": 6, "replies": [{"body": "We had two corrective dips in the past two months. I'm expecting another dip sometime next week, but then if I'm expecting it and everyone else is expecting it, will it end up happening?", "score": 2, "replies": [{"body": "Maybe the bull market has already started then.  It does feel a lot more normal now.", "score": 1, "replies": []}]}]}, {"body": " A lot of people making noise on social media with their small accounts. No, Goldman Sachs and the boys with their army of Harvard grads and million dollar algorithms are trading the stocks.", "score": 3, "replies": []}, {"body": "Do you guys think for a new investor like myself it is better to wait for a new crash to dive in or get in now? I currently have $0 invested.\n\nAlso if so, how do I slowly get in?\n\nThanks", "score": 2, "replies": [{"body": "You could wait for new crash or invest on sectors/stocks which haven't recovered from coronavirus.\nI guess traveling/hotel stocks are still in deep dark hole.\n\nI personally invested in hotel stocks, since even if there is a bubble  in market (which I think there is) you can't really fall far if you are already in bottom.\n\nI invested in European hotel chain.\n\" Scandic Hotels group\"", "score": 2, "replies": [{"body": "I mean... Those beaten down sectors could go bankrupt.", "score": 2, "replies": []}, {"body": "Appreciate it", "score": 1, "replies": []}, {"body": "Well said, if ur just starting definitely look for value stocks which mostly are travel related, Boeing, airlines, hotels, etc. but think long term you may have to hold for a while if sector doesn’t recover quickly", "score": 1, "replies": []}]}]}, {"body": "Maybe in certain stocks, but mostly RH makes up too small a part of the market to *cause* a bubble. \n\nA huge influx of traders might be a *symptom* of a bubble forming (I.e. perceived easy money) but not the cause", "score": 2, "replies": []}, {"body": "You have more proof of this?", "score": 2, "replies": [{"body": "Not really, just a feeling", "score": 0, "replies": []}]}, {"body": "What’s that?", "score": 2, "replies": []}, {"body": "Robinhood (easy access to stocks)\n\ninterest rates at near 0 (people want to put their money somewhere other than CDs right now)\n\nstimulus/ unemployment checks (extra money to yolo with)", "score": 2, "replies": []}, {"body": "I was thinking the same thing. I'll invest only here and there, but mostly in ETFs, msft, appl, voo, and some for risky plays here and there, but i will stop for a while. gettin worried hahaha", "score": 1, "replies": [{"body": "QQQ usually outperforms VOO for what it's worth. Higher percentage growth over the week, month, 3 months, year, etc.", "score": 1, "replies": [{"body": "It's the perfect conditions for QQQ too. Pandemic benefiting tech more than industry/finance/retail, rock bottom interest rates benefiting growth more than value.", "score": 1, "replies": [{"body": "QQQ is great I’m Just worried tech is in another bubble", "score": 2, "replies": [{"body": "If tech is in a bubble, it'll remain in a bubble as long as there isn't a more immediately attractive investment.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hell ya", "score": 1, "replies": []}, {"body": "for what it worth i looked up different terms for trade and investing on google trends and besides the covid crash there hasn't been much increase.", "score": 1, "replies": []}, {"body": "There's over $5T sitting in money market funds because people are scared to invest.  That tells me there's more upside.", "score": 1, "replies": []}, {"body": "The little guy money is a drop in the bucket. Most money is still on the sidelines. We are far from a bubble, and I don't know if we've ever seen a total stock market bubble as they are usually sector specific.", "score": 1, "replies": []}, {"body": "Appreciate the advice, makes sense", "score": 1, "replies": []}, {"body": "Yeah so this is the time to make money , it’s as soft as it will ever be and when it’s over you’ll all remember it fondly . Feels like dejavu coming from a poker back ground.", "score": 1, "replies": [{"body": "Pretty much my thought. I’m new and just collecting as much god damn money as I can while it’s good.", "score": 2, "replies": [{"body": "Any recommendations on what to invest for a quick rise during the next week?", "score": 3, "replies": [{"body": "SE, SQ, ULTA", "score": 5, "replies": [{"body": "I don’t like investing in rapidly rising stocks (I’m new) but I guess I’ll try them!", "score": 2, "replies": []}]}, {"body": "I invest in microcap stocks. I follow here because I hope to belong eventually.", "score": 1, "replies": []}]}]}]}, {"body": "You can’t fight the Fed. Keep booking profits until elections.", "score": 1, "replies": []}, {"body": "I MADE MONEY SO EZZZZZ LMAOOOOOOOOOOOOOOOOOOOOO BRUHHHH  \n\n  \n\nugh", "score": 1, "replies": []}]}
{"title": "Forget TSLA, NIO is hitting it big", "selftext": "Been hoarding NIO 2021 calls and are seriously paying off so far, reports came back super positive today just like TSLA in terms of deliveries. If China doesn't explode by 2021 it will be a good time.\n\n&#x200B;\n\nEdit: 1/15/21 $15c", "id": "hjy0lw", "created_utc": 1593700131.0, "score": 59, "upvote_ratio": 0.83, "num_comments": 70, "comments": [{"body": "NIO is only a stock for TSLA shorts who are too stubborn to admit they were wrong and are looking for an alternative to pivot to.", "score": 65, "replies": [{"body": "Nkla has entered the chat", "score": 14, "replies": []}, {"body": "Look at all those beta cucks.", "score": 3, "replies": [{"body": "300% return since April... real beta move right here", "score": 2, "replies": []}]}]}, {"body": "I almost always avoid Chinese stocks due to the rampant manipulation on their financials. But I have to admit, this one deserves a very close look. \n\nThe electric car market is going to grow, period. China has a long history of putting its fingers on the scale to support Chinese businesses over foreign competitors such as Tesla. This looks like it has enormous potential. I’m in on $5 calls for February.", "score": 23, "replies": [{"body": "If it's too good to be true...\n\nI don't trust this. Don't wanna have another LK situation here.", "score": 9, "replies": [{"body": "With that attitude you should never buy US because of Enron or German because of WireCard.", "score": 12, "replies": []}, {"body": "That's exactly what will happen, these dumb cucks will get china hustled again they like tiny Chinese dicks up the ass", "score": -13, "replies": [{"body": "You sound like you ate Trump’s asshole for breakfast while watching Fox News. How did his Big Mac and Diet Coke taste?", "score": 7, "replies": [{"body": "Haters hate, closed a 400k profit position today, enjoy the taco bell gig lil fella", "score": -5, "replies": [{"body": "Not hatin dude, 400k is a cute lil position, you can buy a house in Mississippi now?", "score": 5, "replies": [{"body": "2 in cali", "score": -2, "replies": [{"body": "So cute :)", "score": 2, "replies": [{"body": "Enjoy the Chinese stocks", "score": 1, "replies": [{"body": "Oh I really do :)", "score": 4, "replies": []}, {"body": "These Chinese “scam” stocks make me so horny!!! Can you give me a hand here?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "NIO’s price is deflated because they are having all the same issues that TSLA had when they first started producing, I expect them to sort them out and the Chinese government to help them.", "score": 13, "replies": []}, {"body": "I sold $8.5 calls 7/2 Monday, had to buy them back today at a big loss\n\nI **KNOW** one of you autists bought these, and for that I gotta say go fuck yourselves", "score": 21, "replies": [{"body": "I did for the stocks back when this sub was saying NIO is bad. Wheel of fortune.", "score": 3, "replies": []}, {"body": "I had to buy back $7.5 calls. Missed out on $3K", "score": 2, "replies": []}, {"body": "No, Susquehanna probably bought it", "score": 1, "replies": []}, {"body": "Thank you sir very kind of you.", "score": 1, "replies": []}]}, {"body": "Strike and date", "score": 7, "replies": []}, {"body": "I don't think anyone should forget Tesla, but I'm extremely bullish on NIO myself and hold a few shares myself.\n\nMy opinion may be quite retarded but I think they're at the forefront of how cars will be made - essentially cars as a service where they own no factories, and essentially use the best manufacturers to produce their vehicles. The process reminds me of what happened to silicone fabs where over the last twenty years they've consolidated in just several large companies that have the funds to build state of the art facilities for state of the art silicone. Another driving force behind this phenomenon may be the complexity of new vehicles where a ton of features are software and software-hardware integration.", "score": 10, "replies": [{"body": "Massive Chinese ev manufacturer, making cars, only worth 1/110th of Tesla... Something doesn't add up for one or the other", "score": 2, "replies": [{"body": "1/20th of market cap", "score": 3, "replies": [{"body": "Whatever the fuck, there's a remarkable imbalance here either Tesla is retarded valued or everyone knows nio is another Chinese fraud", "score": 1, "replies": []}]}]}]}, {"body": "Literally been holding this stock since $3, I expect this shit to hit 20 by end of year", "score": 8, "replies": [{"body": "$2.599 here. Glad to ride the wave with ya", "score": 4, "replies": [{"body": "$2.59869420 here. Who wants to ride my wave?", "score": 3, "replies": [{"body": "You win sir", "score": 1, "replies": []}]}]}]}, {"body": "Bought $12 Jan C's awhile ago for 20 cents.  Actually got lucky and loaded up more yesterday while bored at work.", "score": 7, "replies": []}, {"body": "Battery Swap for the win.  \n[https://youtu.be/t1Ld5WByT34](https://youtu.be/t1Ld5WByT34)", "score": 5, "replies": [{"body": "Dude that is so slow. Just plugging into a charger will charge it 25% in that time, you really can't wait another 10 minutes at the charger to get like 5 hours of driving time?", "score": -2, "replies": []}]}, {"body": "Indeed they are. Extremely undervalued compressor to other electric vehicle stocks. I am expecting these guys to hit $50+ by 2021.", "score": 11, "replies": [{"body": "true, actually like how the cars look and they have cool support systems with like vans that come out to quick charge you for free if you get stranded. Certainly not hitting TSLA stock prices but nice to see some variety that doesn't suck.", "score": 11, "replies": [{"body": "I can see it get to a $50B valuation if they start international sales", "score": 7, "replies": [{"body": "They were already demoing them in UK. I can see them break into Euro markets first as a good cheaper alternative to Tesla", "score": 2, "replies": []}]}]}]}, {"body": "Sold my shares at 6 earlier hoping to buy again on dip... RIP", "score": 6, "replies": [{"body": "I did this too, but then bought them back when the price hovered around $7 for a few weeks and ultimately sold them today for 14.90. Got lucky as all hell", "score": 1, "replies": []}]}, {"body": "Why wouldn't you just buy 2022 10$ calls. Pretty cheap", "score": 3, "replies": [{"body": "Just buy the stock at that point", "score": 16, "replies": []}, {"body": "That's true.", "score": 2, "replies": []}]}, {"body": "fuck damn it, i sold too early", "score": 3, "replies": []}, {"body": "Why do these post always come out just a second too late :(", "score": 3, "replies": []}, {"body": "With the faking earning of Luckin Coffee, KinGold as well the current HK Situation. I'm still thinking to invest on it.\n\nI also wonder how NIO get that 10k car sales, Internal China is have so many issue.\n\n* Trade War\n* Sea Dispute with the South China Sea\n* HK Riots\n* Covid-19\n* Factory leaving China\n* 600 mil ppls earing less than 1000RMB\n* land dispute with India\n* CN Property bubble \n* CN Promise of autonomy is broken, for the shake of national security.\n\nTo me still beware of the numbers.", "score": 3, "replies": [{"body": "HK won’t make much of a difference. There will be some symbolic visa restrictions and the protest movement is (sadly) pretty dead. Elites have sucked up to the NSL.", "score": 1, "replies": []}]}, {"body": "If you think this is good, wait till next quarter with Byton shutting down.", "score": 2, "replies": []}, {"body": "It'll easily hit 15 by 2021, I bought calls for 8/21/2020 at $13c", "score": 2, "replies": [{"body": "My price target is 20 EOY. Still 2 more earnings and they gon crush it", "score": 2, "replies": []}]}, {"body": "Got fucked by LK and yet holding some BABA leaps. That is enough Chinese for my appetite.", "score": 2, "replies": []}, {"body": "I'm have LAC stock. Investment Thesis:\n\n-  gigafactory Germany opens, demand will simply increase.  \n- China will increase demand\n- the rest will follow.\n- Vertical integration and a competitive advantage. \n- German, Japan, US and India auto industry will wake up and start gobbling these lithium stocks.", "score": 2, "replies": []}, {"body": "Never trust china", "score": 2, "replies": [{"body": "Absolute black and white rules are hell for an investment/trading mindset. Even for a gambling mindset. Gotta be flexible and adjust accordingly", "score": 8, "replies": [{"body": "Bought it yesterday", "score": 1, "replies": []}]}]}, {"body": "NIO is interesting, they actually have cars and are selling them, unlike nikola. The cars actually look half decent, and they seem to be innovating too with the battery swap and other areas. I’d guess they are not priced too bad either, they could be a viable alternative to Tesla if they can scale quick enough. Im not sure why there isn’t more bullish sentiment on wsb?", "score": 1, "replies": [{"body": "I think it's because a large portion of the Reddit user base have anti-Chinese sentiment, and factor that in regardless of the potential of NIO.", "score": 1, "replies": [{"body": "I think you’re probably right, probably means it won’t get the hype like nikola. Still though I’m feeling bullish the more I look into them.", "score": 1, "replies": [{"body": "Yeah I agree with you! I def think it still can go up to $20 at least imo plus China generally likes to have domestic companies running in the country for obvious reasons, and NIO might just be the forerunner", "score": 2, "replies": []}]}]}]}, {"body": "I had 40 $4 Jan '22 calls and I sold them all for 0.23 about a year ago. Still hurts", "score": 1, "replies": [{"body": "That’s 41k today", "score": 1, "replies": [{"body": "You just had to do it didn't you", "score": 1, "replies": [{"body": "Sorry, I have 5 1/15/21 10$c don’t know what I should do . I’m up really big but I see the opportunity for more . I don’t know if I should just try to sell and cash out or ride it a little longer .", "score": 1, "replies": []}]}]}]}, {"body": "Come join us @ r/NIO_STOCK", "score": 1, "replies": []}, {"body": "Okay, why would I trust sale numbers of some Chinese crap company? I smell another LK situation here.", "score": -3, "replies": [{"body": "Looks like somebody has puts out for NIO eh?", "score": 2, "replies": []}]}]}
