{"title": "A checklist to give you some guidance on BIG market movements (up or down, I DGAF)", "selftext": "Right now, ALGOs rule the fucking world, right? So I spent months learning a thing or two to try to figure out how I can get better informed on understanding where markets would go\n\nSince April we have been going through volatility boxes where SPX pings from one point to the next. Markets are experiencing sector rotations where one day Financials go up and tech goes down, next day vice versa. \n\nThis is a list I compiled:\n\n* Linear regression lines: 3 main \"channel\" lines that have shown support/resistance over the last 2 years: ~3200, ~2990, ~2700. Just look at the SPX chart and draw a horizontal line at the multi-week clusters and bisect them. \n\nThis means: Below 3200 and above 2990, 3200 is resistance and 2990 is support. Should we break above 3200, 3400 is very likely. Should we break below 2990, 2700 is the next support floor. Should we break 2700, we will probably stop at 2500\n\n* Bear Case: You need a LARGE red candle (like 100+ point movement) that is supported by a subsequent red candle on the daily chart. \nBull Case: you need a LARGE green candle supported by another green candle\n\n* Market Breadth: this is obtained by the Advance - Decline line for SP100 in ToS. Stocks have shown great correlation, meaning usually there are 80-90 stocks up or down out of sp100. If we are to break up. Bear Case: violate 2990 and 80-90 stocks going down. Bull Case: violate 3220 and 80-90 stocks going up\n\n* VIX must have VERY VERY large movement. Bear Case: VIX gains 30-40% in a day and/or VIX 42 and above and stays there for more than 3 days. Bull Case: VIX drops under 20\n\n* High volume. Using relativevolumeSD study in ToS, it looks at the last 60 days of volume and makes a dashed line at 2 standard deviations above this average. You MUST have large enough volume to penetrate the dashed line for both bull/bear cases \n\n* Moving Averages: This is the most important factor for understanding algos. Some MMs use 50 day, others 100, and others 200. Algos are computers that are set to buy / sell based on certain metrics. Best case is to use the 100 MA as that will include the algos that use 50 MA.  Disparity Index indicator (study in ToS) gives you the % above or below the MA. Bear Case: SPX breaks below the 100 day MA. Bull Case: any negative day does not violate the 100 day MA. 100 day MA is currently 2960\n\n* RSI: This shows relative strength. It is currently showing a bearish divergence (SPX is trending higher but RSI is trending lower). RSI should be verified with the WillamsPercentR study to see if the market is truly overbought or oversold. WilliamsPercentR  closer to 0 shows overbought (currently -21) and -75 is oversold territory. These are 2 bearish divergences\n\n* Formulaic trendline: 2956- 2898. This forms one of the 3 'safety zones' for algos to prevent a sell off, the other 2 being the linear trendline and 100 day MA. If we cross below 2960, we have lost 2 of the safety lines ... if we break below 2898, algos will start to sell like crazy and GAME ON!\n\n* MACD: must show divergence, it must be large, and the histogram must support sell side activity for a true second leg down. Anything outside of that is Bullish. Set up zone for a second leg down: SPX is consolidating + MACD histogram is showing strength + divergence is high + it crosses below zero\n\n* Money Flow indicator: AccDist study shows institutional money and is showing that smart money is *not* selling off. Why would they? Earnings for q2 and guidance is coming up this month and we are above the 3 safety zones. Smart money still believes we are in a V shape recovery until companies give them a reason not to. This can be verified with OnBalanceVolume study. This indicator is showing a bearish divergence because, although we are near Feb ATHs, there is about 40% less money in the market. \n\nTL:DR a big bullish move will happen if VIX drops under 20 and we break the 3220 resistance on HIGH volume\n\na big bearish move will happen if VIX jumps 30-40% intraday (or above 40) on HIGH volume with multiple daily red candles, where we violate the 2960 and 2898 support levels that can be verified with drop in money flow and RSI/MACD", "id": "hlhmyv", "created_utc": 1593928321.0, "score": 88, "upvote_ratio": 0.88, "num_comments": 71, "comments": [{"body": "During this whole rally, vix has stayed above 30. Not sure we need to see a sub 20 to get boosted back to ATH", "score": 34, "replies": [{"body": "that, my friend, should scare the living shit out of you.\n\nVIX = put-call spread on SPX\n\nVVIX = put-call spread on VIX\n\nVVIX basically shows how much smart money is hedging their portfolios. Anything above the 110 line says \"smart money is buying vix\" and/or \"smart money isn't selling the VIX options they are holding\"\n\nWe had a pull back a few trading days ago, yet VIX did not pop up to the 40-45 level. Want to know why? Because smart money was already \"comfortably hedged\" from 6/11 sell off and we didn't drop under 3000. They basically said \"we are ok with this level of sell off\"\n\nHOWEVER, given the rally that we have seen, VIX stayed high because smart money is also saying \"fuck, this shouldn't be like this, it can go crazy to the bottom at any moment\" and thus VIX has been stable at around 30\n\nLook at the 20 year chart for VIX. If I remember correctly, in the last 20 years it crossed the 35 line 6 or 7 times .. 2 of those times has been this year alone and we will probably have it cross the 35 line a third time before the summer ends.", "score": 45, "replies": [{"body": "This is good knowledge and insight. Thanks guess my vix 35c 8/20 are fucked if we rally", "score": 17, "replies": [{"body": "I have VIX 35, 50, and 60 for Aug\n\nVIX is forward looking volatility for 30 days. So 8/20 is for vix from Aug to Sept. If we rally in July, they will lose value, sure, but not as great as if we rally in Aug. Does that make sense?\n\nFlip side, however, if VIX hits 100 in July, Aug calls pump, Sept pump less, Oct pump even less, Nov and onward might have a blip up. \n\nAlso, VIX levels seems to hold for 5-7 calendar days before moving", "score": 19, "replies": [{"body": "That actually makes sense", "score": 4, "replies": []}]}, {"body": "look at today .. VIX opened up down a lot .. but as the day progressed, VIX went up and so did VVIX \n\nAll my VIX calls I bought at open are already in the green ...\n\nSmart money is saying \"this is dangerous, I don't trust this market\"\n\nNext week we start getting earnings and guidance ... so ... big moves and big volatility is instore for us!", "score": 1, "replies": [{"body": "Definitely make sense. Days when Spy is up and Vix is up always weird me out. Volatility is definitely in our future. Wonder which bank is going to blow up next week", "score": 1, "replies": [{"body": "This is what I know ....\n\nBanks make up a huge part of the S&P and Russell. The only days that we have broken up to $320 SPY range is when banks rally .. I don't think banks will rally, which means we are stuck in this trading range until something gives\n\nHow much higher can these tech companies go? who knows .. everyone is pumping them.. that is bad. If retail, smart money, and institutional money is rotating into tech and shorts are out, then you have reached a ceiling, right?\n\nAs soon as ANY tech company shows some weakness, the shorts will destroy them. MSFT & NFLX have earnings around 7/16 ... that is when I think we start seeing correction.", "score": 1, "replies": []}]}]}]}, {"body": ">HOWEVER, given the rally that we have seen, VIX stayed high because smart money is also saying \"fuck, this shouldn't be like this, it can go crazy to the bottom at any moment\"\n\nThis sounds like retarded money tbh", "score": 1, "replies": []}]}]}, {"body": "While your research may be commendable at some point you must have stumbled upon Amdahl’s Law or at least have some understanding that nobody on the outside can quantify or predict algos, at least not in the way you describe.", "score": 13, "replies": [{"body": "I am not trying to predict algos as much as I was trying to understand \"what is the most important thing for an algo to trigger a sell off\"\n\nThe most important factor is breaching the moving average. If we do NOT breach the moving average an algo is programmed to follow, it will not sell off. I think of it as being dealer on the black jack table and taking away the entire emotional aspect of \"should I hit or stand\"\n\nBut crossing the MA isn't enough. If the volume isn't there, if the VIX isn't pumping, if the other 2 trend lines aren't breached, if the money flow is staying bullish, then algos won't sell off. \n\nI think with 7-9 of these things happening, you can trigger a sell off or a massive buy up. Is this everything involved in an algo? absolutely not, but it gives some guidance at least", "score": 12, "replies": [{"body": "This assumes MAs are important.", "score": 4, "replies": [{"body": "They are. Whether you autists believe it or nkt", "score": 5, "replies": [{"body": "Maybe, but the most important factor? Doubt it.", "score": 2, "replies": []}]}]}, {"body": "Wouldn't a smart algo take the MA and +- it by 1.2% to avoid other algos shaking it out?", "score": 1, "replies": [{"body": "And how about if 8% of devs have their algo use the 200 day MA, another 7% use the 150, and 6 and 8% use the 100 and 90.  Then, another group used the 50 week MA, and another the 100 and 200.  How about using the Bollinger band levels, etc....", "score": 3, "replies": [{"body": "Besides that, algos are really only used by HFTs/MMs.  No fucking hedge fund manager is going to let some tech school retard's shitty code lose 20% and automate his job", "score": 5, "replies": []}]}, {"body": "That’s a very valid point. mM are def in the game to kill each other and that might possibly be part of the programming, however, I doubt it would be that high of a percentage delta to trigger the sell off point\n\nAlso, they can maybe have and if - and based on the 3 moving averages", "score": 1, "replies": []}]}, {"body": "Your first sentence reads \" I'm not trying to predict algos as much as I was trying to predict where algos sell.\"", "score": 0, "replies": []}]}]}, {"body": "Flat got it", "score": 10, "replies": [{"body": "I honestly wouldn't be surprised if we see very big movement in after hours market that then corrects itself intra-day and pings between 3150 and 3000 for another 2 weeks", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 45, "replies": [{"body": "They do both. They parse news real-time, as well as TA analysis, and other black magic like machine-learning.\n\nAnd then they also cheat by peeking at your RH orders before they hit the market, so they can move the price before your order gets there (if it suits them).\n\nBasically, the game is totally rigged against us, just like the lottery. Doesn't mean we can't play though!", "score": 13, "replies": [{"body": "yes, good points.", "score": 1, "replies": []}]}, {"body": "#THANK YOU", "score": 8, "replies": []}, {"body": "Yes ... this is def also part of the equation. They parse headlines a helluvalot faster than anyone else. Just look at the ordeal that happened when the China deal was off before it was back on \n\nWent from like -1.5% to +1% in 20 minutes. \n\nWhat you are saying is not independent of what I am saying, it is in addition to. However, if you have bad news and you don’t cross moving averages or a bump in vix and everything is low volume, then you won’t get a massive sell off", "score": 2, "replies": []}]}, {"body": "SPX has been rejected multiple times at ~3150 for the last 2 weeks. It needs to break that first.", "score": 6, "replies": []}, {"body": "Great work! Sadly most here are trading off hope and speculations...", "score": 6, "replies": [{"body": "Is TA any different? 🤣", "score": 6, "replies": []}]}, {"body": "“Smart money” “TA magic lines” “algos rule the market” \n\nAnd I am out ...", "score": 11, "replies": [{"body": "Any post with heavy TA, I'm out...they're basically saying,  \" Check out these lines on this chart, this is how Im going to lose half my portfolio\" 🤣", "score": 8, "replies": [{"body": "hope you don't lose your shit!!\n\nany company that has a parabolic, vertical rise for no fucking reason and i'm out! don't be the last one standing when the musical chair game ends!", "score": 3, "replies": [{"body": "I agree", "score": 1, "replies": [{"body": "then why discount TA? this isn't that gay fib lines and other magic marker mumbo jumbo \n\nthese are studies that show you volume and give it a comparison over a certain amount of time... they are studies that track money flow from big money and what they are doing with it ...\n\na lot of very profitable intra-day traders use resistance / support line to make big plays in the direction of momentum. A lot of the studies i talked about help you guage momentum\n\nbut if you want compter money BEEP BEEP and just base your shit on dumb luck, good for you", "score": 0, "replies": []}]}]}]}, {"body": "Almost thought he was going to throw in a Pythagorean theorem before the end of his post", "score": 2, "replies": []}]}, {"body": ">So I spent months learning a thing or two to try to figure out how I can get better informed on understanding where markets would go\n\n🤣", "score": 4, "replies": [{"body": "Imagine watching a YouTube video and bragging about it on reddit", "score": 2, "replies": [{"body": "Funny comment, but I feel like that's 80% of Wall Street bets...", "score": 2, "replies": [{"body": "nah son .. 80% of WSB just throws blind money at way OTM calls and they print like crazy because of other factors ....\n\nsoon, they will get bolder and bolder with their bets, and bigger and bigger until they are left blown up .. like the clowns who kept buying MGM/Wynn calls", "score": 2, "replies": [{"body": "TSLA 2000 strike, Jul10, I think I say a comment like that last week...like seriously!?!", "score": 1, "replies": []}]}]}]}]}, {"body": "So you’re saying after a big bullish movement we’ll have a big bullish movement", "score": 7, "replies": [{"body": "And even more important of vix jumps 30-40% markets will drop but shhh don't tell everyone cause this is just for wsb", "score": 1, "replies": []}, {"body": "It's really easy. If we see that the market has gone up, then we know the sticks have gone up and we should have bought.", "score": 1, "replies": []}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "> Since April we have been going through volatility boxes where SPX pings from one point to the next. Markets are experiencing sector rotations where one day Financials go up and tech goes down, next day vice versa.\n\nHello fellow Theotrader", "score": 3, "replies": [{"body": "Mentioning 110 on VVIX was a dead giveaway", "score": 3, "replies": [{"body": "I watch the weekend updates he does on YouTube", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "keep ... talking ... not yet busted the nut!", "score": 1, "replies": []}]}]}]}]}, {"body": "Market bullish if it goes up. \nMarket bearish if it goes down. \nGot it.", "score": 3, "replies": []}, {"body": "*does a few long-scale linear regressions*\n\n\n*thinks he's a genius*", "score": 3, "replies": [{"body": "Is he this guy? https://youtu.be/SYc6QmaGnYc", "score": 6, "replies": [{"body": "Amazing", "score": 1, "replies": []}]}]}, {"body": "Username does not check out.\n\nThanks for doing the TA so I don’t have to.", "score": 2, "replies": [{"body": "In bankruptcy court:\"Sir, who is the individual who provided the DD that you are now trying to suit?\n\nMe: 😬", "score": 7, "replies": []}]}, {"body": "You seeing SPY vs VXX right now?", "score": 1, "replies": [{"body": "No power at work. Last I had power was an hour ago and spy and vix were correlated and both green \n\nVvix was also pumping. I expect thjbgs haven’t changed. That should tell you this is a vertical rally and, like a magic mountain ride, sharp up lies leas to sharp downies", "score": 1, "replies": []}]}, {"body": "WSB is so technical these days wow 😮", "score": 1, "replies": []}, {"body": "So if the market drops significantly for multiple days it's an indicator for a big drop. Are you an idiot?", "score": 1, "replies": [{"body": "No but I’m obviously talking to one. You need 100 point red candles. Those can happen in after hours trading also, idiot. \n\nBut that is not the only factor. Obviously reading isn’t your strong point in life. Try shoving a carrot up your girlfriends boyfriends ass and eating it after ?", "score": 0, "replies": [{"body": "So a 100 point red candle on the daily chart for SPY is bearish? Are you serious? Can you also explain how water is wet?", "score": 1, "replies": [{"body": "No. But you can explain how your Gfs BFs nut tastes !", "score": 0, "replies": [{"body": "Thanks for proving my point that you're full of shit.", "score": 1, "replies": [{"body": "Ok ! Good luck out there !", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Thanks OP for saying once we break our trading range of roughly 298 to 322 on big volume we will have a big move.", "score": 1, "replies": []}, {"body": "This guy is a fucking retard. You belong here", "score": 0, "replies": []}, {"body": "Dude, simple all we need is another virus. Hurry ask Panda man to release one from his laboratory and let's see SPY 200 and later SPY 400 back again. Can trade both ways why be a bear or bull.", "score": 0, "replies": [{"body": "you want to see thousands die so you can make $200 wit your 1k net worth", "score": 2, "replies": [{"body": "You didn't know according to orange man coivd virus doesn't kill people. \n\nYou must be new here.", "score": 1, "replies": []}, {"body": "I'm more shallow: I really enjoy no traffic", "score": 1, "replies": []}]}]}, {"body": "It’s like you have been awakened from a deep hibernation, for fuck sake we trade in the box for months, moving from one box to another. I collect theta on short options but shit has been a complete theta burner for my long legs", "score": 0, "replies": []}, {"body": "Thank you, solid info. What are some of the resources you got this from so I can gain a better understanding for myself? Specifically interested in linear regression tendencies as well as MA in relation to algos (your safety net comment). I have experience with both of these in my trading but never thought of the relation to algos, you inspired some interest in that.", "score": -3, "replies": []}]}
{"title": "Is TSLA rise just a run up to the battery day?", "selftext": "Yo, is this shit rising similarly how companies rise before earnings? Could TSLA instantly drop after battery day just because  big money is ready to sell instantly after the announcement like after Kroger earnings, despite smashing them?\n\nPrepare sept 15 TSLA puts bears", "id": "hllp2v", "created_utc": 1593951422.0, "score": 48, "upvote_ratio": 0.79, "num_comments": 79, "comments": [{"body": "Whatever it is it was definitely controlled by the algos.\n\nPeople here keep saying “lol TSLA overvalued you guys r fuk, enjoy the bubble pop.” seem to conveniently forget that the big runs up last week happened in the pre market.\n\nSeriously peep the 5 day on Yahoo and ask yourself why it looks like stairs. \n\nRetail isn’t moving this stock at all...shit goes flat every day. So the question we should be asking is why did big/smart money decided to give TSLA a 20% pump last week.", "score": 92, "replies": [{"body": "There was a post on r/options on Friday (?) thinking it's a \"gamma squeeze\" - basic theory is so many people are buying options, which the MMs hedge by buying / shorting shares to get delta neutral.  Well, then there is some bit of good news, the stock starts to climb, retail FOMOs in by buying even more calls (which MMs buy more shares to neutralize delta). Then AH, MMs have to re-neutralize delta again / more, because gamma has increased the delta on the outstanding options the MMs had wrote.  And then at so e point shorts begin to cover, putting eve more upward pressure on the price.", "score": 62, "replies": [{"body": "So what you're saying is that stonks go up. Especially TSLA.", "score": 54, "replies": [{"body": "Pretty much - his observation was that TSLA seems to have these epic runs every few months.", "score": 24, "replies": []}]}, {"body": "MMs can squeeze my stock any day.", "score": 15, "replies": []}, {"body": "Yeah otm calls are so heavily bought that they might actually move the price. MMs that stay delta neutral are probably buying most of the stock now. This will go on until we get a huge blow off top (probably this week if Friday wasn't it already).", "score": 8, "replies": [{"body": "I feel like there is another pop on Monday, but it's based on July 4th holiday meet ups. People taking about their big gains and how Tesla will get added to S&P, etc.\nI don't see much of a pullback happening until after earnings, if they don't make a profit.\n\nEdit: only possible fault point would be California shutting down the Fremont factory, but that would light a fire storm, so not sure if it would happen.", "score": 8, "replies": [{"body": "seriously theres zero resistance and only good news ahead, plus its possible blackrock and vanguard have not even started buying the stock for the S&P500 etfs", "score": 5, "replies": []}, {"body": "I also think so. Bubbles always go bigger than you would imagine. Tsla 2000 eom.", "score": 3, "replies": []}]}]}, {"body": "Imho, I think I might actually be retarded.", "score": 4, "replies": []}, {"body": "If true, that means collective autism can send stocks flying up purely by loading up on OTM calls.  \n\nYou boys know what to do. $TSLA $1500C", "score": 3, "replies": []}]}, {"body": "I mean that’s kind of the whole market right now. SPY gets pumped every morning and most days is flat or a slow bleed during RTH. Pre-market is what’s moving everything now.", "score": 14, "replies": [{"body": "Yep. Seen this bs action on tsla for years. Premarket and AH when it can be manipulated 5% on <250k shares as a signal to momo funds that tomorrow it's on. It will drop 200 pts the same way. No reason to overcomplicate the simple.", "score": 1, "replies": []}]}, {"body": "I assumed this was due to a short squeeze but please correct me if I’m wrong", "score": 4, "replies": [{"body": "We're gonna have [short shorts](https://twitter.com/elonmusk/status/1278760548188983296?lang=en) boys!", "score": 2, "replies": []}]}, {"body": "If you follow social media how can you believe that “retail isn’t moving this stock at all”.", "score": 2, "replies": []}, {"body": "serious question what kind of fucktard buys 100s of millions worth in pre  market? Cant you do it much more efficiently in market hours when theres volume?", "score": 1, "replies": []}, {"body": "I thought it was a bubble at 250.....FML.", "score": 1, "replies": []}, {"body": "This", "score": -4, "replies": []}]}, {"body": "I'm gonna keep buying calls this month. Every time there's a dip.", "score": 18, "replies": [{"body": "Woah... Are you trying to make money or something?", "score": 17, "replies": [{"body": "YUH", "score": 2, "replies": []}]}, {"body": "They’re so expensive though. Which calls are we talking?", "score": 3, "replies": [{"body": "OTM WEEKLIES\n\n1300/1400", "score": 7, "replies": [{"body": "What will we do this week?", "score": 1, "replies": [{"body": "Make tendies", "score": 1, "replies": []}]}, {"body": "Can you explain what this means to an outsider, please?", "score": 0, "replies": [{"body": "The autist 2 above you nearly shit himself when he looked at how much ATM TSLA calls 2-4 weeks out cost (5k-12k). This is due to TSLA share price, papa Elon, high volume, and retard strength. The autist 1 above you suggests buying TSLA 1300 and 1400 calls that expire in about a week, likely to offload a day or two later for a small profit. Attempting to hold this until expiry results in either gains porn or loss porn, no in-between. This play represents a much higher risk and reward, but is accessible to the average broke motherfucker. It's a joke. Don't buy it. Just send me hate mail in a couple weeks when some retard posts his TSLA 1400c 7/10 gains porn.\n\nDisclosure: I have 10 shares, won't touch the fucking options", "score": 9, "replies": [{"body": "I feel like I’ve learned and unlearned and relearned options a dozen times. But when used right, I know the results can be bonkers. \n\nQuick story, I worked on a project many years  ago (2005 time frame) where I had to review this guy’s financial records over a 25-year period (I know...). He had been cut off from his very wealthy family at an early age for some reason in the late 80s, they basically allowed him to cash out most of his inheritance to avoid drama with the siblings, so he walked away with about $1 million (slightly more). He put every penny of it into a variety of options, mostly betting on computer companies early and gambling on every tech stock you could imagine throughout the 90s. I watched this guy’s wealth increase astronomically just via options, and around 2005 his net worth was in the upper 8-figure range. \n\nAs a person, he was dumber than dirt. To call him an autist would be immensely complimentary. Dude had zero knowledge of markets or anything and he told me point blank he just gave his financial planner (Bear Stearns guy from way back when, I believe) only one instruction when he began investing: take every risk you want to make me rich. \n\nSince then I’ve thought, hmm, I really gotta figure this shit out. Granted, I don’t have a million dollars in seed money, but it does seem like a way to game the market / system and potentially get some insane growth.", "score": 4, "replies": []}]}, {"body": "In the money is when the stock price has surpassed your strike price\n\nOut of the money is when it hasn’t\n\nWeeklies are options that expire in a week", "score": 2, "replies": [{"body": "Got it now, thank you.", "score": 2, "replies": []}]}, {"body": "You should seriously leave this sub. Lol. But really.", "score": 2, "replies": [{"body": "Nah, it’s entertaining to say the least.", "score": 1, "replies": [{"body": "You walked into a crack house, you already stepped over mutiple junkies passed out on the floor, someone is propped up in the corner of a back room, mumbling in their sleep about \"FD OTM weekly tendies\", but they are drooling and barely speaking, and there is a needle in their eye lid with half a hit of something still left. \n\nDo you take the needle and bang it into your arm? You want that kind of entertainment? Cmon on in buddy the water is fine!", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s so expensive but so lucrative. Just buy OTM calls. I did that with $1000 September calls for about $11k each and look where they’re at now. I rolled them out to October $1250", "score": 3, "replies": []}, {"body": "premiums on leaps are absolutely insane, but honestly theres zero resistance this thing could be a rocket ship to 2000 nothing makes sense anymore theres just too much money around and people sont know where to put it", "score": 3, "replies": []}]}]}, {"body": "S&P inclusion maybe?", "score": 25, "replies": [{"body": "This", "score": 3, "replies": [{"body": "Priced in", "score": 5, "replies": [{"body": "Now it is", "score": 11, "replies": []}]}]}, {"body": "Would UVXY or VXX have a larger swing with TSLA in the S &P? If you believed the bears, now would be the time to gobble up those shares. Right?", "score": 1, "replies": []}]}, {"body": "Woah what a mad lad, against Elon daddy. Anyway I hope u r right, I have been wanting to buy tsla shares.", "score": 10, "replies": [{"body": "Indeed. If it drops, it'll rise again immediately from all the FOMOs", "score": 9, "replies": []}, {"body": "Literally same. I'm trying to cope with the fact that I didn't grab free tendies.", "score": 7, "replies": []}]}, {"body": "If they get added to the s&p then all the funds will have to buy it. If they have a blowout quarter, which knowing Tesla they could absolutely throw a stinker out there or post god like results; there could be a mad panic to buy it and big money is just protecting themselves ahead of time. They have to add now and assume downside risk to avoid having to pay 1500/share post earnings and risk their reputation. \n\nJust look at the options premiums. They forecast massive moves in either direction. It will react big in one way or another no matter what.", "score": 12, "replies": [{"body": "I'm willing to risk it all for TSLA tendies", "score": 5, "replies": []}]}, {"body": "Don’t try to time the top of something like this. If it’s going to pop, the price is so inflated, there’s plenty of time to short it after the down trend is confirmed.", "score": 3, "replies": [{"body": "I remember when amazon also had infinite pe and ppl were swearing it was gonna pop any day now lol", "score": 8, "replies": [{"body": "If people use pe as a serious metric when it gives you infinite pe, then you know they're lazy. If you think join can trade stocks by simply dividing price by earnings without another more complex analysis...\n\nWell you're here so you're in a place you belong.", "score": 2, "replies": [{"body": "Well wen ppl say price inflated they usually first point to high pe levels lol but yea using pe to trade is retarded", "score": 2, "replies": [{"body": "Using p/e is for back of the hand analysis. It's not mean for directly comparing high growth companies with mature stable boring businesses. It literally is explained this way.\n\nHow people can take the metric seriously, like it's not some rough shitty math is mind boggling. How bad at this can you possibly be to take one year of earnings and extrapolate that as the value of the company? Earnings change over time you lazy fuck. \n\nMultiple analysis (using p/e and other snapshot multiples) is for the lazy idiots. Those people who do it in the financial world are the laziest and least intelligent of people possible. Outside of it, well, you just don't know how stupid it is to use.", "score": 1, "replies": [{"body": "Yup", "score": 1, "replies": []}, {"body": "And yet, p/e including projected future p/e is the only thing that gives a stock intrinsic value.", "score": 1, "replies": [{"body": "Are you being serious? Do you think p/e is the way a pro actually values a stock?  It's a back of the hand metric get it through your head. \n\nDiscounted cash flows is what gives a stock intrinsic value. ALL FUTURE CASH FLOWS. \n\nP/e only looks at one year, it's not a model. Are you really this dense? Or do you not know what a discounted cash flow model actually is?", "score": 1, "replies": [{"body": "Idk, maybe you could read what I read instead of reacting to something you think I said?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yes, but no, but also yes.\n\n$TSLA is on a run because they're doing great, but also because of battery day, but also because of S&P, but also because of CyberTruck, but also because of Semi, but also because of RoadsterII, but also because of the Chinese Compact, but also because...", "score": 3, "replies": [{"body": "What's new in what you said? Battery day was announced in April, if not before. The Cybertruck was revealed last year.", "score": 2, "replies": [{"body": "Someone made a FB meme and now boomers know about Tulsa", "score": 2, "replies": []}]}]}, {"body": "What is battery day?", "score": 3, "replies": [{"body": "They never ask how is battery day", "score": 25, "replies": [{"body": "FUCK this made me chuckle", "score": 1, "replies": []}, {"body": "Why is battery day?", "score": 1, "replies": [{"body": "The real question is when is battery day?", "score": 3, "replies": [{"body": "September!", "score": 2, "replies": []}, {"body": "Who is battery day?", "score": 1, "replies": []}]}]}]}, {"body": "It's the day after assault day.", "score": 6, "replies": []}, {"body": "A day when Tesla will supposedly present break throughs in battery tech.", "score": 3, "replies": [{"body": "But they keep moving it back a few months so something is going on.", "score": 2, "replies": [{"body": "They want to time it with infrastructure week", "score": 1, "replies": []}]}]}]}, {"body": "Q2 earnings is before battery day which is more important given its S&P implications. The run up may be attributed to a short squeeze but also institutions buying in preparation to add it to their S&P index funds.", "score": 1, "replies": []}, {"body": "Apparently Tesla would be doing a 3 day battery day. Day 1 battery, Day 2 Manufacturing tour, then Day 3 announcement of next Gigafactory. Stock would definitely go up during those days", "score": 1, "replies": []}, {"body": "Wall street doesnt give a fuck about the technology, they care about sales, they are short term thinking fucktards. Only followers and fans care about the tech. Wall street will care if q2 is a profit though, which it most likely will.", "score": 1, "replies": []}, {"body": "I'm shorting TSLA starting Monday at close. if it fails I all in heavy Wednesday, that fails I am busto.", "score": 1, "replies": [{"body": "Why would you do that?", "score": 1, "replies": []}]}, {"body": "Wtf does Kroger’s have to do with Tesla", "score": 1, "replies": []}, {"body": "it's run up to q2 results which will include TSLA in s&p500, which will force inclusion in many index funds, which will propel share price.", "score": 1, "replies": []}, {"body": "Battery’s are just place holders to hydrogen. In my uneducated opinion", "score": 1, "replies": [{"body": "OK fueler", "score": 1, "replies": []}]}]}
