{"title": "Can we stop with the dumb tesla \"DD\" posts?", "selftext": "[removed]", "id": "hma502", "created_utc": 1594050710.0, "score": 176, "upvote_ratio": 0.83, "num_comments": 73, "comments": [{"body": "> **Can we stop with the dumb ... \"DD\" posts?** \n\nFTFY. Tbh I wish mods would be more strict about what qualifies as a \"DD\" post and what doesn't. Although I get why they don't - it would be overwhelming pretty quick. I swear, about 8/10 of the last \"DD\" posts would be better flagged as discussions. Or even as shitposts.", "score": 20, "replies": [{"body": "I don't even know why \"shitpost\" tag exists. Isn't shitpost a given?", "score": 3, "replies": []}, {"body": "Yeah exactly my point", "score": 3, "replies": []}]}, {"body": "We're fine with being stricter with DD posts but pls don't rally around the inevitable angry OP whose shitty DD post got struck down when he makes a follow-up \"REEE MODS\" post and says we lost you a once in a lifetime $1,000,000 opportunity. We tend to bounce between a state of \"mods gay, stole my post\" and \"mods gay, too many post\".\n\nI'll inform the boys.\n\nBTW you can use votebot to destroy those posts early if we're not weeding them out.", "score": 1, "replies": [{"body": "Thank you, gay mod", "score": 1, "replies": []}]}, {"body": "Sounds like someone had TSLA puts", "score": 135, "replies": [{"body": "You really think I have the money to buy tesla puts? I live in my moms basement investing my 2 dollars in jc penney. Fucking retard", "score": 100, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "> dweeb\n\nOkey im_not_a_grill. You can't call me a dweeb when you got the dweeb name, dweeb", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Who needs to research Bill Ackman ?", "score": 0, "replies": [{"body": "Wasn’t he a linebacker for Green Bay back in the 90’s?", "score": 1, "replies": []}]}]}]}, {"body": "Bill Ackman bet against the US economy and made a fuckload of money a couple months ago. Who tf cares about Herbalife", "score": 1, "replies": []}]}]}, {"body": "Imagine losing money while the money printer is operating at 100% efficiency.\n\nNikola doesn’t even have a revenue stream, has only 262 employees, yet is worth $18B and even at one retarded point was worth more than fucking GM, a company with 164,000 employees and $137 billion in revenue.\n\nIf you buy puts, Jpow and Donny Pump should deport you.", "score": 6, "replies": []}, {"body": "Aahahahahaa Bahamas", "score": 3, "replies": []}]}, {"body": "TESLA NUMBA ONE", "score": 37, "replies": [{"body": "Elon for vice president.  Yelon 2020", "score": 13, "replies": []}, {"body": "My mans had Tesla puts💀💀", "score": 15, "replies": [{"body": "Poor gay lol", "score": 9, "replies": []}, {"body": "I did after riding call all last week dumped everything I to puts.... Didn't actually lose nearly as much as I though I would but sold immediately this morning.", "score": 1, "replies": []}]}]}, {"body": "Let them have their time in the sun - the stock is going parabolic. Once the retards finish FOMOing we’ll start seeing the loss porn posts", "score": 21, "replies": [{"body": "Yea yea then Elon unveils the roadster being production-ready...", "score": 3, "replies": []}, {"body": "This is how we do it.... the tears will be that much sweeter once the fall comes.", "score": 4, "replies": []}, {"body": "It’s on my watch list for this very reason.\n\nOne day it’ll be realized that it’s not larger than Toyota and never will be.", "score": 3, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Here comes the great \"TeSLA iS jUsT lIKE AppLE\"", "score": 10, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Apple made a shitload of money making iphones from day 1.", "score": 3, "replies": [{"body": "Big differences between cell phones and cars", "score": 2, "replies": [{"body": "That's the point.", "score": 0, "replies": []}]}]}, {"body": "So you are telling me that I should buy tesla at 1300 per share? [Please go here if you do](https://en.wikipedia.org/wiki/Lunatic_asylum)", "score": -3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Just because the price is 1300 doesn't mean it should be worth 1300, your logic makes no sense. Will talk in couple years and you will see that you were fucking retarded", "score": 3, "replies": [{"body": "ARC actually evaluated Tesla’s business and future and determined they should be at 4500.  Keep fighting it, this stock is going up.  Tesla literally has no competition, they’ve won.", "score": 5, "replies": [{"body": "Tesla has no competition? There will be tons of electric cars in the next few years", "score": 0, "replies": [{"body": "Oh really?  Where the battery capacity?  Where are everyone’s gigafactories?  Can’t have electric cars without batteries... Elon has 3, is building his fourth, just built land in Texas for his 5th... GM is the only company I’ve heard of even investing, and they don’t plan to break ground till 2023.  How is everyone going to compete with a vertically integrated Tesla that drives itself years before anyone else can?", "score": 2, "replies": [{"body": "Do you have an Elon shaped dildo? The special edition one?", "score": 0, "replies": [{"body": "https://i.imgur.com/ApTRfJJ.jpg", "score": 1, "replies": [{"body": "lol nice meme. THATS not wrong....", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lets talk in a year. The stock is irrational, don’t need you to message me daily to ask for comments on daily stock price movements.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good luck as well. I got nothing against tesla, think it’s a great company. Just don’t agree with the valuation and we will see in a year who was right", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I'm generally bullish but find the Tesla blast to the moon insane and am also watching it.  Being serious, what are your criteria for securing a short position? I don't think it drops heavily until after battery day, or better yet the election. That doesn't mean there won't be pull backs to the moving averages.  There are no parameters for watching this stock so it's basically a guessing game, and I'm curious as to what you think.", "score": 3, "replies": [{"body": "I’m not short and likely won’t play with this stock. I have traded it previously but I don’t mess with insane stocks or insane women. They both can cost you. Lol.", "score": 11, "replies": [{"body": "Fair enough", "score": 1, "replies": []}]}, {"body": "Reminds me a lot of the cr*pto boom end of 2017. Lots of reasons to like certain projects and correlate success to progress, but in reality it is all hype.", "score": 1, "replies": []}]}]}, {"body": "Infinite gamma squeeze you retard", "score": 1, "replies": []}]}, {"body": "If anyone looks at 90% of the DD on this site and thinks \"hmm yes, this is a logical analysis\" then they deserve to lose their money", "score": 6, "replies": []}, {"body": "How much did you lose?", "score": 7, "replies": []}, {"body": ">  that will skyrocket the stock to mars \n\n&#x200B;\n\nIs this a DD post disguised as a non DD post?", "score": 3, "replies": []}, {"body": "Sounds like someone doesn't like to make money.", "score": 3, "replies": []}, {"body": "Positions or ban", "score": 3, "replies": []}, {"body": "Or you could just listen to the \"dd\" and make money.\n\nHow many times does Tesla need to go fucking vertical before people figure out to buy calls. \n\nYou honestly can't help people here no matter what. They don't want to make money. \n\nTesla stops to $300 during the pandemic and people don't ride the wave again... People on here seriously hate money.", "score": 5, "replies": []}, {"body": "Ford makes 2.4 million vehicles a year. That is more than 6X what Tesla makes. Ford market cap 24 B. Tesla market cap 246 B. \n\nWith that said, I don't have a long or a short position in TSLA. I wish I bought the stock a year ago, but at this point it is seriously overpriced.", "score": 4, "replies": [{"body": "Queue the 'Tesla is not a car company, it's a tech company' posts.", "score": 6, "replies": []}, {"body": "Comparing Ford to Tesla is like comparing a low budget grocery store (Aldis?) to Whole Foods. They are in the same business but they aren't in the same business.", "score": 3, "replies": [{"body": "It doesn't have to be Ford. That was just an example. Tesla's market cap is about 40B higher than Toyota. Imagine that.", "score": 3, "replies": [{"body": "Toyota is indeed a better comparison, as it has grown its revenue by 50% per year for the last 5 years and shows no signs of stopping. \n\nTo the readers that aren't following the subtleties of the interest rate climate since 2008, this is exactly what the market wants Toyota to do, as sustainable growth is priced at a premium when interest rates are zero.", "score": 2, "replies": []}]}]}, {"body": "You just have proven that the number of vehicles is irrelevant.If you think that Tesla stock is overpriced, it means that free tendies are waiting for you and you can short it.If you think that Ford in undervalued, you can buy its shares - 6$", "score": 1, "replies": [{"body": "Are you new to trading? Tsla is definitely overpriced as it is trading over 300x it's p/e ratio. Just because something is overpriced doesn't mean shorting it will make you money lol. \n\n\"The market can remain irrational longer than you can remain solvent\"", "score": 1, "replies": []}, {"body": "Shorting is very difficult even for professional investors. Your timing has to be perfect. The stock can continue to go up even if it doesn't make any sense from a valuation standpoint. \n\nAs far as Ford goes, I think that the stock is fairly valued. They are not really growing as a company.", "score": 1, "replies": []}]}]}, {"body": "It’s due to the limited release short shorts🚀🚀🚀", "score": 4, "replies": []}, {"body": "Can we stop with the dumb “I don’t have anything of my own to say, I just don’t like your posts” posts?\n\nThis sub belongs to the autists of all varieties, including but not limited to Tesla fanboys.", "score": 3, "replies": []}, {"body": "You have to understand, Tesla has been extremely undervalued for years.  Anytime the fanboys speak up, they’re criticized.  According to the haters, Tesla was supposed to be out of business, dead to competition, ‘never gonna make it’,  stock will never break 300... now Tesla is one of the top 20 corporations in the world, and haters are STILL doubting.  \n\nTry and silence people if you want, but that’s not gonna make you right.  This stock is just getting started.", "score": 3, "replies": []}, {"body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=hma502&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=hma502&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=hma502)\n___\n ^comment ^will ^disappear ^--- ^94 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "https://youtu.be/XlVOJg23QZ0", "score": 1, "replies": []}, {"body": "Little did OP know, Elon Muskrat will die king of mars at the age of 69, a multi trillion air.\n\nAfter monopolizing the electric car market by copying Henry Ford and spending all his tech boi money on more money, TSLA peaks at 69,420 a share only for musk to exit the company at the peak of the bubble.\n\nOP was buying puts, at an RSI of 75 in a massive uptrend while musk’s short shorts sell out.", "score": 1, "replies": []}, {"body": "I didn't really read any of this, bit I saw Tesla and DD, so I'm gonna go ahead and buy 🚀🚀🚀🚀🚀", "score": 1, "replies": []}, {"body": "Being able to siphon out the useful DD from all the retarded shit is like the entire point of this subbreddit. \n\nSometimes what looks like the dumbest shit is actually genius level DD, sometimes what claims to be an intellectual discussion post ends up being just retarded. You never know in this place.", "score": 1, "replies": []}, {"body": "Elon paid good money for those posts.", "score": 1, "replies": [{"body": "where do I collect money?", "score": 2, "replies": []}]}, {"body": "tsla $4200.69 EoY", "score": 1, "replies": []}, {"body": "no positions in post. ban", "score": 1, "replies": []}, {"body": "Someone sounds like sower puss gay bear that covets thigh tendies!", "score": 1, "replies": []}, {"body": "Agreed", "score": 1, "replies": [{"body": "It is the messiah!", "score": 2, "replies": []}]}, {"body": "No", "score": 1, "replies": []}]}
{"title": "$TSLA", "selftext": "", "id": "hmf5mu", "created_utc": 1594065274.0, "score": 1432, "upvote_ratio": 0.92, "num_comments": 79, "comments": [{"body": "The gap between their shirt and pants was like the bid/ask spread on some of my PDD calls.", "score": 493, "replies": [{"body": "Hahajahaha lmaofao", "score": 45, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "What a dated reference lol", "score": 10, "replies": []}]}, {"body": "What date/strikes you got?", "score": 3, "replies": []}, {"body": "\"The Rips on this one?\"  Jordan Belfort", "score": 3, "replies": []}, {"body": "Right ??? This is so goddamn irreverent I can't help but love it.", "score": 1, "replies": []}, {"body": "Pdd is a g", "score": 1, "replies": []}]}, {"body": "Seriously wtf is $TSLA doing? I’m making so much money I’m scared", "score": 156, "replies": [{"body": "same dude! like this really should not be legal..... im just a boy", "score": 68, "replies": [{"body": "Same. I'm up $62,000 today alone. It's kind of worrying of a fall.", "score": 52, "replies": [{"body": "Pic or ban", "score": 13, "replies": []}, {"body": "Sell some to cover the initial investment and let the rest ride", "score": 29, "replies": []}, {"body": "This is what mania looks like", "score": 7, "replies": []}, {"body": "Yo how?? What’s your strategy ?", "score": 4, "replies": [{"body": "Trust me, if you saw his all time graph you wouldn’t want to know his strategy.", "score": 46, "replies": [{"body": "MONEYLINE, ALL THE TIME", "score": 12, "replies": []}]}, {"body": "It's actually really boring. I've been buying tesla for 5 years now and have built up to 300 shares and I'm pretty sure I have better returns over that time than 95% of the autists on here.", "score": 9, "replies": [{"body": "Would you recommend just setting a automatic deposit of $20 every week or something like that into TSLA? I’m not sure if that is something people do to gain more into a stock, overtime it will go up usually. Still take profits and buy dips, sale highs of course, but is that initial deposit thought something people do?", "score": 2, "replies": [{"body": ">$20 every week \n\nSounds pretty smart. After two years you'll be able to buy a whole share.", "score": 22, "replies": [{"body": "Like instead of into my Roth IRA it goes into Tesla 😂", "score": 3, "replies": []}, {"body": "Well I have 1 share right now, I’ve made about $1,300 on TSLA so far, but am wondering if I should be setting a auto deposit type of thing up with it", "score": 2, "replies": []}]}, {"body": "Some brokers offer this shit.  [fractional-shares](https://www.schwab.com/fractional-shares-stock-slices?src=SEM&keywordid=21491749952&s_kwcid=AL!5158!10!78958745209617!21491749952&ef_id=Xs8vSwAAAHlCQlvC:20200707075632:s)", "score": 1, "replies": [{"body": "Most brokers do now, Schwab just started it", "score": 1, "replies": []}]}]}]}]}, {"body": "One of the ones I manage was up 72 lol . I can't get the magic to work on Robinhood tho only TD", "score": 1, "replies": []}]}]}]}, {"body": "Time to invest in a $BELT that works.", "score": 82, "replies": [{"body": "Happy cake day dude.", "score": 6, "replies": []}]}, {"body": "That gentleman’s pantaloons have fallen down.", "score": 26, "replies": []}, {"body": "6 black guys =6 signs = 6 flags \n\nCalls on 6 flags", "score": 66, "replies": [{"body": "Calls on 6 fags? \n\nI'm in.", "score": 26, "replies": [{"body": "Yeah they are all definitely about to lick each others buttholes like its the last bite of some homemade ice cream.", "score": 1, "replies": []}]}, {"body": "I believe they are Crips?", "score": 3, "replies": [{"body": "You're thinking of the Crypts and the Menses.", "score": 2, "replies": []}]}, {"body": "Pants down means puts. So count the folks 3 puts, 2 calls, yellow jacket, must be theta gang", "score": 3, "replies": []}, {"body": "6 red flags", "score": 1, "replies": []}]}, {"body": "Fuck pants.", "score": 31, "replies": [{"body": "Have you seen them Tesla booty shorts tho????????", "score": 20, "replies": []}]}, {"body": "owning $TSLA stock and way out of the money TSLA calls aren't the same thing", "score": 29, "replies": [{"body": "kind of like dating a prostitute", "score": 13, "replies": [{"body": "hahaha great analogy.\n\nso how mean did you have to be to get that flair?", "score": 2, "replies": [{"body": "Calling all the mods on their bullshit. Easy to do. Also those fuckers don’t like bytecoin and I do.", "score": 3, "replies": [{"body": "Well they have an amazing background on their PC website...you son of a bitch I’m in for half a million BCN ($200)", "score": 2, "replies": []}]}]}]}, {"body": "Yes have fun when your shitty otm calls get destroyed today in Tesla's -5% correction meanwhile share gang will fuck your wife because options are for wagecucks.", "score": 1, "replies": []}, {"body": "Fractional SON \n\nMy $100 portfolio got 100 bluechip stocks.", "score": 1, "replies": []}]}, {"body": "I have no idea how this sub made it through the reddit purge.", "score": 42, "replies": [{"body": "😂", "score": 16, "replies": []}, {"body": "This shits too hot fam. Can't touch it.", "score": 2, "replies": []}]}, {"body": "MONEY IS HEAVY FAAAM", "score": 7, "replies": []}, {"body": "Ditching the $F that I’ve been swing trading for $TSLA shares", "score": 5, "replies": []}, {"body": "dude on the right is my dad", "score": 7, "replies": []}, {"body": "We really trying to get cut on the next round ain't we.", "score": 6, "replies": [{"body": "I can't imagine it will ever happen if it hasn't already. Good lord... I mean REALLY! The shit people here have been positing since the beginning is all very sketch lol. But I don't think it constitutes hate speech even though many slurs are used.", "score": 2, "replies": []}]}, {"body": "calls on Black n Milds, Newports, Olde English, and St.Ides", "score": 11, "replies": [{"body": "$BTI (Newport’s) & $MO (black & milds) are ok but I am still waiting for the Swisher Sweet IPO.\n\nYou can get in on Old English 800 $ by buying $TAP", "score": 2, "replies": []}, {"body": "Lol, st. Ides. I remember that old school shit", "score": 2, "replies": []}]}, {"body": "Poor gang has $F stock :(", "score": 2, "replies": []}, {"body": "He may as well in a pair of tsla short shorts to cover his backside too", "score": 2, "replies": []}, {"body": "i’m white but i upvote ok :)", "score": 2, "replies": [{"body": "ty 4 your donation :)", "score": 2, "replies": []}]}, {"body": "Can somebody explain the pants situation to me? This can not be good for running or even walking around.", "score": 7, "replies": []}, {"body": "Mericsn made like my dik", "score": 1, "replies": []}, {"body": "Do you even droop, bro?", "score": 1, "replies": []}, {"body": "Why are all of their pants pulled down 📉", "score": 1, "replies": []}, {"body": "What’s the options move rn??", "score": 1, "replies": []}, {"body": "I’m holding Nov 1400, 1450. If we pop tomorrow, I plan to roll to Feb21 and let them sit there til nov/Dec. have a some 7/10 $1400 that I’m looking to unload tomorrow", "score": 1, "replies": []}, {"body": "Why even wear pants?\n\nEdit: I forgot what sub I was in", "score": 1, "replies": []}, {"body": "is this some kind of satire? Do people really wear their pants around their ankles?", "score": 1, "replies": [{"body": "fuck hips, all my niggas own $LULU", "score": 1, "replies": []}]}, {"body": "Can we al start a go fund me to buy these guys pants that fit?", "score": 1, "replies": []}, {"body": "The store owner owns a ford....I can tell, that's how he owns a business and not some microwave car.", "score": 1, "replies": []}, {"body": "So I have this theory about black people that wear their pants super low aka low riders. \n\nIt's not common now, in my area, but when it was common it may have been isolated to low income black men who couldn't afford clothing that actually fit, so they low-rided and a fashion style and over time it gained legitimacy.\n\nI can't imagine any self-respecting person waking up one day and choosing to do this as a choice among his/her peers", "score": -7, "replies": [{"body": "Just because you don't understand it doesn't mean they are not self-respecting.", "score": 3, "replies": [{"body": "Fair enough", "score": 5, "replies": []}]}]}, {"body": "KARABOGA", "score": -1, "replies": []}, {"body": "I’ve made $1,300 so far on TSLA🙏🏼", "score": -1, "replies": [{"body": "I have like $200 left and I can't afford any TSLA calls at all and I'm PISST", "score": 1, "replies": []}]}]}
{"title": "Let’s get the guy who made $4m on TSLA onto every news network in the country", "selftext": "[deleted]", "id": "hmj4yj", "created_utc": 1594078136.0, "score": 707, "upvote_ratio": 0.94, "num_comments": 80, "comments": [{"body": "Hi? SEC? Yeah I’d like to report a murder", "score": 247, "replies": [{"body": "It's an acronym, middle word is Elon's", "score": 75, "replies": [{"body": "Subsidize Elon's Corporations", "score": 46, "replies": [{"body": "That's funny til you remember elon mislead shareholders to force tesla to buy solar city to avoid personal bankruptcy.", "score": 8, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "I don't know, but Pete Rose is still banned from baseball.", "score": 12, "replies": []}, {"body": "Ask shkreli", "score": 5, "replies": [{"body": "Exactly what I was thinking. #freeshkreli", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "That’s nothing. A guy on Tesla investors club bought 2000 6/2022 1800 calls at around $500. \n\nWorth around 76 million now.", "score": 154, "replies": [{"body": "Someone made a $1 million YOLO? Had to be chump change to him.", "score": 52, "replies": [{"body": "Nope, he sold all his shares last year at 180 and bought $420 calls for June 2020, cashed those out, bought puts before Covid cashed them out, then bought the calls at $500 on the way back up. Started with 20K lol", "score": 71, "replies": [{"body": "What the fuck is there a post for this", "score": 45, "replies": [{"body": "No he’s just well known in the Tesla investor community for this move. His name is setheroth28036 check out his post history", "score": 31, "replies": [{"body": "Well shit I was so close to replicating that except I only did the first step of selling low in 2019, F", "score": 20, "replies": []}, {"body": "Someone needs to do a cross post with his story onto here. That would be a top all timer", "score": 12, "replies": [{"body": "Yeah basically a god. But he’s a modest guy so I’m not going to be the one to do that. If it was me I’d ask him first cause I’m sure people would blow him up. He hasn’t posted gains but he did post pics of the 2000 contracts when he bought them", "score": 11, "replies": [{"body": "Yeah low key stalked the dude and was seriously disappointed at the lack of gain porn...hopefully he decides to bless us with that story", "score": 5, "replies": []}]}]}, {"body": "u/setheroth28036 (only way I know how to find people on Reddit)", "score": 6, "replies": []}]}]}, {"body": ":/.....", "score": 1, "replies": []}]}]}, {"body": "I wish that man was me. That would be amazing because I would have alot of money", "score": 9, "replies": []}, {"body": "He only needs to sell 26 of those to cover his initial investment wtf.", "score": 3, "replies": [{"body": "He only needs to sell one. Each one is work 38K right now", "score": 6, "replies": [{"body": "Check your math, he bought 2,000 calls at $500 each.", "score": 3, "replies": [{"body": "what lol, if each contract traded at $500 when he bought then that means he put in about 100M lol.\n\nEDIT: I just checked the historical price for that option, it had a low of $21 dollars on March 18th when the underlying was at $361. If he bought at the exact, exact bottom and timed it perfectly (which I doubt), and bought 2000 contracts, that means he bet about $4.2M. \n\nIf this is real and not bullsit and he had that much money to throw around at OTM LEAPS, hes not some normal dude who just got lucky lol, he knows his shit and was already rich (or he started with nothing and built his way up to 4.2M, and then bet it all...)\n\nEDIT 2: went through his post history, he bought 2k at a option price of $34.7, which is roughly $7M.", "score": 1, "replies": [{"body": "$500 x 2000 = 1M\n\n$500 per contract, not $500 per share. $500 per contract means it was $5 per share. Learn math jesus christ\n\nAnd I was basing the $500 off of what other people said, but congrats on spending all that time looking it up but still can’t do simple multiplication", "score": 1, "replies": []}, {"body": "I meant  when the stock was $500", "score": 1, "replies": []}]}]}]}]}, {"body": "math doesnt add up", "score": 7, "replies": [{"body": "2000 x $38353", "score": 15, "replies": [{"body": "qwik maf checs out now", "score": 16, "replies": []}]}]}, {"body": "Fuck what a ride", "score": 1, "replies": []}]}, {"body": "And you need all this to happen before the end of this month?", "score": 116, "replies": [{"body": "[deleted]", "score": 93, "replies": [{"body": "First state of the union:\n\nMy fellow Americans,\n\nPoopy-di scoop\nScoop-diddy-whoop\nWhoop-di-scoop-di-poop\nPoop-di-scoopty\nScoopty-whoop\nWhoopity-scoop, whoop-poop\nPoop-diddy, whoop-scoop\nPoop, poop\nScoop-diddy-whoop\nWhoop-diddy-scoop\nWhoop-diddy-scoop, poop", "score": 43, "replies": []}, {"body": "*jojo 2020", "score": 12, "replies": []}, {"body": "Kanye Musk 2020", "score": 15, "replies": [{"body": "Elon musk is an African. He can’t run.", "score": 14, "replies": [{"body": "But he can jump", "score": 12, "replies": []}, {"body": "the fuck are you talking about, dude is white", "score": -8, "replies": [{"body": "From South Africa chunk.", "score": 11, "replies": [{"body": "no, white people can't physically live in Africa because they get dehydrated, dude, I don't care if it's south or north\\~  didn't you study geography in elementary school>?", "score": -2, "replies": [{"body": "Geometry?", "score": 9, "replies": []}, {"body": "You should go back to school", "score": 5, "replies": []}]}]}, {"body": "I know we’re retarded but I didn’t think we were stupid...", "score": 3, "replies": []}, {"body": "That was extremely racist. He’s from the country of South Africa. He can’t run for president of the US because of that", "score": 4, "replies": [{"body": "I wouldn’t say, “racist”. More like ignorant. Kind of how you are ignorant to call him a racist.", "score": 2, "replies": []}]}]}]}]}, {"body": "Kanye 🤮 🤮", "score": 17, "replies": []}]}]}, {"body": "[deleted]", "score": 24, "replies": []}, {"body": "Wanna pic of my dick retard?", "score": 66, "replies": [{"body": "[deleted]", "score": 118, "replies": [{"body": "Retarded shit like this makes me happy :)", "score": 22, "replies": []}]}]}, {"body": "Elon you can’t convince us to drive your stock up anymore. You have to sell cars now.", "score": 21, "replies": [{"body": "Why buy the car with your own hard earned money when you can get Jpows printer to do it for you?", "score": 7, "replies": [{"body": "Keep going up and we will all buy teslas with the tendies. The history books will call it Teslas For Tendies. it will will be beautiful and retarded!", "score": 3, "replies": []}]}]}, {"body": "Sir this is a gas station", "score": 60, "replies": []}, {"body": "Try 4chan or an Asian social media farm.", "score": 14, "replies": []}, {"body": "Elon is already 1 step ahead of you", "score": 11, "replies": []}, {"body": "When I recall what happened following the fortnite World Cup where a 16 year old won $3 Million, I think this is the most solid choice.", "score": 5, "replies": []}, {"body": "Just wait,  his account will end up fake", "score": 11, "replies": []}, {"body": "Shoot I'm just glad I got access to fractional shares and dumped $100 into Tesla last week.", "score": 10, "replies": [{"body": "Have fun with your 14 dollar profit", "score": 25, "replies": [{"body": "14% profit in a week? Sweet. Sign me up.", "score": 16, "replies": []}, {"body": "As much as I wish I could've thrown down thousands, I'm a poor college student with just enough money to have some fun. So yes I will enjoy my 14 dollar profits, thank you very much", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks my man. And that's the plan. Learning something new everyday so someday soon i can become a true autist!", "score": 1, "replies": []}]}]}, {"body": "found the retard losing tens of thousands on TSLA puts", "score": 1, "replies": []}]}]}, {"body": "Just because elon is African iir is not ok to call him the n word!", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Come on. Don't be like that.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "SUCK ELONS COCKASARUS", "score": 3, "replies": []}, {"body": "Ill send you a picture of my nuts", "score": 2, "replies": []}, {"body": "Praise the 12 year old that knows photoshop more please.", "score": 2, "replies": []}, {"body": "Now he can make $10M selling e-courses explaining how he did it", "score": 2, "replies": []}, {"body": "We know it's you Elon, stop using throwaways.", "score": 2, "replies": []}, {"body": "Have fun getting butt fucked in prison when SEC find you ❤️🧡💛💚💙", "score": 2, "replies": [{"body": "Gotta be for personal gain and I’m too big of a pussy to play the Shkrelli game.", "score": 8, "replies": []}]}, {"body": "Mods ban. We don’t need more publicity for this sub", "score": 2, "replies": []}, {"body": "Illegal pump and dump but it’s not a penny stock and we’re gonna pump and hold so I’m on board. Godspeed", "score": 1, "replies": []}, {"body": "Y'all nasty", "score": 1, "replies": []}, {"body": "This is why the SEC wants to shut us down!", "score": 1, "replies": []}, {"body": "No one gives a fuck. Hope you lose it tomorrow", "score": -13, "replies": [{"body": "Somebody must’ve put tesla puts", "score": 29, "replies": [{"body": "Somebody must’ve put his dick in your mouth.", "score": -17, "replies": [{"body": "Elong Tusk must've pegged you.", "score": 10, "replies": []}]}]}]}, {"body": "How about me? I made 1M from NIO", "score": -1, "replies": []}, {"body": "Epstein’s island is open for the taking, someone’s just gotta take it.", "score": 0, "replies": []}]}
