{"title": "TRADE: HPQ Earnings play", "selftext": "Pretty boring week. Closed out My AAPL and YHOO bear strategies from the start of the week for small but healthy profits. Thanks to those of you that down voted ;)\n\nI'm playing HPQ for the upside today sold the 38 call and bought two 39 calls. for a total debit of 0.00$ ha\n\nAlthough I could care less about this company this chart suggest we could have a nice run on the upside if it breaks the top.\n\nhttp://imgur.com/RnAQWMg\n\nJust another coin flip play.\n______________________\n\nWOMP WOMP! ha Free earnings play, can't complain~!", "id": "2nehqs", "created_utc": 1416944762.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": ">I'm playing HPQ for the upside today sold the 38 call and bought two 39 calls. for a total debit of 0.00$ ha\n\nHahaha, awesome.  ", "score": 2, "replies": []}, {"body": "whats the expiration on those calls? nov 28? meaning that you are planning to sell tomorrow?", "score": 1, "replies": [{"body": "Yeah Nov 28, If they are ITM, I should see some profits as IV is really low. If they are OTM I will let them expire. ", "score": 2, "replies": []}]}, {"body": "I was about to comment on how HPQ went straight to your max loss.  But it's still rising.  \n\nAre you still in it?  What a nail biter.", "score": 1, "replies": [{"body": "Hahah Yeah I'm still in it, just need 1 more dollar! Not the best week for this type of play. But we will see! ", "score": 2, "replies": []}]}, {"body": "Looks like one of those \"sunny side\" trades that tasty traders do.\n\nInteresting P+L.  The expected move to the upside is almost max loss, but there's no risk to the downside and unlimited upside past the expected move.", "score": 1, "replies": [{"body": "I'm not familiar with the \"sunny side\" spread ha but yes tomorrow profit will be easier to grab then waiting for the half day on Friday to get any. IV \"collapse\" shouldn't be to bad. if the move remains stagnant. I'll hold till EOD tomorrow. ", "score": 2, "replies": []}, {"body": "no, this is called back ratio spread. Similar to the butterfly just without the other end of the wing. ", "score": 2, "replies": [{"body": "Thanks for the name of it, was un sure. to many names for spreads haha", "score": 1, "replies": [{"body": "Anytime you have asymmetric numbers it's a ratio spread. The \"back\" part comes from the crossover into the profit making portion once the underlying moves into it.\n\nLooks like your play worked out. ", "score": 1, "replies": [{"body": "I figured I was selling a ratio instead of buying one. ", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I think this proves this was a good set up that just didn't make it... \n\n1st, I'm not cocky just telling people to piss off when they down vote for no reason. \n2nd this is the first losing trade in the last 5. Not saying I don't have losing trades or make bad calls, but I try to only post quality trades, this setup had no risk to the down side, cost 0.00 in initial debit, and had a perfect chart set up. Just because it doesn't work out all of a sudden it proves what? Go ahead and down vote this too, Im done with this sub reddit, only a few good traders here anyways, the rest are people like you mad for no reason toward me for sharing trades that 80% have worked out...", "score": -1, "replies": []}]}]}
{"title": "Apple's market capitalization tops the $700 billion mark!", "selftext": "", "id": "2ndxam", "created_utc": 1416934925.0, "score": 16, "upvote_ratio": 0.78, "num_comments": 15, "comments": [{"body": "The immediate trigger is the expected holiday season sales. That might push the market cap beyond $800B post the holiday season results. \nLong term it will be a challenge as it will completely depend on new products. iPhone may not enjoy the premium position forever, mobile phones are bound to get commoditized. Whether iWatch can significantly contribute to top & bottom lines is questionable. iPad sales are dropping and the tablet market seems to have reached plateau. ", "score": 2, "replies": [{"body": "All good points. Perhaps the decline in iPad sales is due to to the fact that upgrade times between iPad's is generally lower than that of, laptops for example. Im interested to see how the IBM partnerships affects iPad growth.", "score": 0, "replies": []}]}, {"body": "Would love a push to $130 before the New Year and $150 by the end of 2015.\n\nLong since $45", "score": 2, "replies": [{"body": "You awesome bastard!  Congrats!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "1T easy in 2015...? Keep dreaming.", "score": -5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "This is the opposite of conservative. \n\nYou're being too liberal here.", "score": -5, "replies": [{"body": "Holy shit people, it's a joke.  The guy was joking!", "score": 12, "replies": [{"body": "  *Whoops I just got it*\n\n  *Was a brain-fart on my part*\n\n  *Need to get some sleep*", "score": 4, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -12, "replies": [{"body": "All hail AAPL ", "score": 5, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "You probably have a small dick though.", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "A small vagina?", "score": 3, "replies": [{"body": "Oppositer", "score": 1, "replies": [{"body": "So you have a huge vagina?", "score": 1, "replies": [{"body": "YES!", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Then you should be happy", "score": 3, "replies": []}]}]}]}]}
