{"title": "He Said, She Said: Trump says \"China broke the deal\" as China says \"Ready for fighting while talking\"; Investors say SELL", "selftext": " \n\n### US Stocks\n\n* **Global markets are seeing red this morning as both the US and China prepare for more trade talks today**, investotrs continue selling risk and this morning with **front-month Dow Jones minis -0.63%, S&P 500 minis -0.62% and Nasdaq 100 minis -0.77%**\n* **President Trump said China \"broke the deal\" he was negotiating** and that was why he threatened higher tariffs by Friday if there is not further progress\n* **Chinese state media said China ready for \"fighting while talking\"** as its delegation is due to start trade talks in Washington today\n* **More on US-China:** **Trump Launched Tweet Barrage at China after they Changed Their Tune on Agreed-to Trade Deal**\n* The most recent bond auction saw **demand for US 10-year Treasuries come at the lowest level in over a decade,** at 2.17 times the amount offered, fueling fears of those like **JP Morgan (JPM)** CEO Jamie Dimon, who warn of higher rates coming sooner than most think \n* Critics of the **tariffs** that President Trump is threatening to reinstate say they **could cut US GDP in half if they return**\n* Check out these **TOP CHINA STOCKS:** **Look East and Feast: Top Chinese Stocks to fill your plate (and portfolio) with NOW!** \n* These are our **TOP TECH STOCKS: TOTALLY TOP TECH! These are the BEST US Tech stocks you need in your portfolio NOW!**\n* **The VIX keeps rising:** **Run Forrest, Run! Investors Flee Risk Assets This Week as VIX spikes over 60%**\n* **The VIX is  moving up this morning and is currently at 21.21** after closing at 19.40 yesterday\n* **Apache Corporation (APA)** June 14 OTM Calls & Puts,  **iShares MSCI Emerging Markets ETF (EEM)** June 17 and July 19 OTM Puts and **Office Depot (ODP)** January 17 OTM Puts are the most actively traded options contracts in US pre-market trading this morning\n* US 10-Year Treasury Bonds are higher with yields down -3.06 basis points to 2.4529%\n* The US Treasury 2s-10s Spread has narrowed 0.83 basis points to 0.18%\n* WTI Crude is currently up 1.17% to USD$62.12/bbl with the Brent-WTI spread down USD$-0.82 to USD$8.73/bbl\n* Gold is currently little changed 0.15% to USD$1282.79/oz\n\n### Stocks Trending in the News\n\nClick name for Q-Factor breakdown, latest price details, more financial info and sentiment data.  \n \n\n* **Alphabet’s (GOOGL)** Google is struggling to convert its music customers to paying customers.  Google’s YouTube was revamped about a year ago and its YouTube Music service is a paid subscription that Google is trying to convert its free users to.  More people listen to music on YouTube than any other streaming service.  Users, however, have grown accustomed to its free price and have been resistant to signing up for paid subscriptions.  Alphabet cited this as part of the reason for its $1 billion revenue miss.  Alphabet is rated “Top Buy” in our US Large-Cap Global Top Stock Ideas and “Top Buy” in our US Information Technology Global Top Stock Ideas.\n* **Amazon (AMZN)** is being accused of violating kids’ privacy right with its smart speakers.  A child advocacy group filed a complaint with federal authorities complaining that Amazon records conversations of kids on its Echo Dot Kids devices.  The complaint alleges that Amazon records the conversations and then stores them in the cloud, even after parents delete it.   The complaint states the actions violates federal online privacy rules.  Amazon is rated “Neutral” in our US Large-Cap Global Top Stock Ideas and “Top Buy” in our US Consumer Discretionary Global Top Stock Ideas.  \n* **Boeing (BA)** convinced federal regulators that pilot new training for the new 737 Max, when introduced, was kept to a minimum, ex-employees allege.  Boeing convinced regulators the new version of the plane only required Level B training, which is a couple of hours on an iPad, and no time in a simulator.  Boeing wanted to limit the need for Level D training-which include extensive simulator time-so airlines could deploy the plane more quickly.  Boeing engineers convinced the FAA official in charge-someone with limited flight time-that the Level B training was sufficient.  Critics allege this may have contributed to the 737 Max crashed.  Boeing is rated “Top Short” in our US Large-Cap Global Top Stock Ideas and “Unattractive” in our US Consumer Staples Global Top Stock Ideas.  \n* **Exelon (EXC)** confirmed it is moving forward with closing the Three Mile Island nuclear power plant in Pennsylvania.  Exelon is making the move given that a bill to provide subsidies to keep them open has not moved forward in Pennsylvania’s legislature.  Exelon confirmed previously announced plans.  The plant will be closed by September 30th of this year.  Exelon is rated “Neutral” in our US Large-Cap Global Top Stock Ideas\n* **Intel (INTC)** provided updated guidance to investors that was not well received.  Intel said it expects revenue growth in the low single digits over the next 3 years.  Intel expects EPS to grow in line with revenue during the same period.  Intel expects its PC revenue to be flat or fall while data centric revenue will grow in the high single digits.  Intel is rated “Neutral” in our US Large-Cap Global Top Stock Ideas and “Top Buy” in our US Information Technology Global Top Stock Ideas.\n* **Walmart (WMT)** published a report on the earnings of its employees to rebut criticism that they are underpaid.  The average salary for a Walmart manager is $175,000 per year while full time employees earn on average $25,000 per year or $14.28 per hour.  Walmart has been expanding benefits and hiking pay both to rebut critics and better position itself in the extremely tight labor market than exists right now.  Walmart is rated “Attractive” in our US Large-Cap Global Top Stock Ideas and “Attractive” in our US Consumer Staples Global Top Stock Ideas.  \n* **Walt Disney (DIS)** reported fiscal second quarter adjusted earnings and revenue that beat consensus.  Disney first quarter adjusted EPS of $1.61 beat consensus of $1.58.  Fiscal second quarter revenue of $14.92 billion beat $14.54 billion expectations.  Disney saw media networks operating income grow to $2.19 billion from $1.3 billion q/q.  Disney CEO Robert Iger said he was “very pleased” with fiscal second quarter results.  Walt Disney is rated “Attractive” in our US Large-Cap Global Top Stock Ideas and “Attractive” in our US Information Technology Global Top Stock Ideas.\n* **Wendy’s (WEN)** reported first quarter adjusted earnings that beat consensus.  Wendy’s first quarter adjusted EPS of 14 cents beat consensus of 12 cents.  First quarter revenue of $408.6 million beat consensus of $398.9 million.  Wendy’s reported same store sales of 1.3%, a touch below consensus of 1.4%.  Wendy’s is rated “Neutral” in our US Large-Cap Global Top Stock Ideas and “Neutral” in our US Consumer Discretionary Global Top Stock Ideas.  \n\n### European Stocks\n\n* The Euro Stoxx 600 is currently down -0.79%, the FTSE 100 is down -0.34%, the DAX is down -0.79%, and the CAC 40 is down -1.17%\n* Technology (-0.72%), Media (-0.96%), and Industrial Goods & Services (-0.94%) stocks are the top performers in the Euro Stoxx 600 today\n* Travel & Leisure (-0.95%), Utilities (-0.09%), and Real Estate (+0.52%) stocks are the worst performers in the Euro Stoxx 600 today\n* Investor sentiment for European stocks is negative with the advance/decline ratio for the Euro Stoxx 600 currently at 0.29x\n* 29 stocks in the Euro Stoxx 600 are at 4-week highs while 188 stocks are at 4-week lows\n* 21 stocks in the Euro Stoxx 600 are overbought while 27 stocks are oversold according to the 16-day RSI Measure\n* The Nikkei 225 finished down --0.93%, the Hang Seng ended down -2.39%, the Hang Seng China Enterprise declined -2.27%, and the CSI 300 was -1.85%\n* Investor sentiment for Japanese stocks finished negative with the advance/decline ratio for the Nikkei 225 closing at 0.15x\n* 5 stocks in the Nikkei 225 hit 4-week highs while 149 stocks reached 4-week lows\n* 4 stocks in the Nikkei 225 closed overbought while 33 stocks closed oversold according to the 16-day RSI Measure\n* Investor sentiment for Hong Kong stocks finished negative with the advance/decline ratio for the Hang Seng closing at 0.09x\n* 1 stock in the Hang Seng hit 4-week highs while 26 stocks reached 4-week lows\n* 0 stocks in the Hang Seng closed overbought while 5 stocks closed oversold according to the 16-day RSI Measure", "id": "bmirsw", "created_utc": 1557402391.0, "score": 211, "upvote_ratio": 0.9, "num_comments": 85, "comments": [{"body": "If they say sell I will gladly buy :)", "score": 80, "replies": [{"body": "This. They tell you what they want you to act on while they're going around doing the opposite.", "score": 9, "replies": []}, {"body": "Yeah, my money is on \"Trump folds, claims he won.\"", "score": 20, "replies": [{"body": "The Chinese are flying here not the other way around lol", "score": 9, "replies": [{"body": "So what?", "score": 3, "replies": [{"body": "That means they know they fudged up and wanna reopen discussion", "score": 6, "replies": [{"body": "Export figures fell this week", "score": 1, "replies": []}, {"body": "No it doesn't. It means they know how to play Donald.", "score": 0, "replies": [{"body": "Well they’re not doing a good job if they changed the deal, got rejected, now face tariffs, and are flying to the US to salvage discussions lol", "score": 2, "replies": [{"body": "Seems to me they're doing just fine. We aren't winning this trade war, if you're under that assumption.", "score": 0, "replies": [{"body": "We have to “win” eventually because we have all the bargaining leverage. This is probably the best time for a trade reset in over ten years.", "score": 2, "replies": [{"body": "Why do you feel like we have all the bargaining leverage?", "score": 1, "replies": [{"body": "Relative economic strength and trade deficits", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Good luck!", "score": 6, "replies": []}, {"body": "just a good buying opportunity", "score": 1, "replies": []}, {"body": "Blindly BTD!! This January rebound has everyone convinced... I hope a recession really doesn't happen for your sake.\n\nEDIT: Loving the downvotes. I really hope all of ya'll will be holding for 10+ years.", "score": -29, "replies": [{"body": "We are holding for 10+ years", "score": 24, "replies": []}]}]}, {"body": "Sell when they're down? I've never heard that advice before", "score": 18, "replies": [{"body": "I'm thinking the advice is sell now when they are just down a bit rather than later when they are down a lot.", "score": 10, "replies": [{"body": "I was 100% I’m stocks for the run up from December, now I’m 50%. I don't mean to sell, I just want money available to buy stocks when / if they go lower...", "score": 1, "replies": []}]}]}, {"body": "Does this guy just copy and paste meaningless financial news headlines for karma?", "score": 7, "replies": [{"body": "Wouldn’t be the first or the last. This is why I don’t upvote anything.", "score": 2, "replies": [{"body": "Lol I think he was banned from r/options and r/investing so he flocked here", "score": 3, "replies": []}]}]}, {"body": "So I just got into stock market investing last month and bought into DIS and CVS so far.\n\nI should just hold tight through this trade war stuff, right?", "score": 22, "replies": [{"body": "Yes. The worse thing you can do is reaction sell.", "score": 52, "replies": [{"body": "Exactly what I did today. I feel like an idiot and now rethinking my whole participation in the market", "score": 5, "replies": [{"body": "Always buy when the market is afraid and sell when it's comfortable.", "score": 6, "replies": []}]}, {"body": "How about when you own BABA and TCEHY. I got into the China stock late. The USA one is safe. I assume hold through BABA and TCEHY since they have strong moat regardless of outcome?", "score": 0, "replies": [{"body": "Basically it's the same strategy of hold and just have a paper lost.  You sell you'll have actual real loses.\n\nThe thing with China stocks in the US market is that there is an inherent bias against them for being China companies.  Investors are turn off by them for various reason.  Most of them emotional.\n\nThe rational choice is to just hold, since neither BABA or TCHEY are heavily expose to the US market, and are domestically facing the China market.", "score": 2, "replies": [{"body": "Yeah you're right. Paper loss is not the same as real loss.\n\n&#x200B;\n\nYes there is a bias as well I noticed. Maybe one day the Chinese from China will truly start to invest in their own company. China should not decline in 5 years. Or at least what I think. Since Trump is out in 5 years. They will have to make a trade deal with a new president. BABA /TCEHY wont go away in China even MS and Apple dont.", "score": 0, "replies": [{"body": "You can sell calls at a higher price than market to make a liitle income while you wait.  If someone does execute the option, you can look for other opportunities.\n\nedit: sorry, no options available for TCEHY...but BABA has options available.", "score": 2, "replies": []}]}]}]}]}, {"body": "Yes", "score": 13, "replies": []}, {"body": "As prices drop buy more, stocks are on “sale”", "score": 6, "replies": []}, {"body": "Go look at the charts and image you bought stocks before any of the previous bug crashes. Then look where you would have been 2-4 years after. If you dont need the money right now, hold", "score": 3, "replies": []}, {"body": "It's just another great depression, it's a nothing berder", "score": 1, "replies": []}]}, {"body": "Volatility is your friend", "score": 13, "replies": [{"body": "Chaos is a ladder...?", "score": 31, "replies": [{"body": "If you play the game of stocks, you win or you die", "score": 17, "replies": [{"body": "That’s a rough margin call. This is why I don’t use the Iron Bank as my brokerage.", "score": 8, "replies": []}]}]}]}, {"body": "*sigh* I know we hold, always hold, during shit like this but I just hit a pretty significant milestone (for me) and this whole situation is going to bring me back below that which is annoying to deal with mentally, lol.", "score": 13, "replies": [{"body": "Follow your conviction. Buy more of your stocks when they are down. Don't sell on the reaction unless you don't believe the company can move up.", "score": 6, "replies": [{"body": "Thx. Appreciate the morale boost!", "score": 4, "replies": []}]}]}, {"body": "eh the big tech stocks still aren't cheap enough for me", "score": 3, "replies": []}, {"body": "Keep up the heat. China is a paper tiger. Imagine the fucking gains if western IP lawyers are given a fair trial in Chinese courts. VTI will jizz it’s fucking pants. Fucking thieves", "score": 7, "replies": [{"body": "Death of a thousand paper cuts it is!", "score": 2, "replies": []}, {"body": "So a murder suicide type scenario?", "score": -2, "replies": [{"body": "Not at all. More like a Chinese suicide scenario. Global manufacturing bases have been leaving Zhongguo for the past five years", "score": 3, "replies": [{"body": "Mostly because their economy is maturing an wages are way up. Their domestic market have also grew greatly in the mean while.\n\nI am willing to bet everyone who said Chinese economy is a paper tiger have never step a foot in China.", "score": -1, "replies": [{"body": "I spent a year in Beijing and speak mandarin..... sooooo you’re wrong.", "score": 1, "replies": [{"body": "Was it the year 1990? or were you just completely oblivious when you visited.", "score": -1, "replies": [{"body": "Lol. So you got caught in a stupid accusation and now you have to amend. You’re hilariously pathetic. Cao ni zuzong babei. 2012-2013", "score": 1, "replies": [{"body": "Somebody is a little bit angry.", "score": 1, "replies": [{"body": "Not angry. But it is amusing that that’s all you have to say. Maybe because you can’t defend your China position with anything but adhominems", "score": 1, "replies": [{"body": "Lol there is nothing worthwhile to say to someone who would casually toss those terms. Go be nuts elsewhere", "score": 1, "replies": [{"body": "Lol ok", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "The fed has room to move", "score": 2, "replies": []}, {"body": "Can’t seem to find anything in news.  Are they negotiating right now or just meeting for Dinnner tonight ?", "score": 2, "replies": []}, {"body": "Trump and his little short seller enrichment scheme at it again.", "score": 5, "replies": []}, {"body": "Timing the market worked here. Would’ve lost out hundreds buying last week!", "score": 3, "replies": []}, {"body": "Dont really care who started it. All I know is it takes TWO to Tango. So get yo shit fixed!", "score": 1, "replies": []}, {"body": "Soo how long would you guys give it until it starts going up again? :)", "score": 1, "replies": []}, {"body": "Hmmm sure wondering who to believe here...", "score": 1, "replies": []}, {"body": "\n>* **Alphabet’s (GOOGL)** Google is struggling to convert its music customers to paying customers.  Google’s YouTube was revamped about a year ago and its YouTube Music service is a paid subscription that Google is trying to convert its free users to.  More people listen to music on YouTube than any other streaming service.  Users, however, have grown accustomed to its free price and have been resistant to signing up for paid subscriptions.  Alphabet cited this as part of the reason for its $1 billion revenue miss.  Alphabet is rated “Top Buy” in our US Large-Cap Global Top Stock Ideas and “Top Buy” in our US Information Technology Global Top Stock Ideas.\n\nBULLSHIT! the reason people don't want to buy Google play music is for several reasons. The main one being that it can't compete with Spotify or Apple music\n\nFor example, I can't play music that I download. Even the people at r/Android (who will buy anything from Google) hate it.\n\n\nAnother reason is because they have YouTube music as well. So two products", "score": 1, "replies": [{"body": "> Another reason is because they have YouTube music as well. So two products\n\nYou actually get both with one subscription. Google Music can play your own library from the first day it launched.", "score": 2, "replies": []}, {"body": "> For example, I can't play music that I download\n\nI've used google music for years now and haven't had this issue. Can you elaborate?", "score": 2, "replies": [{"body": "Yes, I made a post about it\n\n\nhttps://www.reddit.com/r/googleplaymusic/comments/bmjd11/why_cant_i_play_these_songs_i_own_them_but_i_cant/", "score": 2, "replies": [{"body": "Did you download the songs? The post seems to be able not being able to play them, which might be due to a network issue.", "score": 1, "replies": [{"body": "Yes i did", "score": 1, "replies": []}]}]}]}, {"body": "I have been using Google Play Music for several years without issue. I've never had a problem with downloaded songs either. What makes Spotify better?", "score": 1, "replies": []}]}, {"body": "SQQQ calls to the moons boys", "score": 0, "replies": []}, {"body": "They’re both just artificially manipulating markets with all of this trade war talk...", "score": -9, "replies": [{"body": "I don't get this perspective.  They're negotiating trade between two super powers. Of course markets are going to react and of course they each need to appear in a strong position to negotiate.", "score": 15, "replies": [{"body": "Those negotiations could be done behind closed doors. There’s no need to roil markets by live tweeting the negotiations.", "score": 4, "replies": [{"body": "The pain is part of the negotiation.", "score": 3, "replies": []}]}]}, {"body": "Yeh, more like Trump just doesn't know what the fuck he's doing.", "score": 13, "replies": [{"body": "Closing the trade deficit, duh.\n\n&#x200B;\n\n(Not that that's a good goal to have.)", "score": -3, "replies": []}, {"body": "I think he knows exactly what he’s doing. Everybody is over here screaming Russian interference, but really, China wanted Trump elected. Who else would be better to help manipulate a global economy?", "score": -8, "replies": [{"body": "Hilary with no TPP was the best option for China.", "score": 2, "replies": []}]}]}, {"body": "You are revealing an important insight into the true nature of the stock market, its artificial, fugazi", "score": -2, "replies": []}]}, {"body": "profit taking... a lot of these people have been riding the market up from the Dec lows and have stops set that are being automatically hit.\n\nWe could go back down to retest Dec lows.", "score": -4, "replies": [{"body": "automatically hit the week after trump announced tariff threats...hmm sure", "score": 5, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}, {"body": "Imagine having high hopes for Trump to make something good OMEGALUL", "score": -9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Imagine thinking this is not a bubble. Get out.", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yep, shorted the douple top on S&P, thank you very much.", "score": -1, "replies": []}]}]}]}]}]}
