{"title": "BRK.b when the kings pass", "selftext": "What are your thoughts on the long term prospects here. After the kings pass do you think the culture will continue with their picks? I don’t know how this will fair because of a their one of a kind discipline warren and Charlie have.", "id": "zm29kp", "created_utc": 1671052111.0, "score": 22, "upvote_ratio": 0.82, "num_comments": 70, "comments": [{"body": "it'll drop 5-10 percent the day they die and they'd be upset if you didn't see it as a buying opportunity.\n\nthe fundamentals won't change.", "score": 59, "replies": [{"body": "Different people in charge will\nChange the fundamentals. It’s going to happen. Somebody will think they could do better than them.", "score": 1, "replies": []}]}, {"body": "Even if berkshire wont make any investments anymore, it is still a company with an incredibly stable business model, amazing balance sheet and great returns on capital.", "score": 27, "replies": []}, {"body": "Baby Berk has a war chest of cash. They will be just fine.", "score": 11, "replies": [{"body": "Isn’t a lot of it for insurance purposes?", "score": 1, "replies": [{"body": "No\n\n>Isn’t a lot of it for insurance purposes?\n\nBerkshire Hathaway is a holding company. \n\nAll of the insurance obligations are firewalled within individual corporate structures. \n\nAll of the individually held companies pay their income as tribute into the Holding Company. \n\nThis is why and how there is only 23 people who work at Berkshire Hathaway Headquarters.", "score": 9, "replies": []}]}]}, {"body": "As a shareholder myself, if people want to sell there share of the business I will still buy it. Don’t underestimate Greg Abel and Ajit Jain. They are highly competent people to run the company. Remember they have been in the company for over 20 years they understand the culture.", "score": 7, "replies": [{"body": "Good info", "score": 1, "replies": []}, {"body": "Abel's in his 60's, Jain's in his 70's. they could retire not too long from now.", "score": 1, "replies": [{"body": "In theory, sure they could. But I can’t see Ajit and Greg giving up their passion for Insurance and Energy let alone their position at Berkshire.", "score": 1, "replies": []}]}]}, {"body": "I'll probably buy some shares the day Buffet dies, as I expect a dip. He'd be proud on me for doing that. I believe the machine is well oiled.", "score": 6, "replies": [{"body": "Yeah buying Berkshire that day would be a tribute to The King.", "score": 1, "replies": []}]}, {"body": "Berkshire's next management team will be as competent as the present team, but some of Berkshire's cachet will be gone, so retail investors will have less interest. That's one of the reasons why I decided to sell my Berkshire a few months ago, the other being that it was holding too much Apple stock", "score": 4, "replies": []}, {"body": "I’d be more worried about when king apple turns over to decline mode. Whenever that happens…we might be dead then but without making the correct call on apple I’m not sure how Berkshire would have done. And some day Apple will no longer be the winner it has been.", "score": 7, "replies": [{"body": "Awful analysis. There is no evidence that Apple will decline. In fact, they are still growing. Only 20% of world’s smartphone market.", "score": 7, "replies": [{"body": "What exactly does the phrase ‘some day’ mean to you?", "score": 0, "replies": [{"body": "You can literally say every company on the planet may some day go out of business. If going by your investment thesis you are better off just putting your money under your mattress.", "score": 9, "replies": [{"body": "Your not getting what my point was. Its simple..\n\n-Berkshire made a lot with Apple.\n\n-minus apple, how well has Berkshire actually performed? If not great, then I’d question how really great of stock pickers they actually are. If much better than the market I’d say they’re living up to their reputation. \n\n-apple won’t be around forever, be it next year, in 5, 10, or more year. Being gone entirely wouldn’t matter. Just falling out of its high growth matters. As it would then not create market beaten gains and if you choose Berkshire something else would have to generate market beating returns. \n\n-so if and when apple becomes more of a pepsi type of company…how exactly will Berkshire do? And that concentration risk that Berkshire has and unknown performance sans apple is two things that should be worked out before blindly buying Brk.", "score": 0, "replies": [{"body": "You really don’t seem to understand Berkshire or Apple.", "score": 5, "replies": [{"body": "What exactly do you think I don’t understand?", "score": 1, "replies": [{"body": "What berkshire does.\n\nThinking that berkshire are \"stock pickers\"\n\nThat the apple shares they hold is literally an i insignificant sliver of their assets\n\nLmao\n\nCan people here even read?", "score": 1, "replies": [{"body": "Berkshire is essentially an asset management business like Brookfield and blackrock. Owning public and private companies. They buy businesses, most known being Geico insurance and Dairy queen, and they pick stocks that they usually hold for very long terms. Maybe you want to call it ‘own businesses’ but either way its the same thing. What didn’t I read?", "score": 1, "replies": []}]}]}]}, {"body": "So what? Brk is still value", "score": 1, "replies": []}]}]}]}]}, {"body": "BRK already made +500% return on Apple, so I am not sure I am following your brilliant logic. If they lose half these gain in the next 4 years and exit the position, they would have made annualized return of over 15% on a single holding in a decade.", "score": 0, "replies": [{"body": "Yeah your not following my ‘brilliant logic’. At some point in the future apple will go downhill. Because all businesses dive into decline mode at some point..or at least slower growth mode. This is when they become dividend stocks usually. My point was that Berkshire made a lot on apple..but how well did they do otherwise? I think most of the gains or a result of being almost half in apple. There is a risk here that this is a company that made one right call amongst a bunch of mediocre buys and may not make the next right call if Apple becomes a less great investment.", "score": 3, "replies": [{"body": "Berkshire has a history of being right though , not just once", "score": 3, "replies": [{"body": "Well thats my question here. Running a 100% in apple vs 100% in brk from 1997, the furthest portfoliovisualiser will go back. We get apple returning 30.19% cagr vs brk at 10.82%. I’m not sure what the return is without apple but clearly its 10.82% - AAPL gains which may cause many to question exactly this…what happens when Apple turns the corners and because a slow growing dividend company? \n\nSeems like with all the objections here people aren’t evening willing to put Buffet to scrutiny. Almost like they heard he was amazing and thats that.", "score": 1, "replies": [{"body": "Buffet - Diversification is for suckers !", "score": 1, "replies": [{"body": "Um ok. Are you unable to interact with the actual numbers? What confidence does quoting buzz lines actually give you?", "score": 1, "replies": [{"body": "Your argument was that it was a singular win , and that was the point , to have a singular win. Why diversify when you know you’re going to be right ?\n\nYou want me to do math with you and mess with the numbers ? I can’t change actuals man", "score": 1, "replies": [{"body": "Oh hey I agree if apple is still a strong company then you getting apple plus a bunch of other stuff thrown in. The first comment I made that many responded to was that I’d be more concerned about the day apple stops being that company and then your left with an asset manager that may be left with no winners once the flagship become mediocre itself. If one has done the math and thinks apple is a long term buy, then brk is likely also a long term buy.", "score": 1, "replies": [{"body": "They can always buy new winners. Portfolios aren’t set in stone forever", "score": 1, "replies": [{"body": "Well that was point. Can they? If you remove apple and you end up with an underperforming basket of companies…that would suggest out trust in them picking winners is unfounded.", "score": 1, "replies": [{"body": "The reason to buy BRK is to trust they will buy the next Apple", "score": 1, "replies": [{"body": "You trust a company that had one win to be able to pick the next? Personally I would need a basket of winners. Not apple status but multiple winners. Otherwise they’re a one hit wonder and I have no confidence they can do it again.", "score": 1, "replies": [{"body": "But those Berkshire guys are known to be legendary investors", "score": 1, "replies": [{"body": "Your trolling me right?", "score": 1, "replies": [{"body": "Yes that Warren guy is well known to be good investor", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "So you are asking, how successful would they be without one of their largest successes?\n\nThat type of thinking makes no sense.\n\nVery much along the lines of \"if my aunt had balls she'd be my uncle\"", "score": 3, "replies": [{"body": "not necessarily", "score": 0, "replies": [{"body": "Which part?  The investment or the balls?", "score": 1, "replies": [{"body": "ball", "score": 1, "replies": []}]}]}, {"body": "Largest success singular. I get your point but I’m only asking how would they have done without being right that one time?", "score": 0, "replies": [{"body": "Pointless", "score": 1, "replies": [{"body": "You think its pointless that they don’t have multiple apple type stocks…just the one?", "score": 1, "replies": [{"body": "Read Buffetts letters regarding investing being a zero strike game.  \n\nOr another baseball analogy\n\n\nIf the guy hits a home run.  Do you really care if he got behind 0-2 in the count?", "score": 1, "replies": [{"body": "I have and agree with him that one great win can make up for the rest. But my whole point here is that there is concentration risk in brk that needs to be assessed if buying brk. Most people are arguing a point that Buffet did well aside from Apple but its clear that he didn’t. He didn’t loose money but he underperformed the market if apple is backed out - which is my whole point that seems no one can acknowledge. The fact is Buffet got one really right and without that one he has chosen a basket of mediocre companies that have tied or underperformed the market.", "score": 1, "replies": [{"body": "Yea Tom Brady is a great Quarterback but he couldnt  block a punt if his life depended on it.\n\nSame logic", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "At this point won’t growth slows won’t they just ramp up dividends? They’re sitting in piles of cash", "score": 1, "replies": [{"body": "Yeah. Your moneys safe but its a question of market beating returns. Whats the point of trusting berkshire if they don’t beat the market?", "score": 0, "replies": [{"body": "If you’re planning on trying to beat the market don’t buy individual stocks", "score": 1, "replies": [{"body": "So this is a reddit forum called ‘stocks’. Not sure what other objective you have if beating the market is not the goal.", "score": 1, "replies": []}]}]}]}, {"body": "Yes, but can you imagine the amount of cash Apple will generate at that point? Seriously….", "score": 1, "replies": []}]}]}, {"body": "Or not?", "score": 1, "replies": []}, {"body": "Apple is a big non controlled business of Berkshire portfolio. If you look at Berkshire the real gem of the portfolio is BNSF railway. It’s a in-disposable asset to Berkshire. More importantly to America. It’s virtually untouchable - no new competitors can just come in and set their own railway up. The population of USA will continue to grow and the asset itself will generate more revenue and utility to the economy.\n\nAs an Australian shareholder, I even notice this looking from outside of the United States.", "score": 1, "replies": [{"body": "Interesting. Well if you’ve done some research and see that growing then that may be one reason to own the brk stock. And if you find other, not apple, companies in the brk portfolio that you want to own then you’ve made a good point. \n\nYou know your the first person to actually say something other than ‘you just don’t understand’ or quote some Buffet buzz line out of like 15 replies!", "score": 1, "replies": [{"body": "Thank you for the kind words, I’ll also tell you over time you will find say the insurance side of the business being a small part of Berkshire over a long period of time.\n\nNo business ever stays the same in some shape or form, I don’t have a crystal ball but if I had to hedge a bet - I’d make a prediction something like I think TSMC could be Berkshire biggest non controlled asset. I can see Apple holding being reduced in favour for TSMC. If you consider the strategic shift in the US economy regarding the chips act.", "score": 1, "replies": []}]}]}]}, {"body": "They could turn into the next GE where they just start selling off their companies because the new management doesn't know how to managed them.\n\nAlthough Warren gives an old folksy country type of appearance, he is a ruthless manager demanding all the profits go to him", "score": 5, "replies": [{"body": "Why would they do that? Berkshire will always cut poor business, or capital intensive businesses that ain't returning to shareholders.\n\nAnd, do you think WB and CM actually managing the 65+ buiness they own? Do you know what a CEO does? because WB doesn't really manage these busiensses, and specifically,  Insurance, Energy, and Railroads are pretty much independly managed by 3 difference CEOs. \n\nThe investment protofolio, everyone focus on Apple, which they already made a +500% return on, and forget that BRK owns 15% of Bank of America, 25% of American Express, and 30% of OXY.\n\nThe way berkshire is managed today is beyond individuals. With or without WB, the operation will remain the same. BRK is already built", "score": 18, "replies": []}, {"body": "You are so full of it. Do a bit of research on Buffett. When he buys a company, he usually leaves existing management in place so they can continue making money.", "score": 9, "replies": [{"body": "He wants companies that a ham sandwich wont screw up", "score": 2, "replies": []}]}, {"body": "Pretty much got the govt to do his bidding for BNSF. \n\nTalks about giving 90% of wealth to charity when he dies, but can't give sick days. Can't trust him to think of anyone but himself.", "score": 4, "replies": [{"body": "All billionaires are sociopaths without empathy. I don't blame Warren per se it's that our capitalist system rewards those types of people. \n\nSociopaths are the great white sharks of the capitalistic ocean, they're top of the food chain.", "score": -4, "replies": []}]}]}, {"body": ">I don’t know how this will fair\n\nWhat is there to be fair or unfair about?\n\n&#x200B;\n\nReally as long as they don't die at the same time or two close together in time, there will be sufficient opportunity to show that the replacements that they've been grooming know what they're doing. Not really worth worrying about.", "score": 1, "replies": []}, {"body": "I think it will be fine. Discipline can be taught and there are many money managers who have copied their style with great success.", "score": 1, "replies": []}, {"body": "From Ted Weschler's Wiki:\n\n\"According to a public statement issued by Weschler, over the course of 28 years he grew an initial Roth IRA account balance of $70,385 into $131 million. This increase implies a 31% annual return on investment. \"\n\nI think Berkshire'll be a-ok", "score": 1, "replies": [{"body": "That’s his account. Managing billions of dollars for other people will be managed a lot differently", "score": 1, "replies": []}]}, {"body": "As the company exists today, if Warren and Charlie were to die I’d keep holding and buying more. If they died and it dropped in price, then they would just be more Berkshire for me. \n\nI can’t know if it will always be a company I will want to own, but as it is now it has a great set of investments and business operations backed by an excellently run insurance arm. \n\nWarren and Charlie aren’t the only main two at the helm anymore and haven’t been for a while, the people they’re out in place are carrying on the same temperament and excellent skills, but are, perhaps, more adapted for the current economy.\n\nI’m certainly not saying anyone else should or shouldn’t buy it, but if it were today, I know what I would do. It’s not a gigantic chunk of my portfolio, but for the long- hold section it’s currently unusually overweight for me… I like the company.", "score": 1, "replies": []}, {"body": "Buy the dip.", "score": 1, "replies": []}]}
{"title": "Powell’s FOMC speech all but guarantees rate cuts in 2023", "selftext": "[deleted]", "id": "zm3llk", "created_utc": 1671055312.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 74, "comments": [{"body": "They've been following the bond market the entire time and this reddit just keeps giving absurd reactions. r/stocks just a bunch of glue sniffers these days", "score": 18, "replies": []}, {"body": "If inflation is 2% by June, then we probably are having a hard landing and cuts likely do happen.\n\nIt’s hard to project out that long, but headline CPI at least is prob gonna be 3.5% by June or close unless there’s another shock. The targets for it are being hit. \n\nIf it’s lower, then something went wrong economically.", "score": 17, "replies": [{"body": "Inflation is 1.2% right now.  The yoy will fall straight until June without doing anything.\n\nIn June we peaked, it started really increasing in November 2021.  As we track yoy between now and June, we start to overlap last year’s inflation.  Making us at 1.2 mom right now", "score": 4, "replies": [{"body": "Thats extrapolation", "score": 2, "replies": []}, {"body": "Yeah, I recognize the CPI since July is low if you just use the numbers by then, but I don’t see a path to 2 by mid next year unless there’s a hard landing, then you can toss this SEP in the trash…although it probably belongs there regardless.", "score": 3, "replies": [{"body": "How?  Once we hit June 2023, inflation will be under 2%.  Mission accomplished.\n\nWe have had 6 months of inflation under 4% several months under 2% month over month. Inflation starting hiking in November peaking in June.  So without doing anything else, besides letting the year catch up, inflation will be under 2% year over year, by July 2023.  It’s just math, not a crystal ball.\n\nFor inflation to go back up, something would have to interfere with the trend.", "score": 3, "replies": [{"body": "I'd need to see it to believe it on averaging .2 MoM for the next six months...I'd still lean conservatively here.\n\nWe're on track for 3.5 CPI by June IMHO.", "score": 3, "replies": [{"body": ".2 x 12 is 2.4 inflation.", "score": 1, "replies": [{"body": "> 2.4 inflation.\n\nAre you serious or joking? I can't tell...", "score": 3, "replies": [{"body": "He must be smoking two whole marijuanas", "score": 2, "replies": []}]}]}]}, {"body": "Jerome was asked the question about possible rate cuts in 2023 and he said no. He also doesn’t expect inflation to fall that much in 2023.", "score": 2, "replies": [{"body": "He is lying.  Part of his success is the market believe his bull shit.\n\nThey don’t lie on their projected rate hikes, that would be unethical.  He is absolutely lying about his projections for when and why inflation is falling.", "score": 0, "replies": []}]}, {"body": "While you could be right according to the fed that is not prolonged.  They want what they want prolonged data, thats likely many months below 2%.\n\nIf we dont see unemployment rise.  You loosen then inflation picks back up.  They want unemployment higher.  Wages to stop growing at above historic rates.\n\nSo much more than just reaching 2%.", "score": 1, "replies": []}]}]}]}, {"body": "I think we could be at 2% by about this time next year since we're talking about YoY. We're already seeing certain sectors falling quick, and some even at where they were a year ago. The lagging sectors will feel the brunt of rate hikes by then.", "score": 1, "replies": [{"body": "By the end of 2023 is more realistic yeah.\n\nMaybe we are going to stay around .2 from here on out (if so, it will get you in the 2's in 6 months per that Bespoke chart) but even though there's a shot December CPI is slightly negative...given the way things have gone, I feel iffy enough here to lean conservatively here.\n\nNot enough though to project a 3.5% core PCE by EoY 2023. That kind of projection shows to me a Fed that's scared to death of being wrong to the cool side on inflation after the past couple of years...well...they're about to be wrong on the warm side for 2023. It'll probably be upper 2's imo.", "score": 0, "replies": [{"body": "333", "score": 1, "replies": []}, {"body": "They're navigating in choppy waters and will have to re-route the course every couple of months. What they say today will not be what they do tomorrow.", "score": 1, "replies": []}]}]}]}, {"body": "No way, 2024 earliest. They are scared if they cut too soon inflation roars back. They have said it many times, they want to completely murder inflation", "score": 40, "replies": [{"body": "They also said no hikes in 2022", "score": 10, "replies": []}, {"body": "!RemindMe 1 year", "score": 6, "replies": [{"body": "I will be messaging you in 1 year on [**2023-12-14 22:26:53 UTC**](http://www.wolframalpha.com/input/?i=2023-12-14%2022:26:53%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/zm3llk/powells_fomc_speech_all_but_guarantees_rate_cuts/j08wowd/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fzm3llk%2Fpowells_fomc_speech_all_but_guarantees_rate_cuts%2Fj08wowd%2F%5D%0A%0ARemindMe%21%202023-12-14%2022%3A26%3A53%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20zm3llk)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Yes, but, I and other traders have covered our ears and screamed \"I'm not listening, I'm not listening, I'm not listening!\" all year.  So...counterpoint.", "score": 3, "replies": []}]}, {"body": "He explicitly said no “pivot” in 2023. Do you people just make up shit for fun? GAFL", "score": 6, "replies": []}, {"body": "I don't agree with this. The dot plot released today says rate will likely increase in 2023.", "score": 22, "replies": [{"body": "The fed has been full of shit for the last year. And youre talking about the dot plot. Lol", "score": -9, "replies": [{"body": "Remember \"we aren't even thinking about thinking about raising rates\"...\nNow it's \"we aren't thinking about thinking about cutting rates\"\nThey will Pivot in 2023", "score": 4, "replies": [{"body": "100%", "score": 2, "replies": []}]}]}]}, {"body": "Did you listen to Jay Powell's speech today? He literally said the Fed has no plans to cut at all next year and will very likely hold through 2023 into '24 to get inflation back down to 2%.", "score": 21, "replies": [{"body": "This. No plan to cut rates til at least 2024", "score": 4, "replies": []}, {"body": "And in December of 2021 the fed had a projection of a 0.9% federal funds rate at the end of 2022 and here we are at 4.5%  \n\nYou really believe the shit they say?  Because most likely they don’t even believe the Shit they say.  The one thing you can rely on about the fed is that their projections are always wrong.", "score": 8, "replies": [{"body": "And in 2019, Powel completely folded when trump sent a mean tweet about him", "score": 3, "replies": []}, {"body": "That isn't true. In October of 2021, the Federal Reserve FOMC  was pretty clear the Federal Funds rate would be jacked up.  And this was before inflation, war with Russia...  \n\nIf anything, that was the biggest evidence that inflation is a *consequence*, not the *cause*, of geopolitical factors that lead to raising of rates.", "score": 2, "replies": []}, {"body": "Key word projection. Economics is all made up anyway. This coming from an Econ major.", "score": 3, "replies": []}, {"body": "That's because new data comes in and forecast changes based on current data? That's entirely different from them intentionally forecasting incorrectly. Unless if you got some magical predictive power, then go ahead and disagree with the SEP. While you're at it, go ahead and predict what the core PCE will be by March, June, Sept, and Dec next year. Buy some calls/puts while you're at it too. The SEP revision trend has been more aggressive rate hikes all year, not less aggressive hike.", "score": 2, "replies": [{"body": "I'm sorry but this does not excuse the Fed at ALL for having a SEP late last year with basically no hikes.\n\nIf it's 2%...maybe you can use the \"oh, well things change\" excuse, but it was not 2%, it was 0.9%.", "score": 3, "replies": [{"body": "we didn't know about the Russian war last year.", "score": 0, "replies": [{"body": "We were at the same level we’re at on CPI right now if you prefer YoY 12 months ago and the Fed had a SEP that said 0.9%.\n\nI’m sorry but there’s no spin you can put on this and it’s going to be fun to see Fed truthers like yourself get put on a stretcher next year when the Fed’s record on this stuff is ran to 0-3.", "score": 5, "replies": [{"body": "Lol so what's YOUR prediction for next year? And did you happen to post a prediction last year as well?", "score": 0, "replies": [{"body": "The only thing I know for sure is that this SEP by the Fed is going to be yet another swing and a miss, just like that SEP from late last year and that SEP from late 2018.\n\nIt might be a swing and a miss quickly honestly to boot as well. Not in that I think they'll cut in two months, but that there's probably a better than 50% chance it's 25 and done now.\n\nAnd while I had no prediction for 2022, I will again reiterate, the 0.9% was just embarrassingly wrong. I'm sorry, there's absolutely no spin you can place on it. \n\n2% and you can spin things and be like \"oh, the Russian war changed things!\" 0.9%...nope, you can't. Sorry.", "score": 3, "replies": [{"body": "Well you need a prediction to make decisions, and so far you haven't proved that your forecasting track record is better than the Fed. Why would I listen to you instead of the SEP then? Name the economist who had a better forecasting track record than the Fed over the last 5 years then? I see you criticizing, but I don't see you offering a better alternative.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "He also said last year that inflation was transitory. The point is that things change and we don't know what the future may hold.", "score": 0, "replies": []}]}, {"body": "You gotta be a special kind of stupid to make that deduction after watching the speech today. He continually said they have to be confident their target will be sustained and that they do see a prolonged restrictive environment. You wanna be day traders looking for the next $GME need to give it a break and understand how market cycles and monetary policy work", "score": 7, "replies": [{"body": "☝️yup", "score": 3, "replies": []}]}, {"body": "3:45 pm. Took my entire cash position - 33% of my portfolio - and dumped it into TLT.\n\n**Do I agree?**", "score": 3, "replies": [{"body": "I actually have 36% cash sitting and was contemplating the same thing. Just haven't pulled the trigger yet. \nI am still trying to figure out different scenarios and how TLT would move.", "score": 1, "replies": [{"body": "Here's how I broke it down:\n\nSoft landing: My stocks will bring it home and TLT won't drag too bad.\n\nHard landing: TLT saves my ass.\n\nbased on how the Fed likely responds in the two scenarios.\n\nThen there's the disaster scenario: inflation roars back and necessitates 6% rates. In this case I lose. I bet strongly that won't happen.", "score": 3, "replies": [{"body": "And in disaster scenario everything will go to shit anyways  stocks , bonds and all", "score": 3, "replies": []}]}]}]}, {"body": "Take it up to 9% then drop it to 7%. Hold it there for about a year and you have their 2% target. Easy Peezy.", "score": 3, "replies": []}, {"body": "I must have been listening to a different speech because the one I listened to today Powell made it abundantly clear rate cuts weren’t on the table in 2023.", "score": 3, "replies": []}, {"body": "always inverse reddit", "score": 2, "replies": []}, {"body": "Lol get off the bath salts bro", "score": 2, "replies": []}, {"body": "No rate cuts but a pause is probable “IF” something changes significantly.", "score": 2, "replies": []}, {"body": "The fed: easy monetary policy has weakened the dollar and the terminal rate probably needs to be at 5%. Qt will take years of consistency.\n\nThis guy: nuhuh. I like low rates, so I bet they cut.", "score": 2, "replies": []}, {"body": "I disagree. In fact, I think you are the author of the article.", "score": 3, "replies": []}, {"body": "we mustve been listening to different speeches\n\nhe explicitly said nothings happening til 24", "score": 2, "replies": []}, {"body": "This is a shit article. \n\nPowell was asked about rate cuts and specifically said based on the SEP, no rate cuts in 2023. It was actually one of the first few questions.\n\nYes Fed is not gonna wait until YoY core PCE prints 2% before cutting rates. As you can see from the SEP, core PCE at end of 2025 will be 2.1%. However, the terminal rates for end of 2024 is 1% lower than end of 2023. This means there will be 1% rate cuts towards the 2nd half of 2024. Based on SEP, core PCE YoY at the end of 2023 will be 3.5%, and 2.5% end of 2024. So it's very likely they'll start cutting rates once the YoY core PCE goes below 3% (actual YoY core PCE prints, not MoM annualized or some sort of 3-month annualized).", "score": 2, "replies": [{"body": "Inflation is at 1.2% right now.  It’s been under 4% since July.\n\nThe year over year will be under 2% by JUNE, without anything else.\n\nPlease help me understand your math.", "score": 0, "replies": [{"body": "Core PCE? headline inflation means nothing to the Fed. It's only low because of the huge energy deflation counterbalancing the positive increases. Gas is not gonna continue decreasing month over month. Same with durable goods. At some point in the future, it'll be flat, and what's left will be 4% sticky inflation (core services ex housing).\n\nif you're still looking at headline inflation, I don't think you have a clue of where we are on the inflation battle.", "score": 2, "replies": [{"body": "Based on their core PCE projections for 2023 they seem hellbent on looking bad for two straight years, this time, showing too much caution and conservativeness in projecting inflation falling.\n\nhttps://mobile.twitter.com/RobinBrooksIIF/status/1603109400314785793\n\npretty much nobody thinks that 3.5% core PCE projection will be right now.", "score": 0, "replies": [{"body": "Or it simply reflects the fact the job market is way too hot, and their peak rate isn't that restrictive. \n\nMost economists from big banks all think low 3% is where core PCE will be by end of 2023, so 3.5% isn't exactly too crazy. It's a structural labor shortage, and the Fed wants to limit the severity of the recession if it does happen. This means rates not too high, but extend the time horizon.", "score": 2, "replies": []}]}, {"body": "The Fed isn’t going to pick and choose what inflation it likes and doesn’t.  The biggest reason for housing inflation is because of higher rates.  Higher rates are inflationary.\n\nIt costs more to build, sell and mortgage properties while raising rates.\n\nFood prices are higher, but it is directly linked with the war in Europe.", "score": 0, "replies": [{"body": "Actually they do. They choose PCE over CPI when no one uses PCE. And right now, they choose core PCE over PCE obviously because they cannot control volatile energy and food prices, so core PCE is a much better indicator of where long term inflation will end up. All of this is common knowledge.\n\nI said core services EX housing by the way, so I don't know why you brought up housing. \"biggest reason for housing inflation is because of higher rates\"? That must be why housing prices finally declined over the last few months after the Fed raised rates. I think you really have no clue what you're talking about.", "score": 2, "replies": []}]}]}]}]}, {"body": "Oh look more hopium. Inflation won't cool off for another 12 months. It will slowly trickle down but it will remain high for 2023. Unless Putin decides to invade Poland.", "score": 1, "replies": [{"body": "Inflation is 1.2% right now.  Please help me understand your math", "score": 2, "replies": [{"body": "It’s 1% over last 5 months which is 2.4% annualized since July. Not sure where 1.2% is from.", "score": 1, "replies": []}]}]}, {"body": "It’ll be a miracle if inflation gets back to 2%.", "score": 1, "replies": [{"body": "> It’ll be a miracle if inflation gets back to 2%.\n\nit effectively already is in that ballpark and has been for a while.\n\nsome people look at the year over year and ignore the month over month, but we've had like 5 or 6 months in a row of good month over month numbers, it's just that inflation was so bad in the first half of the year that the damage was already done so YoY looks high now. if things stay the same as thethe way they have been the last 6 months and literally nothing changes for better or for worse, the YoY next summer/fall will be exactly what the fed wants.", "score": 1, "replies": [{"body": "I agree, inflation June 2022 - June 2023 will be ~2% (maybe 3-4% depending on world events we can’t predict) but prices haven’t decreased at all, they just haven’t gone any higher. That doesn’t account for the 9% increase in prices from 2021 - 2022. \n\nI could be looking at this completely wrong, so forgive me for any ignorance 😅", "score": 1, "replies": [{"body": "> but prices haven’t decreased at all, they just haven’t gone any higher. That doesn’t account for the 9% increase in prices from 2021 - 2022. \n\nsure, but that cat's out of the bag and it's not going back in.\n\nwe've seen wages go up to account for the higher prices of everything, and the only way prices go back down is if wages go back down. that's not happening. the damage is already done, now it's all about getting things good going forward. we've already largely done that, and just need to prove that it's long term stability and not just a few good months.", "score": 1, "replies": []}]}]}]}, {"body": "not sure if there are any wrestling fans in here, but this reminds me a lot of the \"this is a secret message announcing cm punk's return!\" memes after he left wwe years ago.", "score": 1, "replies": []}, {"body": "By July (June 2023 cpi readings) we will be under 3% at current trend. Rent, one of the largest inflators takes 6-12 months to really see in the cpi data as people renegotiate their rents. Rent just started coming down two months ago. \n\nWe could see deflation MoM with these rate hikes.", "score": 1, "replies": []}, {"body": "We're 2%, or lower NOW.  It's just a matter of letting the trailing months drop off.", "score": 1, "replies": []}, {"body": "Not what i heard.", "score": 1, "replies": []}, {"body": "When an article uses the term 'money printer' you know its reputable", "score": 1, "replies": []}]}
{"title": "TSLA Named Top Pick for 2023 - Morgan Stanley", "selftext": "", "id": "zm0s2l", "created_utc": 1671048378.0, "score": 43, "upvote_ratio": 0.75, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 year ago\n**Total Comments**|188|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "All I need now is Jim Cramer to say it’s his favorite stock and it’s all in on TSLA puts next year.", "score": 28, "replies": []}, {"body": "pump and dump", "score": 68, "replies": [{"body": "They’re one of the banks that took TSLA stock as collateral for Musk’s financing of Twitter, definitely holding some heavy bags. 😂", "score": 50, "replies": []}, {"body": "dump and pump", "score": 14, "replies": [{"body": "It’s pump and dump not dump and pump..", "score": 0, "replies": [{"body": "It's dump and pump", "score": 5, "replies": [{"body": "You’re the dump and pump", "score": 2, "replies": [{"body": "I am the dump and pump", "score": 1, "replies": [{"body": "Funny thing… My late grandfather actually knew the real dumpty pump", "score": 2, "replies": [{"body": "The real humpty dumpty was shit down over St. Vith during the last months of the war.", "score": 1, "replies": [{"body": "I believe they even made a musical about it if I’m not mistaken", "score": 2, "replies": [{"body": "Ahh yes, Oklahoma", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "When MS says invest it’s a good time for Tasla puts", "score": 12, "replies": [{"body": "def after a 60% drop too", "score": 3, "replies": [{"body": "From where I’m sitting it’s got pleeeeenty of downside left.", "score": 0, "replies": [{"body": "https://preview.redd.it/2mpjds5bl06a1.jpeg?width=640&format=pjpg&auto=webp&s=e1e99f85bc1fe0b9f3cdf00262c0430b64f77a17", "score": 2, "replies": [{"body": "Damn. So much freedom to move around and definitely not trashy", "score": 2, "replies": []}]}]}]}]}, {"body": "I’m hoping they get two good pumps in before the dump", "score": 2, "replies": []}, {"body": "Where's the pump?", "score": 2, "replies": [{"body": "hey man im a bear", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|19738)", "score": 1, "replies": []}]}]}]}, {"body": "Morgan “fat bagholder cuck” Stanley", "score": 12, "replies": [{"body": "LOL 😂", "score": 2, "replies": []}]}, {"body": "definitely bag holders", "score": 22, "replies": []}, {"body": "This means go short on TSLA", "score": 26, "replies": [{"body": "People have lost everything betting against Tesla on new lows. Don't be one of those idiots", "score": -9, "replies": [{"body": "I wouldn’t be in WSB if I didn’t lose money 😏", "score": 4, "replies": []}]}, {"body": "CNBC is your guiding light?", "score": -8, "replies": [{"body": "Bag holder spotted", "score": 7, "replies": [{"body": "I stand by my TSLA position", "score": 2, "replies": [{"body": "what about when it goes sub 100", "score": 1, "replies": [{"body": "I will start to poop myself", "score": 7, "replies": [{"body": "With another bag ready to hold that drop.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "It's a funny day when Tesla becomes a value stock! 🤣🤣🤣 Well, we hodlers had to be right at some point.", "score": 5, "replies": []}, {"body": "Nope, still buying long puts and holding", "score": 15, "replies": [{"body": "You wouldn't have the balls! 😆", "score": 1, "replies": []}, {"body": "Proof or ban", "score": -7, "replies": [{"body": "https://preview.redd.it/k9uksx7hsy5a1.png?width=828&format=png&auto=webp&s=de3f72733b4870c183ecd145d0302fb3fe02d2a9\n\nBaby account, still puts, don’t let the green confuse you ;)", "score": 22, "replies": [{"body": "Good man", "score": 8, "replies": [{"body": "Feels amazing", "score": 2, "replies": [{"body": "Nice move 👍🏼 would have loved to hedged my long position", "score": 1, "replies": []}]}]}]}]}, {"body": "Yikes 😳", "score": -1, "replies": [{"body": "Tesla? Puts are free money", "score": 2, "replies": []}, {"body": "My yikes feels nice", "score": 1, "replies": [{"body": "You felt you had to come comment back ![img](emote|t5_2th52|4275)", "score": -1, "replies": [{"body": "You felt to comment initially?", "score": 1, "replies": [{"body": "And you took that very personally ![img](emote|t5_2th52|4267)", "score": 0, "replies": []}]}]}]}]}]}, {"body": "\"Elon Musk’s bankers are considering replacing some of the high-interest debt he layered on Twitter Inc. with new margin loans backed by Tesla Inc. stock that he’d be personally responsible for re-paying, according to people with knowledge of the matter.\n\nThe margin loans are one of several options the Morgan Stanley-led bank group and Musk’s advisers have discussed to soften the burden of the $13 billion of debt that Musk used to purchase the social media company in Octo\"\n\n[source](https://www.bloomberg.com/news/articles/2022-12-08/musk-bankers-mull-tesla-margin-loans-to-cut-risky-twitter-debt)", "score": 9, "replies": []}, {"body": "Is Morgan holding a lot of Elon's bags... you know that $100 billion he owes backed by mostly TSLA shares before the 50% haircut. \n\nMorgan just wants the asset backing their loan to stay solvent.", "score": 7, "replies": [{"body": "It is exactly this.", "score": 2, "replies": []}, {"body": "$100 billion!?", "score": 0, "replies": [{"body": "https://www.cnbc.com/amp/2022/04/28/elon-musk-will-be-most-indebted-ceo-in-america-if-twitter-deal-closes.html\n\n100 Billion with a B", "score": 3, "replies": []}]}]}, {"body": "Whenever you see articles like this you go well someone has a positional interest for this media propoganda!\n\nMorgan Stanley TSLA calls?  Hrm?", "score": 4, "replies": [{"body": "But if the amount of negative articles on Tesla outweighs the positive.. 🤔", "score": -2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Please expand on your sentiment for our greater good", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "noice", "score": 1, "replies": []}]}]}]}, {"body": "Translation: we have a massive stake that we would like you to bag hold on instead of us", "score": 2, "replies": []}, {"body": "damn you all go from sucking elons dick and buying TSLA calls when its at 150 P/E to completely shitting on it lol", "score": 2, "replies": []}, {"body": "The stock dropped so much any positive news will make it go up. hahaha", "score": 1, "replies": []}, {"body": "oh boy.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "They need bag holders", "score": 1, "replies": []}, {"body": "With a forward PE of 30 I can see this compared to costco forward PE of 32", "score": 1, "replies": [{"body": "Don't get me started on Chipotle", "score": 1, "replies": [{"body": "53 PE.", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4260)", "score": 2, "replies": []}]}]}]}, {"body": "Selllllllllllllll you fooooooools", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 1, "replies": []}, {"body": "Bought Twitter, lost Tesla! Why?", "score": 1, "replies": []}, {"body": "They misspelled TSLQ.", "score": 1, "replies": []}, {"body": "WE NEED TO EXIT OUR POSITION!!", "score": 1, "replies": []}]}
