{"title": "Passive ETF Bubble About to Burst Soon | Indexes Gonna Fall 40% When they do.", "selftext": "We all know boomers love to passive ETF buying.  Now they will all want to get out at once create a huge pop in the passive ETF bubble as predicted by our bear saint, Micheal fucking Burry.\n\nAnother 10% drop and boomers gonna rush to the exit.", "id": "fa4faq", "created_utc": 1582767896.0, "score": 67, "upvote_ratio": 0.86, "num_comments": 88, "comments": [{"body": "Bitch. \nStrike prices\nAND\nExpiration date\n\nHOW FUCKING HARD IS IT? \n\n> 🌈 🐻", "score": 122, "replies": [{"body": "SPY $5 2/28", "score": 22, "replies": [{"body": "Bro it started at like $45 999 years ago", "score": 5, "replies": []}]}, {"body": "Vix calls. I’m holding 35strike with May 20 expiration", "score": 5, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "this guy is getting downvoted to oblivion for believing in the United States economy", "score": 17, "replies": []}, {"body": "How much is that in as Schrute Bucks?", "score": 1, "replies": [{"body": "At least 12\n\nTLDR: 12", "score": 1, "replies": []}]}]}]}, {"body": "One of the first axioms I learned when I was on the desk: Derivatives are only as liquid as its underlying asset.", "score": 33, "replies": [{"body": "Interesting you bring this up. I was just researching. Is there any danger of bag holding derivative options (like us) as bid/ask spreads wide?", "score": 13, "replies": [{"body": "You don't have to worry about bagholding itm options because you can always exercise and sell the underlying stock that you acquired", "score": 8, "replies": [{"body": "Good point. Though it’s not like I actually have the capital to buy the underlying if I were to exercise...is that an issue?\n\nOn that point, if you’re ITM (I am so far) is it wise to sell while there’s still extrinsic value, or wait for expiration and sell for intrinsic only? Thanks for the help.", "score": 3, "replies": [{"body": "No, it won't be an issue since someone else will like to take your option and exercise it himself (for a few bucks thrown his way).\n\nSecond question has to be your judgment on if you think the underlying will appreciate (for call) or depreciate (for put) more than the remaining time and volatility values of the option. So basically if you see more upside, you hold. If you're deeper in the money, you can also consider rolling over the gains to a longer dated and further otm option.", "score": 4, "replies": [{"body": "Thanks for the help bud.", "score": 3, "replies": []}]}, {"body": "Goddamnit man, someone with money would buy them and collect the arbitrage.", "score": 1, "replies": []}]}]}]}, {"body": "I'm definitely not autistic, but could you put this into terms an autist would understand please? Thanks", "score": 8, "replies": [{"body": "Diarrhea too much. Anus too small. Become prolapse. Victim dies out the butt.", "score": 44, "replies": [{"body": "Ok now put it in terms a 5-year old autist can understand Robert Frost M.D.", "score": 7, "replies": []}, {"body": "Oooh ok.. was there at least the pleasure of taco Bell beforehand?", "score": 1, "replies": []}]}]}, {"body": "What does that mean for us?", "score": 0, "replies": [{"body": "It means you're retarded", "score": 19, "replies": []}, {"body": "Read about how ETFs are rebalanced. Yes they should use futures, but a good amount still use the underlying stock. If there was a big rush out of an etf that must hit the market, it will hit thinly traded names very hard. \n\nThat wouldn't be a problem if the ETF is market weighted, meaning that small stock won't have an effect on the rest of the market because it's so small. However if the etf was dumb enough to be equal weighted...", "score": 7, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Volume / OI too low", "score": 9, "replies": []}]}, {"body": "equal weight etf with huge boomer participation... go!", "score": 3, "replies": [{"body": "All DJIA etfs that trump has been quoting.\n\nOh god I think we're going to be reamed again by boomers.", "score": 2, "replies": []}]}]}]}, {"body": "SPX?", "score": 0, "replies": []}]}, {"body": "Michael fucking burry strikes again. About to be 2 for 20", "score": 16, "replies": []}, {"body": "Lots of people read the shit Michael Burry just said. You’re not a fucking genius.", "score": 8, "replies": []}, {"body": "The \"boring\" etfs are not the ones that I'm worried about directly, but those TQQQ ones could go down to 0 if there is a 33% market correction.", "score": 12, "replies": [{"body": "huh 3 x 33% is almost 100%\n\nastute analysis", "score": 34, "replies": []}, {"body": "Fuck outta here with that shit.... What are the chances that QQQ drops 33% in a day?\n\nP.S. holding 215 shares of TQQQ..", "score": 21, "replies": [{"body": "doesn't need to drop 33% in a day to go down 99%. It's just 3x what ever the return is of the QQQ", "score": 2, "replies": [{"body": "It's 3x of the daily return. It doesn't apply in different periods.", "score": 6, "replies": [{"body": "QQQ 1 year return: 24.7% \n\nTQQQ 1 year return: 73.58%\n\n QQQ x 3 = 74.1%", "score": 1, "replies": [{"body": ">This leveraged ProShares ETF seeks a return that is 3x the return of its underlying benchmark (target) ***for a single day***,\n\n[https://www.proshares.com/funds/tqqq.html](https://www.proshares.com/funds/tqqq.html)\n\n>Due to the compounding of daily returns, ProShares' returns over periods other than one day will likely differ in amount and possibly direction from the target return for the same period.\n\n[https://www.proshares.com/geared/nasdaq\\_100\\_etfs.html\\]](https://www.proshares.com/geared/nasdaq_100_etfs.html])\n\nIt's not guaranteed that over a year the return is 3x. It may, or it may not.", "score": 6, "replies": [{"body": " I get that it's rebalanced every day, doesn't mean losses are wiped out every day.\n\nexample: 21. September 2018 - 21. Dezember 2018\n\nQQQ Return: -19.67%\n\nTQQQ Return: -52.11%\n\n3xQQQ = -59.01%", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "good point", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "God bless your soul\n\nEven wsb turns into r/investing when it comes to leveraged ETFs..", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "The smart thing to do would be to double down.", "score": 4, "replies": []}]}]}]}, {"body": "It doesn’t need to drop in a day retard. It just needs to drop within a year. Get the fuck out at some point because a recession would wipe you out", "score": -3, "replies": [{"body": "QQQ could drop 10% a day for 5 days straight and TQQQ would still have $16.80 of value (if started at 100). Yes, an 84% drop and yes, it would suck but I wouldn't be \"wiped out.\" Also, 5 consecutive days of 10% drops is never going to happen... That's the 2008 recession on the s&p in 5 days lol", "score": 6, "replies": [{"body": "This is actually a good point. \n\nLooked at the 2018 correction and the absolute loss in TQQQ and QQQ and the loss of QQQ was pretty much 3xQQQ with a 7% difference. ( -52.11%  TQQQ vs.  -19.67% QQQ)", "score": 2, "replies": []}, {"body": "Ok I’m done arguing with idiots. GL with that. I’ll be holding 30$ puts on TQQQ with a two year out expiration. I’ll make sure to look all you idiots up when it goes to 0 and remind you of this moment. I tried being nice. But you are refusing to understand how triple leveraged ETF’s work.", "score": 5, "replies": [{"body": "Hmm... aaaaalright buddy\n\n!RemindMe 2 years", "score": 3, "replies": [{"body": "I will be messaging you in 2 years on [**2022-02-27 02:28:55 UTC**](http://www.wolframalpha.com/input/?i=2022-02-27%2002:28:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fa4faq/passive_etf_bubble_about_to_burst_soon_indexes/fivxw7i/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffa4faq%2Fpassive_etf_bubble_about_to_burst_soon_indexes%2Ffivxw7i%2F%5D%0A%0ARemindMe%21%202022-02-27%2002%3A28%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fa4faq)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "!RemindMe 2 years", "score": 1, "replies": []}]}, {"body": "I have been riding the SQQQ wave all week baby. Keep the train going.", "score": 2, "replies": [{"body": "Good luck dude. That’s a scary ride. I’d be more confident when the trend is confirmed down", "score": 1, "replies": []}]}, {"body": "I saw those 30p 2 years out and yeah they look spicy", "score": 2, "replies": [{"body": "They were extra spicy a week ago when they were going for 1.75 a contract. Fucking pennies on the dollar", "score": 1, "replies": [{"body": "I was buying long dated Spy puts weekly as a hedge against my portfolio but didn't hold through this past weekend...fuk.  Got a 4/17 270p on this morning's bounce for 1.30 should open at 2.5 or so.  just like this past summer I stop my put hedging right when it is about to print :/ dont doubt ur vibe", "score": 1, "replies": [{"body": "Don’t doubt your vibe. This is the way", "score": 1, "replies": []}]}]}]}, {"body": "It will reverse split at some point.  I know this from being a UWTI bag holder from back when oil went to shit years ago. :(\n\nYou still continue to make bank as the world burns though.", "score": 1, "replies": []}]}]}, {"body": "Kid. Make a correct DD. It gets wiped out only if it drops 33.3% in a single day because of daily rebalance.", "score": 3, "replies": [{"body": "Soooooo........ you’re wrong. Yup that’s all I have to say. Goodbye", "score": -6, "replies": [{"body": "Source, all I have to say. Goodbye\n\n>This leveraged ProShares ETF seeks a return that is 3x the return of its underlying benchmark (target) ***for a single day***,\n\n[https://www.proshares.com/funds/tqqq.html](https://www.proshares.com/funds/tqqq.html)\n\n>Due to the compounding of daily returns, ProShares' returns over periods other than one day will likely differ in amount and possibly direction from the target return for the same period.\n\n[https://www.proshares.com/geared/nasdaq\\_100\\_etfs.html\\]](https://www.proshares.com/geared/nasdaq_100_etfs.html])", "score": 2, "replies": [{"body": "LOL you don’t even understand what you are posting this is hilarious. Exactly dumbass they differ from the daily return they seek. If the trend is up they will return over 3x but when the market trend is down they return over 3x down. An example of this is how TQQQ would have went to zero during the dot com bust in March 2000. Watch your mouth when you don’t understand what you are discussing.\n\n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4203362-all-leveraged-etfs-go-to-zero", "score": -4, "replies": [{"body": "Do you even know how to read?\n\n>ProShares' returns over periods other than one day will likely differ in amount.Let me break that for you:over periods other than one day: That means not in a daydiffer in amount: means different than 3x [https://www.proshares.com/geared/nasdaq\\_100\\_etfs.html](https://www.proshares.com/geared/nasdaq_100_etfs.html])\n\nIt can be over 3x or less than 3x. I'm just restating that it's not guaranteed to be 3x.\n\nLearn to read before opening your mouth kid.", "score": 2, "replies": [{"body": "Ummm lol. Are we arguing the same point here dude? I’m re-reading this and it definitely sounds that we are on the same page.... I agree that it differs than 3x. I’m just stating that it depends on the trend. Trends up have the capability to return over 3x on the up days and less than 3x drops on the downs days and vice versa in a downward trending market. This is why I’m stating it is very possible and (in fact likely) for TQQQ to go to zero when recessions average a 40-60% drop over the course of 18-32 months.", "score": 2, "replies": []}, {"body": "And it's not guaranteed to be over 3x either.", "score": 1, "replies": []}]}, {"body": ">An example of this is how TQQQ would have went to zero during the dot com bust in March 2000.\n\nNo, it wouldn't have actually. I know this because there was a single day in which QQQ would have been anywhere close to dropping 33.34% in a single day.", "score": 1, "replies": [{"body": "It... doesn’t need to drop in a single day goddamn it. Read the article I posted.", "score": 1, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/fa5uxr/a_mathematical_proof_for_those_scared_of_3x/", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": ".. if the is a 33% market correction in a single day. If that ever happens, we have bigger problems than a worthless etf.", "score": 9, "replies": []}, {"body": "So TQQQ puts", "score": 3, "replies": [{"body": "SQQQ", "score": 2, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "OK so you're saying don't sell my 50k in VTI right", "score": 1, "replies": []}, {"body": "What happens when they do? It's a leveraged product so if it was like a normal leveraged deriviative it would go negative and there would be margin calls.\n\nOr do they just forcefully close out everything at once?", "score": 1, "replies": [{"body": "if it literally goes to 0 the etf holders just walk out with nothing. The etf would just on the way down force faster selling on the underlying because it has to readjust every day and sell stocks to regain the correct leverage ratio to 3:1.", "score": 1, "replies": []}]}, {"body": "This is what I have been preaching. Yes exactly", "score": 0, "replies": []}]}, {"body": "TQQQ 70p 3/20", "score": 6, "replies": []}, {"body": "Could someone please tell me if buying calls on $SPXU is literally free money?", "score": 9, "replies": [{"body": "It is if you believe hard enough", "score": 4, "replies": []}, {"body": "I mean I can, but that's a pretty good sign that you will lose money", "score": 1, "replies": [{"body": "Why do you think it’ll lose money? Do you think the market is going back up before Friday?", "score": 0, "replies": []}]}]}, {"body": "So my NBEV shares are good?", "score": 3, "replies": []}, {"body": "True.", "score": 2, "replies": []}, {"body": "So how do we take advantage?", "score": 2, "replies": []}, {"body": "The play against the index bubble is bearish... indexes?", "score": 2, "replies": []}, {"body": "Uh guys\n\nLook at this dude's history\n\nHe predicted the crash a month ago\n\nMaybe listen to him (maybe)", "score": 6, "replies": [{"body": "Soon, is within 6 months, and assuming the virus is a pandemic that infects 50% of the US population.  the probably is 10% that it corrects 40%.   It'll correct 20%, 40% probability.", "score": 5, "replies": [{"body": "Can you explain how etfs are in danger of crashing more than the market as a whole? I read all the comments and don’t really get it. Is s&p 500 included? Do u have a link?", "score": 4, "replies": [{"body": "> holding 30$ puts on TQQQ with a two year out expiration. I’ll make sure to look all you idiots up when it goes to 0 and remind you of this moment. I tried being nice. But you are refusing to understand how triple leveraged ETF’s work.\n\nYes please explain, I want to look good for the job interview I have coming up.", "score": 1, "replies": []}]}]}, {"body": "everyone predicted a crash 1 month ago...", "score": 1, "replies": []}]}, {"body": "This is something Michael Burry predicted as well - in addition to a bond bubble too. Too many tendies, too few places to take them in.", "score": 1, "replies": []}, {"body": "I will look back at this small thread as a millionaire thinking “wow, it was here that I realized how absolutely turbo fucked we are”. Old money is so up ETF’s ass. \n\nAny potential trades you’re looking at?", "score": 1, "replies": []}]}
{"title": "Cruise Ship Stocks", "selftext": "[removed]", "id": "fa62lo", "created_utc": 1582775330.0, "score": 117, "upvote_ratio": 0.94, "num_comments": 88, "comments": [{"body": "TLDR; Puts on Cruise Ship Stocks", "score": 86, "replies": [{"body": "Where the fuck is my expiration and strike?", "score": 34, "replies": [{"body": "NCLH 3/20 30p shits gonna sink like the Titanic boi", "score": 26, "replies": [{"body": "If I take another L, I'll be back to fist you", "score": 16, "replies": [{"body": "I will fist myself if I went G4P and still go red", "score": 6, "replies": [{"body": "Deal", "score": 2, "replies": []}, {"body": "Bet", "score": 2, "replies": []}]}, {"body": "Fuck it, I'm shorting but it seems to have fallen enough, already", "score": 1, "replies": [{"body": "It will fall a lot more trump tried to cover this up like the beer virus isn’t serious but fuck it turn lemons into champagne and tendies", "score": 2, "replies": [{"body": "Together in hell brother!!", "score": 1, "replies": []}]}]}]}, {"body": "This guy eats", "score": 3, "replies": []}, {"body": "Please tell me you actually did this", "score": 1, "replies": [{"body": "Easiest 10 bagger of my life, I told y’all", "score": 2, "replies": []}]}]}]}, {"body": "sell calls too", "score": 3, "replies": []}, {"body": "Got it, calls", "score": 3, "replies": []}]}, {"body": "I would strongly consider cutting down your timeline from months to weeks.  The impact of corona on oil prices is a massive boon to cruise ship operators.  So while they are taking it in the ass right now from a booking perspective, they are going to have significant amounts of wiggle room to cut prices and still make money.  Stairs up, elevator down.  We aren’t on the bottom floor but expecting it continue to drill over a long period of time is a different story.", "score": 36, "replies": [{"body": "Don’t these companies lock in future oil prices therefor the most recent precipitous drop in oil wouldn’t show up until a long time?", "score": 15, "replies": [{"body": "Looking at Carnival’s earnings they must not do too much in that regard since it specifically calls out fuel cost as a risk.  To the point of quantifying impact per share of 10% fuel price swing.\n\nhttps://www.carnivalcorp.com/static-files/0d16c53f-962e-443b-ad56-8e05661f0ca3\n\nPage 3.", "score": 6, "replies": [{"body": "I may be an autist but they’re talking about spot prices, sooooo......", "score": 2, "replies": [{"body": "So prices relative to December 20th of 2019.", "score": 3, "replies": []}]}]}]}, {"body": "Does it make a difference if fuel prices drop if they have to cut entire trips?\n\n40% of their passengers are 60+, so the two age brackets with the highest coronavirus mortalities so far", "score": 2, "replies": [{"body": "If oil prices remain reduced for longer than travel is impacted or by a more significant margin than travel is impacted then yes.   At this point even the more negative folks are saying things should be clearing up by April.", "score": 1, "replies": []}]}]}, {"body": "The onlyfans subscription  is the real play here.", "score": 20, "replies": [{"body": "Care to elaborate?", "score": 1, "replies": [{"body": "Lmao", "score": 6, "replies": [{"body": "1K strike price exp Friday, thank you very much", "score": 2, "replies": []}, {"body": "Thanks", "score": 1, "replies": [{"body": "Np", "score": 1, "replies": []}]}]}, {"body": "Lol wait he had a TLDR that said something like buy puts, sell calls, subscribe to my onlyfans. Now it’s not there and I look weird.", "score": 1, "replies": [{"body": "Naww I read it, but you are weird anyway", "score": 2, "replies": []}, {"body": "It’s at the top now haha, figured I’d add an actual TLDR instead messing around.", "score": 1, "replies": []}]}]}]}, {"body": "bro you wrote all that out and your tldr could've been just STRIKE PRICES AND EXP DATES  \n\n\n  \nbut thank you, nice read.", "score": 30, "replies": []}, {"body": "Got PUTS in Carnival today, only thing green in my acct :-)", "score": 10, "replies": [{"body": "Tomorrow's RCL for me, praying that SPCE continues to plummet and ETSY at least return me a green after that amazing earnings report", "score": 5, "replies": [{"body": "Read my mind. Playing PUTS on $SPCE at open(if RH doesn’t fuck up, again)", "score": 1, "replies": []}]}]}, {"body": "But the thing is, if they keep tanking like that, isn't IV gonna fuck you over anyways?", "score": 9, "replies": [{"body": "IV is mean reverting so he buys/sells time premium to allow for expansion/contraction", "score": 1, "replies": []}]}, {"body": "YES!!!  yes yes yes buy puts on $NCLH NOW.  I made 5k before lunch.", "score": 6, "replies": [{"body": "Tmrw at open? Already own United", "score": 1, "replies": [{"body": "Depends on your risk tolerence.  As long as youre exposed to some travel puts, you'll be fine.  \n\nI bought nclh $40 3/20 puts on monday, made my nut yesturday.\n\nI just think cruise ships are more acutely affected by out breaks than anything else.", "score": 2, "replies": []}, {"body": "Why not both airlines and cruise ships?", "score": 1, "replies": [{"body": "Yes and yes.  I bought AAL puts at the same time.", "score": 2, "replies": [{"body": "Good man. I’m in UAL puts but same idea. And heavy CCL puts.", "score": 2, "replies": []}, {"body": "are there any airline stocks you tracking? AAL seems took bad hit going 52 weeklow.", "score": 1, "replies": [{"body": "Well if youre looking for something thats more imediately fucked, you could try ryan air ($RYAAY).  European exposure, lots of room to drop.  Germany is already looking at total inevitable corona saturation, soooooo.   I'll just leave that there.", "score": 3, "replies": [{"body": "Thanks. I did some digging and found   \n\n\nNOTE: NOT BY ME. \n\nReal shitty eye-ballin DD: Delta and UAL weren't public when **SARS** was around but BA, CCL, RCL, and LUV were.\n\nBA fell from $34 to $25, a 27% decrease.\n\nCCL fell from $33 to $22, a \\~33.3 (repeating of course) % decrease.\n\nRCL fell from $22 to $14, a 37% decrease.\n\nLUV fell from $21 to $12, a 53% decease.\n\nRight now:\n\nBA has fallen from $344 to $305, a 12% decease. And they got those MAX scammin ass problems!\n\nCCL has fallen from \\~$50 to $33, a 33% decrease.\n\nRCL has fallen from $116 to $82, a 30% decrease.\n\nLUV has fallen from $58 to $48, an 18% decrease. They only a US/Carribean/Latin American carrier.\n\nUAL has fallen from $80 to $66, only an 18% decrease.\n\nDAL has fallen from $59 to 49, a 17% decrease.", "score": 6, "replies": [{"body": "Welp,  i have nothing to teach you. Its raining tendies!!!!", "score": 1, "replies": []}, {"body": "Thank you for this :)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Brilliant first one to think or post about this here.", "score": 22, "replies": [{"body": "Lol I know it’s not some diamond in the rough and is a pretty obvious play, but I hadn’t seen it mentioned much here so I thought I’d share some thoughts on it.", "score": 9, "replies": [{"body": "It has been mentioned probably 20+ times a day for the past 3 days.", "score": 10, "replies": []}]}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 14, "replies": [{"body": "Can someone explain this bot? Is it to confuse bloomberg reporters and make them leave?", "score": 11, "replies": [{"body": "I’ve been so confused", "score": 5, "replies": []}]}, {"body": "Good bot.", "score": 1, "replies": []}]}, {"body": "What about Expedia?!", "score": 9, "replies": [{"body": "Short the fuck out of Expedia. They have exposure to flights, hotels, car rentals, cruises... Bookings on all of that shit is going to plummet if beer virus keeps going.", "score": 5, "replies": []}, {"body": "Those poor souls", "score": 1, "replies": []}]}, {"body": "You can play the turnaround too if you don't mind long money. \n\n2022 leaps will be on sale tomorrow and the rest of March. Start stocking up now for amazing tendies because when cruise companies come roaring back, you'll be rich.", "score": 3, "replies": [{"body": "That’s a good play too, that’s why I’m keeping my current plays relatively short dated possibly play the turnaround later. That discount is gonna be nice, but that’s not what WSB wants to see posted.", "score": 8, "replies": []}]}, {"body": "Thanks for this, gonna write some calls on this and probably airlines lmao", "score": 4, "replies": []}, {"body": "Actually helpful.", "score": 3, "replies": []}, {"body": "Where's the onlyfans link.", "score": 3, "replies": []}, {"body": "we talking otm or itm tho?", "score": 1, "replies": []}, {"body": "All international transportation services, including tourism. All resorts. All global fast food chains. What else?", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "These will all be great buys once this shot show is over", "score": 1, "replies": []}, {"body": "God damn you glorious autistic bastard.  As soon as I close out some positions I'm hopping on this.... water train!", "score": 1, "replies": []}, {"body": "Bought 2/14 $40p on 2/10.  Expired worthless :-/", "score": 1, "replies": []}, {"body": "Don't touch rcl till it hits below 80", "score": 1, "replies": []}, {"body": "Most of these are probably getting smacked with puts already. Anyone think about ghroeing Puts on companies who supply yhe food etc services to the cruise lines like ticker symbol chef or any of the other companies whos profits largely cone cruises.", "score": 1, "replies": []}, {"body": "RemindMe! 7 hours iS ThIs HoW iTs DoNe", "score": 1, "replies": [{"body": "There is a 27.0 minute delay fetching comments.\n\nI will be messaging you in 6 hours on [**2020-02-27 12:41:52 UTC**](http://www.wolframalpha.com/input/?i=2020-02-27%2012:41:52%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fa62lo/cruise_ship_stocks/fiwdj6i/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffa62lo%2Fcruise_ship_stocks%2Ffiwdj6i%2F%5D%0A%0ARemindMe%21%202020-02-27%2012%3A41%3A52%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fa62lo)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Ok so calls to inverse you. Gotta think these multi billion dollar companies will come up with a solution in the near future.", "score": 1, "replies": []}, {"body": "Fuck that buy the dip. Virus on ships? Buy. All the ships sunk? Hell yea load me up on calls.", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/haarr1 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "In order to promote quality discussion, your post has been removed for being too short. \n\nPlease resubmit your thoughts with more detail, context, and value-add commentary.\n\nIf you are sharing a link, make sure to provide ample context for your submition.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "They could still have downside but there’s more reward potential in hotel/casino stocks", "score": 0, "replies": []}, {"body": "You are a genius how did you think of this?", "score": -2, "replies": [{"body": "People have been buying puts on these stonks for over two days now. Welcome aboard :)", "score": 0, "replies": [{"body": "Shit I forgot the /s", "score": 7, "replies": [{"body": "Hah, it was pretty obvious", "score": 3, "replies": []}]}]}]}]}
{"title": "Kanye predicted this market 7 years ago", "selftext": "When Kanye West released his song Bound 2 in 2013, he included the following lyrics:\n\n“I wanna fuck you hard on the sink” \n\nSink is a synonym of drop. The market has fucked us hard, and sunk. \n\n“After that, give you something to drink”\n\nDrink refers to beverages, specifically the popular Mexican beer brand Corona. Corona started the Coronavirus to get more name recognition and a bigger market share in the People’s Republic of China. \n\n“Step back, can't get spunk on the mink”\n\nKanye’s obsession with mink coats is well-known. What is lesser known is his penchant for furs made from bears. Much to the chagrin of PETA, Kanye wears coats made from the skin of gay bears who will sell their souls for short term tendies.\n\n“I mean damn, what would Jeromey Romey Romey Rome think?”\n\nIn this one phrase, Kanye reveals that he is not only a gay fish, but a time traveler from the future. The gay bears get fucked🍆💦💦🌈🐻 and Jerome Powell prints money and stonks go up as usual. Jeromey Romey Romey Rome will never allow the market to go down, because the only thing that goes down is my wife’s boyfriend and interest rates. The bull market will never end, and $YEEZY will become a ten billion dollar company. 📈📈📈\n\nTLDR: 3/20 $14 $ACB calls", "id": "fa84rw", "created_utc": 1582786278.0, "score": 2080, "upvote_ratio": 0.96, "num_comments": 90, "comments": [{"body": "ACB needs to file for bankruptcy tomorrow.", "score": 363, "replies": [{"body": "I’m filing for bankruptcy tomorrow uwu \nI’ve lost a months salary in two days :(", "score": 165, "replies": [{"body": "story floating around of users who lost years of savings .. literally a 2% drop per day wiped them out.", "score": 79, "replies": [{"body": "I mean to be fair most of my losses were in some really retarded 2/28 calls\n\nShares are gay \nputs are gay \nalways buy weeklie calls", "score": 49, "replies": [{"body": "You know what isn’t gay? Money. Make money. I don’t care how it’s done.", "score": 57, "replies": [{"body": "shit u just convinced me \nI’m becoming a gay prostitute to get more tendies", "score": 58, "replies": [{"body": "HMU", "score": 17, "replies": []}, {"body": "Not gay if you're making money", "score": 8, "replies": []}, {"body": "Pic?", "score": 4, "replies": []}]}, {"body": "Gimme them tendies. No holes barred   \n🍆🕳", "score": 6, "replies": []}]}, {"body": "3/20 msft for me", "score": 2, "replies": []}]}, {"body": "It's almost like it's a sub full of degenerate gamblers who are massively over-leveraged", "score": 12, "replies": []}, {"body": "oof", "score": 2, "replies": []}]}, {"body": "Those are rookie numbers, you have to pump those numbers up!", "score": 3, "replies": []}, {"body": "Damn, Atleast I am up 56 dollars all time. But we won't talk about my last years gains", "score": 2, "replies": []}, {"body": "Fucking retard", "score": 1, "replies": []}, {"body": "Im down 6 months salary.", "score": 1, "replies": []}]}, {"body": "With the rest of this sub?", "score": 7, "replies": []}, {"body": "Wow ACB puts are cheap af, who's going to buy them though.", "score": 7, "replies": []}]}, {"body": "this is exactly the kind of quality analysis that this sub needs.", "score": 139, "replies": []}, {"body": "Calls???? Man you have some big nuts or full blown autism", "score": 74, "replies": [{"body": "[deleted]", "score": 23, "replies": []}, {"body": "🌈🐻", "score": 18, "replies": []}]}, {"body": "We have gone full retard", "score": 62, "replies": [{"body": "I used to think my life was a tragedy, now I realized it’s a comedy", "score": 81, "replies": [{"body": "tragic comedy", "score": 15, "replies": [{"body": "NC-17", "score": 2, "replies": []}]}, {"body": "Tragedy + time = comedy\n\nAccording to the biggest autist of all time, time is relative. So it checks out.", "score": 9, "replies": []}, {"body": "Traumady", "score": 1, "replies": []}]}, {"body": "full kanye", "score": 1, "replies": []}]}, {"body": "🌊🌊🌊", "score": 23, "replies": [{"body": "Waves don’t die and stonks only go up", "score": 23, "replies": [{"body": "Yeezy, Yeezy, what's good? It's your boy Max Leverage.", "score": 10, "replies": []}]}]}, {"body": "r/wsb confirmed wavyyy", "score": 10, "replies": []}, {"body": "Those calls will get you that mayonnaise colored Benz- You'll push miracle whips. \n\nHowever it should also be noted, that on Wolves he predicts that the Bears, traditionally with a laissez faire approach to everything, will get left behind as the bulls take the sandwich. \n\n\"You tried to play nice, everybody just took advantage\nYou left your fridge open, somebody just took a sandwich \"", "score": 16, "replies": []}, {"body": "thanks, you just jinxed my puts and SPY futures spiked 25 handles\n\nedit:  cool fucking 50 now", "score": 6, "replies": []}, {"body": "J Pow is unironically a good rapper name", "score": 5, "replies": []}, {"body": "Calls it is!", "score": 9, "replies": []}, {"body": "GENIUS... GENIUS.. GENIUUUSSSS!!!", "score": 5, "replies": []}, {"body": "Bro I fuck w Kanye but shut.the fuck up.com", "score": 14, "replies": [{"body": "Poopy di scoop \nPoopy di scoop de whoop \nPoop! \nPoop!", "score": 57, "replies": [{"body": "I love you", "score": 15, "replies": [{"body": "Today I thought about killing you", "score": 28, "replies": [{"body": "What if we fucked rn😳", "score": 15, "replies": [{"body": "I get bleach on my tshirt", "score": 8, "replies": [{"body": "Do you feel like an asshole", "score": 8, "replies": []}]}]}]}]}]}]}, {"body": "nah, he’s actually hella deep in shares tho", "score": 3, "replies": []}, {"body": "ACB should file for dankruptcy", "score": 3, "replies": []}, {"body": "Absolute new level of retard. \n\nThis is the way.", "score": 3, "replies": []}, {"body": "Simply epic sir 😎 you are le gentleman and scholar", "score": 2, "replies": []}, {"body": "i think acb hit $10 once", "score": 2, "replies": []}, {"body": "You could say Covid-19 has been a viral marketing hit from Corona.", "score": 2, "replies": []}, {"body": "This is autism at its finest.", "score": 2, "replies": []}, {"body": "Illuminati confirmed.", "score": 2, "replies": []}, {"body": "Why is there a shitpost tag if all post in r/wsb are shitposts?", "score": 2, "replies": []}, {"body": "Actual TL;DR: SPY 3/6 311c", "score": 3, "replies": []}, {"body": "S&P is tanking boys...money is being printed as we speak!!", "score": 3, "replies": [{"body": "🌈🐻🤮", "score": 5, "replies": []}]}, {"body": "Actually Mink might be referring to the open meat markets in China that helped spread the disease so much. \n\nHaving “spunk” on the mink bc how did a zoonotic virus transmit to humans? \n\nI’ll let YOU figure that one out\n\n*wink*", "score": 2, "replies": []}, {"body": "quality post", "score": 3, "replies": []}, {"body": "He actually created a contingency plan for everyone getting murdered by the decline by making Jesus is King. It was made so that people would find Christ and be able to pray for tendies, because that’s about all bulls can do at this point.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "JIK is fucking amazing for a gospel inspired album. Gay bear is just mad", "score": 1, "replies": []}]}]}, {"body": "Can anyone get me the stoinks when Kanye endorsed Trump and when he wore the hat. I need to know because I have a rare picture of him with the hate as of last week that I may release if the $ACB calls keep rising.", "score": 1, "replies": []}, {"body": "This is the kinda wavey DD that fuels my portfolio", "score": 1, "replies": []}, {"body": "Houston, we have a bruh moment", "score": 1, "replies": []}, {"body": "https://youtu.be/mNYJNI7HSsA", "score": 1, "replies": []}, {"body": "Wow this is some deep lyrical analysis... Too bad the music video had his wife distracting the viewer from the real message.", "score": 1, "replies": []}, {"body": "Bloomberg would like to know your location\n\nIn time, space and the autistic spectrum", "score": 1, "replies": []}, {"body": "u idiots shoulda saw it comin", "score": 1, "replies": []}, {"body": "Kanyedamus\n\nPlease interpret more of his quatrains..", "score": 1, "replies": []}, {"body": "2013 is 7 years ago.\n\nKanye didnt predict shit.  He was earlier than Schiff was on gold or Kudlow was on the recovery from 2008.", "score": 1, "replies": []}, {"body": "Thought this post would be about Theraflu (since renamed to Cold). An underrated one off single of his from the Cruel Summer days", "score": 1, "replies": []}, {"body": "What I miss about kanye?", "score": 1, "replies": []}, {"body": "Shouldn't this be flaired as DD?", "score": 1, "replies": []}, {"body": "I’ll gladly sell you some of those ACB calls", "score": 1, "replies": []}, {"body": "Goddamn ACB Im mulling selling my 6/19 3C for a 54% loss and rolling into the 6/19 1.5C with them... don’t know if that makes sense to do though, since I’d be cutting the tender feast to a happy meal if hits that strike but damn that cushion is calling me", "score": 1, "replies": [{"body": "$ACB is the only company that will turn me into a 🌈🐻\n\nThat shits going to zero friend", "score": 1, "replies": []}]}, {"body": "We need Kanye index now", "score": 1, "replies": []}, {"body": "Bulls looking for anything at this point.  If kanye is leading the bullgang youre in fucking trouble", "score": 1, "replies": []}, {"body": "MBDTF is the GOAT Kanye", "score": 1, "replies": []}, {"body": "Wut?! Go to bed man", "score": -4, "replies": [{"body": "Ur not my mom \nNeener neener neener suck my bull wiener", "score": 5, "replies": []}]}]}
{"title": "This is just the beginning, get your SPY Puts ready and start Yoloing fucking everything on SPY Puts", "selftext": "There was a recent case in K-Town (los angeles) of a flight attendant going through all these eateries around the LAX area and the flight attendant is now positive for the Virus\n\n\nThere has been a confirmed case via r/wallstreetbets in Mid-America in the Kentucky area. He was not allowed to say from where but a redditor did some research on his profile and turns out hes from somewhere in Kentucky and his wife is a nurse where the confirmed Corona Virus was found, they arent allowed to release this information until 3 cases are found in that area\n\n\nJapan to close ALL of its Schools. JAPAN! a COUNTRY! is closing ALL of its schools\n\n\nThe market is going to keep going down, it might float today and tomorrow but over the weekend we will receive more news and we will see another Red Monday and possibly new lower lows on the SPY and DOW\n\n**Before you retards ask here are my positions (i have more this is just all i could screenshot:** https://imgur.com/gallery/d1GEvps\n\n**Update 2:** all my contracts are basically free right now, i bought in a couple days ago, made my money back and partially sold all my positions, all the contracts i have open are free and im letting them ride over this weekend because im expecting more bad news\n\n**Update 3:** Rumors of the 2020 Japan Olympics being cancelled\n\n**Update 4:** https://youtu.be/g4ujV1FjsIU?t=1411 were going to be hearing about this for a while, im straight Bearish right now one the whole market for the next couple months", "id": "faer7f", "created_utc": 1582821456.0, "score": 78, "upvote_ratio": 0.94, "num_comments": 97, "comments": [{"body": "Did you just use r/wallstreetbets as a source?", "score": 98, "replies": [{"body": "For part of it yes\n\nthe kentucky case was from wsb's\n\nbut japan and the K-town confirmation are real news", "score": 21, "replies": [{"body": "You legend.  This is the most accurate source.", "score": 33, "replies": []}, {"body": "Like 90% sure he said they can’t release the info until 3 TESTS are confirmed. Not cases. \n\nThey were using shit tests that were giving false negatives.", "score": 6, "replies": [{"body": "100% youre right\n\nBut if theyre getting cases in KENTUCKY what makes you think LA, San Fransisco, Chicago, New York, San Diego, Hollywood are far off?", "score": 3, "replies": [{"body": "There's already one in San Diego and one in LA, 2 in Chicago", "score": 1, "replies": [{"body": "oh shit i didnt know that", "score": 1, "replies": [{"body": "https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/85320e2ea5424dfaaa75ae62e5c06e61", "score": 1, "replies": []}]}]}, {"body": "KY case is false.", "score": 1, "replies": []}]}]}]}]}, {"body": "i just bought calls on publicly traded cemeteries.", "score": 36, "replies": [{"body": "Fucking 300 IQ play", "score": 13, "replies": [{"body": "Which is why I'm getting hammered to the floor with my BRK.B, NVDA March 20 calls.", "score": 3, "replies": [{"body": "So basically you’re saying now is a good time to buy some BRK.B and NVDA calls", "score": 3, "replies": [{"body": "Yes. Yes I would say that.", "score": 2, "replies": []}]}]}]}, {"body": "The dead are buried tits up.", "score": 6, "replies": []}, {"body": "they wont be using cemeteries look into crematoriums", "score": 2, "replies": [{"body": "is that where powdered coffee creamer comes from?", "score": 1, "replies": []}]}]}, {"body": "I bet Friday will be big red. Who wants to hold over the weekend", "score": 37, "replies": [{"body": "You see I have a weird theory about that.\n\nAll the people buying puts today, yesterday, this week.\n\nThey have short term weeklies more than likely. They'll need to execute the put orders to cash in.\n\nWouldn't this drive stocks up?\n\nInverse to what we usually experience on Fridays when the market shoots up.\n\nEdit to add: I did look historically at previous dip periods and couldn't find basically correlation between drops and put raises on the Friday of. So, that's some good news.", "score": 17, "replies": [{"body": "Actually most people buying SPY are purchasing 3/20 and 4/17’s\n\nMost people will hold their PUTS\n\nAlso I’m expecting more bad news this weekend\n\nALSO a lot of traders are BARELY FOMOing into SPY PUTS right now", "score": 15, "replies": [{"body": "Day 3 of drops, there's going to be lots of fomo I'm sure. Hopefully I hit the top of that dalead cat (if I had enough cash I absolutely would have day traded that rise with a call, then dropped that sucker so fast...)", "score": 3, "replies": [{"body": "PUTS are going to be cheap right now around the SPY $308-$309 levels", "score": 3, "replies": [{"body": "would you double down on puts even if you bought around 305? What strike is recommended?", "score": 3, "replies": []}, {"body": "I’m confused. Those puts are $20 right now", "score": 1, "replies": [{"body": "They were cheaper", "score": 1, "replies": []}]}]}]}]}, {"body": "I was debating on holding onto my 3/2 through the weekend", "score": 3, "replies": [{"body": "hold it\n\ntheres gonna be more bad news", "score": 4, "replies": [{"body": "That’s what I’m thinking. This might be worth taking a loss for", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I believe it. LEAPS probably, if anything. Bound to be lots of those out there who didn't execute the first 3 days.", "score": 3, "replies": []}]}]}, {"body": "Unless something happens over the weekend, monday will open green after such a red week. Even if it's just a pop of green.\n\nThat + IV will fuck you holding over the weekend.\n\nYou better pray for terrible news on Saturday/Sunday if you're holding.", "score": 5, "replies": [{"body": "They’re all basically free contracts\n\nIf there’s good news over the weekend then I don’t lose anything at all\n\nIf there’s bad news it’s Tendie town for yah boy and selling Market open Monday", "score": 3, "replies": [{"body": "If there's good news over the weekend you get raped on Monday, what are you talking about", "score": 1, "replies": [{"body": "Good news i get raped\n\nBad news i get good\n\nall contracts i hold are free so i dont care", "score": 1, "replies": []}]}]}, {"body": "market never bottoms on a friday...", "score": 1, "replies": [{"body": "Friday will be red. Monday will not be blood red unless there's significant news Friday or over the weekend.\n\nDon't know what you're talking about in reference to what I said.", "score": 1, "replies": [{"body": "\" Even if it's just a pop of green. \"\n\nOh I see, playing the vague as fuck dd card... that always works. Sorry I jumped the gun on calling out your burgers disease.  \n\nI'll adjust my comment, \"the market isn't always really bigly red on fridays but sometimes it may turn green and it'll only be for a little bit, pray for bad news or you might get hurt, but maybe not that much since it could be green on monday. watch your theta, unless its not a big deal with you know, news and stuff\"", "score": 2, "replies": []}]}]}]}]}, {"body": "I got my spy puts at the tippy top of today's run... Closed out pretty much all my other positions to Yolo this...", "score": 17, "replies": [{"body": "I YOLOed at 301.50 299p 10 contracts.  I'm not worried about that dead cat bounce but fuuuuuck it didnt make me happy.", "score": 3, "replies": []}, {"body": "Me too brother. I sold my spy puts that went ITM at open, then bought more OTM on the dead cat", "score": 2, "replies": [{"body": "How far OTM should I buy and how far out expiration?", "score": 2, "replies": [{"body": "I got 3/27 300 and 291 (this one is a yolo)", "score": 1, "replies": [{"body": "Better than mine... 290 3/16...", "score": 1, "replies": []}]}]}]}]}, {"body": "SPY 210? Fuck. That's ambitious.", "score": 11, "replies": [{"body": "im not looking to hold till expiration im selling once i break even on my original buy in then just holding", "score": 3, "replies": []}]}, {"body": "$SPY\n\n$DAL\n\n$AAL\n\n$JBLU", "score": 8, "replies": []}, {"body": "How do you play this when you do it? Just cash out each time something hits a prespecified point or just let them fucking ride?", "score": 5, "replies": [{"body": "For example if I buy 3 Puts for a total of $50 bucks and the next day I’m up say 100% then I’d sell one contract to make back most of my money and that way I now have 2 free contracts and let them ride", "score": 8, "replies": [{"body": "That’s helpful. I did this midday I have 77 contracts now at various prices. One question is there a ton of decay with these? So I had 8 3/2 contracts at 305 that I bought for 60 cents. I sold it at $6 Bc I was scared that 3/2 is coming up and if market bounced I’d get fucked on that a lot more than the ones later out. I ended up rolling it over tho to a later date but should I have just held it?", "score": 2, "replies": [{"body": "Nah you did good\n\nMarch 2 is way too soon, I’d focus on at least month out contracts or minimum 2 weeks\n\nA couple days out or a week is way too little\n\nYou can also debit spread to get deeper in the money but the return is less although the risk is a lot less too\n\nDebit Spread = Buy a Put and Sell a Put\n\nBuy a $100 Put, Sell a $105 Put\nThe difference is $5.00\n\nYour max gain for that can be $500\n\nBUT Debit Spreads are ALOT cheaper than regular calls or puts", "score": 5, "replies": [{"body": "That’s good info. Ya My problem has always been I want to make it big on one yolo I always shoot myself in the foot. Almost without fail but let’s see. I kept my puts open I’m at 13k right now.", "score": 2, "replies": [{"body": "You Yolo'd $13,000 on Puts and you dont know what youre doing?\n\nYeah you belong here lol", "score": 2, "replies": []}]}]}]}]}]}, {"body": "YOLO engaged", "score": 3, "replies": []}, {"body": "Stonks only go up", "score": 5, "replies": [{"body": "Respect.", "score": 2, "replies": []}]}, {"body": "Japan will be bouncing back hard at some point. They have one of the worst demographics in the world. The harder Corona hits them, the more their economy will strengthen in the long run.", "score": 5, "replies": [{"body": "explain", "score": 7, "replies": [{"body": "Japan has fewer children and more old people due to their demographic shift (high life expectancy, low birthrate). The virus kills old people primarily so this will ease the burden on their pension system.", "score": 3, "replies": []}]}, {"body": "Japan will \"bounce back\" from the absolute bottom that it hasn't even hit yet.\n\n* Oylmpics attendance will fuck them. They're banking HARD on it revitalizing their economy.\n\n* Their economy is already in the shitter. Lack of innovation on products, and being bypassed for other island nations in trading routes.\n\nSure they'll bounce back, maybe in 20-30 years.", "score": 3, "replies": []}, {"body": "Bro you know Japan has the biggest population of seniors in the developed world right? Coronavirus is lethal to seniors. How does your argument make sense?", "score": 4, "replies": [{"body": ">at some point\n\nWhen all the elderly are dead, their economy is going to rocket cause they dont have to support those old fuckheads any more.", "score": 19, "replies": []}, {"body": "Less elderly = less pensions = less taxes = Make Japan Great Again.", "score": 12, "replies": [{"body": "Oh shit so Japan is PRO virus", "score": 2, "replies": []}]}, {"body": "Oh shit", "score": 2, "replies": []}]}, {"body": "Not if this gets so bad they have to cancel the Olympics", "score": 1, "replies": [{"body": "I meant in the long run. Over a time-scale of many years.\n\nHaving a bad demographic is one of the absolute worst things that can happen to a country.", "score": 2, "replies": []}]}]}, {"body": "I was in central Mass yesterday. Someone at the meeting mentioned there was a confirmed case in UMass College in Worchester", "score": 2, "replies": []}, {"body": "SPY puts after a 35 point drop in a week. Too late for that. Play the bounce. SPY 301 gap filled. SPY 312 test tomorrow however premium is through the roof it's best to sit on hands at this point. Risk/reward isn't there after such volatility", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "OK an EOM Friday with puts on the play makes me feel better about my buy-to-cash out puts theory.\n\nIf it was middle of the month, I'd be worried about the position I just took.", "score": 1, "replies": []}, {"body": "What does this mean?", "score": 1, "replies": [{"body": "It means massive sell off - inverse, the stock may rise", "score": 4, "replies": []}]}]}, {"body": "Too bad you thought this, could’ve made some sweet tendies", "score": 3, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Im locked and loaded", "score": 1, "replies": []}, {"body": "I wonder what will happen if there is no bad news over the weekend?", "score": 1, "replies": [{"body": "i get raped", "score": 1, "replies": []}]}, {"body": "MACY's 3/20 puts are ridiculously cheap right now.", "score": 1, "replies": [{"body": "ill look at the chart right now", "score": 1, "replies": []}]}, {"body": "SHORT NIKE - if olympics get cancelled, nike is dropping hard", "score": 1, "replies": []}, {"body": "Brother I hope you know you're buying puts 10% too late. 300 was bottom.", "score": 1, "replies": [{"body": "I’m not holding till expiration I’m holding till tomorrow and possibly over the weekend\n\nThere is more bad news underway", "score": 3, "replies": [{"body": "🌈🐻", "score": -3, "replies": []}]}, {"body": "Why do you think its the bottom", "score": 3, "replies": []}, {"body": "300 is the bottom aye?", "score": 2, "replies": [{"body": "Yeah I was wrong but I’m still not convinced of this whole recession thing. Seems like a bear trap/long capitulation. \n\nCould be dead wrong tho", "score": 1, "replies": [{"body": "I think we trade red through March and the rebound starts in April / may as everyone tries to buy back in at discount to ride the wave back. Supply chains will be fucked and I think we see a lot of volatility in general which is good for us gamblers playing options if we guess right.", "score": 1, "replies": [{"body": "Definitely possible", "score": 1, "replies": []}]}]}]}]}, {"body": "Day high SPY buy program kicks in. Volatility at day lows. This isn't YOLO or DD. This is just a newbie.", "score": 0, "replies": [{"body": "justwaiting for that $310 retest", "score": 1, "replies": []}]}, {"body": "Whoever sold you these is laughing their fucking ass off right now", "score": -1, "replies": [{"body": "nah i already made all my money back\n\nthese are all basically free contracts", "score": 2, "replies": []}]}]}
