{"title": "6700 on TSLA 600 wish me luck", "selftext": "&#x200B;\n\nhttps://preview.redd.it/c6g7r8hmy0z41.png?width=1111&format=png&auto=webp&s=a1992f6a2af90e96ed4aa8ef7829ede17137cf2f", "id": "gkle7t", "created_utc": 1589590345.0, "score": 72, "upvote_ratio": 0.91, "num_comments": 84, "comments": [{"body": "I respect the fuck out of this post. You’re going to lose all of your money but I respect it. Stay strong brother.", "score": 122, "replies": []}, {"body": "Fuck tesla im never touchin that shit again", "score": 28, "replies": []}, {"body": "Dude just give me $5000 and punch yourself in the nuts.", "score": 23, "replies": []}, {"body": "All the bad news the last week and you think it’s going to go down now? Production is starting up and it’ll be on its way to 1000", "score": 39, "replies": [{"body": "Not only that but they have their mythical new battery that's supposed to bring the price in line with traditional combustion engine vehicles", "score": 26, "replies": [{"body": "That he keeps pushing back the unveil on. Lmao", "score": 1, "replies": [{"body": "He’s edging us", "score": 3, "replies": []}, {"body": "I'm sure it'll be great like the roadster... And the semi... And the robotaxis.", "score": 2, "replies": []}]}]}, {"body": "That’s when it will go down. When people least expect it.", "score": 2, "replies": []}]}, {"body": "Why?", "score": 31, "replies": [{"body": "yes", "score": 89, "replies": []}]}, {"body": "Prepare for glory or autism", "score": 16, "replies": []}, {"body": "Lol enjoy losing your 6700", "score": 26, "replies": []}, {"body": "Only time you make money on Tesla puts is when Elon tweets it’s too high. Otherwise have fun wasting your money", "score": 10, "replies": []}, {"body": "Everyone knows you don’t bet against Elon Musk. You should have just donated the money.", "score": 10, "replies": [{"body": "He did, too the rest of us, making inverse plays now.", "score": 1, "replies": []}]}, {"body": "most of wsb is telling me im going to lose money, any doubt i couldve had is absolutely gone now.", "score": 11, "replies": [{"body": "These retards probably all have $1,200 calls expiring in two weeks.", "score": 5, "replies": []}, {"body": "I’ve got 16k puts in that pot with you. June expiration. TA says, drop bitch. Quite possible I’m fucked. Fuck it, YOLO", "score": 2, "replies": []}]}, {"body": "You don’t need luck where you’re going", "score": 4, "replies": []}, {"body": "Bold move banking on Elon tweeting something stupid.", "score": 4, "replies": [{"body": "You mean **NOT** tweeting something stupid", "score": 3, "replies": []}]}, {"body": "Its gonna print but know when to reverse into a leap call around $500", "score": 3, "replies": [{"body": "thats what im thinking will happen. Alot of people would buy FD calls on tsla, but i cant see many ppl or institutions buying it at 800+ a share for long", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "for puts on tsla, everythings a yolo", "score": 41, "replies": [{"body": "That’s fair", "score": 2, "replies": []}]}]}, {"body": "one does not betray papa elon and come away profitable", "score": 3, "replies": []}, {"body": "I would give you my blessings of luck but abour 1/3 of my whole portfolio is in TSLA stock, so....", "score": 3, "replies": []}, {"body": "Show me on this doll where tsla touched you", "score": 3, "replies": []}, {"body": "Me too bro just waiting for Elon to tweet a picture of his dick and announce he’s running for VP with Portnoy", "score": 3, "replies": []}, {"body": "Very few can afford it in this shitty economy, tendies on your way..", "score": 3, "replies": []}, {"body": "I love how 8 months ago people would find this insane, and Tesla had literally no dramatic changes or announcements since.", "score": 3, "replies": [{"body": "Cybertruck announcement, Chinaville, Berlin, and Austin gigafactory, Model Y early launch.  Yeah, nothing has changed at all.", "score": 6, "replies": [{"body": "Cybertruck was the most pump and dump thing I'd ever seen from Musk. Imagine believing a 90's concept car design would be realistic and/or practical as a production model! Tesla fanboys are hyperdelusional. Once the reat of the market starts to come back, while TSLA goes sideways at 800, they'll start leaving en masse for profits elsewhere", "score": 1, "replies": [{"body": "800 still puts them above the value of every car maker in the world outside of Toyota.  In 18 months well see who was right (hint: it'll be me as I'm riding around in my trimotor CT giving you a Hami to wipe off my windshield with a newspaper and spray bottle).", "score": 2, "replies": []}]}]}]}, {"body": "Yeet", "score": 2, "replies": []}, {"body": "But why?!", "score": 2, "replies": [{"body": "Shit looks bleak, battery day delayed until june. I sold my tesla stock today. Might buy it monday tuesday dunno", "score": 2, "replies": []}]}, {"body": "Welcome home", "score": 2, "replies": []}, {"body": "Good play.", "score": 2, "replies": []}, {"body": "Why not spend 6700 for 1000 calls and call it a day man", "score": 2, "replies": []}, {"body": "I'm sending you positive vibes on this one bro.\n\nI really hope this trade works out for you bro.\n\nBro, I just really hope you make money bro.", "score": 2, "replies": []}, {"body": "All the negative pub about tsla of late. Think this is crazy enough to print.", "score": 2, "replies": []}, {"body": "I know what you did there.\nBut TSLA is a no touch for puts.\n\nEven when CEO papa Musk say : Stock to high IMO\nHUGE DROP got bought back to where it’s was immediately.", "score": 2, "replies": []}, {"body": "You're screwed man, never bet against tesla", "score": 2, "replies": []}, {"body": "Battery day next month when they're expected to announce their million mile battery, now deets about the Autobidder, becoming an energy utility in the UK, deets about how their mega pack in Australia not only made back it's money in two years but now prints money for them, aaaaaaaaand the head of their battery research basically figured out a way to have hybrid dry cells with less cobalt, lithium doping, lower cost to production, size, time to build, higher density, and can do 0-100% charge/burn down without degrading the cell.\n\nAnd you did a put.\n\nThe facts are clear. Your autism developed cancer and that cancer developed autism. Seek help.", "score": 4, "replies": [{"body": "The sum of total of TSLA still equals a capital furnace. Which is ran by the same person who posts to the @elonmusk twitter account.", "score": 3, "replies": [{"body": "And yet, is it's managed to disrupt several industries simultaneously. People who change the world aren't required to be saints. That's just too idiotic a standard to hold.", "score": 0, "replies": [{"body": "Disruptions that haven’t changed the capital furnace status.  \n\nI am looking forward to battery day though and wouldn’t bet against Musk.  Pretty sure he’s the alien running the simulator.", "score": 2, "replies": [{"body": "That's a fair point, but I think that point also is an unfortunate consequence of the fact that we as a species have done a terrible job of moving towards a renewable future when opportunities have arisen many a times in the past, and instead entrenched and expanded cheaper but dirtier options.", "score": 2, "replies": [{"body": "Yep, valid.  \n\nWe could power the entire US with solar panels in the Southwest.  Energy storage, not generation, has always been the problem with renewables.  Thats where I see the value of Tesla and why I’m looking forward to battery day.", "score": 2, "replies": [{"body": "Exactly, but to get to that point, you basically need to disrupt every process along the way, and disruptions are never cheap. They're capital furnaces each and most disruptions are generally limited to one industry. Tesla is unique in that it's disrupting transportation, artificial intelligence, autonomous driving, energy deliver *and* energy storage simultaneously. Thus, for them to burn through so much cash consistently is in line with disrupting 5 industries.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Are you aware that we are in a bull market?", "score": 4, "replies": [{"body": "Obvs a longterm trap, but yeah bull now", "score": 8, "replies": []}]}, {"body": "If it’s drop to 600 I’m buying $50k worth of stock lol", "score": 3, "replies": [{"body": "No you wouldn't pussy", "score": 19, "replies": [{"body": "Lol yes I would\n\nI’ve done it before", "score": 1, "replies": []}]}, {"body": "same", "score": 0, "replies": []}]}, {"body": "I made 2500% on TSLA puts near the last peak. Every trade since then has felt lackluster.\n\nGood luck!", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What is it that you know what I don’t?!", "score": 1, "replies": [{"body": ";)", "score": 2, "replies": []}]}, {"body": "Ur an autist, rule #1 of wsb is not to buy Tesla puts", "score": 1, "replies": []}, {"body": "Erm who knows.. but that could have been better spent. God speed.", "score": 1, "replies": []}, {"body": "LOL! Tesla is one fire right now!\n\nhttps://mobile.twitter.com/miamibeachfire/status/1261304774315708420", "score": 1, "replies": [{"body": "Oh god it’s happening again", "score": 1, "replies": []}]}, {"body": "You will need it!! It’s simple really. Change one letter from a P to a C. Thank me later", "score": 1, "replies": []}, {"body": "You mean 5k on tsla 600? Lmfao", "score": 1, "replies": []}, {"body": "Next time just paypal me the money", "score": 1, "replies": []}, {"body": "So you're basically hoping Elon Musk dies or loses his mind by october.", "score": 1, "replies": [{"body": "I hate to break this to you but... I'm fairly certain Elon has already lost his mind.", "score": 3, "replies": []}]}, {"body": "Enjoy the slow death", "score": 1, "replies": []}, {"body": "He hates money like me!", "score": 1, "replies": []}, {"body": "Hey there buddy. I’m going to say a little prayer for ya.", "score": 1, "replies": []}, {"body": "Don't bet agains Elon, nibba", "score": 1, "replies": []}, {"body": "I dont understand how people are still buying puts", "score": 1, "replies": []}, {"body": "This is so fucking retarded.  You must hate money.  See you at 1000 in june.", "score": 1, "replies": []}, {"body": "I expect this will print when the market shits again.  May need to diamond hand those to $900 first though", "score": 1, "replies": []}, {"body": "This will print nicely for you, although I would have preferred a bit more than 154 days. But I'm a chicken shit.\n\nMight copy your trade but with an option that's deep in the money and put up some more cash instead...", "score": 1, "replies": []}, {"body": "If your just gonna waste the money, waste it on something fun.", "score": 0, "replies": [{"body": "Are you implying gambling and posting on WSB isn't fun?", "score": 1, "replies": []}]}]}
