{"title": "Mayor of Fremont supports Tesla opening the facotry.", "selftext": "", "id": "ggngy8", "created_utc": 1589057638.0, "score": 199, "upvote_ratio": 0.94, "num_comments": 80, "comments": [{"body": "This is amazing... response from Alameda county.\n\nhttps://mobile.twitter.com/Dare2BWell/status/1259229231306862592", "score": 50, "replies": [{"body": "Oh look, they are \"gUideD bY DaTa aNd SciEnCe\"", "score": 13, "replies": [{"body": "Honestly, a swift government response would be one that could weigh the ability of a company to safely operate while considering their importance. At this point, if a company employing 40,000 ppl had the precautions in place and data I'd let them operate.\n\nI think you can be guided by math.", "score": 22, "replies": [{"body": "Of course being guided by data and science is a great thing. But when people say that it has nothing to do with data and science. It's just rhetoric to make you trust whatever they choose to do. It's basically the socially acceptable way of saying r/iamverysmart and pretty much everyone falls for it.", "score": 20, "replies": [{"body": "That's true. There are basically two trees involved: \n\n• action>result>gather data>argue about data\n• action>result>manipulate data>argue about data\n\nIt feels like we're constantly stuck at 3, and any certainty is temporary.", "score": 4, "replies": [{"body": "Right. Instead of people telling people they are very smart, they explain their position and convince the other that their thoughts on the issue are sensible and correct. But when people don't want to do that, they just say, \"I listen to science you should trust me\". Like that's the dumbest crap ever. How about SHOWING your data and EXPLAINING your science? And then see if people think it makes sense. Unfortunately these days, people gain incredible amounts of trust from the majority of people just by saying, \"SCIENCE!\". It's literally no different than the priest that gains trust from people by making them think he's the only one that can hear God. How are people okay with this??", "score": 4, "replies": [{"body": "Oh okay, but some douche bag stating \"I trust my gut\" is better to listen to?", "score": 0, "replies": [{"body": "About the same honestly", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Dude, I stand for science. Maybe you should too.", "score": 1, "replies": [{"body": "Maybe he's a dart board guy with stocks.", "score": 1, "replies": []}, {"body": "I'm suddenly reminded by the Southpark episode where Cartman gets frozen, wakes up in the future with no religion and there's a war between different factions of atheists who simply fight over what to call themselves.\n\n\"OH MY SCIENCE!\"\n\n\"SCIENCE DAMN YOU!\"", "score": 1, "replies": []}]}]}]}, {"body": "Of course not. Noone said that", "score": 0, "replies": [{"body": "[https://www.msnbc.com/stephanie-ruhle/watch/trump-to-wash-post-i-trust-my-gut-more-than-anybody-else-s-brain-1382686275745](https://www.msnbc.com/stephanie-ruhle/watch/trump-to-wash-post-i-trust-my-gut-more-than-anybody-else-s-brain-1382686275745)\n\nTry to step out of your own echo chamber there's a real world out there that", "score": 1, "replies": [{"body": "He was replying to a specific commenter as if that commenter had said that. Which is totally not true. You step out of your box and read.", "score": 1, "replies": [{"body": ">He was replying to a specific commenters as if that commenters had said that. Which is totally not true. \n\nHere's the transcript where he says it.\n\n \n\nRUCKER: — But Mr. President, it <the buck> doesn’t seem to stop with you.\n\nTRUMP:  I’m not blaming — look, I took recommendations. I’m not blaming  anybody. But I will tell you, at this moment in time I am not at all  happy with the Fed. I am not at all happy with my choice. I think we  have to let it go. You know, if you look at — China is being  accommodative. The euro and Europe is being accommodative. We’re not  getting any accommodation, and we’re also paying $50 billion, we’re  paying down our liquidity, is — you can make the case it’s a positive  thing in one way, but another thing, it snaps your liquidity. So I’m  doing deals, and I’m not being accommodated by the Fed. I’m not happy  with the Fed. ***They’re making a mistake because I have a gut, and my gut  tells me more sometimes than anybody else’s brain can ever tell me.*** \n\nRUCKER: But you’re the president, sir.\n\nTRUMP: I’m not blaming anybody.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Very similar to rhetoric out of doomsday global warming crowd, at least the county office is consistent", "score": -5, "replies": []}]}, {"body": "Yeah #freeamazon", "score": 1, "replies": []}, {"body": "If everyone is wearing a mask, it can be much safer.  Masks and hand washing have to be mandatory everywhere in the factory.  Including while eating in the break room.  Move mask, open mouth, close mouth, put mask back on chew.  That's the only way we're going to safeguard the Tesla employees and their family.", "score": 1, "replies": [{"body": "No. Keep 6 feet apart while eating lunch. If you keep touching the mask every time you take a bite, that is really really bad. You'll get the germs your mask has collected on your hands. Then you go to take a bite, bringing those hands right up to your uncovered face. \n\nGet a new mask or put it aside and only touch the strings that go around your ears. Then wipe the surface it was resting on.", "score": 11, "replies": [{"body": "Well said", "score": 2, "replies": []}, {"body": "If you eat with your right hand and use your left hand for the mask, there's no cross contamination.  That's another option too.  Take it from a viewpoint of someone that is infected and can infect everyone, wouldn't you try to do as much as possible to not infect someone else and still be able to work?", "score": 0, "replies": []}]}, {"body": "Are you serious lol", "score": 2, "replies": []}, {"body": "Complete overkill if you understand science. Also the masks are not good for some people.", "score": -2, "replies": [{"body": ">Complete overkill if you understand science. Also the masks are not good for some people.\n\nI'm sorry, no. Wearing a mask reduces droplet spread from breathing, coughing, and sneezing. If you have coronavirus, it significantly reduces the chances of spreading it.\n\nI support Tesla reopening, but I don't support behaving idiotically. Tesla has shown in GigaShanghai that they can take precautions, keep the spread down and operate; not wearing a facemask and reopening is akin to prayer as precaution.", "score": 8, "replies": [{"body": "Wearing a mask while eating food is idiotic. That is idiotic behavior. Which is the context of those comments.", "score": 4, "replies": []}, {"body": "Well said.", "score": 1, "replies": []}, {"body": "Listen to your leader Elon. He gets it. So many people opperating out of fear and not facts. Again don't take my word. Take your boy elons words.", "score": -4, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Totally agree with you on that.   Either by conviction religion or politics, if you don't want to wear a mask you don't get to contaminate everyone else at a store your job or other public places.  You can shelter in place at home", "score": 1, "replies": [{"body": "Dude. Just stay home in your bunker.", "score": 1, "replies": []}]}, {"body": "Exactly. But the media and certain groups of people (a surprising amount) doesnt want you to do this. They don't want people to do anything other than hunker down and they act as if you were twirling a gun on the end of your finger in a crowd if you don't wear a mask. \n\nThe cult following and the hyper activism is insane on this now. \n\nI gave people a pass in the beginning when we really didn't know what was going on or how bad this was going to be. It's ok to be scared for a while. But eventually you have to educate your fear away and then asses what's best for you. \n\nNot jump into mob mentality and bully those that need to get back to work", "score": -2, "replies": [{"body": ">twirling a gun on the end of your finger in a crowd if you don't wear a mask\n\nThe above is a scientific fact.  The ability of c19 to spread in a crowd is very well documented.  Maybe you need to do some of that \"educating\" that you state you do and step out of your echo chamber and do some research.", "score": 1, "replies": [{"body": "6 feet. 6 friggin feet. Stay 6 feet away. \n\nIt's droplets not atomized in the air like mustard gas. \n\nMaybe you need to understand how the actual transmission works. \n\nI'm also talking about the attitudes of people. \n\nIf you want to wear a mask. Wear a mask. \n\nBut stay 6 feet away. \n\nIf you are 6 feet away and wear a mask and don't feel comfortable and are going to be crappy to those around you. Just stay home.", "score": 0, "replies": [{"body": "The virus can stay in the air for hours\n\n[https://www.nejm.org/doi/full/10.1056/NEJMc2004973](https://www.nejm.org/doi/full/10.1056/NEJMc2004973)\n\nHere you go, that's how it works.  \n\nBtw, It's nice to know that you are trolling in multiple forums trying to push people into believign that C19 is a hoax created by the democrats.  Very nice!  I guess if we have to take your word on things, and have you help us \"understand\" things, you would also tells us that the earth is flat, the moon landing never happened, that vaccines should be banned, that obama was not born here, and that you have \"inside information\" and need to listen to you.", "score": 0, "replies": [{"body": "Where am I trolling in multiple forums? Lol and I never said this is a hoax. Wtf is the matter with you. You are making ALL of that up. Seriously wtf is the matter with you. \n\nI have never said it's a hoax.", "score": 1, "replies": []}, {"body": "Why did you group.me into an antivaccer and a moon landing denier? Wtf is wrong with you. \n\nThe tribalism and stupidity is ridiculous. \n\nLet me ask you this how long do aerosols stay suspended in the air? \n\nLet's take a lab test and figure out what it means in the real world. \n\nAnswer the question.", "score": 0, "replies": [{"body": "I group you with them because you all use the same tactic.  Someone proves you wrong with scientific links, then you try to do an \"observation\" from your back yard to say that the scientific peer reviewed journal article is wrong.   Come on, don't deny it, you know you are one of the super combo deniers.\n\nSo answer the question, did you read the link?  NO.  Now you're just trolling to keep me busy.\n\nSo let's see...\n\ntypical troll...\n\n1.  Make statemement or counter statement.\n2. When confronted with facts or links, try to confuse with some general observations or talking point even if it doesn't have any scientific basis\n3. Continuously respond back with more questions to waste the poster's time.  If they quit, it looks like you win.\n4. Don't ever try to directly talk about the science article posted, instead re-direct at the poster.\n5. .....", "score": 1, "replies": [{"body": "Yes I read the link. Twice. \n\nYou make assumptions is just like trump saying he trusts his gut more than someone else's brain \n\nYou are just as guilty as him. \n\nYou are guilty of prejudice as well. You like grouping people and painting with broad brushes all for dramatic effect. \n\nI'm asking YOU the question because YOU posted the link. \n\nDo you understand the data?\n\nDo you understand what it means in the real world? \n\nObviously not which is why you are acting out of fear. \n\nWhen you don't understand something you act out of fear. Which is exactly what you are doing. \n\nRight hand left hand cross contamination nonsense while eating. What a friggin joke. \n\nPut your bio Hazzard suit on and stay in your home.", "score": 0, "replies": [{"body": "> Yes I read the link. Twice.\nhmmm you should be clicking on it, then reading the multipage study, but you didn't do that...you just \"read the link. Twice.\"\n> \n> You make assumptions is just like trump saying he trusts his gut more than someone else's >brain\nYou are the one behaving like he does when he sees a study and says, I'm going to go with my gut feeling on this and no, the corona virus is not a problem for the u.s.\n \n> You are guilty of prejudice as well. You like grouping people and painting with broad brushes all >for dramatic effect.\nCalling someone (me) prejudice because I oughted (you) the covidinier, is a fallacy of logic.\n\n> I'm asking YOU the question because YOU posted the link.\n> Do you understand the data?\nMore redirecting to not have to answer to any scientific proof that you are just echo chambering what your tribal party affiliation wants you to.\n\n> Do you understand what it means in the real world?\nOh I do.  Any several forums you state that what's happening in new york with the hospitalization is sensationalized/fake.  More proof that your a covidinier/covidiot  \n\n> Obviously not which is why you are acting out of fear.\nOh gee I'm 12 years old, I'm being called a coward, so I'll change my stance.  Really, that's effective?  300 Million Americans are scared to get it, not because it might kill them, but because of how sick you get.  People are stating this is the worst they've even been sick in their life.\n \n> When you don't understand something you act out of fear. Which is exactly what you are doing.\nWhen you want to propagandize something, you tell people that they shouldn't be scared to make them feel like a coward.  \n> Right hand left hand cross contamination nonsense while eating. What a friggin joke.\nI answered this in an earlier post to say, eat with right, move mask with left.  You are grasping at straws.  Give it up, your done, everyone here knows your done, you're post ratings are in the negative (and that's amazing since the majority of this forum is conservative) that must mean that everyone considers you an idiot.\n\n> Put your bio Hazzard suit on and stay in your home.\nAnother exaggeration to try to redirect.  Can't you come up with one scientific link that bolsters your argument?  The plain answer with the 7 back and forths we've been through is NO.", "score": 1, "replies": [{"body": "Lol. And now we can all see who is off their meds. Man... Calm down you are losing it.\n\nYou just keep stretching the truth for these baseless attacks. \n\nI am not on multiple forums saying that covid is a hoax. You are 100% making this up and have lost all credibility. \n\nYour response has been the equivalent of \"I'm rubber your glue\" but far less eloquent. \n\nYou still haven't answered my very basic direct question because you know if you answer it it destroys your points as well proves that you don't understand your own article you posted. So you are refusing. Like a child. \n\nIt's ok. You are chosing to live in fear and stay in your bunker. Go ahead. That's your right. \n\nNo 300 million Americans are not as scared as you are. You made that up. Again losing all credibility. \n\nYou say they are scared to death with how sick they will get... Yet there are thousands at beaches and millions back at work. Seems like your stats you pulled from your ass has more than one hole in it. \n\nAlso if you just LOOK at the data people can extrapolate how fearful they should be if they get it.  \n\nIf they are over 65 or immune deficient. They should be cautious. \n\nIf you aren't... The numbers say it is overwhelming unlikely that you will be hospitalized. That is a fact. \n\n\"Give it up you are done\" is that because I'm blowing holes in your stupid arguments and showing everyone how hyper you are over this subject. Dude. Turn off the panic box. Educate yourself. Do the math. Relax. Take the nessecary precautions. The sun will come up tomorrow. \n\nR\nE\nL\nA\nX\n\nAnd btw when did you become the arbiter of when things are \"done\". What a joke.\n\nGet over yourself.", "score": 0, "replies": [{"body": ">Lol. And now we can all see who is off their meds. Man... Calm down you are losing it.\n\nI'm the one that told you to calm down, nice attempt at redirecting.  To get back to the argument instead of waste of time redirect away from my direct questions...lets continue...\n\nSo again you lose\n\n>You just keep stretching the truth for these baseless attacks.\n\nI posted a link to the study about covid-19...I asked you to find scientific evidence that this study is wrong.  You still haven't.   You try to re-direct again.\n\nSo again you lose.\n\n>Your response has been the equivalent of \"I'm rubber your glue\" but far less eloquent.\n\nI gave you scientific evidence.  If you consider that has rubber or glue, that's your choice, but it makes you look like an idiot.  To prove your not an idiot, I asked you to come up with studies that dispute the study I came up with, and you have not.  I asked you to come up with your own argument, quoting the study I mentioned, and you have not.  This is more evidence of my previous post:  \n\n* When confronted with facts or links, try to confuse with some general  observations or talking point even if it doesn't have any scientific  basis \n\nSo again you lose.\n\n&#x200B;\n\n>You still haven't answered my very basic direct question because you know if you answer it it destroys your points as well proves that you don't understand your own article you posted. So you are refusing. Like a child.\n\nI do understand the science, it's very simply put in the research and I do understand how it applies in the real world.  Hence my original statement that everyone should wear a mask even while eating.  Somehow you weren't able to understand that I already answered your question.  Again, more evidence of my previous post:  \n\n* Continuously respond back with more questions to waste the poster's time.  If they quit, it looks like you win.\n* Don't ever try to directly talk about the science article posted, instead re-direct at the poster.\n\nSo again you lose.\n\n&#x200B;\n\n>It's OK. You are choosing to live in fear and stay in your bunker. Go ahead. That's your right.  \n>  \n>No 300 million Americans are not as scared as you are. You made that up. Again losing all credibility.\n\nI don't live in a bunker nor have I suggested living in a bunker.  Again more Paul Bunion exaggerations.  Here are the facts, 330 million people live in the U.S.  The vast majority, by estimate 300 million of us are scared of the virus, hence the masks, staying at home.  About 30 million of you (the cook deniers) think it's a hoax. \n\n So again, you lose.\n\n&#x200B;\n\n&#x200B;\n\n>You say they are scared to death with how sick they will get... Yet there are thousands at beaches and millions back at work. Seems like your stats you pulled from your ass has more than one hole in it.\n\nSouthern California has a population of around 23 million.  1000's at the beach out of 23 million doesn't even make 1%.  Wow, what a majority again you lose.\n\nThe people at work aren't happy about being back at at work because douche bags keep showing up without masks.  For the extreme minority of people protesting (still not 1% of the population) including you, my stats are doing just fine.  1% want the state to open based on demonstrations and beach.  99% stayed at home.  Looks like the majority based on this observation is likely.  Show me a scientific poll that shows that a majority of people are unhappy about the masks or unhappy about Newsom.  Again you lose.\n\n&#x200B;\n\n>If they are over 65 or immune deficient. They should be cautious.  \n>  \n>If you aren't... The numbers say it is overwhelming unlikely that you will be hospitalized. That is a fact.\n\n \n\nAdhanom Ghebreyesus stated: \n\n“**Globally, about 3.4% of reported COVID-19 cases have died**. By comparison, seasonal flu generally kills far fewer than 1% of those infected.\n\n[https://www.the-scientist.com/news-opinion/why-some-covid-19-cases-are-worse-than-others-67160](https://www.the-scientist.com/news-opinion/why-some-covid-19-cases-are-worse-than-others-67160)\n\n\"   Elderly and sick people are most susceptible to severe forms of COVID-19...the fatality rate for people with cardiovascular disease was 10.5  percent. That figure was 7.3 percent for diabetes patients and around 6  percent for those with chronic respiratory disease, hypertension, or  cancer.  \"\n\nSo it's not only grandparents that you want to kill off, people with diabetes, chronic respiratory disease, hypertension, or cancer are good enough to go to the slaughter.  Who elected you Hitler?\n\n&#x200B;\n\n>\"Give it up you are done\" is that because I'm blowing holes in your stupid arguments and ***showing everyone how hyper you are over this subject.*** Dude. Turn off the panic box. Educate yourself. Do the math. Relax. Take the necessary precautions. The sun will come up tomorrow.  \n>  \n>R E L A X  \n>  \n>And btw when did you become the arbiter of when things are \"done\". What a joke.  \n>  \n>Get over yourself.\n\n \n\n* Continuously respond back with more questions  to waste the poster's time.  If they quit, it looks like you win. \n\n&#x200B;\n\n**After some deep thought, I realized that by telling everyone only to be \"cautious\" you are trying to push an agenda to have as many people disregard public policy to shelter in place and wear a mask and keep distant.  You are pushing the agenda, that's it's a hoax.  Elderly people, cancer patients, people with diabetes, should be \"cautious\" about a common cold, they should be sheltering in place if they have the above not just be cautious!  Your stance is either tribal allegiance to the conspiracy/political hoax groups, or you are an entrenched Nazi that wants his way to wipe the undesirables from the human race.  I'm not going to waste more time to educate you as you are a deplorable human being. Your score on these posts are either 0 or negative.  You can't even figure out that the majority opinion here, which is conservative still downvotes ,you into the core of the earth and you think somehow people agree with you?**  You said you're not part of the tribal movement but every statmement you make reinforces you are.  Maybe you need to take a good hard look at a mirror.\n\n&#x200B;\n\n>And btw when did you become the arbiter of when things are \"done\". \n\nNow I'm done and yes, I'm the arbiter of when I'm done.  Please don't talk to me anymore, I will not be responding to you nazi propaganda anymore.", "score": 1, "replies": [{"body": "All I have to say is. Thank you for proving to be 100% of what you accuse others of and thank you for never answering my very basic question. \n\nBecause you can't. \n\nI sincerely appreciate it. \n\nThe rest of the world will let you know when to come out of your bunker. \n\nI would suggest some very easy to read books such as science for dummies as well some books on statistical analysis. \n\nThis will help you in life. \n\nTake care CEO of \"you lose\" and \"I'm done\" it was nice exposing you.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "It's a fact that a person wearing a mask prevents transmission to another person.  Please find me a scientific link, a journal posting, or some other valid non fox news link that says that masks are not effective.  \n\nBoth the world health organization and CDC have shown evidence that mask prevent infection to another person.  If I don't see a link, you need to leave your posts here  r/covidiots", "score": 3, "replies": [{"body": "Are you really quoting WHO?  LOL. You should stop that immediately. That whole organization has proven to be a corrupt chit show. Who is a joke and have flip flopped to China's will since the start of this. I wouldn't trust them to tell me what time it was at this point. \n\nSo let's address the real issue here. You failing to understand my point. \n\nDid I say that it doesn't HELP transmission. \n\nYou see even YOU overstated it and said it PREVENTS. It does NOT prevent. It HELPS in prevention. These little masks people are wearing are not sealed. They do not filter. They help contain droplets. \n\nAlso THE CONTEXT OF THREAD is a worker taking a bit of a sandwhich and then putting the mask on to chew and then removing the mask for another bite. \n\nThat is overkill. \n\nAnd if you think others NEED to follow that procedure or your going to get angry and cause a scene. STAY HOME. you are not ready to be out in the population yet. While you are at home read up on what the mask truly helps with.", "score": -6, "replies": [{"body": "Wow, sounds like you skipped your meds this morning.  You sound so angry.  Sounds like you might want to stay home to and try to re-balance your meds so that you don't sound like a raving lunatic with all your shouting.\n\nOh, and tons of other people think your a loon by the amount of negative votes you got.  Fix your attitude.", "score": 0, "replies": [{"body": "I sound angry? What? I'm not angry at all. That's what you think a raving lunatic sounds like? \n\nSo you have insulted my mental state and called me a raving lunatic... But I'm the one who sounds angry... \n\n\nGot it.", "score": 1, "replies": [{"body": ">Are you really quoting WHO?  LOL. You should stop that   \n>  \n>Did I say that it doesn't HELP transmission.  \n>  \n>You see even YOU overstated it and said it PREVENTS. It does NOT prevent. It HELPS in prevention. These little masks people are   \n>  \n>Also THE CONTEXT OF THREAD is a worker taking a bit of a   \n>  \n>And if you think others NEED to follow that procedure or your going to get angry and cause a scene. STAY HOME. you are not ready to be \n\nHmmm...get a clue and stop shouting at people...caps means you are shouting.\n\nThank you for admitting of your mental instability.  Now run along snowflake and take your meds.", "score": 1, "replies": [{"body": "Lol ... Ya I'm the snowflake here in this situation. \n\nThe caps are for emphasis. I use the caps because so many people read quickly and paint with a broad brush that they miss the point and context. \n\nBut thanks for the ad hominem attacks. We all know why those come out.", "score": 1, "replies": [{"body": "Oh ok Karen.  You want to help with MAGA, stop posting fallacies.", "score": 0, "replies": []}]}]}]}]}, {"body": "Love the down voters. Everything I said was factual. Prove me wrong.\n\nI said masks help transmission. \nWho is corrupt and untrustworthy. I am not the only one with this thought. You can read up on it. \n\nSo you guys all think someone should wear a mask then remove it to chew and then put it back on. \n\nYou guys are acting hyper sensitive. I'd love to know how old most of you are and what your back ground is.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "The local witchdoctor sifted through the chicken entrails and decided it was too soon. Come back in 2 weeks.", "score": 13, "replies": [{"body": "\\*ask again l8r\\*", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "I'm trying to maintain my tsla gains", "score": 3, "replies": []}]}, {"body": "Of course they do.. Elon has a timeline in which certain objectives need to be hit. He also thinks that the country should be open like Sweden and this whole shutdown is over exaggerated, which is accurate. He doesn't like bullshit interfering with these objectives. \n\nGlad he levied moving the Tesla HQ to another state, texas looks nice.", "score": 0, "replies": []}]}, {"body": "This whole thing has been such a mess.", "score": 13, "replies": []}, {"body": "Seems to me it’s high time to follow the incentives of the Alameda County interim decision maker.", "score": 20, "replies": [{"body": "Yeah, who’s lining her pockets?", "score": 14, "replies": []}]}, {"body": "The Facotry. 🙃", "score": 17, "replies": [{"body": "All I see is Tacofry", "score": 6, "replies": [{"body": "If Tesla moves to Texas, it’s breakfast tacos all day, every day!\n\nSource: I live in Texas, and this is our sustenance.", "score": 5, "replies": [{"body": "It's not an if. It makes a lot of sense for Tesla to move. SpaceX, too. Does not mean 100% of Tesla has to go, certainly not all at once.\n\nI like taco shells made out of cheddar cheese, dusted with parmesan. So good.", "score": 3, "replies": []}]}]}, {"body": "Such facotry", "score": 1, "replies": []}, {"body": "Autocorrect did not do the job. 😂", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "True.", "score": 3, "replies": []}, {"body": "Autocorrect insufficiently magical.", "score": 1, "replies": []}]}, {"body": "That’s the last 1-2 programmers from the Apple autocrooorrrect team moving to Tesla Texas. Crap how are we gnoing to type!?", "score": 2, "replies": [{"body": "Moving to Texas causes a loss of intellect in perfectly healthy adults.", "score": 1, "replies": []}]}]}]}, {"body": "Gotta agree with the report, this is not a title that objectively sums up the contents of your link, it's one that offers an interpretation of it. Personal preference would have been \"Statement from Fremont Mayor Lily Mei on Shelter-In-Place, Tesla\".\n\nI'm not going to remove this as there's already a significant number of comments, but please keep this in mind for the future.", "score": 1, "replies": []}, {"body": "Next is the county officials. Wonderful!", "score": 4, "replies": []}, {"body": "Can the factory also reopen?", "score": 6, "replies": [{"body": "Nope, only the facotry", "score": 28, "replies": [{"body": "That's the part that only makes tacos correct?  Well at least, the vagrant will be well fed.", "score": 3, "replies": []}]}, {"body": "We should hear more update tomorrow or early of next week.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "No, they Mayor said Tesla and Alameda should stop acting like that and sort it out.", "score": 3, "replies": []}]}, {"body": "And rightly so. Anybody with a brain supports Elon in this. Not a single death in Shanghai which has been operating for months now. I think Alameda just needs to follow tesla's guidance on how to do this and stop letting some intern destroy their economy.", "score": 2, "replies": []}, {"body": "Alameda county has an uncanny ability to repel desirable franchises. First the Golden State Warriors, then the Oakland Raiders and now possibly a game changing Tech/Auto company", "score": 2, "replies": []}, {"body": " Local news reported health officials wanted to help open Fremont on May 18th,  and don't understand why Elon Musk wanted earlier opening. https://youtu.be/-kcWxAmTrIg", "score": 1, "replies": []}, {"body": "And the plot thickens...", "score": 1, "replies": [{"body": "The thot plickens...", "score": 6, "replies": []}]}, {"body": "Buckle up! It’s going to be a bumpy one!", "score": 1, "replies": []}, {"body": "1+1=3. It’s dDtA and sSiEnCe Bitches!", "score": 1, "replies": []}]}
{"title": "WSB forced the FEDs hand", "selftext": "Look at all the gain loss porn.  This whole sub was making out like bandits during the crash. Accounts were going from 700 to 30k.  Institutions were bleeding cash on bad bets.  They couldn't pay out 1MM autists 10,000% returns in 1-2 months.  They would go bust. The FED had to step in to protect boomer retirement accounts.  Convince me otherwise.", "id": "gg50r2", "created_utc": 1588983450.0, "score": 351, "upvote_ratio": 0.94, "num_comments": 87, "comments": [{"body": "you're on to something...", "score": 159, "replies": []}, {"body": "Fuck Boomers, we did all this shit to protect them and then those ungrateful fucks went out and tried to force our asses back to work cause we were stealing from their fixed income accounts.", "score": 209, "replies": [{"body": "100% with this guy. ffs how about giving some to the next generation. A bunch of assshole", "score": 80, "replies": [{"body": "Boomers never cared for anyone other than themselves as they think they deserve it all for \"building\" the country.", "score": 65, "replies": [{"body": "They didn’t build shit, the greatest generation, future tax payers, and foreigners made all their wealth, then they pulled up the ladder behind them", "score": 57, "replies": [{"body": "[deleted]", "score": 65, "replies": [{"body": "I think the people who have it the worst now are the generation of zoomer college students who will be denied in-person courses and a \"real\" college lifestyle to the virus but still be saddled with insane and constantly rising student loan debt all the same.  Online courses are bullshit and you don't meet friends or business network contacts through them.  Anyone in college right now is getting ripped off by the short stick they've been dealt by this.", "score": 45, "replies": [{"body": "Puts on zoomers. Idk if I count as a zoomer but I have one year of uni left, and the people a year ahead of me that are trying to graduate into the quarentined economy to find jobs are kinda getting fucked.", "score": 10, "replies": [{"body": "Yes you count, and yes that’s your future too.  Good luck buddy, look into internships for a few years.  That’s what I did when I graduated in December 08.", "score": 10, "replies": []}, {"body": "I’m 34 and my age group faced a similar situation graduating college.\n\nWe were graduating and entering the workforce during the financial crisis recession.  Shit sucked.", "score": 8, "replies": []}, {"body": "Zoomers are generally under 25. That’s the absolute oldest ones. If you’re around 22 then you’re a zoomie zoom.", "score": 3, "replies": []}]}, {"body": "You want to see a retard strength rally, cancel student loan debt now that every dumb ass is hooked on robinhood with nothing better to do.", "score": 12, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Whenever you’re forced to make payments to avoid harm to your credit I’d just pay the absolute minimum because it’s pretty likely one day perhaps in 5, 10, 20 years, who knows, there will be student debt forgiveness.", "score": 4, "replies": [{"body": "Highly doubt forgiveness will ever happen. Over time people pay off loans. If you've paid off a loan you don't want to see other people get off Scott free without you getting compensated for your previously paid loan. This is why it still hasn't passed. People who paid their way or took loans for college and have paid off or mostly paid them off won't accept forgiveness for people who didn't pay it off yet. \n\nHumans are selfish and spiteful. Even the people who swear now they'd do it will disagree once they leave college and start actually putting dents in their loan. The only people who will still want it are the bad degree students who realize they overpaid for a degree in useless bullshit. Student loan forgiveness is a myth.", "score": 9, "replies": [{"body": "It hasn’t happened because why the fuck would we cancel their debt they willingly took on when the country is 25T in debt and we could use that money to actually save lives with healthcare. Student debt could be restructured, but forgiveness is a retard selfish pipe dream", "score": 2, "replies": [{"body": "I completely agree. It's a choice people took so they need to take responsibility. What we should do is remove student loans from government involvement. Prices have been hiking higher than usual on a per year basis since that change was made. The government just hands out loans to students and prices rise because there's no consideration for cost.", "score": 2, "replies": []}]}, {"body": "Not to mention the people who forewent college because we didn't want to take on that insane debt.", "score": 2, "replies": []}, {"body": "I mean I’ve paid off loans too dude. Probably older than you. It’s gonna happen. I don’t really want it either. But it will 100% happen in time. As more and more millennials come into powerful positions it will 100% happen. It’s best to cope now instead of butthurtedly downvoting reddit comments telling the truth you don’t wanna hear.", "score": 1, "replies": []}]}]}]}]}, {"body": "The ones that aren’t retarded will realize online class is online class, and will do cc until the virus is over. Already seeing people post and advise this, would be awesome to see the higher education system here bleed out with low attendance.", "score": 1, "replies": [{"body": "Also, what percentage of a college's profits depend on charging expensive on-site housing, meal plans and closed-circuit book sales on campus?  Online models are far less profitable for them, even if they run at a fraction of the cost.  Debts will eat them up if those profits start to dwindle.  Nobody's parents are buying their kids those $1,600/mo shared dorm rooms in a pandemic/economic recession.", "score": 1, "replies": [{"body": "Big colleges need that Football money, I know that at least.\n\nAnd with no slaves means no football. I mean NCAA athletes.", "score": 2, "replies": []}]}]}, {"body": "We need more schools like WGU, it's an online-only school (I think)", "score": 1, "replies": []}]}, {"body": "Don't forget that before even fighting WW2, that's the generation that grew up in the Great Depression. They didn't just fight and build America to its greatest era, they lived through what was probably its worst.", "score": 3, "replies": []}, {"body": "I blame Corona on boomers... had they taking it fucking seriously at the beginning instead of dumping their positions before the shit hit the fan we wouldn’t be in this mess.", "score": 3, "replies": []}, {"body": "Let alone climate change. Boomers also went all Willy nilly with this social justice and super hardcore left shit. Before that things were pretty moderate, besides the occasional fascist here and there", "score": 1, "replies": []}]}, {"body": "They built those factories in China and Mexico you ungrateful shit.", "score": 1, "replies": []}]}]}]}]}, {"body": "What if ticker prices are climbing on low volume to take your put premiums bro", "score": 25, "replies": []}, {"body": "[deleted]", "score": 118, "replies": [{"body": "So when can we expect the rest of the book?", "score": 22, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "Seriously though, you better be writing something with talent like that. Even if it’s just self-publishing on Amazon.", "score": 16, "replies": []}, {"body": "Jesus Mike, do something with your life!", "score": 9, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}, {"body": "10/10", "score": 27, "replies": []}, {"body": "Love this book, and I hate reading.  Finish the story, when does John get cucked by Mike???", "score": 3, "replies": []}, {"body": "I was sort of waiting for Mike to spit in the bastards face after his rant. I would have loved that.", "score": 2, "replies": []}, {"body": "This fails to mention the capital gained from technological innovations. You have the world's knowledge in your pocket. I know more about the markets than 99% of the world did just 20 years ago due to the advent of information technology that's available in a device that fits in my pocket. The boomers can have their useless winnebegos... I have unlimited knowledge that has infinite value.\n\nMoney =/ all capital.  Money is only one form of capital. You have to consider ALL forms of capital and without any doubt, we have more capital available to us than ever before. If you are losing today, it's because you didn't take advantage of the opportunities that our generation has that no generation prior to us had available.", "score": 0, "replies": [{"body": "[deleted]", "score": 55, "replies": [{"body": "Our indentured Indian servants are paid 60 dollars an hr and billed to the client at 90 dollars an hr. Its not the bill rate why they are valuable, its that they wont leave in the middle of a project.", "score": 9, "replies": [{"body": "Read what he said you tard.  Why won’t they leave??? Because they fucking depend on that visa, not because they’re inherently better workers.", "score": 14, "replies": [{"body": "I never said they are better workers. The stability is better for the company. And absolutely they are getting explouted by their companies. My point is they are not being hired for lower wages. In fact most of the time with the extra visa costs they cost more. Companies are willing to pay more as they get more. Also less entitled and more initiative - you have to be a risk taker to leave your country and move to a new one", "score": 0, "replies": []}, {"body": "I'd say culture is a big part too. In the USA we don't teach work ethics as hard as poorer countries. I see it time and again in my field where young people enter and expect so much, but when it doesn't fall into their lap they leave for a new company and repeat. Meanwhile an immigrant joins our team and they last at least 5 years. They know the value of having a strong work ethic. They needed one to get into our country after all. They get good raises, get promoted, and so on. Younger people from around here complain about not being promoted after a year and then submit their two weeks, or just quit on the spot.\n\nIt's a huge culture difference when it comes to discipline and working.", "score": -3, "replies": [{"body": "You come from a place of desperation, we come from a place of opportunity.  Most millennials would rather work in a healthy workplace than make more money.  A lot of the career changes you see from younger people is the search for a healthy workplace.  Many of us will not sit and suffer years of abuse and degradation like someone in your position would.  \n\nHopefully you can understand this and understand how children you raise here will develop a similar mindset.  Imagine being the child of an immigrant and watching their parent work their ass off only to be continuously disrespected and abused by the company who they worked for for decades?\n\nThere are a LOT of people in the USA that seem to think we owe our lives to work and our bosses.", "score": 2, "replies": [{"body": "I work at a company that gives 4 weeks of vacation a year starting and no delay on benefits kicking in. Full healthcare coverage at a good price. This is a better start than 99.9℅ of workplaces in the USA. In this field in particular its unheard of. We also don't do mandatory overtime, another thing nearly unheard of. There is essentially no demanding work and bosses are hands off.\n\nI can't imagine a healthier workplace to be in, especially if you choose to enter manufacturing, a notoriously unhealthy field full of body pain, overtime, and lots of shitty bosses. Of which this workplace has none.\n\nYou're talking as if I'm a boomer and not part of your gen, I get that a lot on Reddit, but being under 30 and an immigrant myself (and child of immigrants) I just call it like I see it: millennials and gen z in the USA have a lot of lazy manchildren who never got taught that reward requires effort. They expect success after they graduate college and reality doesn't set in on them until they fuck up somewhere and run into a wall. Even some of my close friends were like this.", "score": 1, "replies": [{"body": "I call em like I see em.  There’s a lot of filthy ignorant morons who live in the third world that shit in the street and never wash their fucking hands.  Are these the adults that you’re trying to compare us to?", "score": 1, "replies": []}]}]}, {"body": "The average length of time in a role for a software dev in silicon valley is something like 8 months.\n\n&#x200B;\n\nThen they jump ship.\n\n&#x200B;\n\nI have seen resumes of people who think they are hot shit because they were took a new job every 6 months or less.\n\n&#x200B;\n\nI can guarantee these people will be the first to complain that they are let go before the guy who has been working at the same company for 18 months.\n\nThere is A LOT of entitlement in the US right now. I almost hoped that the government wouldn't step in and bail everyone out during this pandemic. We probably would have learned things like don't depend on the government for your well being, don't just listen to politicians who make you lock down and put millions out of jobs; they work for you, not you for them, keep 3 months emergency savings on hand instead of blowing it on a new iPhone the moment it comes out so you can flex on your friends.\n\n&#x200B;\n\nLife is fukking difficult and just because you can hide from your problems on social media and in video games doesn't mean that you should. It own't make your problems go away.\n\n&#x200B;\n\nWe lost the mentality of the greatest generation that helped make America great. Seems like most millenials (myself included sometimes) and younger are whiny little bitches who want everything now without having to work for it.\n\n&#x200B;\n\nBut this doesn't excuse the boomers. They had it all for decades: low tax rates, business friendly regulations, sensible immigration policy, and long retirements because they won't retire at 65 and die at 70 like their parents.\n\n&#x200B;\n\nAnd instead of doing the responsible thing, takign care of themselves and working until 75 ( which I suspect their parents who knew about hardship for long term gains would have done), they didn't have enough kids to replace them in the workforce, retired at 65, voted for increased entitlement programs that now have to be covered by the relatively small number of subsequent generations, and decided to take the \"i earned ti I burned it\" mentality while bitching that medicare has to make cuts every year because boomers are irresponsible fucks with their money.\n\n&#x200B;\n\nThe entitlement mentality began with the boomers. The pandemic might have been the cure, but, to save the boomer vote, the government stepped in to fuck everyone else again.", "score": 1, "replies": []}, {"body": "Blah blah blah, more boomer nonsense. People are finally standing up for themselves, is what it sounds like you mean, instead of having to desperately cling to whatever they can get.", "score": 0, "replies": [{"body": "Im a millennial but I can tell you have yet to work a real job, own anything of value, or make anything of your life yet. You'll change your tune once you grow up.\n\nOh, and I'm also an immigrant from a third world country. So I think I have more authority than you on this topic. Spent my entire childhood not here in the USA.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "> Everyone applying will not have had experience chasing down vendors. \n\nThe key is to show up in their offices with boxes of chocolates and then tell them you can't leave until they transfer the money they owe you.", "score": 1, "replies": []}]}, {"body": "Because that dude with the phone can move to Cali make 15$ an hour working at McDonald’s and hire the same Indian to code his apps as a side hustle and then make 2.7 mil in six months when his Karen is a slur app gets number 3 on iTunes. \n\nYou’re not wrong your just assuming poor leverage of the info. The Indian is fucked because he never had the Capitol to begin with that the millennial living in his moms basement had on those fat suburban internet pipes. Globalisation isn’t an equalisation of info. It’s an equalisation of access to free labor. \n\nUntil it isn’t. Also none of this changes the fact that boomers are selfish fuck heads. So were robber barrons. And provincial governors. And lords and barrons. And bishops and knights. And ceases and barbarians. Vikings and kings. \n\nTurns out people who grow up on easy street tend to be assholes. News at 11. Stay woke.", "score": 0, "replies": [{"body": "The dude working at McDonalds isn't about to start his own company and sponsor visas for foreigners to code his app. He doesn't have the connections nor the initial capital to do so. Also, why would the Indian dude choose to work for McDonalds dude rather than a bigger tech company? Is the Mcdonalds dude about to start undercutting the tech company. I don't think this is realistic at all.", "score": 16, "replies": []}, {"body": "The dude working McDonald's for $15 an hour lives in the Bay Area. He'd have to live out of a tent to make headway given what rent is there.", "score": 10, "replies": [{"body": "Ya, I love it.  \"Move to Cali, get dream 15$/hr job at Micky D's, invest in app development via Fiverr, leverage future earnings on a sick 2 bedroom, rent it out via Airbnb\".  Infinite money strategy, what a bunch of fucking idiots, anyone who isn't following through on this.", "score": 6, "replies": [{"body": "Like we just saw all the AirBNB guys go under and on the hook for massive leases.", "score": 2, "replies": []}]}]}, {"body": "This is so delusional it makes my head spin.\n\nThat happens for what, 1 in literally every fucking employee at McDonalds? Get a grip.", "score": 7, "replies": []}]}]}, {"body": "Bro time is more important and U never know how much U have left thats why i am chronically broke and Work as a Kitesurfinstrucrtor chill on the beach all day and Spende my Money in Bass guitars, booz and ganja", "score": 3, "replies": []}, {"body": "You do not have unlimited knowledge, you have unlimited information. Not the same.", "score": 5, "replies": []}]}, {"body": "🥇", "score": 1, "replies": []}, {"body": "Good writing, although if I ever strike it rich I won’t be handing much to my children. \n\nInheritance breeds shitty people, look at Trump’s kids. I’d cover as much education as they’d desire and set up a small trust for their children’s education . But I’d either give away most of my wealth to charity or blow it on drugs and gambling during my retirement.", "score": -3, "replies": [{"body": "You’re the fucking shit bag this was targeted at.  Go hang yourself", "score": -1, "replies": [{"body": "For not leaving a huge inheritance for their kids? Now who's entitled?", "score": 3, "replies": [{"body": "Its ironic when people call Boomers entitled yet feel they are entitled to a massive inheritance windfall. \n\nThat mentality is no different from Boomer entitlement...", "score": 1, "replies": []}]}, {"body": "Someone’s entitled as fuck :)", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -2, "replies": []}]}, {"body": "FED are Boomers. \\*BOOM\\* (mimics finger pistol against head, brain blown out meme).", "score": 45, "replies": []}, {"body": "Honestly I don’t think it was entirely the fed. That started part of it but there’s never been this much FOMO in the damn market. When Schwab has 300k new accounts in March and everyone I know is asking about what stocks to buy, it’s driving an insane rally. Most of the big players are just sitting around watching this mess happen.\n\nI also think the bond markets collapsing made a lot of hedge funds pile into equities. When billions flood out of fixed income into equities, it definitely moves the market.\n\nIf bond markets stabilize and look safe again, money could leave equities and dump back into bonds. I also think Q2 earnings and any resurgence of the virus in the Fall could rattle the cages of FOMO investors. \n\nAfter that, the only real downside I see is early 2021. If Christmas sales look like shit, unemployment is high, and we’ve have several quarters of fucked up fundamentals, then we might finally see some capitulation and a new bottom.\n\nBut if hot weather and Vitamin D from Summer runs this virus out of town plus successful treatments, I expect new market highs and the big players to jump back in to pump stocks.", "score": 27, "replies": [{"body": "It’s been over 100 the last 2-3 weeks in phoenix and we had a record number of cases and deaths today. Might take a few more weeks to see if warm weather and sun help but quickly starting to lose hope in that theory.", "score": 14, "replies": []}, {"body": "this is 100% the fed", "score": 9, "replies": []}, {"body": "Word is that the virus will come back strong every winter like the Flu", "score": 4, "replies": [{"body": "Word is no one knows that because it hasn’t happened.  The flu comes back because it has a high mutation rate due to its method of viral genetic material replication.  It’s too early to know if COVID will behave similarly.", "score": 11, "replies": [{"body": "Worst is Covid has already mutated many times", "score": 3, "replies": [{"body": "to be more and more similar to the common cold or rsv.... look we all know a lot about the virus the reality is at this point the world failed to contain it.... as of I'd say feburary... this baby is just going to get less and less deadly", "score": 1, "replies": [{"body": "Right, it's not in a virus's interest to be deadly. Its only pressure is to spread. Being so deadly that people quarantine is actually bad for it.", "score": 1, "replies": []}]}]}]}]}, {"body": "QE is meant to suppress bonds. Therefore as long as QE exist, bonds are close to worthless.", "score": 1, "replies": []}]}, {"body": "lol even a million retards hitting 10 baggers is chump change.  the level of delusion to think WSB factors into the macroeconomy is mega cope.  but whatever makes you feel better bout ya spy puts", "score": 17, "replies": [{"body": "Listen I sell calls.  It's almost the same thing except more risk and better prices", "score": 8, "replies": [{"body": "You’re doing it wrong. You’re suppose to sell naked calls to buy puts. Infinite leverage = infinite $", "score": 2, "replies": []}]}]}, {"body": "I don't get why these 700 -> 30k -> 0 people didn't just take the profit even at 10k...", "score": 9, "replies": [{"body": "Sir this is wsb.  You're looking for r/SecurityAnalysis", "score": 16, "replies": []}, {"body": "Because if you literally cannot lose, why would you stop buying bigger and bigger puts? (Spoken from painful experience)", "score": 3, "replies": []}]}, {"body": "I fully support this theory!", "score": 3, "replies": []}, {"body": "Boomer retirement accounts are in bonds so they're fucked. Which means you're fucked because boomers aren't going to be footing the bill themselves.", "score": 3, "replies": []}, {"body": "Why are my posts getting removed on wsb?", "score": 4, "replies": [{"body": "Because mm's have control here", "score": 5, "replies": []}]}, {"body": "So you are telling me that instead of crushing Lehman Brothers, we were crushing Robinhood, and so the FED had to step in. Makes sense.", "score": 2, "replies": []}, {"body": "they did it themselves, thats why trading is so easy an autist can do it.", "score": 2, "replies": []}, {"body": "This is what I’ve been thinking for a minute now too. Also made out like a bandit shorting BA originally", "score": 1, "replies": []}, {"body": "Sir you can buy OTM calls to convince yourself otherwise", "score": 1, "replies": []}, {"body": "The market has become so retarded I actually believe this now", "score": 1, "replies": []}, {"body": "hating on boomers is a divide and conquer strategy used to control the minds of retards  \n\n\nI am not a boomer but I see this bullshit so often I should just write a script to post that every time some moron thinks old people suck because they are old, I mean baby boomers invented the expression don't trust anyone over 30, more of the same retarded ageism bullshit", "score": 1, "replies": []}, {"body": "Interesting.. I wonder if my absolutely reckless amount of tanker calls are being suppressed along with the rest of the gangs 🤔🤔", "score": 1, "replies": [{"body": "Yes the financial markets move on r/wallstreetbets", "score": 1, "replies": []}]}]}
