{"title": "Hey I have 10k to invest for my son, what stocks should I look at??", "selftext": "I like amazon, Microsoft, nvidia, Tesla, pton, Macy’s, Wynn, Penn, DraftKings.  Any other thoughts", "id": "gpxsf6", "created_utc": 1590355681.0, "score": 3, "upvote_ratio": 0.57, "num_comments": 79, "comments": [{"body": "I wouldnt touch macys with a 10 ft pole", "score": 40, "replies": [{"body": "10 feets is not enough, 20 minimum", "score": 13, "replies": [{"body": "With a hazmat suit.", "score": 6, "replies": []}]}, {"body": "came here to say this", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Literally every stock shot up. This person is investing 10k for his/her son, holding prob for long term. Lets see how Macy's is doing after you take step 1, let alone for the next couple of years lol", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I didnt have to. Your name gave it away.\n\nSincerely,\n\nA fellow medical student", "score": 3, "replies": []}, {"body": "Btw, good luck on step 1. Lmk if you need any advice", "score": 3, "replies": []}]}]}]}]}, {"body": "If you’re trying to grow/preserve wealth for your son you’re much better off putting it into an index-tracking ETF like SPY or QQQ rather than individual stock picking.", "score": 33, "replies": []}, {"body": "Please - I don’t mean to sound rude but your picks are as predictable as it gets. Ask any typical ‘tard on here they’ll tell you MSFT, AAPL, TSLA, V, AMD, Nvidia bla bla YAWWWWN. \n\nI assume given the level you’ve pitched your question at you don’t know loads about stock selection; stick it in an S&P 500 fund. That’s it. Don’t overthink it. \n\nIf you *have* to pick stocks - put it in stock that aren’t in the news everyday because of price fluctuation. \nWalmart, Canadian national Railway, WM, Enbridge - very sound companies with satisfactory rates of return with decent balance sheets. I can almost guarantee you better returns with boring companies than “hot stocks” like TSLA & PTON", "score": 66, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "Don’t say anything negative about MSFT. That’s a rule on this sub.", "score": 8, "replies": []}]}, {"body": "PTON is going to be the amazon of fitness. If they win the patent lawsuit against Nordic Track, this will be a 40 billion dollar company within 5 years.\n\nThat’s IF Disney or Apple doesn’t buy them out before then.", "score": 1, "replies": [{"body": "With respect, you’re kind of making my point for me", "score": 2, "replies": []}]}]}, {"body": "Looks good. Stay away from Macy’s. Only brick and mortar retail with a future is HD COST DG TGT LOW WMT KR", "score": 14, "replies": [{"body": "And BJ", "score": 2, "replies": []}, {"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Don't buy Tesla now", "score": 5, "replies": [{"body": "Why do you say not now?", "score": -1, "replies": [{"body": "It's overvalued af. Also, car sales in general are gonna be down for the next year cuz of covid", "score": 3, "replies": []}]}]}, {"body": "If you’re interested in tech, VGT is a good ETF", "score": 5, "replies": []}, {"body": "I'm just gonna keep shilling RTX and LHS", "score": 3, "replies": [{"body": "What’s LHS? You mean LHX?", "score": 1, "replies": []}]}, {"body": "Toss some in SPY, and the rest in blue chips like Microsoft (MSFT) and Apple (AAPL)", "score": 4, "replies": []}, {"body": "Dollar cost average it into SPY/VOO", "score": 3, "replies": []}, {"body": "PTON’s gonna tank once the beer virus is behind us ..", "score": 7, "replies": [{"body": "Hey man let us know your future plays so we can inverse them", "score": 1, "replies": []}, {"body": "It's cheaper than spin classes, has a clothing brand and a ton of constantly updating online courses from running to yoga, spin and meditation.", "score": -1, "replies": [{"body": "Sounds like a bow flex with an app", "score": 7, "replies": [{"body": "It is", "score": 2, "replies": [{"body": "Why would I want to invest in fad workout equipment just because it has an app", "score": 3, "replies": [{"body": "Apparently there bikes are on backorder for a while and you can also just subscribe to the app without the equipment. Idk what the numbers are of people who do that but I've read plenty of people saying you could do that on fitness blogs and stuff.", "score": 2, "replies": [{"body": "data. You get data from subscriptions. \n\nBlogs are cumbersome.", "score": 1, "replies": []}]}, {"body": "They have proprietary tech. Look at booming spin businesses like otf or soul cycle. Women are going crazy over these classes and their main demo is F 16-30. These girls are GOING to have the $ to buy bikes soon.", "score": 1, "replies": [{"body": "This. I’m a chick. I own the bike and $PTON, all my friends are buying the bike. It’s a trend but also a decent product with a cult following. Proactive leadership within the company.", "score": 1, "replies": [{"body": "What made you buy the bike instead of going to soul cycle or otf? Was the purchase motivated primarily by the lockdowns?", "score": 1, "replies": [{"body": "Kids at home, used to go to spin class but impossible now. Love it.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "My top picks: MSFT, FB, V, MA, SYY, KO, and JNJ.", "score": 4, "replies": [{"body": "Sysco has been real good to me. Bought in at $38, debating on selling it Tuesday. But then again places are opening up so it’s probably gonna go up a bit here soon.", "score": 1, "replies": []}]}, {"body": "seems a little bluechip light. but up to you", "score": 2, "replies": []}, {"body": "ARKK", "score": 2, "replies": []}, {"body": "Are 529s even worth it?? Id go index.. 5k in a high div one and 5k on a tech one.", "score": 2, "replies": []}, {"body": "B to the t to the c", "score": 1, "replies": []}, {"body": "XYL", "score": 1, "replies": []}, {"body": "Good list. Add some social media and shipping companies.", "score": 1, "replies": []}, {"body": "Last week it rose almost 35%. I made really good money on this one.", "score": 1, "replies": [{"body": "Which one?", "score": 1, "replies": []}]}, {"body": "Lightspeed POS", "score": 1, "replies": [{"body": "What is there name on Robinhood?", "score": 0, "replies": []}]}, {"body": "My kid's college fund is in MSFT, DXCM, V, and DIS", "score": 1, "replies": []}, {"body": "My favorite posts are \"Invest my money for me\" posts where they just ask -what- to invest in. Not -why- or -how- you decided or how to learn to make good choices, just \"what?\"/\"tell me what to invest in\"", "score": 1, "replies": [{"body": "Just ideas honestly and maybe a stock I haven’t been looking at", "score": 1, "replies": []}]}, {"body": "I have been looking at Wynn or mgm, Las Vegas is set to reopen the first week of June.", "score": 1, "replies": [{"body": "Yeah, then don't forget to dump. Hospitality is going to be in the crap can with airlines and cruises for awhile. You won't see good returns as consumer behavior changes.", "score": 1, "replies": []}]}, {"body": "Celh", "score": 1, "replies": []}, {"body": "If it's really for your son: low risk, DRIP. Some of your suggestions are more like bottom-feeding lottery picks. Your son has plenty of time. Use that.", "score": 1, "replies": []}, {"body": "voo and vxus and other long term etf's \n\nsee which ones weathered 08 the best and follow them", "score": 1, "replies": []}, {"body": "Fuck no on the Macy’s.", "score": 1, "replies": []}, {"body": "I see you like Wynn DKNG and penn. so also check out ERI and mgm. Also maybe some stocks to do with 5G.", "score": 1, "replies": []}, {"body": "VOO, Sphd, spyd, germ, jnj, T, O, mmm", "score": 1, "replies": [{"body": "Honestly I have money in voo and haven’t made anything only lost.  Same for the others. The dividends are nice tho.", "score": 1, "replies": [{"body": "How long? It's long term. Its up 90 bucks over the last 5 years.", "score": 1, "replies": [{"body": "A month so far. Honestly I am doing better in other etfs like arkk", "score": 1, "replies": [{"body": "A month.\n\nThey're not day trading penny stocks dude.", "score": 1, "replies": [{"body": "No I get it but I see more growth in arkk", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Germ is the only thing making me money today", "score": 1, "replies": [{"body": "Idex and ktov", "score": 1, "replies": [{"body": "The ship sailed on idex", "score": 1, "replies": [{"body": "Not really it’s 3.23 bought at the dip at 2.50 now holding 1600 at 1.70", "score": 1, "replies": []}]}]}]}, {"body": "Lightspeed POS", "score": 1, "replies": [{"body": "I like this one", "score": 1, "replies": []}]}, {"body": "So what about a split with amazon/Disney/Walmart/spy/vanguard????", "score": 1, "replies": [{"body": "You are going to lost a lot of money playing a game you shouldn't be playing.", "score": 2, "replies": []}]}, {"body": "Should I go ETF or Index ???", "score": 1, "replies": [{"body": "Index - just put 50% in VOO and 50% in QQQ.", "score": 2, "replies": []}]}, {"body": "Fuck what everyone is saying here. r/wallstreetbets recommends you invest in oil tankers like $NAT", "score": 1, "replies": []}, {"body": "Wynn", "score": 0, "replies": [{"body": "Right, gamble kids money on casinos.", "score": 2, "replies": [{"body": "Technically my money hahaha, I want to give him a portfolio something I wish someone did for me", "score": 1, "replies": []}]}]}]}
