{"title": "Will MSFT be the best performing tech stock over the next 10 years?", "selftext": "Will MSFT be the best performing tech stock over the next 10 years?\n\n\\-coronavirus proof\n\n\\-teams, xbox and cloud all growing due to coronavirus\n\n\\-office and windows still solid\n\n\\-artificial intelligence and virtual reality divisions growing\n\n\\-best management in the world\n\n\\-net 70 billion in cash", "id": "gekoy4", "created_utc": 1588774160.0, "score": 34, "upvote_ratio": 0.7, "num_comments": 84, "comments": [{"body": "This is a silly question, but there's almost no way in hell they are the \"best performing\" tech stock over the next decade. They're just too large. There will invariably be some newcomer that grows 2x, 3x, 4x or more over the next ten years. Do you really believe a company with a 1.379T cap can grow at that sort of pace?\n\nThat doesn't mean they're not a good investment.", "score": 112, "replies": [{"body": "I totally agree with you! \n\nIf you think about it, if they keep investing in many innovative startups, all the startups they can invest in is still tiny compared to their market cap. They definitely will have a harder time being the next best performing stock unless they can acquire or create something huge or do accounting tricks", "score": 2, "replies": [{"body": "I'd imagine they're goal will never be to have the best performing market price over X time frame. It's just not reasonable for a company that's so large.", "score": 2, "replies": []}]}, {"body": "The next decade will be defined by artificial intelligence, virtual reality, automation and cloud. MSFT is the leader in all those things.", "score": -32, "replies": [{"body": "MSFT is not the leader in all of those things, I don't know where you're getting that.\n\nGoogle has a better and more popular ML (don't use the term AI, few people are working in true AI) cloud offerring. VR is a stretch, we'll see where it goes, but that market is up for grabs. \"automation\" is a nebulous term, and AWS is _by far_ the leading cloud provider.\n\nI'm in my 16th year as a software engineer in biotech, work in computer vision, have used Azure and AWS extensively. I have no idea why you believe MSFT is the leader in any of those areas.\n\nIt's all rather besides the point anyway: how are you defining \"best performing\" exactly? Everyone else will look at return over time. If you think a 1.3T cap company is going to outperform all other tech companies over the next 10 years based on that definition then I don't know what to tell you. You're predicting MSFT will be a 4T+ company in a decade.", "score": 28, "replies": [{"body": "With your background.. any other outstanding stocks you'd recommend?", "score": 0, "replies": []}, {"body": "Azure is miles better than AWS, everyone is moving to Azure.", "score": -12, "replies": [{"body": "Per your deep knowledge on the subject? Please explain to me, in detail, in what ways it is \"miles better\".", "score": 5, "replies": [{"body": "better integration with office", "score": -14, "replies": [{"body": "ahahahahahahaha\n\nYou have jumped the shark my friend.", "score": 10, "replies": [{"body": "Bruh what do you mean, you can process data in excel. Even 500Gb+ files.^/s", "score": 2, "replies": [{"body": "Ha, yeah, but I have to say; I've seen some engineers (mechanical, optical, and EE) do some _crazy_ shit in excel.  Not necessarily a good thing, but it was impressive.", "score": 3, "replies": []}]}, {"body": "Do you own any MSFT shares?", "score": 1, "replies": [{"body": "Yes, I like what MS has been doing over the last decade quite a bit, as a dev and as a consumer. \n\nYou're just way too far out there and you obviously don't understand the things you seem to have such strong opinions about. Saying they're the leader in areas they are objectively not leading, saying Azure wins because it has \"better office integration\", saying they'll be a 6-7T dollar company in a decade. It just shows a massive amount of ignorance on your part.\n\nI'm not trying to put you down, but you need to understand where your knowledge is lacking.", "score": 10, "replies": [{"body": "Well aren't Windows and Azure better integrated than Windows and AWS? Surely it makes more sense to go with a cloud provider that uses the same operating system you use. There is no ignorance, not everyone is a cloud software developer.", "score": 0, "replies": [{"body": "> Well aren't Windows and Azure better integrated than Windows and AWS?\n\nMS's real value proposition right now in their tech offerrings is their move _away_ from betting the farm on Windows. Their major moves of late have been open source initiatives and providing support for multiple platforms. For example, look an net core, their acquisition of GitHub, more emphasis on linux support in Azure.\n\nYes, they offer a lot of integrations with their other offerrings, and that is attractive in the enterprise space. The reason they're leaning on other platforms and moving away from desktop windows is because they know that business will decrease over time.\n\n>Surely it makes more sense to go with a cloud provider that uses the same operating system you use.\n\nIt's more complicated than that. For example, my company internally runs on Windows. We don't have marketing folks booting up Debian or anything. Everyone presents in PPT and passes around documents created in Word. That has nothing to do with the software I write to power the back end of the business.\n\nI write web services in .net core that run in docker containers on a linux host. I write bash scripts to drive pipeline jobs running on Batch. I maintain an image server which runs on linux. Given the choice, I will _always_ chose a linux host because it's cheaper, it's easier to administrate, it has a smaller footprint, and the open source comminuty views Windows as a second class citizen.\n\nThe web had largely moved away from Windows. MS say this after Ballmer left and made a decision to not be left behind clinging to Windows license revenue. The pivoted and it was absolutely the right call.\n\nAzure is fine, and they're gaining market share, but they're nowhere near AWS currently. I have spent years using both and I prefer AWS, but Azure was fine. Using Windows or not had nothing to do with my decision to use either, and that is an opinion shared by most devs.\n\n>There is no ignorance, not everyone is a cloud software developer.\n\nI'm not using the word \"ignorant\" in the pejorative. You _are_ ignorant of the technical details and moevements in cloud development. That's ok, doesn't mean you're dumb, I'm ignorant on all sorts of subjects. I don't pretend to understand those subjects though.", "score": 7, "replies": []}, {"body": "Oh God damn it; [it's you](https://www.reddit.com/r/stocks/comments/gconrn/buffett_is_clueless_and_is_losing_it_now/fpdcsue/)", "score": 4, "replies": [{"body": "His post history is a trip, I assure you.", "score": 2, "replies": []}, {"body": "Oh god that whole thread. What a total asshat", "score": 2, "replies": []}]}, {"body": "Did you actually think the cloud was launching a GUI?", "score": 1, "replies": []}]}]}]}]}, {"body": "Why ask for advice and then get defensive when people don‘t tell you what you want to hear?", "score": 1, "replies": []}]}]}, {"body": "I work in biotech (computational genetics) and everyone is either on AWS or Google Cloud. I mean you are talking about genome centers like the Broad that process Terabytes of data in the cloud daily.\n\nMSFT has yet tried to penetrate into this market, which is lucrative since the file sizes have to be large for genomes (more $$$ in storage) and the pipelines take days to complete. There's no reason to move to Azure because their pricing is not competitive enough to secure the large contracts. \n\nMSFT is making the right moves though and I am invested in them. Seeing them embrace linux was a good sign too. Holla linux gang.", "score": 1, "replies": []}]}, {"body": "look at the stock performance, it will more than a 4 trillion company in 10 years, probably 6-7 trillion dollar company.", "score": -14, "replies": [{"body": "If you believe this why did you ask the question?", "score": 6, "replies": [{"body": "Self validation. It's financial masturbation, don't let him come.", "score": 3, "replies": []}]}, {"body": "> look at the stock performance, it will more than a 4 trillion company in 10 years, probably 6-7 trillion dollar company.\n\nok", "score": 5, "replies": []}, {"body": "Previous stock performance has nothing to do with future stock performance.\n\nGreat companies can go to garbage (GE) and garbage companies can go to great.", "score": 1, "replies": []}]}]}, {"body": "MSFT is not the leader in all those things. They are involved in all of them, but definitely not the leader.", "score": 5, "replies": []}, {"body": "> MSFT is the leader in all those things.\n\nIs this just, like, your opinion? You won't find any data supporting it , so what in the world are you basing it on?", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Google is a poorly run company, they have failed with practically every single hardware product, can't target enterprise for shit and have zero cloud game. Google will not perform anywhere near where Microsoft, Facebook and Apple will.", "score": -6, "replies": [{"body": "lol", "score": 3, "replies": []}]}]}]}]}, {"body": "Not best performing as in the most gains, but probably one of the more stable and reliable ones.", "score": 38, "replies": []}, {"body": "You don't think within the next 10 years there's going to be a new up and coming tech stock that outperforms Microsofts growth? That's silly.\n\nIS MSFT still a great investment?  Of course. Will they see the best gains in the tech industry? No of course not, some smaller up and coming company that can actually grow 50% a year will.", "score": 18, "replies": [{"body": "Maybe Square, but Microsoft will outperform Google, Apple and Amazon. Facebook will come a close second with social media advertising monopoly. The worst performer will be Google, which has failed in smartphones, cloud, enterprise, AI and VR.", "score": -3, "replies": [{"body": ">Maybe Square, but Microsoft will outperform Google, Apple and Amazon. Facebook will come a close second with social media advertising monopoly.\n\nAh I forgot Square! I disagree Microsoft will outperform Amazon though. I think Amazon will outperform Microsoft easily. Of course it's all speculation. I also don't think google has failed and I believe it's still a great company. I think of the big 4 Apple will be the slowest growing imo.", "score": 2, "replies": [{"body": "I think Apple has something huge up their sleeve. Like consuming the electric autonomous car industry kind of big. They just have that R&D drive that will make them better than any other Silicon Valley Unicorn", "score": 3, "replies": [{"body": "I highly doubt they can consume the electric car industry. I'll be very honest and say I'm a huge tesla bull, but I also like Apple a lot. Love their products, but Tesla is, as of right now, literally years ahead of anybody and that gap is only widening, no one is gaining on tesla faster than they are developing right now and I don't expect that to change in the foreseeable future. This is just my opinion though, and nothing against Apple. They're kings, but I personally believe Apples best days are behind them, but hey, anything can happen.", "score": 2, "replies": [{"body": "One thing about Apple though, while I do agree Tesla is years ahead of the industry. Apple is extremely secretive, and doesn't release something unless it is better and will sell. I don't think they can be counted out of any pursuit. They have the power of Amazon when it comes to product development and technical evolution.", "score": 2, "replies": [{"body": "Fair point.", "score": 1, "replies": []}]}]}]}]}, {"body": "Don’t think Google is so sure to be the worst performer out of the bunch — there’s a lot of investment going into the burgeoning healthcare space ([Verily](https://verily.com/our-story/about-us/) ), and leveraging their AI strengths across their products (but more on the backend).\n\nAlphabet’s Deepmind AI has promising applications for pharmaceuticals and health informatics, especially in the post-covid19 era.\n\nhttps://www.forbes.com/sites/michelatindera/2018/03/13/alphabet-has-filed-186-health-care-patents-watch-out-world/[Health Care Patents & Big Tech Firms](https://www.forbes.com/sites/michelatindera/2018/03/13/alphabet-has-filed-186-health-care-patents-watch-out-world/) \n\nAlphabet may also be onto some major things regarding [quantum computing](https://www.nature.com/articles/s41586-019-1666-5) .\n\nedit: oh yeah and Waymo (self-driving cars)", "score": 1, "replies": [{"body": "FB and NFLX will be the worst performers IMO, just because I don't think they can sustain high growth like the others.", "score": 2, "replies": []}, {"body": "Google sucks at getting traction for their newly released products though (see: Hangouts, Google+, Inbox, Hired, etc.). They really need to work on whatever issue they have that results in gaining little to no market share of then respective product domain. They have the infrastructure to keep rolling out any software they choose, they just have to do a better job marketing it or something (source: friend is an engineer at Google)", "score": 1, "replies": [{"body": "Doesn't help they abandon projects at the drop of a hat", "score": 1, "replies": []}, {"body": "totally, they do a lot of cool stuff but, like, do zero for publicity ??? I don’t get it? There’s no value then really (or at least in terms of value perceived by the general public)", "score": 1, "replies": []}]}]}, {"body": "Can you share why you mention Square? Just curious", "score": 1, "replies": [{"body": "It’s a good company when the economy is not closed.", "score": 1, "replies": []}]}]}]}, {"body": "I think that Microsoft will probably be the most stable and reliable tech stock of the next decade for consistently good growth without many dips, but I don't think that they will be the overall best performing.\n\nI think that the best performing tech stock will probably be Tesla. The 2020s is going to be the decade of the rise of Tesla into being one of the most valuable companies in the world. Microsoft is already there, so they simply don't have as much growth potential.", "score": 14, "replies": [{"body": "I agree with this comment because most of my portfolio is MSFT and TSLA", "score": 6, "replies": []}, {"body": "I agree on tesla hah", "score": 4, "replies": []}, {"body": "The wildcard is Elon Musk. It's hard to invest in a company who's CEO is so all over the place and apparently dealing with some moderate mental health issues. When he tweets that the stock is overvalued and it drops several percentage points...not good for anyone looking for long-term value.", "score": 2, "replies": [{"body": "Elon is one of the reasons that I believe so strongly in Tesla. He's a genius, he's the best CEO alive today at raising money and generating hype for his companies, and he is 100% committed to his companies improving the world.\n\nJust as I said last week after the tweet, I don't care about short-term tweet drama that has absolutely no impact on Tesla's long-term future prospects. Tesla's stock only went down for 1 day from the people that emotionally overreacted over a tweet and then was already back up the next trading day, so how did that affect long-term value?\n\nElon is a big part of the reason why Tesla stock has reached the heights that it has in the first place. Without Elon, Tesla stock would not be nearly $800 right now.", "score": 3, "replies": [{"body": "> Just as I said last week after the tweet, I don't care about short-term tweet drama that has absolutely no impact on Tesla's long-term future prospects. \n\nThis is basically what Ron Baron said on CNBC some months ago back when the shorts were in control of the stock. No one is going to decide months or years down the line that they won't buy a Tesla simply because of some tweet Elon Musk posted months or years ago. \n\nMy co-worker regularly talks about how he thinks Elon Musk is the biggest asshole on the planet, but he still bought a Tesla Model 3 last year.", "score": 1, "replies": []}]}, {"body": "One could argue Tesla would not exist or be where it is today if it wasn't for a \"wildcard\" - a crazy eccentric genius / visionary willing to take on and disrupt the auto and fossil fuel industry. \n\nHe actually confirmed why he tweeted that in a later tweet (response to someone). As you can see, the market did not care the next day. If you are looking for long term value, you need not care about the day to day fluctuations.", "score": 1, "replies": []}]}, {"body": "TESLA? Are you cereal? Their market cap is already way higher than most of the major auto companies.\n\nDo you expect 90% of drivers to be driving tesla's by 2030?\n\n  \nEven their own CEO thinks its over valued.", "score": 1, "replies": [{"body": "I'm pretty sure that I'm not a breakfast food? And if I was, I'd be bacon, not cereal.\n\nI notice that the people that doubt Tesla all have one thing in common, they all mistakenly think of Tesla as just an automobile company. Tesla is not an automobile company; Tesla is a technology company. The people that think of Tesla as just an automobile company are the same type of people that thought of Amazon as just a book store company a decade ago.\n\nAnd no, I don't expect 90% of drivers to be driving a Tesla by 2030. I don't believe that Tesla will become one of the most valuable companies in the world just from the money that they make off of selling automobiles because again, they are not an automobile company. They are a technology company that just happens to be disrupting the automobile industry like how Amazon, Google, Microsoft, Apple, etc. were technology companies that disrupted various industries. \n\nThey will become one of the most valuable companies in the world because as a technology company, they have multiple other ways to make money from things like automation, data, infrastructure, subscriptions, advertising, and licensing to name a few. And that's not even taking into account the battery and solar parts of their business as well as the other industries that Tesla is planning to disrupt.", "score": 5, "replies": []}, {"body": "Why is it that alot of people even call it a tech stock? Did Toyota turn into a tech stock when they launced the Prius years a go? \nSimply put its a car driven by a battery instead of gas, why does that constitute the car manufacturers stock ”tech”?", "score": -2, "replies": [{"body": "Do you know what tech is involved in making the batteries?\n\nCompare a Tesla Model 3 or Model Y with other electric vehicles by their competitors. You'll find one thing in common. Tesla's batteries weight less, and they tend to put less in then their competitors. And yet Tesla gets **more** range then their competitors. That is the tech advantage of Tesla at batteries. The other automakers have to either put in more batteries (upping the price of their cars), or have less range then a Tesla, both of which make their cars less appealing to consumers. The experts who have studied the battery and powertrain tech agree that Tesla has a 3 to 4 year lead over their competitors at the tech.\n\nAnd then there's the software. The other automakers are largely *not* good at making their own software. They often outsource it to other companies, and that's sometimes bit them in the butt (like with Toyota's self accelerating Priuses). Volkswagen is reportedly having to delay the launch of their own electric car (the ID3) because of software issues. Tesla on the other hand has perfected the art of over the air software updates, while other automakers make you bring your car to the dealership to get the software updated.\n\nIf Tesla didn't have a tech lead then the other automakers would be able to jump into the electric market overnight and build better electric vehicles with longer ranges then Tesla's for cheaper prices. But they aren't, because it's not that simple.", "score": 3, "replies": [{"body": "Thank you for a thoughtful answer!", "score": 2, "replies": []}]}]}]}]}, {"body": "If you look back in 10 year increments last 40 years what people thought is not what actually happened.", "score": 5, "replies": []}, {"body": "no", "score": 3, "replies": []}, {"body": "no", "score": 3, "replies": []}, {"body": "No.  Microsoft has never been the best performing tech stock in its entire history.  It HAS been one of the most consistent however.", "score": 3, "replies": []}, {"body": "> \\-coronavirus proof \n\nif your customers go bankrupt, you lose customers. \n\n> \\-teams, xbox and cloud all growing due to coronavirus \n\ngame consoles have been on decline after playstation2 / xboxOG era. And then there is the rise of free video games (fortnite, call of duty warzone, ect), correct me if im wrong but i don't believe microsoft can make money off free-to-play games?\n\n> \\-artificial intelligence and virtual reality divisions growing \n\nOk, but wheres the money in this? not putting it down, courious to see the logic of how this makes more cash", "score": 3, "replies": [{"body": "They are still making money from recurring subscription fees for Xbox live. And, Free games are actually a gold mine because of microtransactions and battle passes. And there are tons of business applications for Artificial intelligence and AR/VR.", "score": 1, "replies": [{"body": "Right but does microsoft get any of that microtransactions/battle pass money?", "score": 1, "replies": []}]}]}, {"body": "“Coronavirus proof”?", "score": 2, "replies": []}, {"body": "Maybe best among big 5 tech (AMZN MSFT AAPL FB GOOG).\n\nBut it's much easier for some small company to let's say 5x compared to these mega companies.", "score": 2, "replies": []}, {"body": "Sure", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "If I had to chose a stock it would be MSFT but, shit happens.", "score": 1, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [Will MSFT be the best performing tech stock over the next 10 years?](https://www.reddit.com/r/StonkFeed/comments/gel60t/will_msft_be_the_best_performing_tech_stock_over/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "ADBE maybe.", "score": 1, "replies": []}, {"body": "As always it depends on definitions.", "score": 1, "replies": []}, {"body": "Yes, so put all your money in it and quick", "score": 1, "replies": [{"body": "I have 577 shares in msft", "score": 1, "replies": []}]}, {"body": "Look I own MSFT but there's no way in hell. There will be companies that 10x, 20x, etc. Ain't happening with MSFT", "score": 1, "replies": []}, {"body": "I bet TSLA will do better.", "score": 0, "replies": []}, {"body": "Drinking too much of their kool aid?", "score": 1, "replies": []}, {"body": "I'm betting on Tencent to be honest. China too strong.", "score": 1, "replies": [{"body": "Tencent is just to marinated in bat soup", "score": 0, "replies": []}]}, {"body": "yes", "score": 0, "replies": []}, {"body": "In 10 years?  No f'n idea.  If I were to place a bet, I'd say APPL.  But honestly, no clue.  Sorry I couldn't be of any help to you.  Sad face.", "score": -1, "replies": []}]}
{"title": "Mini-crash this afternoon... not a coincidence (Feb 20 same thing)", "selftext": "Anyone else remember when the market burped the same way it did today, where literally everything suddenly went down in 10 or 15 mins, then regained itself after a 2 or 3 percent drop? That was Feb 20th, just before lunch. I distinctly remember nearly shitting myself when I saw it, thinking a war started or something. I have past posts say it was the algo robots selling off, and we can hold the line... anyway, we had 1.5 trading days before the start of the Big Bad Bear that took nearly a month to find a bottom. I don't believe in cowinkiedinks, so I'm taking that as a sign of another algo selloff coming during the weekend. Could be way off, but whay happened today was based on nothing, just as that burp was Feb 20th. \n\nThinking July puts on anything (might go apple or amazon) 15%-20% OTM.", "id": "gea5wb", "created_utc": 1588726627.0, "score": 31, "upvote_ratio": 0.71, "num_comments": 83, "comments": [{"body": "Yes. Put your life savings for July puts so I don’t have to hear from you again.", "score": 143, "replies": [{"body": "One thing I've noticed about my own emotions is that I become more aggressive when my outlook on the world is threatened by inconvenient facts.", "score": 49, "replies": [{"body": "You shouldn’t be emotional when investing.", "score": 6, "replies": [{"body": "I could be a monkey throwing shit at a dart board while investing and have the same returns so what's it matter", "score": 18, "replies": []}, {"body": "Well yeah do you shouldn’t be using options as bets or making stock bets at all, way worse than being emotional, yet that’s what we are here for. Stfu about being rational and go back to r/investing", "score": 1, "replies": [{"body": "Lol ... no, you pussy.", "score": -1, "replies": [{"body": "don't make me fight you, i'm a lean mean bankrupt machine", "score": 1, "replies": [{"body": "Thanks for the chuckle. Good luck today!", "score": 1, "replies": [{"body": "I need it, thanks, you too!", "score": 1, "replies": []}, {"body": "I need it, thanks, you too!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Currently riding my calls on SHOP and ETSY . Had Amazon on the way up too (all bought April 9th). If SHOP and ETSY hit earnings well, I'll cash out, take 1/2 off table, and put down hard.", "score": 7, "replies": [{"body": "I think your calls are good.", "score": 5, "replies": []}]}, {"body": "Off by a day...", "score": 0, "replies": [{"body": "It did this on May 4, I wouldn’t call this a mini crash. lol! Dude and you’re gloating?  You said July puts? Hahahah", "score": 1, "replies": [{"body": "I'm not gloating.", "score": 1, "replies": [{"body": "Then, what are you doing?", "score": 1, "replies": []}, {"body": "Oh no. A red day. Must be your mini crash.", "score": 1, "replies": [{"body": "I love how you continue to come back to this thread every day, when you're clearly someone who can't take that kind of behavior. I was off, big deal. Literally said it was a hunch, and based on nothing more. Wow, great job. \n https://imgur.com/BoxqIzd.jpg", "score": 0, "replies": [{"body": "You chose to gloat 7 days after my response, clearly you can’t take your own behavior.\n\nEDIT: and chose to gloat to several users. 😂", "score": 1, "replies": [{"body": "Didn't gloat, and I said as much. You've commented on this thread literally every trading day. Bet you have 200 bucks in your account", "score": 0, "replies": [{"body": "If you weren’t gloating, then what were you doing? 😂😂 you’re so sad. You go through my comment history and now guessing my account! 🤣Your failed prediction and your reaction on a red day is an indicator of your portfolio.  I know I’m good.", "score": 0, "replies": []}]}]}, {"body": "Please don't compare your gloating to the harassment I experienced. Completely different context. You returned after 7 days to gloat. LMAO. But, here's only the few of the many times you decided to gloat several days after your premonition of the market crash. Have a great day.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/gea5wb/minicrash_this_afternoon_not_a_coincidence_feb_20/fqi3p18/\n\nhttps://www.reddit.com/r/wallstreetbets/comments/gea5wb/minicrash_this_afternoon_not_a_coincidence_feb_20/fqi3tah/\n\nhttps://www.reddit.com/r/wallstreetbets/comments/gea5wb/minicrash_this_afternoon_not_a_coincidence_feb_20/fqi3skg/", "score": 0, "replies": [{"body": "Ok guy\n🤭👌🔥💯", "score": 0, "replies": [{"body": "🤣 it’s crashing!", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "RemindMe! In in 3 months. Lol! 3% down... mini crash, whatever the fuck that means. 😂", "score": 1, "replies": [{"body": "There is a 25.0 minute delay fetching comments.\n\nI will be messaging you in 3 months on [**2020-08-13 17:15:11 UTC**](http://www.wolframalpha.com/input/?i=2020-08-13%2017:15:11%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/gea5wb/minicrash_this_afternoon_not_a_coincidence_feb_20/fqi4t50/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fgea5wb%2Fminicrash_this_afternoon_not_a_coincidence_feb_20%2Ffqi4t50%2F%5D%0A%0ARemindMe%21%202020-08-13%2017%3A15%3A11%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gea5wb)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "It’s up 3% today, off by a day... indeed. 🤣", "score": 1, "replies": []}]}]}, {"body": "Wow, such a great DD.  These are the only two times in the last 3 months we've had an end of day sell-off in the last 30 mins.  Its not like it happened on April 20, 21, 23, or 28......../s", "score": 48, "replies": [{"body": "Ok zoomer", "score": -38, "replies": [{"body": "nice argument", "score": 5, "replies": []}]}, {"body": "Off by a day or so.", "score": -1, "replies": [{"body": "It's a week later and still haven't touched lows for May.", "score": 2, "replies": []}]}]}, {"body": "Fits with bearish outlook. Yea I'm in", "score": 19, "replies": [{"body": "Off by a day or so", "score": 0, "replies": []}]}, {"body": "So based on this, when would the drop be? Thursday?", "score": 15, "replies": [{"body": "Personally think by end of week, but could be this weekend. Just a hunch, but I noticed this right before big crash in Feb.", "score": 14, "replies": [{"body": "I remember this happening before but I could not remember when it was so I'll be ready this time", "score": 11, "replies": [{"body": "Same here, big cock money... same here.", "score": 8, "replies": []}, {"body": "Off by a day or so... hope you loaded up", "score": 1, "replies": []}]}]}]}, {"body": "What exactly is special to you about this dip? Spy dipped 2 dollars, I mean, how is this different than any other movement?", "score": 12, "replies": [{"body": "Way higher volume and faster movement than anything we've seen all day", "score": 5, "replies": []}, {"body": "Off by a day or so...", "score": 0, "replies": [{"body": "I'm still not convinced but I'm holding puts so lets see.  Positions?", "score": 2, "replies": []}]}]}, {"body": "Pay Attention People. This autist demonstrates the art of making some stupid shit sound believable.", "score": 8, "replies": [{"body": "Where do you think tendies come from though?", "score": 1, "replies": []}, {"body": "Off by a day or so...", "score": 1, "replies": [{"body": "Oof. This isn't aging well.", "score": 2, "replies": []}]}]}, {"body": "Ahh July puts. Lol. I remember “April puts on anything will print”. A week later, “I’d go out to May to be safe”. I guess it’s July now? Lol", "score": 14, "replies": [{"body": "this is so true lol", "score": 2, "replies": []}, {"body": "Off by a day or so...", "score": -2, "replies": [{"body": "oohhh is the big market crash here??", "score": 2, "replies": []}]}]}, {"body": "[it's happening!](https://m.imgur.com/r/ronpaulshops/vwMin)\n\nRemindMe! 3 days", "score": 6, "replies": [{"body": "I will be messaging you in 2 days on [**2020-05-09 01:12:07 UTC**](http://www.wolframalpha.com/input/?i=2020-05-09%2001:12:07%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/gea5wb/minicrash_this_afternoon_not_a_coincidence_feb_20/fpm85r4/?context=3)\n\n[**5 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fgea5wb%2Fminicrash_this_afternoon_not_a_coincidence_feb_20%2Ffpm85r4%2F%5D%0A%0ARemindMe%21%202020-05-09%2001%3A12%3A07%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gea5wb)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "You still thinking the weekend is ripe for a selloff? \n\nRemindMe! 4 days", "score": 1, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 4 days on [**2020-05-13 01:38:37 UTC**](http://www.wolframalpha.com/input/?i=2020-05-13%2001:38:37%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/gea5wb/minicrash_this_afternoon_not_a_coincidence_feb_20/fpxrviv/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fgea5wb%2Fminicrash_this_afternoon_not_a_coincidence_feb_20%2Ffpxrviv%2F%5D%0A%0ARemindMe%21%202020-05-13%2001%3A38%3A37%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gea5wb)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Off by a day or so... timing is tough", "score": 1, "replies": []}]}, {"body": "Off by a day or so", "score": 1, "replies": []}]}, {"body": "Is distinctly remember that! I bought 10 Spy $270 puts for $9 a piece that I rode to glory before the \"great green dildo'd April\" fucked me.\n\nI thought the same damn thing today.", "score": 6, "replies": [{"body": "You know what so do then brotha", "score": 2, "replies": []}]}, {"body": "Your hunches might be right. That EOD selloff was nasty. 2.30% to 0.90% in a matter of minutes. WTF was happening?", "score": 4, "replies": [{"body": "Literally nothing, which is why I'm highly suspicious of it. I remember distinctly watching my STMP calls print that day in Feb, and started seeing everything tank on nothing. Check my posts, tried to post about robots testing us. I honestly think that's what happened. They're going to short biggly again", "score": 3, "replies": []}, {"body": "News broke that airbnb was laying off 25% of staff\nThe drop was larger and more aggressive than when the German constitutional court ruled QE by the ECB to be partially illegal, just a few hours prior.\n\nObviously doesn't make sense, but it seems that big news/data are being ignored in favor of random factoids to be used as catalysts.", "score": 1, "replies": []}]}, {"body": "Buy fd puts so you can post your loss porn", "score": 6, "replies": []}, {"body": "I remember that, my gay gain started from that moment. And then, you know....", "score": 3, "replies": []}, {"body": "!remindme 7/17", "score": 3, "replies": []}, {"body": "RemindMe! 2 days", "score": 3, "replies": []}, {"body": "1.5 days should give my HD and MDT calls enough time to be worth cashing out.", "score": 2, "replies": []}, {"body": "It didn't dip nearly as much as it did on Feb 20.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Theory is, just like Feb 20, algos are testing whether they can cause panic selling in one coordinated attack on the market. Seems like they can, and humans will follow suite as soon as some bad news hits. \nJust a hunch, but as I said, I don't believe in coincidences.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Crash happened Feb 23rd. Monday. The first of many bloody Mondays brotha... but noted", "score": 1, "replies": []}]}]}]}, {"body": "The real question is will my SPX call spreads print today?  They expire today.   2880/2890    and     2900/2910\n\n\nplease consult your crystal balls - sell at open or hold the line?", "score": 1, "replies": []}, {"body": "You had a rash of bad, and quasi-bad news in the last hour. That's all. A handful of people/algos tried to close their shorts, dropped the price a bit. This combined with the news lead to selling among various groups, which probably caused some more panic selling from others.\n\nWhat you saw in February was the beginnings of instability in the market. We already have that now. I do think the market will go down in the near future. But this isn't an indicator of it. At most, it might be a subtle indicator that traders are jumpier then 'normal', but that's all.\n\nDon't read too much into one end of day contraction, they do just happen.", "score": 1, "replies": [{"body": "Hiiiiiiiiiiiiiii.\nClosing shorts doesn't drop prices, it props them up.", "score": 8, "replies": [{"body": "Not always. The market doesn't obey the normal supply demand model. You have an auction model which can, and does on occasion have inverse relations to supply demand pressure. Closing can create volume, which if the trend is downward, can cause additional downward pressure.\n\nPeople who close short positions look for one of several factors when closing their position: Margin calls, in which they have no choice they must close or face serious risk. This can cause the price to increase, rapidly. They hit their price target and move on to other opportunities, this usually happens in a down trend and can stabilize the trend though may not cause an actual bump in price. Lastly, time. They need or want to close at end of day to ensure they don't face additional lending costs, or margin calls caused by fluctuating after hours prices. This last one can cause price deflation. A stagnate or down trend can have additional volume caused by people panic selling. Adding volume to a panic, can cause addition downward pressure, rather then relieving it.\n\nIf there's one thing to remember about the stock market, it's that it doesn't obey ideal market dynamics, instead it follows an auction style model, which can have odd price fluctuations that don't make sense in a pure supply demand setup.", "score": 1, "replies": []}]}, {"body": "Meh, we will see. Come of you auties are cool... don't come to calls next week", "score": 3, "replies": [{"body": "God speed fellow retard. God speed.", "score": 1, "replies": [{"body": "Off by a day or so... timing not easy", "score": 0, "replies": []}]}]}]}, {"body": "USO Puts might print in 2 weeks when oil goes negative again.", "score": 1, "replies": []}, {"body": "Let’s play with your thought.  Instead of also driven flash crash, it is a small or medium fish that was warned to get out.  That drop, done.  Now the big fish comes in to drop the hammer, exiting in such a hurry that everyone needs to take notice to not be the bagholder.  But it will be too late already.", "score": 1, "replies": []}, {"body": "Tombstone Doji on SPX today. Just need follow through. Shit makes no sense and is bound to rollover soon. Currently holding SPY 284p, 250p and QQQ 210p expiring 6/19", "score": 0, "replies": []}]}
