{"title": "Options Questions Safe Haven Thread | Dec 04-10 2023", "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions.**  &nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING,  PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)    \n[..](https://www.reddit.com/r/optionsmods/wiki/)   \n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling retrieves.**   \n**Simply sell your (long) options, to close the position, to harvest value, for a gain or loss.**  \n**Your break-even is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**    \n\n**Also, generally, do not take an option to expiration, for similar reasons as above.**\n\n---\n\n**Key informational links**  \n•&nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n•&nbsp;[Binary options and Fraud (Securities Exchange Commission)](https://www.sec.gov/files/ia_binary.pdf)   \n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)     \n•&nbsp;[Options Trading Introduction for Beginners (Investing Fuse)](https://investingfuse.com/options-trading-for-beginners/)    \n•&nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n•&nbsp;[Options Trading Concepts -- Mike & His White Board (TastyTrade)(about 120  10-minute episodes)](https://www.youtube.com/playlist?list=PLPVve34yolHY43YaBegHMzN9WjrTnQfFr)  \n•&nbsp;[Am I a Pattern Day Trader? Know the Day-Trading Margin Requirements (FINRA)](https://www.finra.org/investors/learn-to-invest/advanced-investing/day-trading-margin-requirements-know-rules)   \n•&nbsp;[How To Avoid Becoming a Pattern Day Trader  (Founders Guide)](https://foundersguide.com/pattern-day-trader/)    \n\n---\n\n**Introductory Trading Commentary**   \n&nbsp;&nbsp;&nbsp;•&nbsp;**[Monday School Introductory trade planning advice (PapaCharlie9)](https://www.reddit.com/r/options/wiki/faq/pages/mondayschool)**  \n&nbsp;&nbsp;**Strike Price**   \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&nbsp;&nbsp;**Breakeven**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&nbsp;&nbsp;**Expiration**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Expiration & Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&nbsp;&nbsp;**Greeks**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Pricing & The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&nbsp;&nbsp;**Trading and Strategy**    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Fishing for a price: price discovery and orders](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_minimizing_bid-ask_spreads_.28high-volume_options_are_best.29)     \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[The three best options strategies for earnings reports (Option Alpha)](https://optionalpha.com/blog/the-three-best-option-strategies-for-earnings)   \n\n---\n\n**Managing Trades**  \n•&nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&nbsp;[The diagonal call calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction, trade size, probability and luck**  \n•&nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/trade_planning)  \n•&nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&nbsp;[Applying Expected Value Concepts to Option Investing (Select Options)](http://www.selectoptions.com/Edu-Expected-Result)  \n•&nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)    \n•&nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)    \n•&nbsp;[Poker Wisdom for Option Traders: The Evils of Results-Oriented Thinking (PapaCharlie9)](https://www.reddit.com/r/options/comments/qfq82a/poker_wisdom_for_option_traders_the_evils_of/)   \n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/price_discovery)  \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)  \n\n\n**Closing out a trade**  \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position/)       \n•&nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/risk_reward_and_exits)   \n •&nbsp;[Guide: When to Exit Various Positions](\nhttps://www.reddit.com/r/options/wiki/faq/pages/whentoexit)   \n•&nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)   \n•&nbsp;[5 Tips For Exiting Trades (OptionStalker)](\nhttps://www.reddit.com/r/options/comments/qtwsm5/5_tips_for_exiting_trades/)   \n•&nbsp;[Why stop loss option orders are a bad idea](https://www.reddit.com/r/options/wiki/faq/pages/stop_loss)   \n\n---\n\n**Options exchange operations and processes**     \n•&nbsp;[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n•&nbsp;[Options that trade until 4:15 PM (US Eastern) / 3:15 PM (US Central) -- (Tastyworks)](https://support.tastyworks.com/support/solutions/articles/43000435335-options-that-trade-until-3-15-pm-central-)  \n\n---\n\n**Brokers**   \n•&nbsp;[USA Options Brokers (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/brokers)    \n•&nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)  \n\n---\n\n**Miscellaneous: Volatility, Options Option Chains & Data, Economic Calendars, Futures Options**   \n•&nbsp;[Graph of the VIX: S&P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&nbsp;[A selected list of option chain & option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021, 2022, 2023](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2023)\n---\n\n---", "id": "18b6rfl", "created_utc": 1701761667.0, "score": 12, "upvote_ratio": 0.94, "num_comments": 65, "comments": [{"body": "Am I seeing this right that KO options have poor liquidity? I was gonna buy some weekly $KO $62 calls but it looks like a ghost town", "score": 1, "replies": [{"body": "Not a ghost town near the money.   \nYou fail to specify strkes.  \n\nOptions chain.   \n\nhttps://www.nasdaq.com/market-activity/stocks/ko/option-chain", "score": 0, "replies": []}, {"body": "I think mostly investors put up this stock, more of a wealth wheel stock. It has a beta of .60, which is something that doesn't move a lot. Stock got as high as 64 to low 51. Now, it's back at 58 for the year. \n\nThe calls you wanted have less than .10 delta. You may want to use strikes that are two points away from atm strike price to get some volume. \n\nKO is a boring stock for a trader, but it is great for investors explained by the HV it has.", "score": 1, "replies": [{"body": "Exactly, not a lot of movement, so premiums aren’t great, plus a decent dividend adding risk to selling nearer term calls.", "score": 1, "replies": []}, {"body": "Got it. Thank you", "score": 1, "replies": []}]}, {"body": "The 15DEC KO chain shows the 65 long calls having a 0 bid and .15 ask, so very little trades occurring.  OI is 343 so not a ghost town, but a very small population . . .\n\nThe delta is .08 so the probabilities are low this will be ITM at expiration.\n\nYou could put in an order at the mid .08 price, or keep fishing up to the ask of .15 and may get a fill, but as you are seeing this has poor liquidity.", "score": 1, "replies": [{"body": "Yeah. I’ve given up on KO for now. Thx", "score": 1, "replies": []}]}]}, {"body": "I've only traded bought single options and I wonder what it is like to sell options. I know that you collect a premium as long as the price is below/above the strike price, but what does it look like to have an active position? In terms of percentage, how does the contract fluctuate?", "score": 1, "replies": [{"body": "It’s not significantly different from long options except you want to buy to close at a lower price instead of selling to close at a higher price.  Imagine your Greeks of a long position but flip the greeks around.", "score": 1, "replies": []}, {"body": "The premium is in the unchanging past once the short position has been entered.  \n\n\nThe trader is concerned about the cost of closing the position.", "score": 1, "replies": []}, {"body": "Long options are \"bought to open low and sold to close high\" to profit.  Ex. buying an option paying a $1.00 premium debit and then selling to close for a $1.50 credit is a .50 or $50 profit.\n\nShort options are \"sold to open high and bought to close low\" to profit.  Ex. selling an options to collect a $1.00 premium credit and then buying to close for a .50 debit leaves the remaining .50 or $50 as profit.", "score": 1, "replies": []}, {"body": "Looks the same as a long position, only the quantity is negative. So if I sell to open a put on TSLA for this month, it looks like:\n\n-1 TSLA 250p 12/15 at $4.20\n\nMy broker lets me add a column that shows what the initial margin requirement is/was, as a reduction in buying power. So that's a little more complicated than for a long put. If you buy a long put for $4.20, you see a debit for $420 and that's it. If you short a put, you *receive* $420 in cash, but you also see a perhaps $7000 reduction of buying power for collateral. So cash balance goes up but buying power goes down.", "score": 1, "replies": []}]}, {"body": "Im new to options trading and I’m just wondering should I make my call options expiration date like a week out, a month out, a year out? Also how do you determine which experarion date to choose?", "score": 1, "replies": [{"body": "Buying or selling call options?\n\nMany who buy may want to open farther out, ex. 90 dte or longer, to give the analysis time to play out.  They may also open ITM at a higher delta, ex. .80 to .90, as this reduces the negative impact of theta decay.\n\nMany of those who sell options will open 30-45 dte as these trades benefit from theta decay which ramps up around this time frame.  This also allows opening at lower deltas/farther OTM, ex. .20 to .30, for less risk but still bring in a decent amount of premiums.", "score": 1, "replies": []}, {"body": "Time and money are related in options. The further out you go, the more expensive the contract will be. So it's really a cost optimization problem. To answer how far out you should go, you first has to decide how much you want to spend, or receive if you are selling to open.\n\nAs a general rule of thumb, stay under 60 days to expiration, for either short or long trades.\n\nAlso, monthly expirations tend to have better liquidity than other expirations. There is one monthly expiration each month, on the third Friday.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This is normal. P/L fields in ToS are in actual dollar amounts, not per-share (i.e., divided by 100) amounts.", "score": 1, "replies": []}, {"body": "Ignore the column. The valuation is not so useful.   \n\nAttend to the bids for long positions.", "score": 1, "replies": []}]}, {"body": "Hi r/options! I need help with some Call Options I bought:\r  \n\r  \nBought Call Options $2.50 a year out (ending in the next few months) in a company I liked.\r  \n\r  \nAfter I bought, the company did a stock reverse split. So that, the stock is trading at 15x the price of what it was.\r  \n\r  \n\r  \n\r  \nThe Options Still say $2.50 x 100 shares.\r  \n\r  \n\r  \n\r  \nI thought I should be able to buy the stock at $2.50/share x 100 x #ofoptions. Isn't it: \"on or before the expiration date?\"\r  \nSo I should be able to buy the stock at the $2.50 price and sell it at what it's selling at today, right?", "score": 1, "replies": [{"body": "> The Options Still say $2.50 x 100 shares.\n\nThat is surely wrong. What is the exact spec of the position? Ticker, strike, expiration, opening debit. Without the ticker, it's impossible to look up the adjustment details.\n\nA reverse split usually changes the deliverable, so that instead of 100 shares it ought to be 100/15 = 6 and 2/3rds shares. The fractional share might be part of the problem.", "score": 2, "replies": []}, {"body": "State the ticker for a useful response.", "score": 1, "replies": []}]}, {"body": "LEAP options. What is the reasoning behind buying a deep in the money 70-80 delta option versus something atm instead?", "score": 1, "replies": [{"body": "Less extrinsic value to decay away, and greater leverage than owning shares.", "score": 2, "replies": []}, {"body": "In addition to what u/wittgensteins-boat correctly states, a .70 to .80 delta option will have a much higher probability of being, or staying, ITM at expiration.\n\nIn this example the ProbITM would be around 70% to 80%, so this makes the probabilities much higher than a .30 or .40 delta OTM option that would only have a 30% to 40% probability of being ITM at expiration.\n\nOne last thing is that the higher the delta the closer the option will move with the stock.  A long .90 delta call option will gain $0.90 for each $1 move of the stock.", "score": 1, "replies": []}, {"body": "It's spelled LEAPS, it's an acronym and the S stands for Securities, and don't write \"option\" when you mean \"call\". Option means both puts and calls collectively. LEAPS do in fact have puts and calls, but the 80 delta strat is strictly about calls.\n\nThe 80 delta strat is a stock replacement strat that provides leverage without needing to take out a margin loan. An 80 delta call gets close to the same price movement as the underlying stock, $.80 on the dollar most of the time. However, since you are only entitled to gains above the strike, the up-front cost of the call is a lot less than shares. For example, the 80 delta Jan 2025 LEAPS SPY call is bidding for $76.91 as of this writing. That's the 405 strike, so 100 shares would cost $40,500 but the call only costs $7691, for more than 5x leverage.\n\nTrue, the ATM call would cost even less and provide more leverage, but it also gets around $.50 to the dollar of price movement and has a lower probability of expiring above the strike. Remember, you are only entitled to gains on the share that end up above the strike at expiration.", "score": 1, "replies": [{"body": ">the 80 delta strat is strictly about calls\n\n \"Am I a joke to you?\" - Poor Man's Covered Put", "score": 1, "replies": []}]}]}, {"body": "Complete beginner here, please pardon my naivete.\n\nI use Robinhood. I'm sure it's not the best, but it's what I've got right now. I do not have access to \"Level 3\" options trading.\n\nI want to explore the \"put credit spread\" strategy as a learning opportunity. I grasp the general idea of how the strategy works, I think, but my question is more about the mechanics of placing the trade.\n\nOn the Robinhood app, I see a button labeled \"Put Credit Spread\" under the \"Vertical Spreads\" option. But, since I am not \"L:vel 3\" I can't use it.\n\nMy question is... if I use the \"Cash-Secured Put\" button to sell a contract, and the \"Long Put\" option to buy the downside protection with the same expiration... is that the same thing as using the \"Put Credit Spread\" button?\n\n(I hope I used all those terms correctly).\n\nAnyway, would I have accomplished the same thing or is this somehow different in a way that would affect the math of the trade?", "score": 1, "replies": [{"body": "You would have accomplished the same thing, but without approval to trade spreads (which sounds like it's included in what RH calls Level 3,) the short put would need to be cash-secured.  That is, if the short put strike is 50, you would need at least $5000 in buying power (what RH calls \"collateral\") regardless of whether you're also buying a long put.", "score": 1, "replies": []}, {"body": "A suggestion would be to get a paper trading account so you can explore and practice.  \n\nTDA/Schwab has the ThinkorSwim platform that offers an excellent simulation to learn how options work, practice while developing your trading plans/strategies, and learn a full featured options platform - [https://tickertape.tdameritrade.com/tools/papermoney-stock-market-simulator-16834](https://tickertape.tdameritrade.com/tools/papermoney-stock-market-simulator-16834)", "score": 1, "replies": [{"body": "Really fantastic suggestion- thank you!", "score": 2, "replies": []}]}, {"body": "RH might also disallow the second trade. Any half decent order software would figure out that the resulting two positions amount to a credit spread. Though I admit if any broker was proven to be substandard in this regard, RH would be at the top of my likely suspects list.", "score": 1, "replies": [{"body": "Interesting. In my oversimplified mind, the spreads seem like even lower risks than other trades that new traders should be encouraged to adopt, not prevented from executing. I could be missing something.", "score": 1, "replies": [{"body": "They're not going to disallow it if you have enough cash to make the put cash secured.  There's no rule that you can't have an open cash secured put, and an open long put , on the same underlying on the same expiration date at the same time. But it's a FINRA requirement that you have a margin account to trade spreads.  This is because of the risk of early assignment. If you get assigned early, and you don't have enough cash to make the put cash secured, you will end up buying shares on margin.", "score": 1, "replies": []}]}, {"body": "I use this method on E-trade so simulate vertical spreads, both put and call.  I have been running bull call spreads on Conagra and ATT for a few months.  The e-Trade app allows me to open bull and put spreads as long as I either own the shares (for a call spread), or have the cash on hand (for a put spread).\n\nIf my put spread is profitable by >50% (ie debit $50 for the spread and the spread is now worth a net credit of $75.  $25 / $50 = 50%), I close / roll the spread like you would any other put spread and the app allows me to roll to a new position same day.  The app automatically secures the short put with cash in my account, and that cash is removed from my cash available to trade for the duration of the position.\n\nFor call spreads, if they are profitable by >100%, I close / roll the spread.  I have noticed occasionally that I am not allowed to roll over to a new position same day, I have to wait for the next day for the short option buy-to-close to settle.  Other days, I am allowed to roll a call spread same day.  I am thinking it is because for a few of my trades I started with just a 30 dte covered call, and very soon into the position, the stock dropped in price several % in a short time.  In that situation, I bought a long call on the same expiration, creating a bull spread.  When that spread got profitable by >100%, the app would not let me roll it over as a spread.  I had to close each leg separately and wait for the short leg to settle before I could open a new bull spread.", "score": 1, "replies": [{"body": "Okay, good to know.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No.  Options trade when the market is open and not before.  There is no way to have an order fill until the market is open and prices have updated.\n\nThis stock had an ER after the market hours last night, so this adds risk to any trade.  Many avoid having trades open over an ER as the price movement can be unpredictable.  Unless you were trying to take advantage of the ER movement.", "score": 1, "replies": []}, {"body": "Greeks do not force anything. Ever.  They are an interpretation of market prices.\n\nYou cannot beat a platform.  Possibly your data is delayed 15 minutes, and possibly you need to request real time data from the broker.    \n\nDid you issue a market order?  If so, almost never trade options with a market order.\n\n\nAlso so, all platforms are at least several seconds behind the market.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So, you entered a limit order to sell at 1.45, which was presumably fair market price at the time, it filled, and you're complaining that you somehow \"should have\" been able to sell it for more?\n\nI suspect you still haven't really fully grasped how options pricing works.  An option has its own price, the premium, that goes up and down in response to market forces on it, partially independent of the underlying.  If that put was trading around 1.45 at the time, that's what it was worth.\n\nYour complaint is kind of like saying \"stock XYZ had an upcoming earnings report, so I bought 100 shares at $50 per share.  At the earnings report, it absolutely crushed estimates, so I sold, but it was only for $52.  Given how much it beat earnings by, shouldn't I have been able to sell it at like $60?  Did E\\*Trade somehow screw me over?\"  No.  You chose to sell when the stock was at 52.  You might personally think that considering how good the earnings report was, it should have gone higher--but it didn't.  At the time you sold, the stock was trading at $52 per share, because that's what the market thought it was worth.  That's what people who wanted to buy it were willing to pay, and that's what people who were selling it were willing to take.\n\nWell, it was the same with your put option.  At the time you sold it, the market thought it was worth 1.45.  It doesn't matter that you thought it should have been worth more--it wasn't.  This wasn't caused by delayed quotes or anything.  The put was worth 1.45 because what people who wanted to buy it were willing to pay, and that's what people who were selling it were willing to take.  You were one of those people, because you chose to sell it at 1.45.", "score": 2, "replies": []}]}]}]}, {"body": "Please help me to understand.\n\nI just bought AMD puts when AMD was ~$9\n\nAMD fell to $7.70 - great right? No - I lost money and I totally can’t understand why.\n\nAMD - @320 - Buy 5 Jan-26-24 115 Puts @ Market to Open\n\nI sell minutes later because AMD fell over $1 and I lost $320ish\n\nWhy did I lose when I bought puts and the price moved down, as I thought it would?", "score": 1, "replies": [{"body": "This is the most frequent new trader question asked.  \n\nIn the side bar, at at the very top of this weekly list, and on the wiki  is the link.  \n\n**Why did my options lose value when the stock price moved favorably?   \n-- Options extrinsic and intrinsic value, an introduction**    \nhttps://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value. \n\nAlso, almost never buy or sell options via market order.  Limit orders only. \n Generally the bid ask spread can be quite wide, and varies rapidly, by the minute.", "score": 1, "replies": []}]}, {"body": "Hey all. I purchased a corvus call option on 12/6 expiring 12/15 strike price of $1. i paid $0.8 My call option exploded the first day, up to a value of $1.45 somehow. it hovered around there for a while. then, today, 12/8 corvus was up 13.69% to $1.91 per share!!! i was ecstatic. i check my call option however… and its worthless? its valued at $0.01. i dont understand. is my extrinsic value really that low?", "score": 1, "replies": [{"body": "The lessons here are: 1) don't trade options on penny stocks, and 2) the bid-ask spread matters much more on options than it does on stocks, especially low-volume options.\n\nThe last time the 12/15 1 strike call traded was the day you bought it, 12/6.  Only 2 contracts traded that day, both at a premium of 0.80.  It hasn't traded since then.  Any fluctuations in price you saw were solely due to changes in the bid/ask.\n\nIt's not valued at 0.01.  As of market close today, the bid was 0, meaning you couldn't sell it if you wanted to, and the ask was 2.00.  Assuming the stock is at 1.92 (a big assumption, since the stock itself has a wide bid-ask) it should be worth at least 0.92.  You could try leaving a GTC limit order open to sell it for 0.92, but it's anyone's guess as to whether it will ever fill.  There *should* be a bid on it since it's ITM, so maybe the fact that there isn't is just an artifact of the market being closed, and you can try again Monday morning.\n\nBut in general, this is the kind of problem you have when you trade illiquid options on penny stocks.", "score": 3, "replies": [{"body": "thank you very much. i was so successful on my amd and tesla calls i thought hey why not yolo a call on this little bio tech stock. i know PDUFA or FDA stuff is happening with it so i tried something lol. and it failed miserably. but hey, lesson learned. thanks!", "score": 1, "replies": [{"body": "**ALWAYS check, before buying,   \nand to verify a platform's supposed \"value\".**    \n\n- The BID and the ASK.   \n- The VOLUME. \n- The OPEN INTEREST (this number is as of the close, the prior day)  \n\nYour immediate exit from a long option is near the bid.    \n\nWide bid-ask spreads lead to deranged platform valuations, which are typically calculated as  the average of the bid and the ask. The market is not located at the mid-bid-ask.", "score": 1, "replies": [{"body": "thank you!", "score": 1, "replies": []}]}]}]}, {"body": "i wish i could post pictures. the graph for my call option price is very.. blocky. it goes way up in a straight line, plateaus, then steep fall straight down. meanwhile all the stock price has done is go way up. this is on robinhood btw", "score": 1, "replies": [{"body": "You can by hosting the image at  Imgur.com and linking to it.  \n\nOr making a post at r/test, as an image post, and obtaining URL addresses of the images you upload, and copying the links  to your comment here.", "score": 1, "replies": []}]}]}, {"body": "Do you use Standard Deviation in your trading and if so, how does it help you? I've heard people talk about pricing their strikes at one standard deviation for example and am unsure how that is even calculated.", "score": 1, "replies": [{"body": "Implied volatility is a standard deviation measure of, according to a model, interpreting the extrinsic value of an option. Converted to an annualized amount.\n\n\nTo convert to a shorter term, see here:    \n\nConverting an annualized IV to a daily expected move.  \nMacroOption.   \nhttps://www.macroption.com/converting-implied-volatility-to-daily-move/#:~:text=Assuming%20252%20trading%20days%20per,of%20252%2C%20or%20approximately%2015.87.", "score": 2, "replies": []}, {"body": "IV is the better measure as u/wittgensteins-boat indicates.  Higher IV typically indicates higher options premium due to the bigger implied move, and low IV indicates lower options pricing.\n\nSome use higher IV to indicate when to sell options and there is a theory that IV is overstated so there can be an edge when the option premium is higher and the actual move lower.  Low IV and lower premiums are an indication of buying as the cost is lower.\n\nIV is mean reverting in that a low IV is expected to move up to the mean that helps long options profit, and high IV is expected to drop that helps short options profit.  \n\nTo determine the strike look at delta to see the probabilities - [https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981](https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981)", "score": 1, "replies": []}, {"body": "TL;DR - One standard deviation represents about 68% of outcomes. If we assume 50 delta is the mean of the distribution, 68% works out to 34 delta on either side of that 50 delta mean, so that's 16 delta for OTM or 84 delta for ITM.\n\nFull explainer here: [Options Math 101](https://optionalpha.com/lessons/understanding-the-math)", "score": 1, "replies": [{"body": "Is this important to understand to be a successful options trader?", "score": 1, "replies": [{"body": "IMO, yes. Let me put it this way. You *can* be a successful options trader without knowing this, but you won't understand *why* you are successful.", "score": 1, "replies": []}]}]}]}, {"body": "Are there any popular profit taking strategies when buying options? When selling options I'll close anything above a 30% profit. Idk what they do at WSB it seems like 2000% or nothing but 50% target profit has worked fairly well for me when paper trading unless the underlying is really moving in my favor. Anyways, any thoughts would be appreciated.", "score": 1, "replies": [{"body": "Remember WallStreetBets has above 10 million members.\n \n\nYou could have one 20x gain a day reported, and that is less than one hundredth of the population over a year.  \n\nSmaller threshold exits of 10 to 30 percent are reasonable, and repeatable.", "score": 1, "replies": []}, {"body": "It depends on holding time and other risk management and exit strategy factors, but as an example, when I run 30 day ATM calls on XSP during a bull market, I exit at 10% profit or 20% loss. This means I only need a 67%+ win rate to be profitable, and that's usually achievable during a bull market.\n\nThe important takeaway is that **you should always consider your profit exit in the context of your loss limit and expected win rate**. Profit levels in isolation mean you are not fully considering risk/reward. The higher your profit exit level the higher the win rate you need, since higher profit means higher risk, in both size of loss and frequency of loss.", "score": 1, "replies": []}]}, {"body": "I bought SPY at $380. Then I unfortunately sold CC at $400.\n\nAs expected, a huge loss, but I could roll the option to the next year and get a huge tax loss write off as rolling the option is not consider as a wash sale.\n\nWhat is the catch here?", "score": 1, "replies": [{"body": "Doesn't sound like a loss to me.  You make $2000 on the shares, plus the premium of the call.\n\nYou don't say what credit you received for the call, nor what strike/expiration you're considering rolling to nor what credit you'd receive.  But you'd just be deferring the sale of the shares.  Maybe, depending on whatever else you've got going on this year tax-wise, it would be advantageous to have the loss of closing the call.  But you'd still be taking the gain next year when you're eventually assigned.", "score": 2, "replies": []}, {"body": "You made a very nice profit and there is no “loss”.\n\nWhen you open a CC you are agreeing the sell the shares at the strike price and if you won’t be happy selling the shares at that price then don’t sell CCs to begin with . . .\n\nRolling for a net credit can collect more premium, and possibly move the strike price up, both of which can increase the possible profit.  You didn’t provide the trade superficial, but the chances of rolling for a net credit this deep ITM is very low to impossible, so this is unlikely to be a possibility.  Rolling for a net debit would decrease what profit you already have in the position and would not make sense.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You’re making an assumption that the stock will move up, stay about the sale $135 price, or not drop to $127 or below.  If this happens the trade can win.  If the stock drops below $127 and stays down through expiration then it will be challenged and either need to be adjusted or closed for a loss.\n\nYou didn’t mention the delta, but in looking it up today (weekend and not updated data) it is .18 or 18% estimated probability the price will be $127 or below at expiration.  The converse is an 82% probability it will be above $127 and be profitable.\n\nUsing the delta there is an 82% probability of the trade profiting and at a $1 wide spread the max loss is $100 - credit received of $9 or $91 max loss.  \n\nThe question to ask yourself is - Are you willing to risk $91 over 33 days to have an 82% probability to make a possible $9 profit?\n\nIf not, then go back to the option chain to find a trade that offers the premium and probability you find acceptable based on the assumption of what the stock will do over the length of the trade.  Hope this helps!\n\nEdited to correct max loss amount.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sorry, didn’t finish the sentence which should have said a $91 max loss.  I edited the comment.  \n\nThe $91 risk for $9 is a function of the low delta and high probability.  By increasing the delta it will reduce the probability but increase the possible profit.  It is up to you to find a trade where the assumption is strong enough to support the risk and possible reward.", "score": 1, "replies": []}]}]}]}, {"body": "options volume is insanely higher than normal but open interest is literally zero. Jump in feet first or run for the hills?", "score": 1, "replies": [{"body": "Ticker?\n\nOpen interest is as of the close the day before, updated only once a day.", "score": 3, "replies": [{"body": "It was MBI, it's a moot point now, I just can't recall seeing nearly 10k volume and zero OI", "score": 1, "replies": [{"body": "It happens when the prior day there was no open interest, and a big fund takes a position, or goes in and out of a position.", "score": 2, "replies": []}]}]}]}]}
{"title": "covered call strategy for bearish/neutral/bullish market environment", "selftext": "All,\n\nWhen writing covered call, do you guys have any specific rules that you stick to for a different market environment such as bearish/neutral/bullish?\n\nIt seems the volatility measure of VIX has been pretty stable and flat so most options don't provide a good premium when writing covered call nowdays. In a situation like this, what delta, gamma, vega, or theta are you looking for?\n\nI've come across a book that it's easier to write weekly covered call because it's easy to manage risk and etc instead of distant dte. I am mainly looking to implement 1-2 weeklies dte at the most because I don't seem to have much luck with distance dte.\n\nI have lots of shares that I want to utilize to collect some steady income to offset cost basis. My goal is holding stocks for at least a year or so getting call away/assignment isn't an ideal solution.\n\nFor those of you who are writing covered call consistently and pickup a decent premium, what strategy works for you and what doesn't. Thanks for inputs!", "id": "18blded", "created_utc": 1701807879.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 17, "comments": [{"body": "I have listened to trasty trade for the first time, and these ladies on there said they NEVER sell calls, as the premuims are always down , and it's a less rate of expired worthless(60%) .\n\nThe ladies also said they like to sell puts as when the market is going down theres more premium. Thus, a put is best. Plus, they said selling puts expire worthless (87%) . \n\nI don't agree with your harder to manage. Also, the more you write in a year,  statistically the more you will manage.  I like to write everything correctly.\n\n If I write a cc, I have a small edge that the stock will stay neutral or I'll write when I'm sure it's going down, which will bring more premium. It's complicated as this is not the right environment to write.", "score": 6, "replies": [{"body": "\"Ladies\" of Tasty? Tom's a hippy and has boomer hippy long hair, but calling him a lady is a bit out there.", "score": 4, "replies": []}, {"body": "Not a great time to sell puts with the VIX so low. Maybe okay on some high IVR tickers but I would be weary", "score": 1, "replies": []}]}, {"body": "> When writing covered call, do you guys have any specific rules that you stick to for a different market environment such as bearish/neutral/bullish?\n\nYes, 45 DTE 30 delta open, but only if the credit is worth the sacrifice of capped gains on the shares, which is rarely the case. Even for slow growth, high dividend utility stocks, it's usually not worth it.\n\nI prefer range-bound sideways markets for CCs. Bear markets are the worst, bull markets aren't much better.\n\n> It seems the volatility measure of VIX has been pretty stable and flat\n\nWhile that's true, keep in mind that VIX is about the entire SPX index. So any individual stock, like NVDA for example, could have a very different volatility profile than what VIX would suggest.\n\n> In a situation like this, what delta, gamma, vega, or theta are you looking for?\n\nAs noted above, what I look for is the size of the credit compared to the potential for sacrificed gains. If a CC is paying $1 of credit but you believe there is a fair chance of $3+ of excess gain above the strike before expiration, it's not a good trade.\n\n> I've come across a book that it's easier to write weekly covered call because it's easy to manage risk and etc instead of distant dte. \n\nI hope the book didn't actually say that. It would be more accurate to say it's a trade-off. There are advantages/disadvantages to every expiration decision. For example, weeklies tend to have worse liquidity than monthlies, if they are available at all.\n\n30-45 DTE is a backtested sweetspot for most market conditions. It's a reasonably balanced risk/reward expiration choice.\n\n> My goal is holding stocks for at least a year or so getting call away/assignment isn't an ideal solution.\n\nIf that is the case, **do not trade CCs on those shares.**", "score": 2, "replies": [{"body": "As far as risk management, what I stated about the book was incorrect. I got confused with other topic. It states, the flexibility to adjust is better for weekly and the income generated by selling four successive weekly calls will often exceed that received from selling one monthly call. Thanks for your info!", "score": 1, "replies": [{"body": "That is mostly true about the 4 weekly generating more premiums than a monthly. It still depends on what day you sell each one of the calls. You could potentially pick 4 very bad days that would yield less than 1 well chosen monthly. Also, if you don’t want to sell the shares then don’t write calls. Are you set on only having LT gains for tax purposes? Or some other reason for the 1yr holding period?", "score": 1, "replies": [{"body": "I’ve been holding PYPL since 2021 and I still believe in the company. Yes, my expectation has been adjusted and I understand that this will never reach to the pandemic level like 200ish but I still think the stock is solid 80-90ish and it’s possible to go slightly over 100 if everything works perfectly. I just want to give another year before I finally call it quit if they don’t meet my target price and expectation. So I am basically giving them a year to turn the business around under new leadership. If they still can’t perform then I am out unless I see significant improvement.", "score": 1, "replies": [{"body": "I don’t know your cost basis but if you aren’t underwater then you can write calls at near the money and buy a call at a higher strike for insurance. For instance Pypl is now offering premium of .80 at $58 strike. You can take that contract then buy a $62 call for $.08. This will protect you from $62.08 and up\n\nIf you are underwater then you probably shouldn’t write the calls at a strike where you could be assigned to sell for a  loss", "score": 2, "replies": [{"body": "My cost basis is now ~$105 after today’s substantial purchase to reduced from 163.", "score": 1, "replies": [{"body": "Imho that is not the stock in your folio that you should sell calls off of unless you need to loss harvest before Christmas for taxes", "score": 2, "replies": [{"body": "I do understand what you are saying but I am at a point where if I can get some premium while I am holding then it will be nice but if I can’t figure out how then i guess I will just hold it without covered call.", "score": 1, "replies": [{"body": "You should have collected premiums by selling a put to get into the position with your large investment today.", "score": 1, "replies": [{"body": "I thought about that but I didn’t want to risk of missing the boat. I could do that over and over but that will never help reduced my cost basis substantially so I took the different approach. Let’s see if my approach pays off or get fked… only time will tell :) this basically means that I know that Pypl will never hit 163 probably ever unless miracle happens which I don’t expect lol", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I'm looking for a ticker with steadily expensive weekly options (3-6%) and a year ahead level of put+call near the money of 40-50% of the stock price (all this with best profitability in mind). Also best would be if this is a ticker where your broker allows you to sell short (or cash covered) puts. Then you start with selling weekly short puts until you get stock assigned. At this moment purchase long (year) puts+calls near the money and start selling covered calls until you get the stocks sold. Then repeat starting with the short puts. Don't touch the long options unless you need to execute a side to bring your stock number or cash to level.", "score": 1, "replies": []}, {"body": ">I've come across a book that it's easier to write weekly covered call because it's easy to manage risk\n\nThere is a multitude of reasons to write options on shorter DTE but being easier to \"manage risk\" is definitely not one of them.\n\nMy general rule of thumb would be \"do not consistently or constantly write covered calls.\" In the cash accounts I have that can only do CC/CSP (such as my daughter's UGMA/UTMA account) I will only sell calls on stocks that had a significant run up in a short period of time. Usually I just glance at daily and weekly RSI because I don't want to put effort into actually doing any sort of calculation on this. She has 19 more years until she can take it out anyway. I also never sell CC on the entire position. If she has 1,000 shares of F for example, I might sell 4-6 calls if it has a sharp run up. This is also pre-calculated before hand and at all times in her google doc management spreadsheet, so I just check RSI, check how many calls the spreadsheet says I can sell, and fire away.", "score": 1, "replies": [{"body": "I’ve written cc 2 contracts per trans incrementally but so far no luck. It’s definitely easier to manage risk wise for my situation but I am seriously thinking about 20+ contracts at once for more premium. I haven’t decided yet but I guess I have to figure out cause time is money OR I may not write cc at all which is very slim.", "score": 1, "replies": []}]}, {"body": "I usually try to only sell options on stocks which have a expensive implied vol versus what they're moving every day (realized volatility). That way it's more likely I make money. In order to decide what are cheap implied vols and expensive I use this [tool](https://axorax.github.io/urlmskr/aHR0cHM6Ly90aGV0YXRpdGFucy5jb20vbW9uaXRvci8=).", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "18b8z6w", "created_utc": 1701771560.0, "score": 43, "upvote_ratio": 0.89, "num_comments": 9, "comments": [{"body": "Honestly couldn't agree more with this decision from Barclays. 3M has had a rough year in 2023, but it's looking like 2024 is gonna be much better. They've made new leadership changes, they've created this new healthcare company (Solventum), their earnings announcement was huge and their dividends call was excellent. High hopes for 3M next year.", "score": 15, "replies": []}, {"body": "This get asked about every month - here is an [old post](https://www.reddit.com/r/stocks/comments/16odnok/3m_value_trap_or_perfect_buy_in/?utm_source=share&utm_medium=web2x&context=3).  I really do not think things have changed especially on the ligation front with forever chemicals and with the Supreme Court hearing the Stadler cash and settlements, there is just too much uncertainty for me.\n\nThe question I have on the healthcare group are the products innovative or now commodities.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No, every municipal will jump on the band wagon to get money.  It is like Asbestos.   Once it starts, tough to stop.\n\nI am also avoiding JNJ due to the talc issue.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Probably worse, the only differences is Asbestos has an associated disease.  As long as they find residuals, there will be litigation.", "score": 1, "replies": []}]}]}]}]}, {"body": "WHLR ready to jump on issuance of unregistered stock.\nPre-Market volume over 6M and a 62% increase.", "score": -2, "replies": [{"body": "Mmmkkkay", "score": 0, "replies": [{"body": "As predicted, the stock went up 25% today so..mmkkk.", "score": 0, "replies": []}, {"body": "Only 16.69% today..", "score": 1, "replies": []}]}]}, {"body": "Despite facing challenges in consumer electronics, European markets, and a year-over-year organic decline in China, 3M is benefiting from cost-cutting measures and price hikes. The company is progressing with its restructuring actions and health care spin program, expecting to complete the spin in the first half of 2024.", "score": 1, "replies": []}]}
{"title": "Job openings slide to 8.7 million in October, well below estimate, to lowest level since March 2021", "selftext": "Job openings tumbled in October to their lowest in 2½ years, a sign that the historically tight labor market could be loosening.\r  \n\r  \nEmployment openings totaled 8.73 million for the month, a decline of 617,000, or 6.6%, the Labor Department reported Tuesday. The number was well below the 9.4 million estimate from Dow Jones and the lowest since March 2021.\r  \n\r  \nThe decline in vacancies brought the ratio of openings to available workers down to 1.3 to 1, a level that only a few months ago was around 2 to 1.\r  \n\r  \nFederal Reserve policymakers watch the report, known as the Job Openings and Labor Turnover Survey, closely for signs of labor slack. The Fed has boosted interest rates dramatically since March 2022 in an effort to slow the labor market and cool inflation, and is contemplating its next policy move.\r  \n\r  \nWhile job openings fell dramatically, total hires only nudged lower while layoffs and separations were modestly higher. Quits, which are seen as a measure of worker confidence in the ability to change jobs and find another one easily, also were little changed.\n\nhttps://www.cnbc.com/2023/12/05/job-openings-slide-to-8point7-million-in-october-well-below-estimate.html", "id": "18be7c2", "created_utc": 1701789635.0, "score": 66, "upvote_ratio": 0.86, "num_comments": 12, "comments": [{"body": "The market seems to, but I just don't trust the job opening data. I do believe the market is softening, but the measure just has too low a response rate and there are too many companies holding open positions they don't intend to fill (for a variety of reasons) or hold open multiple role vacancies for one position. I get why people would want data before it shows up in employment figures and while it's an okish proxy, I don't think the month to month ups/downs particularly mean much.", "score": 28, "replies": []}, {"body": "And how many of those are ghost jobs?", "score": 15, "replies": [{"body": "As long as that number of ghost jobs stay the same it doesn't really matter does it? We only really care about the change not the absolute number", "score": 3, "replies": []}]}, {"body": "We are still far above normal levels for Job Openings", "score": 12, "replies": []}, {"body": "Market should have been up 500 points.", "score": 5, "replies": [{"body": "Nah too much manipulation. Last 10 data reports were beyond excellent but we barely move", "score": 6, "replies": []}]}, {"body": "I consider this a good thing. Job openings have been elevated for months.", "score": 0, "replies": []}, {"body": "Take into consideration how you look at jobs data historically compared to say the year 2000. Today if you don’t have a job you can go on your phone and sign up for DoorDash, Uber, etc …", "score": -1, "replies": [{"body": "Bullshit low pay gig work with zero benefits and where you have to use/wear down your own asset to do the job.\n\nPeter Thiel’s dream.", "score": 4, "replies": []}]}, {"body": "Yea but apply for a job you are qualified for and you won't hear a peep. A ton of companies are just collecting applications", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "18bm1fn", "created_utc": 1701809576.0, "score": 0, "upvote_ratio": 0.17, "num_comments": 12, "comments": [{"body": "this belongs in wallstreetbets. there is zero dd in this post lol", "score": 53, "replies": []}, {"body": "Do you think it hasn’t occurred to anyone else that GTA VI is going to be huge? Why wouldn’t that be priced in already?", "score": 10, "replies": []}, {"body": "Do you happen to be bagholding", "score": 17, "replies": [{"body": "Did you read the first sentence? Is an unrealized gain bagholding?", "score": -24, "replies": [{"body": "Quite literally yes.", "score": 17, "replies": []}, {"body": "Yea. Thats the bag youre.. holding", "score": 3, "replies": []}, {"body": "lol", "score": 1, "replies": []}]}]}, {"body": "hey bro i need to muscle up my amrs,do u feel stronger holding these bags?lol", "score": 9, "replies": []}, {"body": "Ban this dude!", "score": 6, "replies": []}, {"body": "To each their own. But if you’re happy with plus/minus $20 per share every year, this is the for you.", "score": 1, "replies": []}, {"body": "Did you analyse when lil yachty is going to drop an album. Every time he dropped one the market moved up for atleast 5%. Only sell on a day when he drops his album.", "score": 1, "replies": []}]}
{"title": "some general advice for the near future", "selftext": " Was looking into making Short term profit, currently in limbo deciding between various companies from nvdia, AMD, tesla all the way to apple and microsoft. I keep pouring all my money into one or the other and it's barely working. Should I get into options strategies? ", "id": "18aybqc", "created_utc": 1701734404.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "If you can't make money with shares you probably won't with options either.", "score": 5, "replies": []}, {"body": "If you just bought and held any one of these stocks since the beginning of this year you'd have huge gains. What are you doing with these companies to not make gains ?", "score": 3, "replies": [{"body": "well actually to add to this, I've been doing it for a month. I recently returned to trading after I took a break from being late to the short squeeze fiasco back in 2021.", "score": 2, "replies": []}, {"body": "selling on random days of the week like an idiot. is there any stock you think i should hold for a month?", "score": 1, "replies": [{"body": "No one knows what will happen in one months time. My recommendation is to invest in these blue chip companies for a long period of time and dollar cost average if they go down. \n\nShort term gains is just luck and gambling, i suggest a long term outlook.", "score": 3, "replies": [{"body": "Something like coke or walmart then? People are saying apple as well.", "score": 1, "replies": [{"body": "Doesn't have to be coke or walmart. You listed amd, tsla, msft, those are all blue chips as well and should do well for the next 5 years. \n\nMy main point is don't try to trade in and out of stocks and timing the market, having a longer term approach us much more successful\n\nIf you want to utilize an option strategy to enter these trades you can sell cash secured puts to enter at strikes you're comfortable with, that will also generate a small amount of short term gains . But maintain a long term outlook on the underlying you're choosing .", "score": 3, "replies": [{"body": "Thank you. I was considering premiums and puts but ig if long term is the most viable option then I might have to go with it.", "score": 1, "replies": [{"body": "Selling puts for premium is fine, but again, do it on stocks you have a long term bullish outlook on, because when you get assigned you will be holding the position for some time and need to be ok with that.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Depending on how much money you have I’d pick a few and focus on them. If not much money I’d pick one and focus on that one and then maybe split your money into a solid etf but all these companies are buy and hold  . All can be traded but will require a good bit of money", "score": 1, "replies": []}, {"body": "No, probably not. Options have a learning curve and almost everyone loses money.", "score": 1, "replies": [{"body": "In the future, I'll gain more knowledge", "score": 1, "replies": []}]}, {"body": "If you have the capital, selling a weekly or monthly put on Boeing is one of my positions……am totally ok with being assigned the position as I think BA well positioned when looking out 2+ years.", "score": 1, "replies": []}]}
{"title": "Looking for critical feedback on strategy", "selftext": "So I'm decently experienced in options trading, had my fun gambling on options back in college which culminated with GME - afterwards I took my profits and walked away as I knew I'd give everything back continuing to gamble on contracts.\n\nIn the years since I've played around with small theta positions, but for the most part I've just been adding to my stock positions in my personal accounts (mostly MSFT). I save about $3k a month, deposited between a high-interest (5.05% APY) savings account and my personal investment account. I max my 401(k) contributions so I'm ahead of the game retirement-wise; I'm comfortable with taking more risk in my personal portfolio - although since my account is already so concentrated towards MSFT and tech, I count that towards a lot of my \"risk budget\".\n\nMy account is margin so I can sell naked puts without locking up cash and can avoid interest by liquidating on assignment. I'm not looking to get rich quick, and so I've settled on capping my collateral use to 10% of my portfolio value. \n\nI haven't seen too many people doing this, most people here use > 30% of their AUM as collateral. For me, I see it as a little extra return to help grow my account, and not as the primary source of appreciation.\n\nThe reason why I'm posting this is I struggle to see the downside of such an approach - other than the tax implications for STCG (I'm in the 32% bracket). Assuming the stocks I sell puts against are relatively safe longterm (F, SOFI, NOK etc), it almost seems like free money which sets off \"no such thing as a free lunch\" alarms in my head: I avoid assignment whenever possible by rolling losers out to reduce cost-basis, and worst case if I get assigned I just sell at most 10% of my account to cover - since my account is mostly blue-chip stock, I can't imagine it losing enough value to really fuck me over from margin/leverage - and if it does I doubt I'd be much worse off than strictly holding shares anyway.\n\nSo I want y'all to paint realistic worst-case scenarios that would bite me in the ass more than just buy-and-holding whatever stocks I'm wheeling. The way I see it, if the market dips significantly I'd just hold the assigned shares w/o selling CC's until the inevitable rebound. I also have more than enough cash saved to cover a margin call to prevent having to sell other shares at a loss. And this is a strategy I only employ while market conditions are favorable - personally I'm bullish in the medium-long term while expecting mostly sideways movement in the near term for my long positions (ie MSFT and AMZN), but if a bear market comes I'd revert to buy-and-hold only.\n\nSo if anyone wants to play devil's advocate for me it would be appreciated. Using standard 30-45 DTE, .25-.3 Delta, 40-70% IV, taking profits at 50% etc etc", "id": "18bi0qa", "created_utc": 1701799319.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 13, "comments": [{"body": "Whenever anyone says \"free money\" it screams they have missed something . . .\n\nFirst, many (most?) traders have separate accounts for options trading with others for long term holdings, retirement accounts, etc.  When someone says they are using 30% or 50% of their account to trade options, that is the percentage of their OPTIONS account and not the total of their life savings.  Some may have one account, but allocate $X to trade options and then use a percentage of that to trade.  \n\nYou are trading a version of the wheel which is very common and can work quite well, but I would never day it is \"free money\" or cannot lose . . .\n\nSee this link where I posted my wheel trading plan 5+ years ago as it has helped a lot of new traders get started as they dial in their own plan - [https://www.reddit.com/r/options/comments/a36k4j/the\\_wheel\\_aka\\_triple\\_income\\_strategy\\_explained/](https://www.reddit.com/r/options/comments/a36k4j/the_wheel_aka_triple_income_strategy_explained/)  Hope this helps!", "score": 5, "replies": [{"body": "When I said “free money” i meant relative to the opportunity cost of any other strategy (and since I’m retail, the only other viable strategy is b&h). Obviously if the market tanks, I lose money but if I stuck to buy-and-hold, I would have lost money anyway. If I levered the fuck up, I’d be taking on a ton of tail risk but that’s why I limit my collateral to 10% of my portfolio value. \n\nThe way I see it, I’m getting return from my stock holdings + savings interest + premiums. Inevitably I’ll get assigned, in which case I reallocate money to cover (either from selling stock, or if the market tanks and I don’t want to sell, using a small % of my savings to cover). The triple dippiness is why it feels like “free money”, and I know when something seems like free money there’s usually something I’m overlooking - hence the post. In this case I suspect I’m trading risk for increased returns, but unless the bottom falls out I don’t see a whole lot of risk in wheeling “safe” stocks with 1/10 of my portfolio. I also don’t assign much probability to the bottom falling out since the Fed has room to cut rates which would at least give me time to exit, and since AI-upside is practically infinite despite timing uncertainty and short-term overhype. Shit even if WWIII came it would probably trigger a boom from MIC subsidies - war is historically profitable for the US. \n\nAnd haha I remember reading your wheel post back when you posted it, great writeup!", "score": 1, "replies": [{"body": "Yeah, it is a sensitive word choice as many post their strategies asking us to prove it is not \"free money\".  ;-D\n\nI'm agreeing with you that it is a lower risk way of trading and has been boosted even more by the 5% being paid by some brokers, but we know what won't last forever.  \n\nRegardless, and to your point, I still marvel how much money I can make through the keyboard of my computer!  Options are a wonderful thing!  All my best!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Retail traders are information-starved and trade mostly on noise, any signal retail has access to is usually already priced-in. \n\nIt’s absolutely possible for a dedicated retail trader to continually outperform b&h, but the odds are stacked against us. \n\nI think it’s fine to play around with wheeling or credit spreads as a retail trader, or to use long puts for hedging/tax avoidance. But retail traders should allocate most of their capital to b&h if they want to *reliably* build wealth. Especially considering the tax implications, I’d have to crush the market by a considerable sum to make up for the tax burden of STCG vs LTCG from b&h", "score": 3, "replies": []}]}]}]}, {"body": "Sounds like you're doing well with your current strategy and taking a measured approach to risk in your personal investments - good for you.\n\nAs you asked for downside scenarios, one potential scenario to consider would be if a significant market crash hit all your positions at the same time - a possibility even with blue-chip stocks. This could put you in a spot where you get margin calls due to your naked puts, and the value of your portfolio would be too low to cover them. Even with your saved cash, there could be scenarios where this amount wouldn't be enough. \n\nAlso, when it comes to the high-interest savings account, a rate of 5.05% APY is solid right now, but also remember that interest rates can be volatile and might dip in the future. Just something else to consider.\n\nAs for the tax implications you mentioned, have you considered opening a taxable brokerage account to offset STCG? With the right investment mix, you might be able to harvest losses to offset the gains. \n\nAnd just an out of the context info, I did gather some live data on top APY savings accounts rates, just in case you'd like to cross-check or explore. \n\nBank | APY | Link | Min. Deposit | Fees \n:-:|:-:|:-:|:-:|:-:|:-:\nBask Bank | 5.10% | [Link](https://apy.fyi/r?link=aHR0cHM6Ly93d3cuYmFza2JhbmsuY29tL3Byb2R1Y3RzL2ludGVyZXN0LXNhdmluZ3MtYWNjb3VudD91dG1fc291cmNlPTE4YmkwcWE%3D) | $0 | None  \nUpgrade | 5.07% | [Link](https://apy.fyi/r?link=aHR0cHM6Ly91cGdyYWRlLnl3aGNjNy5uZXQveDkxdmI1P3V0bV9zb3VyY2U9MThiaTBxYQ%3D%3D) | $1000 | None  \nCIT Bank (Platinum Savings) | 5.05% | [Link](https://apy.fyi/r?link=aHR0cHM6Ly93d3cudGtxbGhjZS5jb20vY2xpY2stMTAwNjk4Njc1LTE1NDkxMDEyP3V0bV9zb3VyY2U9MThiaTBxYQ%3D%3D) | $5000 | None  \nSynchrony Bank | 4.75% | [Link](https://apy.fyi/r?link=aHR0cHM6Ly93d3cuc3luY2hyb255YmFuay5jb20vYmFua2luZy9oaWdoLXlpZWxkLXNhdmluZ3MvP3V0bV9zb3VyY2U9MThiaTBxYQ%3D%3D) | $0 | None  \nBetterment | 4.75% | [Link](https://apy.fyi/r?link=aHR0cHM6Ly93d3cuYmV0dGVybWVudC5jb20vY2FzaC1yZXNlcnZlP3V0bV9zb3VyY2U9MThiaTBxYQ%3D%3D) | $10 | None  \nCIT Bank | 4.65% | [Link](https://apy.fyi/r?link=aHR0cHM6Ly93d3cudGtxbGhjZS5jb20vY2xpY2stMTAwNjk4Njc1LTE0NDY1NjMxP3V0bV9zb3VyY2U9MThiaTBxYQ%3D%3D) | $100 | None  \n\n\n \n\nRegardless, keep ensuring your risk tolerance aligns with your strategy. Sounds like you've got a solid grasp on your financial picture! Keep it up.", "score": 2, "replies": [{"body": "Yeah the “significant crash” is really the only real risk I can see, although I don’t weight much probability towards that in the near-term. If that were to happen, I’d just take a small % of my savings to cover assignment to avoid selling my primary position at loss. \n\nThe “loss harvesting” approach seems interesting. I considered opening up a Roth, but since I can’t use margin there I decided against it as I already have a well-funded retirement account & would rather keep my money in stock than locked away in CSP’s. \n\nYou’re saying to open a wide variety of diversified positions, and then sell the losers before the tax deadline to offset STCG? This would require opening new positions every tax year right, since closing losers held > 1yr wouldn’t offset STCG if I understand correctly. \n\nIt seems like an interesting approach but also seems like something that would entail much planning & managing a lot of moving parts to pull it off profitably. Will definitely look into that, thanks", "score": 1, "replies": [{"body": "There's no way you are margin called when you're only using 10% of your Buy Power.\n\nIBKR is giving me buying power equivalent to 6x my account net value. I doubt there's any broker giving 10x or more.\n\nIf you're sitting at even <20% BPU if every single stock you sold a put on you were assigned, you'd still be able to take assignment on every single one of them.", "score": 1, "replies": [{"body": "Oh for sure, but I hate the idea of paying interest on margin so whenever assignment comes I’d rather liquidate shares to bring my margin balance to $0 than essentially take out a loan.", "score": 1, "replies": []}]}]}]}, {"body": "Pretty conservative approach . Not much can go wrong here unless you choose a bad underlying and it never recovers...\n\nYour deltas of .25 and .3 are pretty aggressive and you will definitely be assigned more frequently than you probably think, but if you're fine holding those positions then it's all good. \n\nAgain the only issue I see here is if the underlying you choose turns out to be a loser longterm. \n\nGoodluck!", "score": 2, "replies": []}, {"body": "If you are invested in mostly blue-chip stocks and only selling naked puts that put 10% of your overall portfolio at risk, then you are probably in a good position to boost your returns this way.  I suppose an overall market crash could wreck your strategy, but if that happens, we're all in a lot of trouble!  \n\n  \nI recently realized I could roll t-bills on my cash and add 5% to my returns on the cash I'm using to secure my puts.  I felt kind of stupid for not realizing sooner.", "score": 2, "replies": []}, {"body": "I'm doing something similar, my portfolio is 70% long SPY and QQQ, 30% cash. My cash is collecting money market rate \\~5%. I keep the cash on hand in case I decide to handle assignment on something I sold.\n\n1. I do 45 dte \\~.16 delta put, \\~.08 delta call short strangles on SPY and QQQ which I actively manage if needed (I don't take assignment on these)\n2. I write puts on sector ETFs and individual tickers (I mostly do ETFs, premium is way lower but not so many surprises there. I trade Oil, Gold, Utilities, Semiconductors, Materials & Retail ETFs.\n3. I write a whole lot of options on tech stocks - vertical credit spreads, short calls, short puts, iron condors, strangles, etc...\n4. I buy OTM VIX calls to hedge against an unexpected expansion in volatility.\n5. I keep my Buy Power Utilization (BPU) \\~20%\n\nAs long as you're keeping your BPU reasonable, you won't be liquidated out of your positions and circuit breakers will save you :D\n\nAs to advice for you - I think the deltas you are selling are a little high, this requires too much management and if many of your positions go against you (since .3 delta can get ugly pretty fast), you'll be forced to close for loss if you're actually not willing to take assignment and liquidate your stock holdings.\n\nAlso - not one of the stocks you mentioned I would be willing to hold long term but that's probably just me.", "score": 2, "replies": []}, {"body": ">most people here use > 30% of their AUM as collateral\n\nMost braggadocios newbs do this. Most people on here that have been doing this awhile do not.\n\n>The reason why I'm posting this is I struggle to see the downside of such an approach\n\nOf what approach, you haven't actually detailed anything beyond \"I will sell puts and realize the loss on the shares if assigned\" which is hardly a full strategy. Even if it was, the downside is the losses you just said you'd lock in.\n\n>I avoid assignment whenever possible by rolling losers out to reduce cost-basis, and worst case if I get assigned I just sell at most 10% of my account to cover - since my account is mostly blue-chip stock, I can't imagine it losing enough value to really fuck me over from margin/leverage\n\nSo if things keep moving against you a la 2008, you'll just keep liquidating? NOK is down like 20% in the last two days. F regularly swings 20% every couple months up and down. SOFI is a meme. Not sure why the \"free money\" alarm is going off if you're already seeing yourself losing money when these puts move against you.\n\nYou're all over the place. You mention \"whatever stocks I'm wheeling\" but then describe never taking assignment or if assigned just liquidating the position or liquidating part of another position to cover margin. You say \"until the inevitable rebound\" as if no company has ever gone bankrupt or even just stayed down. Then you also say you have cash to cover the margin call should one arise which goes against what you said about liquidating shares.\n\nIt sounds like you need to take a step back and reorganize your thoughts because you're kind of all over the place here. Yes, \"30-45 DTE, .25-.3 Delta, 40-70% IV, taking profits at 50%\" is a pretty standard trade but your actual management is all over the place. If you're looking to just boost the yield of your portfolio then treat cash secured puts as a way of adding to positions of things you'd want to buy anyway just at a lower price or for a little extra premium. Don't mingle naked put and cash secured puts mentally, they're different things.", "score": 0, "replies": []}, {"body": "Wait F, SOFI, NOK are safe long-term? MSFT is safe but F could easily go bankrupt...", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "18b4ls8", "created_utc": 1701753429.0, "score": 62, "upvote_ratio": 0.9, "num_comments": 11, "comments": [{"body": "I can't believe the stock market is blackmailing Elon Musk like this.", "score": 5, "replies": []}, {"body": "4 day’s so far", "score": 12, "replies": [{"body": "Homer telling to Bart", "score": 1, "replies": []}]}, {"body": "Is bob the only one selling?", "score": 2, "replies": []}, {"body": "Looks like Elon is projecting again having \"fun\" with his starship. Why doesn't he ride it?", "score": 2, "replies": [{"body": "oh i forgot he won't won't be a soy boi and shove it up his ass because it will blow up.", "score": 1, "replies": []}]}, {"body": "Still needs to go down another 80-85% but it’s a start.", "score": 2, "replies": []}, {"body": "Did you really think it would go up after his tourettes?", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|650|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "So buy the dip?", "score": 1, "replies": []}, {"body": "#Submission Vote Removed\nThis submission was voted *spam*.\n##Reasons\n\nLow Quality/Effort Meme", "score": 1, "replies": []}]}
{"title": "DISNEY AI future", "selftext": "**TLDR: AI is productivity boost, Disney will soon start using it and produce more content possibly better, considering nothing is worst than current writers**\n\n# Intro\n\n  \nMany people across the world have tried some AI tools, ChatGPT, Image generation and editing, voice AI etc.\n\nTo people who don't work with these tools for a clear purpose like work, these tools might be simple and will fade in time as people lose interest.\n\nBUT TO people who play with them for work it's life changing:\n\n\\- A programmer can learn new languages faster and have help from LLM and others for coding faster.\n\n\\- Kids in school&college are using LLMs to learn and help them finish school projects \n\n\\- Designer can edit photos faster, there's tools that help remove or add objects to the picture change the weather light effect etc.\n\n\\- Lyric writers can use LLM to generate lyrics out of the blue, or help finish their work.\n\n\\- Book writers can write faster with LLMs help, not necessarily use the whole text but get tips from it.\n\nAnd many more examples.\n\nThere's a clear productivity increase in the use of AI tools for work.\n\n# DISNEY + AI\n\nRegarding making new movies & shows, LLMs can help craft new stories and shape them to be better with better dialog.\n\nAI tool that generates images is already here. Soon we'll see video generation or movement of characters. These AI tools will help accelerate movie idea concept to reality. It will also help editing movies for release, as AI can make small adjustments faster and provide many solutions, user only needs to pick. \n\nDisney needs this desperatly and so does Netflix, both are platforms that want to provide as much content to their streaming platforms to justify their subscription program.\n\nSoon Disney earnings calls will start talking a lot more about AI integration, as it's already making moves on it.\n\n&#x200B;\n\nRegarding their parks, AI can help with photos of kids wearing superheros costumes, or make videos of them using powers in Disneyland. There's a whole can of ideas in making AI magic around the parks.\n\nSauce: [Disney launches an AI task force to implement the tech across the company](https://www.insiderintelligence.com/content/disney-launches-ai-task-force-implement-tech-across-company)\n\n[Disney explores AI to reimagine entertainment amid writers’ strike](https://www.edgemiddleeast.com/emergent-tech/disney-explores-ai-to-reimagine-entertainment-amid-writers-strike)\n\n&#x200B;\n\nI know there's a lot of drama currently in Mickey's Board, but I think It's something that will be sorted out, I'm focused on the future possibilities and AI brings a ton of opportunities to the entertainment industry.\n\n&#x200B;", "id": "18ba8ys", "created_utc": 1701776816.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 15, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|591|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: AI is a productivity boost, Disney will soon start using it and produce more content possibly better, considering nothing is worst than current writers.", "score": 1, "replies": []}, {"body": "Every day I am more happy that I didn’t invested in Disney.", "score": 11, "replies": []}, {"body": "Conversely, in a few years, what's to stop each user just generating a new episode in the style of frozen/ star wars etc. themselves directly whenever they want to watch it without paying the Mouse?", "score": 8, "replies": [{"body": "We’re in the Wild West early days of AI right now but all that IP is gunna be locked down so fast. Wouldn’t surprise me to see Disney release some type of AI movie app in the very distant future where users can do that type of thing. But only if they’re willing to pay like $8.99 for each character", "score": 3, "replies": []}]}, {"body": "Disney's largest content with any success is IP they do not own but have licensed from other sources.  The writers room is a political bullhorn that the common person has soured on and the writers being outclassed in product by ChatGPT is not hard.\n\nThe telltale sign of where Disney has its cancer will become evident in the next year.  Everything Disney has released was greenlit by Iger before his initial retirement.  Bob Chapek only greenlit one movie while he was CEO.  That movie is Deadpool 3 and will likely be the needed billion dollar blockbuster after a long string of movies that forfeit profits for pushing a message.\n\nThe board of Disney is not acting in the best interests of the shareholders.  They are facing multiple lawsuits.  Disney also has likely SEC violations with RCID based on the latest findings that investigated how RCID was ran off of Disney email addresses in selling muni bonds through JP Morgan.\n\nReimagine tomorrow without the destruction of every beloved IP in the last 50 years.", "score": 5, "replies": [{"body": "Deadpool is not for children, js.", "score": 1, "replies": [{"body": "Disney is not just a company that makes content for children.", "score": 1, "replies": [{"body": "Given the subject matter, it's worth noting Disney did not \"create\" the MCU or the SW franchise. Nevertheless, re-structuring was а top-level priority given the direction of the forecasted product line. If I grew up I wouldn't be а Toys'R' Us kid either.", "score": 2, "replies": []}]}]}]}, {"body": "Disney will use AI for some routine animation. But Disney will never have AI writing stories. \n\nAI, especially these early ones like ChatGPT, just aren’t creative. Try having ChatGPT write a story, then read it out loud. They’re absolutely terrible. \n\nI agree with you that AI will get integrated into Disney’s workflow, but there is no way ChatGPT is going to write the next Disney original movie. If it tries, it will be extremely bearish.", "score": 5, "replies": [{"body": "Disney is already kind of terrible right now.  They will probably use AI to write stories and scripts, but will have writers edit and change it to fit their “vision”", "score": 2, "replies": []}, {"body": "There’s a south park episode that did this and it’s objectively bad", "score": 1, "replies": []}]}, {"body": ">I think that Disney is definitely exploring the possibilities of AI, but I don't think they are ready to fully commit to it yet. They are probably waiting to see how other companies use AI before they make any major decisions.", "score": 2, "replies": []}, {"body": "Good stories have been told since before electricity. It’s about the culture, not technology. The purpose of the story not the profits.", "score": 1, "replies": []}, {"body": "One of the biggest dangers of AI is the normalization of mediocrity. It's a great tool, and very effective when used in conjunction with other tools. When it is used as the primary means of producing content, with uninformed direction by its user, the generated content is often pretty but full of uncanny valley errors and mistakes, not to mention being bound by its model set. Problem is, most users of AI are satisfied with the results and see it as completed work, because the costs (time, expertise) of finishing the product are seen as unnecessary, and would rather rely on the tech advancing then themselves. \n\nIt's definitely a cash cow, a new way of mass production for minimal costs. However, mass production doesn't always mean better quality then what has come before. In most cases, it means the opposite - sacrifice quality for lower cost and time. \n\nContent doesn't mean quality either. Do you want more 'content', or do you want more 'entertainment'?", "score": 0, "replies": [{"body": "When people start extolling the virtues of using AI to create things and how amazing it is I am forced to remind them your point about mediocrity.  If the person using it is not skilled in asking the question or generating the computer to think the product will be bad.  Or as we used to say \"Garbage in garbage out\"", "score": 2, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "18bc5f5", "created_utc": 1701783527.0, "score": 7, "upvote_ratio": 0.53, "num_comments": 18, "comments": [{"body": "Y’all be posting the most irrelevant bullshit, holy shit\n\nEdit: He sold 0.00147582697201% of his shares. You’re a fucking moron OP.", "score": 107, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|12787)", "score": 5, "replies": []}, {"body": "Actually, you're wrong. That is two decimal places too many. You need to multiply by 100. 🤓☝️", "score": 1, "replies": []}]}, {"body": "Why dont you just tell us that you’d like the price to go down so that you can buy in at a cheaper price. It would be easier", "score": 27, "replies": [{"body": "Maybe he bought in.", "score": 2, "replies": []}]}, {"body": "116,000 out of 78,600,000 shares. \n\nIn other words, nothing burger.", "score": 53, "replies": [{"body": "Into a trust nonetheless…", "score": 9, "replies": []}, {"body": "Wow dude is seriously wealthy, I found he owns 86 million shares in Nvidia, which at the current share price of $ 465 would amount to a net worth of $ 40 billion\n\nEdit: just confirmed my calculation on Forbes, his net worth is $ 40.6 billion", "score": 3, "replies": []}]}, {"body": "And the stock is up.\n\nMaybe it doesn't mean shit when insiders sell a tiny portion of their shares", "score": 7, "replies": []}, {"body": "He probably sold shares so he can buy calls", "score": 7, "replies": []}, {"body": "Thats just some cash for hookers and blow.", "score": 6, "replies": []}, {"body": "Guy needed cash to buy a house. Gtfo", "score": 3, "replies": []}, {"body": "Maybe he decided on an AMD build, too.", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|104|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 0, "replies": []}, {"body": "OP is such a chronic bagholder that he can't wrap his head around taking profits.", "score": 0, "replies": []}, {"body": "A lie can travel around the world and back again while the truth is looking for sneakers.", "score": -16, "replies": []}, {"body": "Oh no \n\nAnyway", "score": 1, "replies": []}]}
