{"title": "AMD up", "selftext": "Already up 4%. What up?\n\nEdit: 52 week high achieved  feels good man", "id": "4uim87", "created_utc": 1469453685.0, "score": 53, "upvote_ratio": 0.89, "num_comments": 89, "comments": [{"body": "Can we start a support group for people who sold at $5", "score": 39, "replies": [{"body": "can we start a support group for the one guy that told everyone he knew to buy it at 1.86 and sold himself at 2.80", "score": 7, "replies": [{"body": "I'm in @ 1.90 holding strong", "score": 1, "replies": []}]}, {"body": "I bought at 4 and sold at 5... Fuck me", "score": 2, "replies": [{"body": "you made a 25% profit man, you are crushing the market at large and the major indexes\n\neither you went total YOLO in which case you should be offering \"services\" to the luck gods and you got some more dry powder\n\nor you did crazy good DD and research, which you can apply to a different company\n\nfeel good basically", "score": 4, "replies": [{"body": "Then lost some on MSTX lmao", "score": 1, "replies": []}]}]}, {"body": "I sold at 5.70 and I hate my life rn ", "score": 1, "replies": []}, {"body": "Sold at $4.80 like a skiza. ", "score": 1, "replies": []}]}, {"body": "AMD the stock of the year? Congrats to anybody who had the courage to get in and stay in. It always looked high to me at any price point and yet it keeps going higher, lol.", "score": 21, "replies": []}, {"body": "The day after I give up on bagholding, it starts to skyrockets.\n\nSame with $LNKD. Bagheld for 2 months, sold on a Thursday, log on to see it go up 50%.\n\nBring 2017 already.", "score": 16, "replies": [{"body": "Tell me more about other positions of yours.", "score": 8, "replies": [{"body": "is this the birth of a new inverse prophet? ", "score": 8, "replies": []}, {"body": "Dumped all my $EBS and $TNP this morning.", "score": 1, "replies": []}]}, {"body": "Eh at least you didn't lose any money. Losing actual money is infinitely worse. ", "score": 3, "replies": []}, {"body": "Are you actually retarded?  The Quarterlies were just released after close the 21st.  Why would you have dropped it on Friday?", "score": 3, "replies": [{"body": "It dipped to $4.70 and hovered around $5.10 for the longest time.\n\nI had heard about how fast AMD was selling but constantly reading about what NVDA was up to and what their place in future tech would be and I didn't think AMD could stack against that. Given how NVDA was already taking off this  year and how it was only going to get better, I decided to back off AMD before it plateaued or got worse. \n\nInstead.......", "score": 3, "replies": [{"body": "THERE WERE SO MANY AMD BEARS GFY \n\nyou had balls to hold as long as you did. ", "score": 1, "replies": []}, {"body": "Going it by all the negative news and  media it just made it feel impossible to support AMD sometimes and Im still new to trading so I bought at 5.00 and… sold at … 5.10 …   thinking that I was avoiding a huge, inevitable drop after their earnings release\n\nNow Im HOLDING my $PTN that I bought at .53, lesson learned from $AMD", "score": 1, "replies": []}]}]}, {"body": "I had a limit set to $6.. Woke up, like my wife, disappointed. ", "score": 3, "replies": []}]}, {"body": "It'll probably drop a bit again as people realize their gains, but I'm long on this. ", "score": 15, "replies": [{"body": "How long?", "score": 2, "replies": [{"body": "Until I have to pull out the money to pay for my tuition lol. I have a large chunk of the money saved up to pay my next tuition bill in AMD. Been in since $2.62, so its paying off!", "score": 20, "replies": [{"body": "It's shit like this that gives me extra motivation to pull the trigger on risky trades. ", "score": 14, "replies": [{"body": "Are you saying $AMD is risky? Tons of indicators are showing that this has potential to hit $8-9 if not $10. I haven't seen much reason for the price to drop in the near future but if you guys are seeing anything of the sort, I would love to see analysis on it.", "score": 10, "replies": [{"body": "I'm saying putting your tuition money in any equity is risky. But the cool type of risky.", "score": 13, "replies": [{"body": "Dude what about YOLO. Gotta stick to our mantra. ", "score": 2, "replies": []}, {"body": "Like that guy who took out student loans and promptly lost them", "score": 2, "replies": []}]}, {"body": "Can you list the indicators?", "score": 1, "replies": []}, {"body": "Think so? Everything I read about amd is conflicting... Some very positive and very negative views. I've made money off amd trades a few times lately but right now I'm not holding...", "score": 1, "replies": [{"body": "What are some of the \"very negative\" views you're seeing? I'm planning on going in fairly long after the price dips hopefully this week.", "score": 3, "replies": []}]}]}]}]}, {"body": "7pm, thursday. ", "score": 1, "replies": []}]}]}, {"body": "If they truly get their act together, $10 is not impossible, no? I bought 1000 shares @ 5.06 and wish I'd bought 6000 instead.", "score": 12, "replies": [{"body": "Should I buy now?", "score": 7, "replies": [{"body": "Yes. Yes, you should. ", "score": 4, "replies": [{"body": "Why now? It peaked.", "score": 2, "replies": [{"body": "My sweet summer child", "score": 2, "replies": []}]}]}]}, {"body": "If it gets to 10, I'm probably cashing out. Will have made a hefty profit (for me) at that point.", "score": 2, "replies": [{"body": "AMD is going to $15", "score": 8, "replies": [{"body": "$30", "score": 4, "replies": [{"body": "$100", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Why not Mars?", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "link?", "score": 3, "replies": [{"body": "http://finance.yahoo.com/news/major-pachinko-pachislot-provider-selects-130000329.html\nAMD today announced that Sammy Corporation in Japan is using the AMD Embedded R-Series APU for its new pachislot machine, named \"Pachislot Hokuto no Ken: Shura no Kuni.\" Much like other gaming ...", "score": 5, "replies": [{"body": "No, like... when he asked for a link, he was trying to say \"PROVE IT FAGGOT!\" to you saying:\n\n> imup 5gs today", "score": 1, "replies": []}]}]}]}, {"body": "This will keep gradually go up till next earning. buy the dip. Can't wait for the hype articles to start with the new consoles and zen", "score": 8, "replies": []}, {"body": "And I limit sold at 5.91 to free up cash. Balls.", "score": 6, "replies": []}, {"body": "[removed]", "score": 7, "replies": []}, {"body": "Bought at a bad time years ago at 3.40, time to fuckin cash out. I'm glad I stuck it out when you went up to 5.50, AMD.", "score": 5, "replies": []}, {"body": "OMFG AMD, I've made some money off AMD over the last year, a few times, but I always pull out because its a sketchy stock. It's like that crazy unpredictable girlfriend that you keep coming back to. But between now and the next earnings... it'll be a gamble... To yolo or not, that is the question sometimes...", "score": 4, "replies": []}, {"body": "Bought in at the peak. Choo choo motherfuckers!", "score": 5, "replies": []}, {"body": "https://www.google.co.in/trends/explore#q=pc%20gaming\n\n$AMD GOING TO $20 PEOPLE", "score": 4, "replies": []}, {"body": "Just got in for toddlers amount of shares. Hoping to making back losses from NFLX, PYPL and YHOO", "score": 3, "replies": []}, {"body": "Anyone know a good stop loss or stop limit for AMD?", "score": 3, "replies": [{"body": "I had a sell at 6.6 triggered today just before lunch. Crazy. ", "score": 2, "replies": []}]}, {"body": "Lol I bought this morning and already up 5%", "score": 3, "replies": []}, {"body": "I bought some get ready for a crash people", "score": 3, "replies": []}, {"body": "That's right boys, suck it.\n\nAll aboard the SS Korean Waifu, next stop, Thailand for a little R&R.", "score": 4, "replies": []}, {"body": "Is this gonna be like NVDA where we just don't see a red day for months now? I want to buy puts, but I'm afraid the market is finally starting to consider AMD a solid company. I've only played them long, and made bank several times, so I'm hesitant to short this thing. \n\nEdit: I thought I was smart for having a limit order fill at $4.25 this morning.... fuck me.", "score": 2, "replies": [{"body": "I've played AMD twice before, several years ago when it was under $3. Did well once, got burned the other time. \n\nI think what keeps me from playing AMD is the fact that their fundamentals are shaky... very shaky. \n\nI don't have enough risk appetite for AMD, play at your own peril. ", "score": 4, "replies": [{"body": "What about their fundamentals are shaky in your opinion? If they didn't have such a bad reputation based on their past, I wouldn't have any hesitations buying in to them, even at their current price. their past performance is what makes me uneasy, but ignoring that they have a solid pipeline coming up. I'm worried that they are actually the real deal and I'm ignoring it based on my bias of the company.", "score": 2, "replies": [{"body": "They have an asston of debt (due in a few years), negative earnings, negative operating cash flow (their core businesses are not even making any money from a cash basis), a beast of a competitor that's Nvidia, and their semi-custom business isn't going to replace lost revenues from their GPU and CPU business. \n\nFurthermore, this week, the GTX 1060 was released... and guess what? It uses less power and offers more performance than the RX 480 while only costing $10 more. Plus gaming isn't going to save the declining PC business completely, I've read that the growth in PCs afforded by PC gaming has peaked or will peak soon. ", "score": 2, "replies": [{"body": "Do your research. 1060 is a stopgap and a panicked reaction to the RX480 killing it. 1060 is shite in DX12/Vulkan, aftermarket RX480's trade blow for blow with it in DX11, and mop the floor with it in DX12. Not only that, AMD cards get better with time, NVDA cards typically don't.\n\nSemi-Custom SOC's aren't just for gaming....\n\nAPU's and next-gen APU's aren't just for gaming/PC...\n\nAMD is coming to eat your lunch, baby.", "score": 5, "replies": []}, {"body": "See, I keep hearing everyone talking about graphics cards, AMD will always be the Toyota to NVDA's Lexus. That's fine. I think AMD cpu business is where most their revenue comes from. I may be mistaken, but off the cuff, isn't AMD used in MacBooks, Xbox, PlayStation.... I mean we're getting to a point where our fucking toasters will have a processor of some sort in a few years. AMD is the one to go to for that type of shit. No need for a fancy ass Intel processor. That's just my thoughts though. ", "score": 4, "replies": [{"body": "amd's margins on consoles are terribly small, console market is \"dying\", cpu are power inefficient and run hot as fuck (home pc) and like you said they make most of their money from their cpu business (servers), where they've fucked up at least 3 times this decade.\n\np.s. yes im salty i sold @ 6.13 this morning; w/e got in at 4.16", "score": 3, "replies": [{"body": "I think the margins on these next Gen consoles will be better. How much better is yet to be seen", "score": 2, "replies": []}, {"body": "On the other hand, the gaming PC market is up 28% YTY. Yes, their desktop CPUs do run hot, but they don't even make those anymore and their upcoming Zen parts are a completely different architecture on a new node. And no, they don't make any money on their server parts, right now their new server business is basically nonexistent with their minuscule market share derived from legacy racks that haven't been decommissioned.", "score": 1, "replies": []}]}, {"body": "Exactly. AMD is much like NVDA in that they are managing to branch their graphics business out into other things and new opportunities. NVDA has the car, CUDA, etc., AMD has APU's, cards perfectly suited for mining crypto, consoles, and more. I would be long both. If 100% of my portfolio wasn't AMD. AMD forever.", "score": 2, "replies": [{"body": "What are APUs used for other than mining?", "score": 1, "replies": []}]}, {"body": "You need to do more research man. AMD's fine as an educated YOLO based on technicals, but their future is kind of dim IMO. Perhaps they might be acquired, who knows. ", "score": 1, "replies": [{"body": "I think they will always need to exist. They're like the wal mart to the target. There can only be one like it (see K Mart), but there will always need to be a \"discount\" manufacturer of chips and cards. AMD is one of those that I can look at the numbers and get a feel, but thinking about their future, along with society's future, they're being underestimated. Still not sure I want to go long right now though.\n\n", "score": 2, "replies": [{"body": "You definitely should not go long. You seem to demonstrate a shaky grasp of how AMD works or why they are in their current predicament. ", "score": 0, "replies": [{"body": "I'm not going to say you're wrong, I just think you're thinking along the lines of every other investor. I'm just trying to think outside the box, and I think they still have more upside (very long term upside though).", "score": 2, "replies": [{"body": "AMD is good if you want to trade the short term, but if you are thinking about seriously investing in a company with declining earnings/revenue, a terrible balance sheet, and competes in an industry with entrenched competitors with superior products, you are delusional.", "score": 1, "replies": [{"body": "Well, I guess that's just like, your opinion man.", "score": 3, "replies": []}]}]}, {"body": "AMD's in the predicament they're in because of a really bad bet on a CPU architecture, which was compounded by turnstile leadership that consistently reached for the lowest common denominator. Lisa Su is turning that around, big time.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Easy slim, 2 green days in a row does not a NVDA make. Now if we're up tomorrow and wednesday, then come talk to me. I'll be at the asian massage parlor blowing bills. Long AMD since 3.60s", "score": 2, "replies": []}]}, {"body": "AMD fluctuates more than a x3 ETF. WTF", "score": 2, "replies": []}, {"body": "Cashing out my gains on Friday seemed like a great idea at the time. Oh well, still made profits.", "score": 2, "replies": []}, {"body": "In since $4.22 faggots lets goooo", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Sell your nvda soon (before earnings) and you'll continue to be a happy man.", "score": 1, "replies": [{"body": "Any particular reason why before earnings?", "score": 2, "replies": [{"body": "Nvda has sky rocketed for a long time now on no news. Sure they released their 1080 etc, but that was kinda expected (should have been priced in), and these new gen cards are not clear cut winners - least of all their 1060 is getting at best a on par rating with the 480. Meanwhile AMD is crushing it, which will mean stealing market share from Nvidia. Esp with the new SSG innovation from AMD.\n\nThey probably won't miss this qtr, but I expect them to lower guidance at least. The slightest negative news on nvda is going to send it tumbling. My target on the stock is $35.", "score": 0, "replies": [{"body": "Ohhh and I forgot to mention the fact nvda is doing all this rocketing on relatively low volume.", "score": 0, "replies": []}]}]}]}]}, {"body": "Jokes on them, I sold my stake when it \"peaked\" at 3.50", "score": 2, "replies": []}, {"body": "July 29th 6.00 calls YOLO ", "score": 2, "replies": []}, {"body": "Also... search google trends for \"pc gaming\". Yeah. It's making a huge comeback", "score": 2, "replies": []}, {"body": "People had the weekend to digest their earnings.", "score": 2, "replies": []}, {"body": "Jumped on it as soon as the market opened cause it was moving fast. ", "score": 1, "replies": []}, {"body": "All these massive sell offs around the same time are causing dips wherein the valuation of the stock is still worth more than what it is actually representing, therefore it will continue to gradually increase each quarter. I guarantee by Q4 2016/Q1 2017 it will be floating around $11 however, I can't expect it to go much higher than that.   ", "score": 1, "replies": []}]}
