{"title": "How far will AMD drop? Much Much Further", "selftext": "Look it up gents. we were above 15, only to have the release come out and reality sink in. That's right, we are past launch and back in the 13s, with the market opening today below 13.50. \n\nQuestion now is, how far will they drop and will it be a good buy? My guess is somewhere between their fair value (around 6/share) and the best case scenario with next earnings (12/share).\n\nEither way, I'm buying puts at open till their next earnings.......I'm not an AMD doubter believe it or not, hence why I'm closing my puts before the next earnings. Until then though.......lets not spam this sub with AMD stuff. It just ain't as cool now that it isn't in the midst of the bubble. Thanks fam", "id": "5x9ppl", "created_utc": 1488538133.0, "score": 70, "upvote_ratio": 0.76, "num_comments": 121, "comments": [{"body": "Short term it will drop, people will be trying to short and although the results of the launch are fantastic and AMD will be highly competitive with intel, they aren't better than intel in all regards. The hype question was how much better they were than intel.\n\n\nThe answer is; at worst ryzen is 20% slower, at best its the same performance for half the price, which is still huge. Personally I'm super happy with that.  As an investor, AMD simply caught up and have a lower priced product, but with that lower price comes lower profit margin. There is still a lot of valuation problems with AMD being 32 price to book value and its debt and profit margin issues. What this really needs is real analysis with numbers on the PC market and projecting for what AMD could make on Ryzen which is data I don't have.\n\n\n For now we have to account for a 6x rise in one year and a pull back is obvious. However, the very low value of $2 earlier this year was because there was no news of Ryzen and the company looked like it was close to going bankrupt, with more debt than assets which is a red flag, but also was not interpreted by the street as investing towards their new product line.\n\n\n I expect a slow decline to 9-10 followed by a longterm rise to 12-16 by end of year if it becomes clear ryzen CPUs are flying off the shelves.  Theres still loads more products comming out by end of year You also have to account for hype and popularity, sometimes things on the street are way off value but people like it so the price stays high.", "score": 60, "replies": [{"body": "People thoroughly caught up in the lackluster gaming results are overlooking the fact that Zen cores proved immensely efficient at lower clocks. Couple that with doing really well in professional tests, and that has serious implications for the much larger server market where perf/watt is king.\n\nNaples is gonna be the moneymaker.\n", "score": 18, "replies": [{"body": "> Naples is gonna be the moneymaker.\n\n# Naples is gonna be the moneymaker.\n\nNaples will make AMD a ton of money. Linux benchmarks are looking real good for AMD.", "score": 16, "replies": []}, {"body": "AMD only market at the moment is gaming.\n\n\nIntel has a strangle hold on the corp world.  ", "score": 4, "replies": [{"body": "That's because AMD did not have a competitive server chip. Now they do. Going from 0% market share to >0% market share is called an upside, friend.", "score": 4, "replies": []}]}, {"body": "> and that has serious implications for the much larger server market where perf/watt is king.\n\nI think you mean mobile market. AMD hasn't had any competitive CPUs for laptops/tablets in quite a while. Ya, they have APUs but those are selling in sub $500 laptops. They've literally left the entire market to Intel. That and data centers are where the growth currently is, not in desktops. AMD might be able to take a chunk of the desktop market but they haven't showed off anything for mobile yet which they'll need to really be successful. ", "score": 1, "replies": []}]}, {"body": "This is the DD I come for. ", "score": 6, "replies": []}, {"body": "I think it will go higher than $16 by the end of the year. AMD is a long term play.  Buying more once it hits $12. ", "score": 3, "replies": []}, {"body": "agree with all.", "score": 2, "replies": []}]}, {"body": "I'm in at 14.81 and am so thoroughly conflicted on hold or dump this fucker ", "score": 24, "replies": [{"body": "Same...14.68 and at a 3k loss", "score": 12, "replies": [{"body": "post loss?", "score": 0, "replies": []}]}, {"body": "I'd sell at least half at 12 if it's not showing signs of recovery. 14.80 is pretty high.", "score": 6, "replies": [{"body": "My ass is getting out at 13.anythingover50, buying BRK.B, and not opening the app for 3 months unless Buffet croaks. ", "score": 13, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "\"Ryzen doesn't live up the the hype\" well fuck you too\n\nAnd then I woke up this morning ", "score": 6, "replies": [{"body": "This is only a week or so after waking up to the decision about FNMA and seeing all of my green numbers being red.", "score": 3, "replies": []}]}]}]}]}, {"body": "same boat as you. just sold at $13. im off this fucker. luckily i was playing around with $2k and not $20k", "score": 3, "replies": []}, {"body": "I picked it up at 14.82. I waited weeks for a drop but it hadn't happened so I figured I'd grab a quick spike really quickly. I just bought a bunch more at $13 today to average at around $14. I'm staying in. I'm in no rush to sell.", "score": 2, "replies": [{"body": "13.99 average, gonna hold and probably even buy more on Monday if the price is still low", "score": 2, "replies": [{"body": "Big bounce up on monday as people digest how the release details didnt suck", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You're more stressed than I am dude take a breath. AMD isn't really a joke company anymore. It's not crazy to buy long term. I took a shot on Ryzen being a bigger hit than expected. I lost. Will probably bail out early market if it touches 14 at all, go buy BRK.B, learn that Buffet chokes on a carrot, and realize that even with one of the safest picks in the world I still can't make money. Then buy jnug and go out in a blaze of glory. ", "score": 25, "replies": [{"body": "buy high sell low, i like your style. \n\nalso news flash - it broke 14 yesterday and closed below 14.........soooooo you're kinda saying you will sell at open?", "score": -13, "replies": [{"body": "Tbh I'll sell if it touches 13.80-13.90 today and accept my losses ", "score": 7, "replies": [{"body": "its at 13.50 premarket.....so......", "score": -9, "replies": [{"body": ".....so....let's hope it fucking goes up idk what you want from me I'm hurting right now ", "score": 19, "replies": [{"body": "to re-evaluate your trade.\n\nyou only ever make money by learning, stop being such a prick and listen to the legit advice on this sub. not the memes and shitposts.\n\nprotip: if the moon is involved, be skeptical", "score": -19, "replies": [{"body": "I'm not trying to be a prick. AMD was a gamble and I'm young, I don't trade for a living, I'm willing to lose money to learn. This sub isn't the greatest for learning how to make money and invest, since it's essentially a go big or go home forum. When I want to invest for my retirement and that dumb shit I'll go to r/investing and buy Vanguard funds.\n\nEdit: yes I know the trade was fucking retarded by the way. ", "score": 15, "replies": [{"body": "thehood is being pretty brash but as a second opinion, that is a bad trade. Buying a stock right before a major event like earnings or product launch usually is literally gambling since its an uncertain event. Also, what about all the people who bought it a month ago at who knew exactly what you knew prior to the release on the 2nd? At the first shaky news they are going to dump to lock in profits, which will bring the price down. My best advice if you are new and don't trade often (more or less like me I've just done it 5 years) is just pick a few stocks and keep up with them. No more than 10 seriously. After a few months of watching you'll know when its time to go in or out. ", "score": 6, "replies": []}]}, {"body": "You're the one being a prick here", "score": 6, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I agree with a six dollar evaluation. Your gonna make a lot of monkey's butt hurt over that comment. ", "score": 31, "replies": [{"body": "haha we'll see......thats their fair valuation, but that doesn't include their newest releases. \"fair value\" for tech doesn't mean much.....I swear trying to speak reasonably with people here sometimes.....", "score": 12, "replies": [{"body": "Fair value is always weird with any tech company, the main reason being these industries have more potential to grow than companies that have already cornered the world/market like coca cola, mcdonalds, exon etc. Its all about valuating them at what they \"could\" be making 1, 2 or 10 years from now. Thats whats pushing those charts, not \"fair value\" unfortunately, as rational as that is. Though if you were good at knowing fair value and had years on your hand (which really you do) you could spot those good deals and hold them.", "score": 5, "replies": [{"body": "agreed. doesn't mean you can't play the swings", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "idk, why do you ask?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "oh is that they have dropped another 10%+ since my post?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "hmmm perhaps :) or maybe it will finally relax a bit. You know what they say, slow and steady gainz with crashes down", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "sure did, but stock prices move according to wall street supply and demand, not consumer supply and demand. WS has had this factored in for a while now, so until the financial numbers come out (or analysts begin doing expectations of financial numbers) it is all hype. Even the best stocks/companies are subject to the buyers and sellers of walls street.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "wall street did :)\n\nthe stock traded well within range, if it was new news, there would be a reaction positive or negative. this is also demonstrated when ryzen was released. there was no crazy reaction, only leading up to the release because people were riding \"hype\", hence the \"sell the news\" mantra, wall street knows these things well in advance - if the IC has leaks like crazy, imagine how easy it is to find information on ANYTHING given a multi billion dollar company's resources and connections.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "intel community.\n\nthey will - but its factored in which is why the stock didn't move on release days. stock prices move based on things getting factored in before most common folk (including me) even learn about the possibility ", "score": 2, "replies": []}, {"body": "all this said. today is looking like a nice pop day, I may buy weekly calls to turn a quick profit", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Buy the rumor sell the news.  The Ryzen hype is dead, the test now is if Ryzen can make inroads in Intel's marketspace.  Based on performance and the fact that it consumes less energy (huge for data centers) I'm bullish long term.\nAlso looking at the chart for the past year the 2 major AMD dips lasted about a week.  If the trend holds I'd say AMD is about to bottom out around Wednesday next week and then start to recover.  \nBut that's just my $0.02", "score": 12, "replies": [{"body": "I agree, I will be selling some to lock in profits and will be looking to buy again after the hype deflation ends and we're back on track with Ryzen and the future lineup still being fantastic competition to intel. ", "score": 4, "replies": [{"body": "Gonna cash out my AMD shares and buy some call options next week.  Still haven't made up my mind on the specifics but probably strike price around $18 for October 2017.", "score": 2, "replies": [{"body": "Isnt 18 too far otm for an 8 month period? That is nearly 33.33% appreciation.", "score": 3, "replies": [{"body": "Good point but considering AMD's growth rate and the market share they can get into I think it has potential.", "score": 3, "replies": [{"body": "18 is a good strike I don't think it will hit it though until after Q3 ER when Vega scorpio naples are out and numbers are in.", "score": 2, "replies": [{"body": "Holding 5 $16 calls for October 2017. This makes me feel better.", "score": 2, "replies": [{"body": "I went to Jan 2018, have 2 $15 calls. Selling calls against them along the way. If it's above $17 or so at that point, I'll probably exercise depending on where it looks like AMD is going. I'd be comfortable holding for a few years and selling covered calls.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I'm pretty sure I saw an evaluation at 5.56 yesterday. If we add in potential for upcoming products. What do you think 8-10 dollar range? If drops to around 10 I'll jump in on the hype train.", "score": 4, "replies": [{"body": "my PT for now is 10, ill close my puts then for cost basis then let the rest ride. i doubt it hits 8, i would consider longing it only if then", "score": 2, "replies": []}]}, {"body": "The reason WSB can't pick winners is they hold losers until they go bankrupt and they hold winners until they become losers.", "score": 3, "replies": [{"body": "haha i would agree with that. we don't invest well. we trade well but then forget we ever had a price target ", "score": 3, "replies": []}]}, {"body": "Everyone saying you saw evaluations of $6. Do you have a link for this?", "score": 2, "replies": [{"body": "It's just to scare the shit out of you. It will dip probably up till Monday. Shorted this bad boy at opening bell. ", "score": 5, "replies": []}, {"body": "trefis for one.", "score": 1, "replies": []}]}, {"body": "Apparently you aren't a dgen bag holder. Why not buy shares and sell calls? Collect that premium ", "score": 2, "replies": [{"body": "you don't do covered calls when you're bearish. CCs are neutral/slightly bullish\n\nthe safe play here is selling 15 call spread", "score": 2, "replies": [{"body": " It bullish long term and bearish short term. You can collect weekly premium on AMD if it keeps falling while holding your initial investment \nLess risk imo", "score": 2, "replies": [{"body": "mathematics disagree with you but more power to ya. check out some options books, they really helped me understand the pitfall thinking in covered calls.\n\nlearn the total return principal in covered calls", "score": 2, "replies": [{"body": "I guess if your buying $10k in stock as opposed to $1k then covered calls aren't really going to work. And yes total return on puts is substantially higher than stock plus covered calls but the risk is way higher. ", "score": 1, "replies": [{"body": "so many things that you say confuse me", "score": 2, "replies": []}]}]}, {"body": "It' not bearish short term... a covered call is the exact same profile as selling a put.", "score": 1, "replies": [{"body": "Yea but you profit off short seem drop in price. To cover losses in equity position. Obviously if one thought the price would be cut in half you would want to sell your long position and buy puts. ", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Sell 12.50 puts. Then if it doesn't hit 12.50, you make free money. If it does, you were going to buy there anyway.", "score": 2, "replies": []}, {"body": "thatd be safer. you're timing was impeccable. have you considered leveraging with options?", "score": 1, "replies": []}]}, {"body": "HOLY SHIT a correction?!?! Who ever heard of such a thing?", "score": 2, "replies": [{"body": "i agree but WSB was acting like they never had and that it would be minor if even happened", "score": 2, "replies": [{"body": "Children of summer", "score": 1, "replies": []}]}, {"body": "TIL correction is hype news falling flat. ", "score": 1, "replies": []}]}, {"body": "Their product did not live up to the hype, AMD was based on hype. Time to short", "score": 2, "replies": []}, {"body": "Buy the dip got it", "score": 2, "replies": []}, {"body": "Annnnnny minuete nooooooooowwwww", "score": 2, "replies": [{"body": "? whats that?", "score": 1, "replies": []}]}, {"body": "You think the stock is going to drop by more than half? Even with the number of people that bought on hype I don't think that's accurate.", "score": 3, "replies": [{"body": "i used the word bubble for a reason, bubbles are usually 40%+\n\novervalued? i think not.", "score": 3, "replies": []}]}, {"body": "Sold all shares at 13.49 in my regular account and Accepting a 170$ loss. Going to look for a re-entry point closer to earnings. Still holding 100 shares in the IRA @ 12.24 for now\n\nEdit: all shares gone for now, as someone said earlier, I'm still very excited about AMD, things just need to settle before heading into earnings and further product release before re-entry. Grats to those who bought in much lower and is taking profits", "score": 1, "replies": []}, {"body": "Stop last at $12.75. Will make enough for a case of beer if it keeps on dropping...", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "no reason for disappointment. almost doubled your cash. in all honesty, i wouldve peaced the fuck out at $14.50 if i wouldve been you", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "did it recently with ACBFF. bought in at $1.61, was thinking of selling at $2.15 for some quick profit then it took a hit and i got out at $1.91... sometimes it just pays to not be so greedy", "score": 1, "replies": []}]}]}]}, {"body": "Jumped in to follow the asks and bids. Noticed that the trefis valuation has jumped to 8.28. Pretty sure that's where I saw the valuation of 5 dollars and change yesterday. Just passing on info. ", "score": 1, "replies": [{"body": "ooo didnt know it changed. thanks for the update. ", "score": 1, "replies": []}]}, {"body": "Bought the dip in the low 13s and sold covered calls 'til next earnings.", "score": 1, "replies": [{"body": "safe. i like it. you rolling your calls yet?", "score": 1, "replies": []}]}, {"body": "In @ 14.50. Launch date postponed 6 months - 1yr. ", "score": 1, "replies": [{"body": "that i agree with", "score": 1, "replies": []}]}, {"body": "Meh, I'm sitting here with my money in the event it hits below $11 again.  Until then, I'll play with other stocks.", "score": 1, "replies": []}, {"body": "dumped my final 800 shares (2k total) this am after 100% gains. there are a couple bad signs for this short term.\n\n1. 18% short float. no matter how you spin it the shorts will crush this stock short term after horrible pr yday and also that it's still up ~20% ytd on the hype of ryzen.\n2. 700% in a yr. lt gains are coming up for early buyers so people will dip out and move the money to other sectors that can guarantee returns ie banking.\n3. downward momentum and hype. let's be honest this is a factor. was a factor up and will be a factor down. \n4. no new releases for awhile.\n5. rate hike\n6. but everybody said  pre-orders are sold out. awesome news..anybody know how many each supplier had? companies limit their pre-orders so they sell out. wouldn't be surprised if amd did too. we won't know how good the sales were until q1 ER...in may.\n\npossible good news::\n1. amd was right and their chip just needed to be optimized, even then still subpar performance to intel but it increased performance by 50%. 10%+ gain. \n2. Intel licensing deal - maybe it's a great deal for amd\n3. patent lawsuit settlements\n4. ai/ml deals get inked after seeing perf/$ of ryzen\n\ngiven the reviews I don't believe the new releases will come close to intel's gaming chip and that's fine bc this wasn't meant to be a great gaming chip - r3/r5 will need to be better. multi core gaming..nobody does this yet. way of the future - I hope so. 4k gaming- yes, please but millenials are poor after buying amd at 15 and selling at 12.95.\n\nvega - can we trust anything amd says anymore? also, nvda just cut their top end card in half. bad, bad news for vega profitably on its own.\n\nNaples - success!! we have a winner. however it's a long term play and I'll rebuy at a lower price after another 1.5-2 dollar drop. \n\ngl to everybody. I love amd but I choose my money first. moved to bac warrants and already up 3%.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "posted it above. TREFIS - it was recently (like yesterday) updated to around 8, it was at 5.73 before then", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "my understanding is that it will take time. hence the close before earnings approach. \n\nwtf do you want? some next level DD? ", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Spell it with me, S-t-o-c-k-t-w-a-t-s! Now try it again.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "too many words kthnxbye", "score": 1, "replies": []}]}]}]}]}]}, {"body": "PUTS on the dead cat bounce the next couple weeks - cover expenses in the pre-earnings drop, sell the rest if they drop, else nothing lost.", "score": 1, "replies": [{"body": "yup. idk if i would call it a dead cat bounce tho", "score": 1, "replies": [{"body": "I figure its going to drop a bit, people are going to buy the dip until 15, then bears take over.", "score": 1, "replies": []}]}]}, {"body": "Ryzen is selling out, and even the 1700X looks like it could compete in the server space, which means Naples will **crush**.", "score": 1, "replies": []}, {"body": "amd doing a slight recovery. GO go go! ", "score": 1, "replies": []}, {"body": "FML I bought at $14.70 on 2/28 using unsettled funds. I don't think I can sell it until Monday. I'm not sure how T+3 works. Are funds settled on the 3rd business day, or after the 3rd business day? I wanna cut my losses, but I don't want a 90 trading restriction.", "score": 1, "replies": [{"body": "take the violation, it aint that big a deal. you can always just get margin or go to a diff broker", "score": 2, "replies": []}]}, {"body": "its a head fake/general market upset. all is well. buy the dip.", "score": -1, "replies": [{"body": "how many dips does this make it? after product release? hmmmmm", "score": 3, "replies": []}, {"body": "i also disagree... i dont think itll fall as low as $6, but i think dust may settle around $11", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "it may be up there but im still right?\n\ni can be an asshole. i dont care much sorry?", "score": 1, "replies": [{"body": "> how far will they drop and will it be a good buy? My guess is somewhere between their fair value (around 6/share)\n\nThis is what makes me think you're just making stuff up. Sure the fair value is 6/share but you think the shares will drop ~40% till earnings in mid-april when we have naples, vega and more coming up? Also, the launch wasn't half bad as you noted yourself - this is more like a sell the news event. I'd wager we'll test 11 but not below 10 till earnings and from then it depends on how the new products do and how ryzen and vega sales go on.\n\nAnother huge chunk that most autists here fail to notice is that either console generation is using AMD chips (Switch doesn't deserve the \"console\" title imho) and we have xbox scorpio launch lined up for this year. Even though it is a low margin business, it helps with developer optimizations and marketshare.", "score": 3, "replies": [{"body": "6 is my lowest of the low end. also, someone just tipped me that trefis changed to 8, so i should really raise my expectations to between 8-12", "score": 1, "replies": []}]}]}]}, {"body": "**AVERAGE DOWN MOTHERFUCKER**\n\nAlso, is not \"AMD drop\" the whole market has been down, look at NVDA too. ", "score": -1, "replies": [{"body": "nvda and amd correlation are .97\n\nthe whole market aint down like amd be down, cant deny that. also, amd was down when market was up", "score": 2, "replies": [{"body": "> the whole market aint down like amd be down\n\nDuuh.... The whole market doesn't have the same delta or Volatilityvolatility\n\n> amd was down when market was up\n\nWhen was that? please don't tell me premarket.", "score": -1, "replies": [{"body": "march 1st, it was kinda up alot.....", "score": 2, "replies": []}]}]}]}, {"body": "selll sell sell", "score": 0, "replies": []}, {"body": "People talk about to sell it. But my guess it means nothing. While it's a strong hold. ", "score": 0, "replies": []}, {"body": "I see some bad reviews popping up here and there (this one is from newegg):\n\n   Pros: What pros? If I could return it for a refund would have been a pro.\n\n   Cons: Horrible overclocking ability, 95w TDP is idle not load. Only supports low speed DDR 4 ram and only two of the four slots on all motherboards are working. I could go on and on how bad this cpu really is but that would take more than 5000 letters.\n\n   Other Thoughts: AMD had 5 years to get this right and they blew it. Why have such a high end cpu only support dual channel and not even fully support all of the memory slots. The motherboard manufacturers all got the same data from AMD.\n   I doubt this is going to get resolved and we are stuck with bad cpu's that we cannot return for a refund.\n  Developers are not going to go out of their way to take the extra expense to write code to support this CPU. A few      that AMD pays to do it maybe. I had to buy another motherboard from a local store so I had one ready to test since the one I ordered from Newegg won't be here until March 6th or 7th. Updated the latest bios and still only 2 memory slots are working correctly. I should have known better due to AMD's reputation \"The Yugo of computer platforms\". This cpu line should have been the iteration of Piledriver and code named Pileofcrap. At least I can make a file server out of it since I can't return it. Does not even deserve one egg to be honest but I can't post without an egg, so AMD gets one undeserved egg.\n\n", "score": 0, "replies": [{"body": "brutal. thanks for the c+v", "score": 2, "replies": [{"body": "Well its just one opinion out of many and there are also positive user reviews of course. But whoever is buying Ryzen right now is beta testing it. I've seen most comments are related to RAM and a lot of combinations don't work (if you're unlucky and brought the wrong RAM your system doesn't boot), on the other hand a lot of motherboard manufactures issued BIOS updates, so that might fix it. ", "score": 0, "replies": []}]}]}]}
{"title": "Why I'm still long AMD.", "selftext": "Ok, so the market didn't recieve Ryzen well. Why? The 7700K. \nIntel's $300-350 chip beats AMD's $500 chip in gaming and other low threaded applications, that's a fact. They seem to forget that in multithreaded workstation/HPC apps, Ryzen is beating Intel's $1k 6900K. There's a big picture here that people are missing, Zen is a key part in what is a top to bottom attack on Intel.\n\nDie size:\nThis is absolutely huge (or should I say small) and yet I see very little mention of this. Compare transistor counts and die sizes between Ryzen and Broadwell-E (which is also 14nm)and you'll find that AMD has over 50% more transistors per mm^2 than Intel. That's important. The Zen core is basically half the size of Broadwell. Smaller cores = more per wafer = cheaper chips = larger margins and/or more competetive pricing. Yes, some of this margin is lost by not having in-house fab but it's still a significant advantage.\n\nInfinity Fabric:\nRyzen core scaling beats Intel hands down. This is largly due to the \"infinity fabric\" interconnect for on-die communications. This enables better scaling and makes for a more forward looking architecture.\n\nNeural Network Branch Prediction:\nYet another forward looking technology like infinity fabric that gives more room for improvement in future revisions.\n\nNaples:\nThat die size advantage I mentioned? Yeah, that's gonna be a huge advantage on Naples which is their 32 core server chip. Intel's 32 cores are expensive monsters whereas Naples is going to be half the size (so presumably much cheaper), with better scaling due to infnity fabric and lower power consumption. Naples should outperform Intel's 32 core offering in every metric. This is going to bring the biggest change to AMD's bottom line. Even just taking 5-10% of the server market from Intel doubles AMDs revenue and I think that's completely possible with Naples.\n\nAPUs:\nOnce again, there's a big advantage from the smaller die size here. A 4C/8T APU is going to have tons of space for a GPU. We're likely going to see an APU that for the first time has an enthusiast class GPU integrated in it. The low/mid range APUs will also be big in the \"Best Buy\" market of preconfigured PCs from Dell/Asus/HP etc because of the performance/price they will offer.\n\nConsoles:\nAMD owns the console market. They have 8 core chips in both the PS4 and Xbox One. This means more developer support. It's a great way to get people coding for their hardware and to push more multithreading. Between this and the fact that 8 core desktop CPUs are now affordable at $330, you're gonna see future games/applications support more multithreading meaning 8 core Ryzens will age better than the 7700K.\n\nZen+:\nRyzen is just the start. Being a totally new, forward looking architecture, there's plenty of room for improvement. I would not be surprised to see a 20-25% improvement here; engineers have already stated they've identified the weak points in the architecture. Meanwhile everything in Intel's roadmap is just more 5% increases on architectures they've been rehashing for years. Zen+ isn't far off either, currently rumored mid 2018.\n\nTLDR; Over the next few months, AMD is about to have a competetive answer to Intel at every pricepoint and all of their solutions will be cheaper due to a significantly more compact design.\n\n\n\n", "id": "5xbav0", "created_utc": 1488558512.0, "score": 84, "upvote_ratio": 0.83, "num_comments": 110, "comments": [{"body": "Agreed 100%, I have 800 shares I'm long all the way, but our fellow fags with 20 shares are freaking out because they just lost one nights worth of flipping burgers ", "score": 76, "replies": [{"body": "I was in 1200+. Sold, waiting for this bloodbath to stop and buying back in. One way or another, I'm gonna be back in before the next earnings.", "score": 14, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I'll be watching Monday morning. Not sure I'm comfortable yet at $13. Just a month and a half ago it was at $10, meaning Ryzen hype priced in about $5. Wouldn't be too surprised if we see $12 or $11 again.", "score": 3, "replies": [{"body": "Good explanation Op, and Agreed, bought 50 @ 14, gonna buy another 50 if to dips too 12-11. ", "score": 1, "replies": []}]}]}, {"body": "Doing the exact same as you, sold out at barely 200$ profit (was in 1500 shares) to prevent any potential loss in this shit storm. Gonna buy back in when the dust settles before earnings cause I expect them to beat estimates. \n\nEdit: I see estimates for next quarters are lower than the previous quarter... they should beat this est by a larger margin than usual no? Id see that trigger a spike in the share price. Wrong?", "score": 2, "replies": [{"body": "I sold out first thing this morning when it looked like another red day.\n\nI'd have sold yesterday but got busy in damn meetings at work. I'm an idiot for not having a stop loss set going into the release of the reviews.", "score": 3, "replies": [{"body": "So you're not long", "score": 2, "replies": [{"body": "That doesn't mean hes not long. If you know it'll keep going down. Stop your loss then re-buy all your shares at a cheaper price. ", "score": 6, "replies": [{"body": "Yes, I'll be buying back in, thus further increasing my long position.", "score": 1, "replies": [{"body": "I plan on doing exactly the same. Depending on how monday goes. ", "score": 2, "replies": []}]}]}]}]}, {"body": "When do you think that will be? I have orders at 12.75 for 40 shares and another 40 at 12.20. Think it'll drop that far?", "score": 0, "replies": [{"body": "80 shares is like 1k lol. buy options.", "score": 2, "replies": [{"body": "I'm well aware how much 80 shares is. ", "score": 2, "replies": []}]}, {"body": "Might be, that's what I'm afraid of. Personally I think AMD will do good in the long run based on the release, but due to all the hype that was it might take some time for it to die down... I'm probably not gonna try to get in at all next week, I am going to try to wait until it's not so volatile any more (i.e. going up/down 7% every day) and wait for it to start climbing before I get in, I think at that point the hype around Ryzen is no longer in the stock price meaning that I can potentially ride the hype for the next releases AMD have, hopefully out the year unless this happens all over again.\n\nI don't even want to try to estimate what it can end up on right now though, I have no idea honestly. Maybe it turns already this money, maybe it's going down towards 11. No idea.", "score": 1, "replies": []}]}]}, {"body": "Same, sold out today 1000 profit, will buy back in during the coming weeks hopefully between 9-11.50", "score": 1, "replies": []}, {"body": "I was in 2.5k shares at 9.3. I jumped out today after holding and averaging up for many months. It was a sad sad day. Truthfully I see it going back to 10-11 before earning. Then there's a chance it will stay there or pop a little. But 15 is as high as we'll be all year. It was very very important for that fucking $350 chip to do as they hyped it to do. It's too bad ", "score": 1, "replies": []}]}]}, {"body": "Market is overreacting to even the slightest negative news.\n\nThe 7700K also outperforms the 6900K in games too, even thought the 6900K costs 3x as much.  \n\nRyzen is fucking brilliant as workstation applications, ridiculously cheap for outstanding performance. ", "score": 15, "replies": [{"body": "I guess that overreacting is to be expected considering how much hype got priced in, but yea.", "score": 6, "replies": []}, {"body": "Because Wall Street expects flawless execution in every metric when a stock runs 500%.  When a company stumbles even a bit it is magnified with all of the run up needing to be justified. Reviews weren't as perfect as investors would have liked.  Simple as that.  It might be something they can fix \"quickly\", but that isn't what investors want to hear.  ", "score": 3, "replies": []}]}, {"body": "Also, let's not forget the small fact that AMD sold out of a rumored 1M of these on launch day.\n\nAt an average price of $410 and using the gross margin figure of 30% from their financials, launch day alone shit out $123M profit on AMD.", "score": 11, "replies": [{"body": "Would this show up in April earnings or July? ", "score": 2, "replies": [{"body": "Q1 includes March so I would say Q1 report in April. At the very least, the forecast in April's report should be positive.", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Depends on the year, make, and model. Unfortunately, catalytic converters make death by CO a lot harder these days.", "score": 2, "replies": []}, {"body": "Personally I think it's going back up well past that eventually but may go lower in the coming week/month first.", "score": 1, "replies": []}]}]}]}, {"body": "Source on them selling 1M on launch day?", "score": 1, "replies": [{"body": "http://www.guru3d.com/news-story/first-amd-ryzen-shipment-batch-entails-one-million-processors.html", "score": 2, "replies": []}]}, {"body": "How much does AMD profit from motherboard sales? I'm assuming they take a cut, no?", "score": 1, "replies": [{"body": "Not much, if at all. The chipsets are made by a 3rd party.", "score": 1, "replies": [{"body": "Well technically everything is made by a 3rd party since AMD isn't a real fab company. I would assume they take a certain percentage off each sale, right? Or do you think it's just so minimal, it's meaningless", "score": 1, "replies": [{"body": "Made as in the 3rd party company actually designed and sells the chips. Asmedia. So as I said, AMD is either getting nothing or a small licensing fee.", "score": 1, "replies": [{"body": "o ok, thx", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The longer the explanation and rational the more likely the success  ", "score": 7, "replies": []}, {"body": "I'm down on my existing positions for now, but I'm fucking hyped to buy JAN18@15 calls at wholesale.\n\nI did a little bit of DD and speculated on what Intel could respond with, short term they've got nothing to deal with R5 except for more price cuts on the 7700k. If the l33t gam3r crowd can buy a sub $300 chip that's competitive I think they'll finally stop whining.\n\nAlso Cannonlake is turning out such low yields at 10nm that they're going to be used for low-power SoC stuff instead. That is, no desktop processors at 10nm. They're doing yet another optimization at 14nm and calling it Coffee lake, on the same architecture they've been doing this to for like what, 7 years now? Oh and that's not even expected to come out until 2018.\n\nI honestly have no idea what Intel is going to do with the desktop market, but it sounds like they're more or less willing to give it away to AMD while they focus on data center, FPGA / IoT and 5g in the future. That is unless they also build something from the ground up because it sure seems like they've hit diminishing returns with their die shrinks and optimizations.\n\nAnd if this is the case, I think Intel is going to slowly adopt ARM over X86 for most of their products. ", "score": 6, "replies": []}, {"body": "I will repeat myself again. AMD's and Intel's revenue come from companies who buy in Bulk, either for use or for resell. The companies that buy it for use are currently with Intel, they find it reliable and at a good price, they don't spend too much energy and they don't overheat.\n\nAMD on the other hand, has had problems in the past with overheating, and breaking. The companies don't want to buy AMD for cheaper, then have to pay for the maintenance.\n\nThey will stick to whatever they currently have. \"If it ain't broke, don't fix it\", Intel is working fine for them, and the price is fair, so they won't switch unless AMD provides low power processors (Low wattage), at a fair price and with no overheating issues.\n\nI'm not saying that AMD will go BK, I'm just saying that it will be a lengthy process that depends on AMDs performance through the years (They need to keep their products with no problems, low wattage and cheap for multiple years in a row).\n\nOnce they start doing this, they will be a worthy competitor for Intel, until then they are just jetlagging.\n\nAMD's earnings will probably be good enough, and beat. But not to the point where they are a Blue chip like intel, and definitely not to the point that this sub is expecting.\n\n#You CAN'T forget that they are still 1 Bil in debt, and their market cap is just 11.6Bn. So even IF they start doing good, cheap, low wattage products, they still need to (two things), Fix their debt, and fix their reputation, which is set in stone as of right now.", "score": 18, "replies": [{"body": "Great points. I think if AMD can compete on price, that will prove good in the long run. I think you may underestimate how many procurement departments tell IT to fuck off and just go on price. ", "score": 4, "replies": [{"body": "Eh, I'm talking about Normal Conditions. There can obviously be catalysts, but one's reputation isn't fixed overnight.\n\nEven if they do a processor with absolutely no flaws right now, and sell it for very little, they will still not win over the bulk-buyers. They **want something reliable**.", "score": 2, "replies": [{"body": "As an engineer for a government contracted company, I fully understand this point. So many times where us engineers argue for a better solution and get shot down.\n\nI think Naples is going to be pretty hard for anyone to argue against though if it performs as I expect it to, extrapolating from Ryzen performance. Even the non-technical people are gonna get drawn in if you can say hey, it's faster, cooler oh and cheaper too.", "score": 3, "replies": []}]}]}, {"body": "I fully agree that they are struggling now between a bad reputation and lots of debt. My argument here is that Ryzen and all the products related to it are going to go a looooooong way to turning that around. They've become immediately relevant again and in the next year will go from relevant to outright beating Intel in most metrics at most pricepoints.", "score": 6, "replies": [{"body": "As I said, as long as they keep this wave of APPARENTLY-GOOD products, with no major failures, they are fine in the long run.", "score": 2, "replies": [{"body": "with Vega they might be able to sway big bulk retailers on GPU/CPU builds that are actually compelling.\n\nBut who knows. They could just as easily fuck it all up. ", "score": 1, "replies": []}]}]}, {"body": ">overheating, and breaking\n\nFucking what?\n\nThe reason why a lot of OEMs ended up using Intel was because Intel illegally bought out OEMs so they wouldn't use AMD chips, and they got fucking sued for it too.\n\nhttp://i.imgur.com/XLespRl.png\n\nIntel is a morally bankrupt, criminal organisation.", "score": 7, "replies": [{"body": "That has nothing to do with stock performance. I'll buy the shit out of a morally bankrupt, criminal organization if they give good dividends or show great growth potential. the fuck you talking about. ", "score": 5, "replies": []}]}, {"body": "Sounds like a good time for a secondary offering. Dilute stock 10% and pay off debt. \n", "score": 2, "replies": []}, {"body": "if you relied on a broad debt fundmental like this you would have not bought amd in 2016 or 2017 and missed easy returns. their debt picture has improved drastically and they have done a great job restructuring it into long term debt at low rates. \n\n I agree with the majority of what you said but you forgot one thing - datacenters are not shrinking or remaining flat, the overall pie is expanding so there is more to grab. this will continue for the foreseeable future as AI and ML become more prevalent. amd has a very bright future. I am an amd fan but still see more short tern downside ahead. imo this goes under 12 by the end of the month. ", "score": 2, "replies": []}, {"body": ">AMD on the other hand, has had problems in the past with overheating, and breaking.\n\n>Intel is working fine for them, and the price is fair, so they won't switch unless AMD provides low power processors (Low wattage)\n\nNot sure if this is some kind of joke, but Intel has had issues with overheating and breaking too.  One of the key points of the new AMD lineup is the low power draw.  They 1700 has a 65W TDP, compared to a 7700K with a TDP of 91W.\n\nThey also destroy Intel in everything outside of gaming, for much, much cheaper than the competition (a 1700x competes with an Intel 6900K for 1/3rd of the price).  The only thing people are annoyed at now is the gaming performance when compared to a processor with high single threaded performance like the 7700K, AMD beats them at everything else.\n\nHonestly, it doesn't sound like you really know what you're talking about in terms of the technical side of things.", "score": 2, "replies": [{"body": "In my opinion AMD got their reputation for heat issues from the fact that their chips have historically had higher overclock windows than Intel's. People would push a 15% OC on stock cooling, run into trouble, then blame AMD.", "score": 1, "replies": []}]}, {"body": "LOL since when does debt matter . US gov is 20T in debt and stock price has far outpaced earnings growth . At least AMD will have positive net income and possibly skyrocket if they breakup intel's monopoly in server CPUs. Corporations like google and Microsoft don't have brand loyalty, they view it from a factual basis. CFOs will be foaming at the mouth at the thought of saving $500M on their capex.", "score": 1, "replies": []}]}, {"body": "i appreciate your details about the chips themselves but i think you are missing the broader point.\n\nthis is just a sell the news event.\n\nwhich cars are amd in? which VR systems? which deep learning platforms use AMD? which cloud services use AMD? it doesnt matter if it is better for gaming right now. something else will be better in 6 months.\n\ni think they just got hype for competing with companies (even being better) that have strong financials... but they dont have the same revenue channels. not even close.\n\nso sure its a small victory. but even nxpi and qcom and these other semis that actually sell their chips for mass produced items seem far more attractive.\n\ni think HP and baba use some amd, google too im sure. but the bulk of the backbone of clouds are not AMD.", "score": 4, "replies": [{"body": "Which is why naples could be such a big deal, they have less then 1% of market share in the server space if they can increase that by any amount the companies value will shoot up due to their low market cap.", "score": 7, "replies": [{"body": "> naples \n\nim not fully informed but wasnt this worse than the intel counterparts. the hope was that the 2017 series and 2018/19 would do better and this was the starting point?\n\nraven ridge and grey hawk.", "score": 1, "replies": [{"body": "Naples has not launched yet. It's coming Q2 2017. 32 cores, big-ass server chip.\n\nCheaper because it's gonna be 50-75% the die size. Better performing due to the better core scaling and low clock performance we've seen in Ryzen. Lower power consumption as we've already seen in Ryzen and that gap only increases as you add more cores.", "score": 2, "replies": []}, {"body": "Server cpu coming out either q2 or 2h 2017 i believe and iirc it beats intels due to tdp (supposedly) ", "score": 1, "replies": []}]}]}, {"body": "AMD is in none of that now, that's the point. Their previous offerings were shit. Now suddenly they pull a miracle out and are competing again. So nothing now but moving forward you'll definitely start seeing Naples in the cloud, APUs in VR/image detection hardware, Vega in deep learning, etc.", "score": 6, "replies": [{"body": "the problem is the cloud hype was 5 years ago and decisions have already been made. the VR products are all entering market now. car companies have decided which chips they like for automation.\n\ni have no doubt that they can enter these areas. but they are not the first movers and have to play catchup.\n\nthey arent in one cell phone i believe. cell phone companies (xiaomi did this week for example) are switching more and more to their own processors. im not sure if the opportunities will be as plentiful as they were.\n\nif they start having better future revenue projections sure. but until they make some moves im not sold on this being a strong buy or must own.", "score": 1, "replies": [{"body": "By the time they make those moves, the value is already going to be priced into the share price though. Gotta buy before they close those deals based on the knowledge that they have a good product that will sell.\n\nFurthermore, Intel isn't really in phones either. They have their Atom phones but those suck.\n\nAlso, I don't think it really matters that AMD is late to entering the cloud market. Those guys cycle hardware enough that there's plenty of opportunity to enter. If AMD goes to Google and says hey, we can reduce your server farm here from 1000 servers to 750, meanwhile improving or maintaining the same performance and saving you $$$ on electricity, well they'll probably buy.", "score": 3, "replies": []}, {"body": "For servers the most important metric is performance/tdp ratio. AMD is really solid in that right now, it's gonna be a pretty big market for them if Intel doesn't come out with something that crushes this.", "score": 1, "replies": []}]}]}, {"body": "AMD has deals with Google an Alibaba to supply product for their data centers.  You're a fucking idiots if you think that this is insignificant and the only goal is to be in trendy VR or cars. Data centers are where shits at.  In again at 13.02 see what happens ", "score": 1, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "You can be long on whatever the hell stock you want ^^^^Amazon ^^^^is ^^^^best\n\nbut this is /r/wallstreetbets; keep that shit to /r/investing.\n\nIf my portfolio isn't swinging at least 8% a day I can't even get hard.", "score": 5, "replies": [{"body": "AMD went down nearly 8% today. Does that count?", "score": 2, "replies": [{"body": "I tried to get people all rock hard on FCX when it was six bucks a share but they all staid super flaccid.  Don't try to make sense outta this shit.", "score": 1, "replies": [{"body": "I was telling people about AMD at $2 and they laughed. I was actually in a 4chan slack chat and they put AMD under \"shit tier\" when I recommended it lol.", "score": 2, "replies": []}]}, {"body": "[I never understood the AMD hype this sub had.](https://www.reddit.com/r/wallstreetbets/comments/5ui0rs/discussion_what_are_your_moves_tomorrow_february/ddudazm/) I still don't.", "score": 0, "replies": [{"body": "What's not to understand about 700% gains in a year?", "score": 1, "replies": [{"body": "700%?! [It was $2.37 last year](http://i.imgur.com/wBhfogx.jpg) Even rounding up it is 450%.", "score": -1, "replies": [{"body": "Come on... $2 to $15 in approximately a year. You know I didn't mean exactly a year to this day.", "score": 3, "replies": [{"body": "I mean if we're just cherry picking days now it [dropped 85%](http://i.imgur.com/vJA1DNW.jpg) in the past 7 years.", "score": -2, "replies": [{"body": "You asked why people have been hyped on AMD and I answered. Big gains in the past year or so. That was easy wasn't it? Thanks for playing.", "score": 5, "replies": []}]}]}]}]}]}]}]}, {"body": "This makes me feel a bit better, I am going to wait for an up day to double down though ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Ryzen absolutely just became the new workstation leader.", "score": 1, "replies": [{"body": "I agree. 3D renderer here, Ryzen is looking sexy as fuck for us.", "score": 3, "replies": []}]}]}, {"body": "The day metrics on Naples leak is going to be big imo. I'm fully expecting that to be faster, cooler, cheaper than Intel's 32 core. Not this win some lose some Ryzen reviews bullshit that has brought it down this week.", "score": 2, "replies": []}, {"body": "Don't forget, the Ryzen launch has been a buggy mess.  Maybe they'll improve performance drastically when BIOS updates and software optimizations, but it won't happen overnight.  They might be worth a lot down the line but for the next few months we will still be trading on hype,  if there is any left that is.", "score": 2, "replies": [{"body": "This is also true. The memory issues with the launch BIOSes are supposedly adding a lot of latency which is hurting the single core benchmarks and making the 7700K look even better.", "score": 2, "replies": []}]}, {"body": "Long on <insert stock here>?  Are you sure you're in the right subreddit?", "score": 2, "replies": []}, {"body": "So what if ryzen is not better than intel?   \nAs long as intel doesn't price cut in a big way, I still seeing Ryzen grabing a shit load of market share. Nobody is going want to pay 50-100% more for a cpu that is minimally better.   \nAlso a big advantage might be the energy efficiency. Who knows, maybe we will soon hear off some other companies picking up ryzen for their data centers etc..", "score": 2, "replies": []}, {"body": "Just confirmed that the clock boosting is bugged on my personal 1700X. Goes to 3.89GHz for a second then settles to 3.49GHz. Tested with CPU-z. I can see my single thread score spike to ~2200 when I first start it, then it settles down to around 2030. \n\nYet another thing falsely impacting Ryzen reviews.", "score": 2, "replies": []}, {"body": "What's with all these words? Are you gay? Looks like a bag holding bitch, amirite? RIP^HEADSHOT ^^420 ^^NoScope^ ^^!!!1!!1!!100", "score": 5, "replies": []}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Buy the rumour, sell the news. I'll probably pick up before earnings ", "score": 1, "replies": [{"body": "Watch for leaks on Naples and APU performance as well. Pricing on the mid/low end Ryzens is going to be important rumor also.", "score": 1, "replies": []}]}, {"body": "https://www.youtube.com/watch?v=ciJmbwEPk3o\n\nThe other 2% are people\n\n", "score": 1, "replies": []}, {"body": "Back in at 200 shares at 13.02.  hope I timed the bottom right ", "score": 1, "replies": [{"body": "I think there might be a bottom in the next week or next going to 12, but I think you timed it ok.", "score": 1, "replies": []}]}, {"body": "How many times have I seen that post title. ", "score": 1, "replies": []}, {"body": "I'm gonna go balls deep in long calls when I'm absolutely sure it has bottomed out for now.", "score": 1, "replies": []}, {"body": "The people on the markets aren't gamers so they don't know how gold this shit is. Have to wait till earning results before they quit the PC gaming is dying meme.", "score": 1, "replies": []}, {"body": "I loaded some more at 13. I am almost 2000 shares in amd, bought at difference price points starting from 6.95. ", "score": 1, "replies": []}, {"body": "The only thing I don't like about the console market is that Xbox ain't pulling their own weight versus Sony.  No good games, no exclusives, nothing.  I have a feeling the switch is gonna sell way more because of it being new and a solid game lineup. ", "score": 1, "replies": []}, {"body": "Listen here....\n\nAMD is a shit product and will always be second to Intel. It doesn't matter if AMD released a Ryzen replacement and it's hand delivered to each buyer by Jesus himself... No respectable gamer will buy a piece of shit AMD product. INTC  will always reign supreme. You really think they don't have kick ass products under wraps? The second AMD releases something \"revolutionary\", Intel can cut the prices on the current lineup and release a new lineup at the previously higher pricepoint.", "score": -1, "replies": [{"body": "Yea, I guess it just sold out because all the warehouses burnt down coincidentally at the same time.", "score": 3, "replies": [{"body": "Whoop-de-fuckin'-do. It's the same shit Apple pulls by limiting supply to claim it sells out the new iPhone every single year. ", "score": 2, "replies": [{"body": "Why would they cap their own income? You took 2 red pills... didn't you?", "score": 1, "replies": [{"body": "You think if they made more they would sell out of their entire supply? LMFAO. AMD has been pulling this shit for the past decade. They make an over heating, garbage CPU with a fuck ton of cores, but it can't hold a candle to INTC. You keep staying long on AMD with the fucks on this sub, I'm going to start shorting it. Sub $10 AMD.", "score": 2, "replies": [{"body": "You're fucking retarded.", "score": 2, "replies": []}]}]}, {"body": "Ya OK kid", "score": 1, "replies": []}]}]}, {"body": "Found the Best Buy salesman.", "score": 1, "replies": [{"body": "lol, I'd never hold a retail job. ", "score": 0, "replies": []}]}, {"body": "I remember when AMD was da shit because they had more corez than errbody - and still didn't do shit widdit.  I think because in the end, the chips sucked.  But my memory could be foggy.", "score": 1, "replies": [{"body": "I was a retard and bought an AMD CPU just because it had 6 cores and I couldn't afford the Intel 980X...", "score": 2, "replies": []}]}]}]}
{"title": "are there other stocks besides NVDA and AMD?", "selftext": "im new to trading and from this sub im pretty sure there are only 2 stocks in the market. is that right?", "id": "5xbj91", "created_utc": 1488560803.0, "score": 356, "upvote_ratio": 0.95, "num_comments": 192, "comments": [{"body": "[deleted]", "score": 160, "replies": [{"body": "#Vintage", "score": 87, "replies": [{"body": "Locally sourced. Extra cruelty. ", "score": 12, "replies": []}]}, {"body": "[deleted]", "score": 38, "replies": [{"body": ">now bankrupt Ticker as username\n\n>good recommendations \n\nPick one\n\n\nDon't you miss those?", "score": 17, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": ";) ", "score": 2, "replies": [{"body": "I'll try to limit my drunk texting <3 ", "score": 2, "replies": [{"body": "I'm just drunk and addy'd", "score": 5, "replies": [{"body": "Since I'm on west coast, just addy for the next 3.75 hours. better than me, when I get wasted, I think I'm king of the party, \n\n#bro. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "when I think of wsb, I often think of u/SUNEQ and also $SUNEQ, it's true.", "score": 7, "replies": []}]}, {"body": "I'm pretty sure I have some Jan18 SuneQ leaps in an abandoned Etrade account. Waiting for the phoenix to rise from the ashes. ", "score": 5, "replies": [{"body": "it does that... I remember last year, in like late Q3 or early Q4, it rose like 200% or something. I couldn't believe it hadn't been delisted yet.", "score": 4, "replies": []}]}, {"body": "Avxld", "score": 2, "replies": []}, {"body": "$SNAPQ", "score": 1, "replies": []}]}, {"body": "NVDA = ANVD = AMD\n\nThere is only one stock.", "score": 84, "replies": [{"body": "Mind. Blown. ", "score": 16, "replies": []}, {"body": "whoaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa", "score": 11, "replies": []}, {"body": "Holy calamity ", "score": 2, "replies": []}, {"body": "AMstxD?", "score": 1, "replies": []}]}, {"body": "JNUG ", "score": 128, "replies": [{"body": "please, don't spread the misery right now ", "score": 58, "replies": [{"body": "I'd have more value if a bought a gold bar and shoved it up my butt than Jnug.", "score": 46, "replies": [{"body": "I think Yellen is doing that for us tbh", "score": 11, "replies": [{"body": "so if the rates go up, does gold go up too?", "score": 2, "replies": [{"body": "Rates up usually equals Gold down, but there is also a correlation between Gold prices and inflation, so you have to watch that as well. ", "score": 3, "replies": [{"body": "thanks for the reply", "score": 1, "replies": []}]}]}]}, {"body": "Not wanting to take the lube away from you guys but did you hear about the reverse split coming in May for Jnug?", "score": 4, "replies": [{"body": "May is like, years away in 3x ETF land", "score": 5, "replies": []}, {"body": "yeah man, robinhood gives me the latest updates son", "score": 7, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}, {"body": "Yeah ", "score": 1, "replies": []}]}, {"body": ">mystery\n\nFTFY", "score": 6, "replies": [{"body": "So\n\nAre you Harambe? ", "score": 1, "replies": []}]}, {"body": "Why even have misery if you can't spread it?", "score": 2, "replies": []}, {"body": "Don't hold that shit. You had a great opportunity from 6 to 7 yesterday. What's the problem? ", "score": 2, "replies": []}]}, {"body": "up 10% from when you posted this, ayoooo", "score": 14, "replies": [{"body": "Never go against the NUG!!!!", "score": 2, "replies": []}]}, {"body": "JNUG <3", "score": 4, "replies": []}, {"body": "The \"Bag-holders Special\"", "score": 1, "replies": []}]}, {"body": "$BRK.A", "score": 102, "replies": [{"body": "^ any beginners look no further ", "score": 43, "replies": []}, {"body": "Nice flare/flair(?) haha", "score": 6, "replies": []}, {"body": "You love trump?", "score": 1, "replies": []}, {"body": "eh I can only afford a couple of those shares though", "score": -2, "replies": []}]}, {"body": "There's only 5 stocks, J.NUG, J.DST, AMD, NVDA, and SNAP.", "score": 65, "replies": [{"body": "SNAP is hot right now. I'm probably retarded for not investing in it", "score": 19, "replies": [{"body": "Buy it now b, it will go +10% monday after faggots realize it was a smooth ipo", "score": 16, "replies": [{"body": "After faggots realize it was a smooth ~~ipo~~ criminal. Awwww!!! \n\nAnnie are you okay, daggonit baby\n\nWill you tell us that you're okay, daggonit baby...", "score": 10, "replies": []}]}, {"body": "When it falls like a pile of bricks after the dilution period is over, enjoy laughing at the losers.\n\n\n\nWelp, I guess I am one of those currently, but in $SPY - down about $150k at the moment lol. Got until the end of April, but shit man, that's dead cash.", "score": 7, "replies": [{"body": "Yikes, sorry for your loss", "score": 1, "replies": []}]}, {"body": "Who's gonna be the retard when people realize snapchat can't make a profit?", "score": 2, "replies": []}, {"body": "oh god", "score": 1, "replies": []}]}, {"body": "Don't forget UGAZ and DGAZ", "score": 29, "replies": []}, {"body": "Tsla and MCD. ", "score": 1, "replies": [{"body": "Nope. Nope. There's only 5 stocks in the world, don't feed the guy lies.", "score": 1, "replies": []}]}, {"body": "AVXLD", "score": 1, "replies": []}]}, {"body": "yes but you have to sell each stock before buying more of others", "score": 19, "replies": [{"body": "I've read that twice on the internet now so it must be true ", "score": 5, "replies": []}, {"body": "And you're just one person so you can only buy one share.  Unless you have money from your mom, dad and an aunt; then you can buy 4 shares!  Don't worry about taxes on all those gainz either. \n\nOh, and Robinhood ", "score": 1, "replies": []}]}, {"body": "Dryships you'll become a millionaire", "score": 33, "replies": [{"body": "> Dryships\n\nThanks for reminding me.. 150 shares at 5.10 :(", "score": 7, "replies": [{"body": "My condolences", "score": 6, "replies": [{"body": "Bag holding for eternity.", "score": 3, "replies": []}]}, {"body": "If it touches $1 I'll buy", "score": 4, "replies": [{"body": "You cheap fuck lol it's 1.37\n\nDo you think it's worth investing in on a serious note?", "score": 6, "replies": [{"body": "This company has literally dropped like 99.99% of its value in like 2 years and is in under continuous dilutions with a super shady CEO.", "score": 8, "replies": [{"body": "I assumed it was shit because it's a company based in Greece and their economy is pure shit. ", "score": 2, "replies": [{"body": "also because greeks", "score": 3, "replies": []}]}]}, {"body": "No", "score": 2, "replies": []}, {"body": "Yeah lol, crazy ship season comes around once in a blue moon but when it does u gotta pack ur bags cause ur going to the moon", "score": 1, "replies": []}]}]}, {"body": "Itll go back to 100 dont worry", "score": 2, "replies": []}]}, {"body": "I still shutter. Here's another one. Sino", "score": 7, "replies": [{"body": "shutter? I love reminiscing and making 400% on that blessed day", "score": 6, "replies": [{"body": "It's shudder you fucks. ", "score": 17, "replies": [{"body": "Hey the man already lost 8k, leave his shitty spelling alone!", "score": 5, "replies": []}]}, {"body": "Yes all my losses from beginning of my trading was from sino. Awful experience. Lost 8k in two days. I've made about 3k since I stopped touching that cancer. ", "score": 4, "replies": [{"body": "Currently working on the poopdeck of one of their new ships in an effort to recoup losses.  ", "score": 5, "replies": []}]}]}]}, {"body": "What about sears?", "score": 2, "replies": [{"body": "I am pretty sure that CEO is actively trying to bankrupt the company I would stay far from them.", "score": 9, "replies": []}]}, {"body": "Damn, what the hell happened there? It dropped to nothing like instantly.", "score": 2, "replies": [{"body": "There's some suspicious stuff going on with the company's financials! ", "score": 2, "replies": [{"body": "Wow! I didn't expect that.", "score": 2, "replies": []}]}]}]}, {"body": "NOK", "score": 12, "replies": [{"body": "fucking NOK.  That stock needs to fucking move.", "score": 6, "replies": [{"body": "Huh?  I'm up 8% in like a month.  I know that's not full on WSB autism, but that's a year's gains for some people.", "score": 5, "replies": [{"body": "When all you have is a robinhood account made from your Sandwich Artist income you need 10000% to get a yacht, not 8% buddy", "score": 21, "replies": [{"body": "I'm not your buddy, guy.", "score": 8, "replies": []}]}]}, {"body": "nok has been steadily rollin past few months", "score": 3, "replies": []}]}, {"body": "This is gonna be the next meme stock soon", "score": 3, "replies": [{"body": "Already got the sub. /r/nokia_stock", "score": 1, "replies": []}]}]}, {"body": "You mean like 3x etfs? Cause other than that, no. Just 3x etfs, AMD, and NVDA.", "score": 21, "replies": []}, {"body": "fnma", "score": 11, "replies": []}, {"body": "Depends on what your time range is.  Visa is a great long term investment, as well as $BRK.B", "score": 42, "replies": [{"body": "Did you just give an actual answer to that question?", "score": 60, "replies": [{"body": "Yes, I actually did.", "score": 27, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.2601 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 13, "replies": [{"body": "In that case, $VRX will get you straight to the fucking moon.", "score": 21, "replies": [{"body": "Shit, time to go buy then, I always wanted to go to the moon", "score": 2, "replies": []}]}]}]}]}, {"body": "Agreed, did a FCFE model of it yesterday and got $105 as a reasonable target for V.", "score": 7, "replies": [{"body": "I actually said somewhere else on a different site that I can see Visa reaching $100 before the end of this year.  That means it would need to gain a little more than 12% from where it is.  Definitely not out of reach.  \n\nI own 14 shares that I am up about 11% on.  I bought a September call option with a $85 strike price and premium of $7.15, so total cost was $715.  I might buy a January 2018 call option.  I am very long Visa.  ", "score": 5, "replies": [{"body": "I'm up 20% since the election and Im 90% index funds. 12% aint cutting it in the Trump era.", "score": 2, "replies": [{"body": "Well you have to consider that I was being \"conservative\" with my estimate.  See what I did there.\n\nI think Visa can go higher than that, given how they have done in the past and with more consumer spending, that will benefit Visa.  I wouldn't be surprised if Visa gains like 25 percent this year.  They have a five year return of 217%", "score": 2, "replies": []}]}]}, {"body": "Lol", "score": 0, "replies": []}, {"body": "You shouldn't use valuation models to price.", "score": -5, "replies": [{"body": "Just cause you don't know how to do it doesn't mean you shouldn't use it ", "score": 11, "replies": [{"body": "lol ok", "score": -1, "replies": []}]}, {"body": "K, I'll be sure to explain to my investments teacher that his decade at S&P was misinformed.", "score": 6, "replies": [{"body": "Do so.", "score": 0, "replies": [{"body": "are you harambe?", "score": 3, "replies": []}]}]}]}]}, {"body": "Is there an etf that you recommend for visa, mastercard, etc. credit services? The best ones i've found are pwb, xlk, ixn, ryt", "score": 2, "replies": [{"body": "I haven't seen an ETF that just tracks Visa, MasterCard, Discover and Amex.  I don't think one exists.  You would probably be fine buying long term call options for MasterCard or Visa, or buying the stock.  I bought a Visa call option that expires in September with an $85 strike price. ", "score": 1, "replies": []}]}]}, {"body": "If you want to be safe by WSB standards go FANG or FB, AMZN, NFLX and GOOGL. ", "score": 7, "replies": [{"body": "Long term naked calls on any of these is a strong WSBish bet", "score": 5, "replies": []}, {"body": "Do people actually think NFLX is safe, even by WSB standards?", "score": 3, "replies": [{"body": "Compared to JNUG and DGAZ, NFLX is missionary with the lights on. ", "score": 23, "replies": []}]}]}, {"body": "QQQ,tracks nasdaq index or the 2,3x version if you want to cherish your autism", "score": 3, "replies": [{"body": "This one is my IRA anchor. I'm even thinking of 100% QQQ, it's that good.", "score": 2, "replies": []}]}, {"body": "Enron", "score": 3, "replies": []}, {"body": "$stock BAC", "score": 2, "replies": [{"body": "stupid robot doesn't work...", "score": 1, "replies": []}]}, {"body": "Micron did very good this year. It was another one I was eyeing I'm not sure why i never put any money in it. ", "score": 2, "replies": []}, {"body": "Anything but $Snap, Snap sucks, and you'll lose your money. Welcome to WSB.", "score": 2, "replies": [{"body": "Ive made literally dozens of dollars on SNAP sir Diego", "score": 3, "replies": []}]}, {"body": "WSB Beginner to BIO circle jerk portfolio: ARRY, SRPT, SGYP, VRX (only when on K-Mart bluelight special and only for big swinging dicks), ITCI, McRib, M$TX (only for the tax losses), Tang Special: HRTX & now LJPC, and a mixture of small and nanocap with their ticker symbols banned", "score": 2, "replies": []}, {"body": "$MO", "score": 2, "replies": []}, {"body": "MU", "score": 4, "replies": []}, {"body": "If you haven't heard of it one is called $SNAP. But it seems like everyone hates it ", "score": 4, "replies": []}, {"body": "COIN soon", "score": 2, "replies": []}, {"body": "$BOTZ", "score": 1, "replies": []}, {"body": "nope", "score": 1, "replies": []}, {"body": "NQ used to be very popular here...", "score": 1, "replies": []}, {"body": "Don't forget our long lost aunt and uncle, Fannie and Freddie", "score": 1, "replies": []}, {"body": "Well there is AAPL in which i got in @ 107. Now its too late to get in tbh", "score": 1, "replies": [{"body": "in at 91. to the moon we go ", "score": 3, "replies": [{"body": "That was may 2016 right, after quarter report in april? Everyone just panicked and closed their positions. Nice buy mate", "score": 3, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "almost. ", "score": 2, "replies": []}]}]}]}, {"body": "~~DWTI~~ ($DWT) and ~~UWTI~~ ($UWT)", "score": 1, "replies": []}, {"body": "ENE", "score": 1, "replies": []}, {"body": "Whole sub is missing out on my TTD rocket ship", "score": 1, "replies": []}, {"body": "Because I think it will drop next week, it's gonna go up at least 100%", "score": 1, "replies": []}, {"body": "TTD", "score": 1, "replies": []}, {"body": "BOX and TACO", "score": 1, "replies": []}, {"body": "I put a lot of money into Energy Transfer Partners ($ETP) recently. Dakota access pipeline, Keystone XL pipeline, merger with Sunoco, and a good dividend rate.  It's not as exciting as the nug or amd, but it's definitely a winner with Trump's administration.  ", "score": 1, "replies": [{"body": "Nah man. Not many on here like oil. Idfk why. It's so undervalued. ", "score": 1, "replies": [{"body": "They could build a pipeline to send dildos to san francisco, as long as it makes me money, I don't care what it is.  Exciting stuff happening in domestic oil these days, you can make money with it or you can sit on the sidelines.  ", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "$MSTK", "score": 1, "replies": []}, {"body": "If you're a true believer in /r/wallstreetbets then yes, those are the only 2 stocks.  That matter.", "score": 1, "replies": []}, {"body": "I post about ONCYF but Noone particularly cares. It's more than doubled since my 1st post 4 months ago. And is up over 50% from my second post last Friday. Phase 2 results coming out at the end of the month for a breast cancer treatment ", "score": 1, "replies": []}, {"body": "PZZA", "score": 1, "replies": []}, {"body": "NOPE.\n\nAMD AND NVIDIA IS ALL YOU NEED ", "score": 1, "replies": []}, {"body": "Yes, there is. You now owe me money for that answer.", "score": 1, "replies": []}, {"body": "FSLR their P/E is like 7", "score": 1, "replies": []}, {"body": "Almost any semi conductor stock. I put about 1/3 of my portfolio in semiconductor for growth the. Yolo the rest away", "score": 1, "replies": []}, {"body": "Growth wise? Hard to say ", "score": 1, "replies": []}, {"body": "PTY", "score": 1, "replies": []}, {"body": "JNUG", "score": 1, "replies": []}, {"body": "Ntrp", "score": 1, "replies": []}, {"body": "Hbi", "score": 1, "replies": []}, {"body": "this is half correct. nvda is not a stock. your option is to buy amd", "score": 1, "replies": []}, {"body": "You would be wrong. There is only ONE stock. G to the motherfuckin' S. ", "score": 1, "replies": []}, {"body": "Por que no los SOXL", "score": 1, "replies": []}, {"body": "JPM is hot if you're into financials.", "score": 1, "replies": [{"body": "i've been playing FAS recently. made some decent gains in the last month", "score": 1, "replies": []}]}, {"body": "The only 2 stocks that matter! There are other stocks out there, but they make less money, so who cares about them?", "score": 1, "replies": []}, {"body": "CXW, GEO", "score": 1, "replies": []}, {"body": "KBIO", "score": 1, "replies": []}, {"body": "OPK\n", "score": 1, "replies": []}, {"body": "Philip Morris. Lockheed Martin. ", "score": 1, "replies": []}, {"body": "WEED", "score": 1, "replies": []}, {"body": "Nah", "score": 1, "replies": []}, {"body": "No.", "score": 0, "replies": []}]}
{"title": "It boggles my mind", "selftext": "How WSB constantly shits on $SNAP for not being profitable, while pumping stocks like $AMD and $TSLA that also aren't profitable. Let me tell you something: $TSLA and $AMD are heavy underdogs in capital-intensive(read: shitty) industries where size confers huge advantages. They will both require significant CapEx before they can even justify their existence.\n\n$SNAP on the other hand, is an easily monetizable social network, only second after Facebook. Their COGS/revenue will shrink as they monetize, since their \"cost of revenue\" includes the cost of ALL their hosting, not just the cost of ads. When snapchat's ARPU reaches the level of Twitter(and it might go much higher), you're looking at a company making $1-$2 billion dollars a year with room to grow, and with shrinking costs. \n\nOf the three stocks here, $SNAP is probably the least overpriced.\n\nTL;DR WSB likes unprofitable, eventual low-margin companies better than unprofitable, eventual high-margin companies. \n\nEdit: The Hivemind HATES this Stock. WSB inverse confirmed. Go mega-long SNAP. ", "id": "5xdbdf", "created_utc": 1488578138.0, "score": 28, "upvote_ratio": 0.71, "num_comments": 106, "comments": [{"body": "[deleted]", "score": 50, "replies": [{"body": "I have news for you. AMD doesn't make shit. They don't own machines to make processors.", "score": 3, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.2594 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 2, "replies": []}, {"body": "They used to but it's all GloFo now.", "score": 1, "replies": []}]}, {"body": "Thing is everyone's talking about buying puts as soon as they can. I have a lot of confidence SNAP will be the next TWTR but they're going to keep going up for at least several months until things start  unraveling. Obviously I could be completely wrong, I still think the next couple months will be easy gains. ", "score": 2, "replies": []}, {"body": "Making shit does not make a company valuable. The best companies are the ones that make the most money, with the fewest tangible assets. Look at Facebook, look at Apple, look at Coca-Cola. These three companies are incredibly valuable, and happen to be built on intangibles. Facebook's intangible is its software and the network that it spawns. Apple's and Coca-Cola's value comes from their brand. These are high-margin, low-capital, moats-with-alligators types of businesses. These are the kinds of businesses you want to buy. I think SNAP is one of these businesses, you can disagree and that's fine, but your argument is totally stupid.", "score": 5, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "huh, I guess I never really pondered *bowel movements* being the soft muscles acting to move the excrement rather than what I always thought it being just *literally shit.*", "score": 2, "replies": []}]}, {"body": "Having physical assets is 100% better than holding gigabytes of dick pics", "score": 4, "replies": []}, {"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.2698 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 2, "replies": [{"body": "SNAP is not a commodity. There are lots of FB clones, but nobody uses them. There are lots of TWTR clones, but nobody uses them. Instagram Stories might well take a lot of SNAP's business but I don't think it will. I wasn't necessarily going long SNAP with this post, just pointing out the hypocrisy of WSB. But if the stock dips enough you can bet I'll go long like crazy.", "score": -2, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.0315 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 1, "replies": [{"body": "OK LOL thanks for your input. It sounds like you are actually valuing its assets as liabilities. I also hope you make money by putting your money where your mouth is, and yes, I will continue to eat shit so long as that shit contains gold flakes from the boutique-food it was created from.", "score": -2, "replies": []}]}]}]}]}, {"body": "AMD doesn't Fab their own chips.", "score": 1, "replies": []}, {"body": "SNAP has one thing the other two do not.  An entire generation of young adults with pure loyalty and zero barrier to entry.  It's Facebook all over again.  Who needs to be profitable when you just have to flip a switch and you start rolling in it.", "score": 1, "replies": []}]}, {"body": "O RLY?\n\nhttp://i.imgur.com/dXHj4qU.png", "score": 37, "replies": [{"body": "It is worth pointing out that Amazon circa '99 had committed itself to a business development model that previously had been regarded as utter folly by growing significantly faster than revenues could support.  \nAt the time Bezos wouldn't even follow GAAP.  \n(Bezos = batshitinsanemegalomanica)  \n  \nNow compare it to Snapchat again ...  \nIt's 6x Bezos. And they ain't got one Bezos working for them.  \n  \n[A few years old but check this out](http://blogs-images.forbes.com/liyanchen/files/2015/08/Private-company-chart-2.jpg)  \n  \nSnapshat has Google's *and* Facebook's IPO problems - there's no clear plan on how to monetize and it's overpriced given the risk. That makes it a volatility play for about a year so why not just JNUG.  \n  \nIf you could make the case that SNAP is a product-pipeline company like TSLA then it's a long.", "score": 11, "replies": [{"body": "[deleted]", "score": 1, "replies": []}, {"body": "I disagree that there's no clear plan on how to monetize. People spend 30 minutes a day on snapchat, compared to 2 minutes a day on twitter. Yet, Twitter makes 5x more ARPU than snapchat. That's 75x more ARPU/user-minute. Snapchat sells video ads which should increase its edge there even further. Tell me that SNAP can't monetize.\nI actually think it's far better to be a social media company than a \"product-pipeline\" company. Tesla constantly has to innovate with the competition, whereas Snapchat is really more of a service than a product. It can endure forever with only minor tweaks.", "score": 0, "replies": [{"body": "Sure but that's not good enough.  \nThey are loosing money hand over fist.  \nHow are they going to turn -120% into > +12% if they are already selling those ads?", "score": 6, "replies": [{"body": "Double the ads, you double the revenue and move COGS up significantly less, maybe ~20%. That increases margins by 80%. The thing is, COGS is a reflection of the cost it takes to operate the service. NOT the cost it takes to run the ads. So COGS is almost a misnomer here. My thesis is that they are severely under-monetized, which is supported by looking at Twitter's ARPU, for instance. I have no damn idea how Twitter extracts that much in ad revenue, but if they can, SNAP should have no problem whatsoever doing the same. And IF SNAP can reach an ARPU as high as Twitter, they will be insanely profitable.", "score": -1, "replies": [{"body": "You cannot just double the ads. There is an inflection point where users start to get fed up and usage declines (not unlike the Laffer curve for tax revenue)", "score": 3, "replies": [{"body": "I disagree. It's called \"untapped pricing power.\" I think Snapchat has lots of it. Your inflection point does exist, but it's very far down the line(just like how the laffer curve has been utterly useless in practice even thought the theory is great).", "score": 1, "replies": []}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -8, "replies": []}]}]}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -8, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.8365 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 13, "replies": []}]}]}, {"body": "OP not able to see obvious pump and dump, emphasis on the dump, just no wiping available yet. ", "score": 2, "replies": [{"body": "I'm not getting in at this price. I'll wait for it to come down. But I actually think it might not come down, which is OK. There are other opportunities.", "score": 1, "replies": [{"body": "But think about what you're buying. Even if it goes down to $10/share I won't buy, this stock is purely speculation. ", "score": 2, "replies": [{"body": "Everything is speculation/investment depending on price. Any company can fail, which is why you need to diversify.", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Dude, this comes straight from Ben Graham, the father of value investing.", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Eh. Semantics. Point is I don't think you should discard any stock because it is too risky. Risk is a function of price. The lower the price relative to your valuation, the less risk you are undertaking.", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "unfortunately stupidity isn't a bannable offense lol. Actually not sure if this guy is trolling", "score": 3, "replies": [{"body": "He's not, its like seeing unfortunate African children who could use just $0.58 a day on your donation of $19.99 if you call the toll free number you're totally going to forget in the next 5 seconds after the ad is over.  ", "score": 1, "replies": []}]}, {"body": "Apparently because you are reading things you don't understand.", "score": 0, "replies": [{"body": "kys", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "IMO that chart ignores the fact that margins will go way, way up. Not a good metric for a social network.", "score": 1, "replies": [{"body": "On the contrary, their average cost per user has gone up for the last two years.\n\nAlso, they have tied up ~$2B in service costs to Google Cloud Platform for the next five years at the end of which, either their costs go further up or they have to start building their own infrastructure like every other tech company that handles lots of data and get fucked for not starting early.\n\nCloud as primary infrastructure is great for bootstrapping and startups, not so much for margins of a wannabe billion user company.", "score": 5, "replies": [{"body": "Average cost per user going up is a symptom of health, not illness. It means people are using the app more. That means you can sell more advertising. The basic point is that ARPU growth will drive them out of the hole they're in, and then some, without substantially increasing costs. And the more data they're pushing, the cheaper it should get on a per-unit basis, right?", "score": -1, "replies": []}]}]}]}, {"body": "When they look at $SNAP, all they see is $TWTR.", "score": 7, "replies": [{"body": "Yeah I agree. IMO it's kind of a strange cosmic accident that you can have a fixed-cost company like TWTR that teeters on the edge of profitability like it does. It probably has killed a lot of optimism for SNAP.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Haha, suck my dong Jamesls25!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}, {"body": "Yeah but then I take dick snapchats and jerk off to them for 10 seconds and that drains the gay right out of me.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm okay with a solid 6.5", "score": 1, "replies": []}]}]}]}, {"body": "i made a little over 300 today on snap :o \n\nwsb and stocktwats is not for entering positions lol it's for ideas", "score": 7, "replies": [{"body": "Fuck man, you should retire while you are ahead. ", "score": 3, "replies": []}]}, {"body": "AMD is literally kept alive by its Intel so they can point to it and say \"Look there's competition were not a monopoly\"", "score": 5, "replies": [{"body": "Yet intel is known for doing under handed shit in an effort to drive AMD into the ground.\n\nI don't have a doubt in my mind intel would skate past any monopoly laws if AMD fell through. ", "score": 0, "replies": [{"body": "Dude, dude, dude, there's always Qualcomm", "score": 1, "replies": [{"body": "-.-", "score": 1, "replies": []}]}]}]}, {"body": "The guy running snap is retarded anyone that won't fuck Miranda Kerr straight or gay when she is actually throwing herself at you has a mental deficiency add that to no voting rights on any stock and that's recommend sell from me", "score": 4, "replies": [{"body": "Or he doesn't want to risk getting her pregnant and having to pay child support - huge amount - for a relationship that won't last or even a one night stand. Screw that noise. ", "score": 3, "replies": [{"body": "She has been his fiancee since 2015... This isn't a one night stand. And you realise we currently have the technology to avoid pregnancy. His judgment is incredibly suspect and when you add to that the non issue of any voting stock allowing him to also  not release a lot of information any normal stock would have too\n. That's a strong sell", "score": 1, "replies": []}]}, {"body": "Solid DD. Will keep this in mind.", "score": 2, "replies": []}]}, {"body": "It's funny you say second after Facebook when the Snap haters here say Snap has fallen off now that grandmas are using it. Who's still using Facebook? Grandmas and Grandpas. My dad is using Facebook, I'm 33.\n\nFacebook is over. It's been over for a long time if teens liking it is considered a money making strategy.\n\nThe whole DD for hating it has been that the teens have moved on and yet the teens left Facebook many years ago.\n\nTeens don't bring money. Teens are into trends. Older people bring money. That's why Facebook is still around and profitable. That's why Snapchat will be successful. Facebook wasn't even created for the very people who are currently making it the largest social media platform. No one expected anyone over 30 to be on Facebook. Hell most colleges were fighting like crazy to even be on it.\n\nYou think teens made Kim Kardashian famous? No. That was grandmas and grandpas. Who blasted Snapchat all over her reality show? Kim Kardashian. Everyone's grandma and grandpa who made Facebook hugely profitable is now moving to Snapchat and they're a loyal crowd.\n\nThat's my DD. Suck my dick, I got my tickets on this rocket ship. Short it all you want WSB(if you even got in) I'm in for the ride.", "score": 7, "replies": [{"body": "Where are you getting the idea that grandma and grandpa are making the karadashians rich? It's the millennials and teens who purchase their products because of parents. ", "score": 2, "replies": [{"body": "That's the greatest farce of all time. Keep thinking that.", "score": 1, "replies": [{"body": "You seriously think grandparents are? Its mainly millennials, ppl in their early 40s, and teenagers (kylies makeup, clothing) I would imagine who are buying their products. I don't have evidence but from personal observations on Instagram it seems to be that way. Do you have any proof to support your claims? Do they even break down the demographics that buy their products? ", "score": 2, "replies": [{"body": "If you say so. Teenagers are running the US by making up the majority of the sales in the country and earning the most money per year. Yep you got it right and I'm wrong. Thanks for your input.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Um what \"youth\" do you know still using Instagram? Are you serious right now? I've only ever seen adults 30 and over seriously using Instagram who aren't celebrities.", "score": 1, "replies": [{"body": "As a youth, we definitely do. A lot. ", "score": 3, "replies": [{"body": "Lies.", "score": 3, "replies": []}, {"body": "Yeah my sister is still in high school. She doesn't even have a Facebook. However, she does have an Instagram and that, along with Snapchat and maybe some Twitter, is all she and her friends use for social media. Instagram is king for \"youth\" right now.", "score": 1, "replies": []}]}]}]}]}, {"body": "Semiconductors, especially ones that do not own foundries, are not capital intensive.  \nIn fact I believe the creation of the semiconductor industry was ***the genesis*** of low-capex corporations.", "score": 2, "replies": [{"body": "What? What semiconductors are you talking about? What do you mean by foundry? Are you talking about the raw substrates or fabrication through to module level? As someone who has been near the industry I can tell you semiconductor chip fab is expensive and difficult to get started, clean rooms are very expensive. ", "score": 2, "replies": [{"body": "He might be making a distinction between \"expensive to get started\" and \"expensive to add incremental production capacity once started.\"", "score": 1, "replies": []}]}, {"body": "Good point. Why is it so non-capital intensive compared to most other hardware industries?", "score": 1, "replies": [{"body": "What do you mean by 'hardware'?  \nLots of people mean electronics when they say hardware but hardware is actually things like doorknobs and blocks of steel.  \n  \nSemiconductors are low capex because the Value / Volume density of the products are extremely high so logistics (storage, shipping, stocking) are much simpler.  \nA $200k cylinder of purified silicon returns millions.  \nWhereas to make millions selling cars you might only have to sell a 1,000 of them ... but you're in for $20k+ ea ($20M not $200k).  \n(This, plus volatility, is why Wallstreet hates Woodward.)", "score": 2, "replies": [{"body": "Interesting, thanks. Lots of people call electronics hardware FYI. A common question for ECE majors is \"hardware or software,\" meaning electronics or software, although maybe that's not the original or common usage of the word.", "score": 1, "replies": [{"body": "I know; I hate it.  \nHardware is metal ... hard wares.  \nMechanical engineers deal with it.", "score": 1, "replies": [{"body": "You're the only person who uses it this way in the 21st Century.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I disagree.   \nAMD has always been a short term play <1year. There was/is a lot of smoke, and if they market everything right they will get a load of market share.   \nI agree TSLA is hugely overvalued, but it is for a reason. There are few companies that are really innovative. You never know what the next thing is that Tesla unveils. TSLA is a long play, but the price is inflated atm.  \n   \nSNAP on the other hand doesn't have shit besides its platform. You never know when the user-base starts declining. There are many factors that could attribute to that happening. Sure they might have revenue growth, but I don't see them having actual \"growth\".\n   ", "score": 2, "replies": []}, {"body": "Sir, how dare you. Ban this autist comparing SNAP to AMD/TSLA.\n\nHang yourself.", "score": 2, "replies": []}, {"body": "My guess is that the very small minority of people in this sub who actually know what they're doing, don't want to actually reveal their thought processes because you know, this is a zero sum game and everything, and this sub now has wide exposure.\n\nSo they shit post and make up bullshit and the rest of us lap it up because we're greedy idiots.", "score": 2, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.8591 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 10, "replies": [{"body": "Yes, this is entirely unreasonable. Disregard it.", "score": 3, "replies": []}, {"body": "Seriously. Who on here by the way thinks a little clutch of 1,000 or so autists is going to sway the market so much that they won't reveal their masterful trades?", "score": 1, "replies": []}]}, {"body": "Not a zero sum game.", "score": 3, "replies": []}, {"body": "Yes and no.  \nIt can be useful to get shit on to validate/invalidate your idea(s).  \nMany ideas, like BUY SNAPCHAT ZOMG!!!, are not exactly unique.  \nIt serves as a proxy for general market sentiment.  \nSome ideas are only useful if any people become aware of them, like the GSE's. (The more public pressure there is to undo fascism in America the sooner our mortgage market returns to sanity.)", "score": 2, "replies": []}]}, {"body": "I would be surprised if snap could get their revenue to 2 billion, let alone profits. This is not a 30billion dollar app. Especially not with bigger names that already have every feature snap has. What is so hard to understand about this.", "score": 1, "replies": [{"body": "Well, that's a valid opinion. I just think you're wrong about that. Look at relative ARPU to Twitter. ARPU can easily become 5x higher, maybe a lot higher. Plus there is still room for user base growth, 2016 was not a good year for growth, but growth is often lumpy. I agree it might not be a 30 billion dollar app. WSB saying it's \"worthless\" though is fucking idiotic. $10 B is my margin of safety, although I suspect it's worth easily $20 B and maybe $30 B.", "score": 0, "replies": [{"body": "Snap grew revenue by 600% and still managed to lose over 100% of that. And that was before other bigger names released the exact same features. Snap has no way of actually making money without losing their users. Predicting over billion in profits let alone revenue is just retarded.", "score": 1, "replies": [{"body": "It's kind of funny you can admit they grew 600% in the last year, but that growing another 120% over the remaining lifetime of the app is \"retarded.\" But by all means, short the stock.", "score": 0, "replies": [{"body": "Theyre not growing like they were, they now have direct competitors who have better products that offer the exact same features. Once they try to monetize the app with ads they will lose users. Otherwise they continue to lose half a billion each year. Where is this billion dollar yearly profit that you speak of actually coming from? Do you or anyone you know use this app? Its already been LOSING popularity.", "score": 1, "replies": []}]}]}]}]}, {"body": "Education is important ", "score": 1, "replies": [{"body": "Even significant, you might say.", "score": 0, "replies": [{"body": "Stick to your day job pal. ", "score": 1, "replies": [{"body": "How much have you beat the market since you started trading?", "score": 1, "replies": [{"body": "Please kys. I'm asking politely. ", "score": 1, "replies": [{"body": "That's what I thought. You fucking suck at this so it's really strange that you think your opinion has value.", "score": 1, "replies": [{"body": "I dont need to prove shit, assume all you like. \n\nComing from someone who doesn't understand what value investing is. I already know your opinion has none. \n\nStay bent faggot. lol ", "score": 1, "replies": [{"body": "Yeah if you're going to criticize someone's analysis without logic or evidence, you need credentials. You're the one who doesn't fucking understand value investing if you think it's ONLY P/E, Price to Book, etc. You're a fucking idiot and you're going to keep losing money you stupid worthless piece of shit, human garbage, corn cob eating, butthole thrusting, salty piece of cooked flesh faggot motherfucker.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "OH YOU TOOK A FINRA TEST THAT MEANS YOU 'RE AN EXPERT STOCK ANALYST RIGHT????!?!?!??!?!?!?!?! I can't believe you think that being a fucking STOCKBROKER makes you qualified to give investment advice. You give stock tips to old people who don't understand the difference between a stock and a bond, and collect commissions by losing money for them. Also it's really clear you haven't read the actual source material. Read Graham and Dodd. Saying value investing is P/E and Book is like saying \"Science is test tubes and charts\". Those are TOOLS of value investing, and they can become irrelevant/outdated/overused. In words you can understand, it's fucking retarded, you faggot licking assmonkey.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "LOL people in their 20s who frequent WSB? I'll bet they have a lot of money in their accounts. You probably make just enough money to afford all the lube you must run through, good job.\nAnd yeah, you're a retard who can't read, and you'll keep losing money off of your trades. Stick to collecting commissions. ", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "LOL. More proof you can't read. I never said I bought $SNAP. But hey, if you're so confident, let's bet whether $SNAP is above or below the IPO price in one years' time. Loser gets banned.", "score": 0, "replies": [{"body": ">Semantics\n\nlmk how those did for you today. ", "score": 1, "replies": [{"body": "What the fuck are you talking about? As I said I didn't buy $SNAP. Now that you've shown you don't have a shred of confidence in your bullshit opinions, just please try and shut the fuck up, you piece of faggoty celery shitbucket pathetic excuse of a human being.", "score": 2, "replies": [{"body": "Haha! ;) ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.1725 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.8802 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 0, "replies": []}]}]}]}, {"body": "TIL: profit don't matter.", "score": 1, "replies": []}, {"body": "Well. This is WSB. \n\nYOU CANT SHORT A STOCK THAT ONLY GOES UP. \n\nWhat the fuck did you expect?\n\nThat said. Short snap next week. That shit is going to tank Monday. Hard. Mark my words.\n\nSnap drops like a rock or ban me.", "score": 1, "replies": [{"body": "yepp I think you will get banned. As a precaution, just in case. I never even saw the snapp app ever...", "score": 1, "replies": []}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -3, "replies": [{"body": "I hate you.", "score": 7, "replies": [{"body": "we all hate IT. ", "score": 2, "replies": []}]}]}]}
