{"title": "$AMD up 3.5% today", "selftext": "", "id": "60gmwm", "created_utc": 1490018392.0, "score": 130, "upvote_ratio": 0.88, "num_comments": 126, "comments": [{"body": "[deleted]", "score": 74, "replies": [{"body": "Lol im holding till 40", "score": 43, "replies": [{"body": "181", "score": 32, "replies": [{"body": "I'm holding til AMD buys APPL", "score": 45, "replies": [{"body": "Nah, on that day I'll be buying the dip.", "score": 16, "replies": [{"body": "French onion, please", "score": 8, "replies": []}]}, {"body": "APPL is an OTC penny stock bb", "score": 3, "replies": [{"body": "AAPL", "score": 1, "replies": []}]}]}]}]}, {"body": "Didn't know you could see Pluto that clearly from earth ", "score": 12, "replies": []}, {"body": "When you sell boi", "score": 2, "replies": [{"body": "[deleted]", "score": 47, "replies": [{"body": "Nice!!", "score": 6, "replies": []}, {"body": "I sold at 13.8 today too!", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I shoved it into the nug, so far so good", "score": 1, "replies": []}]}]}, {"body": "Did you factor in your trade costs to that mighty $4 profit?", "score": -20, "replies": [{"body": "Robin hood is free faggot", "score": 36, "replies": [{"body": "Sometimes, instead of buying 5 shares or something, I'll buy one at a time, just for the fuck of it", "score": 11, "replies": []}, {"body": "I wasn't replying to the OP you fucking retard.  Who the fuck knows what trading platform this guy uses. \n\nSo shut the fuck up and go stick your dick into a pencil sharpener. ", "score": 0, "replies": [{"body": "Just take your downvotes and shut up until you learn how to be a part of Wallstreetbets", "score": 1, "replies": []}]}]}]}]}]}, {"body": "me too :( bought at 13.48 on Friday, sold at 14.02 today. made a quick $75 tho", "score": 2, "replies": [{"body": "Why didn't everyone do this? Wasn't it guaranteed they would go up on Monday? ", "score": -2, "replies": []}]}, {"body": "Selling $AMD is always too early.", "score": 2, "replies": []}]}, {"body": "Bros it's taking off. The rocket is taking off.", "score": 24, "replies": [{"body": "Well see how fast the rocket runs out of fuel before the day is over. ", "score": 5, "replies": [{"body": "I'm averaging at 14.65 so I can't do much right now. But for those who bought in a the low 13s, they should sell today because it'll dip again by tomorrow morning from people cashing in their gains. Its like a heart rate monitor. It won't keep rising like an actual rocket, it'll go up and down.\n\nIf it breaks 15.40 I'm selling today and buying in again tomorrow morning when everyone else will be selling. Think about it.", "score": 8, "replies": [{"body": "> I'm selling today and buying in again tomorrow morning when everyone else will be selling\n\nLOL that's exactly what the guy said who sold you his shares yesterday. \n", "score": 9, "replies": [{"body": "I didn't buy shares today. What some but did yesterday is not my problem either, I'm in this for myself. But low sell high. I won't make 640% gains with each trade but I doing care, small trades add up. Gains are gains.", "score": 0, "replies": []}]}]}, {"body": "This.\n\nSomeone posted how far amd took off the last time it was added to s&p but we've been through ups and downs with amd before.", "score": 2, "replies": [{"body": "Yeah that was me, and its well known that within the first two weeks of ticker getting added to S&P 500 ~11% of the float is purchased. \n\nIts a no brainer, knock the chip off your shoulder and fuck off.", "score": 3, "replies": [{"body": "Seems the chip is on your shoulder friend.", "score": 5, "replies": [{"body": "You're the one that came to me with your nonsense buddy.", "score": 1, "replies": []}]}]}]}]}, {"body": "https://www.reddit.com/r/ethtrader/comments/60f3zf/daily_discussion_20mar2017/", "score": 2, "replies": []}, {"body": "will come down tomorrow", "score": 1, "replies": []}]}, {"body": "BUT IT'S TOTALLY PRICED IN ALREADY, RIGHT YOU GUYS??? ", "score": 49, "replies": [{"body": "Haha people are such jackholes. \"It's priced in.\" Fuck off, we're going to the moon", "score": 33, "replies": [{"body": "Lol this is normal amd movement.  Got in at 13.8 on the upswing and have a stop limit/loss at 14.09/14.04.    I am on this rocketship but the moment it stalls I'm taking my parachute. Don't trust this stock one bit but it has def made me money swing trading.", "score": 4, "replies": [{"body": "Not even an hour later and you already missed hella gains.", "score": 16, "replies": [{"body": "I move my stops up as the stock rises and ended up getting stopped out at 14.27.   oh well I'm ok with that.  Don't see much more up potential to the day ", "score": 0, "replies": [{"body": "Wrong. Fake news. Sad!\n\nWe'll wave to you from mars", "score": 17, "replies": []}, {"body": "Meanwhile at 14.50....", "score": 11, "replies": [{"body": "Rathe be safe have gotten too much aids from this stock trying to hold when it dips", "score": 0, "replies": [{"body": "You did well, considering it's back down to 14.34 now. I got out way too early, like 14.10. Ah well, like you said it's an AIDS cannon on most days", "score": -1, "replies": []}]}]}, {"body": "I'm stopped at 14.30, we'll see what the outcome is 🙃", "score": 1, "replies": [{"body": "It will prob hit at 14.30\n", "score": 1, "replies": [{"body": "Bumped it up to .35 and it hit while I was lifting. \n\nGot back in at .30 so I can lose my gains in AH", "score": 1, "replies": [{"body": "Must be autistic.  No way this does anything but dip tomorrow morning ", "score": 0, "replies": [{"body": "Huh?", "score": 2, "replies": [{"body": "Dip* edited my coment", "score": 1, "replies": [{"body": "I've watched it since 9 like a hawk so I kind of agree with you, but I'm curious to see if we're gonna keep chugging along instead of he usual drawback. Just don't want to miss out. I'll look at selling if we pull back to 14.20 or so early on tomorrow, but if we stay flat or get another jump I'll probably cash out if we approach 15. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I'm with you\n\nIn at $13.60, limit set at 14.10/14.05. Closing RH and my meek 175 shares can do as they please. I went into INTC today with my other $2k, but haven't made quite as much. Stop limit set there too. ", "score": 1, "replies": []}]}]}, {"body": "Look at the entire semiconductor sector. Literally nothing to do with S&P addition.", "score": 10, "replies": [{"body": "amd led the entire semis higher..", "score": 0, "replies": []}]}, {"body": "100% already priced in!!\n\n/sarcasm for those that need me to spell it out", "score": 1, "replies": []}]}, {"body": "*7%", "score": 10, "replies": []}, {"body": "http://i.imgur.com/Avsr9Ck.jpg", "score": 9, "replies": []}, {"body": "But y'all, this squeeze was already priced in 🙄", "score": 10, "replies": []}, {"body": "Now 4%", "score": 8, "replies": [{"body": "edit that shit to 6% nigga", "score": 7, "replies": [{"body": "Oh shit, we Intel now.", "score": 11, "replies": []}, {"body": "and approaching 7% baby!", "score": 4, "replies": []}]}, {"body": "*eurobeat intensifies*", "score": 2, "replies": []}]}, {"body": "Any Canadians get absolutely fucked on exchange rate fees? Fuck eats so much of my profit.", "score": 6, "replies": [{"body": "Yeah I feel you. Need at least 5% gain to make any money, not including the $7 transaction fee both ways. ", "score": 3, "replies": []}, {"body": "Right there with you - I got in at $13.92 and my cost basis is actually $14.35, dogshit.", "score": 2, "replies": []}, {"body": "What broker are you using?", "score": 1, "replies": [{"body": "Scotia itrade. Have $9.99 commissons and LOC with them, only reason I'm there. Not too often I trade U.S because of the shit spread.", "score": 1, "replies": [{"body": "It only makes sense if you're exchanging large amounts, but before moving all of my accounts to IB, I would use Norbert's Gambit to do exchanges elsewhere http://www.moneysense.ca/magazine-archive/norberts-gambit-a-better-way-to-buy-u-s-dollars/ to avoid the fees/spread.", "score": 2, "replies": [{"body": "I love moneysense, but this doesn't really apply, I'm buying the odd individual stock, I would need a U.S account to avoid some fees, but I'd rather just not participate.", "score": 1, "replies": []}, {"body": "> Norton's Gambit\n\nkek", "score": 1, "replies": [{"body": "lol, fixed", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Got screwed on my 13.50 calls that expired on the 17th sold for 50% loss then this happens awesome..", "score": 5, "replies": [{"body": "Try not buying weeklies (less than 7 days) and buy further ouy 30d+. Weeklies otm are made to steal your money", "score": 2, "replies": [{"body": "I was dumb and didnt sell when it hit 14.. lesson learned", "score": 1, "replies": []}]}, {"body": "Well, in Germany we have so-called knock-out certificates which immediately turn worthless if they hit the strike-out price...happened to me at 12.75... too risky ;)", "score": 1, "replies": []}]}, {"body": "To the moon, baby!", "score": 4, "replies": []}, {"body": "Was looking to buy more. Might wait for a pullback now. ", "score": 3, "replies": [{"body": "It will. You should. ", "score": 5, "replies": []}]}, {"body": "INTC, MU, AMD, NVDA, TSM all up at least 1%... big boys rotating into semis?", "score": 5, "replies": []}, {"body": "In at 13.30 for ~400 share, out at 14.30ish, easy 8% gain in a week. Gonna get in after it drops a bit again. All hail Lisa su.", "score": 5, "replies": [{"body": "Get in tomorrow morning when people have had the night to think over and cash in their gains at opening. The price will drop considerably.", "score": 3, "replies": []}]}, {"body": "10 calls 10/17 exp 14 strike let's go fam need to purchase some tendies", "score": 5, "replies": []}, {"body": ">nothing can stop me I'm all the way up", "score": 3, "replies": []}, {"body": "Lol weakhands crying", "score": 5, "replies": []}, {"body": "Good lord, I don't want to sell but I have to set a stop loss somewhere... Any Ideas? 14.20?\n\nEdit: stop loss hit at 14.20.... and then back up to 14.42\nshit\n", "score": 5, "replies": [{"body": "20", "score": 4, "replies": []}, {"body": "trailing % stop", "score": 3, "replies": [{"body": "Wish Robinhood had this", "score": 2, "replies": []}]}]}, {"body": "My calls are up 10.44% today.  I like it.", "score": 2, "replies": [{"body": "10%? Mine are up 111% today fam. ", "score": 1, "replies": [{"body": "Oh yeah? Mine are up 2,000%!\n\nLOL, kidding. Different strikes/dates!\n\n[Mandatory *\"Big Short\"* clip](https://www.youtube.com/watch?v=Qo1OSqBQYmk&feature=youtu.be&t=2m0s)", "score": 2, "replies": []}]}]}, {"body": "Was hoping to buy more this morning at 13.5.  But woke up and it was up 80 cents. Wanted to wait for it to go back down a bit.  But after reading people say to wait for tomorrow to drop from people selling their gains i decided to buy it at 14.3 because people are always wrong about amd.", "score": 2, "replies": [{"body": "Maybe wake up before 1030 on a Monday u lazy unemployed $FAGT", "score": 7, "replies": []}, {"body": "You waited until the day this gets added to the S&P to buy?\nTsk tsk", "score": 1, "replies": []}]}, {"body": "Do we think these gains will continue tomorrow? I see a trend that amd seems to gain 2 to 3 days then lose for the same amount of time. However we're up to 7% today, maybe a knee jerk reaction to s n p and level out this evening /tomorrow? ", "score": 2, "replies": [{"body": "Ayyyymd gainz will continue tommFOREVER", "score": 5, "replies": []}, {"body": "Rule #1 with amd.\n\nDon't make any fucking plans.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Are you me? Sold for about that same profit \"to not be greedy\". And now it's 40 cents higher of course.", "score": 2, "replies": []}, {"body": "I don't get why you kids remove $ gain? You don't want people to see you have one contract?  I thought this shit was banworthy now", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Post $ gain or GTFO. Too many retards posting 200% gains and conveniently cropping out the $50 G\\L", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "By all means post your $10 gain screenshots but show the dollar amount so everyone can properly degrade you ", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Good job now get back to work and make your milli ", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "!!up 6%!!", "score": 2, "replies": []}, {"body": "Currently averaged at $13.11. Is the move to cash out on these gainz at end of day and wait for post S&P hype pullback to buy back again?", "score": 1, "replies": [{"body": "My avg is 13.17. I was all in plus 100% of my margin and sold half @ $14.30 so took profit in my margin, letting the rest ride to the moon ", "score": 1, "replies": []}]}, {"body": "Should I sell before close today and cash out my $20 gainzz?", "score": 1, "replies": [{"body": "That's alot of $MCD\n\n#LONG MCD", "score": 2, "replies": []}]}, {"body": "That's a crazy run. I expect AMD will get $15 tomorrow. ", "score": 1, "replies": [{"body": "Hahah. Fuck no. Shits going to tank like balls. I've been tracking AMD enough to know. There is ALWAYS a dip following big gains.\n\nBUY THE FUCKING DIP. $14. You heard it here first folks. Set your buy limits and let's ride this shit back to $16. Again lol. ", "score": 1, "replies": []}]}, {"body": "new plan. sell the jump, buy the dip, repeat every 10 days or so.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "This result is enough incentive to start doing this ", "score": 1, "replies": []}]}]}, {"body": "I decided to not be a pussy and hold today, notice me Lisa!", "score": 1, "replies": [{"body": "Witness me Valhalla!", "score": 1, "replies": []}]}, {"body": "PE ratio?", "score": 1, "replies": []}, {"body": "Wow folks. Finally, someone on this sub who is able to interpret simple data and report to us movements that have already happened in the market. I had vertigo since I saw your post but now I'm ready to buy 3K shares on margin.", "score": 1, "replies": []}, {"body": "This a bit old news but on Friday AMD had Huge Volume last 5 min (~176 Million shares) ? what does it mean?   \n   \npic1: http://imgur.com/a/InHYp   \npic2: http://imgur.com/a/Ugmqb   \npic3: http://imgur.com/a/Akwh9   \n\nOn Friday, end of day volume was huge, probably the largest I've ever seen: ~224 Million shares traded (pic1 & pic2) Okay, someone might say AMD is known for its massive daily volume, however what's strange is: last 5 mins have shown a record breaking volume: ~176 Million shares (within last 5 mins of trading) (pic1)\nEven more stranger is the after hours volume: ~74 Million shares (pic3)\n\nCould someone help me understand what might've happened?\nHow come 176 Million shares have been exchanged in last 5 mins: obviously there were almost even buyers/sellers that the price didn't move a needle? is that normal? For a 176 Million shares, shouldn't the price move sharply (one way or the other)  \n\nAlso could that be one of the reasons of this run up today?", "score": 1, "replies": [{"body": "quadruple witching", "score": 1, "replies": []}]}, {"body": "What kind of shitty title is this. It's up 6% today. Also why are you fags not loading up on every dip. ", "score": 0, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Wow that's a lot of randomly directed anger.\nTell us where your dad touched you. \nYou're in a safe place. \nLet it out. ", "score": 2, "replies": []}]}, {"body": "YEAH NO SHIT.  CMG IS DOWN 1.4% TODAY BUT YOU DON'T SEE ME FUCKING BRAGGING ABOUT IT, DIPSHIT.", "score": -9, "replies": [{"body": "Someone bought high and sold low", "score": 6, "replies": [{"body": "Doesn't everyone?", "score": 0, "replies": []}]}]}]}
