{"title": "Rebalancing my $10,000 portfolio", "selftext": "My current portfolio is a mess. It's just a random smattering of stocks that I knee-jerked bought and sold over the past 6 years. So, I'm planning on liquifying everything and starting from scratch. After some research, I've sort of settled on [this.](http://i.imgur.com/B3YQQFq.png)\n\nIt's pretty self explanatory, but, green is long-term, safe, \"buffet-esque\" picks; silver is tech; yellow is commodities; pink is healthcare; purple is restaurants. What do ya'll think?\n\n\nUpdate (03/19/2017): The majority of you guys are suggesting I only pick a few stocks instead of focusing on diversifying and I think that's great advice. I shouldn't be treating $10k as a retirement fund, especially since I'm young and have a separate, safe, dividend-yielding Roth IRA account. I'm leaning towards 2-3 of these atm: TER, OCLR, BAC, KMI. ", "id": "60496r", "created_utc": 1489846283.0, "score": 46, "upvote_ratio": 0.78, "num_comments": 101, "comments": [{"body": "I'd probably reduce the picks down so you don't have redundancy in sectors and add a bank and REIT or a Telecom. ", "score": 34, "replies": [{"body": "I agree with this advice. Just understand that REITs are taxed very differently, and as the fed rate changes REITs may not be as profitable in the coming years as they used to be.\n\nAlso, my advice for a telecom is T.", "score": 1, "replies": [{"body": "Why T over VZ?", "score": 5, "replies": [{"body": "I basically just picked one. Maybe I picked the right pony, maybe I didn't.  We'll see.", "score": 1, "replies": [{"body": "that's one way to do it", "score": 10, "replies": [{"body": "Well, between T, S, VZ, TMUS, CTL, FTR and probably others that I missed, who do you think will rise to the top?  ", "score": 1, "replies": [{"body": "I would have to do some research, read the 10Ks, etc. before making that prediction.  You said T, so I was just wondering what your methodology was. ", "score": 5, "replies": [{"body": "Yeah I separated it out by dividend yield.  After some basic, not in depth fundamental analysis I was picking between VZ and T.  They were pretty similar from a fundamental standpoint when I made my choice, and after reading some articles a while back, I chose T based on speculation that they might grow more than VZ. \n\nDart, meet board. ", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "Why not add fintech, like V, instead of a bank?", "score": 1, "replies": []}, {"body": "Add a bank, reit or telecom??? The most garbage advice I have EVER heard.", "score": -26, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Snap is probably a short. I wouldn't touch it. No idea what jnug is.\n\nAll of your sectors require leverage to cover your cost of capital. They have too much invested capital. All of your suggestions are easy to replicate physical assets, which is why they suffer from excess supply. \n\nCalling the path of interest rates is not my competency.\n\nEdit typo, added point", "score": 2, "replies": [{"body": "$JNUG is a big favorite with r/wsb . Stay away from anything that entices those autista. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Yes, my very point is, that hospital requires leverage to make a decent return. I don't like that. Leverage amplifies gains and losses--i'd really rather companies that don't require leverage to make acceptable returns.\n\nVerizon pays a high dividend because they don't have attractive reinvestment opportunities, so they're paying it back to you. The internal compounding of verizon is dismal. Remember you own a claim on the business (it's not just some ticker).\n\nBanks have low PEs because they, again, have too much invested capital and struggle to make decent returns without leverage and because you really can't analyse their balance sheet.\n\nYour anger is not helping you approach investing with the right temperament. \n\n", "score": 7, "replies": [{"body": "Debt is as cheap as it's ever been. Debt to asset ratios are up across the board because it's so cheap to acquire and pay it back. Definitely don't need to be as scared as you are about it in these times.", "score": 2, "replies": [{"body": "Sure, but rates could rise. And economic crises typically come out of nowhere. For too many companies out there, equity is but a thin sliver of hope between assets and liabilities. \n\nA little bit of leverage is fine, agreed. I like when companies don't need the leverage to get good returns. They may use some, but the important part is that they don't need the leverage to make good returns. Leverage should just be the icing on the cake and they should have adequate coverage of fixed costs in downturns.\n\nRemember friends, anything can happen out there.\n\nEdit typo", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Boi, you got roasted.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "BAC? ", "score": 10, "replies": []}, {"body": "Do you have $0 commission fees?", "score": 10, "replies": []}, {"body": "Why not just invest in an ETF that follows the S&P500 index?", "score": 34, "replies": [{"body": "Honestly, because I enjoy researching companies and investing in stocks! I have a separate Roth account that's just a whole bunch of ETF's that I barely touch. My brokerage account is my fun account.", "score": 34, "replies": [{"body": "That's what I've found... investing in individual companies is like the business version of fantasy sports.", "score": 9, "replies": []}, {"body": "If this is the case why not put 80% into an equal weighted s & p etf then use the remaining 20% for your research? \n\nWhy treat the different accounts so differently? Silo investing sometimes leads to issues.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm so fucking sick of people plugging nokia.  Every mobile provider is working on 5g.\n\nOn the chips and tech end we have Ericcson.  Huawei.  Samsung. Cisco.  Nokia,  DoCoMo, and likely INTC too.  They all have skin in the game.  Just because a bunch of people say that Nokia is the leader, and just because a buch of articles are plugging nokia, doesn't mean that they're actually leading the pack.  These are multi billion dollar companies that make the cutting edge of their LTE Modem designs, all competing with each other.  Nokia is not a sure thing.\n\nOn the provider end we have At&T, Sprint, Verizon, T Mobile, and everybody else who is a provider of mobile service that I forgot.  ", "score": 2, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I'm not hostile, I just speak with punctutation.\n\nAnd I'm not saying that Nokia isn't poised for growth, I've seen that in about 300 other posts on Reddit and articles, they are poised for growth.  But they're also poised to get destroyed by their competition in the (slow) race to 5g. ", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": -9, "replies": [{"body": "There is nothing intrinsic about fast-growing companies that leads to higher returns.", "score": 11, "replies": [{"body": "Right that's what they said about Amazon and Google and Monster beverage long ago . Focus on the business / cash flow / cash balance health / debt management and revenue growth and viability and demand  of the business \n\nI am not saying blindly invest in every hypergrowth company . I read all financial statements . Majority of my $500,000 portfolio is invested in ETFs and funds but if still young , to have  asymmetric gains  got to grow some balls and also invest in well managed companies involved in emerging economies of tomorrow - robotics lithium e-commerce Internet of things , big data etc ", "score": 0, "replies": [{"body": "Surviver bias. They also said that about a thousand other companies that went bust. ", "score": 9, "replies": [{"body": "Yea That's why gotta sift through financial statements and give business performance a little time instead of blindly buying and hoping. ", "score": 2, "replies": []}]}, {"body": "pets.com", "score": 4, "replies": [{"body": "Lol Pets.com was a hype joke and I never buy an IPO anyway - always give it time to prove itself a little . With Pets.com losses were way bigger than paltry sales .  I wouldn't touch it then and I certainly wouldn't call it a hypergrowth company.\n\nThe kind of stocks I am talking about is SHOP with 80-90% annual revenue growth and sustainable subscription model income growth. BABA is making impressive revenue growth too while making strategic investments and acquisitions ", "score": 1, "replies": []}]}, {"body": "Just to be clear is that $500,000 real money or in a paper account?", "score": 2, "replies": [{"body": "lol appropriate question - Real money .  Ofcourse the overall market recovery has helped like they say \"a rising tide lifts all boats\" , I think it was Buffet", "score": 2, "replies": []}]}, {"body": "If I have a dollar, and I use it to make two dollars, I've doubled the market cap of my company in a day. That's good growth. If I do that every day for a week, people might begin to speculate that I can do it every day for a month and start speculating. \n\nBut when I get big, after say 2 weeks, I can't double the size of my company every day. I can get some solid returns and form a very stable and profitable company, but the price of my stock is inflated by people who speculated that I could do it every day for a month. It's not feasible no matter how good my business is.\n\nThats the problem with rapid growth. Speculation grossly over values a company in certain cases.", "score": 2, "replies": []}]}, {"body": "Amen!", "score": 0, "replies": []}]}, {"body": "stop speculating. Please.", "score": -1, "replies": []}]}]}, {"body": "If he wants \"buffet-esque\" companies, why not just buy BRK?", "score": 6, "replies": [{"body": "They said their $10,000 portfolio is being rebalanced. BRK is currently trading at $260,000 per share.", "score": -5, "replies": [{"body": "b shares...", "score": 14, "replies": [{"body": "Ah", "score": 2, "replies": []}]}, {"body": "BRK-B is $172.82 per share and it's the same stock essentially. ", "score": 7, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yeah but I don't see how that would make a difference in OP's case.", "score": 6, "replies": []}]}]}, {"body": "b shares are a thing.", "score": 1, "replies": []}]}]}, {"body": "Based on his list he should go with DIA instead if S&P imho", "score": 1, "replies": []}]}, {"body": "Many reports saying to take Honeywell over GE. GE is putting too much effort in the gas and oil business and that market will inevitably drop", "score": 9, "replies": []}, {"body": "Considering you're only working with $10k, I would actually recommend consolidating your portfolio significantly into one or two high-yield investments or at least a blue chip stock that's market-resistant.", "score": 6, "replies": [{"body": "Is there any reason in particular for going that route? I figured it would be a better idea to diversify but I'm not all that experienced!", "score": 2, "replies": [{"body": "Generally speaking, diversification is exactly what you want when you're trying to secure a retirement or a safe fund - but that's exactly what it is: safe. Safe investments rarely churn out much growth in short periods of time because they carry little risk. If you're trying to speed up your returns, you need to take a higher-risk approach with less diversification. I assume quicker growth is what you're looking for with only a $10k investment because obviously nobody is trying to retire on $10k.", "score": 5, "replies": [{"body": "Haha great insight. Thank you. Picking just a few good companies seems to be the consensus then. ", "score": 2, "replies": [{"body": "Go ahead and fill us in on what those companies will be", "score": 1, "replies": [{"body": "So I've got it narrowed down to 4 atm. Totally open to narrowing it down even more. I'm thinking: KMI, HON, TER, and BAC. The only totally safe one in here, in my opinion, is HON. The others are a little risky but they have plenty of room to grow!", "score": 1, "replies": [{"body": "Also, it might be wise to buy them in intervals rather than just one chunk. If you feel confident with doing good research and picking a price you want to buy in then one chunk would be better perhaps.", "score": 1, "replies": []}]}]}]}]}, {"body": "Transaction costs.", "score": 1, "replies": []}]}]}, {"body": "Awesome list. Now remove all of them but 1-2. You have $10,000. I've had clients with $250,000 in 1-2 stocks. It should also be noted, you have horrible diversification. You've got overlapping stocks.\n\nDiversity is not in how many different positions you have.\nDiversity is like Foreign vs Domestic.  Sector vs Sector. Not only that being diverse is such a horrible way to mediocrity. Just pick 1-2 good stocks and let them make you money. ", "score": 6, "replies": [{"body": "I really appreciate your reply. I'm a little hesitant to just pick 1 or 2 stocks though because of the risk associated with that. I've gotten rid of the overlapping stocks but a little diversification seems like it's a safer bet, no?\n\nEdit: I get it now, I need to take risks in order to grow this. Since it's only $10k I shouldn't treat it like a retirement fund. ", "score": 5, "replies": [{"body": "Yeah, I mean because you have $10,000. I'm going to assume you aren't 55 years old. People now days are so afraid of risk that not taking it becomes the largest risk in life. \n\nYou might as well take some calculated risk. I wouldn't go penny stock happy but you might as well buy 1-2 good companies and just  keep buying into them. ", "score": 3, "replies": [{"body": "I think that's what I'm going to do. Thanks again for your advice!", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "lolol not sure if trolling? But on a serious note... you know there are individuals that have worked for CVX for years that have purchased into the companies profit sharing program and grew to multi million dollar portfolios. ", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "well yeah! 10m with 4% yearly... I wouldn't care anymore. But should break it into a few other BC stocks poised for growth. ", "score": 1, "replies": []}]}]}]}]}, {"body": "You get a thumbs up from me. Personally, I wouldn't touch the more commodity exposed companies. \n\nHave you considered more Buffett stocks: food, drinks, tobacco, beverage, household products companies? Maybe some household products: Church & Dwight? Food: Pepsi? ", "score": 4, "replies": []}, {"body": "How much does it cost you to trade?", "score": 4, "replies": [{"body": "Currently $4.95 with Schwab, but I'm planning on switching to a commission free app.", "score": 1, "replies": []}]}, {"body": "the one thing i'll add is you're indiscriminately jumping into these picks after a serious bull run. just because you think your current portfolio is a \"mess\".\n\ndo this over time, preferably after some dips. this is a knee jerk reaction disguised as a plan.", "score": 6, "replies": []}, {"body": "I would personally take MCD out. They're losing a lot of market share pretty quickly to other fast food chains. And this is for long term I'm assuming?\n\nAlso what's in your current portfolio if you haven't already sold everything?", "score": 3, "replies": [{"body": "Thanks! Yes, long term ideally although I'm not opposed to shifting things around occasionally. And.. copy/pasted from a previous comment:\n\nCurrent holdings, largest % to smallest:\n\nKMI\n\nPFE\n\nFCX\n\nINTU\n\nTER\n\nTXRH\n\nTSLA\n\nNAKD", "score": 1, "replies": []}]}, {"body": "If you only have 10k and splitting it on 11 stocks, you are doing it wrong. I know everyone says to play it safe and diversify, but your account is going to be slow as fuck to grow with that.\n\nBuy 1 undervalued stock you like and hold it. Make a percentage. Sell, rinse, repeat  ", "score": 5, "replies": []}, {"body": "I would try and hold it at ten stocks, and don't be tempted to add more.  You could consolidate the healthcare stocks into one or the other: PFE, JNJ.  \n\nThe same for the restaurants.  I might just go with McD.  That would narrow them down to nine.  As disclosure I own some MCD, AAPL, KMI, & KO too.  They seem to be doing okay, although my KMI is down as I guess I bought too high.  ", "score": 2, "replies": [{"body": "In the same boat with KMI. The recent oil decline didn't do me any favors although I still think it's a solid company.", "score": 1, "replies": []}]}, {"body": "Looks great, have you taken a look at http://suredividend.com/dividend-aristocrats-list/? They actually have some great fundamental analyses and I find their newsletters (the free ones) eye-opening.\n\nA lot of your picks are already quality stocks but I don't really like the AAPL and GE picks. As a person in tech, I find much more value in FANG (as cliche as that sounds--but especially GOOG, AMZN and NFLX) because I still see greater growth potential in their future, while AAPL hasn't really innovated or diversified. I'm also more inclined to go with BRK.B than GE, but I do see the potential in GE's restructuring.\n\nI personally carry primarily BAC, ABBV, NFLX, KO (prob 80% or so) and the rest are for fun. Ever since I switched from trying to be a swing trader to being a value/dividend investor/occasional swing trader, things have been working out much better for me.", "score": 2, "replies": []}, {"body": "It's not an awful portfolio, just really underwhelming. There's no doubt in my mind -- this will under-perform the S&P, probably by a healthy margin. \n\nGE and KO; aren't cheap enough to justify really mediocre performance at best.\n\nPFE; better pharma companies out there. GILD is an interesting value play imo, however on the riskier side. I'd still prefer a AMGN, CELG, AGN. \n\nKMI or FCX; don't care for commodities, unless I can find a deep value play. This is really just my bias, though. \n\nMCD; is branding themselves as a 'progressive burger shop,' really all that needs to be said. I'd wait for a pullback QSR and avoid MCD altogether.\n\nI'd consider looking at; BRK.B/MKL, V/MA, AMZN/GOOGL, WFC, AMT (on dips)\n\nDHR, UBNT, ABC, DLTR, MHK, (are reasonably priced here)\n\n \n\n \n\n  \n\n", "score": 2, "replies": []}, {"body": "Seems like for 10,000 you're over diversified, as it seems others might have suggested. Also, if you're looking for growth, I wouldn't invest in so many stocks with high prices. You end up with fewer shares and are less likely to make profit on them. I would invest in less expensive ETFs with good growth out looks. Personally I would look into $BOTZ etf if you're interested in tech growth but don't want to pick and chose out of the smaller growth stocks dealing in automation and robotics. I personally think that the automation/robotics/semiconductor tech sector has the potential for serious growth over the next ten years, and investing in an ETF that covers that sector can artificially diversify your holding in that sector without the risk of choosing a stock in the sector that might not secure a decent market share in the future. I've made very strong gains over the past couple of months with stocks like $KEM $CCMP $XBIT and most recently with $MBLY, that shot up about 35% after getting bought by Intel. My attitude is that there's going to be even more growth in automation in the future and interested in companies who are going to be vital on the supply chain in that industry. I think the tech blue chips will hold these markets to an extent, but they can't do it on their own, and need smaller companies to actualize future trends in automation. These companies will either benefit with contracts, or end up getting bought out by the likes of Amazon and the more established auto companies. I don't think that the latter will throw a bunch of capital into R&D into automation, but will instead buy up the tech that other companies are developing now. But there's no question that we're heading into an era of automation, and the question is what companies will rise to the top. ", "score": 2, "replies": []}, {"body": "Honestly my dude, you are probably fairly young (under 32?) And it's just 10k ( I know it's real cash but not crazy) invest in 2-3 stocks tops and you will see a better return Imo. Bigger risk but now is the time to risk (age/money) set your stop before hand and let them run! ", "score": 2, "replies": []}, {"body": "you enjoy researching stocks, but how much d you value your time.  imo your time woudl be better spent invested elsewhere than researching and hassling with this many stocks + the fees you pay.\n10k in savings is not a lot, i would invest time and money in to yourself to acquire a more valuable skillset to increase your income.", "score": 1, "replies": [{"body": "I shouldn't feel so insulted by a stranger on the internet, but that kinda hurts. I graduated from college and work full time using my degree, but in my spare time I've started a business using the skillset I've been honing since high school. It's certainly valuable, I make a lot of money doing what I do and it's a lot of fun! \n\nEdit to add: obviously that skill set is not trading stocks haha", "score": 7, "replies": [{"body": "not trying to hurt feeling, just giving advice i wish i had followed when I was younger.  \n\nThat's great,  also do my own business. Have you placed a dollar amount on your time yet?  Then how much ahve you spent managing $10k?  Factoring in your time and fees, what's your rate return looking like?  If you're youngish, i' just yolo that amount in two stocks that you believe in (mutual funds are too conservative), and just let it sit.  Spend the rest of your time enjoying or learning something else, or on your business, etc.  \n\nmy partner and my portfolio is split in to 4 stocks and 1 mutual fund, 20% each, it's a lot larger than yours (we're probably older and there are two of us).   I would never consider splitting it more than it already has been split.   If i wanted to hedge risk, I would just move a higher % in to mutual funds.", "score": 5, "replies": [{"body": "> Have you placed a dollar amount on your time yet?\n\nThis is very insightful.  I am just figuring this out at the end of university career.  Almost dropped the ball this quarter because I've invested my time into so many side activities that aren't outputting a lot of $$ for their time.", "score": 1, "replies": []}]}, {"body": "> obviously that skill set is not trading stocks haha\n\nIs \"trading stocks\" what you're going for here? I mean like active trading as opposed to long-term buy and hold? \n\nThis is outside your IRA, right? \n\nIf I'm understanding your goals here, it sounds like you can afford to be much more aggressive. What you have and what you propose rebalancing toward aren't aggressive at all.  ", "score": 2, "replies": [{"body": "You're right! That's what everybody is telling me, haha. I'm young, only have $10,000 to play with, and have a separate account for retirement. So yeah, I've decided to take some more risks here.", "score": 2, "replies": []}]}, {"body": "You're a very likeable guy ", "score": 1, "replies": [{"body": "Thank you! /r/wholesomestocks", "score": 1, "replies": []}]}]}]}, {"body": "What are your current holdings? Would they all be long term cap gains or have you held some less than a year? Though you want to rebalance by liquidating everything, you might be taking a 15% hit on cap gains in order to seek 5% better returns. ", "score": 1, "replies": [{"body": "So here's the thing... I have a couple holdings that have so much losses that they'd completely offset my gains 😅\n\nCurrent holdings, largest % to smallest:\n\nKMI\n\nPFE\n\nFCX\n\nINTU\n\nTER\n\nTXRH\n\nTSLA\n\nNAKD\n", "score": 1, "replies": [{"body": "Keep pfe and keep TSLA for now. Sell high.\n\nIf you really want to rebalance your shit, pfe is poised for growth sometime in the next 6 months. Set a limit order for 37 or so. It'll hit it. I like your idea to get into jnj, but just wait until life goes up again. Jnj is good, so is ABBV and Abt. Hell, there are a bunch of biotech companies that are undervalued right now, but if you want to sit back and just let them grow slowly I'd go with jnj Abt or ABBV.\n\nTSLA is also on a growth trend. When they actually announce the model 3 release date it'll see a big spike, and then after that release date is missed it will most likely crash. I'd personally sell it just before that release date, then you can see maximal gains. It might hit 279 or higher.", "score": 3, "replies": [{"body": "Good advice, and very entertaining to read. Thank you!", "score": 3, "replies": []}]}]}]}, {"body": "Love me some KMI", "score": 1, "replies": []}, {"body": "I'd reduce those 15% allocations to 10%. Change the rest to 5%. ", "score": 1, "replies": []}, {"body": "I thought mcdonalds were losing marketshare?", "score": 1, "replies": []}, {"body": "I would reconsider all those position and start buying these stocks by the lot (100 shares).\n\nafter a \"lot\" of one hundred shares in a specific stock think of how  you either want to diverse into another company or get a bigger stake in said stock.", "score": 1, "replies": []}, {"body": "I suggest checking out, A Random Walk Down Wall Street and The intelligent investor. \n\nTo be completely \"diverse\" you need to not only be in American markets but foreign markets, bonds, and REITs. \n\nThe best advice I have gotten and has been proven time and time again is most of your portfolio is in a index fund that follows the S&P 500, and bonds, then the left over in stocks to help move your portfolio. \n\nCheers 🍻 ", "score": 1, "replies": []}, {"body": "Change Apple to AMD but put a buy lower \nE.g.. if you can scoop it up around 13 it should be a solid hold for a while and will go up a lot over the next few years. Feels like they finally found their foothold ", "score": 1, "replies": []}, {"body": "What is your reasoning behind those picks?", "score": 1, "replies": []}, {"body": "Put 5% - 10% in gold and silver", "score": 1, "replies": []}, {"body": "10k...directly into WEED. 5 years = 100k. Being conservative. ", "score": 1, "replies": []}, {"body": "Get in on Papa John's during football season. Be an alpha male!", "score": 1, "replies": []}, {"body": "You have too many stocks in a $10000 portfoliio. Rebalancing costs more in transaction fees than the risk associated with having fewer stocks. The larger your portfolio, the more stocks it makes sense to own because rebalancing is a matter of selling $5000+ positions.\n\nI would pick your top two potentials and keep them in that one, or buy an ETF instead. The next time you drop $5000, add it to a new position. Diversification is not really an issue with $10000 because that's a sum of money that you could replace within a year of saving, hence the volatility on that kind of portfolio is pretty irrelevant as long as you're not knee-jerk selling at any news. When you have $100k, that's a sum that you could not replace easily, so it makes sense to limit your single company downside to a certain amount.", "score": 1, "replies": []}, {"body": "Depending on age and risk tolerance I'd definitely invest in stocks that have more growth potential. Everything you have is stable if you're shooting for dividends. Try looking at NVDA or AMD in tech, CARA in bio tech, BOA in banks or GS. If you're just doing this for fun and don't care about growth that's fine, but you would be much better investing in an etf or index. ", "score": 1, "replies": [{"body": "Great point, thanks for asking. I am young and have a decently high tolerance for risk. Based on these responses, and the fact that I'm a happy Bank Of America customer, I will be working on getting BAC in here! ", "score": 4, "replies": []}]}, {"body": "I just helped my niece invest her inheritance.  We only moved $100k into a brokerage account so she can get a feel for stocks.  We only bought 6 different companies.  I don't see the point of buying 4 shares of something or even 10. \n\nWhen I was starting out I would invest in Company A each month until I had $10k in the position, then I would start another.  8 shares won't get you anywhere.", "score": -5, "replies": [{"body": "Percentage gain is percentage gain, no? That matters more than number of shares as far as I know.", "score": 11, "replies": [{"body": "Yes but you should pick either high risk and put it all in 1-3 stocks or medium high risk and straight into IVV. You are straddling the border and never going to see the returns your hoping for. And transaction costs are going to kill you. A few years ago I was in a similar spot and bought AAPL, GOOGL, T, and JPM and they flatlined for awhile but have had a great LTM or so. Happy investing ", "score": 1, "replies": [{"body": "Thanks you too! People keep talking about transactions costs, but I don't pay any. There are free brokerage options out there...", "score": 5, "replies": []}]}, {"body": "How much does each trade cost you?", "score": 1, "replies": []}]}]}]}
