{"title": "Hedging Put Profits", "selftext": "Looking for guidance or ideas how I might be able to hedge profits on SPY puts. Unfortunately, I’m no FED governor or speaker of the house and work in banking. I’m subject to a 30 day holding period on all trades. I own SPY put options in an IRA account, I’m not interested selling options short (and frankly not sure if it’s allowed) to hedge against a reversal in price. Yes I get I can “just buy calls” but the vix and option pricing blah blah doesn’t make it very efficient. Is there a vanilla way for me to better hedge?", "id": "px8uv4", "created_utc": 1632842982.0, "score": 8, "upvote_ratio": 0.65, "num_comments": 14, "comments": [{"body": "If you can’t sell your put, the answer is to sell a synthetic put. \n\nBuy 100 shares of spy and short a call of the same strike as your put. You’ve now successfully locked in your profits and your positions unwind at expiration\n\nIf you really really can’t sell the call just buy the same amount of shares as you have negative delta to at least hedge partially. Maybe buy some short vix etn to hedge your long vol position", "score": 7, "replies": [{"body": "Surprised your suggestion didn’t involve equity swaps. Appreciate the note", "score": -1, "replies": [{"body": "Cheers. Not sure why you were downvoted? Maybe they didn’t catch the reference", "score": 5, "replies": []}]}]}, {"body": "Do you already have a long position in SPY that exceeds the deltas of your long puts?", "score": 3, "replies": []}, {"body": "You can 100% write options in an IRA and frankly, that’s the best way to lock in profits of a long put. I like this method a lot because by selecting a different strike you can customize: \n- how much of your equity you want to lock in\n- how much additional room for profit there will be\n\nIf you’re up enough on your long puts, you can  create a guaranteed profit scenario while still leaving additional room for more profit. \n\nNot sure why you’re not interested in selling options. If you’re just scared of being short something, you should read more into spreads (being short and long different strikes). They have less risk than even the play you did- long puts. Normally short puts have big risk but by also holding the long put, you limit that risk significantly. \n\nIf you know these things already and have other reasons you don’t want to sell options- my bad. \n\nOther options for hedging-\n\n Covered call (synthetic short put)-\nBuy 100 shares spy and sell a call with the same strike and exp as your put. This is a 100% direct hedge, and your g/l diagram at expiration will be a horizontal line with profit equal to what you have rn. Spy price could be anything and you’ll still have the same profit at expiration. You have to buy 100 shares tho which is ~$43,400 rn. Subtract the price of the call, but this will be a comparatively very small number. Plus, it involves a short call which you said you don’t want to enter. \n\nHolding long shares equal to your negative delta- but this is problematic unless you’re watching it like a hawk, buying and selling shares as the stock moves to stay delta neutral. \n\nBuying a call- not great IMO. IV is high rn so you’ll be buying a lot of time value that will be lost. If the price doesn’t move at all you’ll lose 100% of the extrinsic (in addition to the extrinsic you have left on your put). At expiration, SPY would have to move enough above your call break even to also cover your put equity lost.", "score": 2, "replies": [{"body": "IV is a bitch. Thanks for note", "score": 1, "replies": []}]}, {"body": "You could \"hedge\" by taking the profits, look at today it's a bloodbath", "score": 2, "replies": [{"body": "Ah yes, taking profits. I pose the question because unlike our politicians, I have trading rules. I can’t sell brother. Perhaps we’ll visit this comment later and see if your definition of “bloodbath” has changed.", "score": -1, "replies": [{"body": "A simple way you can lock in some profits on a long option without selling is to turn your long put into a vertical spread.  Otherwise, you better just hope the trade keeps going your way until you can sell.  Or that you have the capital to do what archegos suggested.", "score": 1, "replies": []}]}]}, {"body": "I do have long exposure but delta negative. Not upset about that though. The puts don’t expire for 6 months.", "score": 1, "replies": []}, {"body": "Especially since not everyone can DRS. Do if you can!!!", "score": 0, "replies": []}, {"body": "Well I was going to suggest selling a put at the next strike, which would lock in most of your gains by turning the position into a spread. It's allowed in an IRA, but might seem weird if you've never done it before. \n\nThe only other way to lock in gains on a long put would be to close the position. You can offset Delta by purchasing shares, but it won't completely negate a reversal.", "score": 1, "replies": []}, {"body": "Turn it into a spread maybe", "score": 1, "replies": []}, {"body": "Maybe sell puts a strike down for the same expiration or shorter term if you only want to collect initial investment", "score": 1, "replies": []}]}
{"title": "Cathie Wood’s Ark Sells Another $19.3M In Tesla As Stock Marches Upward - Tesla Motors (TSLA) | Benzinga", "selftext": "", "id": "pwx2to", "created_utc": 1632797900.0, "score": 2, "upvote_ratio": 0.55, "num_comments": 15, "comments": [{"body": "She’s required to sell in order to keep no single security in the portfolio greater than 10% of the total. She’s selling the absolute bare minimum. Look at the ARKK fact sheet. TSLA is at 10.61% and she sold 0.61% to bring it back down.", "score": 31, "replies": [{"body": "Thanks for the positive feedback.", "score": 1, "replies": []}, {"body": "&#x200B;\n\nThey actually changed that rule in their bylaws a while back.", "score": 1, "replies": [{"body": "Ah it seems you are correct, as of April 1st 2021. Though she’s mentioned in many of her investor calls and AMAs since then that 10% is her fund’s target threshold.", "score": 1, "replies": [{"body": "She wants the flexibility in case Tsla runs to not have to sell immediately as I think that is the only one anywhere close to 10%.", "score": 2, "replies": []}]}]}]}, {"body": "Yawn. She still has 4.1M shares worth 3.16B. They trade around their core positions.", "score": 11, "replies": [{"body": "When will these youtubers/bloggers realize this? Or do they understand n just think headlines like this will get clicks so don’t care? I don’t blame em, they learnt that from mainstream media", "score": 2, "replies": [{"body": "Could be both. Some might post misleading information because of ignorance, while others do so intentionally to create sensational content that draws clicks.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Where it just was?", "score": 1, "replies": []}]}, {"body": "Lmao she’s been doing this the past few weeks, and Tsla only been going up!\n\nAll I know, she did this before the Tsla split last year, and if you would of followed her moves…you would of missed out on some of the biggest Tsla gains!", "score": -9, "replies": [{"body": "It’s a weighted balance fund… she sells when it goes up and buys when it goes down to keep it properly weighted. Mind blowing how so many twist the motive on her plays. It’s pretty straight forward.", "score": 14, "replies": [{"body": "Yeah I know she the biggest bulls, but like you said, people will follow her moves, just hope they buy back in on dip.", "score": -4, "replies": [{"body": "you still don't get it", "score": 2, "replies": [{"body": "Lol sorry genius, now she buying the dips at cheap today.", "score": 0, "replies": []}]}, {"body": "IMO ppl who buy whole shares of a $700+ understand this… but I get where you’re coming from… fake news articles n videos that just want clicks don’t help the sentiment", "score": -1, "replies": []}]}]}]}]}
{"title": "Looking for a new Castle", "selftext": " AMD, MSFT, AAPL, MU, MRNA are on my short list.\n\nFor a while, I've traded financials and new-space. But, financials are way too high now and are going to burn-up on reentry so I'm looking for a cyclical that's hit the hardest to \"buy the dip\".\n\nBut - I've ignored quite a few sectors for a time and the first question is \"which are dipping and which are staying down\"?\n\nMSFT has seemed a pretty strong candidate for a while, as well as AAPL, but I feel both got too much play up until recently and have more to pull back (whether that looks like price down or sideways for a period of time, who knows).\n\nMRNA is definitely a cult classic, I don't know if it's overvalued or undervalued. Very tip-of-the-spear in biotech, a few more tricks up their sleeves, earnings seem strong.\n\nAMD and MU are getting pummeled by the usual - chip shortage driven price inflation with a strong pullback when it's realized the chip shortage isn't \\*THAT\\* bad....but both have strong fundamentals as well.\n\nSo AMD and MU are attractive, but MU definitely seems like something's wrong - don't know what yet, but 6 months since an ATH during a huge tech bull run? Could be a sand-pit.\n\nThoughts?", "id": "px8pv2", "created_utc": 1632842573.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 11, "comments": [{"body": "AMD is a good bet. They're taking share of the market from Intel. It will propel the stock for the next couple of years. MU is risky. There's a suspicion in the industry DRAM cycle peaked so their outlook is a bit cloudy. If you're interested in chips don't overlook ASML. With chip fab expansions the equipment manufacturers are going to benefit. ASML sold off today and is at bargain price.", "score": 7, "replies": [{"body": "ASML is a good suggestion, thanks. It seems equivalent expected return as much as AMD when you scale them. But, could make more sense to ride ASML until the fabs are built then swap to the actual chip manufacturer in time for increased earnings from onlining fabs?\n\nI'm concerned about AMD's foreign exposure since the US wants to go \"made-in-America\" and am not sure how to evaluate the AMD vs. INTC in that battle...\n\nAMD is more in demand and as investors we are in the business of owning and selling stock...not great companies.", "score": 1, "replies": [{"body": "Update: but AMD is way more in demand than INTC. Barring unforeseen changes", "score": 1, "replies": []}, {"body": "Can't help you with timing switch from ASML to AMD. It's not something I considered.  Keep in mind AMD will merge with Xilinx by the end of the year (most likely). Xilinx owners get 1.7 shares of AMD per 1 share of Xilinx in the merger. Currently I think Xilinx share price is at 1.5 ratio because they are waiting for final approval by China. When it's approved the gap will close.", "score": 1, "replies": []}]}]}, {"body": "I believe in MRNA. Their pipeline is very promising and they are at the peak of medical innovation. Stephane Bancel is also a smart CEO who is heavily invested in the company, owning 10%+ of the company.", "score": 1, "replies": [{"body": "I agree with the fundamentals, but how's your feeling on how \"overbought\" it is?\n\nBoth AMD and MRNA seem similar in that way, but AMD is now getting the wrath of \"cycling\" and MRNA may be some of that too. Making both an opportunity here soon.", "score": 1, "replies": []}, {"body": "Update to my thoughts, but MRNA does seem like a great potential, will be interesting to see where the dust settles in downward price action.", "score": 1, "replies": []}]}, {"body": "Moderna is a wild card.  It has that Tesla feel to it.  I bought a little Microsoft today.  Under 285 was hard to resist.  Good luck !", "score": 1, "replies": []}, {"body": "If you are looking for a castle, try to find one with a good moat.", "score": 1, "replies": []}, {"body": "MSFT", "score": 1, "replies": []}]}
{"title": "Are Netflix and Microsoft safe stocks to hold for a year or so?", "selftext": "I can only see streaming services getting more popular for the near future and for Microsoft, I kind of just heard that they're a good stock so yea. I didn’t really put much into either, I just want to have some reliable investments, even if my gain is not that much.", "id": "pxc883", "created_utc": 1632852659.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 14, "comments": [{"body": "Microsoft yes, but Netflix with the intense competition and lack of owned properties, I see the rope getting tighter around Netflix’s neck in the coming decade", "score": 18, "replies": [{"body": "Having a tiger around your neck does sound pretty bad!", "score": 2, "replies": []}]}, {"body": "Netflix taking on Amazon, Disney, Apple, HBO max, etc… is a huge ask. I would say Netflix is not a safe bet for continued growth over the next year.", "score": 11, "replies": []}, {"body": "Microsoft,  yes.", "score": 16, "replies": []}, {"body": "Replace Netflix with Google, or Apple, NVIDEA, V, BX, etc.", "score": 3, "replies": [{"body": "MA is building a buy-now pay-later service, and for that reason, I would choose MA over V.", "score": 1, "replies": []}]}, {"body": "Nothing is \"safe\" right now. Msft is up over 100% since the crash, I hold msft but if I was buying in right now I'd be very worried.", "score": 6, "replies": []}, {"body": "Anything can happen to an amazing stock in one year so both no.", "score": 1, "replies": []}, {"body": "Maybe... but as you are seeing today when bond yields increase tech gets hit. There is a greater chance of yields / interest rates increasing over the next year than decreasing. If you are in for the long haul then don't pay too much attention to it but if you're not gonna be happy with red in your portfolio over a 12m period then perhaps think twice.", "score": 0, "replies": []}, {"body": "I’m huge fan of Netflix and believe they will be around. Here’s a counter argument about other streaming sites\n\nApple- what do they even have. Lol no orig content that’s popular atleast I don’t know a single person who watches appletv\n\nAmazon- huge company has decent originals and I believe 1 of 2 competitors\n\nDisney- what’s left for them to make? Like some more star wars( I don’t watch but besides mandalorian I here new movies Arnt that great). A bunch of avenger spin offs ok but in. A digital world it’s hard to get the high budget returns( see black widow). They pushed a huge star away (scarlet jo). A lot of kids watch Netflix kids shows. \n\nHulu- also good content and originals. The other competitor next to Amazon. \n\nMy 2 cents I realize it’s mostly social observations but there’s some pretty rich ppl who invest on what ppl are doing not what the report says", "score": -7, "replies": []}, {"body": "No MSFT could definitely go bankrupt in that time.", "score": -5, "replies": []}, {"body": "I’m not really sure why anyone would be buying into tech right now.", "score": 1, "replies": []}]}
{"title": "Tesla (TSLA) secures massive order of 2 GW/6 GWh of Megapack batteries from Arevon", "selftext": "", "id": "pxa35d", "created_utc": 1632846484.0, "score": 137, "upvote_ratio": 0.98, "num_comments": 16, "comments": [{"body": "I know they are most likely not the same batteries but for comparison's sake how many Model 3's could this order supply?", "score": 9, "replies": [{"body": "SR pack is roughly ~50 kWh, so each GWh of battery cell supply means about 20,000 Model 3 SR's.\n\nThat Tesla is ***accepting*** such huge orders means that they don't believe they'll be battery constrained long. Cough - 4,680 - cough.", "score": 22, "replies": [{"body": "Nahh they are going to use CATL's LFe batteries, hence the new Megafactory in CA.\n\nTesla doesn't care where the batteries come from, they turn them into $$$$.", "score": 17, "replies": []}, {"body": "[Rumor is that](https://twitter.com/SawyerMerritt/status/1435835638016839681) Megapacks V2 will be using CATL's prismatic LFP batteries. \n\nAlso, Elon on Q2 call:\n\n>I see us sort of like consolidating around a 4680 nickel-based structural pack for long-range vehicles, and then not necessarily a 4680 format, but **some other format for iron-based cells**.", "score": 10, "replies": []}]}]}, {"body": "Ok this is huge. Normally people have no sense of scale when talking about battery projects, but this is by far the largest order ever made. Sounds like they'll be split among many different sites, but still - that's a big order!!!", "score": 6, "replies": []}, {"body": "6 GWh? Holy hell.", "score": 5, "replies": [{"body": "We thought 1.21 was big!", "score": 2, "replies": [{"body": "Greay Scott.", "score": 1, "replies": [{"body": "I'm more of a white, tannish color.", "score": 1, "replies": [{"body": "Dammit... I'm leaving it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Just a car company derrrrr", "score": 4, "replies": []}, {"body": "this is spread over 4 years, so it is not like they sold that much this month. still a good sized deal. that's about the size of two nuclear power plants. i wonder what kind of volume discount they get on an order that large.\n\nNEW YORK and ZUG, Switzerland, Aug. 17, 2021 /PRNewswire/ -- Capital Dynamics, an independent global private asset management firm, has announced that members of its U.S. Clean Energy Infrastructure (\"CEI\") team, will combine with Arevon Asset Management, its exclusive energy asset management affiliate, to form Arevon Energy, Inc. (\"Arevon\"). Arevon is supported by an investor group comprised of APG, the California State Teachers' Retirement System (\"CalSTRS\"), and a wholly owned subsidiary of the Abu Dhabi Investment Authority (\"ADIA\"). They have been long-standing investors with Capital Dynamics and will own 100% of the newly formed entity. John Breckenridge, previously a Senior Managing Director and Head of Clean Energy Infrastructure at Capital Dynamics, will lead the new entity as Chief Executive Officer.", "score": 3, "replies": [{"body": "Im at over 25k", "score": 1, "replies": []}]}, {"body": "What can we guess is Tesla's revenue for a massive project like this", "score": 2, "replies": [{"body": "I believe they stated that a Megapack starts at 1M each, this could be worth like 2B\\~.", "score": 2, "replies": []}]}, {"body": "I remember when elon was saying how they finally reach 1 gwh after numerous builds, but as things ramped up instead of 1 gwh for the year it'd start being individual sales of gwh or higher.\n\nGreat to see things moving along.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "pxd1dl", "created_utc": 1632855001.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 14, "comments": [{"body": "The main issue is not having an ability to truly be naked on these. You’ll have to provided collateral, so you are locking up $10k of equity for more than 2 years, to make $350. Of course if it does drop, even not below the strike, IV may spike and they’ll be no way to exit the trade profitably for a long time. \n\nYou’d be better off searching for a checking account signup bonus or dropping the $10k into a savings account. \n\nDuring a split an option will be adjusted accordingly.", "score": 19, "replies": [{"body": "are you saying that the 10k I have in my account won't be able to be used for another trade? do I understand correctly?", "score": 3, "replies": [{"body": "Yes. Even if you have portfolio margin (you don't), the ROI is just trash.", "score": 13, "replies": []}, {"body": "Correct. Even if you had naked option approval it’s still just an awful move", "score": 1, "replies": []}]}]}, {"body": "I don't think anyone expects tsla to drop to 100 in the next 2 years. Can it happen? Absolutely.\n\nAlso, to tie up 10k for a 3.5% return over 2 years doesn't make any sense. You're better off buying the stock.", "score": 11, "replies": [{"body": "Or even buying the lowest return indexes on the market which will still far outperform this play", "score": 1, "replies": []}]}, {"body": "Thanks all of you guys for your great answers. I completely missed considering the yearly returm with that play which is really low and not worth it.", "score": 5, "replies": []}, {"body": "Look at it like this. There are PLENTY of black swans that could pummel TSLA's stock price to well below $100. Examples below:\n\nThe CCP seizes TSLA's factory in China.\n\nA FSD enabled car crashes into a stopped school bus, killing all the children inside. TSLA FSD is blamed and banned. \n\nTeslas get hacked, killing all active users of the vehicles by maxing acceleration and locking the steering wheel forward.\n\nElon Musk dies while having sex with a prototype of the weird robot dancer thing.", "score": 4, "replies": [{"body": "LOL tesla sexbot\n\nSeriously this trade is as low risk as it gets. That is clearly reflected in the fact that the premium you receive vs. the capital requirements are worse than buying AA cooperate bonds.", "score": 3, "replies": []}]}, {"body": "\"Now I know naked puts/calls can be very dangerous but does anyone really think TSLA price could drop to $100 by 2024???\"\n\n&#x200B;\n\nYes. Right now there are actually 5.... Thats why there are 5 bids at $3.50", "score": 3, "replies": []}, {"body": "No such thing as free money.\n\nLook at spreads maybe 2 to 6 months out for better capital utilization.\n\nRUT CCS have been easy money lately because it has been so flat.", "score": 2, "replies": []}, {"body": "If you’re that afraid of risk, I don’t think you should be in options.", "score": 2, "replies": []}, {"body": "A money market account will return you more money and pretty much guarantee you those returns.\n\nAlso after a stock split/reverse split, your standard options are converted into equivalent non-standard options (ie options that control 10 shares instead of 100 shares, for example). These are generally extremely illiquid.", "score": 2, "replies": []}, {"body": "Horrible strat, first of all the open interest will be really low which will affect your ability to close it out for a profit", "score": 1, "replies": []}]}
{"title": "Casual weekly CC guy. Your suggestions on other stocks?", "selftext": "Hi guys,\n\nVery casual trader here. The only strategy I do regularly  is covered calls on RIOT and MARA. I use the weekly premiums to invest in other more stable, long term holdings.\n\nI have done CCs on these two stocks since almost the beginning of 2021. Got a few assignments, but things have been mostly successful. The high IV-high premium relation has made me pretty spoiled and I'd like to keep that going. I'm looking for your suggestions on other stocks that check the following boxes:\n\n\\-mid to high IV - for the sake of capitalizing on volatility enhanced premiums\n\n\\-pays a dividend\n\n\\-relatively affordable (under $50 a share?)\n\n\\-\"Good\" underlying company. I get this is totally anecdotal with many factors to consider. But I'm thinking a more established company not selling some genome-enhancing unrealized future technology, for example. \n\n&#x200B;\n\nA few companies I've been considering: INTC, SLB, ABT(pricier than I'd like, but potentially undervalued), XOM, Bp.\n\n&#x200B;\n\nThanks for any help. Alright thetagang, do your worst.", "id": "pxfsdl", "created_utc": 1632862791.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 19, "comments": [{"body": "I’m bullish on intel. Their new chip is solid and I like their strategy", "score": 4, "replies": [{"body": "Intel is a terrible stock for option trading.\nIt gaps. A lot. In an unpredictable directions.\n\nHell, no.", "score": 4, "replies": []}, {"body": "Intel likes to gap up and down massively on news with low IV. I'm very bullish overall on the ticker, but that type of stock is difficult to write covered calls on with low assignment risk.", "score": 3, "replies": [{"body": "I just own the stock and don’t write calls on it. But op mentioned them, I think they are solid", "score": 1, "replies": [{"body": "Yup completely agree. Valuation is dirt cheap even if they end up stagnating. Couple that with the strong roadmap they have put to regain growth and the stock is a steal at current price.", "score": 3, "replies": []}]}]}]}, {"body": "I am currently enjoying TMC.\n\nI grabbed a bunch after the watching the failed pump and ensuing Gamma Slide.\n\nIV is still pretty high and the price of shares is very low relative to value. The underlying business is pre-revenue and time to profits is likely 3 years.\n\nCurrently TMC is consolidating in the  low to mid $5 range and will continue to try and rise back up to the $9-10 range that most investors paid. Long term prospects are fairly straight forward. They have a big mining claim in the Clarion-Clipperton Zone to the west of Mexico where massive deposits of poly metallic nodules are just sitting around waiting to be scooped up from the ocean floor. Low organic/high metal content make for cheap and easy smelting into battery components. Part of a Green transition play. TMC already has an agreement with Glencore to sell the metals, Glencore has an agreement with Tesla to provide the metals.\n\nThe negative: There does exist a potential for a Gamma ramp, as most of the call options were initially only offered as monthlies and Oct 15 still has a fair bit of OI in the higher strikes. Currently very little Call volume in the $5-8 range but that may change if the stock starts to climb after consolidating. Selling Weeklies over monthlies may be the safer move for the near future.", "score": 3, "replies": [{"body": "Really interesting pick. Thanks for this one.", "score": 2, "replies": [{"body": "No problem. $TMC ended the week above $5, so there should be some upward pressure continuing through next week from t+2 and minor SI covering. Insiders bought another 2.6M shares near the bottom. Gamma ramp has filled in a bit in near ITM, so be cautious with selling the calls too close to the money. I sold a bunch for $7.5 10/15 and rolled into more shares. I may buy the calls back if it dips on Thursday from profit takers.\n\nAnother potential ticker is $CANO. I am riding some $15 10/15c on another large insider buy. Will be watching to see if a buy opportunity arises after selling the calls. I'm not sure of the play yet but it has potential.", "score": 2, "replies": []}]}]}, {"body": "I like Viacom. They have great IP and they’re a relatively new player in streaming.\nAnything under $40 is a solid entry point. It likes to stay in the 39-41 range. For the past two weeks it closed Friday at 39.99 IIRC. A nearly 1% premium per week is obtainable. \nAnd the dividend yield is a nice 2.4%", "score": 3, "replies": [{"body": "Great suggestion. What’s with the big spike from earlier this year, were they shorted?", "score": 2, "replies": [{"body": "Part of the Archegos ordeal. It moved down just a little, but Bill Hwang was margin called because he was way over leveraged. It affected a few other stocks.\n\nThat wasn’t a great synopsis, but look it up!", "score": 1, "replies": []}]}]}, {"body": "I keep the majority of my capital in value stocks with high dividends and use the rest on leaps for growth/recovery names. Margin power used as collateral for PCS/CCSs.\n\nFor high IV best ones IMO are BGS (food company with high short interest due to high debt; it is risky so I sell pretty close to the money), XOM, CVX. Rangebound stocks are also good for this if you can buy them when they are testing support, since you can be a bit more aggressive on the CCs (i.e. T and O right now).\n\nGenerally with the dividend portion of my portfolio I am to generate 10-12% a year on average for premium yield on cost. I avoid assignment (i.e. roll out + up when possible near ex-div date if near the money and on expiration) until the stock becomes a long term holding for tax purposes so that certainly eats away at the premium. I also don't bother with cash secured puts on these, just buy them outright since I want to own the shares for as long as possible.", "score": 2, "replies": [{"body": "Gold response ;) \n\nThank you, that gives me some things to research.", "score": 1, "replies": []}]}, {"body": "FUBO very cheap rn and has nice premium for CCs\n\nMajor catalysts coming for them next few months as well", "score": 2, "replies": []}, {"body": "SOFI, WISH, HUT, MVIS, PLTR, RIOT - not financial advice, I'm retarded.", "score": 2, "replies": []}, {"body": "$F has been really good to me the last few months.", "score": 1, "replies": []}, {"body": "INTC is great. MRK is another good one that should continue going up in the short term. GLD is one of my favorites which had a good dip this week to jump in.", "score": 1, "replies": []}, {"body": "Some others not mentioned yet: TSN, COP, WY", "score": 1, "replies": []}, {"body": "LMT. Stable as hell. Barely moves.", "score": 1, "replies": []}]}
{"title": "What do y'all think about Tesla?", "selftext": "[removed]", "id": "pwy79c", "created_utc": 1632801860.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 15, "comments": [{"body": "At $791 what could possibly go wrong?", "score": 6, "replies": []}, {"body": "What’s Tesla? Never heard of it.", "score": 3, "replies": []}, {"body": "Are you for real?", "score": 2, "replies": []}, {"body": "I used to have it, sold it back when it hit $890. I just saw that Cathie Woods been selling A LOT of tesla, maybe she knows something we don’t. I like Elon too, and I love tesla cars. I got into the stock before it split, so my average cost was $300. If it ever dipped back down to $400-500 range i would definitely pick up some more. maybe even low $600’s", "score": 2, "replies": []}, {"body": "Trash compared to $Lcid 🚀 - haters will say “they haven’t even delivered a car”…", "score": 2, "replies": [{"body": "They haven’t even delivered a car!   $GOeV /s…", "score": 1, "replies": []}]}, {"body": "Muff cabbage", "score": 1, "replies": []}, {"body": "If it's obvious to buy then buy it. It's all gambling. Go with your gut, big cat", "score": 1, "replies": []}, {"body": "I own a Model 3. Tesla has the worst service center I’ve ever experienced. If the car dies immediately after warranty then they will be the worst car company ever. But right now the car is pretty cool", "score": 1, "replies": []}, {"body": "Hello HF intern, or junior finance student writing your paper. Cant speak for y’all, but I think you should be banned. Best of luck!", "score": 1, "replies": []}, {"body": "This is that new startup, right?", "score": 1, "replies": []}, {"body": "Tesla despite all the hype still has major hurdles to overcome. Their cars are still shoddily made with paint chipping off, awkward controls regarding their touch panel, their rather inconsistent quality, and their still limited range due to the lack of infrastructure of charging stations.\n\nTesla has the personality of Elon Musk but their vehicles are no longer special as other companies are beginning to catch up. If Tesla can standardize their vehicle production quality, transition to a more traditional car dealership, and invest heavily into EV charging stations around the country then they will remain top dog in the EV world.", "score": 1, "replies": []}]}
{"title": "TEVA - Double Bottomed and Going Up", "selftext": "Are you sick of buying stonks which were going up until the very moment you bought in?\n\nHave you been busy the last few months carefully correlating your zero revenue \"to the moon\" soon to be chapter 11 tesla impersonators in alphabetical order to take your mind off the minus 50% value of your portfolio?\n\nWell perhaps its time to give good old Boomer Buffett's value investing method a try\n\nI give you TEVA Pharmaceuticals, Warren Buffett's Berkshire Hathaway owns over 42 million shares in this stock which has been beaten down the last few years waiting for the Opioid settlements to play out, this was held up by about 18 mths due to the covid situation but the CEO in the July earnings call indicated that he expects the settlements to be wrapped up within 12 mths, this means there should be green pastures ahead for this stock\n\nIt was reported today that Teva has reached a settlement agreement with Louisiana, now may be the perfect time for value seekers to pile into the Buffett held TEVA stock which has recently double bottomed off its low of $8.60.\n\nIt has kicked off  its settlements with a fair deal where TEVA  pays Louisiana $15m over 18  years and provides a further $3m in addiction &  recovery aids\n\n[https://finance.yahoo.com/news/teva-reaches-agreement-louisiana-settle-164000933.html](https://finance.yahoo.com/news/teva-reaches-agreement-louisiana-settle-164000933.html)\n\nThis is great news for TEVA shareholders, light is well and truly appearing at the end of the tunnel and this should be the start of a long line of positive catalysts for the stock\n\nConfidence is evident as TEVAs stock price is rising rapidly today, up in an otherwise bearish market", "id": "pxbxmt", "created_utc": 1632851826.0, "score": 10, "upvote_ratio": 0.76, "num_comments": 9, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|14|**First Seen In WSB**|8 months ago\n**Total Comments**|1083|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/otxzlz/zim_integrated_shipping_services_shipping_rates/) [x](https://www.reddit.com/r/wallstreetbets/comments/otyams/zim_buying_a_dollar_for_50cents/) [x](https://www.reddit.com/r/wallstreetbets/comments/otzbbl/zim_there_be_gold_in_them_there_shipping_crates/) [x](https://www.reddit.com/r/wallstreetbets/comments/n13abg/vale_vale_sa_eyeing_ev_market_mulls_base_metal/) \n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=pxbxmt)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=pxbxmt)", "score": 1, "replies": []}, {"body": "One of the few large cap value plays in this market.  legal risk is the only thing holding this back, and we just got a huge win in Louisiana.  This is gonna be big.\n\nETA i'm balls deep in shares and calls (12 strike, jan '22 and jan '23 still relatively low IV).", "score": 8, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I managed to ride it right to the bottom before I sold it.", "score": 3, "replies": []}, {"body": "Same, sold at a good high price.", "score": 1, "replies": []}]}, {"body": "Anything below 10 bucks is a steal for sure. Don’t forget, it’s also heavily shorted and they might have to close those positions soon.", "score": 6, "replies": [{"body": "I see ~2% short interest, so that doesn’t seem to be a factor. This is a buy on fundamentals and lessening legal risk alone.", "score": 2, "replies": [{"body": "The fact that it is so little shorted given its legal issues is a bullish sign, shorts know this is the bottom", "score": 1, "replies": []}]}, {"body": "This is what we’re resorting to? “They might have to close soon”?", "score": 1, "replies": []}]}, {"body": "For a moment I thought Teva sandals had their own stock.  Oh well.", "score": 2, "replies": []}]}
{"title": "$AMZN, your cannabis diversification play. #shitDD", "selftext": "Most people know that $AMZN is lobbying for nation-wide recreational cannabis legalization.\n\nWhy is that?  Well at first one might consider that big companies tend to invest, maybe AMZN has a hefty cannabis portfolio as is, so they are seeking returns.\n\nBut I believe its more simple than that.\n\nYou see if they can get the Fed to allow Mary-Jane shipments, one things for certain, people will buy them.  Compare the cost of anything and it always comes back to scale.  I live here in Oregon where cannabis has been legal for many years.  We were one of the earlier states to adopt it.  My point here is that the way we sell it is brick and mortar, and we all know how Amazon does against Bricks and Mortars, they put them out of business.\n\nTypically when I want to get some pot, I walk down a few blocks to the dispensary, some tiny little shop staffed by 6-7 people and its face to face what do you want? show you a few things, etc etc.\n\nNow don't get me wrong, this sort of sales seems to make sense with Pot more than almost any other product.  Let me see it, let me smell it, etc.  But you also need to consider that Stoners, ppl that smoke pot, could also give 2 fucks about how it looks and smells if its left on their doorstep for half the price.  So there is a lot of labor hours in the current face to face sales method of dispensaries that Amazon can cut out and save consumers on price.\n\nThere is also something to note about the vast increase in sales a widespread legalization bill would cause.  With Cannabis, it is an ever evolving science.  Much more complicated than your average field of corn or orchard or what have you.  You need to factor in growth speed, quality of growth, quantity of growth.  THC content of the plant as well as other terpenes.  Make the plant grow happy healthy and strong and fast.\n\nWhat's my point on that?  well we don't truly know which companies will have it figured out the best.  But lets look at Tobacco, there were what like 4-5 big Tobacco companies in the end?  And one can only assume that when you can buy a pack of 20 joints for the cost of a pack of cigarettes, that company will be the one taking over and putting the small guys out of business.\n\nSo again, my point is that we don't know which companies will end up as big weed.  What we do know is that if you can sell your big weed online through Amazon, people will likely buy it, love it, and become the most repeatable customer ever.  So whichever company makes it, Amazon wins.  Their shipping is too good, too smooth too well coordinated in their warehouses.  They just want one more product to send to people.\n\nSo when you finally hear about MJ bill getting passed, i'm betting $AMZN wins.", "id": "pxdf9b", "created_utc": 1632856111.0, "score": 17, "upvote_ratio": 0.76, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|3 months ago\n**Total Comments**|73|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/plcu2z/trash_dd_por/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=pxdf9b)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=pxdf9b)\n    \nHey /u/PaleontologistWest, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "They're not going to sell weed. They want it legalized so they can market and sell all that paraphernalia under future marijuana or weed catagories on their site.", "score": 12, "replies": [{"body": "This and I would guess because somewhere in their conglomerate they have government contracts so they have to test and expel for weed. Dropping that mandate opens a massive employment base", "score": 7, "replies": [{"body": "Sooooo true about the employment. More warehouse workers, drivers etc.", "score": 1, "replies": []}]}]}, {"body": "I don't think the local governments will be so keen to allow Amazon shipping it all over to end users. This was the case for alcohol (in my state) until covid changed the rules and allowed it to be delivered. I still go buy it at a liquor store now instead of having it delivered (tip and delivery fees ain't worth it).", "score": 4, "replies": [{"body": "Well I thought about why not ship alcohol and tobacco.\n\n\\#1 you don't ship tobacco for the same reason you don't invest in Tobacco.  Its scummy.\n\n\\#2 for Alcohol, it does not make nearly as good of a shipping product as marijuana.  What you want for shipping costs is a light weight and a small size.  Marijuana comparatively is much lighter and smaller and less fragile.  Most alcohol comes in either a glass bottle or cans which is not great for fragility during shipping.  IE it breaks ez, makes a huge mess, takes a lot of time to clean up, and in the end its really heavy so it would make the trucks impossible to even move anywhere.  and you'd likely injure your employees.\n\nTLDR  Marijuana is the optimal choice for a substance to ship based on health as well as numerically according to shipping cost standards of size and weight\n\nThe only thing better is pills, and they ship a lot of those in the form of Caffeine pills, vitamins, anything really, they already love to ship bottles of pills.", "score": 2, "replies": [{"body": "I completely agree with that sentiment about alcohol and tobacco. But keep your news on this Halloween because there's always stories of kids getting into edibles. That'll be their argument againsy and it'll keep mom's everywhere clutching their pearls. Full legalization is a ways out and Amazon becoming a weed shop too is further out. Again there's alot of logic in your theory, but ultimately there are still people who think it should be outlawed which makes it hard to invest in. I bet we see prohibition continue in some states until the day we die.", "score": 3, "replies": []}]}, {"body": "They are looking to get into pharmacy or have already, so surely once it’s legalised it would just be like any other over the counter or script drug - so they can sell it all", "score": 1, "replies": []}]}, {"body": "Nah they want it legalized cuz half the work force is stoners and they need workers bad", "score": 2, "replies": []}, {"body": "just in the packaging and shipping or just being the middle man they make money. its a win no matter how they, meaning amazon , does it", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "20 gs for 160 on denex thats a good invesment lmao", "score": 1, "replies": []}]}, {"body": "Amazon always wins as long as capitalism lives on.", "score": 1, "replies": []}, {"body": "IIPR", "score": 1, "replies": []}, {"body": "they will put weed in whole foods next to the candy and magazines", "score": 1, "replies": []}]}
