{"title": "[deleted by user]", "selftext": "[removed]", "id": "vyjldx", "created_utc": 1657762032.0, "score": 73, "upvote_ratio": 0.86, "num_comments": 77, "comments": [{"body": "Someone can correct me if I'm wrong, but basically whatever you do, you are already $5k under, no reset button. You can roll over to a later date and collect more premium, but that only masks the current loss. You can let it expire and open a new position after. Either way you are losing the same amount of money this week whether you materialize the loss or not. \n\nArguably by rolling you can open a new position earlier than Monday so you may get slightly more premium.", "score": 48, "replies": [{"body": "Overall id say you’re pretty spot on. Although letting the calls expire could open them up to assignment.\n\nAs for the loss, even though it is listed -$5330, I prefer to think of it as what are you actually losing from your account prior to the position being put on. Since they took in $3240 in credit, their actual loss is their gross loss minus the credit they gook in from the position being put on which becomes $2090. Still not great but more palatable for most people. I would also personally not put on any trade that risks more than 5% of my account unless the market is really going my way but that’s personal preference. If anyone has a higher burn level, then risk what you can afford to lose.\n\nEdit: proper words", "score": 15, "replies": []}, {"body": "My break even is ~144.5", "score": 0, "replies": [{"body": "Selling the 142s was your mistake.", "score": 19, "replies": []}, {"body": "Take assignment and sell 144 puts to zero it out,", "score": 2, "replies": []}, {"body": "So it looks like with the premium you will profit about 6 cents per share or a total of $78 if it closes at $144 tomorrow", "score": 1, "replies": []}, {"body": "NFA, close position today maybe you'll break even", "score": 1, "replies": []}, {"body": "You just might make it if you can close out at the bell", "score": 1, "replies": []}]}]}, {"body": "Roll it or just let it exercise and sell puts to get the shares back", "score": 12, "replies": [{"body": "Leaning towards allowing exercise bc of earnings call", "score": 4, "replies": [{"body": "Depends on if you like your apple shares. If you want to keep them roll up and out. Personally I would roll so I could collect more premium but if you want to let it exercise that’s fine too. You could let it exercise and then sell outs at the price you like.", "score": 2, "replies": [{"body": "Ended up taking your advice. ty", "score": 2, "replies": []}]}]}]}, {"body": "I would hold until Friday and watch for reversion toward the 21 EMA, aiming for breakeven.", "score": 11, "replies": [{"body": "Interesting! I’m leaning towards doing nothing so I can be out of it before earnings. Don’t have a good feeling about what guidance will be on the 28th", "score": 7, "replies": [{"body": "Apple hasn’t been giving guidance since the pandemic started.", "score": 9, "replies": [{"body": "Still worried it will find an excuse to dump in the ah", "score": 3, "replies": [{"body": "I definitely get it. I try to avoid earnings when it comes to options. I’m personally hoping for apple to hit a multi-year low so I can scoop up more shares.", "score": 8, "replies": []}]}]}]}]}, {"body": "I would of delta neutral or bought some apple as hedge.", "score": 8, "replies": [{"body": "ty yes it’s fully covered now.", "score": 3, "replies": [{"body": "Awesome! I make most of my money by doing this.", "score": 6, "replies": [{"body": "Maybe this is a dumb question but how does the delta hedge help for a pure short call position? I understand how it could work in other trades but for a short call position it’s not like you’re a market maker, profiting off spread right? Or do you just mean as a counter to the trade moving against you, in which case wouldn’t it make sense to just close some of the calls?", "score": 1, "replies": [{"body": "A hedge just offsets any possible loss. He owns the shares, it’s a covered call. Thats the hedge. He could have also sold puts to make it a short strangle, but would need margin or cash for that.", "score": 3, "replies": [{"body": "Looking at specifically \"this specific sold call position\" how is the hedge beneficial? It just removes the upside; if the underlying tanks then you removed your profit potential of the CCs. However if the goal is not just \"making this trade profitable\" but rather to get more AAPL long term, then it makes sense.", "score": 1, "replies": [{"body": "Correct, but a hedge isn’t generic, it depends what you are expecting the market to do. Selling covered calls implies anticipation of sideways drift or mildly bullish movement, so selling puts would also fit that criteria.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Roll it. We are in bear market. You will get you day to get out. Fed meeting coming up in July.", "score": 5, "replies": [{"body": "Took your advice for the reasons you cite. ty", "score": 2, "replies": []}]}, {"body": "Where can i learn about options the way you guys talk on here please ? All i do is lose money buying calls and puts 😥😥😥", "score": 6, "replies": [{"body": "Tastytrade", "score": 10, "replies": [{"body": "Thank you", "score": 2, "replies": []}]}, {"body": "Losing money isn't mostly that you picked the wrong way.I'm wrong all the time that's why I try not to tell people what to buy. I do know since I'm wrong so much how to hedge if I'm wrong, so that I may lose at the most $20 or so from a $2000 loss. (Or make money) \n\nAlso, I keep practicing my technicals and fundamentals. I haven't had to hedge too much lately but risk management is the best tool out there I think.", "score": 3, "replies": [{"body": "How do you hedge when you are wrong ? If you are long a call and you are wrong, how do you hedge ? Do you just play the other side ? Thanks.", "score": 1, "replies": [{"body": "If I was going for a long call in this environment I would already have a 1st trigger sequence for a free risk trade. \n\nI don't buy calls for less than 3 months. I would have time to see If I want to sell against it for premium  while I wait,(diagonal) can short the underlying to get delta neutral. \n\nAll kind of ways to risk management. The free risk trade is called dynamic spread.", "score": 2, "replies": []}]}]}, {"body": "Cboe oic occ school videos- its free - option alpha not bad either. If want to get books, many to recommend but the mcmillan books are bibles-tasty has free good courses -lastly, option playbook by overby is a gem", "score": 3, "replies": []}, {"body": "If you're losing money buying them, you should be selling them instead. My winners are are about 10:1 sell:buy", "score": 3, "replies": []}, {"body": "Tasty trade - Mike and his whiteboard on YouTube", "score": 3, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}, {"body": "On god", "score": 2, "replies": []}, {"body": "Start with conservative strategies where they are a bit neutral to price movement with in a band. Buying calls is a bullish bet in a bear market which may not work out all the time.", "score": 2, "replies": []}]}, {"body": "Friday is OpEx so this is really a gamble.  Could easily expire worthless, or market is just happy to have the CPI report behind us and we rally.  I’d hold them until Friday and roll if needed.", "score": 5, "replies": []}, {"body": "You said your breakeven was 144.5\n\nI'm looking at yesterday's pricing but if you BTC your position now, then sell a $147 call with 7/29 expiry ($454/contract) you would be back in the positive. \n\n* BTC = -$5330\n* Sell 13 $147 contracts @ $454/contract X 13 contracts = $5,902\n* Net Profit = $572 (plus the $3240 you already collected)\n\nNow if it does get assigned on 7/29 you have sold above your b/e price.", "score": 4, "replies": []}, {"body": "Remind me! July 16", "score": 2, "replies": [{"body": "I will be messaging you in 1 day on [**2022-07-16 00:00:00 UTC**](http://www.wolframalpha.com/input/?i=2022-07-16%2000:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/options/comments/vyjldx/short_13_aapl_142_july_15_calls/ig2zkrm/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Fvyjldx%2Fshort_13_aapl_142_july_15_calls%2Fig2zkrm%2F%5D%0A%0ARemindMe%21%202022-07-16%2000%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vyjldx)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "If you get lucky and market tanks on PPI or Friday is OPEX and are normally red or down days.", "score": 2, "replies": []}, {"body": "1300 * 2 = 2600\n\nThere's $2700 of optionality left?\nAdditionally, there's the specter of a market down move because of the inflation rates, right?\n\nI'd say let that fucker burn itself out. short delta short vega is fine in this economy.\n\nMaybe reduce? If you don't want to be in for 13, maybe you want to be in for 6?", "score": 2, "replies": []}, {"body": "I’d roll, if Friday doesn’t get you out. You’ve got 2 weeks until earnings, you think it will be nothing but sideways or up for 2 weeks in this environment?", "score": 2, "replies": [{"body": "Took your advice. ty", "score": 1, "replies": [{"body": "Hope it works out, $150 is a strong line of resistance so if you get a pullback from that, you should be able to get out relatively unscathed, depending on what you rolled to.", "score": 1, "replies": []}]}]}, {"body": "I don’t see a good solution for this. Looking at chart it might start to go down today and your loss might be smaller.  If you want to hold it’s your choice but Rolling will not save you.", "score": 2, "replies": []}, {"body": "Buy shares to cover is the only thing you can do didn’t you have a stop loss?", "score": 2, "replies": [{"body": "Fully hedged now!", "score": 1, "replies": []}]}, {"body": "Your going to be fine.", "score": 2, "replies": []}, {"body": "You are SHORT THE STOCK RIGHT NOW. Appl 146.5 12:30. Extrinsic value is under .20 or 20 per option, and this is dropping. So you have an Excellent chance of being assigned. If you are assigned then you get that .20, but then you have no way of knowing if Appl will open Up or Down in the morning.\n\nMy advice (which is worth ZERO) either close or roll. If rolling , go as far out as you can in strike avoiding a debit. Stay in monthly since you will get the best prices. This looks like the Aug 150 or Sept 155. \n\nOn the other hand what do I know maybe the market is down 200 points tomorrow morning and Apple opens at 100.", "score": 2, "replies": [{"body": "I’ve got the shares, so at this point I’m more worried about the fact that I’m missing out on all this upside. 🤷‍♂️", "score": 1, "replies": [{"body": "Got it. So this is a covered call, that just got away. If you want to give it more time you could roll to Aug Sept, and see if prices back off, but right now it could be called away tonight. You only miss the upside on a covered call when it is called away. If you can roll to Sept for 155 and still gets called away , at least you get 155, not 142.\n\nTom Sossnof would call this a HIGH CLASS problem, but in reality to get 144.5 when the stock is at 146+ does hurt.", "score": 2, "replies": []}]}]}, {"body": "Me? I'd roll it up and out to like 7/29 or 8/12 collect (some more) premiums and see if this 75 or 100 basis point by then will kick all of our azzez...", "score": 2, "replies": [{"body": "ty, the additional complication (aside from Powell) I forgot to mention is aapl earnings on the 28 or 29. Unsure how I want to be positioned going into that.", "score": 1, "replies": []}, {"body": "Ended up taking your advice. See update to the op. Thanks.", "score": 1, "replies": []}]}, {"body": "Everything is down today except apple 😩", "score": 1, "replies": []}, {"body": "Yikes.  Change your name and address with your broker.  \n\nSeriously tho, I think we’re about to hit a mini bull run due to bad news exhaustion, get out while you can", "score": 1, "replies": []}, {"body": "apple will fall short more !", "score": 1, "replies": []}, {"body": "Is tesla a good option", "score": 1, "replies": []}, {"body": "When did you buy this position?", "score": -1, "replies": [{"body": "*why", "score": 1, "replies": [{"body": "Why ask why", "score": 0, "replies": []}]}]}, {"body": "Wow big brain move", "score": 0, "replies": [{"body": "You’ve nerve had a trade go back I guess?", "score": 0, "replies": []}]}, {"body": "At this juncture you want to retain the stock - it’s trading at 144.94 .I would take the premium and close - the low for the day was 143. Play the intraday and see what 1-2 pm brings , maybe even 3 pm. People are nervous stock might drop. You want to buy to close as close to 142 as possible . This avoids assignment , leaves you opportunity to sell another day . Next time take less premium and  sell further OTM covered calls like 146 with .92 premium .", "score": 1, "replies": []}, {"body": "I hope you closed them this morning before the spike in AAPL ...\n\nI had shorted AAPL $140 and $142 puts.  I got a little scared when AAPL went down to $143 and closed them early (albeit at a profit) rather than letting them ride.  Grrr ...", "score": 1, "replies": [{"body": "Nope. I’m fucked. 😂", "score": 1, "replies": []}]}, {"body": "Roll it to Aug with a higher strike like $145 hopefully for some credit. July  Fed meeting is coming up end of the month, if markets reacts wildily, you can get out on the day", "score": 1, "replies": [{"body": "Did exactly this. Thanks.  🙏", "score": 2, "replies": []}]}, {"body": "why are you shorting one of the richest companies in the world?", "score": 1, "replies": [{"body": "Dumbest post in this thread and it’s not even close", "score": 0, "replies": [{"body": "it's on an upward trend, at bottom resistance, there is no way you actually shorted it, your trolling", "score": 1, "replies": [{"body": "Only recently jackass", "score": 1, "replies": []}, {"body": "Plus check the options time and sale data for aapl. You can see my roll go through at the strikes I cite.", "score": 1, "replies": []}]}]}]}, {"body": "I guess this is the disadvantage of naked short calls", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vykmxo", "created_utc": 1657765214.0, "score": 170, "upvote_ratio": 0.91, "num_comments": 77, "comments": [{"body": "You should remove the stuff after '?' In those Twitter links. They're added there for tracking and could be traced back to the account that copied the link.", "score": 96, "replies": [{"body": "👀 The more you know! Thx", "score": 33, "replies": []}, {"body": "xd", "score": 1, "replies": []}]}, {"body": "He is not the Autopilot Chief, that's Ashok Elluswamy.\nAndrej was head of AI.", "score": 22, "replies": []}, {"body": "Apple and Google will be fighting over him", "score": 20, "replies": [{"body": "From his message, it sounds like he's going to do something for himself. Sounds very similar to JB Straubel leaving on good terms in 2019.", "score": 9, "replies": []}, {"body": "I doubt it ... Tesla's approach (affordable cameras/sensors) self driving is criticized by all other self driving companies.\n\nEveryone thinks you need the best sensors, best computers to solve the problem then optimize and work your way back to affordable.\n\nElon wanted to start with affordable.", "score": -9, "replies": [{"body": "And neither approach has been able to achieve general acceptance so far.", "score": 1, "replies": [{"body": "any technologist would say give me the best tools possible ... but I love how reddit always downvote anyone criticizing tesla", "score": -1, "replies": [{"body": "Oh, I didn't down vote you. I think Tesla is way overvalued.", "score": 1, "replies": []}, {"body": "The best tool. Not necessarily three or four tools that all might be helpful, but might cause confusion rather than clarity when a computer interprets them. \n\nNo company has solved this problem, so it's impossible to say who's right,  but it makes sense to me that Tesla wants to go with the one kind of input proven to be good enough to drive safely.", "score": 1, "replies": []}]}]}]}]}, {"body": "I guess Elon ment “everyone” when he said everyone needs to work 40 hrs on-site or they would get the boot", "score": 29, "replies": [{"body": "Sure.....if you believe the cover story about people working \"on site\", and not the real reason: That he needed to do massive layoffs to cut costs due to delayed factories and a slump in sales.", "score": 3, "replies": [{"body": "Every car they produce was sold ~6 months previously with ~30% margin. They're doing just fine with costs and sales. Secondly, AI is absolutely vital to their long term goals. They wouldn't fire the genius making it happen to cut costs even if they were worried about that.", "score": 3, "replies": [{"body": "They've lost at least $400m on BTC alone. The GROSS margin (not net) was 30% in Q1. It's not going to be close to that for Q2 and worst of all, the new factories are in Elon's own words \"cash furnaces\" and it comes at a time when there's a Tesla sales slump (down 17%).\n\nQ2 is going to be a loss. We just don't know how much.", "score": 5, "replies": [{"body": "Are you trolling? Obviously any CAPEX intensive business can be labeled as a cash furnace. By your logic Amazon is also a bad company. It should be obvious that they expect the \"cash furnace\" to have a significant future return.", "score": 2, "replies": [{"body": "What are you talking about? tesla are building two new factories that are several months behind schedule (in part due to a lockdown in china and general lack of materials/logistic issues)  and therefore costing hundreds of millions more than their original projections. They're burning money without producing anything due to delays. This isn't priced in or part of the projected model, which is why Q2 is going to be brutal.", "score": -1, "replies": [{"body": "They're not behind schedule with the new plants. Do you even know where the plants being built are? Hint: not in China.", "score": 1, "replies": [{"body": "They are, and the china one is on pause. Berlin is behind on it's required upgrades and so is Austin. It's not good all around.", "score": 1, "replies": []}]}]}]}, {"body": "The way to make money with a factory is to make things with the factory, not get rid of top talent. They're working on that. I'm not denying this will be an ugly quarter or year or whatever short to  medium term time frame you want. I'm just saying they didn't fire him, and if they did, it wasn't for any of the reasons you claim.", "score": 2, "replies": [{"body": "Of course, but the problem they're facing is that with the delays to the factories, cash is being burned through at an alarming rate, and during this time, all the other manufacturers which have taken much longer to \"turn their cruiseships\" are catching up.\n\nTesla has signaled that that autonomous driving isn't a selling point anymore (and there goes one of the things people used to flag wave about Tesla's valuation) and the departure of high profile execs in those positions confirm it.\n\nFor me, the problem I see is that Tesla is declining from a \"growth\" comaony, to a car manufacturer, and not a greta one at that.\n\nTheir current valuation is 38x times revenue. You cannot name a single large cap or even billion dollar growth company that has close to that valuation and by 2024, several of the major car makers that absurdly dwarf Tesla in terms of output capacity are going fully electric.\n\nIMO Tesla has a finite window to capture as much as the market as possible and right now, it's at a standstill while that window slowly closes.", "score": 0, "replies": [{"body": ">Of course, but the problem they're facing is that with the delays to the factories, cash is being burned through at an alarming rate, and during this time, all the other manufacturers which have taken much longer to \"turn their cruiseships\" are catching up.\n\nWhat delays? \n\nDefine alarming rate. Seriously, they're ramping up two new factories, what else do you expect? As I said, by your logic Amazon is also a shitty company for high CAPEX. \n\nCatching up? Tesla is the only company with positive YoY unit growth. \n\n\n>\n>Tesla has signaled that that autonomous driving isn't a selling point anymore (and there goes one of the things people used to flag wave about Tesla's valuation) and the departure of high profile execs in those positions confirm it.\n\nBased on what? Because Andre left? They've been running the program for more than 4 months without him and updates have rolled out per usual. \n\nJerome Guillen and JB Straubel both left and the company has done just fine. People come and go for many reasons. \n\n>\n>For me, the problem I see is that Tesla is declining from a \"growth\" comaony, to a car manufacturer, and not a greta one at that.\n\nDeclining in growth? C'mon, this is just lazy commenting. \n>\n>Their current valuation is 38x times revenue. You cannot name a single large cap or even billion dollar growth company that has close to that valuation and by 2024, several of the major car makers that absurdly dwarf Tesla in terms of output capacity are going fully electric.\n>\n\nYou can't name any other automotive company growing 50% YoY with 30% growth margins either. \n\n>IMO Tesla has a finite window to capture as much as the market as possible and right now, it's at a standstill while that window slowly closes.\n\nWhat's closing? You make shit up as you go. Tesla doesn't need to capture more than 15% of the market and as I said, other manufacturers aren't even able to maintain positive growth in this macro environment, nevermind profit margins.", "score": 3, "replies": [{"body": ">What delays?\n\nPlease stop posting about this subject is you haven't even heard headline news let alone detailed business news.\n\nhttps://www.electrive.com/2022/06/27/tesla-delays-from-shanghai-and-giga-berlin/\n\n>Catching up? Tesla is the only company with positive YoY unit \ngrowth.\n\nAnd their revenue is the same as car maker.......Skoda. It's easy to have growth when you don't produce even 2% of the world's cars. Tesla is valued at more than the entire valuation of global industrial giant, Samsung, yet does a tiny fraction of it's revenue. Do you not see how dumb the whole growth argument is? tesla needs to get bigger than Samsung to justify a share price that's lower than Samsung.\n\n>Based on what? Because Andre left? They've been running the program for more than 4 months without him and updates have rolled out per usual.\n\nOn the fact he's one of several high profile departures in the last year, and that tesla have stopped actively marketing autonomous driving, and again as Elon's explained, we won't get fully autonomous driving until is universally adopted by all car makers and intertwined with road and transport infrastructure which is decades away. he's shifted his language about this to \"long term investment\".\n\n>Declining in growth? C'mon, this is just lazy commenting.\n\nThey're about to have their first quarterly loss in years and growth has literally declined. Do you really need sugarcoating that badly?\n\n>You can't name any other automotive company growing 50% YoY with 30% growth margins either.\n\nthat's also not true of tesla. They are not grwoing at 50% yoy by any metric and their gross (remember gross, not net) are not going to be anything close to 30% once Q2 is announced.\n\n>What's closing? You make shit up as you go. Tesla doesn't need to capture more than 15% of the market and as I said, other manufacturers aren't even able to maintain positive growth in this macro environment, nevermind profit margins.\n\nThe window of opportunity on their main competitive advantage is/was getting their first i.e. making a decent looking EV with good range. That advantage is about to be leveled in the next year when every big car company in Europe and Asia is going to launch entire ranges of EV's, and unlike tesla, their quality control, paint, interiors (etc)  are actually good. Telsa have managed to well despite serious flaws in their vehicles (as mentioned paint is literally what you'd find on a $15k car, interiors with exception to the screen are the same poor quality) and when Merc, Volvo, BMW, VW, Lexus, Toyota who all make better cars in general finally start churning out EV's, tesla is going to struggle.\n\nThere's also the other point that Elon once was heralded as being this Eco genius but the mask has come off and I know former tesla owners and prospective buyer who don't want to buy one now just because of his douchbaggery. You can try to downplay it but brand loyalty and perception is real, and Elon isn't the golden figurehead he once was and some find hi toxic and don't want the association. \n\nFinally, powerwall and solar roof have been out for years but are still plagued with inventory and install delays which sisn't going to be resolved any time soon. The company is facing more pressure than ever at a time when their share price is simply laughable. 38x revenue lol", "score": -1, "replies": [{"body": "The mental gymnastics you perform to make your points is just fucking lol. Nearing Gordon Johnson, keep it up. I'm done here, anyone with half a brain can do their own research and come to their own conclusions.", "score": 3, "replies": [{"body": "I figured you had nothing. Just another bag holder overdosing on Elon's hopium.", "score": -1, "replies": [{"body": "Yep, bag holding for 4+ years. I invest in Tesla, not Elon. Good luck buddy.", "score": 0, "replies": [{"body": "Ouch. RIP your money, You’ve lost quite a lot in the last couple of months and it’s not going to get better with q2. I’d get our while you can. You made good money if you got in 2019.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Slump in sales? I get it, many have a hard-on for any hint of bad news when it comes to Tesla but this is just hilarious. Even better is that you're being upvoted. \n\nBut yeah, 6+ month order backlog while being the only automotive manufacturer with positive YoY growth in units produced somehow means there's a slowdown?\n\nOh and factories aren't being delayed. If you're referring to the Shanghai shutdown for ~1 month that's not within their control. They're already above previous yearly run rate for that matter.", "score": 2, "replies": []}]}]}, {"body": "I think their just shifting priorities. Autonomous driving is a long term investment and at this point it seems they aren’t going to invest.", "score": 3, "replies": [{"body": "Lol must be nice after already selling it", "score": 7, "replies": []}]}, {"body": "actually priced in, dude has been gone for so long.", "score": 6, "replies": []}, {"body": "Doug Field had to resign too a while back before going to aapl, and now he's at F. \n\nI actually spoke to a former tsla exec, and he outlined basically how Elon sets impossible deadlines and if you don't meet them, you're gone, and someone else takes over, and this cycle continues until the job is done. This is just another round of that cycle.", "score": 2, "replies": []}, {"body": "I mean, you should see journalists test the \"autopilot\". The thing jerks the car so violently toward oncoming traffic, in the city, it's not a joke. Now imagine doing that going at 65mph, but more likely 80mph as everybody drives these days. It's a total scam, I don't care which company does it: BMW, Chevrolet, they're not \"self-driving\" cars", "score": -6, "replies": []}, {"body": "they’re toast \n\nbag holders are going to cling to this all the way to bankruptcy", "score": -6, "replies": [{"body": "Bankruptcy? Explain to me how a company with no debt and making billions a year is going to go bankrupt?", "score": 7, "replies": [{"body": "They stop making money due to a recession and people not buying new cars.", "score": -2, "replies": [{"body": "You mean like during the COVID crash when people stopped buying cars and all automakers lost 30% of their market, yet Tesla still sold every car they made? And since then waiting lists for Teslas went from 3-6 weeks to 12-52 weeks, and their margins increased by around 200%. So even if demand would become a problem they could lower prices, which raises demand exponentially.", "score": 1, "replies": [{"body": "No, that was not a real recession. Peoples incomes and savings increased due to government printing and stimulus checks.", "score": 0, "replies": [{"body": "Doesn't matter. If people stop buying cars they stop buying cars.", "score": 1, "replies": [{"body": "Well it does mater to companies trying to sell cars.", "score": 0, "replies": [{"body": "Ehm, no, people not buying cars matters to companies trying to sell cars. The reason they are no longer buying cars is irrelevant.", "score": 0, "replies": [{"body": ">people not buying cars matters to companies trying to sell cars. \n\nThat is literally what I said.", "score": 1, "replies": [{"body": "Exactly, so the fact Tesla still sold every car they made and waiting times increased while people stopped buying cars says enough about how much demand they have.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "no debt? where’d you get that from? they have debt \n\nthey also have very big expenses - production or demand slows and they’re totally fucked \n\nthey have already lost $500B in market cap \n\ntheir competition is just getting going and they’re getting beaten down already \n\nElon has the feelz that things are fixing to go badly - he said it. Their cars are old and rank very poorly in quality \n\nthe mach e is beautiful and even hyundai has a new sedan that’s raising eyebrows \n\ntesla is a really really bad bet", "score": -2, "replies": [{"body": "> no debt? where’d you get that from? they have debt\n\n\"Total debt ex. vehicle and energy product financing under $0.1B\" - Straight from their latest quarterly filing. And that's compared to their $17.5B cash and cash equivalents, so net negative debt.\n\n> they also have very big expenses - production or demand slows and they’re totally fucked\n\nWell not really, since they raised prices by 10-20% on every product over the past year and doubled production, yet waiting times went from 3-6 weeks to 12-40 weeks. So even if demand slows they're fine.\n\n> their competition is just getting going and they’re getting beaten down already\n\nClearly not, since they're increasing their market share despite their most productive factory being shut down for quite a while and only building a few thousand cars from their new factories that are each larger than their two current factories combined. What do you think will happen when those get going?\n\n> Elon has the feelz that things are fixing to go badly - he said it. Their cars are old and rank very poorly in quality\n\nAgain not true. Their Model Y is one of the best EVs in terms of quality and the cars from Berlin and Texas are found to be much better still.\n\n> the mach e is beautiful and even hyundai has a new sedan that’s raising eyebrows\n\nBoth subjective, and neither is making them in any meaningful numbers, and Ford admitted to losing money on their Mach E.\n\n> tesla is a really really bad bet\n\nOnly if you didn't do your DD.", "score": 3, "replies": [{"body": "texas has only built a few hundred cars - and berlin had to shut down production last week \n\nTesla has $12Billion in debt \n\njesus christ\n\nand tesla has already ceded it’s number 1 market share position, just last week", "score": 0, "replies": [{"body": "> texas has only built a few hundred cars - and berlin had to shut down production last week\n\nExactly, and even without those they were already massively profitable.\n\n> Tesla has $12Billion in debt\n\nI just laid this out for you, they have 88M in debt excluding financing of products, which is not actual debt.\n\n> and tesla has already ceded it’s number 1 market share position, just last week\n\nAgain with the nonsense. Tesla sold 310K EVs in Q1, 21.6% of all EVs worldwide including the Wuling EV, which is not really a car. Excluding that it's 23%. Number two is BYD with 144K EVs or a 10% share.\n\nIn Q2, BYD sold roughly 175K EVs vs 254K for Tesla. And that's including their largest factory being shut down for weeks.\n\nHow did Tesla cede its number 1 position?", "score": 1, "replies": []}]}, {"body": "the tesla model x is rated the least reliable electric suv by consumer reports \n\nof all brands reported - Tesla was the 4th worse overall", "score": 0, "replies": [{"body": "Consumer Reports, you mean the publication that has advertising from all major automakers except Tesla and whose largest donor is the Ford Foundation? Great source... :')", "score": 1, "replies": [{"body": "Vested interests aside, Teslas are known for being quite unreliable with significant QC issues. I've seen a bunch where the body panels don't even align. But it doesn't much matter as those are relatively quick improvements and buyers are willing to overlook for the time being. If those issues persists, however..", "score": 2, "replies": [{"body": "Not just that, but what really matters is the pace of improvement for a new company like Tesla. The Model S was really bad in terms of quality despite being a luxury car. The Model 3 was just as bad, although because of the lower price it was more acceptable. The Model 3 from China and Model Y from Fremont were a lot better, but still had too many issues, the Model Y from China was really good, definitely on par with most other OEMs in its segment and better than other OEM's EVs, and the cars from Berlin/Texas seem to be among the best quality cars on the planet.", "score": 1, "replies": []}]}, {"body": "Consumer Reports doesn't have any advertising.\n\nAnd the Ford Foundation is not connected to Ford Motor Company.", "score": 2, "replies": [{"body": "> Consumer Reports doesn't have any advertising.\n\nAh, you're right. My bad.\n\n> And the Ford Foundation is not connected to Ford Motor Company.\n\nWell, that's debatable. Obviously it was founded by Ford, so it's questionable whether they would dare to paint Ford in a negative light.\n\nEither way, Consumer Reports' president is a former VP of the Ford Foundation, [and they've verifiably had biased at best, downright misleading at worst reporting of Tesla in the past](https://youtu.be/vO9Gsyerv8s), so it seems likely there's some kind of conflict of interest at play here.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "This is a huge blow for Tesla, but it does raise the question whether Karpathy would leave the company unless his pet project was nearing a state where he feels he's no longer needed. Especially since he seems to have left on good terms. Certainly adds to the speculation that FSD might be going into full release by the end of this year.", "score": -21, "replies": [{"body": "Or his main project (FSD) is nowhere near we completion. Otherwise why wouldn’t he stay on to see it through?", "score": 17, "replies": [{"body": "Yes, so either it's still miles off, which doesn't match with what we're seeing in the real world, or they've completed merging to the full stack and it's gonna be more of the same from here on out. Especially since he stated he's leaving to focus on larger challenges in AI, that would make more sense imo.", "score": -2, "replies": [{"body": "You're assuming the people who downvote actually know what's going on with ~200k beta testers who are having many disengagement-free drives. They all still believe Tesla is behind the RC cars in their playpens.", "score": 2, "replies": [{"body": "So true... :')", "score": 1, "replies": []}]}]}]}, {"body": "You dont leave before your proud life long project gets released.. makes No sense.\n\nYou leave before because fk this shiit.. I dont want anything to do with this garbage.", "score": 25, "replies": [{"body": "That’s ridiculous, he is the main architect. If he thought it was garbage then he would be thinking that about his own work.\n\nNo, Ehralur probably has it correct. If the technicals are done but there is a long road of regulations and fine tuning ahead his time is better spent elsewhere.", "score": -18, "replies": [{"body": "Architects leave all of the time for this reason.  They propose a solution and struggle to get the organization in line with the vision.  Product turns into crap and architect throws hands in the air, usually resigning.", "score": 3, "replies": [{"body": "People can leave for all sorts of reasons… sometimes there is just nothing left to do.\n\nBut to assume that somebody who can work anywhere he wants puts up with bullshit for 5 years is just ridiculous. We’re talking about an intelligent person here, not the average redditor.\n\nNo, you can downvote all you want but there is no reason to assume the worst.", "score": -1, "replies": [{"body": ">People can leave for all sorts of reasons… sometimes there is just nothing left to do.\n\nIt's pretty damn clear there's more left to do.\n\n>But to assume that somebody who can work anywhere he wants puts up with bullshit for 5 years is just ridiculous.\n\nWho said all 5 years have to have been bullshit?  Plus it's a chief position, any leader would know they're going to have to put up with some level of bullshit.  To dismiss this outright because \"he can go anywhere he wants\" is just naïve.\n\n>there is no reason to assume the worst.\n\nOther than that Musk has proven himself time and time again to be a controlling asshole.", "score": 1, "replies": []}]}]}, {"body": "Exactly, people also have no idea what insane amount of hours Andrej has put in for 5 years now. Unless you're Musk, you can't maintain that for another 5. Especially if the biggest creative challenge is behind you and it's just more of the same from here, in a field that requires as much brainpower as AI.", "score": -16, "replies": [{"body": "These downvotes aren’t rational.\n\nThe truth is we don’t know exactly why but what we do know points to a no drama exit.", "score": -11, "replies": [{"body": "Supposedly they had a BBQ together afterwards. I highly doubt they're on bad terms. Either way, people in this sub and in general that can't see past their hatred for Elon or Tesla's valuation cannot be reasoned with because logic and facts aren't relevant.", "score": 2, "replies": []}, {"body": "Lol, people on this sub will simply downvote anything that's not negative on Tesla and Musk. Their loss, they're missing out on the largest opportunity of our generation because of emotions.\n\nEDIT: If you disagree, feel free to set a remindme for 5-10 years.", "score": -4, "replies": []}]}]}]}]}, {"body": "Nobody leaves a company when something they have worked for during their entire tenure is actually close to becoming a reality. \n\nCan you imagine a NBA star leaving the team when they are a game away from winning the NBA finals?", "score": 2, "replies": [{"body": "Except that's exactly what JB Straubel did in 2019. Tesla's second man since its founding.\n\n> Can you imagine a NBA star leaving the team when they are a game away from winning the NBA finals?\n\nThis is not really a good comparison, if he's indeed confident they've solved the difficult part and from here it's just scaling, iterating and regulation, it's more comparison to stopping after you won the NBA finals in your 5th year at the club. Sure you could stay to do more of the same and win more titles, or you can move on to find new challenges.", "score": 1, "replies": []}]}]}, {"body": "Good. Karpathy is not some machine learning genius, he happened to be at the right university at the right time and became a popular figure. He s very replaceable", "score": -27, "replies": [{"body": "Haha what a load of bullshit. His citation count would beg to differ.", "score": 22, "replies": []}, {"body": "People that know and worked with him disagree.", "score": 21, "replies": []}, {"body": "You're getting downvoted but you're absolutely correct. He's of course very capable and intelligent but so are many other people. Racquel Urtasun is one of those people for example whose contributions to FSD are streets ahead and who would not be so easily replaceable or someone like Jim Keller who quit Tesla.", "score": 3, "replies": []}]}, {"body": "Thanks for the FUD bud.  Adding your opinion after the fact.", "score": -12, "replies": []}]}
{"title": "Last two month SPY drops have been the day following CPI… will history repeat itself tomorrow?", "selftext": "[deleted]", "id": "vyk056", "created_utc": 1657763296.0, "score": 74, "upvote_ratio": 0.88, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|3 months ago\n**Total Comments**|210|**Previous DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vyk056)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vyk056)", "score": 1, "replies": []}, {"body": "It will either go up or down", "score": 33, "replies": [{"body": "And/or*", "score": 7, "replies": [{"body": "Up then down?\n\n\n\n\nDown then up?", "score": 7, "replies": [{"body": "Repeat line", "score": 2, "replies": [{"body": "Upthreound then thorifgthp!\n\nThorifgthp then upthreound!", "score": 1, "replies": []}]}]}]}, {"body": "Yes", "score": 4, "replies": []}, {"body": "Perhaps", "score": 1, "replies": []}]}, {"body": "If banks got bad earnings , which is I got Poots on them . The market def can tank 3% at the very least lol", "score": 30, "replies": [{"body": "Go on…", "score": 5, "replies": []}, {"body": "Oh shit !!!!", "score": 1, "replies": []}]}, {"body": "Does past performance guarantee future results?", "score": 16, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "OP is ~~lying~~ being deceitful.\n\nMay 12th was a small dip that immediately went back up the next day.\n\nEdit: SPY was ~~40~~ 41 cents down on May 12th.\n\nOn June 11th spy was already in free fall with a gap.", "score": -2, "replies": []}]}, {"body": "Yes?", "score": 1, "replies": []}]}, {"body": "Its RED so far in Asia.", "score": 14, "replies": []}, {"body": "[removed]", "score": 9, "replies": [{"body": "5th? we had 5 days of green.", "score": 17, "replies": [{"body": "You listen to that man. If Dersch says we had a purple day then it’s true", "score": 9, "replies": []}]}]}, {"body": "I think so Canada hiked a percent.", "score": 4, "replies": [{"body": "Canada: Your move next Powell.", "score": 4, "replies": [{"body": "Powell: Hey Canada raise it a percent to see how people react.", "score": 4, "replies": [{"body": "Powell: I call, and raise you another.", "score": 2, "replies": []}]}, {"body": "Right.  Here comes Canada looking to become a reserve currency.", "score": 3, "replies": []}]}]}, {"body": "No one knows", "score": 3, "replies": []}, {"body": "It’ll probably go into negative territory tomorrow![img](emote|t5_2th52|4275)", "score": 3, "replies": []}, {"body": "Of course that’s why it’s so predictable and everyone here is a millionaire", "score": 3, "replies": []}, {"body": "Futures are red…", "score": 5, "replies": [{"body": "By like 60 points", "score": 10, "replies": [{"body": "You two crayon eaters following futures the night before are what WSB is all about.  God speed!", "score": 11, "replies": [{"body": "Well I bought puts so I hope to god you got calls", "score": 3, "replies": [{"body": "I regret my puts because of you.  You will get lucky tomorrow as it’s going down but just promise me you will read a few things and learn what the fuck you are doing before you stumble out of your hourly paychecks into the poor house.  Best of luck.", "score": 1, "replies": [{"body": "Already lost 23k. Only 1.5k left to lose, god willing", "score": 4, "replies": []}]}]}, {"body": "I’m a junky. I live, breath, and eat the market", "score": 1, "replies": [{"body": "Totally", "score": 1, "replies": []}]}]}, {"body": "POINTS OF WHAT?!", "score": 1, "replies": []}]}]}, {"body": "Banks are gonna rip tomorrow…. Also I have a couple calls", "score": 4, "replies": [{"body": "Rip up or down?", "score": 3, "replies": [{"body": "I also think they are fucking people over with overdraft fees.  That’s what usually happens during tough times. They always profit major.", "score": 2, "replies": []}, {"body": "And therein lies the question.", "score": 1, "replies": []}]}, {"body": "Why would they rip", "score": 0, "replies": [{"body": "They had some of those tacos that Jill Biden was talking about.", "score": 7, "replies": []}]}]}, {"body": "Does not matter. Time to buy puts was last Friday", "score": 5, "replies": [{"body": "Or today considering the bounce. Now we just wait.", "score": 11, "replies": []}]}, {"body": "Wall Street scripts\n\nFirst time shame on me\n\nSecond time shame on me\n\nThird time is shame on Wall Street which rarely happens.", "score": 3, "replies": []}, {"body": "Joke: Young whippersnapper buys condoms at the pharmacy. Clerk is concerned young grasshopper may be shy given his youth. “Would you like a bag, son?” “No, she’s not that ugly.” \n\nTomorrow we’re gonna wish we had a bag.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Crayon tips not precise", "score": 1, "replies": []}]}, {"body": "You sir are a genius", "score": 1, "replies": []}, {"body": "U/zen_trader would be tilted if sqqq went up 10% tomorrow or Friday", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "sir this is a casino", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "The more it goes down the more my weewee goes up.", "score": 1, "replies": []}, {"body": "Ppi tomorrow", "score": 1, "replies": []}, {"body": "Blue boobs", "score": 1, "replies": []}, {"body": "It barely did actually.", "score": 1, "replies": []}, {"body": "Not yet, need spy to get its ass to 395-405 so i can go in with short expiration date puts", "score": 1, "replies": []}, {"body": "No, duck", "score": 1, "replies": []}, {"body": "It is definitely coming down today, my Puts are on standby", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "Who knows but my put plays wouldn’t complain", "score": 1, "replies": []}, {"body": "My puts sure hope so", "score": 1, "replies": []}, {"body": "This image must be mirrored. Usually the left ball is bigger than the right one.", "score": 1, "replies": []}, {"body": "It looks like boobies. Goin up like this tent I just pitched.", "score": 1, "replies": []}, {"body": "Good call! Investors needed time to actually read the CPI numbers and realize we’re getting a 100bps at the end of the month.", "score": 1, "replies": []}, {"body": "Everytime we think the market will do what it did last month it does the opposite though", "score": 1, "replies": []}, {"body": "I sure hope it drops at least 2% today.  Long overdue.  \n\nEven if things were uncertain before, isn't the situation pretty clear now?  What the hell we linger around $380 for?", "score": 1, "replies": []}, {"body": "This market is stupid.  SPY will not stay down.", "score": 1, "replies": []}, {"body": "Classic ballsack pattern", "score": 1, "replies": []}]}
{"title": "BEAR GANG IS BROKE GANG (Here's Why)", "selftext": "\\- I understand cpi high as fuck like 9.1%. pretty bad, but its peaked\n\n\\- the restaurants and hotel finances that my company deals with already seen prices of goods/cargo way lower but its only started around late june\n\n\\- word on the street is most banks started buying since may and a large chunk around june\n\n\\- Buffett is all in on stocks 65% stock/ 35% cash\n\n\\- japans inflation is dropping already\n\n\\- germanys inflation is dropping already\n\n\\- oil low as fuck and probably cheaper than the 8oz harmless coconut water\n\n\\- you a bitch\n\n\\- banks dumped treasury 3 weeks ago and mostly long dated cuz rate cut for 2023\n\n\\- bear market sonly last 10 months anyway and we in month 7-8.\n\n\\- just look at the inflow from big buyers. only in the past 3-5 weeks though\n\n\\- bridgewater assioctes with ray dalio made bank with puts from jan to may. switched to shorting Europe stocks, US bonds. also increased stake in tech/consumer/bank stocks\n\n\\- bears are broke", "id": "vylo1c", "created_utc": 1657768414.0, "score": 14, "upvote_ratio": 0.57, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|4 months ago\n**Total Comments**|290|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/vunf55/next_real_estate_venture_safe_high_return_if_you/) [x](https://www.reddit.com/r/wallstreetbets/comments/vuni39/next_real_estate_venture_safe_high_return_if_you/) [x](https://www.reddit.com/r/wallstreetbets/comments/vs2i4y/next_real_estate_places_if_you_ever_have_money/) \n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vylo1c)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vylo1c)", "score": 1, "replies": []}, {"body": "Ur Mom peaked.", "score": 25, "replies": [{"body": "this together with your flair made me NE hard, thanks", "score": 1, "replies": []}]}, {"body": "Problem, there's still earnings compression to deal with as well as future rate hikes which *will* pull money out of the market, these have not been \"priced in\".\n\nPeaking inflation isn't good enough, it has to go down to normal levels as well, if it hovers at 7%, there will be more pain coming.\n\nI don't know where exactly the bottom is, but I'll only be interested in long term positions at 350.\n\nSitting on SPY 8/19 380p and AAPL 7/29 145p.", "score": 14, "replies": [{"body": "I'm getting back in at spy 330.", "score": 2, "replies": []}]}, {"body": "yeah the rate of price increases is going down. oil is going down. because a massive recession is coming. Companies with billions in debt and no savings bc they blew it all on stock buy backs are about to face a consumer base who have no jobs and no credit left. Have you seen the consumer credit usage? MASSIVE spikes per month upward, then a downtrend. why? bc they're hitting their limits. BEARS RULE BULLS ARE REGARDED", "score": 36, "replies": [{"body": "Also, everyone fleeing to the dollar is keeping the dollar strong relative to other currencies. This keeps import prices down. Once recession really is priced in the dollar will drop and inflation will be back on the raise as the import costs go up.", "score": 7, "replies": []}, {"body": "This is anecdotal I admit but I've lived through a few recessions and I think it matters.  \n\nI went to a restaurant tonight that I like.  Usually can get a table.  Line around the door to get in. Asked for a reservation for tomorrow, no go then either.  Drove back towards home and swung by another place.  Again, line around the front but we were able to get a couple of bar seats.  Not a cheap spot either. Dinner was $75.\n\nIt is Wednesday.  \n\nZero of my friends or family are unemployed or under employed.\n\nIf this is a recession, it's by far the best recession you'll ever live through.", "score": 14, "replies": [{"body": "Dinner was $75? What did you get 2 bread rolls and half a dim sim?", "score": 7, "replies": []}]}]}, {"body": "People say it’s peaked each cpi report lol. Don’t ever say it can’t go any higher and never ask how low can it really go", "score": 17, "replies": []}, {"body": "Bruh. I’m getting 140 yen per USD here.. it was 134 when I arrived in June…", "score": 9, "replies": [{"body": "So u happy?", "score": 2, "replies": [{"body": "Hells yes. The ramen is good. The “dollar store” sells stuff for 100 yen that would cost more in US. Got me a 2011 Honda Fit for $2k that has 18k miles… Japan is an awesome place to be an American.", "score": 16, "replies": [{"body": "Is it a 3 pac? Cuz one packet of ramen for what is that like 80 cents is outrageous… granted I haven’t bought ramen in a while", "score": 3, "replies": [{"body": "The ramen prices do be going up. Smart people just buy rice or noodles and you know, actually cook.", "score": 4, "replies": [{"body": "You all have never had authentic Japanese ramen I take it…", "score": 5, "replies": [{"body": "I am authentically poor", "score": 5, "replies": [{"body": "Stop flexing. The real poors know them as “soups”.", "score": 6, "replies": []}]}]}]}, {"body": "Did he say how much he was paying for ramen?", "score": 1, "replies": [{"body": "100 yen", "score": 1, "replies": []}, {"body": "Oh I guess if you read it again he didnt", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}]}, {"body": "Ichiran is the best. I'd go back to Japan just for that 😀", "score": 1, "replies": []}]}]}]}, {"body": "Duly noted", "score": 5, "replies": []}, {"body": "I like your funny words magic man", "score": 4, "replies": []}, {"body": "When did “all in” constitute 65%?  That’s barely over half shaft.", "score": 3, "replies": [{"body": "Buffet is famous for terrible entry prices as well", "score": 5, "replies": []}]}, {"body": "“bears are broke” 😂\n\nlook at the ytd chart of all major indexes and your fave stocks.. tell me whos been making money all year. lmao", "score": 5, "replies": []}, {"body": "I like your optimism ![img](emote|t5_2th52|12787)", "score": 7, "replies": []}, {"body": "Stocks started falling back around February late January so that’s 4-5 months. The feds are going to raise rates to atleast 100bps at the end of the month. Plus I have a neutral view of the market we technically are in a recession to some sort of degree. Energy is going to go up especially with Russia and Ukraine supply chain issues are still a major problem. We won’t see a major pullback like in 2020 because they keep easing us into a recession. Biden and his speaker tried to down play CPI. We are technically in a bear market but we will see the future is going to be rough", "score": 3, "replies": [{"body": "They're also the ones that said it's transitory. Just wait until winter. If the war ain't over, gonna be tough to contain it after that.", "score": 2, "replies": [{"body": "That’s why I have concerns in the winter 2023 will be scary", "score": 2, "replies": []}]}, {"body": "Stocks started falling end of November 2021. All sectors. We were all to stupid to see it. But the dip is only starting. Stock market is going below China viruz levels. We have a while to go.", "score": 0, "replies": []}]}, {"body": "Peaked lol.", "score": 3, "replies": []}, {"body": "If these are the best arguments for a return to a bull market then I fear we have a long way yet to fall.", "score": 3, "replies": []}, {"body": "Doesn't matter.  Feds gonna hike and hike again until there is a nice deep recession.  Plus, the strong dollar will pull us into everyone else's recession.", "score": 4, "replies": [{"body": "Recession in the economy. The stock market as it’s forward looking already priced that in… when you will see recession confirmed you will have the bottom in stonks. Probably will be some selling from retail and margin calls but nothing fancy.", "score": 3, "replies": [{"body": "Not a 1% hike (highly likely with robust job report last week way over the mark and this poop CpI) or a recession as most institutions have 30-40% chance with the highest I've seen being 70% chance and that's was one .", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4887)", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|8881)", "score": 2, "replies": []}, {"body": "Rate hikes cause sell offs", "score": 2, "replies": []}, {"body": "I wasn't paying attention was waiting for the part about hookers and blow", "score": 2, "replies": []}, {"body": "Even if inflation gets cut in half it will still be more than double what the fed target is. \n\nYou are one event away, like putin turning off oil and gas to Europe from energy prices spiking.", "score": 2, "replies": []}, {"body": "More rate hikes incoming. Your stonks and calls are fucked 😂", "score": 2, "replies": []}, {"body": "“Oil low as fuck” —> checks 5 year chart…\n\n“Japan and Germany inflation dropping” —> checks euro and yen chart vs USD…", "score": 2, "replies": []}, {"body": "Peaked 🤡", "score": 2, "replies": []}, {"body": "I bet we're getting QE anytime in the next 100 years so I'm probably right", "score": 2, "replies": []}, {"body": "Bull trap confirmed", "score": 2, "replies": []}, {"body": "As long as wage inflation continues then most of the other problems will persist.  There are more jobs then people.  Inflation marches on.  Even if 9.1% is the peak, the next few reads will be 8% plus.  If you think that is bullish while the fed raises rates and reduces its balance sheet then by all means go all in now.  I’ll wait a few more months.  I hope the bottom comes in September with a nice 4th quarter rally.", "score": 2, "replies": []}, {"body": "So stocks are priced in right? ![img](emote|t5_2th52|6880)", "score": 1, "replies": []}, {"body": "Here’s the thing, the market is in a strong downtrend on the higher time frame charts. It takes A LOT to cause EMA to go gay and touch/cross. A lot of gayness, and they are in gay bear formation right now (that’s saying something!). The ups and downs we are seeing are mere oscillations around the mean, which is trending down. It’s like when your Dad over steers the car one way when your mom bites his left but while giving him road head and then over steers the other way to correct for his knee jerk reaction.", "score": 0, "replies": []}, {"body": "Oil back to pre Ukraine levels, CPI didn’t pick that up so has to drop next month. If it doesn’t then we have a problem! All Indices have levelled and are now forming a base. Bad earnings season could take us on another down leg and I always had 3600 as my SP500 bottom so still possible but money is flowing into the market again and Investors return from summer hols in Sept. It’s shaping up for a bear rally in Autumn and given almost full employment it’s possible (but unlikely) we get a break out! \n\nNot much food for hungry bears anymore, anyone shorting is facing an increasing upside risk!", "score": 0, "replies": []}, {"body": ">- you a bitch\n\nSeals it for me", "score": 1, "replies": []}, {"body": " Michael Burry talked about this  look up bullwhip effect", "score": 1, "replies": [{"body": "Michael Burry responded to my craigslist ad looking for someone to mow my lawn. \"$30 is $30\", he said as he continued to mow what was clearly the wrong yard. My neighbor and I shouted at him but he was already wearing muffs. Focused dude. He attached a phone mount onto the handle of his push mower. I was able to sneak a peek and he was browsing Zillow listings in central Wyoming. He wouldn't stop cackling.\n\nThat is to say, Burry has his fingers in a lot of pies. He makes sure his name is in all the conversations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "What is it?", "score": 1, "replies": [{"body": "I'm not trying to be a dick but it's a 5 min read or look it on YouTube ill butcher the explanation I'm retarded that's why I'm here", "score": 1, "replies": []}]}]}, {"body": " Wee-Wah stonks Wee-Wah stonks Wee-Wah stonks. I’ll buy buy buy until stuff starts turning green and then become the moon. That’s my plan", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "I hate to say it but it could be true this time. Commodities coming back down. Dollar dropping back. Even if it hasn't bottomed, it is a good time to purchase some stocks for long term.", "score": 1, "replies": []}, {"body": "The type of restarted (Reddit admin rules) posts I come for", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Hahaha... which drugs are you doing, I would like some...", "score": 1, "replies": []}, {"body": "I literally lol’d at the you a bitch bullet point lmao", "score": 1, "replies": []}, {"body": "I’m hoping for a sideways market until things reach a new equilibrium\n\nWe’re in trouble, unless everyone was responsible with their money during cashstravaganza.", "score": 1, "replies": []}, {"body": "Nobody knows how long a bear market will last, nobody knows if it has peaked.", "score": 1, "replies": []}, {"body": "the one that think stonk only goes up![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Berz run 2022", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "Throw this whole post away. I'd pay a mod to ban you from posting again.", "score": 1, "replies": []}, {"body": "30 percent increase in my portfolio this WEEK bear gang isn't going away until inflation starts to slow down and an additional 25 basis point increase isn't going to get us there.", "score": 1, "replies": []}, {"body": "Cpi has been peaking for a year now lol", "score": 1, "replies": []}]}
{"title": "7-14-22 SPY/ ES Futures, and AMD Daily TA", "selftext": " Today after opening massively red we got… the money glitch day. So this has only happen one other time that I have ever seen (June 30th the JPM collar day) and that day I assumed it was just a glitch from that, however, there was a MASSIVE 1.6 billion Dark pool print at yesterday at the 379.05 level… Now look at the daily ranges below (there se were from around 11am the same time I saw this last month). From here I assumed we were going to rally all day and break the IV probable high and we sure did. Great day for everyone who played the calls on the server. I took profits way early but I only trust things so much in this make belief market… \n\nhttps://preview.redd.it/l0bdls2nelb91.png?width=975&format=png&auto=webp&s=b670400afddba1d1d6c5800e249b4a14cc9ef6b1\n\nhttps://preview.redd.it/n9z9fymnelb91.png?width=975&format=png&auto=webp&s=254ae5ee3e50dd723761d637a1242fae556ead5a\n\nhttps://preview.redd.it/ov6t6nboelb91.png?width=975&format=png&auto=webp&s=2466c5cdda57f91a496978b4660d3afb678c8469\n\nLooking at SPY daily chart I have to say I am pretty bullish here. We finally touched the support area of 370 (371.04 to be exact) and now with the VIX refusing to rise anymore and unwinding I am looking to see SPY hit 388 next week and test this channel resistance. It could on a big enough day do it tomorrow but that seems unlikely. \n\nhttps://preview.redd.it/x7xnyb4pelb91.png?width=975&format=png&auto=webp&s=ea5e0ee7292c3e24ecebb99f7c33b5a5f6a3ac12\n\nThis massive dragonfly doji is even more bullish on the ES futures daily chart. \n\nBull case- I am looking for ES futures to break that 3805 resistance tomorrow and SPY to break that key 379 resistance tomorrow. Once those levels are broken tomorrow and next week we can look for futures to shit 3840 to 3900 (next week) and SPY will look for 385 tomorrow and 388-390 next week. \n\nBear case- we saw SPY reject that 379 breakout once again. If that is truly resistance we will look for a retest of 375 support and then a true test of 370 support of the purple channel. ES futures will look to test that 3744 level that is seems to be super support right now. \n\nOverall both charts are 100% sideways stuck between 370 and 390 SPY since June 11th. I think this is where we are stuck. I think we are going to see a run into next week with earnings coming up which are all going to be mixed bags then we see FOMC end of July. Depending on how well they prep that markets for the 100 bps hike this could be where we finally sell off. It could be we see a drop from FOMC to the next CPI on August 10th which they are projecting to be 9.2% right now (we just had 9.1%). \n\nWhile I still do NOT recommend any swings here or going long on anything… I am bullish at 370 and bearish and 390. 380 im neutral. And will remain there till I see something otherwise. \n\nhttps://preview.redd.it/nyi8nzmpelb91.png?width=975&format=png&auto=webp&s=305f12f6e98bb055afc219c0dd8d91f4ee7ecb5d\n\nhttps://preview.redd.it/dl23je9qelb91.png?width=975&format=png&auto=webp&s=897012575456d6f0494ed52c7f7898835a0ed153\n\nAMD had a great day today and I had a GREAT day scalping it for the first time. It opened up hella green saw a nice sell off then a very nice recovery EOD. Overall it did reject key breakout resistance of 79.5 though. If we were to break through 79.5 tomorrow and close over it I would look for a 7dte long call for next week with a 87 price target. If we break down through 75.5 blue channel support I will look for a 7dte put for a target of 71.8 if not 70 for the black dotted support line which is now 6 months old.  \n\n10% challenge-\n\nGreat day today. I early recognized that we were building a bottom at 371.6 and refused to drop into any puts at that time. Once I saw the dark pool glitch I knew it was time for calls. I took profits early along the way. Had I just let them ride all would have been easily 100% profits. I have heard numerous times “your TA is great, your entries are great and you are correct often… but you are skittish.” And I will say this is 100% correct but this market has made me skittish. I can only trust this market 5 second at a time. I would rather take 10-20% profit along the way to ensure I get profits instead of letting it ride and ending up big red at the end. \n\nWorst plays today were attempting to scalp puts against the trend. Never fight the trend…\n\nNote- I played one contract only on AMD plays today as im learning it still and took profits early.. lots of nice 5-10% scalps there today… I wanna test this some more before I go too heavy in plays… I did one normal size position today though. \n\n&#x200B;\n\nhttps://preview.redd.it/kvezzvsqelb91.png?width=744&format=png&auto=webp&s=9c66dfffb981636cf4e371a6948809f3b48f3226", "id": "vz5ejc", "created_utc": 1657830177.0, "score": 58, "upvote_ratio": 0.95, "num_comments": 73, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|229|**First Seen In WSB**|1 year ago\n**Total Comments**|2103|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/uxvyrg/52522_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuwx6/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuz82/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/v8vbnd/6922_spy_daily_ta_bonus_cpi_day_trade_breakdown/) [x](https://www.reddit.com/r/wallstreetbets/comments/ur9t1w/51622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpf4gi/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpezp3/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthspd/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/uyxorz/52722_spy_pre_market/) [x](https://www.reddit.com/r/wallstreetbets/comments/vikp3b/62222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/skp8ci/24_spy_recap_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vcewfy/61422_spy_daily_ta_and_a_breakdown_of_how_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/vydqkl/71322_spy_es_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vm7yov/62722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/us0d0d/51722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v23784/53122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v9jfp2/61022_spy_weekly_review_fomc_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjbyng/62322_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v6ewtr/6622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vz5ejc/71422_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5w3m/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5xtr/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vmx21o/62822_spy_es_futures_daily_ta_bonus_qqq_and_apple/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/vd6j6u/61522_spy_daily_ta_and_fomc_trade_review/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vs0b13/breakdown_of_fomc_minute_days_and_how_to_trade_it/) [x](https://www.reddit.com/r/wallstreetbets/comments/usqmwy/51822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v2sj0k/6122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v7clxo/6722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjy8l2/62422_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vw7sc0/its_time_to_go_long_on_vix_uvxy_calls_july_is/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdhxd/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdk8h/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v3mubg/6222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwhw7o/how_to_trade_cpi_day/) [x](https://www.reddit.com/r/wallstreetbets/comments/v82mas/6822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vnphqa/62922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvrv2/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvtju/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdwm4u/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v48yk1/6322_spy_weekly_ta_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwukf1/71122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdzrud/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthl4s/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/ux4ri2/52422_spy_daily_ta_fomc_minutes_prediction/) [x](https://www.reddit.com/r/wallstreetbets/comments/vbnl4b/61322_spy_daily_ta_and_fomc_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vt2tn2/7622_spy_es_futures_daily_ta_and_fomc_minutes/) [x](https://www.reddit.com/r/wallstreetbets/comments/vhms2v/62122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vojpv5/63022_spy_daily_ta/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vz5ejc)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vz5ejc)", "score": 1, "replies": []}, {"body": "Awesome. So my puts will likely get obliterated more tomorrow", "score": 44, "replies": [{"body": "Looks that way unfortunately", "score": 18, "replies": []}]}, {"body": "We have been rallying on the most bearish of news. Watch them rugpull this tomorrow/Monday on no news 😂😂😂", "score": 21, "replies": [{"body": "[removed]", "score": 7, "replies": []}, {"body": "SPX down 2.8% on the week with 5 red days in a row  = rallying to you? ![img](emote|t5_2th52|4271)", "score": 12, "replies": [{"body": "Rally at the end of each day", "score": 7, "replies": []}]}]}, {"body": "Hell I bought calls this morning and paperhanded like a bitch for a measly $30 profit. It looked like it was gonna tank for a sec and I panicked...fuck me.", "score": 13, "replies": [{"body": "Are you me? That is exactly what I did and how much I made LOL I would've made 1k more in profit if I held just 30 mins longer but at least it didn't go to red", "score": 7, "replies": [{"body": "Ah yes, I belong in this comment thread because I too paper handed calls but for $90 😎", "score": 3, "replies": [{"body": "Shit you win. You tripled my profit", "score": 3, "replies": []}]}]}]}, {"body": "There is a bearish divergence on the daily. Buy overall what I am seeing is very neutral, could go either way. There are a lot of ES sellers sitting at 3800 and we kissed that twice today but rejected. It may prove to be tough resistance. 383 is my top tomorrow but ultimately we are heading to 363 before a relief rally to 390-400. But also the VIX gap filled and you're right what we are seeing there is bullish for SPY. Could be the perfect day tomorrow for algos to chop it and close flat since we are all expecting a decent move with the recent volatility. These markets are so tough and holding anything more than 30 minutes is crazy.", "score": 10, "replies": []}, {"body": "another bs day, all I got to say", "score": 17, "replies": []}, {"body": "One thing that I’ve seen coming in from a couple of different sources is that IWM has been getting MASSIVE amounts of 8/19 put sweeps this week at varying strike prices. Yes, it’s not SPY which you cover, but they all largely follow each other obviously. There was a $9m print a couple of days ago on 164p’s, and there was a $5m print on 161p’s today among others. Those 161’s today alone ended the day down like 20-25% already from where the sweeps came in.\n\nEither someone with a lot of money really sucks at trading, they are using really tight stop losses so they got stopped out quickly thinking it would reverse back down, or they all know where we’re eventually heading come FOMC etc.", "score": 7, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "What do the prints mean", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Buys as in puts or calls?", "score": 1, "replies": []}]}]}]}, {"body": "IWM aint got no apple", "score": 3, "replies": [{"body": "IWM has something better.  CROX", "score": 5, "replies": []}]}, {"body": "What do the print indicate", "score": 1, "replies": [{"body": "That someone/people are betting pretty big that we’ll have some big downside before 8/19", "score": 1, "replies": []}]}]}, {"body": "This has been a killer week. Loaded up on spy puts Tuesday before the sell-off and then again yesterday before close. Dumped the puts and bought some calls this morning at the bottom. Sold the calls waaaay too early, but that's ok. All winning trades and my portfolio is up 39% in 2 days.", "score": 9, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Aw man. It doesn't bother me at all. I'm just a rando talking to other randos on the internet. It doesn't matter if people believe me or not; I'm not here for that. I've blown up accounts and made plenty of mistakes, so I'm not saying I'm a genius. But I'm excited with this week. Once I started following you here and on your server, I really got more disciplined. Thanks for what you do.", "score": 4, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Like no more 0dte 😉", "score": 3, "replies": []}]}]}]}, {"body": "Let’s see some proof.", "score": 1, "replies": [{"body": "What you want? 10 different screen shots? I also trade between a cash account and a margin one. I'll transfer my money to margin, trade there, then transfer it back to cash and trade there. \n\nForgot to mention the Tesla puts I was in for 22 seconds this morning as well that nabbed a quick 12%.", "score": 7, "replies": []}]}]}, {"body": "what do you think about the m shaped bear reversal pattern on the daily?", "score": 7, "replies": [{"body": "Didn’t notice that interesting to point out, also I commented that the trend for the last few weeks of higher highs higher lows was broken today. Will be interesting to see how it pans out.", "score": 8, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "Yes that’s what I said, meaning how it plays going forward. A break in the trend would assume a different trend is forming.", "score": 4, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "It doesn’t have to test 390, already tested that range. And my point is that it’s much more likely we go below 370 because there was a new low in the range we have been trading the last few weeks (372 was previous and we set a new lower high at 390 before). I get the TA sometimes but the name of the game is inferring what direction it’s heading. The charts without doing TA is clearly shifting. Makes almost no sense with hard economic data being almost all bad and earnings kicking off on a sour note that it would retest the highs again. Honestly the reason for the sideways and bouncing off of the sells is because this is a zero sum game. It’s the perfect setup the last few days to collect and buy back puts while selling premium in calls to push it down.", "score": 5, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "VIX is calculated using the risk-free rate. If it uses the real rate rather than the nominal rate, it could explain why high CPI coupled with low interest rates are leading to a lower calculation. \n\nRead the white paper on the VIX. Couldn’t find how they calculate their risk free return. If anyone knows, it might be helpful.", "score": 2, "replies": []}]}]}]}]}, {"body": "so is breakin 370 support out of the question even with all the bank earnings tomorrow?", "score": 3, "replies": []}]}]}, {"body": "Morning gap was delicious! Saw your successful trades. AAPL beasted up!", "score": 7, "replies": []}, {"body": "Something to note is that the higher high lower low trend the past few weeks was broken today… mega caps have been carrying for a bit (notably apple nearing that 150 mark and seems to be sellers in that area).", "score": 4, "replies": [{"body": "So what does this possibly imply?", "score": 3, "replies": [{"body": "Trend reversal to touch the previous low. Down basically but no one knows so.", "score": 7, "replies": [{"body": "Sure hoping so haha", "score": 3, "replies": []}]}]}]}, {"body": "Yeah counter trend trading got to me on $SPY today, never again! Had a nice gain, all evaporated plus some on that counter trend trade. Turned an awesome day to a red day. Oh well lived to trade another day.", "score": 10, "replies": []}, {"body": "Short /ESU2 at 3800 \nMainly as a hedge for long SPY position.", "score": 4, "replies": []}, {"body": "That’s interesting that they’re projecting 9.2% for the next projection. All that I’ve heard for the last two days is that this will be the last bad number, that inflation has peaked and it’s smooth sailing from here on out", "score": 4, "replies": [{"body": "Maybe they are overshooting so when it comes in even a 1/10th of a point below that it can look bullish", "score": 2, "replies": []}]}, {"body": "My poots ![img](emote|t5_2th52|4270)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|8880)", "score": 4, "replies": []}, {"body": "your ta forecast yesterday was spot on again\n\nthat's a solid (and statistically significant) streak\n\nmagic 8 ball is meh tmrw am", "score": 4, "replies": []}, {"body": "So all in SPY calls tomorrow. Good opportunity.", "score": 6, "replies": []}, {"body": "I think amd is going moon..ive just bought it too right before closing..hop tomorrow will green..![img](emote|t5_2th52|8882)", "score": 3, "replies": []}, {"body": "Glad I decided to grab a couple short calls once I saw it break 375 otherwise I would have gotten wrecked. Was able to end the day flat. With profit from a gme put and holding a 380c that expires tomorrow and 386 for Monday  that are currently keeping the loss from My August 360p at a minimum. Looks like it might try to fill the 2 weekly gaps here tomorrow.", "score": 3, "replies": []}, {"body": "SPY to 385 tomorrow?", "score": 5, "replies": [{"body": "Spy 365", "score": 9, "replies": []}, {"body": "Si porfavor", "score": 2, "replies": []}]}, {"body": "My set up presented itself again today at SPY 371.8 so I entered 14 debits. Up 5.86%, and with the 1st expiration date being tomorrow, the sold puts should deteriorate fully. If we climb to SPY 385 I'm expecting around 20-25% tomorrow. \n\nI will close for profits in those ranges and check for a Monday set up if one exists.", "score": 3, "replies": []}, {"body": "Another great post. Didn’t know you traded AMD too. Would like to see that sell off a bit tomorrow off a slightly higher open before grabbing calls. Probably go with the 7/29 85-87 strikes. This gives me till their earnings on 7/26 which is also day 1 of FOMC  if I want to stick around that long. \n\nDidn’t get to trade during the regular session today but was up early and faded the ES downdraft to 2750 when JPM announced. Some 0DTE ES calls.  This was about 650am and think I was out by 7 once it levitated back to the 20ema with a nice and obvious trade for my smooth brain.  \n\nGlad your SPY puts printed this morning!!", "score": 2, "replies": []}, {"body": "Im not bearish until we see a trend up that actually closes above previous eod\n\nTomorrow we fall", "score": 2, "replies": []}, {"body": "Should have followed the TA here. Hurting today from going against it. Hoping for a big EOD play but seems unlikely with low volume. Well there’s always next week.", "score": 2, "replies": []}, {"body": "When you say you see dark pool prints, what are you talking about/how are you seeing that?", "score": 1, "replies": []}]}
