{"title": "TSLA dips 6%!", "selftext": "Tesla $TSLA sees early dip as HSBC initiates coverage with a 'Reduce' rating, citing delays in execution and commercialization of projects. With a $146 price target, concerns include dependence on Elon Musk's prominence, posing potential single-man risk. \n\n\"Elon Musk’s global fame has afforded the group a customer awareness that far outweighs the money it has spent on marketing and advertising, which is therefore a tangible benefit to the P&L. Leaving aside the current legal issues Elon Musk faces, we think his prominence presents a considerable single-man risk at the group.\" noted HSBC analyst Michael Tyndall.\n\nWhat do you guys think?", "id": "17rjdtp", "created_utc": 1699554103.0, "score": 114, "upvote_ratio": 0.82, "num_comments": 103, "comments": [{"body": "I think the \"single man risk\" is him staying with Tesla. At this point, I feel like the company has gotten its feet under it enough to do better without some of his craziness.", "score": 85, "replies": [{"body": "FWIW, I'm currently looking at EVs and not considering Tesla because I'm not giving a dime to their wannabe supervillain CEO.", "score": 28, "replies": [{"body": "My bro got lucky with Tesla stock, bought 10-20k or so and turned it into 250,000. Turned that into a Tesla S Plaid.\n\nHe took me for a ride in it, and I thought what a stupid fucking waste of money.\n\nYou could’ve bought a house, a condo, lived stress free while earning a paycheque for x amount of years. It just felt super super idiotic to me", "score": 18, "replies": [{"body": "Yep what a waste of money. Could have gotten a Model 3 for under 30k instead and a house too.", "score": 12, "replies": [{"body": "the prices drop every week!", "score": 3, "replies": [{"body": "Then become a short trader with a leverage of 20x. You would have become a millionaire. The people in the USA are taught one thing buy stocks and they will go up then prices go down and lose their Money. They have no skills.", "score": 0, "replies": [{"body": "Think he was referring to the price of Model 3.", "score": 5, "replies": []}]}]}]}, {"body": "What's the interest rate on government bonds in your country? I was thinking at about 4 percent, he could be earning about 10k a year. Instead of getting a Plaid \n\nAll in hindsight of course.", "score": 8, "replies": [{"body": "Don’t know about bonds, but banks/credit unions are offering 5.25-6.25% in savings accounts.\n\nCanada.", "score": 7, "replies": [{"body": "Sweet. That's money that impact people's lives. About nearly 15k to 20k a year in coupons.\n\nSide note, that's a problem investors would be lucky to have. What to do with a multi bagger.", "score": 4, "replies": []}]}]}]}, {"body": "Congrats on your future shitty EV purchase", "score": -4, "replies": []}, {"body": "I too like to cut off my nose to spite my face...", "score": -22, "replies": [{"body": "Not buying a Tesla will never hurt you. Ever.", "score": 14, "replies": []}, {"body": "Rivian makes better cars. Lucid too.", "score": 6, "replies": [{"body": "And BMW... And Audi...", "score": 8, "replies": [{"body": "Yep. \n\nNot only is elmo not the only game, he's got shittier service too.", "score": 2, "replies": []}]}]}, {"body": "not buying a tesla is cutting off your nose to spite your face lmao you dorks are wild", "score": 5, "replies": []}, {"body": "I’m acting rashly against my own self interest by making a consumer choice? Makes no sense.", "score": 3, "replies": []}]}, {"body": "Same here. Bought a Porsche instead lol. After doing some DD, his cars are not that great. He’s a moron who I’ll never support. He’ll never get a dime out of me either.", "score": -2, "replies": [{"body": "Taycan? I want to buy my dad one and get him to sell his Model 3 if he still wants to stay EV. Porsche is just amazing, every single car is special.", "score": 0, "replies": []}]}, {"body": "Seems pretty cuck-pilled to me.", "score": -1, "replies": []}]}, {"body": "I personally disagree. He is the reason the company is so successful. His craziness is far outweighed by his ability to manage/build a company.", "score": -1, "replies": [{"body": "“X” is going great.", "score": 6, "replies": [{"body": "It's only been a year.  I think it would only be fair to give it more time before making a conclusion.  I've seen some changes that I believe are a real benefit.  Things like community notes.  Also, what about space x?  I think it's hard to argue with the fact that he has now built multiple companies that are extremely successful.  Companies that have produced groundbreaking technologies.  I think many people find him distasteful, and that produces a bias when evaluating his success in business.   I personally find some things he has said distasteful.  Like his comments about the caving rescuer.  That said, he has an amazing ability to build and run companies.", "score": 3, "replies": [{"body": "> Things like community notes.\n\nBirdWatch, later renamed Community Notes, started a year+ before he announced \"I'm buying Twitter\".\n\nTwitter turned a profit in 2018/2019, and would have last year except they had to pay out hundreds of millions in a lawsuit.  Now, after the take over, it is fucked.   His other companies are successful because they've attracted great talent and then built up a layer of management to manage Elon - run with his good ideas and ignore his bad ideas.  He is like a virus, and those companies had time to grow an immune response to him. At Twitter, he fired all of the experts and he's just flailing around digging the hole deeper.", "score": 1, "replies": [{"body": "I like community notes regardless of who came up with the idea. I guess I could point to the Twitter files and reduced government censorship that is probably more directly attributable if you like. \n\n>Twitter turned a profit in 2018/2019, and would have last year except they had to pay out hundreds of millions in a lawsuit. Now, after the take over, it is fucked.\n\nOkay. You are saying Twitter turned a profit for a couple of years and not others because of legal troubles. This was during the biggest economic boom in recent memory. 0% ffr, everyone trapped in their houses increasing Internet usage, and lots of helicopter money. Now it's been a year and the script has flipped. We have a 5% ffr and economic conditions are restrictive. What kind of quarterly loss are they taking right now? \n\n>His other companies are successful because they've attracted great talent and then built up a layer of management to manage Elon - run with his good ideas and ignore his bad ideas. \n\nThis could very well be true. I don't work directly for him so I have no idea. That said, whatever methodology he uses, it's been extremely successful. \n\n\n>He is like a virus, and those companies had time to grow an immune response to him.\n\nDon't think this is a fair statement.  Virus implies he is net negative. If that was the case and companies were being successful despite him damaging, then ceo would be a meaningless position. Why aren't other companies pulling Jon Does off the street to build trillion dollar companies... Why is it that whenever he gets involved, amazing companies are built...\n\n>At Twitter, he fired all of the experts and he's just flailing around digging the hole deeper.\n\nYou mean he cut all the fat and brought out his own software people to review the product? Did he cut to much initially? Yes. Was this type of change needed for success? Also yes. The company was hemorrhaging money. \n\n\nAt the end of the day, I'm very happy that he was willing to take the platform over. He has provided a town square that might not be perfect, but is far better than anything else around. You should be concerned that the government was actively suppressing free speech, sometimes even actively deceiving the public to hide true information. Information that could have influenced an election ex- Hunter Bidens laptop. I say this as someone who is not particularly fond of Trump and didn't vote for him.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla financials are a house of cards. It would be like Jeff Skilling leaving Enron, there is a ton of hidden fraud and criminal activity that will bring the company down.", "score": -11, "replies": [{"body": "Do you have any evidence for that or is it just because you hate Elon?", "score": 16, "replies": [{"body": "Not the op - i don’t think theres blatant fraud but tesla/elon have done some real shady shit. Just off the top of my head:\n\n- solarcity\n\n- bitcoin/doge\n\n- preorders that never deliver (roadster)\n\nWhether its actually fraud or legal i dont really care, but theyre all red flags imo", "score": 6, "replies": [{"body": "Facts. Plus, these cybertruck reservations… i can’t believe people were stupid enough to give away $100 for a interest-free loan just so they could post on social media that they were stupid enough to give $100 towards the possibility of buying a rolling fridge.", "score": 6, "replies": []}, {"body": "Fsd for absurd money that he promises will soon work as a robotaxi for the last ten years got to at the top of the list. How tesla isnt sued put of existence i beyond me.", "score": 2, "replies": []}, {"body": "Enron broke the law.  Solar energy, crypto and taking refundable pre-orders is not illegal or shady.", "score": 1, "replies": [{"body": "The solar city acquisition was shady as fuck, it was owned by his cousin. Pumping and dumping crypto could have been to pad earnings. $250k/car preorders that they know they wont deliver on is an interest free loan", "score": 1, "replies": []}]}]}, {"body": "If the evidence was out, it'd be less of a house and more of just cards. But that was of course the same for enron and only time will tell.", "score": -2, "replies": []}]}]}, {"body": "TA is not Abt what you feel but what you think. Bro the market goes up and down. It's normal.", "score": 0, "replies": []}, {"body": "Elon doesn’t care about his car company. He will just sell stock whenever he wants to fund something he actually gives a fuck about", "score": 0, "replies": []}]}, {"body": "Im a buyer at 175 per share if it ever goes back there", "score": 5, "replies": []}, {"body": "I'd be surprised to see it much lower than $200. It will follow the market for the most part. S&P justhad a V shape recovery and will have to consolidate before moving any higher. \n\nI doubt we see a dub bottom at 183 or whatever for TSLA but it could happen. I'm a buyer at these levels and anything lower. Long term holder since 2017. \n\nPeople who suspect $150 or lower are literally just guessing at best. Nothing supports that.", "score": 13, "replies": [{"body": "!RemindMe 1 month", "score": 6, "replies": [{"body": "I will be messaging you in 1 month on [**2023-12-09 23:30:31 UTC**](http://www.wolframalpha.com/input/?i=2023-12-09%2023:30:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/17rjdtp/tsla_dips_6/k8kmump/?context=3)\n\n[**7 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2F17rjdtp%2Ftsla_dips_6%2Fk8kmump%2F%5D%0A%0ARemindMe%21%202023-12-09%2023%3A30%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2017rjdtp)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}, {"body": "If god truly loves me he will let me buy a shitload more under $110. \n\nHe doesn't though.", "score": 4, "replies": []}]}, {"body": "Actually, their measly earnings per share support that thesis. I can tell we’re still in a bubble precisely because people and institutions are able to be so reckless with their money and throw it at memes, like TSLA. \n\nThe markets still haven’t priced in the long term impacts of higher interest rates", "score": 8, "replies": [{"body": ">The markets still haven’t priced in the long term impacts of higher interest rates\n\nToo much hope that rates come down. The latest argument is because of a \"worsening outlook\" that central banks will start cutting. Can't really see that happening, at least not in the next 12 months. They need to bleed capital out of the market, something they should have done a long time ago (or at the very least stop pumping more money into it).\n\nIt'll hurt a lot of people, but that was always on the horizon.", "score": 16, "replies": [{"body": "And even if that does come to fruition, that has historically *not* been good for equities….", "score": 2, "replies": []}]}, {"body": "Tesla will move into more lucrative things beside cars", "score": -5, "replies": [{"body": "Like crypto pump and dumps", "score": 5, "replies": [{"body": "Tesla is and will be a AI company just like NVDA and MSFT.   They have more data than most they have been collecting for years with auto drive", "score": 0, "replies": []}]}]}]}, {"body": "It could easily bounce between 180 and 260 for the next year, roughly mirroring the market (the recent drop has been with the QQQ/tech going up... if the market had pulled back 5% TSLA would already be below 190)\n\nEXCEPT Elon might start dumping billions again after 2023.  That's what helped take if from $300, to $200, to $100 (him dumping directly, repeatedly, on the open market, and ALSO him dumping shares via his foundation (which doesn't have a 3 day reporting rule))", "score": 1, "replies": [{"body": "I hope it goes to $150 honestly", "score": 1, "replies": []}]}]}, {"body": "I learned this the hard way, but a stock that has lost 90% already can easily lose another 90%. TSLA isn't quite there yet, which might indicate that HSBC's Reduce rating is solid advice.", "score": 2, "replies": []}, {"body": "The “Elon Musk single-man” risk has been baked in to Tesla since it’s inception. HSBC acts like they’re just now figuring this out. I predict a rebound as soon as ppl figure this shady sh@t out.", "score": 5, "replies": [{"body": "Funny how people can still trust banks post-2007.", "score": 1, "replies": []}]}, {"body": "I might buy at $175. I’d love $150. But still not convinced it will get that low, unless there’s a prolonged market downturn", "score": 8, "replies": [{"body": "It could quite easily go sub $100. EPS estimates keep getting downgraded, and that alone will weigh on the stock. It's currently priced for about 10 years of 30% earnings growth. There's zero chance of that happening, so it has a long way to fall before the valuation makes any kind of sense.", "score": 16, "replies": [{"body": "I’m saying exactly this for more than a year. It is a sub $100 stock. They are trying to compensate with cheaper models or changing their designs. But China owns cheap cars. \n\nYou cannot build a low end iPhone. Apple knows this as well. This is why their marketing is so out of this world. \n\nBuild an extraordinary product or die a slow death of supply chain and production cost increases.", "score": 14, "replies": [{"body": "Tesla is also no longer the only option in the market, and the price point their upper models charges you can get much better looking electric vehicles from established makers, that actually have their panels aligned correctly.\n\nWhat Tesla would need is either:\n\n1. FSD actually working (good luck with that).\n2. A complete model refresh that justifies the price points they are charging.\n\nFirst one I can't see them accomplish, considering that they are lagging behind pretty much everybody else.\n\nAs for the second point: I doubt they have the money.", "score": 5, "replies": [{"body": "This. It'll kick & scream on the way down but $tsla is heading down to \"meet\" rivian and co sub $100", "score": 8, "replies": [{"body": "Hahaha youre all retarded", "score": 3, "replies": [{"body": "Find another car stock with the same p/e", "score": 7, "replies": [{"body": "Find another car stock that has energy, robotics, computing, mining, or insurance divisions", "score": 4, "replies": [{"body": "Tesla gets their batteries from Panasonic. Another Japanese company, Toyota, also does the rest of that. I don’t think being an insurance company is very impressive either", "score": 9, "replies": [{"body": "But they will sell billions of sex robots!! /s", "score": 5, "replies": [{"body": "Too bad they’ll have Enrons sense of humor as malware", "score": 1, "replies": []}]}]}, {"body": "Lol", "score": 1, "replies": []}]}]}]}]}, {"body": "they have 26b in cash", "score": 2, "replies": [{"body": "Sure, but it'll take a while to design and the entry level is at around 1 billion.\n\nSo it's not just how much money they have on hand, but also how they can maintain that. If they keep crushing prices and reduce their revenue they will burn through that pretty quickly.\n\nSo, 1 billion per model over a 2 - 5 year cycle, all the while your margins are getting lower / sales reduce. That's a lot of time and money Tesla will have to invest and they have run out of early adopters.\n\nIs it impossible? No. But it def. doesn't justify the current stock price.", "score": 1, "replies": []}]}]}]}, {"body": "\"zero chance\".", "score": 0, "replies": []}]}, {"body": "It was a hair over $100 just this past January. Currently way overvalued.", "score": 3, "replies": []}, {"body": "Yea I’m basically a perma bull longterm and haven’t touched it since $140.", "score": 0, "replies": [{"body": "You must have a shit load of shares. $140 is way over my avg and I'm happily buying here.", "score": 3, "replies": [{"body": "I actually don’t have many. I’m just really confident in my valuations and don’t have a lot of disposable income so I’m very picky about when I buy.", "score": 0, "replies": []}]}]}]}, {"body": "Some bitter analysts can't separate their butt-hurt feelings from reality. Tesla is a leading EV company by far. Tomorrow Musk equips each vehicle with a satellite phone, and the stock will fly to the moon", "score": 5, "replies": [{"body": "Yes, but it’s a $200 dollar stock that only makes $.60/quarter.\n\nWere not saying they are going out of business, we’re saying it’s over valued based of off the profitability and future growth of the company\n\nAlso not butthurt about anything, my puts are doing great", "score": 2, "replies": []}, {"body": "This is the way..", "score": 0, "replies": []}]}, {"body": "garbage stock for garbage brains", "score": -6, "replies": [{"body": "Unfortunately it’s this. TSLA simply isn’t what it’s investors think it is, and it’s value is based on an economy that doesn’t even exist and never will.\n\nJust listen to Cathy Wood talk about TSLA and you can tell it’s all a scam", "score": 8, "replies": [{"body": "It’s like the SPAC hype during the pandemic with Chamath. \n\nPeople always assume that just because you have money you must be smart. \n\nThey just invest in each other to create a big pump and dump scheme. \n\nCathie Wood lives off of management fees. \nWhatever she says about her holdings is irrelevant. \n\nElon creates these „visions“ of AI, space travel and revolutionary solar panels or tunnels just to attract investors that stay until they can exit. \n\nIt’s the same with Nvidia. The companies all bought or rented Nvidia chips in the cloud to make some wild claims about their products. \n\nYes. „To the moon!“. All these stocks will crash eventually. Including AMD, tsmc etc.", "score": 2, "replies": [{"body": "Nvidia making a killing selling the only shovels in town and people are still thinking its overpriced. meanwhile TSLA is about to show people what overpriced means", "score": 7, "replies": []}]}]}]}, {"body": "TSLA is a big dud if you ask me. A flash in the pan. Overhyped. Overbought. I’m sticking with Toyota!", "score": 0, "replies": []}, {"body": "Should i hold or sell?", "score": 1, "replies": [{"body": "Why is buying more not an option", "score": 11, "replies": []}, {"body": "Buy high sell low? Bold strategy.", "score": -1, "replies": [{"body": "Anyone who bought before the COVID crash has multiplied their money a few times over. Everyone else is a bag holder", "score": 2, "replies": []}]}]}, {"body": "Happy to buy when it reaches 200, HSBC is always wrong lol", "score": 1, "replies": [{"body": "It was under 200 a few days ago", "score": 12, "replies": [{"body": "And close to $100 less than a year ago", "score": 4, "replies": []}, {"body": "He’s happy 😆", "score": 1, "replies": []}]}]}, {"body": "Tesla is the future. The man that runs it might not tickle your fancy, but it's a very forward thinking company, and had the best manufacturing process aside from Apple. Get with the program.", "score": 1, "replies": []}, {"body": "Will be bouncing back soon enough.. Cybertruck event coming up, highland retooling complete", "score": -5, "replies": [{"body": "Cybertuck shaping up to be a huge flop. Not to mention the rollout is going to be super slow.", "score": 6, "replies": [{"body": "People said the model Y would flop and now it’s the most bought car in the world. The model 3 is also in the top ten. So their 2 flagship cars are both in the top ten and they have the top spot. But yea go ahead and bet against the cybertruck with its 2 million preorders. I guess you could cope and pray everyone cancels. Seems pretty absurd considering someone just sold their early reservation number for 400k.", "score": 1, "replies": []}, {"body": "Flop in which way? Doesn't appear to be a lack of demand", "score": -1, "replies": [{"body": "You mean the people who put down a $100 deposit 4 years ago thinking they were getting one 3 years ago for $40k at < 3% interest? Yea I don't think they'll be following through now that the car is years late and $60k+ at 9% interest. They've likely moved on.", "score": 5, "replies": [{"body": "Rebounded already..", "score": 1, "replies": []}]}]}]}]}, {"body": "Easiest scalp of my life", "score": 0, "replies": []}, {"body": "Not worth $80. Maybe in the future when all his AI.x-*trix-mix* starts to make sense (translated to real earnings), it will be time to $146--$300.", "score": -2, "replies": []}, {"body": "all good BTC is all time high", "score": -1, "replies": []}, {"body": "I’ve been shorting his shit ever since he went right wing, selling electric cars to liberals while publicly talking about the mind virus don’t go together! He’s toxic at this point!", "score": 1, "replies": []}, {"body": "Yeah, I think the hype around musk is starting to die down, and there is so much competition now, which is why they have to keep on reducing their prices.  My cost basis is about 215, I sold 50 shares today at a very small loss of like 40 bucks. \n\nGranted, they could introduce some crazy innovation. I feel like you can't discount at this company, but I definitely see a potential for it to slowly fall. \n\nIt seems like they are growing their market share in China, but the stock still went down, the sentiment just feels negative. \n\nIt's all a Fugazi", "score": 1, "replies": []}, {"body": "Imagine trying to keep up with expectations of 50% CAGR with all the shitty decisions Elon has made.\n\nGot 4 factories? They need to build and operate 6 next year. Then 9, etc, etc. AND sell every single one they make. Fuck that, I’ll put my chips on a different horse.", "score": 1, "replies": []}, {"body": "Remember tsla is part of mag 7 glta 😀", "score": 1, "replies": []}, {"body": "The real risk is, there is only one Musk.", "score": 1, "replies": []}]}
