{"title": "13 Month Wheel Update 300k Account", "selftext": "What up everyone\n\nThis is the update for October 2023. As always, find last months update [here](https://www.reddit.com/r/thetagang/comments/16yig96/1_year_of_wheeling_a_300k_account_update/).\n\nIn Oct 2023 I closed 15 positions with an average hold time of 20 days for a gain of $3,945. Wasn't able to open as many positions as usual due to the fact I'm holding a lot of stock right now (50% of my portfolio is tied up in shares). This is ok with me though, I may get called away on a couple positions in November for some nice capital gains if the market continues to rally from here.\n\nBelow are the trades I closed in Oct 2023.\n\n[October 2023 closed positions](https://preview.redd.it/pb7b82qk6zxb1.jpg?width=922&format=pjpg&auto=webp&s=c9745da6c34271f8120863e7e923b819ec0e6aca)\n\nMy total premium profits for this 13 months period is up to $90,019. (For those that did the math, this doesn't add up because I closed some positions on Nov 1st and didn't add them to the monthly gains in October). I have unrealized losses of $19,000 at the moment. \n\n**This brings my NET profit to $71,000. On a 300k account, this gives me a return of 23.7% in the past 13 months. QQQ is up 21% in the same time frame and SPY is up 7.5%.**\n\nBelow is a running log of all my trades.\n\n[Running Log](https://preview.redd.it/7zuf5nig8zxb1.jpg?width=925&format=pjpg&auto=webp&s=2fe012f1e20a5ea25c48dcf01addae2ca31882fe)\n\nI was assigned EXPE this month and have begun selling CC on it. I may get called away from my SBUX position shortly. PYPL is under water quite a bit but their earnings report was good and I'm excited for their future. ENPH....I don't want to talk about it LOL. Will probably use that position to tax loss harvest. \n\nThanks for the continued support and hope this is helpful.\n\n&#x200B;", "id": "17ma49o", "created_utc": 1698949593.0, "score": 159, "upvote_ratio": 0.99, "num_comments": 111, "comments": [{"body": "Haven't you heard?  No one can make money with the wheel!  ;-D\n\nNice post and profits, congrats . . .", "score": 113, "replies": [{"body": "😂 thanks", "score": 31, "replies": []}, {"body": "Given a longer timeframe/sample size he will underperform the major indexes. Every back test proves this to be true. You might beat it in the short term but wait for the next sell off. The market was pretty much up over this time period so it makes sense but I don’t think he will continue to beat long term", "score": 0, "replies": [{"body": "I’ve been regularly out performing the historical 10% average of the S&P for many years, as have others.  I’d agree not everyone can do it as some get greedy chasing high IV stocks and make other mistakes, but it can be done.\n\nBack tests are crap and take out one of the most important aspects of trading, which is us as traders making good timely decisions that backtests cannot do.  \n\nIf you believe this then why are you here on an options subreddit dedicated to trading?  Are you also over on the r/food sub  telling  people  not  to  eat  so  much  because  it  will  make  them  fat?    IMHO  it  is  the  same  thing  as  many  can  eat  all  they  wish  and  do  not  get  fat  .  .  .", "score": 2, "replies": [{"body": "How have you done in down years of the market?", "score": 1, "replies": [{"body": "There is the idea that in a down market, like the -6% in 2018 and -19% in 2022 that all stocks must have lost during this time, but this is not what happened.  While a good number of stocks may be down, some may not have dropped and others may have gone up, so this is why it is so important to trade a number of stocks from diverse sectors of the market.\n\nThis also means that some stocks can drop even when the market is going up, so an “up” year in the market does not guarantee success.  It is not that cut and dried.\n\nI’ve had success in both up and down markets.  Trades and profits slow down when the market is soft or slowing, so stock selection and patient trading are more important at this time.  Being assigned and holding shares may also increase, but this is part of the wheel and a good way to ride out any market downturns is by holding stock from quality companies.", "score": 3, "replies": [{"body": "Thanks for the explanation.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 41, "replies": [{"body": "Thanks!", "score": 17, "replies": []}]}, {"body": "Grats, that's a nice result. That's also a lot of positions to manage.  I wonder how you select them, I have read so many times don't wheel things you don't want to own. Are you wheeling them because of the potential for premium, and/or because you like the ticker?    Also, is there a reason you do this on so many tickers instead of just on a few indices, qqq, spy, spx, etc?", "score": 17, "replies": [{"body": "I do a good amount of fundamental analysis before considering any ticker . I am fine holding every company that I trade. With that said...sometimes I'm wrong and that is why I limit my position size to 5% of the account. \n\nI do it on individual tickers because they have better premiums and better returns. I can also diversify on my own terms a little better.", "score": 21, "replies": [{"body": "Thanks for the reply. I'm still learning and trying to get traction on some kind of strategy. It's nice to see these kinds of posts where people have figured out a good strategy and are executing on it profitably, thank you for sharing!", "score": 6, "replies": []}, {"body": "I come from fundamental stock analysis as well. Options are fairly new to me. I'm still struggling what a good premium really is.\n\nWhere is the mismatch between risk and premium? For me it looks quite random.", "score": 2, "replies": [{"body": "I sell one standard deviation out. (Usually around 15-20delta). This gives me a positive expectancy to be correct on the trade.\nI also target a 12-20% annualized return on the trade.", "score": 6, "replies": [{"body": "How to pick your stocks to own/wheel?  Do you sort the market by potential premium somehow, then choose the stock and do your fundamental dd?", "score": 2, "replies": [{"body": "I've been in the markets for a long time now. I've followed hundreds of companies over the years. I read alot of articles and watch news/YouTube to get ideas. When I find a stock I like based on fundamentals, I trade it", "score": 4, "replies": [{"body": "I wish I had your knowledge/experience/skills!  I have resources, and interest, and I'd like to be able to do something similar, but it's taken a while longer than I would have thought to wrap my head around it, come up with a plan, and execute.", "score": 1, "replies": [{"body": "It took me 7 years to get confident enough to trade for income. Keep at it and keep learning. Goodluck :)", "score": 4, "replies": [{"body": "Cheers!", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Good stuff man. I’m not a wheel guy but I will always credit a good trader when I see one.", "score": 14, "replies": [{"body": "Appreciate that, to each their own!", "score": 6, "replies": []}]}, {"body": "Yea ENPH and ON have been terrible losers for me personally, granted I only played the earnings, so I got stung versus shot in the back and dragged in a ditch.", "score": 3, "replies": [{"body": "Hahaha I like the analogy. I'm stinging 4sure, I kept the position small enough to not hurt me too terribly, thankfully.", "score": 1, "replies": []}]}, {"body": "The obligatory congrats and fuck you but on a serious note, congrats man. Just out of curiosity, do you have a portfolio margin account?", "score": 3, "replies": [{"body": "Ahaha always wanted one of those. No PM account.", "score": 1, "replies": [{"body": "Not sure what broker you utilize but for a $300K account, you should be more than qualified.", "score": 1, "replies": [{"body": "I've never looked into it . Not sure I'm comfortable trading with margin .", "score": 1, "replies": []}]}]}]}, {"body": "A PnL curve with some stats like max drawdown/average volatility of the portfolio or Sharpe ratio would be interesting to see and how it compares to a concentrated high beta megacap ETF like FNGS or similar. That'd give you an idea for if it would be worth continuing the wheel, for all the work/stress and time that goes into it. After all, it's all long delta which some vrp mixed in.", "score": 4, "replies": [{"body": "That would be a good idea. I'll look into how to implement this.\n\nWhat does vrp mean when you say some vrp mixed in\"?", "score": 2, "replies": [{"body": "The wheel profits from shares going up (long delta) and vol risk premium which is embedded in the option premium and the reason why options are sometimes overpriced. It is a fee option sellers collect for taking on more risk and being on the opposite side of convexity or an exponential pay off.\n\nEquity risk premia is the extra money you receive over bonds, for instance, for taking more risk. VRP is a bonus you receive for offering insurance to someone else and taking the risk of a large loss.", "score": 3, "replies": [{"body": "Ah OK yeah I'm aware of these concepts I wasn't aware it was called \"vrp\" . Thanks for the explanation!", "score": 2, "replies": []}]}]}]}, {"body": "Has no one told you that the wheel is trash and you should buy voo/jepi? \n\nI'm here for you, buddy. \nCongrats.", "score": 8, "replies": [{"body": "😂 that sounds familiar. Thanks man.", "score": 5, "replies": []}]}, {"body": "This is inspiring. Wheel strategy surely requires perseverance.", "score": 3, "replies": [{"body": "Ide argue all trading does 😂", "score": 2, "replies": []}]}, {"body": "> this gives me a return of 23.7% in the past 13 months. QQQ is up 21% in the same time frame\n\nSo... What's the advantage of your strategy over buy and hold? Seems not worth the time.", "score": 4, "replies": [{"body": "I'm beating the sp500 by 3x, I'm beating the qqq, I'm less volatile as I keep half of my portfolio stashed in treasuries (which I haven't added my income from those which is easily another 5-10k) and I'm generating income to use to live without having to sell shares of qqq and inopportune times...\n\nNot many people would put 100% of their portfolio in qqq on sep 13th 2022 (the day I started trading) and then to generate income would have to sell off shares through the year...", "score": 13, "replies": [{"body": "Do this for 10 years and see if you still outperform. Beating market returns for one year is nothing. The market was up mostly this whole time you did this. Wait for another big sell off where you take some heavy losses. There have been studies done back testing the wheel and everything concludes that buy and hold outperforms by a long shot. Impressive on your part but given a longer time frame your return will definitely underperform", "score": 1, "replies": [{"body": "If market sells off then buy and hold gets affected significantly as well. And imagine living off this income and having to sell shares every month while the market sells off. That is the advantage of selling premium . I'm sure I'll have down years while the market has down years but I'm confident they will be less negative as my portfolio maintains a large cash position and I will be able to hold through the down times because I'll be making money through the premium, not having to sell shares .", "score": 0, "replies": [{"body": "Imagine selling puts during the covid sell off. You would have lost a ton of money due to sky high volatility and 40% draw down in a month. Many put sellers during that time got decimated and incurred huge losses. Also, with the wheel you are incurring taxable events every time. With buy and hold there is no tax burden until you sell. I would have unrealized gains while you have realized gains and a 30% tax bill on everything you made…", "score": 1, "replies": [{"body": "You have to sell stock to survive ? You will incur tax losses just like wheelers...you expect to pay your bills with unrealized gains ? Lol\n\nSure, a once in a lifetime pandemic decimated put sellers and buy and holders alike. If you're managing risk and can sustain through the drawdown and sell on quality companies then this shouldn't matter. You're in the same boat as buy and hold. The market recovered quite quickly in the following months as well.", "score": 1, "replies": [{"body": "When did I say that I sell stocks to survive? I know I’d have to pay cap gains if I sell stock but I don’t plan on selling anytime soon. As they are for later in life when I’m retired. \n\nOnce in a lifetime? Look back to 2009 just ten years earlier. The market went down like 50% from peak to trough. The market has had many big sell offs where put sellers would get absolutely destroyed. Hardly “once in a lifetime”.", "score": 1, "replies": [{"body": "Exactly. You're viewing this completely differently. The wheel is for people who need income now. Idk why you're comparing it with a growth strategy. \n\n2009 crash happened over a significantly longer period of time. Rolling and risk management would have been far easier. Covid was a 30% crash in a month, much different.\n\nAlso buy and hold got wrecked in 2009 as well...", "score": 1, "replies": [{"body": "I am viewing it as pointless because I don’t see the point in doing a strategy that underperforms… sooner or later you’re going to take a big loss that will make your returns less than buying and holding. During downturns you can use that time to average down below your cost basis and wait until things come back. You’ll learn sooner or later\n\nNot to mention vix is very low right now. Selling any options seems dumb right now. A spike in the vix and premiums will go way up.", "score": 1, "replies": [{"body": "How are you going to average down when you don't have an income ?\nYou aren't retired so you wouldn't understand .\nIt's not pointless, its just pointless to you . When you're retired, you'll understand.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Timing the market vs consistent returns.. YTD returns for any index means nothing.. Returns for 2y since today is -7.5% for QQQ.\n\nI'm sure OP can outperform that value eyes closed. That is what the effort is worth. Green days, everyone says is better to buy & hold, but how will you choose those green days ahead of time?", "score": 8, "replies": []}]}, {"body": "Much better than that guy who’s making like 9% YTD with weekly updates and getting upset when people telling him he’s the type of person who should just hold SPY", "score": 3, "replies": [{"body": "Not familiar haha but I try not to compare. He may be having a down year, it happens. If he's consistently making 9% year in and year out that's not terrible", "score": 2, "replies": []}, {"body": "Who are you talking about?", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks, and will do! 🫡", "score": 2, "replies": []}]}, {"body": "Why don’t you sell options on ES? It’s much easier to harvest premium as long as you don’t oversize, you could pull $200 to $300 a day with your account size", "score": 2, "replies": [{"body": "Not sure how this works. A 4280 put is 200 rn. How much collateral do I need for this ? 428k?", "score": 1, "replies": [{"body": "Much less than that, about $13k.", "score": 1, "replies": [{"body": "Could you explain ? I've never traded futures", "score": 1, "replies": [{"body": "Futures use a risk-based system called [SPAN](https://www.investopedia.com/terms/s/spanmargin.asp) as the margin system. You're probably still on the rules-based Reg-T. With the amount of money you have, you should consider applying for portfolio margin.", "score": 1, "replies": [{"body": "Sounds like I have alot to look into if I'm going to consider this. Thanks for the initial take, I'll read up on span and portfolio margin and other futures trading rules", "score": 1, "replies": []}]}, {"body": "When selling options on futures, you automatically use SPAN margin, so initially you put down very little capital compared to the actual nominal value\n\nSo if the underlying moves against your options, your margin requirements will increase which could force you to close out, \n\nFact of the matter is that it’s very powerful and fast way to make or lose money, do it right and some days you could make $1000+, just from selling options,", "score": 1, "replies": [{"body": "Sounds interesting and a lot more complex than can be explained here. I'll do some research and see if it fits what I'm trying to do. Thanks for the initial explanation", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Great post keep it up", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "This is great. I'll start one of these Jan 1 '24 too. Love the accounting and accountability.", "score": 2, "replies": []}, {"body": "I enjoy your posts each month. Appreciate the willingness to share the details. Thanks.\n\nI commend you for some key approaches when trading options, i.e, keeping the trades small and short term. That's smart.  I adhere to those same points with my strangle trading and it keeps me profitable as well.\n\nKeep going. Nice trading.", "score": 2, "replies": [{"body": "Good to hear from you! Thanks for the positive comments as usual!", "score": 0, "replies": []}]}, {"body": "If you are trading PYPL then let me know what’s your strategy. I am a certified bag holder with shit loaded shares and losing shit tone. I gotta do something so that I can recoup some…. I ain’t gonna sell this until it burns to the ground cause I lost so much there’s no point at this point", "score": 4, "replies": [{"body": "Your thinking is fundamentally wrong. If you were confident in pypl you should be happy it's cheap so you can accumulate more. \n\nThat said, it sounds as though you've overleveraged yourself and are now letting emotions dictate your rational thought of the company. \n\nMy strategy with pypl was that I sold puts on strikes I was willing to buy shares at . I'm currently \"bag holding\" same as everyone else, but am not stressed at all because my risk management has let me stay in control of my emotions. I only bought the amount of shares that I would feel comfortable holding and losing incase this went to zero.\n\nGoodluck, listen to their most recent earnings call, it will give you conviction again 😉", "score": 16, "replies": [{"body": "I thought I was confident until this pos didn’t do anything for the last 2 years other than tanking. With that said, I am confident that it will go up just not confident how much longer I have to hold this crap and not confident to pour more money into losing position. Whatever it is, I am not selling cause like I said no point selling and if this shit burn to the ground I am fine with it. I feel like it has more chance to go up than down. Just frustrating to see sometimes fundamental don’t quite reflect the pricing.", "score": 1, "replies": [{"body": "You've been holding for 2 years so you know that fundamentals don't match pricing on both sides . \n\n2 years ago this stock was 300+ and commanding insanely lofty valuations . Now we see the reverse, where it's trading way undervalued . \n\nThe point I'm making is that knowing WHEN to get into a stock matters . In 5 years paypal might be 300+ again...but it might actually deserve to be this time around haha .", "score": 1, "replies": [{"body": "We will see lol", "score": -1, "replies": []}]}]}]}, {"body": "use those shares to bring your cost basis down every chance you get. i'd open covered calls every week. if you're afraid of doing it under your cost basis use a call ratio spread to try and make up some of the profit if it does go up. if you don't use all your shares as collateral you are still doing a covered strangle and will make profit on the moves up. here's a great video explaining it: https://www.youtube.com/watch?v=pQbe0IZrs04", "score": 4, "replies": [{"body": "My avg 163 :( thanks for info will definitely take a look", "score": 1, "replies": [{"body": "ah good luck! that far off you may want to go further out in dte to around 30-45 dte. that way you can get higher premium for going further up in strike. gives you a bit of time to manage if you need to as well.", "score": 1, "replies": [{"body": "Yeah looking very hard at 30-45 dte but the crazy thing is that premium is not high which is very hard to work with given the risk I am taking. We will see", "score": 2, "replies": []}]}]}]}]}, {"body": "You're crushing, thanks for sharing!", "score": 2, "replies": [{"body": "Thanks for reading!", "score": 3, "replies": [{"body": "My friend, I wish your post was ten times as long because I love reading others’ thoughts and strategies. \n\nIf you read my updates you’ll find they’re quite the novels. HA!", "score": 4, "replies": [{"body": "I'll have to give them a read!", "score": 3, "replies": []}]}]}]}, {"body": "Sounds like a lot of work for 2.7% more. But congrats, it’s great job", "score": 1, "replies": [{"body": "People miss the point here...\nQqq has been on fire, during flat or less bullish markets, I would far exceed it. \n\nTo say \"only 2.7% more\" would assume you dumped 100% of your portfolio into qqq on September 13th, 2022, which most people wouldn't be able to time or have the guts to do considering qqq is so volatile . \n\nLastly, this is for income, if you held qqq shares, you would be selling them off each month to provide income which would significantly hurt your gains", "score": 3, "replies": [{"body": "Agree with OP. And nice 13 months ! \n\nI don’t think people often get the idea of wheels tbh , from the psychology or math sometimes \n\nIt’s income and low risk options selling . You sacrifice  upside for semi regular income to compliment the whole portfolio \n\nI trade futures , and also sell wheels. It works perfect for my portfolio In combo with my long term holds \n\nI see all I do as different parts of a business for me that bring money in different ways .", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Majority is csp's. \n\nThere are some cc in there.\n\nI only sell above my strike so I don't have losses due to getting called away under my strike if thats what you're asking. \n\nOne ticker went bankrupt (I was stupid for trading it) and I booked a 13k loss on it. The spreadsheet reflects that but that was months ago so youu won't find it on this update.", "score": 2, "replies": []}]}, {"body": "This is like cooking with 30 spices.", "score": 0, "replies": [{"body": "Sounds gross 😂", "score": 1, "replies": []}]}, {"body": "Can you talk about your margin use? I’m assuming you do use it. The more I wheel with my actual account and option trade with a paper account, it seems like having span or portfolio margin is the real way to see substantial returns from wheeling. \n\nThat’s not to say that you can’t do it without or with a smaller account, but that it is smoother, and easier to position size.", "score": 0, "replies": [{"body": "I have margin enabled but don't use it. I only use it to make sure my puts are secured while my cash sits in sgov. If I get assigned I sell sgov shares to cover the assignment. I never let my notional value exceed my account value .", "score": 4, "replies": []}]}, {"body": "Well done! Why not just wheel QQQ and/or SPY? Easier to manage no?", "score": 0, "replies": [{"body": "It is easier, but also less profits.", "score": 1, "replies": [{"body": "Do you have a day time job, or are you full time actively trading?", "score": 1, "replies": [{"body": "I have a fun day time job that I enjoy. I quit everything and began coaching tennis. Love the sport and love teaching it.", "score": 2, "replies": [{"body": "That’s awesome. What’s your educational background?", "score": 0, "replies": [{"body": "High-school dropout. Joined the military . Learned everything I could about finance and the markets on YouTube while I was active duty.", "score": 3, "replies": [{"body": "Good for you dude! Respect.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Can you explain the Nike Div? I’m assuming it’s dividend but 104% return makes me think it’s something else", "score": 1, "replies": [{"body": "It's just a dividend. The % there doesn't matter at all lol. Just the automatic fill from the equations in the excel doc", "score": 1, "replies": []}]}, {"body": "Thanks for sharing... are you aggressively rolling your CSPs to avoid assignments (i.e. the ScottishTrader way)?  Looks like you have two BTCs for negative, but STO same day.  One of them (SHOP) was 3 days before expiration... was that to avoid assignment?", "score": 1, "replies": [{"body": "Yah right now I am aggressively rolling because my portfolio reached the limit for assignments that I'm comfortable with. \nOnce I get called away from a couple positions I can relax a little on the rolling and take more assignments again\n\nYes shop was rolled, I always roll for net credit", "score": 2, "replies": []}]}, {"body": "Do you have a specific target before you close them? Like 30,50 or 80%? Do you ever wheel tesla? How do you chose a stock to sell options on?", "score": 1, "replies": [{"body": "Yah tsla is on that list. I close at 70% usually. Sometimes at 50% if it gets there rlly fast. I use fundamental analysis to choose stocks", "score": 2, "replies": [{"body": "Thanks. Starting one soon. Thanks for the spreadsheet", "score": 2, "replies": [{"body": "Np, Goodluck!", "score": 1, "replies": []}]}]}]}, {"body": "Will DM you for some questions if you don't mind", "score": 1, "replies": [{"body": "Go ahead!", "score": 1, "replies": []}]}, {"body": "Thank you for sharing. Love your concise formatting in the trade log :)  \n\\- Do you do other strategies apart from Wheeling? If so, what are the main ones you do?  \n\\- Are you trading full time for income? For how long, and has it been relatively stable?\n\nThanks!", "score": 1, "replies": []}, {"body": "Interesting, I am doing the same thing with a similar sized account and have about the same gains! One of my favorites this year has been SMCI", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I rolled a couple times to avoid assignment but always for net credit. \n\nSometimes I like assignments and would prefer to be assigned.  \n\nOnly once have I ever closed a position for a loss because the fundamentals got worse and worse.", "score": 2, "replies": []}]}, {"body": "DTE target is 30-45 days? Do you have an IV target and delta target? 50% profit exit? I’ve got a similar spreadsheet in the works!", "score": 1, "replies": []}, {"body": "How do you incorporate assignments into your returns? I’ve been struggling with the same. I’d like to think that I’ll just sell CCs on my assignments, track those, and eventually sell them for the same price I paid for them, so the actual sales cancel out, but that’s wishful thinking if one of my positions goes deep underwater", "score": 1, "replies": [{"body": "You can see the assignments are left as open trades in my spreadsheet until they are closed. When I close them i input the price where they get called away and then the spreadsheet updates with the gain/loss received. Until the position is closed, the assignment just sits in my account as an unrealized gain or loss. When I stated I had $XX,XXX amount of unrealized losses, that I from current assignments, which I subtracted from the gross profits to get the net gain. \n\nSo far I've only sold 1 position for a loss because rhe company went bankrupt. I booked a 13k loss on that position and my spread sheet reflect that . (You can see that trade in July update i think...or maybe August) \n\nHope this helps.", "score": 1, "replies": []}]}, {"body": "Hi,\n\nMay I know what delta u usually sell at?", "score": 1, "replies": [{"body": "It's not rlly a specific delta but usually 1 standard deviation otm. Usually around 15-20 deltas", "score": 2, "replies": [{"body": "Thanks. I am selling puts around the same deltas too. \nGreat job by the way and thank you for sharing.", "score": 1, "replies": [{"body": "Nice, Goodluck to you and thanks for the support", "score": 1, "replies": []}]}]}]}]}
