{"title": "PayPal stock on 6-year low. P/E is 12x, also around lows. But revenue keeps growing. Bargain.", "selftext": "", "id": "17xmnww", "created_utc": 1700248650.0, "score": 99, "upvote_ratio": 0.81, "num_comments": 110, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|4 weeks ago\n**Total Comments**|19|**Previous Best DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "want me to buy so it can bleed to zero for you?", "score": 90, "replies": []}, {"body": "It was also a bergain 3 months ago - I loaded some shares at $69 average and here I am today - down 18%.", "score": 116, "replies": [{"body": "Sucks to be you. I bought at 50$\n\n>!Either way, you'll be fine. They're a crypto stock now too with stable/payment methods going into BTC's halvening + ETF. Fat buybacks authorized and good profits + new ceo. !<", "score": 12, "replies": [{"body": "I've listen to last earning call unlike most regard here, and I can say new CEO sound like a Chad that those regard's wife will wet for.\n\nI will keep buy call on PYPL", "score": 8, "replies": [{"body": "So what you’re saying is you think he’s hot…", "score": 4, "replies": []}]}]}, {"body": "Stop loss is your friend", "score": -7, "replies": []}, {"body": ">It was also a bergain 3 months ago - I loaded some shares at $69 average and here I am today - down 18%.\n\nthinking about DCA? to me its a buy.", "score": 1, "replies": []}]}, {"body": "I see a lot of \"PayPal is dead. No one uses it\" type comments.\n\nBut I can tell you I use it frequently for my business both buying and selling. It is the best way to safely buy P2P on the internet from a rando. Scammers will never accept PayPal G&S for payment, because the buyer is protected.\n\nAlso the 3% cashback on almost all my inventory with their credit card is nice too.", "score": 55, "replies": [{"body": "Use it all the time. Safe way to pay", "score": 21, "replies": []}, {"body": "Yep. It's great for buyers as PayPal has always sided with me and I don't abuse it. I don't sell so don't know how it is from sellers point but as a buyer it's great.", "score": 7, "replies": []}, {"body": "As a business owner myself (did $1.7MM in direct online sales last year) how can you say you use PayPal with a straight face? It is THE WORST. They take money hostage, they require you to continually “submit proof” they are the antithesis of a good payment processor. How on earth can you sit here with a straight face and recommend them? 🤮", "score": 3, "replies": [{"body": "Not sure why the downvote but I’ve seen many complaints on this as well.  I used to sell small time and never had an issue but it seemed too easy for me to complain about someone and they will freeze their account.  Not good.", "score": 5, "replies": [{"body": "I added PayPal as a convenience to my “old school” customers ; it’s 2023 how often are you on a website still using “PayPal” to check out? It’s obsolete and honestly gives “unprofessional” vibes. 99% of online sales are just “cart > checkout > thank you” NOT “cart > checkout > PayPal > checkout > thank you” it adds complications. I would have PayPal hold $5k on “abnormal sales activity “ because I had somebody choose to use PayPal vs a standard credit card transaction. It’s also more expensive than most payment processors. I mean the list goes on and on and on….", "score": 2, "replies": [{"body": "What kind of products are you selling?", "score": 3, "replies": []}, {"body": "Good breakdown on pain in the ass steps. That weirdo Travis kalanick was on to something (frictionless)", "score": 1, "replies": []}]}]}]}]}, {"body": "Almost every analysis you can do on the stock indicates that it is massively undervalued.  But I think the perception of this company is just poor. Venmo, which is owned by PayPal seems to be very popular, but it's not pacing demand.\n\nSalesforce's data for October through early November indicates a 55% year over year rise in global digital wallet adoption. Meanwhile, PayPal's (PYPL.NaE) global usage dropped 8% year over year. Despite PayPal's (PYPL.NaE) claim of maintaining global share, its branded performance consistently underperforms. This raises concerns about market share, making it an ongoing investor worry, Deutsche Bank said.\n\n\"Similar to last year's holiday period, trends between [PayPal (PYPL.NaE)] and digital wallet adoption continue to diverge,\" the note said. PayPal's (PYPL.NaE) US growth went from negative 3% year over year in the 2022 holiday season to a significant decline of 15% year over year in the first two weeks of November this year. Globally, the company dropped by 8% in both the 2022 and 2023 holiday periods to date, Deutsche Bank said.\n\n\"While it has taken something of a back seat to declines in net transaction margin and the recent CEO transition, the concern about whether PayPal's (PYPL.NaE) core business is maintaining or losing share has not disappeared.\"\n\nThe firm believes it's crucial for PayPal (PYPL.NaE) to boost engagement on its platform to counteract potential share loss in the branded business and address any margin/take rate challenges in the unbranded business, according to Deutsche Bank.\n\nThe firm maintained a buy rating on PayPal (PYPL.NaE) with a price target of $74.\n\n\nMy average price is about 70, I am definitely going to hold, they have great debt ratios, good book value, great PE, but the stock is just stagnant", "score": 28, "replies": [{"body": "Lucky you, my avg price is 180.", "score": 11, "replies": [{"body": "Ouch lol", "score": 2, "replies": []}, {"body": "Do some covered calls", "score": 1, "replies": [{"body": "I wouldn't even know how to start. I only but stocks, try not to trade much.\nby the - 20% yield I've got so far I should stick to buying the SP500", "score": 1, "replies": []}]}]}, {"body": "PayPal is to payments as “@yahoo.com” is to email addresses", "score": 15, "replies": [{"body": "I only use PayPal, it's the most trustworthy and so easy. Why even bother with something else??? Do I need more than one way to pay? Plus more websites have a PayPal option and never other dumb stuff no one has heard if", "score": 3, "replies": []}]}]}, {"body": "What site shows this type of info? Pretty neat", "score": 18, "replies": [{"body": "Mobile app FinFab, from App Store. But there may be better alternatives.", "score": 6, "replies": [{"body": "Damn. No android version. ![img](emote|t5_2th52|4260)", "score": 4, "replies": []}, {"body": "You do realize that venmo is sending 25% to the IRS after $600 . they're just helping you out.", "score": -6, "replies": []}]}, {"body": "[https://simplywall.st/stocks/us/diversified-financials/nasdaq-pypl/paypal-holdings](https://simplywall.st/stocks/us/diversified-financials/nasdaq-pypl/paypal-holdings)", "score": 4, "replies": [{"body": "You're obviously not as rich or intelligent as me if you're still investing in PayPal. They're a has-been company that is way past their prime. Find some better stocks to invest in if you want to make any real money.", "score": -6, "replies": [{"body": "stupid has-been bot", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|27189)![img](emote|t5_2th52|27189) LOL", "score": 1, "replies": []}]}]}, {"body": "Just use Python and build your own.", "score": 1, "replies": [{"body": "You can borrow my mouth for as long as it takes if you tell or show me how to do that.", "score": 12, "replies": [{"body": "You dont have to do that anymore- now you can just ask ai", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": 10, "replies": [{"body": "Agree, better to use Bloomberg terminal, but it’s expensive. If you have any cheap substitutes, please let me know. Here is history of PayPal P/E:\n\nhttps://preview.redd.it/1yl4ddd3r31c1.jpeg?width=1170&format=pjpg&auto=webp&s=59b70bbf67a4fc44757275aab6559a77a32ce578", "score": 4, "replies": [{"body": "[removed]", "score": -4, "replies": [{"body": "Lol what a douche. Just let me gamble man", "score": 6, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Okay then paypig", "score": 1, "replies": []}]}]}]}]}, {"body": "I think some sites used non-GAAP earnings vs GAAP hence the lower PE. If you use GAAP earnings the PE is closer to 16-17x.\n\nThey generated 1.9B in adjusted free cash flow in Q3 when you back out the one off -0.8B impact from BNPL loan originations held for sale.", "score": 1, "replies": [{"body": "It is always a problem. We have actuals for prior periods but the company exists in the period next to that. It is worth using interpolation between actual a from prior period and expectations for current one.", "score": 1, "replies": []}]}, {"body": "Enlighten us mr douche, what is the actual PE?", "score": 1, "replies": []}]}, {"body": "Try catching a falling knife.", "score": 16, "replies": []}, {"body": "Not this shit again", "score": 3, "replies": []}, {"body": "People always forget there is a privately-owned behemoth slowly consuming the entire payments industry: Stripe", "score": 24, "replies": [{"body": "Americans always talk about stripe and over here in Europe, I have no idea who they are", "score": 24, "replies": [{"body": "Most people have no idea who they are. But they're everywhere.\n\nOn reddit, click \"buy premium\" and look closely at the checkout page.", "score": 5, "replies": [{"body": "But surely I would have noticed them if I actually used them? Or are you saying they underpin payments without their branding being obvious? Eg when I buy smth on my credit card ?", "score": 7, "replies": [{"body": "Stripe branding is completely optional, it won't even appear on your bank statement. There is literally no way to know if you've used them. They're invisible.", "score": 10, "replies": []}, {"body": "Search stripe on your bank statements", "score": -3, "replies": [{"body": ">We found 0 transactions\n\nI shit you not, 3yr transaction history, literally $65,000+ in credit card transactions, zero say stripe anywhere in them.", "score": 14, "replies": []}]}]}, {"body": "Stripe is mostly backend infrastructure you’re not interacting directly with Stripe in many cases but an implementation. You might see a ‘Powered by Stripe’ branding somewhere on the page but that’s it it’s not a front facing app like PayPal.", "score": 5, "replies": []}]}]}, {"body": "Stripe isn’t as big as you think it is", "score": 33, "replies": [{"body": "That's kind of the point, they're still growing.", "score": -11, "replies": []}]}, {"body": "Stripe is shi@t", "score": 5, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Apple pay is limited to the number of people who have an iphone\n\nAlso: [https://stripe.com/docs/apple-pay](https://stripe.com/docs/apple-pay) you can enable Apple Pay for no additional fee", "score": 3, "replies": [{"body": "“Limited” to the number of people who have an iPhone is the most regarded sentence I’ve ever heard", "score": 9, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Amen brother.  The delivery vehicles keep coming.", "score": 1, "replies": []}]}]}, {"body": "Yeah, only clueless sheep use Apple anything, I'd never offer that as a payment option. I don't even want dumb customers, more headaches in the long run", "score": 0, "replies": []}]}]}, {"body": "Ok boomer.", "score": 4, "replies": []}, {"body": "PayPal Holdings, Inc. is a great company and their stock price reflects that. They are a leader in the online payment space and have shown consistent growth over the years. Their revenue for the most recent quarter was impressive and I expect them to continue to perform well going forward.", "score": 11, "replies": [{"body": "Geez make up your fake mind VM", "score": 9, "replies": []}, {"body": "Go back to sleep vm", "score": 2, "replies": []}]}, {"body": "Maybe in the market is forward looking", "score": 2, "replies": []}, {"body": "https://www.fool.com/investing/2023/11/17/could-warren-buffett-and-berkshire-hathaway-be-buy/", "score": 2, "replies": []}, {"body": "You were supposed to buy September of 2021 and sell now", "score": 2, "replies": []}, {"body": "So I’ve done quite a bit of research on this for a college presentation and here is a summary of the pros and cons and ultimately why I see PayPal as a great buy here: \n\nStarting off with cons, PayPal has had some uncertainty with increasing competition in the payments space from new players (block, apply pay, etc) and veteran banking leaders (Zelle). The market may be worried PayPal is losing market share. PayPal’s transaction take rate has steadily declined (in large part due to Braintree’s growth outgrowing higher margin branded checkout). In addition, new ceo and much of executive team has a lot of execution uncertainty… can they pull a turnaround of PayPal’s operations and somewhat reckless capital allocation (overpaying for useless acquisitions in the last few years). \n\nPros: \nTransaction take-rate should stabilize as PayPal Braintree pricing should have some pricing power as it continues to take share and build out its economic moat - stabilizing and ultimately increasing transaction take rate. I see their competitive short term Braintree pricing as similar to Amazon’s strategy of super low prices to drive away potential competitors, then raise prices. Regardless of new competition, PayPal’s market share has stayed extremely strong thanks in large part to its fantastic portfolio of consumer apps and customer loyalty. PayPal and Venmo are easy to use, super apps, and are extremely popular with younger to middle aged consumers. Revenue was up 9% in most recent quarter… \n\nEps should be ~ 5 next year times 19… = share price of $95…", "score": 2, "replies": []}, {"body": "Buy Venmo instead", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|12787)![img](emote|t5_2th52|12787)![img](emote|t5_2th52|12787)", "score": 3, "replies": []}, {"body": "PayPal used to be the easy, secure option when buying on random websites. But now they all have choice of Shop Pay, Amazon Pay, Google Pay, Apple Pay, Stripe... PayPal is not the go-to option anymore and I'm not convinced they can reverse this trend.\n\nVenmo may be popular for payment between friends but there's not much money in that. All home services I'm using want me to use Zelle instead.", "score": 2, "replies": []}, {"body": "Real question is who’s still using PayPal? They got no edge on tech anymore.", "score": 4, "replies": [{"body": "I know a lot of people that use their business accounts.", "score": 2, "replies": []}]}, {"body": "bro we are talking about the company that pick in thier clients pocket when they have to pay the rent.", "score": 2, "replies": [{"body": "Sounds bullish", "score": 18, "replies": []}]}, {"body": "Let’s see those bags", "score": 2, "replies": []}, {"body": "Puts", "score": 3, "replies": []}, {"body": "Time for puts", "score": 2, "replies": []}, {"body": "paypal is the worst company i have ever had to deal with in the history of companies. That and a t and t refusing to take upfront cash to cover and entire years bill. Yes they refused cash for an full year advanced pay. Unreal", "score": 2, "replies": []}, {"body": "Whoops, looks like you meant to post this chart on r/notinteresting", "score": 1, "replies": []}, {"body": "One day some guy has gotta hit the bottom on one of these bullish PYPL posts", "score": 1, "replies": []}, {"body": "Who the hell uses PayPal anymore? SQ is the superior pick here.", "score": -2, "replies": []}, {"body": "https://preview.redd.it/o9in4t3zzz0c1.jpeg?width=1079&format=pjpg&auto=webp&s=167dc94ae6b9a961c4033cac50c140d8004e0187\n\nChat gpt analysis", "score": 0, "replies": []}, {"body": "PayPal has that Elon Musk stench.", "score": 0, "replies": []}, {"body": "I shorted that pig on Friday", "score": 0, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}, {"body": "Ngl, using PayPal is a pain in the butt. Stripe and APPL pay are way more convenient.", "score": -5, "replies": []}, {"body": "i think paypal is just dying man", "score": -3, "replies": []}, {"body": "Been waiting for a reversal while the theta decay eats majority of the premium.", "score": 1, "replies": []}, {"body": "No reason not to wait for it to go sideways, consolidate and buy it at support. There's no rush.", "score": 1, "replies": []}, {"body": "Why would you buy a stock that’s in a clear downtrend? At least wait for a period of consolidation.", "score": 1, "replies": [{"body": "Yeah because we all know when its going to consolidate then return on its uptrend, its called the stock market for a reason not ya local garden markets ya peanut, no one knows where its going and if you do ur kidding ya self.", "score": 2, "replies": [{"body": "Yeah, you’re right, better to knife catch then, makes total sense. You peanut.", "score": 0, "replies": []}]}]}, {"body": "Asking a serious question: have they caught up and made it easier to use on a device? I switched to Apple Pay because I can pay quickly with my passcode.  It’s a little too easy when I get a look at my monthly statement and all of the crap in my house.  \n\nWith PayPal I had to login, username and password which I never remember because I used it so infrequently.  I could just look this up myself but I’ll let one of you tell me and then roast me.  I can take it….you bastards.", "score": 1, "replies": [{"body": "Yeah, way easier. I rarely have to enter a password; it's usually autofilled or it just \"recognizes your device\". Behaves the same on both iOS and Android. No real reason to use it if Apple Pay or Google Pay is available though, except Chase Freedom cards give you 4 bonus points per dollar spent with PayPal about once a year.\n\nI actually like using PayPal, but I'm not sure if I'd invest in it; stock just can't catch a break.", "score": 3, "replies": []}, {"body": "Looks like they recently solved your issue.", "score": 2, "replies": [{"body": "Meh…I’ve moved on", "score": 1, "replies": []}]}]}, {"body": "Time to load up the boat/fuel your rockets 🚀", "score": 1, "replies": []}, {"body": "It’s a buy.", "score": 1, "replies": []}]}
