{"title": "Why is no one bullish on CHPT?", "selftext": "DISCLAIMER:  I don't know shit and I have NEVER tried to  make a case for a particular stock.\n\nThere are about 2 million EVs on the road today.  Projections are to sell 4 million by the end of 2024.  So that's a 200% increase in charging demand.Chargepoint has more chargers than anyone but Tesla.  In many places public charging is at capacity.\n\nI don't see any way things don't take off but most of what  i read says CHPT is a big risk with a questionable future.\n\nIf you were having this conversation after the dot com bubble in 2000 you might say \"wow, Amazon is really on its ass\".  But even then  the internet was growing by 20% a month and Amazon was the best online retailer.    So  no matter how bad it looked, there was no scenario you could envision that would take amazon out of the  equation.\n\nI feel like we are in a similar moment.  EV growth is inevitable.   All you have to do is suck less than your competitors and CHPT seems to meet that criteria.  \n\n\nEDIT:   Thanks for all the replies. I learned a lot.   Some us cannot learn from a set of rules or formulas- we need to find an example and beat the hell out of it.   This post really helped me understand a lot of things. \n\n&#x200B;", "id": "186042f", "created_utc": 1701189004.0, "score": 44, "upvote_ratio": 0.76, "num_comments": 102, "comments": [{"body": "Bad financials. A cursory glance shows that while revenue grow is strong, profitability is nonexistent and not trending upward. 20% of their assets are goodwill, which from a company that sells charging services, seems too high. Also, negative cash flow from operations, and CFO > EBIT can be a warning sign of potential overstatement or non-sustainability and of operating income or net income. Even if not, income statement (excluding revenues), balance sheet, and cash flows all look bad.", "score": 53, "replies": [{"body": ">income statement (excluding revenues), balance sheet, and cash flows all look bad.\n\n  \nAnd how is that different from Amazon in 2000?   \n\n\nWhen the bubble burst in March 2000 there were 300 mil. people on the internet.   \n\n\nWhen Amazon first turned a profit after Christmas 2001 there were 500 million.    \n\n\nSo Chargepoint might be a shitshow but they are still putting plugs in the ground for a market that is growing exponentially and no one is on their tail.", "score": -18, "replies": [{"body": ">And how is that different from Amazon in 2000?\n\nSo because one company made this strategy work it will work for everyone else?\n\nEveryone brings up Amazon as the example of a company that made losses before becoming what it is today but they ignore the 99 other companies that never made a profit using the same strategy.\n\nIf your bull thesis is CHPT will have the same success as Amazon, then the odds are truly against you.\n\nSpeaking of Amazon, if they decided EV charging was a worthwhile thing to get into, we would have Amazon branded chargers and CHPT would die.", "score": 28, "replies": [{"body": "No, i'm comparing them to amazon as a company that got in front of a wave.", "score": -13, "replies": [{"body": "Why do you think large companies like Amazon are not making these chargers?", "score": 5, "replies": [{"body": "I’m not bullish on ChargePoint but they do have a different business model than any other large players.\n\nEvGO mainly operates their own chargers, revenue comes from selling electricity.  Other charger manufactures just sell hardware.\n\nChargePoint sells charging as a service.  You buy the charger, install it, and the customer sells electricity.  ChargePoint offers a full service of maintaining both the hardware and the software (to include payment network).\n\nThey are selling chargers as a service.  \n\nThere is a moat here. A shallow one no doubt but they do have a unique angle.", "score": 2, "replies": [{"body": "I'd be curious to see how they plan to survive the next couple years, would be an interesting earnings call.", "score": 1, "replies": [{"body": "Yeah I don’t own any CHPT but am curious.  If they can survive long enough for rates to come down there could be easy money to be made considering the current stock price.\n\nBuuut if their cash burn accelerates they’ll go bust before they can enjoy EV market scaling effects.", "score": 1, "replies": []}]}]}, {"body": "Anyone can make the charger but Chargepoint has a 15 year headstart on everything else, installation, permitting,  optimal location, etc.  They have some innovation that others do not have (500KW charging)   \n\n\nMercedes chose them for some dealership MB charging.", "score": -5, "replies": [{"body": "That headstart won't matter if they are bankrupt. Raising money in a high interest environment for a company losing money is very difficult.\n\nIn one year they will run out of cash at current annual loss rates.\n\nChargepoint is being forced into death-spiral dilution, issuing more and more shares just to stay afloat.\n\nGiven the price, the market is pricing in bankruptcy and the chargers being sold off to a different player.", "score": 7, "replies": []}]}]}]}]}, {"body": "Did you really just compare chargepoint to Amazon?  WTF dude?  Fucking hell, one was a revolutionary tech platform for selling things to people through a screen.  The other is trying to sell power to people who's #1 or 2 reason for buying an electric car is to never pay to fill up a car ever again.  They ability to make money from charging is minimal.  Right now I think a full Tesla charge costs ~$2, and it will be absurdly hard to increase that.  Where do they make money?  How do they expand?", "score": 11, "replies": [{"body": "For accuracy sake ChargePoint doesn’t make money from selling electric.  They sell chargers and support services for the chargers.   The “customer” is not a car plugged in but someone else who bought and installed their charger and pays ChargePoint for services.", "score": 3, "replies": []}, {"body": "No, not comparing to amazon, I'm comparing the conditions.   Lots of people in the financial press wrote off amazon after 2000 because they did not see where the internet was going.    \nI'm seeing the same thing with CHPT.   People who understand stocks (unlike me) ignore EV growth in their analysis.   \n\n\nSo the answer i am looking for is - here's why they suck, EV growth will not fix that, and that's why you're wrong.", "score": -2, "replies": [{"body": "Ahh, ok that makes a lot more sense.  For me I always boil it down to where the money comes from.  How do you expand that?  What do you offer that makes your product worth while.  For me the largest problem with huge EV uptake is at home charging.  So many people live in apartments where they cannot charge at home, that makes CPHT potentially compelling, however how do they drop charge times to under 5min, or provide enough stations at places people go so that at least one spot is always open.  Work, grocery store, mall, library, etc...  How can they get people to happily pay any cost to charge at those places?  Can they get people to charge when they have a home charger?  Can they get companies to pay a subscription fee so employees don't pay?  For me I just don't see 1.  Where the money comes from and 2. I don't see how they ramp growth and revenue in any kind of reasonable manner...", "score": 1, "replies": []}]}]}, {"body": ">And how is that different from Amazon in 2000?   \n\n\n OP do you also think all short people are destined to conquer entire empires? I mean, Alexander the Great was short, so that must be the key right? \n\nI suggest you give this Wikipedia article a read least you embarrass yourself by accusing everybody with a mustache as being a genocidal Nazi \n\nhttps://en.m.wikipedia.org/wiki/False_equivalence", "score": 5, "replies": [{"body": "I'm guessing you were not watching  markets in 2000?   Not many people understood how his plan would work.   \n\n\n\"Jeff Bezos is selling dollar bills for 75 cents\"", "score": -1, "replies": [{"body": "You didn't read the Wikipedia article huh?", "score": 2, "replies": [{"body": "Fuck off,  I don't claim to know shit.  And i have no problem being wrong.  I ask questions.  Either answer them or hut the fuck up.", "score": -2, "replies": [{"body": "We've been answering your questions.\n\nRead the damn Wikipedia article and you'll see why so many people here are telling you you're wrong.", "score": 9, "replies": [{"body": "Yeah, false equivalent.     Saying it's a false equivalent doesn't mean anything.    i assume there is something wrong with my assertion otherwise CHPT  would not be $1.87 today.     \nAnd some people have provided some pretty good answers.", "score": -2, "replies": [{"body": "It's a false equivalence when your reasoning for supporting the company is because it followed a similar pricing pattern as Amazon, when Amazon became a behemoth in spite of its periods of unprofitability. Not because of it.", "score": 3, "replies": [{"body": "I'm not comparing the two on numbers.  I don't know the specific numbers.   \n   \nAmazon did what it did because the world changed around it and JB understood that.    If internet growth had flattened out at 300m  as it was in 2000 when amazon was losing money that would have been the end of it.   \n\n\nThat phenomenon, the idea of getting in front  of a market that doesn't yet exist absolutely will be a factor with some EV companies.    The legacy car makers will grudgingly invest and build because they have to  but a new Electric   Ford just replaces an ICE  Ford  so it's not significant.   \n\n\nBut the companies who make stuff EVs need will see demand increase 30% a year.   It may not be CHPT but someone on forbes top 20 in the next decade will be an EV billionaire.", "score": 1, "replies": [{"body": ">I'm not comparing the two on numbers.  I don't know the specific numbers.   \n   \nAre you trolling? Nobody said you did.\n\nWhat we're saying is that your argument of \"Amazon also wasn't profitable for a long time and now it's super wealthy\" isn't a good argument.\n\nThat's it. That's literally it.", "score": 1, "replies": [{"body": "Ok, let me completely rephrase the question;   \n\n\nIf EV growth doubles every two years, do you think some companies will grow at an extraordinary rate, and in what sectors?   \n\n\nI used amazon as an example to hang my question on because EV growth looks a bit like internet growth.", "score": 1, "replies": [{"body": "Yeah and how many internet companies went bust when that bubble popped?\n\nAnd EV growth also isn't even doubling every 2 years. Id already given you a source that says it isn't", "score": 1, "replies": [{"body": "[Here's a source](https://www.statista.com/statistics/665823/sales-of-plug-in-light-vehicles-in-the-us/) that says it is.  But that's not important, it's growing really really fast.   \n\n\nDo you want to have a conversation or is the goal to prove how smart you are and that I'm stupid?   \n\n\nHind sight is 20/20 but if you look at who survived the dot com crash and who didn't it's not that hard to see why.   Apple, Adobe, Cisco, SanDisk were making stuff people wanted before the internet.  They should not have gone down in the the crash and it's no surprise they recovered.   \n\n\nEbay was pretty much turning a profit from day one.   \n\n\nAmazon was losing money but they had the best interface and a smart leader.   They just needed enough cash to survive until the internet grew to meet them.   \n\n\nA lot of the ones who died were stupid goldrush ideas like [couch.com](https://couch.com).   \n\n\nSo, here we are 20 years later with this thing everyone is gonna have eventually and a lot growth is gonna happen all at once.    \n\n\nThere are some big differnces.  The internet tends to favor monopolies, there's one google, one ebay, one amazon etc.   \n\n\nThere can be lots of successful charging companies, especially now that NACS is the standard.   And right now CHPT is in front  of everyone who isn't  Tesla.   \n\n\nBut someone is gonna sell all those amps.", "score": 1, "replies": [{"body": "Cherry picking data now are we?\n\nThis was you yesterday, was it not?\n\nhttps://www.reddit.com/r/stocks/s/Gr6ojq5l6g\n\nThere are a ton of comments here talking about how your company isnt doing anything that no other company can't do. There's no moat. All it takes to completely bankrupt your company is if Tesla expands the charging infrastructure. Or if Ford or Toyota decide to expand into chargers field.\n\nLiterally the only thing stopping your investment from dropping to 0 is a couple of corporate executives committing to EVs.\n\nBut if you're so sure about this investment, then why not dump your entire net worth into this stock that has dropped 80% this year? Then you can come back in 10 years to show off your riches", "score": 1, "replies": [{"body": "\"Literally the only thing stopping your investment from dropping to 0 is a couple of corporate executives committing to EVs.\"  \n\n\nUnless it was General Electric, it's a not so easy.  Safely converting 480VAC 3 phase into 400 amps DC is not for chumps.  CHPT has a decade of mistakes  and 20 times as many chargers as the next nearest competitor (beside Tesla)  that gives them some advantage.    There is a reason why all the chargers in my area, provided by three different companies, are all made by Chargepoint.   \n\n\nI'm retired, i'm not dumping my net worth into anything.  This was just a question, a way of comparing two periods in tech history.   \n\n\nBut if you're so driven to \"prove me wrong\" you should come watch me find propane leaks with an open flame.", "score": 1, "replies": [{"body": "Come back in 10 years and we'll see how much it's worth then 🥱 just for records keeping sake , today CHPT is worth $1.97 and the S&P 500 is at 4,564.23", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": ">And how is that different from Amazon in 2000? \n\nIn 2000, Amazon traded at an adjusted $0.78 per share. It also traded at $0.78 per share in 2002 when it had positive and growing operating cash flows. Why take bets on whether a company can become cash flow positive? If it's a great organization, then there will be plenty of upside left after it begins turning out cash flows. This style of investing has always seemed risk asymmetrical in a disadvantageous direction to me.", "score": 2, "replies": [{"body": "This struck a chord with me the way you phrased it - thank you.", "score": 1, "replies": [{"body": "1.35 now... wow", "score": 1, "replies": []}]}]}, {"body": "Yeah, but, like, EVs are the future right? So stock go up like amazon?", "score": 2, "replies": [{"body": "THat's my question- if demand triples in then the next year or so what happens?   Tesla expands so dramatically Chargepoint can't even catch the crumbs?  Someone else emerges who knows how to deliver charging and builds a bigger better network?    If CHargepoint does not become profitable then what does its demise look like and who's sell all that charging?", "score": 1, "replies": [{"body": "Is demand going to triple in the next year?", "score": 2, "replies": [{"body": "Hard to say,  It looks like the number of EVs on the road could triple in the next year.", "score": 1, "replies": [{"body": "Source: just trust me bro", "score": 2, "replies": [{"body": "No,  google it.  The combined industry projections is 4m EVs in 2024- add to the 2M currently on the road and that would be 6M.", "score": 1, "replies": [{"body": "I googled it and you're kinda far off tbh \n\nhttps://evadoption.com/ev-sales/ev-sales-forecasts/", "score": 2, "replies": [{"body": "You are correct.    Not sure what i saw that gave me that number.  But it only changes my question a little.", "score": 1, "replies": []}]}, {"body": ">add to the 2M currently on the road\n\nDo you mean 25 million? Are you going to have 50 million EV sales next year? Lol. \n\n\"we arrive at \\~25.19 million EVs in operation. \"\n\n[https://evadoption.com/ev-sales/ev-sales-forecasts/](https://evadoption.com/ev-sales/ev-sales-forecasts/)", "score": 2, "replies": [{"body": "turns out i had that completely wrong- too many shrooms", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Did you just say AMAZON??? Bwahahahahahahahaha!!!!!!\nCheers for the laugh mate", "score": 1, "replies": []}]}]}, {"body": "Two issues with chargepoint.\n\n First is that we’re in a high rate environment and they’re massively unprofitable. This makes it incredibly hard for them to acquire funding, so any cash they get from here on out is through massive dilution to shareholders.\n\nSecond issue is that Tesla is in the early stages of dominating the entire EV charging industry. They’ve convinced basically every auto brand in North America to switch to their tesla chargers. This means that to use chargepoint you either need to hassle around with an adaptor or chargepoint needs to spend billions to upgrade all their chargers to NACS. \n\nBonus reason chargepoint sucks is their business model. They have a tiny margin on their cloud business, and the majority of revenue comes from selling or repairing the charging stations to customers. Compare this to tesla, who gets paid every single time someone uses their supercharger. \n\nNot every company down 95% is like amazon in 2000. Most are like Pets.co in 2000", "score": 22, "replies": [{"body": "The NACS thing is a bit of an unknown- all the the non-teslas on the road today will need adapters.   But, going forward, if all the new cars and all the  new chargers are NACS it's hard to say how much that will matter.", "score": -4, "replies": [{"body": "\"bit of an unknown\" - huh? All new vehicles in 24/25 will have the NACS plug, and the older vehicles will have an adaptor. Note: the amount of non-tesla pre2024 vehicles will be TINY compared to the market in a few years. \n\nTesla has won the charging war for the foreseeable future - CHPT and Electrify America will be grabbing for breadcrumbs.", "score": 11, "replies": []}, {"body": "I've used 4 Chargepoint chargers - 3 did not work.\n\nI've used 100+ Tesla superchargers, all worked just fine. \n\nThere's no way CHPT is taking over the industry with their high failure rate.", "score": 3, "replies": []}, {"body": "They are all converting to NACS and the number of non-Tesla EVs on the road right now might as well be zero. I was looking at sales numbers for EVs this year earlier in the month and through November Tesla sold more Model Y than every other EV by every other manufacturer combined. If you compare individual models vehicles like Model Y and Model 3 have about 10x more vehicles in the road than the next most popular EVs like the Mustang Mach E or Hyundai Ioniq. A charging network can't get revenue from vehicles that don't exist in any reasonable quantity.", "score": 3, "replies": []}, {"body": "I've used 4 Chargepoint chargers - 3 did not work.\n\nI've used 100+ Tesla superchargers, all worked just fine. \n\nThere's no way CHPT is taking over the industry with their high failure rate.", "score": 2, "replies": []}]}]}, {"body": "Single biggest loser investment I've made. Will probably baghold until $0 at this point", "score": 21, "replies": [{"body": "I'm hoping for an acquisition.  Seems inevitable.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I threw in some purely because of this thought after that dip this week", "score": 1, "replies": []}]}]}, {"body": "I doubled down on Blink too  :(", "score": 1, "replies": []}]}, {"body": "Revenue growth seemed to be leveling out in the recent quarters\n\n[https://finance.yahoo.com/quote/CHPT/financials?p=CHPT](https://finance.yahoo.com/quote/CHPT/financials?p=CHPT)\n\nOperating cash bleeding is not turning around\n\n[https://finance.yahoo.com/quote/CHPT/cash-flow?p=CHPT](https://finance.yahoo.com/quote/CHPT/cash-flow?p=CHPT)\n\nCash and current assets are shrinking while liabilities are growing\n\n[https://finance.yahoo.com/quote/CHPT/balance-sheet?p=CHPT](https://finance.yahoo.com/quote/CHPT/balance-sheet?p=CHPT)\n\nIt's very capital intensive business and they are going to need even more cash for the NACS transition/expansion. Loans are expensive right now and they've driven their stock price to the ground with new issuances. They are closer to chapter 11 than turning a single cent in profit.", "score": 7, "replies": []}, {"body": "Hello, fellow “dont know shit” here\n\nI worked an internship in college a few years back and we installed (the company not me) Chargepoint stations. I never had an issue with them and they were good people to work with\n\nI own some of their stock and will hold, i feel something is bound to happen", "score": 14, "replies": []}, {"body": "The problem with CHPT and EVGO are that its expensive to install infrstructure and adoption has not been quick enough to drive the revenue needed for further expansion. So that means in order to grow, they either need to take on more debt (at higher rates these days) or sell more equity (thus, diluting shareholders). If you're investing here you're basically hoping for someone to buy them out at a premium to complement their own network,  but the environment just isn't there right now to be optimistic on that.", "score": 5, "replies": []}, {"body": "This is news from months ago but Tesla opening up their charging stations to other cars kinda killed off the other charging stocks. As well as their charging model becoming the US standard.", "score": 5, "replies": []}, {"body": "If you ignore Tesla's chargers, I'm sure they're pretty good. Unfortunately, Tesla's chargers are probably cheaper, better and more numerous, and Tesla has a vested interest in keeping it that way", "score": 4, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I definitely wouldn’t buy stock in a company with such high demand.", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "I'm sitting on a bunch of this trash stock. Wait, hoping and wishing for it to average up to my cost so I can sell. Single biggest mistake in stock i have made till this point. My stomach turns when I see how much money I lost in this dump of a stock. It can barely keep its head above $2.00 and all my dumbass mind says to do is buy more so i average down....how fucked am I?", "score": 3, "replies": [{"body": "Yep. First bought at $13 a year ago. Then threw more at it when it was $9,$7,$3. Just hoping for a little bump to get it back to where I can dump it. Today it’s at $1.63. Lesson to learn is that it can always go down.", "score": 2, "replies": [{"body": "It’s at $1.78 today and I did the same thing. Have about a grand invested and it’s worth ~$250 today…RIP", "score": 1, "replies": []}]}]}, {"body": "0% gross margins", "score": 2, "replies": []}, {"body": "I’ve worked extensively with Chargepoint charging units along with many others and their technology is hands down the worst. More dead chargers that owners can’t use than any other brand put together. Having more than 1 car charge off a charger is a pain as well. Highly recommend you stay far from this company", "score": 2, "replies": []}, {"body": "I love people that request the counter argument and then get salty lol", "score": 2, "replies": []}, {"body": "Wel I am bullish on CHPT, if you will.", "score": 2, "replies": []}, {"body": "how you gonna beat tesla at their own game?", "score": 3, "replies": []}, {"body": "That's a 100% increase, lol.", "score": 1, "replies": [{"body": "i don't think so- total EVs on the road, from all time,  is 2 million.  If they sell 4M next year, minus the ones that get scrapped, that will be six million.", "score": 2, "replies": []}]}, {"body": "EVs are a big scam and the market will realize this in a few years when we run out of metals and other materials needed for the \"green revolution\". De-globalization is also a huge risk to EV stocks and EV adoption. Plenty of other reasons to doubt the hype about ChargePoint with Tesla charging network etc...", "score": 1, "replies": [{"body": "In other words, capitalism doesn't actually work?    \n\n\nIf we have a thing people really want we can't count on market forces to overcome obstacles and produce it?", "score": 1, "replies": [{"body": "The market works most of the time but EVs are not driven by market demand. The government and \"greens\" tamper with the market via subsidies and mandates. There's literally not enough material on the planet for all vehicles to be electrified, for electrical systems to be upgraded, transition to renewables etc... Not to mention the world doesn't have the capital to invest in the transition. ChargePoint will continue burning money and eventually go bankrupt. Tesla valuations will fall because the EV market is saturated at 2 percent penetration. I know this point of view seems shocking but reality doesn't make headlines in the media...", "score": 2, "replies": [{"body": "There are some problems with your assertions.    \n\n\nA lot of EVs are sold with no credits and no incentives.    Tesla could not get the previous credit after it sold 250,000 units.   Under Biden the new credit applied to all cars but has an income cap that a lot of EV buyers exceed.   And it does not apply to imports but still people are buying them.   Mostly because they are just BETTER CARS.", "score": 2, "replies": [{"body": "Tesla is the one exception or now. Rivian loses 60k PER EV. Ford loses 20k+ etc. I'm telling y'all now the EV market has a bleak future", "score": 2, "replies": [{"body": "Again, capitalism.    Ultimately EVs are cheaper to make.   All the component prices will come down drastically.  Event if the price of Li and rare earth metals goes way up, every other part will get cheaper.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "You’re buying a gas station if you think about it. Still sound like a great investment?", "score": 0, "replies": [{"body": "Yes.  A gas station with NO underground tanks and no inventory.  Sell the product before you buy it and the power company delivers it to your customer.  It's a fantastic business model if the demand is there.", "score": 1, "replies": []}]}, {"body": "Bullish on California Highway Patrol?", "score": 0, "replies": []}, {"body": "Simple do a calculation of the number of gasoline stations for US and EU and assume 8-12 charging stations per station (this is the average number of pumps) and then add on that it is estimated that 80% will drive less then 120 miles / days and over 50% will charge at home.   \n\nNow add in hotels, new housing construction (including condos and business are installing charge stations.   Plus the major oil companies are entering this segment and TSLA sharing it network\n\nSimply put the numbers do not add up.", "score": 0, "replies": [{"body": "But chargepoint is the number one maker of all those chargers being put in by hotels and gas stations.", "score": 1, "replies": [{"body": "and how much money do they make on those?", "score": 2, "replies": []}, {"body": "No, many small players serving home market.  I was in BLNK from OTC days got out once NASDAQ listed at $25.  Read too many report and numbers do not add up.\n\nGood Luck", "score": 0, "replies": []}, {"body": "And that would be great if they were priced like a niche retailer instead of tech start-up", "score": 1, "replies": [{"body": "You mean the stock is over priced because of hype?  That makes sense.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla has got this", "score": 0, "replies": [{"body": "Not true.  Tesla owns owns the charger and sells the power.  They also play around with it as a benefit of owning a Tesla (free charging for life)   \n\n\nChargepoint sells the hardware.  If you're a hotel and you want to offer charging as a perk or a revenue stream, you go to chargepoint.", "score": 0, "replies": []}]}, {"body": "Im in $PPSI for EV charging infrastructure. No debt, profitable.", "score": 0, "replies": [{"body": "Whos that?", "score": 1, "replies": []}]}, {"body": "Ex-holder of the stock, dipped out around 8ish dollars in the spring in the wake of the deal between Tesla and Ford. The simple fact is Tesla has already won the race by having their charging ports on their own cars (the most popular EVs by a significant margin), Ford, GM, and BMW. I'd be willing to bet more deals are in the works between Tesla and the other car companies. \n\nThis isn't even getting into the fact that the company is bleeding money in a high interest rate environment. ChargePoint is in my opinion going to be an acquisition play, but I don't foresee it surviving unless they pivot away to some other smaller niche such as focusing specifically on residential charging", "score": 1, "replies": []}, {"body": "To many red flags, an experienced investors stays away from this one.\n\nJust a few reasons:\n\n* bad business model (selling hardware)\n* high interest rate environment (burning cash like hell)\n* crazy amount of competition\n* impossible to compete with Tesla\n* not to be profitable the first coming decade\n\nJust a few pointers tough...\n\nThus, this is a bet, not a wise investment.\n\n![gif](emote|free_emotes_pack|dizzy_face)", "score": 1, "replies": []}, {"body": "They keep destroying their share price because diluting shares is the only way they can raise cash.\n\nProfitablity isn't on the horizon and they're running out of money.\n\nHonestly I think they go under or get bought out in the next couple of years.", "score": 1, "replies": []}, {"body": "I don’t think super charging is the future. I think swappable module batteries are.I know rivian is planning to modularize everything including the batteries. Modular batteries may be something you can charge when your not at home or pick up from a gas station or Walmart. You replace them in your car and your charged instantly like getting gas,.. but they’re also at your home so you don’t need to stop anywhere", "score": 1, "replies": [{"body": "I don't see it other than limited applications.   Delivery vans and other fleet vehicles maybe, but not regular cars.   \n\n\n1- 6oKW the battery on a Chevy Bolt weighs 400 lb.    \n\n\n2-   batteries are the most expensive component.  People will not trade a known good battery for an unknown so it would need to be some sort of subscription/lease service.   \n\n\n3- most people will be perfectly happy most of the time charging at home and putting up with longer charge times on road trips.   For most people it's not an issue.  Ask EV owners who travel- there are many ways to mitigate long charge time- only get the miles you need to finish the trip- align your charge with a nice restaurant.    \n\n\n4 once we get to a reliable 400 miles range the need for charging on the road will plummet (that may be the biggest problem for CHPT)", "score": 1, "replies": []}]}, {"body": "I also recently took a sizable loss on CHPT. I was very bullish on them 2 years ago", "score": 1, "replies": []}]}
