{"title": "Thoughts on Best Buy being undervalued?", "selftext": "I’m not that smart and not a fundamentals guy, but I’m tempted to grab some weekly calls Monday on BBY. From amazon to target to home depot, it seems that retail is pretty strong this quarter and has beaten earnings estimates across the board. Bestbuy has gone down a lot and in the previous quarters they’ve almost always been pretty strong with earnings beats. The price of the contracts aren’t that expensive either. Any reason this might be a bad idea? Someone who’s smarter than me should do some real DD on this and report back lol", "id": "17z37no", "created_utc": 1700417841.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 94, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "If you think a company is fundamentally undervalued and the market has it mispriced, buying weekly calls is not a great way to let the thesis play out.", "score": 141, "replies": [{"body": "Yeah just buying and holding stock would be better.", "score": 40, "replies": []}]}, {"body": "Purchasing weeklies on Best Buy is nothing more than gambling.", "score": 75, "replies": [{"body": "That's what the stock market is gambling", "score": -29, "replies": [{"body": "English, what are you saying?", "score": 8, "replies": [{"body": "Did I stutter?", "score": -14, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "OK and? Got a problem with that? Seems you do for no reason other to have something to complain about ans boost your ego", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well people who wanna correct someone's spelling rather then the substance is a low IQ individual and has no ability to communicate to originally reply. How about you try again later when your account isn't going to negatives", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Its called Grammer and spelling is part of it and thanks for the replies haha", "score": 0, "replies": []}]}]}]}]}]}, {"body": "You didn’t use what correctly. Idk what to tell you.", "score": 7, "replies": [{"body": "Like I said did I stutter? You know what I said/mean", "score": -15, "replies": [{"body": "You did the text version of stuttering, yes.", "score": 8, "replies": [{"body": "Lowest hanging fruit huh", "score": -2, "replies": []}]}, {"body": "I actually don’t", "score": 2, "replies": [{"body": "Sure you don't lol", "score": 0, "replies": [{"body": "Get downvoted!", "score": 1, "replies": [{"body": "Oh no how would I survive without reddit likes?", "score": 0, "replies": [{"body": "Get downvoted!", "score": 1, "replies": [{"body": "Damn should turn your addiction to me towards nit being negative in your investments", "score": 0, "replies": [{"body": "Get downvoted!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Circuit city and radio shack were undervalued too", "score": 41, "replies": [{"body": "I agree, it’s very hard to see a moat with Best Buy. It’s only a matter of time before customers slowly leave and go to Amazon.\n\nHowever I will say that some people like to go to Best Buy because they don’t know much about the products. Like my dad needed a better lock system for my grandma and we went to Best Buy and looked at products and bought a electronic lock that day. \n\nPoint I guess I’m making is that the value in Best Buy is probably the in store showings. I will also say that the senior section and geek squad are growth drivers. Other than that I think Best Buy will stagnate or decrease in sales in 10-20 years.", "score": 6, "replies": [{"body": "Amazon sells fake airpods and product. I think best buy should be good", "score": 7, "replies": []}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "Have you been in one lately? They are morphing into glorified warehouses. Large areas filled with rows and rows of boxed TVs. Many of the products now behind lock and key, requiring you to go to a checkout to retrieve it. I just went to one for the first time in a while and I almost just ordered what I came for on Amazon and left.", "score": 3, "replies": [{"body": "Not an employee in sight to help but you can check in and wait hours for assistance.   Best buy is sears in the 90s...circling the drain and they know it.", "score": 5, "replies": []}, {"body": "I haven’t but I’ll probably come in and make some rounds for Black Friday and another time in December. I don’t go besides November/December time period.\n\nLong term once again I would see sales decreasing, but if they can translate into a healthcare for elderly company they might have a chance.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I do still make larger electronic purchases from them. I have the TotalTech Membership, or whatever it’s called now, that gives me a warranty on anything I buy from them. That plus their 24 months no interest credit card, and next/same day delivery keeps me shopping there for the high ticket stuff.", "score": 3, "replies": []}, {"body": "This is literally the exact reason why they price match", "score": 2, "replies": []}]}]}]}, {"body": "⬆️ This", "score": 2, "replies": []}, {"body": "I miss radio shack more than I will miss best buy.", "score": 1, "replies": [{"body": "As a kid I would peruse the aisles and  imagine all the cool technological gadgets I could make with those parts and some knowledge.", "score": 1, "replies": []}]}]}, {"body": "Check out the r/bestbuy Reddit to see why.  Interesting reading from both employees and customers. The end is closer than the beginning.", "score": 21, "replies": [{"body": "We used to have Best Buy stores every few miles here. The last one I’m aware of just closed last month. My 14 year old asked me right before they closed how they exist. If you want a tv, there are plenty of places for that. Video games? Appliance? Why were people going to Best Buy after physical media died?", "score": 7, "replies": [{"body": "The only reason to shop there are surprisingly good prices on appliances...refigerators, etc.", "score": 3, "replies": []}, {"body": "Went to look for a power supply at a local best buy before it shut down. All they had for pc parts were keyboards, headsets, and then maybe one mouse. The rest of the store was Apple products, tvs and sound systems. I have no idea why anyone would shop there when every other retailer carries the same stuff and most likely has lower prices.", "score": 0, "replies": []}]}, {"body": "Probably the worst company to buy products from. I have sworn to never shop at Best Buy again and have to say it might be one of my better decisions", "score": 0, "replies": []}]}, {"body": "I just picked up 4 TVs from there. I use Amazon for everything, but when it comes to electronics I want to pick up in person.", "score": 25, "replies": [{"body": "I think they account for 18% of online electronic sales as well", "score": 8, "replies": []}, {"body": "4 Tvs?! You are single handedly keeping them afloat", "score": 8, "replies": [{"body": "He's teasing you. Nobody has two television sets.", "score": 4, "replies": []}]}, {"body": "This speaks to their value to the consumer.  I don’t want to have to deal with returning TVs and major appliances to Amazon or any online retailer.", "score": 3, "replies": []}]}, {"body": "If you think it's undervalued at x price, then use a limit order. Why extra expense of buying an option?", "score": 6, "replies": [{"body": "Maybe sell a put", "score": 1, "replies": [{"body": "Why would anyone do that?", "score": 1, "replies": [{"body": "Same as limit order but get paid to wait.", "score": 5, "replies": []}]}]}]}, {"body": "The term CNBC said was BBY is getting amazoned. Don’t disagree since most of their inventory you do not require to touch before you buy.", "score": 3, "replies": []}, {"body": "Just DCA a little bit of $ into shares every month/week off you believe in it.", "score": 2, "replies": []}, {"body": "It’s a strong cell", "score": 2, "replies": []}, {"body": "I love Best Buy, I bought a few shares before earnings. Them and Nivda", "score": 2, "replies": [{"body": "that nvidia worked out didn't it?", "score": 2, "replies": []}]}, {"body": "BBY\n\nEPS:5.81P/E Ratio:11.73x\n\nA buy. But not a strong buy.", "score": 4, "replies": [{"body": "Probably not the best buy", "score": 12, "replies": [{"body": "Lmaoo", "score": 2, "replies": []}]}, {"body": "EPS isn’t the best metric to look at a company. Doesn’t paint a picture. I guess it says it’s cheap.", "score": 2, "replies": []}]}, {"body": "I can tell you've never been inside a Best Buy lately. It's devoid of customers, product shelves are bare, and at the end of the day, they're nothing but a glorified showcase of items that I'll then buy online.", "score": -1, "replies": [{"body": "I've been in mine a few times this year. They are usually pretty busy and the shelves have never been empty.", "score": 13, "replies": []}, {"body": "That's just your location. It's booming where I live", "score": 2, "replies": []}, {"body": "Couldnt you make that same case for macys or gap? Not saying it’s a company that will see growth over the next few years, and that’s why the stock has already fallen so much to near march covid levels.", "score": 4, "replies": [{"body": "Could you? Possibly.\n\nLet's just be real, unless you have a niche product that cannot be obtained elsewhere, retail is a dying beast.\n\nI was a BBY manager many years ago and what I used to gauge the monthly success of the store were two departments; Appliances and its sales volume (the department with the highest profitability) and Mobile Phones (the highest foot traffic). If both of those were healthy, my other departments tended to benefit from it. This past year, whenever I've been in a BBY, those two departments have been pretty baren and I've been in at various days/times of the week. That alone would be concerning for me.", "score": 0, "replies": [{"body": "My point is that everybody knows retail is dying and thats why all their stocks have fallen so much in the past years. See macy and gap that went up substantially last week after an earning’s report that wasn’t even extremely good. These stocks just need a tiny bit of good news for it to go up because expectations are already so low. I’m not making a long term play to hold the stock but instead betting on a short term earnings beat. Like the other commenter said it’s glorified gambling but I feel like the odds aren’t so bad…. I was hoping for someone who has done thorough analysis of BBY to point out anything in its balance sheet or valuation that suggests it cna still go lower though", "score": 4, "replies": []}]}]}]}, {"body": "You're right, you're not that smart.", "score": 0, "replies": []}, {"body": "My stonk Guy said “Best Buy is trash” and hung up the phone. He was at his daughter’s birthday party, but probably not good.", "score": 0, "replies": []}, {"body": "Best Buy seems like it would have a tough time surviving too much longer, do people buy things there? I’m surprised to see someone bring them up as a viable investment option", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That’s true, I would be hi fi equipment online because it’s much better quality but an appliance or a TV I would buy at a big box store. I have actually bought appliances from sears, I think I get somethings from Lowe’s too, and I’m embarrassed to say both of my TVs are from Walmart. \n\nThe last item I bought from Best Buy was my Apple Watch because I wanted to see it, that was about a year ago and then 4 years earlier I had them install a car stereo (that wasn’t that great an experience).", "score": 1, "replies": []}]}]}, {"body": "As a former BB employee, I would not recommend BB stock. if you want to look for consumer discretionary stocks check out CMG, TJX, TXRH, DECK, DKS, TSCO, POOL, LULU, ULTA.", "score": 0, "replies": []}, {"body": "Sell the news.", "score": 0, "replies": []}, {"body": "Here’s my thoughts but full disclosure, I own many common shares of NEGG & this not financial advice.\n\nIf you think Best Buy BBY is undervalued, you must think NewEgg NEGG is having a buy 1 get 3 free fire sale.\n\nI think BBY is way OVERVALUED. I don’t own it, if I did, I’d probably sell, regardless of what my cost average was. I think it’s doom is closer than it’s Boom. And I think NewEgg is undervalued still with room to boom.\n\nBut what do I know, I’m no pro and this ain’t financial advice. \n\nGood luck all.", "score": 0, "replies": [{"body": "Why do you think BBY is overvalued? If we go off surface level numbers the PE ratio is pretty low", "score": 1, "replies": []}]}, {"body": "Haven't been in one in 7 years.", "score": 0, "replies": []}, {"body": "Ban", "score": 0, "replies": []}, {"body": "The last few times I’ve gone to my local Best Buy it looked like it was in the middle of a fire sale. They had fuck all for inventory aside from TVs", "score": 0, "replies": []}, {"body": "The cash sitting on the sideline is still near all time high.  Everyday, there are people trying to figure out which stock is undervalued, 6 months from now.  \n\nA stock being undervalued at the current moment is highly unlikely.  The experts always look foward.", "score": 0, "replies": [{"body": "I dont get it. If there is a lot of cash sitting on the sidelines yet bestbuy is starting to move upwards slowly after dipping so low, then isn’t that a good sign? Why is it unlikely any stock right now is undervalued. I feel like if there weren’t so much cash on the sidelines then it’s possible shareholders havent sold enough of their shares and theres lower to go", "score": 1, "replies": [{"body": "Interest rates are high...housing is in the shitter.  Businesses struggling to refi loans.  Mortgages almost double the rate... I just don't see a bunch of people grabbing TVs and blowing money on other stuff.  Best buy tends to do well when discretionary spending is up not down.", "score": 2, "replies": [{"body": "isnt it possible all that is priced in? The stuff youre saying isnt news to the market. Best buy just needs a little dose of not so bad news and it could go up. Couldnt you make the case for all of this about any business out there? Yet home depot, amazon, macy beat earnings and stocks went up. Even walmart had good numbers it just tanked on lowered guidance", "score": 1, "replies": [{"body": "Whenever people report beating earnings stock goes up.  It's not like it's going up 20-30% at least in this sector.  \n\nBest buy is a broker of electronics.  Something we can get anywhere now.the other part is our local store is a dumpster fire and hasn't had displays setup for black Friday yet even...it's been this way since summer.  \n\nFrankly the last TV I bought there they forgot to confirm there deliver code...loaded my suv and has been freely sitting on my wall for a few years now.\n\nBest buy might beat earnings but they aren't going to move the needle.  Again they are sears in the 90s in a bad situation.  They need a physical product worth buying in person to be saved or prolonged.  Right now everyone just Amazon's or walmarts it..or target.  \n\nWhy go to best buy?  So the employee with no training can bullshit you?  I can at least get groceries at Walmart.", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s like a big radio shack.", "score": 0, "replies": []}, {"body": "BEST BUY IS STILL AROUND?!?! I barely see any in my state", "score": 0, "replies": []}, {"body": "Have you walked into a Best Buy lately?", "score": -2, "replies": []}, {"body": "A recession is slow rolling into society. Why is inflation down? Because spending is down. Sowing directly affects high end consumer goods.\n\nIf anything it’s time to buy Walmart and Costco, stay away from Apple and Target.", "score": -2, "replies": []}, {"body": "I was loyal customer for decades but don’t shop anymore without the Best Buy rewards. Maybe good for them though, not sure.", "score": 1, "replies": []}, {"body": "Hard pass", "score": 1, "replies": []}, {"body": "I own some but it’s not a large position.  I like the risk vs reward here.  I do order most of my electronics there because I refuse to use AMZN unless I’m forced.\n\nAt the same time, I recently had a bad experience. I went in to pick up my item I ordered online.  Waited over 20 mins for a Geek tech guy to finally appear and take another 10 mins to retrieve my order from the mobile dept.  This was despite three people standing in customer service doing nothing but pointing at a cash register.\nSo, it seems there is no point checking in when you get there. Very Disappointed with the service.", "score": 1, "replies": []}, {"body": "Hope you bought some calls and not listened to these comments. If so.. I’m sure your enjoying your gains right now. I made a solid 170% return", "score": 1, "replies": []}]}
