{"title": "[SERIOUS] With TSLA, GILD, FB, AAPL earnings all coming up, can we make an EARNINGS megathread?", "selftext": "I used to be a Mod here, someone kicked me off. I started the \"What are you doing today/tomorrow\" threads and that got me promoted, and someone shot me down lmao. \n\nWhat do you guys think?\n\n\n*edit: thanks for restoring my mod power*\n\n\n#***Alright I'm gonna step it up, made a table for y'all since the supreme mod stickied this thing***\n\nTicker | Earnings Date\n---------|----------\nAAPL | July 21\nGPRO | July 21\nMSFT | July 21\nV | July 23\nAMZN | July 23\nMCD | July 23\nGILD | July 28\nFB | July 29\nTSLA | Aug 5\n\n*edit: added a few tickers, changed a wrong date*\n\n", "id": "3dmm5j", "created_utc": 1437143405.0, "score": 46, "upvote_ratio": 0.93, "num_comments": 68, "comments": [{"body": "Also AMZN on 7/23", "score": 13, "replies": [{"body": "I forgot, sorry about that", "score": 3, "replies": []}, {"body": "SWKS and UA as well. ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Newb question: Just started learning about options. \nThe strike price is 60, do you need stock price to surpass 60 to make money. I just assumed options were sold with a strike price the same as current market value? ", "score": 4, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Would that be a sell to close...? To sell the option contracts", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Thank you sir :)", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sell the option on the market before expiration, if its an american style option.In spendthatmoney's example, you would sell the call for 4.72.", "score": 1, "replies": []}]}]}, {"body": "Assuming you're holding till expiration, yes. \n\nMost people here sell options instead of exercising. ", "score": 2, "replies": []}, {"body": "You need the stock price to go strike + premium paid to break even", "score": 2, "replies": []}, {"body": "Yes, but only if you purchase a call option. ", "score": 1, "replies": []}, {"body": "Depending on reasons, you do NOT need the strike to hit to make money on long calls. I'm still out of the money on MSFT $47 September and I'm up 36%", "score": 1, "replies": []}]}, {"body": "I have 5 calls at 59 for the 24th. They are up 20% today so far. I bought them this morning.", "score": 1, "replies": []}, {"body": "I'm in on AMBA $119 calls. I will ride the coattails of GPRO.", "score": 1, "replies": []}, {"body": "Yup.\n\nSnagged 3 August $60 calls. May buy a JUL5 $58 or get extra risky with a hefty helping of $62-63 weeklies", "score": 0, "replies": []}]}, {"body": "Why the hell is the sticky formatting so hideous?\n\nAlso the top banners, rainbow dick flairs, etc. aren't really the best for browsing at the office", "score": 18, "replies": [{"body": "Yeah, but it's fine for use in dimly lit basements. ", "score": 5, "replies": []}, {"body": "I wish we could be office safe....", "score": 8, "replies": [{"body": "You could just turn subreddit style off", "score": 10, "replies": [{"body": "Teach me how...", "score": 3, "replies": [{"body": "Click on the button that says /r/investing ", "score": 14, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Can this be a real thing?", "score": 1, "replies": []}]}]}, {"body": "On the topof the sidebar you will have \"Show subreddit theme checked\". Uncheck it", "score": 3, "replies": []}, {"body": "If you're using RES on chrome, click the CSS button inside the address bar on the right. \n\nThis also works when subs like SRS hide the \"Use subreddit style\" button. ", "score": 1, "replies": []}]}]}]}, {"body": "so don't use the subreddit style. fag", "score": 3, "replies": []}, {"body": "I know someone redesign this damn place. I don't want to look at rainbow dicks everyday. Put some hot chick in a bikini on the front page like Miley Cyrus. ", "score": 0, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "DON'T YOU DARE ", "score": 2, "replies": []}]}, {"body": ">some hot chick in a bikini\n\n> Miley Cyrus\n\nDoh ho ho ho ho ho", "score": 5, "replies": []}]}, {"body": "nice meme name and bitching about petty shit combo comment!", "score": -1, "replies": []}]}, {"body": "earnings etf", "score": 3, "replies": [{"body": "does that actually exist?", "score": 0, "replies": []}]}, {"body": "So...how to play gild, aapl and tsla in this case?", "score": 3, "replies": []}, {"body": "TWTR announces on the 28th, as well.", "score": 3, "replies": []}, {"body": "Why does this sub has 88 Mods?\n", "score": 6, "replies": [{"body": "BECAUSE YOU TOUCH YOURSELF AT NIGHT. DON'T ASK QUESTIONS.", "score": 22, "replies": [{"body": "Can this be the theme song: https://youtu.be/ub59tAEwEYc?t=14s", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Aww :( ", "score": 1, "replies": []}]}]}]}, {"body": "Don't ask questions.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "IVE GOT SOME $$$ IN BABA. LEGOOO BABAAAA", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "thanks bro", "score": 3, "replies": []}]}, {"body": "Great idea on the megathread. I think FB earnings may be 7/29 though: http://investor.fb.com/results.cfm. I bought some 7/31 calls at a $98 strike. \n\n", "score": 2, "replies": [{"body": "thanks for the heads up. I'll change it now", "score": 1, "replies": []}]}, {"body": "No IBM?   ", "score": 2, "replies": []}, {"body": "I'm going to pick up $2k worth of August 21st Microsoft 48.0 calls on Monday. I'm not an all-or-nothing investor. August 21st is far enough away that if earnings are good, I can walk away with a 1-bagger or better. If earnings are neutral, I keep my money/maybe make a little bit. If earnings are bad, I walk away with half my money. Good risk/reward. ", "score": 3, "replies": [{"body": "why do you think you will have anything left if earnings are bad? 48 is OTM currently\n\nif earnings are neutral you lose to decay too", "score": 2, "replies": [{"body": "Their earnings are not expected to be stellar. PC software sales will be subpar, and windows phone is going to remain dismal. What we're interested in seeing is surface pro sales growth and cloud sales. They would have to be really bad for Microsoft to take a hit (I believe)\n\nBut, if they are just neutral, I think that I can walk away with at worst, half of my money.\n\nIf Pro/Cloud sales are good, or any of the report that is expected to be negative is good, then it's jackpot time.", "score": -2, "replies": [{"body": "> if they are just neutral, I think that I can walk away with at worst, half of my money.\n\nthis contradicts your op but is possible, idk which one you really mean though\n\npositive earnings doesnt always result in jackpot for naked calls, reactions can fail to be positive enough, or the sharp decline in IV can eat up the increase in intrinsic value.\n\nbasically you get what you paid for, most option traders know what they are doing and wont give you a \"good risk/reward\" deal (if it exists some trader/machine will likely correct it before you even submit your order)", "score": 2, "replies": [{"body": "| this contradicts your op\n\nEw. It really sounds that way. I typed this up when I was groggy as fuck. My bad. Let me explain better.\n\nSo, an overall zero-sum earnings for microsoft would be an earnings report that's in line with expectations. This would include shitty PC software/windows phone sales, but decent surface pro/cloud sales. (Analysts do expect we'll see those things)\n\nIf Microsoft's earnings meet those criteria, I don't feel that I'll lose money.\n\nHowever, specifically on the surface pro/cloud sales... Analysts expect them to be good. So those sales would have to be really bad for microsoft to take a hit that will wipe me out completely. But, if they are just OK or 'neutral' (terrible fucking word. I shouldn't have used it.) then I think microsoft will decline, but I can walk out with half of my money. If they are good like they should be... Then I don't think microsoft will move much. After all, people expect the pro/cloud sales to be good. Finally, if Pro/Cloud sales are fucking awesome, or if any of the report that is expected to be negative is good, then I expect microsoft to rise.\n\nHopefully, that explains my thinking a little bit better. :)\n\nEdit: There is one other thing I want to address.\n\n| basically you get what you paid for, most option traders know what they are doing and wont give you a \"good risk/reward\" deal (if it exists some trader/machine will likely correct it before you even submit your order)\n\nI disagree! There are definite bargains if you look hard enough/have good timing. I bought calls this morning at the bell for .55 cents when the stock fell by .22-.3%. The stock rose by a little bit eventually, but went back down and continued to hover between .0-.3% for awhile before making its eventual run to +.64% for the day. The calls never even came close to touching a buy price of .55 again despite the stock going down to the same place that I bought it!\n\nThere is a reason experienced options traders stare at their spreadsheets for hours. They want to find the best deal! Any options trader can definitely do that, no matter what the experience! :)", "score": 1, "replies": [{"body": "im not disputing anything on the fundamental side, i didnt do the hw, dont have time to do it and simply dont have any unhedged stakes to care\n\ntiming can get you good deals but they are not good deals as in almost arbitrage-like. at that point of the time you buy the option at the appropriate price given the underlying price. it is a fair deal as no one knows where its going. for example, you couldve bought it at 0.55 only to watch MSFT sink another 1% before earnings. \n\nBUT 0.55 is pretty attractive as an earning bet\n\n\n\n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "hmmm actually sounds good, you got me thinking about it too, first time doing options! prolly gonna get this and gopro tomorrow. maybe fitbit as well", "score": 1, "replies": []}, {"body": "I've been hearing good things about Surface Pro tablet / laptop things... also Windows 10 is looking much better than 8. It's a neat little trick MSFT is doing to offer free upgrades to win 10 for a year then require people to purchase it as well.", "score": 1, "replies": []}]}, {"body": "Also $V 7/23", "score": 1, "replies": []}, {"body": "Long AAPL (since 100) and Tesla (since 200 the first time) calls. ", "score": 1, "replies": []}, {"body": "In tesla up 17% happily awaiting earnings", "score": 1, "replies": []}, {"body": "AAPL earnings is 7/21 not 7/28", "score": 1, "replies": [{"body": "ah my apologies. thanks. i actually scared myself seeing that just now.", "score": 2, "replies": []}]}, {"body": "BIDU\n\nEdit: 7/27 AMC", "score": 1, "replies": []}, {"body": "TSLA earnings report is  \tEarnings\tAug 05 AMC not July 30. lol...", "score": 1, "replies": [{"body": "my bad, just fixed it.", "score": 1, "replies": []}]}, {"body": "Also SCTY .. I bought at 51.8", "score": 1, "replies": []}, {"body": "What price should I get out of GILD, or should I hold it long? Just trying to make some gains on it. Already up 12% since I bought it. ", "score": 1, "replies": [{"body": "I got in at 123 recently. I'm really good at calling highs...", "score": 8, "replies": [{"body": "I thought about selling at that level.. wish I would have on the recent down turn so that I could buy more for cheaper... ", "score": 1, "replies": []}]}]}, {"body": "Snagged one TSLA Aug $305 call today for $2.95...a little early but I'm feeling a run to all-time highs before ER. Stupidly sold my JUL5 275 strike today, but wanted to lock in those 50% gainz to dump in high-risk OTM.\n\nWill definitely grab more closer to ER so time doesn't murder me.\n\n", "score": 1, "replies": []}, {"body": "so sell appl now bought 100 at 120 a week ago m i greedy?", "score": 0, "replies": []}, {"body": "Um.... yeah those what are you doing today threads... yeah those were kinda mine...", "score": -3, "replies": [{"body": "Don't be greedy bud.", "score": 2, "replies": []}]}]}
