{"title": "Selling calls against WAYYYY OTM Leaps, worst case scenario?", "selftext": "Ok let me be specific because I want to understand the specific numbers.\n\nSuppose I buy one AMZN Call at the strike price of $5,100 for Jan 2023\n\nThis AMZN call (currently) costs **$15,875** ($158.75\\*100).\n\nNow suppose I use this leap as collateral to **SELL weekly calls**.\n\nSuppose I sell a AMZN call for next week - Jan 22 at $3,150 strike price.\n\nOn this call, I would (currently) get a fat premium of **$2,533** (25.33\\*100).\n\nAnd I could (hypothetically) sell weekly calls which get me a $2,000+ a week, on a leap which I paid less than $16,000 for...\n\nNow what is the worst case scenario here exactly?\n\nWhat happens if one of the weekly calls I sell expires ITM?\n\nThat would mean the call holder has the right to buy 100 shares of AMZN at $3,150, but I used a leap as collateral so obviously I wouldn't have 100 shares to sell them, and my LEAP is worth no where near 100 AMZN shares \\~$315,500 ($3,150\\*100).\n\nSo what would happen exactly?\n\nI googled to research this but I keep getting conflicting answers from different people.", "id": "kynyq7", "created_utc": 1610820640.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 39, "comments": [{"body": "I think technically what you are doing is making a very large diagonal spread. However usually the strikes would be reversed. I do not think you would be able to do this because your strike price is higher than the price you are selling the calls for. It would require a very large collateral.\n\nTechnically what you would do I think is buy a DEEP ITM call that expires in the future. You would then sell weekly calls OTM against it. Worst case scenario your sold call ends up ITM and you exercise your long call against it. With your current scenario I do not believe you could do anything and your broker probably would not allow it unless you have large amounts of capital.\n\nI think, dont take my word on it though.", "score": 5, "replies": [{"body": "Robinhood seems to allow this, I tested it a few days ago. I bought a OTM $60 ARKF leap and sold a weekly call on it at the strike price of $54\\~ Everything went through fine, I barely had any buying power otherwise. \n\nBut people don't seem to agree on the specifics of what happens in the worst case scenario.\n\nUsing my AMZN example above, what losses do I incur if AMZN hit $3,200 on Jan 22, causing my weekly call to expire ITM?", "score": 1, "replies": [{"body": "I think what yoy are doing are 2 separate plays. Normally you would buy a closer strike with alonger dated contract and sell a further strike with a closer expiration. Thats a long diagonal call spread. What you are doing is leaving yourself a lot of risk and not sure why RH is letting you do this. Your longer date expiration has nothing to do with the closer expiration short. This is just like you selling a call against Amazon with no collateral according to to what I've learned.", "score": 1, "replies": [{"body": "Yeah basically, the reason for the far OTM leap is that it's way cheaper to buy them. Essentially I'd be emulating owning 100 AMZN shares for just $16,000.\n\nIf the other comments in here are correct, the risk doesn't seem that high as long as I can buy out my short weekly calls if they look like their going to expire above the strike price.", "score": 1, "replies": [{"body": "Yeah obviously no extra risk selling before its ITM but like i said your far out long call is not collateral in any way. Essentially you you're just selling a naked call in my opinion.  But I could be wrong.", "score": 2, "replies": [{"body": ">Essentially you you're just selling a naked call in my opinion.  But I could be wrong.\n\nI think this may be all it is, it's just surprising that it's even possible. May experiment with it on a paper trading account.", "score": 1, "replies": [{"body": "It’s commonly referred to as a poor mans covered call and is a hedging tactic", "score": 1, "replies": []}, {"body": "I think you are getting lost in the details. You have to remember that purchasing a call is the ability to buy that stock at that price if the stock price is equal or greater than at time of expiry. So like everybody said the farther out of the money call provides no risk management for the weekly call your selling. The only way it could even potentially save you is if the price went all the way up your purchases call and even then you would lose major money. If you find a high IV option you can do a poor man spread and recoup your leap in a few months and then profit by selling weeklys.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "**First**, If you own the $5100 call, and sell a $3150 call, you will need to post the difference between the strikes as collateral **($1950 per share i.e. $195,000 total)** on top of your debit paid.\n\n**So your trade will require a buying power of $210,875** minus any credits you receive.\n\n&#x200B;\n\n**Then let's discuss your scenario:**\n\nYou sell the $3150 call, a few days later, AMZN is trading at $3250, and your call is underwater. To buy your call back, since it's $100 ITM, you will be at a massive loss of close to $100 per share ($10,000 total).\n\nIf you get assigned, you will sell short 100 shares of AMZN, in exchange of $3150 per share in cash ($315,000 total cash). \n\n**You will have to cover this short position:**\n\nYou would use the cash from the assignment plus $10,000 of the collateral (for a total of $315,000 + $10,000 = $325,000) to buy 100 shares from the market (at $3250) to cover your short shares position and keep your OTM LEAPS to either sell or keep selling short term calls against. You lost around $10,000.\n\n**Notice that your long LEAPS didn't help you at all. So when does it become useful?** Well, if AMZN is trading at $6150! You get assigned on your short call 100 shares short of AMZN in exchange for $315,000 in cash. Now, to cover your assignment you can do one of two things:\n\n1. Same as the above case, use the $315,000 form assignment PLUS $300,000 (your collateral plus $105,000 from your own cash) more to buy  shares from the market at $6150. Then sell your LEAPS, this should be worth more than $105,000 so you keep the extrinsic value on your LEAPS.\n2. Use the cash from assignment plus all the collateral to exercise your long LEAP to buy shares at $5100 to cover the assignment.\n\n&#x200B;\n\n**As you can see, there are two main takeaways here:**\n\n1. you're not making $2000 a week on a $15,875, but rather on $210,587.\n2. You own two options. **Two independent options**. Your LEAPS is recognized as part of the collateral ONLY for margin requirement calculations. To figure out what's gonna happen in a specific scenario, you need to treat each contract separately. \n3. This is not discussed above, but your broker can take extreme measures if you put your account at risk. For example, they can force you to exercise your OTM LEAPS if your excess margin dips severely in the negative. Most brokers won't do that, but there is no guarantee what the risk management team will come up with to protect their own money when you mess up, or get in a large margin call.", "score": 4, "replies": [{"body": ">First, If you own the $5100 call, and sell a $3150 call, you will need to post the difference between the strikes as collateral ($1950 per share i.e. $195,000 total) on top of your debit paid.  \n>  \n>So your trade will require a buying power of $210,875 minus any credits you receive.\n\nSo we're disagreeing on the premise here.\n\nWhat you wrote here sounds like it should be the case, but it doesn't seem to be.\n\nI did a test a few days ago, I bought a OTM $60 ARKF leap and sold a monthly call on it at the strike price of $54\\~ Everything went through fine, I barely had any buying power otherwise. So I WOULD able to sell calls on AMZN with just a single OTM leap which costs $16,000. At least on Robinhood.\n\nEDIT: Seeing very different answers to this question. Some people saying that it's not even possible to sell a short call on OTM leap, but I'm 99.99% sure it's possible as I did it on Robinhood. May test it once more on a cheap stock by buying OTM leap and selling a short call on it. \n\nBeyond that, there's a lot of disagreements on the maximum possible downside if one of my weekly calls potential goes above the strike. Seeing if I can make a paper trading account to test this, can't seem to find a undisputed answer anywhere.", "score": -4, "replies": [{"body": "There is nothing to disagree about. This is not an opinion. This is how collateral works. \nIn your trade, you had to post $600 minus the credit you received. You just didn’t notice that. \n\nGo ahead and place that order and post a screenshot of the order placed. RH will give you an error that you don’t have enough buying power (despite having more than $17K in options buying power). \n\nEven if RH allows that. You shouldn’t do it. Your max loss is over $200,000. You’re practically shorting AMZN naked. All the way up to $5100.", "score": 3, "replies": [{"body": ">There is nothing to disagree about. This is not an opinion. This is how collateral works. In your trade, you had to post $600 minus the credit you received. You just didn’t notice that.\n\nOf course there's a fact of the matter. I did do it though on ARKF, and I had like $40 in buying power left after I bought a ARKF OTM leap at $60 strike, then I sold a monthly ARKF call at $54 strike\\~ successfully, got a $160 premium for doing so.\n\nI can test it again when the market opens.\n\n>Even if RH allows that. You shouldn’t do it. Your max loss is over $200,000. You’re practically shorting AMZN naked. All the way up to $5100\n\nI don't know if you're wrong or right on that as people are giving me different answers here. If I sell the hypothetical weekly short at  $3,150 strike, I collect $2,500 in premium. If AMZN spikes to 3,200 near expiration, I would simply have to buy the short call out before expiration, and it would cost about $5,000 more than what I sold it for ($50x100). It would be a big loss but not a 200k loss, at least according to everyone else in the comments.", "score": 1, "replies": [{"body": "How about if AMZN spikes to $5100? Or if it blows through that? That IS your max loss.", "score": 2, "replies": [{"body": "If we're operating on realistic assumptions we can conclude that AMZN will not spike up $2,000 within a week, the biggest spikes will be a few $300/week or so.\n\nIf that were to happen my $5100 LEAP would also spike in value, I'd have to do the math on that one.", "score": -1, "replies": [{"body": "There is no “realistic assumptions” when it comes to max loss. Max loss is a theoretical value. \n\nAlso you don’t need to do the math on anything. Theoretical worst case is If AMZN flies to infinity,  this means all extrinsic value on both options are near zero. And the difference between the calls prices will be the difference in intrinsic value which is $5100 -$3150 per share = $195,000 total. You lose that plus your debit. \n\nYou can use optionsprofitcalculator.com to see that yourself. You have to increase the range of the prices to be really high. \n\nThis is a defined risk trade, so unless you have portfolio margin (which you don’t because RH doesn’t have PM) then you need to post your max loss as your buying power reduction.", "score": 3, "replies": [{"body": ">There is no “realistic assumptions” when it comes to max loss. Max loss is a theoretical value.\n\nOf course there's realistic assumptions. I also assume the US isn't going to be nuked into oblivion tomorrow, otherwise I would withdraw all my money and catch the first flight out of here.\n\n>Theoretical worst case is If AMZN flies to infinity\n\nTheoretically a stock can not be worth infinity. Come on man, you're being pedantic.\n\nI just see a (probably bad) way to make money and I'm considering all the realistic downsides. Probably not going to even try it but there seems to be a lot of conflicting answers on the downsides.", "score": -1, "replies": [{"body": "I’m not talking about worst case scenario or your “typical large loss” I’m talking how the CBOE calculates buying power reduction and margin requirements for defined risk trades. The absolute worst case scenario is taken into consideration. \n\nIf you open a $1950 point wide vertical credit spread, you will have to put $195,000 of collateral. Same thing with a $1950 wide long diagonal.", "score": 1, "replies": [{"body": ">If you open a $1950 point wide vertical credit spread, you will have to put $195,000 of collateral. Same thing with a $1950 wide long diagonal.\n\nSo this is either true or not, I have no problem conceding here if you're right, but it seems to not be the case, at least on Robinhood.\n\nWill test it with a cheap stock leap when market opens.", "score": -1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "> the trading platform will execute the purchase of the $5,100 strike and then sell them for $3,150\n\nIs this really the case? So the person who I BOUGHT the $5,100 AMZN leap from which expires a in 2023 will RECEIVE $510,000 ($5,1000\\*100) for his 100 AMZN shares more or less this week? \n\nOthers are saying I'd be forced to buy 100 AMZN at the current market value. Say AMZN hits $3,200 on expiration when my call was for $3,150, then I'd have to buy 100 shares at $3,200 and sell then immediately at $3,150, giving my a $5,000 loss (50\\*100).\n\nThe latter seems way more reasonable but I'm not sure which Robinhood would do **IF** I let a weekly call expire ITM.\n\nThe best option would be to buy the call out shortly before expiration if it's not going my way, and my loss on the call would essentially be every dollar it rose above the strike price x 100.", "score": 1, "replies": []}]}, {"body": "Have fun with your maintenance requirements. Wouldn’t recommend doing this with Amazon. You’ll blow up your account real quick with a margin call if you get assigned early.", "score": 2, "replies": []}, {"body": "It's a poor man's covered call.", "score": 1, "replies": [{"body": "A poor, dumb man’s covered call", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": ">But the only platform I’ve used PMCCs on is robinhood, and they wouldn’t allow me to sell a call at a strike price lower than my long call. Not sure if it’s different on other platforms.\n\nRobinhood seems to allow this, I tested it a few days ago. I bought a OTM $60 ARKF leap and sold a monthly call on it at the strike price of $54\\~ Everything went through fine, I barely had any buying power otherwise.\n\n>you’ll be forced to buy 100 shares at $5100, to sell them at $3150/share\n\nSome people have said this, others said you'd be forced to buy 100 shares at the CURRENT AMZN value, this seems more reasonable, but I'm not sure which is true.", "score": 1, "replies": []}]}, {"body": "Worst case scenario is the call breaches your short leg and you are forced to short shares at an unfavorable price, forcing you to either take max loss or whatever losses you incur.\n\nThis strategy also has the drawback of requiring you to pay for a LEAPs *and* provide collateral for the actual trade (as this looks to be a diagonal credit spread).\n\nI like where you are going; the idea of supplementing your long dated options with shorting shorted dated options. Look up any call diagonal spread and PMCC (poor man's covered call). This is debit version of your trade. You will find more information this way.\n\nYou should also look into calendar spreads and long butterflies just to have an idea of how theta works with these types of options.", "score": 0, "replies": [{"body": ">Worst case scenario is the call breaches your short leg and you are forced to short shares at an unfavorable price, forcing you to either take max loss or whatever losses you incur.\n\nThis is the general answer I get but people are giving me different answers when it comes to the details.\n\nUsing my example in this post, suppose AMZN stock hits $3,200 on Jan 22, so my short call expires ITM (The call I sold had a strike price of $3,150).\n\nWhat exact losses am I incurring here?", "score": 1, "replies": [{"body": "((Short strike - share price)*100)-premium received .\n\nSo if AMZN is at 3200, you will owe $5000 minus whatever you received in premium. You wouldn’t exercise your long call as you would take a huge max loss for no reason", "score": 1, "replies": [{"body": "So basically the cost would be every dollar it went above the strike price x100.\n\nThis still seems pretty damn reasonable, given the massive upside of getting $2,000/week in free premiums every time the call expires below the strike price, the occasional weekly call expiring above strike seems manageable.\n\nI feel like I have to be missing something here, otherwise, why would I not be doing this as long as I have extra cash to potentially buy out the occasional weekly short which didn't go my way?", "score": 1, "replies": [{"body": "You would have to try it yourself to understand the risks. If your short is at a loss right from the get go, what are you going to do? What about when it’s pinned ATM so it decays fast but still has a ton of value? \n\nI think it makes more sense to do a debit diagonal spread since you want to be long. You are taking a naturally bearish strategy and trying to go long", "score": 1, "replies": [{"body": "> If your short is at a loss right from the get go, what are you going to do? What about when it’s pinned ATM so it decays fast but still has a ton of value?\n\nWell the weekly shorts I sell will be, say $100 above the current AMZN price, getting me $2k in premiums. This money, plus some initial extra could be used to buy out any of the short calls I sell if they don't go my way.\n\nEvery short call I sell which does go my way essentially gives me an easy $2,000.\n\n> You would have to try it yourself to understand the risks \n\nActually good idea, I'm looking into making a paper trading account to test this, but I'm not sure if every platform would allow selling calls on OTM leaps as some people pointed out. Hmmm.", "score": 1, "replies": []}]}]}]}, {"body": "You’d lose about $300 if my math is right.  If amzn moves up 100 points, your 5100 call has a delta of 0.22 so you’d make 22 points on it.  Your short call would be worth 50 points but you sold it for 25, so you’d be out 25 points there.  -25+22=-3*100=-$300\n\nEdited math slightly.  Also, this is generally why you want an itm long call - so the delta is higher and you make more on that than you lose on a short call that goes itm.", "score": 1, "replies": [{"body": ">$300\n\nThis seems extremely reasonable, almost too good to be true. Given the massive upside of $2k weekly premiums I could be collecting whenever the call does go my way, the occasional weekly call going above my strike price seems manageable?\n\nAm I missing something here?\n\n>Also, this is generally why you want an itm long call - so the delta is higher and you make more on that than you lose on a short call that goes itm\n\nI agree but AMZN ITM Leaps cost $70,000+. For that price, I could buy 5 wayyy OTM leaps, which could make me $10,000 ($2,000\\*5) a week in weekly call premiums....\n\nI have to be missing something here, why would I not do this?", "score": 1, "replies": [{"body": "From your previous scenario, if amzn went up 100 points beyond that you’d lose 100-20=80*100=$8k (roughly).  There’s nothing particularly wrong with that trade, but the risk profile is not the same as a covered call if that’s what you’re going for.", "score": 1, "replies": []}]}]}]}]}, {"body": "I don’t think you can do that if your LEAP is Out of the Money or above your short legged “Sell a Call”. Your LEAP on this PMCC needs to be deep In The Money in order to Allow you to Sell a Call also to ensure it does not breach your contract if your Sold Call (or stock price) takes a hit. I read that people have tried this on Robinhood, Selling a (lower) Call against a Very High Out of Money Leap but it was not working for me the other day.", "score": 0, "replies": [{"body": "Some people say it's not possible but I tested it a few days ago. I bought a OTM $60 ARKF leap and sold a monthly call on it at the strike price of $54\\~ Everything went through fine, I barely had any buying power otherwise\n\nI don't know if Robinhood was doing something like taking my unrelated stocks I owned into account as collateral or something, but I think it would have been made clear if that were the case.", "score": 1, "replies": [{"body": "That’s more than likely what happened. RH probably counted your entire portfolio as collateral, so if the contract is assigned, then they’ll likely make you sell off part of your portfolio to meet the obligation.\n\nI see what you’re asking and am looking to do something similar, but is it possible you have it backwards? Shouldn’t the LEAP be a lower strike price than the short term call?", "score": 1, "replies": [{"body": "> but is it possible you have it backwards? Shouldn’t the LEAP be a lower strike price than the short term call?\n\nI intentionally have it backwards. What you're describing, with the LEAP being a lower strike price than the short term call, is the standard Poor Mans Covered Call (PMCC)\n\nThe main reason I was looking into going wayyy out of the money on my leap strike price is because those leaps are way cheaper. The max strike price AMZN leap is like $16,000. The AMZN leaps with a strike price deep in the money are $100,000+.\n\nWhether I buy the 100k leap or 16k leap, the premiums I get when selling weekly calls is the exact same. So I'm trying to figure out all the downsides of using the cheaper leap with a very high strike price.", "score": 1, "replies": [{"body": "I really don’t think it’s possible to do that if that is the case.\n\nI know you tested something similar with one of the ARK ETFs but those prices are way lower and likely RH used your portfolio as collateral.\n\nWhat you’re suggesting (using a higher strike Call as collateral for a short term-lower strike cc) just doesn’t make sense in any way for RH or any other brokerage firm to allow", "score": 1, "replies": []}]}]}]}]}, {"body": "I forgot to mention a Key Point on my previous post.  Based on my education in regard to this strategy, it’s advised to employ/enter this play by first buying the LEAP with low volatility or low beta. ARKF and AMZ have high volatility currently.", "score": 1, "replies": [{"body": "Yeah that'd be a good idea, if I were to do this I'd want very low volatility on the stock so I can collect the premiums on the weekly calls I sell without it spiking above the strike price. At the same time, stocks with low volatility have much smaller premiums. I'd have to do some kind of risk/reward calculation.", "score": 2, "replies": []}]}]}
{"title": "Cramer or Cathie Wood ?", "selftext": "Who do wallstreetbet like more ? And believe in more ? I keep hearing about Cramer but I like Cathie a lot more than Cramer. \n\nCathie wood was bullish Tesla before anyone else was. Now buying up palantir just like she did in the early days of Tesla. She is a visionary investors that invest in the future of tech.\n\nCramer on the other hand only bandwagon inside of the Tesla after it took off. Now he is saying he doesn’t understand what Palantir does. Maybe he’ll magically know after it get to $100 per share in a year or two.", "id": "ky9e75", "created_utc": 1610762154.0, "score": 48, "upvote_ratio": 0.86, "num_comments": 48, "comments": [{"body": "Cathie is our Ar(k)angel. Nuff’ said", "score": 51, "replies": [{"body": "And Cramer is our drunk uncle. We love them both in their own way.", "score": 37, "replies": [{"body": "Yea. My drunk uncle used to love me a little too much though.", "score": 18, "replies": [{"body": "Nephew? Is that you?", "score": 12, "replies": [{"body": "...shit.", "score": 8, "replies": []}]}]}, {"body": "😘", "score": 5, "replies": []}]}]}, {"body": "Cathie is way more successful in the modern market, I still like Cramer better though, he potentially has actual autism and he’s fucking hilarious without even trying", "score": 29, "replies": []}, {"body": "🤡or👸🏻", "score": 49, "replies": [{"body": "Cramer is basically wsb in boomer form. He's just a bandwagon'er and reports on stocks that are trending, just like here.", "score": 32, "replies": [{"body": "Yeah he’s a TV personality these days, and an incredibly entertaining one at that.  Not fair to compare him to Cathie, I’d like to see Cathie get on TV every day and make an ass out of herself to pump stocks.", "score": 9, "replies": [{"body": "Does Cathie need a blood boi? I got covid antibodies.", "score": 1, "replies": []}]}]}, {"body": "Keep me entertained, you're the star of the show...fuck you, you're a clown, you're a hoe.", "score": 2, "replies": []}]}, {"body": "It’s papa elon, mama cathie and uncle Cramer", "score": 15, "replies": [{"body": "Papa Elon, mama Suh, aunt Cathie, uncle Cramer", "score": 9, "replies": [{"body": "U right u right", "score": 6, "replies": []}, {"body": "what about our KARP boy.", "score": 1, "replies": []}]}, {"body": "It's mama wood", "score": 1, "replies": []}]}, {"body": "Is this even a question...retard. Cathie has given me more Wood with her wisdom than 🤡 Cramer.", "score": 16, "replies": []}, {"body": "Cramer because he’s unhinged and says whatever the fuck he wants, but is also a legit human who gardens on the weekends.", "score": 12, "replies": [{"body": "He's so spergy. Most entertaining personality on TV period.", "score": 5, "replies": []}, {"body": "He also told everyone to buy BABa at $319", "score": 1, "replies": [{"body": "He told me to buy BYND at $60 in 2019, that was my first YOLO. Rode it to $160 I think before it dumped and I stopped out.", "score": 2, "replies": []}]}]}, {"body": "How many of Cramer's ETFs have returned over 500%?", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Bro this sub is a literal meme, welcome to the fucking show", "score": 4, "replies": []}]}, {"body": "Most retarded question ever asked.", "score": 3, "replies": [{"body": "Thanks for the compliment", "score": 2, "replies": [{"body": "🤡 Like me", "score": 0, "replies": []}]}]}, {"body": "I don't understand Cramer when he says he doesn't understand what Palantir does. Information about Palantir has been pretty frequently exchanged in WSB and easily available on Google. Palantir literally mooned to $30 from $18 on NOVEMBER 25TH. It's nearing two months window period. It doesn't make sense for Cramer to refuse to talk about PLTR for a whole month+ when he's had so much time to research it. Dude's obviously lying about still not knowing about what PLTR does when he visits WSB so much. Bet he's scraping up as much shares as he can. PLTR  [🚀](https://emojipedia.org/rocket/)[🚀](https://emojipedia.org/rocket/)[🚀](https://emojipedia.org/rocket/)[🚀](https://emojipedia.org/rocket/)[🚀](https://emojipedia.org/rocket/)[🚀](https://emojipedia.org/rocket/)[🚀](https://emojipedia.org/rocket/)", "score": 3, "replies": []}, {"body": "You can play the Cramer hype train, but Aunt Cathie is our boo", "score": 2, "replies": []}, {"body": "I can say this... I’d rather cut Aunt Cathie’s grass than Cramers...", "score": 2, "replies": []}, {"body": "Who’s Cramer? You talking about the guy from Seinfeld?", "score": 2, "replies": []}, {"body": "I'm team Tasha Keeney 😍", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "We talking about investors not entrepreneur. Of course Musk is #1 in terms of entrepreneurship.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Jim cramer is to Cathie Woodz as a wet piece of chalk is to a perfectly fried chicken tender", "score": 1, "replies": []}, {"body": "Cathy is fortune teller and Jimmy Chill is a teacher. They’re both great.", "score": 1, "replies": []}, {"body": "Ban this fool", "score": 1, "replies": []}, {"body": "We do not follow Cramer plays we just enjoy the memes.  And he seems like a enough nice guy", "score": 1, "replies": []}, {"body": "Cathie is your Queen!! This talk is heresy!!", "score": 1, "replies": []}, {"body": "Anyone else been jerking it raw to cathies YouTube vids 🙋🏿‍♂️", "score": 1, "replies": []}, {"body": "Cathie is our GILF Queen", "score": 1, "replies": []}, {"body": "When should I drop 25k on ARKG shares!!!??? I'm thinking I should wait and see what happens next week", "score": 1, "replies": [{"body": "I’m throwing everything into anything ARK.", "score": 1, "replies": []}]}, {"body": "Found cramer’s alt account", "score": 1, "replies": []}]}
{"title": "How I paper-handed TWO 14-baggers in the past 60 days and why I wont let it happen again with VALE", "selftext": "Every now and then I come across an options contract that has the perfect combination of penny pricing, high volume, and an excellent macro situation for the underlying company.  \n  \nHere are my missed plays because I was a scared little paper-handed bitch-  \nICLN missed 13-17 bagger - https://i.imgur.com/nOSNMs7.jpg  \nAPHA missed 14 bagger - https://i.imgur.com/tXpJ0tB.jpg  \n  \n  \nNow here are the current options for VALE expiring 4/16 (with my current positions listed)- https://i.imgur.com/DpVVMYK.jpg  \n  \nThese 30 cent options have the potential to become $3++ with the macro situation going on with metals (and the TSLA partnership as a wild card cherry on top).  \n  \n  \nWhy this feels the same to me- ICLN/APHA were both an obvious play when Biden won the presidency and everyone knew these stocks would rally the closer we got to the inauguration. STEEL stocks (and KMI with it's similar oil supply/demand situation) are also an obvious play with steel prices skyrocketing and Spring being the consensus among us as to when the stocks will really start to go parabolic. In spring people will look back and say damn we saw this coming just like the weed and clean energy traders now are saying damn we saw this coming.\n  \n  \nI guess I just want to use this as an example of how STEEL HANDS can pay off. More importantly, it shows that you can literally wait for the DAY BEFORE expiration of the option to still have a 10-bagger on your hands.  \n  \nHold the line and buy the fucking dip.", "id": "kyb6mc", "created_utc": 1610768520.0, "score": 78, "upvote_ratio": 0.93, "num_comments": 45, "comments": [{"body": "Vale is the only boomer stock allowed in my portfolio", "score": 40, "replies": [{"body": "Lots of Boomer materials stocks (RIO, X, NTR, SCCO, SQM) have been slaying and probs will continue to do so if we are really in a commodity super cycle which I believe we are. Just look at the last commodity supercycle in 08. Gotta love those parabolic moves in these stocks.", "score": 3, "replies": []}]}, {"body": "I’ll jump on this once GME has mooned because I genuinely cannot be distracted from the dank opportunity of infinite tendies", "score": 23, "replies": []}, {"body": "Nice timing. My june calls are currently fucked because VALE dropped. I don't have anymore money to buy into the discount either x.x", "score": 22, "replies": [{"body": "Same boat, but mine aren't totally fucked. Missed the really good prices but holding em till they're 10 baggers.", "score": 4, "replies": [{"body": "If GME doesn't just explode Monday, I plan on taking some profits out Vale and shift them to GME. Hope I don't end up FOMO, but let's be honest. It'll be because FOMO.\n\nLife's hard when you don't have enough money to spread around to all the meme stonks.", "score": 4, "replies": [{"body": "It won’t explode Monday, FYI...\n\n... market isn’t open.", "score": 10, "replies": [{"body": "Perfect, then I can take profits and move them to GME.\n\nYes, it's late. I'm also going to write 2020 for the current year for the next 11 months.", "score": 7, "replies": [{"body": "I dig it. 2019 it is.", "score": 1, "replies": []}, {"body": "Not gonna moon but 5-7% will be there. Take that and join GME starship", "score": 1, "replies": [{"body": "That's the plan. I'm hoping for at least 10% up on my calls and I'll move a bit of it to GME, unless GME fucking explodes. I'm not gonna be holding that bag lol", "score": 1, "replies": [{"body": "GME is good long term buy. Cohen with his big dick swing can make GME happen. GME has enough cash to do major changes in buisness model", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": " VALE 🚀🚀🚀", "score": 17, "replies": []}, {"body": "VALE and MT gang shall rise up 🚀", "score": 18, "replies": [{"body": "RIP MT on RH...", "score": 6, "replies": [{"body": "you can still trade options on it! assuming you ever traded anything MT, goto your transaction history and click the link to the ticker from there!", "score": 11, "replies": [{"body": "lol, programmers", "score": 4, "replies": []}]}, {"body": "Can’t get RH full stop in fucking AUS. Workaround is trading MTS through Etoro. It’s a struggle down here.", "score": 2, "replies": []}]}]}, {"body": "I bought a shit ton of calls on steel plays for this summer and fall. I should have bought more commons on the dip today though... need to keep more dry powder.", "score": 7, "replies": []}, {"body": "DAmMM bRo\n\nI am super deep in GME but I love this play.\n\nI will be adding to my VALE gang holdings Tuesday \n\nVale $ MT 🚀🚀🚀", "score": 6, "replies": []}, {"body": "I MISS STEEL DADDY 🚀🚀🚀🚀", "score": 8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I’m well aware", "score": 2, "replies": []}]}]}, {"body": "3k deep in calls. 🚀🚀🚀", "score": 9, "replies": [{"body": "Same. Please print", "score": 3, "replies": []}, {"body": "Same time", "score": 1, "replies": []}]}, {"body": "$SID is better play!!", "score": 3, "replies": [{"body": "What’s the play on $SID?", "score": 3, "replies": []}, {"body": "Glad to see a shout out for SID", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Everyone did pretty much", "score": 6, "replies": []}]}]}, {"body": "$19 or $20 for 4/16?", "score": 3, "replies": [{"body": "$20 or $25", "score": 3, "replies": []}]}, {"body": "Vai Brasil!", "score": 3, "replies": []}, {"body": "The the June call the best one?", "score": 2, "replies": []}, {"body": "So buy MT? 😍🚀", "score": 2, "replies": []}, {"body": "I suggest positions in MT instead of VALE. \n\nVALE has a massive float at 3.95 billion shares, compared to MT at 771 million. VALE is also notorious for killing its employees. MT also trades lower compared to book value.", "score": 2, "replies": []}, {"body": "Bought 4/16 $25 calls - Hope you are right", "score": 2, "replies": []}, {"body": "Put in order for market open for 100 $25 4/16 \n\nLet’s do this", "score": 1, "replies": []}, {"body": "$clf", "score": 1, "replies": []}, {"body": "I was scrolling and thought I saw a post about stock ticket TWO, which I am holding. Dissapointed.", "score": 1, "replies": []}, {"body": "Bought the dip! To the mooooon!! 🚀🚀🚀🚀🚀🚀", "score": 1, "replies": []}, {"body": "any clue why it tanked this morning?", "score": 1, "replies": []}, {"body": "I'm not sure if this is going to age well but I'm leaning towards a very very strong no currently lol... But they're only $0.12 so maybe that's worth the price of a lottery ticket", "score": 1, "replies": []}]}
{"title": "CMPS / Compass Pathways DD - largest of the shroom stocks", "selftext": "**Overview**\n\nCompass Pathways PLC is a British company studying synthetic psilocybin as a treatment for depression.\n\n**Business Overview**\n\nCMPS is addressing several mental health diseases. There are ongoing trials for anorexia nervosa, addiction (primarily alcohol and smoking), depression, and anxiety. The global TAM for depression and anxiety alone is estimated at $18.5b. The most successful antidepressant at present is Zoloft, and it has generated over $30b in total revenue for Pfizer.\n\nCMPS is the largest of the psychedelic pharmaceutical companies by a significant margin with a market cap of almost $1.53b (only MindMed also breaks $1b). They are also currently listed on the Nasdaq. While psilocybin research has increased significantly, they are the dominant player in this space. They now run all six registered clinical trials for psilocybin that are industry supported.\n\nAs with all the players in this space, there are concerns about IP protections and the defensibility of their position. CMPS was granted a patent (US Patent No 10,519,175) in Jan 2020 for the use of psilocybin for treatment-resistant depression. This patent covered their proprietary, synthetic version of psilocybin (called COMP360). The primary purpose of the patent was to protect a stable form of psilocybin for clinical use. Otherwise, you would be stuck with a product with limited shelf life and significant variability in dosing. This patent is significant because it fulfills the FDA’s “good manufacturing practice” standards required to get final approval for any drug.\n\nPhase 1 trials for psilocybin are (by and large) completed. A 25mg one-time dose has been well-tolerated in several trials (in a typical 70kg subject). This has allowed for progression to Phase 2 trials. Clinical efficacy trials are starting to get published. The highest-profile study yet is Davis *et al.* **2020** JAMA Psych, wherein they found significant benefit to psilocybin use in conjunction with therapy when treating depression (trial: NCT03181529) (1).\n\nComp360 is in Phase 2b trials (NCT03775200 for an initial trial and NCT04519957 for long-term follow up) with a recruitment goal of 216 subjects. The Phase 2b trial is projected to finish recruitment in May 2021 and completed in Dec 2021. Depending on how the data look in May, they could begin working on Phase 3 approval through the FDA shortly after that. The primary question is how large a trial (i.e., how many subjects) will they need for Phase 3? This gets at the efficacy and number needed to treat to see a benefit (number needed to treat/NNT). The closest analog for investigational psychedelics is esketamine (aka Spravato). While ketamine has use as an anesthetic, its use in mental health was controversial (2). There were multiple analyses of the data (3–5), but the most important thing to know is that psilocybin has both a greater and a more durable antidepressant than esketamine (6–8). It stands to reason that the size of their Phase 3 will be smaller than the esketamine/Spravato trial and will proceed more quickly. Regardless, the timeline for that is still on the order of years.\n\nThe political climate is improving for psilocybin. Oregon and DC have recently voted to decriminalize it. In contrast with LSD, there is significantly more will to study therapeutic uses of psilocybin, and some reputable US universities (NYU, JHU) are leading these efforts.\n\nDifferences from the marijuana industry: An understandable comparison has to be made to the marijuana bubble. There are several key differences between the two markets:\n\n* Higher barrier to entry.\n* Lower recreational demand.\n* Ability to learn from marijuana stock euphoria.\n\n**Dilution rounds/Convertible debt situation:** CMPS has been through two rounds of funding and an IPO. Series A and B raised $105m in capital (Series B in April 2020), followed by their IPO, which raised $146.6m. They’re backed by ATIA Life Sciences who have raised $125m in November, and ATIA will be going through its own IPO sometime in 2021. Raising funds has not been an issue thus far and will get easier as trials are completed.\n\nDilution can be a significant hit to share price (ask MindMed holders). Looking through their F-1, on F23 (pg. 305), there are 116,455,234 shares worth of options and convertible preferred shares. There are 94,651,686 shares authorized. The F-1 has a section on dilution, but every pdf version available looks corrupted and there are missing values. Expect that any investment will be diluted at some point if the company is successful.\n\nAs a sidebar, Peter Thiel owns 7.54%.\n\n&#x200B;\n\n**Outlook:**\n\nThe next major milestone for CMPS will be an interim report on their Phase 2b trial for Comp360. They have been enrolling patients for 12 months now. When looking at the change log on [clinicaltrials.gov](https://clinicaltrials.gov), their initial goal was the complete the trial by Dec 2020, but this slipped to 2021. Their primary completion is now May 2021; this will be when they’ve enrolled all the subjects. There may be some kind of press release at that point or even an announcement of a pre-IND call to the FDA to discuss Phase 3 plans.\n\nMy thesis is that the stock will continue to cool off from the ATH they hit in December. A 10q will come out in late February; they could potentially have an update on trial progress in it – there could also be an 8k. They will not disclose interim study results at that time. Their goal will be to wait for a splashy publication after the trial is done. The goal should be entry before then. Prior results are strong enough and consistent enough to have a favorable outlook on the trials.\n\nLonger-term, they will be administering a Phase 3 trial. Look for a recruitment goal of 1,000 or more subjects (it will be on the order of the Spravato/Esketamine trial, which had 816). Janssen Research moved Spravato rapidly through Phase 2 and 3 trials, and it still took them four years to do the entire Phase 3 alone. CMPS has been efficient thus far, but Janssen is a J&J subsidiary with significantly more funding. A full four-year cycle would be a reasonable estimate. But we will get a better idea when the Phase 2 is done since it is already large for a trial of this type. If they can recruit patients quickly, then their Phase 3 may be faster than Janssen’s was for Spravato. CMPS also has the advantage of breakthrough therapy status with the FDA.\n\nAn all-important caveat to CMPS: this is a company with only one drug in the pipeline. If Comp360 has a negative trial outcome, then this stock will tank. There is no plan B. Administration of Comp360 is not as simple as getting a prescription and taking it at home. Patients have to be monitored by a specially trained therapist for >4 hours after administration. Even if there are significant benefits over the current therapies, clinical adoption will be slow.\n\nMy final TLDR: enter this play in the medium term after the current peak has wound down. CMPS is a better long-term hold that other players in this sector given the patentability of their therapeutic (Comp360) and success moving through trials. The science is on their side, and the political climate is more favorable than other psychedelics (e.g., LSD and MDMA).\n\nPositions: 4,000 shares, no options\n\nPapers\n\n1. A. K. Davis, F. S. Barrett, D. G. May, M. P. Cosimano…, … psychiatry (2020).\n2. E. H. Turner, The Lancet Psychiatry 6, 977 (2019).\n3. M. Fedgchin et al., International Journal of Neuropsychopharmacology 22, 616 (2019).\n4. V. Popova et al., American Journal of Psychiatry 176, 428 (2019).\n5. H. L. Starr et al., Psychiatry Research 293, 113376 (2020).\n6. R. L. Carhart-Harris et al., The Lancet Psychiatry 3, 619 (2016).\n7. R. L. Carhart-Harris et al., Psychopharmacology 235, 399 (2018).\n8. R. Watts, C. Day, J. Krzanowski, D. Nutt, R. Carhart-Harris, Journal of humanistic psychology 57, 520 (2017).", "id": "kypw2i", "created_utc": 1610826488.0, "score": 98, "upvote_ratio": 0.95, "num_comments": 40, "comments": [{"body": "thoughts on M M E D?", "score": 29, "replies": [{"body": "This is the one.", "score": 16, "replies": [{"body": "Always has been! Been in since .70", "score": 9, "replies": []}, {"body": "+1", "score": 5, "replies": []}]}, {"body": "I prefer M M E D F due to policy, CMPS acts more controlling and wants to monopolize shrooms. M M E D F treats it how psychs should be treated. \n\nMay not be the “best” business strategy but there’s so much room to grow regardless this is one of the times I have to invest with my conscience. Too much respect for psychs", "score": 11, "replies": []}, {"body": "This is gonna get downvoted but...\n\nI don't like MMED. Why? CMPS focuses on treating depression with psilocybin, something that has been known for a long time that's helpful (and I can confirm that myself with personal experience). They're also in stage 2b clinical trials, while MMED is lagging behind.\n\nMMED is focused on treating ADHD with small doses LSD. First, I'm not sure how well that works. I understand microdosing small doses of LSD works well for some, but it doesn't work well for others (and it didn't work well for me). Additionally, microdosing LSD can cause some anxiety and potential issues in the long-term.\n\nPlus, I don't see the FDA and other agencies approving that anytime soon.", "score": 3, "replies": []}, {"body": "I think it pumps soon", "score": 2, "replies": []}]}, {"body": "The best room for growth are in the ones we cant mention here. Several potential breakouts in the sector.", "score": 14, "replies": [{"body": "Why can't you mention mndmed?", "score": 6, "replies": [{"body": "Under $1b market cap I would assume.", "score": 4, "replies": [{"body": "They're at 1.28B I believe", "score": 1, "replies": []}]}]}, {"body": "dm me some ideas?", "score": 3, "replies": []}, {"body": "PM me?", "score": 1, "replies": [{"body": "Looking at your posts you already know about them.", "score": 1, "replies": []}]}]}, {"body": "Good DD it spiked to 45 at close so hope it continues.", "score": 5, "replies": []}, {"body": "Compass are fucking patent trolls. They literally tried parenting the patient hand-holding process practiced by their psychiatrists. Evil fucker Peter Thiel is backing this company. This is not the play.", "score": 4, "replies": []}, {"body": "Finally something else than BB and GME\n\nGood DD tho", "score": 5, "replies": [{"body": "Thanks man - have to mix it up. This is going to get buried in all the GME / PLTR / BB / steel mania ¯\\_(ツ)_/¯", "score": 2, "replies": []}]}, {"body": "Great move. You’re gonna print in the near future. 🚀", "score": 3, "replies": []}, {"body": "Fuck it, I'm in... on Tuesday.", "score": 2, "replies": []}, {"body": "So we are buying  leaps for may? Gives you all the upside  of it goes good and less exposure if it shits", "score": 2, "replies": [{"body": "LEAPs are always a solid play that gives you some leverage. Wait for the IV to drop some more. It was high after the spike. Go to marketchameleon to check it.", "score": 3, "replies": []}]}, {"body": "Good DD - well done.", "score": 2, "replies": [{"body": "Thanks buddy. Interesting company.", "score": 1, "replies": []}]}, {"body": "Best DD about Mushrooms in here. Thanks!", "score": 1, "replies": []}, {"body": "What do you think is a fair price to get in on CMPS`?", "score": 1, "replies": [{"body": "$43 isn't a terrible price if market conditions don't change. I would be hesitant right now to start a big position on anything. The GME situation is having some unpredictable effects on the whole market and I would recommend staying away.", "score": 1, "replies": [{"body": "What is the timeframe you think is smart to stay away? I totally get your reasoning, on the other hand a lot of stuff is quite cheat right now", "score": 2, "replies": [{"body": "You're making a fair point (be greedy when others are fearful and all that). Give the market a couple of more days. CMPS isn't going to run away from you in the mean time. All the good news that will catalyze the stock later in the summer.", "score": 1, "replies": [{"body": "Yeah, wanted to invest in one two weeks. Just wasn't sure if you were talking about days, weeks or months :)", "score": 2, "replies": [{"body": "I got 20 shares back in September.  I'm wanting to up my position once some of my TSLA vests.", "score": 1, "replies": []}]}]}]}]}, {"body": "0 cents.", "score": 1, "replies": []}]}, {"body": "And CMPS is heavily shorted as well!", "score": 1, "replies": []}, {"body": "Very good DD! Thank you\n\nI bought CMPS at 39 and will continue to hold for the next decade. I have no doubt in my mind that psychedelic medicine (particularly psilocybin) will revolutionize mental healthcare.\n\nSome relevant articles:\n\n* [FDA Calls Psychedelic Psilocybin a 'Breakthrough Therapy' for Severe Depression](https://www.livescience.com/psilocybin-depression-breakthrough-therapy.html)\n* [Psilocybin therapy 4 times more effective than antidepressants, study finds](https://newatlas.com/health-wellbeing/psilocybin-therapy-major-depression-trial-results-johns-hopkins/)", "score": 1, "replies": []}]}
{"title": "The next 'BB' ticker: BBY (Best Buy) DD", "selftext": "**TLDR**: **BBY** Rocket Ship Emoji, Calls (2/26 120-130cs or a strike near their all time high of 123) and Shares\n\nThis is so similar to the other BB ticker DDs I did that most of it going to sound familiar. If you already bought BBY on accident this thinking it was BB or BBBY and need some reassurance, you're in the right place. First, going over my retarded investing tenets to make sure my dumb plays align with it: \n\nOverall:\n\n1. I'm a retard and don't know anything.\n\nBull Market specific tenets (if you're a gay bear move on):\n\n1. The market is undervalued, and \n\n2. Small businesses are getting crushed by governments to the benefit of big business, due to COVID.\n\nWhat's that mean? Stocks may be overvalued, but the entire market is UNDERvalued, so your own internal stock valuations don't mean shit. Ask yourself, \"where the fuck else would I put my money?\" If you put it in a bank, printer goes BRRRR and you lose value. The only option is real assets: equities and real estate.\n\nSo this play, another boomer ass retail chain, sounds dumb as hell when I say it. That means it MUST be good. It's a big business, which our government is bending over backwards to give free money to. Big stores have cash on hand, which smaller businesses it competes with don't. It has an online presence. Online presence sounds \"duh\", except COVID is forcing the move to online quicker than even a skilled executive could pivot. And COVID/WFH means they get to drop their unprofitable stores, employee benefits, and dead weight faster without any blow back from consumers.\n\nAll of this is even BEFORE I look at [BBY specifically](http://investors.bestbuy.com/investor-relations/financial-info/sec-filings/sec-filings-details/default.aspx?FilingId=14535249). Let's get into it:\n\nUpside:\n\n* BBY has cash on hand, $5.1B to be exact (which doubled since COVID began, from $2.2B to $5.1B. See? What did I say?)\n\n* They grew online sales by 174%, AND store sales by 23%. They're being forcefully pivoted online, which is exactly what they NEEDED to do, so even if their leadership was dumb COVID has helped them. Additionally, every boomer is heading to Best Buy to set up their WFH setups with a blank check from their jobs that they can expense.\n\n* They surprised with an EPS of $2.04 last quarter vs $1.70 expected. Margins are only getting better as they can reduce benefits, track every minute of an employee's logged in time, and shut down stores / fire people without any public backlash due to COVID.\n\n* Remember how we all jacked off about GME console sales? BBY is BIGGER and sells more. Basically guaranteed revenue bump from this quarter that wasn't there last year, which will impress wall street because they're retarded like us and like when numbers go up. [The website has crashed over and over due to video game demand](https://www.pennlive.com/business/2020/12/ps5-xbox-series-xs-soon-to-be-restocked-online-at-best-buy.html). That sounds bad, but it's like with PTON being unable to fulfill orders... so many people want it that they're crashing the site.\n\n* They're still below their ATH of 123 from just 2 months ago and they've only been performing the same or better since then.\n\n* Most importantly in my mind, they are still undervalued because they didn't provide good guidance last quarter. Last quarter they beat every metric but the stock dropped from ATH of 123 to ~113 because [they said Q4 sales likely wouldn't be as high due to their high Q3](https://www.cnbc.com/2020/11/23/best-buy-bby-q3-2021-earnings.html). Well guess what, the market is already pricing in a slow Q4 for every business. There's uncertainty in this stock because of that, yet think of it: how could they have messed up extra console sales and stree-free closure of unprofitable stores? I mean, they could, which I'll go over below.\n\nDownsides:\n\n* Usually my largest gripe is with the people. In this case, [CEO Corie Barry](https://www.forbes.com/sites/jackkelly/2020/01/21/best-buy-ceo-corie-barry-is-a-corporate-iconshes-now-accused-of-having-an-inappropriate-affair-with-a-co-worker/?sh=47abb92f5ce4) is a traditional \"okay\" CEO with a few scandals under her. If she were a really skilled CEO, Best Buy could've been one of the best internet retailers ALREADY. But I'm still going with BBY since COVID is basically forcing them online faster than she would've pushed them.\n\nSo let's recap so far:\n\n* An actual profitable business and growing online presence, with all the benfits of having cash on hand.\n\n* Uncertain guidance leading to wall street hesitance\n\n* Tailwinds (gov and economic) pushing them to greater profitability (not even including new console season).\n\nI love this play and it's one of my sleepers. People should realize BBY is similar to GME, TGT, WMT, etc and will outperform it's \"brick and mortar\" expectations online.\n\nRetarded play: Just buy shares if you're scared\n\nAutistic play: **BBY** 2/26 $120-130c or near their ATHs. Also ROCKET SHIP EMOJI", "id": "kyu3vx", "created_utc": 1610839788.0, "score": 19, "upvote_ratio": 0.57, "num_comments": 44, "comments": [{"body": "Block Buster you say? You son of a bitch Im in. Brick n mortar stores are back 🚀🚀🚀", "score": 37, "replies": []}, {"body": "BUY BB!\n\n\nEdit - this is the most reshpect I’ve ever got and it’s more reason to buy BB \n\n\n🚀🚀🚀🚀🚀🚀🚀🚀\n\n\n🚀🚀🚀\n\n\n🚀🚀🚀🚀🚀🚀\n\n\n🚀🚀🚀🚀\n\n\n🌈🌈🐻🔫💣🔪\n\n\nTendie plate with a side of my wife’s boyfriends 💦💦 enthusiasm for her hobbies 🍽", "score": 52, "replies": []}, {"body": "Ya bb it is 🚀", "score": 24, "replies": []}, {"body": "So you’re saying I should buy more BB?", "score": 66, "replies": [{"body": "BB it is. 🚀🚀", "score": 46, "replies": []}, {"body": "I saw BBY CEO bad, BB CEO good. My decision has been made 🚀", "score": 36, "replies": []}]}, {"body": "I think the reason why BBY went up recently was because people thought it was BBBY", "score": 56, "replies": [{"body": "This is the DD that we need to talk about.", "score": 24, "replies": []}, {"body": "LOL Seems more likely thank you for the painful truth", "score": 8, "replies": []}]}, {"body": "BB to the  🚀 🌝 I want them MOONBERRYS 🍇", "score": 16, "replies": []}, {"body": "BB  🚀🚀🚀", "score": 13, "replies": []}, {"body": ">I'm a retard\n\nHAD ME AT THIS STRAP IN BOYS 🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 13, "replies": []}, {"body": "Is this Blackberry?  BB = baby.", "score": 11, "replies": [{"body": "Yes", "score": 5, "replies": []}]}, {"body": "Do they have Ryan Cohen?", "score": 9, "replies": []}, {"body": "Go to all time chart.\n\nRealize it’s in a head and shoulders right now.\n\nNotice the next part is to tank.\n\nI predicted the rise to 115, and now it shall fall.\n\n\n\nAlso go support the war efforts (GME 🚀, BB 🚀)", "score": 7, "replies": []}, {"body": "Focus on GME u clown", "score": 30, "replies": [{"body": "My GME shares are still up and reporting for duty", "score": 6, "replies": [{"body": "You could of had more if you weren't doing BBY...", "score": 10, "replies": []}]}]}, {"body": "This is all good and well, but unfortunately BBY typically falls or goes flat after earnings... just an observation", "score": 6, "replies": []}, {"body": "BB, BBY, and BBBY in true autist form 🚀", "score": 5, "replies": []}, {"body": "BBY is BB plus a Y, or BBBY minus a B. What about BY? I'm in.", "score": 5, "replies": []}, {"body": "i’ve had a hard on for best buy since september last year, i’m all for seeing this kind of dd. 🚀🚀", "score": 4, "replies": []}, {"body": ">An actual profitable business \n\n&#x200B;\n\nThis market doesn't seem to really be into that", "score": 3, "replies": []}, {"body": "BB has actual value. I’m\nSurprised this isn’t the focus on this sub. Good on you guys getting rich on GME though!", "score": 4, "replies": []}, {"body": "I’m too lazy to read, I’m in", "score": 6, "replies": []}, {"body": "That’s a tough one... BBY looks to be in the middle of an uptrend or at a 2nd top(bear sign). MACD and KDJ are showing two different trends. It may be worth playing as a wedge where you buy both a call and a put.", "score": 3, "replies": []}, {"body": "That's a lot of DD without any 🚀🚀🚀🚀🚀. So GME and BB it is", "score": 3, "replies": []}, {"body": "I hate that fucking company!!!!!!!!Everytime I try to spend money at bby they fuck me so I bail. IE:waiting hour and a half for my text msg they are on their way to unlock a case. I read about their shitty installs and customer service and I believe what i read from first hand accounts..\nFuck them!! they need to die off like 🦟 's  be careful, everyone I talk to hate their faces. \n\nBut for YOU I hope their online sales do something for the stonk. I wish upon u 🚀 🚀 🚀 s. And sweet delicious teddies with your wife's bf.", "score": 4, "replies": []}, {"body": "I agree with point #1. And that’s it.", "score": 2, "replies": []}, {"body": "Good enough to me, I'm in", "score": 2, "replies": []}, {"body": "Great DD, its all correct...I'm hodling 220 shares, since who know's when. For the last 2x ER at least... both times BBY destroyed expectations, and still, the stock tanked heavily....both times it got around 120-125 right before ER, and right after it collapsed, just a few weeks ago we where around $98.\n\nI'm willing to follow you, but what makes you think this time will be different?I agree its undervalued.\n\nNext ER: 02/25\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 2, "replies": [{"body": "Same with me: I'll be sell the news type, if news come out before ER that may be the catalyst to sell.", "score": 1, "replies": []}]}, {"body": "i missed GME because i just joined this group 2 days ago from the SPAC's group.\n\n&#x200B;\n\nGOING ALL IN ON BB!!!!!!!!!!!!!", "score": 2, "replies": [{"body": "we not even started with GME yet, hop on retard", "score": 2, "replies": []}]}, {"body": "BB and BBBY?", "score": 1, "replies": []}, {"body": "BBY or BBBY?", "score": 1, "replies": []}, {"body": "k buy more BBBY", "score": 1, "replies": []}, {"body": "So BB, BBY and BBBY? Got it.", "score": 1, "replies": []}, {"body": " BB BBY BBBY, who gives a shit? im buyin them all", "score": 1, "replies": []}, {"body": "BBY is cutting labor like crazy. They can’t even keep up with current online sale fulfillment rather than in store customers. Why order from there and get your product in a week when you can just Amazon in one day", "score": 0, "replies": []}, {"body": "In already holding 100% of my port in BB", "score": 1, "replies": []}]}
