{"title": "Diversification is a lie", "selftext": "If you’re not old as shit, diversification is one of the most misleading themes in retail investing. It’s just risk aversion, but the idea you need to split your portfolio ten different ways to prevent “overexposure” is asinine. You don’t need 40% ETF 40% boomer bluechip 20% growth, that’s just made-up bullshit. And it’s especially worthless because most users here don’t even have a portfolio worth protecting.\n\nEven ETFs that follow DOW and SPX are becoming worthless. Look at how they’re currently weighted and how it has been historically. Look at how companies in the S&P have been performing. You’re getting scammed, condolences.\n\nPeople need to understand that the older generation is not knowledgeable, they’re simply peddling bullshit that is outdated for DECADES. \n\nIf you didn’t make ridiculous gains in 2020, I feel bad for you. Stop diversifying and thinking “tech” is one sector. It’s embarrassing.", "id": "kpvxb4", "created_utc": 1609716944.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 40, "comments": [{"body": "[removed]", "score": 13, "replies": [{"body": "Agreed this sounds like a newbie who thinks the \"March crash\" was an actual crash. I wanna know what hes gonna do one day when he sees his whole portfolio red on a 25-30% pullback. Easy to talk in the most craziest bullmarket in history.", "score": 10, "replies": [{"body": "I am 100% down for another recession. You’re projecting my son", "score": -11, "replies": [{"body": "Not at all but there is a reason you don't invest 100% of your portfolio in 1 sector. And im NOT talking about \"being ready\" I'm talking about what you will actually do! Like tyson says everyone has a plan until they get hit in the face. Well you got 250k in the market in 1 sector on a 25% drop, who knows what anyone will do until they are in that moment. The rest is brovado and a fart in the wind.", "score": -2, "replies": [{"body": "imagine thinking I said to put your entire portfolio in one sector\n\nur projecting my son", "score": -9, "replies": []}]}]}]}, {"body": "I eat Ls for breakfast\n\nand then I spark one", "score": -6, "replies": [{"body": "Whoa whoa easy there Mr. Cool 😎", "score": 3, "replies": [{"body": "love me a nice high on a full belly. i dont let satiety control me", "score": -1, "replies": []}]}]}]}, {"body": "It's not a lie, you just don't understand it.\nTry to backtest TQQQ Vs TQQQ + TMF. You will see what a little diversification can do to you portfolio *over the long run*.\n\nOf course you're not going to do it, because you think you're so smart. So good luck to you.\n\nEdit:TMF not TLT", "score": 5, "replies": [{"body": "imagine holding a triple leveraged etf for the long\n\nlmAo holy fucK", "score": -2, "replies": []}]}, {"body": "Lol, how long have you been in the markets?  How long do you expect to be in the markets?\n\nDiversification is just math based risk mitigation.", "score": 5, "replies": [{"body": "I swear, the kind of attitude the OP is spouting out is extremely common. This is absolutely not going to end well. Don't know when, crazy meme stocks might double one more time first, but it absolutely will end in tears.", "score": 3, "replies": [{"body": "In zero memestocks, you probably have more than me. Nice try.", "score": 2, "replies": []}]}, {"body": "I diversify my growth plays.", "score": 1, "replies": []}]}, {"body": "> the older generation is not knowledgeable,\n\nActually, Warren Buffett and Charlie Munger agree with you, that diversification is for morons. But thats the thing - if one is a moron, the smartest thing you can do is to diversify. Which is why diversification is great to an average redditor, and bad to Warren Buffett.", "score": 3, "replies": [{"body": "buffett and charlie are generational talents so i dont really clump them in boomer knowledge\n\nbut yes, i know what they said about wealth creation vs preservation. ty for the support brother", "score": -1, "replies": [{"body": "Buffett’s got 13% in Coca-Cola and Kraft Heinz and favors American Express over every fintech. And this works, because diversification is important, value is important, and dividends and dividend growth are important.", "score": 1, "replies": [{"body": "buffett has made 2 good moves in the last 4 years\n\nhis time is over bruh but he has his legacy at least", "score": 1, "replies": []}]}]}, {"body": "Buffett has 50 positions, split about 50/50 growth and value, so he’s plenty diversified. He just does it in an unconventional manner, ignoring some sectors altogether and putting almost all of his growth investment in Apple.", "score": 1, "replies": []}]}, {"body": "if you have bullet proof convictions in your investment thesis and balls of a steel, then sure go all into 3-4 stocks\n\nhave a friend that is a mega TSLA bull for years. I saw his portfolio back in summer of 2019, when TSLA got chopped to $150 pre split. TSLA was like 50% of his net worth and at one point he was down like $170k. He kept buying more TSLA though.\n\nit worked out for him and he has over $4mm just in TSLA shares today, but he really does have the balls of steel and determination to double, triple down. most people are not like my friend and most are not cut out for this type of investing. I know some people that would die of heart attack the moment their portfolio gets chopped in half lol", "score": 3, "replies": [{"body": "that’s because people are anxiety riddled, look at every other social media post\n\nim talking about investing not therapy. i already conquered most of my mental demons", "score": 1, "replies": []}]}, {"body": "I read somewhere that diversification was for maintaining wealth, concentrated investing is for growing wealth.\n\nYou make some good points, and overall I tend to agree with what you’re saying - But I think there’s something to be said about having tech, retail, financials, health care, etc. and not being 100% in one sector. But I also think there is something about having staples of your portfolio regardless of sector. Having 50% of your portfolio in AAPL and MSFT is probably pretty secure.\n\nWhen I started about a year ago - I was trying to be “diverse” with individual stocks that mirrored the S&P sector weighing. I quickly realized that I was fucking my self - there’s a push and a pull - if tech is up, financials are down. If consumer staples are up, travel and leisure are down, etc. (obviously just a random examples).\n\nI still have some exposer in a handful of sectors - AAPL, ABBV, BA, CGC, CVX, DKNG, KO, DIS, RDS/B, WFC - but I stopped worrying so much about “balance” and more about finding the stocks that are in the best position to grow long term.\n\nThere’s a balance between the two - and I think your status in life in terms of income, age, goals, etc - will dictate where you should lean.", "score": 2, "replies": [{"body": "The average age in r/stocks is probably less than 25. Look at how many “new investors” there are. And the “veteran” investors want to pigeonhole the philosophy because it’s some weird cope that’s going around. You can’t teach an old dog new tricks.", "score": -1, "replies": [{"body": "Sure - that’s fair - but to say diversification is worthless isn’t true for all parties. There’s a time and a place for it.", "score": 1, "replies": [{"body": ">if you’re not old as shit\n\n\n>it’s just risk aversion\n\nmy caveats are outlined bro", "score": -1, "replies": [{"body": "Not necessarily strictly age - but a variety of factors. \n\nRisk aversion, the amount of $ you have invested, your needs for the investment (in terms of when you would be looking to use any earnings), income, age, etc.\n\nTo say you don’t need to diversify at all isn’t good advice. But to say you strictly should be diversified with X percentage in these various sectors also isn’t good advice.", "score": 2, "replies": [{"body": "We’re saying the same thing. I think we both know that.\n\ngl brother", "score": 0, "replies": []}]}, {"body": "How old is “old as shit?”. I need to know if I’ve crossed the line.", "score": 1, "replies": [{"body": "if you got dependencies", "score": 0, "replies": []}]}]}]}]}]}, {"body": "This thread brought to you by a first year RH trader. 👍", "score": 2, "replies": [{"body": "odd to expose yourself to being wrong with potentially little effort\n\nthats sum low intelligence shit bruh", "score": 1, "replies": [{"body": "so.... first month RH trader?", "score": 1, "replies": [{"body": "can someone get this 30% yoy loser away from me lmao", "score": 0, "replies": []}]}]}]}, {"body": "Agreed. Why should I or many others invest in a SP500 or other fund where the bottom significantly hold down the top. Look at the gains of ARK or QQQ funds and compare the gains. A 500 fund is certainly safe but I believe there are better ways to hedge during a downturn.", "score": 2, "replies": []}, {"body": "Amen brother", "score": -1, "replies": []}, {"body": "I dont discriminate.. I just buy low and sale high...dont really care what it is...😉", "score": 1, "replies": []}, {"body": "I love that thousands of years of accumulated financial wisdom is now moot after one bull run.", "score": 1, "replies": [{"body": "You should be happy and grateful you are living in the modern day renaissance\n\nsuper cringe bro", "score": 1, "replies": []}]}]}
{"title": "Panasonic About To Start Producing Tesla’s 4680 Battery Cells", "selftext": "", "id": "kpihvp", "created_utc": 1609670405.0, "score": 231, "upvote_ratio": 0.99, "num_comments": 49, "comments": [{"body": "Record deliveries, Panasonic producing Tesla batteries, Shanghai 100k orders of model Y......gonna be a great Monday :)", "score": 66, "replies": [{"body": "Or be down 10%... Because stonks.", "score": 70, "replies": [{"body": "If it does, Elon will announce 130 kWh interior refreshed Model S/X for March...", "score": 6, "replies": [{"body": "I'd like that, capturing porsche clientele at some point.", "score": 3, "replies": []}]}, {"body": "We didn't hit 500K deliveries so my bet is that the stock will go down a bit.", "score": 16, "replies": [{"body": "I probably agree. I think 500k was definitely priced in, as is Shanghai doing so well, so I don't think we'll see a significant rise on open", "score": 3, "replies": [{"body": "500k was priced in... 499.6/500=99.9%... 705*0.999= 704.31... 705-704.31=0.69$ dip on open as the stock rebalances to price in this failure!", "score": 14, "replies": [{"body": "Nice!", "score": 2, "replies": []}, {"body": "Sounds about right", "score": 1, "replies": []}]}, {"body": "Nobody imagined 100,000 ORDERS (not reservations) in 10 hours.", "score": 6, "replies": [{"body": "That is really bullish (and I am cautiously optimistic!), but that isn't the headline figure for most people, and Tsla seems to drop whenever there's good news, so who knows", "score": 3, "replies": [{"body": "If it drops I buy more.", "score": 3, "replies": [{"body": "Golden", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "MOOONDAY", "score": 6, "replies": []}, {"body": "Definitely down", "score": 2, "replies": []}]}, {"body": "CNBS: Panasonic beats Tesla with revolutionary battery", "score": 78, "replies": [{"body": "I don't know why but this is so funny. Shouldn't be by now. 😂", "score": 19, "replies": []}]}, {"body": "This gives more foundation about the huge sandbagging from Elon about the 4680, as written in the last tweet between him and Galy  [Elon sandbagging](https://mobile.twitter.com/elonmusk/status/1345386356504027136)\n\nTesla bears won't even know what hit them", "score": 43, "replies": [{"body": "We’re gonna hit 750 by EOW", "score": 11, "replies": []}, {"body": "What is he referring to with \"SteelZ\"? Stainless steel Cyber S???", "score": 1, "replies": [{"body": "I believe it was \"steez\", you ol' boomer.\n\nThe quality of being stylish with ease.\n\nhttps://www.dictionary.com/e/slang/steez/", "score": 7, "replies": []}]}, {"body": "Back in Sep (battery day) they were already getting some yield on their dry electrolyte process that was feeding into the 4680 cells, and they must be at least 1 or 2 revisions of the machine since then, so would regardless of what scale they are up to, seem likely that at some point soon they would have production up to the level to produce the Model S Plaid at least (if not for all the S/X vehicles). Would obviously take some time till they have production sufficient for the Model Y and/or 3 though.\n\nIn any case, between the Model Y SR+ (single motor version) and the Model S/X refresh it will be interesting to see what VW or anyone else has that will be competitive. Also once Biden is President if we can get an expansion of the EV credit so that no only the first few hundred thousand are covered the demand for these cars should explode in the US.", "score": 1, "replies": []}]}, {"body": "Any info on the difference between 4680 produced by Tesla and the ones by Panasonic? Is it the dry electrode process? Will Panasonic be using the 'Tesla silicon'? What about iron/nickel instead of cobalt?", "score": 9, "replies": [{"body": "They’re probably just large tabless versions of their 2170’s. Using whatever chemistry they currently have.", "score": 14, "replies": []}, {"body": "They can’t be different.  All the advancements, announced on battery day, were related to the increasing of the cell size because of tabless design mods, cathode changes and anode chemistry mods.  All these advances combine into a larger battery which was not possible before due to overheating issues.\n\nSo, Panasonic can not just use the old tech and make bigger batteries, it has to be the new design with all the engineered advancements, that’s the only way the bigger batteries will work.\n\nThese 4680s produced by Panasonic are the 4680s that Tesla will produce once they ramp up production.  It’s the only way.\n\nMy take away from this is that the partnership between Tesla and Panasonic goes deep enough to share Tesla’s technological advances so that Tesla can harness Panasonic’s production capacity while they build out their own.", "score": 19, "replies": [{"body": ">All the advancements, announced on battery day, were related to the increasing of the cell size\n\nBigger cells have thermal issues, which is why the tabless design is necessary for the 4680 cells due to the increased electron path length. But I don't see any reason why the dry battery electrode process is limited to 4680 cells. Same goes for the anode/cathode changes. Vice versa, I don't see a reason why Panasonic MUST implement everything Tesla showed on battery day to make a working 4680 cell.\n\nElon himself mentioned on stage that it's going to take Tesla about [3 more years](https://www.youtube.com/watch?t=5320&v=l6T9xIeZTds&feature=youtu.be)  before everything they showed on battery is fully implemented. So it's clearly not \"the only way\" given that Panasonic is about to start the production of a 4680 cell.\n\nedit: added link", "score": 23, "replies": [{"body": "I agree, they clearly said they planned having the 4680 with different Chemistrys. For the form factor 4680 the only thing that is needed is the tabless electrode. The drycoating and chemistries are independent.", "score": 13, "replies": [{"body": "Yup.", "score": 0, "replies": []}]}, {"body": "It’s likely this is in part to the more experimental side of things like the high-silicon loading. Those improvements will likely be gradual while some, like the tabless design, will be needed from the start.", "score": 1, "replies": []}, {"body": "This has been my take as well. Panasonic will likely be using a wet electrolyte process.", "score": 1, "replies": []}]}, {"body": "DBE unlocks reduced CapEx, anode and cathode advancements unlocks higher energy densities and reduced $/KW, tabless unlocks a larger battery.  They need not be incorporated all at once.\n\nThe 4680 is definitely needed for the all diecast vehicles, the rest can be added as they are perfected.", "score": 3, "replies": []}, {"body": "It just needs new cell design. Doesn’t need the cathode, anode, dry cell tech.", "score": 3, "replies": []}, {"body": "Wrong. Can be a like today’s chemistry but must be tabless. They make cost lower packaging easier.  But they can be very close cousins to Nevada batteries.  Of course they can be improved as well. But only 4680 requirement is tabless.", "score": 2, "replies": []}, {"body": "Makes sense to me.", "score": 1, "replies": []}]}]}, {"body": "\"about to\" in headline is a bit iffy. article uses future tense, discusses unspecified sometime in 2021. it seems as if panasonic was not included in tesla's plans between when battery day was first scheduled for march and then held in the fall; panasonic learned about it when the rest of us did, as far as we know. it looks like they will add a 14th line at gf1, and maybe later open a plant in norway. at battery day tesla was still working the kinks out for production at scale, and i don't think there's been any announcements about how that is coming along. remains to be be seen if the tech will be licensed to catl and lg, but seems likely.\nhttps://asia.nikkei.com/Business/Technology/Panasonic-Equinor-and-Hydro-consider-making-batteries-in-Norway", "score": 6, "replies": []}, {"body": "so how does that work? Does Tesla hold the patents or can anyone now buy these cells from panasonic? Weren't they supposed to produce those themselves?", "score": 5, "replies": [{"body": "Elon has said that Tesla wants to get as many batteries that they can get a hold of. He said that suppliers are still important because Tesla can’t manufacture all the batteries that they want and that is a limiting constraint on growth.", "score": 9, "replies": []}, {"body": "nobody outisde tesla knows for sure how this works. But Telsa ***probably*** holds some patents and licenses that they have a contract with panosonic (and possibly other companies). That contract will stipulate how those batteries can be sold. I would guess there are essentially two overall possibilites:\n\n1. The deal is that panasonic will use teslas Intellectual property to produce x numbers of cells and tesla will buy them all. Panasonic will not be allowed to use the technology in other areas and can't sell products using Teslas IP to other costumers.\n\n2. The deal is that Panasonic are paying a licence fee to use Teslas IP to produce battery cells. If Panasonic can produce more cells than tesla want to buy, panasonic can sell the cells on the open market and tesla takes home a licensing fee for every unit produced/sold. Tesla in this case probably have som stipulation about having rights to buy X numbers of cells at production+Z costs (or something similar).", "score": 8, "replies": []}, {"body": "You can't buy these from Panasonic unless Panasonic licenses it from Tesla for non-Tesla use. Panasonic could in theory take advantage of Tesla's open IP agreement, but it would mean Tesla then can use every patent Panasonic owns. Further, anyone buying batteries from Panasonic under this license would also be agreeing to Tesla having access to their IP.\n\nIn other words, Tesla's open IP initiative is a bitter pill for just about anyone to swallow and hence they would not touch it.", "score": 2, "replies": [{"body": "has anyone so far made use of that IP policy? It sounds like open source, you can use the code, but have to contribute back.", "score": 1, "replies": [{"body": "I doubt it.", "score": 1, "replies": []}]}]}, {"body": "The main patent is tabless. If Tesla lends it, anyone can make 4680.", "score": 1, "replies": [{"body": "Its what they bought maxwell for right?", "score": 0, "replies": [{"body": "I thought maxwell was dry electrode.", "score": 7, "replies": []}]}, {"body": "And the great thing is they patented many different ways of going tabless.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yo sell me 1/8 800 calls at 1.50 tomorrow.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "So Tesla must have patented them , or can someone manufacture 4680 type batteries if they have the facility available.( cause I didn’t see the “ patent” thing mentioned on battery day .  Or did I miss it.  ).", "score": 1, "replies": []}, {"body": "this is old news, no?\n\n>TEN UMEKUNI, Nikkei staff writer\n\n>December 26, 2020 01:03 JST", "score": 1, "replies": []}, {"body": "Thoughts on buying Panasonic as a long term hold?", "score": 1, "replies": []}]}
{"title": "Tesla Giga Shanghai: MIC Model Y Are Flooding Factory's Parking Lot", "selftext": "", "id": "kpt935", "created_utc": 1609708528.0, "score": 227, "upvote_ratio": 0.98, "num_comments": 40, "comments": [{"body": "But gordon said China demand is 0. So they will just sit there and rot I'm sure", "score": 81, "replies": [{"body": "Good DD, sell order initiated", "score": 25, "replies": []}, {"body": "I don't understand what you don't understand about \"busted growth story!\"", "score": 5, "replies": [{"body": "Real growth story... Competition is coming!\n\n[https://www.youtube.com/watch?v=sVtK\\_xypA7U&ab\\_channel=OneshotCreative](https://www.youtube.com/watch?v=sVtK_xypA7U&ab_channel=OneshotCreative)\n\nI might just have to sell my TSLA shares tomorrow and buy NKLA", "score": 3, "replies": []}]}, {"body": "Maybe that’s what they are doing right now? Lol", "score": 2, "replies": []}, {"body": ">I don't understand what you don't understand about \"busted growth story!\"\n\nGJ lives rent free in a lot of peoples heads on this sub.", "score": 0, "replies": []}]}, {"body": "CuZ tHeY hAvE nO bUyErS", "score": 32, "replies": [{"body": "Just like the model 3 in 2018!  All over the parking lots!  Some many parked cars tesla has to buy lots elsewhere to park them in.  #nodemand   s/", "score": 3, "replies": []}]}, {"body": "they produce cars like 3D prints", "score": 24, "replies": [{"body": "More like die cast matchbox...\n\n... Oh wait!", "score": 17, "replies": []}, {"body": "That's not a good analogy. Injection molding might be closer.", "score": 7, "replies": [{"body": "How about creepy crawler machine?", "score": 2, "replies": []}]}, {"body": "My 3d printer produces things way slower then even Tesla's slowest line.", "score": 3, "replies": [{"body": "3D printers aren’t known for being fast though.", "score": 1, "replies": []}]}, {"body": "As someone who’s currently sitting in front of their 3D printer waiting for a mini Starship (250mm) to print, I can guarantee you isn’t as fast as people want it to be, at least not yet. This is a +22 hour print.", "score": 1, "replies": [{"body": "What machine are you using?", "score": 1, "replies": [{"body": "Ender 3 Pro, super happy with it, but the reality of 3D printing is it’s just slow, at least for models in that price range", "score": 3, "replies": []}]}]}]}, {"body": "Shanghai goes to 11", "score": 8, "replies": []}, {"body": "What is most interesting is the road leading straight to the factory, that is impressive.  \n\nAlso seems they are using the adjacent farm land and building out a large parking lot, which makes me think the existing parking lot and staging area will soon be replaced with even more [factory buildings](https://cdn.shopify.com/s/files/1/0173/8204/7844/articles/Tesla-Gigafactory-3-full-plans_2000x.jpg).", "score": 8, "replies": []}, {"body": "It would be interesting to know what a company has to pay for land in China, compared to a similar location in the US.", "score": 5, "replies": [{"body": "Telsa paid 150 million for the land to build the Shanghai factory, and they have already paid it off.", "score": 16, "replies": [{"body": "After doing a quick search, CNBC reported a purchase price of $140 Million, I'll split the difference and call it $145. The land is about 210 acres, which gives a price per acre of around $690,476. \n\nShanghai's population is around 27 Million, and the closest American city is NYC at 8.6 million, so that comparison is virtually useless. \n\nI did find a 189 acre parcel near Pittsburgh for [$800k.](https://www.loopnet.com/Listing/Universal-Rd-Pittsburgh-PA/15004488/) I understand that most of these cars are being built for Chinese consumers so they need a physical presence there. I am a little surprised at the cost of the land though.", "score": 10, "replies": [{"body": "I've been to Shanghai (and I'm still impressed by it) and it has expanses of industrialised areas. We were being bussed from the airport to a hotel and it was on motorway through expanses of factories, businesses, warehouses, car parking lots and whatnot. That was going on for 15 minutes at motorway speeds.  \n\nI think it's a similar case at the [Tesla factory](https://www.google.co.uk/maps/place/Tesla+Gigafactory+3/@30.8754936,121.7685972,2129m/data=!3m1!1e3!4m5!3m4!1s0x35ad7a2e64f44f4d:0x1b43eb48f9a87498!8m2!3d30.8752243!4d121.7717102). You can see some farm land around it, but also plenty of industrial buildings.  \n\nI am assuming the land in a good location is very sought after and expensive. Don't forget, it's not just about being near, it also has to be accessible by public transport (or at least company buses) for the workers etc. You should look at land where there is, for example, a train station within walking distance.  \n\nAlso, Shanghai is the second biggest city in china, so comparing with Pittsburgh is not fair.", "score": 4, "replies": [{"body": "Yeah, Pittsburgh was just a quick comparison when I searched for land. \n\nI had considered major highways, and railways for transporting the cars, but hadn't thought about the public transportation aspect which is obviously very important.", "score": 1, "replies": []}]}]}, {"body": "$150m in loan financing with very favorable terms plus utility and tax relief. China has industrial policy done to a T. In stark contrast with blue states like California. Hence Elon comment that places like California and New York were winning but grew complacent. That is why they are falling behind to emerging super power like China and pro growth pro business states like Texas.", "score": 8, "replies": [{"body": "Not only do they not give Tesla favorable terms (which they more than recoup by the increasing tax revenue the more people they hire), they also allow rogue interim health officers of bumfuck county to shut down an empire for 9 weeks.", "score": 2, "replies": [{"body": "What are you talking about? Tesla would be dead if it wasn’t for California. Not favorable terms? Come back to reality.", "score": 4, "replies": [{"body": "bla bla bla", "score": -4, "replies": []}]}, {"body": "Yep. In stark contrast with Shanghai where the authority actively worked with tesla to keep the factory open and running and by shuttling in workers from their home towns after Chinese new year.", "score": 1, "replies": [{"body": "Yeah SH was down for like 2 weeks? If that? I believe they even set up temporary container living areas as a means of quarantining the workers during their shifts. This is how they get their shit in order versus the chaos in the western world.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "I think a 4 story parking garage would make more sense to house cars at a car factory, instead of an open lot.", "score": 3, "replies": [{"body": "Would have to tear down the structure afterwards to expand the factory.. When the semis are running at efficiency this overflow problem is not gonna be what we're looking at.\n\nI'm also going to assume that someone has it down to a science that as soon as the printing press receives the order to make the vehicle that the vehicle is already assigned  how it will be delivered.", "score": 5, "replies": []}]}, {"body": "To be fair - this was from Dec 31, and we saw from WuWa that they were taking Model Ys away for delivery on New Year’s night", "score": 2, "replies": []}, {"body": "factorio IRL!", "score": 2, "replies": []}, {"body": "Article: *Tesla Giga Shanghai Flooded, Delivery of Model Y in Question*\n\n/s", "score": 0, "replies": []}, {"body": "I bet they will get those qc issues in order immediately with this kind of volume.", "score": -9, "replies": []}, {"body": "Bullish 💕📈", "score": 1, "replies": []}, {"body": "Giga Shanghai is expanding to have half million capactiy for model Y.   The majority Y in 2021 will be made there.", "score": 1, "replies": [{"body": "As opposed to where? US will take care of North America and Berlin will do Europe.", "score": 1, "replies": []}]}, {"body": "Does anyone know what they are building in the new expansion they just started in the melon farm area?", "score": 1, "replies": []}]}
{"title": "TLRY Tendy Update", "selftext": "[deleted]", "id": "kpbt8f", "created_utc": 1609641614.0, "score": 50, "upvote_ratio": 0.91, "num_comments": 23, "comments": [{"body": "The Aphria merger is huge. 1 in 3 product I give a customer at the dispensary is Aphria, maybe 1 in 30 tilray. Once Aphrias growers rebuild that clunker with their 1 dollar per gram grow abilities (vs tilray 5 a gram) they can export tariff free to Europe through Tilrays leed certified facility there.  Carry the remainder, and that equals tendies", "score": 8, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I am, I am the crew trainer and head sales at Hello Cannabis", "score": 6, "replies": []}]}]}, {"body": "Why TLRY in particular?", "score": 11, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I just saw your other post. I'm in MSOS so from confirmation bias you must not be too retarded. Thanks for the DD", "score": 5, "replies": []}]}]}, {"body": "I got 13c expiring 1/22. Am I fuk", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Fortune favors the bold", "score": 5, "replies": []}, {"body": "Thankfully I got in when the premium is low. Only 14 a contract that’s a loss I can take", "score": 4, "replies": []}]}]}, {"body": "I’m in with ya my guy this could be huge. why’d you choose a date that’s way past the vote?", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "It seems to have happened my man. What’s ur game plan from here", "score": 1, "replies": []}]}]}, {"body": "So you are betting on aphria then?  Isn’t merger for aphria shares?", "score": 2, "replies": []}, {"body": "I've got APHA 1/15 7.5c for earnings.\n\nIf they print, I'll probably throw some cash into TLRY leaps.", "score": 2, "replies": []}, {"body": "I guess ill go in with you on MAR calls. Got a leap and 200 shares. Fuckit", "score": 2, "replies": []}, {"body": "Just want to say thank you for this DD. Man after my own heart. I got hella calls for March also. LFGGGGGG", "score": 2, "replies": []}, {"body": "Long solar and short the dollar.  I don’t see weed as a big winner from a dem senate", "score": 4, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I have a feeling that house vote was more so to gain voters in Georgia and turn the state blue, not to actually decriminalize weed.  Politicians, blue or red, are politicians.  If they haven't cared about the billions in tax revenue, they wont all of the sudden.  They want to ensure their lobbyist are getting there's, otherwise whats the point, politician wont be in office next election cycle.  \n\nDon't get me wrong, im long in APHA, and until recently had positions in TLRY.  I still hold many weed stocks, and have many positions waiting to be filled next week.  I do believe within the next four years weed will be decriminalized and subsequently legalized, however, I don't think this particular bill is the catalyst that will send us over the hump.", "score": -1, "replies": []}]}, {"body": "I agree the dollar should continue falling. ICLN, MSOS, commodities.", "score": 3, "replies": []}, {"body": "Also a handful of red states voted to legalize weed in the November election, so doubtful they’d vote against it if federal legislation came up", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sry buddy didn’t realize, Canadian af", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": ">th the House AND Senate to pass along to the President for a signature. In regards to MJ bills, since the House has been blue (Democratic majority) and Pelosi as majority leader supports reform and therefor allows bills to hit the floor and get a vote. This is where MJ bills shine, in the House of Representatives. However that’s as far as they get because the Senate is Red (Republican Majority) and Mitch McConnell doesn’t support reform. Therefor bills get blocked and aren’t\n\nBut Mitch McConnell is scheduled to get COVID in early January and die though.. We should be good. TLRY to the MOON baby\\~", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What about Aphria? What’s going to happen to them", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Just for reference: the all stock merger with shares of APHA converting to TLRY at a defined ratio creates an arbitrage opportunity. This happened with VSLR and RUN over the summer and can be partially attributed to an almost 300% increase leading up to the completion of the merger. I am hoping something similar plays out here. It began immediately for VSLR and RUN but has been slow going here, so far.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I had VSLR 10/16 11C when the merger was announced that I sold just a few days later. Looking to rectify that mistake.", "score": 2, "replies": []}]}]}]}]}]}
{"title": "E2open: Hugely undervalued AI/Cloud SaaS used by Microsoft, Google, AMD, Boeing, etc. Merging in early Q1", "selftext": "In early Q1 P-C-P-L is merging with E2open. E2open has disruptive AI / Cloud technology for the supply-chain industry. They are widely used by big name customers including Google, Microsoft, Boeing, Walmart, Coca Cola, UPS, AMD, NVIDIA, Abbott, and dozens of others.\n\nWhat differentiates them from other (more boring) supply chain management companies is the way they use AI to predict changes in supply and demand. Basically, E2open allows companies to see 10 steps ahead into the future to forecast how much inventory they will need based on hundreds of variables (geopolitics, resource availability, etc). This saves companies hundreds of millions in waste. CEO Michael Farlekas  compares it to working at a lemonade stand and being able to know ahead of time exactly how many lemons you will need. Obviously this will save you from wasting money on lemons that would spoil. E2open is the only company that integrates this type of AI technology with a vast data Cloud network.\n\nE2open uses a subscription model to make consistent sustainable revenue from their 1000+ customers. There are multiple services they offfer, but over 50% of their customers only use 1 service. What's nice is that existing customers go on to utilize more and more of their services as they realize the value it adds to their companies. Google for example paid E2open twice as much over the course of 2 years. E2open makes additional revenue from new customers, and also by strategic value-adding acquisitions. The SPAC deal is allowing E2open to clean up their balance sheet so they can add value to their software portfolio (and charge higher premiums to existing customers) and continue making acquisitions.\n\nE2open has been growing at a rapid clip since they were taken private in 2015. In 2015 they made $80M in revenue and in 2020 they made $335M. That's 420% growth in 5 years, or roughly +84% growth per year.\n\nIn the last 5 years they increased their revenue +420% by value-adding acquisitions they've made over the last decade --- Icon (2013), Serus Corp (2014), Terra Technology (2016), Orchestro (2016), Steelwedge (2017), Zyme (2017), Entomo and Birch Worldwide (2018), Inttra (2018), and Amber Road (2018) --- and integrating these different services to create a beautiful comprehensive end-to-end platform.\n\nSomewhat surprisingly, their projections for 2021 are much lower at only +10% estimated revenue growth, which is the main reason most would argue P-C-P-L is trading so close to the NAV. However, 10% growth is actually really solid when you look at their margins and consider that 80% of their revenue is recurring with excellent customer retention. Institutional investors especially will appreciate E2open as the reliable revenue generating machine that it has  become. \n\nI'm also still optimistic about valuing E2open as a growth stock and feel the 10% is a low-ball estimate based on comparisons to the median growth of other supply chain management companies. I'm suspecting E2open will consistently  outperform expectations on a quarterly as the SPAC capital equips them to capitalize on their services, continue making acquisitions, and ultimately tap into millions in white space opportunity.\n\nEven if E2open maintained a 10% growth rate  and if this were factored into its valuation, $11/share is still too damn low. E2open compares itself to Descartes, Kinaxis, Manhattan, and Spscommerce. With a median of 10.7x revenue, E2 was only at 7x, and with a median of 34.7x, E2 was only at 21.3x, meaning E2open has a much higher upside than its peers.\n\nInstitutions will bring the stock price up to par with it's peers and I believe the low ball projected growth is a conservative number that they will completely destroy when you consider their growth of +400% over the last 5 years. While 10% is perfectly fine for a company like E2open, I'm expecting the trend of the last 5 years to continue in 2021 and we'll be seeing some exciting numbers. \n\nMy PT pre-merge is 15 and 25 EOY assuming their projected 10% revenue growth. If E2open surpasses 2021 expected revenue as I'm suspecting and they have major quarterly beats, I'm holding until 50.\n\nDisclaimer: This is my largest position. I'm in 2500 shares at 10.87.", "id": "kpcaru", "created_utc": 1609643326.0, "score": 28, "upvote_ratio": 0.78, "num_comments": 48, "comments": [{"body": ">E2open allows companies to see 10 steps ahead into the future\n\nStopped reading there.\n\nWe got a time machine boys! Gonna refinance my wifes house and going all in! I simply cannot lose!", "score": 45, "replies": [{"body": "You didn't know Miss Cleo was artificial intelligence?", "score": 4, "replies": [{"body": "Robot, sure. But a tImE mAsHeEn?", "score": 4, "replies": []}]}]}, {"body": "DR;AI\n\nDidn’t read; All in", "score": 27, "replies": []}, {"body": "does cheesecake factory uses it?", "score": 10, "replies": []}, {"body": "read like a classic P&D but 10mins of google searches and i like this and i like you for sharing.", "score": 9, "replies": []}, {"body": "OP is a retard who cannot spell \"offer\" correctly.    \n\n\nI'm sold.\n\n  \nMax out the credit cards, sell everything, borrow like never before and go all in.", "score": 9, "replies": []}, {"body": "This is a garbage b2b professional services company. You're gonna get burned hard.", "score": 17, "replies": [{"body": "Damn I should make a TLDR. Clearly you didn't bother reading and already have your mind made up. What are you basing your opinion on? And it's SaaS not b2b", "score": -2, "replies": [{"body": ">That’s 420% growth in 5 years, or roughly 84% a year\n\n84% growth for 5 years would be over 2000% dumbass", "score": 18, "replies": [{"body": "I failed 5th grade math.", "score": 14, "replies": []}]}, {"body": "Lmao just because its SaaS doesnt mean its not b2b. There are tonnes of SaaS b2b companies and this is one of them.", "score": 4, "replies": []}]}]}, {"body": "I skimmed through it and now I need you to give it to me straight. Does it have potential for memementum?", "score": 5, "replies": [{"body": "It's a Cloud/AI service used by all our favorite tech stonks. If that doesn't have meme potential I don't know what does. \n\nWe just need some YouTube personalities to start shilling it and we'll be on our way to Tendie Town. \n\nIf the Zoomers fail to give it the meme energy it deserves, the Boomers will at least guarantee steady gains.", "score": 8, "replies": [{"body": "But does TSLA use it???", "score": 1, "replies": [{"body": "PTON does. Am I getting warmer?", "score": 3, "replies": [{"body": "Peleton is dumb, if they dont release the bmx vert ramp edition, and soon, the entire company will go under", "score": 3, "replies": [{"body": "PTON puts it is", "score": 2, "replies": [{"body": "Until the bmx edition comes out. Then flip and do a barspin 360 tailwhip", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "I added this to my list last week and gonna buy on monday hoping It won't open with a gaap up. A good entry was made possible on thursday but i had no more free Money, i was all invested.", "score": 3, "replies": []}, {"body": "Nothing to see here folks. It's literally just a supply chain software nicely packaged together. Normally companies use separate systems because of legacy or blah blah blah. The only thing you need to know is that it's' not \"revolutionary\". It's good but no PLTR.\n\nAs for the forecast capabilities you are freaking joking? IT'S SUPPLY CHAIN MANAGEMENT. All they literally do is forecast shit. Nerds have been doing it before computers were invented. Give me 2 months, access to their backend data bases and about three fifty and I can build you something similar.\n\nThe selling point here is that they'll manage the software instead of you having to hire a bunch of retards like me to maintain it. Since it's SAAS they can spread the cost out to every customer so it's cheaper to use them than run your own custom solution. 100 companies need 1 team of coding monkeys. 1 company needs 1 team of coding monkeys.\n\nTLDR: It's not that bad but don't believe the AI/Prediction thing. It's literally shit easy. Selling point here is low maintenance, easy to use, and scale(which makes the cost lower than running your own). This will not outgrow Palantir. If you buy this you belong in /investing.", "score": 6, "replies": [{"body": "Maybe Google, Microsoft, Facebook, AMD, and the other dozens of blue chip companies would like to hire you instead, since they're clearly wasting their money. 😂", "score": 0, "replies": [{"body": "I literally said that it cost them less to use E2Open instead of coding out their own. That's one of like 2 things that you have going for you. Lol sorry I forgot half of us can't read.\n\n# 🤷", "score": 5, "replies": [{"body": "No, it's that I find it hilarious that your huberous allows you to completely discredit their AI tech and say ITs JuSt SuPPly cHaIn ManAGeMent. AI / Automation is the future. Supply chain management benefits from its applications. E2open is capitalizing on that fact. 🤦‍♂️", "score": -6, "replies": [{"body": "5th grade math and 5th grade English as well, it’s hubris you were angling for I imagine.", "score": 11, "replies": []}]}]}]}]}, {"body": "Is anyone elses robinhood stuck it only shows buy not trade so I can buy FDs?????", "score": 2, "replies": []}, {"body": "> they use AI to predict changes in supply and demand\n\nhave to be linear regression or logistic regression right?", "score": 2, "replies": [{"body": "Software harmonizing data does magical shit. Do I look like a fucking genius to you boneless burrito? I have 24 chromosomes and eat crayons for breakfast", "score": 3, "replies": []}]}, {"body": "I looked at this earlier. They buy all their growth through acquisitions (vs grow organically). Their organic growth is not that impressive compared to the valuation the SPAC placed on it.", "score": 2, "replies": [{"body": "The acquisitions are up-front costs that allow for larger future organic growth.\n\nThey've been in a growth phase but this is more of a value play.", "score": 1, "replies": []}]}, {"body": "so.... 🚀🚀🚀🚀?", "score": 2, "replies": []}, {"body": "It looks like you did your homework. What’s the ticker so I can yolo once my GME hits. I do not have time to read and figure it out", "score": 0, "replies": []}, {"body": "ticker symbol ?", "score": 1, "replies": [{"body": "P-C-P-L currently but after the merge in early Q1 it will become ticker ETWO", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not really. E2open provides AI applications specifically for the supply chain management sector.", "score": 1, "replies": []}]}, {"body": "What’s ur dcf price?", "score": 1, "replies": [{"body": "E2open is currently valued at significantly lower revenue and EBITDA multiples compared to peers. It also has more growth potential based on its unique services and will likely gradually gain market share. For those reasons $11 is far below its intrinsic value. IDK how to calculate DCF. I'm just a random retard on WSB bro.", "score": 3, "replies": []}]}, {"body": "What you think about the warrants?", "score": 1, "replies": [{"body": "Great time to buy warrants because they're announcing the merge date any moment. \n\nThey initially said the merge would complete end of Q4 and they changed it to early Q1. I think there's a very high probability the announcement will be made sometime in January.\n\nYou'll be able to make nice returns on that spike.", "score": 2, "replies": []}]}, {"body": "So do they have an LOI or? Where’d you get your “assume q1”", "score": 1, "replies": [{"body": "https://www.prnewswire.com/news-releases/e2open-and-cc-neuberger-principal-holdings-i-announce-additional-175-million-fully-committed-common-stock-pipe-at-10-per-share-301197793.html\n\n\"the transaction is expected to close early in the first calendar quarter of 2021.  Management expects to provide a preliminary update of the unaudited financial results from its third fiscal quarter of 2021 in January\"", "score": 3, "replies": [{"body": "Hey boss. What do you think are the risks with the investigation from WeissLaw? Going to buy some of this at open", "score": 1, "replies": []}]}]}, {"body": "Terrible revenue growth for a software company. No thanks.", "score": 1, "replies": []}, {"body": "Reading the comments you got some right shit of people... I’m been in since $11.86 I bought at its literal peak. In a place where I’m questioning the stock even though I do believe it’ll grow. \nWhat are you thoughts since posting this 50 days ago?", "score": 1, "replies": []}]}
{"title": "Your YEXT big YOLO", "selftext": "  \n\n\n**A Value-Based A.I. Investment**  \n\n&#x200B;\n\nIn the era of growing small businesses and increasing brand presence, the internet appears to be a vast and difficult space to make a lasting impression on from a small business perspective. Small businesses may have insufficient entries in Google, Yahoo, and other search engines, where clients are likely to discover them. This is significant for these businesses, because if their information is inaccurate or missing, it will turn away potential customers. Yext, a growing New York based company under the ticker YEXT, provides a solution for modifying these entries and increasing the internet presence of small businesses.  YEXT shows promise as a growing long term stock due to its unique product line and hopeful financials.\n\nIn a sense, Yext is like Google but for enterprises that require more depth than Google can provide for them, and they actually use Google to help companies advertise and gain traction with consumer base using their APIs that are integrated with consumer platforms. The advertising industry is huge, as we’ve seen Google, Facebook, and Snapchat dominate simply off reaching consumers, and collecting their data. Yext bridges the gap between businesses and unstructured data of potential consumers and existing consumers, setting them up in a multi-billion dollar industry expected to continually increase for the future. \n\nTheir main product line includes Answers: a search engine, Listings: an advertising tool to get your company’s products onto multiple platforms, Pages: a tool that helps get your business at the top of every location search, Reviews: which helps you engage with customer feedback, and Knowledge Graph/Analytics which helps business owners see their customer interactions with their webpages and other online presence. Websites used to be everything for a business but now a business requires presence across multiple platforms and integration with every search engine, map, or social media. The more a business’ online presence is spread the more analytics you need too, and Yext is the amalgamation of the entire business’ internet presence. This cloud-based software is easy to use, and it’s used by several reputable companies; including huge fast food chains, travel companies, car manufacturers and even banks. \n\nYext solves the problem of particular consumer questions and connects the respective business with precisely what the consumer was looking for. Specific questions such as “wealth advisor near me who specializes in healthcare” (an example they used in their past annual report) will become increasingly easier to answer with the newest developments in Artificial Intelligence. The control of the ever-changing facts of a business are what enable it to spread its sales. Up-to-date and relevant information on every nook and cranny of the web has become a necessity, as convenience has become the most necessary commodity. Poor site experience is a huge detractor for the large majority of shoppers, and if businesses are able to retain this potential loss in customers they’d be willing to pay anything. Managing an online presence using one dashboard is going to be a very desirable service for all businesses, regardless of size. Yext links all the chains together in the cloud, for Google Assistant, Alexa, Siri, and even the Chinese WeChat, all services which are improving more and more in terms of their search capabilities and they’re growing in popularity.\n\n&#x200B;\n\nThe product or service a company provides is the most crucial aspect of a company’s success, and YEXT seems to deliver on its product. The solution requires a subscription that can be priced according to a business’ specific needs. YEXT does not seem to have as many recognizable competitors. Its main competitors, Birdeye and Chatmeter, are both private companies with no real news about an IPO anytime soon, while YEXT has been public on the NYSE for three years. From this perspective, YEXT maintains an advantage over its competitors due to it being more recognizable and financially stronger due to its valuation reaching over a billion after going public. However, a reported issue with the product is that listings may go back to normal after a contract with a small business terminates. This is justifiable, because a small business could use the service for a month and reap all benefits. To improve this aspect of the solution that is controversial, maybe a potential solution could be negotiating a minimum period the contract has to be active in order for listings not to revert when it is terminated. Despite this drawback, Yext Inc. has innovated in this niche field and is emerging as a frontrunner in back-end listing modification.\n\nNow that we have established that YEXT will likely be a frontrunner in structuring advertising data, we need to establish WHY this is a growing industry, as YEXT is heavily dependent on the growth of eCommerce and other forms of online and in person business. Without businesses, Yext will have no source of revenue so the expansion of commerce is critical to Yext’s revenue. Fortunately, eCommerce and small businesses are trending upwards, indicating a healthy future for YEXT. One way to examine if this industry is growing is to analyze advertisement spending, as more online businesses directly correlates to more money spent on advertising. The graph below regarding digital advertising spending clearly illustrates that online business is growing, with advertisement spending nearly doubling over the six years.\n\n&#x200B;\n\nhttps://preview.redd.it/plzhvnh7w1961.png?width=700&format=png&auto=webp&s=d7bc511f13b8c4b13206acfc3015bfe9d5303176\n\nAnother way to gauge the health of the industry YEXT is heavily dependent on is to take a look at the growing amount of transactions online. Transactions correlate to greater revenue generated via the internet and thus a greater need for YEXT to introduce smaller businesses to this growing market. The chart below from Statista portrays the growth of Mobile POS payments and Digital commerce over seven years, almost tripling in total volume. \n\n&#x200B;\n\nhttps://preview.redd.it/jydysim9w1961.png?width=700&format=png&auto=webp&s=dddd6ef6ea30f95dbe73d5f664a27193b31d6405\n\nOnce again this looks promising for YEXT, as their clients are primarily located in this sect of online business due to accurate data going hand in hand with more online sales. Furthermore, YEXT will be a solid pick for investors in the long term due to its growth along with a growing industry and its solid product. If you are interested in delving deeper into why eCommerce and online payments are growing, be sure to check out the Paypal/Square DD as well.\n\nOn their last 10k, Yext reported the following for their most recent compiled income statement:\n\n&#x200B;\n\nhttps://preview.redd.it/f8renwobw1961.png?width=700&format=png&auto=webp&s=d66290b3c437c25c5798b9130d55f3fdbbd25470\n\nAs you can see for the top line, there are plenty of positive signs. Revenue has grown by over $50M yearly from 2016 to 2019, and from 2019 to 2020 revenues grew by about $70M. So the indicator when it comes to sales is overwhelmingly signaling that this company is well-positioned to grow, especially in the near future. Gross profit margins are also great as the cost of the product itself isn’t much. The potential issues in the income statement show up as you go toward the bottom line. Operating expenses far outweigh gross profits so net profits are -30% despite gross profit margins being 75%. Breaking down Opex, you can see that about ⅔ of them go towards sales and marketing, which isn’t necessarily a bad thing as distributing your product can be a huge future investment, but it can be concerning for investors who want a product that “sells itself”. Despite this rather arbitrary requirement, the sales growth justifies the spending as it’s obviously working and eventually revenue should far outpace selling expenses. \n\nIn their 10k, they state that their sales expenses primarily had to do with more wages and a higher headcount of employees. As the company’s operations grow, they’ll need more employees to run it in an aggressive growth stage. Despite the constant revenue growth, the stock price has been diluted due to more underwriting in 2019. It may take a while to recover from all the extra supply that was brought into the market, but even if we see more financing in early stages, I personally wouldn’t be concerned as that’s a normal course of action for younger companies.\n\nA quick look at the financials indicates that YEXT is improving as a company over each year. Due to their relatively high amounts of investment, the EPS for the company has remained negative. The EPS was also a lot worse in previous years. However, don’t let this negative metric fool you, as the EPS has been trending positive since the first quarter of 2020. This indicates significant improvement, especially since the EPS hasn’t been improving much prior to 2020. The increase of the EPS is also supported by the increase of change in working capital from $2M to $4M. As for the rest of the cash flow statement, the negative values are primarily caused by the expansion of operations. This expansion of operations is indicated by the increasing total assets, which means that YEXT grew their assets via larger operations. Although the numbers may be negative temporarily, the expansion of operations allows YEXT to generate more revenue from operations and hopefully turn the direction of cash flows around. Constant reinvestment back into the company is a good sign as it indicates owner and shareholder confidence in the future prospect.\n\nFinally, delving into the 10Q provides reassuring prospects for the future health and growth of YEXT as a company. Looking at the breakdown of individual risks, YEXT looks to be relatively secure in the future. The main risks of the company are internal, and are not influenced by factors such as inflation and foreign currency fluctuations. To some, YEXT may appear risky due to its limited financial history and potential unprofitability due to it being relatively new. However, these risks will ultimately be insignificant, as the expansion of operations will soon be recovered by profits if YEXT maintains its current scale of growth that it has achieved in 2020.\n\nIn conclusion, YEXT will be a good pickup for many investors because the enterprise solutions industry overall has done very well, and Yext’s solutions are definitely a foray into the future of artificial intelligence combined with traditional SaaS. If you compare Yext to another company that has a similar premise, Twilio, you can see that Yext’s price/sales ratio is only 1/7th of Twilio’s. Of course, Twilio is far more overvalued and has had better sales growth than Yext this past year, but Yext isn’t a slouch in sales growth either as we’ve seen. Plus, they have far more potential than Twilio does as we’ve seen with their relatively small market cap of $2B. Both companies offer AI-based enterprise solutions, but Yext is just as good if not a better solution for the future as it has more applicability through a variety of businesses. If you want to see similar growth to what we’ve seen in company’s such as Twilio but feel as if you’ve missed the bus, don’t worry: we’ve got the pick for you. Yext is still 25% off its 52-wk high, and they are sure to surpass it with just one or two blowout positive ERs which will be in the books soon.", "id": "kpeb5t", "created_utc": 1609650670.0, "score": 30, "upvote_ratio": 0.76, "num_comments": 40, "comments": [{"body": "Tl:dr? Positions?", "score": 27, "replies": [{"body": "No Tl:dr and no positions. For that reason, I’m out.", "score": 16, "replies": []}]}, {"body": "[deleted]", "score": 69, "replies": [{"body": "And not a single mention of the moon. Fuck is this trash", "score": 33, "replies": [{"body": "Moon is history, if it aint Mars I dont wanna go", "score": 2, "replies": []}]}]}, {"body": "we already know to buy GME", "score": 26, "replies": [{"body": "but its been like 3 days since my last fix", "score": 2, "replies": []}]}, {"body": ".... It's a gamble that depends on their ability to make an actual profit,  growing revenue without growing their operating expenses. Since for now their operating expenses seems to be just growing on par with revenue, it's a no for me ATM. They are investing a lot, I get it .... but there is no free cashflow at the moment, so I'd wait another quarter or two. But thanks for the contribution of actual DD and good luck with your YOLO", "score": 9, "replies": [{"body": "Positions?", "score": 5, "replies": [{"body": "Are you stupid?", "score": 5, "replies": [{"body": "I think the right word is “retarded”, try to stick to the vocabulary and don’t be so rude.\nFck u.", "score": 5, "replies": []}]}]}]}, {"body": "I think this is a solid DD. Any DD with more than 50 words here WSB is a solid DD", "score": 25, "replies": [{"body": "The lack of 🚀🚀 is disturbing and make it imposible to trust. Ant retarded could have writte that, if there is no 🚀 and mooning words, what is this DD worth?", "score": 1, "replies": []}]}, {"body": "Many words. Won’t read but all in 20C 1/21", "score": 12, "replies": [{"body": "No 🚀, I don’t understand we must buy or he is just saying retarded shit.", "score": 1, "replies": []}]}, {"body": "I use yext and I think it’s utter shit", "score": 15, "replies": [{"body": "All the DD I need", "score": 13, "replies": []}, {"body": "Really? I use yext for my biz and really enjoyed it. \n\nWell worth the $500/year price tag.", "score": 11, "replies": []}]}, {"body": "Positions or ban", "score": 7, "replies": [{"body": "Hold them shits bruh stop tryna gamble and keep it as a nest egg growth stonk goddamn anyway 20 calls for april", "score": 5, "replies": [{"body": "You mean May?", "score": 1, "replies": []}]}]}, {"body": "why hasn't it been bought by google if its good?", "score": 3, "replies": [{"body": "why wasn’t CRM bought by Google if it was good", "score": 3, "replies": []}]}, {"body": "Stikes? Pleas don't say shares.", "score": 3, "replies": []}, {"body": "I like the fundamental picture here.\n\nBut....despite increasing revenue, their loss is increasing, **and the company is issuing a lot more stocks every year (50% more than 2018, a very significant dilution).**\n\nStock is cheap and company has potential, but the dilution each year may cause stock to continue stalling here.", "score": 3, "replies": []}, {"body": "Too many unfamiliar words", "score": 5, "replies": [{"body": "Too many words.", "score": 1, "replies": []}]}, {"body": "I barely read anything you said but it's $15 so it's worth a shot", "score": 2, "replies": []}, {"body": "The net income to revenue ratio is worsening as it \"grows\". This doesn't seem sustainable or in it's diseconomy zone. Basically until something changes I'm not seeing where this company will make the moon happen as Yext is a 14 year old company. It is not new. It is definitely not what I would consider \"young\".", "score": 2, "replies": []}, {"body": "No 🚀🚀🚀, No TLDR...what am u supposed to do?", "score": 3, "replies": [{"body": "All in PLTR", "score": 3, "replies": []}, {"body": "Spam positions or ban. And fck Op", "score": 0, "replies": []}]}, {"body": "Positions or Ban bitch and who do you work for", "score": 1, "replies": [{"body": "i’m unemployed i just write dds", "score": 1, "replies": [{"body": "Being unemployed is bullish", "score": 5, "replies": []}]}]}, {"body": "Do you work for yext? Sometimes I think small companies hire people to post gloriously about their companies", "score": 1, "replies": []}, {"body": "Fuck you idiot I’m not reading all that", "score": 1, "replies": []}, {"body": "Didn't read, what am I going all in on?", "score": 1, "replies": []}]}
{"title": "$PLTR is going to have a great week (proof FT. $TSLA)", "selftext": "[deleted]", "id": "kpthfc", "created_utc": 1609709240.0, "score": 74, "upvote_ratio": 0.79, "num_comments": 41, "comments": [{"body": "Solid dd", "score": 47, "replies": [{"body": "Thank you best sir", "score": 17, "replies": []}]}, {"body": "[you forgot the bollinger bands](https://imgur.com/a/KN8sfoC)", "score": 42, "replies": [{"body": "Lmao", "score": 12, "replies": []}]}, {"body": "[deleted]", "score": 33, "replies": [{"body": "well hopefully institutions are starting to buy at these prices I mean Morgan Stanley was thinking about valuing PLTR at 41B 2 years ago in 2018 but they changed their target to below 30B market cap in their last \"downgrade\"\n\n&#x200B;\n\nOur current market cap is 41b", "score": 11, "replies": [{"body": "Can someone explain why Morgan Stanley keeps downgrading PLTR but they are in top 10 institutional holdings???", "score": 1, "replies": [{"body": "They want to sell puts and also buy more shares if it dips low enough (especially after the lockup)", "score": 1, "replies": [{"body": "They are currently holding 3M shares at DPO price. They keep downgrading it but increase PT up to $17. I’m hella confused.", "score": 1, "replies": []}]}, {"body": "I don't believe the people at Morgan Stanley who do analyst research are the same people at Morgan Stanley who do asset management.", "score": 1, "replies": [{"body": "Miscommunication between 2 departments??!! Downgrade stocks you own... hmmm 🤔", "score": 1, "replies": [{"body": "Mm nah, you're right. It's definitely Morgan Stanley that's fucked it and not us really not understanding what we're talking about.  \n\nHere's a link to a PDF that actually explains it. https://www.google.com/url?sa=t&source=web&rct=j&url=https://media2.mofo.com/documents/frequently-asked-questions-about-separation-of-research-and-investment-banking.pdf&ved=2ahUKEwjUwYHm24HuAhUDjlkKHeDLBLoQFjADegQIDRAB&usg=AOvVaw3dHaMnax3AqzitQbR9GOHo \n\nEdit: if you weren't interested in clicking, \"conflict of interest\" about sums it up", "score": 1, "replies": []}]}]}]}]}, {"body": "Hey, watch it...I resemble that comment. 😆 Agree appears like some down action before...🚀🌚.", "score": 2, "replies": []}, {"body": "I always thought it was the unproven software company with not a lot of customers, a niche market and high sales cost as the reason tutes weren't buying..... Huh", "score": 1, "replies": []}, {"body": "Blackcock just filed that it initiated a position of 30 mil shares what more do you want?", "score": 1, "replies": []}]}, {"body": "We’re fucked.", "score": 21, "replies": [{"body": "Why", "score": -7, "replies": [{"body": "You must be new here we just dump in money, we don’t ask questions", "score": 4, "replies": []}, {"body": "That’s nice downward channel forming. Looks like an average down.", "score": 0, "replies": [{"body": "May I remind you what happened to tesla?", "score": 5, "replies": [{"body": "Tldr: 🚀🌝", "score": 7, "replies": []}]}]}]}]}, {"body": "Good shitpost mate!", "score": 4, "replies": []}, {"body": "Lol I'm long shares at too high of a price and would love to see this... but honestly posts like this seem desperate. You cant just compare these crayon drawings to a snapshot of TSLA crayon drawings and say \"See TSLA did it!\".\n\nBut I do hope you are right!", "score": 3, "replies": []}, {"body": "I’m hanging tight.  Still confident in the future.  Maybe it’s sideways and waiting for a catalyst, but I think it’s a short term thing since the selloff was broad.", "score": 2, "replies": []}, {"body": "Down 2500 on my calls expiring Friday. I shed a tear when I read your post", "score": 4, "replies": [{"body": "that’s why you need to buy shares, instead of calls I sold you 😜", "score": 1, "replies": []}]}, {"body": "Ark dump their posting on $PLTR and I think shares lockup will expire in about 6 weeks", "score": 0, "replies": [{"body": "They dumped on dec 29. Bought more on dec 31 🚀🚀🚀", "score": 9, "replies": []}, {"body": "They have a target percentage for their portfolio and are buying/selling according to this.\n\nHow do you think institutions make these decisions? They sit around a table, do lines and one guys phone buzzes with a volatility alert and then they snap paper hand their stocks?\n\nWhat is actually in your head mate?", "score": 5, "replies": []}, {"body": "There Position was very small. They also buy low and sell high All the time.", "score": 1, "replies": []}]}, {"body": "drawing an arrow going up on your screen does not mean the stock will go up", "score": 1, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Damn why didn't i think of that. I'm in!", "score": 1, "replies": []}]}, {"body": "Did you look at the second image yet", "score": 6, "replies": [{"body": "Ive seen it, can you explain the correlation", "score": 4, "replies": [{"body": "Both r meme stocks. Musk & Karp are friends with Thiel. That’s enough correlation I think 🚀🚀🚀", "score": 5, "replies": []}]}]}]}, {"body": "You  may be retards, but who else knows TA is bullshit and stocks are for gamblers?", "score": 0, "replies": []}, {"body": "Bullish wedge", "score": 1, "replies": []}, {"body": "Or it won't and you seriously need to look at all the other mooning stocks out there that just don't happen to have a LOTR-themed named; or sold you the videogaemez when you were a kid.", "score": 1, "replies": []}, {"body": "tHe ChArTs MaTcH\n\nRetarded, the top is in now.", "score": 1, "replies": []}, {"body": "love the way you draw an upward move in red, it really highlights your confidence", "score": 1, "replies": []}]}
